[
  {
    "title": "Carney Pitched Trump on Energy Alliance, Including Keystone XL",
    "description": "Canadian Prime Minister Mark Carney pitched deeper cooperation with the US on energy, including a possible revival of the Keystone XL pipeline project, in his meeting with President Donald Trump on Tuesday.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-pitched-trump-on-energy-alliance-including-keystone-xl",
    "timestamp": "2025-10-08T19:25:47Z"
  },
  {
    "title": "Carney pitched Trump on energy alliance, including Keystone XL",
    "description": "Mark Carney pitched deeper cooperation with the U.S. on energy, including reviving Keystone XL, in his meeting with Donald Trump. Read here",
    "link": "https://financialpost.com/commodities/energy/carney-pitched-trump-energy-alliance-keystone-xl",
    "timestamp": "2025-10-08T19:25:47Z"
  },
  {
    "title": "Jensen Huang says Trump's H-1B changes would've prevented his family from immigrating (Jaures Yip/CNBC)",
    "description": "Jaures Yip / CNBC:\nJensen Huang says Trump's H-1B changes would've prevented his family from immigrating … Nvidia CEO Jensen Huang said Wednesday that his family's immigration to the U.S. “would not have been possible” with the Trump administration's current …",
    "link": "https://www.memeorandum.com/251008/p99",
    "timestamp": "2025-10-08T19:25:03Z"
  },
  {
    "title": "Residents of border towns relieved by quiet amid record-low migrant crossings",
    "description": "The chief of the Border Patrol says he wants “operational control” of the border, but few people are attempting to cross now amid the Trump administration’s crackdown on immigration.",
    "link": "https://www.nbcnews.com/news/us-news/residents-border-towns-relieved-quiet-record-low-migrant-crossings-rcna236200",
    "timestamp": "2025-10-08T19:23:16Z"
  },
  {
    "title": "'I'm astonished': Legal expert floored by 'remarkable developments' in Comey case",
    "description": "Former FBI Director James Comey pleaded not guilty in a Virginia courtroom on Wednesday after being indicted by a federal grand jury on two charges: making a false statement to Congress and obstructing a congressional proceeding. And with a trial set for Jan.…",
    "link": "https://www.rawstory.com/jim-comey-2674166704/",
    "timestamp": "2025-10-08T19:23:02Z"
  },
  {
    "title": "Country Star Says He’s ‘Embarrassed And Scared’ By Response To Song That Triggered MAGA",
    "description": "“I wasn't speaking as a politician or some greater-than-thou asshole, just a 29 year old man who is just as confused as everyone else,” Zach Bryan said.",
    "link": "https://www.huffpost.com/entry/zach-bryan-responds-song-maga-backlash_n_68e68e5ae4b0d98d3e531940",
    "timestamp": "2025-10-08T19:22:30Z"
  },
  {
    "title": "Jasmine Crockett’s Latest Nickname For Donald Trump Is A Hit With X",
    "description": "During a recent appearance on MSNBC's The Weekend: Primetime, the Texas Democrat didn't hold back when talking about Donald Trump and how he is putting on a masterclass in ruining the lives of Americans.",
    "link": "https://hiphopwired.com/2862852/jasmine-crockett-calls-donald-trump-nepo-baby-reactions/",
    "timestamp": "2025-10-08T19:22:02Z"
  },
  {
    "title": "For Substack, The Free Press’ Sale Is a Tenuous Victory",
    "description": "When the news broke Monday that Paramount Skydance had acquired The Free Press for $150 million, Substack cofounders Hamish McKenzie and Chris Best took to a livestream to celebrate.\n\nThe Free Press, perhaps more than any other multiauthor publication on the …",
    "link": "https://www.adweek.com/media/substack-free-press-paramount-cbs-sale-tenuous-victory-onbackground/",
    "timestamp": "2025-10-08T19:19:50Z"
  },
  {
    "title": "Federal government shutdown grinds into a second week, but quiet talks emerging",
    "description": "WASHINGTON: Tours at the US Capitol have come to a standstill. The House is keeping its doors closed, while the Senate repeated its loop on Wednesday (Oct 8) of failed votes on competing bills to reopen the government,",
    "link": "https://www.channelnewsasia.com/world/federal-government-shutdown-grinds-second-week-quiet-talks-emerging-5390056",
    "timestamp": "2025-10-08T19:16:57Z"
  },
  {
    "title": "Mamdani education plan would focus on helping NYC homeless students",
    "description": "NEW YORK — Zohran Mamdani, the Democratic front-runner in the New York City mayoral race, said Wednesday he wants to double the size of a program for...",
    "link": "https://www.nydailynews.com/2025/10/08/mamdani-education-plan-would-focus-on-helping-nyc-homeless-students/",
    "timestamp": "2025-10-08T19:16:00Z"
  },
  {
    "title": "What American voters really think of the revenge agenda",
    "description": "What American voters really think of the revenge agenda\nA third of Republicans support deporting citizens who disagree with Donald Trump\nMost presidential hopefuls make hokey promises to fix the economy, heal divisions or restore America’s promise. Donald Tru…",
    "link": "https://biztoc.com/x/86c7efc8f2758207",
    "timestamp": "2025-10-08T19:15:16Z"
  },
  {
    "title": "Goldman Banker Exits After Posts Against Trump, Spain’s Sánchez",
    "description": "Goldman Sachs Group Inc.’s co-head of Spain and Portugal is leaving the bank after he wrote scathing political articles about US President Donald Trump and Spanish Prime Minister Pedro Sánchez.",
    "link": "https://www.livemint.com/companies/news/goldman-banker-exits-after-posts-against-trump-spain-s-snchez-11759950795883.html",
    "timestamp": "2025-10-08T19:13:15Z"
  },
  {
    "title": "Chicago sees National Guard arrive, could be in Memphis soon",
    "description": "Trump has called Chicago a “hellhole” of crime despite police statistics showing significant drops in crime, including homicides.",
    "link": "https://www.wmur.com/article/chicago-and-memphis-national-guard-troops/68915293",
    "timestamp": "2025-10-08T19:11:30Z"
  },
  {
    "title": "Kyle Mooney Did A Solid For An SNL Co-Star When He Was A New Cast Member, And Now James Austin Johnson Has Continued The Tradition",
    "description": "I hope this tradition lasts a lifetime.",
    "link": "https://www.cinemablend.com/television/kyle-mooney-did-co-star-solid-as-new-cast-member-james-austin-johnson-continued-tradition",
    "timestamp": "2025-10-08T19:11:09Z"
  },
  {
    "title": "CTU Denounces President Trump’s Targeting of Chicago’s Mayor",
    "description": "In response to Donald Trump calling for the arrest of Brandon Johnson, Chicago Teachers Union President Stacy Davis Gates cited the city’s 1850 council resolution calling on local police to not aid and abet fugitive slave patrols, and denounced Trump’s target…",
    "link": "https://www.commondreams.org/newswire/ctu-denounces-president-trumps-targeting-of-chicagos-mayor",
    "timestamp": "2025-10-08T19:10:57Z"
  },
  {
    "title": "Ted Cruz revives push to make it easier to sue the government for censorship amid Kimmel return",
    "description": "Sen. Ted Cruz said during an interview published Wednesday that he hoped for bipartisan support for a new bill combatting government censorship following Jimmy Kimmel's suspension.",
    "link": "https://www.foxnews.com/media/censorship-wrong-cruz-revives-push-bill-make-easier-sue-government-amid-kimmel-return",
    "timestamp": "2025-10-08T19:10:48Z"
  },
  {
    "title": "Pam Bondi More 'Reprehensible' Than Nixon's Attorney General: Ex-White House Lawyer",
    "description": "Former Trump insider Ty Cobb said today's Department of Justice is looking worse than the Watergate era.",
    "link": "https://www.huffpost.com/entry/pam-bondi-reprehensible-nixon-attorney-general_n_68e6851fe4b0d98d3e53114a",
    "timestamp": "2025-10-08T19:10:27Z"
  },
  {
    "title": "Senate GOP Nukes Biden-Era Rule Smothering Coal Production",
    "description": "The Senate voted Wednesday to blow up a Biden-era rule that locked up thousands of acres for future coal leasing in the Powder River Basin.",
    "link": "https://dailycaller.com/2025/10/08/senate-gop-nukes-biden-era-rule-smothering-coal-production/",
    "timestamp": "2025-10-08T19:09:50Z"
  },
  {
    "title": "Donald Trump designates Antifa as 'terrorist organization' but is it responsible for Charlie Kirk assassination",
    "description": "U.S. President Donald Trump vowed to take action against left-wing groups he accuses of fomenting violence after the murder of conservative activist Charlie Kirk in September.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-designates-antifa-as-terrorist-organization-but-is-it-responsible-for-charlie-kirk-assassination/articleshow/124397488.cms",
    "timestamp": "2025-10-08T19:08:21Z"
  },
  {
    "title": "IRS to furlough almost half its workforce under contingency plan for government shutdown",
    "description": "Last week Trump said roughly 750,000 federal workers nationwide were expected to be furloughed across agencies, with some potentially fired.",
    "link": "https://fortune.com/2025/10/08/irs-to-furlough-almost-half-its-workforce-under-contingency-plan-for-government-shutdown/",
    "timestamp": "2025-10-08T19:06:12Z"
  },
  {
    "title": "SEN TAMMY DUCKWORTH: The National Guard swore an oath to the Constitution, not Donald Trump",
    "description": "A military veteran and senator criticizes President Donald Trump's deployment of National Guard troops to American cities including Chicago and Los Angeles.",
    "link": "https://www.foxnews.com/opinion/sen-tammy-duckworth-national-guard-swore-oath-constitution-not-donald-trump",
    "timestamp": "2025-10-08T19:05:50Z"
  },
  {
    "title": "SEN TAMMY DUCKWORTH: Trump’s domestic troop deployments betray our military and nation",
    "description": "A military veteran and senator criticizes President Donald Trump's deployment of National Guard troops to American cities including Chicago and Los Angeles.",
    "link": "https://www.foxnews.com/opinion/sen-tammy-duckworth-trumps-domestic-troop-deployments-betray-military-nation",
    "timestamp": "2025-10-08T19:05:50Z"
  },
  {
    "title": "The New York Prison System Is Facing a Potential Disaster “Unprecedented Since Attica”",
    "description": "I'm serving my 16th year for manslaughter. I'm a credible witness to the ongoing understaffing issue.",
    "link": "https://slate.com/news-and-politics/2025/10/new-york-prison-system-disaster-attica.html",
    "timestamp": "2025-10-08T19:04:57Z"
  },
  {
    "title": "Nvidia’s Jensen Huang seems to disagree with Trump on this big AI topic",
    "description": "The Nvidia CEO says he doesn’t think the U.S. is far ahead of China in AI development, while President Donald Trump has suggested no other country poses a serious threat to the U.S.’s lead.",
    "link": "https://biztoc.com/x/3766d46f6f6a3a38",
    "timestamp": "2025-10-08T19:04:44Z"
  },
  {
    "title": "Polymarket founder Coplan joins billionaires club after NYSE parent's investment: Report",
    "description": "The prediction market platform has come a long way after regulators in the United States banned Polymarket from serving US clients in 2022.",
    "link": "https://cointelegraph.com/news/polymarket-founder-coplan-billionaires-nyse-investment",
    "timestamp": "2025-10-08T19:04:34Z"
  },
  {
    "title": "Jensen Huang says Trump's H-1B changes would've prevented his family from immigrating",
    "description": "President Donald Trump announced in September that employers would have to pay a $100,000 fee for each H-1B visa.",
    "link": "https://biztoc.com/x/0c911e2f36e5eca7",
    "timestamp": "2025-10-08T19:04:23Z"
  },
  {
    "title": "Trump threatens to invoke Insurrection Act. Here's why it's a controversial move",
    "description": "U.S. President Donald Trump has threatened to invoke the Insurrection Act, which has not been utilized by a U.S. president in more than three decades. Here's a look at why that possibility concerns local officials and some legal analysts.",
    "link": "https://www.cbc.ca/news/world/us-trump-insurrection-act-threat-9.6931273",
    "timestamp": "2025-10-08T19:01:45Z"
  },
  {
    "title": "3598 - Trump Calls for Political Arrests; Urgent 2025 Elections w/ Daniel Nichanian",
    "description": "It's Hump Day on the Majority Report On Today's Show: Trump posts to Truth Social that Illinois Governor JB Pritzker and Chicago Mayor Brandon Johnson should be imprisoned for hindering ICE agents. Speaker of the House Mike Johnson (R-LA) co-signs Donald Trum…",
    "link": "https://majorityfm.libsyn.com/3598-trump-calls-for-political-arrests-urgent-2025-elections-w-daniel-nichanian",
    "timestamp": "2025-10-08T19:01:00Z"
  },
  {
    "title": "Virginia Dem AG Candidate Cancels Fundraiser Amid Text Message Firestorm",
    "description": "\"Jones had not held a public event since Friday night, when he answered questions from Tyler Englander at the Richmond ABC affiliate.\"\nThe post Virginia Dem AG Candidate Cancels Fundraiser Amid Text Message Firestorm first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/virginia-dem-ag-candidate-cancels-fundraiser-amid-text-message-firestorm/",
    "timestamp": "2025-10-08T19:00:34Z"
  },
  {
    "title": "'We will get an even better deal,' Carney says after Oval Office meeting with Trump",
    "description": "Prime Minister Mark Carney said Wednesday Canadian and American officials are currently \"negotiating terms\" of a deal on tariffs a day after he met with the U.S. president to try and bring the trade war to a close — and Canada will come out ahead when the two…",
    "link": "https://www.cbc.ca/news/politics/carney-even-better-deal-9.6932036",
    "timestamp": "2025-10-08T19:00:32Z"
  },
  {
    "title": "Soccer match between Argentina, Puerto Rico moved from Chicago to Florida amid immigration crackdown",
    "description": "A soccer match between Argentina and Puerto Rico, originally scheduled for next week in Chicago, has been relocated to Florida amid the immigration crackdown in the city, a person familiar with the decision told The Associated Press on Wednesday. The friendly…",
    "link": "https://sports.yahoo.com/article/soccer-match-between-argentina-puerto-190028337.html",
    "timestamp": "2025-10-08T19:00:28Z"
  },
  {
    "title": "Alaska Republican Ousted By Dem in Shock Election Defeat...",
    "description": "The mayoralty in Fairbanks, Alaska, has been held by a Republican for years.",
    "link": "https://www.newsweek.com/alaska-fairbanks-mayor-election-democrat-republican-10844700",
    "timestamp": "2025-10-08T19:00:04Z"
  },
  {
    "title": "Feds make arrest in connection with devastating Palisades Fire in Los Angeles",
    "description": "The federal government on Wednesday announced the arrest of a 29-year-old male in connection with the origin of the devastating Palisades Fire in Los Angeles.Acting U.S. Attorney Bill Essayli announced on X the arrest of Jonathan Rinderknecht \"on a criminal c…",
    "link": "https://www.theblaze.com/news/feds-make-arrest-in-connection-with-devastating-palisades-fire-in-los-angeles",
    "timestamp": "2025-10-08T19:00:00Z"
  },
  {
    "title": "Guyana Gains French Support Amid U.S. Pressure on Venezuela",
    "description": "Guyana has strengthened military cooperation with France to safeguard the oil-rich Essequibo region, escalating tensions with Venezuela just as the United States expands maritime strikes on vessels linked to Caracas. The defense announcement follows new repor…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Guyana-Gains-French-Support-Amid-US-Pressure-on-Venezuela.html",
    "timestamp": "2025-10-08T19:00:00Z"
  },
  {
    "title": "‘So Many People Dislike Her’: Dan Turrentine Goes Scorched Earth On Katie Porter After Interview Meltdown",
    "description": "Dan Turrentine criticized former Democratic California Rep. Katie Porter on Wednesday’s “The Morning Meeting” following a resurfaced September interview.",
    "link": "https://dailycaller.com/2025/10/08/so-many-people-dislike-her-dan-turrentine-goes-scorched-earth-on-katie-porter-after-interview-meltdown/",
    "timestamp": "2025-10-08T18:59:52Z"
  },
  {
    "title": "Proof-of-life video of Bipin Joshi released",
    "description": "KATHMANDU: A video showing Nepali hostage Bipin Joshi, who was abducted from Kibbutz Alumim on October 7, 2023, has been made public at the request of his family—two years after his capture. The footage, which was previously withheld under Israeli censorship,…",
    "link": "https://english.khabarhub.com/2025/09/500526/",
    "timestamp": "2025-10-08T18:59:37Z"
  },
  {
    "title": "Speaker Johnson Walks Back Support For Bill to Pay Military Members During Shutdown",
    "description": "Mike Johnson walked back his willingness to hold a standalone vote to keep military members paid during the partial federal government shutdown.\nThe post Speaker Johnson Walks Back Support For Bill to Pay Military Members During Shutdown first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/speaker-johnson-walks-back-support-for-bill-to-pay-military-members-during-shutdown/",
    "timestamp": "2025-10-08T18:57:30Z"
  },
  {
    "title": "Part IV – Covering Up the Biggest Political Scandal in U.S. History",
    "description": "Thankfully, people in Washington DC are finally starting to realize the full scale of the Obama surveillance system. All of the evidence and datapoints -released and yet to surface- flow in one direction. Even the professionally reluctant are starting to admi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4345117/posts",
    "timestamp": "2025-10-08T18:56:42Z"
  },
  {
    "title": "Tech leader John Ruffolo hopeful Canada will take digital sovereignty seriously",
    "description": "TORONTO — The trade war has awoken Canada to the need to protect its digital sovereignty and for the first time in awhile, John Ruffolo is optimistic the country will finally do something about it. “I was losing hope over the last couple of years because I wa…",
    "link": "https://financialpost.com/pmn/tech-leader-john-ruffolo-hopeful-canada-will-take-digital-sovereignty-seriously-2",
    "timestamp": "2025-10-08T18:56:00Z"
  },
  {
    "title": "Man, 29, Arrested for 'Malicious Destruction' for '25 Palisades Fire",
    "description": "Authorities in California charged a 29-year-old man with \"malicious destruction' for allegedly starting a deadly fire that erupted into the most destructive blaze in Los Angeles history and destroyed much of the wealthy Pacific Palisades neighborhood, officia…",
    "link": "https://freerepublic.com/focus/f-news/4345116/posts",
    "timestamp": "2025-10-08T18:55:53Z"
  },
  {
    "title": "Gov. Maura Healey said Trump’s National Guard deployments are a ‘waste of resources’",
    "description": "Gov. Maura Healey said sending the National Guard to major U.S. cities is a “waste of resources,” but the first-term Democrat declined to say if she is coordinating with any local officials or preparing any action in case President Donald Trump tries to deplo…",
    "link": "https://www.bostonherald.com/2025/10/08/gov-maura-healey-said-trumps-national-guard-deployments-are-a-waste-of-resources/",
    "timestamp": "2025-10-08T18:55:40Z"
  },
  {
    "title": "Austria Stalls Russia Sanctions Over Raiffeisen Compensation",
    "description": "Austria is delaying the European Union’s latest Russia sanctions package, demanding the bloc unfreeze assets linked to tycoon Oleg Deripaska to compensate one of its banks, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/austria-stalls-russia-sanctions-over-raiffeisen-compensation",
    "timestamp": "2025-10-08T18:55:16Z"
  },
  {
    "title": "Top Democrats Just Dropped A Bombshell Accusation About Trump's Mental State, But The White House Has Consistently Denied It",
    "description": "\"This is a man who’s suffering dementia.\"",
    "link": "https://www.buzzfeed.com/edmazza/jb-pritzker-trump-dementia",
    "timestamp": "2025-10-08T18:55:16Z"
  },
  {
    "title": "Trump administration officials seriously discussing invoking Insurrection Act, sources say",
    "description": "A decision is not expected to be imminent, one source said, but debate within the administration has shifted recently to more deeply exploring how and when the act might be invoked.",
    "link": "https://www.nbcnews.com/politics/national-security/trump-officials-insurrection-act-national-guard-deployment-sources-rcna236194",
    "timestamp": "2025-10-08T18:55:05Z"
  },
  {
    "title": "Jensen Huang says Trump's H-1B changes would've prevented his family from immigrating",
    "description": "President Donald Trump announced in September that employers would have to pay a $100,000 fee for each H-1B visa.",
    "link": "https://www.cnbc.com/2025/10/08/jensen-huang-h1b-immigration-trump.html",
    "timestamp": "2025-10-08T18:54:39Z"
  },
  {
    "title": "Watch Live: Trump Hosts Roundtable On Antifa As Race To Dismantle Radical Left NGOs Accelerates",
    "description": "Watch Live: Trump Hosts Roundtable On Antifa As Race To Dismantle Radical Left NGOs Accelerates\n \nPresident Donald Trump is hosting a White House roundtable with independent journalists who have experienced Antifa's violence firsthand. In addition to journali…",
    "link": "https://biztoc.com/x/b655d22ef5acb7c4",
    "timestamp": "2025-10-08T18:53:02Z"
  },
  {
    "title": "South Bow explores increasing crude exports after Carney raises Keystone XL revival with Trump",
    "description": "South Bow Ltd. SOBO-T says it is exploring ways to leverage existing oil pipeline corridors to increase crude exports, in the wake of Prime Minister Mark Carney raising the prospect of reviving the long-dead Keystone XL pipeline project in discussions with Pr…",
    "link": "https://biztoc.com/x/9323b8b95bd24102",
    "timestamp": "2025-10-08T18:53:02Z"
  },
  {
    "title": "Most Americans think Trump is trying to exercise more power than previous presidents",
    "description": "49% of U.S. adults say Trump is trying to exercise more presidential power than previous presidents and that this is bad for the country.\nThe post Most Americans think Trump is trying to exercise more power than previous presidents appeared first on Pew Resea…",
    "link": "http://www.pewresearch.org/short-reads/2025/10/08/most-americans-think-trump-is-trying-to-exercise-more-power-than-previous-presidents/",
    "timestamp": "2025-10-08T18:52:28Z"
  },
  {
    "title": "In voice notes from Gaza, Majeda chronicles her family's displacement",
    "description": "The war in Gaza may be ending soon, but those displaced by Israel's bombardment and invasion know their suffering is far from over.",
    "link": "https://www.abc.net.au/news/2025-10-09/the-journey-of-displacement-from-gaza-city/105776430",
    "timestamp": "2025-10-08T18:52:07Z"
  },
  {
    "title": "Zach Bryan Responds After Critics Call His Song, ‘Bad News,’ Anti-American",
    "description": "Zach Bryan is responding to the backlash over his song \"Bad News,\" which some listeners claim is critical of ICE and is disrespectful to the country.",
    "link": "https://www.today.com/popculture/music/zach-bryan-song-bad-news-controversy-rcna236420",
    "timestamp": "2025-10-08T18:51:10Z"
  },
  {
    "title": "Bad Bunny is super popular. He's the most-streamed male artist in the world. So why has he got MAGA's tits in a tangle? Headline answers its own question [Followup]",
    "description": "Bad Bunny is super popular. He's the most-streamed male artist in the world. So why has he got MAGA's tits in a tangle? Headline answers its own question",
    "link": "https://www.fark.com/comments/13838446/Bad-Bunny-is-super-popular-Hes-most-streamed-male-artist-in-world-So-why-has-he-got-MAGAs-tits-in-a-tangle-Headline-answers-its-own-question",
    "timestamp": "2025-10-08T18:50:04Z"
  },
  {
    "title": "Team Trump's clashes with the faith community go from bad to worse (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTeam Trump's clashes with the faith community go from bad to worse  —  The political world is overdue for a conversation about the severity of the conflicts between the Republican administration and the faith community.  —  On the first f…",
    "link": "https://www.memeorandum.com/251008/p95",
    "timestamp": "2025-10-08T18:50:00Z"
  },
  {
    "title": "Democrats Huff About Trump’s DOJ Hours After Revelations Show Biden Agents Spied On Senators",
    "description": "Suddenly Democrats who have long turned a blind eye to corruption within the Department of Justice (DOJ) are now worried about its weaponization.Their timing could not be more disingenuous; it came during a hearing Tuesday, less than 24 hours after clear evid…",
    "link": "https://freerepublic.com/focus/f-news/4345114/posts",
    "timestamp": "2025-10-08T18:48:53Z"
  },
  {
    "title": "Democrats Flip Mayoral Seat Held By Republicans For Almost A Decade",
    "description": "Democrat Mindy O'Neall flipped the Fairbanks, Alaska, mayoral seat Tuesday night for the first time in a decade, ousting incumbent, conservative David Pruhs.",
    "link": "https://dailycaller.com/2025/10/08/democrats-flip-fairbanks-alaska-mayor-david-pruhs-mindy-oneall/",
    "timestamp": "2025-10-08T18:48:51Z"
  },
  {
    "title": "Meeting Our Angry Moment With Fellowship and Laughter",
    "description": "One strangely hot November afternoon, I waited for my elementary-school-aged kids to arrive at their bus stop. The quiet in our rural area was eerie. It captured the mood in the days after a national election that no one in my little community yet knew exactl…",
    "link": "https://tomdispatch.com/maga-men-rage-and-the-road-to-nowhere/",
    "timestamp": "2025-10-08T18:47:12Z"
  },
  {
    "title": "Israel is aware that Hamas may be unable to locate bodies of all slain hostages, Israeli sources reportedly say",
    "description": "Sources told CNN that the number of slain hostages whose whereabouts are unknown is between seven and 15, and that it is unclear whether this will affect the cease-fire negotiations",
    "link": "https://www.haaretz.com/israel-news/2025-10-08/ty-article/report-israel-aware-hamas-may-be-unable-to-locate-bodies-of-all-slain-hostages/00000199-c518-d7d2-add9-f5f9ba7e0000",
    "timestamp": "2025-10-08T18:46:43Z"
  },
  {
    "title": "US and Israel upgrade presence at Gaza talks after Hamas hands over hostage swap list",
    "description": "CAIRO (Reuters) -The most promising effort yet to end the war in Gaza was bolstered as senior figures from Israel and the United States joined the...",
    "link": "https://www.yahoo.com/news/articles/us-israel-upgrade-presence-gaza-184602223.html",
    "timestamp": "2025-10-08T18:46:02Z"
  },
  {
    "title": "Fed minutes: Most officials supported further rate cuts as worries about jobs rose",
    "description": "Most members of the Federal Reserve’s interest-rate setting committee supported further reductions to its key interest rate this year, minutes from last month’s meeting showed",
    "link": "https://abcnews.go.com/US/wireStory/fed-minutes-officials-supported-rate-cuts-worries-jobs-126337707",
    "timestamp": "2025-10-08T18:45:54Z"
  },
  {
    "title": "Democrats Are Putting Shutdown Politics Ahead of Essential Federal Workers, Johnson Says",
    "description": "House Speaker Mike Johnson, R-La., on Wednesday denounced Democrats for what he called putting politics ahead of the well-being of essential federal employees, who are... Read More\nThe post Democrats Are Putting Shutdown Politics Ahead of Essential Federal Wo…",
    "link": "https://www.dailysignal.com/2025/10/08/democrats-are-putting-politics-ahead-essential-federal-workers-johnson-says/",
    "timestamp": "2025-10-08T18:45:17Z"
  },
  {
    "title": "Georgia Democratic Sen. Jon Ossoff raises $12 million for 2026 reelection",
    "description": "Georgia Sen. Jon Ossoff says he raised more than $12 million from July through September",
    "link": "https://abcnews.go.com/Politics/wireStory/georgia-democratic-sen-jon-ossoff-raises-12-million-126339121",
    "timestamp": "2025-10-08T18:45:10Z"
  },
  {
    "title": "Jane Goodall's Final Wish: Blast Trump, Musk And Putin To Space",
    "description": "It's like the opposite of naming your dream dinner party guests. The conversation then turned to aggression in chimpanzees and whether the men she'd named were \"alphas.\"",
    "link": "https://www.ibtimes.com/jane-goodalls-final-wish-blast-trump-musk-putin-space-3786209",
    "timestamp": "2025-10-08T18:45:09Z"
  },
  {
    "title": "Professor who teaches about antifascism moves to Europe after death threats (Anumita Kaur/Washington Post)",
    "description": "Anumita Kaur / Washington Post:\nProfessor who teaches about antifascism moves to Europe after death threats  —  A Rutgers University professor who wrote a book about antifa received the threats after he commented on President Donald Trump designating the move…",
    "link": "https://www.memeorandum.com/251008/p92",
    "timestamp": "2025-10-08T18:45:03Z"
  },
  {
    "title": "Trump's 'Tacky' Oval Office Redesign Slammed for 'Overload of Gold' as Critics Rage 'Waste of Money' Following Prez's Latest White House Update",
    "description": "Donald Trump is clearly a fan of gold, and the Oval Office is proof of that... even if his critics find it revolting.",
    "link": "https://radaronline.com/p/trump-tacky-oval-office-redesigned-gold-white-house-update/",
    "timestamp": "2025-10-08T18:45:00Z"
  },
  {
    "title": "Pritzker Dares Trump to ‘Come and Get Me’ In Cozy MSNBC Interview",
    "description": "Illinois Gov. JB Pritzker challenged President Trump to \"come and get me\" after the president called for Pritzker and Chicago Mayor Brandon Johnson to be jailed\nThe post Pritzker Dares Trump to ‘Come and Get Me’ In Cozy MSNBC Interview first appeared on Media…",
    "link": "https://www.mediaite.com/media/pritzker-dares-trump-to-come-and-get-me-in-cozy-msnbc-interview/",
    "timestamp": "2025-10-08T18:44:54Z"
  },
  {
    "title": "Why the pro-Palestinian left is wrong to reject Trump's Gaza peace plan",
    "description": "U.S. President Donald Trump's 20-point plan to end Israel's war in Gaza shouldn't be misconstrued as an all-encompassing peace plan, because it's not. It's a cease-fire deal, and the only other option on the table is endless slaughter",
    "link": "https://www.haaretz.com/israel-news/2025-10-08/ty-article/.premium/why-the-pro-palestinian-left-is-wrong-to-reject-trumps-gaza-peace-plan/00000199-c446-d7d2-add9-f5ff75b70000",
    "timestamp": "2025-10-08T18:42:14Z"
  },
  {
    "title": "Anti-Hamas Gaza militias reject terror group, declare support for Trump’s peace plan",
    "description": "Support for a peace plan grows as negotiators work in Cairo to seal the deal, with Gazan militias backing Trump’s proposal amid fighting and calls for new local governance.",
    "link": "https://www.foxnews.com/world/anti-hamas-gaza-militias-reject-terror-group-declare-support-trumps-peace-plan",
    "timestamp": "2025-10-08T18:42:04Z"
  },
  {
    "title": "California school district trustee opens up on leading resolution to oppose trans athletes in girls' sports",
    "description": "California's largest high school district joined 16 institutions passing resolutions against state law allowing transgender athletes in girls' sports amid federal pressure.",
    "link": "https://www.foxnews.com/sports/california-school-board-member-opens-up-leading-resolution-oppose-trans-athletes-girls-sports",
    "timestamp": "2025-10-08T18:41:06Z"
  },
  {
    "title": "Grand jury rejection of Trump’s ‘law and order’ spreads to Chicago ICE enforcement",
    "description": "Americans across the country from Washington to Los Angeles have made it clear that they reject the Trump administration’s notion of “law and order,” with grand jurors refusing to return indictments in a series of cases alleging assaults on law enforcement du…",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/chicago-ice-trump-grand-juries-indictments-law-order-rcna236391",
    "timestamp": "2025-10-08T18:41:03Z"
  },
  {
    "title": "Treasury Defends Plans for $1 Trump Coin",
    "description": "The Treasury Department is defending its decision to mint a $1 coin featuring President Trump's likeness on both sides, brushing off critics who say the move flouts a Civil War-era law that bars living people from appearing on American money. The controversy …",
    "link": "https://www.newser.com/story/376540/treasury-defends-plans-for-1-trump-coin.html",
    "timestamp": "2025-10-08T18:40:00Z"
  },
  {
    "title": "'Come and get me': Dem gov dares Trump to make good on arrest threat",
    "description": "Illinois Gov. J.B. Pritzker (D) spoke to an MSNBC reporter on the ground in Chicago for protests around the deployment of federal agents to raid the city. President Donald Trump issued a Wednesday morning demand for Pritzker and the city's mayor to be put \"in…",
    "link": "https://www.rawstory.com/trump-jb-pritzker/",
    "timestamp": "2025-10-08T18:39:41Z"
  },
  {
    "title": "Activists warn Trump’s Caribbean boat strikes risk regional war",
    "description": "Human rights groups urge Congress to block unauthorised force as fears of wider Caribbean conflict and chaos grow.",
    "link": "https://www.aljazeera.com/news/2025/10/8/activists-warn-trumps-caribbean-boat-strikes-risk-regional-war",
    "timestamp": "2025-10-08T18:39:23Z"
  },
  {
    "title": "Dell Stock Spikes To All-Time High After Tech Titan Increases Long-Term Guidance",
    "description": "The computer company nearly doubled its guidance, citing demand for its AI and data infrastructure offerings.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/08/dell-stock-spikes-to-all-time-high-after-tech-titan-increases-long-term-guidance/",
    "timestamp": "2025-10-08T18:38:27Z"
  },
  {
    "title": "MTG Blows Up GOP Shutdown Message With Health-Care Rant",
    "description": "The Republican Party line is that nobody should talk about expiring Obamacare subsidies until Democrats agree to reopen the government. MTG — and for a moment, Trump — acknowledged the health-care cost catastrophe the GOP refuses to deal with.",
    "link": "http://nymag.com/intelligencer/article/mtg-shutdown-message-health-care-costs.html",
    "timestamp": "2025-10-08T18:36:50Z"
  },
  {
    "title": "Was Trump always against LGBTQ+ rights? Everything in his past says no.",
    "description": "This story was originally reported by Kate Sosin of The 19th. Meet Kate and read more of their reporting on gender, politics and policy.",
    "link": "https://www.advocate.com/politics/trump-lgbtq-rights-history",
    "timestamp": "2025-10-08T18:36:14Z"
  },
  {
    "title": "'Covering For Pedophiles': Dem Goes There On Trump's 'Dementia'",
    "description": "Ruben Gallego sat down with Ben Meiselas, and the Democratic Arizona Senator didn't hold back on the obvious. The President's health, both physical and mental, is an apparent concern. And Trump is saying some really alarming things lately, but his party seems…",
    "link": "https://crooksandliars.com/2025/10/covering-pedophiles-democrat-goes-there",
    "timestamp": "2025-10-08T18:33:30Z"
  },
  {
    "title": "Lawsuit challenging Trump’s new visa policy: What it really means",
    "description": "Presidential proclamation claims H-1B program 'deliberately exploited' to replace Americans, suppress wages, create dependency on foreign labor",
    "link": "https://www.wnd.com/2025/10/lawsuit-challenging-trumps-new-visa-policy-what-it/",
    "timestamp": "2025-10-08T18:33:26Z"
  },
  {
    "title": "U.S. And Israel Arrive In Egypt For Gaza Talks As Hamas Hands Over Hostage Swap List",
    "description": "With Trump's 20-point plan appearing closer than any previous effort to reach a ceasefire, delegations upgraded their presence at negotiations.",
    "link": "https://www.huffpost.com/entry/us-israel-arrive-egypt-gaza-talks-hamas-hostage-list_n_68e6a505e4b07aeeb19580b1",
    "timestamp": "2025-10-08T18:31:51Z"
  },
  {
    "title": "Bari Weiss Still Thinks It’s 2020",
    "description": "She co-founded The Free Press as a bastion of liberalism in an illiberal time. Her arrival at CBS is paved with excuses for illiberal friends.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/10/bari-weiss-cbs-free-press/684482/",
    "timestamp": "2025-10-08T18:30:00Z"
  },
  {
    "title": "White House wallows in 'lame-duckism' as Dems gain upper hand in shutdown: ex-Trump aide",
    "description": "A former aide to President Donald Trump is seeing a shift in power to the Democrats as the government shutdown persists. Republicans control the House, Senate, and White House, but have failed to pass a continuing resolution to temporarily fund the government…",
    "link": "https://www.rawstory.com/republicans-shutdown-2674166141/",
    "timestamp": "2025-10-08T18:29:32Z"
  },
  {
    "title": "Co-Founder Of Degenerate Forum Reddit Admits It Wouldn’t Exist Without Illegal Immigration",
    "description": "In a post criticizing Immigrations and Customs Enforcement, co-founder Alexis Ohanian admitted his mother overstayed her visa before marrying his father.",
    "link": "https://dailycaller.com/2025/10/08/alexis-ohanian-reddit-immigration-enforcement-censorship-donald-trump-serena-williams-comments/",
    "timestamp": "2025-10-08T18:29:06Z"
  },
  {
    "title": "As The Drone War Intensifies, Ukrainians Fight To Care For Their Own",
    "description": "The war that transformed Ukraine’s battlefields is now transforming its health care for veterans.",
    "link": "https://www.forbes.com/sites/davidkirichenko/2025/10/08/as-the-drone-war-intensifies-ukrainians-fight-to-care-for-their-own/",
    "timestamp": "2025-10-08T18:28:42Z"
  },
  {
    "title": "Greenland’s leader urges EU to invest in its mineral resources and renewable energy",
    "description": "Greenland's Prime Minister Jens-Frederik Nielsen has thanked the European Union for being a \"trusted friend\" and urged investment in Greenland's resources.",
    "link": "https://www.pbs.org/newshour/world/greenlands-leader-urges-eu-to-invest-in-its-mineral-resources-and-renewable-energy",
    "timestamp": "2025-10-08T18:25:47Z"
  },
  {
    "title": "TradFi ICE Invests $2B In Polymarket, Bridging Wall Street And Crypto",
    "description": "Intercontinental Exchange invests $2B in Polymarket, drawing attention to Wall Street’s growing embrace of crypto, prediction markets, and digital assets.",
    "link": "https://www.forbes.com/sites/beccabratcher/2025/10/08/tradfi-ice-invests-2b-in-polymarket-bridging-wall-street-and-crypto/",
    "timestamp": "2025-10-08T18:25:07Z"
  },
  {
    "title": "WAYNE ROOT: My Day at the Oval Office with President Trump. Let Me Tell You All About It.",
    "description": "By Wayne Allyn Root I’ve just returned from my first Oval Office visit with the President of the United States, and leader of the free world.\nThe post WAYNE ROOT: My Day at the Oval Office with President Trump. Let Me Tell You All About It. appeared first on …",
    "link": "https://www.thegatewaypundit.com/2025/10/wayne-root-my-day-oval-office-president-trump/",
    "timestamp": "2025-10-08T18:20:33Z"
  },
  {
    "title": "Joy Behar Accuses 'The View' Producer Brian Teta of 'Running a Dictatorship' During Live Show After Interrupting Whoopi Goldberg's Discussion",
    "description": "Joy Behar brazenly accused The View's executive producer of 'running a dictatorship' after he cut off a heated political discussion.",
    "link": "https://radaronline.com/p/joy-behar-the-view-producer-brian-teta-running-dictatorship-whoopi/",
    "timestamp": "2025-10-08T18:20:00Z"
  },
  {
    "title": "WATCH: Federal workers ‘should’ get back pay after shutdown, Johnson affirms",
    "description": "A day before, President Donald Trump suggested that some of the 750,000 furloughed federal workers might not be reimbursed once they return to work, reversing long-standing policy.",
    "link": "https://biztoc.com/x/21f1cdd8d1b3fb0b",
    "timestamp": "2025-10-08T18:19:47Z"
  },
  {
    "title": "Judge blocks Trump admin's plan to politicize funds to fight teen pregnancy",
    "description": "President Donald Trump listens while Secretary of Health and Human Services Robert F. Kennedy Jr. during a press conference at the White House on Sept. 22, 2025.",
    "link": "https://biztoc.com/x/5e96d1078dde7ea5",
    "timestamp": "2025-10-08T18:19:35Z"
  },
  {
    "title": "Meidas: Fox News Collapse on Live TV as Trump's Awful Plan Goes Sideways",
    "description": "MeidasTouch host Ben Meiselas reports on Fox News in a panics on live tv as their usual tricks to protect Donald Trump are all failing during the disastrous shutdown he caused.",
    "link": "https://littlegreenfootballs.com/article/54972_Meidas-_Fox_News_Collapse_on_L",
    "timestamp": "2025-10-08T18:17:56Z"
  },
  {
    "title": "Republicans who stood by as Bondi attacked their Democratic colleagues should be ashamed",
    "description": "Claire McCaskill says Republicans who stood by as Trump's attorney general, Pam Bondi, attacked Democrats during a Senate hearing should be ashamed.",
    "link": "https://www.msnbc.com/top-stories/latest/pam-bondi-attacks-democrats-republicans-senate-hearing-rcna236398",
    "timestamp": "2025-10-08T18:17:27Z"
  },
  {
    "title": "Bari Weiss is a weird and worrisome choice as top editor for CBS News",
    "description": "If you’re old enough to have admired CBS in its heyday, watching its decline has been painful.Decades ago, it was dubbed the Tiffany Network – home of the great journalist Walter Cronkite (“the most trusted man in America”), and innovator of the top-flight ma…",
    "link": "https://freerepublic.com/focus/f-news/4345106/posts",
    "timestamp": "2025-10-08T18:16:44Z"
  },
  {
    "title": "Fed minutes: Most officials supported further rate cuts as worries about jobs rose",
    "description": "The minutes underscored the deep division on the 19-person committee.",
    "link": "https://www.bostonherald.com/2025/10/08/fed-minutes/",
    "timestamp": "2025-10-08T18:16:35Z"
  },
  {
    "title": "Gaza talks taken up a notch as Hamas hands over hostage swap list",
    "description": "High-level talks are underway to end the Gaza conflict. Hamas has provided lists of hostages and prisoners for a potential swap. A US-backed plan is gaining traction. Senior figures from Israel, the US, and regional nations are participating. The negotiations…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/gaza-talks-taken-up-a-notch-as-hamas-hands-over-hostage-swap-list/articleshow/124395924.cms",
    "timestamp": "2025-10-08T18:15:39Z"
  },
  {
    "title": "Government Shutdown: Senate Blocks Bills To Reopen Government",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/08/government-shutdown-senate-blocks-bills-to-reopen-government/",
    "timestamp": "2025-10-08T18:15:36Z"
  },
  {
    "title": "There's a controversial crypto token quietly smashing everything else in the market",
    "description": "BNB has soared 129% in the past year, outstripping the gains in bitcoin and ethereum as wider adoption and crypto treasury plays push it higher.",
    "link": "https://www.businessinsider.com/binance-coin-bnb-price-today-crypto-btc-eth-xrp-tokens-2025-10",
    "timestamp": "2025-10-08T18:14:45Z"
  }
]