[
  {
    "title": "Trump Removes Migrant Protections for Two Countries: What to Know",
    "description": "A court has allowed the Trump administration to remove Temporary Protected Status for Afghans and Cameroonians.",
    "link": "https://www.newsweek.com/donald-trump-afghanistan-cameroon-temporary-protected-status-2102164",
    "timestamp": "2025-07-22T11:27:15Z"
  },
  {
    "title": "How Can the Dems Win Back the Working Class? Economic Populism",
    "description": "The Democratic Party has significant work to do if it hopes to bounce back from its 2024 electoral defeat. Making inroads with the working class is the only way possible, and a new report from the Center for Working-Class Politics and Jacobin shows that econo…",
    "link": "https://inequality.org/article/democrats-can-win-back-workers/",
    "timestamp": "2025-07-22T11:27:02Z"
  },
  {
    "title": "'Then Trump placed a call': Insiders reveal TX GOP had been against gerrymandering scheme",
    "description": "\"Texas Republicans, including Gov. Abbott, were reluctant to redraw the state’s congressional maps. Then Trump got involved.\" was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — a…",
    "link": "https://www.rawstory.com/texas-republicans-including-gov-abbott-were-hesitant-to-redraw-the-states-congressiona/",
    "timestamp": "2025-07-22T11:26:54Z"
  },
  {
    "title": "Hunter Biden Blames Sleeping Pill for Father's Poor 2024 Debate",
    "description": "In a new podcast interview, Hunter Biden is lashing out at President Donald Trump along with high-profile Democrats he says were disloyal to his father, including George Clooney who publicly urged Biden to drop out of the presidential race. Hunter is also add…",
    "link": "https://www.today.com/video/hunter-biden-blames-sleeping-pill-for-father-s-poor-2024-debate-243616837998",
    "timestamp": "2025-07-22T11:24:38Z"
  },
  {
    "title": "Coca-Cola reports weakening global sales volumes in second quarter",
    "description": "Coca-Cola reported better-than-expected earnings in the second quarter as higher prices offset weaker sales volumes.  Case volumes fell 1% globally and 1% in...",
    "link": "https://finance.yahoo.com/news/coca-cola-reports-weakening-global-112052242.html",
    "timestamp": "2025-07-22T11:20:52Z"
  },
  {
    "title": "Bruce Willis' health update: Hollywood veteran star can no longer speak, walk or read amid progressive dementia",
    "description": "Veteran actor Bruce Willis, best known for his action roles, reportedly can no longer walk, speak, or read in the latest health update. He was diagnosed with frontotemporal dementia in 2023.",
    "link": "https://www.wionews.com/entertainment/hollywood/bruce-willis-health-update-hollywood-veteran-star-can-no-longer-speak-walk-or-read-amid-progressive-dementia-1753180208759",
    "timestamp": "2025-07-22T11:14:29Z"
  },
  {
    "title": "Video: Jon Stewart Enlists Gospel Choir to Sing ‘Go F**k Yourself’ to Trump, Paramount over Colbert Cancelation",
    "description": "Always classy Jon Stewart enlisted profanity and abuse as he tore into CBS’ decision to cancel The Late Show With Stephen Colbert on Monday’s episode of The Daily Show, spraying obscenities at their shared parent company, Paramount Global, for what he called …",
    "link": "https://www.breitbart.com/entertainment/2025/07/22/video-jon-stewart-enlists-gospel-choir-to-sing-go-fk-yourself-to-trump-paramount-over-colbert-cancelation/",
    "timestamp": "2025-07-22T11:14:21Z"
  },
  {
    "title": "Democrats must counter Texas' redistricting 'cheating,' says Rep. Ritchie Torres",
    "description": "Texas Republicans want to redraw the state's congressional districts to gain an advantage in next year's election. U.S. Rep. Ritchie Torres, D-N.Y., says Democrats must counter or become complicit.",
    "link": "https://www.npr.org/2025/07/22/nx-s1-5475098/trump-texas-redistricting-democrats",
    "timestamp": "2025-07-22T11:13:14Z"
  },
  {
    "title": "The Redistricting Wars Are Ramping Up",
    "description": "Punchbowl News: “Texas is expected to release its proposed new congressional map imminently. Ohio is required by law to redistrict before 2026. And President Donald Trump teased last week that ‘three or four or five’",
    "link": "https://politicalwire.com/2025/07/22/the-redistricting-wars-are-ramping-up/",
    "timestamp": "2025-07-22T11:13:01Z"
  },
  {
    "title": "Tesla's easy money from regulatory credits set to dry up amid weakening sales",
    "description": "SAN FRANCISCO :A key driver of Tesla's profit is disappearing fast as the U.S. government changes policies on an environmental asset known as regulatory credits.Investors are likely to have a number of questions for Chief Executive Elon Musk when Tesla report…",
    "link": "https://www.channelnewsasia.com/business/teslas-easy-money-regulatory-credits-set-dry-up-amid-weakening-sales-5251761",
    "timestamp": "2025-07-22T11:12:18Z"
  },
  {
    "title": "The Problem With the Supreme Court's 'Shadow Docket'",
    "description": "In May, the U.S. Supreme Court granted an emergency request by the Trump administration to allow President Donald Trump's firing of National Labor Relations Board member Gywnne Wilcox to go into effect while Wilcox's lawsuit against Trump played out in court.…",
    "link": "https://biztoc.com/x/d0eef6255cc39c91",
    "timestamp": "2025-07-22T11:11:29Z"
  },
  {
    "title": "Trump and Netanyahu weren’t on the same page for long",
    "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu attend a White House dinner on July 7, 2025. | Andrew Harnik/Getty Images \nOne month ago, while announcing US airstrikes targeting Iran’s nuclear program, President Donald Trump said that he…",
    "link": "https://biztoc.com/x/68e4d3a6dd2cf5aa",
    "timestamp": "2025-07-22T11:11:13Z"
  },
  {
    "title": "In charts: The red flags behind the $40 billion electronics exports",
    "description": "India's electronic goods exports have achieved another significant milestone, but the sector continues to face persistent challenges.",
    "link": "https://www.livemint.com/industry/manufacturing/consumer-electronic-goods-exports-and-imports-apple-china-us-donald-trump-tariffs-iphone-11753179917376.html",
    "timestamp": "2025-07-22T11:10:35Z"
  },
  {
    "title": "Trump admin rehashes 2016 election and Malcolm-Jamal Warner drowns: Morning Rundown",
    "description": "Donald Trump and his administration are rehashing old grievances amid fallout over its handling of the Epstein case.",
    "link": "https://www.nbcnews.com/news/us-news/trump-admin-2016-election-malcolm-jamal-warner-morning-rundown-rcna220173",
    "timestamp": "2025-07-22T11:09:35Z"
  },
  {
    "title": "Trump tariffs take a $1 billion bite out of GM earnings",
    "description": "General Motors' second-quarter core profit fell 32% to $3 billion today, as the car maker continued to confront challenging tariff policies, which it said sapped $1.1 billion from the results.",
    "link": "https://www.rte.ie/news/business/2025/0722/1524719-gm-quarterly-sales/",
    "timestamp": "2025-07-22T11:09:21Z"
  },
  {
    "title": "RTX cuts 2025 profit forecast as tariff costs weigh",
    "description": "(Reuters) -RTX cut its 2025 profit forecast on Tuesday, as the aerospace and defense giant took a hit from U.S. President Donald Trump's trade war despite...",
    "link": "https://finance.yahoo.com/news/rtx-cuts-2025-profit-forecast-110704718.html",
    "timestamp": "2025-07-22T11:07:04Z"
  },
  {
    "title": "'Even the most dedicated': Analyst sees swathes of MAGA fans driven away by Trump's antics",
    "description": "Donald Trump's return to the White House has transformed the executive branch into what critics describe as a vengeful playground where personal grudges are more important than policy considerations.But The Atlantic writer Tom Nichols warned that even the pre…",
    "link": "https://www.rawstory.com/maga-trump-abandon/",
    "timestamp": "2025-07-22T11:05:48Z"
  },
  {
    "title": "The Big Polling Question Surrounding Trump and the Epstein Saga (Carroll Doherty/Politico)",
    "description": "Carroll Doherty / Politico:\nThe Big Polling Question Surrounding Trump and the Epstein Saga … Throughout Donald Trump's decade in politics, his critics have reacted predictably, almost reflexively, to his string of seeming career-ending statements, precedent-…",
    "link": "https://www.memeorandum.com/250722/p12",
    "timestamp": "2025-07-22T11:05:00Z"
  },
  {
    "title": "Daily Stock Watch: Why investors are watching Trump Media, Alphabet, and Verizon",
    "description": "Trump Media rose in premarket trading on Tuesday after the company announced it had accumulated $2 billion in bitcoin and related assets.",
    "link": "https://markets.businessinsider.com/news/stocks/stock-price-tuesday-trump-media-verizon-archer-alphabet-opendoor",
    "timestamp": "2025-07-22T11:04:55Z"
  },
  {
    "title": "U.S citizen killed in Syria sectarian violence alongside 6 Druze family members",
    "description": "An American citizen from Oklahoma was killed along with six male relatives during the sectarian violence that erupted last week in Syria",
    "link": "https://www.nbcnews.com/world/middle-east/american-killed-syria-hosam-saraya-druze-sectarian-violence-video-rcna220170",
    "timestamp": "2025-07-22T11:03:27Z"
  },
  {
    "title": "Hunter Biden says he’d invade El Salvador",
    "description": "Hunter Biden says he would threaten military action to retrieve migrants deported to El Salvador during Trump’s term Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621803-hunter-biden-salvador-migrants/",
    "timestamp": "2025-07-22T11:03:02Z"
  },
  {
    "title": "Coca-Cola plans cane-sugar Coke as higher prices boost profits",
    "description": "Coca-Cola's quarterly estimates beat expectations, the company said Tuesday, boosted by higher prices even as volumes dropped in key markets, while the company said it would introduce a Coke product made with cane sugar in the United States.Higher prices offs…",
    "link": "https://www.channelnewsasia.com/business/coca-cola-plans-cane-sugar-coke-higher-prices-boost-profits-5251736",
    "timestamp": "2025-07-22T11:02:55Z"
  },
  {
    "title": "Coca-Cola to roll out US cane-sugar Coke; zero-calorie drinks, higher prices drive beat",
    "description": "Coca-Cola on Tuesday laid out plans to launch a new product made with cane sugar in the U.S. this year and beat estimates for quarterly results on resilient demand for zero-calorie drinks as well as higher prices.Food companies are seeking healthier substitut…",
    "link": "https://www.channelnewsasia.com/business/coca-cola-roll-out-us-cane-sugar-coke-zero-calorie-drinks-higher-prices-drive-beat-5251736",
    "timestamp": "2025-07-22T11:02:55Z"
  },
  {
    "title": "Coca-Cola beats on zero-calorie sodas, higher prices; to launch cane sugar-based drink",
    "description": "Coca-Cola beat estimates for quarterly revenue and profit on Tuesday, benefiting from resilient demand for zero-calorie drinks as well as higher pricing, and laid out plans to launch a new product made with cane sugar in the U.S. this year.Food companies are …",
    "link": "https://www.channelnewsasia.com/business/coca-cola-beats-zero-calorie-sodas-higher-prices-launch-cane-sugar-based-drink-5251736",
    "timestamp": "2025-07-22T11:02:55Z"
  },
  {
    "title": "Go F*ck Yourself, Donald. Tabs, Tues., July 22, 2025",
    "description": "He's got that Chronic Penis Insufficiency, uh huh, President TACO Cankles got that CPI.",
    "link": "https://www.wonkette.com/p/go-fck-yourself-donald-tabs-tues",
    "timestamp": "2025-07-22T11:02:49Z"
  },
  {
    "title": "Trump releasing the MLK Jr. files is a victory for truth and accountability",
    "description": "The release of classified documents about Martin Luther King Jr.'s assassination represents a significant act of transparency that honors his legacy of truth.",
    "link": "https://www.foxnews.com/opinion/trump-releasing-mlk-files-victory-truth-accountability",
    "timestamp": "2025-07-22T11:00:15Z"
  },
  {
    "title": "The Trump Administration Is Trying to Silence Us. It's Only Making Us Stronger | Opinion",
    "description": "This administration isn't just breaking the law—it's breaking the system that's supposed to uphold it.",
    "link": "https://www.newsweek.com/trump-administration-trying-silence-us-its-only-making-us-stronger-opinion-2101033",
    "timestamp": "2025-07-22T11:00:01Z"
  },
  {
    "title": "Democracy Upside Down",
    "description": "This isn’t the typical tug-of-war of federalism.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/trump-immigration-democracy-eisenhower/683614/",
    "timestamp": "2025-07-22T11:00:00Z"
  },
  {
    "title": "The Hype Man of Trump’s Mass Deportations",
    "description": "Gregory Bovino has taken his aggressive tactics and propaganda videos from the southern border to the streets of California.",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/trump-border-patrol-gregory-bovino/683617/",
    "timestamp": "2025-07-22T11:00:00Z"
  },
  {
    "title": "Thailand Says Nearing Deal With US To Lower 36% Export Tariff",
    "description": "Thailand is close to an agreement with the US to lower a threatened 36% tariff on its exports ahead of the Aug. 1 deadline, according to Finance Minister Pichai Chunhavajira, who expects trade talks to conclude within days. The Southeast Asian nation will sub…",
    "link": "https://www.ndtvprofit.com/global-economics/thailand-says-nearing-deal-with-us-to-lower-export-tariff",
    "timestamp": "2025-07-22T10:57:15Z"
  },
  {
    "title": "Trump official reveals ‘vodka diplomacy’ during talks with key Russian ally",
    "description": "The unconventional approach helped secure the release of 14 Belarusian opposition figures, US deputy envoy John Coale has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621802-trump-lukashenko-vodka-diplomacy/",
    "timestamp": "2025-07-22T10:56:50Z"
  },
  {
    "title": "2025 Power Investors",
    "description": "Meet the figures creating fortunes in commercial real estate amid historic disruptions",
    "link": "http://commercialobserver.com/power-series/2025-power-investors/",
    "timestamp": "2025-07-22T10:55:53Z"
  },
  {
    "title": "Trump Torches Judge Presiding Over Harvard Case: 'A TOTAL DISASTER'",
    "description": "The president suggested the outcome of the case was predetermined.",
    "link": "https://www.huffpost.com/entry/trump-attacks-judge-harvard-case_n_687f4f9ae4b0d91bafdeab2f",
    "timestamp": "2025-07-22T10:55:46Z"
  },
  {
    "title": "Martin Luther King Jr.’s Daughter Taunts Trump To Release Epstein Files",
    "description": "King, daughter of MLK Jr., taunted Trump to release the Jeffrey Epstein files after the admin published documents related to her father's assassination.\nThe post Martin Luther King Jr.’s Daughter Taunts Trump To Release Epstein Files first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/news/martin-luther-king-jr-s-daughter-taunts-trump-to-release-epstein-files/",
    "timestamp": "2025-07-22T10:53:42Z"
  },
  {
    "title": "Same summit, different stakes?",
    "description": "Same summit, different stakes? \nmarianna.liana…\nTue, 07/22/2025 - 13:50\n\n\n 6 minutes\n \n When EU leaders travel to Beijing this Thursday for the EU-China Summit, everything might seem to be business as usual at first glance. Since 2019, both sides have failed …",
    "link": "https://www.iss.europa.eu/publications/commentary/same-summit-different-stakes",
    "timestamp": "2025-07-22T10:50:08Z"
  },
  {
    "title": "Russia, Ukraine to hold new peace talks",
    "description": "Ukrainian President Volodymyr Zelenskyy said Russia and Ukraine would hold a new round of peace talks.\nTomorrow’s meeting between officials in Istanbul comes as both countries ramp up drone attacks, and as US President Donald Trump increases pressure on Mosco…",
    "link": "https://biztoc.com/x/a8ccc5216951ca7c",
    "timestamp": "2025-07-22T10:49:18Z"
  },
  {
    "title": "‘No miracles’: Russia downplays Ukraine talks as deadly attacks continue",
    "description": "Kremlin downplays expectations for Istanbul talks as Ukraine says 10-year-old killed in Russian attack on Kramatorsk.",
    "link": "https://www.aljazeera.com/news/2025/7/22/no-miracles-russia-downplays-ukraine-talks-as-deadly-strikes-continue",
    "timestamp": "2025-07-22T10:47:11Z"
  },
  {
    "title": "The government was once a steady partner for nonprofits. That's changing",
    "description": "In his second term, President Donald Trump has cut a huge range of federal grants that fund social services",
    "link": "https://abcnews.go.com/Business/wireStory/government-steady-partner-nonprofits-changing-123949923",
    "timestamp": "2025-07-22T10:46:32Z"
  },
  {
    "title": "Greed vs. integrity in Trump’s Gilded Age",
    "description": "As Democrats conduct their 2024 autopsy, Americans see both parties as \"self-serving and ineffective\"",
    "link": "https://www.salon.com/2025/07/22/greed-vs-integrity-in-trumps-gilded-age/",
    "timestamp": "2025-07-22T10:45:55Z"
  },
  {
    "title": "AstraZeneca Plans to Invest $50B in US Manufacturing and Research by 2030",
    "description": "AstraZeneca said Tuesday it's planning to invest $50 billion in expanding its manufacturing and research presence in the U.S. by 2030, as worries about...",
    "link": "https://www.investopedia.com/astrazeneca-plans-to-invest-usd50b-in-us-manufacturing-and-research-by-2030-11776479",
    "timestamp": "2025-07-22T10:45:12Z"
  },
  {
    "title": "Stephen Colbert Savages CBS for Late Show ‘Financial Losses’ Spin: ‘Where Would Paramount Have Possibly Spent the Other $16M?’",
    "description": "Colbert savaged CBS parent company Paramount’s attempt to spin the cancellation of his show as due to financial losses with a pointed Trump settlement jibe.\nThe post Stephen Colbert Savages CBS for Late Show ‘Financial Losses’ Spin: ‘Where Would Paramount Hav…",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-savages-cbs-for-late-show-financial-losses-spin-where-would-paramount-have-possibly-spent-the-other-16m/",
    "timestamp": "2025-07-22T10:44:54Z"
  },
  {
    "title": "US stock futures dip with earnings, tariff talks in focus",
    "description": "At 05:50 a.m. ET, S&P 500 E-minis were down 7 points, or 0.11%, Nasdaq 100 E-minis were down 60 points, or 0.25%, and Dow E-minis were up 1 point, or 0...",
    "link": "https://finance.yahoo.com/news/us-stock-futures-dip-earnings-104203871.html",
    "timestamp": "2025-07-22T10:42:03Z"
  },
  {
    "title": "Germany agrees to deliver Patriots to Ukraine",
    "description": "Germany will send its own Patriot batteries and ammo to Ukraine and will receive replacements from US stocks Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621804-germany-ukraine-patriot-systems/",
    "timestamp": "2025-07-22T10:38:36Z"
  },
  {
    "title": "Pentagon removes 700 Marines Trump deployed to Los Angeles over objections of local leaders",
    "description": "The Pentagon ordered the U.S. Marines to leave Los Angeles on Monday, more than a month after President Donald Trump deployed them to the city against the objections of local leaders.\nThe 700 Marines were deployed June 9 on the fourth day of protests in downt…",
    "link": "https://biztoc.com/x/274ef9863837743b",
    "timestamp": "2025-07-22T10:37:58Z"
  },
  {
    "title": "Late Night Hosts Unite For Stephen Colbert’s Epic Trolling Of Trump And CBS",
    "description": "Jon Stewart, Seth Meyers, Jimmy Fallon and John Oliver — and other famous faces — joined in with the \"Late Show\" bit.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-cbs-coldplay-moment_n_687f5d90e4b0351bed5ee577",
    "timestamp": "2025-07-22T10:34:43Z"
  },
  {
    "title": "Trump Media Announces Bitcoin Treasury Holdings Reached $2 Billion – Details",
    "description": "US President Donald Trump’s social media company, Trump Media, has revealed its multi-billion Bitcoin (BTC) holdings as part of its crypto treasury strategy. The news follows the President’s recent post praising the flagship cryptocurrency. Related Reading: C…",
    "link": "https://bitcoinist.com/trump-media-announces-bitcoin-treasury-holdings-reached-2-billion-details/",
    "timestamp": "2025-07-22T10:30:07Z"
  },
  {
    "title": "Dairy and Trump: The Art of The Veal",
    "description": "Canada is obsessed with dairy. It’s quite literally part of our culture…we’re talking soccer medals with the little blue milk logo on them. But someone else is also utterly obsessed with Canadian dairy. Donald Trump. What does Trump want…and why?And if Carney…",
    "link": "https://shows.acast.com/canadaland/episodes/687ef9080de40e9a7c53a782",
    "timestamp": "2025-07-22T10:30:00Z"
  },
  {
    "title": "Epstein’s Properties Were Allegedly The Sites Of Sexual Exploitation. Now They’ve All Been Sold.",
    "description": "Before his second arrest and death in 2021, the convicted sex offender owned a property empire stretching from Paris to New Mexico. All of it has since been sold.",
    "link": "https://www.forbes.com/sites/giacomotognini/2025/07/22/epsteins-properties-were-allegedly-the-sites-of-sexual-exploitation-now-theyve-all-been-sold/",
    "timestamp": "2025-07-22T10:30:00Z"
  },
  {
    "title": "The Long Fight for Tenant Power",
    "description": "More than a third of the US population rent their homes. The number of tenants in the country is growing fast—nearly triple the rate of homeowner growth in 2024. So, too, are the challenges they face. Tenants headed into 2025 having experienced the steepest f…",
    "link": "http://www.nybooks.com/online/2025/07/22/the-long-fight-for-tenant-power/",
    "timestamp": "2025-07-22T10:30:00Z"
  },
  {
    "title": "Pentagon removes 700 Marines Trump deployed to Los Angeles over objections of local leaders",
    "description": "“This is another win for Los Angeles but this is also a win for those serving this country in uniform,” Mayor Karen Bass said. “Los Angeles stands with our troops, which is why we are glad they are leaving.”",
    "link": "https://fortune.com/2025/07/22/pentagon-removes-700-marines-trump-deployed-los-angeles-objections-local-leaders/",
    "timestamp": "2025-07-22T10:28:13Z"
  },
  {
    "title": "OpenAI, Oracle deepen AI data center push with 4.5 gigawatt Stargate expansion",
    "description": "OpenAI announced that Oracle will provide 2 million chips to help scale its AI data center infrastructure. This partnership aims to boost computing power for OpenAI’s advanced models like ChatGPT, reflecting growing demand for AI capabilities and the need for…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-oracle-deepen-ai-data-center-push-with-4-5-gigawatt-stargate-expansion/articleshow/122834934.cms",
    "timestamp": "2025-07-22T10:27:31Z"
  },
  {
    "title": "Trump to withdraw US from UNESCO again",
    "description": "United States President Donald Trump decided to withdraw his country from the United Nations Educational, Scientific and Cultural Organization (UNESCO) over the organization's \"anti-America and anti-I...",
    "link": "https://biztoc.com/x/3fa85612eafeef8c",
    "timestamp": "2025-07-22T10:26:50Z"
  },
  {
    "title": "Trump Pulling US From 'Woke' UNESCO",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe White House said President Donald Trump has decided to pull the U.S. from the United Nations Educational, Scientific and Cultural Organization (UNESCO) after a review of American participation in the agenc…",
    "link": "https://biztoc.com/x/6282b81b64d774f3",
    "timestamp": "2025-07-22T10:26:46Z"
  },
  {
    "title": "Taxpayers fork out nearly $7 million a year for Anthony Albanese’s prime ministership",
    "description": "The cost covers his salary, official residences, international travel, staff expenses, family travel, and phone bills.",
    "link": "https://7news.com.au/news/taxpayers-fork-out-nearly-7-million-a-year-for-anthony-albaneses-prime-ministership-c-19439167",
    "timestamp": "2025-07-22T10:26:07Z"
  },
  {
    "title": "Ukraine-Russia talks set for Wednesday in Turkey, Zelenskyy confirms",
    "description": "Ukraine-Russia talks set for Wednesday in Turkey, Zelenskyy confirmsgo.com",
    "link": "https://abcnews.go.com/International/ukraine-russia-talks-set-wednesday-turkey-zelenskyy-confirms/story?id=123949538",
    "timestamp": "2025-07-22T10:25:54Z"
  },
  {
    "title": "Trump Pulling US From 'Woke' UNESCO",
    "description": "It followed a Trump Administration review of US participation.",
    "link": "https://www.newsweek.com/donald-trump-unesco-us-woke-dei-2102193",
    "timestamp": "2025-07-22T10:24:29Z"
  },
  {
    "title": "Ukraine Gets Major Patriot Missile System Boost",
    "description": "\"Ukraine protects the front line against Russian aggression for all of Europe,\" Dutch Defense Minister Ruben Brekelmans said on Monday.",
    "link": "https://www.newsweek.com/ukraine-patriot-air-defense-germany-netherlands-us-russia-2102127",
    "timestamp": "2025-07-22T10:22:16Z"
  },
  {
    "title": "Due to anti-Israel biases:Due to anti-Israel biases: Trump withdraws US from UNESCO",
    "description": "Trump cited what he described as anti-American and anti-Israel biases, as well as the promotion of a “woke agenda” that he claims harms national interests, for the decision.",
    "link": "https://www.israelnationalnews.com/news/412068",
    "timestamp": "2025-07-22T10:19:00Z"
  },
  {
    "title": "Republican Pollster Sounds Alarm as GOP Support Collapses Under Trump",
    "description": "Mark Mitchell, the head pollster at Rasmussen Reports, said the Republican Party has lost more support than the Democratic Party.",
    "link": "https://www.newsweek.com/republican-pollster-gop-rasmussen-2102120",
    "timestamp": "2025-07-22T10:15:10Z"
  },
  {
    "title": "Trump's Wall Street Journal suit over Epstein story faces timing hurdle",
    "description": "Donald Trump's defamation lawsuit against the Wall Street Journal, concerning a story linking him to Jeffrey Epstein, faces potential dismissal due to a failure to comply with Florida's five-day notice law. Legal experts highlight the high bar Trump must clea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-wall-street-journal-suit-over-epstein-story-faces-timing-hurdle/articleshow/122834491.cms",
    "timestamp": "2025-07-22T10:10:46Z"
  },
  {
    "title": "How the ghost of 'transitory' inflation is haunting the rate debate",
    "description": "Joseph Lavorgna says tariffs are not inflationary. Economists predicted prices would rise due to President Trump's import duties. Alberto Cavallo tracks the price impact of tariffs. Fed economists showed tariffs on Chinese imports affected consumer prices. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/how-the-ghost-of-transitory-inflation-is-haunting-the-rate-debate/articleshow/122834411.cms",
    "timestamp": "2025-07-22T10:08:12Z"
  },
  {
    "title": "Mike Huckabee: No Damage to Church in Palestinian Christian Town",
    "description": "U.S. Ambassador to Israel Mike Huckabee clarified Tuesday that no damage was done to a church in the Palestinian Christian town of Taybeh, despite earlier reports -- though he still condemned violence against the town.\nThe post Mike Huckabee: No Damage to Chu…",
    "link": "https://www.breitbart.com/middle-east/2025/07/22/mike-huckabee-no-damage-to-church-in-palestinian-christian-town/",
    "timestamp": "2025-07-22T10:07:22Z"
  },
  {
    "title": "S&P Futures Muted With Focus on Earnings and Trade Deals",
    "description": "September S&P 500 E-Mini futures (ESU25) are trending down -0.04% this morning as investors brace for a raft of corporate earnings reports and continue to...",
    "link": "https://www.barchart.com/story/news/33548522/s-p-futures-muted-with-focus-on-earnings-and-trade-deals",
    "timestamp": "2025-07-22T10:06:38Z"
  },
  {
    "title": "Stephen Colbert Tells Trump 'Go F**k Yourself' for Mocking His Show Cancelation",
    "description": "Late-night host Stephen Colbert had some choice words for President Donald Trump after he mocked his show's cancelation: \"Go fuck yourself.\"\nThe post Stephen Colbert Tells Trump ‘Go F**k Yourself’ for Mocking His Show Cancelation appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/07/22/stephen-colbert-tells-trump-go-fk-yourself-for-mocking-his-show-cancelation/",
    "timestamp": "2025-07-22T10:05:14Z"
  },
  {
    "title": "High imports, soft summer demand weigh on US gasoline",
    "description": "NEW YORK (Reuters) -U.S. gasoline prices could fall below $3 a gallon this summer for the first time in over four years as a stretch of bad weather events...",
    "link": "https://finance.yahoo.com/news/high-imports-soft-summer-demand-100412102.html",
    "timestamp": "2025-07-22T10:04:12Z"
  },
  {
    "title": "High imports, soft summer demand weigh on US gasoline",
    "description": "NEW YORK (Reuters) -U.S. gasoline prices could fall below $3 a gallon this summer for the first time in over four years as a stretch of bad weather events...",
    "link": "https://ca.finance.yahoo.com/news/high-imports-soft-summer-demand-100412504.html",
    "timestamp": "2025-07-22T10:04:12Z"
  },
  {
    "title": "Trump blasts Massie as 'the worst Republican Congressman' and says he's seeking a challenger to support",
    "description": "President Donald Trump slams Rep. Thomas Massie, noting he plans to endorse against and campaign against the Kentucky Republican incumbent",
    "link": "https://www.foxnews.com/politics/trump-blasts-massie-the-worst-republican-congressman-says-hes-seeking-challenger-support",
    "timestamp": "2025-07-22T10:01:10Z"
  },
  {
    "title": "Analyst Says XRP Investors Are Getting Ripped Off — Here’s Why",
    "description": "Over the last few weeks, XRP has creeped up slowly but surely to become one of the most talked-about cryptocurrencies in the space. Its price has also risen steadily through this time, beating the $3.6 level to reach new seven-year highs and triggering moment…",
    "link": "http://www.newsbtc.com/analysis/xrp/xrp-investors-ripped-off/",
    "timestamp": "2025-07-22T10:00:51Z"
  },
  {
    "title": "Why the administration’s latest allegations about the Russia investigation don’t add up",
    "description": "Director of National Intelligence Tulsi Gabbard declassified and released new intelligence documents Friday that she claimed were evidence of a “treasonous conspiracy” by top Obama administration officials to manufacture the notion that Russia interfered in t…",
    "link": "https://www.cnn.com/2025/07/22/politics/how-tulsi-gabbard-is-trying-to-rewrite-history-of-the-russia-investigation",
    "timestamp": "2025-07-22T10:00:43Z"
  },
  {
    "title": "Why Trump’s attacks on Jerome Powell are raising fears for the US economy",
    "description": "The US president's broadsides against the Fed chair have prompted concern about the independence of the US central bank.",
    "link": "https://www.aljazeera.com/news/2025/7/22/why-trumps-attacks-on-jerome-powell-have-raised-fears-for-the-us-economy",
    "timestamp": "2025-07-22T10:00:22Z"
  },
  {
    "title": "'Trump has changed the game': NATO enters brave new era under pressure from US, Russia",
    "description": "Russian President Vladimir Putin's war in Ukraine and President Trump's tough stance on NATO have 'energized' the alliance into action, experts explain unique circumstances that led to unprecedented commitments.",
    "link": "https://www.foxnews.com/world/trump-has-changed-game-nato-enters-brave-new-era-under-pressure-from-us-russia",
    "timestamp": "2025-07-22T10:00:17Z"
  },
  {
    "title": "Iranian foreign minister denies calls to wipe Israel 'off the map,' assassination plots to kill Trump",
    "description": "Iranian foreign minister Abbas Araghchi denies plots to assassinate President Donald Trump and claims Iran has no policy to wipe Israel 'off the map,' despite contradictory statements.",
    "link": "https://www.foxnews.com/media/iranian-foreign-minister-denies-calls-wipe-israel-off-map-assassination-plots-kill-trump",
    "timestamp": "2025-07-22T10:00:15Z"
  },
  {
    "title": "Gisele Fetterman lambasts 'terrible' media, says journalists bombarded her when husband was sick",
    "description": "Gisele Fetterman shared her experience with media scrutiny during her husband's health challenges and expressed concern about privacy invasion in a new interview.",
    "link": "https://www.foxnews.com/media/gisele-fetterman-lambasts-terrible-media-says-journalists-bombarded-her-when-husband-sick",
    "timestamp": "2025-07-22T10:00:04Z"
  },
  {
    "title": "ACA marketplace health plan enrollees could face 'subsidy cliff' in 2026 — here's how to avoid it",
    "description": "Marketplace health insurance plan enrollees could face a \"subsidy cliff\" in 2026, experts say. Here's how to avoid higher costs.",
    "link": "https://www.cnbc.com/2025/07/22/aca-health-insurance-trump-taxes.html",
    "timestamp": "2025-07-22T10:00:01Z"
  },
  {
    "title": "Rupert Murdoch should stand for free speech and fight Trump’s Wall Street Journal suit",
    "description": "Trump's lawsuit follows a bombshell Wall Street Journal article last week about a “bawdy” Trump-penned birthday note to the late billionaire sex offender Jeffrey Epstein.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/rupert-murdoch-wsj-trump-lawsuit-defend-free-speech-rcna220023",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Scoop: Democrats launch billboards outside hospitals to target Trump for 'Gutting Rural Health Care'",
    "description": "The Democratic National Committee targets rural voters with billboards highlighting how Trump's \"big, beautiful bill\" could impact healthcare services through Medicaid restructuring.",
    "link": "https://www.foxnews.com/politics/scoop-democrats-launch-billboards-outside-hospitals-target-trump-gutting-rural-health-care",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Some Virginians worry about whether they'll lose health coverage",
    "description": "The Congressional Budget Office estimated that the number of Americans without health insurance will increase by 16 million by 2034 between Medicaid cuts and the end of expanded Obamacare tax credits.",
    "link": "https://richmond.com/news/local/government-politics/article_f5209397-3fb3-4b7e-9289-d2db7af51d5e.html",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Why the Epstein story cannot be buried",
    "description": "Why does the story of Jeffrey Epstein matter so deeply to the American right? Why does it persist, years after his death, as a source of outrage, fascination, and dread? Why is the call to “move on” met with such visceral resistance?The answer lies in what Ep…",
    "link": "https://www.theblaze.com/columns/opinion/epstein-elite-cover-up-deep-state",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "“Like a Zombie Apocalypse: Trump’s Budget Cuts Stir Fears of Frightening Pipeline Mishaps",
    "description": "This story was originally published by the Guardian, and is reproduced here as part of the Climate Desk collaboration. On a clear February evening in 2020, a smell of rotten eggs started to waft over the small town of Satartia, Mississippi, followed by a gree…",
    "link": "https://www.motherjones.com/politics/2025/07/satartia-mississippi-co2-pipeline-leak-trump-safety-regulations-repeal/",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Pod of War",
    "description": "They entered in tight formation. There was Eddie Gallagher, the alleged war criminal Navy SEAL granted clemency by President Donald Trump; Tom Satterly, the Delta Force sergeant major made famous by Black Hawk Down; Christian Craighead, the SAS soldier who le…",
    "link": "https://www.motherjones.com/politics/2025/07/shawn-ryan-profile-podcast-maga-trump-military-influencer-ufos-livelsberger/",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Trump’s Epstein Scandal Turns Another Beltway Cliche on Its Head",
    "description": "Half a century after President Richard Nixon’s resignation in disgrace, certain clichés about political scandal linger in our discourse even though they don’t apply to Donald Trump. Among these, the reigning champ is “the cover-up is worse than the crime.” (I…",
    "link": "https://newrepublic.com/article/198190/trump-epstein-scandal-cover-up",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Unpacking the MAHA Mirage: Trump Guts Healthcare While Preaching Wellness",
    "description": "More than 100 million Americans are obese, 38 million are diabetic, 116 million are hypertensive, and 26 million suffer from asthma. Whether or not you’re among the 60 percent of Americans whose medical chart lists a chronic illness, everyone suffers from the…",
    "link": "https://www.motherjones.com/politics/2025/07/unpacking-the-maha-mirage-trump-guts-healthcare-while-preaching-wellness/",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "So, Where Is the “Bawdy” Trump-Epstein Letter, Anyway?",
    "description": "President Donald Trump followed through on his threat last week to sue The Wall Street Journal for reporting that he had sent a “bawdy” letter to Jeffrey Epstein to celebrate the financier’s 50th birthday in 2003. Epstein, who was convicted of state child-pro…",
    "link": "https://newrepublic.com/article/198187/trump-epstein-letter-journal-lawsuit",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Real photo of Trump, wife Melania, Epstein and Ghislaine Maxwell?",
    "description": "A photo authentically depicts Donald Trump and wealthy financier Jeffrey Epstein together in 2000.",
    "link": "https://www.snopes.com//fact-check/trumps-epstein-ghislaine-maxwell/",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "State Cops Quietly Tag Thousands as Gang Members — and Feed Their Names to ICE",
    "description": "Gang databases are often racially biased and riddled with errors. States and cities send their flawed information to immigration authorities.\nThe post State Cops Quietly Tag Thousands as Gang Members — and Feed Their Names to ICE appeared first on The Interce…",
    "link": "https://theintercept.com/2025/07/22/ice-gang-database-trump-deportations/",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Many Canadian exports can avoid Trump tariffs if CUSMA-compliant. Here's what that means",
    "description": "Canadian exporters across a wide range of industries have a way to escape U.S. President Donald Trump’s blanket tariffs. That escape hatch is compliance with the Canada-U.S.-Mexico Agreement (CUSMA), the three-way free trade deal signed by Trump back in 2018.",
    "link": "https://www.cbc.ca/news/canada/tariffs-trump-cusma-compliance-explained-1.7590517",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Republicans are trying to turn their attacks on Obamacare into self-fulfilling prophecies",
    "description": "Republicans decided to let enhanced subsidies for Americans who buy health insurance through the Affordable Care Act expire.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/obamacare-aca-premium-increases-subsidies-expiring-rcna220079",
    "timestamp": "2025-07-22T10:00:00Z"
  },
  {
    "title": "Sporticast 468: ‘Pay Us What You Owe Us’",
    "description": "On the latest Sporticast episode, hosts Scott Soshnick and Eben Novy-Williams discuss some of the biggest sports business stories of the week, including the latest with the WNBA’s CBA talks. The women’s basketball league and its players are still in negotiati…",
    "link": "https://www.sportico.com/podcasts/sporticast/2025/wnba-labor-talks-latest-sporticast-podcast-1234863544/",
    "timestamp": "2025-07-22T09:55:00Z"
  }
]