[
  {
    "title": "Gallego: Americans Need to See Second Strike Video, Trump Essentially 'Murdering People'",
    "description": "Wednesday on CNN's \"News Central,\" Sen. Ruben Gallego (D-AZ) said the American people should see the video of the second strike on an alleged drug boat in the Caribbean because President Donald Trump was essentially \"murdering people.\"\nThe post Gallego: Ameri…",
    "link": "https://www.breitbart.com/clips/2025/12/10/gallego-americans-need-to-see-second-strike-video-trump-essentially-murdering-people/",
    "timestamp": "2025-12-10T22:56:49Z"
  },
  {
    "title": "Trump's 'gold card' program for million-dollar US visas goes live",
    "description": "President Donald Trump has announced the long-awaited launch of a \"gold card\" program offering legal status and a pathway to U.S. citizenship. Individuals can pay $1 million, and corporations can pay $2 million per foreign-born employee. The program is meant …",
    "link": "https://apnews.com/article/trump-gold-card-website-live-us-visa-22edbd7e65d188bbf6c8ec1d5f78d11a",
    "timestamp": "2025-12-10T22:53:30Z"
  },
  {
    "title": "Trump launches $1m ‘gold card’ visa scheme amid immigration crackdown - The Guardian",
    "description": "Trump launches $1m ‘gold card’ visa scheme amid immigration crackdownThe Guardian 'Direct path to citizenship': Donald Trump launches Gold Card, cites corporate demand — what it meansTimes of India Trump announces the launch of the 'Trump gold card,' which is…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180357995",
    "timestamp": "2025-12-10T22:53:13Z"
  },
  {
    "title": "Does Trump have a plan to reform healthcare in America?",
    "description": "And the president has doubled down on his criticism of Europe.",
    "link": "https://www.bbc.co.uk/sounds/play/p0mmtmh7",
    "timestamp": "2025-12-10T22:53:00Z"
  },
  {
    "title": "Fed Again Cuts Interest Rates By 0.25% - Forbes",
    "description": "Fed Again Cuts Interest Rates By 0.25%Forbes Trump says Fed could have 'at least doubled' latest interest rate cutcnbc.com Trump administration live updates: Judge orders Epstein grand jury records releasedNBC News Donald Trump Reacts to Federal Reserve Inter…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180357985",
    "timestamp": "2025-12-10T22:52:42Z"
  },
  {
    "title": "Mutual aid in motion: One participant’s story",
    "description": "Editor’s Note: In February 2025, Shareable launched Mutual Aid 101, a free learning series to introduce new organizers to mutual aid. Over 3,000 people from across the US participated in the series over six weeks. During an Offers & Needs Marketfor participan…",
    "link": "https://www.shareable.net/mutual-aid-in-motion-one-participants-story/",
    "timestamp": "2025-12-10T22:52:10Z"
  },
  {
    "title": "Trump Apparently Has a Very Good Reason for Seizing an Oil Tanker off the Venezuelan Coast",
    "description": "Let me guess, is it to further distract us from the Epstein files?",
    "link": "https://www.esquire.com/news-politics/politics/a69690392/trump-oil-tanker-venezuela/",
    "timestamp": "2025-12-10T22:51:00Z"
  },
  {
    "title": "Donald Trump Says Any Warner Bros. Discovery Deal Should Include Sale of CNN Because the ‘People Running It’ Are ‘Either Corrupt or Incompetent’",
    "description": "President Donald Trump, who has inserted himself into the U.S. government’s review of a potential deal for Warner Bros. Discovery, said it is “imperative” that CNN be sold as part of a sale — so that it’s no longer under the current management team at the new…",
    "link": "https://variety.com/2025/tv/news/trump-warner-bros-discovery-deal-sale-of-cnn-1236605943/",
    "timestamp": "2025-12-10T22:49:48Z"
  },
  {
    "title": "Night owl bitcoin traders: Soon there'll be an ETF just for you",
    "description": "If approved, the Nicholas Bitcoin and Treasuries AfterDark ETF would buy and sell bitcoin-linked financial instruments outside U.S. trading hours.",
    "link": "https://www.cnbc.com/2025/12/10/night-owl-bitcoin-traders-soon-therell-be-an-etf-just-for-you.html",
    "timestamp": "2025-12-10T22:49:06Z"
  },
  {
    "title": "Trump warns Colombian President Gustavo Petro he will ‘be next’ amid drug trafficking rift",
    "description": "Trump issued a sharp warning to Colombia’s President Gustavo Petro as tensions rise over drug trafficking and U.S. military strikes in the Caribbean.",
    "link": "https://www.foxnews.com/politics/trump-warns-colombias-president-gustavo-petro-he-will-next-drug-trafficking-rift",
    "timestamp": "2025-12-10T22:49:03Z"
  },
  {
    "title": "Why Republicans in Congress are turning against Trump",
    "description": "For most of this year, Republican members of the House of Representatives seemed to move in lockstep with President Donald Trump, not hesitating to back him on controversial measures on immigration and the economy. But now they seem to be breaking ranks. Some…",
    "link": "https://www.vox.com/politics/471929/congress-trump-house-gop-divide",
    "timestamp": "2025-12-10T22:48:33Z"
  },
  {
    "title": "Donald Trump Opposes Warner Bros. Discovery Retaining Ownership Of CNN In Any Merger Transaction",
    "description": "Donald Trump weighed in again on the potential sale of Warner Bros. Discovery, this time by saying that he opposes any plan in which the company continues to own CNN.\nTrump told reporters Wednesday that there were “some good companies bidding on it.”\n“I think…",
    "link": "https://biztoc.com/x/18019bd8eea9677c",
    "timestamp": "2025-12-10T22:47:09Z"
  },
  {
    "title": "US expands vetting of social media to H-1B applicants, dependents",
    "description": "From December 15, the US will expand the vetting of social media accounts to all H-1B visa applicants as well as their dependents, the US Embassy spokesperson said on Wednesday.\r\n“The Department of State conducts thorough vetting of all visa applicants, inclu…",
    "link": "https://indianexpress.com/article/india/us-expands-vetting-of-social-media-to-h-1b-applicants-dependents-10413949/",
    "timestamp": "2025-12-10T22:46:40Z"
  },
  {
    "title": "Hawaii among six states approved to limit food stamp items | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> U.S. Agriculture Secretary Brooke Rollins said today that she has granted waivers to six additional states allowing them to prevent the use of food stamps to purchase certain items, like soft drinks and candy.",
    "link": "https://www.staradvertiser.com/2025/12/10/breaking-news/hawaii-among-six-states-approved-to-limit-food-stamp-items/",
    "timestamp": "2025-12-10T22:45:00Z"
  },
  {
    "title": "“Beyond weird”: Ihan Omar says Trump has an “obsession” with her",
    "description": "The lawmaker called the president a \"national embarrassment\" after he went on a racist rant",
    "link": "https://www.salon.com/2025/12/10/beyond-weird-ihan-omar-says-trump-has-obsession-with-her/",
    "timestamp": "2025-12-10T22:44:18Z"
  },
  {
    "title": "US May Demand 5 Years of Social Media History From Incoming Tourists",
    "description": "Visitors entering the US may also need to disclose their previous email addresses and details about their families, under a new federal proposal.",
    "link": "https://www.cnet.com/tech/services-and-software/us-may-demand-5-years-of-social-media-history-from-incoming-tourists/",
    "timestamp": "2025-12-10T22:44:03Z"
  },
  {
    "title": "Nancy Mace Tries Her Damndest To Deflect Responsibility For Her Wild Airport Tantrum",
    "description": "The GOP congresswoman talked in circles when asked if officers \"lied\" on her.",
    "link": "https://www.huffpost.com/entry/nancy-mace-denies-airport-tantrum-law-enforcement-officers_n_6939a5bde4b0758c1aff3e35",
    "timestamp": "2025-12-10T22:42:37Z"
  },
  {
    "title": "The US seizes a tanker off the coast of Venezuela",
    "description": "President Trump has said the US has seized an oil tanker off the coast of Venezuela - an operation reported to have been led by the US Coastguard. The seizure is certain to increase tensions between the United States and Venezuela, which is already being thre…",
    "link": "https://www.bbc.co.uk/programmes/w172zssgqf897zm",
    "timestamp": "2025-12-10T22:42:00Z"
  },
  {
    "title": "Trump believes he can help ease tensions between Thailand and Cambodia",
    "description": "US President Donald Trump commented on the escalation in the conflict between Thailand and Cambodia, saying he believes he can help calm the tensions. “I think I can get them to stop fighting.”Trump added: “We will set up a phone call tomorrow.”",
    "link": "https://www.israelnationalnews.com/flashes/672131",
    "timestamp": "2025-12-10T22:41:31Z"
  },
  {
    "title": "Thanks, Biden: Electric school bus bursts into flames, driver hospitalized",
    "description": "Vehicle was powered by lithium ion batteries, which must be monitored for several hours post-fire",
    "link": "https://www.wnd.com/2025/12/thanks-biden-electric-school-bus-bursts-flames/",
    "timestamp": "2025-12-10T22:40:49Z"
  },
  {
    "title": "The NYT says it won't be deterred in its work after Trump posted on Truth Social that reporting by The NYT and others about his health was \"seditious\" (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\nThe NYT says it won't be deterred in its work after Trump posted on Truth Social that reporting by The NYT and others about his health was “seditious”  —  The New York Times, attacked by President Donald Trump for reporting ab…",
    "link": "https://mediagazer.com/251210/p22",
    "timestamp": "2025-12-10T22:40:00Z"
  },
  {
    "title": "House passes $901B military defense bill after Republican revolt collapses",
    "description": "The House passed the National Defense Authorization Act authorizing $901 billion in Pentagon spending, sending the legislation to the Senate for final approval.",
    "link": "https://www.foxnews.com/politics/house-passes-901b-military-defense-bill-after-republican-revolt-collapses",
    "timestamp": "2025-12-10T22:37:48Z"
  },
  {
    "title": "US-Venezuela military buildup tests Puerto Rico’s painful past",
    "description": "As US military presence grows once again in Puerto Rico, old wounds resurface.",
    "link": "https://www.aljazeera.com/video/the-take-2/2025/12/10/aje-onl-aj_tt_usa_prmilitary_av-101225",
    "timestamp": "2025-12-10T22:37:25Z"
  },
  {
    "title": "Ukraine sends US new plan to end the war as Trump blasts Europe",
    "description": "Ukraine has sent Washington an updated plan for ending Russia’s invasion, Ukrainian officials told AFP Wednesday, as US President Donald Trump laid into European leaders in the latest sign of a growing transatlantic rift. A first US plan that involved Ukraine…",
    "link": "https://www.digitaljournal.com/world/ukraine-sends-us-new-plan-to-end-the-war-as-trump-blasts-europe/article",
    "timestamp": "2025-12-10T22:37:20Z"
  },
  {
    "title": "Wednesday’s Mini-Report, 12.10.25",
    "description": "Today’s edition of quick hits.\n* A major escalation: “The United States has seized an oil tanker Wednesday off the coast of Venezuela, President Donald Trump said, sharply escalating tensions with his counterpart, Venezuelan President Nicolás Maduro. Trump di…",
    "link": "https://biztoc.com/x/aac54fe78c671e67",
    "timestamp": "2025-12-10T22:35:57Z"
  },
  {
    "title": "Trump Pours Cold Water All Over Reports He’s Looking to Fire Kristi Noem",
    "description": "\"I read a story recently I'm unhappy with Kristi [Noem]. I'm so happy with her. I mean, we have a closed border.\"\nThe post Trump Pours Cold Water All Over Reports He’s Looking to Fire Kristi Noem first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-pours-cold-water-all-over-reports-hes-looking-to-fire-kristi-noem/",
    "timestamp": "2025-12-10T22:35:54Z"
  },
  {
    "title": "Watch: Video shows US military seizing oil tanker off Venezuela coast",
    "description": "According to US Attorney General Pam Bondi, who shared the footage, the tanker was used to transport sanctioned oil from Venezuela and Iran.",
    "link": "https://www.bbc.com/news/videos/c9vj1jnmekko",
    "timestamp": "2025-12-10T22:35:53Z"
  },
  {
    "title": "Get the Facts: Trump touts strong economy in second term while affordability concerns grow",
    "description": "President Donald Trump held a campaign-style rally in Pennsylvania on Tuesday to talk about the economy amid growing consumer concerns about affordability that the president has tried to paint as a hoax and a Democratic issue.",
    "link": "https://www.wcvb.com/article/fact-check-trump-economy-speech/69690473",
    "timestamp": "2025-12-10T22:35:15Z"
  },
  {
    "title": "What a Democrat's victory in the Miami mayoral election may mean for Trump (Adriana Gomez Licon/Associated Press)",
    "description": "Adriana Gomez Licon / Associated Press:\nWhat a Democrat's victory in the Miami mayoral election may mean for Trump  —  Democrat Eileen Higgins' victory in the Miami mayoral race marks a setback for Republican President Donald Trump, who endorsed her rival and…",
    "link": "https://www.memeorandum.com/251210/p102",
    "timestamp": "2025-12-10T22:35:00Z"
  },
  {
    "title": "Democrats Who Relented On Shutdown Have No Regrets Ahead Of Failed Health Care Vote",
    "description": "The vote Democrats were promised on health as part of the deal to reopen the government is going nowhere, and Obamacare subsidies are set to lapse this month.",
    "link": "https://www.huffpost.com/entry/obamacare-premiums-democrats-shutdown_n_6939cecbe4b028000c5a9cd4",
    "timestamp": "2025-12-10T22:30:57Z"
  },
  {
    "title": "Kelly shrugs off Trump court-martial threat, says growing up in Tony Soprano’s hometown made him ‘resilient’",
    "description": "Sen. Mark Kelly faces a Trump administration investigation over video urging troops to refuse illegal orders, but says he's not intimidated by court-martial threats.",
    "link": "https://www.foxnews.com/media/kelly-shrugs-off-trump-court-martial-threat-says-growing-up-tony-sopranos-hometown-made-him-resilient",
    "timestamp": "2025-12-10T22:30:24Z"
  },
  {
    "title": "Kennedy Center Honors Continues Trump Momentum to Unify Americans Through Art",
    "description": "The incredible artists who were awarded Kennedy Center Honors Sunday night rose above partisan rancor and helped showcase the universal appeal of President Donald Trump’s valiant efforts to restore America’s cultural... Read More\nThe post Kennedy Center Honor…",
    "link": "https://www.dailysignal.com/2025/12/10/kennedy-center-honors-continues-trump-momentum-to-unify-americans-through-art/",
    "timestamp": "2025-12-10T22:30:00Z"
  },
  {
    "title": "Scores of government statisticians are gone, leaving data at risk, report says",
    "description": "A new report reveals that the U.S. government's statistical system is struggling due to staff layoffs, reduced funding, and political interference",
    "link": "https://abcnews.go.com/US/wireStory/scores-government-statisticians-leaving-data-risk-report-128296066",
    "timestamp": "2025-12-10T22:29:51Z"
  },
  {
    "title": "President Murmu stresses human rights for all, including 'person in last mile'",
    "description": "President Murmu emphasized ensuring human rights for everyone, highlighting India's shift from entitlement to empowerment and charity to rights over the past decade. She noted government efforts to provide essential services like clean water, electricity, and…",
    "link": "https://timesofindia.indiatimes.com/india/president-murmu-stresses-human-rights-for-all-including-person-in-last-mile/articleshow/125899272.cms",
    "timestamp": "2025-12-10T22:28:45Z"
  },
  {
    "title": "Protest in Oslo Denounces Nobel Peace Prize for Right-Wing Machado",
    "description": "As President Donald Trump issued new threats of a possible ground invasion in Venezuela, protesters gathered outside the Norwegian Nobel Institute in Oslo on Tuesday to protest the awarding of the prestigious peace prize to right-wing opposition leader Maria …",
    "link": "https://www.commondreams.org/news/machado-protest-oslo",
    "timestamp": "2025-12-10T22:25:59Z"
  },
  {
    "title": "Federal Reserve Defers to Donald Trump by Cutting Interest Rates by 25 Points",
    "description": "The Federal Reserve, the central bank of the United States, voted to lower its federal funds rate—the interest rate that banks charge each other to borrow overnight and the cost of credit—by 25 basis points on Wednesday. This is the Fed's third rate cut in as…",
    "link": "https://biztoc.com/x/5d76ecc8f17d0e64",
    "timestamp": "2025-12-10T22:24:58Z"
  },
  {
    "title": "House is voting on a defense bill to raise troop pay and overhaul weapons purchases",
    "description": "The annual National Defense Authorization Act typically gains bipartisan backing.",
    "link": "https://www.bostonherald.com/2025/12/10/us-congress-defense-bill/",
    "timestamp": "2025-12-10T22:24:43Z"
  },
  {
    "title": "How Republicans Tricked Jasmine Crockett Into Running For Senate",
    "description": "Republicans plan to push their preferred candidate Democrat Texas Representative Jasmine Crockett into running for senate has seemingly worked after all.",
    "link": "https://dailycaller.com/2025/12/10/jasmine-crockett-nrsc-polling-james-talarico-john-cornyn-colin-allred/",
    "timestamp": "2025-12-10T22:23:27Z"
  },
  {
    "title": "House is voting on a defense bill to raise troop pay and overhaul weapons purchases",
    "description": "The House is headed toward a final vote on a sweeping defense bill that authorizes $900 billion in military programs",
    "link": "https://abcnews.go.com/US/wireStory/house-voting-defense-bill-raise-troop-pay-overhaul-128295967",
    "timestamp": "2025-12-10T22:21:54Z"
  },
  {
    "title": "'All that glitters is not gold': Trump's shiny new scheme brutally mocked",
    "description": "President Donald Trump's latest scheme got a brutal mocking on social media after months of imposing harsh regulations on visas, a looming social media policy for tourists, and anti-immigrant remarks. Trump on Wednesday revealed that his \"Trump Gold Card,\" wh…",
    "link": "https://www.rawstory.com/donald-trump-gold-card-reaction/",
    "timestamp": "2025-12-10T22:21:41Z"
  },
  {
    "title": "Federal Reserve Defers to Donald Trump by Cutting Interest Rates by 25 Points",
    "description": "The Federal Open Market Committee lowered the federal funds rate for the third meeting in a row despite elevated inflation.",
    "link": "https://reason.com/2025/12/10/federal-reserve-defers-to-donald-trump-by-cutting-interest-rates-by-25-points/",
    "timestamp": "2025-12-10T22:21:37Z"
  },
  {
    "title": "First of 30 oil lease sales planned for Gulf of Mexico draws $279 million in bids from companies",
    "description": "First of 30 oil lease sales planned for Gulf of Mexico draws $279 million in bids from companiestwincities.com",
    "link": "https://www.twincities.com/2025/12/10/trump-oil-lease-sale/",
    "timestamp": "2025-12-10T22:20:07Z"
  },
  {
    "title": "Vanessa Trump 'Is the Closest Thing to a Soulmate Tiger Woods Ever Had' — Inside the Golf Pro's Very Private Romance With Prez's Former Daughter-in-Law",
    "description": "Tiger Woods and Vanessa Trump are said to be head over heeds for one another, as a source revealed details of their private relationship.",
    "link": "https://radaronline.com/p/tiger-woods-vanessa-trump-soulmate-relationship-details-revealed/",
    "timestamp": "2025-12-10T22:20:00Z"
  },
  {
    "title": "Open Thread: Trump’s “Affordability” Tour Is Off to A… Start",
    "description": "just incredible optics here, the president yelling at you about how you should buy less and like it, three weeks before christmas, while standing in front of a bunch of stupefied moronic dipshits holding BIGGER PAYCHECKS signs [image or embed] — GOLIKEHELLMAC…",
    "link": "https://balloon-juice.com/2025/12/10/open-thread-trumps-affordability-tour-is-off-to-a-start/",
    "timestamp": "2025-12-10T22:19:18Z"
  },
  {
    "title": "Thailand-Cambodia fighting rages on as Trump signals intent to intervene",
    "description": "BANGKOK/PHNOM PENH, Dec 10 (Reuters) - Thailand and Cambodia traded accusations of targeting civilians in artillery and rocket attacks on Wednesday, as U.S. President Donald Trump said he would try to intervene to stop the fighting and salvage a ceasefire he …",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/thailand-cambodia-fighting-rages-on-as-trump-signals-intent-to-intervene",
    "timestamp": "2025-12-10T22:17:00Z"
  },
  {
    "title": "First of 30 oil lease sales planned for Gulf of Mexico draws $279 million in bids from companies",
    "description": "Thirty companies submitted bids, including industry giants Chevron, Shell and BP.",
    "link": "https://www.bostonherald.com/2025/12/10/trump-oil-lease-sale/",
    "timestamp": "2025-12-10T22:15:49Z"
  },
  {
    "title": "WATCH: U.S. grabs oil tanker near Venezuela at gunpoint and Trump confirms ‘other things’ are happening",
    "description": "President: 'A large tanker, very large. Largest one ever seized, actually'",
    "link": "https://www.wnd.com/2025/12/watch-u-s-grabs-oil-tanker-near-venezuela/",
    "timestamp": "2025-12-10T22:14:57Z"
  },
  {
    "title": "Trump Unveils $1 Million Gold Card With His Mug and Bald Eagle for Quickie Visas: ‘SO EXCITING!’",
    "description": "President Trump officially unveiled his \"gold card,\" the new fast-track visa program that will give qualified foreigners permanent residency in the U.S. for $1M\nThe post Trump Unveils $1 Million Gold Card With His Mug and Bald Eagle for Quickie Visas: ‘SO EXC…",
    "link": "https://www.mediaite.com/politics/trump-unveils-1-million-gold-card-with-his-mug-and-bald-eagle-for-quickie-visas-so-exciting/",
    "timestamp": "2025-12-10T22:14:43Z"
  },
  {
    "title": "Fed Again Cuts Interest Rates By 0.25%",
    "description": "Topline\nPresident Donald Trump on Wednesday criticized the Federal Reserve, arguing the central bank’s latest reduction in interest rates could have been doubled, while calling Fed Chair Jerome Powell a “stiff.”\nKey Facts\nThe Federal Open Market Committee vot…",
    "link": "https://biztoc.com/x/8aed172b082a0084",
    "timestamp": "2025-12-10T22:13:59Z"
  },
  {
    "title": "EXCLUSIVE--Sen. Bernie Moreno Endorses Rep. Barry Moore for Alabama Senate 2026",
    "description": "Rep. Barry Moore (R-AL), a member of the House Freedom Caucus and early supporter of President Donald Trump, has received a notable endorsement in his bid for the U.S. Senate from Sen. Bernie Moreno (R-OH).\nThe post EXCLUSIVE–Sen. Bernie Moreno Endorses Rep. …",
    "link": "https://www.breitbart.com/politics/2025/12/10/exclusive-sen-bernie-moreno-endorses-rep-barry-moore-for-alabama-senate-2026/",
    "timestamp": "2025-12-10T22:13:32Z"
  },
  {
    "title": "Is the Calibri typeface 'woke'? We asked its designer",
    "description": "According to Marco Rubio, Times New Roman will 'restore decorum and professionalism' to the State Department",
    "link": "https://www.wallpaper.com/design-interiors/is-calibri-typeface-woke",
    "timestamp": "2025-12-10T22:13:04Z"
  },
  {
    "title": "Scores of government statisticians are gone, leaving data at risk, report says",
    "description": "The ranks of U.S. government statisticians have been gutted in the past year due to layoffs and buyouts.  One agency lost 95% of its staff, while others...",
    "link": "https://www.yahoo.com/news/articles/scores-government-statisticians-gone-leaving-221238525.html",
    "timestamp": "2025-12-10T22:12:38Z"
  },
  {
    "title": "Trump Wants Total CNN Overhaul in Any Warner Bros. Discovery Deal: ‘I Don’t Think That Should Be Allowed to Continue’ | Video",
    "description": "\"The people that are running CNN right now are either corrupt or incompetent,\" the president says\nThe post Trump Wants Total CNN Overhaul in Any Warner Bros. Discovery Deal: ‘I Don’t Think That Should Be Allowed to Continue’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-cnn-overhaul-warner-bros-discovery-deal-sold-separately/",
    "timestamp": "2025-12-10T22:12:09Z"
  },
  {
    "title": "US trade representative says India's offer 'best-ever received' as both teams huddle",
    "description": "US trade representative Jamieson Greer highlighted India's \"best-ever\" offers in ongoing trade talks, calling the nation a \"tough nut to crack\" due to resistance on certain agricultural imports. Senior US officials are in New Delhi to advance negotiations for…",
    "link": "https://timesofindia.indiatimes.com/india/us-trade-representative-says-indias-offer-best-ever-received-as-both-teams-huddle/articleshow/125898190.cms",
    "timestamp": "2025-12-10T22:11:53Z"
  },
  {
    "title": "Fed slashes interest rates, but issues mixed forward guidance",
    "description": "A lack of clarity on future interest rate cuts under Jerome Powell's leadership has placed a damper on a Bitcoin price rally, analysts say.",
    "link": "https://cointelegraph.com/news/fed-slashes-interest-rates-mixed-guidance",
    "timestamp": "2025-12-10T22:11:49Z"
  },
  {
    "title": "Trump Urges Mexico To Address Its 'Water And Sewage Problem,' Calling it a 'Threat' To The U.S.",
    "description": "President Donald Trump urged Mexico to address its \"water and sewage problem,\" calling it a threat to the United States.",
    "link": "https://www.ibtimes.com/trump-urges-mexico-address-its-water-sewage-problem-calling-it-threat-us-3792321",
    "timestamp": "2025-12-10T22:11:44Z"
  },
  {
    "title": "‘Good to See You!’ MTG’s Boyfriend Back in the White House Asking Trump Friendly Questions",
    "description": "Brian Glenn was back to asking President Donald Trump questions Wednesday amid the president's feud with Marjorie Taylor Greene (R-GA).\nThe post ‘Good to See You!’ MTG’s Boyfriend Back in the White House Asking Trump Friendly Questions first appeared on Media…",
    "link": "https://www.mediaite.com/politics/good-to-see-you-mtgs-boyfriend-back-in-the-white-house-asking-trump-friendly-questions/",
    "timestamp": "2025-12-10T22:11:32Z"
  },
  {
    "title": "Trump's Privacy Invasion Gone Mad: Surrender 5 Years of Social Media or Face US Entry Ban",
    "description": "US border plan would force visitors to disclose five years of social media and personal data, raising privacy fears for millions using the Visa Waiver Program.",
    "link": "https://www.ibtimes.com/trumps-privacy-invasion-gone-mad-surrender-5-years-social-media-face-us-entry-ban-3792320",
    "timestamp": "2025-12-10T22:11:24Z"
  },
  {
    "title": "How to Stop Trump’s Plan to Steal the 2026 Elections",
    "description": "Brennan Center President Michael Waldman on how Donald Trump could try to subvert the 2026 midterm elections, how he can be stopped, and what can be done to reform America’s electoral system. Plus: David on Trump’s silly award from FIFA.",
    "link": "https://www.theatlantic.com/podcasts/2025/12/david-frum-show-michael-waldman-2026-elections/685219/",
    "timestamp": "2025-12-10T22:10:47Z"
  },
  {
    "title": "Trump Owns Infamous 's--Thole Countries' Line He Previously Denied, Calls African Nations 'Filthy, Dirty, Disgusting'",
    "description": "President Donald Trump on openly confirmed that he used the phrase \"s--thole countries\" to describe Haiti and African nations during a 2018 Oval Office discussion on immigration — a remark he had previously disputed in public.",
    "link": "https://www.ibtimes.com/trump-owns-infamous-s-thole-countries-line-he-previously-denied-calls-african-nations-filthy-3792314",
    "timestamp": "2025-12-10T22:10:08Z"
  },
  {
    "title": "David Letterman: Donald Trump Is a ‘Fool’ Who ‘Should Expect and Examine Every Bit of Ridicule He Receives’",
    "description": "David Letterman sat down for an interview on “Jimmy Kimmel Live!” and came out swinging against Donald Trump, who is often the subject of ridicule during Jimmy Kimmel’s monologues. Letterman defended Kimmel and anyone’s right to mock Trump because the U.S. pr…",
    "link": "https://variety.com/2025/tv/news/david-letterman-donald-trump-fool-1236605693/",
    "timestamp": "2025-12-10T22:10:06Z"
  },
  {
    "title": "Judge Emil Bove Faces Ethics Complaint After Attending Trump Rally",
    "description": "Bove, who was nominated and confirmed as a judge this past summer, was previously a criminal defense attorney for Trump.",
    "link": "https://truthout.org/articles/judge-emil-bove-faces-ethics-complaint-after-attending-trump-rally/",
    "timestamp": "2025-12-10T22:08:04Z"
  },
  {
    "title": "US forces seize oil tanker off Venezuela coast, escalating pressure from Trump on Maduro",
    "description": "Official says US conducted ‘judicial enforcement action on a stateless vessel’ that was last docked in country",
    "link": "https://www.irishtimes.com/world/americas/2025/12/10/us-forces-seize-oil-tanker-off-venezuela-coast-escalating-pressure-from-trump-on-maduro/",
    "timestamp": "2025-12-10T22:06:01Z"
  },
  {
    "title": "At 1.2L, 70% of 2024 road deaths were because of speeding: Govt",
    "description": "Speeding remains the primary killer on Indian roads, responsible for nearly 70% of the 1.2 lakh road deaths in 2024. Non-usage of helmets and seatbelts also contributed significantly to fatalities. Despite some dips, these dangerous behaviors continue to pose…",
    "link": "https://timesofindia.indiatimes.com/india/at-1-2l-70-of-2024-road-deaths-were-because-of-speeding-govt/articleshow/125897984.cms",
    "timestamp": "2025-12-10T22:04:36Z"
  },
  {
    "title": "Honduran military vows to ensure orderly post-election power transfer",
    "description": "Protests over electoral uncertainty remain peaceful as military assures orderly transition of power in Honduras.",
    "link": "https://www.aljazeera.com/news/2025/12/10/honduran-military-vows-to-ensure-orderly-post-election-power-transfer",
    "timestamp": "2025-12-10T22:02:52Z"
  },
  {
    "title": "Jimmy Kimmel Slams Trump as 'Most Miserable Son of a B—h' Over White House UFC Birthday Bash",
    "description": "Jimmy Kimmel mocks Donald Trump's plan to host a UFC fight on the White House lawn for his 80th birthday, calling him a \"miserable son of a b—h.\"",
    "link": "https://www.ibtimes.com/jimmy-kimmel-slams-trump-most-miserable-son-bh-over-white-house-ufc-birthday-bash-3792312",
    "timestamp": "2025-12-10T22:00:37Z"
  },
  {
    "title": "Columbia review finds Jewish students were called 'murderers,' blasted with anti-Israel tirades",
    "description": "Columbia University released a 70-page antisemitism report detailing harassment of Jewish and Israeli students in classrooms and on campus.",
    "link": "https://www.foxnews.com/media/columbia-review-finds-jewish-students-were-called-murderers-blasted-anti-israel-tirades",
    "timestamp": "2025-12-10T22:00:13Z"
  },
  {
    "title": "Is Trump About To Shake Up Crypto Gaming? New ‘Billionaires Club’ Set For Release",
    "description": "US President Donald Trump’s name is back in the headlines this week as a Trump-branded mobile game tied to the TRUMP memecoin prepares to go live at the end of the month. Related Reading: Canadian Crypto Traders In Trouble? Regulator Flags 40% For Possible Ta…",
    "link": "https://bitcoinist.com/can-trump-save-crypto-gaming-new-billionaires-club-set-for-release/",
    "timestamp": "2025-12-10T22:00:11Z"
  },
  {
    "title": "Kiwi businessman in Ukraine says he’s determined to stay",
    "description": "'Some big loud nights' of Russian attacks won't stop the defiant Kiwi.",
    "link": "https://www.nzherald.co.nz/business/kiwi-businessman-in-ukraine-says-hes-determined-to-stay/premium/STT54NR3NJBUDJGDSIZV2R5I44/",
    "timestamp": "2025-12-10T22:00:00Z"
  },
  {
    "title": "Trump Warns Critics They're Acting 'Treasonous' For Questioning His Physical Health",
    "description": "US President Donald Trump lashed out at the media and critics this week, calling scrutiny about his physical condition 'seditious, perhaps even treasonous,' in an unusually fiery post, sparking backlash over his fitness for office.",
    "link": "https://www.ibtimes.com/trump-warns-critics-theyre-acting-treasonous-questioning-his-physical-health-3792310",
    "timestamp": "2025-12-10T21:59:47Z"
  },
  {
    "title": "Jasmine Crockett Dodges Questions on Her Comments Comparing Latino Trump Voters to Slaves",
    "description": "Rep. Jasmine Crockett (D-TX) dodged questions Tuesday about her 2024 comments comparing Latino Trump supporters to slaves.\nThe post Jasmine Crockett Dodges Questions on Her Comments Comparing Latino Trump Voters to Slaves appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/10/jasmine-crockett-dodges-questions-her-comments-comparing-latino-trump-voters-slaves/",
    "timestamp": "2025-12-10T21:57:09Z"
  },
  {
    "title": "Jack Smith Partners with Trump Lawfare Thugs to Form a Law Firm",
    "description": "Former Special Counsel Jack Smith, failed leader of President Joe Biden's Justice Department efforts to convict Donald Trump, is partnering with other leading figures in the lawfare against Trump to create a law firm.\nThe post Jack Smith Partners with Trump L…",
    "link": "https://www.breitbart.com/2024-election/2025/12/10/jack-smith-partners-with-trump-lawfare-thugs-to-form-a-law-firm/",
    "timestamp": "2025-12-10T21:55:01Z"
  },
  {
    "title": "Speedy justice? Tribunals have 5L pending cases",
    "description": "Specialised tribunals, designed for swift justice, are overwhelmed by over 5.24 lakh pending cases, primarily due to significant member vacancies. Debt Recovery Tribunals lead with 2.5 lakh cases. Seven tribunals lack chairpersons, and 18% of member posts are…",
    "link": "https://timesofindia.indiatimes.com/india/speedy-justice-tribunals-have-5l-pending-cases/articleshow/125897758.cms",
    "timestamp": "2025-12-10T21:53:54Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Tennis stars Aryna Sabalenka, Nick Kyrgios weigh in on trans athlete debate",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-tennis-star-aryna-sabalenka-weighs-transgender-athlete-debate",
    "timestamp": "2025-12-10T21:53:43Z"
  },
  {
    "title": "Burgum calls California a ‘national security risk’ as Energy chief warns blue states are skewing cost averages",
    "description": "Interior Secretary Doug Burgum discusseed Trump's energy dominance agenda in an exclusive interview, contrasting Pennsylvania and California policies.",
    "link": "https://www.foxnews.com/politics/burgum-labels-california-national-security-threat-energy-chief-warns-blue-states-skewing-cost-averages",
    "timestamp": "2025-12-10T21:52:38Z"
  },
  {
    "title": "Trump says had ‘pretty strong words’ with Europeans on Ukraine",
    "description": "US President Donald Trump said he exchanged “pretty strong words” Wednesday with the leaders of France, Britain and Germany on Ukraine, in the latest sign of a growing rift on how to end Russia’s invasion.  Trump added that the Europeans wanted to hold fresh …",
    "link": "https://www.digitaljournal.com/world/trump-says-had-pretty-strong-words-with-europeans-on-ukraine/article",
    "timestamp": "2025-12-10T21:52:20Z"
  },
  {
    "title": "Trump Confirms the U.S. Seized a Tanker Off Venezuela, Says We’ll ‘Keep’ the Oil",
    "description": "Bloomberg News first reported on the seizure of the tanker, calling the move “a serious escalation” amid Trump’s saber-rattling to remove Nicolas Maduro from power.\nThe post Trump Confirms the U.S. Seized a Tanker Off Venezuela, Says We’ll ‘Keep’ the Oil firs…",
    "link": "https://www.mediaite.com/media/news/trump-confirms-the-u-s-seized-a-tanker-off-venezuela-says-well-keep-the-oil/",
    "timestamp": "2025-12-10T21:51:27Z"
  },
  {
    "title": "EXCLUSIVE: Millions of illegal immigrants leave US in record-breaking year under Trump policies, DHS says",
    "description": "The Department of Homeland Security on Wednesday reported that 2.5 million illegal immigrants have left the United States as deportations rise.",
    "link": "https://www.foxnews.com/politics/exclusive-millions-illegal-immigrants-leave-us-record-breaking-year-trump-policies-dhs-says",
    "timestamp": "2025-12-10T21:50:29Z"
  },
  {
    "title": "‘Threatening’: Letter makes it appear Letitia James wants parents’ speech censored at school-board meetings",
    "description": "'They're not saying you can't talk about this topic, they're saying that nobody can speak out say in favor of biological sex'",
    "link": "https://www.wnd.com/2025/12/threatening-letter-makes-it-appear-letitia-james-wants/",
    "timestamp": "2025-12-10T21:48:22Z"
  },
  {
    "title": "GOP Rep. Grilled Over Struggling Farmers: 'Are You Listening To Your Constituents?'",
    "description": "Rep. Mark Alford (R-Mo.) repeatedly praised President Donald Trump during an appearance Tuesday on \"News Central\" about farmers struggling under his tariffs.",
    "link": "https://www.huffpost.com/entry/mark-alford-brianna-keilar-struggling-farmers_n_69399d61e4b007ac563b3da9",
    "timestamp": "2025-12-10T21:48:15Z"
  },
  {
    "title": "Rivian CEO says buying an EV isn’t a political choice, pointing out that R1 buyers are split evenly between Republicans and Democrats",
    "description": "\"I think that's extraordinarily powerful news for us to recognize that this isn't just left-leaning buyers,\" Rivian CEO RJ Scaringe.",
    "link": "https://fortune.com/2025/12/10/rivian-ceo-rj-scaringe-ev-politics-republicans-democrats/",
    "timestamp": "2025-12-10T21:47:29Z"
  },
  {
    "title": "Super PAC Announces Major Campaign to Primary Republicans Who Oppose Indiana Redistricting",
    "description": "Republicans in the Indiana Senate may face an ugly surprise next year, should they dare oppose the new U.S. congressional map up for debate in... Read More\nThe post Super PAC Announces Major Campaign to Primary Republicans Who Oppose Indiana Redistricting app…",
    "link": "https://www.dailysignal.com/2025/12/10/super-pac-announces-major-campaign-primary-republicans-who-oppose-indiana-redistricting/",
    "timestamp": "2025-12-10T21:45:00Z"
  },
  {
    "title": "Trump confirms: US seized oil tanker near Venezuela",
    "description": "US President Donald Trump confirmed that the United States seized an oil tanker near Venezuela’s coast. He noted it is the largest tanker ever captured by the US to date.",
    "link": "https://www.israelnationalnews.com/flashes/672129",
    "timestamp": "2025-12-10T21:45:00Z"
  },
  {
    "title": "Trump Rages At CNN For Asking About Hegseth: ‘You Know You Work For the Democrats’",
    "description": "President Donald Trump concluded a White House Q&A with reporters on Wednesday by trashing one of his favorite media piñatas, CNN, as “basically an arm of the Democratic Party.” The president slammed the channel after senior correspondent Kristen Holmes asked…",
    "link": "https://www.mediaite.com/politics/trump-rages-at-cnn-for-asking-about-hegseth-you-know-you-work-for-the-democrats/",
    "timestamp": "2025-12-10T21:44:44Z"
  },
  {
    "title": "Pete Hegseth’s Own AI Bot Backfires on His Boat Strikes",
    "description": "Et tu, ChatGPT?On Tuesday, Defense Secretary Pete Hegseth unveiled his department’s new AI chatbot for military personnel, GenAI.mil. Almost immediately, the bot called a “hypothetical” situation where the government orders a strike on a suspected drug-smuggl…",
    "link": "https://newrepublic.com/post/204266/pete-hegseth-ai-bot-boat-strikes",
    "timestamp": "2025-12-10T21:44:24Z"
  },
  {
    "title": "Mamdani vows to resist Trump’s ‘cruel and inhumane’ immigration crackdown",
    "description": "New York City Mayor-elect Zohran Mamdani says his incoming administration will resist efforts by President Donald Trump to expand his immigration crackdown to the country’s largest city.\nMamdani, who is set to be inaugurated on Jan. 1, told MS NOW senior poli…",
    "link": "https://biztoc.com/x/af8a73b38d119c3b",
    "timestamp": "2025-12-10T21:40:20Z"
  },
  {
    "title": "Federal Reserve cuts key rate",
    "description": "WASHINGTON — The Federal Reserve reduced its key interest rate for the third time in a row Wednesday but signaled that it may leave rates unchanged in the coming months, a move that could attract ire from President Donald Trump, who has demanded steep reducti…",
    "link": "https://biztoc.com/x/6d966d7d24ececfd",
    "timestamp": "2025-12-10T21:40:14Z"
  },
  {
    "title": "49-year-old Democrat who owns a gourmet olive oil store swipes another historically Republican district from Trump and Republicans",
    "description": "Eric Gisler, who works for an insurance technology company, campaigned on improving health care and increasing affordability/",
    "link": "https://fortune.com/2025/12/10/eric-gisler-georgia-democrat-wins-special-election/",
    "timestamp": "2025-12-10T21:39:01Z"
  },
  {
    "title": "EU plans to treat Belgium like Hungary if it doesn’t back Ukraine loan",
    "description": "Frozen out and cold-shouldered: The reality facing Belgian Prime Minister Bart De Wever if he torpedoes the EU's plan.",
    "link": "https://www.politico.eu/article/europe-belgium-hungary-ukraine-loan-war-russia-funds-finances/",
    "timestamp": "2025-12-10T21:38:34Z"
  },
  {
    "title": "Trump Continues to Blame Economic Pain on Biden: ‘Only Been Here a Short While’",
    "description": "President Donald Trump on Wednesday continued pinning the blame on former President Joe Biden for any economic hardships Americans may be suffering.\nThe post Trump Continues to Blame Economic Pain on Biden: ‘Only Been Here a Short While’ first appeared on Med…",
    "link": "https://www.mediaite.com/politics/trump-continues-to-blame-economic-pain-on-biden-only-been-here-a-short-while/",
    "timestamp": "2025-12-10T21:37:06Z"
  },
  {
    "title": "U.S. Federal Reserve cuts key rate but signals higher bar for future reductions",
    "description": "The Federal Reserve reduced its key interest rate by a quarter-point for the third time in a row Wednesday but signaled that it may leave rates unchanged in the coming months, a move that could attract ire from President Donald Trump, who has demanded steep r…",
    "link": "https://japantoday.com/category/business/federal-reserve-likely-to-cut-rates-may-signal-just-one-more-reduction-next-year",
    "timestamp": "2025-12-10T21:37:02Z"
  },
  {
    "title": "Zelenskyy says he discussed with Ukrainian parliament ways of holding election",
    "description": "Zelenskyy has recently faced comments from US President Donald Trump on Ukraine's postponed presidential election, and says \"pressure on this issue is definitely not what we need.\"",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-trump-us-ukraine-russia-election-5574861",
    "timestamp": "2025-12-10T21:36:13Z"
  }
]