[
  {
    "title": "Japan’s parliament elects nation’s first female prime minister",
    "description": "“Political stability is essential right now,” said Sanae Takaichi.",
    "link": "https://www.politico.com/news/2025/10/21/japans-parliament-elects-nations-first-female-prime-minister-00616219",
    "timestamp": "2025-10-21T05:08:47Z"
  },
  {
    "title": "Senate Republicans head to White House amid stalemate on shutdown",
    "description": "As the government shutdown enters its fourth week, President Donald Trump is welcoming Senate Republicans for lunch at the White House.",
    "link": "https://www.ksat.com/news/politics/2025/10/21/senate-republicans-head-to-white-house-amid-stalemate-on-shutdown/",
    "timestamp": "2025-10-21T05:08:31Z"
  },
  {
    "title": "'Never trust an Indian, MLK Jr. holiday belongs in hell': Trump nominee Paul Ingrassia under fire over racist, pro-Nazi leaked chats",
    "description": "Donald Trump's nominee for Special Counsel, Paul Ingrassia, faces scrutiny over alleged racist and antisemitic remarks in a Republican group chat. He referred to then-presidential candidate Vivek Ramaswamy and said 'never trust a chinaman or Indian'. Reports …",
    "link": "https://economictimes.indiatimes.com/news/new-updates/never-trust-an-indian-mlk-jr-holiday-belongs-in-hell-trump-nominee-paul-ingrassia-under-fire-over-racist-pro-nazi-leaked-chats/articleshow/124714020.cms",
    "timestamp": "2025-10-21T05:07:30Z"
  },
  {
    "title": "Trump confirms plan to visit Japan after trip to Malaysia",
    "description": "The U.S. president is expected to visit Japan for three days from Oct. 27 after visiting Malaysia, where the Association of Southeast Asian Nations will hold a summit.",
    "link": "https://www.japantimes.co.jp/news/2025/10/21/japan/politics/trump-japan-visit-plan/",
    "timestamp": "2025-10-21T05:06:00Z"
  },
  {
    "title": "Sanae Takaichi named Japan's first female prime minister",
    "description": "The lower house of parliament has elected the ultraconservative lawmaker. Official approval by the Emperor is expected later in the day. Sanae Takaichi, 64, will officially become Japan's first female prime minister after meeting with the Emperor later on Tue…",
    "link": "https://www.dw.com/en/sanae-takaichi-named-japans-first-female-prime-minister/a-74433485",
    "timestamp": "2025-10-21T05:06:00Z"
  },
  {
    "title": "EU, Zelenskyy Doubt Putin On Peace As Kremlin Says Work On Budapest Summit To Begin 'Shortly'",
    "description": "The European Union and Ukrainian President Volodymyr Zelenskyy expressed doubts about Russian President Vladimir Putin's willingness to end the more than three-year war in Ukraine as the prospect of a summit in Budapest with US President Donald Trump looms.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251020-rferl04.htm",
    "timestamp": "2025-10-21T05:04:38Z"
  },
  {
    "title": "Diet elects Sanae Takaichi as Japan's first female prime minister",
    "description": "Japan's Diet elected ultraconservative Sanae Takaichi as the country’s first female prime minister Tuesday, a day after her struggling party struck a coalition deal with a new partner expected to pull her governing bloc further to the right. Takaichi replaces…",
    "link": "https://japantoday.com/category/politics/Diet-elects-Sanae-Takaichi-as-Japan%27s-first-female-prime-minister",
    "timestamp": "2025-10-21T05:02:50Z"
  },
  {
    "title": "Europe Jumps Into Action After Trump Call With Putin, Zelenskyy Meeting",
    "description": "Europe jumped into action on October 20 with a flurry of moves and announcements at it looked to ratchet up pressure on Russia and bolster support for Ukraine after US President Donald Trump reportedly pushed his Ukrainian counterpart Volodymyr Zelenskyy to g…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251020-rferl03.htm",
    "timestamp": "2025-10-21T05:01:48Z"
  },
  {
    "title": "Karoline Leavitt Blasts Reporter by Posting Screenshot of His Private Texts. Now Her Bizarre Reply Is Going Viral",
    "description": "\"Immature and childish,\" one person said of the White House press secretary's response",
    "link": "https://people.com/karoline-leavitt-blasts-reporter-by-posting-screenshot-of-his-private-texts-now-her-bizarre-reply-is-going-viral-11833548",
    "timestamp": "2025-10-21T05:01:32Z"
  },
  {
    "title": "Why World Leaders Are Descending on ASEAN",
    "description": "Timor-Leste’s president said it was easier to get into heaven than the Southeast Asian bloc.",
    "link": "http://foreignpolicy.com/2025/10/21/asean-summit-kuala-lumpur-malaysia-trump/",
    "timestamp": "2025-10-21T05:00:50Z"
  },
  {
    "title": "Trump Warns Hamas Not To Breach Gaza Deal As Vance Heads To Israel",
    "description": "US President Donald Trump threatened to \"eradicate\" Hamas if it breached its ceasefire deal with Israel, as Vice President JD Vance travelled to the region Tuesday to bolster the fragile Gaza truce.",
    "link": "https://www.ibtimes.com/trump-warns-hamas-not-breach-gaza-deal-vance-heads-israel-3787769",
    "timestamp": "2025-10-21T05:00:14Z"
  },
  {
    "title": "Fintan O'Toole: Catherine Connolly is going to win. Heather Humphreys needs to be a better loser",
    "description": "Fine Gael candidate must know her cheap shot at independent rival comes with heavy price tag",
    "link": "https://www.irishtimes.com/opinion/2025/10/21/fintan-otoole-catherine-connolly-is-going-to-win-heather-humphreys-needs-to-be-a-better-loser/",
    "timestamp": "2025-10-21T05:00:01Z"
  },
  {
    "title": "Catherine Connolly has clearly won the digital media battle in the presidential election",
    "description": "A cautious party insider facing off against a confident outsider who thrives on digital media",
    "link": "https://www.irishtimes.com/media/2025/10/21/catherine-connolly-has-won-the-digital-media-battle-in-the-presidential-election-hands-down/",
    "timestamp": "2025-10-21T05:00:01Z"
  },
  {
    "title": "Opinion: Trump may have helped to broker an uneasy ceasefire in Gaza, but at what price?",
    "description": "The ceasefire has brought some respite, but it represents the most recent US assault on fundamental principles of international law",
    "link": "https://www.irishtimes.com/opinion/2025/10/21/opinion-trump-may-have-helped-to-broker-an-uneasy-ceasefire-in-gaza-but-at-what-price/",
    "timestamp": "2025-10-21T05:00:00Z"
  },
  {
    "title": "Irish farmer who left school at 13 now holds meetings with von der Leyen and Macron",
    "description": "Offaly man Séamus Boland set to become president of European Economic and Social Committee",
    "link": "https://www.irishtimes.com/politics/2025/10/21/irish-farmer-who-left-school-at-13-now-holds-meetings-with-von-der-leyen-and-macron/",
    "timestamp": "2025-10-21T05:00:00Z"
  },
  {
    "title": "Parliament elects Sanae Takaichi as Japan's first female prime minister",
    "description": "Japan has a new leader, Sanae Takaichi, the nation's first female prime minister. Her ultraconservative party formed a coalition with a new partner. This move shifts the government further right. Takaichi faces immediate challenges including economic measures…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/parliament-elects-sanae-takaichi-as-japans-first-female-prime-minister/articleshow/124714034.cms",
    "timestamp": "2025-10-21T04:59:33Z"
  },
  {
    "title": "Trump Mansplains To Female Journalist: ‘If You Knew Anything…’",
    "description": "The president berated with a patronizing response.",
    "link": "https://www.huffpost.com/entry/donald-trump-female-reporter_n_68f70a38e4b02abf9d4406c5",
    "timestamp": "2025-10-21T04:57:44Z"
  },
  {
    "title": "Asian stocks surge as trade tensions ease, Nikkei hits record",
    "description": "Nikkei on the cusp of 50,000; soars on market expectations that Sanae Takaichi will take over as Japan's next prime minister",
    "link": "https://www.thehindubusinessline.com/markets/asian-stocks-surge-as-trade-tensions-ease-nikkei-hits-record/article70185270.ece",
    "timestamp": "2025-10-21T04:56:04Z"
  },
  {
    "title": "Eastern Europe is the West's last hope",
    "description": "If we don't close the UN, the UN will close the West and replace it with the \"Global South”. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416561",
    "timestamp": "2025-10-21T04:54:16Z"
  },
  {
    "title": "A Grand Teton mountain runner set a record. But his route turned into a crime",
    "description": "Prosecutors are backing off a bit after getting a misdemeanor conviction against a record-setting mountain runner in a national park",
    "link": "https://abcnews.go.com/US/wireStory/grand-teton-mountain-runner-set-record-route-turned-126708252",
    "timestamp": "2025-10-21T04:53:47Z"
  },
  {
    "title": "US and Australia sign critical-minerals agreement as a way to counter China",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese have signed a critical-minerals deal at the White House",
    "link": "https://abcnews.go.com/US/wireStory/us-australia-sign-critical-minerals-agreement-counter-china-126693032",
    "timestamp": "2025-10-21T04:53:35Z"
  },
  {
    "title": "Here's Why Russia's Vladimir Putin Is Fixated On Ukraine's Donbas",
    "description": "At a tense White House meeting with Volodymyr Zelenskyy, US President Donald Trump pushed the Ukrainian leader, telling him he would probably have to give up swaths of Ukrainian land to end the war with Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251020-rferl01.htm",
    "timestamp": "2025-10-21T04:50:46Z"
  },
  {
    "title": "MAGA Beauty Queen Prosecutor’s Disastrous Signal Texts Revealed",
    "description": "A Trump-appointed prosecutor tried to claim that a series of messages to a reporter criticizing her coverage had been “off the record.” But she was too late....",
    "link": "https://www.thedailybeast.com/maga-beauty-queen-prosecutors-disastrous-signal-texts-revealed/",
    "timestamp": "2025-10-21T04:48:25Z"
  },
  {
    "title": "Trump Says Efforts To Reach Peace Deal Ongoing As Ukraine, EU Make Their Own Diplomatic Moves",
    "description": "US President Donald Trump said on October 20 that attempts to reach an agreement between Russia and Ukraine to end the war are ongoing, and warned that if an agreement is not reached the consequences will be serious.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/10/ukraine-251021-rferl01.htm",
    "timestamp": "2025-10-21T04:47:21Z"
  },
  {
    "title": "RAND PAUL praised for expressing concern over the regime's policy of vaporizing speedboats in the Caribbean, still not praised for being RAND PAUL. RAND PAUL [Followup]",
    "description": "RAND PAUL praised for expressing concern over the regime's policy of vaporizing speedboats in the Caribbean, still not praised for being RAND PAUL. RAND PAUL",
    "link": "https://www.fark.com/comments/13851246/RAND-PAUL-praised-for-expressing-concern-over-regimes-policy-of-vaporizing-speedboats-in-Caribbean-still-not-praised-for-being-RAND-PAUL-RAND-PAUL",
    "timestamp": "2025-10-21T04:42:22Z"
  },
  {
    "title": "Anti-ICE protesters clash with federal agents in Portland (VIDEO)",
    "description": "Pro-immigration protesters have clashed with police outside an ICE facility in Portland, Oregon Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626741-portland-clashes-anti-ice/",
    "timestamp": "2025-10-21T04:37:36Z"
  },
  {
    "title": "House Republicans preparing report on Biden's use of autopen after months of investigation",
    "description": "House Republicans are preparing to release a report about President Joe Biden's mental state and the alleged misuse of the presidential autopen during his term",
    "link": "https://abcnews.go.com/Politics/wireStory/house-republicans-preparing-report-bidens-autopen-after-months-126708068",
    "timestamp": "2025-10-21T04:37:30Z"
  },
  {
    "title": "Asian markets extend gains, Japan’s Nikkei nears 50,000-level",
    "description": "BANGKOK (AP) — Asian markets advanced on Tuesday, with Japan’s benchmark approaching the symbolically important 50,000 level for the first time as conservative lawmaker Sanae Takaichi was poised to become the country’s first female prime minister. The Nikkei …",
    "link": "https://financialpost.com/pmn/asian-markets-extend-gains-japans-nikkei-nears-50000-level",
    "timestamp": "2025-10-21T04:31:59Z"
  },
  {
    "title": "US steps up diplomatic efforts to keep Gaza truce intact",
    "description": "US envoys met Israeli prime minister Benjamin Netanyahu yesterday aiming to corral Israel and Hamas to get the Gaza ceasefire plan back on track after an explosion of violence over the weekend that threatened to derail the week-old truce.",
    "link": "https://www.independent.ie/world-news/middle-east/us-steps-up-diplomatic-efforts-to-keep-gaza-truce-intact/a707760570.html",
    "timestamp": "2025-10-21T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Road to lasting peace in Gaza remains fraught with obstacles",
    "description": "Eight days ago, US president Donald Trump was given a hero’s welcome in Israel after securing a ceasefire in Gaza amid the lined-up exchange of Israeli hostages for Palestinian prisoners.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-road-to-lasting-peace-in-gaza-remains-fraught-with-obstacles/a833104480.html",
    "timestamp": "2025-10-21T04:30:00Z"
  },
  {
    "title": "‘My meeting with Trump was positive for Ukraine,’ says Zelensky",
    "description": "Ukrainian president Volodymyr Zelensky said his reportedly tense meeting with US president Donald Trump last week was “positive” – even though he did not secure the Tomahawk missiles for Ukraine – and emphasised what he said is continued American interest in …",
    "link": "https://www.independent.ie/world-news/europe/my-meeting-with-trump-was-positive-for-ukraine-says-zelensky/a1642272982.html",
    "timestamp": "2025-10-21T04:30:00Z"
  },
  {
    "title": "Samuel Ramani: Donald Trump and Vladimir Putin’s peace demands to Ukraine would set up another war that Russia would win",
    "description": "US president Donald Trump’s chief envoy Steve Witkoff has a plan to end Russia’s invasion of Ukraine. During a recent Oval Office meeting, Witkoff proposed that Ukraine surrender its eastern region of Donetsk in exchange for peace. Witkoff justified this pres…",
    "link": "https://www.independent.ie/opinion/comment/samuel-ramani-donald-trump-and-vladimir-putins-peace-demands-to-ukraine-would-set-up-another-war-that-russia-would-win/a497628296.html",
    "timestamp": "2025-10-21T04:30:00Z"
  },
  {
    "title": "Seth Meyers Deflates GOP's 'Massive' Trump Claim Using 1 NSFW Example",
    "description": "The \"Late Night\" host hit back at the right-wing brag with a \"vivid illustration.\"",
    "link": "https://www.huffpost.com/entry/seth-meyers-republicans-trump-mandate-no-kings-protests_n_68f6f17de4b0dbac459092c6",
    "timestamp": "2025-10-21T04:27:59Z"
  },
  {
    "title": "When Trump was ready to take his pound of flesh, Rudd was here to help",
    "description": "From his humble early days as a child reading Hansard in the regional Sunshine State pocket of Eumundi, Kevin Rudd has been preparing for this martyrdom. But the Passion Of The Kevin, when it came, was a million miles from home.",
    "link": "https://www.abc.net.au/news/2025-10-21/trump-albanese-meeting-rudd-pound-of-flesh/105916336",
    "timestamp": "2025-10-21T04:27:29Z"
  },
  {
    "title": "Ethiopia in talks with China to convert Dollar loans to yuan",
    "description": "The proposed switch by Ethiopia adds to a growing list of countries that are turning to the yuan for cheaper financing, including Sri Lanka, Hungary and Kenya",
    "link": "https://www.bloomberg.com/news/articles/2025-10-20/ethiopia-in-talks-with-china-to-convert-dollar-loans-into-yuan",
    "timestamp": "2025-10-21T04:27:00Z"
  },
  {
    "title": "Asian markets extend gains, Japan's Nikkei nears 50,000-level",
    "description": "Asian markets advanced on Tuesday, with Japan’s benchmark approaching the symbolically important 50,000 level for the first time as conservative lawmaker...",
    "link": "https://www.yahoo.com/news/articles/asian-markets-extend-gains-japans-042635198.html",
    "timestamp": "2025-10-21T04:26:35Z"
  },
  {
    "title": "Trump downplays Taiwan risk in China talks, expects fair trade deal",
    "description": "US President Donald Trump anticipates a fair trade agreement with China's Xi Jinping. He believes China has no plans to invade Taiwan. However, a top US trade official has accused Beijing of economic coercion. These statements come ahead of a planned meeting …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-downplays-taiwan-risk-in-china-talks-expects-fair-trade-deal/articleshow/124713381.cms",
    "timestamp": "2025-10-21T04:19:34Z"
  },
  {
    "title": "Trump's AI video sparks outrage: 'Danger Zone' controversy explodes after Kenny Loggins steps in as clip targets 'No Kings' protesters",
    "description": "President Trump ignited controversy with AI-generated videos depicting him as a king piloting a jet and dumping liquid on 'No Kings' demonstrators. Musician Kenny Loggins demanded his song 'Danger Zone' be removed from one clip, citing its divisive nature.  M…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trumps-ai-video-sparks-outrage-danger-zone-controversy-explodes-as-kenny-loggins-steps-in-as-clip-targets-no-kings-protesters/articleshow/124713170.cms",
    "timestamp": "2025-10-21T04:18:13Z"
  },
  {
    "title": "Myanmar military shuts down a major cybercrime center and detains over 2,000 people",
    "description": "Myanmar's military has dismantled a major online scam operation at KK Park near the Thai border, detaining over 2,000 individuals and seizing numerous Starlink satellite internet terminals. This crackdown follows international pressure and previous operations…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/myanmar-military-shuts-down-a-major-cybercrime-center-and-detains-over-2000-people/articleshow/124713082.cms",
    "timestamp": "2025-10-21T04:17:41Z"
  },
  {
    "title": "Ariarne Titmus opens up on the emotional moment she leaves behind years of anti-doping routines after retiring from swimming",
    "description": "Australian swimmer Ariarne Titmus has retired from competitive swimming. Her career included Olympic medals and record-breaking performances. Titmus also ended her anti-doping whereabouts submissions. This marks a significant personal transition for the athle…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/ariarne-titmus-opens-up-on-the-emotional-moment-she-leaves-behind-years-of-anti-doping-routines-after-retiring-from-swimming/articleshow/124713185.cms",
    "timestamp": "2025-10-21T04:16:03Z"
  },
  {
    "title": "Senate Republicans head to White House amid stalemate on shutdown",
    "description": "As the government shutdown enters its fourth week, Senate Republicans are headed to the White House — not for urgent talks on how to end it, but for a display of unity with President Donald Trump as they refuse to negotiate on any Democratic demands. However,…",
    "link": "https://apnews.com/article/shutdown-republicans-senate-trump-white-house-8cac539f2a553ced68bc9e0b32bc7b94",
    "timestamp": "2025-10-21T04:15:58Z"
  },
  {
    "title": "Japan’s parliament set to elect Sanae Takaichi as nation’s first female prime minister",
    "description": "Takaichi will replace Prime Minister Shigeru Ishiba, ending a three-month political vacuum and wrangling since the Liberal Democratic Party's disastrous election loss in July.",
    "link": "https://indianexpress.com/article/world/japan-parliament-to-elect-sanae-takaichi-nations-first-female-prime-minister-10318272/",
    "timestamp": "2025-10-21T04:15:40Z"
  },
  {
    "title": "Cruz call data allegedly requested in Jan. 6 probe",
    "description": "United States Senator Ted Cruz's cellphone records were subpoenaed during former Special Counsel Jack Smith's investigations into US President Donald Trump, Axios reported, citing a copy of th...",
    "link": "https://biztoc.com/x/5b2f0647e0e17401",
    "timestamp": "2025-10-21T04:13:41Z"
  },
  {
    "title": "Gas Prices Hit Four-Year Low Under President Trump ⛽",
    "description": "Americans are seeing some of the lowest prices at the gas pump in more than four years as President Donald J. Trump’s relentless commitment to American energy production pays off. GasBuddy reports the nationwide average for gasoline has dropped to $2.98 per g…",
    "link": "https://biztoc.com/x/97aa3d90efc99909",
    "timestamp": "2025-10-21T04:13:38Z"
  },
  {
    "title": "Mysuru Child Welfare Committee rescues minor mother from MP",
    "description": "A 17-year-old girl, who gave birth to her second child in Mysuru, has been rescued by the District Child Welfare Committee. She arrived in the city with her husband and mother-in-law to sell goods during Dasara. Authorities are providing her and her newborn w…",
    "link": "https://timesofindia.indiatimes.com/city/mysuru/mysuru-child-welfare-committee-rescues-minor-mother-from-mp/articleshow/124713206.cms",
    "timestamp": "2025-10-21T04:11:49Z"
  },
  {
    "title": "Foreign Affairs Open Thread: Don’t Cry for Milei, Argentina",
    "description": "Argentina edition of Libertarian bible [image or embed] — Albert Pinto (@70sbachchan.bsky.social) October 11, 2025 at 9:40 AM === Q: What do you have to say to farmers who feel that the deal is benefitting Argentina more than it is them? TRUMP: Look, Argentin…",
    "link": "https://balloon-juice.com/2025/10/21/foreign-affairs-open-thread-dont-cry-for-milei-argentina/",
    "timestamp": "2025-10-21T04:10:13Z"
  },
  {
    "title": "Trump's truck tariff threatens to ripples through US economy",
    "description": "US President Donald Trump has imposed a 25% tariff on imported medium and heavy trucks and parts, effective November 1, 2025, under Section 232 national security provisions. Buses face a 10% levy. While targeting foreign manufacturers, the tariffs will trigge…",
    "link": "https://www.digitimes.com/news/a20251021PD206/donald-trump-cost-automakers-security-economy.html",
    "timestamp": "2025-10-21T04:06:22Z"
  },
  {
    "title": "Bigg Boss Kannada 12: Tension rise as Rashika and Rakshitha clash over nominations",
    "description": "Tensions escalated in Bigg Boss Kannada 12's fourth week as Rakshitha nominated Rashika, citing her dependence on others. Rashika defended herself, leading to a heated exchange about earning respect. Another contestant, dubbed the 'gilli actor,' also faced mu…",
    "link": "https://timesofindia.indiatimes.com/tv/news/kannada/bigg-boss-kannada-12-tension-rise-as-rashika-and-rakshitha-clash-over-nominations/articleshow/124713092.cms",
    "timestamp": "2025-10-21T04:06:16Z"
  },
  {
    "title": "Joe Rogan’s Unprincipled Immigration Politics",
    "description": "‘FanDuel Americans’ aren’t woke, but they’re not right-wing either.\nThe post Joe Rogan’s Unprincipled Immigration Politics appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/joe-rogans-unprincipled-immigration-politics/",
    "timestamp": "2025-10-21T04:05:00Z"
  },
  {
    "title": "Trump pushing Allies to Buy US Gas is bad Economics and a Climate Catastrophe",
    "description": "By Christoph Nedopil, Griffith University (The Conversation) - The price of partnership with the United States has changed. Washington is now using assurances of defence and trade access to pressure allies in Europe and Asia to buy more of its fossil fuels un…",
    "link": "https://www.juancole.com/2025/10/pushing-economics-catastrophe.html",
    "timestamp": "2025-10-21T04:04:52Z"
  },
  {
    "title": "Senate Republicans head to White House during shutdown",
    "description": "As the government shutdown enters its fourth week, President Donald Trump is welcoming Senate Republicans for lunch at the White House",
    "link": "https://www.wftv.com/news/business/trump-hosts-senate/3IEMY4GVNQYHXCOS4HJZDA4JRQ/",
    "timestamp": "2025-10-21T04:01:11Z"
  },
  {
    "title": "Joe Biden completes round of radiation therapy for prostate cancer",
    "description": "A spokesperson for Joe Biden says the former Democratic president has completed several weeks of radiation therapy to treat an aggressive form of prostate cancer.",
    "link": "https://www.wcvb.com/article/joe-biden-prostate-cancer-radiation-therapy/69100491",
    "timestamp": "2025-10-21T04:00:57Z"
  },
  {
    "title": "Trump Declares ‘We Are Bringing LAW AND ORDER Back’ Just Days After Commuting Fraudster’s Prison Sentence",
    "description": "President Donald Trump boasted that his administration is \"bringing law and order back\" just three days after commuting the sentence of former Rep. George Santos.\nThe post Trump Declares ‘We Are Bringing LAW AND ORDER Back’ Just Days After Commuting Fraudster…",
    "link": "https://www.mediaite.com/politics/trump/trump-declares-we-are-bringing-law-and-order-back-just-days-after-commuting-fraudsters-prison-sentence/",
    "timestamp": "2025-10-21T04:00:50Z"
  },
  {
    "title": "Nordic noir: How Norway went from Israel’s friend to its foe",
    "description": "To outsiders, it may seem strange that Norwegians – prosperous, peaceful and geographically distant from the conflict – so often take positions that provoke their allies",
    "link": "https://www.euractiv.com/news/nordic-noir-how-norway-went-from-israels-friend-to-its-foe/",
    "timestamp": "2025-10-21T04:00:30Z"
  },
  {
    "title": "Trump’s pharma strategy ‘holds Europe hostage’, Finnish MEP warns",
    "description": "Trump’s deals with Pfizer, AstraZeneca, and Merck expose risk to EU",
    "link": "https://www.euractiv.com/news/trumps-pharma-strategy-holds-europe-hostage-finnish-mep-warns/",
    "timestamp": "2025-10-21T04:00:18Z"
  },
  {
    "title": "Should you still buy gold? The ‘insane’ rush may have some way to go",
    "description": "The price of gold has surged by more than 60% this year alone to a succession of record highs as investors and central banks pile in",
    "link": "https://www.irishtimes.com/business/2025/10/21/should-you-still-buy-gold-the-insane-rush-may-have-some-way-to-go/",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "America's Morality Conundrum is Solvable",
    "description": "Photo Credit:Obama and Trump\n \n wikim picryl pub domainDid President Obama change America forever?",
    "link": "https://www.americanthinker.com/articles/2025/10/america_s_morality_conundrum_is_solvable.html",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "Petro calls for Trump's death if he doesn't change his point of view",
    "description": "If there's any doubt Colombia is being led by a terroristic freak, the matter has been put to rest by this interview here:\r\n\r\n\r\n\r\nColombian President Gustavo Francisco Petro appears to threaten President Donald Trump, saying that if people cannot...",
    "link": "https://www.americanthinker.com/blog/2025/10/petro_calls_for_trump_s_death_if_he_doesn_t_change_his_point_of_view.html",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "What President Trump is going to Budapest for",
    "description": "I am continuing to prepare for President Donald Trump’s trip to Budapest, where he will meet with President Putin. In order to negotiate an end to the war with Ukraine, it is necessary to know for what Putin sent his soldiers there. To clarify,...",
    "link": "https://www.americanthinker.com/blog/2025/10/what_president_trump_is_going_to_budapest_for.html",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "Symbolism isn’t strategy: Reflection on protest and policy",
    "description": "This past Saturday, the “No Kings” protest swept across major cities in the United States, drawing thousands of demonstrators, many of them older Americans in their 50s, 60s, and beyond, marching with signs, chanting slogans, and singing ...",
    "link": "https://www.americanthinker.com/blog/2025/10/symbolism_isn_t_strategy_reflection_on_protest_and_policy.html",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "Canada: A Socialist Paradise Lost",
    "description": "Canada should be one of the world’s best countries to live in, and for many people it once was.  Possessing vast natural resources and reserves of energy (exceeding those of the U.S. on a per capita basis), endless natural space (as t...",
    "link": "https://www.americanthinker.com/articles/2025/10/canada_a_socialist_paradise_lost.html",
    "timestamp": "2025-10-21T04:00:00Z"
  },
  {
    "title": "China hawk Takaichi set to be Japan's first woman PM",
    "description": "Japan was set to get its first woman prime minister on Tuesday after Sanae Takaichi, a China hawk and social conservative, forged an 11th-hour deal to form a...",
    "link": "https://www.yahoo.com/news/articles/china-hawk-takaichi-set-japans-013306588.html",
    "timestamp": "2025-10-21T03:58:32Z"
  },
  {
    "title": "Jon Stewart Mocks Fox News’ Characterization Of No Kings Rallies & Says Trump Is The “Imitation Crab Of Kings Right Now”",
    "description": "After another weekend of No Kings rallies — with some 7 million in attendance to protest President Donald Trump and his administration — Jon Stewart took up the mantle on Monday night’s episode of The Daily Show to mock Fox News’ dramatic coverage leading up …",
    "link": "http://deadline.com/2025/10/the-daily-show-no-kings-rallies-fox-news-donald-trump-1236592821/",
    "timestamp": "2025-10-21T03:48:37Z"
  },
  {
    "title": "Guruvayur temple audit: Valuables unchecked since 1980; Devaswom board tightens controls",
    "description": "An in-depth audit has shed light on troubling oversights in how Guruvayur Devaswom manages its valuable temple treasures, from gold to ivory. The lack of proper documentation and chaotic recordkeeping have raised serious alarms regarding the potential misuse …",
    "link": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/guruvayur-temple-audit-valuables-unchecked-since-1980-devaswom-board-tightens-controls/articleshow/124712892.cms",
    "timestamp": "2025-10-21T03:47:42Z"
  },
  {
    "title": "Pune: Allies criticise BJP MP Medha Kulkarni over ‘purification’ after namaz; NCP seeks police action",
    "description": "BJP MP Medha Kulkarni faced strong criticism from NCP and Shiv Sena for protesting and 'purifying' Shaniwarwada after Muslim women offered namaz. The NCP demanded a police case against her, alleging she disturbed communal harmony. The incident led to police d…",
    "link": "https://timesofindia.indiatimes.com/city/pune/pune-allies-criticise-bjp-mp-medha-kulkarni-over-purification-after-namaz-ncp-seeks-police-action/articleshow/124712949.cms",
    "timestamp": "2025-10-21T03:45:38Z"
  },
  {
    "title": "Trump hails FBI’s ‘historic results’ on Truth Social; 28,000 violent criminals arrested, 5,000 children rescued, and major drug and gang busts since January",
    "description": "President Donald Trump praised the Federal Bureau of Investigation for its work. The FBI arrested over 28,000 violent criminals. More than 6,000 illegal weapons were seized. Over 1,700 child predators and 300 human traffickers were apprehended. Approximately …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-hails-fbis-historic-results-on-truth-social-28000-violent-criminals-arrested-5000-children-rescued-and-major-drug-and-gang-busts-since-january/articleshow/124712901.cms",
    "timestamp": "2025-10-21T03:43:34Z"
  },
  {
    "title": "Bihar polls: RJD’s Sasaram candidate arrested over 'bank robbery' case; 3rd INDIA bloc leader held post-filing",
    "description": "RJD candidate Satendra Sah was arrested in Sasaram, Bihar, after filing nomination papers due to a pending Jharkhand Police warrant for a 2004 bank robbery. This marks the third INDIA bloc candidate arrested post-nomination, with CPI(ML) Liberation condemning…",
    "link": "https://timesofindia.indiatimes.com/city/patna/bihar-polls-rjds-sasaram-candidate-arrested-after-filing-nomination-over-bank-robbery-case-3rd-candidate-held-post-filing/articleshow/124712847.cms",
    "timestamp": "2025-10-21T03:41:38Z"
  },
  {
    "title": "Former swimming star Riley Gaines raises alarm over controversial books at her hometown library sparking heated debate",
    "description": "Former UK swimmer Riley Gaines has sparked debate by criticizing her hometown library for stocking books on gender identity for children. She argues this defies Tennessee's law against funding 'woke gender ideology,' despite parental concerns. The library's s…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/former-swimming-star-riley-gaines-raises-alarm-over-controversial-books-at-her-nashville-library-sparking-heated-debate/articleshow/124712865.cms",
    "timestamp": "2025-10-21T03:36:51Z"
  },
  {
    "title": "Can Albanese claim ‘success’ with Trump? Beyond the banter, the vague commitments should be viewed with scepticism",
    "description": "Trump waved away concerns about AUKUS, but as is common with the mercurial president, much of the detail is unclear or a problem for the future.",
    "link": "https://theconversation.com/can-albanese-claim-success-with-trump-beyond-the-banter-the-vague-commitments-should-be-viewed-with-scepticism-267434",
    "timestamp": "2025-10-21T03:34:42Z"
  },
  {
    "title": "Harry Sisson challenges Trump after he dropped faeces on him in AI video",
    "description": "Young activist Harry Sisson challenged Donald Trump after the former president posted an AI-generated video depicting him dropping feces on Sisson and \"No Kings\" protesters. Sisson interpreted the video as a sign of Trump's fear of the growing protest movemen…",
    "link": "https://economictimes.indiatimes.com/news/international/us/harry-sisson-challenges-trump-after-he-dropped-faeces-on-him-in-ai-video/articleshow/124712805.cms",
    "timestamp": "2025-10-21T03:32:47Z"
  },
  {
    "title": "Pakistani man faces trial in Lahore after staying in India for 25 years",
    "description": "A Pakistani national, Hussain Ahmed, arrested in Lahore after the Pahalgam terror attack, faces trial for lacking valid documents. He had lived in India for 25 years with his Goan wife. Despite multiple bail rejections, the Lahore High Court has ordered his t…",
    "link": "https://timesofindia.indiatimes.com/city/delhi/pakistani-man-faces-trial-in-lahore-after-staying-in-india-for-25-years/articleshow/124712360.cms",
    "timestamp": "2025-10-21T03:29:58Z"
  },
  {
    "title": "Trump is going to Asia - what happens next is anyone's guess",
    "description": "This week, President Donald Trump embarks on a pivotal journey to Asia, aiming to mend trade rifts with China's Xi Jinping. His itinerary features key visits to Malaysia, Japan, and South Korea, where robust discussions surrounding trade agreements and foreig…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-is-going-to-asia-what-happens-next-is-anyones-guess-as-global-economy-looks-at-trade-talks/articleshow/124712850.cms",
    "timestamp": "2025-10-21T03:28:52Z"
  },
  {
    "title": "Why the Australia-US rare earths deal matters so much for Trump",
    "description": "<p>P﻿rime Minister Anthony Albanese and US President Donald Trump are crowing about the agreement, but will it make Australia a big player in critical minerals?</p>",
    "link": "https://www.9news.com.au/national/australia-and-us-rare-earths-deal-why-critical-minerals-are-so-vital-explained/c8ccd0ac-b0a1-467b-bdd3-ee35823d6d92",
    "timestamp": "2025-10-21T03:27:07Z"
  },
  {
    "title": "Chicago Mayor Johnson: Tyrant Trump Has 'Declared War on the City'",
    "description": "Monday on MSNBC's \"The Last Word,\" Chicago Mayor Brandon Johnson (D) claimed President Donald Trump had \"declared war on the city of Chicago.\"\nThe post Chicago Mayor Johnson: Tyrant Trump Has ‘Declared War on the City’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/10/20/chicago-mayor-johnson-tyrant-trump-has-declared-war-on-the-city/",
    "timestamp": "2025-10-21T03:24:25Z"
  },
  {
    "title": "Will this Gaza ceasefire hold? Islamic doctrine of hudna may be at play",
    "description": "As I reflect on this week's headlines, a familiar mix of cautious hope and unshakeable conviction, rooted in God's unchanging Word, stirs within me. For those of us who have traded an ideology of fear for the liberating truth of Christ, such moments resonate …",
    "link": "https://freerepublic.com/focus/f-religion/4347657/posts",
    "timestamp": "2025-10-21T03:23:35Z"
  },
  {
    "title": "‘No Kings’ crowds don’t want more democracy — they want LESS",
    "description": "Watching the “No Kings” protests, a friend commented: “Democracy dies when the other side wins. Another rule they wouldn’t want to have turned back on them.” That does seem to be the animating spirit not only of the various marches around the country, but of …",
    "link": "https://freerepublic.com/focus/f-news/4347656/posts",
    "timestamp": "2025-10-21T03:22:11Z"
  },
  {
    "title": "Russia sanctions bill on hold for now, Thune says (Jordain Carney/Politico)",
    "description": "Jordain Carney / Politico:\nRussia sanctions bill on hold for now, Thune says  —  Senate Majority Leader John Thune indicated Monday that legislation slapping new sanctions on Russia and its trading partners is on hold until after an upcoming meeting between P…",
    "link": "https://www.memeorandum.com/251020/p161",
    "timestamp": "2025-10-21T03:20:00Z"
  },
  {
    "title": "This Could Be the Worst News for Democrats About the Shutdown",
    "description": "Make no mistake about it, when the Democrats shutdown the government, they figured it would be an easy public relations victory for them. In all fairness, that’s usually how it goes, because they have the entire mainstream media pushing their talking points. …",
    "link": "https://freerepublic.com/focus/f-news/4347655/posts",
    "timestamp": "2025-10-21T03:17:29Z"
  },
  {
    "title": "Journalist Says He Saw Pro-Democrat Union ‘Recruiting’ Youth For Socialist Groups During LA’s ‘No Kings’ Protest",
    "description": "Independent journalist Anthony Cabassa said he witnessed the SEIU \"recruiting\" youth to \"resist fascism\" during Los Angeles' \"No Kings\" protest.",
    "link": "https://dailycaller.com/2025/10/20/anthony-cabassa-union-youth-socialism-no-kings-los-angeles/",
    "timestamp": "2025-10-21T03:10:37Z"
  },
  {
    "title": "Belize signs 'safe third country' agreement as part of Trump's immigration crackdown",
    "description": "The small Central American nation of Belize has signed a “safe third country” agreement with the United States",
    "link": "https://abcnews.go.com/International/wireStory/belize-signs-safe-country-agreement-part-trumps-immigration-126706896",
    "timestamp": "2025-10-21T03:09:30Z"
  },
  {
    "title": "Ron Paul Rips ‘Hysterical’ Trump For Calling His Son a ‘Nasty Liddle Guy’",
    "description": "Former Republican presidential candidate Ron Paul responded on Monday after President Donald Trump called his son, Sen. Rand Paul (R-KY), a \"nasty liddle guy.\"\nThe post Ron Paul Rips ‘Hysterical’ Trump For Calling His Son a ‘Nasty Liddle Guy’ first appeared o…",
    "link": "https://www.mediaite.com/politics/ron-paul-rips-hysterical-trump-for-calling-his-son-a-nasty-liddle-guy/",
    "timestamp": "2025-10-21T03:08:22Z"
  },
  {
    "title": "EU state to offer air corridor for Putin-Trump summit – foreign minister",
    "description": "Bulgaria would offer an air corridor for Russia’s Vladimir Putin to travel for a meeting with Donald Trump in Hungary Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626740-bulgaria-air-corridor-putin/",
    "timestamp": "2025-10-21T03:08:09Z"
  },
  {
    "title": "Neither Party Dominates in Favorability or Trust",
    "description": "Americans rate the Republican and Democratic parties similarly, but their reasons for liking or disliking each party vary greatly.",
    "link": "https://news.gallup.com/poll/696635/neither-party-dominates-favorability-trust.aspx",
    "timestamp": "2025-10-21T03:00:00Z"
  },
  {
    "title": "Friendly Albanese-Trump meeting masks Australia's creeping doubts about US",
    "description": "The talks in Washington were a win for Australia, but at home many are nervous about the relationship.",
    "link": "https://www.bbc.com/news/articles/clyz5p0e2j0o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-21T02:58:26Z"
  },
  {
    "title": "Report: US concerned Netanyahu may abandon Gaza plan",
    "description": "New York Times reports that the White House is scrambling to preserve the Gaza peace deal as Netanyahu weighs military options. Vance, Kushner, and Witkoff’s visit in Israel is an attempt to stabilize the truce.",
    "link": "https://www.israelnationalnews.com/news/416558",
    "timestamp": "2025-10-21T02:58:20Z"
  },
  {
    "title": "US dollar wavers with politics and trade tensions in focus",
    "description": "The dollar edged higher against the yen on Monday as investors shifted their focus to political developments in Japan and the euro area, while U.S. credit risk concerns lingered.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/us-dollar-wavers-with-politics-and-trade-tensions-in-focus/articleshow/124712390.cms",
    "timestamp": "2025-10-21T02:54:33Z"
  },
  {
    "title": "Kenny Loggins Slams Donald Trump for Using His Song ‘Danger Zone’ in AI Video Without Permission",
    "description": "Kenny Loggins is calling on President Donald Trump to take down the AI-generated video he posted on his social media platform Truth Social that uses the singer’s 1986 hit song “Danger Zone” without permission. According to a statement issued by the “Footloose…",
    "link": "https://www.justjared.com/2025/10/20/kenny-loggins-slams-donald-trump-for-using-his-song-%e2%80%98danger-zone%e2%80%99-in-ai-video-without-permission/",
    "timestamp": "2025-10-21T02:52:42Z"
  },
  {
    "title": "Asian stocks surge as trade tensions ease, Nikkei hits record",
    "description": "Asian stocks rose on Tuesday as the prospect of easing trade tensions between the world's top two economies boosted risk sentiment, while the near-certainty of Sanae Takaichi becoming Japan's next prime minister sent the Nikkei to a record high.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-surge-as-trade-tensions-ease-nikkei-hits-record/articleshow/124712358.cms",
    "timestamp": "2025-10-21T02:51:16Z"
  },
  {
    "title": "Disney Takes Big Hit After Jimmy Kimmel’s Suspension — The Numbers Are In Showing Just How Big",
    "description": "When Jimmy Kimmel's late night show was briefly suspended, calls to boycott Disney+ and Hulu trended across social media. Newly released data shows those digital boycott threats do appear to have had a significant impact.\nThe post Disney Takes Big Hit After J…",
    "link": "https://www.mediaite.com/media/entertainment/disney-takes-big-hit-after-jimmy-kimmels-suspension-the-numbers-are-in-showing-just-how-big/",
    "timestamp": "2025-10-21T02:50:46Z"
  },
  {
    "title": "George Soros' foundation in trouble? Trump announces big move against billionaire after massive 'No Kings' protests in US",
    "description": "Millions of Americans participated in nationwide protests against Donald Trump's administration. Demonstrators voiced concerns about democracy and authoritarianism. President Trump dismissed the protests as a 'joke' and a 'small, ineffective' event. He also s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/george-soros-foundation-in-trouble-trump-announces-big-move-against-billionaire-after-massive-no-kings-protests-in-us/articleshow/124712258.cms",
    "timestamp": "2025-10-21T02:48:33Z"
  },
  {
    "title": "'What are we doing here?' CNN panelist slams Trump's latest 'affront to democracy'",
    "description": "Author and CNN panelist Keith Boykin slammed President Donald Trump's latest \"affront to democracy\" during CNN's \"NewsNight with Abby Phillip\" on Monday. Boykin and former George W. Bush administration spokesman Pete Seat clashed over the significance of an A…",
    "link": "https://www.rawstory.com/cnn-2674216956/",
    "timestamp": "2025-10-21T02:47:03Z"
  },
  {
    "title": "Crude oil prices decline on oversupply fears",
    "description": "Oil prices fell on Tuesday on concerns about excess supply and risks to demand stemming from tensions between the U.S. and China, the world's top two oil consumers, even as President Donald Trump said he expected to reach a trade deal.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/crude-oil-prices-decline-on-oversupply-fears/articleshow/124712312.cms",
    "timestamp": "2025-10-21T02:46:53Z"
  },
  {
    "title": "Newly-Released George Santos Tells Sean Hannity, ‘I Owe You an Apology’",
    "description": "Former Rep. George Santos appeared on Monday's edition of Hannity on Fox News, just days after the disgraced former lawmaker was released from federal prison. \nThe post Newly-Released George Santos Tells Sean Hannity, ‘I Owe You an Apology’  first appeared on…",
    "link": "https://www.mediaite.com/media/tv/newly-released-george-santos-tells-sean-hannity-i-owe-you-an-apology/",
    "timestamp": "2025-10-21T02:43:33Z"
  },
  {
    "title": "European stocks recover as easing US bank jitters drive risk appetite",
    "description": "European shares closed higher on Monday, as initial concerns over the stability of the U.S. banking sector eased, while fresh comments from U.S. President Donald Trump helped calm trade tensions, encouraging investors to move toward riskier assets.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-recover-as-easing-us-bank-jitters-drive-risk-appetite/articleshow/124712234.cms",
    "timestamp": "2025-10-21T02:43:22Z"
  }
]