[
  {
    "title": "Crowd's Response to Howard Lutnick's Price Rise Question Goes Viral",
    "description": "The commerce secretary has repeatedly argued that Americans will feel no negative effects from President Donald Trump's tariffs.",
    "link": "https://www.newsweek.com/viral-howard-lutnick-tariff-question-audience-response-2076242",
    "timestamp": "2025-05-23T13:23:49Z"
  },
  {
    "title": "Trump Fires New Tariff Threats At Apple And EU",
    "description": "President Donald Trump ratcheted up the US trade war on Friday, threatening to impose a new 25 percent levy against Apple, and a 50 percent tariff on the European Union.",
    "link": "https://www.ibtimes.com/trump-fires-new-tariff-threats-apple-eu-3774355",
    "timestamp": "2025-05-23T13:21:17Z"
  },
  {
    "title": "Ukraine and Russia exchange prisoners a week after direct talks failed to produce a ceasefire",
    "description": "Word of the developments emerged when U.S. President Donald Trump said on social media that Russia and Ukraine had carried out a large exchange of prisoners.",
    "link": "https://www.pbs.org/newshour/world/ukraine-and-russia-exchange-prisoners-a-week-after-direct-talks-failed-to-produce-a-ceasefire",
    "timestamp": "2025-05-23T13:19:37Z"
  },
  {
    "title": "Trump Threatens EU With a 50% Tariff Starting June 1",
    "description": "\"Our discussions with them are going nowhere!\"\nThe post Trump Threatens EU With a 50% Tariff Starting June 1 first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-threatens-eu-with-a-50-tariff-starting-june-1/",
    "timestamp": "2025-05-23T13:18:13Z"
  },
  {
    "title": "Blow to Trump: Europe gains control over rare earth minerals in Greenland",
    "description": "Blow to Trump: Europe gains control over rare earth minerals in Greenlandspotmedia.ro",
    "link": "https://spotmedia.ro/en/news/business/blow-to-trump-europe-gains-control-over-rare-earth-minerals-in-greenland",
    "timestamp": "2025-05-23T13:18:10Z"
  },
  {
    "title": "How US Mortgage Rates Change if Trump Takes Fannie Mae, Freddie Mac Public",
    "description": "Experts fear that the move, though it could help the government's budget woes, could disrupt the fragile U.S. mortgage market.",
    "link": "https://www.newsweek.com/how-us-mortgages-rates-change-fannie-mae-freddie-mac-public-2076201",
    "timestamp": "2025-05-23T13:18:04Z"
  },
  {
    "title": "UK newspaper The Telegraph set for US ownership",
    "description": "British right-wing newspaper The Telegraph has agreed a takeover by US investment group RedBird Capital Partners, ending a two-year saga marked by UK government intervention over press freedoms. RedBird has struck an “in-principle agreement” to purchase The T…",
    "link": "https://www.digitaljournal.com/world/uk-newspaper-the-telegraph-set-for-us-ownership/article",
    "timestamp": "2025-05-23T13:17:32Z"
  },
  {
    "title": "Trump fires new tariff threats at Apple and EU",
    "description": "President Donald Trump ratcheted up the US trade war on Friday, threatening to impose a new 25 percent levy against Apple, and a 50 percent tariff on the European Union. Lamenting that negotiations with the EU “are going nowhere,” Trump said on Truth Social t…",
    "link": "https://www.digitaljournal.com/world/trump-fires-new-tariff-threats-at-apple-and-eu/article",
    "timestamp": "2025-05-23T13:17:20Z"
  },
  {
    "title": "Merz, Xi discuss Ukraine war, trade woes amid global ‘chaos’",
    "description": "Germany’s Friedrich Merz urged Chinese President Xi Jinping on Friday to support a Ukraine ceasefire push and discussed thorny economic ties, in the leaders’ first call since Merz became chancellor. Asia’s economic giant and Europe’s top economy have long-sta…",
    "link": "https://www.digitaljournal.com/world/merz-xi-discuss-ukraine-war-trade-woes-amid-global-chaos/article",
    "timestamp": "2025-05-23T13:17:20Z"
  },
  {
    "title": "President Trump slaps 50% tariff on EU goods starting June 1st, exempts American-made products",
    "description": "President Trump has announced a 50% tariff on European Union goods starting June 1, 2025, with exemptions for products built in America…\nThe post President Trump slaps 50% tariff on EU goods starting June 1st, exempts American-made products appeared first on …",
    "link": "https://macdailynews.com/2025/05/23/president-trump-slaps-50-tariff-on-eu-goods-starting-june-1st-exempts-american-made-products/",
    "timestamp": "2025-05-23T13:17:19Z"
  },
  {
    "title": "Jim Cramer's top 10 things to watch in the stock market Friday",
    "description": "Wall Street was headed for a sharply lower open today on Trump's Apple comments and his call for a straight 50% tariff on the EU.",
    "link": "https://www.cnbc.com/2025/05/23/jim-cramers-top-10-things-to-watch-in-the-stock-market-friday.html",
    "timestamp": "2025-05-23T13:17:04Z"
  },
  {
    "title": "Trump Charges Up Risk-Off Move. Gold Rallies, Yields Fall",
    "description": "10 min ago\nTrump Charges Up Risk-Off Move. Gold Rallies, Yields Fall.\nPresident Donald Trump's series of posts on his Truth Social platform this morning has investors running for safety.\nTrump threatened a 25% tariff on iPhones not made in the U.S. and a 50% …",
    "link": "https://biztoc.com/x/07abc6d68cd9cab2",
    "timestamp": "2025-05-23T13:16:41Z"
  },
  {
    "title": "Trump threatens 25% tariff on iPhones, 50% tariff on EU goods amid trade tensions",
    "description": "President Donald Trump on Friday threatened to impose fresh tariffs on both Apple and the European Union, saying that the iPhone manufacturer and the trading bloc have not heeded to his previous demands. \nIn two quick-fire posts on Truth Social, Trump warned …",
    "link": "https://biztoc.com/x/0115ffba2afd23f7",
    "timestamp": "2025-05-23T13:16:11Z"
  },
  {
    "title": "Enhanced Games AKA ‘Olympics on Steroids’ to Be Held Next Year in Las Vegas",
    "description": "Enhanced Games, a sports competition where performance-enhancing drugs are not only allowed but encouraged, will be held for the first time in May next year, in Las Vegas. Ever wondered how much better top human athletes could be if they were allowed to use p…",
    "link": "https://www.odditycentral.com/events/enhanced-games-aka-olympics-on-steroids-to-be-held-next-year-in-las-vegas.html",
    "timestamp": "2025-05-23T13:16:10Z"
  },
  {
    "title": "Donald Trump’s ‘big, beautiful bill’ faces a swarm of Senate GOP objections",
    "description": "The 1,116-page bill the House passed early Thursday morning to enact President Trump’s ambitious legislative agenda faces a swarm of objections from Senate Republicans. GOP senators are calling for a rewrite of the bill to address concerns ranging from Medica…",
    "link": "https://freerepublic.com/focus/f-news/4318677/posts",
    "timestamp": "2025-05-23T13:16:00Z"
  },
  {
    "title": "Trump threatens 25% tariff on Apple if it does not start making iPhones in America (NBC News)",
    "description": "NBC News:\nTrump threatens 25% tariff on Apple if it does not start making iPhones in America  —  It's the president's latest salvo directly targeting a U.S. company after he hit out at Walmart and Mattel.  —  President Donald Trump has threatened Apple with a…",
    "link": "https://www.memeorandum.com/250523/p25",
    "timestamp": "2025-05-23T13:15:01Z"
  },
  {
    "title": "Johnson again corrals GOP factions to pass Trump's sweeping tax bill (Washington Post)",
    "description": "Washington Post:\nJohnson again corrals GOP factions to pass Trump's sweeping tax bill  —  House Speaker Mike Johnson kept President Donald Trump's trust as he navigated tricky negotiations with lawmakers over the president's top legislative priority.  —  For …",
    "link": "https://www.memeorandum.com/250523/p24",
    "timestamp": "2025-05-23T13:15:01Z"
  },
  {
    "title": "Trump Threatens 25% Tariff on Apple iPhones Made Outside U.S.",
    "description": "President Donald Trump on Friday warned that Apple will face a 25% tariff if it fails to manufacture iPhones inside the United States. The threat follows Apple’s recent move to shift more of its iPhone production to India.\n\n\n\nTrump issued the warning on Truth…",
    "link": "https://www.macobserver.com/news/trump-threatens-25-tariff-on-apple-iphones-made-outside-u-s/",
    "timestamp": "2025-05-23T13:13:54Z"
  },
  {
    "title": "Will U.S deport 10,000 foreign students after Donald Trump's Harvard ban? Here's what you should know",
    "description": "Harvard can't take new foreign students right now. The US government gave the university 72 hours to share some student records. If it doesn't, thousands of students, including many Indians, may have to leave.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-u-s-deport-10000-foreign-students-after-donald-trumps-harvard-ban-heres-what-you-should-know/articleshow/121364380.cms",
    "timestamp": "2025-05-23T13:13:23Z"
  },
  {
    "title": "‘Thanks, Brexit’: UK counts its fortunes as Trump slaps 50% tariff on EU",
    "description": "Donald Trump plans to impose a 50% tariff on European Union exports to America. This action is scheduled to start on June 1, 2025. The United Kingdom is reacting positively. Many feel Brexit is shielding their economy from these tariffs. A new trade understan…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/thanks-brexit-uk-counts-its-fortunes-as-trump-slaps-50-tariff-on-eu/articleshow/121364926.cms",
    "timestamp": "2025-05-23T13:12:45Z"
  },
  {
    "title": "Trump holds swanky dinner for meme coin investors, says ‘Biden administration persecuted crypto innovators’",
    "description": "President Trump hosted a swanky dinner in the DC-area for the biggest investors of his meme coin, telling them \"The Biden administration persecuted crypto innovators.\"",
    "link": "https://www.foxnews.com/politics/trump-holds-swanky-dinner-meme-coin-investors-says-biden-administration-persecuted-crypto-innovators",
    "timestamp": "2025-05-23T13:12:29Z"
  },
  {
    "title": "Friday, May 23, 2025",
    "description": "Health cuts in the tax bill; MAHA report on kids' health; covid vaccines, variants; GLP-1 drugs; cancer deaths; and more. Plus, weekend reads.",
    "link": "https://kffhealthnews.org/morning-briefing/friday-may-23-2025/",
    "timestamp": "2025-05-23T13:10:32Z"
  },
  {
    "title": "Elon Musk is using his Grok chatbot at DOGE to analyze sensitive data belonging to millions of Americans",
    "description": "Billionaire Elon Musk’s DOGE team is expanding use of his artificial intelligence chatbot Grok in the U.S. federal government to analyze data, said three people familiar with the matter, potentially violating conflict-of-interest laws and putting at risk sens…",
    "link": "https://www.fastcompany.com/91340107/elon-musk-using-grok-chatbot-doge-analyze-sensitive-data-belonging-millions-americans",
    "timestamp": "2025-05-23T13:09:51Z"
  },
  {
    "title": "Greenland dumps Donald Trump, signs lucrative minerals deal with Europe in a major blow to the president",
    "description": "Greenland has granted a 30-year mining permit to a Danish-French consortium, Greenland Anorthosite Mining (GAM), for anorthosite extraction, a key component in fiberglass production. This move effectively sidelines US President Donald Trump's ambitions to acq…",
    "link": "https://economictimes.indiatimes.com/news/international/us/greenland-dumps-donald-trump-signs-lucrative-minerals-deal-with-europe-in-a-major-blow-to-the-president/articleshow/121364193.cms",
    "timestamp": "2025-05-23T13:09:33Z"
  },
  {
    "title": "Trump Threatens Apple With Tariffs If it Continues to Produce iPhones Abroad",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said on Friday that tech giant Apple would be subject to 25% tariffs if it continues to produce iPhones outside the United States.",
    "link": "https://sputnikglobe.com/20250523/trump-threatens-apple-with-tariffs-if-it-continues-to-produce-iphones-abroad-1122116740.html",
    "timestamp": "2025-05-23T13:05:55Z"
  },
  {
    "title": "The potential winners and losers from Trump's tax bill",
    "description": "Donald Trump\nAndrew Harnik/Getty Images\nThis post originally appeared in the Business Insider Today newsletter.\nYou can sign up for Business Insider's daily newsletter here.\nHappy Friday! Let me offer a penny for your thoughts while I still can. The Treasury …",
    "link": "https://biztoc.com/x/4be279db10ba83a7",
    "timestamp": "2025-05-23T13:05:32Z"
  },
  {
    "title": "What is Donald Trump's proposed 'Golden Dome' missile defence system and how would it work?",
    "description": "US President Donald Trump announced the Iron Dome-like missile defence project this week. Euronews Next takes a look at what we know so far about it.",
    "link": "https://biztoc.com/x/6af673e0a598521c",
    "timestamp": "2025-05-23T13:05:30Z"
  },
  {
    "title": "Gold gains 2% as trade uncertainty rises",
    "description": "The price of gold increased by more than 2% on Friday as the Trump administration raised the possibility of further tariffs. United States President Donald Trump proposed that levies on imports from t...",
    "link": "https://biztoc.com/x/3f1c1c0f8eaa4fc1",
    "timestamp": "2025-05-23T13:05:19Z"
  },
  {
    "title": "Trump threatens EU with 50% tariff, iPhone maker Apple with 25%",
    "description": "U.S. President Donald Trump cranked up his trade threats on Friday, targeting both smartphone giant Apple and imports from the European Union, sending the global market roiling after weeks of de-escalation provided some reprieve.",
    "link": "https://biztoc.com/x/bb74a71ce705bffe",
    "timestamp": "2025-05-23T13:05:10Z"
  },
  {
    "title": "Trump's student loan policies will be harsh reality for struggling American borrowers, new report says—how you may be affected",
    "description": "U.S. federal student loan borrowers had a lot of leeway under President Joe Biden. That's changing under President Donald Trump.",
    "link": "https://www.cnbc.com/2025/05/23/trumps-student-loan-policies-will-be-harsh-on-us-borrowers-report.html",
    "timestamp": "2025-05-23T13:05:01Z"
  },
  {
    "title": "Trump Slams UK’s North Sea Energy Policy, Again",
    "description": "U.S. President Donald Trump has taken to social media to criticize once again the UK’s energy policy to pursue renewables and tax North Sea oil and gas operators more. Referring to the UK, President Trump posted on Truth Social, “I strongly recommend to them,…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Slams-UKs-North-Sea-Energy-Policy-Again.html",
    "timestamp": "2025-05-23T13:05:00Z"
  },
  {
    "title": "President Trump: iPhone sold in America will be made in America or Apple will pay a 25% tariff",
    "description": "President Trump has announced that he expects Apple to manufacture iPhones sold in the United States domestically, warning CEO Tim Cook…\nThe post President Trump: iPhone sold in America will be made in America or Apple will pay a 25% tariff appeared first on …",
    "link": "https://macdailynews.com/2025/05/23/president-trump-iphone-sold-in-america-will-be-made-in-america-or-apple-will-pay-a-25-tariff/",
    "timestamp": "2025-05-23T13:04:00Z"
  },
  {
    "title": "Inside the room at Trump’s meme coin dinner | CNN Politics",
    "description": "More than 200 wealthy crypto bros gathered for a private event at President Donald Trump’s golf club just outside Washington, DC, on Thursday night — dining on filet mignon and halibut while the president stood at a podium regaling them with tales of his 2024…",
    "link": "https://www.cnn.com/2025/05/23/politics/trump-crypto-meme-coin-dinner",
    "timestamp": "2025-05-23T13:03:55Z"
  },
  {
    "title": "Will Nvidia become victim in USA vs China AI war?",
    "description": "AI or Artificial Intelligence race between world's top two largest economies are getting interesting and Nvidia has become cynosure of all eyes.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-nvidia-become-victim-in-usa-vs-china-ai-war/articleshow/121364708.cms",
    "timestamp": "2025-05-23T13:03:37Z"
  },
  {
    "title": "Judge extends block on Trump’s mass layoffs at several agencies | CNN Politics",
    "description": "A federal judge said late Thursday that she will continue to halt President Donald Trump’s orders for mass terminations at several agencies, handing down a preliminary injunction that follows up the temporary restraining order she issued earlier this month.",
    "link": "https://www.cnn.com/2025/05/23/politics/judge-extends-block-on-trumps-mass-layoffs",
    "timestamp": "2025-05-23T13:03:05Z"
  },
  {
    "title": "European stocks tumble, bonds rally after Trump recommends 50% tariff on EU",
    "description": "European stocks tumbled, the euro gave back some gains, and euro zone government bond yields fell sharply on Friday after U.S. President Donald Trump said he is recommending a straight 50% tariff on goods from the European Union starting on June 1.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-tumble-bonds-rally-after-trump-recommends-50-tariff-on-eu/articleshow/121364724.cms",
    "timestamp": "2025-05-23T13:02:47Z"
  },
  {
    "title": "The potential winners and losers from Trump's tax bill",
    "description": "How Trump's tax bill could impact Americans' finances, and the one group that thinks they'll lose out the most.",
    "link": "https://www.businessinsider.com/trump-tax-bill-potential-winners-losers-parents-students-investors-ev-2025-5",
    "timestamp": "2025-05-23T13:02:00Z"
  },
  {
    "title": "Trump Proposes 50% Tariffs on EU Starting From June 1",
    "description": "MOSCOW (Sputnik) - US President Donald Trump said on Friday that the EU is difficult to deal with and trade talks are \"going nowhere,\" adding that he proposes 50% tariffs on the bloc from June 1.",
    "link": "https://sputnikglobe.com/20250523/trump-proposes-50-tariffs-on-eu-starting-from-june-1-1122116636.html",
    "timestamp": "2025-05-23T13:00:46Z"
  },
  {
    "title": "Trump to Apple: Build the iPhone in America or Face a 25% Tariff",
    "description": "The phone would be way more expensive if built in America compared to a 25% tariff.\nThe post Trump to Apple: Build the iPhone in America or Face a 25% Tariff first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-to-apple-build-the-iphone-in-america-or-face-a-25-tariff/",
    "timestamp": "2025-05-23T13:00:25Z"
  },
  {
    "title": "‘Trump’s crypto con’ under fire with new Bill, hours before gala dinner",
    "description": "Trump’s memecoin sees rollercoaster trading and lawmakers introduce the “Stop TRUMP Act.”",
    "link": "https://ambcrypto.com/trumps-crypto-con-under-fire-with-new-bill-hours-before-gala-dinner/",
    "timestamp": "2025-05-23T13:00:24Z"
  },
  {
    "title": "Newly Adopted WHO Pandemic Pact Is a Step Toward ‘Global Surveillance Superstate,’ Expert Warns",
    "description": "After three years of negotiations, delegates to the World Health Organization’s annual meeting have adopted a global pandemic agreement that threatens national sovereignty, requires the... Read More\nThe post Newly Adopted WHO Pandemic Pact Is a Step Toward ‘G…",
    "link": "https://www.dailysignal.com/2025/05/23/newly-adopted-who-pandemic-pact-is-step-toward-global-surveillance-superstate-expert-says/",
    "timestamp": "2025-05-23T13:00:00Z"
  },
  {
    "title": "Trump threatens 50% tariff on EU goods amid trade tensions",
    "description": "President Trump threatens a 50% tariff on European Union goods, citing stalled trade negotiations",
    "link": "https://www.wgal.com/article/trump-threatens-50-percent-tariff-on-eu-goods/64863289",
    "timestamp": "2025-05-23T12:59:48Z"
  },
  {
    "title": "Global markets tumble after Trump announces tariffs against European Union, Apple",
    "description": "Trump has dialed back or paused many of his tariff threats in recent weeks, bringing some peace to markets which had been swinging wildly in both directions for weeks as Trump fired off tariff threats.",
    "link": "https://www.pbs.org/newshour/economy/global-markets-tumble-after-trump-announces-tariffs-against-european-union-apple",
    "timestamp": "2025-05-23T12:59:35Z"
  },
  {
    "title": "Trump threatens EU with 50% tariff, iPhone maker Apple with 25%",
    "description": "U.S. President Donald Trump cranked up his trade threats on Friday, targeting both smartphone giant Apple and imports from the European Union, sending the global market roiling after weeks of de-escalation provided some reprieve.",
    "link": "https://www.cbc.ca/news/business/trump-trade-threats-eu-apple-1.7541856",
    "timestamp": "2025-05-23T12:59:28Z"
  },
  {
    "title": "Harvard sues Trump administration for blocking enrolment of foreign students",
    "description": "Harvard University has sued US President Donald Trump's administration over the decision to revoke the Ivy League school's ability to enrol international students.",
    "link": "https://www.abc.net.au/news/2025-05-23/harvard-university-sues-trump-administration/105331602",
    "timestamp": "2025-05-23T12:58:37Z"
  },
  {
    "title": "Harvard sues Trump administration for blocking enrolment of foreign students",
    "description": "Harvard University sued the Trump administration on Friday (May 23) over President Donald Trump's decision to revoke the Ivy League school's ability to enrol international students.",
    "link": "https://www.channelnewsasia.com/world/harvard-sues-trump-administration-block-enrolment-foreign-students-5149616",
    "timestamp": "2025-05-23T12:58:00Z"
  },
  {
    "title": "Trump keeps dropping lawsuits against companies Biden said were cheating Americans | CNN Business",
    "description": "Businesses are getting a free pass from the Trump administration from a wide variety of enforcement actions they had been facing under President Joe Biden.",
    "link": "https://www.cnn.com/2025/05/23/business/trump-dropping-consumer-protection-cases",
    "timestamp": "2025-05-23T12:56:28Z"
  },
  {
    "title": "Mike Johnson Hands Senate GOP Golden Opportunity To Attack Dems’ Climate Agenda",
    "description": "The House of Representatives passed President Donald Trump's \"one big, beautiful bill,\" paving the way for the GOP to claw back more taxpayer funds the IRA.",
    "link": "https://dailycaller.com/2025/05/23/mike-johnson-hands-senate-gop-golden-opportunity-to-attack-dems-climate-agenda/",
    "timestamp": "2025-05-23T12:55:38Z"
  },
  {
    "title": "Kristi Noem Shoots Harvard As Warning To Other Schools",
    "description": "We can't believe we're rooting for Harvard in this mess.",
    "link": "https://www.wonkette.com/p/kristi-noem-shoots-harvard-as-warning",
    "timestamp": "2025-05-23T12:55:29Z"
  },
  {
    "title": "Terrorist plot foiled in Russia’s Kaliningrad – FSB",
    "description": "The suspect allegedly planned to detonate an explosive device along the path of a Victory Day parade on May 9 Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618044-fsb-kaliningrad-terrorist-plot/",
    "timestamp": "2025-05-23T12:55:15Z"
  },
  {
    "title": "Trump tariff threats on EU, Apple, send US futures and global markets skidding",
    "description": "By JIANG JUNZHE and MATT OTT, Associated Press\nMarkets on Wall Street and in Europe declined rapidly early Friday morning after President Donald Trump posted a pair of tariff threats on social media, one aimed at Apple and the other at the European Union.\nFut…",
    "link": "https://biztoc.com/x/b123bd66989e5de5",
    "timestamp": "2025-05-23T12:54:04Z"
  },
  {
    "title": "The iPhone 17 could come with a nasty price hike – here's how",
    "description": "President Trump has effectively threatened to put tariffs on iPhones and goods from the European Union, which could lead to pricier Apple products.",
    "link": "https://www.techradar.com/phones/iphone/the-iphone-17-could-come-with-a-nasty-price-hike-heres-how",
    "timestamp": "2025-05-23T12:54:02Z"
  },
  {
    "title": "People Are Baffled That These 25 “Blue Whales” In The Room Are Consistently Ignored",
    "description": "People just can’t comprehend how anyone could ignore these “blue whales”in the room. \nThe post People Are Baffled That These 25 “Blue Whales” In The Room Are Consistently Ignored appeared first on DeMilked.",
    "link": "https://www.demilked.com/ignore-blue-whale/",
    "timestamp": "2025-05-23T12:53:56Z"
  },
  {
    "title": "India-Pakistan Conflict Escalates into Eurasian Crisis, Testing SCO and BRICS Mediation Potential",
    "description": "The India-Pakistan conflict has by now taken on new dimensions, evolving into a complex Eurasian issue.\nThe post India-Pakistan Conflict Escalates into Eurasian Crisis, Testing SCO and BRICS Mediation Potential appeared first on Global Research.",
    "link": "https://www.globalresearch.ca/india-pakistan-conflict-escalates-eurasian-crisis/5887894",
    "timestamp": "2025-05-23T12:52:32Z"
  },
  {
    "title": "VA Shares Update on Compensation Claims for 200,000 Veterans",
    "description": "The disability benefits compensation claims backlog has fallen below 200,000 for the first time since March 2023.",
    "link": "https://www.newsweek.com/va-update-veterans-disability-benefit-compensation-claims-2076233",
    "timestamp": "2025-05-23T12:52:11Z"
  },
  {
    "title": "Targeted by Trump: Who is Cyril Ramaphosa?",
    "description": " Listen to Sky News Daily on your podcast app ",
    "link": "https://news.sky.com/story/targeted-by-donald-trump-who-is-cyril-ramaphosa-13373359",
    "timestamp": "2025-05-23T12:52:00Z"
  },
  {
    "title": "Harvard Sues Trump Administration For Barring Enrolment Of Foreign Students",
    "description": "Harvard University on Friday sued the US administration against its decision to revoke its eligibility to enrol international students, in an escalation of the fight between President Donald Trump and the prestigious university.",
    "link": "https://www.ndtv.com/world-news/harvard-sues-trump-administration-for-barring-enrolment-of-foreign-students-8489447",
    "timestamp": "2025-05-23T12:51:40Z"
  },
  {
    "title": "Farewell, America",
    "description": "While no one is surprised to see Donald Trump's second administration ditching America's longstanding global responsibilities, the sheer pace of the change has been remarkable. Already, a growing void is opening up within the world order, creating opportuniti…",
    "link": "https://www.project-syndicate.org/commentary/trump-american-retreat-creates-opening-for-europe-china-and-others-by-carl-bildt-2025-05",
    "timestamp": "2025-05-23T12:51:04Z"
  },
  {
    "title": "Jamie Dimon Warns of Stagflation Risk: ‘We Have to Be Prepared’",
    "description": "JPMorgan CEO Jamie Dimon warned the US economy could be hit with stagflation due to a number of \"inflationary\" factors, including Donald Trump's tariffs.\nThe post Jamie Dimon Warns of Stagflation Risk: ‘We Have to Be Prepared’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/jamie-dimon-warns-of-stagflation-risk-we-have-to-be-prepared/",
    "timestamp": "2025-05-23T12:49:26Z"
  },
  {
    "title": "Why Trump Administration Barred Harvard From Enrolling Foreign Students",
    "description": "The decision, announced by the Department of Homeland Security (DHS), leaves the status of over 6,000 foreign students - including several hundred from India - at Harvard hanging in the balance.",
    "link": "https://www.ndtv.com/education/explained-why-donald-trump-administration-blocked-harvard-university-from-enrolling-foreign-students-8489394",
    "timestamp": "2025-05-23T12:47:09Z"
  },
  {
    "title": "US solar manufacturers lag skyrocketing market demand",
    "description": "US manufacturers do not produce enough solar panels to meet the nation’s demand, but industry investments and federal tax incentives have been making progress.",
    "link": "https://theconversation.com/us-solar-manufacturers-lag-skyrocketing-market-demand-256944",
    "timestamp": "2025-05-23T12:47:04Z"
  },
  {
    "title": "Like many populist leaders, Trump accuses judges of being illegitimate obstacles to safety and democracy",
    "description": "Political leaders in El Salvador, the Philippines and Israel, among other places, have also positioned judges as the enemy of the people.",
    "link": "https://theconversation.com/like-many-populist-leaders-trump-accuses-judges-of-being-illegitimate-obstacles-to-safety-and-democracy-255472",
    "timestamp": "2025-05-23T12:46:47Z"
  },
  {
    "title": "MAGA King Trump’s New World Disorder: Trump’s 21st Century Gilded Age for the Ultra Rich",
    "description": "For the 21st century’s raucous era now might best be symbolized by the Qatar Royal Family’s lavish 400 million dollar ‘gift’ to MAGA King Donald Trump's America of a gold-gilded Boeing 747-8 ‘Flying Palace’\nThe post MAGA King Trump’s New World Disorder: Trump…",
    "link": "https://www.globalresearch.ca/welcome-maga-king-trump-21st-century-gilded-age/5888097",
    "timestamp": "2025-05-23T12:46:18Z"
  },
  {
    "title": "EU Parliamentarian Petr Bystron Delivers Powerful Speech in Brussels in Defense of President Donald Trump and His Pro-American Agenda (VIDEO)",
    "description": "Petr Bystron is a member of the European Parliament from Germany.\nThe post EU Parliamentarian Petr Bystron Delivers Powerful Speech in Brussels in Defense of President Donald Trump and His Pro-American Agenda (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/eu-parliamentarian-petr-bystron-delivers-powerful-speech-brussels/",
    "timestamp": "2025-05-23T12:45:24Z"
  },
  {
    "title": "Merz, Xi Discuss Ukraine War, Trade Woes Amid Global 'Chaos'",
    "description": "Germany's Friedrich Merz urged Chinese President Xi Jinping on Friday to support a Ukraine ceasefire push and discussed thorny economic ties, in the leaders' first call since Merz became chancellor.",
    "link": "https://www.ibtimes.com/merz-xi-discuss-ukraine-war-trade-woes-amid-global-chaos-3774351",
    "timestamp": "2025-05-23T12:45:23Z"
  },
  {
    "title": "Trump Threatens Apple With 25% Tariff on iPhones",
    "description": "The presidents wants Apple to move production to the US.\nTrump Threatens Apple With 25% Tariff on iPhones\nAlex Young",
    "link": "https://consequence.net/2025/05/trump-threatens-apple-with-25-tariff-on-iphones/",
    "timestamp": "2025-05-23T12:45:05Z"
  },
  {
    "title": "South African data counter ‘genocide’ claims",
    "description": "JOHANNESBURG - South Africa does not face a &ldquo;white genocide&rdquo; and claims that most victims of murders on farms are white are a distortion of statistics, the police minister said on Friday, dismissing statements by US President Donald Trump.",
    "link": "https://www.bangkokpost.com/world/3032931/south-african-data-counter-genocide-claims",
    "timestamp": "2025-05-23T12:45:00Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on Apple as his trade war intensifies",
    "description": "The threats, delivered over social media, reflect Trump's ability to disrupt the global economy with a burst of typing.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_75388b42-98bb-5f75-ac12-f5b7f8fa3d0d.html",
    "timestamp": "2025-05-23T12:45:00Z"
  },
  {
    "title": "Speaking of historically unprecedented catastrophes",
    "description": "The Colorado Rockies have lost 42 of their first 50 games, which is the worst 50-game start in major league history. It’s seven games worse than the 2024 White Sox and five games worse than the 1962 Mets. Ah but what about the 1899 Cleveland Spiders, as so ma…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/speaking-of-historically-unprecedented-catastrophes",
    "timestamp": "2025-05-23T12:44:43Z"
  },
  {
    "title": "Ukraine and Russia poised for biggest prisoner swap but details scarce",
    "description": "Officials agreed to exchange 1,000 prisoners of war each, during otherwise fruitless talks a week ago.",
    "link": "https://www.bbc.com/news/articles/cy4eyjxz7eno",
    "timestamp": "2025-05-23T12:44:41Z"
  },
  {
    "title": "Japanese Gas Tanker Giant MOL Sees Difficulty Buying Chinese Vessels",
    "description": "Mitsui O.S.K. Lines, owner of the world’s largest fleet of liquefied natural gas carriers, said it is hard to buy Chinese vessels for the time being as the US ramps up scrutiny of the Asian country’s shipbuilding industry.",
    "link": "https://gcaptain.com/japanese-gas-tanker-giant-mol-sees-difficulty-buying-chinese-vessels/",
    "timestamp": "2025-05-23T12:43:29Z"
  },
  {
    "title": "Trump Nuclear Executive Order News Sends Oklo, S&P 500 Giants Higher",
    "description": "President Donald Trump is expected to sign executive orders Friday to support the nuclear energy sector.\nThe post Trump Nuclear Executive Order News Sends Oklo, S&P 500 Giants Higher appeared first on Investor's Business Daily.",
    "link": "https://biztoc.com/x/700a58094751dc3a",
    "timestamp": "2025-05-23T12:43:11Z"
  },
  {
    "title": "Trump's dinner with meme coin investors prompts ethics concerns",
    "description": "President Donald Trump spent about an hour Thursday dining with people at his Virginia golf club who invested in a cryptocurrency coin that bares his name. The president is facing bipartisan criticism with Democrats claiming it's part of an ongoing effort to …",
    "link": "https://biztoc.com/x/dad652e8b3e97018",
    "timestamp": "2025-05-23T12:43:08Z"
  },
  {
    "title": "Photos show every time Melania Trump has appeared at a public White House event this year",
    "description": "President Donald Trump and first lady Melania Trump.\nKen Cedeno/REUTERS\nFirst lady Melania Trump is keeping a low profile during President Donald Trump's second term.\nAn infrequent White House presence, she divides her time between homes in Florida, New York,…",
    "link": "https://biztoc.com/x/0232bdf371bd2b21",
    "timestamp": "2025-05-23T12:43:04Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on Apple as his trade war intensifies",
    "description": "By JOSH BOAK, Associated Press\nWASHINGTON (AP) — President Donald Trump on Friday threatened a 50% tax on all imports from the European Union as well a 25% tariff on Apple products unless iPhones are made in America.\nThe threats, delivered over social media, …",
    "link": "https://biztoc.com/x/69722ac95afeb962",
    "timestamp": "2025-05-23T12:43:03Z"
  },
  {
    "title": "Trump tariff threats on EU, Apple, send US futures and global markets skidding",
    "description": "Markets took a sharp turn downward after Trump posted threats social media against the EU and Apple.",
    "link": "https://www.bostonherald.com/2025/05/23/stock-market-trump-threat-eu/",
    "timestamp": "2025-05-23T12:42:09Z"
  },
  {
    "title": "President Trump threatens 25% tariff on iPhones, 50% on the entire EU",
    "description": "President Trump says iPhones sold in the U.S. must be made in the U.S., or face at least 25% tariffs.",
    "link": "https://www.tomshardware.com/tech-industry/president-trump-threatens-25-percent-tariff-on-iphones-50-percent-on-the-entire-eu",
    "timestamp": "2025-05-23T12:41:51Z"
  },
  {
    "title": "Trump’s 10% tariff is coming: What to buy now before prices rise in US",
    "description": "Donald Trump's import tariff is set to impact prices soon. Experts advise buying now to avoid increased costs. Tech, clothing, home goods, and groceries are likely to become more expensive. Retailers like Walmart will raise prices this month. Items with impor…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-10-tariff-is-coming-what-to-buy-now-before-prices-rise-in-us/articleshow/121363430.cms",
    "timestamp": "2025-05-23T12:40:54Z"
  },
  {
    "title": "Trump Threatens 50% Tariffs On EU And 25% Penalties On Apple As His Trade War Intensifies",
    "description": "The threats, delivered over social media, reflect Trump's ability to disrupt the global economy with a burst of typing.",
    "link": "https://www.huffpost.com/entry/trump-tariffs-apple-eu_n_68306b0de4b097a9e0446b94",
    "timestamp": "2025-05-23T12:40:03Z"
  },
  {
    "title": "Black Alliance for Peace Condemns the U.S. and Israeli Final Solution for Gaza and the West Bank",
    "description": "Just as Nazi Germany sought the total elimination of Jewish life, the state of Israel, with full U.S. support, is now openly pursuing the systematic annihilation of the people of Gaza, the acceleration of mass displacement in the West Bank, …\nThe post Black A…",
    "link": "https://www.globalresearch.ca/us-israeli-final-solution-gaza-west-bank/5888083",
    "timestamp": "2025-05-23T12:39:29Z"
  },
  {
    "title": "Prisoner swap begins between Russia and Ukraine but peace talks remain deadlocked",
    "description": "Russia and Ukraine each agreed at two hours of talks in Istanbul last week to swap 1,000 prisoners, but failed to agree to a ceasefire proposed by Trump.",
    "link": "https://www.nbcnews.com/world/ukraine/russia-ukraine-begin-prisoner-swap-congratulated-trump-rcna208715",
    "timestamp": "2025-05-23T12:37:28Z"
  },
  {
    "title": "Obama’s Base Is Slipping Away From Democrats",
    "description": "Ever since Donald Trump squeaked out his victory in the 2016 presidential campaign, political analysts have marveled at his strength among white working class voters. This has long been a trouble spot for Democrats. Barack",
    "link": "https://politicalwire.com/2025/05/23/obamas-base-is-slipping-away-from-democrats/",
    "timestamp": "2025-05-23T12:37:04Z"
  },
  {
    "title": "Photos show every time Melania Trump has appeared at a public White House event this year",
    "description": "Melania Trump, who remained an enigmatic figure during President Donald Trump's first term, has kept an even lower profile during his second.",
    "link": "https://www.businessinsider.com/melania-trump-first-lady-at-white-house-2025-5",
    "timestamp": "2025-05-23T12:37:01Z"
  },
  {
    "title": "NATO Wants to be “More Lethal” Than Russia but Can’t Catch Up in Weapons Production. Arms Race?",
    "description": "NATO Secretary General Mark Rutte’s statement that the alliance must become “more lethal” and defeat Russia in armaments shows that NATO is preparing for a long-term confrontation with Russia. This is also an attempt to drag Russia into an exhausting …\nThe po…",
    "link": "https://www.globalresearch.ca/nato-russia-weapons-production/5888087",
    "timestamp": "2025-05-23T12:35:59Z"
  },
  {
    "title": "DOGE team using AI to scour personal data to root out Trump disloyalty: report",
    "description": "Elon Musk's team is using a custom version of his artificial intelligence chatbot Grok to scour the sensitive government data scooped up by the Department of Government Efficiency, raising serious concerns about privacy, conflicts of interest and national sec…",
    "link": "https://www.rawstory.com/doge-team-sensitive-private-data-2672192671/",
    "timestamp": "2025-05-23T12:35:13Z"
  },
  {
    "title": "Trump threatens 25% tariffs on iPhones and 50% levies against Europe, quickly tanking stocks",
    "description": "President Donald Trump is again escalating pressure on U.S. trade partners – as well as the tech companies caught in the middle. Read more...",
    "link": "https://qz.com/aapl-trump-tariffs-india-eu-1851782101",
    "timestamp": "2025-05-23T12:34:45Z"
  },
  {
    "title": "Apple raises iPhone trade-in value in China amid demand concerns, rising competition",
    "description": "Apple is boosting trade-in discounts in China, offering up to $790 for older iPhones to combat declining market share, which fell to 13.7% in the first quarter. This move comes amid rising competition from local brands like Xiaomi and Huawei, who are gaining …",
    "link": "https://economictimes.indiatimes.com/tech/technology/apple-raises-iphone-trade-in-value-in-china-amid-demand-concerns-rising-competition/articleshow/121363222.cms",
    "timestamp": "2025-05-23T12:34:01Z"
  },
  {
    "title": "Trump threatens EU with 50% tariffs – “Unacceptable $250 million deficit, talks are going nowhere”",
    "description": "The American president made it clear that no additional tariffs will be imposed if the products are manufactured or produced in the United States – Earlier, he had also threatened Apple with 25% tariffs for productions outside the US\nThe post Trump threatens …",
    "link": "https://en.protothema.gr/2025/05/23/trump-threatens-eu-with-50-tariffs-unacceptable-250-million-deficit-talks-are-going-nowhere/",
    "timestamp": "2025-05-23T12:33:37Z"
  },
  {
    "title": "Trump Blurts Out New Tariff Bombshell That Instantly Craters Stock Futures",
    "description": "President Donald Trump threw up a social media post announcing a new trade bombshell that instantly cratered stock futures Friday morning.\nThe post Trump Blurts Out New Tariff Bombshell That Instantly Craters Stock Futures first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-blurts-out-new-tariff-bombshell-that-instantly-craters-stock-futures/",
    "timestamp": "2025-05-23T12:32:54Z"
  },
  {
    "title": "Military base in paradise: Why the decolonization by the UK turns out fake again",
    "description": "London and Washington attempt to forge a new neocolonial reality using old tactics, and at the expense of other nations Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/617999-uk-not-return-chagos-archipelago-mauritius/",
    "timestamp": "2025-05-23T12:32:50Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on Apple as his trade war intensifies",
    "description": "President Trump is threatening a 50% tax on all imports from the EU as well as a 25% tariff on Apple products unless iPhones are made in America.",
    "link": "https://www.denverpost.com/2025/05/23/trump-threats-europe-apple/",
    "timestamp": "2025-05-23T12:32:19Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on Apple as his trade war intensifies",
    "description": "President Trump is threatening a 50% tax on all imports from the EU as well as a 25% tariff on Apple products unless iPhones are made in America.",
    "link": "https://www.bostonherald.com/2025/05/23/trump-threats-europe-apple/",
    "timestamp": "2025-05-23T12:32:19Z"
  },
  {
    "title": "Europe turns to losses, DAX down over 2%",
    "description": "Stock indexes in Europe fell sharply during Friday's session after United States President Donald Trump threatened the European Union with a 50% tariff from 1 June. Trump said the EU has been \"very di...",
    "link": "https://biztoc.com/x/8d7cf0ae22c029e9",
    "timestamp": "2025-05-23T12:32:05Z"
  },
  {
    "title": "Trump Tariffs on EU: Trade Bloc Threatened With 50% Levy on Goods",
    "description": "President Donald Trump threatened a 50% tariff on goods from the European Union starting on June 1, saying “our discussions ...",
    "link": "https://biztoc.com/x/55954627e2ad29ca",
    "timestamp": "2025-05-23T12:30:24Z"
  }
]