[
  {
    "title": "Morning Minute: Crypto in Your 401(k)s Is Finally Happening",
    "description": "Crypto majors rallied (unsurprisingly) on the news—though with a surprising frontrunner.",
    "link": "https://decrypt.co/334259/morning-minute-crypto-in-your-401ks-is-finally-happening",
    "timestamp": "2025-08-08T12:21:32Z"
  },
  {
    "title": "Reporters SCREAM at Trump as He Leaves Purple Heart Event: ‘Did You Order the Firings?’",
    "description": "Reporters screamed questions at Trump as he made his way out of an event honoring Purple Heart recipients, including several about the recent FBI firings.\nThe post Reporters SCREAM at Trump as He Leaves Purple Heart Event: ‘Did You Order the Firings?’ first a…",
    "link": "https://www.mediaite.com/media/news/reporters-scream-at-trump-as-he-leaves-purple-heart-event-did-you-order-the-firings/",
    "timestamp": "2025-08-08T12:21:16Z"
  },
  {
    "title": "Putin said to want to meet Trump in Hungary",
    "description": "Russian President Vladimir Putin initially favored Hungary over the United Arab Emirates as the venue of his upcoming meeting with his United States colleague Donald Trump, Fox News' White House corre...",
    "link": "https://biztoc.com/x/0a9849a61a4a0783",
    "timestamp": "2025-08-08T12:20:05Z"
  },
  {
    "title": "Putin suggests UAE to host US-Russia talks on Ukraine",
    "description": "The UAE may play host to talks between US President Donald Trump and Russian President Vladimir Putin aimed at ending the Ukraine war. Putin said the Gulf country “would be one of the quite suitable places” during a visit by President Sheikh Mohamed bin Zayed…",
    "link": "https://biztoc.com/x/d21335d6fd9a40ee",
    "timestamp": "2025-08-08T12:20:02Z"
  },
  {
    "title": "Trump backers finally reap rewards after years of debanking, black-listing",
    "description": "But the blackballing apparently didn't stop at the banking business – it spanned across corporate America, sources told On The Money.",
    "link": "https://nypost.com/2025/08/08/business/trump-backers-finally-reap-rewards-after-years-of-debanking-black-listing/",
    "timestamp": "2025-08-08T12:17:54Z"
  },
  {
    "title": "NC Residents Can Now Seek State Aid After Tropical Storm Chantal",
    "description": "RALEIGH, N.C. (AP) — Individuals in central North Carolina counties whose homes and belongings were damaged by massive rains last month from Tropical Storm Chantal can now seek state-funded financial grants for temporary assistance. The aid for residents in e…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/08/08/835028.htm",
    "timestamp": "2025-08-08T12:17:53Z"
  },
  {
    "title": "Greg Gutfeld Talks Gay Bar with Jimmy Fallon, Avoids Politics on 'Tonight Show'",
    "description": "Jimmy Fallon and Fox News' Greg Gutfeld caught up like a pair of chummy old friends on 'The Tonight Show' Thursday ... giddily recalling their drunken meeting in NYC and completely kicking politics to the trashcan. Check out the clip ... the…\n Permalink",
    "link": "https://www.tmz.com/2025/08/08/greg-gutfeld-avoids-politics-jimmy-fallon-tonight-show/",
    "timestamp": "2025-08-08T12:17:43Z"
  },
  {
    "title": "Outrage after US Air Force denies long-serving trans troops retirement benefits: ‘Indefensible’",
    "description": "The US Air Force is reporting kicking out long-serving trans troops without providing them with retirement benefits, a leaked memo suggests. Trans and non-binary service members with between 15 and 18 years of military service will reportedly be told to quit …",
    "link": "https://www.thepinknews.com/2025/08/08/us-air-force-trans-troops-early-retirement-benefits/",
    "timestamp": "2025-08-08T12:16:50Z"
  },
  {
    "title": "Forbes Daily: Intel CEO Under Fire After Trump Weighs In",
    "description": "Today’s Forbes Daily covers Eli Lilly’s historic loss, the new GPT-5 for OpenAI’s ChatGPT, reactions to Instagram’s new map feature, a tariff correction for Japan and more.",
    "link": "https://www.forbes.com/sites/chrisdobstaff/2025/08/08/forbes-daily-intel-ceo-under-fire-after-trump-weighs-in/",
    "timestamp": "2025-08-08T12:16:27Z"
  },
  {
    "title": "Two charts that lay bare the threat posed by radical right parties to western democracies",
    "description": "Radical parties are now more numerous than any other category in 31 countries.",
    "link": "https://theconversation.com/two-charts-that-lay-bare-the-threat-posed-by-radical-right-parties-to-western-democracies-262070",
    "timestamp": "2025-08-08T12:14:19Z"
  },
  {
    "title": "Taiwan faces a precarious future – whether or not US and China continue on path to conflict",
    "description": "The issue of Taiwan is looking more precarious and worrying.",
    "link": "https://theconversation.com/taiwan-faces-a-precarious-future-whether-or-not-us-and-china-continue-on-path-to-conflict-262294",
    "timestamp": "2025-08-08T12:14:17Z"
  },
  {
    "title": "Sydney Sweeney ad uproar revives meme-stock ‘squeeze’ play",
    "description": "The odd cultural moment involving American Eagle could make it ripe for a buying frenzy similar to GameStop and AMC during the pandemic.",
    "link": "https://nypost.com/2025/08/08/business/sydney-sweeney-ad-uproar-revives-meme-stock-squeeze-play/",
    "timestamp": "2025-08-08T12:13:38Z"
  },
  {
    "title": "India’s 50% tariff is actually a US sanction in disguise. Why that makes it worse",
    "description": "The goal of the punitive tax is to get Putin to end the Ukraine war. If that objective is not realized, there’s no guarantee of what Trump might do next to India, one of the world’s biggest buyer of seaborne Russian crude",
    "link": "https://timesofindia.indiatimes.com/toi-plus/business-economy/indias-50-tariff-is-actually-a-us-sanction-in-disguise-why-that-makes-it-worse/articleshow/123187572.cms",
    "timestamp": "2025-08-08T12:12:57Z"
  },
  {
    "title": "Trump orders increased federal law enforcement presence in Washington to ‘make DC safe again’",
    "description": "This move follows President Trump's suggestions that his administration could take over running the city.",
    "link": "https://www.bostonherald.com/2025/08/08/trump-increases-dc-law-enforcement/",
    "timestamp": "2025-08-08T12:10:07Z"
  },
  {
    "title": "Trump orders increased federal law enforcement presence in Washington to ‘make DC safe again’",
    "description": "This move follows President Trump's suggestions that his administration could take over running the city.",
    "link": "https://www.denverpost.com/2025/08/08/trump-increases-dc-law-enforcement/",
    "timestamp": "2025-08-08T12:10:07Z"
  },
  {
    "title": "Trump makes surprise decision on Federal Reserve",
    "description": "He’s pro-tariffs, pro-crypto and, most importantly, pro-Trump.\nStill his nomination to fill the temporary open seat on the Federal Reserve was unexpected.\n Don't miss the move: Subscribe to TheStreet's free daily newsletter\nBut the message from Presid…",
    "link": "https://biztoc.com/x/a2861ab0876e0e92",
    "timestamp": "2025-08-08T12:09:19Z"
  },
  {
    "title": "Sensex crashes 765 points as Trump’s 50% tariff shock triggers sixth straight weekly loss",
    "description": "Markets plummet to three-month lows as Trump doubles tariffs on Indian goods, causing investor panic and sectoral declines.",
    "link": "https://www.thehindubusinessline.com/markets/sensex-crashes-765-points-as-trumps-50-tariff-shock-triggers-sixth-straight-weekly-loss/article69909662.ece",
    "timestamp": "2025-08-08T12:04:32Z"
  },
  {
    "title": "JPMorgan Just Flipped On The Fed—Predicted To Fuel A Huge Bitcoin Price Boom",
    "description": "Analysts with JPMorgan have flipped to predict the Federal Reserve will cut interest rates in September...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/08/jpmorgan-just-flipped-on-the-fed-predicted-to-fuel-a-huge-bitcoin-price-boom/",
    "timestamp": "2025-08-08T12:04:14Z"
  },
  {
    "title": "Experts alarmed by US cuts to mRNA vaccine research",
    "description": "US Health Secretary Robert F. Kennedy Jr. has slashed government spending on mRNA vaccine research. Experts warn it will boost global vulnerability to future pandemics.",
    "link": "https://www.dw.com/en/experts-alarmed-by-us-cuts-to-mrna-vaccine-research/a-73563375",
    "timestamp": "2025-08-08T12:04:00Z"
  },
  {
    "title": "Jharkhands apex industry association seeks Centres intervention over US tariff",
    "description": "Jharkhand's apex industry association seeks Centre's intervention over US tariff",
    "link": "https://www.livemint.com/companies/news/jharkhands-apex-industry-association-seeks-centres-intervention-over-us-tariff-11754654563233.html",
    "timestamp": "2025-08-08T12:02:42Z"
  },
  {
    "title": "El Salvador’s Latest Regression Met With Silence From Watchdog",
    "description": "The Organization of American States is experiencing a chilling effect under Trump.",
    "link": "http://foreignpolicy.com/2025/08/08/el-salvador-bukele-term-limits-democracy-oas-trump-deportations/",
    "timestamp": "2025-08-08T12:00:45Z"
  },
  {
    "title": "Posthaste: Did Ontario’s premier just try to mess with the Bank of Canada’s independence again?",
    "description": "Doug Ford dragged monetary policy into day-to-day politics — again — urging Canada's central bank to people 'some confidence.' Read on.",
    "link": "https://financialpost.com/news/bank-of-canada-cut-interest-rates-ontario-premier",
    "timestamp": "2025-08-08T12:00:17Z"
  },
  {
    "title": "Eric Metaxas Guest John Zmirak: Mike Pence, Lindsey Graham, John McCain Were Part of Obama ‘Coup’ Claimed by Gabbard",
    "description": "Religious-right journalist John Zmirak adds Mike Pence, Lindsey Graham, and John McCain to the debunked \"Obama coup\" conspiracy being promoted by Tulsi Gabbard",
    "link": "https://www.peoplefor.org/rightwingwatch/eric-metaxas-guest-john-zmirak-mike-pence-lindsey-graham-john-mccain-were-part-obama",
    "timestamp": "2025-08-08T12:00:00Z"
  },
  {
    "title": "Day 1,262 of WW3. The Kremlin's war chest has run dry as the oafishal budget deficit hits $61 billion. Mordor offers kidnapped Ukrainian children for adoption in a catalog sale - sorted by eye and hair color. This is your Friday Ukraine War thread [News]",
    "description": "Day 1,262 of WW3. The Kremlin's war chest has run dry as the oafishal budget deficit hits $61 billion. Mordor offers kidnapped Ukrainian children for adoption in a catalog sale - sorted by eye and hair color. This is your Friday Ukraine War thread",
    "link": "https://www.fark.com/comments/13770422/Day-1262-of-WW3-The-Kremlins-war-chest-has-run-dry-as-oafishal-budget-deficit-hits-$61-billion-Mordor-offers-kidnapped-Ukrainian-children-for-adoption-in-a-catalog-sale-sorted-by-eye-hair-color-This-is-your-Friday-Ukraine-War-thread",
    "timestamp": "2025-08-08T12:00:00Z"
  },
  {
    "title": "Trump’s Unknown Frontiers",
    "description": "Trump is rewriting the rules of politics, economics, and culture—and no one, not even the experts, knows what happens when the old orthodoxy finally breaks. Donald Trump’s far-ranging counter-revolution, to quote the old Star Trek mission statement, seeks “To…",
    "link": "https://www.activistpost.com/trumps-unknown-frontiers/",
    "timestamp": "2025-08-08T12:00:00Z"
  },
  {
    "title": "What to know about Stephen Miran, the tariff proponent Trump just nominated to join the Fed’s board of governors",
    "description": "Good morning. \nFortune Senior Editor-at-Large Shawn Tully filling in for Sheryl today. When Donald Trump announced yesterday that he was nominating Stephen Miran to fill a vacancy on the Fed’s board of governors, you could be forgiven for asking, Who?\nThe 41-…",
    "link": "https://biztoc.com/x/adad14cdc01a1945",
    "timestamp": "2025-08-08T11:58:01Z"
  },
  {
    "title": "Putin-Trump summit: what we know so far",
    "description": "US President Donald Trump and his Russian counterpart, Vladimir Putin, are set to hold talks in a bid to end the war in Ukraine, triggered by Russia's February 2022 invasion. Here is what we know about the summit so far:",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0808/1527520-putin-trump-summit/",
    "timestamp": "2025-08-08T11:57:34Z"
  },
  {
    "title": "US Sparks Fresh Turmoil in Gold With Surprise Import Tariff",
    "description": "(Bloomberg) -- A US move to put tariffs on imports of gold bars is unleashing fresh turmoil in the bullion market, with prices spiking in New York as dealers brace for a major reordering of global trade flows.US Customs and Border Protection has clarified tha…",
    "link": "https://freerepublic.com/focus/f-news/4333393/posts",
    "timestamp": "2025-08-08T11:57:17Z"
  },
  {
    "title": "How Kelly Ortberg dug Boeing out of a 'very deep hole' in his first year in charge",
    "description": "Kelly Ortberg navigated a crushing strike and has stabilized 737 Max production, with the share price up a third since he took charge a year ago.",
    "link": "https://www.businessinsider.com/boeing-ceo-kelly-ortberg-one-year-on-turning-around-2025-8",
    "timestamp": "2025-08-08T11:55:59Z"
  },
  {
    "title": "Bitcoin likely to lead gains from Trump’s 401(k) crypto order",
    "description": "Trump’s executive order opening 401(k)s to crypto has drawn a mix of praise, caution and criticism from industry leaders and skeptics alike.",
    "link": "https://cointelegraph.com/news/trump-executive-order-crypto-401k-industry-reactions",
    "timestamp": "2025-08-08T11:53:56Z"
  },
  {
    "title": "Sources Say Steve Bannon Will Run For President In 2028",
    "description": "Steve Bannon is in the early stages of secretly plotting an audacious run for president in 2028, well-placed sources have said. Via the Daily Mail:\nThe campaign would divide the Make America Great Again movement Bannon helped build by setting up a herculean b…",
    "link": "https://crooksandliars.com/2025/08/sources-say-steve-bannon-will-run",
    "timestamp": "2025-08-08T11:53:50Z"
  },
  {
    "title": "Hannity Lashes Out At 'Petty' Trump Supporters Who Dare To Criticize Their POTUS",
    "description": "Fox News's bootlicking, sycophantic host Sean Hannity lashed out at Trump supporters who dare to criticize their orange pissdaddy. Of course, he's likely referring to the backlash over the massive Epstein Files cover-up by the Trump administration. How dare a…",
    "link": "https://crooksandliars.com/2025/08/hannity-lashes-out-petty-trump-supporters",
    "timestamp": "2025-08-08T11:53:34Z"
  },
  {
    "title": "'He said the quiet part out loud': Trump's ex-operative says president gave away the game",
    "description": "Donald Trump just tipped his hand in the ongoing redistricting war in Texas, according to the president's former \"trusted operative.\"Former Trump associate Lev Parnas, who says he used to be \"deep inside the Trump machine\" and now reports from the outside, re…",
    "link": "https://www.rawstory.com/trump-quiet-part-out-loud-parnas/",
    "timestamp": "2025-08-08T11:53:07Z"
  },
  {
    "title": "How Trump’s $9T executive order could let you add Bitcoin to your retirement plan",
    "description": "Trump’s move may change US retirement plans. Bitcoin could soon be part of your 401(k), and Wall Street is getting ready.",
    "link": "https://cointelegraph.com/news/how-trump-s-9t-executive-order-could-let-you-add-bitcoin-to-your-retirement-plan",
    "timestamp": "2025-08-08T11:52:06Z"
  },
  {
    "title": "What to know about Stephen Miran, the tariff proponent Trump just nominated to join the Fed’s board of governors",
    "description": "Miran is a rarity, a highly trained economist who makes a logical-sounding case for Trump’s stunningly contrarian game plan.",
    "link": "https://fortune.com/2025/08/08/what-to-know-about-stephen-miran-the-tariff-proponent-trump-just-nominated-to-join-the-feds-board-of-governors/",
    "timestamp": "2025-08-08T11:51:22Z"
  },
  {
    "title": "Ukrainian troops have little hope for peace as Trump’s deadline for Russia arrives",
    "description": "Trump’s efforts to pressure Putin to stop the Ukraine war have so far delivered no progress",
    "link": "https://www.bostonherald.com/2025/08/08/ukrainian-hopes-russia-trump-deadline/",
    "timestamp": "2025-08-08T11:50:44Z"
  },
  {
    "title": "Govt considers energy security to be among its top priorities: Lok Sabha informed",
    "description": "India prioritizes energy security, employing a multi-pronged strategy that includes diversifying supply sources and boosting domestic production. Amid global tensions and sanctions, the government monitors geopolitical developments to safeguard national inter…",
    "link": "https://economictimes.indiatimes.com/news/india/govt-considers-energy-security-to-be-among-its-top-priorities-lok-sabha-informed/articleshow/123188286.cms",
    "timestamp": "2025-08-08T11:48:46Z"
  },
  {
    "title": "Swiss Leader Stood Up to Trump and It Backfired on Her",
    "description": "\"Karin Keller-Sutter admires the grit of former British Prime Minister Margaret Thatcher and as Swiss president is known as technocratic and tenacious. Those traits look to have backfired when she faced off with Donald Trump",
    "link": "https://politicalwire.com/2025/08/08/swiss-leader-stood-up-to-trump-and-it-backfired-on-her/",
    "timestamp": "2025-08-08T11:47:31Z"
  },
  {
    "title": "'Girl Guides of Canada' Stops All US Trips Over Donald Trump's Border crackdown",
    "description": "The Girl Guides of Canada said it was pausing trips to America because of border restrictions in place.",
    "link": "https://www.newsweek.com/girl-guides-canada-us-trumps-trump-border-2110657",
    "timestamp": "2025-08-08T11:47:00Z"
  },
  {
    "title": "Donald Trump Orders Crackdown on Politically-Motivated ‘Debanking’",
    "description": "US President Donald Trump has ordered regulators to investigate the alleged refusal among US banks to supply accounts to customers on the basis of their political or religious beliefs.\nIn an executive order signed Thursday, Trump accused federal banking regul…",
    "link": "https://biztoc.com/x/79b416c5c30903e5",
    "timestamp": "2025-08-08T11:46:58Z"
  },
  {
    "title": "Donald Trump Jr. Posts Photo of Trump Throwing Sex Toy at WNBA Game",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump Jr. posted a photo to Instagram of President Donald Trump throwing a sex toy off the roof of The White House onto a Women's National Basketball Association (WNBA) game, following multiple real-lif…",
    "link": "https://biztoc.com/x/c3d6d5c53316642d",
    "timestamp": "2025-08-08T11:46:58Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to the tail end of the week: Friday, August 8, 2025, and National Mochi Day. Although it’s a day of cultural appropriation, I happen to love mochi, which are Japanese rice cakes made with pounded glutinous rice. They are often filled with stuff like i…",
    "link": "https://whyevolutionistrue.com/2025/08/08/friday-hili-dialogue-536/",
    "timestamp": "2025-08-08T11:45:50Z"
  },
  {
    "title": "WATCH: Trump declines to recommit to Aug. 8 as ceasefire deadline for Putin",
    "description": "President Donald Trump said Russia's Vladimir Putin doesn't have to meet with Ukrainian President Volodymyr Zelenskyy in order for him and Putin to meet.",
    "link": "https://abcnews.go.com/Politics/video/trump-declines-recommit-aug-8-ceasefire-deadline-putin-124476081",
    "timestamp": "2025-08-08T11:45:40Z"
  },
  {
    "title": "Nifty logs longest weekly losing run since 2020 crash. Here's how",
    "description": "Indian markets extended losses for the sixth straight week—longest since April 2020—as US tariff hikes, weak earnings, and persistent FII outflows weighed on investor sentiment. Exporters, especially in textiles and seafood, were hit hardest amid trade tensio…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-logs-longest-weekly-losing-run-since-2020-crash-heres-how/articleshow/123188215.cms",
    "timestamp": "2025-08-08T11:45:03Z"
  },
  {
    "title": "Indias SBI confident about double-digit corporate loan rise despite tariff woes",
    "description": "STATE-BANK-INDIA-RESULTS:India's SBI confident about double-digit corporate loan rise despite tariff woes",
    "link": "https://www.livemint.com/companies/company-results/indias-sbi-confident-about-double-digit-corporate-loan-rise-despite-tariff-woes-11754653466243.html",
    "timestamp": "2025-08-08T11:44:25Z"
  },
  {
    "title": "China defends Russian oil buys after Trump's tariff threats",
    "description": "China has defended its Russian oil imports as lawful, pushing back against U.S. criticism following Washington’s move to impose secondary tariffs on India for similar purchases. The Chinese Foreign Ministry stated it would continue energy cooperation based on…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/china-defends-russian-oil-buys-after-trumps-tariff-threats/articleshow/123187795.cms",
    "timestamp": "2025-08-08T11:43:56Z"
  },
  {
    "title": "Congo Peace May Herald $700 Million Power Deal With US Company",
    "description": "Symbion Power LLC is proposing a 140-megawatt power plant and transmission lines along the border of Democratic Republic of Congo and Rwanda if the two countries can implement a recent US-backed peace agreement.",
    "link": "https://financialpost.com/pmn/business-pmn/congo-peace-may-herald-700-million-power-deal-with-us-company",
    "timestamp": "2025-08-08T11:43:02Z"
  },
  {
    "title": "Donald Trump Jr. Posts Photo of Trump Throwing Sex Toy at WNBA Game",
    "description": "The image is edited to show Trump standing on the roof of The White House, throwing the object onto a basketball court.",
    "link": "https://www.newsweek.com/donald-trump-jr-photo-wnba-game-sex-toy-white-house-2110687",
    "timestamp": "2025-08-08T11:39:32Z"
  },
  {
    "title": "What About the Speck in Your Eye?",
    "description": "Anybody who thinks American optimism is dead doesn\u0092t know a thing about our cut-throat politics.\nEach day the legacy media details President Trump\u0092s latest...",
    "link": "https://www.realclearpolitics.com/articles/2025/08/08/what_about_the_speck_in_your_eye_153154.html",
    "timestamp": "2025-08-08T11:39:15Z"
  },
  {
    "title": "A major historical bitcoin cycle that dictates its price might be breaking",
    "description": "Bitcoin's four-year price cycle, which has often had a predictable pattern, has shown signs of breaking or even disappearing altogether.",
    "link": "https://www.cnbc.com/2025/08/08/bitcoin-btc-price-cycle-might-be-breaking.html",
    "timestamp": "2025-08-08T11:39:13Z"
  },
  {
    "title": "Trump removes IRS chief, temporarily replaces him with Scott Bessent",
    "description": "This adds to Bessent's long list of ongoing tasks, which include negotiating trade deals and helping the president search for the next Fed chair.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-redistricting-tariffs-immigration-gaza-russia-live-updates-rcna222785",
    "timestamp": "2025-08-08T11:39:10Z"
  },
  {
    "title": "Mocking Elected Officials Is a Sign of a Healthy Democracy",
    "description": "There's little question that President Donald Trump and his MAGA devotees can dish it out. Few things epitomize this populist movement more than its irreverence toward established institutions and its willingness to obliterate traditional standards of civilit…",
    "link": "https://biztoc.com/x/a431f0d2168a4e26",
    "timestamp": "2025-08-08T11:35:42Z"
  },
  {
    "title": "Whistleblower Ties Clinton Camp to Fake Russia Hack",
    "description": "A whistleblower report declassified last week suggests that Hillary Clinton's campaign efforts to manufacture evidence tying Donald Trump to alleged Russian hacking in 2016 were deeper than prev",
    "link": "https://www.realclearinvestigations.com/articles/2025/08/08/whistleblower_ties_clinton_campaign_to_fake_russia_hack_1127658.html",
    "timestamp": "2025-08-08T11:35:15Z"
  },
  {
    "title": "Apple is back on Trump's good side. The cost? $600 billion.",
    "description": "It’s been a rocky few months for Apple, but it appears its relationship with Trump is back on solid footing, for now.",
    "link": "https://finance.yahoo.com/news/apple-is-back-on-trumps-good-side-the-cost-600-billion-113413035.html",
    "timestamp": "2025-08-08T11:34:13Z"
  },
  {
    "title": "What Crypto is For",
    "description": "Crypto exists for men to be the biggest pieces of shit imaginable, challenging each other to reach ever higher levels of scumbaggery: Cryptocurrency meme coin creators say they are responsible for the sex toys being thrown at multiple WNBA games, and they are…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/08/what-crypto-is-for",
    "timestamp": "2025-08-08T11:34:00Z"
  },
  {
    "title": "Mass Immigration, Legal Or Illegal, Is Incompatible With National Survival",
    "description": "Mass deportation of illegal immigrants is not enough to save America. We have to recover an insistence on assimilation.",
    "link": "https://thefederalist.com/2025/08/08/mass-immigration-legal-or-illegal-is-incompatible-with-national-survival/",
    "timestamp": "2025-08-08T11:32:52Z"
  },
  {
    "title": "Trump Eases Up On Vladimir Putin By Offering The Russian Dictator 1 Major Concession",
    "description": "A BBC analysis published this week showed Russia has more than doubled its attacks on Ukraine since Trump's inauguration in January.",
    "link": "https://www.huffpost.com/entry/trump-offers-vladimir-putin-concession_n_6895cadee4b03259770b09ab",
    "timestamp": "2025-08-08T11:32:41Z"
  },
  {
    "title": "Skydance and Paramount complete their merger – whither CBS News?",
    "description": "The headline-chewing Skydance Media takeover of Paramount Global was formally concluded Thursday. The merger marks the transition from three decades of control by the Redstone family to companies controlled by […]\nThe post Skydance and Paramount complete thei…",
    "link": "https://www.poynter.org/commentary/2025/skydance-and-paramount-complete-their-merger-whither-cbs-news/",
    "timestamp": "2025-08-08T11:30:03Z"
  },
  {
    "title": "So Much for the ‘Best Health-Care System in the World’",
    "description": "Republicans used to trumpet the innovation of the American medical sector. Now they’re taking a meat axe to it.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-republicans-health-innovation/683795/",
    "timestamp": "2025-08-08T11:30:00Z"
  },
  {
    "title": "It's Beginning to Smell a Lot Like Stagflation",
    "description": "And it's all about Trumponomics",
    "link": "https://paulkrugman.substack.com/p/its-beginning-to-smell-a-lot-like",
    "timestamp": "2025-08-08T11:26:34Z"
  },
  {
    "title": "Intel chief hits out at ‘misinformation’ after Trump calls on him to resign",
    "description": "Lip-Bu Tan also says that board supports restructuring plan at US chipmaker",
    "link": "https://www.irishtimes.com/business/2025/08/08/intel-chief-hits-out-at-misinformation-after-trump-calls-on-him-to-resign/",
    "timestamp": "2025-08-08T11:24:04Z"
  },
  {
    "title": "Analysis:Trump call to oust Intel CEO Tan could sidetrack chipmaker's turnaround",
    "description": "Intel CEO Lip-Bu Tan is already facing an uphill battle in turning around the ailing chipmaker. Now, U.S. President Donald Trump's demand that Tan resign over his ties to Chinese firms will only distract him from that task, two investors and a former senior e…",
    "link": "https://www.channelnewsasia.com/business/analysistrump-call-oust-intel-ceo-tan-could-sidetrack-chipmakers-turnaround-5285111",
    "timestamp": "2025-08-08T11:23:22Z"
  },
  {
    "title": "Israel plans takeover of Gaza City and Texas Gov. Abbott criticizes state Democrats: Morning Rundown",
    "description": "Israeli leaders have approved a plan to escalate the country’s war with Hamas in Gaza.",
    "link": "https://www.nbcnews.com/news/us-news/israel-takeover-gaza-city-texas-abbott-redistricting-morning-rundown-rcna223809",
    "timestamp": "2025-08-08T11:21:46Z"
  },
  {
    "title": "Sydney Sweeney's Brother Breaks Silence on American Eagle Jeans Ad",
    "description": "Trent Sweeney has subtly responded to the discourse amid the controversy.",
    "link": "https://www.newsweek.com/sydney-sweeney-brother-trent-american-eagle-jeans-ad-2110647",
    "timestamp": "2025-08-08T11:21:05Z"
  },
  {
    "title": "Ukrainian troops have little hope for peace as Trump's deadline for Russia arrives",
    "description": "Ukrainian soldiers are expressing little hope for a diplomatic solution to the war with Russia",
    "link": "https://abcnews.go.com/International/wireStory/ukrainian-troops-hope-peace-trumps-deadline-russia-arrives-124475055",
    "timestamp": "2025-08-08T11:20:15Z"
  },
  {
    "title": "Joe Scarborough Warns Israel’s Gaza Plans Will Spark ‘Tragic Quagmire’",
    "description": "Scarborough warned that Netanyahu’s plans to take full control of Gaza will lead to a “tragic quagmire” and were a “nightmare” for hostage families.\nThe post Joe Scarborough Warns Israel’s Gaza Plans Will Spark ‘Tragic Quagmire’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/joe-scarborough-warns-israels-gaza-plans-will-spark-tragic-quagmire/",
    "timestamp": "2025-08-08T11:15:40Z"
  },
  {
    "title": "How Trump’s 401(k) reforms could reshape your retirement plans",
    "description": "Galaxy's Mike Novogratz said the order will lead to a 'massive capital pool' into crypto",
    "link": "https://ambcrypto.com/how-trumps-401k-reforms-could-reshape-your-retirement-plans/",
    "timestamp": "2025-08-08T11:15:04Z"
  },
  {
    "title": "Donald Trump Orders Crackdown on Politically-Motivated 'Debanking' (Joel Khalili/Wired)",
    "description": "Joel Khalili / Wired:\nDonald Trump Orders Crackdown on Politically-Motivated ‘Debanking’  —  In a new executive order, the US president has called on federal regulators to investigate and punish banks for alleged discrimination against conservatives and certa…",
    "link": "https://www.memeorandum.com/250808/p10",
    "timestamp": "2025-08-08T11:15:01Z"
  },
  {
    "title": "Does Trump’s new ‘big beautiful bill’ change the age at which older Americans should start claiming Social Security?",
    "description": "You may need to adjust your retirement plan.",
    "link": "https://finance.yahoo.com/news/does-trump-big-beautiful-bill-111500269.html",
    "timestamp": "2025-08-08T11:15:00Z"
  },
  {
    "title": "Market Rallies as Trump Opens 401(k) Floodgates: Crypto Daybook Americas",
    "description": "The day ahead in crypto: Aug. 8, 2025",
    "link": "https://www.coindesk.com/daybook-us/2025/08/08/market-rallies-as-trump-opens-401-k-floodgates-crypto-daybook-americas",
    "timestamp": "2025-08-08T11:15:00Z"
  },
  {
    "title": "US slaps tariffs on gold bars – media",
    "description": "The move could hit Switzerland, the world’s largest gold refining hub, and disrupt the global bullion market, analysts warn Read Full Article at RT.com",
    "link": "https://www.rt.com/business/622654-us-slaps-tariffs-gold-bars/",
    "timestamp": "2025-08-08T11:14:29Z"
  },
  {
    "title": "Why the stock market shrugged off weak data, recession fears",
    "description": "\"The mindset of the market is to embrace risk,\" one expert said.",
    "link": "https://abcnews.go.com/Business/stock-market-shrugged-off-weak-data-recession-fears/story?id=124407329",
    "timestamp": "2025-08-08T11:13:44Z"
  },
  {
    "title": "The US explores tracking chips to prevent them from getting to China",
    "description": "There have been prohibitions in place to export chips to China. Now, the Science Advisor to President Donald Trump commented that it has been explicitly advised to include location tracking technology in chips.",
    "link": "https://www.notebookcheck.net/The-US-explores-tracking-chips-to-prevent-them-from-getting-to-China.1082933.0.html",
    "timestamp": "2025-08-08T11:12:00Z"
  },
  {
    "title": "Trump's Confederacy rises again (Stephen Robinson/Public Notice)",
    "description": "Stephen Robinson / Public Notice:\nTrump's Confederacy rises again  —  ️ Paid subscribers keep Public Notice free.  If you appreciate our fiercely independent coverage of American politics, please sign up and support us.    —   Subscribe to PN   —  Las…",
    "link": "https://www.memeorandum.com/250808/p9",
    "timestamp": "2025-08-08T11:10:00Z"
  },
  {
    "title": "Trump and the global rise of fascist anti-psychiatry",
    "description": "Trump is using psychiatry to cut care, expand policing and turn public despair into political control.",
    "link": "https://www.aljazeera.com/opinions/2025/8/8/trump-and-the-global-rise-of-fascist-anti-psychiatry",
    "timestamp": "2025-08-08T11:06:08Z"
  },
  {
    "title": "'Extremely regrettable': Trump admin confesses to major 'blunder' in new deal with Japan",
    "description": "In its haste to impose sweeping tariffs on countries the world over, the Trump administration is now admitting to making an \"extremely regrettable” blunder after having accidentally double tariffs on certain products for Japan, and is now vowing to correct th…",
    "link": "https://www.rawstory.com/tariffs-2673869200/",
    "timestamp": "2025-08-08T11:05:10Z"
  },
  {
    "title": "Hundreds of Buddhist monks in Cambodia gather to praise the ceasefire with Thailand and mourn the dead",
    "description": "Hundreds of Buddhist monks in Cambodia on Friday held a religious ceremony to honour soldiers killed in recent border clashes with Thai forces and to pray for peace. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/08/08/hundreds-of-buddhist-monks-in-cambodia-gather-to-praise-the-ceasefire-with-thailand-and-mourn-the-dead",
    "timestamp": "2025-08-08T11:05:00Z"
  },
  {
    "title": "Rosie O’Donnell thinks that this iconic US chat show could be next to be cancelled under Trump",
    "description": "Comedian Rosie O’Donnell has expressed her fear that US morning chat show The View could soon be pulled off air for not aligning politically with president Donald Trump. Rosie O’Donnell, who co-hosted the all-women chat show briefly between 2006 and 2007 and …",
    "link": "https://www.thepinknews.com/2025/08/08/rosie-odonnell-the-view-cancelled-donald-trump/",
    "timestamp": "2025-08-08T11:04:51Z"
  },
  {
    "title": "College endowment tax is leading to hiring freezes and could mean cuts in financial aid",
    "description": "An increase in the tax on university endowments is creating financial challenges for the wealthiest U.S. colleges",
    "link": "https://abcnews.go.com/Business/wireStory/college-endowment-tax-leading-hiring-freezes-cuts-financial-124474479",
    "timestamp": "2025-08-08T11:02:30Z"
  },
  {
    "title": "Trump and Putin’s relationship turns sour as president pushes for resolution with Ukraine",
    "description": "President Donald Trump and Russian President Vladimir Putin's once-friendly relationship has unraveled amid ongoing conflict between Russia and Ukraine.",
    "link": "https://www.foxnews.com/politics/trump-putins-relationship-turns-sour-president-pushes-resolution-ukraine",
    "timestamp": "2025-08-08T11:00:46Z"
  },
  {
    "title": "Trump’s Executive Order Could Be Bitcoin’s Next Big Catalyst: CEO",
    "description": "Mike Novogratz, chief executive of Galaxy Digital, told CNBC that a new executive order from US President Donald Trump could make it easier for retirement plans to include cryptocurrencies. Related Reading: If Bitcoin Hits $1 Million, This Could Be America’s …",
    "link": "https://bitcoinist.com/trumps-executive-order-could-be-bitcoins-next-big-catalyst-ceo/",
    "timestamp": "2025-08-08T11:00:33Z"
  },
  {
    "title": "Teachers unions lose, parents win under major policy move says red state schools chief",
    "description": "The Oklahoma State Department of Education is eliminating statewide standardized end-of-year testing for several subjects to give “local control back to school districts.\"",
    "link": "https://www.foxnews.com/politics/teachers-unions-lose-parents-win-under-major-policy-move-says-red-state-schools-chief",
    "timestamp": "2025-08-08T11:00:26Z"
  },
  {
    "title": "Trump’s Infant Savings Accounts Are One Big Marketing Ploy",
    "description": "“It is branding,” said Rep. Ayanna Pressley (D-Mass.), a chief sponsor of Democrats’ baby bonds bill.",
    "link": "https://www.huffpost.com/entry/trump-infant-savings-accounts-baby-bonds_n_6893dfdae4b0495c6ff50f0f",
    "timestamp": "2025-08-08T11:00:17Z"
  },
  {
    "title": "Messenger: The gerrymandering wars aren't just a bad idea. They're poison.",
    "description": "American democracy is on life support. Redistricting wars will only make the patient sicker.",
    "link": "https://www.stltoday.com/news/local/column/tony-messenger/article_e9308a65-adf5-4bcf-9efd-e6a4ad54f839.html",
    "timestamp": "2025-08-08T11:00:00Z"
  },
  {
    "title": "The Big Risk Trump Is Taking With His Census Order",
    "description": "Trump is taking a big risk with his census order. The president can’t exclude undocumented immigrants from the count. He wants the Supreme Court to let him do it anyway.",
    "link": "http://nymag.com/intelligencer/article/the-big-risk-trump-is-taking-with-his-census-order.html",
    "timestamp": "2025-08-08T11:00:00Z"
  },
  {
    "title": "The Song of the Summer Is Dead",
    "description": "In an age of wavering consensus and widening divisions, music reflects the times more than ever. One factor missing from the discussion of this year’s song of the summer? The Donald Trump of it all.",
    "link": "https://www.wired.com/story/the-song-of-the-summer-is-dead/",
    "timestamp": "2025-08-08T11:00:00Z"
  },
  {
    "title": "Why Trump is starting ‘not to give a crap’ if TikTok goes dark — at least briefly",
    "description": "You might be thinking that Trump just might kick the can down the road with another executive order extension, right?",
    "link": "https://nypost.com/2025/08/08/business/why-trump-is-starting-not-to-give-a-crap-if-tiktok-goes-dark-at-least-briefly/",
    "timestamp": "2025-08-08T11:00:00Z"
  },
  {
    "title": "So, About Those Big Trade Deals",
    "description": "If you read the fine print, the “concessions” from America’s trade partners don’t add up to much.",
    "link": "https://www.theatlantic.com/economy/archive/2025/08/trump-trade-deals/683796/",
    "timestamp": "2025-08-08T11:00:00Z"
  },
  {
    "title": "Pause in Ukraine war could be close, says Poland’s Donald Tusk",
    "description": "Volodymyr Zelenskiy is ‘cautious but optimistic’, says Polish prime minister",
    "link": "https://www.irishtimes.com/world/europe/2025/08/08/pause-in-ukraine-war-could-be-close-says-polands-donald-tusk/",
    "timestamp": "2025-08-08T10:54:59Z"
  },
  {
    "title": "Links 8/8/2025",
    "description": "Our energetic daily links, including Trump-Putin meeting, the many problems for the US arsenal, and vultures coming for your 401K.",
    "link": "https://www.nakedcapitalism.com/2025/08/links-8-8-2025.html",
    "timestamp": "2025-08-08T10:54:39Z"
  },
  {
    "title": "Trump fans 'seething' as he fails to fulfill their 'revenge fantasies': report",
    "description": "“I want arrest[s] not DOJ people making promises on Fox News.”That is a growing train of thought within the MAGA base expressed by far-right conspiracy spreader Alex Jones as Donald Trump's pre-election campaign based on \"retribution\" fails to bear fruit seve…",
    "link": "https://www.rawstory.com/trump-supporters-frustrated-inaction/",
    "timestamp": "2025-08-08T10:52:08Z"
  },
  {
    "title": "Accumulating Bitcoin A Risky Digital Rush By Companies?",
    "description": "US President Donald Trump's media group and Tesla, the electric carmaker owned by tech billionaire Elon Musk, are among an increasing number of companies buying huge amounts of bitcoin.",
    "link": "https://www.ibtimes.com/accumulating-bitcoin-risky-digital-rush-companies-3780516",
    "timestamp": "2025-08-08T10:51:22Z"
  },
  {
    "title": "Donald Trump hosts historic peace summit between Armenia and Azerbaijan (Sasha Vakulina/Euronews)",
    "description": "Sasha Vakulina / Euronews:\nDonald Trump hosts historic peace summit between Armenia and Azerbaijan  —  After almost four decades of bitter conflict, Baku and Yerevan might finally settle for peace in the region.  —  Donald Trump is hosting the leaders of Azer…",
    "link": "https://www.memeorandum.com/250808/p5",
    "timestamp": "2025-08-08T10:50:00Z"
  },
  {
    "title": "Have sections of the US Constitution gone missing from government website?",
    "description": "A Library of Congress website temporarily omitted parts of Article 1 due to a coding error corrected later that day.",
    "link": "https://www.aljazeera.com/news/2025/8/8/have-sections-of-the-us-constitution-gone-missing-from-government-website",
    "timestamp": "2025-08-08T10:48:52Z"
  },
  {
    "title": "Rupee falls 13 paise to close at 87.71 against US dollar",
    "description": "Rupee depreciates against US dollar due to India-US trade deal uncertainty, weak equities, and foreign fund outflows.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-13-paise-to-close-at-8771-against-us-dollar/article69909374.ece",
    "timestamp": "2025-08-08T10:46:59Z"
  },
  {
    "title": "Trumps 100% tariff likely to shift more Taiwans semiconductor industry to US",
    "description": "A proposed 100 per cent U.S. tariff on semiconductor imports, announced by President Donald Trump, could force a strategic shift of Taiwan's chip production landscape, potentially pulling more of the island's semiconductor operations onto American soil, repor…",
    "link": "https://www.livemint.com/companies/news/trumps-100-tariff-likely-to-shift-more-taiwans-semiconductor-industry-to-us-11754649971007.html",
    "timestamp": "2025-08-08T10:46:10Z"
  },
  {
    "title": "German voters want Friedrich Merz to put pressure on Israel",
    "description": "The monthly Deutschlandtrend poll shows little voter confidence in Chancellor Friedrich Merz. Voters want more pressure on Israel, and worry about the impact of US tariffs on the German economy. Chancellor Friedrich Merz of the center-right Christian Democrat…",
    "link": "https://www.dw.com/en/german-voters-want-friedrich-merz-to-put-pressure-on-israel/a-73569573",
    "timestamp": "2025-08-08T10:46:00Z"
  },
  {
    "title": "Trump’s drops IVF promise, preferring to blame women for infertility",
    "description": "Instead of treatment, Project 2025 proposes shaming patients for premarital sex",
    "link": "https://www.salon.com/2025/08/08/trumps-drops-ivf-promise-preferring-to-blame-women-for-infertility/",
    "timestamp": "2025-08-08T10:45:52Z"
  },
  {
    "title": "India said to have paused plans to buy US arms after Trump's tariffs",
    "description": "India has paused plans to procure U.S. weapons and aircraft due to tariffs imposed by President Trump on Indian goods, escalating trade tensions. This decision impacts discussions on Stryker combat vehicles, Javelin anti-tank missiles, and Boeing P8I reconnai…",
    "link": "https://economictimes.indiatimes.com/news/defence/india-said-to-have-paused-plans-to-buy-us-arms-after-trumps-tariffs/articleshow/123187224.cms",
    "timestamp": "2025-08-08T10:45:43Z"
  }
]