[
  {
    "title": "Rubio Pushes Back on Tusk Threat to Shoot Down Russian Aircraft",
    "description": "US Secretary of State Marco Rubio pushed back on Polish Prime Minister Donald Tusk’s assertion that his country was prepared to shoot down foreign aircraft that enter its territory after a series of Russian incursions into NATO airspace.",
    "link": "https://financialpost.com/pmn/business-pmn/rubio-pushes-back-on-tusk-threat-to-shoot-down-russian-aircraft",
    "timestamp": "2025-09-23T14:48:37Z"
  },
  {
    "title": "Big Tech Fraud Prevention Tactics Catch Notice of EU",
    "description": "European regulators are reportedly preparing to examine Apple, Google and Microsoft’s financial fraud protections. The European Union wants to determine whether the three tech giants are failing to properly prevent fraud, the Financial Times reported Tuesday …",
    "link": "http://www.pymnts.com/big-tech/2025/big-tech-fraud-prevention-tactics-catch-notice-european-union/",
    "timestamp": "2025-09-23T14:48:31Z"
  },
  {
    "title": "Jimmy Kimmel is set to return to his late-night show after ABC lifts suspension",
    "description": "Another mystery is how many ABC affiliates will actually carry his return Tuesday.",
    "link": "https://www.denverpost.com/2025/09/23/jimmy-kimmel-return-from-suspension/",
    "timestamp": "2025-09-23T14:48:01Z"
  },
  {
    "title": "Jimmy Kimmel is set to return to his late-night show after ABC lifts suspension",
    "description": "Kimmel's suspension following remarks about the aftermath of conservative activist Charlie Kirk's death triggered a national discussion.",
    "link": "https://www.bostonherald.com/2025/09/23/jimmy-kimmel-return-from-suspension/",
    "timestamp": "2025-09-23T14:48:01Z"
  },
  {
    "title": "Trump Is An Idiot, Part Infinity: 'Don't Take Tylenol!'",
    "description": "Donald Trump held a press conference at the White House, with crackpot RFK Junior and Dr. Oz to tell women not to take Tylenol during pregnancy.\nTrump rambled on throughout, bragging about drug prices, how great he is and claiming that people who have never t…",
    "link": "https://crooksandliars.com/2025/09/trump-screams-dont-take-tylenol",
    "timestamp": "2025-09-23T14:48:00Z"
  },
  {
    "title": "Hey, I’m Walking Here! — Emmanuel Macron Gets Dose Of Big-American-City Living, Calls Trump For Help",
    "description": "French President Emmanuel Macron was forced to walk the streets of Manhattan on Monday night, even after he called President Trump for help clearing traffic.",
    "link": "https://dailycaller.com/2025/09/23/emmanuel-macron-un-new-york-city-streets-traffic-donald-trump-phone-call/",
    "timestamp": "2025-09-23T14:47:57Z"
  },
  {
    "title": "DR Congo will not ‘auction’ mineral wealth to US – president",
    "description": "The Congolese president has said a deal with the US aimed at ending the fighting in his country also seeks to develop the mining sector Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/625110-dr-congo-rejecting-auctioning-minerals-us/",
    "timestamp": "2025-09-23T14:47:56Z"
  },
  {
    "title": "SEC's Atkins Says Agency Pushing Toward 2025 Rules Allowing Crypto Firm Innovation",
    "description": "The U.S. Securities and Exchange Commission is aiming to weigh a new digital assets \"innovation exemption\" by the end of the year, the chairman said.",
    "link": "https://www.coindesk.com/policy/2025/09/23/sec-s-atkins-says-agency-pushing-toward-2025-rules-allowing-crypto-firm-innovation",
    "timestamp": "2025-09-23T14:46:34Z"
  },
  {
    "title": "Romania: The Ally America First Can Rely On at the Gates of the Orient",
    "description": "By Călin Georgescu, former Romanian presidential candidate and first-round winner of the presidential elections For too long, America’s foreign policy establishment has been obsessed with keeping old, tired alliances alive in Western Europe — even when those …",
    "link": "https://www.thegatewaypundit.com/2025/09/__trashed-70/",
    "timestamp": "2025-09-23T14:45:47Z"
  },
  {
    "title": "Trump Questions Purpose of United Nations in UNGA Address",
    "description": "UNITED NATIONS (Sputnik) – US President Donald Trump questioned on Tuesday the UN purpose, claiming that it had not helped him in resolving global conflicts during the first eight months of his second term.",
    "link": "https://sputnikglobe.com/20250923/trump-questions-purpose-of-united-nations-in-unga-address-1122841579.html",
    "timestamp": "2025-09-23T14:45:41Z"
  },
  {
    "title": "When was Tylenol introduced? Trump links it to autism; experts disagree. What to know",
    "description": "President Donald Trump is touting an unproven link between Tylenol, autism; medical experts disagree. How long has Tylenol been around? What to know.",
    "link": "https://www.dispatch.com/story/news/2025/09/23/autism-acetaminphen-tylenol-donald-trump-robert-f-kennedy-rfk-jr/86306719007/",
    "timestamp": "2025-09-23T14:45:20Z"
  },
  {
    "title": "Scheffler: I get calls and texts from Trump after wins",
    "description": "World number one Scottie Scheffler has revealed he receives calls and messages from United States president Donald Trump after he wins tournaments.",
    "link": "https://www.rte.ie/sport/golf/2025/0923/1534930-scheffler-i-get-calls-and-texts-from-trump-after-wins/",
    "timestamp": "2025-09-23T14:45:17Z"
  },
  {
    "title": "We Can Build Fighter Jet Without Germany: France's Dassault",
    "description": "The head of French defence company Dassault said on Tuesday his firm could build the future European fighter jet by itself, as tensions persist with Germany over the multi-billion-euro project.",
    "link": "https://www.ibtimes.com/we-can-build-fighter-jet-without-germany-frances-dassault-3784238",
    "timestamp": "2025-09-23T14:45:10Z"
  },
  {
    "title": "How a Paramount–Warner Bros. Discovery Merger Could Give Trump Even More Power",
    "description": "While ABC says its bringing Jimmy Kimmel back, there's another looming threat to independent media.",
    "link": "https://gizmodo.com/how-a-paramount-warner-bros-discovery-merger-could-give-trump-even-more-power-2000662680",
    "timestamp": "2025-09-23T14:45:02Z"
  },
  {
    "title": "Excusez-moi! Awkward moment Emmanuel Macron rings Trump for help after his motorcade is stopped by cops in New York... but ends up having to get out and walk",
    "description": "Emmanuel Macron was humbled this week after New York City cops stopped his vehicle and forced him to wait on the street to make way for Donald Trump's motorcade. Footage shows the perplexed French president stranded on a road moments after he left the UN head…",
    "link": "https://freerepublic.com/focus/f-news/4342198/posts",
    "timestamp": "2025-09-23T14:44:30Z"
  },
  {
    "title": "Morgan Stanley Crypto Trading Ambitions Drawing Nearer: Bloomberg",
    "description": "The bank will partner with Zerohash to let clients trade BTC, ETH and SOL starting in early 2026, the report said.",
    "link": "https://www.coindesk.com/business/2025/09/23/morgan-stanley-crypto-trading-ambitions-drawing-nearer-bloomberg",
    "timestamp": "2025-09-23T14:43:52Z"
  },
  {
    "title": "Kamala Harris for President? Ex-Veep Makes Surprising Statement About Running for the Oval Office Again in 2028... After Humiliating Loss to Donald Trump",
    "description": "The former vice president discussed her plans for running for office again while promoting her new book, '107 Days.'",
    "link": "https://radaronline.com/p/kamala-harris-president-bid-2028-election-statement-loss-donald-trump/",
    "timestamp": "2025-09-23T14:43:22Z"
  },
  {
    "title": "Democrats Launch Probes of Trump Border Czar After He Reportedly Took $50K Bribe",
    "description": "Democrats in both the US Senate and House on Tuesday announced they were launching a probe into President Donald Trump's \"border czar,\" Tom Homan, after MSNBC reported this past weekend that he was caught on camera accepting a $50,000 cash bribe by undercover…",
    "link": "https://www.commondreams.org/news/tom-homan-bribery-investigation",
    "timestamp": "2025-09-23T14:43:07Z"
  },
  {
    "title": "Jimmy Kimmel is set to return to his late-night show after ABC lifts suspension",
    "description": "Jimmy Kimmel is set to return to his late-night show after ABC lifts suspensionclickondetroit.com",
    "link": "https://www.clickondetroit.com/news/politics/2025/09/23/jimmy-kimmel-is-set-to-return-to-his-late-night-show-after-abc-lifts-suspension/",
    "timestamp": "2025-09-23T14:42:09Z"
  },
  {
    "title": "Donald Trump's health claims 'really dangerous', autism community warns",
    "description": "The US president's claims that there is a link between paracetamol and autism have been widely corrected by health officials - but popular voices in the autism community say they fear the impact that his rhetoric will have.",
    "link": "https://news.sky.com/story/donald-trumps-health-claims-really-dangerous-autism-community-warns-13436769",
    "timestamp": "2025-09-23T14:42:00Z"
  },
  {
    "title": "4 things to know about Iran’s nuclear program as deadline nears for UN ‘snapback’ sanctions",
    "description": "As the U.N. General Assembly meets this week in New York, Iranian President Masoud Pezeshkian and Foreign Minister Abbas Araghchi have a last chance to try to halt the sanctions.",
    "link": "https://www.pbs.org/newshour/world/4-things-to-know-about-irans-nuclear-program-as-deadline-nears-for-un-snapback-sanctions",
    "timestamp": "2025-09-23T14:41:27Z"
  },
  {
    "title": "Trump mocks UN on peace and migration in blistering return",
    "description": "U.S. President Donald Trump relentlessly mocked the United Nations on Tuesday in his first address since his White House comeback, blasting it for failing to bring peace and claiming the world body encourages illegal migration.",
    "link": "https://www.hurriyetdailynews.com/trump-opens-un-speech-with-teleprompter-glitch-touts-ending-seven-wars-213927",
    "timestamp": "2025-09-23T14:41:00Z"
  },
  {
    "title": "International health agencies hit back against Trump’s claims about Tylenol and autism",
    "description": "(CNN) — Backlash has been swift and forceful as other parts of the world woke up to US President Donald Trump’s comments blaming – without solid evidence – acetaminophen and certain vaccines for autism in children.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_fcafdcc6-c105-560b-9b51-cde11488af5f.html",
    "timestamp": "2025-09-23T14:40:56Z"
  },
  {
    "title": "Israeli military moves towards Gaza City’s most populated areas",
    "description": "Local authorities say Israeli fire killed at least 22 people in the Strip on Tuesday",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/23/israeli-military-moves-towards-gaza-citys-most-populated-areas/",
    "timestamp": "2025-09-23T14:40:47Z"
  },
  {
    "title": "Trump delivers on promise to designate Antifa rioters, leaders, funders as terrorists",
    "description": "Organization 'explicitly calls for the overthrow of the United States government, law enforcement and our system of law'",
    "link": "https://www.wnd.com/2025/09/trump-delivers-promise-designate-antifa-rioters-leaders-funders/",
    "timestamp": "2025-09-23T14:40:22Z"
  },
  {
    "title": "Trump Wants Babies’ Vaccines ‘Given Separately,’ Rather Than Combined",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | September 22, 2025\nPresident Donald Trump says he thinks separating the combination vaccines that babies receive would prevent autism, he said in response to a question from The Daily Signal.\nThe Daily Signal…",
    "link": "https://biztoc.com/x/8a0b7b650a599e53",
    "timestamp": "2025-09-23T14:40:01Z"
  },
  {
    "title": "Supreme Court Finally Reconsiders Humphrey’s Executor",
    "description": "By Tyler O'Neil, The Daily Signal | September 22, 2025\nThe Supreme Court Monday announced it would take up a case that gets to the heart of why the deep state exists—it will revisit a precedent that defended the bureaucracy against the executive power vested …",
    "link": "https://biztoc.com/x/ce5e98ad40549d6c",
    "timestamp": "2025-09-23T14:40:01Z"
  },
  {
    "title": "Trump cancels meeting with top Democrats on how to prevent a government shutdown",
    "description": "President Donald Trump abruptly canceled a planned meeting with top congressional Democrats one week before a government shutdown.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-cancels-meeting-top-democrats-prevent-government-shutdown-rcna233187",
    "timestamp": "2025-09-23T14:39:59Z"
  },
  {
    "title": "China Responds To America’s New $100,000 H-1B Visa Fee",
    "description": "By Virginia Allen, The Daily Signal | September 22, 2025\nChina says it welcomes industry talent following President Donald Trump’s announcement of the introduction of a new hurdle to deter H-1B visa applicants. \n On Friday, Trump issued a proclamation adding …",
    "link": "https://biztoc.com/x/dfda4874b124b991",
    "timestamp": "2025-09-23T14:39:52Z"
  },
  {
    "title": "Trump: Development of biological weapons must stop",
    "description": "United States President Donald Trump called on all countries on Tuesday to join Washington in \"ending the development of biological weapons.\"More to come......",
    "link": "https://biztoc.com/x/4e0f4cc70023c799",
    "timestamp": "2025-09-23T14:39:37Z"
  },
  {
    "title": "Trump urges EU to stop buying Russian energy",
    "description": "United States President Donald Trump used his address before the United Nations General Assembly on Tuesday to put pressure on European nations to stop buying Russian energy, saying that it is \"embarr...",
    "link": "https://biztoc.com/x/33c80c6d537f0865",
    "timestamp": "2025-09-23T14:39:18Z"
  },
  {
    "title": "Trump to Address U.N. General Assembly: Live Updates",
    "description": "President Trump will give remarks to the U.N. General Assembly for the first time since taking office this term. Here are the latest updates.",
    "link": "http://nymag.com/intelligencer/article/trump-u-n-general-assembly-live-updates.html",
    "timestamp": "2025-09-23T14:39:00Z"
  },
  {
    "title": "China, India and NATO nations are fuelling Russia’s war in Ukraine, says Trump yet again",
    "description": "Donald Trump rebuked China, India, and NATO for their continued oil purchases from Russia. He claimed these actions indirectly fund the Ukraine war. Trump highlighted his success in ending multiple wars independently. He criticized the UN's ineffectiveness. T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-india-and-nato-nations-are-fuelling-russias-war-in-ukraine-says-trump-yet-again/articleshow/124073221.cms",
    "timestamp": "2025-09-23T14:38:58Z"
  },
  {
    "title": "Ryan Routh gives closing argument in Trump golf course assassination attempt trial",
    "description": "The man accused of attempting to assassinate Donald Trump on a Florida golf course is expected to make his final argument Tuesday ahead of upcoming verdict.",
    "link": "https://www.nbcnews.com/news/us-news/ryan-routh-verdict-trump-assassination-attempt-florida-golf-course-rcna232946",
    "timestamp": "2025-09-23T14:38:48Z"
  },
  {
    "title": "Big Beautiful Tax Relief For Small Businesses — R And D Tax Credit",
    "description": "Big Beautiful Bill has important retroactive tax relief for innovative small businesses that are eligible for the R&D tax credit.",
    "link": "https://www.forbes.com/sites/deanzerbe/2025/09/23/big-beautiful-tax-relief-for-small-businesses---r-and-d-tax-credit/",
    "timestamp": "2025-09-23T14:38:45Z"
  },
  {
    "title": "Trump Lobbies for Nobel Peace Prize in UN Speech — Then Insists He Doesn’t Care About it",
    "description": "\"But for me, the real prize will be the sons and daughters who live to grow up with their mothers and fathers, because millions of people are no longer being killed\"\nThe post Trump Lobbies for Nobel Peace Prize in UN Speech — Then Insists He Doesn’t Care Abou…",
    "link": "https://www.mediaite.com/politics/trump-lobbies-for-nobel-peace-prize-in-un-speech-then-insists-he-doesnt-care-about-it/",
    "timestamp": "2025-09-23T14:38:44Z"
  },
  {
    "title": "Fact check: Do painkillers increase the risk of autism?",
    "description": "Experts say diagnosis increase partly caused by greater awareness and gradual expansion of disorder’s definition",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/09/22/health/autism-tylenol-vaccines-explained.html",
    "timestamp": "2025-09-23T14:37:16Z"
  },
  {
    "title": "White House shifts explanation on Tom Homan, U.S. border czar accused of taking $50,000 in a paper bag",
    "description": "The White House press secretary said on Monday that Tom Homan \"never took\" $50,000 US in cash from an undercover agent, after a damning report emerged over the weekend. Homan himself was less specific in his denial of wrongdoing in an interview with Fox News …",
    "link": "https://www.cbc.ca/news/world/us-homan-bribery-allegation-1.7640932",
    "timestamp": "2025-09-23T14:37:00Z"
  },
  {
    "title": "MAGA Enters Meltdown Mode as Disney Brings Back Jimmy Kimmel",
    "description": "Jimmy Kimmel is headed back to late-night—and MAGA isn’t happy.The late-night host was indefinitely suspended last week for a comment he made criticizing the response of President Donald Trump’s political base to Charlie Kirk’s death, noting their desperation…",
    "link": "https://newrepublic.com/post/200792/maga-meltdown-disney-brings-back-jimmy-kimmel",
    "timestamp": "2025-09-23T14:36:52Z"
  },
  {
    "title": "At UNGA, Trump claims he stopped conflict between India and Pakistan",
    "description": "Donald Trump asserted at the UN that he stopped the India-Pakistan conflict. He stated this claim repeatedly, citing a ceasefire agreement. India refutes any third-party involvement. India launched Operation Sindoor, targeting terror infrastructure. India mai…",
    "link": "https://economictimes.indiatimes.com/news/india/at-unga-trump-claims-he-stopped-conflict-between-india-and-pakistan/articleshow/124073226.cms",
    "timestamp": "2025-09-23T14:36:32Z"
  },
  {
    "title": "Charlie Kirk’s massive memorial was so much more than that — it was a message to the mainstream media",
    "description": "The massive gathering for Charlie Kirk on Sunday was more than just a funeral — it was a message. A 200,000-person crowd inundated the stadium inside and out, and millions around the world watched live. They prayed for, celebrated and mourned a man who brough…",
    "link": "https://freerepublic.com/focus/f-chat/4342197/posts",
    "timestamp": "2025-09-23T14:36:21Z"
  },
  {
    "title": "Trump Advises Against Using Tylenol During Pregnancy Due to 'Increased Risk of Autism'",
    "description": "President Donald Trump warned women from using acetaminophen, known as Tylenol, during pregnancy, due to a \"very increased risk of autism.\"",
    "link": "https://www.breitbart.com/health/2025/09/23/trump-advises-against-using-tylenol-during-pregnancy-due-to-increased-risk-of-autism/",
    "timestamp": "2025-09-23T14:36:11Z"
  },
  {
    "title": "Bitcoin struggles at $113K as Fed's Bowman hints at faster rate cuts",
    "description": "Bitcoin traders revealed new BTC price bottom targets as BTC price action wobbles, while a dovish Fed speech offered bulls little relief.",
    "link": "https://cointelegraph.com/news/bitcoin-struggles-113k-fed-bowman-hints-faster-rate-cuts",
    "timestamp": "2025-09-23T14:35:41Z"
  },
  {
    "title": "Antifa Cop Fired Over Insane Social Media Posts",
    "description": "A North Carolina police officer who declared he was “Antifa” in a post on the social media app BlueSky was fired Monday by the Orange County Sheriff’s Office, according to the News & Observer. Brian Edwards, 37, served as a detention officer for the agency wh…",
    "link": "https://freerepublic.com/focus/f-bloggers/4342196/posts",
    "timestamp": "2025-09-23T14:35:04Z"
  },
  {
    "title": "Gaza City health system continues to collapse, Several European states recognize Palestine at United Nations, Israel threatens humanitarian flotilla",
    "description": "Gaza City health system continues to collapse, Several European states recognize Palestine at United Nations, Israel threatens humanitarian flotilladropsitenews.com",
    "link": "https://www.dropsitenews.com/p/drop-site-daily-gaza-city-health-services-state-of-palestine-flotilla-israel-threat",
    "timestamp": "2025-09-23T14:34:58Z"
  },
  {
    "title": "Trump Is So Close to Getting It With These Strange Comments",
    "description": "Liberals across America suddenly found themselves agreeing with Donald Trump Monday evening.“We have a lot of stupid people in this country running things,” Trump said during a press conference.Trump: \"We've got a lot of stupid people in this country running …",
    "link": "https://newrepublic.com/post/200794/donald-trump-stupid-people-government",
    "timestamp": "2025-09-23T14:34:25Z"
  },
  {
    "title": "Bruce Pearl’s retirement is as confusing and complicated as his coaching career",
    "description": "Bruce Pearl was never big on doing things by the book, so why should his retirement be any different? The 65-year-old Auburn head coach announced Monday — the first day of official practice for Division-I men’s basketball programs across the country — that he…",
    "link": "https://www.sbnation.com/college-basketball/1081523/bruce-pearls-retirement-is-as-confusing-and-complicated-as-his-coaching-career",
    "timestamp": "2025-09-23T14:32:36Z"
  },
  {
    "title": "NATO chief details bloc’s criteria for shooting down Russian jets",
    "description": "Decisions to engage aircraft violating airspace are based on individual threat assessment, Mark Rutte has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625114-nato-engagement-russian-aircraft/",
    "timestamp": "2025-09-23T14:32:26Z"
  },
  {
    "title": "Marjorie Taylor Greene says former colleague George Santos is being tortured in prison",
    "description": "Marjorie Taylor Greene says former colleague George Santos is being tortured in prisonwsbtv.com",
    "link": "https://www.wsbtv.com/news/local/atlanta/marjorie-taylor-greene-says-former-colleague-george-santos-is-being-tortured-prison/HOMFKSYSUJFCBPRBZ6L7P47KOU/",
    "timestamp": "2025-09-23T14:32:06Z"
  },
  {
    "title": "Secret Service Busts ‘Imminent Threat’ That Could Cripple Cell Networks",
    "description": "The Secret Service dismantled a massive network of electronic devices in the New York tri-state area that posed a threat to America’s communications grid.",
    "link": "https://dailycaller.com/2025/09/23/secret-service-busts-imminent-threat-that-could-cripple-cell-networks/",
    "timestamp": "2025-09-23T14:31:55Z"
  },
  {
    "title": "Politicians Go Out of Their Way To Make Political Tensions Worse",
    "description": "We deserve better than to be governed by those who disdain what we believe and how we live.",
    "link": "https://reason.com/2025/09/24/politicians-go-out-of-their-way-to-make-political-tensions-worse/",
    "timestamp": "2025-09-23T14:31:10Z"
  },
  {
    "title": "Shrimp shift: Indian seafood exporters turn to China after US tariff shock",
    "description": "US has levied a 50% tax on Indian shipments, making it difficult for shrimp exporters to compete with Ecuador, Vietnam and Indonesia.",
    "link": "https://www.livemint.com/industry/shrimp-indian-seafood-exporters-china-us-tariff-shock-re-export-market-11758625601049.html",
    "timestamp": "2025-09-23T14:30:03Z"
  },
  {
    "title": "Which Way, Democrats",
    "description": "Did they game this one out?\nPresident Donald Trump on Tuesday appeared to cancel a planned meeting this week with the two top Democrats in Congress, just days before the federal government is set to shut down.\n\nTrump had been scheduled to meet with Senate and…",
    "link": "https://www.eschatonblog.com/2025/09/which-way-democrats.html",
    "timestamp": "2025-09-23T14:30:00Z"
  },
  {
    "title": "Ørsted Shares Soar on U.S. Court Win over Offshore Wind Farm",
    "description": "Shares in Ørsted (CPH: ORSTED) surged by 12% at opening in Copenhagen on Tuesday after a U.S. court blocked last month’s Trump Administration stop-work order on a nearly completed offshore wind project. Ørsted and its joint venture partner Skyborn Renewables …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/rsted-Shares-Soar-on-US-Court-Win-over-Offshore-Wind-Farm.html",
    "timestamp": "2025-09-23T14:30:00Z"
  },
  {
    "title": "Wall Street holds near its record heights",
    "description": "U.S. stock indexes are holding near their record heights.",
    "link": "https://www.bostonherald.com/2025/09/23/stock-market-record-heights-run/",
    "timestamp": "2025-09-23T14:29:17Z"
  },
  {
    "title": "Trump administration proposes H-1B overhaul, favours higher-paid skilled workers",
    "description": "The move follows a White House proclamation introducing a $100,000 annual fee for H-1B visas, aimed at protecting American workers from wage competition.",
    "link": "https://www.thehindubusinessline.com/info-tech/trump-administration-proposes-h-1b-overhaul-favours-higher-paid-skilled-workers/article70085321.ece",
    "timestamp": "2025-09-23T14:29:08Z"
  },
  {
    "title": "‘Too much liquid’: Trump pretends he’s qualified to give medical advice (he’s not)",
    "description": "Donald Trump is the last person anyone should ever turn to for guidance on medicine and vaccines, but that didn't stop him from peddling dangerous nonsense.",
    "link": "https://biztoc.com/x/7176518131b34e64",
    "timestamp": "2025-09-23T14:28:47Z"
  },
  {
    "title": "Trump Torches 'Ridiculous' Democratic Leaders, Cancels Shutdown Meeting",
    "description": "President Donald Trump lashed out at what he called \"unserious and ridiculous demands\" from Democrats to avert a federal government shutdown.\nTrump said in a post on Truth Social that he had concluded that \"no meeting with their Congressional Leaders could po…",
    "link": "https://biztoc.com/x/1f6cc5559faecc9a",
    "timestamp": "2025-09-23T14:28:27Z"
  },
  {
    "title": "Trump whines about 'brutal slog' of governing as he cancels shutdown meeting with Dems",
    "description": "President Donald Trump canceled a meeting with top Democrats, stating that he did not want to deal with the \"long and brutal slog\" of governing.In a wild and rambling rant on Tuesday, the president said demands for funding health care were \"unserious and ridi…",
    "link": "https://www.rawstory.com/trump-government-shutdown-2674024843/",
    "timestamp": "2025-09-23T14:28:21Z"
  },
  {
    "title": "Where High-Skilled Immigrants Are Most Urgently Needed",
    "description": "Just as the dust is starting to settle on the flurry of new tariffs imposed by the Trump administration, a new proclamation from President Donald Trump has sent shockwaves through corporate America. On Friday, the president signed a proclamation taking aim at…",
    "link": "https://biztoc.com/x/7c18870f062e81f7",
    "timestamp": "2025-09-23T14:28:17Z"
  },
  {
    "title": "'Whoever is operating this…': When Trump had to deliver his speech at the UN without a teleprompter",
    "description": "Donald Trump's return to the UN was marked by initial technical difficulties, including a malfunctioning teleprompter and a broken escalator, which he addressed with his characteristic humor. Shifting to substantive issues, Trump criticized the UN's peace eff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whoever-is-operating-this-when-trump-had-to-deliver-his-speech-at-the-un-without-a-teleprompter/articleshow/124073130.cms",
    "timestamp": "2025-09-23T14:28:15Z"
  },
  {
    "title": "Coalition Backs Trump’s Efforts To Purge ‘Woke’ Smithsonian Exhibits",
    "description": "By George Caldwell, The Daily Signal | September 22, 2025\nA coalition of conservative organizations has written a letter to President Donald Trump urging him to combat the “the woke infestation” in the Smithsonian Institution museum network.\n“We write today i…",
    "link": "https://biztoc.com/x/26ba3ea899b0942b",
    "timestamp": "2025-09-23T14:28:13Z"
  },
  {
    "title": "Trump: UN not living up to its potential",
    "description": "United States President Donald Trump said on Tuesday at the United Nations General Assembly that the UN has \"tremendous potential\" but that it is \"not even coming close\" to living up to it. \"For the m...",
    "link": "https://biztoc.com/x/7a8411eb26e0e92f",
    "timestamp": "2025-09-23T14:28:13Z"
  },
  {
    "title": "Big tech companies hit by H-1B visa nightmare",
    "description": "On September 19, President Donald Trump signed an executive order that imposes a $100,000 fee for applicants to the H-1B visa program for skilled foreign workers. \nThe H-1B program enables employers in the United States to temporarily hire foreign workers in …",
    "link": "https://biztoc.com/x/4b68501516df1586",
    "timestamp": "2025-09-23T14:28:10Z"
  },
  {
    "title": "Watch: Macron Phones Trump for Help After Being Pushed to the Curb by Presidential Motorcade",
    "description": "French President Emmanuel Macron was stranded on the streets of New York after police blocked roads to make a path for President Donald Trump’s motorcade . How did he respond? Macron called Trump personally in a plea for help (as you do).\nThe post Watch: Macr…",
    "link": "https://www.breitbart.com/europe/2025/09/23/watch-macron-phones-trump-for-help-after-being-pushed-to-the-curb-by-presidential-motorcade/",
    "timestamp": "2025-09-23T14:28:02Z"
  },
  {
    "title": "Largest rail union backs $85 billion merger after job protections, but critics warn of monopoly risk",
    "description": "“For generations, railroaders have worried about what mergers might mean for their jobs,\" union president says.",
    "link": "https://fortune.com/2025/09/23/union-pacific-norfolk-southern-rail-merger-trump-union-endorsement-job-protection-2025/",
    "timestamp": "2025-09-23T14:27:02Z"
  },
  {
    "title": "Secret Service Dismantles ‘Imminent Threat’ in New York Ahead of UN General Assembly",
    "description": "The Secret Service has dismantled a telecommunications network in New York that posed a threat to top government officials.  After multiple telecommunications threats were directed... Read More\nThe post Secret Service Dismantles ‘Imminent Threat’ in New York …",
    "link": "https://www.dailysignal.com/2025/09/23/secret-service-dismantles-imminent-threat-in-new-york-ahead-un-general-assembly/",
    "timestamp": "2025-09-23T14:26:44Z"
  },
  {
    "title": "Trump's Ryder Cup presence 'extremely important' after 'tough few weeks,' Scottie Scheffler says",
    "description": "Scottie Scheffler said he is excited about President Donald Trump attending the Ryder Cup at Bethpage Black as Team USA looks to take back the trophy against Team Europe.",
    "link": "https://www.foxnews.com/sports/trumps-ryder-cup-presence-extremely-important-after-tough-few-weeks-scottie-scheffler-says",
    "timestamp": "2025-09-23T14:26:16Z"
  },
  {
    "title": "Lula tells UN that attacks on Brazilian judiciary unacceptable",
    "description": "(Reuters) -Brazilian President Luiz Inacio Lula da Silva told the U.N. General Assembly on Tuesday that recent \"unilateral attacks\" against his country's institutions, economy and judiciary were unacceptable, in a thinly veiled response to U.S. foreign policy…",
    "link": "https://www.thestar.com.my/news/world/2025/09/23/lula-tells-un-that-attacks-on-brazilian-judiciary-unacceptable",
    "timestamp": "2025-09-23T14:24:00Z"
  },
  {
    "title": "US Marshals Find Missing Child With Illegals Near Chicago As Trump Admin Cracks Down On City",
    "description": "U.S. Marshals located a missing girl with two illegal migrants in the Chicago area as the Trump administration cracks down on the infamous sanctuary city.",
    "link": "https://dailycaller.com/2025/09/23/feds-locate-child-with-chicago-illegals/",
    "timestamp": "2025-09-23T14:23:25Z"
  },
  {
    "title": "Donald Trump: Watch his UN speech live",
    "description": "According to the White House press secretary, Trump will criticize the institutions that have “undermined the global order” and will present “his vision for the world”\nThe post Donald Trump: Watch his UN speech live appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/09/23/donald-trump-watch-his-un-speech-live/",
    "timestamp": "2025-09-23T14:22:54Z"
  },
  {
    "title": "Is Trump Taking Treaties Back to the Middle Ages?",
    "description": "The White House has usurped the power to make foreign treaties and keeps their texts secret.",
    "link": "http://foreignpolicy.com/2025/09/23/trump-congress-power-treaties-trade-deals-peace-agreement-king/",
    "timestamp": "2025-09-23T14:22:31Z"
  },
  {
    "title": "Kamala Harris Rattles Off Trump-Defying Acts Like Kimmel’s Return As Signs Of Hope",
    "description": "Kamala Harris cited the return of Jimmy Kimmel among a list of acts defying Trump as she gave Rachel Maddow some encouraging signs for the resistance.\nThe post Kamala Harris Rattles Off Trump-Defying Acts Like Kimmel’s Return As Signs Of Hope first appeared o…",
    "link": "https://www.mediaite.com/media/news/kamala-harris-rattles-off-trump-defying-acts-like-kimmels-return-as-signs-of-hope/",
    "timestamp": "2025-09-23T14:21:19Z"
  },
  {
    "title": "US business activity moderates further in September",
    "description": "WASHINGTON (Reuters) -U.S. business activity slowed for a second straight month in September, and though firms complained about tariffs raising costs, they...",
    "link": "https://finance.yahoo.com/news/us-business-activity-moderates-further-141848724.html",
    "timestamp": "2025-09-23T14:18:48Z"
  },
  {
    "title": "US business activity moderates further in September",
    "description": "WASHINGTON (Reuters) -U.S. business activity slowed for a second straight month in September, and though firms complained about tariffs raising costs, they...",
    "link": "https://ca.finance.yahoo.com/news/us-business-activity-moderates-further-141848339.html",
    "timestamp": "2025-09-23T14:18:48Z"
  },
  {
    "title": "Trump tells UNGA that illegal border crossings in US have been zero for four months",
    "description": "Addressing the UN, US President Donald Trump stated a significant drop in illegal immigration. He highlighted America's economic resurgence, citing lower energy prices and defeated inflation. Trump mentioned record stock market performance and rising wages. H…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tells-unga-that-illegal-border-crossings-in-us-have-been-zero-for-four-months/articleshow/124072511.cms",
    "timestamp": "2025-09-23T14:18:16Z"
  },
  {
    "title": "Trump cancels meeting with Democratic leaders ahead of government shutdown deadline | CNN Politics",
    "description": "President Donald Trump said he is scrapping a White House meeting with top congressional Democrats later this week, as the threat of a government shutdown looms over Washington.",
    "link": "https://www.cnn.com/2025/09/23/politics/trump-cancels-meeting-democrats-shutdown",
    "timestamp": "2025-09-23T14:17:54Z"
  },
  {
    "title": "Trump 86’s Scheduled Meeting With Schumer and Jeffries Over ‘Unserious and Ridiculous Demands’",
    "description": "If Congress cannot pass another continuing resolution to keep the government funded, it will shut down at midnight on Oct. 1.\nThe post Trump 86’s Scheduled Meeting With Schumer and Jeffries Over ‘Unserious and Ridiculous Demands’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-86s-scheduled-meeting-with-schumer-and-jeffries-over-unserious-and-ridiculous-demands/",
    "timestamp": "2025-09-23T14:17:37Z"
  },
  {
    "title": "Trump: This is golden age of America",
    "description": "United States President Donald Trump reiterated on Tuesday that this is \"the golden age of America.\"Addressing the United Nations General Assembly (UNGA), he insisted that the US is \"the hottest count...",
    "link": "https://biztoc.com/x/e93c23960ce5ffaa",
    "timestamp": "2025-09-23T14:17:20Z"
  },
  {
    "title": "Trump cancels meeting with Democratic leaders",
    "description": "United States President Donald Trump announced on Tuesday that his meeting with Democratic Senate Minority Leader Chuck Schumer and Democratic House Minority Leader Hakeem Jeffries will not happen.\"Af...",
    "link": "https://biztoc.com/x/2f93bcc1d8fa014b",
    "timestamp": "2025-09-23T14:17:16Z"
  },
  {
    "title": "This Ridiculous, Dangerous Antifa Order Is McCarthyism All Over Again—Possibly Worse",
    "description": "Free speech stole the show last week during the joint press conference\r\n between US President Donald Trump and UK Prime Minister Keir Starmer after a British reporter asked point-blank the Yankee wannabe dictator whether free speech is more under attack in Br…",
    "link": "https://www.commondreams.org/opinion/trump-antifa-order",
    "timestamp": "2025-09-23T14:17:15Z"
  },
  {
    "title": "Donald Trump Shows No Compassion for Joe Biden Since Cancer Diagnosis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump has made a number of unsympathetic statements about former president Joe Biden since Biden's cancer diagnosis was revealed in May.\nIn September, Biden underwent surgery to remove sk…",
    "link": "https://biztoc.com/x/0b5dfbd8f13e9384",
    "timestamp": "2025-09-23T14:17:12Z"
  },
  {
    "title": "Trump says no meeting with top Democrats on shutdown 'could possibly be productive'",
    "description": "President Donald Trump on Tuesday appeared to cancel a planned meeting this week with the two top Democrats in Congress, just days before the federal government is set to shut down.\nTrump had been scheduled to meet with Senate and House Democratic leaders Chu…",
    "link": "https://biztoc.com/x/1e9eb0a7c17b9b11",
    "timestamp": "2025-09-23T14:16:54Z"
  },
  {
    "title": "US government sued for refusing to release ‘vital’ LGBTQ+ census data",
    "description": "A not-for-profit legal services group is suing the US government over its refusal to publish “critical” LGBTQ+ census information. The lawsuit, filed on Monday (22 September), alleged that the Trump administration “unlawfully” withheld data that would result …",
    "link": "https://www.thepinknews.com/2025/09/23/lgbtq-census-data-lawsuit/",
    "timestamp": "2025-09-23T14:16:21Z"
  },
  {
    "title": "Fact-checking claims Trump made about autism",
    "description": "Experts have hit back at claims that use of a common painkiller could cause autism in children.",
    "link": "https://www.bbc.com/news/articles/cj07e3rjev2o",
    "timestamp": "2025-09-23T14:14:44Z"
  },
  {
    "title": "Kamala Harris Half-Heartedly Backs Socialist Zohran Mamdani Without Even Saying His Name",
    "description": "Former Vice President Kamala Harris offered a lackluster endorsement of Democratic New York City mayoral nominee Zohran Mamdani during a Monday interview.",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-zohran-mamdani-rachel-maddow/",
    "timestamp": "2025-09-23T14:14:31Z"
  },
  {
    "title": "Trump advisers now see few checks left to stand in way of his agenda: report",
    "description": "President Donald Trump has gobbled up power and punished his critics in unprecedented ways in just over half a year back in office, and his administration officials warn they're just getting started.Presidents have commonly sought to stretch the limits of the…",
    "link": "https://www.rawstory.com/donald-trump-power-grab/",
    "timestamp": "2025-09-23T14:13:25Z"
  },
  {
    "title": "TSX hits all-time high, topping key level of 30,000",
    "description": "The S&P/TSX Composite Index rose 0.3% to climb above the key psychological threshold of 30,000 for the first time on Sept. 24. Read more.",
    "link": "https://financialpost.com/investing/tsx-hit-all-time-high-topping-30000",
    "timestamp": "2025-09-23T14:12:50Z"
  },
  {
    "title": "Canadian Stocks Hit a Record, Topping Key Level of 30,000",
    "description": "Canadian stocks hit a new all-time high despite tariff threats and a weakening economy.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-stocks-hit-a-record-topping-key-level-of-30000",
    "timestamp": "2025-09-23T14:12:50Z"
  },
  {
    "title": "Trump cancels meeting with Schumer, Jeffries over 'ridiculous demands' as funding deadline looms",
    "description": "President Donald Trump axed a meeting with Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Hakeem Jeffries, D-N.Y., arguing that the pair were \"unserious.\"",
    "link": "https://www.foxnews.com/politics/schumer-jeffries-meet-trump-white-house-shutdown-deadline-looms",
    "timestamp": "2025-09-23T14:12:22Z"
  },
  {
    "title": "France fully supports conclusion of EU-India trade agreement",
    "description": "France’s Secretary General for Foreign Affairs Anne-Marie Descôtes thanked the Indian side for invitation to President Emmanuel Macron to the AI Impact Summit",
    "link": "https://www.thehindubusinessline.com/economy/france-fully-supports-conclusion-of-eu-india-trade-agreement/article70085140.ece",
    "timestamp": "2025-09-23T14:10:40Z"
  },
  {
    "title": "Trump says no meeting with top Democrats on shutdown 'could possibly be productive'",
    "description": "President Donald Trump appeared to cancel a meeting with the two top Democrats in Congress, just days before the government is set to shut down.",
    "link": "https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html",
    "timestamp": "2025-09-23T14:10:38Z"
  },
  {
    "title": "Budget 2026 plans will limit response to future economic shocks, committee hears",
    "description": "Economy expected to be 1% smaller after Trump tariffs, Central Bank warns",
    "link": "https://www.irishtimes.com/business/2025/09/23/budget-2026-plans-will-limit-response-to-future-economic-shocks-committee-hears/",
    "timestamp": "2025-09-23T14:10:00Z"
  },
  {
    "title": "'Pay no attention': global health agencies dismiss false Trump claim on everyday painkillers (Oliver Holmes/The Guardian)",
    "description": "Oliver Holmes / The Guardian:\n‘Pay no attention’: global health agencies dismiss false Trump claim on everyday painkillers  —  Medical experts and regulators say US president should not be questioning established science  —  Global health agencies and regulat…",
    "link": "https://www.memeorandum.com/250923/p41",
    "timestamp": "2025-09-23T14:10:00Z"
  }
]