[
  {
    "title": "Trump Slams Putin Again: 'He's Killing a Lot of People'",
    "description": "President Donald Trump reiterated his displeasure with Vladimir Putin over the war in Ukraine and confirmed he’s sending more defensive weapons to President Volodymyr Zelenskiy’s government, sweeping aside an earlier pause by the Pentagon.\n“He’s killing too m…",
    "link": "https://biztoc.com/x/044ec62356fc7a4b",
    "timestamp": "2025-07-08T23:27:15Z"
  },
  {
    "title": "Todd and Julie Chrisley Discuss the Status of Their Relationship Following Prison Release",
    "description": "Todd and Julie Chrisley spoke about divorce rumors on the latest episode of their daughter's \"Unlocked with Savannah Chrisley\" podcast.",
    "link": "https://www.today.com/popculture/news/todd-julie-chrisley-divorce-rumors-rcna217637",
    "timestamp": "2025-07-08T23:25:53Z"
  },
  {
    "title": "Trump Uses AOC to Skewer 'Palestinian Senator' Schumer: 'That Stupid Guy...'",
    "description": "The remarks came after a reporter praised Trump for his leadership during the devastating Central Texas floods.",
    "link": "https://www.westernjournal.com/trump-uses-aoc-skewer-palestinian-senator-schumer-stupid-guy/",
    "timestamp": "2025-07-08T23:24:58Z"
  },
  {
    "title": "Sanders Slams 'War Criminal' Netanyahu Ahead of New Meeting With Trump to Plan Gaza Ethnic Cleansing",
    "description": "U.S. Sen. Bernie Sanders sharply criticized Israeli Prime Minister Benjamin Netanyahu on Tuesday as the fugitive from the International Criminal Court met with lawmakers ahead of a second White House meeting with U.S. President Donald Trump to advance plans f…",
    "link": "https://www.commondreams.org/news/sanders-netanyahu-trump",
    "timestamp": "2025-07-08T23:22:26Z"
  },
  {
    "title": "Zohran Mamdani’s DSA sponsors protest with ‘death, death to the IDF!’ war cry",
    "description": "A network of 40 organizations with Marxist and Islamist ideologies protest Israel in D.C., chanting militant slogans amid ceasefire talks between Israel and Hamas.",
    "link": "https://www.foxnews.com/opinion/zohran-mamdanis-dsa-sponsors-protest-death-death-idf-war-cry",
    "timestamp": "2025-07-08T23:22:18Z"
  },
  {
    "title": "Pew: Most Canadians View US as Greatest Threat to It",
    "description": "Most Canadian citizens consider the United States the \"greatest threat\" to their country, according to a survey published Tuesday by the Pew Research Center. Among Canadians, 59% said that the U.S. was the nation's greatest threat, as President Donald Trump c…",
    "link": "https://freerepublic.com/focus/f-news/4327613/posts",
    "timestamp": "2025-07-08T23:21:59Z"
  },
  {
    "title": "Fox's Tarlov Pisses In Cohosts' Punchbowl, Again",
    "description": "Jessica Tarlov's cohosts on this Monday's The Five really didn't want to hear about what's actually going on at these Trump Gulags across the country.\nThe liars on Trump's propaganda network have to keep pretending that all of the really shameful, cruel, crim…",
    "link": "https://crooksandliars.com/2025/07/foxs-tarlov-pisses-cohosts-punchbowl",
    "timestamp": "2025-07-08T23:19:59Z"
  },
  {
    "title": "BREAKING: FBI Launches Criminal Investigations into Obama-Era Spymasters John Brennan and James Comey",
    "description": "Former CIA Director John Brennan and disgraced former FBI Director James Comey are now under criminal investigation by the FBI for potential wrongdoing related to the now-debunked Trump–Russia collusion narrative — including allegedly lying under oath to Cong…",
    "link": "https://www.thegatewaypundit.com/2025/07/breaking-fbi-launches-criminal-investigations-obama-era-spymasters/",
    "timestamp": "2025-07-08T23:18:29Z"
  },
  {
    "title": "Trump’s previous tariff push terrified the world economy. He’s betting this time is different",
    "description": "By JOSH BOAK\nWASHINGTON (AP) — When President Donald Trump last rolled out tariffs this high, financial markets quaked, consumer confidence crashed and his popularity plunged.\nRelated Articles\n \n \n \n FACT FOCUS: No, weather modification did not cause the dead…",
    "link": "https://biztoc.com/x/10c2382bd3c5dc9f",
    "timestamp": "2025-07-08T23:16:20Z"
  },
  {
    "title": "Trump now backs tough Russia sanctions bill, Graham says",
    "description": "A bill targeting Russia with substantial new sanctions is gaining momentum in the Senate, with a key GOP senator signaling Tuesday that President Donald Trump is now on board. \n“We’re moving,” said Sen. Lindsey Graham (R-S.C.), the bill’s author, adding that …",
    "link": "https://biztoc.com/x/9ab72bf974245377",
    "timestamp": "2025-07-08T23:16:12Z"
  },
  {
    "title": "‘Experts’ Warned Free Markets Would Ruin Argentina — Looks Like They Were Dead Wrong",
    "description": "Argentina's economy is a far cry from what so-called “experts” predicted when they warned that President Javier Milei’s leadership would devastate the country.",
    "link": "https://dailycaller.com/2025/07/08/experts-warned-free-markets-ruin-argentina-dead-wrong/",
    "timestamp": "2025-07-08T23:12:36Z"
  },
  {
    "title": "Trump’s previous tariff push terrified the world economy. He’s betting this time is different",
    "description": "Trump’s previous tariff push terrified the world economy. He’s betting this time is differenttwincities.com",
    "link": "https://www.twincities.com/2025/07/08/trump-bets-different-tariff-reaction/",
    "timestamp": "2025-07-08T23:12:24Z"
  },
  {
    "title": "Marion McKeone: Texas is hurting after the floods, but it won't hurt Trump",
    "description": "In the wake of this week’s devastating floods in Texas, the US correspondent considers the political fallout for Trump and others.",
    "link": "https://www.thejournal.ie/readme/texas-floods-trump-6755812-Jul2025/",
    "timestamp": "2025-07-08T23:10:08Z"
  },
  {
    "title": "US extends suspension of reciprocal tariffs to Aug 1; relief to Indian exporters",
    "description": "NEW DELHI, July 8: The US has extended the suspension of its April 2 reciprocal tariffs until August 1, a move which provides relief to Indian exporters and additional time for New Delhi and Washington to resolve pending issues to finalise an interim trade de…",
    "link": "https://thehillstimes.in/national/us-extends-suspension-of-reciprocal-tariffs-to-aug-1-relief-to-indian-exporters",
    "timestamp": "2025-07-08T23:10:00Z"
  },
  {
    "title": "FBI launches criminal investigations of John Brennan, James Comey over Trump-Russia probe: DOJ sources",
    "description": "CIA Director John Ratcliffe referred Brennan for criminal investigation to the FBI, sources told Fox News Digital.",
    "link": "https://nypost.com/2025/07/08/us-news/fbi-launches-criminal-investigations-of-john-brennan-james-comey-over-trump-russia-probe/",
    "timestamp": "2025-07-08T23:09:57Z"
  },
  {
    "title": "Patriotic ICE officer replaces American flag after protesters burned existing banner at Portland facility",
    "description": "Federal officer raises new American flag at Portland ICE facility after protesters burned the previous one during Independence Day riots that included assaults on agents.",
    "link": "https://www.foxnews.com/us/patriotic-ice-officer-replaces-american-flag-protesters-burned-existing-banner-portland-facility",
    "timestamp": "2025-07-08T23:06:33Z"
  },
  {
    "title": "SCOTUS Greenlights Trump’s 'Wrecking Ball' Federal Job Cuts to Move Forward Amid Ongoing Legal Battle",
    "description": "The Supreme Court has allowed President Donald Trump’s “wrecking ball” federal job cuts to proceed while the legal battle continues. The Tuesday night ruling underscores the urgent need to rein in an oversized federal workforce and restore efficiency to gover…",
    "link": "https://freerepublic.com/focus/f-news/4327610/posts",
    "timestamp": "2025-07-08T23:06:13Z"
  },
  {
    "title": "Former Fed governor says Trump is right to be frustrated with Powell's restrictive policies",
    "description": "Former Federal Reserve Governor Kevin Warsh said the U.S. economy could grow tremendously, but \"bad\" policies by the Federal Reserve are keeping it from doing so.\nWarsh told \"Kudlow\" host Larry Kudlow that he had \"some sympathy\" for President Donald Trump bei…",
    "link": "https://biztoc.com/x/d2f755360d00bb3a",
    "timestamp": "2025-07-08T23:05:12Z"
  },
  {
    "title": "The Texas-Flood Blame Game Is a Distraction",
    "description": "Hastily assigning responsibility comes at the risk of oversimplifying the way natural disasters work.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/texas-flood-casualities-blame-game/683466/",
    "timestamp": "2025-07-08T23:05:00Z"
  },
  {
    "title": "Trump delays tariffs as the rest of the world plays hardball",
    "description": "Trump delays tariffs as the rest of the world plays hardball\nDonald Trump's White House had grandly promised \"90 deals in 90 days\" after partially pausing the process of levying what the US president called \"reciprocal\" tariffs.\nIn reality, there won't even b…",
    "link": "https://biztoc.com/x/fa2866ca6a0fee2f",
    "timestamp": "2025-07-08T23:04:40Z"
  },
  {
    "title": "PBS 'not on the table' to escape concerning pharmaceuticals tariff",
    "description": "Treasurer Jim Chalmers reaffirms the government will not bargain on the Pharmaceutical Benefits Scheme in order to escape a \"concerning\" proposed 200 per cent tariff on pharmaceutical exports to the United States.",
    "link": "https://www.abc.net.au/news/2025-07-09/pharmaceutical-benefits-scheme-ruled-out-us-tariff-deal/105510310",
    "timestamp": "2025-07-08T23:01:50Z"
  },
  {
    "title": "Trump delays tariffs as the rest of the world plays hardball",
    "description": "The US president reveals his poker \"tell\" by showing he is open to delays to secure trade deals.",
    "link": "https://www.bbc.com/news/articles/c628nk51364o",
    "timestamp": "2025-07-08T23:01:40Z"
  },
  {
    "title": "Will we never know the truth about Jeffrey Epstein?",
    "description": "“It’s very disappointing,” said victim attorney Eric Lerner, regarding the dearth of Epstein information.",
    "link": "https://nypost.com/2025/07/08/us-news/will-we-never-know-the-truth-about-jeffrey-epstein/",
    "timestamp": "2025-07-08T23:00:32Z"
  },
  {
    "title": "GOP budget chair vows to 'make another run' at Trump policies cut from budget",
    "description": "Several provisions of President Donald Trump's mega-budget bill that were cut for parliamentary reasons could resurface in future legislation, Politico reported Tuesday. House Budget Chair Rep. Jodey Arrington (R-TX) told the outlet during a news conference t…",
    "link": "https://www.rawstory.com/trump-2672974489/",
    "timestamp": "2025-07-08T23:00:02Z"
  },
  {
    "title": "Big Oil Braces for Oil Price Hit",
    "description": "Earlier this week, Shell warned its second-quarter earnings would be weaker due to lower trade in gas and oil derivatives. Now, Exxon has joined its peer in the warning series, saying weaker oil and gas prices during the second quarter would affect its financ…",
    "link": "https://oilprice.com/Energy/Oil-Prices/Big-Oil-Braces-for-Oil-Price-Hit.html",
    "timestamp": "2025-07-08T23:00:00Z"
  },
  {
    "title": "Sam Altman jabs rival Elon Musk over Trump divorce: ‘Elon busts up with everybody’",
    "description": "\"Elon busts up with everybody, that's what he does,\" the 40-year-old tech billionaire said, grinning from ear to ear behind a pair of sunglasses by the French designer brand Vuarnet",
    "link": "https://nypost.com/2025/07/08/business/sam-altman-jabs-rival-elon-musk-over-trump-divorce-elon-busts-up-with-everybody/",
    "timestamp": "2025-07-08T22:56:35Z"
  },
  {
    "title": "Optimistic individual investors are helping shape the market, Jim Cramer says",
    "description": "CNBC's Jim Cramer on Tuesday suggested individual investors are helping to drive market action.",
    "link": "https://www.cnbc.com/2025/07/08/individual-investors-are-helping-to-shape-the-market-jim-cramer-says.html",
    "timestamp": "2025-07-08T22:54:53Z"
  },
  {
    "title": "Can Trump Broker Lasting Peace In Gaza?",
    "description": "President Donald Trump has been working to bring a ceasefire to the Gaza strip, but questions still remain as to whether or not any peace will last.",
    "link": "https://dailycaller.com/2025/07/08/can-trump-broker-lasting-peace-in-gaza/",
    "timestamp": "2025-07-08T22:53:45Z"
  },
  {
    "title": "Trump’s previous tariff push terrified the world economy. He’s betting this time is different",
    "description": "He told his Cabinet that past presidents who hadn’t aggressively deployed tariffs were “stupid.”",
    "link": "https://www.bostonherald.com/2025/07/08/trump-bets-different-tariff-reaction/",
    "timestamp": "2025-07-08T22:51:43Z"
  },
  {
    "title": "Rubio Departs For Whirlwind Asia Trip Overshadowed By Tariffs",
    "description": "US Secretary of State Marco Rubio departed for Malaysia on Tuesday for meetings with ASEAN allies, a trip that has been overshadowed by fears of a trade war.",
    "link": "https://www.ibtimes.com/rubio-departs-whirlwind-asia-trip-overshadowed-tariffs-3777933",
    "timestamp": "2025-07-08T22:51:18Z"
  },
  {
    "title": "Investigating claims Houston pediatrician lost her job over Facebook comments about Texas floods",
    "description": "A Houston pediatric practice fired Dr. Christina Propst after she posted online that Texas flood victims in July 2025 were supporters of President Donald Trump who got what they voted for.",
    "link": "https://www.snopes.com//fact-check/houston-pediatrician-facebook-floods/",
    "timestamp": "2025-07-08T22:50:00Z"
  },
  {
    "title": "Army will end most of its ceremonial horse programs and adopt out the animals",
    "description": "The U.S. Army’s history is closely tied to its mounted cavalry, those soldiers who rode into battle on horseback",
    "link": "https://abcnews.go.com/US/wireStory/army-end-ceremonial-horse-programs-adopt-animals-123590281",
    "timestamp": "2025-07-08T22:46:29Z"
  },
  {
    "title": "Trump criticizes Putin after approving more weapons for Ukraine",
    "description": "SummaryTrump criticizes Putin, says his statements 'meaningless' Trump says he is considering Senate bill on Russia sanctions Ukraine's Zelenskiy calls for intensified contacts to secure U.S. arms supplies WASHINGTON, July 8 (Reuters) - President Donald Trump…",
    "link": "https://freerepublic.com/focus/f-news/4327606/posts",
    "timestamp": "2025-07-08T22:45:52Z"
  },
  {
    "title": "EXCLUSIVE: Poll Shows Dem Primary Slugfest Brewing For Senate Seat GOP Seeks To Flip",
    "description": "Michigan's Democratic primary contest is shaping up to be a drawn-out slog for the party's nomination, new polling shows.",
    "link": "https://dailycaller.com/2025/07/08/michigan-senate-democratic-primary-poll-stevens-el-sayed/",
    "timestamp": "2025-07-08T22:45:31Z"
  },
  {
    "title": "How have prices changed under Trump? Experts explain. - ABC News",
    "description": "How have prices changed under Trump? Experts explain.\nInflation is hovering near its lowest level since 2021.\nPresident Donald Trump’s sweeping tariffs earlier this year set off alarm among economists about a risk that just about every U.S. shopper fears: maj…",
    "link": "https://biztoc.com/x/288e6d764803777c",
    "timestamp": "2025-07-08T22:42:26Z"
  },
  {
    "title": "Iran’s FM Araghchi, Saudi Crown Prince MBS hold ‘fruitful’ talks in Jeddah",
    "description": "Tehran's top diplomat Abbas Araghchi visits Saudi Arabia for the first time after Iran's 12-day war with Israel.",
    "link": "https://www.aljazeera.com/news/2025/7/8/irans-fm-araghchi-saudi-crown-prince-mbs-hold-fruitful-talks-in-jeddah",
    "timestamp": "2025-07-08T22:42:04Z"
  },
  {
    "title": "Gavin Newsom says he’s ‘spellbound’ by AME bishops as he embarks on tour of pivotal Dem presidential primary state",
    "description": "California Gov. Gavin Newsom called on rural voters in South Carolina to exercise their “moral authority” in standing up to President Donald Trump and Republicans in next year’s midterm elections.…",
    "link": "https://nypost.com/2025/07/08/us-news/gavin-newsom-swings-through-south-carolina-where-democrats-will-play-pivotal-role-in-2028/",
    "timestamp": "2025-07-08T22:42:03Z"
  },
  {
    "title": "‘You Know About This?’ Trump Whispers to Hegseth During Reporter’s Question",
    "description": "\"John might know,\" Hegseth replied.\nThe post ‘You Know About This?’ Trump Whispers to Hegseth During Reporter’s Question first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/you-know-about-this-trump-whispers-to-hegseth-during-reporters-question/",
    "timestamp": "2025-07-08T22:41:20Z"
  },
  {
    "title": "Impact of Trump tariff move on financial market minimal: OJK",
    "description": "The Financial Services Authority (OJK) has said that United States President Donald Trump&rsquo;s decision to keep the 32-percent reciprocal tariff on ...",
    "link": "https://en.antaranews.com/news/365021/impact-of-trump-tariff-move-on-financial-market-minimal-ojk",
    "timestamp": "2025-07-08T22:40:10Z"
  },
  {
    "title": "The Supreme Court’s order letting Trump conduct mass federal layoffs, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump can proceed with his campaign o…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/419241/supreme-court-trump-mass-layoffs-federal-employees-explained",
    "timestamp": "2025-07-08T22:39:38Z"
  },
  {
    "title": "Copper Prices Surge To Record High In Largest Increase Since ‘80s—Here’s Why",
    "description": "Trump ordered an earlier investigation into possible tariffs on copper imports, arguing global competitors could pose a threat to national security and economic stability.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/08/copper-prices-surge-to-record-high-in-largest-increase-since-80s-heres-why/",
    "timestamp": "2025-07-08T22:39:10Z"
  },
  {
    "title": "Trump and Netanyahu meet for a second time amid Gaza ceasefire talks",
    "description": "The US says talks are being held on a temporary, 60-day ceasefire in Gaza that includes the release of some hostages.",
    "link": "https://www.bbc.com/news/articles/ce3newwl1zeo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-08T22:38:04Z"
  },
  {
    "title": "Trump and Netanyahu meet for a second time amid Gaza ceasefire talks",
    "description": "The US says talks are being held on a temporary, 60-day ceasefire in Gaza that includes the release of some hostages.",
    "link": "https://www.bbc.com/news/articles/ce3newwl1zeo",
    "timestamp": "2025-07-08T22:37:57Z"
  },
  {
    "title": "In 'Serious Blow to Our Democracy,' Supreme Court Allows Trump Mass Firing Order",
    "description": "The U.S. Supreme Court on Tuesday lifted a block on U.S. President Donald Trump's February executive order directing federal agency leaders to \"promptly undertake preparations to initiate large-scale reductions in force\" and a related memorandum.In response t…",
    "link": "https://www.commondreams.org/news/doge-supreme-court",
    "timestamp": "2025-07-08T22:37:47Z"
  },
  {
    "title": "Democrats Finally Grow a Pair! Lefties Urge Supporters to 'Get More Violent' in Donald Trump Resistance — And Warn Lawmakers Need to 'Prepare to Get Shot'",
    "description": "Democrats have urged supporters to 'get more violent' and suggesting lawmakers prepare to 'get shot' Donald Trump resistance.",
    "link": "https://radaronline.com/p/democrats-urge-violence-donald-trump-resistance-warn-lawmakers-prepare-get-shot/",
    "timestamp": "2025-07-08T22:37:19Z"
  },
  {
    "title": "Trump's 'Golden Dome' poised to become 'massively corrupt' boondoggle: Lawmakers",
    "description": "A quartet of Democratic lawmakers are warning that U.S. President Donald Trump's plans to build a \"Golden Dome\" missile defense system could open the door to a corrupt boondoggle.In a letter to Defense Secretary Pete Hegseth, Sens. Ed Markey (D-Mass.) and Jef…",
    "link": "https://www.rawstory.com/trump-golden-dome/",
    "timestamp": "2025-07-08T22:37:02Z"
  },
  {
    "title": "Ahead of next year’s World Cup, FIFA takes up residence in Trump Tower",
    "description": "FIFA is taking up residence in Trump Tower as the international soccer organization cozies up to the president ahead of next year’s World Cup, which is set to take place partly in the United States.",
    "link": "https://www.msnbc.com/top-stories/latest/fifa-trump-tower-world-cup-2026-soccer-rcna217622",
    "timestamp": "2025-07-08T22:37:00Z"
  },
  {
    "title": "FBI launches criminal investigations of John Brennan, James Comey: DOJ sources",
    "description": "The FBI is investigating former CIA Director John Brennan and former FBI Director James Comey for what sources describe as a 'conspiracy' related to the Trump-Russia probe.",
    "link": "https://www.foxnews.com/politics/john-brennan-james-comey-under-criminal-investigation-doj-sources",
    "timestamp": "2025-07-08T22:33:27Z"
  },
  {
    "title": "‘Sounds a lot like sedition’: Former USAID crew allegedly planning ‘sabotage’ of U.S. government",
    "description": "The 'widespread practice of simple sabotage will harass and demoralize enemy administrators and police'",
    "link": "https://www.wnd.com/2025/07/sounds-lot-like-sedition-former-usaid-crew-allegedly/",
    "timestamp": "2025-07-08T22:32:06Z"
  },
  {
    "title": "National Park Visitors Reject Trump Administration’s Bigoted Attempt To Erase History",
    "description": "In Trump’s eyes, anything that doesn’t make white people appear to be the saviors of the world is something that should be buried. Whatever the phrase “fake news” won’t make go away is subject to seemingly daily government edicts that declare any recognition …",
    "link": "https://www.techdirt.com/2025/07/08/national-park-visitors-reject-trump-administrations-bigoted-attempt-to-erase-history/",
    "timestamp": "2025-07-08T22:32:03Z"
  },
  {
    "title": "Trump's Approval Rating With Women Hits New Low in Second Term: Polls",
    "description": "The drop in support among women could represent a political challenge for Trump, as focus may soon pivot to midterm elections.",
    "link": "https://www.newsweek.com/trumps-approval-rating-women-hits-new-low-second-term-polls-2096355",
    "timestamp": "2025-07-08T22:31:57Z"
  },
  {
    "title": "12 Questions All Should Be Asking About The Jeffrey Epstein Cover Up",
    "description": "I literally feel sick right now.  After waiting for years for the truth about Jeffrey Epstein’s sex trafficking operation to come out, and after months of being promised that stunning new information would be released soon, now we are being told to forget the…",
    "link": "https://www.shtfplan.com/headline-news/12-questions-all-should-be-asking-about-the-jeffrey-epstein-cover-up",
    "timestamp": "2025-07-08T22:30:14Z"
  },
  {
    "title": "'Mentally failing': Critics alarmed by Trump's 'mind-blowing' Ukraine remarks",
    "description": "President Donald Trump is claiming he does not know who ordered last week’s halt in critical U.S. weapons shipments to Ukraine—a statement that immediately sparked backlash and renewed questions by critics over whether the commander-in-chief is in control of …",
    "link": "https://www.rawstory.com/trump-ukraine-2672978621/",
    "timestamp": "2025-07-08T22:28:02Z"
  },
  {
    "title": "Trump mulls unique strategy to crush DC crime wave: ‘We're thinking about it’",
    "description": "President Donald Trump announced during a Tuesday Cabinet meeting that he is considering a bold strategy to confront the ongoing crime crisis in Washington, D.C.In the event that the city's current leadership fails to deliver on significant crime reduction, T…",
    "link": "https://www.theblaze.com/news/trump-mulls-unique-strategy-to-crush-dc-crime-wave-were-thinking-about-it",
    "timestamp": "2025-07-08T22:27:58Z"
  },
  {
    "title": "AI-enabled Marco Rubio impostor reportedly targets top officials",
    "description": "Plus, Trump’s media company announces a partnership with Newsmax, racist AI videos go viral on TikTok, and ActBlue keeps raising money for Democrats — all in this week’s Tuesday Tech Drop.",
    "link": "https://www.msnbc.com/top-stories/latest/marco-rubio-ai-impostor-grok-musk-tiktok-rcna217603",
    "timestamp": "2025-07-08T22:23:11Z"
  },
  {
    "title": "US arrests Chinese hacker Xu Zewei for stealing COVID-19 research and hacking Microsoft servers",
    "description": "Xu Zewei, a Chinese national, has been apprehended in Italy following a U.S. extradition request for his involvement in hacking activities. He is accused of stealing COVID-19 research from American universities and orchestrating a massive attack on Microsoft …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-arrests-chinese-hacker-xu-zewei-for-stealing-covid-19-research-and-hacking-microsoft-servers/articleshow/122328468.cms",
    "timestamp": "2025-07-08T22:22:20Z"
  },
  {
    "title": "GOP Rep. Weirdly Lies About Helping His State Survive The Medicaid Cuts He Voted For",
    "description": "Rep. Derrick Van Orden (R-Wis.) insists he helped get $1 billion for hospitals in his state hit by Trump’s tax bill. Except his governor and state legislature did that.",
    "link": "https://www.huffpost.com/entry/derrick-van-orden-trump-tax-bill-medicaid-cuts_n_686d4a1fe4b088c62569b44c",
    "timestamp": "2025-07-08T22:22:13Z"
  },
  {
    "title": "Woman Arrested at Mar-a-Lago With 'Urgent Message' For Trump",
    "description": "The woman told U.S. Secret Service agents that she had firearms in her vehicle while outside Trump's Palm Beach estate.",
    "link": "https://www.newsweek.com/woman-arrested-mar-lago-urgent-message-trump-2096300",
    "timestamp": "2025-07-08T22:21:45Z"
  },
  {
    "title": "Everyone Who’s Not ‘American’ Enough To Watch the New Superman Movie, According to Woke Celebs",
    "description": "James Gunn, director of the upcoming Superman film, and his actor brother Sean Gunn, who plays the role of Maxwell Lord, are under fire after suggesting that anyone who supports President Donald Trump's immigration policies is \"not American\" enough to appreci…",
    "link": "https://freebeacon.com/satire/everyone-whos-not-american-enough-to-watch-the-new-superman-movie-according-to-woke-celebs/",
    "timestamp": "2025-07-08T22:19:53Z"
  },
  {
    "title": "Report: USAID Quietly Sent Thousands of Viruses to the Infamous Wuhan Lab",
    "description": "The U.S. Agency for International Development (USAID) reportedly shipped thousands of viruses to a Chinese military-linked biolab in Wuhan.\nThe post Report: USAID Quietly Sent Thousands of Viruses to the Infamous Wuhan Lab appeared first on Breitbart.",
    "link": "https://www.breitbart.com/pre-viral/2025/07/08/report-usaid-quietly-sent-thousands-of-viruses-to-the-infamous-wuhan-lab/",
    "timestamp": "2025-07-08T22:19:30Z"
  },
  {
    "title": "Democrat Base Wants ‘Blood,’ Not Abundance",
    "description": "The Democratic Party establishment has been utterly discredited by four years under the Biden administration. While some of their party leaders and strategists have made a short-lived effort... Read More\nThe post Democrat Base Wants ‘Blood,’ Not Abundance app…",
    "link": "https://www.dailysignal.com/2025/07/08/democrat-base-wants-blood-not-abundance/",
    "timestamp": "2025-07-08T22:15:00Z"
  },
  {
    "title": "Pam Bondi is learning the true cost of indulging Epstein conspiracy theorists",
    "description": "Trump officials who fed conspiracy theories about Jeffrey Epstein's death are now feeling the wrath of their own audience.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-doj-epstein-files-memo-maga-conspiracies-rcna217457",
    "timestamp": "2025-07-08T22:12:00Z"
  },
  {
    "title": "What we know about reports Ted Cruz toured Parthenon in Greece the day after deadly Texas floods",
    "description": "Cruz's office said he \"promptly booked\" a flight home after the flooding hit.",
    "link": "https://www.snopes.com//news/2025/07/08/ted-cruz-greece-vacation-texas-floods/",
    "timestamp": "2025-07-08T22:12:00Z"
  },
  {
    "title": "The Bob Cesca Podcast: The Soft Foods Buffet",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: The Soft Foods Buffet -- Donald Trump and Ted Cruz are responsible for the catastrophic flash floods in Texas. Donald's DOJ is obviously covering up the Epstein Client List. Pam Bondi admitted…",
    "link": "https://littlegreenfootballs.com/article/54743_The_Bob_Cesca_Podcast-_The_Sof",
    "timestamp": "2025-07-08T22:11:46Z"
  },
  {
    "title": "U.S. Treasury Secretary Bessent to visit Japan next week for Expo",
    "description": "The visit comes after Donald Trump stated his intention to raise tariffs on all Japanese imports to 25% — slightly higher than the 24% rate initially announced in April.",
    "link": "https://www.japantimes.co.jp/news/2025/07/09/japan/us-treasury-bessent-japan-expo/",
    "timestamp": "2025-07-08T22:11:00Z"
  },
  {
    "title": "U.S. Treasury Secretary Bessent to visit Japan next week for Expo",
    "description": "The visit comes after Donald Trump stated his intention to raise tariffs on all Japanese imports to 25% — slightly higher than the 24% rate initially announced in April.",
    "link": "https://www.japantimes.co.jp/news/2025/07/09/world/politics/us-treasury-bessent-japan-expo/",
    "timestamp": "2025-07-08T22:11:00Z"
  },
  {
    "title": "U.S. Treasury Secretary Bessent to visit Japan next week for Expo",
    "description": "The visit comes after Donald Trump stated his intention to raise tariffs on all Japanese imports to 25% — slightly higher than the 24% rate initially announced in April.",
    "link": "https://www.japantimes.co.jp/business/2025/07/09/us-treasury-bessent-japan-expo/",
    "timestamp": "2025-07-08T22:11:00Z"
  },
  {
    "title": "Trump has a point — the Federal Reserve DOES need fixing: here’s how",
    "description": "President Trump has railed against the Fed's insular approach to setting financial policy — but he can bring some common sense to federal economic management.",
    "link": "https://nypost.com/2025/07/08/opinion/trump-has-a-point-the-federal-reserve-does-need-fixing/",
    "timestamp": "2025-07-08T22:09:30Z"
  },
  {
    "title": "U.S. stocks close mixed amid tariff uncertainty",
    "description": "NEW YORK, July 8 (Xinhua) -- U.S. stocks ended mixed on Tuesday, as investors weighed escalating trade threats from U.S. President Donald Trump against bullish revisions to Wall Street's outlook for the rest of the year. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/09/us-stocks-close-mixed-amid-tariff-uncertainty",
    "timestamp": "2025-07-08T22:09:00Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The S&P 500 ended Tuesday marginally lower after President Donald Trump said that there would be no extensions on his new Aug. 1 tariff deadline.",
    "link": "https://www.cnbc.com/2025/07/08/stock-market-today-live-updates.html",
    "timestamp": "2025-07-08T22:07:36Z"
  },
  {
    "title": "Extraordinary gesture | Watch: Netanyahu presents Trump with a 'B-2 mezuzah'",
    "description": "Before his meeting with Trump, Prime Minister Netanyahu gifted a mezuzah shaped like a B-2 bomber - highly symbolic in light of the recent American strike on Iran’s Fordow nuclear facility.",
    "link": "https://www.israelnationalnews.com/news/411353",
    "timestamp": "2025-07-08T22:07:29Z"
  },
  {
    "title": "Live: ASX to slip, Wall Street on edge as Donald Trump announces further tariffs",
    "description": "The Australian share market is likely to fall slightly in morning trade after yesterday's surprise decision by the Reserve Bank to keep interest rates on hold. Wall Street finished trading flat after Donald Trump gave mixed signals about whether he would allo…",
    "link": "https://www.abc.net.au/news/2025-07-09/asx-markets-business-live-news/105510298",
    "timestamp": "2025-07-08T22:07:20Z"
  },
  {
    "title": "Death toll in U.S. Texas flash floods climbs to 109, over 160 still missing",
    "description": "NEW YORK, July 8 (Xinhua) -- At least 109 people were dead and over 160 are still missing as of Tuesday after devastating flash floods slammed the U.S. Texas Hill Country, with rescue operations still going on along the Guadalupe River. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/09/death-toll-in-us-texas-flash-floods-climbs-to-109-over-160-still-missing",
    "timestamp": "2025-07-08T22:07:00Z"
  },
  {
    "title": "Triple the number of Canadians see US as top threat",
    "description": "As U.S. President Donald Trump pursues his global trade war and talk of annexation, a new poll suggests the percentage of Canadians who view the United States as a top threat has tripled since 2019.",
    "link": "https://www.nationalobserver.com/2025/07/08/news/triple-number-canadians-see-us-top-threat",
    "timestamp": "2025-07-08T22:04:45Z"
  },
  {
    "title": "Experienced Journalist Rebecca Downs Joins The Daily Signal as Ohio Correspondent",
    "description": "The Daily Signal announced today that journalist Rebecca Downs will serve as the outlet’s first-ever Ohio correspondent, bringing her extensive political reporting experience to cover... Read More\nThe post Experienced Journalist Rebecca Downs Joins The Daily …",
    "link": "https://www.dailysignal.com/2025/07/08/experienced-journalist-rebecca-downs-joins-the-daily-signal-as-ohio-correspondent/",
    "timestamp": "2025-07-08T22:01:13Z"
  },
  {
    "title": "Terry Gilliam Says Trump ‘Killed’ His ‘Carnival at the End of Days’ Film: He ‘Destroyed Satire’",
    "description": "Terry Gilliam explained how Trump's second term has 'killed' his 'Carnival at the End of Days' mnovie, leading him to rewrite it.",
    "link": "https://www.indiewire.com/news/general-news/terry-gilliam-trump-killed-carnival-at-the-end-of-days-1235137391/",
    "timestamp": "2025-07-08T22:00:00Z"
  },
  {
    "title": "California Defies Trump Again as State Refuses to Follow Trans Athlete Order",
    "description": "Not satisfied with the disastrous Los Angeles riots, the Golden State of California has picked up the cudgel once more against President Donald Trump and... Read More\nThe post California Defies Trump Again as State Refuses to Follow Trans Athlete Order appear…",
    "link": "https://www.dailysignal.com/2025/07/08/california-defies-trump-state-refuses-follow-trans-athlete-orde/",
    "timestamp": "2025-07-08T22:00:00Z"
  },
  {
    "title": "Commentary: ‘Mr Japan’ is entitled to be furious with Trump’s copy-and-paste tariffs",
    "description": "US President Donald Trump’s brinkmanship might be setting up another TACO trade. The lasting damage to a vital friendship shouldn't be underestimated, says Bloomberg Opinion’s Gearoid Reidy.",
    "link": "https://www.channelnewsasia.com/commentary/trump-tariffs-japan-taco-trade-deal-damage-5226636",
    "timestamp": "2025-07-08T22:00:00Z"
  },
  {
    "title": "Zohran Mamdani—Bastard Son Of 33 Liberty Street",
    "description": "Sure, Zohran Mamdani, surprise winner of the Dem primary for New York City mayor, is an ultra-left-wing wackadoo. But it occurs to us that this veritable assault on sanity— via the election of a 33 year-old nincompoop who wants rent controls, free day care, c…",
    "link": "https://www.activistpost.com/zohran-mamdani-bastard-son-of-33-liberty-street/",
    "timestamp": "2025-07-08T22:00:00Z"
  },
  {
    "title": "VC-Backed Firms Choose Mergers and Buyouts Amid Uncertainty Around IPOs",
    "description": "Companies backed by venture capital (VC) firms are reportedly choosing mergers, acquisitions and buyouts over initial public offerings (IPOs). [contact-form-7] While the overall number of exits remained flat in the second quarter compared to the first, the ma…",
    "link": "http://www.pymnts.com/acquisitions/2025/venture-capital-backed-firms-choose-mergers-buyouts-amid-uncertainty-around-ipos/",
    "timestamp": "2025-07-08T21:59:56Z"
  },
  {
    "title": "More than 160 people are still missing after Texas’ deadly floods, Gov. Abbott says",
    "description": "The lowlands along the Guadalupe River in central Texas are filled with youth camps and campgrounds that are especially popular around summer holidays, which has made it more difficult to know how many people are missing.",
    "link": "https://www.pbs.org/newshour/nation/more-than-160-people-are-still-missing-after-texas-deadly-floods-gov-abbott-says",
    "timestamp": "2025-07-08T21:59:52Z"
  },
  {
    "title": "Netanyahu’s gift to Trump marks a ‘historic horizon’ for Mideast peace",
    "description": "A weakened regime in Iran, thanks to Donald Trump's flexing of American power, is a potential game-changer for the entire Middle East — bringing the prospect of a lasting peace.",
    "link": "https://nypost.com/2025/07/08/opinion/netanyahus-gift-marks-historic-horizon-for-mideast-peace/",
    "timestamp": "2025-07-08T21:59:24Z"
  },
  {
    "title": "Trump seems to really be losing patience with Putin. But why now?",
    "description": "After days of expressing displeasure with his latest phone call with Putin, Trump went even further at a Cabinet meeting.",
    "link": "https://www.cnn.com/2025/07/08/politics/donald-trump-vladimir-putin-frustration-analysis",
    "timestamp": "2025-07-08T21:59:08Z"
  },
  {
    "title": "Enthusiastic Surrender",
    "description": "Sam Stein: “Is Donald Trump a stronger and more skilled politician than he was eight years ago—or are the guardrails that once hindered him just weaker?” “That question has come up often over the last",
    "link": "https://politicalwire.com/2025/07/08/enthusiastic-surrender/",
    "timestamp": "2025-07-08T21:57:05Z"
  },
  {
    "title": "Passport Purist Ted Cruz Was In Greece When Texas Flash Floods Began, Critics Claim He Slashed Funds For Weather Service",
    "description": "Here’s a question: Is there anyone on Beyoncé’s green Earth who is as bad at planning an appropriately timed vacation as Sen. Ted Cruz? One would think that, after getting dragged to hell and back for flying to Cancún, Mexico, with his family in 2021, after i…",
    "link": "https://bossip.com/3451665/ted-cruz-greece-floods/",
    "timestamp": "2025-07-08T21:54:08Z"
  },
  {
    "title": "Elon Musk Takes Feud With Steve Bannon To Dark, Unsubstantiated New Territory",
    "description": "The conflict between the Tesla mogul and the former Trump adviser is getting heated once again.",
    "link": "https://www.huffpost.com/entry/elon-musk-steve-bannon-feud-new-depths_n_686d67a8e4b07e11dd995ddb",
    "timestamp": "2025-07-08T21:48:27Z"
  },
  {
    "title": "WNBA Star Issues 'Threat' To President Trump",
    "description": "A prominent WNBA star has issued what some are deeming a \"warning\" and \"threat\" to President Donald J. Trump and ICE agents in 2025. WNBA star Natasha Cloud ...",
    "link": "https://thespun.com/wnba/wnba-star-issues-threat-to-president-trump",
    "timestamp": "2025-07-08T21:48:25Z"
  },
  {
    "title": "Texas Floods: Misinformation Across Political Spectrum Sows Confusion",
    "description": "Following deadly floods in Texas, misinformation from both left- and right-wing users was roiling social media, with liberals baselessly blaming staffing cuts at US weather agencies for flawed warning systems and conservatives ramping up conspiracy theories.",
    "link": "https://www.ibtimes.com/texas-floods-misinformation-across-political-spectrum-sows-confusion-3777932",
    "timestamp": "2025-07-08T21:48:24Z"
  },
  {
    "title": "Bessent to visit Japan for World Expo in Osaka, possibly next week",
    "description": "U.S. Treasury Secretary Scott Bessent is scheduled to visit Japan, possibly next week, as a member of the U.S. delegation to the World Exposition in Osaka, an official said Tuesday. Without providing further details, the Treasury Department official disclosed…",
    "link": "https://japantoday.com/category/politics/update2-bessent-to-visit-japan-for-world-expo-in-osaka-possibly-next-week",
    "timestamp": "2025-07-08T21:47:41Z"
  },
  {
    "title": "From 'fantastic' to 'spoiled': How Japan's trade effort to woo Trump backfired",
    "description": "When Japanese Premier Shigeru Ishiba first met Donald Trump in February, his plan to placate the protectionist president's long-held frustration with Tokyo on trade was a promise to invest $1 trillion in the United States. It appeared to work. The pledge was …",
    "link": "https://japantoday.com/category/politics/from-%27fantastic%27-to-%27spoiled%27-how-japan%27s-trade-effort-to-woo-trump-backfired",
    "timestamp": "2025-07-08T21:47:30Z"
  },
  {
    "title": "Trump says South Korea should be paying for its own defense",
    "description": "U.S. President Donald Trump said on Tuesday South Korea should be paying for its own military protection and suggested the U.S. ally needed to pay more for the U.S. troop presence there, a day after saying he planned to impose a 25 percent tariff on its impor…",
    "link": "https://japantoday.com/category/world/trump-says-south-korea-should-be-paying-for-its-own-defense",
    "timestamp": "2025-07-08T21:46:36Z"
  },
  {
    "title": "Senate Judiciary eyes next week for votes on two contentious judicial nominees",
    "description": "The Senate Judiciary Committee is set to vote July 17 on the nominations for Emil Bove — President Donald Trump’s controversial judicial nominee for the Third Circuit — and Jeanine Pirro — the former Fox News host who Trump tapped to be U.S. attorney for D.C.…",
    "link": "https://biztoc.com/x/8e9f5dcb95828166",
    "timestamp": "2025-07-08T21:46:31Z"
  },
  {
    "title": "Impostor uses AI to impersonate Rubio and contact foreign and US officials",
    "description": "The State Department is warning U.S. diplomats of attempts to impersonate Secretary of State Marco Rubio and possibly other officials using technology driven by artificial intelligence, according to two senior officials and a cable sent last week to all embas…",
    "link": "https://japantoday.com/category/world/impostor-uses-ai-to-impersonate-rubio-and-contact-foreign-and-us-officials",
    "timestamp": "2025-07-08T21:46:30Z"
  },
  {
    "title": "Pomp, pageantry and politesse greet French President Macron in display of British royals' soft power",
    "description": "The French Tricolor and Britain’s Union flag hang from the standards near Windsor Castle. The carriages are primed, the tiaras polished. French President Emmanuel Macron and his wife, Brigitte, arrived in Britain on Tuesday at the start of a state visit as th…",
    "link": "https://japantoday.com/category/world/pomp-pageantry-and-politesse-greet-french-pm-macron-in-display-of-british-royals%27-soft-power",
    "timestamp": "2025-07-08T21:46:24Z"
  },
  {
    "title": "Supreme Court clears way for Trump's plans to downsize the federal workforce",
    "description": "The Supreme Court on Tuesday cleared the way for President Donald Trump’s plans to downsize the federal workforce despite warnings that critical government services will be lost and hundreds of thousands of federal employees will be out of their jobs. The jus…",
    "link": "https://japantoday.com/category/world/supreme-court-clears-the-way-for-trump%27s-plans-to-downsize-the-federal-workforce1",
    "timestamp": "2025-07-08T21:46:06Z"
  },
  {
    "title": "Texas governor says more than 160 people still missing after deadly floods",
    "description": "More than 160 people are believed to be missing in Texas in the aftermath of the flash floods that killed more than 100 over the July Fourth weekend, Gov Greg Abbott said Tuesday. Abbot said many of those who are not accounted for were staying in state’s Hill…",
    "link": "https://japantoday.com/category/world/hope-of-finding-texas-flood-survivors-dims-as-search-efforts-go-on",
    "timestamp": "2025-07-08T21:45:49Z"
  },
  {
    "title": "U.S. Justice Department scrambles to defend its about-face on release of Epstein files",
    "description": "President Donald Trump's Justice Department scrambled on Tuesday to answer questions after its leadership concluded there was no evidence to support a number of long-held conspiracy theories about the death of accused sex trafficker Jeffrey Epstein and his al…",
    "link": "https://japantoday.com/category/world/us-justice-department-scrambles-to-defend-its-about-face-on-release-of-epstein-files1",
    "timestamp": "2025-07-08T21:45:38Z"
  }
]