[
  {
    "title": "Trump vetoed Israel’s plan to kill Iran’s supreme leader Khamenei",
    "description": "WASHINGTON, June 16: President Donald Trump rejected a plan presented by Israel to the U.S. to kill Iran’s Supreme Leader […]\nThe post Trump vetoed Israel’s plan to kill Iran’s supreme leader Khamenei appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/16/trump-vetoed-israels-plan-to-kill-irans-supreme-leader-khamenei/",
    "timestamp": "2025-06-16T02:51:17Z"
  },
  {
    "title": "Oil Prices Rise Further As Israel-Iran Extends Into Fourth Day",
    "description": "Oil prices extended gains Monday as Israel and Iran pounded each other with missiles for a fourth day and threatened further attacks, stoking fears of a lengthy conflict that could reignite inflation.",
    "link": "https://www.ibtimes.com.au/oil-prices-rise-further-israel-iran-extends-fourth-day-1859212",
    "timestamp": "2025-06-16T02:45:35Z"
  },
  {
    "title": "Oil Prices Rise Further As Israel-Iran Extends Into Fourth Day",
    "description": "Oil prices extended gains Monday as Israel and Iran pounded each other with missiles for a fourth day and threatened further attacks, stoking fears of a lengthy conflict that could reignite inflation.",
    "link": "https://www.ibtimes.com/oil-prices-rise-further-israel-iran-extends-fourth-day-3775765",
    "timestamp": "2025-06-16T02:45:17Z"
  },
  {
    "title": "Oil prices rise further as Israel-Iran extends into fourth day",
    "description": "Oil prices extended gains Monday as Israel and Iran pounded each other with missiles for a fourth day and threatened further attacks, stoking fears of a lengthy conflict that could reignite inflation. Gold prices also rose back towards a record high thanks to…",
    "link": "https://www.digitaljournal.com/world/oil-prices-rise-further-as-israel-iran-extends-into-fourth-day/article",
    "timestamp": "2025-06-16T02:42:34Z"
  },
  {
    "title": "Seabed mining is becoming an environmental flashpoint – NZ will have to pick a side soon",
    "description": "Whether the government approves two seabed mining applications or chooses a precautionary approach, the stakes are high and other Pacific nations will be watching.",
    "link": "https://theconversation.com/seabed-mining-is-becoming-an-environmental-flashpoint-nz-will-have-to-pick-a-side-soon-258908",
    "timestamp": "2025-06-16T02:39:36Z"
  },
  {
    "title": "Spies, secret facilities and political footballs: A history of the Iran nuclear deal",
    "description": "The tensions between Israel and Iran became more open and aggressive almost as soon as Donald Trump withdrew from the nuclear pact.\nThe post Spies, secret facilities and political footballs: A history of the Iran nuclear deal appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/16/iran-nuclear-deal-history-us-israel/",
    "timestamp": "2025-06-16T02:39:05Z"
  },
  {
    "title": "Calgary erupts as protesters flood streets of Calgary with fury over Kashmir, Gaza, climate, and Trump while G7 leaders meet in mountain resort",
    "description": "As G7 leaders convened in Kananaskis, Calgary became a hub for diverse protests, with over 400 demonstrators advocating for global issues like Kashmiri self-determination, Ethiopian peace, climate action, and Indigenous rights. The marches disrupted downtown …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/calgary-erupts-as-protesters-flood-streets-of-calgary-with-fury-over-kashmir-gaza-climate-and-trump-while-g7-leaders-meet-in-mountain-resort/articleshow/121871920.cms",
    "timestamp": "2025-06-16T02:37:43Z"
  },
  {
    "title": "Oil stocks in focus as escalating Israel-Iran conflict fuels supply disruption fears",
    "description": "Oil companies' share prices are expected to be in focus as crude prices surged amid escalating tensions between Israel and Iran. Fears of supply disruption through the Strait of Hormuz have intensified, with Brent and WTI crude gaining sharply. Analysts warn …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-stocks-in-focus-as-escalating-israel-iran-conflict-fuels-supply-disruption-fears/articleshow/121871957.cms",
    "timestamp": "2025-06-16T02:37:40Z"
  },
  {
    "title": "Vance Boelter, Suspect In Minnesota Shootings, Captured",
    "description": "Boelter is wanted for killing State Rep. Melissa Hortman and her husband, as well as wounding State Sen. John Hoffman and his wife.",
    "link": "https://www.huffpost.com/entry/vance-boelter-caught_n_684e1b28e4b0028eac532d45",
    "timestamp": "2025-06-16T02:37:19Z"
  },
  {
    "title": "‘By Notice of This TRUTH!’ Trump Decrees ICE Mass Deportation ‘FOCUS’ on ‘Deadly Inner Cities’ and Dem ‘Power Center’",
    "description": "Trump made a chaotic declaration on Truth Social, raging against Democrats, Transgender sports participation, and more, tying it all to \"Mass Destruction Migration.\"\nThe post ‘By Notice of This TRUTH!’ Trump Decrees ICE Mass Deportation ‘FOCUS’ on ‘Deadly Inn…",
    "link": "https://www.mediaite.com/politics/trump/by-notice-of-this-truth-trump-decrees-ice-mass-deportation-focus-on-deadly-inner-cities-and-dem-power-center/",
    "timestamp": "2025-06-16T02:37:04Z"
  },
  {
    "title": "Watch These Tesla Stock Price Levels as Investors Look Past Musk-Trump Feud",
    "description": "Tesla shares have recovered the lion’s share of losses that followed Elon Musk's public feud with President Donald Trump, as investors await the automaker's ...",
    "link": "https://www.investopedia.com/watch-these-tesla-stock-price-levels-as-investors-look-past-musk-trump-feud-11755048",
    "timestamp": "2025-06-16T02:31:11Z"
  },
  {
    "title": "Polls show support for Ishiba recovering ahead of election",
    "description": "A survey conducted over the weekend by Kyodo News showed the approval rating for Ishiba’s Cabinet at 37.0%.",
    "link": "https://www.japantimes.co.jp/news/2025/06/16/japan/japan-pm-ishiba-support-up/",
    "timestamp": "2025-06-16T02:31:00Z"
  },
  {
    "title": "Mark Levin Calls for Regime Change in Iran as MAGA Israel Fissure Grows",
    "description": "Fox News host Mark Levin calls for regime change as Israel strikes Iran, exposing deep foreign policy divide within Trump's MAGA circle.",
    "link": "https://www.newsweek.com/fox-news-host-mark-levin-calls-regime-change-iran-maga-fissure-grows-2085845",
    "timestamp": "2025-06-16T02:28:45Z"
  },
  {
    "title": "Trump nixed Israeli plan to kill Iran's supreme leader, US official says",
    "description": "President Trump rejected an Israeli plan in recent days to kill Iran's Supreme Leader Ayatollah Ali Khamenei, a senior U.S. official told USA TODAY.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/15/donald-trump-iran-ayatollah-ali-khamenei-israel/84222908007/",
    "timestamp": "2025-06-16T02:22:19Z"
  },
  {
    "title": "'Voices in his head': Outrage as Trump 'basically declares war on blue cities'",
    "description": "Donald Trump on Sunday announced a sweeping new immigration enforcement effort aimed at large cities run by Democrats, resulting in outrage online.Trump over the weekend disclosed his plans to send immigration officials into blue states.\"These Radical Left De…",
    "link": "https://www.rawstory.com/trump-voices-war-cities-reax/",
    "timestamp": "2025-06-16T02:21:12Z"
  },
  {
    "title": "G7 leaders prepare for delicate dance with Trump at summit in Canada",
    "description": "Prime Minister Shigeru Ishiba is seeking a trade deal with Trump on the sidelines of the summit, which would be a coup ahead of elections next month.",
    "link": "https://www.japantimes.co.jp/news/2025/06/16/world/politics/donald-trump-g7-guide/",
    "timestamp": "2025-06-16T02:21:00Z"
  },
  {
    "title": "Starmer Confident Aukus Pact Will Proceed Despite Trump Review",
    "description": "By Ellen Milligan Jun 15, 2025 (Bloomberg) –UK Prime Minister Keir Starmer said he has no doubts that the Aukus defense pact with the US and Australia will continue despite President...",
    "link": "https://gcaptain.com/starmer-confident-aukus-pact-will-proceed-despite-trump-review/",
    "timestamp": "2025-06-16T02:20:32Z"
  },
  {
    "title": "Mysterious Shipping Container Rocket Launcher Spotted At Trump’s Visit To Fort Bragg",
    "description": "containerized launcher designed to fire the same suite of artillery rockets and ballistic missiles as the M270 Multiple Launch Rocket System (MLRS) and M142 High Mobility Artillery Rocket System (HIMARS) has appeared at the U.S. Army’s Fort Bragg in North Car…",
    "link": "https://freerepublic.com/focus/f-news/4323295/posts",
    "timestamp": "2025-06-16T02:17:24Z"
  },
  {
    "title": "Oil firm as intensifying Israel-Iran conflict stokes supply disruption fears",
    "description": "Oil prices surged on Monday following renewed strikes between Israel and Iran, escalating fears of a wider regional conflict that could disrupt Middle East oil exports. Brent crude and U.S. West Texas Intermediate both rose by 1.5%, building on Friday's gains.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-firm-as-intensifying-israel-iran-conflict-stokes-supply-disruption-fears/articleshow/121871705.cms",
    "timestamp": "2025-06-16T02:10:45Z"
  },
  {
    "title": "Trump's investment claims - are tariffs boosting the US economy?",
    "description": "The reality behind Trump's incredible investment claims\nUS President Donald Trump may have called tariffs his favourite word in the dictionary. But when it comes to obsessions, business investment has got to be close.\nAs of last month, he said more than $12 t…",
    "link": "https://biztoc.com/x/ec5796d0eff98f9c",
    "timestamp": "2025-06-16T02:07:55Z"
  },
  {
    "title": "Michael Flynn Defends Israeli Military Campaign Against ‘Psychotic’ Iranian Regime: ‘I'm Anti-Stupid War,' 'Not Anti-War’",
    "description": "“War is never a good thing, but sometimes it is a necessary thing,” declared Lt. Gen. Michael Flynn, who described himself as “anti-stupid war,\" \"not anti-war” as he issued a strong defense of Israel’s military campaign against Iran’s “psychotic” and “corrupt…",
    "link": "https://www.breitbart.com/politics/2025/06/15/michael-flynn-defends-israeli-military-campaign-against-psychotic-iranian-regime/",
    "timestamp": "2025-06-16T02:07:26Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities, undeterred by protests",
    "description": "Donald Trump has directed federal immigration officials to prioritize deportations from Democratic-run cities after protests erupted in Los Angeles.",
    "link": "https://www.nbclosangeles.com/news/local/trump-ice-deportations-democratic-cities/3724903/",
    "timestamp": "2025-06-16T02:07:26Z"
  },
  {
    "title": "Gold glimmers near two-month high as Middle East conflict escalates",
    "description": "Gold prices increased, reaching a two-month high. Investors looked for safe investments due to the conflict between Israel and Iran. Fresh attacks occurred, raising concerns about a larger regional war. The US Federal Reserve will meet soon, and markets antic…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-glimmers-near-two-month-high-as-middle-east-conflict-escalates/articleshow/121871644.cms",
    "timestamp": "2025-06-16T02:06:33Z"
  },
  {
    "title": "Trump orders deportation drive targeting Democratic cities",
    "description": "US President Donald Trump on Sunday directed federal authorities to ramp up deportation efforts in Democratic-led cities, doubling down on a politicized anti-immigration drive after major protests in Los Angeles. “We must expand efforts to detain and deport I…",
    "link": "https://www.digitaljournal.com/world/trump-orders-deportation-drive-targeting-democratic-cities/article",
    "timestamp": "2025-06-16T02:02:20Z"
  },
  {
    "title": "Trump Says ICE Ordered to Expand Deportations in Largest Cities Including New York and Chicago",
    "description": "President Donald Trump directed federal officials to expand efforts to deport migrants in the largest US cities in the face of protests and court challenges, even as his administration is looking to ease the impact of the crackdown on key sectors of the US wo…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-ice-ordered-to-expand-deportations-in-largest-cities-including-new-york-and-chicago",
    "timestamp": "2025-06-16T02:02:01Z"
  },
  {
    "title": "Trump Orders Deportation Drive Targeting Democratic Cities",
    "description": "US President Donald Trump on Sunday directed federal authorities to ramp up deportation efforts in Democratic-led cities, doubling down on a politicized anti-immigration drive after major protests in Los Angeles.",
    "link": "https://www.ibtimes.com/trump-orders-deportation-drive-targeting-democratic-cities-3775761",
    "timestamp": "2025-06-16T02:00:27Z"
  },
  {
    "title": "Singer Olivia Rodrigo 'deeply upset' at 'violent deportations' happening in Los Angeles",
    "description": "Pop singer Olivia Rodrigo spoke out in favor of the anti-ICE protests throughout Los Angeles in an Instagram Stories post that condemned immigration raids.",
    "link": "https://www.foxnews.com/media/singer-olivia-rodrigo-deeply-upset-violent-deportations-happening-los-angeles",
    "timestamp": "2025-06-16T02:00:11Z"
  },
  {
    "title": "European leaders clamor to be the G7’s Trump whisperer",
    "description": "The British prime minister's love-bombing of President Donald Trump is very deliberate. But will it work?",
    "link": "https://www.politico.eu/article/europe-g7-canada-kier-starmer-tariffs-middle-east/",
    "timestamp": "2025-06-16T02:00:00Z"
  },
  {
    "title": "Trump’s political offensive on European allies will have long-lasting consequences",
    "description": "While keeping the U.S. president onside will be important, erstwhile allies would do well to coordinate their response to Washington’s wholesale assault on its partners.",
    "link": "https://www.politico.eu/article/donald-trump-europe-allies-canada-netherlands-america/",
    "timestamp": "2025-06-16T02:00:00Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities",
    "description": "On social media, President Donald Trump said officials \"must expand efforts to detain and deport Illegal Aliens in America’s largest Cities, such as Los Angeles, Chicago, and New York, where Millions upon Millions of Illegal Aliens reside.”",
    "link": "https://www.wcvb.com/article/trump-directs-ice-to-expand-deportations/65070152",
    "timestamp": "2025-06-16T01:55:35Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities",
    "description": "On social media, President Donald Trump said officials \"must expand efforts to detain and deport Illegal Aliens in America’s largest Cities, such as Los Angeles, Chicago, and New York, where Millions upon Millions of Illegal Aliens reside.”",
    "link": "https://www.kcra.com/article/trump-directs-ice-to-expand-deportations/65070152",
    "timestamp": "2025-06-16T01:55:35Z"
  },
  {
    "title": "Iran wants to kill US President Trump: Israeli PM Netanyahu",
    "description": "Benjamin Netanyahu claimed Iran wanted to assassinate Donald Trump. He called himself Trump's \"junior partner\" against Iran's nuclear ambitions. Netanyahu stated Israel faced an imminent threat and acted aggressively. Iran retaliated with missile attacks. Net…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/iran-wants-to-kill-us-president-trump-israeli-pm-netanyahu/articleshow/121871531.cms",
    "timestamp": "2025-06-16T01:54:25Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities",
    "description": "On social media, President Donald Trump said officials \"must expand efforts to detain and deport Illegal Aliens in America’s largest Cities, such as Los Angeles, Chicago, and New York, where Millions upon Millions of Illegal Aliens reside.”",
    "link": "https://www.wmur.com/article/trump-directs-ice-to-expand-deportations/65070152",
    "timestamp": "2025-06-16T01:53:58Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities",
    "description": "Donald Trump took to Truth Social to call on ICE officials to expand efforts to \"detain Illegal Aliens\" in cities at the \"core of Democrat Power Center.\" It comes after deportations in Los Angeles sparked protests. US President Donald Trump on Sunday directed…",
    "link": "https://www.dw.com/en/trump-directs-ice-to-expand-deportations-in-democratic-run-cities/a-72919973",
    "timestamp": "2025-06-16T01:50:00Z"
  },
  {
    "title": "Trump Directs ICE To Expand Deportations In Democratic-Run Cities",
    "description": "Trump called on ICE officials “to do all in their power to achieve the very important goal of delivering the single largest Mass Deportation Program in History.”",
    "link": "https://www.huffpost.com/entry/trump-deportations-ice_n_684f7583e4b07f75743a4802",
    "timestamp": "2025-06-16T01:47:13Z"
  },
  {
    "title": "'Never get credit for anything': US President Donald Trump on his peace efforts on Iran-Israel war",
    "description": "US President Donald Trump predicted on Sunday (local time) that he would soon broker peace between Israel and Iran, citing unspecified \"calls and meetings\" as evidence of progress, adding that his intervention had led to peace between several conflict-ridden …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/never-get-credit-for-anything-us-president-on-his-peace-efforts-on-iran-israel-war/articleshow/121871470.cms",
    "timestamp": "2025-06-16T01:45:07Z"
  },
  {
    "title": "TRUMP 'VETOED PLAN TO KILL IRAN'S SUPREME LEADER'",
    "description": "Donald Trump vetoed an Israeli plan to kill Iran’s supreme leader, according to American officials. Details of the plan to kill Ayatollah Ali Khamenei emerged on Sunday night after Mr Trump warned Iran not to target American interests and car bombs rocked Teh…",
    "link": "https://freerepublic.com/focus/f-chat/4323288/posts",
    "timestamp": "2025-06-16T01:45:02Z"
  },
  {
    "title": "We Asked Army 250th Anniversary Parade Attendees Whether Trump Is a ‘King.’ Here’s What They Said.",
    "description": "We traveled to the U.S. Army’s 250th birthday celebration in Washington, D.C., to ask attendees what the parade meant to them, does President Donald Trump... Read More\nThe post We Asked Army 250th Anniversary Parade Attendees Whether Trump Is a ‘King.’ Here’s…",
    "link": "https://www.dailysignal.com/2025/06/15/we-asked-army-parade-attendees-whether-trump-is-a-king/",
    "timestamp": "2025-06-16T01:44:18Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities",
    "description": "President Donald Trump has directed federal immigration officials to prioritize deportations from Democratic-run cities after large protests have erupted in Los Angeles and other major cities against the Trump administration’s immigration policies",
    "link": "https://www.post-gazette.com/news/politics-nation/2025/06/15/trump-ice-deportation-democratic-cities/stories/202506150131",
    "timestamp": "2025-06-16T01:38:24Z"
  },
  {
    "title": "Polls Show Support for Japan’s Ishiba Recovering Before Election",
    "description": "Public support for Japan’s prime minister is holding up after the government moved to address high rice prices, according to new opinion polls, a positive sign for Shigeru Ishiba as he heads into an election and tries to reach a trade agreement with the US.",
    "link": "https://financialpost.com/pmn/business-pmn/polls-show-support-for-japans-ishiba-recovering-before-election",
    "timestamp": "2025-06-16T01:36:35Z"
  },
  {
    "title": "'This position is NOT antisemitic': Marjorie Taylor Greene blasts MAGA 'fakes'",
    "description": "U.S. Representative Marjorie Taylor Greene (R-GA) on Sunday insisted a position she is taking is \"NOT antisemitic.\"Greene, who has been accused of antisemitism related to her prior comments, took to X over the weekend to declare that some people are showing t…",
    "link": "https://www.rawstory.com/mtg-not-antisemitic-fakes/",
    "timestamp": "2025-06-16T01:34:58Z"
  },
  {
    "title": "Trump says must expand efforts to deport people illegally in US",
    "description": "(Reuters) -President Donald Trump on Sunday said efforts to deport people who are illegally in the United States must be expanded, including from cities such as Los Angeles, Chicago and New York, which have seen protests since immigration raids were ramped up…",
    "link": "https://www.thestar.com.my/news/world/2025/06/16/trump-says-must-expand-efforts-to-deport-people-illegally-in-us",
    "timestamp": "2025-06-16T01:34:00Z"
  },
  {
    "title": "Weekly news roundup: Intel, Samsung, TSMC shift chip strategy, DDR4 surges, China rises in AI and CIS",
    "description": "Below are the most-read DIGITIMES Asia stories from June 9 to June 15, 2025. Highlights include major chipmaking advances, a DDR4 supply crunch, and shifting strategies from Intel, Samsung Electronics, and TSMC. From renewed EDA access in China to rising mome…",
    "link": "https://www.digitimes.com/news/a20250615VL200/weekly-news-roundup-intel-samsung-ddr4-cis-2025.html",
    "timestamp": "2025-06-16T01:30:04Z"
  },
  {
    "title": "Letters: Humanity is doomed if demilitarisation does not occur soon – on all sides",
    "description": "French president Emmanuel Macron claims to be pushing for a two-state solution between Israel and Palestine. He promises to recognise the Palestinian state but insists the Palestinian state must be a demilitarised one.",
    "link": "https://www.independent.ie/opinion/letters/letters-humanity-is-doomed-if-demilitarisation-does-not-occur-soon-on-all-sides/a734923710.html",
    "timestamp": "2025-06-16T01:30:00Z"
  },
  {
    "title": "G7 leaders meet in Canada hoping to avoid clash with Donald Trump",
    "description": "Group of Seven leaders gathered in the Canadian Rockies yesterday amid growing splits with the United States over foreign policy and trade, with host Canada striving to avoid clashes with president Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/g7-leaders-meet-in-canada-hoping-to-avoid-clash-with-donald-trump/a544298363.html",
    "timestamp": "2025-06-16T01:30:00Z"
  },
  {
    "title": "Trump holds his birthday military parade amid huge 'No Kings’ protests across the US",
    "description": "The grand military parade that US president Donald Trump wanted for years barrelled down Constitution Avenue in Washington on Saturday with tanks, troops and a 21-gun salute, playing out against nationwide protests by those who decried him as a dictator and w…",
    "link": "https://www.independent.ie/world-news/north-america/trump-holds-his-birthday-military-parade-amid-huge-no-kings-protests-across-the-us/a888745855.html",
    "timestamp": "2025-06-16T01:30:00Z"
  },
  {
    "title": "Macron offers aid for Greenland security amid Trump threats",
    "description": "The French president described a U.S. annexation as a \"crazy” scenario and called for joint exercises in the Arctic region.",
    "link": "https://www.japantimes.co.jp/news/2025/06/16/world/politics/macron-aid-greenland-security/",
    "timestamp": "2025-06-16T01:30:00Z"
  },
  {
    "title": "Report: Khamenei and family hiding in bunker amid Israeli strikes",
    "description": "Iran's Supreme Leader Ali Khamenei reportedly seeks refuge in a Tehran bunker as Israel launched strikes. Following a Mashhad strike, sources indicate Israel spared Khamenei to give him a \"final chance\" to dismantle Iran's uranium enrichment program.",
    "link": "https://www.israelnationalnews.com/news/410070",
    "timestamp": "2025-06-16T01:27:08Z"
  },
  {
    "title": "Khamenei’s Bunker: The final act of a dying regime",
    "description": "As missiles close in, the Supreme Leader hides underground with his close aides, security and family. But this game if “survival” won’t save the Islamic Republic—only delay its collapse. Two well-placed sources inside Iran told Iran International that shortly…",
    "link": "https://freerepublic.com/focus/f-news/4323283/posts",
    "timestamp": "2025-06-16T01:26:05Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities, undeterred by protests",
    "description": "Trump's declaration comes after weeks of increased enforcement.",
    "link": "https://www.bostonherald.com/2025/06/15/trump-deportations-ice/",
    "timestamp": "2025-06-16T01:25:35Z"
  },
  {
    "title": "Carney to meet Trump in Alberta as G7 summit begins with trade, tariffs, and security talks on the table",
    "description": "Canadian Prime Minister Mark Carney is set to host the G7 Leaders’ Summit. He will first meet US President Donald Trump. Trade tensions and global conflicts are key issues. Leaders from India, South Korea, Brazil, and South Africa are invited. Discussions wil…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carney-to-meet-trump-in-alberta-as-g7-summit-begins-with-trade-tariffs-and-security-talks-on-the-table/articleshow/121871338.cms",
    "timestamp": "2025-06-16T01:23:56Z"
  },
  {
    "title": "Flashback: This Governor Called in the National Guard to Deal With Illegal Aliens",
    "description": "Over the past week, left-wing activists have lost it over the fact that President Donald Trump called in the Marines and the National Guard to disperse the violent anti-ICE riots in Los Angeles. As White House Press Secretary Karoline Leavitt noted, over 300 …",
    "link": "https://freerepublic.com/focus/f-news/4323282/posts",
    "timestamp": "2025-06-16T01:22:22Z"
  },
  {
    "title": "Trump directs ICE to expand deportations in Democratic-run cities, undeterred by protests",
    "description": "President Trump has instructed federal immigration authorities to prioritize deportations from Democratic-led cities following widespread protests against his administration's immigration policies. He aims to launch the largest mass deportation program in his…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-directs-ice-to-expand-deportations-in-democratic-run-cities-undeterred-by-protests/articleshow/121871358.cms",
    "timestamp": "2025-06-16T01:22:06Z"
  },
  {
    "title": "'Strategic Decapitation': Israel Expands Operations, Targeting Iranian Political Institutions as Netanyahu Taunts 'Weak' Regime in Tehran",
    "description": "Israel pummeled hundreds of targets across Iran on Sunday, hitting Tehran’s military leadership, government buildings, and weapons depots—significantly intensifying operations meant to cripple the Islamic Republic’s nuclear infrastructure and destroy its hard…",
    "link": "https://freebeacon.com/israel/strategic-decapitation-israel-expands-operations-targeting-iranian-political-institutions-as-netanyahu-taunts-weak-regime-in-tehran/",
    "timestamp": "2025-06-16T01:15:56Z"
  },
  {
    "title": "The regime change the West needs is the end of Netanyahu",
    "description": "Benjamin Netanyahu's unprovoked attack on Iran is another in the long list of examples of how the right is now the biggest threat to global stability and security.\nThe post The regime change the West needs is the end of Netanyahu appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/16/israel-attack-iran-us-west-hypocrisy/",
    "timestamp": "2025-06-16T01:14:43Z"
  },
  {
    "title": "Anti-Trump protests overshadow Trump’s parade",
    "description": "Saturday saw massive protests all over the country against Trump. There were an estimated 50,000 people in New York and also in San Francisco. This article gives an overview. The protests, dubbed “No Kings”, took place at about 2,100 sites nationwide, from bi…",
    "link": "https://freethoughtblogs.com/singham/2025/06/15/anti-trump-protests-overshadow-trumps-parade/",
    "timestamp": "2025-06-16T01:13:01Z"
  },
  {
    "title": "Trump returns to G7 he once loathed as Iran crisis intensifies",
    "description": "President Donald Trump arrives in Canada as the center of attention for a Group of Seven summit of world leaders whose main purpose will be to mollify him.",
    "link": "https://www.japantimes.co.jp/news/2025/06/16/world/politics/trump-g7-iran-crisis/",
    "timestamp": "2025-06-16T01:12:00Z"
  },
  {
    "title": "Protests Are Surging During Trump's Second Term",
    "description": "The 'No Kings' demonstrations this weekend—which were attended by as many as six million people—are some of the most prominent examples.",
    "link": "https://www.huffpost.com/entry/no-kings-protests-trump-surge_n_684f5866e4b03c462a051dd9",
    "timestamp": "2025-06-16T01:12:00Z"
  },
  {
    "title": "Netanyahu Receives Hero's Welcome at Site of Impact: 'Bibi, King of Israel'",
    "description": "Israeli Prime Minister Benjamin Netanyahu received a hero's welcome from locals as he visited the site of a deadly Iranian missile strike in the city of Bat Yam, south of Tel Aviv, on Sunday.\nThe post Netanyahu Receives Hero’s Welcome at Site of Impact: ‘Bibi…",
    "link": "https://www.breitbart.com/middle-east/2025/06/15/netanyahu-receives-heros-welcome-at-site-of-impact-bibi-king-of-israel/",
    "timestamp": "2025-06-16T01:10:22Z"
  },
  {
    "title": "Ishiba arrives in Canada for G7, with Trump trade deal on his mind",
    "description": "The Japanese leader hopes to persuade U.S. President Donald Trump to drop trade tariffs that have imperiled his country's economy.",
    "link": "https://www.japantimes.co.jp/news/2025/06/16/japan/politics/ishiba-g7-arrival/",
    "timestamp": "2025-06-16T01:09:00Z"
  },
  {
    "title": "Survivor of Minnesota assassination says she and husband shot 17 times",
    "description": "Yvette Hoffman says she was shot eight times and her husband nine. The gunman is still at large.",
    "link": "https://www.bbc.com/news/articles/c7717mk1gk6o",
    "timestamp": "2025-06-16T01:08:33Z"
  },
  {
    "title": "Minnesota assassination survivor and husband shot 17 times",
    "description": "Yvette Hoffman says she was shot eight times and her husband nine. The gunman is still at large.",
    "link": "https://www.bbc.co.uk/news/articles/c7717mk1gk6o",
    "timestamp": "2025-06-16T01:08:33Z"
  },
  {
    "title": "Asian stocks climb, oil jumps on Israel-Iran conflict",
    "description": "Asian stock markets rebounded slightly after Friday's losses, driven by escalating conflict between Israel and Iran that caused oil prices to surge. Investors are concerned about potential oil supply disruptions and the impact on global inflation, especially …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-climb-oil-jumps-on-israel-iran-conflict/articleshow/121871301.cms",
    "timestamp": "2025-06-16T01:08:12Z"
  },
  {
    "title": "Tim Wilson’s LinkedIn reveals him as the Liberals’ spiritual leader in waiting",
    "description": "The Coalition could foreseeably head in a more Wilsonian direction, given he's one of the increasingly few articulate, energised, young shadow ministers. His LinkedIn has clues on what this direction may look like.\nThe post Tim Wilson’s LinkedIn reveals him a…",
    "link": "http://www.crikey.com.au/2025/06/16/tim-wilson-linkedin-ipa-liberals-coalition-goldstein-superannuation-tax/",
    "timestamp": "2025-06-16T01:00:52Z"
  },
  {
    "title": "Trump’s EPA Ending Obama-Biden War on the American Energy Industry",
    "description": "EPA Administrator Lee Zelding proposing end to Obama-Biden “Clean Power Plan” and reverting back to more reasonable mercury levels set in 2012, which were amended in 2024.",
    "link": "https://wattsupwiththat.com/2025/06/15/trumps-epa-ending-obama-biden-war-on-the-american-energy-industry/",
    "timestamp": "2025-06-16T01:00:00Z"
  },
  {
    "title": "Growth and quality funds will make a comeback: Aditya Birla Sun Life AMC Head of Equity Harish Krishnan",
    "description": "Aditya Birla Sun Life AMC is reshaping its equity strategies by focussing on process consistency, leveraging quant tools for disciplined investing, Harish Krishnan, Co-CIO and Head of Equity, tells Sanket Dhanorkar in an interview.",
    "link": "https://economictimes.indiatimes.com/wealth/invest/growth-and-quality-funds-will-make-a-comeback-aditya-birla-sun-life-amc-head-of-equity-harish-krishnan/articleshow/121843385.cms",
    "timestamp": "2025-06-16T01:00:00Z"
  },
  {
    "title": "Iran, Israel escalate strikes amid rising death toll",
    "description": "Israel has struck Iranian surface-to-surface missile sites as Iran says 224 people killed in conflict. DW has more. Israel strikes surface-to-surface missile sites in Iran\nPresident Trump says he hopes Israel and Iran can strike a deal\nUS embassy in Iraq warn…",
    "link": "https://www.dw.com/en/iran-israel-escalate-strikes-amid-rising-death-toll/live-72919550",
    "timestamp": "2025-06-16T00:58:00Z"
  },
  {
    "title": "Pakistan calls for Muslim states to unite against Israel",
    "description": "Pakistan has called for all Muslim countries to form a coalition against Israel Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619404-pakistan-calls-muslim-fightback-israel/",
    "timestamp": "2025-06-16T00:54:20Z"
  },
  {
    "title": "Heart’s Nancy Wilson Says “Barracuda” Was Played Without Permission at Trump’s Military Parade",
    "description": "\"'Barracuda' is a powerful piece of music that was never intended for political use,\" wrote Wilson in a statement.\nHeart’s Nancy Wilson Says “Barracuda” Was Played Without Permission at Trump’s Military Parade\nJaeden Pinder",
    "link": "https://consequence.net/2025/06/heart-trump-military-parade-barracuda/",
    "timestamp": "2025-06-16T00:48:48Z"
  },
  {
    "title": "Jewish grocer in Brookline vandalized with 'Free Palestine' brick",
    "description": "The Brookline store had a brick that said \"Free Palestine\" was thrown through a window with a map showing Palestine as part of Israel.",
    "link": "https://www.boston.com/news/local-news/2025/06/15/jewish-grocery-store-in-brookline-vandalized-with-free-palestine-brick/",
    "timestamp": "2025-06-16T00:48:30Z"
  },
  {
    "title": "Trump vetoed Israeli plan to kill Iran's supreme leader Ayatollah Ali Khamenei, US official tells AP",
    "description": "Donald Trump declined Israel's plan to assassinate Iran's Supreme Leader Ayatollah Ali Khamenei. The White House feared escalation and regional instability. Benjamin Netanyahu avoided direct comment but affirmed Israel's actions. Trump warned Iran against ret…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-vetoed-israeli-plan-to-kill-irans-supreme-leader-us-official-tells-ap/articleshow/121871213.cms",
    "timestamp": "2025-06-16T00:45:53Z"
  },
  {
    "title": "The reality behind Trump's incredible investment claims",
    "description": "The president's impact on investment in the US is far more incremental than he has claimed.",
    "link": "https://www.bbc.com/news/articles/clynl129kd2o",
    "timestamp": "2025-06-16T00:44:27Z"
  },
  {
    "title": "Drag artists shared their experiences attending the Kennedy Center on a powerful night out",
    "description": "Earlier this year, President Donald Trump shouted\r\n from TruthSocial “NO MORE DRAG SHOWS OR OTHER ANTI-AMERICAN PROPAGANDA” would be allowed on the Kennedy Center, but he said nothing about the audience. Four drag artists knew this well as they attended the K…",
    "link": "https://www.good.is/drag-kennedy-center-trump",
    "timestamp": "2025-06-16T00:43:22Z"
  },
  {
    "title": "Trump vetoed Israeli plan to kill Iranian supreme leader: US official",
    "description": "WASHINGTON: US President Donald Trump vetoed an Israeli plan to assassinate Iranian supreme leader Ayatollah Ali Khamenei, a senior US official told AFP Sunday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/16/trump-vetoed-israeli-plan-to-kill-iranian-supreme-leader-us-official",
    "timestamp": "2025-06-16T00:39:00Z"
  },
  {
    "title": "G7 Protests Hit Calgary With Leaders Far Away",
    "description": "Hundreds of protesters supporting various causes assembled peacefully in downtown Calgary on Sunday as the Group of Seven summit began a long drive away in the mountain resort of Kananaskis.",
    "link": "https://www.ibtimes.com/g7-protests-hit-calgary-leaders-far-away-3775754",
    "timestamp": "2025-06-16T00:36:20Z"
  },
  {
    "title": "California Nightmare",
    "description": "This great parody video comes from The Liberty Daily. It is based on “California Dreaming” by the Mamas and the Papas and was produced, I take it, using AI. It features, among other things, Donald Trump playing the flute solo. The video is optimistically titl…",
    "link": "https://freerepublic.com/focus/f-chat/4323275/posts",
    "timestamp": "2025-06-16T00:35:13Z"
  },
  {
    "title": "Macron rejects Trump's plan for Greenland, proposal to let Putin mediate Israel-Iran crisis",
    "description": "The French leader was visiting Greenland — a self-governing part of Denmark with the right to declare independence that U.S. President Donald Trump has threatened to take over — ahead of a trip to Canada for the G7 leaders' summit.",
    "link": "https://www.cbc.ca/news/world/macron-trump-putin-iran-israel-greenland-1.7562021",
    "timestamp": "2025-06-16T00:35:08Z"
  },
  {
    "title": "G7 protests hit Calgary with leaders far away",
    "description": "Hundreds of protesters supporting various causes assembled peacefully in downtown Calgary on Sunday as the Group of Seven summit began a long drive away in the mountain resort of Kananaskis. In recent years, G7 protests have become tightly controlled affairs.…",
    "link": "https://www.digitaljournal.com/world/g7-protests-hit-calgary-with-leaders-far-away/article",
    "timestamp": "2025-06-16T00:32:21Z"
  },
  {
    "title": "U.S. Could See First Year of Negative Migration Since the 1970s",
    "description": "The U.S.\nThe post U.S. Could See First Year of Negative Migration Since the 1970s appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/u-s-could-see-first-year-negative-migration/",
    "timestamp": "2025-06-16T00:30:07Z"
  },
  {
    "title": "\"Caviar, Champagne And Lobster\": MAGA's Exclusive $500K Private Club Launches - With Bessent, Bondi & RFK Jr. Partying With Tech Billionaires",
    "description": "\"Caviar, Champagne And Lobster\": MAGA's Exclusive $500K Private Club Launches - With Bessent, Bondi & RFK Jr. Partying With Tech Billionaires\n \nOn Friday night, DC's conservative elite celebrated the opening of 'The Executive Branch' - a members-only club whi…",
    "link": "https://biztoc.com/x/574d695f4d61401b",
    "timestamp": "2025-06-16T00:28:35Z"
  },
  {
    "title": "Trump Signs Bills to Repeal California Ban on Gas Cars",
    "description": "President Donald Trump on Thursday signed legislation terminating California regulations that would have banned the sale of gasoline-powered cars in 2035, a victory for carmakers and oil companies. The president's move was met with criticism from environmenta…",
    "link": "https://biztoc.com/x/9fc7167bd9a2e19c",
    "timestamp": "2025-06-16T00:28:14Z"
  },
  {
    "title": "‘No kings!’: like the LA protesters, the early Romans hated kings, too",
    "description": "‘No kings’ would effectively be the watchword through the Roman republic’s entire history. ‘Rex’ was a word the Romans hated. It was short-hand for ‘tyranny’.",
    "link": "https://theconversation.com/no-kings-like-the-la-protesters-the-early-romans-hated-kings-too-259011",
    "timestamp": "2025-06-16T00:24:39Z"
  },
  {
    "title": "Russia launches deadly strike on Kharkiv amid stalled peace talks",
    "description": "Kharkiv, Ukraine (AFP) June 11, 2025 -\n\n Fresh Russian strikes on Ukraine's northeastern city of Kharkiv killed three people and wounded 60 including children early on Wednesday, authorities said, as Moscow pushed ahead with its relentless attacks after rejec…",
    "link": "https://www.spacewar.com/reports/Russia_launches_deadly_strike_on_Kharkiv_amid_stalled_peace_talks_999.html",
    "timestamp": "2025-06-16T00:22:19Z"
  },
  {
    "title": "Iran says Israel attack 'declaration of war'",
    "description": "Tehran (AFP) June 13, 2025 -\n Iran called Israel's wave of strikes on Friday a \"declaration of war\", after the Israeli military hit about 100 targets including nuclear facilities and killed senior figures, among them the armed forces chief and top nuclear sci…",
    "link": "https://www.spacewar.com/reports/Iran_says_Israel_attack_declaration_of_war_999.html",
    "timestamp": "2025-06-16T00:22:19Z"
  },
  {
    "title": "Trump pocketed over $57 mn from crypto coin sales",
    "description": "New York (AFP) June 14, 2025 -\n\n US President Donald Trump pocketed more than $57 million from token sales by the crypto venture he and his sons helped launch last year, according to federal financial disclosure forms released by the White House.\n\nThe more th…",
    "link": "https://www.spacedaily.com/reports/Trump_pocketed_over_57_mn_from_crypto_coin_sales_999.html",
    "timestamp": "2025-06-16T00:20:21Z"
  },
  {
    "title": "China says approved 'certain number' of rare-earth export licences",
    "description": "Beijing (AFP) June 12, 2025 -\n China said Thursday it had issued a \"certain number\" of licences to export rare earths after US President Donald Trump hailed this week's deal that would see the country provide the vital elements \"up front\".\n\nThe economic super…",
    "link": "https://www.spacedaily.com/reports/China_says_approved_certain_number_of_rare-earth_export_licences_999.html",
    "timestamp": "2025-06-16T00:20:21Z"
  },
  {
    "title": "Trump’s Great Test – Peace Through Strength or Endless Wars",
    "description": "A Historic Choice Israel’s all-out attack on the nuclear weapons infrastructure and leadership of Iran has created an historic choice: Will Israel be allowed to defeat decisively the existential threat long posed by the tyrannical Iranian regime both to her p…",
    "link": "https://freerepublic.com/focus/f-news/4323269/posts",
    "timestamp": "2025-06-16T00:20:16Z"
  },
  {
    "title": "TSMC forecasts record profit in 2025 on soaring AI demand",
    "description": "Hsinchu, Taiwan (AFP) June 3, 2025 -\n\n Taiwanese chip titan TSMC said Tuesday that it expected to see record earnings this year as it increased semiconductor production capacity to meet soaring demand for AI technology. \n\nTaiwan Semiconductor Manufacturing co…",
    "link": "https://www.spacedaily.com/reports/TSMC_forecasts_record_profit_in_2025_on_soaring_AI_demand_999.html",
    "timestamp": "2025-06-16T00:19:40Z"
  },
  {
    "title": "Trump Calls for Iran and Israel to Make a Deal as Death Toll Rises",
    "description": "President Donald Trump said Sunday Iran and Israel should come to the negotiating table even as the two nations continued to carry out missile strikes against... Read More\nThe post Trump Calls for Iran and Israel to Make a Deal as Death Toll Rises  appeared f…",
    "link": "https://www.dailysignal.com/2025/06/15/trump-calls-iran-israel-make-deal-death-toll-rises/",
    "timestamp": "2025-06-16T00:18:26Z"
  },
  {
    "title": "Donald Trump Eyeing New Trade Deals at Critical G7 Summit",
    "description": "Trump heads to G7 summit promising new trade deals while his \"90 deals in 90 days\" pledge falls behind schedule with growing global tensions.",
    "link": "https://biztoc.com/x/f07e864a6f7a7b28",
    "timestamp": "2025-06-16T00:17:23Z"
  },
  {
    "title": "'Nation of immigrants and a nation of laws': Obama speaks out about immigration",
    "description": "Former President Barack Obama took to social media on Sunday to address immigration as protests against Trump's overhaul of immigration continue to grip the nation.",
    "link": "https://abcnews.go.com/Politics/nation-immigrants-nation-laws-obama-speaks-immigration/story?id=122877733",
    "timestamp": "2025-06-16T00:16:42Z"
  },
  {
    "title": "Oil Extends Rally as Israel-Iran Conflict Stokes Supply Concerns",
    "description": "Oil jumped after Israel and Iran continued attacks on each other over the weekend, with the market bracing for an escalation that could disrupt supply from a region that produces around a third of the world's crude.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-extends-rally-as-israel-iran-conflict-stokes-supply-concerns",
    "timestamp": "2025-06-16T00:15:04Z"
  },
  {
    "title": "Donald Trump Eyeing New Trade Deals at Critical G7 Summit",
    "description": "Trump heads to G7 summit promising new trade deals while his \"90 deals in 90 days\" pledge falls behind schedule with growing global tensions.",
    "link": "https://www.newsweek.com/donald-trump-new-trade-deals-critical-g7-summit-2085809",
    "timestamp": "2025-06-16T00:09:09Z"
  },
  {
    "title": "War Pig Lindsey Graham Demands US Dive Headfirst into Israel’s War, Pushes for Regime Change — ‘Help Finish the Job’",
    "description": "Sen.\nThe post War Pig Lindsey Graham Demands US Dive Headfirst into Israel’s War, Pushes for Regime Change — ‘Help Finish the Job’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/war-pig-lindsey-graham-demands-us-dive-headfirst/",
    "timestamp": "2025-06-16T00:00:21Z"
  },
  {
    "title": "MSNBC hosts highlight lack of 'dark, malevolent energy' at military parade in DC",
    "description": "MSNBC hosts Ali Velshi and Chris Hayes noted a difference in the atmosphere at the Army's 250th celebration in Washington, D.C., compared to President Trump's rallies.",
    "link": "https://www.foxnews.com/media/msnbc-hosts-surprised-lack-dark-malevolent-energy-military-parade-dc",
    "timestamp": "2025-06-16T00:00:19Z"
  },
  {
    "title": "'Nothing Left Standing': Lindsey Graham Urges 'Trump To Go All In' On Iran",
    "description": "Sen. Lindsey Graham (R-SC) encouraged President Donald Trump to use \"military action\" to help Israel \"finish the job\" of destroying Iran's nuclear facilities.\n\n\n\"So the worst possible outcome for the world is for the Iranian nuclear program to survive,\" Graha…",
    "link": "https://crooksandliars.com/2025/06/nothing-left-standing-lindsey-graham-urges",
    "timestamp": "2025-06-16T00:00:02Z"
  },
  {
    "title": "Immigration Raids in Central California Increased Student Absences for Months: Study",
    "description": "A new study reveals that immigration raids in early 2025 resulted in a 22 percent increase in daily student absences in central California communities that lasted at least two months.",
    "link": "https://www.hoover.org/news/immigration-raids-central-california-increased-student-absences-months-study",
    "timestamp": "2025-06-16T00:00:00Z"
  }
]