[
  {
    "title": "ArcelorMittal Long Products Canada closing wire drawing mill in Hamilton",
    "description": "HAMILTON — ArcelorMittal Long Products Canada is closing its wire drawing mill in Hamilton, putting 153 employees out of work. The company said Wednesday all of the work will now be done at its Montreal location. Company chief executive Stephane Brochu said t…",
    "link": "https://financialpost.com/pmn/arcelormittal-long-products-canada-closing-wire-drawing-mill-in-hamilton",
    "timestamp": "2025-06-11T18:20:34Z"
  },
  {
    "title": "AOC downplays LA riots as mere 'teens throwing rocks,' pins blame on Trump",
    "description": "\"Squad\" member Alexandria Ocasio-Cortez attributes the Los Angeles riots to unruly youths and blames President Trump's immigration raids for escalating violence in the city.",
    "link": "https://www.foxnews.com/politics/aoc-dismisses-la-rioters-mere-teens-throwing-rocks-pins-blame-trump",
    "timestamp": "2025-06-11T18:19:44Z"
  },
  {
    "title": "Voters Don’t Like the Big, Beautiful Bill",
    "description": "As the Senate debates the GOP tax and spending bill titled One Big Beautiful Bill Act and President Donald Trump pushes for a July 4 deadline to sign it, a new Quinnipiac poll finds voters",
    "link": "https://politicalwire.com/2025/06/11/voters-dont-like-the-big-beautiful-bill/",
    "timestamp": "2025-06-11T18:19:06Z"
  },
  {
    "title": "Gov. Greg Abbott Deploys National Guard On Texas Anti-ICE Protests",
    "description": "The Republican said troops “will use every tool & strategy\" to \"maintain order\" as people across the country protest Donald Trump's mass deportation agenda.",
    "link": "https://www.huffpost.com/entry/greg-abbott-national-guard-ice-protests_n_68489787e4b0c1bc4e820a78",
    "timestamp": "2025-06-11T18:18:50Z"
  },
  {
    "title": "Dogecoin rebounds 3% as Elon Musk backs down from feud with Trump",
    "description": "Dogecoin, a crypto memecoin that tends to fluctuate on Musk-related news, rebounded on Wednesday after tech billionaire Elon Musk backed down from an escalating feud with President Donald Trump. \n“I regret some of my posts about President @realDonaldTrump las…",
    "link": "https://biztoc.com/x/cca838f8f3326333",
    "timestamp": "2025-06-11T18:17:13Z"
  },
  {
    "title": "As feds resume student loan collections, states try to catch borrowers before they sink",
    "description": "States can’t cancel the debt, but they are filling gaps in information.",
    "link": "https://www.bostonherald.com/2025/06/11/as-feds-resume-student-loan-collections-states-try-to-catch-borrowers-before-they-sink/",
    "timestamp": "2025-06-11T18:17:08Z"
  },
  {
    "title": "As feds resume student loan collections, states try to catch borrowers before they sink",
    "description": "States can’t cancel the debt, but they are filling gaps in information.",
    "link": "https://www.denverpost.com/2025/06/11/as-feds-resume-student-loan-collections-states-try-to-catch-borrowers-before-they-sink/",
    "timestamp": "2025-06-11T18:17:08Z"
  },
  {
    "title": "Fulbright board resigns citing interference by Trump administration",
    "description": "The Fulbright Foreign Scholarship Board, overseeing the U.S. State Department's Fulbright Program, has resigned en masse, citing political interference from the Trump administration. The board alleges the administration unlawfully denied awards to selected sc…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fulbright-board-resigns-citing-interference-by-trump-administration/articleshow/121785786.cms",
    "timestamp": "2025-06-11T18:15:51Z"
  },
  {
    "title": "Inflation report ‘fuels hope’ the Fed will cut interest rates this year",
    "description": "May number ticked up to 2.4%, less than predicted",
    "link": "https://www.wnd.com/2025/06/inflation-report-fuels-hope-the-fed-will-cut-interest-rates-this-year/",
    "timestamp": "2025-06-11T18:15:15Z"
  },
  {
    "title": "Iran Courts Asia as the West Debates Sanctions",
    "description": "America and Iran may be on the cusp of a workable nuclear deal that will prevent Iran from having nuclear weapons while preserving Iran’s ability to enrich nuclear fuel for its civilian nuclear power program. But there are two spoilers out there: Israel and E…",
    "link": "https://oilprice.com/Geopolitics/Asia/Iran-Courts-Asia-as-the-West-Debates-Sanctions.html",
    "timestamp": "2025-06-11T18:15:00Z"
  },
  {
    "title": "Crypto Regulation: Biden vs. Trump—A Regulatory Rumble in the Digital Arena",
    "description": "In a tale of two regulatory approaches, crypto policy shifts under the Trump and Biden administrations.",
    "link": "https://www.newsweek.com/crypto-regulation-biden-vs-trump-regulatory-rumble-digital-arena-2084167",
    "timestamp": "2025-06-11T18:14:52Z"
  },
  {
    "title": "White House rips 'shameful' LA riots as Trump steps in where Newsom, Bass failed, Leavitt says",
    "description": "Karoline Leavitt condemned the riots in Los Angeles as shameful and highlighted President Donald Trump's actions to restore law and order by mobilizing the National Guard.",
    "link": "https://www.foxnews.com/politics/white-house-rips-shameful-la-riots-trump-steps-where-newsom-bass-failed",
    "timestamp": "2025-06-11T18:14:43Z"
  },
  {
    "title": "Kosovo to ‘Temporarily’ Accept Migrants Deported from U.S.",
    "description": "The government of Kosovo reportedly agreed this week to “temporarily” accept a small number of migrants deported from the United States until they can be returned to their home countries.\nThe post Kosovo to ‘Temporarily’ Accept Migrants Deported from U.S. app…",
    "link": "https://www.breitbart.com/europe/2025/06/11/kosovo-to-temporarily-accept-migrants-deported-from-u-s/",
    "timestamp": "2025-06-11T18:14:24Z"
  },
  {
    "title": "‘What a Stupid Question!’ Karoline Leavitt Scolds Reporter Asking if Trump Would Allow Peaceful Protest During His Big Military Parade",
    "description": "Karoline Leavitt scolded a reporter asking if President Trump will permit peaceful protest during Saturday's military parade in Washington.\nThe post ‘What a Stupid Question!’ Karoline Leavitt Scolds Reporter Asking if Trump Would Allow Peaceful Protest During…",
    "link": "https://www.mediaite.com/media/news/what-a-stupid-question-karoline-leavitt-scolds-reporter-asking-if-trump-would-allow-peaceful-protest-during-his-big-military-parade/",
    "timestamp": "2025-06-11T18:14:20Z"
  },
  {
    "title": "Take A Look At The Newest List Of Illegals ICE Nabbed In Riot-Plagued Los Angeles",
    "description": "ICE is arresting illegal migrants with criminal histories, despite ongoing violence by rioters opposed to the Trump administration's enforcement actions.",
    "link": "https://dailycaller.com/2025/06/11/ice-arrests-more-la-migrants/",
    "timestamp": "2025-06-11T18:12:30Z"
  },
  {
    "title": "Trump Family-Backed American Bitcoin Has Scooped Up $23 Million Worth Of Bitcoin",
    "description": "American Bitcoin, Hut 8’s majority-owned Bitcoin-mining unit backed by the Trump family, has accumulated 215 BTC since its launch in April.",
    "link": "https://zycrypto.com/trump-family-backed-american-bitcoin-has-scooped-up-23-million-worth-of-bitcoin/",
    "timestamp": "2025-06-11T18:11:32Z"
  },
  {
    "title": "Trump remains 'receptive' to dialogue with Kim Jong Un despite reported letter snub",
    "description": "White House press secretary states Trump wants to build on the 2018 summit with Kim Jong Un and remains open to communication despite recent letter rejection claims.",
    "link": "https://www.foxnews.com/world/trump-remains-receptive-dialogue-kim-jong-un-despite-reported-letter-snub",
    "timestamp": "2025-06-11T18:10:54Z"
  },
  {
    "title": "Trump Increasingly Skeptical about Nuclear Deal with Iran",
    "description": "U.S. President Donald Trump is now less confident that the United States could reach a nuclear deal with Iran to prevent the Islamic Republic from obtaining a nuclear weapon. “I’m less confident now than I would have been a couple of months ago,” President Tr…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Increasingly-Skeptical-about-Nuclear-Deal-with-Iran.html",
    "timestamp": "2025-06-11T18:10:14Z"
  },
  {
    "title": "Newsom: \"What Trump Wants Most Is Your Fealty, Your Silence, To Be Complicit In This Moment. Do Not Give In To Him\"",
    "description": "STATE OF CALIFORNIA: In an address delivered to nearly 40 million Californians and Americans nationwide tonight, Governor Gavin Newsom condemned President Trump’s unlawful militarization of Los Angeles and warned that the President’s actions mark a dangerous …",
    "link": "https://www.realclearpolitics.com/video/2025/06/11/newsom_what_trump_wants_most_is_your_fealty_your_silence_to_be_complicit_in_this_moment_do_not_give_in_to_him.html",
    "timestamp": "2025-06-11T18:10:00Z"
  },
  {
    "title": "Justice Department Paves Way To Rein In Federal Land Grabs",
    "description": "The Justice Department says President Donald Trump has the authority to revoke national monument designations made by previous presidents.",
    "link": "https://dailycaller.com/2025/06/11/justice-department-paves-way-to-rein-in-federal-land-grabs/",
    "timestamp": "2025-06-11T18:08:56Z"
  },
  {
    "title": "Senate Democrats seek answers on Trump's World Liberty crypto deal",
    "description": "Senators Elizabeth Warren and Jeff Merkley asked for details on a multibillion-dollar transaction between the Trump family's crypto venture and a pool of investors that includes foreign nationals.",
    "link": "https://www.cbsnews.com/news/senate-democrats-trump-world-liberty-crypto-deal-genius-act-vote/",
    "timestamp": "2025-06-11T18:07:00Z"
  },
  {
    "title": "Would Releasing the Martin Luther King Files Help Curb the Surveillance State?",
    "description": "The FBI spied on the civil rights leader for years. Would releasing its surveillance files just be a further violation of King's privacy, or would it make future abuses less likely?",
    "link": "https://reason.com/2025/06/11/would-releasing-the-martin-luther-king-files-help-curb-the-surveillance-state/",
    "timestamp": "2025-06-11T18:06:18Z"
  },
  {
    "title": "Trump Says He Never Saw Musk 'Get Physical' With Bessent",
    "description": "President Donald Trump reiterated his desire to end his public spat with Elon Musk, telling reporters he would retain Starlink internet service at the White House and that he wished his billionaire backer “very well.”\nTrump said he had not observed a confront…",
    "link": "https://biztoc.com/x/92580fb42e400b8d",
    "timestamp": "2025-06-11T18:06:14Z"
  },
  {
    "title": "Just good neighbors? What nations helping Syria really want",
    "description": "Aid, money, political cover — Syria's neighbors are providing a lot to the war-torn country. But the likes of Turkey, Saudi Arabia and the US are obviously not just helping Syria because they're benevolent and kind.",
    "link": "https://www.dw.com/en/just-good-neighbors-what-nations-helping-syria-really-want/a-72872259",
    "timestamp": "2025-06-11T18:06:00Z"
  },
  {
    "title": "House votes to reverse Trump emergency on border wall money",
    "description": "In a sharp political debate which broke mainly along party lines, the House voted Tuesday evening to block President Donald Trump's national emergency declaration to funnel more money to border security, as Democrats denounced the President's unilateral execu…",
    "link": "https://freerepublic.com/focus/f-news/4322427/posts",
    "timestamp": "2025-06-11T18:05:46Z"
  },
  {
    "title": "Crypto Industry’s Coveted Market Structure Bill Is Doomed, Lobbyists Say",
    "description": "The landmark bill’s odds of passage have been derailed by macro political forces, crypto policy leaders believe.",
    "link": "https://decrypt.co/324686/crypto-coveted-market-structure-bill-doomed-lobbyists",
    "timestamp": "2025-06-11T18:05:43Z"
  },
  {
    "title": "The GOP Is Way Too Fucking Excited About Using US Troops On American Protestors",
    "description": "On the latest episode of the always excellent “The Bugle” podcast, comedian Alice Fraser amusingly describes the horror of what’s happening in Los Angeles the following way: So let’s just clarify: this is arguably unlawful deployment of military force to enfo…",
    "link": "https://www.techdirt.com/2025/06/11/the-gop-is-way-too-fucking-excited-about-using-us-troops-on-american-protestors/",
    "timestamp": "2025-06-11T18:04:24Z"
  },
  {
    "title": "Biden’s DOJ activists out of government, but still stirring the swamp",
    "description": "Starting, joining leftist legal teams to sue Trump administration",
    "link": "https://www.wnd.com/2025/06/bidens-doj-activists-out-of-government-but-still-stirring-the-swamp/",
    "timestamp": "2025-06-11T18:03:34Z"
  },
  {
    "title": "Why the Left Blames Liberals for Trump’s Authoritarianism",
    "description": "The debate, as ever, is whether the left is discredited by its own excesses or by criticism of those excesses.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/liberals-left-trump-mccarthyism/683132/",
    "timestamp": "2025-06-11T18:03:00Z"
  },
  {
    "title": "White House Says Gavin Newsom 'Owns' LA Protests: 'This Is His City'",
    "description": "The White House stepped up its criticism of Calfornia Gov. Gavin Newsom after the Demorcat attacked President Donald Trump in a nationally televised speech.",
    "link": "https://www.newsweek.com/white-house-says-gavin-newsom-owns-la-protests-this-his-city-2084134",
    "timestamp": "2025-06-11T18:02:07Z"
  },
  {
    "title": "Fox News White House Reporter to Karoline Leavitt: Does Trump ‘See Himself as a King?’",
    "description": "A Fox News reporter straight-up asked White House Press Secretary Karoline Leavitt if President Donald Trump views himself as a king.\nThe post Fox News White House Reporter to Karoline Leavitt: Does Trump ‘See Himself as a King?’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/fox-news-white-house-reporter-to-karoline-leavitt-does-trump-see-himself-as-a-king/",
    "timestamp": "2025-06-11T18:02:05Z"
  },
  {
    "title": "Connecticut's Ban Throws Water on 2025 Trend of States Setting Up Crypto Investments",
    "description": "The Connecticut legislature has barred that state's government from setting up the kind of digital assets reserves seen forming elsewhere in the U.S.",
    "link": "https://www.coindesk.com/policy/2025/06/11/connecticut-s-ban-throws-water-on-2025-trend-of-states-setting-up-crypto-investments",
    "timestamp": "2025-06-11T18:02:02Z"
  },
  {
    "title": "Coffee Break: Trump Deploys National Guard to LA",
    "description": "President Trump deploys National Guard and US Marines to Los Angeles in support of ICE. Gavin Newsom files suit in opposition. Waymos burn.",
    "link": "https://www.nakedcapitalism.com/2025/06/trump-deploys-national-guard.html",
    "timestamp": "2025-06-11T18:00:48Z"
  },
  {
    "title": "The days around Trump's trade war announcements saw spikes in lawmaker stock market transactions (CNN)",
    "description": "CNN:\nThe days around Trump's trade war announcements saw spikes in lawmaker stock market transactions  —  In the days before President Donald Trump suddenly paused most of the punishing tariffs on foreign countries he had revealed in early April, more than a …",
    "link": "https://www.memeorandum.com/250611/p89",
    "timestamp": "2025-06-11T18:00:31Z"
  },
  {
    "title": "Seth Meyers on ‘Late Night’ in Trump 2.0 and the Medium’s Future: ‘It’s Hopefully Cathartic to Watch, Definitely Cathartic to Do’",
    "description": "Backstage at 30 Rock, the TV and podcast host and comedian tells TheWrap about his wild year\nThe post Seth Meyers on ‘Late Night’ in Trump 2.0 and the Medium’s Future: ‘It’s Hopefully Cathartic to Watch, Definitely Cathartic to Do’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-interview-late-night-trump-a-closer-look-future/",
    "timestamp": "2025-06-11T18:00:00Z"
  },
  {
    "title": "Space and defense tech firm Voyager raises $382.8 million in IPO",
    "description": "Voyager Technologies raised $382.8 million in its U.S. initial public offering, the space and defense tech company said on Tuesday, amid a global rush to amp up military spending.\n\n\n\nThe company, which provides mission-critical space and defense technology so…",
    "link": "https://www.fastcompany.com/91350690/voyager-ipo-nyse-space-defense-tech",
    "timestamp": "2025-06-11T18:00:00Z"
  },
  {
    "title": "Price predictions 6/11: BTC, ETH, XRP, BNB, SOL, DOGE, ADA, HYPE, SUI, LINK",
    "description": "Bitcoin faces slight resistance near $110,500, while the rally in ETH and HYPE suggests an altcoin season is beginning.",
    "link": "https://cointelegraph.com/news/price-predictions-6-11-btc-eth-xrp-bnb-sol-doge-ada-hype-sui-link",
    "timestamp": "2025-06-11T18:00:00Z"
  },
  {
    "title": "US-Iran Nuclear Negotiations Derail Over Scheduling Clash",
    "description": "Diplomacy between the United States and Iran over the future of Tehran's nuclear program has hit a new snag -- not over uranium enrichment or sanctions, but over the simple matter of when to meet. As US President Donald Trump insists the next round of talks i…",
    "link": "https://oilprice.com/Energy/Energy-General/US-Iran-Nuclear-Negotiations-Derail-Over-Scheduling-Clash.html",
    "timestamp": "2025-06-11T18:00:00Z"
  },
  {
    "title": "EPA set to roll back rules that limit greenhouse gases and mercury from US power plants",
    "description": "Environmental groups vow to challenge the rules in court.",
    "link": "https://www.bostonherald.com/2025/06/11/epa-power-plants/",
    "timestamp": "2025-06-11T17:59:18Z"
  },
  {
    "title": "Gen Z MAGA Influencer Claims He Got ICE to Detain TikTok Star Khaby Lame",
    "description": "Bo Loudon, a Gen Z influencer with ties to Donald and Barron Trump, claims he prompted Khaby Lame's detainment by reaching out to 'buddies' at DHS.",
    "link": "http://www.rollingstone.com/culture/culture-news/khaby-lame-bo-loudon-ice-immigration-detained-1235361940/",
    "timestamp": "2025-06-11T17:58:47Z"
  },
  {
    "title": "Rare-Earth Startups Eye Slice of $1 Billion Bounty From Brazil",
    "description": "Mineral explorers hoping to tap into surging demand for rare earths are vying for a slice of nearly $1 billion in Brazilian funding to help make their projects a reality in a nation with the biggest reserves after China.",
    "link": "https://financialpost.com/pmn/business-pmn/rare-earth-startups-eye-slice-of-1-billion-bounty-from-brazil",
    "timestamp": "2025-06-11T17:57:19Z"
  },
  {
    "title": "Federal appeals court wrestles with Trump effort to fight hush money conviction | CNN Politics",
    "description": "A federal appeals court in New York wrangled Wednesday with President Donald Trump’s claim that his hush money conviction should be reviewed by federal courts and seemed open to the idea that the Supreme Court’s landmark immunity decision may weigh in the pre…",
    "link": "https://www.cnn.com/2025/06/11/politics/trump-hush-money-conviction-arguments",
    "timestamp": "2025-06-11T17:57:10Z"
  },
  {
    "title": "Michael Douglas, In Taormina To Receive Career Honor, Apologizes For U.S. Role In Ongoing Global Conflicts: “This Is The Worst Time That I Can Ever Remember”",
    "description": "Oscar-winning actor and producer Michael Douglas helped kick off the Taormina Film Festival here in Sicily, speaking candidly during a press conference ahead of accepting a Lifetime Achievement award on opening night. A longtime activist, Douglas was spurred …",
    "link": "http://deadline.com/2025/06/michael-douglas-apologizes-usa-global-unrest-1236430921/",
    "timestamp": "2025-06-11T17:56:06Z"
  },
  {
    "title": "Invesco Hires JP Morgan Veteran to Lead Its $1.6 Billion Crypto ETF Business",
    "description": "The global asset manager, which boasts $1.8 trillion assets under management, has welcomed Kathleen Wrynn to manage its portfolio of crypto ETFs and other tokenized assets.",
    "link": "https://decrypt.co/324691/invesco-hires-jpmorgan-veteran-lead-1-6-billion-crypto-etf-business",
    "timestamp": "2025-06-11T17:55:21Z"
  },
  {
    "title": "Trump Strikes Rare Earths Deal With China",
    "description": "President Donald Trump on Wednesday announced that China has agreed to supply rare earth minerals and magnets to the United States up front as part of a new trade agreement. \nPosting on Truth Social, Trump said the U.S. is imposing 55% tariffs while China is …",
    "link": "https://biztoc.com/x/491ec7afe0896bd2",
    "timestamp": "2025-06-11T17:55:18Z"
  },
  {
    "title": "The Trump Administration Is Escalating an Immigration Crisis It Promised To Resolve",
    "description": "During last year's presidential campaign, Donald Trump and his allies promised to take swift action to resolve what they termed the \"Biden border crisis\"—the flow of asylum-seeking migrants across America's southern border. \nWhether or not you agree with the …",
    "link": "https://biztoc.com/x/7e4ca74cf176e31f",
    "timestamp": "2025-06-11T17:55:14Z"
  },
  {
    "title": "WH: Trump 'appreciative' of Musk's apology",
    "description": "White House Press Secretary Karoline Leavitt said on Wednesday that United States President Donald Trump \"acknowledged\" the previous statement by billionaire Elon Musk, and is \"appreciative of it.\" Mo...",
    "link": "https://biztoc.com/x/c9d4ea3c32c97685",
    "timestamp": "2025-06-11T17:55:03Z"
  },
  {
    "title": "Trump Threatens Protesters of His Military “Birthday” Parade With “Big Force”",
    "description": "Polling shows that three-quarters of Americans oppose Trump's decision to hold a military parade this weekend.",
    "link": "https://truthout.org/articles/trump-threatens-protesters-of-his-military-birthday-parade-with-big-force/",
    "timestamp": "2025-06-11T17:52:00Z"
  },
  {
    "title": "Karoline Leavitt stumbles when asked to prove Trump wasn't lying about protests",
    "description": "White House Press Secretary Karoline Leavitt deflected when she was asked to prove President Donald Trump wasn't lying about \"paid insurrectionists\" in Los Angeles.The press secretary was asked about Trump's remarks during Wednesday's White House briefing.\"Th…",
    "link": "https://www.rawstory.com/karoline-leavitt-paid-insurrectionists/",
    "timestamp": "2025-06-11T17:51:34Z"
  },
  {
    "title": "U.S. warns against attending UN gathering on two-state solution for Israeli-Palestinian conflict",
    "description": "In a cable sent to other nations, the United States said countries taking 'anti-Israel actions' following the French-Saudi conference next week will be viewed as acting in opposition to U.S. foreign policy",
    "link": "https://www.haaretz.com/israel-news/2025-06-11/ty-article/u-s-warns-against-attending-un-gathering-on-two-state-solution-for-israel-palestine/00000197-6005-db73-aff7-794d8c750000",
    "timestamp": "2025-06-11T17:49:09Z"
  },
  {
    "title": "Eva Longoria and Kim Kardashian among celebrities blasting ‘ruthless’ and ‘inhumane’ ICE raids",
    "description": "Many A-listers have spoken out against President Trump’s actions, with some joining protests themselves",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/la-protests-ice-celebrities-kim-kardashian-b2768167.html",
    "timestamp": "2025-06-11T17:48:05Z"
  },
  {
    "title": "'Couldn't script this': CNN panel stresses irony of Trump's love for 'Les Miz'",
    "description": "CNN's Inside Politics panel couldn't help but point out the irony of President Donald Trump declaring his love for the Broadway show \"Les Miserables\" as U.S. Marines arrived in Los Angeles at his direction to keep American citizens in line.Host Dana Bash invo…",
    "link": "https://www.rawstory.com/kennedy-center-2672352881/",
    "timestamp": "2025-06-11T17:47:27Z"
  },
  {
    "title": "50 Cent Trolls Elon Musk Over Eye Injury, Backs Donald Trump Amid Beef",
    "description": "50 Cent has inserted himself into the tension between billionaire Elon Musk and United States President Donald Trump.",
    "link": "https://www.vibe.com/news/entertainment/50-cent-trolls-elon-musk-eye-injury-donald-trump-beef-1235077432/",
    "timestamp": "2025-06-11T17:46:47Z"
  },
  {
    "title": "Hegseth spars with Senate Democrats over Marine deployment to LA anti-ICE riots: 'Not about lethality'",
    "description": "Defense Secretary Pete Hegseth stood by the Trump administration's National Guard federalization and U.S. Marines deployment to the Los Angeles anti-ICE riots.",
    "link": "https://www.foxnews.com/politics/hegseth-spars-senate-democrats-over-marine-deployment-la-anti-ice-riots-not-about-lethality",
    "timestamp": "2025-06-11T17:46:30Z"
  },
  {
    "title": "Former Navy SEAL Rob O'Neill takes shots at Butte, Democrats",
    "description": "Butte-Silver Bow Chief Executive J.P. Gallagher calls Rob O'Neill social media post \"ignorant.\"",
    "link": "https://mtstandard.com/news/local/government-politics/article_6b316732-f1ef-4b27-a0e8-644607af16c1.html",
    "timestamp": "2025-06-11T17:45:00Z"
  },
  {
    "title": "EPA set to roll back rules that limit greenhouse gases and mercury from US power plants",
    "description": "WASHINGTON (AP) — The Environmental Protection Agency is poised to eliminate rules that limit greenhouse gas emissions from power plants fueled by coal and natural gas, part of a wide-ranging rollback of environmental regulations that Administrator Lee Zeldin…",
    "link": "https://financialpost.com/pmn/epa-set-to-roll-back-rules-that-limit-greenhouse-gases-and-mercury-from-us-power-plants",
    "timestamp": "2025-06-11T17:44:58Z"
  },
  {
    "title": "Trump's 'done deal' with China? Trade, supply chain damage will remain",
    "description": "President Trump says it's a 'done deal' with China on trade, but inside the supply chain, the damage has been done and will remain, logistics executives say.",
    "link": "https://www.cnbc.com/2025/06/11/trumps-done-deal-with-china-trade-supply-chain-damage-will-remain.html",
    "timestamp": "2025-06-11T17:44:50Z"
  },
  {
    "title": "Musk Says He Regrets Posts Lashing Out at Trump",
    "description": "Elon Musk expressed regret on social media for his recent posts about President Donald Trump, saying they \"went too far\". The public feud between Musk and Trump was triggered by Musk's opposition to Trump's tax-cut bill, which posed a threat to Musk's wealth …",
    "link": "https://biztoc.com/x/96592b9ea64dfa2b",
    "timestamp": "2025-06-11T17:44:45Z"
  },
  {
    "title": "US military deployments in Los Angeles spark political backlash amid nationwide immigration protests",
    "description": "LOS ANGELES: Hundreds of US Marines will soon move into Los Angeles, a military official said on Wednesday (Jun 11), as protests over President Donald Trump’s immigration raids continued to spread",
    "link": "https://www.channelnewsasia.com/world/us-military-deployments-los-angeles-spark-political-backlash-amid-nationwide-immigration-protests-5175751",
    "timestamp": "2025-06-11T17:44:00Z"
  },
  {
    "title": "Elon Musk Non-Specifically Regrets (Some of) the Things He Said About Trump Last Week",
    "description": "Next time he’ll do some breathing exercises before taking to the internet.",
    "link": "https://www.vanityfair.com/news/story/elon-musk-regrets-some-of-the-things-he-said-about-trump",
    "timestamp": "2025-06-11T17:43:39Z"
  },
  {
    "title": "I spent my life caring for these people — then the GOP threw them under a bus",
    "description": "As a registered nurse with over 25 years of experience serving vulnerable communities across Arizona — in school clinics, long-term care facilities, and public health programs — I’ve dedicated my career to helping people live healthier, safer lives. I’ve work…",
    "link": "https://www.rawstory.com/i-spent-my-life-caring-for-these-people-then-the-gop-threw-them-under-a-bus/",
    "timestamp": "2025-06-11T17:43:20Z"
  },
  {
    "title": "Rep. McIver indicted on federal charges over skirmish at New Jersey immigration center",
    "description": "The indictment is the latest development in a legal-political drama that has seen President Donald Trump’s administration take Democratic officials from New Jersey’s largest city to court, tapping into the president’s immigration crackdown and Democrats’ effo…",
    "link": "https://www.pbs.org/newshour/politics/rep-mciver-indicted-on-federal-charges-over-skirmish-at-new-jersey-immigration-center",
    "timestamp": "2025-06-11T17:39:25Z"
  },
  {
    "title": "Ukraine membership out of NATO summit statement – Bloomberg",
    "description": "NATO will focus on spending targets at the upcoming June summit and will not mention Ukraine in its statement, Bloomberg has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618974-nato-summit-drop-ukraine-pledge/",
    "timestamp": "2025-06-11T17:38:25Z"
  },
  {
    "title": "White House Denies Trump Prepping to Send Thousands More Migrants to Guantánamo",
    "description": "Citing government documents and unnamed officials, Politico and The Washington Post reported Tuesday that President Donald Trump's administration is preparing to potentially transfer up to thousands of undocumented immigrants to the U.S. naval station in Guan…",
    "link": "https://www.commondreams.org/news/trump-guantanamo-bay",
    "timestamp": "2025-06-11T17:37:57Z"
  },
  {
    "title": "Trump Organization Teases ‘Major Announcement’ Coinciding With 10th Anniversary Of Trump’s 2016 Campaign Launch",
    "description": "Trump transferred control of his businesses, including the Trump Organization, to a revocable trust, in an effort to limit the appearance of a conflict of interest with his public duties.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/11/trump-organization-teases-major-announcement-coinciding-with-10th-anniversary-of-trumps-2016-campaign-launch/",
    "timestamp": "2025-06-11T17:35:41Z"
  },
  {
    "title": "The Trump Administration Is Escalating an Immigration Crisis It Promised To Resolve",
    "description": "The border is no longer the focus. Now, the White House wants you to believe that the crisis extends to nail salons, hardware stores, farms, and restaurants across the country.",
    "link": "https://reason.com/2025/06/11/the-trump-administration-is-escalating-an-immigration-crisis-it-promised-to-resolve/",
    "timestamp": "2025-06-11T17:35:21Z"
  },
  {
    "title": "Immigration officers intensify arrests in courthouse hallways on a fast track to deportation",
    "description": "The arrests follow a pattern.",
    "link": "https://www.bostonherald.com/2025/06/11/immigration-court-arrests/",
    "timestamp": "2025-06-11T17:33:28Z"
  },
  {
    "title": "Immigration officers intensify arrests in courthouse hallways on a fast track to deportation",
    "description": "The arrests follow a pattern.",
    "link": "https://www.denverpost.com/2025/06/11/immigration-court-arrests/",
    "timestamp": "2025-06-11T17:33:28Z"
  },
  {
    "title": "Vance Joins President Trump To Pressure Fed To Cut Interest Rates",
    "description": "President Donald Trump and Vice President JD Vance ramped up pressure on the Federal Reserve Wednesday, demanding lower interest rates despite inflation remaining slightly above target.\nVance took to X, calling the Fed’s inaction “monetary malpractice” follow…",
    "link": "https://biztoc.com/x/efc0b23ebc933427",
    "timestamp": "2025-06-11T17:33:09Z"
  },
  {
    "title": "If you annoy Trump, he can annoy you back equally, Howard Lutnick says | CNN Business",
    "description": "Commerce Secretary Howard Lutnick, back in Washington after two days helping to negotiate a US-China trade framework in London, said Wednesday that Trump gave his team permission to back off its aggressive stance against China to get a deal done.",
    "link": "https://www.cnn.com/2025/06/11/business/howard-lutnick-trump-china-trade-deal",
    "timestamp": "2025-06-11T17:33:01Z"
  },
  {
    "title": "Days into L.A. immigration raid protests, it appears journalists are bearing the brunt of injuries",
    "description": "U.S. President Donald Trump has said that without a military response, Los Angeles would have been \"obliterated\" due to protests over immigration raids. At least so far, the protests have not led to life-threatening injuries.",
    "link": "https://www.cbc.ca/news/world/la-protests-injuries-1.7558111",
    "timestamp": "2025-06-11T17:32:24Z"
  },
  {
    "title": "US preparing to evacuate embassy in Iraq over security risks, sources say",
    "description": "BAGHDAD/WASHINGTON (Reuters) -The United States is preparing to evacuate its Iraqi embassy due to heightened security risks in the region, three U.S. and two...",
    "link": "https://www.yahoo.com/news/us-embassy-iraq-preparing-ordered-173202340.html",
    "timestamp": "2025-06-11T17:32:02Z"
  },
  {
    "title": "Trump’s National Guard Deployment in LA Is Revenge for Never Winning an Emmy, Stephen Colbert Says | Video",
    "description": "The CBS host called the president's standoff with protestors \"Day 4 of Donald Trump's war on anyone who didn't vote for him\"\nThe post Trump’s National Guard Deployment in LA Is Revenge for Never Winning an Emmy, Stephen Colbert Says | Video appeared first on …",
    "link": "https://www.thewrap.com/stephen-colbert-la-protest-trump-revenge-cbs/",
    "timestamp": "2025-06-11T17:31:16Z"
  },
  {
    "title": "Fact Check: Fake news surrounding the Los Angeles protests",
    "description": "Old clips and false claims are spreading online amid LA's immigration raid clashes. DW investigated a selection of viral ones.",
    "link": "https://www.dw.com/en/fact-check-fake-news-surrounding-the-los-angeles-protests/a-72857568",
    "timestamp": "2025-06-11T17:31:00Z"
  },
  {
    "title": "Elon Musk “Regrets” His Attacks On Donald Trump",
    "description": "Is the divorce called off? Elon Musk has expressed \"regret\" for attacking president Donald Trump during a tit for tat exchange on social media. After the traded threats and online insults last week, many assumed that the two were publicly ending their “broman…",
    "link": "https://www.shtfplan.com/headline-news/elon-musk-regrets-his-attacks-on-donald-trump",
    "timestamp": "2025-06-11T17:30:58Z"
  },
  {
    "title": "Heading toward reconciliation? Musk, Trump soften rhetoric",
    "description": "'I think he feels very badly that he said that, actually'",
    "link": "https://www.wnd.com/2025/06/heading-toward-reconciliation-musk-trump-soften-rhetoric/",
    "timestamp": "2025-06-11T17:30:20Z"
  },
  {
    "title": "As Trump’s ‘two week’ deadline for Russia expires, he faces a series of unresolved foreign conflicts | CNN Politics",
    "description": "Two weeks after President Donald Trump set a 14-day timeline for determining the willingness of his Russian counterpart to end the conflict in Ukraine, he says he is coming to believe Vladimir Putin doesn’t care about the human cost of his war.",
    "link": "https://www.cnn.com/2025/06/11/politics/trump-unresolved-foreign-conflicts",
    "timestamp": "2025-06-11T17:29:55Z"
  },
  {
    "title": "Why China’s going all in on gold and India isn’t, says Financial adviser",
    "description": "China is reshaping global gold demand with a bold, state-led strategy to reduce reliance on the US dollar and prepare for prolonged economic turbulence. From directing insurance firms to buy physical gold to encouraging citizens to hold it, Beijing is shiftin…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/why-chinas-going-all-in-on-gold-and-india-isnt-says-financial-adviser/articleshow/121784163.cms",
    "timestamp": "2025-06-11T17:29:20Z"
  },
  {
    "title": "Navy sailor who vanished from Virginia barracks found dead, another sailor held in her death",
    "description": "A body has been found and confirmed to be that of missing Navy sailor Angelina Resendiz, and another sailor is in pretrial confinement in connection with her death",
    "link": "https://www.nbcnews.com/news/us-news/navy-sailor-vanished-virginia-barracks-found-dead-another-sailor-held-rcna212397",
    "timestamp": "2025-06-11T17:28:13Z"
  },
  {
    "title": "Breaking: Pentagon launches review into AUKUS deal",
    "description": "The Pentagon is reviewing the AUKUS security pact between Australia, the UK and the US to ensure it meets Donald Trump's \"America First\" agenda, a US defence official tells the ABC.",
    "link": "https://www.abc.net.au/news/2025-06-12/aukus-pentagon-review-donald-trump-america-first/105406254",
    "timestamp": "2025-06-11T17:27:59Z"
  },
  {
    "title": "Hegseth defends use of troops to protect immigration raids in Los Angeles",
    "description": "Defense Secretary Pete Hegseth is defending his decision to order National Guard troops to provide security during immigrations raids in Los Angeles",
    "link": "https://abcnews.go.com/US/wireStory/hegseth-defends-troops-protect-immigration-raids-los-angeles-122741468",
    "timestamp": "2025-06-11T17:26:56Z"
  },
  {
    "title": "Hegseth defends use of troops to protect immigration raids in Los Angeles",
    "description": "Hegseth is telling senators it’s about “maintaining law and order.”",
    "link": "https://www.bostonherald.com/2025/06/11/pentagon-hegseth-congress/",
    "timestamp": "2025-06-11T17:26:19Z"
  },
  {
    "title": "Hegseth defends use of troops to protect immigration raids in Los Angeles",
    "description": "Hegseth is telling senators it’s about “maintaining law and order.”",
    "link": "https://www.denverpost.com/2025/06/11/pentagon-hegseth-congress/",
    "timestamp": "2025-06-11T17:26:19Z"
  },
  {
    "title": "Vince Coglianese Grills Rand Paul Over ‘Goose-Stepping’ Comments About Massive DC Army Parade",
    "description": "Vince Coglianese pressed Republican Sen. Rand Paul of Kentucky Wednesday over his criticism of a parade to celebrate the United States Army’s 250th birthday.",
    "link": "https://dailycaller.com/2025/06/11/vince-coglianese-grills-rand-paul-dc-army-parade/",
    "timestamp": "2025-06-11T17:24:03Z"
  },
  {
    "title": "PHOTOS: Protests against immigration raids spread across the U.S.",
    "description": "From Seattle and Austin to Chicago and Washington, D.C., marchers have chanted slogans, carried signs against the Immigration and Customs Enforcement agency and snarled traffic through downtown avenues and outside federal offices.",
    "link": "https://www.pbs.org/newshour/politics/photos-protests-against-immigration-raids-spread-across-the-u-s",
    "timestamp": "2025-06-11T17:23:32Z"
  },
  {
    "title": "Trump Moves To Kill California’s EV Mandate",
    "description": "President Donald Trump will reportedly sign three congressional resolutions on Thursday designed to end California's goal of eliminating gas-powered cars by 2035.",
    "link": "https://www.forbes.com/sites/davidblackmon/2025/06/11/trump-moves-to-kill-californias-ev-mandate/",
    "timestamp": "2025-06-11T17:22:10Z"
  },
  {
    "title": "Musk Says He Regrets Social Media Posts Lashing Out at Trump",
    "description": "Elon Musk expressed regret on social media for his recent posts about President Donald Trump, saying they \"went too far\". The public feud between Musk and Trump was triggered by Musk's opposition to Trump's tax-cut bill, which posed a threat to Musk's wealth …",
    "link": "https://biztoc.com/x/e6473f8f6c5b6ccd",
    "timestamp": "2025-06-11T17:22:00Z"
  },
  {
    "title": "Trump is expected to sign resolution this week reversing California’s ban on gas-powered cars, GOP congressman says",
    "description": "By Shania Shelton and Chris Isidore, CNN\nPresident Donald Trump is expected to sign a set of resolutions this week to reverse California’s 2035 ban on the sale of new gas-powered cars, a Republican co-sponsor said Tuesday.\n“On Thursday, President Trump will s…",
    "link": "https://biztoc.com/x/0b154f0fe8aebdf7",
    "timestamp": "2025-06-11T17:21:59Z"
  },
  {
    "title": "Elon Musk surrenders: World's richest man is caving to Trump after their epic feud",
    "description": "Elon Musk has taken steps to restore his relationship with President Trump and surrender, saying he regrets some of his comments during their feud.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/11/elon-musk-no-match-for-donald-trump-white-house/84147202007/",
    "timestamp": "2025-06-11T17:21:57Z"
  },
  {
    "title": "Voyager Technologies valued at $3.8 billion in stellar NYSE debut",
    "description": "Starlab Space Station developer Voyager Technologies secured a valuation of $3.8 billion after its shares surged 125 per cent in their New York debut on Wednesday, signalling strong interest in the defense and space sector that is expected to thrive under the…",
    "link": "https://www.channelnewsasia.com/business/voyager-technologies-valued-38-billion-stellar-nyse-debut-5175746",
    "timestamp": "2025-06-11T17:21:35Z"
  },
  {
    "title": "Space tech firm Voyager valued at $3.8 billion as shares surge in NYSE debut",
    "description": "Voyager Technologies secured a valuation of $3.8 billion after the defense and space firm's shares more than doubled in their U.S. debut, signalling strong interest in the sector expected to thrive under the Trump administration.The Denver, Colorado–based com…",
    "link": "https://www.channelnewsasia.com/business/space-tech-firm-voyager-valued-38-billion-shares-surge-nyse-debut-5175746",
    "timestamp": "2025-06-11T17:21:35Z"
  },
  {
    "title": "Marine Tanks Stuck In Traffic On The 405",
    "description": "LOS ANGELES, CA — Embattled law enforcement officers trying to keep violent protesters at bay now have to wait even longer for help, as news broke that U.S. Marine tanks had gotten stuck in traffic on the 405 freeway. National Guard servicemen and Los Angeles…",
    "link": "https://freerepublic.com/focus/f-chat/4322421/posts",
    "timestamp": "2025-06-11T17:21:27Z"
  },
  {
    "title": "WATCH: Trump’s pick to be FAA administrator faces tough questions on safety at Senate hearing",
    "description": "Bryan Bedford is facing tough questions about safety on Wednesday during a confirmation hearing before the Senate Committee on Commerce, Science, and Transportation.",
    "link": "https://www.pbs.org/newshour/politics/watch-trumps-pick-to-be-faa-administrator-faces-tough-questions-on-safety-at-senate-hearing",
    "timestamp": "2025-06-11T17:19:00Z"
  }
]