[
  {
    "title": "Another associate quits Skadden after firm reaches settlement to avoid becoming Trump target",
    "description": "A second associate at Skadden, Arps, Slate, Meagher & Flom has left the law firm amid disagreements over its reaction to President Donald Trump’s punitive actions against disfavored firms.",
    "link": "https://www.abajournal.com/news/article/another-associate-quits-skadden-after-firm-reaches-settlement-to-avoid-becoming-a-trump-target",
    "timestamp": "2025-03-31T20:09:00Z"
  },
  {
    "title": "Live results: Wisconsin Supreme Court special election",
    "description": "President Donald Trump's narrow win last year and a highly competitive 2023 state Supreme Court contest could foreshadow the possible paths to victory for this year's statewide campaigns.",
    "link": "https://www.pbs.org/newshour/politics/live-results-wisconsin-supreme-court-special-election",
    "timestamp": "2025-03-31T20:08:43Z"
  },
  {
    "title": "‘Hard-Asset Family’: Trump Sons Launch Bitcoin Mining Venture",
    "description": "Eric Trump and Donald Trump Jr. announced the launch of a new cryptocurrency mining company created through a partnership with a bitcoin mining firm.",
    "link": "https://dailycaller.com/2025/03/31/trump-sons-advance-venture-bitcoin-mining/",
    "timestamp": "2025-03-31T20:08:41Z"
  },
  {
    "title": "Florida Special Elections for House Seen as Barometer on Trump Policies",
    "description": "Two special elections Tuesday for House seats from Florida will be a test of the popularity of the first 70 day of President Donald Trump’s... Read More\nThe post Florida Special Elections for House Seen as Barometer on Trump Policies appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/03/31/florida-special-elections-house-seen-barometer-trump-policies/",
    "timestamp": "2025-03-31T20:08:30Z"
  },
  {
    "title": "UK braces for new US tariffs – media",
    "description": "American trade barriers could reportedly shrink the British economy by 1% and lead to tax hikes Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615060-uk-new-us-tariffs/",
    "timestamp": "2025-03-31T20:08:17Z"
  },
  {
    "title": "Top Massachusetts Democrat says Beacon Hill pols will reject ‘anti-LGBTQ’ policies",
    "description": "Senate President Karen Spilka pledged that the Senate would reject any piece of “anti-LGBTQ” legislation that is filed in the Massachusetts Legislature in the face of what she described as attacks on the transgender community by the Trump administration.",
    "link": "https://www.bostonherald.com/2025/03/31/top-massachusetts-democrat-says-beacon-hill-pols-will-reject-anti-lgbtq-policies/",
    "timestamp": "2025-03-31T20:08:12Z"
  },
  {
    "title": "United receives approval for first Starlink-equipped planes",
    "description": "First flights planned for May.",
    "link": "https://www.itnews.com.au/news/united-receives-approval-for-first-starlink-equipped-planes-616151?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Telco%2fISP+feed",
    "timestamp": "2025-03-31T20:08:02Z"
  },
  {
    "title": "Freed American Hostage Reveals Hamas’s Torture, Sexual Abuse of Female Captives",
    "description": "Keith Siegel — an American hostage held by Hamas for more than 16 months, speaking publicly in detail for the first time — described shocking abuse in captivity, saying he lived in constant fear and personally witnessed female hostages being tortured and sexu…",
    "link": "https://www.breitbart.com/politics/2025/03/31/freed-american-hostage-reveals-hamass-torture-sexual-abuse-of-female-captives/",
    "timestamp": "2025-03-31T20:07:16Z"
  },
  {
    "title": "United receives approval for first Starlink-equipped planes",
    "description": "First flights planned for May.",
    "link": "https://www.itnews.com.au/news/united-receives-approval-for-first-starlink-equipped-planes-616151?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-03-31T20:05:55Z"
  },
  {
    "title": "Stephen A. Smith Presses Bill O’Reilly On Trump Floating Third Term: I Thought Your Party ‘Preached About the Constitution!’",
    "description": "Stephen A. Smith and Bill O'Reilly went at it Sunday over President Donald Trump supposedly considering running for a third term.\nThe post Stephen A. Smith Presses Bill O’Reilly On Trump Floating Third Term: I Thought Your Party ‘Preached About the Constituti…",
    "link": "https://www.mediaite.com/news/stephen-a-smith-presses-bill-oreilly-on-trump-floating-third-term-i-thought-your-party-preached-about-the-constitution/",
    "timestamp": "2025-03-31T20:05:51Z"
  },
  {
    "title": "United receives approval for first Starlink-equipped planes",
    "description": "First flights planned for May.",
    "link": "https://www.itnews.com.au/news/united-receives-approval-for-first-starlink-equipped-planes-616151?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-03-31T20:05:10Z"
  },
  {
    "title": "Wall Street banks got meager payout from CoreWeave IPO",
    "description": "After waiting over three years for a billion-dollar-plus IPO from a U.S. tech company, Wall Street's top banks only got a 2.8% fee.",
    "link": "https://www.cnbc.com/2025/03/31/wall-street-banks-got-meager-payout-from-coreweave-ipo-.html",
    "timestamp": "2025-03-31T20:04:58Z"
  },
  {
    "title": "Controversial transgender swimmer Lia Thomas vows to fight trans athlete bans amid national shift on issue",
    "description": "Former UPenn transgender swimmer Lia Thomas recently spoke up in support of trans athletes amid bans on their inclusion in women's sports.",
    "link": "https://www.foxnews.com/sports/controversial-transgender-swimmer-lia-thomas-vows-fight-trans-athlete-bans-amid-national-shift-issue",
    "timestamp": "2025-03-31T20:04:15Z"
  },
  {
    "title": "MeidasTouch Network Launches Meidas Health with Dr. Vin Gupta to Expose Health Risks of Trump’s Agenda",
    "description": "LOS ANGELES, CA — MeidasTouch Network, the leading pro-democracy media platform, is proud to announce the launch of its newest show: Meidas Health, a groundbreaking series hosted by renowned physician, public health expert, and MSNBC contributor Dr.",
    "link": "https://www.meidasplus.com/p/meidastouch-network-launches-meidas",
    "timestamp": "2025-03-31T20:03:39Z"
  },
  {
    "title": "NH bakery owner says he's already been hit hard by tariffs",
    "description": "Some New Hampshire business owners say they're already feeling the impact of tariffs, with one bakery warning it might go out of business if prices continue to climb.",
    "link": "https://www.wmur.com/article/new-hampshire-bakery-tariffs-shaheen033125/64343420",
    "timestamp": "2025-03-31T20:03:25Z"
  },
  {
    "title": "Could Trump really run again? Virginia experts weigh in.",
    "description": "Law professors say the 22nd and 12th Amendments appear to bar the possibility, but that ambiguous wording could give rise to a legal challenge.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_13a27555-a778-469c-9b04-982f4b6d7ef6.html",
    "timestamp": "2025-03-31T20:03:00Z"
  },
  {
    "title": "Another US debt downgrade could be coming",
    "description": "President Trump and his team say they're managing the federal budget well. Budget hawks disagree.",
    "link": "https://finance.yahoo.com/news/another-us-debt-downgrade-could-be-coming-200236197.html",
    "timestamp": "2025-03-31T20:02:36Z"
  },
  {
    "title": "Could Trump Serve A Third Term As US President?",
    "description": "Trump, 78, said Sunday he was &quot;not joking&quot; about serving a third term as president and told NBC News there are &quot;methods&quot; that would allow it to happen.",
    "link": "https://www.ndtv.com/world-news/could-trump-serve-a-third-term-as-us-president-8056746",
    "timestamp": "2025-03-31T20:01:31Z"
  },
  {
    "title": "Transgender activists' National Mall rally to be joined by a dozen members of Congress: organizers",
    "description": "Transgender protesters and activists are expected to hold a National Mall rally alongside a dozen congressional members in Washington on Monday afternoon for Trans Day of Visibility.",
    "link": "https://www.foxnews.com/politics/transgender-activists-national-mall-rally-joined-dozen-members-congress-organizers",
    "timestamp": "2025-03-31T20:00:54Z"
  },
  {
    "title": "Amber Ruffin Dopped From White House Correspondents Dinner",
    "description": "Ruffin is a notorious anti-right and anti-President Donald Trump comedian.\nThe post Amber Ruffin Dopped From White House Correspondents Dinner first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/03/amber-ruffin-dopped-from-white-house-correspondents-dinner/",
    "timestamp": "2025-03-31T20:00:36Z"
  },
  {
    "title": "Elon Musk debunks rumors: U.S. government won’t adopt Dogecoin",
    "description": "Elon Musk clarifies that there are no government plans for Dogecoin, as DOGE faces bearish trends and uncertainty.",
    "link": "https://ambcrypto.com/elon-musk-debunks-rumors-u-s-government-wont-adopt-dogecoin/",
    "timestamp": "2025-03-31T20:00:35Z"
  },
  {
    "title": "WATCH: Protesters rail against 'malignant presence' Elon Musk during 'Tesla Takedown' demonstrations",
    "description": "Protesters against Elon Musk and Tesla spoke with Fox News Digital during a day of \"action\" against the billionaire about why they're opposed to his efforts with DOGE.",
    "link": "https://www.foxnews.com/media/watch-protesters-rail-against-malignant-presence-elon-musk-during-tesla-takedown-demonstrations",
    "timestamp": "2025-03-31T20:00:21Z"
  },
  {
    "title": "Fire at Tesla dealership in Rome destroys 17 cars, Musk blames 'terrorism'",
    "description": "A Tesla dealership on the eastern outskirts of Rome goes up in flames, destroying 17 cars and prompting the company's billionaire chief executive to blame \"terrorism\".",
    "link": "https://www.abc.net.au/news/2025-04-01/tesla-rome-fire-elon-musk/105120302",
    "timestamp": "2025-03-31T20:00:10Z"
  },
  {
    "title": "White House Reviewing $9 Billion in HARVARD Funding over Antisemitism...",
    "description": "‘We will not hesitate to act if Harvard fails to do so.’",
    "link": "https://www.thefp.com/p/exclusive-trump-administration-reviewing",
    "timestamp": "2025-03-31T20:00:03Z"
  },
  {
    "title": "Donald Trump doesn’t care if your next new car costs more",
    "description": "The US President has declared he had no qualms in making consumers pay more for their cars.",
    "link": "https://www.drive.com.au/news/donald-trump-doesnt-care-if-your-next-new-car-costs-more/",
    "timestamp": "2025-03-31T20:00:00Z"
  },
  {
    "title": "Trump’s Third Term - How AI Can Help To Overthrow The US Government",
    "description": "Trump’s Third Term? AI already knows how this can be done. A study shows how OpenAI, Grok, DeepSeek & Google outline ways to dismantle U.S. democracy.",
    "link": "https://www.forbes.com/sites/lutzfinger/2025/03/31/trumps-third-termhow-ai-can-help-to-overthrow-the-us-government/",
    "timestamp": "2025-03-31T19:59:04Z"
  },
  {
    "title": "Combative Le Pen vows to fight on for French presidency",
    "description": "Far-right leader conspicuously refused to endorse her second-in-command, Jordan Bardella, after a court banned her from running for public office.",
    "link": "https://www.politico.eu/article/marine-le-pen-not-giving-up-presidential-plans-first-interview-since-guilty-verdict/",
    "timestamp": "2025-03-31T19:57:18Z"
  },
  {
    "title": "Live results: Florida special elections to replace Gaetz and Waltz",
    "description": "Control of the U.S. House is not at stake, but the outcome of the special elections could give congressional Republicans some breathing room in the narrowly divided chamber.",
    "link": "https://www.pbs.org/newshour/politics/live-results-florida-special-elections-to-replace-gaetz-and-waltz",
    "timestamp": "2025-03-31T19:56:45Z"
  },
  {
    "title": "U.S. CISA adds Cisco Smart Licensing Utility flaw to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Cisco Smart Licensing Utility flaw to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added a Cisco Smart Licensing Utility vulnera…",
    "link": "https://securityaffairs.com/176073/hacking/u-s-cisa-adds-cisco-smart-licensing-utility-flaw-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-03-31T19:56:01Z"
  },
  {
    "title": "Trump vows strikes on Houthis are just getting started: ‘The real pain is yet to come’",
    "description": "\"Our attacks will continue until they are no longer a threat to Freedom of Navigation. The choice for the Houthis is clear: Stop shooting at U.S. ships, and we will stop shooting at you,\" Trump posted on his Truth Social on Monday.",
    "link": "https://nypost.com/2025/03/31/us-news/trump-vows-strikes-on-houthis-are-just-getting-started-the-real-pain-is-yet-to-come/",
    "timestamp": "2025-03-31T19:55:50Z"
  },
  {
    "title": "'Real Danger in This Moment': 1,900 Scientists Issue SOS Over Trump's Attack",
    "description": "With an open letter Monday addressed to the American people, nearly 2,000 scientists sounded the alarm on U.S. President Donald Trump's \"wholesale assault\" on science—warning that his administration's actions threaten the talent pipeline for the country's fut…",
    "link": "https://www.commondreams.org/news/scientists-sos-letter-trump-cuts",
    "timestamp": "2025-03-31T19:54:24Z"
  },
  {
    "title": "Diane Francis: The Liberals’ lost decade",
    "description": "Now, Mark Carney is in charge. But the Liberal leader has demonstrated an inadequate grasp of the problems facing Canada. Keep reading here.",
    "link": "https://financialpost.com/diane-francis/liberals-lost-decade",
    "timestamp": "2025-03-31T19:53:43Z"
  },
  {
    "title": "Presidents can be elected twice. Trump could try end runs around that, experts say - NPR",
    "description": "Presidents can be elected twice. Trump could try end runs around that, experts sayNPR The 22nd Amendment: Why Trump can't be elected a third timeAxios US politics: Donald Trump says he's considering ways to serve a third term as president of the United States…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176875525",
    "timestamp": "2025-03-31T19:53:35Z"
  },
  {
    "title": "Newsmax Stock Skyrockets Over 700% Following IPO—Causing Multiple Trading Halts",
    "description": "The media company’s stock was halted a dozen times in its first day of trading.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/31/newsmax-stock-skyrockets-over-700-following-ipo-causing-multiple-trading-halts/",
    "timestamp": "2025-03-31T19:53:19Z"
  },
  {
    "title": "EXCLUSIVE: GOP Sens Urge Trump Admin To Restart Fentanyl, Drug Seizure Effort Biden Shuttered",
    "description": "Republican Sens. Marsha Blackburn of Tennessee and Ted Cruz of Texas are urging President Donald Trump's administration to restart drug interdiction efforts.",
    "link": "https://dailycaller.com/2025/03/31/gop-sens-urge-trump-admin-restart-fentanyl-seizure-airport/",
    "timestamp": "2025-03-31T19:52:17Z"
  },
  {
    "title": "Jack Black and Jason Momoa take Minecraft from pixels to the big screen",
    "description": "Jack Black and Jason Momoa star in a live-action Minecraft film directed by Jared Hess. Jack Black plays Steve, leading a group mysteriously transported into the Overworld. The film, featuring Emma Myers and Jennifer Coolidge, aims to capture Minecraft's crea…",
    "link": "https://economictimes.indiatimes.com/news/international/us/entertainment/jack-black-and-jason-momoa-take-minecraft-from-pixels-to-the-big-screen/articleshow/119821885.cms",
    "timestamp": "2025-03-31T19:51:32Z"
  },
  {
    "title": "Doug Burgum: 'Certainly Have Room' for Trump on Mount Rushmore",
    "description": "Interior Secretary Doug Burgum said he \"certainly\" believes there is room for President Donald Trump on Mount Rushmore.\nThe post Doug Burgum: ‘Certainly Have Room’ for Trump on Mount Rushmore appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/31/doug-burgum-certainly-have-room-for-trump-on-mount-rushmore/",
    "timestamp": "2025-03-31T19:50:59Z"
  },
  {
    "title": "White House says ‘no exemptions’ as Canada braces for new wave of U.S. tariffs",
    "description": "WASHINGTON — White House Press Secretary Karoline Leavitt said Monday there will be “no exemptions” to U.S. President Donald Trump’s latest moves to upend global trade this week and it remains unclear just what duties will fall on Canada. Global markets have …",
    "link": "https://financialpost.com/pmn/white-house-says-no-exemptions-as-canada-braces-for-new-wave-of-u-s-tariffs",
    "timestamp": "2025-03-31T19:49:30Z"
  },
  {
    "title": "NASA’s newly returned astronauts say they would fly on Boeing’s Starliner capsule again",
    "description": "CAPE CANAVERAL, Fla. (AP) — NASA’s celebrity astronauts Butch Wilmore and Suni Williams said Monday that they hold themselves partly responsible for what went wrong on their space sprint-turned-marathon and would fly on Boeing’s Starliner again. SpaceX recent…",
    "link": "https://financialpost.com/pmn/nasas-newly-returned-astronauts-say-they-would-fly-on-boeings-starliner-capsule-again",
    "timestamp": "2025-03-31T19:49:20Z"
  },
  {
    "title": "Here's What Happened Today: Monday",
    "description": "Here’s your round-up of what made the headlines today.",
    "link": "https://www.thejournal.ie/evening-fix-news-headlines-monday-4-6664378-Mar2025/",
    "timestamp": "2025-03-31T19:45:41Z"
  },
  {
    "title": "NASA's newly returned astronauts say they would fly on Boeing's Starliner capsule again",
    "description": "NASA’s celebrity astronauts Butch Wilmore and Suni Williams said Monday that they hold themselves partly responsible for what went wrong on their space...",
    "link": "https://www.yahoo.com/news/nasas-newly-returned-astronauts-fly-194501454.html",
    "timestamp": "2025-03-31T19:45:01Z"
  },
  {
    "title": "Why the RBA will hold interest rates ahead of Trump's day of reckoning",
    "description": "The haphazard and irresolute messaging tariffs from the White House, the lack of open consultation and the constant shifts in position have created chaos on the world's financial markets. And none more so than in New York, writes Ian Verrender.",
    "link": "https://www.abc.net.au/news/2025-04-01/reserve-bank-unlikely-to-cut-in-april-as-trump-tariffs-loom/105119844",
    "timestamp": "2025-03-31T19:45:00Z"
  },
  {
    "title": "Trump’s 2028 strategy may be to make an end run around the judiciary",
    "description": "On Sunday, President Donald Trump threw down the gauntlet to people who want to preserve constitutional democracy in this country.",
    "link": "https://biztoc.com/x/8dfc3209f3236b37",
    "timestamp": "2025-03-31T19:43:33Z"
  },
  {
    "title": "How Elon Musk Net Worth Has Changed as Tesla CEO Speaks Out on Stock Drop",
    "description": "\"It's costing me a lot to be in this job,\" Musk, the world's wealthiest person, said this past weekend.",
    "link": "https://www.newsweek.com/elon-musk-net-worth-tesla-stock-market-doge-2053219",
    "timestamp": "2025-03-31T19:42:24Z"
  },
  {
    "title": "Open Source Genetic Database Shuts Down To Protect Users From 'Authoritarian Governments'",
    "description": "An anonymous reader quotes a report from 404 Media: The creator of an open source genetic database is shutting it down and deleting all of its data because he has come to believe that its existence is dangerous with \"a rise in far-right and other authoritaria…",
    "link": "https://science.slashdot.org/story/25/03/31/1926246/open-source-genetic-database-shuts-down-to-protect-users-from-authoritarian-governments",
    "timestamp": "2025-03-31T19:40:00Z"
  },
  {
    "title": "Trump’s tariff plans spark fears of global trade war",
    "description": "World economies shuddered on Monday ahead of US President Donald Trump’s “Liberation Day,” when he is set to unleash tariffs against multiple countries, risking global turmoil to address what he says are unfair trade imbalances. Trump — who has been making un…",
    "link": "https://punchng.com/trumps-tariff-plans-spark-fears-of-global-trade-war/",
    "timestamp": "2025-03-31T19:39:57Z"
  },
  {
    "title": "WTI Jumps 3% on Talk of Russia, Iran Sanctions",
    "description": "Falling US output and potential sanctions on Russia and Iran fueled the rally.",
    "link": "https://www.rigzone.com/news/wire/wti_jumps_3_on_talk_of_russia_iran_sanctions-31-mar-2025-180091-article/",
    "timestamp": "2025-03-31T19:39:20Z"
  },
  {
    "title": "Trump to Announce Tariffs at Rose Garden Event on 'Liberation Day'",
    "description": "President Donald Trump will announce his reciprocal tariffs on Wednesday, or \"Liberation Day,\" in his administration's first Rose Garden event of his second term.\nThe post Trump to Announce Tariffs at Rose Garden Event on ‘Liberation Day’ appeared first on Br…",
    "link": "https://www.breitbart.com/politics/2025/03/31/trump-to-announce-tariffs-at-rose-garden-event-on-liberation-day/",
    "timestamp": "2025-03-31T19:39:00Z"
  },
  {
    "title": "Trump's Crypto Dealings Are Making Regulation 'More Complicated': House Financial Services Chair",
    "description": "Rep. French Hill offered a rare rebuke of the president’s crypto dealings from within his own party, as multiple crypto bills make their way through Congress.",
    "link": "https://decrypt.co/312474/trump-crypto-dealings-regulation-more-complicated-house",
    "timestamp": "2025-03-31T19:38:52Z"
  },
  {
    "title": "Trump’s Tariffs Stretch Security Exceptions to the Breaking Point",
    "description": "National security cited for duties on car parts and other imports.",
    "link": "http://foreignpolicy.com/2025/03/31/trump-tariffs-national-security-russia-canada-mexico/",
    "timestamp": "2025-03-31T19:36:54Z"
  },
  {
    "title": "The Future is Unwritten",
    "description": "I was talking to some of my students about their future legal careers, and mentioned to them that, at the moment, being a law professor at an American law school feels a little like being a professor of Marxist-Leninist political theory in Russia in 1991, or …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/the-future-is-unwritten-3",
    "timestamp": "2025-03-31T19:36:38Z"
  },
  {
    "title": "Trump Gutting of GSA Office Puts Dozens of Federal Childcare Centers at Risk",
    "description": "The recent mass firing of employees at a federal childcare office and the elimination of its work accrediting dozens of facilities on federal property may ultimately further U.S. President Donald Trump and his billionaire ally, Elon Musk's, goal of shrinking …",
    "link": "https://www.commondreams.org/news/trump-childcare",
    "timestamp": "2025-03-31T19:34:20Z"
  },
  {
    "title": "Trump Threatens Iran With Bombing ‘They Have Never Seen’ If Nuclear Deal Isn’t Reached",
    "description": "President Donald Trump threatened Iran with a bombing \"the likes of which they have never seen before\" if they did not agree to a nuclear deal.",
    "link": "https://dailycaller.com/2025/03/31/trump-threatens-iran-bombing-nuclear-deal-ali-khamenei-obama-israel/",
    "timestamp": "2025-03-31T19:34:00Z"
  },
  {
    "title": "Trump pardons Navy veteran convicted in Capitol riot",
    "description": "President Donald Trump has pardoned a Virginia man whose sentence already was commuted for his convictions stemming from the Jan. 6, 2021, riot at the U.S. Capitol",
    "link": "https://abcnews.go.com/US/wireStory/trump-pardons-navy-veteran-convicted-capitol-riot-120342949",
    "timestamp": "2025-03-31T19:33:10Z"
  },
  {
    "title": "'We were always coming back': Astronauts who were stuck in space for months say 'lessons learned'",
    "description": "Elon Musk and Donald Trump had made unsubstantiated claims that the Biden administration held up their flight back to Earth for political reasons.",
    "link": "https://www.thejournal.ie/we-were-always-coming-back-astronauts-who-were-stuck-in-space-for-months-say-lessons-learned-6664371-Mar2025/",
    "timestamp": "2025-03-31T19:33:00Z"
  },
  {
    "title": "Trump has begun another trade war. Here’s a timeline of how we got here",
    "description": "There’s been a sense of whiplash from back-and-forth tariff threats and responding retaliation.",
    "link": "https://www.bostonherald.com/2025/03/31/trump-tariffs-timeline/",
    "timestamp": "2025-03-31T19:32:29Z"
  },
  {
    "title": "In pursuit of Greenland, the White House won’t take the use of force off the table",
    "description": "Donald Trump had an opportunity to categorically rule out the possibility of using military force to acquire Greenland. He did largely the opposite.",
    "link": "https://biztoc.com/x/a6630914b5680c3d",
    "timestamp": "2025-03-31T19:32:24Z"
  },
  {
    "title": "How Donald Trump Could Speed Up Deep-Sea Mining",
    "description": "The Trump administration is considering an executive order that would speed up deep-sea mining in international waters by allowing companies to circumvent a United Nations-backed review process, Reuters reported, citing two sources with direct knowledge of th…",
    "link": "https://biztoc.com/x/8d731451f0a34b3f",
    "timestamp": "2025-03-31T19:32:20Z"
  },
  {
    "title": "ICYMI: The Special Florida Congressional Race Is Close",
    "description": "Florida holds a special election tomorrow for a House seat that has long been solidly red. Now? Maybe a bit less so.<br><br>Former Congressman Mike Waltz gave up his seat in the 6th Congressional District – the area around Daytona Beach – to accept the post o…",
    "link": "https://www.npr.org/2026/01/01/1265982431/zz-1a-floridaelex",
    "timestamp": "2025-03-31T19:32:14Z"
  },
  {
    "title": "Trump is knowingly steering the economy off the cliff with tariffs",
    "description": "Over the weekend, Donald Trump’s reassurance of a more generous approach to tariffs was reversed again, apparently returning to draconian across-the-board 20% tariffs. The president’s imminent Rose Garden “Liberation Day” announcement of universal tariffs on …",
    "link": "https://biztoc.com/x/c81cfdc3ad58026b",
    "timestamp": "2025-03-31T19:32:02Z"
  },
  {
    "title": "Democrats introduce bill to expand gender-affirming care access to mark Trans Day of Visibility",
    "description": "As Republican\r\n-led attacks on transgender\r\n Americans intensify across statehouses and within the Trump\r\n administration, Vermont\r\n U.S. Rep. Becca Balint, a Democrat\r\n, has introduced legislation that aims to meet the moment — not with fear, but with care.",
    "link": "https://www.advocate.com/politics/becca-balint-trans-healthcare-bill",
    "timestamp": "2025-03-31T19:31:44Z"
  },
  {
    "title": "NJ lawmakers urge schools to follow Trump's order against 'radical indoctrination'",
    "description": "DEI lessons should be halted in New Jersey, say Republican lawmakers who argue the state should be following President Trump's executive orders.",
    "link": "https://www.foxnews.com/politics/nj-lawmakers-urge-schools-follow-trumps-order-against-radical-indoctrination",
    "timestamp": "2025-03-31T19:31:10Z"
  },
  {
    "title": "How Donald Trump Could Speed Up Deep-Sea Mining",
    "description": "The Trump administration is considering an executive order that could speed up international deep-sea mining, Reuters reported.",
    "link": "https://www.newsweek.com/trump-deep-sea-mining-executive-order-what-know-2053248",
    "timestamp": "2025-03-31T19:30:53Z"
  },
  {
    "title": "Evan Greer, Ryan Cassata Urge World to ‘Protect Trans Kids’ on Trans Visibility Day",
    "description": "Evan Greer and Ryan Cassata linked up to release 'Protect Trans Kids' on Monday to celebrate International Transgender Day of Visibility.",
    "link": "http://www.rollingstone.com/music/music-news/evan-greer-ryan-cassata-protect-trans-kids-song-1235307077/",
    "timestamp": "2025-03-31T19:29:40Z"
  },
  {
    "title": "Elon Musk's Favorability Plummets in New Poll",
    "description": "Musk's favorability has dropped 10 points since February, a new poll found.",
    "link": "https://www.newsweek.com/elon-musk-favorability-plummets-new-poll-2053241",
    "timestamp": "2025-03-31T19:29:38Z"
  },
  {
    "title": "Revealed! How Dems secretly paid social media influencers to push Kamala Harris during 2024 vote",
    "description": "'Creators' coached on phrases, issues, themes to go 'pro-Kamala'",
    "link": "https://www.wnd.com/2025/03/revealed-how-dems-secretly-paid-social-media-influencers-to-push-kamala-harris-during-2024-vote/",
    "timestamp": "2025-03-31T19:28:06Z"
  },
  {
    "title": "SpaceX To Launch Private Astronauts On First Crewed Polar Orbit",
    "description": "SpaceX is set to launch the first human spaceflight directly over Earth's polar regions on Monday -- a days-long, privately funded orbital mission involving four astronauts.",
    "link": "https://www.ibtimes.com/spacex-launch-private-astronauts-first-crewed-polar-orbit-3768332",
    "timestamp": "2025-03-31T19:27:19Z"
  },
  {
    "title": "BC NDP may ditch consumer carbon tax as soon as Tuesday",
    "description": "The government is trying to fast-track legislation to end carbon pricing in BC the same day as the federal price is lifted.",
    "link": "https://www.nationalobserver.com/2025/03/31/news/bc-ndp-consumer-carbon-tax-tuesday",
    "timestamp": "2025-03-31T19:26:38Z"
  },
  {
    "title": "Meet the 'Dirty 15' countries that could be hit hardest by Trump's tariffs",
    "description": "Trump has pointed to America's trade deficits as he argues that virtually all trading partners are \"taking advantage\" of the U.S.",
    "link": "https://www.cnbc.com/2025/03/31/trump-tariffs-dirty-15-reciprocal-retaliation.html",
    "timestamp": "2025-03-31T19:25:28Z"
  },
  {
    "title": "Trump’s 2028 strategy may be to make an end run around the judiciary",
    "description": "On Sunday, President Donald Trump threw down the gauntlet to people who want to preserve constitutional democracy in this country.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-third-term-election-2028-rcna198855",
    "timestamp": "2025-03-31T19:25:06Z"
  },
  {
    "title": "The 51st State? I’ve played that post-apocalyptic board game",
    "description": "Fifteen years before Trump started talking about Canada as the 51st state, a Polish board game maker used it in a far different context.",
    "link": "https://nationalpost.com/news/51st-state-board-game",
    "timestamp": "2025-03-31T19:24:51Z"
  },
  {
    "title": "Genetic Database Shuts Down to Protect Users From 'Authoritarian Governments'",
    "description": "The creator of an open source genetic database is shutting it down and deleting all of its data because he has come to believe that its existence is dangerous with “a rise in far-right and other authoritarian governments” in the United States and elsewhere. “…",
    "link": "https://slashdot.org/submission/17334753/genetic-database-shuts-down-to-protect-users-from-authoritarian-governments",
    "timestamp": "2025-03-31T19:23:49Z"
  },
  {
    "title": "Louisiana Voters Reject Constitutional Amendments, Defeat Landry",
    "description": "by Julie O'Donoghue and Greg LaRose, Louisiana Illuminator March 29, 2025\nIn a stunning rejection of Republican Gov. Jeff Landry, Louisiana voters turned down all four of his constitutional amendments Saturday, including the governor’s plan to overhaul the st…",
    "link": "https://crooksandliars.com/2025/03/louisiana-voters-reject-constitutional",
    "timestamp": "2025-03-31T19:23:23Z"
  },
  {
    "title": "What the TikTok Ban Deadline Could Mean for the App’s Future",
    "description": "TikTok's future remains murky as the impending deadline to save the app approaches.",
    "link": "https://time.com/7273133/tiktok-ban-trump-deadline/",
    "timestamp": "2025-03-31T19:23:19Z"
  },
  {
    "title": "Trump Press Secretary Freaks Out Over Questions About Deportations",
    "description": "White House Press Secretary Karoline Leavitt flailed Monday when asked about the government’s shady system for classifying gang members. Desperate to dodge the question, Leavitt went on a tirade claiming that the reporter had no right to ask about it in the f…",
    "link": "https://newrepublic.com/post/193401/donald-trump-press-secretary-karoline-leavitt-deportations",
    "timestamp": "2025-03-31T19:23:06Z"
  },
  {
    "title": "‘One did not count’: Trump fans rally behind myriad justifications for unconstitutional third term",
    "description": "After President Donald Trump floated the idea of running for a third term in 2028, some conservatives are parroting falsehoods about election fraud in 2020 or claiming his first term didn’t count to argue why he should get another, illegal, shot at the Oval O…",
    "link": "https://www.dailydot.com/debug/conservatives-trump-third-term/",
    "timestamp": "2025-03-31T19:21:55Z"
  },
  {
    "title": "'Even the rich are worried': Columnist warns economy headed to 'frightful situation'",
    "description": "President Donald Trump might push the U.S. into an economic situation not seen since the 1970s, a columnist warned Monday.Many of the president's economic advisers, including Larry Kudlow and Stephen Moore, have urged him to back off tariffs, which he plans t…",
    "link": "https://www.rawstory.com/donald-trump-stagflation/",
    "timestamp": "2025-03-31T19:21:21Z"
  },
  {
    "title": "The End of College Life?",
    "description": "I have one kid entering college this fall and one a few years away, so I’ve been thinking (with fury and sadness) about the",
    "link": "https://kottke.org/25/03/the-end-of-college-life",
    "timestamp": "2025-03-31T19:21:02Z"
  },
  {
    "title": "'The View' co-hosts rage at WH Correspondents' Association after dropping anti-Trump comedian",
    "description": "\"The View\" co-hosts criticized the White House Correspondents' Association on Monday after the group announced it was canceling anti-Trump comedian Amber Ruffin's dinner appearance.",
    "link": "https://www.foxnews.com/media/the-view-co-hosts-rage-wh-correspondents-association-after-dropping-anti-trump-comedian",
    "timestamp": "2025-03-31T19:20:21Z"
  },
  {
    "title": "Trump Admits He ‘Couldn’t Care Less’ If Car Prices Go Up Due To Tariffs",
    "description": "Trump's tariffs have sparked criticism, especially after he vowed to lower prices for Americans during his campaign.",
    "link": "https://www.huffpost.com/entry/trump-car-prices-tariffs_n_67eaaf57e4b0ff137ab433c4",
    "timestamp": "2025-03-31T19:20:09Z"
  },
  {
    "title": "Trump says he's 'not joking' about possibly seeking a 3rd term. The Constitution bars it, scholars say (Alexandra Hutzler/Associated Press)",
    "description": "Alexandra Hutzler / Associated Press:\nTrump says he's ‘not joking’ about possibly seeking a 3rd term.  The Constitution bars it, scholars say  —  One told ABC “there is no constitutional basis” for what Trump is proposing.  —  President Donald Trump walks dow…",
    "link": "https://www.memeorandum.com/250331/p87",
    "timestamp": "2025-03-31T19:20:00Z"
  },
  {
    "title": "Report: New Auto Tariffs Could Impact Consumer Spending Across Economy",
    "description": "New U.S. tariffs on automobiles and auto parts reportedly may lead to a reduction of consumer purchasing power and spending across the economy. The effect of the tariffs is likely to be longer lasting than the supply chain shocks the automotive sector experie…",
    "link": "https://www.pymnts.com/economy/2025/new-auto-tariffs-could-impact-consumer-spending-across-economy/",
    "timestamp": "2025-03-31T19:18:39Z"
  },
  {
    "title": "‘This Is Feasible’: Liberal Law Professor Says Trump Third Term ‘Could Actually Happen’",
    "description": "Liberal law professor Kim Wehle suggested Monday that President Donald Trump could feasibly run for a third term, despite constitutional limitations.",
    "link": "https://dailycaller.com/2025/03/31/this-is-feasible-liberal-law-professor-says-trump-third-term-could-actually-happen/",
    "timestamp": "2025-03-31T19:18:16Z"
  },
  {
    "title": "Justice Department drops legal challenge against Georgia election law",
    "description": "The Justice Department has dropped its lawsuit against Georgia's election law, after Attorney General Pam Bondi declared voter suppression claims unfounded. The lawsuit contested the 2021 election reform, which increased voter ID requirements and reduced ball…",
    "link": "https://economictimes.indiatimes.com/news/international/us/justice-department-drops-legal-challenge-against-georgia-election-law/articleshow/119821278.cms",
    "timestamp": "2025-03-31T19:17:25Z"
  },
  {
    "title": "After ‘Snow White’ Fiasco, What Is Rachel Zegler’s Next Role?",
    "description": "As Disney’s \"Snow White\" continues to bomb at the box office, Rachel Zegler is moving on to her next acting job. Will it be in another film or something else?",
    "link": "https://www.forbes.com/sites/timlammers/2025/03/31/after-snow-white-fiasco-what-is-rachel-zeglers-next-role/",
    "timestamp": "2025-03-31T19:14:47Z"
  },
  {
    "title": "These Law Professors Just Issued A Dire Warning About Trump",
    "description": "A rare letter from a large contingent of faculty acknowledged the legal profession is under extraordinary strain as Trump targets his perceived enemies.",
    "link": "https://www.huffpost.com/entry/harvard-law-professors-trump_n_67eadd0de4b0ff137ab46c11",
    "timestamp": "2025-03-31T19:14:26Z"
  },
  {
    "title": "Trump pardons Navy veteran convicted in Capitol riot",
    "description": "President Donald Trump has pardoned a Virginia man whose sentence already was commuted for his convictions stemming from the Jan. 6, 2021, riot at the U.S. Capitol.",
    "link": "https://www.wmur.com/article/trump-pardons-thomas-caldwell-capitol-riot/64342617",
    "timestamp": "2025-03-31T19:14:08Z"
  },
  {
    "title": "What you need to know about Donald Trump's attempt to ban transgender people from the military",
    "description": "The Trump administration’s latest attempt to erase transgender people\r\n from public life hit a major roadblock when two federal judges ruled that its ban on transgender military\r\n service is likely unconstitutional. In a scathing opinion, Washington, D.C.,\r\n …",
    "link": "https://www.advocate.com/news/explaining-trump-transgender-military-ban",
    "timestamp": "2025-03-31T19:12:58Z"
  },
  {
    "title": "Trump’s reciprocal tariffs will overturn decades of trade policy",
    "description": "What are reciprocal tariffs and how do they work?",
    "link": "https://www.bostonherald.com/2025/03/31/trump-reciprocal-tariffs/",
    "timestamp": "2025-03-31T19:11:49Z"
  },
  {
    "title": "Trump's reciprocal tariffs will overturn decades of trade policy",
    "description": "President Donald Trump is taking a blowtorch to the rules that have governed world trade for decades",
    "link": "https://biztoc.com/x/9ac48ada34d7af7a",
    "timestamp": "2025-03-31T19:09:59Z"
  },
  {
    "title": "Privatizing the USPS could harm businesses and disproportionately impact rural areas, experts say",
    "description": "Postal workers' unions have been protesting against privatizing the USPS around the country.\n: Jim West/UCG/Universal Images Group via Getty Images\nDonald Trump and Elon Musk have supported privatizing the US Postal Service.\nTrump has also suggested merging t…",
    "link": "https://biztoc.com/x/254eaa1c19eaf2f3",
    "timestamp": "2025-03-31T19:09:51Z"
  },
  {
    "title": "'Dire consequences' if Musk accesses SEC — US lawmaker",
    "description": "The top Democrat on the US House Financial Services Committee issued a warning after reports suggested that Tesla CEO Elon Musk’s “government efficiency” team would be given access to data and systems at the Securities and Exchange Commission (SEC).In a March…",
    "link": "https://cointelegraph.com/news/house-democrats-consequences-elon-musk-sec",
    "timestamp": "2025-03-31T19:09:19Z"
  },
  {
    "title": "‘Shame On You’: Karoline Leavitt Spars With Reporter Who She Accuses Of Covering For Criminal Illegal Immigrants",
    "description": "White House press secretary Karoline Leavitt got into a near shouting match with a reporter over the process of identifying members of Tren de Agua.",
    "link": "https://dailycaller.com/2025/03/31/karoline-leavitt-andrew-feinberg-tren-de-agua-deportations/",
    "timestamp": "2025-03-31T19:09:06Z"
  },
  {
    "title": "Zine Archives Preserve Trans Survival and Storytelling",
    "description": "In private collections and public libraries, the pages of these handmade publications hold a wealth of queer history and community. On an August night in 1991, Nancy Jean Burkholder was kicked out of the Michigan Womyn’s Music Festival. It wasn’t because she …",
    "link": "https://www.atlasobscura.com/articles/queer-trans-zine-archives",
    "timestamp": "2025-03-31T19:09:00Z"
  },
  {
    "title": "Liberation Day announcement: What Trump will say is still up in the air",
    "description": "Everything from reciprocal tariffs on all countries, the enactment of delayed 25% tariffs on Mexico and Canada, and tariffs on lumber, copper, pharmaceuticals and microchips have been proposed.",
    "link": "https://www.cnn.com/2025/03/31/business/liberation-day-announcement-trump/index.html",
    "timestamp": "2025-03-31T19:08:39Z"
  },
  {
    "title": "Left-Wing Coalition Calls on Federal Election Agency to Defy Trump Executive Order",
    "description": "A coalition of left-leaning organizations is urging the U.S. Election Assistance Commission to defy President Donald Trump’s executive order on election integrity.  Trump on Tuesday... Read More\nThe post Left-Wing Coalition Calls on Federal Election Agency to…",
    "link": "https://www.dailysignal.com/2025/03/31/leftwing-coalition-calls-federal-election-agency-defy-trump-executive-order/",
    "timestamp": "2025-03-31T19:08:25Z"
  }
]