[
  {
    "title": "Tesla stock pops 3% as an analyst says buy the dip",
    "description": "After falling 5.3% on Tuesday, Tesla stock got a boost",
    "link": "https://qz.com/tesla-stock-cantor-fitzgerald-upgrade-1851770945",
    "timestamp": "2025-03-19T14:18:00Z"
  },
  {
    "title": "Energy sector CEOs call on Canadian lawmakers to use emergency powers to speed key projects | Globalnews.ca",
    "description": "The letter comes as U.S. President Donald Trump threatens Canadian sovereignty and proposes massive tariffs on Canadian goods, including oil and natural gas.",
    "link": "https://globalnews.ca/news/11088352/canada-energy-ceos-pipelines-oil-politicians/",
    "timestamp": "2025-03-19T14:17:33Z"
  },
  {
    "title": "Trump Plans His Most Alarming Set of Tariffs Yet—Worth Trillions",
    "description": "Donald Trump is planning to ramp up his ill-advised tariffs and place them on “trillions” of dollars in imports.\r\nThe Washington Post reports that most U.S. imports will get hit with the new fees on April 2, on a day Trump is calling “Liberation Day.” The new…",
    "link": "https://newrepublic.com/post/192907/trump-plans-tariffs-trillions",
    "timestamp": "2025-03-19T14:17:13Z"
  },
  {
    "title": "Jeanette Vizguerra, an undocumented mom once named to Time’s 100 Most Influential list, has been detained by ICE in Colorado",
    "description": "An undocumented mother and immigration reform activist who was detained by Immigration and Customs Enforcement feared she was being followed in recent days, her daughter told CNN. Jeanette Vizguerra gained international attention in 2017 when she took sanctua…",
    "link": "https://freerepublic.com/focus/f-news/4305301/posts",
    "timestamp": "2025-03-19T14:16:43Z"
  },
  {
    "title": "Ben & Jerry's says parent Unilever decided to oust ice cream maker's CEO",
    "description": "Ben & Jerry's has accused its parent company, Unilever, of exerting undue influence over its social activism efforts. The ice cream brand alleged that Unilever's decision to remove CEO Dave Stever was due to his commitment to social policies, not his job perf…",
    "link": "https://economictimes.indiatimes.com/news/international/business/ben-jerrys-says-parent-unilever-decided-to-oust-ice-cream-makers-ceo/articleshow/119216661.cms",
    "timestamp": "2025-03-19T14:16:32Z"
  },
  {
    "title": "Ivan Timofeev: Here’s why Trump is talking peace with Putin",
    "description": "The window for peace in Ukraine is open – but for how long? Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614497-ivan-timofeev-trump-putin-call/",
    "timestamp": "2025-03-19T14:15:26Z"
  },
  {
    "title": "TRUMP-PUTIN CALL: Full Readouts by the White House and the Kremlin – Plus: Reaction by the Press and on Social Media – Trump Reflects on Peace Process With Fox News’ Ingraham",
    "description": "In the wake of a significant Trump-Putin conversation, this analysis delves into the contrasting readouts from the White House and Kremlin, alongside reactions from press and social media that stir political discourse.\nThe post TRUMP-PUTIN CALL: Full Readouts…",
    "link": "https://www.thegatewaypundit.com/2025/03/trump-putin-call-full-readouts-white-house-kremlin/",
    "timestamp": "2025-03-19T14:15:09Z"
  },
  {
    "title": "Fox News’ Laura Ingraham Grills Trump: ‘You’re Tougher With Canada Than You Are With Some of Our Biggest Adversaries’",
    "description": "Fox News host Laura Ingraham pressed President Donald Trump over his treatment of Canada relative to the way he treats U.S. adversaries.\nThe post Fox News’ Laura Ingraham Grills Trump: ‘You’re Tougher With Canada Than You Are With Some of Our Biggest Adversar…",
    "link": "https://www.mediaite.com/tv/fox-news-laura-ingraham-grills-trump-youre-tougher-with-canada-than-you-are-with-some-of-our-biggest-adversaries/",
    "timestamp": "2025-03-19T14:13:36Z"
  },
  {
    "title": "Top Tesla Shareholders Selling Off Stock",
    "description": "Several top executives and board members at Tesla have sold significant portions of their stock holdings in recent weeks.",
    "link": "https://www.newsweek.com/telsa-shareholders-selling-stock-elon-musk-james-murdoch-robyn-denholm-kimball-vaibhav-taneja-2047058",
    "timestamp": "2025-03-19T14:13:08Z"
  },
  {
    "title": "What 25 retail leaders are saying about tariffs",
    "description": "From price increase warnings to confidence that vendor relationships will help ride out the storm, here's how the retail C-suite plans to weather tariffs.",
    "link": "https://www.retaildive.com/news/retail-leaders-china-mexico-canada-tariffs-quotes-operations-policy/742634/",
    "timestamp": "2025-03-19T14:13:00Z"
  },
  {
    "title": "Florida Man arrested for threatening to fight Trump naked. Let them fight [Florida]",
    "description": "Florida Man arrested for threatening to fight Trump naked. Let them fight",
    "link": "https://www.fark.com/comments/13602404/Florida-Man-arrested-for-threatening-to-fight-Trump-naked-Let-them-fight",
    "timestamp": "2025-03-19T14:10:05Z"
  },
  {
    "title": "Russia and Ukraine exchange POWs",
    "description": "President Vladimir Putin had previously agreed to swap captives and return heavily wounded Ukrainian fighters as a sign of good will Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614502-russia-ukraine-pow-exchange/",
    "timestamp": "2025-03-19T14:09:36Z"
  },
  {
    "title": "People Are “Terrified.” Mallory McMorrow Has a Democratic Blueprint for Hope",
    "description": "The rising Democratic star tells VF that her party’s response to Donald Trump’s radical agenda is “not enough,” and argues its leaders should ask themselves a simple question: “What are you doing and why are you not in your community?”",
    "link": "https://www.vanityfair.com/news/story/mallory-mcmorrow-democratic-blueprint",
    "timestamp": "2025-03-19T14:09:02Z"
  },
  {
    "title": "Only 15 countries have met the latest Paris agreement deadline. Is any nation serious about tackling climate change?",
    "description": "The low submission rate undermines the global commitment to climate action.",
    "link": "https://theconversation.com/only-15-countries-have-met-the-latest-paris-agreement-deadline-is-any-nation-serious-about-tackling-climate-change-250847",
    "timestamp": "2025-03-19T14:08:20Z"
  },
  {
    "title": "Chuck Schumer Declares Democrats’ Mission Is To ‘Go After Trump’ As Party Approval Craters",
    "description": "While Democrats' popularity sinks to all-time lows, Senate Minority Leader Chuck Schumer asserted his party's role is to take down President Donald Trump's.",
    "link": "https://dailycaller.com/2025/03/19/chuck-schumer-declares-democrats-mission-is-to-go-after-trump-as-party-approval-craters/",
    "timestamp": "2025-03-19T14:08:06Z"
  },
  {
    "title": "JFK's Grandson Challenges Joe Rogan Over Assassination Files",
    "description": "Jack Schlossberg addressed Rogan, who has voiced speculation about the assassination, in a video on his Instagram.",
    "link": "https://www.newsweek.com/jack-schlossberg-challenges-joe-rogan-jfk-assasination-files-2047061",
    "timestamp": "2025-03-19T14:06:45Z"
  },
  {
    "title": "Swamp Creature Swartz Slithers Out of DoJ - 30 Years of Fixing Cases From Sandy Berger to Scooter Libby to Paul Manafort",
    "description": "Much to the chagrin of the media, Bruce Swartz, “globally renowned for representing the Justice Department in some of its most sensitive foreign dealings,” resigned rather than accept a demotion by President Trump. For 30 years, “careerist” Bruce Swartz quiet…",
    "link": "https://freerepublic.com/focus/f-chat/4305296/posts",
    "timestamp": "2025-03-19T14:05:40Z"
  },
  {
    "title": "Who Killed JFK? About the Late President’s Assassination",
    "description": "Late former President John F. Kennedy was fatally shot in 1963. Now that his files have been declassified and released by Donald Trump, the American public wants to learn more about his assassination.",
    "link": "https://hollywoodlife.com/feature/who-killed-jfk-5375550/",
    "timestamp": "2025-03-19T14:05:12Z"
  },
  {
    "title": "Trump To Environment: Drop Dead",
    "description": "In a money saving move, 'Enabling Polluters Always' keeps the same initials as 'Environmental Protection Agency.'",
    "link": "https://www.wonkette.com/p/trump-to-environment-drop-dead",
    "timestamp": "2025-03-19T14:02:54Z"
  },
  {
    "title": "Imane Khelif says she is not intimated by Trump after Olympics gender storm with sights set on LA Games",
    "description": "She found herself in the middle of a bitter divide about gender eligibility during the Paris Olympics.",
    "link": "https://nypost.com/2025/03/19/sports/imane-khelif-not-intimated-by-trump-after-olympics-gender-storm/",
    "timestamp": "2025-03-19T14:02:22Z"
  },
  {
    "title": "Trump fires two Democratic members of the FTC, potentially freeing up space for loyalists",
    "description": "President Donald Trump fired two Democratic members of the Federal Trade Commission on Tuesday, intensifying efforts to exert his administration’s control over independent agencies across the government.Commissioners Alvaro Bedoya and Rebecca Kelly Slaughter …",
    "link": "https://biztoc.com/x/b7792d9d4f940176",
    "timestamp": "2025-03-19T14:02:11Z"
  },
  {
    "title": "JD Vance picks up a side job at the RNC, breaking new historical ground",
    "description": "Donald Trump said JD Vance will “do a fantastic job” as the RNC's new finance chair. Maybe so, but doesn’t the vice president already have a job?",
    "link": "https://biztoc.com/x/3257159632675530",
    "timestamp": "2025-03-19T14:01:59Z"
  },
  {
    "title": "Lee Harvey Oswald Was 'Poor Shot,' JFK Files Release Reveals",
    "description": "KGB files also documented Oswald's \"stormy\" relationship with his wife, Marina",
    "link": "https://www.newsweek.com/lee-harvey-oswald-jfk-files-released-donald-trump-2046989",
    "timestamp": "2025-03-19T14:01:41Z"
  },
  {
    "title": "Trump administration pushes back on judge's request for answers about deporation flights",
    "description": "WASHINGTON — The Trump administration is pushing back against a federal judge's request for more information about the deportation flights that took off over the weekend after President Donald Trump invoked the rarely-used Alien Enemies Act.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-administration-pushes-back-judges-request-answers-deporation-fli-rcna197050",
    "timestamp": "2025-03-19T14:01:39Z"
  },
  {
    "title": "New twist in Trump tariff policy can give India a breather",
    "description": "India may not be severely impacted by Trump's reciprocal tariffs set for April 2, as the specifics remain uncertain. Treasury Secretary Scott Bessent suggested potential delays and negotiations, giving India a chance to reach a trade deal and possibly avoid t…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/new-twist-in-trump-tariff-policy-can-give-india-a-breather/articleshow/119216142.cms",
    "timestamp": "2025-03-19T14:01:37Z"
  },
  {
    "title": "Federal judge halts dismantling of USAID by Musk’s DOGE",
    "description": "A court has ordered the Department of Government Efficiency to pause its shutdown of the US Agency for International Development Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614491-doge-usaid-preliminary-injunction/",
    "timestamp": "2025-03-19T14:01:37Z"
  },
  {
    "title": "Wisconsin's $59 Million Election Is Referendum on Trump and Musk",
    "description": "Contest between Republican Brad Schimel and Democrat Susan Crawford has drawn national attention—and millions in donations from both sides.",
    "link": "https://www.newsweek.com/wisconsins-59-million-election-referendum-trump-musk-2047133",
    "timestamp": "2025-03-19T14:01:30Z"
  },
  {
    "title": "Drones Start Fire at Russian Oil Depot Near Damaged CPC Link",
    "description": "The attack came just hours after Russia's President Vladimir Putin and his US counterpart Donald Trump discussed the war in Ukraine.",
    "link": "https://www.rigzone.com/news/wire/drones_start_fire_at_russian_oil_depot_near_damaged_cpc_link-19-mar-2025-179969-article/",
    "timestamp": "2025-03-19T14:00:01Z"
  },
  {
    "title": "Want to Fight Trump’s Trade War? Visit Canada",
    "description": "Donald Trump's trade war is roiling relations between the U.S. and Canada. Frustrated Americans should considering visiting their neighbors up north.",
    "link": "http://www.rollingstone.com/politics/political-commentary/fight-trump-trade-war-visit-canada-1235298943/",
    "timestamp": "2025-03-19T14:00:00Z"
  },
  {
    "title": "Why Trump Should Ignore the Stock Market",
    "description": "President Donald Trump’s economic priority shouldn’t be preventing a recession. Stock prices are always a bit of a roller coaster. Over the last month, it’s... Read More\nThe post Why Trump Should Ignore the Stock Market appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/19/why-trump-should-ignore-stock-market/",
    "timestamp": "2025-03-19T14:00:00Z"
  },
  {
    "title": "Russia Accused of Drone Attacks Hours After Ceasefire Talks",
    "description": "Ukrainian President Volodymyr Zelenskyy said Russia hit energy infrastructure in Ukraine just hours after President Vladimir Putin told US President Donald Trump he would halt such strikes, as he warned of a \"long path\" to a cease-fire in the war on Ukraine. …",
    "link": "https://oilprice.com/Geopolitics/International/Russia-Accused-of-Drone-Attacks-Hours-After-Ceasefire-Talks.html",
    "timestamp": "2025-03-19T14:00:00Z"
  },
  {
    "title": "Michael Hiltzik: Trump Is Coming for Your Social Security",
    "description": "With Trump, there are no guardrails. The Republican-dominated Congress has given him permission to eliminate agencies and cut budgets and fire people. Normally, under the Constitution, Congress makes the laws and controls the purse, but not now. Michael Hiltz…",
    "link": "https://dianeravitch.net/2025/03/19/michael-hiltzik-trump-is-coming-for-your-social-security/",
    "timestamp": "2025-03-19T14:00:00Z"
  },
  {
    "title": "Maine Judge Leaves Hold On 3-Day Waiting Period Law",
    "description": "An effort by the Maine attorney general to persuade a federal judge to reinstate Maine’s controversial three-day waiting period for firearm purchases while awaiting consideration by a federal appeals court has failed. Last month, a federal judge in Portland g…",
    "link": "https://www.thetruthaboutguns.com/maine-judge-leaves-hold-on-3-day-waiting-period-law/",
    "timestamp": "2025-03-19T14:00:00Z"
  },
  {
    "title": "Russia and Ukraine have exchanged 175 prisoners of war each, Moscow says",
    "description": "Russia has conducted a prisoner exchange with Ukraine finalized during a telephone call between US President D",
    "link": "https://www.jpost.com/breaking-news/article-846730",
    "timestamp": "2025-03-19T13:57:41Z"
  },
  {
    "title": "‘No betrayal’: Ukraine breathes sigh of relief after Trump-Putin talks",
    "description": "Even as the war rages on, Ukrainians are reassured that the US president did not bend to Russia's ceasefire demands.",
    "link": "https://www.aljazeera.com/news/2025/3/19/no-betrayal-ukraine-breathes-sigh-of-relief-after-trump-putin-talks",
    "timestamp": "2025-03-19T13:56:57Z"
  },
  {
    "title": "Republican Rep. Sparks Fury After Telling Town Hall He Supports Musk",
    "description": "Nebraska Representative Mike Flood was excoriated by the crowd at his own town hall on Tuesday for basically every position he took. When he told his constituents he supported Elon Musk, he was booed mercilessly.\r\n“What makes Elon Musk a better person to audi…",
    "link": "https://newrepublic.com/post/192905/republican-representative-mike-flood-town-hall-musk-fury",
    "timestamp": "2025-03-19T13:56:06Z"
  },
  {
    "title": "Trump unveils new ‘self-deportation’ app",
    "description": "US President Donald Trump has unveiled a new ‘self-deportation’ app called CBP Home.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/3/19/trump-unveils-new-self-deportation-app",
    "timestamp": "2025-03-19T13:55:53Z"
  },
  {
    "title": "Wall Street should have known better than to trust Donald Trump (Helaine R. Olen/MSNBC)",
    "description": "Helaine R. Olen / MSNBC:\nWall Street should have known better than to trust Donald Trump  —  More than ever before, he's embraced chaos as a strategy — and that is a risky way to run an economy.  —  By Helaine R. Olen, author of “Pound Foolish: Exposing the D…",
    "link": "https://www.memeorandum.com/250319/p33",
    "timestamp": "2025-03-19T13:55:00Z"
  },
  {
    "title": "‘The Daily Show’: Jordan Klepper Isn’t Surprised Trump Defended Ignoring Judge’s Order With ‘Oral Doesn’t Count’ | Video",
    "description": "The Comedy Central host says \"this is definitely not the first time\" Trump has used that argument\nThe post ‘The Daily Show’: Jordan Klepper Isn’t Surprised Trump Defended Ignoring Judge’s Order With ‘Oral Doesn’t Count’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-ignore-judges-order-the-daily-show-oral-doesnt-count/",
    "timestamp": "2025-03-19T13:54:07Z"
  },
  {
    "title": "Donald Trump’s approval rating nosedives in nation’s most accurate poll, signaling major shift in public opinion; here's what's gone wrong and what happens next",
    "description": "Donald Trump's approval rating has dropped significantly. Economic uncertainty and contentious tariff decisions appear to be influencing public opinion. Recent polls show a decline in approval ratings due to discontent with his management of the economy. His …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-approval-rating-nosedives-in-nations-most-accurate-poll-signaling-major-shift-in-public-opinion-heres-whats-gone-wrong-and-what-happens-next/articleshow/119215277.cms",
    "timestamp": "2025-03-19T13:52:54Z"
  },
  {
    "title": "Trump Likely to Meet Russia's Putin, Says White House Envoy Witkoff",
    "description": "Steve Witkoff, White House special envoy to the Middle East, says a meeting between President Donald Trump and Russian ...",
    "link": "https://biztoc.com/x/0964fd9eec71725b",
    "timestamp": "2025-03-19T13:52:50Z"
  },
  {
    "title": "The Trump-Musk Regime Wants to Make Segregation Great Again",
    "description": "Elie Mystal\n\n\n\nIn a boon for racist businesses, the administration has ended a ban on segregated facilities for federal contractors. \r\n\n\r\n\n\nThe post The Trump-Musk Regime Wants to Make Segregation Great Again appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-musk-lift-ban-on-segregated-facilities/",
    "timestamp": "2025-03-19T13:52:19Z"
  },
  {
    "title": "‘Deep state’: See some of the charges uncovered in the newly released JFK assassination files",
    "description": "Cuba, Vietnam, Russia, CIA, Joe Biden all come up",
    "link": "https://www.wnd.com/2025/03/deep-state-see-some-of-the-charges-uncovered-in-the-newly-released-jfk-assassination-files/",
    "timestamp": "2025-03-19T13:51:12Z"
  },
  {
    "title": "Space science is under threat from the anti-DEI purge",
    "description": "The space science community has long prided itself on its ability to inspire and move people of all backgrounds, but President Donald Trumpâ\u0080\u0099s recent executive orders demanding the end of diversity programs have thrown that optimism into chaos. In response, …",
    "link": "https://www.theverge.com/space/629948/space-science-dei-diversity-nasa-trump",
    "timestamp": "2025-03-19T13:51:01Z"
  },
  {
    "title": "Trump’s threats reignite talk of nuclear bombs in Iran",
    "description": "Trump is still met with defiance from the leadership in Tehran as he threatens military strikes against Iran.",
    "link": "https://www.aljazeera.com/news/2025/3/19/trumps-threats-reignite-talk-of-nuclear-bombs-in-iran",
    "timestamp": "2025-03-19T13:50:45Z"
  },
  {
    "title": "Donald Trump Crossed Justice John Roberts' 'Red Lines': Attorney",
    "description": "The Chief Justice made a rare public comment, directing a veiled critique at the Trump administration.",
    "link": "https://biztoc.com/x/898296c733407a48",
    "timestamp": "2025-03-19T13:50:33Z"
  },
  {
    "title": "Theater-kid moment: Biden judge tries to halt Trump's ban on trans people in the military, cites \"Hamilton\" musical in reasoning",
    "description": "It's about time a president goes full Andrew Jackson on these unelected activist judges appointed by the Democrats. A D.C. judge has ordered a preliminary injunction in favor of a trans activist in the military who sued the U.S. over the President's executive…",
    "link": "https://freerepublic.com/focus/f-news/4305289/posts",
    "timestamp": "2025-03-19T13:48:55Z"
  },
  {
    "title": "BREAKING: Historic Win For Ripple, CEO Confirms End Of SEC Case",
    "description": "In a significant development for the cryptocurrency industry, Ripple Labs CEO Brad Garlinghouse announced that the US Securities and Exchange Commission (SEC) has officially dropped its case against the blockchain payments company.  SEC Drops Case Against Rip…",
    "link": "https://bitcoinist.com/historic-win-for-ripple-ceo-confirms-end-sec-case/",
    "timestamp": "2025-03-19T13:48:37Z"
  },
  {
    "title": "After facing the wrath, Americans cheer Elon Musk for safe return of NASA astronauts to Earth; set social media on fire",
    "description": "NASA astronauts Suni Williams and Butch Wilmore returned to Earth after an unexpected nine-month mission on the International Space Station, extending from an initial one-week plan. Their return via a SpaceX Dragon capsule, alongside two other astronauts, clo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-facing-the-wrath-americans-cheer-elon-musk-for-safe-return-of-nasa-astronauts-to-earth-set-social-media-on-fire/articleshow/119213989.cms",
    "timestamp": "2025-03-19T13:47:55Z"
  },
  {
    "title": "Fed set to pause rate cuts again as concerns grow about Trump’s economic agenda | CNN Business",
    "description": "The Federal Reserve on Wednesday kept interest rates unchanged as central bank officials weigh the impact of President Donald Trump’s aggressive economic agenda.",
    "link": "https://www.cnn.com/business/live-news/federal-reserve-interest-rate-03-19-25/index.html",
    "timestamp": "2025-03-19T13:47:36Z"
  },
  {
    "title": "Crew-9 splashes down while NASA floats along with Trump and Musk nonsense",
    "description": "Elements within the US space agency have elected to toe the party line Comment  The Crew-9 mission has safely returned to Earth, marking the end of Suni Williams and Butch Wilmore's extended time in space and possibly NASA's bipartisan leanings.…",
    "link": "https://www.theregister.com/2025/03/19/crew9_mission_misinformation/",
    "timestamp": "2025-03-19T13:47:12Z"
  },
  {
    "title": "Trump-Putin call: What they agreed to and what’s next for Ukraine war",
    "description": "Putin agreed to a 30-day halt of attacks on energy infrastructure during a call with Trump.",
    "link": "https://www.aljazeera.com/news/2025/3/19/trump-putin-call-what-they-agreed-to-and-whats-next-for-ukraine-war",
    "timestamp": "2025-03-19T13:46:56Z"
  },
  {
    "title": "Ukraine ceasefire ‘within weeks’ – Witkoff",
    "description": "The US special envoy has also said that sanctions on Russia will likely be eased once a ceasefire agreement is secured Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614498-ukraine-ceasefire-weeks-witkoff/",
    "timestamp": "2025-03-19T13:46:32Z"
  },
  {
    "title": "Trump-praising Republican Tudor Dixon ‘deciding soon’ between Michigan gov or Senate bid",
    "description": "Republican Tudor Dixon says she's seriously mulling another run for statewide office in 2026 in her home state of Michigan.",
    "link": "https://nypost.com/2025/03/19/us-news/tudor-dixon-eyes-2026-run-for-governor-or-senate-in-michigan/",
    "timestamp": "2025-03-19T13:46:06Z"
  },
  {
    "title": "Critics Cringe Over Sean Hannity's Fawning Fox News Interview With Elon Musk",
    "description": "Sean Hannity, who previously criticized electric vehicles, thanked the world's richest man Tuesday for creating \"the greatest car ever invented.\"",
    "link": "https://www.huffpost.com/entry/critics-cringe-sean-hannity-fawning-interview-fox-news-elon-musk_n_67da9875e4b04eaabffc1b1b",
    "timestamp": "2025-03-19T13:45:57Z"
  },
  {
    "title": "Trump Administration Effort to Pin DOGE On Anyone But Elon Musk Hits New Snag",
    "description": "The effort on the part of the White House to — on paper, at least — distance Elon Musk from the Department of Government Efficiency (DOGE) has hit a new snag.\nThe post Trump Administration Effort to Pin DOGE On Anyone But Elon Musk Hits New Snag first appeare…",
    "link": "https://www.mediaite.com/news/trump-administration-effort-to-pin-doge-on-anyone-but-elon-musk-hits-new-snag/",
    "timestamp": "2025-03-19T13:45:08Z"
  },
  {
    "title": "The 1600: Before Abundance, Democrats Need To Show Competence",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics editor Carlo Versano.",
    "link": "https://www.newsweek.com/1600-before-abundance-democrats-need-show-competence-2047124",
    "timestamp": "2025-03-19T13:44:05Z"
  },
  {
    "title": "Leaked IRS Email Reveals Extreme Pressure: 'Overwhelming'",
    "description": "Federal workers have faced increased scrutiny since Donald Trump took office, with DOGE overseeing a wave of job cuts.",
    "link": "https://www.newsweek.com/federal-workers-laid-off-jobs-irs-trump-doge-pressure-suicide-2047040",
    "timestamp": "2025-03-19T13:43:57Z"
  },
  {
    "title": "Tesla Attack Map Shows Wave of Elon Musk Products Being Targeted",
    "description": "Musk's increasing influence in the White House under President Donald Trump appears to have made his company Tesla a target for political backlash.",
    "link": "https://www.newsweek.com/tesla-attack-map-shows-wave-elon-musk-products-being-targeted-2046951",
    "timestamp": "2025-03-19T13:43:15Z"
  },
  {
    "title": "Elon Musk And Tim Walz Exchange Barbs As Walz Celebrates Tesla Stock Slide",
    "description": "The former vice presidential candidate Walz said he checks Tesla’s share price to give him a “little boost during the day,” nodding to Musk’s company’s more than 40% year-to-date loss.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/19/elon-musk-and-tim-walz-exchange-barbs-as-walz-celebrates-tesla-stock-slide/",
    "timestamp": "2025-03-19T13:42:41Z"
  },
  {
    "title": "Declassified JFK assassination files: Did Donald Trump’s ‘truth bomb’ really reveal anything new?",
    "description": "The Trump administration released thousands of JFK assassination documents, but with redactions and faded text. Lee Harvey Oswald was described as a poor shot and was under KGB watch. Jack Ruby had ties to organized crime. An unheeded warning was sent to the …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/declassified-jfk-assassination-files-did-donald-trumps-truth-bomb-really-reveal-anything-new/articleshow/119215433.cms",
    "timestamp": "2025-03-19T13:41:42Z"
  },
  {
    "title": "Did TikTok Swing the Election to Trump?",
    "description": "For years, I’ve warned that TikTok isn’t just a social network—it’s a highly sophisticated propaganda tool. And now, there’s growing evidence that it may have helped swing the 2024 presidential election to Donald Trump. Democratic",
    "link": "https://politicalwire.com/2025/03/19/did-tiktok-swing-the-election-to-trump/",
    "timestamp": "2025-03-19T13:41:40Z"
  },
  {
    "title": "Elon Musk loses in court as judge deems DOGE’s dismantling of USAID to be unconstitutional",
    "description": "Elon Musk’s bid to shut down the US foreign aid agency (USAID) “likely violated the Constitution in multiple ways,” according to a federal judge. At the beginning of February, Elon Musk, whose Department of Government Efficiency (DOGE) is leading Donald Trump…",
    "link": "https://www.thepinknews.com/2025/03/19/elon-musk-loses-in-court-as-judge-deems-doges-dismantling-of-usaid-to-be-unconstitutional/",
    "timestamp": "2025-03-19T13:40:45Z"
  },
  {
    "title": "Fired workers are reinstated at NOAA, creating confusion on the heels of severe storms",
    "description": "National Oceanographic and Atmospheric Administration workers experienced a kind of whiplash as the government tried to reinstate probationary employees who had been fired.",
    "link": "https://www.nbcnews.com/science/science-news/noaa-fired-workers-reinstated-weather-storms-rcna197004",
    "timestamp": "2025-03-19T13:40:32Z"
  },
  {
    "title": "FACT CHECK: Does A New Law Allow Women To Retire At Age 52 And Receive A Monthly Pension Of $4,850?",
    "description": "A video shared on TikTok claims a new law allows women to retire at age 52 and receive a monthly pension of $4,850. @clare8609 #tiktok #foryou #news ♬ original sound – user93939673635317 Verdict: False There is no evidence to support the claim. Fact Check: Jo…",
    "link": "https://checkyourfact.com/2025/03/19/fact-check-law-women-retire-52-monthly-pension/",
    "timestamp": "2025-03-19T13:40:24Z"
  },
  {
    "title": "No evidence of foreign state influence on Greenland’s election, Denmark says",
    "description": "The election was under extra international scrutiny due to President Donald Trump's controversial comments about the Arctic island.",
    "link": "https://www.bostonherald.com/2025/03/19/greenland-election-denmark-foreign-influence/",
    "timestamp": "2025-03-19T13:40:11Z"
  },
  {
    "title": "Indonesia’s Foreign Policy Under Prabowo: Still Free But More Active?",
    "description": "President Prabowo’s foreign policy thus far paints a picture of continuity – but there are a few longer-term issues to watch regarding China and ASEAN.",
    "link": "https://thediplomat.com/2025/03/indonesias-foreign-policy-under-prabowo-still-free-but-more-active/",
    "timestamp": "2025-03-19T13:40:00Z"
  },
  {
    "title": "Donald Trump Crossed Justice John Roberts' 'Red Lines': Attorney",
    "description": "The Chief Justice made a rare public comment, directing a veiled critique at the Trump administration.",
    "link": "https://www.newsweek.com/donald-trump-crossed-justice-john-roberts-red-lines-attorney-2047091",
    "timestamp": "2025-03-19T13:39:42Z"
  },
  {
    "title": "Trump Goes Into Denial When Fox Host Asks About Chief Justice’s Rebuke: ‘He Didn’t Mention My Name’",
    "description": "Trump went into denial when Fox News host Laura Ingraham asked him about a \"rare statement\" from Chief Justice John Roberts.\nThe post Trump Goes Into Denial When Fox Host Asks About Chief Justice’s Rebuke: ‘He Didn’t Mention My Name’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/news/trump-goes-into-denial-when-fox-host-asks-about-chief-justices-rebuke-he-didnt-say-my-name/",
    "timestamp": "2025-03-19T13:39:27Z"
  },
  {
    "title": "Europe to Toughen Protection for Steel Sector Amid Defense Push",
    "description": "The European Union will step up protection of its steel industry, as it tries to shield a sector that’s crucial for defense from tariffs, cheap imports and high energy prices.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-to-toughen-protection-for-steel-sector-amid-defense-push",
    "timestamp": "2025-03-19T13:38:53Z"
  },
  {
    "title": "Record numbers forced to flee climate disasters: UN",
    "description": "Hundreds of thousands of people were forced to flee climate disasters last year, the United Nations said Wednesday, highlighting the urgent need for early warning systems covering the entire planet. Poorer countries are severely affected by cyclones, droughts…",
    "link": "https://www.digitaljournal.com/world/record-numbers-forced-to-flee-climate-disasters-un/article",
    "timestamp": "2025-03-19T13:38:21Z"
  },
  {
    "title": "'You don't have the cards' - How to play poker against Trump",
    "description": "The BBC's Anthony Zurcher takes a closer look at the US president's negotiation strategy with top world leaders.",
    "link": "https://www.bbc.com/news/videos/cx2g1dwk27do",
    "timestamp": "2025-03-19T13:37:17Z"
  },
  {
    "title": "WATCH LIVE: Breitbart News Hosts Policy Event with Interior Secretary Doug Burgum",
    "description": "Breitbart News is hosting a policy event, \"A Conversation with Interior Secretary Doug Burgum,” Wednesday morning in downtown Washington, DC. The conversation comes at a time where America is entering into an era of energy dominance, with Burgum playing a key…",
    "link": "https://www.breitbart.com/politics/2025/03/19/watch-live-breitbart-news-hosts-policy-event-with-interior-secretary-doug-burgum/",
    "timestamp": "2025-03-19T13:35:50Z"
  },
  {
    "title": "Japan returns to semiconductor arena now dominated by Taiwan",
    "description": "Tokyo is actively working to revive Japan's semiconductor industry after decades of relying on imports. But reclaiming the nation's superpower status in this sector is still a distant dream. In recent years, as the global trade gradually grew more volatile du…",
    "link": "https://www.dw.com/en/japan-returns-to-semiconductor-arena-now-dominated-by-taiwan/a-71974216",
    "timestamp": "2025-03-19T13:35:00Z"
  },
  {
    "title": "No evidence of foreign state influence on Greenland's election, Denmark says",
    "description": "Denmark says Greenland’s recent election was held without any signs of influence by a foreign intelligence service",
    "link": "https://abcnews.go.com/International/wireStory/evidence-foreign-state-influence-greenlands-election-denmark-119944848",
    "timestamp": "2025-03-19T13:34:54Z"
  },
  {
    "title": "Trump Reveals Stunning Reason Why He’s Bullying Canada",
    "description": "Trying to usurp Canada is becoming less and less of a joke to Donald Trump.\r\nIn an interview with Fox News on Tuesday, the president claimed that the reason he’s so tough on America’s northern neighbor is because it’s “meant to be our fifty-first state.”\r\n“Yo…",
    "link": "https://newrepublic.com/post/192901/donald-trump-reason-bullying-canada",
    "timestamp": "2025-03-19T13:34:22Z"
  },
  {
    "title": "Singer Courtney Love Files for U.K. Citizenship over Trump: 'It's Frightening Now'",
    "description": "Singer Courtney Love announced that she has filed for citizenship in the United Kingdom in response to President Donald Trump.\nThe post Singer Courtney Love Files for U.K. Citizenship over Trump: ‘It’s Frightening Now’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/03/19/singer-courtney-love-files-for-u-k-citizenship-over-donald-trump/",
    "timestamp": "2025-03-19T13:33:47Z"
  },
  {
    "title": "Trump to speak with Ukraine's Zelensky at 10 a.m. ET",
    "description": "US President Donald Trump will hold a call with Ukrainian President Volodymyr Zelensky at 10:00 a.m. ET (1400",
    "link": "https://www.jpost.com/breaking-news/article-846720",
    "timestamp": "2025-03-19T13:31:56Z"
  },
  {
    "title": "\"Domestic Terrorism\": US Attorney General On Attacks On Elon Musk's Tesla",
    "description": "Pam Bondi&#039;s statement came after the latest incident in which a fire was started at a Tesla Collision Center in Las Vegas, damaging five vehicles.",
    "link": "https://www.ndtv.com/world-news/us-attorney-general-pam-bondi-on-attacks-on-elon-musks-tesla-domestic-terrorism-7961089",
    "timestamp": "2025-03-19T13:31:31Z"
  },
  {
    "title": "US aims to bolster India ties as global alliances shift",
    "description": "During a high-profile visit to New Delhi, US intelligence chief Tulsi Gabbard said India and the US will deepen strategic cooperation, emphasizing that \"America first\" does not mean \"America alone.\"",
    "link": "https://www.dw.com/en/us-aims-to-bolster-india-ties-as-global-alliances-shift/a-71973885",
    "timestamp": "2025-03-19T13:31:00Z"
  },
  {
    "title": "Analysis-Putin advances strategic aims while ceding little to Trump",
    "description": "LONDON (Reuters) - Vladimir Putin has edged closer to his goal of repairing Russia's relations with the United States and driving a wedge between the U.S. and Europe, while offering only a slim contribution towards Donald Trump's peace efforts in Ukraine. Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/03/19/analysis-putin-advances-strategic-aims-while-ceding-little-to-trump",
    "timestamp": "2025-03-19T13:31:00Z"
  },
  {
    "title": "US Fed expected to sit tight as Trump tariff fears buffet markets",
    "description": "The US Federal Reserve is widely expected to extend its rate cut pause on Wednesday as it seeks to chart a path through the economic turbulence unleashed by President Donald Trump's on-again, off- again approach to tariffs.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-expected-to-sit-tight-as-trump-tariff-fears-buffet-markets/articleshow/119215355.cms",
    "timestamp": "2025-03-19T13:30:22Z"
  },
  {
    "title": "A Battle for the Soul of the West",
    "description": "The assault on Enlightenment values is tearing both Europe and America apart.",
    "link": "https://www.theatlantic.com/international/archive/2025/03/enlightenment-trump-far-right-europe/682086/",
    "timestamp": "2025-03-19T13:30:00Z"
  },
  {
    "title": "Zelenskyy says Putin's vow not to hit Ukraine's energy infrastructure 'at odds with reality'",
    "description": "Russia strikes hit civilian areas and damaged a hospital in Ukraine following the refusal by Putin to back a full 30-day ceasefire during discussions with Trump.",
    "link": "https://roanoke.com/news/nation-world/article_509631fc-3beb-58a3-b0d7-a1ee31439770.html",
    "timestamp": "2025-03-19T13:30:00Z"
  },
  {
    "title": "Zelenskyy says Putin's vow not to hit Ukraine's energy infrastructure 'at odds with reality'",
    "description": "Russia strikes hit civilian areas and damaged a hospital in Ukraine following the refusal by Putin to back a full 30-day ceasefire during discussions with Trump.",
    "link": "https://richmond.com/news/nation-world/article_6b859d2f-1366-54ba-9889-ea529566e411.html",
    "timestamp": "2025-03-19T13:30:00Z"
  },
  {
    "title": "Imane Khelif: Algerian boxer targets LA Olympics in 2028 after brushing off Donald Trump criticism",
    "description": "Algerian boxer Imane Khelif, who was the subject of global attention during the Paris 2024 Games, says she’s aiming to defend her Olympic title at Los Angeles 2028 and brushed off criticism from President Donald Trump.",
    "link": "https://www.cnn.com/2025/03/19/sport/imane-khelif-la-olympics-donald-trump-spt/index.html",
    "timestamp": "2025-03-19T13:29:22Z"
  },
  {
    "title": "JD Vance picks up a side job at the RNC, breaking new historical ground",
    "description": "Donald Trump said JD Vance will “do a fantastic job” as the RNC's new finance chair. Maybe so, but doesn’t the vice president already have a job?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jd-vance-picks-side-job-rnc-breaking-new-historical-ground-rcna197035",
    "timestamp": "2025-03-19T13:28:45Z"
  },
  {
    "title": "Pentagon confirms resumption of US aid to Ukraine",
    "description": "US assistance resumed after Ukraine accepted Washington’s 30-day ceasefire proposal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614490-us-resumes-aid-intelligence-ukraine/",
    "timestamp": "2025-03-19T13:28:32Z"
  },
  {
    "title": "North Korea Defends Houthis from American 'Hooliganism' in Red Sea",
    "description": "The totalitarian communist government of North Korea condemned President Donald Trump on Tuesday for ordering airstrikes on the Yemeni Houthi terrorist organization, intended as a response to an extended campaign to disrupt global shipping in and around the R…",
    "link": "https://www.breitbart.com/middle-east/2025/03/19/north-korea-defends-houthis-from-american-hooliganism-in-red-sea/",
    "timestamp": "2025-03-19T13:28:30Z"
  },
  {
    "title": "‘The Encampments,’ Macklemore-Produced Doc About Columbia University Gaza Solidarity Movement, Reveals U.S. Release Date and First-Look Images (EXCLUSIVE)",
    "description": "Timely doc “The Encampments,” which delves into the Columbia University Gaza Solidarity Encampment that grew into a wave of international student activism and subsequently sparked the ire of U.S. President Donald Trump, is now set for release in U.S. movie th…",
    "link": "https://variety.com/2025/film/global/the-encampments-doc-columbia-university-protests-us-release-1236342054/",
    "timestamp": "2025-03-19T13:27:15Z"
  },
  {
    "title": "In US, a pastry chef attempts to crack an egg-free menu",
    "description": "The increasing number of outbreaks of avian flu on US farms has made eggs an expensive -- and rare -- commodity. \nThe post In US, a pastry chef attempts to crack an egg-free menu appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/life/in-us-a-pastry-chef-attempts-to-crack-an-egg-free-menu/article",
    "timestamp": "2025-03-19T13:27:00Z"
  },
  {
    "title": "Florida man arrested posting threats against President Donald Trump on social media",
    "description": "A Florida man has been arrested for allegedly making sickening threats against President Trump — even challenging him to “fight me naked to the death,” according to authorities. Kendal Aaron Todd, 42, was busted and charged on March 17 in St. Lucie County aft…",
    "link": "https://nypost.com/video/florida-man-arrested-posting-threats-against-president-donald-trump-on-social-media/",
    "timestamp": "2025-03-19T13:26:59Z"
  },
  {
    "title": "Trump on why US citizenship should be purchased | Fox News Video",
    "description": "President Donald Trump explains why he feels selling U.S. citizenship puts 'America first' on 'The Ingraham Angle.'",
    "link": "https://www.foxnews.com/video/6370213577112",
    "timestamp": "2025-03-19T13:26:44Z"
  },
  {
    "title": "XRP Zooms 10% as Garlinghouse Says SEC is Dropping Case Against Ripple",
    "description": "Earlier reports said that the long-standing legal battle between Ripple and the agency is nearing its end.",
    "link": "https://www.coindesk.com/markets/2025/03/19/xrp-zooms-10-higher-as-garlinghouse-says-sec-is-dropping-case-against-ripple",
    "timestamp": "2025-03-19T13:26:44Z"
  },
  {
    "title": "Alaskan truck toll could be 'last nail in the coffin' of Fort Nelson, B.C., mayor warns",
    "description": "After downturns in forestry and petroleum production, B.C.'s northernmost municipality has turned to tourism for a lifeline. Now, residents worry the threat of tolls on American truck traffic could be the final blow.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/fort-nelson-alaska-highway-truck-tolls-tariffs-1.7487097",
    "timestamp": "2025-03-19T13:26:15Z"
  },
  {
    "title": "Major law firms are struggling to respond to Trump's attacks (Daniel Barnes/Politico)",
    "description": "Daniel Barnes / Politico:\nMajor law firms are struggling to respond to Trump's attacks  —  Law firms are torn on how to handle the new Trump administration as the president targets some of their own.  —  Lawyers at some of the nation's largest law firms are a…",
    "link": "https://www.memeorandum.com/250319/p27",
    "timestamp": "2025-03-19T13:25:00Z"
  },
  {
    "title": "Trump Turns in His Chessboard for a Deck of Cards",
    "description": "It all began on February 28 at the most climactic geopolitical moment of 2025, when Volodymyr Zelenskyy confronted an increasingly aggressive tagteam composed of US President Donald Trump and Vice President JD Vance in the Oval Office. Losing patience with th…",
    "link": "https://www.fairobserver.com/politics/trump-turns-in-his-chessboard-for-a-deck-of-cards/",
    "timestamp": "2025-03-19T13:24:13Z"
  },
  {
    "title": "Fishermen want to go green but say DOGE cuts prevent that",
    "description": "Thoes seeking to convert to new, lower-carbon emission systems are finding federal funding is unavailable in the wake of cuts touted by President Trump.",
    "link": "https://www.bostonherald.com/2025/03/19/fishermen-doge-cuts-environment/",
    "timestamp": "2025-03-19T13:24:01Z"
  },
  {
    "title": "U.S. Department of Energy approves Venture Global CP2 export permit",
    "description": "The U.S. Department of Energy said on Wednesday it approved Venture Global's export permit request for its proposed CP2 LNG project in Cameron Parish...",
    "link": "https://finance.yahoo.com/news/u-department-energy-approves-venture-132342614.html",
    "timestamp": "2025-03-19T13:23:42Z"
  },
  {
    "title": "Young Don Replies to Kevin Taylor After Threatening to Get Him Deported",
    "description": "Social media personality Young Don has responded to journalist Kevin Taylor’s deportation threat, dismissing him as irrelevant and denying mentioning him.",
    "link": "https://yen.com.gh/entertainment/celebrities/279732-young-don-replies-kevin-taylor-threatening-t-deported/",
    "timestamp": "2025-03-19T13:22:56Z"
  }
]