[
  {
    "title": "California's effort to hold oil companies liable for natural disaster damage stalls",
    "description": "A bill in the California Legislature that would have made oil and gas companies liable for damage to homes caused by natural disasters has failed to advance",
    "link": "https://abcnews.go.com/US/wireStory/californias-effort-hold-oil-companies-liable-natural-disaster-120657827",
    "timestamp": "2025-04-09T21:10:41Z"
  },
  {
    "title": "The Latest: Treasury secretary says Trump will keep 10% import tariff, raise import tax on China",
    "description": "President Donald Trump has shared on Truth Social that he has “authorized a 90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately.”",
    "link": "https://abcnews.go.com/Politics/wireStory/latest-treasury-secretary-trump-10-import-tariff-raise-120631565",
    "timestamp": "2025-04-09T21:10:31Z"
  },
  {
    "title": "The Latest: Treasury secretary says Trump will keep 10% import tariff, raise import tax on China",
    "description": "President Donald Trump has shared on Truth Social that he has “authorized a 90 day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately.”",
    "link": "https://abcnews.go.com/US/wireStory/latest-treasury-secretary-trump-10-import-tariff-raise-120631538",
    "timestamp": "2025-04-09T21:10:30Z"
  },
  {
    "title": "'Re-fired': Chief Justice John Roberts gives Trump greenlight to ax 2 agency heads — again",
    "description": "U.S. Supreme Court Chief Justice John Roberts issued an order Wednesday allowing a stay after an appeals court ordered it was unlawful for President Donald Trump to fire two federal agency heads, Cathy Harris and Gwynne Wilcox. The order Wednesday came after …",
    "link": "https://www.rawstory.com/trump-fired-officials-scotus-stay/",
    "timestamp": "2025-04-09T21:10:28Z"
  },
  {
    "title": "The President’s Executive Order on Elections, Explained",
    "description": "President Donald Trump issued an executive order on March 25 that aims to illegally overhaul and take control of major parts of the nation’s election systems. He claimed extraordinary unilateral authority to regulate federal elections and usurp the powers of …",
    "link": "https://msmagazine.com/2025/04/09/trump-executive-order-elections-voting/",
    "timestamp": "2025-04-09T21:10:23Z"
  },
  {
    "title": "Michelle Obama Addresses Divorce Rumors Head-On",
    "description": "Michelle Obama explained her relationship status by debunking divorce rumors during an April 8 interview on Sophia Bush's \"Work in Progress\" podcast.",
    "link": "https://dailycaller.com/2025/04/09/michelle-obama-barack-divorce-rumors-relationship-status-white-house/",
    "timestamp": "2025-04-09T21:09:22Z"
  },
  {
    "title": "Trump makes stunning backflip on tariffs as markets get ‘yippy’ but goes even harder on China",
    "description": "Trump makes stunning backflip on tariffs as markets get ‘yippy’ but goes even harder on China7news.com.au",
    "link": "https://7news.com.au/news/trump-makes-stunning-backflip-on-tariffs-as-nations-get-yippy-but-goes-even-harder-on-china-c-18322600",
    "timestamp": "2025-04-09T21:08:59Z"
  },
  {
    "title": "Trump Asks Supreme Court To Let Him Fire Whoever He Wants",
    "description": "The president has tried to assert extraordinary control over independent agencies and now wants the court's blessing.",
    "link": "https://www.huffpost.com/entry/trump-scotus-independent-agencies_n_67f6d325e4b01be2039599d9",
    "timestamp": "2025-04-09T21:08:47Z"
  },
  {
    "title": "Modelo owner Constellation Brands outlook disappoints as tariffs weigh on forecast",
    "description": "Modelo and Corona owner Constellation Brands beat quarterly earnings and revenue estimates, but its outlook took a hit from U.S. tariffs on most of its beer.",
    "link": "https://www.cnbc.com/2025/04/09/constellation-brands-stz-q4-205-earnings.html",
    "timestamp": "2025-04-09T21:08:42Z"
  },
  {
    "title": "Ruto vows fight back against Trump tariffs on Kenyan goods",
    "description": "President William Ruto has broken his silence on the 10 per cent tariff imposed on Kenyan exports to the US, asserting that the country will safeguard its interests amid the global trade war.",
    "link": "http://www.standardmedia.co.ke/business/business/article/2001516044/ruto-vows-fight-back-against-trump-tariffs-on-kenyan-goods",
    "timestamp": "2025-04-09T21:07:59Z"
  },
  {
    "title": "Wall Street's euphoria sends US stocks to historic gains after Trump pauses most of his tariffs",
    "description": "U.S. stocks soared to one of their best days in history on a euphoric Wall Street after President Donald Trump said he would back off on most of his tariffs temporarily",
    "link": "https://www.wftv.com/news/wall-streets/HQB6GV62CZBMPKHHPEC2I4FHTY/",
    "timestamp": "2025-04-09T21:07:50Z"
  },
  {
    "title": "Trump on Iran: Israel will lead military action if it's needed",
    "description": "US President Donald Trump stated that if military action is necessary concerning Iran, Israel will not only pa",
    "link": "https://www.jpost.com/breaking-news/article-849576",
    "timestamp": "2025-04-09T21:07:17Z"
  },
  {
    "title": "House votes to overturn Biden-era rule limiting bank overdraft fees to $5, sends to Trump to sign",
    "description": "The House has voted to overturn a rule that would have limited bank overdraft fees to $5, following the Senate in moving to dismantle the Biden-era regulation that the Consumer Financial Protection Bureau had estimated would save consumers billions of dollars…",
    "link": "https://www.seattlepi.com/business/article/house-votes-to-overturn-biden-era-rule-limiting-20267662.php",
    "timestamp": "2025-04-09T21:07:00Z"
  },
  {
    "title": "Israeli Strike On Gaza Apartment Building Kills At Least 23, Officials Say",
    "description": "The strike on the residential block killed eight women and eight children, officials said, and comes as Israeli attacks show no signs of slowing.",
    "link": "https://www.huffpost.com/entry/ap-ml-mideast-wars_n_67f6dfc2e4b0212bce867d5a",
    "timestamp": "2025-04-09T21:06:31Z"
  },
  {
    "title": "Settlement Champion Huckabee Confirmed As US Israel Envoy",
    "description": "The US Senate on Wednesday confirmed Mike Huckabee, an evangelical Christian who has said Israel enjoys a divine right to the West Bank, as ambassador to Israel.",
    "link": "https://www.ibtimes.com/settlement-champion-huckabee-confirmed-us-israel-envoy-3769475",
    "timestamp": "2025-04-09T21:06:07Z"
  },
  {
    "title": "We Don't Have Dictators In America — What's missing from the fight over Trump's tariff fiasco. (Brian Beutler/Off Message)",
    "description": "Brian Beutler / Off Message:\nWe Don't Have Dictators In America  —  What's missing from the fight over Trump's tariff fiasco.  —  ∙ Paid  —  My overriding view for almost a decade has been that, for as long as he darkens our door, Donald Trump makes questions…",
    "link": "https://www.memeorandum.com/250409/p133",
    "timestamp": "2025-04-09T21:05:01Z"
  },
  {
    "title": "Masters preview: Is it finally Rory's year?",
    "description": "CBC Sports' daily newsletter covers the top storylines at Augusta, where the green jacket remains Rory McIlroy's white whale.",
    "link": "https://www.cbc.ca/sports/the-buzzer-newsletter-masters-preview-1.7506200",
    "timestamp": "2025-04-09T21:04:38Z"
  },
  {
    "title": "Trump: We'll discuss pulling troops from Europe",
    "description": "United States President Donald Trump told journalists in the Oval Office on Wednesday that the topic of Washington potentially withdrawing its troops from Europe will be discussed.\"It depends. We pay ...",
    "link": "https://biztoc.com/x/f8532d83d8661f06",
    "timestamp": "2025-04-09T21:04:10Z"
  },
  {
    "title": "Trump: Military action against Iran possible 'if necessary'",
    "description": "United States President Donald Trump told reporters at the Oval Office on Wednesday that military action against Iran was \"absolutely\" possible if Tehran refused to negotiate a nuclear deal.Trump reit...",
    "link": "https://biztoc.com/x/67aa94a71176bdc9",
    "timestamp": "2025-04-09T21:04:06Z"
  },
  {
    "title": "The United States and China are locked in a faceoff over tariffs. No one wants to blink first",
    "description": "By DIDI TANG and ZEKE MILLER\nWASHINGTON (AP) — The tariff fight between the world’s two largest economies spiraled into greater peril Wednesday as President Donald Trump tried to narrow his global trade war into a direct — and risky — faceoff with Beijing.\nAs…",
    "link": "https://biztoc.com/x/848a7c24a8bb4ca4",
    "timestamp": "2025-04-09T21:04:05Z"
  },
  {
    "title": "House votes to overturn Biden-era rule limiting bank overdraft fees to $5, sends to Trump to sign",
    "description": "The House has voted to overturn a rule that would have limited bank overdraft fees to $5, following the Senate in moving to dismantle the Biden-era regulation that the Consumer Financial Protection Bureau had estimated would save consumers billions of dollars.",
    "link": "https://www.clickondetroit.com/business/2025/04/09/house-votes-to-overturn-biden-era-rule-limiting-bank-overdraft-fees-to-5-sends-to-trump-to-sign/",
    "timestamp": "2025-04-09T21:04:04Z"
  },
  {
    "title": "Trump has finally blinked - but it's not the stock markets that have forced him to act",
    "description": "Chalk this one up to the bond vigilantes.",
    "link": "https://news.sky.com/story/donald-trump-has-finally-blinked-but-its-not-the-stock-markets-that-have-forced-him-to-act-13345483",
    "timestamp": "2025-04-09T21:04:00Z"
  },
  {
    "title": "Trading Day: Boom! Trump tariff pause sparks monster rally",
    "description": "Wall Street clocked one of its best days in history on Wednesday after President Donald Trump announced a 90-day pause on tariffs and reduced levies on many ...",
    "link": "https://finance.yahoo.com/news/trading-day-boom-trump-tariff-210358499.html",
    "timestamp": "2025-04-09T21:03:58Z"
  },
  {
    "title": "Trump’s power to declare national emergencies is a national emergency",
    "description": "When President Donald Trump announced his tariffs last week, he also declared a national emergency. According to the White House, the emergency in question is “the large and persistent trade deficit,” or the fact that the United States imports more goods than…",
    "link": "https://www.vox.com/policy/407861/trump-tariff-national-emergency-trade-deficit-presidential-powers",
    "timestamp": "2025-04-09T21:03:55Z"
  },
  {
    "title": "Markets Rally as Trump Pauses Tariffs. Should Presidents Have This Much Power?",
    "description": "Last week, President Donald Trump imposed double-digit tariffs on imports from nearly every nation on the planet. The move spooked investors, and the",
    "link": "https://reason.com/2025/04/09/markets-rally-as-trump-pauses-tariffs-should-presidents-have-this-much-power/",
    "timestamp": "2025-04-09T21:03:47Z"
  },
  {
    "title": "Trump’s Economic War Against The Communist Chinese Empire Just Went Nuclear",
    "description": "Well, isn’t this fun?  News that President Trump had decided to pause some of the tariffs that he recently unveiled for 90 days sent stock prices soaring.  The Dow Jones Industrial Average was up more than 2,900 points on Wednesday, and that is very good news…",
    "link": "http://theeconomiccollapseblog.com/trumps-economic-war-against-the-communist-chinese-empire-just-went-nuclear/",
    "timestamp": "2025-04-09T21:03:42Z"
  },
  {
    "title": "Tariff Tyranny: Trump Tells America To ‘BE COOL’ Amid Economic Debacle While Trading Tariff Hikes With China",
    "description": "In today’s episode of The U.S. Economy vs. Trump’s Bigly Stupid Tariff War, President Donald Trump basically became the living embodiment of that one meme with the dog sitting calmly in the burning house, declaring, “This is fine” when he took to social media…",
    "link": "http://bossip.com/2852671/trump-tariffs-be-cool-update/",
    "timestamp": "2025-04-09T21:02:59Z"
  },
  {
    "title": "Senate Republicans express relief after Trump pauses tariff plans",
    "description": "As news that President Donald Trump was backing down on most of his tariffs reached a luncheon of Senate Republicans Wednesday, the room reacted with relief, cheers and smiles",
    "link": "https://abcnews.go.com/US/wireStory/senate-republicans-express-relief-after-trump-pauses-tariff-120625317",
    "timestamp": "2025-04-09T21:02:18Z"
  },
  {
    "title": "Chief Justice Pauses Ruling Forcing Trump Reinstate NLRB, MSPB Employees",
    "description": "Trump is appealing the U.S. Court of Appeals for the District of Columbia Circuit decision.\nThe post Chief Justice Pauses Ruling Forcing Trump Reinstate NLRB, MSPB Employees first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/chief-justice-stays-order-in-ruling-forcing-trump-reinstating-nlrb-mspb-employees/",
    "timestamp": "2025-04-09T21:02:13Z"
  },
  {
    "title": "The Latest: S&P 500 soars 9.5% to one of its biggest gains since WWII after Trump limits tariffs",
    "description": "Stocks surged to one of their biggest gains since World War II after President Donald Trump paused his tariffs against most other nations, as investors had desperately hoped he would",
    "link": "https://abcnews.go.com/Business/wireStory/latest-sp-500-soars-95-biggest-gains-wwii-120624593",
    "timestamp": "2025-04-09T21:02:09Z"
  },
  {
    "title": "More tariff chaos: Trump follows China rise with 90-day ‘pause’",
    "description": "Donald Trump has announced a 90-day period of minimum tariffs as the US trade war with China starts to get out of hand, and there's big money coming into Labor's reelection campaign. \nThe post More tariff chaos: Trump follows China rise with 90-day ‘pause’ ap…",
    "link": "http://www.crikey.com.au/2025/04/10/donald-trump-tariffs-china-2025-federal-election-labor/",
    "timestamp": "2025-04-09T21:02:04Z"
  },
  {
    "title": "Trump shocks with tariff increase on China, ‘pause’ for everyone else",
    "description": "Donald Trump announced a 90-day ‘pause’ on individual tariffs for dozens of countries but increasing rates on China.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/4/9/trump-shocks-with-tariff-increase-on-china-pause-for-everyone-else",
    "timestamp": "2025-04-09T21:01:54Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "The U.S. Postal Service is seeking a rate increase this summer that includes hiking the cost of a first-class stamp from 73 cents to 78 cents",
    "link": "https://abcnews.go.com/US/wireStory/us-postal-service-seeks-hike-cost-class-stamp-120656899",
    "timestamp": "2025-04-09T21:01:54Z"
  },
  {
    "title": "Trump says he does not want to see US Steel go to Japan",
    "description": "WASHINGTON : U.S. President Donald Trump said on Wednesday that he does not want U.S. Steel Corp to go to Japan, suggesting he no longer supports Nippon Steel's bid for the American steel producer.Shares of U.S. Steel fell 13 per cent after the comment in tra…",
    "link": "https://www.channelnewsasia.com/business/trump-says-he-does-not-want-see-us-steel-go-japan-5055881",
    "timestamp": "2025-04-09T21:01:49Z"
  },
  {
    "title": "U.S. stocks shoot to historic gains after Trump pauses most of his tariffs",
    "description": "The S&P 500 surged 9.5%, an amount that would count as a good year for the market. It had been sinking earlier in the day on worries that Trump’s trade war could drag the global economy into a recession. But then came the posting on social media that investor…",
    "link": "https://www.pbs.org/newshour/economy/u-s-stocks-shoot-to-historic-gains-after-trump-pauses-most-of-his-tariffs",
    "timestamp": "2025-04-09T21:01:06Z"
  },
  {
    "title": "DHS Revokes Status of Almost a Million Illegals Who Entered US Through CBP One App- Send Message Users Via App to  Leave “Immediately”",
    "description": "The Biden administration's use of the CBP app has led to significant changes, with nearly one million migrants now facing urgent deportation notices. This evolving immigration landscape raises critical questions about policy and enforcement.\nThe post DHS Revo…",
    "link": "https://www.thegatewaypundit.com/2025/04/dhs-revokes-status-almost-million-illegals-who-entered/",
    "timestamp": "2025-04-09T21:00:52Z"
  },
  {
    "title": "Adam Schiff Calls For Insider Trading Investigation into Trump Over Tariff Pause",
    "description": "Senator Adam Schiff tells TIME he is concerned Trump engaged in insider trading or market manipulation with his abrupt reversal of tariffs.",
    "link": "https://time.com/7276234/trump-tariff-insider-trading-schiff/",
    "timestamp": "2025-04-09T21:00:50Z"
  },
  {
    "title": "Bitcoin On The Brink As Trump Tariffs Shatter Bond Market",
    "description": "The bond market, often regarded as the bedrock of global financial stability, is showing signs of severe strain, with market participants on X sounding the alarm over what many are calling a “broken” system. Jim Bianco of Bianco Research, a prominent voice in…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-on-the-brink-trump-tariffs-shatter-bond-market/",
    "timestamp": "2025-04-09T21:00:26Z"
  },
  {
    "title": "Trump's Loyal and Wealthy Supporters Party at Mar-a-Lago in 'Distasteful' Affair Despite Nation in Shambles Over Tariffs Hike Chaos",
    "description": "Donald Trump's tariffs increase did not turn off his supporters enough as his most wealthiest pals gathered up at Mar-a-Lago to celebrate.",
    "link": "https://radaronline.com/p/trump-party-mar-a-lago-tariffs-hike-global-market/",
    "timestamp": "2025-04-09T21:00:00Z"
  },
  {
    "title": "National Unions Demand Release of Detained Immigrant Workers",
    "description": "“We have to take actions where we can show that we can win and that help overcome people’s fear.”",
    "link": "https://inthesetimes.com/article/national-unions-resist-trump-detention",
    "timestamp": "2025-04-09T21:00:00Z"
  },
  {
    "title": "'My beautiful hair!' Trump order aims to 'make America’s showers great again'",
    "description": "President Donald Trump ditched his traditional MAGA catchphrase to make way for a new slogan: “Make America’s showers great again.”The president on Wednesday signed an executive order rolling back Obama and Biden-era regulations he’s criticized as being respo…",
    "link": "https://www.rawstory.com/trump-showers/",
    "timestamp": "2025-04-09T20:59:18Z"
  },
  {
    "title": "Supreme Court Chief Justice Roberts swoops in to save Trump firing decision",
    "description": "Chief Justice John Roberts intervened to preserve the Trump administration's termination of two federal board members - a temporary win as the administration seeks to carve out the extent of the executive's power.",
    "link": "https://www.foxnews.com/politics/supreme-court-justice-roberts-trumps-firing-federal-board-members",
    "timestamp": "2025-04-09T20:58:51Z"
  },
  {
    "title": "US Postal Service seeks to hike cost of a first-class stamp to 78 cents",
    "description": "WASHINGTON (AP) — The U.S. Postal Service is seeking a rate increase this summer that includes hiking the cost of a first-class stamp from 73 cents to 78 cents. The request was made Wednesday to the Postal Regulatory Commission, which must OK the proposal. If…",
    "link": "https://financialpost.com/pmn/us-postal-service-seeks-to-hike-cost-of-a-first-class-stamp-to-78-cents",
    "timestamp": "2025-04-09T20:57:52Z"
  },
  {
    "title": "Republicans React to Donald Trump's 90-Day Pause on Reciprocal Tariffs",
    "description": "Republicans are reacting to the president's pause on most reciprocal tariffs on Wednesday.",
    "link": "https://www.newsweek.com/republicans-react-donald-trump-90-day-pause-reciprocal-tariffs-2057658",
    "timestamp": "2025-04-09T20:56:16Z"
  },
  {
    "title": "How quickly could Nintendo move Switch 2 production to the U.S.?",
    "description": "No stupid questions: If Nintendo wanted to avoid any hefty tariffs imposed by President Donald Trump, how quickly could it move Switch 2 production to the U.S.? Trump has done a partial walkback on the tariffs already, but let’s get hypothetical here. The sho…",
    "link": "https://www.polygon.com/nintendo-switch-2/555749/switch-2-america-usa-production-how-fast-tariffs",
    "timestamp": "2025-04-09T20:55:49Z"
  },
  {
    "title": "France could recognise Palestinian state ‘in June’: Macron",
    "description": "France plans to recognise a Palestinian state within months and could make the move at a UN conference in New York in June on settling the Israel-Palestinian conflict, President Emmanuel Macron said in an interview broadcast Wednesday. “We must move towards r…",
    "link": "https://www.digitaljournal.com/world/france-could-recognise-palestinian-state-in-june-macron/article",
    "timestamp": "2025-04-09T20:55:16Z"
  },
  {
    "title": "House votes to overturn Biden-era rule limiting bank overdraft fees to $5, sends to Trump to sign",
    "description": "NEW YORK (AP) — The House voted Wednesday to overturn a rule that would have limited bank overdraft fees to $5, following the Senate in moving to dismantle the regulation that the Biden administration had estimated would save consumers billions of dollars. Th…",
    "link": "https://financialpost.com/pmn/house-votes-to-overturn-biden-era-rule-limiting-bank-overdraft-fees-to-5-sends-to-trump-to-sign",
    "timestamp": "2025-04-09T20:55:03Z"
  },
  {
    "title": "House votes to overturn Biden-era rule limiting bank overdraft fees to $5, sends to Trump to sign",
    "description": "The House has voted to overturn a rule that would have limited bank overdraft fees to $5, following the Senate in moving to dismantle the Biden-era regulation that the Consumer Financial Protection Bureau had estimated would save consumers billions of ...",
    "link": "https://abcnews.go.com/US/wireStory/house-votes-overturn-biden-era-rule-limiting-bank-120656836",
    "timestamp": "2025-04-09T20:54:51Z"
  },
  {
    "title": "U.S. exits carbon talks on shipping, urges others to follow",
    "description": "The U.S. says it rejects efforts to impose economic measures against its ships, leaving IMO talks to continue despite the country's withdrawal.",
    "link": "https://www.cbc.ca/news/climate/us-exits-imo-climate-talks-1.7506053",
    "timestamp": "2025-04-09T20:54:50Z"
  },
  {
    "title": "New task force to review US intelligence agencies and consider declassifying COVID-19 material",
    "description": "Director of National Intelligence Tulsi Gabbard says she has formed a task force to consider big changes to America's spy agencies",
    "link": "https://abcnews.go.com/US/wireStory/new-task-force-review-us-intelligence-agencies-declassifying-120656835",
    "timestamp": "2025-04-09T20:54:47Z"
  },
  {
    "title": "The United States and China are locked in a faceoff over tariffs. No one wants to blink first",
    "description": "The rounds of escalation have raised concerns that the window for diplomacy has further narrowed.",
    "link": "https://www.bostonherald.com/2025/04/09/us-china-tariff-spiral/",
    "timestamp": "2025-04-09T20:54:01Z"
  },
  {
    "title": "Trump halts most tariffs on all but China as Wall Street rockets back",
    "description": "The president declared that he’d “authorized a 90-day PAUSE, and a substantially lowered Reciprocal Tariff during this period, of 10%, also effective immediately.”",
    "link": "https://www.bostonherald.com/2025/04/09/trump-halts-most-tariffs-on-all-but-china-as-wall-street-rockets-back/",
    "timestamp": "2025-04-09T20:53:53Z"
  },
  {
    "title": "Trump official creates confusion by saying Canadian goods would face 10% tariff",
    "description": "A member of U.S. President Donald Trump's administration appears to have slipped up when he said that Canada would be getting hit with an additional 10 per cent tariff.",
    "link": "https://www.cbc.ca/news/politics/trump-official-canada-baseline-tariff-1.7506155",
    "timestamp": "2025-04-09T20:53:22Z"
  },
  {
    "title": "Behind Trump’s tariff pause: A quiet Republican lobbying campaign",
    "description": "The News\nAllies of President Donald Trump, including at least three Republican senators, urged him directly this week to shift his strategy and edge away from his tariff regime by using it as leverage with other nations.\nIt seems that Trump was listening.\nAft…",
    "link": "https://biztoc.com/x/796d2a77eb652a81",
    "timestamp": "2025-04-09T20:53:21Z"
  },
  {
    "title": "Mike Pence Reacts to Trump's Pivot on Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's former Vice President Mike Pence reacted to news that Trump has temporarily reversed course on initiating sweeping tariffs to numerous trading partners calling the adjustment \"a win fo…",
    "link": "https://biztoc.com/x/fd2ff30ccf1a681e",
    "timestamp": "2025-04-09T20:53:14Z"
  },
  {
    "title": "Trump says military solution against Iran possible",
    "description": "United States President Donald Trump told reporters at the Oval Office on Wednesday that military action against Iran was \"absolutely\" possible if Tehran refused to negotiate a nuclear deal. More to c...",
    "link": "https://biztoc.com/x/59fe9a99982dd9be",
    "timestamp": "2025-04-09T20:53:05Z"
  },
  {
    "title": "Could the iPhone's Price Double With Trump's New 125% Tariff? We Do the Math",
    "description": "Trump dumped other countries' tariffs for now but bumped China up to 125%. Experts advise against panic-buying if it puts you in debt.",
    "link": "https://www.cnet.com/personal-finance/banking/could-the-iphones-price-double-with-trumps-new-125-tariff-we-do-the-math/",
    "timestamp": "2025-04-09T20:53:05Z"
  },
  {
    "title": "Trump 'didn't expect' such market impact of tariff pause",
    "description": "United States President Donald Trump said on Wednesday that he did not expect his decision to pause reciprocal tariffs on most countries for 90 days to have \"such an impact\" on the stock market.Trump ...",
    "link": "https://biztoc.com/x/c592ecb93e92a882",
    "timestamp": "2025-04-09T20:53:04Z"
  },
  {
    "title": "Apple has best day since 1998 on Trump's 90-day tariff pause",
    "description": "Apple shares skyrocketed 15% on Wednesday after President Donald Trump announced a 90-day pause on his administration's \"reciprocal tariffs,\" which would have affected the company's production locations in Vietnam, India, and Thailand.\nThe rally added over $4…",
    "link": "https://biztoc.com/x/e56530359d423371",
    "timestamp": "2025-04-09T20:52:59Z"
  },
  {
    "title": "Trump open to meeting Xi Jinping",
    "description": "United States President Donald Trump expressed willingness on Wednesday to engage in discussions with Chinese President Xi Jinping regarding trade tariffs.\"Sure, he is a friend of mine. I like Xi Jinp...",
    "link": "https://biztoc.com/x/9b65d35f1b4a815d",
    "timestamp": "2025-04-09T20:52:58Z"
  },
  {
    "title": "Trump and the Favoritism Grift",
    "description": "Nathan Heller on Donald Trump’s view that all policy is personal, and why institutions don’t have to play his game.",
    "link": "https://www.newyorker.com/news/the-lede/trump-and-the-favoritism-grift",
    "timestamp": "2025-04-09T20:52:36Z"
  },
  {
    "title": "More market chaos could come in hot this week",
    "description": "For weeks, investors' main focus has been how Trump's wide-reaching tariffs will impact economic growth.",
    "link": "https://www.businessinsider.com/more-market-chaos-could-come-in-hot-this-week-2025-4",
    "timestamp": "2025-04-09T20:52:09Z"
  },
  {
    "title": "Trade Official Learning of Trump's Tariff Pause Captured on Photo: 'This Is Amateur Hour'",
    "description": "A photo of Trump administration trade representative Jamieson Greer looking baffled as he finds out that President Donald Trump changed his mind on reciprocal tariffs in the middle of a congressional hearing is making rounds on social media.",
    "link": "https://www.ibtimes.com/trade-official-learning-trumps-tariff-pause-captured-photo-this-amateur-hour-3769471",
    "timestamp": "2025-04-09T20:52:05Z"
  },
  {
    "title": "House votes to overturn Biden-era rule limiting bank overdraft fees to $5, sends to Trump to sign",
    "description": "The House voted Wednesday to overturn a rule that would have limited bank overdraft fees to $5, following the Senate in moving to dismantle the regulation...",
    "link": "https://finance.yahoo.com/news/house-votes-overturn-biden-era-205100869.html",
    "timestamp": "2025-04-09T20:51:00Z"
  },
  {
    "title": "Kanye West Says 3 Incidents Kepy Him From Playing Super Bowl",
    "description": "The rapper rattled off several incidents in an X post, noting they all happened before he \"went full Nazi.\"",
    "link": "https://www.huffpost.com/entry/kanye-west-blames-scandals-super-bowl_n_67f6998ae4b0212bce8647c5",
    "timestamp": "2025-04-09T20:50:30Z"
  },
  {
    "title": "'Guilty of treason': Trump orders DOJ to investigate 'anonymous' staffer from first term",
    "description": "President Donald Trump ordered the Department of Justice to investigate Miles Taylor, a member of his first administration who wrote a New York Times op-ed under the pseudonym \"Anonymous\" claiming to be a member of the so-called resistance.\"What this presiden…",
    "link": "https://www.rawstory.com/miles-taylor-donald-trump/",
    "timestamp": "2025-04-09T20:50:19Z"
  },
  {
    "title": "Unchecked: Rep. Ayanna Pressley on the President’s Power Grab",
    "description": "A conversation with the Massachusetts congresswoman on challenging executive authority and the ICE abduction of Rümeysa Öztürk.\nThe post Unchecked: Rep. Ayanna Pressley on the President’s Power Grab appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/09/briefing-podcast-ayanna-pressley-rumeysa-ozturk/",
    "timestamp": "2025-04-09T20:50:00Z"
  },
  {
    "title": "The Cost of Chaos",
    "description": "The Liberation Day pause is better than the Liberation Day policy itself was. But Americans are getting a raw deal one way or another.",
    "link": "https://www.theatlantic.com/economy/archive/2025/04/deal-tariffs-economy-trump-market/682379/",
    "timestamp": "2025-04-09T20:50:00Z"
  },
  {
    "title": "Behar: Trump Destroying the Economy to Make Himself ‘Dictator’ Through Martial Law",
    "description": "Joy Behar told her co-hosts Wednesday on ABC's \"The View\" that President Donald Trump is intentionally destroying the U.S. economy to cause chaos so he can declare martial law and become a dictator.\nThe post Behar: Trump Destroying the Economy to Make Himself…",
    "link": "https://www.breitbart.com/clips/2025/04/09/behar-trump-destroying-the-economy-to-make-himself-dictator-through-martial-law/",
    "timestamp": "2025-04-09T20:49:40Z"
  },
  {
    "title": "Wall Street soars on Trump tariff pause",
    "description": "NEW YORK; Wall Street stocks rocketed to close solidly higher on Wednesday (Apr 9), with dramatic advances on all three major indexes as United States President Donald Trump delayed steep new tariffs hours after they",
    "link": "https://www.channelnewsasia.com/business/wall-street-soars-trump-tariffs-dow-jones-sp-500-nasdaq-5055841",
    "timestamp": "2025-04-09T20:49:00Z"
  },
  {
    "title": "Wall Street soars on Trump tariff pause",
    "description": "NEW YORK; Wall Street stocks rocketed to close solidly higher Wednesday (Apr 9), with dramatic advances on all three major indexes as US President Donald Trump delayed steep new tariffs hours after they took effect",
    "link": "https://www.channelnewsasia.com/business/wall-street-soars-trump-tariff-pause-5055841",
    "timestamp": "2025-04-09T20:49:00Z"
  },
  {
    "title": "Trump Border Czar: ICE’s Word Is Enough to Prove Someone’s a Gang Member",
    "description": "Hundreds of recently deported immigrants were labeled as gang members despite having no criminal histories.",
    "link": "https://truthout.org/articles/trump-border-czar-ices-word-is-enough-to-prove-someones-a-gang-member/",
    "timestamp": "2025-04-09T20:48:42Z"
  },
  {
    "title": "Nike, Walmart jump on 90-day tariff pause for key suppliers",
    "description": "Retail stocks soared after Donald Trump said he’ll pause tariffs for 90 days for nations that haven’t imposed retaliatory tariffs. Read on",
    "link": "https://financialpost.com/news/retail-marketing/nike-walmart-jump-on-90-day-tariff-pause",
    "timestamp": "2025-04-09T20:48:42Z"
  },
  {
    "title": "CNBC Host Hammers Trump Over Tariff Plan ‘Made Up’ on the Fly: ‘There Are Still Trillions Lost’",
    "description": "\"...you could see this as a failure of policy and leadership on the part of the White House.\"\nThe post CNBC Host Hammers Trump Over Tariff Plan ‘Made Up’ on the Fly: ‘There Are Still Trillions Lost’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/cnbc-host-hammers-trump-over-tariff-plan-made-up-on-the-fly-there-are-still-trillions-lost/",
    "timestamp": "2025-04-09T20:47:27Z"
  },
  {
    "title": "The United States and China are locked in a faceoff over tariffs. No one wants to blink first",
    "description": "The tariff fight between the world’s two largest economies has spiraled into greater peril",
    "link": "https://abcnews.go.com/US/wireStory/united-states-china-locked-faceoff-tariffs-blink-120656265",
    "timestamp": "2025-04-09T20:46:44Z"
  },
  {
    "title": "Apple has best day since 1998 on Trump's 90-day tariff pause",
    "description": "Apple shares soared 15% on Wednesday, their seventh-best day on record.",
    "link": "https://www.cnbc.com/2025/04/09/apple-has-best-day-since-1998-on-trumps-90-day-tariff-pause.html",
    "timestamp": "2025-04-09T20:46:30Z"
  },
  {
    "title": "Kamala Harris launched ‘dark-arts operation’ against opponents for VP spot in 2020, new book claims",
    "description": "‘We stabbed Gretchen Whitmer,' one Harris advisor reportedly said.",
    "link": "https://nypost.com/2025/04/09/media/kamala-harris-launched-dark-arts-operation-for-vp-spot-in-2020-book/",
    "timestamp": "2025-04-09T20:46:18Z"
  },
  {
    "title": "How major US stock indexes fared Wednesday, 4/9/2025",
    "description": "Stocks surged to one of their biggest gains since World War II after President Donald Trump backed off his tariffs on most nations for 90 days even as he further jacked up the tax rate on Chinese imports",
    "link": "https://abcnews.go.com/Business/wireStory/major-us-stock-indexes-fared-wednesday-492025-120655995",
    "timestamp": "2025-04-09T20:46:01Z"
  },
  {
    "title": "Unpacking claim Trump asked freed Israeli hostages if Hamas showed 'sign of love' as happened 'in Germany'",
    "description": "Trump did not say \"Nazis treated Jewish prisoners with love\" but suggested they'd shown more \"love or affection\" than Hamas showed its hostages",
    "link": "https://www.snopes.com//news/2025/04/09/trump-germany-hamas/",
    "timestamp": "2025-04-09T20:45:00Z"
  },
  {
    "title": "Mike Pence Reacts to Trump's Pivot on Tariffs",
    "description": "Pence has had an icy relationship with Trump since serving as his vice president during his first White House term.",
    "link": "https://www.newsweek.com/mike-pence-reacts-trumps-pivot-tariffs-2057675",
    "timestamp": "2025-04-09T20:44:52Z"
  },
  {
    "title": "Washington’s Leading Tax Cut Advocates Cheer Trump’s Tariffs Pause",
    "description": "Minutes after President Donald Trump’s announcement of a 90-day pause on most of the tariffs he had imposed, Washington’s most prominent tax-cut advocates cheered the... Read More\nThe post Washington’s Leading Tax Cut Advocates Cheer Trump’s Tariffs Pause app…",
    "link": "https://www.dailysignal.com/2025/04/09/washingtons-leading-tax-cut-advocates-cheer-trumps-tariffs-pause/",
    "timestamp": "2025-04-09T20:44:05Z"
  },
  {
    "title": "Feature: Palestinians reject Trump's relocation proposals, vow to remain in Gaza despite hardships",
    "description": "GAZA, April 9 (Xinhua) -- In the southern Gaza Strip town of Khuza'a, 41-year-old Hussam Dalloul Qudeih contemplated his future as he watched the sunset from a school-turned-shelter, with the ongoing Israeli war affecting every aspect of his life. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/feature-palestinians-reject-trump039s-relocation-proposals-vow-to-remain-in-gaza-despite-hardships",
    "timestamp": "2025-04-09T20:43:00Z"
  },
  {
    "title": "Trump tariffs: The No. 1 way you can prepare for uncertainty, says self-made millionaire—'I'm building a war chest'",
    "description": "With President Donald Trump's tariffs threatening to increase prices on numerous goods, many consumers are holding their breath to see what purchases they should put off or how their fixed costs may change in the coming months.\nAmid ongoing uncertainty, it's …",
    "link": "https://biztoc.com/x/81a37880999bc9c0",
    "timestamp": "2025-04-09T20:42:35Z"
  },
  {
    "title": "Would-Be Trump Assassin Sought Rocket Launcher, Stinger Missiles From Ukraine",
    "description": "Would-Be Trump Assassin Sought Rocket Launcher, Stinger Missiles From Ukraine\n \nThe second assassination attempt on Donald Trump was even more forgotten about and buried by the mainstream media than the first one. Presidential candidate Trump was playing golf…",
    "link": "https://biztoc.com/x/3a763cc7c5984460",
    "timestamp": "2025-04-09T20:42:29Z"
  },
  {
    "title": "Trump Partially Pauses \"Liberation Day\" Tariffs",
    "description": "President Donald Trump signed two executive orders on April 2 instituting tariffs on a wide range of countries. ( Andrew Leyden/ZUMAPRESS/Newscom) \n \nToday, Donald Trump partially paused his massive new \"Liberation Day\" tariffs. However, a whopping 10% tariff…",
    "link": "https://biztoc.com/x/cf200115e74a1b4a",
    "timestamp": "2025-04-09T20:42:29Z"
  },
  {
    "title": "Retail Stocks Rally On Tariff Pause: What's Going On?",
    "description": "Retail stocks such as Capri Holdings Limited (NYSE:CPRI) and Ralph Lauren Corp (NYSE:RL) are up Wednesday after President Donald Trump announced a 90-day suspension on reciprocal tariffs for countries that have not retaliated against the U.S., easing trade te…",
    "link": "https://biztoc.com/x/f5f89c26eded620c",
    "timestamp": "2025-04-09T20:42:16Z"
  },
  {
    "title": "Markets Rally as Trump Pauses Tariffs. Should Presidents Have This Much Power?",
    "description": "Last week, President Donald Trump imposed double-digit tariffs on imports from nearly every nation on the planet. The move spooked investors, and the markets plummeted in response. Then this week, Trump announced a 90-day pause on most of the tariffs, at whic…",
    "link": "https://biztoc.com/x/01d1a538c987ea42",
    "timestamp": "2025-04-09T20:42:13Z"
  },
  {
    "title": "Trump open to meet with Xi Jinping",
    "description": "United States President Donald Trump insisted on Wednesday that he is open to meeting with Chinese President Xi Jinping to discuss tariffs.More to come......",
    "link": "https://biztoc.com/x/0a7d2680758a842b",
    "timestamp": "2025-04-09T20:42:09Z"
  },
  {
    "title": "Trump says China 'not thrilled' about TikTok bill",
    "description": "United States President Donald Trump addressed mounting tensions over the pending TikTok bill on Wednesday, suggesting China is \"not exactly thrilled\" about the legislation.Speaking from the Oval Offi...",
    "link": "https://biztoc.com/x/43cd7089c987395a",
    "timestamp": "2025-04-09T20:42:08Z"
  },
  {
    "title": "Lutnick: EU only threatened with tariffs",
    "description": "United States President Donald Trump and other officials from his administration gathered at the Oval Office on Wednesday as he signed executive orders and answered journalists' questions.When asked w...",
    "link": "https://biztoc.com/x/cb241cddadfdc5ad",
    "timestamp": "2025-04-09T20:42:08Z"
  },
  {
    "title": "US tariffs on Mexico and Canada unaffected by 90-day pause, White House official says",
    "description": "WASHINGTON (Reuters) - The U.S. tariffs on goods imported from Mexico and Canada will not be affected by the 90-day pause on tariffs announced by President Donald Trump on Wednesday, a White House official said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/us-tariffs-on-mexico-and-canada-unaffected-by-90-day-pause-white-house-official-says",
    "timestamp": "2025-04-09T20:42:00Z"
  }
]