[
  {
    "title": "EXCLUSIVE: Newly Renamed MSNBC's Live Gabfest Ticket Sales Flop as Shine Comes Off Anti-Donald Trump Crusaders — 'Shaping Up to Be a Disaster'",
    "description": "Ticket sales for the event seem to be suffering the same loss of interest as the network itself",
    "link": "https://radaronline.com/p/msnbc-live-fan-fest-ticket-sales-donald-trump-new-name/",
    "timestamp": "2025-08-19T18:45:00Z"
  },
  {
    "title": "Ousted DOJ Lawyer Says Bondi Appointees Let Corporate Lobbyists 'Rule' Over Antitrust Enforcement",
    "description": "An antitrust lawyer fired from the US Department of Justice last month accused Attorney General Pam Bondi's underlings on Monday of giving MAGA-aligned corporate lobbyists the ability to \"rule\" over antitrust enforcement.Roger Alford, formerly the deputy assi…",
    "link": "https://www.commondreams.org/news/bondi-lobbyists-antitrust",
    "timestamp": "2025-08-19T18:44:00Z"
  },
  {
    "title": "Appeals court says NLRB structure unconstitutional, in a win for SpaceX | TechCrunch",
    "description": "Appeals court says NLRB structure unconstitutional, in a win for SpaceX | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2025/08/19/appeals-court-says-nlrb-structure-unconstitutional-in-a-win-for-spacex/",
    "timestamp": "2025-08-19T18:43:53Z"
  },
  {
    "title": "Kid Rock Slams Gavin Newsom For Trolling Him, Trump",
    "description": "Kid Rock responded Tuesday to Democratic California Gov. Gavin Newsom after the politician's press office publicly trolled him on X.",
    "link": "https://dailycaller.com/2025/08/19/kid-rock-slams-gavin-newsom-trolling-trump/",
    "timestamp": "2025-08-19T18:43:12Z"
  },
  {
    "title": "Trump National Doral Makes Comeback To PGA Tour",
    "description": "Trump National Doral is making a return to the PGA Tour in 2026 with a signature event being branded the Miami Championship. God bless America.",
    "link": "https://dailycaller.com/2025/08/19/trump-national-doral-pga-tour-golf-2026/",
    "timestamp": "2025-08-19T18:43:11Z"
  },
  {
    "title": "‘You Don’t Do That!’ Trump Blames U.S. Ally For ‘Taking On’ Country That Attacked Them In New Fox Interview",
    "description": "Trump suggested that Ukraine was to blame for the war with Russia, telling Fox News that \"You don't take on a nation that's 10 times your size!\"\nThe post ‘You Don’t Do That!’ Trump Blames U.S. Ally For ‘Taking On’ Country That Attacked Them In New Fox Intervi…",
    "link": "https://www.mediaite.com/media/tv/you-dont-do-that-trump-blames-u-s-ally-for-taking-on-country-that-attacked-them-in-new-fox-interview/",
    "timestamp": "2025-08-19T18:42:54Z"
  },
  {
    "title": "FactChecking Trump’s Claims About Mail-In Ballots, Voting Machines and States’ Role",
    "description": "President Donald Trump launched his second-term assault on mail-in ballots and electronic voting machines on Aug. 18, firing off a series of unfounded claims while announcing an effort to do away with both.\nThe post FactChecking Trump’s Claims About Mail-In B…",
    "link": "https://www.factcheck.org/2025/08/factchecking-trumps-claims-about-mail-in-ballots-voting-machines-and-states-role/",
    "timestamp": "2025-08-19T18:41:58Z"
  },
  {
    "title": "Trump Targets Mail-In Voting, and the Democrats Phone in Their Counter-Strategies",
    "description": "Chris Lehmann\n\n\n\nTrump has launched an all-out assault on civic freedoms, but the Democrats aren’t yet giving their base something to vote for.\r\n\n\r\n\n\nThe post Trump Targets Mail-In Voting, and the Democrats Phone in Their Counter-Strategies appeared first on …",
    "link": "https://www.thenation.com/article/politics/trump-mail-voting-democrats-counter-strategies/",
    "timestamp": "2025-08-19T18:41:35Z"
  },
  {
    "title": "Indian Prime Minister Modi hails progress made with China",
    "description": "Indian Prime Minister Narendra Modi is set to attend the Shanghai Cooperation Organization (SCO) summit at the end of August. It follows his meeting China's Foreign Minister Wang Yi in New Delhi this week.",
    "link": "https://www.dw.com/en/indian-prime-minister-modi-hails-progress-made-with-china/a-73696243",
    "timestamp": "2025-08-19T18:39:00Z"
  },
  {
    "title": "UK Will No Longer Force Apple Backdoor Access",
    "description": "The U.K. has stepped back from demanding that Apple build a so-called backdoor for accessing encrypted data belonging to U.S. citizens.\nThe post UK Will No Longer Force Apple Backdoor Access first appeared on iPhone in Canada.",
    "link": "https://www.iphoneincanada.ca/2025/08/19/uk-no-longer-forcing-apple-backdoor-access/",
    "timestamp": "2025-08-19T18:38:47Z"
  },
  {
    "title": "Karoline Leavitt Accidentally Blows Up Trump’s Supposed Ukraine Win",
    "description": "White House press secretary Karoline Leavitt was forced Tuesday to walk back Donald Trump’s claim that he had gotten Russian President Vladimir Putin to agree to meet with Ukrainian President Volodymyr Zelenskiy.Delivering a readout at a White House press bri…",
    "link": "https://newrepublic.com/post/199280/karoline-leavitt-donald-trump-putin-ukraine-meeting",
    "timestamp": "2025-08-19T18:38:16Z"
  },
  {
    "title": "Trump Has DC So Locked Down, Even Fox News’ Bret Baier Was Pulled Over By Police",
    "description": "Fox News host Bret Baier was pulled over and ticked by a Metropolitan Police Department (MPD) officer in video that surfaced on social media Tuesday.",
    "link": "https://dailycaller.com/2025/08/19/trump-has-dc-so-locked-down-even-fox-news-bret-baier-was-pulled-over-by-police/",
    "timestamp": "2025-08-19T18:38:04Z"
  },
  {
    "title": "Why Trump’s ‘joke’ about postponing the 2028 elections really wasn’t funny",
    "description": "Given Donald Trump's record, when he jokes about postponing the 2028 elections, it's awfully tough to laugh.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-postpone-2028-election-zelenskyy-joke-dictator-rcna225893",
    "timestamp": "2025-08-19T18:37:18Z"
  },
  {
    "title": "Dem Texas lawmaker spends night on state House floor after refusing GOP-mandated police escort",
    "description": "A state lawmaker has refused to leave the Texas Capitol as Republicans use police to prevent Democrats from fleeing the state over a redistricting vote.",
    "link": "https://www.foxnews.com/politics/dem-texas-lawmaker-spends-night-state-house-floor-after-refusing-gop-mandated-police-escort",
    "timestamp": "2025-08-19T18:37:01Z"
  },
  {
    "title": "During inspection of his most powerful warship, Kim Jong Un denounces South Korea-U.S. military drills",
    "description": "North Korean leader Kim Jong Un has condemned South Korean-U.S. military drills and vowed to expand his nuclear forces rapidly.",
    "link": "https://www.pbs.org/newshour/world/during-inspection-of-his-most-powerful-warship-kim-jong-un-denounces-south-korea-u-s-military-drills",
    "timestamp": "2025-08-19T18:36:58Z"
  },
  {
    "title": "Trump signs bill to improve export control transparency",
    "description": "United States President Donald Trump signed a bill on Tuesday to enhance transparency and oversight on US government export regulations. \"H.R. 1316, the 'Maintaining American Superiority by Improving...",
    "link": "https://biztoc.com/x/76c8e2726759779c",
    "timestamp": "2025-08-19T18:36:30Z"
  },
  {
    "title": "Russia Responds To Washington Talks With Mass Drone And Missile Strikes On Ukraine",
    "description": "Russia launched 270 drones and 10 missiles against Ukraine on August 19, in a kinetic response to Ukrainian President Volodymyr Zelenskyy's White House talks with US President Donald Trump and key European allies. Ukrainian regional officials said that over 2…",
    "link": "https://freerepublic.com/focus/f-news/4335481/posts",
    "timestamp": "2025-08-19T18:36:17Z"
  },
  {
    "title": "Gas prices hold steady, expected to remain below last year's average",
    "description": "INDIANAPOLIS (WISH) — The cost for traveling in your car may be going down, but the same can’t be said for booking a flight. Tuesday’s edition of On the Money with Jane King shares all the news that’s likely to effect your wallet. Gas prices below average Lab…",
    "link": "https://www.wishtv.com/news/business/gas-prices-hold-steady-expected-to-remain-below-last-years-average/",
    "timestamp": "2025-08-19T18:36:03Z"
  },
  {
    "title": "Trump putting ‘tremendous pressure’ on Russia — by hitting India: Karoline Leavitt",
    "description": "White House Press Secretary Karoline Leavitt told reporters at a Tuesday press briefing that President Donald Trump is putting \"tremendous public pressure\" on Russia to end its war against Ukraine. Her example was \"sanctions on India.\" \"Look, the president ha…",
    "link": "https://www.rawstory.com/trump-russia-2673901288/",
    "timestamp": "2025-08-19T18:35:21Z"
  },
  {
    "title": "Erdoğan, NATO chief discuss process between Ukraine, Russia",
    "description": "President Recep Tayyip Erdogan and NATO Secretary General Mark Rutte on Tuesday evening discussed the latest developments in the peace process between Russia and Ukraine in a call made by Rutte, said Türkiye's Communications Directorate on Turkish social medi…",
    "link": "https://www.hurriyetdailynews.com/turkiye-to-host-nato-summit-in-july-2026-212691",
    "timestamp": "2025-08-19T18:35:00Z"
  },
  {
    "title": "Donald Trump rules out US peacekeepers in Ukraine security guarantee",
    "description": "Kyiv says White House talks marked ‘significant step’ but Russia opposes western troops in Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/08/19/donald-trump-rules-out-us-peacekeepers-in-ukraine-security-guarantee/",
    "timestamp": "2025-08-19T18:34:25Z"
  },
  {
    "title": "The Heroine We Need: Texas Rep. Nicole Collier Slept On House Floor After Refusing Escort, Fights Racist Republican Redistricting",
    "description": "Rep. Nicole Collier sleeps on House floor in defiance to Republican mandated permission slips for any member who wants to leave the chambers\nThe post The Heroine We Need: Texas Rep. Nicole Collier Slept On House Floor After Refusing Escort, Fights Racist Repu…",
    "link": "https://bossip.com/3784185/rep-nicole-collier-sleeps-on-house-floor/",
    "timestamp": "2025-08-19T18:34:25Z"
  },
  {
    "title": "Trump administration threatens to cut New York transit funds over safety",
    "description": "The US Department of Transportation has given the MTA 30 days to come up with a plan to address transit worker safety.",
    "link": "https://www.aljazeera.com/news/2025/8/19/trump-administration-threatens-to-cut-new-york-transit-funds-over-safety",
    "timestamp": "2025-08-19T18:32:31Z"
  },
  {
    "title": "Wall Street falls, European shares rise as investors digest Ukraine peace efforts",
    "description": "Declines in Nvidia and other heavyweight AI stocks pulled New York indices down",
    "link": "https://www.irishtimes.com/business/2025/08/19/wall-street-falls-european-shares-rise-as-investors-digest-ukraine-peace-efforts/",
    "timestamp": "2025-08-19T18:32:28Z"
  },
  {
    "title": "DC unemployment rate is the highest in the US for the third straight month",
    "description": "D.C.’s jobless rate reached 6% in July, a reflection of the mass layoffs of federal workers.",
    "link": "https://www.bostonherald.com/2025/08/19/dc-unemployment-rate-july/",
    "timestamp": "2025-08-19T18:31:06Z"
  },
  {
    "title": "EXCLUSIVE: Medicaid directs states to crack down on illegal immigrant enrollees with monthly checks",
    "description": "Trump administration expands efforts to prevent illegal immigrants from receiving public health benefits through a new initiative that establishes monthly verification.",
    "link": "https://www.foxnews.com/politics/exclusive-medicaid-directs-states-crack-down-illegal-immigrant-enrollees-monthly-checks",
    "timestamp": "2025-08-19T18:30:14Z"
  },
  {
    "title": "IDF displacement orders suggest Israel's ultimate plan for Gaza",
    "description": "By stitching together the so-called \"evacuation orders\" issued by the Israel Defense Forces, it is possible to see just how much of Gaza Israel has already taken.",
    "link": "https://www.abc.net.au/news/2025-08-20/israel-evacuation-orders-across-gaza-redraw-map/105630686",
    "timestamp": "2025-08-19T18:30:02Z"
  },
  {
    "title": "Trump's Desperate Bid To Get Into Heaven: Prez Admits He Won't See The Pearly Gates Unless He Ends Ukraine War In Latest Disturbing Rant",
    "description": "Donald Trump is a man on a mission: and the goal of that mission is to get into heaven by any means necessary.",
    "link": "https://radaronline.com/p/trump-heaven-pearly-gates-totem-pole-ukraine-russia-war/",
    "timestamp": "2025-08-19T18:30:00Z"
  },
  {
    "title": "Justice Department is investigating whether D.C. police manipulated crime data",
    "description": "The Justice Department is investigating whether Washington, D.C. police manipulated crime data to make the crime rates appear lower than they really are in the city, two senior law enforcement officials confirmed to NBC News",
    "link": "https://www.nbcnews.com/politics/justice-department/justice-department-investigating-whether-dc-police-manipulated-crime-d-rcna225886",
    "timestamp": "2025-08-19T18:26:46Z"
  },
  {
    "title": "Here's Why Trump Wants a Stake in Intel",
    "description": "US Commerce Secretary Howard Lutnick says Trump wants a 'good return' for American taxpayers. Subsidies under the CHIPS Act are 'just a giveaway to rich companies,' he argues.\nDon't miss out on our latest stories. Add PCMag as a preferred source on Google.US …",
    "link": "https://me.pcmag.com/en/processors/31778/heres-why-trump-wants-a-stake-in-intel",
    "timestamp": "2025-08-19T18:25:30Z"
  },
  {
    "title": "Here's Why Trump Wants a Stake in Intel",
    "description": "US Commerce Secretary Howard Lutnick says Trump wants a 'good return' for American taxpayers. Subsidies under the CHIPS Act are 'just a giveaway to rich companies,' he argues.\nDon't miss out on our latest stories. Add PCMag as a preferred source on Google.US …",
    "link": "https://uk.pcmag.com/processors/159647/heres-why-trump-wants-a-stake-in-intel",
    "timestamp": "2025-08-19T18:25:30Z"
  },
  {
    "title": "A federal court took 2 years to figure out that gay people have First Amendment rights",
    "description": "Spectrum WT v. Wendler is one of the easiest First Amendment cases the federal courts heard this year — or in any other year. The question is whether a government official can ban drag shows. The obvious answer to this question is no. The government cannot ba…",
    "link": "https://www.vox.com/lgbtq/458545/a-federal-court-took-2-years-to-figure-out-that-gay-people-have-first-amendment-rights",
    "timestamp": "2025-08-19T18:25:26Z"
  },
  {
    "title": "White House Says UK Abandons Effort to Access Apple User Data",
    "description": "The United States said the United Kingdom will end its effort to access U.S. Apple users’ encrypted data.\n \n [contact-form-7]\n \n \nTulsi Gabbard, U.S. director of national intelligence, said in a post on social platform X Monday (Aug. 18) that she, President D…",
    "link": "https://biztoc.com/x/9de370c0a8f10cf2",
    "timestamp": "2025-08-19T18:25:11Z"
  },
  {
    "title": "Justice Delayed: New York Appellate Court Reportedly Split Over Trump Civil Fraud Judgment",
    "description": "Justice Delayed: New York Appellate Court Reportedly Split Over Trump Civil Fraud Judgment\n \nAuthored by Jonathan Turley,\nSome of us have expressed frustration with the ridiculous delay in the appellate court review of the absurd civil judgment against Donald…",
    "link": "https://biztoc.com/x/9c92cb6272ec7774",
    "timestamp": "2025-08-19T18:25:05Z"
  },
  {
    "title": "Boeing Is Quietly Building Self-Piloting Submarines: Here's Why",
    "description": "The aerospace manufacturing giant makes more than just planes. Among its many projects, it has developed a line of autonomous uncrewed underwater vehicles.",
    "link": "https://www.jalopnik.com/1944170/boeing-autonomous-submarines/",
    "timestamp": "2025-08-19T18:25:00Z"
  },
  {
    "title": "Trump weaponization czar urged New York AG James to resign over mortgage probe",
    "description": "Letitia James' lawyer said the request defied Justice Department standards and codes.",
    "link": "https://www.bostonherald.com/2025/08/19/letitia-james-trump/",
    "timestamp": "2025-08-19T18:24:26Z"
  },
  {
    "title": "Jack White Slams Trump's Oval Office Decorations: \"What an Embarrassment to American History\"",
    "description": "Jack White has some more words to share against \"fucking fascist\" Donald Trump, whom he has repeatedly spoken out against",
    "link": "https://exclaim.ca/music/article/jack-white-slams-trump-s-oval-office-decorations-what-an-embarrassment-to-american-history",
    "timestamp": "2025-08-19T18:23:48Z"
  },
  {
    "title": "UK shelves plan to access US user data from Apple",
    "description": "The dispute surfaced at the start of the year with a news report that British security officials had issued the US tech giant with a secret order requiring the creation of backdoor access to view fully encrypted material. Apple challenged the order, which rai…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/uk-shelves-plan-to-access-us-user-data-from-apple/articleshow/123393654.cms",
    "timestamp": "2025-08-19T18:22:50Z"
  },
  {
    "title": "Canadian defence firm to make ballistic steel through Swedish partnership",
    "description": "OTTAWA — Canadian defence manufacturer Roshel is partnering with a Swedish steel company so it can produce ballistic-protection steel domestically for the first time. Roshel, which manufactures vehicles, will now be able to use Swebor’s intellectual property …",
    "link": "https://financialpost.com/pmn/canadian-defence-firm-to-make-ballistic-steel-through-swedish-partnership",
    "timestamp": "2025-08-19T18:22:13Z"
  },
  {
    "title": "Karoline Leavitt Cuts Off Fox’s Jacqui Heinrich Mid-Question in Testy Exchange Over Trump Boast",
    "description": "White House press secretary Karoline Leavitt turned the tables on Fox News' Jacqui Heinrich by cutting her off mid-question at a briefing on Tuesday.\nThe post Karoline Leavitt Cuts Off Fox’s Jacqui Heinrich Mid-Question in Testy Exchange Over Trump Boast firs…",
    "link": "https://www.mediaite.com/media/tv/karoline-leavitt-cuts-off-foxs-jacqui-heinrich-mid-question-in-testy-exchange-over-trump-boast/",
    "timestamp": "2025-08-19T18:21:09Z"
  },
  {
    "title": "Trump's Ukraine diplomacy faces a new hurdle: Where can Putin and Zelenskyy meet?",
    "description": "A man wanted for war crimes sitting across the table from the leader of the country he invaded?",
    "link": "https://www.nbcnews.com/world/ukraine/putin-zelenskyy-meeting-location-trump-ukraine-war-ceasefire-rcna225781",
    "timestamp": "2025-08-19T18:21:08Z"
  },
  {
    "title": "Meet Ukrainian designer Viktor Anisimov - man behind Volodymyr Zelenskiy's 'lucky charm' black suit that stuns Donald Trump",
    "description": "Viktor Anisimov said he was not watching for criticism or compliments this time but wanted to ensure the Ukrainian president looked dignified.",
    "link": "https://economictimes.indiatimes.com/news/international/us/meet-ukrainian-designer-viktor-anisimov-man-behind-volodymyr-zelenskiys-lucky-charm-black-suit-that-stuns-donald-trump/articleshow/123393408.cms",
    "timestamp": "2025-08-19T18:20:24Z"
  },
  {
    "title": "'We went and reconfigured the numbers': Leavitt admits manipulating DC crime stats",
    "description": "White House Press Secretary Karoline Leavitt admitted Tuesday that crime statistics in Washington, D.C. had recently been \"reconfigured\" to support President Donald Trump's claims.During a White House briefing, a reporter asked Leavitt to clarify what Trump m…",
    "link": "https://www.rawstory.com/karoline-leavitt-2673901348/",
    "timestamp": "2025-08-19T18:20:03Z"
  },
  {
    "title": "Trump weaponization czar urged New York Attorney General James to resign over mortgage probe",
    "description": "NEW YORK (AP) — President Donald Trump’s political weaponization czar sent a letter urging New York Attorney General Letitia James to resign from office “as an act of good faith” four days after starting his mortgage fraud investigation of her. Then he showed…",
    "link": "https://financialpost.com/pmn/trump-weaponization-czar-urged-new-york-attorney-general-james-to-resign-over-mortgage-probe",
    "timestamp": "2025-08-19T18:19:08Z"
  },
  {
    "title": "DC unemployment rate is the highest in the US for the third straight month",
    "description": "The seasonably adjusted unemployment rate in Washington, D.C., was the highest in the nation for the third straight month, according to new data released...",
    "link": "https://www.yahoo.com/news/articles/dc-unemployment-rate-highest-us-181855519.html",
    "timestamp": "2025-08-19T18:18:55Z"
  },
  {
    "title": "White House Gives Update on Trump's Plan to 'Eliminate' Mail-In Voting",
    "description": "Trump said he will issue an executive order to end the use of mail-in ballots and voting machines ahead of 2026 midterm elections.",
    "link": "https://www.newsweek.com/donald-trump-mail-voting-update-election-leavitt-2115877",
    "timestamp": "2025-08-19T18:18:45Z"
  },
  {
    "title": "Las Vegas tourism is slumping. Some blame Trump’s tariffs and immigration crackdown",
    "description": "Tourism in Las Vegas is slumping this summer, with resorts and convention centers reporting fewer visitors compared to last year, especially from abroad.",
    "link": "https://www.pbs.org/newshour/nation/las-vegas-tourism-is-slumping-some-blame-trumps-tariffs-and-immigration-crackdown",
    "timestamp": "2025-08-19T18:17:14Z"
  },
  {
    "title": "Trump weaponization czar urged New York Attorney General James to resign over mortgage probe",
    "description": "President Donald Trump’s political weaponization czar sent a letter urging New York Attorney General Letitia James to resign from office “as an act of good...",
    "link": "https://www.yahoo.com/news/articles/trump-weaponization-czar-urged-york-181610470.html",
    "timestamp": "2025-08-19T18:16:10Z"
  },
  {
    "title": "Exclusive: Trump's DHS Reaching 40 Million Americans Weekly on Social Media, Sidestepping Corporate Media",
    "description": "President Donald Trump's Department of Homeland Security (DHS) is reaching tens of millions of Americans every week on social media thanks to its strategy of sidestepping the corporate media and taking the agency's message directly to the public.\nThe post Exc…",
    "link": "https://www.breitbart.com/politics/2025/08/19/trumps-dhs-reaches-40-million-americans-weekly-through-social-media/",
    "timestamp": "2025-08-19T18:15:45Z"
  },
  {
    "title": "'Doesn’t bode well': MSNBC's Rachel Maddow exposes Trump's new scheme to rig midterms",
    "description": "President Donald Trump appears to be making moves to corrupt next year's midterm elections to benefit the Republican Party, according to MSNBC's Rachel Maddow.The president demanded that Republicans draw new congressional districts for Texas to lock in GOP co…",
    "link": "https://www.rawstory.com/trump-delay-midterm/",
    "timestamp": "2025-08-19T18:15:03Z"
  },
  {
    "title": "NBC Reporter Grills Karoline Leavitt Over Trump-Putin Hot Mic Moment",
    "description": "NBC's Kelly O'Donnell pressed White House Press Secretary Karoline Leavitt on President Donald Trump's comments caught on a hot mic Monday.\nThe post NBC Reporter Grills Karoline Leavitt Over Trump-Putin Hot Mic Moment first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/nbc-reporter-grills-karoline-leavitt-over-trump-putin-hot-mic-moment/",
    "timestamp": "2025-08-19T18:14:55Z"
  },
  {
    "title": "U.S. tariff revenues to rise ‘substantially,’ focus on paying down debt, U.S. Treasury’s Bessent says",
    "description": "U.S. Treasury Secretary Scott Bessent said he expects a big jump in revenues from sweeping tariffs imposed by President Donald Trump, and said the money would be used first to start paying down the federal debt, not to give rebate checks to Americans.\nBessent…",
    "link": "https://biztoc.com/x/1f370686ef722940",
    "timestamp": "2025-08-19T18:14:05Z"
  },
  {
    "title": "Are you better off since Donald Trump took office? And more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/you-better-off-since-donald-trump-took-office-more-from-fox-news-opinion",
    "timestamp": "2025-08-19T18:12:06Z"
  },
  {
    "title": "The Backlash Presidency",
    "description": "For those who can’t understand why Donald Trump was twice elected president, including the Republicans and conservatives who continue to impugn him, we have the answer: Trump is the response to three (yes, three) terms of Barack Obama. This country has never …",
    "link": "https://freerepublic.com/focus/f-chat/4335479/posts",
    "timestamp": "2025-08-19T18:11:57Z"
  },
  {
    "title": "School Assembly Headlines for August 20: Top national, international, sports and business updates",
    "description": "India and China are mending relations with new trade and travel agreements. The opposition nominates B. Sudershan Reddy for vice president. Mumbai monorail failures strand hundreds amidst heavy rains in Maharashtra, causing fatalities and displacement. Intern…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/school-assembly-headlines-for-august-20-top-national-international-sports-and-business-updates/articleshow/123393194.cms",
    "timestamp": "2025-08-19T18:11:35Z"
  },
  {
    "title": "Wyoming Launches the First State-Issued Stablecoin",
    "description": "Wyoming’s Frontier Stable Token promises faster and cheaper digital transactions",
    "link": "https://gizmodo.com/wyoming-launches-the-first-state-issued-stablecoin-2000645074",
    "timestamp": "2025-08-19T18:10:04Z"
  },
  {
    "title": "Gavin Newsom surges in 2028 primary polls — could California’s governor be the next Democratic nominee?",
    "description": "California Governor Gavin Newsom is gaining traction as a potential 2028 presidential contender, fueled by his high-profile clashes with Donald Trump. Recent polls indicate a surge in support among Democratic voters, positioning him as a challenger to Kamala …",
    "link": "https://economictimes.indiatimes.com/news/international/us/gavin-newsom-surges-in-2028-primary-polls-could-californias-governor-be-the-next-democratic-nominee/articleshow/123392058.cms",
    "timestamp": "2025-08-19T18:09:36Z"
  },
  {
    "title": "Pediatrics Group Defies Trump Admin With Covid Vaccine Recommendation",
    "description": "The American Academy of Pediatrics has publicly recommended a new Covid-19 shot for children, defying earlier guidance from the federal government. It’s the first time in three decades that the AAP has deviated from the course set by the Centers for Disease C…",
    "link": "https://www.mediaite.com/media/news/pediatrics-group-defies-trump-admin-with-covid-vaccine-recommendation/",
    "timestamp": "2025-08-19T18:08:25Z"
  },
  {
    "title": "More than three years after Russia’s full-scale Ukraine invasion, aid workers ask: ‘Is rebuilding enough?’",
    "description": "This reporting was supported by the International Women’s Media Foundation’s Women on the Ground: Reporting from Ukraine’s Unseen Frontlines initiative in partnership with the Howard G. Buffett Foundation. This story was originally published by Borderless Mag…",
    "link": "http://chicagoreader.com/news/feature-news-politics/russia-ukraine-invasion-diaspora/",
    "timestamp": "2025-08-19T18:07:39Z"
  },
  {
    "title": "What would US-backed security guarantees for Ukraine look like?",
    "description": "Donald Trump has said European countries would \"frontload\" any security agreement for Ukraine, with no US boots on the ground. But Washington could offer to share intelligence with Kyiv or offer American air support, an analyst tells Sky News.",
    "link": "https://news.sky.com/story/what-would-us-backed-security-guarantees-for-ukraine-look-like-13414480",
    "timestamp": "2025-08-19T18:06:00Z"
  },
  {
    "title": "India’s Modi meets China’s top diplomat Wang as Asian powers rebuild ties",
    "description": "Ties between the two nuclear-armed Asian powers have made 'steady progress', India's PM Modi says.",
    "link": "https://www.aljazeera.com/news/2025/8/19/indias-modi-meets-chinas-top-diplomat-wang-as-asian-powers-rebuild-ties",
    "timestamp": "2025-08-19T18:05:13Z"
  },
  {
    "title": "Megyn Kelly Praises ‘Good Bill Maher,’ But Notes There’s Still ‘A Bad Bill Maher’ | Video",
    "description": "\"Bill Maher has been on the wrong side of the Russiagate story from the beginning,\" Kelly says of the \"Real Time\" host\nThe post Megyn Kelly Praises ‘Good Bill Maher,’ But Notes There’s Still ‘A Bad Bill Maher’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/megyn-kelly-praises-good-bill-maher-bad-bill-maher-trump-russiagate-video/",
    "timestamp": "2025-08-19T18:05:09Z"
  },
  {
    "title": "UK drops Apple encryption demands, says US spy chief [Tulsi Gabbard]",
    "description": "The UK government has dropped its demands to create a backdoor into Apple's encryption, according to the US intelligence chief Tulsi Gabbard. In a post on X in the early hours of Tuesday, Ms Gabbard said the UK had withdrawn its demand to access global Apple …",
    "link": "https://freerepublic.com/focus/f-news/4335476/posts",
    "timestamp": "2025-08-19T18:03:58Z"
  },
  {
    "title": "Trump expands 50% steel and aluminum tariffs to include 407 additional product types",
    "description": "President Donald Trump has often relied on sector-specific tariffs to enact his sprawling trade agenda.",
    "link": "https://biztoc.com/x/56fd60fc109d46e0",
    "timestamp": "2025-08-19T18:02:43Z"
  },
  {
    "title": "Donald Trump vs. Volodymyr Zelenskyy: Who was the brighter student?",
    "description": "The recent White House meeting between Donald Trump and Volodymyr Zelenskyy, alongside European leaders, highlighted contrasting leadership styles amid global tensions over Ukraine. Beyond diplomacy, their formative years and education reveal striking differe…",
    "link": "https://timesofindia.indiatimes.com/education/news/donald-trump-vs-volodymyr-zelenskyy-who-was-the-brighter-student/articleshow/123393091.cms",
    "timestamp": "2025-08-19T18:00:11Z"
  },
  {
    "title": "Adam Schiff Grills FCC Over Colbert Cancellation",
    "description": "Can Congress stop the FCC from dictating comedy?",
    "link": "https://www.cracked.com/article_47936_adam-schiff-grills-fcc-over-colbert-cancellation.html",
    "timestamp": "2025-08-19T18:00:00Z"
  },
  {
    "title": "Trump expands 50% steel and aluminum tariffs to include 407 additional product types",
    "description": "President Donald Trump has often relied on sector-specific tariffs to enact his sprawling trade agenda.",
    "link": "https://www.cnbc.com/2025/08/19/trump-trade-steel-aluminum-tariffs-.html",
    "timestamp": "2025-08-19T17:58:35Z"
  },
  {
    "title": "Former Paramount Leader Shari Redstone Says CBS Settled With Trump Because He Might Have Caught Them Red-Handed",
    "description": "Shari Redstone said Paramount agreed to settle with President Donald Trump because of worries about what his legal team may find in discovery.",
    "link": "https://dailycaller.com/2025/08/19/former-cbs-head-says-network-settled-with-trump-because-he-might-have-caught-them-red-handed/",
    "timestamp": "2025-08-19T17:56:08Z"
  },
  {
    "title": "Karoline Leavitt Attacks Journalist at Briefing: ‘Only a Reporter From The New York Times Would Ask a Question Like That’",
    "description": "Karoline Leavitt took a shot at New York Times reporter Shawn McCreesh after the journalist pressed her on Trump avoiding \"disrespecting\" Putin.\nThe post Karoline Leavitt Attacks Journalist at Briefing: ‘Only a Reporter From The New York Times Would Ask a Que…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-attacks-journalist-at-briefing-only-a-reporter-from-the-new-york-times-would-ask-a-question-like-that/",
    "timestamp": "2025-08-19T17:56:02Z"
  },
  {
    "title": "US export concerns no bar, Nvidia developing new, advanced AI chip for China",
    "description": "The new processor, tentatively named the B30A, is based on Nvidia’s latest Blackwell architecture and will feature a single-die design",
    "link": "https://www.firstpost.com/tech/us-export-concerns-no-bar-nvidia-developing-new-advanced-ai-chip-for-china-13926283.html",
    "timestamp": "2025-08-19T17:55:43Z"
  },
  {
    "title": "California Redistricting Plan May Swing on This Sonoma County Shakeup",
    "description": "A district anchored in Santa Rosa could help Democrats flip the House — and provide a \"tailor-made\" landing spot for State Senate President pro tem Mike McGuire.",
    "link": "https://www.kqed.org/news/12052702/california-redistricting-plan-may-swing-on-this-sonoma-county-shakeup",
    "timestamp": "2025-08-19T17:55:29Z"
  },
  {
    "title": "Trump offers 'assurance' U.S. won't send ground troops to Ukraine (Patrick Svitek/Washington Post)",
    "description": "Patrick Svitek / Washington Post:\nTrump offers ‘assurance’ U.S. won't send ground troops to Ukraine  —  The president suggested European nations would have troops on the ground in Ukraine, while the United States would support them in other ways.  —  Presiden…",
    "link": "https://www.memeorandum.com/250819/p71",
    "timestamp": "2025-08-19T17:55:00Z"
  },
  {
    "title": "Americans’ views of global threats differ by party, age",
    "description": "Seven-in-ten Americans view the spread of false information online as a major threat facing the nation in 2025.\nThe post Americans’ views of global threats differ by party, age appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/08/19/americans-views-of-global-threats-differ-by-party-age/",
    "timestamp": "2025-08-19T17:54:57Z"
  },
  {
    "title": "Kiev’s backers fail to sway Trump on Russia – analyst",
    "description": "The Western Europeans have “come up empty” at the recent summit in Washington, Sergey Poletaev has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623285-europe-failed-sway-trump-analyst/",
    "timestamp": "2025-08-19T17:52:37Z"
  },
  {
    "title": "White House Reacts to Potential Location of Putin-Zelensky Talks",
    "description": "The Kremlin hasn't ruled out summits but has said they could only meet in the very final stages of clinching a peace agreement.",
    "link": "https://www.newsweek.com/russia-ukraine-war-trump-zelensky-putin-budapest-meet-2115858",
    "timestamp": "2025-08-19T17:51:58Z"
  },
  {
    "title": "Why Ukraine won’t just give up its territory",
    "description": "President Donald Trump greets Ukrainian President Volodymyr Zelensky at the White House on August 18, 2025. | Tasos Katopodis/Getty Images \nUkrainian forces still control 2,550 square miles of the eastern Ukrainian region known as the Donbas, an area roughly …",
    "link": "https://biztoc.com/x/1a89510b2665845a",
    "timestamp": "2025-08-19T17:51:31Z"
  },
  {
    "title": "Trump Rules Out U.S. Ground Troops in Ukraine",
    "description": "President Donald Trump has ruled out sending U.S. troops to Ukraine as part of any potential peace deal with Russia, reassuring his America First base that no ground forces will be deployed. In a Fox News interview, Trump said, “You have my assurance, and I’m…",
    "link": "https://biztoc.com/x/fc1bf027f5bdb29d",
    "timestamp": "2025-08-19T17:51:22Z"
  },
  {
    "title": "Student Loan Update: Lawmakers Issue Warning Over Change Impacting Millions",
    "description": "This is a move the senators said would harm borrowers who had been in repayment for two decades or more.",
    "link": "https://www.newsweek.com/student-loan-update-lawmakers-issue-warning-over-change-impacting-millions-2115779",
    "timestamp": "2025-08-19T17:51:01Z"
  },
  {
    "title": "‘Completely false’: Nicolle Wallace fact-checks Trump’s attacks on mail-in voting",
    "description": "Nicolle Wallace fact-checks Trump's attacks on mail-in voting and points out a major hole in the president's plan to end the practice.",
    "link": "https://www.msnbc.com/top-stories/latest/fact-check-trump-mail-in-voting-fraud-rcna225850",
    "timestamp": "2025-08-19T17:50:32Z"
  },
  {
    "title": "Mark Hamill’s Wife Talked Him Out of Leaving US After Donald Trump’s Election",
    "description": "As Hamill tells it, his longtime wife Marilou York pulled a kind of Jedi mind trick.\nMark Hamill’s Wife Talked Him Out of Leaving US After Donald Trump’s Election\nWren Graves",
    "link": "https://consequence.net/2025/08/mark-hamill-us-wife-donald-trump/",
    "timestamp": "2025-08-19T17:50:22Z"
  },
  {
    "title": "Top California Dem Lawmaker Reportedly Had House Seat Gerrymandered for Him in Exchange for Support",
    "description": "DAILY CALLER NEWS FOUNDATION—A top California Democrat who is expected to help steer the Golden State’s mid-decade redistricting plan through the state legislature was reportedly... Read More\nThe post Top California Dem Lawmaker Reportedly Had House Seat Gerr…",
    "link": "https://www.dailysignal.com/2025/08/19/top-california-dem-lawmaker-reportedly-had-house-seat-gerrymandered-for-him-in-exchange-for-support-redistricting/",
    "timestamp": "2025-08-19T17:50:06Z"
  },
  {
    "title": "Bessent says US tariff revenues to rise 'substantially,' focus on reducing debt",
    "description": "WASHINGTON (Reuters) -U.S. Treasury Secretary Scott Bessent said he expects a big jump in revenues from sweeping tariffs imposed by President Donald Trump...",
    "link": "https://finance.yahoo.com/news/bessent-says-us-tariff-revenues-174752674.html",
    "timestamp": "2025-08-19T17:47:52Z"
  },
  {
    "title": "Trump in Command: President Leads Free World from White House Summit with European Leaders",
    "description": "European leaders praised President Donald Trump on Monday for his push to end the Ukraine-Russia war, which has culminated in plans for a peace meeting between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin.\nThe post Trump in Comm…",
    "link": "https://www.breitbart.com/politics/2025/08/19/trump-command-president-leads-free-world-white-house-summit-european-leaders/",
    "timestamp": "2025-08-19T17:46:52Z"
  },
  {
    "title": "Powell's Jackson Hole speech could setup a policy tweak that lasts well beyond his tenure",
    "description": "At Jackson Hole, Jerome Powell could lay out more overarching changes to the central bank’s dual mandate that will last long after his tenure is up next May ...",
    "link": "https://finance.yahoo.com/news/powells-jackson-hole-speech-could-setup-a-policy-tweak-that-lasts-well-beyond-his-tenure-174606260.html",
    "timestamp": "2025-08-19T17:46:06Z"
  },
  {
    "title": "Oklahoma to require ideology test for teachers from New York and California",
    "description": "Oklahoma will require applicants for teaching jobs from California and New York to pass an exam that the state’s top education official says is designed to safeguard against “radical leftist ideology.”",
    "link": "https://www.pbs.org/newshour/politics/oklahoma-to-require-ideology-test-for-teachers-from-new-york-and-california",
    "timestamp": "2025-08-19T17:43:07Z"
  },
  {
    "title": "Trump administration confirms it’s seeking a stake in Intel",
    "description": "Treasury Secretary Scott Bessent and Commerce Secretary Howard Lutnick confirmed on Tuesday that the U.S. government is considering an extraordinary investment in struggling chipmaker Intel.",
    "link": "https://www.abc12.com/news/business/trump-administration-confirms-it-s-seeking-a-stake-in-intel/article_ce3016d1-4231-5a66-aee7-ae9bc00043f7.html",
    "timestamp": "2025-08-19T17:41:25Z"
  },
  {
    "title": "Eight steps for exporters, especially MSMEs, to take to cope against Trump tariffs",
    "description": "India faces challenges from US tariffs and Chinese export curbs. To counter this, the article suggests strengthening India's industrial base. It also suggests reforming government procedures. Lowering import duties and supporting nascent tech sectors are impo…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/eight-steps-for-exporters-especially-msmes-to-take-to-cope-against-trump-tariffs/articleshow/123392754.cms",
    "timestamp": "2025-08-19T17:41:22Z"
  },
  {
    "title": "Tap Into the Truth",
    "description": "Rolling Stone and Variety presented the Truth Seekers Award to Jake Tapper, who had choice words for the state of journalism, during the fifth annual Truth Seekers Summit presented by Paramount+",
    "link": "http://www.rollingstone.com/culture/culture-news/fifth-truth-seekers-jake-tapper-1235410862/",
    "timestamp": "2025-08-19T17:41:21Z"
  },
  {
    "title": "This conversation is being recorded: Trump’s hot mic moment is the latest in a long global list",
    "description": "Hot mics have historically caught leaders off guard, revealing their true thoughts.",
    "link": "https://www.bostonherald.com/2025/08/19/trump-hot-mic-moments/",
    "timestamp": "2025-08-19T17:40:33Z"
  },
  {
    "title": "Howard Lutnick Calls CHIPS Act a ‘Giveaway to Rich Companies’ Like Intel",
    "description": "The U.S. government is in talks to get a 10% equity stake in Intel.",
    "link": "https://gizmodo.com/howard-lutnick-calls-chips-act-a-giveaway-to-rich-companies-like-intel-2000645034",
    "timestamp": "2025-08-19T17:40:15Z"
  },
  {
    "title": "Trump's Plans for Intel Take a Page From Bernie Sanders' Playbook",
    "description": "President Donald Trump is not the first prominent American politician to demand that the federal government take partial control of Intel and other manufacturers of advanced computer chips.\nBut it might surprise you to learn whose idea he has embraced.\nDuring…",
    "link": "https://biztoc.com/x/86b70d97864cc71b",
    "timestamp": "2025-08-19T17:40:10Z"
  },
  {
    "title": "'His health can't be right': Trump sparks new concern with 'heaven' talk",
    "description": "Donald Trump had the afterlife on his mind when speaking to Fox News over the phone Tuesday.Trump confessed to the hosts of \"Fox and Friends\" that the reason he's trying to end the war between Russia and Ukraine is to get into heaven. \"I just want to end it. …",
    "link": "https://www.rawstory.com/trump-health-2673901017/",
    "timestamp": "2025-08-19T17:39:48Z"
  }
]