[
  {
    "title": "Zohran Mamdani's Win Could Change Everything",
    "description": "Politics / June 26, 2025 Zohran Mamdani’s Win Could Change Everything Mamdani won by uplifting and uniting some of New York City’s most forgotten voters. His coalition now has a chance to transform what’s possible for people everywhere. Waleed Shahid Share Co…",
    "link": "https://www.thenation.com/article/politics/zohran-mamdani-win-analysis-coalition/",
    "timestamp": "2025-06-26T13:31:39Z"
  },
  {
    "title": "Pete Hegseth Lashes Out at Reporter for Asking Him About Giving Credit to Female B-2 Bomber Pilot",
    "description": "Pete Hegseth ridiculed a reporter who asked why he did not credit a female pilot in his comments after a successful mission against Iran's nuclear facilities. \nThe post Pete Hegseth Lashes Out at Reporter for Asking Him About Giving Credit to Female B-2 Bombe…",
    "link": "https://www.mediaite.com/media/news/pete-hegseth-lashes-out-at-reporter-for-asking-him-about-giving-credit-to-female-b-2-bomber-pilot/",
    "timestamp": "2025-06-26T13:31:28Z"
  },
  {
    "title": "Trump's 'big, beautiful bill' faces setback as Senate rules knock out key Medicaid provisions",
    "description": "Senate Republicans face setback as parliamentarian removes controversial Medicaid changes from President Donald Trump's bill, including provider tax rate crackdown that divided GOP lawmakers.",
    "link": "https://www.foxnews.com/politics/trumps-big-beautiful-bill-faces-setback-senate-rules-knock-out-key-medicaid-provisions",
    "timestamp": "2025-06-26T13:31:16Z"
  },
  {
    "title": "Illinois Gov. JB Pritzker is running for a third term",
    "description": "Illinois Governor JB Pritzker announced he is running for a third term with a video on his official website Thursday morning.",
    "link": "https://www.cbsnews.com/chicago/news/illinois-governor-pritzker-running-for-third-term/",
    "timestamp": "2025-06-26T13:31:00Z"
  },
  {
    "title": "Celebrities Sign Letter Opposing Cuts to Medicaid, SNAP: Full List",
    "description": "The letter includes signatures from the likes of Scarlett Johansson, Matt Damon, and former One Direction star Zayn Malik.",
    "link": "https://www.newsweek.com/celebrities-sign-open-letter-opposing-medicaid-snap-cuts-full-list-2091016",
    "timestamp": "2025-06-26T13:29:52Z"
  },
  {
    "title": "Marjorie Taylor Greene Threatens to Call Cops on Conservative Reporter in the Capitol: ‘You’re Harassing Me’",
    "description": "Rep. Marjorie Taylor Greene (R-GA) threatened to call the police on John McCormack, a senior editor at The Dispatch, for asking her questions.\nThe post Marjorie Taylor Greene Threatens to Call Cops on Conservative Reporter in the Capitol: ‘You’re Harassing Me…",
    "link": "https://www.mediaite.com/media/news/marjorie-taylor-greene-threatens-to-call-cops-on-conservative-reporter-in-the-capitol-youre-harassing-me/",
    "timestamp": "2025-06-26T13:29:30Z"
  },
  {
    "title": "US economy shrank 0.5% between January and March, worse than 2 earlier estimates had revealed",
    "description": "The Commerce Department previously estimated the economy fell 0.2% in the first quarter.",
    "link": "https://www.bostonherald.com/2025/06/26/us-gdp-shrank/",
    "timestamp": "2025-06-26T13:29:14Z"
  },
  {
    "title": "Does Mamdani's Win Matter Elsewhere?",
    "description": "Democrats across the nation are trying to figure out whether Mamdani's New York City mayoral primary upset has broader implications for the establishment.",
    "link": "https://reason.com/2025/06/26/does-mamdanis-win-matter-elsewhere/",
    "timestamp": "2025-06-26T13:27:36Z"
  },
  {
    "title": "UN Air Service Slashes Fleet By Nearly A Quarter",
    "description": "The UN's air service which flies humanitarian workers and cargo to hard-to-reach corners of the world has been forced to slash its global fleet by almost a quarter due to funding cuts, the World Food Programme (WFP) told AFP. \nWFP, which manages the United Na…",
    "link": "https://www.ibtimes.com/un-air-service-slashes-fleet-nearly-quarter-3776911",
    "timestamp": "2025-06-26T13:27:13Z"
  },
  {
    "title": "Zohran Mamdani at risk of losing US citizenship? Shocking twist as New York’s mayoral race heats up",
    "description": "Zohran Mamdani defeated former governor Andrew Cuomo in New York City’s mayoral primary on Wednesday. But his victory did not receive a warm welcome from President Donald Trump and MAGA supporters. The New York Young Republican Club (NYYRC) has called on the …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-zohran-mamdani-at-risk-of-losing-us-citizenship-shocking-twist-as-new-yorks-mayoral-race-heats-up/articleshow/122093642.cms",
    "timestamp": "2025-06-26T13:25:18Z"
  },
  {
    "title": "Clothing prices rising in US as Trump tariffs kick in, H&M boss says",
    "description": "Daniel Ervér cites ‘fast-moving situation’ as US administration has changed rules on several occasions\nBusiness live – latest updates\nClothing prices are beginning to rise in the US as Donald Trump’s tariffs on imported goods start to have an effect, accordin…",
    "link": "https://biztoc.com/x/de72d4576f699907",
    "timestamp": "2025-06-26T13:24:23Z"
  },
  {
    "title": "Trump Deputy A.G. Issues Dark Warning to Whoever Leaked Iran Report",
    "description": "Donald Trump’s administration is interested in placing the blame for a leaked Pentagon report about Iran on anyone but themselves. Now, they’ve started pointing fingers at members of Congress, and even threatening them, too. \r\nFox News’s Laura Ingraham asked …",
    "link": "https://newrepublic.com/post/197290/donald-trump-deputy-attorney-general-warning-leaked-iran-report",
    "timestamp": "2025-06-26T13:23:05Z"
  },
  {
    "title": "US first-quarter GDP revised lower on tepid consumer spending",
    "description": "WASHINGTON (Reuters) -The U.S. economy contracted a bit faster than previously thought in the first quarter amid tepid consumer spending, underscoring the...",
    "link": "https://finance.yahoo.com/news/us-first-quarter-gdp-revised-132216570.html",
    "timestamp": "2025-06-26T13:22:16Z"
  },
  {
    "title": "After Kaitlan Collins, CNN's Natasha Bertrand, gets on Trump’s nerves - he says throw her out like a dog",
    "description": "Donald Trump has launched a scathing attack on CNN reporter Natasha Bertrand, demanding her firing over leaked intelligence regarding Iran. Trump accused Bertrand of spreading \"Fake News\" and attempting to undermine the reputation of U.S. military personnel. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-kaitlan-collins-cnns-natasha-bertrand-gets-on-trumps-nerves-he-says-thrown-her-out-like-a-dog/articleshow/122092609.cms",
    "timestamp": "2025-06-26T13:21:10Z"
  },
  {
    "title": "50 Cent Offers Zohran Mamdani First Class Ticket Out of New York After Being Name-Dropped in His Tax Plan: ‘I’m Telling Trump!’",
    "description": "Rapper 50 Cent lashed out at Zohran Mamdani after the politician name dropped 50 Cent while discussing proposed tax increases.\nThe post 50 Cent Offers Zohran Mamdani First Class Ticket Out of New York After Being Name-Dropped in His Tax Plan: ‘I’m Telling Tru…",
    "link": "https://www.mediaite.com/media/entertainment/50-cent-offers-zohran-mamdani-first-class-ticket-out-of-new-york-after-being-name-dropped-in-his-tax-plan-im-telling-trump/",
    "timestamp": "2025-06-26T13:20:48Z"
  },
  {
    "title": "Ellen DeGeneres was ‘really weird and not nice’, claims queer comedian Margaret Cho",
    "description": "LGBTQ+ comedian Margaret Cho has spoken about her relationship with Ellen DeGeneres, calling the former talkshow host “weird and not nice”. DeGeneres’ public image has taken a hit in the past few years, after allegations of poor treatment of staff on The Elle…",
    "link": "https://www.thepinknews.com/2025/06/26/ellen-degeneres-margaret-cho/",
    "timestamp": "2025-06-26T13:20:37Z"
  },
  {
    "title": "Who is Khaman Maluach, the South Sudanese player picked in the NBA draft?",
    "description": "'I'm here representing the whole continent of Africa,' Maluach said after being drafted by the Houston Rockets.",
    "link": "https://www.aljazeera.com/sports/2025/6/26/who-is-khaman-maluach-the-south-sudanese-player-picked-in-the-2025-nba-draft-basketball-houston-rockets-duke",
    "timestamp": "2025-06-26T13:20:04Z"
  },
  {
    "title": "Lawrence O’Donnell Slams Trump’s ‘Warrior’ Spin With A Brutal Reminder",
    "description": "The president said Wednesday at the NATO summit that he and his team “feel like warriors” for \"obliterating\" Iran's nuclear program after contradictory reports.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-slams-trumps-warrior-spin-with-a-brutal-reminder_n_685d1c16e4b0f78c57380223",
    "timestamp": "2025-06-26T13:19:41Z"
  },
  {
    "title": "Trump calls for Netanyahu's corruption trial to be cancelled",
    "description": "The US president says the US would save Israeli prime minister from his corruption trial, like it did his country.",
    "link": "https://www.abc.net.au/news/2025-06-26/donald-trump-calls-for-netanyahu-s-corruption-trial-to-be-cancel/105466198",
    "timestamp": "2025-06-26T13:17:44Z"
  },
  {
    "title": "New details on the US strike on Iran's nuclear sites",
    "description": "Gen. Caine reveals record-breaking missile defense operation at Al-Udeid; Hegseth slams media for downplaying success.",
    "link": "https://www.israelnationalnews.com/news/410716",
    "timestamp": "2025-06-26T13:17:01Z"
  },
  {
    "title": "How long will you wait for Social Security help? Anybody's guess.",
    "description": "The Social Security Administration is providing less information about caller wait times. Critics complain it's misleading the public.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/26/social-security-wait-times-controversy/84334688007/",
    "timestamp": "2025-06-26T13:17:00Z"
  },
  {
    "title": "Trump Pivots to Tax Cuts to Combat Voter Anxiety",
    "description": "\"President Donald Trump is pivoting his attention to passing the cornerstone of his legislative agenda, pressuring Congress to quickly approve a massive tax bill that Republicans believe will seal their political fortunes in the midterm",
    "link": "https://politicalwire.com/2025/06/26/trump-pivots-to-tax-cuts-to-combat-voter-anxiety/",
    "timestamp": "2025-06-26T13:15:39Z"
  },
  {
    "title": "Iran Is Islamism’s Last Lifeline in the Middle East",
    "description": "Without support from a weakened Tehran, the region’s extremist movements would wither.",
    "link": "http://foreignpolicy.com/2025/06/26/iran-islamism-jihad-extremism-hezbollah-hamas-houthis-islamic-state-terrorism-middle-east-regime-war/",
    "timestamp": "2025-06-26T13:14:57Z"
  },
  {
    "title": "China to Hegseth: US on Path to 'Fire and Suffering'",
    "description": "A Chinese official has responded to the U.S. defense chief's forward-leaning remarks in Congress.",
    "link": "https://www.newsweek.com/china-pete-hegseth-us-military-taiwan-arms-sales-warning-2090985",
    "timestamp": "2025-06-26T13:14:42Z"
  },
  {
    "title": "Defiant Khamenei says Iran will ‘never surrender’ to the US",
    "description": "Supreme leader says US strikes on nuclear sites 'gained nothing' in first comments since Israel ceasefire agreed.",
    "link": "https://www.aljazeera.com/news/2025/6/26/defiant-khamenei-says-iran-will-never-surrender-to-the-us",
    "timestamp": "2025-06-26T13:14:36Z"
  },
  {
    "title": "EU’s competition chief won’t trade big tech rules to placate Donald Trump",
    "description": "By Samuel Stolton and Oliver Crook, Bloomberg\nThe European Union’s crackdown on Apple Inc., Meta Platforms Inc., and Alphabet Inc.’s Google isn’t a bargaining chip in trade negotiations with US President Donald Trump, according to Teresa Ribera, the EU’s comp…",
    "link": "https://biztoc.com/x/7f2cb5efdc84a3e9",
    "timestamp": "2025-06-26T13:13:23Z"
  },
  {
    "title": "Oil prices surge on new US data",
    "description": "Crude gains momentum as American stockpiles drop and Middle East tensions show signs of easing Read Full Article at RT.com",
    "link": "https://www.rt.com/business/620571-oil-prices-middle-east-us/",
    "timestamp": "2025-06-26T13:13:08Z"
  },
  {
    "title": "Freedom Caucus Members: President Trump Is Right About the 'Green New Scam' | Opinion",
    "description": "While Americans suffer from high utility costs and rolling blackouts, the green energy complex is thriving on our dime.",
    "link": "https://www.newsweek.com/freedom-caucus-members-president-trump-right-about-green-new-scam-opinion-2090737",
    "timestamp": "2025-06-26T13:11:48Z"
  },
  {
    "title": "The Social Network Part II Is Coming and Aaron Sorkin Is Taking on a New Role",
    "description": "The movie will reportedly focus on the real-world violence caused by Facebook.",
    "link": "https://gizmodo.com/the-social-network-part-ii-is-coming-but-aaron-sorkin-isnt-just-writing-this-time-2000620476",
    "timestamp": "2025-06-26T13:10:18Z"
  },
  {
    "title": "Pete Hegseth Insults Fox News Pentagon Reporter Jennifer Griffin to Her Face: ‘You’ve Been the Worst!’",
    "description": "Fox's Jennifer Griffin was literally taken aback by Pete Hegseth telling her she has been \"the worst!\" when it comes to reporting on Iran's nuclear facilities.\nThe post Pete Hegseth Insults Fox News Pentagon Reporter Jennifer Griffin to Her Face: ‘You’ve Been…",
    "link": "https://www.mediaite.com/media/tv/pete-hegseth-insults-fox-news-pentagon-reporter-jennifer-griffin-to-her-face-youve-been-the-worst/",
    "timestamp": "2025-06-26T13:08:26Z"
  },
  {
    "title": "Iran’s supreme leader warns against further American attacks in his first statement since ceasefire",
    "description": "The more-than 10 minute speech was filled with warnings and threats.",
    "link": "https://www.bostonherald.com/2025/06/26/mideast-wars-iran-statement/",
    "timestamp": "2025-06-26T13:05:08Z"
  },
  {
    "title": "CNBC's Inside India newsletter: Iran-Israel war sparks fresh interest in India's defense sector",
    "description": "The Iran-Israel conflict underscored India's reliance on imports — oil and weapons — and what it's doing to pivot towards home-grown technologies.",
    "link": "https://www.cnbc.com/2025/06/26/cnbcs-inside-india-newsletter-iran-israel-war-sparks-fresh-interest-in-indias-defense-sector.html",
    "timestamp": "2025-06-26T13:03:43Z"
  },
  {
    "title": "Kremlin: Putin, Trump did not talk Russia's NATO threat",
    "description": "Kremlin Press Secretary Dmitry Peskov told RIA Novosti on Thursday that Russian President Vladimir Putin and his United States counterpart Donald Trump did not discuss the threat the North Atlantic Tr...",
    "link": "https://biztoc.com/x/d60ea18ad05e6d34",
    "timestamp": "2025-06-26T13:02:26Z"
  },
  {
    "title": "Trump Says Putin Needs to End War in Ukraine",
    "description": "President Donald Trump says he will be speaking to Russian President Vladimir Putin, without specifying when. Trump says Putin wants to settle the war in Ukraine, but it's taken longer than he had expected. Trump speaks at the NATO summit. \nRead more:…",
    "link": "https://biztoc.com/x/a7b432861818d9a0",
    "timestamp": "2025-06-26T13:02:17Z"
  },
  {
    "title": "Iran’s supreme leader warns U.S. against further attacks in his first statement since ceasefire",
    "description": "He also downplayed Sunday's U.S. strikes on three Iranian nuclear sites using bunker-buster bombs and cruise missiles, saying that U.S. President Donald Trump — who said the attack \"completely and fully obliterated Iran's nuclear program — had “exaggerated” i…",
    "link": "https://biztoc.com/x/74c28d5ad593a0bf",
    "timestamp": "2025-06-26T13:02:12Z"
  },
  {
    "title": "Donald Trump's WH Promo Video Brags That He's 'Daddy' To NATO Leaders",
    "description": "President Trump is the \"Daddy\" of world leaders who attended the recent NATO summit in the Netherlands ... at least according to a new White House promotional video that incorporates none other than Usher's music. The White House posted a…\n Permalink",
    "link": "https://www.tmz.com/2025/06/26/president-donald-trump-usher-nato-summit-daddy/",
    "timestamp": "2025-06-26T13:01:56Z"
  },
  {
    "title": "Nobody puts “Daddy” in a corner",
    "description": "But even at NATO, Trump still can't get no respect",
    "link": "https://www.salon.com/2025/06/26/nobody-puts-daddy-in-a-corner/",
    "timestamp": "2025-06-26T13:00:35Z"
  },
  {
    "title": "Will crypto bills be delayed until 2026? – Senator Lummis shares insight",
    "description": "Political chess continues in D.C. as crypto bills inch closer. When will they be approved?",
    "link": "https://ambcrypto.com/will-crypto-bills-be-delayed-until-2026-senator-lummis-gives-insight/",
    "timestamp": "2025-06-26T13:00:32Z"
  },
  {
    "title": "Clinging to dubious claim, Trump downplays the need for Iran nuclear negotiations",
    "description": "Donald Trump desperately wanted to reach a nuclear agreement with Iran. Now that he's steered by unsupported assumptions, he's suddenly indifferent.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/clinging-dubious-claim-trump-downplays-need-iran-nuclear-negotiations-rcna215186",
    "timestamp": "2025-06-26T13:00:14Z"
  },
  {
    "title": "EXCLUSIVE: GOP Congressman Has Plan To End A Major Amnesty Maneuver Once And For All",
    "description": "Texas Rep. Chip Roy is proposing to end a massive amnesty authority that has shielded thousands of foreign nationals from deportation for over three decades.",
    "link": "https://dailycaller.com/2025/06/26/roy-to-end-deferred-enforced-departure/",
    "timestamp": "2025-06-26T13:00:10Z"
  },
  {
    "title": "Former MA Senator Scott Brown Running for Senate in New Hampshire",
    "description": "\"My life has been the American story, but I worry about what America is going to look like for my four grandchildren — and all of yours.\"\nThe post Former MA Senator Scott Brown Running for Senate in New Hampshire first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/former-ma-senator-scott-brown-running-for-senate-in-new-hampshire/",
    "timestamp": "2025-06-26T13:00:07Z"
  },
  {
    "title": "Dollar hits 3-year low on report Donald Trump could pick next Federal Reserve chair early (Financial Times)",
    "description": "Financial Times:\nDollar hits 3-year low on report Donald Trump could pick next Federal Reserve chair early  —  Currency has weakened more than 10% this year as concerns grow about US economy  —  The dollar weakened to a three-year low on Thursday after a repo…",
    "link": "https://www.memeorandum.com/250626/p32",
    "timestamp": "2025-06-26T13:00:04Z"
  },
  {
    "title": "Noem uncovers and kills multimillion-dollar, Biden-era DEI, LGBTQ program",
    "description": "Kristi Noem and DHS uncovered and killed a multimillion-dollar program enacted by the Biden administration that pushed for diversity, equity and inclusion, and \"inclusive environments in schools.\"",
    "link": "https://www.foxnews.com/politics/noem-uncovers-kills-multimillion-dollar-biden-era-dei-lgbtq-program",
    "timestamp": "2025-06-26T12:59:27Z"
  },
  {
    "title": "Pritzker seeking third term as Illinois governor amid questions about a presidential bid",
    "description": "The 60-year-old wealthy businessman was a top contender as Kamala Harris’ running mate during her 2024 presidential run.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_cbe182af-22a6-4725-983c-c2c05e88597e.html",
    "timestamp": "2025-06-26T12:58:00Z"
  },
  {
    "title": "Why Did Everyone But Joe Rogan Know What Joe Rogan Was Voting For?",
    "description": "Either he's a liar or he's very, very negligent.",
    "link": "https://www.wonkette.com/p/why-did-everyone-but-joe-rogan-know",
    "timestamp": "2025-06-26T12:55:58Z"
  },
  {
    "title": "NATO's 5% Pledge: An Obscene Betrayal of Global Needs",
    "description": "At this week’s NATO summit in The Hague, leaders announced an alarming new goal: push military spending to 5% of nations’ GDP by 2035. Framed as a response to rising global threats, particularly from Russia and terrorism, the declaration was hailed as a histo…",
    "link": "https://www.commondreams.org/opinion/nato-5-pledge",
    "timestamp": "2025-06-26T12:55:42Z"
  },
  {
    "title": "Wall Street buys over $1B in Bitcoin amid dollar's ‘do or die’ moment",
    "description": "Trump’s early Fed replacement plans rattled markets, accelerating dollar losses and sending DXY to its lowest level since April 2022.",
    "link": "https://cointelegraph.com/news/wall-street-buys-1-5b-in-bitcoin-amid-dollar-s-do-or-die-moment",
    "timestamp": "2025-06-26T12:54:56Z"
  },
  {
    "title": "Reeling from Trump rebukes, Europe weighs deeper ties with China",
    "description": "The European Union is reassessing its ties with China strained relations with the United States",
    "link": "https://abcnews.go.com/Business/wireStory/reeling-trump-rebukes-europe-weighs-deeper-ties-china-123225675",
    "timestamp": "2025-06-26T12:54:41Z"
  },
  {
    "title": "Iran’s supreme leader declares victory over Israel and US",
    "description": "Ayatollah Khamenei says America joined the conflict to rescue the “Zionist regime” after Tehran’s “crushing” retaliation Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620572-khamenei-remarks-israel-us/",
    "timestamp": "2025-06-26T12:54:40Z"
  },
  {
    "title": "EU's 27 countries struggle to find a united voice on Gaza",
    "description": "EU foreign policy decisions have to be unanimous, so one objection can block the EU from taking action.",
    "link": "https://www.bbc.com/news/articles/c62d51xxgzko",
    "timestamp": "2025-06-26T12:53:51Z"
  },
  {
    "title": "Thursday, June 26, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/thursday-june-26-2025/",
    "timestamp": "2025-06-26T12:53:31Z"
  },
  {
    "title": "U.S. economy shrank 0.5% between January and March, worse than earlier estimates revealed",
    "description": "The U.S. economy shrank at a 0.5% annual pace from January through March as President Donald Trump’s import taxes at least temporarily disrupted business, the Commerce Department reported Thursday in a a downgrade from its previous estimate. First-quarter gro…",
    "link": "https://www.seattlepi.com/business/article/u-s-economy-shrank-0-5-between-january-and-20395143.php",
    "timestamp": "2025-06-26T12:52:43Z"
  },
  {
    "title": "US economy shrank 0.5% between January and March, worse than earlier estimates showed",
    "description": "The U.S. economy shrank at a 0.5% annual pace from January through March as President Donald Trump’s import taxes at least temporarily disrupted business, the Commerce Department reported Thursday in a a downgrade from its previous estimate",
    "link": "https://abcnews.go.com/Business/wireStory/us-economy-shrank-05-january-march-worse-earlier-123226287",
    "timestamp": "2025-06-26T12:52:32Z"
  },
  {
    "title": "White House says Congress debating ‘footnotes’ on ‘Big Beautiful Bill,’ not expecting major changes",
    "description": "The White House Director of the National Economic Council told Fox News Digital 'the differences are incredibly small' as House and Senate members spar on final language.",
    "link": "https://www.foxnews.com/politics/white-house-says-congress-debating-footnotes-big-beautiful-bill-not-expecting-major-changes",
    "timestamp": "2025-06-26T12:51:41Z"
  },
  {
    "title": "Dollar falls to three-year low after report Trump may name next Fed chair early",
    "description": "The dollar has fallen to a three-year low following a report that Donald Trump is considering bringing forward the announcement of his choice to succeed the Federal Reserve chair, Jerome Powell.\nThe US president has repeatedly clashed with Powell, accusing th…",
    "link": "https://biztoc.com/x/9c19fdea5fb9f38c",
    "timestamp": "2025-06-26T12:51:37Z"
  },
  {
    "title": "Iran’s supreme leader warns U.S. against further attacks in his first statement since ceasefire",
    "description": "He also downplayed Sunday's U.S. strikes on three Iranian nuclear sites using bunker-buster bombs and cruise missiles, saying that U.S. President Donald Trump — who said the attack \"completely and fully obliterated Iran's nuclear program — had “exaggerated” i…",
    "link": "https://www.pbs.org/newshour/world/irans-supreme-leader-warns-u-s-against-further-attacks-in-his-first-statement-since-ceasefire",
    "timestamp": "2025-06-26T12:50:54Z"
  },
  {
    "title": "Fed's Barkin says tariffs will start pushing up inflation",
    "description": "NEW YORK (Reuters) -Federal Reserve Bank of Richmond President Thomas Barkin said Thursday tariffs are very likely to push inflation up over coming months...",
    "link": "https://finance.yahoo.com/news/feds-barkin-says-tariffs-start-125045976.html",
    "timestamp": "2025-06-26T12:50:45Z"
  },
  {
    "title": "Ex-Trump Aide Exclaims Jan. 6 ‘Was Not a Racist Incident!’ in Heated CNN Hit",
    "description": "Things got heated on CNN when former Rep. Jamaal Bowman (D-NY) brought up Jan. 6 during a discussion of racism and ex-Trump official Marc Short exclaimed that he was there and it \"was not a racist incident!\"\nThe post Ex-Trump Aide Exclaims Jan. 6 ‘Was Not a R…",
    "link": "https://www.mediaite.com/media/tv/ex-trump-aide-exclaims-jan-6-was-not-a-racist-incident-in-heated-cnn-hit/",
    "timestamp": "2025-06-26T12:50:21Z"
  },
  {
    "title": "Zohran Mamdani’s Victory Is About More Than Just New York City",
    "description": "Thirty-three year old democratic socialist Zohran Mamdani’s victory over scandal-ridden and disgraced former New York Gov. Andrew Cuomo paves the way for a future apart from tired Democratic establishment rhetoric, giving Americans hope for the left after the…",
    "link": "https://www.commondreams.org/opinion/zohran-mandani-victory",
    "timestamp": "2025-06-26T12:50:04Z"
  },
  {
    "title": "“Buy More U.S. Weapons”: \"Daddy\" Trump Pushes Military-Industrial Complex on NATO Countries",
    "description": "President Donald Trump has returned to Washington after a NATO summit where leaders agreed to increase their military spending to 5% of GDP by 2035, more than doubling the current target of 2%. The increase comes after years of pressure from Trump, who accuse…",
    "link": "https://www.democracynow.org/2025/6/26/president_donald_trump_nato_iran",
    "timestamp": "2025-06-26T12:49:33Z"
  },
  {
    "title": "Families and businesses are concerned about the effect of tariffs on youth sports",
    "description": "Youth sports are a big part of Karli Casamento’s life",
    "link": "https://abcnews.go.com/US/wireStory/families-businesses-concerned-effect-tariffs-youth-sports-123221757",
    "timestamp": "2025-06-26T12:47:57Z"
  },
  {
    "title": "Iran’s Khamenei Says US Intervention in War Achieved Nothing",
    "description": "Iran’s Supreme Leader Ayatollah Ali Khamenei claimed victory in the war with Israel and said the US’s intervention achieved nothing, in his first comments since a ceasefire came into effect earlier this week.",
    "link": "https://financialpost.com/pmn/business-pmn/irans-khamenei-says-us-intervention-in-war-achieved-nothing",
    "timestamp": "2025-06-26T12:47:21Z"
  },
  {
    "title": "'See what happens?' Trump floats 'rumor' about two enemy media outlets",
    "description": "Donald Trump on Thursday spread a \"rumor\" about his enemies in the media.Trump took to his own social media site, Truth Social, to announce the hearsay about two news outlets he has opposed for several years.\"Rumor is that the Failing New York Times and Fake …",
    "link": "https://www.rawstory.com/see-what-happens-trump-rumor/",
    "timestamp": "2025-06-26T12:44:11Z"
  },
  {
    "title": "U.S. economy shrank 0.5% between January and March, worse than earlier estimates revealed",
    "description": "The U.S. economy contracted by 0.5% in the first quarter, a downgrade attributed to President Trump's trade wars and a surge in imports as companies rushed to avoid tariffs. This downturn reversed the previous quarter's growth, marking the first contraction i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/u-s-economy-shrank-0-5-between-january-and-march-worse-than-earlier-estimates-revealed/articleshow/122092975.cms",
    "timestamp": "2025-06-26T12:43:12Z"
  },
  {
    "title": "President Trump’s War on Iran Was Illegal and Unconstitutional—Congress Must Act Like It",
    "description": "As a fragile cease-fire takes hold between Israel, Iran, and the United States, many questions remain. With Iran’s nuclear program unquestionably damaged but likely not fully destroyed, will the Iranian government now race toward a bomb? Having repeatedly bro…",
    "link": "https://responsiblestatecraft.org/iran-war-powers-congress/",
    "timestamp": "2025-06-26T12:43:03Z"
  },
  {
    "title": "Elissa Slotkin to Unveil Economic ‘War Plan’",
    "description": "Sen. Elissa Slotkin (D-MI), who won competitive races twice with Donald Trump on the ballot, is pitching an economic “war plan” for her party today, focused on delivering results and abandoning purity tests, the Washington",
    "link": "https://politicalwire.com/2025/06/26/elissa-slotkin-to-unveil-economic-war-plan/",
    "timestamp": "2025-06-26T12:42:09Z"
  },
  {
    "title": "Flicking the War Switch",
    "description": "On July 21, 2021, after Donald Trump had finished his first term as president, he gave an interview at his Bedminster golf club in New Jersey to a ghost writer and a publisher who were working on the memoirs of his former chief of staff Mark Meadows. He let t…",
    "link": "http://www.nybooks.com/online/2025/06/26/flicking-the-war-switch-trump-iran/",
    "timestamp": "2025-06-26T12:40:58Z"
  },
  {
    "title": "Dollar sinks on report Trump could try to undermine Fed chair Powell",
    "description": "The U.S. dollar eased to a fresh three-and-a-half-year low on the euro on Thursday as concerns President Donald Trump could replace Federal Reserve Chair Jordan Powell and undermine faith in the soundness of the country's monetary policy.",
    "link": "https://biztoc.com/x/f8e537505601a4ec",
    "timestamp": "2025-06-26T12:40:28Z"
  },
  {
    "title": "No love for U.S. dollar as markets fret about Fed independence",
    "description": "A battered U.S. dollar is taking another beating as investors, unnerved by fresh signs of an erosion in U.S. central bank independence, waste no time in pushing the greenback back to its lowest levels in over three years.\nPresident Donald Trump on Wednesday c…",
    "link": "https://biztoc.com/x/fd0ae6172729aef6",
    "timestamp": "2025-06-26T12:40:27Z"
  },
  {
    "title": "U.S. economy shrank 0.5% between January and March, worse than earlier estimates revealed",
    "description": "The U.S. economy shrank at a 0.5% annual pace from January through March as President Donald Trump’s trade wars disrupted business, the Commerce Department...",
    "link": "https://finance.yahoo.com/news/u-economy-shrank-0-5-124015790.html",
    "timestamp": "2025-06-26T12:40:15Z"
  },
  {
    "title": "‘You Cheer Against Trump So Hard!’ Hegseth LOSES IT on Reporters for ‘Manipulating the Public Mind’",
    "description": "Secretary of Defense Pete Hegseth concluded his opening statement by excoriating reporters for what he deemed an unfair bias against President Trump. \nThe post ‘You Cheer Against Trump So Hard!’ Hegseth LOSES IT on Reporters for ‘Manipulating the Public Mind’…",
    "link": "https://www.mediaite.com/politics/you-cheer-against-trump-so-hard-hegseth-loses-it-on-reporters-for-manipulating-the-public-mind/",
    "timestamp": "2025-06-26T12:40:05Z"
  },
  {
    "title": "Carnegie honors 20 'Great Immigrants,' including composer Tania León, for 20th anniversary",
    "description": "Carnegie Corp. of New York's 2025 class of Great Immigrants, Great Americans include composer and conductor Tania León, last year's Nobel Prize winner in economics Simon Johnson, and Voto Latino CEO Maria Teresa Kumar",
    "link": "https://abcnews.go.com/Business/wireStory/carnegie-honors-20-great-immigrants-including-composer-tania-123225673",
    "timestamp": "2025-06-26T12:38:41Z"
  },
  {
    "title": "Opinion: Don’t let Israel-Iran take your focus from the genocide in Gaza",
    "description": "Dr Brendan Ciarán Browne says the persecution of the Palestinians by Israel carries all the hallmarks of previous European and American colonial exploits.",
    "link": "https://www.thejournal.ie/readme/israel-gaza-genocide-6743208-Jun2025/",
    "timestamp": "2025-06-26T12:38:37Z"
  },
  {
    "title": "Reeling from Trump rebukes, Europe weighs deeper ties with China",
    "description": "BARCELONA, Spain (AP) — Jilted, betrayed, dumped, or defiant. It’s hard to describe the European Union after relentless attacks from its once-dependable ally, the United States. The threat from Donald Trump’s second administration against Greenland, its sweep…",
    "link": "https://financialpost.com/pmn/reeling-from-trump-rebukes-europe-weighs-deeper-ties-with-china",
    "timestamp": "2025-06-26T12:38:27Z"
  },
  {
    "title": "California, don’t give in to Donald Trump. Defend transgender athletes | Opinion",
    "description": "After months of threats, the other shoe just dropped: The U.S. Department of Education announced Wednesday morning that California violated Title IX by allowing transgender athletes to compete in girls sports. An investigation found that California violated T…",
    "link": "https://freerepublic.com/focus/f-news/4325383/posts",
    "timestamp": "2025-06-26T12:38:26Z"
  },
  {
    "title": "State regulator: Proposed 10-year moratorium on AI law enforcement is ‘extremely disconcerting’ | CNN Business",
    "description": "A measure tucked in President Donald Trump’s domestic policy bill making its way through Congress would effectively block states from enforcing AI-related regulations for the next decade, a rule that’s alarming some followers of the tech world.",
    "link": "https://www.cnn.com/2025/06/26/tech/ai-moratorium-agenda-bill-north-carolina-attorney-general-jeff-jackson",
    "timestamp": "2025-06-26T12:37:55Z"
  },
  {
    "title": "Iran Supreme leader Khamenei taunts Trump by backing CNN intel report that sent him into a 'rage'",
    "description": "Iran's supreme leader Ayatollah Ali Khamenei downplayed the impact of the US strike on three of Iran's nuclear sites, suggesting they had \"failed to achieve anything significant\". Khamenei taunted US President by supporting the leaked CNN intelligence report …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/iran-supreme-leader-khamenei-taunts-trump-by-backing-cnn-intel-report-that-sent-him-into-a-rage/articleshow/122092794.cms",
    "timestamp": "2025-06-26T12:37:51Z"
  },
  {
    "title": "Trump Says You Should Buy a House with Bitcoin: Will Best Wallet Token 100x in Age of Crypto Mortgages?",
    "description": "You may have never heard of Fannie May or Freddie Mac, but the two public companies – set up by Congress in the ‘60s – are the linchpins of the US housing market. Combined, they have over $7T in assets. Now, the U.S. Federal Housing Finance Agency director Wi…",
    "link": "https://bitcoinist.com/trump-says-you-should-buy-a-house-with-bitcoin-best-wallet-best-solution/",
    "timestamp": "2025-06-26T12:35:53Z"
  },
  {
    "title": "Mossad chief thanks US for help with Iran, says 'mission is not yet complete'",
    "description": "Mossad Director Barnea thanked the U.S. for its help in hitting Iran's nuclear program, but said that the mission still is not over. He also thanked the men and women of the Mossad for their work in Operation Rising Lion.",
    "link": "https://www.foxnews.com/world/mossad-chief-thanks-us-help-iran-says-mission-not-yet-complete",
    "timestamp": "2025-06-26T12:35:25Z"
  },
  {
    "title": "Mossad chief thanks US for help with Iran, says 'significantly thwarted' regime threats",
    "description": "Mossad Director David Barnea thanked the U.S. for its help in hitting Iran's nuclear program but said that the mission still is not over. He also thanked the men and women of the Mossad for their work in Operation Rising Lion.",
    "link": "https://www.foxnews.com/world/mossad-chief-thanks-us-help-iran-says-significantly-thwarted-regime-threats",
    "timestamp": "2025-06-26T12:35:25Z"
  },
  {
    "title": "Meet Queen Máxima, the royal who mocked Trump and broke the internet",
    "description": "Queen Máxima of the Netherlands unexpectedly stole the show at the recent NATO summit in The Hague with a viral moment. A video clip captured her subtly mimicking former U.S. President Donald Trump's expression during an on-camera exchange, sparking widesprea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/meet-queen-mxima-the-royal-who-mocked-trump-and-broke-the-internet/articleshow/122092681.cms",
    "timestamp": "2025-06-26T12:34:03Z"
  },
  {
    "title": "Self-censorship and the ‘spiral of silence’: Why Americans are less likely to publicly voice their opinions on political issues",
    "description": "Nearly half of Americans say they feel less free to speak their minds.",
    "link": "https://theconversation.com/self-censorship-and-the-spiral-of-silence-why-americans-are-less-likely-to-publicly-voice-their-opinions-on-political-issues-251979",
    "timestamp": "2025-06-26T12:33:54Z"
  },
  {
    "title": "Who's Your Daddy? (Trump and NATO)",
    "description": "President Donald Trump reacts to NATO Secretary General Mark Rutte referring to him as a “daddy” in dealing with the Israel-Iran conflict.",
    "link": "https://freerepublic.com/focus/f-chat/4325381/posts",
    "timestamp": "2025-06-26T12:33:31Z"
  },
  {
    "title": "Israel-Iran war recalls the 2003 US invasion of Iraq – a war my undergraduate students see as a relic of the past",
    "description": "University students today are too young to remember the March 2003 start of the Iraq War, which has future foreign policy implications, especially in light of conflict over Iran’s nuclear sites.",
    "link": "https://theconversation.com/israel-iran-war-recalls-the-2003-us-invasion-of-iraq-a-war-my-undergraduate-students-see-as-a-relic-of-the-past-259652",
    "timestamp": "2025-06-26T12:30:54Z"
  },
  {
    "title": "Pentagon sets up new 250 mile military buffer zone at border with crossings at record lows",
    "description": "The Pentagon announced Wednesday that it is establishing an expansive new military buffer zone in Texas aimed at bolstering border security as illegal crossings continue to plummet to record lows.",
    "link": "https://www.foxnews.com/us/pentagon-sets-up-new-250-mile-military-buffer-zone-border-crossings-record-lows",
    "timestamp": "2025-06-26T12:30:44Z"
  },
  {
    "title": "Stock Futures Rise as Markets Bet on Faster Fed Rate Cuts",
    "description": "Dow, S&P 500, and Nasdaq rise Thursday after reports that President Donald Trump is considering naming the next Federal Reserve chair in September or October, which fueled bets that the central bank would cut interest rates sooner than expected.",
    "link": "https://www.barrons.com/livecoverage/stock-market-news-today-062625",
    "timestamp": "2025-06-26T12:30:36Z"
  },
  {
    "title": "Carnegie honors 20 'Great Immigrants,' including composer Tania León, for 20th anniversary",
    "description": "Tania León, the noted composer and conductor who also co-founded Dance Theatre of Harlem, never planned on emigrating to the United States.  When León...",
    "link": "https://www.yahoo.com/news/carnegie-honors-20-great-immigrants-123031929.html",
    "timestamp": "2025-06-26T12:30:31Z"
  },
  {
    "title": "Bezos trying to cash in on Musk-Trump falling out – WSJ",
    "description": "The billionaire has reportedly met the president at least twice to secure government contracts for his space company Blue Origin Read Full Article at RT.com",
    "link": "https://www.rt.com/business/620562-bezos-capitalize-musk-trump-feud/",
    "timestamp": "2025-06-26T12:30:23Z"
  },
  {
    "title": "Trump presses fellow Republicans to get massive legislative package to his desk (Washington Post)",
    "description": "Washington Post:\nTrump presses fellow Republicans to get massive legislative package to his desk  —  President Donald Trump plans to hold an event at the White House on Thursday to make the case for passage of his massive tax and immigration package as the Se…",
    "link": "https://www.memeorandum.com/250626/p27",
    "timestamp": "2025-06-26T12:30:00Z"
  },
  {
    "title": "Erdogan: Trump said he would join Putin in Turkey for talks",
    "description": "Turkish President Recep Tayyip Erdogan said that US President Donald Trump expressed readiness to come to Istanbul or Ankara if Russian President Vladimir Putin agrees to attend peace talks in Turkey....",
    "link": "https://biztoc.com/x/901f317c0d7b8f25",
    "timestamp": "2025-06-26T12:29:47Z"
  },
  {
    "title": "Supreme Leader Khamenei declares 'victory' over Israel and says Iran will 'never' surrender",
    "description": "Khamenei also said that Iran’s retaliation had brought Israel to the brink of “collapse”.",
    "link": "https://www.thejournal.ie/khamenei-declares-victory-over-israel-and-says-iran-will-never-surrender-6744294-Jun2025/",
    "timestamp": "2025-06-26T12:22:02Z"
  },
  {
    "title": "Rapper 50 Cent fires back at NYC Dem socialist candidate after being name-dropped in tax plan",
    "description": "Rapper 50 Cent reacted to an old clip of New York City Democratic mayoral candidate Zohran Mamdani referencing him in his plan to increase corporate taxes.",
    "link": "https://www.foxnews.com/media/rapper-50-cent-fires-back-nyc-dem-socialist-candidate-after-being-name-dropped-tax-plan",
    "timestamp": "2025-06-26T12:20:40Z"
  },
  {
    "title": "Lavrov says NATO spending increase won't significantly affect Russia's security",
    "description": "MOSCOW (Reuters) -NATO's decision to increase defence spending will not significantly affect Russia's security, Foreign Minister Sergei Lavrov said on...",
    "link": "https://www.yahoo.com/news/lavrov-says-nato-spending-increase-121845593.html",
    "timestamp": "2025-06-26T12:18:45Z"
  }
]