[
  {
    "title": "Preparing for Trump Cuts, California Senator Proposes Research and Vaccine Access Bills",
    "description": "Sen. Scott Wiener argued that moves by Elon Musk, President Donald Trump and Robert F. Kennedy Jr. show that California is a world leader.",
    "link": "https://www.kqed.org/news/12033326/preparing-trump-cuts-california-senator-proposes-research-vaccine-access-bills",
    "timestamp": "2025-03-27T20:55:49Z"
  },
  {
    "title": "ICE Detained Activist Farmworker Alfredo Juarez Zeferino",
    "description": "The US Immigration and Customs Enforcement officers detained 25-year-old activist farmworker Alfredo “Lelo” Juarez Zeferino Tuesday morning while he was driving his partner to work at a tulip bulb farm in Mount Vernon.\n \n by Vivian McCall\n \n \n \n The US Immigr…",
    "link": "https://www.thestranger.com/news/2025/03/27/79986297/ice-detained-activist-farmworker-alfredo-juarez-zeferino",
    "timestamp": "2025-03-27T20:55:00Z"
  },
  {
    "title": "ICE Detained Activist Farm Worker Alfredo Juarez Zeferino",
    "description": "The US Immigration and Customs Enforcement officers detained 25-year-old activist farmworker Alfredo “Lelo” Juarez Zeferino Tuesday morning while he was driving his partner to work at a tulip bulb farm in Mount Vernon.\n \n by Vivian McCall\n \n \n \n The US Immigr…",
    "link": "https://www.thestranger.com/news/2025/03/27/79986297/ice-detained-activist-farm-worker-alfredo-juarez-zeferino",
    "timestamp": "2025-03-27T20:55:00Z"
  },
  {
    "title": "How Marco Rubio Is Staying Above the Fray in Signal Controversy",
    "description": "Secretary of State Marco Rubio was far less chatty than other officials in the controversial Signal discussion on U.S. airstrikes in Yemen.",
    "link": "https://www.newsweek.com/how-marco-rubio-staying-above-fray-signal-controversy-2051682",
    "timestamp": "2025-03-27T20:54:48Z"
  },
  {
    "title": "GOP senators expect White House to send spending cuts — eventually",
    "description": "A group of Senate Republicans left a meeting with top White House officials Thursday saying they are increasingly confident that President Donald Trump will send a package of spending cuts to Capitol Hill for lawmakers’ approval. \nThe senators, however, said …",
    "link": "https://biztoc.com/x/6d754e315d888b68",
    "timestamp": "2025-03-27T20:54:15Z"
  },
  {
    "title": "Favorable Views of Donald Trump Plunge by Double-Digits in Deep Red Texas",
    "description": "The president's favorability is now underwater in the Lone Star State, according to new polling.",
    "link": "https://www.newsweek.com/donald-trump-favorability-plunges-texas-2051729",
    "timestamp": "2025-03-27T20:54:06Z"
  },
  {
    "title": "Senate Armed Services leaders ask Pentagon watchdog to probe leaked Signal chat",
    "description": "The top Republican and Democrat on the Senate Armed Services Committee are asking the Defense Department's inspector general to probe the Signal chat.",
    "link": "https://www.foxnews.com/politics/sasc-letter-pentagon-ig-signal",
    "timestamp": "2025-03-27T20:54:00Z"
  },
  {
    "title": "What is so special about El Salvador's hellhole jails? Here are all the details you never knew about the dreaded prison",
    "description": "Trump proposes 20-year prison terms for Tesla vandals, backed by Elon Musk. Explore the legal, economic, and political ramifications of this controversial stance.",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-so-special-about-el-salvadors-hellhole-jails-here-are-all-the-details-you-never-knew-about-the-dreaded-prison/articleshow/119615490.cms",
    "timestamp": "2025-03-27T20:52:07Z"
  },
  {
    "title": "Canada Announces Bombshell Break With U.S. Over Trump",
    "description": "Canadian Prime Minister Mark Carney officially broke things off with the United States Thursday, marking a seismic shift in relations between the longtime allies.  \r\n“The old relationship we had with the United States based on deepening integration of our eco…",
    "link": "https://newrepublic.com/post/193287/donald-trump-canada-prime-minister-break",
    "timestamp": "2025-03-27T20:51:45Z"
  },
  {
    "title": "Israeli Officials Are Upset Over Signal War Plans Leak: Report",
    "description": "Israel reportedly supplied sensitive intelligence about a human target discussed in a Signal chat that included a journalist.",
    "link": "https://www.newsweek.com/israel-houthis-signal-war-plans-leak-2051724",
    "timestamp": "2025-03-27T20:51:35Z"
  },
  {
    "title": "Is Burke & Herbert Financial Services (BHRB) The Most Expensive Stock Insiders Are Buying In March?",
    "description": "We recently published a list of 14 Most Expensive Stocks Insiders Are Buying In March. In this article, we are going to take a look at where Burke & Herbert ...",
    "link": "https://finance.yahoo.com/news/burke-herbert-financial-services-bhrb-205034382.html",
    "timestamp": "2025-03-27T20:50:34Z"
  },
  {
    "title": "‘Putin’s Lying to Him!’ H.R. McMaster Issues Warning to Trump Peace Envoy Steve Witkoff on Fox News",
    "description": "H.R. McMaster took to Fox News on Thursday to warn Trump peace envoy Steve Witkoff not to trust Russian dictator Vladimir Putin.\nThe post ‘Putin’s Lying to Him!’ H.R. McMaster Issues Warning to Trump Peace Envoy Steve Witkoff on Fox News first appeared on Med…",
    "link": "https://www.mediaite.com/tv/putins-lying-to-him-h-r-mcmaster-issues-warning-to-trump-peace-envoy-steve-witkoff-on-fox-news/",
    "timestamp": "2025-03-27T20:50:06Z"
  },
  {
    "title": "Top Canadian Pol Vows to ‘Inflict as Much Pain as Possible to the American People’ Over Trump Tariffs",
    "description": "Ontario Premier Doug Ford vowed to \"inflict as much pain as possible\" on Americans in response to President Donald Trump's latest tariffs.\nThe post Top Canadian Pol Vows to ‘Inflict as Much Pain as Possible to the American People’ Over Trump Tariffs first app…",
    "link": "https://www.mediaite.com/news/top-canadian-pol-vows-to-inflict-as-much-pain-as-possible-to-the-american-people-over-trump-tariffs/",
    "timestamp": "2025-03-27T20:49:22Z"
  },
  {
    "title": "Judge Boasberg Hands Trump Admin New Directive About Signal Texts",
    "description": "The suit accuses Trump officials in the Signal chat of violating the Federal Records Act and the Administrative Procedure Act.",
    "link": "https://www.newsweek.com/judge-boasberg-hands-trump-admin-new-directive-about-signal-texts-2051753",
    "timestamp": "2025-03-27T20:48:48Z"
  },
  {
    "title": "'Freaking out': Trump mocked for saying 'out loud' why he withdrew Stefanik’s nomination",
    "description": "After months of stalling, Rep. Elise Stefanik (R-N.Y.) is now no longer being considered for the role of United Nations ambassador, after President Donald Trump suddenly withdrew the nomination on Thursday.Semafor reporter Burgess Everett confirmed that Stefa…",
    "link": "https://www.rawstory.com/freaking-out-trump-mocked-for-saying-out-loud-why-he-withdrew-stefaniks-nomination/",
    "timestamp": "2025-03-27T20:47:29Z"
  },
  {
    "title": "Ticker: Economy grew 2.4% in the 4th quarter; Automakers slump on tariff news",
    "description": "The U.S. economy expanded at a healthy annual 2.4% pace the final three months of 2024, supported by a year-end surge in consumer spending, the government said in a slight upgrade of its previous estimate of fourth-quarter growth.",
    "link": "https://www.bostonherald.com/2025/03/27/ticker-economy-grew-2-4-in-the-4th-quarter-automakers-slump-on-tariff-news/",
    "timestamp": "2025-03-27T20:47:02Z"
  },
  {
    "title": "Trump nominee says she would not administer internet program to benefit Elon Musk",
    "description": "WASHINGTON :The Trump administration's nominee to oversee a $42 billion government fund to bring high-speed broadband internet to unserved or underserved parts of the United States denied on Thursday that she would administer the program to benefit Starlink o…",
    "link": "https://www.channelnewsasia.com/business/trump-nominee-says-she-would-not-administer-internet-program-benefit-elon-musk-5029016",
    "timestamp": "2025-03-27T20:45:03Z"
  },
  {
    "title": "Trump's auto tariffs spark global outcry as price hikes loom",
    "description": "<p>WASHINGTON - World powers on Thursday blasted US President Donald Trump's steep tariffs on imported vehicles and parts, vowing retaliation as trade tensions intensify and price hikes appear on the horizon.</p>",
    "link": "https://www.bangkokpost.com/world/2989689/trumps-auto-tariffs-spark-global-outcry-as-price-hikes-loom",
    "timestamp": "2025-03-27T20:45:00Z"
  },
  {
    "title": "RFK Jr. to Eliminate 10,000 Jobs in Sweeping Federal Health Agency Overhaul",
    "description": "RFK Jr. to Eliminate 10,000 Jobs in Sweeping Federal Health Agency Overhaulthepatriotjournal.com",
    "link": "https://thepatriotjournal.com/rfk-hhs-jobs-cuts/",
    "timestamp": "2025-03-27T20:44:30Z"
  },
  {
    "title": "S&P/TSX composite unchanged, U.S. markets down after auto tariff announcement",
    "description": "TORONTO — Canada’s main stock index ended Thursday unchanged from a day earlier, while U.S. markets were down after U.S. President Donald Trump announced plans for auto tariffs. U.S. President Donald Trump announced on Wednesday new tariffs on the auto sector…",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-unchanged-u-s-markets-down-after-auto-tariff-announcement",
    "timestamp": "2025-03-27T20:41:55Z"
  },
  {
    "title": "Trump's Approval Rating On the Economy Hits New Low, Polls Show",
    "description": "In a new Gallup poll released on Thursday, the president's approval rating on the economy slipped to its lowest yet.",
    "link": "https://www.newsweek.com/trump-economy-approval-rating-new-low-gallup-2051744",
    "timestamp": "2025-03-27T20:40:30Z"
  },
  {
    "title": "Men make sacrifices many women don't for top jobs, Farage says",
    "description": "The Reform leader makes the comments on the role of women in the workplace at an event in Westminster.",
    "link": "https://www.bbc.com/news/articles/c4gpnl0x3w3o",
    "timestamp": "2025-03-27T20:39:21Z"
  },
  {
    "title": "Major legal setback for Donald Trump as DC Circuit blocks revival of controversial Alien Enemy Act deportations; here's what could happen next",
    "description": "The DC Circuit Court of Appeals temporarily halted the Trump administration's deportation of suspected Venezuelan gang members under the Alien Enemies Act. The 1798 law was invoked to deport men linked to the Tren de Aragua gang, but the court and judges rais…",
    "link": "https://economictimes.indiatimes.com/news/international/us/major-legal-setback-for-donald-trump-as-dc-circuit-blocks-revival-of-controversial-alien-enemy-act-deportations-heres-what-could-happen-next/articleshow/119614292.cms",
    "timestamp": "2025-03-27T20:39:14Z"
  },
  {
    "title": "Russia’s Putin eyes Arctic cooperation despite geopolitical tensions",
    "description": "Vladimir Putin says US President Donald Trump's stated intention to acquire Greenland was 'serious'.",
    "link": "https://www.aljazeera.com/news/2025/3/27/russias-putin-eyes-arctic-cooperation-despite-geopolitical-tensions",
    "timestamp": "2025-03-27T20:39:05Z"
  },
  {
    "title": "ICE Deported Someone to El Salvador Megaprison Over Paperwork Error",
    "description": "The Trump administration sent a Venezuelan national with no criminal record to a Salvadoran megaprison based on an administrative error, according to The Miami Herald. \r\nFrengel Reyes Mota, 24 years old, was deported to El Salvador earlier this month along wi…",
    "link": "https://newrepublic.com/post/193284/ice-deported-man-el-salvador-megaprison-paperwork-error",
    "timestamp": "2025-03-27T20:38:16Z"
  },
  {
    "title": "Trump has ‘gone too far’ – Danish defense minister",
    "description": "US President Donald Trump is escalating tensions and has gone “too far” with his statements on Greenland, Danish defense minister says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614880-trump-greenland-hidden-threat/",
    "timestamp": "2025-03-27T20:36:08Z"
  },
  {
    "title": "Is Marathon Petroleum (MPC) The Most Expensive Stock Insiders Are Buying In March?",
    "description": "We recently published a list of 14 Most Expensive Stocks Insiders Are Buying In March. In this article, we are going to take a look at where Marathon...",
    "link": "https://finance.yahoo.com/news/marathon-petroleum-mpc-most-expensive-203553770.html",
    "timestamp": "2025-03-27T20:35:53Z"
  },
  {
    "title": "CNN guest takes heat after saying America was 'never great'",
    "description": "Former MSNBC host Tiffany Cross argued America was \"never great\" as she attacked the Trump administration's idea of \"psuedo-patriotism\" during a CNN appearance.",
    "link": "https://www.foxnews.com/media/cnn-guest-takes-heat-after-saying-america-never-great",
    "timestamp": "2025-03-27T20:35:04Z"
  },
  {
    "title": "Donald Trump cites big reasons to make Greenland an U.S territory; here's what he said and why JD Vance's trip to the island is significant",
    "description": "President Trump has reignited his push to annex Greenland for national security reasons, despite strong opposition from Greenland and Denmark. Trump insists the U.S. needs Greenland, anticipating Vice President JD Vance's visit. Greenland's Prime Minister cal…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-cites-big-reasons-to-make-greenland-an-u-s-territory-heres-what-he-said-and-why-jd-vances-trip-to-the-island-is-significant/articleshow/119615039.cms",
    "timestamp": "2025-03-27T20:34:40Z"
  },
  {
    "title": "Donald Trump’s immigration crackdown backfires as key Republican voter base feels the heat from program’s termination",
    "description": "Trump’s end to a Cuban migrant parole program strains loyal Cuban American Republicans. Explore the political fallout, policy impacts, and silence from GOP leaders.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-immigration-crackdown-backfires-as-key-republican-voter-base-feels-the-heat-from-programs-termination/articleshow/119615042.cms",
    "timestamp": "2025-03-27T20:34:28Z"
  },
  {
    "title": "‘Fixing Our Broken Trade Deals’: American Auto Workers Praise Trump’s Tariffs",
    "description": "Trump announced 25% tariffs on vehicles and car parts imported to the U.S., claiming the taxes will \"spur growth like you haven't seen before.\"",
    "link": "https://dailycaller.com/2025/03/27/american-auto-workers-praise-trump-tariffs/",
    "timestamp": "2025-03-27T20:33:13Z"
  },
  {
    "title": "Iran Says It Has Responded To Trump's Nuclear Talks Letter",
    "description": "Iran has sent a response to a letter from US President Donald Trump that called for nuclear talks and warned of possible military action if it refuses, its foreign minister said Thursday.",
    "link": "https://www.ibtimes.com/iran-says-it-has-responded-trumps-nuclear-talks-letter-3767927",
    "timestamp": "2025-03-27T20:33:12Z"
  },
  {
    "title": "Televangelist Kenneth Copeland is the target of false AI-generated videos",
    "description": "YouTube videos are promoting fictional stories about the 88-year-old supposedly collapsing in court or being sentenced to prison for life.",
    "link": "https://www.snopes.com//fact-check/kenneth-copeland-sentenced-to-prison/",
    "timestamp": "2025-03-27T20:33:00Z"
  },
  {
    "title": "U.S. anthem met with rain of boos by Toronto Blue Jays fans on Opening Day",
    "description": "The Toronto Blue Jays opened up the 2025 MLB season this afternoon, but things weren't all happy during the pregame ceremony.\r\nAs is usual for every MLB game with the Jays, both the Canadian and American anthems were played before the first pitch. As the \"Sta…",
    "link": "https://dailyhive.com/toronto/blue-jays-fans-boos-american-anthem-opening-day",
    "timestamp": "2025-03-27T20:32:50Z"
  },
  {
    "title": "Trump Is Now Calling Himself the “Fertilization President”",
    "description": "At a Women’s History Month event, Donald Trump gave himself a new feminist nickname: the ‘fertilization president.’",
    "link": "http://www.thecut.com/article/trump-fertilization-president-nickname.html",
    "timestamp": "2025-03-27T20:32:32Z"
  },
  {
    "title": "Trump team revokes $11 billion in funding for addiction, mental health care - NewsBreak",
    "description": "The Trump administration says it hopes to save $11.4 billion by freezing and revoking COVID-era grants. Addiction experts say clawing back the federal fund",
    "link": "https://www.newsbreak.com/share/3874606513380-trump-team-revokes-11-billion-in-funding-for-addiction-mental-health-care?_f=app_share&pd=0L8YHCfs&lang=en_US&send_time=1743107516&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.12.1.3%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q2-v8%2Cns_foryou_rank_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v9%2Cns_local_strategy_25q1_exp-v8&s=i2",
    "timestamp": "2025-03-27T20:32:31Z"
  },
  {
    "title": "Macron Says No Lifting of Russia Sanctions Until Peace",
    "description": "European leaders are trying to carve out a role for themselves in US-led ceasefire talks over Russia’s war in Ukraine as more than 30 of them gather Thursday for an impromptu defense summit in Paris.\nSo far, US President Donald Trump has sidelined Europe as h…",
    "link": "https://biztoc.com/x/dc4c39d86a9f1957",
    "timestamp": "2025-03-27T20:31:40Z"
  },
  {
    "title": "Canada's prime minister says nothing off the table in response to Trump's tariffs",
    "description": "OTTAWA (Reuters) -Canada will wait until next week to strike back against the latest U.S. threat of tariffs and nothing is off the table regarding possible countermeasures, Prime Minister Mark Carney said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/28/canada039s-prime-minister-says-nothing-off-the-table-in-response-to-trump039s-tariffs",
    "timestamp": "2025-03-27T20:31:00Z"
  },
  {
    "title": "US partners with Colombia to take on immigration using biometric technologies",
    "description": "DHS Secretary Kristi Noem met with Colombia foreign minister Thursday, when the two signed an agreement to deploy biometric capabilities to take on migration and crime.",
    "link": "https://www.foxnews.com/politics/us-partners-colombia-take-immigration-using-biometric-technologies",
    "timestamp": "2025-03-27T20:30:12Z"
  },
  {
    "title": "Rapper Sheff G Sentenced To 5 Years In Prison For His Role In 2020 Shooting",
    "description": "Now that Sheff G has pleaded guilty to the charges, he'll be doing five years in prison and be back out on the streets before 2030. Not a bad deal given the circumstances.",
    "link": "https://hiphopwired.com/2660452/sheff-g-sentenced-5-years-in-prison-for-2020-shooting/",
    "timestamp": "2025-03-27T20:29:15Z"
  },
  {
    "title": "HHS axes more than $300M in gender, DEI-related health grants to California alone",
    "description": "Canceled grants included one for adapting an \"inclusive teen pregnancy prevention program for transgender boys\" and \"Buddhism and HIV Stigma in Thailand.\"",
    "link": "https://www.foxnews.com/politics/hhs-axes-more-than-300m-gender-dei-related-health-grants-california-alone",
    "timestamp": "2025-03-27T20:26:50Z"
  },
  {
    "title": "Trump's auto tariffs spark global outcry as price hikes loom",
    "description": "by Beiyi SEOW and Danny KEMPWorld powers on Thursday blasted US President Donald Trump's steep tariffs on imported vehicles and parts, vowing retaliation as trade tensions intensify and price hikes appear on the horizon.Major car exporter Germany urged a firm…",
    "link": "https://www.rawstory.com/trump-tariffs-2671617117/",
    "timestamp": "2025-03-27T20:26:30Z"
  },
  {
    "title": "President Trump’s childhood home in NYC sells at steep discount — after being overrun by feral cats",
    "description": "The price for the Tudor-style residence in the leafy Jamaica Estates enclave in Queens is less than half of the $2.14 million it previously fetched in 2017.",
    "link": "https://nypost.com/2025/03/27/business/president-trumps-childhood-home-in-nyc-sells-at-steep-discount/",
    "timestamp": "2025-03-27T20:26:29Z"
  },
  {
    "title": "Trump’s auto tariffs spark global outcry as price hikes loom",
    "description": "World powers on Thursday blasted US President Donald Trump’s steep tariffs on imported vehicles and parts, vowing retaliation as trade tensions intensify and price hikes appear on the horizon. Major car exporter Germany urged a firm response from the European…",
    "link": "https://www.digitaljournal.com/world/trumps-auto-tariffs-spark-global-outcry-as-price-hikes-loom/article",
    "timestamp": "2025-03-27T20:25:14Z"
  },
  {
    "title": "Iran says it has responded to Trump’s nuclear talks letter",
    "description": "Iran has sent a response to a letter from US President Donald Trump that called for nuclear talks and warned of possible military action if it refuses, its foreign minister said Thursday.  “This official response includes a letter in which our position regard…",
    "link": "https://www.digitaljournal.com/world/iran-says-it-has-responded-to-trumps-nuclear-talks-letter/article",
    "timestamp": "2025-03-27T20:25:14Z"
  },
  {
    "title": "Kennedy to slash 10,000 jobs in major overhaul of US health agencies",
    "description": "US health secretary says his department had become wasteful and inefficient",
    "link": "https://www.irishtimes.com/world/us/2025/03/27/kennedy-to-slash-10000-jobs-in-major-overhaul-of-us-health-agencies/",
    "timestamp": "2025-03-27T20:25:03Z"
  },
  {
    "title": "Radio Free Europe says Trump administration rescinded its grant termination order",
    "description": "U.S. government-funded Radio Free Europe/Radio Liberty said on Thursday that its parent agency had rescinded an order terminating its grant funding, after...",
    "link": "https://www.yahoo.com/news/radio-free-europe-says-trump-202329433.html",
    "timestamp": "2025-03-27T20:23:29Z"
  },
  {
    "title": "Trump aims to sign two stablecoin bills by August, officials say",
    "description": "The bills both establish a regulatory framework for the issuance and trade of dollar-backed stablecoin.",
    "link": "https://www.nextgov.com/emerging-tech/2025/03/trump-aims-sign-two-stablecoin-bills-august-officials-say/404103/",
    "timestamp": "2025-03-27T20:22:00Z"
  },
  {
    "title": "Even Elon Musk Is Trying to Correct Joe Rogan’s Anti-Vax Nonsense",
    "description": "The conspiracy-curious podcaster interviewed a doctor who claims that that polio was eradicated through sanitation rather than inoculation",
    "link": "http://www.rollingstone.com/culture/culture-news/elon-musk-joe-rogan-anti-vax-1235304807/",
    "timestamp": "2025-03-27T20:21:39Z"
  },
  {
    "title": "'Pete Hegseth Is A F*cking Liar' And Other True Updates About Signal-Gate",
    "description": "Tammy Duckworth nailed it.",
    "link": "https://www.wonkette.com/p/pete-hegseth-is-a-fcking-liar-and",
    "timestamp": "2025-03-27T20:20:55Z"
  },
  {
    "title": "“President Trump, You Are Our Beacon of Hope – Please Remember those who Stood By You when the World Turned Against You” – J6er Ryan Samsel Shares Powerful Plea with President Trump and the American People",
    "description": "In a heartfelt appeal, Ryan Samsel urges President Trump to acknowledge the sacrifices made by January 6th participants, highlighting their struggles and unwavering loyalty. This poignant plea sheds light on a deeply divisive chapter in American history.\nThe …",
    "link": "https://www.thegatewaypundit.com/2025/03/president-trump-you-are-our-beacon-ope-please/",
    "timestamp": "2025-03-27T20:20:37Z"
  },
  {
    "title": "Does moderation actually hurt Democratic candidates?",
    "description": "Earlier this month, Thomas Edsall published a column in the New York Times titled, “Even if the Democrats can move to the center, it may not help.” In it, the eminent political analyst argued that “there is evidence that the process of moderation has the pote…",
    "link": "https://www.vox.com/politics/406093/democrats-moderation-turnout-swing-voters-study",
    "timestamp": "2025-03-27T20:20:27Z"
  },
  {
    "title": "VICTOR DAVIS HANSON: From Profanity-Chic To Terrorist-Porn",
    "description": "The Democratic Party is polling about 27 percent approval — and sinking.",
    "link": "https://dailycaller.com/2025/03/27/victor-davis-hanson-profanity-chic-terrorist-democrat-hot-wheels/",
    "timestamp": "2025-03-27T20:20:12Z"
  },
  {
    "title": "The plight of boys and men, once sidelined by Democrats, is now a priority",
    "description": "For Democrats, reaching male voters became a political necessity after last fall’s election, when young men swung significantly toward President Donald Trump. But for some — like Maryland Gov. Wes Moore — it’s also a personal goal. The first-term governor, wh…",
    "link": "https://freerepublic.com/focus/f-news/4307142/posts",
    "timestamp": "2025-03-27T20:19:43Z"
  },
  {
    "title": "Republicans Just Made It Easier for Banks to Screw People Over",
    "description": "Senate Republicans voted Thursday to overturn a $5 cap on bank overdraft fees, leaving working-class people vulnerable to exploitation from financial institutions.\r\nThe Consumer Financial Protection Bureau adopted the cap late last year. It was scheduled to t…",
    "link": "https://newrepublic.com/post/193279/republicans-banks-overdraft-fees-consumer-protection",
    "timestamp": "2025-03-27T20:19:38Z"
  },
  {
    "title": "To End the Ukraine War, Trump Should Think Like Ike",
    "description": "If Trump can channel Eisenhower on Ukraine, he will be able to claim that he has achieved the peace “deal of the century.”\nThe post To End the Ukraine War, Trump Should Think Like Ike appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/politics/to-end-the-ukraine-war-trump-should-think-like-ike",
    "timestamp": "2025-03-27T20:19:12Z"
  },
  {
    "title": "Phil Magness: The Problem With Trumponomics",
    "description": "Economic historian Phil Magness on the real history of tariffs and why Trump is so wrong about them.",
    "link": "https://reason.com/podcast/2025/03/27/phil-magness-the-problem-with-trumponomics/",
    "timestamp": "2025-03-27T20:19:10Z"
  },
  {
    "title": "French, British urge ‘reassurance force’ for Ukraine",
    "description": "France and Britain want to move ahead with an initiative to send European troops to Ukraine if a peace deal materializes. Currently troop numbers and participating countries are unclear but details are expected soon.",
    "link": "https://www.dw.com/en/french-british-urge-reassurance-force-for-ukraine/a-72064382",
    "timestamp": "2025-03-27T20:19:00Z"
  },
  {
    "title": "The Irish Times view on the US visit to Greenland: some uninvited visitors",
    "description": "US vice-president JD Vance and his wife Usha are due to visit a US base as the US president continues to talk about American ownership of the island",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/03/27/the-irish-times-view-on-the-us-visit-to-greenland-some-uninvited-visitors/",
    "timestamp": "2025-03-27T20:19:00Z"
  },
  {
    "title": "FBI Nails Top Gang Leader, Bondi and Patel Watched the Whole Thing: 'Worst of the Worst'",
    "description": "\"Your days of terrorizing our communities are numbered,\" FBI Director Kash Patel said after a top MS-13 gang leader was arrested.",
    "link": "https://www.westernjournal.com/fbi-nails-top-gang-leader-bondi-patel-watched-whole-thing-worst-worst/",
    "timestamp": "2025-03-27T20:18:57Z"
  },
  {
    "title": "Carney says Trump’s office reached out to schedule a call amid trade war",
    "description": "Prime Minister Mark Carney said Thursday that Donald Trump’s office has reached out to schedule a call as the U.S. president continues to pursue an escalating trade war. Carney said his team had heard from Trump’s on Wednesday night and that he expected a cal…",
    "link": "https://financialpost.com/pmn/carney-says-trumps-office-reached-out-to-schedule-a-call-amid-trade-war",
    "timestamp": "2025-03-27T20:18:42Z"
  },
  {
    "title": "Shaking foundations",
    "description": "What is most shocking and disappointing is that the GOP has capitulated to the whims of a man-child and his compadre, a tyrant. Any representation we thought we had in our elected congress is buried in cowardice, petty arguing, and name calling.",
    "link": "https://www.ncspin.com/shaking-foundations",
    "timestamp": "2025-03-27T20:18:32Z"
  },
  {
    "title": "Judge holds hearing on administration's use of Signal app",
    "description": "A judge is holding a hearing Thursday on the Trump administration's use of the Signal messaging app to discuss military strikes in Yemen earlier this month.",
    "link": "https://abcnews.go.com/US/judge-holds-hearing-administrations-signal-app/story?id=120229350",
    "timestamp": "2025-03-27T20:17:45Z"
  },
  {
    "title": "Visibly Bruised Venezuelans Allege Mistreatment in ICE Custody",
    "description": "Venezuelan migrants recorded videos describing discrimination against them by ICE guards in El Paso, an extension of Trump’s anti-Venezuelan rhetoric.",
    "link": "http://www.rollingstone.com/politics/politics-features/venezuelans-allege-mistreatment-ice-custody-videos-1235304735/",
    "timestamp": "2025-03-27T20:17:13Z"
  },
  {
    "title": "Sen. Bill Cassidy is in obvious damage-control mode ahead of Louisiana’s 2026 election cycle",
    "description": "It’s been almost four years since U.S. Sen. Bill Cassidy cast the political dice and diverted from Republican group think. He dared to endorse the impeachment of then-recently replaced President Donald Trump for his incitement of the Jan. 6 insurrectionist at…",
    "link": "https://freerepublic.com/focus/f-news/4307140/posts",
    "timestamp": "2025-03-27T20:16:56Z"
  },
  {
    "title": "Mike Johnson either doesn’t understand checks and balances — or doesn’t care",
    "description": "Speaker of the House Mike Johnson floated the idea of hobbling our lower federal courts and hence undermining our delicate system of checks and balances.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-federal-courts-funding-judges-rcna198266",
    "timestamp": "2025-03-27T20:16:10Z"
  },
  {
    "title": "Marco Rubio says US has cancelled 300 visas of 300 'lunatics'",
    "description": "The government has arrested international students who participated in pro-Palestinian protests on campuses.",
    "link": "https://www.bbc.com/news/articles/c75720q9d7lo",
    "timestamp": "2025-03-27T20:15:37Z"
  },
  {
    "title": "Co-POTUS Loses It Over Judge Assigned To Signal War Chat Lawsuit",
    "description": "Two days after The Atlantic published a shocking report about top Trump administration officials recklessly using Signal to coordinate a military strike in Yemen, the nonpartisan watchdog group American Oversight sued members of the chat for allegedly breakin…",
    "link": "https://crooksandliars.com/2025/03/co-potus-loses-it-over-judge-assigned",
    "timestamp": "2025-03-27T20:15:19Z"
  },
  {
    "title": "'Red' America needs the truth on Trump's fentanyl failures (The Contrarian)",
    "description": "The Contrarian:\n‘Red’ America needs the truth on Trump's fentanyl failures  —  For at least some voters who elected Donald Trump in 2024, remorse is setting in.  They wanted to see problems solved, not new ones created.  They weren't expecting the “Trump-stor…",
    "link": "https://www.memeorandum.com/250327/p110",
    "timestamp": "2025-03-27T20:15:07Z"
  },
  {
    "title": "Finally, We Know: Trump's Fundraising Guitar Was Made In China",
    "description": "Look, this isn't earthshattering news. But anyone who's into guitars did wonder exactly where Trump has his guitars (from which he almost certainly took a cut) manufactured last year.\nWell! You guessed it. Mr. \"America First\" had his guitars made... in China.…",
    "link": "https://crooksandliars.com/2025/03/finally-we-know-trumps-fundraising-guitar",
    "timestamp": "2025-03-27T20:14:54Z"
  },
  {
    "title": "As Top Officials Were Messaging a Group Text About Bomb Plans, Their Passwords Were Leaked Online",
    "description": "We're on week two of the fallout from the Signal group chat scandal — and apparently, there's a lot more where that came from. Reporters at Germany's Der Spiegel have, as the newspaper reported, uncovered private contact information for defense secretary Pete…",
    "link": "https://futurism.com/signal-group-chat-passwords-leaked",
    "timestamp": "2025-03-27T20:14:33Z"
  },
  {
    "title": "Shrinking The IRS: The Good, The Bad And The Ugly For Taxpayers",
    "description": "Learn more about how the IRS' hiring freeze and workforce reduction may impact business owners and individual taxpayers this year.",
    "link": "https://www.forbes.com/sites/cindymcghee/2025/03/27/shrinking-the-irs-the-good-the-bad-and-the-ugly-for-taxpayers/",
    "timestamp": "2025-03-27T20:14:03Z"
  },
  {
    "title": "Latest U.S. auto tariffs a recipe for higher prices, layoffs across North America",
    "description": "TORONTO AND OSHAWA, ONT. — The auto industry is sounding the alarm about U.S. President Donald Trump’s latest tariff announcement, which could weigh on companies, raise consumer prices and result in job losses. Trump announced Wednesday he would impose 25 per…",
    "link": "https://financialpost.com/pmn/latest-u-s-auto-tariffs-a-recipe-for-higher-prices-layoffs-across-north-america-2",
    "timestamp": "2025-03-27T20:13:51Z"
  },
  {
    "title": "The Democratic FTC commissioners Trump fired are now suing the FTC",
    "description": "Two fired commissioners of the Federal Trade Commission (FTC) are now suing the regulator and its chair, alleging that their removal is unlawful.Read more...",
    "link": "https://qz.com/democratic-ftc-commissioners-fired-trump-lawsuit-1851772828",
    "timestamp": "2025-03-27T20:13:00Z"
  },
  {
    "title": "US auto industry stunned by tariffs meant to save it",
    "description": "The 25 percent tariffs on automobiles announced by President Donald Trump are meant to revitalize American industry, but Detroit’s giants were stunned Thursday by their scale and faced a beating on Wall Street. While the implementation of the tariffs had been…",
    "link": "https://www.digitaljournal.com/world/us-auto-industry-stunned-by-tariffs-meant-to-save-it/article",
    "timestamp": "2025-03-27T20:12:32Z"
  },
  {
    "title": "Era of close ties with US ‘is over’: Canada PM Carney",
    "description": "The era of deep economic, security and military ties between Canada and the United States “is over,” Prime Minister Mark Carney said Thursday, after President Donald Trump announced steep auto tariffs.  Trump’s planned 25 percent levy on vehicle imports to th…",
    "link": "https://www.digitaljournal.com/world/era-of-close-ties-with-us-is-over-canada-pm-carney/article",
    "timestamp": "2025-03-27T20:12:20Z"
  },
  {
    "title": "US Auto Industry Stunned By Tariffs Meant To Save It",
    "description": "The 25 percent tariffs on automobiles announced by President Donald Trump are meant to revitalize American industry, but Detroit's giants were stunned Thursday by their scale and faced a beating on Wall Street.",
    "link": "https://www.ibtimes.com/us-auto-industry-stunned-tariffs-meant-save-it-3767926",
    "timestamp": "2025-03-27T20:12:09Z"
  },
  {
    "title": "Era Of Close Ties With US 'Is Over': Canada PM Carney",
    "description": "The era of deep economic, security and military ties between Canada and the United States \"is over,\" Prime Minister Mark Carney said Thursday, after President Donald Trump announced steep auto tariffs.",
    "link": "https://www.ibtimes.com/era-close-ties-us-over-canada-pm-carney-3767923",
    "timestamp": "2025-03-27T20:12:08Z"
  },
  {
    "title": "At our lowest, and getting lower",
    "description": "It’s only taken a little over two months since the inauguration of Donald Trump to bring this nation down to its intellectual knees.",
    "link": "https://www.ncspin.com/at-our-lowest-and-getting-lower",
    "timestamp": "2025-03-27T20:10:31Z"
  },
  {
    "title": "Trump White House experiences the perils of hiring from Congress",
    "description": "The News\nPresident Donald Trump’s White House is getting a bitter taste of what it’s like to try to elevate sitting members of Congress with a small majority.\nTrump announced Thursday that he’s withdrawing his nomination of Rep. Elise Stefanik as his ambassad…",
    "link": "https://biztoc.com/x/72cc1edcc75728a0",
    "timestamp": "2025-03-27T20:09:39Z"
  },
  {
    "title": "The JFK Murder Files, Deep Fake Space Rescue, And More Kill Jab Side Effects: Turbo Aging",
    "description": "Things you can now get in deep fake space:  Yup. Not-A-Space-Agency NASA sent Astro-Nots to deep fake space and forgot them there, but Elon Musk sent an electric Tesla helicopter to fetch them from the moon with new hairstyles and a nice tan.  While right and…",
    "link": "https://www.activistpost.com/the-jfk-murder-files-deep-fake-space-rescue-and-more-kill-jab-side-effects-turbo-aging/",
    "timestamp": "2025-03-27T20:09:00Z"
  },
  {
    "title": "Trump Steps Up Trade War With New Tariffs on Autos, Threatens EU and Canada",
    "description": "President Donald Trump signed a proclamation to implement a 25% tariff on auto imports and pledged harsher punishment on the ...",
    "link": "https://biztoc.com/x/78b0fb11d99f39ab",
    "timestamp": "2025-03-27T20:07:37Z"
  },
  {
    "title": "Masked ICE agents detain a college student in Trump's latest 'flatly authoritarian' move",
    "description": "Chris Hayes explains how the Trump administration's arrest of a Turkish Tufts University student is a move taken straight out of an authoritarian playbook.",
    "link": "https://www.msnbc.com/top-stories/latest/tufts-university-student-detained-authoritarian-rcna198410",
    "timestamp": "2025-03-27T20:06:46Z"
  },
  {
    "title": "Report: Trump Admin Deported Venezuelan Men Just Because They Had Tattoos",
    "description": "“We’re finding and questioning everyone who has tattoos,” one ICE agent reportedly told a deportee.",
    "link": "https://truthout.org/articles/report-trump-admin-deported-venezuelan-men-just-because-they-had-tattoos/",
    "timestamp": "2025-03-27T20:06:11Z"
  },
  {
    "title": "What Are Current State Rules for Voting? Trump's Executive Order in Context",
    "description": "President Donald Trump's new executive order demands that proof of citizenship is required at the polls",
    "link": "https://www.newsweek.com/current-state-rules-voting-executive-order-2051057",
    "timestamp": "2025-03-27T20:05:55Z"
  },
  {
    "title": "Donald Trump Pulls Elise Stefanik's Nomination as U.N. Ambassador to Protect House Majority",
    "description": "President Donald Trump pulled his nomination of Elise Stefanik for United Nations Ambassador Thursday.\nThe post Donald Trump Pulls Elise Stefanik’s Nomination as U.N. Ambassador to Protect House Majority appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/27/donald-trump-pulls-elise-stefaniks-nomination-u-n-ambassador-to-protect-house-majority/",
    "timestamp": "2025-03-27T20:05:18Z"
  },
  {
    "title": "Judge tells government watchdogs fired by Trump there's not much she can do for them",
    "description": "A federal judge expressed doubt over reinstating eight watchdogs fired by Trump, even as the court weighed claims that their terminations violated the law.",
    "link": "https://www.foxnews.com/politics/reyes-hearing-eight-fired-inspectors-general-appear-court-challenge-terminations",
    "timestamp": "2025-03-27T20:05:05Z"
  },
  {
    "title": "Era Of Close Ties With US \"Is Over\": Canada PM Mark Carney",
    "description": "The era of deep economic, security and military ties between Canada and the United States &quot;is over,&quot; Prime Minister Mark Carney said Thursday, a day after President Donald Trump announced steep auto tariffs.",
    "link": "https://www.ndtv.com/world-news/era-of-close-ties-with-us-is-over-canada-pm-mark-carney-8027551",
    "timestamp": "2025-03-27T20:04:53Z"
  },
  {
    "title": "See inside Greenland's sole US military base, the only place JD Vance is set to visit amid Trump's territorial ambitions",
    "description": "Vice President JD Vance and Usha Vance will visit Pituffik Space Base, the US military's base in Greenland dating back to World War II.",
    "link": "https://www.businessinsider.com/greenland-us-military-base-photos-2025-3",
    "timestamp": "2025-03-27T20:04:35Z"
  },
  {
    "title": "US government relocates $8M in Bitcoin after Trump establishes strategic reserve",
    "description": "The establishment of a Strategic Bitcoin Reserve may signal a shift in US financial strategy, potentially impacting global crypto markets.\nThe post US government relocates $8M in Bitcoin after Trump establishes strategic reserve appeared first on Crypto Brief…",
    "link": "https://cryptobriefing.com/trump-strategic-bitcoin-reserve-2/",
    "timestamp": "2025-03-27T20:03:45Z"
  },
  {
    "title": "Fox News Politics Newsletter: Saving Billions",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-3-27-draft",
    "timestamp": "2025-03-27T20:02:52Z"
  },
  {
    "title": "Trump Tariffs on Canada Lumber Risk Pinching Toilet Paper Supply (Bloomberg)",
    "description": "Bloomberg:\nTrump Tariffs on Canada Lumber Risk Pinching Toilet Paper Supply … President Donald Trump's promised tariffs on softwood lumber risk disrupting the supply chain for something nobody wants to be caught without: toilet paper.  —  The Trump administra…",
    "link": "https://www.memeorandum.com/250327/p106",
    "timestamp": "2025-03-27T20:00:35Z"
  }
]