[
  {
    "title": "Elise Stefanik threatens Haverford College president at latest hearing on campus antisemitism",
    "description": "During the hearing, Republican representatives accused the schools of failing to address antisemitism on their campuses.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-853312",
    "timestamp": "2025-05-09T02:42:09Z"
  },
  {
    "title": "Dr. Oz Warns Of Another Major Challenge Coming To US Health Care",
    "description": "CMS Administrator Dr. Mehmet Oz said the department's challenge remains in spending money efficiently to address chronic illnesses in the U.S.",
    "link": "https://dailycaller.com/2025/05/08/dr-oz-warning-efficient-spending-chronic-illness-united-states/",
    "timestamp": "2025-05-09T02:42:06Z"
  },
  {
    "title": "Trump Abruptly Fires Librarian of Congress",
    "description": "President Donald Trump has fired Carla Hayden, the longtime head of the Library of Congress, in a move that Democratic lawmakers panned as “callous” and “ignorant,” Roll Call reports.",
    "link": "https://politicalwire.com/2025/05/08/trump-abruptly-fires-librarian-of-congress/",
    "timestamp": "2025-05-09T02:41:16Z"
  },
  {
    "title": "India’s macro tailwinds offer relative strength amid global uncertainties: Jyotivardhan Jaipuria",
    "description": "​Our view is that probably the worst of the tariffs we saw on April 2nd and from here tariffs are going to get a little more sane. We will see a lot of deals happening and so maybe four months later we will find that the tariff is not as bothersome, but in sp…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/indias-macro-tailwinds-offer-relative-strength-amid-global-uncertainties-jyotivardhan-jaipuria/articleshow/120997635.cms",
    "timestamp": "2025-05-09T02:41:00Z"
  },
  {
    "title": "Pope Leo to lead first mass in Sistine Chapel after paying surprise visit",
    "description": "Pope Leo will lead his first holy mass as pontiff this morning - after already paying a surprise visit to see staff at his former residence.",
    "link": "https://news.sky.com/story/pope-leo-to-lead-first-holy-mass-in-sistine-chapel-after-paying-surprise-visit-13364207",
    "timestamp": "2025-05-09T02:41:00Z"
  },
  {
    "title": "Hong Kong stocks extend longest winning streak in over a year on hopes of tariff cuts",
    "description": "Hong Kong stocks extend longest winning streak in over a year on hopes of tariff cuts\nUS President Donald Trump says trade talks in Switzerland could yield ‘substantive’ tariff cuts\nHong Kong stocks rose for the seventh straight trading day on Friday, their l…",
    "link": "https://biztoc.com/x/bfbe5291998417e0",
    "timestamp": "2025-05-09T02:39:26Z"
  },
  {
    "title": "Biden Family Desperate for a New Source of Income After ‘the Spigot Is Turned Off’: Report",
    "description": "With former President Joe Biden emerging from a the darkness after the Democratic defeat in November, Americans might have to get used to seeing the octogenarian meandering out in public for a while yet to come. Now getting media advice from a high-powered fo…",
    "link": "https://freerepublic.com/focus/f-news/4315863/posts",
    "timestamp": "2025-05-09T02:37:55Z"
  },
  {
    "title": "Oil prices little changed ahead of Sino-US trade meeting",
    "description": "Oil prices remained steady on Friday after a previous surge, buoyed by easing U.S.-China trade tensions and a new U.S.-Britain trade agreement. Brent crude is at $62.91 a barrel, while WTI is at $59.98. U.S. and China will meet to resolve trade disputes, whil…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-little-changed-ahead-of-sino-us-trade-meeting/articleshow/121014975.cms",
    "timestamp": "2025-05-09T02:36:30Z"
  },
  {
    "title": "Trump taps Fox News' Judge Jeanine Pirro as interim US Attorney in DC, 'The Five' co-host exits network",
    "description": "President Donald Trump has tapped \"The Five\" co-host Judge Jeanine Pirro to be the interim U.S. Attorney for Washington, D.C. \"I am pleased to announce that Judge Jeanine Pirro will be appointed interim United States Attorney for the District of Columbia,\" Tr…",
    "link": "https://freerepublic.com/focus/f-news/4315860/posts",
    "timestamp": "2025-05-09T02:32:59Z"
  },
  {
    "title": "Death penalty for undocumented murderers possible in all 50 states under proposed Texas GOP act",
    "description": "A new act is aiming for the federal government to pursue the death penalty in all 50 states, even where it's banned, for undocumented murderers.",
    "link": "https://www.fox26houston.com/news/death-penalty-undocumented-murderers-possible-all-50-states-under-proposed-texas-gop-act",
    "timestamp": "2025-05-09T02:30:33Z"
  },
  {
    "title": "Trump once called it his favorite word. Now, the Japanese version is all over the news.",
    "description": "Learning how to talk about tariffs, imports and exports is becoming increasingly necessary in everyday conversation.",
    "link": "https://www.japantimes.co.jp/life/2025/05/09/language/japanese-tariff-vocabulary-business/",
    "timestamp": "2025-05-09T02:30:00Z"
  },
  {
    "title": "US Senate Blocks Stablecoin Legislation Over Trump Memecoin Controversy",
    "description": "A bill to promote stablecoins was blocked in the U.S. Senate on Thursday (May 8) over political disagreements and controversy surrounding President Donald Trump’s crypto ventures, according to reporting from Bloomberg. The bill only garnered 48 votes, falling…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/us-senate-blocks-stablecoin-legislation-over-trump-memecoin-controversy/",
    "timestamp": "2025-05-09T02:29:45Z"
  },
  {
    "title": "President Trump fires Librarian of Congress Carla Hayden",
    "description": "President Donald Trump has abruptly fired Librarian of Congress Carla Hayden as the White House continues to purge the federal government of those perceived to oppose the president and his agenda",
    "link": "https://abcnews.go.com/Politics/wireStory/president-trump-fires-librarian-congress-carla-hayden-121625211",
    "timestamp": "2025-05-09T02:29:20Z"
  },
  {
    "title": "JD Vance Defends Trump's Doll Talk — And It's Even Wilder Than You Think",
    "description": "The vice president backed up his boss' call for \"bringing self-reliance back\" to the economy with a bizarre example.",
    "link": "https://www.huffpost.com/entry/jd-vance-trump-dolls-barbies-fox-news_n_681d4e26e4b0a178bc0012d6",
    "timestamp": "2025-05-09T02:28:35Z"
  },
  {
    "title": "Letitia James town hall derailed by Trump supporter’s question: ‘Will you apologize?’",
    "description": "A town hall being held by New York Attorney General Letitia James on Thursday night was disrupted when an apparent Trump supporter stood up to challenge her to apologize to the president.",
    "link": "https://www.foxnews.com/politics/letitia-james-town-hall-derailed-trump-supporters-question-will-you-apologize",
    "timestamp": "2025-05-09T02:27:43Z"
  },
  {
    "title": "First Afrikaners granted refugee status due to arrive in U.S.",
    "description": "Three months ago, President Trump signed an executive order telling white Afrikaans South Africans they could apply for refugee status in the U.S. The first group has been swiftly processed and is set to arrive on U.S. soil Monday",
    "link": "https://www.npr.org/2025/05/09/nx-s1-5391815/first-afrikaners-granted-refugee-status-due-to-arrive-in-u-s",
    "timestamp": "2025-05-09T02:22:22Z"
  },
  {
    "title": "JUST IN: President Trump Abruptly Fires Obama-Appointed Librarian of Congress Who Pushed ‘Sexual Identity’ on Children",
    "description": "President Trump abruptly fired the Democrat Librarian of Congress on Thursday.\nThe post JUST IN: President Trump Abruptly Fires Obama-Appointed Librarian of Congress Who Pushed ‘Sexual Identity’ on Children appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/05/just-president-trump-abruptly-fires-obama-appointed-librarian/",
    "timestamp": "2025-05-09T02:20:18Z"
  },
  {
    "title": "Chinese companies bought up European ports — and now Brussels is starting to worry",
    "description": "Chinese companies own stakes in about 30 European ports, and that's raising security concerns.",
    "link": "https://www.politico.eu/article/chinese-companies-bought-up-european-ports-and-now-brussels-is-starting-to-worry/",
    "timestamp": "2025-05-09T02:19:00Z"
  },
  {
    "title": "Trump met Israeli Strategic Affairs Minister Dermer on Thursday",
    "description": "US President Donald Trump met Israeli Strategic Affairs Minister Ron Dermer on Thursday and discussed the nucl",
    "link": "https://www.jpost.com/breaking-news/article-853309",
    "timestamp": "2025-05-09T02:18:51Z"
  },
  {
    "title": "Asia’s superrich rapidly scale back U.S. exposure amid trade war",
    "description": "The pullback marks a rapid change from just a few months ago, when many in the region’s business elite cheered the election win of U.S. President Donald Trump.",
    "link": "https://biztoc.com/x/90c2ab9eba77253d",
    "timestamp": "2025-05-09T02:17:07Z"
  },
  {
    "title": "What Pope Leo XIV has said on social media about politics, Trump administration",
    "description": "Hints as to what postures Pope Leo XIV, formerly Cardinal Robert Prevost, might take on some of the most controversial issues roiling the U.S. may come from his recent activity on social media​.",
    "link": "https://www.cbsnews.com/news/pope-leo-xiv-social-media-account-trump-vance-criticism/",
    "timestamp": "2025-05-09T02:16:32Z"
  },
  {
    "title": "Diddy sex trafficking trial closes in on jury selection",
    "description": "Plus Usher announces an Australian tour, the Producer Screen Awards announce their 2025 winners, Death Stranding 2 reveals Australian setting and more.",
    "link": "https://www.abc.net.au/news/2025-05-09/diddy-jury-selection-usher-tour-death-stranding-2/105264414",
    "timestamp": "2025-05-09T02:12:02Z"
  },
  {
    "title": "Asia’s superrich rapidly scale back U.S. exposure amid trade war",
    "description": "The pullback marks a rapid change from just a few months ago, when many in the region’s business elite cheered the election win of U.S. President Donald Trump.",
    "link": "https://www.japantimes.co.jp/business/2025/05/09/economy/asia-rich-cut-us-trade-war/",
    "timestamp": "2025-05-09T02:11:00Z"
  },
  {
    "title": "China can play hardball at looming trade talks with U.S., analysts say",
    "description": "After weeks of tit-for-tat escalation that sent global markets into a tailspin, the two powers will meet this weekend for a chance to break the ice.",
    "link": "https://www.japantimes.co.jp/news/2025/05/09/world/politics/trump-china-weekend-tariff-talks/",
    "timestamp": "2025-05-09T02:11:00Z"
  },
  {
    "title": "Fox News Pundit Names 1 Holy Reason For New Pope's 'Potshots' At Trump Administration",
    "description": "Raymond Arroyo reminded Fox News' Will Cain what comes \"with the job\" after Pope Leo XIV was selected to lead the Roman Catholic Church.",
    "link": "https://www.huffpost.com/entry/fox-news-raymond-arroyo-pope-leo-xiv-immigration_n_681d3795e4b02fbba8e7bdfa",
    "timestamp": "2025-05-09T02:08:22Z"
  },
  {
    "title": "DOGE-led software revamp to speed US job cuts even as Elon Musk steps back",
    "description": "The U.S. government is set to deploy new software, developed under Elon Musk’s DOGE initiative, to accelerate mass layoffs across federal agencies. Known as the “Workforce Reshaping Tool,” it updates an old Pentagon program, automating dismissals amid a broad…",
    "link": "https://economictimes.indiatimes.com/tech/technology/doge-led-software-revamp-to-speed-us-job-cuts-even-as-elon-musk-steps-back/articleshow/121014587.cms",
    "timestamp": "2025-05-09T02:07:10Z"
  },
  {
    "title": "Justice Dept. investigating N.Y. attorney general who has targeted Trump",
    "description": "Letitia James’s lawyer dismissed the allegations as the Trump administration’s “latest act of improper political retribution.\"NEW YORK — The Justice Department has opened a criminal investigation into real estate transactions involving New York Attorney Gener…",
    "link": "https://freerepublic.com/focus/f-news/4315855/posts",
    "timestamp": "2025-05-09T02:07:05Z"
  },
  {
    "title": "5 worrying things you need to know about Leo XIV",
    "description": "Prevost is a vocal critic of U.S. President Donald Trump’s administration and has consistently used his X account to promote material hostile to Trump’s immigration policies. In one instance from February 3, Prevost reposted an article by NCROnline titled “JD…",
    "link": "https://freerepublic.com/focus/f-religion/4315854/posts",
    "timestamp": "2025-05-09T02:06:54Z"
  },
  {
    "title": "In a bid for survival, businesses are labeling tariff costs on receipts to explain price hikes and retain customer trust",
    "description": "Businesses, large and small, are hoping to retain consumer trust by showing how much tariffs imposed on countries by President Donald Trump increase prices.\nDado Ruvic/REUTERS\nA business owner is labeling tariff costs as a separate line on the price tag of hi…",
    "link": "https://biztoc.com/x/d03ec69889bdabf5",
    "timestamp": "2025-05-09T02:06:00Z"
  },
  {
    "title": "Trump names Fox News host as top Washington prosecutor",
    "description": "Donald Trump on Thursday appointed TV personality and former judge Jeanine Pirro to a key post in the US judiciary, the president's latest nomination of a...",
    "link": "https://www.yahoo.com/news/trump-names-fox-news-host-020415975.html",
    "timestamp": "2025-05-09T02:04:15Z"
  },
  {
    "title": "Attorney General Pam Bondi Was Secretly Recorded in Attempted Gotcha Meeting Arranged by James O’Keefe",
    "description": "U.S. Attorney General Pam Bondi was secretly recorded discussing the FBI's files on Jeffrey Epstein during a sting conducted by James O'Keefe.\nThe post Attorney General Pam Bondi Was Secretly Recorded in Attempted Gotcha Meeting Arranged by James O’Keefe firs…",
    "link": "https://www.mediaite.com/politics/attorney-general-pam-bondi-was-secretly-recorded-in-attempted-gotcha-meeting-arranged-by-james-okeefe/",
    "timestamp": "2025-05-09T02:01:23Z"
  },
  {
    "title": "Trump fires longtime Librarian of Congress Carla Hayden",
    "description": "Carla Hayden has been the Librarian of Congress since 2016. She was the first woman and African American to hold the position.",
    "link": "https://www.cbsnews.com/news/trump-fires-longtime-librarian-of-congress-carla-hayden/",
    "timestamp": "2025-05-09T02:01:07Z"
  },
  {
    "title": "Biden Family Desperate for a New Source of Income After ‘the Spigot Is Turned Off’: Report",
    "description": "With former President Joe Biden emerging from a the darkness after the Democratic defeat in November, Americans might have to get used to seeing the octogenarian meandering out in public for a while yet to come.\nThe post Biden Family Desperate for a New Sourc…",
    "link": "https://www.thegatewaypundit.com/2025/05/biden-family-desperate-new-source-income-spigot-turned/",
    "timestamp": "2025-05-09T02:00:28Z"
  },
  {
    "title": "May 1, 2025",
    "description": "Dear friends, Welcome to May, […]",
    "link": "https://www.mutualfundobserver.com/2025/05/may-1-2025/",
    "timestamp": "2025-05-09T02:00:12Z"
  },
  {
    "title": "Trump’s election maestro works to topple Albanian prime minister",
    "description": "Albania’s embattled opposition party is mounting a dramatic election push after years sidelined by Edi Rama’s ruling Socialists.",
    "link": "https://www.politico.eu/article/chris-lacivita-donald-trump-election-fixer-sali-berisha-topple-albania-prime-minister-edi-rama/",
    "timestamp": "2025-05-09T02:00:00Z"
  },
  {
    "title": "In a bid for survival, businesses are labeling tariff costs on receipts to explain price hikes and retain customer trust",
    "description": "Businesses are starting to label tariff costs on labels, receipts, and websites in order to retain trust and explain price hikes.",
    "link": "https://www.businessinsider.com/businesses-are-labeling-tariff-costs-on-receipts-bid-for-survival-2025-5",
    "timestamp": "2025-05-09T01:58:43Z"
  },
  {
    "title": "A moment of hope for U.S-China trade frictions",
    "description": "The U.S. and China will meet in Switzerland to discuss trade tensions, but deep mistrust and structural issues are hurdles they will have to overcome to make progress.",
    "link": "https://www.japantimes.co.jp/editorials/2025/05/09/us-china-trade-frictions/",
    "timestamp": "2025-05-09T01:56:00Z"
  },
  {
    "title": "How good is the UK trade pact for America?",
    "description": "How good is the UK trade pact for America?\nWhen President Donald Trump unveiled sweeping taxes on imports from around the world last month, he said the measures aimed to right America's trade relationships.\nIn his new pact with the UK, we got a glimpse of the…",
    "link": "https://biztoc.com/x/10a6e1cc89bcee71",
    "timestamp": "2025-05-09T01:54:57Z"
  },
  {
    "title": "Trump’s tariffs have launched global trade wars. Here’s a timeline of how we got here",
    "description": "Trump’s tariffs have launched global trade wars. Here’s a timeline of how we got here\nTrump’s tariffs have launched global trade wars. Here’s a timeline of how we got here\nNEW YORK (AP) —\nLong-threatened tariffs from U.S. President Donald Trump have plunged t…",
    "link": "https://biztoc.com/x/4d78dcb64b1179da",
    "timestamp": "2025-05-09T01:54:50Z"
  },
  {
    "title": "Gold firms on dip buying; US-China trade talks in focus",
    "description": "Gold prices edged higher on Friday as investors sought refuge in the precious metal following a previous session dip, awaiting U.S.-China trade discussions this weekend. The market is also digesting the recent U.S.-UK trade agreement and anticipating insights…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-firms-on-dip-buying-us-china-trade-talks-in-focus/articleshow/121014421.cms",
    "timestamp": "2025-05-09T01:53:55Z"
  },
  {
    "title": "Wall Street gains as first trade deal reached",
    "description": "American stock markets saw gains on Thursday. Investors reacted positively to the new trade deal between the U.S. and Britain. The agreement involves lowered tariffs and increased access for U.S. goods. Airline stocks, especially Delta Air Lines, experienced …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-gains-as-first-trade-deal-reached/articleshow/121014416.cms",
    "timestamp": "2025-05-09T01:52:02Z"
  },
  {
    "title": "President Donald Trump fires Librarian of Congress Carla Hayden (Associated Press)",
    "description": "Associated Press:\nPresident Donald Trump fires Librarian of Congress Carla Hayden  —  President Donald Trump abruptly fired Librarian of Congress Carla Hayden on Thursday as the White House continues to purge the federal government of those perceived to oppos…",
    "link": "https://www.memeorandum.com/250508/p157",
    "timestamp": "2025-05-09T01:50:01Z"
  },
  {
    "title": "Trump names Fox News host as top Washington DC prosecutor",
    "description": "Jeanine Pirro replaces Trump's previous pick, who lost Republicans support over the US Capitol riot.",
    "link": "https://www.bbc.com/news/articles/cx2jnl79mejo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-09T01:47:50Z"
  },
  {
    "title": "Trump names Fox News host as top Washington DC prosecutor",
    "description": "Jeanine Pirro replaces Trump's previous pick, who lost Republicans support over the US Capitol riot.",
    "link": "https://www.bbc.com/news/articles/cx2jnl79mejo",
    "timestamp": "2025-05-09T01:47:45Z"
  },
  {
    "title": "Taiwan's chip industry faces string of crises, but China steps in as surprising lifeline",
    "description": "Taiwan's semiconductor equipment supply chain is navigating a period of unprecedented turbulence, battered by a confluence of global tariff escalations, tighter AI chip export restrictions, and a rapidly strengthening New Taiwan dollar. The specter of further…",
    "link": "https://www.digitimes.com/news/a20250507PD229/taiwan-ict-manufacturing-equipment-ai-chip-supply-chain.html",
    "timestamp": "2025-05-09T01:47:21Z"
  },
  {
    "title": "Librarian of Congress Carla Hayden is fired by Trump",
    "description": "President Donald Trump fired Librarian of Congress Carla Hayden Thursday, according to a library spokesperson and an email obtained by POLITICO. \n“Carla, On behalf of President Donald J. Trump, I am writing to inform you that your position as the Librarian of…",
    "link": "https://biztoc.com/x/5c232826e8322174",
    "timestamp": "2025-05-09T01:43:54Z"
  },
  {
    "title": "World's second largest carmaker to move manufacturing of luxury brand to US",
    "description": "The second largest carmaker in the world will be relocating the manufacturing of its luxury brand to the United States after President Donald Trump has been encouraging car companies to do business in the US. Volkswagen Group, which is the second largest car …",
    "link": "https://freerepublic.com/focus/f-news/4315850/posts",
    "timestamp": "2025-05-09T01:43:47Z"
  },
  {
    "title": "Robert Prevost's Posts on Social Media Questioned Trump's Immigration Policy",
    "description": "Social media posts from Robert Prevost, newly named Pope Leo XIV, show recent criticism of the Trump administration's immigration policies. Why It Matters President Donald Trump's push for mass deportations has been getting held up in courts nationwide. Withi…",
    "link": "https://freerepublic.com/focus/f-news/4315849/posts",
    "timestamp": "2025-05-09T01:43:20Z"
  },
  {
    "title": "Trump Abruptly Fires Librarian Of Congress Carla Hayden",
    "description": "Trump has abruptly fired Librarian of Congress Carla Hayden as the White House continues to purge the federal government of those perceived to oppose the president.",
    "link": "https://www.huffpost.com/entry/trump-fires-librarian-of-congress-carla-hayden_n_681d5cdee4b0a178bc00183f",
    "timestamp": "2025-05-09T01:42:24Z"
  },
  {
    "title": "Up to 1,000 transgender troops are being moved out of the military in new Pentagon order (Associated Press)",
    "description": "Associated Press:\nUp to 1,000 transgender troops are being moved out of the military in new Pentagon order  —  The Supreme Court this week allowed President Donald Trump to implement his ban on transgender people serving in the military while a legal challeng…",
    "link": "https://www.memeorandum.com/250508/p156",
    "timestamp": "2025-05-09T01:40:02Z"
  },
  {
    "title": "FEMA’s acting administrator is replaced a day after congressional testimony",
    "description": "WASHINGTON (AP) — The Federal Emergency Management Agency faced fresh upheaval Thursday just weeks before the start of hurricane season when the acting administrator was pushed out and replaced by another official from the Department of Homeland Security.The …",
    "link": "https://freerepublic.com/focus/f-news/4315848/posts",
    "timestamp": "2025-05-09T01:39:43Z"
  },
  {
    "title": "OpenAI CEO Sam Altman and other US tech leaders testify to Congress on AI competition with China",
    "description": "OpenAI CEO Sam Altman and tech leaders from Microsoft, AMD, and CoreWeave told US lawmakers that AI could surpass the internet in societal impact, urging unified regulation and major infrastructure investment. They warned that fragmented rules and restrictive…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/openai-ceo-sam-altman-and-other-us-tech-leaders-testify-to-congress-on-ai-competition-with-china/articleshow/121014299.cms",
    "timestamp": "2025-05-09T01:38:45Z"
  },
  {
    "title": "‘It’s Good TV’: Chris Hayes Marvels at Jeanine Pirro’s Most Unhinged Moments After Trump Appoints Her as U.S. Attorney",
    "description": "\"I'm just gonna say this straight up. Game recognize game.\"\nThe post ‘It’s Good TV’: Chris Hayes Marvels at Jeanine Pirro’s Most Unhinged Moments After Trump Appoints Her as U.S. Attorney first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/its-good-tv-chris-hayes-marvels-at-jeanine-pirros-most-unhinged-moments-after-trump-appoints-her-as-u-s-attorney/",
    "timestamp": "2025-05-09T01:30:04Z"
  },
  {
    "title": "Bristow received €2.5m for Irish rescue service as handover delays persist",
    "description": "US firm Bristow, which is taking over the operation of Ireland’s airborne coastguard search-and-rescue service, received $2.8m (€2.5m) from the Government in the first quarter of this year under its contract.",
    "link": "https://www.independent.ie/business/bristow-received-25m-for-irish-rescue-service-as-handover-delays-persist/a947704717.html",
    "timestamp": "2025-05-09T01:30:00Z"
  },
  {
    "title": "President Donald Trump fires Librarian of Congress Carla Hayden",
    "description": "President Trump has fired Librarian of Congress Carla Hayden, sparking outrage from House Democrats. Representative Rosa DeLauro condemned the dismissal as a callous act and an attack on the independence of the Library of Congress. Hayden's tenure was praised…",
    "link": "https://timesofindia.indiatimes.com/world/us/president-donald-trump-fires-librarian-of-congress-carla-hayden/articleshow/121014195.cms",
    "timestamp": "2025-05-09T01:28:15Z"
  },
  {
    "title": "'There is no truce': Ukraine's soldiers and civilians on Russia's ceasefire",
    "description": "The BBC's Yogita Limaye went to the Donetsk region of Ukraine to speak to soldiers about life on the frontline.",
    "link": "https://www.bbc.com/news/articles/c5y63dvj5dqo",
    "timestamp": "2025-05-09T01:25:39Z"
  },
  {
    "title": "Pam Bondi Holds Key Meeting In Trump Push To Reinstate Death Sentences",
    "description": "The Trump administration’s longshot campaign to bring state death sentences against people who will already die in prison “purely political,” one expert said.",
    "link": "https://www.huffpost.com/entry/pam-bondi-meet-victim-family-member-new-death-sentences_n_681d411ee4b02fbba8e7c258",
    "timestamp": "2025-05-09T01:24:41Z"
  },
  {
    "title": "US VP Vance says war between India and Pakistan will be 'none of our business'",
    "description": "U.S. Vice President JD Vance said on Thursday that India and Pakistan should de-escalate tensions, but he added that the U.S. cannot control the nuclear...",
    "link": "https://www.yahoo.com/news/us-vp-vance-says-war-012351989.html",
    "timestamp": "2025-05-09T01:23:51Z"
  },
  {
    "title": "Taylor and Price’s far-right putsch in the Liberals would create the parliamentary wing of Sky News",
    "description": "The Liberal leadership contest between Sussan Ley and Angus Taylor could start an ongoing battle between moderates and the right. And that's good news only for Labor.\nThe post Taylor and Price’s far-right putsch in the Liberals would create the parliamentary …",
    "link": "http://www.crikey.com.au/2025/05/09/liberal-leadership-angus-taylor-jacinta-nampijinpa-price-sussan-ley/",
    "timestamp": "2025-05-09T01:23:07Z"
  },
  {
    "title": "It's no joke",
    "description": "These troubling times call for national leadership that has all of its marbles. Donald Trump does not!",
    "link": "https://www.ncspin.com/its-no-joke",
    "timestamp": "2025-05-09T01:22:05Z"
  },
  {
    "title": "How good is the UK trade pact for America?",
    "description": "In Trump's new trade pact with the UK, we got a glimpse of the types of agreements he may seek across the globe.",
    "link": "https://www.bbc.com/news/articles/cp8dnm4dv2zo",
    "timestamp": "2025-05-09T01:19:49Z"
  },
  {
    "title": "CNBC Daily Open: Wall Street cheered U.S.-UK trade deal — London market, not really",
    "description": "Specifics of the plan were not announced, but it does seem unbalanced, at least based on the fact that a 10% tariff will remain on all U.K. imports.",
    "link": "https://www.cnbc.com/2025/05/09/cnbc-daily-open-wall-street-cheered-us-uk-trade-deal-but-not-london.html",
    "timestamp": "2025-05-09T01:18:08Z"
  },
  {
    "title": "President Trump Appoints Ed Martin to Be Director of DOJ’s Weaponization Working Group and Pardon Attorney",
    "description": "resident Donald Trump announced Thursday evening he is appointing Ed Martin to be an Associate Deputy Attorney General at the Department of Justice with two jobs, Pardon Attorney and Director of Attorney General Pam Bondi’s Weaponization Working Group. The ap…",
    "link": "https://freerepublic.com/focus/f-news/4315841/posts",
    "timestamp": "2025-05-09T01:14:51Z"
  },
  {
    "title": "Jeanine Pirro Exits Fox News to Be President Trump’s Interim U.S. Attorney in Washington",
    "description": "Jeanine Pirro has stepped down from her roles at Fox News Channel — her bio page is already removed — after being tapped by President Donald Trump on Thursday to serve as Interim U.S. Attorney in Washington. “I am pleased to announce that Judge Jeanine Pirro …",
    "link": "https://tvline.com/news/jeanine-pirro-leaving-the-five-fox-news-us-attorney-dc-1235447411/",
    "timestamp": "2025-05-09T01:09:06Z"
  },
  {
    "title": "Teary-Eyed George Santos Pleads With Trump for Pardon, ‘Commutation, Clemency, Whatever’",
    "description": "Former New York Republican Congressman George Santos pleaded with President Donald Trump for a pardon, \"commutation, clemency, whatever.\"\nThe post Teary-Eyed George Santos Pleads With Trump for Pardon, ‘Commutation, Clemency, Whatever’ first appeared on Media…",
    "link": "https://www.mediaite.com/tv/teary-eyed-george-santos-pleads-with-trump-for-pardon-commutation-clemency-whatever/",
    "timestamp": "2025-05-09T01:07:19Z"
  },
  {
    "title": "What is in the new US-UK trade deal?",
    "description": "WASHINGTON: The \"breakthrough\" US-UK trade deal announced Thursday (May 8) by President Donald Trump is the first agreement to be unveiled since he slapped steep tariffs on allies and adversaries alike",
    "link": "https://www.channelnewsasia.com/world/us-uk-trade-deal-what-new-it-trump-tariffs-5118841",
    "timestamp": "2025-05-09T01:07:00Z"
  },
  {
    "title": "The new American pope can take Catholics in three directions",
    "description": "Americans (and Donald Trump) may want to stake their claims on him, but he now belongs to a much bigger organization.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/09/world/new-pope-leo-xiv/",
    "timestamp": "2025-05-09T01:07:00Z"
  },
  {
    "title": "Asian stocks edge up on optimism about trade talks",
    "description": "Shares in Japan, which was negotiating with the US for a deal to lower levies, jumped 1.1% while a regional gauge made moderate gains. Treasuries were little changed at the open after yields surged in the prior session, with traders paring bets on interest ra…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-on-optimism-about-trade-talks/articleshow/121014076.cms",
    "timestamp": "2025-05-09T01:03:40Z"
  },
  {
    "title": "U.S. automakers blast Trump's UK trade deal",
    "description": "The Trump administration's latest trade deal with Britain unfairly penalizes U.S. automakers that have partnered with Canada and Mexico, a trade group representing Detroit automakers said Thursday. In a sharply-worded statement, the American Automotive Policy…",
    "link": "https://japantoday.com/category/business/us-automakers-blast-trump%27s-uk-trade-deal",
    "timestamp": "2025-05-09T01:02:44Z"
  },
  {
    "title": "Top Trump admin health officials share vision for HHS to 'Make America Healthy Again'",
    "description": "HHS officials Robert F. Kennedy Jr., Dr. Mehmet Oz, Jay Bhattacharya and Marty Makary share their visions for the agency in an exclusive interview on 'Special Report.'",
    "link": "https://www.foxnews.com/media/top-trump-admin-health-officials-share-vision-hhs-make-america-healthy-again",
    "timestamp": "2025-05-09T01:00:10Z"
  },
  {
    "title": "Trump Floats Creating New Tax Bracket for Wealthiest Americans: Reports",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump this week told House Republicans to raise taxes on the richest Americans as part of their sprawling budget bill, according to The New York Times and The Washington Post, which cited peop…",
    "link": "https://biztoc.com/x/3e01378a9731ef05",
    "timestamp": "2025-05-09T00:59:38Z"
  },
  {
    "title": "Trump endorses several Congressional candidates",
    "description": "United States President Donald Trump gave his \"complete and total endorsement\" to members of the US Congress running for re-election in a number of posts on Truth Social, namely, Congressman Mike Bost...",
    "link": "https://biztoc.com/x/b5920f6f19ea5515",
    "timestamp": "2025-05-09T00:59:36Z"
  },
  {
    "title": "US stocks rise after Trump announces UK trade deal",
    "description": "NEW YORK: Stock markets mostly rose on Thursday (May 8) as US President Donald Trump unveiled a trade deal with Britain, boosting hopes for other countries' tariff negotiations. After the tu",
    "link": "https://www.channelnewsasia.com/business/us-stocks-wall-street-us-uk-trade-deal-5118836",
    "timestamp": "2025-05-09T00:59:33Z"
  },
  {
    "title": "Trump keeps 10% tariffs on UK but cuts taxes on British autos, steel and aluminum with trade deal",
    "description": "President Donald Trump has agreed to cut tariffs on British autos, steel and aluminum in a planned trade deal",
    "link": "https://biztoc.com/x/3b9b97ff12c4e663",
    "timestamp": "2025-05-09T00:59:28Z"
  },
  {
    "title": "Trump Floats Creating New Tax Bracket for Wealthiest Americans: Reports",
    "description": "Trump's reported demand could upend tenuous negotiations around the \"big, beautiful bill\" he wants House Republicans to pass.",
    "link": "https://www.newsweek.com/trump-tax-hike-wealthy-americans-reports-2069966",
    "timestamp": "2025-05-09T00:58:00Z"
  },
  {
    "title": "'Grow a backbone!' MAGA attorney unloads profane rant on Senate GOP as Trump yanks nominee",
    "description": "Far-right legal commentator and former Neil Gorsuch law clerk Mike Davis unloaded a furious, uncensored rant against Senate Republicans on the \"War Room\" show as President Donald Trump withdrew the nomination of far-right activist Ed Martin to be permanent U.…",
    "link": "https://www.rawstory.com/ed-martin-2671921058/",
    "timestamp": "2025-05-09T00:56:02Z"
  },
  {
    "title": "Kennedy defends Casey Means' nomination for surgeon general amid backlash",
    "description": "Means has largely been criticized over her reputation as a \"wellness influencer\" and lack of experience in public health administration.",
    "link": "https://justthenews.com/politics-policy/health/kennedy-defends-casey-means-nomination-surgeon-general-amid-backlash",
    "timestamp": "2025-05-09T00:53:59Z"
  },
  {
    "title": "Why is Bitcoin's Price Rising Today?",
    "description": "Bitcoin surged past $103,000 as traders bet on Fed rate cuts, welcomed signs of institutional inflows, and reacted to easing trade tensions.",
    "link": "https://decrypt.co/318680/why-bitcoins-price-rising-today",
    "timestamp": "2025-05-09T00:53:20Z"
  },
  {
    "title": "U.S. beginning to understand Russian positions, Kremlin aide says",
    "description": "\"It is clear, so it seems to me anyway, that there is an understanding of what we are trying to achieve as a result of this situation,\" Yuri Ushakov, a...",
    "link": "https://www.yahoo.com/news/u-beginning-understand-russian-positions-004948173.html",
    "timestamp": "2025-05-09T00:49:48Z"
  },
  {
    "title": "Trump says he is naming Fox News host and former judge Jeanine Pirro as top federal prosecutor in DC",
    "description": "President Donald Trump said Thursday that he is naming Fox News host Jeanine Pirro, a former county prosecutor and elected judge, to be the top federal prosecutor for the nation’s capital after abandoning his first pick for the job. Pirro, who joined Fox News…",
    "link": "https://japantoday.com/category/world/trump-says-he-is-naming-fox-news-host-and-former-judge-jeanine-pirro-as-top-federal-prosecutor-in-dc",
    "timestamp": "2025-05-09T00:45:37Z"
  },
  {
    "title": "‘JD Vance Is Wrong’: The Pope Appears Uneasy With Trump Immigration Policies",
    "description": "Before Cardinal Robert Francis Prevost became pope, a social media account under his name shared criticisms of the Trump administration’s positions on immigration.Months before Cardinal Robert Francis Prevost became the first American pope, a social media acc…",
    "link": "https://freerepublic.com/focus/f-news/4315836/posts",
    "timestamp": "2025-05-09T00:42:43Z"
  },
  {
    "title": "Jon Stewart Slams Trump as ‘F–king Wrongheaded’ About How Tariffs Impact Families: ‘No Value in Moderation for Himself’ | Video",
    "description": "“Why doesn’t he ever say: ‘Hey, you know what? Maybe you don’t need $350 billion,’” the host says on “The Weekly Show” podcast\nThe post Jon Stewart Slams Trump as ‘F–king Wrongheaded’ About How Tariffs Impact Families: ‘No Value in Moderation for Himself’ | V…",
    "link": "https://www.thewrap.com/jon-stewart-trump-dolls-tariffs-weekly-show-podcast/",
    "timestamp": "2025-05-09T00:41:47Z"
  },
  {
    "title": "President Biden's and the Democrats' Assault on the Supreme Court and the Rule of Law",
    "description": "Democrats tried to alter unconstitutionally the membership of the Supreme Court; they extorted Facebook into censoring free speech; they issued presidential executive orders unsupported by statute; and they pushed unprecedented prosecutions of Biden's predece…",
    "link": "https://reason.com/volokh/2025/05/08/president-bidens-and-the-democrats-assault-on-the-supreme-court-and-the-rule-of-law/",
    "timestamp": "2025-05-09T00:38:31Z"
  },
  {
    "title": "Starmer gets diplomatic win he needs, if not the economic boost",
    "description": "The framework the two leaders unveiled goes some way to reversing the worst impacts on the U.K. of U.S. tariffs.",
    "link": "https://www.japantimes.co.jp/news/2025/05/09/world/politics/starmer-trump-diplomatic-win/",
    "timestamp": "2025-05-09T00:37:00Z"
  },
  {
    "title": "A Day in the Live-Streamed Life of Donald Trump (Susan B. Glasser/New Yorker)",
    "description": "Susan B. Glasser / New Yorker:\nA Day in the Live-Streamed Life of Donald Trump  —  America's TV-obsessed President has made his rambling Oval Office press gaggles the signature of his second term—chaotic, self-aggrandizing, random, and frequently nasty.  —  I…",
    "link": "https://www.memeorandum.com/250508/p144",
    "timestamp": "2025-05-09T00:35:00Z"
  },
  {
    "title": "Op-Ed: The dead make a deal – UK and US put lipstick on tariffs",
    "description": "It’s like Granny has returned at gunpoint from the grave and left a postcard in the ruins.\nThe post Op-Ed: The dead make a deal – UK and US put lipstick on tariffs appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-the-dead-make-a-deal-uk-and-us-put-lipstick-on-tariffs/article",
    "timestamp": "2025-05-09T00:32:11Z"
  },
  {
    "title": "Trump names Jeanine Pirro interim US attorney for DC - WSVN 7News | Miami News, Weather, Sports | Fort Lauderdale",
    "description": "(CNN) — President Donald Trump announced Thursday he’s appointing Fox News host and former prosecutor Jeanine Pirro the interim US attorney for Washington, DC, after<a class=\"excerpt-read-more\" href=\"https://wsvn.com/entertainment/trump-names-jeanine-pirro-in…",
    "link": "https://wsvn.com/entertainment/trump-names-jeanine-pirro-interim-us-attorney-for-dc/",
    "timestamp": "2025-05-09T00:30:40Z"
  },
  {
    "title": "The head of FEMA defended the agency on Capitol Hill. Trump fired him.",
    "description": "The head of FEMA defended the agency on Capitol Hill. Trump fired him.\n\"This story was originally published by Grist. Sign up for Grist's weekly newsletter here.\"\nOn Thursday, the Trump administration forced Cameron Hamilton, the acting head of the Federal Em…",
    "link": "https://www.rawstory.com/fema-2671921073/",
    "timestamp": "2025-05-09T00:29:36Z"
  },
  {
    "title": "Ned Ryun: DC Swamp Trying to Cover Up J6 Fedsurection By Denying Ed Martin",
    "description": "Ned Ryun on \"The Jesse Kelly Show\" talks about why \"establishment\" Republicans oppose President Trump's pick for U.S. Attorney for the District of Columbia, Ed Martin. JESSE KELLY: What is it about Ed Martin and the role he's supposed to fill? What is it? It'…",
    "link": "https://freerepublic.com/focus/f-chat/4315835/posts",
    "timestamp": "2025-05-09T00:28:33Z"
  },
  {
    "title": "Vance fires back at Biden's criticism, calls his foreign policy a 'total disaster'",
    "description": "Vice President JD Vance fired back at Joe Biden's new criticism of the infamous Oval Office meeting with Ukrainian President Volodymyr Zelenskyy, dismissing the former commander-in-chief's foreign policy as a \"total disaster.\" \"I think it's rich for Joe Biden…",
    "link": "https://freerepublic.com/focus/f-chat/4315834/posts",
    "timestamp": "2025-05-09T00:27:59Z"
  },
  {
    "title": "Bill Gates blasts Musk, speeds up giving away fortune",
    "description": "NEW YORK &mdash; Microsoft co-founder Bill Gates announced Thursday an accelerated timeframe for giving away his fortune as he touted artificial intelligence (AI) as a game-changer to boost public health and save lives globally.",
    "link": "https://www.bangkokpost.com/world/3021017/bill-gates-blasts-musk-speeds-up-giving-away-fortune",
    "timestamp": "2025-05-09T00:26:00Z"
  },
  {
    "title": "Allbirds predicts turnaround if tariffs lucky break holds true",
    "description": "PLUS: Waterproof Allbirds - and some \"professional\" sneakers for the office.",
    "link": "https://www.nzherald.co.nz/business/allbirds-predicts-turnaround-if-tariffs-lucky-break-holds-true/EPCPS7CD3VEB7LPRUVGC7W75CE/",
    "timestamp": "2025-05-09T00:23:27Z"
  },
  {
    "title": "Lil Durk Denied Bail, Accused of Using Phone Accounts of 13 Other Inmates",
    "description": "Lil Durk, the Grammy-winning rapper, lost his bid to be released on bond strict with home detention and is vowing an appeal pending trial.",
    "link": "http://www.rollingstone.com/music/music-news/lil-durk-denied-bail-phone-calls-1235334462/",
    "timestamp": "2025-05-09T00:23:21Z"
  },
  {
    "title": "Watch: Jill Biden Steps In as Joe Struggles to Answer 'The View' Co-Host's Question About His Cognitive Health",
    "description": "in a recent episode of ABC's \"Teh View,\" former First Lady jill Biden stepped in to address questions about whether her husband, former President Joe Biden, experienced cognitive decline during his pr",
    "link": "https://www.conservativenewsdaily.net/breaking-news/watch-jill-biden-steps-in-as-joe-struggles-to-answer-the-view-co-hosts-question-about-his-cognitive-health/",
    "timestamp": "2025-05-09T00:21:13Z"
  },
  {
    "title": "Netanyahu's Israel cannot provide Trump with any wins he can promote back home",
    "description": "Less than a week before he arrives for a Middle East tour, U.S. President Donald Trump is praising the Houthis, giving up on Saudi-Israeli normalization and hardly mentioning Gaza and the hostages. Israel, it seems, will be watching the trip from the outside",
    "link": "https://www.haaretz.com/israel-news/haaretz-today/2025-05-09/ty-article/.premium/netanyahus-israel-cannot-provide-trump-with-any-wins-he-can-promote-back-home/00000196-b122-d9bf-a1b6-f9a25a910000",
    "timestamp": "2025-05-09T00:20:59Z"
  },
  {
    "title": "Australia's political conclave theatrics feel blokey, but the future is female",
    "description": "Far from Rome, the sky is thick with portent as Australia's political parties decide who has power in the current parliament.",
    "link": "https://www.abc.net.au/news/2025-05-09/conclave-australian-politics-liberals-greens-labor-party/105267614",
    "timestamp": "2025-05-09T00:19:54Z"
  },
  {
    "title": "Can Nick Saban and a Texas billionaire fix college sports? What we know about their vision",
    "description": "Trump has tapped the former Alabama coach and GOP mega-donor Cody Campbell to co-lead a sweeping reform effort. Here's what we think it means",
    "link": "https://www.cbssports.com/college-football/news/can-nick-saban-and-a-texas-billionaire-fix-college-sports-what-we-know-about-their-vision/",
    "timestamp": "2025-05-09T00:19:53Z"
  }
]