[
  {
    "title": "Alarming report shows US drowning in red ink — as Democrats block spending cuts",
    "description": "The federal government is racing toward a fiscal cliff, with a new report citing a mind-numbing $838 billion cash shortfall just for the first four months of the fiscal year.",
    "link": "https://nypost.com/2025/02/16/opinion/new-report-shows-us-drowning-in-debt-yet-democrats-aim-to-block-spending-cuts/",
    "timestamp": "2025-02-16T11:07:52Z"
  },
  {
    "title": "Coming to you almost daily from the Oval Office: Donald Trump",
    "description": "Donald Trump, back in the White House, is favoring almost-daily appearances from the Oval Office to communicate with the public. Leavitt confirmed this strategy highlights Trump's authority. His frequent sessions, addressing various issues, mark a sharp contr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/coming-to-you-almost-daily-from-the-oval-office-donald-trump/articleshow/118302245.cms",
    "timestamp": "2025-02-16T11:06:17Z"
  },
  {
    "title": "Ice hockey match between USA and Canada has three fights in first nine seconds",
    "description": "A bad-tempered ice hockey match between the United States and Canada on Saturday kicked off with three fights in the first nine seconds.",
    "link": "https://news.sky.com/story/ice-hockey-match-between-usa-and-canada-has-three-fights-in-first-nine-seconds-13310607",
    "timestamp": "2025-02-16T11:05:00Z"
  },
  {
    "title": "Ice hockey game between USA and Canada has three fights in first nine seconds",
    "description": "A bad-tempered ice hockey game between the United States and Canada on Saturday kicked off with three fights in the first nine seconds.",
    "link": "https://news.sky.com/story/ice-hockey-game-between-usa-and-canada-has-three-fights-in-first-nine-seconds-13310607",
    "timestamp": "2025-02-16T11:05:00Z"
  },
  {
    "title": "‘Salute and execute’: A new generation of military veterans takes center stage as Trump remakes US foreign policy",
    "description": "At the start of his first term, President Donald Trump filled several top jobs with retired generals — high-ranking veterans who served in leadership positions during the post-9/11 wars in Iraq and Afghanistan.",
    "link": "https://www.cnn.com/2025/02/16/politics/gabbard-hegseth-veterans-trump/index.html",
    "timestamp": "2025-02-16T11:00:48Z"
  },
  {
    "title": "6 Big Problems Congressional Republicans Need to Solve",
    "description": "From how many budget bills to adopt, to which toxic budget cuts they’ll include, to what do do about DOGE, Mike Johnson and John Thune face a political minefield as they seek to implement Trump’s legislative agenda.",
    "link": "http://nymag.com/intelligencer/article/6-big-problems-congress-republicans-trump-agenda.html",
    "timestamp": "2025-02-16T11:00:43Z"
  },
  {
    "title": "How Much More Is Europe Prepared to Lose?",
    "description": "The EU has already dramatically remade its societies, governance structure, and social values over the past three years in fight against Russia. Where will it end?",
    "link": "https://www.nakedcapitalism.com/2025/02/how-much-more-is-europe-prepared-to-lose.html",
    "timestamp": "2025-02-16T11:00:20Z"
  },
  {
    "title": "'This Is Life and Death': Trump's USAID Shakeup Threatens Millions in Sudan",
    "description": "The president's decision to cancel or suspend billions of dollars in foreign aid is deepening humanitarian crises across Africa.",
    "link": "https://www.newsweek.com/usaid-sudan-famine-doctors-without-borders-trump-2031620",
    "timestamp": "2025-02-16T11:00:02Z"
  },
  {
    "title": "The Biggest Obstacle to Progressive Success",
    "description": "Democrats’s cultural aversion to power has the rendered government incompetent and cleaved an opening for Trump.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/why-nothing-works-marc-dunkelman/681407/",
    "timestamp": "2025-02-16T11:00:00Z"
  },
  {
    "title": "The Tiny Texas Reptile Testing the “Drill, Baby, Drill” Agenda",
    "description": "This story was originally published by Vox.com and is reproduced here as part of the Climate Desk collaboration. While President Donald Trump has caused chaos and confusion in his first few weeks in office, he’s made one thing very clear: His administration w…",
    "link": "https://www.motherjones.com/politics/2025/02/texas-endangered-dunes-sagebrush-lizard-oil-gas-endangered-species-act-donald-trump-drill-baby/",
    "timestamp": "2025-02-16T11:00:00Z"
  },
  {
    "title": "Trump threw Ukraine under the Russian bus. NATO could be next.",
    "description": "The Trump administration is effectively ending the post-World War II international order and rewarding Russian aggression.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-hegseth-ukraine-russia-nato-rcna192135",
    "timestamp": "2025-02-16T11:00:00Z"
  },
  {
    "title": "UK accelerates major steel industry consultation in response to US tariffs",
    "description": "LONDON: Britain published a major consultation for its steel industry on Sunday (Feb 16), weeks ahead of schedule due to President Donald Trump's announcement of fresh tariffs on all steel imports into the United States. The \"Plan for Steel\" will look into is…",
    "link": "https://www.channelnewsasia.com/world/uk-accelerates-major-steel-industry-consultation-response-us-tariffs-4941206",
    "timestamp": "2025-02-16T10:57:41Z"
  },
  {
    "title": "Nigerian govt to absorb 28,000 health workers formerly paid by USAID",
    "description": "Mr Pate acknowledged the significant contribution of the US government to Nigeria's healthcare sector.",
    "link": "https://www.premiumtimesng.com/news/top-news/774709-nigerian-govt-to-absorb-28000-health-workers-formerly-paid-by-usaid.html",
    "timestamp": "2025-02-16T10:52:26Z"
  },
  {
    "title": "Nigeria govt to absorb 28,000 health workers formerly paid by USAID",
    "description": "Mr Pate acknowledged the significant contribution of the US government to Nigeria's healthcare sector.",
    "link": "https://www.premiumtimesng.com/news/top-news/774709-nigeria-govt-to-absorb-28000-health-workers-formerly-paid-by-usaid.html",
    "timestamp": "2025-02-16T10:52:26Z"
  },
  {
    "title": "President Trump's Social Security Changes So Far: 4 Things You Should Know",
    "description": "During his presidential campaign, Donald Trump promised to end federal taxation of Social Security retirement benefits. This isn't something he can do unilaterally. White House press secretary Karoline Leavitt told reporters that the president and Republican …",
    "link": "https://biztoc.com/x/6797d1f805d29166",
    "timestamp": "2025-02-16T10:51:48Z"
  },
  {
    "title": "Europe needs special Ukraine envoy to get meaningful peace role, Finland says after US rebuff",
    "description": "MUNICH (Reuters) - Europe needs a special envoy for Ukraine to ensure it gets a meaningful role in any peace process, two European leaders said on Sunday after the continent was ruled out as a partner in talks by U.S. President Donald Trump's administration. …",
    "link": "https://www.thestar.com.my/news/world/2025/02/16/europe-needs-special-ukraine-envoy-to-get-meaningful-peace-role-finland-says-after-us-rebuff",
    "timestamp": "2025-02-16T10:50:00Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
    "description": "The Indian market extended its losses on Friday, with all 13 major sectors closing in the red, as investors fretted about the impact of U.S. President Donald Trump's proposed reciprocal tariffs. Pharma stocks, heavily reliant on U.S. revenue, faced the sharpe…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/118301843.cms",
    "timestamp": "2025-02-16T10:43:31Z"
  },
  {
    "title": "Zoho Founder Sridhar Vembu's Big Warning As Trump Demands Reciprocal Trade",
    "description": "India may witness some economic hardships amid US President Donald Trump&#039;s push for balancing bilateral trade with threats of reciprocal tariffs, warned Zoho founder Sridhar Vembu.",
    "link": "https://www.ndtv.com/world-news/inflation-ahead-zoho-founder-sridhar-vembus-big-warning-as-trump-demands-reciprocal-trade-7723560",
    "timestamp": "2025-02-16T10:41:53Z"
  },
  {
    "title": "Stubb on US involvement in Europe: \"The message has been clear\"",
    "description": "Finnish President Alexander Stubb says Europe must do more for its own security.",
    "link": "https://yle.fi/a/74-20144002",
    "timestamp": "2025-02-16T10:35:53Z"
  },
  {
    "title": "Flash Flood and Flood Warnings In Place for All Kentucky Counties",
    "description": "At least one person has lost their life, while thousands have been left without power as a result of the torrential rain.",
    "link": "https://www.newsweek.com/flash-flood-warnings-all-kentucky-counties-2031880",
    "timestamp": "2025-02-16T10:33:01Z"
  },
  {
    "title": "US retail sales battered by severe weather in January",
    "description": "US retail sales plunged by the most in almost two years in January.",
    "link": "https://www.enca.com/business/us-retail-sales-battered-severe-weather-january",
    "timestamp": "2025-02-16T10:32:19Z"
  },
  {
    "title": "Analyst Says SUI Price Could Fall To $1.6 — Here’s Why",
    "description": "The SUI price registered its best seven-day performance yet — in 2025 — over the past week. However, the altcoin has ended the week on the worst possible note, declining in value by almost 5% on Saturday, February 15th. What’s more worrying is — the downward …",
    "link": "http://www.newsbtc.com/sui/analyst-says-sui-price-could-fall-to-1-6-heres-why/",
    "timestamp": "2025-02-16T10:30:44Z"
  },
  {
    "title": "UK Sunday Shows",
    "description": "I just had to turn off the Sunday shows here it's awful just loads of gov't spokesmen (and women) saying the same regurgitated NONSENSE. Makes me angry ... They act like robots repeating the same lines along with the fawning, classless media. How things will …",
    "link": "https://freerepublic.com/focus/f-chat/4297976/posts",
    "timestamp": "2025-02-16T10:24:18Z"
  },
  {
    "title": "Taiwan detects dozens of Chinese aircraft near island",
    "description": "Chinese jets tell Canadian warship transiting through the Taiwan Strait to change course.",
    "link": "https://www.aljazeera.com/news/2025/2/16/taiwan-detects-dozens-of-chinese-aircraft-near-island",
    "timestamp": "2025-02-16T10:23:20Z"
  },
  {
    "title": "UK’s Starmer to attend emergency European summit in Paris",
    "description": "France has yet to confirm that an informal leaders meeting will be held on Monday.",
    "link": "https://www.politico.eu/article/uk-keir-starmer-paris-emergency-europe-macron/",
    "timestamp": "2025-02-16T10:22:21Z"
  },
  {
    "title": "Modi-Trump Meeting: Promising Developments, Good Optics, But Challenges Remain",
    "description": "No mention was made of a possible sanctions waiver for India’s development of Iran’s Chabahar port, which India secured from the U.S. during Trump 1.0.",
    "link": "https://thediplomat.com/2025/02/modi-trump-meeting-promising-developments-good-optics-but-challenges-remain/",
    "timestamp": "2025-02-16T10:12:00Z"
  },
  {
    "title": "India-US TRUST to drive economic cooperation, IMEC framework to boost infra collaboration: Experts",
    "description": "Prime Minister Narendra Modi and US President Donald Trump have launched the TRUST initiative to strengthen economic and technological cooperation, focusing on supply chains of critical minerals like lithium. The IMEC framework will enhance collaboration in i…",
    "link": "https://economictimes.indiatimes.com/news/india/india-us-trust-to-drive-economic-cooperation-imec-framework-to-boost-infra-collaboration-experts/articleshow/118301295.cms",
    "timestamp": "2025-02-16T10:09:22Z"
  },
  {
    "title": "Trump Tours Boeing Plane to Highlight Aircraft Maker's Delay in Delivering a New Air Force One",
    "description": "WEST PALM BEACH, Fla. (AP) — President Donald Trump toured a Boeing airplane to check out new hardware and technology features and highlight the aircraft maker's delay in delivering updated versions of the Air Force One presidential aircraft, the White House …",
    "link": "https://biztoc.com/x/71955621ae24873c",
    "timestamp": "2025-02-16T10:07:36Z"
  },
  {
    "title": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 33",
    "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape. Mobile Indian Cyber Heist: FatBoyPanel And His Massive Data Breach Google Tag Manager Skimmer Steals Credit Card Info From M…",
    "link": "https://securityaffairs.com/174262/malware/security-affairs-malware-newsletter-round-33.html",
    "timestamp": "2025-02-16T10:01:42Z"
  },
  {
    "title": "A Supreme History",
    "description": "UCLA law professor Stuart Banner’s new book is simply the finest and most valuable book ever written about the U.S. Supreme Court, a work of such erudite breadth and interpretive sophistication that in a world governed by merit it would be a slam-dunk winner …",
    "link": "https://freebeacon.com/culture/a-supreme-history/",
    "timestamp": "2025-02-16T10:01:39Z"
  },
  {
    "title": "Healthy recipes a focus for Sen. Marsha Blackburn, MAHA supporter and home cook",
    "description": "Sen. Marsha Blackburn of Tennessee tells Fox News Digital why she supports the Make America Healthy Again movement and shares healthy cooking tips and a favorite recipe.",
    "link": "https://www.foxnews.com/food-drink/healthy-recipes-focus-sen-marsha-blackburn-maha-supporter-home-cook",
    "timestamp": "2025-02-16T10:00:20Z"
  },
  {
    "title": "It’s easy to guess why Trump has quit talking about inflation",
    "description": "While his campaign references to cost-of-living pressures helped the US president win the White House, he now tends to change the topic whenever it’s brought up. Tariff talk has trumped price talk.",
    "link": "https://www.livemint.com/opinion/online-views/trump-inflation-us-president-white-house-groceries-prices-tariffs-imports-trade-deficit-cost-of-living-republicans-taxes-11739428286491.html",
    "timestamp": "2025-02-16T10:00:12Z"
  },
  {
    "title": "Upending Language: The Times and Its Trump Verb of Choice",
    "description": "As the New York Times tries to find measured phrasing to describe his seizure of power, it goes for the same word over and over.",
    "link": "http://nymag.com/intelligencer/article/upending-language-the-times-and-its-trump-verb-of-choice.html",
    "timestamp": "2025-02-16T10:00:04Z"
  },
  {
    "title": "'Islamic State Will Capitalize' After Musk's DOGE Shutters USAID",
    "description": "\"The decision to cut the operations of USAID … is myopic and will ultimately fuel the grievances that terrorists leverage.\"",
    "link": "https://www.newsweek.com/islamic-state-will-capitalize-after-musks-doge-shutters-usaid-2031069",
    "timestamp": "2025-02-16T10:00:03Z"
  },
  {
    "title": "A Toronto councillor wants to drive Tesla out of town. But the city says it hasn't broken any bylaws",
    "description": "Toronto's deputy mayor says he wants to drive Elon Musk's electric vehicle company Tesla out of town because of the tech mogul's affiliation with U.S. President Donald Trump, who's taken aim at Canada with a spate of recent tariff announcements.",
    "link": "https://www.cbc.ca/news/canada/toronto/toronto-tesla-colle-yorkdale-1.7459880",
    "timestamp": "2025-02-16T10:00:00Z"
  },
  {
    "title": "Small businesses struggle to find their footing one month into Trump 2.0",
    "description": "Uncertainty is running high on Main Street after a deluge of economic policy changes, with some entrepreneurs reporting unpaid invoices and other funding worries.",
    "link": "https://www.nbcnews.com/business/economy/small-businesses-struggle-find-footing-one-month-trump-20-rcna192000",
    "timestamp": "2025-02-16T10:00:00Z"
  },
  {
    "title": "How Elon Musk is boosting far-right politics across the globe",
    "description": "Elon Musk has encouraged right-wing political movements, policies and administrations in at least 18 countries.",
    "link": "https://www.nbcnews.com/tech/elon-musk/elon-musk-boosting-far-right-politics-globe-rcna189505",
    "timestamp": "2025-02-16T10:00:00Z"
  },
  {
    "title": "Gaza After Hamas",
    "description": "Without a reformed Palestinian Authority presence in Gaza, Hamas will continue to rule the Strip.\nThe post Gaza After Hamas appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/middle-east-watch/gaza-after-hamas/",
    "timestamp": "2025-02-16T10:00:00Z"
  },
  {
    "title": "Starmer's diplomatic contortions to keep Trump and Ukraine happy are getting more extreme",
    "description": "Unlike Theresa May, Sir Keir Starmer will not be the first world leader to set foot in the Trump White House, but he has at least now secured an invitation to Washington.",
    "link": "https://news.sky.com/story/starmers-diplomatic-contortions-to-keep-trump-and-ukraine-happy-are-getting-more-extreme-13310588",
    "timestamp": "2025-02-16T09:59:00Z"
  },
  {
    "title": "Trump Administration Struggling to Find Fired Nuclear Safety Staff: Report",
    "description": "President Donald Trump's administration is struggling to contact recently laid-off nuclear safety employees to inform them that they have been reinstated, according to reports.\nNewsweek has contacted the Department of Energy, which oversees the National Nucle…",
    "link": "https://biztoc.com/x/85964b3d33624caa",
    "timestamp": "2025-02-16T09:57:00Z"
  },
  {
    "title": "Trump Administration Struggling to Find Fired Nuclear Safety Staff: Report",
    "description": "Workers who were recently let go at the National Nuclear Security Administration have had their positions reinstated.",
    "link": "https://www.newsweek.com/trump-nuclear-safety-staff-fired-rescinded-contact-2031874",
    "timestamp": "2025-02-16T09:53:14Z"
  },
  {
    "title": "Embattled ex-special counsel Jack Smith discloses $140K ‘gift’ of free legal services",
    "description": "The former special counsel who brought two criminal cases against President Donald Trump received $140,000 in free legal services from a prominent Washington law firm last month. Covington & Burling provided Jack Smith with the gift of pro-bono legal assistan…",
    "link": "https://freerepublic.com/focus/f-chat/4297974/posts",
    "timestamp": "2025-02-16T09:49:06Z"
  },
  {
    "title": "Trump Media losses surge as it hands staff $107 million in stock",
    "description": "Trump Media losses surge as it hands staff $107 million in stock\nPresident Donald Trump during an executive order signing in the Oval Office on Thursday.\nFrancis Chung—Politico/Bloomberg via Getty Images",
    "link": "https://biztoc.com/x/847615c0a9ae89ea",
    "timestamp": "2025-02-16T09:47:06Z"
  },
  {
    "title": "Is President Donald Trump on a Collision Course With History? More Than a Century of Data Paints a Clear Picture",
    "description": "For more than two years, optimists have firmly held the reins on Wall Street. Since 2022 came to a close, the iconic Dow Jones Industrial Average (DJINDICES: ^DJI), widely followed S&P 500 (SNPINDEX: ^GSPC), and innovation-propelled Nasdaq Composite (NASDAQIN…",
    "link": "https://biztoc.com/x/55baaa9934d910ca",
    "timestamp": "2025-02-16T09:46:53Z"
  },
  {
    "title": "Elon Musk said 2025 could be Tesla's 'most important year.' Here's what's on the agenda.",
    "description": "Elon Musk said 2025 would see Tesla produce thousands of Optimus robots, a lower-cost model, and the launch of a fully self-driving robotaxi service.",
    "link": "https://www.businessinsider.com/tesla-expected-launches-this-year-cheaper-car-optimus-robotaxi-fsd-2025-2",
    "timestamp": "2025-02-16T09:39:02Z"
  },
  {
    "title": "US vice president's critical remarks in Munich draw reactions across Europe",
    "description": "European politicians have criticized U.S. Vice President JD Vance's Friday remarks at the Munich Security Conference accusing Europe of censoring free speech and other shortcomings, but also said they could present an opportunity.",
    "link": "https://www.hurriyetdailynews.com/us-vice-presidents-critical-remarks-in-munich-draw-reactions-across-europe-205874",
    "timestamp": "2025-02-16T09:38:30Z"
  },
  {
    "title": "IDF chief Halevi to fly to US for first and only visit of term",
    "description": "The fact that he has never visited as IDF chief also explains why Halevi's trip is a full three days, whereas typically, such a trip might only be one or two days.",
    "link": "https://www.jpost.com/israel-news/article-842313",
    "timestamp": "2025-02-16T09:29:36Z"
  },
  {
    "title": "White South Africans gather in support of Trump and his claims that they are victims of racism",
    "description": "PRETORIA, SOUTH AFRICA — Some white South Africans showed support for President Donald Trump on Saturday and gathered at the U.S. Embassy in Pretoria to claim they are victims of racism by their own government.\n\n\nHundreds of protesters held placards that read…",
    "link": "https://www.voanews.com/a/white-south-africans-gather-in-support-of-trump-and-his-claims-that-they-are-victims-of-racism/7976735.html",
    "timestamp": "2025-02-16T09:27:56Z"
  },
  {
    "title": "Democrats confront their powerlessness as Trump flexes authority | CNN Politics",
    "description": "Amid Democrats’ shock and bickering over how much to respond to President Donald Trump is a deeper question rippling through leaders across the Capitol and across the country: How much should they rely on the same institutional and procedural maneuvers they u…",
    "link": "https://www.cnn.com/2025/02/16/politics/democrats-strategy-powerless-trump/index.html",
    "timestamp": "2025-02-16T09:23:46Z"
  },
  {
    "title": "Inside the mind of a meme coin trader",
    "description": "Meme coin traders who spoke to BI didn't fit a particular mold, but were united in their love of the thrill of watching the numbers go up.",
    "link": "https://www.businessinsider.com/meme-coins-trading-doge-pepe-trump-melania-retail-investors-crypto-2025-2",
    "timestamp": "2025-02-16T09:20:01Z"
  },
  {
    "title": "Middle East: Rubio arrives in Israel, along with heavy bombs",
    "description": "US top diplomat Marco Rubio is in Israel to discuss the ceasefire in Gaza with Premier Benjamin Netanyahu. The trip coincides with the arrival of a shipment of US 2,000-pound bombs. DW has more.",
    "link": "https://www.dw.com/en/middle-east-rubio-arrives-in-israel-along-with-heavy-bombs/live-71627641",
    "timestamp": "2025-02-16T09:13:00Z"
  },
  {
    "title": "Israel receives shipment of heavy bombs cleared by Trump",
    "description": "US president lifted block imposed on munitions export by Biden administration",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/16/israel-receives-shipment-of-heavy-bombs-cleared-by-trump/",
    "timestamp": "2025-02-16T09:07:29Z"
  },
  {
    "title": "Is President Donald Trump on a Collision Course With History? More Than a Century of Data Paints a Clear Picture.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_f40887ba-f539-45cd-99f7-9997a0bff766",
    "timestamp": "2025-02-16T09:06:00Z"
  },
  {
    "title": "Tariff threats are already driving investment out of Canada",
    "description": "No one knows what Donald Trump really wants. But he's already seeing results he'll be happy with as Canadian businesses consider moving investment out of Canada and focusing on the U.S.",
    "link": "https://biztoc.com/x/a409ecf853694d8f",
    "timestamp": "2025-02-16T09:05:59Z"
  },
  {
    "title": "GOP rep who returned to Congress after eight-year break credits Trump with unifying party",
    "description": "Rep. Marlin Stutzman spoke with Fox News Digital about returning to Congress after an eight-year hiatus.",
    "link": "https://www.foxnews.com/politics/gop-rep-who-returned-congress-after-8-year-break-credits-trump-unifying-party",
    "timestamp": "2025-02-16T09:00:59Z"
  },
  {
    "title": "McConnell's mental acuity targeted by Trump after ex-Senate leader joins Dems against Cabinet nominees",
    "description": "The GOP's recent and longest-serving Senate party leader has stood in opposition to his conference multiple times, demonstrating the party’s significant transformation in the age of Trump.",
    "link": "https://www.foxnews.com/politics/mcconnells-mental-acuity-targeted-trump-after-ex-senate-leader-joins-dems-against-cabinet-nominees",
    "timestamp": "2025-02-16T09:00:56Z"
  },
  {
    "title": "Blue city faces calls for corruption probe in teacher's 'suicide' by 20 stab wounds case",
    "description": "Private eye Tom Brennan slams Pennsylvania Gov. Josh Shapiro and calls on DOJ to probe Philadelphia's handling of Ellen Greenberg's stabbing death, once ruled suicide.",
    "link": "https://www.foxnews.com/us/blue-city-faces-calls-corruption-probe-teachers-suicide-20-stab-wounds-case",
    "timestamp": "2025-02-16T09:00:37Z"
  },
  {
    "title": "After 'Canada First' rally, Poilievre supporters say they're ready to go beyond 'axe the tax'",
    "description": "Much like internal Conservative debates around how much Poilievre should focus on axing the tax, his supporters were also split",
    "link": "https://nationalpost.com/news/politics/after-canada-first-rally-poilievre-supporters-say-theyre-ready-to-go-beyond-axe-the-tax",
    "timestamp": "2025-02-16T09:00:28Z"
  },
  {
    "title": "Today in History: February 16, Castro sworn in as Cuban leader",
    "description": "Fidel Castro was sworn in as premier of Cuba, six weeks after dictator Fulgencio Batista announced his resignation and fled the country into exile.",
    "link": "https://www.bostonherald.com/2025/02/16/today-in-history-february-16-castro-sworn-in-as-cuban-leader/",
    "timestamp": "2025-02-16T09:00:12Z"
  },
  {
    "title": "Today in History: February 16, Castro sworn in as Cuban leader",
    "description": "Fidel Castro was sworn in as premier of Cuba, six weeks after dictator Fulgencio Batista announced his resignation and fled the country into exile.",
    "link": "https://www.denverpost.com/2025/02/16/today-in-history-february-16-castro-sworn-in-as-cuban-leader/",
    "timestamp": "2025-02-16T09:00:12Z"
  },
  {
    "title": "Texas to Become Biggest State by 2045 As Center of Gravity Shifts South",
    "description": "The population of the Lone Star State increased by nearly four million people between 2013 and 2023.",
    "link": "https://www.newsweek.com/texas-become-biggest-state-2045-center-gravity-shifts-south-2031011",
    "timestamp": "2025-02-16T09:00:01Z"
  },
  {
    "title": "Trump claims the trade deficit with Canada is a $200B subsidy. Experts disagree",
    "description": "U.S. President Donald Trump’s claim that his country subsidizes Canada with hundreds of billions of dollars every year has become a key plank in his argument for annexing the country. But do his numbers add up?",
    "link": "https://www.cbc.ca/news/politics/trump-trade-deficit-subsidy-canada-1.7458076",
    "timestamp": "2025-02-16T09:00:00Z"
  },
  {
    "title": "Tariff threats are already driving investment out of Canada",
    "description": "No one knows what Donald Trump really wants. But he's already seeing results he'll be happy with as Canadian businesses consider moving investment out of Canada and focusing on the U.S.",
    "link": "https://www.cbc.ca/news/business/tariffs-trump-investment-1.7459832",
    "timestamp": "2025-02-16T09:00:00Z"
  },
  {
    "title": "Releasing prisoners for hostages was a historic mistake, Ben-Gvir says",
    "description": "Ben-Gvir claims that he told Netanyahu that releasing prisoners would be 'a historic mistake that will set us back,' and the deal could lead to 'our children being kidnapped in another October 7.",
    "link": "https://www.jpost.com/israel-news/article-842293",
    "timestamp": "2025-02-16T08:59:05Z"
  },
  {
    "title": "Ukraine Has Low Chance Of Survival Without US Backing: Volodymyr Zelensky",
    "description": "Ukraine has little chance of surviving Russia&#039;s assault without US support, President Volodymyr Zelensky said.",
    "link": "https://www.ndtv.com/world-news/ukraine-has-low-chance-of-survival-without-us-backing-volodymyr-zelensky-7722952",
    "timestamp": "2025-02-16T08:47:17Z"
  },
  {
    "title": "Rubio kicks off Mideast trip in Israel as Arab leaders reel from Trump's Gaza proposal",
    "description": "Secretary of State Marco Rubio is kicking of a Mideast tour in Israel on Sunday",
    "link": "https://abcnews.go.com/International/wireStory/rubio-kicks-off-mideast-trip-israel-arab-leaders-118870945",
    "timestamp": "2025-02-16T08:38:26Z"
  },
  {
    "title": "In Ukraine, a potential arms-for-minerals deal inspires hope and skepticism",
    "description": "Ukraine boasts vast reserves of ilmenite, a key element used to produce titanium, in the heavy mineral sands that stretch for miles along the country’s embattled east",
    "link": "https://abcnews.go.com/International/wireStory/ukraine-potential-arms-minerals-deal-inspires-hope-skepticism-118871035",
    "timestamp": "2025-02-16T08:38:21Z"
  },
  {
    "title": "Macron calls emergency summit amid Ukraine peace talks - Warsaw",
    "description": "The EU “needs to respond” to Trump’s way of negotiating, Poland’s foreign minister has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612802-macron-calls-emergency-summit-amid/",
    "timestamp": "2025-02-16T08:35:24Z"
  },
  {
    "title": "Announcement of India-US trade agreement has boosted biz confidence: Goyal",
    "description": "India and the US are set to negotiate a bilateral trade agreement aimed at enhancing economic ties, with plans to more than double two-way commerce to USD 500 billion by 2030. This anticipated deal, set for fall 2025, is expected to boost confidence and lever…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/announcement-of-india-us-trade-agreement-has-boosted-biz-confidence-goyal/articleshow/118299545.cms",
    "timestamp": "2025-02-16T08:32:54Z"
  },
  {
    "title": "European leaders to hold emergency summit on Ukraine as Trump pushes for war’s end - CNN",
    "description": "European leaders to hold emergency summit on Ukraine as Trump pushes for war’s endCNN French President Emmanuel Macron calls emergency meeting of world leaders to discuss Donald Trump: ReportThe Times of India Starmer to join Macron-led European crisis summit…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176270091",
    "timestamp": "2025-02-16T08:32:37Z"
  },
  {
    "title": "Manu Joseph: Our politics is usually shaped by the people we dislike",
    "description": "Where people stand politically can often be traced to what sort of individuals left us miffed",
    "link": "https://www.livemint.com/opinion/online-views/manu-joseph-donald-trump-elon-musk-woke-right-wing-left-wing-republicans-democrats-liberals-neoliberals-silicon-valley-11739470418729.html",
    "timestamp": "2025-02-16T08:30:09Z"
  },
  {
    "title": "Announcement of India-US trade agreement has boosted business confidence: Goyal",
    "description": "The commerce minister said India is expanding global partnerships with new trade deals, including those with Australia, the UAE, and the EFTA bloc",
    "link": "https://www.thehindubusinessline.com/economy/announcement-of-india-us-trade-agreement-has-boosted-business-confidence-goyal/article69225822.ece",
    "timestamp": "2025-02-16T08:25:39Z"
  },
  {
    "title": "Fans In Montreal Loudly Boo US Anthem Prior To Americans' 4 Nations Face-Off Game Vs. Canada",
    "description": "Fans in Montreal loudly booed the U.S. national anthem prior to the 4 Nations Face-Off game between the Americans and host Canada.",
    "link": "https://www.huffpost.com/entry/hockey-nations-us-anthem-booed_n_67b1a005e4b0d77e1ea4a5f3",
    "timestamp": "2025-02-16T08:24:02Z"
  },
  {
    "title": "Israel receives shipment of heavy bombs cleared by Trump",
    "description": "<p>JERUSALEM - Israel has received a shipment of heavy MK-84 bombs from the United States, after US President Donald Trump lifted a block imposed on the export of the munitions by the administration of predecessor Joe Biden, the defence ministry said on Sunda…",
    "link": "https://www.bangkokpost.com/world/2962148/israel-receives-shipment-of-heavy-bombs-cleared-by-trump",
    "timestamp": "2025-02-16T08:23:00Z"
  },
  {
    "title": "Trump wants US troops to guard Ukraine’s rare earths – NBC",
    "description": "Washington reportedly indicated it wants to control 50% of the country’s minerals as reimbursement for American aid Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612803-us-troops-guard-ukraine-rare-earth/",
    "timestamp": "2025-02-16T08:14:17Z"
  },
  {
    "title": "Government plans to protect UK steel industry amid threat of tariffs",
    "description": "US President Donald Trump is set to impose 25% taxes on steel entering America \"without exceptions\".",
    "link": "https://www.bbc.co.uk/news/articles/cx2483zrz0zo",
    "timestamp": "2025-02-16T08:12:21Z"
  },
  {
    "title": "Shipment of 'heavy' US bombs arrives in Israel: Defence Ministry",
    "description": "Israel's defence ministry said Sunday that a shipment of \"heavy\" US-made bombs arrived overnight in Israel, as Marco Rubio began his first visit to the country as Washington's top diplomat. Rubio, meanwhile, began his official trip to Israel on Sunday, and is…",
    "link": "https://economictimes.indiatimes.com/news/defence/shipment-of-heavy-us-bombs-arrives-in-israel-defence-ministry/articleshow/118299084.cms",
    "timestamp": "2025-02-16T08:10:27Z"
  },
  {
    "title": "Taiwan detects 24 Chinese aircraft as Canadian ship transits waters",
    "description": "The United States and its allies regularly pass through the 180km Taiwan Strait to reinforce its status as an international waterway, angering China.",
    "link": "https://www.channelnewsasia.com/east-asia/taiwan-chinese-aircraft-canadian-ship-4941551",
    "timestamp": "2025-02-16T08:07:52Z"
  },
  {
    "title": "\"National Interest\": Shashi Tharoor Defends Remarks On PM Modi-Trump Meet",
    "description": "Congress MP Shashi Tharoor on Saturday defended his praise for Prime Minister Narendra Modi following his meeting with US President Donald Trump.",
    "link": "https://www.ndtv.com/india-news/indias-interest-shashi-tharoor-defends-his-praise-on-pm-modi-trump-meet-7722706",
    "timestamp": "2025-02-16T08:03:37Z"
  },
  {
    "title": "Why is Trump pausing US anti-bribery law?",
    "description": "U.S. President Donald Trump signed an executive order this week pausing almost all enforcement of a decades-old U.S. anti-bribery law.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-voa03.htm",
    "timestamp": "2025-02-16T08:02:12Z"
  },
  {
    "title": "Rubio Arrives In Israel, Expected To Press Trump's Plan For Gaza",
    "description": "U.S. Secretary of State Marco Rubio arrived in Israel late on February 15 to begin his first Middle East tour since assuming his position as the top U.S. diplomat last month.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-rferl01.htm",
    "timestamp": "2025-02-16T08:01:45Z"
  },
  {
    "title": "From the Gulf of America to Fort Bragg, what's behind Trump's name changes?",
    "description": "Donald Trump's renaming of the Gulf of Mexico and other landmarks suggests his greater vision for America",
    "link": "https://www.bbc.com/news/articles/cwypzzey425o",
    "timestamp": "2025-02-16T08:01:22Z"
  },
  {
    "title": "Don't Believe TikTok. Trump's ERS Doesn't Mean the End of Income Taxes",
    "description": "Even if the External Revenue Service becomes a reality, you'll still have to pay taxes. Here's why.",
    "link": "https://www.cnet.com/personal-finance/taxes/dont-believe-tiktok-trumps-ers-doesnt-mean-the-end-of-income-taxes/",
    "timestamp": "2025-02-16T08:00:00Z"
  },
  {
    "title": "Trade wars, explained",
    "description": "\"Trade wars are good, and easy to win,\" Donald Trump said in 2018 – and he has begun his second term launching one against China. But until relatively recently, most of the world was in a continuous state of trade war.\nHow old are trade wars? \nUntil the 19th …",
    "link": "https://biztoc.com/x/c0ca723a84924f3a",
    "timestamp": "2025-02-16T07:54:48Z"
  },
  {
    "title": "UN Arab envoys dismiss Trump's plot to displace Palestinians in Gaza",
    "description": "A group of Arab and Muslim ambassadors at the United Nations have denounced U.S. President Donald Trump's declared goal of forcibly removing Palestinians from their homes in the besieged Gaza Strip, calling it a blatant violation of international law.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-irna05.htm",
    "timestamp": "2025-02-16T07:54:10Z"
  },
  {
    "title": "Anyone pushing for new deal of century 'delusional': Palestinian president",
    "description": "Palestinian Authority President Mahmoud Abbas has firmly opposed any attempts to forcibly displace Palestinians from their homeland, stating that a new \"deal of the century\" will not materialize.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-irna04.htm",
    "timestamp": "2025-02-16T07:54:07Z"
  },
  {
    "title": "Hamas frees 3 hostages; Israel releases hundreds of prisoners",
    "description": "Hamas released three more hostages Saturday in exchange for nearly 400 Palestinian prisoners, who were freed later in the day.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-voa01.htm",
    "timestamp": "2025-02-16T07:49:49Z"
  },
  {
    "title": "Israeli military 'preparing offensive plans' amid efforts to free all captives: Army chief",
    "description": "The Israeli army's chief of staff says the military is \"preparing offensive plans\" despite continuing efforts to return the remaining captives under the ongoing ceasefire deal in the Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-presstv04.htm",
    "timestamp": "2025-02-16T07:49:49Z"
  },
  {
    "title": "Hamas releases three Israeli captives for 369 Palestinian prisoners",
    "description": "Gaza resistance fighters have handed three Israeli captives over to the Red Cross in an exchange for 369 Palestinians to be released later in the latest such swap under an ongoing truce deal.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250215-presstv08.htm",
    "timestamp": "2025-02-16T07:49:49Z"
  },
  {
    "title": "IAEA Warns About Iran's Accelerated Uranium Production",
    "description": "The head of the International Atomic Energy Agency (IAEA) has warned that Iran continues to increase its monthly production of enriched uranium to near weapons grade and time is running out to reach an agreement to curb Iran's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250215-rferl02.htm",
    "timestamp": "2025-02-16T07:48:43Z"
  },
  {
    "title": "Iran will develop defense capacities proportional to threats: Army commander",
    "description": "A top commander of the Iranian Army has said the Armed Forces are committed to developing defense capabilities in keeping with emerging threats against the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250215-presstv01.htm",
    "timestamp": "2025-02-16T07:48:34Z"
  }
]