[
  {
    "title": "Trump And Scott Bessent Singing Different Tune On Tariff Rebate Checks",
    "description": "Treasury Secretary Scott Bessent on Wednesday contradicted President Donald Trump on his pledge to send Americans tariff rebate checks.",
    "link": "https://dailycaller.com/2025/11/12/trump-scott-bessent-tariff-rebate-checks/",
    "timestamp": "2025-11-12T17:47:10Z"
  },
  {
    "title": "U.S. Mint in Philadelphia to press final penny as the 1-cent coin gets canceled",
    "description": "President Donald Trump has ordered its demise as costs climb to nearly 4 cents per penny and the 1-cent valuation becomes somewhat obsolete. The U.S. Mint has been making pennies in Philadelphia, the nation's birthplace, since 1793. The last one is being made…",
    "link": "https://www.pbs.org/newshour/nation/u-s-mint-in-philadelphia-to-press-final-penny-as-the-1-cent-coin-gets-canceled",
    "timestamp": "2025-11-12T17:46:48Z"
  },
  {
    "title": "Epstein email says Trump 'knew about the girls'",
    "description": "President Donald Trump says Democrats who released Jeffrey Epstein emails mentioning him are trying to bring up his ties to the late sex offender again because \"they’ll do anything at all to deflect on how badly they’ve done” on the government shutdown and ot…",
    "link": "https://www.wftv.com/news/politics/epstein-emails/QFEY2YF4IE463GXLQB3EJJ76SM/",
    "timestamp": "2025-11-12T17:46:32Z"
  },
  {
    "title": "Author Michael Wolff Appears To Advise Jeffrey Epstein On How To Blackmail Trump In Newly Released Emails",
    "description": "Anti-Trump author Michael Wolff appeared to advise disgraced sex offender Jeffrey Epstein on how to blackmail President Donald Trump in newly released emails.",
    "link": "https://dailycaller.com/2025/11/12/michael-wolff-jeffrey-epstein-blackmail-trump/",
    "timestamp": "2025-11-12T17:44:52Z"
  },
  {
    "title": "Toyota makes good on 4-year-old promise as it opens ‘pivotal’ new hub in US",
    "description": "Toyota has been one of the slowest automakers to move to full EVs but has rapidly moved to convert its best-selling vehicles to hybrids",
    "link": "https://www.the-independent.com/life-style/motoring/motoring-news/toyota-battery-plant-north-carolina-factory-b2863993.html",
    "timestamp": "2025-11-12T17:44:17Z"
  },
  {
    "title": "Caitlin Clark shows her true colors and reacts angrily to criticism from Fever's Sophie Cunningham after her swing at the Annika Pro-AM: \"GIRL, I KNOW\"",
    "description": "Caitlin Clark participated for the second consecutive year in the LPGA&apos;s Annika Pro-Am tournament and showed off her talent as a golfer, but she wasn&apos;t alone.\nHer teammat",
    "link": "https://www.marca.com/en/basketball/wnba/indiana-fever/2025/11/12/6914c72a22601de14d8b45ab.html",
    "timestamp": "2025-11-12T17:44:14Z"
  },
  {
    "title": "Steve Bannon faces MAGA backlash after Trump comments on lack of 'talented' Americans",
    "description": "MAGA influencer Steve Bannon sought to \"calm\" his followers after President Donald Trump defended the use of foreign workers by saying that there were not enough \"talented\" Americans.In an interview on Fox News this week, host Laura Ingraham argued against th…",
    "link": "https://www.rawstory.com/bannon-trump-h-1b-visas-calm/",
    "timestamp": "2025-11-12T17:44:11Z"
  },
  {
    "title": "Masked Israeli settlers attack Palestinian villages and IDF soldiers in the West Bank",
    "description": "Settlers attacked Palestinians and set fire to property in the occupied West Bank on Tuesday before clashing with soldiers sent to break up their rampage.",
    "link": "https://www.nbcnews.com/world/middle-east/israel-settlers-west-bank-attacks-idf-civilians-soldiers-riot-fire-rcna243175",
    "timestamp": "2025-11-12T17:44:07Z"
  },
  {
    "title": "Nancy Mace Claims Democrats Released Epstein Files Mentioning Trump To 'Bury Headlines On Their Vote Against Reopening The Government'",
    "description": "Republican Rep. Nancy Mace claimed Democrats released Epstein files mentioning President Donald Trump by name to \"bury headlines on their vote against reopening the government.\"",
    "link": "https://www.ibtimes.com/nancy-mace-claims-democrats-released-epstein-files-mentioning-trump-bury-headlines-their-vote-3790175",
    "timestamp": "2025-11-12T17:42:57Z"
  },
  {
    "title": "Whistleblowers Way Ahead Of Trump’s DOJ On Telling Us About Scandal ‘Bigger Than Watergate’",
    "description": "Federal agencies are trailing behind whistleblowers in disclosing documents, presenting an obstacle for lawmakers in exposing the Arctic Frost investigation.",
    "link": "https://dailycaller.com/2025/11/12/whistleblowers-arctic-frost-trump-doj/",
    "timestamp": "2025-11-12T17:42:46Z"
  },
  {
    "title": "Diddy Enters Rehab, Hopes to Knock Time Off Prison Sentence",
    "description": "Reading Time: 3 minutesAs previously reported, Diddy is scheduled to be released from federal prison on May 8, 2028. To those who think …\nDiddy Enters Rehab, Hopes to Knock Time Off Prison Sentence was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/11/diddy-enters-rehab-hopes-to-knock-time-off-prison-sentence/",
    "timestamp": "2025-11-12T17:41:39Z"
  },
  {
    "title": "What's in the deal to end the longest US government shutdown?",
    "description": "Lawmakers are set to end the longest government shutdown. The deal temporarily restores funding for agencies. It also provides full-year funding for some departments like Agriculture and Veterans Affairs. Federal job cuts are blocked until January 30. The bil…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whats-in-the-deal-to-end-the-longest-us-government-shutdown/articleshow/125280643.cms",
    "timestamp": "2025-11-12T17:41:33Z"
  },
  {
    "title": "How will tariffs affect shopping this holiday season?",
    "description": "Prices may not be so holly jolly this year",
    "link": "https://theweek.com/personal-finance/tariffs-holiday-shopping",
    "timestamp": "2025-11-12T17:40:57Z"
  },
  {
    "title": "The 2025 MAGA Fracture and the Benefactors Behind It",
    "description": "On March 3rd through March 6th 2016, the Republican presidential primary was at the precipice of a key inflection point (Super Tuesday) when a large group of political leadership, tech titans, bankers and political influence agents assembled at the AEI summit…",
    "link": "https://freerepublic.com/focus/f-bloggers/4352142/posts",
    "timestamp": "2025-11-12T17:40:20Z"
  },
  {
    "title": "How the ‘heavy metal’ fall of a 1980s dictator shapes Donald Trump’s Venezuela policy now",
    "description": "Toppling Panama’s leader more than 30 years ago looks easier than ousting Nicolás Maduro today",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/11/us/politics/panama-noriega-maduro.html",
    "timestamp": "2025-11-12T17:40:01Z"
  },
  {
    "title": "The real name of the Washington Commanders that Trump wants to bring back and has a controversial origin",
    "description": "This Sunday, the Santiago Bernabeu will become the epicenter of American sports as it hosts the first official NFL game in Spain, with an attractive matchup between the Miami Dolph",
    "link": "https://www.marca.com/en/nfl/washington-commanders/2025/11/12/6914c39de2704e80798b458b.html",
    "timestamp": "2025-11-12T17:39:36Z"
  },
  {
    "title": "UK’s Starmer refuses to say whether he will urge Trump to drop his $1 billion BBC threat",
    "description": "“I believe in a strong and independent BBC,” Starmer said.",
    "link": "https://www.bostonherald.com/2025/11/12/uk-starmer-bbc-threat/",
    "timestamp": "2025-11-12T17:38:54Z"
  },
  {
    "title": "NYC Mayor-Elect Zohran Mamdani to Call Trump: Relationship ‘Will Be Critical to the Success’ of the City",
    "description": "New York City (NYC) Mayor-Elect Zohran Mamdani explained that the relationship he has with President Donald “will be critical to the success” of the city, and added that he plans to call Trump before taking office. During an interview with NBC New York’s Meli…",
    "link": "https://freerepublic.com/focus/f-news/4352141/posts",
    "timestamp": "2025-11-12T17:38:29Z"
  },
  {
    "title": "Tick-Tock: Trump Mentioned In Jeffrey Epstein’s Emails Alleging That He ‘Knew About The Girls’ Including One Of Epstein’s Victims",
    "description": "Jeffrey Epstein's Emails Reveal That Trump knew about girls that he allegedly abused, including one victim who recently committed suicide\nThe post Tick-Tock: Trump Mentioned In Jeffrey Epstein’s Emails Alleging That He ‘Knew About The Girls’ Including One Of …",
    "link": "https://bossip.com/4036845/jeffrey-epsteins-emails-reveal-that-trump-knew-about-girls/",
    "timestamp": "2025-11-12T17:38:11Z"
  },
  {
    "title": "EXCLUSIVE: Western Republican Rep Says Nuclear Energy Can Bridge Partisan Chasm",
    "description": "Republican Idaho Rep. Mike Simpson said the newly emerging bipartisan support on nuclear energy and permitting reform will be keys to advancing American energy.",
    "link": "https://dailycaller.com/2025/11/12/exclusive-western-republican-nuclear-energy-partisan-permitting-reform-independence/",
    "timestamp": "2025-11-12T17:37:59Z"
  },
  {
    "title": "Tariffs Near 107 Percent Threaten to Pull Italian Pasta Brands From American Shelves",
    "description": "The Commerce Department’s new antidumping duties could double the cost of imported Italian pasta—hurting consumers more than producers.",
    "link": "https://reason.com/2025/11/12/tariffs-near-107-percent-threaten-to-pull-italian-pasta-brands-from-american-shelves/",
    "timestamp": "2025-11-12T17:36:32Z"
  },
  {
    "title": "Conservative Judge Resigns Rather Than Stay Silent On Trump’s Constitutional Assault",
    "description": "Reagan-appointed federal judge Mark Wolf has resigned from the bench in Massachusetts, and his explanation is blunt: he can no longer bear the ethical constraints that prevent judges from speaking out publicly while Trump dismantles the rule of law. This does…",
    "link": "https://www.techdirt.com/2025/11/12/conservative-judge-resigns-rather-than-stay-silent-on-trumps-constitutional-assault/",
    "timestamp": "2025-11-12T17:35:29Z"
  },
  {
    "title": "‘The View’s Sunny Hostin Points Out Why Jeffrey Epstein’s Emails Could “Work” In Trump’s “Favor”",
    "description": "\"So, why continue to deny it? That's the problem I'm having here,\" Hostin asked.",
    "link": "https://decider.com/2025/11/12/views-sunny-hostin-jeffrey-epsteins-emails-trumps/",
    "timestamp": "2025-11-12T17:35:06Z"
  },
  {
    "title": "New Epstein emails mentioning Trump don't appear to interest Fox News (Matt Gertz/Media Matters for America)",
    "description": "Matt Gertz / Media Matters for America:\nNew Epstein emails mentioning Trump don't appear to interest Fox News  —  The network offered no substantive coverage of the story all morning  —  RESEARCH CONTRIBUTIONS FROM HARRISON RAY & ROB SAVILLO  —  Fox News is c…",
    "link": "https://www.memeorandum.com/251112/p68",
    "timestamp": "2025-11-12T17:35:04Z"
  },
  {
    "title": "Trump Silent as Top Democrat Reveals More Epstein Docs Are on the Way",
    "description": "House Oversight Democrats say there’s more to come after those Jeffrey Epstein emails.",
    "link": "https://newrepublic.com/post/203088/trump-silent-epstein-emails-democrat-more-docs",
    "timestamp": "2025-11-12T17:33:30Z"
  },
  {
    "title": "Trump defends H-1B visas: \"You don't have certain talents\" in the U.S. - Axios",
    "description": "Trump defends H-1B visas: \"You don't have certain talents\" in the U.S.Axios Trump says United States doesn’t have people with ‘certain talents’ to fill jobs domesticallyCNN Trump Says U.S. Lacks ‘Certain Talents’ As He Defends H-1B Visa In Fox InterviewForbes…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180056084",
    "timestamp": "2025-11-12T17:33:28Z"
  },
  {
    "title": "Exclusive: Trump administration plans meeting over House effort to force release of Epstein files | CNN Politics",
    "description": "Top Trump administration officials were planning to meet Wednesday about an effort in the US House to force a vote on releasing Justice Department case files related to Jeffrey Epstein, according to multiple sources familiar with the meeting.",
    "link": "https://www.cnn.com/2025/11/12/politics/trump-administration-meeting-house-effort-epstein-document-release",
    "timestamp": "2025-11-12T17:30:38Z"
  },
  {
    "title": "Newsom slams Trump’s climate denial at COP30",
    "description": "What happened\nCalifornia Gov. Gavin Newsom (D) Tuesday cast himself as a “stable and reliable” American partner on climate change at the United Nations COP30 conference in Belém, Brazil. President Donald Trump, who has repeatedly called climate change a “hoax…",
    "link": "https://biztoc.com/x/0fd1358ce89ad14b",
    "timestamp": "2025-11-12T17:29:23Z"
  },
  {
    "title": "Would a 50-year mortgage make home ownership attainable?",
    "description": "The American dream feels increasingly out of reach. The average age of first-time home buyers is now 40, and home prices have skyrocketed for years. President Donald Trump is offering a purported solution: The 50-year mortgage.\nTrump’s proposal “could meaning…",
    "link": "https://biztoc.com/x/ccba9b7a2ded2bc0",
    "timestamp": "2025-11-12T17:29:06Z"
  },
  {
    "title": "Atlanta Fed chair steps down as Trump attacks central bank’s independence",
    "description": "Raphael W Bostic will retire in February – creating another vacancy on Federal Reserve’s powerful policy committee\nThe head of the Federal Reserve Bank of Atlanta announced plans to step down amid an extraordinary campaign by Donald Trump to exert influence o…",
    "link": "https://biztoc.com/x/4fd35a00053ac62b",
    "timestamp": "2025-11-12T17:28:52Z"
  },
  {
    "title": "Goodbye, Penny! US mint in Philadelphia to press its final 1-Cent coin ever",
    "description": "Penny: After 230 years, the US Mint is striking its final penny. The decision stems from the coin costing nearly 4 cents to produce, a significant loss for taxpayers. President Trump deemed the continued minting \"wasteful.\" While a nostalgic symbol, the penny…",
    "link": "https://economictimes.indiatimes.com/news/international/us/penny-us-mint-in-philadelphia-to-press-its-final-1-cent-coin-ever-trump-ends-us-penny-production/articleshow/125279228.cms",
    "timestamp": "2025-11-12T17:28:33Z"
  },
  {
    "title": "Wallets, not warming, make voters care about climate: California governor",
    "description": "California Governor Gavin Newsom says his Democratic party is “back on its feet” after a string of election wins — and the way to make Americans care about global warming is to show how it affects their wallets. The 58-year-old leader of the Golden State spok…",
    "link": "https://www.digitaljournal.com/world/wallets-not-warming-make-voters-care-about-climate-california-governor/article",
    "timestamp": "2025-11-12T17:28:21Z"
  },
  {
    "title": "Record-breaking US shutdown to end as political fallout begins",
    "description": "Congress looked set Wednesday to end the longest government shutdown in US history — 43 days that paralyzed Washington and left hundreds of thousands of workers unpaid while Donald Trump’s Republicans and Democrats played a high-stakes blame game. The House o…",
    "link": "https://www.digitaljournal.com/world/record-breaking-us-shutdown-to-end-as-political-fallout-begins/article",
    "timestamp": "2025-11-12T17:28:21Z"
  },
  {
    "title": "White House slams Dems' 'bad-faith' Epstein doc release as demand for files intensifies",
    "description": "The White House fired back after correspondence from Jeffrey Epstein about President Donald Trump was released by House Democrats on Wednesday",
    "link": "https://www.foxnews.com/politics/white-house-slams-dems-bad-faith-epstein-doc-release-demand-files-intensifies",
    "timestamp": "2025-11-12T17:28:15Z"
  },
  {
    "title": "How former jihadist Ahmed al-Sharaa ended up being welcomed to the White House",
    "description": "Ahmed al-Sharaa has become the first Syrian leader in history to be invited to the White House.",
    "link": "https://theconversation.com/how-former-jihadist-ahmed-al-sharaa-ended-up-being-welcomed-to-the-white-house-269631",
    "timestamp": "2025-11-12T17:28:14Z"
  },
  {
    "title": "Trump’s tariffs threaten the future of innovation – and UK tech could be collateral damage",
    "description": "Innovation thrives on collaboration and trust acros borders – tariffs undermine this.",
    "link": "https://theconversation.com/trumps-tariffs-threaten-the-future-of-innovation-and-uk-tech-could-be-collateral-damage-269158",
    "timestamp": "2025-11-12T17:28:10Z"
  },
  {
    "title": "Inside the Sandwich Guy’s Jury",
    "description": "Can a flung sandwich cause bodily harm?",
    "link": "https://www.theatlantic.com/politics/2025/11/dc-sandwich-guy-jury-trump/684898/",
    "timestamp": "2025-11-12T17:25:00Z"
  },
  {
    "title": "Boston Democrat Mayor to Be Paid Quarter of a Million Dollars Next Year",
    "description": "Boston Mayor Michelle Wu's reelection will come with a $43,000 raise, which means she will receive $250,000 in 2026.\nThe post Boston Democrat Mayor to Be Paid Quarter of a Million Dollars Next Year appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/12/boston-democrat-mayor-be-paid-quarter-of-million-dollars-next-year/",
    "timestamp": "2025-11-12T17:23:55Z"
  },
  {
    "title": "Winkelvoss-Backed Cypherpunk Enters Digital Asset Treasury Space",
    "description": "Biotech company Leap Therapeutics is entering the digital asset treasury space and rebranding as Cypherpunk Technologies. The company plans to accumulate Zcash’s native, privacy-focused cryptocurrency coin, ZEC, according to a Wednesday (Nov. 12) press releas…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/winkelvoss-backed-cypherpunk-enters-digital-asset-treasury-space/",
    "timestamp": "2025-11-12T17:21:33Z"
  },
  {
    "title": "Newsom slams Trump’s climate denial at COP30",
    "description": "Trump, who has called climate change a ‘hoax,’ declined to send any officials to this week’s summit",
    "link": "https://theweek.com/politics/newsom-california-climate-change-cop30-trump",
    "timestamp": "2025-11-12T17:21:23Z"
  },
  {
    "title": "What Americans think about Trump's management of the government, according to a new AP-NORC poll (Associated Press)",
    "description": "Associated Press:\nWhat Americans think about Trump's management of the government, according to a new AP-NORC poll  —  Add AP News on Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  Approval of the way President Do…",
    "link": "https://www.memeorandum.com/251112/p67",
    "timestamp": "2025-11-12T17:20:03Z"
  },
  {
    "title": "Diverse and resilient energy production is needed to meet future demand, global report says",
    "description": "The report underscores the need for diversified energy sources and supply chains.",
    "link": "https://www.bostonherald.com/2025/11/12/climate-world-energy-outlook/",
    "timestamp": "2025-11-12T17:17:08Z"
  },
  {
    "title": "4-Year-Old Tweet Comes Back to Haunt JD Vance After New Trump-Epstein Revelation",
    "description": "A social media post by Vice President J.D. Vance over four years ago has resurfaced hours after a bombshell email drop revealed that President Donald Trump once spent \"hours\" with a Jeffrey Epstein victim at the notorious sex trafficker's home.\nThe post 4-Yea…",
    "link": "https://www.mediaite.com/media/news/4-year-old-tweet-comes-back-to-haunt-jd-vance-after-new-trump-epstein-revelation/",
    "timestamp": "2025-11-12T17:14:57Z"
  },
  {
    "title": "'Dark times ahead': Analyst makes prediction about Trump's 'escalating attacks'",
    "description": "An analyst warns that President Donald Trump will \"escalate attacks\" on democracy to maximize damage after Republican election day losses, signaling there are \"dark times ahead.\"In commentary published Wednesday from Salon's Chauncey Devega, the writer examin…",
    "link": "https://www.rawstory.com/dark-times-ahead-analyst-warns-trump-will-escalate-to-maximize-damage/",
    "timestamp": "2025-11-12T17:14:13Z"
  },
  {
    "title": "Venezuela mobilizes as top US warship nears",
    "description": "The largest and most advanced US aircraft carrier, the USS Gerald R. Ford, has entered the Caribbean and put Venezuela on high alert",
    "link": "https://theweek.com/world-news/venezuela-military-us-boat-strikes",
    "timestamp": "2025-11-12T17:13:31Z"
  },
  {
    "title": "“Of course he knew about the girls”: New emails reveal Trump “spent hours” at Epstein’s house",
    "description": "Epstein said Trump was \"that dog that hasn't barked.\"",
    "link": "https://www.salon.com/2025/11/12/of-course-he-knew-about-the-girls-new-emails-reveal-trump-spent-hours-at-epsteins-house/",
    "timestamp": "2025-11-12T17:12:06Z"
  },
  {
    "title": "Lawrence O'Donnell Slams Trump As 'The Most Inconsistent' U.S. Politician Over 1 Major Issue",
    "description": "The \"Last Word\" host excoriated the president over his contradictory comments on social media over the weekend.",
    "link": "https://www.huffpost.com/entry/lawrence-odonnell-slams-trump-inconsistent-tariffs-policy-rebate_n_6914951ae4b09f6fd8c45c7e",
    "timestamp": "2025-11-12T17:10:31Z"
  },
  {
    "title": "Affordability worries and GOP infighting hover over the early race to succeed Trump (NBC News)",
    "description": "NBC News:\nAffordability worries and GOP infighting hover over the early race to succeed Trump  —  As 2028 talk heats up, Vice President JD Vance, Rep. Marjorie Taylor Greene and others are navigating the aftermath of Republican losses in last week's elections…",
    "link": "https://www.memeorandum.com/251112/p64",
    "timestamp": "2025-11-12T17:10:01Z"
  },
  {
    "title": "What to know about the status of SNAP food aid as a vote nears to end the shutdown",
    "description": "How fast SNAP payments reach beneficiaries could vary by state. The U.S. Supreme Court ruled Tuesday to keep on hold lower-court rulings that the government should immediately fully fund the program.",
    "link": "https://www.pbs.org/newshour/nation/what-to-know-about-the-status-of-snap-food-aid-as-a-vote-nears-to-end-the-shutdown",
    "timestamp": "2025-11-12T17:07:27Z"
  },
  {
    "title": "S.Africa’s Ramaphosa says US skipping G20 ‘their loss’",
    "description": "President Cyril Ramaphosa said Wednesday the United States boycott of the G20 summit in South Africa later this month would not prevent the meeting of the world’s leading economies from going ahead. Pretoria and Washington have clashed over a range of policy …",
    "link": "https://www.digitaljournal.com/world/s-africas-ramaphosa-says-us-skipping-g20-their-loss-2/article",
    "timestamp": "2025-11-12T17:07:20Z"
  },
  {
    "title": "G7 foreign ministers seek to boost Ukraine war effort",
    "description": "G7 foreign ministers held talks Wednesday focused on bolstering Ukraine’s war effort, as meeting host Canada unveiled new sanctions targeting Russian drone and energy production. Ukraine’s top diplomat Andriy Sybiha — who was invited to the Group of Seven tal…",
    "link": "https://www.digitaljournal.com/world/g7-foreign-ministers-seek-to-boost-ukraine-war-effort/article",
    "timestamp": "2025-11-12T17:07:20Z"
  },
  {
    "title": "2025 The Annika LPGA: TV schedule, streaming info, how to watch, tee times",
    "description": "How to watch the 2025 Annika LPGA event this week, including a full Annika TV schedule and streaming details.",
    "link": "https://golf.com/news/2025-annika-lpga-tv-schedule-watch-tee-times/",
    "timestamp": "2025-11-12T17:05:30Z"
  },
  {
    "title": "Karoline Lashes Out at Democrats for Trying to ‘Embarrass’ Trump With Epstein Emails: ‘Fake Narrative!’",
    "description": "Karoline Leavitt lashed out at Democrats, accusing them of trying to \"embarrass\" President Trump with bombshell Jeffrey Epstein emails.\nThe post Karoline Lashes Out at Democrats for Trying to ‘Embarrass’ Trump With Epstein Emails: ‘Fake Narrative!’ first appe…",
    "link": "https://www.mediaite.com/media/news/karoline-lashes-out-at-democrats-for-trying-to-embarrass-trump-with-epstein-emails-fake-narrative/",
    "timestamp": "2025-11-12T17:05:29Z"
  },
  {
    "title": "AP-NORC poll finds approval of how Trump manages the government is eroding among Republicans",
    "description": "The poll finds Americans, particularly Republicans, are less likely to approve of the Republican president's management of the government than they were in March.",
    "link": "https://www.pbs.org/newshour/politics/ap-norc-poll-finds-trumps-approval-on-government-management-eroding-among-republicans",
    "timestamp": "2025-11-12T17:05:02Z"
  },
  {
    "title": "Would a 50-year mortgage make home ownership attainable?",
    "description": "Trump critics say the proposal is bad policy",
    "link": "https://theweek.com/business/economy/50-year-mortgage-home-ownership-housing-crisis",
    "timestamp": "2025-11-12T17:04:15Z"
  },
  {
    "title": "Judge Boasberg Enabled Feds To Spy On Conservatives — Now He Must Pay The Price",
    "description": "Judge James Boasberg must be impeached for failing to properly scrutinize the government's efforts to spy on elected officials and conservative groups.",
    "link": "https://dailycaller.com/2025/11/12/judge-james-boasberg-arctic-frost-impeach-spying-senators/",
    "timestamp": "2025-11-12T17:02:56Z"
  },
  {
    "title": "WATCH — Trump Asks Syrian President Ahmed al-Sharaa How Many Wives He Has: 'With You Guys, I Never Know'",
    "description": "President Donald Trump asked Syrian President Ahmed al-Sharaa how many wives he had when he gifted him fragrances on Monday, joking, \"With you guys, I never know.\" \nThe post WATCH — Trump Asks Syrian President Ahmed al-Sharaa How Many Wives He Has: ‘With You …",
    "link": "https://www.breitbart.com/politics/2025/11/12/watch-trump-asks-syrian-president-ahmed-al-sharaa-how-many-wives-he-has-with-you-guys-i-never-know/",
    "timestamp": "2025-11-12T17:02:09Z"
  },
  {
    "title": "Venezuela Mobilizes Military as US Aircraft Carrier Approaches",
    "description": "White House officials have sought to walk back President Donald Trump's repeated threats against Venezuela in recent days—even as the Department of Defense has continue to strike boats in the Caribbean and eastern Pacific—but officials in the South American c…",
    "link": "https://www.commondreams.org/news/venezuelas-military",
    "timestamp": "2025-11-12T17:01:48Z"
  },
  {
    "title": "Jasmine Crockett Hammers Trump on CNN Over Bombshell Epstein Emails",
    "description": "Rep. Jasmine Crockett (D-TX) hammered Trump over new bombshell emails from Jeffrey Epstein, telling CNN they show Epstein thought he had \"leverage\" over Trump.\nThe post Jasmine Crockett Hammers Trump on CNN Over Bombshell Epstein Emails first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/jasmine-crockett-hammers-trump-on-cnn-over-bombshell-epstein-emails/",
    "timestamp": "2025-11-12T17:01:18Z"
  },
  {
    "title": "Ivy League Professors Fight For Non-Citizen ‘Right’ To Openly Support Terror Without Consequence",
    "description": "The AAUP is asking to extend an order prohibiting the federal government from threatening foreign students' visa status if they openly support terrorism.",
    "link": "https://dailycaller.com/2025/11/12/ivy-league-professors-fight-for-non-citizen-right-to-openly-support-terror-without-consequence/",
    "timestamp": "2025-11-12T17:00:31Z"
  },
  {
    "title": "Lana Del Rey cameo in Department of Homeland Security video...",
    "description": "US president Donald Trump and his administration have shared some weird social media videos since the Republican’s inauguration in January - from defense secretary Pete Hegseth uploading an “embarrassing” video featuring drones and Metallica’s 'Enter Sandman'…",
    "link": "https://www.indy100.com/celebrities/lana-del-rey-trump-department-of-homeland-security-video",
    "timestamp": "2025-11-12T17:00:16Z"
  },
  {
    "title": "SHOCK POLL: ONLY 33% APPROVE OF TRUMP'S MANAGEMENT OF GOVT...",
    "description": "A new AP-NORC poll finds U.S. adults’ opinions of how President Donald Trump is managing the federal government have dropped sharply since early in his second term, highlighting the risks posed by the government shutdown and his efforts to reshape the federal…",
    "link": "https://apnews.com/article/trump-poll-approval-government-shutdown-apnorc-9daa3f130fedc9cf9b5acf3de31e93f4",
    "timestamp": "2025-11-12T17:00:16Z"
  },
  {
    "title": "World oil and gas demand could grow until 2050, IEA says",
    "description": "Global oil and gas demand could grow until 2050, the International Energy Agency said on Wednesday, departing from previous expectations of a speedy transition to cleaner fuels following U.S. criticism about its climate focus.",
    "link": "https://www.cbc.ca/news/climate/iea-energy-outlook-2025-9.6976107",
    "timestamp": "2025-11-12T16:59:51Z"
  },
  {
    "title": "Why Did Asian Countries Give Trump So Much on Trade?",
    "description": "The new deals contain unusual concessions that could change the flow of goods in Asia.",
    "link": "http://foreignpolicy.com/2025/11/12/trump-trade-tariff-agreement-deal-asia-japan-south-korea-asean/",
    "timestamp": "2025-11-12T16:59:49Z"
  },
  {
    "title": "Exclusive: House Judiciary Committee Probes DOJ IG Office’s Involvement In Arctic Frost Lawfare",
    "description": "The House Judiciary Committee is probing the DOJ Office of Inspector General's role in the agency's Biden-era lawfare against Donald Trump.",
    "link": "https://thefederalist.com/2025/11/12/exclusive-house-judiciary-committee-probes-doj-ig-offices-involvement-in-arctic-frost-lawfare/",
    "timestamp": "2025-11-12T16:58:47Z"
  },
  {
    "title": "Trump Sent Men to Torture in El Salvador, Report Confirms",
    "description": "Beatings. Sexual assault. Psychological abuse. These are some of the horrors endured by the more than 250 men the United States sent to El Salvador on flimsy evidence of gang membership, according to a new comprehensive report released on Wednesday by Human R…",
    "link": "https://www.motherjones.com/politics/2025/11/trump-cecot-torture-hrw-elsalvador-prison-venezuelan/",
    "timestamp": "2025-11-12T16:58:36Z"
  },
  {
    "title": "Trump Claims 'Obligation' to Sue BBC Over Speech Edit",
    "description": "President Donald Trump said he had an \"obligation\" to sue the BBC over a misleading speech edit, stopping short of announcing legal action in a Fox News interview aired on Tuesday. Trump's lawyers threatened the British broadcaster with a billion-dollar lawsu…",
    "link": "https://freerepublic.com/focus/f-bloggers/4352132/posts",
    "timestamp": "2025-11-12T16:57:15Z"
  },
  {
    "title": "Regulation Renovation: The Executive Order To Make Deregulation Permanent",
    "description": "A new OMB memo lays a foundation for Trump to lock in deregulation with an executive order that rewrites Washington’s rulebook for good.",
    "link": "https://www.forbes.com/sites/waynecrews/2025/11/12/regulation-renovation-the-executive-order-to-make-deregulation-permanent/",
    "timestamp": "2025-11-12T16:57:08Z"
  },
  {
    "title": "‘You Deserve the Full Truth’: House GOP Suddenly Drops 20,000 Pages of Epstein Docs on Heels of Trump Bombshell",
    "description": "Republicans on the House Oversight Committee released 20,000 additional Epstein documents hours after Democratic colleagues published emails mentioning Trump.\nThe post ‘You Deserve the Full Truth’: House GOP Suddenly Drops 20,000 Pages of Epstein Docs on Heel…",
    "link": "https://www.mediaite.com/media/news/you-deserve-the-full-truth-house-gop-suddenly-drops-20000-pages-of-epstein-docs-on-heels-of-trump-bombshell/",
    "timestamp": "2025-11-12T16:56:35Z"
  },
  {
    "title": "Trump, who slapped an extra $100,000 on the H-1B visa, now says there aren’t enough talented people in the U.S. to fill jobs",
    "description": "President Donald Trump has appeared to change his tune on the stringency on one of his immigration policies, speaking about the importance of H-1B visas for specialized labor only a couple months after imposing steep hurdles meant to reduce the number of thos…",
    "link": "https://biztoc.com/x/1d4a77431acc1c34",
    "timestamp": "2025-11-12T16:55:33Z"
  },
  {
    "title": "Ushakov: Putin didn't receive messages from Trump",
    "description": "Russian presidential aide Yuri Ushakov (pictured far right) told Rossiya-1 TV on Wednesday that United States President Donald Trump did not send any messages to his Russian colleague Vladimir Putin v...",
    "link": "https://biztoc.com/x/049c50c480485f69",
    "timestamp": "2025-11-12T16:55:15Z"
  },
  {
    "title": "“Unreal”: MAGA fury after Trump “broke everyone’s heart” with visa comments on Fox News",
    "description": "The president argued Americans \"don’t have certain talents\" while defending the H-1B worker visa program.",
    "link": "https://www.salon.com/2025/11/12/unreal-maga-fury-after-trump-broke-everyones-heart-with-visa-comments-on-fox-news/",
    "timestamp": "2025-11-12T16:55:11Z"
  },
  {
    "title": "Bad Bunny headlining Super Bowl halftime: pop culture has always been the frontline of political rage",
    "description": "Yet beneath the anger, both sides recognize something larger at play – the sense that outrage itself is being engineered",
    "link": "https://www.the-independent.com/arts-entertainment-0/bad-bunny-super-bowl-halftime-politics-pop-culture-b2863950.html",
    "timestamp": "2025-11-12T16:53:51Z"
  },
  {
    "title": "‘Call It Trumpcare… Anything But Obamacare!’ Trump Reveals Health Plan in Fox News Hit - NewsBreak",
    "description": "President Donald Trump revealed his long-promised health care plan in a Fox News interview, and said “Call it Trumpcare. Call it whatever you want! Anythin",
    "link": "https://www.newsbreak.com/share/4342589870107-call-it-trumpcare-anything-but-obamacare-trump-reveals-health-plan-in-fox-news-hit?_f=app_share&amp;pd=06cl0lQH&amp;lang=en_US&amp;send_time=1762966212&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.45.0.27%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-11-12T16:51:38Z"
  },
  {
    "title": "UN watchdog calls on Iran to urgently allow 'long overdue' uranium stockpile verification",
    "description": "The U.N. nuclear watchdog on Wednesday called on Iran to allow it to verify its enriched uranium inventories, especially its sensitive stockpile of highly enriched uranium that was \"long overdue\", according to a confidential report seen by AFP.",
    "link": "https://www.hurriyetdailynews.com/un-watchdog-calls-on-iran-to-urgently-allow-long-overdue-uranium-stockpile-verification-215662",
    "timestamp": "2025-11-12T16:51:17Z"
  },
  {
    "title": "Enemies of the State",
    "description": "Enemies of the StateRevelations about Arctic Frost show a national security apparatus that’s out of control.The FBI’s Arctic Frost investigation is confirmation that the Left sees conservatives as enemies of the state. If you are a conservative when the Left …",
    "link": "https://freerepublic.com/focus/f-news/4352129/posts",
    "timestamp": "2025-11-12T16:51:11Z"
  },
  {
    "title": "Colombia Suspends Intel Cooperation With U.S. Over Drug Strike Tactics",
    "description": "Although Colombia and the U.S. were once close partners in the fight against drug trafficking, relations have recently deteriorated.",
    "link": "https://www.huffpost.com/entry/colombia-us-intel-sharing_n_6914acd9e4b0c2898bed41f6",
    "timestamp": "2025-11-12T16:50:49Z"
  },
  {
    "title": "Britain and Colombia Cut Off U.S. Intelligence Access Over Caribbean Boat Bombings",
    "description": "The two U.S. allies were happy to cooperate against drug trafficking, but think killing the suspected smugglers at sea is a step too far.",
    "link": "https://reason.com/2025/11/12/britain-and-colombia-cut-off-u-s-intelligence-access-over-caribbean-boat-bombings/",
    "timestamp": "2025-11-12T16:50:43Z"
  },
  {
    "title": "Epstein emails released by Democrats say Trump 'knew about the girls' and spent time with a victim (Associated Press)",
    "description": "Associated Press:\nEpstein emails released by Democrats say Trump ‘knew about the girls’ and spent time with a victim  —  Add AP News on Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  Disgraced financier Jeffrey Ep…",
    "link": "https://www.memeorandum.com/251112/p61",
    "timestamp": "2025-11-12T16:50:02Z"
  },
  {
    "title": "Priya Shah – The matchmaker receives over 35 national & international awards",
    "description": "Priya Shah – The Matchmaker, India’s one of top matchmaking expert, has once again made India proud by receiving yet another prestigious international.",
    "link": "https://timesofindia.indiatimes.com/entertainment/priya-shah-the-matchmaker-receives-over-35-national-international-awards/articleshow/125279422.cms",
    "timestamp": "2025-11-12T16:48:04Z"
  },
  {
    "title": "Trump, who slapped an extra $100,000 on the H-1B visa, now says there aren’t enough talented people in the U.S. to fill jobs",
    "description": "The president argued U.S. companies need specialized labor from foreign workers and can’t “take people off an unemployment line who haven't worked in five years.”",
    "link": "https://fortune.com/2025/11/12/trump-100000-h1b-fee-says-need-foreign-workers-fox-news-interview/",
    "timestamp": "2025-11-12T16:47:39Z"
  },
  {
    "title": "Trump, who slapped an extra $100,000 on the H-1B visa, now says there aren’t enough talented people in the U.S. to fill jobs",
    "description": "The president argued U.S. companies need specialized labor from foreign workers and can’t “take people off an unemployment line who haven't worked in five...",
    "link": "https://www.yahoo.com/news/articles/trump-slapped-extra-100-000-164739055.html",
    "timestamp": "2025-11-12T16:47:39Z"
  },
  {
    "title": "Why Trump’s $2,000 checks might worsen inflation",
    "description": "President Donald Trump is once again proposing a headline-grabbing financial solution for American families: $2,000 dividend checks funded by tariff revenue. The idea targets lower- and middle-income households struggling with the cost of living, offering dir…",
    "link": "https://rollingout.com/2025/11/12/why-trumps-2000-checks-worsen-inflation/",
    "timestamp": "2025-11-12T16:47:36Z"
  },
  {
    "title": "GOP Congressman Tells CNN That Epstein-Trump Email Bombshell Must Be ‘Taken Seriously’",
    "description": "Rep. Marlin Stutzman (R-IN) told CNN's Wolf Blitzer that the bombshell emails Jeffrey Epstein sent about President Donald Trump must be \"taken seriously.\"\nThe post GOP Congressman Tells CNN That Epstein-Trump Email Bombshell Must Be ‘Taken Seriously’ first ap…",
    "link": "https://www.mediaite.com/media/tv/gop-congressman-tells-cnn-that-epstein-trump-email-bombshell-must-be-taken-seriously/",
    "timestamp": "2025-11-12T16:47:30Z"
  },
  {
    "title": "A ‘historic’ visit wrapped in old distrust: The harsh truth about Syria’s White House moment",
    "description": "Al-Sharaa’s visit to Washington was hailed as historic – yet behind the smiles lie sanctions, red lines, and a fragile balance of power Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627675-historic-visit-old-distrust/",
    "timestamp": "2025-11-12T16:47:05Z"
  },
  {
    "title": "Where SNAP benefits stand amid negotiations to end the government shutdown",
    "description": "The continuity of Supplemental Nutrition Assistance Program, or SNAP, benefits has been affected by a federal government shutdown for the first time.",
    "link": "https://www.cnbc.com/2025/11/12/snap-benefits-government-shutdown-negotiations.html",
    "timestamp": "2025-11-12T16:46:58Z"
  },
  {
    "title": "Ford CEO says he has 5,000 open mechanic jobs with 6-figure salaries from the shortage of manually skilled workers: ‘We are in trouble in our country’",
    "description": "“We do not have trade schools. We are not investing in educating a next generation of people,” Jim Farley said.",
    "link": "https://fortune.com/2025/11/12/ford-ceo-manufacturing-jobs-trade-schools-we-are-in-trouble-in-our-country/",
    "timestamp": "2025-11-12T16:46:53Z"
  },
  {
    "title": "Alert! Powerful solar flare shakes Earth’s satellites and power grids",
    "description": "A powerful solar eruption from sunspot AR4274 triggered a massive X5.1-class solar flare, causing a Ground Level Event (GLE) with energetic protons reaching Earth's atmosphere and ground. This intense space weather produced stunning auroras visible in lower U…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/alert-powerful-solar-flare-shakes-earths-satellites-and-power-grids/articleshow/125279313.cms",
    "timestamp": "2025-11-12T16:46:19Z"
  },
  {
    "title": "Heritage panel won’t review call on Savarkar Sadan, HC told",
    "description": "Mumbai: The BMC has told the Bombay High Court that the Mumbai Heritage Conservation Committee has decided not to review its earlier decision recommen.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/heritage-panel-wont-review-call-on-savarkar-sadan-hc-told/articleshow/125279407.cms",
    "timestamp": "2025-11-12T16:46:13Z"
  },
  {
    "title": "The 5 at 5: Wednesday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-wednesday-199-6872473-Nov2025/",
    "timestamp": "2025-11-12T16:45:37Z"
  },
  {
    "title": "Trump Asks Syrian President How Many Wives He Has in Bizarre Exchange",
    "description": "The quip came after Donald Trump sprayed the Syrian leader all over with his cheap fragrance.",
    "link": "https://newrepublic.com/post/203078/trump-asks-syrian-president-how-many-wives",
    "timestamp": "2025-11-12T16:45:33Z"
  }
]