[
  {
    "title": "First Plan For 2030 Census Revealed",
    "description": "The census is a constitutional mandate that has taken place every decade since 1790, and it has profound implications on the nation's political representation.",
    "link": "https://www.newsweek.com/first-plan-2030-census-revealed-2103357",
    "timestamp": "2025-07-24T12:24:37Z"
  },
  {
    "title": "Gavin Newsom Makes Trump Epstein Admission: 'Private Voice'",
    "description": "The California governor was speaking on the \"Diary of a CEO\" podcast.",
    "link": "https://www.newsweek.com/gavin-newsom-trump-epstein-diary-ceo-podcast-2103449",
    "timestamp": "2025-07-24T12:24:02Z"
  },
  {
    "title": "‘What Was That?!’ Joe Scarborough Slams Desk as He Rips Tulsi Gabbard’s ‘Wild’ Obama Claim",
    "description": "Scarborough slammed the desk and rang the bell on his desk to congratulate Tulsi Gabbard on meeting \"lowest expectations\" as he leveled her “wild” Obama claim.\nThe post ‘What Was That?!’ Joe Scarborough Slams Desk as He Rips Tulsi Gabbard’s ‘Wild’ Obama Claim…",
    "link": "https://www.mediaite.com/media/tv/what-was-that-joe-scarborough-slams-desk-as-he-rips-tulsi-gabbards-wild-obama-claim/",
    "timestamp": "2025-07-24T12:22:55Z"
  },
  {
    "title": "ECB holds rates steady as Trump tariffs cloud outlook",
    "description": "Analysts, however, expect at least one more 0.25 percentage point cut before the end of 2025",
    "link": "https://www.euractiv.com/section/economy-jobs/news/ecb-holds-rates-steady-as-trump-tariffs-cloud-outlook/",
    "timestamp": "2025-07-24T12:20:45Z"
  },
  {
    "title": "Man deported by Donald Trump to 'worst prison on Earth' in El Salvador speaks out about experience inside",
    "description": "Venezuelan Arturo Suarez was deported by Donald Trump to El Salvador",
    "link": "https://www.ladbible.com/news/crime/el-salvador-prisoner-donald-trump-arturo-suarez-991027-20250724",
    "timestamp": "2025-07-24T12:20:18Z"
  },
  {
    "title": "Tucker Carlson's Milton Interview Sparks Outrage: Bill Ackman Backs Hindenburg Founder Against Former Nikola CEO, Calls Him 'Convicted Corporate Stock Market Fraudster'",
    "description": "Tucker Carlson's latest podcast featuring Trevor Milton, the former Nikola Corp. (OTC:NKLAQ) CEO pardoned by President Donald Trump in March 2025, has ignited a firestorm of criticism.\nWhat Happened: Billionaire investor Bill Ackman led the charge, slamming C…",
    "link": "https://biztoc.com/x/db7451d832a8721b",
    "timestamp": "2025-07-24T12:20:07Z"
  },
  {
    "title": "ECB holds rates, waits for more clarity on U.S. tariffs",
    "description": "FRANKFURT — The European Central Bank held its key deposit rate stable, as it waits for more clarity on the impact that U.S. tariffs will have on the eurozone economy. The pause follows seven consecutive interest rate cuts over the past year, which have broug…",
    "link": "https://www.politico.eu/article/ecb-holds-rates-waits-for-more-clarity-on-u-s-tariffs/",
    "timestamp": "2025-07-24T12:18:33Z"
  },
  {
    "title": "'Trump's life will get a lot more complicated': GOP election guru warns as MAGA splinters",
    "description": "Donald Trump is learning the hard way how fostering conspiracies can come back to bite you — and now his political future is uncertain.That is the opinion of conservative polling guru Karl Rove, who wrote in the Wall Street Journal on Wednesday that the Jeffr…",
    "link": "https://www.rawstory.com/trump-maga-2673747318/",
    "timestamp": "2025-07-24T12:17:39Z"
  },
  {
    "title": "Trump’s 401(k) Overhaul: What Retirement Savers Need To Know Now",
    "description": "President Donald Trump is reportedly planning to open the door for retirement plans like 401(k) plans to include private equity and other alternative assets....",
    "link": "https://finance.yahoo.com/news/trump-401-k-overhaul-retirement-121640519.html",
    "timestamp": "2025-07-24T12:16:40Z"
  },
  {
    "title": "What would a 15 per cent tariff deal mean for Ireland?",
    "description": "Biggest plus is that it avoids an all-out fight between the EU and US",
    "link": "https://www.irishtimes.com/business/2025/07/24/what-would-a-15-per-cent-tariff-deal-mean-for-ireland/",
    "timestamp": "2025-07-24T12:16:19Z"
  },
  {
    "title": "ECB holds rates as Trump tariff talks go to the wire",
    "description": "US president Donald Trump has threatened to triple a basic tariff on imports from the EU to 30 per cent if Brussels does not cut a deal by August 1st",
    "link": "https://www.irishtimes.com/business/2025/07/24/ecb-holds-rates-as-trump-tariff-talks-go-to-the-wire/",
    "timestamp": "2025-07-24T12:15:30Z"
  },
  {
    "title": "Trump tariffs would hit Hungary hard despite warm relations with MAGA-friendly Orbán",
    "description": "Hungary's Prime Minister Viktor Orbán has built a close relationship with Donald Trump, aligning with the MAGA movement",
    "link": "https://abcnews.go.com/Business/wireStory/trump-tariffs-hit-hungary-hard-despite-warm-relations-124028897",
    "timestamp": "2025-07-24T12:15:07Z"
  },
  {
    "title": "Trump tariffs would hit Hungary hard despite warm relations with MAGA-friendly Orban",
    "description": "BUDAPEST, Hungary (AP) — Hungary’s populist prime minister has spent years building a close political relationship with U.S. President Donald Trump and aligning himself with the MAGA movement. But despite Viktor Orban’s success in gaining favor with the cultu…",
    "link": "https://financialpost.com/pmn/trump-tariffs-would-hit-hungary-hard-despite-warm-relations-with-maga-friendly-orban",
    "timestamp": "2025-07-24T12:13:55Z"
  },
  {
    "title": "Detroit Three lobbying group criticizes deal favouring Japanese imports",
    "description": "Japan trade deal sparks hope for U.S. investors, and frustration for automakers who face higher tariffs on Mexico and Canada imports.",
    "link": "https://www.cbc.ca/news/canada/windsor/detroit-3-lobby-japan-imports-1.7592785",
    "timestamp": "2025-07-24T12:12:29Z"
  },
  {
    "title": "Trump will visit Federal Reserve in escalation of campaign to pressure Powell to cut interest rates",
    "description": "WASHINGTON (AP) — President Donald Trump plans to step foot in the Federal Reserve on Thursday as his allies scrutinize its expensive building renovations, a highly personal and confrontational escalation of his campaign to pressure the central bank to slash …",
    "link": "https://financialpost.com/pmn/trump-will-visit-federal-reserve-in-escalation-of-campaign-to-pressure-powell-to-cut-interest-rates",
    "timestamp": "2025-07-24T12:11:05Z"
  },
  {
    "title": "Algoma Steel seeking federal support amid ongoing concern over U.S. tariffs",
    "description": "SAULT STE. MARIE — Algoma Steel says it is seeking $500 million in federal support as the company faces continued uncertainty from U.S. tariffs on Canadian steel. The Sault Ste. Marie, Ont.-based steel producer says it applied for the funding under the Large …",
    "link": "https://financialpost.com/pmn/algoma-steel-seeking-federal-support-amid-ongoing-concern-over-u-s-tariffs",
    "timestamp": "2025-07-24T12:10:51Z"
  },
  {
    "title": "DOJ forms Russiagate 'strike force' to investigate declassified Obama-era evidence",
    "description": "The Justice Department has formed a “Strike Force\" to assess and further investigate the evidence publicized by Director of National Intelligence Tulsi Gabbard relating to former President Obama and his top national security and intelligence officials’ involv…",
    "link": "https://www.foxnews.com/politics/doj-forms-russiagate-strike-force-declassified-obama-era-russiagate-evidence",
    "timestamp": "2025-07-24T12:09:20Z"
  },
  {
    "title": "Capitol agenda: Thune dishes on his 2026 midterms strategy",
    "description": "John Thune’s approach to the midterms is a shaping up to be a mix of Donald Trump and Mitch McConnell. \nIn an interview previewing his 2026 strategy, the South Dakota Republican told POLITICO that he’s already “coordinating closely” with Trump, including givi…",
    "link": "https://biztoc.com/x/1424e10b0ae2956b",
    "timestamp": "2025-07-24T12:08:55Z"
  },
  {
    "title": "Union Pacific, now the subject of merger talks, reports second quarter profit of $1.8 billion",
    "description": "Union Pacific reported Thursday that its adjusted profit grew to $1.8 billion in the second quarter as merger rumors to swirl around the nation’s largest...",
    "link": "https://finance.yahoo.com/news/union-pacific-now-subject-merger-120842266.html",
    "timestamp": "2025-07-24T12:08:42Z"
  },
  {
    "title": "EU starts surveillance of scrap metal trade as supplies decline",
    "description": "BRUSSELS (Reuters) -The European Commission has started monitoring imports and exports of scrap metal including steel, aluminium and copper after stark...",
    "link": "https://finance.yahoo.com/news/eu-starts-surveillance-scrap-metal-120829456.html",
    "timestamp": "2025-07-24T12:08:29Z"
  },
  {
    "title": "'You can hate me!' Republican loses it in 15-minute rant during routine meeting",
    "description": "A traditionally humdrum meeting detailing motor vehicle issues took a turn Wednesday when Indiana Secretary of State Diego Morales spent nearly 15 minutes blasting critical press coverage, repeating the phrase “fake news” a dozen times during what’s typically…",
    "link": "https://www.rawstory.com/case/",
    "timestamp": "2025-07-24T12:05:44Z"
  },
  {
    "title": "Russia and Ukraine trade drone attacks after latest ceasefire talks",
    "description": "Deaths have been reported on either side of the border, just hours after a third round of ceasefire talks took place in Turkey.",
    "link": "https://www.bbc.com/news/articles/crene7d5w2jo",
    "timestamp": "2025-07-24T12:04:35Z"
  },
  {
    "title": "Stephen Colbert Brutally Mocks How Much Trump Is Making Off ‘Morally Bankrupt’ Paramount",
    "description": "Colbert continued to torch his “morally bankrupt” network CBS and its parent company Paramount for new reports of $20 million deal with Trump.\nThe post Stephen Colbert Brutally Mocks How Much Trump Is Making Off ‘Morally Bankrupt’ Paramount first appeared on …",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-brutally-mocks-how-much-trump-is-making-off-morally-bankrupt-paramount/",
    "timestamp": "2025-07-24T12:03:43Z"
  },
  {
    "title": "Trump briefly considered breaking up Nvidia to spur competition, then backed off",
    "description": "President Donald Trump said he briefly considered splitting up Nvidia, the world's largest chipmaker and most valuable company. Trump initially thought doing so might intensify competition in the artificial intelligence and chipmaking industries, but later le…",
    "link": "https://www.techspot.com/news/108790-trump-briefly-considered-breaking-up-nvidia-spur-competition.html",
    "timestamp": "2025-07-24T12:03:00Z"
  },
  {
    "title": "Candace Owens ‘pours gasoline’ on Brigitte Macron lawsuit by doubling down on trans claims",
    "description": "Political commentator Candace Owens has “poured gasoline” on the Brigitte Macron lawsuit by doubling down on false claims that the French first lady is trans. On 23 July, the French president and his wife Brigitte Macron filed a defamation lawsuit against the…",
    "link": "https://www.thepinknews.com/2025/07/24/candace-owens-brigitte-macron-lawsuit-trans/",
    "timestamp": "2025-07-24T12:02:21Z"
  },
  {
    "title": "Forbes Daily: Rising Cocoa Prices Lead To Hershey’s Shrinkflation",
    "description": "Today’s Forbes Daily covers Tesla and Alphabet’s earnings reports, Trump’s international business deals, Columbia’s settlement, rising home prices and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/24/forbes-daily-rising-cocoa-prices-lead-to-hersheys-shrinkflation/",
    "timestamp": "2025-07-24T12:01:52Z"
  },
  {
    "title": "Posthaste: Don't despair, the Bank of Canada could still cut interest rates — just not next week",
    "description": "Bank of Canada is expected to hold its interest on July 30, but some economists think more rate relief is on its way. Read more",
    "link": "https://financialpost.com/news/bank-of-canada-could-still-cut-interest-rates-but-not-next-week",
    "timestamp": "2025-07-24T12:01:36Z"
  },
  {
    "title": "Bondi facing calls to testify...",
    "description": null,
    "link": "https://apnews.com/article/bondi-trump-epstein-justice-department-7dee80b59dfd7751404b626e2b0648dd",
    "timestamp": "2025-07-24T12:00:02Z"
  },
  {
    "title": "'SOUTH PARK' shows president naked in bed with Satan amid Epstein probe...",
    "description": "The show's Season 27 premiere featured a shocking PSA depicting the president",
    "link": "https://www.rollingstone.com/tv-movies/tv-movie-news/south-park-trump-season-27-premiere-1235392972/",
    "timestamp": "2025-07-24T12:00:02Z"
  },
  {
    "title": "Investors seem comfortable with tariffs for now, but 'we're going to see volatility,' says chief investment strategist",
    "description": "Investors have shown resilience over higher tariff levels, and other fundamentals looks strong, market analysts say.",
    "link": "https://www.cnbc.com/2025/07/24/midyear-stock-outlook-chief-investment-strategist-predicts-volatility.html",
    "timestamp": "2025-07-24T12:00:01Z"
  },
  {
    "title": "Pay No Attention to Hunter and the Bitter Bidens",
    "description": "Anyone who’s followed the dissolute life and times of Hunter Biden knows that no one wanted the Biden presidency to end less than Hunter. His... Read More\nThe post Pay No Attention to Hunter and the Bitter Bidens appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/24/pay-no-attention-hunter-bitter-bidens/",
    "timestamp": "2025-07-24T12:00:00Z"
  },
  {
    "title": "Tomato Season Is Different This Year",
    "description": "Come fall, Americans will once again be stuck with flavorless grocery-store tomatoes. Because of tariffs, they’ll also be more expensive.",
    "link": "https://www.theatlantic.com/health/archive/2025/07/tomato-season-trump-tariffs/683645/",
    "timestamp": "2025-07-24T12:00:00Z"
  },
  {
    "title": "Shane Vaughn Ties Obama And Russia To Noah's Flood And 'The Watchers'",
    "description": "MAGA pastor Shane Vaughn claims that Barack Obama's presidency was part of a plan by a group of fallen angels known as \"The Watchers\" to corrupt mankind.",
    "link": "https://www.peoplefor.org/rightwingwatch/shane-vaughn-ties-obama-and-russia-noahs-flood-and-watchers",
    "timestamp": "2025-07-24T12:00:00Z"
  },
  {
    "title": "Obviously",
    "description": "<ul>\n<li>When Jeffrey Epstein Took The 5th</li>\n<li>Give It Another Try</li>\n<li>Culture Warriors On The Bench</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/obviously",
    "timestamp": "2025-07-24T12:00:00Z"
  },
  {
    "title": "Trump’s trip to Scotland highlights his complex relationship with his mother’s homeland",
    "description": "U.S. President Donald Trump ’s trip to Scotland this week will be a homecoming of sorts, but he’s likely to get a mixed reception.",
    "link": "https://www.bostonherald.com/2025/07/24/trump-scotland-complex-relationship/",
    "timestamp": "2025-07-24T11:58:16Z"
  },
  {
    "title": "GENIUS Act explained: How it will affect the crypto industry",
    "description": "The GENIUS Act creates a regulatory framework for stablecoins in the U.S., requiring issuers to meet strict standards while balancing innovation with oversight.",
    "link": "https://www.techtarget.com/whatis/feature/GENIUS-Act-explained-How-it-will-affect-the-crypto-industry",
    "timestamp": "2025-07-24T11:56:00Z"
  },
  {
    "title": "Pam Bondi Handed Epstein Files Road Map—'Follow the Money'",
    "description": "A Democratic Senator has accused the Department of Justice of having \"failed to conduct a real investigation\" into Jeffrey Epstein's funding.",
    "link": "https://www.newsweek.com/pam-bondi-handed-epstein-files-roadmapfollow-money-2103394",
    "timestamp": "2025-07-24T11:53:04Z"
  },
  {
    "title": "RNC Chair Michael Whatley to run for North Carolina Senate seat",
    "description": "Republican National Committee Chair Michael Whatley intends to run for Senate in North Carolina, a source familiar with the matter told NBC News.",
    "link": "https://www.nbcnews.com/politics/2026-election/rnc-chair-michael-whatley-run-north-carolina-senate-seat-rcna220752",
    "timestamp": "2025-07-24T11:52:41Z"
  },
  {
    "title": "‘South Park’ Skewers Trump and His ‘Teeny Tiny’ Manhood - Rolling Stone",
    "description": "‘South Park’ Skewers Trump and His ‘Teeny Tiny’ ManhoodRolling Stone South Park begins 27th season by taking aim at Trump: ‘He can do anything to anyone’The Guardian South Park Eviscerates Donald Trump After Paramount Gives Them $1.5BNewsweek South Park skewe…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178454696",
    "timestamp": "2025-07-24T11:52:28Z"
  },
  {
    "title": "Why Trump’s Policies Should Drive Stocks Higher in 2025",
    "description": "Investment expert Alexander Green reveals six stocks that have the potential to soar under Trump's pro-business policies.\nThe post Why Trump’s Policies Should Drive Stocks Higher in 2025 appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/07/24/why-trumps-policies-should-drive-stocks-higher-in-2025/",
    "timestamp": "2025-07-24T11:50:41Z"
  },
  {
    "title": "Donald Trump was told that his name appeared multiple times in the Epstein files",
    "description": "Embed from Getty Images A week ago, the Wall Street Journal published Donald Trump’s “letter” to Jeffrey Epstein. It wasn’t really a letter, it was a “bawdy note” written by Trump as a special gift for Epstein’s 50th birthday. Ghislaine Maxwell asked all of E…",
    "link": "https://www.celebitchy.com/932611/donald_trump_was_told_that_his_name_appeared_multiple_times_in_the_epstein_files/",
    "timestamp": "2025-07-24T11:50:39Z"
  },
  {
    "title": "Obama’s Self-Incriminating Defense",
    "description": "As the former president’s “chickens come home to roost,” it will be interesting to see how this slick politician twists the revelations. For two decades, Barack Obama has demonstrated, through words and deeds, that his deference is toward no one other than hi…",
    "link": "https://freerepublic.com/focus/f-chat/4330459/posts",
    "timestamp": "2025-07-24T11:50:26Z"
  },
  {
    "title": "As Scrutiny Over Epstein Grows, Trump Shifts Focus on Obama",
    "description": "As President Donald Trump faces new scrutiny over the Jeffrey Epstein files, the White House appears to be attempting to shift attention away from Epstein with Director of National Intelligence Tulsi Gabbard accusing former President Barack Obama, without evi…",
    "link": "https://www.today.com/video/ag-reportedly-told-trump-in-may-his-name-is-in-epstein-files-243761221589",
    "timestamp": "2025-07-24T11:49:10Z"
  },
  {
    "title": "'No evidence!' CNN scrambles to change subject as Dem drops wild suggestion about Trump",
    "description": "A Democratic congressman put President Donald Trump's name and the word \"pedophile\" into the same sentence, prompting a hasty scramble by a CNN host to make a legal disclaimer — and change the topic.Rep. Sam Liccardo (D-CA) appeared Thursday on \"CNN This Morn…",
    "link": "https://www.rawstory.com/donald-trump-jeffrey-epstein-scandal/",
    "timestamp": "2025-07-24T11:47:40Z"
  },
  {
    "title": "Gabbard releases more Russia documents to accuse Obama of 'manufacturing' intelligence",
    "description": "Trump accuses Obama of treason as Tulsi Gabbard declassifies a sensitive report on Russia's 2016 election interference",
    "link": "https://www.wxii12.com/article/trump-obama-treason-russia-interference-report/65497182",
    "timestamp": "2025-07-24T11:45:45Z"
  },
  {
    "title": "Gabbard releases more Russia documents to accuse Obama of 'manufacturing' intelligence",
    "description": "Trump accuses Obama of treason as Tulsi Gabbard declassifies a sensitive report on Russia's 2016 election interference",
    "link": "https://www.wmur.com/article/trump-obama-treason-russia-interference-report/65497182",
    "timestamp": "2025-07-24T11:45:45Z"
  },
  {
    "title": "Fact check: Could Trump’s trade tariffs pay off the US deficit?",
    "description": "Commerce Secretary Howard Lutnick says tariffs will plug US finances, but experts say it's unlikely.",
    "link": "https://www.aljazeera.com/news/2025/7/24/fact-check-could-trumps-trade-tariffs-pay-off-the-us-deficit",
    "timestamp": "2025-07-24T11:45:42Z"
  },
  {
    "title": "US Treasury chief says trade talks with China may include Russia, Iran oil buys",
    "description": "Scott Bessent says China is large buyer 'of sanctioned Iranian oil, sanctioned Russian oil. So we could start discussing that' Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/22/us-treasury-chief-says-trade-talks-with-china-may-include-russia-iran-oil-buys",
    "timestamp": "2025-07-24T11:45:00Z"
  },
  {
    "title": "SCOTUS Allows Trump To Boot Dems Off Consumer Product Safety Board",
    "description": "Here we go again with the emergency docket scam. Why does Trump want to kill people, and why are Republicans on SCOTUS helping him do it? Via The Washington Post:\nA divided Supreme Court Wednesday cleared the way for President Donald Trump to remove the Democ…",
    "link": "https://crooksandliars.com/2025/07/scotus-allows-trump-boot-dems-consumer",
    "timestamp": "2025-07-24T11:40:39Z"
  },
  {
    "title": "What do we know about the Epstein files?",
    "description": "The clamour is growing for the Trump administration to put documents related to the Epstein investigations before the public.",
    "link": "https://www.bbc.com/news/articles/c20r07dg6kro?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-24T11:36:04Z"
  },
  {
    "title": "What do we know about the Epstein files?",
    "description": "The clamour is growing for the Trump administration to put documents related to the Epstein investigations before the public.",
    "link": "https://www.bbc.com/news/articles/c20r07dg6kro",
    "timestamp": "2025-07-24T11:36:00Z"
  },
  {
    "title": "Flashback Exchange of the Day",
    "description": "Jeffrey Epstein was asked in a 2010 deposition about his relationship with Donald Trump:  LAWYER: Have you ever had a personal relationship with Donald Trump? EPSTEIN: What do you mean by \"personal relationship,\" sir? LAWYER: Have",
    "link": "https://politicalwire.com/2025/07/24/flashback-exchange-of-the-day-3/",
    "timestamp": "2025-07-24T11:35:47Z"
  },
  {
    "title": "No, Trump Did Not Start the Global 'Trade War' | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAfter strong growth in 2024, global trade will take a hit this year. Many point the finger at President Donald Trump. That's a mistake.\nThe World Trade Organization said the volume of merchandise trade this ye…",
    "link": "https://biztoc.com/x/1e41aadd587516b2",
    "timestamp": "2025-07-24T11:35:30Z"
  },
  {
    "title": "Gold price crashes: Should you bet on low gold rate and invest? Here is what experts are saying",
    "description": "Gold tends to do well in a low-interest rate environment. Gold is down this morning due to the positive news flow around global trade.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-crashes-should-you-bet-on-low-gold-rate-and-invest-here-is-what-experts-are-saying/articleshow/122881867.cms",
    "timestamp": "2025-07-24T11:35:25Z"
  },
  {
    "title": "Last night’s episode of ‘South Park’ ripped into Paramount & Donald Trump",
    "description": "Paramount/CBS gave up their spine, their ethics, their integrity and their brand to get their merger with Skydance through. The Trump administration could have gotten anything from Paramount Global, anything Donald Trump asked for, they would have given him. …",
    "link": "https://www.celebitchy.com/932688/last_nights_episode_of_south_park_ripped_into_paramount_donald_trump/",
    "timestamp": "2025-07-24T11:35:10Z"
  },
  {
    "title": "How 'Unverifiable' Report Became Russiagate Dynamite",
    "description": "The Obama intelligence community’s claim that Russian President Vladimir Putin authorized dirty tricks to try and help Donald Trump win the 2016 election was based on \"one scant, unclear and...",
    "link": "https://www.realclearinvestigations.com/articles/2025/07/24/how_obama_admin_turned_unverifiable_report_into_russiagate_dynamite_1124640.html",
    "timestamp": "2025-07-24T11:35:05Z"
  },
  {
    "title": "Japan trade deal sparks hope for US investors, frustration for automakers - Reuters",
    "description": "Japan trade deal sparks hope for US investors, frustration for automakersReuters Trump's 'massive' deal with Japan is giving US automakers heartburnPolitico Treasuries Slip as Trade Deal Hopes Sap Demand for Haven AssetsBloomberg How Trump’s Japan Deal Could …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178454604",
    "timestamp": "2025-07-24T11:34:25Z"
  },
  {
    "title": "Agentic AI systems must have ‘a human in the loop,’ says Google exec",
    "description": "As agentic systems become more autonomous, the need for responsible AI increases.",
    "link": "https://fortune.com/2025/07/24/agentic-ai-systems-must-have-human-loop-says-google-exec-cfo/",
    "timestamp": "2025-07-24T11:30:49Z"
  },
  {
    "title": "White House Spox Says ‘The View’ Could Be the Next Show ‘Pulled Off Air’ After ‘Irrelevant Loser’ Joy Behar’s Latest Anti-Trump Screed",
    "description": "White House Spox Says ‘The View’ Could Be the Next Show ‘Pulled Off Air’ After ‘Irrelevant Loser’ Joy Behar’s Latest Anti-Trump Screedbreitbart.com",
    "link": "https://www.breitbart.com/entertainment/2025/07/24/white-house-spox-says-the-view-could-be-the-next-show-pulled-off-air-after-irrelevant-loser-joy-behars-latest-anti-trump-screed/",
    "timestamp": "2025-07-24T11:30:31Z"
  },
  {
    "title": "‘Bubbles Are About To Start Busting’—Huge Price Swings Spark Fear Of A Stock Market And Bitcoin Crash",
    "description": "Some are warning the bitcoin price and stock market bubble could be about to burst as prices swing wildly...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/24/bubbles-are-about-to-start-busting-huge-price-swings-spark-fear-of-a-stock-market-and-bitcoin-crash/",
    "timestamp": "2025-07-24T11:30:26Z"
  },
  {
    "title": "President Trump threatened to break up Nvidia, didn't even know what it was — 'What the hell is Nvidia? I've never heard of it before'",
    "description": "President Trump has admitted he threatened to break up Nvidia, despite not knowing who Jensen Huang was and having never heard of the company before.",
    "link": "https://www.tomshardware.com/tech-industry/president-trump-threatened-to-break-up-nvidia-didnt-even-know-what-it-was-what-the-hell-is-nvidia-ive-never-heard-of-it-before",
    "timestamp": "2025-07-24T11:30:17Z"
  },
  {
    "title": "Has Trump Killed Green Finance?",
    "description": "Just four years ago, the world's banks, insurers, and asset managers were pledging to align their operations with the goal of achieving net-zero emissions, in order to mitigate the risks to financial stability posed by climate change. Now, however, those pled…",
    "link": "https://www.project-syndicate.org/commentary/trump-trying-to-end-green-finance-by-howard-davies-2025-07",
    "timestamp": "2025-07-24T11:30:09Z"
  },
  {
    "title": "No, Trump Did Not Start the Global 'Trade War' | Opinion",
    "description": "President Donald Trump's policies are working.",
    "link": "https://www.newsweek.com/no-trump-did-not-start-global-trade-war-opinion-2103083",
    "timestamp": "2025-07-24T11:30:01Z"
  },
  {
    "title": "Gabbard's claims of an anti-Trump conspiracy are not supported by declassified documents",
    "description": "Gabbard cited newly declassified emails from Obama officials in hopes of undermining the intelligence community's conclusion that Vladimir Putin wanted to boost Trump and denigrate his Democratic opponent Hillary Clinton.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_6486bdd8-82f1-5cff-a3f6-3d221dc613f5.html",
    "timestamp": "2025-07-24T11:30:00Z"
  },
  {
    "title": "Why the Washington Commanders’ NFL logo rebrand has stirred controversy in Montana",
    "description": "A former Blackfeet Tribal chair member designed the logo decades ago. And while the team recently adopted a new name and identity, some Montanans have pushed to preserve the original.",
    "link": "https://billingsgazette.com/news/local/indigenous/article_ae86192a-1b1d-4f8b-a955-546a25828adc.html",
    "timestamp": "2025-07-24T11:30:00Z"
  },
  {
    "title": "Recession Risk In Autumn 2025 Rising With Tariff Uncertainty",
    "description": "I am not forecasting a recession now but the risk rises as tariff uncertainty continues. If not settled by the end of summer, expect a recession in the fall and winter.",
    "link": "https://www.forbes.com/sites/billconerly/2025/07/24/recession-risk-in-autumn-2025-rising-with-tariff-uncertainty/",
    "timestamp": "2025-07-24T11:30:00Z"
  },
  {
    "title": "'What was that? Seriously?' Tulsi Gabbard buried on MSNBC for new level of 'crazy'",
    "description": "A decision by the White House to trot out Director of National Intelligence (DNI) Tulsi Gabbard in the middle of a press conference on Wednesday earned the Donald Trump administration a thrashing on MSNBC on Thursday morning.With the White House trying to put…",
    "link": "https://www.rawstory.com/tulsi-conspiracy/",
    "timestamp": "2025-07-24T11:26:48Z"
  },
  {
    "title": "Saudi Arabia pledges $2.9bn for Syria infrastructure, part of wider package",
    "description": "Saudi Arabia has been a major backer of the new Syrian government since the fall of Bashar al-Assad last December.",
    "link": "https://www.aljazeera.com/news/2025/7/24/saudi-arabia-pledges-2-9bn-for-syria-infrastructure-part-of-wider-package",
    "timestamp": "2025-07-24T11:25:32Z"
  },
  {
    "title": "5 things to know before the stock market opens on Thursday, July 24",
    "description": "5 things to know before the stock market opens on Thursday, July 24cnbc.com",
    "link": "https://www.cnbc.com/2025/07/24/5-things-to-know-before-the-stock-market-opens-on-thursday-july-24.html",
    "timestamp": "2025-07-24T11:23:26Z"
  },
  {
    "title": "TSMC’s US Chips Are 20% More Expensive — And That’s a Problem for AI’s Growth",
    "description": "The CEO of AMD, Lisa Su, recently said that the TSMC's US-manufactured chips costs about 20% higher than the one manufactured in Taiwan.",
    "link": "https://www.androidheadlines.com/2025/07/tsmcs-us-chips-are-20-more-expensive-and-thats-a-problem-for-ais-growth.html",
    "timestamp": "2025-07-24T11:21:09Z"
  },
  {
    "title": "'You're going to need more electricity than any human beings ever... Jensen, you're gonna have to explain that to me someday' says Trump to Nvidia's CEO as he rolls out his AI expansion plan",
    "description": "'Double what we produce right now for everything, right?'",
    "link": "https://www.pcgamer.com/software/ai/youre-going-to-need-more-electricity-than-any-human-beings-ever-jensen-youre-gonna-have-to-explain-that-to-me-someday-says-trump-to-the-nvidia-head-honcho-as-he-rolls-out-his-mega-ai-expansion-plan/",
    "timestamp": "2025-07-24T11:19:15Z"
  },
  {
    "title": "Trump To Visit The Federal Reserve, Ramping Up Pressure On Jerome Powell",
    "description": "The president has lambasted the U.S. central bank chief repeatedly for not cutting interest rates more aggressively, musing publicly about firing him.",
    "link": "https://www.huffpost.com/entry/trump-federal-reserve-visit_n_68821497e4b0da6f1495d797",
    "timestamp": "2025-07-24T11:19:14Z"
  },
  {
    "title": "K Street rakes in record cash thanks to Trump (Caitlin Oprysko/Politico)",
    "description": "Caitlin Oprysko / Politico:\nK Street rakes in record cash thanks to Trump … The first six months of President Donald Trump's term have produced a cash cow of historic magnitude for the lobbying industry, with record-breaking demand for help navigating the adm…",
    "link": "https://www.memeorandum.com/250724/p10",
    "timestamp": "2025-07-24T11:15:01Z"
  },
  {
    "title": "GOP Senator Says Timing Of Tulsi Gabbard's Obama Conspiracy Push Seems Curious",
    "description": "The director of national intelligence baselessly accused Barack Obama of orchestrating a “yearslong coup and treasonous conspiracy” against her boss.",
    "link": "https://www.huffpost.com/entry/gop-senator-criticizes-gabbard-obama-conspiracy-push_n_6881f878e4b0cde1a1cc2ec3",
    "timestamp": "2025-07-24T11:14:23Z"
  },
  {
    "title": "Transcript: “Furious” Trump Spiraling Over Epstein Mess, Allies Admit",
    "description": "The following is a lightly edited transcript of the July 24 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.President Dona…",
    "link": "https://newrepublic.com/article/198309/transcript-furious-trump-spiraling-epstein-mess-allies-admit",
    "timestamp": "2025-07-24T11:09:47Z"
  },
  {
    "title": "EU Leaders Hold Trade Talks with Xi Jinping in Beijing Ahead of Trump Deadline",
    "description": "European leaders demanded a more balanced relationship with China at a summit with President Xi Jinping in the Chinese capital on Thursday.\nThe post EU Leaders Hold Trade Talks with Xi Jinping in Beijing Ahead of Trump Deadline appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/07/24/eu-leaders-hold-trade-talks-with-xi-jinping-in-beijing-ahead-of-trump-deadline/",
    "timestamp": "2025-07-24T11:09:17Z"
  },
  {
    "title": "Trump’s Epstein nightmare worsens amid new revelations and a GOP revolt - Boston News, Weather, Sports | WHDH 7News",
    "description": "(CNN) — The Jeffrey Epstein morass surrounding President Donald Trump is deepening amid growing defiance by some Republicans and despite the administration’s most inflammatory attempt yet<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/trumps-epstein-…",
    "link": "https://whdh.com/news/trumps-epstein-nightmare-worsens-amid-new-revelations-and-a-gop-revolt/",
    "timestamp": "2025-07-24T11:07:40Z"
  },
  {
    "title": "On Defending Human Rights, America Returns to First Principles",
    "description": "But for the new policy on democracy and human rights to work, Donald Trump needs to stop undermining them.",
    "link": "http://foreignpolicy.com/2025/07/24/trump-human-rights-democracy-freedom-liberty-united-nations-hrc-us/",
    "timestamp": "2025-07-24T11:05:56Z"
  },
  {
    "title": "RNC Chair To Run For Senate After Lara Trump Opts To Stay at Fox News: Report",
    "description": "RNC chair Michael Whatley will run for Senate seat in North Carolina after Trump's daughter-in-law Lara Trump opted to stay at Fox News.\nThe post RNC Chair To Run For Senate After Lara Trump Opts To Stay at Fox News: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/rnc-chair-to-run-for-senate-after-lara-trump-opts-to-stay-at-fox-news-report/",
    "timestamp": "2025-07-24T11:03:56Z"
  },
  {
    "title": "Tulsi Gabbard's unprecedented accusation against Obama and 'The Osbournes' cultural impact: Morning Rundown",
    "description": "The White House takes a different approach on the Jeffrey Epstein case.",
    "link": "https://www.nbcnews.com/news/us-news/tulsi-gabbard-accusation-obama-osbournes-tv-impact-morning-rundown-rcna220740",
    "timestamp": "2025-07-24T11:03:51Z"
  },
  {
    "title": "The Hidden Dangers of Eliminating Taxes on Tips | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nEarlier this month, President Donald Trump signed the Big Beautiful Bill into law. One of its provisions that made a bipartisan splash on the campaign trail was the elimination of taxes on tips for service-wor…",
    "link": "https://biztoc.com/x/53874afbac3d4564",
    "timestamp": "2025-07-24T11:02:18Z"
  },
  {
    "title": "Stephen Colbert had left-wing journalists, hosts on 'The Late Show' more than 200 times",
    "description": "A review by Fox News Digital found that left-wing journalists and other media figures made hundreds of appearances on \"The Late Show with Stephen Colbert.\"",
    "link": "https://www.foxnews.com/media/stephen-colbert-had-left-wing-journalists-hosts-the-late-show-more-than-200-times",
    "timestamp": "2025-07-24T11:00:03Z"
  },
  {
    "title": "To the FDIC: Where’s the Money From the Signature Shutdown?",
    "description": "The FDIC shuttered Signature Bank more than two years ago now.  Isn’t it time for the billions of dollars that the FDIC has collected in selling off the bank’s assets to be distributed to creditors, bondholders and shareholders? It has been reported that the …",
    "link": "http://commercialobserver.com/2025/07/signature-bank-fdic-shareholders/",
    "timestamp": "2025-07-24T11:00:02Z"
  },
  {
    "title": "The Hidden Dangers of Eliminating Taxes on Tips | Opinion",
    "description": "Instead of holding consumers accountable for sharing their data responsibly as privacy laws currently do, we must hold platform companies and our government accountable for the responsible stewardship of users' personal data.",
    "link": "https://www.newsweek.com/hidden-dangers-eliminating-taxes-tips-opinion-2102991",
    "timestamp": "2025-07-24T11:00:01Z"
  },
  {
    "title": "Melania Trump's parents came to U.S. through process Donald Trump tried to curb",
    "description": "First lady Melania Trump’s parents came to the United States through a family-based sponsorship, also referred to derogatorily as “chain migration.”",
    "link": "https://www.snopes.com//fact-check/melania-parents-chain-migration/",
    "timestamp": "2025-07-24T11:00:00Z"
  },
  {
    "title": "Fact Check: Melania Trump's parents came to U.S. through process Donald Trump tried to curb",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_d022991e-17aa-4497-96f8-37b4f6b5206a",
    "timestamp": "2025-07-24T11:00:00Z"
  },
  {
    "title": "Declan Lynch: ‘There is encouragement for Flatley - he was probably the best of the 65 candidates to emerge last Saturday’",
    "description": "Listening to the ­brilliant and charming CNN presenter John King on RTÉ1’s Sunday with ­Miriam (RTÉ Radio 1, Sunday, 10am) was so ­enjoyable, it was only afterwards it struck me that we’re probably in a lot more trouble in this world than we think – and we al…",
    "link": "https://www.independent.ie/entertainment/radio/declan-lynch-there-is-encouragement-for-flatley-he-was-probably-the-best-of-the-65-candidates-to-emerge-last-saturday/a794634170.html",
    "timestamp": "2025-07-24T11:00:00Z"
  },
  {
    "title": "Obama Raises Money to Counter GOP Redistrictimg",
    "description": "“Barack Obama and Donald Trump are squaring off over Republicans’ push to remap two red states, with the former Democratic president fundraising against his successor’s effort to maintain control over Congress next year,“ Politico reports.",
    "link": "https://politicalwire.com/2025/07/24/obama-raises-money-to-counter-gop-redistrictimg/",
    "timestamp": "2025-07-24T10:53:34Z"
  },
  {
    "title": "EXCLUSIVE: John Thune Says Dems’ Unprecedented ‘Obstruction’ Will Cost Them Next Time They’re In Power",
    "description": "Senate Majority Leader John Thune has a simple message for Democrats' continued slow-walking of President Donald Trump's nominees: be careful what you wish for.",
    "link": "https://dailycaller.com/2025/07/24/john-thune-democrats-obstruction-trump-nominees-senate/",
    "timestamp": "2025-07-24T10:53:21Z"
  },
  {
    "title": "Donald Trump to visit Federal Reserve after attacking $2.5bn renovation - Financial Times",
    "description": "Donald Trump to visit Federal Reserve after attacking $2.5bn renovationFinancial Times Trump to Visit Federal Reserve As Campaign Against Powell IntensifiesThe New York Times Trump's visit to Fed today may not follow history of president endorsing independenc…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178454382",
    "timestamp": "2025-07-24T10:52:48Z"
  },
  {
    "title": "South Park Depicts Trump With Micropenis in Episode Mocking Paramount Settlement With President",
    "description": "South Park depicted President Donald Trump with a \"teeny tiny penis\" in an episode ridiculing its network Paramount's settlement.\nThe post South Park Depicts Trump With Micropenis in Episode Mocking Paramount Settlement With President first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/south-park-depicts-trump-with-micropenis-in-episode-mocking-paramount-settlement-with-president/",
    "timestamp": "2025-07-24T10:52:02Z"
  },
  {
    "title": "Trump Seeks Voter Rolls from Michigan",
    "description": "“President Donald Trump’s Justice Department is asking the top election official in the key battleground state of Michigan for access to voter registration records and demanding information about its efforts to kick ineligible voters off",
    "link": "https://politicalwire.com/2025/07/24/trump-seeks-voter-rolls-from-michigan/",
    "timestamp": "2025-07-24T10:48:04Z"
  },
  {
    "title": "Trump’s poll numbers are cratering. Why won’t he change course?",
    "description": "Six months into his second term, the president refuses to change his policies and behavior",
    "link": "https://www.salon.com/2025/07/24/trumps-poll-numbers-are-cratering-why-wont-he-change-course/",
    "timestamp": "2025-07-24T10:45:40Z"
  }
]