[
  {
    "title": "Trump calls for withholding federal money from schools and colleges that require COVID vaccines",
    "description": "The order applies only to COVID-19 vaccines.",
    "link": "https://www.bostonherald.com/2025/02/14/trump-federal-money-covid-vaccine-school-requirements/",
    "timestamp": "2025-02-14T19:51:49Z"
  },
  {
    "title": "Trump calls for withholding federal money from schools and colleges that require COVID vaccines",
    "description": "The order applies only to COVID-19 vaccines.",
    "link": "https://www.denverpost.com/2025/02/14/trump-federal-money-covid-vaccine-school-requirements/",
    "timestamp": "2025-02-14T19:51:49Z"
  },
  {
    "title": "Trump, Musk Promote False Narratives About South Africa | Opinion",
    "description": "As U.S. President Donald Trump signed an executive order last Friday granting Afrikaners refugee status amid accusations of racial discrimination in South Africa, tensions between the two countries reached an all-time high.\nAhead of that executive order, Trum…",
    "link": "https://biztoc.com/x/3687bc35b05cbb7a",
    "timestamp": "2025-02-14T19:51:48Z"
  },
  {
    "title": "PHOTO --'Trolling with Love': White House Gives Epic Valentine's Day Warning to Illegal Migrants",
    "description": "The White House offered a sweet yet salty Valentine's Day warning to people thinking about crossing the United States border illegally.\nThe post PHOTO –‘Trolling with Love’: White House Gives Epic Valentine’s Day Warning to Illegal Migrants appeared first on …",
    "link": "https://www.breitbart.com/immigration/2025/02/14/photo-trolling-love-white-house-gives-epic-valentines-day-warning-illegal-migrants/",
    "timestamp": "2025-02-14T19:51:37Z"
  },
  {
    "title": "FOX NEWS CHANNEL’S SEAN HANNITY TO PRESENT A JOINT INTERVIEW WITH PRESIDENT DONALD TRUMP AND ELON MUSK ON TUESDAY, FEBRUARY 18",
    "description": "NEW YORK – February 14, 2025 – FOX News Channel’s Sean Hannity will present an exclusive joint interview with President Donald Trump and Elon Musk, leader of the Department of Government Efficiency (DOGE) initiative, on Hannity (9-10 PM/ET) on Tuesday, Februa…",
    "link": "https://press.foxnews.com/2025/02/fox-news-channels-sean-hannity-to-present-a-joint-interview-with-president-donald-trump-and-elon-musk-on-tuesday-february-18",
    "timestamp": "2025-02-14T19:50:58Z"
  },
  {
    "title": "White House Cuts AP Press Access Over 'Gulf Of America' Spat",
    "description": "\"The Associated Press continues to ignore the lawful geographic name change of the Gulf of America,\" a White House official said.",
    "link": "https://www.huffpost.com/entry/white-house-ap-press-access-gulf-of-amerca_n_67af84e6e4b053b7510fd71a",
    "timestamp": "2025-02-14T19:50:43Z"
  },
  {
    "title": "Trump, Musk Promote False Narratives About South Africa | Opinion",
    "description": "U.S. President Donald Trump signed an executive order last Friday granting Afrikaners refugee status amid accusations of racial discrimination in South Africa.",
    "link": "https://www.newsweek.com/trump-musk-promote-false-narratives-about-south-africa-opinion-2029442",
    "timestamp": "2025-02-14T19:50:40Z"
  },
  {
    "title": "National Hurricane Center Changes Storm Map to Gulf of America",
    "description": "The National Hurricane Center recently changed the Gulf of Mexico on its storm tracking map to the Gulf of America.",
    "link": "https://www.newsweek.com/national-hurricane-center-changes-map-gulf-mexico-donald-trump-2031486",
    "timestamp": "2025-02-14T19:49:41Z"
  },
  {
    "title": "The White House bans the AP indefinitely over the use of ‘Gulf of Mexico’",
    "description": "The Trump White House said Friday that The Associated Press is banned from the Oval Office and Air Force One indefinitely.\nThe AP, one of the world’s biggest news outlets, was singled out by the White House earlier this week over three words: “Gulf of Mexico.…",
    "link": "https://biztoc.com/x/5811f8462874c921",
    "timestamp": "2025-02-14T19:48:43Z"
  },
  {
    "title": "White House Bans AP Reporter From Air Force One in Ongoing Spat Over ‘Gulf of America’",
    "description": "The Associated Press is sticking to its style guidance regarding the name of the body of water between Mexico and the United States -- and the Trump administration is continuing to ban AP reporters from their traditional place in the White House Press Corps a…",
    "link": "https://www.mediaite.com/news/white-house-bans-ap-reporter-from-air-force-one-in-ongoing-spat-over-gulf-of-america/",
    "timestamp": "2025-02-14T19:48:26Z"
  },
  {
    "title": "Trump says auto tariffs coming around April 2",
    "description": "United States President Donald Trump announced Friday that tariffs on imported automobiles will take effect around April 2. The announcement follows Trump's recent executive order on reciprocal tariff...",
    "link": "https://biztoc.com/x/9fc147d08179cf0f",
    "timestamp": "2025-02-14T19:47:59Z"
  },
  {
    "title": "Wall Street flirts with a record as indexes drift",
    "description": "Wall Street is flirting with a record, as U.S. stock indexes drift following some mixed profit reports from big companies.",
    "link": "https://www.wishtv.com/news/business/wall-street-flirts-with-a-record-as-indexes-drift/",
    "timestamp": "2025-02-14T19:47:54Z"
  },
  {
    "title": "Trump 'wouldn't mind' Nippon having minority stake in US Steel",
    "description": "United States President Donald Trump told reporters on Friday that he \"wouldn't mind\" Nippon Steel acquiring a minority stake in US Steel.Trump noted that Nippon Steel is currently looking at an inves...",
    "link": "https://biztoc.com/x/1ca58ec0e0dd66a3",
    "timestamp": "2025-02-14T19:47:51Z"
  },
  {
    "title": "Jordan Klepper Gives an Exclusive Look at Trump’s Hot, New Kennedy Center and Casino | Video",
    "description": "\"Screw off, Twinkle Toes, because all ballet will now be done by pole dancers — talk about a nutcracker,\" the \"Daily Show\" jokes\nThe post Jordan Klepper Gives an Exclusive Look at Trump’s Hot, New Kennedy Center and Casino | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-kennedy-center-jordan-klepper-the-daily-show/",
    "timestamp": "2025-02-14T19:47:29Z"
  },
  {
    "title": "Trump, Elon Musk Invited to SNL 50 Anniversary Special: Report",
    "description": "Both men have been invited to attend as former hosts.\nTrump, Elon Musk Invited to SNL 50 Anniversary Special: Report\nScoop Harrison",
    "link": "https://consequence.net/2025/02/trump-elon-musk-snl-50-special/",
    "timestamp": "2025-02-14T19:46:48Z"
  },
  {
    "title": "Trump bars federal funding to schools with COVID vaccine mandates",
    "description": "Trump bars federal funding to schools with COVID vaccine mandatesgo.com",
    "link": "https://abcnews.go.com/Politics/trump-bars-federal-funding-schools-covid-vaccine-mandates/story?id=118836337",
    "timestamp": "2025-02-14T19:46:17Z"
  },
  {
    "title": "Catholic leaders push for $10 billion federal school choice program",
    "description": "null / Credit: PUWADON SANG/Shutterstock\n\nCNA Staff, Feb 14, 2025 / 14:45 pm (CNA).\nCatholic leaders have voiced support for a bill that would establish a federal tax credit to expand school choice in K–12 education.If passed, the Educational Choices for Chil…",
    "link": "https://www.catholicnewsagency.com/news/262223/catholic-leaders-push-for-10-dollars-billion-federal-school-choice-program",
    "timestamp": "2025-02-14T19:45:00Z"
  },
  {
    "title": "Scottish government hits back at JD Vance's abortion claim it sent out 'illegal prayer' warning letters",
    "description": "Vance claimed the Scottish government told people they could be breaking the law by praying in their own homes.",
    "link": "https://uk.news.yahoo.com/jd-vance-prayer-abortion-buffer-zone-scotland-194430824.html",
    "timestamp": "2025-02-14T19:44:30Z"
  },
  {
    "title": "Gaza Life Expectancy Slashed Nearly in Half by Israel’s Genocide, Study Finds",
    "description": "Researchers said this estimate is conservative, as it doesn’t include deaths to factors like starvation and disease.",
    "link": "https://truthout.org/articles/gaza-life-expectancy-slashed-nearly-in-half-by-israels-genocide-study-finds/",
    "timestamp": "2025-02-14T19:43:25Z"
  },
  {
    "title": "DOGE Needs Data To Survive. These Lawsuits Are Trying To Starve It of Information.",
    "description": "Nearly a dozen lawsuits allege that DOGE's access to government payment and personnel systems violates a litany of federal privacy and record-handling laws.",
    "link": "https://reason.com/2025/02/14/doge-needs-data-to-survive-these-lawsuits-are-trying-to-starve-it-of-information/",
    "timestamp": "2025-02-14T19:42:29Z"
  },
  {
    "title": "White House Restricts AP Access for 'Misinformation' on Gulf of America's Official Name",
    "description": "The White House barred the Associated Press indefinitely on Friday from the Oval Office and Air Force One for \"commitment to misinformation\" by refusing to recognize the “Gulf of America” as the official name.\nThe post White House Restricts AP Access for ‘Mis…",
    "link": "https://www.breitbart.com/politics/2025/02/14/white-house-restricts-ap-access-misinformation-gulf-americas-official-name/",
    "timestamp": "2025-02-14T19:40:31Z"
  },
  {
    "title": "TikTok Ban Timeline: TikTok Returns To U.S. App Stores—For Now",
    "description": "The app’s availability in the U.S. has been thrown into jeopardy over data privacy and national security concerns.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/02/14/tiktok-ban-timeline-tiktok-returns-to-us-app-stores-for-now/",
    "timestamp": "2025-02-14T19:39:34Z"
  },
  {
    "title": "Blow It Out Your Nose! Krugman Tries to Make ‘Trumpflation’ a Thing",
    "description": "Amazing. Just amazing. The consummate Bidenomics simp and former New York Times columnist Paul Krugman is trying to make “Trumpflation” a thing in the public discourse.",
    "link": "https://newsbusters.org/blogs/business/joseph-vazquez/2025/02/14/oh-blow-it-out-your-nose-paul-krugman-already-trying-make",
    "timestamp": "2025-02-14T19:39:15Z"
  },
  {
    "title": "The Only Viable Peace for Ukraine",
    "description": "Neutrality in exchange for occupied territory—with an ironclad Western defense guarantee if Russia attacks again—is the way forward.",
    "link": "https://foreignpolicy.com/2025/02/14/ukraine-russia-trump-putin-peace-neutrality-territory-zelensky/",
    "timestamp": "2025-02-14T19:37:42Z"
  },
  {
    "title": "Pope Francis Hospitalized, 'Struggling to Speak': Report",
    "description": "Francis \"appeared bloated and pale during the handful of audiences he held before going to the hospital,\" the Associated Press reported.",
    "link": "https://www.westernjournal.com/pope-francis-hospitalized-struggling-speak-report/",
    "timestamp": "2025-02-14T19:37:36Z"
  },
  {
    "title": "Pentagon chief says he would love more US troops in Poland",
    "description": "Poland has been a “model” NATO ally, US Defense Secretary Pete Hegseth has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612742-us-troops-poland-ukraine/",
    "timestamp": "2025-02-14T19:37:22Z"
  },
  {
    "title": "Jubilation in Moscow Over Trump’s Gifts to Putin",
    "description": "To the Kremlin and its supporters, fortune has finally turned Russia’s way.",
    "link": "https://foreignpolicy.com/2025/02/14/trump-putin-deal-negotiations-russia-ukraine-peace/",
    "timestamp": "2025-02-14T19:36:16Z"
  },
  {
    "title": "Ukraine-Russia agreement must come through Trump negotiations, Zelenskyy says",
    "description": "Ukrainian President Volodymyr Zelenskyy appealed to President Donald Trump's history as a dealmaker on Friday, offering flattering words as he sought the U.S. president's leadership in negotiations that could end the Russia-Ukraine conflict.",
    "link": "https://www.cbc.ca/news/world/ukraine-russia-munich-security-conference-1.7459683",
    "timestamp": "2025-02-14T19:35:56Z"
  },
  {
    "title": "TRUMP Solana Meme Coin Spikes 40% as XRP and Dogecoin Jump",
    "description": "President Donald Trump's Solana meme coin has skyrocketed again, while major coins like Dogecoin and XRP show their own sizable increases.",
    "link": "https://decrypt.co/306068/trump-solana-meme-coin-spikes-xrp-dogecoin",
    "timestamp": "2025-02-14T19:33:58Z"
  },
  {
    "title": "Elon Musk Doesn’t Have a Valid Legal Case Against Critics Who Accused Him of Doing a Nazi Salute — But That Never Was the Point, Was It?",
    "description": "Even though Elon Musk's claims that it's defamatory to say it looked like he was doing a Nazi salute won't withstand constitutional scrutiny, that never really was the Chief Twit's point anyway.\nThe post Elon Musk Doesn’t Have a Valid Legal Case Against Criti…",
    "link": "https://www.mediaite.com/opinion/elon-musk-doesnt-have-a-valid-legal-case-against-critics-who-accused-him-of-doing-a-nazi-salute-but-that-never-was-the-point-was-it/",
    "timestamp": "2025-02-14T19:33:21Z"
  },
  {
    "title": "Senate Republicans introduce bills to make EVs more expensive",
    "description": "Two bills were introduced in the Senate that, if enacted, would dramatically increase the price for most electric vehicles. The first bill, sponsored by Sen. John Barrasso (R-Wyo.), would eliminate the $7,500 EV tax credit, while a second one from Sen. Deb Fi…",
    "link": "https://www.theverge.com/news/613296/senate-bills-ev-tax-credit-kill-fee-highway-republican",
    "timestamp": "2025-02-14T19:31:59Z"
  },
  {
    "title": "Up to 10,000 US federal workers fired this week as Trump and Musk intensify assault on government agencies",
    "description": "US President Donald Trump and his adviser Elon Musk's campaign to radically cut back US federal agencies spread on Friday, with thousands of workers who handle everything from securing the nation's nuclear weapons to caring for military veterans losing their …",
    "link": "https://www.independent.ie/world-news/up-to-10000-us-federal-workers-fired-this-week-as-trump-and-musk-intensify-assault-on-government-agencies/a863421864.html",
    "timestamp": "2025-02-14T19:31:39Z"
  },
  {
    "title": "China Finally Agrees With Trump",
    "description": "China has backed President Donald Trump's call to scale back military expenditures, saying the United States, as the world's top defense spender, should set the example.\nNewsweek reached out to the U.S. Department of Defense and the Russian Foreign Ministry b…",
    "link": "https://biztoc.com/x/f20feaaebffae58f",
    "timestamp": "2025-02-14T19:31:29Z"
  },
  {
    "title": "Trump Aide Gives Update on Associated Press 'Space' to Cover White House",
    "description": "Taylor Budowich, White House deputy chief of staff for communications and personnel, said Friday that some of the Associated Press' access to cover President Donald Trump will be opened up to other reporters.\nOn Thursday, the White House barred an Associated …",
    "link": "https://biztoc.com/x/38b2a78963744391",
    "timestamp": "2025-02-14T19:31:07Z"
  },
  {
    "title": "Donald Trump’s Task Force to declassify JFK files, Epstein records, UFO reports",
    "description": "President Donald Trump’s task force, led by Rep Anna Paulina Luna, plans to declassify files on JFK’s assassination, Jeffrey Epstein, and UFOs, aiming for full transparency.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-task-force-to-declassify-jfk-files-epstein-records-ufo-reports/articleshow/118258428.cms",
    "timestamp": "2025-02-14T19:31:03Z"
  },
  {
    "title": "China Finally Agrees With Trump",
    "description": "Trump has called for the U.S. to draw down defense spending and work with Russia and China toward joint nuclear disarmament.",
    "link": "https://www.newsweek.com/china-responds-trump-us-russia-nuclear-weapons-reduction-2031125",
    "timestamp": "2025-02-14T19:30:20Z"
  },
  {
    "title": "Volodymyr Zelenskyy tells JD Vance Kyiv wants 'security guarantees'",
    "description": "Shortly before sitting down with Vance at the Munich Security Conference, Zelenskyy said he will only agree to meet in-person with Russian leader Vladimir Putin after a common plan is negotiated with US President Donald Trump. The Ukrainian President believes…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/volodymyr-zelenskyy-tells-jd-vance-kyiv-wants-security-guarantees/articleshow/118258422.cms",
    "timestamp": "2025-02-14T19:30:14Z"
  },
  {
    "title": "Over-regulation partly to blame for ‘wildly expensive’ research costs, says medical executive",
    "description": "Fox News Digital speaks to the President of the Association of American Medical Colleges, Dr. David Skorton, about reforms that can help reduce overhead costs associated with federally funded research grants.",
    "link": "https://www.foxnews.com/politics/assoc-american-med-schools-chief-says-over-regulation-partly-blame-wildly-expensive-research-costs",
    "timestamp": "2025-02-14T19:30:14Z"
  },
  {
    "title": "Second federal judge pauses Trump’s order against gender-affirming care for youth",
    "description": "The order halted federal funding for institutions that provide the care and exclude coverage.",
    "link": "https://www.bostonherald.com/2025/02/14/second-federal-judge-pauses-transgender-health-care-order/",
    "timestamp": "2025-02-14T19:29:47Z"
  },
  {
    "title": "TSMC considering running Intel's US factories after Trump team request, Bloomberg reports",
    "description": "Taiwanese contract manufacturer TSMC is considering taking a controlling stake in chipmaker Intel's factories at the request of U.S. President Donald Trump's officials, Bloomberg News reported on Friday.\nTrump's team raised the idea of a deal between the two …",
    "link": "https://biztoc.com/x/1429217c88676a22",
    "timestamp": "2025-02-14T19:28:25Z"
  },
  {
    "title": "Trump’s White House Escalates Its Petty, Dangerous War on the AP",
    "description": "The Trump administration on Friday booted the Associated Press from the Oval Office and Air Force One, citing the newswire’s choice to continue referring to the recently renamed “Gulf of America” as the “Gulf of Mexico.”\r\n“The Associated Press continues to ig…",
    "link": "https://newrepublic.com/post/191566/donald-trump-ban-ap-gulf-america-mexico",
    "timestamp": "2025-02-14T19:28:17Z"
  },
  {
    "title": "Trump signs order creating Energy Dominance Council",
    "description": "United States President Donald Trump signed an executive order on Friday establishing a national Energy Dominance Council to boost US fossil fuel production.The plan to create the council was first me...",
    "link": "https://biztoc.com/x/a13af82eac9e00c3",
    "timestamp": "2025-02-14T19:27:53Z"
  },
  {
    "title": "Oh Blow It Out Your Nose! Paul Krugman Is Already Trying to Make ‘Trumpflation’ a Thing",
    "description": "Amazing. Just amazing. The consummate Bidenomics simp and former New York Times columnist Paul Krugman is trying to make “Trumpflation” a thing in the public discourse. “Lies, Damned Lies and Trumpflation,” railed Krugman in his latest February 14 certifiable…",
    "link": "https://freerepublic.com/focus/f-bloggers/4297639/posts",
    "timestamp": "2025-02-14T19:27:36Z"
  },
  {
    "title": "India-US to seal first trade deal tranche by fall, aiming for $500 billion target",
    "description": "India and the United States aim to finalize the first phase of a Bilateral Trade Agreement by fall, focusing on increased market access and reducing trade barriers. This agreement, part of 'Mission 500', seeks to double bilateral trade to $500 billion annuall…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-to-seal-first-trade-deal-tranche-by-fall-aiming-for-500-billion-target/articleshow/118258381.cms",
    "timestamp": "2025-02-14T19:27:20Z"
  },
  {
    "title": "WATCH: ‘We want to achieve a durable, lasting peace,’ Vance says at meeting with Ukraine’s Zelensky",
    "description": "Ukrainian President Volodymyr Zelenskyy said Friday during a meeting with U.S. Vice President JD Vance that his country wants “security guarantees” before any talks to end the Ukraine-Russia war.",
    "link": "https://www.pbs.org/newshour/world/watch-we-want-to-achieve-a-durable-lasting-peace-vance-says-at-meeting-with-ukraines-zelensky",
    "timestamp": "2025-02-14T19:26:59Z"
  },
  {
    "title": "A Dogecoin ETF Approval In 2025 Is Becoming Increasingly Likely, Polymarket Traders Speculate",
    "description": "Betting markets indicate increasing confidence that a spot Dogecoin (CRYPTO: DOGE) ETF could receive regulatory approval, with Polymarket data showing a 74 percent chance of approval by the end of 2025.\nThis represents a 37 percent increase since the inaugura…",
    "link": "https://biztoc.com/x/773b9ec5e2d4c6c0",
    "timestamp": "2025-02-14T19:26:53Z"
  },
  {
    "title": "Hawaii, 13 other states sue to stop Musk’s government overhaul effort | Honolulu Star-Advertiser",
    "description": "Attorneys general from Hawaii and 13 other states have sued to halt Elon Musk’s efforts to slash federal spending as head of President Donald Trump’s new government efficiency agency, escalating the legal fight over the billionaire’s influence in the White Ho…",
    "link": "https://www.staradvertiser.com/2025/02/14/breaking-news/hawaii-13-other-states-sue-to-stop-musks-government-overhaul-effort/",
    "timestamp": "2025-02-14T19:26:49Z"
  },
  {
    "title": "U.S. retail sales see biggest drop in nearly two years | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> U.S. retail sales dropped by the most in nearly two years in January, likely weighed down by frigid temperatures, wildfires and motor vehicle shortages, suggesting a sharp slowdown in economic growth early in the first quarter.",
    "link": "https://www.staradvertiser.com/2025/02/14/breaking-news/u-s-retail-sales-see-biggest-drop-in-nearly-two-years/",
    "timestamp": "2025-02-14T19:26:49Z"
  },
  {
    "title": "OMG, Lady Bunny pays tribute to Luigi Mangione with Chappell Roan cover ‘Hot To Blow’",
    "description": "In typical Bunny fashion, she’s using comedy to reach the masses!(?) Find Bunny’s full statement regarding her inspiration for the cover and some true facts...\nThe post OMG, Lady Bunny pays tribute to Luigi Mangione with Chappell Roan cover ‘Hot To Blow’ appe…",
    "link": "https://omg.blog/omg-lady-bunny-pays-tribute-to-luigi-mangione-with-chappell-roan-cover-hot-to-blow/",
    "timestamp": "2025-02-14T19:26:05Z"
  },
  {
    "title": "Trump Creates New Health Commission As RFK Is Sworn in As HHS Chief",
    "description": "Trump Creates New Health Commission As RFK Is Sworn in As HHS Chiefthepatriotjournal.com",
    "link": "https://thepatriotjournal.com/trump-creates-new-health-com/",
    "timestamp": "2025-02-14T19:25:24Z"
  },
  {
    "title": "People left stunned after discovering what Donald Trump has hung up outside Oval Office",
    "description": "US President Donald Trump appears to have an interesting taste when it comes to decor",
    "link": "https://www.ladbible.com/news/politics/donald-trumo-mugshot-oval-office-photo-688414-20250214",
    "timestamp": "2025-02-14T19:25:03Z"
  },
  {
    "title": "Elon Musk’s DOGE Posts Classified Data On Its New Website",
    "description": "“People are scrambling” to see if their sensitive information has been accessed by Musk’s programmers, said one federal intelligence employee.",
    "link": "https://www.huffpost.com/entry/elon-musk-doge-posts-classified-data_n_67ae646de4b0513a8d767112",
    "timestamp": "2025-02-14T19:25:00Z"
  },
  {
    "title": "Trump Aide Gives Update on Associated Press 'Space' to Cover White House",
    "description": "The Trump administration disputes the AP decision to continue using the name \"Gulf of Mexico\" instead of \"Gulf of America.\"",
    "link": "https://www.newsweek.com/trump-aide-gives-update-associated-press-space-cover-white-house-2031528",
    "timestamp": "2025-02-14T19:24:09Z"
  },
  {
    "title": "Second federal judge pauses Trump’s order against gender-affirming care for youth",
    "description": "A federal judge in Seattle has paused President Donald Trump’s executive order halting federal support for gender-affirming care for transgender youth under 19. U.S. District Court Judge Lauren King issued a temporary restraining order on Friday. The decision…",
    "link": "https://www.seattlepi.com/news/article/second-federal-judge-pauses-trump-s-order-20168158.php",
    "timestamp": "2025-02-14T19:24:02Z"
  },
  {
    "title": "“Elon Musk Is a Walking Conflict of Interest”",
    "description": "This story was originally published on the author’s substack, Field Notes with Alexander C Kaufman, to which you can subscribe here. Elon Musk is serving as President Donald Trump’s hatchetman, slashing government spending as part of the administration’s effo…",
    "link": "https://www.motherjones.com/politics/2025/02/elon-musk-doge-federal-contracts-conflict-interest/",
    "timestamp": "2025-02-14T19:23:41Z"
  },
  {
    "title": "China-linked APT Salt Typhoon breached telecoms by exploiting Cisco router flaws",
    "description": "China-linked APT Salt Typhoon has breached more U.S. telecommunications providers via unpatched Cisco IOS XE network devices. China-linked APT group Salt Typhoon is still targeting telecommunications providers worldwide, and according to a new report publishe…",
    "link": "https://securityaffairs.com/174226/apt/salt-typhoon-exploited-cisco-ios-xe-flaws.html",
    "timestamp": "2025-02-14T19:23:25Z"
  },
  {
    "title": "JD Vance attacks Europe over free speech and migration",
    "description": "The vice-president's speech at the Munich Security Conference was denounced by several European leaders.",
    "link": "https://www.bbc.com/news/articles/ceve3wl21x1o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-02-14T19:23:23Z"
  },
  {
    "title": "WATCH: JD Vance's epic speech destroying the tyranny sweeping 'democratic' Europe",
    "description": "During his speech at the Munich Security Conference, Vice President JD Vance scolded European leaders for allowing free speech rights to erode.\n\nThe vice president referred to a suspected terror attack in Munich on Thursday, in which an Afghan citizen alleged…",
    "link": "https://www.theblaze.com/news/vance-europe-free-speech-rights",
    "timestamp": "2025-02-14T19:22:46Z"
  },
  {
    "title": "They Were Promised Flights to the U.S. Now They’re Stuck and in Danger",
    "description": "Afghans planning to move to the U.S. are stuck due to President Trump’s pause on refugee and Special Immigrant Visa travel.",
    "link": "https://time.com/7221555/afghan-refugees-pakistan-stuck-trump-executive-order/",
    "timestamp": "2025-02-14T19:22:43Z"
  },
  {
    "title": "Big Oil is mad the candidate it bought is raising its costs with tariffs",
    "description": "The oil industry is asking for carveouts from tariffs which will raise its cost of doing business – and your cost of energy – after spending tens of millions in bribes on a candidate that promised to raise everyone’s costs.\n\n\n\n more…",
    "link": "http://electrek.co/2025/02/14/big-oil-is-mad-the-candidate-it-bought-is-raising-its-costs-with-tariffs/",
    "timestamp": "2025-02-14T19:21:35Z"
  },
  {
    "title": "Blow It Out Your Nose! Krugman Tries to Make ‘Trumpflation’ a Thing",
    "description": "Amazing. Just amazing. The consummate Bidenomics simp and former New York Times columnist Paul Krugman is trying to make “Trumpflation” a thing in the public discourse.",
    "link": "https://www.newsbusters.org/blogs/business/joseph-vazquez/2025/02/14/oh-blow-it-out-your-nose-paul-krugman-already-trying-make",
    "timestamp": "2025-02-14T19:20:27Z"
  },
  {
    "title": "THE TRUMP DOCTRINE: After Diplomatic Spat, Poll in Colombia Shows US President’s Popularity Vastly Outpacing Local Marxist Leader Petro",
    "description": "In the wake of a diplomatic incident, a new poll reveals President Trump’s popularity in Colombia significantly surpasses that of local leader Gustavo Petro, highlighting shifting political sentiments in the region.\nThe post THE TRUMP DOCTRINE: After Diplomat…",
    "link": "https://www.thegatewaypundit.com/2025/02/trump-doctrine-after-diplomatic-spat-poll-colombia-shows/",
    "timestamp": "2025-02-14T19:20:11Z"
  },
  {
    "title": "EXCLUSIVE: Hannity to Interview President Trump and Elon Musk In Joint Setting",
    "description": "Sean Hannity will conduct a joint interview with President Donald Trump and Elon Musk, leader of the Department of Government Efficiency (DOGE) initiative.\nThe post EXCLUSIVE: Hannity to Interview President Trump and Elon Musk In Joint Setting first appeared …",
    "link": "https://www.mediaite.com/tv/exclusive-hannity-to-interview-president-trump-and-elon-musk-in-joint-setting/",
    "timestamp": "2025-02-14T19:19:54Z"
  },
  {
    "title": "Hundreds of protesters gather in Boston to oppose Trump and Musk",
    "description": "Protesters accused President Donald Trump and billionaire Elon Musk of staging a government coup, condemning Trump supporters for \"attacks on immigrant, trans, and marginalized communities.\"",
    "link": "https://www.wcvb.com/article/boston-protest-opposing-donald-trump-elon-musk/63800051",
    "timestamp": "2025-02-14T19:19:50Z"
  },
  {
    "title": "India’s electronics export hopes dim as Trump eyes tariffs",
    "description": "US President Donald Trump plans to impose reciprocal tariffs on trade partners, which could disadvantage Indian exports of electronic products and auto components. This development comes as India and the US aim to boost bilateral electronics trade significant…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/indias-electronics-export-hopes-dim-as-trump-eyes-tariffs/articleshow/118258276.cms",
    "timestamp": "2025-02-14T19:19:44Z"
  },
  {
    "title": "A compact deal starring Modi and Trump",
    "description": "India and the US have strengthened their strategic partnership in military, technology, and civil nuclear energy. They aim to resolve trade tariffs by fall and agreed on a nuclear reactor deal. Modi endorsed Trump's Ukraine peace plans, while both vowed to fi…",
    "link": "https://economictimes.indiatimes.com/news/india/a-compact-deal-starring-modi-and-trump/articleshow/118258266.cms",
    "timestamp": "2025-02-14T19:18:31Z"
  },
  {
    "title": "“DOGE” Government Website Was Temporarily Alterable by Pretty Much Anyone",
    "description": "Elon Musk has made numerous unverified and false claims that his DOGE project has unearthed “fraud.”…",
    "link": "https://truthout.org/articles/doge-government-website-was-temporarily-alterable-by-pretty-much-anyone/",
    "timestamp": "2025-02-14T19:17:25Z"
  },
  {
    "title": "Do trade deficits matter? How economists think about Trump’s obsession",
    "description": "U.S. President Donald Trump is rapidly upending the global trading order. Since returning to the White House, he has promised to reinstate steel and aluminum levies on Canada and other countries, slapped higher tariffs on China and threatened “reciprocal” tar…",
    "link": "https://biztoc.com/x/32b5a3178c070b36",
    "timestamp": "2025-02-14T19:17:05Z"
  },
  {
    "title": "NATO Combat Aircraft Have Never Been Better",
    "description": "The North Atlantic Treaty Organization (NATO) is a political and military alliance comprising 32 members from across the globe, including the United States. However, the election of Donald Trump has put America’s position with NATO in a precarious spot. Trump…",
    "link": "https://biztoc.com/x/b6d3d986238f5483",
    "timestamp": "2025-02-14T19:16:33Z"
  },
  {
    "title": "Target co-founder’s daughters ‘shocked and dismayed’ over retailer’s decision to ditch DEI",
    "description": "Accusing the firm of \"cowering,\" Anne and Lucy Dayton accused Target of \"undermining the very principles that have made their companies a success.\"",
    "link": "https://nypost.com/2025/02/14/business/target-co-founders-daughters-shocked-and-dismayed-over-dei-decision/",
    "timestamp": "2025-02-14T19:16:22Z"
  },
  {
    "title": "Linda McMahon Wrestles With Tough Question Of Whether Black History Is Even Legal Now",
    "description": "Why not just teach the HAPPY things about America?",
    "link": "https://www.wonkette.com/p/linda-mcmahon-wrestles-with-tough",
    "timestamp": "2025-02-14T19:15:44Z"
  },
  {
    "title": "Markets step back from record levels as Trump waves tariffs stick again",
    "description": "Lacklustre guidance from Ulster Bank parent, NatWest sees it marked down over 2% in the session",
    "link": "https://www.irishtimes.com/business/2025/02/14/markets-step-back-from-record-levels-as-trump-waves-tariffs-stick-again/",
    "timestamp": "2025-02-14T19:15:38Z"
  },
  {
    "title": "Lawyer Rips Trump’s DOJ in Resignation Letter Over Eric Adams Charges",
    "description": "The lead prosecutor assigned to New York City Mayor Eric Adams’s public corruption case resigned Friday, in a mic-drop statement slamming the Department of Justice official who thought he’d be stupid enough to drop the charges at Donald Trump’s behest.\r\nAssis…",
    "link": "https://newrepublic.com/post/191565/donald-trump-doj-eric-adams-attorney-resignation-letter",
    "timestamp": "2025-02-14T19:14:22Z"
  },
  {
    "title": "Watch: Vance Torched The European Elite Face-to-Face and They Absolutely Hated It",
    "description": "Europe is obsessed with external threats but is so morally lost it isn't even clear what it's defending itself for any more, JD Vance warned.\nThe post Watch: Vance Torched The European Elite Face-to-Face and They Absolutely Hated It appeared first on Breitbar…",
    "link": "https://www.breitbart.com/europe/2025/02/14/watch-vance-torched-the-european-elite-face-to-face-and-they-absolutely-hated-it/",
    "timestamp": "2025-02-14T19:12:29Z"
  },
  {
    "title": "Trump Gives Peace a Chance in Ukraine?",
    "description": "As we approach the third anniversary of the Russian invasion of Ukraine, a monumental shift is taking place that might just lead to the end of this calamitous war. This is not a breakthrough on the battlefield, but a stark \r\n\n…\r\n\nThe post Trump Gives Peace a …",
    "link": "https://www.globalresearch.ca/trump-gives-peace-chance-ukraine/5879983",
    "timestamp": "2025-02-14T19:12:25Z"
  },
  {
    "title": "Exclusive: Sen. Joni Ernst Gives the Inside Story on How DOGE Was ‘Ready to Go’ in Cutting $2 Trillion in Waste",
    "description": "Sen. Joni Ernst (R-IA), a leading senator on slashing government waste, gave the inside story on how the Department of Government Efficiency (DOGE) was \"ready to go\" in cutting $2 trillion in government waste during an exclusive appearance on The Alex Marlow …",
    "link": "https://www.breitbart.com/politics/2025/02/14/exclusive-sen-joni-ernst-gives-the-inside-story-on-how-doge-was-ready-to-go-in-cutting-2-trillion-in-waste/",
    "timestamp": "2025-02-14T19:11:07Z"
  },
  {
    "title": "Trump Border Czar Accused of Admitting to 'Quid Pro Quo' With Eric Adams",
    "description": "Border czar Tom Homan, who is helping President Donald Trump's administration carry out its hardline immigration policies, was accused by critics of admitting to \"quid pro quo\" with New York City Mayor Eric Adams during an appearance on Fox News on Friday.\nEa…",
    "link": "https://biztoc.com/x/4802f49bff289ffb",
    "timestamp": "2025-02-14T19:11:07Z"
  },
  {
    "title": "Generals Pour Cold Water on Canada Going to War With US as Videos Go Viral",
    "description": "Videos claiming Canada may be preparing for war with the United States spread across social media, but two retired U.S. military leaders told Newsweek that war between the two countries isn't going to happen.\nWhy It Matters\nPresident Donald Trump has repeated…",
    "link": "https://biztoc.com/x/ec7c61b2a2a6c4cc",
    "timestamp": "2025-02-14T19:10:47Z"
  },
  {
    "title": "DOGE gets mixed reviews from conservatives who have long wanted major budget cuts",
    "description": "Conservatives who have spent decades promoting deep cuts to government are giving mixed reviews to the Department of Government Efficiency, the Elon Musk-led project to slash the federal workforce and reduce or end disfavored programs",
    "link": "https://abcnews.go.com/US/wireStory/doge-gets-mixed-reviews-conservatives-long-wanted-major-118835498",
    "timestamp": "2025-02-14T19:10:31Z"
  },
  {
    "title": "The art of the deal? Zelenskyy says a Ukraine-Russia agreement must come through Trump negotiations",
    "description": "Ukrainian President Volodymyr Zelenskyy is appealing to U.S. President Donald Trump’s history as a dealmaker, offering flattery as he seeks his leadership in negotiations that could end the Russia-Ukraine conflict. The Ukrainian president’s comments came afte…",
    "link": "https://www.seattlepi.com/news/world/article/the-art-of-the-deal-zelenskyy-says-a-20168108.php",
    "timestamp": "2025-02-14T19:10:29Z"
  },
  {
    "title": "TikTok returns to Apple’s App Store after President Trump delays ban",
    "description": "TikTok is back on Apple and Google's U.S. app stores after President Donald Trump delayed enforcing a ban on the app…\nThe post TikTok returns to Apple’s App Store after President Trump delays ban appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/02/14/tiktok-returns-to-apples-app-store-after-president-trump-delays-ban/",
    "timestamp": "2025-02-14T19:10:08Z"
  },
  {
    "title": "Trump Border Czar Accused of Admitting to 'Quid Pro Quo' With Eric Adams",
    "description": "Critics raise concerns about the DOJ dismissing bribery charges against the New York City mayor earlier this week.",
    "link": "https://www.newsweek.com/eric-adams-tom-homan-quid-pro-quo-2031459",
    "timestamp": "2025-02-14T19:09:58Z"
  },
  {
    "title": "‘BRICS is dead’ if it messes with dollar – Trump",
    "description": "The US president has warned of severe tariffs if the geopolitical bloc pursues a common currency Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612750-brics-dead-trump-dollar/",
    "timestamp": "2025-02-14T19:09:30Z"
  },
  {
    "title": "Modi, Trump call on Pak to bring perpetrators of 26/11 attacks to justice",
    "description": "AGENCY WASHINGTON: Prime Minister Narendra Modi and US President Donald Trump have called on Pakistan to “expeditiously” bring to justice the perpetrators of the 26/11 Mumbai attacks even as the latter announced approving extradition to India of Tahawwur Rana…",
    "link": "https://statetimes.in/modi-trump-call-on-pak-to-bring-perpetrators-of-26-11-attacks-to-justice/",
    "timestamp": "2025-02-14T19:09:03Z"
  },
  {
    "title": "Must fight against ‘ecosystem of human trafficking: Modi",
    "description": "AGENCY WASHINGTON: Prime Minister Narendra Modi has asserted the need to fight against the “ecosystem” of human trafficking that lures people from ordinary families with big dreams and promises and brought to other countries as illegal immigrants.This is not …",
    "link": "https://statetimes.in/must-fight-against-ecosystem-of-human-trafficking-modi/",
    "timestamp": "2025-02-14T19:08:47Z"
  },
  {
    "title": "WATCH: Canadian Fans in Montreal Boo the U.S. Anthem at 4 Nations Face-Off",
    "description": "Canadian fans booed the U.S. national anthem as the U.S. prepared to take the ice against Finland at the 4 Nations Face-Off on Thursday night\nThe post WATCH: Canadian Fans in Montreal Boo the U.S. Anthem at 4 Nations Face-Off appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/02/14/watch-canadian-fans-in-montreal-boo-the-u-s-anthem-at-4-nations-face-off/",
    "timestamp": "2025-02-14T19:08:42Z"
  },
  {
    "title": "This is what Air Canada plans to do if Canadian travel to the U.S. sees major slowdown",
    "description": "The continued threat of tariffs — and perhaps annexation — from U.S. President Donald Trump has Canadians rethinking their travel plans",
    "link": "https://nationalpost.com/news/canada/this-is-what-air-canada-plans-to-do-if-canadian-travel-to-the-u-s-sees-major-slowdown",
    "timestamp": "2025-02-14T19:08:30Z"
  },
  {
    "title": "\"Masterclass For World Leaders\": CNN On PM Modi's Negotiations With Trump",
    "description": "As PM Modi concluded his visit to the United States and left for New Delhi, the American media was all praises for the manner in which PM Modi dealt with US President Donald Trump, calling it a &quot;masterclass for other leaders around the world&quot;.",
    "link": "https://www.ndtv.com/world-news/masterclass-for-world-leaders-cnn-on-pm-narendra-modis-negotiations-with-donald-trump-7713099",
    "timestamp": "2025-02-14T19:08:24Z"
  },
  {
    "title": "Generals Pour Cold Water on Canada Going to War With US as Videos Go Viral",
    "description": "Videos alleging the U.S. and Canada could go to war amassed millions of views on TikTok, but retired military leaders disagree.",
    "link": "https://www.newsweek.com/canada-us-war-invade-trade-tariffs-trump-trudeau-2031478",
    "timestamp": "2025-02-14T19:08:22Z"
  },
  {
    "title": "The art of the deal? Zelenskyy says a Ukraine-Russia agreement must come through Trump negotiations",
    "description": "Ukrainian President Volodymyr Zelenskyy appealed to President Donald Trump's history as a dealmaker on Friday, offering flattering words as he sought the U.S. president's leadership in negotiations that could end the Russia-Ukraine conflict.\n“I hope that we c…",
    "link": "https://biztoc.com/x/2097ace286d0b989",
    "timestamp": "2025-02-14T19:08:03Z"
  },
  {
    "title": "India targets raising US energy purchases to $25 billion following PM Modi-Trump meet",
    "description": "India plans to boost its purchase of US energy by two-thirds to $25 billion soon, following discussions between PM Modi and President Trump. Currently, the US is the fifth-largest crude exporter to India. To achieve this increase, US oil and gas must be compe…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-targets-raising-us-energy-purchases-to-25-billion-following-pm-modi-trump-meet/articleshow/118258094.cms",
    "timestamp": "2025-02-14T19:07:42Z"
  },
  {
    "title": "Here's a potential winner from the Trump tariffs: American tourists traveling abroad",
    "description": "As economists ring alarm bells over the impact of President Donald Trump's tariff policy on consumers and the U.S. economy, there's a group of Americans who may benefit: tourists traveling abroad.\nThat's due to the impact of tariffs on the U.S. dollar and oth…",
    "link": "https://biztoc.com/x/c3bea3bb69831b87",
    "timestamp": "2025-02-14T19:07:04Z"
  },
  {
    "title": "The Conservative Reaction to RFK Jr. Being Confirmed to Head Health and Human Services",
    "description": "The Conservative Reaction to RFK Jr. Being Confirmed to Head Health and Human Servicesforamerica.org",
    "link": "https://www.foramerica.org/post/the-conservative-reaction-to-rfk-jr-being-confirmed-to-head-health-and-human-services",
    "timestamp": "2025-02-14T19:07:03Z"
  },
  {
    "title": "Exclusive: Trump Expected to Halt Federal Funding to Schools with COVID Vaccine Mandates (Nick Gilbertson/Breitbart)",
    "description": "Nick Gilbertson / Breitbart:\nExclusive: Trump Expected to Halt Federal Funding to Schools with COVID Vaccine Mandates  —  President Donald Trump is expected to sign an executive order on Friday halting federal funds for schools and universities that require s…",
    "link": "https://www.memeorandum.com/250214/p85",
    "timestamp": "2025-02-14T19:05:00Z"
  },
  {
    "title": "The perfect genius of P.G. Wodehouse’s ‘never-never land’ (died 50 years ago today)",
    "description": "Pelham Grenville (PG – or Plum) Wodehouse breathed his last on Valentine’s Day fifty years ago. As Evelyn Waugh saw it, Wodehouse inhabited a world as timeless as A Midsummer Night’s Dream and Alice in Wonderland. Wodehouse himself said it was as though he wa…",
    "link": "https://freerepublic.com/focus/f-chat/4297637/posts",
    "timestamp": "2025-02-14T19:04:43Z"
  }
]