[
  {
    "title": "Iannucci advised against doing Trump-related project",
    "description": "The Thick Of It creator Armando Iannucci has said he was advised against doing a Donald Trump-related project because of the risk of being \"weighed down by legal issues\".",
    "link": "https://www.rte.ie/entertainment/2025/0930/1536118-iannucci-advised-against-doing-trump-related-project/",
    "timestamp": "2025-09-30T15:50:25Z"
  },
  {
    "title": "Trump declares ‘reawakening’ of ‘warrior spirit,’ unwavering support for military: ‘I have your backs’",
    "description": "President Donald Trump told senior military leaders that he supports them during a speech at Marine Corps Base Quantico in Virginia on Tuesday.",
    "link": "https://www.foxnews.com/politics/trump-declares-reawakening-warrior-spirit-unwavering-support-military-i-have-your-backs",
    "timestamp": "2025-09-30T15:50:18Z"
  },
  {
    "title": "Trump peace plan 'ignores interests of Palestinian people', Hamas official tells BBC",
    "description": "A senior Hamas figure told the BBC the group is likely to reject Trump's Gaza peace plan, saying it \"serves Israel's interests\".",
    "link": "https://www.bbc.com/news/articles/cx2j97jldkmo",
    "timestamp": "2025-09-30T15:50:00Z"
  },
  {
    "title": "Trump again floats Canada joining the U.S. as the 51st state",
    "description": "U.S. President Donald Trump said Tuesday he again told some unnamed Canadian official that the country should consider joining the U.S. as the 51st state — returning to the annexationist rhetoric he used earlier in the year and subsequently dropped after Prim…",
    "link": "https://www.cbc.ca/news/politics/trump-51st-state-again-1.7647268",
    "timestamp": "2025-09-30T15:49:52Z"
  },
  {
    "title": "DC Police Union’s Gregg Pemberton Expresses ‘Frustration’ As Dick Durbin Solely Focuses On J6 Officer Assaults",
    "description": "Gregg Pemberton expressed irritation as Dick Durbin focused exclusively on police officer assaults that occurred during the Jan. 6, 2021 Capitol riot.",
    "link": "https://dailycaller.com/2025/09/30/dc-police-unions-gregg-pemberton-expresses-frustration-dick-durbin-solely-focuses-j6-officer-assaults/",
    "timestamp": "2025-09-30T15:48:59Z"
  },
  {
    "title": "US consumer confidence declines again as Americans fret over prices, job market",
    "description": "U.S. consumer confidence declined again in September as Americans’ pessimism over inflation and the weakening job market grew again. The Conference Board said Tuesday that its consumer confidence index fell by 3.6 points to 94.2 in September, down from August…",
    "link": "https://apnews.com/article/consumer-confidence-conference-board-economy-jobs-591ce213dd6da917fd3ec0e1b2b053bf",
    "timestamp": "2025-09-30T15:48:25Z"
  },
  {
    "title": "Trump sets deadline for Hamas to respond to his Gaza peace plan",
    "description": "US President Donald Trump says Hamas has three or four days to respond to his proposed plan to end the war in Gaza.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/9/30/trump-sets-deadline-for-hamas-to-respond-to-his-gaza-peace-plan",
    "timestamp": "2025-09-30T15:47:56Z"
  },
  {
    "title": "Groups press for release of special counsel Jack Smith’s report on Trump’s classified documents case",
    "description": "Smith’s final report has remained under wraps because of an order from Judge Aileen Cannon.",
    "link": "https://www.bostonherald.com/2025/09/30/trump-classified-documents/",
    "timestamp": "2025-09-30T15:47:18Z"
  },
  {
    "title": "Hegseth and Trump declare end to 'woke' military - as defence secretary scolds 'fat troops'",
    "description": "The US defence secretary has said he is ending \"woke\" culture and political correctness, telling top brass: \"We are done with that s***.\"",
    "link": "https://news.sky.com/story/hegseth-and-trump-declare-end-to-woke-military-as-defence-secretary-scolds-fat-troops-13441681",
    "timestamp": "2025-09-30T15:47:00Z"
  },
  {
    "title": "Trump Gives Deranged Rant About How Current Battleships Suck",
    "description": "President Donald Trump ranted Tuesday that U.S. warships don’t look tough enough anymore. Speaking in front of a meeting of hundreds of U.S. military officials whom War Secretary Pete Hegseth had summoned to Washington, Trump said that his administration was …",
    "link": "https://newrepublic.com/post/201105/donald-trump-rant-battleships-suck-military-leaders",
    "timestamp": "2025-09-30T15:46:26Z"
  },
  {
    "title": "Stocks Steady as Shutdown Looms; CoreWeave Soars on Deal With Meta",
    "description": "US stocks wavered on Tuesday, wrapping up their best September in 15 years on a cautious note ahead of a potential government shutdown.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-steady-as-shutdown-looms-coreweave-soars-on-deal-with-meta",
    "timestamp": "2025-09-30T15:45:28Z"
  },
  {
    "title": "The President and His Television",
    "description": "If the big screen was lying to him, then everything would fall apart.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/09/trump-and-his-television/684406/",
    "timestamp": "2025-09-30T15:45:00Z"
  },
  {
    "title": "Why the White House is resisting making a deal to avert a shutdown",
    "description": "President Donald Trump can't seem to bring himself to make a deal with congressional Democrats to avert a government shutdown.",
    "link": "https://biztoc.com/x/838028d22a561a3f",
    "timestamp": "2025-09-30T15:43:57Z"
  },
  {
    "title": "Are Democrats Finally Getting Sick and Tired of Hillary Clinton, Too?",
    "description": "At 77 years of age and no prospects for future political office, or even an ego-flattering ambassadorship, Hillary Clinton is consigned to doing the one thing she’s done consistently since she first entered public life – spouting off. This time she was on MSN…",
    "link": "https://freerepublic.com/focus/f-news/4343490/posts",
    "timestamp": "2025-09-30T15:43:05Z"
  },
  {
    "title": "WATCH — Border Patrol Agents Chase Chicago Cyclist Who Taunted Them: 'I'm Not a U.S. Citizen!'",
    "description": "A cyclist in Chicago's Loop got what he asked for when taunting several U.S. Border Patrol agents on Sunday.\nThe post WATCH — Border Patrol Agents Chase Chicago Cyclist Who Taunted Them: ‘I’m Not a U.S. Citizen!’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/09/30/watch-border-patrol-agents-chase-chicago-cyclist-who-taunted-them-im-not-a-u-s-citizen/",
    "timestamp": "2025-09-30T15:42:51Z"
  },
  {
    "title": "‘We Became the Woke Department’: Hegseth Lays Out Heightened Standards of War Department",
    "description": "Secretary of War Pete Hegseth slammed “foolish and reckless political leaders” who turned the War Department into the “Woke Department.” “For too long, we promoted... Read More\nThe post ‘We Became the Woke Department’: Hegseth Lays Out Heightened Standards of…",
    "link": "https://www.dailysignal.com/2025/09/30/we-became-the-woke-department-hegseth-lays-out-heightened-standards-of-war-department/",
    "timestamp": "2025-09-30T15:42:26Z"
  },
  {
    "title": "Liberals are catalysts to catastrophe, again",
    "description": "In their self-serving pursuit of maintaining the status quo, liberals continue to appease the right.",
    "link": "https://www.aljazeera.com/opinions/2025/9/30/liberals-are-catalysts-to-catastrophe-again",
    "timestamp": "2025-09-30T15:40:25Z"
  },
  {
    "title": "Return of the Battleship!",
    "description": "I gotta say, this guy is starting to make sense. All complete nonsense of course. But if you do want a 21st century battleship… President Donald Trump seems to like big, “bold” ideas. Throw nukes around? Sure. Rip up the deck of an aircraft carrier to install…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/return-of-the-battleship",
    "timestamp": "2025-09-30T15:39:46Z"
  },
  {
    "title": "Trump Gaza Plan Wins Support of Arab, Muslim World — and Palestinian Authority",
    "description": "President Donald Trump’s proposal to end the Gaza war has not only won support from Israel, but also from the Arab and Muslim world — and from the Palestinian Authority, which has opposed his plans in the past. The 20-point plan, as Breitbart News has noted, …",
    "link": "https://freerepublic.com/focus/f-news/4343488/posts",
    "timestamp": "2025-09-30T15:37:45Z"
  },
  {
    "title": "YouTube to pay millions to settle Trump lawsuit",
    "description": "Meta and X agreed to similar payments with the president’s lawyers earlier this year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625651-trump-youtube-us-capitol/",
    "timestamp": "2025-09-30T15:37:24Z"
  },
  {
    "title": "Indian filmmakers say too early to assess impact of Donald Trump's 100% tariff proposal",
    "description": "Indian film producers and distributors are taking a wait-and-watch approach after US President Donald Trump announced a possible 100% tariff on foreign-made films. While the impact on Hindi films may be limited—since the US contributes 6–7% of their revenue—S…",
    "link": "https://economictimes.indiatimes.com/industry/media/entertainment/indian-filmmakers-say-too-early-to-assess-impact-of-donald-trumps-100-tariff-proposal/articleshow/124238673.cms",
    "timestamp": "2025-09-30T15:36:16Z"
  },
  {
    "title": "PM Narendra Modi welcomes Donald Trump's plan to end Gaza conflict",
    "description": "Prime Minister Narendra Modi welcomed US President Donald Trump's comprehensive 20-point plan to end the Gaza conflict, calling it a viable pathway to long-term peace. The plan, unveiled after Trump met Israeli PM Netanyahu, proposes an immediate end to the w…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-narendra-modi-welcomes-donald-trumps-plan-to-end-gaza-conflict/articleshow/124238660.cms",
    "timestamp": "2025-09-30T15:34:31Z"
  },
  {
    "title": "Trump threatens mass firings as federal shutdown deadline nears",
    "description": "President Donald Trump threatened to fire scores of federal workers as the United States hurtles toward a shutdown. Read here for more",
    "link": "https://financialpost.com/news/economy/trump-threatens-mass-firings-shutdown-deadline-nears",
    "timestamp": "2025-09-30T15:33:57Z"
  },
  {
    "title": "Super Bowl Boycott Backlash Grows After NFL Taps Anti-Trump Pop Star Bad Bunny for Halftime Show",
    "description": "The NFL is facing growing boycott calls after announcing its decision to tap anti-Trump pop megastar Bad Bunny as the headliner for next year's Super Bowl halftime show.\nThe post Super Bowl Boycott Backlash Grows After NFL Taps Anti-Trump Pop Star Bad Bunny f…",
    "link": "https://www.breitbart.com/entertainment/2025/09/30/super-bowl-boycott-backlash-grows-after-nfl-taps-anti-trump-pop-star-bad-bunny-for-halftime-show/",
    "timestamp": "2025-09-30T15:33:37Z"
  },
  {
    "title": "Exclusive | White House to Announce ‘TrumpRx’ Drug-Buying Website, and Deal With Pfizer - The Wall Street Journal",
    "description": "Exclusive | White House to Announce ‘TrumpRx’ Drug-Buying Website, and Deal With PfizerThe Wall Street Journal Pfizer agrees to deal on lowering drug prices amid Trump pressureCNN Donald Trump to announce direct-to-consumer US drug sales programmeFinancial Ti…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179603288",
    "timestamp": "2025-09-30T15:33:30Z"
  },
  {
    "title": "Trump’s 20-point plan for Gaza is deeply flawed but it may be the best offer Hamas can expect",
    "description": "The plan does contain some positives for Hamas. And they are unlikely to get a better offer.",
    "link": "https://theconversation.com/trumps-20-point-plan-for-gaza-is-deeply-flawed-but-it-may-be-the-best-offer-hamas-can-expect-266373",
    "timestamp": "2025-09-30T15:33:25Z"
  },
  {
    "title": "YouTube is settling with Donald Trump for $24.5 million over his account suspension",
    "description": "Google’s YouTube has agreed to pay $24.5 million to settle a lawsuit President Donald Trump brought after the video site suspended his account following the Jan. 6, 2021 attacks on the Capitol following the election that resulted in him leaving the White Hous…",
    "link": "https://biztoc.com/x/50db637d8e85c435",
    "timestamp": "2025-09-30T15:32:58Z"
  },
  {
    "title": "Fact check: Trump falsely claims Democrats want to give free health care to ‘illegal aliens’ in government shutdown battle",
    "description": "Amid government spending negotiations, President Donald Trump and other GOP leaders are accusing Democrats of demanding free health care for “illegal aliens” in return for their support of a federal funding bill.",
    "link": "https://www.cnn.com/2025/09/30/politics/fact-check-trump-free-health-care-immigration",
    "timestamp": "2025-09-30T15:31:43Z"
  },
  {
    "title": "Female fighter pilot buries Trump speech as 'bonkers': 'Everybody in that room knows it'",
    "description": "Former Marine fighter pilot Amy McGrath blasted the speeches from Secretary of Defense Pete Hegseth and President Donald Trump on Tuesday to a room full of the top U.S. military leaders. Among the things McGrath schooled Hegseth on was his claim that there we…",
    "link": "https://www.rawstory.com/trump-speech-military/",
    "timestamp": "2025-09-30T15:31:20Z"
  },
  {
    "title": "Trump and Hegseth declare an end to 'politically correct' leadership in the US military (Associated Press)",
    "description": "Associated Press:\nTrump and Hegseth declare an end to ‘politically correct’ leadership in the US military  —  President Donald Trump revealed that he wants to use American cities as training grounds for the armed forces and joined Defense Secretary Pete Hegse…",
    "link": "https://www.memeorandum.com/250930/p59",
    "timestamp": "2025-09-30T15:30:04Z"
  },
  {
    "title": "Russian Crude Shipments Hit 16-Month High Despite U.S. Sanctions",
    "description": "The U.S. Administration’s pressure on the remaining buyers of Russian crude is not yielding the results desired by President Donald Trump. In fact, in the four weeks to September 28, Russia’s crude oil exports by sea hit their highest level since May 2024, ta…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Russian-Crude-Shipments-Hit-16-Month-High-Despite-US-Sanctions.html",
    "timestamp": "2025-09-30T15:30:00Z"
  },
  {
    "title": "US government nears shutdown amid no deal in Washington",
    "description": "Washington braced for a fast-approaching government shutdown, as Republicans and Democrats appeared unlikely to reach an agreement that would extend funding past a midnight deadline.",
    "link": "https://www.rte.ie/news/world/2025/0930/1536125-us-government-shutdown/",
    "timestamp": "2025-09-30T15:29:13Z"
  },
  {
    "title": "Leaked texts on Scott Bessent’s phone suggest the White House got played bailing out Argentina—and U.S. soybean farmers are the casualties",
    "description": "“This is highly unfortunate,” the text said. “Soy prices are dropping further because of it. This gives China more leverage on us.”",
    "link": "https://fortune.com/2025/09/30/what-happened-soybean-farmers-argentina-china-scott-bessent-phone-texts/",
    "timestamp": "2025-09-30T15:28:24Z"
  },
  {
    "title": "US outlines ‘only’ mission of War Department",
    "description": "The Department of War only exists to fight wars and achieve peace through strength, Secretary Pete Hegseth told a gathering of top brass Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625657-us-war-department-mission/",
    "timestamp": "2025-09-30T15:28:02Z"
  },
  {
    "title": "A weakened and isolated Hamas faces pressure to accept Trump’s peace plan for Gaza",
    "description": "With Donald Trump rallying international support, Hamas could have a tough time refusing the ceasefire offer.",
    "link": "https://www.bostonherald.com/2025/09/30/trump-peace-plan-hamas-pressure/",
    "timestamp": "2025-09-30T15:26:50Z"
  },
  {
    "title": "5 major items targeted by Trump's new tariffs starting October 1",
    "description": "The Trump administration is set to implement a new wave of tariffs targeting five key foreign imports, effective October 1, 2025.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/5-major-items-targeted-by-Trump-s-new-tariffs-starting-October-1-2003001",
    "timestamp": "2025-09-30T15:23:02Z"
  },
  {
    "title": "Hegseth Uses Extraordinary Meeting to Fat-Shame Generals",
    "description": "More than 800 members of the US military’s top brass, including hundreds of generals and admirals, gathered for an extraordinary meeting in Quantico, Virginia, on Tuesday, where they were greeted by Defense Secretary Pete Hegseth’s order to return to “the hig…",
    "link": "https://www.motherjones.com/politics/2025/09/hegseth-military-generals-trump-speech-highest-male-standard/",
    "timestamp": "2025-09-30T15:22:26Z"
  },
  {
    "title": "Trump And Lutnick Demand: Half Of America's Chips Must Be Made At Home—Or Else",
    "description": "President Donald Trump and Commerce Secretary Howard Lutnick have placed a bold demand on the global semiconductor industry: half of all chips used in America must be manufactured in America. \nAdditionally, Taiwan, through Taiwan Semiconductor Manufacturing C…",
    "link": "https://biztoc.com/x/2ae9c85e95e4dbc0",
    "timestamp": "2025-09-30T15:21:44Z"
  },
  {
    "title": "Democrats’ Relentless Demonizing Paves Way For The Next Political Assassination",
    "description": "In their perverse pursuit of power, leftist politicians are daily signing the death warrant for the next political assassination. It’s now a matter of when, not if. You can’t relentlessly call your political enemies “Nazis”, “fascists,” and “tyrants” without …",
    "link": "https://freerepublic.com/focus/f-chat/4343484/posts",
    "timestamp": "2025-09-30T15:21:17Z"
  },
  {
    "title": "NJ mayor breaks with Dems to back Ciattarelli for governor, demands end to sanctuary policies",
    "description": "Democratic New Jersey Mayor James P. Dodd backs Trump-endorsed Republican Jack Ciattarelli for governor, citing taxes and sanctuary city policies.",
    "link": "https://www.foxnews.com/media/nj-mayor-breaks-dems-back-ciattarelli-governor-demands-end-sanctuary-policies",
    "timestamp": "2025-09-30T15:21:16Z"
  },
  {
    "title": "White House to unveil ‘TrumpRX’ drug-buying website, announce Pfizer lowering prices in US",
    "description": "President Trump will announce the launch of a new website Tuesday providing Americans with the opportunity to buy drugs directly from the government.",
    "link": "https://nypost.com/2025/09/30/us-news/white-house-to-unveil-trumprx-drug-buying-website-announce-pfizer-lowering-prices-in-us/",
    "timestamp": "2025-09-30T15:20:14Z"
  },
  {
    "title": "Trump tells Hegseth to use inner cities as military 'training grounds' for war",
    "description": "President Donald Trump revealed that he had told Defense Secretary Pete Hegseth to use inner cities as \"training grounds\" for war.In an unprecedented speech to top military brass on Tuesday, Trump said that American inner cities were \"a big part of war now.\"\"…",
    "link": "https://www.rawstory.com/trump-hegseth-training-grounds/",
    "timestamp": "2025-09-30T15:20:05Z"
  },
  {
    "title": "Trump to announce deal with Pfizer to lower drug prices (Berkeley Lovelace Jr/NBC News)",
    "description": "Berkeley Lovelace Jr / NBC News:\nTrump to announce deal with Pfizer to lower drug prices  —  The deal is part of Trump's broader effort to tie the amount the government pays for certain drugs to the prices paid overseas.  —  President Donald Trump will announ…",
    "link": "https://www.memeorandum.com/250930/p57",
    "timestamp": "2025-09-30T15:20:01Z"
  },
  {
    "title": "'Woke Pieces Of Sh*t': Trump Posts AI Slop Mocking Schumer, Jeffries",
    "description": "Democrats are attempting to restore health care funding cuts that were included in the passage of Trump's Big, Hideous Bill. Meanwhile, a government shutdown appears likely because we lack a serious leader. After meeting with Democratic leaders, Donald J. Tru…",
    "link": "https://crooksandliars.com/2025/09/woke-pieces-sht-trump-posts-ai-slop",
    "timestamp": "2025-09-30T15:19:30Z"
  },
  {
    "title": "Tony Blair's return to Middle East diplomacy reopens old wounds and new doubts",
    "description": "CAIRO/LONDON (Reuters) -When Tony Blair was first tasked with forging a lasting peace between Israel and the Palestinians in 2007, the White House cautioned ...",
    "link": "https://www.yahoo.com/news/articles/tony-blairs-return-middle-east-151927355.html",
    "timestamp": "2025-09-30T15:19:27Z"
  },
  {
    "title": "Fox News Panel Roasts Trump Over ‘Tacky’ Oval Office Makeover: ‘I Can’t Get Health Insurance’ So ‘I’m Not Really Thrilled’",
    "description": "President Donald Trump received a roasting from some Fox News panelists after showing off his gold makeover in the Oval Office.\nThe post Fox News Panel Roasts Trump Over ‘Tacky’ Oval Office Makeover: ‘I Can’t Get Health Insurance’ So ‘I’m Not Really Thrilled’…",
    "link": "https://www.mediaite.com/media/tv/fox-news-panel-roasts-trump-over-tacky-oval-office-gold-makeover-i-cant-get-health-insurance-so-im-not-really-thrilled/",
    "timestamp": "2025-09-30T15:18:02Z"
  },
  {
    "title": "Strictly’s La Voix reveals what viewers were ‘meant to see’ after live show malfunction",
    "description": "La Voix has shown Strictly Come Dancing viewers what they were meant to see during Saturday (27 September) night’s show had it not been for a technical malfunction. The RuPaul’s Drag Race UK star is appearing in the latest season of then long-running BBC comp…",
    "link": "https://www.thepinknews.com/2025/09/30/la-voix-strictly-meant-to-see/",
    "timestamp": "2025-09-30T15:16:58Z"
  },
  {
    "title": "Pete Hegseth says US no longer wants fat Generals, Admirals, or troops — orders them to prepare for war",
    "description": "Defense Secretary Pete Hegseth addressed top U.S. military commanders, urging them to \"prepare for war\" and highlighting that the Department of War’s primary objective is warfighting. He criticized overweight generals and troops, enforcing rigorous height, we…",
    "link": "https://economictimes.indiatimes.com/news/international/us/pete-hegseth-says-us-no-longer-wants-fat-generals-admirals-or-troops-orders-them-to-prepare-for-war/articleshow/124237894.cms",
    "timestamp": "2025-09-30T15:16:18Z"
  },
  {
    "title": "Trump Gives Hamas Ultimatum On Gaza Deal",
    "description": "US President Donald Trump on Tuesday gave Hamas an ultimatum of \"three or four days\" to respond to his plan to end the war in Gaza, as the militant group reviewed the proposal backed by Israel.",
    "link": "https://www.ibtimes.com/trump-gives-hamas-ultimatum-gaza-deal-3784840",
    "timestamp": "2025-09-30T15:15:15Z"
  },
  {
    "title": "Trump Gives Hamas Ultimatum On Gaza Deal",
    "description": "US President Donald Trump on Tuesday gave Hamas an ultimatum of \"three or four days\" to respond to his plan to end the war in Gaza, as the militant group reviewed the proposal backed by Israel.",
    "link": "https://www.ibtimes.com.au/trump-gives-hamas-ultimatum-gaza-deal-1860658",
    "timestamp": "2025-09-30T15:15:10Z"
  },
  {
    "title": "Trump to announce drug-pricing deal with Pfizer, new 'TrumpRx' website (Dan Diamond/Washington Post)",
    "description": "Dan Diamond / Washington Post:\nTrump to announce drug-pricing deal with Pfizer, new ‘TrumpRx’ website  —  The White House has been pursuing efforts to lower U.S. drug costs by linking them to the cheaper prices paid abroad.  —  just now  —  President Donald T…",
    "link": "https://www.memeorandum.com/250930/p55",
    "timestamp": "2025-09-30T15:15:01Z"
  },
  {
    "title": "Hakeem Jeffries slams 'racist and fake' video posted by Trump (Nicholas Wu/Politico)",
    "description": "Nicholas Wu / Politico:\nHakeem Jeffries slams ‘racist and fake’ video posted by Trump  —  House Minority Leader Hakeem Jeffries slammed the AI-generated deepfake video posted online by President Donald Trump Monday night as “racist and fake.”  “Mr. President,…",
    "link": "https://www.memeorandum.com/250930/p50",
    "timestamp": "2025-09-30T15:15:01Z"
  },
  {
    "title": "Government barrels toward shutdown as the blame game heats up (NBC News)",
    "description": "NBC News:\nGovernment barrels toward shutdown as the blame game heats up  —  Congress has until 11:59 p.m. ET to act to avoid a government shutdown.  The two parties are nowhere near an agreement.  —  WASHINGTON — The federal government is barreling toward a s…",
    "link": "https://www.memeorandum.com/250930/p49",
    "timestamp": "2025-09-30T15:15:01Z"
  },
  {
    "title": "Why the White House is resisting making a deal to avert a shutdown",
    "description": "President Donald Trump can't seem to bring himself to make a deal with congressional Democrats to avert a government shutdown.",
    "link": "https://www.msnbc.com/news/news-analysis/trump-government-shutdown-resist-deal-project-47-rcna234465",
    "timestamp": "2025-09-30T15:12:26Z"
  },
  {
    "title": "Trump gives Hamas ultimatum on Gaza deal",
    "description": "US President Donald Trump on Tuesday gave Hamas an ultimatum of “three or four days” to respond to his plan to end the war in Gaza, as the militant group reviewed the proposal backed by Israel. The plan calls for a ceasefire, the release of hostages by Hamas …",
    "link": "https://www.digitaljournal.com/world/trump-gives-hamas-ultimatum-on-gaza-deal/article",
    "timestamp": "2025-09-30T15:12:20Z"
  },
  {
    "title": "Trump to announce ‘TrumpRx’ site for discounted drugs and deal with Pfizer | CNN Politics",
    "description": "President Donald Trump is expected to announce on Tuesday a multipronged effort aimed at lowering drug costs in the United States, including the creation of a “TrumpRx” direct-to-consumer website where Americans can buy medicine at discounted prices and a dea…",
    "link": "https://www.cnn.com/2025/09/30/politics/pfizer-drug-prices-trump",
    "timestamp": "2025-09-30T15:11:24Z"
  },
  {
    "title": "Barron Trump Shut Down Entire Floor of Trump Tower for a Romantic Date... as Donald and Melania's Son Has 'A Lot of Girls Running After Him'",
    "description": "Donald and Melania's only son was forced to have a date night at home due to security concerns.",
    "link": "https://radaronline.com/p/barron-trump-dating-shut-down-trump-tower-girlfriend/",
    "timestamp": "2025-09-30T15:11:02Z"
  },
  {
    "title": "Trump's Failing Mental Health On Display In Front Of Military",
    "description": "At Defense Secretary Pete Hegseth’s military gathering in a room full of top generals, Donald J. Trump put on an embarrassing spectacle, displaying his failing mental health in front of the world. Trump told a 'sir story,' whined about not getting the Nobel P…",
    "link": "https://crooksandliars.com/2025/09/trumps-failing-mental-health-display-front",
    "timestamp": "2025-09-30T15:11:00Z"
  },
  {
    "title": "President Donald Trump, Pfizer to announce deal to lower drug costs",
    "description": "President Donald Trump and Pfizer are expected to announce a deal to lower drug prices.",
    "link": "https://www.ksat.com/news/national/2025/09/30/president-donald-trump-pfizer-to-announce-deal-to-lower-drug-costs/",
    "timestamp": "2025-09-30T15:10:34Z"
  },
  {
    "title": "Republican state Sen. Greg Dolezal enters Georgia's lieutenant governor race",
    "description": "Georgia state Sen. Greg Dolezal has entered the race for lieutenant governor with a campaign focused on hard-line MAGA principles",
    "link": "https://abcnews.go.com/Politics/wireStory/republican-state-sen-greg-dolezal-enters-georgias-lieutenant-126082008",
    "timestamp": "2025-09-30T15:10:30Z"
  },
  {
    "title": "What's Going On With Tilray Brands Stock Tuesday?",
    "description": "Shares of Tilray Brands Inc (NASDAQ:TLRY) are trading lower Tuesday morning, giving back a portion of the previous session’s explosive gains. The stock is experiencing a correction after surging over 35% on Monday, a rally ignited by a weekend social media po…",
    "link": "https://biztoc.com/x/9aa1bc584f3ebfca",
    "timestamp": "2025-09-30T15:10:28Z"
  },
  {
    "title": "U.S. consumer confidence declines again as Americans worry about inflation, job market",
    "description": "The drop is bigger than analysts were expecting and the lowest reading since April, when President Donald Trump rolled out his sweeping tariff policy.",
    "link": "https://biztoc.com/x/537501a66d713836",
    "timestamp": "2025-09-30T15:10:17Z"
  },
  {
    "title": "Toni Atkins drops out of California governor's race, cites 'no viable path forward'",
    "description": "Toni Atkins will not become the first woman or first out LGBTQ+ governor of California governor in 2026 after announcing on Monday that she is dropping out of the race.",
    "link": "https://www.advocate.com/politics/toni-atkins-drops-out-governor",
    "timestamp": "2025-09-30T15:10:14Z"
  },
  {
    "title": "US War Secretary Pete Hegseth slams 'fat generals,' says US officers should resign if they don't support agenda",
    "description": "US Defence Secretary Pete Hegseth slammed \"fat generals\" and diversity initiatives that he said led to decades of decay in the military and told a rare gathering of commanders on Tuesday they should resign if they don't support his agenda.",
    "link": "https://www.independent.ie/world-news/us-war-secretary-pete-hegseth-slams-fat-generals-says-us-officers-should-resign-if-they-dont-support-agenda/a1513579787.html",
    "timestamp": "2025-09-30T15:10:06Z"
  },
  {
    "title": "The Democrat Senators to Watch in the Shutdown Fight",
    "description": "Before midnight, Senate Democrats must make a decision—allow the Republican-backed short-term spending bill to come to the floor or let the federal government run out... Read More\nThe post The Democrat Senators to Watch in the Shutdown Fight appeared first on…",
    "link": "https://www.dailysignal.com/2025/09/30/democrat-senators-watch-in-shutdown-fight/",
    "timestamp": "2025-09-30T15:10:00Z"
  },
  {
    "title": "Fox Business Highlights Skyrocketing Beef Prices",
    "description": "On FOX Business, pro-Trump host Stuart Varney did a lengthy segment on the rising costs of beef in the country. \nReporter Kelly Saberi discussed the rising costs with a nice graphic and then interviewed a farmer, who did blame some of their problems on Trump'…",
    "link": "https://crooksandliars.com/2025/09/fox-business-highlights-skyrocketing-beef",
    "timestamp": "2025-09-30T15:09:51Z"
  },
  {
    "title": "Mormon Church Gunman Appears To Have Been A Trump Supporting Ex- Marine",
    "description": "Immediately after the shooting at the Grand Blanc Mormon Church, Donald Trump intimated it was the radical left attacking Christianity, but as we are finding out, that's not the case. \nThomas Jacob Sanford, 40, an ex-marine from suburban Michigan is identifie…",
    "link": "https://crooksandliars.com/2025/09/mormon-church-gunman-was-trump-supporting",
    "timestamp": "2025-09-30T15:09:50Z"
  },
  {
    "title": "Prices for home remodeling outpaced inflation in the second quarter due to labor costs",
    "description": "The cost of home repair and remodeling is rising faster than inflation, according to a new report.",
    "link": "https://www.bostonherald.com/2025/09/30/home-improvement-costs-rising-labor/",
    "timestamp": "2025-09-30T15:06:58Z"
  },
  {
    "title": "Hamas knows it must tread carefully in response to Trump’s Gaza peace proposal",
    "description": "US-sponsored plan includes ceasefire, prisoner exchange and Hamas disarmament",
    "link": "https://www.irishtimes.com/world/middle-east/2025/09/30/hamas-knows-it-must-tread-carefully-in-response-to-trumps-gaza-peace-proposal/",
    "timestamp": "2025-09-30T15:06:19Z"
  },
  {
    "title": "The Rev Kev: Naked Capitalism – Bringing You Next Year’s News Today",
    "description": "No kidding, we do have stories from next year for your delectation.",
    "link": "https://www.nakedcapitalism.com/?p=298240",
    "timestamp": "2025-09-30T15:06:18Z"
  },
  {
    "title": "DNC chair calls for DC, Puerto Rico statehood, filibuster elimination, says Trump admin a 'fascist regime'",
    "description": "DNC Chair Ken Martin said Democrats needed to stop playing by antiquated rules on Tuesday as he called the Trump administration a \"fascist regime\" during a podcast.",
    "link": "https://www.foxnews.com/media/dnc-chair-calls-dc-puerto-rico-statehood-filibuster-elimination-says-trump-admin-fascist-regime",
    "timestamp": "2025-09-30T15:04:45Z"
  },
  {
    "title": "Florida officials gift prime Miami real estate for Trump's presidential library",
    "description": "Florida officials have agreed to set aside nearly three acres of prime real estate in downtown Miami for the future presidential library of President Donald Trump",
    "link": "https://www.wftv.com/news/national/florida-officials/L5PEITXMTFDEVOURJT6QLVCHLQ/",
    "timestamp": "2025-09-30T15:03:39Z"
  },
  {
    "title": "Trump Wanders Through Comical Riff on Walking Down Stairs During Scattershot Speech",
    "description": "President Donald Trump veered off into an extended riff about walking down stairs during a scattershot speech to military brass in Quantico, Virginia.\nThe post Trump Wanders Through Comical Riff on Walking Down Stairs During Scattershot Speech first appeared …",
    "link": "https://www.mediaite.com/media/news/trump-wanders-through-comical-riff-on-walking-down-stairs-during-scattershot-speech/",
    "timestamp": "2025-09-30T15:02:44Z"
  },
  {
    "title": "What happens if the US government shuts down?",
    "description": "Failure to break funding deadlock could delay release of key economic data",
    "link": "https://www.irishtimes.com/world/us/2025/09/30/what-happens-if-the-us-government-shuts-down/",
    "timestamp": "2025-09-30T15:02:20Z"
  },
  {
    "title": "FOX NEWS BOOKS TO DEBUT “THE MIRACLES AMONG US” BY FOX NEWS SENIOR MEDICAL ANALYST DR. MARC SIEGEL",
    "description": "NEW YORK – September 30, 2025 – FOX News Books will release its 17th title “The Miracles Among Us: How God’s Grace Plays a Role in Healing,” by FOX News senior medical analyst and practicing physician Dr. Marc Siegel on November 18th. Drawing on decades of me…",
    "link": "https://press.foxnews.com/2025/09/fox-news-books-to-debut-the-miracles-among-us-by-fox-news-senior-medical-analyst-dr-marc-siegel",
    "timestamp": "2025-09-30T15:01:53Z"
  },
  {
    "title": "U.S. Department of Energy Creates List of “Words To Avoid”",
    "description": "The United States Department of Energy has created a list of \"words to avoid,\" advancing the censorship narrative. The words \"climate change\" and \"green\" are listed as banned, as ruler Donald Trump declared the concept “the greatest con job” during his recent…",
    "link": "https://www.shtfplan.com/headline-news/u-s-department-of-energy-creates-list-of-words-to-avoid",
    "timestamp": "2025-09-30T15:00:54Z"
  },
  {
    "title": "Trump admin finds Minnesota violated Title IX by letting males in girls' sports, citing trans softball pitcher",
    "description": "Federal agencies cited a transgender softball pitcher's dominance in girls' championship as evidence Minnesota violated Title IX protections for female athletes.",
    "link": "https://www.foxnews.com/sports/trump-admin-finds-minnesota-violated-title-ix-letting-males-girls-sports-citing-softball-pitcher",
    "timestamp": "2025-09-30T15:00:18Z"
  },
  {
    "title": "(Google, 9/30)テhrome 141.0.7390.54 ...",
    "description": "(Google, 9/30)テhrome 141.0.7390.54 (Linux) 141.0.7390.54/55 (Windows / Mac) stable 祉ュャ」贋障⒢ i \nChrome for Android Update (Google, 9/30)テhrome 141 (141.0.7390.43) for Android",
    "link": "http://www.st.ryukoku.ac.jp/~kjm/security/memo/2025/10.html#20251001__chrome",
    "timestamp": "2025-09-30T15:00:00Z"
  },
  {
    "title": "Apple 拷 (iOS / iPadOS, visionOS, macOS) (Apple, 2025.09.29)",
    "description": "cFontParser CVE-2025-43400\n信罩ｃ帥\ntvOS watchOS 違＜襲帥\n\r\n <ul> <li> \r\n <ul> <li> Apple security releases (Apple) \r\n </li></ul> <li> iOS / iPadOS \r\n <ul> <li> About the security content of iOS 26.0.1 and iPadOS 26.0.1 (Apple, 2025.09.29) \r\n <li> About the security …",
    "link": "http://www.st.ryukoku.ac.jp/~kjm/security/memo/2025/10.html#20251001_apple",
    "timestamp": "2025-09-30T15:00:00Z"
  },
  {
    "title": "菴処",
    "description": "Firefox 143.0 / 140.3.0 ESR / 115.28.0 ESRhunderbird 143.0 / 140.3.0esr (2025.09.19) \r\n\ne\n\r\n\n<ul> <li> Firefox 143.0.3irefox for Android 143.0.3 ⒢鴻 (mozillaZine, 2025.10.01)サ㏍⒢ｄ信罩2 篁吟 \r\n <li> Thunderbird 140.3.1esr ⒢鴻 (mozillaZine, 2025.10.01)＜サ㏍⒢ｄ信罩ｃ＜ \r\n </l…",
    "link": "http://www.st.ryukoku.ac.jp/~kjm/security/memo/2025/10.html#20251001_tuiki",
    "timestamp": "2025-09-30T15:00:00Z"
  },
  {
    "title": "Pfizer Stock Rises On Report Of Drug-Pricing Deal With Trump Administration",
    "description": "Pfizer's stock price went up nearly 2% or 1.91% on Tuesday as US President Donald Trump announced a price deal with vaccine maker. The pharma manufacturer is expected to sell its drugs at a lower price to the US Medicaid Insurance Program as part of an antici…",
    "link": "https://www.ndtvprofit.com/world/pfizer-stock-rises-on-report-of-drug-pricing-deal-with-trump-administration",
    "timestamp": "2025-09-30T14:59:20Z"
  },
  {
    "title": "'25th Amendment!' Trump speech met with multiple calls for removal on social media",
    "description": "President Donald Trump's speech to top military brass was blasted as \"absolutely unhinged\" Tuesday — as onlookers voiced demands that to invoke the 25th Amendment and remove him from office.The 25th Amendment provides a mechanism for the president's cabinet t…",
    "link": "https://www.rawstory.com/donald-trump-2674119246/",
    "timestamp": "2025-09-30T14:59:14Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to make an announcement at the White House",
    "description": "The president is expected to speak at 11 a.m. EDT.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-expected-to-make-an-announcement-at-the-white-house",
    "timestamp": "2025-09-30T14:58:44Z"
  },
  {
    "title": "Lt. General Rips Hegseth and Trump on MSNBC for ‘Insulting’ Troops With ‘Offensive’ Claim DEI Spurs Promotions",
    "description": "Retired Lt. Gen. Mark Hertling ripped Pete Hegseth for his \"offensive\" claims that \"wokeness or DEI\" has played any part in troops moving up the ranks\nThe post Lt. General Rips Hegseth and Trump on MSNBC for ‘Insulting’ Troops With ‘Offensive’ Claim DEI Spurs…",
    "link": "https://www.mediaite.com/media/news/lt-general-rips-hegseth-and-trump-on-msnbc-for-insulting-troops-with-offensive-claim-dei-spurs-promotions/",
    "timestamp": "2025-09-30T14:58:00Z"
  },
  {
    "title": "Anwar: Meeting with Trump to be platform for dialogue on peace, humanitarian aid to Gaza",
    "description": "KUALA LUMPUR: Prime Minister Datuk Seri Anwar Ibrahim said his upcoming meeting with United States President Donald Trump will serve as a key platform to sustain dialogue as a vital avenue for promoting peace and expanding humanitarian aid access to Gaza. Rea…",
    "link": "https://www.thestar.com.my/news/nation/2025/09/30/anwar-meeting-with-trump-to-be-platform-for-dialogue-on-peace-humanitarian-aid-to-gaza",
    "timestamp": "2025-09-30T14:57:00Z"
  },
  {
    "title": "Trump Makes Demented Claim About “Two N-Words” to Military Leaders",
    "description": "Nuclear is the new “n-word,” according to Donald Trump.The president, sharp as ever, rambled at an assembly of America’s top commanders Tuesday morning about nixing “woke” ideology from the armed services and bringing “battleships” back. He also discussed the…",
    "link": "https://newrepublic.com/post/201102/donald-trump-two-n-words-military-leaders",
    "timestamp": "2025-09-30T14:56:20Z"
  },
  {
    "title": "U.S. consumer confidence declines again as Americans worry about inflation, job market",
    "description": "The drop is bigger than analysts were expecting and the lowest reading since April, when President Donald Trump rolled out his sweeping tariff policy.",
    "link": "https://www.pbs.org/newshour/economy/u-s-consumer-confidence-declines-again-as-americans-worry-about-inflation-job-market",
    "timestamp": "2025-09-30T14:55:52Z"
  },
  {
    "title": "Trump to announce deal with Pfizer to lower drug prices",
    "description": "President Donald Trump will announce Tuesday that his administration has reached an agreement with Pfizer to voluntarily sell its drugs at lower prices, according to a White House official.",
    "link": "https://www.nbcnews.com/health/health-news/trump-announce-deal-pfizer-lower-drug-prices-rcna234679",
    "timestamp": "2025-09-30T14:55:32Z"
  },
  {
    "title": "EXPOSED: Real reason Trump preparing for war - Tulsi Gabbard WARNS Trump!!",
    "description": "Ralph Pezzullo and Stephen Gardner get deep into why Trump is gearing up for war with Venezuela. Imagine being briefed with evidence that Venezuela has been rigging elections with US AID tax payer money. Imagine learning they also been rigging elections in th…",
    "link": "https://freerepublic.com/focus/f-news/4343479/posts",
    "timestamp": "2025-09-30T14:53:21Z"
  },
  {
    "title": "Republicans Sound Off on ‘Schumer Shutdown’",
    "description": "Members of Congress are sounding off about the Democrat refusal yesterday to come to a deal in the White House to keep the government open,... Read More\nThe post Republicans Sound Off on ‘Schumer Shutdown’ appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/09/30/republicans-sound-off-on-schumer-shutdown/",
    "timestamp": "2025-09-30T14:52:21Z"
  },
  {
    "title": "Trump's Gaza plan is a significant step - but faces fundamental obstacles (Tom Bateman/BBC)",
    "description": "Tom Bateman / BBC:\nTrump's Gaza plan is a significant step - but faces fundamental obstacles  —  Tom BatemanState department correspondent at the White House  —  US President Donald Trump said his plan for ending the war in Gaza was potentially one of the gre…",
    "link": "https://www.memeorandum.com/250930/p46",
    "timestamp": "2025-09-30T14:50:00Z"
  }
]