[
  {
    "title": "Democrats push investigation into Trump, Musk White House Tesla event - The Hill",
    "description": "Democrats push investigation into Trump, Musk White House Tesla eventThe Hill People Zoomed Into Donald Trump's Tesla Sales Pitch And Can't Believe What They're SeeingYahoo Entertainment Trump pitched Teslas on the White House lawn. His next move may be even …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176706475",
    "timestamp": "2025-03-13T22:13:35Z"
  },
  {
    "title": "Trump to invoke wartime Alien Enemies Act of 1798 to fast-track deportations of illegal immigrants",
    "description": "President Donald Trump is expected to invoke a centuries-old wartime act to target illegal immigrants for deportation, according to media reports.",
    "link": "https://www.foxnews.com/politics/trump-invoke-wartime-alien-enemies-act-1798-fast-track-deportations-illegal-immigrants",
    "timestamp": "2025-03-13T22:13:33Z"
  },
  {
    "title": "Donald Trump Income Tax Plan: Calculate How Much Your Pay Would Change",
    "description": "If President Donald Trump abolishes federal income tax, Americans could save thousands of dollars each year.",
    "link": "https://www.newsweek.com/donald-trump-income-tax-calculate-how-pay-would-change-2044524",
    "timestamp": "2025-03-13T22:13:23Z"
  },
  {
    "title": "Albanese to join Ukraine 'coalition of the willing' peacekeeping call",
    "description": "Prime Minister Anthony Albanese will join a phone hook-up tomorrow night to discuss a possible joint peacekeeping force for Ukraine.",
    "link": "https://www.abc.net.au/news/2025-03-14/albanese-ukraine-peacekeeping-meeting-coalition/105051014",
    "timestamp": "2025-03-13T22:13:07Z"
  },
  {
    "title": "Will Elon Musk Make Postal Service Cuts? What To Know After DOGE Signs Agreement With Louis DeJoy",
    "description": "Among the areas DeJoy asked DOGE to target are the mandates that keep the Postal Service operational six days a week and in rural areas.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/13/will-elon-musk-make-postal-service-cuts-what-to-know-after-doge-signs-agreement-with-louis-dejoy/",
    "timestamp": "2025-03-13T22:09:53Z"
  },
  {
    "title": "Tiger Woods and Vanessa Trump dating after friendship blossomed into ‘something more’",
    "description": "Tiger Woods has a new love interest.",
    "link": "https://nypost.com/2025/03/13/sports/tiger-woods-vanessa-trump-dating-after-friendship-blossomed/",
    "timestamp": "2025-03-13T22:09:25Z"
  },
  {
    "title": "Trump’s Nominee for Ambassador to Canada Agrees It’s a Sovereign Nation",
    "description": "Donald Trump’s choice for ambassador to Canada affirmed that country’s status as a sovereign nation and hinted the president’s complex relationship with Prime Minister Justin Trudeau might have played a role in his calls to annex it into the US.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-nominee-for-ambassador-to-canada-agrees-its-a-sovereign-nation",
    "timestamp": "2025-03-13T22:07:41Z"
  },
  {
    "title": "America First Policy Institute Announces New Leadership After Trump Taps Founders for Cabinet",
    "description": "The America First Policy Institute announced changes to its leadership team Thursday to advance its mission after founders Brooke Rollins and Linda McMahon were tapped... Read More\nThe post America First Policy Institute Announces New Leadership After Trump T…",
    "link": "https://www.dailysignal.com/2025/03/13/america-first-policy-institute-announces-new-leadership-after-trump-taps-founders-for-cabinet/",
    "timestamp": "2025-03-13T22:07:20Z"
  },
  {
    "title": "Democrat Rep. Raul Grijalva Dies Due to 'Complications' from 'Cancer Treatments'",
    "description": "Rep. Raul Grijalva (D-AZ) died on Thursday morning due to \"complications\" from his \"cancer treatments,\" according to a statement issued by his office.\nThe post Democrat Rep. Raul Grijalva Dies Due to ‘Complications’ from ‘Cancer Treatments’ appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/03/13/democrat-rep-raul-grijalva-dies-due-to-complications-from-cancer-treatments/",
    "timestamp": "2025-03-13T22:05:33Z"
  },
  {
    "title": "GitLab addressed critical auth bypass flaws in CE and EE",
    "description": "GitLab addressed two critical authentication bypass vulnerabilities in Community Edition (CE) and Enterprise Edition (EE). GitLab released security updates to address critical vulnerabilities in Community Edition (CE) and Enterprise Edition (EE). The company …",
    "link": "https://securityaffairs.com/175370/security/gitlab-addressed-critical-flaws-in-ce-and-ee.html",
    "timestamp": "2025-03-13T22:05:08Z"
  },
  {
    "title": "Trump asks Supreme Court to curb judges' power to block policies nationwide (Josh Gerstein/Politico)",
    "description": "Josh Gerstein / Politico:\nTrump asks Supreme Court to curb judges' power to block policies nationwide  —  The emergency appeal comes in the battle over birthright citizenship — but it could have ripple effects in cases challenging many aspects of Trump's agen…",
    "link": "https://www.memeorandum.com/250313/p146",
    "timestamp": "2025-03-13T22:05:01Z"
  },
  {
    "title": "Putin sets out conditions for Ukraine ceasefire",
    "description": "The Russian president agrees fighting must end, but calls for the removal of the \"root causes\" of the crisis.",
    "link": "https://www.bbc.com/news/articles/cp8l00l4rejo",
    "timestamp": "2025-03-13T22:04:17Z"
  },
  {
    "title": "Hear the death threats Republican senator received about Trump",
    "description": "Sen. Thom Tillis, R-N.C., his staff and family have been the target of extensive harassment and death threats, a memo released by his office on Thursday afternoon revealed.",
    "link": "https://www.foxnews.com/politics/hear-death-threats-republican-senator-received-about-trump",
    "timestamp": "2025-03-13T22:04:01Z"
  },
  {
    "title": "Fear and resignation after ‘world’s most powerful company’ pays Trump a $100 billion ‘protection fee’",
    "description": "It was a surprise ceremony at the White House presided over by President Donald Trump to unveil a $100 billion investment from what he called the world’s...",
    "link": "https://www.cnn.com/2025/03/13/tech/taiwan-tsmc-us-investment-reactions-intl-hnk?cid=external-feeds_iluminar_yahoo",
    "timestamp": "2025-03-13T22:00:52Z"
  },
  {
    "title": "TSMC US investment: Fear and resignation after ‘world’s most powerful company’ pays Trump $100 billion",
    "description": "It was a surprise ceremony at the White House presided over by President Donald Trump to unveil a $100 billion investment from what he called the world’s most powerful company, Taiwan Semiconductor Manufacturing Company (TSMC).",
    "link": "https://www.cnn.com/2025/03/13/tech/taiwan-tsmc-us-investment-reactions-intl-hnk/index.html",
    "timestamp": "2025-03-13T22:00:52Z"
  },
  {
    "title": "MSNBC host reveals he's taking a week off, citing exhaustion from Trump's presidency",
    "description": "MSNBC's Lawrence O'Donnell revealed on Wednesday that he would be taking a week off, citing exhaustion as they're only 52 days in to President Trump's second term.",
    "link": "https://www.foxnews.com/media/msnbc-host-reveals-hes-taking-week-off-citing-exhaustion-from-trumps-presidency",
    "timestamp": "2025-03-13T22:00:44Z"
  },
  {
    "title": "US wine shops and importers say Trump's threatened 200% tariff on European wines would kill demand (Associated Press)",
    "description": "Associated Press:\nUS wine shops and importers say Trump's threatened 200% tariff on European wines would kill demand  —  The United States is suddenly looking less bubbly for European wines.  —  President Donald Trump on Thursday threatened a 200% tariff on E…",
    "link": "https://www.memeorandum.com/250313/p144",
    "timestamp": "2025-03-13T22:00:33Z"
  },
  {
    "title": "China reveals giant D-Day-style invasion barges moored off coast...",
    "description": "CHILLING pictures showing China’s giant D-Day style invasion barges have fuelled fears that they are preparing to invade Taiwan. The giant troop-carrying barges are capable of delivering flee…",
    "link": "https://www.the-sun.com/news/13774808/chinas-invasion-barges-fears-grow-attack-taiwan/",
    "timestamp": "2025-03-13T22:00:04Z"
  },
  {
    "title": "Ex-Pioneer CEO: Shale Can’t Thrive at $50 Oil",
    "description": "The founder of Pioneer Natural Resources has a warning for the U.S. oil producers—the next two years will not be easy, and “drill, baby, drill” isn’t happening at $50 oil price. Scott Sheffield, who founded Pioneer Natural Resources and sold last year the top…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Ex-Pioneer-CEO-Shale-Cant-Thrive-at-50-Oil.html",
    "timestamp": "2025-03-13T22:00:00Z"
  },
  {
    "title": "Is This a Crisis or Not?",
    "description": "Democrats insist that this is a dire moment for the nation. A government-funding deadline is a chance for them to show that they mean it.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/03/is-this-a-crisis-or-not/682034/",
    "timestamp": "2025-03-13T21:59:00Z"
  },
  {
    "title": "Tiger Woods, Vanessa Trump have been dating since last year: report",
    "description": "Tiger Woods and President Donald Trump's former daughter-in-law, Vanessa, have been dating since Thanksgiving, according to a recent report.",
    "link": "https://www.foxnews.com/sports/tiger-woods-vanessa-trump-have-been-dating-since-last-year-report",
    "timestamp": "2025-03-13T21:58:57Z"
  },
  {
    "title": "National embraces Donald Trump’s former deputy chief of staff Chris Liddell as Government mulls Auckland harbour crossing options",
    "description": "Donald Trump's former deputy chief of staff Christopher Liddell addressed the conference.",
    "link": "https://www.nzherald.co.nz/nz/politics/national-embraces-donald-trumps-former-deputy-chief-of-staff-chris-liddell-as-government-mulls-auckland-harbour-crossing-options/LS5GHXOQE5E6BEYYCZWD2V5RMU/",
    "timestamp": "2025-03-13T21:56:35Z"
  },
  {
    "title": "National embraces Trump’s former deputy chief of staff as Government mulls PPP for harbour crossing",
    "description": "Donald Trump's former deputy chief of staff Christopher Liddell addressed the conference.",
    "link": "https://www.nzherald.co.nz/nz/politics/national-embraces-trumps-former-deputy-chief-of-staff-as-government-mulls-ppp-for-harbour-crossing/LS5GHXOQE5E6BEYYCZWD2V5RMU/",
    "timestamp": "2025-03-13T21:56:35Z"
  },
  {
    "title": "Stablecoin Bill Heads to Senate After Vote in Banking Committee",
    "description": "A stablecoin bill, the GENIUS Act, is headed to the full Senate after being advanced by an 18-6 vote in the Senate Banking Committee.\nThe Thursday (March 13) vote puts bill on a “fast track” in the Senate, as it is a priority of President Donald Trump, Bloomb…",
    "link": "https://biztoc.com/x/5e2ae4a07141ba61",
    "timestamp": "2025-03-13T21:55:12Z"
  },
  {
    "title": "I don’t agree with Mahmoud Khalil. That doesn’t mean he should be deported",
    "description": "President Donald Trump, White House press secretary Karoline Leavitt and Secretary of State Marco Rubio claim Mahmoud Khalil is a national security threat.",
    "link": "https://biztoc.com/x/9bbcc129c1d24bd3",
    "timestamp": "2025-03-13T21:55:11Z"
  },
  {
    "title": "Dismantling the Education Department",
    "description": "Conservatives have been working to correct President Jimmy Carter’s mistake ever since he made federal education programs into a cabinet-level agency. For decades, Republicans have... Read More\nThe post Dismantling the Education Department appeared first on T…",
    "link": "https://www.dailysignal.com/2025/03/13/dismantling-the-education-department/",
    "timestamp": "2025-03-13T21:54:15Z"
  },
  {
    "title": "B.C. Hydro cuts Tesla from charger rebate program amid trade war",
    "description": "British Columbia has axed Tesla from its charger rebate program. Normally, B.C.’s rebates cover up 50 per cent of the cost of purchase and installation of a home charger. However, the official B.C. Hydro website has been updated to state that Tesla’s electric…",
    "link": "https://mobilesyrup.com/2025/03/13/b-c-hydro-tesla-cut-from-charger-rebate-program-trade-war/",
    "timestamp": "2025-03-13T21:53:34Z"
  },
  {
    "title": "Trump keeps talking about making Canada the 51st state. Is he serious?",
    "description": "President Donald Trump continued to belittle Canada and threaten it with joining the United States as the economic war with the country continued.",
    "link": "https://abcnews.go.com/Politics/trump-talking-making-canada-51st-state/story?id=119767909",
    "timestamp": "2025-03-13T21:50:01Z"
  },
  {
    "title": "Columbia University says school expelled some pro-Palestinian students who seized building last year",
    "description": "In a campus-wide email sent Thursday, the university said its judicial board had issued its sanctions against dozens of students who occupied Hamilton Hall based on its “evaluation of the severity of behaviors.”",
    "link": "https://nypost.com/2025/03/13/us-news/columbia-university-says-school-expelled-some-pro-palestinian-students-who-seized-building-last-year/",
    "timestamp": "2025-03-13T21:50:00Z"
  },
  {
    "title": "'Won't happen': Critics flag Trump official's 'lies' about eliminating income tax",
    "description": "Commerce Secretary Howard Lutnick appeared to backtrack Thursday on a key tax proposal from him and President Donald Trump.Lutnick joined Fox News to speak with host Martha MacCallum on Trumo's plan to eliminate the income tax for people making below $150,000…",
    "link": "https://www.rawstory.com/howard-lutnick-2671325018/",
    "timestamp": "2025-03-13T21:49:24Z"
  },
  {
    "title": "Colorado’s two U.S. senators say they will vote no on Republican-drafted spending bill",
    "description": "Colorado's two U.S. senators, Democrats Michael Bennet and John Hickenlooper, both say they intend to vote no on a Republican-drafted spending bill as the federal government lurches toward an imminent shutdown.",
    "link": "https://www.denverpost.com/2025/03/13/colorado-michael-bennet-john-hickenlooper-senate-republican-budget-shutdown/",
    "timestamp": "2025-03-13T21:49:02Z"
  },
  {
    "title": "Australia moves to arm troops with anti-ship missiles as China threat looms",
    "description": "Australia is scrambling to deploy new long-range missiles as the recent arrival of powerful Chinese warships off the Australian coast delivers a sharp reminder of Beijing’s growing naval muscle. In a move to boost military firepower, Canberra plans to arm Aus…",
    "link": "https://japantoday.com/category/world/australia-moves-to-arm-troops-with-anti-ship-missiles-as-china-threat-looms",
    "timestamp": "2025-03-13T21:48:49Z"
  },
  {
    "title": "Protesters occupy Trump Tower following arrest of Columbia student",
    "description": "Scores of people poured into the lobby of Trump Tower in New York City on Thursday to protest the arrest and detention of Columbia University student Mahmoud Khalil, whom the Trump administration aims to deport over his pro-Palestinian activism. The arrest of…",
    "link": "https://japantoday.com/category/world/protesters-occupy-trump-tower-following-arrest-of-columbia-student1",
    "timestamp": "2025-03-13T21:48:17Z"
  },
  {
    "title": "Senate Democrats refuse to go along with GOP spending plan, as shutdown deadline nears",
    "description": "A day before a shutdown deadline, Senate Democrats are mounting a last-ditch protest over a Republican-led government funding bill that already passed the House but failed to slap any limits on President Donald Trump and billionaire Elon Musk's efforts to gut…",
    "link": "https://japantoday.com/category/world/senate-democrats-refuse-to-go-along-with-gop-spending-plan-as-shutdown-deadline-nears",
    "timestamp": "2025-03-13T21:48:09Z"
  },
  {
    "title": "Mexico Pavilion Undergoes Major Update at Disney World Under President Trump",
    "description": "Walt Disney World Resort is continuing refurbishment work around the EPCOT World Showcase. Inside the Magic has previously shared updates on a years-long mystery project in the Canada World Showcase Pavilion, but today, we’re traveling around the World Showca…",
    "link": "https://insidethemagic.net/2025/03/epcot-mexico-pavilion-construction-update-jc1/",
    "timestamp": "2025-03-13T21:48:07Z"
  },
  {
    "title": "Roundup: Europe against new U.S. tariffs, wine, spirits industry concerned",
    "description": "PARIS, March 13 (Xinhua) -- The Trump administration recently announced a 25-percent tariff on imports of steel, aluminum, and certain steel and aluminum-containing products from the European Union (EU). In response, the bloc announced on Wednesday a 50-perce…",
    "link": "https://www.thestar.com.my/news/world/2025/03/14/roundup-europe-against-new-us-tariffs-wine-spirits-industry-concerned",
    "timestamp": "2025-03-13T21:48:00Z"
  },
  {
    "title": "Trump tells NATO chief U.S. needs Greenland",
    "description": "President Donald Trump told NATO Secretary-General Mark Rutte on Thursday that U.S. control of Greenland is necessary to enhance international security, escalating his campaign to annex the strategic Arctic island. &quot;You know, Mark, we need that for inter…",
    "link": "https://japantoday.com/category/world/trump-tells-nato-chief-the-us-needs-greenland",
    "timestamp": "2025-03-13T21:47:53Z"
  },
  {
    "title": "U.S. imposes sanctions on Iranian oil minister, shadow fleet",
    "description": "The United States imposed sanctions on Thursday on Iran's Oil Minister Mohsen Paknejad and some Hong Kong-flagged vessels that are part of a shadow fleet that helps disguise Iranian oil shipments, the Treasury Department said. President Donald Trump re-impose…",
    "link": "https://japantoday.com/category/world/us-imposes-sanctions-on-iranian-oil-minister-shadow-fleet2",
    "timestamp": "2025-03-13T21:47:41Z"
  },
  {
    "title": "G7 seeks unity as Trump's tariffs, Ukraine stance weighs on ties",
    "description": "Foreign ministers of leading Western democracies sought to show a united front in Canada on Thursday after seven weeks of rising tensions between U.S. allies and President Donald Trump over his upending of foreign policy on Ukraine and imposition of tariffs. …",
    "link": "https://japantoday.com/category/world/g7-seeks-unity-as-trump%27s-tariffs-ukraine-stance-weighs-on-ties",
    "timestamp": "2025-03-13T21:47:21Z"
  },
  {
    "title": "Tesla Warns It Faces Retaliation, Costs From Trump Trade War",
    "description": "Tesla Inc. is signaling concern over potential retaliatory moves by other countries as a trade war escalates in the wake of President Donald Trump’s moves to impose tariffs on a wide range of imports.",
    "link": "https://financialpost.com/pmn/business-pmn/tesla-warns-it-faces-retaliation-costs-from-trump-trade-war",
    "timestamp": "2025-03-13T21:47:19Z"
  },
  {
    "title": "Judge orders Trump to rehire probationary workers let go in mass firings across multiple agencies",
    "description": "A federal judge in San Francisco ordered President Donald Trump's administration to rehire thousands, if not tens of thousands, of probationary workers let go in mass firings across multiple agencies, blasting their tactics Thursday as he slowed the new presi…",
    "link": "https://japantoday.com/category/world/judge-orders-trump-to-reinstate-probationary-workers-let-go-in-mass-firings-across-multiple-agencies",
    "timestamp": "2025-03-13T21:47:14Z"
  },
  {
    "title": "Putin backs U.S. ceasefire idea for Ukraine in principle, but suggests it needs reworking",
    "description": "President Vladimir Putin said on Thursday that Russia supported a U.S. proposal for a ceasefire in Ukraine in principle, but that any truce would have to address the root causes of the conflict and that many crucial details needed to be sorted out. Russia's i…",
    "link": "https://japantoday.com/category/world/putin-backs-us-ceasefire-idea-for-ukraine-in-principle-but-suggests-it-needs-reworking",
    "timestamp": "2025-03-13T21:47:01Z"
  },
  {
    "title": "New poll details Americans' views on Trump and Musk",
    "description": "President Donald Trump's poll numbers are edging down since taking over the White House nearly eight weeks ago. And Americans appear to be giving DOGE's Elon Musk a thumbs-down.",
    "link": "https://www.foxnews.com/politics/new-poll-details-americans-views-trump-musk",
    "timestamp": "2025-03-13T21:46:13Z"
  },
  {
    "title": "Alien Enemies Act: The controversial wartime law from 1798 that Trump could invoke for mass deportations",
    "description": "President Donald Trump said in his inauguration address that he planned to utilize the Alien Enemies Act of 1798 as part of his sweeping crackdown on immigration. Now, the Trump administration could go ahead with its plan to use the little-known wartime law t…",
    "link": "https://biztoc.com/x/727d63d278f8f7e3",
    "timestamp": "2025-03-13T21:45:24Z"
  },
  {
    "title": "If the trade war hobbles Canada’s auto sector, let’s just phase it out",
    "description": "Christopher Worswick is chair of the economics department at Carleton University and a research fellow at the C.D. Howe Institute.\nAmong his many threats this week, U.S. President Donald Trump vowed to “permanently shut down” Canada’s automobile industry with…",
    "link": "https://biztoc.com/x/28cca596caf8a949",
    "timestamp": "2025-03-13T21:45:22Z"
  },
  {
    "title": "Duterte's First ICC Appearance Set For Friday: Court",
    "description": "Rodrigo Duterte's first appearance at the International Criminal Court has been set for Friday, the court said, as the former Philippines president faces crimes against humanity charges over his deadly war on drugs.",
    "link": "https://www.ibtimes.com/dutertes-first-icc-appearance-set-friday-court-3766220",
    "timestamp": "2025-03-13T21:45:21Z"
  },
  {
    "title": "Duterte's first ICC appearance set for Friday: court",
    "description": "<p>THE HAGUE - Rodrigo Duterte's first appearance at the International Criminal Court has been set for Friday, the court said, as the former Philippines president faces crimes against humanity charges over his deadly war on drugs.</p>",
    "link": "https://www.bangkokpost.com/world/2979786/dutertes-first-icc-appearance-set-for-friday-court",
    "timestamp": "2025-03-13T21:45:00Z"
  },
  {
    "title": "Trump threatens retaliatory 200% tariff on European wine after EU proposes American whiskey tax",
    "description": "President Donald Trump on Thursday threatened a 200% tariff on European wine, Champagne and spirits if the European Union goes forward with a planned tariff on American whiskey. The European import tax, which was unveiled in response to steel and aluminum tar…",
    "link": "https://japantoday.com/category/business/trump-threatens-retaliatory-200-tariff-on-european-wine-after-eu-proposes-american-whiskey-tariff",
    "timestamp": "2025-03-13T21:44:46Z"
  },
  {
    "title": "Dems, facing shutdown, previously criticized Republicans for 'political games' during gov funding fights",
    "description": "Democrats have criticized Republicans for their hesitation to pass government funding legislation, while their own party is currently on the brink of allowing a federal shutdown.",
    "link": "https://www.foxnews.com/politics/dems-facing-shutdown-previously-criticized-republicans-political-games-during-gov-funding-fights",
    "timestamp": "2025-03-13T21:44:12Z"
  },
  {
    "title": "Number of migrants stopped entering US from Canada drops to multi-year low",
    "description": "TORONTO (Reuters) - The number of migrants apprehended by the U.S. Border Patrol after entering the United States from Canada dropped to the lowest point since 2022 last month, according to U.S. Customs and Border Protection statistics published on Thursday. …",
    "link": "https://www.thestar.com.my/news/world/2025/03/14/number-of-migrants-stopped-entering-us-from-canada-drops-to-multi-year-low",
    "timestamp": "2025-03-13T21:44:00Z"
  },
  {
    "title": "Video: Mass Firings From the Federal Government: \"Unlawful, Dishonest, and Lack of Decency\"",
    "description": "Andrew Weissmann, former top prosecutor at the Justice Department and Katherine Steele, a former federal employee of the National Forest Service who was unlawfully fired join Nicolle Wallace to discuss the latest ruling from the federal judge order some feder…",
    "link": "https://littlegreenfootballs.com/article/54455_Video-_Mass_Firings_From_the_F",
    "timestamp": "2025-03-13T21:41:57Z"
  },
  {
    "title": "Venezuela agrees to resume deportation flights in response to pressure from Trump",
    "description": "Venezuela has agreed to resume accepting deportation flights from the U.S., according to Richard Grenell, a special envoy to the president.",
    "link": "https://www.foxnews.com/politics/venezuela-agrees-resume-deportation-flights-following-trump-pressure",
    "timestamp": "2025-03-13T21:41:15Z"
  },
  {
    "title": "U.S. ambassador nominee to Japan says Tokyo will have to pay more",
    "description": "President Donald Trump's nominee to be the U.S. ambassador to Japan, George Glass, said on Thursday that Washington will &quot;undoubtedly&quot; have to ask Japan for an increase in its financial contribution for the upkeep of U.S. forces there, referring to …",
    "link": "https://japantoday.com/category/politics/George-Glass-U.S.-ambassador-nominee-to-Japan-says-Tokyo-will-have-to-pay-more",
    "timestamp": "2025-03-13T21:40:56Z"
  },
  {
    "title": "26 States, Lawmakers, Faith Groups Support Parents at SCOTUS Fighting Grade-School LGBTQQIAAP2S+ Lessons",
    "description": "Christian, Jewish, and Muslim parents are asking the Supreme Court to allow them to opt their young children out of LGBTQ+ indoctrination at schools in Montgomery County, Maryland. \nThe post 26 States, Lawmakers, Faith Groups Support Parents at SCOTUS Fightin…",
    "link": "https://www.breitbart.com/politics/2025/03/13/26-states-lawmakers-faith-groups-back-parents-asking-scotus-to-shield-k-5-children-from-lgbtq-curriculum/",
    "timestamp": "2025-03-13T21:39:53Z"
  },
  {
    "title": "What happens to Social Security, TSA and other programs if government shuts down?",
    "description": "Hundreds of thousands of federal workers are on edge as the Senate struggles to reach a deal ahead of Friday night's looming deadline.",
    "link": "https://abcnews.go.com/Politics/social-security-tsa-programs-federal-government-shuts/story?id=119767092",
    "timestamp": "2025-03-13T21:38:13Z"
  },
  {
    "title": "‘Double Standard’: DC Court That Shielded John Kerry’s Staff Changed Its Tune When It Came To DOGE",
    "description": "A federal judge ordered DOGE to disclose staff identities in response to FOIA lawsuit filed by Citizens for Responsibility and Ethics.",
    "link": "https://dailycaller.com/2025/03/13/court-shielded-john-kerry-staff-doge/",
    "timestamp": "2025-03-13T21:37:42Z"
  },
  {
    "title": "All eyes on Democrats as US barrels toward shutdown deadline",
    "description": "The US government, already shaken by Donald Trump’s radical reforms, could begin shutting down entirely this weekend as Democrats grapple with the option of opposing the president’s federal funding plans — at the risk this blows up in their faces. With a Frid…",
    "link": "https://www.digitaljournal.com/world/all-eyes-on-democrats-as-us-barrels-toward-shutdown-deadline/article",
    "timestamp": "2025-03-13T21:37:34Z"
  },
  {
    "title": "Tiger Woods secretly dating Vanessa Trump: report",
    "description": "The golfing legend and ex-wife of Donald Trump Jr. have reportedly been dating since Thanksgiving.",
    "link": "https://pagesix.com/2025/03/13/celebrity-news/tiger-woods-secretly-dating-vanessa-trump-report/",
    "timestamp": "2025-03-13T21:36:59Z"
  },
  {
    "title": "'It would mean war': Trump assailed after threatening to 'pull a Crimea' on ally​",
    "description": "President Donald Trump created an international firestorm on Thursday after suggesting that “NATO might have to get involved” to help the United States invade Greenland in the interest of “international security” – while questioning Denmark’s claim to the aut…",
    "link": "https://www.rawstory.com/trump-greenland-2671325010/",
    "timestamp": "2025-03-13T21:36:09Z"
  },
  {
    "title": "Trump administration asks Supreme Court to allow some birthright citizenship restrictions to take effect",
    "description": "In emergency applications filed at the high court on Thursday, the administration asked the justices to narrow court orders entered by district judges in Maryland, Massachusetts and Washington that blocked the order President Donald Trump signed shortly after…",
    "link": "https://biztoc.com/x/ecb2e335aa04ec70",
    "timestamp": "2025-03-13T21:35:29Z"
  },
  {
    "title": "I don’t agree with Mahmoud Khalil. That doesn’t mean he should be deported.",
    "description": "President Donald Trump, White House press secretary Karoline Leavitt and Secretary of State Marco Rubio claim Mahmoud Khalil is a national security threat.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/mahmoud-khalil-ice-arrest-liberal-jews-rcna196283",
    "timestamp": "2025-03-13T21:35:06Z"
  },
  {
    "title": "Border Processing Facilities to Close Due to Lack of Migrant Crossings",
    "description": "Five sites are closing after a dramatic drop in illegal crossings along the U.S.-Mexico border.",
    "link": "https://www.newsweek.com/us-mexico-border-immigrant-processing-centers-closing-2044554",
    "timestamp": "2025-03-13T21:34:45Z"
  },
  {
    "title": "Democrats Dig In Against GOP Funding Bill, Increasing Odds Of Shutdown",
    "description": "The prospect of a government shutdown grew on Thursday after nearly a dozen Democratic senators came out against a GOP funding package.",
    "link": "https://www.huffpost.com/entry/shutdown-democrats-trump_n_67d33122e4b022e5d6b350f9",
    "timestamp": "2025-03-13T21:32:19Z"
  },
  {
    "title": "US long-range bombs headed to Ukraine as ATACMS supply dwindles",
    "description": "The U.S. is poised to resume shipments to Ukraine of long-range bombs known as Ground-Launched Small Diameter Bombs (GLSDB), after they were upgraded to better counter Russian jamming, two people familiar with the weapon told Reuters. The munitions will arriv…",
    "link": "https://freerepublic.com/focus/f-chat/4304092/posts",
    "timestamp": "2025-03-13T21:30:20Z"
  },
  {
    "title": "Starbucks CEO Brian Niccol defends company’s DEI practices, says they are ‘key’ strength of business",
    "description": "Starbucks CEO Brian Niccol reaffirmed during a shareholder meeting this week that the company will continue focusing on diversity, calling it a key part of the coffee giant's strength.",
    "link": "https://nypost.com/2025/03/13/business/starbucks-ceo-brian-niccol-defends-companys-dei-practices-says-they-are-key-strength-of-business/",
    "timestamp": "2025-03-13T21:30:20Z"
  },
  {
    "title": "Mahmoud Khalil Sues Columbia To Keep Activist Student Names Private",
    "description": "A House committee demanded records on pro-Palestinian students, who believe the information will be used to harass and threaten them.",
    "link": "https://www.huffpost.com/entry/mahmoud-khalil-sues-columbia-to-keep-activist-student-names-private_n_67d32e67e4b0e72dd7feecce",
    "timestamp": "2025-03-13T21:29:30Z"
  },
  {
    "title": "The Other Government Shutdown Happening This Week",
    "description": "Russell Vought and Elon Musk are making congressional decisions on funding the government irrelevant by their own lawless actions, including the firing of 700,000 federal workers and impoundment. It’s a government shutdown by other means.",
    "link": "http://nymag.com/intelligencer/article/the-other-government-shutdown-happening-this-week.html",
    "timestamp": "2025-03-13T21:29:21Z"
  },
  {
    "title": "Truce Is Not A Game To Putin, So Stop The ‘Cards’ And ‘Ball’ Metaphors",
    "description": "Here are 3 reasons why leaders – political as well as corporate – should stop talking about themselves and others as players in a game.",
    "link": "https://www.forbes.com/sites/pialauritzen/2025/03/13/truce-is-not-a-game-to-putin-so-stop-the-cards-and-ball-metaphors/",
    "timestamp": "2025-03-13T21:28:24Z"
  },
  {
    "title": "The Things They Left Behind: Retreating From Kursk, The Ukrainians Abandoned Some Of Their Best Weapons.",
    "description": "In all, Ukraine lost around 500 vehicles and guns in Kursk.",
    "link": "https://www.forbes.com/sites/davidaxe/2025/03/13/the-things-they-left-behind-retreating-from-kursk-the-ukrainians-abandoned-some-of-their-best-weapons/",
    "timestamp": "2025-03-13T21:28:04Z"
  },
  {
    "title": "Trump administration asks Supreme Court to allow some birthright citizenship restrictions to take effect",
    "description": "In emergency applications filed at the high court on Thursday, the administration asked the justices to narrow court orders entered by district judges in Maryland, Massachusetts and Washington that blocked the order President Donald Trump signed shortly after…",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-asks-supreme-court-to-allow-some-birthright-citizenship-restrictions-to-take-effect",
    "timestamp": "2025-03-13T21:27:53Z"
  },
  {
    "title": "Tesla's fall from grace may have no equal, says JPMorgan: 'We struggle to think of anything analogous'",
    "description": "Tesla’s fall from grace may have no equal, says JPMorgan: ‘We struggle to think of anything analogous’\nElon Musk's proximity to Donald Trump and his embrace of Europe's far-right have sparked a historic consumer backlash against Tesla.\nMandel Ngan—AFP via Get…",
    "link": "https://biztoc.com/x/ba59ff7a2f1804ec",
    "timestamp": "2025-03-13T21:27:47Z"
  },
  {
    "title": "Trump has begun another trade war. Here's a timeline of how we got here",
    "description": "Long-threatened tariffs from U.S. President Donald Trump have plunged the country into a trade war abroad — all while on-again, off-again new levies continue to escalate uncertainty",
    "link": "https://abcnews.go.com/US/wireStory/trump-begun-trade-war-timeline-119773830",
    "timestamp": "2025-03-13T21:26:49Z"
  },
  {
    "title": "Trump Admin Wants to Acquire as Much Bitcoin as Possible: White House",
    "description": "A White House official told a room of crypto industry leaders this week that there should be no limit to the size of a U.S. government Strategic Bitcoin Reserve.",
    "link": "https://decrypt.co/309948/trump-admin-acquire-much-bitcoin-possible-white-house",
    "timestamp": "2025-03-13T21:26:41Z"
  },
  {
    "title": "New Book: Biden 'Demanded' Loyalty From Harris Campaign—'Whether She Won or Lost the Election'",
    "description": "After former president Joe Biden bowed out of the 2024 race in favor of his vice president, Kamala Harris, he \"demanded\" loyalty from Harris so that he could protect his legacy, a new book reveals.\nThe post New Book: Biden 'Demanded' Loyalty From Harris Campa…",
    "link": "https://freebeacon.com/latest-news/new-book-biden-demanded-loyalty-from-harris-campaign-whether-she-won-or-lost-the-election/",
    "timestamp": "2025-03-13T21:25:28Z"
  },
  {
    "title": "Maxine Waters Believes Trump is ‘Working Toward a Civil War’",
    "description": "Rep. Maxine Waters (D-CA) said Thursday she believes President Donald Trump wants to stoke “violence,” and his endgame is a “civil war.” The California Democrat said multiple times at a conference for the Congressional Black Caucus that Trump had been plannin…",
    "link": "https://www.mediaite.com/tv/maxine-waters-believes-trump-is-working-toward-a-civil-war/",
    "timestamp": "2025-03-13T21:24:04Z"
  },
  {
    "title": "Trump downplays China-Russia-Iran nuclear talks, says they may discuss 'de-escalation'",
    "description": "President Trump said Russia, China and Iran may discuss \"de-escalation\" during upcoming nuclear talks in Beijing and suggested he might engage with North Korea on denuclearization.",
    "link": "https://www.foxnews.com/world/trump-downplays-china-russia-iran-nuclear-talks-says-may-discuss-de-escalation",
    "timestamp": "2025-03-13T21:23:25Z"
  },
  {
    "title": "Trump family fortune began in a Canadian brothel-hotel",
    "description": "In one of history’s little-known ironies, the Maple Leaf country pushing back against Donald Trump’s annexation bid is also host to a tiny, remote restaurant and brothel that helped launch the U.S. president’s family fortune more than 100 years ago. To find i…",
    "link": "https://financialpost.com/pmn/trump-family-fortune-began-in-a-canadian-brothel-hotel-2",
    "timestamp": "2025-03-13T21:22:07Z"
  },
  {
    "title": "Time For Trump to Pull the Brake on California’s Bullet Train to Nowhere",
    "description": "The California bullet train to nowhere keeps going nowhere and the Trump administration might finally pull the emergency break. The California High Speed Rail project is no... Read More\nThe post Time For Trump to Pull the Brake on California’s Bullet Train to…",
    "link": "https://www.dailysignal.com/2025/03/13/time-trump-pull-brake-californias-bullet-train-nowhere/",
    "timestamp": "2025-03-13T21:20:02Z"
  },
  {
    "title": "Editorial board resigns after journal cancels special issue on Palestine",
    "description": "The editorial board of an architecture journal has resigned after its parent association cancelled an upcoming theme issue titled “Palestine.”   The Journal of Architectural Education planned to publish the issue in fall 2025, according to an archived version…",
    "link": "https://retractionwatch.com/2025/03/13/journal-architectural-education-board-resignation-palestine-issue/",
    "timestamp": "2025-03-13T21:18:43Z"
  },
  {
    "title": "Senate Democrats tight-lipped after huddling over looming government shutdown",
    "description": "Senate Democrats remained tight-lipped on Thursday after meeting on the fast-approaching government funding deadline, creating a heightened prospect for a shutdown.",
    "link": "https://abcnews.go.com/Politics/senate-democrats-tight-lipped-after-huddling-looming-government/story?id=119772584",
    "timestamp": "2025-03-13T21:18:12Z"
  },
  {
    "title": "Putin's definite 'maybe' on ceasefire with Ukraine keeps the White House engaged",
    "description": "Russia’s president appeared to hedge his bets on the issue of a Ukrainian ceasefire, saying it was a good idea but refusing to implement it, for now. That keeps the dialogue open with Donald Trump, but it means the war continues.",
    "link": "https://www.cbc.ca/news/world/putin-ceasefire-response-analysis-1.7482964",
    "timestamp": "2025-03-13T21:17:42Z"
  },
  {
    "title": "Trump's trade war is stirring up booze battles",
    "description": "European wine, Kentucky bourbon, French Champagne, and other alcoholic beverages could be subject to tariffs if EU and US tariffs materialize.",
    "link": "https://www.businessinsider.com/trump-trade-war-stirring-booze-battles-eu-us-wine-whiskey-2025-3",
    "timestamp": "2025-03-13T21:15:12Z"
  },
  {
    "title": "Trump To Invoke Wartime ‘Alien Enemies Act’ Authorizing the Summary Deportation of Criminal Migrants – Including to Guantanamo Bay: REPORT",
    "description": "President Donald J. Trump is reportedly about to invoke wartime legislation to summarily deport some criminal migrants – including to Guantanamo Bay. The ‘Alien Enemies Act’ of 1798 is expected to be activated as soon as tomorrow (14). CBS News reported: “The…",
    "link": "https://freerepublic.com/focus/f-news/4304091/posts",
    "timestamp": "2025-03-13T21:15:10Z"
  },
  {
    "title": "US commerce secretary takes aim at Ireland ‘tax scam’ day after Taoiseach meets Trump; Burke family protest outside gala event",
    "description": "Taoiseach Micheál Martin met US president Donald Trump yesterday in a hotly anticipated meeting as part of St Patrick’s Day celebrations. His visit today continued with trade and enterprise events.",
    "link": "https://www.independent.ie/irish-news/politics/us-commerce-secretary-takes-aim-at-ireland-tax-scam-day-after-taoiseach-meets-trump-burke-family-protest-outside-gala-event/a438244273.html",
    "timestamp": "2025-03-13T21:15:00Z"
  },
  {
    "title": "US commerce secretary takes aim at Ireland ‘tax scam’ day after Taoiseach meets Trump in White House",
    "description": "Taoiseach Micheál Martin met US president Donald Trump yesterday in a hotly anticipated meeting as part of St Patrick’s Day celebrations. His visit today continued with trade and enterprise events.",
    "link": "https://www.independent.ie/irish-news/politics/us-commerce-secretary-takes-aim-at-ireland-tax-scam-day-after-taoiseach-meets-trump-in-white-house/a438244273.html",
    "timestamp": "2025-03-13T21:15:00Z"
  },
  {
    "title": "Peter Bart: ‘Mickey 17’ Will Delight Bong-Heads, But The Rest Of The Moviegoing Universe Might Need Convincing",
    "description": "Will filmgoers rally behind space travelers who “hate dying” but keep courting death? The director who gave us Parasite, a cool, curmudgeonly social comedy, is challenging filmgoers with a big-budget, genre-bending epic titled Mickey 17 that will likely be a …",
    "link": "http://deadline.com/2025/03/mickey-17-bong-head-hit-box-office-chances-1236325428/",
    "timestamp": "2025-03-13T21:15:00Z"
  },
  {
    "title": "Wall Street tumbles 10% below its record after Trump escalates trade war",
    "description": "NEW YORK — Wall Street's sell-off hit a new low Thursday after U.S. President Donald Trump's escalating trade war dragged the S&P 500 more than 10% below its record, which was set just last month.\nA 10% drop is deemed a correction by professional investors, a…",
    "link": "https://www.voanews.com/a/wall-street-tumbles-10-below-its-record-after-trump-escalates-trade-war/8010009.html",
    "timestamp": "2025-03-13T21:14:25Z"
  },
  {
    "title": "Trump threatens 200% tariffs on Europe alcohol in retaliation against EU trade measures",
    "description": "President Donald Trump threatened on Thursday to impose a 200% tariff on European alcoholic beverages in response to the European Union’s retaliation on his aluminum and steel tariffs. In a Truth Social post, Trump warned that his administration would enforce…",
    "link": "https://biztoc.com/x/2f657cf79875cc4a",
    "timestamp": "2025-03-13T21:14:24Z"
  },
  {
    "title": "Putin Says Russia Is Open to a Cease-Fire Deal—With Caveats",
    "description": "The Russian leader said “there are issues that need to be discussed” before he can accept a truce.",
    "link": "http://foreignpolicy.com/2025/03/13/russia-putin-cease-fire-deal-ukraine-us-witkoff/",
    "timestamp": "2025-03-13T21:14:05Z"
  },
  {
    "title": "Recession Fears and Elon Musk Batter Trump’s Approval Rating",
    "description": "Trump job-approval ratings are being hammered by a plunging stock market, rising recession fears, and the Elon Musk DOGE rampage.",
    "link": "http://nymag.com/intelligencer/article/trump-approval-rating-recession-elon-musk.html",
    "timestamp": "2025-03-13T21:14:00Z"
  },
  {
    "title": "‘Mind-Boggling’: Fox News Host Asks Commerce Sec. Why Trump Doesn’t Just ‘Eliminate the Tariffs’ Already",
    "description": "Fox News host Martha MacCallum pressed Commerce Secretary Howard Lutnick on why President Donald Trump doesn't just drop tariffs on Canada and end the nascent trade war between it and the U.S.\nThe post ‘Mind-Boggling’: Fox News Host Asks Commerce Sec. Why Tru…",
    "link": "https://www.mediaite.com/tv/mind-boggling-fox-news-host-asks-commerce-sec-why-trump-doesnt-just-eliminate-the-tariffs-already/",
    "timestamp": "2025-03-13T21:10:42Z"
  }
]