[
  {
    "title": "US-Taiwan relations are 'rock solid,' president Ching-te says after Trump-Xi call",
    "description": "Taiwan's President Lai Ching-te asserts that ties with the United States remain strong. He confirmed that cooperation programs will continue without alteration. This statement follows a call between Chinese President Xi Jinping and U.S. President Donald Trump…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-taiwan-relations-are-rock-solid-president-ching-te-says-after-trump-xi-call/articleshow/127921913.cms",
    "timestamp": "2026-02-05T02:23:27Z"
  },
  {
    "title": "‘How the Hell Does She Still Have a Job?’ Congressman Says Kristi Noem ‘Needs To Be Fired Today’",
    "description": "Rep. Greg Stanton blasted Homeland Security Secretary Kristi Noem and called for her immediate termination.\nThe post ‘How the Hell Does She Still Have a Job?’ Congressman Says Kristi Noem ‘Needs To Be Fired Today’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/how-the-hell-does-she-still-have-a-job-congressman-says-kristi-noem-needs-to-be-fired-today/",
    "timestamp": "2026-02-05T02:18:31Z"
  },
  {
    "title": "Trump directs 'all federal law enforcement' to find Savannah Guthrie's mother",
    "description": "President Donald Trump proclaimed on his Truth Social platform Wednesday night that he is giving top priority to resolving the kidnapping case of the mother of \"Today\" show co-host Savannah Guthrie.\"I spoke with Savannah Guthrie, and let her know that I am di…",
    "link": "https://www.rawstory.com/savannah-guthrie-2675090816/",
    "timestamp": "2026-02-05T02:17:45Z"
  },
  {
    "title": "Australian charged over death threats against President Herzog",
    "description": "Australian police charge 19-year-old for alleged online death threats against President Herzog ahead of his visit.",
    "link": "https://www.israelnationalnews.com/news/421975",
    "timestamp": "2026-02-05T02:12:23Z"
  },
  {
    "title": "Poll shows majority of Americans don’t trust Trump to support free and fair elections",
    "description": "New polling reveals that most Americans doubt President Donald Trump’s commitment to free and fair elections, with just 43% believing he supports democratic processes and 56% saying he does not. CNN analyst Harry Enten noted independents are even more skeptic…",
    "link": "https://www.rawstory.com/new-polls/",
    "timestamp": "2026-02-05T02:12:01Z"
  },
  {
    "title": "JD Vance or Marco Rubio? President Trump declines to take sides between the two in 2028 successor debate",
    "description": "President Donald Trump has avoided naming a successor for the 2028 Republican presidential race. He praised both Vice President JD Vance and Secretary of State Marco Rubio. Trump suggested the two could run together on a ticket. He noted differences in their …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jd-vance-or-marco-rubio-president-trump-declines-to-take-sides-between-the-two-in-2028-successor-debate/articleshow/127921773.cms",
    "timestamp": "2026-02-05T02:06:54Z"
  },
  {
    "title": "Furious lawmakers slam Gavin Newsom for trying to bury High Speed Rail secrets – as $215 million-a-mile fiasco deepens",
    "description": "Democratic lawmakers are scrambling to pass a bill that would hide records about the High Speed Rail from the public if they're part of an audit — which critics call a shameless attempt to conceal the shocking reality of the multibillion-dollar money pit.",
    "link": "https://nypost.com/2026/02/04/us-news/california-dems-push-ridiculous-bill-to-bury-high-speed-rail-details/",
    "timestamp": "2026-02-05T02:06:01Z"
  },
  {
    "title": "Oil slides in volatile trading as upcoming U.S.-Iran talks revive de-escalation hopes",
    "description": "Oil prices fell on Thursday after Washington and Tehran agreed to hold talks in Oman on Friday, even as differences persist over the scope of the discussions.",
    "link": "https://www.cnbc.com/2026/02/05/oil-prices-upcoming-us-iran-talks-revive-de-escalation-hopes.html",
    "timestamp": "2026-02-05T02:05:47Z"
  },
  {
    "title": "Canada expected to scrap EV mandate in favor of new fuel efficiency system, CBC News reports",
    "description": "Canada's government is set to unveil a new automotive strategy. This plan will replace the current electric vehicle mandate with updated fuel efficiency standards and credits. Sources suggest popular incentives for electric vehicle buyers may also return. Aut…",
    "link": "https://economictimes.indiatimes.com/news/international/business/canada-expected-to-scrap-ev-mandate-in-favor-of-new-fuel-efficiency-system-cbc-news-reports/articleshow/127921701.cms",
    "timestamp": "2026-02-05T02:01:17Z"
  },
  {
    "title": "Trump Says He Saved LA With National Guard and City ‘Wouldn’t Have the Olympics’ Without Him | Video",
    "description": "\"We will do it again if we have to,\" the president adds\nThe post Trump Says He Saved LA With National Guard and City ‘Wouldn’t Have the Olympics’ Without Him | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-los-angeles-national-guard-olympics-comments-nbc-nightly-news/",
    "timestamp": "2026-02-05T02:01:05Z"
  },
  {
    "title": "White House quotes Tony Soprano to defend Christopher Columbus amid reports of new statue celebrating explorer",
    "description": "White House quotes Tony Soprano to defend Christopher Columbus as reports emerge that President Donald Trump plans to install a statue of the Italian explorer on White House grounds.",
    "link": "https://www.foxnews.com/media/white-house-quotes-tony-soprano-defend-christopher-columbus-amid-reports-new-statue-celebrating-explorer",
    "timestamp": "2026-02-05T02:00:33Z"
  },
  {
    "title": "Nicki Minaj accuses California Gov. Newsom of 'trying to be Trump' in scathing interview",
    "description": "Rapper Nicki Minaj escalated her social media feud with Gov. Gavin Newsom, claiming he's obsessed with President Donald Trump and \"missing the plot\" on the issues.",
    "link": "https://www.foxnews.com/entertainment/nicki-minaj-accuses-california-gov-newsom-trying-trump-scathing-interview",
    "timestamp": "2026-02-05T02:00:22Z"
  },
  {
    "title": "Gold rises over 1% as geopolitical, economic tensions lift precious metals",
    "description": "On Thursday, gold prices experienced a remarkable rise, approaching their recent peak levels due to escalating global tensions. Meanwhile, silver and palladium also enjoyed some upward momentum. Investors are keenly awaiting potential interest rate cuts from …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-rises-over-1-as-geopolitical-economic-tensions-lift-precious-metals/articleshow/127921708.cms",
    "timestamp": "2026-02-05T01:58:25Z"
  },
  {
    "title": "'All of this for what?' WSJ gives Trump a brutal economics lesson",
    "description": "The Wall Street Journal editorial board took a bird's-eye assessment of President Donald Trump's tariff system on Wednesday and concluded the effects have overwhelmingly damaged the U.S. economy, American businesses, and American workers.This follows Trump pr…",
    "link": "https://www.rawstory.com/wsj-tariffs-2675090692/",
    "timestamp": "2026-02-05T01:57:16Z"
  },
  {
    "title": "White House confirms Dodgers will attend World Series ceremony",
    "description": "The decision came amid calls for the team to scrap the traditional visit during ongoing ICE activity in Los Angeles.",
    "link": "https://nypost.com/2026/02/04/us-news/white-house-confirms-dodgers-will-attend-world-series-ceremony/",
    "timestamp": "2026-02-05T01:57:11Z"
  },
  {
    "title": "Dollar recovers as central bank decisions loom",
    "description": "In a day filled with anticipation, global financial markets are keeping a close watch on central bank decisions. The U.S. dollar is maintaining its course as investors hold their breath for rate announcements from the European Central Bank and the Bank of Eng…",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/dollar-recovers-as-central-bank-decisions-loom/articleshow/127921698.cms",
    "timestamp": "2026-02-05T01:56:13Z"
  },
  {
    "title": "'TODAY' co-anchor Savannah Guthrie and family make tearful plea for mother’s return",
    "description": "In a tearful video posted on Instagram, “TODAY” co-anchor Savannah Guthrie on Wednesday pleaded for more information from her 84-year-old mother’s possible kidnapper, saying her family is “ready to talk.”Savannah Guthrie — reading from prepared remarks, speak…",
    "link": "https://www.nbcnews.com/news/us-news/savannah-guthrie-mother-plea-rcna257511",
    "timestamp": "2026-02-05T01:56:02Z"
  },
  {
    "title": "Canada to Scrap Electric Vehicle Rules in Win for Automakers",
    "description": "Canadian Prime Minister Mark Carney is set to announce a new system of fuel-efficiency standards for cars and trucks, replacing an electric vehicle mandate that was hated by the auto industry.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-to-scrap-electric-vehicle-rules-in-win-for-automakers",
    "timestamp": "2026-02-05T01:55:11Z"
  },
  {
    "title": "Relations with US ‘rock solid,’ Taiwan president says after Trump-Xi call",
    "description": "TAIPEI, Feb 5 (Reuters) - Relations between Taiwan and the U.S. are “rock-solid” and cooperation programmes will continue and not change, Taiwan President Lai Ching-te sa… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/relations-with-us-rock-solid-taiwan-president-says-after-trump-xi-call",
    "timestamp": "2026-02-05T01:54:22Z"
  },
  {
    "title": "FBI arrests 55 in massive drug ring with alleged China supplier flooding US streets with fentanyl",
    "description": "FBI arrests 55 people in major Georgia drug trafficking ring accused of flooding streets with fentanyl, linked to China supplier in sweeping takedown.",
    "link": "https://www.foxnews.com/us/fbi-arrests-55-massive-drug-ring-alleged-china-supplier-flooding-us-streets-fentanyl",
    "timestamp": "2026-02-05T01:53:48Z"
  },
  {
    "title": "Courts are about to unleash a 'tsunami' against Trump: Conservative ex-judge",
    "description": "President Donald Trump's administration is about to face a \"tsunami\" from the federal court system, one former judge said on Wednesday.Since Trump's second term began last January, officials and lawyers representing the administration have consistently ignore…",
    "link": "https://www.rawstory.com/trump-2675090777/",
    "timestamp": "2026-02-05T01:52:46Z"
  },
  {
    "title": "Trump declines to take sides between Vance, Rubio in 2028 successor debate",
    "description": "By Steve Holland WASHINGTON, Feb 4 (Reuters) - President Donald Trump on Wednesday declined to take sides in the debate over whether his vice president, JD...",
    "link": "https://www.yahoo.com/news/articles/trump-declines-sides-between-vance-015022187.html",
    "timestamp": "2026-02-05T01:50:22Z"
  },
  {
    "title": "Iran and US agree to hold nuclear talks Friday in Oman as Trump delivers blunt warning to Khamenei",
    "description": "Iran’s Foreign Minister Abbas Araghchi has confirmed that Iran and the United States will hold nuclear talks in Oman’s capital, Muscat, on Friday",
    "link": "https://abcnews.go.com/International/wireStory/iran-us-agree-hold-nuclear-talks-friday-oman-129846589",
    "timestamp": "2026-02-05T01:49:20Z"
  },
  {
    "title": "Trump Endorses Prosecutor, Military Vet to Fill MTG’s Seat in Georgia’s 14th District",
    "description": "President Donald Trump has endorsed Clay Fuller, a prosecutor and Air National Guard officer, for Georgia’s 14th Congressional District seat, to fill the vacancy left by former Rep. Marjorie Taylor Greene, whose resignation took effect last month.\nThe post Tr…",
    "link": "https://www.breitbart.com/politics/2026/02/04/trump-endorses-prosecutor-military-vet-fill-mtgs-seat-georgia-14th-district/",
    "timestamp": "2026-02-05T01:42:29Z"
  },
  {
    "title": "President Donald Trump endorses Blake Miguez to fill Julia Letlow’s seat in Congress",
    "description": "WASHINGTON – President Donald Trump endorsed Louisiana state Sen. Blake Miguez’s campaign for Congress in a Wednesday night post on Truth Social.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/donald-trump-blake-miguez-louisiana-congress/article_72150812-9e31-5976-bb09-4285896f4114.html",
    "timestamp": "2026-02-05T01:42:00Z"
  },
  {
    "title": "Oil Declines After Iran Confirms US Negotiations Set for Friday",
    "description": "Oil fell for the first time in three days after Iran confirmed it would hold negotiations with the US, easing the immediate risk of military strikes against the OPEC producer.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-declines-after-iran-confirms-us-negotiations-set-for-friday",
    "timestamp": "2026-02-05T01:39:59Z"
  },
  {
    "title": "Ex-Fox News host suspects 'somebody got to Trump' after eyebrow-raising admission",
    "description": "The eye-popping comments President Donald Trump made during an interview on Wednesday show that somebody inside the White House has gotten to him, according to a former Fox News anchor. Trump gave an interview to NBC News on Wednesday, in which he acknowledge…",
    "link": "https://www.rawstory.com/trump-2675090741/",
    "timestamp": "2026-02-05T01:39:42Z"
  },
  {
    "title": "Zeldin, Loeffler bring hope to California — and a warning",
    "description": "The EPA and SBA chiefs were in Pacific Palisades on their first visit to carry out President Donald Trump’s executive order on rebuilding the community.",
    "link": "https://nypost.com/2026/02/04/opinion/trump-is-keeping-his-palisades-promise/",
    "timestamp": "2026-02-05T01:34:47Z"
  },
  {
    "title": "Man convicted of attempting to assassinate Trump sentenced to life in prison",
    "description": "FORT PIERCE, Florida: Ryan Routh, the man accused of hiding in the bushes of a Florida golf course with a semi-automatic rifle to try to assassinate Donald Trump less than two months before the 2024 US election that returned him to the presidency, was sentenc…",
    "link": "https://www.channelnewsasia.com/world/man-attempting-assassinate-trump-sentenced-life-in-prison-ryan-routh-5908581",
    "timestamp": "2026-02-05T01:33:05Z"
  },
  {
    "title": "Don't boo the Americans, Olympics boss tells spectators",
    "description": "Hundreds of demonstrators have gathered in Milan in recent days to protest against the deployment of US Immigration and Customs Enforcement staff at the Games.",
    "link": "https://news.sky.com/story/winter-olympics-show-respect-rather-than-jeer-the-americans-says-ioc-boss-13503461",
    "timestamp": "2026-02-05T01:31:00Z"
  },
  {
    "title": "Hochul primary challenger picks democratic socialist, once arrested for harassment, as running mate",
    "description": "New York Lt. Gov. Antonio Delgado picks Democratic Socialist India Walton as running mate in battle against Gov. Kathy Hochul in Democratic primary.",
    "link": "https://www.foxnews.com/politics/hochul-primary-challenger-picks-democratic-socialist-once-arrested-harassment-running-mate",
    "timestamp": "2026-02-05T01:29:32Z"
  },
  {
    "title": "Trump backs MAGA prosecutor in race to fill Marjorie Taylor Greene’s seat",
    "description": "Feb 4 (Reuters) - President Donald Trump on Wednesday endorsed a conservative local prosecutor in a Georgia special election to replace Marjorie Taylor Greene, who resign… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-backs-maga-prosecutor-in-race-to-fill-marjorie-taylor-greene-s-seat",
    "timestamp": "2026-02-05T01:26:22Z"
  },
  {
    "title": "Zeldin slams Newsom, says his daily shots at Trump are hurting fire victims",
    "description": "President Trump's fire fixer Lee Zeldin called out Gavin Newsom, making it clear he's hurting fire victims by hurling daily insults at the president.",
    "link": "https://nypost.com/2026/02/04/us-news/zeldin-slams-newsom-says-his-daily-shots-at-trump-are-hurting-fire-victims/",
    "timestamp": "2026-02-05T01:21:33Z"
  },
  {
    "title": "Crude Oil Prices Fall After Two Days Of Advance As Iran Confirms US Talks",
    "description": "Futures for Brent, the global benchmark, for April settlement closed 3.2% higher at $69.46 a barrel on Wednesday.",
    "link": "https://www.ndtvprofit.com/markets/crude-oil-prices-fall-after-two-days-of-advance-as-iran-confirms-us-talks-10948920",
    "timestamp": "2026-02-05T01:17:06Z"
  },
  {
    "title": "Fact-checking Trump's interview with NBC News",
    "description": "Trump made several false or misleading claims on topics ranging from the economy to immigration to elections during an Oval Office interview with NBC News’ Tom Llamas.",
    "link": "https://www.nbcnews.com/politics/donald-trump/fact-check-trump-interview-nbc-news-rcna257084",
    "timestamp": "2026-02-05T01:12:02Z"
  },
  {
    "title": "Trump says his unpredictable style gives him leverage. But it has a cost.",
    "description": "President Trump's unpredictable negotiating style, characterized by abrupt shifts and demands, is causing allies and adversaries to question his reliability. This approach, driven by electoral anxieties rather than strategic dealmaking, has led to strained re…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-his-unpredictable-style-gives-him-leverage-but-it-has-a-cost-/articleshow/127921438.cms",
    "timestamp": "2026-02-05T01:10:09Z"
  },
  {
    "title": "Pentagon Not Doing Very Well In Mark Kelly Case With The Judge",
    "description": "A federal judge seems inclined to rule in favor of Democratic Arizona Senator Mark Kelly, who claims the Pentagon is infringing on his freedom of speech by attempting to discipline him for encouraging U.S. military personnel to disobey unlawful commands. \nAt …",
    "link": "https://crooksandliars.com/2026/02/pentagon-not-doing-very-well-mark-kelly",
    "timestamp": "2026-02-05T01:09:27Z"
  },
  {
    "title": "Trump Dials Back on Warner Bros.-Netflix Deal Influence: ‘I Shouldn’t Be Involved’",
    "description": "The president's NBC News comments Wednesday contrast with what he said before the new year\nThe post Trump Dials Back on Warner Bros.-Netflix Deal Influence: ‘I Shouldn’t Be Involved’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/industry-news/deals-ma/trump-warner-bros-netflix-deal-nbc-news-interview/",
    "timestamp": "2026-02-05T01:07:09Z"
  },
  {
    "title": "EPA rollback wipes out 100 years of public health protections overnight - NewsBreak",
    "description": "Over a single week in January, the federal government quietly rewrote how the United States values clean air and water. A cluster of decisions from Preside",
    "link": "https://www.newsbreak.com/share/4474474852211-epa-rollback-wipes-out-100-years-of-public-health-protections-overnight?s=a2&amp;share_destination_id=NjM4NTQxMzMtMTc3MDI1MzMxMjg5NA%3D%3D&amp;pd=04JvNNa0&amp;hl=en_US&amp;send_time=1770253312&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.4.1%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-02-05T01:05:00Z"
  },
  {
    "title": "Jeff Bezos remains committed to Washington Post amid brutal layoffs, top editor Matt Murray says",
    "description": "Washington Post owner Jeff Bezos remains committed to the publication, its top editor told CNN in an interview Wednesday, hours after the Post laid off hundreds of employees.",
    "link": "https://www.cnn.com/2026/02/04/media/jeff-bezos-matt-murray-washington-post-layoffs",
    "timestamp": "2026-02-05T01:04:45Z"
  },
  {
    "title": "Trump might have lost the political plot — but here’s how he can still win the midterms",
    "description": "Donald Trump did not win the 2024 election because America suddenly became meaningfully more Republican.",
    "link": "https://nypost.com/2026/02/04/opinion/trump-might-have-lost-the-political-plot-but-heres-how-he-can-still-win-the-midterms/",
    "timestamp": "2026-02-05T01:03:08Z"
  },
  {
    "title": "The “Melania” Documentary Offers an Intimate Look at Very Little",
    "description": "On The Political Scene Podcast, The circumstances of the movie’s production and release are revealing. The film itself is far less so.",
    "link": "https://www.newyorker.com/podcast/political-scene/the-melania-documentary-offers-an-intimate-look-at-very-little",
    "timestamp": "2026-02-05T01:00:00Z"
  },
  {
    "title": "Trump Says He Will Accept the 2026 Midterm Results ‘If the Elections Are Honest’",
    "description": "President Donald Trump said he would accept the results of the midterms “if the elections are honest,” telling NBC’s Tom Llamas on Wednesday that if that proves not to be the case, “something else has to happen.” Trump spoke to Llamas in a pre-Super Bowl inte…",
    "link": "https://www.mediaite.com/media/news/trump-says-he-will-accept-the-2026-midterm-results-if-the-elections-are-honest/",
    "timestamp": "2026-02-05T00:58:59Z"
  },
  {
    "title": "LA Mayor Sidesteps Calls For Casey Wasserman’s Olympics Resignation After Epstein Files Revelations; IOC Brass Still Has “Full Trust” In LA28 Chief",
    "description": "Casey Wasserman still has the support of Karen Bass and the International Olympics Committee to stay in charge of LA28, for now. IOC Executive Board member Nicole Hoevertsz said on February 3 in Italy that the increasingly besieged Wasserman and his “entire t…",
    "link": "http://deadline.com/2026/02/epstein-files-casey-wasserman-karen-bass-2028-olympics-1236709254/",
    "timestamp": "2026-02-05T00:55:04Z"
  },
  {
    "title": "Chinese national who exposed rights abuses is freed from US detention after being granted asylum",
    "description": "Guan Heng, a Chinese asylum seeker who exposed human rights abuses in his homeland, has been released after more than five months in federal detention",
    "link": "https://abcnews.go.com/Politics/wireStory/chinese-national-exposed-rights-abuses-freed-us-detention-129867068",
    "timestamp": "2026-02-05T00:53:49Z"
  },
  {
    "title": "Epstein files rife with uncensored nudes and victims' names, despite redaction efforts",
    "description": "Nude photos. The names and faces of sexual abuse victims. Bank account and Social Security numbers in full view.  All of these things appeared in the mountain of documents released publicly by the U.S. Justice Department as part of its effort to comply with a…",
    "link": "https://japantoday.com/category/world/epstein-files-rife-with-uncensored-nudes-and-victims%27-names-despite-redaction-efforts",
    "timestamp": "2026-02-05T00:48:29Z"
  },
  {
    "title": "Asian stocks fall after tech selloff, gold gains",
    "description": "Asian stocks mirrored Wall Street's tech sell-off, with South Korea's Kospi leading losses amid concerns over high valuations and spending. While tech giants like Alphabet and Arm Holdings saw declines, futures for US gauges rose, suggesting easing selling pr…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-after-tech-selloff-gold-gains/articleshow/127921310.cms",
    "timestamp": "2026-02-05T00:44:11Z"
  },
  {
    "title": "Donald Trump Now Says He “Shouldn’t Be Involved” In DOJ Review Of A Netflix Or Paramount Acquisition Of Warner Bros.",
    "description": "Donald Trump told NBC Nightly News anchor Tom Llamas that he has decided that he “shouldn’t be involved” in his administration’s review of the Netflix-Warner Bros. merger or if Paramount succeeds in its hostile bid. “I haven’t been involved,” Trump said in th…",
    "link": "http://deadline.com/2026/02/trump-netflix-warner-bros-paramount-merger-1236709602/",
    "timestamp": "2026-02-05T00:41:34Z"
  },
  {
    "title": "'Unreliable' Trump is 'starting to wear' on his allies — who are now turning away: report",
    "description": "President Donald Trump's \"mercurial\" and \"unreliable\" negotiation style is starting to wear on his allies, according to a new report. Trump has consistently claimed that his unpredictability was one of his negotiation tactics that helped him get the upper han…",
    "link": "https://www.rawstory.com/trump-2675090576/",
    "timestamp": "2026-02-05T00:38:58Z"
  },
  {
    "title": "Nike faces federal probe over allegations of ‘DEI-related’ discrimination against white workers",
    "description": "Nike called the subpoena a surprising escalation.",
    "link": "https://www.denverpost.com/2026/02/04/nike-discrimination-complaint/",
    "timestamp": "2026-02-05T00:38:54Z"
  },
  {
    "title": "Nike faces federal probe over allegations of ‘DEI-related’ discrimination against white workers",
    "description": "Nike called the subpoena a surprising escalation.",
    "link": "https://www.bostonherald.com/2026/02/04/nike-discrimination-complaint/",
    "timestamp": "2026-02-05T00:38:54Z"
  },
  {
    "title": "What to know about the congressional fight over ICE restrictions",
    "description": "Democrats say they're unified in forcing the issue amid public backlash.",
    "link": "https://abcnews.go.com/Politics/congressional-fight-ice-restrictions-government-shutdown/story?id=129856318",
    "timestamp": "2026-02-05T00:36:24Z"
  },
  {
    "title": "‘Do You Believe That Stuff?’ Tom Llamas Asks Trump if He Really Buys Wild Rigged Election Claims",
    "description": "NBC Nightly News anchor Tom Llamas confronted President Donald Trump about wild claims regarding the 2020 election, which Trump falsely said was rigged.\nThe post ‘Do You Believe That Stuff?’ Tom Llamas Asks Trump if He Really Buys Wild Rigged Election Claims …",
    "link": "https://www.mediaite.com/media/tv/do-you-believe-that-stuff-tom-llamas-asks-trump-if-he-really-buys-his-own-wild-rigged-election-claims/",
    "timestamp": "2026-02-05T00:35:34Z"
  },
  {
    "title": "Elizabeth Warren Says Bezos Slashed Washington Post Staff to ‘Suck Up’ to Trump | Video",
    "description": "The Democratic senator from Massachusetts tells Don Lemon days after his arrest that the president is “going after journalism everywhere”\nThe post Elizabeth Warren Says Bezos Slashed Washington Post Staff to ‘Suck Up’ to Trump | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/media-platforms/journalism/elizabeth-warren-washington-post-cuts-trump/",
    "timestamp": "2026-02-05T00:35:12Z"
  },
  {
    "title": "Nike faces probe over alleged 'DEI-related' discrimination against white workers",
    "description": "The federal agency for protecting workers’ civil rights revealed Wednesday that it is investigating sportswear giant Nike for allegedly discriminating against white employees through its diversity policies",
    "link": "https://abcnews.go.com/Business/wireStory/nike-faces-federal-probe-allegations-dei-related-discrimination-129867069",
    "timestamp": "2026-02-05T00:31:55Z"
  },
  {
    "title": "Investigators return to Nancy Guthrie's home as search for NBC host's mother continues",
    "description": "Investigators swarmed Nancy Guthrie's home on Wednesday. They brought in K-9s and put up crime scene tape around the property. It's unclear why they have returned to the home.",
    "link": "https://www.foxnews.com/us/investigators-return-nancy-guthries-home-search-nbc-hosts-mother-continues",
    "timestamp": "2026-02-05T00:30:28Z"
  },
  {
    "title": "Savannah Guthrie pleads with mother Nancy's captors in heartbreaking video: 'We are ready to talk'",
    "description": "Investigators swarmed Nancy Guthrie's home on Wednesday. They brought in K-9s and put up crime scene tape around the property. It's unclear why they have returned to the home.",
    "link": "https://www.foxnews.com/us/savannah-guthrie-pleads-mother-nancys-captors-heartbreaking-video-we-ready-talk",
    "timestamp": "2026-02-05T00:30:28Z"
  },
  {
    "title": "Paperwork underway to unlock India–US trade deal potential soon: Piyush Goyal",
    "description": "Both sides would now work towards completing the technical details and finalising the paperwork for the trade deal so as to expeditiously unlock its potential, Goyal informed Parliament.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/paperwork-underway-to-unlock-indiaus-trade-deal-potential-soon-piyush-goyal/articleshow/127918123.cms",
    "timestamp": "2026-02-05T00:30:00Z"
  },
  {
    "title": "Republican gathering goes off the rails as 'witch' casts spell: 'Cancel that curse!'",
    "description": "A gathering of local Minnesota Republican Party officials went off the rails this week after a self-described \"witch\" trolled their meeting by placing a \"curse\" on them — and the Republicans in attendance appeared to take it at least somewhat seriously.Accord…",
    "link": "https://www.rawstory.com/minnesota-gop-2675090442/",
    "timestamp": "2026-02-05T00:15:22Z"
  },
  {
    "title": "U.S. Spy Chief's Office Investigated Voting Machines In Puerto Rico",
    "description": "Sources said the goal was to work with the FBI to investigate claims that Venezuela had hacked voting machines in Puerto Rico, but found no clear evidence.",
    "link": "https://www.huffpost.com/entry/spy-chief-tulsi-gabbard-voting-machines-puerto-rico_n_6983de71e4b04d5037edc028",
    "timestamp": "2026-02-05T00:15:11Z"
  },
  {
    "title": "Trump says he's staying out of the fight between Netflix and Paramount to take over Warner Bros. Discovery",
    "description": "President Donald Trump said Netflix and Paramount Skydance have called him about Warner Bros. Discovery but said he's not getting involved.",
    "link": "https://www.businessinsider.com/trump-says-staying-out-netflix-paramount-fight-warners-bros-discovery-2026-2",
    "timestamp": "2026-02-05T00:14:33Z"
  },
  {
    "title": "Trump on Shooting Deaths by Federal Agents: ICE ‘Feels Worse About It Than Anybody’",
    "description": "President Donald Trump claimed that immigration agents feel \"worse\" about last month's shooting deaths by immigration agents \"than anybody.\" \nThe post Trump on Shooting Deaths by Federal Agents: ICE ‘Feels Worse About It Than Anybody’ first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/tv/trump-on-shooting-deaths-by-federal-agents-ice-feels-worse-about-it-than-anybody/",
    "timestamp": "2026-02-05T00:11:39Z"
  },
  {
    "title": "Trump talks Minneapolis, Joe Rogan, the Fed, AI and 2028 in a wide-ranging interview",
    "description": "President Donald Trump said Wednesday that he hopes to push his immigration crackdown into five more cities, previewing an ongoing and growing footprint for federal agents around the country.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-minneapolis-joe-rogan-fed-ai-2028-interview-rcna256641",
    "timestamp": "2026-02-05T00:08:40Z"
  },
  {
    "title": "Trump says he'll stay out of Netflix, Paramount Skydance fight to take over WBD",
    "description": "Trump in December said he would be involved in the review of whether Netflix should be allowed to buy parts of Warner Bros. Discover, as WBD leadership wants.",
    "link": "https://www.cnbc.com/2026/02/04/trump-wbd-netflix-paramount-skydance.html",
    "timestamp": "2026-02-05T00:04:39Z"
  },
  {
    "title": "Davos, climate talk and familiar burden on the poor",
    "description": "Davos climate talks often ignore the true cost. Explore the climate injustice faced by developing nations who pay the price for the Global North’s emission\n\nRead More: https://punchng.com/davos-climate-talk-and-familiar-burden-on-the-poor/",
    "link": "https://punchng.com/davos-climate-talk-and-familiar-burden-on-the-poor/",
    "timestamp": "2026-02-05T00:03:57Z"
  },
  {
    "title": "American women have a terrifying new flirtation",
    "description": "The rise of “punitive femininity” means that punishing someone for holding different views becomes a moral good.",
    "link": "https://nypost.com/2026/02/04/opinion/why-americas-women-are-flirting-with-political-violence/",
    "timestamp": "2026-02-05T00:03:00Z"
  },
  {
    "title": "Trump Is Dragging World Toward a New Nuclear Arms Race",
    "description": "Among the critical issues facing our country today, nuclear arms control is seldom top of mind for most people, understandably, given our myriad political, social and economic crises. Recent books and films such as Annie Jacobsen’s 2004 non-fiction tome Nucle…",
    "link": "https://original.antiwar.com/kevin-martin/2026/02/04/trump-is-dragging-world-toward-a-new-nuclear-arms-race/",
    "timestamp": "2026-02-05T00:00:23Z"
  },
  {
    "title": "American Optimism on Financial Security Is Increasing Under Trump, Poll Finds",
    "description": "Pollster Scott Rasmussen of the Napolitan Institute told reporters on Wednesday that American’s optimism on their personal financial situation under President Donald Trump is increasing.... Read More\nThe post American Optimism on Financial Security Is Increas…",
    "link": "https://www.dailysignal.com/2026/02/04/american-optimism-on-financial-security-is-increasing-under-trump-poll-finds/",
    "timestamp": "2026-02-05T00:00:00Z"
  },
  {
    "title": "Carrot & Slick: India readies to hike US oil buys",
    "description": "India's oil ministry and state-run companies are preparing for a significant increase in US crude oil and natural gas imports, aiming to boost bilateral trade. This strategic shift comes as Russian supplies are expected to decrease, with Indian refiners likel…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/carrot-slick-india-readies-to-hike-us-oil-buys/articleshow/127918179.cms",
    "timestamp": "2026-02-05T00:00:00Z"
  },
  {
    "title": "Donald Trump’s Struggling Approval Rating Could Get Worse",
    "description": "[Subscription Required] Hoover Institution fellow Daron Shaw said, \"The president faces two difficult obstacles—the virtually unanimous and intractable opposition of Democrats and the stubbornness of high prices.\"",
    "link": "https://www.newsweek.com/donald-trump-approval-get-worse-nate-silver-11463131",
    "timestamp": "2026-02-05T00:00:00Z"
  },
  {
    "title": "White House Deploys All-Time ‘Sopranos’ Quote To Defend Christopher Columbus Statue",
    "description": "The White House used an iconic \"Sopranos\" line Wednesday to defend President Donald Trump’s plan to install a Christopher Columbus statue on White House grounds.",
    "link": "https://dailycaller.com/2026/02/04/white-house-sopranos-quote-defend-christopher-columbus-statue/",
    "timestamp": "2026-02-04T23:57:03Z"
  },
  {
    "title": "VP Vance to lead California anti-fraud task force: report",
    "description": "The move, set to be finalized by an executive order in the coming days, puts the VP at the helm of the crackdown on welfare abuses as chairman of the task force, multiple sources told CBS News.",
    "link": "https://nypost.com/2026/02/04/us-news/vp-vance-to-lead-california-anti-fraud-task-force-report/",
    "timestamp": "2026-02-04T23:54:24Z"
  },
  {
    "title": "US, Iran to hold talks in Oman on Friday",
    "description": "Despite disagreements over the possible agenda, US and Iranian officials confirmed that the countries will hold talks in Oman. Iranian and US officials confirmed on Wednesday that a meeting between their countries would be held in Muscat, the capital of Oman,…",
    "link": "https://www.dw.com/en/us-iran-to-hold-talks-in-oman-on-friday/a-75811679",
    "timestamp": "2026-02-04T23:54:00Z"
  },
  {
    "title": "Epstein files rife with uncensored nudes and victims’ names, despite redaction efforts",
    "description": "That law was intended to preserve important privacy protections for Epstein’s victims.",
    "link": "https://www.denverpost.com/2026/02/04/justice-department-epstein-privacy/",
    "timestamp": "2026-02-04T23:48:08Z"
  },
  {
    "title": "Epstein files rife with uncensored nudes and victims’ names, despite redaction efforts",
    "description": "That law was intended to preserve important privacy protections for Epstein’s victims.",
    "link": "https://www.bostonherald.com/2026/02/04/justice-department-epstein-privacy/",
    "timestamp": "2026-02-04T23:48:08Z"
  },
  {
    "title": "Joe Scarborough warns GOP James Comer just set a subpoena trap for Donald Trump",
    "description": "MSNBC’s Joe Scarborough warned Republicans that House Oversight Chair James Comer may have spectacularly hoisted his own party on its petard by forcing Bill and Hillary Clinton to testify about Jeffrey Epstein. On Morning Joe, Scarborough said Comer’s move al…",
    "link": "https://www.rawstory.com/james-comer-2675082880/",
    "timestamp": "2026-02-04T23:45:01Z"
  },
  {
    "title": "Exclusive-US spy chief's office investigated voting machines in Puerto Rico",
    "description": "WASHINGTON, Feb 4 (Reuters) - A team ‌working for President Donald Trump's spy chief, Tulsi Gabbard, last spring led an investigation into Puerto Rico's voting machines, said Gabbard's office and three sources familiar with the previously ‌unreported events. …",
    "link": "https://www.thestar.com.my/news/world/2026/02/05/exclusive-us-spy-chief039s-office-investigated-voting-machines-in-puerto-rico",
    "timestamp": "2026-02-04T23:45:00Z"
  },
  {
    "title": "Puerto Ricans are jazzed for Bad Bunny’s Spanish-language Super Bowl performance. They’re not the only ones. | CNN",
    "description": "When Bad Bunny takes the Super Bowl stage on Sunday, he will be making history as the first Spanish-language artist to headline the halftime show.",
    "link": "https://www.cnn.com/2026/02/04/entertainment/bad-bunny-super-bowl-halftime-spanish",
    "timestamp": "2026-02-04T23:44:43Z"
  },
  {
    "title": "Islamic militants kill 162 in multiple Nigerian village attacks, lawmaker says",
    "description": "Armed extremists killed at least 162 people during attacks on two villages in western Nigeria, a lawmaker said Wednesday, in one of the deadliest assaults in recent months.",
    "link": "https://nypost.com/2026/02/04/world-news/islamic-militants-kill-162-in-multiple-nigerian-village-attacks-lawmaker-says/",
    "timestamp": "2026-02-04T23:43:50Z"
  },
  {
    "title": "'This Occupation Has to End!' Omar Argues After Homan Says Most Agents Will Stay in Minnesota",
    "description": "President Donald Trump's \"border czar,\" Tom Homan, announced Wednesday that 700 immigration agents are leaving Minnesota, but with around 2,000 expected to remain there, Democratic Congresswoman Ilhan Omar, whose district includes Minneapolis, declared that t…",
    "link": "https://www.commondreams.org/news/minnesota-ice",
    "timestamp": "2026-02-04T23:39:40Z"
  },
  {
    "title": "Exclusive-US spy chief’s office investigated voting machines in Puerto Rico",
    "description": "By Phil Stewart, Erin Banco and Jonathan LandayWASHINGTON, Feb 4 (Reuters) - A team working for President Donald Trump’s spy chief, Tulsi Gabbard, last spring led an inve… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/exclusive-us-spy-chief-s-office-investigated-voting-machines-in-puerto-rico",
    "timestamp": "2026-02-04T23:37:51Z"
  },
  {
    "title": "Trump Says Iran’s Supreme Leader Khamenei ‘Should Be Very Worried’ as Nuclear Talks Loom",
    "description": "President Donald Trump warned Wednesday that Iran’s Supreme Leader Ali Khamenei “should be very worried” as U.S.–Iran nuclear talks, earlier reported as collapsing, are now set to proceed Friday in Oman amid sharp disputes over the scope of negotiations and r…",
    "link": "https://www.breitbart.com/politics/2026/02/04/trump-says-irans-supreme-leader-khamenei-should-be-very-worried-as-nuclear-talks-loom/",
    "timestamp": "2026-02-04T23:36:07Z"
  },
  {
    "title": "'Can you shut him up?' House Democrats clash with Bessent in fiery hearing",
    "description": "'Can you shut him up?' House Democrats clash with Bessent in fiery hearinggo.com",
    "link": "https://abcnews.go.com/Politics/shut-house-democrats-clash-bessent-fiery-hearing/story?id=129859858",
    "timestamp": "2026-02-04T23:35:22Z"
  },
  {
    "title": "Nude photos and potential victims exposed in Epstein files",
    "description": "Nude photos. The names and faces of sexual abuse victims. Bank account and Social Security numbers in full view. All of these things appeared in the mountain of documents released publicly by the U.S. Justice Department as part of its effort to comply with a …",
    "link": "https://apnews.com/article/jeffrey-epstein-files-28a28aeebcfd49890e0810eb69992724",
    "timestamp": "2026-02-04T23:35:04Z"
  },
  {
    "title": "US to open $537m consulate in Lagos 2028",
    "description": "The US is building the world’s largest US consulate in Lagos for $537m. Set to open in 2028, it will create 2,500 local jobs and boost the economy.\n\nRead More: https://punchng.com/us-to-open-537m-consulate-in-lagos-2028-2/",
    "link": "https://punchng.com/us-to-open-537m-consulate-in-lagos-2028-2/",
    "timestamp": "2026-02-04T23:35:03Z"
  },
  {
    "title": "Australia charges teenager over alleged death threats to Israeli President Herzog",
    "description": "SYDNEY, Feb 5 (Reuters) - An Australian teenager has been charged for allegedly making online death threats against Israeli President Isaac Herzog, ahead of his upcoming … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/australia-charges-teenager-over-alleged-death-threats-to-israeli-president-herzog",
    "timestamp": "2026-02-04T23:32:49Z"
  },
  {
    "title": "U.S. Confirms Deployment of ‘Small Team’ to Nigeria",
    "description": "U.S. Africa Command (AFRICOM) said on Tuesday that a small number of American military officers have been deployed to Nigeria to assist with counter-terrorism efforts.\nThe post U.S. Confirms Deployment of ‘Small Team’ to Nigeria appeared first on Breitbart.",
    "link": "https://www.breitbart.com/africa/2026/02/04/u-s-confirms-deployment-of-small-team-to-nigeria/",
    "timestamp": "2026-02-04T23:32:36Z"
  },
  {
    "title": "JD Vance Blasts 'Incestuous' Elites In Epstein Files But Won't Address Trump's Thousands Of Mentions",
    "description": "The vice president claimed that Trump, who is mentioned thousands of times in the new files, is \"very much outside of the social circle.\"",
    "link": "https://www.huffpost.com/entry/jd-vance-defends-trump-incestuous-elites-new-epstein-files_n_69837872e4b053ac3e16b20f",
    "timestamp": "2026-02-04T23:30:52Z"
  },
  {
    "title": "Trump says he'll stay out of the Netflix-Paramount fight over Warner Bros.",
    "description": "President Donald Trump said he plans to stay out of Netflix and Paramount Skydance’s battle over Warner Bros.",
    "link": "https://www.nbcnews.com/business/media/trump-netflix-paramount-fight-warner-bros-rcna257476",
    "timestamp": "2026-02-04T23:30:06Z"
  },
  {
    "title": "34 Sets of Brothers Who Have Made it to the NFL Together",
    "description": "From players to coaches, there are numerous brothers who have competed alongside — and often against — one another in the NFL throughout the years",
    "link": "https://people.com/siblings-who-have-competed-in-the-nfl-11898506",
    "timestamp": "2026-02-04T23:30:00Z"
  },
  {
    "title": "Why the Trump administration holding up Hudson tunnel funding is a lose-lose for everyone",
    "description": "President Donald Trump may be a shrewd negotiator, but holding the new Hudson River rail tunnel hostage isn’t particularly smart — it’s petty.",
    "link": "https://nypost.com/2026/02/04/opinion/why-the-trump-administration-holding-up-hudson-tunnel-funding-is-a-lose-lose-for-everyone/",
    "timestamp": "2026-02-04T23:27:27Z"
  },
  {
    "title": "Khelif willing to take sex test for 2028 Olympics",
    "description": "Algerian boxer Imane Khelif says she would take a sex test if it allowed her to compete at the 2028 Olympic Games.",
    "link": "https://www.bbc.com/sport/boxing/articles/c8rm7kxe8klo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2026-02-04T23:26:59Z"
  },
  {
    "title": "Khelif willing to take sex test for 2028 Olympics",
    "description": "Algerian boxer Imane Khelif says she would take a sex test if it allowed her to compete at the 2028 Olympic Games.",
    "link": "https://www.bbc.com/sport/boxing/articles/c8rm7kxe8klo",
    "timestamp": "2026-02-04T23:26:55Z"
  }
]