[
  {
    "title": "Florida radio station triples ratings after ‘Trump Country’ rebrand",
    "description": "Fort Myers country radio station WHEL saw significant audience growth after rebranding as Trump Country 93.7 FM with Trump impersonator promotions and themed content.",
    "link": "https://www.foxnews.com/media/florida-radio-station-triples-ratings-after-trump-country-rebrand",
    "timestamp": "2025-09-10T10:30:34Z"
  },
  {
    "title": "Despite Tesla Volatility And Declining Popularity, Elon Musk Remains America’s Richest Person",
    "description": "It’s the fourth consecutive year at the top of The Forbes 400 for the wealthiest billionaire in the U.S.—and the world.",
    "link": "https://www.forbes.com/sites/johnhyatt/2025/09/10/despite-tesla-volatility-and-declining-popularity-elon-musk-remains-americas-richest-person/",
    "timestamp": "2025-09-10T10:30:00Z"
  },
  {
    "title": "Jared Kushner’s New Startup Helps Businesses Figure Out How To Use AI",
    "description": "Kushner teamed up with prolific solo investor Elad Gil and Luis Videgaray, the former Mexican foreign minister, to launch Brain Co., which helps businesses and governments apply AI to their operations.",
    "link": "https://www.forbes.com/sites/giacomotognini/2025/09/10/jared-kushners-new-startup-helps-businesses-figure-out-how-to-use-ai/",
    "timestamp": "2025-09-10T10:30:00Z"
  },
  {
    "title": "US President Donald Trump’s alleged signature on note to Jeffrey Epstein to be analysed",
    "description": "US President Donald Trump’s alleged signature on note to Jeffrey Epstein to be analysed7news.com.au",
    "link": "https://7news.com.au/news/us-president-donald-trumps-alleged-signature-on-note-to-jeffrey-epstein-to-be-analysed-c-19969010",
    "timestamp": "2025-09-10T10:29:32Z"
  },
  {
    "title": "‘Hercules' Star Kevin Sorbo's Son Says Women Should Not Have The Vote",
    "description": "Braeden Sorbo's comments were slammed as chauvinistic and more.",
    "link": "https://www.huffpost.com/entry/braeden-sorbo-women-vote_n_68c13f92e4b0f2df4e050e92",
    "timestamp": "2025-09-10T10:27:44Z"
  },
  {
    "title": "Canadians Back Carney’s Deficit and Defense Plans, Poll Shows",
    "description": "A slight majority of Canadians believe Prime Minister Mark Carney’s plan to run deeper deficits will grow the economy, accepting his argument that more spending is needed to emerge stronger from the US trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/canadians-back-carneys-deficit-and-defense-plans-poll-shows",
    "timestamp": "2025-09-10T10:25:44Z"
  },
  {
    "title": "Bitcoin Belongs In An 'Ideal' Portfolio, Says BlackRock Executive, But Thinks A 5% Allocation Is High",
    "description": "Rick Rieder, Chief Investment Officer of Global Fixed Income at BlackRock, said Tuesday that an “ideal” investment portfolio should have exposure to hard...",
    "link": "https://finance.yahoo.com/news/bitcoin-belongs-ideal-portfolio-says-102430020.html",
    "timestamp": "2025-09-10T10:24:30Z"
  },
  {
    "title": "Market Wrap: Sensex jumps 324 points; Nifty 50 tops extends rally to day 6 on US-India trade talks hopes",
    "description": "Indian equities extended their winning streak on Wednesday, with the Nifty notching a sixth consecutive day of gain, after U.S. President Donald Trump said his administration is continuing negotiations to address trade barriers with India",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-jumps-324-points-nifty-50-tops-extends-rally-to-day-6-on-us-india-trade-talks-hopes/articleshow/123806708.cms",
    "timestamp": "2025-09-10T10:20:03Z"
  },
  {
    "title": "Charlotte stabbing ignites national crime debate",
    "description": "Decarlos Brown has been charged on the state level with first-degree murder. He was also charged federally with one count of committing an act causing death on a mass transportation system.",
    "link": "https://www.wtae.com/article/charlotte-stabbing-crime-politics/66035004",
    "timestamp": "2025-09-10T10:18:21Z"
  },
  {
    "title": "Israel defends Qatar strikes after rebuke from Trump",
    "description": "Israel's U.N. envoy defended targeting Hamas leaders in Qatar as the \"right\" decision on Wednesday, after the strikes on the U.S. ally's soil drew a rare rebuke from President Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/israel-defends-qatar-strikes-after-rebuke-from-trump-213450",
    "timestamp": "2025-09-10T10:16:20Z"
  },
  {
    "title": "EU to freeze payments to Israel – von der Leyen",
    "description": "The European Commission will put bilateral support with the Jewish state on hold over the ongoing war in Gaza, the official has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624409-eu-israel-suspending-payments/",
    "timestamp": "2025-09-10T10:14:09Z"
  },
  {
    "title": "Trump greeted by protesters in D.C. restaurant but cheers outside",
    "description": "When President Trump ate at a Washington restaurant to promote his federal law enforcement surge in the nation's capital, he was greeted by protesters inside but cheers outside.",
    "link": "https://www.cbsnews.com/news/trump-protesters-dc-restaurant-cheers-outside/",
    "timestamp": "2025-09-10T10:12:33Z"
  },
  {
    "title": "Rosie O’Donnell says breakdown of friendship with Ellen DeGeneres was ‘one of the most painful things that ever happened’",
    "description": "Pair’s friendship soured after DeGeneres appeared on Larry King show in 2004",
    "link": "https://www.the-independent.com/life-style/rosie-odonnell-ellen-degeneres-friendship-breakdown-b2823762.html",
    "timestamp": "2025-09-10T10:12:03Z"
  },
  {
    "title": "'Punked Trump': Expert says president just suffered a 'humiliating' blow from an ally",
    "description": "A pair of analysts warned on Tuesday that President Donald Trump appears to have suffered a \"humiliating\" blow from a U.S. ally, and it could have global repercussions. Early Tuesday morning, Israel bombed the Qatari capital of Doha. Ben Rhodes, the former de…",
    "link": "https://www.rawstory.com/trump-2673977647/",
    "timestamp": "2025-09-10T10:10:28Z"
  },
  {
    "title": "Kidnapped Israeli-Russian academic Tsurkov released in Iraq",
    "description": "Iraqi Prime Minister Mohammed Shia al-Sudani and US President Donald Trump announced Tuesday the release of Israeli-Russian academic Elizabeth Tsurkov who was kidnapped in Baghdad in March 2023. While Iraq said a “group of outlaws” kidnapped Tsurkov, Trump an…",
    "link": "https://www.digitaljournal.com/world/kidnapped-israeli-russian-academic-tsurkov-released-in-iraq/article",
    "timestamp": "2025-09-10T10:07:20Z"
  },
  {
    "title": "Trump temporarily blocked from firing Fed governor",
    "description": "The judge's ruling is a win for the US Federal Reserve following criticism by the president.",
    "link": "https://www.bbc.com/news/articles/c740x28v8xno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-09-10T10:06:08Z"
  },
  {
    "title": "NATO Awaits Trump Response as Poland Invokes Article 4 Over Russian Drones: Live Updates",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPolish Prime Minister Donald Tusk has invoked NATO's Article 4 after he said a \"huge number\" of Russian drones violated his country's airspace.\nTusk said 19 drones had entered Polish airspace and those posing …",
    "link": "https://biztoc.com/x/973d09227c572d8a",
    "timestamp": "2025-09-10T10:04:38Z"
  },
  {
    "title": "Can the U.S. Military Stop Venezuela's Drug Cartels? Newsweek Contributors Debate",
    "description": "Tensions are rising between U.S. President Donald Trump and Venezuelan President Nicolás Maduro.",
    "link": "https://biztoc.com/x/ca30088d97334e32",
    "timestamp": "2025-09-10T10:04:33Z"
  },
  {
    "title": "Malaysia ready to engage OIC leaders over Israeli air strike on Doha, says Anwar",
    "description": "PUTRAJAYA: Malaysia is ready to engage Organisation of Islamic Cooperation (OIC) leaders to respond to the latest Israeli air strike on Doha, Qatar, says Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/10/malaysia-ready-to-engage-oic-leaders-over-israeli-air-strike-on-doha-says-anwar",
    "timestamp": "2025-09-10T10:04:00Z"
  },
  {
    "title": "Russia's Drones Violating Poland's Airspace Sparks Alarm, War Warning",
    "description": "The airspace over Poland's major air hub, Chopin International Airport in Warsaw, was temporarily closed.",
    "link": "https://www.newsweek.com/russia-ukraine-poland-drones-nato-2127422",
    "timestamp": "2025-09-10T10:01:06Z"
  },
  {
    "title": "NATO Awaits Trump Response as Poland Invokes Article 4 Over Russian Drones: Live Updates",
    "description": "Poland said Russia committed a major violation of its airspace. Follow Newsweek for live coverage.",
    "link": "https://www.newsweek.com/nato-russia-ukraine-poland-war-trump-article-4-2127472",
    "timestamp": "2025-09-10T10:00:49Z"
  },
  {
    "title": "Memphis pastor pushes back on ‘murder capital’ label, sees a safer future for his city",
    "description": "A Memphis pastor pushed back on FBI Director Kash Patel's claim that the Tennessee city is America's homicide capital, arguing federal data doesn't measure crime consistently.",
    "link": "https://www.foxnews.com/media/memphis-pastor-pushes-back-murder-capital-label-sees-safer-future-his-city",
    "timestamp": "2025-09-10T10:00:44Z"
  },
  {
    "title": "Legal experts predict Trump will win National Guard battle despite federal judge ruling",
    "description": "Trump faces legal challenges over National Guard deployment in Los Angeles, but the president is threatening similar action in Chicago, New York and other cities.",
    "link": "https://www.foxnews.com/politics/legal-experts-predict-trump-win-national-guard-battle-despite-federal-judge-ruling",
    "timestamp": "2025-09-10T10:00:44Z"
  },
  {
    "title": "Trump wants to crack down on “debanking.” He’s dismantling an agency that was doing just that",
    "description": "Trump hoped to stop banks from discriminating against customers. Attacks on federal agencies make that a big ask",
    "link": "https://www.salon.com/2025/09/10/trump-wants-to-crack-down-on-debanking-hes-dismantling-an-agency-that-was-doing-just-that_partner/",
    "timestamp": "2025-09-10T10:00:29Z"
  },
  {
    "title": "Charlotte’s ‘pro-crime’ policies under fire as career criminal charged with killing commuter: expert",
    "description": "Charlotte officials report declining crime statistics, but residents question the data after brutal light rail stabbing highlights uptown violence and safety concerns.",
    "link": "https://www.foxnews.com/us/charlotte-pro-crime-policies-under-fire-career-criminal-charged-killing-commuter-expert",
    "timestamp": "2025-09-10T10:00:29Z"
  },
  {
    "title": "Terence Corcoran: The big climate policy pullback is underway",
    "description": "Climate scaremongering is in retreat, writes Terence Corcoran. Read more.",
    "link": "https://financialpost.com/opinion/big-climate-policy-pullback-underway",
    "timestamp": "2025-09-10T10:00:25Z"
  },
  {
    "title": "These 19 states won't ban marriage equality if Obergefell is overturned",
    "description": "If the U.S. Supreme Court overturns marriage equality, less than half the country will allow same-sex couples to wed.",
    "link": "https://www.advocate.com/news/states-with-marriage-equality-obergefell",
    "timestamp": "2025-09-10T10:00:04Z"
  },
  {
    "title": "The Motor City Comeback: How Mayor Mike Duggan Revived Detroit",
    "description": "The outgoing mayor came into office 14 years ago almost by accident. He leaves one of the hardest municipal jobs in America with a string of victories.",
    "link": "https://www.newsweek.com/detroit-michigan-comeback-mayor-mike-duggan-crime-recession-2127262",
    "timestamp": "2025-09-10T10:00:02Z"
  },
  {
    "title": "Can the U.S. Military Stop Venezuela's Drug Cartels? Newsweek Contributors Debate",
    "description": "Tensions are rising between U.S. President Donald Trump and Venezuelan President Nicolás Maduro.",
    "link": "https://www.newsweek.com/can-us-military-stop-venezuelas-drug-cartels-newsweek-contributors-debate-2126625",
    "timestamp": "2025-09-10T10:00:01Z"
  },
  {
    "title": "Can an All-Star Team of Broadway Vets Finally Crack ‘Chess’?",
    "description": "Many have tried to make this notoriously tricky musical work—but Lea Michele, Aaron Tveit, and Nicholas Christopher might actually pull it off.",
    "link": "https://www.vanityfair.com/style/story/style/story/broadway-vets-chess-musical",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "The Nagorno-Karabakh Conflict May Be Coming To An End",
    "description": "After nearly four decades of fighting, the Nagorno-Karabakh conflict between Armenia and Azerbaijan may be coming to an end.",
    "link": "https://www.forbes.com/sites/marktemnycky/2025/09/10/the-nagorno-karabakh-conflict-may-be-coming-to-an-end/",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Mike Johnson wants Americans to be happy to live under military occupation",
    "description": "House Speaker Mike Johnson said Tuesday that Democratic mayors who run the cities President Donald Trump is threatening with troops should \"Yield, man.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-yield-man-democrats-trump-rcna230141",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "The Supreme Court’s FTC ruling is a death sentence for independent agencies",
    "description": "On Monday, the Supreme Court turned a blind eye to President Donald Trump’s unlawful termination of a Democratic member of the Federal Trade Commission.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/supreme-court-trump-ftc-commissioner-firing-independent-agencies-rcna230129",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Brazil Braces for a Verdict on Its Ex-President—and on Its Democracy",
    "description": "Jon Lee Anderson on the Brazilian filmmaker Petra Costa’s new documentary, “Apocalypse in the Tropics,” and the role of  Pentacostalism in the rise of the former Brazilian President Jair Bolsonaro, who awaits a trial verdict on accusations that he fomented a …",
    "link": "https://www.newyorker.com/news/the-lede/brazil-braces-for-a-verdict-on-its-ex-president-and-on-its-democracy",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "‘Trump is a free trader,’ prez’s former economic council chief Larry Kudlow tells ‘Pod Force One’",
    "description": "Despite his deep affection for tariffs, President Trump is fundamentally a \"free trader\" and an \"internationalist,\" his former top economist, Larry Kudlow, insisted during an exclusive interview on \"Pod Force One.\"",
    "link": "https://nypost.com/2025/09/10/us-news/donald-trump-is-a-free-trader-larry-kudlow-tells-pod-force-one/",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Why Scott Bessent Nearly Got Into a Fistfight Over Mortgages",
    "description": "Last week’s inaugural banquet at The Executive Branch did not disappoint. The Executive Branch is an exclusive Georgetown club (initiation fee: $150,000 to $500,000) that Donald Trump, Jr., co-founded to sell access to high-ranking Trump administration offici…",
    "link": "https://newrepublic.com/article/200237/scott-bessent-pulte-fistfight-fannie",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Income Inequality Is Going in the Wrong Direction Again",
    "description": "For a brief period during the pandemic, workers had power. Once the shutdowns ended and the economy rebounded, low-wage workers in many industries were able to negotiate better pay. Meanwhile, a boost in government spending—on stimulus checks as well as impro…",
    "link": "https://newrepublic.com/article/200236/census-income-data-report-inequality-widening",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "The One Percent’s Fear of Death Is Wreaking Havoc on the World",
    "description": "Once you start to see it, you see it everywhere. First, there is the spectacle of Bryan Johnson, who is spending millions to stay young, injecting his son’s blood plasma into his veins, electroshocking his penis, following a strictly regimented diet that look…",
    "link": "https://newrepublic.com/article/199347/1-fear-death-wreaking-havoc-world",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Social Media Is Navigating Its Sectarian Phase",
    "description": "Kyle Chayka writes about how social-media platforms are navigating—and shaping—contemporary political divides.",
    "link": "https://www.newyorker.com/culture/infinite-scroll/social-media-is-navigating-its-sectarian-phase",
    "timestamp": "2025-09-10T10:00:00Z"
  },
  {
    "title": "Israel has crossed a huge diplomatic red line with Qatar strike",
    "description": "Israel's unexpected strike has angered not only Qatar and its Middle East neighbours, but also its own closest ally in Washington and, though it claimed the attack was \"precise\", the IDF missed its targets.",
    "link": "https://news.sky.com/story/israel-has-crossed-a-huge-diplomatic-red-line-with-qatar-strike-13428093",
    "timestamp": "2025-09-10T09:56:00Z"
  },
  {
    "title": "Golf Rounds Plunge at U.S. Courses as Canadians Go Elbows Up at Trump",
    "description": "Canadian anger at President Donald Trump’s rhetoric and tariffs is hurting northern U.S. golf courses that typically rely on a strong flow of cross-border day-trippers and weekenders for business. It’s a crisis for some courses and suggests snowbird havens of…",
    "link": "https://www.sportico.com/business/finance/2025/golf-rounds-northern-us-courses-plunge-canadians-trump-1234870210/",
    "timestamp": "2025-09-10T09:55:00Z"
  },
  {
    "title": "Princeton academic Elizabeth Tsurkov freed by Iraqi militia after 2 years in captivity",
    "description": "A Princeton University graduate student who was kidnapped and held captive by an Islamic militia in Iraq for more than two years was released on Tuesday",
    "link": "https://www.nbcnews.com/world/middle-east/elizabeth-tsurkov-freed-princeton-iraq-militia-captivity-rcna230272",
    "timestamp": "2025-09-10T09:53:48Z"
  },
  {
    "title": "India resists full crypto framework, fears systemic risks, document shows",
    "description": "Global acceptance of cryptocurrencies has improved since US President Donald Trump took office and prices of bitcoin, the world's largest crypto-asset by market capitalisation, have hit record highs",
    "link": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/india-resists-full-crypto-framework-fears-systemic-risks-document-shows/article70033166.ece",
    "timestamp": "2025-09-10T09:51:12Z"
  },
  {
    "title": "Poland reacts as ‘huge number’ of Russian drones violate airspace",
    "description": "Polish PM Donald Tusk condemns ‘large-scale provocation’ by Russia",
    "link": "https://www.irishtimes.com/world/europe/2025/09/10/poland-reacts-as-huge-number-of-russian-drones-violate-airspace/",
    "timestamp": "2025-09-10T09:48:07Z"
  },
  {
    "title": "S&P 500 futures hit record high ahead of inflation data; Oracle jumps",
    "description": "Futures tied to the S&P 500 touched a record high on Wednesday, driven by a surge in cloud firm Oracle, as investors awaited producer prices data due later...",
    "link": "https://finance.yahoo.com/news/p-500-futures-hit-record-094739874.html",
    "timestamp": "2025-09-10T09:47:39Z"
  },
  {
    "title": "Hillary Clinton Says Trump Administration Is 'Going Great' For The President, Shares Accusations Of Crypto Corruption",
    "description": "Former Secretary of State Hillary Clinton took a dig at President Donald Trump on Tuesday for using his office for personal gain. Clinton Attacks Trump...",
    "link": "https://finance.yahoo.com/news/hillary-clinton-says-trump-administration-094603750.html",
    "timestamp": "2025-09-10T09:46:03Z"
  },
  {
    "title": "How Originalism Killed the Constitution",
    "description": "A radical legal philosophy has undermined the process of constitutional evolution.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/10/constitutional-originalism-amendment/683961/",
    "timestamp": "2025-09-10T09:45:00Z"
  },
  {
    "title": "Asian markets enjoy record day as new US jobs data fans rate cut hopes",
    "description": "HONG KONG: Asian markets extended gains on Wednesday (Sep 10), with Tokyo and Seoul emulating a record day on Wall Street as fresh data pointing to a weakening United States jobs market ramped up expectations for a series of Federal Reserve rate cuts.Eyes are…",
    "link": "https://www.channelnewsasia.com/asia/asia-markets-record-day-new-us-job-data-fed-rate-cut-5341976",
    "timestamp": "2025-09-10T09:41:00Z"
  },
  {
    "title": "Dan Brown Is Still Chasing the Da Vinci Code Thrill. Only Now, Everything Else Has Changed.",
    "description": "His latest book, The Secret of Secrets, just feels out of place. There’s a reason for it.",
    "link": "https://slate.com/culture/2025/09/dan-brown-the-secret-of-secrets-book-review-robert-langdon-da-vinci-code.html",
    "timestamp": "2025-09-10T09:40:00Z"
  },
  {
    "title": "Global Trade Is Winning Trump’s War On It",
    "description": "Since returning to the White House, Donald Trump has repeatedly introduced, paused, reversed, and hiked tariffs, often to unprecedented levels, raising fears about the future of the global trading system. But the average effective tariff rate that the US has …",
    "link": "https://www.project-syndicate.org/commentary/trump-tariffs-will-have-only-a-moderate-impact-on-trade-by-daniel-gros-2025-09",
    "timestamp": "2025-09-10T09:37:50Z"
  },
  {
    "title": "Russia's 'violation' of Poland’s airspace called 'act of war' in scathing statement as Zelenskyy issues major warning",
    "description": "A US politician has called the violation of Poland's airspace by Russia an 'act of war', while Volodymyr Zelenskyy warned this was 'extremely dangerous'",
    "link": "https://www.ladbible.com/news/world-news/russia-poland-airspace-act-of-war-203632-20250910",
    "timestamp": "2025-09-10T09:33:34Z"
  },
  {
    "title": "More investors want public and private assets in their portfolio. Now there's a benchmark to track this combo",
    "description": "Morningstar announced the Modern Market 100, the first framework to combine public and private equity exposure in one index.",
    "link": "https://www.cnbc.com/2025/09/10/morningstar-pitchbook-index-tracks-exposure-to-public-and-private-assets.html",
    "timestamp": "2025-09-10T09:33:09Z"
  },
  {
    "title": "Jump in US greenhouse gas pollution pushed global emissions higher – report",
    "description": "‘Abrupt shift’ in policy since Trump took office will have major consequences for climate crisis, forecast says\nA jump in greenhouse gas pollution in the US helped push global emissions higher in the first half of this year. This could be an omen of what’s to…",
    "link": "https://biztoc.com/x/fb95d98f6e8c5d9c",
    "timestamp": "2025-09-10T09:30:53Z"
  },
  {
    "title": "Trump Will Dine on ‘Predator Patio’ After Restaurant Visit Fiasco",
    "description": "President Donald Trump will retreat to a safer environment for his next meal after he was ambushed by protesters who called him “Hitler” during a Washington,...",
    "link": "https://www.thedailybeast.com/trump-will-dine-on-predator-patio-after-restaurant-visit-fiasco/",
    "timestamp": "2025-09-10T09:30:45Z"
  },
  {
    "title": "The GOP's answer to our gathering health crisis? A eugenicist without the slightest clue",
    "description": "If the Republicans cared about the public’s wellbeing, they wouldn’t have confirmed Robert F. Kennedy Jr. as head of the US Department of Health and Human Services. He had no business there, but that didn’t matter. Their top concern has been the wellbeing of …",
    "link": "https://www.rawstory.com/raw-investigates/rfk-jr-2673975053/",
    "timestamp": "2025-09-10T09:30:03Z"
  },
  {
    "title": "Israel will kill Hamas leaders next time if they survived Qatar attack, Israeli official says",
    "description": "If Israel failed to kill Hamas leaders in an airstrike on Qatar on Tuesday, it would succeed next time, the Israeli ambassador to the United States said...",
    "link": "https://www.yahoo.com/news/articles/israel-kill-hamas-leaders-next-092012507.html",
    "timestamp": "2025-09-10T09:20:12Z"
  },
  {
    "title": "Trump Blew Up 11 People. Is That Legal?",
    "description": "There’s a pesky legal distinction between “drug cartel” and “terrorist organization” at play here.",
    "link": "https://slate.com/podcasts/what-next/2025/09/why-trump-cant-just-blow-up-whoever-he-calls-drug-traffickers-legally",
    "timestamp": "2025-09-10T09:20:00Z"
  },
  {
    "title": "Trump Faces Corporate Pushback As 122 American Companies In China Demand Tariff Relief Amid Revenue Volatility",
    "description": "Nearly half of U.S. companies operating in China are urging President Donald Trump to eliminate all tariffs on Chinese goods, according to a new survey released by the American Chamber of Commerce in Shanghai.\nAmCham Survey Reveals Growing Business Concerns O…",
    "link": "https://biztoc.com/x/7fd731a54a346777",
    "timestamp": "2025-09-10T09:19:49Z"
  },
  {
    "title": "Mandelson, UK ambassador to US, deeply regrets association with Epstein",
    "description": "LONDON (Reuters) -Britain's ambassador to the U.S., Peter Mandelson, has said he deeply regrets ever meeting convicted sex offender Jeffrey Epstein and that he had carried on that association \"for far longer than I should have done\". Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/10/mandelson-uk-ambassador-to-us-deeply-regrets-association-with-epstein",
    "timestamp": "2025-09-10T09:19:00Z"
  },
  {
    "title": "South Africa renews talks with US",
    "description": "President Cyril Ramaphosa has said Pretoria will succeed in negotiations with Washington using critical minerals reserves as leverage Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/624406-south-africa-us-fresh-trade-negotiations/",
    "timestamp": "2025-09-10T09:18:09Z"
  },
  {
    "title": "Rivian CEO says Chinese EV makers aren't doing something 'magical' to achieve cheaper vehicles",
    "description": "Rivian CEO RJ Scaringe said Chinese automakers can take advantage of low labor costs and domestic subsidies to an extent Western competitors cannot.",
    "link": "https://www.businessinsider.com/rivian-ceo-china-evs-low-cost-competition-2025-9",
    "timestamp": "2025-09-10T09:17:01Z"
  },
  {
    "title": "South Korea Sends Plane To U.S. To Bring Back Workers Detained In ICE Raid",
    "description": "More than 300 South Koreans were rounded up in the Sept. 4 raid at the battery factory under construction at Hyundai’s sprawling auto plant in Georgia.",
    "link": "https://www.huffpost.com/entry/south-korea-plane-detained-workers-ice-raid_n_68c13dd4e4b059d8ed3699d0",
    "timestamp": "2025-09-10T09:13:05Z"
  },
  {
    "title": "Mother of Israeli freed from Iraq captivity hopes for similar news for families of Gaza hostages",
    "description": "In an interview with Israel's Army Radio, the mother of released Israeli-Russian hostage Elizabeth Tsurkov thanked U.S. President Donald Trump for his efforts in securing her freedom, and said she hoped families of Israelis held in Gaza would get similar news",
    "link": "https://www.haaretz.com/israel-news/2025-09-10/ty-article/mother-of-israeli-freed-from-iraq-captivity-hopes-gaza-hostages-families-get-similar-news/00000199-3224-d58e-afd9-736f532e0000",
    "timestamp": "2025-09-10T09:05:43Z"
  },
  {
    "title": "T-ball, hoops and hockey: Trump's UFC fight continues sporting legacy at White House",
    "description": "Trump plans to host the first UFC fight at the White House as part of yearlong celebrations for the country's 250th anniversary.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/10/trump-ufc-fight-white-house/86057492007/",
    "timestamp": "2025-09-10T09:05:23Z"
  },
  {
    "title": "The Power of France’s Pro-Israel Lobby",
    "description": "Serge Halimi, Pierre Rimbert\n\n\n\nNetanyahu says Israel is fighting a “shared war” in defense of Western values. In France, as elsewhere, it’s a message that has found powerful advocates—and not just on the right.\r\n\n\r\n\n\nThe post The Power of France’s Pro-Israel…",
    "link": "https://www.thenation.com/?post_type=article&p=570106",
    "timestamp": "2025-09-10T09:02:00Z"
  },
  {
    "title": "A top Qatari official says Israeli PM is sabotaging peace efforts",
    "description": "NPR talks with Majed Al Ansari, adviser to Qatar's prime minister and official spokesperson for the Ministry of Foreign Affairs, about Israeli strikes on Qatar targeting Hamas officials.",
    "link": "https://www.npr.org/2025/09/10/nx-s1-5535527/israel-qatar-reaction-doha-strike-hamas",
    "timestamp": "2025-09-10T09:01:59Z"
  },
  {
    "title": "A gas pipeline deal between Russia and China is still murky on many details",
    "description": "Russia's state gas company Gazprom says it has a deal to build a pipeline to China called Power of Siberia 2. That would seem to help Moscow make up for the loss of gas sales to Europe. Russia cut off most of Europe's supplies over the invasion of Ukraine. Ga…",
    "link": "https://apnews.com/article/russia-china-gas-pipeline-siberia-b48dffa3b9527cbccfa7585a03ca3c17",
    "timestamp": "2025-09-10T09:01:02Z"
  },
  {
    "title": "DEI is the real cause of America’s housing crisis",
    "description": "Census data shows 15 million excess housing units exist, contradicting claims of a housing shortage that activists use to justify eliminating local zoning laws.",
    "link": "https://www.foxnews.com/opinion/dei-is-real-cause-of-americas-housing-crisis",
    "timestamp": "2025-09-10T09:00:43Z"
  },
  {
    "title": "California Assembly Passes Bill Targeting Federal Officers Who Wear Masks",
    "description": "The California State Assembly passed a bill Tuesday aimed at federal Immigration and Customs Enforcement (ICE) that makes it a crime for any law enforcement officer to wear a mask in the course of his or her duties.\nThe post California Assembly Passes Bill Ta…",
    "link": "https://www.breitbart.com/politics/2025/09/10/california-assembly-passes-bill-targeting-federal-officers-who-wear-masks/",
    "timestamp": "2025-09-10T09:00:32Z"
  },
  {
    "title": "Trump foes melt down that SCOTUS is unleashing 'racial terror' on US with ICE raid ruling",
    "description": "California Democrats blasted a Supreme Court ruling allowing Trump immigration raids in Los Angeles, calling it \"un-American\" and dangerous.",
    "link": "https://www.foxnews.com/politics/top-trump-foes-melt-down-scotus-unleashed-racial-terror-us-ice-raid-ruling",
    "timestamp": "2025-09-10T09:00:25Z"
  },
  {
    "title": "First She Fought School Board Extremists. Now She’s Running For Senate.",
    "description": "Jennifer Jenkins spent four years on the school board in deep-red Brevard County  — and now she's turning her sights on fighting against right-wing radicalism in Florida.",
    "link": "https://www.huffpost.com/entry/jennifer-jenkins-senate-florida_n_68c08502e4b059d8ed3610f0",
    "timestamp": "2025-09-10T09:00:17Z"
  },
  {
    "title": "Texas Attorney General Ken Paxton encourages schools to bring back prayer, ‘we want the Word of God opened’",
    "description": "Ken Paxton supported a new Texas law allowing school boards to create policies for Bible reading and prayer periods with parental consent required.",
    "link": "https://www.foxnews.com/media/texas-attorney-general-ken-paxton-encourages-schools-bring-back-prayer-we-want-word-god-opened",
    "timestamp": "2025-09-10T09:00:03Z"
  },
  {
    "title": "The Lost Souls of the Internet",
    "description": "Laila Lalami\n\n\n\nIn Searches, Vauhini Vara probes the ways that we rely on the Internet and how we periodically attempt to free ourselves from its grip.\r\n\n\r\n\n\nThe post The Lost Souls of the Internet appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/searches-vauhini-vara-internet/",
    "timestamp": "2025-09-10T09:00:02Z"
  },
  {
    "title": "Susan Choi’s Big Novel of History",
    "description": "Sarah Chihaya\n\n\n\nIn Illuminations, Choi examines the tragedies—past and present—that haunt a family living in Japan.\r\n\n\r\n\n\nThe post Susan Choi’s Big Novel of History appeared first on The Nation.",
    "link": "https://www.thenation.com/article/culture/susan-choi-flashlight/",
    "timestamp": "2025-09-10T09:00:02Z"
  },
  {
    "title": "How Did Republican Fashion Go From Blazers to Belligerence?",
    "description": "Derek Guy\n\n\n\nTrump and his cronies’ style reflects a platform where grievance is currency and performance is power.\r\n\n\r\n\n\nThe post How Did Republican Fashion Go From Blazers to Belligerence? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/republican-fashion-schism/",
    "timestamp": "2025-09-10T09:00:02Z"
  },
  {
    "title": "How Health Systems Are Turning Living Rooms Into Hospital Rooms",
    "description": "More patients are choosing at-home health treatment as a better, more comfortable alternative to traditional medical settings.",
    "link": "https://www.newsweek.com/2025/09/19/how-health-systems-are-turning-living-rooms-hospital-rooms-2126557.html",
    "timestamp": "2025-09-10T09:00:01Z"
  },
  {
    "title": "That Wild “Wired” Article Is Not a Case Against Surrogacy",
    "description": "Sophie Lewis\n\n\n\nIt’s a horror story about Silicon Valley, and an extreme example of what happens when we conceive of children as property.\r\n\n\r\n\n\nThe post That Wild “Wired” Article Is Not a Case Against Surrogacy appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=570081",
    "timestamp": "2025-09-10T09:00:00Z"
  },
  {
    "title": "Trump’s Assault On Vote-By-Mail",
    "description": "Restricting vote-by-mail could disenfranchise millions, argues mail voting pioneer Phil Keisling.\nThe post Trump’s Assault On Vote-By-Mail appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/09/10/trump-assault-on-vote-by-mail/",
    "timestamp": "2025-09-10T09:00:00Z"
  },
  {
    "title": "Moms for Liberty foe announces Senate bid against Florida Republican Ashley Moody",
    "description": "Jennifer Jenkins has spent the past five years rising in Florida Democratic politics based on her public education advocacy.",
    "link": "https://www.nbcnews.com/politics/2026-election/moms-liberty-foe-jennifer-jenkins-senate-bid-ashley-moody-rcna230155",
    "timestamp": "2025-09-10T09:00:00Z"
  },
  {
    "title": "Trump Could Soon Strip Student Loan Forgiveness From Millions of Borrowers",
    "description": "Ángel Rentería\n\n\n\nChanges to the Public Service Loan Forgiveness Program could deem organizations and governments “ineligible employers” if they don’t align themselves with the president’s agenda.\r\n\n\r\n\n\nThe post Trump Could Soon Strip Student Loan Forgiveness…",
    "link": "https://www.thenation.com/?post_type=article&p=570060",
    "timestamp": "2025-09-10T09:00:00Z"
  },
  {
    "title": "Community Land Trusts Are Standing Up to New York City’s Worst Landlords",
    "description": "Aviva Stahl\n\n\n\nNew legislation could accelerate a growing movement of tenants who refuse to be at the mercy of developers and want to take ownership of their communities resources.\r\n\n\r\n\n\nThe post Community Land Trusts Are Standing Up to New York City’s Worst …",
    "link": "https://www.thenation.com/?post_type=article&p=570144",
    "timestamp": "2025-09-10T09:00:00Z"
  },
  {
    "title": "You are f**k all like Taylor Swift, pupils remind English teachers",
    "description": "ENGLISH teachers likening themselves to Taylor Swift after the star referred to herself as ‘your English teacher’ have been sternly informed they can f**k off.",
    "link": "https://www.thedailymash.co.uk/news/work/you-are-fk-all-like-taylor-swift-pupils-remind-english-teachers-20250910260302",
    "timestamp": "2025-09-10T08:59:51Z"
  },
  {
    "title": "Modi and Trump signal mutual optimism for US-India trade negotiations moving ahead",
    "description": "In a post on X early Wednesday, Modi said both countries are working to settle trade discussions \"at the earliest.\" He added that he was looking forward to talks with President Donald Trump. \"We will work together to secure a brighter, more prosperous future …",
    "link": "https://freerepublic.com/focus/f-news/4339498/posts",
    "timestamp": "2025-09-10T08:54:07Z"
  },
  {
    "title": "Video Shows Trump's Reaction to Hitler Chants in DC Restaurant",
    "description": "Protestors labelled the president as \"the Hitler of our time\" and shouted \"Free Palestine\" in the restaurant.",
    "link": "https://www.newsweek.com/video-shows-trump-reaction-hitler-protests-dc-restaurant-2127427",
    "timestamp": "2025-09-10T08:52:02Z"
  },
  {
    "title": "CEOs at Brainstorm Tech in Park City reveal what’s holding them back in AI and trade",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/09/10/ceos-at-brainstorm-tech-in-park-city-reveal-whats-holding-them-back-in-ai-and-trade/",
    "timestamp": "2025-09-10T08:50:23Z"
  },
  {
    "title": "Russian drones in Polish airspace 'reckless' - Taoiseach",
    "description": "Taoiseach Micheál Martin has called Russia's drone incursion into Poland's airspace a \"reckless and unprecedented act\".",
    "link": "https://www.rte.ie/news/2025/0910/1532737-europe-drones-reaction/",
    "timestamp": "2025-09-10T08:45:58Z"
  },
  {
    "title": "Metaplanet to Raise $1.4B in International Share Sale, Stock Jumps 16%",
    "description": "The bitcoin treasury company secured funds for its bitcoin-buying strategy including a $30 million commitment from Nakamoto Holdings.",
    "link": "https://www.coindesk.com/markets/2025/09/10/metaplanet-to-raise-usd1-4-billion-in-international-share-sale-stock-jumps-16",
    "timestamp": "2025-09-10T08:32:56Z"
  },
  {
    "title": "AI Data Centers Market Size Expected to Reach USD 165.73 Billion by 2034 Driven by Rising Computational Power Demand and Generative AI Expansion",
    "description": "The global AI data centers market size is expected to reach nearly USD 165.73 billion by 2034 increasing from USD 17.54 billion in 2025 and accelerating at a solid CAGR of 28.34% from 2025 to 2034. The global AI data centers market size is expected to reach n…",
    "link": "https://www.globenewswire.com/news-release/2025/09/10/3147537/0/en/AI-Data-Centers-Market-Size-Expected-to-Reach-USD-165-73-Billion-by-2034-Driven-by-Rising-Computational-Power-Demand-and-Generative-AI-Expansion.html",
    "timestamp": "2025-09-10T08:31:00Z"
  },
  {
    "title": "RFK Jr.’s latest ‘Make America Healthy Again’ report calls for more scrutiny of vaccines, autism",
    "description": "The report suggests using personal medical records and health insurance data to investigate diseases and disorders",
    "link": "https://www.wcjb.com/2025/09/10/rfk-jrs-latest-make-america-healthy-again-report-calls-more-scrutiny-vaccines-autism/",
    "timestamp": "2025-09-10T08:30:29Z"
  },
  {
    "title": "China Reacts to Fresh Trump Tariff Reports Over Russia",
    "description": "Beijing said it would \"resolutely oppose\" economic pressure from the West in a move to try to end the Ukraine war.",
    "link": "https://www.newsweek.com/china-reacts-fresh-trump-tariff-reports-over-russia-2127416",
    "timestamp": "2025-09-10T08:24:43Z"
  },
  {
    "title": "Mandelson expresses 'tremendous' regret over Epstein friendship",
    "description": "The ambassador to the US likens his past association with the convicted paedophile to \"an albatross around my neck\".",
    "link": "https://www.bbc.com/news/articles/c5yevwvvneyo",
    "timestamp": "2025-09-10T08:24:27Z"
  }
]