[
  {
    "title": "How Student Loans Became America’s Financial Catastrophe",
    "description": "How student loans became a vehicle for higher educational profiteering and exploitation of students.",
    "link": "https://www.nakedcapitalism.com/2025/09/how-student-loans-became-americas-financial-catastrophe.html",
    "timestamp": "2025-09-13T09:25:04Z"
  },
  {
    "title": "Trump says drone incursion into Poland \"could have been a mistake\"",
    "description": "U.S. President Donald Trump on Thursday said that the alleged Russian drone incursion into Poland's airspace \"could have been a mistake,\" while expressing frustration with the incident.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/09/mil-250912-pdo02.htm",
    "timestamp": "2025-09-13T09:13:52Z"
  },
  {
    "title": "Charlie Kirk’s widow Erika Kirk sobs over his casket in emotional video",
    "description": "A grief-stricken Erika Kirk has returned to social media for the first time since her husband was shot dead.",
    "link": "https://7news.com.au/news/charlie-kirks-widow-erika-kirk-sobs-over-his-casket-in-emotional-video-c-20008418",
    "timestamp": "2025-09-13T09:10:48Z"
  },
  {
    "title": "Farmers Are Struggling Under Donald Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFarmers across the country have fallen on hard times in the wake of a number of President Donald Trump's policies, despite being one of his most loyal voting groups.\nEven in states which voted overwhelmingly i…",
    "link": "https://biztoc.com/x/e05a75dd9bdc8fd2",
    "timestamp": "2025-09-13T09:07:44Z"
  },
  {
    "title": "UC Berkeley shares information on 160 staff, students with US government",
    "description": "Among those listed is feminist philosopher Judith Butler, who likened the move to a 'practice from the McCarthy era'.",
    "link": "https://www.aljazeera.com/news/2025/9/13/uc-berkeley-shares-information-on-160-staff-students-with-us-government",
    "timestamp": "2025-09-13T09:03:19Z"
  },
  {
    "title": "NATO Launches 'Eastern Sentry' To Bolster Defenses Near Russia",
    "description": "The NATO military alliance, led by European members, said it was bolstering defenses on its eastern flank following a tension-raising Russian drone incursion into Polish airspace.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/09/mil-250913-rferl01.htm",
    "timestamp": "2025-09-13T09:00:42Z"
  },
  {
    "title": "Benjamin Netanyahu gambled by targeting Hamas leaders in Qatar; it appears to have backfired",
    "description": "Benjamin Netanyahu's attempt to eliminate Hamas leaders in Qatar faced setbacks. The strike angered Qatar and complicated ceasefire negotiations. Relations with the US are strained. Hostage release efforts are now uncertain. Netanyahu remains determined despi…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/benjamin-netanyahu-gambled-by-targeting-hamas-leaders-in-qatar-it-appears-to-have-backfired/articleshow/123866935.cms",
    "timestamp": "2025-09-13T09:00:18Z"
  },
  {
    "title": "Map Shows Colleges Ranked Best—and Worst—for Free Speech",
    "description": "\"Most people have a line somewhere, and when it's crossed they support censorship,\" FIRE Chief Research Advisor Sean Stevens told Newsweek.",
    "link": "https://www.newsweek.com/map-shows-colleges-best-worst-free-speech-2128998",
    "timestamp": "2025-09-13T09:00:04Z"
  },
  {
    "title": "Farmers Are Struggling Under Donald Trump",
    "description": "One Arkansas farmer, Chris King, said: \"I have never been as worried as I am now about whether or not my kids and grandkids will be able to carry on.\"",
    "link": "https://www.newsweek.com/farmers-are-struggling-under-donald-trump-2128104",
    "timestamp": "2025-09-13T09:00:02Z"
  },
  {
    "title": "Value investor John Rogers sees signs of market 'frothiness' — but touts Oracle and 2 other stocks as winners",
    "description": "Ariel Investments' John Rogers said there are signs of market excess and economic pressure,   and picked three stocks as winning bets.",
    "link": "https://www.businessinsider.com/john-rogers-ariel-stock-picks-oracle-msg-market-outlook-economy-2025-9",
    "timestamp": "2025-09-13T09:00:02Z"
  },
  {
    "title": "Bernie Sanders makes his next moves to reshape the Democratic Party",
    "description": "Sen. Bernie Sanders might be done touring the country for now.",
    "link": "https://www.nbcnews.com/politics/2026-election/bernie-sanders-makes-moves-reshape-democratic-party-rcna230246",
    "timestamp": "2025-09-13T09:00:00Z"
  },
  {
    "title": "The H-2A Visa Trap",
    "description": "by Max Blau, ProPublica, and Zaydee Sanchez for ProPublica, illustrations by Dadu Shin for ProPublica \n \n\n \n This story contains descriptions of sexual assaults.\n\n \n\n \n \n \n\n\n\n \nIn the darkness before dawn, Javier Sanchez Mendoza Jr. took the last drag of a ci…",
    "link": "https://projects.propublica.org/h2a-visa-farmworkers-operation-blooming-onion/",
    "timestamp": "2025-09-13T09:00:00Z"
  },
  {
    "title": "Where could alien life exist in our solar system?",
    "description": "The solar system has eight planets and hundreds of moons. Could extraterrestrials live on any of them?",
    "link": "https://www.livescience.com/space/extraterrestrial-life/where-could-alien-life-exist-in-our-solar-system",
    "timestamp": "2025-09-13T09:00:00Z"
  },
  {
    "title": "The Free Ride for EVs in the Carpool Lane Is Coming to an End",
    "description": "The US government is ending a program that allowed EVs and hybrids to display a “Clean Air Vehicle” sticker and use the HOV lane on freeways, even if the driver was alone in the car.",
    "link": "https://www.wired.com/story/the-free-ride-for-evs-in-the-carpool-lane-is-coming-to-an-end/",
    "timestamp": "2025-09-13T09:00:00Z"
  },
  {
    "title": "Germany to recruit 100,000 troops by 2029 for war with Russia: Report",
    "description": "Germany has moved to add 100,000 active troops to its army by 2029 in an attempt to meet new NATO targets intended to prepare for a possible war with Russia, according to a report.",
    "link": "https://www.globalsecurity.org/wmd/library/news/germany/2025/germany-250912-presstv01.htm",
    "timestamp": "2025-09-13T08:57:40Z"
  },
  {
    "title": "Trump says he will send National Guard to Memphis, Tennessee",
    "description": "U.S. President Donald Trump said Friday that he would deploy the National Guard to combat crime in Memphis - a Democratic-led city in the state of Tennessee - claiming he was backed by the city's mayor and the state's governor.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/09/sec-250913-pdo01.htm",
    "timestamp": "2025-09-13T08:51:53Z"
  },
  {
    "title": "U.S. commerce secretary hints at 'big deal' with Taiwan",
    "description": "U.S. Commerce Secretary Howard Lutnick suggested in an interview on Thursday that the United States and Taiwan were close to reaching a trade agreement.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250912-cna03.htm",
    "timestamp": "2025-09-13T08:49:58Z"
  },
  {
    "title": "Charlie Kirk's wife makes defiant statement saying her ‘cries will echo around the world like a battle cry’",
    "description": "Charlie Kirk's widow Erika, who he shares two children with, has shared an emotional video message after he was shot dead at Utah Valley University.",
    "link": "https://www.ladbible.com/news/us-news/charlie-kirk-shooting-utah-wife-erika-statement-667761-20250913",
    "timestamp": "2025-09-13T08:48:28Z"
  },
  {
    "title": "Trump’s calls for coordinated tariffs on India over Russian oil unlikely to sway EU",
    "description": "While the US demands tariffs on India and China, Brussels accelerates free trade agreement negotiations with New Delhi, aiming to strengthen bilateral ties amid a polarising US-China dynamic.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-india-tariffs-russian-oil-eu-trade-deal-11757738003870.html",
    "timestamp": "2025-09-13T08:48:27Z"
  },
  {
    "title": "Charlie Kirk’s widow says her ‘cries’ will ‘echo around the world like a battle cry’ in first public remarks since shooting",
    "description": "Charlie Kirk’s widow has said her “cries” will “echo around the world like a battle cry” in a pointed message for “the evildoers responsible” for the assassination of the conservative activist.",
    "link": "https://www.independent.ie/world-news/north-america/charlie-kirks-widow-says-her-cries-will-echo-around-the-world-like-a-battle-cry-in-first-public-remarks-since-shooting/a1219813701.html",
    "timestamp": "2025-09-13T08:37:00Z"
  },
  {
    "title": "In the crypto vs gold struggle, new battle lines are being drawn",
    "description": "At a time when cryptocurrencies are being promoted aggressively by none other than US President Donald Trump, among others, it is significant that the price of gold is leaping to record highs nearly every day. It is arguably even more significant that one lea…",
    "link": "https://biztoc.com/x/2babc3026ac53d0b",
    "timestamp": "2025-09-13T08:33:51Z"
  },
  {
    "title": "Surrealing in the Years: Jim Gavin's answer on Gaza makes his Áras run look like a real gamble",
    "description": "Also this week: Put Brian McFadden on the Westlife stamp.",
    "link": "https://www.thejournal.ie/readme/surrealing-in-the-years-102-6815548-Sep2025/",
    "timestamp": "2025-09-13T08:30:19Z"
  },
  {
    "title": "Charlie Kirk’s widow Erika says her grief will ‘echo around the world like a battle cry’",
    "description": "Addressing her husband’s killer, she said: ‘You have no idea the fire that you have ignited within this wife.’",
    "link": "https://www.thejournal.ie/charlie-kirk-widow-6815853-Sep2025/",
    "timestamp": "2025-09-13T08:26:07Z"
  },
  {
    "title": "Battenfeld: Democrats want hearts of voters, but party has lost its heart",
    "description": "The horrific assassination of Charlie Kirk was a missed opportunity for the party to show unanimous compassion for Kirk’s family without blaming President Trump or Republicans for escalating political violence.",
    "link": "https://www.bostonherald.com/2025/09/13/battenfeld-democrats-want-hearts-of-voters-but-party-has-lost-its-heart/",
    "timestamp": "2025-09-13T08:07:11Z"
  },
  {
    "title": "Mo Batman, Mo Problems In The Daily LITG, 13th September 2025",
    "description": "DC Comics' cancellation of Red Hood after the first issue was published was the most-read story on Bleeding Cool, again, yesterday, but there was a lot about how it was taking down a chunk of Batman Day in its wake as DC cancelled the Gotham Sampler as well. …",
    "link": "https://bleedingcool.com/comics/mo-batman-mo-problems-in-the-daily-litg-13th-september-2025/",
    "timestamp": "2025-09-13T08:07:04Z"
  },
  {
    "title": "O, Canada! Americans — and their businesses — miss their neighbors up north",
    "description": "Canadians and American border states used to go together like gravy on fried potatoes, but political tensions have halted Canadian tourism to the US.",
    "link": "https://www.businessinsider.com/americans-businesses-beg-canadian-tourists-come-back-2025-9",
    "timestamp": "2025-09-13T08:03:01Z"
  },
  {
    "title": "‘Trust God and act obediently’: How White House remembered right-winger and Trump ally Charlie Kirk; watch video",
    "description": "The White House honored Charlie Kirk, a prominent conservative figure, with a video tribute following his assassination at Utah Valley University. The video highlighted his activism and personal life. Tyler Robinson, a 22-year-old, has been arrested for the k…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trust-god-and-act-obediently-how-white-house-remembered-right-winger-and-trump-ally-charlie-kirk-watch-video/articleshow/123866370.cms",
    "timestamp": "2025-09-13T08:02:39Z"
  },
  {
    "title": "Hong Kong Discloses Eased Crypto Rules For Banks, Set To Take Effect In 2026",
    "description": "In a significant move to bolster its position in the cryptocurrency landscape, Hong Kong is set to implement new regulations aimed at enhancing the adoption and usage of digital assets among banks.  This initiative comes in the wake of a renewed wave of pro-c…",
    "link": "https://bitcoinist.com/hong-kong-discloses-eased-crypto-rules-for-banks/",
    "timestamp": "2025-09-13T08:00:52Z"
  },
  {
    "title": "Following Kirk’s assassination, lawmakers react to lethal political climate: 'Violent words precede violent actions'",
    "description": "After Charlie Kirk’s assassination, Republicans and Democrats on Capitol Hill expressed extreme concern for the state of political discourse in the country.",
    "link": "https://www.foxnews.com/politics/watch-charlie-kirks-death-sparks-bipartisan-warnings-from-capitol-hill-about-political-discourse",
    "timestamp": "2025-09-13T08:00:26Z"
  },
  {
    "title": "How Tyler Robinson’s father assisted in his arrest in Charlie Kirk’s shooting",
    "description": "Like thousands of Americans captivated by the manhunt for the shooter who killed conservative political activist Charlie Kirk, a Utah father had seen the photos and video footage of the suspect released by authorities.",
    "link": "https://www.cnn.com/2025/09/13/us/tyler-robinson-mahunt-charlie-kirk",
    "timestamp": "2025-09-13T08:00:05Z"
  },
  {
    "title": "Carney says there's been a 'rupture.' What's he going to do about it this fall?",
    "description": "Even while Mark Carney has been accused of lowering his elbows in regards to American tariffs, he continues to frame the larger challenge facing this country in stark terms.",
    "link": "https://www.cbc.ca/news/politics/carney-parliamentary-fall-analysis-1.7632717",
    "timestamp": "2025-09-13T08:00:00Z"
  },
  {
    "title": "Charlie Kirk's widow pays tribute to 'martyr' husband",
    "description": "The Presidential Medal of Freedom is the highest civilian award in the United States.",
    "link": "https://www.christiantoday.com/news/charlie-kirk-s-widow-pays-tribute-to-martyr-husband",
    "timestamp": "2025-09-13T07:53:00Z"
  },
  {
    "title": "Trump hosts Qatari PM after Israeli attack in Doha",
    "description": "US President Donald Trump has held a dinner with the Qatari prime minister in New York, days after US ally Israel attacked Hamas leaders in Doha.",
    "link": "https://www.rte.ie/news/2025/0913/1533263-middle-east/",
    "timestamp": "2025-09-13T07:48:06Z"
  },
  {
    "title": "Gold hits record highs but is the rally sustainable?",
    "description": "Gold prices have surged past $3,600 globally and ₹1,09,000 in India, driven by recession fears, U.S. policy uncertainty, geopolitical tensions, and shifting global power dynamics that reinforce gold’s role as the ultimate safe-haven asset.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-hits-record-highs-but-is-the-rally-sustainable/articleshow/123866185.cms",
    "timestamp": "2025-09-13T07:44:32Z"
  },
  {
    "title": "California legislature passes bill prohibiting law enforcement from wearing face masks to shield identities",
    "description": "California lawmakers passed a bill banning face masks for most law enforcement officers while on duty after federal agents covered their faces during Los Angeles immigration raids.",
    "link": "https://www.foxnews.com/politics/california-legislature-passes-bill-prohibiting-law-enforcement-from-wearing-face-masks-shield-identities",
    "timestamp": "2025-09-13T07:42:45Z"
  },
  {
    "title": "Maher: Calling People Hitler Is Wrong, Makes It Easier to Justify Killing, Trump Also Demonizes People",
    "description": "During his opening monologue on Friday’s broadcast of HBO’s “Real Time,” host Bill Maher denounced people comparing President Donald Trump to Hitler by stating that “calling somebody Hitler makes it a lot easier to justify things like assassinations.” Maher a…",
    "link": "https://www.breitbart.com/clips/2025/09/13/maher-calling-people-hitler-is-wrong-makes-it-easier-to-justify-killing-trump-also-demonizes-people/",
    "timestamp": "2025-09-13T07:39:53Z"
  },
  {
    "title": "MSNBC's Zadrozny: 'It's Pretty Hard' to Find Extreme Left-Wing Content Online, 'Not That Much' of It",
    "description": "On Friday’s broadcast of MSNBC’s “All In,” MSNBC Senior Reporter Brandy Zadrozny said that there is left-wing extremist content online, “but not that much. It’s pretty hard. On the right, you can find it literally everywhere. It’s just overflowing.” But most\n…",
    "link": "https://www.breitbart.com/clips/2025/09/13/msnbcs-zadrozny-its-pretty-hard-to-find-extreme-left-wing-content-online-not-that-much-of-it/",
    "timestamp": "2025-09-13T07:39:21Z"
  },
  {
    "title": "Moore: Stop the IRS’s stealth $700B tax increase",
    "description": "President Donald Trump has done an admirable job at defanging the IRS, which was converted into a weaponized agency targeting Democrats’ political enemies.\nChief Justice John Marshall famously pronounced early in our nation’s history that “the power to tax in…",
    "link": "https://biztoc.com/x/9f36fa005ca46e35",
    "timestamp": "2025-09-13T07:37:46Z"
  },
  {
    "title": "Moore: Stop the IRS’s stealth $700B tax increase",
    "description": "If the IRS isn't told to cease and desist, it could be the perpetrator of the largest non-congressionally approved tax increase in American history.",
    "link": "https://www.bostonherald.com/2025/09/13/moore-stop-the-irss-stealth-700b-tax-increase/",
    "timestamp": "2025-09-13T07:29:14Z"
  },
  {
    "title": "Charlie Kirk widow says her ‘cries will echo around the world like a battle cry’",
    "description": "‘You have no idea what you just have unleashed across the country and this world,’ Erika Kirk said in a statement",
    "link": "https://www.irishtimes.com/world/us/2025/09/13/charlie-kirk-widow-says-her-cries-will-echo-around-the-world-like-a-battle-cry/",
    "timestamp": "2025-09-13T07:27:55Z"
  },
  {
    "title": "Trump Orders National Guard Deployment To Memphis Amid Soaring Crime, Escalating Federal Crackdown On Democrat-Led Cities",
    "description": "On Friday, President Donald Trump announced that Memphis, Tennessee, will be the next U.S. city to see National Guard troops deployed, expanding his controversial crime crackdown in Democrat-led cities.\nTrump Calls Memphis ‘Deeply Troubled'\nSpeaking on Fox Ne…",
    "link": "https://biztoc.com/x/a368174df2697e8f",
    "timestamp": "2025-09-13T07:26:51Z"
  },
  {
    "title": "Suspect in Charlie Kirk killing caught in US, widow vows to carry on legacy",
    "description": "A 22-year-old Utah man has been arrested and booked for killing the prominent right-wing activist.",
    "link": "https://www.aljazeera.com/news/2025/9/13/suspect-in-charlie-kirk-killing-caught-in-us-widow-vows-to-carry-on-legacy",
    "timestamp": "2025-09-13T07:22:53Z"
  },
  {
    "title": "Bitcoin buyers plunge as investors' crypto euphoria fades",
    "description": "Bitcoin-hoarding companies are facing steep stock declines as crypto euphoria fades. Once boosted by bitcoin’s record highs, firms like Strategy, Metaplanet, and others now suffer sharp reversals, underscoring the volatility of equity tied to cryptocurrency e…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-buyers-plunge-as-investors-crypto-euphoria-fades/articleshow/123865822.cms",
    "timestamp": "2025-09-13T07:21:33Z"
  },
  {
    "title": "Graham: Campus progressives preach tolerance, produce violence",
    "description": "Defining words as a form of violence creates a permission structure for actual violence. And once political violence becomes thinkable, it becomes inevitable.",
    "link": "https://www.bostonherald.com/2025/09/13/graham-campus-progressives-preach-tolerance-produce-violence/",
    "timestamp": "2025-09-13T07:15:05Z"
  },
  {
    "title": "World Bank’s $100 Billion Loan Facility Targets Africa",
    "description": "“We have been very clear that the bank remains strongly committed to Africa,” Axel van Trotsenburg, the bank’s senior managing director, said in an interview...",
    "link": "https://finance.yahoo.com/news/world-bank-100-billion-loan-064029326.html",
    "timestamp": "2025-09-13T06:40:29Z"
  },
  {
    "title": "Border wall between Azerbaijan and Armenia divides village of Kirants",
    "description": "A new concrete border wall now splits the Armenian village of Kirants in two. How has it changed people's lives? And how stable is the peace between Armenia and Azerbaijan?",
    "link": "https://www.dw.com/en/border-wall-between-azerbaijan-and-armenia-divides-village-of-kirants/a-73952329",
    "timestamp": "2025-09-13T06:27:00Z"
  },
  {
    "title": "First responders face investigations over social posts about Charlie Kirk’s killing",
    "description": "First responders and public employees in several cities have become the subject of investigations or have been placed on leave over social media posts reacting to the fatal shooting of conservative activist Charlie Kirk. Kirk, a close ally of President Donald…",
    "link": "https://freerepublic.com/focus/f-chat/4340155/posts",
    "timestamp": "2025-09-13T06:26:35Z"
  },
  {
    "title": "Trump, Witkoff dine with Qatari prime minister after Israeli attack in Doha",
    "description": "Trump previously expressed annoyance about the strike in a phone call with Israeli Prime Minister Benjamin Netanyahu and sought to assure the Qataris that such attacks would not happen again",
    "link": "https://www.haaretz.com/news/middle-east/2025-09-13/ty-article/trump-witkoff-dine-with-qatari-prime-minister-after-israeli-attack-in-doha/00000199-41b4-df32-a1df-41f7714f0000",
    "timestamp": "2025-09-13T06:20:44Z"
  },
  {
    "title": "Erika Kirk vows to continue slain husband Charlie’s ‘American Comeback’ college tour this fall and grow the movement: ‘We’ll never surrender’",
    "description": "“The movement is not going anywhere, and it will only grow stronger when you join it.”",
    "link": "https://nypost.com/2025/09/13/us-news/erika-kirk-vows-to-continue-charlie-kirks-college-tour-this-fall-and-grow-the-movement/",
    "timestamp": "2025-09-13T06:16:22Z"
  },
  {
    "title": "Netanyahu risks diplomatic fallout with US after targeting Hamas leaders in Qatar",
    "description": "Israel’s attempt to assassinate Hamas leaders in Qatar has backfired, straining ties with the U.S. and Qatar, complicating ceasefire talks.",
    "link": "https://indianexpress.com/article/world/netanyahu-risks-diplomatic-fallout-with-us-after-targeting-hamas-leaders-in-qatar-10247243/",
    "timestamp": "2025-09-13T06:05:19Z"
  },
  {
    "title": "Was US strike on Venezeulan boat murder on the high seas?",
    "description": "The US military bombed a boat in international waters killing all 11 people on board. The US said it was a warning to drug-runners. Venezuela called it murder. As tensions rise, what does it mean for the region?",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0913/1533222-was-us-strike-on-venezeulan-boat-murder-on-the-high-seas/",
    "timestamp": "2025-09-13T06:01:01Z"
  },
  {
    "title": "Was US strike on Venezuelan boat murder on the high seas?",
    "description": "The US military bombed a boat in international waters killing all 11 people on board. The US said it was a warning to drug-runners. Venezuela called it murder. As tensions rise, what does it mean for the region?",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0913/1533222-venezuelan-boat/",
    "timestamp": "2025-09-13T06:01:01Z"
  },
  {
    "title": "Egypt warns Israel: Strikes on Hamas leaders on Egyptian soil will be seen as declaration of war",
    "description": "Egypt has issued a stern warning to Israel, declaring that any assassination attempt on Hamas leaders within Egypt would be considered a direct violation of its sovereignty and an act of war. This warning follows reports of Israeli plots to target Hamas figur…",
    "link": "https://www.naturalnews.com/2025-09-13-egypt-israel-strikes-on-egyptian-soil-war.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Former Brazilian President Jair Bolsonaro sentenced to 27 YEARS in prison",
    "description": "Brazil’s Supreme Federal Court sentenced Jair Bolsonaro to 27 years for attempting a military coup, spreading election fraud claims and plotting against democracy. Prosecutors proved Bolsonaro sought military backing to overturn his 2022 loss and knew of assa…",
    "link": "https://www.naturalnews.com/2025-09-13-bolsonaro-sentenced-to-27-years-in-prison.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Germany plans major military expansion amid rising tensions with Russia",
    "description": "Germany is planning to more than double its active-duty military personnel to 200,000 by 2029, adding 100,000 troops to address NATO’s defense needs and prepare for potential conflict with Russia. This expansion is part of a broader strategy to enhance milita…",
    "link": "https://www.naturalnews.com/2025-09-13-germany-plans-major-military-expansion-russia-tensions.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Cliff Taylor: What was Jack Chambers thinking when he signed off on this strange document?",
    "description": "Publishing a spending “framework” with no targets and no view of how things should develop over the next few years begs the question of whether the Coalition is serious",
    "link": "https://www.irishtimes.com/opinion/2025/09/13/cliff-taylor-what-was-jack-chambers-thinking-when-he-signed-off-on-this-strange-document/",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Trump administration targets radical leftist NGOs: Calls for RICO investigation intensify",
    "description": "President Donald Trump and Republican lawmakers are intensifying their demands for a comprehensive RICO investigation into the funding and influence of radical leftist NGOs, following the assassination of conservative figure Charlie Kirk. The investigation ai…",
    "link": "https://www.naturalnews.com/2025-09-13-trump-administration-targets-radical-leftist-ngos-rico-investigation.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "The Great Unfreezing: Russia and China forge new financial world order to bypass Western sanctions",
    "description": "Russia and China are developing a new international securities depository as a direct strategic response to the freezing of approximately $67 billion in Russian assets by Western institutions like Euroclear and Clearstream. The initiative aims to create an “i…",
    "link": "https://www.naturalnews.com/2025-09-13-russia-china-forge-new-financial-world-order.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Alleged Kirk assassin’s radical left ties and chilling messages spark national security alarm",
    "description": "Charlie Kirk, a prominent conservative activist, was assassinated on September 10 at Utah Valley University, leading to the arrest of 22-year-old Tyler Robinson. The suspect was allegedly radicalized online, with investigators revealing he used the platform D…",
    "link": "https://www.naturalnews.com/2025-09-13-alleged-kirk-assassins-radical-left-ties-spark-alarm.html",
    "timestamp": "2025-09-13T06:00:00Z"
  },
  {
    "title": "Trump backs off Chicago National Guard threats - Axios",
    "description": "Trump backs off Chicago National Guard threatsAxios Trump shelves Chicago crackdown plans for now as advisers warn of legal headachesCNN President Donald Trump sending National Guard to Memphis, not Chicago; local leaders reactABC7 Chicago This Week In Photos…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179200292",
    "timestamp": "2025-09-13T05:52:46Z"
  },
  {
    "title": "Netanyahu gambled by targeting Hamas leaders in Qatar. It appears to have backfired",
    "description": "When Israeli Prime Minister Benjamin Netanyahu ordered this week’s attempted assassination of Hamas leaders in Qatar, he took a major gamble in his campaign to pound the group into submission",
    "link": "https://abcnews.go.com/International/wireStory/netanyahu-gambled-targeting-hamas-leaders-qatar-appears-backfired-125534700",
    "timestamp": "2025-09-13T05:50:14Z"
  },
  {
    "title": "BlackRock to invest $678 million in UK data centres during Trump visit, Sky News reports",
    "description": "BlackRock plans to invest 500 million pounds ($678 million) in British data centre infrastructure through a new joint venture with Digital Gravity Partners, ...",
    "link": "https://finance.yahoo.com/news/blackrock-invest-678-million-uk-054730870.html",
    "timestamp": "2025-09-13T05:47:30Z"
  },
  {
    "title": "BlackRock to invest $700 million in UK data centres during Trump visit, Sky News reports",
    "description": "BlackRock plans to invest 500 million pounds ($700 million) in British data-centre infrastructure, one of a string of deals to be announced during U.S. President Donald Trump's state visit next week, Sky News reported on Saturday. BlackRock and Downing Street…",
    "link": "https://www.channelnewsasia.com/business/blackrock-invest-700-million-in-uk-data-centres-during-trump-visit-sky-news-reports-5347716",
    "timestamp": "2025-09-13T05:47:30Z"
  },
  {
    "title": "'We owe it to Charlie': Students at school where Kirk was killed vow to continue his debates",
    "description": "The killing has thrown the school and its students into the centre of America's political divide.",
    "link": "https://www.bbc.com/news/articles/c9dxexl7glvo",
    "timestamp": "2025-09-13T05:26:56Z"
  },
  {
    "title": "Alvarez, Crawford weigh-in at 167.5lbs before super middleweight fight",
    "description": "Terence Crawford completed his two-division step up by tipping in at same weight as Canelo Alvarez ahead of their bout.",
    "link": "https://www.aljazeera.com/sports/2025/9/13/alvarez-crawford-weigh-in-at-167-5lbs-before-super-middleweight-fight",
    "timestamp": "2025-09-13T05:20:23Z"
  },
  {
    "title": "BlackRock to invest £500m in UK data centres during Trump visit",
    "description": "The world’s largest money manager will use President Trump’s state visit to the UK next week to unveil a £500m plan to invest in UK data centres, one of the fastest-growing areas of global infrastructure spending.",
    "link": "https://news.sky.com/story/blackrock-to-invest-500m-in-uk-data-centres-during-trump-visit-13429741",
    "timestamp": "2025-09-13T05:20:00Z"
  },
  {
    "title": "Netanyahu gambled by targeting Hamas leaders in Qatar. It appears to have backfired",
    "description": "When Prime Minister Benjamin Netanyahu ordered this week’s attempted assassination of Hamas leaders in Qatar, he took a major gamble in his campaign to pound...",
    "link": "https://www.yahoo.com/news/articles/netanyahu-gambled-targeting-hamas-leaders-051052100.html",
    "timestamp": "2025-09-13T05:10:52Z"
  },
  {
    "title": "He May Have Pulled The Trigger, But Charlie Kirk’s Suspected Killer Didn’t ‘Act Alone’",
    "description": "The alleged ‘radicalized’ assassin did not get to this moment on his own. Investigation details show a young man steeped in leftist dogma.After an intensive, multi-day manhunt, law enforcement officials on Friday said they had taken into custody conservative …",
    "link": "https://freerepublic.com/focus/f-news/4340152/posts",
    "timestamp": "2025-09-13T05:05:04Z"
  },
  {
    "title": "Wife of MAGA activist Charlie Kirk vows not to let his movement 'die'",
    "description": "Charlie Kirk's widow, Erika, delivers her first public remarks since the fatal shooting of her influencer husband.",
    "link": "https://www.abc.net.au/news/2025-09-13/erika-kirk-pays-tribute-to-late-husband-charlie-kirk/105770008",
    "timestamp": "2025-09-13T05:00:40Z"
  },
  {
    "title": "Russia’s drones and war games put Europe on edge as Nato promises ‘integrated approach’",
    "description": "In Poland 40,000 troops watch the border as Vladimir Putin’s forces make manoeuvres at the bloc’s weak point",
    "link": "https://www.irishtimes.com/world/europe/2025/09/13/russias-drones-and-war-games-put-europe-on-edge-as-nato-promises-integrated-approach/",
    "timestamp": "2025-09-13T05:00:01Z"
  },
  {
    "title": "Arrest of Charlie Kirk shooting suspect bookends latest episode of US political violence",
    "description": "An atmosphere of fear and fragility now dominates political discourse across the country",
    "link": "https://www.irishtimes.com/world/us/2025/09/13/charlie-kirk-shooting-fear-and-fragility-remain-in-divided-us-after-arrest-of-suspect/",
    "timestamp": "2025-09-13T05:00:01Z"
  },
  {
    "title": "‘We’re activating a revolution’: how Charlie Kirk pushed a new generation to the right",
    "description": "The far-right activist galvanised young conservatives through online antics and inflammatory views",
    "link": "https://www.irishtimes.com/world/us/2025/09/13/were-activating-a-revolution-how-charlie-kirk-pushed-a-new-generation-to-the-right/",
    "timestamp": "2025-09-13T05:00:01Z"
  },
  {
    "title": "Blame game over Charlie Kirk shooting exposes dangerous political divide in the US",
    "description": "In the aftermath of his death, Trump’s Oval Office address pointed the finger at rhetoric of ‘the radical left’",
    "link": "https://www.irishtimes.com/world/us/2025/09/13/blame-game-over-charlie-kirk-shooting-exposes-dangerous-political-divide-in-the-us/",
    "timestamp": "2025-09-13T05:00:00Z"
  },
  {
    "title": "Annie Lennox: ‘I wanted to perform as a woman, not be regarded as a piece of meat’",
    "description": "As the former Eurythmics superstar publishes a new illustrated memoir of her extraordinary career, she talks to Charlotte Cripps about being diagnosed as neurodivergent, why the American dream is over for many working-class Americans, and how the pop industry…",
    "link": "https://www.the-independent.com/arts-entertainment/books/features/annie-lennox-eurythmics-sweet-dreams-dave-stewart-b2819209.html",
    "timestamp": "2025-09-13T05:00:00Z"
  },
  {
    "title": "Fed Governor Lisa Cook claimed 2nd residence as 'vacation home,' undercutting Trump fraud claims",
    "description": "Federal Reserve Governor Lisa Cook referred to a condominium she purchased in June 2021 as a “vacation home&quot; in a loan estimate, a characterization that could undermine claims by the Trump administration that she committed mortgage fraud. President Donal…",
    "link": "https://japantoday.com/category/world/fed-governor-lisa-cook-claimed-2nd-residence-as-%27vacation-home-%27-undercutting-trump-fraud-claims",
    "timestamp": "2025-09-13T04:59:55Z"
  },
  {
    "title": "Epstein's birthday book is just a hint of his rich and powerful orbit",
    "description": "Convicted sex offender Jeffrey Epstein intentionally sought out some of the world's most powerful people. Here's how they have responded to his disgraced reputation.",
    "link": "https://www.abc.net.au/news/2025-09-13/jeffrey-epstein-friends-associates-over-the-years/105593832",
    "timestamp": "2025-09-13T04:59:48Z"
  },
  {
    "title": "Largest Group Of Lawbreaking Gang Members in the U.S. Is Aged 13 To 16, FBI Report Reveals",
    "description": "The biggest cohort involved in gang activity in the United States is youths 13 to 16 years old, the FBI revealed as part of the agency’s Gang Activity, 2021–2024 special report published on Sept. 8.The Federal Bureau of Investigation building in Washington on…",
    "link": "https://freerepublic.com/focus/f-news/4340150/posts",
    "timestamp": "2025-09-13T04:58:53Z"
  },
  {
    "title": "Trump’s Crime Crackdown Spreads to Surprising Red State-Blue City of Memphis",
    "description": "President Donald Trump appeared to announce that his crime crackdown will spread to the very blue city of Memphis, in the red state of Tennessee. During his appearance on Friday on \"Fox and Friends,\" President Trump talked about the success his administration…",
    "link": "https://freerepublic.com/focus/f-news/4340147/posts",
    "timestamp": "2025-09-13T04:49:35Z"
  },
  {
    "title": "More Nato countries deploy aircraft and troops to shore up Poland",
    "description": "Denmark, France and Germany have joined a new mission to bolster the military alliance's eastern flank after Russian drones flew into Poland on Wednesday.",
    "link": "https://www.bbc.com/news/articles/c0q719qg1wko",
    "timestamp": "2025-09-13T04:48:02Z"
  },
  {
    "title": "News Summary-Intelligence Report 9/12/2025*Kirk's Widow Speaks*France's Credit Rating Downgraded*US Memo Slams UN Palestinian State Conference*Kirk Assassination Suspect Captured*Qatari PM Meets Trump Following Israeli Attack*",
    "description": "\"Daily Mail\" reporting on an affair involving Texas Attorney General Ken Paxton... Jeffrey Epstein paid the travel expenses of prominent British Labor Party... \"They killed Charlie because he preached patriotism, faith and the merciful love of God...You have …",
    "link": "https://freerepublic.com/focus/f-bloggers/4340146/posts",
    "timestamp": "2025-09-13T04:46:02Z"
  },
  {
    "title": "Trump Just Went on Fox and Issued an Unnerving Threat Against Liberals (Greg Sargent/New Republic)",
    "description": "Greg Sargent / New Republic:\nTrump Just Went on Fox and Issued an Unnerving Threat Against Liberals … Imagine that President Donald Trump actively wanted to encourage radical right-wing groups and “lone wolf” individuals to wage open violent warfare on anyone…",
    "link": "https://www.memeorandum.com/250913/p2",
    "timestamp": "2025-09-13T04:45:01Z"
  },
  {
    "title": "Georgia Democrat gains traction in special election for state Senate seat in deeply GOP district",
    "description": "Georgia Democrats hope a recent special election win in a deep-red state Senate district means their party could make gains in 2026",
    "link": "https://abcnews.go.com/Politics/wireStory/georgia-democrat-gains-traction-special-election-state-senate-125533719",
    "timestamp": "2025-09-13T04:38:15Z"
  },
  {
    "title": "Trump’s big U.K. visit comes at worst possible time for PM Keir Starmer",
    "description": "Trump's three-day trip comes just days after Starmer lost two senior members of the U.K. government to scandal.",
    "link": "https://www.japantimes.co.jp/news/2025/09/13/world/politics/trump-uk-starmer/",
    "timestamp": "2025-09-13T04:38:00Z"
  },
  {
    "title": "Keir Starmer ‘didn’t know full extent’ of Mandelson’s links to Epstein, minister says",
    "description": "UK prime minister Keir Starmer would not have appointed Peter Mandelson if he had known the depth of his relationship with the paedophile Jeffrey Epstein, a cabinet minister has said.",
    "link": "https://www.independent.ie/world-news/britain/keir-starmer-didnt-know-full-extent-of-mandelsons-links-to-epstein-minister-says/a1230014321.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Brazil’s former president Jair Bolsonaro jailed for 27 years over plot to stay in power after losing election",
    "description": "A panel of Brazilian Supreme Court justices sentenced former president Jair Bolsonaro to 27 years and three months in prison late on Thursday, after convicting him of attempting a coup to remain in office despite his 2022 electoral defeat.",
    "link": "https://www.independent.ie/world-news/latin-america/brazils-former-president-jair-bolsonaro-jailed-for-27-years-over-plot-to-stay-in-power-after-losing-election/a1599368422.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Release of prisoners by Belarus under US deal was ‘forced deportation’, opposition says",
    "description": "Belarus has been accused of the “forced deportation” of dozens of political prisoners released in a US-led deal, opposition leader Sviatlana Tsikhanouskaya said yesterday.",
    "link": "https://www.independent.ie/world-news/europe/release-of-prisoners-by-belarus-under-us-deal-was-forced-deportation-opposition-says/a655585049.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Ronald Brownstein: Charlie Kirk’s assassination requires Donald Trump to soothe, not inflame a divided America",
    "description": "Moments of tension and tragedy are when presidents usually try hardest to speak to, and for, the entire nation. But following the horrifying assassination of conservative activist Charlie Kirk, US president Donald Trump on Wednesday responded with angry, divi…",
    "link": "https://www.independent.ie/opinion/comment/ronald-brownstein-charlie-kirks-assassination-requires-donald-trump-to-soothe-not-inflame-a-divided-america/a1197444464.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Suspected Charlie Kirk gunman Tyler Robinson was turned in by his father, reports claim",
    "description": "The man suspected of killing Charlie Kirk is believed to have been arrested after confessing to his father.",
    "link": "https://www.independent.ie/world-news/north-america/suspected-charlie-kirk-gunman-tyler-robinson-was-turned-in-by-his-father-reports-claim/a1219813701.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Principles must be our guiding light in these dark days of war and assassination",
    "description": "Perhaps it is the pace of change in today’s world that makes some believe core principles can be devalued on a political whim.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-principles-must-be-our-guiding-light-in-these-dark-days-of-war-and-assassination/a266740987.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Letters: Charlie Kirk’s killing shows we need dialogue or we risk a culture of assassinations",
    "description": "Your editorial rightly observes that force never extinguishes an ideology, only energises it (‘Violence has no place in politics, no matter what side you are on’, Irish Independent, September 12).",
    "link": "https://www.independent.ie/opinion/letters/letters-charlie-kirks-killing-shows-we-need-dialogue-or-we-risk-a-culture-of-assassinations/a589264370.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Nato to beef up eastern flank after Poland shoots down Russian drones in its airspace",
    "description": "Nato announced plans to beef up the defence of Europe’s eastern flank yesterday, two days after Poland shot down drones that had violated its airspace in the first known action of its kind by a member of the Western alliance during Russia’s war in Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/nato-to-beef-up-eastern-flank-after-poland-shoots-down-russian-drones-in-its-airspace/a377812552.html",
    "timestamp": "2025-09-13T04:30:00Z"
  },
  {
    "title": "Sergio Gor is not qualified to be US Ambassador to India: Ex-US NSA John Bolton",
    "description": "John Bolton has questioned Sergio Gor's qualifications as the next US Ambassador to India. Bolton also addressed India's Russian oil purchases, explaining the sanctions' aim to reduce Russia's war funding without causing global price hikes.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/sergio-gor-is-not-qualified-to-be-us-ambassador-to-india-ex-us-nsa-john-bolton/articleshow/123863495.cms",
    "timestamp": "2025-09-13T04:26:43Z"
  },
  {
    "title": "EU wins Trump’s focus on China, but can it deliver on ‘impossible’ demand?",
    "description": "Bloc finds itself in a jam after US president presses European Union to impose 100% tariffs on India and China to pressure Putin Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/09/13/eu-wins-trumps-focus-on-china-but-can-it-deliver-on-impossible-demand",
    "timestamp": "2025-09-13T04:25:00Z"
  },
  {
    "title": "Schools tried to ban phones and avoid politics. Then came Charlie Kirk's assassination",
    "description": "The assassination of Charlie Kirk at Utah Valley University sent shockwaves through classrooms worldwide",
    "link": "https://abcnews.go.com/US/wireStory/schools-ban-phones-avoid-politics-charlie-kirks-assassination-125533446",
    "timestamp": "2025-09-13T04:22:19Z"
  },
  {
    "title": "Trump administration plans push at U.N. to restrict global asylum rights",
    "description": "Under the proposed framework, asylum seekers would be required to claim protection in the first country they enter, not a nation of their choosing.",
    "link": "https://www.japantimes.co.jp/news/2025/09/13/world/politics/us-trump-un-asylum/",
    "timestamp": "2025-09-13T04:22:00Z"
  },
  {
    "title": "Rubio to offer Israel support despite Qatar strike",
    "description": "U.S. Secretary of State Marco Rubio will offer robust support to Israel on a trip timed before French-led moves for a Palestinian state, the State Department said Friday, despite U.S. unease over Israel's airstrike in Qatar.",
    "link": "https://www.hurriyetdailynews.com/rubio-to-offer-israel-support-despite-qatar-strike-213540",
    "timestamp": "2025-09-13T04:21:40Z"
  },
  {
    "title": "Gender testing returns to track, stirring up harsh memories and doubts that date to the 1980s",
    "description": "World Athletics portrayed gender testing as a common-sense way to protect the female category in track and field. But bringing back a test that had been on the shelf for a quarter century is hardly a unanimously praised idea. With females required to take the…",
    "link": "https://www.seattlepi.com/sports/article/gender-testing-returns-to-track-stirring-up-21045910.php",
    "timestamp": "2025-09-13T04:20:41Z"
  }
]