[
  {
    "title": "Harvard Demonstrates How Much America Needs Its Research by Hiring a Drag Queen Professor",
    "description": "Harvard is a drag, literally. Amid its ongoing fight with President Donald Trump over whether Harvard University violated the civil rights of students and even deserves to... Read More\nThe post Harvard Demonstrates How Much America Needs Its Research by Hirin…",
    "link": "https://www.dailysignal.com/2025/10/05/harvard-demonstrates-how-much-america-needs-its-research-by-hiring-a-drag-queen-professor/",
    "timestamp": "2025-10-05T19:00:00Z"
  },
  {
    "title": "The Uncertain Future of UK Oil and Gas",
    "description": "Since the Labour Party came into office in the U.K. last year, many have wondered if oil and gas drilling will continue or whether we will witness an all-out shift to renewable energy. Prime Minister Kier Starmer has introduced stricter taxes on fossil fuel c…",
    "link": "https://oilprice.com/Energy/Energy-General/The-Uncertain-Future-of-UK-Oil-and-Gas.html",
    "timestamp": "2025-10-05T19:00:00Z"
  },
  {
    "title": "Bond Traders Dare to Go Longer Before 4% Yield Disappears",
    "description": "Now, they’re ready to look out a little longer on the Treasury curve.  A cluster of bullish option trades has emerged over the past two weeks, wagering that ...",
    "link": "https://finance.yahoo.com/news/bond-traders-dare-longer-4-190000110.html",
    "timestamp": "2025-10-05T19:00:00Z"
  },
  {
    "title": "The Uncertain Future of UK Oil and Gas",
    "description": "The UK Labour government is tightening rules on fossil fuels while pledging a pragmatic energy mix that includes North Sea oil and gas alongside renewables, ...",
    "link": "https://finance.yahoo.com/news/uncertain-future-uk-oil-gas-190000707.html",
    "timestamp": "2025-10-05T19:00:00Z"
  },
  {
    "title": "Kevin Hassett says 'there will be layoffs' if Trump decides shutdown talks are not progressing",
    "description": "Top White House economic advisor Kevin Hassett said he's hopeful lawmakers can reach an agreement to end the government shutdown before layoffs begin.",
    "link": "https://www.businessinsider.com/kevin-hassett-government-shutdown-layoffs-federal-workers-2025-10",
    "timestamp": "2025-10-05T18:57:54Z"
  },
  {
    "title": "'Full of traps': Hezbollah slams Trump's peace plan despite support for upcoming negotiations",
    "description": "Despite this, Hezbollah expressed its support and praised Hamas’s decision to participate in the ceasefire negotiations that will be taking place on Monday. ...",
    "link": "https://www.jpost.com/middle-east/article-869528",
    "timestamp": "2025-10-05T18:55:52Z"
  },
  {
    "title": "Rubio Breaks Down Which Part Of Hamas Deal Will Be ‘A Tough Piece’",
    "description": "Secretary of State Marco Rubio said Sunday on ABC's \"This Week\" the \"tough piece\" of the Hamas deal will be addressing the demobilization of the terror group.",
    "link": "https://dailycaller.com/2025/10/05/marco-rubio-demobilization-hamas-deal-israel-tough-piece-martha-raddatz-abc-this-week/",
    "timestamp": "2025-10-05T18:52:46Z"
  },
  {
    "title": "France’s new prime minister names a government that might not last long",
    "description": "France's new prime minister has named a government, bringing back former finance minister Bruno Le Maire as defense minister",
    "link": "https://abcnews.go.com/Business/wireStory/frances-new-prime-minister-names-government-long-126235229",
    "timestamp": "2025-10-05T18:51:59Z"
  },
  {
    "title": "Trump-backed map victory in Missouri could trigger redistricting battles in these states",
    "description": "These states may be next after Republicans gain ground in congressional redistricting as Missouri Governor Mike Kehoe approves new maps amid a nationwide battle for House control.",
    "link": "https://www.foxnews.com/politics/trump-backed-map-victory-missouri-could-trigger-redistricting-battles-these-states",
    "timestamp": "2025-10-05T18:51:08Z"
  },
  {
    "title": "Suspect arrested after threats against TikTok’s Culver City headquarters",
    "description": "Police say they have arrested a suspect allegedly connected to multiple online threats that led TikTok to evacuate its headquarters near Los Angeles on Friday.",
    "link": "https://techcrunch.com/2025/10/05/suspect-arrested-after-threats-against-tiktoks-culver-city-headquarters/",
    "timestamp": "2025-10-05T18:50:00Z"
  },
  {
    "title": "Israel Condemned as Sumud Flotilla Organizers Report 'Harsh Treatment' in Detention",
    "description": "US Congressman Ro Khanna on Sunday demanded the Israeli government's release of David Adler, a US citizen who was one of the organizers intercepted by Israeli forces last week after they came close to breaking the country's blockade on Gaza with the Global Su…",
    "link": "https://www.commondreams.org/news/gaza-flotilla-raid",
    "timestamp": "2025-10-05T18:49:41Z"
  },
  {
    "title": "Trump pushes Israel, Hamas to strike deal with talks set to open",
    "description": "US president Donald Trump is pressing Israel and Hamas to seal a settlement to the two-year conflict that's devastated Gaza and destabilised the Middle East as the warring sides are set to begin mediated talks tomorrow.",
    "link": "https://www.independent.ie/world-news/middle-east/trump-pushes-israel-hamas-to-strike-deal-with-talks-set-to-open/a1980536737.html",
    "timestamp": "2025-10-05T18:47:51Z"
  },
  {
    "title": "Newsom sues Trump administration over California National Guard deployment order to Oregon",
    "description": "Governor Gavin Newsom sues Trump administration after 300 California National Guard troops deployed to Oregon following federal court order blocking Oregon Guard use.",
    "link": "https://www.foxnews.com/politics/newsom-sues-trump-administration-over-california-national-guard-deployment-order-oregon",
    "timestamp": "2025-10-05T18:44:33Z"
  },
  {
    "title": "Supreme Court will be forced to grapple with Trump in new term",
    "description": "After months of emergency rulings, the justices will be asked to render final verdicts on economic and immigration policies at the core of Trump’s presidency. The Supreme Court and President Donald Trump are headed for a reckoning. After months of terse emerg…",
    "link": "https://freerepublic.com/focus/f-news/4344506/posts",
    "timestamp": "2025-10-05T18:40:49Z"
  },
  {
    "title": "France’s new prime minister names a government that might not last long",
    "description": "PARIS (AP) — France’s new prime minister named a government Sunday, bringing back former finance minister Bruno Le Maire to serve at the defense ministry, where he’ll help oversee French military support for Ukraine and address threats to European security po…",
    "link": "https://financialpost.com/pmn/frances-new-prime-minister-names-a-government-that-might-not-last-long",
    "timestamp": "2025-10-05T18:39:48Z"
  },
  {
    "title": "Russia expresses full support of Venezuela after US strikes boat near coast",
    "description": "The US has launched four attacks on the Caribbean region in recent weeks as part of what it says is a war on drugs.",
    "link": "https://www.aljazeera.com/news/2025/10/5/russia-expresses-full-support-of-venezuela-after-us-strikes-boat-near-coast",
    "timestamp": "2025-10-05T18:37:08Z"
  },
  {
    "title": "Meidas: Trump Has Disaster Sunday and Rushes Out of White House",
    "description": "Watching the clip of Trump saying \"Portland is burning to the ground\" to reporters, and not a single one of them points out that this is completely untrue. MeidasTouch host Ben Meiselas reports on Donald Trump’s disastrous Sunday as his meltdown gets worse ov…",
    "link": "https://littlegreenfootballs.com/article/54965_Meidas-_Trump_Has_Disaster_Sun",
    "timestamp": "2025-10-05T18:36:05Z"
  },
  {
    "title": "France’s new prime minister names a government that might not last long",
    "description": "France’s new prime minister named a government Sunday, bringing back former finance minister Bruno Le Maire to serve at the defense ministry, where he'll...",
    "link": "https://www.yahoo.com/news/articles/france-prime-minister-names-government-183542780.html",
    "timestamp": "2025-10-05T18:35:42Z"
  },
  {
    "title": "Defying court order, Trump sends California National Guard troops to Oregon (Lia Russell/Sacramento Bee)",
    "description": "Lia Russell / Sacramento Bee:\nDefying court order, Trump sends California National Guard troops to Oregon  —  President Donald Trump sent 300 California National Guard troops to Oregon on Sunday, defying a court order blocking him from deploying Oregon's own …",
    "link": "https://www.memeorandum.com/251005/p43",
    "timestamp": "2025-10-05T18:35:01Z"
  },
  {
    "title": "Newsom to Sue Trump over California Guard Protecting ICE in Oregon",
    "description": "California Gov. Gavin Newsom vowed Sunday to sue President Donald Trump over his decision to deploy the California National Guard to Oregon to protect federal officers against rioters in Portland.\nThe post Newsom to Sue Trump over California Guard Protecting …",
    "link": "https://www.breitbart.com/politics/2025/10/05/newsom-to-sue-trump-over-california-guard-protecting-ice-in-oregon/",
    "timestamp": "2025-10-05T18:32:49Z"
  },
  {
    "title": "US Supreme Court girds for culture wars with LGBT, guns and race cases",
    "description": "Summary Gay \"conversion therapy\" case to be argued on Tuesday Court will examine laws banning transgender athletes Justices to hear challenge to Hawaii handgun limits Voting Rights Act provision imperiled in Louisiana case WASHINGTON, Oct 5 (Reuters) - The U.…",
    "link": "https://freerepublic.com/focus/f-news/4344503/posts",
    "timestamp": "2025-10-05T18:31:24Z"
  },
  {
    "title": "US home builders, homeowners brace for impact of kitchen tariffs",
    "description": "President Trump's new 50% tariffs on imported kitchen cabinets and bathroom vanities, along with 30% on upholstered furniture, are set to begin Oct. 14. Industry experts deem them \"comically nonsensical,\" anticipating increased costs across the entire market,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-home-builders-homeowners-brace-for-impact-of-kitchen-tariffs/articleshow/124325047.cms",
    "timestamp": "2025-10-05T18:30:32Z"
  },
  {
    "title": "Bad Bunny Hosts ‘SNL’ Season 51 Premiere With Doja Cat And Jon Hamm",
    "description": "Saturday Night Live kicked off its 51st season with host Bad Bunny and musical guest Doja Cat.",
    "link": "https://www.forbes.com/sites/rosaescandon/2025/10/05/bad-bunny-hosts-snl-season-51-premiere-with-doja-cat-and-jon-hamm/",
    "timestamp": "2025-10-05T18:29:21Z"
  },
  {
    "title": "Eric Trump reacts to Barron Trump reportedly shutting down whole floor of Trump Tower for private date",
    "description": "Eric Trump discussed reports about his brother Barron Trump. Barron reportedly hosted a private romantic dinner at Trump Tower. This event required shutting down an entire floor for security. Eric appeared on a podcast and spoke about the incident. He defende…",
    "link": "https://economictimes.indiatimes.com/news/international/us/eric-trump-reacts-to-barron-trump-reportedly-shutting-down-whole-floor-of-trump-tower-for-private-date/articleshow/124324928.cms",
    "timestamp": "2025-10-05T18:28:33Z"
  },
  {
    "title": "Harvard professor suspended after allegedly firing pellet gun near Brookline synagogue",
    "description": "Brookline Police Deputy Superintendent Paul Campbell told the Herald on Sunday that their initial investigations have not led police to believe that Portugal Gouvêa’s shots were aimed at the synagogue or its congregation.",
    "link": "https://www.bostonherald.com/2025/10/05/harvard-professor-suspended-after-allegedly-firing-pellet-gun-near-brookline-synagogue/",
    "timestamp": "2025-10-05T18:28:31Z"
  },
  {
    "title": "Trump’s security secretary calls Chicago a ‘war zone’ after federal agents shoot woman",
    "description": "Kristi Noem’s remarks follow president’s authorisation to deploy 300 members of Illinois national guard to city",
    "link": "https://www.irishtimes.com/world/us/2025/10/05/trumps-security-secretary-calls-chicago-a-war-zone-after-federal-agents-shoot-woman/",
    "timestamp": "2025-10-05T18:26:09Z"
  },
  {
    "title": "Portland police sergeant appears to criticize assault victims for antagonizing anti-ICE protesters",
    "description": "Portland police sergeant's email appeared to blame three victims for getting assaulted and pepper-sprayed during confrontations with anti-ICE protesters.",
    "link": "https://www.foxnews.com/us/portland-police-sergeant-appears-to-criticize-assault-victims-for-antagonizing-anti-ice-protesters",
    "timestamp": "2025-10-05T18:25:45Z"
  },
  {
    "title": "Gavin Newsom Says Trump Is Sending 300 California National Guard Members To Oregon",
    "description": "Trump is sending 300 California National Guard members to Oregon after a judge temporarily blocked his administration from deploying that state’s guard to Portland, California’s governor said Sunday.",
    "link": "https://www.huffpost.com/entry/ap-us-national-guard-oregon-california-newsom-trump_n_68e2b786e4b08634f761c1ad",
    "timestamp": "2025-10-05T18:25:36Z"
  },
  {
    "title": "Trump Speaks Out Against Democratic AG Candidate After Disturbing Text Messages Revealed",
    "description": "Trump tore into Virginia Dem AG candidate Jay Jones after text messages from 2022 surfaced showing him fantasizing about assassinating a Republican legislator.",
    "link": "https://dailycaller.com/2025/10/05/trump-speaks-democrat-ag-candidate-jay-jones-text-messages-revealed/",
    "timestamp": "2025-10-05T18:24:02Z"
  },
  {
    "title": "Crypto skulduggery isn't a bug, it's the whole point (Jemima Kelly/Financial Times)",
    "description": "Jemima Kelly / Financial Times:\nCrypto skulduggery isn't a bug, it's the whole point  —  Exploiting regulatory loopholes is the name of the game  —  Donald Trump Jr had a wonderful answer this week for journalists asking whether there might be — just might be…",
    "link": "https://www.memeorandum.com/251005/p42",
    "timestamp": "2025-10-05T18:20:01Z"
  },
  {
    "title": "The Vought Doctrine: Make it hurt",
    "description": "It’s day five and counting of a budget impasse in Washington, but critics say characterizing this moment as a government “shutdown” is misleading. For months...",
    "link": "https://www.msnbc.com/ali-velshi/watch/the-vought-doctrine-make-it-hurt-249137733636",
    "timestamp": "2025-10-05T18:18:16Z"
  },
  {
    "title": "'Unforced error': Trump admin reportedly hit by new internal 'jolt' over Epstein scandal",
    "description": "In an article for Salon published Sunday, the outlet's senior writer, Sophia Tesfaye, argued that a deep and destabilizing fissure has opened within the Trump administration over how to control the narrative around convicted pedophile Jeffrey Epstein.Tesfaye …",
    "link": "https://www.rawstory.com/trump-epstein-unforced-error/",
    "timestamp": "2025-10-05T18:16:10Z"
  },
  {
    "title": "Shutdown: Congressional leaders remain deadlocked ahead of vote",
    "description": "The Senate will meet again Monday to try to pass a bill to reopen the government but the chances of it passing appear slim.",
    "link": "https://www.bbc.com/news/articles/cdx27523n0lo",
    "timestamp": "2025-10-05T18:12:45Z"
  },
  {
    "title": "'Democrat Shutdown' Could Fan the Literal Flames of Wildfires: GOP Reps",
    "description": "The USDA notes in its funding lapse plan that the Forest Service will need to “scale back hazardous fuels treatments like prescribed burns.\"",
    "link": "https://www.westernjournal.com/democrat-shutdown-fan-literal-flames-wildfires-gop-reps/",
    "timestamp": "2025-10-05T18:10:44Z"
  },
  {
    "title": "‘SICK and DEMENTED!’ Trump Demands Virginia Democrat Quit State AG Race After Fantasizing About Shooting GOP Lawmaker",
    "description": "President Donald Trump is calling for Jay Jones to drop out of the race after he sent \"SICK and DEMENTED\" text messages about shooting a Republican lawmaker.\nThe post ‘SICK and DEMENTED!’ Trump Demands Virginia Democrat Quit State AG Race After Fantasizing Ab…",
    "link": "https://www.mediaite.com/media/news/sick-and-demented-trump-demands-virginia-democrat-quit-state-ag-race-after-fantasizing-about-shooting-gop-lawmaker/",
    "timestamp": "2025-10-05T18:07:33Z"
  },
  {
    "title": "WATCH: Trump criticizes judge who temporarily blocked troop deployment to Portland",
    "description": "President Donald Trump voiced his frustration on Sunday morning about the ruling by U.S. District Court Judge Karin Immergut, who he appointed during his first term, that is preventing him as of now from deploying troops to Portland.",
    "link": "https://biztoc.com/x/dbfd8695ed177b46",
    "timestamp": "2025-10-05T18:06:02Z"
  },
  {
    "title": "Bill Maher rips Kamala Harris' book, says it should have been called, 'Everyone Sucks but Me'",
    "description": "\"Real Time\" host Bill Maher suggested former Vice President Kamala Harris' book should have been called \"Everyone Sucks but Me\" during his show on Friday.",
    "link": "https://www.foxnews.com/media/bill-maher-rips-kamala-harris-book-says-should-have-been-called-everyone-sucks-me",
    "timestamp": "2025-10-05T18:05:33Z"
  },
  {
    "title": "Will Israel end its occupation of Palestinian territories?",
    "description": "Talks to implement Donald Trump&#039;s 20-point plan for Gaza are under way.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/10/5/will-israel-end-its-occupation-of-palestinian-territories",
    "timestamp": "2025-10-05T18:01:48Z"
  },
  {
    "title": "At America's national parks in the Trump era, the arc of history bends toward revisionism (Calvin Woodward/Associated Press)",
    "description": "Calvin Woodward / Associated Press:\nAt America's national parks in the Trump era, the arc of history bends toward revisionism  —  By the roiling rapids of converging rivers, President Donald Trump's campaign to have the government tell a happier story of Amer…",
    "link": "https://www.memeorandum.com/251005/p41",
    "timestamp": "2025-10-05T18:00:22Z"
  },
  {
    "title": "The Show Trial of Jeffrey Clark",
    "description": "Soviet show trials were not just sham proceedings. The charges were often purposefully absurd, as if to communicate that it wasn’t about justice, or even retribution,... Read More\nThe post The Show Trial of Jeffrey Clark appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/05/the-show-trial-jeffrey-clark/",
    "timestamp": "2025-10-05T18:00:00Z"
  },
  {
    "title": "How the SPLC Targets Catholics and Other Christians",
    "description": "The SPLC does not prevent hate but directs it, mostly toward Christians for promoting the teachings of Christ.Under President Donald Trump, the FBI recently made the decision to sever ties with the far-left Southern Poverty Law Center (SPLC), a self-described…",
    "link": "https://freerepublic.com/focus/f-news/4344498/posts",
    "timestamp": "2025-10-05T17:59:13Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Oct. 5, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, House Speaker Mike Johnson and Senate Minority Leader Chuck Schumer.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-10-05-2025/",
    "timestamp": "2025-10-05T17:57:43Z"
  },
  {
    "title": "Trump says Putin's offer on nuclear arms control 'sounds like a good idea'",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump on Sunday said Russian President Vladimir Putin's offer to voluntarily maintain limits on deployed...",
    "link": "https://www.yahoo.com/news/articles/trump-says-putins-offer-nuclear-175630681.html",
    "timestamp": "2025-10-05T17:56:30Z"
  },
  {
    "title": "Can America Become a Democracy?",
    "description": "Next year, the United States will observe the 250th anniversary of its Declaration of Independence. To begin a year of celebration, Donald Trump appeared at the Iowa State Fairground in early July. “We’ve saved our country,” he proclaimed to the crowd of supp…",
    "link": "https://freerepublic.com/focus/f-news/4344497/posts",
    "timestamp": "2025-10-05T17:54:35Z"
  },
  {
    "title": "Museum director resigns over ultimatum given after refusing to let Donald Trump gift King Charles historic artefact",
    "description": "A museum director resigned after refusing to let Donald Trump take a historic artefact as a gift for King Charles",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-king-charles-museum-esienhower-sword-287933-20251005",
    "timestamp": "2025-10-05T17:52:14Z"
  },
  {
    "title": "WATCH: Trump criticizes judge who temporarily blocked troop deployment to Portland",
    "description": "President Donald Trump voiced his frustration on Sunday morning about the ruling by U.S. District Court Judge Karin Immergut, who he appointed during his first term, that is preventing him as of now from deploying troops to Portland.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-criticizes-judge-who-temporarily-blocked-troop-deployment-to-portland",
    "timestamp": "2025-10-05T17:51:55Z"
  },
  {
    "title": "“Authoritarian”: Trump Sending Troops to Another American City",
    "description": "President Donald Trump is making good on his promise to invade more American cities. On Saturday, Gov. JB Pritzker (D-Ill.) announced that the Trump administration planned to deploy 300 National Guard troops to Illinois “against our will.” Gov. Pritzker added…",
    "link": "https://www.motherjones.com/politics/2025/10/chicago-national-guard-trump-authoritarian-war-zone-pritzker-democrats/",
    "timestamp": "2025-10-05T17:51:20Z"
  },
  {
    "title": "New Jersey flips red? Mikie Sherrill’s gubernatorial campaign is imploding",
    "description": "As the old saying goes, “it’s not how you start, but how you finish.” In the case of the gubernatorial race between Democrat Mikie Sherrill and Republican Jack Ciattarelli in New Jersey, it’s Ciattarelli who has all the momentum as we head into the home stret…",
    "link": "https://freerepublic.com/focus/f-news/4344496/posts",
    "timestamp": "2025-10-05T17:50:04Z"
  },
  {
    "title": "Stephen Miller Claims Judge's Order Blocking Troops In Portland Is A 'Legal Insurrection'",
    "description": "Protests against ICE raids have escalated in Portland over the last few weeks, but a federal judge said they're not enough to deploy the National Guard.",
    "link": "https://www.huffpost.com/entry/stephen-miller-judge-order-block-portland-troops-legal-insurrection_n_68e29481e4b0d3ae4b8a0b55",
    "timestamp": "2025-10-05T17:49:02Z"
  },
  {
    "title": "Newsom says Trump has deployed California National Guard troops to Oregon",
    "description": "California Gov. Gavin Newsom on Sunday said that he would sue the Trump administration after they deployed 300 California National Guard troops to Oregon.",
    "link": "https://www.nbcnews.com/politics/trump-administration/california-newsom-trump-administration-national-guard-deployment-rcna235726",
    "timestamp": "2025-10-05T17:46:24Z"
  },
  {
    "title": "Thousands gather in London to mark two years since 7 October attacks",
    "description": "Candles were also lit for those affected by a deadly attack outside a Manchester synagogue on Thursday.",
    "link": "https://www.bbc.com/news/articles/cp98e30d8g4o",
    "timestamp": "2025-10-05T17:46:07Z"
  },
  {
    "title": "Populist party of billionaire Andrej Babiš wins big in Czech parliamentary election",
    "description": "Babiš's victory deprives Ukraine of a staunch supporter and steers Czechia toward the pro-Russian path taken by Hungary and Slovakia.",
    "link": "https://www.pbs.org/newshour/world/populist-party-of-billionaire-andrej-babis-wins-big-in-czech-parliamentary-election",
    "timestamp": "2025-10-05T17:45:00Z"
  },
  {
    "title": "Trump Rages Over Judge He Appointed Blocking Him from Deploying National Guard in Portland: ‘Ought to Be Ashamed!’",
    "description": "Donald Trump seethed at the judge who granted a temporary restraining order blocking the administration from deploying the National Guard to Portland, OR.\nThe post Trump Rages Over Judge He Appointed Blocking Him from Deploying National Guard in Portland: ‘Ou…",
    "link": "https://www.mediaite.com/media/news/trump-rages-over-judge-he-appointed-blocking-him-from-deploying-national-guard-in-portland-ought-to-be-ashamed/",
    "timestamp": "2025-10-05T17:44:35Z"
  },
  {
    "title": "Trump calls Jay Jones' text messages 'sick and demented,' says Democrat should withdraw",
    "description": "President Donald Trump also gave Republican incumbent Jason Miyares his \"Complete and Total Endorsement\" in Virginia's contest for attorney general.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_ed62f65f-d72d-4f16-8be0-41568ddddd0a.html",
    "timestamp": "2025-10-05T17:42:00Z"
  },
  {
    "title": "President Trump is sending 300 Cal Guard to Oregon and Newsom says he'll sue.",
    "description": "Governor Newsom to sue, urges Americans to speak out on Trump’s “breathtaking abuse of power” with cross-state Guard deployment.",
    "link": "https://www.kcra.com/article/president-trump-sending-300-california-guards-oregon/68835643",
    "timestamp": "2025-10-05T17:41:28Z"
  },
  {
    "title": "Americans Get More from Less Migration, Says Study by Pro-Migration Group",
    "description": "Keeping migration low is the best way to raise Americans' prosperity, says a study funded by the leading lobby group for investors who want mass migration.\nThe post Americans Get More from Less Migration, Says Study by Pro-Migration Group appeared first on Br…",
    "link": "https://www.breitbart.com/economy/2025/10/05/americans-gain-from-less-migration-says-study-funded-by-pro-migration-group/",
    "timestamp": "2025-10-05T17:40:42Z"
  },
  {
    "title": "'Stark shift': Trump changes his tone on economy as admin heads for a 'colossal blunder'",
    "description": "Donald Trump has embraced a \"wait until next year\" approach after advisers him privately warned him about bad economic numbers, according to reporting.The conservative Wall Street Journal on Sunday published an article called, \"Trump’s Team Hones Message on E…",
    "link": "https://www.rawstory.com/trump-colossal-blunder-stark-shift/",
    "timestamp": "2025-10-05T17:38:10Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from deploying National Guard in Portland",
    "description": "A federal judge in Oregon temporarily blocked President Donald Trump’s administration from deploying the National Guard in Portland, ruling Saturday in a lawsuit brought by the state and city.",
    "link": "https://biztoc.com/x/45ed70085a3b3a07",
    "timestamp": "2025-10-05T17:32:09Z"
  },
  {
    "title": "Trump says he'll send National Guard to Chicago, but details remain unclear",
    "description": "A White House spokesperson said the decision was made amid what it claimed were \"ongoing violent riots and lawlessness\" President Donald Trump moved to deploy the National Guard in another city Saturday by authorizing 300 troops to protect federal officers an…",
    "link": "https://freerepublic.com/focus/f-news/4344492/posts",
    "timestamp": "2025-10-05T17:31:58Z"
  },
  {
    "title": "Mass protests from Amsterdam to Istanbul denounce Israel’s Gaza genocide",
    "description": "Hundreds of thousands across Europe and the Middle East march against Israel’s ongoing genocide in Gaza.",
    "link": "https://www.aljazeera.com/news/2025/10/5/mass-protests-from-amsterdam-to-istanbul-denounce-israels-gaza-genocide",
    "timestamp": "2025-10-05T17:29:42Z"
  },
  {
    "title": "Five Killed After Russia Launches Air Strikes In Ukraine",
    "description": "Russia killed five people in air strikes on western Ukraine early Sunday, launching more than 50 missiles and 500 drones at the Lviv region near Polish border.",
    "link": "https://dailycaller.com/2025/10/05/russia-air-strikes-ukraine-5-dead/",
    "timestamp": "2025-10-05T17:29:30Z"
  },
  {
    "title": "The job market is weak and getting weaker, top economists says, while Trump looks to the future",
    "description": "“Our big year won’t be really next year—it’ll be the year after,” Trump told reporters recently.",
    "link": "https://fortune.com/2025/10/05/job-market-outlook-economic-forecasts-bls-private-payroll-data-trump/",
    "timestamp": "2025-10-05T17:28:03Z"
  },
  {
    "title": "Fight the rise of political violence — by calling out victim culture",
    "description": "There was a time in America when political violence provoked near-universal horror and condemnation.In 1981, President Ronald Reagan was a deeply polarizing figure — but when he was shot, his surgeon famously said, “Today, Mr. President, we are all Republican…",
    "link": "https://freerepublic.com/focus/f-news/4344491/posts",
    "timestamp": "2025-10-05T17:25:24Z"
  },
  {
    "title": "Trump court pick not licensed in Delaware advances toward appeals court seat",
    "description": "Jennifer Mascott, who clerked for Justices Thomas and Kavanaugh, moves closer to a seat on appeals court covering Delaware.",
    "link": "https://www.delawareonline.com/story/news/politics/2025/10/05/jennifer-mascot-advances-toward-full-senate-vote/86536533007/",
    "timestamp": "2025-10-05T17:24:22Z"
  },
  {
    "title": "Hakeem Jeffries: ‘No Democrat on Capitol Hill’ is pushing for health care to undocumented immigrants - NewsBreak",
    "description": "House Minority Leader Hakeem Jeffries (D-N.Y.) addresses the claim laid out by Vice President JD Vance, House Speaker Mike Johnson (R-La.) and other Republ",
    "link": "https://www.newsbreak.com/share/4274793642331-hakeem-jeffries-no-democrat-on-capitol-hill-is-pushing-for-health-care-to-undocumented-immigrants?_f=app_share&amp;pd=09fF8MNS&amp;lang=en_US&amp;send_time=1759684978&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.40.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v1&amp;s=i2",
    "timestamp": "2025-10-05T17:23:25Z"
  },
  {
    "title": "Cracker Barrel dumps the design firm behind its disastrous logo change",
    "description": "Cracker Barrel has cut ties with the design firm that created its controversial new logo and redesigned restaurants. The restaurant chain started implementing the changes but quickly reversed course following online backlash - including from President Donald …",
    "link": "https://freerepublic.com/focus/f-news/4344490/posts",
    "timestamp": "2025-10-05T17:23:10Z"
  },
  {
    "title": "Agent Orange and his nostalgia trip",
    "description": "Trump's latest MAGA plans of anachronistic 'Bullworker-style' muscle-flexing has all the traits of a DeLorean time machine that some of us recall from the 1985 film, Back to the Future.",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/agent-orange-and-his-nostalgia-trip/articleshow/124323827.cms",
    "timestamp": "2025-10-05T17:22:43Z"
  },
  {
    "title": "Sunday thought: America’s trauma",
    "description": "We need to talk about it openly Friends, I’d like to talk with you about a difficult subject. A significant number of you are disoriented by what Trump and his lapdogs are doing. Many are deeply anxious. Some of us are depressed. For years, medical experts ha…",
    "link": "https://freerepublic.com/focus/f-chat/4344489/posts",
    "timestamp": "2025-10-05T17:22:19Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration from deploying National Guard in Portland",
    "description": "A federal judge in Oregon temporarily blocked President Donald Trump’s administration from deploying the National Guard in Portland, ruling Saturday in a lawsuit brought by the state and city.",
    "link": "https://www.pbs.org/newshour/politics/judge-temporarily-blocks-trump-administration-from-deploying-national-guard-in-portland",
    "timestamp": "2025-10-05T17:21:42Z"
  },
  {
    "title": "Newsom to sue Trump again",
    "description": "California Governor Gavin Newsom announced on Sunday that he will be taking United States President Donald Trump back to court.\"After a federal court blocked his attempt to federalize the Oregon Natio...",
    "link": "https://biztoc.com/x/4f2a6ac035be513d",
    "timestamp": "2025-10-05T17:20:56Z"
  },
  {
    "title": "Bad Bunny Fires Back at Racist Haters of Super Bowl Halftime Act",
    "description": "Reading Time: 3 minutesBad Bunny knows you're out there. He knows what some are saying about him. And he has a message for the haters.\nBad Bunny Fires Back at Racist Haters of Super Bowl Halftime Act was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/bad-bunny-fires-back-at-racist-haters-of-super-bowl-halftime-act/",
    "timestamp": "2025-10-05T17:04:16Z"
  },
  {
    "title": "Pete Hegseth admits being shouted down in the Oval Office for failing Trump",
    "description": "Defense Secretary Pete Hegseth revealed that President Donald Trump \"yelled\" at him for failing at his job the last time he was in the Oval Office.In an interview recorded over the weekend, Fox News correspondent Peter Doocy asked Hegseth if he recalled the \"…",
    "link": "https://www.rawstory.com/trump-yelled-at-hegseth-admits/",
    "timestamp": "2025-10-05T17:00:10Z"
  },
  {
    "title": "No, Trump Can’t Send in the Military Whenever He Wishes",
    "description": "Someday, somehow, there will be another President of the United States, and his name won’t be Trump. That future President might well be a Democrat. That President might be in a position to exercise unchecked power, thanks to the acquiescence of the current C…",
    "link": "https://dianeravitch.net/2025/10/05/no-trump-cant-send-in-the-military-whenever-he-wishes/",
    "timestamp": "2025-10-05T17:00:00Z"
  },
  {
    "title": "House speaker says Democrats are not serious about negotiating as shutdown continues",
    "description": "Mike Johnson adds Trump does not want permanent job cuts as talks between parties stalled over weekend",
    "link": "https://www.yahoo.com/news/articles/house-speaker-says-democrats-not-165909024.html",
    "timestamp": "2025-10-05T16:59:09Z"
  },
  {
    "title": "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says (Erin Doherty/CNBC)",
    "description": "Erin Doherty / CNBC:\n‘There will start to be layoffs’ if Trump decides shutdown talks have stalled, Hassett says … White House National Economic Council Director Kevin Hassett said Sunday that layoffs for federal employees will begin if President Donald Trump…",
    "link": "https://www.memeorandum.com/251005/p32",
    "timestamp": "2025-10-05T16:50:00Z"
  },
  {
    "title": "WATCH LIVE: Trump, Hegseth celebrate Navy’s 250th anniversary at Naval Station Norfolk",
    "description": "President Donald Trump has decided not to let the government shutdown interfere with a stop in Norfolk, Virginia, on Sunday to salute the Navy as it celebrates its 250th anniversary.",
    "link": "https://biztoc.com/x/7372972c6ae30d47",
    "timestamp": "2025-10-05T16:47:01Z"
  },
  {
    "title": "'So Bad For Republicans!' Trump Rages As Fox News Guest Says Shutdown Is Over Health Care",
    "description": "President Donald Trump lashed out at Fox News and correspondent Peter Doocy for allowing a Democratic senator to point out Republicans had shut down the government instead of negotiating for lower health care costs.\n\n\n\"This is about the price that Americans h…",
    "link": "https://crooksandliars.com/2025/10/so-bad-republicans-trump-rages-fox-news",
    "timestamp": "2025-10-05T16:45:52Z"
  },
  {
    "title": "India’s ‘red lines’ have to be respected: EAM Jaishankar on trade deal with US",
    "description": "NEW DELHI: Any trade deal between India and the US has to respect New Delhi’s “red lines” and efforts are underway to reach an understanding, External Affairs Minister S Jaishankar said on Sunday against the backdrop of a downturn in bilateral ties over Washi…",
    "link": "https://statetimes.in/indias-red-lines-have-to-be-respected-eam-jaishankar-on-trade-deal-with-us/",
    "timestamp": "2025-10-05T16:43:13Z"
  },
  {
    "title": "What has Israel achieved in 2 years of war in Gaza?",
    "description": "The October 7 attack by Hamas shook Israel to its core. In response, the country initiated a military campaign in Gaza that has also frequently gone beyond its borders, altering the Middle East's political landscape.",
    "link": "https://www.dw.com/en/what-has-israel-achieved-in-2-years-of-war-in-gaza/a-74228934",
    "timestamp": "2025-10-05T16:42:00Z"
  },
  {
    "title": "'SNL' Tackles Trump Health Rumors And Late Night TV Crackdown",
    "description": "The season premiere kicked off with a sketch featuring Trump's mystery bruise and so much more.",
    "link": "https://www.huffpost.com/entry/snl-trump-health-rumors-late-night-tv-revenge-cold-open_n_68e1e609e4b060c19f1a968d",
    "timestamp": "2025-10-05T16:41:04Z"
  },
  {
    "title": "'Cracks in Trump's coalition' appear as key influencers threaten GOP's 2028 odds: report",
    "description": "Analysts around the country have suggested it was the conservative male podcasting culture that helped propel Donald Trump into a second term, but those same performers are now turning on the president.Joe Rogan and other podcaster/influencers were a hot topi…",
    "link": "https://www.rawstory.com/trump-cracks-threaten-gop-2028/",
    "timestamp": "2025-10-05T16:40:16Z"
  },
  {
    "title": "Trump Shreds Fox News and Peter Doocy Over Interview With Senate Democrat — Demands Fox ‘Get On Board Or Get Off Board NOW’",
    "description": "Trump slammed Peter Doocy over interview on his show — and used the occasion to air larger grievances against Fox News and demand they \"get on board... NOW.\"\nThe post Trump Shreds Fox News and Peter Doocy Over Interview With Senate Democrat — Demands Fox ‘Get…",
    "link": "https://www.mediaite.com/media/news/trump-shreds-fox-news-and-peter-doocy-over-interview-with-senate-democrat-demands-fox-get-on-board-or-get-off-board-now/",
    "timestamp": "2025-10-05T16:39:33Z"
  },
  {
    "title": "Where the ‘PayPal Mafia’ Is Today: Founders, Fortunes and Feuds",
    "description": "Two decades after selling PayPal, its founders remain some of the most powerful and polarizing figures in tech.",
    "link": "https://observer.com/2025/10/paypal-cofounders-today/",
    "timestamp": "2025-10-05T16:38:21Z"
  },
  {
    "title": "Layoffs will start if shutdown talks 'going nowhere', says White House",
    "description": "Hassett warns of mass layoffs if shutdown talks fail, Democrats demand health insurance tax credits, no negotiation progress.",
    "link": "https://www.thehindubusinessline.com/news/world/layoffs-will-start-if-shutdown-talks-going-nowhere-says-white-house/article70128982.ece",
    "timestamp": "2025-10-05T16:37:27Z"
  },
  {
    "title": "Syrian electoral college to select new Parliament members on Sunday",
    "description": "Syria is electing Parliament officials Sunday, paving the way toward a more democratic future after more than 50 years of dictatorship amid Bashar al-Assad's...",
    "link": "https://www.upi.com/Top_News/World-News/2025/10/05/syrian-electoral-college-elctions/6621759678473/",
    "timestamp": "2025-10-05T16:37:22Z"
  },
  {
    "title": "WATCH LIVE: Trump, Hegseth celebrate Navy’s 250th anniversary at Naval Station Norfolk",
    "description": "President Donald Trump has decided not to let the government shutdown interfere with a stop in Norfolk, Virginia, on Sunday to salute the Navy as it celebrates its 250th anniversary.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-hegseth-celebrate-navys-250th-anniversary-at-naval-station-norfolk",
    "timestamp": "2025-10-05T16:32:30Z"
  },
  {
    "title": "Trump reacts to Putin’s nuclear treaty offer",
    "description": "The Russian president has proposed extending New START for another year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625953-trump-putin-nuclear-treaty/",
    "timestamp": "2025-10-05T16:25:38Z"
  },
  {
    "title": "Government shutdown enters fifth day as Democrats, Republicans remain at impasse",
    "description": "The US federal government shutdown enters its fifth day with no resolution as Republican and Democratic lawmakers remain deadlocked. Democrats are pushing for renewed health insurance subsidies, while President Trump threatens permanent federal worker layoffs…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/government-shutdown-enters-fifth-day-as-democrats-republicans-remain-at-impasse/articleshow/124323047.cms",
    "timestamp": "2025-10-05T16:25:20Z"
  },
  {
    "title": "Released Gaza flotilla activists allege mistreatment while being detained in Israel",
    "description": "Some of the activists detained while trying to reach Gaza by sea have returned to their home countries to describe mistreatment at the hands of Israeli guards, claims that Israel denies.",
    "link": "https://www.pbs.org/newshour/world/released-gaza-flotilla-activists-allege-mistreatment-while-being-detained-in-israel",
    "timestamp": "2025-10-05T16:24:15Z"
  },
  {
    "title": "Trump: Return Univision to Streaming on YouTube TV",
    "description": "President Donald Trump is urging the American Spanish-language network Univision to make a return to YouTube TV.",
    "link": "https://www.breitbart.com/entertainment/2025/10/05/31129069president-trump-return-univision-to-streaming-on-youtube-tv/",
    "timestamp": "2025-10-05T16:22:48Z"
  },
  {
    "title": "Trump’s tariffs creating stiff headwinds for Colorado outdoor industry",
    "description": "Outdoor Element, based in Englewood, had its best year in 2024. This year, owner Michael Mojica is questioning whether he’ll be able to stay in business.",
    "link": "https://www.denverpost.com/2025/10/05/colorado-outdoor-industry-tariffs/",
    "timestamp": "2025-10-05T16:22:35Z"
  },
  {
    "title": "Trump administration declares US cities war zones",
    "description": "The Trump administration has branded Chicago a \"war zone\" as a justification for deploying soldiers against the will of local Democratic officials, while a judge blocked the White House from sending troops to another Democratic-run city.",
    "link": "https://www.rte.ie/news/us/2025/1005/1536947-chicago-trump/",
    "timestamp": "2025-10-05T16:20:02Z"
  },
  {
    "title": "'So bad for Republicans!' Trump rages at Fox after guest says shutdown is about healthcare",
    "description": "President Donald Trump lashed out at Fox News and correspondent Peter Doocy for allowing a Democratic senator to point out Republicans had shut down the government instead of negotiating for lower health care costs.\"This is about the price that Americans have…",
    "link": "https://www.rawstory.com/trump-health-care-shutdown-sobad/",
    "timestamp": "2025-10-05T16:19:56Z"
  },
  {
    "title": "White House Notches Significant Court Victory On ‘Sanctuary City’ Funding",
    "description": "A federal judge in Massachusetts denied a request for an injunction sought by two “sanctuary cities” in the state — Chelsea and Somerville — that sought to bar the Trump Administration from withholding federal funds due to their support for illegal aliens. So…",
    "link": "https://freerepublic.com/focus/f-chat/4344482/posts",
    "timestamp": "2025-10-05T16:18:41Z"
  }
]