[
  {
    "title": "Emergency summit in Brussels: EU on alert after Trump’s moves, support for Denmark, Greenland, and Ukraine",
    "description": "Cautious de-escalation in relations with the US, EU–US trade agreement “thaws” – Brussels welcomed the American president’s decision not to impose tariffs, doubts over the “peace council”\nThe post Emergency summit in Brussels: EU on alert after Trump’s moves,…",
    "link": "https://en.protothema.gr/2026/01/23/emergency-summit-in-brussels-eu-on-alert-after-trumps-moves-support-for-denmark-greenland-and-ukraine/",
    "timestamp": "2026-01-23T07:36:34Z"
  },
  {
    "title": "Trump revokes Canada’s invitation to join Board of Peace",
    "description": "Canada's prime minister openly criticised tariffs and the collapse of the rules-based order in his address in Davos.",
    "link": "https://www.aljazeera.com/news/2026/1/23/trump-revokes-canadas-invitation-to-join-board-of-peace",
    "timestamp": "2026-01-23T07:35:05Z"
  },
  {
    "title": "Macron’s Tom Cruise-style aviators at Davos give Italian company’s stock a surprise $4 million bump, firm's website crashed. Check its price.",
    "description": "At Davos, it was not just French President Emmanuel Macron's rebuke at President Donald Trump that dominated the conversations, but his top-gun aviator sunglasses became the topic of discussion too. The shades were identified as the Pacific S 01 model, priced…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/macrons-tom-cruise-style-aviators-at-davos-give-italian-companys-stock-a-surprise-4-million-bump-firms-website-crashed/articleshow/127248812.cms",
    "timestamp": "2026-01-23T07:34:20Z"
  },
  {
    "title": "India–EU trade marathon likely set for a Tuesday finish",
    "description": "India and the European Union are poised to announce the conclusion of long-running free trade negotiations, a deal expected to reduce tariffs on European automobiles and wine while widening market access for Indian exports such as electronics, textiles and ch…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indiaeu-trade-marathon-likely-set-for-a-tuesday-finish/articleshow/127248392.cms",
    "timestamp": "2026-01-23T07:33:58Z"
  },
  {
    "title": "Putin meets Trump's envoys as Kremlin says Ukraine settlement hinges on territory",
    "description": "Russian President Vladimir Putin discussed the settlement in Ukraine with U.S. President Donald Trump’s envoys during marathon overnight talks, and the Kremlin insisted that the territorial issue needs to be resolved to make peace",
    "link": "https://abcnews.go.com/International/wireStory/putin-meets-trumps-envoys-kremlin-ukraine-settlement-hinges-129479026",
    "timestamp": "2026-01-23T07:33:48Z"
  },
  {
    "title": "Friday's papers: Stubb predicts three Greenland outcomes, government wants AI healthcare help, and how long should you wear underwear?",
    "description": "\"One good, one bad and one catastrophic,\" Finnish President Alexander Stubb said about the future of Greenland and the Arctic region.",
    "link": "https://yle.fi/a/74-20206004",
    "timestamp": "2026-01-23T07:33:04Z"
  },
  {
    "title": "Senior U.S. defense official Colby to visit S Korea, Japan next week: Yonhap",
    "description": "U.S. Under Secretary of Defense for policy Elbridge ‌Colby will visit South Korea from Sunday to Tuesday and discuss military alliance issues ⁠before traveling on to ‍Japan, South Korea's Yonhap News ‍Agency ‍reported on Friday. His talks with ⁠South Korean o…",
    "link": "https://japantoday.com/category/politics/senior-us-defence-official-colby-to-visit-south-korea-and-japan-next-week-yonhap-says",
    "timestamp": "2026-01-23T07:31:37Z"
  },
  {
    "title": "European markets set for a lackluster open; Ukraine's Zelenskyy says Europe is 'lost'",
    "description": "European stocks finished higher on Thursday after U.S. President Donald Trump said a \"framework\" agreement had been reached over Greenland.",
    "link": "https://www.cnbc.com/2026/01/23/european-markets-set-for-a-lackluster-open-geopolitics-in-focus-.html",
    "timestamp": "2026-01-23T07:31:23Z"
  },
  {
    "title": "Trump touts 'total access' Greenland deal as NATO asks allies to step up",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"696cb2e959a457f4ca56f94d\"\n}",
    "link": "https://www.independent.ie/world-news/europe/trump-touts-total-access-greenland-deal-as-nato-asks-allies-to-step-up/a211703287.html",
    "timestamp": "2026-01-23T07:30:00Z"
  },
  {
    "title": "Trump unleashes nearly 100 Truth Social posts overnight in furious tirade",
    "description": "Donald Trump challenged the strength of NATO in one of his nearly 100 posts to Truth Social in the middle of the night. The president made a total of 85 posts over the span of five hours, with many reposts of right-wing clips including posts featuring comment…",
    "link": "https://www.rawstory.com/trump-truth-social-2675007566/",
    "timestamp": "2026-01-23T07:29:53Z"
  },
  {
    "title": "Toll in Iran's protest crackdown reaches at least 5,002 dead as Trump says US 'armada' approaching",
    "description": "Activists report that Iran's crackdown on nationwide protests has killed at least 5,002 people",
    "link": "https://abcnews.go.com/Business/wireStory/toll-irans-protest-crackdown-reaches-5002-dead-trump-129476717",
    "timestamp": "2026-01-23T07:25:35Z"
  },
  {
    "title": "Toll in Iran's protest crackdown reaches at least 5,002 dead as Trump says US 'armada' approaching",
    "description": "Activists report that Iran's crackdown on nationwide protests has killed at least 5,002 people",
    "link": "https://abcnews.go.com/International/wireStory/toll-irans-protest-crackdown-reaches-5002-dead-trump-129476678",
    "timestamp": "2026-01-23T07:25:34Z"
  },
  {
    "title": "Trump says ‘armada’ of US warships is heading towards Iran",
    "description": "President Donald Trump has said a ‘big force’ of US warships is heading towards Iran.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/23/trump-says-armada-of-us-warships-is-heading-towards-iran",
    "timestamp": "2026-01-23T07:23:02Z"
  },
  {
    "title": "Venezuela moves to open oil industry to private investors after abduction of Nicolas Maduro",
    "description": "Venezuela has the world’s largest proven reserves of oil.",
    "link": "https://www.thejournal.ie/venezuela-oil-provate-comapnied-nicolas-maduro-6935882-Jan2026/",
    "timestamp": "2026-01-23T07:22:11Z"
  },
  {
    "title": "Trump Trips Over His Own ‘Peace’ Claim With Freudian Slip For The Ages",
    "description": "\"Enough is enough,\" wrote one critic on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-peace-flub_n_69731a1de4b0a02ab3a0bdd5",
    "timestamp": "2026-01-23T07:21:01Z"
  },
  {
    "title": "Intel shares plunge on poor forecast",
    "description": "The best news, analysis and comment from The Irish Times business desk",
    "link": "https://www.irishtimes.com/business/2026/01/23/intel-shares-plunge-on-poor-forecast/",
    "timestamp": "2026-01-23T07:16:38Z"
  },
  {
    "title": "TikTok seals deal to split US app from global business to avoid ban over Chinese ownership",
    "description": "The new structure responds to a law passed under Joe Biden that forced Chinese-owned ByteDance to sell TikTok’s US operations or face a ban.",
    "link": "https://www.thejournal.ie/tiktok-us-china-deal-6935878-Jan2026/",
    "timestamp": "2026-01-23T07:13:29Z"
  },
  {
    "title": "Trump administration completes US’ split from the World Health Organization",
    "description": "(CNN) — The US has completed its withdrawal from the World Health Organization, the US Department of Health and Human Services said on Thursday, finalizing a longstanding goal of President",
    "link": "https://www.wkow.com/news/trump-administration-completes-us-split-from-the-world-health-organization/article_216b7b44-5f4f-5e2c-ba50-ca5e62850c37.html",
    "timestamp": "2026-01-23T07:11:50Z"
  },
  {
    "title": "Denmark’s leading NATO expert: »I’m pretty much in shock«",
    "description": "The crisis in recent weeks has highlighted why Denmark and a handful of NATO allies might want to join forces in a new security setup.",
    "link": "https://politiken.dk/edition/news/art10701399/Denmark%E2%80%99s-leading-NATO-expert-%C2%BBI%E2%80%99m-pretty-much-in-shock%C2%AB",
    "timestamp": "2026-01-23T07:11:09Z"
  },
  {
    "title": "Bloomberg reveals Trump’s plan for Greenland: The US seeks a “Blank Check” for military presence",
    "description": "Washington is seeking to lift all restrictions on its military presence in Greenland, with Donald Trump speaking of “full and permanent access” to the island and a revision of the defense agreement with Denmark\nThe post Bloomberg reveals Trump’s plan for Gree…",
    "link": "https://en.protothema.gr/2026/01/23/bloomberg-reveals-trumps-plan-for-greenland-the-us-seeks-a-blank-check-for-military-presence/",
    "timestamp": "2026-01-23T07:08:50Z"
  },
  {
    "title": "India’s top refiner to resume Russian oil purchases – Reuters",
    "description": "Reliance Industries is reportedly set to make purchases from non-sanctioned Russian entities in February and March Read Full Article at RT.com",
    "link": "https://www.rt.com/india/631389-indias-top-refiner-to-resume/",
    "timestamp": "2026-01-23T07:07:40Z"
  },
  {
    "title": "Spain will not join Trump’s Board of Peace, PM says",
    "description": "MADRID, Jan 23 (Reuters) - Spain will not take part in the Board of Peace initiative launched by U.S. President Donald Trump to tackle global conflicts, saying the decisi… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/23/spain-will-not-join-trump-s-board-of-peace-pm-says",
    "timestamp": "2026-01-23T07:07:22Z"
  },
  {
    "title": "'Rent Free': Gavin Newsom Gloats After Triggering Epic Trump Meltdown",
    "description": "The president threw a fit on social media in a message attacking the California governor.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-trump-davos_n_69730317e4b0283a09773327",
    "timestamp": "2026-01-23T07:03:03Z"
  },
  {
    "title": "Mitsotakis’ delicate balancing act after the crisis of trust in Euro-American relations",
    "description": "“Not only Greece, but almost all European countries are having difficulty participating in Trump’s Peace Council,” he said after the Summit – “The Arctic is an issue of global security; the red lines on Greenland are clear”\nThe post Mitsotakis’ delicate balan…",
    "link": "https://en.protothema.gr/2026/01/23/mitsotakis-delicate-balancing-act-after-the-crisis-of-trust-in-euro-american-relations/",
    "timestamp": "2026-01-23T07:00:52Z"
  },
  {
    "title": "Vietnam's leader returns to power with bold promises. Can he deliver?",
    "description": "To Lam has expanded his role, emulating China's Xi Jinping and making it clear that he is the paramount leader.",
    "link": "https://www.bbc.com/news/articles/c20zzq8we8wo",
    "timestamp": "2026-01-23T06:59:50Z"
  },
  {
    "title": "Venezuela opens debate on an oil sector overhaul as Trump seeks role for US firms",
    "description": "Venezuela's legislature advanced a bill on Thursday to loosen state control over the country's vast oil sector, the first major overhaul since parts of the industry were nationalized in 2007.",
    "link": "https://www.npr.org/2026/01/23/nx-s1-5686169/venezuela-debate-oil-sector-trump-seeks-role-us-firms",
    "timestamp": "2026-01-23T06:58:41Z"
  },
  {
    "title": "Turkish textile exporters shift focus to North Africa",
    "description": "Turkish textile exporters, who traditionally send nearly half of their products to European markets, are redirecting their attention to Syria and North African countries as their share in the EU continues to decline.",
    "link": "https://www.hurriyetdailynews.com/turkish-textile-exporters-shift-focus-to-north-africa-218152",
    "timestamp": "2026-01-23T06:57:32Z"
  },
  {
    "title": "Canada uninvited to Trump's 'Board of Peace' after PM hits back at US president's Davos remarks",
    "description": "Carney warned of a ‘rupture’ in the US-led global order and Trump replied that ‘Canada lives because of the United States’.",
    "link": "https://www.thejournal.ie/canada-mark-carney-trumps-board-of-peace-davos-6935872-Jan2026/",
    "timestamp": "2026-01-23T06:57:31Z"
  },
  {
    "title": "Carney Speech: The Rupture is a Necessary Part of the Transition",
    "description": "“We are in the midst of a rupture, not a transition,” Canadian prime minister Mark Carney told the world’s self-designated elite in a January 21 speech. “[G]reat powers have begun using economic integration as weapons. Tariffs as leverage. Financial infrastru…",
    "link": "https://www.counterpunch.org/2026/01/23/carney-speech-the-rupture-is-a-necessary-part-of-the-transition/",
    "timestamp": "2026-01-23T06:54:54Z"
  },
  {
    "title": "Icebreakers, the key tech to unlock Greenland, are only made by either US allies or adversaries",
    "description": "Icebreakers are essential for navigating Greenland's icy seas, but the U.S. faces a challenge with its limited fleet",
    "link": "https://abcnews.go.com/International/wireStory/icebreakers-key-tech-unlock-greenland-made-us-allies-129482252",
    "timestamp": "2026-01-23T06:53:53Z"
  },
  {
    "title": "5 Democratic states asking judge to keep Trump from withholding money for child care",
    "description": "Lawyers representing 5 Democratic-controlled states are asking a judge to keep blocking President Donald Trump's effort to withhold funding for child care subsidies and other programs in their states",
    "link": "https://abcnews.go.com/Politics/wireStory/5-democratic-states-judge-trump-withholding-money-child-129482069",
    "timestamp": "2026-01-23T06:53:27Z"
  },
  {
    "title": "Unforeseen",
    "description": "Men of factious tempers, of local prejudices, or of sinister designs, may, by intrigue, by corruption, or by other means, first obtain the suffrages, and then betray the interests, of the people. – James Madison, Federalist Papers #10 Although it’s difficult …",
    "link": "https://www.counterpunch.org/2026/01/23/unforeseen/",
    "timestamp": "2026-01-23T06:53:00Z"
  },
  {
    "title": "US, Ukraine and Russia delegations head to Abu Dhabi for first trilateral talks of war",
    "description": "Unclear if Russian and Ukrainian officials will meet face to face in discussions set to last two days",
    "link": "https://www.irishtimes.com/world/europe/2026/01/23/us-ukraine-and-russia-delegations-head-to-abu-dhabi-for-first-trilateral-talks-of-war/",
    "timestamp": "2026-01-23T06:51:44Z"
  },
  {
    "title": "How a 200% tariff on French wine could impact the US market",
    "description": "US president Donald Trump warned of a 200% tariff on French wine, amid political tension. Economist Jens-Peter Barynin analyses the possible impact...",
    "link": "https://www.decanter.com/wine-news/opinion/how-a-200-tariff-on-french-wine-could-impact-the-us-market-573640/",
    "timestamp": "2026-01-23T06:50:56Z"
  },
  {
    "title": "The Presumption of Regularity Returns to SCOTUS",
    "description": "Trump Firing Lisa Cook, Jack Smith Indicting Donald Trump.",
    "link": "https://reason.com/volokh/2026/01/23/the-presumption-of-regularity-returns-to-scotus/",
    "timestamp": "2026-01-23T06:49:10Z"
  },
  {
    "title": "Trump says US should have tested NATO by invoking Article 5 over border security",
    "description": "President Trump suggested the U.S. should have tested NATO’s commitment by invoking Article 5 in response to the southern border crisis.",
    "link": "https://www.foxnews.com/politics/trump-says-us-should-have-tested-nato-invoking-article-5-over-border-security",
    "timestamp": "2026-01-23T06:49:03Z"
  },
  {
    "title": "Gold, silver and platinum extend record‑setting rally",
    "description": "Spot gold was up 0.4% at $4,957.10 per ounce, as of 0536 GMT, after scaling a record $4,966.59 earlier in the day",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-silver-and-platinum-extend-record%E2%80%90setting-rally/article70541235.ece",
    "timestamp": "2026-01-23T06:44:54Z"
  },
  {
    "title": "TikTok establishes joint venture to avoid US ban",
    "description": "Chinese-owned video platform TikTok has sealed a deal to create a joint venture with American investors. The move allows the popular social app to dodge the threat of being banned in the US. TikTok has set up a majority American-owned joint venture to secure …",
    "link": "https://www.dw.com/en/tiktok-establishes-joint-venture-to-avoid-us-ban/a-75615188",
    "timestamp": "2026-01-23T06:42:00Z"
  },
  {
    "title": "Intel shares tumble 14% as projections fall well short of Wall Street estimates",
    "description": "Current margins ‘by no means acceptable’, says chief financial officer Dave Zinsner in conference call",
    "link": "https://www.irishtimes.com/business/2026/01/23/intel-shares-tumble-14-as-projections-fall-well-short-of-wall-street-estimates/",
    "timestamp": "2026-01-23T06:39:59Z"
  },
  {
    "title": "Putin agrees next steps with US envoys – but Kremlin says territory is key",
    "description": "Russia said it will hold security talks with the U.S. and Ukraine in Abu Dhabi on Friday, but warned after a late-night meeting between President Vladimir Putin and three U.S. envoys that a durable peace would not be possible unless territorial issues were re…",
    "link": "https://www.independent.ie/world-news/europe/putin-agrees-next-steps-with-us-envoys-but-kremlin-says-territory-is-key/a1074933112.html",
    "timestamp": "2026-01-23T06:38:50Z"
  },
  {
    "title": "Rupture or kerfuffle? Trump’s display in mad theatre of Davos has European heads in a spin",
    "description": "It may be premature to think the US-European bond has been  severed by a president with a short attention span and plummeting domestic support",
    "link": "https://www.irishtimes.com/world/us/2026/01/23/rupture-or-kerfuffle-trumps-display-in-mad-theatre-of-davos-has-european-heads-in-a-spin/",
    "timestamp": "2026-01-23T06:38:14Z"
  },
  {
    "title": "Immigrants often don't open the door to ICE, but that may no longer stop officers",
    "description": "It has become common knowledge in immigrant communities across the U.S. to not open the door for federal immigration agents unless they show a warrant signed by a judge",
    "link": "https://abcnews.go.com/US/wireStory/immigrants-open-door-ice-longer-stop-officers-129481957",
    "timestamp": "2026-01-23T06:37:37Z"
  },
  {
    "title": "'Vigilant' Europe eyes next Trump shock after Greenland climbdown",
    "description": "One crisis defused, how long until the next one? European leaders huddled for summit talks Thursday exuding relief at Donald Trump's climbdown on Greenland — but already steeling themselves for the next jolt from the mercurial U.S. leader.",
    "link": "https://www.hurriyetdailynews.com/vigilant-europe-eyes-next-trump-shock-after-greenland-climbdown-218150",
    "timestamp": "2026-01-23T06:37:36Z"
  },
  {
    "title": "As the world remains obsessed with Greenland, Iran burns",
    "description": "Iran unrest: The United States possesses multiple options to assist protesters in Iran. Trump can deploy military assets like carrier strike groups and long-range missiles. Cyber warfare and information operations are also available. These actions could lead …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/view-while-washington-debates-greenland-iran-is-bleeding/articleshow/127241270.cms",
    "timestamp": "2026-01-23T06:34:24Z"
  },
  {
    "title": "TikTok deal timeline: From proposed ban in 2020 to ByteDance JV for US unit sale in 2026 — Here's all you need to know",
    "description": "TikTok deal timeline: Here's all you need to know from the ban first proposed by Donald Trump in 2020, to Congress action, and parent ByteDance forming a JV to sell TikTok's US unit in 2026 in line with the government deal.",
    "link": "https://www.livemint.com/companies/news/tiktok-deal-timeline-donald-trump-proposed-ban-2020-bytedance-jv-transfer-us-ownership-sale-2026-oracle-silver-lake-mgx-11769143425662.html",
    "timestamp": "2026-01-23T06:29:10Z"
  },
  {
    "title": "Japan’s Prime Minister Takaichi dissolves parliament after only 3 months in office, setting up snap election",
    "description": "Japan’s Prime Minister Sanae Takaichi dissolved the lower house of Parliament on Friday, paving the way for a Feb. 8 snap election.",
    "link": "https://nypost.com/2026/01/23/world-news/japans-prime-minister-takaichi-dissolves-parliament-after-only-3-months-in-office/",
    "timestamp": "2026-01-23T06:27:25Z"
  },
  {
    "title": "In Trump v. Dimon, years of strain culminate in $5 billion suit",
    "description": "Donald Trump has sued JPMorgan Chase CEO Jamie Dimon and his bank for $5 billion, alleging they illegally  debanked  Trump's businesses due to his politics.  Despite the lawsuit, JPMorgan's stock rose, and Dimon received a raise. This action highlights Trump'…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/in-trump-v-dimon-years-of-strain-culminate-in-5-billion-suit/articleshow/127240027.cms",
    "timestamp": "2026-01-23T06:25:15Z"
  },
  {
    "title": "Nazis, Soviets and Trump: America's fixation with Greenland",
    "description": "Greenland's strategic importance to the United States began in World War II.  The Cold War saw extensive US military development on the island.  Now, President Trump seeks to acquire Greenland.  This echoes past US military ambitions.  Denmark has historicall…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/nazis-soviets-and-trump-americas-fixation-with-greenland/articleshow/127241523.cms",
    "timestamp": "2026-01-23T06:23:34Z"
  },
  {
    "title": "The making and unmaking of Sher Bahadur Deuba",
    "description": "KATHMANDU: When BP Koirala began taking a young Sher Bahadur Deuba along on nationwide political tours, student leaders of the time objected. Responding to their concerns, BP famously defended Deuba, saying the young man from far-western Nepal was honest, eag…",
    "link": "https://english.khabarhub.com/2026/23/517436/",
    "timestamp": "2026-01-23T06:23:33Z"
  },
  {
    "title": "Donald Trump, Not Unchained (Wall Street Journal)",
    "description": "Wall Street Journal:\nDonald Trump, Not Unchained  —  His reversal on Greenland shows the limits of his power.  —  A funny thing happened this week that you wouldn't think possible from reading the common narrative of President Trump as a Frankenstein's monste…",
    "link": "https://www.memeorandum.com/260123/p3",
    "timestamp": "2026-01-23T06:20:00Z"
  },
  {
    "title": "United States withdraws from the World Health Organization",
    "description": "The United States officially left the World Health Organization on Thursday after a year of warnings that doing so would hurt public health in the U.S. and globally, saying its decision reflected failures in the U.N. health agency's management of the COVID-19…",
    "link": "https://www.citizen.digital/news/united-states-withdraws-from-the-world-health-organization-n376237",
    "timestamp": "2026-01-23T06:16:47Z"
  },
  {
    "title": "Fidan says new ‘Board of Peace’ will gain value as Gaza steps take shape",
    "description": "Foreign Minister Hakan Fidan said on Jan. 22 that the newly launched “Board of Peace” would prove its worth as it moves from declarations to concrete steps, particularly on humanitarian access to Gaza.",
    "link": "https://www.hurriyetdailynews.com/fidan-says-new-board-of-peace-will-gain-value-as-gaza-steps-take-shape-218146",
    "timestamp": "2026-01-23T06:10:00Z"
  },
  {
    "title": "US futures gain as Japan keeps its key interest rate unchanged",
    "description": "Asian shares and U.S. futures are higher after U.S. stocks rose, regaining more of their losses for the week",
    "link": "https://abcnews.go.com/US/wireStory/asian-shares-us-futures-gain-japan-key-interest-129481307",
    "timestamp": "2026-01-23T06:01:39Z"
  },
  {
    "title": "Dan Bongino Tells Sean Hannity What He Has In Mind For ‘Full-Diaper’ Media",
    "description": "Dan Bongino made a scatological reference to two corporate media outlets over their coverage of the Trump administration’s record fighting violent crime.",
    "link": "https://dailycaller.com/2026/01/23/dan-bongino-tells-sean-hannity-what-he-has-in-mind-for-full-diaper-media/",
    "timestamp": "2026-01-23T06:00:44Z"
  },
  {
    "title": "Justine McCarthy: Trump would sooner make apple pie than peace but he has done us one favour",
    "description": "Time has come to throw out that old rule book. The Gordian knot must be cut",
    "link": "https://www.irishtimes.com/opinion/2026/01/23/trump-would-sooner-make-apple-pie-than-peace-but-he-has-done-us-one-favour/",
    "timestamp": "2026-01-23T06:00:01Z"
  },
  {
    "title": "Stephen Collins: How should the EU deal with Trump? Speak softly and carry a big stick",
    "description": "The US is clearly a more formidable power than the UK but the EU has some serious firepower at its disposal. With a wealthy population of 450 million it is the most attractive market on the globe",
    "link": "https://www.irishtimes.com/opinion/2026/01/23/how-should-the-eu-deal-with-trump-speak-softly-and-carry-a-big-stick/",
    "timestamp": "2026-01-23T06:00:01Z"
  },
  {
    "title": "Eddie Hobbs: ‘There is no plan for an Irish Trump. There is no Trump sleeper ready to go’",
    "description": "Prospect of ‘Irish Maga’ movement has been suggested by Steve Bannon, former adviser to US president",
    "link": "https://www.irishtimes.com/politics/2026/01/23/eddie-hobbs-there-is-no-plan-for-an-irish-trump-there-is-no-trump-sleeper-ready-to-go/",
    "timestamp": "2026-01-23T06:00:01Z"
  },
  {
    "title": "Davos 2026: Trump’s Greenland Taco and Carney’s rupture warning",
    "description": "While geopolitics may appear to be unravelling at times, many of the old reliable forces remain constant – not least Davos itself",
    "link": "https://www.irishtimes.com/business/2026/01/23/davos-2026-trumps-greenland-taco-and-carneys-rupture-warning/",
    "timestamp": "2026-01-23T06:00:01Z"
  },
  {
    "title": "Greenland’s PM urges citizens to PREPARE for possible U.S. invasion",
    "description": "Prime Minister Jens-Frederik Nielsen has urged Greenland’s 57,000 residents to stockpile food and prepare for disruptions, citing Trump’s escalating push to acquire the Arctic territory for its strategic and resource value. Trump has refused to rule out milit…",
    "link": "https://www.naturalnews.com/2026-01-23-greenland-pm-urges-citizens-prepare-possible-invasion.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Ritter claims Trump “set up” allies, doomed secret Iran regime change plan",
    "description": "Covert operation to overthrow Iran’s regime was allegedly compromised from the highest levels. Former inspector claims Trump, Netanyahu, and Graham planned it at Mar-a-Lago. The entire spy network was allegedly exposed and destroyed in the failure. Ritter cla…",
    "link": "https://www.naturalnews.com/2026-01-23-ritter-trump-betrayed-allies-iran-regime-change.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "A defiant stand: Congress escalates historic confrontation with the Clintons over Epstein testimony",
    "description": "The House Oversight Committee has advanced contempt of Congress resolutions against Bill and Hillary Clinton for defying subpoenas in the Jeffrey Epstein investigation. The bipartisan committee votes set the stage for a full House vote, which could lead to a …",
    "link": "https://www.naturalnews.com/2026-01-23-congress-confrontation-with-the-clintons-over-epstein-testimony.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Trump’s Greenland gambit: A strategic play for missile defense or geopolitical brinkmanship?",
    "description": "U.S. Treasury Secretary Scott Bessent argues that Greenland is essential for the Golden Dome missile defense program, intercepting potential threats from Russia, China and North Korea via Arctic missile routes. Trump insists on outright U.S. acquisition (not …",
    "link": "https://www.naturalnews.com/2026-01-23-trumps-greenland-gambit-missile-defense-or-brinkmanship.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Trump’s malignant narcissism on full display in Davos",
    "description": "President Donald Trump, addressing the World Economic Forum, transformed the Swiss Alps into a backdrop for a chilling sales pitch, one that treated the sovereign land and people of Greenland as a corporate asset to be acquired by threat or by force. His spee…",
    "link": "https://www.naturalnews.com/2026-01-23-trumps-malignant-narcissism-on-full-display-in-davos.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Trump: Congressional approval may not be needed for $2,000 tariff rebate checks",
    "description": "President Donald Trump said his administration may issue the payments to Americans without congressional approval, citing strong revenue from U.S. import tariffs. The administration argues that tariff revenue could both fund direct payments to households and …",
    "link": "https://www.naturalnews.com/2026-01-23-trump-congress-not-needed-tariff-rebate-checks.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Gold soars past $4,700 amid geopolitical tensions: Will it hit the $5,000 mark?",
    "description": "Gold prices hit an all-time high of $4,765.93/oz, while silver soared to $95.87/oz, driven by geopolitical tensions, a weakening U.S. dollar and systemic distrust in fiat currencies. Analysts see this as a rational response to monetary debasement and instabil…",
    "link": "https://www.naturalnews.com/2026-01-23-gold-silver-soar-amid-geopolitical-tensions.html",
    "timestamp": "2026-01-23T06:00:00Z"
  },
  {
    "title": "Trump backed down over Greenland because he heard UK’s concerns, says Lammy",
    "description": "The deputy PM says the US President rowed back on threats after UK stood up for Denmark's sovereignty.",
    "link": "https://www.bbc.com/news/articles/cm244zlnmkvo",
    "timestamp": "2026-01-23T05:59:34Z"
  },
  {
    "title": "US officially exits World Health Organization, accusing agency of straying 'from its core mission'",
    "description": "It comes exactly one year after President Donald Trump signed an executive order to begin the process of withdrawal.",
    "link": "https://www.kake.com/news/us-officially-exits-world-health-organization-accusing-agency-of-straying-from-its-core-mission/article_4688799d-0539-4c7b-90a3-794e66f8c869.html",
    "timestamp": "2026-01-23T05:57:53Z"
  },
  {
    "title": "Dallas Baptist University evacuated amid threats ahead of speech by Trump's HUD chief Scott Turner",
    "description": "Updated at 3:20 p.m. ET, Jan. 22, 2026: Dallas Baptist University posted an update explaining that \"the Dallas Police Department and the FBI worked alongside our DBU Police Department to investigate the matter, and we can now issue an all-clear.\" According to…",
    "link": "https://freerepublic.com/focus/f-news/4363521/posts",
    "timestamp": "2026-01-23T05:56:59Z"
  },
  {
    "title": "US, Ukraine, Russia to hold security talks in UAE",
    "description": "US, Ukrainian, and Russian officials will hold crucial Ukraine security talks in the UAE to discuss a US-drafted plan aimed at ending the ongoing conflict.\n\nRead More: https://punchng.com/us-ukraine-russia-to-hold-security-talks-in-uae/",
    "link": "https://punchng.com/us-ukraine-russia-to-hold-security-talks-in-uae/",
    "timestamp": "2026-01-23T05:51:20Z"
  },
  {
    "title": "Canada doesn’t live because of US, PM Carney hits back at Trump",
    "description": "Canadian PM Mark Carney refutes Donald Trump’s claim that ‘Canada lives because of the US,’ highlighting growing tensions in Canada US relations.\n\nRead More: https://punchng.com/canada-doesnt-live-because-of-us-pm-carney-hits-back-at-trump/",
    "link": "https://punchng.com/canada-doesnt-live-because-of-us-pm-carney-hits-back-at-trump/",
    "timestamp": "2026-01-23T05:51:20Z"
  },
  {
    "title": "Asian shares, US futures gain as Japan keeps its key interest rate unchanged",
    "description": "Asian shares and U.S. futures are higher after U.S. stocks rose, regaining more of their losses for the week",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-us-futures-gain-japan-key-interest-129481308",
    "timestamp": "2026-01-23T05:49:52Z"
  },
  {
    "title": "Why is South Africa upset about Iran joining BRICS naval drills?",
    "description": "South Africa's government is facing backlash from the US and from within its own administration for hosting Iran's navy.",
    "link": "https://www.aljazeera.com/news/2026/1/23/why-is-south-africa-upset-about-iran-joining-brics-naval-drills",
    "timestamp": "2026-01-23T05:49:21Z"
  },
  {
    "title": "Stephen Colbert Takes Aim at Trump’s Billion-Dollar Board of Peace Entry Fee: ‘Seems a Little Steep’ | Video",
    "description": "\"After all, CBS got to [obey Trump] for just $16 million,\" the late night host adds\nThe post Stephen Colbert Takes Aim at Trump’s Billion-Dollar Board of Peace Entry Fee: ‘Seems a Little Steep’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/stephen-colbert-trump-peace-board-cbs-joke/",
    "timestamp": "2026-01-23T05:47:31Z"
  },
  {
    "title": "Iran warns 'finger on trigger' as Trump says Tehran wants talks",
    "description": "The commander of Iran's Revolutionary Guards warned Washington Thursday that the force had its \"finger on the trigger\" in the wake of mass protests, as U.S. President Donald Trump said Tehran still appeared interested in talks.",
    "link": "https://www.hurriyetdailynews.com/iran-warns-finger-on-trigger-as-trump-says-tehran-wants-talks-218144",
    "timestamp": "2026-01-23T05:46:06Z"
  },
  {
    "title": "Greenland Remaining With Denmark Not Raised During Trump Talks, NATO Chief Says",
    "description": "NATO Secretary-General Mark Rutte said on Jan. 21 that the issue of Greenland remaining part of Denmark did not come up during his meeting with U.S. President Donald Trump.Rutte, in an interview with Fox News, was asked about Greenland’s sovereignty under a p…",
    "link": "https://freerepublic.com/focus/f-news/4363519/posts",
    "timestamp": "2026-01-23T05:46:01Z"
  },
  {
    "title": "Top 5 moments from Jack Smith's testimony on Capitol Hill",
    "description": "Jack Smith testifies before House Judiciary Committee, facing Republican criticism over Trump prosecutions while defending his cases as apolitical.",
    "link": "https://www.foxnews.com/politics/top-5-moments-from-jack-smiths-testimony-capitol-hill",
    "timestamp": "2026-01-23T05:44:36Z"
  },
  {
    "title": "Russia, Ukraine and US to hold trilateral talks in Abu Dhabi",
    "description": "The meeting between the three countries comes as both Ukraine and Russia say no peace deal can be reached until territorial issues are resolved.",
    "link": "https://www.bbc.co.uk/news/articles/cx20011w4zzo",
    "timestamp": "2026-01-23T05:44:21Z"
  },
  {
    "title": "Trump warns “massive fleet” is heading towards Iran",
    "description": "America is closely watching Iran. A large US fleet is moving towards the Gulf region. President Trump warned of severe consequences if Iran attacks. Iran's Foreign Minister stated they will retaliate strongly if attacked. This situation follows recent interna…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-warns-massive-fleet-is-heading-towards-iran/articleshow/127238228.cms",
    "timestamp": "2026-01-23T05:42:15Z"
  },
  {
    "title": "Senior US defence official Colby to visit South Korea and Japan next week, Yonhap says",
    "description": "SEOUL, Jan 23 (Reuters) - U.S. Under Secretary of Defense for policy Elbridge Colby will visit South Korea from Sunday to Tuesday and discuss military alliance issues bef… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/23/senior-us-defence-official-colby-to-visit-south-korea-and-japan-next-week-yonhap-says",
    "timestamp": "2026-01-23T05:40:59Z"
  },
  {
    "title": "Trump’s tariffs do bite — When he actually imposes them",
    "description": "The withdrawal this week of a proposed charge on European nations over Greenland is the latest example of how Trump sometimes wields the tariff weapon without firing it; And the number of unrealised threats is stacking up",
    "link": "https://www.bloomberg.com/news/articles/2026-01-22/trump-s-tariffs-do-bite-when-he-actually-imposes-them",
    "timestamp": "2026-01-23T05:39:04Z"
  },
  {
    "title": "How US president Donald Trump is unravelling the global economic order",
    "description": "The US is no longer predictable nor bound by any fundamental principles of action",
    "link": "https://www.irishtimes.com/business/economy/2026/01/23/trump-is-erasing-the-global-economic-order/",
    "timestamp": "2026-01-23T05:39:00Z"
  },
  {
    "title": "Silver ETFs rally up to 17% in dramatic reversal, but will $100 barrier throw bulls out of the game?",
    "description": "Silver’s sharp rally has boosted Indian silver ETFs, led by a 17% jump in Tata Silver ETF, as global prices near the key $100 level. Gold and silver hit record highs amid geopolitical tensions, a weaker dollar and expectations of Fed rate cuts.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-etfs-rally-up-to-17-in-dramatic-reversal-but-will-100-barrier-throw-bulls-out-of-the-game/articleshow/127238052.cms",
    "timestamp": "2026-01-23T05:38:25Z"
  },
  {
    "title": "Feet dragging, division and obstruction: What Israel really wants for Gaza",
    "description": "Israeli strategy for Gaza caught between settlements and security zones, as it continues to kill Palestinians.",
    "link": "https://www.aljazeera.com/news/2026/1/23/feet-dragging-division-and-obstruction-what-israel-really-wants-for-gaza",
    "timestamp": "2026-01-23T05:37:33Z"
  },
  {
    "title": "TikTok establishes joint venture to end US ban threat",
    "description": "TikTok announced Thursday it has established a majority American-owned joint venture to operate its US business, allowing the company to avoid a ban over its Chinese ownership.",
    "link": "https://www.hurriyetdailynews.com/tiktok-establishes-joint-venture-to-end-us-ban-threat-218142",
    "timestamp": "2026-01-23T05:36:51Z"
  },
  {
    "title": "Trump rescinds Canada's invitation to join his 'Board of Peace'",
    "description": "President Trump revoked Canada's Prime Minister Mark Carney's invitation to his \"Board of Peace\" following Carney's public criticism of \"America First\" policies and authoritarianism. This move escalates tensions between the US and Canada, impacting trade rela…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-rescinds-canadas-invitation-to-join-his-board-of-peace/articleshow/127237662.cms",
    "timestamp": "2026-01-23T05:34:17Z"
  },
  {
    "title": "US, Ukrainian and Russian negotiators to meet in UAE for security talks",
    "description": "Ukrainian, U.S. and Russian officials will hold security talks in the United Arab Emirates on Friday, the Kremlin said, following a meeting of top U.S. negotiators with President Vladimir Putin in Moscow on a U.S.-drafted plan to end the Ukraine war.",
    "link": "https://www.hurriyetdailynews.com/us-ukrainian-and-russian-negotiators-to-meet-in-uae-for-security-talks-218141",
    "timestamp": "2026-01-23T05:33:57Z"
  },
  {
    "title": "Trump’s mortgage bond plan shows limited impact as market risks cloud housing outlook",
    "description": "President Trump’s mortgage bond plan is offering only marginal relief, with Reuters noting limited impact on mortgage rates and persistent affordability pressures. Analysts say structural supply shortages—not financing—are the main constraint on the U.S. hous…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/trumps-mortgage-bond-plan-shows-limited-impact-as-market-risks-cloud-housing-outlook/articleshow/127237397.cms",
    "timestamp": "2026-01-23T05:33:20Z"
  },
  {
    "title": "‘Donald Trump was looking for ways to stay in power after Biden loss’",
    "description": "Former US special counsel Jack Smith, who unsuccessfully prosecuted president Donald Trump, told a House of Representatives panel yesterday that Mr Trump was “looking for ways to stay in power” following his defeat in the 2020 election as he confronted Republ…",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-was-looking-for-ways-to-stay-in-power-after-biden-loss/a175120315.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Jared Kushner announces plans for Dubai-style ‘New Gaza’ development",
    "description": "The United States announced plans yesterday for a “New Gaza”, rebuilt from scratch to include residential towers, data centres and seaside resorts, part of Donald Trump’s push to advance an Israel-Hamas ceasefire shaken by repeated violations.",
    "link": "https://www.independent.ie/world-news/jared-kushner-announces-plans-for-dubai-style-new-gaza-development/a1978446153.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Theodore R Johnson: How Donald Trump’s chokehold on control thins democracy in passive America",
    "description": "Since the new year began, the federal government of America has already searched a journalist’s home, captured Venezuelan president Nicolas Maduro in a military strike, threatened to seize Greenland and violate Nato commitments, and opened a criminal investig…",
    "link": "https://www.independent.ie/opinion/comment/theodore-r-johnson-how-donald-trumps-chokehold-on-control-thins-democracy-in-passive-america/a1524008614.html",
    "timestamp": "2026-01-23T05:30:00Z"
  },
  {
    "title": "Mary Regan: Davos was a wake-up call for EU leaders on transatlantic change",
    "description": "EU leaders gathered in Brussels for what was supposed to be an opportunity to forge a united front against Donald Trump’s threats to impose tariffs on countries that stood in the way of his Greenland ambitions.",
    "link": "https://www.independent.ie/opinion/analysis/mary-regan-davos-was-a-wake-up-call-for-eu-leaders-on-transatlantic-change/a891086296.html",
    "timestamp": "2026-01-23T05:30:00Z"
  }
]