[
  {
    "title": "Principal booked for abetting teacher’s suicide in Bidadi",
    "description": "Bengaluru: A 45-year-old principal with a private international school in Bidadi was arrested on charges of abetting the suicide of his 37-year-old st.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/principal-booked-for-abetting-teachers-suicide-in-bidadi/articleshow/128476953.cms",
    "timestamp": "2026-02-17T21:40:00Z"
  },
  {
    "title": "Man kills father with baseball bat over property dispute in Bengaluru",
    "description": "Bengaluru: A 70-year-old man who was attacked allegedly by his son with a baseball bat over a property dispute died while undergoing treatment in a ho.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/man-kills-father-with-baseball-bat-over-property-dispute-in-bengaluru/articleshow/128476926.cms",
    "timestamp": "2026-02-17T21:39:00Z"
  },
  {
    "title": "France and India hail growing ties as Modi hosts Macron",
    "description": "France's president and India's prime minister hailed France-India ties as a pillar of \"global stability\".",
    "link": "https://www.channelnewsasia.com/world/france-india-macron-modi-tech-defence-5936881",
    "timestamp": "2026-02-17T21:39:00Z"
  },
  {
    "title": "Special drive on: Bengaluru police warn parents against giving vehicles to minor children",
    "description": "Bengaluru: Following two major accidents on the outskirts of the city that claimed the lives of 12 youths, city police commissioner Seemant Kumar Sing.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/special-drive-on-bengaluru-police-warn-parents-against-giving-vehicles-to-minor-children/articleshow/128476921.cms",
    "timestamp": "2026-02-17T21:39:00Z"
  },
  {
    "title": "Warner Bros rejects latest Paramount bid but open to ‘best and final’ offer",
    "description": "The Warner Bros Discovery board says it remains committed to the Netflix deal.",
    "link": "https://www.aljazeera.com/economy/2026/2/17/warner-bros-rejects-latest-paramount-bid-but-open-to-best-and-final-offer",
    "timestamp": "2026-02-17T21:35:03Z"
  },
  {
    "title": "Stripe's crypto unit Bridge obtains initial approval to establish a trust bank",
    "description": "Feb 17 : Bridge has gained conditional approval to set up a national trust bank from a top U.S. financial regulator, the Stripe-owned stablecoin infrastructure provider said on Tuesday.Crypto giants, including Ripple and Circle, in December received prelimina…",
    "link": "https://www.channelnewsasia.com/business/stripes-crypto-unit-bridge-obtains-initial-approval-establish-trust-bank-5936891",
    "timestamp": "2026-02-17T21:34:51Z"
  },
  {
    "title": "Stephen Colbert says CBS blocked interview with Texas Democrat over FCC concerns",
    "description": "Lawyers for CBS’ parent company barred airing interview with Senate candidate, host says.",
    "link": "https://syndication.washingtonpost.com/nss/stories/652OJEV6W5GDLLLDSL7ZO2ZJOQ",
    "timestamp": "2026-02-17T21:34:23Z"
  },
  {
    "title": "Trump administration sued for Stonewall Pride flag removal in New York",
    "description": "The suit comes a day after a judge in Philadelphia ordered the National Park Service to restore an exhibit about slaves owned by President George Washington.",
    "link": "https://www.cnbc.com/2026/02/17/trump-pride-flag-stonewall-monument-lgbtq.html",
    "timestamp": "2026-02-17T21:33:55Z"
  },
  {
    "title": "Stephen Colbert says CBS pulled candidate interview ahead of early voting in Texas",
    "description": "Late-night host Stephen Colbert said his interview with Democratic Texas Senate candidate James Talarico was pulled from Monday night's broadcast over network fears it would violate regulatory guidance from the Trump administration on giving equal time to pol…",
    "link": "https://www.pbs.org/newshour/politics/stephen-colbert-says-cbs-pulled-candidate-interview-ahead-of-early-voting-in-texas",
    "timestamp": "2026-02-17T21:33:43Z"
  },
  {
    "title": "Tina Ambani skips ED summons, 2nd in a month",
    "description": "Tina Ambani, wife of Anil Ambani, missed her second Enforcement Directorate summons regarding a money laundering probe. Her husband, Anil Ambani, is also under investigation for a Rs 40,000 crore laundering case. The ED is seeking international cooperation to…",
    "link": "https://timesofindia.indiatimes.com/india/tina-ambani-skips-ed-summons-2nd-in-a-month/articleshow/128481332.cms",
    "timestamp": "2026-02-17T21:32:49Z"
  },
  {
    "title": "A Hectic Day for U.S. Negotiators",
    "description": "Washington is trying to tackle Iran’s nuclear ambitions and the Russia-Ukraine war at the same time.",
    "link": "http://foreignpolicy.com/2026/02/17/us-negotiations-geneva-iran-nuclear-deal-russia-ukraine-war/",
    "timestamp": "2026-02-17T21:31:49Z"
  },
  {
    "title": "Activists protest HHS rules against gender-affirming care; 24 arrested",
    "description": "More than 50 activists protested Tuesday in Washington, D.C., over proposed federal rules that would effectively block access to gender-affirming care for transgender minors.",
    "link": "https://www.advocate.com/health/transgender-health/protest-anti-transgender-hhs-rules",
    "timestamp": "2026-02-17T21:31:36Z"
  },
  {
    "title": "Did George W. Bush Shade Trump’s Character? CNN Panel Debates",
    "description": "\"I mean, is he right that Trump is really kind of pushing back and defying the George Washington model for the presidency?\"\nThe post Did George W. Bush Shade Trump’s Character? CNN Panel Debates first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/did-george-w-bush-shade-trumps-character-cnn-panel-debates/",
    "timestamp": "2026-02-17T21:30:21Z"
  },
  {
    "title": "Analysis-US envoys juggle two crisis talks, raising questions about prospects for success",
    "description": "By Matt Spetalnick, Olivia Le Poidevin and Parisa HafeziWASHINGTON/GENEVA/DUBAI, Feb 17 (Reuters) - Even for a U.S. president long fixated on deal-making, Donald Trump’s … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/17/analysis-us-envoys-juggle-two-crisis-talks-raising-questions-about-prospects-for-success",
    "timestamp": "2026-02-17T21:30:05Z"
  },
  {
    "title": "Endangerment Finding Rescission Major Win for Science and the Rule of Law",
    "description": "The Trump administration’s decision to rescind the endangerment finding regarding carbon dioxide emissions from vehicles is a huge win for all Americans … and the... Read More\nThe post Endangerment Finding Rescission Major Win for Science and the Rule of Law …",
    "link": "https://www.dailysignal.com/2026/02/17/endangerment-finding-rescission-major-win-for-science-and-the-rule-of-law/",
    "timestamp": "2026-02-17T21:30:00Z"
  },
  {
    "title": "Stephen Colbert says CBS blocked interview with Democratic candidate James Talarico",
    "description": "Late-night host Stephen Colbert said his interview with Democratic Texas Senate candidate James Talarico was pulled from Monday night's broadcast over network fears it would violate regulatory guidance from the Trump administration on giving equal time to pol…",
    "link": "https://www.cbc.ca/news/entertainment/stephen-colbert-james-talarico-9.7094223",
    "timestamp": "2026-02-17T21:28:36Z"
  },
  {
    "title": "RPF cop kneels on youth's neck, probe ordered as clip goes viral",
    "description": "A Railway Protection Force constable is under investigation. He was seen in a video kneeling on a youth's neck at Tiruvottiyur railway station. The youth was reportedly travelling without a ticket and was drunk. The incident drew widespread condemnation onlin…",
    "link": "https://timesofindia.indiatimes.com/india/rpf-cop-kneels-on-youths-neck-probe-ordered-as-clip-goes-viral/articleshow/128481187.cms",
    "timestamp": "2026-02-17T21:26:28Z"
  },
  {
    "title": "Springsteen jabs Trump as 'wannabe king' as famed rocker launches concert tour ‘in defense of America’",
    "description": "Bruce Springsteen announces 20-date \"Land of Hope and Dreams American Tour\" with E Street Band starting March 31, charging that President Donald Trump is a \"wannabe king.\"",
    "link": "https://www.foxnews.com/politics/springsteen-jabs-trump-wannabe-king-famed-rocker-launches-concert-tour-in-defense-america",
    "timestamp": "2026-02-17T21:24:15Z"
  },
  {
    "title": "Potomac River record sewage spill leads to blame game between Trump and Democratic governors",
    "description": "The collapse of a pipe on the Potomac Interceptor sewer line caused more than 200 million gallons of sewer wastewater to gush into the Potomac River.",
    "link": "https://www.cnbc.com/2026/02/17/potomac-sewage-spill-trump-democratic-governors-spanberger-moore.html",
    "timestamp": "2026-02-17T21:24:04Z"
  },
  {
    "title": "Middle East Buildup Continues as Six F-22 Raptors Stopover at RAF Lakenheath",
    "description": "The deployment of F-22s towards the Middle East has been considered by many to be one of the final pieces of the puzzle regarding U.S. preparations for potential offensive action against Iran.  The Langley Air Force Base (AFB) jets landed at the UK base short…",
    "link": "https://theaviationist.com/2026/02/17/six-f22-raptors-arrive-raf-lakenheath/",
    "timestamp": "2026-02-17T21:23:40Z"
  },
  {
    "title": "Coalition Sues Trump Admin Over 'Unlawful' Approval of LNG Export Project",
    "description": "A coalition of green groups filed a lawsuit Tuesday contesting the Trump administration's approval of what would be one of the world's largest liquefied natural gas facilities—permission granted despite the project's threats to frontline communities, the envi…",
    "link": "https://www.commondreams.org/news/cp2-lng-lawsuit",
    "timestamp": "2026-02-17T21:23:25Z"
  },
  {
    "title": "Billionaire Trump supporter blocks sale of Texas warehouse for use as ICE jail",
    "description": "Majestic Realty Co. is one of several companies to say no DHS after community backlash.",
    "link": "https://fortune.com/2026/02/17/billionaire-trump-supporter-blocks-sale-of-texas-warehouse-for-use-as-ice-jail/",
    "timestamp": "2026-02-17T21:22:47Z"
  },
  {
    "title": "Gavin Newsom and UK’s Ed Miliband aim to burn their nations on the altar of eco-lunacy",
    "description": "California Gov. Gavin Newsom and United Kingdom climate secretary Ed Miliband, followers of the death cult of eco-lunacy and hellbent on sacrificing their nation's economic health at the altar of “Saving the Planet,” just signed a dubious \"clean energy\" deal.",
    "link": "https://nypost.com/2026/02/17/opinion/gavin-newsom-and-uks-ed-miliband-aim-to-destory-their-nations-for-the-sake-of-eco-lunacy/",
    "timestamp": "2026-02-17T21:22:09Z"
  },
  {
    "title": "President Donald Trump pays tribute to ‘good man’ Jesse Jackson - but alleges he ‘could not stand’ Barack Obama",
    "description": "He died aged 84 after long struggles with Parkinson's disease and progressive PSP.",
    "link": "https://bangpremier.com/story/8/3478350/president-donald-trump-pays-tribute-to-good-man-jesse-jackson-but-alleges-he-could-not-stand-barack-obama",
    "timestamp": "2026-02-17T21:21:21Z"
  },
  {
    "title": "Fox Anchor Asks Vance If Chinese-American Should Have Her ‘Status Changed’ After Skiing For China in Olympics",
    "description": "Fox News anchor Martha MacCallum asked JD Vance if Eileen Gu's \"status\" should change after the American skier has competed for China in the Olympics\nThe post Fox Anchor Asks Vance If Chinese-American Should Have Her ‘Status Changed’ After Skiing For China in…",
    "link": "https://www.mediaite.com/media/news/fox-anchor-asks-vance-if-chinese-american-should-have-her-status-changed-after-skiing-for-china-in-olympics/",
    "timestamp": "2026-02-17T21:21:05Z"
  },
  {
    "title": "SSLC & II PU exam preparation in full swing in schools",
    "description": "Bengaluru: Around 9 lakh students will appear for SSLC and 7.1 lakh for II PU exam this year, which will be held from March 18 and Feb 28, respectivel.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/sslc-ii-pu-exam-preparation-in-full-swing-in-schools/articleshow/128476834.cms",
    "timestamp": "2026-02-17T21:21:00Z"
  },
  {
    "title": "Poland scraps ‘gender training’ course for military",
    "description": "The Polish military has scrapped a new gender training course after it faced a widespread backlash Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632691-poland-military-gender-training/",
    "timestamp": "2026-02-17T21:19:24Z"
  },
  {
    "title": "MAGA White Supremacists Are a Bunch of Pathetic Losers (Paul Waldman/The Cross Section)",
    "description": "Paul Waldman / The Cross Section:\nMAGA White Supremacists Are a Bunch of Pathetic Losers  —  The proper response to these whiners is mockery and contempt. … Among the deep and probably lasting ways Donald Trump transformed the Republican Party and American co…",
    "link": "https://www.memeorandum.com/260217/p74",
    "timestamp": "2026-02-17T21:15:01Z"
  },
  {
    "title": "Iran announces closure of vital shipping route during US nuclear talks",
    "description": "Iran says it temporarily closed the Strait of Hormuz — a vital international shipping route — as it entered a new round of talks with the US over its nuclear capabilities.",
    "link": "https://www.abc.net.au/news/2026-02-18/iran-announces-closure-of-hormuz-strait-amid-us-nuclear-talks/106356970",
    "timestamp": "2026-02-17T21:14:58Z"
  },
  {
    "title": "Whoopi Goldberg responds to her name in Epstein files",
    "description": "Whoopi Goldberg pushed back after her name appeared in files tied to Jeffrey Epstein, stressing that the irrelevant mention doesn't imply wrongdoing.",
    "link": "https://www.washingtonexaminer.com/news/entertainment/4460746/whoopi-goldberg-responds-epstein-denies-any-connection/",
    "timestamp": "2026-02-17T21:14:05Z"
  },
  {
    "title": "“Terrible Thing”: Hugh Laurie Laments ‘Tehran’ Producer Dana Eden’s Sudden Death",
    "description": "Hugh Laurie is mourning the death of Tehran producer Dana Eden. The Night Manager star made a rare appearance on social media today to call Eden’s apparent suicide a “terrible thing.” Having been introduced in Tehran’s Season 3 as South African nuclear inspec…",
    "link": "http://deadline.com/2026/02/hugh-laurie-tehran-producer-death-1236727456/",
    "timestamp": "2026-02-17T21:12:12Z"
  },
  {
    "title": "How the global effort to keep AI safe went off the rails",
    "description": "Those gathered in New Delhi are no longer obsessing about how to control AI risks but figuring out who can benefit.",
    "link": "https://www.politico.eu/article/how-the-global-effort-to-keep-ai-safe-went-off-the-rails/",
    "timestamp": "2026-02-17T21:11:13Z"
  },
  {
    "title": "This unscrupulous Trumper's involvement in the Georgia elections raid should worry us all",
    "description": "When the FBI carried out its controversial raid last month at the election headquarters of Fulton County, Georgia, it was already guaranteed to inflame partisan tensions.What made the episode more striking was the presence of Andrew Bailey.The former Missouri…",
    "link": "https://www.rawstory.com/fulton-county-2675273284/",
    "timestamp": "2026-02-17T21:11:02Z"
  },
  {
    "title": "Donald Trump Health: POTUS Has 3 Months to Live After Suffering a Stroke, CKD, Source Claims",
    "description": "Explore the ongoing speculations about Donald Trump's health, including claims of serious conditions, and the White House's defense of the former president's well-being.",
    "link": "https://www.ibtimes.co.uk/trump-health-speculations-white-house-denials-1779807",
    "timestamp": "2026-02-17T21:10:46Z"
  },
  {
    "title": "Breaking down claim DOJ released unredacted Epstein files to other countries",
    "description": "Supposed unredacted files showing Trump with young girls show clear signs of AI generation.",
    "link": "https://www.snopes.com//news/2026/02/17/epstein-files-other-countries/",
    "timestamp": "2026-02-17T21:10:00Z"
  },
  {
    "title": "Trump's election bill tops 50 Senate votes, but Democrats could still block it",
    "description": "The SAVE America Act to require proof of citizenship nationwide to vote has now topped 50 votes in the Republican-controlled Senate.",
    "link": "https://www.nbcnews.com/politics/congress/trumps-election-bill-save-america-act-50-senate-votes-democrats-block-rcna259351",
    "timestamp": "2026-02-17T21:09:50Z"
  },
  {
    "title": "Mark Kelly eyes 2028 White House run while fighting Trump demotion threat",
    "description": "A federal judge blocked the Pentagon from demoting Senator Mark Kelly over a video about \"illegal orders\" as the Arizona Democrat considers a 2028 presidential run.",
    "link": "https://www.foxnews.com/politics/mark-kelly-eyes-2028-white-house-run-fighting-trump-demotion-threat",
    "timestamp": "2026-02-17T21:08:55Z"
  },
  {
    "title": "What do the Epstein files reveal now? #politics",
    "description": "Renewed scrutiny and political fallout The recent releases from the Jeffrey Epstein document trove and subsequent Justice Department correspondence have reignited scrutiny of powerful figures and officials who appear in the material. Attorney General Pam Bond…",
    "link": "https://alltoc.com/politics/what-do-the-epstein-files-reveal-now",
    "timestamp": "2026-02-17T21:05:27Z"
  },
  {
    "title": "Democrats’ new ‘Trans Bill of Rights’ looks to undo Trump protections for women’s spaces",
    "description": "Demanding 'equal access' to 'the full range of places and services that members of the general public utilize'",
    "link": "https://www.wnd.com/2026/02/democrats-new-trans-bill-rights-looks-undo-trump/",
    "timestamp": "2026-02-17T21:05:01Z"
  },
  {
    "title": "What to know about the 'equal time' rule and Colbert's Talarico interview",
    "description": "Stephen Colbert’s comments that network executives pulled his interview with Democratic Texas Senate candidate James Talarico over fears it would violate regulatory guidance from the Trump administration has prompted a conversation about how media outlets tre…",
    "link": "https://apnews.com/article/stephen-colbert-james-talarico-equal-time-6cd29992ae2170ab6d10c3ddca92ec98",
    "timestamp": "2026-02-17T21:04:02Z"
  },
  {
    "title": "Man arrested after running toward US capitol with loaded shotgun, say police",
    "description": "Feb 17 (Reuters) - An ⁠18-year-old man ran toward the U.S. Capitol ⁠with a loaded shotgun on Tuesday before ‌police arrested him without incident, said U.S. Capitol Police Chief Michael Sullivan. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/18/man-arrested-after-running-toward-us-capitol-with-loaded-shotgun-say-police",
    "timestamp": "2026-02-17T21:01:00Z"
  },
  {
    "title": "Video: Cuba, Destroying an Entire Country",
    "description": "Following the U.S. attack on Venezuela and the kidnapping of President Maduro, Cuba is the object of a process of deliberate destabilization: An entire country is targeted on the orders of Donald Trump It’s “The Blockade of Cuba” which has triggered a social …",
    "link": "https://www.globalresearch.ca/video-cuba-destroying-an-entire-country/5916294",
    "timestamp": "2026-02-17T21:00:38Z"
  },
  {
    "title": "House GOP's razor-thin majority threatens to grind Trump's Capitol Hill agenda to halt",
    "description": "Speaker Mike Johnson is encountering growing difficulties as rebellious House Republicans team up with Democrats to inflict procedural defeats.",
    "link": "https://www.foxnews.com/politics/house-gops-razor-thin-majority-threatens-grind-trumps-capitol-hill-agenda",
    "timestamp": "2026-02-17T21:00:12Z"
  },
  {
    "title": "DC Water’s CEO Oversaw $520 Million In DEI Contracts — And The Biggest Sewage Spill In US History",
    "description": "While gallons of raw sewage accumulated in its pipes, DC Water was focused on DEI — setting the stage for what may be the largest sewage spill in US history.",
    "link": "https://dailycaller.com/2026/02/17/david-gadis-dc-water-sewage-spill-diversity-dei-flint-michigan-water-crisis/",
    "timestamp": "2026-02-17T20:55:29Z"
  },
  {
    "title": "Hillary Clinton slams Trump's Epstein 'cover-up' as she claims Bill only flew on Lolita Express for 'charity work'",
    "description": "Hillary Clinton has accused Donald Trump of an Epstein files 'cover-up' - and attempted to downplay her husband Bill's friendship with the pedophile.......But seconds later, the 78-year-old added: 'We have a very clear record we're willing to talk about. My h…",
    "link": "https://freerepublic.com/focus/f-chat/4367228/posts",
    "timestamp": "2026-02-17T20:55:02Z"
  },
  {
    "title": "Man arrested after running toward US capitol with loaded shotgun, say police",
    "description": "Feb 17 (Reuters) - An 18-year-old man ran toward the U.S. Capitol with a loaded shotgun on Tuesday before police arrested him without incident, said U.S. Capitol Police C… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/17/man-arrested-after-running-toward-us-capitol-with-loaded-shotgun-say-police",
    "timestamp": "2026-02-17T20:53:38Z"
  },
  {
    "title": "‘Don’t want a diversity hire at the yoke’: Feds order airlines to hire pilots based on merit, not ideology",
    "description": "Passengers 'want the best pilot money can buy, regardless of skin tone or plumbing'",
    "link": "https://www.wnd.com/2026/02/dont-want-diversity-hire-yoke-feds-order-airlines/",
    "timestamp": "2026-02-17T20:52:40Z"
  },
  {
    "title": "'The Late Show' host Stephen Colbert says CBS pulled his interview with a Democratic lawmaker — so he turned to YouTube",
    "description": "\"The Late Show\" host Stephen Colbert said CBS blocked an interview over FCC concerns. It highlights tension between broadcasters and their talent.",
    "link": "https://www.businessinsider.com/colbert-says-cbs-pulled-talarico-interview-fcc-2026-2",
    "timestamp": "2026-02-17T20:51:32Z"
  },
  {
    "title": "Attention-Seeking Donald Trump Begs for Praise Over Nonexistent Tax Breaks",
    "description": "Attention-Seeking Donald Trump Begs for Praise Over Nonexistent Tax Breaksthedailybeast.com",
    "link": "https://www.thedailybeast.com/attention-seeking-donald-trump-begs-for-praise-over-nonexistent-tax-breaks/",
    "timestamp": "2026-02-17T20:51:02Z"
  },
  {
    "title": "Trump Admin Warns Tough New Visa Consequences During High-Profile Visit",
    "description": "U.S. Secretary of State Marco Rubio on Monday delivered a blunt warning to foreign nationals entering the United States, saying visas are a privilege and will be revoked if visitors engage in activity deemed harmful to American national interests. Speaking du…",
    "link": "https://freerepublic.com/focus/f-news/4367224/posts",
    "timestamp": "2026-02-17T20:49:05Z"
  },
  {
    "title": "Hillary Clinton Snaps At BBC Reporter",
    "description": "Hillary Clinton interrupted BBC Berlin correspondent Jessica Parker to falsely assert Donald Trump had \"never criticized\" Vladimir Putin.",
    "link": "https://dailycaller.com/2026/02/17/hillary-clinton-bbc-reporter-trump-putin/",
    "timestamp": "2026-02-17T20:48:32Z"
  },
  {
    "title": "Fresh Poll Highlights What Americans Truly Think Of Melania Trump Compared To Past First Ladies",
    "description": "Melania’s results closely mirrored those of her husband.",
    "link": "https://www.boredpanda.com/poll-highlights-what-americans-truly-think-of-melania-trump-compared-to-past-first-ladies/",
    "timestamp": "2026-02-17T20:46:56Z"
  },
  {
    "title": "Trump Posts Old Photos With Jesse Jackson in Bid to Rewrite History",
    "description": "Donald Trump has gone on a posting binge following the death of civil rights activist and Democratic politician Jesse Jackson, even though Jackson opposed and criticized Trump.Trump posted 12 photos of himself and Jackson from decades ago on his Truth Social …",
    "link": "https://newrepublic.com/post/206676/trump-posts-old-photos-jesse-jackson",
    "timestamp": "2026-02-17T20:46:48Z"
  },
  {
    "title": "Iranian Foreign Minister Says Progress Made in Nuclear Talks With US",
    "description": "GENEVA, Feb 17 (Reuters) — Iran and the United States reached an understanding on Tuesday on main “guiding principles” in talks aimed at resolving their longstanding nuclear... Read More\nThe post Iranian Foreign Minister Says Progress Made in Nuclear Talks Wi…",
    "link": "https://www.dailysignal.com/2026/02/17/iranian-foreign-minister-says-progress-made-in-nuclear-talks-with-us/",
    "timestamp": "2026-02-17T20:45:00Z"
  },
  {
    "title": "Yemeni Americans feel ‘betrayed’ as Trump revokes immigration protections",
    "description": "Prominent Trump supporter Amer Ghalib says US decision to nix deportation protection for Yemenis 'very unfortunate'.",
    "link": "https://www.aljazeera.com/news/2026/2/17/yemeni-americans-feel-betrayed-as-trump-revokes-immigration-protections",
    "timestamp": "2026-02-17T20:44:52Z"
  },
  {
    "title": "JD Vance: 'Trump has shown clearly he is not Barack Obama'",
    "description": "US Vice President tells Fox News President Trump is more willing to act 'aggressively' to protect America's national security, an Iranian nuke would be 'awful for the future of our children.'",
    "link": "https://www.israelnationalnews.com/news/422576",
    "timestamp": "2026-02-17T20:44:14Z"
  },
  {
    "title": "No One Knows How Trump’s Pardon Process Actually Works",
    "description": "Donald Trump’s pardoning process has devolved into something that doesn’t make sense to anybody invested in the process.After issuing thousands of pardons within hours of returning to office, Trump’s pardon pipeline went silent, even going so far as to ice ou…",
    "link": "https://newrepublic.com/post/206678/no-one-knows-trump-pardon-process-actually-works-chaos",
    "timestamp": "2026-02-17T20:39:39Z"
  },
  {
    "title": "Will increasing tensions with Iran boil over into war?",
    "description": "President Donald Trump has recently been threatening the country",
    "link": "https://theweek.com/world-news/increasing-tensions-iran-war-us",
    "timestamp": "2026-02-17T20:37:00Z"
  },
  {
    "title": "‘Astonishing Coincidence!’ Piers Morgan Calls Out Guest For Losing Hearing When Asked ‘Who Pays You’",
    "description": "Michael Tracey said his audio cut out right as he was being asked if he is paid by men tied to Jeffrey Epstein during an appearance on Piers Morgan's show\nThe post ‘Astonishing Coincidence!’ Piers Morgan Calls Out Guest For Losing Hearing When Asked ‘Who Pays…",
    "link": "https://www.mediaite.com/media/astonishing-coincidence-piers-morgan-calls-out-guest-for-losing-hearing-when-asked-who-pays-you/",
    "timestamp": "2026-02-17T20:36:30Z"
  },
  {
    "title": "Meet the 26-Year-Old Ex-Receptionist Overseeing Trump’s Ballroom",
    "description": "President Donald Trump was so desperate to stack the commission overseeing the construction of his ballroom with allies, that he tapped his 26-year-old assistant to serve as its newest member—even though she has absolutely no expertise in art at all.Chamberla…",
    "link": "https://newrepublic.com/post/206677/meet-26-year-old-ex-receptionist-overseeing-trump-ballroom-chamberlain-harris",
    "timestamp": "2026-02-17T20:33:58Z"
  },
  {
    "title": "Stephen Colbert slams CBS, says network blocked James Talarico interview",
    "description": "\"The Late Show\" host Stephen Colbert criticized CBS on Monday night, saying the network blocked his interview with U.S. Senate hopeful James Talarico from airing.",
    "link": "https://www.cbsnews.com/news/stephen-colbert-cbs-james-talarico-interview-the-late-show/",
    "timestamp": "2026-02-17T20:32:59Z"
  },
  {
    "title": "An oral history of the Trump shock",
    "description": "This (gift link; h/t commenter Shirley0401) looks like a really interesting oral history of the reaction of people in and around the Obama administration to Trump’s win in 2016. Oral histories can be extremely useful, because they allow historians and others …",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/an-oral-history-of-the-trump-shock",
    "timestamp": "2026-02-17T20:32:17Z"
  },
  {
    "title": "Armed man wearing tactical vest arrested outside the U.S. Capitol, police say",
    "description": "WASHINGTON — An 18-year-old man was arrested on Tuesday after he began rushing towards the U.S.",
    "link": "https://www.nbcnews.com/politics/politics-news/armed-man-wearing-tactical-vest-arrested-us-capitol-police-say-rcna259411",
    "timestamp": "2026-02-17T20:31:42Z"
  },
  {
    "title": "The Irish Times view on Seamus Culleton: bringing cruelty closer to home",
    "description": "Performative cruelty is designed to deter illegal entry and encourage undocumented to ‘self-deport’",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/02/17/the-irish-times-view-on-seamus-culleton-bringing-cruelty-closer-to-home/",
    "timestamp": "2026-02-17T20:30:00Z"
  },
  {
    "title": "'You're Going to See More Defections': Thomas Massie's Ominous Prediction for the GOP (Meredith Lee Hill/Politico)",
    "description": "Meredith Lee Hill / Politico:\n'You're Going to See More Defections': Thomas Massie's Ominous Prediction for the GOP  —  In a new interview, the Republican congressman opens up about Donald Trump, Mike Johnson and his strategy to dig even deeper into the Epste…",
    "link": "https://www.memeorandum.com/260217/p67",
    "timestamp": "2026-02-17T20:25:01Z"
  },
  {
    "title": "Democrat: 'Let's Start Calling This The Trump Epstein Files'",
    "description": "Rep Dan Goldman went on MS NOW to discuss the Epstein Files and made some interesting comments:\n\nHOST: The email you referenced, has it been unredacted yet? \r\n\nGOLDMAN: No, it has not, and there will be more to come. And the importance of it is far greater in…",
    "link": "https://crooksandliars.com/2026/02/goldman-lets-start-calling-trump-epstein",
    "timestamp": "2026-02-17T20:23:59Z"
  },
  {
    "title": "Trump Is Playing Good Cop/Bad Cop With Europe",
    "description": "The United States is conducting diplomacy by way of the \"Law and Order\" television show.",
    "link": "http://foreignpolicy.com/2026/02/17/trump-europe-munich-vance-rubio-good-bad-cop/",
    "timestamp": "2026-02-17T20:23:45Z"
  },
  {
    "title": "Whoopi Goldberg shuts down any links to Epstein while addressing name appearing in files on 'The View'",
    "description": "Whoopi Goldberg addressed her name appearing in the Jeffrey Epstein files during \"The View\" on Tuesday, firmly denying any connection to the convicted sex offender.",
    "link": "https://www.foxnews.com/media/whoopi-goldberg-shuts-down-any-links-epstein-while-addressing-name-appearing-files-the-view",
    "timestamp": "2026-02-17T20:23:31Z"
  },
  {
    "title": "Why America may not have won World War II without its secret weapon: Greenland",
    "description": "A month after the Nazis seized Denmark, five American Coast Guard cutters set sail for Greenland.",
    "link": "https://fortune.com/2026/02/17/why-america-may-not-have-won-world-war-ii-without-its-secret-weapon-greenland/",
    "timestamp": "2026-02-17T20:23:02Z"
  },
  {
    "title": "Stephen Colbert Hands CBS Bosses Their Asses AGAIN, With An Assist From James Talarico",
    "description": "That's entertainment!",
    "link": "https://www.wonkette.com/p/stephen-colbert-hands-cbs-bosses",
    "timestamp": "2026-02-17T20:21:51Z"
  },
  {
    "title": "US threatens to quit International Energy Agency if it doesn’t drop green transition",
    "description": "Energy Secretary Chris Wright wants the IEA to stop behaving like a \"climate advocacy organization\" and focus on \"energy security.\"",
    "link": "https://www.politico.eu/article/us-threatens-to-quit-international-energy-agency-if-it-doesnt-drop-energy-transition-chris-wright/",
    "timestamp": "2026-02-17T20:21:19Z"
  },
  {
    "title": "US president’s son Eric Trump invests in drone maker with gov’t contracts",
    "description": "Israel's Xtend recently won US Defense Department contract, is bidding for another before merger with JFB Construction.",
    "link": "https://www.aljazeera.com/economy/2026/2/17/us-presidents-son-eric-trump-invests-in-drone-maker-with-govt-contracts",
    "timestamp": "2026-02-17T20:21:10Z"
  },
  {
    "title": "‘I’m Not A Socialist’: Michigan’s Mamdani Leans On The Left’s New Playbook But Rejects The Label",
    "description": "As Michigan Democrats enter the thick of a competitive Senate primary campaign, one candidate is trying to position himself as an outsider who wants to fix a broken system and take on the oligarchy. Dr. Abdul El-Sayed is a Bernie Sanders-endorsed former publi…",
    "link": "https://freerepublic.com/focus/f-news/4367215/posts",
    "timestamp": "2026-02-17T20:20:34Z"
  },
  {
    "title": "Democratic Lawmakers Vow to Investigate CBS Spiking Colbert-Talarico Interview: ‘Censorship State’",
    "description": "Congressional Democrats vowed to launch investigations after Stephen Colbert said his interview with Texas State Rep. James Talarico was not allowed to air.\nThe post Democratic Lawmakers Vow to Investigate CBS Spiking Colbert-Talarico Interview: ‘Censorship S…",
    "link": "https://www.mediaite.com/media/tv/democratic-lawmakers-vow-to-investigate-cbs-spiking-colbert-talarico-interview-censorship-state/",
    "timestamp": "2026-02-17T20:20:04Z"
  },
  {
    "title": "Democrats’ New ‘Trans Bill of Rights’ Looks to Undo Trump Policies to Protect Women’s Spaces",
    "description": "A group of Democrats recently unveiled their “Trans Bill of Rights,” which conservatives claim would undo many of President Donald Trump’s efforts to protect female-only... Read More\nThe post Democrats’ New ‘Trans Bill of Rights’ Looks to Undo Trump Policies …",
    "link": "https://www.dailysignal.com/2026/02/17/democrats-new-trans-bill-of-rights-looks-to-undo-trump-policies-to-protect-womens-spaces/",
    "timestamp": "2026-02-17T20:20:00Z"
  },
  {
    "title": "Vacant Bangalore Development Authority sites: Slab-based penalties replace 10% levy",
    "description": "Bengaluru: The Bangalore Development Authority (Bangalore Development Authority) has revised the penalty imposed on owners who fail to construct house.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/vacant-bangalore-development-authority-sites-slab-based-penalties-replace-10-levy/articleshow/128476291.cms",
    "timestamp": "2026-02-17T20:17:00Z"
  },
  {
    "title": "Maharashtra ATS busts soccer club front for radicalisation",
    "description": "Maharashtra ATS has busted a radicalisation network operating under a soccer club's guise, raiding 21 locations. A Nagpur grocer allegedly used a Yavatmal club to indoctrinate youth into 'jihadi' ideology, with suspects maintaining cross-border terror links. …",
    "link": "https://timesofindia.indiatimes.com/india/maharashtra-ats-busts-soccer-club-front-for-radicalisation/articleshow/128480023.cms",
    "timestamp": "2026-02-17T20:16:46Z"
  },
  {
    "title": "'I am somebody': Civil rights leaders honor Rev. Jesse Jackson after his death",
    "description": "Rev. Al Sharpton invoked the late Rev. Jesse Jackson's slogan, “I am somebody,” which Jackson famously recited in an iconic 1971 chant with children on Sesame Street.",
    "link": "https://abcnews.com/Politics/civil-rights-leaders-politicians-honor-rev-jesse-jacksons/story?id=130225754",
    "timestamp": "2026-02-17T20:16:41Z"
  },
  {
    "title": "Sheinbaum says Mexico declines Trump’s ‘Board of Peace’ invite",
    "description": "Mexico's Claudia Sheinbaum said she has turned down an invitation from Donald Trump to join his “Board of Peace.\"",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/17/sheinbaum-says-mexico-declines-trumps-board-of-peace-invite",
    "timestamp": "2026-02-17T20:16:21Z"
  },
  {
    "title": "Oil Markets on Alert After Iran Partially Closes Strait of Hormuz",
    "description": "Global energy markets were put on alert after Iran temporarily restricted movement in parts of the Strait of Hormuz, one of the most strategically important oil transit routes on Earth. The move came as Tehran simultaneously engaged in sensitive diplomatic ta…",
    "link": "https://freerepublic.com/focus/f-news/4367213/posts",
    "timestamp": "2026-02-17T20:16:13Z"
  },
  {
    "title": "'White Lotus' Star Shreds Trump Admin With 2 Little Words During Awards Show Presentation",
    "description": "The 2026 Independent Spirit Awards saw actor Natasha Rothwell exhibit some independent gumption of her own while presenting an award onstage.",
    "link": "https://www.huffpost.com/entry/white-lotus-star-slams-ice-during-awards-shows-speech_n_699498f1e4b0b353292b53ba",
    "timestamp": "2026-02-17T20:16:06Z"
  },
  {
    "title": "Minnesotans Just Won a Huge Court Victory Against ICE",
    "description": "A federal judge required ICE to allow reasonable time for detainees at the Whipple detention center in Minneapolis to access legal counsel.",
    "link": "https://slate.com/news-and-politics/2026/02/minnesota-court-victory-against-ice-detention.html",
    "timestamp": "2026-02-17T20:12:34Z"
  },
  {
    "title": "Poll: How many Americans rank Trump as the 'worst' vs. 'best' president in U.S. history?",
    "description": "Amid this year's Presidents' Day celebrations, survey respondents tell Yahoo and YouGov that Trump is doing a worse job than Joe Biden and Barack Obama.",
    "link": "https://www.yahoo.com/news/politics/article/poll-how-many-americans-rank-trump-as-the-worst-vs-best-president-in-us-history-201110993.html",
    "timestamp": "2026-02-17T20:11:10Z"
  },
  {
    "title": "Macron extends invite to Modi to attend G7 summit",
    "description": "France has invited India to the 2026 G7 Summit, emphasizing active participation in discussions on global macroeconomic imbalances and international partnerships. Both nations reaffirmed their commitment to a rules-based Indo-Pacific order and the urgent need…",
    "link": "https://timesofindia.indiatimes.com/india/macron-extends-invite-to-modi-to-attend-g7-summit/articleshow/128479927.cms",
    "timestamp": "2026-02-17T20:10:31Z"
  },
  {
    "title": "Trump administration backs Kalshi and Polymarket in big legal fight over U.S. betting rules",
    "description": "The U.S. government is backing prediction market platforms in a major legal fight with several states. The dispute is about who should control these online betting-style markets — federal regulators or state gambling authorities. The outcome could change how …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-backs-kalshi-and-polymarket-in-big-legal-fight-over-u-s-betting-rules/articleshow/128478434.cms",
    "timestamp": "2026-02-17T20:06:43Z"
  },
  {
    "title": "Insiders say Trump is using pardons as revenge against judges: 'He hates Boasberg'",
    "description": "President Donald Trump's pardon process doesn't make sense to many observers, including some inside the White House.Nearly three dozen sources spoke to NOTUS, including lawyers and lobbyists and people inside the White House, about what they described as an e…",
    "link": "https://www.rawstory.com/donald-trump-pardon-process/",
    "timestamp": "2026-02-17T20:05:29Z"
  },
  {
    "title": "Trump Awkwardly Dodges Question About How He Spent Valentine's Day With Wife Melania — Amid Claims Their Marriage is 'Purely Transactional'",
    "description": "Donald Trump awkwardly dodged a question from a reporter on how he spent Valentine's Day with Melania.",
    "link": "https://radaronline.com/p/donald-trump-wife-melania-valentines-day-plans-question-dodged-video/",
    "timestamp": "2026-02-17T20:03:10Z"
  },
  {
    "title": "Judge rules Kilmar Abrego Garcia can't be re-detained by immigration authorities",
    "description": "A federal judge has ruled that Immigration and Customs Enforcement cannot re-detain Kilmar Abrego Garcia because a 90-day detention period has expired and the government has no viable plan for deporting him.",
    "link": "https://www.pbs.org/newshour/nation/judge-rules-kilmar-abrego-garcia-cant-be-re-detained-by-immigration-authorities",
    "timestamp": "2026-02-17T20:02:28Z"
  },
  {
    "title": "'Raise India-made component' in Rafale deal: Rajnath to France",
    "description": "India has urged France to increase the 'Make-in-India' component to 50% for the upcoming 114 Rafale fighter jet deal, including engine manufacturing and overhauling. This comes as both nations renewed their defense cooperation agreement for another decade, al…",
    "link": "https://timesofindia.indiatimes.com/india/raise-india-made-component-in-rafale-deal-rajnath-to-france/articleshow/128479685.cms",
    "timestamp": "2026-02-17T20:01:21Z"
  },
  {
    "title": "'HOMELAND' Collecting Big Tech Users' Personal Data, Issuing Subpoenas For ICE-Related Criticism...",
    "description": "Criticism of U.S. immigration enforcement on social media platforms could land Americans in hot legal water.",
    "link": "https://www.military.com/daily-news/2026/02/17/dhs-collecting-big-tech-users-personal-data-issuing-subpoenas-ice-related-criticism.html",
    "timestamp": "2026-02-17T20:00:13Z"
  },
  {
    "title": "Key NIH research institute told to remove references to 'pandemic preparedness'",
    "description": "Staff members have been instructed to scrub this topic and ‘biodefense’ from the agency’s website, a Nature investigation finds",
    "link": "https://www.scientificamerican.com/article/key-nih-research-institute-told-to-remove-references-to-pandemic/",
    "timestamp": "2026-02-17T20:00:00Z"
  },
  {
    "title": "CBS Says It Did Not Stop Colbert From Airing FCC-Blocked Interview, ‘Presented Options’ to Fit Equal-Time Rule",
    "description": "The \"Late Show\" host circumvented the legal guidance Monday by airing his interview with Rep. James Talarico on YouTube\nThe post CBS Says It Did Not Stop Colbert From Airing FCC-Blocked Interview, ‘Presented Options’ to Fit Equal-Time Rule appeared first on T…",
    "link": "https://www.thewrap.com/creative-content/tv-shows/cbs-responds-colbert-talarico-interview-equal-time-rule/",
    "timestamp": "2026-02-17T19:55:45Z"
  },
  {
    "title": "Sergey Karaganov: Fear is the only thing the EU understands",
    "description": "Western Europe’s elite are driving the continent toward catastrophe Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632690-sergey-karaganov-western-europe/",
    "timestamp": "2026-02-17T19:54:27Z"
  },
  {
    "title": "'Trump is worried': Experts say FCC move to kill Colbert interview backfired big time",
    "description": "President Donald Trump's Federal Communications Commission began its long-threatened crackdown on political late-night talk show interviews by pressuring CBS to pull an already-filmed interview on \"The Late Show with Stephen Colbert\" with Texas U.S. Senate ca…",
    "link": "https://www.rawstory.com/james-talarico-2675277614/",
    "timestamp": "2026-02-17T19:52:35Z"
  },
  {
    "title": "Texas AG sues TP-Link over purported connection to China",
    "description": "Texas is suing Wi-Fi router maker TP-Link for deceptively marketing the security of its products and allowing Chinese hacking groups to access Americans' devices, Attorney General Ken Paxton has announced. Paxton originally started looking into TP-Link in Oct…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180816288",
    "timestamp": "2026-02-17T19:52:06Z"
  },
  {
    "title": "CBS Denies Forcing Stephen Colbert to Not Air Interview With Democratic Candidate, Says It Provided ‘Legal Guidance’ About FCC Equal-Time Rule",
    "description": "CBS said it did not force \"The Late Show With Stephen Colbert\" to pull an interview with Texas state Rep. James Talarico from its TV broadcast Monday, contrary to the way the late-night host had framed it. Rather, according to CBS, its legal team provided \"gu…",
    "link": "https://variety.com/2026/more/news/cbs-denies-stephen-colbert-forced-not-air-talarico-interview-fcc-equal-time-1236665701/",
    "timestamp": "2026-02-17T19:51:19Z"
  },
  {
    "title": "Army aspirant accuses TTE of rape bid on train in UP",
    "description": "A young Army aspirant traveling for her NCC exam has accused a TTE of attempted rape in a First AC coach of the Ahmedabad-Gorakhpur Express. The incident occurred on Sunday. The TTE allegedly offered her a berth after she boarded without a ticket, then threat…",
    "link": "https://timesofindia.indiatimes.com/india/army-aspirant-accuses-tte-of-rape-bid-on-train-in-up/articleshow/128479185.cms",
    "timestamp": "2026-02-17T19:48:42Z"
  }
]