[
  {
    "title": "Songwriter Tamara Lindeman: ‘It’s scary. We all know Elon Musk is climate-informed. He’s not Trump. He’s not a madman’",
    "description": "For the Weather Station singer-songwriter, whose music is deeply concerned with the state of the planet, the Maga new world order represents a chilling departure from normality",
    "link": "https://www.irishtimes.com/culture/music/2025/03/02/songwriter-tamara-lindeman-its-scary-we-all-know-elon-musk-is-climate-informed-hes-not-trump-hes-not-a-madman/",
    "timestamp": "2025-03-02T05:11:00Z"
  },
  {
    "title": "White House row with Ukraine raises stakes for European summit in London",
    "description": "A summit of European leaders to discuss Ukraine's defense has been overshadowed by the diplomatic row at the White House",
    "link": "https://abcnews.go.com/International/wireStory/white-house-row-ukraine-raises-stakes-european-summit-119337398",
    "timestamp": "2025-03-02T05:10:40Z"
  },
  {
    "title": "ANALYSIS: What USAID’s exit means for Nigeria’s healthcare system",
    "description": "Nigeria’s dependence on foreign aid created room for USAID — an organisation responsible for disbursing most US international aid - and left a huge gap in its absence.",
    "link": "https://www.premiumtimesng.com/health/health-features/777876-analysis-what-usaids-exit-means-for-nigerias-healthcare-system.html",
    "timestamp": "2025-03-02T05:09:11Z"
  },
  {
    "title": "Donald Trump vs Volodymyr Zelensky verbal showdown scripted reality show or real drama? Ex-White House speechwriter reacts",
    "description": "A heated confrontation between Donald Trump and Ukrainian President Volodymyr Zelenskyy in the Oval Office featured accusations of endangerment and pressure to negotiate on U.S. terms. Trump dismissed Ukraine’s victory chances and demanded access to minerals.…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/donald-trump-vs-volodymyr-zelensky-verbal-showdown-scripted-reality-show-or-real-drama-ex-white-house-speechwriter-reacts/articleshow/118658309.cms",
    "timestamp": "2025-03-02T05:08:46Z"
  },
  {
    "title": "What Have the Iran Sanctions Achieved?",
    "description": "Forty-six years of aggressive economic punishment have, perversely, only entrenched the ayatollahs.\nThe post What Have the Iran Sanctions Achieved? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/what-have-the-iran-sanctions-achieved/",
    "timestamp": "2025-03-02T05:05:00Z"
  },
  {
    "title": "A topsy-turvy Oscar season concludes Sunday. Here's what to look for at Sunday's show",
    "description": "After a topsy-turvy Oscar season in which frontrunners were constantly shuffled, old tweets hobbled a top contender and space was held for “Wicked,” the 97th Academy Awards get underway Sunday",
    "link": "https://abcnews.go.com/Entertainment/wireStory/topsy-turvy-oscar-season-concludes-sunday-sundays-show-119337294",
    "timestamp": "2025-03-02T05:04:56Z"
  },
  {
    "title": "SNL: Mike Myers' Elon Musk Interrupts Day's Zelenskyy, Johnson's Trump",
    "description": "Tonight's SNL (with host Shane Gillis and musical guest Tate McRae) cold open saw a re-enactment of the meeting this week in The White House's Oval Office between POTUS Donald Trump (James Austin Johnson), Ukraine President Volodymyr Zelenskyy (Mikey Day), Vi…",
    "link": "https://bleedingcool.com/tv/snl-mike-myers-elon-musk-interrupts-days-zelenskyy-johnsons-trump/",
    "timestamp": "2025-03-02T05:04:07Z"
  },
  {
    "title": "9 arrested at New York Tesla dealership amid anti-Musk protests",
    "description": "<p>NEW YORK - Nine people were arrested during a raucous demonstration outside a New York City Tesla dealership on Saturday, protesting owner Elon Musk's role in sweeping cuts to the federal workforce at the behest of President Donald Trump.</p>",
    "link": "https://www.bangkokpost.com/world/2971198/9-arrested-at-new-york-tesla-dealership-amid-anti-musk-protests",
    "timestamp": "2025-03-02T05:04:00Z"
  },
  {
    "title": "SNL Video: Mike Myers’ Chainsaw-Wielding Elon Musk Interrupts Trump’s Meeting With Zelenskyy",
    "description": "Saturday Night Live took aim this week at President Donald Trump’s combative meeting with Ukraine President Volodymyr Zelenskyy — with an assist from an all-time SNL great. In Saturday’s cold open, James Austin Johnson’s Trump and Bowen Yang’s JD Vance battle…",
    "link": "https://tvline.com/recaps/snl-video-mike-myers-elon-musk-trump-zelenskyy-1235415050/",
    "timestamp": "2025-03-02T05:03:19Z"
  },
  {
    "title": "What Vietnam is considering to avoid US tariffs",
    "description": "<p>HANOI - US President Donald Trump has announced plans for tariffs that could hit virtually all of Vietnam's goods exports to its top market, worth last year more than US$142 billion, according to UN data, about 30% of Vietnam's gross domestic product.</p>",
    "link": "https://www.bangkokpost.com/business/general/2971191/what-vietnam-is-considering-to-avoid-us-tariffs",
    "timestamp": "2025-03-02T05:03:00Z"
  },
  {
    "title": "Starmer says Europe faces a 'once in a generation moment' as leaders discuss ending war in Ukraine",
    "description": "British Prime Minister Keir Starmer told leaders gathered Sunday for a summit on the war in Ukraine that they need to step up and continue to support Kyiv...",
    "link": "https://www.yahoo.com/news/white-house-row-ukraine-raises-050132770.html",
    "timestamp": "2025-03-02T05:01:32Z"
  },
  {
    "title": "Europe seeks to take control of Ukraine negotiations, after Zelensky’s nightmare Trump visit sparks panic | CNN",
    "description": "The West is at a “crossroads in history,” Britain’s Prime Minister Keir Starmer told European leaders at a pivotal summit in London on Sunday, as the continent sought to wrestle control of negotiations over the Russia-Ukraine war away from the US and present …",
    "link": "https://www.cnn.com/2025/03/02/europe/ukraine-russia-zelensky-starmer-summit-intl/index.html",
    "timestamp": "2025-03-02T05:00:52Z"
  },
  {
    "title": "The 6% lie",
    "description": "Elon Musk claimed that only 6% of federal workers work full time in their offices. This would be dismissed as manifestly false by anyone with any sense. And yet, this lie took wings. Stephen Engelberg, editor of ProPublica, writes that although this was just …",
    "link": "https://freethoughtblogs.com/singham/2025/03/02/the-6-lie/",
    "timestamp": "2025-03-02T05:00:46Z"
  },
  {
    "title": "Zelensky: Where Trump is coming from",
    "description": "The media constantly underestimate Donald Trump.  Some say Trump set a trap that Zelensky fell into, but by all appearances, he and V.P. J.D. Vance fully expected Zelensky to sign the mineral deal, hence the televised photo op.  T...",
    "link": "https://www.americanthinker.com/blog/2025/03/zelensky_where_trump_is_coming_from.html",
    "timestamp": "2025-03-02T05:00:00Z"
  },
  {
    "title": "DOJ: who really runs the Executive Branch?",
    "description": "It is not only constitutional, but entirely ethical for a POTUS to require his appointees and every federal employee working for him to enact the agenda for which he was elected.",
    "link": "https://www.americanthinker.com/blog/2025/03/doj_who_really_runs_the_executive_branch.html",
    "timestamp": "2025-03-02T05:00:00Z"
  },
  {
    "title": "John Brennan should be on trial, not on TV",
    "description": "John Brennan has once again emerged from the shadows, taking to MSNBC to deliver a diatribe against JD Vance and Donald Trump for daring to advocate a pragmatic, negotiated resolution to the bloodshed in Ukraine. In Brennan’s mind, any deviatio...",
    "link": "https://www.americanthinker.com/blog/2025/03/john_brennan_should_be_on_trial_not_on_tv.html",
    "timestamp": "2025-03-02T05:00:00Z"
  },
  {
    "title": "Riyadh: The New Global Diplomatic Hub?",
    "description": "In an era of shifting geopolitical alliances, Saudi Arabia, under the leadership of Crown Prince Mohammed bin Salman—better known as M.B.S.—has quickly emerged as a key diplomatic player. M.B.S. has transformed the kingdom, positioning it...",
    "link": "https://www.americanthinker.com/articles/2025/03/riyadh_the_new_global_diplomatic_hub.html",
    "timestamp": "2025-03-02T05:00:00Z"
  },
  {
    "title": "Trump’s Oval Office triumph is a masterclass in leadership over Zelensky",
    "description": "On February 28, 2025, the Oval Office echoed with the undeniable strength of President Donald Trump’s leadership as he participated in a meeting with Ukrainian President Volodymyr Zelensky and demonstrated American resolve at its finest.\r\n\r\nWha...",
    "link": "https://www.americanthinker.com/blog/2025/03/trump_s_oval_office_triumph_is_a_masterclass_in_leadership_over_zelensky.html",
    "timestamp": "2025-03-02T05:00:00Z"
  },
  {
    "title": "Mike Lee Calls for Exit from NATO After Norwegian Fuel Company Stops Refueling U.S. Military Ships",
    "description": "Sen. Mike Lee (R-UT) called for the United States to leave NATO in response to a Norwegian fuel company, Haltbakk Bunkers, deciding to stop refueling U.S. military ships.\nThe post Mike Lee Calls for Exit from NATO After Norwegian Fuel Company Stops Refueling …",
    "link": "https://www.breitbart.com/politics/2025/03/01/mike-lee-calls-for-exit-from-nato-after-norwegian-fuel-company-stops-refueling-u-s-military-ships/",
    "timestamp": "2025-03-02T04:58:36Z"
  },
  {
    "title": "ACLU and other advocates sue to block migrants from being sent to Guantánamo Bay",
    "description": "The lawsuit says there is no legitimate reason to send migrants to Guantánamo because the U.S. has ample detention facility.",
    "link": "https://www.npr.org/2025/03/01/g-s1-51567/aclu-sue-trump-migrants-guantanamo",
    "timestamp": "2025-03-02T04:56:58Z"
  },
  {
    "title": "‘SNL’ Cold Open: Mike Myers Crashes Zelenskyy Meeting as Elon Musk | Video",
    "description": "The \"Saturday Night Live\" veteran returned after February's 50th anniversary special\nThe post ‘SNL’ Cold Open: Mike Myers Crashes Zelenskyy Meeting as Elon Musk | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/snl-mike-myers-elon-musk/",
    "timestamp": "2025-03-02T04:54:39Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "Demonstrators have gathered outside Tesla stores across the U.S. to protest the automaker’s billionaire leader, Elon Musk",
    "link": "https://abcnews.go.com/Business/wireStory/anti-doge-protests-tesla-stores-target-elon-musks-119332695",
    "timestamp": "2025-03-02T04:54:26Z"
  },
  {
    "title": "A Diplomatic Spat At White House And A Happy Man Sitting 7,800 Km Away",
    "description": "The diplomatic alliance between the United States and Ukraine, already under strain, suffered a dramatic and public rupture on Friday when US President Donald Trump tore into Ukrainian President Volodymyr Zelensky at the White House.",
    "link": "https://www.ndtv.com/world-news/donald-trump-volodymyr-zelensky-vladimir-putin-ndtv-analysis-a-diplomatic-spat-at-white-house-and-a-happy-man-sitting-7-800-km-away-7827967",
    "timestamp": "2025-03-02T04:53:06Z"
  },
  {
    "title": "Trump’s oval office clash with Zelenskyy was a win for Putin",
    "description": "Nobody in Ukraine, or any other country formerly under Moscow’s boot, believes that Putin will honor the terms of a ceasefire without credible guarantees.",
    "link": "https://www.japantimes.co.jp/commentary/2025/03/02/world/trump-zelenskyy-oval-office-clash/",
    "timestamp": "2025-03-02T04:53:00Z"
  },
  {
    "title": "Norway Fuel Supplier Cuts US Off Over Trump's Treatment Of Zelensky",
    "description": "A Norwegian oil and shipping company has announced an immediate halt to fuel supplies for US military forces docking in the country&#039;s ports. T",
    "link": "https://www.ndtv.com/world-news/norway-fuel-supplier-cuts-us-off-over-trumps-treatment-of-zelensky-7827845",
    "timestamp": "2025-03-02T04:52:12Z"
  },
  {
    "title": "Anti-DOGE Protests At Tesla Stores Target Elon Musk's Bottom Line",
    "description": "Demonstrators have gathered outside Tesla stores across the U.S. to protest the automaker’s billionaire leader, Elon Musk.",
    "link": "https://www.huffpost.com/entry/us-musk-tesla-protests_n_67c3e2e7e4b0bb60c6986c40",
    "timestamp": "2025-03-02T04:51:01Z"
  },
  {
    "title": "Jeff Bezos shifts Washington Post’s editorial focus: Here’s why Elon Musk backs Amazon founder's decision",
    "description": "Billionaire Jeff Bezos has announced a major editorial shift at The Washington Post, declaring that the opinion section will now exclusively support \"personal liberties\" and \"free markets.\" This decision led to the resignation of opinion editor David Shipley.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jeff-bezos-shifts-washington-posts-editorial-focus-heres-why-elon-musk-backs-amazon-founders-decision/articleshow/118658466.cms",
    "timestamp": "2025-03-02T04:49:22Z"
  },
  {
    "title": "‘Saturday Night Live’ Skewers Trump-Zelensky Oval Office Showdown With A Cameo From Mike Myers As Elon Musk",
    "description": "Saturday Night Live went for the obvious in its cold open: Donald Trump’s Oval Office meeting with Volodymyr Zelensky, in which the president and Vice President JD Vance berated the Ukrainian leader as he tried to argue that Russian President Vladimir Putin c…",
    "link": "http://deadline.com/2025/03/saturday-night-live-trump-zelensky-1236306568/",
    "timestamp": "2025-03-02T04:48:44Z"
  },
  {
    "title": "Two lunar landings in a week for NASA’s private moon fleet",
    "description": "WASHINGTON DC: More than 50 years passed between the last Apollo mission and the United States’ return to the lunar surface, when the first private lander touched down last February 2024. Now, starting Sunday, two more missions are set to follow within a sing…",
    "link": "https://english.khabarhub.com/2025/02/440612/",
    "timestamp": "2025-03-02T04:45:55Z"
  },
  {
    "title": "Mike Myers as Elon Musk Guests As ‘SNL’ Cold Open Takes On Fight Between Trump and Ukraine President Zelenskyy",
    "description": "As the fallout from Donald Trump’s clash with Ukrainian President Volodymyr Zelenskyy continues to stun the world, “Saturday Night Live” gave its own spin on the global disaster. “SNL” opened this weekend’s show — its first since the “SNL50” special — by feat…",
    "link": "https://variety.com/2025/tv/news/snl-cold-open-trump-zelenskyy-mike-meyers-elon-musk-1236324528/",
    "timestamp": "2025-03-02T04:45:35Z"
  },
  {
    "title": "Trump takes actions to increase lumber supplies and curb wood imports",
    "description": "President Donald Trump has signed a pair of actions to increase domestic lumber production.",
    "link": "https://www.news4jax.com/business/2025/03/01/trump-takes-actions-to-increase-lumber-supplies-and-curb-wood-imports/",
    "timestamp": "2025-03-02T04:30:37Z"
  },
  {
    "title": "France Yellow Vests Week 328*Trump-Macron \"Tug Of War\"*Former President Says Hit The US Economically Amid Tariff Threat*Macron Talks Support Of Ukraine As Trump Seeks To End War*Paris Protest*",
    "description": "\"Donald Trump reacts only to the wallet, the money\" This week former French President Socialist Francois Hollande saying that US President Donald Trump needs to be hit financially. Hollande calling for France and Europe to be 'on the front line\"... The differ…",
    "link": "https://freerepublic.com/focus/f-bloggers/4301456/posts",
    "timestamp": "2025-03-02T04:29:59Z"
  },
  {
    "title": "Volodymyr Zelenskyy And Donald Trump: A Horrifying Scene",
    "description": "There was no winner but there was clearly one loser: the United States of America. Here’s why:",
    "link": "https://www.forbes.com/sites/eliamdur/2025/03/01/volodymyr-zelenskyy-and-donald-trump-a-horrifying-scene/",
    "timestamp": "2025-03-02T04:26:04Z"
  },
  {
    "title": "Hundreds gather on Boston Common to support Ukraine after White House meeting",
    "description": "Hundreds gathered on the Boston Common on Saturday, holding Ukrainian flags to stand in solidarity with the country.",
    "link": "https://www.cbsnews.com/boston/news/ukraine-white-house-zelenskyy-boston-common-rally/",
    "timestamp": "2025-03-02T04:24:00Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "The demonstrations are part of a growing backlash in North America and Europe to Musk's disruptive role in Washington.",
    "link": "https://www.thehindubusinessline.com/news/world/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/article69281211.ece",
    "timestamp": "2025-03-02T04:20:41Z"
  },
  {
    "title": "US judge rules against Trump in watchdog dismissal case",
    "description": "A federal judge ruled Saturday that limits on President Donald Trump's power to fire the head of an independent watchdog agency are constitutional, teeing up...",
    "link": "https://www.yahoo.com/news/us-judge-rules-against-trump-041700254.html",
    "timestamp": "2025-03-02T04:17:00Z"
  },
  {
    "title": "Rubio speeds up US arms supplies to Israel",
    "description": "State Secretary Marco Rubio has signed a declaration to expedite the delivery of approximately $4 billion in military assistance to Israel Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613566-israel-us-weapons-emergency/",
    "timestamp": "2025-03-02T04:16:23Z"
  },
  {
    "title": "Adani reignites US ambitions, eyeing major foray despite ongoing criminal charges, says report",
    "description": "The Adani Group is renewing its investment interests in the US, particularly in sectors like nuclear energy and utilities, despite facing legal challenges. This decision follows President Trump's call to suspend the enforcement of the Foreign Corrupt Practice…",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/adani-reignites-us-ambitions-eyes-major-foray-despite-ongoing-criminal-charges-says-report/articleshow/118658156.cms",
    "timestamp": "2025-03-02T04:13:59Z"
  },
  {
    "title": "Trump declares English as official language of US",
    "description": "President Donald Trump on Saturday designated English as the official language of the United States, stating that it would bring cohesion to a country shaped by immigration from around the world. The White House published an executive order in which Trump dec…",
    "link": "https://punchng.com/trump-declares-english-as-official-language-of-us/",
    "timestamp": "2025-03-02T04:12:47Z"
  },
  {
    "title": "Designating English as the Official Language of The United States - The White House",
    "description": "Designating English as the Official Language of The United StatesThe White House Donald Trump signs order to make English official language of US, says it’s ‘long past time’Mint Trump signs executive order making English the official language of the U.S.NPR P…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176585099",
    "timestamp": "2025-03-02T04:12:36Z"
  },
  {
    "title": "MLB commissioner Rob Manfred reportedly considering petition to remove Pete Rose from ineligible list",
    "description": "President Donald Trump said Friday he would issue a pardon to Pete Rose. Rob Manfred is reportedly pondering something similar.",
    "link": "https://sports.yahoo.com/mlb/article/mlb-commissioner-rob-manfred-reportedly-considering-petition-to-remove-pete-rose-from-ineligible-list-040720640.html",
    "timestamp": "2025-03-02T04:07:20Z"
  },
  {
    "title": "'Absolute determination to...': UK strengthens support for Ukraine with £2.26-billion loan",
    "description": "The UK reaffirms its commitment to Ukraine's defence amidst diplomatic challenges",
    "link": "https://www.businesstoday.in/latest/world/story/absolute-determination-to-uk-strengthens-support-for-ukraine-with-ps226-billion-loan-466397-2025-03-02",
    "timestamp": "2025-03-02T04:02:39Z"
  },
  {
    "title": "Trump takes actions to increase lumber supplies and curb wood imports",
    "description": "President Donald Trump has signed a pair of actions to increase domestic lumber production.",
    "link": "https://www.wsls.com/business/2025/03/01/trump-takes-actions-to-increase-lumber-supplies-and-curb-wood-imports/",
    "timestamp": "2025-03-02T03:59:30Z"
  },
  {
    "title": "Ukrainian soldiers say compromises are needed on both parts as they reflect on Trump-Zelenskyy spat",
    "description": "Ukrainian soldiers say there needs to be compromises on both the US and Ukraine’s parts to bring about a possible end to the war.\nSoldiers of the 92nd Assault Brigade of Ukraine reflected on Saturday on the public spat between US President Donald Trump and Uk…",
    "link": "https://biztoc.com/x/f002f4c670ef9a26",
    "timestamp": "2025-03-02T03:58:36Z"
  },
  {
    "title": "Trump Decrees English As First-Ever Official Language In U.S.",
    "description": "President Donald Trump has signed an executive order declaring English as the United States’ official language, the first designation of such kind in the country’s near 250-year history. “From the founding of our Republic, English has been used as our nationa…",
    "link": "http://deadline.com/2025/03/trump-english-official-language-united-states-1236306564/",
    "timestamp": "2025-03-02T03:55:36Z"
  },
  {
    "title": "Why This UFC Belt Found A Place At Trump-Zelensky Showdown",
    "description": "A golden-coloured belt from the Ultimate Fighting Championship (UFC) sat propped in one corner of the hall as a shouting match ensued between US President Donald Trump and his Ukraine counterpart Volodymyr Zelensky at the White House yesterday.",
    "link": "https://www.ndtv.com/world-news/donald-trump-volodymyr-zelensky-clash-featured-this-ufc-belt-won-by-ukrainian-boxer-oleksandr-usyk-7827696",
    "timestamp": "2025-03-02T03:54:34Z"
  },
  {
    "title": "Grapevine March 2, 2025: When orange replaced yellow",
    "description": "Movers and shakers in Israeli society.",
    "link": "https://www.jpost.com/israel-news/article-844272",
    "timestamp": "2025-03-02T03:53:02Z"
  },
  {
    "title": "Nations fail to break deadlock on UN climate report timing",
    "description": "BANGKOK: Nations failed to break a deadlock over the timing of the UN's next blockbuster assessment of climate change science after a marathon meeting in China that US envoys skipped. At issue was whether the Intergovernmental Panel on Climate Change (IPCC), …",
    "link": "https://www.channelnewsasia.com/sustainability/nations-fail-break-deadlock-un-climate-report-timing-4970356",
    "timestamp": "2025-03-02T03:52:48Z"
  },
  {
    "title": "Mia Love is Dying",
    "description": "Former congresswoman Mia Love was diagnosed with glioblastoma, a type of brain cancer, in 2022, and she has been battling the disease ever since. Sadly, her daughter, Abigale, took to X on Saturday and announced that treatment is no longer working, the cancer…",
    "link": "https://freerepublic.com/focus/f-chat/4301455/posts",
    "timestamp": "2025-03-02T03:52:46Z"
  },
  {
    "title": "US to deploy 3,000 more troops to southern border",
    "description": "The US Northern Command said it was deploying more troops to the US border with Mexico to curb illegal immigration and the flow of drugs. President Trump has cracked down on immigration since assuming office in January.",
    "link": "https://www.dw.com/en/us-to-deploy-3000-more-troops-to-southern-border/a-71796438",
    "timestamp": "2025-03-02T03:49:00Z"
  },
  {
    "title": "Trump's effort to fire government watchdog 'unlawful', judge rules",
    "description": "President Donald Trump's effort to remove the head of a federal watchdog agency was \"unlawful,\" a federal judge in Washington, D.C., said Saturday.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trumps-effort-fire-government-watchdog-unlawful-judge-rules-rcna194371",
    "timestamp": "2025-03-02T03:39:27Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line",
    "description": "Demonstrators protested outside Tesla stores in the U.S. and Europe against CEO Elon Musk's support for President Trump's federal spending cuts. The protests aim to discourage purchases of Tesla vehicles and stocks. Some Tesla cars were vandalized amid concer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/anti-doge-protests-at-tesla-stores-target-elon-musks-bottom-line/articleshow/118657898.cms",
    "timestamp": "2025-03-02T03:34:11Z"
  },
  {
    "title": "Trump’s clash with Zelenskyy leaves Moscow both thrilled and wary",
    "description": "Moscow is celebrating Trump’s shift away from unwavering U.S. support for Ukraine, but some in the Kremlin fear his unpredictability could create new risks.",
    "link": "https://www.japantimes.co.jp/news/2025/03/02/world/politics/russia-zelenskyy-oval-office/",
    "timestamp": "2025-03-02T03:33:00Z"
  },
  {
    "title": "Surprise surprise: Donald Trump was a frequent flier according to Epstein flight logs released by his own AG - NewsBreak",
    "description": "Surprise surprise: Donald Trump was a frequent flier according to Epstein flight logs released by his own AG - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3834235167939-surprise-surprise-donald-trump-was-a-frequent-flier-according-to-epstein-flight-logs-released-by-his-own-ag?_f=app_share&amp;pd=03tlSldI&amp;lang=en_US&amp;send_time=1740885881&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v3%2Cns_local_strategy_25q1_exp-v1%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v2%2Cns_foryou_model_exp_25q1-v4&amp;s=i2",
    "timestamp": "2025-03-02T03:25:08Z"
  },
  {
    "title": "Trump’s tariff convulsions are wreaking havoc on tequila makers",
    "description": "US President Trump's fluctuating tariff threats have disrupted Mexico's tequila industry, causing inventory surges and deferred payments. Tequila producers, heavily reliant on the US market, face significant sales drops and operational challenges due to the l…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trumps-tariff-convulsions-are-wreaking-havoc-on-tequila-makers/articleshow/118657812.cms",
    "timestamp": "2025-03-02T03:22:28Z"
  },
  {
    "title": "Rob Manfred considering petition to remove Pete Rose from MLB’s ineligible list",
    "description": "MLB's controversial all-time hits king could have a shot at the Baseball Hall of Fame.",
    "link": "https://nypost.com/2025/03/01/sports/rob-manfred-considering-removing-pete-rose-from-mlbs-ineligible-list/",
    "timestamp": "2025-03-02T03:20:03Z"
  },
  {
    "title": "‘America is back in counterterrorism business’: Donald Trump rolls back Biden rules on drone strikes outside war zones",
    "description": "President Donald Trump has revoked Biden-era restrictions on drone strikes and commando raids outside traditional war zones, returning to his earlier, more flexible rules. This change allows commanders greater autonomy in targeting militants but raises concer…",
    "link": "https://economictimes.indiatimes.com/news/defence/america-is-back-in-the-business-of-counterterrorism-donald-trump-rolls-back-biden-rules-on-drone-strikes-outside-war-zones/articleshow/118657806.cms",
    "timestamp": "2025-03-02T03:19:52Z"
  },
  {
    "title": "US Spaceship Hours Away From Daring Moon Landing Attempt",
    "description": "Nicknamed &quot;Ghost Riders in the Sky,&quot; the mission comes just over a year after the first-ever commercial lunar landing and is part of a NASA partnership with industry to cut costs and support Artemis.",
    "link": "https://www.ndtv.com/world-news/firefly-aerospace-blue-ghost-mission-1-us-spaceship-hours-away-from-daring-moon-landing-attempt-near-mons-latreille-7827544",
    "timestamp": "2025-03-02T03:19:41Z"
  },
  {
    "title": "Rubio expedites delivery of $4 billion in military aid to Israel",
    "description": "WASHINGTON — U.S. Secretary of State Marco Rubio said on Saturday he had signed a declaration to expedite delivery of about $4 billion in military assistance to Israel.\n\n\nThe Trump administration, which took office on Jan. 20, has approved nearly $12 billion …",
    "link": "https://www.voanews.com/a/rubio-expedites-delivery-of-4-billion-in-military-aid-to-israel-/7994060.html",
    "timestamp": "2025-03-02T03:19:35Z"
  },
  {
    "title": "Trump USAID shutdown could spark a global humanitarian crisis",
    "description": "Trump’s move to dismantle USAID could reshape foreign aid, hurt US farmers, and empower rivals like China and Russia.",
    "link": "https://www.jpost.com/opinion/article-844246",
    "timestamp": "2025-03-02T03:15:15Z"
  },
  {
    "title": "Trump Signs Order to Designate English as Official Language of the U.S. - The New York Times",
    "description": "Trump Signs Order to Designate English as Official Language of the U.S.The New York Times Designating English as the Official Language of The United StatesThe White House Trump signs executive order making English the official language of the U.S.NPR Presiden…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176584695",
    "timestamp": "2025-03-02T03:12:39Z"
  },
  {
    "title": "Judge Says Trump Can’t Fire Independent Watchdog",
    "description": "“A federal judge on Saturday said President Donald Trump cannot summarily fire the head of an independent watchdog agency, setting up a likely Supreme Court battle over Trump’s sweeping attempt to reshape the federal workforce",
    "link": "https://politicalwire.com/2025/03/01/judge-says-trump-cant-fire-independent-watchdog/",
    "timestamp": "2025-03-02T03:06:30Z"
  },
  {
    "title": "Jon Jones' secret pre-fight ritual: How visualization gives him an edge",
    "description": "Being the greatest of all time requires more than just talent-it demands a mental edge. According to Joe Rogan, Jon Jones has mastered this advantage with a unique pre-fight ritual",
    "link": "https://www.marca.com/en/ufc/2025/03/02/67c3b121e2704ee26b8b4574.html",
    "timestamp": "2025-03-02T03:05:49Z"
  },
  {
    "title": "Making English the official US language can’t erase the fact that the US has millions of Spanish speakers and a long multilingual history",
    "description": "Trump’s campaign produced campaign materials in Spanish to reach more voters. Now that he’s president, his White House is going English-only.",
    "link": "https://theconversation.com/making-english-the-official-us-language-cant-erase-the-fact-that-the-us-has-millions-of-spanish-speakers-and-a-long-multilingual-history-250030",
    "timestamp": "2025-03-02T03:04:24Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job, says Trump’s bid to oust him was unlawful",
    "description": "U.S. District Judge Amy Berman Jackson sided with Hampton Dellinger, who leads the Office of Special Counsel.",
    "link": "https://nypost.com/2025/03/01/us-news/head-of-watchdog-agency-must-keep-his-job-trumps-bid-to-rid-him-unlawful/",
    "timestamp": "2025-03-02T03:01:52Z"
  },
  {
    "title": "MLB commissioner Rob Manfred considering petition to reinstate Pete Rose, per report",
    "description": "Rose, who was placed on the permanently ineligible list in 1989 because of gambling, died in September of last year",
    "link": "https://www.cbssports.com/mlb/news/mlb-commissioner-rob-manfred-considering-petition-to-reinstate-pete-rose-per-report/",
    "timestamp": "2025-03-02T03:00:51Z"
  },
  {
    "title": "Ukraine signs £2.26 billion UK loan deal for weapons production after failed Trump talks",
    "description": "The United Kingdom has agreed to provide Ukraine with a £2.26 billion ($2.84 billion) loan to strengthen its defence capabilities. The loan, structured to be repaid using profits from immobilised Russian sovereign assets, was signed during a virtual ceremony …",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-secures-2-26-billion-uk-loan-for-weapons-production-after-failed-trump-talks/articleshow/118657629.cms",
    "timestamp": "2025-03-02T03:00:19Z"
  },
  {
    "title": "Examining claim Trump was recruited by KGB in 1987 and given codename 'Krasnov'",
    "description": "A former Kazakh security official's Facebook post started the rumor.",
    "link": "https://www.snopes.com//news/2025/03/02/trump-kgb-operative-krasnov/",
    "timestamp": "2025-03-02T03:00:00Z"
  },
  {
    "title": "Elon Musk's DOGE website lists Nashville's Social Security office among cuts",
    "description": "Elon Musk's efforts to slash federal spending may be taking aim at a Nashville office that serves thousands of retirees, people with disabilities and children who have lost parents.",
    "link": "https://www.newschannel5.com/news/newschannel-5-investigates/elon-musks-doge-website-lists-nashvilles-social-security-office-among-cuts",
    "timestamp": "2025-03-02T02:47:03Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job, says Trump's bid to oust him was unlawful",
    "description": "A federal judge has ruled that the head of a federal watchdog agency must remain in his job, saying President Donald Trump’s bid to remove the special counsel was unlawful",
    "link": "https://abcnews.go.com/US/wireStory/judge-rules-head-watchdog-agency-job-trumps-bid-119334838",
    "timestamp": "2025-03-02T02:46:25Z"
  },
  {
    "title": "Wayne Gretzky faces backlash in Canada over support for Donald Trump",
    "description": "Trump's provocative comments about making Canada the 51st U.S. state have raised tensions.",
    "link": "https://www.japantimes.co.jp/sports/2025/03/02/more-sports/wayne-gretzky-trump-support/",
    "timestamp": "2025-03-02T02:45:00Z"
  },
  {
    "title": "Judge rules head of watchdog agency must keep his job; says Trump's bid to oust him was unlawful",
    "description": "The head of a federal watchdog agency must remain in his job, a judge in Washington ruled on Saturday, saying President Donald Trump's bid to remove the special counsel was unlawful.  U.S. District Judge Amy Berman Jackson sided with Hampton Dellinger, who le…",
    "link": "https://japantoday.com/category/world/judge-rules-head-of-watchdog-agency-must-keep-his-job-says-trump%27s-bid-to-oust-him-was-unlawful",
    "timestamp": "2025-03-02T02:44:29Z"
  },
  {
    "title": "Trump designates English as only official US language",
    "description": "President Donald Trump has signed an executive order declaring English the only official language of the United States Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613564-trump-english-only-language/",
    "timestamp": "2025-03-02T02:43:22Z"
  },
  {
    "title": "Head of federal watchdog agency fired by Trump should remain on the job, judge rules | CNN Politics",
    "description": "A federal judge ruled Saturday that the head of a government watchdog agency whom President Donald Trump is attempting to fire is entitled to remain in the post, setting up a dispute that will almost certainly be decided by the Supreme Court.",
    "link": "https://www.cnn.com/2025/03/01/politics/federal-judge-watchdog-agency-dellinger-trump/index.html",
    "timestamp": "2025-03-02T02:43:00Z"
  },
  {
    "title": "Trump aims to increase domestic lumber, investigate imports",
    "description": "United States President Donald Trump signed two executive actions to increase domestic lumber production and investigate potential harm to national security posed by lumber imports.The order, which th...",
    "link": "https://biztoc.com/x/a777b3daad820ff1",
    "timestamp": "2025-03-02T02:42:58Z"
  },
  {
    "title": "Private US spaceship hours from Moon landing attempt",
    "description": "After a long journey through space, a US company is just hours away from attempting a daring lunar touchdown — its spacecraft poised to become only the second private lander to achieve the feat if it succeeds. Firefly Aerospace’s Blue Ghost Mission 1 is targe…",
    "link": "https://www.digitaljournal.com/world/private-us-spaceship-hours-from-moon-landing-attempt/article",
    "timestamp": "2025-03-02T02:42:35Z"
  },
  {
    "title": "Jamie Little's return to INDYCAR part of a busy year for FOX Sports announcer",
    "description": "Motorsports viewers might associate Jamie Little with FOX’s coverage of NASCAR’s Cup Series, but she'll be a fixture on FOX's INDYCAR coverage.",
    "link": "https://www.foxsports.com/stories/motor/jamie-littles-return-indycar-part-busy-year-fox-sports-announcer",
    "timestamp": "2025-03-02T02:41:31Z"
  },
  {
    "title": "Commissioner’s Office Considering Petition To Remove Pete Rose From Ineligible List",
    "description": "MLB Commissioner Rob Manfred is considering a petition filed by the family of Pete Rose to have Rose posthumously reinstated from the ineligible list, according to a report from Don Van Natta Jr. of ESPN. Rose passed away in September at the age of 83, and Va…",
    "link": "https://www.mlbtraderumors.com/2025/03/manfred-petition-rose-ineligible-list.html",
    "timestamp": "2025-03-02T02:37:11Z"
  },
  {
    "title": "Donald Trump to issue 'complete pardon' of former MLB great Pete Rose",
    "description": "Trump made the declaration late Friday on his Truth Social account. It wasn't exactly clear what the pardon would cover.",
    "link": "https://www.japantimes.co.jp/sports/2025/03/02/baseball/mlb/donald-trump-pardon-pete-rose/",
    "timestamp": "2025-03-02T02:37:00Z"
  },
  {
    "title": "Rubio signs declaration to expedite delivery of $4 billion in military aid to Israel",
    "description": "U.S. Secretary of State Marco Rubio has signed a declaration to expedite the delivery of approximately $4 billion in military aid to Israel. The Trump administration has approved nearly $12 billion in military sales to support Israel amid a fragile ceasefire …",
    "link": "https://economictimes.indiatimes.com/news/defence/rubio-signs-declaration-to-expedite-delivery-of-4-billion-in-military-aid-to-israel/articleshow/118657554.cms",
    "timestamp": "2025-03-02T02:34:25Z"
  },
  {
    "title": "Poll reveals public is split on whether Micheál Martin should criticise Donald Trump on US visit",
    "description": "The public is divided on whether the Taoiseach should make any criticism at all of US president Donald Trump when he holds his crucial first meeting with him in less than a fortnight.",
    "link": "https://www.independent.ie/irish-news/poll-reveals-public-is-split-on-whether-micheal-martin-should-criticise-donald-trump-on-us-visit/a1670230520.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Fionnán Sheahan: Donald Trump’s World War III talk shows up parish-pump nature of Micheál Martin’s ‘Lowry lackeys’ row",
    "description": "A tough-talking leader riding roughshod over his opponents in his second term in office meets Donald Trump in 10 days’ time.",
    "link": "https://www.independent.ie/opinion/analysis/fionnan-sheahan-donald-trumps-world-war-iii-talk-shows-up-parish-pump-nature-of-micheal-martins-lowry-lackeys-row/a1138335139.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "The Sunday Independent’s view: Micheál Martin’s visit to the White House just got a lot trickier",
    "description": "For poet Seamus Heaney, peacemaking happens when “hope and history rhyme”. The scenes in the White House on Friday, when Donald Trump and his vice-president JD Vance publicly bullied and humiliated Ukraine’s Volodymyr Zelensky, could not have been farther fro…",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-micheal-martins-visit-to-the-white-house-just-got-a-lot-trickier/a696803485.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Letters: If only ‘falsehoods’ had been around when I was younger",
    "description": "Sir — I was interested to observe An Taoiseach trying to argue that he did not accuse Mary Lou of telling lies when he accused her of “ag insint breaga aris”, during Leader’s Questions recently.",
    "link": "https://www.independent.ie/opinion/letters/letters-if-only-falsehoods-had-been-around-when-i-was-younger/a1489689871.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "FDI chiefs look for help to reassure their nervous staff as Donald Trump threatens tariffs on European Union goods",
    "description": "Big multinational employers have warned local business representatives that their employees are nervous as US president Donald Trump threatens to impose tariffs on goods coming from the EU.",
    "link": "https://www.independent.ie/business/irish/fdi-chiefs-look-for-help-to-reassure-their-nervous-staff-as-donald-trump-threatens-tariffs-on-european-union-goods/a1735652653.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Adrian Weckler: Despite Trump’s threats, to make money in Europe, you have to be in Europe. Steve Jobs knew that",
    "description": "Last week, Apple unveiled a $500bn investment plan for the US, including a new factory. Donald Trump was triumphant. But does that come at Cork’s expense?",
    "link": "https://www.independent.ie/business/technology/adrian-weckler-despite-trumps-threats-to-make-money-in-europe-you-have-to-be-in-europe-steve-jobs-knew-that/a90261365.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "Oval Office outburst: ‘The Europeans have their backs against the wall – will they rise to the occasion?’",
    "description": "For Kyiv’s European allies, the shouting match in the Oval Office has intensified the pressure to fill the gaps in US aid with their own weapons, and to face up to whether they can go it alone in arming Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/oval-office-outburst-the-europeans-have-their-backs-against-the-wall-will-they-rise-to-the-occasion/a366443130.html",
    "timestamp": "2025-03-02T02:30:00Z"
  },
  {
    "title": "\"We Can Get Back At Elon\": Anti-DOGE Protests Hit Tesla Stores In US",
    "description": "The demonstrations are part of a growing backlash in North America and Europe to Musk&#039;s disruptive role in Washington.",
    "link": "https://www.ndtv.com/world-news/anti-doge-protests-hit-tesla-stores-in-us-we-can-get-back-at-elon-musk-donald-trump-government-7827377",
    "timestamp": "2025-03-02T02:27:00Z"
  },
  {
    "title": "Vance Family Moved to ‘Undisclosed Location’ After Pro-Ukrainian Protesters Disrupt Ski Trip",
    "description": "Vice President JD Vance and his family were moved to an “undisclosed location” after they were met with pro-Ukrainian protesters outside of a ski resort in Vermont. Protesters could be seen holding signs at Sugarbush Ski Resort that read “Vance is a traitor. …",
    "link": "https://freerepublic.com/focus/f-news/4301449/posts",
    "timestamp": "2025-03-02T02:25:36Z"
  },
  {
    "title": "Federal judge rules Trump’s firing of head of special counsel was unlawful, will maintain his job",
    "description": "Federal Judge Amy Berman Jackson ruled late Saturday evening that President Donald Trump's firing of the head of the Office of Special Counsel, Hampton Dellinger, was unlawful, keeping him in his post.",
    "link": "https://www.foxnews.com/politics/federal-judge-rules-trumps-firing-head-special-counsel-unlawful-maintain-his-job",
    "timestamp": "2025-03-02T02:15:47Z"
  },
  {
    "title": "Elon Musk Defends Nazi-Like Gesture: 'Meant In The Most Positive Spirit Possible'",
    "description": "Elon Musk addressed the public backlash he received after displaying a Nazi-like hand gesture at an inaugural celebration for President Donald Trump, defending himself by saying he is not a Nazi — while also making Nazi jokes.\n“It was obviously meant in the m…",
    "link": "https://biztoc.com/x/b0660bf003f7f71c",
    "timestamp": "2025-03-02T02:10:13Z"
  },
  {
    "title": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line (Associated Press)",
    "description": "Associated Press:\nAnti-DOGE protests at Tesla stores target Elon Musk's bottom line  —  Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker's billionaire CEO, Elon Musk, and his push to slash government spending on be…",
    "link": "https://www.memeorandum.com/250301/p86",
    "timestamp": "2025-03-02T02:10:01Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US",
    "description": "It rescinds a mandate from former President Bill Clinton that required the government and organizations that received federal funding to provide language assistance to non-English speakers.",
    "link": "https://www.wcvb.com/article/trump-signs-order-designating-english-as-the-official-language-of-the-us/63993724",
    "timestamp": "2025-03-02T02:07:43Z"
  },
  {
    "title": "Trump signs order designating English as the official language of the US - NewsBreak",
    "description": "President Donald Trump has signed an executive order declaring English the official language of the United States, reversing a policy from the Clinton adm",
    "link": "https://www.newsbreak.com/share/3836064945051-trump-signs-order-designating-english-as-the-official-language-of-the-us?s=a2&share_destination_id=MTU2MzcwNDA2LTE3NDA4ODExMTA2MDQ%3D&pd=0Aa75Kiz&hl=en_US&send_time=1740881110&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.8.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_blend_exp_25q1-v8%2Cns_local_strategy_25q1_exp-v18",
    "timestamp": "2025-03-02T02:07:21Z"
  },
  {
    "title": "Trump signs executive order making English official language of US",
    "description": "President Donald Trump on Saturday signed an executive order making English the official language of the U.S.",
    "link": "https://www.foxnews.com/politics/trump-signs-executive-order-making-english-official-language-us",
    "timestamp": "2025-03-02T02:07:12Z"
  },
  {
    "title": "\"Can Freely Exchange Ideas\": Trump Makes English Official US Language",
    "description": "The White House published an executive order by Trump which says it is &quot;long past time&quot; that English is declared as the nation&#039;s official language.",
    "link": "https://www.ndtv.com/world-news/donald-trump-makes-english-official-us-language-can-freely-exchange-ideas-7827315",
    "timestamp": "2025-03-02T02:06:45Z"
  }
]