[
  {
    "title": "Being Trump Means Never Having to Say, ‘I’m on Break!’",
    "description": "WhiteHouse.gov, the official website of the Executive Mansion and its chief resident, features a full-screen photo that encapsulates our age. President Donald Trump leads a... Read More\nThe post Being Trump Means Never Having to Say, ‘I’m on Break!’ appeared …",
    "link": "https://www.dailysignal.com/2025/06/26/being-trump-means-never-having-to-say-im-on-break/",
    "timestamp": "2025-06-26T19:38:58Z"
  },
  {
    "title": "Duncan Hines parent Conagra Brands says it will phase out artificial colors",
    "description": "Conagra Brands, the parent company of Duncan Hines, Slim Jim and other brands, is the latest big food company to say it’s discontinuing the use of artificial dyes. Chicago-based Conagra said it will remove artificial colors from its frozen foods by the end of…",
    "link": "https://www.seattlepi.com/business/article/duncan-hines-parent-conagra-brands-says-it-will-20395937.php",
    "timestamp": "2025-06-26T19:37:41Z"
  },
  {
    "title": "U.S. Dollar Dips to Three-Year Low. Here’s What That Means For You",
    "description": "The U.S. dollar has tumbled to a three-year low, potentially squeezing American wallets.",
    "link": "https://time.com/7298152/dollar-value-decline-economy/",
    "timestamp": "2025-06-26T19:35:19Z"
  },
  {
    "title": "All NATO States Agree to Spend 5 Percent of GDP on Defense, But Not Spain",
    "description": "Spain’s refusal to comply triggered trade threats from the United States. \nThe post All NATO States Agree to Spend 5 Percent of GDP on Defense, But Not Spain appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/all-nato-states-agree-to-spend-5-percent-of-gdp-on-defense-but-not-spain",
    "timestamp": "2025-06-26T19:34:44Z"
  },
  {
    "title": "'Desperate' Trump dropped bombs to look 'manly': Nobel Prize-winner",
    "description": "Analysts and pundits have spent a lot of time trying to understand why President Donald Trump decided to bomb three nuclear facilities in Iran over the weekend. But one Nobel Prize-winning economist thinks there is a simple explanation.\"This time, it looks as…",
    "link": "https://www.rawstory.com/trump-2672442014/",
    "timestamp": "2025-06-26T19:34:03Z"
  },
  {
    "title": "WTI Edges Up as OPEC+ Meeting Looms",
    "description": "Geopolitical tensions eased, but market uncertainty remains with sanctions, diplomacy, and OPEC+ talks in focus.",
    "link": "https://www.rigzone.com/news/wire/wti_edges_up_as_opec_meeting_looms-26-jun-2025-180962-article/",
    "timestamp": "2025-06-26T19:33:20Z"
  },
  {
    "title": "U.S. GDP shrinks first time in three years",
    "description": "WASHINGTON, June 26 (Xinhua) -- U.S. economy shrank for the first time in three years in the first quarter of this year, according to data released Thursday by the U.S. Commerce Department. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/27/us-gdp-shrinks-first-time-in-three-years",
    "timestamp": "2025-06-26T19:33:00Z"
  },
  {
    "title": "Rosie O'Donnell reveals she was 'very depressed' and 'overdrinking' after first Trump win",
    "description": "Rosie O'Donnell revealed on \"The Chris Cuomo Project\" on Tuesday that she was \"very depressed\" following Trump's 2016 win, which let her to move to Ireland after his 2024 victory.",
    "link": "https://www.foxnews.com/media/rosie-odonnell-reveals-she-very-depressed-overdrinking-after-first-trump-win",
    "timestamp": "2025-06-26T19:30:45Z"
  },
  {
    "title": "Masked Arrests Must Stop: Lawmakers Roll Out New Bill",
    "description": "The bill, according to one sponsor, is meant to stop “tyranny” from spreading in America.",
    "link": "https://www.huffpost.com/entry/democrats-want-to-ban-masked-ice-agents_n_685d9603e4b0bb5044ff94a5",
    "timestamp": "2025-06-26T19:30:29Z"
  },
  {
    "title": "Trump Administration Announces New Visa Restrictions",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSecretary of State Marco Rubio announced on Thursday that the United States will implement new visa restrictions on \"family members and close personal and business associates\" of people who have been sanctione…",
    "link": "https://biztoc.com/x/034c98bb30b76185",
    "timestamp": "2025-06-26T19:30:04Z"
  },
  {
    "title": "Peter Bart: Barbara Walters Built A Career On Trust In A Bygone Era Far Removed From Today",
    "description": "“Tell me everything,” Barbara Walters used to urge her TV guests. She believed she could coax the truth out of anyone, whether revered or disgraced, and so did her viewers. Her confidence would be challenged today when every fragment of news, even neighborhoo…",
    "link": "http://deadline.com/2025/06/barbara-walters-career-media-trust-1236443380/",
    "timestamp": "2025-06-26T19:30:00Z"
  },
  {
    "title": "White House Embraces “Daddy” Label After Rutte’s Viral Remark",
    "description": "The White House is leaning into a viral moment from the NATO summit after Secretary General Mark Rutte referred to President Donald Trump as “daddy” during a public exchange. \nAt Wednesday’s meeting in The Hague, Rutte made the comment while joking about Trum…",
    "link": "https://biztoc.com/x/ab63042ccfce2449",
    "timestamp": "2025-06-26T19:29:48Z"
  },
  {
    "title": "Fox’s Jesse Watters Accuses CNN of ‘Spewing Enemy Propaganda’ For Reporting On U.S. Intelligence",
    "description": "\"And then there's CNN alone in the corner in last place, spewing enemy propaganda. I don't think they can come back from it.\"\nThe post Fox’s Jesse Watters Accuses CNN of ‘Spewing Enemy Propaganda’ For Reporting On U.S. Intelligence first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-jesse-watters-accuses-cnn-of-spewing-enemy-propaganda-for-reporting-on-u-s-intelligence/",
    "timestamp": "2025-06-26T19:29:21Z"
  },
  {
    "title": "Trump to host event to rally Republicans behind his megabill",
    "description": "The White House remains adamant about the July Fourth megabill deadline.",
    "link": "https://abcnews.go.com/Politics/trump-host-event-rally-republicans-megabill/story?id=123242448",
    "timestamp": "2025-06-26T19:27:51Z"
  },
  {
    "title": "Trump Administration Announces New Visa Restrictions",
    "description": "Secretary of State Marco Rubio announced that the Trump administration will implement new visa restrictions on certain individuals.",
    "link": "https://www.newsweek.com/trump-administration-new-visa-restrictions-marco-rubio-2091308",
    "timestamp": "2025-06-26T19:26:19Z"
  },
  {
    "title": "Former top aide to Jill Biden is subpoenaed by House Oversight panel",
    "description": "The subpoena requires the aide to appear for a deposition on July 16.",
    "link": "https://www.bostonherald.com/2025/06/26/congress-oversight-biden/",
    "timestamp": "2025-06-26T19:26:12Z"
  },
  {
    "title": "Trump Declares Iran Was Spotted 'Trying to Cover Up' Damaged Nuclear Sites, Proving 'Nothing Was Taken Out' Before Attack",
    "description": "President Donald Trump accused Iran of hiding strike damage after Defense Secretary Pete Hegseth defended the mission after questions over uranium concerns.",
    "link": "https://www.ibtimes.com/trump-declares-iran-was-spotted-trying-cover-damaged-nuclear-sites-proving-nothing-was-taken-3776981",
    "timestamp": "2025-06-26T19:23:14Z"
  },
  {
    "title": "FCC chief had no discussions with White House on Trump Mobile phone",
    "description": "WASHINGTON :The head of the U.S. Federal Communications Commission said on Thursday he had no discussions with the White House about the Trump Organization's self-branded mobile service and a $499 smartphone dubbed Trump Mobile.FCC Chair Brendan Carr, who was…",
    "link": "https://www.channelnewsasia.com/business/fcc-chief-had-no-discussions-white-house-trump-mobile-phone-5206151",
    "timestamp": "2025-06-26T19:22:35Z"
  },
  {
    "title": "How Trump Finally Learned To Love NATO -- For Now",
    "description": "It will go down as the summit where US President Donald Trump learned to stop worrying and love NATO.\nTrump reveled in gushing praise from leaders in The Hague -- including being called \"daddy\" by alliance chief Mark Rutte -- and a pledge to boost defense spe…",
    "link": "https://www.ibtimes.com/how-trump-finally-learned-love-nato-now-3776978",
    "timestamp": "2025-06-26T19:21:09Z"
  },
  {
    "title": "Zohran Mamdani’s rise reignites Democratic identity debate, analysis",
    "description": "Democrats are torn between courting moderates or doubling down on progressives.",
    "link": "https://abcnews.go.com/Politics/zohran-mamdanis-upset-new-york-primary-reignites-democratic/story?id=123191780",
    "timestamp": "2025-06-26T19:20:52Z"
  },
  {
    "title": "Netanyahu seeks to postpone trial summons after Trump backing",
    "description": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu asked a court on Thursday (Jun 26) to postpone his testimony in his long-running corruption trial, after US President Donald Trump called for the case to be",
    "link": "https://www.channelnewsasia.com/world/netanyahu-seeks-postpone-trial-summons-after-trump-backing-5206136",
    "timestamp": "2025-06-26T19:20:00Z"
  },
  {
    "title": "Manufacturers stumble in their rush to shield exports from tariffs under USMCA",
    "description": "With U.S. President Donald Trump waging trade wars against nearly every country on the planet, it was hoped Canada’s membership in the United States-Mexico-Canada Agreement would have its privileges.\nThe early evidence isn’t promising as far as Canada’s manuf…",
    "link": "https://biztoc.com/x/179daa59dbbbc529",
    "timestamp": "2025-06-26T19:19:11Z"
  },
  {
    "title": "Trump blames Democrats for Iran information leak",
    "description": "United States President Donald Trump took to his Truth Social on Thursday to blame the Democratic Party for the recent information leak related to the assessment of damage on Iranian nuclear sites.\"Th...",
    "link": "https://biztoc.com/x/dc13117938d84ba9",
    "timestamp": "2025-06-26T19:19:09Z"
  },
  {
    "title": "Trump decision on Powell replacement not imminent, source says",
    "description": "U.S. President Donald Trump has not decided on a replacement for Federal Reserve Chair Jerome Powell and a decision isn’t imminent, a person familiar with the White House’s deliberations said on Thursday, as one central bank policymaker said any move to name …",
    "link": "https://biztoc.com/x/7bf7d12bdc6574c3",
    "timestamp": "2025-06-26T19:19:07Z"
  },
  {
    "title": "WATCH LIVE: Trump hosts ‘big bill’ event as key provision found to violate Senate rules",
    "description": "President Donald Trump is expected to host an event later Thursday in the White House East Room joined by truck drivers, firefighters, tipped workers, ranchers and others that the administration says will benefit from the bill as he urges Congress to pass it,…",
    "link": "https://biztoc.com/x/94b3dd0fc7ced2ad",
    "timestamp": "2025-06-26T19:19:06Z"
  },
  {
    "title": "Former top aide to Jill Biden is subpoenaed by House Oversight panel",
    "description": "House Republicans have subpoenaed a senior aide to former first lady Jill Biden",
    "link": "https://abcnews.go.com/Politics/wireStory/former-top-aide-jill-biden-subpoenaed-house-oversight-123244040",
    "timestamp": "2025-06-26T19:18:41Z"
  },
  {
    "title": "Big Beautiful Bill Keeps Falling Apart, Will Pass Anyway",
    "description": "The Big Beautiful Bill keeps falling apart, will pass anyway. The budget bill is springing lots of leaks on Medicaid, taxes, and the deficit. But when Trump demands a final vote, few Republicans will defy him.",
    "link": "http://nymag.com/intelligencer/article/big-beautiful-bill-keeps-falling-apart-will-pass-anyway.html",
    "timestamp": "2025-06-26T19:17:15Z"
  },
  {
    "title": "Who Is Brett Cooper, the Conservative Influencer Joining Fox News?",
    "description": "Brett Cooper, a 23-year-old conservative influencer who’s extremely popular among right-wing Gen-Zers, is joining Fox News as a contributor.",
    "link": "http://www.thecut.com/article/who-is-brett-cooper-podcaster-influencer-joins-fox-news.html",
    "timestamp": "2025-06-26T19:16:20Z"
  },
  {
    "title": "Apple again tries to cut third party app fees to avoid EU fines",
    "description": "Right at the deadline to comply with the European Union Digital Markets Act, Apple is making changes to its developer policies. However, it may not be enough to escape the European Commission's ire.An EU flag with the App Store logoSince the introduction of t…",
    "link": "https://appleinsider.com/articles/25/06/26/apple-again-tries-to-cut-third-party-app-fees-to-avoid-eu-fines",
    "timestamp": "2025-06-26T19:14:22Z"
  },
  {
    "title": "Trump Flat-Out Accuses Democrats of Leaking Intel Report on Iran Strike: ‘They Should Be Prosecuted!’",
    "description": "Donald Trump claimed that Democrats are behind the leaking of an early intelligence assessment downplaying the effectiveness of strikes against Iran.\nThe post Trump Flat-Out Accuses Democrats of Leaking Intel Report on Iran Strike: ‘They Should Be Prosecuted!…",
    "link": "https://www.mediaite.com/media/news/trump-flat-out-accuses-democrats-of-leaking-intel-report-on-iran-strike-they-should-be-prosecuted/",
    "timestamp": "2025-06-26T19:14:04Z"
  },
  {
    "title": "WATCH LIVE: Trump hosts ‘big bill’ event as key provision found to violate Senate rules",
    "description": "President Donald Trump is expected to host an event later Thursday in the White House East Room joined by truck drivers, firefighters, tipped workers, ranchers and others that the administration says will benefit from the bill as he urges Congress to pass it,…",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-hosts-big-bill-event-as-key-provision-found-to-violate-senate-rules",
    "timestamp": "2025-06-26T19:13:52Z"
  },
  {
    "title": "Survey: Parents Say Trump Is Right—Trade Schools Deserve Harvard’s Funding",
    "description": "It’s not just political rhetoric anymore—American parents are voicing strong support for a major shift in education funding. A new national survey shows they want the federal government to redirect money from elite universities to skilled trade programs—just …",
    "link": "https://dailycaller.com/2025/06/26/survey-parents-say-trump-is-right-trade-schools-deserve-harvards-funding/",
    "timestamp": "2025-06-26T19:13:50Z"
  },
  {
    "title": "White House drops 'Daddy's Home' meme after viral NATO summit moment",
    "description": "President Donald Trump's NATO Summit appearance sparked a White House meme video after Secretary General Rutte's \"daddy\" comment, generating mixed reactions on social media.",
    "link": "https://www.foxnews.com/politics/white-house-drops-daddys-home-meme-after-viral-nato-summit-moment",
    "timestamp": "2025-06-26T19:13:31Z"
  },
  {
    "title": "Canadian dies while in ICE custody in Florida, U.S. agency says",
    "description": "A Canadian citizen died while in custody of U.S. Immigration and Customs Enforcement earlier this week, the agency says.",
    "link": "https://www.cbc.ca/news/politics/canadian-dies-in-ice-custody-1.7571876",
    "timestamp": "2025-06-26T19:13:02Z"
  },
  {
    "title": "Fmr. Trump Secy. of State Pompeo says Iran strike sends message: 'America is back leading in the world'",
    "description": "Mike Pompeo tells Fox News that strikes on Iranian nuclear sites increased U.S. deterrence while criticizing isolationists who abandon American leadership",
    "link": "https://www.foxnews.com/politics/fmr-trump-secy-state-pompeo-says-iran-strike-sends-message-america-back-leading-world",
    "timestamp": "2025-06-26T19:11:38Z"
  },
  {
    "title": "Lawrence O’Donnell Says Trump Doesn’t Actually Understand ‘When You Win a War’ Because He’s a Draft-Dodger | Video",
    "description": "\"The biggest crybaby in the history of American politics now feels like a warrior,\" the MSNBC host says\nThe post Lawrence O’Donnell Says Trump Doesn’t Actually Understand ‘When You Win a War’ Because He’s a Draft-Dodger | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/lawrence-odonnell-trump-israel-iran-war-evaded-vietnam-military-service/",
    "timestamp": "2025-06-26T19:10:50Z"
  },
  {
    "title": "In Trump’s Wartime Reality Show, Truth Is a Casualty",
    "description": "Donald Trump often does not tell the truth. The intelligence community produces classified reports that are unavailable for outside evaluation. Thus, the public cannot trust what Trump and his crew say about the intelligence. This is a fundamental problem. We…",
    "link": "https://www.motherjones.com/politics/2025/06/donald-trump-ipete-hegseth-ran-war-intelligence-truth-untrustworthy/",
    "timestamp": "2025-06-26T19:10:41Z"
  },
  {
    "title": "States can block Medicaid money for health care at Planned Parenthood, the Supreme Court says - NewsBreak",
    "description": "WASHINGTON (AP) — States can block the country’s biggest abortion provider, Planned Parenthood , from receiving Medicaid money for health services such as",
    "link": "https://www.newsbreak.com/share/4075296712143-states-can-cut-off-medicaid-funding-to-planned-parenthood-the-supreme-court-rules?s=a99&amp;share_destination_id=MTU4MjI4NTQxLTE3NTA5NTYxNjE1MzE%3D&amp;pd=0AhuTFuW&amp;hl=en_US&amp;send_time=1750956161&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v1",
    "timestamp": "2025-06-26T19:10:01Z"
  },
  {
    "title": "Tulsi Gabbard Falls in Line",
    "description": "The U.S. spy chief, who built her political identity opposing foreign intervention, is now prioritizing her loyalty to Trump.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/tulsi-gabbard-trump-iran/683323/",
    "timestamp": "2025-06-26T19:10:00Z"
  },
  {
    "title": "Iran's supreme leader slams Trump just days after US strikes on nuclear sites",
    "description": "Iranian Supreme Leader Ayatollah Ali Khamenei took a swipe at President Donald Trump just days after the U.S. struck Tehran's nuclear facilities.",
    "link": "https://www.foxnews.com/world/irans-supreme-leader-slams-trump-just-days-after-us-strikes-nuclear-sites",
    "timestamp": "2025-06-26T19:06:51Z"
  },
  {
    "title": "Government plans to deport Abrego Garcia to a country that's not El Salvador",
    "description": "Federal prosecutors have told a judge in Maryland the government plans to initiate deportation proceedings against Kilmar Abrego Garcia and to deport him to a country that is not El Salvador upon his release from a Tennessee jail.",
    "link": "https://www.wmur.com/article/maryland-deportation-kilmar-abrego-garcia/65209785",
    "timestamp": "2025-06-26T19:06:21Z"
  },
  {
    "title": "WATCH TONIGHT: PBS39 forum on public media funding cuts",
    "description": "\"A Community Conversation: Broadcast in the Balance\" examines funding cuts under consideration in Congress to the Corporation for Public Broadcasting. The cuts would result in the defunding of more than $1 billion over two years to public media outlets across…",
    "link": "https://www.lehighvalleynews.com/business/nonprofit/watch-tonight-pbs39-forum-on-public-media-funding-cuts",
    "timestamp": "2025-06-26T19:06:18Z"
  },
  {
    "title": "Usha Vance Is ‘Just Along for the Ride’",
    "description": "At 157 days into Trump’s regime, Second Lady Usha Vance remains a mystery. In an interview with Meghan McCain, she said she’s ‘just along for the ride.’",
    "link": "http://www.thecut.com/article/usha-vance-does-not-sound-thrilled.html",
    "timestamp": "2025-06-26T19:05:58Z"
  },
  {
    "title": "Democrats' Chances of Beating GOP's Leading Michigan Senate Candidate—Polls",
    "description": "\"Our economy has been flat here for a decade. We're going to change that,\" GOP Senate candidate Mike Rogers told Newsweek.",
    "link": "https://www.newsweek.com/michigan-senate-midterms-mike-rogers-poll-2091220",
    "timestamp": "2025-06-26T19:03:47Z"
  },
  {
    "title": "US warming up to geothermal: ‘It’s hot everywhere underground’",
    "description": "But even at one of the largest US geothermal projects, located near Austin, Texas, the upfront cost can be a barrier, making it ‘a tough sale.’",
    "link": "https://floodlightnews.org/us-warming-up-to-geothermal",
    "timestamp": "2025-06-26T19:02:55Z"
  },
  {
    "title": "Prosecutors Say Government Plans To Deport Kilmar Abrego Garcia To A Country That's Not El Salvador",
    "description": "Kilmar Abrego Garcia’s wife is suing the Trump administration over his March deportation.",
    "link": "https://www.huffpost.com/entry/prosecutors-say-government-plans-to-deport-kilmar-abrego-garcia-to-a-country-thats-not-el-salvador_n_685d945ee4b0bb5044ff924a",
    "timestamp": "2025-06-26T19:02:09Z"
  },
  {
    "title": "Don't fall for claim LA gangs brokered truce to protect immigrants from ICE",
    "description": "Los Angeles gang members called a truce with each other in order to help protect immigrants from U.S. Immigration and Customs Enforcement (ICE) \"abductions.\"",
    "link": "https://www.snopes.com//fact-check/la-gangs-ice-immigrants-truce/",
    "timestamp": "2025-06-26T19:02:00Z"
  },
  {
    "title": "Is regime change in Iran possible without a united opposition?",
    "description": "More than 46 years after the 1979 Iranian Revolution, there is talk among Iranians — both those living in Iran and among the diaspora — that the end of the Islamic Republic of Iran is nearing. But without defections, a united opposition, and mass civil uprisi…",
    "link": "https://www.abc.net.au/news/2025-06-27/is-regime-change-in-iran-possible-without-united-opposition/105458394",
    "timestamp": "2025-06-26T19:00:15Z"
  },
  {
    "title": "Senate Blocks Key Medicaid Cuts in Trump’s ‘Big, Beautiful Bill’",
    "description": "The Senate Parliamentarian, Elizabeth MacDonough, ruled out a few key Medicaid provisions in President Donald Trump’s “big beautiful bill.” MacDonough slashed the “plan to cap states’ use of health care provider taxes to collect more federal Medicaid funding,…",
    "link": "https://legalinsurrection.com/2025/06/senate-blocks-key-medicaid-cuts-in-trumps-big-beautiful-bill/",
    "timestamp": "2025-06-26T19:00:06Z"
  },
  {
    "title": "Republican State Legislators Defying Trump’s Efforts to Lower Health Care Costs",
    "description": "President Donald Trump was swept into office last November with a promise to lower prices for Americans who had suffered under 40-year-high inflation under President... Read More\nThe post Republican State Legislators Defying Trump’s Efforts to Lower Health Ca…",
    "link": "https://www.dailysignal.com/2025/06/26/republican-state-legislators-defying-trumps-efforts-lower-health-care-costs/",
    "timestamp": "2025-06-26T19:00:00Z"
  },
  {
    "title": "Exclusive—Donald Trump Endorses Breitbart EIC Marlow’s Forthcoming ‘Breaking the Law’ as a 'Must Read,' Issues Grave Warning on Lawfare",
    "description": "President Donald Trump offered glowing praise for Breitbart News Editor-in-Chief forthcoming exposé on weaponization of the legal system, \"Breaking the Law.\"\nThe post Exclusive—Donald Trump Endorses Breitbart EIC Marlow’s Forthcoming ‘Breaking the Law’ as a ‘…",
    "link": "https://www.breitbart.com/politics/2025/06/26/exclusive-donald-trump-endorses-breitbart-eic-marlows-forthcoming-breaking-the-law-as-a-must-read-issues-grave-warning-on-lawfare/",
    "timestamp": "2025-06-26T18:59:24Z"
  },
  {
    "title": "WH Wants Deep Funding Cuts for War Crimes Investigations",
    "description": "The White House on Wednesday recommended terminating U.S. funding for nearly two dozen programs that conduct war crimes and accountability work globally, including in Myanmar, Syria and on alleged Russian atrocities in Ukraine, according to two U.S. sources f…",
    "link": "https://freerepublic.com/focus/f-news/4325476/posts",
    "timestamp": "2025-06-26T18:59:17Z"
  },
  {
    "title": "Trump Considering Unusual Move to Undercut 'Terrible' Federal Reserve Chair Jerome Powell: Report",
    "description": "\"Maybe, just maybe, I’ll have to change my mind about firing him? But regardless, his Term ends shortly!\" Trump posted.",
    "link": "https://www.westernjournal.com/trump-considering-unusual-move-undercut-terrible-federal-reserve-chair-jerome-powell-report/",
    "timestamp": "2025-06-26T18:59:04Z"
  },
  {
    "title": "SEC SEAN DUFFY: 'One, big, beautiful bill' is down payment on a new, much-needed air traffic control system",
    "description": "Here's why America's airlines and aviation groups support the 'big beautiful bill' to fund a modernized air traffic control system and address safety concerns.",
    "link": "https://www.foxnews.com/opinion/sec-sean-duffy-one-big-beautiful-bill-down-payment-new-much-needed-air-traffic-control-system",
    "timestamp": "2025-06-26T18:58:36Z"
  },
  {
    "title": "'Getting crazier': Legal analyst jarred by hearing in wrongful deportation case",
    "description": "Former federal prosecutor Paul Butler found the recent hearing with Kilmar Ábrego García to be \"crazy and getting crazier.\" Ábrego is the Maryland man who was arrested and deported to a prison in El Salvador, despite an immigration judge ruling that he could …",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2672441827/",
    "timestamp": "2025-06-26T18:58:34Z"
  },
  {
    "title": "Fact-Check: Is Donald Trump Legalizing Driving Without a License?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSeveral videos have gone viral on TikTok making false claims that President Donald Trump plans to abolish driver's license requirements starting in 2026.\nThe videos have widely circulated on the platform over …",
    "link": "https://biztoc.com/x/f6d4202456cd8fd5",
    "timestamp": "2025-06-26T18:56:46Z"
  },
  {
    "title": "Trump-Haters Insist This Viral Video Shows Foreign Queen Mocking Trump’s Face to His Face",
    "description": "A viral video purports to show Queen Máxima of the Netherlands mocking President Donald Trump's facial movements right to his face during a royal visit.\nThe post Trump-Haters Insist This Viral Video Shows Foreign Queen Mocking Trump’s Face to His Face first a…",
    "link": "https://www.mediaite.com/media/news/trump-haters-insist-this-viral-video-shows-foreign-queen-mocking-trumps-face-to-his-face/",
    "timestamp": "2025-06-26T18:56:43Z"
  },
  {
    "title": "Dollar slides to 3-year low on report Trump plans to name next Fed chair early",
    "description": "The U.S. dollar sank to its lowest level in three years on Thursday following a report that President Donald Trump is planning to pick his nominee to serve as the next chair of the Federal Reserve early.\nThe Wall Street Journal's U.S. Dollar Index – which mea…",
    "link": "https://biztoc.com/x/0e757a4d7b534c47",
    "timestamp": "2025-06-26T18:56:42Z"
  },
  {
    "title": "How Israel's vow to change the Middle East reverberates across the map",
    "description": "The geopolitical conditions for the Israel-Iran war have been brewing for decades, and the past 20 months have seen a titanic power shift.",
    "link": "https://www.abc.net.au/news/2025-06-27/israel-vow-to-change-middle-east-reverberates-across-map/105435308",
    "timestamp": "2025-06-26T18:56:37Z"
  },
  {
    "title": "Media missed ‘the most powerful 4 words’ Trump said after strike on Iran",
    "description": "'Something extremely significant happened that has not received the attention it deserves' as President Trump addressed the nation to reassure people about the momentous events taking place",
    "link": "https://www.wnd.com/2025/06/media-missed-most-powerful-4-words-trump-said/",
    "timestamp": "2025-06-26T18:56:10Z"
  },
  {
    "title": "Former TVA CEO Jeff Lyash joins Dominion Energy board | Chattanooga Times Free Press",
    "description": "Former TVA CEO Jeff Lyash joins Dominion Energy board | Chattanooga Times Free Presstimesfreepress.com",
    "link": "https://www.timesfreepress.com/news/2025/jun/26/former-tva-ceo-jeff-lyash-joins-dominion-energy/",
    "timestamp": "2025-06-26T18:55:47Z"
  },
  {
    "title": "Fact-Check: Is Donald Trump Legalizing Driving Without a License?",
    "description": "Claims that President Trump is implementing laws to allow people to drive without a license have gone viral on social media.",
    "link": "https://www.newsweek.com/driving-without-license-donald-trump-law-tiktok-claim-2091232",
    "timestamp": "2025-06-26T18:55:08Z"
  },
  {
    "title": "If Everyone Had Voted, Harris Still Would Have Lost (Nate Cohn/New York Times)",
    "description": "Nate Cohn / New York Times:\nIf Everyone Had Voted, Harris Still Would Have Lost  —  New data, based on authoritative voter records, suggests that Donald Trump would have done even better in 2024 with higher turnout.  —  In the wake of last November's election…",
    "link": "https://www.memeorandum.com/250626/p105",
    "timestamp": "2025-06-26T18:55:01Z"
  },
  {
    "title": "Trump shook Democrats' hold on non-White voters in 2024, report finds (Washington Post)",
    "description": "Washington Post:\nTrump shook Democrats' hold on non-White voters in 2024, report finds  —  A Pew study of the 2024 election also found that higher turnout probably would not have helped Harris win  —  President Donald Trump's victory last year was fueled by g…",
    "link": "https://www.memeorandum.com/250626/p104",
    "timestamp": "2025-06-26T18:55:01Z"
  },
  {
    "title": "Susan Collins Gets Warning from Maine Voters—Poll",
    "description": "Only 3 in 10 Maine voters support President Donald Trump's \"Big Beautiful Bill,\" according to a new poll.",
    "link": "https://www.newsweek.com/susan-collins-gets-warning-maine-voters-poll-2091265",
    "timestamp": "2025-06-26T18:54:06Z"
  },
  {
    "title": "TACO Trump Strikes Again on Tariff Deadline, Karoline Leavitt Admits",
    "description": "Wall Street was right about the president: Trump Always Chickens Out.\r\nDespite spending weeks fuming about the fact that investors had clocked him for repeatedly reneging on his tariff plan, Donald Trump has once again decided to extend the deadline to implem…",
    "link": "https://newrepublic.com/post/197327/donald-trump-karoline-leavitt-taco-tariff-deadline",
    "timestamp": "2025-06-26T18:53:11Z"
  },
  {
    "title": "Ukraine claims advances in Sumy halted as Lavrov says Nato spending rise will not affect Russian security",
    "description": "Russian foreign minister says decision to increase Nato defence spending to 5% of allies’ GDP not ‘significant’",
    "link": "https://www.irishtimes.com/world/europe/2025/06/26/ukraine-claims-advances-in-sumy-halted-as-lavrov-says-nato-spending-rise-will-not-affect-russian-security/",
    "timestamp": "2025-06-26T18:52:23Z"
  },
  {
    "title": "White House Asked if Trump Will Approve 'Big, Beautiful Bill' Medicaid Cuts",
    "description": "The White House press secretary was asked by a reporter if President Trump will sign a final bill that includes Medicaid cuts.",
    "link": "https://www.newsweek.com/white-house-medicaid-cuts-big-beautiful-bill-watch-video-2091277",
    "timestamp": "2025-06-26T18:51:43Z"
  },
  {
    "title": "Behar: Trump 'Lies So Much that You Never Know What the Truth Is'",
    "description": "On Thursday, during an appearance on ABC's \"The View,\" co-host Joy Behar accused President Donald Trump of lying so much that she can no longer discern the truth.\nThe post Behar: Trump ‘Lies So Much that You Never Know What the Truth Is’ appeared first on Bre…",
    "link": "https://www.breitbart.com/clips/2025/06/26/behar-trump-lies-so-much-that-you-never-know-what-the-truth-is/",
    "timestamp": "2025-06-26T18:49:59Z"
  },
  {
    "title": "10 Years After Marriage Equality, Queer Couples Are Worried",
    "description": "On June 26, 2015, the Supreme Court ruled to give LGBTQ couples nationwide the right to marry. But 10 years on, the wave of optimism that followed the decision has changed.",
    "link": "https://www.huffpost.com/entry/10-years-after-obergefell-lgbtq-couples-wrestle-with-new-fears_n_685cb75fe4b02f1b49a85c36",
    "timestamp": "2025-06-26T18:49:13Z"
  },
  {
    "title": "'God spared your life' to bomb Iran: Trump touts praise from Christian leader",
    "description": "President Donald Trump touted the praise of a Christian leader who claimed God prevented his assassination so he could order a strike on Iran.In a Thursday post on Truth Social, Trump shared a message from Ralph Reed, the former chairman of the Georgia GOP an…",
    "link": "https://www.rawstory.com/trump-god-bomb-iran/",
    "timestamp": "2025-06-26T18:47:22Z"
  },
  {
    "title": "Siarhei Tsikhanouski: My release gives Belarusians hope",
    "description": "In his first big interview after his release, Belarusian opposition leader Siarhei Tsikhanouski tells DW about the conditions in prison, his wife’s transformation and hope for the people of Belarus. One of the most well-known Belarusian political prisoners, b…",
    "link": "https://www.dw.com/en/siarhei-tsikhanouski-my-release-gives-belarusians-hope/a-73053383",
    "timestamp": "2025-06-26T18:47:00Z"
  },
  {
    "title": "Siarhei Tsikhanouski: My release gives Belarussians hope",
    "description": "In his first big interview after his release, Belarussian opposition leader Siarhei Tsikhanouski tells DW about the conditions in prison, his wife’s transformation and hope for the people of Belarus.",
    "link": "https://www.dw.com/en/siarhei-tsikhanouski-my-release-gives-belarussians-hope/a-73053383",
    "timestamp": "2025-06-26T18:47:00Z"
  },
  {
    "title": "Senate Parliamentarian Rejects GOP Reconciliation Bill’s Anti-Abortion Provision",
    "description": "The provision violates the Byrd Rule, which restricts non-budgetary items from appearing in reconciliation bills.",
    "link": "https://truthout.org/articles/senate-parliamentarian-rejects-gop-reconciliation-bills-anti-abortion-provision/",
    "timestamp": "2025-06-26T18:46:45Z"
  },
  {
    "title": "What’s next for CPS?",
    "description": "June 18 was the last day on the job for Pedro Martinez, the long-embattled chief executive officer of Chicago Public Schools. Only a week before he left, the Chicago Board of Education narrowly voted to appoint Mayor Brandon Johnson’s senior director of educa…",
    "link": "http://chicagoreader.com/news/news-analysis/cps-macquline-king-leadership-budget/",
    "timestamp": "2025-06-26T18:46:43Z"
  },
  {
    "title": "Trump's economic advisor says tariffs aren't going anywhere, and 'stubborn countries' could see a return to Liberation Day",
    "description": "One of President Trump's economic advisors said tariffs aren't going away, but deadlines could be extended for countries making an effort to negotiate.",
    "link": "https://www.businessinsider.com/trumps-tariffs-trade-negotiations-deadline-economy-growth-2025-6",
    "timestamp": "2025-06-26T18:46:28Z"
  },
  {
    "title": "Amid Mamdani’s Rise, a Centrist Democrat Warns Her Party Not to Misread the Moment",
    "description": "Rep. Laura Gillen of New York sharply rebuked Zohran Mamdani in an interview with TIME, while most others in her party keep quiet",
    "link": "https://time.com/7298136/zohran-mamdani-nyc-laura-gillen/",
    "timestamp": "2025-06-26T18:46:14Z"
  },
  {
    "title": "For the path forward after Mamdani's win, Democrats should look to the past",
    "description": "Chris Hayes reflects on Zohran Mamdani's win in New York and tells Democrats the lessons they can take from his campaign to show voters they can meet the moment.",
    "link": "https://www.msnbc.com/top-stories/latest/zohran-mamdani-new-york-lessons-for-democrats-rcna215239",
    "timestamp": "2025-06-26T18:46:02Z"
  },
  {
    "title": "Over 800 Canadians flee Iran and Israel as war erupts and ceasefire hangs by a thread",
    "description": "Amidst a fragile ceasefire between Iran and Israel, over 800 Canadians, permanent residents, and their families have been evacuated from the conflict zones. The evacuations followed intense exchanges triggered by Israeli strikes on Iranian nuclear sites. Cana…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/over-800-canadians-flee-iran-and-israel-as-war-erupts-and-ceasefire-hangs-by-a-thread/articleshow/122097808.cms",
    "timestamp": "2025-06-26T18:44:19Z"
  },
  {
    "title": "Mar-a-Lago Security Zone is Palm Beach’s hottest neighborhood",
    "description": "The best security money can buy, no traffic, private beach access and a five-minute walk to the golf club –– these are some of the perks of living in one of Palm Beach’s most coveted neighborhoods. Also, you might meet the president.  Since November, sales ha…",
    "link": "https://therealdeal.com/miami/2025/06/26/sales-in-mar-a-lago-security-zone-surge-post-election/",
    "timestamp": "2025-06-26T18:42:44Z"
  },
  {
    "title": "Hey What's In The Big Bad Blowjobs For Billionaires Bill Now?",
    "description": "Parliamentarian killed off massive sale of public lands, but now there's bigger subsidies for fossil fuels.",
    "link": "https://www.wonkette.com/p/hey-whats-in-the-big-bad-blowjobs",
    "timestamp": "2025-06-26T18:39:05Z"
  },
  {
    "title": "Turkey's Recep Erdogan Cheers 'My Friend Trump' After NATO Meeting",
    "description": "Turkish President Recep Tayyip Erdogan said on Thursday that his country’s chances of buying advanced F-35 fighter jets from the United States are looking up after his meeting with President Donald Trump at the NATO summit this week.\nThe post Turkey’s Recep E…",
    "link": "https://www.breitbart.com/middle-east/2025/06/26/turkeys-recep-erdogan-cheers-my-friend-trump-after-nato-meeting/",
    "timestamp": "2025-06-26T18:37:29Z"
  },
  {
    "title": "Hegseth defends results of US strikes in push to win public opinion battle",
    "description": "The defence secretary also lashed out at the media in a combative briefing which was praised by his boss at the White House.",
    "link": "https://www.bbc.com/news/articles/c20rd30l7l3o",
    "timestamp": "2025-06-26T18:35:54Z"
  },
  {
    "title": "DOGE'd? IRS Sheds 26% Of Staff As Federal Workforce Pared Down",
    "description": "DOGE'd? IRS Sheds 26% Of Staff As Federal Workforce Pared Down\n \nAuthored by Tom Ozimek via The Epoch Times,\nA new report from the head of the IRS’s Taxpayer Advocate Service shows that the agency has lost more than one-quarter of its workforce since Presiden…",
    "link": "https://biztoc.com/x/5b40028ab5320e1c",
    "timestamp": "2025-06-26T18:34:29Z"
  },
  {
    "title": "What if Microsoft just turned you off? Security pro counts the cost of dependency",
    "description": "Czech researcher lays out a business case for reducing reliance on Redmond\nComment A sharply argued blog post warns that heavy reliance on Microsoft poses serious strategic risks for organizations – a viewpoint unlikely to win favor with Redmond or its millio…",
    "link": "https://www.theregister.com/2025/06/26/cost_of_microsoft_dependency/",
    "timestamp": "2025-06-26T18:34:14Z"
  },
  {
    "title": "Zohran Mamdani's astonishing rise is a vital lesson for Democrats",
    "description": "Zohran Mamdani's defeat of Andrew Cuomo in the New York mayoral primary shows Democrats how they can win if they embrace economic populism.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/zohran-mamdani-new-york-mayor-democrats-trump-rcna215007",
    "timestamp": "2025-06-26T18:33:46Z"
  },
  {
    "title": "American absence at climate talks met with regret — and relief",
    "description": "Countries jostle to fill the vacuum left by Washington at midyear negotiations.",
    "link": "https://www.politico.eu/article/american-trump-absence-bonn-un-climate-talks-regret-relief/",
    "timestamp": "2025-06-26T18:32:54Z"
  },
  {
    "title": "Larry Summers Calls Trump Tariffs a ‘Self-Inflicted Wound’ on US Economy",
    "description": "As tariffs climb and deficits grow, Larry Summers warns of stagflation risks and lower U.S. growth.",
    "link": "https://observer.com/2025/06/larry-summers-trump-tariff-comment/",
    "timestamp": "2025-06-26T18:32:44Z"
  },
  {
    "title": "No parallels between Israel-Iran and Ukraine conflicts – Moscow",
    "description": "The two crises have completely different histories and root causes, Kremlin spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620573-peskov-iran-ukraine-comparison/",
    "timestamp": "2025-06-26T18:31:24Z"
  },
  {
    "title": "These 4 conservative law firms are thriving under Trump",
    "description": "Jones Day played a prominent role in the first presidency of President Donald Trump. The law firm represented Trump in his first presidential campaign and sent several lawyers to work in the administration, including Don McGahn, who was the White House counse…",
    "link": "https://www.abajournal.com/news/article/these-conservative-law-firms-are-thriving-under-trump",
    "timestamp": "2025-06-26T18:31:00Z"
  },
  {
    "title": "Trump nearly won a majority of Latino voters in 2024, Pew study finds",
    "description": "A study of the 2024 vote found that Trump received more support from Latinos than previously believed",
    "link": "https://www.salon.com/2025/06/26/trump-nearly-won-a-majority-of-latino-voters-in-2024-pew-study-finds/",
    "timestamp": "2025-06-26T18:30:56Z"
  },
  {
    "title": "Supreme Court allows states to cut Medicaid funding for Planned Parenthood",
    "description": "States can block the country’s biggest abortion provider, Planned Parenthood, from receiving Medicaid money for health services such as contraception and cancer screenings without facing lawsuits from patients, the Supreme Court ruled on Thursday.\n\n\n\nThe 6-3 …",
    "link": "https://www.fastcompany.com/91359143/supreme-court-states-medicaid-funding-planned-parenthood",
    "timestamp": "2025-06-26T18:30:46Z"
  },
  {
    "title": "How Israel launched attacks from inside Iran to sow chaos during the war",
    "description": "Israel used small drones and precision-guided missiles to assist its surprise offensive that started war against Iran.",
    "link": "https://www.aljazeera.com/news/2025/6/26/how-israel-launched-attacks-from-inside-iran-to-sow-chaos-during-the-war",
    "timestamp": "2025-06-26T18:30:29Z"
  },
  {
    "title": "Spain's leader sticks by decision to break with NATO spending goal despite Trump tariff threats",
    "description": "Spanish Prime Minister Pedro Sánchez is sticking by his decision to break with NATO allies this week from spending more on defense",
    "link": "https://abcnews.go.com/International/wireStory/spains-leader-sticks-decision-break-nato-spending-goal-123239949",
    "timestamp": "2025-06-26T18:30:29Z"
  },
  {
    "title": "Countries agree 10% increase for UN climate budget",
    "description": "BONN (Reuters) -Countries agreed on Thursday to increase the U.N. climate body's budget by 10% for the next two years, a move the body welcomed as a...",
    "link": "https://www.yahoo.com/news/countries-agree-10-increase-un-183019912.html",
    "timestamp": "2025-06-26T18:30:19Z"
  },
  {
    "title": "Murder Rates Could Hit Record Lows This Year, but Killings by Police Are Rising",
    "description": "There’s a good chance the United States will see the lowest murder rate it has ever recorded this year, a major change from the early pandemic, when killings skyrocketed. In 2023 and 2024, homicides fell at what appears to be a record pace—and they’re continu…",
    "link": "https://www.motherjones.com/politics/2025/06/murder-rates-declining-record-lows-2025-police-killings-increasing/",
    "timestamp": "2025-06-26T18:30:12Z"
  }
]