[
  {
    "title": "From Tesla to Twitter and SpaceX, meet Elon Musk's go-to man who now oversees DOGE: Key points",
    "description": "Steve Davis has been appointed by US President Donald Trump's close aide Elon Musk as the head of the Department of Government Efficiency to streamline US government operations. A longtime collaborator and Musk's go-to-man, Davis now oversees DOGE and 'hates …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-steve-davis-from-tesla-to-twitter-and-spacex-meet-elon-musks-go-to-man-who-now-oversees-doge-key-points/articleshow/119297209.cms",
    "timestamp": "2025-03-21T09:50:18Z"
  },
  {
    "title": "The Alleged Hamas Link That Landed Indian Researcher In Trouble In US",
    "description": "An Indian researcher's arrest in the US over his alleged ties to Hamas has put the focus on his in-laws, a Palestine-origin family with alleged links to the Palestinian group fighting a year-long war with Israel.",
    "link": "https://www.ndtv.com/world-news/badar-khan-suri-the-alleged-hamas-link-that-landed-indian-researcher-in-trouble-in-us-7974432",
    "timestamp": "2025-03-21T09:50:06Z"
  },
  {
    "title": "World's glacier mass shrank again in 2024, says UN",
    "description": "All 19 of the world's glacier regions experienced a net loss of mass in 2024 for the third consecutive year, the United Nations said on Friday, warning that saving the planet's glaciers was now a matter of \"survival.\"",
    "link": "https://phys.org/news/2025-03-world-glacier-mass-shrank.html",
    "timestamp": "2025-03-21T09:50:02Z"
  },
  {
    "title": "Trump warns of jail time for Tesla vandals, anyone funding the attacks: 'WE ARE LOOKING FOR YOU!!!'",
    "description": "President Donald Trump said anyone committing or funding attacks on Tesla vehicles and properties across the country will likely go to jail for up to 20 years",
    "link": "https://www.foxnews.com/us/trump-warns-jail-time-tesla-vandals-anyone-funding-attacks-we-looking-you",
    "timestamp": "2025-03-21T09:49:46Z"
  },
  {
    "title": "Iran's Khamenei says US threats 'will get them nowhere'",
    "description": "Iran's supreme leader said on Friday that U.S. threats against his country \"will get them nowhere\", after President Donald Trump warned of possible military action against the Islamic republic.",
    "link": "https://www.hurriyetdailynews.com/irans-khamenei-says-us-threats-will-get-them-nowhere-207179",
    "timestamp": "2025-03-21T09:48:05Z"
  },
  {
    "title": "Global supply disruption to push up premium on domestic gold prices",
    "description": "RBI moved 102 tonnes of gold from the Bank of England’s vaults to India; many central banks have moved their gold reserves stored in London to their own country in anticipation of geo-political issues",
    "link": "https://www.thehindubusinessline.com/markets/gold/global-supply-disruption-to-push-up-premium-on-domestic-gold-prices/article69357034.ece",
    "timestamp": "2025-03-21T09:45:38Z"
  },
  {
    "title": "Trump floats US takeover of Ukraine nuclear plants",
    "description": "Washington (AFP) Mar 20, 2025\n\n\n Donald Trump has told Volodymyr Zelensky that the United States could own and run Ukraine's nuclear power plants as part of his latest bid to secure a ceasefire in Russia's invasion of its neighbor. \n\nThe offer comes as some 3…",
    "link": "https://www.nuclearpowerdaily.com/reports/Trump_floats_US_takeover_of_Ukraine_nuclear_plants_999.html",
    "timestamp": "2025-03-21T09:38:02Z"
  },
  {
    "title": "Trump's call for AI deregulation gets strong backing from Big Tech",
    "description": "Washington (AFP) Mar 21, 2025\n\n\n Major tech firms are pushing the administration of President Donald Trump to loosen rules on building artificial intelligence, arguing it is the only way to maintain a US edge and compete with China. \n\nSpooked by generative AI…",
    "link": "https://www.spacedaily.com/reports/Trumps_call_for_AI_deregulation_gets_strong_backing_from_Big_Tech_999.html",
    "timestamp": "2025-03-21T09:38:02Z"
  },
  {
    "title": "US Airstrikes Aren't Stopping Houthi Attacks",
    "description": "The Houthi rebels have launched attacks in the Red Sea and against Israel despite the airstrikes ordered by President Donald Trump",
    "link": "https://biztoc.com/x/ed12c37d7197dccc",
    "timestamp": "2025-03-21T09:35:11Z"
  },
  {
    "title": "If Trump Defies the Courts, Here’s What a Judge Can Do",
    "description": "Amid the growing battle between President Donald Trump and the courts, a once-unthinkable question is harder to shrug off: Will the administration deliberately defy federal judges if it doesn’t get what it wants? The issue has come into sharp relief in the ch…",
    "link": "https://freerepublic.com/focus/f-chat/4305767/posts",
    "timestamp": "2025-03-21T09:32:59Z"
  },
  {
    "title": "Eric Trump joins Bitcoin firm Metaplanet’s advisory board, stock surges 17%",
    "description": "Tokyo-listed Bitcoin treasury firm Metaplanet has appointed Eric Trump, the son of US President Donald Trump, to its newly formed Strategic Board of Advisors. Metaplanet announced Trump’s appointment on March 21, confirming that he will join as the first offi…",
    "link": "https://cryptoslate.com/eric-trump-joins-bitcoin-firm-metaplanets-advisory-board-stock-surges-17/",
    "timestamp": "2025-03-21T09:32:59Z"
  },
  {
    "title": "China's Western Hemisphere Expansion Threatens America, US Says",
    "description": "China said there were \"no geopolitical calculations\" in its cooperation with countries in Latin America.",
    "link": "https://www.newsweek.com/china-western-hemisphere-expansion-threat-us-latin-america-caribbean-2048398",
    "timestamp": "2025-03-21T09:30:24Z"
  },
  {
    "title": "US Airstrikes Aren't Stopping Houthi Attacks",
    "description": "The Houthi rebels have launched attacks in the Red Sea and against Israel despite the airstrikes ordered by President Donald Trump",
    "link": "https://www.newsweek.com/us-airstrikes-arent-stopping-houthi-attacks-2048400",
    "timestamp": "2025-03-21T09:30:09Z"
  },
  {
    "title": "Why America’s tech industry relies so heavily on foreign workers",
    "description": "A heated debate has recently erupted between two groups of supporters of President Donald Trump. The dispute concerns the H-1B visa system, the program that allows U.S. employers to hire skilled foreign workers in specialty occupations—mostly in the tech indu…",
    "link": "https://www.fastcompany.com/91303246/why-americas-tech-industry-relies-so-heavily-on-foreign-workers",
    "timestamp": "2025-03-21T09:30:00Z"
  },
  {
    "title": "Italian paper prints fully-AI edition, but not to 'kill' journalism",
    "description": "In a world first, an Italian newspaper is printing a fully AI-generated edition for a month in what its director said Thursday was an experiment to \"revitalize journalism, not to kill it.\"",
    "link": "https://techxplore.com/news/2025-03-italian-paper-fully-ai-journalism.html",
    "timestamp": "2025-03-21T09:28:55Z"
  },
  {
    "title": "President Trump worse than every president in modern history in key area, new polling shows",
    "description": "President Trump worse than every president in modern history in key area, new polling showspennlive.com",
    "link": "https://www.pennlive.com/news/2025/03/donald-trump-is-worse-than-every-president-in-modern-history-in-key-area-new-polling-shows.html",
    "timestamp": "2025-03-21T09:27:11Z"
  },
  {
    "title": "Cisco Smart Licensing Utility flaws actively exploited in the wild",
    "description": "Experts warn of the active exploitation of two recently patched security vulnerabilities affecting Cisco Smart Licensing Utility. Cisco disclosed two vulnerabilities in its Smart Licensing Utility: CVE-2024-20439, a static credential backdoor, and CVE-2024-20…",
    "link": "https://securityaffairs.com/175692/security/cisco-smart-licensing-utility-flaws-actively-exploited-in-the-wild.html",
    "timestamp": "2025-03-21T09:26:27Z"
  },
  {
    "title": "Trump targeted 20 of the biggest law firms over their diversity programs. A GOP favorite is missing from the list.",
    "description": "Donald Trump has lavished his loyal lawyers with rewards while targeting those he believes wronged him.",
    "link": "https://www.businessinsider.com/trumps-law-firm-diversity-programs-jones-day-2025-3",
    "timestamp": "2025-03-21T09:25:01Z"
  },
  {
    "title": "US Targets China's 'Teapot' Oil Refiners to Choke Iran",
    "description": "Washington has issued new Iran-related sanctions, including a Chinese \"teapot,\" or independent refiner, and vessels that supply oil.",
    "link": "https://www.newsweek.com/china-us-oil-iran-trump-2048368",
    "timestamp": "2025-03-21T09:20:27Z"
  },
  {
    "title": "Is the Trump conflict with judges a constitutional crisis? What to know",
    "description": "Legal experts warn that the country is sliding toward a constitutional crisis as President Donald Trump openly defies the federal courts.",
    "link": "https://abcnews.go.com/Politics/trump-administrations-conflict-judges-constitutional-crisis/story?id=119981540",
    "timestamp": "2025-03-21T09:20:12Z"
  },
  {
    "title": "Foreign adversaries may swoop in to recruit fired federal workers, experts say",
    "description": "Thousands of fired federal workers offer appealing experience and skills -- to the private sector and foreign adversaries alike, experts tell ABC News.",
    "link": "https://abcnews.go.com/Politics/foreign-adversaries-private-sector-state-governments-swoop-recruit/story?id=119923215",
    "timestamp": "2025-03-21T09:17:40Z"
  },
  {
    "title": "Crypto price today: Bitcoin falls below $84k as geopolitical tensions rise",
    "description": "Bitcoin and major cryptos fell amid geopolitical tensions and US tariff concerns. Central banks held rates steady. Trump reiterated pro-crypto stance, but sentiment remained cautious. Altcoins also declined as investors sought safe-haven assets.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/crypto-price-today-bitcoin-falls-below-84k-as-geopolitical-tensions-rise/articleshow/119296042.cms",
    "timestamp": "2025-03-21T09:17:38Z"
  },
  {
    "title": "EU sidesteps Hungary veto, but more Ukraine showdowns loom",
    "description": "Budapest is quite content being the odd one out on Ukraine. The rest of the EU is also increasingly happy to bypass Hungarian vetoes — at least when it can.",
    "link": "https://www.dw.com/en/eu-sidesteps-hungary-veto-but-more-ukraine-showdowns-loom/a-71991130",
    "timestamp": "2025-03-21T09:17:00Z"
  },
  {
    "title": "The End of USAID Is an Opportunity for Africa",
    "description": "Reducing foreign aid can help end dependency and promote African agency.",
    "link": "http://foreignpolicy.com/2025/03/21/usaid-africa-foreign-aid-development/",
    "timestamp": "2025-03-21T09:16:32Z"
  },
  {
    "title": "Trump denies Musk to be briefed on top-secret plan for potential war with China",
    "description": "The New York Times reported that the briefing would include 20 to 30 slides outlining how the United States would fight in a conflict with China.",
    "link": "https://nypost.com/2025/03/21/us-news/trump-denies-musk-to-be-briefed-on-top-secret-plan-for-potential-war-with-china/",
    "timestamp": "2025-03-21T09:16:31Z"
  },
  {
    "title": "'We are looking for you': Trump has a warning for people vandalising Teslas, says they will be thrown in jails for 20 years",
    "description": "US President Donald Trump announced that individuals caught sabotaging Tesla cars could face up to twenty years in jail. This comes after violent attacks on Tesla properties. US Attorney General Pam Bondi termed these attacks as domestic terrorism. Tesla’s CE…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-are-looking-for-you-trump-has-a-warning-for-people-vandalising-teslas-says-they-will-be-thrown-in-jails-for-20-years/articleshow/119296090.cms",
    "timestamp": "2025-03-21T09:16:17Z"
  },
  {
    "title": "Explained: Inside Donald Trump's Dismantling Of US Education Department",
    "description": "US President Donald Trump is close to fulfilling a long-standing conservative ambition: the complete dismantling of Department of Education.",
    "link": "https://www.ndtv.com/world-news/donald-trump-explained-inside-donald-trumps-dismantling-of-us-education-department-7975487",
    "timestamp": "2025-03-21T09:15:52Z"
  },
  {
    "title": "Naheed Nenshi needs to get his elbows up",
    "description": "Naheed Nenshi has never failed at politics before. But if he keeps going the way he has over the last nine months, he's about to find out what that feels like.",
    "link": "https://www.nationalobserver.com/2025/03/20/opinion/naheed-nenshi-alberta-ndp",
    "timestamp": "2025-03-21T09:09:08Z"
  },
  {
    "title": "No journalists, no questions. An election campaign just the way Poilievre likes it",
    "description": "Poilievre has a decidedly testy, if not combative, relationship with journalists. He is quick to anger when faced with questions he doesn’t like, and he has used his skill as a bare-knuckled Parliamentary debater to belittle reporters who annoy him.",
    "link": "https://www.nationalobserver.com/2025/03/20/opinion/poilievre-campaign-election-journalists-questions-carney",
    "timestamp": "2025-03-21T09:09:07Z"
  },
  {
    "title": "The personal price of politics in the Trump era",
    "description": "While neither Andrew Furey nor Dennis King said it was the main reason for their resignations as premiers from Newfoundland and Labrador and P.E.I, respectively, both alluded to the changed political dynamics with Donald Trump back in the White House.",
    "link": "https://www.nationalobserver.com/2025/03/19/opinion/premiers-resignations-politics-trump",
    "timestamp": "2025-03-21T09:09:05Z"
  },
  {
    "title": "Trump has weakened Ukraine's hand against Russia. It fits with a pattern of Western behavior that has shaped the war.",
    "description": "Ukraine is in a tough spot again following the actions of a partner nation. This has been a recurring issue throughout the war.",
    "link": "https://www.businessinsider.com/us-weakening-ukraine-position-negoatiations-part-of-a-pattern-2025-3",
    "timestamp": "2025-03-21T09:09:01Z"
  },
  {
    "title": "Fired federal worker 'whiplash': How mass layoffs are causing mental, physical crises",
    "description": "President Donald Trump signed an executive order Thursday afternoon gutting the Department of Education, which is the latest on his pledge to reduce the federal",
    "link": "https://wjla.com/news/health/fired-federal-worker-whiplash-mass-layoffs-support-psychiatrist-arlington-employees-mental-physical-health-crises-benefits-support",
    "timestamp": "2025-03-21T09:08:26Z"
  },
  {
    "title": "Howard Lutnick says Elon Musk vowed onstage that DOGE would cut $2 trillion in spending when he was supposed to say $1 trillion",
    "description": "Lutnick said he and Musk were supposed to say they save and earn $1 trillion collectively, but Musk ended up saying he would cut $2 trillion.",
    "link": "https://www.businessinsider.com/howard-lutnick-elon-musk-supposed-doge-cut-1-trillion-2025-3",
    "timestamp": "2025-03-21T09:03:54Z"
  },
  {
    "title": "Minnesota state senator resigns after he was charged with soliciting a minor for prostitution",
    "description": "A Republican Minnesota state senator who was caught in a sting operation resigned under fire Thursday after he was charged with soliciting a minor for prostitution, stepping down before the Senate could vote on whether to expel him.",
    "link": "https://nypost.com/2025/03/21/us-news/minnesota-state-senator-resigns-after-he-was-charged-with-soliciting-a-minor-for-prostitution/",
    "timestamp": "2025-03-21T09:03:02Z"
  },
  {
    "title": "How Donald Trump's climate cuts will cost US taxpayers",
    "description": "On his return to the White House, Donald Trump signed orders rolling back climate policies, targeting wind energy, and cutting clean power funding. Despite economic growth in the renewable sector, the EPA revoked $20 billion in green grants, citing alleged fr…",
    "link": "https://timesofindia.indiatimes.com/world/us/how-donald-trumps-climate-cuts-will-cost-us-taxpayers/articleshow/119295434.cms",
    "timestamp": "2025-03-21T09:02:56Z"
  },
  {
    "title": "Trump's Looming War for a Key Trade Route Will Be Costly",
    "description": "As President Donald Trump seeks to assert U.S. influence across the globe by implementing stiff tariffs and threatening to seize the Panama Canal, his first economically motivated hot war looms in the turbulent seas off Yemen.\nWhile promising to oversee a mor…",
    "link": "https://biztoc.com/x/863ab252fbbf4225",
    "timestamp": "2025-03-21T09:02:13Z"
  },
  {
    "title": "Trump Debunks Reports Of Elon Musk's Briefing On US-China War Strategy: 'China Will Not Even Be Mentioned'",
    "description": "U.S. President Donald Trump slammed reports suggesting that billionaire Elon Musk would be briefed by the Pentagon on potential U.S.-China war strategies.\nWhat Happened: The U.S. President took to his Truth Social to call out the New York Times report which s…",
    "link": "https://biztoc.com/x/8c136bc5ee66243e",
    "timestamp": "2025-03-21T09:01:25Z"
  },
  {
    "title": "The Deep State Strikes Back",
    "description": "If you have a Netflix account, you've likely been prodded to check out Zero Day, a \"political thriller\" starring the grumpy liberal activist Robert De Niro in his first television role. If you're on the fence, there are two things you should consider before p…",
    "link": "https://freebeacon.com/culture/the-deep-state-strikes-back/",
    "timestamp": "2025-03-21T09:00:55Z"
  },
  {
    "title": "Comedian Andrew Schulz says Democrats' 'coolness factor' is long gone, party is no longer dominating culture",
    "description": "Comedian Andrew Schulz believes the \"coolness factor\" has escaped Democrats after decades of dominating culture in America, while Republicans are gaining control.",
    "link": "https://www.foxnews.com/media/comedian-andrew-schulz-says-democrats-coolness-factor-long-gone-party-no-longer-dominating-culture",
    "timestamp": "2025-03-21T09:00:40Z"
  },
  {
    "title": "LINDA McMAHON: My vision for eliminating the Department of Education",
    "description": "Americans can look at stagnating student test scores and know that something isn't right at the Department of Education. Trump brough in Linda McMahon to help sunset the operation.",
    "link": "https://www.foxnews.com/opinion/linda-mcmahon-my-vision-eliminating-department-education",
    "timestamp": "2025-03-21T09:00:19Z"
  },
  {
    "title": "Columnist who calls herself a 'MAGA leftist' shares why Trump's support goes beyond conservatives",
    "description": "In an interview with Fox News Digital, author and columnist Batya Ungar-Sargon spoke about how she went from being a \"woke leftist\" to a \"MAGA leftist.\"",
    "link": "https://www.foxnews.com/media/columnist-who-calls-herself-maga-leftist-shares-why-trumps-support-goes-beyond-conservatives",
    "timestamp": "2025-03-21T09:00:17Z"
  },
  {
    "title": "Newsrooms facing ‘inmates-running-the-asylum situation’ with liberal staffers ruling the roost, watchdogs say",
    "description": "Mainstream news organizations are facing an \"inmates-running-the-asylum situation\" after liberal employees have failed to get on the same page with business-minded bosses.",
    "link": "https://www.foxnews.com/media/newsrooms-facing-inmates-running-the-asylum-situation-liberal-staffers-ruling-roost-watchdogs-say",
    "timestamp": "2025-03-21T09:00:10Z"
  },
  {
    "title": "This Legal Group Keeps Suing Trump — And There's A Reason They Keep Winning",
    "description": "Democracy Forward has emerged as a leading legal organization that’s been slowing, if not stopping, some of Trump’s recklessness.",
    "link": "https://www.huffpost.com/entry/democracy-forward-trump-lawsuits_n_67dc7b61e4b0b47eccfedbe2",
    "timestamp": "2025-03-21T09:00:09Z"
  },
  {
    "title": "This is how we protect US dollar dominance in the digital age",
    "description": "The Trump administration and Congress are ensuring that the U.S. is defining how digital assets are used, traded and created at home and abroad.",
    "link": "https://www.foxnews.com/opinion/how-we-protect-us-dollar-dominance-digital-age",
    "timestamp": "2025-03-21T09:00:07Z"
  },
  {
    "title": "Trump Administration Weighs Sanctions on Foreign Funders of Pro-Hamas Campus Protests",
    "description": "The Trump administration is mulling plans to sanction the international funders behind pro-Hamas protests, including prominent Qatari nationals who have vast financial holdings inside the United States, current and former U.S. officials familiar with the inte…",
    "link": "https://freebeacon.com/trump-administration/trump-administration-weighs-sanctions-on-foreign-funders-of-pro-hamas-campus-protests/",
    "timestamp": "2025-03-21T09:00:04Z"
  },
  {
    "title": "Trump's Looming War for a Key Trade Route Will Be Costly",
    "description": "A U.S. confrontation with Ansar Allah \"will come at the cost of other things that we want to do,\" an ex-CENTCOM chief told Newsweek.",
    "link": "https://www.newsweek.com/trumps-looming-war-key-trade-route-will-costly-2048315",
    "timestamp": "2025-03-21T09:00:02Z"
  },
  {
    "title": "Republicans' Next Target—California",
    "description": "California has historically been a heavily Democratic state. But some Republicans think that the tide might be turning.",
    "link": "https://www.newsweek.com/california-republican-party-comeback-polls-2048032",
    "timestamp": "2025-03-21T09:00:01Z"
  },
  {
    "title": "The Bidens want back in",
    "description": "Former President Joe Biden has told some Democratic leaders he’ll raise funds, campaign and do anything else necessary for Democrats to recover lost ground.",
    "link": "https://www.nbcnews.com/politics/joe-biden/bidens-want-back-in-rcna196956",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "The State Medical Board Has Evidence This Doctor Was Hurting Patients. It Renewed His License — Twice.",
    "description": "by J. David McSwane, ProPublica, and Mara Silvers, Montana Free Press \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nSince at least April 2021…",
    "link": "https://www.propublica.org/article/thomas-weiner-montana-medical-board-renewed-st-peters-hospital",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Trump EPA’s Next Move: Making It Harder to Sue for Getting Cancer from Roundup",
    "description": "The corporation behind Roundup herbicide has paid out nearly $11 billion in lawsuits. Now it's backing an EPA rule that would stop the bleeding.\nThe post Trump EPA’s Next Move: Making It Harder to Sue for Getting Cancer from Roundup appeared first on The Inte…",
    "link": "https://theintercept.com/2025/03/21/trump-epa-monsanto-roundup-bayer-cancer-chemicals/",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Visa Stock To $220?",
    "description": "Although such a drastic move might appear extreme, it has happened before and could occur again.",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/03/21/visa-stock-to-220/",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Fired, rehired and baffled: Confusion reigns for thousands of reinstated federal workers",
    "description": "Raphael Garcia is one of 24,000 probationary federal workers on a career roller-coaster ride as Elon Musk’s DOGE attempts to reshape the government.",
    "link": "https://www.nbcnews.com/news/us-news/fired-rehired-baffled-confusion-reigns-thousands-reinstated-federal-wo-rcna197235",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "At This Point, Silicon Valley Militarists Aren’t Just Greedy—They’re Bloodthirsty",
    "description": "William D. Hartung\n\n\n\nBy all means, let’s unite around a common purpose. But that purpose shouldn’t be a supposedly more efficient way to build killing machines.\r\n\n\r\n\n\nThe post At This Point, Silicon Valley Militarists Aren’t Just Greedy—They’re Bloodthirsty …",
    "link": "https://www.thenation.com/?post_type=article&p=547336",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Trans Kids Are Facing a Terrifying New Reality",
    "description": "Matthew Herskowitz\n\n\n\nThe nationwide drive to eliminate gender-affirming care has trans youth and their families contemplating a series of agonizing choices.\r\n\n\r\n\n\nThe post Trans Kids Are Facing a Terrifying New Reality appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=547310",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Trump tries to save Tesla, recession fears, and dismantling the DOE: Politics news roundup",
    "description": "President Donald Trump’s burgeoning clashes with some of the U.S.’ top trade partners aren’t just trade disputes — they could be part of an economic war, according to one expert. Tariffs — which are set to slam most U.S. industries, including tech and media c…",
    "link": "https://qz.com/trump-trade-war-tech-education-department-tesla-musk-1851771341",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Trump's second win has some questioning women's electability. Mikie Sherrill says 'Watch me.'",
    "description": "Former Vice President Kamala Harris’ loss in the presidential race has given rise, again, to whispered worries in the Democratic Party about female candidates and electability — resurrecting a fraught conversation that bubbled for years after President Donald…",
    "link": "https://www.nbcnews.com/politics/elections/-trump-win-insiders-questioning-womens-electability-mikie-sherrill-shr-rcna196880",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "J.D. Vance Is the Most Disliked New Vice President in History",
    "description": "The public isn’t taking to his obnoxious style, which bodes well for politics in the post-Trump era.\nThe post J.D. Vance Is the Most Disliked New Vice President in History appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/03/21/j-d-vance-is-the-most-disliked-new-vice-president-in-history/",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "Trump Sets His Sights on “Eliminating” Public Education",
    "description": "Chris Lehmann\n\n\n\nYesterday’s executive order would dismantle the Department of Education, shutting down programs American families rely on.\r\n\n\r\n\n\nThe post Trump Sets His Sights on “Eliminating” Public Education appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-department-education/",
    "timestamp": "2025-03-21T09:00:00Z"
  },
  {
    "title": "The Reforestation of American Civic Life: What Publishing Can Do in the Face of the Trump",
    "description": "In the time since Donald Trump returned to the White House, he has done more damage to the federal government’s ability to function than any president in history. He has lit the fuse on a half-dozen or more different crises, from general inflation, to the col…",
    "link": "https://lithub.com/the-reforestation-of-american-civic-life-what-publishing-can-do-in-the-face-of-the-trump/",
    "timestamp": "2025-03-21T08:59:06Z"
  },
  {
    "title": "Thousands of California Teachers Told They Could Lose Their Jobs",
    "description": "Thousands of teachers in California are at risk of losing their jobs due to the state's budget cuts going into the 2025-26 school year, according to the California Teachers Association (CTA), which represents 300,000 school employees. Why It Matters Schools a…",
    "link": "https://freerepublic.com/focus/f-chat/4305766/posts",
    "timestamp": "2025-03-21T08:55:43Z"
  },
  {
    "title": "Italy's Il Foglio Prints AI Edition Of Newspaper To \"Revitalise Journalism\"",
    "description": "Il Foglio, a daily broadsheet with an irreverent touch and a circulation of about 29,000, says it is the first newspaper in the world to print entire editions created through artificial intelligence.",
    "link": "https://www.ndtv.com/world-news/italys-il-foglio-prints-ai-edition-of-newspaper-to-revitalise-journalism-7975312",
    "timestamp": "2025-03-21T08:55:20Z"
  },
  {
    "title": "U.K. Magazine's Trump-Slamming Cover Goes Viral For Its Putin Punchline",
    "description": "Private Eye's speech bubble front page was summed up as \"perfect.\"",
    "link": "https://www.huffpost.com/entry/private-eye-magazine-trump-putin-cover_n_67dd1208e4b0727e46b78ce5",
    "timestamp": "2025-03-21T08:52:53Z"
  },
  {
    "title": "The Week Unwrapped: Why is Trump sending detainees to El Salvador?",
    "description": "Why is Donald Trump sending people to jail in El Salvador? Should councils reverse their bans on playing in streets? And can a Peruvian farmer defeat an energy giant? Olly Mann and The Week delve behind the headlines and debate what really matters from the pa…",
    "link": "https://biztoc.com/x/cc358236489f4d1f",
    "timestamp": "2025-03-21T08:50:50Z"
  },
  {
    "title": "'Maliciously false information': Elon Musk threatens Pentagon leakers over 'top-secret plans' for China war story",
    "description": "President Donald Trump's close aide Elon Musk has hit out at New York Times over the report that he will reportedly get access to the Pentagon’s top-secret plans for a potential war with China. Calling it as 'pure propaganda', Musk threatened Pentagon staffer…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-nyt-report-pentagon-potential-china-war-briefing-maliciously-false-information-elon-musk-threatens-pentagon-leakers-over-top-secret-plans-for-china-war-story/articleshow/119294831.cms",
    "timestamp": "2025-03-21T08:47:24Z"
  },
  {
    "title": "The Week Unwrapped: Why is Trump sending detainees to El Salvador?",
    "description": "Plus should councils reverse their bans on playing in streets? And can a Peruvian farmer defeat an energy giant?",
    "link": "https://theweek.com/podcasts/the-week-unwrapped-why-is-trump-sending-detainees-to-el-salvador",
    "timestamp": "2025-03-21T08:47:18Z"
  },
  {
    "title": "‘Try actually fighting’: Democrats face voters’ fury at town halls | CNN Politics",
    "description": "Democratic lawmakers have faced eruptions of anger at town hall meetings across the country this week, as constituents have coupled their fury over President Donald Trump’s actions with deep frustration over what they see as a feckless Democratic response.",
    "link": "https://www.cnn.com/2025/03/21/politics/town-halls-democrats-republicans/index.html",
    "timestamp": "2025-03-21T08:43:39Z"
  },
  {
    "title": "Do tariffs raise inflation?",
    "description": "Usually, but the bigger problem is that they harm economic growth and innovation",
    "link": "https://www.livemint.com/opinion/online-views/do-tariffs-raise-inflation-11742545500001.html",
    "timestamp": "2025-03-21T08:43:31Z"
  },
  {
    "title": "Elon Musk threatens Pentagon leakers after NYT report on secret China war briefing",
    "description": "\"They will be found,\" warns U.S. President Donald Trump's billionaire adviser as White House lashes out at the media.",
    "link": "https://www.politico.eu/article/elon-musk-threatens-pentagon-leakers-new-york-times-briefing-china-war/",
    "timestamp": "2025-03-21T08:42:37Z"
  },
  {
    "title": "US senator and Trump supporter Steve Daines is visiting Beijing as tariff fight grows",
    "description": "U.S. Sen. Steve Daines visits Beijing amidst escalating U.S.-China tensions over trade and fentanyl. He aims to discuss fentanyl production and trade deficits with Chinese officials, aligning with President Trump's agenda. China emphasizes cooperation while o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senator-and-trump-supporter-steve-daines-is-visiting-beijing-as-tariff-fight-grows/articleshow/119294478.cms",
    "timestamp": "2025-03-21T08:32:57Z"
  },
  {
    "title": "Looming US tariffs could be bad news for India’s Big-Five: Ambani, Adani, Tata, Birla and Mittal",
    "description": "With Trump’s tariff deadline staring at India, it has tough choices to make. So far, import duties have protected big groups from international competition. But satisfying Trump may mean it’s politically easier to expose billionaires to foreign rivalry than f…",
    "link": "https://www.livemint.com/opinion/online-views/us-tariffs-deadline-india-big-five-ambani-adani-tata-birla-mittal-donald-trump-narendra-modi-billionaires-farmers-export-11742531780846.html",
    "timestamp": "2025-03-21T08:30:02Z"
  },
  {
    "title": "With a federal election looming, N.L.'s political landscape is in for a serious shakeup",
    "description": "With five Liberal MPs deciding not to seek re-election, the political landscape in Newfoundland and Labrador is guaranteed to undergo a serious shakeup, regardless of how voters lean in the upcoming federal election.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/election-federal-carney-1.7485813",
    "timestamp": "2025-03-21T08:30:00Z"
  },
  {
    "title": "Financial Times: «Έξοδος» ΗΠΑ από το NATO(;) - Τί προτείνει το βρετανικό Chatham House",
    "description": "Αποκάλυψη των Finantial Times: Οι ευρωπαϊκές στρατιωτικές δυνάμεις επεξεργάζονται σχέδιο 5-10 ετών για να αντικαταστήσουν την ΟυάσιγκτονΟι μεγαλύτερες στρατιωτικές δυνάμεις της Ευρώπης καταρτίζουν σχέδια για να αναλάβουν μεγαλύτερες ευθύνες από τις ΗΠΑ για τη…",
    "link": "https://i-epikaira.blogspot.com/2025/03/financial-times-nato.html",
    "timestamp": "2025-03-21T08:24:00Z"
  },
  {
    "title": "Is Trump's interest in Greenland driving unprecedented tourist influx?",
    "description": "Greenland is witnessing a surge in tourism, driven by US President Donald Trump's interest and the opening of a new international airport in Nuuk. Increased bookings and upcoming direct flights from the US signal significant growth. Greenland seeks to diversi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-trumps-interest-in-greenland-driving-unprecedented-tourist-influx/articleshow/119294034.cms",
    "timestamp": "2025-03-21T08:22:35Z"
  },
  {
    "title": "$TRUMP Meme Coin crashes 85%! Peter Schiff warns more Americans will lose money in crypto than ever before",
    "description": "$TRUMP meme coin's value plummeted 85%, sparking worries about speculative investments in crypto. Peter Schiff warned that Trump's influence could cause more Americans to lose money in digital assets. Schiff criticized the Strategic Bitcoin Reserve and linked…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/trump-meme-coin-crashes-85-peter-schiff-warns-more-americans-will-lose-money-in-crypto-than-ever-before/articleshow/119293506.cms",
    "timestamp": "2025-03-21T08:13:44Z"
  },
  {
    "title": "Putin's Creaky War Machine Gets Lifeline From Trump-Led Thaw",
    "description": "U.S. President Donald Trump's pursuit of a better relationship with Moscow must not include easing sanctions on Russia that impact Vladimir Putin's ability to wage war, a Ukrainian think tank has told Newsweek.\nAfter a phone call with Trump on Tuesday, Russia…",
    "link": "https://biztoc.com/x/08fbbbddef1616c5",
    "timestamp": "2025-03-21T08:06:05Z"
  },
  {
    "title": "Canadian startups focus on homegrown funding with U.S. relations strained",
    "description": "Tatiana Estevez was celebrating her fog water collection company Permalution securing money in a fundraising round and garnering support for a drinking water project, when it was all placed in jeopardy. Because American president Donald Trump froze the U.S. A…",
    "link": "https://financialpost.com/pmn/canadian-startups-focus-on-homegrown-funding-with-u-s-relations-strained",
    "timestamp": "2025-03-21T08:01:40Z"
  },
  {
    "title": "Canadian politician claims Trump admin's '51st state' rhetoric is an 'act of war'",
    "description": "A liberal Canadian member of Parliament said the Trump administration's tariffs and \"51st state\" rhetoric is an \"act of war.\"",
    "link": "https://www.foxnews.com/politics/canadian-politician-claims-trump-admins-51st-state-rhetoric-act-war",
    "timestamp": "2025-03-21T08:00:48Z"
  },
  {
    "title": "Illiterate high school graduates suing school districts as Ivy League professor warns of 'deeper problem'",
    "description": "Two high school graduates from Tennessee and Connecticut are suing their respective public school systems because they still can't read or write after graduating.",
    "link": "https://www.foxnews.com/us/illiterate-high-school-graduates-suing-school-districts-ivy-league-professor-warns-deeper-problem",
    "timestamp": "2025-03-21T08:00:38Z"
  },
  {
    "title": "Ex-Haiti envoy slams 'deeply flawed' approach of Biden admin",
    "description": "Daniel Foote, a former special envoy to Haiti, hits the Biden administration's failed policies over the gang-infested Caribbean island. Foote resigned in protest in 2021.",
    "link": "https://www.foxnews.com/world/ex-haiti-envoy-deeply-flawed-approach-biden-admin",
    "timestamp": "2025-03-21T08:00:17Z"
  },
  {
    "title": "Today in History: March 21, civil rights activists begin march from Selma to Montgomery",
    "description": "Civil rights demonstrators led by the Rev. Martin Luther King Jr. began their third attempt to march from Selma to Montgomery, Alabama — this time under the escort of U.S. Army and National Guard troops assigned by President Lyndon B. Johnson.",
    "link": "https://www.bostonherald.com/2025/03/21/today-in-history-march-21-civil-rights-activists-begin-march-from-selma-to-montgomery/",
    "timestamp": "2025-03-21T08:00:05Z"
  },
  {
    "title": "Today in History: March 21, civil rights activists begin march from Selma to Montgomery",
    "description": "Civil rights demonstrators led by the Rev. Martin Luther King Jr. began their third attempt to march from Selma to Montgomery, Alabama — this time under the escort of U.S. Army and National Guard troops assigned by President Lyndon B. Johnson.",
    "link": "https://www.denverpost.com/2025/03/21/today-in-history-march-21-civil-rights-activists-begin-march-from-selma-to-montgomery/",
    "timestamp": "2025-03-21T08:00:05Z"
  },
  {
    "title": "Putin's Creaky War Machine Gets Lifeline From Trump-Led Thaw",
    "description": "A Kyiv School of Economics study shows much of Putin's high military spending was squandered due to corruption and inefficiencies.",
    "link": "https://www.newsweek.com/russia-war-putin-sanctions-2047151",
    "timestamp": "2025-03-21T08:00:02Z"
  },
  {
    "title": "New Brunswick premier calls for 'free trade area' within Atlantic region",
    "description": "The premier of New Brunswick is calling on the other three East Coast premiers to join her in making Atlantic Canada a \"free trade area\" with a single market operating with one set of rules governing trade and labour mobility.",
    "link": "https://www.cbc.ca/news/politics/free-trade-atlantic-1.7489217",
    "timestamp": "2025-03-21T08:00:00Z"
  },
  {
    "title": "Texas’s GOP Governor Can Arbitrarily Deny Democrats a Seat in Congress Until Next Year",
    "description": "Texas’s heavily Democratic 18th Congressional District has an empty seat. State law gives Greg Abbott the power to delay the election to fill it.\nThe post Texas’s GOP Governor Can Arbitrarily Deny Democrats a Seat in Congress Until Next Year appeared first on…",
    "link": "https://theintercept.com/2025/03/21/texas-greg-abbott-house-democrats-special-election/",
    "timestamp": "2025-03-21T08:00:00Z"
  },
  {
    "title": "PM Carney meeting with premiers today before expected Sunday election call",
    "description": "Prime Minister Mark Carney is hosting a meeting with Canada's premiers at the Canadian War Museum in Ottawa on Friday.",
    "link": "https://www.cbc.ca/news/politics/carney-premiers-meeting-1.7489368",
    "timestamp": "2025-03-21T08:00:00Z"
  },
  {
    "title": "What Trump's push to shut U.S. Dept. of Education means for students and schools",
    "description": "U.S. President Donald Trump is aiming to eliminate an entire federal government department focused on education, to the cheers of conservatives in his Make America Great Again movement.",
    "link": "https://www.cbc.ca/news/world/donald-trump-department-education-explainer-1.7488670",
    "timestamp": "2025-03-21T08:00:00Z"
  },
  {
    "title": "What's in Germany's giant spending package?",
    "description": "Germany's giant spending 'bazooka' to beef up its military and modernise its infrastructure faces a final hurdle Friday when the upper house must sign off on the cash splurge.",
    "link": "https://www.thelocal.de/20250321/whats-in-germanys-giant-spending-package",
    "timestamp": "2025-03-21T07:56:09Z"
  },
  {
    "title": "US sanctions Houthi-linked China oil refinery",
    "description": "The United States has imposed sanctions on a China-based refinery for purchasing $500 million worth of Iranian oil. The oil was reportedly transported by Iran's shadow fleet. This move is part of President Trump's maximum pressure campaign against Iran. China…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-sanctions-houthi-linked-china-oil-refinery/articleshow/119292908.cms",
    "timestamp": "2025-03-21T07:55:21Z"
  },
  {
    "title": "Who Is US Education Secretary Linda McMahon And Why Her Job Is At Risk",
    "description": "Education Secretary Linda McMahon has been tasked with the final mission of overseeing her department&#039;s dissolution.",
    "link": "https://www.ndtv.com/world-news/who-is-us-education-secretary-linda-mcmahon-and-why-her-job-is-at-risk-7974889",
    "timestamp": "2025-03-21T07:55:19Z"
  },
  {
    "title": "Donald Trump Issues Jail Warning to Tesla Vandals",
    "description": "President Donald Trump has warned that those found vandalizing Tesla vehicles could face lengthy jail sentences.\n\"People that get caught sabotaging Teslas will stand a very good chance of going to jail for up to twenty years, and that includes the funders,\" T…",
    "link": "https://biztoc.com/x/2ec2986bd92f21c8",
    "timestamp": "2025-03-21T07:54:27Z"
  },
  {
    "title": "Trump uses wartime powers to boost mineral production - BBC.com",
    "description": "Trump uses wartime powers to boost mineral productionBBC.com Trump invokes wartime powers to increase production of critical mineralsCNN Immediate Measures to Increase American Mineral ProductionThe White House Trump signs minerals order, confirms Ukraine dea…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176782653",
    "timestamp": "2025-03-21T07:52:56Z"
  },
  {
    "title": "Europe working on plan to replace US in NATO in five to 10 years: Report",
    "description": "NATO members seek to avoid possible chaos should the US declare its withdrawal from the transatlantic military bloc.",
    "link": "https://www.aljazeera.com/news/2025/3/21/europe-working-on-plan-to-replace-us-in-nato-in-five-to-10-years-report",
    "timestamp": "2025-03-21T07:51:50Z"
  },
  {
    "title": "Donald Trump Issues Jail Warning to Tesla Vandals",
    "description": "President Donald Trump has warned that those found vandalizing Tesla vehicles could face lengthy jail sentences of up to 20 years.",
    "link": "https://www.newsweek.com/donald-trump-issues-jail-warning-tesla-vandals-elon-musk-2048359",
    "timestamp": "2025-03-21T07:51:25Z"
  },
  {
    "title": "The 8 at 8: Friday",
    "description": "Heathrow closed all day, another housing report forecasts missed targets, and Israel sacks internal security chief",
    "link": "https://www.thejournal.ie/morning-news-friday-march-6655541-Mar2025/",
    "timestamp": "2025-03-21T07:51:17Z"
  }
]