[
  {
    "title": "Justice Department asks court to unseal Epstein grand jury records",
    "description": "President Donald Trump has filed a lawsuit against The Wall Street Journal and media mogul Rupert Murdoch, a day after the newspaper published a story reporting on his ties to wealthy financier Jeffrey Epstein",
    "link": "https://www.wftv.com/news/politics/trump-sues-wall/25IPDZVNRNGM3MLVA7GENI5R2A/",
    "timestamp": "2025-07-18T21:53:49Z"
  },
  {
    "title": "Trump says newly signed crypto law will establish ‘American dominance’",
    "description": "White House features crypto industry leaders investigated by the government, as critics highlight Trump's crypto ties.",
    "link": "https://www.aljazeera.com/economy/2025/7/18/trump-says-newly-signed-crypto-law-will-establish-american-dominance",
    "timestamp": "2025-07-18T21:52:55Z"
  },
  {
    "title": "FBI was ordered to flag any mention of Trump in Epstein files, top Democrat says",
    "description": "The Wall Street Journal reported that Trump sent a raunchy 50th birthday card to Epstein that included a sketch of a naked woman, featuring breasts and a squiggly “Donald” signature mimicking pubic hair.Trump has threatened to sue the Journal and its owner, R…",
    "link": "https://freerepublic.com/focus/f-news/4329461/posts",
    "timestamp": "2025-07-18T21:52:06Z"
  },
  {
    "title": "DOJ asks court to unseal Epstein grand jury records",
    "description": "The Justice Department has asked a federal court to unseal grand jury transcripts in Jeffrey Epstein’s case amid a firestorm over the Trump administration’s handling of records related to the wealthy financier.",
    "link": "https://www.wcvb.com/article/epstein-grand-jury-transcripts-trump-doj/65451623",
    "timestamp": "2025-07-18T21:51:36Z"
  },
  {
    "title": "Donald Trump sues Rupert Murdoch and News Corp for libel in US court",
    "description": "Lawsuit follows Wall Street Journal story alleging Trump sent suggestive birthday letter to Jeffrey Epstein",
    "link": "https://www.irishtimes.com/world/us/2025/07/18/donald-trump-sues-rupert-murdoch-and-news-corp-for-libel-in-us-court/",
    "timestamp": "2025-07-18T21:50:05Z"
  },
  {
    "title": "Chris Cuomo Sides with Trump Over Wall Street Journal's 'Hack Job' Epstein Report",
    "description": "NewsNation's Chris Cuomo sided with President Donald Trump after The Wall Street Journal ran a story about a Jeffrey Epstein letter.",
    "link": "https://www.westernjournal.com/chris-cuomo-sides-trump-wall-street-journals-hack-job-epstein-report/",
    "timestamp": "2025-07-18T21:47:36Z"
  },
  {
    "title": "Rajnath, Shah & others meet to finalise Parliament strategy",
    "description": "Ahead of the Monsoon session, Union ministers strategized on key issues like Bihar's electoral rolls, the Pahalgam attack, and Operation Sindoor, amidst opposition pressure. Congress demands parliamentary discussion on the Pahalgam terror attack and seeks cla…",
    "link": "https://timesofindia.indiatimes.com/india/rajnath-shah-others-meet-to-finalise-parliament-strategy/articleshow/122772694.cms",
    "timestamp": "2025-07-18T21:46:11Z"
  },
  {
    "title": "Conn. residents could be at risk of losing health coverage without knowing it",
    "description": "President Trump's so-called \"One Big Beautiful Bill\" could remove health insurance for over a hundred thousand Connecticut residents.",
    "link": "https://www.nbcconnecticut.com/news/local/trump-big-beautiful-bill-could-strip-100000-connecticut-medicaid-coverage/3610549/",
    "timestamp": "2025-07-18T21:44:30Z"
  },
  {
    "title": "Trump's New Attack On Colleges Quietly Slid Under The Radar — And Many Are In For An Unpleasant Surprise",
    "description": "Trump is waging a public war against elite universities. But he’s also begun a more subtle one that will hurt some students' chance to attend at all.",
    "link": "https://www.huffpost.com/entry/trump-big-bill-student-loans_n_687a9e24e4b06b3f48ab0f1e",
    "timestamp": "2025-07-18T21:43:40Z"
  },
  {
    "title": "Trump Sues the Wall Street Journal",
    "description": "“President Donald Trump is filing a libel lawsuit against the publisher of the Wall Street Journal and reporters who wrote a story about a collection of letters gifted to Jeffrey Epstein for his 50th birthday",
    "link": "https://politicalwire.com/2025/07/18/trump-sues-the-wall-street-journal/",
    "timestamp": "2025-07-18T21:43:13Z"
  },
  {
    "title": "Trump sues Rupert Murdoch",
    "description": "US President Donald Trump has filed a libel lawsuit against billionaire Rupert Murdoch and his media empire over Epstein letter report Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621670-trump-sues-murdoch-epstein/",
    "timestamp": "2025-07-18T21:43:03Z"
  },
  {
    "title": "Obamacare Health Insurance: US health insurers seek largest jump in Obamacare premiums since 2018, shows report",
    "description": "Insurance companies pointed to the slower market growth and a rise in higher-risk patients enrolled in plans under Affordable Care Act, or Obamacare.",
    "link": "https://economictimes.indiatimes.com/news/international/us/obamacare-health-insurance-us-health-insurers-seek-largest-jump-in-obamacare-premiums-since-2018-shows-report/articleshow/122772682.cms",
    "timestamp": "2025-07-18T21:42:20Z"
  },
  {
    "title": "Fox News Anchor Suggests Barack Obama Committed ‘Seditious Conspiracy’ in 2016",
    "description": "During the 2016 presidential campaign, Trump himself publicly called for Russia to hack the Clinton campaign, which the country later did.\nThe post Fox News Anchor Suggests Barack Obama Committed ‘Seditious Conspiracy’ in 2016 first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/fox-news-anchor-suggests-barack-obama-committed-seditious-conspiracy-in-2016/",
    "timestamp": "2025-07-18T21:40:58Z"
  },
  {
    "title": "Justice Department asks court to unseal Jeffrey Epstein grand jury records",
    "description": "Deputy Attorney General Todd Blanche filed a motion urging the court to release the transcripts.",
    "link": "https://www.bostonherald.com/2025/07/18/epstein-grand-jury-records/",
    "timestamp": "2025-07-18T21:40:06Z"
  },
  {
    "title": "Justice Department asks court to unseal Jeffrey Epstein grand jury records",
    "description": "Deputy Attorney General Todd Blanche filed a motion urging the court to release the transcripts.",
    "link": "https://www.denverpost.com/2025/07/18/epstein-grand-jury-records/",
    "timestamp": "2025-07-18T21:40:06Z"
  },
  {
    "title": "Donald Trump Files Defamation Lawsuit Against WSJ & Friend Rupert Murdoch Over Report About Epstein Birthday Letter",
    "description": "Donald Trump is taking aim at the Wall Street Journal and his friend Rupert Murdoch. The President of the United States just filed a defamation lawsuit against Dow Jones, News Corp, Rupert Murdoch and two Wall Street Journal reporters over a recent report tha…",
    "link": "https://www.justjared.com/2025/07/18/donald-trump-files-defamation-lawsuit-against-wsj-friend-rupert-murdoch-over-report-about-epstein-birthday-letter/",
    "timestamp": "2025-07-18T21:39:13Z"
  },
  {
    "title": "GENIUS' ban on stablecoin yield will drive demand for Ethereum DeFi — Analysts",
    "description": "The lack of yield-bearing options for US-regulated stablecoins under the GENIUS bill will drive investors to search for interest elsewhere, analysts said.",
    "link": "https://cointelegraph.com/news/genius-ban-stablecoin-yield-ethereum-defi-analysts",
    "timestamp": "2025-07-18T21:38:11Z"
  },
  {
    "title": "Trump signs first major crypto bill the GENIUS Act into law",
    "description": "In a landmark victory for the crypto industry, President Donald Trump signed the GENIUS Act into law, establishing a regulatory framework for a type of digital currency known as stablecoins.\nThe GENIUS Act creates rules for entities that issue stablecoins, wh…",
    "link": "https://biztoc.com/x/ae76552475ca97ab",
    "timestamp": "2025-07-18T21:37:34Z"
  },
  {
    "title": "President Donald Trump Signs the GENIUS Act to Make the U.S. the 'Crypto Capital of the World'",
    "description": "President Donald Trump Signs the GENIUS Act to Make the U.S. the 'Crypto Capital of the World' The landmark cryptocurrency legislation was signed into law by President Trump on Friday.\nPresident Donald Trump signed the GENIUS Act (Guiding and Establishing Nat…",
    "link": "https://biztoc.com/x/370dac54f5d079b0",
    "timestamp": "2025-07-18T21:37:12Z"
  },
  {
    "title": "Trump signs law to create regulatory regime for stablecoins, a huge win for crypto backers",
    "description": "U.S. President Donald Trump on Friday signed a law to create a regulatory regime for U.S.-dollar-pegged cryptocurrencies known as stablecoins, a milestone that could pave the way for the digital assets to become an everyday way to make payments and move money.",
    "link": "https://biztoc.com/x/39729b4f68475a41",
    "timestamp": "2025-07-18T21:37:09Z"
  },
  {
    "title": "Trump sues Wall Street Journal, Murdoch over Epstein report",
    "description": "Donald Trump has vowed legal action after the Wall Street Journal reported that he sent a sexually suggestive birthday letter to Jeffrey Epstein in 2003. Epstein, a New York financier, faced sex trafficking charges.",
    "link": "https://www.dw.com/en/trump-sues-wall-street-journal-murdoch-over-epstein-report/a-73332139",
    "timestamp": "2025-07-18T21:37:00Z"
  },
  {
    "title": "Wall Street closes a record-breaking week with a quiet finish",
    "description": "The S&P 500 edged down by a whisper, less than 0.1%, after setting its all-time high the day before. The Dow Jones Industrial Average fell 142 points, or 0.3%, and the Nasdaq composite edged up by less than 0.1%.",
    "link": "https://www.bostonherald.com/2025/07/18/wall-street-closes-a-record-breaking-week-with-a-quiet-finish/",
    "timestamp": "2025-07-18T21:36:58Z"
  },
  {
    "title": "Texas Democrat Tells Joe Rogan His Advice to GOP That Trump 'Tapped Into'",
    "description": "Texas state Representative James Talarico joined The Joe Rogan Experience and urged Republicans to compete for young voters rather than trying to suppress them.",
    "link": "https://www.newsweek.com/texas-democrat-tells-joe-rogan-his-advice-gop-that-trump-tapped-2101025",
    "timestamp": "2025-07-18T21:36:55Z"
  },
  {
    "title": "Circumstantial evidence is actually evidence",
    "description": "Trump poses with Belgian model Ingrid Seynhaeve, with Epstein in the background, at the Victoria’s Secret ‘Angels’ party on April 28, 1997 in New York City [File: Sonia Moskowitz/Getty Images] Following up on the latest episode of the Epstein Affair, this kin…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/circumstantial-evidence-is-actually-evidence",
    "timestamp": "2025-07-18T21:36:53Z"
  },
  {
    "title": "Trump sues Wall Street Journal and Rupert Murdoch for libel",
    "description": "Lawsuit filed in Miami federal court comes after president threatened to sue over Jeffrey Epstein letter report\nDonald Trump filed a lawsuit on Friday against Dow Jones, News Corp, Rupert Murdoch and two Wall Street Journal reporters, raising claims under fed…",
    "link": "https://biztoc.com/x/699cb2c3695238e5",
    "timestamp": "2025-07-18T21:36:51Z"
  },
  {
    "title": "Pam Bondi Asks to Release Epstein Grand Jury Testimony as Trump Under Fire",
    "description": "Bipartisan pressure is mounting over the limited scope of the Justice Department's disclosures regarding Epstein.",
    "link": "https://www.newsweek.com/jeffrey-epstein-files-doj-donald-trump-grand-jury-2101044",
    "timestamp": "2025-07-18T21:36:30Z"
  },
  {
    "title": "Hegseth tells lawmakers about plan to detain immigrants at bases in Indiana and New Jersey",
    "description": "Defense Secretary Pete Hegseth says military bases in Indiana and New Jersey could house detained immigrants without affecting their military operations",
    "link": "https://abcnews.go.com/US/wireStory/hegseth-tells-lawmakers-plan-detain-immigrants-bases-indiana-123877688",
    "timestamp": "2025-07-18T21:34:27Z"
  },
  {
    "title": "Trump signs new stablecoin regulations into law, a major milestone for crypto industry",
    "description": "President Donald Trump has signed the GENIUS Act into law, setting new regulations for stablecoins, a type of cryptocurrency tied to assets like the U.S. dollar",
    "link": "https://abcnews.go.com/Business/wireStory/trump-signs-new-stablecoin-regulations-law-major-milestone-123873615",
    "timestamp": "2025-07-18T21:34:19Z"
  },
  {
    "title": "Trump sues Wall Street Journal's publisher and 2 reporters over Epstein article",
    "description": "The Journal published an article saying Trump sent a letter, with a drawing of a naked woman, to Jeffrey Epstein in 2003 in celebration of the financier's 50th birthday.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-sues-wall-street-journals-publisher-reporters-epstein-article-rcna219703",
    "timestamp": "2025-07-18T21:33:19Z"
  },
  {
    "title": "Trump sues Wall Street Journal and Rupert Murdoch for libel - The Guardian",
    "description": "Trump sues Wall Street Journal and Rupert Murdoch for libelThe Guardian Trump sues Murdoch, Dow Jones over WSJ story on Epstein birthday letter: court recordsCNBC Trump sues Wall Street Journal for libel over Epstein letterAxios Exclusive | Jeffrey Epstein’s …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178413414",
    "timestamp": "2025-07-18T21:33:11Z"
  },
  {
    "title": "Declassified: Obama Admin Manufactured Intelligence to Push Fake Trump-Russia Collusion Narrative",
    "description": "The Obama administration's top officials committed a \"treasonous conspiracy\" by manufacturing and politicizing intelligence to create the false narrative that led to the years-long Trump-Russia collusion probe, according to newly-declassified documents releas…",
    "link": "https://www.breitbart.com/politics/2025/07/18/declassified-obama-admin-manufactured-intelligence-to-push-fake-trump-russia-collusion-narrative/",
    "timestamp": "2025-07-18T21:32:17Z"
  },
  {
    "title": "Trump Sues WSJ Reporters, Murdoch For Libel After Epstein Birthday Card Story",
    "description": "Trump vowed to sue and claimed he had nothing to do with the lewd birthday letter.",
    "link": "https://www.huffpost.com/entry/donald-trump-sues-wsj-jeffrey-epstein-birthday-bombshell_n_687ab92fe4b07ac72abb495c",
    "timestamp": "2025-07-18T21:31:04Z"
  },
  {
    "title": "Trump’s attacks on Powell threaten the Fed’s independence. Here’s why it matters",
    "description": "Such an unprecedented step could send the financial markets into a tailspin.",
    "link": "https://www.bostonherald.com/2025/07/18/federal-reserve-independence/",
    "timestamp": "2025-07-18T21:30:00Z"
  },
  {
    "title": "'Late Show' Union Calls For Investigation Into CBS Decision To Cancel Colbert",
    "description": "The Writers Guild of America said it has \"significant concerns\" that the cancellation is another bribe aimed at Trump.",
    "link": "https://www.huffpost.com/entry/wga-late-show-stephen-colbert-cancelled_n_687a9f6de4b02a75a1fade15",
    "timestamp": "2025-07-18T21:29:27Z"
  },
  {
    "title": "Weekly Roundup: Trump attacks media over Epstein story",
    "description": "We review a busy week in Washington, including President Trump's response to a new report about his relationship with disgraced financier Jeffrey Epstein and calls from the White House for more partisan budgeting. Plus, what is Trump's foreign policy doctrine…",
    "link": "https://www.npr.org/2025/07/18/1255880067/weekly-roundup-trump-attacks-media-over-epstein-story",
    "timestamp": "2025-07-18T21:27:38Z"
  },
  {
    "title": "Trump sues Murdoch for libel over Jeffrey Epstein letter story",
    "description": "Trump had threatened to force Murdoch to \"testify in my lawsuit against him and his 'pile of garbage' newspaper\".",
    "link": "https://www.bbc.com/news/articles/c23g5xpggzmo",
    "timestamp": "2025-07-18T21:27:19Z"
  },
  {
    "title": "Brazil's Bolsonaro ordered to wear ankle monitor ahead of trial",
    "description": "Authorities in Brazil, worried that the former far right president is a flight risk, are imposing new restrictions on his movements. The tough surveillance moves come as President Trump continues to voice strong support for the ex-leader who is facing charges…",
    "link": "https://www.npr.org/2025/07/18/nx-s1-5472336/bolsonaro-trump-lula-coup-trial",
    "timestamp": "2025-07-18T21:27:05Z"
  },
  {
    "title": "Trump signs law to create regulatory regime for stablecoins, a huge win for crypto backers",
    "description": "U.S. President Donald Trump on Friday signed a law to create a regulatory regime for U.S.-dollar-pegged cryptocurrencies known as stablecoins, a milestone that could pave the way for the digital assets to become an everyday way to make payments and move money.",
    "link": "https://www.cbc.ca/news/world/trump-genius-act-signed-1.7588951",
    "timestamp": "2025-07-18T21:27:04Z"
  },
  {
    "title": "Laura Loomer Says Right-Wing 'Grifters' Using Trump-Epstein For Own Benefit",
    "description": "Laura Loomer name-dropped Tucker Carlson as one of the right-wing \"grifters\" who are cashing in on the chaos surrounding Donald Trump and Jeffrey Epstein.",
    "link": "https://biztoc.com/x/fc8be7bbdf914b1b",
    "timestamp": "2025-07-18T21:25:49Z"
  },
  {
    "title": "Following Epstein report, Trump files lawsuit against WSJ, Rupert Murdoch and others",
    "description": "On Thursday night, Donald Trump vowed to sue The Wall Street Journal over a Jeffrey Epstein report. The president apprantly wasn't bluffing.",
    "link": "https://biztoc.com/x/4f19285475a8cf0f",
    "timestamp": "2025-07-18T21:25:46Z"
  },
  {
    "title": "Facing Growing Outrage and Legal Action, Trump Admin Frees Chunk of Withheld Education Funds",
    "description": "Following widespread backlash and threats of legal action, the administration of U.S. President Donald Trump announced Friday that it will free up part of the $6.8 billion worth of education funding the president has withheld from states.Earlier this week, 24…",
    "link": "https://www.commondreams.org/news/trump-releases-frozen-education-funds",
    "timestamp": "2025-07-18T21:25:39Z"
  },
  {
    "title": "Laura Loomer Says Right-Wing 'Grifters' Using Trump-Epstein For Own Benefit",
    "description": "Laura Loomer name-dropped Tucker Carlson as one of the right-wing \"grifters\" who are cashing in on the chaos surrounding Donald Trump and Jeffrey Epstein.",
    "link": "https://www.newsweek.com/laura-loomer-trump-epstein-grifters-tucker-carlson-2101035",
    "timestamp": "2025-07-18T21:25:10Z"
  },
  {
    "title": "3rd Biden witness invokes Fifth Amendment during House deposition",
    "description": "Refuses to answer questions about former president's mental and physical health declines",
    "link": "https://www.wnd.com/2025/07/3rd-biden-witness-invokes-fifth-amendment-during-house/",
    "timestamp": "2025-07-18T21:24:35Z"
  },
  {
    "title": "8 Major Student Loan Changes From Trump’s Budget Bill: Next Steps for Borrowers",
    "description": "President Trump's budget reconciliation bill dramatically impacts student loans. Grad students and parent PLUS borrowers will experience more changes.",
    "link": "https://www.nerdwallet.com/article/loans/student-loans/big-beautiful-bill-student-loans#article",
    "timestamp": "2025-07-18T21:24:31Z"
  },
  {
    "title": "Trump ducks Epstein questions at Genius Act bill signing: ‘They named it after me’",
    "description": "Trump answered no reporter questions as his only scheduled public event of the day ended.",
    "link": "https://nypost.com/2025/07/18/us-news/trump-ducks-epstein-questions-at-genius-act-crypto-bill-signing-they-named-it-after-me/",
    "timestamp": "2025-07-18T21:23:56Z"
  },
  {
    "title": "Donald Trump Sues WSJ, Rupert Murdoch Over Jeffrey Epstein Birthday Letter Story",
    "description": "Donald Trump has sued Dow Jones, News Corp, Rupert Murdoch and two Wall Street Journal reporters, over an article in the paper about the president’s alleged 2003 birthday letter to Jeffrey Epstein that contained suggestive language. Trump claims the paper and…",
    "link": "https://variety.com/2025/biz/news/donald-trump-sues-wsj-rupert-murdoch-jeffrey-epstein-birthday-letter-1236464979/",
    "timestamp": "2025-07-18T21:22:30Z"
  },
  {
    "title": "Susan Collins’ Approval Rating At Record Low After Defying GOP, Trump On Multiple Key Votes",
    "description": "Republican Maine Sen. Susan Collins’ approval rating has fallen following a tense summer session where she repeatedly broke away from her party and President Donald Trump on multiple crucial votes. The results were released by Morning Consult as a part of its…",
    "link": "https://dailycaller.com/2025/07/18/susan-collins-approval-rating-big-beautiful-bill-rescissions-package/",
    "timestamp": "2025-07-18T21:22:27Z"
  },
  {
    "title": "Trump Files Suit Against Murdoch Over WSJ Epstein Story",
    "description": "Trump has filed a lawsuit against Murdoch on Friday WSJ's Epstein story.",
    "link": "https://dailycaller.com/2025/07/18/trump-files-suit-against-murdoch-over-wsj-epstein-story/",
    "timestamp": "2025-07-18T21:20:50Z"
  },
  {
    "title": "Transgender woman sues Princeton for 'humiliating' removal from track meet",
    "description": "A transgender woman has sued Princeton University claiming she was illegally removed shortly before her race in a school-hosted track meet in May due to her gender identity. An attorney for Sadie Schreiner filed the complaint in New Jersey Superior Court on T…",
    "link": "https://sports.yahoo.com/article/transgender-woman-sues-princeton-humiliating-212010510.html",
    "timestamp": "2025-07-18T21:20:10Z"
  },
  {
    "title": "Trump vows to make US 'crypto capital of the planet,' signs GENIUS Act into law (Fox News)",
    "description": "Fox News:\nTrump vows to make US ‘crypto capital of the planet,’ signs GENIUS Act into law  —  President Donald Trump signed into law the Guiding and Establishing National Innovation for U.S. Stablecoins (GENIUS) Act Friday — a landmark piece of legislation th…",
    "link": "https://www.memeorandum.com/250718/p113",
    "timestamp": "2025-07-18T21:20:00Z"
  },
  {
    "title": "The 'Trump effect' could mean an alliance shift that excludes the US",
    "description": "When Canada and Australia experienced similar election results, the impact of the Trump effect became clearer, along with its potential to shift future alliances.",
    "link": "https://www.abc.net.au/news/2025-07-19/canada-and-america-at-crossroads-due-to-trump/105546468",
    "timestamp": "2025-07-18T21:18:54Z"
  },
  {
    "title": "EXCLUSIVE: Joni Ernst Hints At List Of ‘Billion-Dollar Boondoggles’ She Wants To Bring ‘To A Squealing Halt’",
    "description": "Republican Sen. Joni Ernst of Iowa is preparing a list of targets after the Trump administration halted funding for California’s high-speed rail project.",
    "link": "https://dailycaller.com/2025/07/18/exclusive-joni-ernst-hints-billion-dollar-boondoggles-squealing-halt/",
    "timestamp": "2025-07-18T21:18:43Z"
  },
  {
    "title": "Stephen Colbert gets solidarity from fellow late-night hosts after cancellation news",
    "description": "Stephen Colbert was receiving messages of support and affection from his fellow late-night hosts after announcing that CBS was canceling his show, “The Late Show With Stephen Colbert,” next May",
    "link": "https://abcnews.go.com/Entertainment/wireStory/stephen-colbert-gets-solidarity-fellow-late-night-hosts-123870586",
    "timestamp": "2025-07-18T21:18:17Z"
  },
  {
    "title": "This Is How Elite University Presidents Will Cave to President Trump",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post This Is How Elite University Presidents Will Cave to President Trump ap…",
    "link": "https://www.dailysignal.com/2025/07/18/this-is-how-elite-university-presidents-will-cave-to-president-trump/",
    "timestamp": "2025-07-18T21:18:13Z"
  },
  {
    "title": "Trump Sues WSJ as He Continues to Crash Out Over Epstein Story",
    "description": "Donald Trump just made good on his threat to sue The Wall Street Journal for reporting on his lewd birthday note to alleged sex trafficker Jeffrey Epstein. The president filed a lawsuit in Miami court Friday against Dow Jones, News Corp, Rupert Murdoch, and t…",
    "link": "https://newrepublic.com/post/198144/donald-trump-sues-wall-street-journal-epstein",
    "timestamp": "2025-07-18T21:15:59Z"
  },
  {
    "title": "Donald Trump sues Dow Jones, News Corp, Rupert Murdoch, WSJ reporters for libel, court records show (Jonathan Stempel/Reuters)",
    "description": "Jonathan Stempel / Reuters:\nDonald Trump sues Dow Jones, News Corp, Rupert Murdoch, WSJ reporters for libel, court records show  —  U.S. President Donald Trump filed a lawsuit on Friday against Dow Jones, News Corp (NWSA.O), Rupert Murdoch and two Wall Street…",
    "link": "https://www.memeorandum.com/250718/p112",
    "timestamp": "2025-07-18T21:15:01Z"
  },
  {
    "title": "Trump files libel suit against Murdoch, WSJ reporters",
    "description": "United States President Donald Trump filed a libel lawsuit against Dow Jones, News Corp, Rupert Murdoch, as well as two Wall Street Journal reporters, according to court records.The lawsuit comes afte...",
    "link": "https://biztoc.com/x/82aa87280a2dd071",
    "timestamp": "2025-07-18T21:14:39Z"
  },
  {
    "title": "Trump sues Murdoch, Dow Jones over Wall Street Journal story on Epstein birthday letter: court records",
    "description": "President Donald Trump on Friday followed through on his threat to sue media mogul Rupert Murdoch after his Wall Street Journal published an article saying that Trump sent Jeffrey Epstein a \"bawdy\" letter for Epstein's 50th birthday, courts records show.\nCour…",
    "link": "https://biztoc.com/x/43c31c0bd8e1e8b1",
    "timestamp": "2025-07-18T21:14:36Z"
  },
  {
    "title": "Trump files lawsuit over Wall Street Journal report on Jeffrey Epstein’s birthday letters | CNN Politics",
    "description": "President Donald Trump is filing a libel lawsuit against the publisher of the Wall Street Journal and reporters who wrote a story about a collection of letters gifted to Jeffrey Epstein for his 50th birthday in 2003, including a note bearing Trump’s name and …",
    "link": "https://www.cnn.com/2025/07/18/politics/trump-wall-street-journal-jeffrey-epstein",
    "timestamp": "2025-07-18T21:14:18Z"
  },
  {
    "title": "Judge halts non-binary person's deportation to the U.S. as Trump dismantles trans rights",
    "description": "A Federal Court judge halted a non-binary American's deportation from Canada pending review. Advocates say the ruling sets \"an important precedent\" for 2SLGBTQ+ immigrants and refugees coming to Canada from, or through, the U.S.",
    "link": "https://www.cbc.ca/radio/asithappens/non-binary-deportation-ruling-1.7588820",
    "timestamp": "2025-07-18T21:14:01Z"
  },
  {
    "title": "A Congress That Votes Yes and Hopes No",
    "description": "Congressional Republicans keep wringing their hands over the White House’s legislative priorities … and then voting for them.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/congress-vote-trump-administration/683605/",
    "timestamp": "2025-07-18T21:14:00Z"
  },
  {
    "title": "Trump follows through on threat to sue Rupert Murdoch and WSJ",
    "description": "President Donald Trump has officially filed a libel lawsuit against News Corp, Dow Jones, Rupert Murdoch, the Wall Street Journal, and two reporters at the Journal, Reuters reported Friday afternoon.The news comes after the Journal reported Thursday night tha…",
    "link": "https://www.rawstory.com/trump-rupert-murdoch/",
    "timestamp": "2025-07-18T21:13:17Z"
  },
  {
    "title": "Congress passed Trump's spending cuts. What does that mean for their power of the purse?",
    "description": "A drama-filled week in DC saw Democrats accuse Republicans ceding Congress' power to Trump and a curveball involving Jeffrey Epstein.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/18/congress-trump-spending-cuts-takeaways/85272562007/",
    "timestamp": "2025-07-18T21:12:32Z"
  },
  {
    "title": "Trump Sues Wall Street Journal for Libel Over Epstein Letter Story",
    "description": "The president says he is looking forward to making Rupert Murdoch testify in court \nThe post Trump Sues Wall Street Journal for Libel Over Epstein Letter Story appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-sues-wall-street-journal-libel-epstein-story/",
    "timestamp": "2025-07-18T21:12:22Z"
  },
  {
    "title": "Following Epstein report, Trump files lawsuit against WSJ, Rupert Murdoch and others",
    "description": "On Thursday night, Donald Trump vowed to sue The Wall Street Journal over a Jeffrey Epstein report. The president apprantly wasn't bluffing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-sues-wsj-murdoch-epstein-birthday-letter-rcna219701",
    "timestamp": "2025-07-18T21:11:51Z"
  },
  {
    "title": "Trump's attacks on Powell threaten the Fed's independence. Here's why it matters",
    "description": "President Donald Trump has opened up a new front in his attack on the Federal Reserve and its chair, Jerome Powell: He says the alledged mismanagement of a building renovation project could be grounds for firing Powell",
    "link": "https://abcnews.go.com/US/wireStory/trumps-attacks-powell-threaten-feds-independence-matters-123876570",
    "timestamp": "2025-07-18T21:10:16Z"
  },
  {
    "title": "A federal judge dismisses Trump's ~$50M 2023 lawsuit against Bob Woodward for publishing tapes from interviews for his 2020 book Rage as an audiobook (Jonathan Stempel/Reuters)",
    "description": "Jonathan Stempel / Reuters:\nA federal judge dismisses Trump's ~$50M 2023 lawsuit against Bob Woodward for publishing tapes from interviews for his 2020 book Rage as an audiobook  —  Donald Trump cannot pursue his nearly $50 million lawsuit against the journal…",
    "link": "https://mediagazer.com/250718/p14",
    "timestamp": "2025-07-18T21:10:01Z"
  },
  {
    "title": "Paramount bidder Skydance plays patriotism card in push for deal OK",
    "description": "Skydance CEO David Ellison told the FCC he wants “American storytelling” at Paramount while touting a new, “unbiased” editorial direction for CBS News.",
    "link": "https://www.nbcnews.com/business/media/david-ellison-fcc-chairman-paramount-deal-cbs-rcna219687",
    "timestamp": "2025-07-18T21:09:28Z"
  },
  {
    "title": "Venezuela frees 10 Americans in swap for deported migrants in El Salvador",
    "description": "President Donald Trump had deported nearly 200 Venezuelan men to an El Salvador prison, raising fears for their safety.",
    "link": "https://www.aljazeera.com/news/2025/7/18/venezuela-frees-10-americans-in-swap-for-deported-migrants-in-el-salvador",
    "timestamp": "2025-07-18T21:08:52Z"
  },
  {
    "title": "10 Americans are freed from Venezuela in a prisoner swap for migrants in El Salvador - NewsBreak",
    "description": "BOGOTÁ, Colombia — Venezuela has freed 10 Americans in exchange for Venezuelans whom the United States had sent to a prison in El Salvador, the U.S. and Sa",
    "link": "https://www.newsbreak.com/share/4117302137892-venezuela-frees-10-americans-as-part-of-a-prisoner-exchange-for-venezuelan-detainees?s=a2&amp;share_destination_id=MjMyMTkwMDI3LTE3NTI4NzI4NzQwNDQ%3D&amp;pd=0FiFERcW&amp;hl=en_US&amp;send_time=1752872874&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.28.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v5%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-control",
    "timestamp": "2025-07-18T21:08:17Z"
  },
  {
    "title": "Colbert Fallout: Meyers, Fallon Respond; WGA Calls For Investigation",
    "description": "Less than 24 hours after the news hit that CBS would be ending The Late Show with Stephen Colbert in May 2026, the rumblings over the move and what it could mean on a number of levels are still a hot topic for discussions and debate. Previously, Jimmy Kimmel …",
    "link": "https://bleedingcool.com/tv/colbert-fallout-meyers-fallon-respond-wga-calls-for-investigation/",
    "timestamp": "2025-07-18T21:08:04Z"
  },
  {
    "title": "Pulitzer Prize-Winning WaPo Reporting Was Based Off ‘Blatantly False’ Intel, ODNI Report Says",
    "description": "Early Washington Post reporting alleging a plot by Vladimir Putin to install President Donald Trump in the 2016 election used \"blatantly false\" intelligence, a memo says.",
    "link": "https://dailycaller.com/2025/07/18/wapo-reporting-russian-interference-2026-based-off-blatantly-false-intel-odni-report/",
    "timestamp": "2025-07-18T21:06:34Z"
  },
  {
    "title": "Stephen Colbert’s Cancellation Is Exactly What You Think It Is",
    "description": "Paramount says it’s a business decision. There’s truthiness to that.",
    "link": "https://slate.com/technology/2025/07/stephen-colbert-late-show-canceled-paramount-skydance-merger-explained.html",
    "timestamp": "2025-07-18T21:06:34Z"
  },
  {
    "title": "Venezuela frees 10 Americans as part of a prisoner exchange for Venezuelan detainees - NewsBreak",
    "description": "Audio will be available later today. BOGOTÁ, Colombia — Venezuela has freed 10 Americans as part of a larger prisoner exchange for Venezuelan detainees rel",
    "link": "https://www.newsbreak.com/share/4117302137892-venezuela-frees-10-americans-as-part-of-a-prisoner-exchange-for-venezuelan-detainees?s=a2&amp;share_destination_id=MjIzNTc5MDctMTc1Mjg3Mjc0OTA4Nw%3D%3D&amp;pd=01VoJP8O&amp;hl=en_US&amp;send_time=1752872749&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.28.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_recall_exp_25q3-v6%2Cns_foryou_rank_exp_25q2-v2%2Cns_foryou_model_exp_25q2_v2-v5",
    "timestamp": "2025-07-18T21:06:30Z"
  },
  {
    "title": "How Melania Trump maintains her figure: Diet and workout routine revealed - NewsBreak",
    "description": "How Melania Trump maintains her figure: Diet and workout routine revealed - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4117192240909-how-melania-trump-maintains-her-figure-diet-and-workout-routine-revealed?_f=app_share&amp;pd=0ACnzguF&amp;lang=en_US&amp;send_time=1752872719&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.14.1.4%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v2%2Cns_foryou_recall_exp_25q3-v2%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v9&amp;s=i2",
    "timestamp": "2025-07-18T21:05:49Z"
  },
  {
    "title": "Jon Stewart Addresses Possible 'Daily Show' Cancellation",
    "description": "Jon Stewart Addresses Possible 'Daily Show' Cancellationhuffpost.com",
    "link": "https://www.huffpost.com/entry/jon-stewart-addresses-possible-daily-show-cancellation_n_687a9c40e4b02a75a1fada14",
    "timestamp": "2025-07-18T21:04:58Z"
  },
  {
    "title": "Trump sues Murdoch, Dow Jones over Wall Street Journal story on Epstein birthday letter",
    "description": "President Trump is under increasing pressure to have the Justice Department release files about the late pedophile Jeffrey Epstein.",
    "link": "https://www.cnbc.com/2025/07/18/trump-sues-epstein-murdoch-wsj.html",
    "timestamp": "2025-07-18T21:04:06Z"
  },
  {
    "title": "Trump Keeps the Epstein Story Alive",
    "description": "No matter what pundits are saying, one thing is clear: Donald Trump believes the Wall Street Journal’s bombshell story from last night is a serious problem. He could have ignored it. But he was so",
    "link": "https://politicalwire.com/2025/07/18/trump-keeps-the-epstein-story-alive/",
    "timestamp": "2025-07-18T21:03:57Z"
  },
  {
    "title": "Can Trump Fire Fed Chairman Powell? Yes, He Can — And Should",
    "description": "Will President Donald Trump soon fire Federal Reserve Chairman Jerome Powell, as is now hotly rumored? And do you care? If not, maybe you should. Because at this moment, the Fed chief seems to think he has to re-fight the inflation battle he lost three years …",
    "link": "https://biztoc.com/x/ce3d67bf5db8dcc3",
    "timestamp": "2025-07-18T21:03:29Z"
  },
  {
    "title": "Coca-Cola may swap out high-fructose corn syrup with cane sugar, Trump says. Is that healthier?",
    "description": "President Donald Trump announced this week that the Coca-Cola Company has agreed to his requests for the brand to use “REAL” cane sugar in its US products instead of high-fructose corn syrup.\nThe company hasn’t confirmed the swap, but high-fructose corn syrup…",
    "link": "https://biztoc.com/x/f41c6cb928714903",
    "timestamp": "2025-07-18T21:03:28Z"
  },
  {
    "title": "Trump Signs Stablecoin Bill in Win for Crypto Industry",
    "description": "President Donald Trump signed the first federal bill to regulate stablecoins, hailing it as a “giant step to cement American dominance of global finance and crypto technology” and delivering a major victory for the digital asset industry.\n“The Genius Act crea…",
    "link": "https://biztoc.com/x/c67c7808d7d91375",
    "timestamp": "2025-07-18T21:03:19Z"
  },
  {
    "title": "Trump files a libel lawsuit against Rupert Murdoch, Dow Jones, and WSJ reporters who wrote an article saying that Trump sent Jeffrey Epstein a \"bawdy\" letter (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump files a libel lawsuit against Rupert Murdoch, Dow Jones, and WSJ reporters who wrote an article saying that Trump sent Jeffrey Epstein a “bawdy” letter  —  President Donald Trump on Friday followed through on his threat to sue media m…",
    "link": "https://mediagazer.com/250718/p13",
    "timestamp": "2025-07-18T21:02:32Z"
  },
  {
    "title": "A Scandal Sticks to Trump",
    "description": "I discussed Donald Trump’s very bad week with the great Julie Mason this afternoon. Give it a listen.",
    "link": "https://politicalwire.com/2025/07/18/a-scandal-sticks-to-trump/",
    "timestamp": "2025-07-18T21:01:20Z"
  },
  {
    "title": "Coca-Cola Reportedly Agreed to Make US Sodas with Real Cane Sugar",
    "description": "Trump announced the potential switch on social media, and it looks like high fructose corn syrup may be the next target of MAHA success.\nThe post Coca-Cola Reportedly Agreed to Make US Sodas with Real Cane Sugar first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/coca-cola-reportedly-agreed-to-make-us-sodas-with-real-cane-sugar/",
    "timestamp": "2025-07-18T21:00:33Z"
  },
  {
    "title": "Trump Sues Wall Street Journal For Defamation Over Epstein Report",
    "description": "The lawsuit sets the stage for another legal showdown initiated by Trump against the media, this time against his close ally Rupert Murdoch.",
    "link": "http://www.hollywoodreporter.com/business/business-news/trump-files-defamation-lawsuit-wall-street-journal-epstein-report-1236319238/",
    "timestamp": "2025-07-18T21:00:21Z"
  },
  {
    "title": "Taiwan will ‘not provoke confrontation’ with China, Vice President Hsiao says",
    "description": "China claims self-ruled Taiwan as its own territory and has repeatedly threatened to annex it, by force if necessary. In recent years, Beijing has ramped up its military intimidation of the island, sending jets and ships nearby almost daily.",
    "link": "https://www.pbs.org/newshour/world/taiwan-will-not-provoke-confrontation-with-china-vice-president-hsiao-says",
    "timestamp": "2025-07-18T21:00:12Z"
  },
  {
    "title": "Trump Team Sabotaged Fed Renovation as Trump Started War With Powell",
    "description": "Trump is purposely using a construction project that his own appointees are making more expensive as grounds to pick a fight and potentially fire his nemesis, Federal Reserve Chair Jerome Powell.The Fed building, opened in 1937, began undergoing plans for ren…",
    "link": "https://newrepublic.com/post/198141/trump-team-federal-reserve-renovation-jerome-powell",
    "timestamp": "2025-07-18T21:00:01Z"
  },
  {
    "title": "'Teflon wearing thin': Analyst warns 'bombast and cruelty' puts presidency in peril",
    "description": "President Donald Trump isn't deporting undocumented migrants in the mass quantities he'd like Americans to believe, according to an opinion piece by Fareed Zakaria in The Washington Post.Despite the administration's directive that ICE meet the lofty quota of …",
    "link": "https://www.rawstory.com/trump-ice-2673370808/",
    "timestamp": "2025-07-18T20:59:02Z"
  },
  {
    "title": "Hooray! Taxpayers will no longer have to pick up the tab for NPR, PBS’s lefty propaganda",
    "description": "Congress is finally defunding public broadcasting, and it's about time.",
    "link": "https://nypost.com/2025/07/18/opinion/hooray-taxpayers-will-no-longer-have-to-pay-for-npr-pbss-lefty-propaganda/",
    "timestamp": "2025-07-18T20:57:26Z"
  }
]