[
  {
    "title": "Trump set to go ahead with tariffs announcement on Wednesday",
    "description": "US president’s spokeswoman says levies could be implemented immediately",
    "link": "https://www.irishtimes.com/business/2025/04/01/trump-set-to-go-ahead-with-tariffs-announcement-on-wednesday/",
    "timestamp": "2025-04-01T17:57:58Z"
  },
  {
    "title": "Andreessen Horowitz in talks to help buy out TikTok's Chinese owners",
    "description": "Andreessen Horowitz is negotiating to invest in TikTok as part of a U.S. effort, led by President Trump, to take control of the app from its Chinese owners. Co-founder Marc Andreessen is working with Oracle and other U.S. investors to buy out ByteDance’s stak…",
    "link": "https://economictimes.indiatimes.com/news/international/business/andreessen-horowitz-in-talks-to-help-buy-out-tiktoks-chinese-owners/articleshow/119879077.cms",
    "timestamp": "2025-04-01T17:57:38Z"
  },
  {
    "title": "Trump nominee says to press UK on Israel arms",
    "description": "Donald Trump’s nominee to be ambassador to London said Tuesday he would ask Britain to reverse a partial suspension of arms exports to Israel, a decision taken over rights concerns. Warren Stephens, an Arkansas-based investment banker and political donor to T…",
    "link": "https://www.digitaljournal.com/world/trump-nominee-says-to-press-uk-on-israel-arms/article",
    "timestamp": "2025-04-01T17:57:20Z"
  },
  {
    "title": "Is Cory Booker’s ‘Filibuster’ Doing Anything to Stop Trump?",
    "description": "Is Cory Booker’s marathon ‘filibuster’ speech actually ‘doing something’ to fight Trump? Since Senate Democrats have lost any real leverage over Trump’s agenda, deploring it in words may be the only path ahead for now.",
    "link": "http://nymag.com/intelligencer/article/cory-booker-filibuster-speech-trump.html",
    "timestamp": "2025-04-01T17:56:07Z"
  },
  {
    "title": "Trump’s “Liberation Day” Tariffs Are as Extreme as It Gets",
    "description": "Donald Trump’s planned “Liberation Day” Wednesday will bring outrageous tariffs of 20 percent on most goods imported to the U.S., according to officials who spoke with The Washington Post. \r\nTrump announced Sunday that the U.S. will institute reciprocal tarif…",
    "link": "https://newrepublic.com/post/193440/trump-liberation-day-tariffs-draft-plan",
    "timestamp": "2025-04-01T17:55:17Z"
  },
  {
    "title": "US senator delivering marathon speech for over 17 hours to protest Trump policies",
    "description": "New Jersey Democratic Senator Cory Booker took to the Senate floor yesterday evening and has been speaking for hours on end.",
    "link": "https://www.thejournal.ie/us-senator-delivering-marathon-speech-for-over-17-hours-to-protest-trump-policies-6665169-Apr2025/",
    "timestamp": "2025-04-01T17:54:14Z"
  },
  {
    "title": "Trump could serve a third term. Here's how",
    "description": "Donald Trump could potentially return to the presidency after 2028 despite the 22nd Amendment, which limits election to two terms. Legal loopholes include becoming vice president and ascending after resignation, or being elected House Speaker and succeeding t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-could-serve-a-third-term-heres-how/articleshow/119878835.cms",
    "timestamp": "2025-04-01T17:53:47Z"
  },
  {
    "title": "Report: U.S. Justice Department suborned perjury by J6ers to ‘get’ Trump",
    "description": "Defendant told he'd get 'decades' in jail unless 'he claimed he was working with President Trump on overthrowing the government'",
    "link": "https://www.wnd.com/2025/04/report-u-s-justice-department-suborned-perjury-by-j6ers-to-get-trump/",
    "timestamp": "2025-04-01T17:53:32Z"
  },
  {
    "title": "Trump Joint Chiefs Pick Denies He Wore MAGA Hat And Said ‘I’d Kill For You’ When Confronted With Trump Story",
    "description": "\"Razin\" Caine denied several of Trump's claims as he testified at a confirmation hearing, including that he wore a MAGA hat and told Trump \"I'd kill for you!\"\nThe post Trump Joint Chiefs Pick Denies He Wore MAGA Hat And Said ‘I’d Kill For You’ When Confronted…",
    "link": "https://www.mediaite.com/news/trump-joint-chiefs-pick-denies-he-wore-maga-hat-and-said-id-kill-for-you-when-confronted-with-trump-story/",
    "timestamp": "2025-04-01T17:53:29Z"
  },
  {
    "title": "US-Canada-Mexico joint World Cup goes from unity to acrimony thanks to tariffs and ’51st state’ talk",
    "description": "Will the world want to come? And will the world be able to?",
    "link": "https://www.denverpost.com/2025/04/01/trump-tariffs-world-cup-olympics/",
    "timestamp": "2025-04-01T17:53:11Z"
  },
  {
    "title": "US-Canada-Mexico joint World Cup goes from unity to acrimony thanks to tariffs and ’51st state’ talk",
    "description": "Will the world want to come? And will the world be able to?",
    "link": "https://www.bostonherald.com/2025/04/01/trump-tariffs-world-cup-olympics/",
    "timestamp": "2025-04-01T17:53:11Z"
  },
  {
    "title": "Trump’s pick to be America’s top general denies ever wearing a MAGA hat | CNN Politics",
    "description": "Retired Air Force Lt. Gen. Dan “Raizin” Caine, President Donald Trump’s nominee to be the next Chairman of the Joint Chiefs of Staff, denied on Tuesday that he had ever worn a Make America Great Again hat, despite comments by the president saying otherwise.",
    "link": "https://www.cnn.com/2025/04/01/politics/dan-caine-chairman-joint-chiefs-confirmation-hearing/index.html",
    "timestamp": "2025-04-01T17:52:56Z"
  },
  {
    "title": "Trump Is Steamrolling Corporate America. Democrats Are Taking Notes",
    "description": "Historically, Democrats have curbed their attacks on powerful interests for fear that it would cause a backlash. The president’s actions suggest they could stand to be more muscular. \nThe post Trump Is Steamrolling Corporate America. Democrats Are Taking Note…",
    "link": "http://washingtonmonthly.com/2025/04/01/trump-is-steamrolling-corporate-america-democrats-are-taking-notes/",
    "timestamp": "2025-04-01T17:52:49Z"
  },
  {
    "title": "White House to hold meeting on TikTok",
    "description": "WASHINGTON :U.S. President Donald Trump will consider on Wednesday a final proposal related to TikTok ahead of an April 5 deadline for the app to find a non-Chinese buyer or face a U.S. ban, a White House official told Reuters.There will be a meeting at the O…",
    "link": "https://www.channelnewsasia.com/business/white-house-hold-meeting-tiktok-5038196",
    "timestamp": "2025-04-01T17:51:46Z"
  },
  {
    "title": "Support for Cory Booker soars as he nears notorious segregationist’s record for Senate speech",
    "description": "As Sen. Cory Booker’s (D-N.J.) filibuster-style speech on the Senate floor nears 20 hours, liberals online are cheering for him to break the Senate speaking record currently held by notorious segregationist Strom Thurmond. \n\n\n\n\nhttps://www.youtube.com/watch?v…",
    "link": "https://www.dailydot.com/news/cory-booker-filibuster-record/",
    "timestamp": "2025-04-01T17:51:45Z"
  },
  {
    "title": "Support for Cory Booker soars as he nears notorious segregationist’s record for Senate speech",
    "description": "As Sen. Cory Booker’s (D-N.J.) filibuster-style speech on the Senate floor nears 20 hours, liberals online are cheering for him to break the Senate speaking record currently held by notorious segregationist Strom Thurmond. \n\n\n\n\nhttps://www.youtube.com/watch?v…",
    "link": "https://www.dailydot.com/debug/cory-booker-filibuster-record/",
    "timestamp": "2025-04-01T17:51:45Z"
  },
  {
    "title": "Trump-Endorsed Randy Fine: ‘Victory Is in Reach, Now’s the Time to Win BIG for Florida!’",
    "description": "“Victory is in reach” for Republicans in Florida’s 6th Congressional District, Florida state Sen. Randy Fine (R), vying for former U.S. Rep. Mike Waltz’s (R) seat, said in a message on Election Day. Fine is facing off against Democrat Josh Weil for the seat v…",
    "link": "https://freerepublic.com/focus/f-news/4308191/posts",
    "timestamp": "2025-04-01T17:51:26Z"
  },
  {
    "title": "More History To Be Erased As Trump Strips Smithsonian Funding For Anything ‘Anti-American’",
    "description": "Anything that doesn’t jibe with Donald Trump’s white male-centric worldview must go. Whatever is deemed “woke” — no matter its basis in factual history — must be excised. If tossing aside DEI means pretending blacks, women, and other non-white, non-male peopl…",
    "link": "https://www.techdirt.com/2025/04/01/more-history-to-be-erased-as-trump-strips-smithsonian-funding-for-anything-anti-american/",
    "timestamp": "2025-04-01T17:51:15Z"
  },
  {
    "title": "White House to hold meeting on TikTok",
    "description": "WASHINGTON: US President Donald Trump will consider on Wednesday (Apr 2) a final proposal related to TikTok ahead of an Apr 5 deadline for the app to find a non-Chinese buyer or face a US ban, a White House official told Reuters. There will be a meeting at th…",
    "link": "https://www.channelnewsasia.com/world/white-house-hold-meeting-tiktok-5038196",
    "timestamp": "2025-04-01T17:51:00Z"
  },
  {
    "title": "New Colorado Laws Could Set National Standard for Trans Protections",
    "description": "“[S]eeing my adopted home state actually do something to protect me…mean[s] a lot,” a trans Coloradoan told Truthout.",
    "link": "https://truthout.org/articles/new-colorado-laws-could-set-national-standard-for-trans-protections/",
    "timestamp": "2025-04-01T17:50:04Z"
  },
  {
    "title": "The 10 Richest Indian Billionaires 2025",
    "description": "Despite a stock market correction and a weaker rupee, there are a record 205 Indian citizens on Forbes’ World’s Billionaires list.",
    "link": "https://www.forbes.com/sites/naazneenkarmali/2025/04/01/the-10-richest-indian-billionaires-2025/",
    "timestamp": "2025-04-01T17:49:28Z"
  },
  {
    "title": "Italy calls Le Pen sentence a blow to democracy",
    "description": "The conviction of French presidential hopeful Marine Le Pen has silenced the electoral voice of millions, Italian PM Giorgia Meloni has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615110-italy-le-pen-conviction-democracy/",
    "timestamp": "2025-04-01T17:48:51Z"
  },
  {
    "title": "Trump’s tariffs welcomed by Gulf Coast shrimpers: ‘This industry is dying’",
    "description": "BAYOU LA BATRE, Ala. — It’s been four months since Henry Barnes, the mayor of this struggling fishing village in southern Alabama, wrote to Donald Trump for help.\nA flood of cheap imported shrimp is killing the local seafood market, he wrote, thanks to “low a…",
    "link": "https://biztoc.com/x/c2f6faf49ca52da8",
    "timestamp": "2025-04-01T17:48:20Z"
  },
  {
    "title": "Reporter's Notebook: Aftershock from a political 'earthquake' as Le Pen barred from presidential run in 2027",
    "description": "Le Pen called her ban from running a \"nuclear bomb\" by the system, after a court convicted her of embezzlement and blocked her from office for five years.",
    "link": "https://www.foxnews.com/world/reporters-notebook-aftershock-from-political-earthquake-le-pen-barred-from-presidential-run-2027",
    "timestamp": "2025-04-01T17:48:15Z"
  },
  {
    "title": "ICYMI: Trump's 'Liberation Day' Tariffs Are Almost Here",
    "description": "President Donald Trump's \"Liberation Day\" of reciprocal tariffs is almost here.<br><br>On April 2, Trump is rolling out a plan that would charge a blanket dollar for dollar tax on goods coming into the U.S. Trump clarified Sunday that this policy would apply …",
    "link": "https://www.npr.org/2026/01/01/1265982435/icymi-trumps-liberation-day-tariffs-are-almost-here",
    "timestamp": "2025-04-01T17:48:12Z"
  },
  {
    "title": "It’s All Lawfare: Everyone but the Cronies Get Cheated, Mistreated by Big Government",
    "description": "Not to get all Old World on you, but the Oxford Dictionary defines “lawfare” thusly: “Legal action undertaken in order to exert power or control,... Read More\nThe post It’s All Lawfare: Everyone but the Cronies Get Cheated, Mistreated by Big Government appear…",
    "link": "https://www.dailysignal.com/2025/04/01/its-all-lawfare-everyone-cronies-get-ripped-big-government/",
    "timestamp": "2025-04-01T17:48:12Z"
  },
  {
    "title": "‘In What Court Was He Convicted?’ Karoline Leavitt Dodges On Key Question About Migrant Mistakenly Imprisoned In El Salvador",
    "description": "White House Press Secretary Karoline Leavitt dodged a question about a recently deported migrant to repeat the false claim that he was a convicted gang member.\nThe post ‘In What Court Was He Convicted?’ Karoline Leavitt Dodges On Key Question About Migrant Mi…",
    "link": "https://www.mediaite.com/news/in-what-court-was-he-convicted-karoline-leavitt-dodges-on-key-question-about-migrant-mistakenly-imprisoned-in-el-salvador/",
    "timestamp": "2025-04-01T17:48:12Z"
  },
  {
    "title": "Andreessen Horowitz in talks to help buy out TikTok’s Chinese owners",
    "description": "Venture capital group could join last-gasp bid by allies of Donald Trump to take control of video app owned by ByteDance",
    "link": "https://biztoc.com/x/3a9e548652f4b9c6",
    "timestamp": "2025-04-01T17:48:05Z"
  },
  {
    "title": "Duty-wary automakers rush to White House to find workaround",
    "description": "Ford Motor, General Motors and Chrysler parent Stellantis NV are lobbying the administration to exclude certain low-cost car components from the planned tariffs, according to people familiar with the matter. Executives have met with the White House, the comme…",
    "link": "https://economictimes.indiatimes.com/news/international/business/duty-wary-automakers-rush-to-white-house-to-find-workaround/articleshow/119878658.cms",
    "timestamp": "2025-04-01T17:47:35Z"
  },
  {
    "title": "European Union official warns it has a ‘strong plan to retaliate’ against Trump’s tariffs",
    "description": "European Commission President Ursula von der Leyen says the EU “holds a lot of cards” when it comes to dealing with the Trump administration’s new tariffs and has a good plan to retaliate if forced to.",
    "link": "https://www.pbs.org/newshour/world/european-union-official-warns-it-has-a-strong-plan-to-retaliate-against-trumps-tariffs",
    "timestamp": "2025-04-01T17:47:03Z"
  },
  {
    "title": "No batteries? Thinner packaging? US businesses look for ways to offset tariffs",
    "description": "Companies are retooling their wares to reduce costs and avoid raising prices as Trump levies new import taxes.",
    "link": "https://www.bostonherald.com/2025/04/01/trump-tariffs-business/",
    "timestamp": "2025-04-01T17:46:22Z"
  },
  {
    "title": "No batteries? Thinner packaging? US businesses look for ways to offset tariffs",
    "description": "Companies are retooling their wares to reduce costs and avoid raising prices as Trump levies new import taxes.",
    "link": "https://www.denverpost.com/2025/04/01/trump-tariffs-business/",
    "timestamp": "2025-04-01T17:46:22Z"
  },
  {
    "title": "ALAN DERSHOWITZ: Can The Government Cut Off Funding For Woke Colleges?",
    "description": "Many left-wing university faculty members are rebelling against the Trump administration's threat to cut federal funding to woke, antisemitic universities.",
    "link": "https://dailycaller.com/2025/04/01/opinion-does-the-us-government-have-the-right-to-condition-funding-to-universities-alan-dershowitz/",
    "timestamp": "2025-04-01T17:44:21Z"
  },
  {
    "title": "Disney’s ‘Snow White’ remake on pace to lose $115 million amid Rachel Zegler controversy",
    "description": "Despite its high-profile cast and creative team, the film is projected to achieve only a modest global box office total of $225 million.",
    "link": "https://nypost.com/2025/04/01/business/disneys-snow-white-remake-on-pace-to-lose-115-million/",
    "timestamp": "2025-04-01T17:44:09Z"
  },
  {
    "title": "House Republicans Turn On One Another Over Bill That Would Help New Moms",
    "description": "Rep. Anna Paulina Luna quit the Freedom Caucus and called it “a betrayal of trust” that colleagues are trying to tank her bill to let new parents vote by proxy.",
    "link": "https://www.huffpost.com/entry/anna-paulina-luna-freedom-caucus-new-moms-vote_n_67eab26be4b0ff137ab436e9",
    "timestamp": "2025-04-01T17:43:28Z"
  },
  {
    "title": "Kid Rock Joins Trump For Ticket Scalping Executive Order",
    "description": "Kid Rock joined President Donald Trump for the signing of an executive order targeting ticket scalpers and resellers on Monday.",
    "link": "https://hiphopwired.com/2665458/kid-rock-joins-trump-for-ticket-scalping-executive-order/",
    "timestamp": "2025-04-01T17:42:33Z"
  },
  {
    "title": "Massive layoffs begin at top US health agency",
    "description": "Health Secretary Robert F Kennedy Jr announced last week that the health agency would cut 20,000 employees.",
    "link": "https://www.bbc.com/news/articles/c209j2j4nxlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-01T17:42:16Z"
  },
  {
    "title": "Egypt's Sisi, Trump discuss regional mediation efforts in phone call",
    "description": "The two leaders discussed the economic impacts that the Houthi's attacks have had on their respective countries.",
    "link": "https://www.jpost.com/breaking-news/article-848461",
    "timestamp": "2025-04-01T17:41:40Z"
  },
  {
    "title": "The Masters goes on without Tiger Woods. No joke",
    "description": "Tiger Woods can't get back to golf soon enough. Anything to keep him off social media. First came words rarely heard from Woods — “Love is in the air” — in his social media post last week confirming he was in a relationship with the former daughter-in-law of …",
    "link": "https://sports.yahoo.com/article/masters-goes-without-tiger-woods-174111609.html",
    "timestamp": "2025-04-01T17:41:11Z"
  },
  {
    "title": "Against US tariff hand, EU holds 'lot of cards'",
    "description": "The US intends to impose sweeping tariffs on global partners as soon as Wednesday. Trump has said the measures will rectify tariffs as well as non-tariff barriers that he says are unfair, such as domestic regulations and how countries collect taxes, including…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/against-us-tariff-hand-eu-holds-lot-of-cards/articleshow/119878435.cms",
    "timestamp": "2025-04-01T17:40:54Z"
  },
  {
    "title": "Trump Keeps Trying to Make “Liberation Day” Happen",
    "description": "On Wednesdays we wear…whatever’s in our closets since stuff’s about to get expensive.",
    "link": "https://www.vanityfair.com/news/story/trump-keeps-trying-to-make-liberation-day-happen",
    "timestamp": "2025-04-01T17:40:45Z"
  },
  {
    "title": "Trump DOJ to Seek Death Penalty for Luigi Mangione",
    "description": "U.S. Attorney General Pam Bondi announced Tuesday that she is directing federal prosecutors to seek the death penalty in the case of Luigi Mangione, the 26-year-old man accused of killing UnitedHealthcare CEO Brian Thompson in December.Federal prosecutors in …",
    "link": "https://www.commondreams.org/news/mangione-death-penalty-doj",
    "timestamp": "2025-04-01T17:39:54Z"
  },
  {
    "title": "Déjà vu: President Trump nominates Greg Autry again to be NASA's financial chief",
    "description": "President Trump has nominated space policy expert Greg Autry to be NASA's chief financial officer, as he did back in 2020 to no avail.",
    "link": "https://www.space.com/space-exploration/deja-vu-president-trump-nominates-greg-autry-again-to-be-nasas-financial-chief",
    "timestamp": "2025-04-01T17:39:49Z"
  },
  {
    "title": "Federal prosecutors will seek death penalty for Luigi Mangione, AG Bondi says",
    "description": "The Justice Department will seek the death penalty for Luigi Mangione, the man accused of killing UnitedHealthcare CEO Brian Thompson in New York City, Attorney General Pam Bondi said.",
    "link": "https://www.msnbc.com/top-stories/latest/luigi-mangione-death-penalty-unitedhealthcare-ceo-bondi-rcna199103",
    "timestamp": "2025-04-01T17:39:46Z"
  },
  {
    "title": "Trump-Endorsed Randy Fine: 'Victory Is in Reach, Now’s the Time to Win BIG for Florida!'",
    "description": "\"Victory is in reach\" for Republicans in Florida's 6th Congressional District, Florida state Sen. Randy Fine said in a message on Election Day.\nThe post Trump-Endorsed Randy Fine: ‘Victory Is in Reach, Now’s the Time to Win BIG for Florida!’ appeared first on…",
    "link": "https://www.breitbart.com/politics/2025/04/01/trump-endorsed-randy-fine-victory-is-in-reach-nows-time-win-big-florida/",
    "timestamp": "2025-04-01T17:38:54Z"
  },
  {
    "title": "‘A Commitment To The Constitution’: Dem Sen. Mark Kelly Defends Mark Milley’s Alleged Warnings To China",
    "description": "Sen. Mark Kelly, D-Ariz., defended former Joint Chiefs of Staff Chair Mark Milley for allegedly telling his Chinese counterpart he’d warn Beijing of a prospective U.S.-led attack on China by the Trump administration. The moment came during Tuesday’s confirmat…",
    "link": "https://thefederalist.com/2025/04/01/a-commitment-to-the-constitution-dem-sen-mark-kelly-defends-mark-milleys-alleged-warnings-to-china/",
    "timestamp": "2025-04-01T17:38:47Z"
  },
  {
    "title": "Zeldin closes Biden’s climate museum over massive taxpayer waste",
    "description": "Environmental Protection Agency Administrator Lee Zeldin on Monday announced the closure of the $4 million agency museum built by the Biden administration.Zeldin referred to the one-room, 1,595-square-foot facility as one of former President Joe Biden's faile…",
    "link": "https://www.theblaze.com/news/zeldin-closes-bidens-climate-museum-over-massive-taxpayer-waste",
    "timestamp": "2025-04-01T17:38:43Z"
  },
  {
    "title": "Trump Says Nothing 'Off The Table' In Obtaining Greenland",
    "description": "Trump Says Nothing 'Off The Table' In Obtaining Greenland\n \nAuthored by Jacob Burg via The Epoch Times (emphasis ours),\nPresident Donald Trump said over the weekend that he has “absolutely” had real discussions about annexing the semiautonomous Danish territo…",
    "link": "https://biztoc.com/x/3f9492fcba304f14",
    "timestamp": "2025-04-01T17:37:15Z"
  },
  {
    "title": "All Local Workers, US Diplomats To Be Fired From USAID: Report",
    "description": "Elon Musk&#039;s cost-cutting team is finalizing the dismantlement of the US Agency for International Development, ordering the firings of thousands of local workers and American diplomats and civil servants assigned to the agency overseas, reports say.",
    "link": "https://www.ndtv.com/world-news/all-local-workers-us-diplomats-to-be-fired-from-usaid-report-8064359",
    "timestamp": "2025-04-01T17:37:03Z"
  },
  {
    "title": "China launches large-scale military drills around Taiwan",
    "description": "The Chinese military has announced large-scale drills around Taiwan as it again warned the self-ruled island against seeking formal independence.",
    "link": "https://www.pbs.org/newshour/world/china-launches-large-scale-military-drills-around-taiwan",
    "timestamp": "2025-04-01T17:36:54Z"
  },
  {
    "title": "Trump tariffs threaten $8.2 billion American dairy exports",
    "description": "President Donald Trump’s trade war is threatening U.S. dairy exports just as the industry needs new markets for its booming production.\nAmerica exported about $8.2 billion of dairy products last year, the second-highest on record, according to the U.S. Depart…",
    "link": "https://biztoc.com/x/2869e22c68011a14",
    "timestamp": "2025-04-01T17:36:54Z"
  },
  {
    "title": "Can Trump legally run for a third term? The history behind George Washington’s precedent",
    "description": "Only one person in U.S. history has defied the two-term example set by the first president, George Washington. And voters responded by forbidding future presidents from being elected more than twice.\nPresident Donald Trump has alluded to arcane legal argument…",
    "link": "https://biztoc.com/x/396d3f752c44ec49",
    "timestamp": "2025-04-01T17:36:52Z"
  },
  {
    "title": "Luigi Mangione Faces Death Penalty if Convicted, Trump’s Attorney General Decrees",
    "description": "Reading Time: 4 minutesIf convicted, Luigi Mangione is now facing the death penalty. Late last year, following a somewhat clownish manhunt, authorities arrested …\nLuigi Mangione Faces Death Penalty if Convicted, Trump’s Attorney General Decrees was originally…",
    "link": "http://www.thehollywoodgossip.com/2025/04/luigi-mangione-death-penalty/",
    "timestamp": "2025-04-01T17:36:39Z"
  },
  {
    "title": "Trump nominee to be top general denies wearing MAGA hat",
    "description": "Lt. Gen. Dan \"Razin\" Caine, President Donald Trump's nominee to be top general, denied wearing a MAGA hat, as Trump has apparently claimed.",
    "link": "https://abcnews.go.com/Politics/trump-nominee-top-general-denies-wearing-maga-hat/story?id=120378683",
    "timestamp": "2025-04-01T17:36:37Z"
  },
  {
    "title": "Elon Musk, Donald Trump defend Marine Le Pen after conviction bars her from 2027 election",
    "description": "A French court convicted Marine Le Pen and 24 National Rally members for embezzling European Parliament funds, barring her from the 2027 presidential race. Le Pen denounced the ruling as politically motivated and vowed to appeal. The verdict sparked strong re…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-donald-trump-defend-marine-le-pen-after-conviction-bars-her-from-2027-election/articleshow/119878255.cms",
    "timestamp": "2025-04-01T17:36:24Z"
  },
  {
    "title": "Calais businesses grapple with less Canadian foot traffic",
    "description": "Some are worried that the city’s summer tourism season will take a hit if Trump follows through on imposing more tariffs on Canada.",
    "link": "http://www.bangordailynews.com/2025/04/01/down-east/downeast-business/calais-maine-canada-tariffs-trade-business-impact/",
    "timestamp": "2025-04-01T17:36:09Z"
  },
  {
    "title": "Why Cory Booker Has Been Speaking on the Senate Floor for Over 18 Hours",
    "description": "First off, it's not a filibuster. But Booker speech is the most dramatic public challenge to Trump’s agenda in months. Democrats have noticed.",
    "link": "https://time.com/7273417/cory-booker-filibuster-speech-senate/",
    "timestamp": "2025-04-01T17:35:22Z"
  },
  {
    "title": "NASA cut $420 million for climate science, moon modelling and more",
    "description": "Under pressure from Elon Musk’s DOGE task force, NASA is cancelling grants and contracts for everything from lunar dust research to educational programmes",
    "link": "https://www.newscientist.com/article/2474255-nasa-cut-420-million-for-climate-science-moon-modelling-and-more/",
    "timestamp": "2025-04-01T17:35:06Z"
  },
  {
    "title": "European group demands Russian assets stay frozen",
    "description": "A group of European nations has backed keeping Russian assets frozen and urged more sanctions against Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615098-europe-russian-assets-freeze/",
    "timestamp": "2025-04-01T17:34:28Z"
  },
  {
    "title": "Donald Trump forever?",
    "description": "Listen to The World with Richard Engel and Yalda Hakim on your podcast app",
    "link": "https://news.sky.com/story/donald-trump-forever-13339943",
    "timestamp": "2025-04-01T17:34:00Z"
  },
  {
    "title": "Sinaloa cartel slapped with Trump admin sanctions in blow to drug empire",
    "description": "The U.S. Department of the Treasury announced sanctions against six individuals and seven entities allegedly involved in a money laundering network that supports the Sinaloa cartel.",
    "link": "https://www.foxnews.com/us/sinaloa-cartel-slapped-trump-admin-sanctions-blow-drug-empire",
    "timestamp": "2025-04-01T17:33:45Z"
  },
  {
    "title": "All local workers, US diplomats to be fired from USAID, sources say",
    "description": "Elon Musk's cost-cutting team is finalizing the shutdown of USAID, firing thousands of employees and closing overseas offices. Most staff will be terminated by September, with functions merged into the State Department under Trump's \"America First\" policy.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-all-local-workers-us-diplomats-to-be-fired-from-usaid-elon-musks-cost-cutting-team-is-finalizing-the-dismantlement/articleshow/119878197.cms",
    "timestamp": "2025-04-01T17:33:16Z"
  },
  {
    "title": "Hundreds of scientists accuse Donald Trump of censorship",
    "description": "More than 1,900 scientists and engineers have signed a letter saying they “see real danger in this moment” as the Trump administration slashes federal support for scientific research. “Wise investments by the US government have built up the nation’s research …",
    "link": "https://www.theverge.com/news/640664/science-censorship-trump-letter-climate-vaccine-national-academies",
    "timestamp": "2025-04-01T17:33:13Z"
  },
  {
    "title": "Trump’s April 2 tariffs to take immediate effect, White House says",
    "description": "Trump plans to roll out tariffs on global trading partners during an event planned for 4 p.m. in the White House Rose Garden. Read on",
    "link": "https://financialpost.com/news/economy/trumps-april-2-tariffs-to-take-immediate-effect-white-house-says",
    "timestamp": "2025-04-01T17:32:37Z"
  },
  {
    "title": "Report: Nearly 200 workers at W.Va. Occupational Safety and Health location to be laid off",
    "description": "Nearly 200 workers at a federal Occupational Safety and Health location in West Virginia are being laid off, according to reports.An expected 185 of the roughly",
    "link": "https://wchstv.com/news/local/report-nearly-200-workers-at-wva-occupational-safety-and-health-location-to-be-laid-off",
    "timestamp": "2025-04-01T17:32:03Z"
  },
  {
    "title": "Germany describes Russia-Ukraine peace talks as deadlocked, but China says negotiations are encouraging",
    "description": "Germany’s chief diplomat is describing President Trump’s efforts to secure a truce in the war between Russia and Ukraine as deadlocked. But China’s foreign minister says the talks are an encouraging sign.",
    "link": "https://www.pbs.org/newshour/world/germany-describes-russia-ukraine-peace-talks-as-deadlocked-but-china-says-negotiations-are-encouraging",
    "timestamp": "2025-04-01T17:31:04Z"
  },
  {
    "title": "Donald Trump Fell for Elon Musk’s Big Con",
    "description": "Wednesday is Liberation Day, and one person might be even more excited about it than Donald Trump is: Elon Musk. While much of what the president will announce from the Rose Garden on April 2 remains a mystery, Trump has already declared that 25 percent tarif…",
    "link": "https://newrepublic.com/article/193357/trump-liberation-day-elon-musk-doge-big-con",
    "timestamp": "2025-04-01T17:30:17Z"
  },
  {
    "title": "Workers, US diplomats to be fired from USAID, sources say",
    "description": "Sources with knowledge of the layoffs said that the mass firings were the \"closing out\" of the federal aid agency.",
    "link": "https://www.jpost.com/international/article-848460",
    "timestamp": "2025-04-01T17:29:43Z"
  },
  {
    "title": "We're becoming Hungary, the most corrupt European state",
    "description": "This Atlantic piece by Anne Applebaum is the most cogent look into America's future I've yet read. I wanted to share it, a large portion of it, anyway. Applebaum is a keen observer of Eastern European corrruption and its states that have taken an authoritaria…",
    "link": "https://www.pmcarpenter.com/post/we-re-becoming-hungary-the-most-corrupt-european-state",
    "timestamp": "2025-04-01T17:29:39Z"
  },
  {
    "title": "China says beef imports investigation will be fair",
    "description": "BEIJING: China said it would deliver a \"fair and objective\" ruling following a hearing in its ongoing investigation into beef imports that could lead to higher tariffs or import limits if it finds domestic producers are at risk. China is the world's largest b…",
    "link": "https://www.channelnewsasia.com/asia/china-says-beef-imports-investigation-will-be-fair-5038146",
    "timestamp": "2025-04-01T17:29:29Z"
  },
  {
    "title": "Cory Booker Rips Trump In 18-Hour-Plus Senate Speech Meant To Disrupt 'Normal Business'",
    "description": "The New Jersey senator has been on an anti-Trump tear about how the “nation is in crisis” since 7 p.m. Monday night — and is still going.",
    "link": "https://www.huffpost.com/entry/cory-booker-rips-trump-in-senate-speech_n_67ebf5a5e4b0e75d098bb2c3",
    "timestamp": "2025-04-01T17:27:57Z"
  },
  {
    "title": "Democratic Sen. Coons: 'Your Average Middle American' Is Too Stupid to Find Greenland on a Map",
    "description": "Coons was trying to highlight his party's issue with the Trump administration looking to get involved with Greenland for the sake of national security. As Townhall covered all last week, Vice President JD Vance and Second Lady Usha Vance traveled to Greenland…",
    "link": "https://freerepublic.com/focus/f-news/4308190/posts",
    "timestamp": "2025-04-01T17:27:39Z"
  },
  {
    "title": "With a TikTok ban looming, Trump signals a deal will come before April 5 deadline",
    "description": "By SARAH PARVINI, AP Technology Writer\nLOS ANGELES (AP) — As the deadline to strike a deal over TikTok approaches this week, President Donald Trump has signaled that he is confident his administration can broker an agreement with ByteDance, the social media a…",
    "link": "https://biztoc.com/x/00537ad59a0b6a5e",
    "timestamp": "2025-04-01T17:26:00Z"
  },
  {
    "title": "More Republicans want the US to focus on ceasefires in Ukraine and Gaza, new poll finds",
    "description": "The survey found about 8 in 10 Republicans approve of Trump’s handling of the conflict in Gaza.",
    "link": "https://www.bostonherald.com/2025/04/01/poll-foreign-conflicts/",
    "timestamp": "2025-04-01T17:25:09Z"
  },
  {
    "title": "Trump turns homelessness response away from housing, toward forced treatment",
    "description": "Trump could find allies in blue cities and states as the public clamors for streets to be cleaned up.",
    "link": "https://www.bostonherald.com/2025/04/01/trump-homeless-treatment/",
    "timestamp": "2025-04-01T17:24:38Z"
  },
  {
    "title": "National Park Rangers rebel against queer erasure on Trans Day of Visibility",
    "description": "While the Trump\r\n administration continues its campaign to erase transgender\r\n people from public life—including from historic federal landmarks—those who once wore the National Park Service uniform are refusing to stay silent.",
    "link": "https://www.advocate.com/news/park-rangers-transgender-stonewall-erasure",
    "timestamp": "2025-04-01T17:23:27Z"
  },
  {
    "title": "European and US stocks gain ahead of tariff deadline",
    "description": "UK business minister Jonathan Reynolds hopes any US tariffs can be reversed with new economic partnership",
    "link": "https://www.irishtimes.com/business/2025/04/01/european-and-us-stocks-gain-ahead-of-tariff-deadline/",
    "timestamp": "2025-04-01T17:23:03Z"
  },
  {
    "title": "Jesse Watters Mocks Co-Host For Criticizing Deportation of Innocent Man: ‘You’ve Been Talking About This Gay Barber For Weeks’",
    "description": "Jesse Watters mocked Jessica Tarlov for criticizing Trump's administration deporting potentially innocent people to El Salvador, including a \"gay barber.\"\nThe post Jesse Watters Mocks Co-Host For Criticizing Deportation of Innocent Man: ‘You’ve Been Talking A…",
    "link": "https://www.mediaite.com/tv/jesse-watters-mocks-co-host-for-criticizing-deportation-of-innocent-man-youve-been-talking-about-this-gay-barber-for-weeks/",
    "timestamp": "2025-04-01T17:22:38Z"
  },
  {
    "title": "Polls show growing discontent with Donald Trump’s economy as tariffs take center stage and recession risks surge",
    "description": "New polls reveal declining confidence in Trump’s economic policies amid tariff rollouts and recession fears. Voters cite inflation, weak growth, and buyer’s remorse.",
    "link": "https://economictimes.indiatimes.com/news/international/us/polls-show-growing-discontent-with-donald-trumps-economy-as-tariffs-take-center-stage-and-recession-risks-surge/articleshow/119877676.cms",
    "timestamp": "2025-04-01T17:22:26Z"
  },
  {
    "title": "US health agencies witness massive job cuts: What’s at stake as employees face layoffs at FDA, NIH, CDC",
    "description": "Almost 25 per cent of their total workforce, the US Department of Health, and Human Services (HHS) is preparing to let go of 20,000 staff members. The reorganization plan was announced by Health Secretary Robert F Kennedy Jr. Experts and politicians advise th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-health-agencies-witness-massive-job-cuts-whats-at-stake-as-employees-face-layoffs-at-fda-nih-cdc/articleshow/119877612.cms",
    "timestamp": "2025-04-01T17:22:07Z"
  },
  {
    "title": "US Admits To El Salvador Deportation \"Error\" As Alarm Deepens Over Policy",
    "description": "Donald Trump&#039;s hardline immigrant policy faced fresh scrutiny Tuesday after officials admitted an &quot;administrative error&quot; in the hurried deportation process had sent a man to a notorious El Salvador prison.",
    "link": "https://www.ndtv.com/world-news/us-admits-to-el-salvador-deportation-error-as-alarm-deepens-over-trump-policy-8064276",
    "timestamp": "2025-04-01T17:20:48Z"
  },
  {
    "title": "India should treat ‘Liberation Day’ for US trade as means to free its own domestic economy",
    "description": "Donald Trump's reciprocal tariffs on US imports start today, pressuring countries to lower their trade barriers. Despite ongoing negotiations for a bilateral trade agreement, India must respond by boosting domestic competitiveness and strategically leveraging…",
    "link": "https://m.economictimes.com/opinion/et-commentary/india-should-treat-liberation-day-for-us-trade-as-means-to-free-its-own-domestic-economy/articleshow/119877626.cms",
    "timestamp": "2025-04-01T17:19:47Z"
  },
  {
    "title": "Tesla sales rout in Europe deepens amid anti-Musk protests",
    "description": "Tesla's sales in key European markets continued to decline in March, signaling a shift away from Elon Musk's electric car brand. Factors contributing to the decline include increased competition from Chinese manufacturers and backlash against Musk's political…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/tesla-sales-rout-in-europe-deepens-amid-anti-musk-protests/articleshow/119877571.cms",
    "timestamp": "2025-04-01T17:17:26Z"
  },
  {
    "title": "Stagflation Sparks New Fears For US Economy",
    "description": "Some economists are anticipating a period of higher inflation, rising prices and slow economic growth.",
    "link": "https://www.newsweek.com/stagflation-fears-us-economy-trump-tariffs-2053750",
    "timestamp": "2025-04-01T17:17:21Z"
  },
  {
    "title": "With a TikTok ban looming, Trump signals a deal will come before April 5 deadline",
    "description": "Trump said that “there’s tremendous interest in Tiktok,” adding that he would “like to see TikTok remain alive.”",
    "link": "https://www.bostonherald.com/2025/04/01/trump-tiktok-ban/",
    "timestamp": "2025-04-01T17:17:09Z"
  },
  {
    "title": "Is Hope a Strategy? Bitcoin Reclaims $85K Ahead of Trump 'Liberation Day' Tariff Announcement",
    "description": "The president is set to detail his tariff regime on Wednesday after the U.S. market close.",
    "link": "https://www.coindesk.com/markets/2025/04/01/is-hope-a-strategy-bitcoin-reclaims-usd85k-ahed-of-trump-liberation-day-tariff-announcement",
    "timestamp": "2025-04-01T17:16:23Z"
  },
  {
    "title": "Wisconsin Supreme Court Vote Is Referendum On Musk, Not Trump",
    "description": "I see many articles claiming Tuesday's Wisconsin Supreme Court election is a referendum on the MAGA cult and Donald Trump, but they downplay the obvious. Will the public allow the richest man in the world and his wealth to determine US elections?\nThe AP: \"Maj…",
    "link": "https://crooksandliars.com/2025/04/wisconsin-supreme-court-election",
    "timestamp": "2025-04-01T17:16:01Z"
  },
  {
    "title": "Speaker Johnson suffers defeat as GOP rebels tank effort to block remote voting for new parents | CNN Politics",
    "description": "Speaker Mike Johnson on Tuesday abruptly halted all work in the House after suffering a major defeat over his push to block remote voting in Congress for new parents.",
    "link": "https://www.cnn.com/2025/04/01/politics/johnson-luna-proxy-voting-parents-house-gop/index.html",
    "timestamp": "2025-04-01T17:15:41Z"
  },
  {
    "title": "Santander Wins Canadian Banking License Amid Push Into Americas",
    "description": "Banco Santander SA has won a Canadian banking license as it continues its expansion across the Americas.",
    "link": "https://financialpost.com/pmn/business-pmn/santander-wins-canadian-banking-license-amid-push-into-americas",
    "timestamp": "2025-04-01T17:15:37Z"
  },
  {
    "title": "Liberation Day: Everything You Need to Know",
    "description": "President Donald Trump has introduced the term \"Liberation Day\" to describe the rollout of a portion of his new tariff plan on April 2, which aims to reshape United States trade policy.\nOn April 2, Trump is expected to unveil the details of his \"reciprocal ta…",
    "link": "https://biztoc.com/x/2d05025302e5fa6e",
    "timestamp": "2025-04-01T17:15:28Z"
  },
  {
    "title": "How To Watch Cory Booker’s Filibuster Live",
    "description": "Could the New Jersey Senator beat the 24-hour filibuster record?",
    "link": "https://decider.com/2025/04/01/how-to-watch-cory-booker-filibuster-live/",
    "timestamp": "2025-04-01T17:15:24Z"
  },
  {
    "title": "Massive layoffs begin at top US health agency",
    "description": "Health Secretary Robert F Kennedy Jr announced last week that the health agency would cut 20,000 employees.",
    "link": "https://www.bbc.com/news/articles/c209j2j4nxlo",
    "timestamp": "2025-04-01T17:15:04Z"
  },
  {
    "title": "Trump begins mass layoffs at FDA, CDC, other US health agencies",
    "description": "WASHINGTON: The Trump administration began mass layoffs of 10,000 staffers at US health agencies on Tuesday (Apr 1), according to multiple sources familiar with the situation, wi",
    "link": "https://www.channelnewsasia.com/world/trump-begins-mass-layoffs-fda-cdc-other-us-health-agencies-5038116",
    "timestamp": "2025-04-01T17:14:50Z"
  },
  {
    "title": "Trump administration lists Quebec language law Bill 96 as trade barrier",
    "description": "The Office of the U.S. Trade Representative released its annual list of global trade barriers Tuesday, and it includes Quebec's controversial language law Bill 96 as a trade irritant between the two countries.",
    "link": "https://www.cbc.ca/news/politics/carney-trump-blanchet-bill-off-table-trade-1.7499025",
    "timestamp": "2025-04-01T17:14:25Z"
  },
  {
    "title": "More than three-quarters of startups say tariffs will impact their business: survey",
    "description": "TORONTO — More than three-quarters of Canadian startups believe tariffs will impact their business, a new report found. The survey of more than 175 ventures linked to Ontario tech hubs MaRS and Communitech found 38 per cent expect a direct impact as a result …",
    "link": "https://financialpost.com/pmn/more-than-three-quarters-of-startups-say-tariffs-will-impact-their-business-survey",
    "timestamp": "2025-04-01T17:13:11Z"
  },
  {
    "title": "Report: ICE Has Performed More Than 100,000 Deportations Since President Trump Took Office in January",
    "description": "Deportations have reportedly reached over 100,000 since President Donald Trump took office a second time in January.\nThe post Report: ICE Has Performed More Than 100,000 Deportations Since President Trump Took Office in January appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/04/01/report-ice-has-performed-more-than-100000-deportations-since-president-trump-took-office-january/",
    "timestamp": "2025-04-01T17:12:51Z"
  }
]