[
  {
    "title": "The US and Ukraine Make Respect for Kyiv’s Sovereignty a Condition in Any Potential Deal with Russia",
    "description": "Joint statement from the White House and Kyiv following talks in Geneva – The European 28-point counterproposal and Zelensky’s red lines\nThe post The US and Ukraine Make Respect for Kyiv’s Sovereignty a Condition in Any Potential Deal with Russia appeared fir…",
    "link": "https://en.protothema.gr/2025/11/24/the-us-and-ukraine-make-respect-for-kyivs-sovereignty-a-condition-in-any-potential-deal-with-russia/",
    "timestamp": "2025-11-24T08:15:24Z"
  },
  {
    "title": "Mushrooming coaching centres: Parliamentary panel to examine trend, existing legislations",
    "description": "A parliamentary committee is reviewing the surge in coaching centres, citing student suicides due to academic pressure. The panel will also assess AI's impact on education, PM-SHRI schools, and NCERT's performance. Discussions include creating a Higher Educat…",
    "link": "https://timesofindia.indiatimes.com/education/news/mushrooming-coaching-centres-parliamentary-panel-to-examine-trend-existing-legislations/articleshow/125535788.cms",
    "timestamp": "2025-11-24T08:13:09Z"
  },
  {
    "title": "Winter is here: What not to miss while buying Geyser; how to stop bill shock and safety tips",
    "description": "Winter mornings demand a geyser, but choosing one involves more than just capacity. This guide details crucial factors like budget, space, energy efficiency, and safety features. Understanding installation, water quality, and warranty terms ensures a reliable…",
    "link": "https://timesofindia.indiatimes.com/technology/tech-tips/winter-is-here-what-not-to-miss-while-buying-geyser-how-to-stop-bill-shock-and-safety-tips/articleshow/125535649.cms",
    "timestamp": "2025-11-24T08:09:40Z"
  },
  {
    "title": "The AI boom has exposed a hidden weakness: 4 soft skills companies urgently need",
    "description": "Companies are rapidly adopting AI, but a critical human capability gap is emerging. Technical skills are no longer scarce; soft skills like learning agility, critical thinking, self-management, and people skills are now paramount. Organizations must actively …",
    "link": "https://timesofindia.indiatimes.com/education/careers/news/the-ai-boom-has-exposed-a-hidden-weakness-4-soft-skills-companies-urgently-need/articleshow/125533885.cms",
    "timestamp": "2025-11-24T08:03:01Z"
  },
  {
    "title": "Modi Plans Reform Blitz in Parliament to Turbocharge Economy",
    "description": "Prime Minister Narendra Modi’s government plans to push through a dozen major bills in the upcoming parliament session to speed up reforms and boost investments.",
    "link": "https://financialpost.com/pmn/business-pmn/modi-plans-reform-blitz-in-parliament-to-turbocharge-economy",
    "timestamp": "2025-11-24T08:00:51Z"
  },
  {
    "title": "The CDC is lying to you about vaccines and autism",
    "description": "The CDC webpage about vaccines and autism now misrepresents the science and lies to the public about vaccines and autism. It's just part of HHS Secretary Robert F. Kennedy Jr. continuing war on vaccines.\nThe post The CDC is lying to you about vaccines and aut…",
    "link": "https://sciencebasedmedicine.org/the-cdc-is-lying-to-you-about-vaccines-and-autism/",
    "timestamp": "2025-11-24T08:00:00Z"
  },
  {
    "title": "Trump’s Effort to Break Up Education Dept. Part of Long History",
    "description": "Trump’s Effort to Break Up Education Dept. Part of Long History\n\n \n\n\n \nRyan Quinn\n\nMon, 11/24/2025 - 03:00 AM\n\nAn iteration of the department in 1867 lasted about a year before being demoted and not resurfacing until the Carter administration. Department or n…",
    "link": "https://www.insidehighered.com/news/government/2025/11/24/trump-isnt-first-president-try-break-ed",
    "timestamp": "2025-11-24T08:00:00Z"
  },
  {
    "title": "For One Tribal College, $5M Gift is Transformative",
    "description": "For One Tribal College, $5M Gift is Transformative \n\n \n\n\n \nkathryn.palmer…\n\nMon, 11/24/2025 - 03:00 AM\n\nLittle Priest Tribal College in Nebraska is the latest higher education institution to receive a donation from MacKenzie Scott. It comes after Trump sought…",
    "link": "https://www.insidehighered.com/news/institutions/minority-serving-institutions/2025/11/24/one-tribal-college-5m-gift",
    "timestamp": "2025-11-24T08:00:00Z"
  },
  {
    "title": "Trump says he awaits Supreme Court ruling on “urgent, time-sensitive” tariff case",
    "description": "Understood. Please provide the article you want me to generate a meta description for.",
    "link": "https://seekingalpha.com/news/4525185-trump-says-he-awaits-supreme-court-ruling-on-urgent-time-sensitive-tariff-case",
    "timestamp": "2025-11-24T07:37:02Z"
  },
  {
    "title": "In his tightest corner yet, Zelenskiy faces a make-or-break moment of wartime leadership",
    "description": "Over nearly four years of wartime leadership, analysts say the Ukrainian leader has repeatedly played weak hands wisely. A US peace plan may be his biggest test",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/11/23/world/europe/ukraine-zelensky-war-russia.html",
    "timestamp": "2025-11-24T07:34:29Z"
  },
  {
    "title": "Today in Germany: A roundup of the latest news on Monday",
    "description": "Snow and ice cause chaos on German roads, number of deportations from the country rises sharply, readings by drag performers attract protests and counter-protests in Berlin and more news on Monday, November 24th.",
    "link": "https://www.thelocal.de/20251124/today-in-germany-a-roundup-of-the-latest-news-on-monday-99",
    "timestamp": "2025-11-24T07:32:17Z"
  },
  {
    "title": "'Record setting': Trump claims 'full benefit' of tariff plan has 'not yet been calculated'",
    "description": "Donald Trump has claimed his tariff plan will start to pay off soon as the \"full benefit\" of his policy has \"not yet been calculated\".In a post to Truth Social, the president claimed there was a significant proportion of money made by tariffs placed on other …",
    "link": "https://www.rawstory.com/donald-trump-tariffs-2674336186/",
    "timestamp": "2025-11-24T07:28:57Z"
  },
  {
    "title": "Ron DeSantis, Florida GOP Oppose Trump's Offshore Drilling Plan For The State: 'Highly Concerning'",
    "description": "Governor Ron DeSantis and Florida Republicans have openly criticized President Donald Trump’s offshore drilling plan for the Gulf of America.\nFlorida Seeks Rollback of Drilling Plan\nThe Trump administration's updated offshore drilling proposal for the Gulf of…",
    "link": "https://biztoc.com/x/99aefefa4e09825c",
    "timestamp": "2025-11-24T07:26:15Z"
  },
  {
    "title": "European Gas Drops Below €30 for the First Time Since May 2024",
    "description": "European natural gas dropped below €30 a megawatt-hour for the first time in more than a year amid discussions about a potential end to Russia’s war in Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/european-gas-drops-below-e30-for-the-first-time-since-may-2024",
    "timestamp": "2025-11-24T07:25:12Z"
  },
  {
    "title": "Trump’s attacks are worsening. Why is he becoming even more vengeful?",
    "description": "A Fox News poll last week had Trump’s favourable rating at just 40 per cent – even worse than Joe Biden’s rating at the same point in his presidency",
    "link": "https://www.thehindubusinessline.com/news/world/trumps-attacks-are-worsening-why-is-he-becoming-even-more-vengeful/article70316483.ece",
    "timestamp": "2025-11-24T07:22:07Z"
  },
  {
    "title": "U.S. set to label Maduro-tied Cartel de los Soles as a terror organization",
    "description": "President Trump's administration is set to ramp up pressure on Venezuelan President Nicolás Maduro designating Cartel de los Soles as a terrorist organization. But the entity is not a cartel per se.",
    "link": "https://www.npr.org/2025/11/24/g-s1-99000/u-s-label-maduro-cartel-de-los-soles-terror-organization",
    "timestamp": "2025-11-24T07:11:01Z"
  },
  {
    "title": "Trump Reportedly Pressuring Studio To Make A Sequel To Iconic Buddy Film",
    "description": "The president wants to see a new entry in this long-dormant series.",
    "link": "https://www.huffpost.com/entry/trump-rush-hour-movies_n_6923e6b4e4b049cdc6d51357",
    "timestamp": "2025-11-24T07:09:10Z"
  },
  {
    "title": "While You Were Sleeping: Here Are The 239 Words Trump Posted After Midnight",
    "description": "The president posted a lengthy message about one of his favorite topics.",
    "link": "https://www.huffpost.com/entry/donald-trump-supreme-court-rant_n_6923fd48e4b04a88b45e76ec",
    "timestamp": "2025-11-24T07:03:29Z"
  },
  {
    "title": "Stores keep prices down in a tough year for turkeys. Other Thanksgiving foods may cost more",
    "description": "Bird flu and another disease have shrunk the U.S. turkey population to a 40-year low this year",
    "link": "https://abcnews.go.com/Business/wireStory/stores-prices-tough-year-turkeys-thanksgiving-foods-cost-127814619",
    "timestamp": "2025-11-24T07:01:51Z"
  },
  {
    "title": "Stores keep prices down in a tough year for turkeys. Other Thanksgiving foods may cost more",
    "description": "Bird flu and another disease have shrunk the U.S. turkey population to a 40-year low this year",
    "link": "https://abcnews.go.com/US/wireStory/stores-prices-tough-year-turkeys-thanksgiving-foods-cost-127814616",
    "timestamp": "2025-11-24T07:01:48Z"
  },
  {
    "title": "US set to label Maduro-tied Cartel de los Soles as a terror organization. It's not a cartel per se",
    "description": "President Donald Trump’s administration is set to increase pressure on Venezuelan President Nicolás Maduro by designating the Cartel de los Soles as a foreign terrorist organization",
    "link": "https://abcnews.go.com/International/wireStory/us-set-label-maduro-tied-cartel-de-los-127814614",
    "timestamp": "2025-11-24T07:01:44Z"
  },
  {
    "title": "NYTs Calls Trump Strategy in South America “Pragmatic”",
    "description": "There is nothing “pragmatic” about engaging in a conflict where only one side, the United States, is armed, and the factual basis for the conflict is created  out of whole cloth.  It wasn’t pragmatic to create false facts to justify the Mexican-American War, …",
    "link": "https://www.counterpunch.org/2025/11/24/nyts-calls-trump-strategy-in-south-america-pragmatic/",
    "timestamp": "2025-11-24T06:59:05Z"
  },
  {
    "title": "US and Ukraine draft 'refined peace framework' after criticism of initial Washington proposal",
    "description": "The initial US plan was drafted without input from Ukraine’s European allies, who were scrambling to make their voices heard and boost Kyiv’s position.",
    "link": "https://www.thejournal.ie/russia-ukraine-us-peace-framework-6883793-Nov2025/",
    "timestamp": "2025-11-24T06:57:27Z"
  },
  {
    "title": "US and Ukraine draft ‘refined’ peace plan to end war with Russia",
    "description": "European allies propose counter-plan with US security guarantee for Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/11/24/us-and-ukraine-draft-refined-peace-plan-to-end-war-with-russia/",
    "timestamp": "2025-11-24T06:47:41Z"
  },
  {
    "title": "US and Ukraine to continue work on ‘refined’ peace plan to end war with Russia",
    "description": "European allies propose counter-plan with US security guarantee for Ukraine",
    "link": "https://www.irishtimes.com/world/europe/2025/11/24/us-and-ukraine-to-continue-work-on-refined-peace-plan-to-end-war-with-russia/",
    "timestamp": "2025-11-24T06:47:41Z"
  },
  {
    "title": "US and Ukraine report progress on ending Russia war but offer few details",
    "description": "Top US and Ukrainian officials said they were making progress towards ending the Russia-Ukraine war but provided scant details as they discussed the American proposal to achieve peace despite concerns among many of Washington’s European allies that the plan w…",
    "link": "https://www.independent.ie/world-news/europe/us-and-ukraine-report-progress-on-ending-russia-war-but-offer-few-details/a2130220888.html",
    "timestamp": "2025-11-24T06:45:00Z"
  },
  {
    "title": "Europe adds notes to Ukraine peace",
    "description": "In today’s edition: European leaders feed their edits into a new US–Ukraine peace outline, pressure mounts to diversify the Commission’s staff mix amid sharp imbalances, and the EU limps out of Belém after a bruising climate summit",
    "link": "https://www.euractiv.com/news/rapporteur-europe-adds-notes-to-ukraine-peace/",
    "timestamp": "2025-11-24T06:28:57Z"
  },
  {
    "title": "Thousands of arrests by Trump's task force in Memphis strain crowded jail and courts",
    "description": "A task force ordered by President Donald Trump to combat crime in Memphis, Tennessee, has made thousands of arrests",
    "link": "https://abcnews.go.com/US/wireStory/thousands-arrests-trumps-crime-fighting-task-force-memphis-127814251",
    "timestamp": "2025-11-24T06:24:31Z"
  },
  {
    "title": "Why Democrats Lost Voter Confidence",
    "description": "Democrats are relieved by the outcome of the last election. They think that the people finally see the Trump administration for what it is, a fascist-leaning government that favors the rich and well-connected at the expense of the poor. The wins are impressiv…",
    "link": "https://www.counterpunch.org/2025/11/24/why-democrats-lost-voter-confidence/",
    "timestamp": "2025-11-24T06:20:52Z"
  },
  {
    "title": "Mamdani refuses to retract “fascist”, “despot” remarks after first White House meeting with Trump",
    "description": "NEW YORK: New York City Mayor-elect Zohran Mamdani has reaffirmed his past remarks calling US President Donald Trump a “fascist” and a “despot”, even after the two held their first in-person meeting at the White House on Friday. Appearing on NBC News’ Meet th…",
    "link": "https://english.khabarhub.com/2025/24/507439/",
    "timestamp": "2025-11-24T06:15:45Z"
  },
  {
    "title": "US States Take Aim at Data-Driven Pricing to Ease Consumer Pain",
    "description": "Even as the White House seeks to roll back state laws on artificial intelligence, states are pursuing an increasing number of bills to ban tech-driven pricing practices in an effort to bring consumers relief from high costs. By taking on …",
    "link": "https://www.insurancejournal.com/news/national/2025/11/24/848751.htm",
    "timestamp": "2025-11-24T06:11:34Z"
  },
  {
    "title": "Trump Threatens to Withhold $75M From Pennsylvania Over Immigrant Truck Drivers",
    "description": "The Trump administration has threatened to withhold nearly $75 million in funding if Pennsylvania does not immediately revoke what the administration claims are illegally issued commercial driver’s licenses to immigrants. The move by U.S. Transportation Secre…",
    "link": "https://www.insurancejournal.com/news/east/2025/11/24/848768.htm",
    "timestamp": "2025-11-24T06:00:42Z"
  },
  {
    "title": "Denis Walsh: In the end, oil money outlasted all the protests and sportswashing won",
    "description": "Uproar faded away as murderous regime spent big in return for soft power",
    "link": "https://www.irishtimes.com/sport/2025/11/24/denis-walsh-in-the-end-oil-money-outlasted-all-the-protests-and-sportswashing-won/",
    "timestamp": "2025-11-24T06:00:01Z"
  },
  {
    "title": "Worldview: Zohran Mamdani has scrambled the calculus of success for Democrats",
    "description": "Centrists argue socialism is unpopular outside of big cities, but few things are more unpopular than the party brand itself",
    "link": "https://www.irishtimes.com/opinion/2025/11/22/worldview-zohran-mamdani-has-scrambled-the-calculus-of-success-for-democrats/",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Joe Humphreys: How to channel the Stoics and stop comparing yourself to others",
    "description": "Unthinkable: Resentment animates much of our political debate today. Here’s a three-point plan to tackle it",
    "link": "https://www.irishtimes.com/opinion/2025/11/24/joe-humphreys-think-like-a-bee-and-channel-the-stoics-how-to-stop-comparing-yourself-to-others/",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Kremlin declares openness to peace talks, blames Kyiv for stalled ceasefire efforts",
    "description": "Peace talks are stalled, with Russia and Ukraine each blaming the other for the lack of progress. While Ukrainian President Volodymyr Zelensky has expressed a desire to revive negotiations, Russian officials are deeply skeptical, calling it a “smokescreen.” A…",
    "link": "https://www.naturalnews.com/2025-11-24-kremlin-declares-openness-talks-blames-kyiv-delays.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Americans favor legal immigration pathways but show declining support amid policy shifts",
    "description": "Sixty-seven percent of registered voters believe legal immigration benefits the U.S., though support has dipped slightly from 74% in August, coinciding with stricter visa policies. Sixty-four percent deem it “very important” to facilitate immigration for doct…",
    "link": "https://www.naturalnews.com/2025-11-24-americans-favor-legal-immigration-pathways-show-declining-support.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "ICE arrested 3,600 criminal aliens in Houston, targeting “worst of the worst” during government shutdown",
    "description": "ICE arrested nearly 3,600 illegal immigrants in Houston during the six-week government shutdown. Targets included violent offenders, child predators, gang members and repeat deportees. Among those arrested: Leo Michel Acosta Sanchez (wanted for homicide via I…",
    "link": "https://www.naturalnews.com/2025-11-24-ice-arrests-criminal-aliens-houston-government-shutdown.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Trump accuses Democrats of SEDITION for urging military to disobey orders",
    "description": "President Trump lashed out at Democratic lawmakers, calling them “traitors” and demanding their imprisonment after they urged military personnel to reject “illegal orders.” Reps. Crow, DeLuzio, Goodlander, Houlahan and Sens. Kelly and Slotkin released a video…",
    "link": "https://www.naturalnews.com/2025-11-24-trump-democrats-sedition-urging-military-disobey-orders.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "U.S. State Department warns of mass migration crisis as Trump administration launches historic deportation push",
    "description": "The U.S. State Department warns that mass migration threatens Western civilization, citing Europe’s failures—grooming gangs in Britain, migrant crime leniency in Sweden and no-go zones in France—as proof of policies prioritizing migrants over citizens. Violen…",
    "link": "https://www.naturalnews.com/2025-11-24-us-state-dept-warns-mass-migration-crisis.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Ukraine’s energy crisis deepens as Russian strikes cripple nuclear power output",
    "description": "Hundreds of thousands of Ukrainians suffered prolonged blackouts (up to 16 hours) after Russian missile strikes targeted energy infrastructure. Nuclear power plants, supplying over 50% of Ukraine’s electricity, were forced to reduce output due to damaged tran…",
    "link": "https://www.naturalnews.com/2025-11-24-russian-strikes-cripple-ukraine-nuclear-power-output.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "FAA pushes $31.5 billion air traffic control overhaul as aging system relies on eBay for parts",
    "description": "The FAA is urgently modernizing its aging air traffic control system with a $31.5 billion overhaul. The current system is so outdated the government hunts for spare parts on eBay. A new single platform will replace two aging and unsustainable control systems.…",
    "link": "https://www.naturalnews.com/2025-11-24-faa-air-traffic-control-overhaul-system.html",
    "timestamp": "2025-11-24T06:00:00Z"
  },
  {
    "title": "Trump says trade tariff revenue to ‘skyrocket’ as local inventory levels drop",
    "description": "Asia stocks rise as Dec rate cut bets resurface; China lags on chipmaker losses\nInvesting.com-- U.S. President Donald Trump said fiscal revenue from his trade tariffs is set to “skyrocket” in the coming months as inventory levels among local importers run dry…",
    "link": "https://biztoc.com/x/1e773624e5278558",
    "timestamp": "2025-11-24T05:57:47Z"
  },
  {
    "title": "Russian attack kills four, wounds 17 in Kharkiv: Mayor",
    "description": "A Russian drone strike on the major Ukrainian city of Kharkiv killed four people and wounded 17 on Sunday, its mayor said.",
    "link": "https://www.hurriyetdailynews.com/russian-attack-kills-four-wounds-17-in-kharkiv-mayor-216059",
    "timestamp": "2025-11-24T05:57:26Z"
  },
  {
    "title": "In Geneva, U.S. and Ukraine officials report progress on ending war with Russia",
    "description": "Top U.S. and Ukrainian officials said Sunday they'd made progress toward ending the Russia-Ukraine war but provided scant details after discussing the American proposal to achieve peace.",
    "link": "https://www.npr.org/2025/11/24/g-s1-98998/geneva-u-s-ukraine-report-progress",
    "timestamp": "2025-11-24T05:56:25Z"
  },
  {
    "title": "No nation deserves Ukraine’s fate: A war it cannot win, a peace it cannot accept",
    "description": "As Russian forces tighten their grip and Donald Trump pushes a pro-Moscow peace plan, Kyiv faces an “impossible choice” between national dignity and losing crucial Western support",
    "link": "https://indianexpress.com/article/opinion/columns/russia-ukraine-war-donald-trump-28-point-peace-plan-putin-zelenskyy-10382843/",
    "timestamp": "2025-11-24T05:54:49Z"
  },
  {
    "title": "G20 grapples with splintering world order",
    "description": "G20 leaders wrapped up a summit in South Africa on Nov. 23, hailing multilateralism—even as they struggled to adapt to a changing world order beset by go-it-alone U.S. policies, wars, and deepening geopolitical rivalries.",
    "link": "https://www.hurriyetdailynews.com/g20-grapples-with-splintering-world-order-216058",
    "timestamp": "2025-11-24T05:53:37Z"
  },
  {
    "title": "50 children in Nigeria escape after kidnapping as 38 worshippers rescued",
    "description": "At least 50 of the more than 300 children snatched by gunmen from a Catholic school in Nigeria have escaped their captors, a Christian group said on Sunday, as the president announced the rescue of 38 worshippers seized in a separate attack last week.",
    "link": "https://www.hurriyetdailynews.com/50-children-in-nigeria-escape-after-kidnapping-as-38-worshippers-rescued-216057",
    "timestamp": "2025-11-24T05:50:21Z"
  },
  {
    "title": "NZ is halting access to puberty blockers. What about the rest of the world?",
    "description": "New Zealand has become the latest country to halt access to puberty blockers for young people with gender dysphoria but are they following best health practice or an outlier?",
    "link": "https://www.abc.net.au/news/2025-11-24/nz-halt-access-puberty-blockers-transgender-youth-australia/106036326",
    "timestamp": "2025-11-24T05:48:09Z"
  },
  {
    "title": "Department of Government Efficiency Winds Down Despite Months Left To Run: Report",
    "description": "The administration’s DOGE office has gone dormant months early as the White House weighs easier paths to close federal units.",
    "link": "https://decrypt.co/349772/department-government-efficiency-winds-down",
    "timestamp": "2025-11-24T05:46:54Z"
  },
  {
    "title": "Trump: Tariffs to bring unprecedented wealth to US",
    "description": "United States President Donald Trump stressed on Truth Social that tariffs will bring about national security and wealth to the US \"the likes of which has never been seen before.\"\"Despite the massive ...",
    "link": "https://biztoc.com/x/50f66b6648fe186f",
    "timestamp": "2025-11-24T05:46:37Z"
  },
  {
    "title": "Days after their friendly meeting, Mamdani says he still thinks Trump is a fascist",
    "description": "New York City Mayor-elect Zohran Mamdani said in an interview with NBC that he continues to regard US President Donald Trump as a \"fascist and a danger to democracy.\" He said, \"I've said it before and I'm saying it again today.\"Along with the harsh criticism,…",
    "link": "https://www.israelnationalnews.com/flashes/671054",
    "timestamp": "2025-11-24T05:45:44Z"
  },
  {
    "title": "Washington, Kiev say a peace deal must 'fully uphold' Ukraine sovereignty",
    "description": "Washington and Kiev said Sunday that any eventual deal to halt the war with Russia must fully uphold Ukraine's sovereignty, after \"constructive\" talks between U.S., Ukrainian and European officials in Geneva.",
    "link": "https://www.hurriyetdailynews.com/washington-kiev-say-a-peace-deal-must-fully-uphold-ukraine-sovereignty-216056",
    "timestamp": "2025-11-24T05:44:32Z"
  },
  {
    "title": "Qatar's Shadow Empire Crumbles.\nTrump's Explosive Terror Strike: Muslim Brotherhood To Be Declared a Foreign Terror Organization.",
    "description": "President Trump ignites the final assault on the Muslim Brotherhood, branding them terrorists to dismantle their pro-Hamas \"civilization jihad\" and expose Qatar's billions flooding US campuses with radical influence, will democracy's defenders prevail against…",
    "link": "https://freerepublic.com/focus/f-news/4354282/posts",
    "timestamp": "2025-11-24T05:43:22Z"
  },
  {
    "title": "Trump Jr, J-Lo Attend Wedding Of US Billionaire's Daughter At Udaipur's Jagmandir Palace",
    "description": "Rajasthan’s Udaipur, turned into a global celebrity hotspot on Sunday as the daughter of US billionaire Rama Raju Mantena married at the Jagmandir Palace, with high-profile guests including Donald Trump Jr and Hollywood star Jennifer Lopez attending the multi…",
    "link": "https://www.ndtvprofit.com/trending/trump-jr-j-lo-attend-wedding-of-us-billionaires-daughter-at-udaipurs-jagmandir-palace",
    "timestamp": "2025-11-24T05:42:20Z"
  },
  {
    "title": "Optimism ahead of pope's visit to Turkey for reopening of Istanbul's Greek Orthodox seminary",
    "description": "Pope Leo XIV is set to embark on his first trip abroad with a visit to Turkey, marking a key event in Catholic and Orthodox Christianity",
    "link": "https://abcnews.go.com/International/wireStory/optimism-ahead-popes-visit-turkey-reopening-istanbuls-greek-127814714",
    "timestamp": "2025-11-24T05:42:00Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*Israeli Attacks In Gaza, Lebanon*Pre-Emptive Arrest*By Next September 30th 1768 Dollars 26 Cents A Person*Not Working For The Pimps Anymore*\"War Fever\" Of Top French General*Only...Can Save Us*Candace Helps...*",
    "description": "Newsdump Alert: A Wave Of Israeli Air Attacks In Gaza And Lebanon...Nationalist Settler Attacks Continue... Newsdump Alert: Former Brazilian President Jair Bolsonaro Pre-Emptively Arrested... By September 30th of next year, the federal government is projected…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354281/posts",
    "timestamp": "2025-11-24T05:40:41Z"
  },
  {
    "title": "JPMorgan Chase Ends Banking Ties With Strike CEO, Rekindling Crypto Debanking Concerns",
    "description": "JPMorgan Chase’s move has renewed scrutiny of alleged anti-crypto debanking despite a Trump order banning the practice.",
    "link": "https://decrypt.co/349769/jpmorgan-chase-ends-banking-ties-strike-ceo",
    "timestamp": "2025-11-24T05:34:24Z"
  },
  {
    "title": "Ciara Kelly: The Trump-BBC controversy marks a shift from a decade of cancelling – media groups are in a new era now and objectivity must prevail",
    "description": "When did it start, misinformation at the BBC? When did an institution that prided itself on objectivity let it slip to further a distinct ideological narrative? It’s funny (in a way) – populism is often used to describe the way certain people on the right beh…",
    "link": "https://www.independent.ie/opinion/comment/ciara-kelly-the-trump-bbc-controversy-marks-a-shift-from-a-decade-of-cancelling-media-groups-are-in-a-new-era-now-and-objectivity-must-prevail/a674458544.html",
    "timestamp": "2025-11-24T05:30:00Z"
  },
  {
    "title": "Letters: Russian aggressors must not be allowed to dictate ‘peace deal’ for Ukraine",
    "description": "Donald Trump’s 28-point plan, which he says he negotiated with Russia’s Vladimir Putin, is a version of the same plan that Putin proposed when he met Trump in Alaska at a previous summit this year.",
    "link": "https://www.independent.ie/opinion/letters/letters-russian-aggressors-must-not-be-allowed-to-dictate-peace-deal-for-ukraine/a1618267792.html",
    "timestamp": "2025-11-24T05:30:00Z"
  },
  {
    "title": "Trump claims people in Chicago are chanting his name and demanding he send in troops to crush ‘crime and rioting’",
    "description": "US president Donald Trump has claimed that Chicago residents have been chanting “bring in Trump” as a series of shootings in the Windy City over the weekend prompted him to raise the prospect of sending troops into the city.",
    "link": "https://www.independent.ie/world-news/north-america/trump-claims-people-in-chicago-are-chanting-his-name-and-demanding-he-send-in-troops-to-crush-crime-and-rioting/a1122692119.html",
    "timestamp": "2025-11-24T05:30:00Z"
  },
  {
    "title": "G20 summit a triumph of multilateralism despite US boycott, says South African president Cyril Ramaphosa",
    "description": "South Africa’s president Cyril Ramaphosa said yesterday that the declaration from the weekend’s Group of 20 (G20) summit reflected a “renewed commitment to multilateral co-operation”, concluding a meeting that pitted him against his US counterpart.",
    "link": "https://www.independent.ie/world-news/g20-summit-a-triumph-of-multilateralism-despite-us-boycott-says-south-african-president-cyril-ramaphosa/a411544164.html",
    "timestamp": "2025-11-24T05:30:00Z"
  },
  {
    "title": "Europeans discuss changes to Ukraine-Russia peace plan with US secretary of state Marco Rubio, as Donald Trump slams ‘ungrateful’ Ukrainians",
    "description": "Ukrainian, US and European officials met in Geneva yesterday to discuss a draft US plan to end the war in Ukraine, after Kyiv and its allies voiced alarm over what they saw as major concessions to Russia and pressed for changes.",
    "link": "https://www.independent.ie/world-news/europe/europeans-discuss-changes-to-ukraine-russia-peace-plan-with-us-secretary-of-state-marco-rubio-as-donald-trump-slams-ungrateful-ukrainians/a2130220888.html",
    "timestamp": "2025-11-24T05:30:00Z"
  },
  {
    "title": "Taiwan Minister Says 'Consensus' Reached With US To Shield Semiconductor Industry From Tariffs",
    "description": "Taiwanese National Science and Technology Council Minister Wu Cheng-wen said that Taiwan and the United States have reached a “consensus” to keep tariffs off Taipei’s semiconductor industry.The Taiwan Semiconductor Manufacturing Company Ltd. headquarters in H…",
    "link": "https://freerepublic.com/focus/f-news/4354280/posts",
    "timestamp": "2025-11-24T05:26:52Z"
  },
  {
    "title": "China’s power equipment firms ride AI boom amid demand from US, emerging markets",
    "description": "The race to develop artificial intelligence has pushed governments and technology giants to build new electricity plants and upgrade their decades-old grid networks, creating significant opportunities for Chinese power equipment companies, according to analys…",
    "link": "https://www.scmp.com/news/china-future-tech/ai/article/3333897/chinas-power-equipment-firms-ride-ai-driven-boom-amid-demand-us-emerging-markets",
    "timestamp": "2025-11-24T05:25:12Z"
  },
  {
    "title": "China’s power equipment firms ride AI boom amid demand from US, emerging markets",
    "description": "The race to develop artificial intelligence has pushed governments and technology giants to build new electricity plants and upgrade their decades-old grid networks, creating significant opportunities for Chinese power equipment companies, according to analys…",
    "link": "https://www.scmp.com/news/business/china-business/article/3333897/chinas-power-equipment-firms-ride-ai-driven-boom-amid-demand-us-emerging-markets",
    "timestamp": "2025-11-24T05:25:12Z"
  },
  {
    "title": "Thanksgiving prices don't reflect bird flu's recent toll on turkeys",
    "description": "Bird flu and another disease have shrunk the U.S. turkey population to a 40-year low this year. Wholesale turkey prices are expected to be up more than 40% as a result. But shoppers preparing for Thanksgiving may not see higher prices themselves because many …",
    "link": "https://apnews.com/article/thanksgiving-turkey-food-prices-2025-5754f2e4c7ca8747b75a4b3efe15297f",
    "timestamp": "2025-11-24T05:24:43Z"
  },
  {
    "title": "'Indira Gandhi Stood Up To The Americans'",
    "description": "'She was brave. She didn't care a hoot. And India was not the strongest of nations as it is now.'",
    "link": "https://www.rediff.com/movies/report/indira-gandhi-stood-up-to-the-americans/20251124.htm",
    "timestamp": "2025-11-24T05:23:24Z"
  },
  {
    "title": "Knowledge Nugget: What happened at G20 Summit in South Africa? Here are the key takeaways",
    "description": "G20 Summit 2025 Takeaways for UPSC : With the US staying away and the G20 convening in Africa for the first time, the 2025 G20 summit drew global attention for several reasons. Also, go 'Beyond the Nugget' to know about the G20.",
    "link": "https://indianexpress.com/article/upsc-current-affairs/knowledge-nugget-takeaways-of-g20-summit-upsc-exam-10382273/",
    "timestamp": "2025-11-24T05:23:09Z"
  },
  {
    "title": "The Skies Empty Over Caracas As the Dictator Dances",
    "description": "Nicolás Maduro's days are numbered, and no one knows it better than the man himself. If you can call him that. As I wrote earlier this week, he wears $1,000 shoes, while the people of Venezuela can't even feed their children. That's not a man. Anyway, as I'm …",
    "link": "https://freerepublic.com/focus/f-news/4354279/posts",
    "timestamp": "2025-11-24T05:20:46Z"
  },
  {
    "title": "The Hot Tub of Death? Bill Gates, Hurricane Melissa, and a Civilization Under Threat",
    "description": "Here is my essay for this week's Tomdispatch.com. Don't miss Tom Engelhardt's canny introduction, in which he points to Donald Trump's climate denialism as a context for that of his 'billionaire buddies.' And by the way, it has now been shown that Hurricane M…",
    "link": "https://www.juancole.com/2025/11/hurricane-melissa-civilization.html",
    "timestamp": "2025-11-24T05:15:16Z"
  },
  {
    "title": "Who Is Rama Raju Mantena, NRI Industrialist Who Hosted Star-Studded Wedding For His Daughter?",
    "description": "The wedding took place at the Leela Palace and Jagmandir Island Palace and witnessed the attendance of top public figures, including Donald Trump Jr. and Jennifer Lopez.",
    "link": "https://www.ndtvprofit.com/business/who-is-rama-raju-mantena-nri-industrialist-who-hosted-star-studded-wedding-for-his-daughter",
    "timestamp": "2025-11-24T05:11:20Z"
  },
  {
    "title": "Ukraine Peace Plan Darkens The Mood Across A War-Torn Nation",
    "description": "A proposed peace plan for Ukraine led by the United States has been met with anguish by many Ukrainians, who fear a post-war amnesty for Russian forces would erase accountability for alleged atrocities.",
    "link": "https://www.huffpost.com/entry/ap-eu-russia-ukraine-war-mood_n_6923e6d9e4b0ea2d5e756b29",
    "timestamp": "2025-11-24T05:07:00Z"
  },
  {
    "title": "Is Venezuela the New Iraq?",
    "description": "By Richard W. Coughlin | November 18, 2025 ( Foreign Policy in Focus ) - Iraq and Venezuela share an obvious trait: they are oil-rich states whose resource nationalism puts them at odds with U.S. geopolitical ambitions. For George W. Bush, Iraqi oil was frame…",
    "link": "https://www.juancole.com/2025/11/venezuela-the-iraq.html",
    "timestamp": "2025-11-24T05:06:43Z"
  },
  {
    "title": "COP30: 5 Reasons the UN Climate Conference wasn’t the Promised “People’s Summit”",
    "description": "By Simon Chin-Yee, UCL; Mark Maslin, UCL, and Priti Parikh, UCL (The Conversation) - As the sun set on the Amazon, the promise of a “people’s Cop” faded with it. The latest UN climate summit – known as Cop30, hosted in the Brazilian city of Belém – came with …",
    "link": "https://www.juancole.com/2025/11/reasons-conference-promised.html",
    "timestamp": "2025-11-24T05:04:03Z"
  },
  {
    "title": "US set to label Maduro-tied Cartel de los Soles as a terror organization. It's not a cartel per se",
    "description": "President Donald Trump's administration is set to ramp up pressure on Venezuelan President Nicolás Maduro on Monday by designating the Cartel de los Soles as...",
    "link": "https://www.yahoo.com/news/articles/us-set-label-maduro-tied-050225832.html",
    "timestamp": "2025-11-24T05:02:25Z"
  },
  {
    "title": "Keisha Lance Bottoms aims to be first Atlanta mayor to become Georgia governor",
    "description": "Keisha Lance Bottoms is bidding to become the first former Atlanta mayor to be elected governor of Georgia",
    "link": "https://abcnews.go.com/Politics/wireStory/keisha-lance-bottoms-aims-atlanta-mayor-become-georgia-127814071",
    "timestamp": "2025-11-24T05:01:33Z"
  },
  {
    "title": "Why shoppers are planning to cut Black Friday weekend spending this year",
    "description": "As the holiday shopping season starts to kick into high gear, Americans are balancing Black Friday deals with lingering concerns about their own finances",
    "link": "https://www.nbcnews.com/business/consumer/shoppers-plan-cut-black-friday-spending-rcna245116",
    "timestamp": "2025-11-24T05:01:00Z"
  },
  {
    "title": "Impeachment of Judge Boasberg is long overdue",
    "description": "Either Judge James Boasberg just hasn’t gotten the message about his outrageous behavior, or this Obama-appointed judge thinks he’s above the law. He’s proved to be a rogue judge, running roughshod over the separation of powers, and...",
    "link": "https://www.americanthinker.com/blog/2025/11/impeachment_of_judge_boasberg_is_long_overdue.html",
    "timestamp": "2025-11-24T05:00:00Z"
  },
  {
    "title": "Terrorist designation double play",
    "description": "President Donald Trump and Texas governor Greg Abbott are utilizing the power of the government to dismantle networks of domestic extremism and Islamist infiltration that have festered under years of weak, politically correct policies. Recent develop...",
    "link": "https://www.americanthinker.com/blog/2025/11/terrorist_designation_double_play.html",
    "timestamp": "2025-11-24T05:00:00Z"
  },
  {
    "title": "EU States Complete Brussels’ Surveillance Network",
    "description": "The EU is working at full speed to complete its online surveillance-and-informant network. By the end of the year, all EU member states are required to present so-called “Trusted Flaggers” -- institutions tasked with identifying “pr...",
    "link": "https://www.americanthinker.com/articles/2025/11/eu_states_complete_brussels_surveillance_network.html",
    "timestamp": "2025-11-24T05:00:00Z"
  },
  {
    "title": "Nick Fuentes Proves ‘No Enemies To The Right’ Is Suicide For The GOP",
    "description": "There is a dangerous misconception taking hold among certain Republicans who believe the party should adopt a “big tent” philosophy that includes anyone who claims the slightest right-wing inclination.\r\n\r\nThis thinking comes from a place ...",
    "link": "https://www.americanthinker.com/articles/2025/11/nick_fuentes_proves_no_enemies_to_the_right_is_suicide_for_the_gop.html",
    "timestamp": "2025-11-24T05:00:00Z"
  },
  {
    "title": "Trump expected to unveil new health care cost proposal | CNN Politics",
    "description": "President Donald Trump is planning to unveil a new proposal for addressing health care costs as soon as Monday, as his administration tries to avert a spike in premiums driven by the expiration of key Affordable Care Act subsidies, three people familiar with …",
    "link": "https://www.cnn.com/2025/11/23/politics/trump-health-care-proposal",
    "timestamp": "2025-11-24T04:56:02Z"
  },
  {
    "title": "Critical Ignoring: A Strategy for Information Overload",
    "description": "When politicians “flood the zone” with information, important news can get lost. Critical ignoring is a cognitive strategy for fighting back.",
    "link": "https://www.psychologytoday.com/us/blog/misinformation-desk/202511/critical-ignoring-a-strategy-for-information-overload",
    "timestamp": "2025-11-24T04:46:31Z"
  },
  {
    "title": "‘Sedition Is a Major Crime’: Trump Hammers Democrats Who Told Military to Defy ‘Illegal Orders’",
    "description": "The group of Democrat lawmakers who told military members to disobey orders should be locked up, President Donald Trump proposed Saturday. Trump made his statements after those lawmakers, including Sen. Elissa Slotkin (D-MI), were featured in a video on Tuesd…",
    "link": "https://freerepublic.com/focus/f-news/4354275/posts",
    "timestamp": "2025-11-24T04:41:56Z"
  },
  {
    "title": "Mamdani Says He 'Continues To Believe' Everything He'd Said Earlier About Trump Despite 'Very Productive' Meeting",
    "description": "New York City Mayor-elect Zohran Mamdani said he stands by calling President Donald Trump a \"fascist,\" even as he praised their White House meeting as productive and focused on affordability.\nMamdani Repeats ‘Fascist’ Label\nIn an interview on NBC's \"Meet the …",
    "link": "https://biztoc.com/x/06df9efbfff5a38f",
    "timestamp": "2025-11-24T04:39:58Z"
  },
  {
    "title": "Donald Trump elevates once-fringe meme makers to the mainstream",
    "description": "Various online factions are producing AI-crafted visuals and video clips featuring Donald Trump, which are then shared by Trump himself, elevating them to widespread visibility. This technique effectively sidesteps traditional media gatekeepers and frequently…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-elevates-once-fringe-meme-makers-to-the-mainstream/articleshow/125531736.cms",
    "timestamp": "2025-11-24T04:33:27Z"
  },
  {
    "title": "Ukraine war briefing: Macron says without deterrence in Ukraine plan, ‘Russians will come back’",
    "description": "Emmanuel Macron said on Saturday that Russia would “betray” its promise and “come back” if Ukraine was forced to reduce its army, as proposed under Donald Trump’s plan. The French president was among European leaders meeting at a G20 summit in South Africa wh…",
    "link": "https://freerepublic.com/focus/f-news/4354272/posts",
    "timestamp": "2025-11-24T04:33:02Z"
  },
  {
    "title": "US And Ukraine Talk 'Refined' Peace Plan As Trump Ratchets Up The Pressure",
    "description": "Negotiators are continuing to hammer out a draft after European allies criticized the administration's prior proposal for favoring Russia.",
    "link": "https://www.huffpost.com/entry/ukraine-united-states-russia_n_6923db28e4b0ea2d5e7568ce",
    "timestamp": "2025-11-24T04:32:04Z"
  },
  {
    "title": "Iran warns of plots against Khamenei, blames Israel and US",
    "description": "Iran’s intelligence minister warns of plots by Israel and the US to target Supreme Leader Ayatollah Khamenei.",
    "link": "https://www.israelnationalnews.com/news/418251",
    "timestamp": "2025-11-24T04:22:16Z"
  },
  {
    "title": "Netra Mantena-Vamsi Gadiraju Udaipur wedding: Rama Raju donated 1008 gold coin garland worth Rs 8 crore at Tirupati? Check his net worth",
    "description": "Indian-American heiress Netra Mantena married NRI Vamsi Gadiraju in a lavish Udaipur wedding, concluding four days of festivities. Bride's father Rama Raju Mantena, a billionaire, has carved a niche for himself in the pharma industry. He once donated 1008 gol…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/netra-mantena-vamsi-gadiraju-udaipur-wedding-rama-raju-donated-1008-gold-coin-garland-worth-rs-8-crore-at-tirupati-check-his-net-worth/articleshow/125531350.cms",
    "timestamp": "2025-11-24T04:09:16Z"
  },
  {
    "title": "The 28-Point Theater of the Absurd",
    "description": "The chihuahuas of war will keep barking while the SMO will keep rollin’ along. The Circus Ringmaster’s 28-point “peace plan” for Ukraine may be seen as a pet seal splashing around in a pond to amuse the galleries. And up next, we move to another attraction. Y…",
    "link": "https://www.lewrockwell.com/2025/11/no_author/the-28-point-theater-of-the-absurd/",
    "timestamp": "2025-11-24T04:01:00Z"
  }
]