[
  {
    "title": "Trump To Sign EO Reducing Cost Of Prescription Drugs",
    "description": "By Melanie Wilcox, Daily Caller News Foundation | May 11, 2025\nPresident Donald Trump announced Sunday that he will sign a sweeping Executive Order aimed at slashing the cost of prescription drugs in the United States, calling it “one of the most consequentia…",
    "link": "https://biztoc.com/x/6164ce5b322ba12c",
    "timestamp": "2025-05-13T10:50:10Z"
  },
  {
    "title": "Arabian horses escort Trump’s Beast in Saudi Arabia, with Elon Musk in attendance",
    "description": "RIYADH, Saudi Arabia — President Trump got the royal treatment on his first stop in Saudi Arabia, as white Arabian horses flanked his motorcade — with adviser Elon Musk in tow. Dozens of Saudis rode on horseback carrying US and Saudi flags as Trump’s motorcad…",
    "link": "https://nypost.com/2025/05/13/us-news/arabian-horses-escort-trumps-beast-in-saudi-arabia-with-elon-musk-in-attendance/",
    "timestamp": "2025-05-13T10:47:27Z"
  },
  {
    "title": "US Crypto Task Force Spotlights Growing Interest in RWA Tokenisation in Latest Roundtable Meet",
    "description": "Paul Atkins, the chairperson of the Crypto Task Force, acknowledged that securities were rapidly migrating from off-chain databases to on-chain ledger networks, indicating adoption of Web3 technologies. He said that tokenisation could enhance capital formatio…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/us-crypto-task-force-spotlights-interest-rwa-tokenisation-latest-roundtable-8403219",
    "timestamp": "2025-05-13T10:47:02Z"
  },
  {
    "title": "India's inflation rate slows to 3.16% in April, marking six straight months of decline",
    "description": "India's headline inflation eased to 3.16% in April, the sixth consecutive month of decline.",
    "link": "https://www.cnbc.com/2025/05/13/india-cpi-slows-to-3point16percent-in-april.html",
    "timestamp": "2025-05-13T10:44:11Z"
  },
  {
    "title": "Warning that hunger in Gaza to impact 'entire generation' after 55 children die from malnutrition",
    "description": "As Israel continues to enforce a blockade on two million Palestinians, hunger in Gaza could have a lasting impact on \"an entire generation\", the World Health Organisation has warned.",
    "link": "https://news.sky.com/story/warning-that-hunger-in-gaza-to-impact-entire-generation-after-55-children-die-from-malnutrition-13367095",
    "timestamp": "2025-05-13T10:44:00Z"
  },
  {
    "title": "Luxury car maker JLR abstains from confirming forecast on US tariff uncertainty",
    "description": "Imported cars have been a main focus of U.S. President Donald Trump's global trade war.  Trump last month imposed a 25% tariff on all foreign-made vehicles...",
    "link": "https://finance.yahoo.com/news/luxury-car-maker-jlr-abstains-104333907.html",
    "timestamp": "2025-05-13T10:43:33Z"
  },
  {
    "title": "German investors cheered by tariff talks, new government",
    "description": "German investor sentiment has jumped, buoyed by rollbacks of US tariffs, and the formation of a new national government, a closely-watched survey showed Tuesday. Market expectations for Europe’s biggest economy over the next six months rose 39.2 points to sit…",
    "link": "https://www.digitaljournal.com/world/german-investors-cheered-by-tariff-talks-new-government/article",
    "timestamp": "2025-05-13T10:42:33Z"
  },
  {
    "title": "Dem Senate Candidates Running In ‘Toss-Up’ States Co-Sponsor Bill To Eliminate Women’s Sports",
    "description": "By Adam Pack, Daily Caller News Foundation | May 10, 2025\nTwo congressional Democrats seeking to win “toss-up” Senate contests in states won by President Donald Trump are co-sponsoring legislation that would eliminate female-only spaces and infringe on the ri…",
    "link": "https://biztoc.com/x/7c03d97c7ef521b8",
    "timestamp": "2025-05-13T10:39:53Z"
  },
  {
    "title": "Fed Up With Benjamin Netanyahu?",
    "description": "By Philip Giraldi via Ron Paul Institute for Peace and Prosperity | May 09, 2025\nI have in the past speculated that the day might come when President Donald Trump, he of a massive ego, might just become tired of his being manipulated and controlled by America…",
    "link": "https://biztoc.com/x/09c961c5012dd32b",
    "timestamp": "2025-05-13T10:39:41Z"
  },
  {
    "title": "President Trump Announces Trade Deal With Britain To ‘Fast-Track American Goods’",
    "description": "By Tyler O'Neil, The Daily Signal | May 08, 2025\nPresident Donald Trump announced a trade deal with the United Kingdom Thursday along with British Prime Minister Keir Starmer. “This will be a great deal for both countries,” Trump said in the Oval Office. “It’…",
    "link": "https://biztoc.com/x/52e18d2a2a1f6419",
    "timestamp": "2025-05-13T10:39:26Z"
  },
  {
    "title": "The art of Trump’s incredibly dubious Qatar jumbo jet ‘deal’",
    "description": "A 13-year-old private Boeing aircraft, that President Donald Trump toured on May 10, takes off from Palm Beach International Airport in West Palm Beach, Fla., Feb. 16, 2025.",
    "link": "https://biztoc.com/x/fb1d2ec4dc7947f4",
    "timestamp": "2025-05-13T10:39:26Z"
  },
  {
    "title": "Drug price cuts: what is Trump planning and what will it mean for big pharma?",
    "description": "President has directed Robert Kennedy to send price targets to industry, with slimming drugs thought to be included \nDonald Trump has used his executive powers to order sweeping cuts to the price of prescription drugs in the US, in an effort to bring them in …",
    "link": "https://biztoc.com/x/b4da7fa21253000b",
    "timestamp": "2025-05-13T10:39:23Z"
  },
  {
    "title": "Trump keeps creating trade problems to (badly) solve",
    "description": "A deal between the U.S. and China to lower tariffs is not the major win that Donald Trump would claim. Nor is the trade agreement with the United Kingdom.",
    "link": "https://biztoc.com/x/a5c1cfa7759825c1",
    "timestamp": "2025-05-13T10:39:12Z"
  },
  {
    "title": "First American-Born Pope Draws Praise From Trump, Across Political Lines",
    "description": "By Fred Lucas, The Daily Signal | May 08, 2025\nPresident Donald Trump and other political leaders from both sides congratulated the first American-born pope Thursday after the election of Cardinal Robert Francis Prevost, who will lead under the name Pope Leo …",
    "link": "https://biztoc.com/x/a2730aaa8e7e65ee",
    "timestamp": "2025-05-13T10:39:08Z"
  },
  {
    "title": "Trump's Middle East trip marked by potential private business conflicts (Washington Post)",
    "description": "Washington Post:\nTrump's Middle East trip marked by potential private business conflicts  —  The Trump Organization has entered into real estate deals in all three countries Trump plans to visit this week.  —  President Donald Trump kicks off the first major …",
    "link": "https://www.memeorandum.com/250513/p9",
    "timestamp": "2025-05-13T10:35:00Z"
  },
  {
    "title": "Nancy Mace Sues Businessman Over Social Media Posts",
    "description": "Representative Nancy Mace is suing a man named in her House speech on sexual assault for defamation due to his posts on social media.",
    "link": "https://www.newsweek.com/nancy-mace-sues-businessman-over-social-media-posts-2071406",
    "timestamp": "2025-05-13T10:34:35Z"
  },
  {
    "title": "APT group exploited Output Messenger Zero-Day to target Kurdish military operating in Iraq",
    "description": "A Türkiye-linked group used an Output Messenger zero-day to spy on Kurdish military targets in Iraq, collecting user data since April 2024. Since April 2024, the threat actor Marbled Dust (aka Sea Turtle, Teal Kurma, Marbled Dust, SILICON and Cosmic Wolf) has…",
    "link": "https://securityaffairs.com/177758/apt/apt-group-exploited-output-messenger-zero-day-to-target-kurdish-military-operating-in-iraq.html",
    "timestamp": "2025-05-13T10:34:00Z"
  },
  {
    "title": "Hasan Piker Ridicules DHS Border Stop Statement—'Insane Questions'",
    "description": "Piker has mocked the Department of Homeland Security (DHS) after he was detained and DHS accused him of \"lying for likes.\"",
    "link": "https://www.newsweek.com/hasan-piker-detained-dhs-border-chicago-2071390",
    "timestamp": "2025-05-13T10:32:26Z"
  },
  {
    "title": "Minister: TikTok data centre could anger the United States",
    "description": "A government minister suggests that a planned data centre may be a way for China to bypass curbs on AI chip exports.",
    "link": "https://yle.fi/a/74-20161498",
    "timestamp": "2025-05-13T10:32:24Z"
  },
  {
    "title": "Netanyahu to Edan Alexander: 'All of Israel embraces you'",
    "description": "Freed soldier Edan Alexander speaks with PM Netanyahu and President Trump after release from Hamas captivity; US envoy praises Israeli leadership in emotional exchange.",
    "link": "https://www.israelnationalnews.com/news/408280",
    "timestamp": "2025-05-13T10:31:59Z"
  },
  {
    "title": "It’s Huge! Trump’s Jumbo Jet Obsession Through The Years",
    "description": "As diplomats around the world struggle to figure out Trump, Qatar may have found the perfect way to please the American president—dangling a supersized gift to stroke his ego.",
    "link": "https://www.forbes.com/sites/danalexander/2025/05/13/its-huge-trumps-jumbo-jet-obsession-through-the-years/",
    "timestamp": "2025-05-13T10:30:42Z"
  },
  {
    "title": "Trump-linked crypto rumour sparks frenzy as $DJT ticker fuels confusion",
    "description": "Ran Neuner claimed a Truth Social meme coin was launching in 72 hours. Past TMTG plans had discussed a digital rewards token, but none were launched. Meme coin speculation around Trump-branded assets remains high. A rumour about a Truth Social meme coin sent …",
    "link": "https://coinjournal.net/news/trump-linked-crypto-rumour-sparks-frenzy-as-djt-ticker-fuels-confusion/",
    "timestamp": "2025-05-13T10:29:02Z"
  },
  {
    "title": "US deportations raise 'serious concerns': UN rights chief",
    "description": "The UN rights chief voiced alarm on Tuesday at the large numbers of non-nationals being deported from the United States, in particular the hundreds sent to a mega-prison in El Salvador. His office pointed in a statement to US data showing that between January…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-deportations-raise-serious-concerns-un-rights-chief/articleshow/121136724.cms",
    "timestamp": "2025-05-13T10:28:54Z"
  },
  {
    "title": "Honda projects a 70% annual profit nose-dive this year because of Trump tariffs",
    "description": "Honda’s profit for the fiscal year through March slipped 24.5% from the previous year, as its vehicle sales in China dropped, and the Japanese automaker warned Tuesday that President Donald Trump’s tariffs will worsen its earnings.\nTokyo-based Honda Motor Co.…",
    "link": "https://biztoc.com/x/cf21dfee7fcd3c9f",
    "timestamp": "2025-05-13T10:28:16Z"
  },
  {
    "title": "Jerome Powell may finally grant Trump his interest rate wish thanks to China deal",
    "description": "Yesterday's 90-day pause on U.S.-China tariffs has eased economic uncertainty, improving the odds of a future Federal Reserve rate cut—something long pushed for by President Donald Trump. However, most economists still expect the Fed to hold off on cuts until…",
    "link": "https://biztoc.com/x/b2b900fbd9ebc73d",
    "timestamp": "2025-05-13T10:28:10Z"
  },
  {
    "title": "MAGA Attacks Church Over Donald Trump Rebuke: 'Funds MUST Be Pulled'",
    "description": "The announcement comes just days after 49 South Africans arrived in the United States for resettlement under a fast-tracked refugee program.",
    "link": "https://biztoc.com/x/1b086a8297fd2105",
    "timestamp": "2025-05-13T10:27:50Z"
  },
  {
    "title": "Pope Leo XIV Drops Loaded, One-Word Message to United States",
    "description": "Pope Leo XIV dropped a loaded one-word message for the United States — and with his history of criticizing the Trump administration, the pontiff may not be done yet. As the newly elected, Chicago-born pope walked through a Vatican crowd Monday, NewsNation for…",
    "link": "https://www.mediaite.com/news/pope-leo-xiv-drops-loaded-one-word-message-to-united-states/",
    "timestamp": "2025-05-13T10:24:08Z"
  },
  {
    "title": "Transgender runner beats freshman girl by 0.15 seconds in 200-meter race at Pennsylvania high school meet",
    "description": "A senior transgender athlete, who identifies as a female, defeated a freshman in a girls' 200-meter race during a meet in Pennsylvania.",
    "link": "https://www.foxnews.com/sports/transgender-runner-beats-freshman-girl-0-15-seconds-200-meter-race-pennsylvania-high-school-meet",
    "timestamp": "2025-05-13T10:23:24Z"
  },
  {
    "title": "German Investors Cheered By Tariff Talks, New Government",
    "description": "German investor sentiment has jumped, buoyed by rollbacks of US tariffs, and the formation of a new national government, a closely-watched survey showed Tuesday.",
    "link": "https://www.ibtimes.com/german-investors-cheered-tariff-talks-new-government-3773355",
    "timestamp": "2025-05-13T10:23:23Z"
  },
  {
    "title": "MAGA Attacks Church Over Donald Trump Rebuke: 'Funds MUST Be Pulled'",
    "description": "The announcement comes just days after 49 South Africans arrived in the United States for resettlement under a fast-tracked refugee program.",
    "link": "https://www.newsweek.com/episcopal-church-south-africa-reguees-maga-2071393",
    "timestamp": "2025-05-13T10:21:58Z"
  },
  {
    "title": "Tesla's Model Y a flop? Investors express disappointment over Elon Musk's EV for two key reasons",
    "description": "Tesla's Model Y refresh faces weak demand despite attractive financing deals like 0% interest, raising concerns about sales. Increased competition, customer aversion to Elon Musk's politics, and readily available inventory contribute to the slowdown. Tesla is…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-teslas-model-y-a-flop-investors-express-disappointment-over-elon-musks-ev-for-two-key-reasons/articleshow/121137223.cms",
    "timestamp": "2025-05-13T10:19:23Z"
  },
  {
    "title": "California High-Speed Rail: Alex Padilla Defends Project Against Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCalifornia Senator Alex Padilla has hit back at the White House after President Donald Trump said that his administration would not give any more money to the state's high-speed rail project.\nPadilla branded T…",
    "link": "https://biztoc.com/x/90c1f87aad94dc47",
    "timestamp": "2025-05-13T10:16:59Z"
  },
  {
    "title": "California High-Speed Rail: Alex Padilla Defends Project Against Trump",
    "description": "California's high-speed rail project has drawn the ire of the White House, but the state's top lawmakers are saying the project should continue.",
    "link": "https://www.newsweek.com/california-high-speed-rail-donald-trump-alex-padilla-2071366",
    "timestamp": "2025-05-13T10:15:37Z"
  },
  {
    "title": "'Nothing sounds good': Tariff deal with China doesn't end uncertainty",
    "description": "Thea Brown, owner of toy store World of Mirth in Carytown, says challenges include her higher costs for imported merchandise, supply chain concerns, liquidity and storage.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_ede083aa-a3e7-4eab-8cc3-11e45612cb2b.html",
    "timestamp": "2025-05-13T10:15:00Z"
  },
  {
    "title": "In birthright citizenship case, US Supreme Court gets two controversies in one",
    "description": "(Reuters) -One of President Donald Trump's most contentious policies - his attempt to restrict automatic birthright citizenship - arrives at the U.S. Supreme Court this week with an unusual twist: The justices may focus on something else entirely.  Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/05/13/in-birthright-citizenship-case-us-supreme-court-gets-two-controversies-in-one",
    "timestamp": "2025-05-13T10:15:00Z"
  },
  {
    "title": "Trump administration's arrest of judge stirs debate over immigration courthouse arrests",
    "description": "WASHINGTON (Reuters) -The arrest of a Wisconsin state court judge for allegedly helping a migrant evade U.S. authorities marks another salvo in a long-brewing debate about the presence of immigration agents in local courthouses. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/13/trump-administration039s-arrest-of-judge-stirs-debate-over-immigration-courthouse-arrests",
    "timestamp": "2025-05-13T10:15:00Z"
  },
  {
    "title": "Will Putin attend Ukraine peace talks in Turkey? Kremlin declines comment for now",
    "description": "Russia will announce who is attending proposed peace talks in Turkey on ending the war in Ukraine when President Vladimir Putin sees fit to, the Kremlin said...",
    "link": "https://www.yahoo.com/news/putin-attend-ukraine-peace-talks-101314820.html",
    "timestamp": "2025-05-13T10:13:14Z"
  },
  {
    "title": "Trump Arrives at US-Saudi Leaders' Summit Location",
    "description": "US President Donald Trump arrived at the official workplace and residence of the King of Saudi Arabia, Al-Yamamah Palace, ...",
    "link": "https://biztoc.com/x/eb5a3528cd25ce5c",
    "timestamp": "2025-05-13T10:11:08Z"
  },
  {
    "title": "China-US Truce Prompts Price Jump in Pacific Shipping Frenzy",
    "description": "A China-US deal to slash trade tariffs is set to push freight rates higher, as companies rush to use a 90-day grace period to ferry goods across the Pacific Ocean.",
    "link": "https://gcaptain.com/china-us-truce-prompts-price-jump-in-pacific-shipping-frenzy/",
    "timestamp": "2025-05-13T10:10:51Z"
  },
  {
    "title": "Saudi fighter jets escort Air Force One as Trump arrives to meet crown prince",
    "description": "Saudi F-15 fighter jets escorted Air Force One as U.S. President Donald Trump landed in Saudi Arabia on Tuesday for his first major international visit of his second term.",
    "link": "https://www.foxnews.com/politics/saudi-fighter-jets-escort-air-force-one-trump-arrives-meet-crown-prince",
    "timestamp": "2025-05-13T10:09:26Z"
  },
  {
    "title": "Trump kicks off Mideast tour with high-profile arrival in Saudi Arabia",
    "description": "US President Donald Trump to meet Saudi leaders, discuss Gaza and Iran, and receive luxury Boeing jet gift during regional visit.",
    "link": "https://www.israelnationalnews.com/news/408277",
    "timestamp": "2025-05-13T10:07:22Z"
  },
  {
    "title": "Analysis-Banking sector says easing of US leverage rules could support Treasury market",
    "description": "WASHINGTON/NEW YORK (Reuters) -The banking industry is optimistic that U.S. regulators will soon move to change how much capital they set aside against...",
    "link": "https://finance.yahoo.com/news/analysis-banking-sector-says-easing-100650509.html",
    "timestamp": "2025-05-13T10:06:50Z"
  },
  {
    "title": "Trump wants to slash prescription drug prices in US. What it means for your pharmacy bill",
    "description": "Donald Trump has signed a wide-reaching executive order on Monday directing drugmakers to lower the prices of their medicines to align with what other countries pay that analysts and legal experts said would be difficult to implement.The order gives drugmaker…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-to-slash-prescription-drug-prices-in-us-what-it-means-for-your-pharmacy-bill/articleshow/121136515.cms",
    "timestamp": "2025-05-13T10:06:43Z"
  },
  {
    "title": "World shares make modest gains as euphoria over China-US trade truce wavers",
    "description": "Shares have logged modest gains in most world markets as the initial euphoria over the 90-day truce in the trade war between the United States and China fades",
    "link": "https://abcnews.go.com/Business/wireStory/world-shares-make-modest-gains-euphoria-china-us-121735164",
    "timestamp": "2025-05-13T10:06:19Z"
  },
  {
    "title": "Tuesday, May 13. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine. Day 1,175.",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/05/13/tuesday-may-13-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-05-13T10:06:03Z"
  },
  {
    "title": "Pakistan says 51 killed in India clashes last week",
    "description": "ISLAMABAD: Pakistan's army announced on Tuesday (May 13) a new death toll of 40 civilians and 11 military service members killed last week in the worst confrontation with India in decades. The",
    "link": "https://www.channelnewsasia.com/asia/pakistan-51-killed-india-clash-kashmir-5126516",
    "timestamp": "2025-05-13T10:05:44Z"
  },
  {
    "title": "Trump picked a wellness influencer to be surgeon general and it’s breaking MAHA brains",
    "description": ", a wellness influencer, at confirmation hearing for Robert F. Kennedy Jr. for the Secretary of Health and Human Services. | Ben Curtis/AP Photo\nThe Make America Healthy Again movement’s infiltration of federal health policy took another step forward last wee…",
    "link": "https://biztoc.com/x/970d5f2d4b46b4a8",
    "timestamp": "2025-05-13T10:05:38Z"
  },
  {
    "title": "Trump heads to Middle East amid crises in Gaza, Iran and India-Pakistan, but insists: ‘This world is a lot safer today than it was a week ago’",
    "description": "President Donald Trump set out on a three-nation visit to the Middle East on Monday, a trip he had originally intended to use to focus on his efforts to press wealthy Gulf nations to pour billions in new investment into the United States.\nBut now Trump finds …",
    "link": "https://biztoc.com/x/0008b055ab500d69",
    "timestamp": "2025-05-13T10:05:31Z"
  },
  {
    "title": "Wall Street Journal Hits Trump With The Harsh Truth About His 'Golden Age' Boast",
    "description": "It's \"more leaden than golden,\" the newspaper's conservative editorial board wrote in a withering article.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-donald-trump-tariffs-backdown_n_68230084e4b0993b52becdc3",
    "timestamp": "2025-05-13T10:04:09Z"
  },
  {
    "title": "Jimmy Fallon’s Takeaway From Trump’s Jet Gift Is Like No Other",
    "description": "The “Tonight Show” host went in a surprising direction while riffing on Qatar’s aircraft offer to the president.",
    "link": "https://www.huffpost.com/entry/jimmy-fallon-donald-trump-jet-eventually-leave-officegift_n_68230d19e4b0abb583590b0d",
    "timestamp": "2025-05-13T10:02:04Z"
  },
  {
    "title": "William Watson: Free trade is being replaced by crony trade",
    "description": "Free trade lets producers and consumers decide whose products suit their needs best. Now prime ministers and presidents choose for them",
    "link": "https://financialpost.com/opinion/free-trade-replaced-crony-trade",
    "timestamp": "2025-05-13T10:00:49Z"
  },
  {
    "title": "MAGA who? Trump goes on a billionaire’s tour of palaces, planes, and payoffs",
    "description": "Donald Trump’s first major international trip of his second term isn’t to the U.K., France, Germany, Ukraine, or any of America’s long-standing allies or diplomatic partners or a country in need. No, Trump has jetted off to the Middle East, visiting three of …",
    "link": "https://www.advocate.com/voices/trump-palaces-planes-payoffs",
    "timestamp": "2025-05-13T10:00:03Z"
  },
  {
    "title": "Unusual gifts received by US presidents include a gold snuff box, giant pandas, elephant tusks and personalized rugs",
    "description": "A robe lined with cheetah fur, 300 pounds of raw lamb and other unusual gifts given by foreign governments to US leaders.",
    "link": "https://nypost.com/2025/05/13/us-news/us-leaders-received-elaborate-gifts-throughout-countrys-history/",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "Knives out for Fetterman: Maverick senator joins long line of Dems punished for breaking from left",
    "description": "Sen. John Fetterman, D-Pa., has bucked the Democratic Party on key issues since assuming office in 2022.",
    "link": "https://www.foxnews.com/politics/knives-out-fetterman-maverick-senator-joins-long-line-dems-punished-breaking-from-left",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "The art of Trump’s incredibly dubious Qatar jumbo jet ‘deal’",
    "description": "Trump is preparing to accept a gift 747 jet from Qatar — despite its apparent violation of the Constitution's emoluments clause.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/qatar-trump-jet-gift-plane-corrupt-newsletter-rcna206330",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "How “conservatives” became radicals — and learned to love big government",
    "description": "So much for drowning government in the bathtub: Today's right wants to make it big enough to drown us",
    "link": "https://salon.com/2025/05/13/how-conservatives-became-radicals-and-learned-to-love-big-government/",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "No evidence Trump's mother called him 'an idiot' who would be 'a disaster' in politics",
    "description": "The alleged quote from Trump’s mom has circulated online for years.",
    "link": "https://www.snopes.com//news/2025/05/13/trump-quotes-mother-politics/",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "How an Election Denier Became the U.S. Treasurer",
    "description": "Brandon Beach was a state senator in Georgia who got involved in Trump’s attempt to overturn the 2020 election results. Now his name will be on our money.",
    "link": "https://www.newyorker.com/news/the-lede/how-an-election-denier-became-the-us-treasurer",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "The Department of Education Forced Idaho to Stop Denying Disabled Students an Education. Then Trump Gutted Its Staff.",
    "description": "by Becca Savransky, Idaho Statesman \n \n\n \n This article was produced for ProPublica’s Local Reporting Network in partnership with the Idaho Statesman. Sign up for Dispatches to get our stories in your inbox every week.\n\n \n\n \n \n \n\n\n\n \nTime and again, the U.S. …",
    "link": "https://www.propublica.org/article/department-of-education-idaho-students-disabilities-trump",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "Trump keeps creating trade problems to (badly) solve",
    "description": "A deal between the U.S. and China to lower tariffs is not the major win that Donald Trump would claim. Nor is the trade agreement with the United Kingdom.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-trade-tariffs-china-uk-rcna206282",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "How “conservatives” became radicals — and learned to love big government",
    "description": "So much for drowning government in the bathtub: Today's right wants to make it big enough to drown us",
    "link": "https://www.salon.com/2025/05/13/how-conservatives-became-radicals-and-learned-to-love-big-government/",
    "timestamp": "2025-05-13T10:00:00Z"
  },
  {
    "title": "Jon Stewart Rips Trump’s Plan to Accept $400M ‘Foreign, Flying F*ck Palace’ From Qatar",
    "description": "The Daily Show host Jon Stewart tore into President Donald Trump's plan to accept a $400 million \"flying f*ck palace\" from the state of Qatar on Monday.\nThe post Jon Stewart Rips Trump’s Plan to Accept $400M ‘Foreign, Flying F*ck Palace’ From Qatar first appe…",
    "link": "https://www.mediaite.com/tv/jon-stewart-rips-trumps-plan-to-accept-400m-foreign-flying-fck-palace-from-qatar/",
    "timestamp": "2025-05-13T09:56:21Z"
  },
  {
    "title": "China’s Xi Jinping urges countries to ‘stand united’ in face of global trade war",
    "description": "The Chinese leader's call for unity was heard by representatives of more than 30 Latin American and Caribbean nations in Beijing Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/13/chinas-xi-jinping-urges-countries-to-stand-united-in-face-of-global-trade-war",
    "timestamp": "2025-05-13T09:55:00Z"
  },
  {
    "title": "Trump Arrives In Saudi Arabia To Kick Off Middle East Trip: Here’s What To Know",
    "description": "American tech and finance CEOs, including Elon Musk, are also expected to be in Saudi Arabia for a government-hosted conference Trump is scheduled to attend as part of his visit.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/13/trump-arrives-in-saudi-arabia-to-kick-off-middle-east-trip-heres-what-to-know/",
    "timestamp": "2025-05-13T09:54:49Z"
  },
  {
    "title": "Texas ICE Agents Apprehend Over 400 Migrants in Massive Operation",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFederal immigration authorities have apprehended 422 undocumented immigrants during a weeklong operation in Houston.\nWhy It Matters\nPresident Donald Trump won the 2024 election with immigration at the forefron…",
    "link": "https://biztoc.com/x/d0226b1e7b5024bd",
    "timestamp": "2025-05-13T09:54:48Z"
  },
  {
    "title": "US Stocks Likely To Open Lower After A Strong Rally: 'Lows Are Likely In And Better Times Are Coming,' Says Expert",
    "description": "U.S. stock futures fell on Tuesday after a stellar rally on Monday. Futures of major benchmark indices were trading lower in premarket.\nTech, consumer discretionary, and communication services led Monday’s rally as stocks surged on the tariff truce with China…",
    "link": "https://biztoc.com/x/d380ba18a0c1dc74",
    "timestamp": "2025-05-13T09:54:22Z"
  },
  {
    "title": "A free plane? Trump's Air Force One plan could be an expensive 'security nightmare.'",
    "description": "US President Donald Trump steps off Air Force One, a special aircraft he wants to temporarily replace with a gifted luxury jetliner from Qatar.\nROBERTO SCHMIDT/AFP via Getty Images\nThe Trump administration is set to receive a luxury 747 jet from Qatar's royal…",
    "link": "https://biztoc.com/x/d1ac7bbe4add6ba4",
    "timestamp": "2025-05-13T09:54:16Z"
  },
  {
    "title": "Investment banks lift China growth outlook after surprise trade deal with U.S. - CNBC",
    "description": "Investment banks lift China growth outlook after surprise trade deal with U.S.CNBC Dow soars 1,100 points after Trump team and China dramatically lower tariffsCNN China cautiously welcomes pause in US tariff warThe Guardian Fact Sheet: President Donald J. Tru…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177482447",
    "timestamp": "2025-05-13T09:53:05Z"
  },
  {
    "title": "Texas ICE Agents Apprehend Over 400 Migrants in Massive Operation",
    "description": "As part of the operation, authorities apprehended a 40-year-old Mexican national who had been deported on two prior occasions.",
    "link": "https://www.newsweek.com/texas-ice-houston-migrants-arrested-2071378",
    "timestamp": "2025-05-13T09:51:04Z"
  },
  {
    "title": "Zelensky Throws Down the Gauntlet to Putin",
    "description": "Putin has not yet answered Zelensky's call for a face-to-face meeting in Turkey, which Trump is calling for.",
    "link": "https://www.newsweek.com/zelensky-throws-down-gauntlet-putin-2071435",
    "timestamp": "2025-05-13T09:49:52Z"
  },
  {
    "title": "Republicans Are Breaking With Trump Over Qatar Plane",
    "description": "Some members of the GOP have expressed concerns about the president accepting a jet as a present.",
    "link": "https://www.newsweek.com/trump-qatar-plane-air-force-one-repubicans-2071353",
    "timestamp": "2025-05-13T09:46:08Z"
  },
  {
    "title": "US stock futures down as trade truce rally fades, inflation data in focus",
    "description": "April consumer price inflation (CPI) is due at 8:30 a.m. ET, with economists polled by Reuters expecting a 0.3% monthly rise and an annual rate holding...",
    "link": "https://ca.finance.yahoo.com/news/us-stock-futures-down-trade-094525082.html",
    "timestamp": "2025-05-13T09:45:25Z"
  },
  {
    "title": "A free plane? Trump's Air Force One plan could be an expensive 'security nightmare.'",
    "description": "Security experts told BI that the work required to make a plane from Qatar ready to be Air Force One would be like building a new plane.",
    "link": "https://www.businessinsider.com/trump-qatar-air-force-one-security-concerns-2025-5",
    "timestamp": "2025-05-13T09:45:01Z"
  },
  {
    "title": "“Almost a Gestapo nation”: When ICE seized the mayor, his city showed up",
    "description": "Masked, armed federal agents arrested the mayor of Newark for doing his job — and citizens said no",
    "link": "https://salon.com/2025/05/13/almost-a-gestapo-nation-when-ice-seized-the-mayor-his-city-showed-up_partner/",
    "timestamp": "2025-05-13T09:45:00Z"
  },
  {
    "title": "Truth Social memecoin rumors denied by Trump Jr despite the First Family increasing crypto expansion",
    "description": "Truth Social, the social media platform backed by US President Donald Trump, has no plan to launch a memecoin. On May 13, Donald Trump Jr., the US President’s son, dismissed the claims outright, stating: “There’s no truth whatsoever about Truth Social launchi…",
    "link": "https://cryptoslate.com/truth-social-memecoin-rumors-denied-by-trump-jr-despite-the-first-family-increasing-crypto-expansion/",
    "timestamp": "2025-05-13T09:43:54Z"
  },
  {
    "title": "Trump arrives in Saudi Arabia for Middle East tour trying to demonstrate that his transactional strategy for international politics is paying dividends",
    "description": "President Donald Trump opened his four-day Mideast trip on Tuesday by paying a visit to Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, for talks on U.S. efforts to dismantle Iran's nuclear program, end the war in Gaza, hold down oil prices a…",
    "link": "https://biztoc.com/x/d462d0f2ac138030",
    "timestamp": "2025-05-13T09:43:39Z"
  },
  {
    "title": "Trump blames ‘brutal’ Europe for soaring drug costs in bid to curb U.S. prices",
    "description": "US President Donald Trump said Monday he would slash drug prices so they match those abroad, accusing Europe in particular of practices that force up prices for Americans.\nRepublican Trump claimed as he signed the executive order at the White House that drug …",
    "link": "https://biztoc.com/x/2a99c99b3bb1d9ef",
    "timestamp": "2025-05-13T09:43:37Z"
  },
  {
    "title": "House GOP plows ahead with efforts to cut $880 billion despite internal differences",
    "description": "House GOP plows ahead to advance key components of its bill to fund Trump’s agenda -- including taxes and Medicaid cuts -- even as they remain at odds within.",
    "link": "https://abcnews.go.com/Politics/house-gop-plows-ahead-efforts-cut-880-billion/story?id=121716373",
    "timestamp": "2025-05-13T09:42:49Z"
  },
  {
    "title": "Trump criticizes Biden admin's 'reckless, soft-on-crime policies' while announcing National Police Week",
    "description": "President Donald Trump declared May 11 through May 17 as National Police Week and Peace Officers Memorial Day as its typical date of May 15.",
    "link": "https://www.foxnews.com/politics/trump-criticizes-biden-admins-reckless-soft-on-crime-policies-announcing-national-police-week",
    "timestamp": "2025-05-13T09:42:34Z"
  },
  {
    "title": "Modi Has Changed India’s Military Doctrine",
    "description": "After a terrorist attack in Kashmir, everyone knew that India would retaliate. Nobody quite understood how.",
    "link": "http://foreignpolicy.com/2025/05/13/modi-has-changed-indias-military-doctrine/",
    "timestamp": "2025-05-13T09:41:57Z"
  },
  {
    "title": "The Supreme Court’s Radical Right Turn Is About Restoring Patriarchy, Plain and Simple",
    "description": "Overruling Roe was just the opening salvo in this fight, which has raged ever since and only been exacerbated by Donald Trump’s return to the White House.",
    "link": "https://slate.com/news-and-politics/2025/05/leah-litman-lawless-supreme-courts-alito-news.html",
    "timestamp": "2025-05-13T09:40:00Z"
  },
  {
    "title": "Global Stocks Recoup Tariff Losses; President Trump Visits Saudi Arabia",
    "description": "On today's podcast:  1) The Wall Street stocks rally is set to pause due to concerns about inflation and economic growth, with US futures pointing to a decline. Investors are taking a breather after the 90-day tariff cool-off between the US and China, and wil…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/global-stocks-recoup-tariff-losses-president-trump-visits-saudi-arabia",
    "timestamp": "2025-05-13T09:38:50Z"
  },
  {
    "title": "Smartworld, Tribeca sell all 298 homes for Rs 3,250 cr in 'Trump-branded' project at Gurugram",
    "description": "Smartworld Developers and Tribeca Developers achieved a complete sell-out of the 'Trump Residences Gurgaon' on launch day, generating Rs 3,250 crore in sales. The ultra-luxury residential project, featuring 298 units priced between Rs 8 crore and Rs 15 crore,…",
    "link": "https://economictimes.indiatimes.com/industry/services/property-/-cstruction/smartworld-tribeca-sell-all-298-homes-for-rs-3250-cr-in-trump-branded-project-at-gurugram/articleshow/121135981.cms",
    "timestamp": "2025-05-13T09:36:25Z"
  },
  {
    "title": "Kurdish leader Ocalan told the PKK to disband, it did: Here’s what to know",
    "description": "PKK leader Abdullah Ocalan is leading peace efforts to end a Kurdish armed rebellion against Turkiye after four decades.",
    "link": "https://www.aljazeera.com/news/2025/5/13/kurdish-leader-ocalan-told-the-pkk-to-disband-it-did-heres-what-to-know",
    "timestamp": "2025-05-13T09:35:35Z"
  },
  {
    "title": "Dozens of White South Africans arrive in US under Trump refugee plan",
    "description": "A group of 59 white South Africans has arrived in the US, where they are to be granted refugee status. President Donald Trump has said the refugee applications for the country's Afrikaner minority had been expedited as they were victims of \"racial discriminat…",
    "link": "https://freerepublic.com/focus/f-news/4316650/posts",
    "timestamp": "2025-05-13T09:35:33Z"
  },
  {
    "title": "Roger Federer-backed On raises annual sales forecast as promotions, new launches fuel demand",
    "description": "By Ananya Mariam Rajesh and Neil J Kanatt\n(Reuters) -Roger Federer-backed On Holding raised its annual sales forecast on Tuesday and said it would have to undertake selective pricing to mitigate impacts from U.S. President Donald Trump's tariffs.\nThe Trump ad…",
    "link": "https://biztoc.com/x/13395313eb2229ab",
    "timestamp": "2025-05-13T09:32:35Z"
  }
]