[
  {
    "title": "Key US-Russia nuclear pact difficult to replace – Kremlin",
    "description": "Russia and the US would have a hard time replacing the New START Treaty, which caps the number of nuclear weapons, the Kremlin has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631717-new-start-difficult-replace/",
    "timestamp": "2026-01-29T14:08:10Z"
  },
  {
    "title": "Selected Articles: Exclusive: Leaked “Board of Peace” Resolution Outlines U.S.-Led Plan to Rule Over Gaza",
    "description": "Exclusive: Leaked “Board of Peace” Resolution Outlines U.S.-Led Plan to Rule Over Gaza\nBy Jonathan Whittall, January 28, 2026\nThe so-called Board of Peace that President Donald Trump officially launched in Davos, Switzerland last week is developing sweeping p…",
    "link": "https://www.globalresearch.ca/selected-articles-leaked-board-peace-resolution-us-plan-rule-gaza/5914126",
    "timestamp": "2026-01-29T14:06:28Z"
  },
  {
    "title": "Trump’s border tzar says ‘improvements’ are being made to Ice operations in Minneapolis",
    "description": "Donald Trump says he wants to ‘de-escalate’ tension after fatal shootings",
    "link": "https://www.irishtimes.com/world/us/2026/01/29/trumps-border-tzar-says-improvements-are-being-made-to-ice-operations-in-minneapolis/",
    "timestamp": "2026-01-29T14:05:35Z"
  },
  {
    "title": "Trump Erupts at GOPers over Kristi Noem as Her Support Suddenly Slips (New Republic)",
    "description": "New Republic:\nTrump Erupts at GOPers over Kristi Noem as Her Support Suddenly Slips  —  GOP Senators Thom Tillis and Lisa Murkowski have now called for the resignation of Homeland Security Secretary Kristi Noem.  This angered Donald Trump, who lashed out at t…",
    "link": "https://www.memeorandum.com/260129/p36",
    "timestamp": "2026-01-29T14:05:01Z"
  },
  {
    "title": "Trump Border Czar Tom Homan Announces ‘Drawdown Plan’ in Minnesota",
    "description": "Homan said meetings with Minnesotan authorities would bring about “agreements” he said would allow ICE to reduce the number of personnel deployed in the state.\nThe post Trump Border Czar Tom Homan Announces ‘Drawdown Plan’ in Minnesota first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/trump-border-czar-tom-homan-announces-drawdown-plan-in-minnesota/",
    "timestamp": "2026-01-29T14:03:38Z"
  },
  {
    "title": "EXCLUSIVE: Senate bill targets Minnesota-style ‘runaway fraud’ to force scammers repay taxpayers",
    "description": "Sen. Joni Ernst's new bill would create early-warning systems for federal fraud, require documented attendance for child care payments, and mandate recovery of improper payments.",
    "link": "https://www.foxnews.com/politics/exclusive-senate-bill-targets-minnesota-style-runaway-fraud-force-scammers-repay-taxpayers",
    "timestamp": "2026-01-29T14:00:42Z"
  },
  {
    "title": "Bernie Sanders praises Trump's job on securing border [Oct. 2025]",
    "description": "Senator Bernie Sanders acknowledged in a recent podcast interview that President Donald Trump performed better than former President Joe Biden in securing the U.S.-Mexico border. “If you don’t have any borders, you don’t have a nation,” Sanders, a Vermont ind…",
    "link": "https://freerepublic.com/focus/f-chat/4364511/posts",
    "timestamp": "2026-01-29T14:00:32Z"
  },
  {
    "title": "Ohio’s Haitians Made Headlines in 2024 Election, But Will They Head Home in 2026?",
    "description": "The town of Springfield, Ohio, unexpectedly found itself in the national spotlight in the lead-up to the 2024 presidential election. At question was the town’s... Read More\nThe post Ohio’s Haitians Made Headlines in 2024 Election, But Will They Head Home in 2…",
    "link": "https://www.dailysignal.com/2026/01/29/ohios-haitians-made-headlines-in-2024-election-but-will-they-head-home-in-2026/",
    "timestamp": "2026-01-29T14:00:00Z"
  },
  {
    "title": "Who Takes Palantir’s Money? A New Tracker Finds Out.",
    "description": "As the Trump administration continues to violently occupy Minnesota, the role of the defense tech firm Palantir—which continues to sell its data mining, automation, and surveillance technology to ICE—is coming under increasing scrutiny. A new tool, launched T…",
    "link": "https://www.motherjones.com/politics/2026/01/purge-palantir-donation-tracker-ice-congress/",
    "timestamp": "2026-01-29T14:00:00Z"
  },
  {
    "title": "Nicki Minaj Flaunts 'Free' Trump Gold Card After Celebrating President",
    "description": "Nicki Minaj is apparently one step closer to becoming an American citizen ... and is flaunting her new Trump Gold Card to prove it -- which she hinted she got at no charge! Check out her tweets from Wednesday -- the Trinidad-born rapper posted a…\n Permalink",
    "link": "https://www.tmz.com/2026/01/29/nicki-minaj-free-trump-gold-card-citizenship/",
    "timestamp": "2026-01-29T13:57:51Z"
  },
  {
    "title": "Ilhan Omar Hits Back at Trump Attacks on CNN With Hard Shot at His Cognitive Skills",
    "description": "Kaitlan Collins drew a sharp response from Rep. Ilhan Omar (D-MN) over Trump's recent attacks suggesting she orchestrated an assault on herself.\nThe post Ilhan Omar Hits Back at Trump Attacks on CNN With Hard Shot at His Cognitive Skills first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/ilhan-omar-hits-back-at-trump-attacks-on-cnn-with-hard-shot-at-his-cognitive-skills/",
    "timestamp": "2026-01-29T13:56:54Z"
  },
  {
    "title": "Tesla revenue falls for first time as Musk bets big on robots and autonomy",
    "description": "Elon thinks taxis and androids will succeed where car sales are stalling\nTesla reported 2025 revenue of $94.8 billion, down 3 percent year-on-year and marking the first annual revenue decline since the electric car maker began publishing financial results in …",
    "link": "https://www.theregister.com/2026/01/29/tesla_revenue_drop/",
    "timestamp": "2026-01-29T13:56:01Z"
  },
  {
    "title": "Elon Musk is betting Tesla’s future isn’t about cars at all | CNN Business",
    "description": "Tesla dominated the electric vehicle industry by the mid-2010s with sleek, fast cars that helped combat the public perception that EVs were severely limited by short ranges.",
    "link": "https://www.cnn.com/business/tech/elon-musk-tesla-risk-takers",
    "timestamp": "2026-01-29T13:54:25Z"
  },
  {
    "title": "British PM Starmer says 'really good progress' made in China talks on trade, travel issues",
    "description": "The leaders of Britain and China called Thursday for a \"strategic partnership\" to deepen ties between their nations at a time of growing global turbulence as they sought to thaw relations after years of chill.",
    "link": "https://www.cbc.ca/news/world/beijing-china-uk-starmer-jinping-9.7066150",
    "timestamp": "2026-01-29T13:53:12Z"
  },
  {
    "title": "Trump mulling new Iran strikes – media",
    "description": "US President Donald Trump is reportedly weighing military action against Iran to inspire protests and create conditions for regime change Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631714-trump-iran-new-strikes/",
    "timestamp": "2026-01-29T13:53:04Z"
  },
  {
    "title": "Tariff war cost Canadian Pacific $200M over past year, CEO says",
    "description": "Canadian Pacific Kansas City Ltd. has suffered a $200-million blow from the ongoing tariff war set off by the United States, said CEO Keith Creel.",
    "link": "https://www.cbc.ca/news/canada/calgary/tariff-war-cost-canadian-pacific-200m-over-past-year-ceo-says-9.7066062",
    "timestamp": "2026-01-29T13:52:55Z"
  },
  {
    "title": "No treaty, no rules? What the expiration of New START means for deterrence, transparency, and global order",
    "description": "Why the collapse of the US-Russia arms control framework is more about transparency and missile defense than a new arms race Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631664-end-of-last-nuclear-arms-treaty/",
    "timestamp": "2026-01-29T13:49:28Z"
  },
  {
    "title": "Bruce Springsteen sings out against President Donald Trump in new song, 'Streets of Minneapolis'",
    "description": "Bruce Springsteen is dedicating his new song to the people of Minneapolis, criticizing President Donald Trump's ongoing immigration enforcement operations in the city.",
    "link": "https://6abc.com/post/bruce-springsteen-sings-president-donald-trump-new-song-streets-minneapolis/18500061/",
    "timestamp": "2026-01-29T13:40:30Z"
  },
  {
    "title": "Top Canada CEOs’ Group Questions Carney’s Strategy With Trump",
    "description": "The head of an organization that represents Canadian chief executives questioned Mark Carney’s handling of the relationship with the White House, calling on the prime minister to focus on salvaging the North American trade pact.",
    "link": "https://financialpost.com/pmn/business-pmn/top-canada-ceos-group-questions-carneys-strategy-with-trump",
    "timestamp": "2026-01-29T13:39:27Z"
  },
  {
    "title": "Business Council CEO questions Carney's strategy with Trump",
    "description": "Goldy Hyder, head of the Business Council of Canada, questioned Mark Carney’s handling of the relationship with the U.S. Read more here",
    "link": "https://financialpost.com/news/economy/business-council-canada-questions-carney-trump-strategy",
    "timestamp": "2026-01-29T13:39:27Z"
  },
  {
    "title": "Kremlin says Russia has invited Ukraine’s Zelenskiy to come to Moscow for peace talks",
    "description": "By Dmitry Antonov and Andrew OsbornMOSCOW, Jan 29 (Reuters) - The Kremlin said on Thursday that Russia had reiterated its invitation for Ukrainian President Volodymyr Zel… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/kremlin-says-russia-has-invited-ukraine-s-zelenskiy-to-come-to-moscow-for-peace-talks",
    "timestamp": "2026-01-29T13:37:21Z"
  },
  {
    "title": "Where is my refund? Tax filing deadline, IRS refund status, and all details Americans must know",
    "description": "Where is my refund? IRS opens 2026 tax filing season as Americans track payments, deadlines, and federal shake-ups. The IRS officially opened the 2026 tax season on January 26. Taxpayers have until April 15, 2026, to file returns for approximately 164 million…",
    "link": "https://economictimes.indiatimes.com/news/international/us/where-is-my-refund-tax-filing-deadline-irs-refund-status-and-all-details-americans-must-know/articleshow/127777407.cms",
    "timestamp": "2026-01-29T13:37:08Z"
  },
  {
    "title": "Iran rounds up thousands in mass arrest campaign after crushing unrest, sources say",
    "description": "By Parisa HafeziDUBAI, Jan 29 (Reuters) - Plainclothes Iranian security forces have rounded up thousands of people in a campaign of mass arrests and intimidation to deter… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/iran-rounds-up-thousands-in-mass-arrest-campaign-after-crushing-unrest-sources-say",
    "timestamp": "2026-01-29T13:36:50Z"
  },
  {
    "title": "Sen. Susan Collins announces end to ICE large-scale operations in Maine after talks with Noem",
    "description": "Collins has urged the administration to reconsider its approach to immigration enforcement.",
    "link": "https://www.bostonherald.com/2026/01/29/ice-ends-maine-large-operations/",
    "timestamp": "2026-01-29T13:36:42Z"
  },
  {
    "title": "Tim Walz Details 'Strange' Comparison Trump Made In Their Phone Call",
    "description": "The Minnesota governor's chat with the president took an unexpected turn.",
    "link": "https://www.huffpost.com/entry/tim-walz-venezuela-donald-trump-phone-call_n_697b479de4b0a7a321381d80",
    "timestamp": "2026-01-29T13:32:37Z"
  },
  {
    "title": "Border czar Tom Homan vows to stay in Minnesota 'until the problem's gone'",
    "description": "White House border czar Tom Homan announced new cooperation from Minnesota law enforcement after President Donald Trump deployed him to the Twin Cities.",
    "link": "https://www.foxnews.com/politics/border-czar-tom-homan-vows-stay-minnesota-until-problems-gone",
    "timestamp": "2026-01-29T13:32:16Z"
  },
  {
    "title": "Did You Catch the Fatal Flaw in Obama’s Comments on the Pretti Death? It’s a Whopper That Even He Can’t Get Away With",
    "description": "Saturday’s fatal of shooting of 37-year-old Alex Pretti by Border Patrol officers in Minneapolis, Minnesota, has prompted former President Barack Obama to weigh in.\nThe post Did You Catch the Fatal Flaw in Obama’s Comments on the Pretti Death? It’s a Whopper …",
    "link": "https://www.thegatewaypundit.com/2026/01/catch-fatal-flaw-obamas-comments-pretti-death-whopper/",
    "timestamp": "2026-01-29T13:30:32Z"
  },
  {
    "title": "Melania Trump Doc Pulled From Theaters in South Africa",
    "description": "Melania Trump’s much-discussed documentary will not be shown in South African cinemas. According to the New York Times, “Melania” — scheduled to open worldwide on Friday and already a highly contentious film — has been pulled from theaters in the country by t…",
    "link": "https://variety.com/2026/film/global/melania-trump-doc-pulled-from-theaters-south-africa-1236644338/",
    "timestamp": "2026-01-29T13:28:13Z"
  },
  {
    "title": "‘Climate of fear’: ICE violence in Minnesota forces CEOs to weigh the risks of speaking out against Trump",
    "description": "Minneapolis has become the testing ground for when and how far corporate leaders will wade into escalating political tensions.",
    "link": "https://www.cnbc.com/2026/01/29/trump-minnesota-ice-action-ceos-speaking-out.html",
    "timestamp": "2026-01-29T13:25:01Z"
  },
  {
    "title": "‘This Has Got to End’",
    "description": "Tim Walz on the “all-out attack on all of state government”",
    "link": "https://www.theatlantic.com/podcasts/2026/01/tim-walz-minnesota-immigration/685803/",
    "timestamp": "2026-01-29T13:25:00Z"
  },
  {
    "title": "Trump rages at his own 'moron' appointee  in early-morning rant: 'Hurting our country'",
    "description": "President Donald Trump hammered an early morning screed attacking Federal Reserve Chairman Jerome Powell.The central bank held interest rates steady on Wednesday despite Trump's public pressure on Powell – who claims a criminal probe against him by Trump ally…",
    "link": "https://www.rawstory.com/jerome-powell-inflation-2675058152/",
    "timestamp": "2026-01-29T13:24:25Z"
  },
  {
    "title": "Oil prices rise more than 2% as Trump weighs strikes on Iran",
    "description": "Multiple sources told Reuters that Trump is weighing targeted strikes on Iranian security forces and leaders to inspire protestors.",
    "link": "https://www.cnbc.com/2026/01/29/oil-prices-rise-more-than-2percent-as-trump-weighs-strikes-on-iran.html",
    "timestamp": "2026-01-29T13:24:06Z"
  },
  {
    "title": "Fed Holds Interest Rates Steady Despite Pressure From Trump",
    "description": "The Federal Reserve voted on Wednesday to hold interest rates steady, resisting intense pressure from President Donald Trump to lower those rates. The move comes as Fed Chair Jerome Powell is facing a criminal investigation launched by federal prosecutors. NB…",
    "link": "https://www.today.com/video/fed-holds-interest-rates-steady-despite-pressure-from-trump-256798277658",
    "timestamp": "2026-01-29T13:22:57Z"
  },
  {
    "title": "EU preparing to blacklist Iran’s Revolutionary Guard as a terrorist organisation",
    "description": "Diplomatic channels in Iran expected to remain open despite designation of regime’s key enforcer as a terrorist outfit",
    "link": "https://www.irishtimes.com/world/2026/01/29/eu-preparing-to-blacklist-irans-revolutionary-guard-as-a-terrorist-organisation/",
    "timestamp": "2026-01-29T13:20:37Z"
  },
  {
    "title": "Trump Claims US Should Pay World’s ‘LOWEST’ Interest Rates After Fed Paused Cuts",
    "description": "“The Fed should substantially lower interest rates, NOW!” Trump wrote.",
    "link": "https://www.forbes.com/sites/tylerroush/2026/01/29/trump-claims-us-should-pay-worlds-lowest-interest-rates-after-fed-paused-cuts/",
    "timestamp": "2026-01-29T13:20:09Z"
  },
  {
    "title": "Growing cultural revolt emerging against Trump's immigration policies",
    "description": "President Donald Trump is facing a growing cultural revolt against his immigration crackdown",
    "link": "https://www.wsbtv.com/news/business/trump-facing-growing/QWGFF7KN2M6A3J74EOR5SNSX5E/",
    "timestamp": "2026-01-29T13:20:04Z"
  },
  {
    "title": "Second elderly South Carolina woman dead from hypothermia in winter storm",
    "description": "South Carolina confirms second hypothermia death from winter storm as 83-year-old woman dies in Lexington County. More extreme weather threatens the state.",
    "link": "https://www.foxnews.com/us/second-elderly-south-carolina-woman-dead-from-hypothermia-winter-storm",
    "timestamp": "2026-01-29T13:19:29Z"
  },
  {
    "title": "Starmer picks a side when asked about Carney's Davos speech: 'I’m a British pragmatist applying common sense'",
    "description": "Here's all that's happened since the Canadian PM took the stage in Davos",
    "link": "https://nationalpost.com/news/canada/carney-davos-speech-world-leaders",
    "timestamp": "2026-01-29T13:18:51Z"
  },
  {
    "title": "America is falling behind in the global EV race – that’s going to cost the US auto industry",
    "description": "Electric vehicles are a fast-growing share of auto sales in many countries, and Chinese automakers are benefiting as the US industry pulls back.",
    "link": "https://theconversation.com/america-is-falling-behind-in-the-global-ev-race-thats-going-to-cost-the-us-auto-industry-274422",
    "timestamp": "2026-01-29T13:18:22Z"
  },
  {
    "title": "Footage from Mar-a-Lago shows dancers and champagne moments after Alex Pretti was fatally shot",
    "description": "Videos of a glamorous Mar-a-Lago party spread rapidly online after coinciding with the killing of Alex Pretti in Minneapolis. The timing ignited outrage as users contrasted luxury festivities with clips of the fatal shooting. Shared footage showed performers,…",
    "link": "https://economictimes.indiatimes.com/news/international/us/footage-from-mar-a-lago-shows-dancers-and-champagne-moments-after-alex-pretti-was-fatally-shot/articleshow/127776947.cms",
    "timestamp": "2026-01-29T13:17:53Z"
  },
  {
    "title": "Military head warns Trump may carry out 'forever-war' despite having ability to end it",
    "description": "A top US military official has warned Donald Trump may prolong the end of the war in Ukraine. Colonel Jonathan Sweet explained how the president could bring the conflict between Russian and Ukraine to an end, but that it would rely on military intervention an…",
    "link": "https://www.rawstory.com/trump-military-2675057976/",
    "timestamp": "2026-01-29T13:17:06Z"
  },
  {
    "title": "\"Let Us Out\": ICE Detention of Children Sparks Protests at Immigration Jail in Dilley, TX",
    "description": "Liam Ramos, the 5-year-old from Minnesota who was detained last week after coming home from preschool, is being held in the South Texas Family Residential Center in Dilley, Texas. Congressmembers who visited Liam report that has been depressed and hasn’t been…",
    "link": "https://www.democracynow.org/2026/1/29/dilley_tx_ice_jail_family_detention",
    "timestamp": "2026-01-29T13:16:47Z"
  },
  {
    "title": "Aerial lidar mapping can reveal archaeological sites while overlooking Indigenous peoples and their knowledge",
    "description": "Aerial lidar raises ethical questions because it can collect data remotely without the knowledge or consent of Indigenous and descendant populations that are on the ground.",
    "link": "https://theconversation.com/aerial-lidar-mapping-can-reveal-archaeological-sites-while-overlooking-indigenous-peoples-and-their-knowledge-261332",
    "timestamp": "2026-01-29T13:16:04Z"
  },
  {
    "title": "Starmer's China trip provides exquisite optics for the 'world's most reliable superpower'",
    "description": "The prime minister's trip could not come at a better time for China, which dreams of turning the world away from the US.",
    "link": "https://news.sky.com/story/starmers-china-trip-provides-exquisite-optics-for-the-worlds-most-reliable-superpower-13500628",
    "timestamp": "2026-01-29T13:16:00Z"
  },
  {
    "title": "Afghan migrants stranded in Pakistan after the US suspends refugee resettlement",
    "description": "After a failed US intervention exposed Afghan civilians to Taliban threats, Washington is retreating from its humanitarian obligations.",
    "link": "https://theconversation.com/afghan-migrants-stranded-in-pakistan-after-the-us-suspends-refugee-resettlement-273680",
    "timestamp": "2026-01-29T13:15:06Z"
  },
  {
    "title": "The Crime of Witness",
    "description": "Renée Good and Alex Pretti were murdered for daring to interfere with the Trump administration’s efforts to normalize abductions and state violence.",
    "link": "http://www.nybooks.com/online/2026/01/29/the-crime-of-witness-fintan-otoole/",
    "timestamp": "2026-01-29T13:15:00Z"
  },
  {
    "title": "Powell's press conference, Big Tech earnings, U.S. dollar volatility and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2026/01/29/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2026-01-29T13:14:58Z"
  },
  {
    "title": "FBI raid in Georgia highlights Trump’s 2020 election obsession and hints at possible future actions",
    "description": "Some observers say Trump's administration is using Georgia as a blueprint for challenging results this November.",
    "link": "https://www.denverpost.com/2026/01/29/trump-2020-election-obsession/",
    "timestamp": "2026-01-29T13:12:44Z"
  },
  {
    "title": "FBI raid in Georgia highlights Trump’s 2020 election obsession and hints at possible future actions",
    "description": "Some observers say Trump's administration is using Georgia as a blueprint for challenging results this November.",
    "link": "https://www.bostonherald.com/2026/01/29/trump-2020-election-obsession/",
    "timestamp": "2026-01-29T13:12:44Z"
  },
  {
    "title": "120+ Groups Call on EU to Resist Trump's 'Fossil-Fueled Imperialism' and Cancel US Trade Deal",
    "description": "As the European Parliament debates the trade agreement reached last year by President Donald Trump and European Commission President Ursula von der Leyen, more than 120 civil society groups from across Europe and the globe on Thursday warned that the demands …",
    "link": "https://www.commondreams.org/news/eu-us-trade-agreement",
    "timestamp": "2026-01-29T13:12:07Z"
  },
  {
    "title": "Gold nears $5,600 on safe-haven rush, silver also soars",
    "description": "Gold advanced to a record high close to $5,600 an ounce today, as investors sought refuge from escalating geopolitical tensions and weakening economic signals in the US.",
    "link": "https://www.rte.ie/news/business/2026/0129/1555779-gold-prices-rise-again/",
    "timestamp": "2026-01-29T13:10:34Z"
  },
  {
    "title": "Authorities say apple cider vinegar sprayed on Ilhan Omar",
    "description": "Authorities in Minnesota believe they have identified the substance sprayed at U.S. Rep. Ilhan Omar during a town hall.",
    "link": "https://www.wmur.com/article/ilhan-omar-apple-cider-vinegar-syringe/70185572",
    "timestamp": "2026-01-29T13:08:27Z"
  },
  {
    "title": "MS NOW’s Jen Psaki Hammers ‘Toxic’ Trump Over Looming Failure of Melania Movie",
    "description": "Jen Psaki hammered Trump over the looming failure of  the new bio-doc about First Lady Melania Trump, which she connected to his \"toxic\" ICE operations.\nThe post MS NOW’s Jen Psaki Hammers ‘Toxic’ Trump Over Looming Failure of Melania Movie first appeared on …",
    "link": "https://www.mediaite.com/media/tv/ms-nows-jen-psaki-hammers-toxic-trump-over-looming-failure-of-melania-movie/",
    "timestamp": "2026-01-29T13:05:37Z"
  },
  {
    "title": "Iran vows 'crushing response', EU targets Revolutionary Guards",
    "description": "PARIS: Iran on Thursday (Jan 29) vowed a \"crushing response\" to any attack after US President Donald Trump warned time was running out for a nuclear deal, and as the European Union looks to declare t",
    "link": "https://www.channelnewsasia.com/world/iran-vows-crushing-response-eu-targets-revolutionary-guards-5893336",
    "timestamp": "2026-01-29T13:05:36Z"
  },
  {
    "title": "Israel hands over 15 bodies of Palestinians in last stage of captive swap",
    "description": "Palestinians still waiting for the Red Cross to turn over the bodies either in Khan Younis or Gaza City.",
    "link": "https://www.aljazeera.com/news/2026/1/29/israel-hands-over-15-bodies-of-palestinians-in-last-stage-of-captive-swap",
    "timestamp": "2026-01-29T13:05:35Z"
  },
  {
    "title": "Delusional Rocker Neil Young Gifts Music Catalog to Greenland, Claims It Will Help Them Cope With Trump",
    "description": "Singer-songwriter Neil Young’s narcissism knows no bounds.\nThe post Delusional Rocker Neil Young Gifts Music Catalog to Greenland, Claims It Will Help Them Cope With Trump appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2026/01/delusional-rocker-neil-young-gifts-music-catalog-greenland/",
    "timestamp": "2026-01-29T13:00:32Z"
  },
  {
    "title": "Trump’s Minnesota Invasion Appears Tied To This Unhinged Claim",
    "description": "The president promised to carry out “retribution” on the state that he actually lost every time.",
    "link": "https://www.huffpost.com/entry/trump-minnesota-retribution_n_697a7a5ce4b00b1deb8f2aaa",
    "timestamp": "2026-01-29T13:00:17Z"
  },
  {
    "title": "VMI cadets fight back as Virginia Democrats threaten to close historic military college",
    "description": "VMI cadets defend their military college as Virginia Democrats introduce legislation that could revoke state funding and potentially close the historic school.",
    "link": "https://www.foxnews.com/us/vmi-cadets-fight-back-virginia-democrats-threaten-close-historic-military-college",
    "timestamp": "2026-01-29T13:00:12Z"
  },
  {
    "title": "Go Big, Then Go Smart: Trump, ICE, and the Law. How to Skip the Left’s PR Trap.",
    "description": "The current obstruction and violence against federal agents trying to expel illegal aliens—committed by far-left activists and encouraged by left-wing politicians—is unacceptable. In June 2025, in... Read More\nThe post Go Big, Then Go Smart: Trump, ICE, and t…",
    "link": "https://www.dailysignal.com/2026/01/29/go-big-then-go-smart-trump-ice-and-the-law-how-to-skip-the-lefts-pr-trap/",
    "timestamp": "2026-01-29T13:00:00Z"
  },
  {
    "title": "2026 – The Year US Hegemony Ends?",
    "description": "Since our last report documenting ICE’s wave of criminal brutality, the agency’s lawless warpath has only worsened. A year under siege. Last January, 2025, The Free Thought Project documented the ways in which the Trump administration’s crackdown on immigrant…",
    "link": "https://www.activistpost.com/2026-the-year-us-hegemony-ends/",
    "timestamp": "2026-01-29T13:00:00Z"
  },
  {
    "title": "Brent crude tops $70 per barrel on Iran attack concerns",
    "description": "Brent oil futures prices jumped today, hitting a four-month high on rising concerns of a possible US military attack on Iran, OPEC's fourth-largest producer, with output of 3.2 million barrels per day.",
    "link": "https://www.rte.ie/news/business/2026/0129/1555777-world-oil-prices/",
    "timestamp": "2026-01-29T12:58:57Z"
  },
  {
    "title": "Everyone hated working on Melania Trump’s floptastic documentary",
    "description": "When Melania Trump’s documentary (Melania: Twenty Days To History) was announced, I sort of assumed that it would appear on Amazon Prime streaming, given that Jeff Bezos is so bizarrely invested in it. It only occurred to me this week that the doc is getting …",
    "link": "https://www.celebitchy.com/959304/melania_trump_flop_documentary_hate/",
    "timestamp": "2026-01-29T12:55:24Z"
  },
  {
    "title": "Sleepless Trump, 79, Launches Manic 6AM Post-a-Minute Rampage (Will Neal/The Daily Beast)",
    "description": "Will Neal / The Daily Beast:\nSleepless Trump, 79, Launches Manic 6AM Post-a-Minute Rampage  —  TRIGGER HAPPY  —  The perennially online president started out his Thursday with a bombardment of posts that sometimes came just seconds apart.  —  Donald Trump has…",
    "link": "https://www.memeorandum.com/260129/p26",
    "timestamp": "2026-01-29T12:55:00Z"
  },
  {
    "title": "Tom Suozzi's Vote To Fund ICE Bites Him In The Ass",
    "description": "Suffice to say, this hasn't been a fun time for the moderate Democrat from Long Island since he voted in support of DHS's funding bill, and therefore ICE as well. Suozzi was one of just seven Democrats who thought it was in their own interests to do so.\nSourc…",
    "link": "https://crooksandliars.com/2026/01/tom-souzzis-vote-fund-ice-bites-him-ass",
    "timestamp": "2026-01-29T12:52:38Z"
  },
  {
    "title": "Escape from Washington? Senators look to start new chapters as governors",
    "description": "This trend highlights a shift in political ambition away from the Senate, which has become mired in dysfunction.",
    "link": "https://www.bostonherald.com/2026/01/29/senators-running-for-governor-2026/",
    "timestamp": "2026-01-29T12:51:32Z"
  },
  {
    "title": "Escape from Washington? Senators look to start new chapters as governors",
    "description": "This trend highlights a shift in political ambition away from the Senate, which has become mired in dysfunction.",
    "link": "https://www.bostonherald.com/2026/01/29/sneators-running-for-governor-2026/",
    "timestamp": "2026-01-29T12:51:32Z"
  },
  {
    "title": "Green Party leader Zack Polanski has defiant response as Katie Hopkins attempts to throw shade",
    "description": "Green Party leader Zack Polanski has defiantly hit back at far-right commentator Katie Hopkins after she attempted to throw shade.  Hopkins, who was a constant on the third series of The Apprentice in 2007, has become known for using her X account – when it i…",
    "link": "https://www.thepinknews.com/2026/01/29/green-party-leader-zack-polanski-has-defiant-response-as-katie-hopkins-attempts-to-throw-shade/",
    "timestamp": "2026-01-29T12:51:18Z"
  },
  {
    "title": "Escape from Washington? Senators look to start new chapters as governors",
    "description": "U.S. senators are increasingly looking to leave Washington for leadership roles in their home states",
    "link": "https://abcnews.go.com/Politics/wireStory/escape-washington-senators-start-new-chapters-governors-129665524",
    "timestamp": "2026-01-29T12:46:33Z"
  },
  {
    "title": "Trump pushed us to the edge of disaster. It will soon be too late to step back",
    "description": "There is something deeply unsettling about Abraham Lincoln’s famous phrase “four score,” meaning 80 years. It’s roughly the length of a human life, but is also the interval at which the United States repeatedly collides with crisis and is forced to decide, ag…",
    "link": "https://www.rawstory.com/raw-investigates/2675045888/",
    "timestamp": "2026-01-29T12:45:44Z"
  },
  {
    "title": "FBI carries out search warrant for 2020 election ballots at Atlanta-area site",
    "description": "The FBI on Wednesday searched the election office of a Georgia county that has been central to right-wing conspiracy theories over U.S. President Donald Trump's 2020 election loss, acting just one week after the Republican leader predicted prosecutions over a…",
    "link": "https://www.cbc.ca/news/world/fbi-atlanta-fulton-raid-2020-election-9.7066096",
    "timestamp": "2026-01-29T12:42:03Z"
  },
  {
    "title": "ICE agents given new all-caps directive to not 'engage with agitators'",
    "description": "ICE agents have been given new orders to stop engaging with \"agitators\" as they carry out President Donald Trump's immigration crackdown.The new guidance marks a change in the broad sweeps that have provoked clashes that have resulted in a pair of fatal shoot…",
    "link": "https://www.rawstory.com/ice-agents-2675057935/",
    "timestamp": "2026-01-29T12:39:33Z"
  },
  {
    "title": "Trump official disappointed with EU-India trade deal",
    "description": "US Treasury Secretary Scott Bessent had expected the EU to match Trump’s tariff on India over Russian oil Read Full Article at RT.com",
    "link": "https://www.rt.com/india/631710-trump-official-disappointed-with-eu/",
    "timestamp": "2026-01-29T12:38:47Z"
  },
  {
    "title": "Trump’s border czar says cooperation with local leaders can lead to ICE drawdown",
    "description": "MINNEAPOLIS, Jan 29 (Reuters) - President Donald Trump’s border czar Tom Homan said on Thursday that agreements with state and local officials could lead to an ICE drawdo… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/29/trump-s-border-czar-says-cooperation-with-local-leaders-can-lead-to-ice-drawdown",
    "timestamp": "2026-01-29T12:38:25Z"
  },
  {
    "title": "Why it would be a big mistake for the US to go to war with Iran",
    "description": "Despite the bellicose rhetoric, Washington must realise the folly of another protracted conflict in the Middle East.",
    "link": "https://theconversation.com/why-it-would-be-a-big-mistake-for-the-us-to-go-to-war-with-iran-274592",
    "timestamp": "2026-01-29T12:36:34Z"
  },
  {
    "title": "Eden: Prince William was right to say nothing as Donald Trump insulted British soldiers",
    "description": "Last week, Donald Trump made a horse’s ass out of himself at Davos. European leaders freaked out, and they were very public in their criticism towards Trump, his enablers and the current state of the US. Trump said and did so many stupid things, but one of th…",
    "link": "https://www.celebitchy.com/959523/eden_prince_william_was_right_to_say_nothing_as_donald_trump_insulted_british_soldiers/",
    "timestamp": "2026-01-29T12:33:01Z"
  },
  {
    "title": "Lockheed Martin forecasts upbeat 2026 profit, revenue amid rising geopolitical tensions",
    "description": "By Mike Stone and Aishwarya Jain Jan 29 (Reuters) - Lockheed Martin forecast 2026 profit and revenue above Wall Street estimates on Thursday, anticipating...",
    "link": "https://finance.yahoo.com/news/lockheed-martin-forecasts-upbeat-2026-122711957.html",
    "timestamp": "2026-01-29T12:32:52Z"
  },
  {
    "title": "Russian oil major agrees sale of foreign assets to US firm",
    "description": "A deal between sanctioned Russian giant Lukoil and Carlyle Group awaits US regulatory approval after a prior bid was rejected Read Full Article at RT.com",
    "link": "https://www.rt.com/business/631698-lukoil-foreign-assets-carlyle-group/",
    "timestamp": "2026-01-29T12:32:27Z"
  },
  {
    "title": "Alex Pretti Was a Hero. To These Workers, He Was a Colleague, Too.",
    "description": "“Alex Pretti was one of us,” an NIH worker who asked not to be named told me over the phone. That’s a phrase I’ve been hearing a lot since Saturday, when the 37 year-old Veterans Affairs nurse was assaulted and then fatally shot by federal agents in Minneapol…",
    "link": "https://www.motherjones.com/politics/2026/01/alex-pretti-federal-va-workers-colleagues-unions/",
    "timestamp": "2026-01-29T12:30:00Z"
  },
  {
    "title": "Celebrating Black Military Service Is Not “DEI Shit.” It’s Essential to America’s Defense.",
    "description": "This article is adapted from Until the Last Gun Is Silent: A Story of Patriotism, the Vietnam War, and the Fight to Save America’s Soul (published January 2026 by Viking, an imprint of Penguin Publishing Group, a division of Penguin Random House LLC, all righ…",
    "link": "https://www.motherjones.com/politics/2026/01/history-month-black-military-service-vietnam-war-heroes-dei-recruiting-hegseth-trump-defense/",
    "timestamp": "2026-01-29T12:28:00Z"
  },
  {
    "title": "Iran draws red lines as US, EU tighten squeeze",
    "description": "Iran has warned of a severe retaliation if attacked. This comes as the United States signals time is running out for a nuclear deal. The European Union is also set to designate Iran's Revolutionary Guards as a terrorist group. Regional powers are calling for …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-draws-red-lines-as-us-eu-tighten-squeeze/articleshow/127776350.cms",
    "timestamp": "2026-01-29T12:27:51Z"
  },
  {
    "title": "Viral Images Show The Humiliating Truth About Melania Trump’s New Documentary",
    "description": "Crew members spoke about what it was like working with First Lady Melania Trump and how the production set was “chaotic” and “disorganized.”",
    "link": "https://www.boredpanda.com/melania-trump-documentary-movie-zero-tickets-sold/",
    "timestamp": "2026-01-29T12:27:12Z"
  },
  {
    "title": "Iran-US tensions soar: What do both sides want?",
    "description": "From enriched uranium and ballistic missiles to sanctions and regional influence, the differences are many.",
    "link": "https://www.aljazeera.com/news/2026/1/29/iran-us-tensions-soar-what-do-both-sides-want",
    "timestamp": "2026-01-29T12:24:48Z"
  },
  {
    "title": "Germany midfielder Goretzka says Trump makes 'us feel not only German but also European'",
    "description": "Germany midfielder Leon Goretzka says U.S. President Donald Trump “has managed to make us feel not only German, but also European.” Goretzka, who plays club soccer for Bayern Munich, in an interview with Die Zeit newspaper published on Wednesday, spoke about …",
    "link": "https://sports.yahoo.com/articles/germany-midfielder-goretzka-says-trump-122413020.html",
    "timestamp": "2026-01-29T12:24:13Z"
  },
  {
    "title": "Who’s matching Trump’s $1,000 contribution? Full list of employers joining the Trump accounts push",
    "description": "Trump Accounts are new savings plans for U.S. children that start with a $1,000 government deposit. Parents can add money, and some employers are matching the amount. Big banks, tech firms, and fast-food companies have joined the push. Wealthy donors are also…",
    "link": "https://economictimes.indiatimes.com/news/international/us/whos-matching-trumps-1000-contribution-full-list-of-employers-joining-the-trump-accounts-push/articleshow/127776282.cms",
    "timestamp": "2026-01-29T12:22:53Z"
  },
  {
    "title": "Ellison brags to DNC activists how many times he has sued the Trump admin: 'You can count on me'",
    "description": "Minnesota AG Keith Ellison vowed to continue suing the Trump administration after boasting on a call with Democrats that he has brought more than 50 cases.",
    "link": "https://www.foxnews.com/politics/ellison-brags-dnc-activists-how-many-times-he-has-sued-trump-admin-you-can-count-me",
    "timestamp": "2026-01-29T12:20:52Z"
  },
  {
    "title": "Trump’s ‘No. 1 Fan’ Nicki Minaj Touts ‘Free of Charge’ Gold Card: ‘Residency?’",
    "description": "The Trinidad-born artist, who revealed in 2018 that she was brought into the country “as an illegal immigrant” when a child, posted an image on X of the card.\nThe post Trump’s ‘No. 1 Fan’ Nicki Minaj Touts ‘Free of Charge’ Gold Card: ‘Residency?’ first appear…",
    "link": "https://www.mediaite.com/media/news/trumps-no-1-fan-nicki-minaj-touts-free-of-charge-gold-card-residency/",
    "timestamp": "2026-01-29T12:20:33Z"
  },
  {
    "title": "New videos show Alex Pretti scuffle with federal officers in Minneapolis 11 days before his death",
    "description": "The new videos have rekindled the national debate about the death of Pretti.",
    "link": "https://www.bostonherald.com/2026/01/29/new-alex-pretti-scuffle-video/",
    "timestamp": "2026-01-29T12:18:31Z"
  },
  {
    "title": "GOP insider gives 'losing' assessment of party ahead of midterms: 'Not a good thing'",
    "description": "A Republican Party representative has said the party will struggle in the months ahead as public mood shifts over recent ICE shootings. Jose Arango, the Republican chair of Hudson County, New Jersey, says the GOP is not offering an image close to relatable gi…",
    "link": "https://www.rawstory.com/trump-gop-2675057525/",
    "timestamp": "2026-01-29T12:16:34Z"
  },
  {
    "title": "Maliki defiant after US threatens to withdraw Iraq support",
    "description": "Former Iraqi Prime Minister Nouri al-Maliki expressed defiance on Jan. 28 after U.S. President Donald Trump threatened to withdraw Washington’s support for Iraq if he returns to power.",
    "link": "https://www.hurriyetdailynews.com/maliki-defiant-after-us-threatens-to-withdraw-iraq-support-218380",
    "timestamp": "2026-01-29T12:14:43Z"
  },
  {
    "title": "Israeli military pushes to reduce Gaza aid flow",
    "description": "Israeli military sources recommended that the government should sharply reduce the number of humanitarian aid trucks entering Gaza, proposing a cut from 600 to roughly 200 per day under Phase 2 of the U.S.-brokered ceasefire plan, the Israeli media reported o…",
    "link": "https://www.hurriyetdailynews.com/israeli-military-pushes-to-reduce-gaza-aid-flow-218379",
    "timestamp": "2026-01-29T12:13:42Z"
  },
  {
    "title": "Klobuchar launches Minnesota governor bid after Walz ends re-election run amid massive fraud scandal",
    "description": "Sen. Amy Klobuchar jumps into Minnesota governor race following Tim Walz's stunning exit amid massive fraud scandal fallout and political upheaval over immigration protest shootings",
    "link": "https://www.foxnews.com/politics/klobuchar-launches-minnesota-governor-bid-after-walz-ends-re-election-run-amid-massive-fraud-scandal",
    "timestamp": "2026-01-29T12:12:18Z"
  },
  {
    "title": "Tesla to Discontinue Model S and Model X: All you need to know",
    "description": "Tesla is discontinuing its longest-serving models, the Model S and Model X, starting next quarter. This strategic shift prioritizes autonomous vehicles and next-generation technologies, with production winding down as sales of these legacy vehicles have plate…",
    "link": "https://timesofindia.indiatimes.com/auto/electric-vehicles/tesla-to-discontinue-model-s-and-model-x-all-you-need-to-know/articleshow/127775969.cms",
    "timestamp": "2026-01-29T12:10:44Z"
  },
  {
    "title": "Sen. Amy Klobuchar jumps into Minnesota governor's race",
    "description": "Democratic Sen. Amy Klobuchar said Thursday that she will run for governor of Minnesota, after Gov.",
    "link": "https://www.nbcnews.com/politics/2026-election/sen-amy-klobuchar-jumps-minnesota-governors-race-rcna252390",
    "timestamp": "2026-01-29T12:10:22Z"
  }
]