[
  {
    "title": "Trump Town Hall Erupts in Laughter as He Claims He’s Made No Mistakes",
    "description": "Donald Trump doesn’t think he’s done anything wrong in his second term as president. \r\nOn a NewsNation town hall with Chris Cuomo, Stephen A. Smith, and Bill O’Reilly, Trump, who phoned in to the event, was asked by an audience member, Lee Shapiro, what he th…",
    "link": "https://newrepublic.com/post/194666/trump-town-hall-laughter-he-made-no-mistakes",
    "timestamp": "2025-05-01T14:17:52Z"
  },
  {
    "title": "Trump offers advice to University of Alabama graduates in speech interspersed with politics",
    "description": "Democrats held a counterprotest a mile away.",
    "link": "https://www.denverpost.com/2025/05/01/trump-graudation-speech-alabama/",
    "timestamp": "2025-05-01T14:17:47Z"
  },
  {
    "title": "Trump will address graduating students at the University of Alabama",
    "description": "The speech comes as he’s been celebrating the first 100 days of his new administration.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-graudation-speech-alabama/",
    "timestamp": "2025-05-01T14:17:47Z"
  },
  {
    "title": "Trump Goes After Fed Chair at White House Event: ‘Don’t Tell Him I Said That’",
    "description": "Trump took a swipe at Federal Reserve Chairman Jerome Powell, joking to the media \"Don't tell him I said that as the cameras rock and roll.\"\nThe post Trump Goes After Fed Chair at White House Event: ‘Don’t Tell Him I Said That’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-goes-after-fed-chair-at-white-house-event-dont-tell-him-i-said-that/",
    "timestamp": "2025-05-01T14:17:43Z"
  },
  {
    "title": "Stephen Miller Crashes Out Defending Trump’s Weird Dolls Comment",
    "description": "White House Deputy Chief of Staff Stephen Miller is doubling down on Donald Trump’s ridiculous way of dismissing the rising prices of consumer goods. \r\nDuring a White House press briefing Thursday morning, Miller attempted to defend the president’s strange re…",
    "link": "https://newrepublic.com/post/194669/stephen-miller-donald-trump-dolls-prices-tariffs",
    "timestamp": "2025-05-01T14:17:26Z"
  },
  {
    "title": "White House vows to implement 'system of merit' in US, dismantle DEI 'strangulation'",
    "description": "White House Deputy Chief of Staff Stephen Miller vowed that President Donald Trump's administration would implement a \"system of merit\" across the U.S. on Thursday.",
    "link": "https://www.foxnews.com/politics/white-house-vows-implement-system-merit-us-dismantle-dei-strangulation",
    "timestamp": "2025-05-01T14:17:26Z"
  },
  {
    "title": "Trump's health agency urges therapy for transgender youth",
    "description": "The administration’s position released Thursday sprang from Trump’s executive order calling for the federal government not to support gender transition for people under age 19.",
    "link": "https://www.twincities.com/2025/05/01/trump-transgender-youth-health-care/",
    "timestamp": "2025-05-01T14:16:59Z"
  },
  {
    "title": "Microsoft to raise Xbox console prices in the UK",
    "description": "The gaming giant said the prices of consoles will rise around the world from Wednesday, with some of its gaming prices to rise later this year.",
    "link": "https://www.the-independent.com/tech/microsoft-europe-australia-b2743135.html",
    "timestamp": "2025-05-01T14:14:46Z"
  },
  {
    "title": "Kamala Harris slams Trump tariffs in her first major speech since he took office - NPR",
    "description": "Kamala Harris slams Trump tariffs in her first major speech since he took officeNPR Kamala Harris hits out at Trump in first major speech since losing electionBBC April 30, 2025 – Donald Trump presidency newsCNN Harris draws social media scorn for digression …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177237971",
    "timestamp": "2025-05-01T14:12:43Z"
  },
  {
    "title": "Most California Republican Voters Still Confident In Trump Administration",
    "description": "Nearly 40% of California voters backed President Trump in the 2024 election.",
    "link": "https://www.kqed.org/news/12038363/most-california-republican-voters-still-confident-in-trump-administration",
    "timestamp": "2025-05-01T14:10:44Z"
  },
  {
    "title": "‘Idiotic!’ Kari Lake Throws Down With Dem Who’s Seeking Trump Impeachment in Piers Morgan Slugfest",
    "description": "Kari Lake, the Trump administration senior advisor for the U.S. Agency for Global Media, threw down with Rep. Shri Thanedar (D-MI)  over his “idiotic” bid to impeach President Donald Trump, calling it nothing more than a “despicable” attempt to play to the “f…",
    "link": "https://www.mediaite.com/tv/idiotic-kari-lake-throws-down-with-dem-whos-seeking-trump-impeachment-in-piers-morgan-slugfest/",
    "timestamp": "2025-05-01T14:09:36Z"
  },
  {
    "title": "Trump’s health agency urges therapy for transgender youth, not broader gender-affirming health care",
    "description": "The administration’s position released Thursday sprang from Trump’s executive order calling for the federal government not to support gender transition for people under age 19.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-transgender-youth-health-care/",
    "timestamp": "2025-05-01T14:09:14Z"
  },
  {
    "title": "Microsoft Hikes Xbox Prices—Games Hit $80 And Console Prices Jump More Than 20%",
    "description": "Microsoft blamed “market conditions” and rising costs of production for the need to increase the prices of its Xbox consoles.",
    "link": "https://www.forbes.com/sites/conormurray/2025/05/01/microsoft-hikes-xbox-prices-games-hit-80-and-console-prices-jump-more-than-20/",
    "timestamp": "2025-05-01T14:09:04Z"
  },
  {
    "title": "Artist behind Trump portrait gifted by Putin says he hopes it brings peace",
    "description": "MOSCOW (Reuters) - A Russian artist who painted a portrait of Donald Trump that was given to the U.S. president by Vladimir Putin says he never suspected his work would become an instrument of Russia-U.S. diplomacy. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/01/artist-behind-trump-portrait-gifted-by-putin-says-he-hopes-it-brings-peace",
    "timestamp": "2025-05-01T14:09:00Z"
  },
  {
    "title": "Estée Lauder Forecasts Return to Sales Growth in 2026",
    "description": "Estée Lauder Cos. said it expects to return to sales growth next year despite a sharp revenue decline at the cosmetics maker.",
    "link": "https://financialpost.com/pmn/business-pmn/estee-lauder-forecasts-return-to-sales-growth-in-2026",
    "timestamp": "2025-05-01T14:08:57Z"
  },
  {
    "title": "Watch: Trump says US kids might have 'two dolls instead of 30' due to tariffs",
    "description": "The US president was addressing possible shortages due to tariffs on China during a cabinet meeting on Wednesday.",
    "link": "https://www.bbc.com/news/videos/c62x47d4dgpo",
    "timestamp": "2025-05-01T14:06:51Z"
  },
  {
    "title": "Xbox Hikes Consoles Prices More Than 25% Amid Trump Tariffs",
    "description": "Xbox has increased the price of its consoles and controllers amid the tariffs enacted by President Donald Trump, and says it expects to up the cost of some of its new, first-party games beginning this holiday season. As of today, the retail price of an Xbox S…",
    "link": "https://variety.com/2025/gaming/news/xbox-console-price-increase-1236383608/",
    "timestamp": "2025-05-01T14:05:49Z"
  },
  {
    "title": "After a dressing-down from his boss Donald Trump, Pete Hegseth gets entangled in another Signal chat controversy; here's what it is",
    "description": "US Defense Secretary Pete Hegseth faces renewed scrutiny after being linked to another Signal chat group with former Fox News colleagues, raising concerns within the Pentagon about security protocols. This third chat included his wife, Jennifer Rauchet, advis…",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-a-dressing-down-from-his-boss-donald-trump-pete-hegseth-gets-entangled-in-another-signal-chat-controversy-heres-what-it-is/articleshow/120795693.cms",
    "timestamp": "2025-05-01T14:05:01Z"
  },
  {
    "title": "Democrats Find Win-Win Scenario In Losing Vote To Stop Trump's Tariffs In The Senate",
    "description": "Democrats lost a vote to undo Trump's tariffs in the Senate. However, even though some members questioned the leadership as a different strategy could have seen the bill passed, the move is still being seen as a win by some given its symbolic meaning",
    "link": "https://www.ibtimes.com/democrats-find-win-win-scenario-losing-vote-stop-trumps-tariffs-senate-3772153",
    "timestamp": "2025-05-01T14:04:41Z"
  },
  {
    "title": "Map Shows Where Trump's Approval Rating Is Rising, Falling Fastest",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's approval rating has declined in almost every state since January 20, according to new polling data.\nWhy It Matters\nTrump began his second term with higher approval ratings than ever. B…",
    "link": "https://biztoc.com/x/5126f4ee160492a0",
    "timestamp": "2025-05-01T14:03:48Z"
  },
  {
    "title": "Did Shri Thanedar Abandon Beagles At His Shuttered Pharma Testing Lab? What We Know",
    "description": "Democratic Congressman Shri Thanedar is facing renewed criticism over a 2010 incident in which over 170 dogs and monkeys were rescued from his bankrupt pharmaceutical lab. Thanedar denies wrongdoing, citing regulatory compliance and a strong pro-animal record…",
    "link": "https://freerepublic.com/focus/f-chat/4314394/posts",
    "timestamp": "2025-05-01T14:03:16Z"
  },
  {
    "title": "US vs. China: Here’s How Trump’s Trade War Could Affect Your Finances",
    "description": "Since President Donald Trump began to announce current and future tariffs on trading partners, China has begun to retaliate with tariffs of its own and has...",
    "link": "https://finance.yahoo.com/news/us-vs-china-trump-trade-140305520.html",
    "timestamp": "2025-05-01T14:03:05Z"
  },
  {
    "title": "Abu Dhabi firm uses Trump-linked stablecoin for $2 billion Binance deal",
    "description": "Trump-linked stablecoin USD1 selected for $2B Binance investment by Abu Dhabi firm MGX. USD1’s rapid rise: Stablecoin backed by U.S. Treasuries hits $2.1B in circulation. Justin Sun’s Tron to integrate USD1 as Trump allies expand crypto footprint. In a major …",
    "link": "https://coinjournal.net/news/abu-dhabi-firm-uses-trump-linked-stablecoin-for-2-billion-binance-deal/",
    "timestamp": "2025-05-01T14:03:02Z"
  },
  {
    "title": "USA Now SURROUNDED By Countries Led By Radical Climate Science Knowers",
    "description": "Be afraid! Be very afraid!",
    "link": "https://www.wonkette.com/p/usa-now-surrounded-by-countries-led",
    "timestamp": "2025-05-01T14:02:43Z"
  },
  {
    "title": "AT Feed 10, ‘Inside the White House’s Plan to Turn NOAA Into a Vibe’",
    "description": "We are delighted to provide you with Sarah Kaizar's 'AT feed,' a humorous look at today's climate change media postings online. Made with the magic assistance of AI",
    "link": "https://www.theartblog.org/2025/05/at-feed-10-inside-the-white-houses-plan-to-turn-noaa-into-a-vibe/",
    "timestamp": "2025-05-01T14:01:39Z"
  },
  {
    "title": "Wild market swings make planning and safe havens important for investors",
    "description": "OTTAWA — Stock markets have taken a wild ride in recent weeks as U.S. President Donald Trump’s on-again, off-again tariffs have created massive uncertainty for companies and the economy at large. Posts from Trump on social media have been causing big swings i…",
    "link": "https://financialpost.com/pmn/wild-market-swings-make-planning-and-safe-havens-important-for-investors",
    "timestamp": "2025-05-01T14:01:33Z"
  },
  {
    "title": "Map Shows Where Trump's Approval Rating Is Rising, Falling Fastest",
    "description": "President Donald Trump's approval ratings are slipping across most of the country, with new data showing net declines in all but one state since January 20.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-map-2066617",
    "timestamp": "2025-05-01T14:00:25Z"
  },
  {
    "title": "Seth Meyers Says Trump ‘Changed My Mind’ About His First 100 Days With ABC Interview | Video",
    "description": "\"I see the plan,\" the NBC host jokes\nThe post Seth Meyers Says Trump ‘Changed My Mind’ About His First 100 Days With ABC Interview | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-jokes-trump-100-days/",
    "timestamp": "2025-05-01T14:00:09Z"
  },
  {
    "title": "SCOOP: 38 GOP lawmakers say not repealing Biden's green agenda in Trump tax bill is 'hypocrisy'",
    "description": "A group of House Republicans is pushing their leaders to eliminate the Biden administration's clean energy tax credits in reconciliation.",
    "link": "https://www.foxnews.com/politics/scoop-38-gop-lawmakers-say-not-repealing-bidens-green-agenda-trump-tax-bill-hypocrisy",
    "timestamp": "2025-05-01T14:00:09Z"
  },
  {
    "title": "Trump is Terrified of Tariff Blowback (Jennifer Rubin/The Contrarian)",
    "description": "Jennifer Rubin / The Contrarian:\nTrump is Terrified of Tariff Blowback  —  MAGA oligarchs' policies threaten to ruin Christmas  —  This week, Donald Trump spotlighted for pro-democracy forces his greatest political vulnerability.  He gave it away on Tuesday, …",
    "link": "https://www.memeorandum.com/250501/p34",
    "timestamp": "2025-05-01T14:00:01Z"
  },
  {
    "title": "Spooked By Trade Wars, Trump Officials Hoard Supplies: ‘It Would Be Stupid Not To!’",
    "description": "Donald Trump’s aides and administration officials are hoarding toilet paper, food, and household supplies before his tariffs cause prices to spike.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-officials-hoarding-supplies-trade-war-tariffs-1235329235/",
    "timestamp": "2025-05-01T14:00:00Z"
  },
  {
    "title": "Texas Gun Owners Turn On Cornyn, Petition Trump Not To Endorse His Re-Election",
    "description": "Saying that U.S. Sen. John Cornyn has “betrayed the trust” of Lone Star State gun owners, a Texas gun rights group is asking President Donald Trump not to endorse the longtime senator for re-election. The organization Texas Gun Rights (TGR) last week penned a…",
    "link": "https://www.thetruthaboutguns.com/texas-gun-rights-trump-cornyn-endorsement/",
    "timestamp": "2025-05-01T14:00:00Z"
  },
  {
    "title": "Mapping the players in Trump’s Palm Beach orbit",
    "description": "Three years ago, the Event Horizon Telescope Collaboration released the first image of the supermassive black hole at the center of our galaxy, Sagittarius A*. It was the second image of a black hole ever taken.  Albert Einstein could only theorize about the …",
    "link": "https://therealdeal.com/magazine/may-2025/mapping-the-players-in-trumps-palm-beach-orbit/",
    "timestamp": "2025-05-01T14:00:00Z"
  },
  {
    "title": "Venezuela Sees Oil Exports Plunge 20% After Canceling Chevron Cargoes",
    "description": "Venezuela saw its oil exports slump by nearly 20% in April from March to the lowest level in nine months, after state-owned oil firm PDVSA canceled cargoes for Chevron, Reuters reported on Thursday, citing shipping documents and tanker-tracking data. Last mon…",
    "link": "https://oilprice.com/Energy/Energy-General/Venezuela-Sees-Oil-Exports-Plunge-20-After-Canceling-Chevron-Cargoes.html",
    "timestamp": "2025-05-01T14:00:00Z"
  },
  {
    "title": "Trump administration challenges gender-affirming care for transgender youth",
    "description": "Trump’s HHS report sparks debate on transgender health care, urging a shift from medical to behavioral approaches",
    "link": "https://www.wmur.com/article/trump-hhs-transgender-youth-healthcare-review/64643341",
    "timestamp": "2025-05-01T13:59:41Z"
  },
  {
    "title": "Why Investors Are Souring on This Once Red-Hot Climate Tech",
    "description": "Venture funding in US-based direct air capture startups dropped by more than 60% in the first quarter.",
    "link": "https://financialpost.com/pmn/business-pmn/why-investors-are-souring-on-this-once-red-hot-climate-tech",
    "timestamp": "2025-05-01T13:58:44Z"
  },
  {
    "title": "Trump’s Legacy Will Be the Countless People Killed by His Policies",
    "description": "Gregg Gonsalves\n\n\n\nMillions across the world could die because of the choices Trump has made in his first 100 days.\r\n\n\r\n\n\nThe post Trump’s Legacy Will Be the Countless People Killed by His Policies appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-100-days-public-health-deaths/",
    "timestamp": "2025-05-01T13:57:39Z"
  },
  {
    "title": "Trump's tariffs could spell a long-term shift in how Europeans buy American products",
    "description": "Trump's tariffs may trigger a long-term shift in European consumer habits, as 44% expressed a preference to ditch US products, an ECB survey said.",
    "link": "https://www.businessinsider.com/trump-tariffs-spur-europeans-to-rethink-buying-american-products-2025-5",
    "timestamp": "2025-05-01T13:57:30Z"
  },
  {
    "title": "‘James Is Gonna Drive Me Nuts!’: Bill O’Reilly Loses It On Carville Over ‘Propaganda’ Trump Attacks",
    "description": "Bill O’Reilly lost his temper at James Carville for claiming Donald Trump plans on \"cutting Medicaid\" and taking aim at him not solving the Russia-Ukraine war.",
    "link": "https://dailycaller.com/2025/05/01/bill-oreilly-carville-propaganda-trump-attacks/",
    "timestamp": "2025-05-01T13:57:13Z"
  },
  {
    "title": "Dumb AG Secretary Brags About Canceling Study On 'Transgender Mice'",
    "description": "Transgenic mice, not 'transgender mice', are mice whose DNA has been modified - genes have been added or removed - so that scientists can use them as models to study the impact of genes on health and disease. Still, Donald Trump claimed that the Biden adminis…",
    "link": "https://crooksandliars.com/2025/05/ag-secretary-praises-elon-cancelling-study",
    "timestamp": "2025-05-01T13:56:50Z"
  },
  {
    "title": "New CNN poll is a 'major wake-up call for Democrats': analysis",
    "description": "CNN’s Harry Enten's latest data has one message for Democrats, “They have to start thinking about what their message is going forward.” CNN’s latest poll asked voters who would be doing a better job as President right now, Donald Trump or Kamala Harris?“This …",
    "link": "https://www.rawstory.com/trump-vs-harris-polls-enten-now/",
    "timestamp": "2025-05-01T13:56:23Z"
  },
  {
    "title": "Big Tech's fortunes diverge as AI powers cloud, tariffs hit consumer electronics",
    "description": "The fortunes of Big Tech are diverging in a rapidly changing business landscape, as demand for artificial intelligence fuels growth in cloud and digital ads while consumer electronics take a battering from President Donald Trump's global trade war.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/big-techs-fortunes-diverge-as-ai-powers-cloud-tariffs-hit-consumer-electronics/articleshow/120796867.cms",
    "timestamp": "2025-05-01T13:56:09Z"
  },
  {
    "title": "Newsmax Host: Constitution Wrong, Trump Should Run For A Third Term",
    "description": "As the stock markets and global economies continue to collapse under Trump's moronic tariffs, the MAGA cult is assaulting the U.S. Constitution and demanding it be changed to give Trump another term in office.\nI kid you not.\nLooking at Trump's unbronzed face …",
    "link": "https://crooksandliars.com/2025/04/newsmax-host-constitution-wrong-trump",
    "timestamp": "2025-05-01T13:55:16Z"
  },
  {
    "title": "Jim Cramer on NVIDIA (NVDA): ‘It Will Only Get Worse’",
    "description": "We recently published a list of 10 Jim Cramer Stocks to Watch Amid Trump Tariff Wars. In this article, we are going to take a look at where NVIDIA Corp...",
    "link": "https://finance.yahoo.com/news/jim-cramer-nvidia-nvda-only-135501988.html",
    "timestamp": "2025-05-01T13:55:01Z"
  },
  {
    "title": "Lawyers Protest Trump Administration at Courthouses Nationwide—What to Know",
    "description": "Organizers warn the U.S. judiciary and legal profession \"are facing unprecedented challenges.\"",
    "link": "https://www.newsweek.com/lawyers-protest-donald-trump-nationwide-today-law-action-2066675",
    "timestamp": "2025-05-01T13:54:53Z"
  },
  {
    "title": "Trump Quietly Took Away a Living Wage From Thousands of Federal Workers",
    "description": "Companies can now illegally pay federal contractors less than the current minimum wage and face no consequences.",
    "link": "https://truthout.org/articles/trump-quietly-took-away-a-living-wage-from-thousands-of-federal-workers/",
    "timestamp": "2025-05-01T13:54:08Z"
  },
  {
    "title": "How to Fight Fascism in a Captured State",
    "description": "A union exists whenever a group of people work together to solve a problem they couldn't alone, says Shane Burley.",
    "link": "https://truthout.org/audio/how-to-fight-fascism-in-a-captured-state/",
    "timestamp": "2025-05-01T13:53:51Z"
  },
  {
    "title": "Microsoft just raised prices for Xbox consoles and games",
    "description": "Microsoft has increased the cost of the Xbox Series X by $100, a 20% price increase on the video game console that launched in 2020. And that’s not the only price hike announced on Thursday. Games as well as controllers and other peripherals are going up in p…",
    "link": "https://www.polygon.com/news/581992/xbox-price-increase-us",
    "timestamp": "2025-05-01T13:53:48Z"
  },
  {
    "title": "Navigating Tariff Uncertainty: A Looming Threat To IT Services And Their Customers",
    "description": "Much ink has already been spilled about the impact of US President Donald Trump’s tariff policy on IT products and services. This week’s announcement that US GDP was down 0.3% for the first quarter indicates that some imbalances are developing. Of course, any…",
    "link": "https://www.forrester.com/blogs/navigating-tariff-uncertainty-a-looming-threat-to-it-services-and-their-customers/",
    "timestamp": "2025-05-01T13:52:40Z"
  },
  {
    "title": "Bessent cites 'market signal' Fed should be cutting rates",
    "description": "Treasury Secretary Scott Bessent said Thursday that the bond market is signaling that the Federal Reserve should be cutting rates.",
    "link": "https://finance.yahoo.com/news/bessent-cites-market-signal-fed-should-be-cutting-rates-135229353.html",
    "timestamp": "2025-05-01T13:52:29Z"
  },
  {
    "title": "Ukraine Peace Process Moving Forward, Deal ‘Closer’ – US National Security Advisor",
    "description": "WASHINGTON (Sputnik) – While the Ukraine peace process is moving forward and a deal is becoming \"closer and closer,\" it is essential for both sides to want peace and to come to the table to finalize it, US National Security Advisor Mike Waltz said on Thursday.",
    "link": "https://sputnikglobe.com/20250501/ukraine-peace-process-moving-forward-deal-closer--us-national-security-advisor-1121963337.html",
    "timestamp": "2025-05-01T13:51:58Z"
  },
  {
    "title": "South Africa’s shift from coal to renewables: how it’s going",
    "description": "South Africa has secured pledges of R218 billion to fund its transition away from coal-fired power and bring in renewable energy.",
    "link": "https://theconversation.com/south-africas-shift-from-coal-to-renewables-how-its-going-253880",
    "timestamp": "2025-05-01T13:50:48Z"
  },
  {
    "title": "Trump on tariffs impact: 'Maybe the children will have 2 dolls instead of 30'",
    "description": "Donald Trump conceded that his tariffs will mean fewer choices for consumers and higher prices on consumer good — including dolls for children.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-tariffs-impact-maybe-children-will-2-dolls-instead-30-rcna204061",
    "timestamp": "2025-05-01T13:50:37Z"
  },
  {
    "title": "ALEX BERENSON: Trump's crafty deal could end war in Ukraine, but media's war on Trump goes on",
    "description": "Author and former New York Times reporter Alex Berenson looks closely at President Trump's deal with Ukraine which could end the bloody war with Russia, and, surprise! finds the legacy media isn't providing the full picture.",
    "link": "https://www.foxnews.com/opinion/alex-berenson-trumps-crafty-deal-could-end-war-ukraine-medias-war-trump-goes",
    "timestamp": "2025-05-01T13:48:47Z"
  },
  {
    "title": "Transgender Women Banned From Women's Soccer in England",
    "description": "The move comes after the U.K. Supreme Court's landmark ruling on what defines a woman.",
    "link": "https://www.newsweek.com/fa-bans-transgender-women-football-2066632",
    "timestamp": "2025-05-01T13:48:18Z"
  },
  {
    "title": "Russia blasts Trump over mineral deal, says Ukraine will soon ‘disappear’",
    "description": "WASHINGTON — The Kremlin on Thursday blasted President Trump’s historic mineral rights deal with Ukraine inked a day earlier, sarcastically praising the US leader for making a deal with a nation that will soon “disappear.” “Trump has finally pressured the Kie…",
    "link": "https://nypost.com/2025/05/01/us-news/russia-blasts-trump-over-mineral-deal-says-ukraine-will-soon-disappear/",
    "timestamp": "2025-05-01T13:48:07Z"
  },
  {
    "title": "Tesla Is Extremely Upset About Reporting That Its Board Has Been Looking Into Replacing Elon Musk",
    "description": "On Wednesday evening, the Wall Street Journal reported that members of Tesla's board had been actively looking into a replacement for CEO Elon Musk, who had set the company's brand on fire with his extremist views and plundering of the federal government. Wit…",
    "link": "https://futurism.com/teslas-board-replace-elon-musk-denied",
    "timestamp": "2025-05-01T13:47:41Z"
  },
  {
    "title": "Ukraine minerals deal: the idea that natural resource extraction can build peace has been around for decades",
    "description": "After months of negotiations, Ukraine and the US have signed a deal to give the US access to Kyiv’s mineral riches.",
    "link": "https://theconversation.com/ukraine-minerals-deal-the-idea-that-natural-resource-extraction-can-build-peace-has-been-around-for-decades-252090",
    "timestamp": "2025-05-01T13:47:28Z"
  },
  {
    "title": "Why Slovenian philosopher Slavoj Žižek wants Donald Trump to survive? And it's not what you think",
    "description": "Slavoj Žižek recently shared in an interview why he fears the rise of JD Vance over Donald Trump. While Trump’s chaotic leadership may be unpredictable, Žižek argues that Vance’s cold, efficient style could be far more dangerous. For Žižek, Trump’s unpredicta…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/why-slovenian-philosopher-slavoj-zizek-wants-donald-trump-to-survive-and-fears-jd-vance-its-not-what-you-think/articleshow/120796018.cms",
    "timestamp": "2025-05-01T13:47:12Z"
  },
  {
    "title": "Shari Redstone Asked CBS to ‘Delay Sensitive Stories About Trump’ Until Paramount Sale Closed: Report",
    "description": "Shari Redstone is so eager to close the sale of Paramount she has reportedly asked CBS News to hold sensitive stories about President Trump.\nThe post Shari Redstone Asked CBS to ‘Delay Sensitive Stories About Trump’ Until Paramount Sale Closed: Report first a…",
    "link": "https://www.mediaite.com/tv/shari-redstone-asked-cbs-to-delay-sensitive-stories-about-trump-until-paramount-sale-closed-report/",
    "timestamp": "2025-05-01T13:47:06Z"
  },
  {
    "title": "Bernie Sanders Fiercely Rejects 1 Notion About Trump-Era Democrats: 'Have The Courage'",
    "description": "The independent senator appeared genuinely taken aback Wednesday on CNN after watching a clip featuring Senate Minority Leader Chuck Schumer.",
    "link": "https://www.huffpost.com/entry/bernie-sanders-fiercely-rejects-1-notion-about-trump-era-democrats-have-the-courage_n_6813475ee4b0463697b5f235",
    "timestamp": "2025-05-01T13:46:58Z"
  },
  {
    "title": "UK's Delayed Regulation Hurts Plan to Be Global Crypto Hub, Executives Say: CNBC",
    "description": "The country is falling behind other nations in developing a welcoming environment for crypto companies.",
    "link": "https://www.coindesk.com/policy/2025/05/01/uks-delayed-regulation-hurts-plan-to-be-global-crypto-hub-executives-say-cnbc",
    "timestamp": "2025-05-01T13:45:51Z"
  },
  {
    "title": "England bans transgender women from playing on women's soccer teams",
    "description": "Transgender women will be banned from playing on women’s soccer teams in England following a U.K. Supreme Court ruling last month, the sport’s governing body said Thursday.",
    "link": "https://www.cbc.ca/news/world/transgender-women-soccer-ban-1.7523565",
    "timestamp": "2025-05-01T13:45:41Z"
  },
  {
    "title": "Tesla board chair denies reports company was looking to replace Elon Musk",
    "description": "The Wall Street Journal reported on Wednesday that board members had reached out to executive search firms to find a replacement for CEO Elon Musk. Tesla's sales and stock value have slumped in recent months as Musk spent much of his time as an unofficial par…",
    "link": "https://www.cbc.ca/news/business/tesla-musk-replacement-response-1.7523534",
    "timestamp": "2025-05-01T13:45:00Z"
  },
  {
    "title": "Elon Musk Melts Down Over Report Tesla Is Looking to Boot Him",
    "description": "Elon Musk isn’t happy about a report that his own company is looking to replace him.\r\nThe Wall Street Journal reported Thursday that Tesla’s board of directors had begun the process of finding a new CEO to replace the billionaire bureaucrat who was galavantin…",
    "link": "https://newrepublic.com/post/194659/melon-musk-report-tesla-looking-new-ceo",
    "timestamp": "2025-05-01T13:43:48Z"
  },
  {
    "title": "You Only Get What You’re Organized to Take: The Power of the Poor in Trump’s America",
    "description": "The day after Donald Trump won the 2024 election, the ten richest people in the world — including nine Americans — expanded their wealth by nearly $64 billion, the greatest single-day increase in recorded history. Since then, an unholy marriage of billionaire…",
    "link": "https://www.fairobserver.com/world-news/us-news/you-only-get-what-youre-organized-to-take-the-power-of-the-poor-in-trumps-america/",
    "timestamp": "2025-05-01T13:43:37Z"
  },
  {
    "title": "Donald Trump Would 'Love' Stephen A. Smith to Run for President",
    "description": "Donald Trump may have just endorsed his successor ... 'cause he says Stephen A. Smith has all the necessary skills to be POTUS -- most especially, entertainment value. The president gave a phone interview on NewsNation Wednesday night ... chatting…\n Permalink",
    "link": "https://www.tmz.com/2025/05/01/trump-wants-stephen-a-smith-run-for-president/",
    "timestamp": "2025-05-01T13:42:14Z"
  },
  {
    "title": "China sees surge in worker protests over unpaid wages, factory closures and US tariffs",
    "description": "Protests by workers demanding unpaid wages are spreading across China as factory closures increase due to high U.S. tariffs and a slowing domestic economy, according to a report by Radio Free Asia (RFA). From Hunan's Dao County to Sichuan’s Suining and Inner …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/china-sees-surge-in-worker-protests-over-unpaid-wages-factory-closures-and-us-tariffs/articleshow/120796368.cms",
    "timestamp": "2025-05-01T13:41:01Z"
  },
  {
    "title": "Stocks and the economy down? Watch the Trump bait-and-switch. (Glenn Kessler/Washington Post)",
    "description": "Glenn Kessler / Washington Post:\nStocks and the economy down?  Watch the Trump bait-and-switch.  —  President Donald Trump changes his tune whenever bad news strikes, so the spin is always that he's on course. … — President Donald Trump, interview with ABC Ne…",
    "link": "https://www.memeorandum.com/250501/p31",
    "timestamp": "2025-05-01T13:40:02Z"
  },
  {
    "title": "Dave Portnoy takes Trump to task for sluggish economy: ‘Don’t p–s down my back and tell me it’s raining’",
    "description": "Portnoy reacted to Trump's comments on Wednesday following a Commerce Department report indicating that GDP contracted 0.3% in the first quarter.",
    "link": "https://nypost.com/2025/05/01/media/dave-portnoy-takes-trump-to-task-for-sluggish-economy/",
    "timestamp": "2025-05-01T13:39:07Z"
  },
  {
    "title": "Trump’s agenda faces courtroom setbacks as Justice Department lawyers struggle to win over judges",
    "description": "The Justice Department last week suffered losses that dealt a setback to President Trump’s agenda.",
    "link": "https://www.bostonherald.com/2025/05/01/trump-justice-department-loses-increase/",
    "timestamp": "2025-05-01T13:39:00Z"
  },
  {
    "title": "WTF Is RFK Jr. Even Talking About With This New Measles Vaccine Claim?",
    "description": "Centers for Disease Control and Prevention officials have described the current measles outbreak in Texas as the worst uptick the agency has seen in measles cases in the last 25 years. But on Wednesday, the man responsible for running the nation’s public heal…",
    "link": "https://newrepublic.com/post/194661/robert-f-kennedy-jr-measles-vaccine-abortion-conspiracy",
    "timestamp": "2025-05-01T13:36:18Z"
  },
  {
    "title": "'My first observation': Editor who interviewed Trump flags a 'truly odd' obsession",
    "description": "Appearing on MSNBC on Thursday morning, Jeffrey Goldberg, editor-in-chief of The Atlantic, singled out his first moments speaking with Donald Trump for an interview that appeared in the magazine this week that he found notable for explaining the president's s…",
    "link": "https://www.rawstory.com/trump-atlantic-interview-truly-odd/",
    "timestamp": "2025-05-01T13:33:54Z"
  },
  {
    "title": "Trump-Backed USD1 Stablecoin Chosen to Back MGX’s $2 Billion Binance Stake Deal: Report",
    "description": "Eric Trump has reportedly announced that the USD1 stablecoin has been picked as the mode of payment for MGX’s purchase of a minority stake in Binance. The announcement was made at the ongoing Token2049 event in Dubai on Thursday, May 1.",
    "link": "https://www.gadgets360.com/cryptocurrency/news/donald-trump-usd1-stablecoin-facilitate-mgx-binance-stake-deal-usd-2-billion-8305311",
    "timestamp": "2025-05-01T13:32:41Z"
  },
  {
    "title": "Tuscaloosa prepares for Trump visit as local businesses brace for loss and protests grow",
    "description": "As President Donald Trump prepares to speak at the University of Alabama on Thursday, Tuscaloosa is already feeling the impact — both economically and politically.",
    "link": "https://www.wbrc.com/2025/05/01/tuscaloosa-prepares-trump-visit-local-businesses-brace-loss-protests-grow/",
    "timestamp": "2025-05-01T13:32:25Z"
  },
  {
    "title": "Former ambassador says Ukraine victory is key to countering China, Russia",
    "description": "Former U.S. Ambassador to the OSCE James Gilmore told Fox News Digital that the U.S. needs to redirect foreign aid to ensure Russia and China do not gain influence.",
    "link": "https://www.foxnews.com/world/former-ambassador-says-ukraine-victory-key-countering-china-russia",
    "timestamp": "2025-05-01T13:31:37Z"
  },
  {
    "title": "Saudi normalization harmed, but still possible with win over Iran or Hamas",
    "description": "Easiest path to normalization is still PA in Gaza, but there are some surprising other options, sources said.",
    "link": "https://www.jpost.com/israel-news/article-852263",
    "timestamp": "2025-05-01T13:31:16Z"
  },
  {
    "title": "GM CEO Mary Barra says tariffs will cost the company up to $5 billion this year",
    "description": "The Trump administration’s tariffs on imported cars and auto parts will cost General Motors between $4 billion and $5 billion this year, as the nation’s largest automaker slashed its earnings",
    "link": "https://www.abc12.com/news/business/gm-ceo-mary-barra-says-tariffs-will-cost-the-company-up-to-5-billion-this/article_daf80880-7c76-584b-9935-aeed7a461871.html",
    "timestamp": "2025-05-01T13:30:32Z"
  },
  {
    "title": "Iran accuses U.S. of 'provocative statements' ahead of nuclear talks",
    "description": "Iran accused the U.S, of “contradictory behavior and provocative statements” after Washington warned Tehran of consequences for backing Yemen’s Houthis.",
    "link": "https://www.nbcnews.com/world/iran/iran-nuclear-talks-yemen-houthis-sanctions-provocative-statements-rcna204053",
    "timestamp": "2025-05-01T13:30:00Z"
  },
  {
    "title": "Elon Musk talks Lincoln Bedroom stays, late-night ice cream as he steps back from DOGE (USA Today)",
    "description": "USA Today:\nElon Musk talks Lincoln Bedroom stays, late-night ice cream as he steps back from DOGE  —  WASHINGTON ― Elon Musk never asked to stay in the Lincoln Bedroom. … That's just where he says President Donald Trump, who loves giving tours of the famous g…",
    "link": "https://www.memeorandum.com/250501/p30",
    "timestamp": "2025-05-01T13:30:00Z"
  },
  {
    "title": "Zomato Q4 earnings: strong growth, slim profit",
    "description": "Zomato parent Eternal reported a drop in its net profit due to increasing losses in Blinkit, even as food delivery growth continued to be subdued. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/zomato-q4-earnings-strong-growth-slim-profit/articleshow/120795535.cms",
    "timestamp": "2025-05-01T13:29:23Z"
  },
  {
    "title": "‘50501’ movement plans May Day protests across US against Trump and Musk, thousands to participate: Key points",
    "description": "May Day protests in US: Tens of thousands of protesters are expected to take to the streets nationwide on Thursday in May Day rallies opposing the Trump administration. May Day, celebrated by workers across the globe as International Labor Day, occurs on May …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-may-day-protests-50501-movement-plans-may-day-protests-across-us-against-trump-and-musk-thousands-to-participate-key-points/articleshow/120795705.cms",
    "timestamp": "2025-05-01T13:28:44Z"
  },
  {
    "title": "Recent immigration arrests at courthouses around the country have advocates worried",
    "description": "A flurry of immigration enforcement activity at courthouses around the country in the past month has renewed a legal battle from President Donald Trump’s first term",
    "link": "https://abcnews.go.com/Politics/wireStory/recent-immigration-arrests-courthouses-country-advocates-worried-121355049",
    "timestamp": "2025-05-01T13:27:24Z"
  },
  {
    "title": "Trump's health agency urges therapy for transgender youth, not broader gender-affirming health care",
    "description": "The Trump administration is calling for more reliance on behavioral therapy for transgender youth instead of broader gender-affirming medical care",
    "link": "https://abcnews.go.com/US/wireStory/trumps-health-agency-urges-therapy-transgender-youth-broader-121354865",
    "timestamp": "2025-05-01T13:26:27Z"
  },
  {
    "title": "Meta and Microsoft beat earnings. Wall Street's eyes are now on Apple and Amazon.",
    "description": "Shares of Meta and Microsoft soared in premarket trading after the companies reported earnings. Will Apple and Amazon do the same?",
    "link": "https://www.businessinsider.com/big-tech-earnings-microsoft-meta-amazon-apple-stock-price-market-2025-5",
    "timestamp": "2025-05-01T13:24:16Z"
  },
  {
    "title": "White House Struggles To Explain Deportation Figures—As Experts Dispute Numbers",
    "description": "Data shows Immigration and Customs Enforcement has deported fewer people under Trump versus Biden, though the Trump administration has blamed the disparity on a decrease in arrests at the border.",
    "link": "https://www.forbes.com/sites/saradorn/2025/05/01/white-house-struggles-to-explain-deportation-figures-as-experts-dispute-numbers/",
    "timestamp": "2025-05-01T13:22:06Z"
  },
  {
    "title": "Ukraine minerals deal is largely symbolic – but that’s enough for Donald Trump | CNN",
    "description": "It provides both good news and optics, but is ultimately a forced deal with a complex future.",
    "link": "https://www.cnn.com/2025/05/01/world/ukraine-minerals-deal-us-trump-analysis-intl",
    "timestamp": "2025-05-01T13:21:09Z"
  },
  {
    "title": "Trump’s health agency urges therapy for transgender youth, not broader gender-affirming health care",
    "description": "President Donald Trump’s administration released a lengthy review of transgender health care on Thursday that advocates for a greater reliance on behavioral therapy rather than broad gender-affirming medical care for youths with gender dysmorphia.",
    "link": "https://www.wsaw.com/2025/05/01/trumps-health-agency-urges-therapy-transgender-youth-not-broader-gender-affirming-health-care/",
    "timestamp": "2025-05-01T13:20:48Z"
  },
  {
    "title": "Trump Says Tariffs 'Haven't Kicked in Yet'",
    "description": "President Donald Trump blamed former President Joe Biden for weak economic data that sent stocks tumbling, arguing government data showed increased domestic investment signaled his tariff regime is working. Trump also said he saw encouraging signs his tariffs…",
    "link": "https://biztoc.com/x/7c78a9bde5c0ce9c",
    "timestamp": "2025-05-01T13:19:26Z"
  },
  {
    "title": "Ukraine-US minerals deal: is Trump turning away from Putin?",
    "description": "Kyiv and Washington have struck a deal that will allow the US to share profits from the mining of Ukraine's mineral reserves. But does it mean Donald Trump is now more willing to push Russia to make peace with Ukraine?\nThis deal does give Trump \"a personal st…",
    "link": "https://biztoc.com/x/5b9ef57bc47f8f5e",
    "timestamp": "2025-05-01T13:19:09Z"
  }
]