[
  {
    "title": "Watch Live: Donald Trump Signs Cryptocurrency Bill into Law",
    "description": "President Donald Trump signs the GENIUS Act into law on Friday, July 18.\nThe post Watch Live: Donald Trump Signs Cryptocurrency Bill into Law appeared first on Breitbart.",
    "link": "https://www.breitbart.com/tech/2025/07/18/watch-live-donald-trump-signs-cryptocurrency-bill-into-law/",
    "timestamp": "2025-07-18T18:49:39Z"
  },
  {
    "title": "The weird reason Speaker Mike Johnson claimed Trump has a ‘90% approval rating’",
    "description": "Why does Mike Johnson think Donald Trump's approval rating is \"skyrocketing\"? Because from the House Speaker's perspective, Democrats literally don't count.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/weird-reason-speaker-mike-johnson-claimed-trump-90-approval-rating-rcna219651",
    "timestamp": "2025-07-18T18:49:37Z"
  },
  {
    "title": "WATCH: Trump directs Pam Bondi to unseal grand jury transcripts related to Epstein case",
    "description": "President Donald Trump has directed Attorney General Pam Bondi to unseal grand jury transcripts related to the Jeffrey Epstein case.",
    "link": "https://abcnews.go.com/Politics/video/trump-directs-pam-bondi-unseal-grand-jury-transcripts-123870927",
    "timestamp": "2025-07-18T18:46:06Z"
  },
  {
    "title": "High-fructose corn syrup versus cane sugar | CNN",
    "description": "President Trump says Coca-Cola will swap out high-fructose corn syrup with cane sugar. Here’s what research says about its health risks compared with sugar.",
    "link": "https://www.cnn.com/2025/07/18/health/coca-cola-cane-sugar-high-fructose-corn-syrup-wellness",
    "timestamp": "2025-07-18T18:43:57Z"
  },
  {
    "title": "Foreign Correspondent S34E12 1080p HDTV H264-CBFM",
    "description": "Season 34, Episode 12 – “Trumps Wellness Warriors USA”A wellness revolution has captured the White House. Donald Trump’s ex-wife Marla Maples reveals the inside story behind the Make America Healthy Again movement and the role she played in uniting Robert F K…",
    "link": "https://post.rlsbb.cc/foreign-correspondent-s34e12-1080p-hdtv-h264-cbfm/",
    "timestamp": "2025-07-18T18:43:34Z"
  },
  {
    "title": "JPMorgan reveals global regulators favor tokenized bank deposits over stablecoins",
    "description": "JPMorgan’s latest research indicates that international regulators are more inclined to support tokenized deposits, particularly those that preserve the existing structure and stability of fiat-based banking systems, The Block reported on July 18. According t…",
    "link": "https://cryptoslate.com/jpmorgan-reveals-global-regulators-favor-tokenized-bank-deposits-over-stablecoins/",
    "timestamp": "2025-07-18T18:43:28Z"
  },
  {
    "title": "Bipartisan Bill Aims to Codify Trump’s Health Care Pricing Transparency Directive",
    "description": "With the new Patients Deserve Price Tags Act, a bipartisan group of senators is pushing to effectively codify President Donald Trump’s executive order requiring price... Read More\nThe post Bipartisan Bill Aims to Codify Trump’s Health Care Pricing Transparenc…",
    "link": "https://www.dailysignal.com/2025/07/18/bipartisan-bill-aims-codify-trumps-health-care-pricing-directive/",
    "timestamp": "2025-07-18T18:43:16Z"
  },
  {
    "title": "Writers Guild Demands Investigation Into Stephen Colbert ‘Late Show’ Cancellation, Has ‘Significant Concerns’ About Bribery at Paramount",
    "description": "The Writers Guild of America called for Paramount to be investigated for bribery by the New York state attorney general following Thursday’s announcement that “The Late Show With Stephen Colbert” has been canceled. In the statement, the labor union says it ha…",
    "link": "https://variety.com/2025/tv/news/writers-guild-bribery-investigation-colbert-cancellation-1236464878/",
    "timestamp": "2025-07-18T18:41:30Z"
  },
  {
    "title": "What a Trump, Powell faceoff means for your money",
    "description": "Ahead of the next Federal Reserve meeting later this month, tensions between the White House and the central bank have reached a fever pitch.\nOn Wednesday, a senior White House official told CNBC and other news outlets that President Donald Trump was likely t…",
    "link": "https://biztoc.com/x/893188ab6525726d",
    "timestamp": "2025-07-18T18:39:18Z"
  },
  {
    "title": "The new revelation about Trump and Jeffrey Epstein, explained",
    "description": "and real estate developer Donald Trump as they pose together at the Mar-a-Lago estate, Palm Beach, Florida, in 1997. | ﻿Davidoff Studios/Getty \nJust how close was Donald Trump to Jeffrey Epstein?\nThe president’s onetime friendship with Jeffrey Epstein — the w…",
    "link": "https://biztoc.com/x/8262af71e724b7f8",
    "timestamp": "2025-07-18T18:38:45Z"
  },
  {
    "title": "Schwab Wants to Offer Stablecoin Amid Expanding Crypto Services Push: CEO",
    "description": "Charles Schwab's CEO said that the U.S.-based brokerage is considering offering a dollar-pegged token as the stablecoin market is poised to grow.",
    "link": "https://decrypt.co/330848/schwab-offer-stablecoin-expanding-crypto-services-push-ceo",
    "timestamp": "2025-07-18T18:38:42Z"
  },
  {
    "title": "Trump Threatens to Sue Wall Street Journal for Publishing Letter to Epstein",
    "description": "For decades, Trump had a strong friendship with Epstein, a disgraced financier and child sex trafficker.",
    "link": "https://truthout.org/articles/trump-threatens-to-sue-wall-street-journal-for-publishing-letter-to-epstein/",
    "timestamp": "2025-07-18T18:37:40Z"
  },
  {
    "title": "Obama admin 'manufactured' intelligence to create 2016 Russian election interference narrative, documents show",
    "description": "EXCLUSIVE: The Obama administration \"manufactured and politicized intelligence\" to create the narrative that Russia was attempting to influence the 2016 presidential election, despite information from the intelligence community stating otherwise, Fox News Dig…",
    "link": "https://freerepublic.com/focus/f-news/4329427/posts",
    "timestamp": "2025-07-18T18:31:47Z"
  },
  {
    "title": "Gabbard Releases Info Showing 2016 Russia Collusion Narrative Lacked Credible Intelligence",
    "description": "“Their goal was to subvert the will of the American people and enact what was essentially a years-long coup with the objective of trying to usurp the President from fulfilling the mandate bestowed upon him by the American people.\"\nThe post Gabbard Releases In…",
    "link": "https://legalinsurrection.com/2025/07/gabbard-releases-info-showing-2016-russia-collusion-narrative-lacked-credible-intelligence/",
    "timestamp": "2025-07-18T18:31:33Z"
  },
  {
    "title": "Donald Trump’s chronic condition explained after swelling was discovered on his legs",
    "description": "Chronic venous insufficiency explained after people noticed bruises on Donald Trump's hands as well as swollen ankles",
    "link": "https://www.ladbible.com/news/politics/donald-trump-venous-insufficiency-explained-514642-20250718",
    "timestamp": "2025-07-18T18:31:22Z"
  },
  {
    "title": "Judge restores Democrat to Federal Trade Commission, ruling her firing by Trump was illegal",
    "description": "A federal judge has restored a Democrat to the Federal Trade Commission, ruling that President Donald Trump illegally fired her earlier this year in his efforts to exert control over independent agencies across the government",
    "link": "https://abcnews.go.com/Business/wireStory/judge-restores-democrat-federal-trade-commission-ruling-firing-123870519",
    "timestamp": "2025-07-18T18:30:28Z"
  },
  {
    "title": "Man accused of stockpiling bombs, using Biden photo for target practice, pleads guilty",
    "description": "A Virginia man has pleaded guilty in a federal case that accused him of stockpiling the largest number of finished explosives in FBI history",
    "link": "https://abcnews.go.com/US/wireStory/man-accused-stockpiling-bombs-biden-photo-target-practice-123871973",
    "timestamp": "2025-07-18T18:30:14Z"
  },
  {
    "title": "The TV President’s War on Democracy Comes for TV’s Institutions",
    "description": "By canceling \"The Late Show,\" CBS and Paramount simultaneously bend the knee to an aspiring despot, open the door for more TV titans to fall, and further compromise the public's faith in free speech.",
    "link": "https://www.indiewire.com/criticism/culture/donald-trump-war-democracy-tv-late-show-canceled-1235139403/",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_505ab2ba-ce43-5b0a-80f2-2c265771148c.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Michael Wolff on MAGA’s Revolt Over Jeffrey Epstein",
    "description": "The journalist talks about his interviews with the infamous abuser, and the political fallout from the White House’s attempt to close his case.",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/michael-wolff-on-magas-revolt-over-jeffrey-epstein",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_9b35e801-3815-5cd5-8261-3e2e6a20f5eb.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_505ab2ba-ce43-5b0a-80f2-2c265771148c.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Charlamagne Struggles To Process News About CBS Cancelling Stephen Colbert’s Show",
    "description": "Charlamagne Tha God hysterically reacted to CBS' announcement that it will terminate Stephen Colbert’s “The Late Show” after the upcoming TV season.",
    "link": "https://dailycaller.com/2025/07/18/charlamagne-struggles-to-process-news-about-cbs-cancelling-stephen-colberts-show/",
    "timestamp": "2025-07-18T18:29:31Z"
  },
  {
    "title": "The new revelation about Trump and Jeffrey Epstein, explained",
    "description": "Just how close was Donald Trump to Jeffrey Epstein? The president’s onetime friendship with Jeffrey Epstein — the well-connected financier who was indicted for sex trafficking underage girls and died in prison in 2019 — has long been a matter of public record…",
    "link": "https://www.vox.com/politics/420340/jeffrey-epstein-trump-friends-birthday-book-secret",
    "timestamp": "2025-07-18T18:28:45Z"
  },
  {
    "title": "Skydance’s David Ellison Meets With FCC Chaiman Brendan Carr To Discuss Paramount Merger And Company’s “Commitment to Unbiased Journalism”",
    "description": "Skydance Media CEO David Ellison met with FCC Chairman Brendan Carr and other agency staffers this week to discuss the pending regulatory decision on the company’s merger with Paramount Global, where topics included news coverage. According to a filing with t…",
    "link": "http://deadline.com/2025/07/david-ellison-fcc-skydance-paramount-merger-1236462443/",
    "timestamp": "2025-07-18T18:28:17Z"
  },
  {
    "title": "The Tomato Tariff Racket",
    "description": "",
    "link": "https://biztoc.com/x/a0f07202ea27b3bb",
    "timestamp": "2025-07-18T18:27:53Z"
  },
  {
    "title": "Gavin Newsom mulls California redistricting to counter Texas gerrymandering",
    "description": "As President Donald Trump pushes Texas Republicans to adopt a controversial new redistricting plan to pad their congressional majority by up to five seats, California Gov. Gavin Newsom (D) has begun to float a similar scheme of his own: redrawing his state's …",
    "link": "https://biztoc.com/x/f0d9bcf835758b09",
    "timestamp": "2025-07-18T18:27:26Z"
  },
  {
    "title": "Stephen Colbert gets solidarity from fellow late-night hosts after cancellation news",
    "description": "Stephen Colbert was receiving messages of support and affection from his fellow late-night hosts after announcing that CBS was canceling his show, “The Late Show With Stephen Colbert,” next May.",
    "link": "https://www.clickorlando.com/entertainment/2025/07/18/stephen-colbert-gets-solidarity-from-fellow-late-night-hosts-after-cancellation-news/",
    "timestamp": "2025-07-18T18:26:19Z"
  },
  {
    "title": "FBI Agents Told To ‘Flag’ Epstein Files Mentioning Trump, Senator Claims",
    "description": "Senate Democrats pressed Pam Bondi and FBI leaders Friday for information about references to Trump in the Epstein files.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/18/fbi-agents-told-to-flag-epstein-files-mentioning-trump-senator-claims/",
    "timestamp": "2025-07-18T18:25:34Z"
  },
  {
    "title": "This Week in AI: AI Startups Hit Fundraising Gold",
    "description": "Fortunes are being spent in artificial intelligence (AI), with Perplexity, Thinking Machines and Anthropic attracting billions from investors. Meanwhile, Google, Meta and Blackstone have pledged to spend billions building AI data centers. Here is this week’s …",
    "link": "http://www.pymnts.com/news/artificial-intelligence/2025/this-week-in-ai-ai-startups-hit-fundraising-gold/",
    "timestamp": "2025-07-18T18:25:24Z"
  },
  {
    "title": "Donald Trump calls for release of Jeffrey Epstein testimony (Financial Times)",
    "description": "Financial Times:\nDonald Trump calls for release of Jeffrey Epstein testimony  —  US president directs attorney-general Pam Bondi to seek the unsealing of grand jury transcripts  —  Donald Trump has asked the US attorney-general to seek the release of grand ju…",
    "link": "https://www.memeorandum.com/250718/p84",
    "timestamp": "2025-07-18T18:25:05Z"
  },
  {
    "title": "For a ‘low payment,’ consultant offered to get Colorado counties off Trump’s list of sanctuary jurisdictions",
    "description": "\"When I received this email, I was floored. ... I saw it as the single most corrupt shakedown attempt that I've ever experienced, personally, in Colorado politics,\" a Jeffco commissioner said.",
    "link": "https://www.denverpost.com/2025/07/18/colorado-consultant-counties-immigration-sanctuary-jurisdictions-donald-trump/",
    "timestamp": "2025-07-18T18:25:03Z"
  },
  {
    "title": "Inside CBS’s Breakup With Stephen Colbert: Audience Shifts, Political Humor Made Unsustainable Mix",
    "description": "The state of late-night TV is keeping media executives from sleeping well. CBS’ decision to cut ties with Stephen Colbert and its decades-old “Late Show” franchise come next May will leave a major hole in the format — but one that has been widening. TV networ…",
    "link": "https://variety.com/2025/tv/news/inside-cbs-breakup-stephen-colbert-late-night-audience-1236464740/",
    "timestamp": "2025-07-18T18:22:43Z"
  },
  {
    "title": "What a Trump, Powell faceoff means for your money",
    "description": "Tensions are escalating between the White House and the Federal Reserve, with consumers caught in the middle.",
    "link": "https://www.cnbc.com/2025/07/18/what-trump-powell-faceoff-means-for-your-money.html",
    "timestamp": "2025-07-18T18:22:36Z"
  },
  {
    "title": "NPR’s chief STILL claiming there’s no bias in agenda-driven reporting",
    "description": "'We of course are a non-partisan organization and we want to serve and are required to serve the entirety of the American public'",
    "link": "https://www.wnd.com/2025/07/nprs-chief-still-claiming-theres-no-bias-agenda/",
    "timestamp": "2025-07-18T18:19:31Z"
  },
  {
    "title": "US rejects WHO global pandemic response accord",
    "description": "WASHINGTON (Reuters) -The United States has rejected an agreement adopted by members of the World Health Organization to improve preparedness for future pandemics following the disjointed global response to COVID-19, the government said on Friday. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/07/19/us-rejects-who-global-pandemic-response-accord",
    "timestamp": "2025-07-18T18:19:00Z"
  },
  {
    "title": "Gavin Newsom mulls California redistricting to counter Texas gerrymandering",
    "description": "A controversial plan has become a major flashpoint among Democrats struggling for traction in the Trump era",
    "link": "https://theweek.com/politics/newsom-texas-california-gerrymander-house",
    "timestamp": "2025-07-18T18:18:28Z"
  },
  {
    "title": "Organizers Call for Shutdown of Immigrant Jails as Trump Expands Incarceration",
    "description": "Despite public outrage, Trump is doubling down on deportation policies designed to incarcerate 100,000 immigrants.",
    "link": "https://truthout.org/articles/organizers-call-for-shutdown-of-immigrant-jails-as-trump-expands-incarceration/",
    "timestamp": "2025-07-18T18:17:05Z"
  },
  {
    "title": "CNN's Wolf Blitzer: Trump's Letter To Epstein Is \"So, So Graphic\"",
    "description": "CNN's Wolf Blitzer acts like he doesn't enjoy reading the \"so, so graphic\" letter",
    "link": "https://www.realclearpolitics.com/video/2025/07/18/cns_wolf_blitzer_trumps_letter_to_epstein_is_so_so_graphic_im_going_to_read_it_now.html",
    "timestamp": "2025-07-18T18:15:32Z"
  },
  {
    "title": "Trump pulls US from World Health pandemic reforms",
    "description": "President Donald Trump's administration said Friday the United States was rejecting changes agreed last year for the World Health Organization on its",
    "link": "https://insiderpaper.com/trump-pulls-us-from-world-health-pandemic-reforms/",
    "timestamp": "2025-07-18T18:15:24Z"
  },
  {
    "title": "Nancy Pelosi Tells Unassuming Reporter He’d Be ‘Good Candidate’ For Alcatraz Prison",
    "description": "Democrat California Rep. Nancy Pelosi told a Scripps News reporter that he could be a contender and he could be a strong contender as a prisoner at Alcatraz.",
    "link": "https://dailycaller.com/2025/07/18/alcatraz-nancy-pelosi-scripps-news-nathaniel-reed-donald-trump/",
    "timestamp": "2025-07-18T18:14:29Z"
  },
  {
    "title": "Steve Moore: Trump’s economic policies leading to positive results for Americans",
    "description": "'I think it's the remarkable part of this story is we got 2.7% inflation, and the media and the Democrats have gone crazy. We had 6%, 7, 8, 9% inflation under Biden'",
    "link": "https://www.wnd.com/2025/07/steve-moore-trumps-economic-policies-leading-positive-results/",
    "timestamp": "2025-07-18T18:13:35Z"
  },
  {
    "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday - AP News",
    "description": "President Donald Trump will sign a new cryptocurrency bill into law on FridayAP News ‘Put up or shut up’: Landmark win in Congress to test crypto's viabilityPolitico Trump to sign landmark crypto bill, the GENIUS Act, at White House ceremonyCBS News WATCH LIV…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178411806",
    "timestamp": "2025-07-18T18:13:28Z"
  },
  {
    "title": "'Terrible Development': Trump Admin Restricts State Efforts to Help Kids Stay on Medicaid",
    "description": "The Trump administration on Thursday said it will restrict waivers that have allowed states to keep kids enrolled in Medicaid or the Children's Health Insurance Program beyond the 12-month period of continuous coverage required under federal law.The Centers f…",
    "link": "https://www.commondreams.org/news/trump-administration-medicaid-changes",
    "timestamp": "2025-07-18T18:10:29Z"
  },
  {
    "title": "Foreign Correspondent S34E12 1080p HDTV H264-CBFM",
    "description": "Season 34, Episode 12 – \"Trumps Wellness Warriors USA\"A wellness revolution has captured the White House. Donald Trump's ex-wife Marla Maples reveals the inside story behind the Make America Healthy Again movement and the role she played in uniting Robert F K…",
    "link": "https://post.rlsbb.ru/foreign-correspondent-s34e12-1080p-hdtv-h264-cbfm/",
    "timestamp": "2025-07-18T18:10:02Z"
  },
  {
    "title": "Tulsi Gabbard Releases Evidence Of ‘Years-Long Coup’ On Trump",
    "description": "Tulsi Gabbard released what she called \"overwhelming evidence\" showing Obama and others \"manufactured and politicized intelligence\" after Trump's 2016 victory.",
    "link": "https://dailycaller.com/2025/07/18/breaking-tulsi-gabbard-releases-evidence-of-years-long-coup-on-trump/",
    "timestamp": "2025-07-18T18:09:19Z"
  },
  {
    "title": "‘The Murdochs Hate Trump’: Bannon Accuses The Wall Street Journal And Fox News of Trying to Destroy MAGA",
    "description": "“Last night, we saw it in all its ugliness. The Murdochs hate Trump. The Murdochs want to take down Trump,\" Bannon declared\nThe post ‘The Murdochs Hate Trump’: Bannon Accuses The Wall Street Journal And Fox News of Trying to Destroy MAGA first appeared on Med…",
    "link": "https://www.mediaite.com/politics/the-murdochs-hate-trump-bannon-accuses-the-wall-street-journal-and-fox-news-of-trying-to-destroy-maga/",
    "timestamp": "2025-07-18T18:09:14Z"
  },
  {
    "title": "Democratic Lawmaker Demands 'the Evidence About Trump' Following Pam Bondi's Plans to Release of Epstein Case Transcripts",
    "description": "A Democratic lawmaker is demanding more evidence from Jeffrey Epstein's case be released, which he believes could include President Donald Trump.",
    "link": "https://www.ibtimes.com/democratic-lawmaker-demands-evidence-about-trump-following-pam-bondis-plans-release-epstein-3778885",
    "timestamp": "2025-07-18T18:08:17Z"
  },
  {
    "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday",
    "description": "President Donald Trump will sign a new cryptocurrency bill into law on Friday\nWASHINGTON (AP) — President Donald Trump on Friday will sign into law a new set of regulations for a type of cryptocurrency that are seen as a way to legitimize the burgeoning indus…",
    "link": "https://biztoc.com/x/41775187f82fd8ee",
    "timestamp": "2025-07-18T18:05:37Z"
  },
  {
    "title": "Podcast – Rachel Blevins – Trump’s Betrayal, Epstein’s Secrets & The Israeli Connection",
    "description": "Rachel Blevins brings some refreshing insight on Epstein, foreign policy, and Trump’s flip-flops. Rachel Blevins returns to The Free Thought Project Podcast this week for a hard-hitting, unfiltered conversation about the state of U.S. foreign policy, media ma…",
    "link": "https://www.activistpost.com/podcast-rachel-blevins-trumps-betrayal-epsteins-secrets-the-israeli-connection/",
    "timestamp": "2025-07-18T18:05:00Z"
  },
  {
    "title": "Donald Trump Jr., Omeed Malik are all about investing in companies that enhance US prosperity, even as GrabAGun has rocky debut",
    "description": "“A lot of the things that we've done over the last few years [have come] out of necessity,” Donald Trump Jr. said of 1789 Capital. “We saw the affront on not just ourselves and our family businesses, but on so many Americans — and we have that ability to push…",
    "link": "https://nypost.com/2025/07/18/business/1789-capital-investing-in-brands-that-enhance-us-prosperity/",
    "timestamp": "2025-07-18T18:04:47Z"
  },
  {
    "title": "The California Lawmaker Sounding the Alarm on Trump’s “Crypto Week”",
    "description": "As the Genius Act lands on the president’s desk, the California lawmaker says she’s concerned that “the rug will be pulled out from under the unsuspecting investors.”",
    "link": "https://www.vanityfair.com/news/story/the-california-lawmaker-sounding-the-alarm-on-trumps-crypto-week",
    "timestamp": "2025-07-18T18:02:53Z"
  },
  {
    "title": "If AUKUS Is Toast, What Should Australia Do Next?",
    "description": "Amid Elbridge Colby’s review of the submarine deal, three books consider the future of the alliance itself.",
    "link": "http://foreignpolicy.com/2025/07/18/australia-aukus-pentagon-review-indo-pacific/",
    "timestamp": "2025-07-18T18:00:04Z"
  },
  {
    "title": "10 signs of President's painful diagnosis... | | Swollen ankles, leg cramps, flaky skin...",
    "description": "DONALD Trump has been diagnosed with a painful vein condition after photos showed the US president with swollen ankles and bruised hands. The 79-year-old was given a thorough examination by White H…",
    "link": "https://www.the-sun.com/health/14750677/swollen-ankles-leg-cramps-donald-trumps-chronic-venous-insufficiency/",
    "timestamp": "2025-07-18T18:00:03Z"
  },
  {
    "title": "Trump, Vance and Musk are avatars of a dark and dangerous force",
    "description": "James Carville recently suggested that Democrats need to do more to reach out to young men, as though pandering to testosterone-fueled grievance and entitlement is the key to winning elections. Let’s be blunt: that’s a bullshit, dead-end strategy that risks r…",
    "link": "https://www.rawstory.com/raw-investigates/toxic-masculinity/",
    "timestamp": "2025-07-18T18:00:02Z"
  },
  {
    "title": "Bitcoin becomes 5th global asset ahead of “Crypto Week,” flips Amazon: Finance Redefined",
    "description": "Bitcoin flipped Amazon to become the fifth-largest global asset, fueled by investor excitement for more regulatory clarity after “Crypto Week” in Washington.",
    "link": "https://cointelegraph.com/news/bitcoin-5th-global-asset-crypto-week-amazon-finance-redefined",
    "timestamp": "2025-07-18T18:00:00Z"
  },
  {
    "title": "Congress Enshrines New Name for Wildlife Refuge to Honor Slain Texas Girl",
    "description": "The House of Representatives approved a bill this week enshrining the name of a wildlife preserve to memorialize a young Texas girl killed more than... Read More\nThe post Congress Enshrines New Name for Wildlife Refuge to Honor Slain Texas Girl appeared first…",
    "link": "https://www.dailysignal.com/2025/07/18/congress-enshrines-new-name-for-wildlife-refuge-to-honor-slain-texas-girl/",
    "timestamp": "2025-07-18T17:59:55Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "It's an effort to put to rest a political crisis largely of Trump's own making.",
    "link": "https://www.denverpost.com/2025/07/18/trump-epstein-explained/",
    "timestamp": "2025-07-18T17:58:27Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "It's an effort to put to rest a political crisis largely of Trump's own making.",
    "link": "https://www.bostonherald.com/2025/07/18/trump-epstein-explained/",
    "timestamp": "2025-07-18T17:58:27Z"
  },
  {
    "title": "With Colbert exit, Canada will lose the talk show host most attuned to our whims and politics",
    "description": "Whatever the reasons, next year's cancellation of The Late Show with Stephen Colbert will see the departure of the host in the current era of late night television who kept Canada in his sights, as the relationship with the U.S. turned from friendly with occa…",
    "link": "https://www.cbc.ca/news/entertainment/colbert-show-cancellation-canada-1.7588303",
    "timestamp": "2025-07-18T17:58:21Z"
  },
  {
    "title": "Senate Considers Ending Its Vetting of Spy Agencies’ Top Lawyers",
    "description": "The US Senate is considering giving up crucial authority over key intelligence officials responsible for assuring major agencies comply with legal restrictions and the Constitution.",
    "link": "https://financialpost.com/pmn/business-pmn/senate-considers-ending-its-vetting-of-spy-agencies-top-lawyers",
    "timestamp": "2025-07-18T17:58:21Z"
  },
  {
    "title": "Ministry to regulate US$15 billion US energy imports",
    "description": "Energy and Mineral Resources Minister Bahlil Lahadalia is preparing a regulation for planned energy imports, worth up to US$15 billion from the United States ...",
    "link": "https://en.antaranews.com/news/367481/ministry-to-regulate-us15-billion-us-energy-imports",
    "timestamp": "2025-07-18T17:58:04Z"
  },
  {
    "title": "Donald Trump pushes for 15%-20% minimum tariff on all EU goods",
    "description": "US president also rejects reducing 25% sectoral duties on cars from the bloc, say diplomats",
    "link": "https://www.irishtimes.com/business/2025/07/18/donald-trump-pushes-for-15-20-minimum-tariff-on-all-eu-goods/",
    "timestamp": "2025-07-18T17:57:59Z"
  },
  {
    "title": "WSJ Reveals Trump Once Wrote 'BOOBS' On A Calculator And Showed It To Epstein",
    "description": "U.S. — In a shocking exposé that threatened to topple the presidential administration, the Wall Street Journal revealed that Donald Trump once wrote &#34;BOOBS&#34; on a calculator and showed it to Jeffrey Epstein.",
    "link": "https://babylonbee.com/news/wsj-reveals-trump-once-wrote-boobs-on-a-calculator-and-showed-it-to-epstein",
    "timestamp": "2025-07-18T17:57:55Z"
  },
  {
    "title": "Trump Admin Seeks 1-Day Sentence for Cop Convicted in Killing of Breonna Taylor",
    "description": "The Trump administration is effectively seeking impunity for the police in the killing that sparked nationwide protest.",
    "link": "https://truthout.org/articles/trump-admin-seeks-1-day-sentence-for-cop-convicted-in-killing-of-breonna-taylor/",
    "timestamp": "2025-07-18T17:57:31Z"
  },
  {
    "title": "US declares Lashkar proxy TRF a terror group after Pahalgam attack",
    "description": "The US has designated The Resistance Front (TRF), a proxy of Lashkar-e-Taiba, as a foreign terrorist organization after it claimed responsibility for the deadly Pahalgam attack in 2025. This move, hailed by India, strengthens counter-terrorism cooperation bet…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-declares-lashkar-proxy-trf-a-terror-group-after-pahalgam-attack/articleshow/122770645.cms",
    "timestamp": "2025-07-18T17:57:03Z"
  },
  {
    "title": "Creating Schedule G in the Excepted Service (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nCreating Schedule G in the Excepted Service  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including sections 3301, 3302, and 7511 of title 5, Unite…",
    "link": "https://www.memeorandum.com/250718/p79",
    "timestamp": "2025-07-18T17:55:01Z"
  },
  {
    "title": "Murdoch stood up to Trump. Did Paramount fold?",
    "description": "Donald Trump is trying to make media companies bend to his will.\nGetty Images\nSince last fall's election, Donald Trump has been getting media companies to give him what he wants.\nDid that happen when Paramount canceled Stephen Colbert's show? There's no repor…",
    "link": "https://biztoc.com/x/4e71976d8b7516aa",
    "timestamp": "2025-07-18T17:54:36Z"
  },
  {
    "title": "Brazil's Ex-President Bolsonaro Ordered To Wear Ankle Monitor: \"Meant To Utterly Humiliate Me\" For Trump Ties",
    "description": "Brazil's Ex-President Bolsonaro Ordered To Wear Ankle Monitor: \"Meant To Utterly Humiliate Me\" For Trump Ties\n \nThe man called among many \"The Brazilian Donald Trump\" or also the \"Trump of the Tropics\" is continuing to endure a drawn-out legal saga, to which …",
    "link": "https://biztoc.com/x/f85c0f0174994db2",
    "timestamp": "2025-07-18T17:54:22Z"
  },
  {
    "title": "Trump administration kills $18.5 million in funding for diversity, LGBTQ+ support",
    "description": "Homeland Security Secretary Kristi Noem has just canceled $18.5 million in grants to LGBTQ+ programs and those promoting diversity, equity, and inclusion.",
    "link": "https://www.advocate.com/news/dei-lgbtq-grants-canceled",
    "timestamp": "2025-07-18T17:53:50Z"
  },
  {
    "title": "Appeals Court Judge Claims (Against All Historical Evidence) That The First Amendment Doesn’t Apply To Non-Citizens",
    "description": "We’ve written before about how attacks on free speech often start with unpopular speakers who lack political power. That’s why a new dissenting opinion from Trump-appointed Judge Paul Matey should set off alarm bells for anyone who cares about the First Amend…",
    "link": "https://www.techdirt.com/2025/07/18/appeals-court-judge-claims-against-all-historical-evidence-that-the-first-amendment-doesnt-apply-to-non-citizens/",
    "timestamp": "2025-07-18T17:53:50Z"
  },
  {
    "title": "'Murdered': Critics aren't buying CBS' effort to gloss over Stephen Colbert firing",
    "description": "U.S. Sen. Elizabeth Warren was among those calling into question the official story behind CBS' cancellation of \"The Late Show with Stephen Colbert\" on Thursday—suggesting that the decision to end the show's 32-year run wasn't driven by finances but by \"polit…",
    "link": "https://www.rawstory.com/murdered-critics-aren-t-buying-cbs-effort-to-gloss-over-stephen-colbert-firing/",
    "timestamp": "2025-07-18T17:53:25Z"
  },
  {
    "title": "Brazil’s former President Bolsonaro ordered to wear an electronic ankle monitor",
    "description": "The development came as searches were conducted at his home and his party’s headquarters.",
    "link": "https://www.bostonherald.com/2025/07/18/brazil-bolsonaro-ankle-monitor/",
    "timestamp": "2025-07-18T17:52:55Z"
  },
  {
    "title": "ICE Is Shipping Detainees to Hawaii as Bed Space on the U.S. Mainland Fills Up",
    "description": "Immigrant detainees transferred thousands of miles from where they were first arrested face unique challenges in immigration court.",
    "link": "https://reason.com/2025/07/18/ice-is-shipping-detainees-to-hawaii-as-bed-space-on-the-u-s-mainland-fills-up/",
    "timestamp": "2025-07-18T17:52:23Z"
  },
  {
    "title": "CNN Panelist Seriously Suggests Trump Was Never Shot In Ear",
    "description": "Touré, the host of the \"Truth Talks\" podcast, floated the idea that President Donald Trump was never shot in the ear.",
    "link": "https://dailycaller.com/2025/07/18/cnn-toure-trump-shot-ear/",
    "timestamp": "2025-07-18T17:52:21Z"
  },
  {
    "title": "Murdoch stood up to Trump. Did Paramount fold?",
    "description": "A shocking change in late-night TV. A salacious story about Jeffrey Epstein. What do they have in common? Donald Trump.",
    "link": "https://www.businessinsider.com/donald-trump-stephen-colbert-late-show-wsj-epstein-2025-7",
    "timestamp": "2025-07-18T17:50:51Z"
  },
  {
    "title": "Report: Mossad chief sought US help in relocating Gazans",
    "description": "Axios reports that Mossad Director David Barnea met US envoy Steve Witkoff in Washington to seek American support in persuading Ethiopia, Indonesia and Libya to accept hundreds of thousands of displaced Gazans.",
    "link": "https://www.israelnationalnews.com/news/411901",
    "timestamp": "2025-07-18T17:50:14Z"
  },
  {
    "title": "House Republicans Pushing New Amnesty Bill Have Stabbed Conservatives In The Back",
    "description": "It clearly illustrates congressional Republicans’ apparent compulsion to betray their base.Conservatives supported the Big Beautiful Bill on the promise that it would kick deportations and border enforcement into overdrive, and less than two weeks later Repub…",
    "link": "https://freerepublic.com/focus/f-news/4329419/posts",
    "timestamp": "2025-07-18T17:48:53Z"
  },
  {
    "title": "Trump launches defence of inaction in Epstein case following report he sent lewd birthday letter",
    "description": "US president’s aides expected to ask court to release grand jury testimony about convicted sex offender",
    "link": "https://www.irishtimes.com/wires/reuters/business/2025/07/18/trump-launches-defence-of-inaction-in-epstein-case-following-report-he-sent-lewd-birthday-letter/",
    "timestamp": "2025-07-18T17:47:56Z"
  },
  {
    "title": "Trump launches defence of inaction in Epstein case following report he sent lewd birthday letter",
    "description": "US president’s aides expected to ask court to release grand jury testimony about convicted sex offender",
    "link": "https://www.irishtimes.com/world/us/2025/07/18/trump-launches-defence-of-inaction-in-epstein-case-following-report-he-sent-lewd-birthday-letter/",
    "timestamp": "2025-07-18T17:47:56Z"
  },
  {
    "title": "Trump to Bondi: Work on releasing Epstein case grand jury transcripts",
    "description": "Democrats ignored scandal for years, but now seeking to find something to use against president",
    "link": "https://www.wnd.com/2025/07/trump-bondi-work-releasing-epstein-case-grand-jury/",
    "timestamp": "2025-07-18T17:46:26Z"
  },
  {
    "title": "Fed Governor Chris Waller says he would accept Jerome Powell’s job if Trump asks",
    "description": "Waller favors a rate cut at the Fed's upcoming July 29-30 meeting because he feels the tariffs are likely to have a limited impact on inflation.",
    "link": "https://nypost.com/2025/07/18/business/fed-governor-chris-waller-says-hes-willing-to-lead-fed-if-trump-asks/",
    "timestamp": "2025-07-18T17:46:06Z"
  },
  {
    "title": "Republicans have stopped fearing 'the ratchet effect'",
    "description": "Democrats love to describe the “chaos” President Donald Trump is causing in Washington. Hakeem Jeffries, who likes to speak in alliterative triplets, calls this a time of “chaos, cruelty, and corruption.” Midterm candidates say they were inspired to run to fi…",
    "link": "https://biztoc.com/x/c29128afdf4cf92b",
    "timestamp": "2025-07-18T17:43:32Z"
  },
  {
    "title": "How Israel’s energy diplomacy is fueling the Gaza genocide",
    "description": "Energy exports play a central role in Israel's campaign to normalize relations with its neighbors and avoid accountability for its ongoing genocide of Palestinians. An energy embargo on Israel should go hand-in-hand with calls for an arms embargo.",
    "link": "https://mondoweiss.net/2025/07/how-israels-energy-diplomacy-is-fueling-the-gaza-genocide/",
    "timestamp": "2025-07-18T17:43:00Z"
  },
  {
    "title": "House gives final approval to Trump’s $9 billion cut to public broadcasting and foreign aid",
    "description": "The House gave final approval to President Donald Trump’s request to claw back about $9 billion for public broadcasting and foreign aid early Friday as Republicans intensified their efforts to target institutions and programs they view as bloated or out of st…",
    "link": "https://freerepublic.com/focus/f-news/4329412/posts",
    "timestamp": "2025-07-18T17:42:45Z"
  },
  {
    "title": "What to know about Ayman Soliman, the detained Muslim chaplain whose supporters were arrested",
    "description": "Protesters in Ohio have been arrested while demonstrating against the detention of Ayman Soliman, an Egyptian immigrant who worked as a Muslim chaplain at Cincinnati Children’s Hospital",
    "link": "https://abcnews.go.com/US/wireStory/ayman-soliman-detained-muslim-chaplain-supporters-arrested-123870405",
    "timestamp": "2025-07-18T17:42:02Z"
  },
  {
    "title": "Surprise medical bills were supposed to be a thing of the past. Here’s why they’re not",
    "description": "The No Surprises Act protects patients primarily from only one particularly egregious type of surprise bill.",
    "link": "https://www.ocregister.com/2025/07/18/surprise-medical-bills-were-supposed-to-be-a-thing-of-the-past-heres-why-theyre-not/",
    "timestamp": "2025-07-18T17:40:41Z"
  },
  {
    "title": "Is Trump in the Epstein Files? All About Their Friendship.",
    "description": "Is Trump in the Epstein files or on the ‘client list’? Were they close friends? Amid the Trump birthday-letter fallout, here’s what we know about Trump’s relationship with Epstein, including photos, flight logs, and the timeline of their friendship.",
    "link": "http://nymag.com/intelligencer/article/trump-epstein-files-friends-relationship-history.html",
    "timestamp": "2025-07-18T17:40:00Z"
  },
  {
    "title": "FBI agents were told to 'flag' any Epstein records that mentioned Trump, Sen. Durbin says (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nFBI agents were told to ‘flag’ any Epstein records that mentioned Trump, Sen. Durbin says  — FBI agents assigned to review files in the criminal case against Jeffrey Epstein were instructed to “flag” any documents that mentioned President D…",
    "link": "https://www.memeorandum.com/250718/p76",
    "timestamp": "2025-07-18T17:40:00Z"
  },
  {
    "title": "Trump Adds Insult to Injury for Stephen Colbert",
    "description": "\"Greg Gutfeld is better than all of them combined, including the Moron on NBC who ruined the once great Tonight Show.\"",
    "link": "https://www.westernjournal.com/trump-adds-insult-injury-stephen-colbert/",
    "timestamp": "2025-07-18T17:39:24Z"
  },
  {
    "title": "Pedo Or Not, Trump Has Made Life Easier For Child Predators",
    "description": "While Donald Trump looks more and more like he’s engaging in a massive cover up of the Jeffrey Epstein files, Rep. Jamie Raskin pointed out that Trump’s policies are far more dangerous for children now than the deceased Epstein can ever be again.\nNot that tha…",
    "link": "https://crooksandliars.com/2025/07/pedo-or-not-trump-has-made-life-easier",
    "timestamp": "2025-07-18T17:39:08Z"
  },
  {
    "title": "Republican who lost to Tim Walz in 2022 announces another Minnesota gubernatorial bid",
    "description": "Former state Sen. Scott Jensen, who lost the 2022 Minnesota gubernatorial race to Gov. Tim Walz, has announced another run for the governorship.",
    "link": "https://www.foxnews.com/politics/republican-who-lost-tim-walz-2022-announces-another-minnesota-gubernatorial-bid",
    "timestamp": "2025-07-18T17:37:40Z"
  }
]