[
  {
    "title": "Three Va. businesses plan layoffs to prepare for uncertain future",
    "description": "Three Virginia three companies issued notices to Virginia about their plans for layoffs in early December amid upheaval in federal funding for health care and government contracting.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_68b973b3-2860-43bb-8146-0b6034d1463d.html",
    "timestamp": "2025-10-14T10:20:00Z"
  },
  {
    "title": "'Too crazy even for RFK!' Experts watch key aide alienated by latest Trump plan",
    "description": "President Donald Trump's stance on childhood vaccines appears to be so controversial that they're alienating one of his key cabinet members, a move that stunned two analysts on Monday. Sam Stein, managing editor of The Bulwark, said on the podcast \"Bulwark Ta…",
    "link": "https://www.rawstory.com/trump-vaccines-2674181267/",
    "timestamp": "2025-10-14T10:19:07Z"
  },
  {
    "title": "Analysis-Dollar gains from rivals' trouble may lack staying power",
    "description": "NEW YORK (Reuters) -A rebound in the dollar over the past month is unlikely to last given it was largely due to repositioning over temporary factors...",
    "link": "https://finance.yahoo.com/news/analysis-dollar-gains-rivals-trouble-101816296.html",
    "timestamp": "2025-10-14T10:18:16Z"
  },
  {
    "title": "Inside Legacy: the MLM that thrives in secrecy",
    "description": "Has your friend started wearing a suit, posting from ‘business conferences’ and using the diamond emoji a lot? They may have joined Legacy.",
    "link": "https://thespinoff.co.nz/business/14-10-2025/inside-legacy-the-mlm-that-thrives-in-secrecy",
    "timestamp": "2025-10-14T10:17:49Z"
  },
  {
    "title": "Trump Fumes at Time Magazine’s ‘Super Bad’ New Cover Celebrating His Gaza Peace Deal ‘Triumph’: ‘They Disappeared My Hair!’",
    "description": "Trump slammed Time for what he called “the Worst of All Time” photo choice for a new cover – even as the publication hailed his Gaza peace deal as a “triumph.”\nThe post Trump Fumes at Time Magazine’s ‘Super Bad’ New Cover Celebrating His Gaza Peace Deal ‘Triu…",
    "link": "https://www.mediaite.com/online/trump-fumes-at-time-magazines-super-bad-new-cover-celebrating-his-gaza-peace-deal-triumph-they-disappeared-my-hair/",
    "timestamp": "2025-10-14T10:13:30Z"
  },
  {
    "title": "Trump draws praise from more than just MAGA as Israeli hostages return home - Politico",
    "description": "Trump draws praise from more than just MAGA as Israeli hostages return homePolitico A Divided Israel Unites in Joy as Hostages Come HomeThe New York Times Who are the 20 hostages released by Hamas?NBC News President Trump Delivers Remarks to Israeli KnessetC-…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179777678",
    "timestamp": "2025-10-14T10:12:53Z"
  },
  {
    "title": "The End Of Doctor Who in The Daily LITG 14th of October 2025",
    "description": "The End Of Doctor Who was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history of co…",
    "link": "https://bleedingcool.com/tv/the-end-of-doctor-who-in-the-daily-litg-14th-of-october-2025/",
    "timestamp": "2025-10-14T10:11:05Z"
  },
  {
    "title": "EU seeks US alliance to counter China rare earth crackdown",
    "description": "HORSENS, Denmark: The European Union is seeking to coordinate a response with the United States and other G7 partners to tighter Chinese controls on the export of rare earth minerals, trade minist",
    "link": "https://www.channelnewsasia.com/world/eu-us-g7-china-rare-earths-controls-response-trade-5400966",
    "timestamp": "2025-10-14T10:10:00Z"
  },
  {
    "title": "More Days Go By, More Bribes for Trump | Opinion",
    "description": "Corruption on an unprecedented scale is the beating heart of President Donald Trump’s administration. The rest is a distraction.\nThe latest bribe paid to Trump comes from YouTube. Trump filed a bogus lawsuit against the company that pivoted on the ridiculous …",
    "link": "https://biztoc.com/x/b43b0bf132f5611f",
    "timestamp": "2025-10-14T10:09:52Z"
  },
  {
    "title": "Indonesian president asks Trump for meeting with son Eric in 'hot mic' moment",
    "description": "JAKARTA (Reuters) -Indonesian President Prabowo Subianto asked U.S. President Donald Trump on Monday if he could meet with Trump's son Eric, an executive...",
    "link": "https://www.yahoo.com/news/articles/indonesian-president-asks-trump-meeting-100906308.html",
    "timestamp": "2025-10-14T10:09:06Z"
  },
  {
    "title": "Analysis-Trump's Tylenol claims limit M&A options for parent company Kenvue",
    "description": "(Reuters) -Tylenol maker Kenvue was already having a painful year before U. President Donald Trump and his health secretary got involved.",
    "link": "https://finance.yahoo.com/news/analysis-trumps-tylenol-claims-limit-100850715.html",
    "timestamp": "2025-10-14T10:08:50Z"
  },
  {
    "title": "Russian aerial attack hits a Ukrainian hospital, days before Zelenskyy meets Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy says Russian forces have launched powerful glide bombs and drones against Kharkiv and hit a hospital. Officials said that the attack on Ukraine's second-largest city wounded seven people and forced the evacuation of 50 …",
    "link": "https://apnews.com/article/russia-ukraine-zelenskyy-trump-tomahawks-a8ad84233358f7592fa11cda08e82610",
    "timestamp": "2025-10-14T10:06:03Z"
  },
  {
    "title": "Analysis-Trump's Tylenol claims limit M&A options for parent company Kenvue",
    "description": "(Reuters) -Tylenol maker Kenvue was already having a painful year before U. President Donald Trump and his health secretary got involved.",
    "link": "https://finance.yahoo.com/news/analysis-trumps-tylenol-claims-limit-100544997.html",
    "timestamp": "2025-10-14T10:05:44Z"
  },
  {
    "title": "Kamala Harris commends 'the President' in Middle East statement, but omits Trump's name",
    "description": "Former Vice President Kamala Harris issued a statement in which she commended President Donald Trump and his team, without mentioning Trump by name",
    "link": "https://www.foxnews.com/politics/kamala-harris-commends-the-president-middle-east-statement-omits-trumps-name",
    "timestamp": "2025-10-14T10:03:19Z"
  },
  {
    "title": "Bombing stops, but Gazans have little to celebrate",
    "description": "Two years of war have created a sense of despair and hopelessness",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/10/13/world/europe/gazans-relief-gloom.html",
    "timestamp": "2025-10-14T10:03:03Z"
  },
  {
    "title": "Ethereum ETFs Bleed $429M in Largest Single-Day Outflow Since Early September",
    "description": "Analysts call the exodus a \"macro reflex\" triggered by tariff-driven volatility and liquidations, not a structural retreat from ETH exposure.",
    "link": "https://decrypt.co/344170/ethereum-etfs-bleed-429m-in-largest-single-day-outflow-since-early-september",
    "timestamp": "2025-10-14T10:02:31Z"
  },
  {
    "title": "Argentina's Milei heads to White House for lifeline",
    "description": "Embattled Argentine President Javier Milei is visiting the White House today, banking on a high-profile show of political and economic support from ally President Donald Trump ahead of crunch legislative elections.",
    "link": "https://www.rte.ie/news/world/2025/1014/1538473-argentina-us-meeting/",
    "timestamp": "2025-10-14T10:02:20Z"
  },
  {
    "title": "Bill O’Reilly Says Trump Has Won Over ‘the Entire Arab World’ With Peace Deal: ‘They’re All Behind the United States’",
    "description": "Bill O'Reilly claimed on Monday that President Donald Trump had won \"over the entire Arab world\" and that they were now \"all behind the United States.\"\nThe post Bill O’Reilly Says Trump Has Won Over ‘the Entire Arab World’ With Peace Deal: ‘They’re All Behind…",
    "link": "https://www.mediaite.com/media/tv/bill-oreilly-says-trump-has-won-over-the-entire-arab-world-with-peace-deal-theyre-all-behind-the-united-states/",
    "timestamp": "2025-10-14T10:02:00Z"
  },
  {
    "title": "Trump goes from McDonald’s to Middle East peace in ‘one of the greatest political comebacks,’ Thiessen says",
    "description": "Fox News contributor Marc Thiessen says President Donald Trump's political comeback helped create peace and release of hostages in the Middle East .",
    "link": "https://www.foxnews.com/media/trump-goes-from-mcdonalds-middle-east-peace-one-greatest-political-comebacks-thiessen-says",
    "timestamp": "2025-10-14T10:00:59Z"
  },
  {
    "title": "US senator seeks Commerce Department investigation into Megaspeed",
    "description": "SAN FRANCISCO (Reuters) -U.S. Republican Senator Tom Cotton has asked the Commerce Department to investigate Singapore-based Megaspeed for allegedly...",
    "link": "https://www.yahoo.com/news/articles/us-senator-seeks-commerce-department-100048582.html",
    "timestamp": "2025-10-14T10:00:48Z"
  },
  {
    "title": "Pattern of leftist violence grows as Trump nears 10 months in office",
    "description": "Tensions are rising as leftist violence surges and Democrats seek to establish new political alliances during President Donald Trump's second term.",
    "link": "https://www.foxnews.com/politics/pattern-leftist-violence-grows-trump-nears-10-months-office",
    "timestamp": "2025-10-14T10:00:35Z"
  },
  {
    "title": "After Trump declares ‘war is over,’ Hamas executes rivals in Gaza to reassert control",
    "description": "Gaza faces critical test as Hamas disarmament and stabilization force deployment will determine whether rebuilding begins or chaos returns to the region.",
    "link": "https://www.foxnews.com/world/after-trump-declares-war-over-hamas-executes-rivals-gaza-reassert-control",
    "timestamp": "2025-10-14T10:00:31Z"
  },
  {
    "title": "Border state university students share mixed views on Trump immigration policies and National Guard deployment",
    "description": "Fox News Digital spoke with students attending TPUSA tour stop at The University of North Dakota about illegal immigration, border security, and National Guard deployed in major cities.",
    "link": "https://www.foxnews.com/media/border-state-university-students-share-mixed-views-trump-immigration-policies-national-guard-deployment",
    "timestamp": "2025-10-14T10:00:25Z"
  },
  {
    "title": "Watchdog group seeks probe of Comey, Letitia James cases",
    "description": "Former federal ethics officials are asking the Justice Department's watchdog to look into the prosecutions of James Comey and Letitia James, which they called a \"turning point in our democracy.\"",
    "link": "https://www.cbsnews.com/news/watchdog-group-seeks-probe-of-comey-letitia-james-cases/",
    "timestamp": "2025-10-14T10:00:09Z"
  },
  {
    "title": "Gaza’s Broken Politics",
    "description": "Every movement that claimed to speak for Palestinians has failed them. The next chapter must belong to those who have endured the devastation.",
    "link": "https://www.newyorker.com/news/essay/gazas-broken-politics",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "NASA Is Crucial to the U.S. Winning the New Space Race",
    "description": "The U.S. wants to remain a superpower in space. It can’t without supporting NASA",
    "link": "https://www.scientificamerican.com/article/nasa-is-crucial-to-the-u-s-winning-the-new-space-race/",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "The fighting in Gaza is over — but Netanyahu’s domestic battles have just begun",
    "description": "The unpopular Israeli prime minister faces a corruption trial and a possible inquiry into his government's failures leading to Hamas’ October 7 attack.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/israel-gaza-war-ceasefire-netanyahu-hamas-peace-plan-rcna236989",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "Has the Supreme Court Abandoned Originalism?",
    "description": "The Supreme Court is poised to deliver a series of rulings this term that dramatically expand President Donald Trump’s powers. Chief Justice John Roberts and his colleagues will likely claim that they are faithfully applying the original public intent of the …",
    "link": "https://newrepublic.com/article/201724/supreme-court-caleb-nelson-originalism",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "Another Nobel Prize That Trump Will Never Win: Economics",
    "description": "If the awarding of any Nobel this past week can be read as a rebuke to President Donald Trump, it isn’t the Peace Prize. The notion of Trump as Peace Prize laureate was always grotesque. As TNR’s Alex Shephard noted, Gaza or no Gaza, “He is running an increas…",
    "link": "https://newrepublic.com/article/201727/nobel-prize-trump-universities-economics",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "Mike Johnson's plan to keep the House closed is backfiring",
    "description": "Amid pressure around the government shutdown and a discharge petition over the Epstein files, House Republican leaders have kept their members out of Washington.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnsons-house-shutdown-epstein-files-rcna237374",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "The Mainstream Media Is Moving Right. Here’s What We Can Do About It.",
    "description": "Bari Weiss is settling into a big new job at CBS News, empowering her to send Elon Musk–style memos demanding staffers justify their employment at the network. The Washington Post, which had already dumped its only Black female columnist, recently dismissed m…",
    "link": "https://newrepublic.com/article/201692/mainstream-media-moving-right-fix",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "Putin Is Not Winning",
    "description": "Underestimating the Russian leader is dangerous, but ascribing dark powers to him plays right into his hands.",
    "link": "https://www.theatlantic.com/international/archive/2025/10/overestimating-putin-russia-ukraine-war/684518/",
    "timestamp": "2025-10-14T10:00:00Z"
  },
  {
    "title": "Putin Ally Issues Ominous Nuclear Warning to Trump",
    "description": "President Alexander Lukashenko of Belarus, a key ally of the Kremlin, said the U.S. giving Ukraine long-range Tomahawk cruise missiles to use against Russia would lead to nuclear war.\nRussia has deployed tactical nuclear weapons to its neighbor, Belarus.\nU.S.…",
    "link": "https://biztoc.com/x/2db4e6347fc2214a",
    "timestamp": "2025-10-14T09:58:47Z"
  },
  {
    "title": "After Gaza peace summit, Trump eyes more diplomatic deals",
    "description": "US President Donald Trump returns from the Middle East with momentum at his back, after receiving a standing ovation at Israel’s parliament as living Israeli hostages were released by Hamas.\nThe Trump-backed peace agreement — which thus far is sticking — is a…",
    "link": "https://biztoc.com/x/4b703c0aa1df4816",
    "timestamp": "2025-10-14T09:58:42Z"
  },
  {
    "title": "Russian aerial attack hits a Ukrainian hospital, days before Zelenskyy meets Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy says Russian forces have launched powerful glide bombs and drones against Kharkiv and hit a hospital",
    "link": "https://abcnews.go.com/Business/wireStory/russian-aerial-attack-hits-ukrainian-hospital-days-zelenskyy-126500611",
    "timestamp": "2025-10-14T09:54:01Z"
  },
  {
    "title": "Report: Four killed in Israeli drone strike in Gaza despite ceasefire",
    "description": "Four people were killed on Tuesday in an Israeli drone attack east of Gaza City despite the recently agreed ceasefire, the Palestinian news agency WAFA...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251014-99-324803/",
    "timestamp": "2025-10-14T09:52:28Z"
  },
  {
    "title": "‘They disappeared my hair’ – Trump",
    "description": "The US president has bemoaned a TIME magazine cover photo celebrating his role in the Gaza ceasefire deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626409-trump-time-cover-crown/",
    "timestamp": "2025-10-14T09:52:16Z"
  },
  {
    "title": "From 'sorry if' to bankrobber jibes: The key takeaways from the Pat Kenny Áras debate",
    "description": "Both candidates were less combative than we have seen them before.",
    "link": "https://www.thejournal.ie/newstalk-presidential-debate-2025-pat-kenny-6843776-Oct2025/",
    "timestamp": "2025-10-14T09:50:19Z"
  },
  {
    "title": "America Needs Patriotism",
    "description": "The experiment only works if people believe in it.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/11/american-patriotism-democracy-culture/684337/",
    "timestamp": "2025-10-14T09:50:00Z"
  },
  {
    "title": "The Beacon of Democracy Goes Dark",
    "description": "For nearly 250 years, America promoted freedom and equality abroad, even when it failed to live up to those ideals itself. Not anymore.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/11/america-democracy-autocracy/684335/",
    "timestamp": "2025-10-14T09:50:00Z"
  },
  {
    "title": "The Rising",
    "description": "The country needs a mass social movement—now—to save itself from autocracy.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/11/autocracy-resistance-social-movement/684336/",
    "timestamp": "2025-10-14T09:50:00Z"
  },
  {
    "title": "Trump Melts Down at Unflattering Photo of His Hair in Late-Night Rant",
    "description": "President Donald Trump complained in a late-night social media post that TIME magazine had published a photo of him that “may be the Worst of All Time” to...",
    "link": "https://www.thedailybeast.com/donald-trump-melts-down-at-unflattering-time-magazine-photo-of-his-hair-in-late-night-rant/",
    "timestamp": "2025-10-14T09:43:50Z"
  },
  {
    "title": "Russian aerial attack hits a Ukrainian hospital, days before Zelenskyy meets Trump",
    "description": "KYIV, Ukraine (AP) — Russian forces launched powerful glide bombs and drones against Ukraine’s second-largest city in overnight attacks, hitting a hospital and wounding seven people, an official said Tuesday, as Ukrainian President Volodymyr Zelenskyy prepare…",
    "link": "https://financialpost.com/pmn/russian-aerial-attack-hits-a-ukrainian-hospital-days-before-zelenskyy-meets-trump",
    "timestamp": "2025-10-14T09:41:46Z"
  },
  {
    "title": "Trump and Xi Spark Another Standoff",
    "description": "“President Donald Trump and Chinese leader Xi Jinping’s latest tit-for-tat showdown has both countries claiming the ball is now in the other’s court, with the clock ticking toward another escalation in import tariffs,” Bloomberg reports.",
    "link": "https://politicalwire.com/2025/10/14/trump-and-xi-spark-another-standoff/",
    "timestamp": "2025-10-14T09:41:00Z"
  },
  {
    "title": "He Used to Dominate Daytime TV. Now He’s Sucking Up to Trump—and His Media Empire Is Collapsing.",
    "description": "When Dr. Phil signed off his talk show in 2023, he pivoted to MAGA politics. It’s not working so well for him.",
    "link": "https://slate.com/business/2025/10/dr-phil-mcgraw-donald-trump-merit-media-maga.html",
    "timestamp": "2025-10-14T09:40:00Z"
  },
  {
    "title": "Gaza ceasefire signatures seal historic peace commitment: Erdoğan",
    "description": "President Recep Tayyip Erdoğan described the declarations signed at the Sharm el-Sheikh Peace Summit as a binding commitment to history, emphasizing Türkiye's resolve to support Gaza's reconstruction and a lasting ceasefire while warning Israel against any vi…",
    "link": "https://www.hurriyetdailynews.com/gaza-ceasefire-signatures-seal-historic-peace-commitment-erdogan-214668",
    "timestamp": "2025-10-14T09:38:29Z"
  },
  {
    "title": "Army’s nuclear comeback: Sweeping new program aims to break ‘tyranny of fuel’ at bases across the globe",
    "description": "The U.S. Army's new nuclear initiative aims to deploy microreactors at military installations by 2028 to reduce dependence on fossil fuels in remote locations.",
    "link": "https://www.foxnews.com/politics/armys-nuclear-comeback-sweeping-new-program-aims-break-tyranny-fuel-bases-across-globe",
    "timestamp": "2025-10-14T09:30:30Z"
  },
  {
    "title": "Chinese Solar Stocks Soar as Beijing Cracks Down on Overcapacity",
    "description": "Shares of the top Chinese solar manufacturers surged in Shanghai on Tuesday, following a state media report that China’s authorities plan stricter controls on the bloated manufacturing capacity that has created price wars and massive losses for companies. Sha…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Chinese-Solar-Stocks-Soar-as-Beijing-Cracks-Down-on-Overcapacity.html",
    "timestamp": "2025-10-14T09:30:00Z"
  },
  {
    "title": "Indonesian President Asks Trump For Meeting With Son Eric In Hot Mic Moment",
    "description": "Trump and Prabowo, who were also seen on video, appeared to be unaware that a live microphone was recording their conversation.",
    "link": "https://www.huffpost.com/entry/trump-prabowo-hot-mic-moment_n_68ee1628e4b09c6fd0c392de",
    "timestamp": "2025-10-14T09:29:25Z"
  },
  {
    "title": "Why is UK inflation still rising?",
    "description": "UK Inflation has fallen from record highs but remains above the Bank of England's 2% target.",
    "link": "https://www.bbc.com/news/articles/c17rgd8e9gjo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-14T09:27:50Z"
  },
  {
    "title": "Spanish PM Sánchez calls for ‘no impunity’ over Gaza",
    "description": "Sánchez was also pressed on comments by US President Donald Trump, who suggested Spain should be expelled from NATO",
    "link": "https://www.euractiv.com/news/spanish-pm-sanchez-calls-for-no-impunity-over-gaza/",
    "timestamp": "2025-10-14T09:26:57Z"
  },
  {
    "title": "Trump to welcome Argentina's President Milei as US extends $20 billion lifeline",
    "description": "Argentina’s libertarian leader is sparing no praise for the U.S. president ahead of his first White House meeting with Donald Trump.",
    "link": "https://www.clickondetroit.com/news/politics/2025/10/14/trump-to-welcome-argentinas-president-milei-as-us-extends-20-billion-lifeline/",
    "timestamp": "2025-10-14T09:26:27Z"
  },
  {
    "title": "Zelensky to visit Trump in Washington this week",
    "description": "Ukrainian President Volodymyr Zelensky said Monday he will go to Washington this week to see U.S. President Donald Trump, to discuss air defences and how to put more pressure on Russia.",
    "link": "https://www.hurriyetdailynews.com/zelensky-to-visit-trump-in-washington-this-week-214667",
    "timestamp": "2025-10-14T09:26:08Z"
  },
  {
    "title": "테슬라, \"1조 달러 가치 정당화 어렵다\"",
    "description": "The European Union will restart its monitoring operation of the border crossing between Gaza and Egypt on Wednesday, Kaja Kallas, the bloc’s top foreign diplomat, told reporters in Kyiv Monday https://t.co/7kwiWgrZhm— Bloomberg (@business) October 13, 2025 US…",
    "link": "https://ryueyes11.tistory.com/511931",
    "timestamp": "2025-10-14T09:24:51Z"
  },
  {
    "title": "Trump says 'will decide' on solution to Mideast conflict",
    "description": "U.S. President Donald Trump said Tuesday he \"will decide what I think is right\" on a long-term solution to the Israeli-Palestinian conflict.",
    "link": "https://www.hurriyetdailynews.com/trump-says-will-decide-on-solution-to-mideast-conflict-214666",
    "timestamp": "2025-10-14T09:23:53Z"
  },
  {
    "title": "Venezuela to close its Norwegian embassy - days after opposition leader wins Nobel Peace Prize in Oslo",
    "description": "Venezuela is to close its embassy in Norway - just days after the South American country's opposition leader was awarded the Nobel Peace Prize in Oslo.",
    "link": "https://news.sky.com/story/venezuela-to-close-its-norwegian-embassy-days-after-opposition-leader-wins-nobel-peace-prize-in-oslo-13449909",
    "timestamp": "2025-10-14T09:23:00Z"
  },
  {
    "title": "Trump looking forward to Thailand-Cambodia ceasefire deal at ASEAN summit, Malaysia says",
    "description": "KUALA LUMPUR (Reuters) -U.S. President Donald Trump will visit Malaysia on October 26, Foreign Minister Mohamad Hasan said on Tuesday, adding that he  was...",
    "link": "https://ca.news.yahoo.com/trump-looking-forward-thailand-cambodia-092113005.html",
    "timestamp": "2025-10-14T09:21:13Z"
  },
  {
    "title": "AI content proliferates in Hungary ahead of next year’s elections",
    "description": "Experts warn that because some AI content can generate very emotional reactions, the use of the technology could sway public opinion",
    "link": "https://www.euractiv.com/news/ai-content-proliferates-in-hungary-ahead-of-next-years-elections/",
    "timestamp": "2025-10-14T09:15:52Z"
  },
  {
    "title": "'It's not peace yet': Experts react after Trump declares Israel-Hamas war is over",
    "description": "While President Donald Trump has declared the Israel-Hamas war over, some Middle East experts say the process to end the two-year conflict is just beginning.",
    "link": "https://abcnews.go.com/US/trump-declares-end-israel-hamas-war-experts-hard/story?id=126482789",
    "timestamp": "2025-10-14T09:15:12Z"
  },
  {
    "title": "Google to invest $15bn to build AI data hub in India",
    "description": "This is Google’s biggest investment outside the US , the firm's top executive says.",
    "link": "https://www.bbc.com/news/articles/cx27yze8p0jo",
    "timestamp": "2025-10-14T09:14:02Z"
  },
  {
    "title": "US threats cast doubt on shipping emissions deal",
    "description": "An ambitious plan by the UN's shipping agency to cut maritime emissions could be scuttled at the last minute after the United States threatened to impose sanctions on those supporting it.",
    "link": "https://phys.org/news/2025-10-threats-shipping-emissions.html",
    "timestamp": "2025-10-14T09:10:01Z"
  },
  {
    "title": "Trump set to posthumously award Charlie Kirk the Presidential Medal of Freedom",
    "description": "Trump set to posthumously award Charlie Kirk the Presidential Medal of Freedomgo.com",
    "link": "https://abcnews.go.com/Politics/trump-set-posthumously-award-charlie-kirk-presidential-medal/story?id=126485749",
    "timestamp": "2025-10-14T09:10:00Z"
  },
  {
    "title": "Stephen Colbert Makes His Unexpected Praise Of Trump Hilariously About Himself",
    "description": "Stephen Colbert Makes His Unexpected Praise Of Trump Hilariously About Himselfhuffpost.com",
    "link": "https://www.huffpost.com/entry/stephen-colbert-donald-trump-question_n_68ee0204e4b058bb20d3ad87",
    "timestamp": "2025-10-14T09:08:13Z"
  },
  {
    "title": "Israel says it opens fire on suspects in Gaza, local authorities report six killed",
    "description": "Gaza's local health authority said the Israeli military killed six Palestinians in two separate incidents across the enclave on Tuesday.  On Monday, Hamas...",
    "link": "https://www.yahoo.com/news/articles/israel-says-opens-fire-suspects-090747668.html",
    "timestamp": "2025-10-14T09:07:47Z"
  },
  {
    "title": "Debunking 3 claims about Tylenol after White House links drug to autism",
    "description": "Since the White House made an announcement linking Tylenol use in pregnancy to autism, misinformation about the drug has been spreading online.",
    "link": "https://abcnews.go.com/Health/debunking-3-claims-tylenol-after-white-house-links/story?id=126399657",
    "timestamp": "2025-10-14T09:07:33Z"
  },
  {
    "title": "Battenfeld: Pro-Hamas protesters need to find a new chant",
    "description": "It must be frustrating for the Trump haters to see the images of the president getting thunderous applause from the Israeli parliament, and watching grateful families of the hostages who suffered unimaginable horror in their time of captivity celebrate and th…",
    "link": "https://www.bostonherald.com/2025/10/14/battenfeld-pro-hamas-protesters-need-to-find-a-new-chant/",
    "timestamp": "2025-10-14T09:01:15Z"
  },
  {
    "title": "Brutal moment Donald Trump humiliates Keir Starmer on the world-stage at peace summit",
    "description": "Viewers think Trump embarrassed Starmer in front of numerous world leaders",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-humiliates-keir-starmer-peace-summit-736302-20251014",
    "timestamp": "2025-10-14T09:01:02Z"
  },
  {
    "title": "KT McFARLAND: How Trump's relentless Middle East gamble finally flipped the script",
    "description": "Here's how President Donald Trump successfully negotiated a Gaza peace plan by building relationships with younger Gulf Arab leaders and isolating Hamas from its allies.",
    "link": "https://www.foxnews.com/opinion/kt-mcfarland-how-trumps-relentless-middle-east-gamble-finally-flipped-script",
    "timestamp": "2025-10-14T09:00:41Z"
  },
  {
    "title": "The New Jersey governor’s race could show the GOP how to win in midterms",
    "description": "New Jersey's gubernatorial contest between Jack Ciattarelli and U.S. Rep. Mikie Sherrill tightens as Republicans target Biden policies on energy and spending.",
    "link": "https://www.foxnews.com/opinion/new-jersey-governors-race-could-show-gop-how-win-midterms",
    "timestamp": "2025-10-14T09:00:27Z"
  },
  {
    "title": "Rare-Earth Moves In China Pushes MP Materials Stock Higher",
    "description": "The updated regulations will necessitate that foreign purchasers secure licenses, heightening concerns over supply...",
    "link": "https://www.forbes.com/sites/greatspeculations/2025/10/14/rare-earth-moves-in-china-pushes-mp-materials-stock-higher/",
    "timestamp": "2025-10-14T09:00:15Z"
  },
  {
    "title": "Actor Martin Sheen calls Trump the 'biggest nothing in the world,' offers spiritual advice",
    "description": "Martin Sheen offers spiritual advice to President Trump, calling him the \"biggest nothing in the world\" during a taping of Nicolle Wallace's \"The Best People\" podcast.",
    "link": "https://www.foxnews.com/media/actor-martin-sheen-calls-trump-biggest-nothing-world-offers-spiritual-advice",
    "timestamp": "2025-10-14T09:00:10Z"
  },
  {
    "title": "How the Capitalism of the 1980s Created Donald Trump’s Theory of the State",
    "description": "Kim Phillips-Fein\n\n\n\nThe proliferation of privately held companies during the Reagan years laid the foundations for Trump’s approach to government: rule by fiat and outside the scrutiny of the public. \r\n\n\r\n\n\nThe post How the Capitalism of the 1980s Created Do…",
    "link": "https://www.thenation.com/?post_type=article&p=572784",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "Industrial Policy, Trump Style",
    "description": "The president’s parade of ad hoc deals with companies benefits his political allies and punishes enemies, but doesn’t enhance national greatness.\nThe post Industrial Policy, Trump Style appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/14/industrial-policy-trump-style/",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "California’s Health Insurance Marketplace Braces for Chaos as Shutdown Persists",
    "description": "Jessica Altman, the head of California’s Affordable Care Act health insurance marketplace, warns letters will be sent out this week with sky-high premiums unless Washington extends covid-era enhanced tax credits by then. Even if Congress acts later and rates …",
    "link": "https://kffhealthnews.org/news/article/covered-california-aca-marketplace-federal-government-shutdown-premiums/",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "Can Republicans turn out Trump voters when he isn't on the ballot? They'll find out in New Jersey",
    "description": "Republican Jack Ciattarelli spent part of a recent rally in Wildwood, New Jersey, tossing bright red “Make NJ Great Again” hats to supporters in the crowd",
    "link": "https://www.nbcnews.com/politics/elections/can-republicans-turn-trump-voters-isnt-ballot-find-new-jersey-rcna237033",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "Opinion: Why I'm handing in my Pentagon press pass",
    "description": "Tom Bowman has held his Pentagon press pass for 28 years. He says the Pentagon's new media policy makes it impossible to be a journalist, which means finding out what's really going on behind the scenes and not accepting wholesale what any government or admin…",
    "link": "https://www.npr.org/2025/10/14/g-s1-93297/pentagon-reporter-opinion-press-policy",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "A Year Before Trump’s Crime Rhetoric, Dallas Voted to Increase Police. The City Is Wrestling With the Consequences.",
    "description": "by Rebecca Lopez and Jason Trahan, WFAA \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n\n\n \n This article is co-published with WFAA and The Texas Tribun…",
    "link": "https://www.wfaa.com/article/news/investigations/dallas-police-hero-monty-bennett-hero-voters/287-49c311d7-6efb-46a8-b689-5b19ab8b0497",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "The New Deal Treasures Slated for Demolition",
    "description": "The pending sale of a historic federal building by Trump could mean the wrecking ball for the “Sistine Chapel of New Deal Art.”   \nThe post The New Deal Treasures Slated for Demolition  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/14/new-deal-art-demolition/",
    "timestamp": "2025-10-14T09:00:00Z"
  },
  {
    "title": "Japanese shares dive as market frets over premiership, US-China tensions",
    "description": "Japanese shares sank on Tuesday after a long weekend, clocking their sharpest one-day drop since April, as investors fretted over uncertainty surrounding the country's next premier and persistent U.S.-China trade tensions.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-shares-dive-as-market-frets-over-premiership-us-china-tensions/articleshow/124548298.cms",
    "timestamp": "2025-10-14T08:57:35Z"
  },
  {
    "title": "When We Win: Stories From the Frontlines of Ecological Resistance",
    "description": "As I stood there with Van Zile and looked at the land, I did not hear the sound of a big truck rumbling nearby or a tree falling. I took a big breath, because sometimes we win. Remember that the dams are gone. Remember that.",
    "link": "https://barnraisingmedia.com/when-we-win-stories-from-the-frontlines-of-ecological-resistance/",
    "timestamp": "2025-10-14T08:53:18Z"
  },
  {
    "title": "Stocks skid, gold jumps as investors shun risk",
    "description": "LONDON (Reuters) -Global shares fell, while safe havens such as bonds and gold rallied on Tuesday, as investors grew uneasy over mounting tensions between...",
    "link": "https://finance.yahoo.com/news/stocks-skid-gold-jumps-investors-085249181.html",
    "timestamp": "2025-10-14T08:52:49Z"
  },
  {
    "title": "Donald Trump Heard Mocking Justin Trudeau on Gaza Hot Mic",
    "description": "A joking exchange between President Donald Trump and Canadian Prime Minister Mark Carney was caught on a hot mic during a summit of world leaders in Egypt, thought to be a jab at former Canadian leader Justin Trudeau.\nWhy It Matters\nTrump had a strained relat…",
    "link": "https://biztoc.com/x/d7a2fd28492bb499",
    "timestamp": "2025-10-14T08:51:50Z"
  },
  {
    "title": "Rare earth stocks rally in premarket, extending gains amid renewed U.S.-China trade dispute",
    "description": "Shares of U.S. rare earth miners rallied in premarket trade on Tuesday, extending sharp gains from the previous session after U.S. President Donald Trump threatened China with 100% tariffs over Beijing's strict export controls on critical minerals.\nCritical M…",
    "link": "https://biztoc.com/x/d58d5c54b436a7f9",
    "timestamp": "2025-10-14T08:51:35Z"
  },
  {
    "title": "U.S. China trade tensions send Aussie sliding 1%, boost safe havens",
    "description": "SINGAPORE/LONDON (Reuters) -The Australian dollar tumbled on Tuesday, while the safe-haven Swiss franc and Japanese yen strengthened as renewed signs of...",
    "link": "https://finance.yahoo.com/news/u-china-trade-tensions-send-084741635.html",
    "timestamp": "2025-10-14T08:47:41Z"
  },
  {
    "title": "President El-Sisi and President Trump Sign The Gaza Peace Agreement at Sharm El-Sheikh Summit",
    "description": "In a landmark diplomatic achievement, President Abdel Fattah El-Sisi and President Donald Trump jointly signed a peace agreement to end the war in Gaza during the opening day of the Sharm El-Sheikh Peace Summit. The high-stakes gathering, co-chaired by Presid…",
    "link": "https://freerepublic.com/focus/f-news/4346243/posts",
    "timestamp": "2025-10-14T08:43:37Z"
  },
  {
    "title": "$2B Ethena USDe depeg exposes cracks in crypto’s ‘synthetic dollar’ system",
    "description": "Ethena’s synthetic dollar, USDe, shed over $2 billion in market capitalization after briefly losing its dollar peg on Binance. The flash event exposed structural risks in crypto’s stablecoin plumbing. According to CryptoSlate data, USDe’s market value dropped…",
    "link": "https://cryptoslate.com/usdes-price-glitch-on-binance-raises-structural-stability-concerns/",
    "timestamp": "2025-10-14T08:43:16Z"
  },
  {
    "title": "Trump to oversee Cambodia-Thai peace deal at ASEAN summit: Malaysia FM",
    "description": "Malaysian Foreign Minister Mohamad Hasan says the US president will oversee a peace deal at the upcoming ASEAN summit.",
    "link": "https://www.aljazeera.com/news/2025/10/14/trump-to-oversee-cambodia-thai-peace-deal-at-asean-summit-malaysia-fm",
    "timestamp": "2025-10-14T08:41:31Z"
  }
]