[
  {
    "title": "Scott Jennings: Tim Walz Is a 'Complete Piece of Sh*t'",
    "description": "CNN political commentator Scott Jennings said Tuesday on \"The Arena\" that Minnesota Governor Tim Walz (D) was a \"complete piece of shit\" over comments about President Donald Trump's health.\nThe post Scott Jennings: Tim Walz Is a ‘Complete Piece of Sh*t’ appea…",
    "link": "https://www.breitbart.com/clips/2025/09/03/scott-jennings-tim-walz-is-a-complete-piece-of-sht/",
    "timestamp": "2025-09-03T17:10:50Z"
  },
  {
    "title": "Concern mounts over Trump health as evidence he’s suffering series of ‘mini-strokes’ emerges - NewsBreak",
    "description": "Concern mounts over Trump health as evidence he’s suffering series of ‘mini-strokes’ emerges - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/4208659583144-concern-mounts-over-trump-health-as-evidence-he-s-suffering-series-of-mini-strokes-emerges?_f=app_share&amp;pd=04jPZECv&amp;lang=en_US&amp;send_time=1756919366&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.32.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-09-03T17:10:04Z"
  },
  {
    "title": "Trump calls Epstein files a distraction from his success as victims call for their release (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump calls Epstein files a distraction from his success as victims call for their release … President Donald Trump on Wednesday called demands that his administration release the J effrey Epstein files a distraction from his successes, as …",
    "link": "https://www.memeorandum.com/250903/p81",
    "timestamp": "2025-09-03T17:10:00Z"
  },
  {
    "title": "Nigel Farage knows how to pick a moment. But Britain is not North Korea",
    "description": "The right in Britain and the left in America are using this moment to warn of what they  see as the erosion of freedom of speech.",
    "link": "https://news.sky.com/story/nigel-farage-knows-how-to-pick-a-moment-but-britain-is-not-north-korea-13424460",
    "timestamp": "2025-09-03T17:10:00Z"
  },
  {
    "title": "Gavin Newsom Snaps Back at Trump’s Latest Attack with ‘Dementia’ Dig",
    "description": "California Governor Gavin Newsom (D) hit back at President Donald Trump's latest insults against him by suggesting the president suffers from dementia.\nThe post Gavin Newsom Snaps Back at Trump’s Latest Attack with ‘Dementia’ Dig first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/gavin-newsom-snaps-back-at-trumps-latest-attack-with-dementia-dig/",
    "timestamp": "2025-09-03T17:08:32Z"
  },
  {
    "title": "Florida will work to eliminate all childhood vaccine mandates",
    "description": "Florida will work to phase out all childhood vaccine mandates in the state, building on the effort by Republican Gov. Ron DeSantis to curb vaccine requirements.",
    "link": "https://www.wptv.com/news/health/florida-will-work-to-eliminate-all-childhood-vaccine-mandates-in-the-state-surgeon-general-announces",
    "timestamp": "2025-09-03T17:07:17Z"
  },
  {
    "title": "Blue states that sued kept most CDC grants, while red states feel brunt of Trump clawbacks",
    "description": "The divide is an example of the polarization that permeates health care issues.",
    "link": "https://www.denverpost.com/2025/09/03/cdc-grants/",
    "timestamp": "2025-09-03T17:05:56Z"
  },
  {
    "title": "Blue states that sued kept most CDC grants, while red states feel brunt of Trump clawbacks",
    "description": "The divide is an example of the polarization that permeates health care issues.",
    "link": "https://www.bostonherald.com/2025/09/03/cdc-grants/",
    "timestamp": "2025-09-03T17:05:56Z"
  },
  {
    "title": "Donald Trump Teases Deploying More US troops to NATO Ally Bordering Russia",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump teased the possibility of sending more U.S. troops to Poland, which borders Russia's Kaliningrad region, during a meeting with the NATO member's President Karol Nawrocki at the White Hou…",
    "link": "https://biztoc.com/x/28e10c1d0c83034c",
    "timestamp": "2025-09-03T17:05:48Z"
  },
  {
    "title": "'Democrat hoax!' Trump lashes out as Epstein survivors who held press conference",
    "description": "President Donald Trump suggested that a press conference being held by survivors of sex offender Jeffrey Epstein was a \"Democrat hoax.\"As the survivors were speaking outside the Capitol on Wednesday, a reporter asked Trump if his Justice Department was \"prote…",
    "link": "https://www.rawstory.com/donald-trump-epstein-survivors-reply/",
    "timestamp": "2025-09-03T17:05:17Z"
  },
  {
    "title": "Podcasters and influencers: The unexpected jobs covered under Trump’s ‘no tax on tips’ plan",
    "description": "Analysts project the provision could increase the deficit by $40 billion through 2028.",
    "link": "https://www.bostonherald.com/2025/09/03/no-tax-on-tips-explained/",
    "timestamp": "2025-09-03T17:04:56Z"
  },
  {
    "title": "Leaked documents detail Trump’s ethnic cleansing plan for Gaza",
    "description": "A leaked document details the Trump administration’s plan to forcibly relocate the population of Gaza. Included in a \"relocation package\" would be $5,000, four years of rent subsidies, and a year of food subsidies.",
    "link": "https://mondoweiss.net/2025/09/leaked-documents-detail-trumps-ethnic-cleansing-plan-for-gaza/",
    "timestamp": "2025-09-03T17:04:38Z"
  },
  {
    "title": "Oh: Donald Trump Is Alive Contrary To Rumors Of His Death, Gov. Gavin Newsom Mocks Fox News Doctor",
    "description": "Donald Trump’s health status was the talk of the internet late last week and over the Labor Day weekend. Theories, rumors, and allegations circulated the world wide web like a game of telephone, with millions of people speculating about why The Orange Man had…",
    "link": "https://bossip.com/3830203/donald-trump-is-alive-despite-rumors-of-his-death/",
    "timestamp": "2025-09-03T17:04:24Z"
  },
  {
    "title": "A Timeline of Gavin Newsom Trolling Kid Rock, And It’s Hilarious",
    "description": "After Kid Rock was doing cos-playing as a rapper, he did what most white musicians who have built their name up in Black music do, he morphed into a Bud Light drinking, Trump loving, fake cowboy of sorts.  It’s really been quite the transformation for Rock (w…",
    "link": "https://hiphopwired.com/2824559/a-timeline-of-gavin-newsom-trolling-kid-rock-and-its-hilarious/",
    "timestamp": "2025-09-03T17:04:16Z"
  },
  {
    "title": "Utah's congressional map must be redrawn now, judge rules",
    "description": "A judge has ruled that Utah lawmakers must proceed with redrawing the state’s congressional district map right away, pointing to Texas and California in...",
    "link": "https://www.yahoo.com/news/articles/utahs-congressional-map-must-redrawn-170327428.html",
    "timestamp": "2025-09-03T17:03:27Z"
  },
  {
    "title": "Podcasters and influencers: The unexpected jobs covered under Trump's 'no tax on tips' plan",
    "description": "The Treasury Department has released a preliminary list of jobs exempt from income tax on tips, including food service, concierge, and salon workers",
    "link": "https://abcnews.go.com/Business/wireStory/podcasters-influencers-unexpected-jobs-covered-trumps-tax-tips-125225180",
    "timestamp": "2025-09-03T17:02:51Z"
  },
  {
    "title": "Hybrid work is still going strong — unless you're a federal worker",
    "description": "Federal workers have seen a massive shift from hybrid to fully in-person work since 2024. But broadly, hybrid work remains the most common model.",
    "link": "https://www.businessinsider.com/hybrid-work-declines-federal-workers-2025-9",
    "timestamp": "2025-09-03T17:02:24Z"
  },
  {
    "title": "WATCH: Ben Shapiro Squabbles With CNN’s Abby Phillip Over Trump’s Crime Crackdown",
    "description": "Ben Shapiro verbally jousted with CNN's Abby Phillip over President Trump's crime crackdown, arguing it is a topic the president is trouncing Democrats on\nThe post WATCH: Ben Shapiro Squabbles With CNN’s Abby Phillip Over Trump’s Crime Crackdown first appeare…",
    "link": "https://www.mediaite.com/media/watch-ben-shapiro-squabbles-with-cnns-abby-phillip-over-trumps-crime-crackdown/",
    "timestamp": "2025-09-03T17:02:12Z"
  },
  {
    "title": "Donald Trump Teases Deploying More US Troops to NATO Ally Bordering Russia",
    "description": "\"We're very much aligned with Poland,\" the president told reporters.",
    "link": "https://www.newsweek.com/donald-trump-karol-nawrocki-poland-nato-russia-troops-2123971",
    "timestamp": "2025-09-03T17:02:07Z"
  },
  {
    "title": "Podcasters and influencers: The unexpected jobs covered under Trump’s ‘no tax on tips’ plan",
    "description": "WASHINGTON (AP) — Golf caddies, blackjack dealers and house painters are among the jobs covered under the Trump administration’s preliminary list of occupations no required to pay income tax on their tips under Republicans’ new tax cuts and spending bill. A b…",
    "link": "https://financialpost.com/pmn/podcasters-and-influencers-the-unexpected-jobs-covered-under-trumps-no-tax-on-tips-plan",
    "timestamp": "2025-09-03T17:00:52Z"
  },
  {
    "title": "Scarborough Says IL Gov. Pritzker Should Work With President Trump on Crime",
    "description": "\"I think he should pick up the phone, call the president\"\nThe post Scarborough Says IL Gov. Pritzker Should Work With President Trump on Crime first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/scarborough-says-il-gov-pritzker-should-work-with-president-trump-on-crime/",
    "timestamp": "2025-09-03T17:00:19Z"
  },
  {
    "title": "Big profits, minimal tax: New report on how to make Google, Facebook pay fair share of tax",
    "description": "'If you misrepresent what a payment is for, then that's obviously challengeable.'",
    "link": "https://www.nzherald.co.nz/nz/politics/big-profits-minimal-tax-new-report-on-how-to-make-google-facebook-pay-fair-share-of-tax/A7XNN3JEVJFWZEJRQGFRYEPYYI/",
    "timestamp": "2025-09-03T17:00:00Z"
  },
  {
    "title": "Europe Faces $1 Trillion Rearmament Bill as U.S. Weighs Troop Cuts",
    "description": "European nations could face a trillion-dollar rearmament bill in the face of a looming Russian threat and an imminent US defense review that could see Washington dramatically draw down forces on the continent, according to a report released on September 3. Th…",
    "link": "https://oilprice.com/Energy/Energy-General/Europe-Faces-1-Trillion-Rearmament-Bill-as-US-Weighs-Troop-Cuts.html",
    "timestamp": "2025-09-03T17:00:00Z"
  },
  {
    "title": "DOJ Takes Illinois to Court Over Benefits for Illegal Aliens",
    "description": "The Department of Justice is taking Illinois to court over state laws it says unlawfully offer in-state tuition and scholarships to illegal aliens.  The DOJ... Read More\nThe post DOJ Takes Illinois to Court Over Benefits for Illegal Aliens  appeared first on …",
    "link": "https://www.dailysignal.com/2025/09/03/doj-takes-illinois-to-court-over-benefits-for-illegal-aliens/",
    "timestamp": "2025-09-03T17:00:00Z"
  },
  {
    "title": "Hunter Biden Gets A Big Win; Trump Appeals His Win In NY",
    "description": "Hell yeah, Hunter Biden keeps winning\nRemember the Hunter Biden laptop guy? John Paul Mac Isaac is the computer repairman who handed a copy of Biden’s hard drive over to Rudy Giuliani, kicking off years of GOP accusations and investigations. Nearly three year…",
    "link": "https://crooksandliars.com/2025/09/hunter-biden-gets-big-win-trump-appeals",
    "timestamp": "2025-09-03T16:59:42Z"
  },
  {
    "title": "RFK Jr.'s weaponized ignorance on SSRIs puts America's mental health at risk",
    "description": "Robert F. Kennedy Jr. linking violence to SSRIs align dangerously with long-held beliefs associating mental health treatments or mental illness itself with crime and violence.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/rfk-jr-antidepressants-ssri-minneapolis-shooting-myth-rcna228676",
    "timestamp": "2025-09-03T16:59:41Z"
  },
  {
    "title": "AI chatbots are changing online threat landscape as Ottawa reviews legislation",
    "description": "Wrongful death lawsuits citing the activities of artificial intelligence chatbots are underway in the United States, as reports emerge of mental health issues and delusions induced by AI systems.",
    "link": "https://www.nationalobserver.com/2025/09/03/news/ai-chatbots-are-changing-online-threat-landscape-ottawa-reviews-legislation",
    "timestamp": "2025-09-03T16:59:10Z"
  },
  {
    "title": "The National Guard Soldier Pissed About Trump’s DC Takeover",
    "description": "Thanks to President Donald Trump, the residents of Washington, DC, are now safe from the horrors of fallen leaves and errant litter. Otherwise, as the US commander in chief threatens to send National Guard troops to Chicago, the usefulness of Trump’s DC deplo…",
    "link": "https://www.motherjones.com/politics/2025/09/national-guard-morale-dc-takeover-interview-soldiers-pissed-angry/",
    "timestamp": "2025-09-03T16:58:57Z"
  },
  {
    "title": "‘Without energy drinks, we will lie around on our phones doing f**k all’ warn under-16s",
    "description": "",
    "link": "https://www.thedailymash.co.uk/news/health/without-energy-drinks-we-will-lie-around-on-our-phones-doing-fk-all-warn-under-16s-20250903260140",
    "timestamp": "2025-09-03T16:58:52Z"
  },
  {
    "title": "Is Trump Pushing India Into China’s Arms?",
    "description": "How New Delhi is navigating U.S. tariffs and a shifting geopolitical reality.",
    "link": "http://foreignpolicy.com/2025/09/03/trump-tariff-india-china/",
    "timestamp": "2025-09-03T16:57:48Z"
  },
  {
    "title": "Mail-in ballots and Space Command: Why Colorado elections may have led to Trump’s decision",
    "description": "Mail-in ballots and Space Command: Why Colorado elections may have led to Trump’s decision by: Heather Willard Posted: Sep 2, 2025 DENVER (KDVR) — On Sept. 2, President Donald Trump announced that the headquarters of Space Command will move from Colorado Spri…",
    "link": "https://freerepublic.com/focus/f-news/4338398/posts",
    "timestamp": "2025-09-03T16:57:46Z"
  },
  {
    "title": "‘Appalling and Disgusting!’ Epstein Victim Goes Off About Ghislaine Maxwell Getting Transferred to ‘Holiday Camp’ Prison",
    "description": "Epstein survivor Anouska De Georgiou said it is \"appalling and disgusting\" that Ghislaine Maxwell was recently moved to a minimum-security federal prison\nThe post ‘Appalling and Disgusting!’ Epstein Victim Goes Off About Ghislaine Maxwell Getting Transferred …",
    "link": "https://www.mediaite.com/media/appalling-and-disgusting-epstein-victim-goes-off-about-ghislaine-maxwell-getting-transferred-to-holiday-camp-prison/",
    "timestamp": "2025-09-03T16:56:27Z"
  },
  {
    "title": "Trump Welcomes Polish President Nawrocki to White House",
    "description": "President Donald Trump welcomed Poland’s new president, Karol Nawrocki, to the White House Wednesday as Nawrocki pushed to deepen U.S.-Poland ties and argue for a continued strong American military presence in his country.\nThe visit to Washington is Nawrocki'…",
    "link": "https://biztoc.com/x/a405b3c1aee6e022",
    "timestamp": "2025-09-03T16:54:32Z"
  },
  {
    "title": "Trump urges Hamas to free all hostages 'IMMEDIATELY'",
    "description": "United States President Donald Trump urged Hamas on Wednesday to release all the remaining hostages from Gaza captivity in order to end the ongoing war with Israel. \"Tell Hamas to IMMEDIATELY give bac...",
    "link": "https://biztoc.com/x/794c8466d9ef3a58",
    "timestamp": "2025-09-03T16:54:31Z"
  },
  {
    "title": "Trump says the National Guard is coming to Chicago",
    "description": "Federal troops are coming to Chicago, President Donald Trump told reporters in the Oval Office on Tuesday.",
    "link": "https://biztoc.com/x/91c1f01f28bde84e",
    "timestamp": "2025-09-03T16:54:19Z"
  },
  {
    "title": "Capitol agenda: White House pitches megabill marketing reboot - Politico",
    "description": "Capitol agenda: White House pitches megabill marketing rebootPolitico Trump aides push a megabill rebrand as some House Republicans bristlePolitico Trump Team Urges G.O.P. to Rebrand Signature Policy LawThe New York Times Team Trump Tries to Rebrand His Law S…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178994436",
    "timestamp": "2025-09-03T16:53:32Z"
  },
  {
    "title": "States begin to see job losses from Trump’s cuts, housing and spending slowdowns",
    "description": "Virginia and New Jersey may be among the states most affected by the hiring slowdown.",
    "link": "https://www.bostonherald.com/2025/09/03/state-job-losses/",
    "timestamp": "2025-09-03T16:53:07Z"
  },
  {
    "title": "Carney Sends Envoys to DC After ‘Very Constructive’ Trump Call",
    "description": "Mark Carney said Canada and the US are in negotiations to resolve issues in tariff-hit sectors after a “very constructive” conversation with President Donald Trump on Monday evening.",
    "link": "https://www.livemint.com/companies/news/carney-sends-envoys-to-dc-after-very-constructive-trump-call-11756918349550.html",
    "timestamp": "2025-09-03T16:52:29Z"
  },
  {
    "title": "Hot mic catches Xi and Putin discussing organ transplants and immortality",
    "description": "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
    "link": "https://www.bbc.com/news/articles/cr70rvrd41ko",
    "timestamp": "2025-09-03T16:51:50Z"
  },
  {
    "title": "Carney sends envoys to Washington after 'very constructive' Trump call",
    "description": "Canada's prime minister said more meetings are taking place in the U.S. capital and he expects some agreements in strategic sectors. Read on",
    "link": "https://financialpost.com/news/economy/carney-sends-envoys-to-dc-after-very-constructive-trump-call",
    "timestamp": "2025-09-03T16:51:21Z"
  },
  {
    "title": "Carney Sends Envoys to DC After ‘Very Constructive’ Trump Call",
    "description": "Mark Carney said Canada and the US are in negotiations to resolve issues in tariff-hit sectors after a “very constructive” conversation with President Donald Trump on Monday evening.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-sends-envoys-to-dc-after-very-constructive-trump-call",
    "timestamp": "2025-09-03T16:51:21Z"
  },
  {
    "title": "Gov. Jeff Landry, Trump officials unveil 'Louisiana Lockup,' an ICE detention center at Angola",
    "description": "Flanked by several top leaders of President Donald Trump's administration, Gov. Jeff Landry on Wednesday unveiled plans to open a new ICE detention center on the grounds of the Louisiana State Penitentiary at Angola.",
    "link": "https://www.theadvocate.com/baton_rouge/news/jeff-landry-trump-officials-unveil-new-ice-center-at-angola/article_6cdb3fde-0d00-539b-a4c2-5029c63163ed.html",
    "timestamp": "2025-09-03T16:51:00Z"
  },
  {
    "title": "Epstein Survivors Are Compiling a List of His Associates: ‘We Know the Names’",
    "description": "Survivors are creating their own list of Jeffrey Epstein associates, one victim said, as survivors and lawmakers called on Trump to release more info.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-capitol-epstein-survivors-list-associates-names-1235420879/",
    "timestamp": "2025-09-03T16:50:07Z"
  },
  {
    "title": "Scott Jennings, CNN’s Unlikely MAGA Warrior, Talks Trump and the Media",
    "description": "Mediaite editor Aidan McLaughlin sits down with Scott Jennings, CNN political commentator and GOP strategist, for a wide-ranging interview.\nThe post Scott Jennings, CNN’s Unlikely MAGA Warrior, Talks Trump and the Media first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/scott-jennings-cnns-unlikely-maga-warrior-talks-trump-and-the-media/",
    "timestamp": "2025-09-03T16:49:58Z"
  },
  {
    "title": "Trump assures Polish leader of continued US military presence",
    "description": "President Donald Trump affirmed that the United States will keep a robust military presence in Poland as he had a warm meeting on Sept. 3 with Karol Nawrocki, the new president of the American ally in Europe.",
    "link": "https://www.hurriyetdailynews.com/trump-assures-polish-leader-of-continued-us-military-presence-213213",
    "timestamp": "2025-09-03T16:49:06Z"
  },
  {
    "title": "Pro-MAGA Reporter Asks Trump Whether He’d Like a Congressional Investigation Into Gavin Newsom for Palisades Fire",
    "description": "Brian Glenn asked Donald Trump whether he'd support a congressional investigation into Gavin Newsom as Trump blasted Newsom as \"grossly incompetent.\"\nThe post Pro-MAGA Reporter Asks Trump Whether He’d Like a Congressional Investigation Into Gavin Newsom for P…",
    "link": "https://www.mediaite.com/media/news/pro-maga-reporter-asks-trump-whether-hed-like-a-congressional-investigation-into-gavin-newsom-for-palisades-fire/",
    "timestamp": "2025-09-03T16:48:01Z"
  },
  {
    "title": "Central bank independence is no obstacle to low rates, says ECB's Villeroy",
    "description": "PARIS (Reuters) -Central bank independence does not stand in the way of low interest rates, French ECB policymaker Francois Villeroy de Galhau said on...",
    "link": "https://finance.yahoo.com/news/central-bank-independence-no-obstacle-164654003.html",
    "timestamp": "2025-09-03T16:46:54Z"
  },
  {
    "title": "Putin defends Trump’s envoy",
    "description": "The summit in Alaska showed that Steve Witkoff conveys Moscow’s position accurately, the Russian president has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624078-putin-comments-witkoffs-work/",
    "timestamp": "2025-09-03T16:45:57Z"
  },
  {
    "title": "Florida surgeon general says state will eliminate all vaccine mandates",
    "description": "Florida Surgeon General Joseph Ladapo said Wednesday that the state will work to eliminate all vaccine mandates.",
    "link": "https://www.nbcnews.com/health/health-news/florida-surgeon-general-says-state-will-eliminate-vaccine-mandates-rcna228835",
    "timestamp": "2025-09-03T16:45:10Z"
  },
  {
    "title": "Epstein Survivor Recalls Africa Trip With Bill Clinton, Says Convicted Sex Trafficker Bragged About Ties to Trump",
    "description": "A Jeffrey Epstein survivor recalled a trip to Africa with former President Bill Clinton and how the notorious pedophile often bragged about his relationship with President Donald Trump during an emotional statement on Capitol Hill Wednesday.\nThe post Epstein …",
    "link": "https://www.mediaite.com/media/news/epstein-survivor-recalls-africa-trip-with-bill-clinton-says-convicted-sex-trafficker-bragged-about-ties-to-trump/",
    "timestamp": "2025-09-03T16:44:48Z"
  },
  {
    "title": "Trump attacks on Fed are ‘very concerning’, says Bailey",
    "description": "The Governor of the Bank of England has said that he is “very concerned” by Donald Trump’s attacks on the US Federal Reserve.\nAndrew Bailey told MPs: “This is a very serious situation, and I am very concerned.”\nIt comes after sustained criticisms of the Fed b…",
    "link": "https://biztoc.com/x/1279b582c9909675",
    "timestamp": "2025-09-03T16:43:48Z"
  },
  {
    "title": "Epstein survivors call for release of files and records",
    "description": "Survivors of Jeffrey Epstein have urged US lawmakers to back a bill that would force the release of records on the disgraced financier and convicted sex offender.",
    "link": "https://www.rte.ie/news/2025/0903/1531665-epstein-survivors/",
    "timestamp": "2025-09-03T16:43:41Z"
  },
  {
    "title": "Trump-Appointed Judge Rips Colleagues For Subverting President’s Gangbanger Deportations: ‘Robed Crusaders’",
    "description": "A federal judge ripped his colleagues for blocking President Donald Trump's use of a wartime authority to quickly arrest and deport Venezuelan gangbangers.",
    "link": "https://dailycaller.com/2025/09/03/judge-andrew-oldman-dissent-trump-admin-deportations-ruling/",
    "timestamp": "2025-09-03T16:43:15Z"
  },
  {
    "title": "McDonald’s CEO says Trump’s no tax on tips amplifies an ‘uneven playing field’ for its restaurants, which don’t get ‘customers to pay’ for labor",
    "description": "President Donald Trump has outlined which workers will be eligible for tax deductions due to his no tax on tips policy. This policy will not benefit McDonald’s workers, according to CEO Chris Kempczinski, because its restaurants do not have tips. Instead, the…",
    "link": "https://biztoc.com/x/c94279c4acaa0ee4",
    "timestamp": "2025-09-03T16:43:15Z"
  },
  {
    "title": "Pfizer defends COVID-19 vaccine after Trump criticism",
    "description": "NEW YORK: Pfizer said on Wednesday (Sep 3) its COVID-19 vaccine has saved more than 14 million lives worldwide, after US President Donald Trump urged pharmaceutical companies to justify the",
    "link": "https://www.channelnewsasia.com/world/pfizer-defends-covid-19-vaccine-after-trump-criticism-5331226",
    "timestamp": "2025-09-03T16:43:00Z"
  },
  {
    "title": "US appeals court blocks Trump use of Alien Enemies Act in deportation drive",
    "description": "The Fifth Circuit Court is highest court so far to rule against Trump's use of the law to deport Venezuelan migrants.",
    "link": "https://www.aljazeera.com/news/2025/9/3/us-appeals-court-blocks-trump-use-of-alien-enemies-act-in-deportation-drive",
    "timestamp": "2025-09-03T16:41:50Z"
  },
  {
    "title": "The Trump Justice Department has lost the benefit of the doubt with (some) judges",
    "description": "One of the Trump Justice Department’s latest legal losses highlights how it has lost the “presumption of regularity,” or assumption that it's operating in good faith, from the judiciary.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-justice-department-lost-benefit-doubt-judges-rcna228763",
    "timestamp": "2025-09-03T16:40:35Z"
  },
  {
    "title": "Live: Trump meets with Polish president at White House discuss war in Ukraine",
    "description": "Watch live coverage as President Donald Trump holds a bilateral meeting with Polish President Karol Nawrocki after backing the ...",
    "link": "https://biztoc.com/x/8c6f622b00c57de1",
    "timestamp": "2025-09-03T16:39:34Z"
  },
  {
    "title": "'I'm a registered Republican': Epstein survivor calls for Trump to meet her face to face",
    "description": "Haley Robson, who claims she was sexually abused by Jeffrey Epstein as a minor, called out President Donald Trump directly Wednesday during the explosive Capitol press conference centered around the disgraced financier.Trump has faced something of a MAGA revo…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2673957331/",
    "timestamp": "2025-09-03T16:39:04Z"
  },
  {
    "title": "It's time to call it: The Big Tech backlash is formally over.",
    "description": "The ruling in the Google antitrust case means it's time to formally acknowledge that the US's push to regulate or break up Big Tech is basically over.",
    "link": "https://www.businessinsider.com/google-antitrust-monopoly-case-ruling-big-tech-regulation-2025-9",
    "timestamp": "2025-09-03T16:37:47Z"
  },
  {
    "title": "Goodbye FEMA, Hello Disaster Consultants",
    "description": "Pushing more responsibility for disaster response onto the states will mean depending more on private contractors.",
    "link": "https://www.theatlantic.com/health/archive/2025/09/fema-disaster-consultants/684080/",
    "timestamp": "2025-09-03T16:36:53Z"
  },
  {
    "title": "WATCH: Trump to push Supreme Court for quick ruling on tariff authority",
    "description": "'Suddenly revoking the president's tariff authority would have catastrophic consequences for our national security, foreign policy, and economy'",
    "link": "https://www.wnd.com/2025/09/watch-trump-push-supreme-court-quick-ruling-tariff/",
    "timestamp": "2025-09-03T16:36:47Z"
  },
  {
    "title": "JD Vance’s Warning About Trump ‘Death Bed’ Misinformation Was… Misinformation",
    "description": "JD Vance slammed “the media” for spreading Trump death rumors — except no outlet did. His warning about misinformation was itself misinformation.\nThe post JD Vance’s Warning About Trump ‘Death Bed’ Misinformation Was… Misinformation first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/jd-vances-warning-about-trump-death-bed-misinformation-was-misinformation/",
    "timestamp": "2025-09-03T16:36:36Z"
  },
  {
    "title": "MAGA Republicans Pull Ultra Shady Move with Epstein File Dump",
    "description": "The House committee investigating Jeffrey Epstein released another batch of documents as part of the so-called “Epstein Files”—but journalists were quick to notice the similarities between the latest dump and past disclosures. “I reviewed some of the 33,000 p…",
    "link": "https://newrepublic.com/post/199936/maga-republicans-shady-epstein-file-dump",
    "timestamp": "2025-09-03T16:36:20Z"
  },
  {
    "title": "Russia launches over 500 drones and missiles at Ukraine as Zelenskyy seeks more support",
    "description": "Ukrainian President Volodymyr Zelenskyy says the attacks mainly hit western and central Ukraine, injuring at least five people.",
    "link": "https://www.pbs.org/newshour/world/russia-launches-over-500-drones-and-missiles-at-ukraine-as-zelenskyy-seeks-more-support",
    "timestamp": "2025-09-03T16:35:31Z"
  },
  {
    "title": "Russia launches over 500 drones and missiles at Ukraine as Zelenskyy seeks more support",
    "description": "Ukrainian President Volodymyr Zelenskyy says the attacks mainly hit western and central Ukraine.",
    "link": "https://www.bostonherald.com/2025/09/03/russia-drones-zelenskyy-seeks-support/",
    "timestamp": "2025-09-03T16:33:59Z"
  },
  {
    "title": "Oregon Forms “Western Health Alliance” With Washington and California",
    "description": "Oregon, Washington and California announced today they will coordinate to provide residents with reliable vaccine information—a response, they say, to the Trump administration’s destruction of the credibility and scientific integrity of the U.S. Centers for D…",
    "link": "https://www.wweek.com/news/health/2025/09/03/oregon-forms-western-health-alliance-with-washington-and-california/",
    "timestamp": "2025-09-03T16:33:20Z"
  },
  {
    "title": "Trump’s Net Worth Is Growing Thanks to This One Asset — Should You Buy It?",
    "description": "President Donald Trump is expanding his wealth while in office through a more modern investment: cryptocurrency. Trump favors cryptocurrency so much that his Bitcoin holdings now account for about two-thirds of his liquid assets.\nSo how is Trump growing his n…",
    "link": "https://biztoc.com/x/5fe8bf5d0aef09d7",
    "timestamp": "2025-09-03T16:33:18Z"
  },
  {
    "title": "Trump aides push a megabill rebrand as some House Republicans bristle - Politico",
    "description": "Trump aides push a megabill rebrand as some House Republicans bristlePolitico Team Trump Tries to Rebrand His Law Slashing Medicaid as a ‘Working Families Tax Plan’Rolling Stone Donald Trump says he wants to rebrand his 'big, beautiful bill'NBC News A GOP law…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178994092",
    "timestamp": "2025-09-03T16:32:54Z"
  },
  {
    "title": "Trump calls Epstein files a distraction from his success as victims call for their release",
    "description": "President Donald Trump faces growing calls in Congress to release the Epstein files, which related to his former friend Jeffrey Epstein and Ghislaine Maxwell.",
    "link": "https://biztoc.com/x/be3469798d757b50",
    "timestamp": "2025-09-03T16:32:08Z"
  },
  {
    "title": "New York Sues Anti-Immigration Charity for Multimillion-Dollar Misuse of Funds",
    "description": "Peter Brimelow, founder of the vehemently anti-immigrant website VDARE.com, is being persecuted. That’s what he’s been telling followers, anyway. In a video posted on X last July, Brimelow announced his resignation and the suspension of VDARE, claiming the or…",
    "link": "https://www.motherjones.com/politics/2025/09/vdare-white-nationalism-immigration-new-york-lawsuit-letitia-james-misuse-charitable-funds/",
    "timestamp": "2025-09-03T16:32:03Z"
  },
  {
    "title": "New York Sues Anti-Immigration Group for Multimillion-Dollar Charity Fraud",
    "description": "Peter Brimelow, founder of the vehemently anti-immigrant website VDARE.com, is being persecuted. That’s what he’s been telling followers, anyway. In a video posted on X last July, Brimelow announced his resignation and the suspension of VDARE, claiming the or…",
    "link": "https://www.motherjones.com/politics/2025/09/vdare-white-nationalism-immigration-new-york-lawsuit-leticia-james-misuse-charitable-funds/",
    "timestamp": "2025-09-03T16:32:03Z"
  },
  {
    "title": "Inside Tren de Aragua: The drug lords Trump has marked while US sinks Caribbean vessel killing 11",
    "description": "The United States is fighting against Tren de Aragua. It is a dangerous drug cartel from Latin America. The US military attacked the cartel's drug boat. The leader of the cartel is Hector Rusthenford Guerrero Flores. He is also known as Nino Guerrero. The US …",
    "link": "https://economictimes.indiatimes.com/news/international/us/inside-tren-de-aragua-the-drug-lords-trump-has-marked-while-us-sinks-caribbean-vessel-killing-11/articleshow/123680812.cms",
    "timestamp": "2025-09-03T16:31:43Z"
  },
  {
    "title": "Best friends' rifle game goes horribly wrong as ex-Marine is blasted in the head",
    "description": "A shooting game between two friends in Texas has taken a tragic turn, with one dead and the other arrested for his murder. Sean O'Donnell, 37, and Aaron Prout, 34, were taking turns shooting at each other with a rifle while wearing a kevlar helmet inside a Ho…",
    "link": "https://freerepublic.com/focus/f-chat/4338393/posts",
    "timestamp": "2025-09-03T16:31:37Z"
  },
  {
    "title": "Dan Rather Blasts ‘Shameful’ CBS and ABC Settlements With Trump, Draws Parallels to His Bush-Era Ouster",
    "description": "In 2004, Sumner Redstone was looking to add TV stations to the CBS portfolio and needed the approval of a then Republican-controlled Federal Communications Commission. At the time, President George W. Bush was facing a tough opponent in his bid for reelection…",
    "link": "https://variety.com/2025/film/news/dan-rather-cbs-abc-settlements-trump-1236506117/",
    "timestamp": "2025-09-03T16:30:00Z"
  },
  {
    "title": "Job Openings Fell In July—But Hiring Increased. Here’s What Industries Added The Most.",
    "description": "Earlier federal data indicated hiring dropped sharply in July as the job market appeared to lose momentum.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/09/03/job-openings-fell-in-july-but-hiring-increased-heres-what-industries-added-the-most/",
    "timestamp": "2025-09-03T16:29:30Z"
  },
  {
    "title": "McDonald’s CEO says Trump’s no tax on tips amplifies an ‘uneven playing field’ for its restaurants, which don’t get ‘customers to pay’ for labor",
    "description": "Chris Kempczinski raised concerns that restaurants paying tipped workers lower minimum wages were getting an extra boost from the White House’s new provision.",
    "link": "https://fortune.com/2025/09/03/mcdonalds-ceo-no-tax-on-tips-uneven-playing-field/",
    "timestamp": "2025-09-03T16:28:44Z"
  },
  {
    "title": "Exclusive: Team Trump Social Media Accounts Gained 1.6M New Followers in August, Reached Nearly 200 Million More People than Democrats",
    "description": "The @TeamTrump social media accounts on Instagram and TikTok outperformed the official Democrat accounts in August by over 160 million views. \nThe post Exclusive: Team Trump Social Media Accounts Gained 1.6M New Followers in August, Reached Nearly 200 Million…",
    "link": "https://www.breitbart.com/politics/2025/09/03/exclusive-team-trump-social-media-accounts-gained-1-6m-new-followers-august-reached-nearly-200-million-more-people-than-democrats/",
    "timestamp": "2025-09-03T16:28:40Z"
  },
  {
    "title": "Trump Calls Epstein Files a Distraction from His Successes",
    "description": "\"President Donald Trump on Wednesday called demands that his administration release the Jeffrey Epstein files a distraction from his successes, as a group of victims of the notorious sex offender called for those documents to",
    "link": "https://politicalwire.com/2025/09/03/trump-calls-epstein-files-a-distraction-from-his-successes/",
    "timestamp": "2025-09-03T16:27:46Z"
  },
  {
    "title": "'Epstein had a free pass': Survivor links her victimizer to 'our current president'",
    "description": "Speaking to the press as part of a collection of survivors who were sexually assaulted by convicted pedophile Jeffrey Epstein on Wednesday, survivor Chauntae Davies brought up Donald Trump.After explaining how she was brought into Epstein’s circle with the pr…",
    "link": "https://www.rawstory.com/trump-epstein-2673957020/",
    "timestamp": "2025-09-03T16:27:05Z"
  },
  {
    "title": "What Xi Jinping hosting Modi and Putin reveals about China’s plans for a new world order",
    "description": "Despite the smiles, the unity underpinning a new China-led global order looks a lot more fragile than its president would have you believe.",
    "link": "https://theconversation.com/what-xi-jinping-hosting-modi-and-putin-reveals-about-chinas-plans-for-a-new-world-order-262244",
    "timestamp": "2025-09-03T16:26:56Z"
  },
  {
    "title": "Putin says Russia will achieve all aims militarily if Ukraine does not agree deal",
    "description": "The Russian leader has rejected calls for a ceasefire as his troops advance.",
    "link": "https://www.bbc.com/news/articles/c4g7dze5n1vo",
    "timestamp": "2025-09-03T16:25:40Z"
  },
  {
    "title": "Trump Wants to Send the National Guard Into Chicago. Here’s What the Law Actually Says About That.",
    "description": "The president can't legally apply his D.C. playbook to Chicago.",
    "link": "https://slate.com/news-and-politics/2025/09/chicago-trump-national-guard-legal-posse-comitatus-insurrection-act.html",
    "timestamp": "2025-09-03T16:25:20Z"
  },
  {
    "title": "Trump’s Net Worth Is Growing Thanks to This One Asset — Should You Buy It?",
    "description": "How is Trump growing his net worth through cryptocurrency -- and should you do the same? Read to find out.",
    "link": "https://finance.yahoo.com/news/trump-net-worth-growing-thanks-162459334.html",
    "timestamp": "2025-09-03T16:24:59Z"
  },
  {
    "title": "Does the Reason Trump Bombed That Boat in the Caribbean Happen to Rhyme With Schmepstein?",
    "description": "I remain dubious about involving of the military in our futile \"war\" on drugs—especially when the process is run by a half-dead elderly man surrounded by malignant meatheads.",
    "link": "https://www.esquire.com/news-politics/politics/a65970589/epstein-distraction-venezuela-bombing-trump/",
    "timestamp": "2025-09-03T16:24:00Z"
  },
  {
    "title": "The U.S. Is Inching Toward Regime Change in Venezuela",
    "description": "The Trump administration’s Latin America policy is more hawkish than many realize.",
    "link": "http://foreignpolicy.com/2025/09/03/trump-usa-venezuela-regime-change-maduro-cartels/",
    "timestamp": "2025-09-03T16:22:55Z"
  },
  {
    "title": "Trump Bros’ American Bitcoin Mining Stock Soars, Then Plunges During Public Debut",
    "description": "American Bitcoin, a newly public Bitcoin mining and treasury firm backed by Eric Trump and Donald Trump Jr, raced out of the gate during its Wall Street debut Wednesday, surging briefly before falling back down to earth.\nWithin minutes of debuting on the Nasd…",
    "link": "https://biztoc.com/x/23a0ef5cf8c0fd9c",
    "timestamp": "2025-09-03T16:21:19Z"
  },
  {
    "title": "Trump floats tariffs as possible replacement for income tax",
    "description": "US President Donald Trump told reporters in the Oval Office on Wednesday that tariffs are \"vital\" to America's success and suggested they could one day replace the federal income tax.\n&...",
    "link": "https://biztoc.com/x/e42403a634def363",
    "timestamp": "2025-09-03T16:20:51Z"
  },
  {
    "title": "The curiosity over Trump's 'declining' health is hardly a surprise",
    "description": "Chris Hayes says speculation over Trump's well-being is justified, considering the White House's overall lack of transparency when it comes to his health.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-health-speculation-conspiracy-transparency-rcna228770",
    "timestamp": "2025-09-03T16:20:49Z"
  },
  {
    "title": "Trump says he’s awarding former New York Mayor Rudy Giuliani the Presidential Medal of Freedom two days after being seriously injured in car crash",
    "description": "President Donald Trump said Monday he will award former New York Mayor Rudolph Giuliani the Presidential Medal of Freedom, the nation’s highest civilian honor, two days after his longtime political ally was seriously injured in a car crash.\nThe decision place…",
    "link": "https://biztoc.com/x/48aa2910b5d5d155",
    "timestamp": "2025-09-03T16:20:41Z"
  },
  {
    "title": "CDC insider has message for Trump on vaccines",
    "description": "Over the weekend, President Donald Trump broke free of his usual pro-COVID vaccine sentiment and appeared to openly question pharmaceutical companies in a post on Truth Social\r\n.“It is very important that the Drug Companies justify the success of their variou…",
    "link": "https://www.theblaze.com/shows/the-liz-wheeler-show/vaccines",
    "timestamp": "2025-09-03T16:20:35Z"
  },
  {
    "title": "Trump pledges not to pull US troops out of Poland",
    "description": "American troops will \"be staying in Poland\" — and potentially more could be stationed there, U.S. president says.",
    "link": "https://www.politico.eu/article/donald-trump-defense-us-troops-poland-war-ukraine/",
    "timestamp": "2025-09-03T16:19:42Z"
  }
]