[
  {
    "title": "California track athlete briefly poses on 1st-place podium after losing to trans athlete, receives praise",
    "description": "California high school track and field athlete Reese Hogan was praised as the \"real champ\" after she briefly posed on top of a podium following a loss to a trans athlete.",
    "link": "https://www.foxnews.com/sports/california-track-athlete-briefly-poses-1st-place-podium-after-losing-trans-athlete-receives-praise",
    "timestamp": "2025-05-20T11:09:03Z"
  },
  {
    "title": "For waste and inefficiency, you can’t beat America’s government-forced corn ethanol gas (Opinion)",
    "description": "Corn ethanol, also known as grain alcohol, has been burned in gasoline engines and human stomachs since before Henry Ford was born. It’s hard on both, so until 35 years ago it never caught on much, at least not for engines.",
    "link": "https://www.denverpost.com/2025/05/20/ethanol-gas-corn-us-policy-required-subsidized-pollution/",
    "timestamp": "2025-05-20T11:08:31Z"
  },
  {
    "title": "Trump heads to Capitol Hill to push 'big, beautiful bill'",
    "description": "Trump urges Republicans to pass a major tax bill, facing opposition from Democrats and concerns over increasing the national debt by $3.3 trillion.",
    "link": "https://www.foxnews.com/politics/trump-heads-capitol-hill-push-big-beautiful-bill",
    "timestamp": "2025-05-20T11:08:19Z"
  },
  {
    "title": "CNN Report Disputes Trump's Central Claim About Qatar Jet",
    "description": "The president has based most of his argument for obtaining the Air Force One substitute  on one condition — and it just got contradicted in the report.",
    "link": "https://www.huffpost.com/entry/cnn-contradicts-trump-story-gift-qatar-jet_n_682c44f9e4b0f527e57af048",
    "timestamp": "2025-05-20T11:06:50Z"
  },
  {
    "title": "Europe Squeezes Putin as Trump Pins Ukraine Hopes on More Talks",
    "description": "President Donald Trump said he had an \"excellent\" call with Russian President Vladimir Putin.",
    "link": "https://www.newsweek.com/europe-squeezes-putin-trump-pins-ukraine-hopes-more-talks-2074573",
    "timestamp": "2025-05-20T11:06:17Z"
  },
  {
    "title": "Case Against LaMonica McIver 'Will Be Rejected in Court'—Attorney",
    "description": "The New Jersey representative was charged with \"interfering with law enforcement\" after a scuffle with ICE officials in Newark.",
    "link": "https://www.newsweek.com/case-against-lamonica-mciver-will-rejected-court-attorney-2074492",
    "timestamp": "2025-05-20T11:05:25Z"
  },
  {
    "title": "Why MAGA Activist Laura Loomer Has Found Herself At Odds With Donald Trump",
    "description": "In the past few weeks, Loomer has criticised the new pope, mounted a campaign against Trump&#039;s pick for surgeon general, Casey Means, blasted his attorney general, Pam Bondi, and objected to Trump&#039;s diplomatic efforts during his Middle East trip.",
    "link": "https://www.ndtv.com/world-news/why-maga-activist-laura-loomer-has-found-herself-at-odds-with-donald-trump-8461764",
    "timestamp": "2025-05-20T11:05:21Z"
  },
  {
    "title": "St. Louis tornado's scale, living in wrecked homes, 'failure' with sirens: Recap",
    "description": "From promises of federal help to residents living in wrecked homes, news from the deadly tornado in St. Louis continued to unfold. Here's a recap.",
    "link": "https://www.stltoday.com/news/local/metro/article_f30055a6-b61a-4fc8-b9ac-445029adc06d.html",
    "timestamp": "2025-05-20T11:05:00Z"
  },
  {
    "title": "She's Not Faking Smart Today. Tabs, Tues., May 20, 2025",
    "description": "She's not gonna do it tomorrow either.",
    "link": "https://www.wonkette.com/p/shes-not-faking-smart-today-tabs",
    "timestamp": "2025-05-20T11:02:46Z"
  },
  {
    "title": "ELIAS FERRER: Only Trump Can Stop China From Taking Over Venezuela",
    "description": "America’s enemies are gaining ground in the Western Hemisphere, and Washington has been asleep at the wheel. Venezuela is sliding toward the CCP.",
    "link": "https://dailycaller.com/2025/05/20/opinion-only-trump-can-stop-china-from-taking-over-venezuela-elias-ferrer/",
    "timestamp": "2025-05-20T11:02:25Z"
  },
  {
    "title": "GOP questions Biden's cancer diagnosis and Valley fever cases on the rise: Morning Rundown",
    "description": "Trump and other Republicans’ well wishes to Biden shift to accusations of a cancer cover-up.",
    "link": "https://www.nbcnews.com/news/us-news/gop-biden-cancer-diagnosis-valley-fever-cases-morning-rundown-rcna207862",
    "timestamp": "2025-05-20T11:00:26Z"
  },
  {
    "title": "Donald Trump Allows Major $5 Billion Wind Farm Project to Go Ahead",
    "description": "The wind farm project, a centerpiece of New York's renewable energy strategy, has been under a federal halt since April 16.",
    "link": "https://biztoc.com/x/09ad184d5c9cc765",
    "timestamp": "2025-05-20T11:00:24Z"
  },
  {
    "title": "Is Elon Musk Losing Clout In White House? Report Flags Sharp Drop In Trump Mentions, Truth Social Posts, Official Briefings",
    "description": "The once prominent figure of Elon Musk in President Donald Trump’s administration appears to be reportedly fading in a gradual manner. The Tesla Inc. (NASDAQ:TSLA) CEO, who was frequently mentioned by Trump and his administration, has not been referenced in o…",
    "link": "https://biztoc.com/x/2497edc722556d48",
    "timestamp": "2025-05-20T11:00:22Z"
  },
  {
    "title": "Director Wes Anderson confused by Trump's 100% foreign-produced movie tariffs proposal",
    "description": "Director Wes Anderson commented on President Donald Trump’s proposal earlier this month for a 100% tariff on movies produced outside the United States.",
    "link": "https://www.foxnews.com/media/director-wes-anderson-confused-trumps-100-foreign-produced-movie-tariffs-proposal",
    "timestamp": "2025-05-20T11:00:19Z"
  },
  {
    "title": "The Power of a Good Suit",
    "description": "Readers respond to our March issue and more.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/06/the-commons/682617/",
    "timestamp": "2025-05-20T11:00:00Z"
  },
  {
    "title": "No evidence King Harald of Norway snubbed Trump to meet Obama instead",
    "description": "In May 2025, King Harald of Norway snubbed a request for an audience from U.S. President Donald Trump, opting to meet with former U.S. President Barack Obama instead.",
    "link": "https://www.snopes.com//fact-check/trump-king-of-norway-obama/",
    "timestamp": "2025-05-20T11:00:00Z"
  },
  {
    "title": "China defies Trump trade war challenge with US$17.3 billion in capital inflow",
    "description": "As the US faces downward pressures, from unsustainable debt to the possibility of huge tax cuts, investors are turning to Asia, analysts say Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/20/china-defies-trump-trade-war-challenge-with-us173-billion-in-capital-inflow",
    "timestamp": "2025-05-20T11:00:00Z"
  },
  {
    "title": "The Congressman Who Saw the Truth About Biden",
    "description": "While many Democrats remained in denial, Mike Quigley perceived something painfully familiar.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/original-sin-book-excerpt/682810/",
    "timestamp": "2025-05-20T11:00:00Z"
  },
  {
    "title": "Links 5/20/2025",
    "description": "Our warbling daily links: Noah's Ark navigation, last letters, RFK, Jr. v. sick kids, plastic crunch birds, China view on tariffs, US-Iran deal outtrade, Trump-Putin talks, DoJ prosecutes NJ rep, self-deportation flight, moar Biden cancer, no takers for new f…",
    "link": "https://www.nakedcapitalism.com/2025/05/links-5-20-2025.html",
    "timestamp": "2025-05-20T10:58:10Z"
  },
  {
    "title": "Foxconn to expand India focus with $1.5 billion investment",
    "description": "Foxconn is investing $1.5 billion to expand its Indian operations as Apple diversifies production away from China, aiming to mitigate geopolitical and tariff risks. This move follows Apple's plan to manufacture a majority of iPhones sold in the US in India.",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/foxconn-to-expand-india-focus-with-1-5-billion-investment/articleshow/121291410.cms",
    "timestamp": "2025-05-20T10:57:21Z"
  },
  {
    "title": "Prepare to Be Watched: W.H.O. Agrees to Boost Global Pandemic 'Surveillance'",
    "description": "Prepare to be watched. The World Health Organization (W.H.O.) adopted a landmark Pandemic Agreement on Tuesday designed to help it tackle future health crises predicated on an enhanced ability to watch, monitor and surveil specific national responses to threa…",
    "link": "https://www.breitbart.com/europe/2025/05/20/prepare-to-be-watched-w-h-o-agrees-to-boost-global-pandemic-surveillance/",
    "timestamp": "2025-05-20T10:57:19Z"
  },
  {
    "title": "Pakistan, India agree to withdraw troops by end May: Security official",
    "description": "ISLAMABAD: Pakistan and India have agreed to withdraw troop reinforcements deployed during their recent conflict back to their peacetime positions by the end of May, a senior Pakistani security official told AFP on Tuesday (May 20). More than 70 people were k…",
    "link": "https://www.channelnewsasia.com/asia/pakistan-india-agree-withdraw-troops-end-may-5141801",
    "timestamp": "2025-05-20T10:57:12Z"
  },
  {
    "title": "Stablecoin Legislation Moves Forward After Senate Dems Drop Opposition",
    "description": "The U.S. Senate has voted to advance the GENIUS Act, the country’s first stablecoin legislation. As Bloomberg News reported, the bipartisan vote on Monday (May 19) came two weeks after the Senate’s Democrats joined forces to block the legislation. The bill is…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/stablecoin-legislation-moves-forward-after-senate-dems-drop-opposition/",
    "timestamp": "2025-05-20T10:53:19Z"
  },
  {
    "title": "Donald Trump Allows Major $5 Billion Wind Farm Project to Go Ahead",
    "description": "The wind farm project, a centerpiece of New York's renewable energy strategy, has been under a federal halt since April 16.",
    "link": "https://www.newsweek.com/donald-trump-wind-farm-project-2074506",
    "timestamp": "2025-05-20T10:52:43Z"
  },
  {
    "title": "Charles Kushner, father of Trump's son-in-law, confirmed as ambassador to France (Victoria Bisset/Washington Post)",
    "description": "Victoria Bisset / Washington Post:\nCharles Kushner, father of Trump's son-in-law, confirmed as ambassador to France  —  President Donald Trump pardoned the real estate developer in 2020.  Kushner went to prison for tax evasion, witness tampering and illegal c…",
    "link": "https://www.memeorandum.com/250520/p7",
    "timestamp": "2025-05-20T10:50:01Z"
  },
  {
    "title": "Under Trump, NED to Continue Weaponizing “Democracy” in Venezuela, Nicaragua and Cuba",
    "description": "The brief freeze and rapid partial reinstatement of National Endowment for Democracy (NED) funding in early 2025 helped expose it as a US regime-change tool. Created to rebrand CIA covert operations as “democracy promotion,” the NED channels government …\nThe …",
    "link": "https://www.globalresearch.ca/ned-weaponizing-democracy-venezuela-nicaragua-cuba/5887643",
    "timestamp": "2025-05-20T10:49:59Z"
  },
  {
    "title": "Why Republicans are using the 'reconciliation' process on Trump's megabill",
    "description": "President Donald Trump with House Speaker Mike Johnson and Senate Majority Leader John Thune after the National Prayer Breakfast at the Capitol on Feb., 6, 2025.",
    "link": "https://biztoc.com/x/8a2fb0a308f0af86",
    "timestamp": "2025-05-20T10:49:44Z"
  },
  {
    "title": "Morning Bid: An awkward G7",
    "description": "Group of Seven finance chiefs have much to disagree about these days as smouldering tensions on trade and currencies form the backdrop to the their meeting...",
    "link": "https://finance.yahoo.com/news/morning-bid-awkward-g7-104941845.html",
    "timestamp": "2025-05-20T10:49:41Z"
  },
  {
    "title": "EU doubles down on Russia sanctions pressure",
    "description": "The News\nThe European Union upped its focus on pushing back against Russia, readying new sanctions against Moscow’s “shadow fleet” and agreeing a €150 billion plan to boost regional defense spending.\nThe announcements came a day after US President Donald Trum…",
    "link": "https://biztoc.com/x/42dfbcdb9a08f165",
    "timestamp": "2025-05-20T10:49:30Z"
  },
  {
    "title": "Donald Trump's Approval Rating Surges In Polls",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is experiencing a rebound in public opinion, new polling showing a surge in his national approval ratings.\nWhy It Matters\nIn recent weeks, Trump's approval ratings declined following his…",
    "link": "https://biztoc.com/x/8376537e4bf616aa",
    "timestamp": "2025-05-20T10:49:12Z"
  },
  {
    "title": "Transcript: Trump’s Angry Tirade at Walmart Wrecks His Own Tariff Scam",
    "description": "The following is a lightly edited transcript of the May 20 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident …",
    "link": "https://newrepublic.com/article/195466/transcript-trump-angry-tirade-walmart-wrecks-tariff-scam",
    "timestamp": "2025-05-20T10:48:04Z"
  },
  {
    "title": "Zelensky Issues Defiant Three-Word Response to Trump-Putin Call",
    "description": "\"It's our land\", the Ukrainian president told reporters on Monday, according to the local media.",
    "link": "https://www.newsweek.com/zelensky-trump-putin-ukraine-2074501",
    "timestamp": "2025-05-20T10:45:32Z"
  },
  {
    "title": "Hall of Presidents Update Explained as Bob Iger Meets With President Donald Trump",
    "description": "What is going on with Disney and Donald Trump? Earlier this month, Disney unveiled its seventh global theme park resort: Disneyland Abu Dhabi. Financed and operated by Miral, with creative licensing from The Walt Disney Company, Bob Iger explained that the ne…",
    "link": "https://insidethemagic.net/?p=773014&preview=true&preview_id=773014",
    "timestamp": "2025-05-20T10:43:22Z"
  },
  {
    "title": "Zelensky says Russia 'trying to buy time' to 'continue war'",
    "description": "Ukrainian President Volodymyr Zelensky on Tuesday accused Russia of not seriously engaging in peace talks and of wanting to continue its three-year invasion, despite a US push for a ceasefire. US President Donald Trump held calls with both Zelensky and Russia…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-says-russia-trying-to-buy-time-to-continue-war/articleshow/121290991.cms",
    "timestamp": "2025-05-20T10:42:07Z"
  },
  {
    "title": "Keisha Lance Bottoms officially enters 2026 Georgia governor’s race",
    "description": "The announcement comes weeks after Bottoms filed paperwork signaling her intent to run, but the video marks her first formal public statement as a candidate.",
    "link": "https://www.wsbradio.com/news/local/keisha-lance-bottoms-officially-enters-2026-georgia-governors-race/3ADMEZEZERBCXCJ2APA523SSWQ/",
    "timestamp": "2025-05-20T10:42:04Z"
  },
  {
    "title": "Trump's 'One Big Beautiful Bill Act': How remittance tax plan might deliver a big economic blow to US allies?",
    "description": "Trump's 'One Big Beautiful Bill Act'': A new US bill proposes a 5% tax on money sent from the US to other countries. This targets non-citizens and foreign nationals. It could impact countries like El Salvador, Honduras, and Guatemala. Mexico opposes the tax, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news/articleshow/121290701.cms",
    "timestamp": "2025-05-20T10:41:27Z"
  },
  {
    "title": "Donald Trump's Approval Rating Surges In Polls",
    "description": "Various polls conducted in recent days have shown Trump's approval ratings surging.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-polls-2074502",
    "timestamp": "2025-05-20T10:41:08Z"
  },
  {
    "title": "Tim Dillon Rejects ‘Crazy’ Idea That Podcasters Turned Voters Off to Kamala Harris",
    "description": "Comedian and podcast host Tim Dillon dismissed the idea that online personalities like himself played a decisive role in sinking Vice President Kamala Harris’s failed 2024 presidential campaign, arguing that pinning the blame on podcasters is a convenient def…",
    "link": "https://www.mediaite.com/tv/tim-dillon-rejects-crazy-idea-that-podcasters-turned-voters-off-to-kamala-harris/",
    "timestamp": "2025-05-20T10:41:06Z"
  },
  {
    "title": "Tim Dillon Rejects ‘Crazy’ Idea That Podcasters Turned Voters Off to Kamala Harris",
    "description": "Comedian and podcast host Tim Dillon dismissed the idea that online personalities like himself played a decisive role in sinking Vice President Kamala Harris’s failed 2024 presidential campaign, arguing that pinning the blame on podcasters is a convenient def…",
    "link": "https://www.mediaite.com/media/tv/tim-dillon-rejects-crazy-idea-that-podcasters-turned-voters-off-to-kamala-harris/",
    "timestamp": "2025-05-20T10:41:06Z"
  },
  {
    "title": "Home Depot plans to keep prices stable in the face of tariffs, bucking competitors | CNN Business",
    "description": "Home Depot said it doesn’t plan to raise prices because of President Donald Trump’s tariffs, breaking with Walmart and other retailers that will pass costs related to the trade war onto consumers.",
    "link": "https://www.cnn.com/2025/05/20/business/home-depot-stock-earnings",
    "timestamp": "2025-05-20T10:38:14Z"
  },
  {
    "title": "Why Democrats shouldn’t get too excited about Trump’s lousy polls",
    "description": "President Donald Trump speaks in the Oval Office of the White House on May 19, 2025. | Jim Watson/AFP via Getty Images\nDemocrats have a lot to be excited about when they look at President Donald Trump’s polls. Scores of voters have soured on his job performan…",
    "link": "https://biztoc.com/x/de47685d842851eb",
    "timestamp": "2025-05-20T10:38:03Z"
  },
  {
    "title": "President Trump Signs Law That Bans Non-consensual, AI-Generated Images",
    "description": "President Donald Trump signed a bill that bans the sharing of non-consensual, explicit images -- whether real or AI-generated. The legislation also requires tech platforms to remove such pictures within 48 hours of being notified about them.\n[Read More]",
    "link": "https://petapixel.com/2025/05/20/president-trump-signs-law-that-bans-non-consensual-ai-generated-images/",
    "timestamp": "2025-05-20T10:37:57Z"
  },
  {
    "title": "Schumer fields bill in bid to scuttle Trump's Qatar plane plans",
    "description": "Sen. Chuck Schumer is pushing a bill to block Defense Department funding from being spent in connection with an aircraft previously owned by foreign government, for the purpose of providing presidential flight options.",
    "link": "https://www.foxnews.com/politics/schumer-fields-bill-bid-scuttle-trumps-qatar-plane-plans",
    "timestamp": "2025-05-20T10:37:33Z"
  },
  {
    "title": "Purpose of Ramaphosa’s US visit disclosed",
    "description": "US-South Africa talks will focus on discussions trade and bilateral relations, Cyril Ramaphosa has said Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/617902-purpose-ramaphosa-us-visit-disclosed/",
    "timestamp": "2025-05-20T10:35:49Z"
  },
  {
    "title": "EU quietly complains Ukraine is ‘all on us now’ – FT",
    "description": "European leaders backing Kiev reportedly view the recent Putin-Trump phone call as a diplomatic win for Russia Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617899-europeans-shock-trump-ft/",
    "timestamp": "2025-05-20T10:34:50Z"
  },
  {
    "title": "Joe Biden prostate cancer diagnosis prompts queries about health in office",
    "description": "Several doctors say they are surprised former US president Joe Biden's prostate cancer was not diagnosed earlier.",
    "link": "https://7news.com.au/news/joe-biden-prostate-cancer-diagnosis-prompts-queries-about-health-in-office-c-18749646",
    "timestamp": "2025-05-20T10:33:31Z"
  },
  {
    "title": "Fresh UK sanctions on Russia announced - as Putin procrastinates on ceasefire talks",
    "description": "The UK has placed fresh sanctions on Russia as the Kremlin refused to put a timeline on ceasefire talks with Ukraine.",
    "link": "https://news.sky.com/story/fresh-uk-sanctions-on-russia-announced-as-putin-procrastinates-on-ceasefire-talks-13371420",
    "timestamp": "2025-05-20T10:33:00Z"
  },
  {
    "title": "EU adopts new Russia sanctions amid Ukraine ceasefire push",
    "description": "EU defense and foreign ministers are meeting in Brussels with Ukraine high on the agenda. The Europeans are calling for US more pressure on Russia if Moscow doesn't agree on a ceasefire. More on DW.",
    "link": "https://www.dw.com/en/eu-adopts-new-russia-sanctions-amid-ukraine-ceasefire-push/live-72604871",
    "timestamp": "2025-05-20T10:30:00Z"
  },
  {
    "title": "Eddie Vedder Trashes Donald Trump Amid President's Bruce Springsteen Feud",
    "description": "Pearl Jam frontman Eddie Vedder made an apparent dig at Donald Trump after the president criticized fellow musician Bruce Springsteen.",
    "link": "https://biztoc.com/x/987fa283b7830e46",
    "timestamp": "2025-05-20T10:27:18Z"
  },
  {
    "title": "Taiwan president calls trade tensions with the U.S. just ‘frictions between friends’ as tariff talks grind forward",
    "description": "The Taiwanese president said Tuesday that trade tensions between the United States and Taiwan are just “frictions between friends” in a show of optimism as tariff negotiations are underway with Washington.\nU.S. President Donald Trump imposed 32% tariffs on al…",
    "link": "https://biztoc.com/x/6e8485fd6183755a",
    "timestamp": "2025-05-20T10:27:16Z"
  },
  {
    "title": "Honda bets on hybrid comeback, puts brakes on EV expansion",
    "description": "Honda lowered its 2030 EV sales target from 30% to around 20% and reduced its electrification and software investment to $48.4 billion",
    "link": "https://www.thehindubusinessline.com/news/world/honda-bets-on-hybrid-comeback-puts-brakes-on-ev-expansion/article69597153.ece",
    "timestamp": "2025-05-20T10:26:43Z"
  },
  {
    "title": "Tron founder Justin Sun tops TRUMP memecoin holders rankings earning VIP gala dinner invite",
    "description": "Tron founder Justin Sun has confirmed he will attend a May 22 gala dinner organized for top TRUMP memecoin holders and hosted by US President Donald Trump. In a May 20 post on X, Sun said he was invited to the exclusive event and expressed gratitude and suppo…",
    "link": "https://cryptoslate.com/tron-founder-justin-sun-tops-trump-memecoin-holders-earns-gala-dinner-invite-this-week/",
    "timestamp": "2025-05-20T10:26:15Z"
  },
  {
    "title": "Kid Rock Toadies Up To Trump With Graphic, Violent Turn Of Phrase",
    "description": "The pro-MAGA musician also came up with a new way to refer to the president.",
    "link": "https://www.huffpost.com/entry/kid-rock-praise-donald-trump-turn-of-phrase_n_682c4ef2e4b095274fad4fe1",
    "timestamp": "2025-05-20T10:25:36Z"
  },
  {
    "title": "China's EV battery leader surges in world's biggest listing this year",
    "description": "A leading Chinese electric-vehicle battery maker made its Hong Kong trading debut on Tuesday in the world’s biggest listing so far this year.",
    "link": "https://www.nbcnews.com/world/asia/china-ev-battery-electic-vehicle-listing-catl-rcna207619",
    "timestamp": "2025-05-20T10:23:51Z"
  },
  {
    "title": "Spike Lee Says ‘Highest 2 Lowest’ Is Potentially His Last Collaboration With Denzel Washington: “This Is It—Five”",
    "description": "“The last time I was in this room I was apologizing for the fuck up,” filmmaker Spike Lee joked this morning as he walked into the press conference room in Cannes.  The legendary New York filmmaker was referring to 2021 when he served as the Cannes jury presi…",
    "link": "http://deadline.com/2025/05/spike-lee-denzel-washington-highest-2-lowest-cannes-1236405479/",
    "timestamp": "2025-05-20T10:23:31Z"
  },
  {
    "title": "Former Atlanta mayor Keisha Lance Bottoms launches bid for Georgia governor",
    "description": "Democrat Keisha Lance Bottoms says her one term as Atlanta mayor gave her “battle-tested executive leadership” that she can offer to Georgia voters as she runs for governor",
    "link": "https://abcnews.go.com/Politics/wireStory/former-atlanta-mayor-keisha-lance-bottoms-launches-bid-121978858",
    "timestamp": "2025-05-20T10:22:27Z"
  },
  {
    "title": "Some athletes skip Washington's pride events, wary of welcome in Trump's US",
    "description": "TORONTO :Ry Shissler, a 40-year old cartographer who swims the backstroke, was planning to compete internationally for the first time during the WorldPride celebrations that start this month in Washington, D.C.But the trans athlete and their team, Toronto’s P…",
    "link": "https://www.channelnewsasia.com/sport/some-athletes-skip-washingtons-pride-events-wary-welcome-trumps-us-5141771",
    "timestamp": "2025-05-20T10:21:58Z"
  },
  {
    "title": "Eddie Vedder Trashes Donald Trump Amid President's Bruce Springsteen Feud",
    "description": "Pearl Jam frontman Eddie Vedder made an apparent dig at Donald Trump after the president criticized fellow musician Bruce Springsteen.",
    "link": "https://www.newsweek.com/eddie-vedder-trump-bruce-springsteen-2074454",
    "timestamp": "2025-05-20T10:20:09Z"
  },
  {
    "title": "Low-income migrants fined up to $1.8 million by Trump administration",
    "description": "WASHINGTON (Reuters) -Wendy Ortiz was surprised to find out she was being fined by U.S. immigration authorities for being in the country illegally - but it was the amount that truly shocked her: $1.8 million. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/20/low-income-migrants-fined-up-to-18-million-by-trump-administration",
    "timestamp": "2025-05-20T10:20:00Z"
  },
  {
    "title": "Trump can complain all he wants – but he can’t stop his own economic mess | Sidney Blumenthal",
    "description": "Between his tariffs and his regressive ‘big, beautiful bill’, the president is wreaking havoc – and he never learns\nWith his usual threats, Donald Trump is trying to ward off the dire reality that he has created and is bearing down on him. He can clamp migran…",
    "link": "https://biztoc.com/x/ca603e7b41d7f13f",
    "timestamp": "2025-05-20T10:16:27Z"
  },
  {
    "title": "EU state votes to quit ICC",
    "description": "The Hungarian parliament has approved a bill that enacts withdrawal from The Hague-based court Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617905-hungary-votes-quit-icc/",
    "timestamp": "2025-05-20T10:16:17Z"
  },
  {
    "title": "Bitcoin is signaling a golden cross — What does it mean for BTC price?",
    "description": "Key takeaways:<ul><li>Bitcoin is nearing a golden cross that led to 45–60% price rallies in the recent past.\r\n</li><li>Fundamentals like rising M2 supply and easing trade tensions support a bullish outlook.\r\n</li><li>Bearish divergence and overbought conditio…",
    "link": "https://cointelegraph.com/news/bitcoin-golden-cross-what-does-it-mean-for-btc-price",
    "timestamp": "2025-05-20T10:15:00Z"
  },
  {
    "title": "Cory Booker Faces Backlash After Voting for Jared Kushner's Father",
    "description": "Charles Kushner, who is set to serve as ambassador to France, said, \"I think that my past mistakes … make me more qualified.\"",
    "link": "https://www.newsweek.com/charles-kushner-cory-booker-senate-ambassador-france-2074487",
    "timestamp": "2025-05-20T10:13:56Z"
  },
  {
    "title": "US Makes 'Revenge Porn' Illegal, Social Media Sites Must Build Reporting Tools",
    "description": "It’s now illegal to distribute nonconsensual sexual images in the US thanks to the new Take It Down law. Sites active in the US must now build a process to remove imagery when it's reported.\nIt is now illegal to distribute nonconsensual intimate images in the…",
    "link": "https://uk.pcmag.com/ai/158115/us-makes-revenge-porn-illegal-social-media-sites-must-build-reporting-tools",
    "timestamp": "2025-05-20T10:12:29Z"
  },
  {
    "title": "US Makes 'Revenge Porn' Illegal, Social Media Sites Must Build Reporting Tools",
    "description": "It’s now illegal to distribute nonconsensual sexual images in the US thanks to the new Take It Down law. Sites active in the US must now build a process to remove imagery when it's reported.\nIt is now illegal to distribute nonconsensual intimate images in the…",
    "link": "https://me.pcmag.com/en/ai/29938/us-makes-revenge-porn-illegal-social-media-sites-must-build-reporting-tools",
    "timestamp": "2025-05-20T10:12:29Z"
  },
  {
    "title": "Gazan twins in Cannes warn ‘nothing left’ of homeland",
    "description": "Twin Gazan filmmakers Arab and Tarzan Nasser said they never thought the title of their new film “Once Upon A Time In Gaza” would have such heartbreaking resonance. “Right now there is nothing left of Gaza,” said Tarzan when it premiered on Monday at the Cann…",
    "link": "https://www.digitaljournal.com/world/gazan-twins-in-cannes-warn-nothing-left-of-homeland/article",
    "timestamp": "2025-05-20T10:12:20Z"
  },
  {
    "title": "CBS News CEO steps down amid Harris interview turmoil",
    "description": "Wendy McMahon has tendered her resignation as the network fights a $20 billion lawsuit by Donald Trump alleging election interference Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617903-cbs-ceo-resigns-trum-suit-harris/",
    "timestamp": "2025-05-20T10:11:13Z"
  },
  {
    "title": "Ex-Atlanta Mayor Keisha Lance Bottoms officially announces run for governor",
    "description": "After weeks of speculation, former Atlanta Mayor and White House adviser Keisha Lance Bottoms has officially announced that she is running to be Georgia's next governor.",
    "link": "https://www.fox5atlanta.com/news/keisha-lance-bottoms-georgia-governor-campaign-announcement",
    "timestamp": "2025-05-20T10:10:08Z"
  },
  {
    "title": "Spike Lee Shades Trump at Cannes: ‘I Don’t Know How Much We Can Talk About American Values Considering Who Is President’",
    "description": "Spike Lee threw some shade at Donald Trump during the Cannes Film Festival press conference for his latest joint “Highest 2 Lowest.” When asked about if social media has jeopardized morals in America, Lee replied: “I don’t know how much we can talk about Amer…",
    "link": "https://variety.com/2025/film/festivals/spike-lee-shades-trump-cannes-american-values-1236404273/",
    "timestamp": "2025-05-20T10:09:57Z"
  },
  {
    "title": "RFK Jr. calls for healthier school meals as Trump cancels program that funded them",
    "description": "TUCSON, Arizona (Reuters) -First-graders at John B. Wright elementary school in Tucson bounced into the brightly lit lunchroom, chattering with friends as...",
    "link": "https://ca.news.yahoo.com/rfk-jr-calls-healthier-school-100858737.html",
    "timestamp": "2025-05-20T10:08:58Z"
  },
  {
    "title": "Qatar's PM says he doesn't know why its $400 million Jumbo jet gift is being called 'bribery'",
    "description": "Qatar's leader called its offer of a Boeing 747 to the US \"a normal thing between allies\" and denied trying to \"buy influence\" with the administration.",
    "link": "https://www.businessinsider.com/qatar-boeing-747-gift-us-donald-trump-bribery-denial-2025-5",
    "timestamp": "2025-05-20T10:07:11Z"
  },
  {
    "title": "The Questionable Case of Kristi Noem's $50 Million Luxury Jet",
    "description": "Coast Guard search and rescue planes need fixing, but DHS argues Noem suddenly requires a fancy new jet for safety reasons.\nThe post The Questionable Case of Kristi Noem’s $50 Million Luxury Jet appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/20/kristi-noem-coast-guard-50-million-gulfstream-luxury-jet/",
    "timestamp": "2025-05-20T10:07:00Z"
  },
  {
    "title": "Countries seal global WHO deal for future pandemics",
    "description": "It aims to better equip the world for the next pandemic, but further negotiations are expected to last another year.",
    "link": "https://www.euractiv.com/section/health-consumers/news/countries-seal-global-who-deal-for-future-pandemics/",
    "timestamp": "2025-05-20T10:05:54Z"
  },
  {
    "title": "‘Project Homecoming’ launches first flight of 64 illegal immigrants accepting $1,000 to self-deport",
    "description": "The U.S. Department of Homeland Security (DHS) conducted its first self-deport operation, dubbed \"Project Homecoming,\" with a charter flight on Monday from Texas, and made stops in Honduras and Colombia, taking 64 illegal immigrants who chose to self-deport b…",
    "link": "https://nypost.com/2025/05/20/us-news/project-homecoming-launches-first-flight-of-64-illegal-immigrants-accepting-1000-to-self-deport/",
    "timestamp": "2025-05-20T10:05:15Z"
  },
  {
    "title": "Cannes: Director Raoul Peck Despairs U.S. 'Under Attack' from Trump 'Dictatorship'",
    "description": "Everywhere director Raoul Peck looks he sees America under attack from dark, malevolent forces driven by a President Donald Trump dictatorship. Really, he does.\nThe post Cannes: Director Raoul Peck Despairs U.S. ‘Under Attack’ from Trump ‘Dictatorship’ appear…",
    "link": "https://www.breitbart.com/entertainment/2025/05/20/cannes-director-raoul-peck-despairs-u-s-under-attack-from-trump-dictatorship/",
    "timestamp": "2025-05-20T10:04:30Z"
  },
  {
    "title": "Trump hostage envoy dismisses report of Israel abandonment threat as 'fake news'",
    "description": "Special envoy slams \"fake news\" report on President Donald Trump’s stance toward Israel, discusses progress in hostage negotiations and says of new US aid going to Gaza that \"perhaps there needs to be a replacement for UNRWA.\"",
    "link": "https://www.foxnews.com/world/trump-hostage-envoy-dismisses-report-israel-abandonment-threat-fake-news",
    "timestamp": "2025-05-20T10:03:31Z"
  },
  {
    "title": "Russia wants lasting resolution to Ukraine conflict – Ex Deputy Foreign Minister",
    "description": "Vladimir Chizhov has dismissed Ukraine’s demand for a 30-day ceasefire as a “strategic breathing room” for Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617859-chizhov-russia-wants-lasting-resolution/",
    "timestamp": "2025-05-20T10:02:43Z"
  },
  {
    "title": "Fiery RFK flogs WHO for caving to China on COVID, celebrating pandemic ‘failures’ in stunning video to org",
    "description": "HHS Secretary Robert F. Kennedy Jr. outlines reasons for U.S. withdrawal from WHO, highlighting failures in COVID-19 response and China's influence on the organization.",
    "link": "https://www.foxnews.com/politics/fiery-rfk-flogs-who-caving-china-covid-celebrating-pandemic-failures-stunning-video-org",
    "timestamp": "2025-05-20T10:00:55Z"
  },
  {
    "title": "Democrats were shocked at Biden’s decline but stayed quiet, according to new book",
    "description": "Joe Biden had private moments as president where he could not recall the names of top aides and was prone to incoherence and losing his train of thought, according to a new book.",
    "link": "https://www.cnn.com/2025/05/20/politics/biden-book-original-sin-age",
    "timestamp": "2025-05-20T10:00:51Z"
  },
  {
    "title": "2026 Georgia governor race: Former Atlanta mayor Keisha Lance Bottoms running",
    "description": "Former Atlanta Mayor Keisha Lance Bottoms officially announced her candidacy for governor on Monday.",
    "link": "https://www.wsbtv.com/news/local/keisha-lance-bottoms-makes-it-official-announces-candidacy-georgia-governor/XEDFJMC67ZDQ7OBHYFI2VIZZI4/",
    "timestamp": "2025-05-20T10:00:38Z"
  },
  {
    "title": "Freed hostage Keith Siegel: Hard to describe horrors, abuse, violence of Hamas captivity",
    "description": "\"We want this war to end, and we want President [Donald] Trump to bring them all back - all the 58,\" freed hostage Aviva Siegel said.",
    "link": "https://www.jpost.com/conferences/article-854710",
    "timestamp": "2025-05-20T10:00:30Z"
  },
  {
    "title": "Anonymous Democrats confess to Time Magazine their party is too extreme on abortion, trans athletes",
    "description": "Democrats anonymously told Time Magazine that their party had become too extreme on issues like trans athletes in girls' sports and abortion access.",
    "link": "https://www.foxnews.com/media/anonymous-democrats-confess-time-magazine-party-too-extreme-abortion-trans-athletes",
    "timestamp": "2025-05-20T10:00:19Z"
  },
  {
    "title": "Flashback: Remember when Nikki Haley called for mental competency tests for all politicians 75 or older?",
    "description": "As Nikki Haley pushed for mental competency tests in her 2024 presidential run, former President Joe Biden's cognitive abilities and transparency in leadership continue to be debated.",
    "link": "https://www.foxnews.com/politics/haleys-call-mental-competency-tests-gains-new-relevance-amid-biden-revelations",
    "timestamp": "2025-05-20T10:00:02Z"
  },
  {
    "title": "Report: Abortion Providers Are Confronting a New Wave of Extremism",
    "description": "In November 2023, while an abortion provider in the South was on vacation, someone broke into their home, shattered the windows, and scribbled “Baby Killer” on a whiteboard. The case is still open. That same year, a man crashed his car into a new abortion cli…",
    "link": "https://www.motherjones.com/politics/2025/05/report-abortion-providers-clinic-attacks-are-confronting-a-wave-of-extremism-violence/",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "US should rethink current views of Russia’s cyber might, new report says",
    "description": "A think tank paper argues that Moscow’s network of hackers is more fragmented than U.S. officials once believed — a dynamic that may have led to exaggerated expectations of Russia’s cyber capabilities during its 2022 Ukraine invasion.",
    "link": "https://www.nextgov.com/cybersecurity/2025/05/us-should-rethink-current-views-russias-cyber-might-new-report-says/405440/",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "Behind the New Biden Book That Was Roiling Washington Even Before His Cancer Disclosure",
    "description": "Alex Thompson, co-author of the new Biden book, \"Original Sin,\" talks with The D.C. Brief about the coverup around Biden's health",
    "link": "https://time.com/7286591/biden-cancer-original-sin-alex-thompson/",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "Is Saudi Arabia really worse than DEI-addled Western states?",
    "description": "Donald Trump’s glowingly successful efforts at building relations with Arab leaders have evoked criticism from neoconservative skeptics. One such example appears in Rich Lowry’s column on “the Trump doctrine,” prominently featured in Friday’s New York Post. T…",
    "link": "https://www.theblaze.com/columns/opinion/is-saudi-arabia-really-worse-than-dei-addled-western-states",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "Tariffs Explained: Price Hikes Loom as Trump Clashes With Walmart",
    "description": "As tariff price hikes come closer to reality, a major retailer has joined the chorus of businesses warning of price hikes to come.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-price-hikes-loom-as-trump-clashes-with-walmart/",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "History’s warning for Republicans who back Trump’s massive budget bill",
    "description": "For this budget to pass, just about every Republican will have to vote for it — just as occurred in 1993 — which means they can all be held responsible for what it does.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/republicans-trump-budget-bill-medicaid-snap-economy-rcna207725",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "Former Atlanta Mayor Keisha Lance Bottoms launches run for Georgia governor",
    "description": "Keisha Lance Bottoms, the former Atlanta mayor who more recently served in top posts at the Democratic National Committee and in former President Joe Biden’s White House and 2024 campaign, is running for governor of Georgia.",
    "link": "https://www.nbcnews.com/politics/2026-election/former-atlanta-mayor-keisha-lance-bottoms-launches-run-georgia-governo-rcna207688",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "Why Republicans are using the 'reconciliation' process on Trump's megabill",
    "description": "What is budget reconciliation? The process that Republicans are using to move Trump's one big beautiful bill to cut taxes abd Medicaid through Congress.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/house-republicans-budget-reconciliation-explained-rcna207707",
    "timestamp": "2025-05-20T10:00:00Z"
  },
  {
    "title": "How Trump’s Tariff Unpredictability Hurts Businesses and Consumers—and Could Help China",
    "description": "No one knows what to expect in 90 days, when the trade-war truce ends.",
    "link": "https://time.com/7286933/trump-trade-war-us-china-tariff-pause-businesses-costs-uncertainty/",
    "timestamp": "2025-05-20T10:00:00Z"
  }
]