[
  {
    "title": "Why Iran may back down after Israel’s devastating attack",
    "description": "In every war, after the first bullet flies, the first question asked is “How does this end?” Anyone who confidently answers is either Nostradamus or nuts.",
    "link": "https://nypost.com/2025/06/13/opinion/why-iran-may-back-down-after-israels-devastating-attack/",
    "timestamp": "2025-06-13T21:42:10Z"
  },
  {
    "title": "Trump’s military parade is a warning",
    "description": "Donald Trump’s military parade in Washington this weekend — a show of force in the capital that just happens to take place on the president’s birthday — smacks of authoritarian Dear Leader-style politics (even though Trump actually got the idea after attendin…",
    "link": "https://www.vox.com/politics/416880/trumps-military-parade-is-a-warning",
    "timestamp": "2025-06-13T21:42:04Z"
  },
  {
    "title": "How the Israel-Iran War Might End",
    "description": "Scenarios include an Iranian defeat, an Israeli retreat—or an expanded regional conflict.",
    "link": "http://foreignpolicy.com/2025/06/13/israel-iran-war-netanyahu-us-scenarios/",
    "timestamp": "2025-06-13T21:38:28Z"
  },
  {
    "title": "Trump Lawyers Ask to Extend Deadlines in $20 Billion CBS Lawsuit, Citing ‘Active Settlement Discussions’",
    "description": "The president's team asked the Texas federal court to delay the deadlines for the media giant's motion to compel and his response to that motion to June 30 and July 7, respectively\nThe post  Trump Lawyers Ask to Extend Deadlines in $20 Billion CBS Lawsuit, Ci…",
    "link": "https://www.thewrap.com/trump-cbs-lawsuit-deadline-extension-request-settlement-discussions/",
    "timestamp": "2025-06-13T21:37:41Z"
  },
  {
    "title": "Cory Booker, AKA Spartacus, Has a Full-Blown Meltdown on the Senate Floor Over Alex Padilla",
    "description": "Cory Booker, AKA Spartacus, Has a Full-Blown Meltdown on the Senate Floor Over Alex Padilla",
    "link": "https://freerepublic.com/focus/f-bloggers/4322909/posts",
    "timestamp": "2025-06-13T21:36:10Z"
  },
  {
    "title": "Cory Booker, AKA Spartacus, Has a Full-Blown Meltdown on the Senate Floor Over Alex Padilla",
    "description": "Cory Booker, AKA Spartacus, Has a Full-Blown Meltdown on the Senate Floor Over Alex Padilla",
    "link": "https://freerepublic.com/focus/f-news/4322909/posts",
    "timestamp": "2025-06-13T21:36:10Z"
  },
  {
    "title": "\"No Kings\" protests nationwide to push back on Trump's overreach: report",
    "description": "NEW YORK, June 13 (Xinhua) -- In the hours before tanks barrel down the streets of Washington, D.C. for U.S. President Donald Trump's grand military parade on Saturday, thousands of Americans are expected to gather across the country in defiance of what they …",
    "link": "https://www.thestar.com.my/news/world/2025/06/14/no-kings-protests-nationwide-to-push-back-on-trump039s-overreach-report",
    "timestamp": "2025-06-13T21:35:00Z"
  },
  {
    "title": "What To Know About Iran’s Nuclear Program After Israel’s Strikes",
    "description": "Israel struck key Iranian nuclear sites to curb bomb development amid rapid uranium enrichment and rising tensions.",
    "link": "https://time.com/7294133/iran-israel-nuclear-program-attack/",
    "timestamp": "2025-06-13T21:34:23Z"
  },
  {
    "title": "Trump, Netanyahu spoke Friday amid Israel-Iran conflict, White House official says (Steve Holland/Reuters)",
    "description": "Steve Holland / Reuters:\nTrump, Netanyahu spoke Friday amid Israel-Iran conflict, White House official says  —  U.S. President Donald Trump and Israel's Prime Minister Benjamin Netanyahu spoke on Friday amid escalating conflict between Iran and Israel, a Whit…",
    "link": "https://www.memeorandum.com/250613/p126",
    "timestamp": "2025-06-13T21:30:00Z"
  },
  {
    "title": "Q&A on Federalizing the National Guard in Los Angeles",
    "description": "The disagreement between President Donald Trump and California Gov. Gavin Newsom over Trump deploying state National Guard troops to Los Angeles is now being debated in court. We’ll explain how the situation developed and answer some common questions.\nThe pos…",
    "link": "https://www.factcheck.org/2025/06/qa-on-federalizing-the-national-guard-in-los-angeles/",
    "timestamp": "2025-06-13T21:29:40Z"
  },
  {
    "title": "A court ordered Trump’s team to free an activist. They refused.",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is defying a federal judge’s …",
    "link": "https://www.vox.com/politics/416912/mahmoud-khalil-court-order-trump",
    "timestamp": "2025-06-13T21:29:26Z"
  },
  {
    "title": "US stock market: Nasdaq, Dow Jones, S&P 500 crash; Top gainers, top losers",
    "description": "US stock market closed in red as ten of the 11 S&P 500 sector indexes declined, led lower by financials, down 2.06 per cent, followed by a 1.5 per cent loss in information technology.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-nasdaq-dow-jones-sp-500-crash-top-gainers-top-losers/articleshow/121838160.cms",
    "timestamp": "2025-06-13T21:28:06Z"
  },
  {
    "title": "Congress members demand that EEOC address gender identity discrimination",
    "description": "Seventy members of Congress are demanding that the Equal Employment Opportunity Commission enforce protections against anti-transgender discrimination.",
    "link": "https://www.advocate.com/politics/eeoc-enfocement-gender-identity-discrimination",
    "timestamp": "2025-06-13T21:26:11Z"
  },
  {
    "title": "Iranian Official Leading Nuclear Negotiation With Trump Killed by Israel, Jeopardizing Breakthrough Deal",
    "description": "Iran canceled Sunday's talks with the U.S. after Israel's surprise strike killed top commanders and nuclear scientists, including lead negotiator Ali Shamkhani.",
    "link": "https://www.ibtimes.com/iranian-official-leading-nuclear-negotiation-trump-killed-israel-jeopardizing-breakthrough-deal-3775640",
    "timestamp": "2025-06-13T21:26:11Z"
  },
  {
    "title": "Israel strikes may make Iran more determined to pursue nuclear programme",
    "description": "Analysts believe that Iran may accelerate efforts to acquire a nuclear bomb as it faces a major Israeli assault.",
    "link": "https://www.aljazeera.com/news/2025/6/13/iran-to-double-down-on-nuclear-programme-after-israeli-strikes-analysts",
    "timestamp": "2025-06-13T21:21:41Z"
  },
  {
    "title": "Brace Yourself for This Weekend’s Anticipated Swarm of Anti-ICE Protests",
    "description": "Father’s Day weekend might be met with a side of anti-fascist chaos… across the country.\nThe post Brace Yourself for This Weekend’s Anticipated Swarm of Anti-ICE Protests appeared first on The Root.",
    "link": "https://www.theroot.com/expert-brace-yourself-for-anti-ice-protests-but-thats-2000045486",
    "timestamp": "2025-06-13T21:21:35Z"
  },
  {
    "title": "Carrie Coon says it's hard to talk to Trump supporters: 'There's no basis in fact'",
    "description": "'The White Lotus' star Carrie Coon opened up about how she finds it hard to talk to Trump supporters 'because there's no basis in fact,' which is a direct parallel to how her character felt about the same issue on the HBO series.",
    "link": "https://ew.com/carrie-coon-says-hard-talk-trump-supporters-11754557",
    "timestamp": "2025-06-13T21:21:34Z"
  },
  {
    "title": "US Adversaries Fuel Disinformation About LA Protests",
    "description": "Russia, China and Iran are amplifying disinformation about protests over immigration raids in Los Angeles, researchers said Friday, adding to a surge of domestically generated falsehoods and conspiracy theories.",
    "link": "https://www.ibtimes.com/us-adversaries-fuel-disinformation-about-la-protests-3775634",
    "timestamp": "2025-06-13T21:21:21Z"
  },
  {
    "title": "Taking Your Phone To A Trump Protest Could Have Alarming Consequences",
    "description": "“Even if it’s in airplane mode, there’s a chance that your movements can be tracked,\" one privacy expert said.",
    "link": "https://www.huffpost.com/entry/bring-phone-trump-protest_n_684af296e4b068e3d5dfb242",
    "timestamp": "2025-06-13T21:19:01Z"
  },
  {
    "title": "Tucker Carlson Attacks ‘Warmongers’ at Fox, Sean Hannity and Rupert Murdoch: ‘They Will All Have to Answer For This’",
    "description": "Fox News fired Carlson in April 2023.\nThe post Tucker Carlson Attacks ‘Warmongers’ at Fox, Sean Hannity and Rupert Murdoch: ‘They Will All Have to Answer For This’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/tucker-carlson-attacks-warmongers-at-fox-sean-hannity-and-rupert-murdoch-they-will-all-have-to-answer-for-this/",
    "timestamp": "2025-06-13T21:17:43Z"
  },
  {
    "title": "US adversaries fuel disinformation about LA protests",
    "description": "Russia, China and Iran are amplifying disinformation about protests over immigration raids in Los Angeles, researchers said Friday, adding to a surge of domestically generated falsehoods and conspiracy theories. The findings from researchers at the disinforma…",
    "link": "https://www.digitaljournal.com/world/us-adversaries-fuel-disinformation-about-la-protests/article",
    "timestamp": "2025-06-13T21:17:20Z"
  },
  {
    "title": "Trump crushed every democratic safeguard — except one",
    "description": "Trump wants blood.The spectacle is the point. The helicopters. The uniforms. The rumble of armored personnel carriers down the boulevards of Los Angeles. The former president of the United States — now reinstalled in the White House through judicial (Citizens…",
    "link": "https://www.rawstory.com/raw-investigates/trump-wants-blood/",
    "timestamp": "2025-06-13T21:16:57Z"
  },
  {
    "title": "Newsom tries to give Trump the Biden treatment, says he’s ‘not all there’",
    "description": "Newsom defended Biden's mental fitness in office, now says Trump is in decline.",
    "link": "https://nypost.com/2025/06/13/media/newsom-tries-to-give-trump-the-biden-treatment-says-hes-not-all-there/",
    "timestamp": "2025-06-13T21:15:03Z"
  },
  {
    "title": "Puzzled Trump Says He Has No Idea Why Musk Supported Him in the First Place",
    "description": "President Donald Trump has once again said the quiet part out loud. During a signing ceremony for a trio of bills blocking California's new emissions standards and pro-electric vehicle push the president admitted that he had been surprised when his former aid…",
    "link": "https://futurism.com/trump-musk-support-evs",
    "timestamp": "2025-06-13T21:13:11Z"
  },
  {
    "title": "Totalitarian kitsch",
    "description": "To return to a theme we briefly discussed yesterday, Krugman does an excellent job connecting Trump’s open authoritarianism to his extremely cruel and unpopular domestic agenda: That 4 percent income decline for the poorest 10 percent of Americans is the scal…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/totalitarian-kitsch",
    "timestamp": "2025-06-13T21:13:00Z"
  },
  {
    "title": "Maine legislature rejects bill to keep trans athletes out of girls' sports amid growing conflict on issue",
    "description": "Maine's legislature rejected a bill, LD 1134, on Thursday that would have kept biologically male trans athletes out of girls' sports and complied with Trump.",
    "link": "https://www.foxnews.com/sports/maine-legislature-rejects-bill-keep-trans-athletes-out-girls-sports-amid-growing-conflict-issue",
    "timestamp": "2025-06-13T21:11:57Z"
  },
  {
    "title": "There’s a Darker Purpose Behind Trump’s Latest Law Enforcement Against Political Foes",
    "description": "It all goes back to Jan. 6.",
    "link": "https://slate.com/news-and-politics/2025/06/padilla-arrest-vs-trump-jan-six-insurrection.html",
    "timestamp": "2025-06-13T21:10:04Z"
  },
  {
    "title": "The Manosphere Is at War With Itself Over Israel’s Strike on Iran",
    "description": "The online brotherhood built on dominance and certainty is fracturing fast over real-world war.",
    "link": "https://gizmodo.com/the-manosphere-is-at-war-with-itself-over-israels-strike-on-iran-2000615773",
    "timestamp": "2025-06-13T21:10:03Z"
  },
  {
    "title": "Paramount-CBS And Trump Legal Teams Say They Are In “Continued Mediation” To Settle ’60 Minutes’ Lawsuit, Ask Judge To Extend Some Filing Deadlines",
    "description": "The CBS-Paramount Global legal team and representatives for Donald Trump said that they were in “continued mediation” to settle the president’s $20 billion lawsuit against the network over the way that a 60 Minutes interview with Kamala Harris was edited. The…",
    "link": "http://deadline.com/2025/06/trump-60-minutes-lawsuit-cbs-3-1236433691/",
    "timestamp": "2025-06-13T21:08:30Z"
  },
  {
    "title": "Receiver sells alleged predatory lender’s Jupiter home after her husband’s RICO sentencing",
    "description": "The Jupiter home of alleged predatory lender and fraudster Lisa McElhone sold out of receivership for $12.2 million.  The sale is part of a years-long federal case brought against McElhone and her husband, convicted fraudster Joseph LaForte, who was sentenced…",
    "link": "https://therealdeal.com/miami/2025/06/13/receiver-sells-jupiter-home-after-rico-sentencing/",
    "timestamp": "2025-06-13T21:08:22Z"
  },
  {
    "title": "Trump's balancing act on the Israel-Iran conflict: From the Politics Desk",
    "description": "President Donald Trump faces a political balancing act on the Israel-Iran conflict, with some in the MAGA base wanting to avoid another Middle East conflict.",
    "link": "https://www.nbcnews.com/politics/politics-news/trumps-balancing-act-israel-iran-conflict-politics-desk-rcna212976",
    "timestamp": "2025-06-13T21:08:10Z"
  },
  {
    "title": "Iran Responds to Crippling Israeli Attack With Missile Salvo",
    "description": "Iran fired hundreds of missiles in retaliation for Israel’s airstrikes that targeted Tehran’s military and nuclear infrastructure, broadening a conflict that threatens to engulf the region and roil global markets.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-responds-to-crippling-israeli-attack-with-missile-salvo",
    "timestamp": "2025-06-13T21:07:36Z"
  },
  {
    "title": "Oil prices soar amid conflict in Iran and Israel",
    "description": "Oil prices jump as fears of global economic impact grow. Stocks fall as investors seek safe haven in gold. Treasury bond prices also fall.",
    "link": "https://www.wishtv.com/news/business/oil-prices-soar-amid-conflict-in-iran-and-israel/",
    "timestamp": "2025-06-13T21:01:04Z"
  },
  {
    "title": "Far-Right Extremists Prepare Violence for “No Kings” Protests",
    "description": "Far-right groups are humming with talk of potential violence ahead of massive “No Kings” Day demonstrations that are expected to attract millions of protesters Saturday, according to The Wall Street Journal.\r\nIn a Telegram channel used by groups affiliated wi…",
    "link": "https://newrepublic.com/post/196844/far-right-extremists-prepare-violence-no-kings-protests",
    "timestamp": "2025-06-13T21:00:50Z"
  },
  {
    "title": "Iran launches wave of missiles at Israel as Donald Trump under pressure to solve escalating conflict between the foes",
    "description": "Iran launches wave of missiles at Israel as Donald Trump under pressure to solve escalating conflict between the foes7news.com.au",
    "link": "https://7news.com.au/news/conflict/iran-launches-wave-of-missiles-at-israel-as-donald-trump-under-pressure-to-solve-escalating-conflict-between-the-foes-c-19029457",
    "timestamp": "2025-06-13T21:00:40Z"
  },
  {
    "title": "Chris Matthews says it's fair to call Obama's Iran nuclear deal a 'joke'",
    "description": "Former MSNBC host Chris Matthews criticized former President Obama's Iran nuclear deal following Israel's strike on Iran, saying Trump was fair to call the deal a \"joke.\"",
    "link": "https://www.foxnews.com/media/chris-matthews-says-fair-call-obamas-iran-nuclear-deal-joke",
    "timestamp": "2025-06-13T21:00:28Z"
  },
  {
    "title": "How a US agriculture agency became key in the fight against bird flu",
    "description": "Amidst an ongoing outbreak of a deadly bird flu virus in livestock, the US Department of Agriculture is doing more to prevent the spread than public health agencies are",
    "link": "https://www.newscientist.com/article/2484143-how-a-us-agriculture-agency-became-key-in-the-fight-against-bird-flu/",
    "timestamp": "2025-06-13T21:00:25Z"
  },
  {
    "title": "Hillary Clinton Net Worth: How She Went From Broke to $120 Million Rich",
    "description": "Hillary Clinton's money story is absolutely wild. We're talking about someone who went from being millions in debt to sitting on a $120 million fortune. And here's the crazy part – most of that cash didn't come from being a politician. This woman basically fi…",
    "link": "https://freerepublic.com/focus/f-chat/4322904/posts",
    "timestamp": "2025-06-13T21:00:10Z"
  },
  {
    "title": "Juror kicked off of after 23 days... | | Defense insists will have 'chilling effect'...",
    "description": "EMBATTLED rapper Kanye West crashed Sean “Diddy” Combs’ federal trial on Friday, but quickly stormed out of the courthouse after reportedly being banished to an ove…",
    "link": "https://www.the-sun.com/entertainment/14473078/kanye-west-diddy-trial/",
    "timestamp": "2025-06-13T21:00:03Z"
  },
  {
    "title": "Miramax Picks Up the Rights to Amy Taylor's Upcoming Novel RUINS to Make Film Set to Star Vanessa Kirby & Sebastian Stan",
    "description": "In a competitive bidding war, Miramax has won the rights to author Amy Taylor’s upcoming second novel, Ruins, with Oscar nominees and longtime friends Vanessa Kirby and Sebastian Stan attached to headline and produce. The story follows a couple whose affair w…",
    "link": "https://geektyrant.com/news/miramax-picks-up-the-rights-to-amy-taylors-upcoming-novel-ruins-to-make-film-set-to-star-vanessa-kirby-amp-sebastian-stan",
    "timestamp": "2025-06-13T21:00:00Z"
  },
  {
    "title": "‘No Kings’ organizers working with law enforcement in hopes of peaceful protest on Saturday",
    "description": "More than 5,000 people are expected to crowd into Liberty Plaza on Saturday morning as part of the demonstration.",
    "link": "https://www.wsbtv.com/news/local/atlanta/no-kings-organizers-working-with-law-enforcement-hopes-peaceful-protest-saturday/2WTYSECXN5CRHPFN43CBLWBOLQ/",
    "timestamp": "2025-06-13T20:56:58Z"
  },
  {
    "title": "Javier Milei Publishes Photo with Netanyahu, Backs Israel After Iran Attack",
    "description": "President of Argentina Javier Milei was not present in Israel by the time the country shut down its airspace prior to launching strikes against Iran's nuclear and missile infrastructure on Thursday evening, several sources confirmed.\nThe post Javier Milei Pub…",
    "link": "https://www.breitbart.com/latin-america/2025/06/13/javier-milei-publishes-photo-with-netanyahu-backs-israel-after-iran-attack/",
    "timestamp": "2025-06-13T20:56:33Z"
  },
  {
    "title": "'Vicious!' James Comer's committee probing Newsom and LA mayor over protests",
    "description": "House Oversight and Reform Committee Chairman James Comer (R-KY) said Friday his committee will investigate Gov. Gavin Newsom (D-CA) and Los Angeles Mayor Karen Bass (D). Comer penned a letter to the Justice Department saying that the protesters in LA \"commit…",
    "link": "https://www.rawstory.com/james-comer-los-angeles/",
    "timestamp": "2025-06-13T20:55:10Z"
  },
  {
    "title": "Former Blockchain exec joins SEC as director of trading and markets",
    "description": "The former global head of institutional markets for Blockchain.com and a partner at a Washington, DC-based law firm will be the latest additions to SEC staff.",
    "link": "https://cointelegraph.com/news/former-blockchain-exec-joins-sec",
    "timestamp": "2025-06-13T20:55:03Z"
  },
  {
    "title": "Former IDF intel chief lays out four scenarios for the Middle East",
    "description": "The collapse of Hezbollah, Hamas, and Assad presented an “opportunity” for Israel to expand its war across the Middle East.",
    "link": "https://www.defenseone.com/threats/2025/06/former-idf-intel-chief-lays-out-four-scenarios-middle-east/406077/",
    "timestamp": "2025-06-13T20:55:02Z"
  },
  {
    "title": "6 Months Later, DJI Says US Government Still Hasn’t Started Its Mandated Security Audit",
    "description": "In April, DJI urged the US government to start the mandated security audit of its business -- an audit congress ordered as part of a structured approach for evaluating the security concerns of Chinese-owned companies. Now half a year has passed and DJI says t…",
    "link": "https://petapixel.com/2025/06/13/6-months-later-dji-says-us-government-still-hasnt-started-its-mandated-security-audit/",
    "timestamp": "2025-06-13T20:53:42Z"
  },
  {
    "title": "From 'spectacle' to cash grab: Padilla's removal from DHS presser sparks DC firestorm, fundraising push",
    "description": "Sen. Alex Padilla's removal from DHS Secretary Kristi Noem's press L.A. press conference amid anti-ICE riots sparked outrage, with Padilla trying to cash in.",
    "link": "https://www.foxnews.com/politics/from-spectacle-cash-grab-padillas-removal-from-dhs-presser-sparks-dc-firestorm-fundraising-push",
    "timestamp": "2025-06-13T20:53:25Z"
  },
  {
    "title": "Lawmakers, media dinged for blaming Trump or ripping Israel on Iran: 'Think Kamala could've stopped them?'",
    "description": "Israel's bombing of Iranian targets ignites political clash as Democrats, Republicans, and media figures debate Netanyahu's actions and Trump's Middle East influence",
    "link": "https://www.foxnews.com/politics/lawmakers-media-dinged-blaming-trump-ripping-israel-iran",
    "timestamp": "2025-06-13T20:53:24Z"
  },
  {
    "title": "How much does the G7 benefit host communities in the long-term?",
    "description": "The summit could generate around $240 million for Alberta’s economy, according to the Calgary Chamber of Commerce, but hosting costs are massive and long-term impacts are difficult to calculate.",
    "link": "https://www.cbc.ca/news/canada/calgary/summit-g7-hosts-costs-benefits-1.7560934",
    "timestamp": "2025-06-13T20:52:56Z"
  },
  {
    "title": "Trump On Israel's Strikes On Iran: 'We Knew Everything'",
    "description": "Trump called the Israeli strikes \"excellent\" and \"very successful\" in a series of media interviews on Friday,",
    "link": "https://www.huffpost.com/entry/trump-israel-iran-strikes_n_684c8e56e4b068b4c7e836bf",
    "timestamp": "2025-06-13T20:51:02Z"
  },
  {
    "title": "Biden-appointed judge thwarts Trump's attempt to clean house at consumer safety agency",
    "description": "A federal judge in Maryland reinstated three fired Democratic CPSC members, ruling President Trump's terminations unlawful in contrast to recent Supreme Court decisions.",
    "link": "https://www.foxnews.com/politics/biden-appointed-judge-thwarts-trumps-attempt-clean-house-consumer-safety-agency",
    "timestamp": "2025-06-13T20:50:14Z"
  },
  {
    "title": "Mary Trump Issues 'Unnerving' Warning for US—'Darker and Darker Place'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nMary Trump, a vocal critic and estranged niece of President Donald Trump, warned in a Thursday video that the country is getting to a \"darker and darker place,\" at an \"unnerving\" pace.\nNewsweek has reached out…",
    "link": "https://biztoc.com/x/062da2d6cfe5ef0b",
    "timestamp": "2025-06-13T20:50:07Z"
  },
  {
    "title": "How to Navigate the Tariff Circus",
    "description": "Quite accidentally, it looks like we timed our last talk about the stock market pretty darned well. Back in February 2025, the market put the perfect cap on a multi year climb before stepping onto the wild roller coaster we’re currently riding. Since then it …",
    "link": "https://www.mrmoneymustache.com/2025/06/13/tariffs-and-the-economy/",
    "timestamp": "2025-06-13T20:47:59Z"
  },
  {
    "title": "Iran launches strikes following attacks from Israel",
    "description": "New Revolutionary Guards’ chief warns Tehran would open ‘gates of hell … upon this child-killing regime’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/13/iran-launches-strikes-following-attacks-from-israel/",
    "timestamp": "2025-06-13T20:47:46Z"
  },
  {
    "title": "Starmer and Trump call for ‘diplomacy and dialogue’ as Iran retaliates",
    "description": "The two leaders spoke on Friday evening, as western nations began a diplomatic flurry to calm the burgeoning conflict",
    "link": "https://www.jewishnews.co.uk/starmer-and-trump-call-for-diplomacy-and-dialogue-as-iran-retaliates/",
    "timestamp": "2025-06-13T20:47:44Z"
  },
  {
    "title": "Christian leaders react to Israel's attack on Iran",
    "description": "\"This is a very serious matter, and Bible students should be paying close attention.\"",
    "link": "https://www.christianpost.com/news/christian-leaders-react-to-israel-airstrikes-on-iran.html",
    "timestamp": "2025-06-13T20:47:00Z"
  },
  {
    "title": "4 detainees escaped from a Newark ICE detention facility after advocates say poor conditions led to ‘chaos’ | CNN",
    "description": "Four detainees have escaped from a federal immigration detention center in New Jersey, which has been the center of protests since its opening in May and where both a sitting congresswoman and Newark’s mayor have been arrested.",
    "link": "https://www.cnn.com/2025/06/13/us/newark-migrant-detention-center-escape",
    "timestamp": "2025-06-13T20:45:54Z"
  },
  {
    "title": "Japan condemns Israel's attack on Iran for escalating situation",
    "description": "Japanese Prime Minister Shigeru Ishiba on Friday condemned Israel's attack on Iranian nuclear and military targets, while vowing to work with other Group of Seven members to ease tensions in the Middle East. Ishiba told reporters that Israel's move was &quot;…",
    "link": "https://japantoday.com/category/politics/update2-japan-condemns-israel%27s-attack-on-iran-for-escalating-situation",
    "timestamp": "2025-06-13T20:45:48Z"
  },
  {
    "title": "Judge blocks Trump’s election executive order, siding with Democrats who called it overreach",
    "description": "A federal judge on Friday blocked President Donald Trump’s attempt to overhaul elections in the U.S., siding with a group of Democratic state attorneys general who challenged the effort as unconstitutional. The Republican president’s March 25 executive order …",
    "link": "https://japantoday.com/category/world/judge-blocks-trump%E2%80%99s-election-executive-order-siding-with-democrats-who-called-it-overreach",
    "timestamp": "2025-06-13T20:45:30Z"
  },
  {
    "title": "Ishiba, Trump to meet on G7 sidelines",
    "description": "Japanese Prime Minister Shigeru Ishiba said Friday that he agreed with U.S. President Donald Trump to meet in Canada on the sidelines of the Group of Seven summit next week. Ahead of another round of ministerial-level tariff talks in the United States, Ishiba…",
    "link": "https://japantoday.com/category/politics/update3-ishiba-trump-to-meet-on-g7-fringes-japan-pm",
    "timestamp": "2025-06-13T20:45:10Z"
  },
  {
    "title": "How crucial is immigration for U.S. hotel industry?",
    "description": "A U.S. crackdown on foreign-born workers could spell trouble for the hotel and hospitality industry, which has lobbied for years to expand the pathways for immigration to the United States to help fill over 1 million job vacancies. U.S. President Donald Trump…",
    "link": "https://japantoday.com/category/business/how-crucial-is-immigration-for-the-us-hotel-industry2",
    "timestamp": "2025-06-13T20:44:06Z"
  },
  {
    "title": "Mary Trump Issues 'Unnerving' Warning for US—'Darker and Darker Place'",
    "description": "Mary Trump, the estranged niece and vocal critic of Donald Trump, said we are quickly slipping into a \"darker place\" under the Trump administration.",
    "link": "https://www.newsweek.com/mary-trump-issues-unnerving-warning-usdarker-darker-place-2085396",
    "timestamp": "2025-06-13T20:41:10Z"
  },
  {
    "title": "Has the U.S. ever had a military parade? Yes, but they're rare.",
    "description": "The U.S. has held events like President Trump's military parade throughout history, but they're uncommon.",
    "link": "https://www.cbsnews.com/news/trump-military-parade-history-rare-last-military-parade/",
    "timestamp": "2025-06-13T20:40:51Z"
  },
  {
    "title": "Fetterman Spent His Wedding Anniversary at Popular MAGA Spot Without His Wife: Report",
    "description": "A famous Democratic couple’s marriage is under intense scrutiny after reports surfaced of what happened on their most recent wedding anniversary.\nThe post Fetterman Spent His Wedding Anniversary at Popular MAGA Spot Without His Wife: Report appeared first on …",
    "link": "https://www.thegatewaypundit.com/2025/06/fetterman-spent-wedding-anniversary-popular-maga-spot-without/",
    "timestamp": "2025-06-13T20:40:44Z"
  },
  {
    "title": "U.S. says it will keep detaining pro-Palestinian activist Khalil",
    "description": "The U.S. government said on Friday pro-Palestinian activist Mahmoud Khalil would remain in detention after a U.S. judge ruled foreign policy interests could not be used to justify confinement of the Columbia University student and pro-Palestinian activist. Kh…",
    "link": "https://japantoday.com/category/world/us-says-it-will-keep-detaining-pro-palestinian-activist-khalil1",
    "timestamp": "2025-06-13T20:40:42Z"
  },
  {
    "title": "Here’s what to expect at the Army’s 250th anniversary parade on Trump’s birthday",
    "description": "The tanks are staged and ready to roll. Fencing and barriers are up. Protective metal plating has been laid out on Washington's streets.  And more than 6,000 troops are poised to march near the National Mall to honor the Army’s 250th anniversary on Saturday, …",
    "link": "https://japantoday.com/category/world/here%E2%80%99s-what-to-expect-at-the-army%E2%80%99s-250th-anniversary-parade-on-trump%E2%80%99s-birthday",
    "timestamp": "2025-06-13T20:40:33Z"
  },
  {
    "title": "How Israel's Spy Agency Rocked Iran With a Covert Drone Operation",
    "description": "Israel’s Mossad quietly laid the groundwork for the country’s massive military campaign against Iran by building a \"secret explosive drone base\" near Tehran that destroyed a bevy of ballistic missile launchers, preventing Tehran from quickly retaliating again…",
    "link": "https://freebeacon.com/israel/how-israels-spy-agency-rocked-iran-with-a-covert-drone-operation/",
    "timestamp": "2025-06-13T20:40:26Z"
  },
  {
    "title": "U.S. Marines deployed to LA in rare move as more protests expected",
    "description": "U.S. Marines were deployed to Los Angeles on Friday, the military said, in a rare domestic use of its forces after days of protests over immigration raids and as nationwide demonstrations were expected on Saturday, in the biggest backlash since President Dona…",
    "link": "https://japantoday.com/category/world/us-marines-deployed-to-la-in-rare-move-as-more-protests-expected",
    "timestamp": "2025-06-13T20:40:25Z"
  },
  {
    "title": "Israel attack on Iran tests Trump promise not to be dragged into war",
    "description": "For President Donald Trump, few goals on the world stage have been more explicit -- he will not drag the United States into another &quot;forever war.&quot; Yet Israel's massive strikes on Iran will test that promise as never before, potentially setting up a …",
    "link": "https://japantoday.com/category/world/israel-attack-on-iran-tests-trump-promise-not-to-be-dragged-into-war",
    "timestamp": "2025-06-13T20:40:18Z"
  },
  {
    "title": "Iran fires missiles at Israel in response to attacks",
    "description": "Explosions were heard over Tel Aviv and Jerusalem as sirens sounded on Friday night across Israel following what the country's military spokesman said was the firing of missiles from Iran. Iran's state news agency IRNA said hundreds of ballistic missiles had …",
    "link": "https://japantoday.com/category/world/iran-fires-missiles-at-israel-in-response-to-attacks",
    "timestamp": "2025-06-13T20:40:02Z"
  },
  {
    "title": "Canada to join major European rearmament deal as early as June 23: sources",
    "description": "Prime Minister Mark Carney plans on joining a sweeping European plan in Belgium this month to rearm the continent and provide more military aid to Ukraine, CBC News has learned.",
    "link": "https://www.cbc.ca/news/politics/canada-signing-onto-european-rearment-deal-eu-canada-summit-1.7560891",
    "timestamp": "2025-06-13T20:39:16Z"
  },
  {
    "title": "Will Trump Send the National Guard to Other Cities? Administration Says It’s On the Table",
    "description": "President Donald Trump's deployment of the National Guard to L.A. will be “the first, perhaps, of many,” he told reporters this week.",
    "link": "https://time.com/7294100/trump-national-guard-immigration-protests/",
    "timestamp": "2025-06-13T20:38:59Z"
  },
  {
    "title": "Airline Safety: A 2025 Gut Check",
    "description": "Flying is still safe, but high-profile incidents and more frequent close calls are leading to more anxiety from travelers.",
    "link": "http://skift.com/2025/06/13/airline-safety-a-2025-gut-check/",
    "timestamp": "2025-06-13T20:38:33Z"
  },
  {
    "title": "Trump Urged Ergen, Carr to Cut a Deal on EchoStar Spectrum",
    "description": "President Donald Trump has intervened to push EchoStar Corp. and Federal Communications Commission Chairman Brendan Carr to resolve a dispute over the satellite communications company’s valuable spectrum licenses.",
    "link": "https://www.livemint.com/companies/news/trump-urged-ergen-carr-to-cut-a-deal-on-echostar-spectrum-11749847013229.html",
    "timestamp": "2025-06-13T20:36:52Z"
  },
  {
    "title": "Trump tells the truth on Truth Social for once. But that won't fix his betrayal of farmers.",
    "description": "Trump's recent Truth Social post hints at his knowledge that his aggressive mass deportation plan and ICE raids have been hurting American farmers.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-ice-raids-deportations-farmers-truth-social-rcna212865",
    "timestamp": "2025-06-13T20:36:45Z"
  },
  {
    "title": "What to Know About ‘No Kings Day’",
    "description": "Americans from more than 2,000 cities and towns will counterprotest Donald Trump’s military parade. Here, an organizer explains how No Kings Day will defy the president’s agenda.",
    "link": "http://www.thecut.com/article/no-kings-day-protests-what-to-know.html",
    "timestamp": "2025-06-13T20:36:17Z"
  },
  {
    "title": "Trump Says No More Windmills, Calls Them 'Bullsh*t' and a Blight on Our 'Beautiful Plains'",
    "description": "President Donald Trump said this week his administration would not approve any more development of wind energy except in cases of emergency.\nThe post Trump Says No More Windmills, Calls Them ‘Bullsh*t’ and a Blight on Our ‘Beautiful Plains’ appeared first on …",
    "link": "https://www.breitbart.com/environment/2025/06/13/trump-says-no-more-windmills-calls-them-bullsht-and-a-blight-on-our-beautiful-plains/",
    "timestamp": "2025-06-13T20:33:25Z"
  },
  {
    "title": "Behind Florida’s Sheriff’s ‘We Will Kill You’ to Anti-Trump Protesters",
    "description": "With Sheriff Ivey basically giving the green light for violence against Americans using their First Amendment right, Black folks took it all in.\nThe post Behind Florida’s Sheriff’s ‘We Will Kill You’ to Anti-Trump Protesters appeared first on The Root.",
    "link": "https://www.theroot.com/behind-floridas-sheriffs-we-will-kill-you-to-anti-trump-2000045495",
    "timestamp": "2025-06-13T20:32:52Z"
  },
  {
    "title": "Barred from military, transgender Navy pilot reflects on 'patriotism' ahead of parade",
    "description": "Ahead of President Trump's military parade, a transgender service member who was barred from the military, reflects on \"patriotism\" and her fight against the ban.",
    "link": "https://abcnews.go.com/US/transgender-navy-pilot-barred-service-reflects-patriotism-ahead/story?id=122777463",
    "timestamp": "2025-06-13T20:32:13Z"
  },
  {
    "title": "Livestream: Iran strikes back after Israeli attack",
    "description": "We speak to University of Tehran professor Mohammed Marandi about why Tel Aviv struck his country and what may come next.",
    "link": "https://electronicintifada.net/blogs/ali-abunimah/livestream-iran-strikes-back-after-israeli-attack",
    "timestamp": "2025-06-13T20:32:06Z"
  },
  {
    "title": "Trump Supporter Super Sadz When ICE Detains A Third Of His Staff",
    "description": "A Trump supporting businessman from Florida is entering the Find Out Phase of FAFO after one third of his employees were arrested by ICE! The man hired undocumented immigrants AND STILL voted for Donald Trump.\nThe Daily Beast is reporting that Vincent Scardin…",
    "link": "https://crooksandliars.com/2025/06/trump-supporter-super-sadz-when-ice",
    "timestamp": "2025-06-13T20:30:55Z"
  },
  {
    "title": "WWE women's champion Tiffany Stratton goes viral after first pitch at Mets game goes horribly wrong",
    "description": "WWE women's champion Tiffany Stratton sailed her ceremonial first pitch at Thursday's New York Mets game, garnering traction on social media.",
    "link": "https://www.foxnews.com/sports/wwe-womens-champion-tiffany-stratton-goes-viral-first-pitch-mets-game-horribly-wrong",
    "timestamp": "2025-06-13T20:30:24Z"
  },
  {
    "title": "Randi Weingarten’s ‘No Kings’ push shows teachers union is prioritizing activism over education: source",
    "description": "Roughly 1,500 rallies are expected to disrupt hundreds of cities in all fifty states on Saturday.",
    "link": "https://nypost.com/2025/06/13/us-news/randi-weingartens-no-kings-push-prioritizes-activism-over-education-source/",
    "timestamp": "2025-06-13T20:30:10Z"
  },
  {
    "title": "Have Presidents Grown Too Powerful To Be Removed From Office?",
    "description": "Joe Biden showed that the 25th Amendment doesn't work. Donald Trump showed that impeachment is broken too.",
    "link": "https://reason.com/2025/06/14/have-presidents-grown-too-powerful-to-be-removed-from-office/",
    "timestamp": "2025-06-13T20:28:43Z"
  },
  {
    "title": "Oil Spikes as Israel's Attacks on Iran Stoke Fears of Wider War",
    "description": "Oil surged the most in more than three years after Israel carried out airstrikes against Iran.",
    "link": "https://www.rigzone.com/news/wire/oil_spikes_as_israels_attacks_on_iran_stoke_fears_of_wider_war-13-jun-2025-180845-article/",
    "timestamp": "2025-06-13T20:28:26Z"
  },
  {
    "title": "How Netanyahu's inner circle hid Israel's attack on Iran",
    "description": "Israel attempted to confuse the Iranians about the timing of the attack, but given the American warnings to embassies and the fact that a 'friendly country' warned Iran, it's still too early to know how surprised Tehran truly was",
    "link": "https://www.haaretz.com/israel-news/2025-06-13/ty-article/how-netanyahus-inner-circle-hid-israels-attack-on-iran/00000197-699d-d34b-ad97-f9fd83800000",
    "timestamp": "2025-06-13T20:28:20Z"
  },
  {
    "title": "Cops sue over government’s failure to honor officers present at J6 protest",
    "description": "Congress adopted law to put up plaque memorializing police work",
    "link": "https://www.wnd.com/2025/06/cops-sue-over-governments-failure-to-honor-officers-present-at-j6-protest/",
    "timestamp": "2025-06-13T20:27:25Z"
  },
  {
    "title": "Here are the ‘No Kings’ protests planned across Connecticut this weekend",
    "description": "Over 30 demonstrations, coined “No Kings” protests, are set to take place across Connecticut this Saturday. Opponents of President Donald…",
    "link": "https://www.nbcconnecticut.com/news/local/no-kings-protests-planned-across-connecticut/3585998/",
    "timestamp": "2025-06-13T20:26:18Z"
  },
  {
    "title": "Yes, U.S. Army secretary said there is a soldier stationed on the moon. (There isn't)",
    "description": "U.S. Secretary of the Army Daniel Driscoll said: \"We talked to an astronaut yesterday who's on the moon, who's a soldier.\"",
    "link": "https://www.snopes.com//fact-check/soldier-on-moon-army/",
    "timestamp": "2025-06-13T20:26:00Z"
  },
  {
    "title": "US judge orders Trump to reinstate fired product safety commissioners",
    "description": "(Reuters) -A federal judge on Friday ruled that the Trump administration unlawfully removed three Democratic members of the U.S. Consumer Product Safety...",
    "link": "https://www.yahoo.com/news/us-judge-orders-trump-reinstate-202247032.html",
    "timestamp": "2025-06-13T20:22:47Z"
  },
  {
    "title": "‘It’s Bullsh*t’: Liberals Seethe At Diversity Debunking Study",
    "description": "'Democrats (more than Republicans) tightly centre their belief-system around a set of positions at the extremes,' a study found",
    "link": "https://dailycaller.com/2025/06/13/liberals-conservatives-study-belief-radical-diversity-attitudes/",
    "timestamp": "2025-06-13T20:21:04Z"
  },
  {
    "title": "Mamdani and Lander endorse each other in NYC mayor’s race",
    "description": "Brad Lander and Zohran Mamdani are cross-endorsing each other in the ranked-choice primary for mayor.\n \n\nThe move comes a day after the assemblymember and comptroller hammered Andrew Cuomo on the debate stage. [ more › ]",
    "link": "https://gothamist.com/news/mamdani-and-lander-endorse-each-other-in-nyc-mayors-race",
    "timestamp": "2025-06-13T20:20:00Z"
  }
]