[
  {
    "title": "Thousands of protesters rally against Trump across US, including over arming Israel, Gaza concerns",
    "description": "Outside the White House, protesters carried banners that read \"Workers should have the power,\" \"No kingship,\" \"Stop arming Israel\" and \"Due process,\" media footage showed.",
    "link": "https://www.jpost.com/breaking-news/article-850716",
    "timestamp": "2025-04-19T20:51:59Z"
  },
  {
    "title": "Netanyahu insists Israel will not allow Iran to acquire nuclear weapons: office",
    "description": "Jerusalem (AFP) April 17, 2025 -\n Israeli Prime Minister Benjamin Netanyahu insisted on Thursday that Israel would not allow Iran to acquire nuclear weapons, even as US President Donald Trump attempts to negotiate a new nuclear deal with Tehran.\n\nNetanyahu's …",
    "link": "https://www.spacewar.com/reports/Netanyahu_insists_Israel_will_not_allow_Iran_to_acquire_nuclear_weapons_office_999.html",
    "timestamp": "2025-04-19T20:48:42Z"
  },
  {
    "title": "Ukraine ready to buy 'at least' 10 Patriot systems from US: Zelensky",
    "description": "Kyiv, Ukraine (AFP) April 17, 2025 -\n Ukraine wants to buy at least 10 Patriot missile defence systems from the United States to shield against Russian attacks, President Volodymyr Zelensky said Thursday.\n\nThe Ukrainian leader said he had made a request to US…",
    "link": "https://www.spacewar.com/reports/Ukraine_ready_to_buy_at_least_10_Patriot_systems_from_US_Zelensky_999.html",
    "timestamp": "2025-04-19T20:48:40Z"
  },
  {
    "title": "Analysts warn US could be handing chip market to China",
    "description": "San Francisco (AFP) April 20, 2025 -\n\n As the Trump administration attempts to choke off exports of strategically important computer chips to China, experts say the effort might well backfire, fueling innovation at Chinese firms that could help them seize the…",
    "link": "https://www.spacedaily.com/reports/Analysts_warn_US_could_be_handing_chip_market_to_China_999.html",
    "timestamp": "2025-04-19T20:47:19Z"
  },
  {
    "title": "Nvidia CEO in Beijing as US tech curbs, trade war threaten sales",
    "description": "Beijing (AFP) April 17, 2025 -\n\n Nvidia CEO Jensen Huang held talks with Chinese leaders in Beijing on Thursday, state media said, days after the United States curbed sales of its H20 artificial intelligence chips to China.\n\nNvidia this week said it expected …",
    "link": "https://www.spacedaily.com/reports/Nvidia_CEO_in_Beijing_as_US_tech_curbs_trade_war_threaten_sales_999.html",
    "timestamp": "2025-04-19T20:47:19Z"
  },
  {
    "title": "AMD says US rule on chips to China could cost it $800 mn",
    "description": "San Francisco (AFP) April 16, 2025 -\n\n Chip developer Advanced Micro Devices (AMD) on Wednesday said it expects new US licensing requirements for semiconductors exported to China to cost it as much as $800 million.\n\nThe Silicon Valley company's earnings warni…",
    "link": "https://www.spacedaily.com/reports/AMD_says_US_rule_on_chips_to_China_could_cost_it_800_mn_999.html",
    "timestamp": "2025-04-19T20:47:19Z"
  },
  {
    "title": "Hamas armed wing says fate of US-Israeli captive unknown",
    "description": "GAZA CITY (PALESTINIAN TERRITORIES) - The fate of a US-Israeli hostage who Hamas said had featured in an Israeli truce proposal remains unknown, the group said on Saturday, separately releasing a video of another captive alive.",
    "link": "https://www.bangkokpost.com/world/3006867/hamas-armed-wing-says-fate-of-us-israeli-captive-unknown",
    "timestamp": "2025-04-19T20:45:00Z"
  },
  {
    "title": "Report: Israel not ruling out limited strike on Iran",
    "description": "Despite US President Donald Trump's refusal to support such an act, Israel has not tabled the option of conducting a limited strike on Iran's nuclear facilities.",
    "link": "https://www.israelnationalnews.com/news/407066",
    "timestamp": "2025-04-19T20:44:00Z"
  },
  {
    "title": "Harvard says Trump admin. is doubling down on demands after sending letter",
    "description": "The Trump administration \"appears to have doubled down on those demands through its deeds in recent days,\" a Harvard spokesperson said.",
    "link": "https://www.jpost.com/breaking-news/article-850713",
    "timestamp": "2025-04-19T20:33:41Z"
  },
  {
    "title": "Hamas Armed Wing Says Fate Of US-Israeli Captive Unknown",
    "description": "The fate of a US-Israeli hostage who Hamas said had featured in an Israeli truce proposal remains unknown, the group said on Saturday, separately releasing a video of another captive alive.",
    "link": "https://www.ibtimes.com/hamas-armed-wing-says-fate-us-israeli-captive-unknown-3770676",
    "timestamp": "2025-04-19T20:27:10Z"
  },
  {
    "title": "Hamas Armed Wing Says Fate Of US-Israeli Captive Unknown",
    "description": "The fate of a US-Israeli hostage who Hamas said had featured in an Israeli truce proposal remains unknown, the group said on Saturday, separately releasing a video of another captive alive.",
    "link": "https://www.ibtimes.com.au/hamas-armed-wing-says-fate-us-israeli-captive-unknown-1858039",
    "timestamp": "2025-04-19T20:27:08Z"
  },
  {
    "title": "‘Next in Line’: Dem Rep. Agrees with MSNBC Host That Trump Will ‘Whisk Away’ Any ‘People of Color’ After Abrego Garcia",
    "description": "The Maryland Representative agreed with the MSNBC host that all people of color across America will be \"next in line\" after Kilmar Abrego Garcia.\nThe post ‘Next in Line’: Dem Rep. Agrees with MSNBC Host That Trump Will ‘Whisk Away’ Any ‘People of Color’ After…",
    "link": "https://www.mediaite.com/tv/next-in-line-dem-rep-agrees-with-msnbc-host-that-trump-will-whisk-away-any-people-of-color-after-abrego-garcia/",
    "timestamp": "2025-04-19T20:25:31Z"
  },
  {
    "title": "First Shockwaves of Trump’s Tariffs Are About to Hit the World Economy",
    "description": "Three weeks after US President Donald Trump effectively declared a trade war with the whole world, new economic forecasts and surveys will point to the initial fallout.",
    "link": "https://financialpost.com/pmn/business-pmn/first-shockwaves-of-trumps-tariffs-are-about-to-hit-the-world-economy",
    "timestamp": "2025-04-19T20:21:53Z"
  },
  {
    "title": "Canada’s PM Carney plans for stronger defence, broader trade amid US rift",
    "description": "In campaign platform, Carney plans to invest in the military and infrastructure while still cutting spending.",
    "link": "https://www.aljazeera.com/news/2025/4/19/canadas-pm-carney-plans-for-stronger-defence-broader-trade-amid-us",
    "timestamp": "2025-04-19T20:19:42Z"
  },
  {
    "title": "Trump May 'Take a Pass' on Russia-Ukraine Peace Talks Without Progress",
    "description": "President Donald Trump has signaled a potential end to efforts in mediating peace between Russia and Ukraine, stating that the U.S. may “take a pass” on further negotiations if either side proves unwilling to compromise.\nBBC reports that Trump emphasized urge…",
    "link": "https://biztoc.com/x/5ed8210122114e93",
    "timestamp": "2025-04-19T20:17:54Z"
  },
  {
    "title": "Trump administration plans to send envoy to Russia again – CNN",
    "description": "Steve Witkoff, who has met with Putin three times this year, will reportedly seek to get Moscow to agree to a Ukraine peace framework Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616006-cnn-witkoff-another-meeting-russians-ukraine-peace/",
    "timestamp": "2025-04-19T20:17:24Z"
  },
  {
    "title": "Another round of anti-Trump protests hits US cities",
    "description": "Thousands of protesters marched Saturday in New York and other cities across the United States for a second major round of demonstrations against Donald...",
    "link": "https://www.yahoo.com/news/another-round-anti-trump-protests-201536757.html",
    "timestamp": "2025-04-19T20:15:36Z"
  },
  {
    "title": "Anti-Trump protesters turn out to rallies in New York, Washington and other cities across country",
    "description": "NEW YORK (AP) — Opponents of President Donald Trump’s administration took to the streets of communities large and small across the U.S. on Saturday, decrying what they see as threats to the nation’s democratic ideals. The disparate events ranged from a march …",
    "link": "https://freerepublic.com/focus/f-news/4312032/posts",
    "timestamp": "2025-04-19T20:13:34Z"
  },
  {
    "title": "Vermont maple syrup makers face uncertainty in tariff chaos",
    "description": "Multiple countries contribute to each container of the sticky sweetener, with the vast majority of equipment sold by Canada.",
    "link": "https://billingsgazette.com/news/nation-world/business/article_fdf0ecb6-d950-5b9f-bc20-e963764aef67.html",
    "timestamp": "2025-04-19T20:11:49Z"
  },
  {
    "title": "Hochul, MTA set to blow off Trump April 20 deadline to kill congestion tolls",
    "description": "Gov. Kathy Hochul is set to blow through another federal deadline meant to halt the $9 congestion toll to enter parts of Manhattan, as NYC Mayor Eric Adams' administration backed her in a lawsuit to keep the controversial scheme alive.",
    "link": "https://nypost.com/2025/04/19/us-news/hochul-mta-set-to-blow-off-trump-deadline-to-kill-congestion-tolls/",
    "timestamp": "2025-04-19T20:11:04Z"
  },
  {
    "title": "250 years after the start of the American Revolution, a divided nation battles over its legacy",
    "description": "Thousands of people came to Lexington, Massachusetts, just before dawn on Saturday to witness a reenactment of how the American Revolution began 250 years ago, as the country looks back to its war of independence and asks where its legacy stands today.",
    "link": "https://www.pbs.org/newshour/nation/250-years-after-the-start-of-the-american-revolution-a-divided-nation-battles-over-its-legacy",
    "timestamp": "2025-04-19T20:08:14Z"
  },
  {
    "title": "'It's Offensive And Just Plain Wrong'—Trump's Budget Proposal To Eliminate Head Start, Affecting Over 1 Million Parents",
    "description": "President Donald Trump is reportedly planning to eliminate all federal funding for Head Start in his 2026 budget proposal, putting a program that has served nearly 40 million children since 1965 at serious risk.\nAccording to USA Today, which cites a governmen…",
    "link": "https://biztoc.com/x/b8e431208ce86881",
    "timestamp": "2025-04-19T20:07:07Z"
  },
  {
    "title": "Has DOGE Gone Underground?",
    "description": "It’s tax day in the US, and the Internal Revenue Service is reeling from more potential firings courtesy of Donald Trump, Elon Musk and their “Department of Government Efficiency” or “DOGE.” \nBut DOGE headlines seem to have abated of late. What does it mean? …",
    "link": "https://biztoc.com/x/835bd3ca8214d86f",
    "timestamp": "2025-04-19T20:07:03Z"
  },
  {
    "title": "Ex-Warriors Part-Owner Sounds Off on Steve Kerr’s Harvard Support Take",
    "description": "On Tuesday night, Kerr supported the Ivy League university that is currently a target of President Donald Trump, among other universities, for several reasons, including its process for enrolling international students, anti-semitism on campus and its tax-exe…",
    "link": "https://freerepublic.com/focus/f-news/4312031/posts",
    "timestamp": "2025-04-19T20:06:53Z"
  },
  {
    "title": "Trump Administration Halts New York Offshore Wind Project",
    "description": "THE CENTER SQUARE—The Donald Trump administration has halted a massive New York offshore wind project as it conducts a financial and regulatory review of plans... Read More\nThe post Trump Administration Halts New York Offshore Wind Project appeared first on T…",
    "link": "https://www.dailysignal.com/2025/04/19/trump-administration-halts-new-york-offshore-wind-project/",
    "timestamp": "2025-04-19T20:00:00Z"
  },
  {
    "title": "TEXAS: Why the GOP is nervous about Ken Paxton's Senate run",
    "description": "Sen. John Cornyn has long been a reliable conservative in Congress. But that may not be enough to get the Texas Republican reelected... The Cornyn-Paxton primary fight is a \"proxy war\" in the GOP, said Axios. \"Top MAGA luminaries\" are skeptical of Cornyn beca…",
    "link": "https://freerepublic.com/focus/f-chat/4312029/posts",
    "timestamp": "2025-04-19T19:56:12Z"
  },
  {
    "title": "Photos Show Massive '50501' Anti-Trump Protests Across the Country",
    "description": "Nationwide anti-Trump protests today aim to unite millions across all 50 states against recent presidential policies.",
    "link": "https://www.newsweek.com/photos-show-massive-50501-anti-ttrump-protests-across-country-2061783",
    "timestamp": "2025-04-19T19:53:03Z"
  },
  {
    "title": "Sen. Chris Van Hollen slams efforts to stage optics of meeting with Abrego Garcia",
    "description": "Maryland Sen. Chris Van Hollen took the president and government of El Salvador to task for what he said was a setup to shame him and Kilmar Abrego Garcia.",
    "link": "https://abcnews.go.com/Politics/margarita-gate-sen-chris-van-hollen-slams-efforts/story?id=120975361",
    "timestamp": "2025-04-19T19:48:12Z"
  },
  {
    "title": "Hundreds gather in midtown Atlanta to protest presidential policies",
    "description": "Hundreds gather in midtown Atlanta to protest presidential policieswsbtv.com",
    "link": "https://www.wsbtv.com/news/local/atlanta/hundreds-gather-midtown-atlanta-protest-presidential-policies/KEY3REBHPJAVPBVSFNGXIYAKC4/",
    "timestamp": "2025-04-19T19:45:29Z"
  },
  {
    "title": "Anti-Trump protesters turn out at Richmond 'Freedom Rising' rally",
    "description": "Protests against President Donald Trump’s administration are once again taking place in communities across the U.S., including Richmond, Virginia.",
    "link": "https://www.wtvr.com/news/local-news/anti-trump-protesters-50501-nationwide-rallies-april-19-2025",
    "timestamp": "2025-04-19T19:45:18Z"
  },
  {
    "title": "Charles Schwab CEO eyes spot Bitcoin trading by April 2026",
    "description": "Charles Schwab Corp CEO Rick Wurster is reportedly eyeing an April 2026 launch window to provide spot Bitcoin (BTC) trading services to Schwab clients.According to RIABiz, Wurster cited a 400% increase in traffic to Schwab's crypto website as evidence of inve…",
    "link": "https://cointelegraph.com/news/charles-schwab-eyes-spot-bitcoin-trading-2026",
    "timestamp": "2025-04-19T19:45:13Z"
  },
  {
    "title": "Brooklyn Tesla Vandalism Suspect Is a Licensed Mental Health Therapist - NewsBreak",
    "description": "As a licensed counselor and therapist helping to keep criminal offenders out of prison, a Brooklyn woman accused of trashing a parked Tesla may need some o",
    "link": "https://www.newsbreak.com/share/3970037965846-brooklyn-tesla-vandalism-suspect-is-a-licensed-mental-health-therapist?s=a2&share_destination_id=MjgwOTY2NjQ1LTE3NDUwOTE4MjA4NDc%3D&pd=0J0uG5tT&hl=en_US&send_time=1745091820&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.33.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q2-v1%2Cns_foryou_blend_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v3%2Cns_local_strategy_25q1_exp-v6",
    "timestamp": "2025-04-19T19:44:14Z"
  },
  {
    "title": "Ex-Warriors part-owner sounds off on Steve Kerr’s Harvard support take",
    "description": "Former Golden State Warriors part-owner Chamath Palihapitiya sounded off on Steve Kerr in a scathing post Friday.",
    "link": "https://nypost.com/2025/04/19/sports/ex-warriors-part-owner-sounds-off-on-steve-kerrs-support-for-harvard/",
    "timestamp": "2025-04-19T19:38:11Z"
  },
  {
    "title": "Harvey Weinstein’s Last Stand",
    "description": "The former Hollywood mogul's legal team is betting that the current climate around #MeToo will play in their client's favor this time around, or at the very least, not against him.Joe Rogan was eating an elk steak while watching the first installment of Canda…",
    "link": "https://freerepublic.com/focus/f-bloggers/4312024/posts",
    "timestamp": "2025-04-19T19:36:39Z"
  },
  {
    "title": "Harvey Weinstein’s Last Stand",
    "description": "The former Hollywood mogul's legal team is betting that the current climate around #MeToo will play in their client's favor this time around, or at the very least, not against him.Joe Rogan was eating an elk steak while watching the first installment of Canda…",
    "link": "https://freerepublic.com/focus/f-news/4312024/posts",
    "timestamp": "2025-04-19T19:36:39Z"
  },
  {
    "title": "Trump’s base backs his trade war. But even MAGA wants a resolution ‘sooner rather than later. - Politico",
    "description": "Trump’s base backs his trade war. But even MAGA wants a resolution ‘sooner rather than later.Politico Why Trump’s supporters trust him on tariffs — for nowThe Hill The pain of doing business under TrumpFinancial Times Donald Trump Supporters Are Losing Their …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177067491",
    "timestamp": "2025-04-19T19:32:36Z"
  },
  {
    "title": "Elon Musk suffers 'setbacks' while 'unnerving even some veteran Trump officials': NYT",
    "description": "The richest man in the world has suffered a \"series of setbacks\" while embracing a fringe MAGA figure whose growing influence has \"unnerved even some veteran\" members of Donald Trump's administration, a new report states.Elon Musk enjoyed a smooth early ride …",
    "link": "https://www.rawstory.com/trump-musk-loomer-setbacks-unnerved/",
    "timestamp": "2025-04-19T19:31:17Z"
  },
  {
    "title": "Anti-Trump Protesters Mobilize for Hundreds of Events via 50501 Movement",
    "description": "Protesters gathered for more than 750 events across the U.S. in opposition to Trump on Saturday.",
    "link": "http://www.rollingstone.com/politics/politics-news/anti-trump-protests-50501-movement-1235321442/",
    "timestamp": "2025-04-19T19:25:44Z"
  },
  {
    "title": "Island dripping with GOLD could be Trump's next win if he seizes chance for 'deal of the century'",
    "description": "President Donald Trump's love of gold has extended from the inside of Trump Tower to the decor of the White House... to a new island in the Pacific? The president has been offered the island of Bougainville — complete with its large gold mine — as the 'deal o…",
    "link": "https://freerepublic.com/focus/f-news/4312021/posts",
    "timestamp": "2025-04-19T19:23:52Z"
  },
  {
    "title": "Dolly Parton fans petitioning to rename Nashville Airport in her honor after bill to name it after Trump fails",
    "description": "Fans of Dolly Parton are petitioning to have Nashville International Airport renamed in her honor -- after a bill to name it after President Trump failed to pass.",
    "link": "https://nypost.com/2025/04/19/us-news/dolly-parton-fans-petitioning-to-rename-nashville-airport-in-her-honor/",
    "timestamp": "2025-04-19T19:21:51Z"
  },
  {
    "title": "Russia and Ukraine swap hundreds of prisoners of war as Putin announces Easter ceasefire",
    "description": "Russian President Vladimir Putin announced a temporary Easter ceasefire in Ukraine starting Saturday, citing humanitarian reasons, as Russia and Ukraine swapped hundreds of captured soldiers in the largest exchange since Moscow's full-scale invasion started o…",
    "link": "https://www.pbs.org/newshour/world/russia-and-ukraine-swap-hundreds-of-prisoners-of-war-as-putin-announces-easter-ceasefire",
    "timestamp": "2025-04-19T19:21:28Z"
  },
  {
    "title": "Trump’s courage in the face of establishment cowardice",
    "description": "In Butler, Pennsylvania, 'he gave the final proof that he's more than a tough talker'",
    "link": "https://www.wnd.com/2025/04/trumps-courage-in-the-face-of-establishment-cowardice/",
    "timestamp": "2025-04-19T19:17:50Z"
  },
  {
    "title": "Seattle police officers file to protect anonymity in Jan 6. Trump rally case",
    "description": "Four current and former Seattle police officers are seeking intervention from the U.S. Supreme Court to prevent the release of their identities in connection wi",
    "link": "https://komonews.com/news/local/seattle-police-officers-file-to-protect-anonymity-in-jan-6-trump-rally-case-musk-insurrection-protest-court-illegal-law-prison-sentence-washington-biden-investigation-capitol",
    "timestamp": "2025-04-19T19:15:04Z"
  },
  {
    "title": "Analyst warns Trump firing the Fed Reserve Chairman could set off ‘a global financial crisis'",
    "description": "Donald Trump is lashing out at the Chairman of the Federal Reserve as the President's tariffs cause another rough week for the ...",
    "link": "https://biztoc.com/x/c0b89e578ed5f046",
    "timestamp": "2025-04-19T19:12:36Z"
  },
  {
    "title": "Did Alito refuse to refer A.A.R.P. v. Trump to the full Court to facilitate Trump’s illegal detainments?",
    "description": "It seems that not only has the Supreme Court’s majority finally figured out that they’re facing an existential threat to their power and have had enough of Trump’s evasion of judicial orders, they’ve had enough of the president of the Article III Donald Trump…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/did-alito-refuse-to-refer-a-a-r-p-v-trump-to-the-full-court-to-facililtate-trumps-illegal-detainments",
    "timestamp": "2025-04-19T19:11:23Z"
  },
  {
    "title": "Trump Advances Plan to Fill Federal Government With 'Political Cronies'",
    "description": "The largest federal labor union in the U.S. said Friday that tens of thousands of federal workers could soon \"have their jobs politicized\" and be swiftly fired under a new rule proposed by the Office of Personnel Management. Under the rule, an estimated 50,00…",
    "link": "https://www.commondreams.org/news/trumps-schedule-f-plan",
    "timestamp": "2025-04-19T19:09:50Z"
  },
  {
    "title": "US deportations to El Salvador test legal limits",
    "description": "As court disputes heat up over the Trump administration's deportations of alleged criminal migrants to El Salvador, legal experts explain to DW what's at stake for both detainees and the rule of law. Ever since Donald Trump took office in January, migrants en…",
    "link": "https://www.dw.com/en/us-deportations-to-el-salvador-test-legal-limits/a-72289913",
    "timestamp": "2025-04-19T19:06:00Z"
  },
  {
    "title": "Teen journalists at the centre of the fight between Trump and Harvard",
    "description": "Two student reporters scramble to cover Harvard’s funding freeze amid escalating tensions with Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-04-20/donald-trump-wants-to-purge-harvard-university-policies/105191316",
    "timestamp": "2025-04-19T19:04:17Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "Julian Benson passes away, Conor McGregor’s interview with Tucker Carlson airs, and surprise Easter truce in Ukraine war is announced by Putin.",
    "link": "https://www.thejournal.ie/news-fix-19-04-25-6682703-Apr2025/",
    "timestamp": "2025-04-19T19:00:15Z"
  },
  {
    "title": "Macho Man Trump Cutting Funds to YMCAs After Using Village People Song...",
    "description": "And we thought Donald Trump liked the YMCA. The macho man president famously uses the song, “YMCA,” to promote his rallies. He even got Village People chief Victor Willis on board — to the chagrin of many — by putting money in his pocket. Willis is one of the…",
    "link": "https://www.showbiz411.com/2025/04/19/macho-man-trump-cutting-funds-to-ymcas-after-using-village-people-song-to-promote-campaign-houston-club-shutting-down-exclusive",
    "timestamp": "2025-04-19T19:00:03Z"
  },
  {
    "title": "The real strategy behind Russia’s sudden truce announcement",
    "description": "The timing, the brevity, the sudden, unilateral nature of it all. If Ukraine’s allies needed proof of Moscow’s wild cynicism when it comes to peace, the...",
    "link": "https://www.cnn.com/2025/04/19/europe/putin-russia-ukraine-truce-strategy-intl-latam",
    "timestamp": "2025-04-19T18:56:19Z"
  },
  {
    "title": "Captivity survivor: 'I told Trump that he'd been sent by G-d to save us'",
    "description": "Released hostage Omer Shem Tov turns to US President Donald Trump, asking him to use his power to bring the remaining 59 hostages home to their families. 'They need a miracle, too.'",
    "link": "https://www.israelnationalnews.com/news/407059",
    "timestamp": "2025-04-19T18:48:52Z"
  },
  {
    "title": "U.S., Iran resume nuclear deal talks in Rome",
    "description": "Delegations from the United States and Iran on Saturday resumed \"indirect\" negotiations on a nuclear deal in Rome, with another round of talks set for next...",
    "link": "https://www.upi.com/Top_News/World-News/2025/04/19/Iran-sides-negotiate-Rome-nuclear-deal/5311745072349/",
    "timestamp": "2025-04-19T18:47:49Z"
  },
  {
    "title": "From Messi to Trump, AI action figures are the rage",
    "description": "PARIS - The latest internet obsession is one impossible to escape on social media: images of well-known figures in plastic toy packaging alongside evocative props... welcome to the meme of AI action figures.",
    "link": "https://www.bangkokpost.com/life/arts-and-entertainment/3006546/from-messi-to-trump-ai-action-figures-are-the-rage",
    "timestamp": "2025-04-19T18:45:00Z"
  },
  {
    "title": "Dems failed in 2024 because leaders were ‘lying about Biden’s mental acuity’",
    "description": "Analysis: Fibbing reinforced voters' suspicions the party won't admit uncomfortable truths on crime, immigration, inflation",
    "link": "https://www.wnd.com/2025/04/dems-failed-in-2024-because-leaders-were-lying-about-bidens-mental-acuity/",
    "timestamp": "2025-04-19T18:43:56Z"
  },
  {
    "title": "Brooklyn Tesla Vandalism Suspect Is a Licensed Mental Health Therapist",
    "description": "As a licensed counselor and therapist helping to keep criminal offenders out of prison, a Brooklyn woman accused of trashing a parked Tesla may need some of her own professional expertise. According to the New York Post, 46-year old Natasha\nThe post Brooklyn …",
    "link": "https://www.breitbart.com/crime/2025/04/19/brooklyn-tesla-vandal-is-a-licensed-mental-health-therapist/",
    "timestamp": "2025-04-19T18:43:46Z"
  },
  {
    "title": "Brooklyn Tesla Vandalism Suspect Is a Licensed Mental Health Therapist - NewsBreak",
    "description": "As a licensed counselor and therapist helping to keep criminal offenders out of prison, a Brooklyn woman accused of trashing a parked Tesla may need some o",
    "link": "https://www.newsbreak.com/share/3970037965846-brooklyn-tesla-vandalism-suspect-is-a-licensed-mental-health-therapist?s=a2&share_destination_id=Mjg0MjgwMDUxLTE3NDUxMDMxNTA4Mzc%3D&pd=0JEoE7iu&hl=en_US&send_time=1745103150&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.39.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-control%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_model_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_recall_exp_25q2-v7",
    "timestamp": "2025-04-19T18:43:46Z"
  },
  {
    "title": "Anti-Trump administration protesters turn out for rallies in the US",
    "description": "Demonstrators decry what they see as threats to the nation’s democratic ideals.",
    "link": "https://www.aljazeera.com/news/2025/4/19/anti-trump-administration-protesters-turn-out-for-rallies-in-the-us",
    "timestamp": "2025-04-19T18:40:48Z"
  },
  {
    "title": "David Hogg Fires Back at ‘Timid’ James Carville Calling Him ‘Twerp’: ‘What’s HIS Plan’ for Dismal Dem Approval Ratings?",
    "description": "Hogg directly addressed Carville’s remarks, which included calling the 24-year-old activist-turned-political figure a “contemptible little twerp.\"\nThe post David Hogg Fires Back at ‘Timid’ James Carville Calling Him ‘Twerp’: ‘What’s HIS Plan’ for Dismal Dem A…",
    "link": "https://www.mediaite.com/tv/david-hogg-fires-back-at-timid-james-carville-calling-him-twerp-whats-his-plan-for-dismal-dem-approval-ratings/",
    "timestamp": "2025-04-19T18:39:15Z"
  },
  {
    "title": "Unknotting Kashmir’s carpet woes: Hand-knotted Kashmiri silk carpets called Kal Baffi are making a subtle, yet striking, comeback",
    "description": "Kashmir's tourism is booming, and its hand-knotted silk carpets are reviving. These carpets, known as Kal Baffi, face challenges like US tariffs and market fluctuations. However, rising Indian demand and innovative designs are fueling a comeback. High-quality…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/garments-/-textiles/unknotting-kashmirs-carpet-woes-hand-knotted-kashmiri-silk-carpets-called-kal-baffi-are-making-a-subtle-yet-striking-comeback/articleshow/120439889.cms",
    "timestamp": "2025-04-19T18:37:33Z"
  },
  {
    "title": "All-Women Blue Origin Flight Gets Social Media Flack From US Secretary of Transportation",
    "description": "The women of the beleaguered Blue Origin flight aren't astronauts, Transportation Secretary Sean Duffy says, though they are ‘brave and glam.’",
    "link": "https://www.vanityfair.com/style/story/blue-origin-all-women-not-astronauts",
    "timestamp": "2025-04-19T18:30:56Z"
  },
  {
    "title": "Vermont maple syrup makers face uncertainty amid Canada and China tariff chaos",
    "description": "Multiple countries contribute to each container of the sticky sweetener, with the vast majority of equipment sold by Canada.",
    "link": "https://richmond.com/news/nation-world/business/article_f11085d5-69ba-5140-8d81-7882c48646f2.html",
    "timestamp": "2025-04-19T18:30:00Z"
  },
  {
    "title": "Vermont maple syrup makers face uncertainty amid Canada and China tariff chaos",
    "description": "Multiple countries contribute to each container of the sticky sweetener, with the vast majority of equipment sold by Canada.",
    "link": "https://roanoke.com/news/nation-world/business/article_f2595dfe-d56e-5abd-8f75-6a16a8f545f5.html",
    "timestamp": "2025-04-19T18:30:00Z"
  },
  {
    "title": "Democratic Leaders Get Worst Polling Result in Over Two Decades",
    "description": "A political strategist told Newsweek that negative views of the party resulted from \"a combination of Democratic failures.\"",
    "link": "https://www.newsweek.com/democratic-leaders-get-worst-polling-result-over-two-decades-2061763",
    "timestamp": "2025-04-19T18:24:15Z"
  },
  {
    "title": "Why the Right Is Drawn to Hungary",
    "description": "Earlier this month, Israeli Prime Minister Benjamin Netanyahu had a high-profile meeting with his Hungarian counterpart, Viktor Orbán, in Budapest. Argentina’s libertarian president, Javier Milei, has called Orbán his “comrade in this fight for the ideas of f…",
    "link": "https://freerepublic.com/focus/f-news/4312015/posts",
    "timestamp": "2025-04-19T18:19:26Z"
  },
  {
    "title": "US tariff chaos, global headwinds hit pharma GCC hiring in India",
    "description": "Uncertainty surrounding US tariffs and global economic headwinds has tempered hiring in India's pharmaceutical and healthcare GCCs. Experts predict a 6-7% reduction in net talent addition this fiscal year as companies adopt a cautious approach. Despite this t…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/us-tariff-chaos-global-headwinds-hit-pharma-gcc-hiring-in-india/articleshow/120439658.cms",
    "timestamp": "2025-04-19T18:18:17Z"
  },
  {
    "title": "US senator blasts president of Mexico, says toxic sewage dump threatens ‘national security’",
    "description": "Senator Tim Sheehy, R-Montana, called out Mexican president Claudia Sheinbaum as toxic waste and sewage pour into the U.S.",
    "link": "https://www.foxnews.com/politics/us-senator-blasts-president-mexico-says-toxic-sewage-dump-threatens-national-security",
    "timestamp": "2025-04-19T18:17:17Z"
  },
  {
    "title": "Supreme Court blocks, for now, new deportations under 18th century wartime law",
    "description": "The court said earlier this month that deportations could proceed only if those set to be removed had a chance to argue their case in court.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_760ad071-28bd-51ad-89fc-9121a8772a49.html",
    "timestamp": "2025-04-19T18:15:00Z"
  },
  {
    "title": "Supreme Court blocks, for now, new deportations under 18th century wartime law",
    "description": "The court said earlier this month that deportations could proceed only if those set to be removed had a chance to argue their case in court.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_9471f838-b45e-5ee6-a2e7-b8fb627ab509.html",
    "timestamp": "2025-04-19T18:15:00Z"
  },
  {
    "title": "Iran Says To Hold More Nuclear Talks With US After Latest Round",
    "description": "The United States and Iran on Saturday concluded a second round of high-stakes talks on Tehran&#039;s nuclear programme, agreeing to meet again in a week&#039;s time, the Iranian foreign ministry said.",
    "link": "https://www.ndtv.com/world-news/iran-says-to-hold-more-nuclear-talks-with-us-after-latest-round-8206168",
    "timestamp": "2025-04-19T18:13:59Z"
  },
  {
    "title": "Globalisation, which was meant to ensure lasting peace, threatens to start a trade war",
    "description": "Globalisation, initially conceived to foster peace and contain Communism, now faces disruption as China, a Communist nation, challenges the established world order. Accusations of unfair trade practices and intellectual property theft have led to trade tensio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/globalisation-which-was-meant-to-ensure-lasting-peace-threatens-to-start-a-trade-war/articleshow/120438410.cms",
    "timestamp": "2025-04-19T18:13:49Z"
  },
  {
    "title": "Time to hide! Donald Trump follows through on his threat, unleashes bunker-buster missiles on Houthis using B-2 stealth bombers, resulting in massive casualties; here's all about the bombs",
    "description": "Donald Trump bunker-buster attack in Yemen has left 74 dead and 171 injured after U.S. B-2 stealth bombers hit a key fuel terminal used by Iran-backed Houthi rebels. The Ras Isa port, storing up to 3 million barrels of oil, was targeted to cut off rebel fuel …",
    "link": "https://economictimes.indiatimes.com/news/international/us/time-to-hide-donald-trump-follows-through-on-his-threat-unleashes-bunker-buster-missiles-on-houthis-using-b-2-stealth-bombers-resulting-in-massive-casualties-heres-all-about-the-bombs/articleshow/120437915.cms",
    "timestamp": "2025-04-19T18:11:23Z"
  },
  {
    "title": "Bougainville: Is this the world's newest country? It could become independent by 2027 if Donald Trump can be persuaded. Here's where it is and what makes it so special",
    "description": "Bougainville, a Pacific island, aims for independence by 2027. A 2019 vote favored secession from Papua New Guinea. However, Papua New Guinea's parliament must approve. The island holds strategic and economic value, particularly the Panguna copper mine. Bouga…",
    "link": "https://economictimes.indiatimes.com/news/international/us/bougainville-is-this-the-worlds-newest-country-it-could-become-independent-by-2027-if-donald-trump-can-be-persuaded-heres-where-it-is-and-what-makes-it-so-special/articleshow/120438816.cms",
    "timestamp": "2025-04-19T18:05:45Z"
  },
  {
    "title": "Who is the economist-doctor-marathoner leading Harvard and rising as a symbol of resistance against Donald Trump? Meet Alan Garber",
    "description": "Alan Garber, Harvard's interim president, has become a symbol of resistance to the Trump administration, particularly in defending the university's independence against government demands for audits. A doctor, economist, and lifelong Harvard academic, Garber'…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/who-is-the-economist-doctor-marathoner-leading-harvard-and-rising-as-a-symbol-of-resistance-against-donald-trump-meet-alan-garber/articleshow/120439161.cms",
    "timestamp": "2025-04-19T18:04:48Z"
  },
  {
    "title": "Bill Maher Mocks Trump For 1 'Testosterone-Drenched Delusion'",
    "description": "The \"Real Time\" host ridiculed the president for his vision of American society, then blamed Gen Z for not living up to it.",
    "link": "https://www.huffpost.com/entry/bill-maher-trump-delusion-factories_n_6803c0dce4b057453bea833c",
    "timestamp": "2025-04-19T18:03:00Z"
  },
  {
    "title": "Will appeasing Trump really help India’s global rise?",
    "description": "Sunday Times News: Donald Trump’s return to the US presidency is widely perceived as exemplifying virulent American carnage.",
    "link": "https://timesofindia.indiatimes.com/home/sunday-times/all-that-matters/will-appeasing-trump-really-help-indias-global-rise/articleshow/120439188.cms",
    "timestamp": "2025-04-19T18:01:01Z"
  },
  {
    "title": "Over 700 events and protests across the US mark ‘A National Day of Action’",
    "description": "More protests against President Donald Trump are taking place today as part of “A National Day of Action” largely spearheaded by the decentralized 50501 movement. Events are scheduled in all 50 states, two weeks after millions of people attended more than 1,3…",
    "link": "https://www.theverge.com/news/652341/nation-day-of-action-50501-protests-50-states",
    "timestamp": "2025-04-19T18:00:52Z"
  },
  {
    "title": "Trump Posts Image of Kilmar Abrego Garcia Knuckle Tattoos Photoshopped With Disputed ‘MS-13’ Interpretation",
    "description": "The president has not addressed the digital addition of labels suggesting the deported El Salvadorian's tats are proof he's a gang member\nThe post Trump Posts Image of Kilmar Abrego Garcia Knuckle Tattoos Photoshopped With Disputed ‘MS-13’ Interpretation appe…",
    "link": "https://www.thewrap.com/trump-posts-image-of-kilmar-abrego-garcia-knuckle-tattoos-photoshopped-with-disputed-ms-13-interpretation/",
    "timestamp": "2025-04-19T17:58:52Z"
  },
  {
    "title": "Naval Academy cancels speech by podcaster amid cultural turmoil",
    "description": "The Navy said it canceled an engagement at its academy with Ryan Holiday because it wanted to steer clear of what it saw as political content aimed at young officers.",
    "link": "https://abcnews.go.com/Politics/naval-academy-cancels-speech-podcaster-amid-cultural-turmoil/story?id=120975608",
    "timestamp": "2025-04-19T17:58:19Z"
  },
  {
    "title": "Chris Riddell on Donald Trump, the Easter bunny who came to break all the eggs",
    "description": "Free trade is smashed to pieces, while just a couple of chicks he fancies are spared\nYou can buy a copy of this cartoon Continue reading...",
    "link": "https://biztoc.com/x/613e958b88dc445f",
    "timestamp": "2025-04-19T17:54:32Z"
  },
  {
    "title": "Deranged Trump goes on off-the-rails egg rant as he bizarrely complains prices are ‘too low’",
    "description": "President Donald Trump, during a press conference today, seemed to get exasperated at a reporter asking him about egg prices, going on a bizarre rant that ended with him stating that 'egg prices are getting too low.'\n\"You can have all the eggs you want. We ha…",
    "link": "https://biztoc.com/x/0e968d879ad2ed8c",
    "timestamp": "2025-04-19T17:54:28Z"
  },
  {
    "title": "CNN’s Abby Phillip Roasts Trump With Comical List Of Attack Targets That Includes ‘Red Dye No. 3’ And ‘Pennies’",
    "description": "CNN's Abby Phillip roasted Trump with a comically long list of fights he has picked ranging from a list of enemies to \"red dye no. 3\" and \"pennies.\"\nThe post CNN’s Abby Phillip Roasts Trump With Comical List Of Attack Targets That Includes ‘Red Dye No. 3’ And…",
    "link": "https://www.mediaite.com/entertainment/cnns-abby-phillip-roasts-trump-with-comical-list-of-attack-targets-that-includes-red-dye-no-5-and-fluoride/",
    "timestamp": "2025-04-19T17:53:11Z"
  },
  {
    "title": "Gen Z leading political shift toward Republicans: Poll",
    "description": "More Gen Z voters are shifting Republican, challenging past trends Gen Z was key in re-electing President Donald Trump JD Vance leads GOP among young voters; Kamala Harris tops Dems A growing political divide is emerging among Americans under 30, as more youn…",
    "link": "https://freerepublic.com/focus/f-news/4312011/posts",
    "timestamp": "2025-04-19T17:45:13Z"
  },
  {
    "title": "Anti-Trump rallies held across the U.S. to protest administration's policies",
    "description": "Some of the protests are drawing on themes from the American Revolutionary War, as Saturday marks 250 years since the Battles of Lexington and Concord in Massachusetts launched the conflict.",
    "link": "https://www.cbsnews.com/news/anti-trump-rallies-hands-off-administration-washington-new-york-boston/",
    "timestamp": "2025-04-19T17:45:09Z"
  },
  {
    "title": "Will the Supreme Court limit free Cancer screenings and preventive drugs under Obamacare? Who has challenged the ACA and why?",
    "description": "As the justices prepare to hear arguments, the stakes remain high, not only for cancer screening and cholesterol medication access, but for the broader structure of government-mandated healthcare coverage in the U.S.",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-the-supreme-court-limit-free-cancer-screenings-and-preventive-drugs-under-obamacare-who-has-challenged-the-aca-and-why/articleshow/120438904.cms",
    "timestamp": "2025-04-19T17:40:28Z"
  },
  {
    "title": "Judges are now controlling the military: Congress can stop it",
    "description": "'Biden's radical policies regarding transgender people' could continue indefinitely",
    "link": "https://www.wnd.com/2025/04/judges-are-now-controlling-the-military-congress-can-stop-it/",
    "timestamp": "2025-04-19T17:40:10Z"
  },
  {
    "title": "'Impossible to bring back all hostages,' Netanyahu spox. says",
    "description": "PM spokesman Omer Dostri said hostages must return before Hamas is destroyed, rejecting Hamas' ceasefire demand. He confirmed that talks to replace Shin Bet Chief Ronen Bar began months ago.",
    "link": "https://www.jpost.com/israel-news/article-850706",
    "timestamp": "2025-04-19T17:38:40Z"
  },
  {
    "title": "Attackers exploited SonicWall SMA appliances since January 2025",
    "description": "Threat actors are actively exploiting a remote code execution flaw in SonicWall Secure Mobile Access (SMA) appliances since January 2025. Arctic Wolf researchers warn that threat actors actively exploit a vulnerability, tracked as CVE-2021-20035 (CVSS score o…",
    "link": "https://securityaffairs.com/176706/security/attackers-exploited-sonicwall-sma-appliances-since-january-2025.html",
    "timestamp": "2025-04-19T17:37:08Z"
  },
  {
    "title": "‘I Was Getting Ready To Die!’ Survivor Gets Emotional On NBC Anchor Over FSU Mass Shooting By Alleged Pro-Trump Suspect",
    "description": "FSU shooting survivor Reid Seybold got emotional as he told NBC's Hallie Jackson that he was \"getting ready to die\" as the shooter rampaged at the school.\nThe post ‘I Was Getting Ready To Die!’ Survivor Gets Emotional On NBC Anchor Over FSU Mass Shooting By A…",
    "link": "https://www.mediaite.com/news/i-was-getting-ready-to-die-survivor-gets-emotional-on-nbc-anchor-over-fsu-mass-shooting-by-alleged-pro-trump-suspect/",
    "timestamp": "2025-04-19T17:34:51Z"
  },
  {
    "title": "Nationwide ‘50501’ protests to rally against Trump administration’s policies - The Washington Post",
    "description": "Nationwide ‘50501’ protests to rally against Trump administration’s policiesThe Washington Post Anti-Trump protests this weekend turn focus to community actionNPR Protesters Nationwide Rally Again to Condemn Trump PoliciesThe New York Times Raleigh, Durham jo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177067013",
    "timestamp": "2025-04-19T17:33:26Z"
  },
  {
    "title": "Russia's Putin declares unilateral Easter ceasefire in Ukraine",
    "description": "Russian President Vladimir Putin announced a surprise one-day ceasefire in Ukraine for Easter on Saturday (Apr 19), but Kyiv said Russian forces continued artillery fire and called instead for an extended true halt to hostilities. Ukrainian President Volodymy…",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-putin-unilateral-ceasefire-truce-easter-5075826",
    "timestamp": "2025-04-19T17:31:00Z"
  },
  {
    "title": "AOC fundraising soars as the New York rep and Bernie Sanders barnstorm U.S. against Trump",
    "description": "Rep. Alexandria Ocasio-Cortez raised $9.6 million in the first quarter of 2025, the best quarter ever for the New York progressive Democrat. The big haul comes as Ocasio-Cortez and Sen. Bernie Sanders hold rallies across the United States to criticize Preside…",
    "link": "https://freerepublic.com/focus/f-news/4312008/posts",
    "timestamp": "2025-04-19T17:29:34Z"
  },
  {
    "title": "Kamala Harris under fire as secret payments to millionaire celebrities come to light, including one who said she got nothing",
    "description": "Kamala Harris's campaign faces scrutiny over payments to celebrity-linked firms. LeBron James's company received $50,000 after his endorsement. Cardi B's firm got $58,867, despite her denial of payment. Beyonce, Lady Gaga, and others also received significant…",
    "link": "https://economictimes.indiatimes.com/news/international/us/kamala-harris-under-fire-as-secret-payments-to-millionaire-celebrities-come-to-light-including-one-who-said-she-got-nothing/articleshow/120438201.cms",
    "timestamp": "2025-04-19T17:28:13Z"
  }
]