[
  {
    "title": "TRUMP Coin Spikes 17% As Arthur Hayes Says It Could Outperform Bitcoin",
    "description": "The former BitMEX CEO, Arthur Hayes, is making a bold prediction for the TRUMP meme coin: it will outperform Bitcoin if market sentiment continues improving and politicians start leveraging meme cryptos. Related Reading: Cardano Price Balloons 107% As Whales …",
    "link": "http://www.newsbtc.com/news/bitcoin/trump-coin-spikes-17-as-arthur-hayes-says-it-could-outperform-bitcoin/",
    "timestamp": "2025-02-14T14:00:04Z"
  },
  {
    "title": "Black expats share why they're happier living outside the U.S.: I get to 'exist in peace'",
    "description": "Many Black Americans experience racism at home in the U.S. Moving abroad has been a respite for these three expats.",
    "link": "https://www.cnbc.com/2025/02/14/black-expats-share-experiences-living-abroad.html",
    "timestamp": "2025-02-14T14:00:01Z"
  },
  {
    "title": "Hertz Lost $2.9 Billion After EV Gamble Didn't Pay Off",
    "description": "Happy Valentine’s Day! It’s Friday, February 14, 2025, and this is The Morning Shift, your daily roundup of the top automotive headlines from around the world, in one place. Here are the important stories you need to know.Read more...",
    "link": "https://jalopnik.com/hertz-lost-2-9-billion-after-ev-gamble-didnt-pay-off-1851763388",
    "timestamp": "2025-02-14T14:00:00Z"
  },
  {
    "title": "Oil Prices Rise Despite Multiple Bearish Catalysts",
    "description": "Oil prices are rising despite concerns about Trump imposing tariffs on trading partners and talk of a peace deal between Russia and Ukraine. Oil prices are now set to end the week with a gain, ending a three-week losing streak. Backwardation has eased in glob…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Rise-Despite-Multiple-Bearish-Catalysts.html",
    "timestamp": "2025-02-14T14:00:00Z"
  },
  {
    "title": "I'm Worried Social Security Will Run Out Before I Retire. What Should I Do?",
    "description": "Social Security plays a big role in your retirement planning -- but you shouldn't bank on it. Here's what to do instead.",
    "link": "https://www.cnet.com/personal-finance/im-worried-social-security-will-run-out-before-i-retire-what-should-i-do/",
    "timestamp": "2025-02-14T14:00:00Z"
  },
  {
    "title": "Crypto kings cheer Trump’s ‘debanking’ crackdown",
    "description": "Top crypto executives said they can already see a thaw in their relationships with banks, which are openly seeking business from the once shunned industry.",
    "link": "https://nypost.com/2025/02/14/business/crypto-kings-cheer-trumps-debanking-crackdown/",
    "timestamp": "2025-02-14T13:59:32Z"
  },
  {
    "title": "DOJ order to drop Eric Adams case sparks at least 6 prosecutors to resign",
    "description": "Mass resignations among leading federal prosecutors are very rare, but that's what happened in the Justice Department's handling of the Eric Adams case.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/sassoon-prosecutors-resign-eric-adams-case-rcna192195",
    "timestamp": "2025-02-14T13:57:51Z"
  },
  {
    "title": "Russian Drone Attack On Chernobyl Sparks Outrage, No Radiation Detected",
    "description": "Ukrainian President Volodymyr Zelensky said Friday that a Russian drone had struck a cover built to contain radiation at the Chernobyl nuclear power plant, adding that radiation levels were normal.",
    "link": "https://www.ibtimes.com.au/russian-drone-attack-chernobyl-sparks-outrage-no-radiation-detected-1856194",
    "timestamp": "2025-02-14T13:57:20Z"
  },
  {
    "title": "Russian Drone Attack On Chernobyl Sparks Outrage, No Radiation Detected",
    "description": "Ukrainian President Volodymyr Zelensky said Friday that a Russian drone had struck a cover built to contain radiation at the Chernobyl nuclear power plant, adding that radiation levels were normal.",
    "link": "https://www.ibtimes.com/russian-drone-attack-chernobyl-sparks-outrage-no-radiation-detected-3763750",
    "timestamp": "2025-02-14T13:57:07Z"
  },
  {
    "title": "Ukraine says protective covering outside Chornobyl nuclear plant hit by Russian drone",
    "description": "A Russian drone caused significant damage to the radiation containment shelter at the Chornobyl nuclear power plant overnight, Ukrainian President Volodymyr Zelenskyy said on Friday, an allegation the Kremlin denied.",
    "link": "https://www.cbc.ca/news/world/ukraine-chornobyl-shelter-drone-hit-1.7459196",
    "timestamp": "2025-02-14T13:57:07Z"
  },
  {
    "title": "US retail sales plunged last month as consumers pulled back after busy holiday season",
    "description": "U.S. retail sales dropped sharply last month, in part because cold weather kept more Americans indoors and dented sales at car dealers and most other stores. Retail sales dropped 0.9% in January from the previous month, the Commerce Department said, after two…",
    "link": "https://www.seattlepi.com/business/article/us-retail-sales-plunged-last-month-as-consumers-20167430.php",
    "timestamp": "2025-02-14T13:56:55Z"
  },
  {
    "title": "Expert reveals massive levels of waste DOGE can slash from entitlements, pet projects: 'A lot of fat'",
    "description": "Fox News Digital spoke to Just Facts President James Agresti about the many areas in the federal government that DOGE can target including entitlement programs.",
    "link": "https://www.foxnews.com/politics/expert-reveals-massive-levels-waste-doge-slash-from-entitlements-pet-projects-fat",
    "timestamp": "2025-02-14T13:56:39Z"
  },
  {
    "title": "Weaponizing Data Against Democracy",
    "description": "Maintaining control over official data is at the heart of the authoritarian project, driving a fundamental shift in how public information is accessed and used. Nowhere is this more evident than in India, where Prime Minister Narendra Modi’s government has sy…",
    "link": "https://www.project-syndicate.org/commentary/trump-modi-data-manipulation-against-democracy-by-jayati-ghosh-2025-02",
    "timestamp": "2025-02-14T13:56:30Z"
  },
  {
    "title": "By Refusing to Obey Court Orders, Trump Is Provoking a Constitutional Crisis. Prof. Marjorie Cohn",
    "description": "No sooner did Donald Trump take the oath of office than he immediately took a wrecking ball to government agencies and programs that protect nearly every aspect of Americans’ lives.\nStates, public interest organizations, schools, doctors, unions, immigrants, …",
    "link": "https://www.globalresearch.ca/refusing-obey-court-orders-trump-provoking-constitutional-crisis/5879919",
    "timestamp": "2025-02-14T13:56:02Z"
  },
  {
    "title": "Is Barron Trump way too mysterious? His classmates at New York University share eye-raising details about him",
    "description": "Barron Trump has been dominating headlines ever since his father Donald Trump returned to the White House. He has been described as a 'ladies man' at the New York University. His classmates describe him as someone who doesn’t spend much time on campus or part…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-is-barron-trump-way-too-mysterious-his-classmates-at-new-york-university-share-eye-raising-details-about-him/articleshow/118251151.cms",
    "timestamp": "2025-02-14T13:55:05Z"
  },
  {
    "title": "Cheryl Hines Embraces Vintage Flair in Polka-dot Peplum Jacket as Husband Robert F. Kennedy Jr. Is Sworn in as Health & Human Services Secretary by Donald Trump",
    "description": "Cheryl Hines wore a vintage-inspired look for her husband Robert F. Kennedy Jr.'s sworn-in ceremony as the new Secretary of Health and Human Services.",
    "link": "http://wwd.com/pop-culture/celebrity-news/rfk-jr-wife-cheryl-hines-outfit-hhs-confirmation-1236931355/",
    "timestamp": "2025-02-14T13:54:37Z"
  },
  {
    "title": "Jon Stewart Objects to Jen Psaki Branding Joe Rogan, Theo Von Part of ‘Trump Enterprise’",
    "description": "Jon Stewart pushed back on Jen Psaki calling podcasters like Joe Rogan and Theo Von part of a right-wing \"ecosystem\" feeding the \"Trump enterprise.\"\nThe post Jon Stewart Objects to Jen Psaki Branding Joe Rogan, Theo Von Part of ‘Trump Enterprise’ first appear…",
    "link": "https://www.mediaite.com/politics/jon-stewart-objects-to-jen-psaki-branding-joe-rogan-theo-von-part-of-trump-enterprise/",
    "timestamp": "2025-02-14T13:54:36Z"
  },
  {
    "title": "Cartel Crack Squad Proposed for Texas: 'Show of Force'",
    "description": "\"We need to go on the offense. We don't need to be cowering in our holes,\" Congressman Keith Self told Newsweek.",
    "link": "https://www.newsweek.com/cartel-crack-squad-texas-keith-self-republican-mexico-guns-2031122",
    "timestamp": "2025-02-14T13:54:05Z"
  },
  {
    "title": "Newsom vows to veto bill blocking California corrections from cooperating with ICE, Trump migrant policies",
    "description": "California Gov. Gavin Newsom made an about-face in his efforts to thwart President Donald Trump’s agenda of deporting illegal immigrants in the country. The 57-year-old revealed he is ready to immediately veto a bill that would force Golden State prison syste…",
    "link": "https://freerepublic.com/focus/f-news/4297555/posts",
    "timestamp": "2025-02-14T13:53:48Z"
  },
  {
    "title": "Darkness Dying",
    "description": "“The nature of the NGO scams is to have a cause that sounds philanthropic, like ‘Save the Orphans of Sadville’ and then they pocket the money and zero actual orphans are helped.” — Elon Musk",
    "link": "https://www.kunstler.com/p/darkness-dying",
    "timestamp": "2025-02-14T13:53:42Z"
  },
  {
    "title": "India and the New Trumpian World Order",
    "description": "The new world order would not disadvantage India. On the contrary, it would do well in a Trumpian world.",
    "link": "https://thediplomat.com/2025/02/india-and-the-new-trumpian-world-order/",
    "timestamp": "2025-02-14T13:53:00Z"
  },
  {
    "title": "How Americans really feel about deporting immigrants – 3 charts explain the conflicting headlines from recent polls",
    "description": "Conflicting polls can make it seem like Americans back Trump’s deportation plan. A psychologist and survey researcher explains how to make sense of the numbers.",
    "link": "https://theconversation.com/how-americans-really-feel-about-deporting-immigrants-3-charts-explain-the-conflicting-headlines-from-recent-polls-248838",
    "timestamp": "2025-02-14T13:52:25Z"
  },
  {
    "title": "Arab leaders to meet next week for a response to Trump’s plan for Gaza",
    "description": "The meeting will underline the rejection of a \"displacement of the residents of the Gaza Strip and their \"transfer\" out of that territory, according to sources\nThe post Arab leaders to meet next week for a response to Trump’s plan for Gaza appeared first on P…",
    "link": "https://en.protothema.gr/2025/02/14/arab-leaders-to-meet-next-week-for-a-response-to-trumps-plan-for-gaza/",
    "timestamp": "2025-02-14T13:52:19Z"
  },
  {
    "title": "Elon Musk's X is pulling big-name advertisers back",
    "description": "Elon Musk's close ties to the president is one factor enticing advertisers to return and investors to buy its debt.",
    "link": "https://www.businessinsider.com/x-advertisers-back-again-investors-musk-trump-2025-2",
    "timestamp": "2025-02-14T13:50:56Z"
  },
  {
    "title": "Hostages freed from Gaza painfully piece together a changed world",
    "description": "After nearly 500 days in captivity in Gaza, with little access to media, recently freed hostages have many questions",
    "link": "https://abcnews.go.com/International/wireStory/hostages-freed-gaza-painfully-piece-changed-world-118821806",
    "timestamp": "2025-02-14T13:50:53Z"
  },
  {
    "title": "Impact of USAID closure on Eswatini",
    "description": "MBABANE – “As Eswatini, among many countries, breathed a sigh of relief after aid through PEPFAR was restored, USAID Headquarters has now been shut down. The closure of the United States Agency for International Development (USAID) headquarters, ordered by Pr…",
    "link": "https://slashdot.org/submission/17333253/impact-of-usaid-closure-on-eswatini",
    "timestamp": "2025-02-14T13:50:46Z"
  },
  {
    "title": "Europe quietly works on a plan to send troops to Ukraine for post-war security",
    "description": "Increasingly alarmed that U.S. security priorities lie elsewhere, a group of European countries has been working on a plan to send troops to Ukraine to help enforce any future peace settlement with Russia",
    "link": "https://abcnews.go.com/International/wireStory/europe-quietly-works-plan-send-troops-ukraine-post-118821805",
    "timestamp": "2025-02-14T13:50:44Z"
  },
  {
    "title": "Taiwan pledges chip talks and investment in bid to ease Trump’s concerns",
    "description": "TAIPEI — Taiwan President Lai Ching-te pledged on Friday to talk with the United States about President Donald Trump’s concerns over the chip industry and to increase U.S. investment and buy more from the country, while also spending more on defense.\n\n\nTrump …",
    "link": "https://www.voanews.com/a/taiwan-pledges-chip-talks-and-investment-in-bid-to-ease-trump-s-concerns-/7974979.html",
    "timestamp": "2025-02-14T13:50:24Z"
  },
  {
    "title": "Annexing Canada? At Niagara Falls, Trump's idea gets eye rolls but not support",
    "description": "At Niagara Falls, visitors from the United States and Canada are taking in President Donald Trump’s unsolicited suggestion the U.S. annex its neighbor to the north with an air of detached amusement",
    "link": "https://abcnews.go.com/US/wireStory/annexing-canada-niagara-falls-trumps-idea-gets-eye-118821309",
    "timestamp": "2025-02-14T13:50:23Z"
  },
  {
    "title": "Union leader calls mass firings \"reckless\" and will fight for all impacted employees",
    "description": "AFGE National President Everett Kelley released the following statement today in response to the mass firing of probationary employees:\"This administration has abused the probationary period to conduct a politically driven mass firing spree, targeting employe…",
    "link": "https://www.commondreams.org/newswire/union-leader-calls-mass-firings-reckless-and-will-fight-for-all-impacted-employees",
    "timestamp": "2025-02-14T13:50:19Z"
  },
  {
    "title": "Trump just drove a truck through Congress’s massive tariff loopholes",
    "description": "In 2018, after imposing steep tariffs on steel and aluminum imports, Donald Trump famously tweeted, “Trade wars are good, and easy to win.” Trump’s time out of the White House has not changed his mind on that subject. Since his inauguration last month, he has…",
    "link": "https://biztoc.com/x/ed3e5cd63381fdcf",
    "timestamp": "2025-02-14T13:49:25Z"
  },
  {
    "title": "Three captives in Gaza, 369 Palestinians held by Israel to be released",
    "description": "Palestinian group in Gaza says a total of 369 prisoners held in Israeli jails are expected to be released on Saturday.",
    "link": "https://www.aljazeera.com/news/2025/2/14/three-captives-in-gaza-369-palestinians-held-by-israel-to-be-released",
    "timestamp": "2025-02-14T13:48:27Z"
  },
  {
    "title": "Giving Peace a Chance in Ukraine Is Good. Why Not Gaza Too?",
    "description": "As we approach the third anniversary of the Russian invasion of Ukraine, a monumental shift is taking place that might just lead to the end of this calamitous war. This is not a breakthrough on the battlefield, but a stark reversal of the U.S. position from b…",
    "link": "https://www.commondreams.org/opinion/trump-peace-ukraine-gaza",
    "timestamp": "2025-02-14T13:48:06Z"
  },
  {
    "title": "India to Buy More US Oil, LNG to Avoid Tariffs",
    "description": "India agreed to boost oil and gas imports from the U.S. in an effort to reduce the trade imbalance between the two countries and avoid retaliatory tariffs.",
    "link": "https://www.rigzone.com/news/wire/india_to_buy_more_us_oil_lng_to_avoid_tariffs-14-feb-2025-179633-article/",
    "timestamp": "2025-02-14T13:48:04Z"
  },
  {
    "title": "MSNBC's Reid: 'Every Single Republican Would Say Yes Sir' to Trump Selling U.S. to Putin",
    "description": "MSNBC host Joy Reid claimed Thursday on \"The ReidOut\" that Republicans would all fall in line if President Donald Trump told them he was selling the United States to Russia.\nThe post MSNBC’s Reid: ‘Every Single Republican Would Say Yes Sir’ to Trump Selling U…",
    "link": "https://www.breitbart.com/clips/2025/02/14/msnbcs-reid-every-single-republican-would-say-yes-sir-to-trump-selling-u-s-to-putin/",
    "timestamp": "2025-02-14T13:48:04Z"
  },
  {
    "title": "Elon Musk’s X sees drop in ad revenue despite Apple and other brands returning",
    "description": "Elon Musk’s X has welcomed back major advertisers like Apple, yet its overall ad revenue remains below pre-acquisition levels, highlighting a gap between advertiser return and actual spending.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-x-sees-drop-in-ad-revenue-despite-apple-and-other-brands-returning/articleshow/118251181.cms",
    "timestamp": "2025-02-14T13:47:37Z"
  },
  {
    "title": "Democratic Sen. John Fetterman: 'There Isn't A Constitutional Crisis'",
    "description": "Sen. John Fetterman (D-Pa.) urged everyone to tone down the rhetoric about President Donald Trump and billionaire Elon Musk moving to dismantle federal agencies and the subsequent court rulings halting some of their efforts. Some of Trump’s allies, including …",
    "link": "https://freerepublic.com/focus/f-bloggers/4297553/posts",
    "timestamp": "2025-02-14T13:47:23Z"
  },
  {
    "title": "US making 'wrong calculations' in the Middle East? Turkish President has this to say",
    "description": "Turkish President Recep Tayyip Erdogan has dropped a bombastic claim, saying that the Donald Trump administration in Washington is making some 'wrong calculations' about the current geopolitical situation in the Middle East.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-making-wrong-calculations-in-the-middle-east-turkish-president-has-this-to-say/articleshow/118251199.cms",
    "timestamp": "2025-02-14T13:46:56Z"
  },
  {
    "title": "Democratic voters tell party to chill out with all the left-wing nonsense",
    "description": "Want to move toward the ideological center, but lawmakers keep push extremism",
    "link": "https://www.wnd.com/2025/02/democratic-voters-tell-party-to-chill-out-with-all-the-left-wing-nonsense/",
    "timestamp": "2025-02-14T13:46:04Z"
  },
  {
    "title": "How to find climate data and science the Trump administration doesn’t want you to see",
    "description": "Several groups are working to preserve webpages, tools and data – some of which have already gone missing from government webpages since the start of the Trump administration.",
    "link": "https://theconversation.com/how-to-find-climate-data-and-science-the-trump-administration-doesnt-want-you-to-see-249321",
    "timestamp": "2025-02-14T13:43:44Z"
  },
  {
    "title": "Elon Musk’s robotaxi vision: Could Tesla and Uber join forces? Uber CEO weighs in",
    "description": "Uber CEO Dara Khosrowshahi says no one wants to compete with Elon Musk’s Tesla, calling its capabilities extraordinary. He sees a Tesla-Uber partnership as a win-win.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-robotaxi-vision-could-tesla-and-uber-join-forces-uber-ceo-weighs-in/articleshow/118251083.cms",
    "timestamp": "2025-02-14T13:42:46Z"
  },
  {
    "title": "Three hostages due to be released by Hamas",
    "description": "Announcement from Gaza comes after days of uncertainty after intense efforts by Egyptian and Qatari mediators",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/14/three-hostages-due-to-be-released-by-hamas/",
    "timestamp": "2025-02-14T13:41:22Z"
  },
  {
    "title": "‘We will not be bullied’: This nation refuses to bow down to US pressure",
    "description": "Tensions between South Africa and the US have revealed deep and fundamental contradictions Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/612648-south-africa-stance-against-us-pressure/",
    "timestamp": "2025-02-14T13:40:42Z"
  },
  {
    "title": "First Astronaut With A Disability Cleared For Space Station Mission",
    "description": "John McFall, a 43-year-old British surgeon and former Paralympian who lost a leg in a motorbike accident when he was 19, said he was &quot;hugely proud&quot; of clearing the hurdle.",
    "link": "https://www.ndtv.com/world-news/first-astronaut-with-a-disability-cleared-for-space-station-mission-7711130",
    "timestamp": "2025-02-14T13:40:23Z"
  },
  {
    "title": "Tahawwur Rana's extradition to unravel Pakistani state actors' role in 26/11 Mumbai attacks",
    "description": "US President Donald Trump has announced the approved extradition of Tahawwur Rana, a key conspirator of the 26/11 Mumbai attacks, to India. This move is expected to help Indian agencies uncover the role of Pakistani state actors involved in the 2008 terror at…",
    "link": "https://economictimes.indiatimes.com/news/india/tahawwur-ranas-extradition-to-unravel-pakistani-state-actors-role-in-26/11-mumbai-attacks/articleshow/118251043.cms",
    "timestamp": "2025-02-14T13:40:23Z"
  },
  {
    "title": "US airlines urge Donald Trump administration to scrap Joe Biden’s compensation plan, warn of fare hikes",
    "description": "US airlines have urged Donald Trump’s Department of Transportation to halt a review of Joe Biden’s proposed delay compensation rules, saying they could lead to higher ticket prices and flight cancellations.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-airlines-urge-donald-trump-administration-to-scrap-joe-bidens-compensation-plan-warn-of-fare-hikes/articleshow/118250888.cms",
    "timestamp": "2025-02-14T13:38:14Z"
  },
  {
    "title": "Will Gov. Hochul remove NYC Mayor Eric Adams? ‘I need some time,’ she says",
    "description": "Gov. Kathy Hochul is interviewed by the Times Union editorial board on Monday, Feb. 10, 2025, in Colonie, New York.\n \n\nThe Democratic governor called the latest allegations about Adams’ legal defense against corruption charges “extremely concerning and seriou…",
    "link": "https://gothamist.com/news/will-gov-hochul-remove-nyc-mayor-eric-adams-i-need-some-time-she-says",
    "timestamp": "2025-02-14T13:38:00Z"
  },
  {
    "title": "\"No Role For Deep State, Leave It To PM Modi\": Trump On Bangladesh Crisis",
    "description": "The regime change in India&#039;s neighbour Bangladesh which many geopolitical analysts have attributed to the US&#039; deep state&#039;s alleged work in the shadows grazed US President Donald Trump during his joint press briefing with Prime Minister Narendra…",
    "link": "https://www.ndtv.com/world-news/no-role-for-deep-state-leave-it-to-pm-narendra-modi-says-donald-trump-on-bangladesh-crisis-7711092",
    "timestamp": "2025-02-14T13:37:35Z"
  },
  {
    "title": "Fox’s Andy McCarthy Slams Trump Over ‘Explicitly Political’ Order to Drop Eric Adams Case: ‘This Is Ridiculous’",
    "description": "Andy McCarthy slammed President Donald Trump and his underlings over their order to drop the case against New York City Mayor Eric Adams.\nThe post Fox’s Andy McCarthy Slams Trump Over ‘Explicitly Political’ Order to Drop Eric Adams Case: ‘This Is Ridiculous’ …",
    "link": "https://www.mediaite.com/news/foxs-andy-mccarthy-slams-trump-over-explicitly-political-order-to-drop-eric-adams-case-this-is-ridiculous/",
    "timestamp": "2025-02-14T13:37:33Z"
  },
  {
    "title": "Canadian hockey fans boo U.S. anthem after being specifically told not to",
    "description": "Canadian hockey fans are still making their voices heard during the pre-game anthems.\r\nTeam USA played their first game of the 4 Nations Face-Off against Finland at Centre Bell in Montreal on Thursday evening. The crowd booed during the American anthem, expre…",
    "link": "https://dailyhive.com/toronto/canadian-hockey-fans-boo-american-anthem",
    "timestamp": "2025-02-14T13:37:20Z"
  },
  {
    "title": "8 Conspiracy Theories That the Mainstream Media Has Been Forced to Admit Are Actually True",
    "description": "The mainstream media is in the habit of labeling something a “conspiracy theory” whenever they are attempting to discredit a particular point of view. Of course such “conspiracy theories” have been proven to actually be true time after time. Meanwhile, the ma…",
    "link": "https://freerepublic.com/focus/f-bloggers/4297551/posts",
    "timestamp": "2025-02-14T13:37:00Z"
  },
  {
    "title": "Will Harley-Davidson roar in full range in India again on Trump's reciprocal tariffs?",
    "description": "US President Trump's push for reciprocal tariffs may boost Harley-Davidson's presence in India. Recently, India's budget cut import duties on premium bikes. Harley-Davidson, which partnered with Hero MotoCorp, aims to expand its model lineup. India's relaxed …",
    "link": "https://economictimes.indiatimes.com/industry/auto/two-wheelers-three-wheelers/will-harley-davidson-roar-in-full-range-in-india-again-on-trumps-reciprocal-tariffs/articleshow/118250917.cms",
    "timestamp": "2025-02-14T13:35:02Z"
  },
  {
    "title": "Rwanda-backed M23 Rebel Group Declares Ceasefire in the Democratic Republic of Congo",
    "description": "For several weeks fighting has flared once again in the eastern region of the Democratic Republic of Congo (DRC) as the Rwandan-backed M23 rebel grouping has moved into the North Kivu city of Goma, the third largest urban area in …\nThe post Rwanda-backed M23 …",
    "link": "https://www.globalresearch.ca/m23-declares-ceasefire-democratic-republic-congo/5879897",
    "timestamp": "2025-02-14T13:34:19Z"
  },
  {
    "title": "Munich Security Conference: will 'stench of appeasement' overpower old world order?",
    "description": "\"America is under new management,\" said the BBC's Jeremy Bowen. And Ukraine's President Volodymyr Zelenskyy \"is joining a growing list of US allies who are finding that the world according to Donald Trump is a colder, more uncertain and potentially more dange…",
    "link": "https://biztoc.com/x/e43c1d32f1f2b0a3",
    "timestamp": "2025-02-14T13:33:30Z"
  },
  {
    "title": "Hungarian PM Orban Toughens Criticism of EU. “Cowardly in Face of President Trump’s Threats”",
    "description": "Hungarian Prime Minister Viktor Orban continues to maintain his firm stance against the current EU policies. According to the Hungarian leader, the bloc is acting cowardly in the face of recent US threats. He believes that Europe should take a …\nThe post Hung…",
    "link": "https://www.globalresearch.ca/orban-toughens-criticism-eu/5879901",
    "timestamp": "2025-02-14T13:32:14Z"
  },
  {
    "title": "Could Elon Musk’s government takeover happen in the UK? A constitutional law expert’s view",
    "description": "The UK does not have executive orders like the US. But there are still ways for the government to administratively act without parliament.",
    "link": "https://theconversation.com/could-elon-musks-government-takeover-happen-in-the-uk-a-constitutional-law-experts-view-249544",
    "timestamp": "2025-02-14T13:31:06Z"
  },
  {
    "title": "14 States Sue To Block DOGE From Uncovering Government Abuses, Slashing Waste",
    "description": "We are now firmly in the lawfare stage of the second Trump presidency, with Democrats filing a flurry of lawsuits to hinder the new administration's agenda until a strong ruling from the Supreme Court eventually sets a precedent.",
    "link": "https://www.shtfplan.com/headline-news/14-states-sue-to-block-doge-from-uncovering-government-abuses-slashing-waste",
    "timestamp": "2025-02-14T13:30:39Z"
  },
  {
    "title": "The Senate confirmed Robert Kennedy Jr. as the Secretary of Health & Human Services",
    "description": "Unsurprisingly, Donald Trump/Elon Musk got the Cabinet they wanted. That’s what happens when voters decide that they not only want to empower white supremacists in the executive branch, but they also want to ensure that the white supremacists have congression…",
    "link": "https://www.celebitchy.com/909320/the_senate_confirmed_robert_kennedy_jr_as_the_secretary_of_health_human_services/",
    "timestamp": "2025-02-14T13:30:13Z"
  },
  {
    "title": "Will Student Loans Be Cancelled If Trump Shuts Down Education Department?",
    "description": "Could borrowers see their debts wiped out if the DOE ceases to exist, or would they simply find themselves under new management?",
    "link": "https://www.forbes.com/sites/shaharziv/2025/02/14/will-student-loans-be-cancelled-if-trump-shuts-down-education-department/",
    "timestamp": "2025-02-14T13:30:00Z"
  },
  {
    "title": "The weaponisation of trade: How Trump’s tariff moves will shape a new economic world order",
    "description": "Just weeks into his second term in the White House, United States President Donald Trump has introduced a slew of trade policies aimed at exerting political pressure on other countries. What do these moves towards protectionism mean for consumers and business…",
    "link": "https://www.channelnewsasia.com/today/big-read/trump-international-trade-tariffs-protectionism-4935876",
    "timestamp": "2025-02-14T13:30:00Z"
  },
  {
    "title": "Trump demands media outlets repay millions",
    "description": "The US president has targeted Reuters, Politico, and the New York Times amid the government’s cost-saving push and funding controversy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612718-trump-media-repay-funding/",
    "timestamp": "2025-02-14T13:29:41Z"
  },
  {
    "title": "Houthis threaten military action if Trump's plan is enacted",
    "description": "The leader of the Houthis threatened that his organization will launch rockets and UAVs and will conduct attacks on the sea if US President Trump enacts his plan to relocate Gazans.",
    "link": "https://www.israelnationalnews.com/news/403936",
    "timestamp": "2025-02-14T13:29:28Z"
  },
  {
    "title": "Vance Says Sending US Troops To Ukraine 'On The Table' Ahead Of Russian Peace Talks",
    "description": "The vice president said the U.S. is considering its options for the talks between Trump and Putin, including sanctions and \"military tools.\"",
    "link": "https://www.ibtimes.com/jd-vance-us-troops-ukraine-peace-talks-russia-3763743",
    "timestamp": "2025-02-14T13:29:24Z"
  },
  {
    "title": "If you hear Trump, reciprocal tariffs are a breeze, but they aren't",
    "description": "US President Donald Trump has announced reciprocal tariffs on imports, which aim to match the tariffs imposed by other countries on American goods. While the tariffs will not be implemented immediately, the process involves examining tariff rates for each cou…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/if-you-hear-trump-reciprocal-tariffs-are-a-breeze-but-they-arent/articleshow/118250743.cms",
    "timestamp": "2025-02-14T13:27:20Z"
  },
  {
    "title": "Munich Security Conference: will 'stench of appeasement' overpower old world order?",
    "description": "Trump's talks with Putin threaten the unity that has existed between Nato, the EU and the West over supporting Ukraine",
    "link": "https://theweek.com/world-news/munich-security-conference-appeasement",
    "timestamp": "2025-02-14T13:26:08Z"
  },
  {
    "title": "Cheap Chinese EVs to flood Australian roads",
    "description": "Names like Jaecoo, Deepal and Zeekr wouldn’t be familiar to most Australians, but their cars will soon join the likes of BYD in shaking up the local car scene.",
    "link": "https://www.smh.com.au/technology/march-of-the-evs-cheap-chinese-cars-to-flood-australian-roads-20250212-p5lbhl.html",
    "timestamp": "2025-02-14T13:26:00Z"
  },
  {
    "title": "‘Full Meltdown!’ CNN’s Kaitlan Collins And Evan Perez Stunned By Trump DOJ’s ‘Spiraling Crisis’ Over Adams Case",
    "description": "CNN's Kaitlan Collins and Evan Perez were stunned by the \"full meltdown\" at Trump's DOJ over the decision to drop the case against Eric Adams.\nThe post ‘Full Meltdown!’ CNN’s Kaitlan Collins And Evan Perez Stunned By Trump DOJ’s ‘Spiraling Crisis’ Over Adams …",
    "link": "https://www.mediaite.com/news/full-meltdown-cnns-kaitlan-collins-and-evan-perez-stunned-by-trump-dojs-spiraling-crisis-over-adams-case/",
    "timestamp": "2025-02-14T13:23:23Z"
  },
  {
    "title": "Transcript: Trump Rages at Mitch McConnell in Ugly but Revealing Rants",
    "description": "The following is a lightly edited transcript of the February 14 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nOn Th…",
    "link": "https://newrepublic.com/article/191537/transcript-trump-rages-mitch-mcconnell-ugly-revealing-rants",
    "timestamp": "2025-02-14T13:22:52Z"
  },
  {
    "title": "Arizona Swing Voters Praise Trump’s Executive Order Blitz And Elon Musk ‘Cleaning House’ In Axios Focus Group",
    "description": "Arizona swing voters who flipped from having backed former President Joe Biden in 2020 to voting for President Donald Trump last year sent a clear message of support for the new administration’s aggressive start and Elon Musk’s cost cuts for “cleaning house.”…",
    "link": "https://www.mediaite.com/news/arizona-swing-voters-praise-trumps-executive-order-blitz-and-elon-musk-cleaning-house-in-axios-focus-group/",
    "timestamp": "2025-02-14T13:22:40Z"
  },
  {
    "title": "Navi’s new leadership; Infosys under scrutiny",
    "description": "Sachin Bansal will become Navi's executive chairman, focusing on strategy. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/navis-new-leadership-infosys-under-scrutiny/articleshow/118250007.cms",
    "timestamp": "2025-02-14T13:22:05Z"
  },
  {
    "title": "US State Dept Walks Back Purported $400 M Tesla Contract",
    "description": "The US State Department backtracked on a document saying it would award $400 million for electric armored cars by Tesla.",
    "link": "https://www.ibtimes.com/state-department-elon-musk-electric-armored-tesla-cars-3763739",
    "timestamp": "2025-02-14T13:21:28Z"
  },
  {
    "title": "Newman: Trump’s biggest economic vulnerability has emerged",
    "description": "Three weeks into his second presidential term, Donald Trump is largely getting his way on Cabinet nominees, deregulation, deportation and Elon Musk’s dismantling of the federal bureaucracy. His biggest priority, a huge set of tax cuts requiring Congressional …",
    "link": "https://biztoc.com/x/53cc1c8e95afbd73",
    "timestamp": "2025-02-14T13:19:36Z"
  },
  {
    "title": "B.C. axes $1,000 grocery rebate and reduces hiring because of tariff threats",
    "description": "The British Columbia government is cancelling a promised $1,000 grocery rebate and will freeze hiring of some public service positions to \"find dollars\" in its budget as it prepares for \"four years of unpredictability\" from the United States, Finance Minister…",
    "link": "https://www.nationalobserver.com/2025/02/14/news/bc-grocery-rebate-hiring-tariff-threats",
    "timestamp": "2025-02-14T13:19:36Z"
  },
  {
    "title": "Lula eyes WTO complaint over US tariff threat",
    "description": "Brazilian President Luiz Inacio Lula da Silva insisted on Friday that his country will respond if US President Donald Trump moves forward with tariffs on Brazilian aluminum and steel. Speaking in Radi...",
    "link": "https://biztoc.com/x/ba1bbc8b7697ac0c",
    "timestamp": "2025-02-14T13:19:18Z"
  },
  {
    "title": "Elias: How long, at what cost will Trump’s ‘War on California’ drag on?",
    "description": "President Donald Trump made nice during his recent three-hour stopover in Los Angeles to view damage from the Palisades Fire, possibly the most costly natural disaster in U.S. history, but his longstanding political “War on California” did not abate. He said,…",
    "link": "https://biztoc.com/x/1e4339328231ca20",
    "timestamp": "2025-02-14T13:19:13Z"
  },
  {
    "title": "Judge sets a 5-day deadline for the Trump administration to start lifting its USAID funding freeze",
    "description": "A federal judge has ordered the Trump administration to temporarily lift funding freeze shutting down U.S. humanitarian aid and development.",
    "link": "https://www.denverpost.com/2025/02/14/trump-usaid-freeze-judge-deadline/",
    "timestamp": "2025-02-14T13:18:45Z"
  },
  {
    "title": "Senators describe the Canadian flag as a symbol of national pride and growth",
    "description": "A group of Canadian senators is sharing views on the country's flag, with some calling it a symbol of pride and togetherness, and others saying it represents Canada's growth.",
    "link": "https://www.nationalobserver.com/2025/02/14/news/senators-describe-canadian-flag-symbol-national-pride-growth",
    "timestamp": "2025-02-14T13:18:03Z"
  },
  {
    "title": "Judge Sets Five-Day Deadline For Trump Administration to Start Lifting USAID Funding Freeze",
    "description": "The ruling was the first to challenge the Republican Administration's funding freeze.",
    "link": "https://time.com/7225256/judge-five-day-deadline-trump-administration-lifting-usaid-funding-freeze/",
    "timestamp": "2025-02-14T13:16:42Z"
  },
  {
    "title": "Once proud Canadian Tesla owners in Canada are now embarrassed by company's CEO Elon Musk",
    "description": "The Tesla fan club recently conducted a survey among its members showing that about 80 per cent of respondents wanted to dissociate from Musk, the divisive head of Tesla and high-level adviser to U.S. President Donald Trump.",
    "link": "https://www.nationalobserver.com/2025/02/14/news/canadian-tesla-owners-canada-embarrassed-company-ceo",
    "timestamp": "2025-02-14T13:16:09Z"
  },
  {
    "title": "Sorry Stevie Wonder, We Do Need to Blame the Banks Responsible for the LA Fires",
    "description": "Stevie Wonder was one of more than two dozen superstars who performed at FireAid, a six-hour benefit concert held late last month to raise money for Los Angeles wildfire victims and, according to event organizers, support “long-term initiatives to prevent fut…",
    "link": "https://www.commondreams.org/opinion/banks-fund-la-fires",
    "timestamp": "2025-02-14T13:16:05Z"
  },
  {
    "title": "Voltaire, International Newsletter N°120",
    "description": "Voltaire, International Newsletter is a weekly newsletter on international politics. It features 10 to 15 pages of contextualized, sourced news items. Its aim is to enable you to follow the decline of the unipolar world and the emergence of a multipolar syste…",
    "link": "https://www.voltairenet.org/article221811.html",
    "timestamp": "2025-02-14T13:14:39Z"
  },
  {
    "title": "TikTok Is Finally Back on Apple & Google App Stores After Trump’s Intervention",
    "description": "After being banned on January 18, TikTok has returned to Apple and Google app stores. The app’s restoration is not permanent – Trump’s intervention has delayed the ban by 75 days, giving TikTok time to find a US buyer. The ban was due to concerns over TikTok'…",
    "link": "https://techreport.com/news/tiktok-back-on-apple-google-apps-stores-trump-intervention/",
    "timestamp": "2025-02-14T13:14:11Z"
  },
  {
    "title": "Ready to lodge 26/11 accused Tahawwur Rana in Maharashtra's jail once extradited: CM Fadnavis",
    "description": "Maharashtra Chief Minister Devendra Fadnavis confirmed the state's readiness to lodge Tahawwur Hussain Rana in jail once extradited from the US. President Donald Trump announced the approval of Rana's extradition for his involvement in the 26/11 Mumbai terror…",
    "link": "https://economictimes.indiatimes.com/news/india/ready-to-lodge-26/11-accused-tahawwur-rana-in-maharashtras-jail-once-extradited-cm-fadnavis/articleshow/118250409.cms",
    "timestamp": "2025-02-14T13:13:34Z"
  },
  {
    "title": "US State Dept Walks Back Purported $400 Mn Tesla Contract",
    "description": "The US State Department backtracked Thursday on a document saying it would award $400 million for electric armored cars by Tesla, whose chief Elon Musk has been aggressively slashing government spending on behalf of President Donald Trump.",
    "link": "https://www.ibtimes.com.au/us-state-dept-walks-back-purported-400-mn-tesla-contract-1856189",
    "timestamp": "2025-02-14T13:11:52Z"
  },
  {
    "title": "Trump’s First Month Panders to Israel",
    "description": "The Trump Administration, in place for only a little over three weeks, has gone full speed ahead in its advocacy for Israel. Donald Trump’s invitation to Israeli Prime Minister Benjamin Netanyahu to visit him at the White House, the first …\nThe post Trump’s F…",
    "link": "https://www.globalresearch.ca/trump-first-month-panders-israel/5879892",
    "timestamp": "2025-02-14T13:11:42Z"
  },
  {
    "title": "Euro zone grows by anaemic 0.1% amid threat of US tariffs",
    "description": "Latest Eurostat figures were better than initial estimate of 0% growth",
    "link": "https://www.irishtimes.com/business/2025/02/14/euro-zone-grows-by-anaemic-01-amid-threat-of-us-tariffs/",
    "timestamp": "2025-02-14T13:11:35Z"
  },
  {
    "title": "Mexico Threatens To Sue Google Over 'Gulf Of America' Name Change",
    "description": "Mexico on Thursday threatened to sue Google over its changing the Gulf of Mexico's name to \"Gulf of America\" for Maps users in the United States to comply with President Donald Trump's executive order.",
    "link": "https://www.ibtimes.com.au/mexico-threatens-sue-google-over-gulf-america-name-change-1856187",
    "timestamp": "2025-02-14T13:11:03Z"
  },
  {
    "title": "Trump Eyes Summit With Xi-Putin, Shaking Up World Order",
    "description": "Donald Trump unveiled an extraordinary vision of a shake-up to the world order Thursday, eyeing a three-way summit with the Russian and Chinese leaders just a day after saying he had agreed with Vladimir Putin to start Ukraine peace talks.",
    "link": "https://www.ibtimes.com.au/trump-eyes-summit-xi-putin-shaking-world-order-1856186",
    "timestamp": "2025-02-14T13:11:00Z"
  },
  {
    "title": "Crypto Kingpin Alexander Vinnik Handed Over To Russia: US Official",
    "description": "The United States has released Russian cryptocurrency kingpin Alexander Vinnik, as part of an exchange deal that saw Moscow free US teacher Marc Fogel, a senior US official said Thursday.",
    "link": "https://www.ibtimes.com.au/crypto-kingpin-alexander-vinnik-handed-over-russia-us-official-1856185",
    "timestamp": "2025-02-14T13:09:57Z"
  },
  {
    "title": "Stocks Diverge, Dollar Dips Tracking Trump Tariffs",
    "description": "Stock markets diverged and the dollar dipped Friday as traders tracked US President Donald Trump's latest tariff announcement, economic data and earnings.",
    "link": "https://www.ibtimes.com.au/stocks-diverge-dollar-dips-tracking-trump-tariffs-1856184",
    "timestamp": "2025-02-14T13:09:55Z"
  },
  {
    "title": "Taiwan's Lai Vows More Investment In US As Chip Tariffs Loom",
    "description": "Taiwan will boost investment in the United States and on its own defences, President Lai Ching-te said Friday, as Taipei seeks to head off US President Donald Trump's threats of tariffs on its semiconductor chips.",
    "link": "https://www.ibtimes.com.au/taiwans-lai-vows-more-investment-us-chip-tariffs-loom-1856182",
    "timestamp": "2025-02-14T13:08:59Z"
  },
  {
    "title": "Federal employee layoffs begin after Trump and Musk order cuts",
    "description": "The United States government is beginning a new wave of mass firings following President Donald Trump and Elon Musk’s order for sweeping cuts. It comes as the Trump administration advised all federal agencies to fire probationary employees, workers who have b…",
    "link": "https://biztoc.com/x/8480ef096a803f50",
    "timestamp": "2025-02-14T13:08:58Z"
  },
  {
    "title": "Bordeaux Wine Harvest Drops To Lowest Level Since 1991",
    "description": "Cold weather, disease and capacity cuts pushed wine production in France's Bordeaux region last year to a low not seen in three-and-a-half decades, the local industry body said Friday.",
    "link": "https://www.ibtimes.com.au/bordeaux-wine-harvest-drops-lowest-level-since-1991-1856181",
    "timestamp": "2025-02-14T13:08:57Z"
  },
  {
    "title": "Zelensky Shares Footage Of Russian 'High Explosive Warhead' Striking Chernobyl Power Plant",
    "description": "The drone strike caused a fire on the protective shell above the crippled reactor but no radiation was believed to have leaked.",
    "link": "https://www.ibtimes.com/video-drone-strike-chernobyl-nuclear-plant-ukraine-3763741",
    "timestamp": "2025-02-14T13:07:25Z"
  }
]