[
  {
    "title": "Errol Morris’ New Doc Takes On Manson, Mind Control, and the CIA. Even He’s Not Sure He Believes It.",
    "description": "What if the Manson murders weren’t what we thought?",
    "link": "https://slate.com/culture/2025/03/charles-manson-murders-chaos-netflix-documentary-true-crime.html",
    "timestamp": "2025-03-08T10:50:00Z"
  },
  {
    "title": "Trump's populist platform gives way to billionaires' agenda",
    "description": "Elon Musk greets then-President-elect Donald Trump as he arrives to attend a viewing of the launch of the sixth test flight of the SpaceX Starship rocket, in Brownsville, Texas, on Nov. 19, 2024.",
    "link": "https://biztoc.com/x/221a88b119181169",
    "timestamp": "2025-03-08T10:49:54Z"
  },
  {
    "title": "I Am So Sick of Being Outraged at Trump. So I Spent a Day in MAGA Land.",
    "description": "We live in two different realities. I poked my head into the other one.",
    "link": "https://slate.com/technology/2025/03/maga-feeds-trump-praise-compared-liberal-doom.html",
    "timestamp": "2025-03-08T10:40:00Z"
  },
  {
    "title": "Trump appoints 2 from Fox News to Kennedy Center board",
    "description": "WASHINGTON — U.S. President Donald Trump said on Friday he was appointing Fox News host Laura Ingraham and Fox Business anchor Maria Bartiromo to the board of the John F. Kennedy Center for the Performing Arts.\n\n\nIn February, weeks after taking office, Trump …",
    "link": "https://www.voanews.com/a/trump-appoints-2-from-fox-news-to-kennedy-center-board/8003496.html",
    "timestamp": "2025-03-08T10:36:09Z"
  },
  {
    "title": "‘Hell Plan’: Israel’s scheme for Gaza",
    "description": "Could phase two of the Gaza ceasefire  be dead even before it gets underway?",
    "link": "https://www.aljazeera.com/program/the-listening-post/2025/3/8/hell-plan-israels-scheme-for-gaza",
    "timestamp": "2025-03-08T10:32:27Z"
  },
  {
    "title": "Trump cuts Columbia University $400m funding over anti-Semitism claims",
    "description": "President Donald Trump’s administration said Friday it was cutting $400 million in federal grants to Columbia University, accusing it of failing to protect Jewish students from harassment as protesters rallied against Israel’s offensive in Gaza. Four governme…",
    "link": "https://punchng.com/trump-cuts-columbia-university-400m-funding-over-anti-semitism-claims/",
    "timestamp": "2025-03-08T10:31:56Z"
  },
  {
    "title": "Zelensky seeks more sanctions as Russian strikes kill 14",
    "description": "Ukrainian President Volodymyr Zelensky on Saturday called for more sanctions against Russia as overnight strikes killed at least 14 people and wounded dozens more, days ahead of talks between US and Ukrainian negotiators aimed at securing a truce. Separately,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-seeks-more-sanctions-as-russian-strikes-kill-14/articleshow/118803351.cms",
    "timestamp": "2025-03-08T10:25:11Z"
  },
  {
    "title": "US cancels $400M in funding to Columbia University",
    "description": "NEW YORK — U.S. President Donald Trump's administration said it had canceled grants and contracts worth about $400 million to Columbia University because of what it described as antisemitic harassment on and near the school's New York City campus.\n\n\nFriday's …",
    "link": "https://www.voanews.com/a/us-cancels-400m-in-funding-to-columbia-university/8003492.html",
    "timestamp": "2025-03-08T10:17:15Z"
  },
  {
    "title": "Bitcoin falls as Trump’s executive order disappoints crypto investors",
    "description": "Bitcoin fell after US President Donald’s executive order disappointed markets. The decline in cryptocurrencies mirrors the downtrend in the US stock markets amid fears of a widening global trade war.\nUS President Donald Trump signed an executive order to esta…",
    "link": "https://biztoc.com/x/b02c46e6d35ba73b",
    "timestamp": "2025-03-08T10:16:47Z"
  },
  {
    "title": "Stock market today: Wall Street ends its wild week with what else but more swings",
    "description": "Stock market today: Wall Street ends its wild week with what else but more swingswsbtv.com",
    "link": "https://www.wsbtv.com/news/stock-market-today/WT6TGLAT4ZBKBEOOHGLOILR7TU/",
    "timestamp": "2025-03-08T10:15:14Z"
  },
  {
    "title": "‘It’s like a whipsaw’: Donald Trump’s tariff U-turns unnerve businesses and investors - Financial Times",
    "description": "‘It’s like a whipsaw’: Donald Trump’s tariff U-turns unnerve businesses and investorsFinancial Times Trump hits pause on tariffs - but still sees them as vital toolBBC.com With Trump’s Tariff Reprieve, Mexico and Canada, Still Wary, Breathe EasierThe New York…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176649249",
    "timestamp": "2025-03-08T10:12:22Z"
  },
  {
    "title": "GOP lawmakers want to vote on DOGE cuts. That could get tricky, fast.",
    "description": "Capitol Hill Republicans want to get more involved in DOGE, hoping to make cuts permanent. With their slim majorities, it won't be easy.",
    "link": "https://www.businessinsider.com/doge-rescissions-congress-republicans-complicated-2025-3",
    "timestamp": "2025-03-08T10:09:02Z"
  },
  {
    "title": "Trump honored a cancer survivor. The boy's doctors now face his budget cuts.",
    "description": "President Donald Trump honored a child cancer survivor during his joint address to Congress amid proposing vast cuts to medical research.",
    "link": "https://www.usatoday.com/story/news/education/2025/03/08/trump-nih-cuts-baylor-college/81625680007/",
    "timestamp": "2025-03-08T10:06:47Z"
  },
  {
    "title": "In America’s Rust Belt, the effects of Trump’s trade war are already being felt",
    "description": "The hulking Republic Steel mill that dominates the landscape of Lorain, Ohio, was supposed to be ground zero for the industrial renaissance President Donald Trump promised during his first term.",
    "link": "https://biztoc.com/x/7e2cbec441a8b6dc",
    "timestamp": "2025-03-08T10:05:41Z"
  },
  {
    "title": "Trump says Ukraine 'more difficult' to deal with than Russia",
    "description": "It may be 'easier dealing with' Moscow than Kyiv, the US president told reporters in the White House.",
    "link": "https://www.bbc.com/news/articles/crknjxj3n4zo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-08T10:05:26Z"
  },
  {
    "title": "India-US trade talks: Piyush Goyal returns from Washington visit",
    "description": "Commerce and Industry Minister Piyush Goyal has returned from Washington after engaging in trade discussions with US officials. The dialogue included talks with USTR Jamieson Greer and Commerce Secretary Howard Lutnick, focusing on negotiating a bilateral tra…",
    "link": "https://economictimes.indiatimes.com/news/india/india-us-trade-talks-piyush-goyal-returns-from-washington-visit/articleshow/118802990.cms",
    "timestamp": "2025-03-08T10:04:47Z"
  },
  {
    "title": "Trump order aims to deny student loan relief to some borrowers",
    "description": "WASHINGTON — President Donald Trump is ordering changes to the Public Service Loan Forgiveness program that would disqualify workers of nonprofit groups deemed to have engaged in \"improper\" activities.\n\n\nAn executive order signed Friday directs the Education …",
    "link": "https://www.voanews.com/a/trump-order-aims-to-deny-student-loan-relief-to-some-borrowers/8003490.html",
    "timestamp": "2025-03-08T10:04:18Z"
  },
  {
    "title": "They voted for Trump in 2024. Months later, his administration fired them | CNN",
    "description": "Many federal workers lost their jobs months after casting their ballot for President Trump. They believed Trump’s policies aligned with their values and would improve their lives, but now they have been left scrambling to find work.",
    "link": "https://www.cnn.com/2025/03/08/us/fired-federal-workers-trump-voters/index.html",
    "timestamp": "2025-03-08T10:00:53Z"
  },
  {
    "title": "Social Security Administration: How slashing staff is sparking fears the system could collapse",
    "description": "Millions of Americans could soon feel the impact of the deep DOGE-driven staffing cuts being planned at the Social Security Administration.",
    "link": "https://www.cnn.com/2025/03/08/politics/social-security-administration-staff-cuts/index.html",
    "timestamp": "2025-03-08T10:00:53Z"
  },
  {
    "title": "What Trump’s Triangulation Means for Asia",
    "description": "The imploding relationship between Ukraine and the United States has upended global politics. Ukrainian forces are still slogging it out against Russian invaders without U.S. intelligence and weapons deliveries, even as President Trump tries to halt Moscow's …",
    "link": "https://freebeacon.com/columns/what-trumps-triangulation-means-for-asia/",
    "timestamp": "2025-03-08T10:00:36Z"
  },
  {
    "title": "Elizabeth Warren Asks Trump’s Crypto Czar For Public Disclosure Over Potential Conflicts Of Interest",
    "description": "US Senator Elizabeth Warren has raised concerns about David Sacks’ role as the “White House AI & Crypto Czar” and potential conflicts of interest. In a letter, the industry critic requested immediate clarifications on various issues, including the timeline of…",
    "link": "https://bitcoinist.com/elizabeth-warren-asks-trumps-crypto-czar-for-public-disclosure-over-potential-conflicts-of-interest/",
    "timestamp": "2025-03-08T10:00:30Z"
  },
  {
    "title": "Shannon Sharpe Once Again Reacts to Sammy Sosa Being Black, Kendrick Lamar’s Super Bowl Two Step Takes Over Wedding Parties, Unknown Black Mardi Gras Facts They’ll Never Teach You in School, Black Graves Moved In Virginia And More",
    "description": "Photo: Getty Images, Kevin Winter (Getty Images), Michael DeMocker (Getty Images), Jeff Bennett (AP), Kaboompics.com (Pexels), Johnnie Izquierdo (Getty Images), Screenshot: Instagram\r\nShannon Sharpe Reacts to Sammy Sosa Being Black...AgainPhoto: Getty Images\r…",
    "link": "https://www.theroot.com/shannon-sharpe-once-again-reacts-to-sammy-sosa-being-bl-1851768464",
    "timestamp": "2025-03-08T10:00:00Z"
  },
  {
    "title": "How the Terrorgram Collective’s Neo-Nazi Influencers Groomed a Teen to Kill",
    "description": "by A.C. Thompson, ProPublica and FRONTLINE, James Bandler, ProPublica, and Lukáš Diko, Investigative Center of Jan Kuciak \n \n\n \n This story contains references to homophobia, antisemitism and racism, as well as mass shootings and other violence.\n\n \n\n \n\n\n \n \n …",
    "link": "https://www.propublica.org/article/telegram-terrorgram-collective-bratislava-murders-neo-nazi-online-hate",
    "timestamp": "2025-03-08T10:00:00Z"
  },
  {
    "title": "Trump's populist platform gives way to billionaires' agenda",
    "description": "Inside President Donald Trump’s MAGA movement, the populists and politicians are starting to take swings at the plutocrats — namely billionaire White House adviser Elon Musk.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-populist-platform-gives-way-billionaires-agenda-rcna194639",
    "timestamp": "2025-03-08T10:00:00Z"
  },
  {
    "title": "The Oscar went to ‘No Other Land,’ but that might not save Masafer Yatta",
    "description": "Each morning, the first thing Alaa Hathleen does is anxiously check his WhatsApp messages with a single question on his mind: “Who will be homeless today?” Just over two weeks ago, it was his turn.",
    "link": "https://www.nbcnews.com/news/world/oscar-went-no-land-might-not-masafer-yatta-rcna195068",
    "timestamp": "2025-03-08T10:00:00Z"
  },
  {
    "title": "Lawfare Archive: How Much Trouble is NATO Really In? with Scott R. Anderson",
    "description": "From February 26, 2024: At a South Carolina campaign rally on Feb. 10, former President Donald Trump told a crowd of supporters that while he was president he told “one of the presidents of a big country” in the NATO alliance that he would not protect that co…",
    "link": "https://shows.acast.com/lawfare/episodes/lawfare-archive-how-much-trouble-is-nato-really-in-with-scot",
    "timestamp": "2025-03-08T10:00:00Z"
  },
  {
    "title": "Trump ideology looking a lot like 1960s China",
    "description": "Despite steady GDP growth, low inflation, low unemployment, and record high stock prices, Americans told pollsters in 2024 that they were deeply unhappy with how Joe Biden had handled the US economy. So they elected Donald Trump, who promised to lower costs f…",
    "link": "https://biztoc.com/x/3e26ae91d250dbf1",
    "timestamp": "2025-03-08T09:55:05Z"
  },
  {
    "title": "The Trump–Zelenskyy Confrontation: A Turning Point in Global Politics",
    "description": "The explosive meeting between US President Donald Trump and Ukrainian President Volodymyr Zelenskyy at the White House sent shockwaves through international diplomacy and media. What was supposed to be a diplomatic engagement to finalize mineral deals and rea…",
    "link": "https://www.fairobserver.com/politics/the-trump-zelenskyy-confrontation-a-turning-point-in-global-politics/",
    "timestamp": "2025-03-08T09:53:52Z"
  },
  {
    "title": "Trump tariffs: Is the US president doomed to repeat history?",
    "description": "In his inaugural address, Donald Trump harked back to William McKinley, the 25th US president, who raised tariffs on US imports from 38% to 50% in 1890, setting off a chain of events that culminated in the Great Depression half a century later.",
    "link": "https://www.livemint.com/opinion/trump-tariffs-donald-trump-trade-protectionism-us-protectionism-william-mckinley-us-tariffs-trade-war-11741426369588.html",
    "timestamp": "2025-03-08T09:52:24Z"
  },
  {
    "title": "International Women’s Day: 10 inspiring LGBTQ+ women who are changing the world in 2025",
    "description": "International Women’s Day is finally here and, of course, now is a better time than ever to highlight the queer women who are changing the world for the better. The day of recognition is an annual celebration of the strength and resilience of women across the…",
    "link": "https://www.thepinknews.com/2025/03/08/international-womens-day-10-inspiring-queer-women/",
    "timestamp": "2025-03-08T09:51:17Z"
  },
  {
    "title": "Israel's 'maximum pressure' plan if Hamas doesn't release more hostages",
    "description": "If economic and infrastructure pressures fail, Israel may escalate to targeted airstrikes and special forces raids against Hamas leadership.",
    "link": "https://www.jpost.com/israel-news/article-845193",
    "timestamp": "2025-03-08T09:50:53Z"
  },
  {
    "title": "Trump: I Paused Some Tariffs Because 'I Wanted to Help Mexico and Canada' and U.S. Carmakers",
    "description": "During a portion of an interview with the Fox Business Network set to air on Sunday’s “Sunday Morning Futures” that took place on Thursday and was aired on Friday’s broadcast of “Mornings with Maria,” President Donald Trump stated that he\nThe post Trump: I Pa…",
    "link": "https://www.breitbart.com/clips/2025/03/08/trump-i-paused-some-tariffs-because-i-wanted-to-help-mexico-and-canada-and-u-s-carmakers/",
    "timestamp": "2025-03-08T09:49:37Z"
  },
  {
    "title": "Dem Sen. Welch: Trump Should Talk with Us, 'We're Supportive of Tariffs on China'",
    "description": "On Friday’s broadcast of CNN’s “Situation Room,” Sen. Peter Welch (D-VT) argued that President Donald Trump should work with Democrats and Congress on tariffs and stated that “we’re supportive of tariffs on China. There’s a real trade imbalance there, and\nThe…",
    "link": "https://www.breitbart.com/clips/2025/03/08/dem-sen-welch-trump-should-talk-with-us-were-supportive-of-tariffs-on-china/",
    "timestamp": "2025-03-08T09:49:34Z"
  },
  {
    "title": "FDIC resists transparency on Operation Chokepoint 2.0 — Coinbase CLO",
    "description": "Coinbase’s chief legal officer accuses the FDIC of resisting transparency on Operation Chokepoint 2.0 as Trump pledges to end crypto banking restrictions.",
    "link": "https://cointelegraph.com/news/fdic-transparency-operation-chokepoint-coinbase-clo",
    "timestamp": "2025-03-08T09:47:04Z"
  },
  {
    "title": "Muslim nations adopt Arab alternative to Trump's Gaza plan",
    "description": "JEDDAH, Saudi Arabia: The Organisation of Islamic Cooperation formally adopted early Saturday (Mar 8) an Arab League counter-proposal to US President Donald Trump's plan to take over Gaza and displace its residents, calling on the international community to s…",
    "link": "https://www.channelnewsasia.com/world/organisation-islamic-cooperation-counter-proposal-us-donald-trump-gaza-displacement-riviera-4987361",
    "timestamp": "2025-03-08T09:45:36Z"
  },
  {
    "title": "US lawmaker backs tariffs, calls for changing China’s trade status",
    "description": "WASHINGTON — Calls to revoke China’s Permanent Normal Trade Relations (PNTR) status have grown louder in recent months.\n\n\nIn a memo released on the first day of his second term, President Donald Trump asked his Cabinet members to \"assess legislative proposals…",
    "link": "https://www.voanews.com/a/us-lawmaker-backs-tariffs-calls-for-changing-china-s-trade-status/8003484.html",
    "timestamp": "2025-03-08T09:41:27Z"
  },
  {
    "title": "NATO’s Rutte Urges Defense Contractors to Ramp Up, Welt Says",
    "description": "NATO Secretary General Mark Rutte said that increased defense budgets by European governments were the first step in securing the continent and that contractors need to play their part by increasing output.",
    "link": "https://financialpost.com/pmn/business-pmn/natos-rutte-urges-defense-contractors-to-ramp-up-welt-says",
    "timestamp": "2025-03-08T09:38:46Z"
  },
  {
    "title": "Muslim nations adopt Arab alternative to Trump’s Gaza plan",
    "description": "The Organisation of Islamic Cooperation formally adopted early Saturday an Arab League counter-proposal to US President Donald Trump’s plan to take over Gaza and displace its residents, calling on the international community to support the regional initiative…",
    "link": "https://www.digitaljournal.com/world/muslim-nations-adopt-arab-alternative-to-trumps-gaza-plan/article",
    "timestamp": "2025-03-08T09:35:34Z"
  },
  {
    "title": "How Trump’s $2B Court Battle Over Foreign Aid Could Reshape Executive Authority",
    "description": "Why the Trump effort to cut USAID funding without following Congressional requirements is a key front in the battle over Presidential power",
    "link": "https://www.nakedcapitalism.com/2025/03/how-trumps-2b-court-battle-over-foreign-aid-could-reshape-executive-authority.html",
    "timestamp": "2025-03-08T09:31:10Z"
  },
  {
    "title": "It's not just tariff anxiety. The market's whole bull case under Trump has been turned on its head.",
    "description": "While tariffs shock investors into risk-off mode, markets are also questioning other parts of Trump's agenda that were meant to be a boost to stocks.",
    "link": "https://www.businessinsider.com/trump-deregulation-policy-tariffs-market-crypto-antitrust-enforcement-gdp-growth-2025-3",
    "timestamp": "2025-03-08T09:30:01Z"
  },
  {
    "title": "Irish police reluctant to abide calls to boycott Israeli tech used to solve crimes",
    "description": "The technology in question was used to solve a murder trial last week.",
    "link": "https://www.jpost.com/international/article-845192",
    "timestamp": "2025-03-08T09:23:50Z"
  },
  {
    "title": "Tariffs row makes World Cup 'more exciting' - Trump",
    "description": "Donald Trump says the tensions between the United States and its 2026 World Cup co-hosts Canada and Mexico will make the tournament \"more exciting\".",
    "link": "https://www.bbc.com/sport/football/articles/c36wk4djzego",
    "timestamp": "2025-03-08T09:20:57Z"
  },
  {
    "title": "\"Russia's Objectives Not Changed\": Zelensky As Strike Kills 14 In Ukraine",
    "description": "At least 11 people were killed and 30 wounded, including five children, in Russian missile and drone attacks on Ukraine&#039;s eastern city of Dobropillia overnight, the Ukrainian Interior Ministry said on Saturday.",
    "link": "https://www.ndtv.com/world-news/russia-ukraine-war-russias-objectives-not-changed-volodymyr-zelensky-as-14-killed-in-missile-strike-in-dobropillia-7876915",
    "timestamp": "2025-03-08T09:12:45Z"
  },
  {
    "title": "China hits back at Canada with fresh agriculture tariffs",
    "description": "Tariffs on more than €2.4 billion worth of Canadian agricultural and food products to take effect on March 20th",
    "link": "https://www.irishtimes.com/business/2025/03/08/china-hits-back-at-canada-with-fresh-agriculture-tariffs/",
    "timestamp": "2025-03-08T09:12:29Z"
  },
  {
    "title": "Differing Assessments of State of the Union Speech [semi-satire]",
    "description": "This week President Donald Trump gave the longest ever State of the Union speech to Congress and the American people. Some were favorably impressed. Others were not. Rep. Jasmine Crockett (D-Tx) did not like it. \"All of us elected to offices in the government…",
    "link": "https://freerepublic.com/focus/f-bloggers/4302922/posts",
    "timestamp": "2025-03-08T09:11:03Z"
  },
  {
    "title": "Donald Trump's Silence on US Housing Crisis",
    "description": "Trump spoke to Congress for over 90 minutes on Tuesday but never mentioned the ongoing housing affordability crisis.",
    "link": "https://biztoc.com/x/6bafdeaa62f2562e",
    "timestamp": "2025-03-08T09:10:46Z"
  },
  {
    "title": "Trump Threatens Russia With Sanctions After Latest Massive Air Assault On Ukraine",
    "description": "Trump Threatens Russia With Sanctions After Latest Massive Air Assault On Ukraine",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250307-rferl03.htm",
    "timestamp": "2025-03-08T09:07:19Z"
  },
  {
    "title": "Random acts of protest: How federal workers are quietly pushing back on DOGE",
    "description": "Federal workers are turning to pronouns and pride flags to push back.",
    "link": "https://www.businessinsider.com/federal-workers-resist-trump-musk-doge-dei-emails-pronouns-2025-3",
    "timestamp": "2025-03-08T09:01:01Z"
  },
  {
    "title": "Democrats confronted over refusal to cheer during Trump address: 'Why didn't you stand?'",
    "description": "'Jesse Watters Primetime' producer Johnny Belisario asks Elizabeth Warren, Adam Schiff, Ilhan Omar and other Democrats why they wouldn't applaud anything in Trump's address.",
    "link": "https://www.foxnews.com/media/democrats-confronted-over-refusal-cheer-during-trump-address-why-didnt-you-stand",
    "timestamp": "2025-03-08T09:00:13Z"
  },
  {
    "title": "Donald Trump's Silence on US Housing Crisis",
    "description": "Trump spoke to Congress for over 90 minutes on Tuesday but never mentioned the ongoing housing affordability crisis.",
    "link": "https://www.newsweek.com/donald-trump-silence-us-housing-crisis-2040572",
    "timestamp": "2025-03-08T09:00:01Z"
  },
  {
    "title": "IRS Tax Refunds Warning Issued Over Cuts: 'Profound Effects'",
    "description": "A joint letter signed by 130 Democratic lawmakers has denounced planned staffing reductions at the federal agency.",
    "link": "https://www.newsweek.com/irs-warning-tax-refunds-democrats-letter-2041152",
    "timestamp": "2025-03-08T09:00:01Z"
  },
  {
    "title": "Europe’s Trump whisperers: Starmer, Macron and Meloni seem like an odd grouping",
    "description": "Keir Starmer, Giorgia Meloni and Emmanuel Macron are trying to keep the mercurial US president onside over Europe’s security",
    "link": "https://www.irishtimes.com/world/europe/2025/03/08/europes-trump-whisperers-starmer-macron-and-meloni/",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "Antarctica belongs to no one. But many countries are angling for a piece",
    "description": "For 65 years, Antarctica — which is one and a half times the size of Canada — has been governed by a treaty of nations. But with rising geopolitical tensions and a shifting world order, that governance system is now under pressure.",
    "link": "https://www.cbc.ca/news/antarctica-treaty-1.7473433",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "We logged every RCMP Black Hawk flight for 6 weeks. Here's what we found",
    "description": "CBC's visual investigative team tracked 68 flights by the RCMP's Black Hawk helicopters that were aimed at cracking down on illegal migration.",
    "link": "https://www.cbc.ca/news/canada/blackhawk-border-flights-1.7476242",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "How a century-old, Canada-U.S. collaboration keeps Niagara Falls shining bright — even in a trade war",
    "description": "\"Our mutual respect and admiration of the falls is a reflection of how we should really be with one another,\" says Niagara Falls N.Y., Mayor Robert Restaino.",
    "link": "https://www.cbc.ca/news/canada/hamilton/niagara-falls-illumination-board-1.7477801",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "Editorial: Trump’s big mistake on CHIPS: Backing semiconductors is a sound investment",
    "description": "In his address to Congress, President Donald Trump got it terribly wrong and was hugely hypocritical to assail the bipartisan CHIPS Act as a “horrible...",
    "link": "https://www.nydailynews.com/2025/03/07/trumps-big-mistake-on-chips-backing-semiconductors-is-a-sound-investment/",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "Trudeau's final weeks strike balance between cementing his legacy and managing a crisis",
    "description": "As Prime Minister Justin Trudeau works through what is likely to be his last week in office, he and his government appear to be moving to cement his political legacy.",
    "link": "https://www.cbc.ca/news/politics/trudeau-cements-his-legacy-1.7478128",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "What's at stake for American culture with Trump's Kennedy Center changes",
    "description": "Canadian and American artists and human rights advocates are decrying changes made by U.S. President Donald Trump at the John F. Kennedy Center for the Performing Arts in Washington, D.C. One human rights lawyer warns that attempts to \"capture culture\" are ty…",
    "link": "https://www.cbc.ca/news/world/kennedy-center-trump-changes-1.7477373",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "Canadian businesses enjoying boost in sales thanks to tariff threats, annexation talk",
    "description": "Some entrepreneurs say customers are now buying Canadian products with pride as they rally around local businesses.",
    "link": "https://www.cbc.ca/news/canada/ottawa/canadian-businesses-enjoying-boost-in-sales-thanks-to-tariff-threats-annexation-talk-1.7475708",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "In the world's largest refugee camp, Trump's USAID freeze makes a bad situation worse",
    "description": "U.S. President Donald Trump's freeze of foreign aid has caused turmoil and confusion, including in the world's largest refugee camp in Bangladesh, where a million people live — mostly stateless Rohingya refugees who fled across the border to escape a brutal m…",
    "link": "https://www.cbc.ca/news/world/rohingya-refugee-camp-trump-usaid-1.7477964",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "War games in Latvia: Once unimaginable scenarios become chilling rehearsals",
    "description": "Latvia's defense minister says there's room for an even bigger NATO presence in his country. The remarks come as Russia resupplies and rebuilds its military bases in the Baltic region and NATO struggles with the question of how to reinforce the tiny nation in…",
    "link": "https://www.cbc.ca/news/politics/latvia-canada-nato-troops-1.7478442",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "How Donald Trump is giving the euro a chance to dethrone the dollar",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e889105a-bedc-4968-b182-82d5454a4803",
    "timestamp": "2025-03-08T09:00:00Z"
  },
  {
    "title": "At least 14 killed by Russian missile strike on Ukraine",
    "description": "The Ukrainian interior ministry says Russian forces have attacked the eastern cities of Dobropillia and Bohodukhiv with ballistic missiles, multiple rockets and drones, damaging high-rise buildings and cars.",
    "link": "https://www.abc.net.au/news/2025-03-08/russian-missile-strikes-on-ukraine-kills-14-wounds-30/105027826",
    "timestamp": "2025-03-08T08:58:10Z"
  },
  {
    "title": "Russia 'appears to have ignored Trump warning' after deadly strike on Ukrainian town",
    "description": "A warning by Donald Trump to Vladimir Putin to stop \"pounding\" Ukraine or else, appears to have fallen on deaf ears after another night of devastating Russian strikes.",
    "link": "https://news.sky.com/story/russia-appears-to-have-ignored-trump-warning-after-deadly-strike-on-ukrainian-town-13323965",
    "timestamp": "2025-03-08T08:58:00Z"
  },
  {
    "title": "US adds 151,000 jobs in February amid Trump tariff war",
    "description": "The unemployment rate edged up slightly in the first full month of US President Donald Trump's second term. It comes as Trump takes aggressive tariff approaches towards key trade partners China, Canada and Mexico.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-adds-151000-jobs-in-february-amid-trump-tariff-war/articleshow/118801974.cms",
    "timestamp": "2025-03-08T08:55:17Z"
  },
  {
    "title": "China fires back in trade war with tariffs on Canadian goods",
    "description": "Beijing’s new taxes on Canadian food and agriculture follow Ottawa’s duties on Chinese Evs, steel, and aluminum Read Full Article at RT.com",
    "link": "https://www.rt.com/business/613901-china-fires-back-in-trade-war/",
    "timestamp": "2025-03-08T08:53:22Z"
  },
  {
    "title": "Trump signs an EO to establish a Strategic Bitcoin Reserve and a Digital Asset Stockpile using BTC and other digital assets forfeited in criminal or civil cases",
    "description": "Update (March 7, 3:10 am UTC): This article has been updated to add information from a White House fact sheet.\nUpdate (March 7, 12:55 am UTC): This article has been updated to add more information from David Sacks’ X post and information on US government cryp…",
    "link": "https://biztoc.com/x/840ecb576ffd62d3",
    "timestamp": "2025-03-08T08:48:57Z"
  },
  {
    "title": "Taiwan hails ‘historic’ TSMC deal with US, but will it lose the ‘silicon shield’ protecting it from China?",
    "description": "TSMC’s chief executive, CC Wei, smiled broadly as he stood next to Donald Trump in the White House on Monday, announcing what he said was the biggest foreign direct investment on US soil in history. His company – the producer of most of the world’s most advan…",
    "link": "https://biztoc.com/x/fbd49d557ccbd65c",
    "timestamp": "2025-03-08T08:48:53Z"
  },
  {
    "title": "US stops funding to South Africa – Trump",
    "description": "The US is cutting all federal funding to South Africa over a law that President Donald Trump says discriminates against white Afrikaners Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/613894-us-stops-funding-south-africa/",
    "timestamp": "2025-03-08T08:44:02Z"
  },
  {
    "title": "Muslim nations adopt Arab alternative to Trump's Gaza plan",
    "description": "The Organisation of Islamic Cooperation has endorsed an Arab League proposal to rebuild Gaza under the Palestinian Authority, in contrast to US President Donald Trump's controversial plan to displace Gaza residents. The OIC is urging international support for…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/muslim-nations-adopt-arab-alternative-to-trumps-gaza-plan/articleshow/118801811.cms",
    "timestamp": "2025-03-08T08:41:34Z"
  },
  {
    "title": "Trump organisation sues Capital One for closing bank accounts after Jan 6 attack on US Capitol",
    "description": "US News: A company owned by President Donald Trump sued Capital One on Friday, claiming the bank unjustifiably terminated over 300 of the Trump Organization's .",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-organisation-sues-capital-one-for-closing-bank-accounts-after-jan-6-attack-on-us-capitol/articleshow/118801732.cms",
    "timestamp": "2025-03-08T08:39:45Z"
  },
  {
    "title": "India Signals Readiness to Make Deeper Tariff Cuts, Trump Says",
    "description": "US President Donald Trump said India has signaled its readiness to make deeper tariff cuts, after he ramped up pressure on the country to lower trade barriers that he has said unfairly penalize American businesses.",
    "link": "https://financialpost.com/pmn/business-pmn/india-signals-readiness-to-make-deeper-tariff-cuts-trump-says",
    "timestamp": "2025-03-08T08:38:51Z"
  },
  {
    "title": "Russian strikes in Ukraine kill at least 12 people overnight",
    "description": "The intensified strikes comes days before truce negotiations are set to begin in Saudi Arabia.",
    "link": "https://www.thejournal.ie/russian-strikes-in-ukraine-2-6643500-Mar2025/",
    "timestamp": "2025-03-08T08:38:43Z"
  },
  {
    "title": "Afghan women who fled Taliban to study abroad face return after USAID freeze",
    "description": "US aid funding enabled thousands of Afghan women to study abroad or online, but many of these programmes are now suspended.",
    "link": "https://www.bbc.com/news/articles/cg4k25wlw21o",
    "timestamp": "2025-03-08T08:31:09Z"
  },
  {
    "title": "Russian strikes kill 12 in Ukraine",
    "description": "Russian strikes overnight had killed at least 12 people in eastern Ukraine as of Saturday morning, the country’s emergency service said, days ahead of talks in Saudi Arabia between US and Ukrainian negotiators aimed at a truce. A Russian assault hit the centr…",
    "link": "https://punchng.com/russian-strikes-kill-12-in-ukraine-2/",
    "timestamp": "2025-03-08T08:29:15Z"
  },
  {
    "title": "Alarmed by Trump, Poland Must Look at Nuclear Options, Premier Says (Andrew Higgins/New York Times)",
    "description": "Andrew Higgins / New York Times:\nAlarmed by Trump, Poland Must Look at Nuclear Options, Premier Says  —  As President Trump casts doubt on U.S. alliances, Poland needs to double its military manpower and consider more destructive weapons, Prime Minister Donal…",
    "link": "https://www.memeorandum.com/250308/p4",
    "timestamp": "2025-03-08T08:20:00Z"
  },
  {
    "title": "Moment Trump rips apart 'troublemaker' reporter in the Oval Office over question",
    "description": "Donald Trump brutally shut down NBC reporter Gabe Gutierrez and branded him a 'troublemaker' after he asked about a fight between Elon Musk and Marco Rubio. The tense moment occurred on Friday shortly after the president signed an executive order to set a Whi…",
    "link": "https://freerepublic.com/focus/f-chat/4302921/posts",
    "timestamp": "2025-03-08T08:11:13Z"
  },
  {
    "title": "Israel Opposed US-Hamas Talks, Netanyahu Confidante \"Lashed Out\" At Envoy",
    "description": "In February when US officials ran the idea of engaging with Hamas directly, Israeli officials advised them against it, and it came to be known through other channels that the US was moving ahead and doing it anyway.",
    "link": "https://www.ndtv.com/world-news/israel-objected-direct-us-hamas-talks-benjamin-netanyahu-confidante-lashed-out-at-envoy-7876516",
    "timestamp": "2025-03-08T08:09:49Z"
  },
  {
    "title": "Russian strikes kill at least 14, injure dozens in Ukraine, says Kyiv",
    "description": "Five children among injured in missile and drone attacks on eastern city of Dobropillia",
    "link": "https://www.irishtimes.com/world/europe/2025/03/08/russian-strikes-kill-at-least-14-injure-dozens-in-ukraine-says-kyiv/",
    "timestamp": "2025-03-08T08:09:07Z"
  },
  {
    "title": "Is Bad 'Conservative Girl' Makeup Exclusively A Republican Problem? Makeup Artists Have Thoughts.",
    "description": "Makeup artists for politicians weigh in on the divisive TikTok trend.",
    "link": "https://www.huffpost.com/entry/is-bad-conservative-girl-makeup-exclusively-a-republican-problem-makeup-artists-have-thoughts-ano_l_67c9e97ee4b07a45b4c35b68",
    "timestamp": "2025-03-08T08:00:08Z"
  },
  {
    "title": "Should You Consider Ditching Your Bluetooth Headphones?",
    "description": "Wireless headphones that use Bluetooth have cybersecurity risks, experts said. Here's what has them concerned.",
    "link": "https://www.huffpost.com/entry/kamala-harris-wired-headphones-ano_n_67c9ee8de4b0404dff300886",
    "timestamp": "2025-03-08T08:00:08Z"
  },
  {
    "title": "Trump withdraws slew of Biden-era lawsuits tied to abortion, racial discrimination, financial regs and more",
    "description": "President Donald Trump has utilized his new powers to end a slew of lawsuits initiated under former President Joe Biden, including challenges to state abortion bans, complaints of racism at police and fire departments and more.",
    "link": "https://www.foxnews.com/politics/trump-withdraws-biden-era-lawsuits-abortion-discrimination-financial-regs",
    "timestamp": "2025-03-08T08:00:06Z"
  },
  {
    "title": "Women in Iran fight for rights as economic crisis bites",
    "description": "Women bear the brunt of economic pressures and social restrictions in Iran — yet they remain the driving force for change in the country.",
    "link": "https://www.dw.com/en/women-in-iran-fight-for-rights-as-economic-crisis-bites/a-71857168",
    "timestamp": "2025-03-08T08:00:00Z"
  },
  {
    "title": "Is SAVE Dead? Tips for Borrowers Stuck in Student Loan Purgatory",
    "description": "IDR applications are frozen and the Department of Education may be abolished. But there are still things you can still prepare for repayment.",
    "link": "https://www.cnet.com/personal-finance/loans/is-save-dead-tips-for-borrowers-stuck-in-student-loan-purgatory/",
    "timestamp": "2025-03-08T08:00:00Z"
  },
  {
    "title": "\"You're The Troublemaker\": How Trump Reacted To Reporter's Musk-Rubio Query",
    "description": "Hours after reports of tensions between Elon Musk and Secretary of State Marco Rubio during a cabinet meeting, US President Donald Trump was asked about the same.",
    "link": "https://www.ndtv.com/world-news/us-reporters-musk-rubio-clash-query-trumps-troublemaker-response-7876354",
    "timestamp": "2025-03-08T07:57:09Z"
  },
  {
    "title": "XRP, ADA, SOL Fall Deeper Than Bitcoin as White House Crypto Summit Fails to Wow Traders",
    "description": "Expectations of bigger plans for the largest cryptocurrencies fell short on Friday as the first-ever presidential crypto summit ended with promises of stablecoin legislation and lower regulatory resistance.",
    "link": "https://www.coindesk.com/markets/2025/03/08/xrp-ada-sol-fall-deeper-than-bitcoin-as-white-house-crypto-summit-fails-to-wow-traders",
    "timestamp": "2025-03-08T07:56:01Z"
  },
  {
    "title": "Here's what happened during President Donald Trump's 7th week in office",
    "description": "Trump launched the week telling Americans that his administration would work to take \"America’s destiny into our own hands\" and vowed that \"this will be our greatest era.\"",
    "link": "https://www.foxnews.com/politics/heres-what-happened-during-president-donald-trumps-7th-week-office",
    "timestamp": "2025-03-08T07:55:08Z"
  },
  {
    "title": "Bitcoin forgets Strategic Reserve 'sell the news event' with 4% bounce",
    "description": "rebounded 4% on March 7 as markets shook off disappointment over the US Strategic Bitcoin Reserve.\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD recovering from local lows of $84,713 on Bitstamp.\nThese came as US President Donald Trump si…",
    "link": "https://biztoc.com/x/23be99137727333d",
    "timestamp": "2025-03-08T07:53:55Z"
  },
  {
    "title": "Ten days that shook Ukraine’s world reverberate in defiant Kyiv",
    "description": "The U.S. shift is as calamitous for Ukraine as it is shocking for European allies. But the mood remains defiant in Kyiv.",
    "link": "https://www.japantimes.co.jp/news/2025/03/08/world/politics/kyiv-defiant-mood/",
    "timestamp": "2025-03-08T07:44:00Z"
  },
  {
    "title": "The Washington Post: kowtowing to Trump?",
    "description": "The newspaper's opinion editor has handed in his notice following edict from Jeff Bezos",
    "link": "https://theweek.com/media/the-washington-post-kowtowing-to-trump",
    "timestamp": "2025-03-08T07:44:00Z"
  },
  {
    "title": "F-35 buzz in India? Air Chief AP Singh says ‘not so fast—It’s not like buying a washing machine’",
    "description": "India is at a critical juncture in its Air Force modernisation, with the United States offering the advanced F-35 stealth fighter. However, no formal proposal has been made, and concerns over cost, operational compatibility, and strategic autonomy loom large.…",
    "link": "https://economictimes.indiatimes.com/news/defence/f-35s-for-india-air-chief-says-not-a-washing-machine-we-can-buy-on-looks-us-hasnt-made-an-offer-yet/articleshow/118800686.cms",
    "timestamp": "2025-03-08T07:41:04Z"
  },
  {
    "title": "Editorial: Europe has a change of heart on defense spending",
    "description": "By insisting that Europe contribute more to its own long-term security needs, Trump has forced the European Union to consider a more coordinated approach to fending off its enemies.",
    "link": "https://www.bostonherald.com/2025/03/08/editorial-europe-has-a-change-of-heart-on-defense-spending/",
    "timestamp": "2025-03-08T07:31:20Z"
  },
  {
    "title": "'What has Modi government agreed to?' Jairam Ramesh questions Centre on Trump's tariff statement",
    "description": "Congress General Secretary Jairam Ramesh has questioned India's decision to reduce tariffs following Donald Trump's statement. With Commerce Minister Piyush Goyal in Washington, Ramesh is concerned about possible compromises affecting Indian farmers and manuf…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/what-has-modi-government-agreed-to-jairam-ramesh-questions-centre-on-trumps-tariff-statement/articleshow/118800744.cms",
    "timestamp": "2025-03-08T07:26:21Z"
  },
  {
    "title": "A man using the girls bathroom at Western Carolina University. Unreal",
    "description": "A man using the girls bathroom at Western Carolina University. Unreal",
    "link": "https://freerepublic.com/focus/f-chat/4302919/posts",
    "timestamp": "2025-03-08T07:24:17Z"
  },
  {
    "title": "Trump smacks down NBC reporter’s suggestion of a Rubio-Musk clash, calls him a ‘troublemaker’",
    "description": "President Donald Trump squelched rumors of a cabinet meeting clash on Friday,",
    "link": "https://nypost.com/2025/03/08/us-news/trump-smacks-down-nbc-reporters-suggestion-of-a-rubio-musk-clash-calls-him-a-troublemaker/",
    "timestamp": "2025-03-08T07:23:01Z"
  },
  {
    "title": "Native American news roundup, March 2-8, 2025",
    "description": "WASHINGTON — IRS staff cuts leave tribes struggling for answers \n\n\nTribal advocacy groups are expressing outrage over job cuts at the U.S. Internal Revenue Service’s Office of Indian Tribal Governments (ITG), the agency that guides federally recognized tribes…",
    "link": "https://www.voanews.com/a/8002356.html",
    "timestamp": "2025-03-08T07:17:14Z"
  }
]