[
  {
    "title": "US-China Possible Trade Talks; Apple & Amazon Disappoint",
    "description": "On today's podcast:  1) China said it is assessing the possibility of trade talks with the US, the first sign since Donald Trump hiked tariffs last month that negotiations could begin between the two sides. 2) Apple Inc.’s much-awaited quarterly earnings repo…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/us-china-possible-trade-talks-apple-amazon-disappoint",
    "timestamp": "2025-05-02T09:36:50Z"
  },
  {
    "title": "A stronger China waits to see which Trump adviser will come out on top on tariffs: sources",
    "description": "Beijing is holding off on trade talks to determine which way the wind blows in the divided White House, sources says Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/05/02/a-stronger-china-waits-to-see-which-trump-adviser-will-come-out-on-top-on-tariffs-sources",
    "timestamp": "2025-05-02T09:35:00Z"
  },
  {
    "title": "Japan's finance minister calls US Treasury holdings 'a card' in tariff talks with Trump",
    "description": "Japan's Finance Minister Katsunobu Kato suggested that the country's substantial U.S. Treasury holdings could be a negotiating tool in tariff discussions with the Trump administration. While not explicitly threatening sales, Kato implied that maintaining thes…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/japans-finance-minister-calls-us-treasury-holdings-a-card-in-tariff-talks-with-trump/articleshow/120820453.cms",
    "timestamp": "2025-05-02T09:33:49Z"
  },
  {
    "title": "Trump Border Czar Tom Homan To Illegal Immigrants: Go Home",
    "description": "By Debra Saunders via The Daily Signal | April 29, 2025\nIn all my years of covering immigration politics, I’ve never seen this kind of clarity. During a White House press briefing Monday morning, Tom Homan, President Donald Trump’s border czar, had a message …",
    "link": "https://biztoc.com/x/f12b4e1b22950109",
    "timestamp": "2025-05-02T09:31:50Z"
  },
  {
    "title": "Trump To Sign Executive Order Providing Automakers Tariff Relief",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | April 29, 2025\nPresident Donald Trump will sign an executive order on Tuesday relaxing some of his 25% tariffs on autos and auto parts. The directive is the result of conversations directly with domestic auto…",
    "link": "https://biztoc.com/x/631d8ac8343f8f84",
    "timestamp": "2025-05-02T09:31:45Z"
  },
  {
    "title": "Inside the Trump White House's early 2026 midterm strategy",
    "description": "Donald Trump has historically bad poll numbers for a president through the first 100 days in office, but the White House’s 2026 midterms strategy will run through Trump himself while trying to re-create the energy behind his 2024 campaign.",
    "link": "https://biztoc.com/x/5ff2b9c6b5c55925",
    "timestamp": "2025-05-02T09:31:42Z"
  },
  {
    "title": "Euro-Zone Inflation Holds Above Target as ECB Weighs Cuts",
    "description": "Euro-area inflation unexpectedly held steady and an underlying measure jumped in an awkward report for officials weighing how to respond to the economic hit from US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/euro-zone-inflation-holds-above-target-as-ecb-weighs-cuts",
    "timestamp": "2025-05-02T09:30:57Z"
  },
  {
    "title": "Lock Them All Up!",
    "description": "Jeb Lund\n\n\n\nIt’s high time we created accountability for the Trump 2.0 criminal syndicate.\r\n\n\r\n\n\nThe post Lock Them All Up! appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/lock-them-all-up/",
    "timestamp": "2025-05-02T09:30:00Z"
  },
  {
    "title": "May Day rally in Roanoke pushes back against Trump policies",
    "description": "Crowds gathered along Franklin Road in Roanoke Thursday evening for a May Day rally protesting Trump administration policies.",
    "link": "https://roanoke.com/news/local/government-politics/article_d318f417-05e2-4d74-8357-6d4f3c82dd90.html",
    "timestamp": "2025-05-02T09:30:00Z"
  },
  {
    "title": "The Slowdown at Ports Is a Warning of Rough Economic Seas Ahead",
    "description": "The maritime shipping industry is seeing a rise in “blank sailings,” a shift that one expert calls a “canary in the coal mine.”",
    "link": "https://www.wired.com/story/maritime-shipping-tariffs-blank-sailings/",
    "timestamp": "2025-05-02T09:30:00Z"
  },
  {
    "title": "Luxury department store Harrods suffered a cyberattack",
    "description": "Harrods confirmed a cyberattack, following similar incidents suffered by M&S and Co-op, making it the third major UK retailer targeted in one week. Luxury department store Harrods confirmed a cyberattack, threat actors attempted to gain unauthorised access to…",
    "link": "https://securityaffairs.com/177330/cyber-crime/luxury-department-store-harrods-suffered-a-cyberattack.html",
    "timestamp": "2025-05-02T09:26:07Z"
  },
  {
    "title": "Forever War: Europe Won't Accept Possible Trump Peace Plan Moves, Says Kallas",
    "description": "The U.S. hailed a new step, stating Ukraine was willing to \"give up land\", but a top Eurocrat has called that unacceptable.\nThe post Forever War: Europe Won’t Accept Possible Trump Peace Plan Moves, Says Kallas appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/05/02/forever-war-europe-wont-accept-possible-trump-peace-plan-moves-says-kallas/",
    "timestamp": "2025-05-02T09:25:23Z"
  },
  {
    "title": "Russia's war in Ukraine 'not going to end any time soon,' JD Vance says",
    "description": "His comments come shortly after the U.S. and Ukraine signed a minerals deal, an agreement that Vance said showed the White House is making progress.",
    "link": "https://www.cnbc.com/2025/05/02/russia-war-in-ukraine-not-going-to-end-any-time-soon-jd-vance-says.html",
    "timestamp": "2025-05-02T09:24:12Z"
  },
  {
    "title": "Bill Ackman Presses Trump To Pause China Tariffs, Says 'Time Becomes Our Friend' If Pressure On US Economy Is Lifted",
    "description": "Billionaire Investor Bill Ackman called on President Donald Trump to temporarily pause tariffs on Chinese imports, arguing such a move would strategically benefit U.S. trade negotiations.\nWhat Happened: Ackman, CEO of Pershing Square Capital Management, state…",
    "link": "https://biztoc.com/x/d89d7b9d9a1bc861",
    "timestamp": "2025-05-02T09:20:26Z"
  },
  {
    "title": "‘Harmful’ new report recommends ‘therapy’ for trans youth in the US",
    "description": "A US Department of Health (HHS) report into the healthcare of trans youngsters has apparently recommended the use of “exploratory therapy” – leading to fears that its opens the door to abusive and debunked conversion therapy practices. A review into the treat…",
    "link": "https://www.thepinknews.com/2025/05/02/hhs-report-trans-conversion-therapy/",
    "timestamp": "2025-05-02T09:18:36Z"
  },
  {
    "title": "Trump signs order to block funding to public radio",
    "description": "Trump alleged that both organisations have produced \"biased and partisan news coverage\".",
    "link": "https://www.bbc.com/news/articles/cly1jwe7582o",
    "timestamp": "2025-05-02T09:17:44Z"
  },
  {
    "title": "Jobs report to show hiring in aftermath of 'Liberation Day' tariffs",
    "description": "Recession fears are mounting on Wall Street.",
    "link": "https://abcnews.go.com/Business/jobs-report-show-hiring-amid-turmoil-liberation-day/story?id=121311993",
    "timestamp": "2025-05-02T09:17:38Z"
  },
  {
    "title": "US Health Agency Urges Therapy, Not Transition Treatment For Transgenders",
    "description": "Major medical groups and those who treat transgender young people sharply criticised the new report as inaccurate.",
    "link": "https://www.ndtv.com/world-news/us-healthy-agency-urges-therapy-not-transition-treatment-for-transgenders-8311708",
    "timestamp": "2025-05-02T09:16:53Z"
  },
  {
    "title": "Why is Trump unilaterally dismantling U.S. defenses?",
    "description": "Trump may reorganize agencies within the law, but his sweeping cuts to national security defies 2,000 years of great powers using deterrence and diplomacy to manage threats.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/02/world/trump-dismantling-us-defenses/",
    "timestamp": "2025-05-02T09:15:00Z"
  },
  {
    "title": "Mike Waltz “never pivoted [to Trump’s] America First agenda”",
    "description": "Charles Kupchan says Donald Trump replaced Mike Waltz because he didn’t align with the MAGA base.",
    "link": "https://www.aljazeera.com/video/quotable/2025/5/2/mike-waltz-never-pivoted-to-trumps-america-first",
    "timestamp": "2025-05-02T09:13:02Z"
  },
  {
    "title": "Dr. Phil’s Portrayal Of Trump To His Face Has Critics 'LOL'ing So Hard",
    "description": "Phil McGraw’s description of the president was... something.",
    "link": "https://www.huffpost.com/entry/dr-phil-donald-trump-prayer-speech_n_681481f7e4b0fe32871be52b",
    "timestamp": "2025-05-02T09:10:46Z"
  },
  {
    "title": "Holiday shake-up? Trump wants to rename Veterans Day and May 8 — here’s what he's calling them",
    "description": "US President Donald Trump announced plans to rename May 8 \"Victory Day\" for World War II and November 11 \"Victory Day\" for World War I, citing America's significant contributions to the wars and criticising current leaders for not celebrating victories, thoug…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/holiday-shake-up-trump-wants-to-rename-veterans-day-and-may-8-heres-what-hes-calling-them/articleshow/120818252.cms",
    "timestamp": "2025-05-02T09:10:30Z"
  },
  {
    "title": "Xi Jinping's China Says 'Door Is Open' For Talks While It Is 'Assessing' US Trade Proposal, But Warns 'Coercion' And 'Extortion' Won't Work",
    "description": "In a potential move towards de-escalation, China’s Commerce Ministry is said to be ‘assessing’ a U.S. offer to discuss the crippling 145% tariffs imposed by President Donald Trump.\nWhat Happened: The U.S. has extended an olive branch to Xi Jinping‘s China, pr…",
    "link": "https://biztoc.com/x/9d643a028ef4c9dd",
    "timestamp": "2025-05-02T09:09:41Z"
  },
  {
    "title": "Jasmine Crockett Aims for Top Democrat Spot on House Oversight Committee",
    "description": "Texas Rep. Jasmine Crockett (D) has been aiming for the top Democrat spot on the House Oversight Committee as Rep. Gerry Connolly (D-VA) plans to step aside. \nThe post Jasmine Crockett Aims for Top Democrat Spot on House Oversight Committee appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/05/02/jasmine-crockett-aims-for-top-democrat-spot-on-house-oversight-committee/",
    "timestamp": "2025-05-02T09:08:04Z"
  },
  {
    "title": "Temu ditches Chinese imports model to avoid Trump’s tariffs",
    "description": "Temu, known for its cheap Chinese imports, is shifting to a \"local fulfillment\" model, focusing on US-based merchants to avoid tariffs and maintain prices. This move comes as retailers like Shein and Alibaba face rising import taxes and the end of tariff exem…",
    "link": "https://economictimes.indiatimes.com/tech/startups/temu-ditches-chinese-imports-model-to-avoid-trumps-tariffs/articleshow/120819864.cms",
    "timestamp": "2025-05-02T09:07:29Z"
  },
  {
    "title": "How Mark Carney and Donald Trump could find common ground",
    "description": "Mark Carney's ascent as Canada's new prime minister offers a chance for a reset in the US-Canada relationship.",
    "link": "https://www.bbc.com/news/articles/cm2er30r713o",
    "timestamp": "2025-05-02T09:06:58Z"
  },
  {
    "title": "Trump signs executive order in bid to cut $1.1bn funding for pubcasters PBS and NPR",
    "description": "Donald Trump has signed an executive order seeking to cut public funding for the US public service organisations PBS and NPR, accusing them of being biased. The move comes after the White House said ea...",
    "link": "https://www.c21media.net/news/trump-signs-executive-order-in-bid-to-cut-1-1bn-funding-for-pubcasters-pbs-and-npr/",
    "timestamp": "2025-05-02T09:06:43Z"
  },
  {
    "title": "The five big challenges facing Germany's next chancellor Friedrich Merz",
    "description": "Germany’s incoming Chancellor Friedrich Merz is set take office on Tuesday 6th May. Columnist Brian Melican sifts through a daunting in-tray. Which of the pressing issues will the inexperienced Merz prioritise?",
    "link": "https://www.thelocal.de/20250502/the-five-big-challenges-facing-germanys-next-chancellor-friedrich-merz",
    "timestamp": "2025-05-02T09:06:29Z"
  },
  {
    "title": "Help Us Report on How the Department of Education Is Handling Civil Rights Cases",
    "description": "by Asia Fields, Ashley Clarke, Jodi S. Cohen and Jennifer Smith Richards \n \n\n \nSince President Donald Trump took office, his administration laid off nearly half of the Department of Education division that handles civil rights investigations and shifted its f…",
    "link": "https://www.propublica.org/getinvolved/help-propublica-report-on-department-of-ed-ocr-civil-rights-cases",
    "timestamp": "2025-05-02T09:05:00Z"
  },
  {
    "title": "'My wife gets very upset...': Trump unveils new impression criticising transgender weightlifters during Alabama speech",
    "description": "President Donald Trump delivered a speech for graduating students at the University of Alabama on Thursday. While delivering a speech to the students, Trump interspersed with impressions of transgender weightlifters. His remarks came after the English Footbal…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-transgender-weightlifter-my-wife-gets-very-upset-trump-unveils-new-impression-criticising-transgender-weightlifters-during-alabama-speech/articleshow/120819689.cms",
    "timestamp": "2025-05-02T09:04:55Z"
  },
  {
    "title": "How state agents target journalists while governments claim to protect them – stark warnings from Mexico and Honduras",
    "description": "National and local governments are thought to be responsible for almost half of all attacks on journalists in both countries.",
    "link": "https://theconversation.com/how-state-agents-target-journalists-while-governments-claim-to-protect-them-stark-warnings-from-mexico-and-honduras-255549",
    "timestamp": "2025-05-02T09:03:26Z"
  },
  {
    "title": "Trump declares May 8 as ‘Victory Day’ for World War II: ‘Going to start celebrating our victories again!’",
    "description": "The US does not have any public holidays commemorating World War II specifically, but there have been remembrance ceremonies in May, August and September across the country for decades",
    "link": "https://nypost.com/2025/05/02/us-news/trump-declares-may-8-victory-day-for-world-war-ii/",
    "timestamp": "2025-05-02T09:01:43Z"
  },
  {
    "title": "Marco Rubio picks up another title from Trump",
    "description": "Proliferation of roles raises questions about whether Rubio can play any substantial role in the US  administration",
    "link": "https://www.irishtimes.com/world/us/2025/05/02/marco-rubio-picks-up-another-title-from-trump/",
    "timestamp": "2025-05-02T09:01:20Z"
  },
  {
    "title": "KELLYANNE CONWAY: 25 ridiculous mistakes Democrats have made (so far) in 2025",
    "description": "With GOP control of the House, Senate and the White House, Democrats are the party out of power. Yet they are also a party out of touch with most Americans.",
    "link": "https://www.foxnews.com/opinion/kellyanne-conway-25-ridiculous-mistakes-democrats-have-made-so-far-2025",
    "timestamp": "2025-05-02T09:00:52Z"
  },
  {
    "title": "CBS dispute with Bill Belichick latest controversy to hit embattled network",
    "description": "Former New England Patriots head coach Bill Belichick's back-and-forth with CBS over his girlfriend's interview interruption became the network's latest controversy this week.",
    "link": "https://www.foxnews.com/media/cbs-dispute-bill-belichick-latest-controversy-hit-embattled-network",
    "timestamp": "2025-05-02T09:00:42Z"
  },
  {
    "title": "John Fetterman’s Struggle",
    "description": "John Fetterman insists he is in good health. But staffers past and present say they no longer recognize the man they once knew.",
    "link": "http://nymag.com/intelligencer/article/john-fetterman-struggle-mental-health-clinical-depression.html",
    "timestamp": "2025-05-02T09:00:20Z"
  },
  {
    "title": "UC Berkeley Received Six-Figure Donations From CCP Officials, Records Show",
    "description": "The University of California, Berkeley, received donations from a blacklisted Chinese research university, Chinese Communist Party officials, and a Beijing state-owned chemical company, according to records obtained by the Washington Free Beacon. The news com…",
    "link": "https://freebeacon.com/campus/uc-berkeley-received-six-figure-donations-from-ccp-officials-records-show/",
    "timestamp": "2025-05-02T09:00:16Z"
  },
  {
    "title": "Abrego Garcia: The poster child for the Left’s demands of endless ‘due process’",
    "description": "The Left is using Kilmar Abrego Garcia as their poster child to demand \"more due process.\" It’s time to correct this intended confusion and show just how much due process aliens receive.",
    "link": "https://www.foxnews.com/opinion/abrego-garcia-poster-child-lefts-demands-endless-due-process",
    "timestamp": "2025-05-02T09:00:04Z"
  },
  {
    "title": "Exclusive: David Hogg Says He'll Fight for Democrats Even If They Oust Him",
    "description": "The DNC vice chair touted \"great people\" stepping up to fight back against Trump and Republicans.",
    "link": "https://www.newsweek.com/exclusive-david-hogg-says-hell-fight-democrats-even-if-they-oust-him-2067037",
    "timestamp": "2025-05-02T09:00:02Z"
  },
  {
    "title": "Four Signs Russia Could Be Preparing for War With NATO",
    "description": "Developments suggest Russia could be gearing up for a potential face off with the military alliance.",
    "link": "https://www.newsweek.com/russia-preparing-war-nato-2067095",
    "timestamp": "2025-05-02T09:00:02Z"
  },
  {
    "title": "State versions of DOGE take more modest approaches than Elon Musk's shock-and-awe moves in Washington",
    "description": "States are continuing to roll out their own versions of the Department of Government Efficiency, the outside advisory commission led by tech billionaire Elon Musk that President Donald Trump tasked with cutting federal spending and staffing.",
    "link": "https://www.nbcnews.com/politics/doge/state-versions-doge-take-modest-approaches-elon-musks-shock-awe-moves-rcna203579",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Inside the Trump White House's early 2026 midterm strategy",
    "description": "Donald Trump has historically bad poll numbers for a president through the first 100 days in office, but the White House’s 2026 midterms strategy will run through Trump himself while trying to re-create the energy behind his 2024 campaign.",
    "link": "https://www.nbcnews.com/politics/2026-election/trump-white-houses-early-2026-midterm-strategy-rcna203544",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "How to Talk About Impeachment",
    "description": "The economy is foremost in voters' minds, but if presidential corruption harms the economy, there is only one recourse. \nThe post How to Talk About Impeachment appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/05/02/how-to-talk-about-impeachment/",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Government Watchdog Expects Medicaid Work Requirement Analysis by Fall",
    "description": "This fall, the U.S. Government Accountability Office expects to release a report on how much it costs to run Georgia Pathways to Coverage — the country’s only active Medicaid work requirement program — as other states and Congress consider similar programs.",
    "link": "https://kffhealthnews.org/news/article/gao-federal-watchdog-medicaid-work-requirement-analysis-georgia/",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Japan’s finance minister calls U.S. Treasuries ‘a card’ in negotiations with Trump",
    "description": "TOKYO (AP) — Japan’s massive holdings of U.S. Treasurys can be “a card on the table” in negotiations over tariffs with the Trump administration, Finance Minister Katsunobu Kato said Friday. “It does exist as a card, but I think whether we choose to use it or …",
    "link": "https://financialpost.com/pmn/japans-finance-minister-calls-u-s-treasuries-a-card-in-negotiations-with-trump",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Critics of law firms' deals with Trump are starting a firm of their own",
    "description": "The latest development in the high-stakes battle between the administration and the legal community involves former Hunter Biden attorney Abbe Lowell.",
    "link": "https://www.nbcnews.com/politics/national-security/critics-law-firms-deals-trump-are-starting-firm-rcna204271",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "A Gutted Education Department’s New Agenda: Roll Back Civil Rights Cases, Target Transgender Students",
    "description": "by Jennifer Smith Richards and Jodi S. Cohen \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn California, the federal government was deep int…",
    "link": "https://www.propublica.org/article/education-department-civil-rights-donald-trump-discrimination",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Marco Rubio's swift rise to a central spot in Trump's orbit",
    "description": "Marco Rubio was just two weeks into his new job when he got a critical lesson in being President Donald Trump’s secretary of state.",
    "link": "https://www.nbcnews.com/politics/trump-administration/marco-rubio-swift-rise-trump-orbit-rcna204243",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Jobs growth likely slowed in April as economic uncertainty reigned",
    "description": "The pace of jobs growth in the United States most likely slowed in April as economic uncertainty ramped up.",
    "link": "https://www.nbcnews.com/business/economy/april-2025-jobs-report-who-is-hiring-firing-employment-rate-rcna203942",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Asian American voters backed Trump in Nevada. Here's how they feel about him now",
    "description": "After backing Joe Biden in 2020, Asian American voters in Nevada swung decisively toward Donald Trump in 2024. Now, they reflect on how his presidency is going so far.",
    "link": "https://www.npr.org/2025/05/02/nx-s1-5352896/nevada-asian-voters-trump",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "Anti-flouride, pro-ivermectin bills moving swiftly in Louisiana Legislature amid MAHA push",
    "description": "The proposed changes are linked to Robert F. Kennedy Jr., who this year was appointed to run the nation’s health department under President Donald Trump.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/louisiana-fluoride-ivermectin-maha-rfk-jr/article_e81724d3-a6b1-5fde-8857-1c2075579c9a.html",
    "timestamp": "2025-05-02T09:00:00Z"
  },
  {
    "title": "China ‘evaluating’ US offer to negotiate tariffs, Beijing’s door is ‘open’",
    "description": "Beijing is \"evaluating\" an offer from Washington to hold talks over US President Donald Trump's crippling tariffs, China's Commerce Ministry said on Friday, signalling a potential de-escalation in the trade war that has roiled global markets.",
    "link": "https://nypost.com/2025/05/02/world-news/china-evaluating-us-offer-to-negotiate-tariffs-beijings-door-is-open/",
    "timestamp": "2025-05-02T08:59:49Z"
  },
  {
    "title": "Can Europe cut its dependence on US credit card firms?",
    "description": "Since Donald Trump has returned to power, concerns have been mounting across Europe about existing dependencies on the United States, and whether they could become a risk to European security. One such area now under scrutiny is digital payments.\nThe presiden…",
    "link": "https://biztoc.com/x/dd353b9bf4a0f08f",
    "timestamp": "2025-05-02T08:58:47Z"
  },
  {
    "title": "Donald Trump's Assault On PBS And NPR Takes Another Turn",
    "description": "The president tried an all-too-familiar tactic to defund what the White House called \"radical, woke propaganda.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-pbs-npr-cease-federal-funding_n_681483a8e4b0fe32871be7e5",
    "timestamp": "2025-05-02T08:58:18Z"
  },
  {
    "title": "Right now, China occupies Bagram air base in Afghanistan: President Trump",
    "description": "Donald Trump claimed China now occupies Bagram Air Base in Afghanistan, which the US vacated in July 2021. He criticized the Biden administration's withdrawal, linking it to Russian President Vladimir Putin's decision to invade Ukraine. Trump emphasized Bagra…",
    "link": "https://economictimes.indiatimes.com/news/defence/right-now-china-occupies-bagram-air-base-in-afghanistan-president-trump/articleshow/120819572.cms",
    "timestamp": "2025-05-02T08:52:16Z"
  },
  {
    "title": "S&P cuts US growth forecast sharply but rules out chances of a recession",
    "description": "S&P Global Ratings has revised its US GDP predictions. The forecast for 2025 is down to 1.5 percent. The projection for 2026 is now 1.7 percent. This adjustment follows uncertainties from US trade policies. S&P also lowered growth forecasts for India, Canada,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/sp-cuts-us-growth-forecast-sharply-but-rules-out-chances-of-a-recession/articleshow/120819519.cms",
    "timestamp": "2025-05-02T08:50:19Z"
  },
  {
    "title": "Secretary of State Rubio now has double role as he takes over Walz’s old job as national security adviser",
    "description": "Secretary of State Marco Rubio has been thrown into two top national security jobs at once as President Donald Trump presses forward with his top-to-bottom revamp of U.S. foreign policy, upending not only longstanding policies that the former Florida senator …",
    "link": "https://biztoc.com/x/4b05677258fdc032",
    "timestamp": "2025-05-02T08:47:43Z"
  },
  {
    "title": "Explained: Ukraine's Metals Production, Resources And Development Projects",
    "description": "In 2024, Ukraine exported goods worth $41.6 billion, of which metals/metals products accounted for $4.4 billion or 11% of the total, according to the customs service.",
    "link": "https://www.ndtv.com/world-news/explained-ukraines-metals-production-resources-and-development-projects-8311474",
    "timestamp": "2025-05-02T08:46:34Z"
  },
  {
    "title": "One Hundred Days of Lawlessness",
    "description": "The second Trump administration has finally awoken the world to the existential dangers posed by America’s unilateralist presidency, which itself evolved over the course of many decades of legal theorizing and political paradigm shifts. The question now is wh…",
    "link": "https://www.project-syndicate.org/onpoint/trump-100-days-of-lawlessness-what-to-do-about-it-by-harold-hongju-koh-2025-05",
    "timestamp": "2025-05-02T08:46:30Z"
  },
  {
    "title": "May Day anti-Trump protests in Richmond show support for workers' rights",
    "description": "The Richmond rally was organized by 50501VA, an independent wing of the \"50 Protest, 50 States, 1 Movement\" grassroots campaign that sprouted after President Donald Trump's second term began.",
    "link": "https://richmond.com/news/local/government-politics/article_27fb0c7b-dfb3-4dc1-bba5-fd90749fafcc.html",
    "timestamp": "2025-05-02T08:45:00Z"
  },
  {
    "title": "Trump radically remade the US food system in just 100 days",
    "description": "The people who grow and sell America's food no longer trust the USDA. We made a timeline to show you what happened.",
    "link": "http://grist.org/food-and-agriculture/trump-usda-food-system-agriculture-first-100-days/",
    "timestamp": "2025-05-02T08:45:00Z"
  },
  {
    "title": "Apple CEO says Trump’s tariffs could cost company $900 million this quarter",
    "description": "Tariffs could add $900 million to Apple’s costs this quarter, Apple CEO Tim Cook said on Thursday, as he revealed the tech giant was shifting production of iPhones sold in the United States from China to India.",
    "link": "https://www.cnn.com/2025/05/02/tech/china-apple-trump-tariffs-tim-cook-intl-hnk",
    "timestamp": "2025-05-02T08:44:01Z"
  },
  {
    "title": "Finland fifth in press freedom rankings as global media faces \"unprecedented, critical\" challenge",
    "description": "In its latest report, Reporters Without Borders (RSF) note that, for the first time in the history of the index, the conditions for practising journalism are \"difficult\" or \"very serious\" in over half of the world's countries.",
    "link": "https://yle.fi/a/74-20159341",
    "timestamp": "2025-05-02T08:39:31Z"
  },
  {
    "title": "Iran must 'walk away' from all uranium enrichment, Rubio says",
    "description": "(Reuters) - Iran has to 'walk away' from uranium enrichment and long-range missile development and it should allow American inspectors of its facilities, U.S. Secretary of State Marco Rubio said on Thursday as a round of nuclear talks was postponed. Read full…",
    "link": "https://www.thestar.com.my/news/world/2025/05/02/iran-must-039walk-away039-from-all-uranium-enrichment-rubio-says",
    "timestamp": "2025-05-02T08:38:00Z"
  },
  {
    "title": "Iran War Threat Grows as U.S. Nuclear Talks Falter",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA fourth round of nuclear negotiations between the United States and Iran has been postponed amid rising tensions and the threat of military action from President Donald Trump, casting doubt on the future of d…",
    "link": "https://biztoc.com/x/0093353a71e42b11",
    "timestamp": "2025-05-02T08:36:41Z"
  },
  {
    "title": "Trump Meme Coin Ethics Probe Requested Over Top Investors’ Gala Dinner",
    "description": "Senators request ethics probe into TRUMP Meme Coin as top investors to be given access to the President via Gala dinner",
    "link": "https://www.forbes.com/sites/digital-assets/2025/05/02/trump-meme-coin-ethics-probe-requested-over-top-investors-gala-dinner/",
    "timestamp": "2025-05-02T08:33:07Z"
  },
  {
    "title": "Is Alexandria Ocasio-Cortez Actually Electable?",
    "description": "\"AOC has as much chance of winning the White House as the Las Vegas Raiders have in winning the Super Bowl,\" said one political expert.",
    "link": "https://www.newsweek.com/alexandria-ocasio-cortez-democrat-election-president-2028-2064886",
    "timestamp": "2025-05-02T08:31:00Z"
  },
  {
    "title": "Andy Mukherjee: VW’s tax troubles may matter more to India than Tesla’s entry",
    "description": "Volkswagen, Audi, Lamborghini and&nbsp;Porsche don’t sell too many cars in India but the company was eyeing the country as an export base. Then came a huge tax bill that can be traced to an over-complex tariff structure. This isn’t doing India’s cause any goo…",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-india-trade-elon-musk-tesla-volkswagen-tax-dispute-auto-tariffs-skoda-exports-audi-import-porsche-auto-11746171039951.html",
    "timestamp": "2025-05-02T08:30:12Z"
  },
  {
    "title": "Iran War Threat Grows as U.S. Nuclear Talks Falter",
    "description": "Diplomatic efforts between Washington and Tehran have stalled amid rising tensions and new sanctions from U.S. President Trump.",
    "link": "https://www.newsweek.com/iran-nuclear-talks-trump-pressure-war-2067084",
    "timestamp": "2025-05-02T08:30:04Z"
  },
  {
    "title": "Why hasn’t Trump taken down the government’s climate adaptation plans?",
    "description": "The plans, created to protect government assets from climate change and save taxpayers money, remain online. It's unclear what Trump will do with them.",
    "link": "http://grist.org/climate/why-hasnt-trump-taken-down-the-governments-climate-adaptation-plans/",
    "timestamp": "2025-05-02T08:30:00Z"
  },
  {
    "title": "From suits to scrubs, Premier Furey looks back at his time leading N.L.",
    "description": "Newfoundland and Labrador Premier Andrew Furey's last day in office is May 2. With a new Liberal leader being elected on May 3, Furey sat down with the CBC's Jen White to reflect on his time in office.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/premier-furey-exit-interview-1.7523944",
    "timestamp": "2025-05-02T08:30:00Z"
  },
  {
    "title": "Pebble Founder Demos Pebble Core 2 Duo Smartwatch: ChatGPT Integration Next?",
    "description": "Key Takeaways\nPebble Founder Eric Migicovsky started a new YouTube podcast on Thursday and demoed the new Pebble Core 2 smartwatch.\nThe smartwatch comes with a bigger screen, a waterproof speaker, an adaptable backlight for night use, and a potential AI agent…",
    "link": "https://techreport.com/news/pebble-core-2-duo-smartwatch-demoed-chatgpt-integration/",
    "timestamp": "2025-05-02T08:26:18Z"
  },
  {
    "title": "Europeans continue to shun Tesla as April sales plunge",
    "description": "(Reuters) -Tesla's sales plunged across Europe in April, including an 81% drop in Sweden to their lowest level in 2-1/2 years, data showed on Friday, as...",
    "link": "https://finance.yahoo.com/news/teslas-sales-key-european-markets-082606170.html",
    "timestamp": "2025-05-02T08:26:06Z"
  },
  {
    "title": "U.S. tariff tsunami wrecks disproportionate havoc on African economies",
    "description": "Lesotho, a small southern African country and one of the world's least developed countries, is facing grave concerns after U.S. President Donald Trump imposed a 50 percent \"reciprocal tariff\" on it.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250501-pdo05.htm",
    "timestamp": "2025-05-02T08:25:03Z"
  },
  {
    "title": "Trump removes 'hawkish' National Security Adviser Mike Waltz",
    "description": "U.S. President Donald Trump has removed his National Security Adviser Mike Waltz and tapped him instead for the role of ambassador to the United Nations.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250501-irna02.htm",
    "timestamp": "2025-05-02T08:23:45Z"
  },
  {
    "title": "Trump Says He'll Nominate Mike Waltz to Be Next US Ambassador to UN Amid Security Reshuffle",
    "description": "US President Donald Trump announced on Thursday he intends to nominate Mike Waltz as the next US Permanent Representative to the United Nations.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/05/mil-250501-sputnik01.htm",
    "timestamp": "2025-05-02T08:23:36Z"
  },
  {
    "title": "\"It's Much Better Equipped\": Karan Adani On Kerala's Vizhinjam Port",
    "description": "The Vizhinjam International Seaport in Kerala - India&#039;s first mega transshipment container terminal - was formally inaugurated by Prime Minister Narendra Modi on Friday",
    "link": "https://www.ndtv.com/india-news/karan-adani-on-keralas-vizhinjam-port-its-much-better-equipped-8311298",
    "timestamp": "2025-05-02T08:22:17Z"
  },
  {
    "title": "Can Europe cut its dependence on US credit card firms?",
    "description": "As Visa, Mastercard, and PayPal dominate the cashless payments landscape in the EU, Europe's central bank warns about the risks of such dependence on the US payment giants. But what alternatives does Europe have? Since Donald Trump has returned to power, conc…",
    "link": "https://www.dw.com/en/can-europe-cut-its-dependence-on-us-credit-card-firms/a-72403227",
    "timestamp": "2025-05-02T08:20:00Z"
  },
  {
    "title": "Can Europe wean itself off US credit card firms?",
    "description": "Visa, Mastercard, and PayPal dominate the cashless payments landscape in the EU and the European Central Bank warns about the region's reliance on US payment giants. But what alternative does Europe have? Since Donald Trump has returned to power, Europe has b…",
    "link": "https://www.dw.com/en/can-europe-wean-itself-off-us-credit-card-firms/a-72403227",
    "timestamp": "2025-05-02T08:20:00Z"
  },
  {
    "title": "JD Vance admits Putin’s war in Ukraine won’t end ‘anytime soon’",
    "description": "U.S. President Donald Trump's efforts to end the conflict have proved fruitless so far.",
    "link": "https://www.politico.eu/article/jd-vance-says-war-ukraine-wont-end-anytime-soon/",
    "timestamp": "2025-05-02T08:19:44Z"
  },
  {
    "title": "Lai meets Japan delegation, calls for closer security, semiconductor ties",
    "description": "President Lai Ching-te (賴清德) on Thursday met with a visiting delegation from the Youth Division of Japan's Liberal Democratic Party (LDP) at the Presidential Office, with both sides calling for increased collaborations on security and semiconductors.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250501-cna04.htm",
    "timestamp": "2025-05-02T08:19:29Z"
  },
  {
    "title": "Ukraine Hails Minerals Deal As Helping Strengthen US Support For Its Security",
    "description": "A landmark minerals deal between Ukraine and the United States offers \"equal\" benefits for both sides and opportunities for investment in Ukraine and the modernization of its industry, Ukrainian President Volodymyr Zelenskyy said on May 1.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250502-rferl01.htm",
    "timestamp": "2025-05-02T08:18:26Z"
  },
  {
    "title": "U.S. signs deal with Ukraine to share profits from sale of its rare minerals",
    "description": "The United States and Ukraine have signed a long-awaited agreement granting Washington access to Ukraine's rare minerals, following months of fraught negotiations for a deal that President Donald Trump said would provide an economic incentive for the U.S. to …",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250501-irna01.htm",
    "timestamp": "2025-05-02T08:18:25Z"
  },
  {
    "title": "US readies first arms sales to Ukraine after minerals deal",
    "description": "The administration of US President Donald Trump has declared that it is making preparations for its first sale of military equipment to Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250501-presstv01.htm",
    "timestamp": "2025-05-02T08:18:24Z"
  },
  {
    "title": "US, Ukraine sign long-awaited deal pushed by Trump on rare minerals",
    "description": "The United States and Ukraine have signed a long-awaited deal on rare minerals pushed by President Donald Trump that helps Kiev repay roughly $175 billion provided to the ex-Soviet country for its defense in the ongoing war with Russia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250501-presstv02.htm",
    "timestamp": "2025-05-02T08:18:22Z"
  },
  {
    "title": "Ukraine Peace Process Moving Forward, Deal 'Closer' - US National Security Advisor",
    "description": "While the Ukraine peace process is moving forward and a deal is becoming \"closer and closer,\" it is essential for both sides to want peace and to come to the table to finalize it, US National Security Advisor Mike Waltz said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250501-sputnik01.htm",
    "timestamp": "2025-05-02T08:18:21Z"
  },
  {
    "title": "Donald Trump Declares Two New Days of Celebration",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump has declared May 8 as America's \"Victory Day for World War II\" and November 11 as \"Victory Day for World War I.\"\n\"Many of our allies and friends are celebrating May 8th as Victory Day, but we did …",
    "link": "https://biztoc.com/x/59185dd016878bf6",
    "timestamp": "2025-05-02T08:15:10Z"
  },
  {
    "title": "‘Build, baby, build:’ Canada’s new prime minister wants to make the country into an ‘energy superpower’",
    "description": "Mark Carney has promised to partner with Indigenous peoples. He's also promised to fast-track extractive energy projects.",
    "link": "http://grist.org/global-indigenous-affairs-desk/build-baby-build-canadas-new-prime-minister-wants-to-make-the-country-into-an-energy-superpower/",
    "timestamp": "2025-05-02T08:15:00Z"
  },
  {
    "title": "Donald Trump Declares Two New Days of Celebration",
    "description": "President Trump said the United States \"did more than any other Country, by far\" to win World War II.",
    "link": "https://www.newsweek.com/donald-trump-declares-two-new-days-celebration-2067085",
    "timestamp": "2025-05-02T08:13:04Z"
  },
  {
    "title": "Standard Chartered ‘watchful’ of tariff impact as profits rise",
    "description": "The company said it has been boosted by strong trading in its wealth business, which saw income rise 28% year-on-year.",
    "link": "https://www.the-independent.com/arts-entertainment/photography/wildlife-photographer-year-2021-pictures-b1912312.html",
    "timestamp": "2025-05-02T08:11:56Z"
  },
  {
    "title": "US-led effort to end war in Ukraine looks favourable to Russia, but mixed signals emerge",
    "description": "Washington-led efforts to end the Ukraine war suggest a deal favorable to Russia, with Trump echoing Kremlin talking points and signaling potential territorial concessions from Kyiv. Despite ongoing negotiations and mixed signals, a US-Ukraine mineral deal in…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-led-effort-to-end-war-in-ukraine-looks-favourable-to-russia-but-mixed-signals-emerge/articleshow/120818028.cms",
    "timestamp": "2025-05-02T08:09:41Z"
  },
  {
    "title": "Israel's war in Gaza drags on without a plan, or an exit strategy",
    "description": "Donald Trump, who, in the absence of our own leadership at home, will help decide Israel’s fate. That’s the price of failing to plan – and of governing by slogans instead of strategy.",
    "link": "https://www.jpost.com/opinion/article-852310",
    "timestamp": "2025-05-02T08:08:58Z"
  },
  {
    "title": "Tariff Tensions: Trump’s economic strategy under scrutiny",
    "description": "In January 2024, when the stock market was on the rise, Donald Trump was quick to take credit. He posted on his Truth Social platform, claiming that the rally was a response to his strong polling numbers against President Joe Biden, suggesting investors were …",
    "link": "https://m.economictimes.com/markets/stocks/news/tariff-tensions-trumps-economic-strategy-under-scrutiny/stock-market-optimism-january-2024/slideshow/120818397.cms",
    "timestamp": "2025-05-02T08:05:43Z"
  },
  {
    "title": "A fight is brewing in Indiana over who should pay Big Tech's energy bills",
    "description": "Big Tech's plan to spend about $15 billion on data centers in Indiana is fueling a big spike in power demand.",
    "link": "https://www.businessinsider.com/indiana-big-tech-energy-bill-nuclear-power-data-centers-2025-5",
    "timestamp": "2025-05-02T08:05:02Z"
  },
  {
    "title": "Iran warns US of 'destructive effects' of new sanctions on indirect talks",
    "description": "Iran has warned of the consequences of the US' contradictory behavior and provocative positions amid indirect talks between the two countries, which have seen Washington impose new sanctions on Tehran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250501-presstv02.htm",
    "timestamp": "2025-05-02T08:04:56Z"
  },
  {
    "title": "The U.S. tax loophole that made Shein and Temu rich is changing. What will happen to the brands now?",
    "description": "U.S. President Donald Trump signed an executive order on April 2 to end the de minimis exemption — a rule that allows small packages worth less than $800 US to enter the U.S. tax free — for packages from China and Hong Kong, effective Friday. Experts say the …",
    "link": "https://biztoc.com/x/67402e3da2328fec",
    "timestamp": "2025-05-02T08:04:12Z"
  }
]