[
  {
    "title": "Nancy Pelosi warns of dark days ahead under 'king' Trump: 'America is in a crisis'",
    "description": "Nancy Pelosi has warned the First Amendment is being crushed by Donald Trump and his administration. The former Speaker of the House spoke to journalists at an annual dinner for reporters covering Congress and urged resilience in the face of trying times unde…",
    "link": "https://www.rawstory.com/nancy-pelosi-2675092330/",
    "timestamp": "2026-02-05T11:28:15Z"
  },
  {
    "title": "John Cena kept his brother’s sexuality a secret for over a decade",
    "description": "John Cena fans are showering praise on the wrestler after he recalled keeping his brother’s sexuality a secret for over 10 years. A fan account for the 48-year-old former WWE wrestler shared a clip of the star explaining the moment he discovered his brother, …",
    "link": "https://www.thepinknews.com/2026/02/05/john-cena-brothers-sexuality/",
    "timestamp": "2026-02-05T11:28:04Z"
  },
  {
    "title": "Apple TV Europe Boss Jay Hunt Approached About BBC Director General Role",
    "description": "EXCLUSIVE: Apple TV executive Jay Hunt has been sounded out about becoming the next director general of the BBC. Deadline understands that Hunt, the European creative director at Apple TV, has been approached about succeeding Tim Davie, who dramatically resig…",
    "link": "http://deadline.com/2026/02/apple-tv-jay-hunt-bbc-director-general-1236709871/",
    "timestamp": "2026-02-05T11:21:10Z"
  },
  {
    "title": "Why is gold price down again and will it go below $4,917 or make a comeback? Gold fall, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Why is gold price down again and will it go below $4,917 or make a comeback? Gold prices fell with silver as the dollar strengthened. Market selling followed easing global tensions, tech stock pressure, and lower demand for precious metals.",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-gold-price-down-again-and-will-it-go-below-4917-or-make-a-comeback-gold-fall-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/127932511.cms",
    "timestamp": "2026-02-05T11:19:37Z"
  },
  {
    "title": "NATO urges 'restraint' as last US-Russia nuclear treaty expires",
    "description": "NATO Thursday urged \"responsibility and restraint\" as the New START treaty between the United States and Russia imposing limits on their nuclear arsenals expired, raising fears of a new arms race.",
    "link": "https://www.hurriyetdailynews.com/nato-urges-restraint-as-last-us-russia-nuclear-treaty-expires-218627",
    "timestamp": "2026-02-05T11:17:34Z"
  },
  {
    "title": "Securing Nigeria",
    "description": "Nigeria’s insecurity cannot be solved by foreign airstrikes or a failing state, but by rebuilding democratic, community-rooted systems of collective self-defense.",
    "link": "https://africasacountry.com/2026/02/securing-nigeria/",
    "timestamp": "2026-02-05T11:17:05Z"
  },
  {
    "title": "‘Daily Show’ Brutally Connects Trump’s Arch Excess To Life With Melania",
    "description": "Michael Kosta said the president’s interest in extreme architecture indicates one critical facet of his domestic life.",
    "link": "https://www.huffpost.com/entry/daily-show-michael-kosta-donald-trump-arch-melania_n_69846c7ae4b0befe37549a45",
    "timestamp": "2026-02-05T11:17:03Z"
  },
  {
    "title": "Canada's Carney wins admiration globally but struggles to lower food costs at home",
    "description": "OTTAWA, Feb 5 (Reuters) - Canadian Prime Minister Mark Carney has earned global admiration for openly ‌declaring the end of a global order based on rules, but he has had far less success addressing a growing and more quotidian concern at home: the rising cost…",
    "link": "https://www.thestar.com.my/news/world/2026/02/05/canada039s-carney-wins-admiration-globally-but-struggles-to-lower-food-costs-at-home",
    "timestamp": "2026-02-05T11:16:00Z"
  },
  {
    "title": "Finding the Publishing World in the Epstein Files",
    "description": "I did not make good use of my time this past weekend. I could have been doing something fulfilling like doomscrolling or playing an inane game on my phone, but instead I became an armchair detective searching for particular names",
    "link": "https://lithub.com/finding-the-publishing-world-in-the-epstein-files/",
    "timestamp": "2026-02-05T11:15:52Z"
  },
  {
    "title": "Toothless Mullahs",
    "description": "They have nothing left but to act tough. Opinion.",
    "link": "https://www.israelnationalnews.com/news/422000",
    "timestamp": "2026-02-05T11:14:00Z"
  },
  {
    "title": "UN human rights agency in 'survival mode', says chief",
    "description": "The UN human rights chief has said his agency was \"in survival mode\" due to funding shortfalls, as he launched a $400 million appeal to tackle global rights crises in 2026.",
    "link": "https://www.rte.ie/news/world/2026/0205/1556896-un-human-rights/",
    "timestamp": "2026-02-05T11:13:29Z"
  },
  {
    "title": "India made no investment commitment to US, may boost imports in future: Piyush Goyal",
    "description": "India may boost US imports to $500 billion over five years, according to Commerce Minister Piyush Goyal, amid ongoing trade negotiations.",
    "link": "https://www.thehindubusinessline.com/economy/india-made-no-investment-commitment-to-us-may-boost-imports-in-future-piyush-goyal/article70595404.ece",
    "timestamp": "2026-02-05T11:12:58Z"
  },
  {
    "title": "Canada’s Carney wins admiration globally but struggles to lower food costs at home",
    "description": "By Maria ChengOTTAWA, Feb 5 (Reuters) - Canadian Prime Minister Mark Carney has earned global admiration for openly declaring the end of a global order based on rules, b… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/canada-s-carney-wins-admiration-globally-but-struggles-to-lower-food-costs-at-home",
    "timestamp": "2026-02-05T11:03:35Z"
  },
  {
    "title": "Elizabeth Warren Warns Of Higher Prices, Fewer Choices As Trump Administration Clears ESPN's Billion-Dollar NFL Network Deal: 'Bad News'",
    "description": "On Monday, sen. Elizabeth Warren (D-Mass.) warned that NFL fans could face higher costs and fewer viewing options after federal regulators approved ESPN's sweeping acquisition of key NFL Media assets. Warren Flags Sports Streaming Consolidation Risks Taking t…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_00071786-088a-4cfb-aa31-a44260a4798a",
    "timestamp": "2026-02-05T11:01:05Z"
  },
  {
    "title": "What we know about mysterious disappearance of TV host's mother",
    "description": "Investigators say they have found signs of forced entry at the 84-year-old's home and believe she was taken against her will. In a case that has more questions than answers - here's everything we know so far.",
    "link": "https://news.sky.com/story/nancy-guthrie-what-we-know-about-mysterious-disappearance-of-tv-hosts-mother-13503569",
    "timestamp": "2026-02-05T11:01:00Z"
  },
  {
    "title": "Election officials draw on sobering 2020 lessons as Trump calls for nationalizing voting",
    "description": "Officials who faced threats in 2020 prepare for pressure from Trump.",
    "link": "https://www.salon.com/2026/02/05/election-officials-draw-on-sobering-2020-lessons-as-trump-calls-for-nationalizing-voting/",
    "timestamp": "2026-02-05T11:00:14Z"
  },
  {
    "title": "“You’re Not Going to Investigate a Federal Officer”",
    "description": "It doesn’t happen often, but local law enforcement can arrest and charge federal agents. Legal experts say there’s a moral obligation to at least try to hold federal immigration officers accountable when they violate the Constitution and the law.",
    "link": "http://www.propublica.org/article/why-local-state-police-rarely-investigate-ice-cbp-fbi",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "‘She’s Lying’: Journalist Exposes Secret Watch Lists That Trump Official Says Don’t Exist",
    "description": "“If we don’t explore more why all of these secret lists exist,” one US intelligence officer said, there could be “even more of an environment of paranoia on the ground and more tragic killings.” Despite denials from a senior Trump administration official, sec…",
    "link": "https://www.activistpost.com/shes-lying-journalist-exposes-secret-watch-lists-that-trump-official-says-dont-exist/",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "Don't fall for alleged Epstein emails stating Trump doesn't like Black girls",
    "description": "Screenshots authentically show 2013 emails from Jeffrey Epstein claiming that Donald Trump \"doesnt like black girls\" and \"calls them 'boogers.'\"",
    "link": "https://www.snopes.com//fact-check/epstein-trump-black-girls/",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "Meet the Mastermind Behind Trump’s Definition of “Woman”",
    "description": "“Big moves on Day 1,” White House senior policy strategist May Mailman crowed on X the morning of President Donald Trump’s inauguration, linking to a news article about a forthcoming executive order. Even amid the barrage of actions during the first hours of …",
    "link": "https://www.motherjones.com/politics/2026/02/trump-anti-trans-may-mailman-sports-ban-womens-bill-of-rights-terf/",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "The Assault on Ukraine’s Power Grid",
    "description": "Through attacks on Ukraine’s power plants Russia has weaponized the most frigid winter in more than a decade, Michael Holtz writes.",
    "link": "https://www.newyorker.com/news/the-lede/the-assault-on-ukraines-power-grid",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "ICE’s Private Prison Contractors Spent Millions Lobbying to Force Banks to Give Them Loans",
    "description": "Major banks have denied financing to GEO Group and CoreCivic — but legislation pushed by the firms could force their hand.\nThe post ICE’s Private Prison Contractors Spent Millions Lobbying to Force Banks to Give Them Loans appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/05/private-prison-corecivic-geo-group-ice-bank-loan/",
    "timestamp": "2026-02-05T11:00:00Z"
  },
  {
    "title": "Pemex Slashes Debt to 11 Year Low",
    "description": "Mexico's Petroleos Mexicanos reduced its debt to the lowest level in 11 years.",
    "link": "https://www.rigzone.com/news/wire/pemex_slashes_debt_to_11_year_low-05-feb-2026-182928-article/",
    "timestamp": "2026-02-05T10:59:32Z"
  },
  {
    "title": "Kristen Stewart buys historic LA movie theatre: ‘Something for the community’",
    "description": "Actor says she intends to turn rundown theatre into a community space",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/kristen-stewart-highland-park-theater-la-b2914393.html",
    "timestamp": "2026-02-05T10:56:12Z"
  },
  {
    "title": "In Pakistan, gold price rollercoaster pushes buyers to silver",
    "description": "With gold prices skyrocketing, Pakistanis are turning to buying silver to cash in on some of the bullion rush.",
    "link": "https://www.aljazeera.com/economy/2026/2/5/in-pakistan-gold-price-rollercoaster-pushes-buyers-to-silver",
    "timestamp": "2026-02-05T10:50:23Z"
  },
  {
    "title": "Trump returns to National Prayer Breakfast as faith takes center stage in second term",
    "description": "President Donald Trump returns to the National Prayer Breakfast after pledging to protect Christians and form a Justice Department task force to combat anti-Christian discrimination.",
    "link": "https://www.foxnews.com/politics/trump-returns-national-prayer-breakfast-faith-takes-center-stage-second-term",
    "timestamp": "2026-02-05T10:45:32Z"
  },
  {
    "title": "'We need to know she's alive': US news anchor issues plea for return of her abducted mother",
    "description": "In a video message, Savannah Guthrie called for proof that her 84-year-old mother Nancy Guthrie is alive.",
    "link": "https://www.thejournal.ie/savannah-guthrie-plea-abducted-mother-nancy-guthrie-us-6947672-Feb2026/",
    "timestamp": "2026-02-05T10:45:21Z"
  },
  {
    "title": "Are Republicans on Board With Trump’s Plan for a GOP Takeover of Elections? It’s Complicated.",
    "description": "It’s not what the president is asking for, but the party has a federal election plan of its own.",
    "link": "https://slate.com/news-and-politics/2026/02/trump-republican-election-takeover-save-act.html",
    "timestamp": "2026-02-05T10:45:00Z"
  },
  {
    "title": "Republican who said Sen Cassidy ‘sucks,’ gets Trump endorsement after ditching Senate bid for House run",
    "description": "President Trump has endorsed state Sen. Blake Miguez who is running for U.S. House of Representatives after dropping a U.S. Senate bid in Louisiana.",
    "link": "https://www.foxnews.com/politics/trump-endorses-blake-miguez-louisiana-house-race",
    "timestamp": "2026-02-05T10:38:35Z"
  },
  {
    "title": "Candlelight Vigil Held for Savannah Guthrie's Mom Nancy in Tucson",
    "description": "Over 500 people attended a community candlelight vigil to pray for Savannah Guthrie’s missing mom, Nancy Guthrie, at a church in Tucson, Arizona, on Wednesday, February 4. Locals gathered at St. Philip’s in the Hills Episcopal Church to show their support for…",
    "link": "https://www.usmagazine.com/celebrity-news/news/candlelight-vigil-held-for-savannah-guthries-mom-nancy-in-tucson/",
    "timestamp": "2026-02-05T10:33:13Z"
  },
  {
    "title": "The Mind is the New Battleground: Spain’s assault on social media platforms & the dangerous precedent",
    "description": "Spanish Prime Minister Pedro Sánchez has announced strict new regulations targeting social media. And although he claims they intend to promote “safety,” “accountability,” and the “protection of children,” the…aroma of the new measures is strangely familiar. …",
    "link": "https://en.protothema.gr/2026/02/05/the-mind-is-the-new-battleground-spains-assault-on-social-media-platforms-the-dangerous-precedent/",
    "timestamp": "2026-02-05T10:28:41Z"
  },
  {
    "title": "Nigeria deploys troops after 170 killed in deadly Kwara village attack",
    "description": "Gunmen targeted villagers who had rejected attempts to impose extremist rule",
    "link": "https://www.irishtimes.com/world/africa/2026/02/05/nigeria-deploys-troops-after-170-killed-in-deadly-kwara-village-attack/",
    "timestamp": "2026-02-05T10:18:55Z"
  },
  {
    "title": "How has American trade diplomacy changed under Donald Trump?",
    "description": "Even though most trade and investment is carried out without direct state intervention, trade diplomacy still shapes outcomes. Stephen Woolcock outlines the recent history of American trade diplomacy, and how it is wielded by Donald Trump. To date American tr…",
    "link": "https://blogs.lse.ac.uk/businessreview/2026/02/05/how-has-american-trade-diplomacy-changed-under-donald-trump/",
    "timestamp": "2026-02-05T10:18:40Z"
  },
  {
    "title": "Warren slams Kennedy’s 'disregard for child welfare' amid immigration crackdown",
    "description": "Warren slams Kennedy’s 'disregard for child welfare' amid immigration crackdowngo.com",
    "link": "https://abcnews.go.com/Politics/warren-slams-kennedys-disregard-child-welfare-amid-immigration/story?id=129861809",
    "timestamp": "2026-02-05T10:17:46Z"
  },
  {
    "title": "Donald Trump’s Monumental INDYCAR Announcement Could Lift NASCAR As Well, Claims Kenny Wallace",
    "description": "Donald Trump has long maintained ties to motorsports, a connection that became public last year when he attended the Daytona 500 just weeks into his second presidential term. That appearance reportedly cost the government $561,842.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_6f9aa31c-f5f1-408e-8927-3e4c5929083d",
    "timestamp": "2026-02-05T10:15:50Z"
  },
  {
    "title": "China backs Cuba against ‘external interference’ as foreign minister visits Beijing",
    "description": "BEIJING, Feb 5 (Reuters) - China firmly supports Cuba in safeguarding national sovereignty and security and “opposes unwarranted interference by external forces”, China’s… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/china-backs-cuba-against-external-interference-as-foreign-minister-visits-beijing",
    "timestamp": "2026-02-05T10:15:24Z"
  },
  {
    "title": "DOGE Lives On Through Russell Vought",
    "description": "Trump’s White House OMB director has quietly institutionalized the government demolition agenda set in motion by Elon Musk’s wrecking crew.\nThe post DOGE Lives On Through Russell Vought appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/05/doge-russell-vought-elon-musk-office-management-budget/",
    "timestamp": "2026-02-05T10:15:00Z"
  },
  {
    "title": "Savannah Guthrie shares devastating reply to mum's kidnappers after potential ransom note sent",
    "description": "Today host Savannah Guthrie's mother Nancy, 84, may have been been kidnapped from her home",
    "link": "https://www.ladbible.com/news/us-news/nancy-guthrie-savannah-mom-missing-ransom-note-369339-20260205",
    "timestamp": "2026-02-05T10:14:43Z"
  },
  {
    "title": "NFL promises ‘no planned’ ICE operations at Bad Bunny’s Super Bowl",
    "description": "The chief security officer of the National Football League (NFL) has confirmed that there will be “no planned” ICE operations at this year’s Super Bowl, which takes place on Sunday, 8 February. At a press conference on 3 February, Cathy L. Lanier, who heads u…",
    "link": "https://www.thepinknews.com/2026/02/05/nfl-promises-no-planned-ice-operations-bad-bunny-super-bowl/",
    "timestamp": "2026-02-05T10:06:44Z"
  },
  {
    "title": "Feds arrest Trumbull County man accused of threatening Trump, ICE",
    "description": "Feds arrest Trumbull County man accused of threatening Trump, ICEwfmj.com",
    "link": "https://www.wfmj.com/story/53424508/feds-arrest-trumbull-county-man-accused-of-threatening-trump-ice",
    "timestamp": "2026-02-05T10:06:12Z"
  },
  {
    "title": "Savannah Guthrie speaks out on alleged ransom note for missing mother",
    "description": "The dramatic search for Nancy Guthrie, the missing mother of NBC TODAY Show host Savannah Guthrie, continues as new developments surface following her shocking disappearance over the weekend. On Wednesday, there was an unverified report that Savannah’s brothe…",
    "link": "https://www.thebiglead.com/savannah-guthrie-statement-alleged-ransom-note-missing-mother/",
    "timestamp": "2026-02-05T10:01:16Z"
  },
  {
    "title": "America is the sole superpower again. Here's how Trump surprised the world",
    "description": "President Donald Trump has restored America's superpower status in one year, catapulting the U.S. from decline to global dominance over China and Russia.",
    "link": "https://www.foxnews.com/opinion/america-sole-superpower-again-heres-how-trump-surprised-world",
    "timestamp": "2026-02-05T10:00:59Z"
  },
  {
    "title": "MORNING GLORY: Trump can end the Dreamer standoff by taking on sanctuary cities",
    "description": "Common sense on compassion, combined with common sense on compliance with federal law, that's the sweet spot for the next phase of solving the illegal immigration crisis",
    "link": "https://www.foxnews.com/opinion/morning-glory-trump-end-dreamer-standoff-taking-sanctuary-cities",
    "timestamp": "2026-02-05T10:00:54Z"
  },
  {
    "title": "Blood thinners are a leading cause of drug-related harm. Can the risk be lowered?",
    "description": "More than 8 million people in the U.S. take blood thinners, also called anticoagulants. Many are prescribed the drugs after they develop clots following surgery.",
    "link": "https://www.nbcnews.com/health/health-news/blood-thinners-doctors-lower-risk-drug-related-harm-anticoagulants-rcna256189",
    "timestamp": "2026-02-05T10:00:41Z"
  },
  {
    "title": "Concerns grow over ICE plans to build mega warehouses for immigration detention",
    "description": "Department of Homeland Security plans to purchase and operate mega warehouses to use as immigration detention centers are raising concerns among lawmakers, local residents and government contractors.",
    "link": "https://www.nbcnews.com/politics/immigration/concerns-grow-ice-plans-build-mega-warehouses-immigration-detention-rcna257454",
    "timestamp": "2026-02-05T10:00:41Z"
  },
  {
    "title": "Poll: Nearly two-thirds of Americans say ICE has gone too far in immigration crackdown",
    "description": "In the latest PBS News/NPR/Marist poll, a majority of U.S. adults also say ICE is making Americans less safe.",
    "link": "https://www.pbs.org/newshour/politics/poll-nearly-two-thirds-of-americans-say-ice-has-gone-too-far-in-immigration-crackdown",
    "timestamp": "2026-02-05T10:00:26Z"
  },
  {
    "title": "Trump’s immigration victory in a Minnesota court is a win for all law-abiding citizens",
    "description": "Federal court rejects Minnesota's challenge to immigration enforcement, delivering a big win for Trump's operations, despite opposition..",
    "link": "https://www.foxnews.com/opinion/trumps-immigration-victory-minnesota-court-win-all-law-abiding-citizens",
    "timestamp": "2026-02-05T10:00:21Z"
  },
  {
    "title": "Ruben Gallego Introduces Bill For $20 Minimum Wage",
    "description": "The Arizona Democrat and possible Democratic presidential candidate has staked out an aggressive position on a paycheck issue.",
    "link": "https://www.huffpost.com/entry/ruben-gallego-minimum-wage-2028_n_6983d055e4b0926afe6a9d32",
    "timestamp": "2026-02-05T10:00:17Z"
  },
  {
    "title": "Epstein's Big Tech connections rattle Silicon Valley",
    "description": "The latest release of Epstein files from the Justice Department indicates that the late sex offender had wider and deeper ties in tech than previously known.",
    "link": "https://www.nbcnews.com/tech/tech-news/jeffrey-epstein-files-reveal-deep-tech-ties-musk-gates-rcna257092",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Playing the Grinch at America’s 250th Birthday Party",
    "description": "How do we celebrate the moment amidst the Trump-era constitutional collapse?\nThe post Playing the Grinch at America’s 250th Birthday Party appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/05/playing-the-grinch-at-americas-250th-birthday-party/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Childcare Providers Around the Country Are Being Targeted by Vigilante Surveillance",
    "description": "Bryce Covert\n\n\n\nIn response to bogus allegations of fraud in Minnesota, strangers are filming them, knocking on their doors, demanding to be let in. It’s scaring parents and costing providers.\r\n\n\r\n\n\nThe post Childcare Providers Around the Country Are Being Ta…",
    "link": "https://www.thenation.com/?post_type=article&p=586136",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Viral dispute over 'mediocre' comment exposes racial divides in Democrats' Texas Senate primary",
    "description": "The controversy over Texas state Rep.",
    "link": "https://www.nbcnews.com/politics/2026-election/viral-dispute-mediocre-comment-exposes-racial-divides-democrats-texas-rcna257284",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Trump Reveals Hint of Panic on ICE as Prison Camps Anger MAGA Country",
    "description": "Donald Trump just claimed in an off-the-cuff interview moment that the events in Minnesota suggest that ICE needs to use a “softer touch.” He also went out of his way to say he’s called the Governor and Minneapolis’s mayor, meaning he wants to create the impr…",
    "link": "https://newrepublic.com/article/206167/trump-reveals-hint-panic-ice-prison-camps-anger-maga-country",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "The Plot to Privatize Veteran Brain Care",
    "description": "The VA has developed elaborate capacity to treat traumatic brain injuries. Billionaires want to divert that funding to their own programs.\nThe post The Plot to Privatize Veteran Brain Care appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/05/veteran-department-veterans-affairs-traumatic-brain-injuries-beacon-act/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Democrats Need to Get Serious About Stopping Trump From Rigging the Midterms",
    "description": "Elie Mystal\n\n\n\nHere’s one idea for a coordinated response to Trump’s coordinated attacks.\r\n\n\r\n\n\nThe post Democrats Need to Get Serious About Stopping Trump From Rigging the Midterms appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=586228",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Democrats Need to Get Serious About Stopping Trump From Rigging the Midterms",
    "description": "Elie Mystal\n\n\n\nHere’s one idea for a coordinated response to Trump’s coordinated attacks.\r\n\n\r\n\n\nThe post Democrats Need to Get Serious About Stopping Trump From Rigging the Midterms appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/trump-republicans-midterms-election-rigging/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Democrats criticize cost of National Guard deployment in D.C. and its results in new report",
    "description": "National Guard members were deployed by the Trump administration in August. More than 2,000 are still in Washington.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-criticize-cost-national-guard-deployment-dc-results-new-repo-rcna257470",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Newsom Walks Thin Line on Immigrant Health as He Eyes Presidential Bid",
    "description": "Progressives are assailing Gov. Gavin Newsom for proposing to pull back coverage for some legal residents, such as refugees and asylum-seekers, while conservatives lambaste the California Democrat for using limited state funds on Medicaid coverage for immigra…",
    "link": "https://kffhealthnews.org/news/article/california-governor-gavin-newsom-immigrant-health-care-medicaid-president/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "It’s Time to Curtail the President’s Pardon Power",
    "description": "Trump has turned a constitutional safeguard into a corruption free-for-all, making an amendment to rein in pardon powers necessary—and even plausible.\nThe post It’s Time to Curtail the President’s Pardon Power appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/05/its-time-for-a-movement-for-a-constitutional-amendment-to-the-pardon-power/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Has the Mainstream Media Failed Us?",
    "description": "Laura Flanders\n\n\n\nDean Obeidallah and Joy Reid discuss independent media’s role in an increasingly undemocratic world.\r\n\n\r\n\n\nThe post Has the Mainstream Media Failed Us? appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=586137",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Rahm Emanuel Stirs the Pot",
    "description": "He’s a long shot for 2028, but even as an “also-ran,” he’ll shape the debate and the future.\nThe post Rahm Emanuel Stirs the Pot appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2026/02/05/rahm-emanuel-stirs-the-pot/",
    "timestamp": "2026-02-05T10:00:00Z"
  },
  {
    "title": "Against the “King Voice.” On the Evolution of Vocal Authority, from Orson Welles to Sarah Vowell",
    "description": "Though I have been unable to verify the quote, Orson Welles is supposed to have observed that he had a “king voice.” Welles began performing in his parents’ Kenosha, Wisconsin parlor, and toured in Shakespeare productions early in his career.",
    "link": "https://lithub.com/against-the-king-voice-on-the-evolution-of-vocal-authority-from-orson-welles-to-sarah-vowell/",
    "timestamp": "2026-02-05T09:58:36Z"
  },
  {
    "title": "Top Democrats Show Demands for Stealth Amnesty on ICE Operations via DHS Budget Battle",
    "description": "Top Democrats issued more than 40 demands for amnesty-like curbs on ICE operations late on Wednesday, amid negotiations over the 2026 budget for the Department of Homeland Security.\nThe post Top Democrats Show Demands for Stealth Amnesty on ICE Operations via…",
    "link": "https://www.breitbart.com/immigration/2026/02/05/top-democrats-demand-ice-shutdown-in-dhs-budget-battle/",
    "timestamp": "2026-02-05T09:55:19Z"
  },
  {
    "title": "American TV news host Savannah Guthrie pleads for safe return of missing mother",
    "description": "Donald Trump says ‘we are deploying all resources’ in effort to find Nancy Guthrie (84)",
    "link": "https://www.irishtimes.com/world/us/2026/02/05/american-tv-news-host-savannah-guthrie-pleads-for-safe-return-of-missing-mother/",
    "timestamp": "2026-02-05T09:54:28Z"
  },
  {
    "title": "Jimmy Kimmel Spots Something Truly Fishy In Trump's Latest Supposed Success Story",
    "description": "The late night host wants to see some receipts.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-melania-movie-box-office_n_69844c7be4b04d5037ee1b87",
    "timestamp": "2026-02-05T09:53:51Z"
  },
  {
    "title": "Trump exposed at Cologne Carnival's Rose Monday parade",
    "description": "Donald Trump, Friedrich Merz and Emmanuel Macron are all targets of satirical floats at this year's Rose Monday Parade in Cologne. But Vladimir Putin will be spared — and there is a reason for that. Cologne Carnival's Rose Monday Parade, scheduled for Februar…",
    "link": "https://www.dw.com/en/trump-to-be-exposed-at-cologne-carnivals-rose-monday-parade/a-75813785",
    "timestamp": "2026-02-05T09:53:00Z"
  },
  {
    "title": "Seth Meyers Spots The Obvious Flaw In Trump’s Super Bowl Excuse",
    "description": "It just “doesn’t track,” said the “Late Night” host, who then suggested the real reason the president isn’t heading to San Francisco.",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-super-bowl_n_69845b92e4b0befe375487b2",
    "timestamp": "2026-02-05T09:47:41Z"
  },
  {
    "title": "India Says 18% US Tariff Rate to Kick In After Joint Statement",
    "description": "India’s exports to the US will be subject to a reduced tariff rate of 18% once the two sides sign a joint statement, expected within the next four to five days, the country’s trade minister said, shedding more light on this week’s surprise agreement between t…",
    "link": "https://financialpost.com/pmn/business-pmn/india-says-18-us-tariff-rate-to-kick-in-after-joint-statement",
    "timestamp": "2026-02-05T09:41:45Z"
  },
  {
    "title": "Mass killings reported in Nigeria",
    "description": "Nigeria’s leader has said Boko Haram militants killed dozens in the state of Kwara for refusing the group’s extremist beliefs Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/632023-gunmen-kill-scores-nigeria-kwara-katsina/",
    "timestamp": "2026-02-05T09:38:52Z"
  },
  {
    "title": "FMCSA 'on-site investigating' carrier whose 'illegal alien' driver's crash killed 4 in Indiana",
    "description": "The White House itself responded to a deadly crash in Indiana's Amish country as DOT says FMCSA is on the ground going after the carrier who hired an \"illegal alien.\"",
    "link": "https://www.overdriveonline.com/regulations/article/15816517/fmcsa-onsite-investigating-carrier-whose-illegal-alien-drivers-crash-killed-4-in-indiana",
    "timestamp": "2026-02-05T09:35:52Z"
  },
  {
    "title": "Ryan Routh Sentenced to Life in Prison for Attempted Assassination of Donald Trump at Florida Golf Course",
    "description": "Ryan Wesley Routh, the 59-year-old Hawaii man who opened fire on former President Donald Trump during a golf outing in September 2024, was sentenced to life in federal prison without parole on Feb. 5, 2026, concluding one of the most high-profile political vi…",
    "link": "https://www.ibtimes.com.au/ryan-routh-sentenced-life-prison-attempted-assassination-donald-trump-florida-golf-course-1861370",
    "timestamp": "2026-02-05T09:33:06Z"
  },
  {
    "title": "Experts issue 'nuclear war is possible' warning as treaty between US and Russia ends today",
    "description": "The new START treaty between Russia and the US is set to expire today (5 February).",
    "link": "https://www.ladbible.com/news/us-news/nuclear-war-new-start-treaty-us-russia-622576-20260205",
    "timestamp": "2026-02-05T09:32:48Z"
  },
  {
    "title": "Melania documentary takes in €37,992 at UK and Ireland box office on opening weekend",
    "description": "Feature-length profile of Melania Trump takes in less than Lord Of The Rings re-release",
    "link": "https://www.irishtimes.com/culture/film/2026/02/05/melania-documentary-takes-in-37992-at-uk-and-ireland-box-office-on-opening-weekend/",
    "timestamp": "2026-02-05T09:29:46Z"
  },
  {
    "title": "Plastic surgeons group shifts stance on gender-affirming surgeries for minors",
    "description": "The American Society of Plastic Surgeons is recommending that surgeons delay gender-affirming surgeries until patients turn 19, including chest, genital and facial surgeries",
    "link": "https://www.whio.com/news/health/plastic-surgeons/5OXTCBNUHU6GLIEMEONRHXPLV4/",
    "timestamp": "2026-02-05T09:26:36Z"
  },
  {
    "title": "Nigeria deploys troops after 170 killed in deadly Kwara village attack",
    "description": "ABUJA, Feb 5 (Reuters) - ‌Nigeria's President Bola Tinubu has deployed an army battalion to Kaiama ‌district in the central Kwara state after suspected jihadist fighters killed ‌170 people in an overnight attack, his office said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/02/05/nigeria-deploys-troops-after-170-killed-in-deadly-kwara-village-attack",
    "timestamp": "2026-02-05T09:26:00Z"
  },
  {
    "title": "Bill Gates calls himself ‘foolish’ over Epstein ties",
    "description": "Microsoft founder Bill Gates says he was “foolish” to spend time with the late convicted sex offender Jeffrey Epstein Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632017-epstein-gates-foolish-apology/",
    "timestamp": "2026-02-05T09:18:05Z"
  },
  {
    "title": "Zelensky interview exposes contradiction on Ukraine war dead tally",
    "description": "Kiev fails to recognize soldiers repatriated by Russia as killed in action, its latest tally suggests Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632022-zelensky-military-casualties-discrepancy/",
    "timestamp": "2026-02-05T09:16:43Z"
  },
  {
    "title": "CNBC's Inside India newsletter: The facts — and frictions — of the U.S.-India trade deal",
    "description": "The India-U.S. trade deal is a significant breakthrough, but is laced with terms that can cause friction between the two nations.",
    "link": "https://www.cnbc.com/2026/02/05/cnbcs-inside-india-newsletter-the-facts-and-frictions-of-the-us-india-trade-deal.html",
    "timestamp": "2026-02-05T09:15:37Z"
  },
  {
    "title": "Indigenous concerns surface as Trump calls for seabed mining in Alaskan waters",
    "description": "“It really feels like another false solution.”",
    "link": "https://grist.org/indigenous/indigenous-concerns-surface-as-trump-calls-for-seabed-mining-in-alaskan-waters/",
    "timestamp": "2026-02-05T09:15:00Z"
  },
  {
    "title": "Reports: FBI arrests Maduro's Top Money Man Alex Saab, Freed by Biden in 2023",
    "description": "Colombian businessman Alex Saab, widely considered to be Nicolás Maduro's top money launderer, was arrested in Caracas on Wednesday as part of a join U.S. - Venezuela operation, several outlets reported.\nThe post Reports: FBI arrests Maduro’s Top Money Man Al…",
    "link": "https://www.breitbart.com/latin-america/2026/02/05/reports-fbi-arrests-maduros-top-money-man-alex-saab-freed-by-biden-in-2023/",
    "timestamp": "2026-02-05T09:14:08Z"
  },
  {
    "title": "Nigeria deploys troops after 170 killed in deadly Kwara village attack",
    "description": "By Camillus EbohABUJA, Feb 5 (Reuters) - Nigeria’s President Bola Tinubu has deployed an army battalion to Kaiama district in the central Kwara state after suspected jiha… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/nigeria-deploys-troops-after-170-killed-in-deadly-kwara-village-attack",
    "timestamp": "2026-02-05T09:13:43Z"
  },
  {
    "title": "Taiwan-U.S. ties are 'rock solid,' its president says, after Xi warns Trump on arms sales",
    "description": "Taiwan’s relations with the United States are “rock solid,” its president said Thursday, after Chinese President Xi Jinping stressed his country’s territorial claims to the island in a call with President Donald Trump.",
    "link": "https://www.nbcnews.com/world/asia/taiwan-us-ties-are-rock-solid-president-says-xi-warns-trump-arms-sales-rcna257524",
    "timestamp": "2026-02-05T09:10:19Z"
  },
  {
    "title": "Why did China's Xi Jinping hold back-to-back calls with Russia's Vladimir Putin & US' Donald Trump?",
    "description": "Chinese President Xi Jinping engaged in rare, back-to-back calls with Russia's Putin and US President Trump, signaling Beijing's global positioning. Discussions covered trade, Ukraine, and Iran, with China committing to increased US soybean purchases. Xi also…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/why-did-chinas-xi-jinping-hold-back-to-back-calls-with-russias-vladimir-putin-us-donald-trump/articleshow/127928875.cms",
    "timestamp": "2026-02-05T09:08:55Z"
  },
  {
    "title": "Vance heads overseas for the Winter Olympics. Then he'll stop in Armenia, Azerbaijan",
    "description": "Vice President JD Vance is heading overseas to lead President Donald Trump’s delegation to the 2026 Winter Olympics",
    "link": "https://abcnews.go.com/Sports/wireStory/vance-heads-overseas-winter-olympics-hell-stop-armenia-129872694",
    "timestamp": "2026-02-05T09:03:22Z"
  },
  {
    "title": "Today in History: February 5, White separatist convicted of murdering civil rights leader 31 years later",
    "description": "White separatist Byron De La Beckwith was convicted in Jackson, Mississippi, of murdering civil rights leader Medgar Evers in 1963 and was sentenced to life in prison.",
    "link": "https://www.denverpost.com/2026/02/05/today-in-history-february-5-white-separatist-convicted-of-murdering-civil-rights-leader-31-years-later/",
    "timestamp": "2026-02-05T09:00:57Z"
  },
  {
    "title": "Today in History: February 5, White separatist convicted of murdering civil rights leader 31 years later",
    "description": "White separatist Byron De La Beckwith was convicted in Jackson, Mississippi, of murdering civil rights leader Medgar Evers in 1963 and was sentenced to life in prison.",
    "link": "https://www.bostonherald.com/2026/02/05/today-in-history-february-5-white-separatist-convicted-of-murdering-civil-rights-leader-31-years-later/",
    "timestamp": "2026-02-05T09:00:57Z"
  },
  {
    "title": "Staff Photographers at The Washington Post All Lose Their Jobs",
    "description": "The Washington Post laid off roughly a third of its workforce yesterday, including every single one of its staff photographers, PetaPixel understands.\n[Read More]",
    "link": "https://petapixel.com/2026/02/05/staff-photographers-at-the-washington-post-all-lose-their-jobs/",
    "timestamp": "2026-02-05T09:00:28Z"
  },
  {
    "title": "U.S. interest in Alberta separatism raises red flags over what might come next",
    "description": "Communications between the Trump administration and Alberta's separatist movement raised alarm at the highest levels in Canada last week. It also raised questions about Washington's possible intentions. Some even see dangerous parallels between American effor…",
    "link": "https://www.cbc.ca/news/politics/alberta-separatism-trump-administration-9.7068999",
    "timestamp": "2026-02-05T09:00:00Z"
  },
  {
    "title": "Why Greenland’s youngest Parliamentarian says Canada matters more than ever",
    "description": "Nivi Rosing has made the leap from an Ottawa post-secondary student to playing a major role as a Greenland parliamentarian trying to fend off U.S. President Donald Trump's threats to take over her island. She says developing closer ties between Canada and Gre…",
    "link": "https://www.cbc.ca/news/world/greenland-parliament-canada-9.7074417",
    "timestamp": "2026-02-05T09:00:00Z"
  }
]