[
  {
    "title": "Trump admin. officially revokes $2.2 billion in funds for Harvard",
    "description": "In an official letter to Harvard University, the Trump Administration revoked billions in federal funding for Harvard over the university's failure to use those funds for their intended purpose of benefiting the American public.",
    "link": "https://www.israelnationalnews.com/news/408050",
    "timestamp": "2025-05-08T14:38:10Z"
  },
  {
    "title": "EU sets out possible 95 bln euro response to U.S. tariffs",
    "description": "The European Commission proposed countermeasures on up to 95 billion euros of U.S. imports if negotiations fail to remove U.S. tariffs. These measures target U.S. goods like wine, aircraft, and chemicals. The EU prefers a negotiated solution but prepares reta…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-sets-out-possible-95-bln-euro-response-to-u-s-tariffs/articleshow/121002330.cms",
    "timestamp": "2025-05-08T14:37:11Z"
  },
  {
    "title": "Bitcoin Price Nears $100,000; Coinbase Strikes $2.9 Bil Deal; Crypto Stocks Test Buy Points",
    "description": "The price of bitcoin on Thursday climbed within striking distance of $100,000 as President Donald Trump was expected to unveil a \"major trade deal\" with the U.K. Meanwhile, Coinbase reached a $2.9 billion deal to buy Deribit, a crypto options platform. Elsewh…",
    "link": "https://biztoc.com/x/34abc4c96ad6d9c5",
    "timestamp": "2025-05-08T14:36:16Z"
  },
  {
    "title": "Trump Trade War: Shipping Giant Changes Outlook; Outlines Scenarios For U.S.-China Trade Talks",
    "description": "Global shipping giant Maersk on Thursday announced better-than-expected first-quarter profit and maintained its 2025 financial guidance even as it revised lower full-year expectations for global container market volume growth amid President Donald Trump's tra…",
    "link": "https://biztoc.com/x/4f8f2931dfd593af",
    "timestamp": "2025-05-08T14:35:47Z"
  },
  {
    "title": "RFK Jr.’s Ex-Running Mate Warns Someone Is “Controlling” Him",
    "description": "RFK Jr.’s old running mate thinks someone is controlling him—and it isn’t Trump. \r\nFormer vice presidential candidate Nicole Shanahan was both surprised and dismayed by the nomination of Casey Means, a pseudoscientific doctor with zero clinical experience, fo…",
    "link": "https://newrepublic.com/post/194999/nicole-shanahan-someone-controlling-rfk-jr",
    "timestamp": "2025-05-08T14:35:43Z"
  },
  {
    "title": "Biden Hires Dem Operative To Save His Image As Trump Admin Readies To Release Hur Interview",
    "description": "Former President Joe Biden enlisted a Democratic strategist to help bolster his image as the Trump administration prepares to release Biden’s conversation with a lawyer who had notably said the 46th president has a “poor memory,” Politico reported Thursday. B…",
    "link": "https://dailycaller.com/2025/05/08/biden-hires-dem-operative-trump-moves-release-hur-interview/",
    "timestamp": "2025-05-08T14:34:28Z"
  },
  {
    "title": "WATCH LIVE: Duffy announces air traffic control overhaul amid high-profile delays, crashes",
    "description": "Transportation Secretary Sean Duffy plans to unveil a multi-billion-dollar plan to overhaul the nation’s air traffic control system Thursday, while the Federal Aviation Administration works to quickly solve technology and staffing problems in Newark and avoid…",
    "link": "https://www.pbs.org/newshour/nation/watch-live-duffy-announces-air-traffic-control-overhaul-amid-high-profile-delays-crashes",
    "timestamp": "2025-05-08T14:34:12Z"
  },
  {
    "title": "More older Americans worry Social Security won't be there for them, an AP-NORC poll finds",
    "description": "A poll finds that as the Social Security Administration undergoes massive changes and staffing cuts ushered in by the Trump administration, an increasing share of older Americans, particularly Democrats, aren’t confident the benefit will be available to them.",
    "link": "https://www.news4jax.com/health/2025/05/08/more-older-americans-worry-social-security-wont-be-there-for-them-an-ap-norc-poll-finds/",
    "timestamp": "2025-05-08T14:32:06Z"
  },
  {
    "title": "Another F/A-18 Super Hornet Went Dark Over the Red Sea",
    "description": "A second F/A-18 Super Hornet was lost from the USS Harry S. Truman amid mechanical failure, Houthi threats, and operational mishaps, showcasing the region’s volatility.\nThe post Another F/A-18 Super Hornet Went Dark Over the Red Sea appeared first on The Nati…",
    "link": "https://nationalinterest.org/blog/buzz/another-f-a-18-super-hornet-went-dark-over-the-red-sea",
    "timestamp": "2025-05-08T14:31:58Z"
  },
  {
    "title": "Bill Gates to give away $200 billion fortune by 2045: 'I am determined'",
    "description": "Bill Gates pledged to give away almost his entire personal wealth in the next two decades and said the world’s poorest would receive some $200 billion via his foundation.",
    "link": "https://www.today.com/news/bill-gates-give-away-200-billion-fortune-2045-rcna205555",
    "timestamp": "2025-05-08T14:30:36Z"
  },
  {
    "title": "US and UK are expected to announce a trade deal that Trump says will cement their relationship",
    "description": "President Donald Trump has agreed to cut tariffs on U.K. autos, steel and aluminum in a planned trade deal with Britain, which would buy more American beef and streamline its customs process for goods from the United States.",
    "link": "https://www.ksat.com/news/world/2025/05/08/us-and-uk-expected-to-make-announcements-after-trump-touts-a-major-trade-deal/",
    "timestamp": "2025-05-08T14:30:29Z"
  },
  {
    "title": "Nintendo expects to sell 15 million Switch 2 units within first year",
    "description": "Nintendo predicts it will sell 15 million Switch 2 consoles within its first year on the market. The company provided the forecast during an investor call as part of its latest earnings report. Notably, it expects to hit the 15-million mark by the end of Marc…",
    "link": "https://mobilesyrup.com/2025/05/08/nintendo-switch-2-first-year-sales-forecast/",
    "timestamp": "2025-05-08T14:30:20Z"
  },
  {
    "title": "Voting continues for new pope; Knicks stun Celtics again | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_eb448bdb-18b0-5600-bb3b-a8a4137d9aa6.html",
    "timestamp": "2025-05-08T14:30:00Z"
  },
  {
    "title": "Voting continues for new pope; Knicks stun Celtics again | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_323d3856-a818-5723-9709-c819867e4f3b.html",
    "timestamp": "2025-05-08T14:30:00Z"
  },
  {
    "title": "Coinbase Buys Derivatives Exchange Deribit In Landmark $3 Billion Deal",
    "description": "Coinbase has agreed to buy Deribit, a crypto derivatives exchange, according to a May 8 announcement.",
    "link": "https://zycrypto.com/coinbase-buys-derivatives-exchange-deribit-in-landmark-3-billion-deal/",
    "timestamp": "2025-05-08T14:29:48Z"
  },
  {
    "title": "BBT: The World’s First Crypto Project Realizing Trump’s ‘Baby Bonus’",
    "description": "- BabyBoomToken (BBT), the AI-driven crypto tackling low birth rates, expands into South Korea  - Backed by Elon Musk’s warnings and Trump’s policy...",
    "link": "https://www.globenewswire.com/news-release/2025/05/08/3077432/0/en/BBT-The-World-s-First-Crypto-Project-Realizing-Trump-s-Baby-Bonus.html",
    "timestamp": "2025-05-08T14:28:00Z"
  },
  {
    "title": "Trump targets AI diffusion rule as big tech talks AI race",
    "description": "President Donald Trump will walk back a Biden-era rule restricting the sale of advanced U.S. AI chips and models in the month it's set to take effect.",
    "link": "https://www.techtarget.com/searchenterpriseai/news/366623629/Trump-targets-AI-diffusion-rule-as-big-tech-talks-AI-race",
    "timestamp": "2025-05-08T14:26:00Z"
  },
  {
    "title": "Elon Musk to blame for world’s poorest kids dying, says Bill Gates",
    "description": "Billionaire philanthropist lashes the world's richest man over DOGE cuts.",
    "link": "https://www.politico.eu/article/elon-musk-to-blame-for-worlds-poorest-kids-dying-says-bill-gates/",
    "timestamp": "2025-05-08T14:25:21Z"
  },
  {
    "title": "Donald Trump's Approval Rating Is Underwater in Florida and Texas",
    "description": "The president's approval rating has plunged in two states that he carried in the 2024 election.",
    "link": "https://www.newsweek.com/donald-trump-approval-underwater-florida-texas-2069578",
    "timestamp": "2025-05-08T14:25:20Z"
  },
  {
    "title": "Donald Trump taps wellness influencer close to Robert F. Kennedy Jr. for surgeon general (Associated Press)",
    "description": "Associated Press:\nDonald Trump taps wellness influencer close to Robert F. Kennedy Jr. for surgeon general  —  President Donald Trump is tapping Dr. Casey Means, a physician-turned-wellness influencer with close ties to Health and Human Services Secretary Rob…",
    "link": "https://www.memeorandum.com/250508/p43",
    "timestamp": "2025-05-08T14:25:00Z"
  },
  {
    "title": "Bitcoin price prediction: World's top Cryptocurrency is beating Gold, US stock market's S&P 500, Nasdaq",
    "description": "Bitcoin vs Gold vs S&P 500, Nasdaq - The cryptocurrency giant is finally reclaiming its place as a big alternative for investors.",
    "link": "https://economictimes.indiatimes.com/news/international/us/bitcoin-price-prediction-worlds-top-cryptocurrency-is-beating-gold-us-stock-markets-sp-500-nasdaq/articleshow/121001872.cms",
    "timestamp": "2025-05-08T14:24:57Z"
  },
  {
    "title": "US northern border agents capture Chinese alien, surge of illegal immigrants as arrests soar in one state",
    "description": "Chinese and Central American illegal immigrants were among those arrested by border patrol in Maine in recent operations targeting unlawfully present migrants.",
    "link": "https://www.foxnews.com/us/us-northern-border-agents-capture-chinese-alien-surge-illegal-immigrants-arrests-soar-one-state",
    "timestamp": "2025-05-08T14:24:34Z"
  },
  {
    "title": "Pictures: Europe Stops to Celebrate VE Day 80 Years On",
    "description": "The 80th anniversary of Victory in Europe (VE) Day was celebrated Thursday across the Continent and in the UK, with thousands of people pausing to remember the fight for freedom in World War II and all that entailed.\nThe post Pictures: Europe Stops to Celebra…",
    "link": "https://www.breitbart.com/europe/2025/05/08/pictures-europe-stops-to-celebrate-ve-day-80-years-on/",
    "timestamp": "2025-05-08T14:23:49Z"
  },
  {
    "title": "WATCH: Secret Service Rushes to Protect Ivanka Trump as Strange Man Rushes at Her, Clobbers the Potential Attacker",
    "description": "Things got crazy for Ivanka Trump, the eldest daughter of President Donald Trump, and her husband, Jared Kushner, when the two tried taking a night out on the town in South Beach, Florida, on Sunday, May 4. What happened was a strange man rushed at the couple…",
    "link": "https://freerepublic.com/focus/f-bloggers/4315718/posts",
    "timestamp": "2025-05-08T14:22:47Z"
  },
  {
    "title": "The States Want Their EV Funding Back",
    "description": "More lawsuits, more dire predictions of automaker losses, and more uncertainty. It's everything you could hope for, from a Thursday.",
    "link": "https://www.jalopnik.com/1854635/states-sue-trump-admin-over-withholding-ev-funds/",
    "timestamp": "2025-05-08T14:22:27Z"
  },
  {
    "title": "US cuts aid to Zambia over 'systematic' medicine theft",
    "description": "Critical medicines affected by the $50m cuts include Malaria, HIV and TB drugs, the US embassy says.",
    "link": "https://www.bbc.com/news/articles/c1e6pl6302zo",
    "timestamp": "2025-05-08T14:21:51Z"
  },
  {
    "title": "US cuts aid to Zambia over 'systematic' theft of medicine",
    "description": "Critical medicines affected by the $50m cuts include Malaria, HIV and TB drugs, the US embassy says.",
    "link": "https://www.bbc.co.uk/news/articles/c1e6pl6302zo",
    "timestamp": "2025-05-08T14:21:51Z"
  },
  {
    "title": "Trump is bashing Jerome Powell again after the Fed keeps interest rates steady",
    "description": "President Trump called out Jerome Powell in a Truth Social post for not lowering interest rates this week, continuing his attacks on the Fed chief.",
    "link": "https://www.businessinsider.com/trump-powell-interest-rates-tariffs-inflation-economy-stagflation-federal-reserve-2025-5",
    "timestamp": "2025-05-08T14:20:09Z"
  },
  {
    "title": "Pardons for friends, retribution for foes...",
    "description": "Pardons for friends, retribution for foes...\r\n\n \n \n \n (First column, 5th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Web archivists scrambling to save public data from deletion after MAGA purge...\r\nPresident Has Been Stopped By Courts More Than 200 Times...\r\n\n …",
    "link": "https://rollcall.com/2025/05/07/pardons-for-friends-retribution-for-foes/",
    "timestamp": "2025-05-08T14:19:36Z"
  },
  {
    "title": "Somaliland’s 30-year quest for recognition: could US interests make the difference?",
    "description": "The US has been interested in Somaliland due to its strategic location on the Gulf of Aden.",
    "link": "https://theconversation.com/somalilands-30-year-quest-for-recognition-could-us-interests-make-the-difference-255399",
    "timestamp": "2025-05-08T14:17:59Z"
  },
  {
    "title": "WATCH: ‘Judicial independence is crucial,’ Chief Justice Roberts says",
    "description": "Amid attacks on federal judges who have slowed President Donald Trump's agenda, Chief Justice John Roberts on Wednesday defended judicial independence as necessary to “check the excesses of the Congress or the executive.”",
    "link": "https://www.pbs.org/newshour/politics/watch-judicial-independence-is-crucial-chief-justice-roberts-says",
    "timestamp": "2025-05-08T14:16:13Z"
  },
  {
    "title": "Judge temporarily blocks Trump administration’s new transit and homelessness grant conditions",
    "description": "The conditions were on millions of dollars worth of mass transit grants for Seattle and homelessness services grants for Boston, New York and San Francisco.",
    "link": "https://www.bostonherald.com/2025/05/08/trump-transit-homelessness-grants-lawsuit/",
    "timestamp": "2025-05-08T14:16:02Z"
  },
  {
    "title": "Joe Biden Says Dropping Out Of 2024 Race Was ‘Hard’ Because His Presidency Was Just ‘So Successful’",
    "description": "Former President Joe Biden claimed in an interview broadcast Wednesday that it was difficult for him to drop out of the 2024 presidential election because his single term in office was a great success. Biden told BBC in his first broadcast interview since exi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4315717/posts",
    "timestamp": "2025-05-08T14:16:00Z"
  },
  {
    "title": "US, Russia explore ways to restore Russian gas flows to Europe, sources say",
    "description": "Amid strained energy relations between Europe and Russia, U.S. and Moscow officials have discussed reviving Russian gas sales to Europe, potentially aiding Ukraine peace talks. Washington's involvement could navigate European opposition and provide oversight,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-russia-explore-ways-to-restore-russian-gas-flows-to-europe-sources-say/articleshow/121001645.cms",
    "timestamp": "2025-05-08T14:13:46Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, Nasdaq edge higher as Trump touts 'major' US-UK trade deal",
    "description": "Trump said he's poised to unveil a \"major\" trade deal, boosting optimism that the tide has turned in the tariff hostilities.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-edge-higher-as-trump-touts-major-us-uk-trade-deal-141340092.html",
    "timestamp": "2025-05-08T14:13:40Z"
  },
  {
    "title": "16 states and DC are suing the Trump administration over blocking funding for EV chargers",
    "description": "A coalition of states is suing the Trump administration over blocking EV charger funding. Tesla has been a major recipient.",
    "link": "https://www.businessinsider.com/states-dc-sue-trump-administration-funding-ev-chargers-billions-lawsuit-2025-5",
    "timestamp": "2025-05-08T14:13:32Z"
  },
  {
    "title": "Trump’s Weak Position on Trade",
    "description": "An incoherent American policy has allowed China to benefit from its focus and resolve.",
    "link": "https://www.theatlantic.com/international/archive/2025/05/trump-china-tariff-trade-deal/682738/",
    "timestamp": "2025-05-08T14:13:26Z"
  },
  {
    "title": "Over 14% of All Active-Duty American Military Personnel Live Here",
    "description": "The U.S. military relies heavily on its presence in California. Military members in California play a valuable role in ensuring the state’s safety, including deploying the National Guard to fight wildfires and protecting the borders. U.S. President Donald Tru…",
    "link": "https://biztoc.com/x/9ed6a5199657bb27",
    "timestamp": "2025-05-08T14:12:38Z"
  },
  {
    "title": "GSR’s Josh Riezman on Regulation, Risk, and Readying Crypto for the Next Phase",
    "description": "The market-maker, investor and asset manager aims to be a “one-stop shop for market participants,” says its Chief Strategy Officer. Riezman is a speaker at Consensus 2025 May 14-16.",
    "link": "https://www.coindesk.com/consensus-toronto-2025-coverage/2025/05/08/gsrs-josh-riezman-on-regulation-risk-and-readying-crypto-for-the-next-phase",
    "timestamp": "2025-05-08T14:11:58Z"
  },
  {
    "title": "Biden hires veteran Democrat communicator as former president aims to defend tarnished reputation",
    "description": "As former President Joe Biden faces incoming fire from President Donald Trump and also fellow Democrats, the former president brings on board a veteran strategist to help furbish his reputation and legacy.",
    "link": "https://www.foxnews.com/politics/biden-hires-veteran-democrat-communicator-former-president-aims-defend-tarnished-reputation",
    "timestamp": "2025-05-08T14:11:50Z"
  },
  {
    "title": "‘Remarkable!’ CNN’s Kaitlan Collins Stunned Major Port Has ‘No Ships’ Amid Trump Tariffs",
    "description": "CNN anchor Kaitlan Collins was stunned to learn that there are \"no ships at berth\" in the Port of Seattle after several weeks of Trump's tariff regimen.\nThe post ‘Remarkable!’ CNN’s Kaitlan Collins Stunned Major Port Has ‘No Ships’ Amid Trump Tariffs first ap…",
    "link": "https://www.mediaite.com/tv/remarkable-cnns-kaitlan-collins-stunned-major-port-has-no-ships-amid-trump-tariffs/",
    "timestamp": "2025-05-08T14:10:12Z"
  },
  {
    "title": "Trump: It's Very Simple, Iran Can Hand Over Nuclear Fuel And Centrifuges Or We \"Blow Them Up\"",
    "description": "During an interview, Wednesday on the \"Hugh Hewitt Show,\" President Trump warned Iran that they can either hand over nuclear fuel and centrifuges by making a \"verified deal\" or the U.S. will \"blow them up.\"\r\n\r\n\"There are only two alternatives there: blow them…",
    "link": "https://www.realclearpolitics.com/video/2025/05/08/trump_its_very_simple_iran_can_hand_over_nuclear_fuels_and_centrifuges_or_we_blow_them_up.html",
    "timestamp": "2025-05-08T14:10:00Z"
  },
  {
    "title": "Trump’s Plan to Fix Air Traffic Control Faces Huge Hurdles",
    "description": "U.S. Transportation Secretary Sean Duffy on Thursday will call for tens of billions of dollars to overhaul America’s strained air traffic control system to address crumbling infrastructure, dramatic staffing shortfalls and failing technology. Key questions re…",
    "link": "https://www.insurancejournal.com/news/national/2025/05/08/823046.htm",
    "timestamp": "2025-05-08T14:08:58Z"
  },
  {
    "title": "MAGA Compares Plus-Size NY Statue to Letitia James",
    "description": "The statue, named \"Grounded in the Stars,\" was unveiled in Times Square this week.",
    "link": "https://www.newsweek.com/maga-compares-plus-size-ny-statue-letitia-james-2069592",
    "timestamp": "2025-05-08T14:08:13Z"
  },
  {
    "title": "Bill Gates' brutal take on Elon Musk: 'Picture of the world's richest man killing...'",
    "description": "Bill Gates has taken a brutal dig at tech mogul and Tesla CEO Elon Musk, who is also the DOGE department in the Donald Trump administration. He said that the picture of the world's richest man killing the world’s poorest children is not a pretty one. The Micr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bill-gates-brutally-take-on-elon-musk-picture-of-the-worlds-richest-man-killing-worlds-poorest-children-is-not-a-pretty-one/articleshow/121001213.cms",
    "timestamp": "2025-05-08T14:06:52Z"
  },
  {
    "title": "Bill Gates tears into Elon Musk for being ‘involved in the deaths of the world’s poorest children’",
    "description": "Bill Gates took aim at President Donald Trump and Elon Musk during an interview with The New York Times, saying funding cuts to USAID will cause childhood deaths to increase. “On childhood deaths, which over the next few years should have gone from five milli…",
    "link": "https://www.theverge.com/news/663322/bill-gates-elon-musk-trump-childhood-deaths-usaid",
    "timestamp": "2025-05-08T14:06:28Z"
  },
  {
    "title": "Conductor Leon Botstein has a message for democracy",
    "description": "US conductor Leon Botstein is warning how easily evil can become legal — and he's delivering his message in Germany on the 80th anniversary of World War II's end. Freedom takes work, he says, and right now it's at stake.",
    "link": "https://www.dw.com/en/conductor-leon-botstein-has-a-message-for-democracy/a-72479906",
    "timestamp": "2025-05-08T14:06:00Z"
  },
  {
    "title": "Russia, China slam Trump's plan for 'Iron Dome' missile shield",
    "description": "Russia and China have jointly criticized US President Donald Trump's plan for a space-based missile defense system, likening it to the \"Star Wars\" program and deeming it \"deeply destabilizing.\" They argue that the \"Golden Dome for America\" initiative risks es…",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-china-slam-trumps-plan-for-iron-dome-missile-shield/articleshow/121001404.cms",
    "timestamp": "2025-05-08T14:05:49Z"
  },
  {
    "title": "We need to talk about Donald Trump's mental fitness",
    "description": "Patsy Neal: Psychiatrists have long warned that Donald Trump's narcissism poses a threat to the nation, and the evidence keeps mounting.",
    "link": "https://captimes.com/opinion/guest-columns/opinion-we-need-to-talk-about-trumps-mental-fitness/article_f246fee8-8cdb-4d35-898b-41b7c0eeabe9.html",
    "timestamp": "2025-05-08T14:05:00Z"
  },
  {
    "title": "Judge Warns Trump Admin Against Deporting Migrants To Libya: 'Would Clearly Violate This Court's Order'",
    "description": "A federal judge warned the Trump administration against carrying out deportations to Libya, as it was reported on Wednesday",
    "link": "https://www.ibtimes.com/judge-warns-trump-admin-against-deporting-migrants-libya-would-clearly-violate-this-courts-3772957",
    "timestamp": "2025-05-08T14:04:41Z"
  },
  {
    "title": "Trump Taps Health Freedom Advocate Dr. Casey Means for Surgeon General",
    "description": "The move came after President Donald Trump at the last minute pulled the nomination of his previous choice, Dr. Janette Nesheiwat, amid concerns about her alignment with the Make America Healthy Again agenda and allegations that she misrepresented her credent…",
    "link": "https://childrenshealthdefense.org/defender/trump-taps-health-freedom-advocate-dr-casey-means-surgeon-general/",
    "timestamp": "2025-05-08T14:02:57Z"
  },
  {
    "title": "Ukraine’s parliament ratifies landmark minerals deal with US",
    "description": "Kyiv says deal ‘operational’ in a few weeks, hopes it will revive flagging US support against Russian aggression.",
    "link": "https://www.aljazeera.com/news/2025/5/8/ukraines-parliament-ratifies-landmark-minerals-deal-with-us",
    "timestamp": "2025-05-08T14:02:39Z"
  },
  {
    "title": "Deep State Intel Staffers Once Again Leaking Classified Info To Stop Trump’s Agenda",
    "description": "U.S. intelligence chiefs ordered agencies to tighten surveillance on Greenland, the first tangible step toward President Donald Trump’s oft-stated goal of bringing the Arctic island under American control, sources leaked to The Wall Street Journal. The direct…",
    "link": "https://freerepublic.com/focus/f-news/4315714/posts",
    "timestamp": "2025-05-08T14:02:33Z"
  },
  {
    "title": "How Is Trump F*cking The Environment Today? How ISN'T He?",
    "description": "More weird shit nobody voted for.",
    "link": "https://www.wonkette.com/p/how-is-trump-fcking-the-environment",
    "timestamp": "2025-05-08T14:01:39Z"
  },
  {
    "title": "Wall Street opens higher after Trump says trade deal with United Kingdom will be announced",
    "description": "U.S. stocks are rising after President Donald Trump said he was set to announce an agreement on trade with the United Kingdom.\nWall Street hopes more deals will follow and that they’ll be enough to keep a recession at bay. The S&P 500 rose 0.7% in early tradi…",
    "link": "https://biztoc.com/x/c4a628a586d1c075",
    "timestamp": "2025-05-08T14:01:25Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to announce U.S.-U.K. trade deal",
    "description": "It's the first bilateral trade deal since President Donald Trump began his efforts to rewire the global economy by dramatically increasing import taxes in an attempt to increase domestic manufacturing.",
    "link": "https://biztoc.com/x/3ca4112282247038",
    "timestamp": "2025-05-08T14:01:17Z"
  },
  {
    "title": "US opens higher with all eyes on US-UK trade treaty",
    "description": "US stock market indices started trading on a positive note Thursday following President Donald Trump's announcement of a new trade deal between the United States and Britain.The agreement, which Trump...",
    "link": "https://biztoc.com/x/1e89766d8da0cc9a",
    "timestamp": "2025-05-08T14:01:06Z"
  },
  {
    "title": "Senator says Dems 'eat their own' as Fetterman faces renewed scrutiny",
    "description": "Sen. John Fetterman, a Democrat from Pennsylvania, was subjected to what he called a \"dumb hit piece\" in New York Magazine, while lawmakers reacted Tuesday.",
    "link": "https://www.foxnews.com/politics/senator-says-dems-eat-own-fetterman-faces-renewed-scrutiny",
    "timestamp": "2025-05-08T14:00:46Z"
  },
  {
    "title": "With Slim Margins and Big Questions, Democrats Hunt for a Midterm Strategy",
    "description": "The Political Breakdown team swapped San Francisco fog for D.C. humidity to find out what Democrats are doing ahead of the 2026 midterm elections.",
    "link": "https://www.kqed.org/news/12039123/with-slim-margins-and-big-questions-democrats-hunt-for-a-midterm-strategy",
    "timestamp": "2025-05-08T14:00:28Z"
  },
  {
    "title": "Shoppers ‘more resilient’ in face of tariffs than Canadian Tire CEO expected",
    "description": "TORONTO — The tariff fight that has broken out between the U.S. and its trading partners doesn’t appear to be rankling Canadian Tire Corp. Ltd. customers as much as its CEO once expected. Greg Hicks said shoppers across the Toronto-based company’s banners — C…",
    "link": "https://financialpost.com/pmn/shoppers-more-resilient-in-face-of-tariffs-than-canadian-tire-ceo-expected",
    "timestamp": "2025-05-08T14:00:26Z"
  },
  {
    "title": "Shoppers 'more resilient' in face of tariffs than Canadian Tire CEO expected",
    "description": "The retailer reported its first-quarter profit fell compared with a year ago as it was hit by restructuring costs. Find out more",
    "link": "https://financialpost.com/investing/shoppers-more-resilient-in-face-of-tariffs-than-canadian-tire-ceo-expected",
    "timestamp": "2025-05-08T14:00:26Z"
  },
  {
    "title": "Shoppers 'more resilient' in face of tariffs than Canadian Tire CEO expected",
    "description": "Canadian Tire reported its first-quarter profit fell compared with a year ago as it was hit by restructuring costs. Find out more",
    "link": "https://financialpost.com/investing/shoppers-more-resilient-tariffs-than-expected",
    "timestamp": "2025-05-08T14:00:26Z"
  },
  {
    "title": "Trump’s Assault on Veterans Is Already Taking a Toll",
    "description": "Leaked emails reveal Donald Trump's sinister plan to destroy the U.S. Department of Veterans Affairs. The effects are already being felt.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-assault-veterans-taking-toll-1235333903/",
    "timestamp": "2025-05-08T14:00:00Z"
  },
  {
    "title": "Is Spying Un-American?",
    "description": "Espionage has always been with us, but its rapid growth over the past century may have undermined trust in government.",
    "link": "https://www.theatlantic.com/books/archive/2025/05/spying-un-american/682725/",
    "timestamp": "2025-05-08T14:00:00Z"
  },
  {
    "title": "Trump Is Trying to Gut Libraries. Not Everyone Is Taking It Lying Down.",
    "description": "Judges are on the IMLS’ side. But the budget battle is still to come.",
    "link": "https://slate.com/life/2025/05/trump-news-doge-library-funding-cuts-legal-battle.html",
    "timestamp": "2025-05-08T14:00:00Z"
  },
  {
    "title": "Trump Melts Down Over Federal Reserve’s Five-Alarm Warning on Economy",
    "description": "Donald Trump threw yet another tantrum Thursday about Federal Reserve Chair Jerome Powell’s latest alert that the president’s tariffs will cripple economic growth.\r\n“‘Too Late’ Jerome Powell is a FOOL, who doesn’t have a clue,” Trump wrote on Truth Social. “O…",
    "link": "https://newrepublic.com/post/194998/donald-trump-federal-reserve-warning-economy",
    "timestamp": "2025-05-08T13:59:06Z"
  },
  {
    "title": "DOGE Dance--Leo Zacky, gubernatorial candidate, and Shiva Bagheri celebrate DOGE in Beverly Hills, Calif.",
    "description": "The Department of Government Efficiency (DOGE) is a task force created by the Trump administration to root out waste and corruption in the federal government. To promote its mission and celebrate its accomplishments, Leo Zacky (foreground, left), a candidate …",
    "link": "https://freerepublic.com/focus/f-bloggers/4315713/posts",
    "timestamp": "2025-05-08T13:57:06Z"
  },
  {
    "title": "There are 2 distinct forces driving stocks higher today",
    "description": "A trade deal between the US and the UK boosted optimism on Wall Street. Stocks jumped, while yields rose as traders adjusted after Wednesday's Fed meeting.",
    "link": "https://www.businessinsider.com/trade-deal-trump-tariffs-us-uk-stock-market-today-2025-5",
    "timestamp": "2025-05-08T13:56:38Z"
  },
  {
    "title": "Maersk CEO: Trump’s Supply Chain-Related Tariff Goals ‘Very Unrealistic’",
    "description": "Maersk CEO Vincent Clerc said President Donald Trump’s vision of a reordered global supply chain can’t happen overnight. Clerc said it would take Trump “a decade or two of persistent effort” to reconfigure the world’s supply chains through tariffs, the Financ…",
    "link": "https://www.pymnts.com/supply-chain/2025/maersk-ceo-president-donald-trump-supply-chain-related-tariff-goals-very-unrealistic/",
    "timestamp": "2025-05-08T13:56:36Z"
  },
  {
    "title": "Trump Taken By Surprise By Question On Deportations: 'I Don't Know'",
    "description": "Recent reports have revealed the administration was planning to send migrants to Libya, a nation plagued by conflict and human rights violations.",
    "link": "https://www.huffpost.com/entry/donald-trump-surprised-question-libya-deportations_n_681c8297e4b00e22a2991914",
    "timestamp": "2025-05-08T13:56:06Z"
  },
  {
    "title": "JUST IN: President Trump Set to Announce “MAJOR TRADE DEAL” with United Kingdom at 10 AM ET (WATCH LIVE)",
    "description": "President Trump has announced a “full and comprehensive” trade agreement with the United Kingdom, which is set to be formally announced and discussed during a news conference at 10 am ET.  As The Gateway Pundit reported, on Tuesday, Trump teased a “very, very…",
    "link": "https://www.thegatewaypundit.com/2025/05/just-president-trump-set-announce-major-trade-deal/",
    "timestamp": "2025-05-08T13:55:12Z"
  },
  {
    "title": "B.C. premier says softwood lumber accord could build 'momentum' for U.S. trade deals",
    "description": "David Eby said Wednesday he and several other premiers pressed the issue of the ongoing softwood lumber dispute during a virtual meeting with Prime Minister Mark Carney after his visit with U.S. President Donald Trump this week.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-softwood-lumber-momentum-us-trade-1.7529646",
    "timestamp": "2025-05-08T13:54:32Z"
  },
  {
    "title": "'Wonder Woman' Star Lynda Carter: DEI Is 'Fundamentally American'",
    "description": "\"Wonder Woman\" star Lynda Carter, the actress who once said one month to celebrate the LGBTQIA2S+ community “felt so short,” is now saying Diversity, Equity, Inclusion (DEI) is \"fundamentally American.\" \nThe post ‘Wonder Woman’ Star Lynda Carter: DEI Is ‘Fund…",
    "link": "https://www.breitbart.com/entertainment/2025/05/08/wonder-woman-star-lynda-carter-dei-is-fundamentally-american/",
    "timestamp": "2025-05-08T13:54:09Z"
  },
  {
    "title": "Seth Meyers Deciphers Why Trump Looked So Happy While Being Publicly Rebuked by Canadian Prime Minister | Video",
    "description": "\"I've never seen him smile that much while someone tells him to get lost,\" the NBC host points out\nThe post Seth Meyers Deciphers Why Trump Looked So Happy While Being Publicly Rebuked by Canadian Prime Minister | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-mark-carney-meeting-canada-seth-meyers/",
    "timestamp": "2025-05-08T13:51:56Z"
  },
  {
    "title": "VE Day: A global commemoration of victory over Nazi Germany and reflection",
    "description": "Victory in Europe Day (VE Day), observed annually on May 8, marks the end of World War II in Europe. Celebrated across various nations, VE Day honors the sacrifices made for peace and freedom. While festivities abound, the day also serves as a poignant remind…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/ve-day-a-global-commemoration-of-victory-over-nazi-germany-and-reflection/articleshow/121000858.cms",
    "timestamp": "2025-05-08T13:50:58Z"
  },
  {
    "title": "Cast of Trump’s Favorite Musical, Les Misérables, to Boycott Kennedy Center Performance",
    "description": "At least a dozen cast members will be performing one day less in direct protest of the president's attendance \nCast of Trump’s Favorite Musical, Les Misérables, to Boycott Kennedy Center Performance\nJo Vito",
    "link": "https://consequence.net/2025/05/les-miserables-cast-boycott-kennedy-center/",
    "timestamp": "2025-05-08T13:50:15Z"
  },
  {
    "title": "‘I don’t know’: The problem with Trump leaning into his new favorite phrase",
    "description": "It’s worth appreciating not just how many times Donald Trump has said “I don’t know” in recent days, but also the scope of his apparent cluelessness.",
    "link": "https://biztoc.com/x/4687fe8dc85e1866",
    "timestamp": "2025-05-08T13:50:12Z"
  },
  {
    "title": "US limits controversial pandemic pathogen research",
    "description": "The News\nUS President Donald Trump moved to limit controversial “gain-of-function” research that could make pathogens more dangerous.\nThese experiments involve taking viruses or bacteria and modifying them, sometimes to make them more transmissible or deadly,…",
    "link": "https://biztoc.com/x/ffb34934e47044de",
    "timestamp": "2025-05-08T13:50:09Z"
  },
  {
    "title": "Dr. Casey Means, Trump’s new surgeon general nominee, draws unflattering scrutiny",
    "description": "Given Dr. Casey Means' background, the confirmation hearings for the president's new surgeon general nominee are bound to be contentious.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/dr-casey-means-trumps-new-surgeon-general-nominee-draws-unflattering-s-rcna205556",
    "timestamp": "2025-05-08T13:50:00Z"
  },
  {
    "title": "Kamala Harris Didn't Lose to the Couch (TouchGrass)",
    "description": "TouchGrass:\nKamala Harris Didn't Lose to the Couch  —  Why did Kamala Harris lose last November?  Three answers have been prominently offered:  — Too many 2020 Biden voters stayed home,  — Too many 2020 Biden voters changed their minds, or  — New 2024-only vo…",
    "link": "https://www.memeorandum.com/250508/p38",
    "timestamp": "2025-05-08T13:50:00Z"
  },
  {
    "title": "Congress counters Trump with massive FEMA restructuring plan",
    "description": "A bipartisan group of House members is drafting a sweeping bill to overhaul the Federal Emergency Management Agency — and in some cases expand its services — in an effort to head off President Donald Trump's threats to shrink or abolish the agency. \nUnder the…",
    "link": "https://biztoc.com/x/5399d1af5de5be1e",
    "timestamp": "2025-05-08T13:49:59Z"
  },
  {
    "title": "Democrats Woke Up to Trump's Crypto Grift. Will They Stop Other Scammers?",
    "description": "“Many of the potential issues we see with the Trump family’s crypto practices are a feature — not a bug — of the crypto industry.”\nThe post Democrats Woke Up to Trump’s Crypto Grift. Will They Stop Other Scammers? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/05/08/democrats-trump-crypto-stablecoin-maxine-waters/",
    "timestamp": "2025-05-08T13:48:23Z"
  },
  {
    "title": "Trump announces 'full and comprehensive' trade deal with UK",
    "description": "Donald Trump declared a comprehensive trade agreement with Britain. This is the first deal since his tariffs. However, London's response suggests a less comprehensive agreement. The deal aims to strengthen US-UK relations. It addresses tariffs on steel and ca…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-announces-full-and-comprehensive-trade-deal-with-uk/articleshow/121000783.cms",
    "timestamp": "2025-05-08T13:48:06Z"
  },
  {
    "title": "Wall Street rises with hopes for trade deals that could forestall a recession",
    "description": "Wall Street hopes more deals will follow and keep momentum going.",
    "link": "https://www.bostonherald.com/2025/05/08/wall-street-trade-deal-impact/",
    "timestamp": "2025-05-08T13:47:53Z"
  },
  {
    "title": "EU publishes US product hit list, prepares for WTO action against Trump's tariffs",
    "description": "European Union is ready with counter duties on American goods. This is if there is no solution to Donald Trump's tariff policies. The EU is also starting legal action at the World Trade Organisation. This is regarding Trump's tariffs. Ursula von der Leyen say…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/eu-publishes-us-product-hit-list-prepares-for-wto-action-against-trumps-tariffs/articleshow/121000754.cms",
    "timestamp": "2025-05-08T13:47:09Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to announce U.S.-U.K. trade deal",
    "description": "It's the first bilateral trade deal since President Donald Trump began his efforts to rewire the global economy by dramatically increasing import taxes in an attempt to increase domestic manufacturing.",
    "link": "https://www.pbs.org/newshour/world/watch-live-trump-expected-to-announce-u-s-u-k-trade-deal",
    "timestamp": "2025-05-08T13:45:54Z"
  },
  {
    "title": "Trump’s New Surgeon General Pick Triggers Massive Backlash — Even RFK Jr.’s VP Nicole Shanahan Weighs In: ‘She Was Bred and Raised as a Manchurian Asset’",
    "description": "President Trump has withdrawn his controversial Surgeon General nominee Dr.\nThe post Trump’s New Surgeon General Pick Triggers Massive Backlash — Even RFK Jr.’s VP Nicole Shanahan Weighs In: ‘She Was Bred and Raised as a Manchurian Asset’ appeared first on Th…",
    "link": "https://www.thegatewaypundit.com/2025/05/trumps-new-surgeon-general-pick-triggers-massive-backlash/",
    "timestamp": "2025-05-08T13:45:48Z"
  },
  {
    "title": "Trump Picks Dr. Casey Means for Surgeon General to Drive Health Agenda",
    "description": "President Trump nominated Dr. Casey Means as Surgeon General on May 7, aligning with the 'Make America Healthy Again' initiative. Her focus on functional medicine aims to combat chronic disease and improve national health.",
    "link": "https://aarr.org/trump-nominates-dr-casey-means-surgeon-general/",
    "timestamp": "2025-05-08T13:45:46Z"
  },
  {
    "title": "Trump to Announce Trade Deal With the U.K.",
    "description": "\"Because of our long time history and allegiance together, it is a great honor to have the United Kingdom as our FIRST announcement.\"\nThe post Trump to Announce Trade Deal With the U.K. first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/05/trump-to-announce-trade-deal-with-the-u-k/",
    "timestamp": "2025-05-08T13:45:33Z"
  },
  {
    "title": "Republicans diverge over budget cut proposals on Medicaid",
    "description": "House Republicans are running into trouble in finalizing a budget that meets President Donald Trump's agenda, as a new report shows their proposals could cut millions of people on Medicaid.",
    "link": "https://www.koat.com/article/house-republicans-diverge-over-budget-cut-proposals-impacting-millions-medicaid/64713089",
    "timestamp": "2025-05-08T13:45:08Z"
  },
  {
    "title": "EU threatens to target US cars, planes if Trump tariff talks fail",
    "description": "BRUSSELS (BELGIUM) - The EU on Thursday threatened to target US cars and planes among a raft of products worth 95 billion euros ($107 billion) if negotiations with President Donald Trump's team fail to avert a trade war.",
    "link": "https://www.bangkokpost.com/world/3021010/eu-threatens-to-target-us-cars-planes-if-trump-tariff-talks-fail",
    "timestamp": "2025-05-08T13:45:00Z"
  },
  {
    "title": "The 1600: The British Are Coming",
    "description": "Editor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.",
    "link": "https://www.newsweek.com/1600-british-are-coming-2069612",
    "timestamp": "2025-05-08T13:44:44Z"
  },
  {
    "title": "Norway, spooked by Trump, aims for greater European defence collaboration",
    "description": "Norway's first-ever national security strategy calls for stronger security ties with Europe amid \"considerable uncertainty\" over US commitment.",
    "link": "https://www.euractiv.com/section/defence/news/norway-spooked-by-trump-aims-for-greater-european-defence-collaboration/",
    "timestamp": "2025-05-08T13:44:39Z"
  }
]