[
  {
    "title": "Chinese premier says US and his country need to 'work in the same direction'",
    "description": "Chinese Premier Li Qiang has told a group of American business executives that the U.S. and his country need “to work in the same direction” to further what he called the most important bilateral relationship in the world",
    "link": "https://abcnews.go.com/Business/wireStory/chinese-premier-us-country-work-same-direction-125941087",
    "timestamp": "2025-09-25T20:14:32Z"
  },
  {
    "title": "‘Jimmy Kimmel Live!’ Writer Says Trump’s Priorities Are ‘So Messed Up’ as President Threatens ABC Again Over Jokes",
    "description": "“Imagine if every day George HW Bush was like, ‘And you know who pissed me off today? Arsenio,’” Louis Virtel says\nThe post ‘Jimmy Kimmel Live!’ Writer Says Trump’s Priorities Are ‘So Messed Up’ as President Threatens ABC Again Over Jokes appeared first on Th…",
    "link": "https://www.thewrap.com/jimmy-kimmel-live-writer-louis-virtel-responds-trump/",
    "timestamp": "2025-09-25T20:12:09Z"
  },
  {
    "title": "Right Wing Extremist Violence Is More Frequent And More Deadly Than Left Wing Violence",
    "description": "After the Sept. 10, 2025, assassination of conservative political activist Charlie Kirk, President Donald Trump claimed thatradical leftist groups foment political violencein the U.S., and “they should be put in jail.” “The radical left causes tremendous viol…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179534050",
    "timestamp": "2025-09-25T20:12:09Z"
  },
  {
    "title": "Trump’s plan for a government shutdown: mass firings",
    "description": "As lawmakers scramble to avoid a shutdown, the White House is making plans for widespread layoffs that could lead to a permanent federal downsizing",
    "link": "https://theweek.com/politics/trump-shutdown-layoff-firing-democrats",
    "timestamp": "2025-09-25T20:11:08Z"
  },
  {
    "title": "This naked power grab shows Republican ruthlessness in full",
    "description": "The Great Ohio Gerrymandering Farce has lifted its curtain once again at the Ohio Statehouse odditorium of human wonders in scenic downtown Columbus.Ohio politicians are once again pretending to be responsible stewards of the public interest and the Ohio Cons…",
    "link": "https://www.rawstory.com/ohio-gerrymandering-2674029388/",
    "timestamp": "2025-09-25T20:11:03Z"
  },
  {
    "title": "Fed Reserve governor Lisa Cook warns of 'chaos and disruption' if Trump fires her",
    "description": "Fighting Trump's efforts to remove her from the Federal Reserve board, Lisa Cook told the Supreme Court that the central bank's independence is at stake.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/25/lisa-cook-federal-reserve-supreme-court-trump/86352697007/",
    "timestamp": "2025-09-25T20:10:32Z"
  },
  {
    "title": "Right Wing Extremist Violence Is More Frequent And More Deadly Than Left Wing Violence",
    "description": "After the Sept. 10, 2025, assassination of conservative political activist Charlie Kirk, President Donald Trump claimed that radical leftist groups foment political violence in the U.S., and “they should be put in jail.” “The radical left causes tremendous vi…",
    "link": "https://www.techdirt.com/2025/09/25/right-wing-extremist-violence-is-more-frequent-and-more-deadly-than-left-wing-violence/",
    "timestamp": "2025-09-25T20:10:30Z"
  },
  {
    "title": "Former Fed, Treasury chiefs urge Supreme Court to block Trump firing Lisa Cook (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nFormer Fed, Treasury chiefs urge Supreme Court to block Trump firing Lisa Cook … Every living former chair of the Federal Reserve, as well as a slew of ex-Treasury secretaries and former White House economic advisors, urged the Supreme Cour…",
    "link": "https://www.memeorandum.com/250925/p102",
    "timestamp": "2025-09-25T20:10:02Z"
  },
  {
    "title": "Tylenol faces fresh backlash as historic tweet advising pregnant women not to take drug is discovered - after Trump links it to autism",
    "description": "Tylenol has come under fresh scrutiny after a 2017 post resurfaced in which the brand appeared to warn pregnant women against using its products. The tweet, now being widely shared, stated: 'We actually don't recommend taking any of our products while pregnan…",
    "link": "https://freerepublic.com/focus/f-chat/4342653/posts",
    "timestamp": "2025-09-25T20:09:53Z"
  },
  {
    "title": "Trump-linked group lambasts CA's ‘ruthless lawfare,’ as records depict lack of standing in trans sports suit",
    "description": "Public records requests show California Attorney General Robert Bonta's office lacks standing to continue transgender sports lawsuit against Trump order.",
    "link": "https://www.foxnews.com/politics/trump-linked-group-lambasts-cas-ruthless-lawfare-records-show-lack-standing-trans-sports-case",
    "timestamp": "2025-09-25T20:09:13Z"
  },
  {
    "title": "Brittany Mahomes sparks backlash after Taylor Swift items spotted in bathroom selfie",
    "description": "Brittany Mahomes, wife of Kansas City Chiefs quarterback Patrick Mahomes, is no stranger to the spotlight. As a regular at NFL games and a visible figure in Taylor Swift&apos;s gro",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/09/25/68d5a02446163fb3568b45d6.html",
    "timestamp": "2025-09-25T20:08:32Z"
  },
  {
    "title": "Trump officials urge nations to join effort to restrict asylum system as advocates brace for impact",
    "description": "The global system for seeking asylum has been in effect since World War II.",
    "link": "https://www.bostonherald.com/2025/09/25/trump-immigration-asylum/",
    "timestamp": "2025-09-25T20:05:45Z"
  },
  {
    "title": "A Call for Common Sense in Health Care",
    "description": "Trump’s announcement on Tylenol signals a return to restraint—something sorely missing in American health care. On Monday, President Donald Trump held a press conference to... Read More\nThe post A Call for Common Sense in Health Care appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/09/25/call-for-common-sense-healthcare/",
    "timestamp": "2025-09-25T20:05:17Z"
  },
  {
    "title": "Erdogan Stares Daggers After Trump Calls Him Out On Rigged Elections",
    "description": "President Donald Trump seemed to accuse Turkish President Tayyip Erdogan of running a \"rigged election\" during a White House visit Thursday.",
    "link": "https://dailycaller.com/2025/09/25/erdogan-turkey-trump-rigged-elections-white-house/",
    "timestamp": "2025-09-25T20:05:14Z"
  },
  {
    "title": "After Jimmy Kimmel’s Return, Roseanne Barr Lashes Out at Disney Over “Double Standard”",
    "description": "On September 23, Jimmy Kimmel Live! returned to the air following a near-week-long suspension after the Emmy-winning host made comments about Donald Trump and the assassination of Charlie Kirk. Shortly after Mr. Kimmel’s comments, both Sinclair Broadcasting a…",
    "link": "https://insidethemagic.net/2025/09/after-jimmy-kimmels-return-roseanne-barr-lashes-out-at-disney-over-double-standard-ks1/",
    "timestamp": "2025-09-25T20:03:44Z"
  },
  {
    "title": "Trump delivers dark warning after ICE shooting: 'Bad things happen when they play games'",
    "description": "President Donald Trump on Thursday warned of right-wing backlash, blaming the \"radical left\" for the deadly ICE facility shooting in Dallas, Texas. During a meeting with Turkey's President Recep Tayyip Erdoğan in the Oval Office, Trump said \"the radical left …",
    "link": "https://www.rawstory.com/donald-trump-2674040503/",
    "timestamp": "2025-09-25T20:03:02Z"
  },
  {
    "title": "Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister",
    "description": "Faisal bin Farhan al Saud told Sky News that a recent meeting with the US president went \"very well\" and he was hopeful that a ceasefire deal could soon be signed.",
    "link": "https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223",
    "timestamp": "2025-09-25T20:02:00Z"
  },
  {
    "title": "Statue Of President Trump & Jeffrey Epstein Taken Down By NPS",
    "description": "The Trump adminstration continues to move beyond the controversial Jeffrey Epstein and the files connected to his explosive case.",
    "link": "https://hiphopwired.com/2848460/statue-president-trump-jeffrey-epstein-removed/",
    "timestamp": "2025-09-25T20:01:57Z"
  },
  {
    "title": "“At Professional Risk”: Charging Comey Could Land Lindsey Halligan in Hot Water",
    "description": "An ethics professor from Halligan’s law school warns that if she pursues charges against the former FBI director without probable cause, she could be disciplined by the Florida bar.",
    "link": "https://www.vanityfair.com/news/story/at-professional-risk-charging-comey-could-land-lindsey-halligan-in-hot-water",
    "timestamp": "2025-09-25T20:00:48Z"
  },
  {
    "title": "Trump Says U.S. Sank A Third Civilian Boat",
    "description": "United States ruler Donald Trump isn't even trying to hide his war crimes. He admitted the ruling class has sunk a third Venezuelan civilian boat, killing all of the people on board, and depriving them of due process.",
    "link": "https://www.shtfplan.com/headline-news/trump-says-u-s-sank-a-third-civilian-boat",
    "timestamp": "2025-09-25T20:00:38Z"
  },
  {
    "title": "Here's what happened today: Thursday",
    "description": "Obama gets the Freedom of Dublin, Dáil to condemn flotilla attacks and a vote to be held on Israel’s inclusion in Eurovision",
    "link": "https://www.thejournal.ie/news-fix-thursday-79-6827468-Sep2025/",
    "timestamp": "2025-09-25T20:00:34Z"
  },
  {
    "title": "Special agent slams ‘dangerous’ trend of Democrats using ICE as campaign props",
    "description": "A federal special agent working deportations slammed a “dangerous\" trend of Democratic politicians and candidates using anti-ICE protests as campaign backdrops to gain attention.",
    "link": "https://www.foxnews.com/politics/special-agent-slams-dangerous-trend-democrats-using-ice-campaign-props",
    "timestamp": "2025-09-25T20:00:32Z"
  },
  {
    "title": "Onboard the USS Ford as NATO's defenses face its latest test",
    "description": "America’s newest and largest aircraft carrier, the USS Gerald R. Ford is at the center of one of NATO’s largest deployments this week.",
    "link": "https://www.nbcnews.com/world/europe/onboard-us-aircraft-carrier-tensions-rise-russian-incursions-nato-airs-rcna232362",
    "timestamp": "2025-09-25T20:00:00Z"
  },
  {
    "title": "Kamala Harris' 'political career is over': Stephen A. Smith | CUOMO [5:21]",
    "description": "Kamala Harris' recent memoir, \"107 Days,\" has generated controversy due to her criticisms of prominent Democrats. Stephen A. Smith joins \"CUOMO\" to express his disappointment with her promotion of the memoir and to explain why he believes her \"political caree…",
    "link": "https://freerepublic.com/focus/f-news/4342649/posts",
    "timestamp": "2025-09-25T19:57:11Z"
  },
  {
    "title": "UN gives long round of applause after Palestinian Authority president accuses Israel of 'genocide'",
    "description": "Mahmoud Abbas appeals to President Donald Trump for peace while insisting the Palestinian Authority can govern Gaza without Hamas control or weapons.",
    "link": "https://www.foxnews.com/world/un-gives-long-round-applause-after-palestinian-authority-president-accuses-israel-genocide",
    "timestamp": "2025-09-25T19:56:31Z"
  },
  {
    "title": "DNC chair says special elections show Democrats are winning, even when they lose",
    "description": "DNC Chair Ken Martin says recent special election results show Democrats are on the right track for 2026, and tells detractors to \"stop bitching\" and help the party's efforts.",
    "link": "https://www.npr.org/2025/09/25/nx-s1-5548589/ken-martin-democrats-special-election-overperformance",
    "timestamp": "2025-09-25T19:56:18Z"
  },
  {
    "title": "Trump told pregnant women to ‘tough it out’ instead of take Tylenol. A study of 2.5 million births in Sweden finds zero evidence to back him up",
    "description": "United States President Donald Trump recently claimed that using the common painkiller acetaminophen (also known as paracetamol and by the brand name Tylenol in the US) during pregnancy is fuelling the rise in autism diagnoses. He then went on to suggest preg…",
    "link": "https://biztoc.com/x/93e4bc7c086ba70c",
    "timestamp": "2025-09-25T19:54:44Z"
  },
  {
    "title": "Trump Urges Erdogan to cut back on purchases of Russian oil",
    "description": "US president suggests Turkey may be allowed to obtain F-35 fighter jets",
    "link": "https://www.irishtimes.com/world/us/2025/09/25/trump-urges-erdogan-to-cut-back-on-purchases-of-russian-oil/",
    "timestamp": "2025-09-25T19:53:53Z"
  },
  {
    "title": "Azerbaijan Thanks Trump for Brokering Peace with Armenia in U.N. Address",
    "description": "President Ilham Aliyev of Azerbaijan spent much of his address to the U.N. General Assembly (UNGA) in New York City on Thursday celebrating victory in a great “patriotic war” against Armenia, which he accused of illegally occupying territory which Azerbaijan …",
    "link": "https://www.breitbart.com/asia/2025/09/25/azerbaijan-thanks-trump-for-brokering-peace-with-armenia-in-u-n-address/",
    "timestamp": "2025-09-25T19:50:32Z"
  },
  {
    "title": "Senior DOJ leaders advocating for charging Trump critic John Bolton this week, sources say (CNN)",
    "description": "CNN:\nSenior DOJ leaders advocating for charging Trump critic John Bolton this week, sources say  —  Senior Justice Department leaders are advocating for a charge against President Donald Trump's former adviser-turned-critic John Bolton this week, according to…",
    "link": "https://www.memeorandum.com/250925/p97",
    "timestamp": "2025-09-25T19:50:01Z"
  },
  {
    "title": "Oil Swings as NATO and Russian Tensions Escalate",
    "description": "Oil prices seesawed as NATO warned Russia against further airspace violations and traders balanced risks with oversupply forecasts.",
    "link": "https://www.rigzone.com/news/wire/oil_swings_as_nato_and_russian_tensions_escalate-25-sep-2025-181910-article/",
    "timestamp": "2025-09-25T19:49:44Z"
  },
  {
    "title": "Donald Trump welcomes new Irish Embassy in Washington as Tánaiste officially opens location",
    "description": "US President Donald Trump has welcomed the new Irish Embassy to the neighbourhood, as Tánaiste Simon Harris officially opened the new location on Pennsylvania Avenue.",
    "link": "https://www.independent.ie/irish-news/politics/donald-trump-welcomes-new-irish-embassy-in-washington-as-tanaiste-officially-opens-location/a1117838453.html",
    "timestamp": "2025-09-25T19:48:45Z"
  },
  {
    "title": "Donald Trump welcomes new Irish Embassy in Washington as Tánaiste officially opens location",
    "description": "US President Donald Trump has welcomed the new Irish Embassy to the neighbourhood, as Tánaiste Simon Harris officially opened the new location on Pennsylvania Avenue.",
    "link": "https://www.independent.ie/irish-news/donald-trump-welcomes-new-irish-embassy-in-washington-as-tanaiste-officially-opens-location/a1117838453.html",
    "timestamp": "2025-09-25T19:48:45Z"
  },
  {
    "title": "Donald Trump Calls On Turkey to Stop Purchasing Russian Oil",
    "description": "President Donald Trump, during a meeting with Turkish President Recep Tayyip Erdogan Thursday, called on Turkey to cease purchasing Russian oil.\nThe post Donald Trump Calls On Turkey to Stop Purchasing Russian Oil appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/25/donald-trump-calls-on-turkey-stop-purchasing-russian-oil/",
    "timestamp": "2025-09-25T19:45:16Z"
  },
  {
    "title": "Trump's just exposed GOP's 'desperation' with latest brazen 'lie': top Dem",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) laid down the law in a Thursday speech on Capitol Hill, debunking one of President Donald Trump's most brazen false claims he used as an excuse to cut off government funding talks with Democrats — and daring him to…",
    "link": "https://www.rawstory.com/hakeem-jeffries-2674040171/",
    "timestamp": "2025-09-25T19:45:03Z"
  },
  {
    "title": "Most coal-fired power plants will delay retirement to feed AI boom, energy secretary says",
    "description": "REUTERS-NEXT-NEWSMAKER-CHRISWRIGHT:Most coal-fired power plants will delay retirement to feed AI boom, energy secretary says",
    "link": "https://www.livemint.com/industry/most-coal-fired-power-plants-will-delay-retirement-to-feed-ai-boom-energy-secretary-says-11758829453189.html",
    "timestamp": "2025-09-25T19:44:12Z"
  },
  {
    "title": "Intel approaches TSMC for investments or partnership, WSJ reports",
    "description": "Chipmaker Intel has approached Taiwan Semiconductor Manufacturing Company about investments in manufacturing or partnerships, the Wall Street Journal reported on Thursday, citing people familiar with the matter. The development follows a Bloomberg report on W…",
    "link": "https://www.channelnewsasia.com/business/intel-approaches-tsmc-investments-or-partnership-wsj-reports-5370091",
    "timestamp": "2025-09-25T19:41:19Z"
  },
  {
    "title": "Ari Melber: Trump’s censorship backfires as Jimmy Kimmel scores ‘ratings bonanza’",
    "description": "Ari Melber says Trump's attempts to censor Jimmy Kimmel backfired, after the late-night comedian returned to ABC with record-breaking ratings.",
    "link": "https://www.msnbc.com/top-stories/latest/jimmy-kimmel-record-ratings-trump-censorship-backfires-rcna233754",
    "timestamp": "2025-09-25T19:40:30Z"
  },
  {
    "title": "Obsessed with Trump, Bruce Springsteen Calls for President's Impeachment... Again",
    "description": "Aging rocker Bruce Springsteen is calling for President Donald Trump to be impeached... again. \nThe post Obsessed with Trump, Bruce Springsteen Calls for President’s Impeachment… Again appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/09/25/obsessed-with-trump-bruce-springsteen-calls-for-presidents-impeachment-again/",
    "timestamp": "2025-09-25T19:40:21Z"
  },
  {
    "title": "As Albanese rejects America's rhetoric, Hastie sounds decidedly Trumpian",
    "description": "As the government rejects Trump's UNGA rhetoric, Liberal leadership aspirant Andrew Hastie sounds decidedly Trumpian.",
    "link": "https://www.abc.net.au/news/2025-09-26/michelle-grattan-analysis-andrew-hastie-sounds-trumpian/105818330",
    "timestamp": "2025-09-25T19:39:06Z"
  },
  {
    "title": "Trump told pregnant women to ‘tough it out’ instead of take Tylenol. A study of 2.5 million births in Sweden finds zero evidence to back him up",
    "description": "A dataset of children born between 1995 and 2019 who were tracked for years afterward offered scientists a rare opportunity to investigate drug use.",
    "link": "https://fortune.com/2025/09/25/trump-kennedy-tylenol-maha-zero-evidence-study-sweden-2-5-million-childbirths/",
    "timestamp": "2025-09-25T19:37:18Z"
  },
  {
    "title": "Behind the fall and resurrection of Jimmy Kimmel is a $6.2 billion merger and the pro-Republican companies that serve rural, conservative audiences",
    "description": "FCC pressure and multibillion-dollar mergers aren’t even the full story. The future of linear TV is up for grabs.",
    "link": "https://fortune.com/2025/09/25/jimmy-kimmel-disney-charlie-kirk-abc-nexstar-sinclair-tv/",
    "timestamp": "2025-09-25T19:36:55Z"
  },
  {
    "title": "Social Media Sounds The Alarm As Donald Trump Is Expected To Sign Excutive Order For New TikTok Deal",
    "description": "Under the agreement, Oracle will lead the US oversight of TikTok's algorithm and security in the United States.",
    "link": "https://hiphopwired.com/2848365/donald-trump-billionaire-buddies-tiktok-deal-oracle-rupert-murdoch-reactions/",
    "timestamp": "2025-09-25T19:36:19Z"
  },
  {
    "title": "Wisconsin Planned Parenthood pauses abortions amid federal Medicaid funding cut",
    "description": "Planned Parenthood of Wisconsin says it will stop scheduling patients for abortions starting next week as it works to provide the service in the face of Medicaid funding cuts in President Donald Trump’s tax and spending bill",
    "link": "https://www.whio.com/news/health/wisconsin-planned/ZI7RN65QFBEFFF3Z2I5HQ2HIYQ/",
    "timestamp": "2025-09-25T19:35:46Z"
  },
  {
    "title": "National poll slaps Democrats with worst rating in key category",
    "description": "Democratic Party favorability drops to 30% in Quinnipiac survey, while Republican Party approval sits at 38% and Trump's rating remains underwater.",
    "link": "https://www.foxnews.com/politics/national-poll-slaps-democrats-with-worst-rating-key-category",
    "timestamp": "2025-09-25T19:35:21Z"
  },
  {
    "title": "Trump would 'eviscerate' Fed independence with Lisa Cook firing, lawyers tell Supreme Court",
    "description": null,
    "link": "https://www.cnbc.com/2025/09/25/federal-reserve-lisa-cook-trump-scotus.html",
    "timestamp": "2025-09-25T19:34:48Z"
  },
  {
    "title": "“South Park” gives FCC chair Brendan Carr toxoplasmosis in return episode",
    "description": "After a rare delay, the animated series resumes its satirical take on current events, blasting the FCC chairman.",
    "link": "https://www.salon.com/2025/09/25/south-park-gives-fcc-chair-brendan-carr-toxoplasmosis-in-return-episode/",
    "timestamp": "2025-09-25T19:34:03Z"
  },
  {
    "title": "Is NATO trying to false-flag Trump into Ukraine?",
    "description": "The sudden chorus of Europeans crying about Russia’s supposed airspace violations comes at a convenient time Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625265-nato-trump-false-flag/",
    "timestamp": "2025-09-25T19:33:25Z"
  },
  {
    "title": "Not a Single Member of Team Trump Is Popular, Brutal Poll Shows",
    "description": "The Trump administration has not won over the hearts of America.Instead, approval ratings among independents for the chief members of the president and his Cabinet have dropped to a two-to-one negative ratio, according to a Quinnipiac poll published Wednesday…",
    "link": "https://newrepublic.com/post/200958/donald-trump-team-unpopular-poll",
    "timestamp": "2025-09-25T19:33:23Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s Latest Move to Prevent a Shutdown Is Brilliant",
    "description": "Donald Trump just pulled off a political maneuver that has Democrats reeling â\u0080\u0094 and, frankly, they should be. With a potential government shutdown looming on September 30, the Trump administration has made it clear that if Congress canâ\u0080\u0099t pass a clean Conti…",
    "link": "https://freerepublic.com/focus/f-news/4342646/posts",
    "timestamp": "2025-09-25T19:32:42Z"
  },
  {
    "title": "World Leader Compares Trump to Hitler in Front of Entire U.N.",
    "description": "Colombian President Gustavo Petro this week called for criminal proceedings against Donald Trump, whom he compared to Adolph Hitler while speaking before the United Nations General Assembly.In Petro’s final speech before the U.N. in New York on Tuesday, he ob…",
    "link": "https://newrepublic.com/post/200952/colombian-president-compares-trump-hitler-un-speech",
    "timestamp": "2025-09-25T19:32:09Z"
  },
  {
    "title": "GOP Senate Leader Says Trump's Tylenol Tirade Has Him 'Very Concerned'",
    "description": "Sen. John Thune urged leaders to be “very guarded” about giving unscientific health advice.",
    "link": "https://www.huffpost.com/entry/john-thune-trump-tylenol-autism-claims_n_68d5619fe4b0ca9d88178d1d",
    "timestamp": "2025-09-25T19:31:47Z"
  },
  {
    "title": "Latin America's Leftists Stage ‘Anti-Extremism’ U.N. Event to Counter the Rise of Conservatism",
    "description": "The leftists presidents of Chile, Brazil, Colombia, Uruguay, and the Prime Minister of Spain on Wednesday hosted a meeting \"in defense of democracy\" in New York to address the \"risks\" of growing conservative movements in the world.\nThe post Latin America’s Le…",
    "link": "https://www.breitbart.com/latin-america/2025/09/25/latin-americas-leftists-stage-anti-extremism-u-n-event-to-counter-the-rise-of-conservatism/",
    "timestamp": "2025-09-25T19:30:26Z"
  },
  {
    "title": "Trump DOJ Prepares Investigation Into Soros Organizations And It’s Quickly Leaked To Liberal Media",
    "description": "Several U.S. attorneys' offices received instructions this week to draft plans for investigating George Soros' Open Society Foundations, per the NYT.",
    "link": "https://dailycaller.com/2025/09/25/trump-doj-investigation-george-soros-open-society-foundations/",
    "timestamp": "2025-09-25T19:27:25Z"
  },
  {
    "title": "Trump DOJ official urges prosecutors to look into terrorism charges for left-wing group",
    "description": "A senior official in President Donald Trump's Department of Justice has ordered federal prosecutors around the country to investigate a group funded by billionaire Democratic donor George Soros.Trump has demanded that Soros, a longtime villain to conservative…",
    "link": "https://www.rawstory.com/george-soros-trump/",
    "timestamp": "2025-09-25T19:27:02Z"
  },
  {
    "title": "Kai Trump Launches New Product Line Straight From White House",
    "description": "Kai Trump, President Donald Trump's eldest granddaughter, launched her own clothing line Thursday with an announcement on Instagram.",
    "link": "https://dailycaller.com/2025/09/25/kai-trump-launches-fashion-line-designer-clothes-white-house-donald-trump-golf/",
    "timestamp": "2025-09-25T19:26:27Z"
  },
  {
    "title": "Bryson DeChambeau: Maga’s golf champion looks to be unlikely unifier for US at Ryder Cup",
    "description": "The 32-year-old is a polarizing figure but he is committed to getting American fans behind their team as they aim to capture victory on home soil",
    "link": "https://sports.yahoo.com/article/bryson-dechambeau-maga-golf-champion-192422316.html",
    "timestamp": "2025-09-25T19:24:22Z"
  },
  {
    "title": "Bruce Springsteen Keeps Slamming Trump Because ‘A Lot of People Bought Into His Lies’: ‘If Congress Had Guts, He’d Be Consigned to the Trash Heap of History’",
    "description": "Bruce Springsteen talks about a lot of things in his new Time magazine cover story: fame, family, therapy, touring with the E Street Band and the 50 th anniversary of his epochal “Born to Run” album — in fact, the issue appears almost exactly 50 years after h…",
    "link": "https://variety.com/2025/music/news/bruce-springsteen-slams-trump-lies-1236529483/",
    "timestamp": "2025-09-25T19:24:09Z"
  },
  {
    "title": "Chaos erupts during immigration hearing as Democrat lunges at chairman’s gavel: 'I'm tired of you' '",
    "description": "A Wisconsin Senate committee hearing on an immigration bill erupted when Democrat Tim Carpenter called Republicans 'cowards' and questioned their Christianity.",
    "link": "https://www.foxnews.com/politics/chaos-erupts-during-immigration-hearing-democrat-lunges-chairmans-gavel-im-tired-you",
    "timestamp": "2025-09-25T19:22:24Z"
  },
  {
    "title": "DOJ official directs prosecutors to prepare probes of George Soros' foundation",
    "description": "DOJ official directs prosecutors to prepare probes of George Soros' foundationgo.com",
    "link": "https://abcnews.go.com/US/doj-official-directs-prosecutors-prepare-probes-george-soros/story?id=125941089",
    "timestamp": "2025-09-25T19:22:00Z"
  },
  {
    "title": "Trump Admin's $20 Billion 'Bail Out' for Argentina's Milei Raises Eyebrows",
    "description": "The Trump administration says it is working to provide tens of billions of dollars to Argentina's President Javier Milei, in a financial bailout that many critics say clashes with President Donald Trump's “America First” platform.\nThe U.S. State Department to…",
    "link": "https://biztoc.com/x/b410394aef19b06b",
    "timestamp": "2025-09-25T19:17:57Z"
  },
  {
    "title": "‘Every Single Moment of Pregnancy Is a Critical Time’: HHS Official Responds to Women Popping Tylenol to Spite Trump",
    "description": "As videos circulate of pregnant women popping Tylenol tablets to spite Donald Trump, the head of the Department of Health and Human Services’ Office of... Read More\nThe post ‘Every Single Moment of Pregnancy Is a Critical Time’: HHS Official Responds to Women…",
    "link": "https://www.dailysignal.com/2025/09/25/every-single-moment-pregnancy-is-critical-time-hhs-official-responds-women-popping-tylenol-spite-trump/",
    "timestamp": "2025-09-25T19:15:48Z"
  },
  {
    "title": "Weekly news quiz: A viral Donald Trump moment, a retracted study and daylight saving time",
    "description": "It's that time of the week again. Test your news knowledge to see how much you remember for the week that was.",
    "link": "https://www.abc.net.au/news/2025-09-26/abc-weekly-news-quiz-friday/105815222",
    "timestamp": "2025-09-25T19:15:14Z"
  },
  {
    "title": "Every Living Ex-Fed Chair Urges Supreme Court to Stop Trump",
    "description": "Every living former chair of the Federal Reserve Bank agrees that the Supreme Court should prevent President Donald Trump’s effort from ousting Fed Governor Lisa Cook. An amicus brief filed Thursday argued that removing Cook would “threaten [the] independence…",
    "link": "https://newrepublic.com/post/200957/ex-federal-reserve-chairs-supreme-court-donald-trump-lisa-cook",
    "timestamp": "2025-09-25T19:15:05Z"
  },
  {
    "title": "Will Donald Trump’s plan for Gaza work?",
    "description": "The US president has presented a proposal to end Israel's war on the Gaza Strip.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/9/25/will-donald-trumps-plan-for-gaza-work",
    "timestamp": "2025-09-25T19:14:59Z"
  },
  {
    "title": "Trump presents new Gaza peace plan to Arab and Muslim leaders - Financial Times",
    "description": "Trump presents new Gaza peace plan to Arab and Muslim leadersFinancial Times Trump Assures Arab Leaders He Won’t Allow Israel to Annex West Bank, Officials SayThe New York Times Donald Trump pledges to prevent Israeli annexation of the occupied West BankFinan…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179533322",
    "timestamp": "2025-09-25T19:12:47Z"
  },
  {
    "title": "Democrats dismiss White House's shutdown layoff threat as \"intimidation\"",
    "description": "Democratic leaders dismissed the White House's recent threat that a government shutdown could spur large-scale layoffs of the federal workforce as \"intimidation.\"",
    "link": "https://www.cbsnews.com/news/government-shutdown-layoffs-democrats/",
    "timestamp": "2025-09-25T19:11:15Z"
  },
  {
    "title": "Palestinian president tells UN 'we will not leave our lands' and condemns Hamas attack",
    "description": "Palestinian President Mahmoud Abbas told the UN General Assembly that Gazans are enduring a \"war of genocide, destruction, starvation and displacement\". He also condemned Hamas's attack on 7 October 2023.",
    "link": "https://news.sky.com/story/palestinian-president-tells-un-we-will-not-leave-our-lands-and-condemns-hamas-attack-13438111",
    "timestamp": "2025-09-25T19:10:00Z"
  },
  {
    "title": "CNN Anchor Confronts Trump Fan On Profiting From Presidency ‘In Broad Daylight’",
    "description": "CNN anchor Abby Phillip confronted Trump supporters over President Donald Trump and his family \"profiting\" from the presidency \"in broad daylight.\"\nThe post CNN Anchor Confronts Trump Fan On Profiting From Presidency ‘In Broad Daylight’ first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/cnn-anchor-confronts-trump-fan-on-profiting-from-presidency-in-broad-daylight/",
    "timestamp": "2025-09-25T19:09:42Z"
  },
  {
    "title": "If NATO Downs Russian Plane, There Will be War — Ambassador to France",
    "description": "\"Quite a few planes violate Russia's airspace, accidentally and not accidentally. No one shoots them down,\" Alexey Meshkov emphasizedPARIS, September 25. /TASS/. Russia’s ambassador to France Alexey Meshkov has warned that if NATO were shooting down Russian p…",
    "link": "https://freerepublic.com/focus/f-news/4342639/posts",
    "timestamp": "2025-09-25T19:09:40Z"
  },
  {
    "title": "Mahmoud Abbas, Banned from U.S. by Trump, Demands Palestinian State at U.N.",
    "description": "Palestinian Authority President Mahmoud Abbas addressed the U.N. General Assembly in New York City on Thursday by video link, since he and the rest of his delegation were denied visas to enter the United States for reasons of national security.\nThe post Mahmo…",
    "link": "https://www.breitbart.com/middle-east/2025/09/25/mahmoud-abbas-banned-from-u-s-by-trump-demands-palestinian-state-at-u-n/",
    "timestamp": "2025-09-25T19:08:28Z"
  },
  {
    "title": "Required Reading",
    "description": "This week: how Serbia inspired the Renaissance, an independent magazine sues ICE, Shakespeare’s enigmatic rival, audiobook narrators deserve better, the music of Palestinian tatreez, and more.",
    "link": "http://hyperallergic.com/1044663/required-reading-752/",
    "timestamp": "2025-09-25T19:08:21Z"
  },
  {
    "title": "Fox’s Maria Bartiromo Calls for ‘Answers’ on Trump’s UN Escalator Woes — Omits UN Spokesman’s Statement",
    "description": "Fox News anchor Maria Bartiromo lamented that President Donald Trump's troubles with the escalator at the United Nations \"could have been a massive, massive issue\" and called for \"answers\" -- omitting the statement a UN spokesman had already released on the m…",
    "link": "https://www.mediaite.com/media/tv/foxs-maria-bartiromo-calls-for-answers-on-trumps-un-escalator-woes-omits-un-spokesmans-statement/",
    "timestamp": "2025-09-25T19:06:22Z"
  },
  {
    "title": "3589 - FBI’s War on Trans People; Trump’s Pro-Israel Enforcer w/ Ken Klippenstein, Connor Echols",
    "description": "It's Emmajority Thursday on the Majority Report On today's show: Trump has been \"Triple Sabotaged\" at the UN as the escalator fails to work as he and the First Lady entered the stair well, fortunately Melania was not hurt. Then his teleprompter cut out, and h…",
    "link": "https://majorityfm.libsyn.com/3589-fbis-war-on-trans-people-trumps-pro-israel-enforcer-w-ken-klippenstein-connor-echols",
    "timestamp": "2025-09-25T19:06:00Z"
  },
  {
    "title": "Trump Anoints Himself Judge, Jury And Executioner Of Alleged Drug Smugglers",
    "description": "While the president jokes about the killings, legal experts worry he could use the same logic to target others, even those in the U.S.",
    "link": "https://www.huffpost.com/entry/trump-executioner-drug-smugglers_n_68d48e39e4b01e99f72d7c02",
    "timestamp": "2025-09-25T19:05:42Z"
  },
  {
    "title": "The West is now a war zone where a bulletproof vest is required to speak",
    "description": "There will never be enough bulletproof vests for all dissenters.  Opinion.",
    "link": "https://www.israelnationalnews.com/news/415423",
    "timestamp": "2025-09-25T19:05:39Z"
  },
  {
    "title": "The DOJ drops inquiry into Sandy Hook first responder. But the damage is already done.",
    "description": "Jen Psaki breaks down the controversy involving Trump's handpicked DOJ official, Ed Martin, conspiracy theorist Alex Jones and a Sandy Hook first responder.",
    "link": "https://www.msnbc.com/top-stories/latest/sandy-hook-alex-jones-infowars-conspiracy-ed-martin-rcna233714",
    "timestamp": "2025-09-25T19:01:34Z"
  },
  {
    "title": "Days After Saying Govt Shouldn’t Threaten Media Orgs, Dem Senators Launch Probe of Nexstar, Sinclair",
    "description": "\"...the statements from FCC Chairman Carr and President Trump represent an extraordinary abuse of power that jeopardizes all Americans’ First Amendment rights. These moves should be investigated to determine if they violate federal law.\"\nThe post Days After S…",
    "link": "https://legalinsurrection.com/2025/09/days-after-saying-govt-shouldnt-threaten-media-orgs-dem-senators-launch-probe-of-nexstar-sinclair/",
    "timestamp": "2025-09-25T19:00:11Z"
  },
  {
    "title": "Gulf Countries Need to De-Risk Their Relationship with the U.S.",
    "description": "On 9 September, Israel attacked Qatar, a U.S. ally that was hosting a Hamas delegation that was considering a peace proposal from U.S. President Donald Trump. Israel killed three low-ranking officials, a child of a delegation member, and a Qatari security off…",
    "link": "https://oilprice.com/Geopolitics/Middle-East/Gulf-Countries-Need-to-De-Risk-Their-Relationship-with-the-US.html",
    "timestamp": "2025-09-25T19:00:00Z"
  },
  {
    "title": "Trump Gives 'Embarrassing' Excuse for Friendship With Epstein... as Prez Desperately Tries to Bury His Connection to Late Sex Offender",
    "description": "Donald Trump's ties to Jeffrey Epstein won't go away, as the president is said to have had a bizarre excuse to explain their connection, according to a report.",
    "link": "https://radaronline.com/p/trump-embarrassing-excuse-friendship-with-epstein-palm-beach/",
    "timestamp": "2025-09-25T19:00:00Z"
  },
  {
    "title": "After two week delay, Kehoe to sign Missouri's new congressional maps Sunday",
    "description": "The new map was sought by President Donald Trump to offset the possible loss of GOP seats in the U.S. House in next year's mid-term elections",
    "link": "https://www.stltoday.com/news/local/government-politics/article_424f43cf-595c-499a-987d-ed48e2923d10.html",
    "timestamp": "2025-09-25T19:00:00Z"
  },
  {
    "title": "Democrat Rep. Haley Stevens Filing to Impeach HHS Secretary RFK Jr.",
    "description": "Rep. Haley Stevens (D-MI) announced she is introducing articles of impeachment against Health and Human Services (HHS) Secretary Robert F. Kennedy Jr., citing what she called “health care chaos” under his leadership.\nThe post Democrat Rep. Haley Stevens Filin…",
    "link": "https://www.breitbart.com/politics/2025/09/25/democrat-rep-haley-stevens-filing-to-impeach-hhs-secretary-rfk-jr/",
    "timestamp": "2025-09-25T18:59:48Z"
  },
  {
    "title": "See Before And After Photos Of Trump's Latest White House Renovation Project",
    "description": "The president has made it his mission to impose his own taste on the People's House during his second term.",
    "link": "https://www.huffpost.com/entry/trump-white-house-palm-room_n_68d563f6e4b0b2f96b451ad1",
    "timestamp": "2025-09-25T18:59:17Z"
  },
  {
    "title": "Tesla asks EPA not to roll back emissions rules as Trump calls climate change a ‘con job’",
    "description": "Tesla has asked the Environmental Protection Agency not to roll back current vehicle emissions standards, breaking from other major automakers who want to see the rules eased. The company’s request comes the same week that President Donald Trump — who Tesla C…",
    "link": "https://biztoc.com/x/ec6ff9d0f76d08af",
    "timestamp": "2025-09-25T18:59:07Z"
  },
  {
    "title": "Lear deBessonet’s Number-One Goal For Lincoln Center Theater",
    "description": "Lear deBessonet, the new artistic director of Lincoln Center Theater, has chosen “Ragtime” as her first show. The musical, which she previously directed off-Broadway, explores early 20th-century America through diverse characters. Opening night is Oct. 16. De…",
    "link": "https://apnews.com/article/lincoln-center-ragtime-4f44f7c418c7643e8a572d66652481f3",
    "timestamp": "2025-09-25T18:59:00Z"
  },
  {
    "title": "Hegseth summons top military leaders to Quantico",
    "description": "Secretary Pete Hegseth has summoned hundreds of generals and admirals to a base in northern Virginia for a sudden meeting next week.",
    "link": "https://www.wcvb.com/article/hegseth-military-meeting-generals-admirals-quantico/68060597",
    "timestamp": "2025-09-25T18:58:36Z"
  },
  {
    "title": "Oracle, Silver Lake, MGX Discuss 45% TikTok Stake, Board Seats",
    "description": "Oracle Corp., Silver Lake Management LLC, and the Abu Dhabi-based investment company MGX are in talks to invest in a US version of TikTok and receive board seats in the new venture, according to people familiar with the discussions.",
    "link": "https://financialpost.com/pmn/business-pmn/oracle-silver-lake-mgx-discuss-45-tiktok-stake-board-seats",
    "timestamp": "2025-09-25T18:58:05Z"
  },
  {
    "title": "New legislation calls for Charlie Kirk to be depicted on US currency",
    "description": "Two Republican lawmakers have introduced a bill that would authorize the minting of 400,000 silver dollar coins featuring the image of Charlie Kirk, FOX News reported Sept. 24. The proposal, brought forward by Reps. August Pfluger, R-Texas, and Abe Hamadeh, R…",
    "link": "https://freerepublic.com/focus/f-news/4342635/posts",
    "timestamp": "2025-09-25T18:57:41Z"
  },
  {
    "title": "‘Foolish’: Fox’s Andy McCarthy Condemns Trump DOJ Pursuing a Case Against Comey",
    "description": "Fox News' Andy McCarthy came out against the Trump administration's prospective prosecution of ex-FBI Director James Comey on Thursday.\nThe post ‘Foolish’: Fox’s Andy McCarthy Condemns Trump DOJ Pursuing a Case Against Comey first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foolish-foxs-andy-mccarthy-condemns-trump-doj-pursuing-a-case-against-comey/",
    "timestamp": "2025-09-25T18:57:28Z"
  },
  {
    "title": "Hegseth summons top military leaders to Quantico",
    "description": "Secretary Pete Hegseth has summoned hundreds of generals and admirals to a base in northern Virginia for a sudden meeting next week.",
    "link": "https://www.wmur.com/article/hegseth-military-meeting-generals-admirals-quantico/68060597",
    "timestamp": "2025-09-25T18:56:56Z"
  },
  {
    "title": "Media opinion: Kimmel back on TV a hollow Dem victory",
    "description": "Democrats in Congress are so lost in the woods right now that they are taking a victory lap over the return of Jimmy Kimmel to late night television.",
    "link": "https://www.bostonherald.com/2025/09/25/matt-fleming-democrats-need-to-aim-higher-than-kimmel-victory/",
    "timestamp": "2025-09-25T18:56:37Z"
  },
  {
    "title": "Tesla asks EPA not to roll back emissions rules as Trump calls climate change a 'con job' | TechCrunch",
    "description": "The company's regulatory policy team is trying to clean up a mess that CEO Elon Musk spent $300 million to help create.",
    "link": "https://techcrunch.com/2025/09/25/tesla-asks-epa-not-to-roll-back-emissions-rules-as-trump-calls-climate-change-a-con-job/",
    "timestamp": "2025-09-25T18:56:22Z"
  },
  {
    "title": "Austria military ditches Microsoft for open-source LibreOffice - here's why",
    "description": "It's not about the cost savings, either. Many government organizations are replacing Microsoft software for a more important reason.",
    "link": "https://www.zdnet.com/article/austria-military-ditches-microsoft-for-open-source-libreoffice-here-is-why/",
    "timestamp": "2025-09-25T18:56:00Z"
  }
]