[
  {
    "title": "Iowa Could Ban Trans Care Under Medicaid",
    "description": "A Republican-backed budget bill advancing through the Iowa Senate could stop Medicaid and other taxpayer-funded programs from covering gender-affirming care.",
    "link": "https://www.newsweek.com/iowa-could-ban-trans-care-under-medicaid-taxpayer-funded-programs-2066584",
    "timestamp": "2025-05-01T10:53:37Z"
  },
  {
    "title": "GM CEO Mary Barra says tariffs will cost the company up to $5 billion this year | CNN Business",
    "description": "The Trump administration’s tariffs on imported cars and auto parts will cost General Motors between $4 billion and $5 billion this year, as the nation’s largest automaker slashed its earnings projections.",
    "link": "https://www.cnn.com/2025/05/01/business/gm-ceo-barra-tariffs-cost",
    "timestamp": "2025-05-01T10:52:35Z"
  },
  {
    "title": "Sam Altman Brings Iris-Scanning Company World to US",
    "description": "Sam Altman’s digital identity effort World made its official U.S. launch. As the Financial Times (FT) reported late Wednesday (April 30), the debut of this project — which involves eyeball scanning technology and a digital token — is happening as the U.S. gov…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/sam-altman-brings-iris-scanning-company-world-to-us/",
    "timestamp": "2025-05-01T10:52:22Z"
  },
  {
    "title": "Kamala Harris Torches Trump’s First 100 Days as ‘Wholesale Abandonment’ of American ‘Ideals’: ‘Clearly Inviting a Recession’",
    "description": "Former Vice President Kamala Harris came out swinging Wednesday night, issuing her most blistering rebuke yet of President Donald Trump’s return to power — and slamming his tariffs strategy for creating the “greatest man-made economic crisis in modern preside…",
    "link": "https://www.mediaite.com/news/kamala-harris-torches-trumps-first-100-days-as-wholesale-abandonment-of-american-ideals-clearly-inviting-a-recession/",
    "timestamp": "2025-05-01T10:50:42Z"
  },
  {
    "title": "GM Lowers Guidance as Trump Tariffs Will Cost Up to $5 Billion",
    "description": "General Motors Co. lowered its full-year profit outlook, just two days after suspending earnings guidance, citing exposure to as much as $5 billion in auto tariffs being levied by President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/gm-lowers-guidance-as-trump-tariffs-will-cost-up-to-5-billion",
    "timestamp": "2025-05-01T10:49:54Z"
  },
  {
    "title": "Texas Sheriff Wants to Assist ICE In Schools, Deport 'Regardless of Age'",
    "description": "The Trump administration has allowed federal immigration agents to make arrests in sensitive areas such as schools and churches.",
    "link": "https://www.newsweek.com/texas-sheriff-ice-schools-deportations-age-2066559",
    "timestamp": "2025-05-01T10:48:36Z"
  },
  {
    "title": "Democrat Skipping Trump Tariff Vote Sparks Anger",
    "description": "Senator Sheldon Whitehouse missed the vote to rebuke Trump's global tariffs on Wednesday, which ended in a 49-49 tie.",
    "link": "https://www.newsweek.com/trump-tariffs-vote-sheldon-whitehouse-2066581",
    "timestamp": "2025-05-01T10:48:02Z"
  },
  {
    "title": "Tesla denies reports it contacted recruiters to help it replace Elon Musk as CEO",
    "description": "Tesla has denied reports it has contacted recruitment firms to being a search for a chief executive to replace Elon Musk.",
    "link": "https://www.independent.ie/world-news/tesla-denies-reports-it-contacted-recruiters-to-help-it-replace-elon-musk-as-ceo/a221501694.html",
    "timestamp": "2025-05-01T10:46:32Z"
  },
  {
    "title": "Trump's Rogue Deep-Sea Mining Order Endangers Our Ocean and Our Future",
    "description": "On April 24, U.S. President Donald Trump signed an executive order to fast-track deep-sea mining in U.S. and international waters that sidelines international law and puts fragile ocean ecosystems, Indigenous rights, and millions of lives that depend on a hea…",
    "link": "https://www.commondreams.org/opinion/trump-deep-sea-mining",
    "timestamp": "2025-05-01T10:45:02Z"
  },
  {
    "title": "Washington Must Continue to Rollback Democrat-Era Financial Regulatory Abuses | Opinion",
    "description": "A depoliticized financial sector is vital not only to protect individual industries, but to uphold broader American principles of free enterprise, innovation, and opportunity.",
    "link": "https://www.newsweek.com/washington-must-continue-rollback-democrat-era-financial-regulatory-abuses-opinion-2066390",
    "timestamp": "2025-05-01T10:45:01Z"
  },
  {
    "title": "Warren Buffett and Berkshire Hathaway at a glance",
    "description": "Warren Buffett, 94, and his successors will address Berkshire Hathaway shareholders at the annual meeting in Omaha. The event, broadcast on CNBC, will cover Berkshire's record profits, major stock investments like Apple, and diverse operating businesses. Buff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/warren-buffett-and-berkshire-hathaway-at-a-glance/articleshow/120792528.cms",
    "timestamp": "2025-05-01T10:44:48Z"
  },
  {
    "title": "Ukraine Hails 'Important Milestone' Trump Rare Earths Minerals Deal Signed With U.S.",
    "description": "President Donald Trump saluted the deal as saving America from \"looking foolish\" for having funded the Ukraine War in return for nothing. \nThe post Ukraine Hails ‘Important Milestone’ Trump Rare Earths Minerals Deal Signed With U.S. appeared first on Breitbar…",
    "link": "https://www.breitbart.com/europe/2025/05/01/ukraine-hails-important-milestone-trump-rare-earths-minerals-deal-signed-with-u-s/",
    "timestamp": "2025-05-01T10:40:28Z"
  },
  {
    "title": "Grattan on Friday: Key markers on the bumpy road to this election",
    "description": "With the election nearly over, Michelle Grattan takes a look back at what were the key markets of what felt like a very long campaign.",
    "link": "https://theconversation.com/grattan-on-friday-key-markers-on-the-bumpy-road-to-this-election-255613",
    "timestamp": "2025-05-01T10:40:11Z"
  },
  {
    "title": "Anonymous fires shot at Donald Trump with ‘photoshopped image’ after President’s first 100 days interview",
    "description": "Anonymous has poked fun at Donald Trump's reluctance to 'facilitate the return' of El Salvador inmate Kilmar Abrego Garcia",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-anonymous-ms13-tattoo-photoshop-187048-20250501",
    "timestamp": "2025-05-01T10:39:26Z"
  },
  {
    "title": "Transcript: Trump’s Fury Erupts in Crazed Rants over Shrinking Economy",
    "description": "The following is a lightly edited transcript of the May 1 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nPresident D…",
    "link": "https://newrepublic.com/article/194657/transcript-trump-fury-erupts-crazed-rants-shrinking-economy",
    "timestamp": "2025-05-01T10:38:02Z"
  },
  {
    "title": "Of Course Trump Got His Grubby Little Hands On The Holocaust Memorial Board",
    "description": "Of course, Donald's administration has their grubby little hands all over the Holocaust Memorial Museum board. Imagine if Biden or Obama did this. Donald's administration fired former second gentleman Doug Emhoff, who is Jewish, and other Biden-era appointees…",
    "link": "https://crooksandliars.com/2025/04/course-trump-got-his-grubby-little-hands",
    "timestamp": "2025-05-01T10:36:45Z"
  },
  {
    "title": "'Don't shut up': Canadian auto sector's strategy to fight Trump tariffs",
    "description": "A top figure in Canada’s automotive sector has a clear message for fellow leaders as U.S. President Donald Trump’s tariffs upend the industry: “Speak up.”",
    "link": "https://www.cbc.ca/news/canada/windsor/trump-tariffs-auto-canada-parts-media-strategy-us-change-1.7523389",
    "timestamp": "2025-05-01T10:35:18Z"
  },
  {
    "title": "US And Ukraine Sign Mineral Resource Deal",
    "description": "The U.S. and Ukraine have officially signed an agreement granting the U.S. access to Ukraine's mineral resources. Two parties inked the deal two months after a heated meeting at the White House between two presidents, Donald Trump and Volodymyr Zelensky, abru…",
    "link": "https://biztoc.com/x/4adfeab3bd079bdc",
    "timestamp": "2025-05-01T10:35:04Z"
  },
  {
    "title": "John Bolton on why Trump 2.0 is going nowhere, fast",
    "description": "John Bolton served as national security adviser under the first Trump administration.\nTo kick off his second term, President Donald Trump sought revenge on President Joe Biden, elite law firms, elite universities, and even some of his former staffers — includ…",
    "link": "https://biztoc.com/x/ae7bf426a46cc426",
    "timestamp": "2025-05-01T10:34:42Z"
  },
  {
    "title": "U.S. signs new mineral deal with Ukraine: ‘It is about investments, investments and investments’",
    "description": "The U.S. and Ukraine have signed a major economic agreement granting America preferential access to Ukraine's rare earth resources through a jointly run investment fund, signaling improved relations between Donald Trump and Volodymyr Zelensky. While the deal …",
    "link": "https://biztoc.com/x/b9420a5fa9d7b7ff",
    "timestamp": "2025-05-01T10:34:29Z"
  },
  {
    "title": "Trump 'inherited an 0-12 football team' from Biden, Sen Tuberville says",
    "description": "President Donald Trump took over \"an 0-12 football team\" when he was sworn into the White House, said former coach-turned-senator, Sen. Tommy Tuberville.",
    "link": "https://www.foxnews.com/sports/trump-inherited-0-12-football-team-from-biden-sen-tuberville-says",
    "timestamp": "2025-05-01T10:32:38Z"
  },
  {
    "title": "Kamala Harris comes knives out against Trump in first speech since leaving office: ‘Absolute chaos’ - Fox News",
    "description": "Kamala Harris comes knives out against Trump in first speech since leaving office: ‘Absolute chaos’Fox News Kamala Harris says ‘courage is contagious’ in major speech excoriating TrumpThe Guardian Harris comes out of hibernation to reignite war with TrumpThe …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177235113",
    "timestamp": "2025-05-01T10:32:34Z"
  },
  {
    "title": "Elon Musk was asked who would lead DOGE after he quits. He invokes Buddha and Buddhism",
    "description": "Elon Musk is reportedly set to quit the Department of Government Efficiency (DOGE) this month as his 130-day stint ends. DOGE chief Elon Musk claimed that his federal workforce slashing initiative so far has saved $160 billion — far less than his original pro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-was-asked-who-would-lead-doge-after-he-quits-he-invokes-buddha-and-buddhism/articleshow/120792180.cms",
    "timestamp": "2025-05-01T10:32:32Z"
  },
  {
    "title": "CVS Plans To Exit Obamacare In 2026, Impacting 1 Million Aetna Members",
    "description": "CVS Health plans to exit the individual Obamacare health insurance business next year, leaving 1 million people in 17 states looking for new coverage in 2026.",
    "link": "https://www.forbes.com/sites/brucejapsen/2025/05/01/cvs-plans-to-exit-obamacare-in-2026-impacting-1-million-aetna-members/",
    "timestamp": "2025-05-01T10:30:40Z"
  },
  {
    "title": "Parents of Hamas hostages urge Trump to be 'tough with enemies and friends' amid Israeli siege in Gaza",
    "description": "Parents of American hostages still held in the Gaza Strip urge President Trump to be \"tough\" not only on Hamas but on Israeli Prime Minister Netanyahu and return to peace negotiations.",
    "link": "https://www.foxnews.com/world/parents-hamas-hostages-urge-trump-tough-enemies-friends-amid-israeli-siege-gaza",
    "timestamp": "2025-05-01T10:30:31Z"
  },
  {
    "title": "Worldcoin: Sam Altman’s iris scanner launches in the U.S. – Are Trump’s policies why?",
    "description": "You won’t believe what this crypto firm is asking for in exchange for tokens - and why Americans are lining up.",
    "link": "https://ambcrypto.com/worldcoin-sam-altmans-iris-scanner-launches-in-the-u-s-are-trumps-policies-why/",
    "timestamp": "2025-05-01T10:30:10Z"
  },
  {
    "title": "PBS doc makers on staying the course amid Trump’s defunding threats",
    "description": "HOT DOCS: Execs at two of PBS’s main documentary series have said they are staying the course amid ongoing threats from US president Donald Trump that could see the public media organisation's funding axed.",
    "link": "https://www.c21media.net/department/thought-leadership/pbs-doc-makers-on-staying-the-course-amid-trumps-defunding-threats/",
    "timestamp": "2025-05-01T10:30:10Z"
  },
  {
    "title": "PBS doc makers on staying the course amid Trump’s defunding threats",
    "description": "Execs at two of PBS's main documentary series have said they are staying the course amid ongoing threats from US president Donald Trump that could see the public media organisation’s funding axed...",
    "link": "https://www.c21media.net/department/news-analysis/pbs-doc-makers-on-staying-the-course-amid-trumps-defunding-threats/",
    "timestamp": "2025-05-01T10:30:10Z"
  },
  {
    "title": "He Made A Billion Building Houses For Florida’s “Marvelous Middle.” Now Things Aren’t So Marvelous.",
    "description": "Pat Neal made a fortune constructing homes for the middle and upper middle class. But now those consumers are pulling back amid the economic turmoil.",
    "link": "https://www.forbes.com/sites/monicahunter-hart/2025/05/01/he-made-a-billion-building-houses-for-floridas-marvelous-middle-now-things-arent-so-marvelous/",
    "timestamp": "2025-05-01T10:30:00Z"
  },
  {
    "title": "Metaplanet enters US Bitcoin market with new subsidiary, eyes $250 million boost",
    "description": "Japanese Bitcoin investment firm Metaplanet is entering the US market with the launch of Metaplanet Treasury Corp., a wholly-owned arm based in Florida. According to a May 1 statement, the firm said the move signals a major step in its strategy to grow its gl…",
    "link": "https://cryptoslate.com/metaplanet-enters-us-bitcoin-market-with-new-subsidiary-eyes-250-million-boost/",
    "timestamp": "2025-05-01T10:29:17Z"
  },
  {
    "title": "U.S. hits Iran with more sanctions amid talks on new nuclear deal",
    "description": "Washington DC (UPI) May 1, 2025 \n\n\n The United States has imposed another round of sanctions targeting Iran, seeking to stem its petrochemical profits amid ongoing nuclear talks between the two countries. \n The State Department announced the sanctions Wednesd…",
    "link": "https://www.spacewar.com/reports/US_hits_Iran_with_more_sanctions_amid_talks_on_new_nuclear_deal_999.html",
    "timestamp": "2025-05-01T10:27:42Z"
  },
  {
    "title": "China blames US tariffs for halting Boeing plane deliveries",
    "description": "Beijing (AFP) April 29, 2025\n\n\n China on Tuesday blamed US tariffs for Beijing's decision to stop accepting new aircraft from aviation giant Boeing, saying the levies had \"disrupted the international air transport market\". \n\n\"The United States' wielding of ta…",
    "link": "https://www.spacedaily.com/reports/China_blames_US_tariffs_for_halting_Boeing_plane_deliveries_999.html",
    "timestamp": "2025-05-01T10:27:42Z"
  },
  {
    "title": "Pentagon's AI metals program goes private in bid to boost Western supply deals",
    "description": "Armed with the AI model, the CMF aims to help manufacturers curb their reliance on China by signing more metal supply deals with Western mines, according to more than two dozen industry consultants, purchasing agents, analysts, regulators and investors who to…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/pentagons-ai-metals-program-goes-private-in-bid-to-boost-western-supply-deals/articleshow/120792199.cms",
    "timestamp": "2025-05-01T10:27:34Z"
  },
  {
    "title": "US defence body clears supply of military hardware to India",
    "description": "The United States has approved a USD 131 million military hardware and logistic support package for India, enhancing strategic ties. This \"foreign military sale\" supports the Indo-Pacific Maritime Domain Awareness program. The deal includes sea-vision softwar…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-defence-body-clears-supply-of-military-hardware-to-india/articleshow/120792196.cms",
    "timestamp": "2025-05-01T10:27:23Z"
  },
  {
    "title": "US' Q1 economic contraction something of a head fake - for now",
    "description": "US Q1 Economic Contraction: Despite a first-quarter contraction driven by tariff-related import surges, the US economy shows resilience. Consumer spending remains steady, supported by a stable labor market through April. While businesses express concerns, cap…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-q1-economic-contraction-something-of-a-head-fake-for-now/articleshow/120792048.cms",
    "timestamp": "2025-05-01T10:27:20Z"
  },
  {
    "title": "Airbus will avoid Trump tariffs by delivering planes to US airlines in countries outside America, its CEO says",
    "description": "Airbus and Delta Air Lines are using the same tactic from a past trade war to avoid tariffs by sending aircraft to other countries.",
    "link": "https://www.businessinsider.com/airbus-avoiding-trump-tariffs-sending-us-planes-to-other-countries-2025-5",
    "timestamp": "2025-05-01T10:26:45Z"
  },
  {
    "title": "Ukraine expected to ratify US minerals deal lacking security guarantees",
    "description": "Deal hailed as 'diplomatic win' for Ukraine, but former Russian President Medvedev says Trump has 'broken' Kyiv.",
    "link": "https://www.aljazeera.com/news/2025/5/1/ukrainian-lawmakers-expected-to-ratify-us-minerals-deal",
    "timestamp": "2025-05-01T10:25:24Z"
  },
  {
    "title": "Donald Trump's Strange Pizza Habit Will Shock You — And It Might Be Healthy!",
    "description": "Donald Trump's daily diet is another often debated issue regarding the current US president, aside from his divisive policies and contentious remarks.",
    "link": "https://www.inquisitr.com/donald-trumps-strange-pizza-habit-will-shock-you-and-it-might-be-healthy",
    "timestamp": "2025-05-01T10:25:04Z"
  },
  {
    "title": "Yellen Warns US Recession Risk Is ‘Way Up’ After Trump’s Tariffs",
    "description": "Janet Yellen warned that the risk of a US recession has “gone way up” after Donald Trump’s sweeping tariffs rattled financial markets, consumers and businesses.",
    "link": "https://financialpost.com/pmn/business-pmn/yellen-warns-us-recession-risk-is-way-up-after-trumps-tariffs",
    "timestamp": "2025-05-01T10:24:18Z"
  },
  {
    "title": "Trump wants more manufacturing. Here are 7 forces at play, 6 of which complicate that goal",
    "description": "President Donald Trump is zigging and zagging on tariffs — They’re on! They’re off! Exceptions! No exceptions! — but he’s been steadily consistent on one thing: He wants to restore America’s manufacturing base.\nThat’s a goal that has eluded three previous adm…",
    "link": "https://biztoc.com/x/79861b9e87233580",
    "timestamp": "2025-05-01T10:24:01Z"
  },
  {
    "title": "World Liberty's Stablecoin Will Be Used to Close MGX's $2B Binance Investment: Eric Trump",
    "description": "Eric Trump, son of U.S. President Donald Trump, said that World Liberty Financial's dollar denominated stablecoin (USD1) has been officially selected as the official stablecoin to close MGX’s $2 billion investment in Binance.\nSpeaking at the Token2049 event i…",
    "link": "https://biztoc.com/x/c0d6a07c7b827bac",
    "timestamp": "2025-05-01T10:23:41Z"
  },
  {
    "title": "World Liberty's Stablecoin Will Be Used to Close MGX's $2B Binance Investment: Eric Trump",
    "description": "Eric Trump, son of U.S. President Donald Trump, said that World Liberty Financial's dollar denominated stablecoin (USD1) has been officially selected as the official stablecoin to close MGX’s $2 billion investment in Binance.\nSpeaking at the Token2049 event i…",
    "link": "https://biztoc.com/x/c0d6a07c7b827bac",
    "timestamp": "2025-05-01T10:23:41Z"
  },
  {
    "title": "Big Tech's fortunes diverge as AI powers cloud, tariffs hit consumer electronics",
    "description": "​​AI came to the rescue of earnings at Microsoft and Google-parent Alphabet in their March quarter, offering investors hope that their billion-dollar bets on the technology would help them ride out the fallout from sweeping US tariffs. The Trump administratio…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/big-techs-fortunes-diverge-as-ai-powers-cloud-tariffs-hit-consumer-electronics/articleshow/120792125.cms",
    "timestamp": "2025-05-01T10:21:43Z"
  },
  {
    "title": "How the economy may frustrate Trump’s drive to expand presidential power",
    "description": "Amid the daily tumult of President Donald Trump’s second term, the political struggles over his economic agenda and his challenges to the basic rules of democracy may seem independent and unconnected. But the outcome of these two fights may converge to a much…",
    "link": "https://www.cnn.com/2025/05/01/politics/second-presidency-trump-100-days",
    "timestamp": "2025-05-01T10:20:29Z"
  },
  {
    "title": "Trump sends Independence Day greetings to Israel",
    "description": "US President Donald Trump and other leaders from around the world send Israeli President Isaac Herzog greetings honoring Israel's 77th Independence Day. 'Through conflict and peace, the United States remains your steadfast partner.'",
    "link": "https://www.israelnationalnews.com/news/407694",
    "timestamp": "2025-05-01T10:20:18Z"
  },
  {
    "title": "European real estate recovery thrown off course by Trump uncertainty, says MSCI",
    "description": "LONDON (Reuters) -A nascent recovery in Europe's real estate market has been derailed by global economic uncertainty in the early months of U.S. President...",
    "link": "https://finance.yahoo.com/news/european-real-estate-recovery-thrown-101920532.html",
    "timestamp": "2025-05-01T10:19:20Z"
  },
  {
    "title": "Musk denies WSJ report Tesla board seeks to replace him",
    "description": "The Wall Street Journal is a “discredit to journalism,” the world’s richest man has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616611-musk-tesla-ceo-wsj/",
    "timestamp": "2025-05-01T10:18:13Z"
  },
  {
    "title": "Donald Trump Opens Ukraine Military Aid Tap After Minerals Deal: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration has told Congress that it intends to give the go-ahead for roughly $50 million of defense-related products to be exported to Ukraine through American industry sales direct to Kyiv, acc…",
    "link": "https://biztoc.com/x/057982792004cf27",
    "timestamp": "2025-05-01T10:12:54Z"
  },
  {
    "title": "Harris Returns to Political Life, Warning of a Constitutional Crisis - The New York Times",
    "description": "Harris Returns to Political Life, Warning of a Constitutional CrisisThe New York Times Kamala Harris says ‘courage is contagious’ in major speech excoriating TrumpThe Guardian April 30, 2025 – Donald Trump presidency newsCNN Kamala Harris comes knives out aga…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177235029",
    "timestamp": "2025-05-01T10:12:39Z"
  },
  {
    "title": "CUOMO town hall breaks down Trump's first 100 days - NewsNation",
    "description": "CUOMO town hall breaks down Trump's first 100 daysNewsNation Trump claims he ‘hasn’t made any mistakes’ in first 100 days: LiveThe Independent Trump Town Hall Bursts Into Laughter When He Says He Hasn’t Made Any MistakesThe Daily Beast Trump says he's made no…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177235025",
    "timestamp": "2025-05-01T10:12:29Z"
  },
  {
    "title": "USA, Ukraine Sign Resources Deal After Fraught Negotiations",
    "description": "The U.S. and Ukraine reached a deal over access to the country's natural resources.",
    "link": "https://www.rigzone.com/news/wire/usa_ukraine_sign_resources_deal_after_fraught_negotiations-01-may-2025-180397-article/",
    "timestamp": "2025-05-01T10:10:00Z"
  },
  {
    "title": "Donald Trump Opens Ukraine Military Aid Tap After Minerals Deal: Report",
    "description": "\"Politically it's a good deal for us,\" Oleksandr Merezhko, Ukraine's parliamentary foreign affairs committee chair, told Newsweek.",
    "link": "https://www.newsweek.com/donald-trump-minerals-deal-ukraine-rare-earths-military-aid-50-million-2066533",
    "timestamp": "2025-05-01T10:09:42Z"
  },
  {
    "title": "Musk defends his work as he prepares to wind down at DOGE but gives hazy answers on future",
    "description": "Elon Musk is defending the work of the Department of Government Efficiency as he prepares to scale back from his government role and spend more time at his businesses.",
    "link": "https://www.news4jax.com/news/politics/2025/05/01/musk-defends-his-work-as-he-prepares-to-wind-down-at-doge-but-gives-hazy-answers-on-future/",
    "timestamp": "2025-05-01T10:08:47Z"
  },
  {
    "title": "DR Congo moves to lift ex-president Kabila’s immunity, accusing him of war crimes",
    "description": "Return to the country by Kabila could complicate US-backed bid to end the rebellion in east, which contains valuable minerals that Trump administration is keen to help mine",
    "link": "https://www.irishtimes.com/world/africa/2025/05/01/dr-congo-moves-to-lift-ex-president-kabilas-immunity-accusing-him-of-war-crimes/",
    "timestamp": "2025-05-01T10:08:18Z"
  },
  {
    "title": "Harvard faculty pledge 10% of pay to support fight against Trump",
    "description": "The Trump administration has frozen more than $2 billion in research grants after accusing Harvard of failing to protect Jewish students from discrimination and harassment on campus.",
    "link": "https://www.wcvb.com/article/harvard-faculty-pledge-fight-against-president-donlad-trump/64641960",
    "timestamp": "2025-05-01T10:07:54Z"
  },
  {
    "title": "Factbox-Warren Buffett and Berkshire Hathaway at a glance",
    "description": "Tens of thousands of people will descend on Omaha, Nebraska, to attend the annual shareholder weekend for billionaire Warren Buffett's Berkshire Hathaway...",
    "link": "https://finance.yahoo.com/news/factbox-warren-buffett-berkshire-hathaway-100411073.html",
    "timestamp": "2025-05-01T10:04:11Z"
  },
  {
    "title": "White House's New Pro-Trump News Site Is Summed Up On Social Media With 1 Word",
    "description": "The new White House Wire has critics thinking the very same thing about the administration's effort at \"journalism.\"",
    "link": "https://www.huffpost.com/entry/white-house-wire-propaganda-trump_n_68133039e4b0a346f102178f",
    "timestamp": "2025-05-01T10:03:07Z"
  },
  {
    "title": "Eric Trump: USD1 will be used for $2B MGX investment in Binance",
    "description": "Abu Dhabi-based investment firm MGX will be tapping a US President Donald Trump-related stablecoin to settle its $2 billion investment into Binance, the world’s largest cryptocurrency exchange.The World Liberty Financial USD (USD1) US dollar-pegged stablecoin…",
    "link": "https://cointelegraph.com/news/eric-trump-usd1-used-2-b-mgx-investment-binance",
    "timestamp": "2025-05-01T10:02:33Z"
  },
  {
    "title": "More bad news for Tesla as EV sales plunge 59% in France",
    "description": "Sales of Tesla cars in France plunged 59 percent in April, piling on more bad news for the electric vehicle company run by Elon Musk, the billionaire advisor to US President Donald Trump.\nFrench car body PFA, which compared registration figures from April wit…",
    "link": "https://biztoc.com/x/9e82e6863165c3d8",
    "timestamp": "2025-05-01T10:01:53Z"
  },
  {
    "title": "What is — and isn’t — getting pricier under Trump’s tariffs?",
    "description": "People shop at a store in Manhattan on April 30, 2025, in New York City. | Spencer Platt/Getty Images\nPresident Donald Trump warned of short-term pain resulting from his tariffs. \nThat pain has arrived in the form of higher prices — and it might not be tempor…",
    "link": "https://biztoc.com/x/c533d814634d40a4",
    "timestamp": "2025-05-01T10:01:44Z"
  },
  {
    "title": "It's 'fight or die' time for democracy — and I'm terrified the Dems are blowing it",
    "description": "Let’s start here today: Any Democrat who had a part in the Biden/Harris/Harris/Walz 2024 presidential campaign, is never allowed to work in politics again.That might not be the brave decree it reads like, because that election might have been the last of its …",
    "link": "https://www.rawstory.com/raw-investigates/is-american-democracy/",
    "timestamp": "2025-05-01T10:00:57Z"
  },
  {
    "title": "Opinion: Trump is giving us a chance to reverse the brain drain to the U.S.",
    "description": "Martin Eichenbaum: U.S. President Donald Trump's attacks on university funding have leading STEM researchers considering moving. Read on.",
    "link": "https://financialpost.com/opinion/opinion-trump-reverse-brain-drain-us",
    "timestamp": "2025-05-01T10:00:08Z"
  },
  {
    "title": "Exclusive — Thune on Confirming Trump Nominees: Dems ‘Can Scream and Light Their Hair on Fire, but It’s Not Going to Change Anything’",
    "description": "Senate Majority Leader John Thune is celebrating the Republican Party majority’s breakneck pace, telling Breitbart News he is proud.\nThe post Exclusive — Thune on Confirming Trump Nominees: Dems ‘Can Scream and Light Their Hair on Fire, but It’s Not Going to …",
    "link": "https://www.breitbart.com/politics/2025/05/01/exclusive-john-thune-confirming-trump-nominees-dems-scream-light-hair-fire/",
    "timestamp": "2025-05-01T10:00:07Z"
  },
  {
    "title": "List of Stores Being Boycotted in May",
    "description": "\"Both parties have failed us,\" said the boycott founder. \"Billionaires and corporations have bought the government and weaponized the economy.\"",
    "link": "https://www.newsweek.com/boycott-amazon-walmart-tariffs-economy-2066457",
    "timestamp": "2025-05-01T10:00:04Z"
  },
  {
    "title": "Lindsey Graham, the monsignor of MAGA, in his most offensive capitulation yet, says Trump should be pope",
    "description": "U.S. Sen. Lindsey Graham\r\n has finally gone vociferously Vatican, but not in the piety, policy, or moral conviction kind of way. No, this time, he’s endorsed Donald Trump for pope.\r\n Yes, pope. Vicar of Christ. Bishop of Rome. Holy Father. Supreme Pontiff. Th…",
    "link": "https://www.advocate.com/voices/lindsey-graham-trump-pope-unholy",
    "timestamp": "2025-05-01T10:00:03Z"
  },
  {
    "title": "What Happens When Teachers Are Replaced With AI? This School Is Finding Out",
    "description": "Alpha School in Brownsville, Texas, promises to deliver a full day's worth of instruction in just two hours with AI tutors. So far, the results are startling.",
    "link": "https://www.newsweek.com/alpha-school-brownsville-ai-expanding-2063669",
    "timestamp": "2025-05-01T10:00:02Z"
  },
  {
    "title": "William Watson: We’re a long way away from one person-one vote",
    "description": "One riding had 7,800 voters. Another, 86,000. Yet each elected one MP. How is that fair? Luckily, there's a simple fix. Read more.",
    "link": "https://financialpost.com/opinion/long-way-away-one-person-one-vote",
    "timestamp": "2025-05-01T10:00:01Z"
  },
  {
    "title": "IMA: The Fast-Approaching Digital Control Grid",
    "description": "Today the Independent Media Alliance brings you a panel focusing on the coming digital control grid, and the many ways in which the current US administration (handed off from the last admin) has not just supported this agenda, but appears to have increased th…",
    "link": "https://www.activistpost.com/ima-the-fast-approaching-digital-control-grid/",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Trump’s First 100 Days Have Unleashed an “All-Out Assault” on the Environment",
    "description": "This story was originally published by Inside Climate News and is reproduced here as part of the Climate Desk collaboration. One hundred days into the second Trump administration, many environmentalists’ worst fears about the new presidency have been realized…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-first-100-days-assault-environment-laws-climate-change-rules-regulations/",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Trump made gains with Latinos in 2024. New polls suggest he’s squandering that momentum.",
    "description": "From the economy to immigration, Trump's first 100 days have only hurt him with Latino voters, according to new polls.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-latinos-polls-economy-immigration-rcna203520",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "“Just Say Yes”: Trump Demands Media Abandon Reality for His Version",
    "description": "It’s not often that an interview perfectly encapsulates a politician’s relationship with reality, but Donald Trump’s recent sit-down with ABC News’s Terry Moran gives us exactly that—a window into Trump’s expectation that the press should simply bend to his v…",
    "link": "https://newrepublic.com/article/194636/trump-demands-media-abandon-reality",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "How Bad Is It?: Andrew Marantz on the Health of Our Democracy",
    "description": "After a hundred days of Trump 2.0, has America tipped into authoritarianism?",
    "link": "https://www.newyorker.com/podcast/political-scene/how-bad-is-it-andrew-marantz-on-the-health-of-our-democracy",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Rebuilding the Digital Town Square: Designing Social Media for Meaningful Connection (Again)",
    "description": "For decades, digital platforms have served as our town squares—spaces where ideas, dialogue, and connections flourished. As we enter 2025, however, many of these once-thriving spaces feel fractured, their roles either diminished or entirely repurposed. For th…",
    "link": "https://interactions.acm.org/archive/view/may-june-2025/rebuilding-the-digital-town-square-designing-social-media-for-meaningful-connection-again",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Musk photo slightly doctored to enlarge chest and gut size",
    "description": "The picture of Musk, which received millions of views in an April 2025 repost, showed the tech billionaire with a larger-than-usual body size.",
    "link": "https://www.snopes.com//fact-check/photo-musk-gut-chest/",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Michelle Obama defends Trump inauguration snub: I didn’t care about ‘doing the right thing’",
    "description": "Earlier this month, Michelle revealed why she didn't go to the January 20 inauguration with her husband, former president Barack Obama.",
    "link": "https://pagesix.com/2025/05/01/celebrity-news/michelle-obama-defends-donald-trump-inauguration-snub/",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "More retirees are claiming Social Security early due to Trump",
    "description": "More retirees are looking to start collecting Social Security benefits early because of uncertainty over the future of the program.",
    "link": "https://www.msnbc.com/top-stories/latest/social-security-retirees-claim-early-trump-newsletter-rcna203897",
    "timestamp": "2025-05-01T10:00:00Z"
  },
  {
    "title": "Stablecoin supply on Binance’s BNB Chain explodes 30% due to USD1’s $2.1B launch",
    "description": "Binance BNB Chain’s stablecoin reserves expanded sharply this week, adding more than $2 billion in value following the debut of USD1, a politically branded dollar token issued by World Liberty Financial. DefiLlama data shows that the chain’s stablecoin market…",
    "link": "https://cryptoslate.com/stablecoin-supply-on-binance-smart-chain-explodes-30-due-to-usd1s-2-1b-launch/",
    "timestamp": "2025-05-01T09:55:44Z"
  },
  {
    "title": "Musk defends his work as he prepares to wind down at DOGE but gives hazy answers on future",
    "description": "Elon Musk is defending the work of the Department of Government Efficiency as he prepares to scale back from his government role and spend more time at his businesses. But in an interview Wednesday with reporters at the White House, he gave hazy answers about…",
    "link": "https://www.seattlepi.com/news/politics/article/musk-defends-his-work-as-he-prepares-to-wind-down-20304143.php",
    "timestamp": "2025-05-01T09:53:45Z"
  },
  {
    "title": "'Eyebrow raiser': Elon Musk proposes DOGE to investigate Federal Reserve's $2.5 billion renovation",
    "description": "Elon Musk considers sending his team to the Federal Reserve. This follows concerns about a costly headquarters renovation. The project's $2.5 billion price tag raises eyebrows. Musk's team aims to identify government waste. This move occurs amid scrutiny of t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-eyebrow-raiser-elon-musk-proposes-doge-to-investigate-federal-reserves-2-5-billion-renovation/articleshow/120791454.cms",
    "timestamp": "2025-05-01T09:49:46Z"
  },
  {
    "title": "Maggie Haberman Warns How Trump’s About To Ramp Things Up. And Not In A Good Way.",
    "description": "Trump has previously done it ”in a way we really just have not seen any president do,” said The New York Times journalist.",
    "link": "https://www.huffpost.com/entry/maggie-haberman-donald-trump-after-100-days_n_68133538e4b0a346f1021a13",
    "timestamp": "2025-05-01T09:48:56Z"
  },
  {
    "title": "Senate GOP Shields Trump Tariffs as They Cost US Households Billions",
    "description": "Nearly every Senate Republican on Wednesday voted against a resolution aimed at terminating the national emergency that U.S. President Donald Trump \ndeclared last month to impose his sweeping tariffs, which are wreaking economic havoc across the globe.\n\n\nJust…",
    "link": "https://www.commondreams.org/news/republicans-support-trump-tariffs",
    "timestamp": "2025-05-01T09:47:51Z"
  },
  {
    "title": "7 charts show falling shipments and weakening confidence — an ominous sign for American shoppers",
    "description": "Any single one of these key consumer economy indicators would be noteworthy — all of them together is raising alarms.",
    "link": "https://www.businessinsider.com/ominous-charts-show-warning-signs-for-american-shoppers-2025-4",
    "timestamp": "2025-05-01T09:47:01Z"
  },
  {
    "title": "US senator threatens Russia with ‘bone-crushing’ sanctions",
    "description": "Lindsey Graham says he has wide Senate backing for a bill placing new sanctions on Russia and tariffs on nations buying its key exports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616608-lindsey-graham-russia-sanctions-support/",
    "timestamp": "2025-05-01T09:46:38Z"
  },
  {
    "title": "‘Absolutely False’: Musk And Tesla Chair Dismiss Report Saying Carmaker Sought To Replace CEO",
    "description": "Earlier on Wednesday evening, the Wall Street Journal reported that concerns about Tesla’s plunging stock prompted board members to hunt for a successor to CEO Elon Musk.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/05/01/absolutely-false-musk-and-tesla-chair-dismiss-report-saying-carmaker-sought-to-replace-ceo/",
    "timestamp": "2025-05-01T09:46:27Z"
  },
  {
    "title": "Newest Left-Wing Hoax: Trump is Deporting U.S. Citizen Children",
    "description": "“U.S. citizens are not deported. The mother chose to take the children with her.” Democrats refuse to give up their future voters without a fight. As President Donald Trump pledged on the campaign trail, his administration has made the removal of illegal immi…",
    "link": "https://freerepublic.com/focus/f-chat/4314355/posts",
    "timestamp": "2025-05-01T09:45:30Z"
  },
  {
    "title": "Musk defends his work as he prepares to wind down at DOGE but gives hazy answers on future",
    "description": "Elon Musk is defending the work of the Department of Government Efficiency as he prepares to scale back from his government role and spend more time at his businesses.",
    "link": "https://www.clickorlando.com/news/politics/2025/05/01/musk-defends-his-work-as-he-prepares-to-wind-down-at-doge-but-gives-hazy-answers-on-future/",
    "timestamp": "2025-05-01T09:45:27Z"
  },
  {
    "title": "Will MrBeast Buy Elon Musk's X? YouTuber Says He 'Might Own Platform Soon'",
    "description": "MrBeast may soon become the first YouTuber billionaire.",
    "link": "https://www.newsweek.com/mrbeast-buy-elon-musk-x-2066534",
    "timestamp": "2025-05-01T09:45:24Z"
  },
  {
    "title": "As Musk steps back, DOGE looks to Congress to finish what it started (Washington Post)",
    "description": "Washington Post:\nAs Musk steps back, DOGE looks to Congress to finish what it started  —  The effort faces an uncertain future in a largely frozen Congress that has passed few bills since President Donald Trump took office in January.  —  Elon Musk arrived at…",
    "link": "https://www.memeorandum.com/250501/p3",
    "timestamp": "2025-05-01T09:45:01Z"
  },
  {
    "title": "Trump ran on boosting prosperity. Now an economic bust looms. (Washington Post)",
    "description": "Washington Post:\nTrump ran on boosting prosperity.  Now an economic bust looms.  —  The messaging strategy does not appear to be working for a president whom voters returned to the White House largely to address economic concerns.  —  At a Tuesday night rally…",
    "link": "https://www.memeorandum.com/250501/p2",
    "timestamp": "2025-05-01T09:45:01Z"
  },
  {
    "title": "Some Red-State Universities Are Dealing With Baby DOGEs Too",
    "description": "Higher ed in GOP-led states is accustomed to cuts from state legislatures. This is something new.",
    "link": "https://slate.com/life/2025/05/doge-elon-musk-higher-education-cuts-grants.html",
    "timestamp": "2025-05-01T09:45:00Z"
  },
  {
    "title": "Tesla board denies report it wanted to replace Elon Musk",
    "description": "Tesla has hit back following a Wall Street Journal report that its board had initiated a search for a new CEO to replace Elon Musk, taking to Musk’s social platform X to call the claim “absolutely false.” According to the WSJ report, about a month ago Tesla’s…",
    "link": "https://www.theverge.com/news/659396/tesla-new-ceo-elon-musk-replacement-wsj-report-denial",
    "timestamp": "2025-05-01T09:43:20Z"
  },
  {
    "title": "Dem Rep. Goldman: Trump 'Continued to Close the Border' After Biden Closed It",
    "description": "On Wednesday’s broadcast of NewsNation’s “On Balance,” Rep. Dan Goldman (D-NY) argued that President Donald Trump “continued to close the border,” after President Joe Biden “used his extraordinary powers, emergency powers to close down the border and the drop…",
    "link": "https://www.breitbart.com/clips/2025/05/01/dem-rep-goldman-trump-continued-to-close-the-border-after-biden-closed-it/",
    "timestamp": "2025-05-01T09:43:10Z"
  },
  {
    "title": "Hundreds arrested in Turkey during worldwide May Day demonstrations and rallies",
    "description": "More than 200 protesters have been arrested in Turkey as people gathered in Istanbul for May Day.",
    "link": "https://news.sky.com/story/hundreds-arrested-in-turkey-during-worldwide-may-day-demonstrations-and-rallies-13359146",
    "timestamp": "2025-05-01T09:43:00Z"
  },
  {
    "title": "Is Meloni the Leader Europe Needs?",
    "description": "Over the past few years, Italy’s right-wing prime minister, Giorgia Meloni, has forged strong ties with European Union leaders in Brussels while also remaining a darling of American right-wing populists. The question now is whether EU power brokers will use h…",
    "link": "https://www.project-syndicate.org/commentary/giorgia-meloni-unlikely-eu-leader-for-the-trump-era-by-mattia-ferraresi-2025-05",
    "timestamp": "2025-05-01T09:42:24Z"
  },
  {
    "title": "‘We Are Just Getting Started’: Trump Hails His First 100 Days",
    "description": "By Fred Lucas, The Daily Signal | April 29, 2025\nPresident Donald Trump declared it the “most successful 100 days” in American history. “They all want to come back to Michigan and build cars again. You know why, because of our tax and tariff policy,” Trump sa…",
    "link": "https://biztoc.com/x/cddffc8ad853b27a",
    "timestamp": "2025-05-01T09:40:37Z"
  }
]