[
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "The decision was not a final ruling in the case.",
    "link": "https://www.bostonherald.com/2025/06/27/supreme-court-lgbtq-books/",
    "timestamp": "2025-06-27T14:57:43Z"
  },
  {
    "title": "Democrats Vote Against House Resolution Condemning LA Riots",
    "description": "Despite overwhelming opposition from Democrats, the House voted Friday to adopt House Resolution 516, a resolution condemning the violent June 2025 protests in Los Angeles.... Read More\nThe post Democrats Vote Against House Resolution Condemning LA Riots appe…",
    "link": "https://www.dailysignal.com/2025/06/27/democrats-vote-against-house-resolution-condemning-la-riots/",
    "timestamp": "2025-06-27T14:57:24Z"
  },
  {
    "title": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books",
    "description": "WASHINGTON (AP) — The Supreme Court ruled on Friday that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks. The justices reversed lower-court rulings in favor of the Montgomery County scho…",
    "link": "https://financialpost.com/pmn/supreme-court-says-maryland-parents-can-pull-their-kids-from-public-school-lessons-using-lgbtq-books",
    "timestamp": "2025-06-27T14:57:21Z"
  },
  {
    "title": "DRC-Rwanda peace deal: what you need to know",
    "description": "A treaty between Rwanda and the Democratic Republic of Congo comes as the United States tries to reassert its role as a global mediator under President Donald Trump. But it leaves many unanswered questions.",
    "link": "https://www.dw.com/en/drc-rwanda-peace-deal-what-you-need-to-know/a-73067776",
    "timestamp": "2025-06-27T14:57:00Z"
  },
  {
    "title": "The Supreme Court’s Ruling on Birthright Citizenship Is a Trump Power Grab",
    "description": "In one of the most anticipated decisions of this Supreme Court term, today the justices granted President Donald Trump’s emergency applications to stay district courts’ orders blocking his efforts to restrict birthright citizenship and upend who gets to be an…",
    "link": "https://www.motherjones.com/politics/2025/06/birthright-citizenship-supreme-court-scotus-decision-explanation-trump-power-grab/",
    "timestamp": "2025-06-27T14:56:12Z"
  },
  {
    "title": "Supreme Court sides with Md. parents who objected to LGBT books",
    "description": "The Supreme Court ruled in favor of Maryland parents who objected on religious grounds to the use of books with LGBTQ characters in elementary school.",
    "link": "https://www.nbcwashington.com/news/local/supreme-court-sides-with-montgomery-county-parents-who-objected-to-lgbtq-books-in-schools/3940889/",
    "timestamp": "2025-06-27T14:56:12Z"
  },
  {
    "title": "WATCH: Jesse Watters Segment at the Heart of Gavin Newsom’s $787 Million Defamation Suit",
    "description": "Gavin Newsom is suing Fox News for $787 million over a Jesse Watters segment that he claims defamed him by deceptively painting him as a liar.\nThe post WATCH: Jesse Watters Segment at the Heart of Gavin Newsom’s $787 Million Defamation Suit first appeared on …",
    "link": "https://www.mediaite.com/media/watch-jesse-watters-segment-at-the-heart-of-gavin-newsoms-787-million-defamation-suit/",
    "timestamp": "2025-06-27T14:55:55Z"
  },
  {
    "title": "Gavin Newsom Sues Fox News",
    "description": "Democratic California Gov. Gavin Newsom is suing Fox News for $787 million, accusing the network of defamation in a Friday lawsuit, Politico reported.",
    "link": "https://dailycaller.com/2025/06/27/gavin-newsom-sues-fox-news-donald-trump-phone-call-national-guard-california/",
    "timestamp": "2025-06-27T14:55:28Z"
  },
  {
    "title": "Supreme Court rules Maryland parents can pull their children from public school lessons that use LGBTQ storybooks",
    "description": "Supreme Court rules Maryland parents can pull their children from public school lessons that use LGBTQ storybooks.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-rules-maryland-parents-can-pull-their-children-from-public-school-lessons-that-use-lgbtq-storybooks",
    "timestamp": "2025-06-27T14:55:20Z"
  },
  {
    "title": "How Trump Lives With the Threat of Iranian Assassination (The Atlantic)",
    "description": "The Atlantic:\nHow Trump Lives With the Threat of Iranian Assassination  —  Fear of being killed has hung over the president and his senior team for months.  —  Hours before launching B-2 bombers at Iran, President Donald Trump stood on a secured airport tarma…",
    "link": "https://www.memeorandum.com/250627/p57",
    "timestamp": "2025-06-27T14:55:01Z"
  },
  {
    "title": "Newsom sues Fox News for defamation over story about call with Trump",
    "description": "Newsom sues Fox News for defamation over story about call with Trump\nCalifornia Gov. Gavin Newsom is suing Fox News for defamation, alleging that the news outlet intentionally manipulated a video to give the appearance that the governor lied about a phone cal…",
    "link": "https://biztoc.com/x/4f428e86af105295",
    "timestamp": "2025-06-27T14:54:35Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The court rejected a challenge from Christian employers to a provision that affects 150 million.",
    "link": "https://www.bostonherald.com/2025/06/27/supreme-court-obamacare/",
    "timestamp": "2025-06-27T14:51:56Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The court rejected a challenge from Christian employers to a provision that affects 150 million.",
    "link": "https://www.denverpost.com/2025/06/27/supreme-court-obamacare/",
    "timestamp": "2025-06-27T14:51:56Z"
  },
  {
    "title": "Supreme Court preserves key part of Obamacare coverage requirements",
    "description": "The Supreme Court has preserved a key part of the Affordable Care Act’s preventive health care coverage requirements, rejecting a challenge from Christian employers to the provision that affects 150 million Americans.",
    "link": "https://www.clickondetroit.com/business/2025/06/27/supreme-court-preserves-key-part-of-obamacare-coverage-requirements/",
    "timestamp": "2025-06-27T14:51:49Z"
  },
  {
    "title": "Supreme Court Lets Parents Opt Kids Out Of LGBTQ Books In Schools",
    "description": "Education experts warned the ruling could \"leave public education in shreds.\"",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/supreme-court-lets-parents-opt-kids-out-of-lgbtq-books-in-schools/",
    "timestamp": "2025-06-27T14:51:45Z"
  },
  {
    "title": "US Supreme Court limits power of judges to block Trump's birthright citizenship order",
    "description": "WASHINGTON: The US Supreme Court dealt a blow on Friday (Jun 27) to the power of federal judges by restricting their ability to grant broad legal relief in cases as the justices acted in a legal fight over President Donald Trump's bid to limit birthright citi…",
    "link": "https://www.channelnewsasia.com/world/us-supreme-court-limits-power-judges-block-trumps-birthright-citizenship-order-5207426",
    "timestamp": "2025-06-27T14:50:35Z"
  },
  {
    "title": "Iran Is on Course for a Bomb After U.S. Strikes Fail to Destroy Facilities",
    "description": "Satellite imagery confirms that Iranian capabilities are bruised, not annihilated.",
    "link": "http://foreignpolicy.com/2025/06/27/iran-us-israel-strikes-dia-bomb-facilities/",
    "timestamp": "2025-06-27T14:50:35Z"
  },
  {
    "title": "Foreign Minister: Iran Wants 'Compensation for Damages' to Nuclear Sites",
    "description": "Iranian Foreign Minister Abbas Araghchi suggested in an interview on Thursday that Iran will be demanding \"compensation for damages\" to its illicit nuclear development sites in any future diplomatic engagements with America after President Donald Trump approv…",
    "link": "https://www.breitbart.com/middle-east/2025/06/27/foreign-minister-iran-wants-compensation-for-damages-to-nuclear-sites/",
    "timestamp": "2025-06-27T14:49:45Z"
  },
  {
    "title": "US stock market hits new record: S&P 500 live updates: All 3 indices hit record highs as Trump–China trade deal lifts Wall Street, AI stocks surge",
    "description": "S&P 500 record high headlines Friday’s market rally as U.S. stocks soared on renewed trade deal hopes between President Donald Trump and China. The S&P 500 rose 0.4% to close at 6,168.60, topping its previous high from February. The Nasdaq Composite also hit …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-hits-new-record-sp-500-live-updates-all-3-indices-hit-record-highs-as-trumpchina-trade-deal-lifts-wall-street-ai-stocks-surge/articleshow/122115880.cms",
    "timestamp": "2025-06-27T14:48:11Z"
  },
  {
    "title": "GOP senator invites Trump to 'an appreciation event like you've never seen' in deep-red state",
    "description": "Sen. Mike Rounds invites Trump to South Dakota's Sturgis Motorcycle Rally, describing the Buffalo Chip campground event as 'an experience every red-blooded American should witness.'",
    "link": "https://www.foxnews.com/politics/gop-senator-invites-trump-an-appreciation-event-like-youve-never-seen-deep-red-state",
    "timestamp": "2025-06-27T14:47:20Z"
  },
  {
    "title": "As Tesla sales fall, Elon Musk fires top manufacturing executive",
    "description": "After Bloomberg reported that Afshar had left the EV giant, Forbes wrote that he had been fired by Musk. The billionaire had previously praised Afshar for leading construction of the Texas gigafactory.Read Entire Article",
    "link": "https://www.techspot.com/news/108480-elon-musk-fires-tesla-manufacturing-vice-president-amid.html",
    "timestamp": "2025-06-27T14:47:00Z"
  },
  {
    "title": "Supreme Court upholds key part of Affordable Care Act’s free preventive health care requirements",
    "description": "The Supreme Court preserved a key part of the Affordable Care Act’s free preventive health care coverage requirements on Friday.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-upholds-key-part-of-affordable-care-acts-free-preventive-health-care-requirements",
    "timestamp": "2025-06-27T14:45:03Z"
  },
  {
    "title": "‘60 Minutes’ correspondents demand CBS News make Tanya Simon executive producer — or face ‘revolt’: report",
    "description": "All seven of the show’s correspondents reportedly urged Paramount co-CEO George Cheeks to officially name Tanya Simon as executive producer.",
    "link": "https://nypost.com/2025/06/27/media/60-minutes-team-demands-cbs-news-names-tanya-simon-executive-producer/",
    "timestamp": "2025-06-27T14:44:42Z"
  },
  {
    "title": "Supreme Court OKs fee that subsidizes phone, internet services in schools, libraries and rural areas",
    "description": "The Supreme Court on Friday upheld the fee that is added to phone bills to provide billions of dollars a year in subsidized phone and internet services in schools, libraries and rural areas",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-oks-fee-that-subsidizes-phone-internet-services-in-schools-libraries-and-rural-areas",
    "timestamp": "2025-06-27T14:44:34Z"
  },
  {
    "title": "Amy Coney Barrett Rebukes Ketanji Brown Jackson's 'Extreme' Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSupreme Court Justice Amy Coney Barrett took aim at Justice Ketanji Brown Jackson's dissenting opinion in Trump v. CASA—a ruling related to President Donald Trump's birthright citizenship executive order.\nBarr…",
    "link": "https://biztoc.com/x/3df87a8b6dc58b34",
    "timestamp": "2025-06-27T14:44:14Z"
  },
  {
    "title": "Republicans, X accused of spreading racism, Islamophobia in posts about NYC's Mamdani",
    "description": "Zohran Mamdani's Democratic primary upset this week in New York City has been followed by a surge in anti-Muslim posts, including by some Republican lawmakers.",
    "link": "https://www.cbc.ca/news/world/nyc-mamdani-posts-1.7572407",
    "timestamp": "2025-06-27T14:44:01Z"
  },
  {
    "title": "Read the full Supreme Court ruling birthright citizenship, limiting nationwide injunctions",
    "description": "The outcome Friday was a victory for Trump, who has complained about individual judges throwing up obstacles to his agenda. But a conservative majority left open the possibility that the birthright citizenship changes could remain blocked nationwide.",
    "link": "https://www.pbs.org/newshour/politics/read-the-full-supreme-court-ruling-birthright-citizenship-limiting-nationwide-injunctions",
    "timestamp": "2025-06-27T14:43:45Z"
  },
  {
    "title": "Supreme Court upholds phone and internet subsidy program for underserved areas",
    "description": "The Supreme Court rejected a challenge to a Federal Communications Commission program that subsidizes phone and internet services in underserved parts of the country.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-phone-internet-subsidy-program-underserved-areas-rcna202662",
    "timestamp": "2025-06-27T14:43:11Z"
  },
  {
    "title": "Supreme Court Rolls Back Sweeping Injunctions That Blocked Trump’s Birthright Citizenship Executive Order",
    "description": "The Supreme Court has rolled back the sweeping injunctions that blocked President Donald Trump's executive order targeting birthright citizenship.\nThe post Supreme Court Rolls Back Sweeping Injunctions That Blocked Trump’s Birthright Citizenship Executive Ord…",
    "link": "https://www.mediaite.com/media/news/supreme-court-rolls-back-sweeping-injunctions-that-blocked-trumps-birthright-citizenship-executive-order/",
    "timestamp": "2025-06-27T14:42:59Z"
  },
  {
    "title": "Supreme Court Hands Trump Huge Win in Birthright Citizenship Case",
    "description": "The Supreme Court ruled that lower courts cannot issue nationwide injunctions on executive orders, like Trump's attack on birthright citizenship.",
    "link": "http://www.rollingstone.com/politics/politics-news/supreme-court-trump-birthright-citizenship-case-1235373903/",
    "timestamp": "2025-06-27T14:42:07Z"
  },
  {
    "title": "Leonardo DiCaprio, Sydney Sweeney And Kylie Jenner Arrive In Venice Ahead Of Jeff Bezos’ Wedding (Photos)",
    "description": "Wedding guests have already touched down in Venice, including several members of the Kardashian family and Ivanka Trump.",
    "link": "https://www.forbes.com/sites/conormurray/2025/06/27/leonardo-dicaprio-sydney-sweeney-and-kylie-jenner-arrive-in-venice-ahead-of-jeff-bezos-wedding-photos/",
    "timestamp": "2025-06-27T14:41:49Z"
  },
  {
    "title": "Nearly 200 House Dems reject resolution condemning violent anti-ICE riots in LA",
    "description": "Democrats vote against resolution condemning anti-ICE riots in Los Angeles as Rep. Young Kim leads California Republicans in supporting law enforcement response",
    "link": "https://www.foxnews.com/politics/nearly-200-house-dems-reject-resolution-condemning-violent-anti-ice-riots-la",
    "timestamp": "2025-06-27T14:41:22Z"
  },
  {
    "title": "Gavin Newsom Sues Fox News Over Jessie Watters Calling Newsom a Liar",
    "description": "Gavin Newsom has gone scorched earth on Fox News, claiming host Jesse Watters intentionally lied to make the California Governor look like a liar in his battle with Donald Trump over activating the military in Los Angeles to quell immigration protests.",
    "link": "https://www.tmz.com/2025/06/27/gavin-newsom-sues-fox-news-jessie-watters-calls-liar-trump-call/",
    "timestamp": "2025-06-27T14:41:21Z"
  },
  {
    "title": "Supreme Court Ends Abuse of Injunctions: No More 'Judicial Supremacy'",
    "description": "The U.S. Supreme Court ruled 6-3 on Friday in the controversial \"birthright citizenship\" case that lower courts cannot simply issue nationwide injunctions, and that doing so is an abuse of their judicial power.\nThe post Supreme Court Ends Abuse of Injunctions…",
    "link": "https://www.breitbart.com/politics/2025/06/27/supreme-court-ends-abuse-of-injunctions-no-more-judicial-supremacy/",
    "timestamp": "2025-06-27T14:39:23Z"
  },
  {
    "title": "Supreme Court Keeps Healthcare Coverage For Preventive Services—At Least For Now",
    "description": "The ruling could have impacted coverage for cancer screenings, preventive medications and more.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/supreme-court-keeps-healthcare-coverage-for-preventive-services-at-least-for-now/",
    "timestamp": "2025-06-27T14:37:26Z"
  },
  {
    "title": "White House seethes as sculpture shows Trump dancing with Epstein - who are the artists?",
    "description": "A controversial art installation featuring a gold-sprayed TV displaying Donald Trump dancing near Jeffrey Epstein has emerged on the National Mall, sparking outrage from the White House. Officials have deemed it tasteless, while the anonymous creators defend …",
    "link": "https://economictimes.indiatimes.com/news/international/us/white-house-seethes-as-sculpture-shows-trump-dancing-with-epstein-who-are-the-artists/articleshow/122115886.cms",
    "timestamp": "2025-06-27T14:36:14Z"
  },
  {
    "title": "Amy Coney Barrett Rebukes Ketanji Brown Jackson's 'Extreme' Opinion",
    "description": "The conservative justice said her liberal colleague's dissent \"is at odds with more than two centuries' worth of precedent.\"",
    "link": "https://www.newsweek.com/amy-coney-barrett-rebukes-ketanji-brown-jacksons-extreme-opinion-2091676",
    "timestamp": "2025-06-27T14:35:51Z"
  },
  {
    "title": "SCOTUS Limits Federal Judges’ Ability to Block Executive Actions Nationwide",
    "description": "In a sweeping ruling, the Supreme Court limited the ability of federal judges to block executive actions throughout the country through nationwide injunctions, greatly affecting how parties seek judicial relief going forward. The court’s 6-3 ruling Friday, wi…",
    "link": "https://freerepublic.com/focus/f-news/4325621/posts",
    "timestamp": "2025-06-27T14:35:35Z"
  },
  {
    "title": "Trump Treasury Secretary Makes Humiliating Admission About Trade Deals",
    "description": "Treasury Secretary Scott Bessent admitted Friday morning that Donald Trump’s trade negotiations will likely continue into September. \r\nDuring an appearance on Fox Business’s Mornings With Maria, Bessent moved the goalposts for Trump’s flailing trade negotiati…",
    "link": "https://newrepublic.com/post/197344/donald-trump-treasury-secretary-humiliating-admission-trade-deals",
    "timestamp": "2025-06-27T14:34:38Z"
  },
  {
    "title": "Supreme Court Caves to Trump in Ominous Birthright Citizenship Ruling",
    "description": "The Supreme Court on Friday delivered Donald Trump a win in his ongoing war against birthright citizenship—limiting lower courts’ ability to issue nationwide injunctions, effectively eroding their ability to rein in anti-constitutional orders.\r\nIn a 6–3 decis…",
    "link": "https://newrepublic.com/post/197189/supreme-court-trump-birthright-citizenship-ruling",
    "timestamp": "2025-06-27T14:33:47Z"
  },
  {
    "title": "NATO Rolls Out the Red Carpet for Trump, the President Who Would Be King",
    "description": "Carol Schaeffer\n\n\n\nThe NATO secretary general had one mission: Keep Trump happy. And to keep Trump happy, you sacrifice your dignity and play the vassal.\r\n\n\r\n\n\nThe post NATO Rolls Out the Red Carpet for Trump, the President Who Would Be King appeared first on…",
    "link": "https://www.thenation.com/article/world/king-donald-trump-nato/",
    "timestamp": "2025-06-27T14:33:36Z"
  },
  {
    "title": "Divided Supreme Court sides with Trump on birthright citizenship nationwide injunctions",
    "description": "The 6-3 decision didn’t decide the underlying legality of President Donald Trump’s attempt to restrict birthright citizenship. Litigation will continue on the issue in the lower courts.",
    "link": "https://biztoc.com/x/0c98820363edd6f5",
    "timestamp": "2025-06-27T14:33:09Z"
  },
  {
    "title": "US Supreme Court votes to curb nationwide injunction on Trump citizenship order",
    "description": "Decision is a victory for Donald Trump, whose executive orders have been tied up in lower courts",
    "link": "https://biztoc.com/x/ffcdc1bc61ad2ad1",
    "timestamp": "2025-06-27T14:32:46Z"
  },
  {
    "title": "Supreme Court curbs judge powers in Trump citizenship case",
    "description": "The US Supreme Court ruled on Friday to restrict the ability of federal judges to issue nationwide injunctions, marking a partial victory for President Donald Trump.The decision effectively narrows th...",
    "link": "https://biztoc.com/x/5e726fe89fe32308",
    "timestamp": "2025-06-27T14:32:33Z"
  },
  {
    "title": "'I could do it very effectively': Eric Trump boasts about his political future",
    "description": "In an interview released on Friday, Eric Trump predicted a Trump family dynasty in America's future and noted he could easily slide into the role of a lawmaker.Speaking with Alex Rogers of the Financial Times, Donald Trump's middle son, who has been frequentl…",
    "link": "https://www.rawstory.com/eric-trump-2672445880/",
    "timestamp": "2025-06-27T14:32:00Z"
  },
  {
    "title": "Alarm Bells Ring in US Over New York Mayoral Front-Runner",
    "description": "Politicos state-side were stunned when self-described socialist Zohran Mamdani won New York City’s Democratic mayoral primary. A tax-happy pro-Palestine activist, Guido thought to bring co-conspirators a flavour of Mamdani’s eyebrow-raising views…\n<ul>\n<li>20…",
    "link": "https://order-order.com/2025/06/27/alarm-bells-ring-in-us-over-new-york-mayoral-front-runner/",
    "timestamp": "2025-06-27T14:31:32Z"
  },
  {
    "title": "How Can the Democrats Be Losing to These Cruel, Stupid, Inept People?",
    "description": "Senate Republicans have no “big, beautiful” bill. It isn’t close to finalized. The Senate parliamentarian, combing through the details and determining which provisions will need a supermajority to pass, is hammering them. They’re locked in ferocious internal …",
    "link": "https://newrepublic.com/post/197356/democrats-losing-stupid-republicans-senate-bill-medicaid",
    "timestamp": "2025-06-27T14:31:06Z"
  },
  {
    "title": "Trump says US signs deal with China; NFL suspends Justin Tucker | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_a2eeb565-eb54-54bf-9196-84d0f2241cbf.html",
    "timestamp": "2025-06-27T14:30:00Z"
  },
  {
    "title": "Trump says US signs deal with China; NFL suspends Justin Tucker | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_92cd0843-2db4-5ad9-852f-ccc50c4cde9b.html",
    "timestamp": "2025-06-27T14:30:00Z"
  },
  {
    "title": "Supreme Court limits nationwide injunctions, fate of Trump birthright citizenship order unclear",
    "description": "Supreme Court limits nationwide injunctions, fate of Trump birthright citizenship order unclearwsbtv.com",
    "link": "https://www.wsbtv.com/news/trending/supreme-court-limits-nationwide-injunctions-fate-trump-birthright-citizenship-order-unclear/Z3YOR2P7SBDA3OEEEBNGM2HRQI/",
    "timestamp": "2025-06-27T14:29:35Z"
  },
  {
    "title": "China confirms trade deal framework reached with United States",
    "description": "BEIJING: China confirmed on Friday (Jun 27) details on the framework of a trade deal with the United States, saying Washington would lift \"restrictive measures\" while Beijing would \"review and a",
    "link": "https://www.channelnewsasia.com/east-asia/china-confirms-trade-deal-framework-reached-us-5207801",
    "timestamp": "2025-06-27T14:28:00Z"
  },
  {
    "title": "China confirms trade deal framework reached with United States",
    "description": "BEIJING: China confirmed on Friday (Jun 27) details on the framework of a trade deal with the United States, saying Washington would lift \"restrictive measures\" while Beijing would \"review and a",
    "link": "https://www.channelnewsasia.com/east-asia/china-confirms-trade-deal-framework-us-5207801",
    "timestamp": "2025-06-27T14:28:00Z"
  },
  {
    "title": "Supreme Court delivers stunning blow to district judge’s ‘nationwide injunctions’ against President Trump",
    "description": "Justices issue 'partial stays' because overreaching orders 'likely exceed the equitable authority that Congress has given to federal courts'",
    "link": "https://www.wnd.com/2025/06/supreme-court-delivers-stunning-blow-district-judges-nationwide/",
    "timestamp": "2025-06-27T14:27:55Z"
  },
  {
    "title": "US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan",
    "description": "The Supreme Court has ruled to curb the ability of federal district judges to block Donald Trump's policies nationwide in a case about birthright citizenship.",
    "link": "https://news.sky.com/story/us-supreme-court-curbs-injunctions-that-blocked-donald-trumps-birthright-citizenship-plan-13389428",
    "timestamp": "2025-06-27T14:27:00Z"
  },
  {
    "title": "US Supreme Court curbs injunctions that blocked Trump's birthright citizenship plan",
    "description": "Donald Trump's administration will be allowed to take steps to implement its proposal to end automatic birthright citizenship in the US following a decision by the Supreme Court.",
    "link": "https://news.sky.com/story/us-supreme-court-curbs-injunctions-that-blocked-trumps-birthright-citizenship-plan-13389428",
    "timestamp": "2025-06-27T14:27:00Z"
  },
  {
    "title": "Top moments from the Trump-Biden debate that changed the course of the 2024 election",
    "description": "Biden's debate against Trump a year ago was marked by president's tired appearance, raspy voice and confused statements on Medicare and immigration.",
    "link": "https://www.foxnews.com/politics/top-moments-from-trump-biden-debate-changed-course-2024-election",
    "timestamp": "2025-06-27T14:25:50Z"
  },
  {
    "title": "BREAKING: For some immigrants, Trump’s policy to end birthright citizenship can go into effect",
    "description": "The Supreme Court ruling could leave some immigrant families in legal limbo. It also weakens the power of lower courts to block Trump’s policies from taking effect.",
    "link": "https://www.advocate.com/news/birthright-citizenship-scotus-trump",
    "timestamp": "2025-06-27T14:24:29Z"
  },
  {
    "title": "Has Trump struck a trade deal with China – and what about other countries?",
    "description": "China confirms details amid efforts to end tariff war, but questions remain over Trump's global trade policy.",
    "link": "https://www.aljazeera.com/news/2025/6/27/has-trump-struck-a-trade-deal-with-china-and-what-about-other-countries",
    "timestamp": "2025-06-27T14:24:05Z"
  },
  {
    "title": "Supreme Court limits nationwide injunctions, but fate of Trump birthright citizenship order unclear",
    "description": "The outcome Friday was a victory for Trump.",
    "link": "https://www.denverpost.com/2025/06/27/birthright-citizenship-supreme-court/",
    "timestamp": "2025-06-27T14:23:23Z"
  },
  {
    "title": "Supreme Court limits nationwide injunctions, but fate of Trump birthright citizenship order unclear",
    "description": "The outcome Friday was a victory for Trump.",
    "link": "https://www.bostonherald.com/2025/06/27/birthright-citizenship-supreme-court/",
    "timestamp": "2025-06-27T14:23:23Z"
  },
  {
    "title": "Moscow flags flaws in NATO’s defense planning",
    "description": "A Russian Foreign Ministry official has pointed to an inconsistency between the “Russia threat” timeline and spending commitments Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620657-moscow-nato-discrepancy/",
    "timestamp": "2025-06-27T14:21:54Z"
  },
  {
    "title": "Donald Trump Gets Supreme Court Win on Birthright Citizenship",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Friday, in a 6-3 ruling, the U.S. Supreme Court ruled to allow Donald Trump's executive order restricting birthright citizenship to go into effect in some areas of the country, for now, by curtailing federa…",
    "link": "https://biztoc.com/x/d9a94191326ea253",
    "timestamp": "2025-06-27T14:21:44Z"
  },
  {
    "title": "4 Things to know about Iran’s nuclear program after the U.S. and Israeli strikes",
    "description": "The big question following U.S. and Israeli attacks on Iran’s nuclear program is: What remains of it?\nU.S. President Donald Trump has said three targets hit by American strikes were “obliterated.” His defense secretary said they were “destroyed.”A preliminary…",
    "link": "https://biztoc.com/x/53370787c5ffde5a",
    "timestamp": "2025-06-27T14:21:43Z"
  },
  {
    "title": "Supreme Court limits judges' power to halt Trump's birthright citizenship order",
    "description": "The high court did not take up the underlying issue of whether President Donald Trump's order ending automatic birthright citizenship was constitutional.",
    "link": "https://www.cnbc.com/2025/06/27/supreme-court-trump-birthright-citizenship-case.html",
    "timestamp": "2025-06-27T14:21:11Z"
  },
  {
    "title": "Chuck Todd Lays Out Big ‘Problem’ Facing Democratic Party",
    "description": "Chuck Todd warned that it is an issue for Democrats that they are apparently a coalition of individuals who are only united by their contempt for Donald Trump.",
    "link": "https://dailycaller.com/2025/06/27/chuck-todd-lays-out-big-problem-facing-democratic-party/",
    "timestamp": "2025-06-27T14:20:22Z"
  },
  {
    "title": "Exclusive — ‘Take Out the Trash in Washington’: Trump-Aligned Garbage Executive Nate Morris Releases U.S. Senate Launch Video in Bid for McConnell’s Kentucky Seat",
    "description": "The America First movement now has an actual garbage man to lead the removal of trash in the nation’s capital. At least that is how Nate Morris, the just-announced Kentucky businessman and U.S. Senate candidate, is framing his bid to replace longtime Sen. Mit…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325616/posts",
    "timestamp": "2025-06-27T14:19:58Z"
  },
  {
    "title": "SCOTUS rules on nationwide injunctions against Trump birthright citizenship order",
    "description": "The Supreme Court granted a partial stay of nationwide injunctions issued by district courts against Trump's executive order to effectively end birthright citizenship.",
    "link": "https://abcnews.go.com/Politics/supreme-court-rules-nationwide-injunctions-trump-birthright-citizenship/story?id=123034189",
    "timestamp": "2025-06-27T14:19:25Z"
  },
  {
    "title": "Supreme Court limits judges’ power on nationwide injunctions, but fate of Trump birthright citizenship order unclear",
    "description": "Supreme Court limits judges' power on nationwide injunctions, but fate of Trump birthright citizenship order unclear.",
    "link": "https://www.pbs.org/newshour/politics/supreme-court-limits-judges-power-on-nationwide-injunctions-but-fate-of-trump-birthright-citizenship-order-unclear",
    "timestamp": "2025-06-27T14:19:19Z"
  },
  {
    "title": "This city is dumping Microsoft Office and Windows for OnlyOffice and Linux - here's why",
    "description": "A leading economic hub is replacing Windows and Microsoft Office with Linux and OnlyOffice.",
    "link": "https://www.zdnet.com/article/this-city-is-dumping-microsoft-office-and-windows-for-onlyoffice-and-linux-heres-why/",
    "timestamp": "2025-06-27T14:19:04Z"
  },
  {
    "title": "Supreme Court Limits Judges From Blocking Some Trump Policies—But Punts On Birthright Citizenship Rule",
    "description": "The case marks the Supreme Court’s first major ruling of Trump’s second term—though more are likely to follow.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/supreme-court-limits-judges-from-blocking-some-trump-policies-but-punts-on-birthright-citizenship-rule/",
    "timestamp": "2025-06-27T14:18:39Z"
  },
  {
    "title": "Supreme Court limits nationwide injunctions, but fate of Trump birthright citizenship order unclear",
    "description": "A divided Supreme Court on Friday ruled that individual judges lack the authority to grant nationwide injunctions, but the decision left unclear the fate of ...",
    "link": "https://www.yahoo.com/news/supreme-court-limits-nationwide-injunctions-141830512.html",
    "timestamp": "2025-06-27T14:18:30Z"
  },
  {
    "title": "Divided Supreme Court sides with Trump on birthright citizenship nationwide injunctions",
    "description": "The 6-3 decision didn’t decide the underlying legality of President Donald Trump’s attempt to restrict birthright citizenship. Litigation will continue on the issue in the lower courts.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-birthright-citizenship-ruling-injunctions-trump-rcna207129",
    "timestamp": "2025-06-27T14:17:20Z"
  },
  {
    "title": "G7: Agreement will be reached to exempt US companies from international taxes, says US Treasury Secretary",
    "description": "See which taxes are covered by the agreement, which will be announced shortly\nThe post G7: Agreement will be reached to exempt US companies from international taxes, says US Treasury Secretary appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/06/27/g7-agreement-will-be-reached-to-exempt-us-companies-from-international-taxes-says-us-treasury-secretary/",
    "timestamp": "2025-06-27T14:17:05Z"
  },
  {
    "title": "Black Internet Furious After Usher Gets Wrapped Up in Trump’s Online Mess",
    "description": "The official White House Twitter page is known for cutting up, but Black folks online say this time, it's gone too far.\nThe post Black Internet Furious After Usher Gets Wrapped Up in Trump’s Online Mess appeared first on The Root.",
    "link": "https://www.theroot.com/black-internet-furious-after-usher-gets-wrapped-up-in-t-2000047414",
    "timestamp": "2025-06-27T14:16:14Z"
  },
  {
    "title": "Supreme Court Rules With Trump On Birthright Citizenship — And Chaos May Be Coming",
    "description": "The court’s ruling could now mean that once a child born to noncitizen parents leaves certain states, they won’t be considered a U.S. citizen.",
    "link": "https://www.huffpost.com/entry/supreme-court-rules-with-trump-on-birthright-citizenship_n_682e21e9e4b05544a32016f0",
    "timestamp": "2025-06-27T14:15:44Z"
  },
  {
    "title": "Trump exerted 'maximum pressure' on Iran and Israel to 'deliver peace': Leavitt",
    "description": "President Trump exerted “maximum pressure\" to “deliver peace\" between Israel and Iran after his historic and decisive strikes decimated the Islamic Republic’s nuclear facilities.",
    "link": "https://www.foxnews.com/politics/trump-exerted-maximum-pressure-iran-israel-deliver-peace-leavitt",
    "timestamp": "2025-06-27T14:15:09Z"
  },
  {
    "title": "US Supreme Court limits courts’ ability to issue nationwide injunctions",
    "description": "The decision is a major victory for the Trump administration, which has denounced the injunctions against its policies.",
    "link": "https://www.aljazeera.com/news/2025/6/27/us-supreme-court-limits-courts-ability-to-issue-nationwide-injunctions",
    "timestamp": "2025-06-27T14:14:29Z"
  },
  {
    "title": "Star Wars Actor Bites Back at Fox’s Ingraham Trashing Him Over Trump Monologues on Kimmel: ‘Jimmy, That’s My Gift To You’",
    "description": "Actor Diego Luna laughed off Fox News' Laura Ingraham trashing his recent monologues on Jimmy Kimmel Live! based around immigration and President Donald Trump.\nThe post Star Wars Actor Bites Back at Fox’s Ingraham Trashing Him Over Trump Monologues on Kimmel:…",
    "link": "https://www.mediaite.com/media/tv/star-wars-actor-bites-back-at-foxs-ingraham-trashing-him-over-trump-monologues-on-kimmel-jimmy-thats-my-gift-to-you/",
    "timestamp": "2025-06-27T14:14:06Z"
  },
  {
    "title": "Donald Trump Gets Supreme Court Win on Birthright Citizenship",
    "description": "The Trump admin has complained that judges are overreaching with orders that apply to everyone instead of only the parties involved.",
    "link": "https://www.newsweek.com/supreme-court-trump-birthright-citizenship-win-2091643",
    "timestamp": "2025-06-27T14:13:56Z"
  },
  {
    "title": "Donald Trump's Approval Rating Changes After Iran Bombing",
    "description": "Polls show the public largely supports decisive military action, but is deeply wary of broader conflict.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-iran-bombing-2091578",
    "timestamp": "2025-06-27T14:11:13Z"
  },
  {
    "title": "Trump Plans To Dismiss Hundreds of Thousands of Asylum Claims To Boost Deportations",
    "description": "Dismissing asylum applications for migrants who entered the U.S. unlawfully would boost immigration-related arrests, but have little impact on public safety.",
    "link": "https://reason.com/2025/06/27/trump-plans-to-dismiss-hundreds-of-thousands-of-asylum-claims-to-boost-deportations/",
    "timestamp": "2025-06-27T14:10:45Z"
  },
  {
    "title": "Gavin Newsom sues Fox News for $787M in defamation case over Trump call (Tyler Katzenberger/Politico)",
    "description": "Tyler Katzenberger / Politico:\nGavin Newsom sues Fox News for $787M in defamation case over Trump call  —  The amount is nearly identical to Dominion Voting's 2023 defamation settlement with Fox News.  —  Gavin Newsom is taking a page right out of Donald Trum…",
    "link": "https://www.memeorandum.com/250627/p48",
    "timestamp": "2025-06-27T14:10:02Z"
  },
  {
    "title": "U.S. Car Sales Are Struggling To Overcome Trump's Tariffs",
    "description": "With tariffs beginning to pinch, things aren't looking so hot for many automakers - though there's one standout currently bucking the trend.",
    "link": "https://www.jalopnik.com/1897267/us-car-sales-struggle-overcome-trump-tariffs/",
    "timestamp": "2025-06-27T14:09:12Z"
  },
  {
    "title": "Jeff Bezos And Lauren Sánchez Get Married Today: What To Know About Wedding Events In Venice",
    "description": "The wedding, hosted in Venice, Italy, is expected to cost millions of dollars as residents protest the upcoming luxury event.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/06/27/jeff-bezos-and-lauren-snchez-get-married-today-what-to-know-about-wedding-events-in-venice/",
    "timestamp": "2025-06-27T14:08:52Z"
  },
  {
    "title": "Supreme Court curbs injunctions that blocked Trump's birthright citizenship plan",
    "description": "WASHINGTON — The Supreme Court on Friday allowed the Trump administration to take steps to implement its proposal to end automatic birthright citizenship, handing a major win to the government.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-curbs-injunctions-blocked-trumps-birthright-citizenship-rcna199742",
    "timestamp": "2025-06-27T14:08:29Z"
  },
  {
    "title": "Republicans Forced to Remove Gun Deregulation From Budget Bill",
    "description": "The Senate parliamentarian has shot down another batch of provisions in Trump’s “big, beautiful bill”—this time including one that would’ve deregulated gun silencers and certain firearms.\r\nBeing a budget reconciliation, the Senate GOP’s bill can pass with a s…",
    "link": "https://newrepublic.com/post/197353/senate-republicans-remove-gun-deregulation-budget-bill",
    "timestamp": "2025-06-27T14:08:20Z"
  },
  {
    "title": "Supreme Court rules to limit nationwide injunctions in birthright citizenship case",
    "description": "Supreme Court rules to limit nationwide injunctions in birthright citizenship casenbcwashington.com",
    "link": "https://www.nbcwashington.com/news/national-international/supreme-court-rules-limit-nationwide-injunctions-birthright-citizenship-case/3940847/",
    "timestamp": "2025-06-27T14:07:40Z"
  },
  {
    "title": "For some immigrants, Trump’s policy to end birthright citizenship can go into effect",
    "description": "The ruling could leave some immigrant families in legal limbo. It also weakens the power of lower courts to block Trump’s policies from taking effect.",
    "link": "https://www.yahoo.com/news/immigrants-trump-policy-end-birthright-140724069.html",
    "timestamp": "2025-06-27T14:07:24Z"
  },
  {
    "title": "New Title IX investigation opened in Minnesota after trans pitcher wins girls' softball championship",
    "description": "Minnesota faces another Title IX investigation from the Trump administration after allowing a trans athlete to win a girls' softball title.",
    "link": "https://www.foxnews.com/sports/new-title-ix-investigation-opened-minnesota-after-trans-pitcher-wins-girls-softball-championship",
    "timestamp": "2025-06-27T14:07:04Z"
  }
]