[
  {
    "title": "Poland and Baltic States Are Set To Restart Production of Landmines",
    "description": "Estonia, Latvia, Lithuania, and Poland cite the Russo-Ukranian War and Russian aggression in general as a valid reason to restart the production of anti-personnel landmines. Russia is not a signatory to the Ottawa Convention; the Kremlin has deployed millions…",
    "link": "https://nationalinterest.org/blog/buzz/poland-and-baltic-states-are-set-to-restart-production-of-landmines/",
    "timestamp": "2025-03-20T14:55:29Z"
  },
  {
    "title": "As the White House targets the judiciary, AG Pam Bondi joins the pile on",
    "description": "Pam Bondi is supposed to be the nation's chief law enforcement official, not a partisan cheerleader. It's a distinction she appears to have forgotten.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-targets-judiciary-ag-pam-bondi-joins-pile-rcna197260",
    "timestamp": "2025-03-20T14:55:10Z"
  },
  {
    "title": "Vietnam strengthens Asian alliances amid geopolitical shifts",
    "description": "Hanoi has been intensifying efforts to strengthen ties with regional partners amid geopolitical turbulence caused by the Trump administration.",
    "link": "https://www.dw.com/en/vietnam-strengthens-asian-alliances-amid-geopolitical-shifts/a-71987503",
    "timestamp": "2025-03-20T14:55:00Z"
  },
  {
    "title": "Top Altcoins to 100x as Trump to Speak at Digital Asset Summit Tonight",
    "description": "Donald Trump will address the Digital Asset Summit (DAS) to be held in New York at North Javits on March 20, making him the first sitting US president to do so. There has been a lot of speculation on what Trump will say. Will he jack up his pro-crypto stance …",
    "link": "https://bitcoinist.com/top-altcoins-to-100x-as-trump-to-speak-at-digital-asset-summit-tonight/",
    "timestamp": "2025-03-20T14:54:33Z"
  },
  {
    "title": "67,000 white South Africans have expressed interest in Trump's plan to give them refugee status",
    "description": "The U.S. Embassy in South Africa says it has received a list of nearly 70,000 people interested in refugee status in the U.S. under President Donald Trump’s plan to relocate members of a white minority group he claims are victims of racial discriminati...",
    "link": "https://abcnews.go.com/International/wireStory/67000-white-south-africans-expressed-interest-trumps-plan-119987696",
    "timestamp": "2025-03-20T14:54:31Z"
  },
  {
    "title": "How Trump Is Bolstering China’s World View",
    "description": "Ironically, Trump’s approach to international relations is playing the game of his proclaimed main enemy: Xi Jinping’s China.",
    "link": "https://thediplomat.com/2025/03/how-trump-is-bolstering-chinas-world-view/",
    "timestamp": "2025-03-20T14:54:00Z"
  },
  {
    "title": "Some Fox News Commentators Speak Out in Defense of Colleagues Against Escalating Trump Attacks",
    "description": "Fox News' Brit Hume and Guy Benson both came to their colleagues' defense on Wednesday after the Trump White House attacked them.\nThe post Some Fox News Commentators Speak Out in Defense of Colleagues Against Escalating Trump Attacks first appeared on Mediait…",
    "link": "https://www.mediaite.com/news/some-fox-news-commentators-speak-out-in-defense-of-colleagues-against-escalating-trump-attacks/",
    "timestamp": "2025-03-20T14:52:13Z"
  },
  {
    "title": "Here's What Elon Musk's Daughter Really Thinks of Him",
    "description": "Vivian Jenna Wilson, Elon Musk's transgender daughter, is opening up about her bigoted and estranged father. Speaking to Teen Vogue for her second-ever press interview, the 20-year-old college student",
    "link": "https://futurism.com/vivian-wilson-interview-elon-musk",
    "timestamp": "2025-03-20T14:51:51Z"
  },
  {
    "title": "Trump administration due to respond on deportations as judge weighs possible violations",
    "description": "(Reuters) - President Donald Trump's administration faced a deadline on Thursday to respond to a judicial request for more details on the deportation of hundreds of Venezuelan migrants as the judge considers whether officials violated his order temporarily bl…",
    "link": "https://www.thestar.com.my/news/world/2025/03/20/trump-administration-due-to-respond-on-deportations-as-judge-weighs-possible-violations",
    "timestamp": "2025-03-20T14:49:00Z"
  },
  {
    "title": "Europe delays tariffs on US goods, including whiskey | CNN Business",
    "description": "The European Union is delaying the retaliatory tariffs it announced after the United States imposed a 25% tariff on steel and aluminum imports earlier this month.",
    "link": "https://www.cnn.com/2025/03/20/economy/europe-tariff-delay/index.html",
    "timestamp": "2025-03-20T14:48:28Z"
  },
  {
    "title": "It’s Time For Congress To Stop The Judicial Sabotage Of Trump’s Agenda",
    "description": "The public understands what is happening, and will soon lose hope if the Republican strategy continues to be: do nothing.",
    "link": "https://thefederalist.com/2025/03/20/its-time-for-congress-to-stop-the-judicial-sabotage-of-trumps-agenda/",
    "timestamp": "2025-03-20T14:47:50Z"
  },
  {
    "title": "Trump to order dismantling of US education department",
    "description": "The move, which he promised to do on the campaign trail, is already facing legal challenges.",
    "link": "https://www.bbc.com/news/articles/c07zpmzxln1o",
    "timestamp": "2025-03-20T14:45:30Z"
  },
  {
    "title": "Illustratively Pointless Lies: One Millionth of a Series",
    "description": "I still have not gotten around to the post I promised last time, about why the Trump regime should--at least by its lights--start forcibly deporting the politically conservative Canadians hiding among us. For one thing, Donald Trump prefers dealing with thugs…",
    "link": "https://prawfsblawg.blogs.com/prawfsblawg/2025/03/illustratively-pointless-lies-one-millionth-of-a-series.html",
    "timestamp": "2025-03-20T14:45:27Z"
  },
  {
    "title": "Trump’s Erratic Behavior Is Freaking CEOs Out, Ex-Official Reveals",
    "description": "Corporate executives are allegedly trying to talk the president “off the ledge” of his tariff plan, according to an ex-Trump official.\r\nIn an interview with MSNBC Wednesday, former White House Communications Director Anthony Scaramucci claimed that Donald Tru…",
    "link": "https://newrepublic.com/post/192966/donald-trump-cuts-economy-freaking-ceos-out",
    "timestamp": "2025-03-20T14:45:17Z"
  },
  {
    "title": "Lexington: Donald Trump is testing more than America’s Constitution",
    "description": "Donald Trump is testing more than America’s Constitution\nThe country’s very idea of itself is under stress\nThere may not have been much of a common-sense argument left, let alone a legal one. Still, at least a pretence of respect for the courts clung on, in m…",
    "link": "https://biztoc.com/x/38db026341f8409d",
    "timestamp": "2025-03-20T14:45:14Z"
  },
  {
    "title": "Is Rachel Zegler's 'Snow White' Woke? Five Major Changes Made to Original",
    "description": "The live-action remake of the hit Disney film has been surrounded by controversy.",
    "link": "https://www.newsweek.com/rachel-zegler-snow-white-woke-changes-original-2047652",
    "timestamp": "2025-03-20T14:45:13Z"
  },
  {
    "title": "67,000 white South Africans have expressed interest in Trump’s plan to give them refugee status",
    "description": "Trump issued an executive order accusing the South African government of a rights violation against Afrikaners.",
    "link": "https://www.bostonherald.com/2025/03/20/south-africa-trump-white-refugees/",
    "timestamp": "2025-03-20T14:45:12Z"
  },
  {
    "title": "Christian Vegas: What a Christian theatre town can teach Trump’s Kennedy Centre",
    "description": "What a Christian theatre town can teach Trump’s Kennedy Centre\nAnti-woke entertainment has draws and drawbacks\nDonald trump has probably not studied Antonio Gramsci but he doesn’t need to. He intuitively understands the chief insight of that Marxist theorist,…",
    "link": "https://biztoc.com/x/0ab1473f7b09cab4",
    "timestamp": "2025-03-20T14:45:07Z"
  },
  {
    "title": "Handmaid’s Tale‘s First Season Still Feels Uncomfortably Timely in 2025",
    "description": "The Hulu series' 2017 debut season hits differently in our current political climate.",
    "link": "https://gizmodo.com/handmaids-tale-season-1-2025-politics-trump-2000578392",
    "timestamp": "2025-03-20T14:45:05Z"
  },
  {
    "title": "Pass the port: Why China hates the Panama Canal deal, but still may not block it",
    "description": "Why China hates the Panama Canal deal, but still may not block it\nXi Jinping might need to lose some to win some\n“We didn’t give it to China. We gave it to Panama, and we’re taking it back.” Thus spoke Donald Trump shortly after BlackRock, an American investm…",
    "link": "https://biztoc.com/x/30009e3c21530322",
    "timestamp": "2025-03-20T14:44:54Z"
  },
  {
    "title": "Zelensky: No talks on US ownership of Ukraine's nuclear plants",
    "description": "Ukrainian President Volodymyr Zelensky ensured on Thursday that he did not discuss with his US counterpart Donald Trump the possibility of the US taking over Ukraine's nuclear power plants, after US S...",
    "link": "https://biztoc.com/x/e79df3f5d990809a",
    "timestamp": "2025-03-20T14:44:46Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to sign order on plan for shutting down Education Department",
    "description": "President Donald Trump has derided the Department of Education as wasteful and polluted by liberal ideology. However, finalizing its dismantling is likely impossible without an act of Congress, which created the department in 1979.",
    "link": "https://biztoc.com/x/abafccf69b0ba590",
    "timestamp": "2025-03-20T14:44:21Z"
  },
  {
    "title": "Conor McGregor makes bizarre 'White House paper' demand to Irish government after Donald Trump invitation",
    "description": "Conor McGregor has laid out a list of demands for Ireland's government following his visit to the White House to sit down with US President Donald Trump.",
    "link": "https://www.ladbible.com/news/us-news/conor-mcgregor-trump-white-house-immigration-demands-irish-government-884245-20250320",
    "timestamp": "2025-03-20T14:43:25Z"
  },
  {
    "title": "'Travesty of justice': Greenpeace slapped with huge penalty in Dakota Access pipeline case",
    "description": "Climate campaigners swiftly sounded the alarm on Wednesday after a North Dakota jury awarded Energy Transfer and its subsidiary more than $660 million in the fossil fuel giant's case targeting\r\n Greenpeace\r\n for protests against the Dakota Access crude oil pi…",
    "link": "https://www.rawstory.com/travesty-of-justice-greenpeace-must-pay-over-660-million-in-dakota-access-p/",
    "timestamp": "2025-03-20T14:43:00Z"
  },
  {
    "title": "James Carville Says ‘Urbanist’ Dems ‘Ought To Apologize’ To Rural America ‘For Being So Godd*amn Stupid’",
    "description": "Democratic strategist James Carville during a Thursday podcast urged “urbanist” Democrats to “apologize” to rural Americans for disrespecting them. President Donald Trump’s November victory over former Vice President Kamala Harris was bolstered by increased s…",
    "link": "https://freerepublic.com/focus/f-bloggers/4305567/posts",
    "timestamp": "2025-03-20T14:42:28Z"
  },
  {
    "title": "Trump reveals one thing he admires about 'sleepy' Joe Biden, hilariously roasts his predecessor. Watch video",
    "description": "Donald Trump revealed one thing he admired about his predecessor 'sleepy' Joe Biden and hilariously roasted him. President Donald Trump said he could never 'sleep' as good as former President Biden on 'The Ingraham Angle.' Trump was asked about how he manages…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-reveals-one-thing-he-admires-about-sleepy-joe-biden-hilariously-roasts-his-predecessor-watch-video/articleshow/119262661.cms",
    "timestamp": "2025-03-20T14:41:05Z"
  },
  {
    "title": "Why Prince William’s trip to Estonia could be his most significant yet",
    "description": "For the Prince of Wales, it is a diplomatic mission that could not be more timely.",
    "link": "https://uk.style.yahoo.com/why-prince-william-trip-estonia-143716375.html",
    "timestamp": "2025-03-20T14:37:16Z"
  },
  {
    "title": "Powerhouse Law Firm Makes Overture to Trump",
    "description": "Semafor: \"Brad Karp, the chairman of Paul Weiss and one of the most powerful lawyers in New York, has been in Washington this week meeting with officials in President Donald Trump’s orbit, people familiar with",
    "link": "https://politicalwire.com/2025/03/20/powerhouse-law-firm-makes-overture-to-trump/",
    "timestamp": "2025-03-20T14:36:42Z"
  },
  {
    "title": "The world this week: Politics",
    "description": "Donald Trump held a two-hour telephone conversation with Vladimir Putin to discuss the war in Ukraine. Mr Putin rejected Mr Trump’s call for a ceasefire but said he would refrain from attacking Ukrainian energy infrastructure for 30 days. Soon after making th…",
    "link": "https://biztoc.com/x/fb9ab4df51c499ee",
    "timestamp": "2025-03-20T14:34:28Z"
  },
  {
    "title": "Go north, if you can: Donald Trump has reshaped one of the world’s most important migration routes",
    "description": "Donald Trump has reshaped one of the world’s most important migration routes\nNayib Bukele, El Salvador’s president, is an eager partner\nIn his quest to chuck migrants out of the United States, Donald Trump has found an eager partner in Central America. On Mar…",
    "link": "https://biztoc.com/x/26a22335e26f1b14",
    "timestamp": "2025-03-20T14:34:21Z"
  },
  {
    "title": "The Houthis’ resilience: America’s strikes on the Houthis could whip up a regional tempest",
    "description": "America’s strikes on the Houthis could whip up a regional tempest\nDonald Trump has promised to hold Iran accountable for the Yemenis’ attacks\nAmerica and its allies have repeatedly gone after the Houthis, Yemeni rebels backed by Iran, since they started attac…",
    "link": "https://biztoc.com/x/7ecbc277cf1e2c13",
    "timestamp": "2025-03-20T14:33:48Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to sign order on plan for shutting down Education Department",
    "description": "President Donald Trump has derided the Department of Education as wasteful and polluted by liberal ideology. However, finalizing its dismantling is likely impossible without an act of Congress, which created the department in 1979.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-expected-to-sign-order-on-plan-for-shutting-down-education-department",
    "timestamp": "2025-03-20T14:33:09Z"
  },
  {
    "title": "Afghanistan: US citizen released by Taliban",
    "description": "George Glezmann was abducted while traveling through Afghanistan as a tourist in December 2022. His release was brokered by US and Qatari negotiators.",
    "link": "https://www.dw.com/en/afghanistan-us-citizen-released-by-taliban/a-71987506",
    "timestamp": "2025-03-20T14:33:00Z"
  },
  {
    "title": "A Step-by-Step Guide to Trump’s Deportation Machine",
    "description": "March 20, 2025 A Step-by-Step Guide to Trump’s Deportation Machine The machinery of mass deportation is meant to be impossible to stop. But any machine can be brought to a halt, if only we understand how the apparatus actually works. Michael Gould-Wartofsky S…",
    "link": "https://www.thenation.com/article/politics/trump-deportation-machine-guide/",
    "timestamp": "2025-03-20T14:32:14Z"
  },
  {
    "title": "Dem senator refuses to address relationship with founder of Soros-funded 'propaganda' news network",
    "description": "Democratic Sen. Chris Murphy told Fox News Digital that he is \"not going to talk about\" his involvement with media group founder Tara McGowan.",
    "link": "https://www.foxnews.com/politics/dem-senator-refuses-address-relationship-founder-soros-funded-propaganda-news-network",
    "timestamp": "2025-03-20T14:32:07Z"
  },
  {
    "title": "What Happens If Trump Officials Defy Court Orders? How They Could Be Punished—Even Though Trump’s Immune.",
    "description": "The Trump administration has claimed it hasn’t violated a judge’s order against deportations, though Judge James Boasberg isn’t so sure.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/20/what-happens-if-trump-officials-defy-court-orders-how-they-could-be-punished-even-though-trumps-immune/",
    "timestamp": "2025-03-20T14:32:06Z"
  },
  {
    "title": "FACT CHECK: Did Trump Replace A Portrait Of Abe Lincoln With A Jewish Leader?",
    "description": "A post shared on X claims President Donald Trump replaced a portrait of President Abraham Lincoln with a portrait of a Jewish leader. BREAKING  Donald Trump has replaced the Abraham Lincoln portrait, painted by Edward Dalton Marchant in 1863, with a portr…",
    "link": "https://checkyourfact.com/2025/03/20/fact-check-trump-portrait-lincoln-jewish-leader/",
    "timestamp": "2025-03-20T14:31:18Z"
  },
  {
    "title": "Bitcoin To Align With Wall Street? BlackRock Predicts A Price Shift Ahead",
    "description": "A BlackRock executive anticipates that the price of Bitcoin will increase in accordance with its growing institutional adoption. Robbie Mitchnick, BlackRock chief of digital assets, stated that Bitcoin remains 15% above its early November levels, despite rece…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-to-align-with-wall-street-blackrock-predicts-a-price-shift-ahead/",
    "timestamp": "2025-03-20T14:30:40Z"
  },
  {
    "title": "Israeli strikes kill at least 85; Latin Grammys add categories | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_085d9bde-7872-50b9-aafc-5ad5ae37a30b.html",
    "timestamp": "2025-03-20T14:30:00Z"
  },
  {
    "title": "Israeli strikes kill at least 85; Latin Grammys add categories | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_b877fdea-96d8-5a14-a347-15e94ae7e8e9.html",
    "timestamp": "2025-03-20T14:30:00Z"
  },
  {
    "title": "Why are Germans being detained by US immigration?",
    "description": "Three tourists and a permanent US resident say they were subjected to aggressive interrogation and held for weeks without knowing why. The German government has gone so far as to extend a travel advisory to its citizens. United States immigration officials ar…",
    "link": "https://www.dw.com/en/why-are-germans-being-detained-by-us-immigration/a-71987211",
    "timestamp": "2025-03-20T14:29:00Z"
  },
  {
    "title": "Sweden's prime minister says that buying US weapons is not a security risk",
    "description": "Sweden's Prime Minister Ulf Kristersson said on Thursday that he did not consider buying U.S. weapons a security risk, though he added that it might be good ...",
    "link": "https://www.yahoo.com/news/swedens-prime-minister-says-buying-142849591.html",
    "timestamp": "2025-03-20T14:28:49Z"
  },
  {
    "title": "Elon Goes All In on Impeaching Rogue Judges with Uniquely Musk Approach to Taking Them Down",
    "description": "Elon Musk issued the maximum possible donations to members of Congress who support impeaching activist judges.",
    "link": "https://www.westernjournal.com/elon-goes-impeaching-rogue-judges-uniquely-musk-approach-taking/",
    "timestamp": "2025-03-20T14:28:46Z"
  },
  {
    "title": "‘The Daily Show’ Creates Welcome Back Video Catching Up Astronauts Stranded in Space for 9 Months: ‘Welcome to Hell’",
    "description": "Suni Williams and Butch Wilmore returned to Earth this week\nThe post ‘The Daily Show’ Creates Welcome Back Video Catching Up Astronauts Stranded in Space for 9 Months: ‘Welcome to Hell’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/astronauts-stranded-return-the-daily-show-welcome-video/",
    "timestamp": "2025-03-20T14:26:35Z"
  },
  {
    "title": "Trump still needs Congress' help with plan to abolish Education Department",
    "description": "President Donald Trump is expected to sign an executive order to abolish the Department of Education, but he would need congressional approval to do completely eliminate the agency.",
    "link": "https://www.foxnews.com/politics/trump-still-needs-congress-help-plan-abolish-education-department",
    "timestamp": "2025-03-20T14:25:54Z"
  },
  {
    "title": "DOGE Stimulus Check Update: Millions Will Not Qualify",
    "description": "Fishback said that there will be provisions in the legislation that will prevent undocumented migrants from accessing the payment.",
    "link": "https://www.newsweek.com/doge-stimulus-checks-update-millions-will-not-qualify-2047752",
    "timestamp": "2025-03-20T14:25:53Z"
  },
  {
    "title": "Atlanta man captured by Taliban is released after more than 2 years",
    "description": "George Glezmann’s release had been the subject of intense negotiations with the Taliban. President Donald Trump, Secretary of State Marco Rubio and National Security Advisor Mike Walz have all been personally involved in overseeing those discussions.",
    "link": "https://www.wsbtv.com/news/local/atlanta/atlanta-man-captured-by-taliban-is-released-after-more-than-2-years/UDBVSP2SANCEFHYRZTBWZLT5FM/",
    "timestamp": "2025-03-20T14:24:56Z"
  },
  {
    "title": "Oligarchy Versus Our Democratic Republic",
    "description": "Bernie Sanders said recently that President Trump’s rule is in effect an “oligarchy” of billionaires. The 83-year old senator from Vermont said, “These are the scariest times in my life.” Sanders told his Facebook followers: “Are you ready for a boring histor…",
    "link": "https://freerepublic.com/focus/f-chat/4305557/posts",
    "timestamp": "2025-03-20T14:23:00Z"
  },
  {
    "title": "Could Trump weaken the dollar to curb record trade deficit?",
    "description": "The US dollar is the world's most important reserve currency. But Donald Trump sees the greenback's current strength as a cause behind trade deficits and a big hindrance to his manufacturing revolution.",
    "link": "https://biztoc.com/x/e09275cdad4ce642",
    "timestamp": "2025-03-20T14:22:14Z"
  },
  {
    "title": "Trump to give remarks at cryptocurrency conference at 10:40 a.m",
    "description": "PARIS :U.S. President Donald Trump will deliver virtual remarks at 10:40 a.m. (1440 GMT) at a cryptocurrency industry conference, the White House said on Thursday.",
    "link": "https://www.channelnewsasia.com/business/trump-give-remarks-cryptocurrency-conference-1040-am-5013756",
    "timestamp": "2025-03-20T14:19:54Z"
  },
  {
    "title": "FACT CHECK: Image Purporting To Show NASA Astronauts With Trump And Musk Is AI-Generated",
    "description": "An image shared on X purports to show National Aeronautics and Space Administration (NASA) astronauts Sunita Williams and Barry “Butch” Wilmore with President Donald Trump and Elon Musk. Thank you Donald Trump and Elon Musk for bringing the astronauts back! S…",
    "link": "https://checkyourfact.com/2025/03/20/fact-check-image-nasa-astronauts-trump-musk-ai/",
    "timestamp": "2025-03-20T14:19:14Z"
  },
  {
    "title": "US slaps Iran-related sanctions on oil tankers, China 'teapot' refinery",
    "description": "It was Washington's fourth round of sanctions on Iran's oil sales since President Donald Trump said in February he was re-imposing a \"maximum pressure\" campaign.",
    "link": "https://www.jpost.com/breaking-news/article-846901",
    "timestamp": "2025-03-20T14:15:58Z"
  },
  {
    "title": "Trump Deadline Looms Over Columbia and Cornell Hamasnik Laments Canceled Café Visits",
    "description": "The clock ticks on Columbia: Today marks the deadline for Columbia University interim president Katrina Armstrong to commit to a series of reforms—from a mask ban to enforcing disciplinary rules and regulations—in order to enter into discussions with the Trum…",
    "link": "https://freebeacon.com/newsletters/trump-deadline-looms-over-columbia-and-cornell-hamasnik-laments-canceled-cafe-visits/",
    "timestamp": "2025-03-20T14:15:46Z"
  },
  {
    "title": "‘Is That What You Said?’: Kevin O’Leary Takes On Left-Wing Podcaster Who Called Tesla ‘South African-First’ Company",
    "description": "Kevin O'Leary sparred with left-wing podcast host Angela Rye as she argued that Elon Musk's leadership at Tesla makes it a \"South Africa-first\" company.",
    "link": "https://dailycaller.com/2025/03/20/cnn-kevin-oleary-angela-rye-elon-musk-tesla/",
    "timestamp": "2025-03-20T14:13:22Z"
  },
  {
    "title": "First-Ever U.S-Based Solana Futures ETFs To Begin Trading Today, Bringing Spot ETFs Closer To Reality",
    "description": "Two exchange-traded funds tied to the price of Solana (SOL) using futures contracts are set to hit the market today (March 20), marking a critical milestone that could pave the way for US spot Solana ETFs. Volatility Shares To Debut First SOL Futures ETFs An …",
    "link": "https://zycrypto.com/first-ever-u-s-based-solana-futures-etfs-to-begin-trading-today-bringing-spot-etfs-closer-to-reality/",
    "timestamp": "2025-03-20T14:12:00Z"
  },
  {
    "title": "Cryptocurrency exchange Kraken to buy Ninja Trader for $1.5 billion",
    "description": "Kraken, one of the world's largest cryptocurrency exchanges, said on Thursday it would buy retail futures trading platform NinjaTrader for $1.5 billion, in a deal that would allow it to expand into multiple asset classes and grow its user base.",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/cryptocurrency-exchange-kraken-to-buy-ninja-trader-for-1-5-billion/articleshow/119262002.cms",
    "timestamp": "2025-03-20T14:11:51Z"
  },
  {
    "title": "Bad Education",
    "description": "President Donald Trump will not be axing the Department of Education today. He can't. \nIt's important we get that fact cleared up first because both sky-is-falling sorts on the left and hail God-Emperor Trump types on the right have a vested interest in actin…",
    "link": "https://biztoc.com/x/09a8b04304a5b33e",
    "timestamp": "2025-03-20T14:10:58Z"
  },
  {
    "title": "China Boasts of Space Prowess After US Astronaut Drama",
    "description": "A carrier rocket and a spacecraft are always on standby on the ground to rescue astronauts aboard the Chinese space station.",
    "link": "https://www.newsweek.com/china-news-space-us-astronauts-stuck-2047637",
    "timestamp": "2025-03-20T14:10:42Z"
  },
  {
    "title": "Donald Trump Calls On Fed to Cut Interest Rates Amid Growth Warning",
    "description": "Federal Reserve Chair Jerome Powell said that the projected rise in inflation is \"clearly\" linked to the president's tariff plans.",
    "link": "https://biztoc.com/x/2f6e6579e027a965",
    "timestamp": "2025-03-20T14:10:40Z"
  },
  {
    "title": "‘That History Cannot Be Erased’: ESPN’s Mina Kimes Calls Out Trump Defense Department for Removing Jackie Robinson Article Amid DEI Purge",
    "description": "ESPN's Mina Kimes called out the Department of Defense on air Wednesday after an article honoring Jackie Robinson was inexplicably removed.\nThe post ‘That History Cannot Be Erased’: ESPN’s Mina Kimes Calls Out Trump Defense Department for Removing Jackie Robi…",
    "link": "https://www.mediaite.com/sports/that-history-cannot-be-erased-espns-mina-kimes-calls-out-trump-defense-department-for-removing-jackie-robinson-article-amid-dei-purge/",
    "timestamp": "2025-03-20T14:10:03Z"
  },
  {
    "title": "Couche-Tard, Seven & I Solicit US Store Interest by March 31",
    "description": "Potential buyers for a package of US convenience stores from Seven & i Holdings Co. and Alimentation Couche-Tard Inc. have until the end of the month to express their interest and show they can overcome antitrust concerns, as the talks continue about a deal b…",
    "link": "https://financialpost.com/pmn/business-pmn/couche-tard-seven-i-solicit-us-store-interest-by-march-31",
    "timestamp": "2025-03-20T14:09:08Z"
  },
  {
    "title": "‘Lunatic’: Trump’s long history of abusing judges who oppose him",
    "description": "From 'radical lunatic', to 'unhinged' and 'unfair', Trump never holds back when showing disapproval of US judges.",
    "link": "https://www.aljazeera.com/news/2025/3/20/lunatic-trumps-long-history-of-abusing-judges-who-oppose-him",
    "timestamp": "2025-03-20T14:07:52Z"
  },
  {
    "title": "Exclusive -- Trump Secures American Hostage Release from Afghanistan with Help from Qatar",
    "description": "President Donald Trump on Thursday secured the release of an American hostage in Afghanistan, a diplomatic source exclusively revealed to Breitbart News.\nThe post Exclusive — Trump Secures American Hostage Release from Afghanistan with Help from Qatar appeare…",
    "link": "https://www.breitbart.com/politics/2025/03/20/exclusive-trump-secures-american-hostage-release-from-afghanistan/",
    "timestamp": "2025-03-20T14:07:03Z"
  },
  {
    "title": "Canada New PM Carney To Call April 28 Snap Election: Govt Source",
    "description": "New Canadian Prime Minister Mark Carney is expected to call snap elections on Sunday, sending voters to the polls on April 28, two government sources told AFP. \n\"The prime minister is expected on Sunday to announce elections for April 28,\" one of the official…",
    "link": "https://www.ibtimes.com/canada-new-pm-carney-call-april-28-snap-election-govt-source-3767070",
    "timestamp": "2025-03-20T14:06:17Z"
  },
  {
    "title": "The Horror Inside the Salvadoran Prisons Where Trump Is Sending Migrants",
    "description": "Human rights organizations have gathered credible evidence of systematic corruption, torture, and killings.",
    "link": "http://foreignpolicy.com/2025/03/20/trump-deportations-el-salvador-prisons-bukele-human-rights/",
    "timestamp": "2025-03-20T14:06:09Z"
  },
  {
    "title": "Trump Shows Laura Ingraham the Button on His Oval Office Desk That ‘Everyone Thinks’ Is ‘the Nuclear’",
    "description": "Trump gave Laura Ingraham a tour of the Oval Office this week and revealed the red button on his desk that \"everyone thinks\" launches nuclear weapons.\nThe post Trump Shows Laura Ingraham the Button on His Oval Office Desk That ‘Everyone Thinks’ Is ‘the Nuclea…",
    "link": "https://www.mediaite.com/tv/trump-shows-laura-ingraham-the-button-on-his-oval-office-desk-that-everyone-thinks-is-the-nuclear/",
    "timestamp": "2025-03-20T14:04:05Z"
  },
  {
    "title": "Analysis-Financial folly or pressure tactic? Trump eyes Ukraine's occupied nuclear plant",
    "description": "KYIV (Reuters) - Donald Trump's idea of U.S. interests taking control of Ukraine's biggest nuclear power station has a catch for the man who coined the art of the deal: it would be years before there is even a hope of it making a return on investment. Read fu…",
    "link": "https://www.thestar.com.my/news/world/2025/03/20/analysis-financial-folly-or-pressure-tactic-trump-eyes-ukraine039s-occupied-nuclear-plant",
    "timestamp": "2025-03-20T14:04:00Z"
  },
  {
    "title": "Donald Trump Calls On Fed to Cut Interest Rates Amid Growth Warning",
    "description": "Federal Reserve Chair Jerome Powell said that the projected rise in inflation is \"clearly\" linked to the president's tariff plans.",
    "link": "https://www.newsweek.com/trump-inflation-rates-cut-federal-reserve-tariffs-jerome-powell-2047734",
    "timestamp": "2025-03-20T14:03:59Z"
  },
  {
    "title": "The El Salvador mega-prison at the centre of Trump's deportation scheme",
    "description": "Invoking a 1798 law, the US president has sent hundreds of alleged gang members to the high-security prison described as a 'black hole of human rights'",
    "link": "https://theweek.com/world-news/the-el-salvador-mega-prison-at-the-centre-of-trumps-deportation-scheme",
    "timestamp": "2025-03-20T14:03:28Z"
  },
  {
    "title": "Why is Trump planning to dismantle Rose Garden lawn of White House? President reveals stunning reason",
    "description": "During an interview with Fox News, US President Donald Trump has revealed plans to dismantle the Rose Garden lawn of the White House. Most of the Rose Garden area consists of a grassy rectangle, which is bordered by beds of rose bushes and other flowering pla…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-why-is-trump-planning-to-dismantle-rose-garden-lawn-of-white-house-president-reveals-stunning-reason/articleshow/119261633.cms",
    "timestamp": "2025-03-20T14:03:00Z"
  },
  {
    "title": "Every ‘Snow White’ Controversy Over the Film’s Tortured Production",
    "description": "From backlash over Rachel Zegler's casting and its depiction of little people to delays from strikes and Covid, every problem that hit Disney's remake",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-features/snow-white-controversy-timeline-1235298802/",
    "timestamp": "2025-03-20T14:02:40Z"
  },
  {
    "title": "Editor Daily Rundown: Donald Trump Set To Start Shuttering Education Department",
    "description": "REPORTS: TRUMP TO BEGIN SHUTTERING EDUCATION DEPARTMENT THURSDAY ... CNN: Trump to sign order Thursday to begin dismantling of Education Department\n\nPresident Donald Trump is poised to sign an executive order on Thursday to start the process of dismantling th…",
    "link": "https://dailycaller.com/2025/03/20/donald-trump-executive-order-shuttering-education-department-officials-say/",
    "timestamp": "2025-03-20T14:02:25Z"
  },
  {
    "title": "‘Nein! Nein! Nein! Oy Vey! Ay Caramba!’ CNN’s Harry Enten Roasts Trump Over Historic Negative Approval",
    "description": "CNN's Harry Enten roasted Trump’s historically low net approval at this point in his presidency, exclaiming \"Ay caramba!\" at his status among other presidents.\nThe post ‘Nein! Nein! Nein! Oy Vey! Ay Caramba!’ CNN’s Harry Enten Roasts Trump Over Historic Negat…",
    "link": "https://www.mediaite.com/news/ay-caramba-cnns-harry-enten-roasts-trump-over-historic-negative-approval-rating/",
    "timestamp": "2025-03-20T14:01:23Z"
  },
  {
    "title": "Donald Trump revealed plans to pave over the White House Rose Garden",
    "description": "In 2017, I was really concerned that Donald Trump was going to destroy Michelle Obama’s White House vegetable gardens out of spite. Remember that? He made some noise about it, but reportedly, Melania Trump stopped him, and Mel even did a couple of photo-ops i…",
    "link": "https://www.celebitchy.com/914376/donald_trump_revealed_plans_to_pave_over_the_white_house_rose_garden/",
    "timestamp": "2025-03-20T14:00:44Z"
  },
  {
    "title": "Lawmakers clash with constituents following more angry town halls...",
    "description": "Shouts of “January 6” and “tax the rich” flooded a town hall in Laramie, Wyoming, on Wednesday, where GOP Rep. Harriet Hageman faced a hostile crowd as she attempted to drown out the noise and answer questions – the latest such Washington lawmaker to be grill…",
    "link": "https://www.cnn.com/2025/03/20/politics/angry-town-halls-lawmakers-clash/index.html",
    "timestamp": "2025-03-20T14:00:05Z"
  },
  {
    "title": "Brothers of Laken Riley's murderer to be deported",
    "description": "Two brothers of Jose Ibarra, the illegal alien who murdered Laken Riley, are both going back to Venezuela as part of Operation Take Back America under President Donald Trump.The other Ibarra brothers — 29-year-old Diego aka \"Gocho\" and 25-year-old Argenis aka…",
    "link": "https://www.theblaze.com/news/brothers-of-laken-riley-s-murderer-to-be-deported",
    "timestamp": "2025-03-20T14:00:00Z"
  },
  {
    "title": "Even More Liberal Groups Come Out Against Chuck Schumer",
    "description": "Four major political organizations focused on young voters—the Sunrise Movement, College Democrats of America, United We Dream of Action, and Voters of Tomorrow—are calling on minority leader Chuck Schumer to either stand up to Donald Trump or step down from …",
    "link": "https://newrepublic.com/post/192959/even-liberal-groups-come-chuck-schumer",
    "timestamp": "2025-03-20T13:58:56Z"
  },
  {
    "title": "Analysis-Financial folly or pressure tactic? Trump eyes Ukraine's occupied nuclear plant",
    "description": "Donald Trump's idea of U.S. interests taking control of Ukraine's biggest nuclear power station has a catch for the man who coined the art of the deal: it...",
    "link": "https://www.yahoo.com/news/analysis-financial-folly-pressure-tactic-135806619.html",
    "timestamp": "2025-03-20T13:58:06Z"
  },
  {
    "title": "Biggest day of action looms as ‘Tesla Takedown’ protesters escalate campaign against Elon Musk’s controversial policies; here are date, venues and what they plan to do",
    "description": "Protests against Elon Musk are escalating, with 500 coordinated actions planned at Tesla showrooms worldwide on March 29. Activists criticize Musk's controversial policies and believe decreasing Tesla's market value could force him out. Organizers emphasize t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/biggest-day-of-action-looms-as-tesla-takedown-protesters-escalate-campaign-against-elon-musks-controversial-policies-here-are-date-venues-and-what-they-plan-to-do/articleshow/119260446.cms",
    "timestamp": "2025-03-20T13:56:36Z"
  },
  {
    "title": "Bad Education",
    "description": "The Trump administration can make cuts, and has been. But that's very different than abolishing the Education Department entirely.",
    "link": "https://reason.com/2025/03/20/bad-education-3/",
    "timestamp": "2025-03-20T13:56:33Z"
  },
  {
    "title": "Applications for jobless benefits inch up, but layoffs remain low, labor market healthy",
    "description": "Slightly more Americans applied for unemployment benefits last week, but layoffs remain historically low.",
    "link": "https://www.bostonherald.com/2025/03/20/unemployment-benefits-layoffs-remain-low/",
    "timestamp": "2025-03-20T13:56:07Z"
  },
  {
    "title": "Fed Not Buying Trump Administration Economic Snake Oil but Stands Largely Pat While Depicting Higher Inflation, Lower Growth Prospects",
    "description": "The Fed has noticed that Trump's policies are chilling growth while stoking inflation, but is not yet ready to react strongly.",
    "link": "https://www.nakedcapitalism.com/2025/03/fed-not-buying-trump-administration-economic-snake-oil-stands-largely-pat-while-depicting-higher-inflation-lower-growth-prospects.html",
    "timestamp": "2025-03-20T13:55:23Z"
  },
  {
    "title": "In Yemen’s Sanaa, fear and defiance after US bombs",
    "description": "Yemenis have already lived through years of war but are worried things will get worse if US intensifies its campaign.",
    "link": "https://www.aljazeera.com/news/2025/3/20/in-yemens-sanaa-fear-and-defiance-after-us-bombs",
    "timestamp": "2025-03-20T13:53:35Z"
  },
  {
    "title": "Can Maine’s high school sports authority dodge Title IX? Conservative legal experts say no",
    "description": "Maine Principals' Association said it cannot be found liable for violating Title IX because it does not receive any federal funding, but conservative legal experts disagree.",
    "link": "https://www.foxnews.com/politics/can-maines-high-school-sports-authority-dodge-title-ix",
    "timestamp": "2025-03-20T13:53:29Z"
  },
  {
    "title": "Musk says there’s a conspiracy to kill him",
    "description": "Elon Musk has claimed that activists want to take out him and Tesla over his efforts to cut federal waste and corruption Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614536-elon-musk-murder-conspiracy/",
    "timestamp": "2025-03-20T13:53:07Z"
  },
  {
    "title": "EU Says Delaying Tariffs On US Goods Two Weeks To Mid-April",
    "description": "The EU said Thursday its tariffs targeting American goods in retaliation for US levies on steel and aluminium would start in mid-April, two weeks later than planned, to give more time for dialogue.",
    "link": "https://www.ibtimes.com/eu-says-delaying-tariffs-us-goods-two-weeks-mid-april-3767069",
    "timestamp": "2025-03-20T13:51:13Z"
  },
  {
    "title": "Florida Becomes Latest State To Name Tuskegee Airman Day, March 27th, As Official State Holiday",
    "description": "As Florida proclaims Tuskegee Airman Day a state holiday, is it time for the U.S. to create a new federal holiday to recognize the Airmen?",
    "link": "https://www.forbes.com/sites/dougmelville/2025/03/20/florida-becomes-latest-state-to-name-tuskegee-airman-day-march-27th-as-official-state-holiday/",
    "timestamp": "2025-03-20T13:51:08Z"
  },
  {
    "title": "Meet the federal judge labeled ‘radical left lunatic’ by Trump, derided by DOJ for ‘micromanaged’ request",
    "description": "A federal judge facing President Donald Trump’s ire because of his rulings on deportation authority was once a housemate with Brett Kavanaugh, a future U.S. Supreme Court justice, at Yale Law School.",
    "link": "https://www.abajournal.com/news/article/meet-the-federal-judge-labeled-a-radical-left-lunatic-by-trump-and-derided-by-doj-for-micromanaged-request",
    "timestamp": "2025-03-20T13:50:00Z"
  },
  {
    "title": "Trump's DOD censored the Enola Gay. Here's 11 things his moronic DEI purge could also remove",
    "description": "Just what is next after censoring the Enola Gay? We have some predictions equally ridiculous to real life.",
    "link": "https://www.advocate.com/news/trump-dei-enola-gay-what-next",
    "timestamp": "2025-03-20T13:49:47Z"
  },
  {
    "title": "Russia to hold talks with US in Riyadh Monday: Kremlin",
    "description": "Russian and US officials are set to discuss Ukraine in Saudi Arabia on Monday, with delegations including high-level representatives from both countries. The talks, following recent discussions between Trump, Putin, and Zelensky, will focus on initiatives rel…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/russia-to-hold-talks-with-us-in-riyadh-monday-kremlin/articleshow/119261404.cms",
    "timestamp": "2025-03-20T13:49:35Z"
  },
  {
    "title": "Tim Walz Argues Trump ‘Doing Us a Favor’ by ‘Breaking’ U.S. Government",
    "description": "Minnesota Gov. Tim Walz (D) believes President Donald Trump might be doing a \"favor\" for Democrats with his federal spending cuts.\nThe post Tim Walz Argues Trump ‘Doing Us a Favor’ by ‘Breaking’ U.S. Government first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/tim-walz-argues-trump-doing-us-a-favor-by-breaking-u-s-government/",
    "timestamp": "2025-03-20T13:49:26Z"
  },
  {
    "title": "Donald Trump's Business Empire Keeps Expanding",
    "description": "Two of President Donald Trump's businesses have expanded to new areas since he took office in January, corporate filings show.\nTrump's business interests have drawn more scrutiny since he started his second presidency, although the Trump Organization—the hold…",
    "link": "https://biztoc.com/x/3d0e48705ff3bd96",
    "timestamp": "2025-03-20T13:49:05Z"
  },
  {
    "title": "Revoking EPA's endangerment finding won't be simple and could have unintended consequences",
    "description": "Most of the United States' major climate regulations are underpinned by one important document: It's called the endangerment finding, and it concludes that greenhouse gas emissions are a threat to human health and welfare.",
    "link": "https://phys.org/news/2025-03-revoking-epa-endangerment-wont-simple.html",
    "timestamp": "2025-03-20T13:49:05Z"
  },
  {
    "title": "Trump is ramping up his call for the Fed to cut interest rates ASAP",
    "description": "Trump said rates should be lowered as tariffs \"ease\" their way into the economy. It's not the first time the president has called for the Fed to slash rates.",
    "link": "https://www.businessinsider.com/interest-rates-fed-inflation-trump-tariffs-rate-cuts-trade-war-2025-3",
    "timestamp": "2025-03-20T13:49:03Z"
  },
  {
    "title": "Donald Trump Building $100M Ballroom Inside White House: What We Know",
    "description": "\"We'll do a big, beautiful room but we could use it in the White House,\" the president said about the plans.",
    "link": "https://biztoc.com/x/25010696f8a86f51",
    "timestamp": "2025-03-20T13:48:22Z"
  },
  {
    "title": "US denies entry to French scientist over ‘hateful’ messages",
    "description": "A space scientist was stopped at the US border on March 9, with officials combing through the contents of his work laptop and phone.\nThe post US denies entry to French scientist over ‘hateful’ messages appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/social-media/us-denies-entry-to-french-scientist-over-hateful-messages/article",
    "timestamp": "2025-03-20T13:47:20Z"
  }
]