[
  {
    "title": "Will Iranians finally take over government and will Iran proxies join war?",
    "description": "Will Iranians finally take over government and will Iran proxies join war? The US and Israel launched major strikes on Iran. President Trump urged Iranians to rise against their leadership. Iran responded with missiles and drones. Regional airspace closures a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-iranians-finally-take-over-government-and-will-iran-proxies-join-war-us-and-israel-major-attack-middle-east-tensions-president-donald-trump-iranian-public-islamic-leadership-supreme-leader-ayatollah-ali-khamenei-tehran-missiles-and-drones-military-bases-in-bahrain-kuwait-qatar/articleshow/128887794.cms",
    "timestamp": "2026-02-28T14:11:12Z"
  },
  {
    "title": "‘The Hour of Your Freedom Is at Hand’: President Trump’s Statement on Iran",
    "description": "This is a transcript of remarks President Donald Trump delivered early this morning on today’s air strikes on the Islamic Republic of Iran, a joint... Read More\nThe post ‘The Hour of Your Freedom Is at Hand’: President Trump’s Statement on Iran appeared first…",
    "link": "https://www.dailysignal.com/2026/02/28/the-hour-of-your-freedom-is-at-hand-president-trumps-statement-on-iran/",
    "timestamp": "2026-02-28T14:11:04Z"
  },
  {
    "title": "Retired Space Force colonel warns Trump’s Iran strikes are ‘reckless adventurism and distraction’",
    "description": "In an 8-minute video posted to Truth Social at 2:30 a.m. Saturday, President Donald Trump announced that, without the approval of Congress, the United States had begun “major combat operations in Iran,” declaring that Tehran “will never have a nuclear weapon”…",
    "link": "https://www.advocate.com/politics/national/trump-iran-war-bree-fram",
    "timestamp": "2026-02-28T14:10:20Z"
  },
  {
    "title": "Trump Media considering 'spinning off' money-losing Truth Social as stock plummets: report",
    "description": "While Donald Trump has amassed billions from various business ventures since his re-election, his Truth Social platform—where he posts major announcements and grievances—continues to hemorrhage money at an alarming rate, and significant changes may be forthco…",
    "link": "https://www.rawstory.com/trump-media-2675423348/",
    "timestamp": "2026-02-28T14:09:11Z"
  },
  {
    "title": "Trump and Israel Start the Iran War",
    "description": "The war is aimed at regime change, has spread across the Middle East, and was started without the consent of the American people.",
    "link": "https://reason.com/2026/02/28/trump-and-israel-start-the-iran-war/",
    "timestamp": "2026-02-28T14:06:47Z"
  },
  {
    "title": "The Latest: US and Israel attack Iran as Trump says US begins 'major combat operations'",
    "description": "The U.S. and Israel have launched strikes on Tehran, and President Donald Trump says the U.S. is starting major combat operations against Iran. On Saturday, witnesses reported smoke near offices tied to Iran’s supreme leader, and residents hear heavy explosio…",
    "link": "https://apnews.com/article/iran-israel-tehran-khamenei-airstrikes-attack-trump-8de8054f3abd4688f894c657467ee3dd",
    "timestamp": "2026-02-28T14:06:33Z"
  },
  {
    "title": "Can Makan Delrahim Close the $111 Billion Warner Bros. Deal?",
    "description": "State attorneys general. Foreign approvals. Consumer lawsuits. Even without the Justice Department stepping in, Paramount still faces several roadblocks to completing its acquisition of Warner Bros.",
    "link": "http://www.hollywoodreporter.com/business/business-news/david-ellison-makan-delrahim-warner-bros-deal-1236517978/",
    "timestamp": "2026-02-28T14:06:11Z"
  },
  {
    "title": "Trump announces ‘massive and ongoing operation’ against Iran",
    "description": "'We're not going to put up with it any longer'",
    "link": "https://www.wnd.com/2026/02/trump-announces-massive-ongoing-operation-against-iran/",
    "timestamp": "2026-02-28T14:01:25Z"
  },
  {
    "title": "Dario Amodei on Anthropic's Pentagon spat: 'Disagreeing with the government is the most American thing in the world'",
    "description": "\"We have stood up for the values of this country,\" the Anthropic CEO said, discussing the AI lab's refusal to accept the Pentagon's terms for Claude.",
    "link": "https://www.businessinsider.com/dario-amodei-pentagon-free-speech-patriots-american-values-2026-2",
    "timestamp": "2026-02-28T14:01:10Z"
  },
  {
    "title": "Northern Virginia Woman Stabbed to Death at Bus Stop by Illegal Alien With Over 30 Prior Arrests",
    "description": "An illegal alien from Sierra Leone with over thirty arrests was charged with murder this week in the fatal stabbing of a Northern Virginia woman at a bus stop on a busy highway in the Hybla Velley area of Fairfax County just south of Alexandria last Monday ev…",
    "link": "https://www.thegatewaypundit.com/2026/02/northern-virginia-woman-stabbed-death-bus-stop-illegal/",
    "timestamp": "2026-02-28T14:00:52Z"
  },
  {
    "title": "Trump’s Clean Energy Dilemma",
    "description": "Even as clean energy gets cheaper, the Trump administration remains mostly uninterested in clean energy's potential. This creates paradoxes and opportunities.",
    "link": "https://www.forbes.com/sites/arielcohen/2026/02/28/trumps-clean-energy-dilemma/",
    "timestamp": "2026-02-28T14:00:39Z"
  },
  {
    "title": "WestJet drops Raleigh-Durham, cuts 16 US routes amid travel decline",
    "description": "WestJet will end 16 U.S. routes this year as it adjusts to shifting Canadian travel patterns.",
    "link": "https://thepointsguy.com/news/westjet-us-route-cuts-raleigh-durham/",
    "timestamp": "2026-02-28T14:00:26Z"
  },
  {
    "title": "WORLD LEADERS FEAR BROADER ESCALATION...",
    "description": "Britain, France and Germany called for a resumption of U.S.-Iran negotiations and condemned Iranian attacks on countries in the region. They did not comment on Saturday’s U.S. and Israeli attacks on Iran. Leaders weighed their opposition to Iran’s nuclear pro…",
    "link": "https://apnews.com/article/iran-us-israel-attack-european-allies-reactions-b7c1071c7c07036ce41040863e38ed64",
    "timestamp": "2026-02-28T14:00:14Z"
  },
  {
    "title": "Did Ilhan Omar marry her brother? Baseless rumor resurfaces",
    "description": "The Somali American representative has frequently been the target of such rumors.",
    "link": "https://www.snopes.com//news/2026/02/28/ilhan-omar-brother/",
    "timestamp": "2026-02-28T14:00:00Z"
  },
  {
    "title": "Inside Saudi Arabia’s regional realignment",
    "description": "Saudi Arabia is shifting toward a major realignment of its foreign policy and global role. This goes far beyond its rivalry with the United Arab Emirates — it includes a complete rethinking of its relationship with the U.S. and Israel.",
    "link": "https://mondoweiss.net/2026/02/inside-saudi-arabias-regional-realignment/",
    "timestamp": "2026-02-28T14:00:00Z"
  },
  {
    "title": "How Deep Does Epstein’s French Connection Go?",
    "description": "In the gilded corridors of Parisian power, where luxury handbags command the price of modest apartments and financial dynasties trace their lineage back centuries, a shadow has emerged that threatens to stain the immaculate marble of France’s most revered ins…",
    "link": "https://www.activistpost.com/how-deep-does-epsteins-french-connection-go/",
    "timestamp": "2026-02-28T14:00:00Z"
  },
  {
    "title": "World leaders respond to regime-change strikes on Iran: 'Peacekeeper is at it again'",
    "description": "The joint American and Israeli military operation launched against Iran on Saturday — dubbed Operation Epic Fury — has prompted mixed responses abroad.While Russian officials were among the most critical of the strikes, several European leaders similarly cond…",
    "link": "https://www.theblaze.com/news/world-leaders-respond-to-regime-change-strikes-on-iran-peacekeeper-is-at-it-again",
    "timestamp": "2026-02-28T13:58:00Z"
  },
  {
    "title": "Instant Reaction: US, Israel Attack Iran as Trump Urges Regime Change",
    "description": "The US and Israel began striking targets across Iran, with President Donald Trump urging Iranians to overthrow the government in a conflict that threatens to spiral across the oil-rich Middle East.   “The hour for your freedom is at hand,” Trump said, address…",
    "link": "https://omny.fm/shows/bloomberg-daybreak/instant-reaction-us-israel-attack-iran-as-trump-urges-regime-change",
    "timestamp": "2026-02-28T13:54:25Z"
  },
  {
    "title": "IRGC pounds US bases across West Asia following US, Israeli aggression",
    "description": "The Islamic Revolution Guards Corps (IRGC) has carried out a string of simultaneous and massive missile strikes against US military bases across West Asia in retaliation for airstrikes targeting several cities in Iran, including the capital Tehran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260228-presstv02.htm",
    "timestamp": "2026-02-28T13:52:49Z"
  },
  {
    "title": "Iran Plunged Into Digital Darkness As Internet Blocked Amid US, Israeli Air Strikes",
    "description": "Iran has been plunged into a \"near-total\" Internet blackout as the United States and Israel carry out a massive, coordinated aerial bombing campaign across the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260228-rferl02.htm",
    "timestamp": "2026-02-28T13:52:49Z"
  },
  {
    "title": "Maliki urges respect for Iraq's sovereignty in meeting with Trump's special envoy",
    "description": "Head of Iraq's State of Law Coalition Nouri al-Maliki has reiterated respect for Iraq's sovereignty and the will of its people during a meeting with US President Donald Trump's special envoy for Syria Thomas Barrack.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iraq/2026/iraq-260227-presstv01.htm",
    "timestamp": "2026-02-28T13:52:49Z"
  },
  {
    "title": "US will suffer 'massive losses' in case of new regional war: Iraq's Kata'ib Hezbollah",
    "description": "A major Iraqi anti-terror group has warned that the United States will suffer \"massive losses\" if it wages another act of aggression in West Asia.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260227-presstv04.htm",
    "timestamp": "2026-02-28T13:52:49Z"
  },
  {
    "title": "World reacts to US, Israel attack on Iran, Tehran retaliation",
    "description": "EU urges 'maximum restraint'; mediator Oman warns US 'not to get sucked in' further into conflict.",
    "link": "https://www.aljazeera.com/news/2026/2/28/world-reacts-to-us-israel-attack-on-iran-tehran-retaliation",
    "timestamp": "2026-02-28T13:52:05Z"
  },
  {
    "title": "FG issues security advisory to Nigerians in Iran, Gulf countries",
    "description": "The Nigerian Federal Government issues a security advisory to citizens in Iran and Gulf countries, urging extreme caution amid escalating tensions.\n\nRead More: https://punchng.com/fg-issues-security-advisory-to-nigerians-in-iran-gulf-countries/",
    "link": "https://punchng.com/fg-issues-security-advisory-to-nigerians-in-iran-gulf-countries/",
    "timestamp": "2026-02-28T13:50:05Z"
  },
  {
    "title": "Oil Markets Brace for Disruption After U.S.-Israel Strikes on Iran",
    "description": "The worries include strikes against regional oil production as well as crude flows from the Persian Gulf.",
    "link": "http://foreignpolicy.com/2026/02/28/us-iran-israel-strikes-oil-markets-hormuz-energy-opec/",
    "timestamp": "2026-02-28T13:49:59Z"
  },
  {
    "title": "Trump and Netanyahu Launch an Illegal and Reckless War Against Iran",
    "description": "\"Bombs will be dropping everywhere,\" Trump said.",
    "link": "https://inthesetimes.com/article/trump-netanyahu-war-iran",
    "timestamp": "2026-02-28T13:45:00Z"
  },
  {
    "title": "Iran has been firing missiles into at least half a dozen countries. Here's how the fight has been playing out.",
    "description": "Iran appears to have launched strikes into at least six countries. It said it was targeting US military bases in the region.",
    "link": "https://www.businessinsider.com/iran-missiles-multiple-countries-what-happened-2026-2",
    "timestamp": "2026-02-28T13:43:38Z"
  },
  {
    "title": "Tehran Tom Moved The Goalposts On Attacking Iran",
    "description": "Never mind that liar Trump claimed their nuclear program was \"obliterated,\" warmonger Tom Cotton has a new excuse for wanting to drop some bombs on brown people.\nAs we already discussed here, Bibi made Trump look like a fool for claiming the strike last year …",
    "link": "https://crooksandliars.com/2026/02/tehran-tom-moves-goalposts-attacking-iran",
    "timestamp": "2026-02-28T13:39:24Z"
  },
  {
    "title": "Iran war: Donald Trump's statement, in full",
    "description": "Trump claimed Iran has continued to develop its nuclear program and plans to develop missiles to reach U.S. and appealed to the Iranian people to \"take over your government.\"",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-war-donald-trumps-statement-in-full/articleshow/128887337.cms",
    "timestamp": "2026-02-28T13:38:52Z"
  },
  {
    "title": "Regime change in Iran unlikely without mass defections from military",
    "description": "Attaining Donald Trump’s declared objective would require sending in ground forces",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/28/regime-change-in-iran-unlikely-without-mass-defections-from-military/",
    "timestamp": "2026-02-28T13:37:46Z"
  },
  {
    "title": "OpenAI strikes deal with Pentagon",
    "description": "OpenAI CEO Sam Altman announced a US government deal and voiced support for rival Anthropic after Trump cut ties Read Full Article at RT.com",
    "link": "https://www.rt.com/business/633184-openai-strikes-deal-pentagon-anthropic/",
    "timestamp": "2026-02-28T13:37:39Z"
  },
  {
    "title": "Dennis Quaid flies Air Force One with Trump, takes stage at Texas rally event in Corpus Christi",
    "description": "Actor Dennis Quaid joined President Trump on stage in Corpus Christi, Texas, expressing his support and love for both his home state and the president.",
    "link": "https://www.foxnews.com/entertainment/dennis-quaid-flies-air-force-one-trump-takes-stage-texas-rally-event-corpus-christi",
    "timestamp": "2026-02-28T13:37:34Z"
  },
  {
    "title": "Israeli strike kills 57 school children in Iranian city – media",
    "description": "Fifty-seven children have reportedly been killed in the Iranian city of Minab as Israel and the US attack targets across the country Read Full Article at RT.com",
    "link": "https://www.rt.com/news/633191-iran-school-forty-killed-israel/",
    "timestamp": "2026-02-28T13:37:20Z"
  },
  {
    "title": "(VIDEO) Trump Announces 'Major Combat Operations' Against Iran, Urges Regime Change in Joint US-Israel Strikes",
    "description": "President Donald Trump announced the launch of \"major combat operations\" against Iran on Saturday, February 28, 2026",
    "link": "https://www.ibtimes.com.au/video-trump-announces-major-combat-operations-against-iran-urges-regime-change-joint-1862355",
    "timestamp": "2026-02-28T13:37:02Z"
  },
  {
    "title": "What to do if you're an American in the Middle East right now",
    "description": "Americans are being told to shelter in place in Middle Eastern countries including Iran, Qatar, and the UAE after the US and Israel struck Iranian cities including the capital, Tehran.",
    "link": "https://www.businessinsider.com/us-strikes-iran-what-to-do-american-middle-east-travel-2026-2",
    "timestamp": "2026-02-28T13:36:17Z"
  },
  {
    "title": "When will global airlines flights resume and Middle East airspace open? Global airlines flights cancellation explained. Here's complete list",
    "description": "When will global airlines flights resume and Middle East airspace open? Airlines canceled flights across the region after US and Israel launched strikes on Iran. Airspace closures affected Israel, UAE, Iran, Iraq, Kuwait, and Bahrain. Airlines including Emira…",
    "link": "https://economictimes.indiatimes.com/news/international/us/when-will-global-airlines-flights-resume-and-middle-east-airspace-open-global-airlines-flights-cancellation-explained-heres-complete-list/articleshow/128887096.cms",
    "timestamp": "2026-02-28T13:34:51Z"
  },
  {
    "title": "US-Israel-Iran conflict: Did Iran attack an empty US military base in Bahrain? Here’s what we know — Video",
    "description": "US-Israel-Iran conflict: The incident occurred amid escalating tensions between the US and Iran, as well as Israel and Iran, after coordinated American strikes and expanded Israeli military operations across Iranian territory.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-israel-iran-conflict-did-iran-attack-an-empty-us-military-base-in-bahrain-heres-what-we-know-video/articleshow/128887262.cms",
    "timestamp": "2026-02-28T13:34:30Z"
  },
  {
    "title": "Iranian Crown Prince Calls on Military, Police, Security Services to Abandon 'Crumbling' Islamist Regime",
    "description": "The son of the last Shah of Iran, Reza Pahlavi, called on the country's military, police, and security forces to abandon the \"crumbling\" Islamist regime of the Ayatollah amid U.S. and Israeli strikes on Saturday.\nThe post Iranian Crown Prince Calls on Militar…",
    "link": "https://www.breitbart.com/europe/2026/02/28/iranian-crown-prince-calls-on-military-police-security-services-to-abandon-crumbling-islamist-regime/",
    "timestamp": "2026-02-28T13:34:02Z"
  },
  {
    "title": "Tensions in the Middle East will affect energy prices and impact countries far away, like Singapore: SM Lee",
    "description": "The overall climate of uncertainty created by these “dramatic twists and turns” will dampen the global mood for trade and investment, says Senior Minister Lee Hsien Loong.",
    "link": "https://www.channelnewsasia.com/singapore/tensions-middle-east-energy-prices-countries-far-away-sm-lee-5960336",
    "timestamp": "2026-02-28T13:33:32Z"
  },
  {
    "title": "World Leaders Fear Broader Escalation After Major US And Israeli Attack On Iran",
    "description": "European leaders are scrambling to protect citizens and calm tensions after U.S. and Israeli strikes on Iran.",
    "link": "https://www.huffpost.com/entry/world-leaders-iran-international-response_n_69a2edb9e4b0213c0675e898",
    "timestamp": "2026-02-28T13:31:41Z"
  },
  {
    "title": "The war they wanted: Netanyahu and Trump light the fuse in Iran",
    "description": "The Middle East is on the brink of all-out chaos that will shatter the remnants of balance and change the face of the region forever Read Full Article at RT.com",
    "link": "https://www.rt.com/news/633214-us-israel-iran-war/",
    "timestamp": "2026-02-28T13:31:36Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, February 28, 2026: the last day of a grim February, and shabbos for Jewish cats.  It’s also National Science Day, which I’d say is a good day. Go appreciate and hug your local scientist (I’m available in Chicago). Here’s Carl Sagan t…",
    "link": "https://whyevolutionistrue.com/2026/02/28/saturday-hili-dialogue-573/",
    "timestamp": "2026-02-28T13:30:46Z"
  },
  {
    "title": "Fetterman praises Operation Epic Fury: Trump is 'willing to do what's right' (Fox News)",
    "description": "Fox News:\nFetterman praises Operation Epic Fury: Trump is 'willing to do what's right'  —  As one of Israel's staunchest defenders from the left, Sen. John Fetterman, D-Pa., full-throatedly endorsed President Donald Trump's attacks on Iran as lawmakers on bot…",
    "link": "https://www.memeorandum.com/260228/p19",
    "timestamp": "2026-02-28T13:30:01Z"
  },
  {
    "title": "Trump's State of the Union address seen by 32.6M people, down 4M from 2025",
    "description": "An estimated 32.6 million people watched Trump's address this week, down 4 million from his speech last year and the smallest audience he's ever gotten for the annual message.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_4cb18af8-4132-5cff-8101-5a8fb333a199.html",
    "timestamp": "2026-02-28T13:30:00Z"
  },
  {
    "title": "A Campaign of Bad Faith and Ill Will",
    "description": "“The SAVE Act can pass today under existing procedure. The obstacle is not the filibuster. It is the habit of surrendering to a myth.\" Alex Muse on X. [Susan Rice video at source link] Lunacy proceeds from crime. In case you wonder why half the country has go…",
    "link": "https://freerepublic.com/focus/f-chat/4368681/posts",
    "timestamp": "2026-02-28T13:27:18Z"
  },
  {
    "title": "Nolte: CNN Staffers Cry ‘Doomed’ and ‘F**ked’ After Paramount Purchase",
    "description": "The good news is that the truly awful people who staff far-left CNN are unhappy. The bad news is that, in reality, they have no reason to be unhappy. Well, other than the layoffs.\nThe post Nolte: CNN Staffers Cry ‘Doomed’ and ‘F**ked’ After Paramount Purchase…",
    "link": "https://www.breitbart.com/the-media/2026/02/28/nolte-cnn-staffers-cry-doomed-and-fked-after-paramount-purchase/",
    "timestamp": "2026-02-28T13:23:41Z"
  },
  {
    "title": "Leader Of 'Board Of Peace' Starts His War With Iran",
    "description": "Without securing Congressional authority, Trump has started bombing Iran with one of the goals being forced regime change.\nThis is also a clear distraction from the Epstein Files.\nTrump declared war in a 3am video (I think from Mar-a-Lago) while he wore a whi…",
    "link": "https://crooksandliars.com/2026/02/leader-board-peace-starts-war-iran",
    "timestamp": "2026-02-28T13:23:00Z"
  },
  {
    "title": "Is Iran's Nuclear program dispute behind the escalating US-Israel-Iran war? Here's what reports say",
    "description": "President Trump ordered airstrikes on Iran's nuclear facilities, escalating tensions after weeks of warnings. Iran, suspected of nuclear ambitions despite its denials, had its program capped in 2015 but the US withdrew from the deal. Recent talks collapsed af…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-irans-nuclear-program-dispute-behind-the-escalating-us-israel-iran-war-heres-what-reports-say/articleshow/128886329.cms",
    "timestamp": "2026-02-28T13:21:56Z"
  },
  {
    "title": "Oil Prices Surge 3-5% as US-Israel Strikes on Iran Spark Fears of Supply Disruptions Through Strait of Hormuz",
    "description": "Crude oil prices jumped sharply on February 28, 2026, extending recent gains as joint U.S.-Israeli military strikes on Iran triggered immediate market concerns over potential disruptions to Middle East oil supplies.",
    "link": "https://www.ibtimes.com.au/oil-prices-surge-3-5-us-israel-strikes-iran-spark-fears-supply-disruptions-through-strait-1862349",
    "timestamp": "2026-02-28T13:21:30Z"
  },
  {
    "title": "World leaders fear broader escalation after major US and Israeli attack on Iran",
    "description": "European nations are holding urgent security talks following U.S. and Israeli strikes on Iran. Leaders are evacuating staff and coordinating responses amid fears of a wider conflict. France, Germany, and the UK are discussing the dangerous escalation. The Eur…",
    "link": "https://economictimes.indiatimes.com/news/defence/world-leaders-fear-broader-escalation-after-major-us-and-israeli-attack-on-iran/articleshow/128886832.cms",
    "timestamp": "2026-02-28T13:20:50Z"
  },
  {
    "title": "AU, EU condemn US–Israeli strikes on Iran, call for restraint",
    "description": "The African Union and EU express deep concern over US-Israeli strikes on Iran, calling for restraint and urgent de-escalation to protect global stability.\n\nRead More: https://punchng.com/au-eu-condemn-us-israeli-strikes-on-iran-call-for-restraint/",
    "link": "https://punchng.com/au-eu-condemn-us-israeli-strikes-on-iran-call-for-restraint/",
    "timestamp": "2026-02-28T13:20:39Z"
  },
  {
    "title": "$200 billion housing move triggers immediate mortgage relief — who sees lower payments? Here’s new mortgage rate outlook 2026",
    "description": "Mortgage rates today are hovering near 5.99%, down sharply from the 7.8% peak seen during the recent housing affordability squeeze. That drop followed a $200 billion mortgage-backed securities purchase plan aimed at stabilizing the U.S. housing market. The mo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/200-billion-housing-move-triggers-immediate-mortgage-relief-who-sees-lower-payments-heres-new-mortgage-rate-outlook-2026/articleshow/128884495.cms",
    "timestamp": "2026-02-28T13:20:21Z"
  },
  {
    "title": "Trump: 'Freedom' for Iran is goal of 'major military operation' (Washington Post)",
    "description": "Washington Post:\nTrump: ‘Freedom’ for Iran is goal of ‘major military operation’  —  The president spoke to The Washington Post early Saturday after announcing that the U.S. had begun striking Iran to bring about regime change.  —  President Donald Trump told…",
    "link": "https://www.memeorandum.com/260228/p18",
    "timestamp": "2026-02-28T13:20:00Z"
  },
  {
    "title": "Read President Trump’s statement on Iran in full",
    "description": "U.S. President Donald Trump said in an 8-minute video posted on his Truth Social that the U.S. has begun “major combat operations in Iran.” He claimed Iran has continued to develop its nuclear program and plans to develop missiles to reach U.S. and appealed t…",
    "link": "https://abcnews.com/International/wireStory/read-president-trumps-statement-iran-full-130606540",
    "timestamp": "2026-02-28T13:17:49Z"
  },
  {
    "title": "U.S. lawmakers react after Trump announces military operation against Iran",
    "description": "Trump ally Sen. Lindsey Graham said the operation would be \"violent, extensive and I believe, at the end of the day, successful.\"",
    "link": "https://www.cbsnews.com/news/iran-strikes-trump-administration-united-states-lawmakers/",
    "timestamp": "2026-02-28T13:14:40Z"
  },
  {
    "title": "Nolte: It’s Kamala v. Obama in Texas Showdown as Jasmine Crockett Takes 18 Point Lead over James Talarico",
    "description": "The latest polling from the Texas U.S. Senate race for the Democrat nomination shows Rep. Jasmine Crockett (Dallas) stomping all over Rep. James Talarico (Austin).\nThe post Nolte: It’s Kamala v. Obama in Texas Showdown as Jasmine Crockett Takes 18 Point Lead …",
    "link": "https://www.breitbart.com/politics/2026/02/28/nolte-its-kamala-v-obama-in-texas-showdown-as-jasmine-crockett-takes-18-point-lead-over-james-talarico/",
    "timestamp": "2026-02-28T13:13:25Z"
  },
  {
    "title": "This GOP farce just proved the net is closing on Trump",
    "description": "For the better part of 40 years, the Republican Party has chased Bill and Hillary Clinton with fervor bordering on obsession. From Whitewater to Benghazi, from emails to impeachment, the pursuit has been relentless, and always ridiculous.After Hillary Clinton…",
    "link": "https://www.rawstory.com/raw-investigates/jeffrey-epstein-2675372192/",
    "timestamp": "2026-02-28T13:12:28Z"
  },
  {
    "title": "US, Israel launch attack on Iran as Trump announces 'major combat operations' (Alexandra Koch/Fox News)",
    "description": "Alexandra Koch / Fox News:\nUS, Israel launch attack on Iran as Trump announces ‘major combat operations’  —  The United States and Israel launched a massive coordinated military offensive targeting Iran known as “Operation Epic Fury.”  President Donald Trump …",
    "link": "https://www.memeorandum.com/260228/p17",
    "timestamp": "2026-02-28T13:10:01Z"
  },
  {
    "title": "America strikes Iran again — has Washington planned for what comes next?",
    "description": "US and Israel launch Operation Epic Fury strikes against Iran's nuclear facilities. Tehran retaliates as tensions escalate beyond previous confrontations.",
    "link": "https://www.foxnews.com/opinion/america-strikes-iran-again-has-washington-planned-what-comes-next",
    "timestamp": "2026-02-28T13:09:52Z"
  },
  {
    "title": "Why did US attack Iran and will it lead to World War 3? Full update on Operation Epic Fury and Middle East tensions",
    "description": "Why did US attack Iran and will it lead to World War 3? The United States launched Operation Epic Fury, targeting Iranian military bases. Iran retaliated with missile strikes across the Gulf. The conflict has involved Israel and Gulf states, raising fears of …",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-did-us-attack-iran-and-will-it-lead-to-world-war-3-full-update-on-operation-epic-fury-and-middle-east-tensions/articleshow/128886461.cms",
    "timestamp": "2026-02-28T13:07:09Z"
  },
  {
    "title": "US, Israel launch co-ordinated attack on Iran; Trump urges Iranians to 'take over your government'",
    "description": "US and Israel launch coordinated strikes on Iran, prompting retaliatory attacks as Trump encourages Iranian uprising against their government.",
    "link": "https://www.thehindubusinessline.com/news/world/us-israel-launch-co-ordinated-attack-on-iran-trump-urges-iranians-to-take-over-your-government/article70688054.ece",
    "timestamp": "2026-02-28T13:06:39Z"
  },
  {
    "title": "Trump Warns Some Americans May Die Amid US Strikes in Iran",
    "description": "REUTERS—President Donald Trump said on Saturday that the United States had begun “major combat operations” in Iran, warning that there may be U.S. casualties.  The... Read More\nThe post Trump Warns Some Americans May Die Amid US Strikes in Iran appeared first…",
    "link": "https://www.dailysignal.com/2026/02/28/trump-warns-some-americans-may-die-amid-us-strikes-in-iran/",
    "timestamp": "2026-02-28T13:05:58Z"
  },
  {
    "title": "‘Righteous’ or ‘Illegal’: America Sharply Divided Over Trump’s Stunning Attack on Iran",
    "description": "The country is sharply divided over Trump's decision, with critics castigating it as unjust and foolhardy, and supporters describing it as bold and righteous.\nThe post ‘Righteous’ or ‘Illegal’: America Sharply Divided Over Trump’s Stunning Attack on Iran firs…",
    "link": "https://www.mediaite.com/media/news/righteous-or-illegal-america-sharply-divided-over-trumps-stunning-attack-on-iran/",
    "timestamp": "2026-02-28T13:05:02Z"
  },
  {
    "title": "Iran-Israel-US conflict: At least 51 students killed in missile strike on Girls’ School in Iran's Minab",
    "description": "An Israeli strike hit a girls’ primary school in Minab, southern Iran. State media reports that the death toll has risen to 51.",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-israel-us-conflict-at-least-51-students-killed-in-missile-strike-on-girls-school-in-irans-minab/articleshow/128886449.cms",
    "timestamp": "2026-02-28T13:01:17Z"
  },
  {
    "title": "Iran Launches Retaliatory Missile Barrage at Gulf Arab States Hosting U.S. Bases: One Killed in Abu Dhabi",
    "description": "Iran fired ballistic missiles at multiple Gulf Arab states on Saturday, February 28, 2026, in retaliation for joint U.S.-Israeli strikes on Iranian leadership and military sites, killing one person in Abu Dhabi and prompting widespread air defense activations…",
    "link": "https://www.ibtimes.com.au/iran-launches-retaliatory-missile-barrage-gulf-arab-states-hosting-us-bases-one-killed-abu-1862341",
    "timestamp": "2026-02-28T13:01:05Z"
  },
  {
    "title": "BROADCAST BIAS: Network gold meddling proves there’s no thrill of victory for leftists",
    "description": "Media outlets criticized USA men's hockey team for laughing during Trump's congratulations call, pushing players to issue public apologies.",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-network-gold-meddling-proves-theres-no-thrill-victory-leftists",
    "timestamp": "2026-02-28T13:00:47Z"
  },
  {
    "title": "CBS 'Legend' Drops Bombshell Warning...",
    "description": "A CBS News producer who left the network after almost half a century of service issued a dire warning in a farewell memo. “We’ve been reading a lot of...",
    "link": "https://www.thedailybeast.com/cbs-legend-producer-mary-walsh-drops-bombshell-warning-ahead-of-cnn-takeover/",
    "timestamp": "2026-02-28T13:00:26Z"
  },
  {
    "title": "Leading Lights Of MAGA Dodge Accountability For Epstein Ties",
    "description": "As Epstein’s former acquaintances around the world face consequences, people around Donald Trump have not.",
    "link": "https://www.huffpost.com/entry/jeffrey-epstein-accountability-files-justice-department_n_69a20646e4b022e3a5588573",
    "timestamp": "2026-02-28T13:00:17Z"
  },
  {
    "title": "Israel releases its first video footage of its strikes on Iran, saying the clips show it attacking missile launchers",
    "description": "The Israeli military said it had attacked \"hundreds of targets\" in Western Iran, as the outcome of the full onslaught of strikes remains unclear.",
    "link": "https://www.businessinsider.com/israel-video-strikes-iran-missile-launcher-2026-2",
    "timestamp": "2026-02-28T13:00:03Z"
  },
  {
    "title": "Overseas, Epstein investigations multiply. In America, not so much.",
    "description": "WASHINGTON — At least nine investigations have begun in eight countries and within the European Union’s anti-fraud unit following the release by the U.S.",
    "link": "https://www.nbcnews.com/politics/justice-department/overseas-epstein-investigations-multiply-america-not-much-rcna260827",
    "timestamp": "2026-02-28T13:00:00Z"
  },
  {
    "title": "Trump announces major U.S. combat operations in Iran, cites nuclear threats and terrorism",
    "description": "Former U.S. President Donald Trump announced major combat operations against Iran, citing Tehran's nuclear program and support for terrorism. He said U.S. forces would target Iran's missile program and navy, urged Iranian forces to surrender, and encouraged t…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-launches-massive-us-military-campaign-against-iran-over-nuclear-threats-and-terrorism/articleshow/128886136.cms",
    "timestamp": "2026-02-28T12:51:02Z"
  },
  {
    "title": "For Israel and Iran, this is the big one",
    "description": "What happens next could depend on how much damage the Iranian regime can inflict - and whether the Iranian people can rise up against it",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/28/for-israel-and-iran-this-is-the-big-one/",
    "timestamp": "2026-02-28T12:48:08Z"
  },
  {
    "title": "Will Qatar, UAE, Saudi Arabia, Kuwait, Jordan, Bahrain and other Gulf countries attack Iran now and was Tehran airstrikes successful? Full update on missile strikes in Gulf region",
    "description": "Will Qatar, UAE, Saudi Arabia, Kuwait, Jordan, Bahrain and other Gulf countries attack Iran now? Iranian missiles targeted multiple Gulf states, including Qatar, UAE, and Kuwait. Countries condemned the strikes, intercepted missiles, and stated their right to…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-qatar-uae-saudi-arabia-kuwait-jordan-bahrain-and-other-gulf-countries-attack-iran-now-and-was-tehran-airstrikes-successful-full-update-on-missile-strikes-in-gulf-region/articleshow/128885871.cms",
    "timestamp": "2026-02-28T12:46:27Z"
  },
  {
    "title": "Iran has been attacked by US and Israel when peace was within reach",
    "description": "It appeared that diplomacy was working, but the strikes by the US and Israel now risk destroying any chance of a peaceful resolution of this crisis.",
    "link": "https://theconversation.com/iran-has-been-attacked-by-us-and-israel-when-peace-was-within-reach-277175",
    "timestamp": "2026-02-28T12:45:35Z"
  },
  {
    "title": "UK Foreign Office issues travel advice to Brits in Middle East as Trump confirms 'major combat operation'",
    "description": "The UK government has warned Brits in the region to 'immediately shelter in place'",
    "link": "https://www.ladbible.com/news/world-news/us-iran-strikes-israel-uk-foreign-office-advice-485080-20260228",
    "timestamp": "2026-02-28T12:43:57Z"
  },
  {
    "title": "Lucknow cinemas restart 'The Kerala Story 2' screenings after court relief",
    "description": "Cinema halls in Lucknow reopened screenings of 'The Kerala Story 2' late Friday evening after the Kerala High Court lifted the ban on the film's release, paving the way for shows to resume nationwide from 9 pm.",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/lucknow-cinemas-restart-the-kerala-story-2-screenings-after-court-relief/articleshow/128886006.cms",
    "timestamp": "2026-02-28T12:42:28Z"
  },
  {
    "title": "Dalhousie : Restored, revived and reimagined for the city",
    "description": "As Calcutta Times turns 25, we look at 25 places that have transformed over the past two-and-a-half decades. Dalhousie CBD Area , now known as B.B.D. .",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/dalhousie-restored-revived-and-reimagined-for-the-city/articleshow/128886014.cms",
    "timestamp": "2026-02-28T12:41:52Z"
  },
  {
    "title": "'Hello Bachhon' trailer: Viineet Kumar Singh stars as mentor leading a story of students who refused to quit",
    "description": "Netflix has unveiled the trailer of 'Hello Bachhon', a new original series inspired by the journey of educator Alakh Pandey, marking another collaboration with The Viral Fever (TVF).",
    "link": "https://timesofindia.indiatimes.com/web-series/news/hindi/hello-bachhon-trailer-viineet-kumar-singh-stars-as-mentor-leading-a-story-of-students-who-refused-to-quit/articleshow/128885949.cms",
    "timestamp": "2026-02-28T12:40:45Z"
  },
  {
    "title": "\"When children are young, teachers touch their lives...\": Vineet Kumar Singh shares insight on 'Hello Bachhon'",
    "description": "Netflix's upcoming Indian drama series 'Hello Bachchon' is set to premiere all episodes on March 6, 2026, bringing the real-life story of Alakh Pandey, founder of the ed-tech platform Physics Wallah, to the digital screen.",
    "link": "https://timesofindia.indiatimes.com/web-series/news/hindi/when-children-are-young-teachers-touch-their-lives-vineet-kumar-singh-shares-insight-on-hello-bachhon/articleshow/128885888.cms",
    "timestamp": "2026-02-28T12:38:49Z"
  },
  {
    "title": "Jharkhand Power Upgrade: JBVNL Boosts Ranchi's Grid for Summer & Monsoon",
    "description": "Ranchi is gearing up for summer with JBVNL reinforcing its power network. Exposed wires are being replaced with safer aerial bunched cables, and new transformers are being installed to boost capacity. These rapid upgrades aim to prevent disruptions from heat …",
    "link": "https://timesofindia.indiatimes.com/city/ranchi/jharkhand-power-upgrade-jbvnl-boosts-ranchis-grid-for-summer-monsoon/articleshow/128885589.cms",
    "timestamp": "2026-02-28T12:38:44Z"
  },
  {
    "title": "Historic US-Israel strikes on Iran underway as Tehran faces regime survival test",
    "description": "Israel launches Operation Roaring Lion with US strikes on Iran sites. Reports suggest Ali Shamkhani, key Khamenei adviser, killed in opening wave.",
    "link": "https://www.foxnews.com/world/historic-us-israel-strikes-iran-underway-tehran-faces-regime-survival-test",
    "timestamp": "2026-02-28T12:38:28Z"
  },
  {
    "title": "NEET UG 2026 registration ends next week: Check all the important dates, application details, and direct link here",
    "description": "The National Eligibility-cum-Entrance Test for Undergraduate NEET UG 2026 registration deadline is March 8, 2026. Aspiring medical students must complete their online applications on the official NTA website. The NEET UG 2026 examination is scheduled for May …",
    "link": "https://timesofindia.indiatimes.com/education/news/neet-ug-2026-registration-ends-next-week-check-all-the-important-dates-application-details-and-direct-link-here/articleshow/128884181.cms",
    "timestamp": "2026-02-28T12:37:12Z"
  },
  {
    "title": "Fetterman praises Operation Epic Fury: Trump is 'willing to do what's right'",
    "description": "Lawmakers reacted Saturday to the U.S. and Israel launching strikes on Iran, with Sen. John Fetterman saying, \"President Trump has been willing to do what's right.\"",
    "link": "https://www.foxnews.com/politics/fetterman-praises-operation-epic-fury-trump-willing-do-whats-right",
    "timestamp": "2026-02-28T12:31:31Z"
  },
  {
    "title": "Read Israeli Prime Minister Benjamin Netanyahu's full statement on Iran",
    "description": "Israel and the United States have initiated Operation Lion's Roar. This joint military campaign targets Iran's ruling regime and its military facilities. The operation aims to neutralize threats posed by Iran's nuclear and missile programs. Prime Minister Net…",
    "link": "https://economictimes.indiatimes.com/news/defence/read-israeli-prime-minister-benjamin-netanyahus-full-statement-on-iran/articleshow/128885435.cms",
    "timestamp": "2026-02-28T12:30:18Z"
  },
  {
    "title": "Passports Welcome Here: The Importance of Crossing Borders at the Library",
    "description": "Recent public announcements that many public libraries could no longer accept passport applications surprised many.In a now unusual attempt at bicameral and bipartisan legislation, Rep. John Joyce (R-Pa.) and Sen. John Fetterman (D-Pa.), have put forth bills …",
    "link": "https://www.commondreams.org/opinion/crossing-borders-at-library",
    "timestamp": "2026-02-28T12:29:03Z"
  },
  {
    "title": "Trump directs Tehran to ‘lay down your arms’ or face ‘certain death’ after US, Israel strikes as he appeals to protesters",
    "description": "President Trump ordered the Iranian regime, military and police forces to \"lay down\" they guns or face \"certain death\" after the US and Israel launched \"Operation Epic Fury\" Saturday.",
    "link": "https://nypost.com/2026/02/28/us-news/trump-directs-tehran-to-lay-down-your-arms-or-face-certain-death-after-us-israel-strikes-as-he-appeals-to-protesters/",
    "timestamp": "2026-02-28T12:25:39Z"
  },
  {
    "title": "US-Israeli attack on Iran risks plunging the world into turmoil",
    "description": "The attack has come in the middle of talks between Washington and Tehran.",
    "link": "https://theconversation.com/us-israeli-attack-on-iran-risks-plunging-the-world-into-turmoil-276818",
    "timestamp": "2026-02-28T12:22:43Z"
  },
  {
    "title": "US–Iran war news: How could the S&P 500, Dow Jones and Nasdaq react? Are defense stocks the real winners, or are gold and silver the ultimate safe havens in the US–Iran conflict?",
    "description": "US–Iran war news: S&P 500, Dow Jones and Nasdaq reaction: The U.S. and Israel launched coordinated military strikes on Iran Saturday, and markets responded immediately. Dow Jones dropped 521 points, the S&P 500 fell 0.43%, and the Nasdaq shed 0.92% before Fri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-iran-war-news-how-could-the-sp-500-dow-jones-and-nasdaq-react-are-defense-stocks-the-real-winners-or-are-gold-and-silver-the-ultimate-safe-havens-in-the-usiran-conflict/articleshow/128884589.cms",
    "timestamp": "2026-02-28T12:21:01Z"
  },
  {
    "title": "Why did the US strike Iran?",
    "description": "President Donald Trump announced early Saturday morning that the US and Israel had launched an attack on Iran, saying the goal was to eliminate an “imminent threat” from Iran, “raze their missile industry to the ground” and “annihilate their navy” and for Ira…",
    "link": "https://www.vox.com/politics/480981/iran-us-attack-strikes-bombing",
    "timestamp": "2026-02-28T12:20:46Z"
  },
  {
    "title": "Trump Posts In Dead of Night About Election Loss To Biden Hours After War Announcement",
    "description": "Trump was posting on social media into the dead of night in the hours following his war announcement, sharing a pair of messages about his loss to Biden.\nThe post Trump Posts In Dead of Night About Election Loss To Biden Hours After War Announcement first app…",
    "link": "https://www.mediaite.com/media/news/trump-posts-in-dead-of-night-about-election-loss-to-biden-hours-after-war-announcement/",
    "timestamp": "2026-02-28T12:15:57Z"
  },
  {
    "title": "Explosions heard across the Middle East as Iran retaliates against U.S. attacks; flights disrupted",
    "description": "CNBC's team in the United Arab Emirates confirmed hearing a number of loud explosions in both the UAE's capital city of Abu Dhabi and Dubai.",
    "link": "https://www.cnbc.com/2026/02/28/explosions-heard-across-middle-east-as-iran-retaliates-to-us-strikes.html",
    "timestamp": "2026-02-28T12:14:45Z"
  },
  {
    "title": "Europeans cautious as they scramble to digest major US, Israeli attack on Iran",
    "description": "European nations are reacting to major strikes on Iran by the US and Israel. Leaders are working to safeguard their citizens in the Middle East. Germany is holding an emergency meeting. The European Union is evacuating some staff. France and Italy are urging …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/europeans-cautious-as-they-scramble-to-digest-major-us-israeli-attack-on-iran/articleshow/128885272.cms",
    "timestamp": "2026-02-28T12:12:16Z"
  },
  {
    "title": "Transcript of Trump's announcement of US attack on Iran",
    "description": "WASHINGTON: US President Donald Trump announced the start of combat operations against Iran on Saturday (Feb 28) in a video address posted to his Truth Social platform.Here is the full transcript:\"A short time ago, the United States military began major comba…",
    "link": "https://www.channelnewsasia.com/world/donald-trump-speech-transcript-us-israel-strikes-iran-5960566",
    "timestamp": "2026-02-28T12:11:00Z"
  },
  {
    "title": "Iran-Israel war: No surrender, says Iranian Embassy in India",
    "description": "Iran war: The Iranian embassy said that the United States, in collaboration with the \"corrupt Zionist regime\" of Israel carried out aerial operations in the country, which targeted certain locations. The operations across Tehran and Iranian cities are expecte…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-israel-war-no-surrender-says-iranian-embassy-in-india/articleshow/128885128.cms",
    "timestamp": "2026-02-28T12:10:43Z"
  }
]