[
  {
    "title": "Viktor Orban Confirms White House Visit Soon to Discuss Russia Sanctions",
    "description": "Hungarian Prime Minister Viktor Orbán, in Italy for meetings with his counterpart Giorgia Meloni and leaders at the Vatican, told reporters on Monday that he would travel to the White House soon to discuss sanctions on Russia, which he argued disproportionate…",
    "link": "https://www.breitbart.com/europe/2025/10/28/viktor-orban-confirms-white-house-visit-soon-to-discuss-russia-sanctions/",
    "timestamp": "2025-10-28T13:17:03Z"
  },
  {
    "title": "Oversight report: Biden aides exercised presidential authority, so autopen actions are ‘VOID’!",
    "description": "Because of 'absence' of documentation that he made the decisions, they 'do not carry the force of law'",
    "link": "https://www.wnd.com/2025/10/oversight-report-biden-aides-exercised-presidential-authority-so/",
    "timestamp": "2025-10-28T13:16:21Z"
  },
  {
    "title": "Ukraine calls for increased pressure on Russian oil",
    "description": "Zelenskyy urges US to raise the pressure on Beijing over Russian energy purchases as Ukraine targets oil revenues.",
    "link": "https://www.aljazeera.com/news/2025/10/28/ukraine-calls-for-increased-pressure-on-russian-oil",
    "timestamp": "2025-10-28T13:15:42Z"
  },
  {
    "title": "Ankara gears up for next year’s NATO summit",
    "description": "Ankara is ramping up security and logistical preparations for the NATO Leaders’ Summit, set for July 7-8 of next year at the presidential complex, marking Türkiye’s second major NATO summit since Istanbul in 2004.",
    "link": "https://www.hurriyetdailynews.com/ankara-gears-up-for-next-years-nato-summit-215128",
    "timestamp": "2025-10-28T13:15:20Z"
  },
  {
    "title": "India calls out Western double standards on energy trade",
    "description": "Indian Foreign Minister S. Jaishankar emphasized the selective application of principles when it comes to oil sanctions Read Full Article at RT.com",
    "link": "https://www.rt.com/india/627058-india-calls-out-western-double/",
    "timestamp": "2025-10-28T13:14:31Z"
  },
  {
    "title": "Milei’s party wins midterms, but crypto won’t celebrate",
    "description": "Milei’s LLA made a good showing in the midterm elections, but that doesn’t necessarily spell victory for the crypto industry.",
    "link": "https://cointelegraph.com/news/milei-wins-midterms-crypto-wont-celebrate",
    "timestamp": "2025-10-28T13:13:30Z"
  },
  {
    "title": "Trump Formally Appeals New York Hush Money Conviction",
    "description": "Trump became the first convicted felon to be president upon his inauguration earlier this year.",
    "link": "https://www.huffpost.com/entry/trump-appeal-hush-money-conviction_n_6900a7e2e4b0973a4c056905",
    "timestamp": "2025-10-28T13:11:46Z"
  },
  {
    "title": "Donald Trump just admitted there is something very, very wrong with his health",
    "description": "Donald Trump has always been a malignant narcissistic sociopath, and now he’s a malignant narcissistic sociopath with dementia. Not only has his brain rot made him more insane than ever, it’s also made him unable to shut up. Trump no longer understands or rem…",
    "link": "https://www.palmerreport.com/politics/donald-trump-just-admitted-there-is-something-very-very-wrong-with-his-health/61859/",
    "timestamp": "2025-10-28T13:10:43Z"
  },
  {
    "title": "Maine and Texas are the latest fronts in voting battles, with voter ID, citizenship on the ballot",
    "description": "Maine and Texas are the latest states where Republicans are pushing ballot initiatives targeting noncitizen voting, which is rare",
    "link": "https://abcnews.go.com/Politics/wireStory/maine-texas-latest-fronts-voting-battles-voter-id-126933633",
    "timestamp": "2025-10-28T13:10:43Z"
  },
  {
    "title": "Republicans scramble to shift blame from Trump for food assistance disruption",
    "description": "About 42 million\r\n Americans – including 16 million children – stand to lose federal food assistance on Saturday as the Supplemental Nutrition Assistance Program (SNAP) expires amid the government shutdown, and Republican lawmakers and officials are scramblin…",
    "link": "https://www.rawstory.com/snap-2674239304/",
    "timestamp": "2025-10-28T13:10:18Z"
  },
  {
    "title": "Donald Trump Confuses Dementia Screening for 'Very Hard' IQ Test as He Brags About Results (Greta Bjornson/People)",
    "description": "Greta Bjornson / People:\nDonald Trump Confuses Dementia Screening for ‘Very Hard’ IQ Test as He Brags About Results  —  The president predicted that Democratic Reps. Jasmine Crockett and Alexandria Ocasio-Cortez could not perform as well as he did in a cognit…",
    "link": "https://www.memeorandum.com/251028/p28",
    "timestamp": "2025-10-28T13:10:01Z"
  },
  {
    "title": "Mike Johnson Says He Thinks Trump Knows About the 22nd Amendment",
    "description": "On Sunday, Trump told reporters he'd \"love\" to run for a third term.",
    "link": "https://www.jezebel.com/mike-johnson-says-he-thinks-trump-knows-about-the-22nd-amendment",
    "timestamp": "2025-10-28T13:08:41Z"
  },
  {
    "title": "Does Andrew Cuomo have path to victory in NYC race against Zohran Mamdani?",
    "description": "Former governor seeks to court conservative voters, but is accused of 'fear mongering' in mayoral race's final stretch.",
    "link": "https://www.aljazeera.com/news/2025/10/28/does-andrew-cuomo-have-path-to-victory-in-nyc-race-against-zohran-mamdani",
    "timestamp": "2025-10-28T13:08:19Z"
  },
  {
    "title": "Confederate statue torn down during anti-racism protests reinstalled in Washington",
    "description": "General Albert Pike's statue, toppled during George Floyd protests in 2020, is retored under orders from President Donald Trump.",
    "link": "https://www.bbc.com/news/articles/cm27ke33gvmo",
    "timestamp": "2025-10-28T13:07:57Z"
  },
  {
    "title": "Engagement doesn’t mean approval of excessive actions in South China Sea, says Anwar",
    "description": "KUALA LUMPUR: Prime Minister Datuk Seri Anwar Ibrahim affirmed that Malaysia's commitment to maintaining engagement with all nations, including major powers, must never be misconstrued as tacit approval of any excessive or provocative actions, particularly in…",
    "link": "https://www.thestar.com.my/news/nation/2025/10/28/engagement-doesnt-mean-approval-of-excessive-actions-in-south-china-sea-says-anwar",
    "timestamp": "2025-10-28T13:07:00Z"
  },
  {
    "title": "Jasmine Crockett Calls Out Trump on CNN Over New Attack: ‘Don’t Know What Black Woman Hurt Him’",
    "description": "Jasmine Crockett called out Trump over his new attack, suggesting that the president has a problem with her because a Black woman \"hurt him\" at some point.\nThe post Jasmine Crockett Calls Out Trump on CNN Over New Attack: ‘Don’t Know What Black Woman Hurt Him…",
    "link": "https://www.mediaite.com/media/tv/jasmine-crockett-calls-out-trump-on-cnn-over-new-attack-dont-know-what-black-woman-hurt-him/",
    "timestamp": "2025-10-28T13:06:59Z"
  },
  {
    "title": "FO° Talks: Trump Wants Bagram Back: Decoding The Power Game Between the US, Taliban and China",
    "description": "Fair Observer’s Video Producer Rohan Khattar Singh speaks with Ambassador Ashraf Haidari, a former Afghan diplomat and the president of Displaced International, about US President Donald Trump’s renewed interest in Afghanistan and the geopolitical battle ther…",
    "link": "https://www.fairobserver.com/video/fo-talks-trump-wants-bagram-back-decoding-the-power-game-between-the-us-taliban-and-china/",
    "timestamp": "2025-10-28T13:06:48Z"
  },
  {
    "title": "How the hesitation to 'pick the fights worth having' paved the way for Trump: report",
    "description": "Nine months into Donald Trump's second presidency, The Roosevelt Institute is releasing a report on Joe Biden's presidency that, according to The New Republic's Greg Sargent, \"seeks to diagnose\" his administration's \"governing mistakes and failures\" and inclu…",
    "link": "https://www.rawstory.com/how-the-hesitation-to-pick-the-fights-worth-having-paved-the-way-for-trump-report/",
    "timestamp": "2025-10-28T13:06:02Z"
  },
  {
    "title": "Trump's 39% tariffs 'horrible' for Switzerland, Breitling CEO says",
    "description": "Breitling CEO Georges Kern said that the U.S. tariffs were 'terrible news' for Switzerland.",
    "link": "https://www.cnbc.com/2025/10/28/breitling-says-trumps-39percent-tariffs-are-horrible-for-switzerland.html",
    "timestamp": "2025-10-28T13:05:05Z"
  },
  {
    "title": "At least 26 killed, including children, after Israeli strikes in Gaza",
    "description": "At least 26 people were killed on Tuesday after Israeli strikes in Gaza, health officials said, including strikes in Khan Younis and Gaza City.",
    "link": "https://www.cbc.ca/news/world/israel-strikes-gaza-9.6956347",
    "timestamp": "2025-10-28T13:03:22Z"
  },
  {
    "title": "Israel to respond after receiving remains not belonging to missing hostages, Netanyahu says",
    "description": "Israel will respond after Hamas handed over human remains that did not belong to missing Israeli hostages, which Israel considers a violation of the Gaza ceasefire, Prime Minister Benjamin Netanyahu said Tuesday.",
    "link": "https://www.cbc.ca/news/world/netanyahu-israel-hamas-body-missing-hostage-9.6956347",
    "timestamp": "2025-10-28T13:03:22Z"
  },
  {
    "title": "US, Japan sign agreement on 'securing' rare earths supply",
    "description": "The United States and Japan signed an agreement on Tuesday for \"securing\" supplies of critical minerals and rare earths, the White House said, as President Donald Trump visited Tokyo.",
    "link": "https://www.hurriyetdailynews.com/us-japan-sign-agreement-on-securing-rare-earths-supply-215126",
    "timestamp": "2025-10-28T13:02:52Z"
  },
  {
    "title": "Trump is still ranting about 2020 — but it’s really about 2026",
    "description": "Winning the midterms is essential for Trump's anti-democracy project — and pride",
    "link": "https://www.salon.com/2025/10/28/trump-is-still-ranting-about-2020-but-its-really-about-2026/",
    "timestamp": "2025-10-28T13:02:25Z"
  },
  {
    "title": "Trump’s brazen efforts to politicize the U.S. military go from bad to worse",
    "description": "Speaking to U.S. troops in Japan, Donald Trump made fresh efforts to politicize the military and target a bedrock principle of the United States.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-us-military-politicize-rcna240216",
    "timestamp": "2025-10-28T13:00:38Z"
  },
  {
    "title": "Trump Strikes Gold With New Trade and Critical Mineral Pacts in Asia",
    "description": "Agreements with Thailand, Malaysia, Japan, and Cambodia shows Trump's savvy use of U.S. economic power (which trumps \"soft power\").\nThe post Trump Strikes Gold With New Trade and Critical Mineral Pacts in Asia first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/trump-strikes-gold-with-new-trade-and-critical-mineral-pacts-in-asia/",
    "timestamp": "2025-10-28T13:00:03Z"
  },
  {
    "title": "Federal agent's daring plan: Recruit Maduro's pilot to turn against him...",
    "description": "A federal agent had a daring plan: persuade Nicolas Maduro's chief pilot to surreptitiously divert the Venezuelan president’s plane to a place where U.S. authorities could nab the strongman. His plan had all the ingredients of a Cold War spy thriller – luxury…",
    "link": "https://apnews.com/article/dhs-plan-capture-maduro-pilot-planes-7915d5a0819ceb518a8ca2b47da8b2e5",
    "timestamp": "2025-10-28T13:00:03Z"
  },
  {
    "title": "Why did Trump get an MRI?",
    "description": "Following Trump's assertion of a perfect MRI, cardiologist Dr. Jonathan Reiner expressed concerns about possible undisclosed neurological issues.",
    "link": "https://www.hindustantimes.com/world-news/us-news/why-did-trump-get-an-mri-scan-top-cardiologist-speculates-neurological-concerns-there-can-be-issues-with-the-101761651487187.html",
    "timestamp": "2025-10-28T13:00:03Z"
  },
  {
    "title": "How Venezuelan Regime Is Supporting Radical, Left-Wing Groups in US",
    "description": "Venezuela’s regime is coming under increasing pressure from the Trump administration for using the cartels it controls to smuggle drugs into the United States. Last... Read More\nThe post How Venezuelan Regime Is Supporting Radical, Left-Wing Groups in US appe…",
    "link": "https://www.dailysignal.com/2025/10/28/how-venezuela-is-supporting-radical-left-wing-groups-us/",
    "timestamp": "2025-10-28T13:00:00Z"
  },
  {
    "title": "The U.S. tried permanent daylight saving time—and hated it",
    "description": "In 1974, America set its clocks forward for good in the name of energy savings.\nThe post The U.S. tried permanent daylight saving time—and hated it appeared first on Popular Science.",
    "link": "http://www.popsci.com/science/permanent-daylight-saving-time-usa/",
    "timestamp": "2025-10-28T13:00:00Z"
  },
  {
    "title": "Glenn Kessler: Trump Team Politicizes the White House Website",
    "description": "Glenn Kessler continues to report on Trump’s lies. Recently, he demonstrated how Trump’s staff has filled the website with vicious partisan attacks, demeaning every Democratic President. He writes: Every White House puts its own spin on the official website. …",
    "link": "https://dianeravitch.net/2025/10/28/glenn-kessler-trump-team-politicizes-the-white-house-website/",
    "timestamp": "2025-10-28T13:00:00Z"
  },
  {
    "title": "Jim Rickards: “Billions Pour Into Rare Earths as Washington and Wall Street Come Together”",
    "description": "Ex Pentagon Insider explains in an exclusive interview how America moves to break China’s grip on critical metals — and a new wave of U.S. companies could lead the next $150 trillion boom. Ex Pentagon Insider explains in an exclusive interview how America mov…",
    "link": "https://www.globenewswire.com/news-release/2025/10/28/3175475/0/en/Jim-Rickards-Billions-Pour-Into-Rare-Earths-as-Washington-and-Wall-Street-Come-Together.html",
    "timestamp": "2025-10-28T13:00:00Z"
  },
  {
    "title": "Inside Taylor Sheridan’s Paramount Exit: Script Notes, a Zaslav Approach and a $1 Billion Offer He Couldn’t Refuse",
    "description": "“You don’t get rid of your workhorse,” an industry veteran tells TheWrap\nThe post Inside Taylor Sheridan’s Paramount Exit: Script Notes, a Zaslav Approach and a $1 Billion Offer He Couldn’t Refuse appeared first on TheWrap.",
    "link": "https://www.thewrap.com/why-taylor-sheridan-left-paramount-for-nbcuniversal/",
    "timestamp": "2025-10-28T13:00:00Z"
  },
  {
    "title": "Tuesday, October 28, 2025",
    "description": null,
    "link": "https://kffhealthnews.org/morning-briefing/tuesday-october-28-2025/",
    "timestamp": "2025-10-28T12:57:42Z"
  },
  {
    "title": "Awkward White House talks await Orban as US-Hungary relations sour",
    "description": "Trump's closest ally in Europe will head to Washington in the midst of a disagreement over Russian oil.",
    "link": "https://www.bbc.com/news/articles/c5ypl16pp81o",
    "timestamp": "2025-10-28T12:55:46Z"
  },
  {
    "title": "Donald Trump Challenges YOU To Take Super Hard Clock-Drawing Dementia Test That Proved His Genius",
    "description": "He also had to identify 'a tiger, an elephant, a giraffe' in the very difficult assessment.",
    "link": "https://www.wonkette.com/p/donald-trump-challenges-you-to-take",
    "timestamp": "2025-10-28T12:55:21Z"
  },
  {
    "title": "Decision to buy Russian oil taken by firms: Govt",
    "description": "Decision to buy Russian oil is a call taken by firms: Govt",
    "link": "https://www.thehindubusinessline.com/economy/decision-to-buy-russian-oil-taken-by-firms-govt/article70212573.ece",
    "timestamp": "2025-10-28T12:55:16Z"
  },
  {
    "title": "Decision to buy Russian oil taken by firms: Govt",
    "description": "Decision to buy Russian oil is a call taken by firms: Govt",
    "link": "https://www.thehindubusinessline.com/news/decision-to-buy-russian-oil-taken-by-firms-govt/article70212573.ece",
    "timestamp": "2025-10-28T12:55:16Z"
  },
  {
    "title": "Texas Sues Tylenol Makers After Trump Links Drug To Autism",
    "description": "“Fight like hell not to take it,” Trump said about the drug, despite lacking definitive scientific evidence.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/10/28/texas-sues-tylenol-makers-after-trump-links-drug-to-autism/",
    "timestamp": "2025-10-28T12:51:38Z"
  },
  {
    "title": "Truck Driver in Fatal Crash Repeatedly Failed Driving Tests, Florida AG’s Office Says",
    "description": "A commercial truck driver who is charged with killing three people in a deadly crash in Florida in August had failed a commercial driver’s license test 10 times in the span of two months in 2023 in Washington state, before …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/10/28/845347.htm",
    "timestamp": "2025-10-28T12:50:52Z"
  },
  {
    "title": "Trump, Uzbekistan's Mirziyoyev to meet next week",
    "description": "United States Deputy Secretary of State Christopher Landau (pictured) announced on Tuesday that next week the White House will be hosting a meeting between President Donald Trump and Uzbekistani Presi...",
    "link": "https://biztoc.com/x/a489ce3466350821",
    "timestamp": "2025-10-28T12:49:27Z"
  },
  {
    "title": "Zelensky reiterates demand for US long-range missiles",
    "description": "Ukraine’s Vladimir Zelensky has said sanctions are not enough to pressure Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627056-zelensky-trump-ukraine-tomahawk/",
    "timestamp": "2025-10-28T12:47:53Z"
  },
  {
    "title": "Republicans send Biden autopen report to Justice Department",
    "description": "House Republicans unveil a report questioning Biden’s mental state and autopen use",
    "link": "https://www.wmur.com/article/gop-report-biden-autopen-mental-state/69176609",
    "timestamp": "2025-10-28T12:44:58Z"
  },
  {
    "title": "EUA continuarão a dominar fluxos de investimentos, dizem executivos financeiros",
    "description": "EUA continuarão a dominar fluxos de investimentos globais, dizem executivos financeiros\nThe post EUA continuarão a dominar fluxos de investimentos, dizem executivos financeiros appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mercados/eua-continuarao-a-dominar-fluxos-de-investimentos-dizem-executivos-financeiros/",
    "timestamp": "2025-10-28T12:41:39Z"
  },
  {
    "title": "Bill Gates calls for climate fight to shift focus from curbing emissions to reducing human suffering",
    "description": "NEW YORK (AP) — Bill Gates thinks climate change is a serious problem but it won’t be the end of civilization. He thinks scientific innovation will curb it, and it’s instead time for a “strategic pivot” in the global climate fight: from focusing on limiting r…",
    "link": "https://financialpost.com/pmn/bill-gates-calls-for-climate-fight-to-shift-focus-from-curbing-emissions-to-reducing-human-suffering",
    "timestamp": "2025-10-28T12:38:33Z"
  },
  {
    "title": "Government shutdown update: Flights pile up in US airports, military set to miss first paycheck - here's the latest",
    "description": "US government shutdown 2025:: The US government shutdown is now the second longest ever. Millions of Americans face disrupted travel and missed paychecks. Airports are seeing flight delays due to staff shortages. Federal workers, including air traffic control…",
    "link": "https://economictimes.indiatimes.com/news/international/us/government-shutdown-update-flights-pile-up-in-us-airports-military-set-to-miss-first-paycheck-heres-the-latest/articleshow/124872813.cms",
    "timestamp": "2025-10-28T12:33:18Z"
  },
  {
    "title": "Russia and North Korea Hold Parallel Powwow as Trump Tours Asia",
    "description": "Russian strongman Vladimir Putin hosted North Korea Foreign Minister Choe Son-hui in Moscow on Monday, a visit timed to coincide with President Donald Trump’s whirlwind tour of Asia this week that he has expressed hope would include a meeting with dictator Ki…",
    "link": "https://www.breitbart.com/asia/2025/10/28/russia-and-north-korea-hold-parallel-powwow-as-trump-tours-asia/",
    "timestamp": "2025-10-28T12:32:17Z"
  },
  {
    "title": "Trump Denies B-1 Bomber Deployment Near Venezuela, Warns of Escalating Anti-Drug Operations",
    "description": "President Donald Trump denied reports of B-1 Lancer bombers near Venezuela, calling them \"false,\" but acknowledged displeasure with Venezuela over drug trafficking. Despite the denial, U.S. military operations in the region have intensified, including surveil…",
    "link": "https://www.shtfplan.com/headline-news/trump-denies-b-1-bomber-deployment-near-venezuela-warns-of-escalating-anti-drug-operations",
    "timestamp": "2025-10-28T12:30:13Z"
  },
  {
    "title": "Future of nation’s energy grid hurt by Trump’s funding cuts",
    "description": "Many of the canceled grants were investments in the science and infrastructure necessary to keep the lights on in coming years, especially when the grid is under stress.",
    "link": "https://theconversation.com/future-of-nations-energy-grid-hurt-by-trumps-funding-cuts-267504",
    "timestamp": "2025-10-28T12:27:43Z"
  },
  {
    "title": "Iraq’s Dangerous Deal With Iran",
    "description": "Iraq is oil-rich and buzzing with new construction—yet it still can’t get out from between the U.S. and Iran.",
    "link": "https://www.theatlantic.com/international/archive/2025/10/iran-iraq-deal/684707/",
    "timestamp": "2025-10-28T12:27:42Z"
  },
  {
    "title": "King Trump Makes It Clear He Wants His BFF Larry Ellison To Own Warner Brothers",
    "description": "Whether it’s Jeff Bezos lobotomizing the Washington Post, Elon Musk turning Twitter into a far right propaganda mill, or Larry Ellison buying CBS, CNN, and TikTok, the country’s shittiest right wing billionaires aren’t being subtle about their quest to domina…",
    "link": "https://www.techdirt.com/2025/10/28/king-trump-makes-it-clear-he-wants-his-bff-larry-ellison-to-own-warner-brothers/",
    "timestamp": "2025-10-28T12:27:41Z"
  },
  {
    "title": "Ben & Jerry’s owner stopped brand developing flavour for peace in Gaza",
    "description": "Co-founder accuses ice-cream brand’s parent of taking part in ‘corporate butt kissing’ of Donald Trump\nThe co-founder of Ben & Jerry’s has accused its owner of being part of a movement of “corporate butt kissing” of Donald Trump and says management blocked th…",
    "link": "https://biztoc.com/x/981f0bb1798fa7f3",
    "timestamp": "2025-10-28T12:27:35Z"
  },
  {
    "title": "Why the Trump administration’s comparison of antifa to violent terrorist groups doesn’t track",
    "description": "Kristi Noem’s claim that antifa is like the Islamic State group blurs the line between protest and terrorism – a political move unsupported by evidence.",
    "link": "https://theconversation.com/why-the-trump-administrations-comparison-of-antifa-to-violent-terrorist-groups-doesnt-track-267514",
    "timestamp": "2025-10-28T12:24:40Z"
  },
  {
    "title": "Will Microsoft be able to stop the White House using AI-generated Halo imagery to depict Trump as Master Chief and to promote and recruit for ICE? Depressingly, I doubt it",
    "description": "The US government's use of AI-generated Halo imagery on social media has absolutely been a power-play to appeal to like-minded American gamers. Read more",
    "link": "https://www.eurogamer.net/will-microsoft-be-able-to-stop-the-white-house-using-ai-generated-halo-imagery-to-depict-trump-as-master-chief-and-to-promote-and-recruit-for-ice-depressingly-i-doubt-it",
    "timestamp": "2025-10-28T12:22:52Z"
  },
  {
    "title": "MAGA attorney general sues Tylenol maker over alleged autism links",
    "description": "Texas Attorney General Ken Paxton is suing the makers of Tylenol over its alleged links to autism in children.The state became the first to sue Johnson & Johnson and spinoff company Kenvue after President Donald Trump claimed that using the over-the-counter p…",
    "link": "https://www.rawstory.com/trump-tylenol-lawsuit/",
    "timestamp": "2025-10-28T12:22:06Z"
  },
  {
    "title": "Amazon layoffs, Qualcomm's AI chips, Airbnb cracks down on Halloween and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/28/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-10-28T12:21:52Z"
  },
  {
    "title": "Melania Trump distances herself from Donald’s White House Ballroom project — ‘She’s not on board,’ source says",
    "description": "Melania Trump is not supporting Donald Trump’s plan to build a big White House ballroom. Reports say she does not want the East Wing torn down. The project has started a lot of talk because it changes a historic part of the White House. Many people are worrie…",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trump-distances-herself-from-donalds-white-house-ballroom-project-shes-not-on-board-source-says/articleshow/124873576.cms",
    "timestamp": "2025-10-28T12:21:11Z"
  },
  {
    "title": "Congress Enjoys Ultraluxe Health Care as It Fights to Gut Yours - NewsBreak",
    "description": "If the republic were the Titanic and the government’s end-of-year shutdown over health care the iceberg, Congress would be the first-class passengers alrea",
    "link": "https://www.newsbreak.com/share/4316413102666-congress-enjoys-ultraluxe-health-care-as-it-fights-to-gut-yours?s=a2&amp;share_destination_id=MjkyMzc4OTkwLTE3NjE2NTQwMjU5NDM%3D&amp;pd=0Jmn8Any&amp;hl=en_US&amp;send_time=1761654025&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-28T12:21:05Z"
  },
  {
    "title": "GOP voters in Northern California brace for loss of representation in fight for US House",
    "description": "In a stretch of Northern California known for farming, ranching and a rural way of life, residents worry a ballot measure to redraw U.S. House maps is all...",
    "link": "https://www.yahoo.com/news/articles/gop-voters-northern-california-brace-121929521.html",
    "timestamp": "2025-10-28T12:19:29Z"
  },
  {
    "title": "America's government shutdown 2025 has different political rules",
    "description": "Washington is experiencing a government shutdown. Many Americans are unaware or unconcerned about the ongoing closure. Political leaders in Congress and President Donald Trump show little interest in compromise. This impasse is likely to continue as incentive…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/americas-government-shutdown-2025-has-different-political-rules/articleshow/124873671.cms",
    "timestamp": "2025-10-28T12:19:11Z"
  },
  {
    "title": "Ukraine Says Its Long-Range Strikes Have Taken Out One Fifth of Russia's Oil Refining Capacity",
    "description": "Ukraine´s long-range strikes on refineries have reduced Moscow´s refining capacity by 20%, Volodymyr Zelenskyy said.\nThe post Ukraine Says Its Long-Range Strikes Have Taken Out One Fifth of Russia’s Oil Refining Capacity appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/10/28/ukraine-says-its-long-range-strikes-have-taken-out-one-fifth-of-russias-oil-refining-capacity/",
    "timestamp": "2025-10-28T12:19:05Z"
  },
  {
    "title": "Trump On Track To Recoup $10M Improperly Paid To Agency’s Senior Executives Under Biden",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 27, 2025\nThe Biden administration’s Department of Veterans Affairs improperly awarded $10.8 million in bonuses meant for staffers who directly serve veterans to highly paid senior executives. Under Pr…",
    "link": "https://biztoc.com/x/ace68701b49737c7",
    "timestamp": "2025-10-28T12:16:36Z"
  },
  {
    "title": "Netanyahu promises response after Hamas returns remains not belonging to missing hostages",
    "description": "Hamas says efforts to identify bodies is being hindered by a lack of equipment",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/28/netanyahu-promises-response-after-hamas-returns-remains-not-belonging-to-missing-hostages/",
    "timestamp": "2025-10-28T12:12:52Z"
  },
  {
    "title": "ASEAN integration may be incremental but commitment among leaders is firm: PM Wong",
    "description": "Integration efforts within the Association of Southeast Asian Nations (ASEAN) “may seem incremental to some” but there are “considerable commitment and determination” among the leaders, says Singapore Prime Minister Lawrence Wong.",
    "link": "https://www.channelnewsasia.com/singapore/asean-integration-may-be-incremental-commitment-among-leaders-firm-lawrencewong-5429301",
    "timestamp": "2025-10-28T12:12:47Z"
  },
  {
    "title": "The Republican Plan to Reform the Census Could Put Everyone's Privacy at Risk (Vittoria Elliott/Wired)",
    "description": "Vittoria Elliott / Wired:\nThe Republican Plan to Reform the Census Could Put Everyone's Privacy at Risk  —  A little-known algorithmic process called “differential privacy” helps keep census data anonymous.  Conservatives want it gone.  —  President Donald Tr…",
    "link": "https://www.memeorandum.com/251028/p15",
    "timestamp": "2025-10-28T12:10:01Z"
  },
  {
    "title": "‘Trump 2028’: Could the US president really go for a third term?",
    "description": "US president says he'd 'love' a third term in the White Office.",
    "link": "https://www.aljazeera.com/news/2025/10/28/trump-2028-could-the-us-president-really-go-for-a-third-term",
    "timestamp": "2025-10-28T12:09:52Z"
  },
  {
    "title": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely",
    "description": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely\nMoneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below.\nPresident Donald Trump’s new tax bill cuts …",
    "link": "https://biztoc.com/x/bbd72f3b424815ba",
    "timestamp": "2025-10-28T12:06:02Z"
  },
  {
    "title": "Former US Commerce Secretary Slams Trump Tariffs On India",
    "description": "Former US Secretary Of Commerce Gina Raimondo criticised President Donald Trump's reciprocal tariff policy, calling it \"disastrous\" and said that he was making a \"big mistake\" when it comes to India.",
    "link": "https://www.ndtvprofit.com/world/disastrous-policy-former-us-commerce-secretary-slams-trump-tariffs-on-india",
    "timestamp": "2025-10-28T12:05:49Z"
  },
  {
    "title": "US immigration enforcers use Halo art to promote mass detention, while the White House and Gamestop swap Master Trump memes",
    "description": "The USA's Immigration Customs Enforcement service, aka ICE, have started using imagery of Microsoft's sci-fi shooter Halo for recruitment posts on social media, even as Gamestop and the US administration indulge in some bantz characterising Donald Trump as Ma…",
    "link": "https://www.rockpapershotgun.com/us-immigration-enforcers-use-halo-art-to-promote-mass-detention-while-the-white-house-and-gamestop-swap-master-trump-memes",
    "timestamp": "2025-10-28T12:04:26Z"
  },
  {
    "title": "Ahead of COP30, UN Report Shows 1.5°C Will Be Breached as Countries Pledge Just 10% Emissions Cut",
    "description": "Ahead of the United Nations' global summit on the climate emergency in Belém, Brazil, a report on countries' climate plans released Tuesday served as both \"a progress update and a warning siren,\" one campaigner said.According to the Nationally Determined Cont…",
    "link": "https://www.commondreams.org/news/cop30-climate-summit",
    "timestamp": "2025-10-28T12:04:00Z"
  },
  {
    "title": "The Atlantic’s December Cover: David Graham and J. Michael Luttig on “The Coming Election Mayhem”",
    "description": "Donald Trump’s plans to throw the 2026 midterms into chaos are already under way.",
    "link": "https://www.theatlantic.com/press-releases/archive/2025/10/atlantics-december-cover-the-coming-election-mayhem/684716/",
    "timestamp": "2025-10-28T12:03:10Z"
  },
  {
    "title": "Trump slams Fed chair, eyes replacement in a few months",
    "description": "TOKYO (Reuters) -U.S. President Donald Trump on Tuesday said there was a long list of people who could take over the Federal Reserve, slamming current...",
    "link": "https://www.yahoo.com/news/articles/trump-slams-fed-chair-eyes-120059591.html",
    "timestamp": "2025-10-28T12:00:59Z"
  },
  {
    "title": "Vans parent VF Corp beats quarterly estimates on demand",
    "description": "Vans parent VF Corp has today posted better-than-expected results for the second quarter, helped by strong demand for its footwear, bags and lifestyle apparel, even as economic uncertainty looms.",
    "link": "https://www.rte.ie/news/business/2025/1028/1540916-vans-parent-vf-corp-results/",
    "timestamp": "2025-10-28T12:00:33Z"
  },
  {
    "title": "'Serious need for speed' in global climate commitments amid shortfalls in 2035 target",
    "description": "A report from the UN's climate change body shows global carbon emissions appear to be on track to fall by 10 per cent by 2035, far short of its 60 per cent target.",
    "link": "https://www.abc.net.au/news/2025-10-28/climate-goals-not-on-track-to-meet-2035-emissions-target-says-un/105945130",
    "timestamp": "2025-10-28T12:00:21Z"
  },
  {
    "title": "RFR’s Aby Rosen On Midtown Rents, Amazon, Mamdani, the Chrysler Building and More",
    "description": "The name Aby Rosen is one of the few in real estate that has migrated into the wider consciousness. Aby Rosen the art collector. Aby Rosen who travels in circles with Jeff Koons, Damien Hirst, Ian Schrager, Julian Schnabel and Sir Norman Foster. Aby Rosen the…",
    "link": "http://commercialobserver.com/2025/10/aby-rosen-rfr-manhattan-art-chrysler-seagram-2025/",
    "timestamp": "2025-10-28T12:00:01Z"
  },
  {
    "title": "Hungary and Romania Refinery Fire: Sabotage or Negligence?",
    "description": "On Monday, explosions were reported at an oil refinery in Hungary and another in Romania. The initial explosion occurred at the Petrotel-Lukoil refinery located in Ploieşti, Romania, followed by a second fire and subsequent explosions at the AV3 plant of MOL’…",
    "link": "https://www.activistpost.com/hungary-and-romania-refinery-fire-sabotage-or-negligence/",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "The Lingering Delusion",
    "description": "Kamala Harris’s memoir 107 Days succeeds at least in distilling the evasions and weaknesses of the modern Democratic Party.",
    "link": "http://www.nybooks.com/articles/2025/11/20/the-lingering-delusion-107-days-kamala-harris/",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "The 10 Best ‘Weekend Update’ Jokes So Far This Season on ‘Saturday Night Live’",
    "description": "Michael Che’s at his best with a specific kind of joke",
    "link": "https://www.cracked.com/article_48914_the-10-best-weekend-update-jokes-so-far-this-season-on-saturday-night-live.html",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "Eric Metaxas: God Created Curtis Sliwa to be NYC Mayor",
    "description": "Eric Metaxas: \"Is there any question that Curtis Sliwa was created by God to be mayor of New York City?”",
    "link": "https://www.peoplefor.org/rightwingwatch/eric-metaxas-god-created-curtis-sliwa-be-nyc-mayor",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Slams ‘Degraded’ CNN for Paying ‘Rabid’ Scott Jennings to ‘Lie’ About Trump",
    "description": "O’Donnell slammed CNN on Monday as an “absurdly degraded” network as he blasted its CEO for paying “rabid” Scott Jennings to “lie about Donald Trump.”\nThe post MSNBC’s Lawrence O’Donnell Slams ‘Degraded’ CNN for Paying ‘Rabid’ Scott Jennings to ‘Lie’ About Tr…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-lawrence-odonnell-slams-degraded-cnn-for-paying-rabid-scott-jennings-to-lie-about-trump/",
    "timestamp": "2025-10-28T11:58:31Z"
  },
  {
    "title": "How Mike Waltz is leading the Trump administration's 'a la carte' approach to UN funding",
    "description": "The new U.S. ambassador to the United Nations has been making the case that the United States will no longer be footing the bill the way it has since the world body’s founding eight decades ago",
    "link": "https://abcnews.go.com/US/wireStory/mike-waltz-leading-trump-administrations-la-carte-approach-126928489",
    "timestamp": "2025-10-28T11:57:53Z"
  },
  {
    "title": "A federal agent's daring plan: Recruit Maduro's pilot to turn on the Venezuelan leader",
    "description": "The federal agent had a daring pitch for Nicolás Maduro’s chief pilot: All he had to do was surreptitiously divert the Venezuelan president’s plane to a...",
    "link": "https://www.yahoo.com/news/articles/federal-agents-daring-plan-recruit-115713137.html",
    "timestamp": "2025-10-28T11:57:13Z"
  },
  {
    "title": "Climate Week Showed What’s Possible; Now New York Has to Deliver",
    "description": "During the last week of September, as Climate Week turned New York City into a hub of panel discussions, protests, and policy announcements, I felt both inspired and unsettled. It is always energizing to watch tens of thousands of people come together from ar…",
    "link": "https://www.commondreams.org/opinion/new-york-deliver-climate-action",
    "timestamp": "2025-10-28T11:55:03Z"
  },
  {
    "title": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely",
    "description": "And will there be a catch to this tax holiday?",
    "link": "https://finance.yahoo.com/news/under-trump-millions-americans-could-115500503.html",
    "timestamp": "2025-10-28T11:55:00Z"
  },
  {
    "title": "Trump Hints Deployment to More US Cities in Speech to Troops",
    "description": "While on the second stop of his three-country tour of Asia, President Donald Trump met with Japan’s newly elected Prime Minister Sanae Takaichi. After, while addressing American troops on a U.S. carrier, he referenced his controversial use of the military at …",
    "link": "https://biztoc.com/x/d6261761bfbd2da6",
    "timestamp": "2025-10-28T11:54:08Z"
  },
  {
    "title": "Russia’s Latest Attempt to Woo the US Reeks of Desperation",
    "description": "Kirill Dmitriev, the Kremlin’s top economic envoy, arrived in the United States with holes in his sails and no wind to push him forward. He was a man on a desperate mission. A phone call between Sergei Lavrov, Russia’s foreign minister, and Marco Rubio, the U…",
    "link": "https://freerepublic.com/focus/f-news/4349121/posts",
    "timestamp": "2025-10-28T11:53:01Z"
  },
  {
    "title": "Oil falls 1% as investors assess Russia sanctions, OPEC+ output plans",
    "description": "LONDON (Reuters) -Oil prices fell by more than 1% on Tuesday in a third day of declines as investors assess the effect of U. sanctions on Russia's two...",
    "link": "https://finance.yahoo.com/news/oil-falls-1-investors-assess-114925676.html",
    "timestamp": "2025-10-28T11:49:25Z"
  },
  {
    "title": "Soaring electricity bills squeeze households as utilities hike rates",
    "description": "Rising utility bills across the country are leaving customers feeling powerless in the face of the escalating costs.",
    "link": "https://www.cbsnews.com/news/utility-bills-rate-hikes-2025/?ftag=YHF4eb9d17",
    "timestamp": "2025-10-28T11:46:20Z"
  },
  {
    "title": "Oil Falls as Traders Focus on Glut After Sanctions Rally Wanes",
    "description": "Oil declined as mounting signs of oversupply quelled a bumper rally triggered by US sanctions on key Russian producers last week.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-falls-as-traders-focus-on-glut-after-sanctions-rally-wanes",
    "timestamp": "2025-10-28T11:45:56Z"
  },
  {
    "title": "Can Donald Trump Restore American Citizenship?",
    "description": "Once, being an American citizen meant something. The Democrats destroyed that, but Trump (with your help) is working hard to re-ravel this great unraveling. Among the most daunting challenges facing Donald Trump is his determination to restore the value and u…",
    "link": "https://freerepublic.com/focus/f-chat/4349120/posts",
    "timestamp": "2025-10-28T11:45:52Z"
  },
  {
    "title": "Premier of Ontario said the anti-tariff Reagan ad that blew up trade talks with Trump is the 'best ad that ever ran'",
    "description": "Doug Ford said that the Reagan ad that derailed trade talks with Trump is the \"best ad that ever ran,\" as Canada courts Asia for new trade relations.",
    "link": "https://www.businessinsider.com/ontario-premier-not-sorry-for-airing-anti-tariff-reagan-ad-2025-10",
    "timestamp": "2025-10-28T11:44:01Z"
  },
  {
    "title": "Morning Bid: Gold sold, stocks stall",
    "description": "and global markets today , Editor-At-Large, Finance and Markets As U. stock indexes hit new records on Monday ahead of a likely Federal Reserve interest rate...",
    "link": "https://finance.yahoo.com/news/morning-bid-gold-sold-stocks-113934575.html",
    "timestamp": "2025-10-28T11:39:34Z"
  },
  {
    "title": "Transcript: Trump’s Crazed Rant over Cognitive Test Shows His Decline",
    "description": "The following is a lightly edited transcript of the October 28 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent.On Air For…",
    "link": "https://newrepublic.com/article/202333/transcript-trump-crazed-rant-cognitive-test-shows-decline",
    "timestamp": "2025-10-28T11:38:06Z"
  },
  {
    "title": "Jay-Z dismisses backlash over decision to have Bad Bunny perform Super Bowl LV halftime show",
    "description": "Jay-Z came out in defense of Bad Bunny on Monday and dismissed the backlash his selection to do the Super Bowl LX halftime show has gotten.",
    "link": "https://www.foxnews.com/sports/jay-z-dismisses-backlash-over-decision-have-bad-bunny-perform-super-bowl-lv-halftime-show",
    "timestamp": "2025-10-28T11:36:35Z"
  }
]