[
  {
    "title": "Barclays cuts rates on some mortgages to below 4%",
    "description": "It is the biggest lender so far to offer cheaper deals as the Bank of England is forecast to make more interest rate cuts this year.",
    "link": "https://www.bbc.com/news/articles/clywwlyx84no",
    "timestamp": "2025-04-10T10:43:57Z"
  },
  {
    "title": "The United States has gone rogue. There must be consequences",
    "description": "Article URL: https://www.disconnect.blog/p/the-united-states-has-gone-rogue\nComments URL: https://news.ycombinator.com/item?id=43642607\nPoints: 6\n# Comments: 2",
    "link": "https://www.disconnect.blog/p/the-united-states-has-gone-rogue",
    "timestamp": "2025-04-10T10:43:40Z"
  },
  {
    "title": "European and Asian stocks surge after Trump's pause on tariffs",
    "description": "President Donald Trump announced a 90-day pause on all tariffs except for those against China, which he said would now rise to 125%.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-live-updates-global-tariffs-china-rcna200557",
    "timestamp": "2025-04-10T10:43:39Z"
  },
  {
    "title": "Abu Dhabi’s Mubadala Buys Its First Stakes in US Gas Projects",
    "description": "Abu Dhabi wealth fund Mubadala Investment Co. agreed to buy a stake in natural gas production and export projects in the US, weeks after the Middle Eastern emirate promised major investments in America.",
    "link": "https://financialpost.com/pmn/business-pmn/abu-dhabis-mubadala-buys-its-first-stakes-in-us-gas-projects",
    "timestamp": "2025-04-10T10:42:42Z"
  },
  {
    "title": "Trump Will Fix Dishwashers and Get More Water Out of Showerheads, Transportation Chief Says",
    "description": "Transportation Secretary Sean Duffy said on Wednesday that President Donald Trump would work to fix dishwashers and make more water come out of showerheads.\nThe post Trump Will Fix Dishwashers and Get More Water Out of Showerheads, Transportation Chief Says f…",
    "link": "https://www.mediaite.com/tv/trump-will-fix-dishwashers-and-get-more-water-out-of-showerheads-transportation-chief-says/",
    "timestamp": "2025-04-10T10:42:34Z"
  },
  {
    "title": "EU Follows Trump's Lead on Tariffs Pause: 'We Took Note'",
    "description": "President Donald Trump paused his reciprocal tariffs for 90 days.",
    "link": "https://www.newsweek.com/eu-trump-tariffs-pause-2057896",
    "timestamp": "2025-04-10T10:42:32Z"
  },
  {
    "title": "Tariff war: Aluminium producers closely monitoring dynamic situation, say analysts",
    "description": "With the US pausing reciprocal tariffs, Indian aluminium producers are closely monitoring trade flow changes, particularly concerning potential dumping from China and the Middle East. While the pause doesn't affect existing 25% levies on aluminium, India's mi…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/tariff-war-aluminium-producers-closely-monitoring-dynamic-situation-say-analysts/articleshow/120155294.cms",
    "timestamp": "2025-04-10T10:40:45Z"
  },
  {
    "title": "Here’s what proposed ACA marketplace rule changes mean in Pennsylvania",
    "description": "Here’s what proposed ACA marketplace rule changes mean in Pennsylvaniainquirer.com",
    "link": "https://www.inquirer.com/health/affordable-care-act-pennie-pennsylvania-changes-2025-20250410.html",
    "timestamp": "2025-04-10T10:40:18Z"
  },
  {
    "title": "EU pauses retaliatory tariffs following Trump’s trade U-turn | CNN Business",
    "description": "The European Union has announced it is putting retaliatory measures against the United States on hold for 90 days after US President Donald Trump unveiled a similar pause Wednesday.",
    "link": "https://www.cnn.com/2025/04/10/business/eu-pauses-retaliatory-tariffs/index.html",
    "timestamp": "2025-04-10T10:39:12Z"
  },
  {
    "title": "Wife of Trump Voter Detained By ICE 'Trusts' President To Make US Safer",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA Republican voter's wife who was detained by federal immigration authorities has told Newsweek in an exclusive interview that she still believes in President Donald Trump's immigration policies—even after spe…",
    "link": "https://biztoc.com/x/27f2077e3ff53464",
    "timestamp": "2025-04-10T10:39:03Z"
  },
  {
    "title": "French PM says Trump admin causing 'contagion of worries'",
    "description": "French Prime Minister Francois Bayrou said on Thursday that United States President Donald Trump's administration is causing \"a contagion of worries\" worldwide with its unpredictable tariff policies. ...",
    "link": "https://biztoc.com/x/ac6211f091a0e97a",
    "timestamp": "2025-04-10T10:39:01Z"
  },
  {
    "title": "Trump's Tumultuous Tariffs | Opinion",
    "description": "Besieged at home by a collapsing economy and overseas by countries refusing to capitulate to extortion and humiliation, President Donald Trump chose to unwind some of his capricious tariffs.",
    "link": "https://biztoc.com/x/dd135f9aaaf52eb8",
    "timestamp": "2025-04-10T10:38:55Z"
  },
  {
    "title": "Trump’s tariffs are Democrats’ golden opportunity. Are they botching it?",
    "description": "House Minority Leader Hakeem Jeffries confers with Senate Minority Leader Chuck Schumer.\nPresident Donald Trump has launched a global trade war, raising prices and tanking stocks in the process. His approval rating is in free fall. And yet, somehow, the Democ…",
    "link": "https://biztoc.com/x/40ea7bdd5b532c0f",
    "timestamp": "2025-04-10T10:38:44Z"
  },
  {
    "title": "'Great time to buy it': How Trump's tip on social media made money for investors who listened",
    "description": "Trump’s ‘buy’ tip on social media before his tariffs pause made money for investors who listened\nTrump’s ‘buy’ tip on social media before his tariffs pause made money for investors who listened\nNEW YORK (AP) — When Donald Trump offered some financial advice W…",
    "link": "https://biztoc.com/x/8f6ab90594c7fb69",
    "timestamp": "2025-04-10T10:38:41Z"
  },
  {
    "title": "Trump's Car Tariffs Could Drive Slovakia Into Russia's Arms",
    "description": "On March 26, President Donald Trump announced that the United States would levy a 25 percent tariff on all vehicles assembled in foreign countries, beginning on April 2. He further announced that the tariff would be extended in May to include key components u…",
    "link": "https://biztoc.com/x/8e0c5ae27d0b08c2",
    "timestamp": "2025-04-10T10:38:37Z"
  },
  {
    "title": "EU would ‘cut its own throat’ by pivoting to China – US Treasury secretary",
    "description": "Scott Bessent has warned the bloc against closer ties with Beijing at the expense of relations with Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615507-eu-cut-throat-pivot-china/",
    "timestamp": "2025-04-10T10:35:58Z"
  },
  {
    "title": "AUKUS Nuclear Submarine Sale Under Scrutiny as Trump Tariffs Rattle Australia",
    "description": "The sale of nuclear-powered submarines to Australia under the AUKUS treaty faces new doubts as U.S. President Donald Trump's tariffs take hold, and amid concern in Washington that providing the subs to Canberra may reduce deterrence to China.",
    "link": "https://gcaptain.com/aukus-nuclear-submarine-sale-under-scrutiny-as-trump-tariffs-rattle-australia/",
    "timestamp": "2025-04-10T10:35:40Z"
  },
  {
    "title": "Wife of Trump Voter Detained By ICE 'Trusts' President To Make US Safer",
    "description": "\"I trust in the process that he's doing this to make the country a safer place, safe for me and for the immigrants,\" Camila Muñoz told Newsweek.",
    "link": "https://www.newsweek.com/trump-voter-wife-ice-bradley-bartell-camila-munoz-2057840",
    "timestamp": "2025-04-10T10:34:41Z"
  },
  {
    "title": "Aluminium sector watches closely as US pauses tariff hike on most nations, including India",
    "description": "US pauses reciprocal tariffs, India's aluminium industry closely monitors trade flows amid global market meltdown and tariff changes.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/aluminium-sector-watches-closely-as-us-pauses-tariff-hike-on-most-nations-including-india/article69434909.ece",
    "timestamp": "2025-04-10T10:33:54Z"
  },
  {
    "title": "US banks predict climate goals will fail – but air conditioning firms will thrive",
    "description": "Reports predict global heating will bring catastrophes and that air conditioning market could grow by 41%",
    "link": "https://www.nationalobserver.com/2025/04/10/news/us-banks-climate-goals-fail-air-conditioning",
    "timestamp": "2025-04-10T10:33:19Z"
  },
  {
    "title": "Donald Trump: the 14 hours that brought a “turnaround” on tariffs – The markets and the background",
    "description": "From the Oval to Fox Business: Pressure from financial circles and advisers - The intervention of billionaires - Musk, Ackman and Graham on the counterattack\nThe post Donald Trump: the 14 hours that brought a “turnaround” on tariffs – The markets and the back…",
    "link": "https://en.protothema.gr/2025/04/10/donald-trump-the-14-hours-that-brought-a-turnaround-on-tariffs-the-markets-and-the-background/",
    "timestamp": "2025-04-10T10:32:21Z"
  },
  {
    "title": "Another U-Turn: Trump reverses tariffs that caused market meltdown, but companies remain bewildered",
    "description": "Donald Trump's trade policies created confusion. He suspended import taxes after initially imposing them. This action followed market instability. Businesses faced uncertainty and some delayed plans. Companies like Stellantis and Cleveland-Cliffs cut jobs. Th…",
    "link": "https://timesofindia.indiatimes.com/world/us/another-u-turn-trump-reverses-tariffs-that-caused-market-meltdown-but-companies-remain-bewildered/articleshow/120154767.cms",
    "timestamp": "2025-04-10T10:31:48Z"
  },
  {
    "title": "Quote of the Day",
    "description": "“What a day, but more great days coming!!!” — Donald Trump, on Truth Social at 12.45 a.m. this morning.",
    "link": "https://politicalwire.com/2025/04/10/quote-of-the-day-4129/",
    "timestamp": "2025-04-10T10:31:00Z"
  },
  {
    "title": "Bill Gross said investors should rethink stocks when prices depend on Trump having 'a good night's sleep'",
    "description": "Pimco cofounder Bill Gross said the market \"crash\" would affect millennial and Gen Z investors and result in \"more conservative attitudes.\"",
    "link": "https://www.businessinsider.com/bill-gross-stock-market-investors-donald-trump-tariffs-pause-2025-4",
    "timestamp": "2025-04-10T10:30:49Z"
  },
  {
    "title": "Trump's Tumultuous Tariffs | Opinion",
    "description": "Besieged at home by a collapsing economy and overseas by countries refusing to capitulate to extortion and humiliation, President Donald Trump chose to unwind some of his capricious tariffs.",
    "link": "https://www.newsweek.com/trumps-tumultuous-tariffs-opinion-2057563",
    "timestamp": "2025-04-10T10:30:01Z"
  },
  {
    "title": "SignalGate Is Making People Rethink Who’s in Their Group Chats",
    "description": "From a national security breach to “The Group Chat” series on TikTok, the messy dynamics of group communication are igniting questions around trust and the rules of social connection.",
    "link": "https://www.wired.com/story/signalgate-is-making-people-rethink-whos-in-their-group-chats/",
    "timestamp": "2025-04-10T10:30:00Z"
  },
  {
    "title": "'You can't make decisions': Virginia businesses struggle to plan in Trump trade war",
    "description": "President Donald Trump's announcement that he was rolling back tariffs caused embattled stock markets to rally, but did not relieve the uncertainty that many Virginia businesses face.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_8b7c7438-3576-4fe0-9646-b301f8134999.html",
    "timestamp": "2025-04-10T10:30:00Z"
  },
  {
    "title": "Inflation likely cooled last month as businesses braced for higher tariffs",
    "description": "Inflation likely declined last month as the cost of energy, used cars and hotel rooms may have fallen, though President Donald Trump’s remaining tariffs could lift prices soon",
    "link": "https://abcnews.go.com/Business/wireStory/inflation-cooled-month-businesses-braced-higher-tariffs-120667444",
    "timestamp": "2025-04-10T10:29:51Z"
  },
  {
    "title": "EU weighs 90-day pause of its response to Trump’s metals duties",
    "description": "Delay to collecting tariffs on €21 billion in U.S. exports would buy time to negotiate a deal with the Donald Trump administration.",
    "link": "https://www.politico.eu/article/eu-weighs-90-day-pause-of-its-response-to-trumps-metals-duties/",
    "timestamp": "2025-04-10T10:29:29Z"
  },
  {
    "title": "Business leaders from Bill Ackman to Mark Cuban react to Trump's tariff pause",
    "description": "President Donald Trump on Wednesday announced a 90-day pause in his tariff plan for most countries.\n- Stock markets surged in response to the pause after several days of significant declines.\n- Business leaders across the spectrum, from Bill Ackman to Mark Cu…",
    "link": "https://biztoc.com/x/ce2a586670252611",
    "timestamp": "2025-04-10T10:27:49Z"
  },
  {
    "title": "‘Nobody’s ever heard of it. It’s gonna be a record’: Donald Trump is claiming victory for the stock market’s rebound",
    "description": "President Trump’s 90-day pause on aggressive tariff policies triggered a market rebound, allowing him to claim credit for what he called the “biggest day in financial history,” despite markets not fully recovering from earlier losses. Critics argue the policy…",
    "link": "https://biztoc.com/x/305a4955eb33d444",
    "timestamp": "2025-04-10T10:27:47Z"
  },
  {
    "title": "Focus: Wall Street's response to tariff shock: client calls and bonus worries",
    "description": "With markets crashing after U.S. President Donald Trump announced his latest tariffs, Citigroup’s banking head Viswas Raghavan called a global meeting of senior bankers on Monday and told them to get on the phone with their clients.\nRaghavan's message was sim…",
    "link": "https://biztoc.com/x/c5535d23d7d53999",
    "timestamp": "2025-04-10T10:27:46Z"
  },
  {
    "title": "Rollercoaster week for global bonds continues as 'Trump put' sparks reversals",
    "description": "Global bond yields largely reversed course on Thursday as equities rebounded on a historically volatile week for markets driven by U.S. President Donald Trump's tariff policy.\nTrump has stunned investors over the past week, first by imposing far more severe t…",
    "link": "https://biztoc.com/x/677228acdccf2eee",
    "timestamp": "2025-04-10T10:27:38Z"
  },
  {
    "title": "China channels Chairman Mao in trade war with a vow for 'complete victory' over the U.S.",
    "description": "The war of words and trade between Washington and Beijing took a fresh turn Thursday when a Chinese diplomat shared a video of Mao Zedong.",
    "link": "https://www.nbcnews.com/news/world/china-tariffs-trump-chairman-mao-zedong-ning-trade-war-rcna200558",
    "timestamp": "2025-04-10T10:27:21Z"
  },
  {
    "title": "Crypto trading firm warns of 'classic bull trap' as Bitcoin tags $82.7K",
    "description": "Bitcoin (BTC) risks becoming part of a “classic bull trap” when the US-China trade war takes its next step, analysis warns.In its latest bulletin to Telegram channel subscribers on April 10, trading firm QCP Capital cautioned over the latest crypto price rebo…",
    "link": "https://cointelegraph.com/news/crypto-trading-firm-warns-classic-bull-trap-abitcoin-tags-82-7-k",
    "timestamp": "2025-04-10T10:27:16Z"
  },
  {
    "title": "Moody's Cuts India's 2025 Growth Forecast Citing US Tariff Impact",
    "description": "Moody&#039;s Analytics has downgraded India&#039;s growth forecast for 2025 by 30 basis points to 6.1% from the baseline it forecast in March, following the latest announcement of U.S. tariffs.",
    "link": "https://www.ndtv.com/world-news/moodys-cuts-indias-2025-growth-forecast-citing-us-tariff-impact-8132297",
    "timestamp": "2025-04-10T10:26:34Z"
  },
  {
    "title": "Union due deductions cancelled in government employee checks, Wright-Patterson email says",
    "description": "Union due deductions cancelled in government employee checks, Wright-Patterson email saysdaytondailynews.com",
    "link": "https://www.daytondailynews.com/local/union-dues-no-longer-deducted-from-air-force-civilian-employee-checks/JD7JK7NP7VHANAM2WQAJU3AUZQ/",
    "timestamp": "2025-04-10T10:26:13Z"
  },
  {
    "title": "Russian-American Ksenia Karelina released in prisoner exchange",
    "description": "Russia released a dual Russian-U.S. citizen jailed for donating to a charity providing aid to Ukraine, her lawyer said on Thursday, in what the Wall Street Journal described as a swap for a Russian-German national jailed in the United States.",
    "link": "https://www.cbc.ca/news/world/russia-us-karolina-prison-release-1.7506550",
    "timestamp": "2025-04-10T10:25:43Z"
  },
  {
    "title": "‘Nobody’s ever heard of it. It’s gonna be a record’: Donald Trump is claiming victory for the stock market’s rebound",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_fe5d1914-15bb-4c96-a167-ab4f7af2ac2f",
    "timestamp": "2025-04-10T10:24:39Z"
  },
  {
    "title": "The US citizens still held in Russian prisons",
    "description": "US-Russian citizen Ksenia Karelina was on a plane back to the United States on Thursday after being released in a prisoner exchange between Moscow and Washington, her lawyer and America’s top diplomat said. She spent more than a year in Russian prison after b…",
    "link": "https://www.digitaljournal.com/news/the-us-citizens-still-held-in-russian-prisons/article",
    "timestamp": "2025-04-10T10:23:23Z"
  },
  {
    "title": "The US citizens still held in Russian prisons",
    "description": "US-Russian citizen Ksenia Karelina was on a plane back to the United States on Thursday after being released in a prisoner exchange between Moscow and Washington, her lawyer and America’s top diplomat said. She spent more than a year in Russian prison after b…",
    "link": "https://www.digitaljournal.com/world/the-us-citizens-still-held-in-russian-prisons/article",
    "timestamp": "2025-04-10T10:23:23Z"
  },
  {
    "title": "Rollercoaster week for global bonds continues as 'Trump put' sparks reversals",
    "description": "\"There's a sense of relief that trade deals with the U.S. are firmly on the table,\" economists say.",
    "link": "https://www.cnbc.com/2025/04/10/rollercoaster-week-for-global-bonds-continues-as-trump-put-sparks-reversals.html",
    "timestamp": "2025-04-10T10:22:19Z"
  },
  {
    "title": "Disability rights: FG, stakeholders hail EU, decry USAID funding cut",
    "description": "The Federal Government and stakeholders, on Thursday, applauded the European Union for funding a project aimed at advocating the rights of Persons with Disability in the wake of the halt in funding by the United States Agency for International Development. Th…",
    "link": "https://punchng.com/disability-rights-fg-stakeholders-hail-eu-decry-usaid-funding-cut/",
    "timestamp": "2025-04-10T10:21:59Z"
  },
  {
    "title": "The US Citizens Still Held In Russian Prisons",
    "description": "US-Russian citizen Ksenia Karelina was on a plane back to the United States on Thursday after being released in a prisoner exchange between Moscow and Washington, her lawyer and America's top diplomat said.",
    "link": "https://www.ibtimes.com/us-citizens-still-held-russian-prisons-3769556",
    "timestamp": "2025-04-10T10:21:14Z"
  },
  {
    "title": "Ukraine says accepting curbs to its military would be red line in talks to end war",
    "description": "KYIV (Reuters) - Ukraine has told the U.S. that accepting curbs on the size of its armed forces or on its military's overall readiness would be a red line, a senior Ukrainian official said, as Donald Trump strives to negotiate an end to the war with Russia. R…",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/ukraine-says-accepting-curbs-to-its-military-would-be-red-line-in-talks-to-end-war",
    "timestamp": "2025-04-10T10:20:00Z"
  },
  {
    "title": "Boycott USA! Trump tariffs prompt backlash against US goods",
    "description": "Following Donald Trump's \"Liberation Day\" tariffs, consumers in Canada and Europe are boycotting US products, backing local initiatives through social media campaigns and store actions. This backlash includes online movements, retailers tagging European goods…",
    "link": "https://timesofindia.indiatimes.com/world/us/boycott-usa-trump-tariffs-prompt-backlash-against-us-goods/articleshow/120153881.cms",
    "timestamp": "2025-04-10T10:19:23Z"
  },
  {
    "title": "Opinion: More Factories, More Deals: How China Plans To Trump Trump",
    "description": "China is gearing up for the future. It's now developing new industrial capabilities and opening new manufacturing units to boost its exports. This poses a threat to manufacturing in the United States.",
    "link": "https://www.ndtv.com/opinion/more-factories-foreign-plants-how-china-plans-to-deal-with-trump-8132235",
    "timestamp": "2025-04-10T10:19:05Z"
  },
  {
    "title": "Trump thinks coal is the answer to powering AI technology",
    "description": "Trump has signed executive orders that will see the increase in the production of coal, which in turn will be used to power AI data centers.",
    "link": "https://www.androidheadlines.com/2025/04/trump-coal-answer-powering-ai-technology.html",
    "timestamp": "2025-04-10T10:18:31Z"
  },
  {
    "title": "Not Just Penguins On Antarctic Islands Hit By Trump Tariffs",
    "description": "A pair of sub-Antarctic volcanic islands unexpectedly hit by Donald Trump's sweeping tariffs may be the world's most inhospitable spot for international trade.",
    "link": "https://www.ibtimes.com/not-just-penguins-antarctic-islands-hit-trump-tariffs-3769555",
    "timestamp": "2025-04-10T10:18:17Z"
  },
  {
    "title": "US-Russian Ballet Dancer Ksenia Karelina Freed By Moscow: Rubio",
    "description": "US-Russian ballet dancer Ksenia Karelina, who had been detained in Russia for 12 years on treason charges, has been released and is flying to the United States, according to the top US diplomat, with her lawyer saying she was part of a prisoner exchange agree…",
    "link": "https://www.ibtimes.com/us-russian-ballet-dancer-ksenia-karelina-freed-moscow-rubio-3769552",
    "timestamp": "2025-04-10T10:18:15Z"
  },
  {
    "title": "Penang to hold roundtable on impact of US tariff",
    "description": "BUTTERWORTH: A roundtable session involving industry players, academics and state leaders in Penang will be held to discuss the new US tariff. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/10/penang-to-hold-roundtable-on-impact-of-us-tariff",
    "timestamp": "2025-04-10T10:18:00Z"
  },
  {
    "title": "US-Russian ballet dancer Ksenia Karelina freed by Moscow: Rubio",
    "description": "US-Russian ballet dancer Ksenia Karelina, who had been detained in Russia for 12 years on treason charges, has been released and is flying to the United States, according to the top US diplomat, with her lawyer saying she was part of a prisoner exchange agree…",
    "link": "https://www.digitaljournal.com/world/us-russian-ballet-dancer-ksenia-karelina-freed-by-moscow-rubio/article",
    "timestamp": "2025-04-10T10:17:19Z"
  },
  {
    "title": "Trump's NASA Nominee Jared Isaacman Tells Senate 'We Will Prioritize Sending American Astronauts to Mars'",
    "description": "Jared Isaacman, nominated by President Donald Trump to be the next NASA chief, shared his ambitious goal of sending American astronauts to Mars during his Senate confirmation hearing yesterday.\nWhat happened: Isaacman stressed on Mars as a top priority, stati…",
    "link": "https://biztoc.com/x/68f5450dfc253db9",
    "timestamp": "2025-04-10T10:16:52Z"
  },
  {
    "title": "Stock Market Today: Stocks slide as markets pause Trump tariff U-turn rally",
    "description": "U.S. equity futures retreated in early Thursday trading, while Treasury yields were steady and the dollar resumed its recent slump, as global markets continued to react to the dramatic tariff U-turn unveiled yesterday by President Donald Trump.\nThe President'…",
    "link": "https://biztoc.com/x/41f52bcd30ab994d",
    "timestamp": "2025-04-10T10:16:35Z"
  },
  {
    "title": "Sri Lanka Engages on Tariff Situation with the US",
    "description": "In a bold move to address the growing challenges faced by Sri Lanka in light of recent reciprocal tariffs imposed by the United States, President Anura Kumara Dissanayake has sent a letter to U.S. President Donald Trump. The letter, confirmed by Minister of L…",
    "link": "https://english.gossiplankanews.com/2025/04/sri-lanka-engages-on-tariff-situation.html",
    "timestamp": "2025-04-10T10:16:00Z"
  },
  {
    "title": "Grattan on Friday: Will there be leadership changes on both sides of politics next parliamentary term?",
    "description": "No matter who wins at the next election their will likely be a change of leadership in either Labor or Coalition, or both. But who is waiting in the wings?",
    "link": "https://theconversation.com/grattan-on-friday-will-there-be-leadership-changes-on-both-sides-of-politics-next-parliamentary-term-254203",
    "timestamp": "2025-04-10T10:14:50Z"
  },
  {
    "title": "Iran and Egypt hold talks centered on Gaza",
    "description": "Iran has been seeking to increase ties with Egypt after many years in which the two countries have not enjoyed warm relations.",
    "link": "https://www.jpost.com/middle-east/article-849676",
    "timestamp": "2025-04-10T10:14:11Z"
  },
  {
    "title": "Trump is already slowing global trade as companies pause orders",
    "description": "<p>US President Donald Trump may have announced a delay in some of his tariff plans, but the first signs of an economically-damaging slowdown in global trade are already emerging as companies around the world hit their own pause button on orders and he contin…",
    "link": "https://www.bangkokpost.com/business/general/3000432/trump-is-already-slowing-global-trade-as-companies-pause-orders",
    "timestamp": "2025-04-10T10:13:00Z"
  },
  {
    "title": "Inside Trump’s reversal on tariffs: from ‘be cool!’ to ‘getting yippy’",
    "description": "How the US president rolled back his tariff plan",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/04/09/us/politics/trump-tariff-pause-be-cool.html",
    "timestamp": "2025-04-10T10:12:43Z"
  },
  {
    "title": "Canada PM says Trump’s pause on tariffs a ‘welcome reprieve’",
    "description": "Canadian Prime Minister Mark Carney called US President Donald Trump’s pause on global tariffs a “welcome reprieve” and said Ottawa will begin negotiations with Washington on a new economic deal after elections.  After days of turmoil in global markets, the m…",
    "link": "https://www.digitaljournal.com/world/canada-pm-says-trumps-pause-on-tariffs-a-welcome-reprieve/article",
    "timestamp": "2025-04-10T10:12:20Z"
  },
  {
    "title": "Not just penguins on Antarctic islands hit by Trump tariffs",
    "description": "A pair of sub-Antarctic volcanic islands unexpectedly hit by Donald Trump’s sweeping tariffs may be the world’s most inhospitable spot for international trade. When Australia’s remote, uninhabited outposts were slugged with US levies, memes of their best-know…",
    "link": "https://www.digitaljournal.com/world/not-just-penguins-on-antarctic-islands-hit-by-trump-tariffs/article",
    "timestamp": "2025-04-10T10:12:20Z"
  },
  {
    "title": "Elon Musk's DOGE Role Under Increased Pressure",
    "description": "As a special government employee, Musk is under a 130-day time limit in his current role as head of the unofficial agency.",
    "link": "https://www.newsweek.com/elon-musk-doge-resignation-may-30-2057828",
    "timestamp": "2025-04-10T10:12:02Z"
  },
  {
    "title": "Iran Warns It May Expel UN Nuclear Inspectors If Threats Persist",
    "description": "Iran will consider expelling international nuclear inspectors and transferring its stocks of enriched uranium to secret locations if foreign military threats continue, a top aide to Supreme Leader Ayatollah Ali Khamenei said.",
    "link": "https://financialpost.com/pmn/business-pmn/iran-warns-it-may-expel-un-nuclear-inspectors-if-threats-persist",
    "timestamp": "2025-04-10T10:11:57Z"
  },
  {
    "title": "German experts slash growth outlook amid Trump tariffs",
    "description": "Economic institutes have dramatically cut their growth forecast for Germany this year to just 0.1%. The sombre prediction could be exacerbated by the impact of \"reciprocal\" levies — suspended for the time being.",
    "link": "https://www.dw.com/en/german-experts-slash-growth-outlook-amid-trump-tariffs/a-72196684",
    "timestamp": "2025-04-10T10:10:00Z"
  },
  {
    "title": "Asia shares jump after US stocks soared to historic gains on 90-day tariff pause",
    "description": "In energy trading, benchmark US crude fell 52 cents to $61.83 a barrel. Brent crude, the international standard, declined 70 cents to $64.78 a barrel.",
    "link": "https://www.thehindubusinessline.com/markets/asia-shares-jump-after-us-stocks-soared-to-historic-gains-on-90-day-tariff-pause/article69434813.ece",
    "timestamp": "2025-04-10T10:09:51Z"
  },
  {
    "title": "Earle-Sears, Spanberger will face off in key Virginia governor's race",
    "description": "The candidates are set for this year's Virginia gubernatorial race, a closely watched bellwether just one year after President Trump's 2024 win.",
    "link": "https://www.cbsnews.com/news/winsome-earle-sears-abigail-spanberger-virginia-governor/",
    "timestamp": "2025-04-10T10:09:33Z"
  },
  {
    "title": "Trump's fresh crackdown on press: White House announces new policy on gender pronouns",
    "description": "The White House will refuse to answer questions from reporters with preferred pronouns in email signatures. Donald Trump has issued executive orders declaring there are two sexes and barring transgender people from serving in the military and from competing i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-fresh-crackdown-on-press-white-house-to-ignore-reporters-email-who-included-pronouns-in-email-bios/articleshow/120153869.cms",
    "timestamp": "2025-04-10T10:09:30Z"
  },
  {
    "title": "Asia shares jump after U.S. stocks soar to historic gains after Trump's tariff U-turn",
    "description": "World markets soared on Thursday, with Japan’s benchmark jumping more than 9%, as investors welcomed U.S. President Donald Trump’s decision to put his sharp tariff hikes on hold for 90 days, though he excluded China from the reprieve.  In early trading, Germa…",
    "link": "https://japantoday.com/category/business/japan%27s-benchmark-nikkei-225-shoots-up-in-early-trading-gaining-more-than-2-000-points",
    "timestamp": "2025-04-10T10:09:29Z"
  },
  {
    "title": "Institutes slash German growth forecast amid Trump tariffs",
    "description": "Leading economic institutes Thursday slashed their 2025 growth forecast for the German economy to near stagnation, warning Europe's struggling top economy will face extra pain from the US tariff blitz. US President Donald Trump's tariffs on aluminium, steel a…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/institutes-slash-german-growth-forecast-amid-trump-tariffs/articleshow/120153878.cms",
    "timestamp": "2025-04-10T10:08:59Z"
  },
  {
    "title": "US, Russia meet in Istanbul for talks on embassies",
    "description": "American and Russian delegations met in Istanbul on April 10 for talks on restoring the functioning of their embassies, which drastically scaled back staffing following Moscow's invasion of Ukraine.",
    "link": "https://www.hurriyetdailynews.com/us-russia-meet-in-istanbul-for-talks-on-embassies-207899",
    "timestamp": "2025-04-10T10:07:08Z"
  },
  {
    "title": "Trump's proposed pharmaceutical tariffs could drive up costs, lead to drug shortages: Experts",
    "description": "Trump's proposed pharmaceutical tariffs could drive up costs, lead to drug shortages: Experts\nTrump said he wants to bring more drug manufacturing to the U.S.\nAt a political fundraising dinner on Tuesday night, President Donald Trump said he plans to announce…",
    "link": "https://biztoc.com/x/658ca1226ff1af6c",
    "timestamp": "2025-04-10T10:06:15Z"
  },
  {
    "title": "Is Foreign Investment Bad for Our Economy?",
    "description": "No White House in my lifetime has been a fount of economic wisdom, and the Donald Trump 2.0 version is taking its place in the Pantheon of economic illiteracy. The latest salvo came from President Trump’s so-called trade guru Peter Navarro who said the follow…",
    "link": "https://biztoc.com/x/630ac6772cb21742",
    "timestamp": "2025-04-10T10:06:08Z"
  },
  {
    "title": "Trump walked back his tariff rollout. But is the damage already done?",
    "description": "U.S. President Donald Trump offered his trading partners — and financial markets — some reprieve on Wednesday as he walked back his tariff policy.\nThe latest reciprocal tariff rates announced on April 2 were dropped to 10% for 90 days to buy time for negotiat…",
    "link": "https://biztoc.com/x/f9c93ab5457b431e",
    "timestamp": "2025-04-10T10:06:08Z"
  },
  {
    "title": "Trump reverts to China trade war",
    "description": "The News\nPresident Donald Trump doubled down on his trade war with China on Wednesday, even as he backtracked on tariffs on other countries.\nThe president said he would raise tariffs to 125% on Chinese goods, while still insisting that Beijing wants to “make …",
    "link": "https://biztoc.com/x/9364220a74eba65c",
    "timestamp": "2025-04-10T10:05:52Z"
  },
  {
    "title": "Inflation probably moderated in March, ahead of tariff-fueled price jumps",
    "description": "Tariffs have fueled worries of another recession, which President Donald Trump has declined to rule out.",
    "link": "https://biztoc.com/x/3605f900f7a0dee5",
    "timestamp": "2025-04-10T10:05:48Z"
  },
  {
    "title": "Relief in Asia as Trump Pauses Hefty Tariffs, But China Levy Hiked",
    "description": "Asian markets bounced back on Thursday after US President Donald Trump announced a three-month pause on the large tariffs he imposed on dozens of countries last week, while ramping up pressure on China.\nThe sudden turnaround, a day after hefty tariffs started…",
    "link": "https://biztoc.com/x/0a8cb845611d4be0",
    "timestamp": "2025-04-10T10:05:46Z"
  },
  {
    "title": "They assemble their products in America. They're also rattled by Trump's tariffs",
    "description": "Trump's roller-coaster trade policy has some American small businesses on edge.\nSAUL LOEB / AFP/Getty\nPresident Donald Trump says his reciprocal tariffs will cause more products to be made in America.\nSmall business owners who already make or assemble product…",
    "link": "https://biztoc.com/x/9ac076d153ba4ddf",
    "timestamp": "2025-04-10T10:05:44Z"
  },
  {
    "title": "Trump’s power to declare national emergencies is a national emergency",
    "description": "Since taking office, President Trump has declared emergencies over immigration, drug trafficking, and trade. The exit sign is seen above his head in 2020. | Saul Loeb/AFP via Getty Images\nWhen President Donald Trump announced his tariffs last week, he also de…",
    "link": "https://biztoc.com/x/1b1bf80bc9661183",
    "timestamp": "2025-04-10T10:05:41Z"
  },
  {
    "title": "Trump tariff chaos: radical uncertainty will likely make companies delay investments",
    "description": "Tariffs create uncertainty. This will slow investment, not stimulate it.",
    "link": "https://theconversation.com/trump-tariff-chaos-radical-uncertainty-will-likely-make-companies-delay-investments-254263",
    "timestamp": "2025-04-10T10:05:14Z"
  },
  {
    "title": "A global commodity sell-off is flashing warning signals for the world economy",
    "description": "\"The collapse in commodities [prices] is a circuit breaker, a sign that a global recession is afoot,\" says Marko Papic of BCA Research.",
    "link": "https://www.cnbc.com/2025/04/10/global-commodity-selloff-is-flashing-warning-signs-for-world-economy.html",
    "timestamp": "2025-04-10T10:03:08Z"
  },
  {
    "title": "Trump tariffs: Why won't countries buy US meat products?",
    "description": "International-Business News: US President Donald Trump wants other countries to import more American beef and poultry. Several countries have restricted importing these products f.",
    "link": "https://timesofindia.indiatimes.com/business/international-business/trump-tariffs-why-wont-countries-buy-us-meat-products/articleshow/120153874.cms",
    "timestamp": "2025-04-10T10:01:41Z"
  },
  {
    "title": "Americans behind DR Congo coup attempt returned to US",
    "description": "The repatriation deal was reportedly finalized during a visit to the DR Congo by US President Donald Trump’s senior advisor for Africa Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/615521-dr-congo-repatriates-jailed-americans/",
    "timestamp": "2025-04-10T10:01:33Z"
  },
  {
    "title": "Global markets surge as Trump pauses tariff hikes for 90 days",
    "description": "Global markets experienced a surge following US President Donald Trump's decision to temporarily suspend tariff increases for 90 days. Japan's Nikkei 225 index saw a significant jump, while European markets also showed strong gains. However, Chinese shares ex…",
    "link": "https://timesofindia.indiatimes.com/business/international-business/global-markets-surge-as-trump-pauses-tariff-hikes-for-90-days/articleshow/120153468.cms",
    "timestamp": "2025-04-10T10:01:32Z"
  },
  {
    "title": "Two Marvel Comics, One Ending in The Daily LITG, 10th of April 2025",
    "description": "Two Marvel Comics ending the same way in the same week was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before – as well as over the past six years. Founded sixteen years ago and…",
    "link": "https://bleedingcool.com/comics/two-marvel-comics-one-ending-in-the-daily-litg-10th-of-april-2025/",
    "timestamp": "2025-04-10T10:01:07Z"
  },
  {
    "title": "Global Shares Jump After U.S. Stocks Soared to Historic Gains When Trump Paused Most of His Tariffs",
    "description": "World markets soared on Thursday morning, with Japan’s benchmark jumping more than 9%.",
    "link": "https://time.com/7276326/global-shares-jump-us-stocks-soar-trump-pauses-most-tariffs/",
    "timestamp": "2025-04-10T10:00:56Z"
  },
  {
    "title": "William Watson: Poilievre’s Trump problem is overrated",
    "description": "William Watson: Poilievre needs to worry more Mark Carney than his own resemblance to, or his supporters' affection for, Trump. Read on",
    "link": "https://financialpost.com/opinion/william-watson-poilievres-trump-problem-is-overrated",
    "timestamp": "2025-04-10T10:00:37Z"
  },
  {
    "title": "Rattled donors, edgy MAGA: Behind Trump's 90-day pause",
    "description": "US President Donald Trump's tariff policies triggered global market turmoil, raising recession fears and straining international alliances. After initially imposing sweeping tariffs, Trump paused them for 90 days, focusing on a trade showdown with China. This…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/rattled-donors-edgy-maga-behind-trumps-90-day-pause/articleshow/120153684.cms",
    "timestamp": "2025-04-10T10:00:29Z"
  },
  {
    "title": "Trump’s Madman Act Isn’t Just for Foreign Policy Anymore",
    "description": "Trump’s madman act isn’t just for foreign policy anymore. In his first term, Trump followed the Nixonian ‘madman theory,’ encouraging foreign adversaries to fear he’d lost his marbles. Now he’s extending that strategy to every policy arena.",
    "link": "http://nymag.com/intelligencer/article/trumps-madman-act-isnt-just-for-foreign-policy-anymore.html",
    "timestamp": "2025-04-10T10:00:26Z"
  },
  {
    "title": "US ballerina Ksenia Karelina who was jailed for 12 years in Russia is freed in prisoner swap",
    "description": "Russia has freed US ballerina Ksenia Karelina more than a year after she was jailed for donating money to a charity supporting Ukraine",
    "link": "https://www.ladbible.com/news/world-news/ksenia-karelina-russia-ukraine-us-jail-freed-prison-914579-20250410",
    "timestamp": "2025-04-10T10:00:14Z"
  },
  {
    "title": "\"His Strategy All Along\": US Treasury Secretary On Trump Tariff Pause",
    "description": "US President Donald Trump paused a major part of his tariff plan after sharp declines in the stock and bond markets and growing pressure from business leaders, lawmakers and global allies.",
    "link": "https://www.ndtv.com/world-news/his-strategy-all-along-us-treasury-secretary-scott-bessent-on-donald-trump-tariff-pause-8132113",
    "timestamp": "2025-04-10T10:00:13Z"
  }
]