[
  {
    "title": "Metaplanet Boosts Bitcoin Bet With Additional $26 Million Purchase Amid Macroeconomic Turmoil",
    "description": "Metaplanet has bought an additional 3.78 billion yen ($26.3 million) worth of BTC amid the Trump administration’s flip-flopping tariff regime.",
    "link": "https://zycrypto.com/metaplanet-boosts-bitcoin-bet-with-additional-26-million-purchase-amid-macroeconomic-turmoil/",
    "timestamp": "2025-04-14T13:56:17Z"
  },
  {
    "title": "Big victory for Donald Trump? Nvidia announces $500 billion AI infra push, supercomputer production exclusively in USA",
    "description": "Nvidia has announced that it was working with partners for major infrastructure push  and produce AI supercomputers entirely in the U.S.",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-victory-for-donald-trump-nvidia-announces-500-billion-ai-infra-push-supercomputer-production-exclusively-in-usa/articleshow/120283608.cms",
    "timestamp": "2025-04-14T13:55:16Z"
  },
  {
    "title": "Michael Hudson: Return of the Robber Barons – Trump’s Inverted View of America’s Tariff History",
    "description": "Trump’s slash and burn tariff policy is to shrink government, gut regulation and sell off public assets to pay for his tax cuts on super rich",
    "link": "https://www.nakedcapitalism.com/2025/04/michael-hudson-return-of-the-robber-barons-trumps-inverted-view-of-americas-tariff-history.html",
    "timestamp": "2025-04-14T13:55:06Z"
  },
  {
    "title": "Donald Trump Hit By New Migrant Deportation Lawsuit",
    "description": "The new ACLU lawsuit relates to detainees in Colorado who say they are wrongly accused of being Venezuelan gang members.",
    "link": "https://www.newsweek.com/donald-trump-hit-new-migrant-deportation-lawsuit-2059494",
    "timestamp": "2025-04-14T13:54:24Z"
  },
  {
    "title": "Trump Ramps Up War on the Media in Dark Rant on CBS and 60 Minutes",
    "description": "Donald Trump worked himself into a frenzy after watching CBS’s 60 Minutes on Sunday, calling for the network to be penalized in a Truth Social post. \r\n“They should lose their license! Hopefully, the Federal Communications Commission (FCC), as headed by its Hi…",
    "link": "https://newrepublic.com/post/193955/trump-threat-media-cbs-60-minutes",
    "timestamp": "2025-04-14T13:51:46Z"
  },
  {
    "title": "Britain sends Ukraine second part of $3 billion war loan",
    "description": "LONDON (Reuters) - Britain sent Ukraine 752 million pounds ($990 million) to buy air defences and artillery on Monday, part of a broader $50 billion international loan programme backed by frozen Russian assets, Britain's government said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/14/britain-sends-ukraine-second-part-of-3-billion-war-loan",
    "timestamp": "2025-04-14T13:51:00Z"
  },
  {
    "title": "OPEC cuts oil demand forecast, sees growing economic uncertainty on Trump trade war",
    "description": "Crude oil futures are down about 13% since President Donald Trump announced his sweeping tariff plan on April 2.",
    "link": "https://www.cnbc.com/2025/04/14/opec-cuts-oil-demand-forecast-on-trump-trade-war.html",
    "timestamp": "2025-04-14T13:50:21Z"
  },
  {
    "title": "EXPLAINER: Understanding Trump’s tariff policy — and what it means for Nigeria",
    "description": "In a 1988 interview on The Oprah Winfrey Show, Donald Trump, then a 42-year-old real estate mogul with no formal political role, shared a vision that has shaped his presidency decades later. “I’d make our allies pay their fair share,” Trump said, accusing cou…",
    "link": "https://punchng.com/explainer-understanding-trumps-tariff-policy-and-what-it-means-for-nigeria/",
    "timestamp": "2025-04-14T13:50:16Z"
  },
  {
    "title": "Apple was on brink of crisis before Trump tariff concession",
    "description": "Apple Inc. has managed to dodge its biggest crisis since the pandemic—for the moment, at least.",
    "link": "https://techxplore.com/news/2025-04-apple-brink-crisis-trump-tariff.html",
    "timestamp": "2025-04-14T13:50:05Z"
  },
  {
    "title": "Meta resorted to 'buy-or-bury scheme' with Instagram and WhatsApp deals, former FTC Chair Lina Khan says",
    "description": "Former FTC Chair Lina Khan said Monday that Facebook's acquisitions of Instagram and WhatsApp drastically changed the social networking ecosystem.",
    "link": "https://www.cnbc.com/2025/04/14/former-ftc-chair-khan-meta-acquisitions-instagram-whatsapp.html",
    "timestamp": "2025-04-14T13:49:01Z"
  },
  {
    "title": "An overlooked effect of Trump's trade war: the weakest dollar in years",
    "description": "\"It is no longer hyperbole to say that the dollar's reserve status and broader dominant role is at least somewhat in question.\"",
    "link": "https://www.businessinsider.com/us-dollar-index-dxy-price-weakness-trump-tariffs-trade-war-2025-4",
    "timestamp": "2025-04-14T13:48:20Z"
  },
  {
    "title": "Trump meets with president of El Salvador, where U.S. deportees have been imprisoned",
    "description": "President Donald Trump meets Monday with El Salvador President Nayib Bukele, a leader praised by the administration for opening his country's notorious prison system, even as the U.S. government has been ordered to facilitate the return of a Maryland man from",
    "link": "https://www.cbc.ca/news/world/white-house-bukele-visit-trump-1.7509466",
    "timestamp": "2025-04-14T13:47:30Z"
  },
  {
    "title": "Meta antitrust trial: updates from the monopoly battle with the FTC",
    "description": "A long-awaited trial between Meta and the Federal Trade Commission kicks off on April 14th. Over about two months, DC District Court Judge James Boasberg will hear arguments about whether Facebook illegally monopolized the market for personal social networkin…",
    "link": "https://www.theverge.com/news/646809/ftc-v-meta-antitrust-monopoly-trial-instagram-whatsapp",
    "timestamp": "2025-04-14T13:46:45Z"
  },
  {
    "title": "Russia says deadly Sumy strike hit army meeting",
    "description": "<p>SUMY (UKRAINE) - Russia said Monday that its missiles hit a meeting of Ukrainian army commanders in Sumy, accusing Ukraine of using civilians as a \"human shield\" after Kyiv said the attack Sunday killed at least 34 people in one of the deadliest strikes of…",
    "link": "https://www.bangkokpost.com/world/3003074/russia-says-deadly-sumy-strike-hit-army-meeting",
    "timestamp": "2025-04-14T13:45:00Z"
  },
  {
    "title": "China, Vietnam sign agreements after Xi warns protectionism 'leads nowhere'",
    "description": "<p>HANOI - China and Vietnam signed dozens of cooperation agreements Monday, strengthening ties between the communist-run countries after Chinese leader Xi Jinping warned that protectionism \"leads nowhere\" and that a trade war would have \"no winners\".</p>",
    "link": "https://www.bangkokpost.com/world/3003069/china-vietnam-sign-agreements-after-xi-warns-protectionism-leads-nowhere",
    "timestamp": "2025-04-14T13:45:00Z"
  },
  {
    "title": "Trump says CBS should 'pay a big price' after '60 Minutes' interview with Zelenskyy",
    "description": "President Donald Trump bitterly attacked “60 Minutes” shortly after the CBS newsmagazine broadcast stories on Ukraine and Greenland",
    "link": "https://kutv.com/news/politics/president-donald-trump-volodymyr-zelenskyy-cbs-60-minutes-fcc-investigation-first-amendment",
    "timestamp": "2025-04-14T13:44:55Z"
  },
  {
    "title": "Britain sends Ukraine second part of $3 billion war loan",
    "description": "Britain has disbursed £752 million to Ukraine for air defenses and artillery, part of a larger international loan program backed by frozen Russian assets. This payment is the second of three installments totaling £2.26 billion, with the final payment schedule…",
    "link": "https://economictimes.indiatimes.com/news/defence/britain-sends-ukraine-second-part-of-3-billion-war-loan/articleshow/120283483.cms",
    "timestamp": "2025-04-14T13:44:23Z"
  },
  {
    "title": "Marco Rubio on First Amendment and visa holders: Are international students and workers at risk of deportation for pro-Palestine protests in the U.S. under new crackdown rules?",
    "description": "Marco Rubio warns US visa holders amid growing pro-Palestine protests, stating they can't use the First Amendment to support actions tied to foreign terrorist groups. In his Fox News op-ed, he emphasized that visas are a privilege, not a right. New federal ru…",
    "link": "https://economictimes.indiatimes.com/news/international/us/marco-rubio-on-first-amendment-and-visa-holders-are-international-students-and-workers-at-risk-of-deportation-for-pro-palestine-protests-in-the-u-s-under-new-crackdown-rules/articleshow/120283389.cms",
    "timestamp": "2025-04-14T13:43:19Z"
  },
  {
    "title": "Is the Trump family selling Ethereum after suffering heavy losses? Here's what reports say",
    "description": "Eric Trump suggested buying Ethereum in February. Ethereum's value has since decreased. A company linked to the Trump family, World Liberty Financial, reportedly sold a large amount of its Ethereum holdings. The sale occurred at a significant loss. The crypto…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-the-trump-family-selling-ethereum-after-suffering-heavy-losses-heres-what-reports-say/articleshow/120282886.cms",
    "timestamp": "2025-04-14T13:43:00Z"
  },
  {
    "title": "China Spills The Tea on U.S. Luxury Goods on Tiktok and the Internet Loses It",
    "description": "Things in the U.S. vs China tariff war have just reached a new height and this time—popular luxury goods are at the center of it. And when we tell you why, you’ll understand why folks on the internet are absolutely living for it!Read more...",
    "link": "https://www.theroot.com/china-spills-on-tea-on-u-s-luxury-goods-on-tiktok-and-1851776028",
    "timestamp": "2025-04-14T13:42:00Z"
  },
  {
    "title": "Stock index futures gain after Trump exempts tech from reciprocal tariffs (INDU:null)",
    "description": "Wall Street rode high on Monday, as President Donald Trump announced temporary tariff exemptions on smartphones, computers, and other electronics primarily imported from China.\nEarly on and the S&P 500 (SP500) was +1.6%, the Nasdaq Composite (\nWall Street rod…",
    "link": "https://biztoc.com/x/1854c4c198caa342",
    "timestamp": "2025-04-14T13:41:44Z"
  },
  {
    "title": "‘The sky won’t fall’: China plays down Trump tariff risks as stock markets rally",
    "description": "China has played down the risk of damage to its exports from Donald Trump’s tariffs, with an official saying the “the sky won’t fall”, as stock markets rose on Monday amid signs of a retreat on electronics restrictions.\nThe world’s second-largest economy has …",
    "link": "https://biztoc.com/x/9aba7b2f8b46704a",
    "timestamp": "2025-04-14T13:41:32Z"
  },
  {
    "title": "Whiplash",
    "description": "Trump's exceptions keep getting reversed: President Donald Trump just can't make up his mind about which Chinese products will have tariffs applied to them upon crossing our borders. \nAll last week, Trump and Chinese President Xi Jinping engaged in a tit-for-…",
    "link": "https://biztoc.com/x/876ef88e591a8867",
    "timestamp": "2025-04-14T13:41:30Z"
  },
  {
    "title": "US opens higher, Nasdaq 100 up 2.2%, Dow up 500 pts",
    "description": "Major stock markets in the United States opened higher on Monday, supported by fresh trade developments and major corporate announcements. President Donald Trump temporarily excluded smartphones and s...",
    "link": "https://biztoc.com/x/06e9b246efd3b9a1",
    "timestamp": "2025-04-14T13:41:29Z"
  },
  {
    "title": "Taiwan President: 1st Phase of US Tariff Talks 'Smooth'",
    "description": "Taiwan's first phase of tariff talks with the United States went \"smoothly\" and the government hopes to take this challenge as an opportunity to promote a new Taiwan-plus-the-United States layout for trade, President Lai Ching-te said Monday.Major semiconduct…",
    "link": "https://freerepublic.com/focus/f-news/4310917/posts",
    "timestamp": "2025-04-14T13:41:25Z"
  },
  {
    "title": "Democrats launch Operation Anti-King to impeach and remove Donald Trump from office and they are slowly getting there",
    "description": "Democrats are intensifying calls for Donald Trump's impeachment, fueled by the grassroots \"Operation Anti-King\" movement. Legislators like Al Green and Ilhan Omar accuse Trump of authoritarianism and constitutional violations. They cite actions like usurping …",
    "link": "https://economictimes.indiatimes.com/news/international/us/democrats-launch-operation-anti-king-to-impeach-and-remove-donald-trump-from-office-and-they-are-slowly-getting-there/articleshow/120283106.cms",
    "timestamp": "2025-04-14T13:40:52Z"
  },
  {
    "title": "US stock markets rise on Trump tariff rollback",
    "description": "The US president exempts some Chinese goods such as smartphones from levies but says it is temporary.",
    "link": "https://www.bbc.com/news/articles/cy70yxdn8z6o",
    "timestamp": "2025-04-14T13:40:51Z"
  },
  {
    "title": "Donald Trump May Impose Martial Law-Type Order On April 20. What We Know",
    "description": "One of the first executive orders that Donald Trump signed as US President on January 20 was to declare a &quot;national emergency&quot; along US&#039; southern border. That order had a rider to it - that President Trump might &quot;invoke the Insurrection Ac…",
    "link": "https://www.ndtv.com/world-news/donald-trump-may-impose-martial-law-type-order-on-april-20-what-we-know-8162828",
    "timestamp": "2025-04-14T13:40:40Z"
  },
  {
    "title": "Trump Silent Day After Arsonist With Grudge Against Democrats Attacks Pennsylvania Governor",
    "description": "President Donald Trump has not addressed the attempt to ignite the residence of Pennsylvania Governor Josh Shapiro",
    "link": "https://www.ibtimes.com/trump-silent-day-after-arsonist-grudge-against-democrats-attacks-pennsylvania-governor-3770003",
    "timestamp": "2025-04-14T13:40:35Z"
  },
  {
    "title": "Chaos, confusion and reversals: The story of Trump's second term so far (Peter Nicholas/NBC News)",
    "description": "Peter Nicholas / NBC News:\nChaos, confusion and reversals: The story of Trump's second term so far  —  President Donald Trump has moved quickly on his far-reaching agenda, but his administration has frequently changed both its messaging and its course.  —  WA…",
    "link": "https://www.memeorandum.com/250414/p29",
    "timestamp": "2025-04-14T13:40:01Z"
  },
  {
    "title": "The hidden rare earth metals behind missiles: How China is weaponising the world’s supply chains",
    "description": "Donald Trump’s soaring tariffs on China have sparked a critical minerals standoff, with Beijing striking back by restricting exports of rare earth elements vital to America’s defence and tech industries. While Trump champions a self-reliant minerals policy, C…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/rare-earth-minerals-the-hidden-metals-behind-missiles-how-china-is-weaponising-the-worlds-supply-chains/articleshow/120282974.cms",
    "timestamp": "2025-04-14T13:39:48Z"
  },
  {
    "title": "The hidden metals behind missiles: How China is weaponising the world’s supply chains",
    "description": "Donald Trump’s soaring tariffs on China have sparked a critical minerals standoff, with Beijing striking back by restricting exports of rare earth elements vital to America’s defence and tech industries. While Trump champions a self-reliant minerals policy, C…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/rare-earth-minerals-the-hidden-metals-behind-missiles-how-china-is-weaponising-the-worlds-supply-chains/articleshow/120283401.cms",
    "timestamp": "2025-04-14T13:39:48Z"
  },
  {
    "title": "Iranian foreign minister to visit Moscow ahead of second Iran-US meeting",
    "description": "Tehran has approached the talks warily, doubting the likelihood of an agreement and suspicious of Trump, who has threatened to bomb Iran if there is no deal.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-850092",
    "timestamp": "2025-04-14T13:37:59Z"
  },
  {
    "title": "60 Minutes Targeted Again by Trump Over Zelensky/Ukraine, Greenland",
    "description": "Despite reports last week that both sides had agreed to a mediator to settle the $20B lawsuit aimed at the media company and the long-running network newsmagazine over its 2024 interview with VP Kamala Harris, POtuS Donald Trump is back on the social media wa…",
    "link": "https://bleedingcool.com/tv/60-minutes-targeted-again-by-trump-over-zelensky-ukraine-greenland/",
    "timestamp": "2025-04-14T13:37:08Z"
  },
  {
    "title": "Apple Takes Top Spot for First-Quarter Smartphone Sales, Data Shows",
    "description": "Apple took the top spot for global smartphone sales in the first quarter on the back of the iPhone 16e's launch. The International Data Corporation, which tracks mobile phone shipments, said global shipments rose 1.5 percent in the first quarter, with Apple r…",
    "link": "https://www.gadgets360.com/mobiles/news/apple-top-spot-first-quarter-smartphone-sales-8162790",
    "timestamp": "2025-04-14T13:36:41Z"
  },
  {
    "title": "Democrat-sponsored bill seeks ethics checks on special government employees like Elon Musk (Reuters)",
    "description": "Reuters:\nDemocrat-sponsored bill seeks ethics checks on special government employees like Elon Musk  —  The bill addresses concerns spurred by Elon Musk's government influence.  —  President Donald Trump attends the Ultimate Fighting Championship with Elon Mu…",
    "link": "https://www.memeorandum.com/250414/p28",
    "timestamp": "2025-04-14T13:35:01Z"
  },
  {
    "title": "Map Shows Where Semiconductors Are Made Around the World",
    "description": "Donald Trump said over the weekend that he was planning to reveal a tariff rate on imported semiconductors this week.",
    "link": "https://www.newsweek.com/map-semiconductors-world-donald-trump-tariffs-2059366",
    "timestamp": "2025-04-14T13:34:44Z"
  },
  {
    "title": "AAPL opens market at highest price since Trump tariff bombshell",
    "description": "Apple opened trading on Monday, April 14, 2025, at its highest price since President Donald Trump first announced tariffs — despite White House officials warning that exemptions are temporary.Apple shares continue to rise on news of a tariff exemptionAfter a …",
    "link": "https://appleinsider.com/articles/25/04/14/aapl-opens-market-at-highest-price-since-trump-tariff-bombshell",
    "timestamp": "2025-04-14T13:34:22Z"
  },
  {
    "title": "Whiplash",
    "description": "Plus: Rat buffet, critiquing the abundance agenda, arson at the Pennsylvania governor's mansion, and more...",
    "link": "https://reason.com/2025/04/14/whiplash/",
    "timestamp": "2025-04-14T13:32:46Z"
  },
  {
    "title": "ASEAN Should Expand to Counter Trump’s Tariffs",
    "description": "When it comes to international relations, there is often strength in numbers. That is why ASEAN must use the 90-day pause on US President Donald Trump’s punishingly high tariffs to develop a unified position and broaden its membership by admitting Timor-Leste…",
    "link": "https://www.project-syndicate.org/commentary/asean-should-admit-timor-leste-sri-lanka-to-counter-trump-tariffs-by-r-m-manivannan-2025-04",
    "timestamp": "2025-04-14T13:32:20Z"
  },
  {
    "title": "Dogecoin Whales Fail To Move As HTF Support Forms, What’s Next From Here?",
    "description": "Dogecoin whales have chosen to stay on the sidelines as the market uncertainty heightens. Meanwhile, DOGE’s higher timeframe has formed, which indicates that a bullish reversal could be imminent for the foremost meme coin.  Dogecoin Whales Wait On The Sidelin…",
    "link": "https://bitcoinist.com/dogecoin-whales-fail-to-move/",
    "timestamp": "2025-04-14T13:30:19Z"
  },
  {
    "title": "Tariffs on Imported Chips to be Announced Soon, Trump Says",
    "description": "US President Donald Trump has warned that he will soon announce a tariff on computer chips imported from companies overseas. But he said there would be flexibility for some companies in the sector.\nHis comments on Sunday mean that the exclusion of smartphones…",
    "link": "https://biztoc.com/x/bf105e9414a2e5c9",
    "timestamp": "2025-04-14T13:30:16Z"
  },
  {
    "title": "Taiwan's tricky balancing act",
    "description": "The island of Taiwan has long trusted in US support in the face of aggression from China. But, in the \"new, unpredictable era\" of Donald Trump upending global relationships, Taiwan finds itself looking for new security allies while \"trying to keep Trump happy…",
    "link": "https://biztoc.com/x/4af5eebad49e5edc",
    "timestamp": "2025-04-14T13:30:12Z"
  },
  {
    "title": "Apple Stock Is Surging Monday: What's Going On?",
    "description": "Apple Inc (NASDAQ:AAPL) shares are rising Monday morning after the Trump administration announced tariff exemptions for smartphones.\nWhat To Know: After markets closed on Friday, President Donald Trump exempted smartphones, computers and other electronics fro…",
    "link": "https://biztoc.com/x/97f396d6bb1fc729",
    "timestamp": "2025-04-14T13:30:03Z"
  },
  {
    "title": "Apple, SMCI, Nvidia, AMD And Other Tech Stocks Climb In Monday Pre-Market: What's Going On?",
    "description": "The shares of Apple Inc. AAPL, Super Micro Computer Inc. SMCI, NVIDIA Corp. NVDA and Advanced Micro Devices Inc. AMD climbed during the Monday pre-market trading session as the Trump administration offered a tariff reprieve to the tech industry.\nWhat Happened…",
    "link": "https://biztoc.com/x/bc5c7f56b1de99b8",
    "timestamp": "2025-04-14T13:30:01Z"
  },
  {
    "title": "Americans are ‘doom-buying’ coffee, olive oil and soap. What’s the one thing I should stockpile to avoid tariff price hikes?",
    "description": "Some purchases have echoes of the early days of the pandemic.",
    "link": "https://www.marketwatch.com/story/americans-are-doom-buying-coffee-olive-oil-and-soap-whats-the-one-thing-i-should-stockpile-to-avoid-tariff-price-hikes-12c9187c",
    "timestamp": "2025-04-14T13:30:00Z"
  },
  {
    "title": "Wisconsin teen charged in parents' deaths is accused of plotting to kill Trump",
    "description": "Nikita Casap's intentions are detailed in a three-page antisemitic manifesto praising Adolf Hitler.",
    "link": "https://madison.com/news/state-regional/crime-courts/article_7c650f4b-923d-477b-83bb-38f3175f064a.html",
    "timestamp": "2025-04-14T13:30:00Z"
  },
  {
    "title": "Bernie and AOC Are Starting a New Political Movement Before Our Eyes",
    "description": "Bernie Sanders seemed genuinely impressed by the size of his Los Angeles rally this weekend. “Unbelievable!” he declared upon reaching the microphone, “There are people half a mile away!” Moments later, he claimed 36,000 people were gathered before him, which…",
    "link": "https://newrepublic.com/article/193748/bernie-aoc-los-angeles-rally-oligarchy-trump",
    "timestamp": "2025-04-14T13:28:23Z"
  },
  {
    "title": "Apple stock pops 6% as investors bet tariffs exemptions are real",
    "description": "Apple (AAPL) shares surged over 6% in premarket trading Monday after U.S. Customs and Border Protection announced a temporary exemption for smartphones, laptops, and other electronics from President Donald Trump’s newly imposed 145% reciprocal tariffs on Chin…",
    "link": "https://qz.com/apple-market-cap-dell-tariffs-april-14-1851776027",
    "timestamp": "2025-04-14T13:26:55Z"
  },
  {
    "title": "Virgin Atlantic Expands Diversity Focus in New Global Ad Campaign",
    "description": "The diversity is still there, not least in Angelou's powerful prose, but it's also about the diverse destinations served by the airline – arguably a much safer corporate position amid intense culture wars. -Gordon Smith",
    "link": "http://skift.com/2025/04/14/virgin-atlantic-expands-diversity-focus-in-new-global-ad-campaign/",
    "timestamp": "2025-04-14T13:26:50Z"
  },
  {
    "title": "Virgin Atlantic Expands Diversity Focus in New Global Ad Campaign",
    "description": "The diversity is still there, not least in Angelou's powerful prose, but it's also about the diverse destinations served by the airline – arguably a much safer corporate position amid intense culture wars. -Gordon Smith",
    "link": "http://skift.com/2025/04/14/virgin-atlantic-shifts-diversity-focus-in-new-global-ad-campaign/",
    "timestamp": "2025-04-14T13:26:50Z"
  },
  {
    "title": "Trump Rails Against New ’60 Minutes’ Episode, Once Again Says CBS ‘Should Lose Their License’",
    "description": "\"CBS is out of control, at levels never seen before, and they should pay a big price for this,\" the president writes\nThe post Trump Rails Against New ’60 Minutes’ Episode, Once Again Says CBS ‘Should Lose Their License’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-60-minutes-interview-lawsuit-cbs-fake-news/",
    "timestamp": "2025-04-14T13:26:10Z"
  },
  {
    "title": "Why buying a Playstation 5 in UK and Europe just got more expensive",
    "description": "Sony has announced a range of price changes after US President Trump announced changes to tariffs",
    "link": "https://www.the-independent.com/tech/ps5-price-uk-europe-latest-b2732969.html",
    "timestamp": "2025-04-14T13:25:35Z"
  },
  {
    "title": "Walton Goggins praises ‘SNL’ skit that mocked ‘White Lotus’ co-star Aimee Lou Wood in wake of feud rumors",
    "description": "Walton Goggins fueled the rumors he's beefing with Aimee Lou Wood by not taking her side in the \"SNL\" drama.",
    "link": "https://nypost.com/2025/04/14/entertainment/white-lotus-star-walton-goggins-praises-snl-skit-that-mocked-aimee-lou-wood/",
    "timestamp": "2025-04-14T13:25:13Z"
  },
  {
    "title": "DOJ argues for paying reparations to 1/6 seditionists",
    "description": "This may seem like a small matter given everything else going on, but its symbolic significance is great: Jan. 6 defendants whose convictions were wiped out by President Donald Trump are entitled to a refund of restitution payments they made to cover damage t…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/doj-argues-for-paying-reparations-to-1-6-seditionists",
    "timestamp": "2025-04-14T13:25:04Z"
  },
  {
    "title": "Another Bank of Canada interest rate cut is on the way and here's what could happen",
    "description": "Amid times of economic uncertainty — an upcoming federal election and tense relations with the U.S. — Canadians are waiting for the next Bank of Canada (BoC) interest rate announcement.\r\nThe central bank has made two 0.25 per cent cuts to its key interest rat…",
    "link": "https://dailyhive.com/vancouver/boc-interest-rate-what-to-expect-april-2025",
    "timestamp": "2025-04-14T13:25:03Z"
  },
  {
    "title": "President Trump says CBS and '60 Minutes' should 'pay a big price' for going after him (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\nPresident Trump says CBS and ‘60 Minutes’ should ‘pay a big price’ for going after him  —  President Donald Trump bitterly attacked “60 Minutes” shortly after the CBS newsmagazine broadcast stories on Ukraine and Greenland on …",
    "link": "https://www.memeorandum.com/250414/p27",
    "timestamp": "2025-04-14T13:25:00Z"
  },
  {
    "title": "Investors pull $795 million from crypto ETPs, XRP continues to buck trend with inflows",
    "description": "The digital asset market faced another challenging week, with $795 million in outflows recorded across crypto investment products, according to CoinShares‘ latest weekly report. This marks the third consecutive week of declines, underlining growing caution am…",
    "link": "https://cryptoslate.com/investors-pull-795-million-from-crypto-etps-xrp-continues-to-buck-trend-with-inflows/",
    "timestamp": "2025-04-14T13:24:42Z"
  },
  {
    "title": "Trump Tariffs Spark Political Debate in Taiwan",
    "description": "The Trump administration’s tariffs have led to a great deal of apprehension in Taiwan – over not only the potential economic impact on Taiwan, but also what this means for Taiwan.-U.S. ties.",
    "link": "https://thediplomat.com/2025/04/trump-tariffs-spark-political-debate-in-taiwan/",
    "timestamp": "2025-04-14T13:24:14Z"
  },
  {
    "title": "Nvidia aims to produce AI tools worth up to $500 billion in US over four years",
    "description": "The announcement on Monday comes amid a growing push to bring manufacturing and the technology supply chain within the borders of the U.S. as Washington imposes steep tariffs on imports.",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-aims-to-produce-ai-tools-worth-up-to-500-billion-in-us-over-four-years/articleshow/120283182.cms",
    "timestamp": "2025-04-14T13:24:05Z"
  },
  {
    "title": "Aimee Lou Wood Blasts ‘SNL’ For Mocking Her Teeth In ‘Mean and …",
    "description": "Reading Time: 3 minutesAimee Lou Wood is lashing out at 'SNL' for jokes about her appearance.\nAimee Lou Wood Blasts ‘SNL’ For Mocking Her Teeth In ‘Mean and … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/04/aimee-lou-wood-blasts-snl-for-mocking-her-teeth-in-mean-and-unfunny-white-lotus-sketch/",
    "timestamp": "2025-04-14T13:23:53Z"
  },
  {
    "title": "Trump appears 'hellbent' on pushing US allies into China's arms: historian",
    "description": "With President Donald Trump’s tariff wars sending shockwaves through the world economy, a new Atlantic column\r\n written by historian Phillips Payson O'Brien surmised that the president “doesn’t care about its allies and trading partners.”The column noted the …",
    "link": "https://www.rawstory.com/trump-tariffs-2671765834/",
    "timestamp": "2025-04-14T13:22:20Z"
  },
  {
    "title": "Next Iran-US nuclear talks will be held in Rome, AP source says",
    "description": "Talks between Iran and the United States over Tehran’s rapidly advancing nuclear program appear ready for the next step.",
    "link": "https://www.bostonherald.com/2025/04/14/iran-us-nuclear-talks-rome/",
    "timestamp": "2025-04-14T13:21:40Z"
  },
  {
    "title": "Meta's Blockbuster FTC Antitrust Trial Kicks Off. Meta Stock Edges Higher After Tariff News.",
    "description": "Meta stock is already slumping as a legal battle with the FTC kicks off, where the Facebook owner will defend its Instagram acquisition.",
    "link": "https://www.investors.com/news/technology/meta-stock-facebook-ftc-trial-instagram-whatsapp/",
    "timestamp": "2025-04-14T13:21:37Z"
  },
  {
    "title": "South Africa appoints special envoy to ease US relations",
    "description": "Relations are at an all-time low - South Africa's ambassador to the US was expelled last month.",
    "link": "https://www.bbc.com/news/articles/cn7x2rnl7myo",
    "timestamp": "2025-04-14T13:20:26Z"
  },
  {
    "title": "China President Xi Jinping announces winner of Tariff war. This will not make Donald Trump happy",
    "description": "Donald Trump has paused some tariffs, he has kept in place 145 per cent duties on China, the world's second-largest economy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/china-president-xi-jinping-announces-winner-of-tariff-war-this-will-not-make-donald-trump-happy/articleshow/120283103.cms",
    "timestamp": "2025-04-14T13:20:01Z"
  },
  {
    "title": "Democrats Shouldn't Support Tariffs (Paul Krugman)",
    "description": "Paul Krugman:\nDemocrats Shouldn't Support Tariffs  —  Don't get sucked in by Trump's revenge mania  —  Donald Trump's tariffs are bad economics.  They're also bad politics.  I'm not an expert on issue polling, but public opposition to the Trump tariffs looks …",
    "link": "https://www.memeorandum.com/250414/p25",
    "timestamp": "2025-04-14T13:20:00Z"
  },
  {
    "title": "The Kleptocracy Presidency — Under Trump, conflicts of interest are just part of the system. (Anne Applebaum/The Atlantic)",
    "description": "Anne Applebaum / The Atlantic:\nThe Kleptocracy Presidency  —  Under Trump, conflicts of interest are just part of the system.  —  as the stock markets crashed on Friday, April 4, Donald Trump left Washington, D.C. He did not go to New York to consult with Wal…",
    "link": "https://www.memeorandum.com/250414/p24",
    "timestamp": "2025-04-14T13:20:00Z"
  },
  {
    "title": "The CEO of one of Thailand’s leading manufacturers says his customers are rushing to stock up during Trump’s tariff pause",
    "description": "Thailand, along with the rest of Southeast Asia, got some temporary relief when the U.S. President Donald Trump chose to delay his “Liberation Day” tariffs by 90 days. Now, the country’s U.S.-bound exports only have a 10% tariff, as opposed to the 36% threate…",
    "link": "https://biztoc.com/x/6093a73e1ea6ec22",
    "timestamp": "2025-04-14T13:19:14Z"
  },
  {
    "title": "Trump Hoping for 'Good Deals' Before 90-Day Pause Ends",
    "description": "For weeks, President Donald Trump has plowed ahead with plans to impose steep new tariffs on imports despite warnings that the policy could trigger economic chaos. On April 9, after a multiday plunge in global stock markets, he changed course.\nIn a social med…",
    "link": "https://biztoc.com/x/87422b42b7625a98",
    "timestamp": "2025-04-14T13:19:14Z"
  },
  {
    "title": "Trump Called Out by Reporter on Air Force One for Saying Russia Attack Was ‘Mistake’: ‘Was It Unintentional?’",
    "description": "A reporter on Air Force One called Trump out for calling Russia's \"Palm Sunday Attack\" on Ukraine a \"mistake,\" asking if the attack was \"unintentional?\"\nThe post Trump Called Out by Reporter on Air Force One for Saying Russia Attack Was ‘Mistake’: ‘Was It Uni…",
    "link": "https://www.mediaite.com/news/trump-called-out-by-reporter-on-air-force-one-for-saying-russia-attack-was-mistake-was-it-unintentional/",
    "timestamp": "2025-04-14T13:18:09Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump Skin Cancer Scare — How President's Latest Medical Report Reveals Potentially Deadly Lesions on His Body",
    "description": "Donald Trump has suffered a skin cancer scare following his latest medical report after doctors found \"benign lesions\" sparked by longterm sun exposure.",
    "link": "https://radaronline.com/p/donald-trump-skin-cancer-scare-medical-report/",
    "timestamp": "2025-04-14T13:17:56Z"
  },
  {
    "title": "Taiwan's tricky balancing act",
    "description": "The island nation, no longer certain of US backing against a hostile China, is quietly looking for other solutions",
    "link": "https://theweek.com/politics/taiwans-tricky-balancing-act",
    "timestamp": "2025-04-14T13:17:56Z"
  },
  {
    "title": "Canada's LNG industry poised to take flight as interest reignites in Alaska megaproject",
    "description": "Hundreds of kilometres up the Pacific coast from where Canada’s first liquefied natural gas export terminal is set to start up this summer, a monster lays dormant.",
    "link": "https://www.nationalobserver.com/2025/04/14/news/canadas-lng-industry-poised-take-flight-interest-reignites-alaska-megaproject",
    "timestamp": "2025-04-14T13:17:21Z"
  },
  {
    "title": "Trump's 'frequent victories' in golf cited as evidence for his 'excellent' health; internet is not buying it",
    "description": "US President Donald Trump is fully fit to execute his duties, White House physician, Captain Sean Barbabella wrote in a memo which was released by the White House on Sunday. The memo also mentioned that Trump stands 75 inches tall and weighs 224 pounds, indic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-frequent-victories-in-golf-cited-as-evidence-for-his-excellent-health-internet-is-not-buying-it/articleshow/120283021.cms",
    "timestamp": "2025-04-14T13:15:48Z"
  },
  {
    "title": "Russia Says Deadly Sumy Strike Hit Army Meeting",
    "description": "Russia said Monday that its missiles hit a meeting of Ukrainian army commanders in Sumy, accusing Ukraine of using civilians as a \"human shield\" after Kyiv said the attack Sunday killed at least 34 people in one of the deadliest strikes of the entire war.",
    "link": "https://www.ibtimes.com.au/russia-says-deadly-sumy-strike-hit-army-meeting-1857868",
    "timestamp": "2025-04-14T13:15:13Z"
  },
  {
    "title": "Russia Says Deadly Sumy Strike Hit Army Meeting",
    "description": "Russia said Monday that its missiles hit a meeting of Ukrainian army commanders in Sumy, accusing Ukraine of using civilians as a \"human shield\" after Kyiv said the attack Sunday killed at least 34 people in one of the deadliest strikes of the entire war.",
    "link": "https://www.ibtimes.com/russia-says-deadly-sumy-strike-hit-army-meeting-3770001",
    "timestamp": "2025-04-14T13:15:09Z"
  },
  {
    "title": "Andy Cohen Left Speechless After ‘Hacks’ Star Mark Indelicato Says He Wants Trump Supporter Siggy Flicker Back On ‘RHONJ’: “Diabolical”",
    "description": "\"I did a fun one there.\"",
    "link": "https://decider.com/2025/04/14/andy-cohen-speechless-hacks-mark-indelicato-wants-trump-supporter-siggy-flicker-rhonj/",
    "timestamp": "2025-04-14T13:15:06Z"
  },
  {
    "title": "Slopworld 2035: The dangers of mediocre AI",
    "description": "None of this article was written with AI assistance. …",
    "link": "https://www.lesswrong.com/posts/6NdLozfvbHrcDpADE/slopworld-2035-the-dangers-of-mediocre-ai",
    "timestamp": "2025-04-14T13:14:08Z"
  },
  {
    "title": "Trump Gives Supreme Court Middle Finger on Mistakenly Deported Man",
    "description": "Donald Trump’s administration has a new excuse for violating an order from the Supreme Court to return a man wrongly deported to a notorious prison in El Salvador. \r\nIn a seven-page filing Sunday, lawyers for the Department of Justice argued that the federal …",
    "link": "https://newrepublic.com/post/193952/donald-trump-supreme-court-middle-finger-ice-deportation",
    "timestamp": "2025-04-14T13:13:36Z"
  },
  {
    "title": "Japan Would Be Crazy To Kiss Trump’s ‘A—’ Amid Tariff Turmoil",
    "description": "As if Japanese leader Shigeru Ishiba’s 2025 wasn’t challenging enough, he now must “negotiate” a trade deal with Donald Trump.",
    "link": "https://www.forbes.com/sites/williampesek/2025/04/14/japan-would-be-crazy-to-kiss-trumps-a--amid-tariff-turmoil/",
    "timestamp": "2025-04-14T13:13:05Z"
  },
  {
    "title": "‘Everybody Thinks They Understand’: Zelensky Tells Trump He Can’t Comprehend Ukraine War Until He Visits",
    "description": "President Volodymyr Zelensky has issued a plea to President Donald Trump to personally visit Ukraine and see the impact of the war himself, claiming that others simply can’t understand what’s happening without witnessing it first-hand. Ukraine’s President Zel…",
    "link": "https://freerepublic.com/focus/f-news/4310908/posts",
    "timestamp": "2025-04-14T13:13:03Z"
  },
  {
    "title": "UK retailers warn of Chinese 'dumping' amid tariffs, call for end to tax loophole",
    "description": "British retailers have warned that Chinese companies risk flooding the U.K. with low cost goods amid U.S. President Donald Trump's tariffs.",
    "link": "https://www.cnbc.com/2025/04/14/uk-retailers-warn-of-chinese-dumping-amid-tariffs-call-for-end-to-tax-loophole.html",
    "timestamp": "2025-04-14T13:12:42Z"
  },
  {
    "title": "Risk of failure looms large as GOP starts drafting the 'big, beautiful bill' (Politico)",
    "description": "Politico:\nRisk of failure looms large as GOP starts drafting the ‘big, beautiful bill’  —  Republicans are hoping that speed and a push from Donald Trump can keep their legislative agenda afloat.  —  They know it's going to be big.  They want it to be beautif…",
    "link": "https://www.memeorandum.com/250414/p21",
    "timestamp": "2025-04-14T13:10:02Z"
  },
  {
    "title": "China’s March Exports Jump in Temporary Boost as Trump 2.0 Heaps Pressure",
    "description": "China's exports rose sharply in March after factories rushed out shipments before the latest U.S. tariffs took effect, but an escalating Sino-U.S. trade war has darkened the outlook for factories and growth in the world's second-biggest economy.",
    "link": "https://gcaptain.com/chinas-march-exports-jump-in-temporary-boost-as-trump-2-0-heaps-pressure/",
    "timestamp": "2025-04-14T13:08:56Z"
  },
  {
    "title": "Is Taiwan Semiconductor Manufacturing (TSM) the Top Stock in Ken Griffin’s Portfolio to Buy According to Analysts?",
    "description": "We recently published a list of Top 10 Stocks in Ken Griffin’s Portfolio to Buy According to Analysts. In this article, we are going to take a look at where ...",
    "link": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-tsm-top-130818655.html",
    "timestamp": "2025-04-14T13:08:18Z"
  },
  {
    "title": "'They're embarrassed': Morning Joe guest reveals GOP secretly humiliated by Trump",
    "description": "Republicans, and particularly legacy Republicans, secretly hate what their own party has become under President Donald Trump, Politico's Jonathan Martin told a panel on MSNBC's \"Morning Joe\" on Monday — but their options for doing anything about it have basic…",
    "link": "https://www.rawstory.com/republicans-embarrassed/",
    "timestamp": "2025-04-14T13:06:51Z"
  },
  {
    "title": "Trump's trade war is eroding US billionaires' fortunes — while China's are getting even richer",
    "description": "Nine of the 20 biggest wealth gainers this year are Chinese, while 15 of the biggest losers are from the US, signaling a sea change in market sentiment.",
    "link": "https://www.businessinsider.com/billionaire-rich-list-wealth-trump-tariffs-china-stocks-trade-musk-2025-4",
    "timestamp": "2025-04-14T13:06:43Z"
  },
  {
    "title": "Saudi Arabia plans to pay off Syria's World Bank debts, sources say",
    "description": "Saudi Arabia is reportedly planning to settle Syria's $15 million debt to the World Bank, potentially unlocking millions in grants for Syrian reconstruction and public sector support. This marks the first known instance of Saudi financing for Syria since Bash…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/saudi-arabia-plans-to-pay-off-syrias-world-bank-debts-sources-say/articleshow/120282887.cms",
    "timestamp": "2025-04-14T13:06:40Z"
  },
  {
    "title": "Billionaire Ray Dalio is worried Trump’s tariff war could spark ‘something worse’ than a recession | CNN Business",
    "description": "Ray Dalio, billionaire investor and founder of one of the world’s largest hedge funds, warned that US President Donald Trump’s tariff war has put the country near a recession and said he’s worried “something worse” than a recession could come.",
    "link": "https://www.cnn.com/2025/04/14/business/ray-dalio-recession-trump-tariffs-intl/index.html",
    "timestamp": "2025-04-14T13:06:13Z"
  },
  {
    "title": "Emmanuel Macron and the push for a Palestinian Arab state",
    "description": "Israelis and the world know how to identify Jew-haters, and that the Jews are already collectively hated behind the term coined by Wilhelm Marr in 1879, antisemites. And they know Emmanuel Macron. Opinion.",
    "link": "https://www.israelnationalnews.com/news/406820",
    "timestamp": "2025-04-14T13:05:57Z"
  },
  {
    "title": "Iran's Supreme Leader Tells Military to Stay Alert Despite US Talks",
    "description": "A day after the US-Iran talks in Oman, Ayatollah Ali Khamenei urged Iranian military leaders to stay vigilant.",
    "link": "https://www.newsweek.com/iran-supreme-leader-military-us-nuclear-2059462",
    "timestamp": "2025-04-14T13:05:52Z"
  },
  {
    "title": "Kevin Hassett Responds to White House Insider Trading Fears",
    "description": "Democrats are pushing for an investigation into the potential for insider trading after the dramatic swings in the stock markets.",
    "link": "https://www.newsweek.com/kevin-hassett-responds-white-house-insider-trading-fears-2059475",
    "timestamp": "2025-04-14T13:04:52Z"
  },
  {
    "title": "Trump’s Tangled Tariffs Sow Confusion as Negotiators Line Up",
    "description": "President Donald Trump’s tariff exclusions for smartphones and other tech products have added to a growing set of confusing signals for companies and trading partners digesting how to engage a White House still promising to negotiate dozens of new deals in Am…",
    "link": "https://gcaptain.com/trumps-tangled-tariffs-sow-confusion-as-negotiators-line-up/",
    "timestamp": "2025-04-14T13:03:27Z"
  },
  {
    "title": "Apple Escapes Catastrophe as Trump Tariff Reprieve Saves Core Products from 125% Levy",
    "description": "The exemption applies to iPhones, iPads, Macs, Apple Watches, and AirTags, which are predominantly assembled in China.",
    "link": "https://finance.yahoo.com/news/apple-escapes-catastrophe-trump-tariff-130311755.html",
    "timestamp": "2025-04-14T13:03:11Z"
  },
  {
    "title": "Donald Trump’s promises fall flat as egg prices break records for third straight month, leaving Americans shell-shocked",
    "description": "Despite falling wholesale prices and no bird flu outbreaks, American consumers are facing record-high egg prices for the third consecutive month, reaching $6.23 a dozen in March. While egg producers are making substantial profits and receiving federal compens…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-promises-fall-flat-as-egg-prices-break-records-for-third-straight-month-leaving-americans-shell-shocked/articleshow/120281661.cms",
    "timestamp": "2025-04-14T13:01:06Z"
  },
  {
    "title": "The White House swapped Obama’s portrait with a bad ‘painting’ of Trump",
    "description": "Here’s a bit of tradition I didn’t know about art in the White House: the two most recent presidential portraits are typically displayed in the Grand Foyer. Up until Friday, the two portraits hanging in that designated spot were of Obama and Bush; Biden’s off…",
    "link": "https://www.celebitchy.com/917885/the_white_house_replaced_obamas_portrait_with_a_painting/",
    "timestamp": "2025-04-14T13:00:34Z"
  },
  {
    "title": "EXCLUSIVE: Proud Boys’ Zach Rehl and Joe Biggs Speak Out After Trump Pardons — U.S. Government Continues to Persecute These Veterans Despite Their Release by President Trump (VIDEO)",
    "description": "In an exclusive interview, Zach Rehl and Joe Biggs reveal the stark realities of life after prison, highlighting government overreach and the urgent struggle for justice faced by veterans. Their gripping accounts are a must-watch.\nThe post EXCLUSIVE: Proud Bo…",
    "link": "https://www.thegatewaypundit.com/2025/04/exclusive-interview-zach-rehl-joe-biggs-post-prison/",
    "timestamp": "2025-04-14T13:00:22Z"
  }
]