[
  {
    "title": "What They Are Saying: President Trump Stops Radical Environmentalism to Generate Power for the Columbia River Basin",
    "description": "President Donald J. Trump took bold action to revoke the Biden Administration’s “Restoring Healthy and Abundant Salmon, Steelhead, and Other Native Fish Populations in the Columbia River Basin” Memorandum, which would have eliminated secure and reliable energ…",
    "link": "https://freerepublic.com/focus/f-news/4324152/posts",
    "timestamp": "2025-06-20T01:21:52Z"
  },
  {
    "title": "Americans irritated by Zelensky’s top aide – Politico",
    "description": "A growing number of American officials are expressing deep frustration with Vladimir Zelensky’s powerful chief of staff, Andrey Yermak Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/619905-americans-irritated-yermak/",
    "timestamp": "2025-06-20T01:21:47Z"
  },
  {
    "title": "ICYMI: Blue-Collar Wage Growth Sees Largest Increase in Nearly 60 Years Under Trump",
    "description": "In President Donald J. Trump’s first five months in office, real wages for hourly workers have seen their largest increase under any administration in nearly 60 years — and we’re just getting started with pro-growth, pro-prosperity policies that finally put A…",
    "link": "https://freerepublic.com/focus/f-news/4324151/posts",
    "timestamp": "2025-06-20T01:19:49Z"
  },
  {
    "title": "Oil set to rise for third week on escalating Israel-Iran conflict",
    "description": "SINGAPORE (Reuters) -Oil prices were on track to rise for the third straight week despite slipping on Friday, with investors on edge as the week-old war...",
    "link": "https://finance.yahoo.com/news/oil-set-rise-third-week-011812806.html",
    "timestamp": "2025-06-20T01:18:12Z"
  },
  {
    "title": "Revealed: Trump’s stalling on decision to bomb Iran tied to one word",
    "description": "President Donald Trump is stalling on whether to join Israeli airstrikes on Iran’s nuclear program, with White House insiders telling the New York Post his hesitation stems from fears of creating “another Libya.”According to sources close to the administratio…",
    "link": "https://www.rawstory.com/trump-iran-2672403249/",
    "timestamp": "2025-06-20T01:16:54Z"
  },
  {
    "title": "President Trump Has Always Been Clear: Iran Cannot Have a Nuclear Weapon",
    "description": "President Donald J. Trump has never wavered in his stance that Iran cannot be allowed to have a nuclear weapon — a pledge he has made repeatedly, both in office and on the campaign trail.Since taking office, President Trump has clearly stated no fewer than a …",
    "link": "https://freerepublic.com/focus/f-news/4324150/posts",
    "timestamp": "2025-06-20T01:16:45Z"
  },
  {
    "title": "South Africa’s firebrand Julius Malema banned from entering UK",
    "description": "A controversial South African opposition MP, central to a row over race relations in the country, has been denied entry to the UK. The Home Office said Julius Malema had been deemed “non-conducive to the public good” and that it was “undesirable” to grant him…",
    "link": "https://thechronicle.com.gh/south-africas-firebrand-julius-malema-banned-from-entering-uk/",
    "timestamp": "2025-06-20T01:15:22Z"
  },
  {
    "title": "Report: Trump delayed Iran strike due to concerns over creating 'another Libya'",
    "description": "According to The New York Post, President Trump is delaying the decision on potential US airstrikes in Iran due to concerns about creating \"another Libya\" if the regime is toppled.",
    "link": "https://www.israelnationalnews.com/news/410341",
    "timestamp": "2025-06-20T01:08:17Z"
  },
  {
    "title": "Donald Trump appears to knock Juneteenth celebrations",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_69c74998-5dfe-4b1c-a246-2b617e77f6a7",
    "timestamp": "2025-06-20T01:07:50Z"
  },
  {
    "title": "Trump weighs military action against Iran amid mounting legal concerns",
    "description": "Trump's remarks on Iran have sparked new fears of escalation, retaliation, and long-term engagement overseas— some have also questioned their legality.",
    "link": "https://www.foxnews.com/politics/trump-weighs-military-action-against-iran-amid-mounting-legal-concerns",
    "timestamp": "2025-06-20T01:07:34Z"
  },
  {
    "title": "‘I’m Going To Jail!’",
    "description": "You may not have noticed at the time, but stand-up comedian and avid UFC fan Joey Diaz was front row at UFC 316 and someone grabbed a clip of him locked into the fight",
    "link": "https://www.mmamania.com/videos/2025/6/19/24452425/video-joey-diaz-was-tripping-balls-in-ufc-316-viral-meme-creeping-on-kayla-harrison-im-going-to-jail",
    "timestamp": "2025-06-20T01:04:24Z"
  },
  {
    "title": "US futures pare losses as Trump weighs Iran role",
    "description": "US equity futures saw moderated declines amidst President Trump's consideration of military support for Israel against Iran. Markets displayed uncertainty, with potential US involvement and energy-driven inflation posing risks. Brent crude experienced a fall,…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-futures-pare-losses-as-trump-weighs-iran-role/articleshow/121963978.cms",
    "timestamp": "2025-06-20T01:02:18Z"
  },
  {
    "title": "Loomer Threatens to Snitch on Conservatives Criticizing The Don...",
    "description": "Laura Loomer has vowed not just to screenshot any MAGA supporters criticizing President Donald Trump on social media, but to collect all the posts and...",
    "link": "https://www.thedailybeast.com/laura-loomer-threatens-to-snitch-on-conservatives-criticizing-donald-trump-in-raging-maga-civil-war/",
    "timestamp": "2025-06-20T01:01:37Z"
  },
  {
    "title": "How Trump, a self-proclaimed 'peacemaker,' embraced Israel's campaign against Iran",
    "description": "No epiphany is seen to have tipped the scales for U.S. President Donald Trump so much as a lack of diplomatic progress, a push from Israelis and hawkish ally appeals wore him down.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/politics/trump-iran-behind-scenes/",
    "timestamp": "2025-06-20T01:00:00Z"
  },
  {
    "title": "Michael Eric Dyson: Trump 'Singularly Focused on Eradicating Every Trace of Black History’",
    "description": "Vanderbilt University professor Michael Eric Dyson said Thursday on MSNBC’s “Deadline” that President Donald Trump “is singularly focused on eradicating every trace of black history in America.” Discussing Juneteenth, Dyson said, “Well, as you’ve already indi…",
    "link": "https://www.breitbart.com/clips/2025/06/19/michael-eric-dyson-trump-singularly-focused-on-eradicating-every-trace-of-black-history/",
    "timestamp": "2025-06-20T00:54:56Z"
  },
  {
    "title": "'Misread the moment': WSJ editorial board jabs MAGA faction 'losing the debate'",
    "description": "MAGA isolationists who want to keep President Donald Trump's administration out of the conflict between Israel and Iran appear to be losing that battle, and that could cause the party's base to split, the Wall Street Journal's editorial board warned Thursday.…",
    "link": "https://www.rawstory.com/trump-2672403277/",
    "timestamp": "2025-06-20T00:53:44Z"
  },
  {
    "title": "Chuck Todd Sounds Off On Trump’s Impact On American Life: ‘Unlike Anything I’ve Seen In My Lifetime’",
    "description": "Chuck Todd declared that President Donald Trump would go down in history as the most consequential American president since Franklin D. Roosevelt.\nThe post Chuck Todd Sounds Off On Trump’s Impact On American Life: ‘Unlike Anything I’ve Seen In My Lifetime’ fi…",
    "link": "https://www.mediaite.com/politics/chuck-todd-sounds-off-on-trumps-impact-on-american-life-unlike-anything-ive-seen-in-my-lifetime/",
    "timestamp": "2025-06-20T00:51:07Z"
  },
  {
    "title": "Michael Eric Dyson: Trump Envisions a 'Confederate America'",
    "description": "Vanderbilt University professor Michael Eric Dyson said Thursday on MSNBC’s “Deadline” that President Donald Trump’s vision is a “Confederate America.” Guest host Alicia Menendez said, “You had the president telling soldiers at Fort Bragg last week that he wa…",
    "link": "https://www.breitbart.com/clips/2025/06/19/michael-eric-dyson-trump-envisions-a-confederate-america/",
    "timestamp": "2025-06-20T00:50:21Z"
  },
  {
    "title": "Why Rod Stewart no longer considers Donald Trump a friend",
    "description": "Rod Stewart says that there's one particular policy decision that means he can no longer call his Florida neighbor Donald Trump a friend: 'Someone's gotta do something.'",
    "link": "https://ew.com/rod-stewart-reveals-why-he-no-longer-considers-donald-trump-a-friend-11758097",
    "timestamp": "2025-06-20T00:42:51Z"
  },
  {
    "title": "‘Have to Drop a Nuke’: Guardian’s Lowell Details His Bombshell Report On U.S. Limits In Destroying Key Iranian Site",
    "description": "“If you wanna totally eliminate the facility all the way down at 300 feet... then the assessment of DTRA is you would have to drop a nuke down there”\nThe post ‘Have to Drop a Nuke’: Guardian’s Lowell Details His Bombshell Report On U.S. Limits In Destroying K…",
    "link": "https://www.mediaite.com/media/news/have-to-drop-a-nuke-guardian-reporter-details-his-bombshell-report-on-u-s-limits-in-destroying-key-iranian-site/",
    "timestamp": "2025-06-20T00:42:16Z"
  },
  {
    "title": "Trump criticizes ‘non-working holidays’ on Juneteenth",
    "description": "President Donald Trump took to social media Thursday on Juneteenth, a federal holiday, to criticize the number of “non-working holidays” in the United States...",
    "link": "https://www.cnn.com/2025/06/19/politics/trump-non-working-holidays-juneteenth",
    "timestamp": "2025-06-20T00:41:37Z"
  },
  {
    "title": "California girl athletes to rally at sports league meeting to fight trans athlete law after track season chaos",
    "description": "Female athletes will speak out about their experiences at a protest against California's transgender athlete policies organized by the California Family Council.",
    "link": "https://www.foxnews.com/sports/girl-athletes-rally-california-sports-league-office-fight-trans-athlete-laws-after-track-season-chaos",
    "timestamp": "2025-06-20T00:38:41Z"
  },
  {
    "title": "Pentagon & US national intelligence chiefs sidelined from Iran‑Israel discussions – media",
    "description": "President Trump is reportedly relying on a small group of lower-profile aides as he weighs military intervention in the Middle East Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619904-trump-gabbard-hegseth-iran/",
    "timestamp": "2025-06-20T00:31:44Z"
  },
  {
    "title": "'Farms will vanish': Cherry farms become ghost towns amid Trump's ICE crackdown",
    "description": "Cherry growers say they're seeing a severe labor shortage amid President Donald Trump's nationwide immigration crackdown, leading to a massive shortage of berries.A grower in the Mattawa, Washington, area lost about 300 bins — each weighing at least 350 pound…",
    "link": "https://www.rawstory.com/trump-farms/",
    "timestamp": "2025-06-20T00:31:07Z"
  },
  {
    "title": "The American Game: Playing and Being Played on the Road to Nuclear War.",
    "description": "There is a good chance that very shortly the United States will overtly join its proxy Israel in attacking Iran. Only a fool would be surprised. \nThe post The American Game: Playing and Being Played on the Road to Nuclear War. appeared first on Global Researc…",
    "link": "https://www.globalresearch.ca/american-game-road-nuclear-war/5891596",
    "timestamp": "2025-06-20T00:30:23Z"
  },
  {
    "title": "Foxconn looks to set up new Tamil Nadu unit to make iPhone enclosures",
    "description": "Foxconn is planning to manufacture iPhone enclosures in India, establishing a new unit in Tamil Nadu. This move signifies Apple's strategy to diversify its supply chain and reduce reliance on China. With expansions in display module assembly and AirPods produ…",
    "link": "https://economictimes.indiatimes.com/tech/technology/foxconn-looks-to-set-up-new-tamil-nadu-unit-to-make-iphone-enclosures/articleshow/121960374.cms",
    "timestamp": "2025-06-20T00:30:00Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wmbfnews.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:26:48Z"
  },
  {
    "title": "Leavitt: Jasmine Crockett's comments on Trump supporters were 'incredibly derogatory' (Christian Datoc/Washington Examiner)",
    "description": "Christian Datoc / Washington Examiner:\nLeavitt: Jasmine Crockett's comments on Trump supporters were ‘incredibly derogatory’  —  White House press secretary Karoline Leavitt piled on Rep. Jasmine Crockett (D-TX) Thursday for recent comments the latter made ab…",
    "link": "https://www.memeorandum.com/250619/p114",
    "timestamp": "2025-06-20T00:25:09Z"
  },
  {
    "title": "US Immigration Agents Barred From LA Dodgers' Stadium: Team",
    "description": "The Los Angeles Dodgers said Thursday the club barred federal immigration agents from the team's stadium parking lot as a fresh wave of raids continued across America's second-biggest city.",
    "link": "https://www.ibtimes.com/us-immigration-agents-barred-la-dodgers-stadium-team-3776261",
    "timestamp": "2025-06-20T00:21:10Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.kold.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:21:02Z"
  },
  {
    "title": "Trump Launches Self-Branded Mobile Service in the US",
    "description": "President Donald Trump’s family is getting into the mobile phone business with a Trump-branded service that will rely on pre-existing wireless networks and hardware that is “made in America.”\nTrump’s sons, Eric Trump and Donald Trump Jr., unveiled the service…",
    "link": "https://biztoc.com/x/c751040e09b4ff62",
    "timestamp": "2025-06-20T00:17:53Z"
  },
  {
    "title": "Donald Trump Complains About 'Non-Working Holidays' On Juneteenth",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump on Truth Social posted about \"non-working holidays,\" saying that the U.S. observes \"too many\" holidays that are \"costing our country\" while not yet making any proclamation or statement o…",
    "link": "https://biztoc.com/x/eb17c50cd0cb01e1",
    "timestamp": "2025-06-20T00:17:40Z"
  },
  {
    "title": "Dodgers delay plans to help local immigrants amid California ICE raids after federal agents denied entry",
    "description": "The team said Thursday that ICE agents tried to access a stadium parking lot and were denied",
    "link": "https://www.cbssports.com/mlb/news/dodgers-delay-plans-to-help-local-immigrants-amid-california-ice-raids-after-federal-agents-denied-entry/",
    "timestamp": "2025-06-20T00:15:45Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wsaw.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:13:16Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wlox.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:11:29Z"
  },
  {
    "title": "Donald Trump’s granddaughter Kai attempts to work at Dunkin’ Donuts drive-thru: ‘So humble’",
    "description": "The 18-year-old rocked the company's colors with a bright pink tank top, orange tennis skirt, and white sneakers while working the window at the iconic donut shop.",
    "link": "https://pagesix.com/2025/06/19/celebrity-news/donald-trumps-granddaughter-kai-works-at-dunkin-donuts-drive-thru/",
    "timestamp": "2025-06-20T00:10:21Z"
  },
  {
    "title": "Donald Trump Complains About 'Non-Working Holidays' On Juneteenth",
    "description": "President Donald Trump had not yet issued any official statement or proclamation on Juneteenth when he posted on Truth Social about 'non-working holidays.'",
    "link": "https://www.newsweek.com/donald-trump-complains-working-holidays-juneteenth-2088174",
    "timestamp": "2025-06-20T00:09:16Z"
  },
  {
    "title": "Billings Skyview graduate planning to attend Harvard University in the fall",
    "description": "In the fall, Billings Skyview High School graduate Jennifer Walks will be attending Harvard University to study politics, government, and foreign policy.",
    "link": "https://www.ktvq.com/news/local-news/billings-skyview-graduate-planning-to-attend-harvard-university-in-the-fall",
    "timestamp": "2025-06-20T00:07:55Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.waff.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:05:02Z"
  },
  {
    "title": "Trans Group: SCOTUS Decision to Uphold Ban on Sex-Change Procedures for Tennessee Minors a ‘Dangerous Setback’",
    "description": "WPATH — a group that promotes sex-change drugs and surgeries for minors — lamented the Supreme Court's decision on Wednesday upholding Tennessee's law banning those experimental practices for minors.\nThe post Trans Group: SCOTUS Decision to Uphold Ban on Sex-…",
    "link": "https://www.breitbart.com/politics/2025/06/19/pro-child-sex-change-org-wpath-claims-scotus-tennessee-decision-is-dangerous-setback/",
    "timestamp": "2025-06-20T00:04:57Z"
  },
  {
    "title": "CASEY RYAN: How The Big Beautiful Bill Impacts Education",
    "description": "Republicans in Congress have spent the last several months crafting a “Big Beautiful Bill” that has a sizable proportion of President Donald Trump’s agenda that he promised on the campaign trail. While the focus is understandably on cutting taxes for the Amer…",
    "link": "https://dailycaller.com/2025/06/19/opinion-how-the-big-beautiful-bill-impacts-education-casey-ryan/",
    "timestamp": "2025-06-20T00:04:37Z"
  },
  {
    "title": "As Americans Celebrate Juneteenth, Donald Trump Complains About Too Many Federal Holidays",
    "description": "As Americans celebrated Juneteenth on Thursday, Donald Trump complained that there are too many federal holidays. Trump wrote on Truth Social, “Too many non-working holidays in America. It is costing our Country $BILLIONS OF DOLLARS to keep all of these busin…",
    "link": "http://deadline.com/2025/06/trump-juneteenth-federal-holiday-1236438131/",
    "timestamp": "2025-06-20T00:04:31Z"
  },
  {
    "title": "US judge blocks Trump plan to tie states' transportation funds to immigration enforcement",
    "description": "(Reuters) -A federal judge on Thursday blocked President Donald Trump's administration from forcing 20 Democratic-led states to cooperate with immigration...",
    "link": "https://www.yahoo.com/news/us-judge-blocks-trump-plan-000343357.html",
    "timestamp": "2025-06-20T00:03:43Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.live5news.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T00:03:28Z"
  },
  {
    "title": "UK's Lammy to meet European counterparts in Geneva to hold nuclear talks with Iran",
    "description": "LONDON:  British foreign minister David Lammy will head to Geneva on Friday for nuclear talks with Iran and European counterparts, racing to press for a diplomatic solution over Tehran’s nuclear programme, his office said on Thursday (Jun 19).",
    "link": "https://www.channelnewsasia.com/world/uk-david-lammy-met-european-counterparts-geneva-hold-nuclear-talks-iran-5193091",
    "timestamp": "2025-06-20T00:02:00Z"
  },
  {
    "title": "LIVE: Israel, Iran trade missile fire; Iran’s FM to meet European officials",
    "description": "US President Donald Trump says decision on joining Israel’s attack on Iran will be made in next two weeks.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/6/20/live-iran-israel-continue-missile-fire-irans-fm-to-meet-eu-counterparts",
    "timestamp": "2025-06-20T00:00:00Z"
  },
  {
    "title": "Victor Davis Hanson: The ‘Donald Trump Is Evil’ Routine Isn’t Going To Cut It Anymore",
    "description": "Hoover Institution fellow Victor Davis Hanson says we’re living in chaotic times: A theater-wide war in the Middle East, mass “No Kings” protests in the United States, and a hysterical reaction to President Trump’s deportation efforts. Out of all the strife, …",
    "link": "https://www.hoover.org/research/victor-davis-hanson-donald-trump-evil-routine-isnt-going-cut-it-anymore",
    "timestamp": "2025-06-20T00:00:00Z"
  },
  {
    "title": "Trump drops claim of brokering India-Pakistan peace",
    "description": "President Trump acknowledged Prime Minister Modi and Pakistan Army chief Asim Munir for de-escalating the India-Pakistan conflict, moving away from his previous claims of personal intervention. Discussions with Munir also included the Iran situation, hinting …",
    "link": "https://economictimes.indiatimes.com/news/india/trump-drops-claim-of-brokering-india-pakistan-peace/articleshow/121960910.cms",
    "timestamp": "2025-06-20T00:00:00Z"
  },
  {
    "title": "Karen Bass says if ICE raids persist, there will be ‘nobody’ left to nanny the children and mow the lawns",
    "description": "Everyone probably remembers during Donald Trump’s first presidency when Kelly Osbourne completely jammed her foot in her mouth during a segment on The View when she got a little carried away talking like a tough guy, delivering what she no doubt thought was a…",
    "link": "https://www.activistpost.com/karen-bass-says-if-ice-raids-persist-there-will-be-nobody-left-to-nanny-the-children-and-mow-the-lawns/",
    "timestamp": "2025-06-20T00:00:00Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.kfyrtv.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-19T23:58:53Z"
  },
  {
    "title": "Auto tariffs seen hiking car prices by nearly $2,000 per vehicle",
    "description": "Those higher prices will result in about 1 million fewer vehicles sold in the US over the next three years,",
    "link": "https://www.ocregister.com/2025/06/19/auto-tariffs-seen-hiking-car-prices-by-nearly-2000-per-vehicle/",
    "timestamp": "2025-06-19T23:57:56Z"
  },
  {
    "title": "‘Unique moment in MAGA history’: America’s right is split as Trump contemplates strike on Iran",
    "description": "Donald Trump's supporters have clashed over personalities before — but now the MAGA movement is facing a genuine ideological schism. \nThe post ‘Unique moment in MAGA history’: America’s right is split as Trump contemplates strike on Iran appeared first on Cri…",
    "link": "http://www.crikey.com.au/2025/06/20/donald-trump-maga-war-with-iran/",
    "timestamp": "2025-06-19T23:57:37Z"
  },
  {
    "title": "Donald Trump Marks Juneteenth By Complaining About Federal Holidays",
    "description": "Juneteenth has been a federal holiday since 2021.",
    "link": "https://www.huffpost.com/entry/donald-trump-juneteenth_n_68549821e4b0e5115b42160f",
    "timestamp": "2025-06-19T23:57:32Z"
  },
  {
    "title": "Asia stock markets today: live updates for June 20 2025",
    "description": "Investors will be keeping a close watch on Chinese markets as the Asian giant is expected to release its one-year and five-year loan prime rates for June.",
    "link": "https://www.cnbc.com/2025/06/20/asia-stock-markets-today-live-updates-for-june-20-2025.html",
    "timestamp": "2025-06-19T23:56:05Z"
  },
  {
    "title": "Iran’s rebels have lost their nerve",
    "description": "In his fortified bunker, wherever that may be, in front of an institutional beige curtain, the old man with a black turban, diaphanous gown and a pink, rather sweet face did not hide his disappointment with Donald Trump. In a televised address to the Iranian …",
    "link": "https://biztoc.com/x/97a0a037a6fd3eec",
    "timestamp": "2025-06-19T23:55:25Z"
  },
  {
    "title": "Iran talks with Europeans set for Friday; White House sees ‘substantial chance’ for renewed negotiations",
    "description": "After speculation about a U.S. strike on Iran, the White House says there's a \"substantial chance\" for renewed talks because European leaders and Iranian officials will meet Friday.",
    "link": "https://www.foxnews.com/politics/iran-talks-europeans-set-friday-white-house-sees-substantial-chance-renewed-negotiations",
    "timestamp": "2025-06-19T23:54:01Z"
  },
  {
    "title": "Republicans, Not Democrats, Have the Messaging Problem",
    "description": "While Democrats agonize over their communication skills, Republicans are discovering that Trump's campaign magic doesn't translate to the messy realities of legislating.\nThe post Republicans, Not Democrats, Have the Messaging Problem  appeared first on Washin…",
    "link": "http://washingtonmonthly.com/2025/06/19/republicans-not-democrats-have-the-messaging-problem/",
    "timestamp": "2025-06-19T23:47:51Z"
  },
  {
    "title": "Ted Cruz Trolls 'Fact-Free' Tucker Carlson With 'Objective Fact'",
    "description": "After his combative interview with Tucker Carlson went viral, Senator Ted Cruz fired back at the conservative commentator.",
    "link": "https://www.newsweek.com/ted-cruz-reacts-tucker-carlson-interview-x-thread-2088171",
    "timestamp": "2025-06-19T23:47:08Z"
  },
  {
    "title": "They won the war. America's full-flown racist regime.",
    "description": "That the Civil War's winner of U.S. political battles is the traitorous Confederacy has been long observed; the seminal work, John Egerton's 1974 The Americanization of Dixie: The Southernization of America. I've been unable to keep up with the gush of subseq…",
    "link": "https://www.pmcarpenter.com/post/they-won-the-war-america-s-full-flown-racist-regime",
    "timestamp": "2025-06-19T23:42:08Z"
  },
  {
    "title": "Iran’s Supreme Leader ‘Can No Longer Be Allowed to Exist,’ Says Israeli Defense Minister",
    "description": "Israeli Defense Minister Israel Katz declared that Iranian Supreme Leader Ali Khamenei could \"no longer be allowed to exist,\" amid Israel's conflict with Iran.\nThe post Iran’s Supreme Leader ‘Can No Longer Be Allowed to Exist,’ Says Israeli Defense Minister f…",
    "link": "https://www.mediaite.com/politics/irans-supreme-leader-can-no-longer-be-allowed-to-exist-says-israeli-defense-minister/",
    "timestamp": "2025-06-19T23:39:00Z"
  },
  {
    "title": "Yes, more and more celebrities are entering the phone business. Here’s why",
    "description": "Several big names are venturing into the market for mobile virtual network operators — or MVNOs.",
    "link": "https://www.dailynews.com/2025/06/19/celeb-phone-businesses/",
    "timestamp": "2025-06-19T23:38:56Z"
  },
  {
    "title": "Beware ‘belonging’ — the sneaky word companies use to keep up their DEI discrimination",
    "description": "For committed woke activists burrowed into countless corporations, the power to push identity politics on everyone around them with DEI policies is proving hard to give up.",
    "link": "https://nypost.com/2025/06/19/opinion/beware-belonging-the-sneaky-way-companies-hold-on-to-dei/",
    "timestamp": "2025-06-19T23:38:38Z"
  },
  {
    "title": "Watch James Carville’s Imagination Take Him To An All-New Low As He Talks About Trump And His Thumbs",
    "description": "James Carville launched into another tirade Thursday, alleging that President Donald Trump is mentally unfit and urging the media to investigate his health",
    "link": "https://dailycaller.com/2025/06/19/james-carville-trumps-mental-health/",
    "timestamp": "2025-06-19T23:36:32Z"
  },
  {
    "title": "Trump Fumes the U.S. Has ‘Too Many Non-Working Holidays’ On Juneteenth: ‘It Must Change’",
    "description": "Joe Biden campaigned on making Juneteenth a federal holiday during his 2020 presidential campaign. The day was already marked by many states across the U.S.\nThe post Trump Fumes the U.S. Has ‘Too Many Non-Working Holidays’ On Juneteenth: ‘It Must Change’ firs…",
    "link": "https://www.mediaite.com/politics/trump-fumes-the-u-s-has-too-many-non-working-holidays-on-juneteenth-it-must-change/",
    "timestamp": "2025-06-19T23:36:22Z"
  },
  {
    "title": "Frum: Trump Administration 'Collection of Jokers and Crackpots and Crooks'",
    "description": "Staff writer at The Atlantic David Frum claimed Thursday on MSNBC’s “Deadline” that President Donald Trump’s administration is a “collection of jokers and crackpots and crooks.” Frum said, “I don’t think you should compare this administration to anything else…",
    "link": "https://www.breitbart.com/clips/2025/06/19/frum-trump-administration-collection-of-jokers-and-crackpots-and-crooks/",
    "timestamp": "2025-06-19T23:35:04Z"
  },
  {
    "title": "Trump’s new two-week negotiating window sets off scramble to restart stalled Iran talks | CNN Politics",
    "description": "President Donald Trump’s decision to open a two-week negotiating window before deciding on striking Iran sets off an urgent effort to restart talks that had been deadlocked when Israel began its bombing campaign last week.",
    "link": "https://www.cnn.com/2025/06/19/politics/trump-iran-negotiations-pessimism",
    "timestamp": "2025-06-19T23:32:22Z"
  },
  {
    "title": "Trump Nominates Submariner for Chief of Naval Operations; Naval Experts (Mostly) Approve",
    "description": "\"He’s one of the few admirals who embraced public engagement to push Trump 2.0 priorities. He’s not media-shy, he’s been on Wall Street selling capital markets on capitalizing shipbuilding, appeared in several recruiting spots, and speaks directly to sailors …",
    "link": "https://legalinsurrection.com/2025/06/trump-nominates-submariner-for-chief-of-naval-operations-naval-experts-mostly-approve/",
    "timestamp": "2025-06-19T23:30:39Z"
  },
  {
    "title": "Yes, more and more celebrities are entering the phone business. Here’s why",
    "description": "Several big names are venturing into the market for mobile virtual network operators — or MVNOs.",
    "link": "https://www.bostonherald.com/2025/06/19/celeb-phone-businesses/",
    "timestamp": "2025-06-19T23:29:49Z"
  },
  {
    "title": "'Must change!' Trump rages against holidays as he snubs Juneteenth",
    "description": "President Donald Trump all but ignored the nation's celebration of Juneteenth on Thursday until taking to social media to once again bemoan that the country has \"too many non-working holidays\" and demanding a change. The New York Times noted Thursday afternoo…",
    "link": "https://www.rawstory.com/donald-trump-holiday/",
    "timestamp": "2025-06-19T23:26:56Z"
  },
  {
    "title": "US judge blocks Trump plan to tie states’ transportation funds to immigration enforcement - NewsBreak",
    "description": "A federal judge on Thursday blocked President Donald Trump's administration from forcing 20 Democratic-led states to cooperate with immigration enforcement",
    "link": "https://www.newsbreak.com/share/4060632025286-us-judge-blocks-trump-plan-to-tie-states-transportation-funds-to-immigration-enforcement?_f=app_share&amp;pd=0Gp5KleP&amp;lang=en_US&amp;send_time=1750375388&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.24.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v1%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_recall_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v7&amp;s=i2",
    "timestamp": "2025-06-19T23:23:40Z"
  },
  {
    "title": "Fat Joe Sued For $20M By Ex-Hypeman, Claims Rapper Had Sex With Minors",
    "description": "Fat Joe is being sued for $20 million by his former hypeman, who has lobbed a litany of sordid claims against the Bronx rapper. The lawsuitalleges that Joe, born Joseph Antonio Cartagena, participated in sex acts with several minors in their teens, amongst ot…",
    "link": "https://hiphopwired.com/playlist/fat-joe-sued-by-ex-hypeman-claims-sex-with-minors/",
    "timestamp": "2025-06-19T23:22:42Z"
  },
  {
    "title": "The Cyber Land of Opportunity (Bitcoin)",
    "description": "So what’s super interesting is like our parents generation, they all came to the states for better opportunities to escape religious persecution whatever. And actually… Some people went to America simply to see us silent because they were like escaping a war …",
    "link": "https://erickimphotography.com/blog/2025/06/19/the-cyber-land-of-opportunity-bitcoin/",
    "timestamp": "2025-06-19T23:21:23Z"
  },
  {
    "title": "Trump Says UK Is 'Very Well Protected Because I Like Them'",
    "description": "Prime Minister Keir Starmer reached an agreement with US President Donald Trump to implement trading terms disclosed last month to slash US tariffs on key British exports and raise UK quotas on certain American agricultural products.\nTrump and Starmer on Mond…",
    "link": "https://biztoc.com/x/078a0cc408a0eb47",
    "timestamp": "2025-06-19T23:21:15Z"
  },
  {
    "title": "‘Who Was Running the Country?’ – Witnesses Testify on Biden Health Cover-Up, Autopen Scandal (VIDEO)",
    "description": "The Senate Judiciary Committee brought in three witnesses to testify on Joe Biden’s mental and health decline on Wednesday.\nThe post ‘Who Was Running the Country?’ – Witnesses Testify on Biden Health Cover-Up, Autopen Scandal (VIDEO) appeared first on The Gat…",
    "link": "https://www.thegatewaypundit.com/2025/06/who-was-running-country-witnesses-testify-biden-health/",
    "timestamp": "2025-06-19T23:20:50Z"
  },
  {
    "title": "Eric Adams’ $1B hotel deal for migrants — whose numbers are dwindling — sure comes with stink",
    "description": "Mayor Adams signed off on a nearly $1 billion contract with the hotel industry for migrant and homeless accommodations — even as the migrant crisis abates, and they close shelters around the city.…",
    "link": "https://nypost.com/2025/06/19/opinion/eric-adams-1b-hotel-deal-for-migrants-whose-numbers-are-dwindling-sure-comes-with-stink/",
    "timestamp": "2025-06-19T23:16:01Z"
  },
  {
    "title": "Starship's 4th straight rocket explosion is the latest public setback for Musk's Mars dreams",
    "description": "SpaceX's flagship Starship model suffered its fourth explosion this year. NASA expects the company to put astronauts on the moon by 2027.",
    "link": "https://www.businessinsider.com/spacex-starship-multiple-explosion-setback-2025-6",
    "timestamp": "2025-06-19T23:11:43Z"
  },
  {
    "title": "Trump is relying on a small circle of advisers as he weighs Iran strikes",
    "description": "While Trump often crowdsources from an array of allies, he has tended to make many decisions with just a handful of administration officials.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-relying-small-circle-advisers-weighs-iran-strikes-rcna214010",
    "timestamp": "2025-06-19T23:11:34Z"
  },
  {
    "title": "On Iran, (most) Democrats have gone underground",
    "description": "'It's about not giving Trump credit for anything, including accomplishing an objective they supported'",
    "link": "https://www.wnd.com/2025/06/iran-most-democrats-have-gone-underground/",
    "timestamp": "2025-06-19T23:11:10Z"
  },
  {
    "title": "Federal judge halts Trump's plan to cut funding for sanctuary states that refuse to cooperate",
    "description": "Federal judge blocks Trump administration from denying funds to states not cooperating with immigration enforcement, ruling the policy unconstitutional.",
    "link": "https://www.foxnews.com/politics/federal-judge-halts-trumps-plan-cut-funding-sanctuary-states-refuse-cooperate",
    "timestamp": "2025-06-19T23:10:56Z"
  },
  {
    "title": "Israel’s stunning victory over Iran – and 2 big lies debunked",
    "description": "'Both have been obliterated in this show of Western muscle against the radical regime'",
    "link": "https://www.wnd.com/2025/06/israels-stunning-victory-iran-2-big-lies-debunked/",
    "timestamp": "2025-06-19T23:09:51Z"
  },
  {
    "title": "Donald Trump’s thoroughly justified ICE raids",
    "description": "President wants the 'remigration' of illegal aliens to the places from which they came",
    "link": "https://www.wnd.com/2025/06/donald-trumps-thoroughly-justified-ice-raids/",
    "timestamp": "2025-06-19T23:07:39Z"
  },
  {
    "title": "Israel-Iran air war enters second week as Europe pushes diplomacy",
    "description": "The role of the United States remains uncertain. The White House said on Thursday President Trump would decide in the next two weeks whether to get involved in the war.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/iran-israel-air-war-second-week/",
    "timestamp": "2025-06-19T23:04:00Z"
  },
  {
    "title": "Iran strikes Israeli hospital as Trump eyes war decision in 'next two weeks'",
    "description": "The White House said U.S. President Donald Trump will make a decision within the next two weeks whether to get involved on Israel's side.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/iran-israel-trump-two-weeks/",
    "timestamp": "2025-06-19T23:04:00Z"
  },
  {
    "title": "Russia would react 'negatively' if Iran's leader is killed, says the Kremlin",
    "description": "Regime change in Iran is \"unacceptable\" and the assassination of the country's Supreme Leader would \"open the Pandora's box\", the Kremlin has said.",
    "link": "https://news.sky.com/story/russia-would-react-negatively-if-irans-leader-is-killed-says-the-kremlin-13385983",
    "timestamp": "2025-06-19T23:01:00Z"
  },
  {
    "title": "Diplomacy to end Israel-Iran conflict picks up pace - but what is its chance of success?",
    "description": "Diplomacy to prevent the conflict between Israel and Iran spiralling further out of control is picking up pace with the UK at its centre.",
    "link": "https://news.sky.com/story/diplomacy-to-end-israel-iran-conflict-picks-up-pace-but-what-is-its-chance-of-success-13385875",
    "timestamp": "2025-06-19T23:01:00Z"
  },
  {
    "title": "How the four tempers of Trump-era news media are hurting Australia",
    "description": "The Trump administration's masterful manipulation of the US' legacy media maligns Australian news and throws us all into the dark.\nThe post How the four tempers of Trump-era news media are hurting Australia appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/06/20/donald-trump-news-media-severance-tempers-news-corp/",
    "timestamp": "2025-06-19T22:56:17Z"
  },
  {
    "title": "US judge blocks Trump plan to tie states' transportation funds to immigration enforcement - NewsBreak",
    "description": "A federal judge on Thursday blocked President Donald Trump's administration from forcing 20 Democratic-led states to cooperate with immigration enforcement",
    "link": "https://www.newsbreak.com/share/4060632025286-us-judge-blocks-trump-plan-to-tie-states-transportation-funds-to-immigration-enforcement?s=a2&amp;share_destination_id=MTg1NDMxNjAyLTE3NTAzNzM3MDEzMjE%3D&amp;pd=0CY3EI2n&amp;hl=en_US&amp;send_time=1750373701&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.18.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v2%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_recall_exp_25q2-v6",
    "timestamp": "2025-06-19T22:55:38Z"
  },
  {
    "title": "US judge blocks Trump plan to tie states' transportation funds to immigration enforcement - NewsBreak",
    "description": "A federal judge on Thursday blocked President Donald Trump's administration from forcing 20 Democratic-led states to cooperate with immigration enforcement",
    "link": "https://www.newsbreak.com/share/4060632025286-us-judge-blocks-trump-plan-to-tie-states-transportation-funds-to-immigration-enforcement?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NTAzNzM0MTM3MjU%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1750373413&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.25.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q2-control%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q3-v1%2Cns_foryou_blend_exp_25q2-v7",
    "timestamp": "2025-06-19T22:53:25Z"
  },
  {
    "title": "US Futures Slide as Trump Considers Iran Strikes: Markets Wrap",
    "description": "US equity futures dropped on Friday as President Donald Trump weighs whether to back Israel militarily in its conflict with Iran.",
    "link": "https://financialpost.com/pmn/business-pmn/us-futures-slide-as-trump-considers-iran-strikes-markets-wrap",
    "timestamp": "2025-06-19T22:53:05Z"
  },
  {
    "title": "Archbishop of Los Angeles criticizes mass deportations: ‘Judge each case on its merits’",
    "description": "Los Angeles Archbishop José Gómez. / Credit: Daniel Ibañez/CNA\n\nWashington, D.C. Newsroom, Jun 19, 2025 / 18:53 pm (CNA).\nIn an op-ed criticizing the current U.S. administration’s mass deportation efforts and immigration raids, Los Angeles Archbishop José Góm…",
    "link": "https://www.catholicnewsagency.com/news/264883/archbishop-jose-gomez-of-los-angeles-criticizes-mass-deportations-judge-each-case-on-its-merits",
    "timestamp": "2025-06-19T22:53:00Z"
  },
  {
    "title": "Opportunity",
    "description": "So what’s super interesting is like our parents generation, they all came to the states for better opportunities to escape religious persecution whatever. And actually… Some people went to America simply to see us silent because they were like escaping a war …",
    "link": "https://erickimphotography.com/blog/2025/06/19/opportunity-3/",
    "timestamp": "2025-06-19T22:52:38Z"
  },
  {
    "title": "Middle East violence, Gaza genocide, no one safe in USA...BUT Trump 'snubs' Albo",
    "description": "Israel has started a war with Iran while continuing its onslaught in Gaza and the U.S. is turning on its own citizens, but our PM didn't get to meet the U.S. despot, so that's just",
    "link": "https://independentaustralia.net/business/business-display/middle-east-violence-gaza-genocide-no-one-safe-in-usabut-trump-snubs-albo,19853",
    "timestamp": "2025-06-19T22:51:37Z"
  },
  {
    "title": "Maura Healey talks ‘devastating’ drop in Canadian tourism heading into summer",
    "description": "\"Devastating\" drops in Canadian tourism are barreling into the hospitality and service industries this summer season, Gov. Maura Healey warned in a MSNBC segment.",
    "link": "https://www.bostonherald.com/2025/06/19/maura-healey-talks-devastating-drop-in-canadian-tourism-heading-into-summer/",
    "timestamp": "2025-06-19T22:48:37Z"
  },
  {
    "title": "Trump’s latest judicial pick was almost nominated by Biden in 2022",
    "description": "President Donald Trump says he plans to tap Chad Meredith, a former state solicitor general in Kentucky, for a federal judgeship in the state — and this time, he is facing no objections from Sen. Rand Paul, who opposed his nomination three years ago.",
    "link": "https://biztoc.com/x/fb7dabb5eb0fbd22",
    "timestamp": "2025-06-19T22:47:49Z"
  },
  {
    "title": "Rumor Trump 'replaced' Hillary Clinton's portrait in White House with his own needs closer look",
    "description": "U.S. President Donald Trump replaced a White House portrait of former first lady Hillary Rodham Clinton with a portrait of himself.",
    "link": "https://www.snopes.com//fact-check/trump-portrait-replace-hillary-clinton/",
    "timestamp": "2025-06-19T22:47:00Z"
  }
]