[
  {
    "title": "RFK Jr. links Tylenol, autism and circumcision without proof",
    "description": "Health Secretary Robert F. Kennedy, Jr., has reasserted the unproven link between the pain reliever Tylenol and autism, and suggested people who opposed the theory were motivated by hatred for President Donald Trump. During a meeting with Trump and the Cabine…",
    "link": "https://apnews.com/article/rfk-jr-tylenol-autism-circumcision-trump-f92078ebc210677dadaa0d315472742c",
    "timestamp": "2025-10-09T23:46:50Z"
  },
  {
    "title": "Starmer praises Trump over role in Gaza ceasefire deal",
    "description": "Prime Minister Sir Keir Starmer has praised US President Donald Trump's leadership in the Gaza peace talks, claiming the deal \"would not have happened\" without him. On Wednesday, Trump announced Israel and Hamas had agreed to the first phase of his 20-point p…",
    "link": "https://freerepublic.com/focus/f-news/4345373/posts",
    "timestamp": "2025-10-09T23:45:38Z"
  },
  {
    "title": "Israeli Cabinet approves ‘outline’ of deal to release all remaining hostages held by Hamas",
    "description": "A brief statement from Prime Minister Benjamin Netanyahu’s office said the Cabinet approved the “outline” of a deal to release the hostages, without mentioning other aspects of the plan that are more controversial.",
    "link": "https://www.pbs.org/newshour/world/israeli-cabinet-approves-outline-of-deal-to-release-all-remaining-hostages-held-by-hamas",
    "timestamp": "2025-10-09T23:43:13Z"
  },
  {
    "title": "Probe if ex-minister's son tried to influence witness: Supreme Court",
    "description": "India News: NEW DELHI: Supreme Court Monday directed the Uttar Pradesh police to inquire into allegations that attempts were made to influence a witness by Ashish.",
    "link": "https://timesofindia.indiatimes.com/india/probe-if-ex-ministers-son-tried-to-influence-witness-supreme-court/articleshow/124441459.cms",
    "timestamp": "2025-10-09T23:40:44Z"
  },
  {
    "title": "At 20-year mark, over 4L cases pending before info commissions across India",
    "description": "India News: NEW DELHI: With the Right To Information Act set to mark 20 years since it was implemented on Oct 12, a new report on the performance of information c.",
    "link": "https://timesofindia.indiatimes.com/india/at-20-year-mark-over-4l-cases-pending-before-info-commissions-across-india/articleshow/124441462.cms",
    "timestamp": "2025-10-09T23:40:27Z"
  },
  {
    "title": "Judge blocks National Guard deployment in Illinois for 2 weeks",
    "description": "A judge has blocked the deployment of National Guard troops in the Chicago area for two weeks, finding no substantial evidence that a “danger of rebellion” is brewing in Illinois.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_829d589f-d717-5dc9-b316-4a34500ba6b9.html",
    "timestamp": "2025-10-09T23:40:00Z"
  },
  {
    "title": "Re-evaluate PhD selection method: Government to ministries",
    "description": "India News: NEW DELHI: Government has asked ministries and central departments to re-examine the method of selection of guides for doctoral degrees (PhDs) and the.",
    "link": "https://timesofindia.indiatimes.com/india/re-evaluate-phd-selection-method-government-to-ministries/articleshow/124441456.cms",
    "timestamp": "2025-10-09T23:38:36Z"
  },
  {
    "title": "The MAGA Whisperer: Publicist Vanessa Santos Reps a Who’s Who of Conservative Voices Others Won’t Touch",
    "description": "Since Donald Trump burst onto the political scene in 2016, Hollywood and the mainstream media mostly have treated MAGA voices “like garbage,” says publicist Vanessa Santos. So in 2021, at the height of industry conservatives being sidelined or canceled over t…",
    "link": "https://freerepublic.com/focus/f-chat/4345372/posts",
    "timestamp": "2025-10-09T23:37:34Z"
  },
  {
    "title": "SC: There's no age bar for having kids or adoption, then why for surrogacy?",
    "description": "India News: NEW DELHI: Supreme Court on Thursday ruled that an age bar on aspiring parents under the surrogacy law cannot be enforced retrospectively, and those w.",
    "link": "https://timesofindia.indiatimes.com/india/sc-theres-no-age-bar-for-having-kids-or-adoption-then-why-for-surrogacy/articleshow/124441445.cms",
    "timestamp": "2025-10-09T23:36:54Z"
  },
  {
    "title": "Open Thread: Letitia James Is Indicted by Trump, Remains Uncowed",
    "description": "CNN: We have just learned that Letitia James has just been indicted by the DOJ [image or embed] — Acyn (@acyn.bsky.social) October 9, 2025 at 4:29 PM === This is nothing more than a continuation of the president’s desperate weaponization of our justice system…",
    "link": "https://balloon-juice.com/2025/10/09/open-thread-letitia-james-is-indicted-by-trump-remains-uncowed/",
    "timestamp": "2025-10-09T23:36:42Z"
  },
  {
    "title": "US is sending about 200 troops to Israel to help support and monitor the Gaza ceasefire deal",
    "description": "Officials said U.S. Central Command is going to establish a “civil-military coordination center” in Israel.",
    "link": "https://www.denverpost.com/2025/10/09/us-military-support-monitor-gaza-ceasefire/",
    "timestamp": "2025-10-09T23:36:31Z"
  },
  {
    "title": "US is sending about 200 troops to Israel to help support and monitor the Gaza ceasefire deal",
    "description": "Officials said U.S. Central Command is going to establish a “civil-military coordination center” in Israel.",
    "link": "https://www.bostonherald.com/2025/10/09/us-military-support-monitor-gaza-ceasefire/",
    "timestamp": "2025-10-09T23:36:31Z"
  },
  {
    "title": "Trump Predicts China Will Resume Buying US Soybeans",
    "description": "US President Donald Trump predicted China would resume purchases of American soybeans after meeting President Xi Jinping, though a cabinet official said federal relief for beleaguered farmers will have to wait until the government reopens.\nTrump said Thursday…",
    "link": "https://biztoc.com/x/76613985e4b66467",
    "timestamp": "2025-10-09T23:35:07Z"
  },
  {
    "title": "US judge blocks Trump's Illinois National Guard deployment",
    "description": "United States District Court Judge April Perry granted a temporary restraining order blocking US President Donald Trump from deploying National Guard troops in the state of Illinois for 14 days.Perry ...",
    "link": "https://biztoc.com/x/f5b3a28f67595d2f",
    "timestamp": "2025-10-09T23:35:05Z"
  },
  {
    "title": "Judge Blocks National Guard Deployment In Illinois For 2 Weeks",
    "description": "A judge blocked the deployment of National Guard troops in the Chicago area for two weeks, finding no substantial evidence that a “danger of rebellion” is brewing in Illinois.",
    "link": "https://www.huffpost.com/entry/national-guard-judge-blocks-illinois_n_68e84656e4b0a9f46d0cd7c2",
    "timestamp": "2025-10-09T23:35:01Z"
  },
  {
    "title": "We can’t hear you, Zohran. Pro-Hamas crowd goes quiet on Trump’s Gaza peace deal",
    "description": "It seems awfully curious that the people who have made Gazans a central political cause do not seem at all relieved that there’s at least a temporary cessation of violence.",
    "link": "https://nypost.com/2025/10/09/opinion/pro-hamas-ceasefire-crowd-goes-silent-on-trumps-peace-deal/",
    "timestamp": "2025-10-09T23:34:52Z"
  },
  {
    "title": "Businesses expect chaos if Supreme Court throws out tariffs",
    "description": "Trump has warned of disaster if the Supreme Court overturns his tariffs. For starters, it would unleash a bureaucratic nightmare involving reams of refund paper checks.",
    "link": "https://www.stltoday.com/news/nation-world/business/article_5c2f3c45-91db-5f9a-b90f-3eace78bceeb.html",
    "timestamp": "2025-10-09T23:34:51Z"
  },
  {
    "title": "The Bob Cesca Podcast: Plenary Authority",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Plenary Authority -- Government Shutdown Day 8. The Israel-Hamas deal is just the Biden deal from 10 months ago. How many people died because Donald hates Biden? Anthony Blinken's reaction. On…",
    "link": "https://littlegreenfootballs.com/article/54977_The_Bob_Cesca_Podcast-_Plenary",
    "timestamp": "2025-10-09T23:34:40Z"
  },
  {
    "title": "Cryptocurrency investor known as 'Bitcoin Jesus' reaches Deal With Prosecutors. What to expect?",
    "description": "Under the deal, which has not been filed with the court and could still change, the charges would eventually be dropped if Ver complied with the terms of the agreement.",
    "link": "https://economictimes.indiatimes.com/news/international/us/cryptocurrency-investor-known-as-bitcoin-jesus-reaches-deal-with-prosecutors-what-to-expect/articleshow/124441378.cms",
    "timestamp": "2025-10-09T23:34:33Z"
  },
  {
    "title": "Israeli cabinet ratifies ceasefire and hostage deal with Hamas",
    "description": "JERUSALEM/CAIRO:  Israel's government ratified a ceasefire with the Palestinian militant group Hamas on Friday (Oct 10), clearing the way to suspend hostilities in Gaza within 24 hours and free Israeli hostages held in Gaza within 72 hours after that.The Isra…",
    "link": "https://www.channelnewsasia.com/world/israel-cabinet-ratifies-ceasefire-hostage-deal-hamas-donald-trump-5393366",
    "timestamp": "2025-10-09T23:32:56Z"
  },
  {
    "title": "IRS to furlough 34,000 employees as U.S. shutdown drags on | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> The Internal Revenue Service will furlough more than 34,000 employees beginning on Wednesday due to the government shutdown, according to an agency statement, effectively shuttering taxpayer call centers.",
    "link": "https://www.staradvertiser.com/2025/10/09/breaking-news/irs-to-furlough-34000-employees-as-u-s-shutdown-drags-on/",
    "timestamp": "2025-10-09T23:30:35Z"
  },
  {
    "title": "DEVELOPING: After Historic Middle East Peace Agreement, 200 US Troops Stationed in Israel Will Monitor Ceasefire",
    "description": "Boots on the ground in Israel – for peace.\nThe post DEVELOPING: After Historic Middle East Peace Agreement, 200 US Troops Stationed in Israel Will Monitor Ceasefire appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/developing-after-historic-middle-east-peace-agreement-us/",
    "timestamp": "2025-10-09T23:30:15Z"
  },
  {
    "title": "‘Prioritizes paper-based transparency’: Dominion Voting Systems SOLD after settlements with several entities",
    "description": "Firm slammed over 2020 contest goes to company founded by former Republican election official",
    "link": "https://www.wnd.com/2025/10/prioritizes-paper-based-transparency-dominion-voting-systems-sold/",
    "timestamp": "2025-10-09T23:28:26Z"
  },
  {
    "title": "Rajasthan anti-conversion law comes into force",
    "description": "Rajasthan has enacted a new anti-conversion law, mandating advance notice for inter-religious weddings and imposing severe penalties for forced conversions. The legislation, which includes lengthy prison terms and substantial fines, particularly for offenses …",
    "link": "https://timesofindia.indiatimes.com/india/rajasthan-anti-conversion-law-comes-into-force/articleshow/124441417.cms",
    "timestamp": "2025-10-09T23:24:58Z"
  },
  {
    "title": "Judge Blocks Trump’s Chicago National Guard Deployment For Two Weeks",
    "description": "The judge called the Department of Homeland Security’s assessment of protests in the Chicago area “unreliable.”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/09/judge-blocks-trumps-chicago-national-guard-deployment-for-two-weeks/",
    "timestamp": "2025-10-09T23:24:57Z"
  },
  {
    "title": "Minnesota attorney general says trans athletes in girls' sports 'doesn't harm anyone' despite complaints",
    "description": "Keith Ellison downplayed the impact of transgender athletes in girls' sports after school board members urge policy changes to protect females students.",
    "link": "https://www.foxnews.com/sports/minnesota-attorney-general-says-trans-athletes-girls-sports-doesnt-harm-anyone",
    "timestamp": "2025-10-09T23:24:41Z"
  },
  {
    "title": "Roger Ver and DOJ reach tentative $48M tax settlement deal",
    "description": "Early Bitcoin investor and Bitcoin Cash co-founder Roger Ver has reached a tentative settlement with the U.S. Department of Justice over criminal tax charges tied to an alleged $48 million loss to the government, The New York Times reported on Oct. 9. Ver was…",
    "link": "https://cryptoslate.com/roger-ver-and-doj-reach-tentative-48m-tax-settlement-deal/",
    "timestamp": "2025-10-09T23:21:35Z"
  },
  {
    "title": "Health Secretary Kennedy, Trump link circumcision to autism through Tylenol - NewsBreak",
    "description": "WASHINGTON – Health Secretary Robert F. Kennedy Jr. expanded his crusade against using Tylenol with a warning: boys who were circumcised were twice as like",
    "link": "https://www.newsbreak.com/share/4283279798226-health-secretary-kennedy-trump-link-circumcision-to-autism-through-tylenol?_f=app_share&amp;pd=0DVWQmpv&amp;lang=en_US&amp;send_time=1760051873&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.15.1.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control&amp;s=i2",
    "timestamp": "2025-10-09T23:19:47Z"
  },
  {
    "title": "Judge temporarily blocks National Guard troop deployment in Illinois",
    "description": "A federal judge in Chicago on Thursday said she would temporarily block U.S. President Donald Trump from deploying hundreds of National Guard soldiers in Illinois, five days after another U.S. judge blocked a similar deployment in Portland, Ore.",
    "link": "https://www.cbc.ca/news/world/national-guard-deployment-chicago-9.6934020",
    "timestamp": "2025-10-09T23:19:24Z"
  },
  {
    "title": "RFK Jr. says link between circumcision and autism 'highly likely'",
    "description": "Health and Human Services Secretary Robert, F. Kennedy, Jr. claimed Thursday that there is a strong connection between circumcision and autism, and he linked...",
    "link": "https://www.upi.com/Top_News/US/2025/10/09/kennedy-circumcision-autism-link-highly-likely/6761760051174/",
    "timestamp": "2025-10-09T23:17:00Z"
  },
  {
    "title": "Trump dealt blow in National Guard deployment as judge finds no evidence of 'rebellion'",
    "description": "President Donald Trump's effort to send National Guard troops to curb crime suffered a setback on Thursday as a federal judge blocked the move for at least 14 days.Trump sent National Guard troops to Chicago earlier this month, citing rampant crime and to aid…",
    "link": "https://www.rawstory.com/trump-national-guard-2674171227/",
    "timestamp": "2025-10-09T23:16:52Z"
  },
  {
    "title": "Trump floats throwing Spain out of NATO over defense spending",
    "description": "Spain has previously earned Trump’s ire for rejecting calls to increase defense spending to 5% of gross domestic product.",
    "link": "https://www.japantimes.co.jp/news/2025/10/10/world/politics/spain-nato-defense-spending/",
    "timestamp": "2025-10-09T23:12:00Z"
  },
  {
    "title": "Trump proposes barring Chinese airlines flying over Russia on US flights",
    "description": "WASHINGTON (Reuters) -The Trump administration on Thursday proposed banning Chinese airlines from flying over Russia on flights to and from the United States...",
    "link": "https://www.yahoo.com/news/articles/trump-proposes-barring-chinese-airlines-231154173.html",
    "timestamp": "2025-10-09T23:11:54Z"
  },
  {
    "title": "Why The Bull Market Should Keep Going",
    "description": "Tame inflation, an OK economy and AI likely will keep things cooking, the shutdown be damned. Equities are closing in on their third year of increases.",
    "link": "https://www.forbes.com/sites/lawrencelight/2025/10/09/why-the-bull-market-should-keep-going/",
    "timestamp": "2025-10-09T23:10:40Z"
  },
  {
    "title": "‘Should throw them out of NATO’: Trump blasts Spain over defence spending",
    "description": "The US president has harboured a months-long feud with Spain after it rejected his call to increase NATO defence funds.",
    "link": "https://www.aljazeera.com/news/2025/10/9/should-throw-them-out-of-nato-trump-blasts-spain-over-defence-spending",
    "timestamp": "2025-10-09T23:10:10Z"
  },
  {
    "title": "Trump, the Self-Styled “President of PEACE” Abroad, Makes War at Home",
    "description": "Susan B. Glasser on the cognitive dissonance of Donald Trump touting himself as a global peacemaker even as he attempts to dispatch National Guard troops to quell dissent in American cities.",
    "link": "https://www.newyorker.com/news/letter-from-trumps-washington/trump-the-self-styled-president-of-peace-abroad-makes-war-at-home",
    "timestamp": "2025-10-09T23:05:04Z"
  },
  {
    "title": "Palestinians in Gaza’s south relearn sound of peace after truce deal",
    "description": "The first phase of a Gaza ceasefire agreement has dramatically reduced Israeli attacks in southern Gaza.",
    "link": "https://www.aljazeera.com/features/2025/10/9/palestinians-in-gazas-south-relearn-sound-of-peace-after-truce-deal",
    "timestamp": "2025-10-09T23:02:44Z"
  },
  {
    "title": "The biggest questions about Israel and Hamas’ long-awaited peace deal",
    "description": "Secretary of State Marco Rubio speaks to President Donald Trump during a roundtable discussion in the State Dining Room of the White House on Oct. 8, 2025.",
    "link": "https://biztoc.com/x/5b5d3e8a9c398103",
    "timestamp": "2025-10-09T23:02:03Z"
  },
  {
    "title": "Watch: How Trump's relationships helped pull off a Gaza deal",
    "description": "The BBC's Anthony Zurcher breaks down how the US president's connections have brought about a breakthrough moment for the Middle East.",
    "link": "https://www.bbc.com/news/videos/cq5jv3dpnj2o",
    "timestamp": "2025-10-09T23:01:49Z"
  },
  {
    "title": "Turning Point announces rival halftime show after Bad Bunny pick",
    "description": "Turning Point USA says it will host an “All American Halftime Show” during Super Bowl Sunday, following backlash from conservatives over Bad Bunny headlining in 2026",
    "link": "https://www.newschannel5.com/news/turning-point-usa-to-host-competing-halftime-show-after-nfl-names-bad-bunny-headliner",
    "timestamp": "2025-10-09T23:01:40Z"
  },
  {
    "title": "Donald Trump and peace in the Mideast (Washington Post)",
    "description": "Washington Post:\nDonald Trump and peace in the Mideast  —  Caution tempers celebration, but this Gaza peace plan may actually hold.  Trump's unorthodox style was key.  —  The announcement that Israel and Hamas have agreed to President Donald Trump's plan to e…",
    "link": "https://www.memeorandum.com/251009/p117",
    "timestamp": "2025-10-09T23:00:01Z"
  },
  {
    "title": "No Exit from Urals: Turkey’s Refineries Still Locked into Russian Supply",
    "description": "Midway through autumn 2025, Russian crude oil continues to dominate Turkey’s refinery feedstock, defying both geopolitical pressure and the Trump administration’s assertive diplomacy. September import data show Russian volumes flowing to Turkey above monthly …",
    "link": "https://oilprice.com/Energy/Energy-General/No-Exit-from-Urals-Turkeys-Refineries-Still-Locked-into-Russian-Supply.html",
    "timestamp": "2025-10-09T23:00:00Z"
  },
  {
    "title": "Jay Jurden Says the Riyadh Comedy Festival Was Like Performing for Donald Trump Jr. ‘If Don Jr. Could Kill People’",
    "description": "The comedian says the Riyadh lineup should calm down and take their lumps",
    "link": "https://www.cracked.com/article_48708_jay-jurden-says-the-riyadh-comedy-festival-was-like-performing-for-donald-trump-jr-if-don-jr-could-kill-people.html",
    "timestamp": "2025-10-09T23:00:00Z"
  },
  {
    "title": "Trump’s tragedy: the US becomes an autocracy and the presidency, a dictatorship",
    "description": "Blood-and-soil style violent nationalism infuses everything the Trump administration is doing.",
    "link": "https://theconversation.com/trumps-tragedy-the-us-becomes-an-autocracy-and-the-presidency-a-dictatorship-266675",
    "timestamp": "2025-10-09T22:58:33Z"
  },
  {
    "title": "Kennedy reups unproven Tylenol-autism link during Cabinet meeting",
    "description": "Health Secretary Robert F",
    "link": "https://abcnews.go.com/Politics/wireStory/kennedy-reups-unproven-tylenol-autism-link-cabinet-meeting-126381739",
    "timestamp": "2025-10-09T22:58:15Z"
  },
  {
    "title": "'That's hilarious': MAGA pundit scoffed at over remarks on Trump's peace deal",
    "description": "Liberal analyst Cenk Uygur scoffed at MAGA pundit Dinesh D'Souza during a recent episode of \"Piers Morgan Uncensored\" over the peace deal President Donald Trump announced to end the war between Israel and Hamas. Trump announced that Israel and Hamas agreed to…",
    "link": "https://www.rawstory.com/trump-2674171146/",
    "timestamp": "2025-10-09T22:57:03Z"
  },
  {
    "title": "Stephen Miller Screeches About 'Bloodbath' In Chicago",
    "description": "Miller accused Democrats of siding with \"gangbangers,\" \"predators\" and \"domestic terrorists\" during a Wednesday appearance on Fox News.",
    "link": "https://www.huffpost.com/entry/stephen-miller-chicago-bloodbath_n_68e7f54ce4b0a9f46d0c909e",
    "timestamp": "2025-10-09T22:56:44Z"
  },
  {
    "title": "Kennedy cites TikTok while repeating unproven Tylenol-autism link during Cabinet meeting",
    "description": "He suggested people who opposed the theory were motivated by hatred for President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/10/09/politics-kennedy-tylenol-autism/",
    "timestamp": "2025-10-09T22:56:02Z"
  },
  {
    "title": "Team Of 200 American Troops To 'Oversee' Gaza Truce...",
    "description": "Team Of 200 American Troops To 'Oversee' Gaza Truce...\r\n\n \n \n \n (Second column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:HOSTAGES COMING HOME...\r\nTRUMP TO RECEIVE...\r\nRELIEF AND CAUTION...\r\n'WAR OVER'...",
    "link": "https://www.barrons.com/articles/team-of-200-us-troops-to-oversee-gaza-truce-us-officials-95314dee",
    "timestamp": "2025-10-09T22:55:37Z"
  },
  {
    "title": "US sending 200 troops to Israel - as Netanyahu's government agrees ceasefire deal",
    "description": "President Donald Trump will send around 200 troops to Israel to help support and monitor the Gaza peace deal, US officials said on Thursday. The announcement came as Benjamin Netanyahu's government formally approved the agreement to return the remaining hosta…",
    "link": "https://freerepublic.com/focus/f-news/4345364/posts",
    "timestamp": "2025-10-09T22:55:25Z"
  },
  {
    "title": "Sinister, Malevolent, Venomous: Stephen Miller Is Like No Other White House Aide in Modern US History (John Harwood/Zeteo)",
    "description": "John Harwood / Zeteo:\nSinister, Malevolent, Venomous: Stephen Miller Is Like No Other White House Aide in Modern US History  —  Miller, the deputy White House chief of staff, has never hidden his disfigured and dangerous psyche.  But now Donald Trump has empo…",
    "link": "https://www.memeorandum.com/251009/p116",
    "timestamp": "2025-10-09T22:55:00Z"
  },
  {
    "title": "Letitia James slams Trump's 'desperate weaponization' of Justice Department after bombshell indictment and claims his only goal is 'political retribution'",
    "description": "Defiant New York Attorney General Letitia James slammed President Donald Trump's 'desperate weaponization' of the Department of Justice following a bombshell indictment accusing her of mortgage fraud.The attorney general - who has been a major critic of Trump…",
    "link": "https://freerepublic.com/focus/f-news/4345363/posts",
    "timestamp": "2025-10-09T22:54:24Z"
  },
  {
    "title": "Finnish President Alex Stubb Praises Trump for Peace Deal During Oval Office Meeting",
    "description": "Finnish President Alex Stubb heaped praise on President Donald Trump Thursday for brokering the first stage of a historic peace deal between Hamas and Israel.\nThe post Finnish President Alex Stubb Praises Trump for Peace Deal During Oval Office Meeting appear…",
    "link": "https://www.breitbart.com/politics/2025/10/09/finnish-president-alex-stubb-praises-trump-for-peace-deal-during-oval-office-meeting/",
    "timestamp": "2025-10-09T22:53:17Z"
  },
  {
    "title": "Israeli government approves 'first phase' of Trump's peace deal",
    "description": "The Israeli government on Thursday approved the framework for the \"first phase\" of the peace deal President Donald Trump announced this week. Trump announced on Wednesday that all sides had agreed to the \"first phase\" of a 20-point plan that could see all hos…",
    "link": "https://www.rawstory.com/trump-peace-deal-2674171201/",
    "timestamp": "2025-10-09T22:52:04Z"
  },
  {
    "title": "U.S. said to be prepping to send 200 troops to Israel for Gaza support",
    "description": "The United States military is preparing options to deploy as many as 200 U.S. troops to Israel to support stabilization in Gaza and the flow of humanitarian aid and security assistance into the enclave, two U.S. officials familiar with the planning said",
    "link": "https://www.nbcnews.com/news/us-news/us-troops-israel-gaza-rcna236769",
    "timestamp": "2025-10-09T22:51:30Z"
  },
  {
    "title": "‘REBELLION’?: Courts Weigh Oregon, Illinois Arguments Against Trump’s National Guard Deployments",
    "description": "Two federal courts heard arguments Thursday about President Donald Trump’s deployment of National Guard troops to quell unrest near U.S. Immigration and Customs Enforcement facilities... Read More\nThe post ‘REBELLION’?: Courts Weigh Oregon, Illinois Arguments…",
    "link": "https://www.dailysignal.com/2025/10/09/rebellion-courts-weigh-oregon-illinois-arguments-against-trumps-national-guard-deployments/",
    "timestamp": "2025-10-09T22:50:41Z"
  },
  {
    "title": "Trump’s indictment of Letitia James, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: President Donald Trump successfully directed the indic…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/464378/letitia-james-indictment-virginia-donald-trump-lindsey-halligan",
    "timestamp": "2025-10-09T22:50:36Z"
  },
  {
    "title": "Letitia James Hits Out Against Trump After Fraud Indictment: ‘These Charges Are Baseless’",
    "description": "Letitia James released a video statement after being indicted for bank fraud, accusing President Trump of engaging in \"political retribution at any cost.\"\nThe post Letitia James Hits Out Against Trump After Fraud Indictment: ‘These Charges Are Baseless’ first…",
    "link": "https://www.mediaite.com/crime/letitia-james-hits-out-against-trump-after-fraud-indictment-these-charges-are-baseless/",
    "timestamp": "2025-10-09T22:50:12Z"
  },
  {
    "title": "Trump suggests throwing Spain out of NATO",
    "description": "Madrid has been the only “laggard” in the bloc’s push to increase military spending, according to the US president Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626162-trump-expel-spain-nato/",
    "timestamp": "2025-10-09T22:49:55Z"
  },
  {
    "title": "Top Catholic Leader in Holy Land Celebrates Trump Gaza Deal: 'Now We Have to Rejoice'",
    "description": "Cardinal Pierbattista Pizzaballa, the Latin Patriarch of Jerusalem – the top Catholic authority in the Holy Land – issued a statement on Thursday celebrating the news that the jihadist terrorist organization Hamas had agreed to accept an agreement to end its …",
    "link": "https://www.breitbart.com/faith/2025/10/09/top-catholic-leader-in-holy-land-celebrates-trump-gaza-deal-now-we-have-to-rejoice/",
    "timestamp": "2025-10-09T22:49:36Z"
  },
  {
    "title": "Trump blames Democrats for shutdown as federal workers brace for impact",
    "description": "On the ninth day of the government shutdown, President Trump attributed the stalemate to Democrats, urging families affected by missed paychecks to contact their local representatives.",
    "link": "https://www.wmur.com/article/trump-government-shutdown-democrats-blame/68992178",
    "timestamp": "2025-10-09T22:49:36Z"
  },
  {
    "title": "Elie Honig Says Trump May Have Handed Comey A Lifeline",
    "description": "Elie Honig said Thursday that a now-deleted Truth Social post from President Donald Trump may have handed James Comey a potential legal off-ramp",
    "link": "https://dailycaller.com/2025/10/09/elie-honig-trump-handed-comey-lifeline/",
    "timestamp": "2025-10-09T22:48:23Z"
  },
  {
    "title": "LA Times Owner Patrick Soon-Shiong Denies ‘Billionaires Club’ With Jeff Bezos Squandered Kamala Harris’ Campaign | Video",
    "description": "\"I didn't believe, frankly, that she would be competent as the President of the United States,\" he says of spiking the paper's endorsement of Harris\nThe post LA Times Owner Patrick Soon-Shiong Denies ‘Billionaires Club’ With Jeff Bezos Squandered Kamala Harri…",
    "link": "https://www.thewrap.com/patrick-soon-shiong-denies-billionaires-club-squandered-harris-campaign/",
    "timestamp": "2025-10-09T22:48:06Z"
  },
  {
    "title": "'Long Live the King': Bitcoin Billionaire Arthur Hayes Predicts the BTC 4-Year Cycle Is Over",
    "description": "Crypto entrepreneur Arthur Hayes predicts that Bitcoin's typical four-year cycle is over as an increased money supply will benefit digital assets.",
    "link": "https://decrypt.co/343673/bitcoin-billionaire-arthur-hayes-predicts-btc-4-year-cycle-over",
    "timestamp": "2025-10-09T22:46:03Z"
  },
  {
    "title": "Breitbart Business Digest: Six Months After Liberation Day, Every Economic Prediction About Trump's Tariffs Was Wrong",
    "description": "At every turn, the real-world evidence contradicts the theoretical objections to Trump's tariffs.\nThe post Breitbart Business Digest: Six Months After Liberation Day, Every Economic Prediction About Trump’s Tariffs Was Wrong appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/10/09/breitbart-business-digest-six-months-after-liberation-day-every-economic-prediction-about-trumps-tariffs-was-wrong/",
    "timestamp": "2025-10-09T22:45:08Z"
  },
  {
    "title": "The biggest questions about Israel and Hamas’ long-awaited peace deal",
    "description": "Israel and Hamas agreed to the first phase of President Trump's 20-point peace plan. Here's why we shouldn't celebrate just yet.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-israel-hamas-gaza-ceasefire-deal-questions-rcna236564",
    "timestamp": "2025-10-09T22:44:42Z"
  },
  {
    "title": "N.Y. Attorney General Letitia James indicted on fraud charge in latest case against Trump foe",
    "description": "New York Attorney General Letitia  James, a longtime foe of U.S. President Donald Trump, was indicted on Thursday on criminal charges including bank fraud, the U.S. Justice Department said.",
    "link": "https://www.cbc.ca/news/world/letitia-james-indicted-fraud-9.6933831",
    "timestamp": "2025-10-09T22:41:00Z"
  },
  {
    "title": "Levi Strauss forecasts annual profit below estimates as tariffs bite",
    "description": "(Reuters) -Levi Strauss raised its full-year profit forecast on Thursday but fell short of Wall Street expectations owing to costs linked to U.S. import...",
    "link": "https://finance.yahoo.com/news/levi-strauss-forecasts-annual-profit-223847689.html",
    "timestamp": "2025-10-09T22:38:47Z"
  },
  {
    "title": "Farmers, traders ‘flying blind’ as US shutdown blocks key crop data",
    "description": "CHICAGO (Reuters) -U.S. data vital to global grain and soybean trading has gone dark during the federal government's shutdown, leaving commodity traders and ...",
    "link": "https://finance.yahoo.com/news/farmers-traders-flying-blind-us-223745837.html",
    "timestamp": "2025-10-09T22:37:45Z"
  },
  {
    "title": "New York AG Letitia James indicted on fraud charge",
    "description": "New York Attorney General Letitia James has been charged as part of a mortgage fraud investigation aggressively pushed by the Trump administration",
    "link": "https://www.wftv.com/news/politics/new-york-attorney/ZEEWQSAC547JNFF5WGMOGVO32Q/",
    "timestamp": "2025-10-09T22:37:05Z"
  },
  {
    "title": "Israel approves peace deal to end war with Hamas in Gaza",
    "description": "Israel’s government voted Thursday to approve the first phase of a peace deal that could bring an end to the war in Gaza and see Hamas return the remaining Israeli hostages",
    "link": "https://www.msnbc.com/top-stories/latest/israel-hamas-peace-deal-gaza-war-hostages-rcna235547",
    "timestamp": "2025-10-09T22:36:11Z"
  },
  {
    "title": "Former Fed Governor Larry Lindsey withdraws name for Fed chair",
    "description": "Former U.S. Federal Reserve Governor Larry Lindsey has withdrawn his name from the list of candidates for the next potential chair of the Federal Reserve.",
    "link": "https://www.cnbc.com/2025/10/09/former-fed-governor-larry-lindsey-withdraws-name-for-fed-chair.html",
    "timestamp": "2025-10-09T22:35:22Z"
  },
  {
    "title": "Federal Judge Blocks Trump's National Guard Deployment in Illinois",
    "description": "This is a developing story… Please check back for updates…US District Judge April Perry on Thursday partially granted Chicago and Illinois' request for a temporary restraining order against President Donald Trump's deployment of National Guard troops, purport…",
    "link": "https://www.commondreams.org/news/national-guard-in-chicago",
    "timestamp": "2025-10-09T22:34:31Z"
  },
  {
    "title": "Beware Pam Bondi’s Huge Ring",
    "description": "According to ‘The Wall Street Journal,’ Trump is holding a grudge after being scratched by Bondi’s hefty jewelry.",
    "link": "http://www.thecut.com/article/did-trump-get-scratched-pam-bondi-ring.html",
    "timestamp": "2025-10-09T22:33:47Z"
  },
  {
    "title": "Trump says he will undergo 'semiannual physical' at Walter Reed on Friday",
    "description": "Trump says he will undergo 'semiannual physical' at Walter Reed on Fridaygo.com",
    "link": "https://abcnews.go.com/Politics/trump-undergo-semiannual-physical-walter-reed-friday/story?id=126380791",
    "timestamp": "2025-10-09T22:33:15Z"
  },
  {
    "title": "Turning Point USA Announces 'All American Halftime Show,' Countering Super Bowl Halftime Headliner Bad Bunny",
    "description": "Turning Point USA announced its \"All American Halftime Show,\" set for February 8, 2026 -- the same day as the NFL's Super Bowl LX -- which will run counter to the world's biggest sporting event's halftime performer, Puerto Rican pop star Bad Bunny, who was se…",
    "link": "https://www.breitbart.com/entertainment/2025/10/09/turning-point-usa-announces-all-american-halftime-show-countering-super-bowl-halftime-headliner-bad-bunny/",
    "timestamp": "2025-10-09T22:33:07Z"
  },
  {
    "title": "Breaking: Israeli government approves phase one of Gaza ceasefire and hostage deal",
    "description": "The Israeli government has approved Gaza's ceasefire and hostage deal, Prime Minister Benjamin Netanyahu's office said early on Friday.",
    "link": "https://www.abc.net.au/news/2025-10-10/israel-government-approves-gaza-ceasefire-deal-first-phase/105874642",
    "timestamp": "2025-10-09T22:33:05Z"
  },
  {
    "title": "New York Attorney General Letitia James Indicted by Justice Department",
    "description": "New York Attorney General Letitia James has been indicted by a federal grand jury in Virginia. James has been charged with two felony counts -- bank fraud and making false statements to a financial institution, according to CNN. The allegations…\n Permalink",
    "link": "https://www.tmz.com/2025/10/09/letitia-james-indicted-justice-department/",
    "timestamp": "2025-10-09T22:32:47Z"
  },
  {
    "title": "Trump To Send 200 U.S. Soldiers to Israel: Report",
    "description": "President Donald Trump is sending about 200 soldiers to Israel to monitor the ceasefire between Israel and Hamas, the Associated Press reported on Thursday.\nThe post Trump To Send 200 U.S. Soldiers to Israel: Report  first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-to-send-200-u-s-soldiers-to-israel-report/",
    "timestamp": "2025-10-09T22:32:30Z"
  },
  {
    "title": "The Hamas Deal Drags U.S. Into Gaza Nation Building",
    "description": "We’ve learned nothing from Afghanistan and Iraq.On Oct 7, 2001, the United States began an ill-fated campaign to ‘nation build’ Afghanistan.Now 24 years after that anniversary and 2 years after the Oct 7 attacks by Hamas, we may be on the cusp of an even wors…",
    "link": "https://freerepublic.com/focus/f-news/4345358/posts",
    "timestamp": "2025-10-09T22:31:29Z"
  },
  {
    "title": "Top Official Horrified When Trump Thought He Was Sending Direct Message But Accidentally Posted It on Main Account",
    "description": "\"GREAT job.\"\nThe post Top Official Horrified When Trump Thought He Was Sending Direct Message But Accidentally Posted It on Main Account appeared first on Futurism.",
    "link": "https://futurism.com/future-society/trump-truth-social-media",
    "timestamp": "2025-10-09T22:31:21Z"
  },
  {
    "title": "Rick Caruso Trades More Barbs With Karen Bass Over Fire Response Blowback: ‘I’m the Farthest Thing From Donald Trump’",
    "description": "The real estate developer says he’s pondering a mayor or governor bid as he works to “bring people back to their homes” after the wildfires\nThe post Rick Caruso Trades More Barbs With Karen Bass Over Fire Response Blowback: ‘I’m the Farthest Thing From Donald…",
    "link": "https://www.thewrap.com/rick-caruso-karen-bass-fire-criticism-donald-trump-comparison/",
    "timestamp": "2025-10-09T22:31:15Z"
  },
  {
    "title": "Explainer: what powers does Trump actually have to deploy the military to US cities?",
    "description": "Trump use of the National Guard in several cities has been challenged by several governors. The case could end up before the Supreme Court.",
    "link": "https://theconversation.com/explainer-what-powers-does-trump-actually-have-to-deploy-the-military-to-us-cities-267109",
    "timestamp": "2025-10-09T22:31:11Z"
  },
  {
    "title": "Portland Antifa Operatives Planning Coordinated Action to Take Down Federal Aircraft: Report",
    "description": "\"Be ready to dispose of the laser if you need to - wear gloves and clean it with alcohol in case you have to toss it in a hurry.\"",
    "link": "https://www.westernjournal.com/portland-antifa-operatives-planning-coordinated-action-take-federal-aircraft-report/",
    "timestamp": "2025-10-09T22:29:15Z"
  },
  {
    "title": "Beyond Hubris – U.K, France and Germany Organize Urgent Meeting to Take Control of “Gaza Board of Peace",
    "description": "International politics can be boring at times, but the one constant in an ever-changing universe is the hubris of the European Union.With President Trump outlining the breakthrough negotiations for a peace agreement in Gaza, Emmanuel Macron (France), Keir Sta…",
    "link": "https://freerepublic.com/focus/f-news/4345357/posts",
    "timestamp": "2025-10-09T22:26:21Z"
  },
  {
    "title": "Beyond Hubris – U.K, France and Germany Organize Urgent Meeting to Take Control of “Gaza Board of Peace",
    "description": "International politics can be boring at times, but the one constant in an ever-changing universe is the hubris of the European Union.With President Trump outlining the breakthrough negotiations for a peace agreement in Gaza, Emmanuel Macron (France), Keir Sta…",
    "link": "https://freerepublic.com/focus/f-bloggers/4345357/posts",
    "timestamp": "2025-10-09T22:26:21Z"
  },
  {
    "title": "Hegseth decried 'fat troops.' Then a photo of hefty National Guard soldiers went viral.",
    "description": "A viral photo of Texas National Guard troops in Chicago prompted mockery and an official military response.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/09/national-guard-chicago-hegseth-fat-troops/86607286007/",
    "timestamp": "2025-10-09T22:23:55Z"
  },
  {
    "title": "Two Years Later: Released terrorist killed trying to carry out attack",
    "description": "Jihad Agaj, a Palestinian Arab from the village of Deir Jarir who about two years ago attacked a Jewish shepherd from Rimonim Farm in Benjamin during the olive harvest, was released to his home a few days after the attack. Last night he was killed by IDF sold…",
    "link": "https://freerepublic.com/focus/f-news/4345356/posts",
    "timestamp": "2025-10-09T22:23:32Z"
  },
  {
    "title": "Dems Rebelling Against Trump Resurrect Confederate Talking Points",
    "description": "Democrats are using arguments for states’ rights as a cynical ploy to paint themselves as victims of an oppressive federal government.There’s an old adage that says history doesn’t repeat, but it does rhyme. As the past few years have shown, Democrats aren’t …",
    "link": "https://freerepublic.com/focus/f-news/4345354/posts",
    "timestamp": "2025-10-09T22:22:50Z"
  },
  {
    "title": "Trump blames Democrats for shutdown as federal workers brace for impact",
    "description": "On the ninth day of the government shutdown, President Trump attributed the stalemate to Democrats, urging families affected by missed paychecks to contact their local representatives.",
    "link": "https://www.koat.com/article/trump-government-shutdown-democrats-blame/68992178",
    "timestamp": "2025-10-09T22:22:29Z"
  },
  {
    "title": "Republicans vote to roll back Biden-era restrictions on mining and drilling in 3 Western states",
    "description": "Senate Republicans have voted to roll back restrictions on mining and drilling in federal land in three Western states",
    "link": "https://abcnews.go.com/Business/wireStory/republicans-vote-roll-back-biden-era-restrictions-mining-126381357",
    "timestamp": "2025-10-09T22:21:44Z"
  },
  {
    "title": "US buys Argentinian pesos, finalises $20bn currency swap, says US Treasury",
    "description": "Argentina's right-wing President Milei, a close ally of President Trump, faces a critical midterm election this month.",
    "link": "https://www.aljazeera.com/news/2025/10/9/us-buys-argentinian-pesos-finalises-20bn-currency-swap-says-us-treasury",
    "timestamp": "2025-10-09T22:21:03Z"
  },
  {
    "title": "Senate Rejects Bid to Curb Trump’s Caribbean Strikes",
    "description": "On Wednesday, the U.S. Senate narrowly defeated a resolution that would have restrained President Donald Trump’s authority to conduct military strikes on non-state actors in the Caribbean. The measure, titled “A joint resolution to direct the removal of Unite…",
    "link": "https://freerepublic.com/focus/f-news/4345353/posts",
    "timestamp": "2025-10-09T22:18:37Z"
  },
  {
    "title": "Who are the hostages expected to be released in Gaza peace deal?",
    "description": "Following Israel and Hamas' agreement to implement the first phase of Trump's Gaza peace plan, these are the hostages who may soon be returning home.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/09/who-are-israeli-hostages-still-alive-gaza/86599948007/",
    "timestamp": "2025-10-09T22:18:26Z"
  },
  {
    "title": "New York AG Letitia James charged in mortgage fraud investigation",
    "description": "New York Attorney General Letitia James was charged Thursday as part of a mortgage fraud investigation aggressively pushed by the Trump administration, becoming the latest foe of the president to be prosecuted by his Justice Department.\nJames, who infuriated …",
    "link": "https://biztoc.com/x/eed2fab04b18ecb0",
    "timestamp": "2025-10-09T22:17:51Z"
  }
]