[
  {
    "title": "Clawback: DOJ decision to rescind $800 million in grants allowed by federal judge",
    "description": "'Defendants' rescinding of these awards is shameful. It is likely to harm communities and individuals vulnerable to crime and violence. But displeasure and sympathy are not enough in a court of law'",
    "link": "https://www.wnd.com/2025/07/clawback-doj-decision-rescind-800-million-grants-allowed/",
    "timestamp": "2025-07-09T14:58:07Z"
  },
  {
    "title": "Indonesia optimistic of striking tariff deal with US: official",
    "description": "Spokesperson for the Coordinating Ministry for Economic Affairs, Haryo Limanseto, said he is confident that Indonesia will manage to negotiate an import ...",
    "link": "https://en.antaranews.com/news/365193/indonesia-optimistic-of-striking-tariff-deal-with-us-official",
    "timestamp": "2025-07-09T14:57:19Z"
  },
  {
    "title": "Trump Trade Team Extends Deadline On Tariff Deals",
    "description": "By George Caldwell, The Daily Signal | July 07, 2025\nAs President Donald Trump’s trade team works to sign new trade deals with foreign countries, the White House is giving trading partners an extended deadline to sign deals before being hit with the heavy tar…",
    "link": "https://biztoc.com/x/b22d7632ab712b21",
    "timestamp": "2025-07-09T14:56:59Z"
  },
  {
    "title": "Treasury yields move lower as investors monitor latest tariff news",
    "description": "U.S. Treasury yields were lower on Wednesday as investors monitored the latest tariff developments after President Donald Trump sent letters dictating new tariff rates to at least 14 countries.\nThe 10-year Treasury yield was down 3 basis points at 4.387%, and…",
    "link": "https://biztoc.com/x/41fc89aa60e950bc",
    "timestamp": "2025-07-09T14:56:50Z"
  },
  {
    "title": "Israeli strike kills 40 Palestinians in Gaza as Netanyahu and Trump meet over a ceasefire",
    "description": "As talks for a ceasefire in the Gaza Strip resume, Palestinians in the battered enclave say they are desperate for deal to end the war. Israel and Hamas are considering a new U.S.-backed ceasefire proposal that would pause the war, free Israeli hostages and s…",
    "link": "https://www.pbs.org/newshour/world/israeli-strike-kills-40-palestinians-in-gaza-as-netanyahu-and-trump-meet-over-a-ceasefire",
    "timestamp": "2025-07-09T14:56:49Z"
  },
  {
    "title": "'Scarcely begun': Trump is running away from Texas tragedy's cause",
    "description": "ProPublica is a Pulitzer Prize-winning investigative newsroom. Sign up for The Big Story newsletter to receive stories like this one in your inbox.On July 4, the broken remnants of a powerful tropical storm spun off the warm waters of the Gulf of Mexico so he…",
    "link": "https://www.rawstory.com/scarcely-begun-trump-is-running-away-from-texas-tragedy-s-cause/",
    "timestamp": "2025-07-09T14:56:20Z"
  },
  {
    "title": "Biden's former doctor refuses to answer questions in House Republican probe",
    "description": "President Joe Biden’s White House physician is refusing to answer questions as part of the House Republican investigation into Biden’s health in office.",
    "link": "https://www.clickondetroit.com/health/2025/07/09/bidens-former-doctor-refuses-to-answer-questions-in-house-republican-probe/",
    "timestamp": "2025-07-09T14:56:17Z"
  },
  {
    "title": "BlackRock’s Cash-Like ETF Eclipses Infamous Long-Bond Trade",
    "description": "(Bloomberg) -- To see how the “T-bill-and-chill” mindset is reshaping fixed-income investing, look no further than the diverging fortunes of two BlackRock...",
    "link": "https://finance.yahoo.com/news/blackrock-cash-etf-eclipses-infamous-145432770.html",
    "timestamp": "2025-07-09T14:54:32Z"
  },
  {
    "title": "Stocks are in a 'Goldilocks' setup in the 2nd half, but 3 things could disrupt the market",
    "description": "A stagflationary slowdown, higher rates, and a deeper slide in the US dollar could spoil the party for investors in the second half, Goldman Sachs said.",
    "link": "https://www.businessinsider.com/stock-market-outlook-tariffs-economy-inflation-interest-rates-goldman-sachs-2025-7",
    "timestamp": "2025-07-09T14:54:27Z"
  },
  {
    "title": "Musk-owned X's CEO Yaccarino to step down in surprise move",
    "description": "Elon Musk-owned X's CEO Linda Yaccarino said on Wednesday she would step down from the role in a surprise move, just months after the social media platform was acquired by the billionaire's AI startup, xAI.Her departure adds to the turbulence in Musk's sprawl…",
    "link": "https://www.channelnewsasia.com/business/musk-owned-xs-ceo-yaccarino-step-down-surprise-move-5229576",
    "timestamp": "2025-07-09T14:53:52Z"
  },
  {
    "title": "Linda Yaccarino, CEO of Elon Musk's X, to step down in surprise move",
    "description": "Elon Musk-owned social platform X's CEO Linda Yaccarino said on Wednesday she would step down from the role in a surprise move.Her exit comes at a difficult time for Musk, who is dealing with falling sales at his EV maker Tesla and is embroiled in a war of wo…",
    "link": "https://www.channelnewsasia.com/business/linda-yaccarino-ceo-elon-musks-x-step-down-surprise-move-5229576",
    "timestamp": "2025-07-09T14:53:52Z"
  },
  {
    "title": "Chipmaker Nvidia becomes first company to surpass $4 trillion in valuation",
    "description": "Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy.",
    "link": "https://www.cbsnews.com/news/chipmaker-nvidia-becomes-most-valuable-company-in-the-world-at-4-trillion/",
    "timestamp": "2025-07-09T14:48:57Z"
  },
  {
    "title": "Elon Musk’s Viral Meme Sends $PNUT Soaring – What it Means for the Best Meme Coins in 2025",
    "description": "Tech billionaire, space adventurer, and aspiring President of the World, Elon Musk, has sent a meme coin soaring with just one post on his self-owned X platform. And as $PNUT sees a 153.9% spike in trading volume since yesterday, the market’s best meme coins …",
    "link": "https://bitcoinist.com/best-meme-coins-soar-after-musk-viral-boost-to-pnut/",
    "timestamp": "2025-07-09T14:48:34Z"
  },
  {
    "title": "Pope Leo cries climate change during prayer for Texas flood victims in yet another thinly-veiled jab at Trump",
    "description": "American Pope Leo interrupts vacation at Castle Gandolfo for urgent political message that defies Trump's agenda Pope Leo urged the faithful around the world to combat climate change during his prayer for the Texas flood victims in another thinly-veiled jab a…",
    "link": "https://freerepublic.com/focus/f-chat/4327687/posts",
    "timestamp": "2025-07-09T14:48:21Z"
  },
  {
    "title": "Cryptocurrency boom: Dubai Emirates adopts cryptocurrencies payments, Donald Trump company goes big on crypto",
    "description": "UAE or United Arab Emirates has been emerging as a key hub for crypto companies in recent years. In just the past few months, Trump Media has raised $2.5 billion in cash to invest in bitcoin and is working to bring crypto-related exchange traded funds, or ETF…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cryptocurrency-boom-dubai-emirates-adopts-cryptocurrencies-payments-donald-trump-company-goes-big-on-crypto/articleshow/122346261.cms",
    "timestamp": "2025-07-09T14:47:37Z"
  },
  {
    "title": "Bill Berrien launches bid for Wisconsin governor; compares himself to Trump",
    "description": "A suburban Milwaukee businessman, former Navy SEAL and political newcomer entered Wisconsin's race for governor Wednesday, likening himself to President Donald Trump and promising a “Wisconsin First\" agenda.",
    "link": "https://www.fox6now.com/news/wisconsin-republican-launches-bid-governor-compares-himself-trump",
    "timestamp": "2025-07-09T14:45:30Z"
  },
  {
    "title": "Immigration, Epstein, Ukraine: Trump's moves roil MAGA base (Natalie Allison/Washington Post)",
    "description": "Natalie Allison / Washington Post:\nImmigration, Epstein, Ukraine: Trump's moves roil MAGA base  —  White House officials concede there's unrest in the MAGA ranks but say it doesn't seriously threaten Trump's support.  —  Even as President Donald Trump celebra…",
    "link": "https://www.memeorandum.com/250709/p57",
    "timestamp": "2025-07-09T14:45:01Z"
  },
  {
    "title": "‘They’re killing us’: Immigrants complain of inhumane conditions inside NYC holding site",
    "description": "A masked federal agent looks directly at the camera as someone is detained and brought downstairs at 26 Federal Plaza.\n \n\nImmigrants complain of cramped conditions, inadequate food and bathing facilities and sleeping on concrete floors. [ more › ]",
    "link": "https://gothamist.com/news/theyre-killing-us-immigrants-complain-of-inhumane-conditions-inside-nyc-holding-site",
    "timestamp": "2025-07-09T14:45:00Z"
  },
  {
    "title": "Why Are Immigrants From Tropical Countries Coming to This Arctic Outpost?",
    "description": "\"Why not here?\" says the owner of a Lebanese restaurant in Canada's semiautonomous Nunavut Territory.",
    "link": "https://reason.com/2025/07/08/iqaluit-canada/",
    "timestamp": "2025-07-09T14:44:33Z"
  },
  {
    "title": "Kremlin says it is ‘calm’ regarding Trump criticism of Putin over Ukraine talks",
    "description": "The Kremlin, asked on Wednesday about US President Donald Trump’s criticism of Russian President Vladimir Putin, said that Moscow was “calm” regarding the criticism, and that it would continue to try to fix a “broken” US -Russia relationship. In a call with r…",
    "link": "https://freerepublic.com/focus/f-chat/4327686/posts",
    "timestamp": "2025-07-09T14:44:14Z"
  },
  {
    "title": "Trump administration promises on Jeffrey Epstein case fizzle out, angering some allies",
    "description": "The U.S. Justice Department and White House have scrambled this week to explain a significant walkback from promises of potentially explosive information involving accused sex trafficker Jeffrey Epstein and his alleged clientele.",
    "link": "https://www.cbc.ca/news/world/trump-justice-department-epstein-controversy-1.7580472",
    "timestamp": "2025-07-09T14:43:57Z"
  },
  {
    "title": "US Green Card chaos: Immigration backlog hits record 11.3 million - thousands left in limbo",
    "description": "Green card delays and visa backlog 2025 have hit record highs as USCIS backlog crosses 11.3 million pending cases, creating massive wait times and uncertainty for millions. Processing of green card applications, work permits, and employment-based visas has sl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-green-card-chaos-immigration-backlog-hits-record-11-3-million-thousands-left-in-limbo/articleshow/122345503.cms",
    "timestamp": "2025-07-09T14:41:37Z"
  },
  {
    "title": "CNN Star Calls Out Her Own Network For Paying Scott Jennings to Say ‘Terrible Things’ — Savages Colleague On Podcast",
    "description": "Kara Swisher called out CNN for allowing fellow CNN star Scott Jennings to say \"terrible things\" and savaged Jennings with her podcast co-host Scott Galloway.\nThe post CNN Star Calls Out Her Own Network For Paying Scott Jennings to Say ‘Terrible Things’ — Sav…",
    "link": "https://www.mediaite.com/media/news/cnn-star-calls-out-her-own-network-for-paying-scott-jennings-to-say-terrible-things-savages-colleague-on-podcast/",
    "timestamp": "2025-07-09T14:41:28Z"
  },
  {
    "title": "What is holding up Gaza 60-day ceasefire deal?",
    "description": "Donald Trump and Benjamin Netanyahu have yet to agree on terms for a ceasefire deal with Hamas in Gaza.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/7/9/what-is-holding-up-gaza-60-day-ceasefire-deal",
    "timestamp": "2025-07-09T14:40:18Z"
  },
  {
    "title": "Markets Show Growing Resilience As Trump Sets August 1 Tariff Deadline Amid Negotiations",
    "description": "The looming tariff threat continues to inject volatility in sectors such as manufacturing and technology but emphasized that overall market indices remain steady as investors factor in the potential for exemptions or softer measures.",
    "link": "https://www.ibtimes.com/markets-show-growing-resilience-trump-sets-august-1-tariff-deadline-amid-negotiations-3777993",
    "timestamp": "2025-07-09T14:40:15Z"
  },
  {
    "title": "Domestic pharma industry will have to pass on high tariff impact to US consumers",
    "description": "Indian pharmaceutical companies might increase drug prices for the United States. This is due to possible import tariffs by the US administration. Industry experts believe smaller firms could face pressure. The US relies heavily on Indian generics. High tarif…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/domestic-pharma-industry-will-have-to-pass-on-high-tariff-impact-to-us-consumers/articleshow/122346185.cms",
    "timestamp": "2025-07-09T14:40:03Z"
  },
  {
    "title": "Chipmaker Nvidia becomes most valuable company in the world at $4 trillion",
    "description": "NEW YORK (AP) — Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy. Nvidia shares rose 2.5%, or $3.97, in early trading Wednesday, topping $164 each. At the beginning of 2023, Nvidia shares…",
    "link": "https://financialpost.com/pmn/chipmaker-nvidia-becomes-most-valuable-company-in-the-world-at-4-trillion",
    "timestamp": "2025-07-09T14:38:16Z"
  },
  {
    "title": "Samsung's profit plunges as AI chip woes and US tariffs bite",
    "description": "The South Korean tech giant attributed its disappointing results to a combination of US export restrictions on advanced artificial intelligence chips bound for China and ongoing challenges in supplying key customer Nvidia with its latest high-bandwidth memory…",
    "link": "https://www.techspot.com/news/108595-samsung-profit-plunges-ai-chip-woes-us-tariffs.html",
    "timestamp": "2025-07-09T14:38:00Z"
  },
  {
    "title": "Donald Trump's Remarks About Putin Leave Russian State TV Stunned",
    "description": "TV anchor Olga Skabeyeva said that Trump had criticized Russia for \"the fourth time in recent days.\"",
    "link": "https://www.newsweek.com/russia-trump-tv-stunned-2096508",
    "timestamp": "2025-07-09T14:37:18Z"
  },
  {
    "title": "Trade war 'not a passing storm', Malaysian PM warns South-East Asian nations",
    "description": "Some South-East Asian countries face significant tariffs from next month under Donald Trump's plans, with several continuing to push for deals to avoid the highest levies.",
    "link": "https://www.abc.net.au/news/2025-07-10/malaysian-pm-warns-donald-trump-tariff-war-is-new-normal/105514434",
    "timestamp": "2025-07-09T14:36:43Z"
  },
  {
    "title": "Chipmaker Nvidia becomes most valuable company in the world at $4 trillion",
    "description": "Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy. Nvidia shares rose 2.5%, or $3.97, in early trading Wednesday, topping $164 each. At the beginning of 2023, Nvidia shares were around $14…",
    "link": "https://www.seattlepi.com/business/article/chipmaker-nvidia-becomes-most-valuable-company-in-20762703.php",
    "timestamp": "2025-07-09T14:36:25Z"
  },
  {
    "title": "'No idea who he is': Groups cited by Trump admin deny backing dubious nominee",
    "description": "Prominent Jewish groups are denying the Trump administration's claims they support an inexperienced government lawyer with \"ties to a Holocaust denier\" to lead the Office of Special Counsel, according to CNN.The administration's pick to head the government's …",
    "link": "https://www.rawstory.com/no-idea-who-he-is-groups-cited-by-trump-admin-deny-backing-dubious-nominee/",
    "timestamp": "2025-07-09T14:33:34Z"
  },
  {
    "title": "Germany's Merz defends record so far in budget speech",
    "description": "German Chancellor Merz has defended his government's record so far, urging optimism and unity. He stressed record defense spending as key to NATO ties, while clashing with the far right.",
    "link": "https://www.dw.com/en/germanys-merz-defends-record-so-far-in-budget-speech/a-73216576",
    "timestamp": "2025-07-09T14:33:00Z"
  },
  {
    "title": "Russia issues response to leaked audio tapes of Donald Trump threatening to 'bomb the s**t' out of Moscow",
    "description": "Russian spokesperson Dmitry Peskov has responded to leaked audio featuring Donald Trump threatening to 'bomb the s**t out of Moscow' in Vladimir Putin call.",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-bomb-moscow-threat-russia-response-068388-20250709",
    "timestamp": "2025-07-09T14:32:08Z"
  },
  {
    "title": "Copper Hits Record High As Trump Confirms 50% Tariff, Extends Deadline To August 1",
    "description": "Market analysts say the surge reflects concerns about supply disruptions and global reshuffling of industrial metals sourcing.",
    "link": "https://www.ibtimes.com/copper-hits-record-high-trump-confirms-50-tariff-extends-deadline-august-1-3777992",
    "timestamp": "2025-07-09T14:32:02Z"
  },
  {
    "title": "Chipmaker Nvidia becomes most valuable company in the world at $4 trillion",
    "description": "At the beginning of 2023, Nvidia shares were around $14 each. They are now $164.",
    "link": "https://www.denverpost.com/2025/07/09/nvidia-most-valuable-company/",
    "timestamp": "2025-07-09T14:31:19Z"
  },
  {
    "title": "Chipmaker Nvidia becomes most valuable company in the world at $4 trillion",
    "description": "Nvidia and other companies benefiting from the AI boom have been a major reason the S&P 500 has climbed to record after record recently.",
    "link": "https://www.bostonherald.com/2025/07/09/nvidia-most-valuable-company/",
    "timestamp": "2025-07-09T14:31:19Z"
  },
  {
    "title": "Stocks Get Tech Boost as Nvidia Hits $4 Trillion: Markets Wrap",
    "description": "A rally in the world’s largest technology companies spurred a rebound in stocks, with Nvidia Corp. hitting $4 trillion - the first company in history to achieve that milestone. Treasuries held steady ahead of a $39 billion sale of bonds and minutes from last …",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-get-tech-boost-as-nvidia-hits-4-trillion-markets-wrap",
    "timestamp": "2025-07-09T14:30:34Z"
  },
  {
    "title": "Trump appointees have ties to companies that stand to benefit from privatizing weather forecasts",
    "description": "WASHINGTON (AP) — As commerce secretary, Howard Lutnick oversees the U.S. government’s vast efforts to monitor and predict the weather. The billionaire also ran a financial firm, which he recently left in the control of his adult sons, that stands to benefit …",
    "link": "https://financialpost.com/pmn/trump-appointees-have-ties-to-companies-that-stand-to-benefit-from-privatizing-weather-forecasts-2",
    "timestamp": "2025-07-09T14:29:03Z"
  },
  {
    "title": "Chipmaker Nvidia becomes most valuable company in the world at $4 trillion",
    "description": "Chipmaker Nvidia became the first public company to top $4 trillion in value on Wednesday after two-year investor frenzy",
    "link": "https://abcnews.go.com/Technology/wireStory/chipmaker-nvidia-valuable-company-world-4-trillion-123610115",
    "timestamp": "2025-07-09T14:27:42Z"
  },
  {
    "title": "'Clickbait coming from inside the house': CNN host upends GOP guest's argument",
    "description": "CNN's John Berman flipped a Republican strategist's argument upside-down during a discussion of the Trump administration's handling of the Jeffrey Epstein case.Many of president Donald Trump's supporters are furious over a Justice Department and FBI memo stat…",
    "link": "https://www.rawstory.com/clickbait-trump-epstein-in-house/",
    "timestamp": "2025-07-09T14:27:03Z"
  },
  {
    "title": "The rules for paying taxes on tips and overtime are changing thanks to Trump’s Big Beautiful Bill. Here’s what to expect",
    "description": "More information on exactly what jobs the provisions apply to will be made available in the months ahead.",
    "link": "https://fortune.com/2025/07/09/no-tax-on-tips-overtime-explained-trump-budget/",
    "timestamp": "2025-07-09T14:27:02Z"
  },
  {
    "title": "Southeast Spotlight: Charles Cathey State Farm Insurance Agency",
    "description": "Charles Cathey State Farm Insurance Agency1652 E. 87th, Mon–Thu 9 AM to 5:30 PM, Fridays 9 AM to 5 PM, Saturday by appointment onlyInstagram @charlesismysfagent, charlescatheyjr.com, 773-978-5904  Like a good neighbor, Charles Cathey Jr. is there. Before open…",
    "link": "http://chicagoreader.com/news/southeastspotlight/charles-cathey-state-farm-insurance-agency/",
    "timestamp": "2025-07-09T14:26:46Z"
  },
  {
    "title": "EU trade chief says Europe will have to swallow US tariffs",
    "description": "EU-US agreement in principle could come in days, Maroš Šefčovič says.",
    "link": "https://www.euractiv.com/section/politics/news/eu-trade-chief-says-europe-will-have-to-swallow-us-tariffs/",
    "timestamp": "2025-07-09T14:26:31Z"
  },
  {
    "title": "EU trade chief says Europe will have to swallow US tariffs",
    "description": "EU-US agreement in principle could come in days, Maroš Šefčovič says.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/eu-trade-chief-says-europe-will-have-to-swallow-us-tariffs/",
    "timestamp": "2025-07-09T14:26:31Z"
  },
  {
    "title": "Can BRICS challenge the US-led world order?",
    "description": "President Donald Trump has threatened to impose more tariffs on nations aligning themselves with BRICS.",
    "link": "https://www.aljazeera.com/video/counting-the-cost/2025/7/9/can-brics-challenge-the-us-led-world-order",
    "timestamp": "2025-07-09T14:25:30Z"
  },
  {
    "title": "Demand from ‘buy Canadian’ movement pushes Purdys to move into grocer Save-On-Foods",
    "description": "Purdys Chocolatier says the buy Canadian movement has generated so much demand for its products that it decided to sell them outside its own stores for the first time in its 118-year history. The Vancouver-based confectionary company’s products can now be fou…",
    "link": "https://financialpost.com/pmn/demand-from-buy-canadian-movement-pushes-purdys-to-move-into-grocer-save-on-foods",
    "timestamp": "2025-07-09T14:23:49Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Rages at ‘Stupidest’ White House Press Corps in ‘American History’",
    "description": "O’Donnell delivered a scathing takedown of the White House press corps on Tuesday night, accusing reporters of becoming little more than “accessories” to Trump.\nThe post MSNBC’s Lawrence O’Donnell Rages at ‘Stupidest’ White House Press Corps in ‘American Hist…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-lawrence-odonnell-rages-at-stupidest-white-house-press-corps-in-american-history/",
    "timestamp": "2025-07-09T14:22:08Z"
  },
  {
    "title": "MAGA Cult Flips Out At Trump For Hiding Epstein's List",
    "description": "Trump's most loyal supporters are attacking him and Pam Bondi for refusing to expose the Jeffrey Epstein list of possible sexual perverts.\nJack Posobiec has had many private audiences with Demented Donald but he, like so many Trump officials promoted the Epst…",
    "link": "https://crooksandliars.com/2025/07/maga-cult-flips-out-trump-hiding-epsteins",
    "timestamp": "2025-07-09T14:22:02Z"
  },
  {
    "title": "Trump Congratulates Himself And TX For ‘Great’ Flood Response",
    "description": "As I write this, the death toll from the catastrophic flood in central Texas has reached at least 109, as per KHOU. That includes 30 children. The station also reported Tuesday, “Officials said they would begin reviewing the emergency response once search-and…",
    "link": "https://crooksandliars.com/2025/07/trump-congratulates-himself-and-tx-great",
    "timestamp": "2025-07-09T14:22:01Z"
  },
  {
    "title": "Grok Mocks Its Developers as They Try to Delete Its Incredibly Racist Posts",
    "description": "Elon Musk's artificial intelligence startup xAI was forced to delete intensely antisemitic posts by its Grok chatbot. The unhinged algorithm began celebrating Adolf Hitler, calling itself a 21st-century reincarnation, dubbed \"MechaHitler.\" It called out peopl…",
    "link": "https://futurism.com/grok-mocks-developers-racist-posts",
    "timestamp": "2025-07-09T14:21:47Z"
  },
  {
    "title": "'Get the hell out!' Trump moves to kick Chinese out of America's farms",
    "description": "President Donald Trump’s administration will pursue a ban on Chinese ownership of U.S. farmland as part of an effort to strengthen farm security, Agriculture Secretary Brooke Rollins said Tuesday.Appearing alongside other Cabinet officials, Republican governo…",
    "link": "https://www.rawstory.com/get-the-hell-out-trump-moves-to-kick-chinese-out-of-america-s-farms/",
    "timestamp": "2025-07-09T14:21:14Z"
  },
  {
    "title": "Moscow shrugs off Trump's irritation with Putin",
    "description": "On Ukraine, Vladimir Putin wants more than Donald Trump has been prepared to offer, writes BBC Russia editor Steve Rosenberg.",
    "link": "https://www.bbc.com/news/articles/c0epr9y0e84o",
    "timestamp": "2025-07-09T14:20:48Z"
  },
  {
    "title": "How Marco Rubio Botched a Deal to Free American Prisoners",
    "description": "Due to conflicting efforts by Secretary of State Marco Rubio and special envoy Richard Grenell, the Trump administration bungled a deal that would have freed 11 U.S. citizens and green card holders detained in Venezuela, along with a number of Venezuelan poli…",
    "link": "https://newrepublic.com/post/197736/rubio-grenell-trump-deal-free-american-prisoners-venezuela",
    "timestamp": "2025-07-09T14:20:16Z"
  },
  {
    "title": "A Status Quo Rate in Trump Tax Bill Is Big Win for Corporations",
    "description": "Executives at America’s largest corporations watched Donald Trump sign a massive tax-cut bill without any change in their own companies’ tax rates — and were grateful for their good luck.",
    "link": "https://financialpost.com/pmn/business-pmn/a-status-quo-rate-in-trump-tax-bill-is-big-win-for-corporations",
    "timestamp": "2025-07-09T14:20:14Z"
  },
  {
    "title": "Trump Has Officially Lost Roseanne — as MAGA Meltdown Over Epstein Report Intensifies",
    "description": "Disgraced sitcom star Roseanne Barr has publicly turned against President Donald Trump in the wake of a joint FBI/DOJ report that concluded notorious pedophile Jeffrey Epstein did not have a \"client list\" and was not murdered in prison.\nThe post Trump Has Off…",
    "link": "https://www.mediaite.com/media/news/trump-has-officially-lost-roseanne-as-maga-meltdown-over-epstein-report-intensifies/",
    "timestamp": "2025-07-09T14:19:21Z"
  },
  {
    "title": "Sheikh Hasina caught on tape authorising shooting of protesters",
    "description": "A BBC investigation has found that the former prime minister of Bangladesh, Sheikh Hasina, authorised her security forces to use lethal force against protestors last summer. The evidence is a leaked tape verified by the BBC. An estimated 1,400 people were kil…",
    "link": "https://www.bbc.co.uk/programmes/w172zss4x5vhsbb",
    "timestamp": "2025-07-09T14:19:00Z"
  },
  {
    "title": "Trump and Mamdani Spar Over a Federal Takeover of New York City",
    "description": "President Trump floated taking over the city under a Zohran Mamdani mayoralty, saying, ‘We have tremendous power at the White House to run places when we have to.’",
    "link": "http://nymag.com/intelligencer/article/trump-and-mamdani-spar-over-a-federal-takeover-of-nyc.html",
    "timestamp": "2025-07-09T14:15:13Z"
  },
  {
    "title": "Fluminense 0 Chelsea 2: Two Joao Pedro wondergoals seal final spot, but should Brazilians have had a penalty? - The New York Times",
    "description": "Fluminense 0 Chelsea 2: Two Joao Pedro wondergoals seal final spot, but should Brazilians have had a penalty?The New York Times Fifa Club World Cup final: US president Donald Trump to attend match in New JerseyBBC How Chelsea’s clever out-of-possession approa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178318590",
    "timestamp": "2025-07-09T14:15:10Z"
  },
  {
    "title": "What you need to know about the judge protecting Planned Parenthood’s funding",
    "description": "Has represented unions, delivered leftist rulings on free speech, transgenderism, immigration policy, and now is defying both Congress and President Trump",
    "link": "https://www.wnd.com/2025/07/what-you-need-know-about-judge-protecting-planned/",
    "timestamp": "2025-07-09T14:14:54Z"
  },
  {
    "title": "Donald Trump threatens copper, pharma tariffs: Who will they hurt?",
    "description": "US president announces sweeping new tariffs as he continues to change plans.",
    "link": "https://www.aljazeera.com/news/2025/7/9/donald-trump-threatens-copper-pharma-tariffs-who-will-they-hurt",
    "timestamp": "2025-07-09T14:13:55Z"
  },
  {
    "title": "Trump official explains ‘lost minute’ of Jeffrey Epstein CCTV footage that is fuelling major conspiracies",
    "description": "The US Attorney General Pam Bondi has explained why there's a 'lost minute' in the 11-hour prison CCTV of child sex offender Jeffery Epstein",
    "link": "https://www.ladbible.com/news/politics/donald-trump-attorney-general-jeffrey-epstein-cctv-lost-minute-117658-20250709",
    "timestamp": "2025-07-09T14:12:59Z"
  },
  {
    "title": "Trump: Fed rate is at least 3 points too high",
    "description": "United States President Donald Trump claimed on Wednesday that the interest rates are \"AT LEAST 3 points too high.\" He also repeated the allegation that Federal Reserve Chair Jerome Powell is \"costing...",
    "link": "https://biztoc.com/x/31930f746a890ca9",
    "timestamp": "2025-07-09T14:12:17Z"
  },
  {
    "title": "WATCH LIVE: Senate committee considers nomination of NOAA head as criticisms made for Texas flood",
    "description": "Former federal officials and outside experts have warned for months that President Donald Trump’s staffing cuts to the National Weather Service could endanger lives.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-committee-considers-nomination-of-noaa-head-as-criticisms-made-for-texas-flood",
    "timestamp": "2025-07-09T14:12:15Z"
  },
  {
    "title": "Netanyahu: 'Iran is planning to kill me and Trump'",
    "description": "PM sits down with Fox Business, praises President Trump as the 'best friend' Israel has ever had in the White House and explains why Trump should receive the Nobel Peace Prize.",
    "link": "https://www.israelnationalnews.com/news/411394",
    "timestamp": "2025-07-09T14:11:11Z"
  },
  {
    "title": "Russia launches largest missile and drone attack on Ukraine since start of war",
    "description": "The strike comes after US Donald Trump said he would ramp up arms deliveries to Ukraine.",
    "link": "https://www.thejournal.ie/russia-launches-largest-missile-and-drone-attack-on-ukraine-since-start-of-war-6757889-Jul2025/",
    "timestamp": "2025-07-09T14:11:02Z"
  },
  {
    "title": "Nvidia becomes the first company to be worth $4 trillion",
    "description": "The AI chipmaker’s market value smashed the previous record valuation, set by Apple.",
    "link": "https://www.nbcnews.com/business/business-news/nvidia-becomes-first-company-worth-4-trillion-what-to-know-rcna217721",
    "timestamp": "2025-07-09T14:10:58Z"
  },
  {
    "title": "Why is MAGA angry with Trump, Pam Bondi over Epstein files?",
    "description": "Right-wing conspiracy theorists have raised questions about a new government memo and video about Epstein.",
    "link": "https://www.aljazeera.com/news/2025/7/9/why-is-maga-angry-with-trump-pam-bondi-over-epstein-files",
    "timestamp": "2025-07-09T14:10:28Z"
  },
  {
    "title": "Russia Reacts to Audio of Trump Threat to Bomb the Sh*t Out of Moscow",
    "description": "Last year, President Trump told donors that he had a phone call with Russian President Vladimir Putin in which he threatened to “bomb the shit out of Moscow” if Putin invaded Ukraine. Kremlin spokesman Dmitri Peskov (mostly) denied that the phone call ever ha…",
    "link": "https://newrepublic.com/post/197737/russia-reacts-trump-audio-threat-bomb-moscow",
    "timestamp": "2025-07-09T14:09:59Z"
  },
  {
    "title": "Sarah Jessica Parker Won't Push Her Politics Because 'Many Generations Were Elected Without Someone Having to Say Something on Instagram'",
    "description": "\"Sex and the City\" star Sarah Jessica Parker says she doesn't talk about politics on social media because she believes it doesn't add anything constructive to discourse and \"turns into a distraction from a campaign.\" The actress pushed back against people who…",
    "link": "https://www.breitbart.com/entertainment/2025/07/09/sarah-jessica-parker-wont-push-her-politics-because-many-generations-were-elected-without-someone-having-to-say-something-on-instagram/",
    "timestamp": "2025-07-09T14:09:28Z"
  },
  {
    "title": "Macron Says France And Britain Will ‘Save Europe' As He Starts State Visit To The UK",
    "description": "Macron said Europe must reduce its dependence “on both the U.S. and China.”",
    "link": "https://www.huffpost.com/entry/macron-france-britain-save-europe_n_686e73d1e4b07e11dd9a21ea",
    "timestamp": "2025-07-09T14:08:38Z"
  },
  {
    "title": "SCOOP: Oklahoma gubernatorial race heats up early with $1.6M ad buy for 'America First' candidate",
    "description": "Oklahoma Conservative Coalition invests $1.6 million ad buy for Charles McCall's 2026 governor bid, highlighting his work with Governor Kevin Stitt and President Donald Trump.",
    "link": "https://www.foxnews.com/politics/scoop-oklahoma-gubernatorial-race-heats-up-early-1-6m-ad-buy-america-first-candidate",
    "timestamp": "2025-07-09T14:08:26Z"
  },
  {
    "title": "What Trump’s big tax law could mean for the youngest Americans",
    "description": "The impact of the massive spending bill that President Donald Trump signed into law on Independence Day is expected to filter down to infants and toddlers — a segment of the population that is particularly vulnerable to cuts to the federal social safety net.",
    "link": "https://nypost.com/2025/07/09/us-news/what-trumps-big-tax-law-could-mean-for-the-youngest-americans/",
    "timestamp": "2025-07-09T14:06:19Z"
  },
  {
    "title": "CNN Fact-Checker Exposes 'A Whole Bunch Of False Claims' From Trump's Cabinet Meeting",
    "description": "Daniel Dale tackled the president's most excessive falsehoods on issues including tariffs, inflation and the so-called Big Beautiful Bill.",
    "link": "https://www.huffpost.com/entry/cnn-fact-checker-daniel-dale-false-claims-trump-cabinet_n_686e3d67e4b041f69cfdd800",
    "timestamp": "2025-07-09T14:04:58Z"
  },
  {
    "title": "Trump Admin Suing California for Allegedly Violating Title IX",
    "description": "The move comes a day after the CDE and CIF denied numerous demands from the administration to ban male athletes from female sports.\nThe post Trump Admin Suing California for Allegedly Violating Title IX first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/trump-admin-suing-california-for-allegedly-violating-title-ix/",
    "timestamp": "2025-07-09T14:04:50Z"
  },
  {
    "title": "UK workforce exposed if global trade war gets worse - BoE",
    "description": "Trade tariffs could increase the risk of some businesses falling behind on loans, while a high proportion of the UK workforce is in sectors more exposed to global shocks, the Bank of England has warned.",
    "link": "https://www.rte.ie/news/business/2025/0709/1522666-uk-workforce-exposed-if-global-trade-war-gets-worse-boe/",
    "timestamp": "2025-07-09T14:04:48Z"
  },
  {
    "title": "Searchers in helicopters and on horseback comb Texas flood debris for missing people",
    "description": "Crews are using backhoes and their bare hands to dig through piles of debris after the Texas flash floods",
    "link": "https://www.bostonherald.com/2025/07/09/search-continues-texas-floods/",
    "timestamp": "2025-07-09T14:03:29Z"
  },
  {
    "title": "WATCH: Comedian details ‘weird’ Kamala Harris interview that was so bad, it never aired",
    "description": "'First they rode the bacon. Then they overrode the bacon. Then I tried to override their override by saying: I didn't just do all this work for no reason. I'm gonna make it work'",
    "link": "https://www.wnd.com/2025/07/watch-comedian-details-weird-kamala-harris-interview-that/",
    "timestamp": "2025-07-09T14:02:07Z"
  },
  {
    "title": "Vulnerable House Dem facing heat for 'dodging' questions about socialist Mamdani's rise",
    "description": "Democratic Rep. Josh Riley is facing heat from his political opponents for remaining quiet about where he stands on socialist upstart Zohran Mamdani in New York City.",
    "link": "https://www.foxnews.com/politics/vulnerable-house-dem-facing-heat-for-dodging-questions-about-socialist-mamdanis-rise",
    "timestamp": "2025-07-09T14:01:38Z"
  },
  {
    "title": "Trump's next Fed chair pick already comes with a credibility problem",
    "description": "If leading the Federal Reserve isn't challenging enough, the next central bank chair faces an additional burden: credibility issues now that President Donald Trump has stepped up efforts to exert a heavy hand on monetary policy.\nWhoever the successful candida…",
    "link": "https://biztoc.com/x/9aab91e6901ee39e",
    "timestamp": "2025-07-09T14:01:04Z"
  },
  {
    "title": "Trump slams Powell amid rumors over Fed pick",
    "description": "United States President Donald Trump took to Truth Social on Wednesday, seemingly taking another jab at Federal Reserve Chair Jerome Powell.Trump wrote \"ANYBODY BUT 'TOO LATE,'\"a nickname the presiden...",
    "link": "https://biztoc.com/x/6e43035e3e0bc968",
    "timestamp": "2025-07-09T14:00:48Z"
  },
  {
    "title": "What Happened To Weapons For Ukraine, Mr. Trump? Ask Secretary Sh*tfaced! (Again.)",
    "description": "Someone left the arms out of Ukraine.",
    "link": "https://www.wonkette.com/p/what-happened-to-weapons-for-ukraine",
    "timestamp": "2025-07-09T14:00:44Z"
  },
  {
    "title": "Trump's staff will have to 'wheel him around' like Weekend at Bernie's as health worsens, expert warns - NewsBreak",
    "description": "Former Johns Hopkins Professor John Gartner has spoken out about Trump's alleged cognitive decline as concern about the man in control of the US' nuclear w",
    "link": "https://www.newsbreak.com/share/4096540390678-trump-s-staff-will-have-to-wheel-him-around-like-weekend-at-bernie-s-as-health-worsens-expert-warns?s=a2&amp;share_destination_id=MjA4MTUxNTItMTc1MjA2OTM0NTczNg%3D%3D&amp;pd=01PKyGbu&amp;hl=en_US&amp;send_time=1752069345&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q3-control%2Cns_foryou_blend_exp_25q2-v5%2Cns_foryou_rank_exp_25q2-v2",
    "timestamp": "2025-07-09T14:00:37Z"
  },
  {
    "title": "The Enemy of My Enemy Is My Elon (The Bulwark)",
    "description": "The Bulwark:\nThe Enemy of My Enemy Is My Elon  —  He may be a loathsome conspiracist.  But in this case, he may be a useful, loathsome conspiracist.  —  No friendship with Donald Trump can last for very long.  We've seen plenty of examples: Michael Cohen, “Sl…",
    "link": "https://www.memeorandum.com/250709/p47",
    "timestamp": "2025-07-09T14:00:25Z"
  },
  {
    "title": "Judges keep blocking Trump's policies despite US Supreme Court injunction curbs (Reuters)",
    "description": "Reuters:\nJudges keep blocking Trump's policies despite US Supreme Court injunction curbs  —  President Donald Trump called the U.S. Supreme Court's June 27 decision limiting the ability of federal judges to use nationwide injunctions to block his policies “a …",
    "link": "https://www.memeorandum.com/250709/p46",
    "timestamp": "2025-07-09T14:00:25Z"
  },
  {
    "title": "‘The Suicide Squad’: How Democrats keep blowing themselves up",
    "description": "Donald Trump, now in his second term, has executed a political masterstroke — cornering Democrats into the unpopular side of nearly every 80/20 issue. From transgender athletes in women’s sports and the DOGE to the airstrike on Iran’s nuclear sites, he’s boxe…",
    "link": "https://www.theblaze.com/columns/opinion/the-suicide-squad-how-democrats-keep-blowing-themselves-up",
    "timestamp": "2025-07-09T14:00:00Z"
  },
  {
    "title": "Dan Rather: Robert Kennedy Jr. Is a Public Menace",
    "description": "Dan Rather and his team at Steady writes fearlessly about the dangers posed by Trump and his unqualified Cabinet. In this post, he discusses the scandal of appointing Robert F. Kennedy Jr. as Secretary of Health and Human Services. Kennedy has no medical or s…",
    "link": "https://dianeravitch.net/2025/07/09/dan-rather-robert-kennedy-jr-is-a-public-menace/",
    "timestamp": "2025-07-09T14:00:00Z"
  },
  {
    "title": "Scottish police preparing for possible Trump visit to Scotland this month",
    "description": "(Fixes word order in headline) Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/09/scottish-police-preparing-for-possible-trump-visit-to-scotland-this-month",
    "timestamp": "2025-07-09T13:58:00Z"
  },
  {
    "title": "Trump's 'big beautiful bill' slashes CFPB funding: What it means for you",
    "description": "A tax and spending package Trump signed July 4 nearly halves the watchdog's annual funding. Resources may be stretched to police consumer financial laws.",
    "link": "https://www.cnbc.com/2025/07/09/trump-big-beautiful-bill-slashes-cfpb-funding-what-it-means.html",
    "timestamp": "2025-07-09T13:56:55Z"
  },
  {
    "title": "Dem Rep. Gomez claims ICE is targeting 'anybody that is Brown' in immigration raids",
    "description": "California Democratic Rep. Jimmy Gomez claimed that immigration officers were not targeting MS-13 members or criminals during a recent ICE raid in Los Angeles.",
    "link": "https://www.foxnews.com/media/dem-rep-gomez-claims-ice-targeting-anybody-brown-immigration-raids",
    "timestamp": "2025-07-09T13:56:36Z"
  },
  {
    "title": "Trump demands his own appointee be replaced with 'anyone' else",
    "description": "President Donald Trump continued his war against Federal Reserve chairman Jay Powell on Wednesday, demanding he be replaced in a Truth Social post.\"ANYBODY BUT 'TOO LATE,'\" Trump wrote — referencing his nickname for Powell of \"Mr. Too Late,\" for not reducing …",
    "link": "https://www.rawstory.com/trump-powell-2673040432/",
    "timestamp": "2025-07-09T13:56:25Z"
  },
  {
    "title": "Israel says it launched ‘special, targeted operations’ in southern Lebanon",
    "description": "Army shares video of troops on ground in 'targeted nighttime operation' amid near-daily attacks against neighbour.",
    "link": "https://www.aljazeera.com/news/2025/7/9/israel-launches-special-targeted-operations-in-southern-lebanon",
    "timestamp": "2025-07-09T13:52:30Z"
  },
  {
    "title": "Stocks open higher on Wall Street as trade talks press ahead",
    "description": "Stocks are opening higher on Wall Street as the Trump administration seeks to win more deals with global trading partners.",
    "link": "https://www.bostonherald.com/2025/07/09/stock-market-trade-deal-talks/",
    "timestamp": "2025-07-09T13:49:53Z"
  },
  {
    "title": "The right’s meltdown over Jeffrey Epstein, explained",
    "description": "In February 2000, Donald Trump, his then-girlfriend and now-wife former model Melania Knauss, Jeffrey Epstein, and British socialite Ghislaine Maxwell. | Davidoff Studios/Getty Images \nAmid all the controversies of President Donald Trump’s second term so far,…",
    "link": "https://biztoc.com/x/75449f6e34776a36",
    "timestamp": "2025-07-09T13:49:46Z"
  },
  {
    "title": "Why you should already own an AR-15",
    "description": "Both sides of the Supreme Court have already acknowledged America's Rifle as in common use. This is why you should have a couple on hand. These are dark days for the ghouls of the gun-grabber lobby. Even though pro-freedom patriots have suffered some setbacks…",
    "link": "https://freerepublic.com/focus/f-chat/4327670/posts",
    "timestamp": "2025-07-09T13:49:00Z"
  }
]