[
  {
    "title": "America or Europe? Why Trump’s Ukraine U-turn is a fork in the road for New Zealand",
    "description": "New Zealand foreign policy has long sought to balance various alliances with a commitment to the rules-based international order. It now faces its greatest test in decades.",
    "link": "https://theconversation.com/america-or-europe-why-trumps-ukraine-u-turn-is-a-fork-in-the-road-for-new-zealand-251459",
    "timestamp": "2025-03-04T23:52:27Z"
  },
  {
    "title": "The questions ChatGPT shouldn’t answer",
    "description": "Chatbots canâ\u0080\u0099t think, and increasingly I am wondering whether their makers are capable of thought as well. In mid-February OpenAI released a document called a model spec laying out how ChatGPT is supposed to â\u0080\u009cthink,â\u0080\u009d particularly about ethics. A couple …",
    "link": "https://www.theverge.com/openai/624209/chatgpt-ethics-specs-humanism",
    "timestamp": "2025-03-04T23:52:04Z"
  },
  {
    "title": "'He’s going to work something out': Trump reportedly already walking back tariffs",
    "description": "Not even a day into the new tariffs against Canada and Mexico, President Donald Trump is considering some form of compromise on them — but not a full repeal or another total delay, reported Bloomberg News on Tuesday.“Both the Mexicans and the Canadians were o…",
    "link": "https://www.rawstory.com/trump-tariffs-2671266187/",
    "timestamp": "2025-03-04T23:51:09Z"
  },
  {
    "title": "Trump asks federal courts to clear his criminal record. Meanwhile, his NJ liquor licenses remain at risk of revocation",
    "description": "President Donald Trump's lawyers are trying again to clear his criminal record.\nJim WATSON / AFP\nTrump still faces potential revocation of his NJ liquor licenses due to his hush-money conviction.\nHis lawyers now want the federal courts to take control of his …",
    "link": "https://biztoc.com/x/082bea9b19a5ed41",
    "timestamp": "2025-03-04T23:51:01Z"
  },
  {
    "title": "B.C.’s Stemcell Technologies feels the squeeze as U.S. research funding cuts, tariffs hit business",
    "description": "One of Canada’s largest life sciences companies, Stemcell Technologies Canada Inc., was already contending with tough conditions in the drug development market it serves before Donald Trump was re-elected as U.S. president last fall.\nNow, the Vancouver maker …",
    "link": "https://biztoc.com/x/7af9023f0b390b9a",
    "timestamp": "2025-03-04T23:50:57Z"
  },
  {
    "title": "Republican Sen. Eric Schmitt discusses Trump’s new tariffs ahead of address to Congress",
    "description": "President Donald Trump is just hours away from addressing a joint session of Congress, where he's expected to tout his administration's accomplishments and lay out his agenda for the rest of the year. Sen. Eric Schmitt, a Republican from Missouri, joins Geoff…",
    "link": "https://biztoc.com/x/3494bed47bd8c40b",
    "timestamp": "2025-03-04T23:50:56Z"
  },
  {
    "title": "Google met with Trump’s DOJ in effort to avoid historic break-up of search giant",
    "description": "The Justice Department is currently pursuing two anti-monopoly cases against Google - one over search and another over advertising technology.",
    "link": "https://nypost.com/2025/03/04/business/google-met-with-trumps-doj-in-effort-to-avoid-historic-break-up-of-search-giant/",
    "timestamp": "2025-03-04T23:50:52Z"
  },
  {
    "title": "Polymarket Traders Bet on Canadian Tariff Cuts After Lutnick Hints at Negotiations",
    "description": "Howard Lutnick told Fox Business that President Donald Trump is willing to 'meet in the middle' on tariffs, but not eliminate them entirely – yet.",
    "link": "https://www.coindesk.com/markets/2025/03/04/polymarket-bettors-warming-to-idea-of-canadian-tariff-reduction-after-lutnick-hint",
    "timestamp": "2025-03-04T23:50:47Z"
  },
  {
    "title": "Polymarket Traders Bet on Canadian Tariff Cuts After Lutnick Hints at Negotiations",
    "description": "Howard Lutnick told Fox Business that President Donald Trump is willing to 'meet in the middle' on tariffs, but not eliminate them entirely – yet.",
    "link": "https://www.coindesk.com/markets/2025/03/05/polymarket-bettors-warming-to-idea-of-canadian-tariff-reduction-after-lutnick-hint",
    "timestamp": "2025-03-04T23:50:47Z"
  },
  {
    "title": "Lutnick: US could announce trade deal Wednesday with Mexico and Canada after imposing tariffs | CNN Business",
    "description": "US Commerce Secretary Howard Lutnick said that President Donald Trump could announce a trade deal with Mexico and Canada as soon as tomorrow, just one day after the US imposed punishing tariffs on the two nations and sparked retaliatory levies.",
    "link": "https://www.cnn.com/2025/03/04/business/us-tariffs-trade-deal-mexico-canada/index.html",
    "timestamp": "2025-03-04T23:50:05Z"
  },
  {
    "title": "Will TSMC escape tariffs with pledge for $100B in U.S. chip manufacturing plants?",
    "description": "It’s been a whirlwind of news on the tariff front and Taiwan has avoided tariffs for now. But the timing of a $100 billion commitment by TSMC to build chip manufacturing plants in the U.S. may have helped. Taiwan Semiconductor Manufacturing Co. is the biggest…",
    "link": "https://venturebeat.com/business/will-tsmc-escape-tariffs-with-pledge-for-100b-in-u-s-chip-manufacturing-plants/",
    "timestamp": "2025-03-04T23:50:00Z"
  },
  {
    "title": "Jim Cramer talks Trump tariffs and investor woes after Dow tumbles",
    "description": "CNBC's Jim Cramer laid out Wall Street's concerns over a trade war from Trump tariffs and offered his take on how the White House might view the issue.",
    "link": "https://www.cnbc.com/2025/03/04/jim-cramer-talks-trump-tariffs-and-investor-woes-after-dow-tumbles.html",
    "timestamp": "2025-03-04T23:49:46Z"
  },
  {
    "title": "Several Canadian Provinces Ban US Alcohol In Trump Tariff Response",
    "description": "Multiple Canadian provinces, including Ontario and Quebec, banned the sale of US alcohol on Tuesday, part of a broad national retaliation against import tariffs imposed by US President Donald Trump.",
    "link": "https://www.ndtv.com/world-news/several-canadian-provinces-ban-us-alcohol-in-trump-tariff-response-7850074",
    "timestamp": "2025-03-04T23:49:17Z"
  },
  {
    "title": "Trump to address joint session of Congress at 9 p.m. ET with DOGE, tariffs and Ukraine looming",
    "description": "Democrats have invited as guests people who lost their federal government jobs in an effort overseen by Elon Musk and his DOGE team.",
    "link": "https://www.cnbc.com/2025/03/04/trump-address-joint-session-congress.html",
    "timestamp": "2025-03-04T23:49:16Z"
  },
  {
    "title": "Trump won't care about these Democrats' silent pink protest — but it's not for him",
    "description": "On Tuesday night, when Trump stands at the podium under the domed ceiling of the Capitol, he will see women dressed in pink standing in front of him. He won’t care.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/democratic-congresswomen-pink-trump-joint-session-speech-rcna194782",
    "timestamp": "2025-03-04T23:47:25Z"
  },
  {
    "title": "Who is Andrew Lennox, the veteran appearing beside Slotkin during Democrat rebuttal?",
    "description": "Sen. Elissa Slotkin, D-Mich., will be accompanied Tuesday night during her rebuttal speech to President Donald Trump’s address to Congress by Andrew Lennox, a Marine Corps veteran and former Veterans Affairs employee who was among the many probationary employ…",
    "link": "https://www.foxnews.com/politics/who-andrew-lennox-veteran-appearing-beside-sen-slotkin-during-democrat-rebuttal",
    "timestamp": "2025-03-04T23:47:24Z"
  },
  {
    "title": "Macron, Starmer, Merz: Righteous, Confused and Unwilling Politicians: Europe’s Dangerous Ukrainian Predicament",
    "description": "There is something deeply moving about the ignorance and scatty nature of politicians.  At points, it can even be endearing.  In the apparently wide wake left by the mauling of Ukrainian President Volodymyr Zelensky in front of the press at …\nThe post Macron,…",
    "link": "https://www.globalresearch.ca/europe-ukrainian-predicament/5881361",
    "timestamp": "2025-03-04T23:46:47Z"
  },
  {
    "title": "DOGE slashes nearly $1M for alpaca farming in Peru, other questionable grants in latest wasteful spending cut",
    "description": "DOGE announced on Tuesday it canceled a number of grants, including those for alpaca farming in Peru and reducing social discrimination against recyclers in Bolivia.",
    "link": "https://www.foxnews.com/politics/doge-slashes-nearly-1m-alpaca-farming-peru-other-questionable-grants-latest-wasteful-spending-cut",
    "timestamp": "2025-03-04T23:46:19Z"
  },
  {
    "title": "CNN Anchor Calls Out MAGA Senator for Calling Trudeau ‘Governor’ — He Replies ‘It Was 100% Intentional’",
    "description": "Sen. Markwayne Mullin (R-OK) referred to Canadian Prime Minister Justin Trudeau as \"Governor\" during an appearance on CNN Tuesday -- a term he insisted to anchor Kasie Hunt \"was 100% intentional.\"\nThe post CNN Anchor Calls Out MAGA Senator for Calling Trudeau…",
    "link": "https://www.mediaite.com/tv/cnn-anchor-calls-out-maga-senator-for-calling-trudeau-governor-he-replies-it-was-100-intentional/",
    "timestamp": "2025-03-04T23:46:07Z"
  },
  {
    "title": "Accidentally the truth? Watch Democrat in Congress stun with Freudian slip",
    "description": "'We are going to continue to speak ... '",
    "link": "https://www.wnd.com/2025/03/accidentally-the-truth-watch-democrat-in-congress-stun-with-freudian-slip/",
    "timestamp": "2025-03-04T23:45:41Z"
  },
  {
    "title": "'Devastated' and 'incredibly disappointed': Alberta beef and canola to be hard hit by Trump tariffs",
    "description": "Alberta food producers are bracing for uncertainty in the short term and the potential for a complete reorientation of how they do business in the long term now that U.S. President Donald Trump's 25-per-cent tariffs have taken effect.",
    "link": "https://www.cbc.ca/news/canada/calgary/alberta-beef-canola-trump-tariffs-reaction-1.7474185",
    "timestamp": "2025-03-04T23:45:00Z"
  },
  {
    "title": "China to unveil 2025 growth goals eyeing trade war woes",
    "description": "<p>BEIJING - China's leadership will on Wednesday unveil their growth goals for the coming year as they eye a mounting trade war with the United States and deepening economic doldrums at home.</p>",
    "link": "https://www.bangkokpost.com/business/general/2973328/china-to-unveil-2025-growth-goals-eyeing-trade-war-woes",
    "timestamp": "2025-03-04T23:45:00Z"
  },
  {
    "title": "House GOP Celebrates Early Wins Ahead Of Trump’s Prime Time Address",
    "description": "House Republicans are in a celebratory mood in the lead-up to President Donald Trump's joint address to Congress Tuesday evening.",
    "link": "https://dailycaller.com/2025/03/04/house-gop-celebrates-early-wins-ahead-of-trumps-prime-time-address/",
    "timestamp": "2025-03-04T23:44:55Z"
  },
  {
    "title": "MSDNC: Left-Wing Network Hires Banking Scion Married to Biden Climate Adviser",
    "description": "MSNBC, the embattled left-wing network sometimes referred to as \"MSDNC,\" hired another liberal journalist with close ties to the Democratic Party. Jackie Alemany is leaving the similarly embattled Washington Post, where her reporting focused on the Jan. 6 inc…",
    "link": "https://freebeacon.com/media/msdnc-left-wing-network-hires-banking-scion-married-to-biden-climate-adviser/",
    "timestamp": "2025-03-04T23:44:09Z"
  },
  {
    "title": "Trump Has Reportedly ‘Sidelined’ Secretary of State Marco Rubio, Who ‘Is Often the Last To Know When Foreign Policy Decisions Are Made’",
    "description": "President Donald Trump \"has effectively sidelined\" Secretary of State Marco Rubio, who is often out of the loop when major foreign policy decisions are made, according to Vanity Fair.\nThe post Trump Has Reportedly ‘Sidelined’ Secretary of State Marco Rubio, W…",
    "link": "https://www.mediaite.com/politics/trump-has-reportedly-sidelined-secretary-of-state-marco-rubio-who-is-often-the-last-to-know-when-foreign-policy-decisions-are-made/",
    "timestamp": "2025-03-04T23:43:22Z"
  },
  {
    "title": "Trudeau blasts Trump’s ‘dumb’ tariffs",
    "description": "Canadian Prime Minister Justin Trudeau has condemned US President Donald Trump for imposing tariffs on Canadian imports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613691-trudeau-trump-dumb-tariffs/",
    "timestamp": "2025-03-04T23:43:20Z"
  },
  {
    "title": "Stephen A. Smith spars with Whoopi Goldberg on the real cause of Democrats’ 2024 loss",
    "description": "ESPN host Stephen A. Smith challenged Whoopi Goldberg during \"The View\" on Tuesday over the Democratic Party's messaging problem after the liberal host attempted to defend the messaging by comparing it to President Donald Trump.",
    "link": "https://nypost.com/2025/03/04/media/stephen-a-smith-spars-with-whoopi-goldberg-on-the-real-cause-of-democrats-2024-loss/",
    "timestamp": "2025-03-04T23:42:44Z"
  },
  {
    "title": "IRS Plans to Slash Half Its Workforce",
    "description": "Trump and his allies have long railed against the IRS and said they want to abolish it in favor of revenue from foreign sources.",
    "link": "https://www.newsweek.com/irs-plans-slash-workforce-half-2039669",
    "timestamp": "2025-03-04T23:40:24Z"
  },
  {
    "title": "Trump asks federal courts to clear his criminal record. Meanwhile, his NJ liquor licenses remain at risk of revocation.",
    "description": "Trump wants the federal courts to take control of his state hush-money appeal. The liquor licenses for his New Jersey golf clubs remain on the line.",
    "link": "https://www.businessinsider.com/trump-asks-federal-courts-help-nj-liquor-licenses-remain-risk-2025-3",
    "timestamp": "2025-03-04T23:40:23Z"
  },
  {
    "title": "Republican Sen. Eric Schmitt discusses Trump’s new tariffs ahead of address to Congress",
    "description": "President Donald Trump is just hours away from addressing a joint session of Congress, where he's expected to tout his administration's accomplishments and lay out his agenda for the rest of the year. Sen. Eric Schmitt, a Republican from Missouri, joins Geoff…",
    "link": "https://www.pbs.org/newshour/show/republican-sen-eric-schmitt-discusses-trumps-new-tariffs-ahead-of-address-to-congress",
    "timestamp": "2025-03-04T23:40:07Z"
  },
  {
    "title": "EU Could Respond to Trump’s Tariffs Through Financial and Technological Sectors",
    "description": "Since the end of 2024, shortly after winning the US presidential election, Donald Trump announced that he would impose tariffs on the European Union to remedy the trade deficit. These threats are very close to becoming reality, especially since the …\nThe post…",
    "link": "https://www.globalresearch.ca/eu-trump-tariffs-financial-technological-sectors/5881371",
    "timestamp": "2025-03-04T23:40:01Z"
  },
  {
    "title": "Trump could scale back Canada, Mexico tariffs Wednesday, Lutnick says (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump could scale back Canada, Mexico tariffs Wednesday, Lutnick says … WATCH NOW  —  President Donald Trump will “probably” announce tariff compromise deals with Canada and Mexico soon, Commerce Secretary Howard Lutnick said Tuesday.…",
    "link": "https://www.memeorandum.com/250304/p156",
    "timestamp": "2025-03-04T23:40:00Z"
  },
  {
    "title": "Watch Anything But the Trump Speech",
    "description": "I hate politainment at any time. But I have to ask–why in the name of God would you watch Donald Trump’s speech tonight? To do so is actually a sign of sickness–a masochistic desire to be beaten and humiliated by our erstwhile strongman. As is the case with a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/watch-anything-but-the-trump-speech",
    "timestamp": "2025-03-04T23:40:00Z"
  },
  {
    "title": "VMware fixed three actively exploited zero-days in ESX products",
    "description": "Broadcom has addressed three VMware zero-day vulnerabilities in ESX products that are actively exploited in the wild. Broadcom released security updates to address three VMware zero-day vulnerabilities in ESX products that are actively exploited in the wild. …",
    "link": "https://securityaffairs.com/174911/security/vmware-fixed-three-actively-exploited-zero-days-in-esx-products.html",
    "timestamp": "2025-03-04T23:39:27Z"
  },
  {
    "title": "'Give the guy a break': Ontario Premier Doug Ford defends Gretzky amid backlash over his support for Trump",
    "description": "Ontario Premier Doug Ford says Canadians should give Wayne Gretzky a break. The hockey legend has come under fire for supporting U.S. President Donald Trump by attending his inauguration in January and visiting him several times in recent months at Mar-a-Lago…",
    "link": "https://www.cbc.ca/sports/hockey/nhl/doug-ford-says-canadians-should-give-wayne-gretzky-a-break-1.7474684",
    "timestamp": "2025-03-04T23:38:25Z"
  },
  {
    "title": "Hundreds protest president at Annapolis #50501 rally",
    "description": "Hundreds of protesters converged at the Maryland State House to protest President Donald Trump's actions since taking office.",
    "link": "https://www.wbaltv.com/article/protest-annapolis-president-donald-trump-elon-musk-50501/64036725",
    "timestamp": "2025-03-04T23:37:31Z"
  },
  {
    "title": "Trump threatens to pull funding from campuses that allow ‘illegal protests,’ endorses mask ban",
    "description": "Trump vows to cut federal funding for campuses allowing 'illegal protests,' deport foreign agitators, and supports a mask ban at demonstrations.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-844735",
    "timestamp": "2025-03-04T23:35:47Z"
  },
  {
    "title": "King Charles, Prince Harry Seem to Differ When It Comes to Trump",
    "description": "Harry didn’t criticize Donald Trump directly, but some thought the timing seemed a bit suspicious.",
    "link": "https://cafemom.com/entertainment/king-charles-invite-prince-harry-comments-donald-trump",
    "timestamp": "2025-03-04T23:35:39Z"
  },
  {
    "title": "Nearly half of Israelis support advancing ceasefire negotiations",
    "description": "A KAN News poll found that Israelis are split on ceasefire talks, Gaza aid, and Netanyahu’s leadership amid ongoing war.",
    "link": "https://www.jpost.com/israel-news/article-844732",
    "timestamp": "2025-03-04T23:34:18Z"
  },
  {
    "title": "Florida launches criminal probe into MAGA brothers facing human trafficking allegations",
    "description": "Florida's top law enforcement officer has launched a criminal probe against Andrew and Tristan Tate, right-wing influencers who returned to the United States last week facing allegations including human trafficking in Romania, according to a report.The Tate b…",
    "link": "https://www.rawstory.com/andrew-tate-2671266351/",
    "timestamp": "2025-03-04T23:34:17Z"
  },
  {
    "title": "What You Should Do",
    "description": "Okay, people. You keep asking me, “Mike, but what should we do?” I am going to condescend to you now, about what you should do. The only resistance worth a damn is the one where you stop calculating the odds and start living your truth without reservation. Wh…",
    "link": "https://www.techdirt.com/2025/03/04/what-you-should-do/",
    "timestamp": "2025-03-04T23:34:12Z"
  },
  {
    "title": "Keeping Score: Executive Orders Attack Trans Community; Americans Need Paid Leave and Childcare Policies; Unvaccinated Measles Cases Soar",
    "description": "In every issue of Ms., we track research on our progress in the fight for equality, catalogue can’t-miss quotes from feminist voices and keep tabs on the feminist movement’s many milestones. We’re Keeping Score online, too—in this biweekly roundup.\nThis week:…",
    "link": "https://msmagazine.com/2025/03/04/keeping-score-feminist-news-trans-rights-paid-leave-childcare-measles/",
    "timestamp": "2025-03-04T23:33:44Z"
  },
  {
    "title": "Zelenskyy and Netanyahu – A Tale of Two White House Visits",
    "description": "Since Friday, global headlines have been dominated by one subject, the fiery White House meeting between Volodymyr Zelenskyy and Donald Trump. Coming amidst recent discussions between the United States and Russia on ending the war in Ukraine, the Oval Office …",
    "link": "https://www.globalresearch.ca/zelenskyy-netanyahu-two-white-house-visits/5881388",
    "timestamp": "2025-03-04T23:31:44Z"
  },
  {
    "title": "Hope the short-term pain of Trump’s tariffs bring long-term gain",
    "description": "President Donald Trump has cast conventional wisdom to the wind and imposed hefty tariffs on Canada, Mexico and China, triggering an over-the-top freakout from ideologues and Trump-haters.",
    "link": "https://nypost.com/2025/03/04/opinion/hope-the-short-term-pain-of-trumps-tariffs-bring-long-term-gain/",
    "timestamp": "2025-03-04T23:31:26Z"
  },
  {
    "title": "Trump to lay out vision to Congress amid Ukraine and trade tensions",
    "description": "WASHINGTON: President Donald Trump will tout radical plans to reshape the US government and end the Ukraine war Tuesday (Mar 4) as he addresses Congress for the first time since his blisterin",
    "link": "https://www.channelnewsasia.com/world/donald-trump-lay-out-vision-congress-ukraine-trade-tensions-4977326",
    "timestamp": "2025-03-04T23:31:00Z"
  },
  {
    "title": "'Criminal Probe' Launched Into Tate Brothers Amid Rape, Trafficking Charges",
    "description": "Florida&#039;s attorney general said that a criminal investigation has been opened into self-described misogynist influencer Andrew Tate and his brother, who flew to the US last week from Romania, where they faced rape and human trafficking charges.",
    "link": "https://www.ndtv.com/world-news/criminal-probe-launched-into-tate-brothers-amid-rape-trafficking-charges-7850040",
    "timestamp": "2025-03-04T23:30:59Z"
  },
  {
    "title": "Wall Street falls again, wipes out post-election gains for S&P 500",
    "description": "Stocks racked up more losses on Wall Street Tuesday as a trade war between the U.S. and its key trading partners escalated, wiping out all of the gains since Election Day for the S&P 500.\n\n\nThe Trump administration imposed tariffs on imports from Canada and M…",
    "link": "https://www.voanews.com/a/wall-street-falls-again-wipes-out-post-election-gains-for-s-p-500-/7997781.html",
    "timestamp": "2025-03-04T23:30:59Z"
  },
  {
    "title": "Hoping for a better future",
    "description": "Ukrainian athletes Vladyslav Heraskevych and Yaroslav Lavreniuk aren’t sure what their futures are.",
    "link": "https://www.stltoday.com/sports/professional/other/article_91f80d40-4b72-54dd-a725-56015d2fd3ba.html",
    "timestamp": "2025-03-04T23:30:00Z"
  },
  {
    "title": "Alina Habba Hit With Backlash for Comments on Veterans: 'Pathetic'",
    "description": "Habba spoke to reporters on Tuesday afternoon, ahead of President Donald Trump's address to Congress.",
    "link": "https://www.newsweek.com/alina-habba-hit-backlash-comments-veterans-pathetic-2039639",
    "timestamp": "2025-03-04T23:28:58Z"
  },
  {
    "title": "Trump is about to face an audience with the power to make or break his agenda. And it’s not Congress",
    "description": "When President Donald Trump speaks to a joint session of Congress Tuesday night, the audience with the most sway over his second-term agenda won't be the lawmakers. It's the Supreme Court justices. \nTrump’s blitz of early executive actions have triggered a ts…",
    "link": "https://biztoc.com/x/7490b47dd89bf29e",
    "timestamp": "2025-03-04T23:28:51Z"
  },
  {
    "title": "Hong Kong-based company to sell Panama Canal ports",
    "description": "US-based investment company BlackRock will buy two ports after Donald Trump's increased interest in taking back control of the key shipping route.",
    "link": "https://www.bbc.com/news/articles/clyzlk259g2o",
    "timestamp": "2025-03-04T23:28:31Z"
  },
  {
    "title": "It Is All About Energy! US in Artificial Intelligence Race Driving Quest for Minerals",
    "description": "Elon Musk’s Starlink is increasingly facing competition from China’s SpaceSail. Meanwhile, Trump’s new “energy Tsar” has said that Washington is doomed to lose the “AI arms race” without fossil fuels. Energy production does seem to be a priority for the …\nThe…",
    "link": "https://www.globalresearch.ca/us-artificial-intelligence-race-driving-quest-minerals/5881395",
    "timestamp": "2025-03-04T23:26:52Z"
  },
  {
    "title": "Trump’s tariffs lead to swift response, as Maura Healey warns of rising energy costs in Massachusetts",
    "description": "The United States' largest trading partners responded to President Donald Trump’s plan to place tariffs on their nations' goods with tariffs of their own, and among the first economic casualties may be Bay State ratepayers, according to the governor.",
    "link": "https://www.bostonherald.com/2025/03/04/trumps-tariffs-lead-to-swift-response-as-maura-healey-warns-of-rising-energy-costs-in-massachusetts/",
    "timestamp": "2025-03-04T23:25:02Z"
  },
  {
    "title": "Trump and Zelensky’s Week of Whiplash",
    "description": "After days of chaos, is the U.S.-Ukraine minerals deal still alive?",
    "link": "https://foreignpolicy.com/2025/03/04/us-ukraine-mineral-deal-rare-earth/",
    "timestamp": "2025-03-04T23:24:31Z"
  },
  {
    "title": "Starliner commander says politics not involved in extended mission",
    "description": "Starliner commander Barry Wilmore offered an even-handed response to questions about the intrusion of politics into his ISS mission.",
    "link": "https://www.cbsnews.com/news/starliner-iss-butch-wilmore-politics-update/",
    "timestamp": "2025-03-04T23:23:21Z"
  },
  {
    "title": "Portland Protesters Rally for “Tesla Takedown”",
    "description": "As Tesla stocks tumble, hundreds of people are holding regular protests outside the Portland dealership to protest Elon Musk’s government takeover.\n \n by Taylor Griggs\n \n \n \n Hundreds of people gathered outside Portland’s Tesla dealership during the afternoon…",
    "link": "https://www.portlandmercury.com/news/2025/03/04/47672077/portland-protesters-rally-for-tesla-takedown",
    "timestamp": "2025-03-04T23:20:00Z"
  },
  {
    "title": "These stock market sectors are getting hit hardest by the trade war",
    "description": "Technology, financial and energy companies took the biggest hits on Canada’s main stock index after tariffs went into effect. Find out more.",
    "link": "https://financialpost.com/investing/stock-market-sectors-hit-hardest-trade-war",
    "timestamp": "2025-03-04T23:18:49Z"
  },
  {
    "title": "FBI and DOJ headquarters are among more than 440 federal buildings listed for potential sale",
    "description": "The General Services Administration's list includes some of the country’s most recognizable buildings.",
    "link": "https://www.denverpost.com/2025/03/04/federal-buildings-potential-sale/",
    "timestamp": "2025-03-04T23:18:42Z"
  },
  {
    "title": "FBI and DOJ headquarters are among more than 440 federal buildings listed for potential sale",
    "description": "The General Services Administration's list includes some of the country’s most recognizable buildings.",
    "link": "https://www.bostonherald.com/2025/03/04/federal-buildings-potential-sale/",
    "timestamp": "2025-03-04T23:18:42Z"
  },
  {
    "title": "Americans are racing to prep for tariffs, but many aren’t ready — especially this group",
    "description": "Americans are racing to prep for tariffs, but many aren’t ready — especially this group\nThe annual price tag on more tariffs could be over $1,200, by one estimate\nThe sweeping tariffs that President Donald Trump has been talking about since he was on the camp…",
    "link": "https://biztoc.com/x/33dd8707584e7fab",
    "timestamp": "2025-03-04T23:18:18Z"
  },
  {
    "title": "Live: Ukraine fall-out, trade wars set scene for Trump's speech to Congress",
    "description": "As the US president promises to \"tell it like it is\" in his first speech to the new Congress, schisms with America's allies are growing wider.",
    "link": "https://www.abc.net.au/news/2025-03-05/live-blog-donald-trump-joint-session-congress-speech/105006512",
    "timestamp": "2025-03-04T23:16:45Z"
  },
  {
    "title": "Who is Edan Alexander, the American-Israeli hostage whose parents will be at Trump’s address",
    "description": "President Trump will spotlight Israeli hostages in his speech, with Edan Alexander’s parents attending to keep attention on their son's captivity in Gaza.",
    "link": "https://www.jpost.com/israel-news/article-844734",
    "timestamp": "2025-03-04T23:16:19Z"
  },
  {
    "title": "Trump Official Hints Canada, Mexico Could See Relief From US Tariffs",
    "description": "The US commerce secretary on Tuesday said President Donald Trump could dial down huge tariffs on Canada and Mexico this week while maintaining pressure on China, hours after Canada&#039;s premier attacked the United States&#039; &quot;dumb&quot; trade war.",
    "link": "https://www.ndtv.com/world-news/trump-official-hints-canada-mexico-could-see-relief-from-us-tariffs-7849982",
    "timestamp": "2025-03-04T23:16:13Z"
  },
  {
    "title": "American interests regain control of key parts of Panama Canal",
    "description": "President Trump had threatened to take it 'back' from Chinese influence",
    "link": "https://www.wnd.com/2025/03/american-interests-regain-control-of-key-parts-of-panama-canal/",
    "timestamp": "2025-03-04T23:15:58Z"
  },
  {
    "title": "How Trump Is Killing the U.S. Defense Industry",
    "description": "It turns out that abandoning allies and tossing out security guarantees is bad for business.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-zelensky-vance-ukraine-defense-arms/",
    "timestamp": "2025-03-04T23:15:18Z"
  },
  {
    "title": "Trump doesn't seem to know why he launched a giant trade war (Eric Levitz/Vox)",
    "description": "Eric Levitz / Vox:\nTrump doesn't seem to know why he launched a giant trade war  —  Donald Trump just imposed a 25 percent tariff on virtually all goods produced by America's two largest trading partners — Canada and Mexico.  He simultaneously established a 2…",
    "link": "https://www.memeorandum.com/250304/p149",
    "timestamp": "2025-03-04T23:15:01Z"
  },
  {
    "title": "Two hugely important questions about Trump's trade war (Andrew Prokop/Vox)",
    "description": "Andrew Prokop / Vox:\nTwo hugely important questions about Trump's trade war  —  Donald Trump's long-threatened trade war has finally begun.  —  The Trump administration slapped big new tariffs on Canada, Mexico, and China on Tuesday, spurring retaliation from…",
    "link": "https://www.memeorandum.com/250304/p150",
    "timestamp": "2025-03-04T23:15:01Z"
  },
  {
    "title": "Europe proposes new $150B defense fund to beef up languid armies: ‘Era of rearmament’",
    "description": "But the new spending, over five years, still pales in comparison to the US, which has earmarked $883 billion for defense this year alone.",
    "link": "https://nypost.com/2025/03/04/world-news/europe-proposes-new-150-billion-defense-fund-to-beef-up-militaries/",
    "timestamp": "2025-03-04T23:14:42Z"
  },
  {
    "title": "CNN Pundit Slams Zelenskyy For Not Wearing A Tie — But An Expert Makes This Damning Point",
    "description": "Scott Jennings was blasted on social media after he griped about the Ukrainian president's attire during his disastrous meeting with President Trump at the Oval Office.",
    "link": "https://www.huffpost.com/entry/scott-jennings-cnn-volodymyr-zelenskyy-donald-trump-oval-office-suit_n_67c718d3e4b02e07ca7030f8",
    "timestamp": "2025-03-04T23:12:59Z"
  },
  {
    "title": "'Fly my pretties': Senator warns of 'dark threats' from Musk's army of 'flying monkeys'",
    "description": "Sen. Sheldon Whitehouse (D-RI) attacked President Donald Trump and tech billionaire Elon Musk and his internet crew of \"flying monkeys\" willing to lash out at any perceived foes. MSNBC host Nicolle Wallace began the discussion Tuesday afternoon by asking abou…",
    "link": "https://www.rawstory.com/elon-musk-x-2671266199/",
    "timestamp": "2025-03-04T23:12:11Z"
  },
  {
    "title": "Watch Live: Trump’s Speech to Joint Session of Congress",
    "description": "President Donald Trump delivers the first joint congressional address of his second presidency.",
    "link": "https://time.com/7262845/watch-trump-joint-speech-congress/",
    "timestamp": "2025-03-04T23:11:55Z"
  },
  {
    "title": "The Inter-American Foundation, an agency whose primary action was to issue foreign grants ($60M budget), has been reduced to its statutory minimum (1 active employee).",
    "description": "Examples of grants that were cancelled in the process: - $903,811 for alpaca farming in Peru - $364,500 to reduce social discrimination of recyclers in Bolivia - $813,210 for vegetable gardens in El Salvador - $323,633 to promote cultural understanding of Ven…",
    "link": "https://freerepublic.com/focus/f-news/4302111/posts",
    "timestamp": "2025-03-04T23:11:42Z"
  },
  {
    "title": "How Trump's Tariffs Will Disrupt Key Industries in Mexico",
    "description": "The imposition of the tariffs on Mexico and Canada represent a violation of the USMCA and could trigger a tariff war, experts say.",
    "link": "https://www.wired.com/story/how-trumps-tariffs-will-disrupt-key-industries-in-mexico/",
    "timestamp": "2025-03-04T23:11:12Z"
  },
  {
    "title": "Exclusive – Rep. Brandon Gill: Democrats Are 'The Party of Perverts'",
    "description": "Democrats are exposing their true colors by worshiping at the alter of radical transgenderism at the expense of the safety of women and girls, Rep. Brandon Gill (R-TX) told Breitbart News Tuesday in an exclusive interview.\nThe post Exclusive – Rep. Brandon Gi…",
    "link": "https://www.breitbart.com/politics/2025/03/04/exclusive-rep-brandon-gill-democrats-are-the-party-of-perverts/",
    "timestamp": "2025-03-04T23:11:05Z"
  },
  {
    "title": "Trump slaps Canadian energy exports with 10% tariffs, leaving oilpatch 'deeply disappointed'",
    "description": "U.S. President Donald Trump finally followed through with his tariff threat against Canada on Tuesday, and it's an action that's already sent a shock through the energy sector, the country's most powerful economic force.",
    "link": "https://www.cbc.ca/news/canada/calgary/canada-us-trade-tariffs-trump-alberta-oil-energy-sector-1.7474193",
    "timestamp": "2025-03-04T23:09:55Z"
  },
  {
    "title": "A Georgia Woman Eloquently Called Out Trump, And TikTok Users Can’t Get Enough",
    "description": "Ginny Lim told HuffPost she hopes she motivates others to call their representatives and demand they take action.",
    "link": "https://www.huffpost.com/entry/a-georgia-woman-eloquently-called-out-trump-and-tiktok-users-cant-get-enough_n_67c7221be4b02e07ca703585",
    "timestamp": "2025-03-04T23:09:20Z"
  },
  {
    "title": "'A Really Bad Idea': ICC Director Describes How Trump's Tariffs On Mexico And Canada Will Impact You",
    "description": "Andrew Wilson, Deputy Secretary-General and Global Policy Director at the ICC, outlines howTrump's tariffs could impact the everyday consumer and global economy.",
    "link": "https://www.forbes.com/sites/forbestv/2025/03/04/a-really-bad-idea-icc-director-describes-how-trumps-tariffs-on-mexico-and-canada-will-impact-you/",
    "timestamp": "2025-03-04T23:08:54Z"
  },
  {
    "title": "Fox News' Zelenskyy interview watched by 6.4 million viewers, surpassing NBC, CBS evening newscasts",
    "description": "\"Special Report with Bret Baier\" netted a whopping 6.4 million viewers who tuned in to Friday's highly-anticipated interview with Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.foxnews.com/media/fox-news-zelenskyy-interview-watched-6-4-million-viewers-surpassing-nbc-cbs-evening-newscasts",
    "timestamp": "2025-03-04T23:08:28Z"
  },
  {
    "title": "Trump Unveils $100 Billion TSMC Investment",
    "description": "Taiwan Semiconductor Manufacturing Co., the world’s top producer of AI chips, plans to invest an additional $100 billion in US plants that will boost its chip output on American soil and support President Donald Trump’s goal of increasing domestic manufacturi…",
    "link": "https://biztoc.com/x/e897732fcd05d440",
    "timestamp": "2025-03-04T23:07:07Z"
  },
  {
    "title": "Trump’s new tariffs could especially sting the Texas economy",
    "description": "The Donald Trump administration’s 25% tariffs on Canada and Mexico started Tuesday, and their effects will ripple across the U.S. economy and abroad. But one state is particularly exposed: Texas. It has what amounts to roughly a $300 billion trade relationshi…",
    "link": "https://biztoc.com/x/830b313741589eb7",
    "timestamp": "2025-03-04T23:07:06Z"
  },
  {
    "title": "How Day 1 of Trump’s new tariffs feels for businesses caught in the middle",
    "description": "By now, you’ve heard about the Donald Trump administration’s tariffs that went into effect Tuesday morning. To recap the details, there’s a 25% duty on goods from Mexico and Canada, plus an additional 10% tariff on Chinese imports. That’s on top of the tariff…",
    "link": "https://biztoc.com/x/0b1d51bfb9720c73",
    "timestamp": "2025-03-04T23:07:01Z"
  },
  {
    "title": "Trump could scale back Canada, Mexico tariffs Wednesday, Lutnick says",
    "description": "President Donald Trump will “probably” announce tariff compromise deals with Canada and Mexico soon, Commerce Secretary Howard Lutnick said Tuesday.",
    "link": "https://biztoc.com/x/a8b0130369b72e9c",
    "timestamp": "2025-03-04T23:06:42Z"
  },
  {
    "title": "LGBTQ+ Democrats will take a stand during Trump’s joint address  — including skipping it entirely",
    "description": "As President Donald Trump\r\n prepares to deliver his first joint address to Congress since returning to office, LGBTQ\r\n+ members of Congress are making it clear that they will not let his administration’s policies go unchallenged. It will be the first time tha…",
    "link": "https://www.advocate.com/politics/lgbtq-democrats-trump-joint-session",
    "timestamp": "2025-03-04T23:05:50Z"
  },
  {
    "title": "FBI And DOJ Headquarters Among More Than 440 Federal Buildings Listed For Potential Sale",
    "description": "The Trump administration has placed some of the country’s most iconic and well-known federal buildings on the potential chopping block.",
    "link": "https://www.huffpost.com/entry/ap-us-doge-federal-buildings_n_67c78654e4b0afa088b6d05d",
    "timestamp": "2025-03-04T23:05:11Z"
  },
  {
    "title": "Trump Plunges U.S. Into Trade War With Canada, Mexico, China",
    "description": "All three countries have vowed retaliatory measures against Washington.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-tariffs-canada-mexico-china-trade-war-trudeau-sheinbaum/",
    "timestamp": "2025-03-04T23:05:09Z"
  },
  {
    "title": "US President Donald Trump temporarily suspends all military aid to Ukraine",
    "description": "NEW YORK/WASHINGTON, March 4: US President Donald Trump has temporarily suspended, with immediate effect, the delivery of all American military aid to Ukraine, just days after an unprecedented showdown with Ukrainian President Volodymyr Zelensky in the Oval O…",
    "link": "https://thehillstimes.in/international/us-president-donald-trump-temporarily-suspends-all-military-aid-to-ukraine",
    "timestamp": "2025-03-04T23:05:00Z"
  },
  {
    "title": "The Trade War Is Here",
    "description": "Canada, Mexico, and China vow retaliatory measures against U.S. tariffs.",
    "link": "https://foreignpolicy.com/2025/03/04/trump-trade-war-tariffs-canada-mexico-china-trudeau-sheinbaum/",
    "timestamp": "2025-03-04T23:04:58Z"
  },
  {
    "title": "Some Democrats to skip Trump's joint address to Congress",
    "description": "Several Democrats have said they do not plan to attend President Donald Trump's joint address to Congress on Tuesday.",
    "link": "https://abcnews.go.com/Politics/democrats-skip-trumps-joint-address-congress/story?id=119441526",
    "timestamp": "2025-03-04T23:04:08Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Late Tuesday, Commerce Secretary Howard Lutnick hinted that the U.S. might meet Canada and Mexico somewhere \"in the middle\" on tariffs.",
    "link": "https://www.cnbc.com/2025/03/04/stock-market-today-live-updates.html",
    "timestamp": "2025-03-04T23:04:02Z"
  },
  {
    "title": "GOP Is ‘Trying to Gaslight’ Americans Into Believing Trump Has Made Their Lives Better, Tara Setmayer Says | Video",
    "description": "\"I don't think that's what the American people voted for,\" the former GOP comms director adds\nThe post GOP Is ‘Trying to Gaslight’ Americans Into Believing Trump Has Made Their Lives Better, Tara Setmayer Says | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gop-gaslight-americans-believing-trump/",
    "timestamp": "2025-03-04T23:02:37Z"
  },
  {
    "title": "Gavin Newsom & his allies just forced 12 historic family farms & dairies out of Point Reyes National Seashore in California.",
    "description": "Gavin Newsom & his allies just forced 12 historic family farms & dairies out of Point Reyes National Seashore in California. They claim it’s about saving the environment — but the truth couldn't be more different. Here is the true story — and it's heartbreaki…",
    "link": "https://freerepublic.com/focus/f-news/4302109/posts",
    "timestamp": "2025-03-04T23:01:50Z"
  },
  {
    "title": "Confusion for Visa Applicants, Attorneys After New Forms Announced",
    "description": "The U.S. Citizenship and Immigration Service updated forms without notice Monday, potentially affecting hundreds of applicants.",
    "link": "https://www.newsweek.com/us-visa-forms-changed-green-cards-citizenship-uscis-2039640",
    "timestamp": "2025-03-04T23:01:10Z"
  },
  {
    "title": "Inverse Head And Shoulders Breakout Suggests Bitcoin Price Is Headed To $300,000",
    "description": "The Bitcoin price action is showing strong bullish signals, as a rare Inverse Head and Shoulder pattern has just broken out and retested its neckline. This technical setup suggests that Bitcoin could be gearing up for a mega rally to $300,000 soon. Analyst Fo…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-is-headed-to-300000/",
    "timestamp": "2025-03-04T23:00:34Z"
  },
  {
    "title": "Trump blasts CBS ‘Deface the Nation’ host Margaret Brennan, says ‘anybody on the street’ can do her job",
    "description": "President Trump blasted \"Face the Nation\" moderator Margaret Brennan, suggesting \"anybody on the street\" can do her job when asked about her interview with Marco Rubio.",
    "link": "https://www.foxnews.com/media/trump-blasts-cbs-deface-nation-host-margaret-brennan-says-anybody-street-can-do-her-job",
    "timestamp": "2025-03-04T23:00:17Z"
  },
  {
    "title": "U.S. Bondholders Bear the Burden of Sanctions Against Venezuela",
    "description": "In an interview with The Epoch Times last Saturday, Richard Grenell, Presidential Envoy for Special Missions, said that Donald Trump is committed to doing everything in his power to make the American people stronger and more prosperous. This unwavering focus …",
    "link": "https://oilprice.com/Energy/Energy-General/US-Bondholders-Bear-the-Burden-of-Sanctions-Against-Venezuela.html",
    "timestamp": "2025-03-04T23:00:00Z"
  },
  {
    "title": "Restructuring fuel subsidies to go on",
    "description": "PETALING JAYA: The plans to restructure RON 95 fuel subsidies is on course for implementation in the middle of the year, with consumer groups urging the govern­ment to defer it due to ­rising costs and economic uncertainties tied to the United States' new tra…",
    "link": "https://www.thestar.com.my/news/nation/2025/03/05/restructuring-fuel-subsidies-to-go-on",
    "timestamp": "2025-03-04T23:00:00Z"
  },
  {
    "title": "Effort to Kill IRS Crypto Rule Clears U.S. Senate Hurdle",
    "description": "With a split among Democrats, the Senate resolution to erase the IRS' DeFi-focused crypto broker rule passed with a massive majority and is now up to the House.",
    "link": "https://www.coindesk.com/policy/2025/03/04/effort-to-kill-irs-crypto-rule-clears-u-s-senate-hurdle",
    "timestamp": "2025-03-04T22:59:06Z"
  }
]