[
  {
    "title": "Education Dept. says it will give billions in remaining withheld grants to schools",
    "description": "The Trump administration is releasing billions of dollars in grants to schools for adult literacy, English language instruction and other programs, the Education Department said Friday.",
    "link": "https://nypost.com/2025/07/25/us-news/education-dept-says-it-will-give-billions-in-remaining-withheld-grants-to-schools/",
    "timestamp": "2025-07-25T19:36:37Z"
  },
  {
    "title": "House Progressives Demand Answers From Noem on Masked ICE Agents",
    "description": "Pressing the Trump administration to explain its rationale for allowing federal agents to don masks and drive unmarked vehicles when carrying out immigration raids and arrests, two Democratic members of Congress on Friday pointed to numerous times in recent m…",
    "link": "https://www.commondreams.org/news/police-mask",
    "timestamp": "2025-07-25T19:36:21Z"
  },
  {
    "title": "FCC Commissioner Gomez: Trump Engaged in 'Campaign of Censorship and Control' of Media",
    "description": "Friday on MSNBC's \"Chris Jansing Reports,\" FCC Commissioner Anna Gomez said President Donald Trump has been carrying out a \"campaign of censorship and control\" over the media.\nThe post FCC Commissioner Gomez: Trump Engaged in ‘Campaign of Censorship and Contr…",
    "link": "https://www.breitbart.com/clips/2025/07/25/fcc-commissioner-gomez-trump-engaged-in-campaign-of-censorship-and-control-of-media/",
    "timestamp": "2025-07-25T19:35:36Z"
  },
  {
    "title": "Trump’s Job Approval Is Down, But Not Due to the Epstein Files",
    "description": "Trump’s job approval is down, but not due to the Epstein files. The president gets low marks for his handling of the scandal. But polls suggest other issues are driving the popularity dip.",
    "link": "http://nymag.com/intelligencer/article/trump-job-approval-is-down-but-not-due-to-the-epstein-files.html",
    "timestamp": "2025-07-25T19:35:00Z"
  },
  {
    "title": "Vive La France! The Macrons Sue Candace Owens for Defamation",
    "description": "Barf Bag: There's so much awful in the world that we are now rooting for the French president to bankrupt a conspiracy theorist.",
    "link": "https://www.jezebel.com/vive-la-france-the-macrons-sue-candace-owens-for-defamation",
    "timestamp": "2025-07-25T19:35:00Z"
  },
  {
    "title": "Donald Trump brings war against the Fed to Jay Powell’s home turf - Financial Times",
    "description": "Donald Trump brings war against the Fed to Jay Powell’s home turfFinancial Times What Powell is telling allies as Trump pressures him to resignCNN Powell Tells Trump He Was Wrong About Renovation Costs During Fed VisitThe New York Times Trump visits Federal R…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178468346",
    "timestamp": "2025-07-25T19:34:35Z"
  },
  {
    "title": "Trump Challenges Media to Talk About Bill Clinton, Larry Summers When Discussing Jeffrey Epstein",
    "description": "President Donald Trump challenged establishment reporters on Friday to speak about former President Bill Clinton and his former Treasury secretary, Larry Summers, when it comes to disgraced financier Jeffrey Epstein. \nThe post Trump Challenges Media to Talk A…",
    "link": "https://www.breitbart.com/politics/2025/07/25/trump-challenges-media-to-talk-about-bill-clinton-larry-summers-when-discussing-jeffrey-epstein/",
    "timestamp": "2025-07-25T19:32:46Z"
  },
  {
    "title": "Two high-ranking NOAA employees connected to 'Sharpiegate' incident put on leave",
    "description": "Two top National Oceanic and Atmospheric Administration officials who both played a role in the high-profile “Sharpiegate” investigation at the agency were placed on administrative leave this week.",
    "link": "https://www.nbcnews.com/science/science-news/two-high-ranking-noaa-employees-connected-sharpiegate-incident-put-lea-rcna221113",
    "timestamp": "2025-07-25T19:32:33Z"
  },
  {
    "title": "Rep. Ro Khanna thinks the Epstein files could help Democrats 'fight Trump effectively'",
    "description": "Rep. Ro Khanna, a California Democrat who has been pushing to release the Jeffrey Epstein files, says the fight is an effective tool to combat Donald Trump.",
    "link": "https://biztoc.com/x/7068cc3d2c40383a",
    "timestamp": "2025-07-25T19:32:29Z"
  },
  {
    "title": "Today Is a Day of Independence for the Tin Foil Hatters and Their Descendants",
    "description": "Having spent the last four years under investigation as an alleged \"domestic terrorist,\" I can't tell you how cock-a-hoop I am over Director of National Intelligence (DNI) Tulsi Gabbard's bunker buster report on the deep state reptiles' (the true insurrection…",
    "link": "https://freerepublic.com/focus/f-news/4330768/posts",
    "timestamp": "2025-07-25T19:32:13Z"
  },
  {
    "title": "Today Is a Day of Independence for the Tin Foil Hatters and Their Descendants",
    "description": "Having spent the last four years under investigation as an alleged \"domestic terrorist,\" I can't tell you how cock-a-hoop I am over Director of National Intelligence (DNI) Tulsi Gabbard's bunker buster report on the deep state reptiles' (the true insurrection…",
    "link": "https://freerepublic.com/focus/f-bloggers/4330768/posts",
    "timestamp": "2025-07-25T19:32:13Z"
  },
  {
    "title": "Trump's Bringing In Murderers, He's Bringing In Rapists",
    "description": "At this rate he'll need to bring in someone to eat the dogs and cats.",
    "link": "https://www.wonkette.com/p/trumps-bringing-in-murderers-hes",
    "timestamp": "2025-07-25T19:32:05Z"
  },
  {
    "title": "Democratic senators demand Trump investigate Americans killed in the West Bank",
    "description": "More than two dozen Democratic senators are demanding the Trump administration investigate the deaths of Americans in the West Bank, where Israeli settlers, backed by Israeli military, have at times used violence to expand their annexation efforts.",
    "link": "https://www.msnbc.com/top-stories/latest/west-bank-settlers-americans-killed-senators-rcna221108",
    "timestamp": "2025-07-25T19:32:05Z"
  },
  {
    "title": "“Another Big Lie”: Trump’s EPA Plans to Stop Regulating Greenhouse Gases",
    "description": "Donald Trump is coming for the “holy grail” of climate regulations. As multiple media outlets reported this week, the administration plans to roll back the “endangerment finding,” an Obama-era Environmental Protection Agency decision at the center of the gove…",
    "link": "https://www.motherjones.com/environment/2025/07/trump-epa-greenhouse-emissions-endangerment-ruling/",
    "timestamp": "2025-07-25T19:31:41Z"
  },
  {
    "title": "Oil Falls as US Trade Deal Optimism Wanes, Dollar Strengthens",
    "description": "Oil fell as the dollar strengthened and conviction waned that the US will reach agreements with key trade partners ahead of a deadline next week.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-falls-as-us-trade-deal-optimism-wanes-dollar-strengthens",
    "timestamp": "2025-07-25T19:31:28Z"
  },
  {
    "title": "California lawmakers urge Trump admin to halt cuts to national labs",
    "description": "Sens. Adam Schiff and Alex Padilla, along with Rep. Zoe Lofgren, said budget cuts to national laboratories have already led to layoffs, with some other labs warning that “they may need to start laying off thousands of scientists and technical staff in the nea…",
    "link": "https://www.nextgov.com/policy/2025/07/california-lawmakers-urge-trump-admin-halt-cuts-national-labs/407006/",
    "timestamp": "2025-07-25T19:31:00Z"
  },
  {
    "title": "Here's why prosecutors didn't require a full confession from Bryan Kohberger",
    "description": "Bryan Kohberger declined to make any statement as he was sentenced Wednesday. Experts say understanding motive can sometimes help those grieving, but it's not legally necessary for conviction.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_4bee101a-8a99-5f9b-9e10-ee0aa9d258f6.html",
    "timestamp": "2025-07-25T19:30:00Z"
  },
  {
    "title": "The Irish Times view on handling Donald Trump: a lesson on how to respond",
    "description": "Fed chair Jerome Powell provided a fascinating fact-check in real time",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/07/25/the-irish-times-view-on-handling-donald-trump-a-lesson-on-how-to-respond/",
    "timestamp": "2025-07-25T19:30:00Z"
  },
  {
    "title": "Donald Trump lands in Scotland for leader talks and golf course visits",
    "description": "The US president will meet UK Prime Minister Keir Starmer and Scotland's First Minister John Swinney during his four-day trip.",
    "link": "https://www.bbc.com/news/live/cev0vpkgw4gt?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-25T19:28:31Z"
  },
  {
    "title": "'The Orban Playbook': Trump Assault on Media Matters Seen as Dire Warning to Other Critics",
    "description": "U.S. President Donald Trump and his allies have been waging legal war for months against liberal media watchdog Media Matters for America, and a report from The New York Times on Friday claimed that the organization is now in dire financial straits as it's be…",
    "link": "https://www.commondreams.org/news/media-matters-lawsuit",
    "timestamp": "2025-07-25T19:28:26Z"
  },
  {
    "title": "US Military Kills Senior ISIS Leader, Two Sons, in Early-Morning Raid in Syria",
    "description": "American troops conducted a successful raid in Syria to keep the Islamic State from trying to regain power.",
    "link": "https://www.westernjournal.com/us-military-kills-senior-isis-leader-two-sons-early-morning-raid-syria/",
    "timestamp": "2025-07-25T19:24:37Z"
  },
  {
    "title": "Trump floats tariff 'rebate' for consumers. That could be a challenge, experts say",
    "description": "President Donald Trump said he's considering a tariff \"rebate\" for some Americans. If authorized, it's unclear whether it could come as a stimulus check.",
    "link": "https://www.cnbc.com/2025/07/25/trump-stimulus-check-tariff-rebate.html",
    "timestamp": "2025-07-25T19:24:17Z"
  },
  {
    "title": "Coke bottles bitter US economic formula",
    "description": "NEW YORK, July 23 (Reuters Breakingviews) - Mexico is a frequent target of Donald Trump’s ire, but he prefers the Coke sold there. After holding conversations with the president, Coca-Cola (KO.N), opens new tab unveiled plans to roll out a version of its sign…",
    "link": "https://freerepublic.com/focus/f-chat/4330767/posts",
    "timestamp": "2025-07-25T19:23:52Z"
  },
  {
    "title": "Ghislaine Maxwell ‘Wants a Pardon’ From Trump According to Fox News’ David Spunt",
    "description": "Longtime Jeffrey Epstein associate Ghislaine Maxwell is reportedly seeking a pardon from President Donald Trump, according to Fox News reporter David Spunt.\nThe post Ghislaine Maxwell ‘Wants a Pardon’ From Trump According to Fox News’ David Spunt first appear…",
    "link": "https://www.mediaite.com/media/news/ghislaine-maxwell-wants-a-pardon-from-trump-according-to-fox-news-david-spunt/",
    "timestamp": "2025-07-25T19:23:46Z"
  },
  {
    "title": "BP to sell US onshore wind business as it shifts back to oil",
    "description": "The company intends to offload the business for an undisclosed sum to LS Power as part of plan to shed US$20 billion in assets.",
    "link": "https://www.nationalobserver.com/2025/07/28/news/bp-selling-us-onshore-wind-oil",
    "timestamp": "2025-07-25T19:23:25Z"
  },
  {
    "title": "Love Island UK 2025: When is the final, how to Vote, and what can fans expect?",
    "description": "Love Island final 2025: Love Island UK fans are eagerly awaiting the 2025 final, predicted to air on Monday, August 4th, based on the show's typical eight-week run. The final episode, hosted by Maya Jama, will see the remaining couples compete for the public'…",
    "link": "https://economictimes.indiatimes.com/news/international/uk/love-island-final-2025-news-love-island-uk-2025-when-is-the-final-how-to-vote-and-what-can-fans-expect/articleshow/122911878.cms",
    "timestamp": "2025-07-25T19:21:00Z"
  },
  {
    "title": "George Santos, ex-NY Rep. who lied during his campaign, reports to prison",
    "description": "Former U.S. Rep. George Santos arrives for a court hearing at U.S. District Court Eastern District of New York Long Island Courthouse on August 19, 2024 in West Islip, New York.\n \n\nSantos will serve his time in southern New Jersey, a federal prisons spokesper…",
    "link": "https://gothamist.com/news/george-santos-ex-ny-rep-who-lied-during-his-campaign-will-report-to-prison-friday",
    "timestamp": "2025-07-25T19:19:00Z"
  },
  {
    "title": "Zelensky triggered a street revolt – and it may not stop at where it is now",
    "description": "What began as a political purge has turned into a civil backlash. The war in Ukraine now includes a battle over power and accountability. Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621999-zelensky-triggered-street-revolt/",
    "timestamp": "2025-07-25T19:18:39Z"
  },
  {
    "title": "Trump's approval rating drops to second-term low as support from independents craters",
    "description": "President Donald Trump's approval rating has dropped to 37%, according to a new Gallup poll, the lowest mark of his second term.",
    "link": "https://www.usatoday.com/story/news/politics/2025/07/25/trump-approval-rating-low-gallup-independents/85375721007/",
    "timestamp": "2025-07-25T19:17:04Z"
  },
  {
    "title": "Musk’s Grok AI is now on the Kalshi, Polymarket betting apps. What could go wrong?",
    "description": "Polymarket exploded into the public eye during the 2024 election between President Donald Trump and President Joe Biden.",
    "link": "https://www.cnbc.com/2025/07/25/musk-grok-kalshi-polymarket.html",
    "timestamp": "2025-07-25T19:15:52Z"
  },
  {
    "title": "Fewer than half of ICE arrests under Trump are convicted criminals",
    "description": "Despite Trump administration rhetoric accusing Democrats of protecting violent criminals and drug-dealing immigrants, the administration’s arrests have been catching a smaller share of criminals overall, and a smaller share of people convicted of violent and …",
    "link": "https://freerepublic.com/focus/f-chat/4330766/posts",
    "timestamp": "2025-07-25T19:15:51Z"
  },
  {
    "title": "Trump Admin Identifies Gang Immigration 'Loophole'",
    "description": "Criminal groups have exploited a program giving children legal status, USCIS said.",
    "link": "https://www.newsweek.com/special-immigrant-juvenile-visa-gang-exploitation-uscis-report-2104231",
    "timestamp": "2025-07-25T19:15:21Z"
  },
  {
    "title": "Trump says US will sell 'so much' beef to Australia",
    "description": "Australia has relaxed curbs on US beef imports, but Canberra says its decision isn't related to trade talks.",
    "link": "https://www.rnz.co.nz/news/business/568067/trump-says-us-will-sell-so-much-beef-to-australia",
    "timestamp": "2025-07-25T19:15:10Z"
  },
  {
    "title": "FCC to Appoint a Babysitter to Make Sure CBS Isn’t Anti-Trump",
    "description": "FCC commissioner Brendan Carr says CBS will have a \"bias monitor\" who reports directly to the president.",
    "link": "https://gizmodo.com/fcc-to-appoint-a-babysitter-to-make-sure-cbs-isnt-anti-trump-2000634566",
    "timestamp": "2025-07-25T19:15:08Z"
  },
  {
    "title": "The “jurisprudence” of bad faith",
    "description": "Mark Joseph Stern makes two points about Trump v. Boyle, the Roberts Court’s latest unreasoned shadow docket order handing Trump royalist powers. The first is that the consequences of the order will be dire: The Supreme Court expanded Donald Trump’s power yet…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-jurisprudence-of-bad-faith",
    "timestamp": "2025-07-25T19:14:31Z"
  },
  {
    "title": "'Immigration is killing Europe': Trump issues warning to leaders as he arrives in Scotland",
    "description": "Donald Trump has landed in Scotland ahead of a four-day trip, which includes high-level meetings, praising Sir Keir Starmer as \"a good man\" but also calling illegal migration a \"horrible invasion\" that was \"killing Europe\".",
    "link": "https://news.sky.com/story/immigration-is-killing-europe-donald-trump-issues-warning-to-leaders-as-he-arrives-in-scotland-13401882",
    "timestamp": "2025-07-25T19:14:00Z"
  },
  {
    "title": "Second Day of Ghislaine Maxwell’s Interview to Deputy AG Todd Blanche Wraps – Attorney Says She Answered Questions ‘About 100 People’ – Her Team Will Seek a Trump Pardon",
    "description": "Maxwell knows ‘where the bodies are buried’. As the Jeffrey Epstein trafficking ring becomes a bigger story by the day, the DOJ Number 2 official, Deputy Attorney General Todd Blanche, headed down to Florida to meet in person with the convicted sex trafficker…",
    "link": "https://freerepublic.com/focus/f-news/4330765/posts",
    "timestamp": "2025-07-25T19:11:17Z"
  },
  {
    "title": "Fox News Called Out for Editing Fed Chair Fact-Checking Trump: 'Jerome Powell Should Sue'",
    "description": "Fox News played video omitting the moment President Trump was fact-checked by Federal Reserve Chair Jerome Powell, sparking accusations of bias and calls to sue",
    "link": "https://www.ibtimes.com/fox-news-called-out-editing-fed-chair-fact-checking-trump-jerome-powell-should-sue-3779472",
    "timestamp": "2025-07-25T19:11:16Z"
  },
  {
    "title": "South Park creators offer cheeky ‘apology’ for episode mocking Trump",
    "description": "The creators of South Park are giving a cheeky “apology” for the popular cartoon show’s season premier that mocked President Donald Trump. “We’re terribly...",
    "link": "https://www.nydailynews.com/2025/07/25/south-park-trump-episode-apology-reaction/",
    "timestamp": "2025-07-25T19:11:00Z"
  },
  {
    "title": "Donald Trump brings war against the Fed to Jay Powell’s home turf",
    "description": "A required part of this site couldn’t load. This may be due to a browser\nextension, network issues, or browser settings. Please check your\nconnection, disable any ad blockers, or try using a different browser.",
    "link": "https://biztoc.com/x/e7d629a54505a46a",
    "timestamp": "2025-07-25T19:10:19Z"
  },
  {
    "title": "Trump Leaves DC for Scotland to Open New Golf Course",
    "description": "President Donald Trump is traveling to Scotland on Friday as his family’s business prepares for the Aug. 13 opening of a new golf course in Aberdeenshire billed as “the greatest 36 holes in golf.” While there, Trump will talk trade with British Prime Minister…",
    "link": "https://biztoc.com/x/9353724eea17cb07",
    "timestamp": "2025-07-25T19:09:57Z"
  },
  {
    "title": "Florida governor announces deportation flights from Alligator Alcatraz",
    "description": "Ron DeSantis, formerly Donald Trump's Republican rival, said that the cadence for removal flights would be 'increasing'.",
    "link": "https://www.aljazeera.com/news/2025/7/25/florida-governor-announces-deportation-flights-from-alligator-alcatraz",
    "timestamp": "2025-07-25T19:08:34Z"
  },
  {
    "title": "Netanyahu, Trump ditch Gaza ceasefire talks",
    "description": "Middle East News: Israeli Prime Minister Benjamin Netanyahu and US President Donald Trump appeared on Friday to abandon Gaza ceasefire negotiations with Hamas, both say.",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/netanyahu-trump-ditch-gaza-ceasefire-talks/articleshow/122912291.cms",
    "timestamp": "2025-07-25T19:07:27Z"
  },
  {
    "title": "Murdoch, Trump, Epstein feud: How Murdoch pounced on Trump’s first MAGA mistake with Epstein files",
    "description": "Rupert Murdoch’s marriage of convenience with Donald Trump might finally be unravelling, and there can only be one winner in their long-running battle for the Republican heartland.",
    "link": "https://www.smh.com.au/business/companies/trump-stumbled-on-epstein-and-rupert-murdoch-has-pounced-20250724-p5mhkm.html",
    "timestamp": "2025-07-25T19:06:19Z"
  },
  {
    "title": "What in the World?",
    "description": "Test yourself on the week of July 19: Japan heads to the polls, Syria reacts to sectarian violence, and Ukraine announces new peace talks.",
    "link": "http://foreignpolicy.com/2025/07/25/news-quiz-japan-election-syria-conflict-druze-congo-m23-peace/",
    "timestamp": "2025-07-25T19:05:19Z"
  },
  {
    "title": "Team Obama Quietly Trying To Stop Americans From Hearing About ‘Russiagate’ Revelations",
    "description": "President Barack Obama's former aides hope to conceal rapidly unfolding revelations about \"Russiagate,\" NBC News reported.",
    "link": "https://dailycaller.com/2025/07/25/obama-world-trying-stop-americans-russiagate-revelations-report/",
    "timestamp": "2025-07-25T19:04:38Z"
  },
  {
    "title": "Todd Chrisley Jokes Julie's Natural Hair Made Him Want to Go Back to Prison",
    "description": "Returning to prison crossed Todd Chrisley’s mind after seeing wife Julie Chrisley with her natural hair upon his release. “I’m not going to lie. When I first saw you, when I got out of that car, I started thinking about going back,” Todd, 56, said during the …",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-jokes-about-seeing-julies-natural-hair-after-prison/#article",
    "timestamp": "2025-07-25T19:04:09Z"
  },
  {
    "title": "World has too much steel, but no one wants to stop making it",
    "description": "Tata Steel in the Netherlands faces challenges despite producing high-grade steel for specialized applications. A global oversupply, largely driven by China's massive production, is causing prices to plummet and impacting profitability.",
    "link": "https://economictimes.indiatimes.com/news/international/business/world-has-too-much-steel-but-no-one-wants-to-stop-making-it/articleshow/122912255.cms",
    "timestamp": "2025-07-25T19:03:48Z"
  },
  {
    "title": "Education Department says it will release billions in grant money withheld from schools",
    "description": "The Trump administration is releasing billions of dollars in grants to schools for adult literacy, English language instruction and other programs, the Education Department said Friday.",
    "link": "https://www.pbs.org/newshour/politics/education-department-says-it-will-release-billions-in-grant-money-withheld-from-schools",
    "timestamp": "2025-07-25T19:03:22Z"
  },
  {
    "title": "Gov. Josh Shapiro Attacks Legislators Protecting Women’s Sports",
    "description": "Pennsylvania Governor Josh Shapiro criticized the proponents of a bill that would ban males from competing in women’s sports in public schools and public universities.... Read More\nThe post Gov. Josh Shapiro Attacks Legislators Protecting Women’s Sports appea…",
    "link": "https://www.dailysignal.com/2025/07/25/gov-shapiro-attacks-legislators-protecting-womens-sports/",
    "timestamp": "2025-07-25T19:03:18Z"
  },
  {
    "title": "Conservative Maverick Rep Throws Hat In Ring For Wide Open Gov Race",
    "description": "Republican South Carolina Rep. Ralph Norman is set to announce that he is stepping into his state's 2026 gubernatorial race on Friday.",
    "link": "https://dailycaller.com/2025/07/25/ralph-norman-south-carolina-governor-race/",
    "timestamp": "2025-07-25T19:03:09Z"
  },
  {
    "title": "U.S. finds five Virginia school districts' trans policies violate Title IX",
    "description": "The U.S. Education Department gave the five Northern Virginia school divisions 10 days to rescind their relevant policies, and \"adopt biology-based definitions of the words \"male\" and \"female\" or face",
    "link": "https://richmond.com/news/state-regional/government-politics/article_be0dccca-eea3-406a-a09f-d1b97bf3165b.html",
    "timestamp": "2025-07-25T19:02:00Z"
  },
  {
    "title": "What Macron says doesn’t matter: Donald Trump",
    "description": "US News: US President Trump on Friday dismissed French President Macron’s plan to recognize a Palestinian state with “what he says doesn’t matter.” “He’s a ver.",
    "link": "https://timesofindia.indiatimes.com/world/us/what-macron-says-doesnt-matter-donald-trump/articleshow/122912217.cms",
    "timestamp": "2025-07-25T19:01:51Z"
  },
  {
    "title": "Rep. Ro Khanna thinks the Epstein files could help Democrats 'fight Trump effectively'",
    "description": "Rep. Ro Khanna, a California Democrat who has been pushing to release the Jeffrey Epstein files, says the fight is an effective tool to combat Donald Trump.",
    "link": "https://www.nbcnews.com/politics/politics-news/rep-ro-khanna-epstein-files-help-democrats-fight-trump-rcna220849",
    "timestamp": "2025-07-25T19:01:20Z"
  },
  {
    "title": "Russia rules out Putin-Zelensky meeting until end of peace talks (Washington Post)",
    "description": "Washington Post:\nRussia rules out Putin-Zelensky meeting until end of peace talks  —  The announcement appears to preclude any kind of top-level meeting or breakthrough ahead of the 50-day deadline for an agreement set down by President Donald Trump.  —  just…",
    "link": "https://www.memeorandum.com/250725/p78",
    "timestamp": "2025-07-25T19:00:34Z"
  },
  {
    "title": "UN’s Highest Court Issues ‘Strongly Worded Letter’ Threatening Climate Reparations for Carbon Emitters",
    "description": "The United Nations: \"You will never find a more wretched hive of scum and villainy.\"\nThe post UN’s Highest Court Issues ‘Strongly Worded Letter’ Threatening Climate Reparations for Carbon Emitters first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/uns-highest-court-issues-strongly-worded-letter-threatening-climate-reparations-for-carbon-emitters/",
    "timestamp": "2025-07-25T19:00:33Z"
  },
  {
    "title": "'South Park' creators reveal battle with network over wild Trump depiction, joke they're 'terribly sorry'",
    "description": "Trey Parker and Matt Stone addressed controversy surrounding the \"South Park\" season 27 premiere depicting President Trump's penis while speaking at San Diego Comic-Con on Thursday.",
    "link": "https://www.foxnews.com/media/south-park-creators-reveal-battle-network-over-wild-trump-depiction-joke-theyre-terribly-sorry",
    "timestamp": "2025-07-25T19:00:22Z"
  },
  {
    "title": "Electric vehicle tax credits set to end in 2025: What you need to know",
    "description": "Edmunds reports EV tax credits will end September 30, 2025. New buyers can claim up to $7,500; used buyers up to $4,000, with eligibility requirements.",
    "link": "https://www.edmunds.com/fuel-economy/the-ins-and-outs-of-electric-vehicle-tax-credits.html",
    "timestamp": "2025-07-25T19:00:05Z"
  },
  {
    "title": "The reality in Gaza shows Israel is at risk of becoming a global pariah",
    "description": "The reality of the situation on the ground in Gaza, and the spectre of children dying of malnutrition or starvation, sits at such extraordinary odds with the language of spokespeople for both the Netanyahu government and the IDF.",
    "link": "https://www.abc.net.au/news/2025-07-26/israel-starvation-aid-global-pressure-gaza/105555092",
    "timestamp": "2025-07-25T19:00:00Z"
  },
  {
    "title": "Is the Aussie dollar strengthening or is it just an illusion?",
    "description": "The once almighty American dollar has been falling against almost every major currency ever since Donald Trump became the 47th US president.",
    "link": "https://www.abc.net.au/news/2025-07-26/australian-dollar-aud-currency-usa-euro/105572616",
    "timestamp": "2025-07-25T19:00:00Z"
  },
  {
    "title": "Jerome Powell Humiliates Trump During Tour Of Federal Reserve",
    "description": "Pres. Trump took a tour of the Federal Reserve's construction project and was made to look like a fool by his most recent rage target. Fed Chairman Jerome Powell would have none of it. \nThe face-painted Trump was there to try to humiliate Jerome Powell over t…",
    "link": "https://crooksandliars.com/2025/07/jerome-powell-humiliates-trump-during-tour",
    "timestamp": "2025-07-25T18:59:41Z"
  },
  {
    "title": "Venezuelan Little League team unable to participate in World Series after visa denial",
    "description": "After winning the Latin America championship, Venezuela won't compete in the Senior Little League World Series after the team's travel visas were denied.",
    "link": "https://www.foxnews.com/sports/venezuelan-little-league-team-unable-participate-world-series-visa-denial",
    "timestamp": "2025-07-25T18:59:16Z"
  },
  {
    "title": "Is Trump actually going to prosecute Obama for 'treason'?",
    "description": "The Jeffrey Epstein scandal is not going away, but President Donald Trump would like to change the subject. That might be why he accused former President Barack Obama of treason this week. The question now is whether Trump's administration will really bring c…",
    "link": "https://biztoc.com/x/39e9a65192b33496",
    "timestamp": "2025-07-25T18:58:51Z"
  },
  {
    "title": "Trump defeats Australia’s mad cow disease restrictions in deal to ship American beef overseas",
    "description": "Australia announced it will reduce restrictions on U.S. beef imports in a move U.S. President Donald Trump’s administration claimed as a major victory over “non-scientific trade barriers.”\nAgriculture Minister Julie Collins said Thursday that relaxing the res…",
    "link": "https://biztoc.com/x/aa7a79eaa280dcd9",
    "timestamp": "2025-07-25T18:58:51Z"
  },
  {
    "title": "Epstein ex-girlfriend Ghislaine Maxwell finishes interviews with Justice Department officials",
    "description": "The imprisoned former girlfriend of Jeffrey Epstein answered questions 'about 100 different people,' her attorney said.",
    "link": "https://www.denverpost.com/2025/07/25/ghislaine-maxwell-interview/",
    "timestamp": "2025-07-25T18:57:26Z"
  },
  {
    "title": "Epstein ex-girlfriend Ghislaine Maxwell finishes interviews with Justice Department officials",
    "description": "The imprisoned former girlfriend of Jeffrey Epstein answered questions 'about 100 different people,' her attorney said.",
    "link": "https://www.bostonherald.com/2025/07/25/ghislaine-maxwell-interview/",
    "timestamp": "2025-07-25T18:57:26Z"
  },
  {
    "title": "Sandra Smith Catches Former Harris Adviser Flat-Footed With Basic Question About Inflation Rate",
    "description": "Fox News host Sandra Smith stumped former Vice President Kamala Harris Senior Adviser Mike Nellis by asking him what the current rate of inflation is.",
    "link": "https://dailycaller.com/2025/07/25/fox-news-host-fools-former-harris-adviser-on-inflation-rate-under-trump/",
    "timestamp": "2025-07-25T18:57:20Z"
  },
  {
    "title": "Ellen DeGeneres gives update on UK living struggles: 'We couldn’t keep up'",
    "description": "Ellen DeGeneresand her wife Portia de Rossimoved to England back in November 2024. During a recent sit-down interview in the town of Cheltenham, UK, with journalist Richard Bacon, the former TV host gave a detailed update on what life has really been like acr…",
    "link": "https://freerepublic.com/focus/f-chat/4330763/posts",
    "timestamp": "2025-07-25T18:57:16Z"
  },
  {
    "title": "Donald Trump says 'great to be in Scotland' as he arrives for golf trip and talks - latest",
    "description": "The US president will meet UK Prime Minister Keir Starmer and Scotland's First Minister John Swinney during his four-day trip.",
    "link": "https://www.bbc.co.uk/news/live/cev0vpkgw4gt",
    "timestamp": "2025-07-25T18:57:12Z"
  },
  {
    "title": "Trump Flat-Out Accuses Obama Of ‘Criminal Acts’ In New Conspiracy Rant To Reporters",
    "description": "President Donald Trump flat-out accused former President Barack Obama of \"criminal acts\" in a new conspiracy rant to reporters.\nThe post Trump Flat-Out Accuses Obama Of ‘Criminal Acts’ In New Conspiracy Rant To Reporters first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-flat-out-accuses-obama-of-criminal-acts-in-new-conspiracy-rant-to-reporters/",
    "timestamp": "2025-07-25T18:56:21Z"
  },
  {
    "title": "Trump floats the possibility of tariff rebate checks - Axios",
    "description": "Trump floats the possibility of tariff rebate checksAxios Trump says he's considering rebate checks for Americans based on tariff revenueCBS News Trump says he may want to give you a tariff rebate check: 'A little rebate for people of a certain income level m…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178468068",
    "timestamp": "2025-07-25T18:56:01Z"
  },
  {
    "title": "Bartiromo: ‘You Can’t Underestimate’ Russiagate’s Damage to Trump — ‘Celebrities Wouldn’t Sing’ For Him",
    "description": "Fox Business’s Maria Bartiromo fumed on Friday that the Russia investigation in President Donald Trump’s first term was the reason that “celebrities wouldn’t sing at big events, at the inauguration.” Bartiromo was speaking with Sen. Ron Johnson (R-WI) about r…",
    "link": "https://www.mediaite.com/media/news/bartiromo-you-cant-underestimate-russiagates-damage-to-trump-celebrities-wouldnt-sing-for-him/",
    "timestamp": "2025-07-25T18:55:44Z"
  },
  {
    "title": "'Lying scumbags!' Bannon explodes at PBS reporter when pressed on Trump threats",
    "description": "Longtime Donald Trump ally Steve Bannon exploded at PBS reporter Mike Wiser during a Frontline interview, first recorded in April and published this week, when confronted over Trump's constant threats and insults against federal judges and asked whether this …",
    "link": "https://www.rawstory.com/steve-bannon-2673760450/",
    "timestamp": "2025-07-25T18:55:38Z"
  },
  {
    "title": "Almost a third of people in Gaza 'not eating for days,' UN warns",
    "description": "Israel faces increasing pressure from Western allies to lift restrictions into the flow of aid into Gaza.",
    "link": "https://www.bbc.com/news/articles/ckgjg81qqwvo",
    "timestamp": "2025-07-25T18:55:38Z"
  },
  {
    "title": "Scotland trip will cost taxpayers $10M -- largely to promote his golf courses...",
    "description": "Scotland trip will cost taxpayers $10M -- largely to promote his golf courses...\r\n\n \n \n \n (First column, 5th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:July 2025 is when MAGA era started to end...\r\nPresident's Hand Make-Up Is Back Days After Last Appearance...",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/trump-scotland-golf-taxpayer-turnberry-b2796021.html",
    "timestamp": "2025-07-25T18:55:37Z"
  },
  {
    "title": "Karoline Leavitt & Lara Trump debut bold MAGA makeovers — you won’t believe the transformation",
    "description": "Explore the viral transformation of Lara Trump and Karoline Leavitt as they debut their bold new  MAGA makeovers  in the spotlight of Donald Trump's 2024 campaign. From old photos showing Lara's natural look to her current glam TV-style appearance, and Karoli…",
    "link": "https://economictimes.indiatimes.com/news/international/us/karoline-leavitt-lara-trump-debut-bold-maga-makeovers-you-wont-believe-the-transformation/articleshow/122910461.cms",
    "timestamp": "2025-07-25T18:55:17Z"
  },
  {
    "title": "Trump administration investigates Oregon's transgender athlete policies",
    "description": "The Trump administration is investigating the Oregon Department of Education after receiving a complaint from a conservative non-profit group alleging the state was violating civil rights law by allowing transgender girls to compete on girls sports teams",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-investigates-oregons-transgender-athlete-policies-124079932",
    "timestamp": "2025-07-25T18:54:30Z"
  },
  {
    "title": "Trump’s ‘treason’ list keeps growing, reflecting his authoritarian-style vision",
    "description": "Donald Trump keeps falsely and casually accusing assorted people and institutions of \"treason.\" This really isn't healthy in a political system.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-treason-obama-russia-gabbard-rcna221140",
    "timestamp": "2025-07-25T18:53:38Z"
  },
  {
    "title": "Hospital warns staff not to defend chaplain detained by ICE",
    "description": "Cincinnati hospital fired two chaplains for speaking out after colleague detained during routine check-in.",
    "link": "https://www.salon.com/2025/07/25/hospital-warns-staff-not-to-defend-chaplain-detained-by-ice/",
    "timestamp": "2025-07-25T18:52:53Z"
  },
  {
    "title": "Scientists Dropped A Cow Carcass 1,629 Meters Into The South China Sea – And 8 Unexpected Visitors Turned Up",
    "description": "Surprise! Image credit: Han Tian, Ocean-Land-Atmosphere Research (2025) (CC BY 4.0) Getting accurate information on animal species can be quite a challenge, especially when they live deep within the sea. One of those animals is the Pacific sleeper shark (Somn…",
    "link": "https://freerepublic.com/focus/f-chat/4330761/posts",
    "timestamp": "2025-07-25T18:52:26Z"
  },
  {
    "title": "Trump administration investigates Oregon’s transgender athlete policies",
    "description": "A conservative nonprofit alleged the state was violating civil rights law.",
    "link": "https://www.bostonherald.com/2025/07/25/trump-oregon-transgender-athletes/",
    "timestamp": "2025-07-25T18:51:28Z"
  },
  {
    "title": "Trump says US hasn’t reached deal with Canada ahead of tariff cutoff",
    "description": "Donald Trump announced that the United States lacks a trade agreement with Canada. This statement casts doubt on future negotiations. The US plans to impose a 35 percent tariff on Canadian exports if no deal is reached by August 1. Dominic LeBlanc said discus…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/trump-says-us-hasnt-reached-deal-with-canada-ahead-of-tariff-cutoff/articleshow/122911160.cms",
    "timestamp": "2025-07-25T18:49:50Z"
  },
  {
    "title": "Trump Shrugs Off Macron’s Palestinian State Remarks: ‘Doesn’t Matter’",
    "description": "President Donald Trump, asked about French President Emmanuel Macron’s move to recognize Palestine as a state, dismissed its significance. “What he says doesn’t matter. It’s not going to change anything,” Trump told reporters. “That statement doesn’t carry an…",
    "link": "https://biztoc.com/x/e39eca439308e056",
    "timestamp": "2025-07-25T18:47:47Z"
  },
  {
    "title": "Stephen Colbert, ‘South Park’ And The Return Of Political Comedy",
    "description": "Stephen Colbert’s isn’t the only anti-Trump comedian making waves for Paramount. 'South Park' dedicated its 27th season premiere to mocking Trump.",
    "link": "https://www.forbes.com/sites/rosaescandon/2025/07/25/stephen-colbert-south-park-and-the-return-of-political-comedy/",
    "timestamp": "2025-07-25T18:47:32Z"
  },
  {
    "title": "San Diego County estimates 400,000 Medi-Cal, CalFresh recipients could lose benefits",
    "description": "Federal cuts could cause 400,000 Medi-Cal and CalFresh recipients to lose benefits and blow a hole in county and state budgets.",
    "link": "https://inewsource.org/2025/07/23/san-diego-county-prepares-for-cuts-to-social-safety-net/",
    "timestamp": "2025-07-25T18:46:53Z"
  },
  {
    "title": "Poll: Public Swings Massively in Trump’s Favor on Economy Since April",
    "description": "A bipartisan poll shows a dramatic shift in public opinion on the state of the U.S. economy, with a net 23-point swing toward optimism since April, an uptick that parallels renewed economic momentum under President Donald Trump’s policies, according to offici…",
    "link": "https://www.breitbart.com/politics/2025/07/25/poll-public-swings-massively-in-trumps-favor-on-economy-since-april/",
    "timestamp": "2025-07-25T18:46:37Z"
  },
  {
    "title": "The Main Obstacle Keeping Congress From Getting Answers on Epstein",
    "description": "The coils of the Epstein snare are tightening around Donald Trump, his lackeys in the Justice Department, and his desperate defenders in Congress.",
    "link": "https://slate.com/news-and-politics/2025/07/trump-epstein-news-republicans-congress-subpoena-hearings.html",
    "timestamp": "2025-07-25T18:45:50Z"
  },
  {
    "title": "This Scottish Newspaper Cover \"Welcoming\" Donald Trump Is Going Viral",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_0a34ca7d-3df2-4c94-970b-6788a5a40cfe",
    "timestamp": "2025-07-25T18:45:38Z"
  },
  {
    "title": "Trump defeats Australia’s mad cow disease restrictions in deal to ship American beef overseas",
    "description": "Trump's administration claimed it as a major victory over “non-scientific trade barriers.”",
    "link": "https://fortune.com/2025/07/25/trump-australia-beef-meat-mad-cow-disease/",
    "timestamp": "2025-07-25T18:45:13Z"
  },
  {
    "title": "Trump's FCC Head Reacts To Paramount Merger Criticism: 'Time For A Change'",
    "description": "FCC Chairman Brendan Carr was asked to respond to criticisms of the Trump administration's intervention in the free press.",
    "link": "https://www.newsweek.com/trump-fcc-brendan-carr-reacts-paramount-merger-criticism-2104246",
    "timestamp": "2025-07-25T18:45:11Z"
  },
  {
    "title": "US justice department interviews Ghislaine Maxwell",
    "description": "Ghislaine Maxwell answered \"every single question\" from the US justice department, her lawyer has said.",
    "link": "https://news.sky.com/story/ghislaine-maxwell-answered-justice-department-questions-about-100-different-people-her-lawyer-says-13401865",
    "timestamp": "2025-07-25T18:45:00Z"
  },
  {
    "title": "Democratic financial officials warn Medicaid cuts will disrupt entire health systems",
    "description": "Colorado State Treasurer Dave Young’s sister Dorothy has relied heavily on Medicaid “for health care and for life-sustaining support” as she lives with...",
    "link": "https://minnesotareformer.com/2025/07/25/democratic-financial-officials-warn-medicaid-cuts-will-disrupt-entire-health-systems/",
    "timestamp": "2025-07-25T18:44:30Z"
  },
  {
    "title": "UK’s Starmer faces mounting pressure to recognise Palestinian state",
    "description": "As starvation grips Gaza, more than 200 UK lawmakers urge Prime Minister Keir Starmer to recognise Palestinian state.",
    "link": "https://www.aljazeera.com/news/2025/7/25/uks-starmer-faces-mounting-pressure-to-recognise-palestinian-state",
    "timestamp": "2025-07-25T18:41:12Z"
  },
  {
    "title": "JD Vance Says ‘I Have No Idea’ If Trump’s Epstein Letter ‘Exists’ — Despite Trump Calling it ‘Fake’",
    "description": "\"I have no idea if the book exists--WSJ won't show it to us. I have no idea if the letter exists--WSJ won't show it to us.\"\nThe post JD Vance Says ‘I Have No Idea’ If Trump’s Epstein Letter ‘Exists’ — Despite Trump Calling it ‘Fake’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/jd-vance-i-have-no-idea-if-trumps-epstein-letter-exists-despite-trump-calling-it-fake/",
    "timestamp": "2025-07-25T18:40:32Z"
  }
]