[
  {
    "title": "Lebanon's president says negotiating with Israel is 'necessary'",
    "description": "Lebanese President Joseph Aoun said it is \"necessary\" to negotiate with Israel, as Lebanon cannot remain outside the path toward peace and security.",
    "link": "https://www.upi.com/Top_News/World-News/2025/10/13/Lebanon-Lebanon-president/4281760373818/",
    "timestamp": "2025-10-13T18:43:34Z"
  },
  {
    "title": "Will Trump become a war president after missing out on the Nobel Peace Prize?",
    "description": "Will the US leader will opt for military intervention over cool diplomacy after being snubbed for the prestigious Norwegian award? Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626372-trump-nobel-war-president/",
    "timestamp": "2025-10-13T18:41:22Z"
  },
  {
    "title": "Key moments from a momentous day for Israelis and Palestinians | CNN",
    "description": "The last 20 living hostages held in Gaza were released on Monday, reuniting with their families in jubilant scenes as world leaders gathered in Egypt to discuss the future of Gaza and the next phases of the US-brokered ceasefire deal.",
    "link": "https://www.cnn.com/2025/10/13/middleeast/released-israeli-hostages-peace-summit-intl",
    "timestamp": "2025-10-13T18:40:57Z"
  },
  {
    "title": "JPMorgan to Plow $1.5 Trillion Into US Security Industries",
    "description": "JPMorgan Chase & Co. vowed to funnel $1.5 trillion into industries that bolster US economic security and resiliency over the next 10 years — an initiative that will invest billions of dollars in companies and hire bankers and other professionals.",
    "link": "https://www.livemint.com/companies/news/jpmorgan-to-plow-1-5-trillion-into-us-security-industries-11760380711716.html",
    "timestamp": "2025-10-13T18:38:31Z"
  },
  {
    "title": "Hot mic catches Trump discussing family business with foreign leader after Gaza ceasefire",
    "description": "Reactions rolled in Monday after President Donald Trump was caught on a hot mic talking to a world leader about a family business deal after signing the Gaza ceasefire plan. More than 20 world leaders joined Trump in Sharm El-Sheikh, Egypt, for a summit. Afte…",
    "link": "https://www.rawstory.com/donald-trump-2674180252/",
    "timestamp": "2025-10-13T18:37:08Z"
  },
  {
    "title": "Lifelong Democrat Breaks Down Crying Live on Air as He Reveals His Thoughts on President Trump’s Historic Speech and the Israel-Hamas Peace Deal (AUDIO)",
    "description": "The historic agreement between Hamas and Israel, brokered by President Donald Trump, has unified Americans to the point that even Democrats are breaking down in tears praising the Peace President. As The Gateway Pundit’s Jim Hoft reported, Trump delivered rem…",
    "link": "https://freerepublic.com/focus/f-bloggers/4346135/posts",
    "timestamp": "2025-10-13T18:36:15Z"
  },
  {
    "title": "Lifelong Democrat Breaks Down Crying Live on Air as He Reveals His Thoughts on President Trump’s Historic Speech and the Israel-Hamas Peace Deal (AUDIO)",
    "description": "The historic agreement between Hamas and Israel, brokered by President Donald Trump, has unified Americans to the point that even Democrats are breaking down in tears praising the Peace President. As The Gateway Pundit’s Jim Hoft reported, Trump delivered rem…",
    "link": "https://freerepublic.com/focus/f-news/4346135/posts",
    "timestamp": "2025-10-13T18:36:15Z"
  },
  {
    "title": "Trump leaves Egypt after signing Gaza deal",
    "description": "United States President Donald Trump left Egypt on Monday and is now on his way to Washington after attending the Gaza peace summit in Sharm el-Sheikh.While visiting Egypt, Trump and Qatari Emir Tamim...",
    "link": "https://biztoc.com/x/956163c315641e21",
    "timestamp": "2025-10-13T18:36:14Z"
  },
  {
    "title": "Victor Hanson: The Pieces Of Trump's Peace",
    "description": "Victor Hanson: The Pieces Of Trump's Peace\n \nAuthored by Victor Davis Hanson via American Greatness,\nWhat did Donald Trump do differently to obtain at least temporary calm in the Middle East compared to the failed efforts of past administrations, foreign powe…",
    "link": "https://biztoc.com/x/c4cc3bc2c3fb896b",
    "timestamp": "2025-10-13T18:36:05Z"
  },
  {
    "title": "Trump implies Hamas given approval to act as police force for 'a period of time'",
    "description": "Trump implies Hamas given approval to act as police force for 'a period of time'go.com",
    "link": "https://abcnews.go.com/International/trump-implies-hamas-approval-act-police-force-period/story?id=126480352",
    "timestamp": "2025-10-13T18:35:07Z"
  },
  {
    "title": "The former TV president is “convinced” that Trump’s cabinet meetings have a “smell.”",
    "description": "West Wing star Martin Sheen blasted Donald Trump and his cabinet members Monday, saying he’s “convinced” their meetings “smell of ego and fear and false...",
    "link": "https://www.thedailybeast.com/martin-sheen-torches-trumps-joyless-cabinet-for-their-false-worship/",
    "timestamp": "2025-10-13T18:35:05Z"
  },
  {
    "title": "Indicted Letitia James To Rally For Socialist Days After Bank Fraud Charges",
    "description": "Democratic New York Attorney General Letitia James will headline a rally on Monday for Democratic New York City mayoral nominee Zohran Mamdani.",
    "link": "https://dailycaller.com/2025/10/13/indicted-letitia-james-to-rally-for-socialist-days-after-bank-fraud-charges/",
    "timestamp": "2025-10-13T18:35:04Z"
  },
  {
    "title": "Congress faces 'absolute threat' to power as Trump weaponizes obscure tool: report",
    "description": "In a move reshaping Washington’s balance of power, President Donald Trump has weaponized an obscure budget tool, using the so-called “pocket rescission” to claw back billions approved by Congress and sideline lawmakers from decisions over federal spending. Ev…",
    "link": "https://www.rawstory.com/congress-budget/",
    "timestamp": "2025-10-13T18:31:03Z"
  },
  {
    "title": "The Incredible Irony Of MAGA's Columbus Day Obsession",
    "description": "It literally only exists because people were horrible to immigrants.",
    "link": "https://www.wonkette.com/p/the-incredible-irony-of-magas-columbus",
    "timestamp": "2025-10-13T18:30:36Z"
  },
  {
    "title": "Gaza ceasefire deal highlights Jared Kushner's ties to the Middle East",
    "description": "The US president's son-in-law had little diplomatic or successful investment management experience before helping to broker the Gaza ceasefire deal.",
    "link": "https://www.abc.net.au/news/2025-10-14/jared-kushner-diplomacy-investment-middle-east-real-estate/105862606",
    "timestamp": "2025-10-13T18:30:00Z"
  },
  {
    "title": "Diddy's Dark Reality: Sean Combs Is 'Agitated and Paranoid' Behind Bars as Pardon From Trump Isn't Likely — 'No One's Returning his Calls Anymore'",
    "description": "Sean 'Diddy' Combs' getting a presidential pardon from Donald Trump isn't likely, as he's now 'agitated and paranoid' while in prison.",
    "link": "https://radaronline.com/p/sean-diddy-combs-pardon-from-donald-trump-isnt-likely-agitated-prison/",
    "timestamp": "2025-10-13T18:30:00Z"
  },
  {
    "title": "Former Republican election official buys Dominion Voting — a target of 2020 conspiracy theories",
    "description": "Liberty Vote used to be KNOWiNK, and is based in St. Louis. Former St. Louis elections director Scott Leiendecker is the owner.",
    "link": "https://apnews.com/article/dominion-voting-liberty-vote-2020-conspiracy-theories-fed1e2d7f00b264bf5f8e01a106124f1",
    "timestamp": "2025-10-13T18:30:00Z"
  },
  {
    "title": "Former Obama Official Ben Rhodes Can’t Bring Himself To Give Trump Credit For Israel-Hamas Deal",
    "description": "Ben Rhodes brushed off the deal President Donald Trump brokered between Israel and the radical Islamic terrorist group Hamas as “just a cease-fire.”",
    "link": "https://dailycaller.com/2025/10/13/ben-rhodes-cant-trump-credit-israel-hamas-deal/",
    "timestamp": "2025-10-13T18:29:56Z"
  },
  {
    "title": "Pivot to the homeland so far not affecting troops in South Korea, commander says",
    "description": "Soldiers are “being fed,” “still training” amid government shutdown.",
    "link": "https://www.defenseone.com/threats/2025/10/pivot-homeland-so-far-not-affecting-troops-south-korea-commander-says/408777/",
    "timestamp": "2025-10-13T18:29:17Z"
  },
  {
    "title": "Trump Casts Vision of Prosperous, Peaceful Middle East Following Israel-Hamas Ceasefire",
    "description": "President Donald Trump cast his vision for a prosperous Middle East as he spoke before world leaders in Israel and Egypt.   Together, Israel and America... Read More\nThe post Trump Casts Vision of Prosperous, Peaceful Middle East Following Israel-Hamas Ceasef…",
    "link": "https://www.dailysignal.com/2025/10/13/trump-casts-vision-of-prosperous-peaceful-middle-east-following-israel-hamas-ceasefire/",
    "timestamp": "2025-10-13T18:27:31Z"
  },
  {
    "title": "Brandel Chamblee fired another shot at Bryson DeChambeau on the Trey Wingo Podcast this weekend",
    "description": "It was an idle weekend for Bryson DeChambeau, but that didn't stop Brandel Chamblee from taking his pound of flesh.",
    "link": "https://sports.yahoo.com/article/brandel-chamblee-fired-another-shot-182644327.html",
    "timestamp": "2025-10-13T18:26:44Z"
  },
  {
    "title": "Biggest No Kings protest: Millions to march against Trump on October 18 - 2500 events planned, cities, maps and all details",
    "description": "Millions of Americans are set to protest on October 18. The No Kings movement plans over 2,500 events across the US, Europe, and Canada. Demonstrations aim to oppose President Donald Trump's policies and actions. Organizers expect a massive turnout, potential…",
    "link": "https://economictimes.indiatimes.com/news/international/us/biggest-no-kings-protest-millions-to-march-against-trump-on-october-18-2500-events-planned-cities-maps-and-all-details/articleshow/124532479.cms",
    "timestamp": "2025-10-13T18:25:30Z"
  },
  {
    "title": "Nio Stock Is Moving Higher Monday: What's Driving The Action?",
    "description": "NIO Inc (NYSE:NIO) stock is trading higher on Monday alongside other US-listed Chinese stocks after President Donald Trump posted conciliatory comments about China on social media. China’s exports for September also came in ahead of estimates.\nWhat Happened: …",
    "link": "https://biztoc.com/x/2e292ba3fe4a36dc",
    "timestamp": "2025-10-13T18:25:25Z"
  },
  {
    "title": "Palestinians freed from Israeli prison denied reunion with families as Trump claims a ‘forever’ peace",
    "description": "Palestinian families eager to reunite with loved ones due to be freed learned that Israel had deported them instead. Amid the pain and the decimation of Gaza, U.S. President Donald Trump declared the “dawn of a new Middle East” at the Knesset.",
    "link": "https://mondoweiss.net/2025/10/palestinians-freed-from-israeli-prison-denied-reunion-with-families-as-trump-claims-a-forever-peace/",
    "timestamp": "2025-10-13T18:24:08Z"
  },
  {
    "title": "Government shutdown could be the longest ever, Johnson warns",
    "description": "Republican Speaker Mike Johnson predicts the federal government shutdown may become the longest in history.",
    "link": "https://www.wmur.com/article/government-shutdown-obamacare-health-care/69019530",
    "timestamp": "2025-10-13T18:23:30Z"
  },
  {
    "title": "Trump Spends Peace Summit Whining How He Wants a Police State",
    "description": "Donald Trump is in Egypt celebrating a historic ceasefire arrangement between Israel and Gaza—but he can’t stop fixating on the imagined crime crisis he believes is taking place back on U.S. soil.Seated next to Egyptian President Abdel Fattah el-Sisi on Monda…",
    "link": "https://newrepublic.com/post/201707/donald-trump-peace-summit-police-state",
    "timestamp": "2025-10-13T18:23:25Z"
  },
  {
    "title": "Donald Trump Just Isn't Very Good At Geography, Is He?",
    "description": "“You go ‘boom, boom,’ and now you're in Qatar,” the president said while making a huge geographical flub.",
    "link": "https://www.huffpost.com/entry/trump-geography-mistake-iran-qatar_n_68ed1a55e4b0e81551157b6e",
    "timestamp": "2025-10-13T18:22:56Z"
  },
  {
    "title": "Trump Tells Fellow World Leaders He’s “the Only One That Matters”",
    "description": "At a meeting of world leaders Monday, President Donald Trump claimed he is “the only one that matters” while heaping praise on Hungarian Prime Minister Viktor Orbán.“We love Viktor,” Trump said on stage at a Gaza “peace summit” in Egypt, where he told the pri…",
    "link": "https://newrepublic.com/post/201708/trump-tells-fellow-world-leaders-he-the-one-matters-orban-gaza",
    "timestamp": "2025-10-13T18:22:55Z"
  },
  {
    "title": "Trump and world leaders sign Gaza peace plan",
    "description": "President Donald Trump and world leaders sign a Gaza peace plan at a peace summit in Sharm el-Sheikh, Egypt, marking the ...",
    "link": "https://biztoc.com/x/c37e2a4d3459491e",
    "timestamp": "2025-10-13T18:22:16Z"
  },
  {
    "title": "Minnesota Says it Will Not Respond to Trump Admin’s Demand to Ban Trans Athletes Until 'Extensive' Review",
    "description": "The state of Minnesota told the Trump administration on Friday that it would not provide a \"substantive response\" to a demand the state ban transgender-identifying males from female sports and spaces. \nThe post Minnesota Says it Will Not Respond to Trump Admi…",
    "link": "https://www.breitbart.com/politics/2025/10/13/minnesota-says-it-will-not-respond-to-trump-admins-demand-to-ban-trans-athletes-until-extensive-review/",
    "timestamp": "2025-10-13T18:20:42Z"
  },
  {
    "title": "House speaker Mike Johnson sees no endgame in sight to government shutdown",
    "description": "“We’re barreling toward one of the longest shutdowns in American history,” Johnson said, standing alone at the Capitol on the 13th day of the shutdown.",
    "link": "https://fortune.com/2025/10/13/house-speaker-mike-johnson-sees-no-endgame-government-shutdown-one-of-longest-in-history/",
    "timestamp": "2025-10-13T18:20:11Z"
  },
  {
    "title": "Rep. Jasmine Crockett Reacts To Criticism From Stephen A. Smith",
    "description": "Following Stephen A. Smith’s tirade against Jasmine Crockett and those alike, the U.S. Representative for Texas has reacted. She replied with a prayer hands emoji to rapper Willie D’s comments about Smith. “Stephen A. Smith taking shots at Jasmine Crockett ai…",
    "link": "https://freerepublic.com/focus/f-chat/4346134/posts",
    "timestamp": "2025-10-13T18:17:24Z"
  },
  {
    "title": "Trump meets Palestinian President Abbas at Gaza ceasefire summit in Egypt",
    "description": "The two leaders exchanged a brief handshake and spoke for a few seconds before Trump gave a thumbs-up to the cameras at the summit held in Sharm El-Sheikh.",
    "link": "https://indianexpress.com/article/world/trump-meets-palestinian-president-abbas-at-gaza-ceasefire-summit-in-egypt-10305117/",
    "timestamp": "2025-10-13T18:15:05Z"
  },
  {
    "title": "Trump Snaps at Little Marco for Not Sucking Up Hard Enough",
    "description": "Marco Rubio caught heat from his boss, Donald Trump, for failing to lavish him with enough praise over the Israel–Gaza ceasefire. The secretary of state had ...",
    "link": "https://www.thedailybeast.com/donald-trump-snaps-at-little-marco-for-not-sucking-up-hard-enough-over-ceasefire/",
    "timestamp": "2025-10-13T18:12:34Z"
  },
  {
    "title": "Kristi Noem stars in partisan video about the shutdown, to be shown in airports",
    "description": "Remember DHS Secretary Kristi Noem stared in taxpayer-financed ads, which resembled political propaganda? Now, there's a sequel, which will air in airports.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/kristi-noem-stars-partisan-video-shutdown-shown-airports-rcna237369",
    "timestamp": "2025-10-13T18:11:00Z"
  },
  {
    "title": "‘I Thank President Trump’: Prominent Democrats Praise Trump On Gaza Deal — While Others Dance Around it",
    "description": "Several prominent Democratic lawmakers have gone on record giving credit to President Donald Trump for his efforts to bring about peace in the Middle East.\nThe post ‘I Thank President Trump’: Prominent Democrats Praise Trump On Gaza Deal — While Others Dance …",
    "link": "https://www.mediaite.com/politics/i-thank-president-trump-prominent-democrats-praise-trump-on-gaza-deal-while-others-dance-around-it/",
    "timestamp": "2025-10-13T18:10:25Z"
  },
  {
    "title": "Zelenskyy to meet Trump in Washington to discuss air defence, long-range missiles",
    "description": "WASHINGTON: Ukrainian President Volodymyr Zelenskyy said on Monday (Oct 13) he will meet US President Donald Trump in Washington on Friday to discuss strengthening Ukraine’s air defences and expanding it",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-meet-trump-in-washington-discuss-air-defence-long-range-missiles-5399421",
    "timestamp": "2025-10-13T18:10:00Z"
  },
  {
    "title": "Trial run of AI dashcams to spot traffic violations",
    "description": "Panaji: Goa police will start a trial run to capture traffic violations — such as riding triple seat, riding without helmets, and speeding — using AI-.",
    "link": "https://timesofindia.indiatimes.com/city/goa/trial-run-of-ai-dashcams-to-spot-traffic-violations/articleshow/124534651.cms",
    "timestamp": "2025-10-13T18:06:58Z"
  },
  {
    "title": "Israeli hostages freed as Trump tells Knesset ‘age of terror’ over",
    "description": "US President Donald Trump urged Israel to seize the chance for peace and called on Palestinians to turn “forever from the path of terror” in a speech to the Israeli parliament Monday, hours after Hamas released all 20 living hostages. Trump received a hero’s …",
    "link": "https://freerepublic.com/focus/f-news/4346133/posts",
    "timestamp": "2025-10-13T18:06:03Z"
  },
  {
    "title": "There is exactly one person in the Trump administration that does not hate Laura Loomer. Sadly, that person is Donald Trump [Facepalm]",
    "description": "There is exactly one person in the Trump administration that does not hate Laura Loomer. Sadly, that person is Donald Trump",
    "link": "https://www.fark.com/comments/13843320/There-is-exactly-one-person-in-Trump-administration-that-does-not-hate-Laura-Loomer-Sadly-that-person-is-Donald-Trump",
    "timestamp": "2025-10-13T18:05:03Z"
  },
  {
    "title": "Agonda pool in which 3-yr-old died is illegal, says GCZMA",
    "description": "Panaji: The Goa Coastal Zone Management Authority (GCZMA) has found gross illegalities in the construction of a swimming pool at a hotel in Agonda, Ca.",
    "link": "https://timesofindia.indiatimes.com/city/goa/agonda-pool-in-which-3-yr-old-died-is-illegal-says-gczma/articleshow/124534509.cms",
    "timestamp": "2025-10-13T18:04:54Z"
  },
  {
    "title": "Education Department layoffs hit offices that oversee special education and civil rights enforcement",
    "description": "The Trump administration started laying off 466 Education Department staffers on Friday amid mass firings across the government meant to pressure Democratic lawmakers over the federal shutdown.",
    "link": "https://www.pbs.org/newshour/politics/education-department-layoffs-hit-offices-that-oversee-special-education-and-civil-rights-enforcement",
    "timestamp": "2025-10-13T18:04:39Z"
  },
  {
    "title": "WW3 fears explode as Russia issues chilling new nuclear threat to the world",
    "description": "Vladimir Putin's ally has made a threat to Donald Trump",
    "link": "https://www.ladbible.com/news/world-news/donald-trump-gaza-peace-plan-vladimir-putin-ukraine-russia-791593-20251013",
    "timestamp": "2025-10-13T18:03:13Z"
  },
  {
    "title": "Nick Fuentes Throws Tantrum Over ‘Disgusting’ Trump Speech in Israel",
    "description": "Infamous white nationalist internet personality Nick Fuentes threw a tantrum over President Donald Trump's speech before the Israeli Knesset on Monday.\nThe post Nick Fuentes Throws Tantrum Over ‘Disgusting’ Trump Speech in Israel first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/nick-fuentes-throws-tantrum-over-disgusting-trump-speech-in-israel/",
    "timestamp": "2025-10-13T18:02:46Z"
  },
  {
    "title": "China's global exports are booming amid looming trade war with US",
    "description": "Trade numbers confirm that Chinese exports to the United States fell, but jumped globally, as a new 100% tariff threat from US President Donald Trump promises a rocky patch ahead of trade negotiations between the world's two strongest economies.\nChina's expor…",
    "link": "https://biztoc.com/x/f5d5c728dca03777",
    "timestamp": "2025-10-13T18:02:35Z"
  },
  {
    "title": "SP: Same people likely behind Dona Paula, Mapusa dacoities",
    "description": "Panaji: While the police have not yet made any arrests in the dacoity at Dr Mahendra Ghanekar’s residence in Mapusa, investigations have revealed that.",
    "link": "https://timesofindia.indiatimes.com/city/goa/sp-same-people-likely-behind-dona-paula-mapusa-dacoities/articleshow/124534452.cms",
    "timestamp": "2025-10-13T18:01:36Z"
  },
  {
    "title": "Sen. Mark Kelly Calls Kamala Harris a “Strong” 2028 Candidate",
    "description": "Voters may remember that the last time Kamala Harris faced Donald Trump, she couldn’t carry a single battleground state.\nThe post Sen. Mark Kelly Calls Kamala Harris a “Strong” 2028 Candidate first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/10/sen-mark-kelly-calls-kamala-harris-a-strong-2028-candidate/",
    "timestamp": "2025-10-13T18:00:57Z"
  },
  {
    "title": "Coffee Break: Bad Jacketing Katie Porter",
    "description": "Last week, California gubernatorial candidate Katie Porter got the bad jacketing treatment after a snippy interview with CBS.",
    "link": "https://www.nakedcapitalism.com/2025/10/bad-jacketing-katie-porter-california-governor.html",
    "timestamp": "2025-10-13T18:00:19Z"
  },
  {
    "title": "Zelenskiy to Meet Trump on Friday to Discuss Arms and Energy",
    "description": "Ukrainian President Volodymyr Zelenskiy plans to meet with US President Donald Trump in Washington this week to discuss air defense, long-range weaponry and energy as Russia intensifies strikes on the war-battered nation’s energy system.",
    "link": "https://financialpost.com/pmn/business-pmn/zelenskiy-to-meet-trump-on-friday-to-discuss-arms-and-energy",
    "timestamp": "2025-10-13T18:00:19Z"
  },
  {
    "title": "What ExxonMobil's Comeback in Iraq Really Means",
    "description": "The signing of heads of agreement last week between U.S. energy supermajor ExxonMobil and Iraq’s Oil Ministry is perhaps the most significant of the recent deals between firms from the West and Baghdad. It is true that several others have been with similarly-…",
    "link": "https://oilprice.com/Energy/Crude-Oil/What-ExxonMobils-Comeback-in-Iraq-Really-Means.html",
    "timestamp": "2025-10-13T18:00:00Z"
  },
  {
    "title": "Virginia Attorney General Race May Show Proof of the Charlie Kirk Effect",
    "description": "WASHINGTON — In a better world, Democrats would be running at full speed away from Jay Jones, the Democratic nominee in the Virginia attorney general... Read More\nThe post Virginia Attorney General Race May Show Proof of the Charlie Kirk Effect appeared first…",
    "link": "https://www.dailysignal.com/2025/10/13/virginia-attorney-general-race-may-show-proof-charlie-kirk-effect/",
    "timestamp": "2025-10-13T18:00:00Z"
  },
  {
    "title": "DANIEL MCCARTHY: Columbus Day Celebrates Our Civilization",
    "description": "Battles over Columbus Day aren't really about Christopher Columbus at all -- they're about whether America should exist.",
    "link": "https://dailycaller.com/2025/10/13/opinion-columbus-day-celebrates-our-civilization-daniel-mccarthy/",
    "timestamp": "2025-10-13T17:59:47Z"
  },
  {
    "title": "26 rent-a-bikes fined for illegal parking at KTC bus stand",
    "description": "Panaji: A total of 26 two-wheelers operating as rent-a-bikes were issued challans on Monday for illegal parking at the Panaji bus terminus. A team of.",
    "link": "https://timesofindia.indiatimes.com/city/goa/26-rent-a-bikes-fined-for-illegal-parking-at-ktc-bus-stand/articleshow/124534373.cms",
    "timestamp": "2025-10-13T17:59:19Z"
  },
  {
    "title": "Brazil hopes COP30 in Amazon can unite world for climate action",
    "description": "Brazil hosts COP30 in the Amazon, aiming for global climate unity amid challenges like US absence and high costs. Despite President Lula's push for truth and focus on the rainforest, attendance is uncertain. The summit faces pressure to deliver tangible clima…",
    "link": "https://timesofindia.indiatimes.com/world/rest-of-world/brazil-hopes-cop30-in-amazon-can-unite-world-for-climate-action/articleshow/124534293.cms",
    "timestamp": "2025-10-13T17:57:06Z"
  },
  {
    "title": "Questions remain on Donald Trump's Gaza peace plan",
    "description": "The details of the peace plan that has brought about a Gaza ceasefire are vague — deliberately so, negotiators say. Many questions still remain and the answers have the potential to bring peace, or a return to fighting.",
    "link": "https://www.dw.com/en/questions-remain-on-donald-trumps-gaza-peace-plan/a-74337938",
    "timestamp": "2025-10-13T17:56:00Z"
  },
  {
    "title": "Plan to set up clean street food hub in Panaji faces delay due to logistics",
    "description": "Panaji: The Corporation of the City of Panaji’s (CCP) plan to set up a clean street food hub has been a non-starter so far due to logistics.A CCP offi.",
    "link": "https://timesofindia.indiatimes.com/city/goa/plan-to-set-up-clean-street-food-hub-in-panaji-faces-delay-due-to-logistics/articleshow/124534287.cms",
    "timestamp": "2025-10-13T17:55:42Z"
  },
  {
    "title": "Speaker Johnson: 'Lasting Peace in Reach' in the Middle East; Only Possible Under Trump",
    "description": "President Donald Trump has accomplished what others have only talked about or tried and failed to do, House Speaker Mike Johnson (R-LA) said on Monday during his press conference.\nThe post Speaker Johnson: ‘Lasting Peace in Reach’ in the Middle East; Only Pos…",
    "link": "https://www.breitbart.com/politics/2025/10/13/speaker-johnson-lasting-peace-in-reach-in-the-middle-east-only-possible-under-trump/",
    "timestamp": "2025-10-13T17:55:37Z"
  },
  {
    "title": "AAP leader Anurag Dhanda criticises Haryana government over delayed flood compensation",
    "description": "India News: The Aam Aadmi Party (AAP) on Monday criticised the Haryana government and chief minister Nayab Singh Saini over delays in compensating farmers affecte.",
    "link": "https://timesofindia.indiatimes.com/india/aap-leader-anurag-dhanda-criticises-haryana-government-over-delayed-flood-compensation/articleshow/124534249.cms",
    "timestamp": "2025-10-13T17:55:28Z"
  },
  {
    "title": "WATCH: Trump’s Israel peace deal: Robert Spencer and Hussain Abdul-Hussain on what’s next",
    "description": "These conversations cut through illusions of 'ceasefire' and 'peace talks' to expose the deeper battle for truth, ideology, and survival in the Middle East",
    "link": "https://www.wnd.com/2025/10/watch-trumps-israel-peace-deal-robert-spencer-hussain/",
    "timestamp": "2025-10-13T17:53:26Z"
  },
  {
    "title": "Goa plans to launch diploma in cooperative edu, revive farmland",
    "description": "Panaji: Ahead of the State Cooperative Week beginning Nov 14, the state is preparing a comprehensive roadmap to strengthen the cooperative movement. T.",
    "link": "https://timesofindia.indiatimes.com/city/goa/goa-plans-to-launch-diploma-in-cooperative-edu-revive-farmland/articleshow/124534244.cms",
    "timestamp": "2025-10-13T17:53:02Z"
  },
  {
    "title": "Never mind America’s real economy. Its deal economy is booming",
    "description": "Never mind America’s real economy. Its deal economy is booming\nDonald Trump has unleashed an M&A bonanza\nAmerica’s first merger wave began in the 1890s and forged giants in steel, oil and railroads. A second preceded the crash of 1929. Executives assembled co…",
    "link": "https://biztoc.com/x/e71c21c986a0c27f",
    "timestamp": "2025-10-13T17:52:00Z"
  },
  {
    "title": "Wall Street rebounds from Friday’s drop after Trump says ‘it will all be fine’ with China",
    "description": "And back up goes Wall Street. U.S. stocks are rallying Monday after President Donald Trump said “ it will all be fine,” just days after he sent the market reeling by threatening much higher tariffs on China.\nThe S&P 500 jumped 1.3% to recover nearly half its …",
    "link": "https://biztoc.com/x/1bc2ff11999bb432",
    "timestamp": "2025-10-13T17:51:44Z"
  },
  {
    "title": "Wall Street rallies to recover some of Friday’s sell-off after Trump softens China criticism",
    "description": "And back up goes Wall Street. U.S. stocks are rallying Monday after President Donald Trump said “ it will all be fine,” just days after he sent the market reeling by threatening much higher tariffs on China.\nThe S&P 500 jumped 1.6 per cent to recover more tha…",
    "link": "https://biztoc.com/x/2df637ef6a8be69a",
    "timestamp": "2025-10-13T17:51:28Z"
  },
  {
    "title": "Egypt Summit: Trump Credits Arab, Muslim Nations For Gaza Ceasefire Breakthrough",
    "description": "President Donald Trump delivered a sweeping address at the Sharm el-Sheikh Summit, declaring that the war in Gaza is over and calling the newly brokered ceasefire “historic.” \nTrump praised Arab and Muslim nations for their role in achieving the breakthrough,…",
    "link": "https://biztoc.com/x/09841524ab8456ae",
    "timestamp": "2025-10-13T17:51:24Z"
  },
  {
    "title": "Couple separated, kidnapped during Oct 7 Hamas attack finally reunited after hostage ordeal",
    "description": "Hamas hostages Avinatan Or and Noa Argamani reunited following President Donald Trump's Gaza peace deal after more than two years of conflict.",
    "link": "https://www.foxnews.com/world/couple-separated-kidnapped-during-oct-7-hamas-attack-finally-reunited-hostage-ordeal",
    "timestamp": "2025-10-13T17:49:14Z"
  },
  {
    "title": "Eagles' Za’Darius Smith stuns fans with unexpected NFL retirement",
    "description": "Philadelphia Eagles' defense faces a significant shift as veteran defensive end Za'darius Smith, 33, announced his retirement after just six weeks with the team. Smith, who enjoyed an 11-year NFL career, cited a mix of emotions in his Instagram announcement, …",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/eagles-zadarius-smith-stuns-fans-with-unexpected-nfl-retirement/articleshow/124534198.cms",
    "timestamp": "2025-10-13T17:48:58Z"
  },
  {
    "title": "From Poland to UFC spotlight: Mateusz Gamrot eyes big breakthrough with Oliveira clash",
    "description": "Polish fighter Mateusz Gamrot embraces a \"crazy\" short-notice opportunity against former champion Charles Oliveira, viewing it as a pivotal moment in his career. Confident in his grappling and striking, Gamrot anticipates a high-paced, back-and-forth war in B…",
    "link": "https://timesofindia.indiatimes.com/sports/mma/news/mateusz-gamrot-ready-for-ufc-spotlight-against-charles-oliveira/articleshow/124533818.cms",
    "timestamp": "2025-10-13T17:48:12Z"
  },
  {
    "title": "Government Shutdown Day 13: Betting Odds Now Favor Longest Shutdown In History",
    "description": "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/10/13/government-shutdown-day-13-betting-odds-now-favor-longest-government-shutdown-in-history/",
    "timestamp": "2025-10-13T17:47:25Z"
  },
  {
    "title": "New design for Taraporewala Aquarium, govt’s plan drawn up in April scrapped",
    "description": "Mumbai: The state fisheries department will soon appoint a consultant for a new design concept and feasibility study of the iconic Taraporewala Aquari.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/new-design-for-taraporewala-aquarium-govts-plan-drawn-up-in-april-scrapped/articleshow/124534149.cms",
    "timestamp": "2025-10-13T17:47:19Z"
  },
  {
    "title": "Several Airports Refuse To Air DHS Video Blaming Democrats For Shutdown—But It’s Likely Not A Hatch Act Violation",
    "description": "At least five U.S. airports have refused to broadcast a video of Kristi Noem blaming Democrats for the government shutdown, citing the video’s “political nature.”",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/10/13/airports-refuse-dhs-video-blaming-democrats-shutdown-not-hatch-act-violation/",
    "timestamp": "2025-10-13T17:47:08Z"
  },
  {
    "title": "This Is How Slavishly Devoted Marco Rubio Is to Trump",
    "description": "Donald Trump’s Cabinet has once again demonstrated that it is just as blindly devoted to the president’s cult of personality as his most ardent MAGA supporters are. “It’s about transforming the region,” Secretary of State Marco Rubio said in Egypt, right afte…",
    "link": "https://newrepublic.com/post/201703/slavishly-devoted-marco-rubio-trump-gaza-israel-deal",
    "timestamp": "2025-10-13T17:46:29Z"
  },
  {
    "title": "New Middle East’: Trump Addresses Israeli Parliament After Declaring Gaza War ‘Over’",
    "description": "As U.S. President Donald Trump flew to Israel on Monday, his plane passed over the words “THANK YOU” written on the beach in Tel Aviv. Aboard Air Force One, Trump declared to reporters that “the war is over,” referring to the more than two-year conflict in Ga…",
    "link": "https://freerepublic.com/focus/f-news/4346131/posts",
    "timestamp": "2025-10-13T17:46:20Z"
  },
  {
    "title": "Education Department layoffs hit offices that oversee special education and civil rights enforcement",
    "description": "A new round of layoffs at the Education Department is threatening new disruptions to the nation's students and schools in areas from special education to civil rights enforcement and after-school programs.",
    "link": "https://www.wcvb.com/article/education-department-layoffs-impact-schools/69019401",
    "timestamp": "2025-10-13T17:44:43Z"
  },
  {
    "title": "'If You Can Keep It': The ICE Crackdowns in Chicago and Portland",
    "description": "President Donald Trump promised to crackdown on immigration in Democratic-led cities using aggressive tactics like <a href=\"https://www.npr.org/2025/09/13/nx-s1-5507125/the-supreme-court-clears-the-way-for-ice-agents-to-treat-race-as-grounds-for-immigration-s…",
    "link": "https://www.npr.org/2025/10/13/nx-s1-5573212/if-you-can-keep-it-the-ice-crackdowns-in-chicago-and-portland",
    "timestamp": "2025-10-13T17:43:49Z"
  },
  {
    "title": "Zelenskyy to meet Trump in DC as Ukraine seeks defence, energy support",
    "description": "Ukraine sends delegation to Washington to talk defence and energy before Zelenskyy's White House visit.",
    "link": "https://www.aljazeera.com/news/2025/10/13/zelenskyy-to-meet-trump-in-dc-as-ukraine-seeks-defence-energy-support",
    "timestamp": "2025-10-13T17:42:57Z"
  },
  {
    "title": "Trump-Xi meeting still on despite trade tensions, says US’s Bessent",
    "description": "Secretary of the US Treasury says Trump may call off his 100 percent tariff threat on China as negotiations continue.",
    "link": "https://www.aljazeera.com/news/2025/10/13/trump-xi-meeting-still-on-despite-trade-tensions-says-uss-bessent",
    "timestamp": "2025-10-13T17:42:38Z"
  },
  {
    "title": "Education Department layoffs hit offices that oversee special education and civil rights enforcement",
    "description": "A new round of layoffs at the Education Department is depleting an agency that was already hit hard in the Trump administration’s previous mass firings, threatening new disruption to the nation’s students and schools",
    "link": "https://abcnews.go.com/Politics/wireStory/education-department-layoffs-hit-offices-oversee-special-education-126481056",
    "timestamp": "2025-10-13T17:41:57Z"
  },
  {
    "title": "‘AV-Ra-HOM, It’s So Cool!’: Trump Loves Pronouncing Abraham Accords Like an Israeli",
    "description": "President Trump reiterated that he now loves to pronounce \"Abraham,\" as in, the Abraham Accords, as \"AV-ra-HOM,\" because that is how Israelis say it\nThe post ‘AV-Ra-HOM, It’s So Cool!’: Trump Loves Pronouncing Abraham Accords Like an Israeli first appeared on…",
    "link": "https://www.mediaite.com/media/news/av-ra-hom-its-so-cool-trump-loves-pronouncing-abraham-accords-like-an-israeli/",
    "timestamp": "2025-10-13T17:41:38Z"
  },
  {
    "title": "Trump ignores Palestinians in Knesset speech intended as a victory lap for the Gaza war",
    "description": "In a speech to the Knesset, Donald Trump declared the war in Gaza over and tempted Israel with economic riches through regional normalization, while almost completely ignoring the Palestinians.",
    "link": "https://mondoweiss.net/2025/10/trump-ignores-palestinians-in-knesset-speech-intended-as-a-victory-lap-for-the-gaza-war/",
    "timestamp": "2025-10-13T17:41:24Z"
  },
  {
    "title": "WATCH: Knesset Gives Standing Ovation When Trump Asks Israeli President to Pardon Netanyahu",
    "description": "President Donald Trump went off-script during a speech Monday and asked for Prime Minister Benjamin Netanyahu to be pardoned.\nThe post WATCH: Knesset Gives Standing Ovation When Trump Asks Israeli President to Pardon Netanyahu appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/10/13/watch-knesset-standing-ovation-when-trump-asks-israeli-president-pardon-netanyahu/",
    "timestamp": "2025-10-13T17:41:15Z"
  },
  {
    "title": "Education Department layoffs hit offices that oversee special education and civil rights enforcement",
    "description": "A new round of layoffs at the Education Department is threatening new disruptions to the nation's students and schools in areas from special education to civil rights enforcement and after-school programs.",
    "link": "https://www.wtae.com/article/education-department-layoffs-impact-schools/69019401",
    "timestamp": "2025-10-13T17:40:32Z"
  },
  {
    "title": "Education Department layoffs hit offices that oversee special education and civil rights enforcement",
    "description": "A new round of layoffs at the Education Department is threatening new disruptions to the nation's students and schools in areas from special education to civil rights enforcement and after-school programs.",
    "link": "https://www.wmur.com/article/education-department-layoffs-impact-schools/69019401",
    "timestamp": "2025-10-13T17:40:32Z"
  },
  {
    "title": "'Prayers of millions have finally been answered': Trump praises peace deal",
    "description": "President Donald Trump praised the signing of a peace agreement ending two years of fighting between Israel and Hamas in Gaza, saying \"nobody thought it could happen.\" The peace deal was signed after all remaining living hostages held by Hamas were returned t…",
    "link": "https://biztoc.com/x/b300a3854707430b",
    "timestamp": "2025-10-13T17:40:30Z"
  },
  {
    "title": "How Trump Alleges Terrorism To Expand His War On Tax-Exempt Groups",
    "description": "They’d do it by expanding the definition of terrorism and revoking the tax-exemption for groups that allegedly support such activity in broad, but unspecified ways.",
    "link": "https://www.forbes.com/sites/howardgleckman/2025/10/13/how-trump-alleges-terrorism-to-expand-his-war-on-tax-exempt-groups/",
    "timestamp": "2025-10-13T17:40:02Z"
  },
  {
    "title": "Fetterman marks release of last living hostages: 'The nightmare finally ends'",
    "description": "Sen. John Fetterman, an ardent supporter of Israel, declared \"The nightmare finally ends\" in response to the release of the last living Israeli hostages held by Hamas",
    "link": "https://www.foxnews.com/politics/fetterman-marks-release-last-living-hostages-the-nightmare-finally-ends",
    "timestamp": "2025-10-13T17:39:51Z"
  },
  {
    "title": "Afghan Hindus and Sikhs meet foreign minister Muttaqi; urge restoration, maintenance of gurdwaras, temples",
    "description": "Afghan Hindus and Sikhs in India met the Taliban's foreign minister, seeking safe passage for Indian nationals to visit their homeland and urging the regime to restore minority rights. They requested joint delegations for temple and gurdwara upkeep and propos…",
    "link": "https://timesofindia.indiatimes.com/india/afghan-hindus-and-sikhs-meet-foreign-minister-muttaqi-urge-restoration-maintenance-of-gurdwaras-temples/articleshow/124533731.cms",
    "timestamp": "2025-10-13T17:37:13Z"
  },
  {
    "title": "Zelenskiy to meet Trump on Friday to talk air defence, new weapons",
    "description": "KYIV/WASHINGTON (Reuters) -Ukrainian President Volodymyr Zelenskiy said on Monday that he would meet U.S. President Donald Trump in Washington on Friday...",
    "link": "https://uk.news.yahoo.com/zelenskiy-meet-trump-friday-talk-173707250.html",
    "timestamp": "2025-10-13T17:37:07Z"
  },
  {
    "title": "Podcast: Trump praises his peace deal for Gaza",
    "description": "There is a \"long way to go\" for peace in the Middle East despite a plan by US President Donald Trump, the UK Independent's Chief International Correspondent Bel Trew has told Behind the Story.",
    "link": "https://www.rte.ie/news/2025/1013/1538355-behind-the-story/",
    "timestamp": "2025-10-13T17:36:31Z"
  },
  {
    "title": "MAGA fumes after top Democrat doesn’t thank Trump: ‘Just say it’",
    "description": "A number of the president's supporters and allies are criticizing several social media posts from Democrats.",
    "link": "https://www.nj.com/politics/2025/10/maga-fumes-after-top-democrat-doesnt-thank-trump-just-say-it.html",
    "timestamp": "2025-10-13T17:36:03Z"
  },
  {
    "title": "Bigg Boss 18 fame Shrutika Arjun shares post-surgery video; husband Arjun Raaj takes care of her and stands as her biggest strength during recovery",
    "description": "Bigg Boss 18's Shrutika Arjun shared a heartwarming video post-surgery, showcasing her husband's devoted care. The actress, known for her bubbly nature, humorously noted her husband's exhaustion from his efforts. Fans lauded their loving bond, calling them 't…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-18-fame-shrutika-arjun-shares-post-surgery-video-husband-arjun-raaj-takes-care-of-her-and-stands-as-her-biggest-strength-during-recovery/articleshow/124532902.cms",
    "timestamp": "2025-10-13T17:35:58Z"
  },
  {
    "title": "Pam Bondi reacts to Amy Poehler’s ‘SNL’ parody",
    "description": "Amy Poehler played United States attorney general Pam Bondi during the latest episode of 'Saturday Night Live'",
    "link": "https://www.nj.com/entertainment/2025/10/pam-bondi-reacts-to-amy-poehlers-snl-parody.html",
    "timestamp": "2025-10-13T17:35:00Z"
  },
  {
    "title": "IMF meetings begin under fresh cloud of US-China trade tensions",
    "description": "The IMF and World Bank's semi-annual gathering commenced amidst renewed trade tensions between the US and China. While initial market reactions were negative, a de-escalation in rhetoric offered some relief. Global growth is expected to slow slightly, with a …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/imf-meetings-begin-under-fresh-cloud-of-us-china-trade-tensions/articleshow/124533658.cms",
    "timestamp": "2025-10-13T17:32:08Z"
  },
  {
    "title": "Suicide claims more Gen Z lives than previous generation",
    "description": "Experts disagree on the root causes of the growth in suicides.",
    "link": "https://www.denverpost.com/2025/10/13/suicide-gen-z/",
    "timestamp": "2025-10-13T17:31:40Z"
  },
  {
    "title": "Suicide claims more Gen Z lives than previous generation",
    "description": "Experts disagree on the root causes of the growth in suicides.",
    "link": "https://www.bostonherald.com/2025/10/13/suicide-gen-z/",
    "timestamp": "2025-10-13T17:31:40Z"
  },
  {
    "title": "'I Am Your Champion': Nigel Farage Makes Case for UK Crypto Reform",
    "description": "Reform UK leader Nigel Farage said that Britain needs better crypto regulation—and suggested that he's the man to do the job.",
    "link": "https://decrypt.co/344065/i-am-your-champion-nigel-farage-makes-case-uk-crypto-reform",
    "timestamp": "2025-10-13T17:31:15Z"
  },
  {
    "title": "China Warns The U.S. Ruling Class of Retaliation Over Tariff Threats",
    "description": "Threats are not “the right way” to get along with China, the Commerce Ministry has said, in response to the United States' warning that it would impose additional tariffs. Beijing's rulers have made it clear that they won’t yield to Washington’s latest tariff…",
    "link": "https://www.shtfplan.com/headline-news/china-warns-the-u-s-ruling-class-of-retaliation-over-tariff-threats",
    "timestamp": "2025-10-13T17:30:41Z"
  }
]