[
  {
    "title": "Analysis:Investors set to reignite yield curve steepening if fiscal worries worsen",
    "description": "Bond markets remain focused on budget concerns in the U.S., euro zone and Japan, meaning the recent pullback in ultra-long sovereign yields may prove short-lived, potentially reigniting interest in this year's popular curve steepening trade.Investors have bee…",
    "link": "https://www.channelnewsasia.com/business/analysisinvestors-set-reignite-yield-curve-steepening-if-fiscal-worries-worsen-5389366",
    "timestamp": "2025-10-08T08:52:37Z"
  },
  {
    "title": "HarperCollins UK apologizes to Melania Trump over book's Epstein claim",
    "description": "Book publisher HarperCollins UK apologized to First Lady Melania Trump on Tuesday and recalled a book that repeated unverified claims that child sex trafficker Jeffrey Epstein was involved in introducing her to Donald Trump.\nWhy it matters: HarperCollins is t…",
    "link": "https://biztoc.com/x/bc8142ef8f84884c",
    "timestamp": "2025-10-08T08:50:42Z"
  },
  {
    "title": "UK's Starmer begins visit to India, praises trade deal",
    "description": "UK Prime Minister Keir Starmer urged business leaders to seize the opportunity of the trade deal with India. He's visiting the South Asian giant and is accompanied by the largest-ever UK trade mission to the country.",
    "link": "https://www.dw.com/en/uks-starmer-begins-visit-to-india-praises-trade-deal/a-74273072",
    "timestamp": "2025-10-08T08:38:00Z"
  },
  {
    "title": "Green stocks are quietly beating the world’s biggest trades",
    "description": "Investors have turned more positive on green stocks as the energy needed to power AI can’t be delivered without renewables",
    "link": "https://www.bloomberg.com/news/articles/2025-10-08/green-stocks-are-quietly-beating-the-world-s-biggest-trades",
    "timestamp": "2025-10-08T08:35:18Z"
  },
  {
    "title": "Green Stocks Are Quietly Beating the World’s Biggest Trades",
    "description": "A global benchmark of clean energy stocks is outperforming major equity indexes and even gold, as investors respond to soaring demand for renewables needed to power the boom in artificial intelligence.",
    "link": "https://financialpost.com/pmn/business-pmn/green-stocks-are-quietly-beating-the-worlds-biggest-trades",
    "timestamp": "2025-10-08T08:21:29Z"
  },
  {
    "title": "Green stocks are beating world's biggest trades, even gold",
    "description": "A global clean energy index is outperforming major equity indexes and gold, as the demand for renewables soars. Read more.",
    "link": "https://financialpost.com/investing/green-stocks-beating-worlds-biggest-trades",
    "timestamp": "2025-10-08T08:21:29Z"
  },
  {
    "title": "2 Key Democrats Come Out And Say It: Trump Has 'Some Kind Of Dementia'",
    "description": "The comments come as the president faces growing questions about his health.",
    "link": "https://www.huffpost.com/entry/jb-pritzker-trump-dementia_n_68e60661e4b0d98d3e52b9bb",
    "timestamp": "2025-10-08T08:16:26Z"
  },
  {
    "title": "The Truth Behind Darkseid in The Daily LITG, 8th of October 2025",
    "description": "The Truth Behind Darkseid was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history o…",
    "link": "https://bleedingcool.com/comics/the-truth-behind-darkseid-in-the-daily-litg-8th-of-october-2025/",
    "timestamp": "2025-10-08T08:13:05Z"
  },
  {
    "title": "Nvidia To Reportedly Cover Trump's $100,000 H1-B Visa Fee For New Hires, Says CEO: 'Not...Possible Without Immigration'",
    "description": "Nvidia Corp. (NASDAQ:NVDA) CEO Jensen Huang has reportedly assured employees that the company will continue sponsoring H-1B visas, despite President Donald Trump‘s recent executive order to impose a $100,000 fee on new applications. \nHuang Backs Trump On ‘Leg…",
    "link": "https://biztoc.com/x/25d778f17dc67d99",
    "timestamp": "2025-10-08T08:06:36Z"
  },
  {
    "title": "Map Shows US Cities With Most Vacant Lots After Trump Housing Update",
    "description": "In a social media post published earlier this week, President Donald Trump called on mortgage financing giants Fannie Mae and Freddie Mac to “get big homebuilders going,” adding that they were “sitting on 2 million empty lots.”\nAccording to the president, the…",
    "link": "https://biztoc.com/x/833b98071bde05d0",
    "timestamp": "2025-10-08T08:06:34Z"
  },
  {
    "title": "Hamas says it handed over list of Israelis and Palestinians for swap deal",
    "description": "SHARM EL-SHEIKH (Reuters) -Hamas said on Wednesday it had exchanged a list of the names of Israeli hostages and Palestinian prisoners to be released under a ...",
    "link": "https://ca.news.yahoo.com/hamas-says-handed-over-list-080158382.html",
    "timestamp": "2025-10-08T08:01:58Z"
  },
  {
    "title": "Carney raised Keystone XL pipeline revival in meeting with Trump",
    "description": "Relief for Canada from U.S. tariffs on steel and aluminum may come thanks to renewed interest in a pipeline project first proposed more than 15 years ago.",
    "link": "https://www.cbc.ca/news/politics/carney-trump-keystone-revival-1.7653949",
    "timestamp": "2025-10-08T08:00:33Z"
  },
  {
    "title": "Today in History: October 8, Pakistan-India border earthquake kills tens of thousands",
    "description": "A magnitude 7.6 earthquake on the Pakistan-India border killed an estimated 86,000 people.",
    "link": "https://www.denverpost.com/2025/10/08/today-in-history-october-8-pakistan-india-border-earthquake-kills-tens-of-thousands/",
    "timestamp": "2025-10-08T08:00:30Z"
  },
  {
    "title": "Today in History: October 8, Pakistan-India border earthquake kills tens of thousands",
    "description": "A magnitude 7.6 earthquake on the Pakistan-India border killed an estimated 86,000 people.",
    "link": "https://www.bostonherald.com/2025/10/08/today-in-history-october-8-pakistan-india-border-earthquake-kills-tens-of-thousands/",
    "timestamp": "2025-10-08T08:00:30Z"
  },
  {
    "title": "Bitcoin – 77% odds of BTC hitting $130K amid ‘debasement trade’",
    "description": "Will the $120K BTC support set the next springboard to $130K and above?",
    "link": "https://ambcrypto.com/bitcoin-77-odds-of-btc-hitting-130k-amid-debasement-trade/",
    "timestamp": "2025-10-08T08:00:07Z"
  },
  {
    "title": "Euro, yen slide for third straight day versus US dollar on political jitters",
    "description": "The euro and the yen were headed for a third straight daily loss against the U.S. dollar, pressured by political turmoil in France and expectations of increased fiscal spending in Japan.Expansive economic policies in Japan and France’s struggle to rein in its…",
    "link": "https://www.channelnewsasia.com/business/euro-yen-slide-third-straight-day-versus-us-dollar-political-jitters-5388761",
    "timestamp": "2025-10-08T07:47:39Z"
  },
  {
    "title": "China Dodges US Export Controls, Buys $38 Billion In Chipmaking Equipment, Congress Report Says",
    "description": "China bought about $38 billion worth of sophisticated chimaking equipment from the U.S. and its allies last year due to gaps in efforts to curb manufacturing, a bipartisan report by U.S. lawmakers has found. \nInconsistencies In Rules Allow Sales \nThe Donald T…",
    "link": "https://biztoc.com/x/1e8fdb83253b40c4",
    "timestamp": "2025-10-08T07:44:37Z"
  },
  {
    "title": "George Clooney: ‘My kids have a much better life in France. I was worried about raising our kids in the culture of Hollywood’",
    "description": "The actor wants his twins to grow up self-sufficient, free from paparazzi, and without being compared to anybody else’s famous kids",
    "link": "https://www.irishtimes.com/culture/film/2025/10/08/george-clooney-my-kids-have-a-much-better-life-in-france-i-was-worried-about-raising-our-kids-in-the-culture-of-hollywood/",
    "timestamp": "2025-10-08T07:41:20Z"
  },
  {
    "title": "Five takeaways from Pam Bondi's tense, partisan Senate hearing",
    "description": "Nerves were raw in a hearing that covered much ground, and saw Trump's attorney general go on the attack.",
    "link": "https://www.bbc.com/news/articles/c75qpl70xvzo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-08T07:25:32Z"
  },
  {
    "title": "Reddit Wouldn't Exist If ICE Had Grabbed My Mother, Says Co-Founder Alexis Ohanian: Undocumented Immigrants Can Have 'Pretty Productive' Kids",
    "description": "Reddit Inc. (NYSE:RDDT) co-founder Alexis Ohanian and Y Combinator co-founder Paul Graham are among a growing number of people condemning the Donald Trump administration's 2025 ICE deportation operations.\nPaul Graham Decries ‘Masked Thugs' Dragging People Off…",
    "link": "https://biztoc.com/x/a6a8735eb5a96592",
    "timestamp": "2025-10-08T07:21:49Z"
  },
  {
    "title": "Kaitlan Collins Reveals Why Flying With Trump Can Be No Fun For His Own Staffers",
    "description": "\"You never want to be on Air Force One on a trip” with Trump, the CNN anchor cited a source as telling her.",
    "link": "https://www.huffpost.com/entry/kaitlan-collins-donald-trump-trips_n_68e603abe4b038265cc8a37c",
    "timestamp": "2025-10-08T07:18:21Z"
  },
  {
    "title": "Why more metals facilities could put their hands up for a bail out",
    "description": "The bailout of another metals facility — this time in Queensland — is unlikely to be the last, with pressures on the sector driven by China to keep up for years.",
    "link": "https://www.abc.net.au/news/2025-10-08/metals-facility-bailout-china-price-pressure/105865170",
    "timestamp": "2025-10-08T07:14:26Z"
  },
  {
    "title": "ICE spent $825K this year on vehicles with IMSI catchers",
    "description": "US Immigration and Customs Enforcement paid $825,000 this year for surveillance tech that can spy on nearby mobile phones. TechCrunch identified the contract, which “provides Cell Site Simulator (CSS) Vehicles to support the Homeland Security Technical Operat…",
    "link": "https://www.madshrimps.be/news/ice-spent-825k-this-year-on-vehicles-with-imsi-catchers/",
    "timestamp": "2025-10-08T07:07:55Z"
  },
  {
    "title": "STEPHEN MOORE: Spectrum Sale Enhances Economic And National Security",
    "description": "One of the best features of the Big Beautiful Tax Cut was an authorization for the FCC to raise $88 to $100 billion through electronic spectrum auctions.",
    "link": "https://dailycaller.com/2025/10/08/opinion-spectrum-sale-enhances-economic-and-national-security-stephen-moore/",
    "timestamp": "2025-10-08T07:06:34Z"
  },
  {
    "title": "UK PM Starmer seeks quick implementation of trade deal with India to build business ties",
    "description": "British Prime Minister Keir Starmer said he wanted a trade deal with India to be implemented as soon as “humanly possible” as he began a two-day visit on Wednesday, joined by more than a hundred leaders from the business, culture and university sectors.",
    "link": "https://www.thehindubusinessline.com/news/uk-pm-starmer-seeks-quick-implementation-of-trade-deal-with-india-to-build-business-ties/article70138460.ece",
    "timestamp": "2025-10-08T07:06:14Z"
  },
  {
    "title": "Immigrant Jensen Huang assures workers Nvidia will continue to sponsor H-1B visas, ‘not possible without you’",
    "description": "Nvidia CEO Jensen Huang, who moved to America as an immigrant, in a message to staff assured them that the company will continue to sponsor H-1B visas. This comes after US President Donald Trump last month hiked fees to $1,00,000.&nbsp;",
    "link": "https://www.livemint.com/companies/news/immigrant-jensen-huang-assures-workers-nvidia-will-continue-to-sponsor-h-1b-visas-not-possible-without-you-donald-trump-11759906734858.html",
    "timestamp": "2025-10-08T07:05:37Z"
  },
  {
    "title": "Steel industry in UK warns of 'biggest crisis' ever as EU hikes tariffs",
    "description": "The tariffs hike provoked an immediate outcry in the U.K., and automakers in Europe are not too pleased, either.",
    "link": "https://www.cnbc.com/2025/10/08/steel-industry-in-uk-warns-of-biggest-crisis-ever-as-eu-hikes-tariffs.html",
    "timestamp": "2025-10-08T07:05:25Z"
  },
  {
    "title": "Is the federal government still shut down? What to know on Wednesday, Oct. 8.",
    "description": "The partial U.S. government shutdown entered day eight on Wednesday, Oct. 8. When could it end? Here's what we know.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/08/is-the-federal-government-still-shutdown-wednesday-october-8/86571952007/",
    "timestamp": "2025-10-08T07:01:14Z"
  },
  {
    "title": "Trump drives the shutdown coverage, but leaderless Democrats have broken through with healthcare message",
    "description": "President Trump stays above the shutdown fray as both parties oddly unite to defend federal programs, each blaming the other while eyeing a short-term spending fix.",
    "link": "https://www.foxnews.com/media/trump-drives-shutdown-coverage-leaderless-democrats-have-broken-through-healthcare-message",
    "timestamp": "2025-10-08T07:00:05Z"
  },
  {
    "title": "UK PM Starmer seeks quick implementation of India trade deal to build business ties",
    "description": "MUMBAI (Reuters) -British Prime Minister Keir Starmer said he wanted a trade deal with India to be implemented as soon as \"humanly possible\" as he began a...",
    "link": "https://www.yahoo.com/news/articles/uk-pm-starmer-seeks-quick-065828879.html",
    "timestamp": "2025-10-08T06:58:28Z"
  },
  {
    "title": "National Guard troops are outside Chicago and could be in Memphis soon in Trump's latest deployment",
    "description": "National Guard troops are positioned outside Chicago and they could be in Memphis by Friday as the Trump administration pushes ahead with an aggressive policy toward big-city crime whether local leaders support it or not.",
    "link": "https://www.cbc.ca/news/world/national-guard-chicago-memphis-latest-deployment-9.6931223",
    "timestamp": "2025-10-08T06:58:07Z"
  },
  {
    "title": "US Attorney General Pam Bondi clashes with critics at key Senate hearing",
    "description": "Democrats on the Senate panel grilled her over her leadership of the Justice Department. She hit back, with GOP support.",
    "link": "https://www.aljazeera.com/news/2025/10/8/us-attorney-general-pam-bondi-clashes-with-critics-at-key-senate-hearing",
    "timestamp": "2025-10-08T06:55:23Z"
  },
  {
    "title": "Pentagon nominee backs Trump call on 10% Taiwan defense spending",
    "description": "WASHINGTON (Reuters) -The nominee to be the Pentagon's senior official for the Indo-Pacific region said on Tuesday he strongly supported President Donald...",
    "link": "https://www.yahoo.com/news/articles/pentagon-nominee-backs-trump-call-065441740.html",
    "timestamp": "2025-10-08T06:54:41Z"
  },
  {
    "title": "Explainer: Trump keeps bringing up the Insurrection Act – what is it?",
    "description": "U.S. President Donald Trump on Monday said he might use the Insurrection Act, a law authorising the president to deploy military forces on U.S. soil, if courts and governors continue to block his deployment of National Guard troops in Democratic-led cities.",
    "link": "https://www.independent.ie/world-news/north-america/explainer-trump-keeps-bringing-up-the-insurrection-act-what-is-it/a1586654922.html",
    "timestamp": "2025-10-08T06:53:29Z"
  },
  {
    "title": "White House suggests some federal workers may not get back pay after shutdown",
    "description": "With the shutdown about to enter its second week, Trump says some furloughed workers \"don't deserve to be taken care of\".",
    "link": "https://www.bbc.com/news/articles/cwyld9qqgv8o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-08T06:51:09Z"
  },
  {
    "title": "EU 'must respond' to Russia's 'hybrid warfare': von der Leyen",
    "description": "Strasbourg, France Oct 8, 2025\n\n\n EU chief Ursula von der Leyen on Wednesday said Europe must ramp up its defences to deter Russia's \"hybrid warfare\", after a catalogue of air incursions, cyber attacks and damage to undersea cables. \n\n\"These incidents are cal…",
    "link": "https://www.spacewar.com/reports/EU_must_respond_to_Russias_hybrid_warfare_von_der_Leyen_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Gaza war second anniversary could reopen path to Palestinian statehood",
    "description": "Washington DC (UPI) Oct 7, 2025 \n\n\n Hamas's daring \"Operation Al Aqsa Flood\" two years ago and Israel's devastating war on the Gaza Strip have not only transformed the Middle East, but also reverberated across the world. \n They have again drawn attention to t…",
    "link": "https://www.spacewar.com/reports/Gaza_war_second_anniversary_could_reopen_path_to_Palestinian_statehood_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Trump unlikely to win Nobel Peace Prize, but who will?",
    "description": "Oslo (AFP) Oct 8, 2025\n\n When it comes to this year's Nobel Peace Prize, one thing is almost certain: US President Donald Trump will not win, no matter how much he wants it. But who will? \n\nThe Norwegian Nobel Committee in Oslo will bring the suspense to an e…",
    "link": "https://www.spacewar.com/reports/Trump_unlikely_to_win_Nobel_Peace_Prize_but_who_will_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Iran dismissees Israel's missile concern as 'made-up threat'",
    "description": "Tehran (AFP) Oct 7, 2025\n\n\n Iran on Tuesday dismissed Israeli Prime Minister Benjamin Netanyahu's warnings over its missile programme as fabricated, after he alleged the Islamic republic was developing rockets capable of reaching US cities. \n\nIn an interview …",
    "link": "https://www.spacewar.com/reports/Iran_dismissees_Israels_missile_concern_as_made-up_threat_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "EU proposes 50% steel tariffs mirroring Trump",
    "description": "“Global overcapacity is damaging our industry,” Ursula von der Leyen has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626059-eu-proposes-steel-tariffs/",
    "timestamp": "2025-10-08T06:48:44Z"
  },
  {
    "title": "Jimmy Kimmel Torches Trump's Jeffrey Epstein Denial With Supercut",
    "description": "The late night host said it's clear that Trump doesn't want Americans to see what's in the Epstein files.",
    "link": "https://www.huffpost.com/entry/kimmel-trump-epstein-video_n_68e5ea7ee4b07aeeb194ffec",
    "timestamp": "2025-10-08T06:28:04Z"
  },
  {
    "title": "Former FBI chief Comey to make first US court appearance",
    "description": "Former FBI director James Comey, a prominent critic of US President Donald Trump, is to make his first court appearance to face charges of making false statements and obstructing a congressional proceeding.",
    "link": "https://www.rte.ie/news/us/2025/1008/1537384-james-comey-us/",
    "timestamp": "2025-10-08T06:25:53Z"
  },
  {
    "title": "Wednesday's papers: Finnair's Trump slump, central bank's crisis planning, and Finland's cheapest petrol",
    "description": "The Bank of Finland is looking to set up a way for people to continue buying essentials when regular banking systems are offline.",
    "link": "https://yle.fi/a/74-20187227",
    "timestamp": "2025-10-08T06:19:21Z"
  },
  {
    "title": "There is good reason to be worried as gold smashes past $4,000 per ounce",
    "description": "Sky's James Sillars writes that a toxic cocktail of pressures are driving investors to the safe haven asset - and it's a signal we should not ignore.",
    "link": "https://news.sky.com/story/gold-smashes-past-4-000-per-ounce-but-there-is-good-reason-to-be-worried-13446794",
    "timestamp": "2025-10-08T06:16:00Z"
  },
  {
    "title": "Trump memecoin issuer pursues $200 million funding to build digital asset treasury: Bloomberg",
    "description": "Fight Fight Fight LLC, the company behind Donald Trump’s memecoin, is seeking to raise at least $200 million to establish a digital asset treasury.",
    "link": "https://biztoc.com/x/5894f489d6b90a26",
    "timestamp": "2025-10-08T06:14:46Z"
  },
  {
    "title": "Former FBI chief James Comey to make first US court appearance",
    "description": "Former FBI director James Comey, a prominent critic of US President Donald Trump, is to make his first court appearance on Wednesday to face charges of making false statements and obstructing a congressional proceeding. Appointed to head the FBI by former pre…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/former-fbi-chief-james-comey-to-make-first-us-court-appearance/articleshow/124378726.cms",
    "timestamp": "2025-10-08T06:14:04Z"
  },
  {
    "title": "Analysis-Rising tungsten prices worsen oil drillers' inflation worries",
    "description": "(Reuters) -U.S. shale drillers are facing higher prices for tungsten, a rare, ultra-hard metal used for industrial tools like drillbits, as Chinese export...",
    "link": "https://finance.yahoo.com/news/analysis-rising-tungsten-prices-worsen-061403792.html",
    "timestamp": "2025-10-08T06:14:03Z"
  },
  {
    "title": "Bob Ross paintings to be auctioned to support public TV stations after federal funding cuts",
    "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations",
    "link": "https://abcnews.go.com/Business/wireStory/bob-ross-paintings-auctioned-support-public-tv-stations-126291689",
    "timestamp": "2025-10-08T06:13:47Z"
  },
  {
    "title": "National Guard troops are outside Chicago and could be in Memphis soon in Trump's latest deployment",
    "description": "National Guard troops are positioned outside Chicago and they could soon be in Memphis as the Trump administration pushes ahead with an aggressive policy toward big-city crime whether local leaders support it or not",
    "link": "https://abcnews.go.com/US/wireStory/national-guard-troops-chicago-memphis-trumps-latest-deployment-126317995",
    "timestamp": "2025-10-08T06:13:43Z"
  },
  {
    "title": "Analysis-Turkey's gas shift threatens Russia and Iran's last big European market",
    "description": "ISTANBUL (Reuters) -Turkey could meet more than half of its gas needs by the end of 2028 by ramping up production and increasing U.S. imports, in a shift...",
    "link": "https://finance.yahoo.com/news/analysis-turkeys-gas-shift-threatens-061118977.html",
    "timestamp": "2025-10-08T06:11:18Z"
  },
  {
    "title": "Man dies in likely bear attack at Arkansas campsite days after sending photos of animal to family",
    "description": "A Missouri man was found dead from a likely bear attack this week, just two days after he sent photos to his family of a bear at his campsite in Arkansas, according to officials. Police found the 60-year-old man’s body several hundred yards from his campsite …",
    "link": "https://freerepublic.com/focus/f-chat/4344995/posts",
    "timestamp": "2025-10-08T06:07:55Z"
  },
  {
    "title": "The unraveling of a pardon: Dinesh D’Souza now shills for Israel years after Trump clemency",
    "description": "Dinesh D’Souza was prosecuted in 2014 for campaign finance violations (using “straw donors” to exceed contribution limits). Critics, including Harvard’s Alan Dershowitz, argued the harsh sentencing (probation, fines, mandatory therapy) was politically motivat…",
    "link": "https://www.naturalnews.com/2025-10-08-dinesh-dsouza-pardoned-by-trump-israel-shill.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Hamas softens hostage terms as Houthi sanctions deepen regional tensions",
    "description": "Hamas appeared to soften its stance by offering to release hostages in exchange for a fighting pause, but Israel insists any deal must include Hamas’s complete disarmament. Negotiations have grown more direct: Israel’s Mossad chief is now engaging with Hamas …",
    "link": "https://www.naturalnews.com/2025-10-08-hamas-softens-hostage-terms-houthi-sanctions-deepen-tensions.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Israeli airstrikes continue to pound Gaza despite Trump-ordered CEASEFIRE",
    "description": "Despite U.S. President Trump’s directive to “immediately stop the bombing,” Israel continues devastating strikes, killing over 100 Palestinians in two days. Targets include densely populated neighborhoods, refugee camps and aid centers, worsening Gaza’s human…",
    "link": "https://www.naturalnews.com/2025-10-08-israeli-attacks-gaza-despite-trump-ordered-ceasefire.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Federal showdown: Texas National Guard deploys to Chicago amid escalating immigration clash",
    "description": "Texas National Guard troops arrive in Chicago following Trump’s order to combat violent unrest and enforce immigration laws. Illinois officials file lawsuit against federal intervention, accusing Trump of overreach and violating state sovereignty. Chicago May…",
    "link": "https://www.naturalnews.com/2025-10-08-texas-national-guard-deploys-to-chicago-immigration-clash.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Trump defies court order, deploys National Guard members to Portland",
    "description": "President Donald Trump deployed 300 California National Guard troops to Portland despite a federal judge’s ruling that such militarization violates constitutional limits on domestic law enforcement. California Gov. Gavin Newsom and Oregon Gov. Tina Kotek cond…",
    "link": "https://www.naturalnews.com/2025-10-08-trump-defies-court-deploys-national-guard-portland.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "A “furious” Britain, a resurgent Russia and the specter of a wider war",
    "description": "The U.K.’s strategy has failed and backfired. A long-standing British plan to engineer a “strategic defeat” for Russia has not worked. Instead of being weakened, Russia has emerged stronger and more emboldened, leaving the U.K. exposed and reportedly furious.…",
    "link": "https://www.naturalnews.com/2025-10-08-furious-britain-resurgent-russia-specter-wider-war.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Markets stay calm despite US shutdown; Ed Yardeni sees strong earnings ahead",
    "description": "US markets show surprising calm amid a prolonged government shutdown. Strong corporate earnings, particularly from cloud computing firms and banks, are bolstering investor confidence. While Oracle's profit warning caused brief jitters, demand for AI infrastru…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/markets-stay-calm-despite-us-shutdown-ed-yardeni-sees-strong-earnings-ahead/articleshow/124378325.cms",
    "timestamp": "2025-10-08T05:50:44Z"
  },
  {
    "title": "Sherrill, Ciattarelli to meet in final debate in New Jersey governor's race",
    "description": "Democrat Mikie Sherrill and Republican Jack Ciattarelli will go head-to-head in their final debate for New Jersey governor",
    "link": "https://abcnews.go.com/Politics/wireStory/sherrill-ciattarelli-meet-final-debate-new-jersey-governors-126317336",
    "timestamp": "2025-10-08T05:49:46Z"
  },
  {
    "title": "Bari Weiss Takes Her Grift Mainstream",
    "description": "Journalism's biggest fraud takes the reins at CBS",
    "link": "https://stringinamaze.net/p/bari-weiss-takes-her-grift-mainstream",
    "timestamp": "2025-10-08T05:47:01Z"
  },
  {
    "title": "Unlawful Attacks on Venezuelan Vessels | New York City Bar Association",
    "description": "Congress must act promptly, as pending legislation proposes, to make clear to the President and the nation that the President’s threat of similar attacks on Venezuelan vessels (and on Venezuela itself) are unlawful and must not be repeated.",
    "link": "https://www.nycbar.org/press-releases/unlawful-attacks-on-venezuelan-vessels/",
    "timestamp": "2025-10-08T05:47:01Z"
  },
  {
    "title": "급진 우파의 민주주의는 결국 독재",
    "description": "Seven-figure salaries await those who manage the fortunes of the ultra-rich -- if they're lucky enough to be based in the US https://t.co/0e6jLVeIWk— Bloomberg (@business) October 7, 2025 Tropical Storm Jerry formed in the Atlantic east of the Caribbean, beco…",
    "link": "https://ryueyes11.tistory.com/511917",
    "timestamp": "2025-10-08T05:46:14Z"
  },
  {
    "title": "Pakistan set to receive advance US Air-to-Air missiles",
    "description": "Dawn mentioned that Pakistan had previously bought 700 AMRAAM in January 2007- which at that time was the largest international order for the weapon",
    "link": "https://www.thehindubusinessline.com/news/world/pakistan-set-to-receive-advance-us-air-to-air-missiles/article70138196.ece",
    "timestamp": "2025-10-08T05:41:58Z"
  },
  {
    "title": "A veteran defense lawyer turned judge will oversee the case against ex-FBI director James Comey",
    "description": "The federal judge overseeing the Justice Department’s prosecution of former FBI director James Comey has already handled cases in President Donald Trump’s orbit",
    "link": "https://abcnews.go.com/US/wireStory/veteran-defense-lawyer-turned-judge-oversee-case-fbi-126317398",
    "timestamp": "2025-10-08T05:41:49Z"
  },
  {
    "title": "19-hour escape: US, Israel, and Jordan unite to save Navy officer’s mother from Gaza",
    "description": "Ahlam Firwana, 59, was escorted out of Gaza in a 19-hour operation coordinated by U.S., Israeli, and Jordanian officials after her son, a US Navy medic, sought help to save her.",
    "link": "https://www.israelnationalnews.com/news/415949",
    "timestamp": "2025-10-08T05:36:49Z"
  },
  {
    "title": "TCS Q2 preview: Can CEO Krithivasan put an end to the IT major's misery?",
    "description": "TCS faces multiple challenges, including a potential revenue decline and layoffs that could impact morale. The company’s growth has slowed, and new visa regulations may further impact its performance. Will TCS break its growth drought in Q2 under CEO Krithiva…",
    "link": "https://www.livemint.com/companies/news/tcs-q2-earnings-tata-consultancy-services-tcs-layoffs-k-krithivasan-indian-it-services-tcs-stock-11759893894014.html",
    "timestamp": "2025-10-08T05:31:24Z"
  },
  {
    "title": "Europe wants a reliable partner. India needs to step up",
    "description": "The EU's strategy to engage India faced a setback as New Delhi participated in military exercises with Russia and Belarus, causing European frustration. While the EU seeks investment and partnership, India's continued ties with Moscow and seemingly unnecessar…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/europe-wants-a-reliable-partner-india-needs-to-step-up/articleshow/124377190.cms",
    "timestamp": "2025-10-08T05:24:39Z"
  },
  {
    "title": "Britain’s once-mighty Conservative Party is battling to avoid extinction",
    "description": "The Conservative Party once dominated British politics, but is struggling to remain a force after being ousted in 2024",
    "link": "https://abcnews.go.com/International/wireStory/britains-mighty-conservative-party-battling-avoid-extinction-126316937",
    "timestamp": "2025-10-08T05:20:45Z"
  },
  {
    "title": "Intel to reveal tech details on forthcoming PC chip: Reports",
    "description": "Intel plans to release technical details about its forthcoming chip for laptops, known as Panther Lake, on Thursday, four sources briefed on the plans told Reuters. It is part of an effort to reassure investors about Intel’s first product made entirely using …",
    "link": "https://indianexpress.com/article/technology/tech-news-technology/intel-to-reveal-tech-details-on-forthcoming-pc-chip-reports-10294368/",
    "timestamp": "2025-10-08T05:13:38Z"
  },
  {
    "title": "House Speaker Johnson Calls Bad Bunny’s Super Bowl Booking ‘a Terrible Decision,’ Says It Should’ve Been Someone With ‘a Broader Audience’ — Like Lee Greenwood",
    "description": "House Speaker Mike Johnson has weighed in on the political debate over Bad Bunny being booked to play the 2026 Super Bowl halftime show, saying it was “a terrible decision” — echoing the beliefs of President Donald J. Trump, who already established his own an…",
    "link": "https://variety.com/2025/music/news/house-speaker-johnson-bad-bunny-super-bowl-halftime-1236542862/",
    "timestamp": "2025-10-08T05:13:18Z"
  },
  {
    "title": "US, Qatar, Türkiye to join third day of Gaza peace talks in Egypt",
    "description": "Qatar's prime minister and senior delegates from the United States and Türkiye will join Hamas and Israeli negotiators on Wednesday for a third day of talks aimed at ending the Gaza war.",
    "link": "https://www.hurriyetdailynews.com/us-qatar-turkiye-to-join-third-day-of-gaza-peace-talks-in-egypt-214426",
    "timestamp": "2025-10-08T05:13:06Z"
  },
  {
    "title": "Is Donald Trump planning to topple Nicolas Maduro regime in Venezuela or is it just attack on drug cartels?",
    "description": "Donald Trump, like his predecessor Joe Biden, does not recognize Nicolas Maduro as Venezuela's legitimate president, claiming that he fraudulently retained power after elections last year.",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-donald-trump-planning-to-topple-nicolas-maduro-regime-in-venezuela-or-is-it-just-attack-on-drug-cartels/articleshow/124377375.cms",
    "timestamp": "2025-10-08T05:04:44Z"
  },
  {
    "title": "Comey to make first court appearance in Justice Department case accusing him of lying to Congress",
    "description": "Former FBI Director James Comey is set to make his first court appearance in a Justice Department criminal case accusing him of having lied to Congress five years ago",
    "link": "https://abcnews.go.com/US/wireStory/comey-make-court-appearance-justice-department-case-accusing-126317327",
    "timestamp": "2025-10-08T05:01:24Z"
  },
  {
    "title": "Trump Will Send Bitcoin To $250,000 By EOY With This Secret Weapon: Arthur Hayes",
    "description": "Arthur Hayes believes Bitcoin can double into year-end—and he says the catalyst is a White House blueprint to capture the levers of US monetary policy. In an appearance on The Rollup, the BitMEX co-founder sketched a path to $250,000 per coin predicated on wh…",
    "link": "http://www.newsbtc.com/bitcoin-news/trump-bitcoin-250000-by-eoy-arthur-hayes/",
    "timestamp": "2025-10-08T05:00:23Z"
  },
  {
    "title": "3 Democratic Justices Hope to Keep Pennsylvania Supreme Court Seats",
    "description": "There are no $1 million giveaways to voters, cheesehead hats or even candidate debates. Elon Musk is nowhere to be found. Yet the stakes in the Pennsylvania election this fall are very much the same as they were in Wisconsin …",
    "link": "https://www.insurancejournal.com/news/east/2025/10/08/843034.htm",
    "timestamp": "2025-10-08T05:00:09Z"
  },
  {
    "title": "3 Democratic Justices Hope to Keep Pennsylvania Supreme Court Seats",
    "description": "There are no $1 million giveaways to voters, cheesehead hats or even candidate debates. Elon Musk is nowhere to be found. Yet the stakes in the Pennsylvania election this fall are very much the same as they were in Wisconsin …",
    "link": "https://www.insurancejournal.com/news/national/2025/10/08/843034.htm",
    "timestamp": "2025-10-08T05:00:09Z"
  },
  {
    "title": "Rufus Wainwright on music, politics and life: ‘Creativity helps to fend off the darker angels’",
    "description": "Next month, the musician releases a cover album of songs by his hero Kurt Weill. He talks to Jude Rogers about life under Trump, hanging out with Marianne Faithfull and why he’ll never criticise Britain over Brexit again",
    "link": "https://www.the-independent.com/arts-entertainment/music/features/rufus-wainwright-interview-trump-b2840980.html",
    "timestamp": "2025-10-08T05:00:00Z"
  },
  {
    "title": "White House memo says federal workers may not get automatic backpay: Report",
    "description": "The memo is seen as a pressure tactic on Democrats as the US government shutdown heads into its eighth day.",
    "link": "https://www.aljazeera.com/news/2025/10/8/white-house-memo-says-federal-workers-may-not-get-automatic-backpay-report",
    "timestamp": "2025-10-08T04:54:31Z"
  },
  {
    "title": "Trump aide freezes on live TV after controversial claim about president",
    "description": "A Trump administration official faces criticism after allegedly claiming US President Donald Trump has \"plenary authority\" while on a live interview with CNN.",
    "link": "https://www.abc.net.au/news/2025-10-08/stephen-miller-donald-trump-plenary-authority/105865430",
    "timestamp": "2025-10-08T04:51:05Z"
  },
  {
    "title": "Jimmy Kimmel trolls Trump after beating him in approval poll: ‘I am more popular than the president’",
    "description": "A new YouGov poll gave Kimmel a 16-point lead in favorability over the president",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-kimmel-trump-president-approval-poll-ratings-b2841405.html",
    "timestamp": "2025-10-08T04:46:35Z"
  },
  {
    "title": "Taylor Swift shuts down Super Bowl halftime show rumors about Travis Kelce",
    "description": "Pop superstar appeared Monday on ‘The Tonight Show Starring Jimmy Fallon’ to promote her new album, ‘The Life of a Showgirl’",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/taylor-swift-super-bowl-rumors-travis-kelce-jimmy-fallon-b2841404.html",
    "timestamp": "2025-10-08T04:42:33Z"
  },
  {
    "title": "US special envoy and Trump's son-in-law to join Gaza peace talks in Egypt",
    "description": "The arrival of Steve Witkoff and Jared Kushner comes as a second day of talks ended without tangible results, a Palestinian official tells the BBC.",
    "link": "https://www.bbc.com/news/articles/cdjzvlxp8mjo",
    "timestamp": "2025-10-08T04:38:52Z"
  },
  {
    "title": "Federal government shutdown grinds into a second week, but quiet talks emerging",
    "description": "As the federal government shutdown enters a second week, there’s no discernible endgame in sight",
    "link": "https://abcnews.go.com/Politics/wireStory/federal-government-shutdown-grinds-week-quiet-talks-emerging-126316940",
    "timestamp": "2025-10-08T04:37:32Z"
  },
  {
    "title": "‘The Daily Show’ Roasts Trump For Dodging Ghislaine Maxwell Pardon Question With Diddy Name Drop: ‘None of That Went Well’ | Video",
    "description": "\"All you had to do is mention someone else who was not convicted of sex crimes,\" host Josh Johnson says\nThe post ‘The Daily Show’ Roasts Trump For Dodging Ghislaine Maxwell Pardon Question With Diddy Name Drop: ‘None of That Went Well’ | Video appeared first …",
    "link": "https://www.thewrap.com/the-daily-show-trump-ghislaine-maxwell-pardon-question-diddy-name-drop/",
    "timestamp": "2025-10-08T04:32:52Z"
  },
  {
    "title": "US govt shutdown grinds into second week, but quiet talks emerging",
    "description": "Government tours are halted. The House remains closed. The Senate faces repeated failed votes. President Donald Trump threatens federal worker firings and no back pay. The shutdown enters its second week with no resolution. Both parties are entrenched in thei…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-govt-shutdown-grinds-into-second-week-but-quiet-talks-emerging/articleshow/124376789.cms",
    "timestamp": "2025-10-08T04:32:07Z"
  },
  {
    "title": "Untethered To the Facts",
    "description": "Armed terrorism by the White House escalates - What stage of fascism is it when the fuhrer defies the courts to send in troops anyway? - as does the batshit rhetoric about left-wing \"terrorism\" to hide their own, the fever dream agitprop to buttress the fanta…",
    "link": "https://www.commondreams.org/further/untethered-to-the-facts",
    "timestamp": "2025-10-08T04:30:42Z"
  },
  {
    "title": "Max Boot: Disturbing nuclear war film ‘A House of Dynamite’ sounds stark alarm but world leaders are in no mood to take any notice",
    "description": "There are a lot of things to worry about in the world today. Acclaimed director Kathryn Bigelow (Zero Dark Thirty, The Hurt Locker) has made a new film, A House of Dynamite, warning of a danger most would sooner forget.",
    "link": "https://www.independent.ie/opinion/comment/max-boot-disturbing-nuclear-war-film-a-house-of-dynamite-sounds-stark-alarm-but-world-leaders-are-in-no-mood-to-take-any-notice/a882924320.html",
    "timestamp": "2025-10-08T04:30:00Z"
  },
  {
    "title": "Hamas says it is serious about Gaza deal, but still has set of demands",
    "description": "Hamas said yesterday it wants to reach a deal to end the war in Gaza based on US president Donald Trump’s plan but still has a set of demands, a statement signalling that indirect talks with Israel in Egypt could be difficult and lengthy.",
    "link": "https://www.independent.ie/world-news/middle-east/hamas-says-it-is-serious-about-gaza-deal-but-still-has-set-of-demands/a193945451.html",
    "timestamp": "2025-10-08T04:30:00Z"
  },
  {
    "title": "Donald Trump threatens no back pay for federal workers hit in US government shutdown",
    "description": "US president Donald Trump’s administration warned yesterday of no guaranteed back pay for federal workers during a government shutdown, reversing what has been long-standing policy for about 750,000 furloughed employees, according to a memo being circulated b…",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-threatens-no-back-pay-for-federal-workers-hit-in-us-government-shutdown/a532351695.html",
    "timestamp": "2025-10-08T04:30:00Z"
  },
  {
    "title": "Moscow seeking clarity from US on possible supply of Tomahawk long-range missiles to Ukraine",
    "description": "Russia said yesterday it was waiting for clarity from the United States about the possible supply of Tomahawk missiles to Ukraine, saying such weapons could theoretically carry nuclear warheads.",
    "link": "https://www.independent.ie/world-news/europe/moscow-seeking-clarity-from-us-on-possible-supply-of-tomahawk-long-range-missiles-to-ukraine/a838758847.html",
    "timestamp": "2025-10-08T04:30:00Z"
  }
]