[
  {
    "title": "GOP lawmaker accuses Trump of lying like Bush to start a war: 'Same playbook'",
    "description": "Rep. Thomas Massie (R-KY) accused President Donald Trump of following former President George W. Bush's playbook by lying to the country to start a war.\"The framers understood a simple truth. To the extent that war-making power devolves to one person, liberty…",
    "link": "https://www.rawstory.com/thomas-massie-trump-2674427464/",
    "timestamp": "2025-12-17T19:47:32Z"
  },
  {
    "title": "How to Watch Donald Trump’s National Address Live Online",
    "description": "President Donald J. Trump is set to deliver a primetime national address from the White House at 9 p.m. ET on Wednesday. The address, set to focus on Trump’s economic record and his 2026 policy priorities, comes at a critical moment for the Republican leader.…",
    "link": "https://variety.com/2025/shopping/news/how-to-watch-donald-trump-national-address-live-online-1236611170/",
    "timestamp": "2025-12-17T19:46:49Z"
  },
  {
    "title": "New plaques on Trump’s ‘Presidential Walk of Fame’ offer pointed descriptions of predecessors | CNN Politics",
    "description": "The White House has installed plaques along President Donald Trump’s “Presidential Walk of Fame,” offering descriptions of his predecessors, often written in the style of his social media posts — including insults, baseless claims and random capitalization.",
    "link": "https://www.cnn.com/2025/12/17/politics/presidential-walk-of-fame-plaques-trump",
    "timestamp": "2025-12-17T19:45:31Z"
  },
  {
    "title": "Vanity Fair writer defends Susie Wiles interview, says everything was recorded",
    "description": "Vanity Fair writer Chris Whipple defended his interview with President Donald Trump's Chief of Staff Susie Wiles on Tuesday after she said it was \"disingenuously framed.\"",
    "link": "https://www.foxnews.com/media/vanity-fair-writer-defends-susie-wiles-interview-says-everything-recorded",
    "timestamp": "2025-12-17T19:45:11Z"
  },
  {
    "title": "Photos show how White House Hanukkah celebrations have changed through the years",
    "description": "President Donald Trump participates in a Hanukkah Reception in the East Wing of the White House, Tuesday, December 16, 2025.\nOfficial White House Photo by Molly Riley\nJimmy Carter was the first president to recognize Hanukkah with a menorah lighting in 1979.\n…",
    "link": "https://biztoc.com/x/ce84cd6b2f0e676e",
    "timestamp": "2025-12-17T19:42:09Z"
  },
  {
    "title": "New Jobs Data Blows Up One of Trump’s Main Talking Points",
    "description": "President Donald Trump wants to pretend like he’s not crippling the economy, but job growth in 2025 has dropped by more than half and it’s all his fault. Only 499,000 jobs were created between February and November 2025, according to new data from the Bureau …",
    "link": "https://newrepublic.com/post/204557/new-jobs-data-donald-trump-economy",
    "timestamp": "2025-12-17T19:40:32Z"
  },
  {
    "title": "Jack Smith heckled on Capitol Hill by Trump's self-described 'secretary of retribution'",
    "description": "A former U.S. Army Reserve lieutenant colonel and Green Beret who has become a far-right political operative and activist recorded himself heckling former special counsel Jack Smith on Capitol Hill, following Smith and shouting derogatory names.Ivan Raiklin, …",
    "link": "https://www.rawstory.com/ivan-raiklin/",
    "timestamp": "2025-12-17T19:38:12Z"
  },
  {
    "title": "White House Puts Up Wild, Trumpified Plaques Describing Biden as ‘the Worst’ and Reagan as a ‘Fan’ of Trump Outside Oval Office",
    "description": "\"Sleepy Joe Biden was, by far, the worst President in American History,\" reads an official plaque that the White House has put up outside of the Oval Office.\nThe post White House Puts Up Wild, Trumpified Plaques Describing Biden as ‘the Worst’ and Reagan as a…",
    "link": "https://www.mediaite.com/media/news/white-house-puts-up-wild-trumpified-plaques-describing-biden-as-the-worst-and-reagan-as-a-fan-of-trump-outside-oval-office/",
    "timestamp": "2025-12-17T19:35:38Z"
  },
  {
    "title": "Gavin Newsom Responds to Nicki Minaj's Transphobic Posts",
    "description": "Gavin Newsom Responds to Nicki Minaj's Transphobic Postslittlethings.com",
    "link": "https://littlethings.com/entertainment/gavin-newsom-nicki-minaj-feud",
    "timestamp": "2025-12-17T19:33:23Z"
  },
  {
    "title": "Rep. Sarah McBride Condemns Republicans’ Upcoming Anti-Trans Votes",
    "description": "One bill proposes a national felony ban on trans youth health care, another aims to bar Medicaid from covering care.",
    "link": "https://www.erininthemorning.com/p/they-are-obsessed-with-trans-people",
    "timestamp": "2025-12-17T19:31:18Z"
  },
  {
    "title": "Eric Swalwell Skips More House Votes Than Any Active Member of Congress, Analysis Finds",
    "description": "Swalwell reportedly has skipped more House votes than any active member of Congress, according to voting record data.",
    "link": "https://dailycaller.com/2025/12/17/eric-swalwell-skips-more-house-votes-any-active-member-congress-analysis-finds/",
    "timestamp": "2025-12-17T19:30:50Z"
  },
  {
    "title": "Assange brings ‘instrument of war’ case against Nobel Foundation",
    "description": "The Nobel Foundation has awarded the Peace Prize to a laureate who is lobbying for a new US war, Julian Assange has argued Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629571-assange-war-nobel-prize-machado/",
    "timestamp": "2025-12-17T19:30:45Z"
  },
  {
    "title": "Son of filmmaker Rob Reiner appears in court on charges he murdered parents",
    "description": "Nick Reiner (32) is accused of fatally stabbing father and mother",
    "link": "https://www.irishtimes.com/world/us/2025/12/17/son-of-filmmaker-rob-reiner-appears-in-court-on-charges-he-murdered-parents/",
    "timestamp": "2025-12-17T19:30:35Z"
  },
  {
    "title": "‘Non-Political’ Creators Have Outsized Influence on Audience’s Politics, Study Finds",
    "description": "Measuring the Joe Rogan effect.",
    "link": "https://gizmodo.com/non-political-creators-have-outsized-influence-on-audiences-politics-study-finds-2000700841",
    "timestamp": "2025-12-17T19:30:35Z"
  },
  {
    "title": "James Cameron calls Trump ‘most narcissistic a------- in history’ as he worries about humanity's future",
    "description": "James Cameron blasts Trump, warns about AI dangers in Hollywood, and reveals he may leave \"Avatar\" franchise depending on future box office performance.",
    "link": "https://www.foxnews.com/media/james-cameron-calls-trump-most-narcissistic-a-history-he-worries-about-humanitys-future",
    "timestamp": "2025-12-17T19:30:25Z"
  },
  {
    "title": "New ‘Melania’ Trailer Has People Wondering If It’s An ‘AI Parody’",
    "description": "One person admitted the \"disdain\" the first lady shows to Trump in the trailer \"makes it tempting to watch and might have sold me.\"",
    "link": "https://www.huffpost.com/entry/melania-documentary-critics-react_n_6942e6fbe4b0fd459eef6077",
    "timestamp": "2025-12-17T19:30:04Z"
  },
  {
    "title": "UN chief calls for immediate de-escalation of US-Venezuela tensions",
    "description": "Venezuela complained to the United Nations Security Council over the US seizure of an oil tanker calling it  \"state-sponsored piracy\" and the \"illegitimate use of military force against a private vessel.\"",
    "link": "https://indianexpress.com/article/world/un-chief-calls-for-immediate-de-escalation-of-us-venezuela-tensions-10425920/",
    "timestamp": "2025-12-17T19:29:57Z"
  },
  {
    "title": "They prosecuted the Capitol rioters. Now the rioters and the DOJ are after them.",
    "description": "After Trump’s mass pardons of the U.S. Capitol rioters, some have gained influence inside the Justice Department, meeting with officials to push for prosecutions of the federal lawyers who once helped convict them, Reuters found. The January 6 prosecutors des…",
    "link": "https://freerepublic.com/focus/f-news/4357846/posts",
    "timestamp": "2025-12-17T19:28:22Z"
  },
  {
    "title": "Warner Bros. board recommends taking Netflix takeover offer",
    "description": "The Warner Bros. board informed its shareholders that the Paramount offer is \"inferior\" to the one from Netflix.",
    "link": "https://www.dw.com/en/warner-bros-board-recommends-taking-netflix-takeover-offer/a-75209941",
    "timestamp": "2025-12-17T19:27:00Z"
  },
  {
    "title": "Meet the 4 Republicans who defied House Speaker Mike Johnson on ACA subsidies",
    "description": "Four moderate House Republicans have broken ranks with Speaker Mike Johnson by supporting a Democratic petition to extend health care subsidies set to expire at the end of the year",
    "link": "https://abcnews.go.com/Politics/wireStory/meet-4-republicans-defied-house-speaker-mike-johnson-128493694",
    "timestamp": "2025-12-17T19:25:35Z"
  },
  {
    "title": "Twitch’s Controversial, Gambling-Heavy Rival Just Got An App On Xbox",
    "description": "Kick, the controversial streaming platform, announced a partnership with Xbox\nThe post Twitch’s Controversial, Gambling-Heavy Rival Just Got An App On Xbox appeared first on Kotaku.",
    "link": "https://kotaku.com/xbox-kick-app-streaming-gambling-stake-twitch-2000654234",
    "timestamp": "2025-12-17T19:24:43Z"
  },
  {
    "title": "The Marxist Transformation of the Democrat Party",
    "description": "Since 1912 and the election of Woodrow Wilson, the Democrat Party has been America’s left-wing political party. Nonetheless, over the decades it has maintained tenuous ties to the basic tenets of the nation’s founding. In the 1930s, beginning with what was a …",
    "link": "https://freerepublic.com/focus/f-chat/4357845/posts",
    "timestamp": "2025-12-17T19:24:30Z"
  },
  {
    "title": "These dismal numbers don't lie: Trouble is coming for Trump",
    "description": "The Bureau of Labor Statistics — which can still be trusted! — reported this week that just 64,000 jobs were added to the economy in November.That’s not enough to keep up with the number of people looking for jobs. Hence, the jobless rate rose last month to 4…",
    "link": "https://www.rawstory.com/job-numbers-2674424030/",
    "timestamp": "2025-12-17T19:24:01Z"
  },
  {
    "title": "Maine 'mama bear' facing threats as parents battle to keep 8-year-old boy off girls' basketball team",
    "description": "Maine parents protest 8-year-old transgender child joining girls basketball team, citing safety concerns and creating private league after board votes 3-2.",
    "link": "https://www.foxnews.com/us/maine-mama-bear-facing-threats-parents-battle-keep-8-year-old-boy-off-girls-basketball-team",
    "timestamp": "2025-12-17T19:23:59Z"
  },
  {
    "title": "Notice A Pattern?: Trump Attacks Yamiche Alcindor As “Very Aggressive”",
    "description": "Once again, President Donald Trump clashed with a Black female journalist, and he used a stereotype to do so. The incident occurred last Friday (December 12) at a press conference in the Oval Office at the White House, and it involved NBC News Washington corr…",
    "link": "https://hiphopwired.com/2954292/trump-attacks-black-female-reporter-as-very-aggressive/",
    "timestamp": "2025-12-17T19:22:32Z"
  },
  {
    "title": "Why Trump's low-profile chief of staff Susie Wiles is making headlines",
    "description": "The long-time political operator is unusually candid during a series of interviews with magazine Vanity Fair.",
    "link": "https://www.abc.net.au/news/2025-12-18/susie-wiles-vanity-fair-white-house-trump/106155936",
    "timestamp": "2025-12-17T19:21:30Z"
  },
  {
    "title": "Trump Asked Xi Jinping to Free Anti-Communist Hong Kong Media Mogul Jimmy Lai",
    "description": "President Donald Trump said on Monday that he asked Chinese dictator Xi Jinping to free Jimmy Lai, the pro-democracy Hong Kong media mogul who is awaiting sentencing after he was found guilty of “colluding with foreign forces” on Monday. “I feel so badly. I s…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357843/posts",
    "timestamp": "2025-12-17T19:21:00Z"
  },
  {
    "title": "Trump's National Address Live: President To Announce Agenda For Next Three Years",
    "description": "President Donald Trump is set to address the nation at 9 p.m. ET on Wednesday night in a live speech from the White House.\n”It has been a great year for our Country, and THE BEST IS YET TO COME,” Trump said in a Truth Social post as he announced the address.\n…",
    "link": "https://biztoc.com/x/c7efb251ea1d7e87",
    "timestamp": "2025-12-17T19:20:29Z"
  },
  {
    "title": "'Melania': Amazon Releases Trailer for the Feature Documentary About the First Lady",
    "description": "The trailer for a new documentary film Melania, about Melania Trump's journey to becoming first lady for a second time has debuted.\nThe post ‘Melania’: Amazon Releases Trailer for the Feature Documentary About the First Lady appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/12/17/melania-amazon-releases-trailer-for-the-feature-documentary-about-the-first-lady/",
    "timestamp": "2025-12-17T19:16:02Z"
  },
  {
    "title": "These 4 Republicans have defied Mike Johnson on ACA subsidies",
    "description": "Four moderate House Republicans have broken ranks with Speaker Mike Johnson by supporting a Democratic petition to extend health care subsidies set to expire at the end of the year. On Wednesday, members from Pennsylvania and New York sided with Democrats to …",
    "link": "https://apnews.com/article/republicans-mike-johnson-aca-4601c4b607a2038a16c02bc8bf35492b",
    "timestamp": "2025-12-17T19:15:44Z"
  },
  {
    "title": "US Plans to Dismantle Major Climate Research Center",
    "description": "The US plans to dismantle the National Center for Atmospheric Research, a key climate-science hub in Boulder, Colorado, which the Trump administration says strayed from its mission decades ago by taking up climate change research. The announcement came as a s…",
    "link": "https://financialpost.com/pmn/business-pmn/us-plans-to-dismantle-major-climate-research-center",
    "timestamp": "2025-12-17T19:15:19Z"
  },
  {
    "title": "Lumbee Tribe’s federal recognition is assured after final push by Trump",
    "description": "The Senate's passage of the National Defense Authorization Act on Wednesday has also secured the Lumbee Tribe of North Carolina's federal recognition as a tribal nation.",
    "link": "https://www.pbs.org/newshour/nation/lumbee-tribes-federal-recognition-is-assured-after-final-push-by-trump",
    "timestamp": "2025-12-17T19:12:36Z"
  },
  {
    "title": "Meet the 4 Republicans who defied House Speaker Mike Johnson on ACA subsidies",
    "description": "Four moderate House Republicans — from swing districts Democrats are already eyeing for next year's midterms — have broken ranks with Speaker Mike Johnson...",
    "link": "https://www.yahoo.com/news/articles/meet-4-republicans-defied-house-191037859.html",
    "timestamp": "2025-12-17T19:10:37Z"
  },
  {
    "title": "ICE Ramps Up Deportation Efforts In Minneapolis After Trump Claims Somalians Are ‘Garbage’",
    "description": "Trump was always going to target Minnesota and, specifically, the home of its most liberal residents, Minneapolis. Trump hates the state’s governor, Tim Walz. He also hates one of the state’s congressional reps, Ilhan Omar, who was born in Somalia. This is on…",
    "link": "https://www.techdirt.com/2025/12/17/ice-ramps-up-deportation-efforts-in-minneapolis-after-trump-claims-somalians-are-garbage/",
    "timestamp": "2025-12-17T19:10:15Z"
  },
  {
    "title": "Canopy Growth Is Surging and Analysts Still Think It Can Gain 40% from Here",
    "description": "shares have been in a sharp uptrend this week following reports President Donald Trump will reclassify cannabis as a “Schedule III” drug within the next few days.\nAdditionally, the president is also considering announcing a Medicare pilot program that would l…",
    "link": "https://biztoc.com/x/2812a186acf0d6a4",
    "timestamp": "2025-12-17T19:09:15Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino plans to step down early next year, MS NOW reports",
    "description": "Bongino had been selected by President Donald Trump for the high-profile law enforcement job despite him having no prior FBI experience.",
    "link": "https://biztoc.com/x/17f9e4a6baa457f9",
    "timestamp": "2025-12-17T19:09:06Z"
  },
  {
    "title": "Billionaire Jared Isaacman confirmed as Nasa chief after turbulent nomination",
    "description": "Billionaire Jared Isaacman confirmed as Nasa chief after turbulent nomination\nBillionaire investor Jared Isaacman has been confirmed to be Nasa’s next chief, capping an unusual nomination process where President Donald Trump put his name forward, withdrew it,…",
    "link": "https://biztoc.com/x/ae6a746ee87ba29b",
    "timestamp": "2025-12-17T19:08:41Z"
  },
  {
    "title": "FCC's Carr Admits Probing Only Outlets Critical Of Trump",
    "description": "During today's Senate hearing, Donald Trump's hand-picked FCC Chairman, Brendan Carr, admitted to Sen. Amy Klobuchar that he is investigating all major news outlets except for Fox News. \n Senator Klobuchar used Carr's own words against him: he attacked Jimmy …",
    "link": "https://crooksandliars.com/2025/12/fcc-brendan-carr-admits-investigating-only",
    "timestamp": "2025-12-17T19:06:45Z"
  },
  {
    "title": "Trump’s National Guard deployment in Washington can continue for now, an appeals court says",
    "description": "WASHINGTON (AP) — A federal appeals court on Wednesday ruled that the National Guard deployment in the nation’s capital can continue for now, staying a lower-court ruling that had ordered an end to the troops’ presence. The three-judge panel for U.S. Court of…",
    "link": "https://freerepublic.com/focus/f-news/4357841/posts",
    "timestamp": "2025-12-17T19:05:39Z"
  },
  {
    "title": "Trump’s Venezuela Blockade Is For “Our Oil.” Experts Say It Isn’t The US’s To Take.",
    "description": "President Donald Trump appears resolute to do anything in his power to acquire oil from Venezuela—even if it means sidestepping congressional approval. In a post on Truth Social on Tuesday night, President Donald Trump announced that he was ordering “A TOTAL …",
    "link": "https://www.motherjones.com/politics/2025/12/trumps-blockade-venezuela-senate-oil/",
    "timestamp": "2025-12-17T19:05:25Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino plans to step down early next year, MS NOW reports",
    "description": "Bongino had been selected by President Donald Trump for the high-profile law enforcement job despite him having no prior FBI experience.",
    "link": "https://www.cnbc.com/2025/12/17/fbi-dan-bongino-steps-down-epstein-jan-6.html",
    "timestamp": "2025-12-17T19:03:39Z"
  },
  {
    "title": "Cheap Trick Defends Performing at Trump’s Kennedy Center Honors Amid Backlash: ‘We Agreed to Do It’ to ‘Pay Tribute to Our Lifelong Brothers in KISS’",
    "description": "Cheap Trick has been feeling the heat from some fans since performing at the Donald J. Trump-hosted Kennedy Center Honors, an event that has become a political flashpoint since the president took over as chairman of the board of the Kennedy Center and install…",
    "link": "https://variety.com/2025/music/news/cheap-trick-defends-kennedy-center-honors-backlash-kiss-1236611083/",
    "timestamp": "2025-12-17T19:03:38Z"
  },
  {
    "title": "Karoline Leavitt’s White House briefing doublethink is straight out of Orwell’s 1984",
    "description": "A historian analyzes how White House press secretary Karoline Leavitt’s claims about her boss and his administration are ‘doublespeak’ straight out of the pages of George Orwell’s ‘1984.’",
    "link": "https://theconversation.com/karoline-leavitts-white-house-briefing-doublethink-is-straight-out-of-orwells-1984-270675",
    "timestamp": "2025-12-17T19:02:50Z"
  },
  {
    "title": "SNL 51 Midweek: Ariana Grande Knows How Bad NYC Winters Can Get",
    "description": "With host Ariana Grande and musical guest Cher ready to help NBC's Saturday Night Live wrap up 2025 with this weekend's holiday show, it's time to officially kick off the promo week with a look at the SNL Midweek Sketch. In the clip above, Grande gets an invi…",
    "link": "https://bleedingcool.com/tv/snl-51-midweek-ariana-grande-knows-how-bad-nyc-winters-can-get/",
    "timestamp": "2025-12-17T19:02:03Z"
  },
  {
    "title": "The oil blockade threat creates anxiety in Venezuela but people stick to their daily lives",
    "description": "U.S. President Donald Trump has announced a blockade on sanctioned oil tankers entering and leaving Venezuela",
    "link": "https://abcnews.go.com/International/wireStory/oil-blockade-threat-creates-anxiety-venezuela-people-stick-128492222",
    "timestamp": "2025-12-17T19:02:01Z"
  },
  {
    "title": "James Woods Defends Rob Reiner Against Trump’s Disparagement",
    "description": "Woods finds attacks against the late director \"infuriating and distasteful.\"\nJames Woods Defends Rob Reiner Against Trump’s Disparagement\nChris Coplan",
    "link": "https://consequence.net/2025/12/james-woods-defends-rob-reiner-rails-agiainst-trump/",
    "timestamp": "2025-12-17T19:01:16Z"
  },
  {
    "title": "Trump Finally Allows Jobs Report After Shutdown. Nobody Gets Dolls Or Pencils For Christmas!",
    "description": "Tiny 64,000-jobs gain in November, after loss of 105,000 jobs in October.",
    "link": "https://www.wonkette.com/p/trump-finally-allows-jobs-report",
    "timestamp": "2025-12-17T19:00:55Z"
  },
  {
    "title": "Coffee Break: MAGA’s Messaging Meltdown Snags Susie Wiles, Kash Patel’s FBI",
    "description": "MAGA's Messaging Meltdown this week has seen the Trump team failing utterly in their area of core competence: controlling the narrative and somebody might just get themselves fired over it.",
    "link": "https://www.nakedcapitalism.com/2025/12/magas-messaging-meltdown-trump-wiles-reiner-patel-bongino.html",
    "timestamp": "2025-12-17T19:00:09Z"
  },
  {
    "title": "“So obvious that it’s staged”: People are picking apart the trailer for Melania Trump’s recently-announced biopic",
    "description": "Amazon released the first trailer for a Melania Trump documentary, and the internet responded fast with immediate backlash. \n\n\n@MELANIATRUMP/X\r\n\n\n\nThe film, titled MELANIA, was announced to hit theaters on Jan 30, 2026, and reportedly cost Amazon $40 million.…",
    "link": "https://www.dailydot.com/viral-politics/melania-trump-documentary-reactions/",
    "timestamp": "2025-12-17T19:00:00Z"
  },
  {
    "title": "Mark Levin Calls Trump ‘First Jewish President’ Again at White House Hanukkah Celebration",
    "description": "Conservative commentator Mark Levin offered praise for President Donald Trump’s role and significance in the Jewish community, during a Hanukkah reception at the White House on Tuesday.\nThe post Mark Levin Calls Trump ‘First Jewish President’ Again at White H…",
    "link": "https://www.breitbart.com/politics/2025/12/17/mark-levin-calls-trump-first-jewish-president-again-at-white-house-hanukkah-celebration/",
    "timestamp": "2025-12-17T18:59:20Z"
  },
  {
    "title": "Trump White House Shuts Down Biden's Plea for Presidential Immunity",
    "description": "Former President Joe Biden wanted some of his autopen-linked documents kept private, but the Trump administration rejected his plea.",
    "link": "https://www.westernjournal.com/trump-white-house-shuts-bidens-plea-presidential-immunity/",
    "timestamp": "2025-12-17T18:58:59Z"
  },
  {
    "title": "Cheap Trick Address Backlash For Kennedy Center Appearance",
    "description": "Cheap Trick's recent tribute to KISS at the Kennedy Center Honors sparked controversy. Discover what led to the backlash from fans. Continue reading…",
    "link": "https://loudwire.com/cheap-trick-kennedy-center-honors-statement/",
    "timestamp": "2025-12-17T18:58:21Z"
  },
  {
    "title": "Appeals court says Trump’s National Guard deployment in Washington can continue for now",
    "description": "The appeals court panel ruled that President Donald Trump may prevail in his argument that the president “possesses a unique power” to mobilize the Guard in Washington.",
    "link": "https://biztoc.com/x/38a78ea7cc292ee3",
    "timestamp": "2025-12-17T18:57:45Z"
  },
  {
    "title": "Wall Street Is Betting That SNDL Stock Can More Than Double in the Next Year. Should You Buy Shares Here?",
    "description": "shares gained nearly 12% on Wednesday. Dec. 16 following reports that President Donald Trump could reclassify cannabis as a “Schedule III” drug by the end of this week.\nThe U.S. government is considering a policy shift that would offer some seniors access to …",
    "link": "https://biztoc.com/x/e9324c908e08107d",
    "timestamp": "2025-12-17T18:57:39Z"
  },
  {
    "title": "The View hosts reject Susie Wiles’ ‘hit piece’ claims over bombshell Vanity Fair interview",
    "description": "The ‘Vanity Fair’ piece revealed candid confessions from White House chief of staff Susie Wiles",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/susie-wiles-vanity-fair-the-view-b2886552.html",
    "timestamp": "2025-12-17T18:57:25Z"
  },
  {
    "title": "How Crypto Is Turning America Into a Kleptocracy",
    "description": "The University of Michigan’s Will Thomas on how President Donald Trump is using cryptocurrencies to enrich himself and his allies. Plus: David on the attack at Bondi Beach and lessons on courage from Joseph Conrad’s Lord Jim.",
    "link": "https://www.theatlantic.com/podcasts/2025/12/the-david-frum-show-will-thomas-crypto/685296/",
    "timestamp": "2025-12-17T18:57:22Z"
  },
  {
    "title": "Trump rips predecessors Biden, Obama and Bush with new plaques on ‘Presidential Walk of Fame’",
    "description": "President Trump has added new plaques beneath each portrait of America's 45 presidents on his \"Presidential Walk of Fame\" at the White House — including blistering attacks on Joe Biden, Barack Obama and George W. Bush.",
    "link": "https://nypost.com/2025/12/17/us-news/trump-rips-predecessors-biden-obama-and-bush-with-new-plaques-on-presidential-walk-of-fame/",
    "timestamp": "2025-12-17T18:57:08Z"
  },
  {
    "title": "Tucker Carlson Claims Trump Plans to Announce War During Address to Nation",
    "description": "U.S. President Donald Trump announced on his social media platform, Truth Social, that he will deliver a live address to the nation on Wednesday night.",
    "link": "https://www.ibtimes.com/everything-we-know-about-what-trump-will-reveal-during-his-national-address-3792963",
    "timestamp": "2025-12-17T18:54:28Z"
  },
  {
    "title": "Fani Willis’ Explosive Testimony",
    "description": "DAILY CALLER NEWS FOUNDATION—Fulton County District Attorney Fani Willis erupted on Wednesday while testifying before a special Georgia Senate committee scrutinizing her prosecution of President Donald... Read More\nThe post Fani Willis’ Explosive Testimony ap…",
    "link": "https://www.dailysignal.com/2025/12/17/fani-willis-explosive-testimony/",
    "timestamp": "2025-12-17T18:53:05Z"
  },
  {
    "title": "US Congress passes massive defence bill that includes support for Ukraine and Europe",
    "description": "Bill provides funding for Kyiv, boosts Europe's security and raises troop pay.",
    "link": "https://www.channelnewsasia.com/world/ukraine-nato-europe-us-trump-funding-congress-5624116",
    "timestamp": "2025-12-17T18:52:22Z"
  },
  {
    "title": "Trump administration accuses U.S. Virgin Islands of violating Second Amendment",
    "description": "The U.S. government sued the U.S. territory, its police department and Police Commissioner. It accuses them of obstructing and systematically denying American citizens the right to possess and carry guns.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-accuses-u-s-virgin-islands-of-violating-second-amendment",
    "timestamp": "2025-12-17T18:51:10Z"
  },
  {
    "title": "Binance mulls new US strategy, CZ potentially reducing stake: Report",
    "description": "Crypto exchange Binance is exploring several avenues to expand its footprint in the United States after the company exited the US in 2019.",
    "link": "https://cointelegraph.com/news/binance-us-strategy-cz-reduce-stake",
    "timestamp": "2025-12-17T18:50:29Z"
  },
  {
    "title": "The special envoy’s report doesn’t hold all the answers for defeating antisemitism",
    "description": "Following the Bondi terror attack, many are pointing to Jillian Segal’s plan for solutions. But it doesn’t distinguish criticism of Israel from antisemitism.",
    "link": "https://theconversation.com/the-special-envoys-report-doesnt-hold-all-the-answers-for-defeating-antisemitism-272167",
    "timestamp": "2025-12-17T18:50:01Z"
  },
  {
    "title": "What Time Is Trump Addressing The Nation Tonight? Here’s How To Watch",
    "description": "President Donald Trump is addressing the nation on Wednesday, Dec. 17. Here’s what time the speech starts and how to watch it live on cable and streaming.",
    "link": "https://www.forbes.com/sites/monicamercuri/2025/12/17/what-time-is-trump-addressing-the-nation-tonight-heres-how-to-watch/",
    "timestamp": "2025-12-17T18:49:34Z"
  },
  {
    "title": "CNN’s future unclear as Trump applies pressure",
    "description": "CNN is heading into an uncertain future with its parent company Warner Bros. Discovery (WBD) destined for a takeover — and US President Donald Trump hoping the change will allow him to influence the iconic news network’s programming. WBD has urged shareholder…",
    "link": "https://www.digitaljournal.com/world/cnns-future-unclear-as-trump-applies-pressure/article",
    "timestamp": "2025-12-17T18:47:34Z"
  },
  {
    "title": "Trump accounts get funding from companies, philanthropists: Here's who is eligible for the funds",
    "description": "On Wednesday, the White House announced additional details about Trump accounts, a new type of savings account for kids.",
    "link": "https://www.cnbc.com/2025/12/17/trump-accounts-dalio-blackrock-bny.html",
    "timestamp": "2025-12-17T18:47:00Z"
  },
  {
    "title": "Appeals court says Trump’s National Guard deployment in Washington can continue for now",
    "description": "The appeals court panel ruled that President Donald Trump may prevail in his argument that the president “possesses a unique power” to mobilize the Guard in Washington.",
    "link": "https://www.pbs.org/newshour/nation/appeals-court-says-trumps-national-guard-deployment-in-washington-can-continue-for-now",
    "timestamp": "2025-12-17T18:45:10Z"
  },
  {
    "title": "John Catsimatidis on Donald Trump, Immigration, and New York Republicans (The New York Editorial Board)",
    "description": "The New York Editorial Board:\nJohn Catsimatidis on Donald Trump, Immigration, and New York Republicans  —  John Catsimatidis — a businessman, Republican, political donor, radio host and station owner, 2013 candidate for New York City mayor, Donald Trump ally,…",
    "link": "https://www.memeorandum.com/251217/p87",
    "timestamp": "2025-12-17T18:45:04Z"
  },
  {
    "title": "Wrestler Mick Foley quits WWE over Trump ties after Reiner comments",
    "description": "Wrestling great Mick Foley has called it quits with the WWE over its cozy relationship with Donald Trump, citing “incredibly cruel comments” the president made about Rob Reiner’s murder.",
    "link": "https://www.bostonherald.com/2025/12/17/mick-foley-quits-wwe-trump-reiner-comments/",
    "timestamp": "2025-12-17T18:44:51Z"
  },
  {
    "title": "'Something out of 1984': FCC makes 'stunning' website edits during heated FCC hearing",
    "description": "The FCC changed its website during a heated hearing with FCC chair Brendan Carr. Carr was responding to questions from lawmakers about whether the agency was independent. Carr told lawmakers \"the FCC is not an independent agency\" — within minutes, the FCC had…",
    "link": "https://www.rawstory.com/something-out-of-1984-fcc-changes-its-website-during-heated-fcc-hearing/",
    "timestamp": "2025-12-17T18:42:25Z"
  },
  {
    "title": "Ranchers in Texas turn over price of beef...",
    "description": "Ranchers in Texas turn over price of beef...\r\n\n \n \n \n (First column, 11th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Rising Jobless Rate Has Precedent, and It Often Ain't Pretty...\r\nEconomy Ratings Just Single Point From Biden's Worst...\r\nTrump Dangles Cash Pa…",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/texas-ranchers-trump-beef-price-b2886448.html",
    "timestamp": "2025-12-17T18:40:38Z"
  },
  {
    "title": "Senate passes $901 billion military spending bill, pushing Hegseth for boat strike video",
    "description": "The Senate gave final passage on Wednesday to an annual military policy bill that will authorize $901 billion in defense programs while pressuring Defense Secretary Pete Hegseth to provide lawmakers with video of strikes on alleged drug boats.",
    "link": "https://www.pbs.org/newshour/nation/senate-passes-901-billion-military-spending-bill-pushing-hegseth-for-boat-strike-video",
    "timestamp": "2025-12-17T18:40:12Z"
  },
  {
    "title": "Merz touts EU-Mercosur deal while France, Italy protest",
    "description": "The EU-Latin America trade deal has been in the making for a quarter of a century. While Germany's chancellor called for its completion, France and Italy said it would be \"premature\" to sign. The EU's planned Mercosur trade agreement with four Latin American …",
    "link": "https://www.dw.com/en/merz-touts-eu-mercosur-deal-while-france-italy-farmers-protest/a-75207512",
    "timestamp": "2025-12-17T18:38:00Z"
  },
  {
    "title": "FCC chief Brendan Carr tells Senate that his agency is 'not formally ... independent'",
    "description": "FCC chairman Brendan Carr testified to a congressional committee for the first time since ABC suspended Jimmy Kimmel's show following a Carr threat.",
    "link": "https://www.cnbc.com/2025/12/17/fcc-carr-senate-jimmy-kimmel-kirk.html",
    "timestamp": "2025-12-17T18:37:49Z"
  },
  {
    "title": "US allows LNG sales from Russia's Sakhalin-2 until June, helping Japan",
    "description": "Washington extends waiver in a break from Japanese utilities importing Russian LNG",
    "link": "https://asia.nikkei.com/business/energy/us-allows-oil-sales-from-russia-s-sakhalin-2-until-june-helping-japan",
    "timestamp": "2025-12-17T18:37:49Z"
  },
  {
    "title": "US government sues US Virgin Islands and accuses officials of violating the Second Amendment",
    "description": "A Second Amendment clash has erupted between the federal government and the U.S. Virgin Islands",
    "link": "https://abcnews.go.com/International/wireStory/us-government-sues-us-virgin-islands-accuses-officials-128491524",
    "timestamp": "2025-12-17T18:37:44Z"
  },
  {
    "title": "Podcast: Micheál Martin's future and Bangladesh aid cuts",
    "description": "It has been a day of reaction to Fianna Fáil's review into its presidential campaign, which saw Jim Gavin drop out of the race earlier this year after it emerged he owed a former tenant more than €3,000.",
    "link": "https://www.rte.ie/news/2025/1217/1549526-podcast-micheal-martins-future-and-bangladesh-aid-cuts/",
    "timestamp": "2025-12-17T18:37:18Z"
  },
  {
    "title": "Donald Trump’s attacks on Rob Reiner after his murder draw condemnation - Financial Times",
    "description": "Donald Trump’s attacks on Rob Reiner after his murder draw condemnationFinancial Times Opinion | Our Petty, Hollow, Squalid Ogre in ChiefThe New York Times Speaker Johnson on Trump’s remarks on Reiner killings: ‘That’s not the way I would have done it’thehill…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180412039",
    "timestamp": "2025-12-17T18:32:23Z"
  },
  {
    "title": "'Break within MAGA': GOP lawmaker admits party dividing over Trump",
    "description": "A Republican lawmaker admitted Wednesday that MAGA is splintering over President Donald Trump and his policies. Rep. Michael McCaul (R-TX) told CNN's Wolf Blitzer that even with the friction among lawmakers over the president, he still thinks Trump has power …",
    "link": "https://www.rawstory.com/break-within-maga-gop-lawmaker-admits-party-dividing-over-trump/",
    "timestamp": "2025-12-17T18:32:08Z"
  },
  {
    "title": "The oil blockade threat creates anxiety in Venezuela but people stick to their daily lives",
    "description": "U.S. President Donald Trump is threating to blockade sanctioned oil tankers from Venezuela, a move that could devastate a country already wrangling with...",
    "link": "https://www.yahoo.com/news/articles/oil-blockade-threat-creates-anxiety-183206661.html",
    "timestamp": "2025-12-17T18:32:06Z"
  },
  {
    "title": "Why the EU-Mercosur Trade Deal Matters for Luxury",
    "description": "On Wednesday, Italy's Prime Minister Giorgia Meloni joined French President Emmanuel Macron in an attempt to delay the finalization of a crucial EU trade agreement that could pave the way for a free-trade zone with the South American bloc.",
    "link": "http://wwd.com/business-news/government-trade/eu-mercosur-trade-deal-luxury-market-expansion-1238427758/",
    "timestamp": "2025-12-17T18:31:32Z"
  },
  {
    "title": "Accused Lefty Extremist Texted FBI Snitch About ‘Terrorist Diary’: ‘Lmaooooo I Have To Get Rid Of That’",
    "description": "Leftists charged in a suspected bombing plot in California allegedly told an undercover FBI informant of their radical intentions several times before their Friday arrest, even mentioning a “terrorist diary,” court records show. The paid informant and an unde…",
    "link": "https://freerepublic.com/focus/f-bloggers/4357836/posts",
    "timestamp": "2025-12-17T18:31:18Z"
  },
  {
    "title": "Honduras' special election recount still paralyzed amid protests",
    "description": "TEGUCIGALPA, Dec 17 (Reuters) - A special manual recount of some votes in Honduras' presidential election was still not underway on Wednesday amid protests that prevented electoral staff from working and calls by the ruling party for a review of every single …",
    "link": "https://www.thestar.com.my/news/world/2025/12/18/honduras039-special-election-recount-still-paralyzed-amid-protests",
    "timestamp": "2025-12-17T18:31:00Z"
  },
  {
    "title": "They prosecuted the Capitol rioters. Now the rioters and the DOJ are after them.",
    "description": "The Capitol riot of January 2021 set off the largest criminal investigation in the Justice Department’s history. For federal prosecutor Ashley Akers, it was a defining moment in a seven-year career spent untangling complex cases, from wire fraud to domestic t…",
    "link": "https://freerepublic.com/focus/f-news/4357835/posts",
    "timestamp": "2025-12-17T18:30:41Z"
  },
  {
    "title": "“Like nothing they have ever seen”: Trump orders blockade of Venezuela",
    "description": "The president said the Maduro regime was \"completely surrounded\" in a post to social media.",
    "link": "https://www.salon.com/2025/12/17/like-nothing-they-have-ever-seen-trump-threatens-venezuela-with-blockade/",
    "timestamp": "2025-12-17T18:30:38Z"
  },
  {
    "title": "Trump's first impeachment started with a phone call and ended with a newspaper",
    "description": "When Trump was elected president in 2016, he joined the world's most exclusive and revered club. But three years later, the president added his name to a smaller list of US leaders who'd been impeached.",
    "link": "https://www.abc.net.au/news/2025-12-18/the-lessons-from-donald-trump-s-first-impeachment-trial/106137900",
    "timestamp": "2025-12-17T18:30:00Z"
  },
  {
    "title": "Actions of Bondi Beach hero declared ‘a source of pride for Syria’",
    "description": "Ahmed al-Ahmed has received praise from political leaders for tackling gunman and saving ‘countless’ lives",
    "link": "https://www.irishtimes.com/world/middle-east/2025/12/17/actions-of-bondi-beach-hero-declared-a-source-of-pride-for-syria/",
    "timestamp": "2025-12-17T18:29:46Z"
  },
  {
    "title": "‘There can be no excuse’: Donald Trump questions why Brown University has few security cameras as search for shooter enters fifth day",
    "description": "Brown has 1,200 security cameras, according to Brown University President Christina Paxson.",
    "link": "https://indianexpress.com/article/world/donald-trump-questions-why-brown-university-has-few-security-cameras-search-for-shooter-fifth-day-10425855/",
    "timestamp": "2025-12-17T18:28:59Z"
  },
  {
    "title": "EXCLUSIVE: CBP Busts Meth Breakfast Cereal Smuggling Attempt",
    "description": "Customs and Border Protection has thwarted a large drug smuggling attempt in Texas.   CBP officers in the Lone Star State discovered a tractor trailer filled with cereal ingredients. More than $10.3 million... Read More\nThe post EXCLUSIVE: CBP Busts Meth Brea…",
    "link": "https://www.dailysignal.com/2025/12/17/exclusive-cbp-busts-meth-breakfast-cereal-smuggling-attempt/",
    "timestamp": "2025-12-17T18:26:50Z"
  },
  {
    "title": "What Is “Crocodile Economics,” and What Does It Mean for Fossil Fuels?",
    "description": "The past 12 months have been harsh on climate advocates. But surveys show it's less about abandoning the work and more about changing how it's discussed. Enter \"Crocodile Economics,\" a new term for an old concept that's taking hold around the world. TriplePun…",
    "link": "https://triplepundit.com/2025/crocodile-economics-decoupling-emissions-growth/",
    "timestamp": "2025-12-17T18:26:19Z"
  },
  {
    "title": "Marjorie Taylor Greene Again Slams Trump, Says 'He's Got Real Problems With Republicans'",
    "description": "Republican Rep. Marjorie Taylor Greene again criticized President Donald Trump as her exit from Congress gets closer.",
    "link": "https://www.ibtimes.com/marjorie-taylor-greene-again-slams-trump-says-hes-got-real-problems-republicans-3792962",
    "timestamp": "2025-12-17T18:24:44Z"
  }
]