[
  {
    "title": "Rand Paul to Introduce Bill to Get Rid of Department of Education",
    "description": "Last Thursday, President Donald Trump signed an executive order to dismantle the Department of Education (DOE). As he shared during his remarks, he's hopeful that members of Congress will vote to do so, even Democrats. As Sen. Rand Paul (R-KY) posted to X, he…",
    "link": "https://freerepublic.com/focus/f-news/4306458/posts",
    "timestamp": "2025-03-24T17:32:51Z"
  },
  {
    "title": "Syria after Assad: why many Syrian refugees aren’t returning home",
    "description": "Syrian refugees must be able to decide what’s next for them as pressures mount for their return.",
    "link": "https://theconversation.com/syria-after-assad-why-many-syrian-refugees-arent-returning-home-251654",
    "timestamp": "2025-03-24T17:31:00Z"
  },
  {
    "title": "JD Vance Criticizes Trump in Leaked War Plans Group Chat: ‘Not Sure the President Is Aware How Inconsistent This Is’",
    "description": "Vice President JD Vance criticized the judgment of his boss, President Donald Trump, in a leaked national security groupchat.\nThe post JD Vance Criticizes Trump in Leaked War Plans Group Chat: ‘Not Sure the President Is Aware How Inconsistent This Is’ first a…",
    "link": "https://www.mediaite.com/news/jd-vance-criticizes-trump-in-leaked-war-plans-group-chat-not-sure-the-president-is-aware-how-inconsistent-this-is/",
    "timestamp": "2025-03-24T17:30:56Z"
  },
  {
    "title": "Greenland Is Very Tired of Trump Now",
    "description": "As the Trump administration plans a delegation to the island, Greenland’s leaders have criticized the visit as a show of force amid the president’s calls to annex.",
    "link": "http://nymag.com/intelligencer/article/greenland-is-very-tired-of-the-trump-administration-now.html",
    "timestamp": "2025-03-24T17:30:52Z"
  },
  {
    "title": "Trump says countries that buy Venezuelan oil will face 25% tariff",
    "description": "President Donald Trump says he will place a 25% tariff on all imports from any country that buys oil or gas from Venezuela.",
    "link": "https://www.news4jax.com/business/2025/03/24/trump-says-countries-that-buy-venezuelan-oil-will-face-25-tariff/",
    "timestamp": "2025-03-24T17:30:38Z"
  },
  {
    "title": "WATCH LIVE: Trump delivers remarks at White House with Louisiana Gov. Landry",
    "description": "The plant is part of an overall $20 billion investment by Hyundai, the Korean automaker.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-delivers-remarks-at-white-house-with-louisiana-gov-landry",
    "timestamp": "2025-03-24T17:30:30Z"
  },
  {
    "title": "Trump and Kennedy Files: Why Did Trump Release the JFK Files Now?",
    "description": "Donald Trump’s first promise after taking the oath of office was to “end all wars.” Indeed, Trump started his second term with a strong staff and base, and his first job was to call Moscow. The Trump-Putin meeting first started …\nThe post Trump and Kennedy Fi…",
    "link": "https://www.globalresearch.ca/why-trump-release-jfk-files-now/5882612",
    "timestamp": "2025-03-24T17:30:12Z"
  },
  {
    "title": "Lest We Forget the Horrors: An Unending Catalog of Trump’s Cruelties, Collusions, Corruptions, and Crimes",
    "description": "Early in President Trump’s first term, McSweeney’s editors began to catalog the head-spinning number of misdeeds coming from his administration. We called this list a collection of Trump’s cruelties, collusions, corruptions, and crimes, and it felt urgent to …",
    "link": "https://www.mcsweeneys.net/articles/lest-we-forget-the-horrors-an-unending-catalog-of-trumps-cruelties-collusions-corruptions-and-crimes",
    "timestamp": "2025-03-24T17:30:00Z"
  },
  {
    "title": "Rand Paul schools Margaret Brennan on Education Department's utility — or lack thereof",
    "description": "President Donald Trump signed an executive order Thursday to start the elimination of the Education Department, then indicated Friday that some of the department's remaining functions would immediately be offloaded onto the Small Business Administration and t…",
    "link": "https://www.theblaze.com/news/rand-paul-schools-margaret-brennan-on-education-departments-utility-or-lack-thereof",
    "timestamp": "2025-03-24T17:30:00Z"
  },
  {
    "title": "Canada to Hold Elections Next Month: Everything to Know",
    "description": "A snap election has officially been called in Canada, and the results will have major implications for its relationship with the US and much more.",
    "link": "https://www.cnet.com/news/politics/canada-to-hold-elections-next-month-everything-to-know/",
    "timestamp": "2025-03-24T17:30:00Z"
  },
  {
    "title": "FEMA Disaster Aid Review Could Deter Migrants from Seeking Help in Extreme Weather",
    "description": "A previously undisclosed FEMA review could block disaster assistance to millions of undocumented people and deter legal immigrants from seeking help in extreme weather",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/03/21/fema-memo-targets-disaster-aid-that-indirectly-helps-migrants-00240833",
    "timestamp": "2025-03-24T17:30:00Z"
  },
  {
    "title": "Donald Trump and Elon Musk Turn Focus to Wisconsin",
    "description": "Trump endorsed Wisconsin Supreme Court candidate Brad Schimel over the weekend.",
    "link": "https://www.newsweek.com/donald-trump-elon-musk-focus-wisconsin-2049715",
    "timestamp": "2025-03-24T17:29:54Z"
  },
  {
    "title": "Legendary Punk Band Denied U.S. Entry + They Think They Know Why",
    "description": "British punk forefathers U.K. Subs revealed that three of their members were denied entry into the United States in March 2025.",
    "link": "https://loudwire.com/uk-subs-denied-usa-entry-trump/",
    "timestamp": "2025-03-24T17:29:32Z"
  },
  {
    "title": "Does the leather community have a Nazi problem?",
    "description": "For a kinkster, the upcoming International Mr. Leather is a beautiful event. Kinky folks of all stripes make lifelong friendships at the competition and community event — and sometimes fall in love. But this year, one IML regular will not be present.",
    "link": "https://www.out.com/out-exclusives/tom-of-finland-leather-community-nazi",
    "timestamp": "2025-03-24T17:28:58Z"
  },
  {
    "title": "Trump Administration Officials ‘Accidentally’ Leaked War Plans to Atlantic Editor",
    "description": "The Atlantic's editor in chief reveals how he found himself in a high-level group chat with other Trump administration officials.",
    "link": "https://www.adweek.com/tvnewser/donald-trump-jeffrey-goldberg-atlantic-leak/",
    "timestamp": "2025-03-24T17:28:39Z"
  },
  {
    "title": "Watch: Conan O'Brien honoured at Trump-run Kennedy Center",
    "description": "The comedian received the Mark Twain Prize for American Humor at one of the more prominent events since US President Donald Trump took over the Kennedy Center.",
    "link": "https://www.bbc.com/news/videos/c3rn5d8rryno",
    "timestamp": "2025-03-24T17:28:23Z"
  },
  {
    "title": "Will Patrick Schwarzenegger have feuding Kennedys at his wedding?",
    "description": "If Schwarzenegger finally marries fiancee Abby Champion, how will he navigate all his family drama, involving RFK Jr., Cheryl Hines and Jack Schlossberg, for his wedding?",
    "link": "https://www.bostonherald.com/2025/03/24/will-patrick-schwarzenegger-have-feuding-kennedys-at-wedding/",
    "timestamp": "2025-03-24T17:27:32Z"
  },
  {
    "title": "Canadian election campaign limits government as more tariffs loom",
    "description": "OTTAWA (Reuters) - Canadian Prime Minister Mark Carney's decision to call for a snap election for April 28 could curtail his ability to respond forcefully if the United States carries out a threat to impose additional tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/03/25/canadian-election-campaign-limits-government-as-more-tariffs-loom",
    "timestamp": "2025-03-24T17:27:00Z"
  },
  {
    "title": "A Test of Humanity: Migrants’ Rights in a World Turning Inward",
    "description": "The United Nations Refugee Agency faces devastating cuts that may eliminate 5,000 to 6,000 jobs, with potentially catastrophic consequences for millions of people fleeing war, repression, hunger and climate disasters. This 75-year-old institution, established…",
    "link": "https://www.ipsnews.net/2025/03/test-humanity-migrants-rights-world-turning-inward/",
    "timestamp": "2025-03-24T17:27:00Z"
  },
  {
    "title": "West Virginia poised to become 1st state to ban range of food dyes",
    "description": "West Virginia’s governor is poised to sign a bill that would first ban food dyes in school meals - and eventually in products that are sold state-wide.",
    "link": "https://www.fox5dc.com/news/west-virginia-poised-become-1st-state-ban-range-food-dyes",
    "timestamp": "2025-03-24T17:26:42Z"
  },
  {
    "title": "Greenland leaders lambast US delegation trip as Trump talks of takeover",
    "description": "Visit aims to ‘build on partnerships that respects Greenland’s self-determination’, says US spokesman",
    "link": "https://www.irishtimes.com/world/europe/2025/03/24/greenland-leaders-lambast-us-delegation-trip-as-trump-talks-of-takeover/",
    "timestamp": "2025-03-24T17:25:33Z"
  },
  {
    "title": "Youngkin backs one-time tax rebates, urges $300 million in spending cuts",
    "description": "He backs bonuses for state workers and vetoes a local referendum requirement for a proposed historical horse racing gaming parlor in Henrico County.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_e78d3b03-d9a5-4955-93d0-ae5ad62f6fe5.html",
    "timestamp": "2025-03-24T17:25:00Z"
  },
  {
    "title": "US and Russia Teams Meet After Ukraine Has ‘Productive’ Talk",
    "description": "US and Russian officials are meeting in Saudi Arabia a day after American and Ukrainian teams held talks, as President Donald Trump pushes for progress in achieving a ceasefire in the war.\nThe Russian delegation arrived at the venue on Monday for the closed-d…",
    "link": "https://biztoc.com/x/1cb73e1c4d45c080",
    "timestamp": "2025-03-24T17:24:32Z"
  },
  {
    "title": "Top GOP governor makes key endorsement in border state gubernatorial race: 'Deeply honored'",
    "description": "Arkansas Gov. Sarah Huckabee Sanders is endorsing Karrin Taylor Robson in the Arizona 2026 gubernatorial Republican primary, saying she is \"proud to join President Trump in endorsing\" her.",
    "link": "https://www.foxnews.com/politics/top-gop-governor-makes-key-endorsement-border-state-gubernatorial-race-deeply-honored",
    "timestamp": "2025-03-24T17:24:24Z"
  },
  {
    "title": "LinkedIn cofounder Reid Hoffman says it’s not the speed of the Trump administration’s changes that pose a danger to U.S., it’s the ‘unwarranted’ risks",
    "description": "The government is not a business, Reid Hoffman argued, and should not be run like one. The investor and LinkedIn cofounder told Bloomberg TV on Monday that he worries President Donald Trump’s administration is taking unnecessary risk through its mass firings …",
    "link": "https://biztoc.com/x/19823aeeec2e3135",
    "timestamp": "2025-03-24T17:24:20Z"
  },
  {
    "title": "MAGA's push to impeach federal judges",
    "description": "President Donald Trump isn't much interested in being checked or balanced by the judicial branch. He is calling for the impeachment of federal judges who have blocked or slowed his administration's efforts to shut down government programs and deport migrants.…",
    "link": "https://biztoc.com/x/993344bcf9a1aeb3",
    "timestamp": "2025-03-24T17:24:18Z"
  },
  {
    "title": "Federal election 2025: These are the top economic issues that will dominate the campaign trail",
    "description": "The trade war is grabbing the headlines, but Canadian voters have other concerns on their minds that leaders will look to address. Read on",
    "link": "https://financialpost.com/federal_election/federal-election-top-economic-issues",
    "timestamp": "2025-03-24T17:24:15Z"
  },
  {
    "title": "Vance Defends Witkoff Over Putin Comment",
    "description": "State of the Union: The Vice President stepped up after Witkoff’s controversial remarks to Tucker Carlson.\nThe post Vance Defends Witkoff Over Putin Comment appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/vance-defends-witkoff-over-putin-comment/",
    "timestamp": "2025-03-24T17:24:05Z"
  },
  {
    "title": "HIV and AIDS deaths could increase globally amid US aid freeze, UN says",
    "description": "US President Donald Trump put almost all US foreign aid on hold upon taking office.",
    "link": "https://www.aljazeera.com/news/2025/3/24/hiv-and-aids-deaths-could-increase-globally-amid-us-aid-freeze-un-says",
    "timestamp": "2025-03-24T17:23:43Z"
  },
  {
    "title": "Toyota was bullish on Trump. Then came the tariff threats",
    "description": "President Donald Trump had campaigned on dismantling policies aimed at swiftly accelerating the U.S. auto industry's shift away from fossil fuels and to electric vehicles -- directives that Toyota and other leading manufacturers of gasoline and hybrid gasolin…",
    "link": "https://economictimes.indiatimes.com/news/international/business/toyota-was-bullish-on-trump-then-came-the-tariff-threats/articleshow/119436884.cms",
    "timestamp": "2025-03-24T17:22:12Z"
  },
  {
    "title": "Mark Carney to run in the Ottawa riding of Nepean",
    "description": "Carney will be running in a riding adjacent to his main rival, Conservative Party Leader Pierre Poilievre, who is seeking re-election in the Ottawa-area riding of Carleton.",
    "link": "https://www.nationalobserver.com/2025/03/24/news/mark-carney-ottawa-riding-nepean",
    "timestamp": "2025-03-24T17:22:11Z"
  },
  {
    "title": "Bitcoin price pumps, but will BTC break $92K anytime soon?",
    "description": "Bitcoin (BTC) price surged by 3% on March 24, distancing from its $76,900 low on March 11 despite failing to sustain the $88,000 level. Now, traders are wondering what factors could drive Bitcoin's daily close above $92,000, which last occurred on March 3. Ad…",
    "link": "https://cointelegraph.com/news/bitcoin-price-pumps-but-will-btc-break-92-k-anytime-soon",
    "timestamp": "2025-03-24T17:20:47Z"
  },
  {
    "title": "Canadian governments rely on Starlink for critical services.",
    "description": "More than half of Canada's provincial and territorial governments buy critical internet and communications services from Starlink. Read on",
    "link": "https://financialpost.com/technology/tech-news/canadian-governments-rely-on-starlink",
    "timestamp": "2025-03-24T17:20:37Z"
  },
  {
    "title": "US cuts to HIV aid will cost millions of lives - UNAids chief",
    "description": "Funding cuts could lead to an added 2,000 new HIV infections each day, Winnie Byanyima warns.",
    "link": "https://www.bbc.com/news/articles/c4ge1xjrze7o",
    "timestamp": "2025-03-24T17:20:30Z"
  },
  {
    "title": "Donald Trump attacks George Clooney for defending free press",
    "description": "Donald Trump called George Clooney a 'second-rate movie star' and 'failed political pundit' after the actor defended the free press in a '60 Minutes' interview.",
    "link": "https://ew.com/donald-trump-responds-george-clooney-60-minutes-interview-free-press-11702167",
    "timestamp": "2025-03-24T17:20:08Z"
  },
  {
    "title": "Youngkin efforts lead slew of VA colleges to nix DEI, as Hokie alums reportedly push back",
    "description": "UVA appeared to set off a domino effect of other Virginia colleges nixing their DEI departments and initiatives, in alignment with a Trump administration order.",
    "link": "https://www.foxnews.com/politics/youngkin-lauds-slew-va-colleges-nixing-dei-hokie-alums-reportedly-push-back",
    "timestamp": "2025-03-24T17:19:52Z"
  },
  {
    "title": "US Bid for Greenland Like Russia's Annexation of Crimea: Ex-Diplomat",
    "description": "\"American politicians will come in droves and agitate for Greenland to be American,\"  the former diplomat said.",
    "link": "https://www.newsweek.com/trump-us-greenland-russia-crimea-2049573",
    "timestamp": "2025-03-24T17:18:52Z"
  },
  {
    "title": "Mark Carney on Canada-US Crisis: 'We Lament a Friendship Lost'",
    "description": "Carney's remarks came on the second day of Canada's national election campaign and amid heightened tensions with President Trump.",
    "link": "https://www.newsweek.com/mark-carney-canada-us-crisis-we-lament-friendship-lost-2049738",
    "timestamp": "2025-03-24T17:17:59Z"
  },
  {
    "title": "Rosie O’Donnell Blames Her Comments On ‘The View’ For Decades-Long Donald Trump Feud: “He Hasn’t Let It Go”",
    "description": "O'Donnell claimed she \"told the truth\" about Trump on The View, where she said he is not \"the businessman that everyone thinks he is.\"",
    "link": "https://decider.com/2025/03/24/rosie-odonnell-blames-comments-the-view-donald-trump-feud/",
    "timestamp": "2025-03-24T17:17:38Z"
  },
  {
    "title": "President Trump Calls for Portrait in Colorado State Capitol to Be Taken Down",
    "description": "Donald Trump said a portrait by Sarah A. Boardman in Colorado was 'purposefully distorted' and demanded it be removed.",
    "link": "https://www.artnews.com/art-news/news/president-trump-calls-removal-colorado-portrait-1234736546/",
    "timestamp": "2025-03-24T17:16:51Z"
  },
  {
    "title": "Michigan's Mallory McMorrow Issues Update on Senate Run",
    "description": "The state senator is tipped to run for the hotly contested U.S. Senate seat in Michigan that Gary Peters is vacating next year.",
    "link": "https://www.newsweek.com/michigan-mcmorrow-democrat-senate-run-update-2049600",
    "timestamp": "2025-03-24T17:14:52Z"
  },
  {
    "title": "Defense Secretary Pete Hegseth Launches Investigation into Leaks of Sensitive and Classified Information",
    "description": "The Department of Defense over the weekend announced an investigation into leaks of sensitive and classified information following a series of unauthorized disclosures to several legacy news media outlets.\nThe post Defense Secretary Pete Hegseth Launches Inve…",
    "link": "https://www.breitbart.com/politics/2025/03/24/defense-secretary-pete-hegseth-launches-investigation-leaks-sensitive-classified-information/",
    "timestamp": "2025-03-24T17:14:30Z"
  },
  {
    "title": "Mike Myers Boosts “Good Guys” Canada As Election Kicks Off; Endorses PM Mark Carney, Praises CBC",
    "description": "Skating even deeper into Canadian politics, Wayne’s World star Mike Myers today officially endorsed incumbent Prime Minister Mark Carney, bodychecked Conservative Opposition leader Pierre Poilievre & robustly flew the Maple Leaf flag in the face of Donald Tru…",
    "link": "http://deadline.com/2025/03/mike-myers-canada-election-1236347867/",
    "timestamp": "2025-03-24T17:13:53Z"
  },
  {
    "title": "Trump: People in Greenland want something to happen",
    "description": "United States President Donald Trump said during a cabinet meeting on Monday that people in Greenland \"want something to happen.\" The president reiterated the importance of Denmark's Arctic territory ...",
    "link": "https://biztoc.com/x/021ee8bb3ac84688",
    "timestamp": "2025-03-24T17:13:10Z"
  },
  {
    "title": "Musk set to earn billions from Trump administration",
    "description": "What happened\nTesla stock has fallen back to where it was trading before President Donald Trump won in November and named CEO Elon Musk to lead his \"Department of Government Efficiency.\" The Tesla slump has cost Musk a fortune on paper, but the world's riches…",
    "link": "https://biztoc.com/x/c44258592a802fff",
    "timestamp": "2025-03-24T17:13:05Z"
  },
  {
    "title": "MAGA's push to impeach federal judges",
    "description": "Trump launches a 'stunning assault' on judicial branch",
    "link": "https://theweek.com/politics/trump-maga-push-impeach-federal-judges",
    "timestamp": "2025-03-24T17:12:51Z"
  },
  {
    "title": "Trump demands his ‘distorted’ portrait in Colorado’s Capitol be taken down",
    "description": "The portrait was paid for with a Republican-led fundraising effort.",
    "link": "https://www.bostonherald.com/2025/03/24/trump-portrait-colorado-capitol/",
    "timestamp": "2025-03-24T17:12:51Z"
  },
  {
    "title": "Maybe J.D. Vance Isn’t Trump’s Puppet",
    "description": "Turns out J.D. Vance’s bad thoughts might actually be his own. A blockbuster report today about how your government plans its bombing in group chats revealed that Vance and Trump aren’t always on the same page.",
    "link": "http://nymag.com/intelligencer/article/jd-vance-disagrees-with-donald-trump-signal-group-chat.html",
    "timestamp": "2025-03-24T17:12:48Z"
  },
  {
    "title": "TikTok Taps Khartoon Weiss to Lead North America Sales Amid Leadership Shake-Up",
    "description": "TikTok is reshuffling its leadership ranks as it navigates mounting uncertainty in the U.S.",
    "link": "https://www.adweek.com/media/tiktok-taps-khartoon-weiss-to-lead-north-america-sales-amid-leadership-shake-up/",
    "timestamp": "2025-03-24T17:11:40Z"
  },
  {
    "title": "Trump hedges on whether he actually signed his Alien Enemies Act order",
    "description": "The White House insists that the president recently signed a directive on the Alien Enemies Act. So why did Donald Trump suggest he \"didn’t sign it\"?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-hedges-whether-actually-signed-alien-enemies-act-order-rcna197827",
    "timestamp": "2025-03-24T17:11:24Z"
  },
  {
    "title": "Trump—Seeking Revenge for His Mortality—Wages War on Everything That Lives",
    "description": "Allow me to stipulate that I do not wish to die. In fact, had anyone consulted me about the construction of the universe, I would have made my views on the subject quite clear: Mortality is a terrible idea. I’m opposed to it in general. (In wiser moments, I k…",
    "link": "https://tomdispatch.com/trump-rages-to-snuff-out-democracys-candle/",
    "timestamp": "2025-03-24T17:10:36Z"
  },
  {
    "title": "Trump: 25% Tariff On Anyone Who Buys Venezuelan Oil & Gas",
    "description": "U.S. President Donald Trump has announced that any country that buys oil or gas from Venezuela will pay a 25% secondary tariff on trades with the United States, Reuters reported on Monday, with Trump claiming that Venezuela has sent \"tens of thousands\" of peo…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-25-Tariff-On-Anyone-Who-Buys-Venezuelan-Oil-Gas.html",
    "timestamp": "2025-03-24T17:10:00Z"
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump in a social media post",
    "description": "The golfer's social media post said, “Love is in the air.”",
    "link": "https://www.denverpost.com/2025/03/24/tiger-woods-vanessa-trump-social-media/",
    "timestamp": "2025-03-24T17:09:49Z"
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump in a social media post",
    "description": "The golfer's social media post said, “Love is in the air.”",
    "link": "https://www.bostonherald.com/2025/03/24/tiger-woods-vanessa-trump-social-media/",
    "timestamp": "2025-03-24T17:09:49Z"
  },
  {
    "title": "WATCH: Subway Rider Tries to Steal MAGA Hat Off Trump Fan’s Head — And Instantly Regrets It",
    "description": "A New York City subway rider tried to rip a fellow straphanger's \"Make America Great Again\" hat off his head in a tense exchange aboard a train but quickly paid for it when the dispute spilled onto the platform.\nThe post WATCH: Subway Rider Tries to Steal MAG…",
    "link": "https://www.mediaite.com/news/watch-subway-rider-tries-to-steal-maga-hat-off-trump-fans-head-and-instantly-regrets-it/",
    "timestamp": "2025-03-24T17:09:44Z"
  },
  {
    "title": "Hyundai to announce a $20 billion investment in the United States",
    "description": "South Korean-based Hyundai will announce a $20 billion investment in U.S. on-shoring on Monday, which includes a $5 billion steel plant in Louisiana, the White House confirmed.",
    "link": "https://www.abc12.com/news/business/hyundai-to-announce-a-20-billion-investment-in-the-united-states/article_41de68d5-aeae-5f78-be77-27356ff228e1.html",
    "timestamp": "2025-03-24T17:09:21Z"
  },
  {
    "title": "Tesla share price is down by 30 per cent for year. Is Elon Musk responsible for EV maker's US stock market downfall?",
    "description": "Share price of Elon Musk's Tesla was witnessing an uptick on Monday and is on track to record its biggest one-day percentage jump since November 6.",
    "link": "https://economictimes.indiatimes.com/news/international/us/tesla-share-price-is-down-by-30-per-cent-for-year-is-elon-musk-responsible-for-ev-makers-us-stock-market-downfall/articleshow/119436290.cms",
    "timestamp": "2025-03-24T17:09:01Z"
  },
  {
    "title": "Musk set to earn billions from Trump administration",
    "description": "Musk's company SpaceX will receive billions in federal government contracts in the coming years",
    "link": "https://theweek.com/politics/elon-musk-trump-spacex-contracts",
    "timestamp": "2025-03-24T17:08:49Z"
  },
  {
    "title": "Trump says he will soon announce tariffs on autos, aluminum, pharmaceuticals",
    "description": "U.S. President Donald Trump announced that tariffs on automobiles, aluminum, and pharmaceuticals would soon be imposed to protect the nation’s interests. Commerce Secretary Howard Lutnick indicated that the tariffs would be implemented on April 2, marking the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-he-will-soon-announce-tariffs-on-autos-aluminum-pharmaceuticals/articleshow/119436416.cms",
    "timestamp": "2025-03-24T17:08:11Z"
  },
  {
    "title": "I Am A USAID Worker Who Lost My Job. Here's What Trump And Musk Aren't Telling You About The Cuts.",
    "description": "\"By eviscerating USAID, Trump and Elon Musk are redefining what it means to be American.\"",
    "link": "https://www.huffpost.com/entry/usaid-worker-cuts-job-lost_n_67e15ea4e4b0bd547770ef36",
    "timestamp": "2025-03-24T17:08:00Z"
  },
  {
    "title": "GOP Squabbling Shows Passing Trump’s Agenda Is Harder Than Doing Executive Orders",
    "description": "House and Senate Republicans are sniping at each other over tax cuts and cuts to Medicaid.",
    "link": "https://www.huffpost.com/entry/republican-budget-resolution-senate_n_67e17f42e4b0b3ae9e410fb5",
    "timestamp": "2025-03-24T17:07:46Z"
  },
  {
    "title": "Trump Demands That Colorado Take Down His Jowly Portrait",
    "description": "Trump demanded that Colorado take down his jowly portrait. On Truth Social, Trump claimed that artist Sarah Boardman ‘purposely distorted’ his image. But she actually tried to make him look ‘neutral,’ and her Obama and Bush portraits look similar.",
    "link": "http://nymag.com/intelligencer/article/trump-colorado-portrait-sarah-boardman.html",
    "timestamp": "2025-03-24T17:07:01Z"
  },
  {
    "title": "Veterans becoming face of Trump’s government cuts and Democrats’ resistance",
    "description": "Former service members have been acutely affected by the Republican president's actions, including layoffs at the Department of Veterans Affairs and a Pentagon purge of archives that documented military diversity.",
    "link": "https://www.pbs.org/newshour/politics/veterans-becoming-face-of-trumps-government-cuts-and-democrats-resistance",
    "timestamp": "2025-03-24T17:05:37Z"
  },
  {
    "title": "In sports, DEI is not a luxury item, but a necessity",
    "description": "PROVIDENCE, R.I. — When you work in the field of sport and play, it’s easy — convenient even — to insulate yourself from disruptions outside the arena, especially during March Madness. But in the last month, the disruptions have become too pronounced to ignor…",
    "link": "https://andscape.com/features/in-sports-dei-is-not-a-luxury-item-but-a-necessity/",
    "timestamp": "2025-03-24T17:03:53Z"
  },
  {
    "title": "Bay Area Democrat Holds Town Halls In Red-Leaning Districts",
    "description": "Congressman Ro Khanna heard from both Democrats and Republicans, frustrated by the actions of the Trump administration.",
    "link": "https://www.kqed.org/news/12032708/bay-area-democrat-holds-town-halls-in-red-leaning-districts",
    "timestamp": "2025-03-24T17:02:53Z"
  },
  {
    "title": "Trump’s Tariff ‘Liberation Day’ Is 9 Days Away: Here’s What To Know As Reciprocal Tariffs Loom",
    "description": "“Presumably something is going to happen,” but “the hard part is trying to figure out what precisely that might be,” UBS economists shrugged about Trump’s April 2 circling of the calendar.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/24/trumps-tariff-liberation-day-is-9-days-away-heres-what-to-know-as-reciprocal-tariffs-loom/",
    "timestamp": "2025-03-24T17:02:14Z"
  },
  {
    "title": "'Fake tough guy': J.D. and Usha Vance blasted for Greenland threat and 'aggressive' visit",
    "description": "Vice President JD Vance and Second Lady Usha Vance are launching a coordinated campaign targeting Greenland, the semi-autonomous Danish territory that President Donald Trump has repeatedly expressed interest in acquiring for the United States—despite firm res…",
    "link": "https://www.rawstory.com/fake-tough-guy-j-d-and-usha-vance-blasted-for-greenland-threat-and-aggressive-visit/",
    "timestamp": "2025-03-24T17:01:46Z"
  },
  {
    "title": "Trump expects the Fed to lower rates",
    "description": "United States President Donald Trump expects the US Federal Reserve to lower interest rates as soon as possible, per a statement during a cabinet meeting on Monday.His comment comes just a week after ...",
    "link": "https://biztoc.com/x/2c3458f8573808fb",
    "timestamp": "2025-03-24T17:01:40Z"
  },
  {
    "title": "Mia Love Cause of Death: First Black GOP Congresswoman Passes Away at 49",
    "description": "Reading Time: 3 minutesCongresswoman Mia Love has passed away the age of 49.\nMia Love Cause of Death: First Black GOP Congresswoman Passes Away at 49 was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/03/mia-love-cause-of-death-first-black-gop-congresswoman-passes-away-at-49/",
    "timestamp": "2025-03-24T17:01:36Z"
  },
  {
    "title": "Who is Alina Habba? Trump's loyal Attorney appointed as U.S. Attorney for New Jersey amid promises to reform justice system",
    "description": "Alina Habba, former Trump personal attorney and White House counselor, has been appointed interim U.S. Attorney for New Jersey by Donald Trump. Known for her loyalty and high-profile legal representation of Trump, including lawsuits against The New York Times…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-alina-habba-trumps-loyal-attorney-appointed-as-u-s-attorney-for-new-jersey-amid-promises-to-reform-justice-system/articleshow/119435810.cms",
    "timestamp": "2025-03-24T17:01:24Z"
  },
  {
    "title": "Fears of ad spend cuts grow as Sorrell and marketing leaders warn of Trump tariff turmoil",
    "description": "The S4 Capital boss today said uncertainty around tariffs would make for tough trading in 2025. He’s not the only one in marketing that’s concerned.Business was already tough enough for Sir Martin Sorrell before the will-they-won’t-they tariff saga began with…",
    "link": "https://www.thedrum.com/news/2025/03/24/fears-ad-spend-cuts-grow-sorrell-and-marketing-leaders-warn-trump-tariff-turmoil",
    "timestamp": "2025-03-24T17:01:00Z"
  },
  {
    "title": "Legal expert accuses 'judge shopping' Democrats of manipulating courts to derail Trump agenda",
    "description": "Fox News legal analyst Gregg Jarrett accused Democrats and liberal groups of seeking out sympathetic judges who are guaranteed to rule against President Trump's agenda.",
    "link": "https://www.foxnews.com/media/legal-expert-accuses-judge-shopping-democrats-manipulating-courts-derail-trump-agenda",
    "timestamp": "2025-03-24T17:00:54Z"
  },
  {
    "title": "U.S. and Russia Continue Saudi Arabia Talks for Ukraine Cease-Fire",
    "description": "US and Russian officials are holding talks in Saudi Arabia aimed at reaching a cease-fire deal in Ukraine. The negotiations on March 24 came a day after separate talks between the US and Ukraine which Kyiv called \"productive.\" The US-Russia talks are expected…",
    "link": "https://oilprice.com/Energy/Energy-General/US-and-Russia-Continue-Saudi-Arabia-Talks-for-Ukraine-Cease-Fire.html",
    "timestamp": "2025-03-24T17:00:00Z"
  },
  {
    "title": "‘U dodged a massive bullet’: Woman turns down older man at the gym. Then she sees what kind of car he gets into",
    "description": "There are fewer vehicles out on the road that get more hate than the Tesla Cybertruck. Some people dislike the car due to its \"dumpster\"-like design. Others have an issue with Tesla CEO Elon Musk. Despite what you may think of them, there's no questioning tha…",
    "link": "https://www.dailydot.com/news/cybertruck-dating-red-flag/",
    "timestamp": "2025-03-24T17:00:00Z"
  },
  {
    "title": "Trump to announce auto, aluminum and pharma tariffs ‘very soon’",
    "description": "Commerce Secretary Howard Lutnick added that on April 2, the U.S. will launch an “external revenue service” alongside the tariff measures.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-to-announce-auto-aluminum-and-pharma-tariffs-very-soon/article69370363.ece",
    "timestamp": "2025-03-24T16:59:58Z"
  },
  {
    "title": "\"No more loans to babies or the dead\": Elon Musk's DOGE backs SBA's crackdown on fraudulent loans",
    "description": "Elon Musk has thrown his weight behind the U.S. Small Business Administration's (SBA) new fraud-prevention policy, which now requires loan applicants to provide their date of birth. The Department of Government Efficiency (DOGE), Musk’s initiative to curb was…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-more-loans-to-babies-or-the-dead-elon-musks-doge-backs-sbas-crackdown-on-fraudulent-loans/articleshow/119435488.cms",
    "timestamp": "2025-03-24T16:59:56Z"
  },
  {
    "title": "Why Did Vanessa Trump Divorce Donald Trump Jr.? Their Split",
    "description": "Vanessa and Don Jr.'s high-profile divorce made headlines as infidelity rumors circulated for years.",
    "link": "https://hollywoodlife.com/feature/why-did-vanessa-trump-divorce-donald-trump-jr-5376380/",
    "timestamp": "2025-03-24T16:59:50Z"
  },
  {
    "title": "DHS Secretary Kristi Noem to visit El Salvador prison holding deported illegal aliens",
    "description": "'If you come to our country and break our laws, we will hunt you down, and lock you up'",
    "link": "https://www.wnd.com/2025/03/dhs-secretary-kristi-noem-to-visit-el-salvador-prison-holding-deported-illegal-aliens/",
    "timestamp": "2025-03-24T16:59:37Z"
  },
  {
    "title": "‘Quit Being a Coward!’ Chuck Grassley Gets an Earful About Trump and Musk at Heated Iowa Town Hall",
    "description": "Sen. Chuck Grassley (R-IA) faced an angry crowd at a town hall this past weekend in Hampton, Iowa, as constituents complained about recent actions by President Donald Trump and DOGE head Elon Musk and demanded their senator do more to oppose them.\nThe post ‘Q…",
    "link": "https://www.mediaite.com/politics/quit-being-a-coward-chuck-grassley-gets-an-earful-about-trump-and-musk-at-heated-iowa-town-hall/",
    "timestamp": "2025-03-24T16:59:17Z"
  },
  {
    "title": "Watch: Videos Show How Disney's 'Snow White' Bombed in Real Time: 'Hilariously Abysmal'",
    "description": "Disney's \"Snow White\" is churning out empty cinemas, according to X users who shared embarrassing photos showcasing the films screenings resulting in zero or one reserved seat in movie theaters. \"This is hilariously abysmal,\" one social media user said of the…",
    "link": "https://www.breitbart.com/entertainment/2025/03/24/watch-videos-show-how-disneys-snow-white-bombed-in-real-time-hilariously-abysmal/",
    "timestamp": "2025-03-24T16:58:23Z"
  },
  {
    "title": "Ivanka Trump Reacts To Trump World's Newest Romance",
    "description": "The first daughter reacted to Tiger Woods and Vanessa Trump's public debut in an Instagram comment.",
    "link": "https://www.huffpost.com/entry/ivanka-trump-tiger-woods-vanessa-trump-relationship-debut_n_67e178cce4b006252f73ad4e",
    "timestamp": "2025-03-24T16:57:47Z"
  },
  {
    "title": "Trende: The Democratic Party Is Still Standing Because Trump Is a One-Man Turnout Machine for Their Base",
    "description": "Thursday on the RealClearPolitics podcast, Tom Bevan, Carl Cannon, and Sean Trende looked at some interesting demographic trends reported by David Shor about the 2024 election results and what they suggest about the future of the Democratic Party.\n\n\"White vot…",
    "link": "https://www.realclearpolitics.com/video/2025/03/24/trende_the_reason_the_democratic_party_is_still_standing_is_trump_is_a_one_man_turnout_machine_for_their_base.html",
    "timestamp": "2025-03-24T16:56:42Z"
  },
  {
    "title": "Former Utah Rep. Mia Love, the first Black Republican woman elected to the US House, has died",
    "description": "Her daughter had said the former lawmaker was no longer responding to brain cancer treatment.",
    "link": "https://www.bostonherald.com/2025/03/24/obit-mia-love/",
    "timestamp": "2025-03-24T16:55:05Z"
  },
  {
    "title": "Protesters in Serbia rally against real estate project with Trump son-in-law Kushner",
    "description": "Thousands of protesters in Serbia have rallied against plans to turn a former army headquarters into a luxury complex",
    "link": "https://abcnews.go.com/International/wireStory/protesters-serbia-rally-real-estate-project-trump-son-120103342",
    "timestamp": "2025-03-24T16:54:39Z"
  },
  {
    "title": "IRS Braces for Huge Revenue Hit Thanks to Elon Musk’s DOGE",
    "description": "Elon Musk’s decision to take a chainsaw to the Internal Revenue Service is fast-tracking the agency for a steep decline in revenue.\r\nAbrupt, DOGE-directed staff cuts at the agency have sparked fears that U.S. tax revenue could plummet by 10 percent, or $500 b…",
    "link": "https://newrepublic.com/post/193093/irs-revenue-elon-musk-doge-cuts",
    "timestamp": "2025-03-24T16:53:42Z"
  },
  {
    "title": "THE TRASH REPORT: Marital Woes and Expensive Cheetos",
    "description": "Slip on your hazmat suit and dig in to this week's pile of hot goss.\n \n by Elinor Jones\n \n \n \n Hello sweet angel baby Trash Pandas, and welcome back to the Trash Report! It's me, Portland's Best Kept Secret™, Elinor Jones. Remember in Jerry Maguire when Tom C…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/03/24/47700060/the-trash-report-marital-woes-and-expensive-cheetos",
    "timestamp": "2025-03-24T16:53:00Z"
  },
  {
    "title": "‘We Are in an Emergency’: Progressive TikTok Star Launches Bid to Unseat Old Guard Dem",
    "description": "The progressive TikTok star is running for Congress in a Democratic district that hasn’t had a competitive primary in decades.",
    "link": "http://www.rollingstone.com/politics/politics-features/kat-abughazaleh-congress-1235301996/",
    "timestamp": "2025-03-24T16:52:58Z"
  },
  {
    "title": "Bomb Squad Finds 'Incendiary Devices' at Texas Tesla Dealership",
    "description": "The FBI recently issued a warning as protests against Tesla continue to be used to show opposition against the Trump admin.",
    "link": "https://www.newsweek.com/bomb-squad-finds-incendiary-devices-texas-tesla-dealership-2049720",
    "timestamp": "2025-03-24T16:52:15Z"
  },
  {
    "title": "Stock Market Today: Dow Jones Jumps, Tesla Roars On Trump Tariff News; Cathie Wood Buys This Stock Amid 53% Dive (Live Coverage)",
    "description": "The Dow Jones Industrial Average and other indexes surged on the stock market today as it appeared President Donald Trump would back off on some tariff plans. Tesla (TSLA), Nvidia (NVDA) and Palantir Technologies (PLTR) were among the biggest winners. Also, f…",
    "link": "https://biztoc.com/x/6bcafb978302b96a",
    "timestamp": "2025-03-24T16:50:59Z"
  },
  {
    "title": "Who Are the Three Judges on Appeals Panel in Trump Deportation Case?",
    "description": "A panel of three D.C. appeals court judges will hear arguments into whether a judge can block President Donald Trump from using the 1798 Alien Enemies Act to deport individuals believed to be part of a Venezuelan gang without due process.\nWhy It Matters\nThe T…",
    "link": "https://biztoc.com/x/9b083ab6ae36d834",
    "timestamp": "2025-03-24T16:50:21Z"
  },
  {
    "title": "Donald Trump Tells Clay Travis That Jeff Bezos Wants To Fix The Washington Post (Ian Miller/OutKick)",
    "description": "Ian Miller / OutKick:\nDonald Trump Tells Clay Travis That Jeff Bezos Wants To Fix The Washington Post  —  The 2024 presidential election changed nearly everything about American life, culture, and the prevailing political attitude.  —  President Donald Trump'…",
    "link": "https://www.memeorandum.com/250324/p73",
    "timestamp": "2025-03-24T16:50:01Z"
  },
  {
    "title": "Greenland condemns planned visits by Usha Vance and Trump adviser (James FitzGerald/BBC)",
    "description": "James FitzGerald / BBC:\nGreenland condemns planned visits by Usha Vance and Trump adviser  —  Greenland's politicians have condemned plans for high-profile US visits, in the wake of President Donald Trump's threats to take over the island.  —  Second Lady Ush…",
    "link": "https://www.memeorandum.com/250324/p72",
    "timestamp": "2025-03-24T16:50:01Z"
  },
  {
    "title": "‘I Don’t Agree’: Charlamagne, Co-Host Rail Against Dem Strategy To Resist Trump At All Costs",
    "description": "Radio hosts Charlamagne Tha God and DJ Envy criticized the Democratic Party's strategy to resist President Donald Trump's entire agenda.",
    "link": "https://dailycaller.com/2025/03/24/i-dont-agree-charlamagne-co-host-rail-against-dem-strategy-to-resist-trump-at-all-costs/",
    "timestamp": "2025-03-24T16:49:27Z"
  },
  {
    "title": "Tiger Woods-Vanessa Trump romance: Dave Portnoy slams golfer’s request for privacy",
    "description": "Dave Portnoy has slammed Tiger Woods’ post asking for privacy regarding his new relationship with Vanessa Trump. The businessman referenced Woods’ cheating scandals in an interview and said he has never been a fan of the golfing legend. Tiger Woods made his r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/tiger-woods-vanessa-trump-romance-dave-portnoy-slams-golfers-request-for-privacy/articleshow/119435734.cms",
    "timestamp": "2025-03-24T16:49:22Z"
  },
  {
    "title": "China woos CEOs of big global companies against backdrop of US tariffs",
    "description": "China Development Forum in Beijing hears that the country is willing to open its market further to foreign investment",
    "link": "https://www.irishtimes.com/business/economy/2025/03/24/china-woos-ceos-of-big-global-companies-against-backdrop-of-us-tariffs/",
    "timestamp": "2025-03-24T16:49:19Z"
  }
]