[
  {
    "title": "‘DUMB AS A ROCK!’ Trump Pillories Kamala Harris, Demands Apology for Claim 2024 Election Was ‘Closest’ This Century",
    "description": "President Trump went nuclear on Kamala Harris, ripping her for incorrectly claiming the 2024 election was the \"closest\" of the century\nThe post ‘DUMB AS A ROCK!’ Trump Pillories Kamala Harris, Demands Apology for Claim 2024 Election Was ‘Closest’ This Century…",
    "link": "https://www.mediaite.com/media/dumb-as-a-rock-trump-pillories-kamala-harris-demands-apology-for-claim-2024-election-was-closest-this-century/",
    "timestamp": "2025-09-24T21:42:59Z"
  },
  {
    "title": "Israeli strikes kill dozens in Gaza City, hospitals say, as offensive expands",
    "description": "Women and children were among 20 people who died when a strike hit a building sheltering displaced families, first responders say.",
    "link": "https://www.bbc.com/news/articles/cz9j4190171o",
    "timestamp": "2025-09-24T21:41:51Z"
  },
  {
    "title": "Top hedge fund DE Shaw fires DEI chief after The Post’s exposé on woke HR policies",
    "description": "It follows a Post exposé on its woke HR policies that described how staffers feared the firm's stance placed it squarely in the sights of President Donald Trump.",
    "link": "https://nypost.com/2025/09/24/business/top-hedge-fund-de-shaw-fires-dei-chief-after-the-posts-expose-on-woke-hr-policies/",
    "timestamp": "2025-09-24T21:39:41Z"
  },
  {
    "title": "'Starting to wake up': Strategist claims Kimmel saga turning point for Trump opposition",
    "description": "In the wake of President Donald Trump's re-election, a wide variety of institutions, from businesses to universities to law firms, scrambled to get on his good side, letting him dictate a wide range of hiring policies and business decisions.But the massive ba…",
    "link": "https://www.rawstory.com/trump-businesses/",
    "timestamp": "2025-09-24T21:38:54Z"
  },
  {
    "title": "Daily newsletter 9/24",
    "description": "➡️ Things took a weird and annoying turn in today’s top stories, starting with Log Cabin Republicans attending a Kennedy Center concert just to heckle a musician who criticizes Trump.",
    "link": "https://www.advocate.com/newsletter/daily-newsletter-9-24",
    "timestamp": "2025-09-24T21:36:05Z"
  },
  {
    "title": "US senators signal resistance to market structure over ’foreign crypto deals’",
    "description": "No scheduled consideration of a market structure bill appeared on Senate calendars as of Wednesday, and pushback from Democrats could challenge what is expected to be a tight vote.",
    "link": "https://cointelegraph.com/news/us-senators-market-structure-impact-foreign-crypto-deals",
    "timestamp": "2025-09-24T21:34:55Z"
  },
  {
    "title": "Intel seeks investment from Apple, Bloomberg News reports",
    "description": "The talks are at an early stage and may not lead to an agreement.  Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/intel-seeks-investment-from-apple-bloomberg-news-reports",
    "timestamp": "2025-09-24T21:34:50Z"
  },
  {
    "title": "Howard Stern Fights Back: Shock Jock Calls Out FCC Chair for 'Morally Changing' After ABC Network Allowed Jimmy Kimmel's Show to Resume Following Suspension",
    "description": "Howard Stern has decided he's no longer holding back and spoke out about ABC's decision to boot Jimmy Kimmel's show over his Charlie Kirk comments.",
    "link": "https://radaronline.com/p/howard-stern-blasts-fcc-chair-jimmy-kimmel-suspension-return/",
    "timestamp": "2025-09-24T21:34:28Z"
  },
  {
    "title": "Jessica Chastain opposes Apple TV+ decision to delay 'The Savant' after Charlie Kirk's death",
    "description": "Jessica Chastain says she disagrees with Apple TV+'s decision to postpone the release of the political thriller series “The Savant” following the assassination of Charlie Kirk. Chastain, who is also the show's executive producer, took to Instagram Wednesday t…",
    "link": "https://japantoday.com/category/entertainment/jessica-chastain-opposes-apple-tv-decision-to-delay-%27the-savant%27-after-charlie-kirk%27s-death",
    "timestamp": "2025-09-24T21:34:26Z"
  },
  {
    "title": "Some leaders at UN condemn 'sick expression of joy,' 'macabre response' to Charlie Kirk's killing",
    "description": "World leaders at the United Nations General Assembly have spoken out against the assassination of conservative activist Charlie Kirk, as well as divisive reaction to it",
    "link": "https://abcnews.go.com/US/wireStory/leaders-condemn-sick-expression-joy-macabre-response-charlie-125904115",
    "timestamp": "2025-09-24T21:34:26Z"
  },
  {
    "title": "Trump staffer leaving White House in highest-profile exit yet of second term",
    "description": "Taylor Budowich, President Donald Trump’s deputy chief of staff overseeing communications, will leave the administration later this month for a new job, a...",
    "link": "https://www.cnn.com/2025/09/24/politics/taylor-budowich-departure-white-house",
    "timestamp": "2025-09-24T21:34:12Z"
  },
  {
    "title": "Con Job? Climate Change Is My Job, Says Island Nation Leader",
    "description": "US President Donald Trump may dismiss climate change as a \"con job\" -- but for the leader of tiny St. Kitts and Nevis, its toll is unmistakable: land swallowed, homes battered, and livelihoods threatened.",
    "link": "https://www.ibtimes.com/con-job-climate-change-my-job-says-island-nation-leader-3784368",
    "timestamp": "2025-09-24T21:33:23Z"
  },
  {
    "title": "Trump poised to add Japan stop to upcoming Asia trip",
    "description": "U.S. and Japanese officials are making arrangements for a trip by President Donald Trump to Japan next month, according to two government officials and another person briefed on the matter. A visit to Tokyo, Washington's closest ally in East Asia and a major …",
    "link": "https://japantoday.com/category/politics/exclusive-trump-poised-to-add-japan-stop-to-upcoming-asia-trip",
    "timestamp": "2025-09-24T21:33:10Z"
  },
  {
    "title": "LDP leadership candidates at odds over how to tackle China threat",
    "description": "The five contenders in the ruling Liberal Democratic Party's leadership race on Wednesday were at odds over how to tackle security threats from China, with one saying Japan should implement an anti-espionage law as a deterrence. But the candidates, all vying …",
    "link": "https://japantoday.com/category/politics/refiling-update2-ldp-leadership-candidates-at-odds-over-how-to-tackle-china-threat",
    "timestamp": "2025-09-24T21:33:01Z"
  },
  {
    "title": "In U.N. debut, new Syria leader warns on Israel but backs dialogue",
    "description": "Syria's new leader warned Wednesday that Israel's persistent attacks put the region at risk, but he backed diplomacy as he won support on his U.N. debut. Ahmed al-Sharaa is the first Syrian president to address the annual U.N. General Assembly in decades, mar…",
    "link": "https://japantoday.com/category/world/in-un-debut-new-syria-leader-warns-on-israel-but-backs-dialogue",
    "timestamp": "2025-09-24T21:30:12Z"
  },
  {
    "title": "Lance Twiggs, Alleged Romantic Partner of Tyler Robinson, Has ‘Vanished’ Amid …",
    "description": "Reading Time: 3 minutesTyler Robinson's roommate has allegedly fled the area.\nLance Twiggs, Alleged Romantic Partner of Tyler Robinson, Has ‘Vanished’ Amid … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/09/lance-twiggs-alleged-romantic-partner-of-tyler-robinson-has-vanished-amid-death-threats-report/",
    "timestamp": "2025-09-24T21:30:08Z"
  },
  {
    "title": "Trump plans 'America First' foreign aid funding shift, document shows",
    "description": "The Trump administration intends to shift $1.8 billion in foreign aid funding toward &quot;America First&quot; initiatives such as pursuing investments in Greenland and countering &quot;Marxist, anti-American regimes&quot; in Latin America, according to a doc…",
    "link": "https://japantoday.com/category/world/trump-plans-%27america-first%27-foreign-aid-funding-shift-document-shows2",
    "timestamp": "2025-09-24T21:30:02Z"
  },
  {
    "title": "Trump administration strips NYC of millions in funding because of trans student policies",
    "description": "A protest for trans rights in Washington, D.C.\n \n\nFederal officials said New York City’s policies on bathroom access violate civil rights law, and that the Trump administration would be freezing $15 million the city had previously won in grants to support fiv…",
    "link": "https://gothamist.com/news/trump-administration-strips-nyc-of-millions-in-funding-because-of-trans-student-policies",
    "timestamp": "2025-09-24T21:30:00Z"
  },
  {
    "title": "Zelenskiy tells U.N.: Stop Russia's war or face dangerous arms race",
    "description": "Ukrainian President Volodymyr Zelenskyy urged world powers to help stop Russia's war in his country in a speech to the United Nations on Wednesday, warning of a dangerous arms race that he said the fighting was unleashing. He called for global rules to curb t…",
    "link": "https://japantoday.com/category/world/zelenskiy-tells-un-stop-russia%27s-war-or-face-dangerous-arms-race",
    "timestamp": "2025-09-24T21:29:53Z"
  },
  {
    "title": "Israeli tanks push deeper into Gaza City as Trump talks peace",
    "description": "Israeli forces pushed towards the heart of Gaza City on Wednesday as pressure mounted on U.S. President Donald Trump to find a way to end nearly two years of fighting in Gaza and secure the release of Israeli hostages held there. U.S. special envoy Steve Witk…",
    "link": "https://japantoday.com/category/world/israeli-tanks-push-deeper-into-gaza-city-as-trump-talks-peace3",
    "timestamp": "2025-09-24T21:29:28Z"
  },
  {
    "title": "Trump Wants to Open Up 45 Million Acres of Roadless Wilderness to Logging",
    "description": "A push to repeal the Roadless Rule that protects the few ecosystems that remain truly wild faces mass public opposition.",
    "link": "https://truthout.org/articles/trump-wants-to-open-up-45-million-acres-of-roadless-wilderness-to-logging/",
    "timestamp": "2025-09-24T21:29:23Z"
  },
  {
    "title": "Fox News Host Declares War Against U.N. After Trump's Escalator Snafu",
    "description": "During Tuesday's episode of \"The Five,\"  Watters sarcastically laid out his extravagant revenge plan.",
    "link": "https://www.huffpost.com/entry/jesse-watters-bomb-un-trump-escalator-teleprompter_n_68d41d6ee4b0ca9d88169dbc",
    "timestamp": "2025-09-24T21:26:45Z"
  },
  {
    "title": "‘We need to be ready to go’: AFSOC preps for potential Caribbean missions",
    "description": "AFSOC held a long-planned exercise on St. Croix just days before the first U.S. strike on an alleged drug boat.",
    "link": "https://www.defenseone.com/threats/2025/09/we-need-be-ready-go-afsoc-preps-potential-caribbean-missions/408351/",
    "timestamp": "2025-09-24T21:26:44Z"
  },
  {
    "title": "‘We need to be ready to go’: AFSOC preps for potential Venezuela-related missions",
    "description": "AFSOC held a long-planned exercise on St. Croix just days before the first U.S. strike on an alleged drug boat.",
    "link": "https://www.defenseone.com/threats/2025/09/we-need-be-ready-go-afsoc-prepping-potential-venezuela-related-trainings-missions/408351/",
    "timestamp": "2025-09-24T21:26:44Z"
  },
  {
    "title": "Trump’s Aim to Take Back Afghan Air Base Doesn’t Make Sense",
    "description": "The Taliban quickly rejected the U.S. president’s demand that it turn over Bagram Airfield to the United States.",
    "link": "http://foreignpolicy.com/2025/09/24/trump-bagram-airbase-taliban-afghanistan/",
    "timestamp": "2025-09-24T21:26:39Z"
  },
  {
    "title": "Some leaders at UN condemn ‘sick expression of joy,’ ‘macabre response’ to Charlie Kirk’s killing",
    "description": "Several world leaders gathered at the U.N. General Assembly referenced the conservative activist’s slaying.",
    "link": "https://www.bostonherald.com/2025/09/24/united-nations-charlie-kirk/",
    "timestamp": "2025-09-24T21:25:15Z"
  },
  {
    "title": "WATCH: Hillary Clinton blames white Christian men for ‘such damage’ to America",
    "description": "Claims the nation WAS on the trajectory to be better, but then … And she gets called out for projection",
    "link": "https://www.wnd.com/2025/09/watch-hillary-clinton-blames-white-christian-men-such/",
    "timestamp": "2025-09-24T21:25:09Z"
  },
  {
    "title": "More Than 100 Former ABC News Employees Call On Disney CEO Bob Iger To Make Clear Network “Will Not Be Silenced Or Intimidated By Political Pressure”",
    "description": "More than 100 former ABC News employees, including Sam Donaldson, Tom Bettag and Judy Muller, have signed on to a letter urging Walt Disney Co. CEO Bob Iger to step it up when it comes to publicly defending journalists under political attacks and the company …",
    "link": "http://deadline.com/2025/09/abc-news-trump-iger-letter-1236555061/",
    "timestamp": "2025-09-24T21:25:01Z"
  },
  {
    "title": "More Than 100 Former ABC News Employees Call On Disney CEO Bob Iger To Make Clear Network “Will Not Be Silenced Or Intimidated By Political Pressure”",
    "description": "More than 100 former ABC News employees including Sam Donaldson, Tom Bettag and Judy Muller have signed on to a letter urging Walt Disney Company CEO Bob...",
    "link": "https://deadline.com/2025/09/abc-news-trump-iger-letter-1236555061/",
    "timestamp": "2025-09-24T21:25:01Z"
  },
  {
    "title": "Kamala Harris Admits She Wasn’t Fit to Be President … Without Knowing She Admitted It",
    "description": "In her new book out Sept. 23, Kamala Harris flat out admits she wasn’t fit to be President of the United States. She just doesn’t... Read More\nThe post Kamala Harris Admits She Wasn’t Fit to Be President … Without Knowing She Admitted It appeared first on The…",
    "link": "https://www.dailysignal.com/2025/09/24/kamala-harris-admits-she-wasnt-fit-to-be-president-without-knowing-she-admitted-it/",
    "timestamp": "2025-09-24T21:25:00Z"
  },
  {
    "title": "Comey and James about to be indicted?",
    "description": "Looking that way: Donald Trump’s handpicked U.S. Attorney in Virginia is planning to ask a grand jury in the coming days to indict former FBI Director James Comey for allegedly lying to Congress, despite prosecutors and investigators determining there was ins…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/09/comey-and-james-about-to-be-indicted",
    "timestamp": "2025-09-24T21:22:24Z"
  },
  {
    "title": "Power failure shutters Costa Rica's 2 main airports, airspace",
    "description": "A power shortage forced Costa Rican airspace closed and scores of delays as the latest country around the globe to face issues at two of its biggest airports...",
    "link": "https://www.upi.com/Top_News/World-News/2025/09/24/Costa-Rica-international-airport-power-failure-Juan-Santamaria-Daniel-Quiros/2831758742179/",
    "timestamp": "2025-09-24T21:21:05Z"
  },
  {
    "title": "Homelessness is dropping in California counties. But funding cuts could derail that progress",
    "description": "Experts worry liberal California will be blacklisted from federal homelessness dollars, effectively counteracting recent progress.",
    "link": "https://www.kpbs.org/news/politics/2025/09/24/homelessness-is-dropping-in-california-counties-but-funding-cuts-could-derail-that-progress",
    "timestamp": "2025-09-24T21:20:49Z"
  },
  {
    "title": "Brittany, Jason Aldean Honor Charlie Kirk With Heartfelt Duet",
    "description": "Jason Aldean and his wife, Brittany, paid a moving tribute to conservative commentator Charlie Kirk, two weeks after his death.",
    "link": "https://dailycaller.com/2025/09/24/brittany-jason-aldean-honor-charlie-kirk-duet-tribute-luke-bryan/",
    "timestamp": "2025-09-24T21:19:34Z"
  },
  {
    "title": "Justice Department weighing whether to charge former FBI Director James Comey, sources say",
    "description": "President Donald Trump recently posted on social media that the former FBI director and other political foes like Sen. Adam Schiff should be prosecuted.",
    "link": "https://www.nbcnews.com/politics/justice-department/justice-department-weighing-whether-charge-james-comey-lying-congress-rcna233535",
    "timestamp": "2025-09-24T21:19:27Z"
  },
  {
    "title": "Trump is right that European nations should stop buying Russian energy, says top EU official",
    "description": "European Commission vice-president Kaja Kallas said it was of \"great regret\" that this was still happening among some of the bloc's member states.",
    "link": "https://news.sky.com/story/donald-trump-is-right-that-european-nations-should-stop-buying-russian-energy-says-top-eu-official-13437532",
    "timestamp": "2025-09-24T21:18:00Z"
  },
  {
    "title": "Trump's rhetoric on Ukraine changes, while his actions so far remain the same",
    "description": "Donald Trump is suddenly bullish when it comes to Ukraine’s chances of repelling Russia’s invasion and regaining all its territory.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trumps-rhetoric-ukraine-changes-actions-far-remain-rcna233343",
    "timestamp": "2025-09-24T21:17:48Z"
  },
  {
    "title": "Trump Administration Broke Court Rules In Luigi Mangione Case, Judge Says",
    "description": "Justice Department officials appear to have inappropriately shared social media posts about the case in recent days.",
    "link": "https://www.huffpost.com/entry/trump-administration-luigi-mangione_n_68d4342de4b01e99f72d2430",
    "timestamp": "2025-09-24T21:13:36Z"
  },
  {
    "title": "Kamala Harris Finally Reveals Her Side of the Story On Botched Joe Rogan Interview",
    "description": "Kamala Harris revealed she had a date in mind to go on Joe Rogan's show, but the podcaster already had it reserved as a \"personal day\" to interview Donald Trump\nThe post Kamala Harris Finally Reveals Her Side of the Story On Botched Joe Rogan Interview first …",
    "link": "https://www.mediaite.com/media/news/kamala-harris-finally-reveals-her-side-of-the-story-on-botched-joe-rogan-interview/",
    "timestamp": "2025-09-24T21:13:30Z"
  },
  {
    "title": "GOP Reps. to Introduce Legislation to Honor Charlie Kirk on Silver Dollar Coins",
    "description": "Two Republican congressmen are planning to introduce legislation that would honor Turning Point USA Founder Charlie Kirk by featuring Kirk's image on thousands of silver dollar coins.\nThe post GOP Reps. to Introduce Legislation to Honor Charlie Kirk on Silver…",
    "link": "https://www.breitbart.com/politics/2025/09/24/gop-reps-to-introduce-legislation-to-honor-charlie-kirk-on-silver-dollar-coins/",
    "timestamp": "2025-09-24T21:11:08Z"
  },
  {
    "title": "In the Public Interest: Jill Biden Mysteriously Cancels Santa Cruz Appearance [Low Ticket Sales]",
    "description": "hen President Joe Biden visited Santa Cruz County following the 2023 winter storms, residents responded with pure fanfare. People skipped work and lined the streets with thank-you signs, and parents took their children out of school just for a chance to see t…",
    "link": "https://freerepublic.com/focus/f-chat/4342437/posts",
    "timestamp": "2025-09-24T21:11:04Z"
  },
  {
    "title": "In the Public Interest: Jill Biden Mysteriously Cancels Santa Cruz Appearance [Low Ticket Sales]",
    "description": "hen President Joe Biden visited Santa Cruz County following the 2023 winter storms, residents responded with pure fanfare. People skipped work and lined the streets with thank-you signs, and parents took their children out of school just for a chance to see t…",
    "link": "https://freerepublic.com/focus/f-news/4342437/posts",
    "timestamp": "2025-09-24T21:11:04Z"
  },
  {
    "title": "Trump envoy Witkoff expects Mideast 'breakthrough' in coming days",
    "description": "\"We presented what we call the Trump 21-point plan for peace in the Mideast and Gaza,\" Witkoff said.",
    "link": "https://www.channelnewsasia.com/world/trump-envoy-witkoff-expects-mideast-breakthrough-in-coming-days-5367571",
    "timestamp": "2025-09-24T21:09:28Z"
  },
  {
    "title": "Experts warn Trump's 'prosecutorial charade' is 'gravest threat' to democracy yet",
    "description": "President Donald Trump makes no secret about going after his political opponents, even publicly demanding Attorney General Pam Bondi prosecute his \"perceived political enemies.\"But now experts are warning that his \"prosecutorial charade\" is a threat to democr…",
    "link": "https://www.rawstory.com/donald-trump-2674030306/",
    "timestamp": "2025-09-24T21:09:16Z"
  },
  {
    "title": "US has Gaza peace plan and hopes for breakthrough soon, says envoy",
    "description": "<![CDATA[ The 21-point Middle East peace plan addresses the concerns of Israel and the neighbouring countries in the region, said US special envoy Steve Witkoff. ]]>",
    "link": "https://www.channelnewsasia.com/world/us-gaza-war-plan-peace-middle-east-israel-hamas-war-5367571",
    "timestamp": "2025-09-24T21:09:00Z"
  },
  {
    "title": "Cardinal Cupich is Wrong, Catholics Shouldn’t Honor Radical Abortion Activists",
    "description": "Sen. Dick Durbin (D-Illinois), who identifies as Catholic, has been named by the Archbishop of Chicago, Cardinal Blase Cupich, the recipient of the Lifetime Achievement Award at the “Keep Hope Alive” Benefit on November 3. It has already set off the alarms am…",
    "link": "https://freerepublic.com/focus/f-religion/4342436/posts",
    "timestamp": "2025-09-24T21:07:12Z"
  },
  {
    "title": "White nationalist imagery in ICE recruitment materials; isolation cells inside ICE detention",
    "description": "U.S. Immigration Customs and Enforcement (ICE) is in the midst of an unprecedented hiring binge, with a goal of hiring 10,000 agents by the end of the year.In a two part series, KPBS reporters look into how ICE recruiting efforts are using white nationalist m…",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/white-nationalist-imagery-in-ice-recruitment-materials-isolation-cells-inside-ice-detention",
    "timestamp": "2025-09-24T21:07:00Z"
  },
  {
    "title": "Hypocrite Democrats are driving us off the government shutdown cliff",
    "description": "Americans deserve a government that works for them — not one that lurches from crisis to crisis because each party believes the rules only apply when it’s politically convenient.",
    "link": "https://nypost.com/2025/09/24/opinion/hypocrite-democrats-drive-us-off-the-government-shutdown-cliff/",
    "timestamp": "2025-09-24T21:06:53Z"
  },
  {
    "title": "Trump Has Petty Dig At Biden As White House ‘Walk Of Fame’ Unveiled",
    "description": "The latest West Wing revamp was inspired by an unnamed Hilton hotel, the president has said.",
    "link": "https://www.huffpost.com/entry/walk-of-fame-white-house-trump-biden_n_68d43c4ae4b0ca9d8816d6a9",
    "timestamp": "2025-09-24T21:06:20Z"
  },
  {
    "title": "EXCLUSIVE: GOP Lawmakers Release Latest Results of Trump’s ‘Whole-of-Government’ Border Crackdown",
    "description": "The Trump administration removed as many of 1,500 illegal aliens from the U.S. every day during the month of August, according to the House Committee... Read More\nThe post EXCLUSIVE: GOP Lawmakers Release Latest Results of Trump’s ‘Whole-of-Government’ Border…",
    "link": "https://www.dailysignal.com/2025/09/24/exclusive-gop-lawmakers-release-latest-results-trumps-whole-government-border-crackdown/",
    "timestamp": "2025-09-24T21:05:36Z"
  },
  {
    "title": "Why Did Apple TV+ Delay ‘The Savant’? Here’s What Jessica Chastain’s Response Tells Us",
    "description": "Apple TV+ is delaying the premiere of ‘The Savant’, a move star Jessica Chastain says she disagrees with, and many are linking it to inflamed political tensions.",
    "link": "https://www.cosmopolitan.com/entertainment/celebs/a68039284/why-did-apple-tv-delay-the-savant-jessica-chastain/",
    "timestamp": "2025-09-24T21:05:00Z"
  },
  {
    "title": "Trump's cartel war is pulling US warships into a Caribbean show of force. Another destroyer just showed up.",
    "description": "There are over half a dozen US Navy warships in the Caribbean amid efforts to crack down on the drug trade.",
    "link": "https://www.businessinsider.com/another-destroyer-showed-up-in-the-caribbean-show-of-force-2025-9",
    "timestamp": "2025-09-24T21:04:05Z"
  },
  {
    "title": "What oil CEOs really think about Trump, tariffs and uncertainty: ‘Those who can are running for the exits’",
    "description": "Oil companies may have President Donald Trump cheering them on from the bully pulpit. But in the oil patch, the mood is anything but celebratory.\nNew data on Wednesday from the Dallas Fed Energy Survey, which polled oil and gas executives at 139 firms across …",
    "link": "https://biztoc.com/x/7271eede72d1680b",
    "timestamp": "2025-09-24T21:01:30Z"
  },
  {
    "title": "Top House Dem exposes party's strategy to blame Republicans for looming government shutdown",
    "description": "Democrats and Republicans are clashing over short-term funding plans with a shutdown looming at midnight Oct. 1 if no deal is reached in both chambers.",
    "link": "https://www.foxnews.com/politics/top-house-dem-exposes-partys-strategy-blame-republicans-looming-government-shutdown",
    "timestamp": "2025-09-24T21:01:29Z"
  },
  {
    "title": "Fawning MAGA Senator Pushes Trump to Seek Illegal Third Term (Leigh Kimmins/The Daily Beast)",
    "description": "Leigh Kimmins / The Daily Beast:\nFawning MAGA Senator Pushes Trump to Seek Illegal Third Term  —  WHAT CONSTITUTION?  —  Lindsey Graham has previously declared his desire for Trump to lead the country for another term, despite a constitutional bar.  —  Sen. L…",
    "link": "https://www.memeorandum.com/250924/p121",
    "timestamp": "2025-09-24T21:00:05Z"
  },
  {
    "title": "Trump Gives Putin Another Month Instead Of Two Weeks",
    "description": "During the Q&A after a meeting between Donald Trump and Ukraine Pres. Zelenskyy, Trump was asked if he still trusted Vladimir Putin and he said, \"I'll let you know in a month.\"\nTrump also said NATO countries should shoot down Russian drones if they enter thei…",
    "link": "https://crooksandliars.com/2025/09/trump-gives-putin-month-instead-two-weeks",
    "timestamp": "2025-09-24T20:59:34Z"
  },
  {
    "title": "The Pokémon Company Distances Itself From Offensive DHS Arrest Video",
    "description": "The Pokémon Company is distancing itself from a DHS Pokémon-themed video with the caption \"Gotta Catch 'Em All,\" featuring the popular cartoon's theme song and clips from the show, as ICE agents take suspects into custody.",
    "link": "https://hiphopwired.com/2847354/pokemon-nintendo-dhs-arrest-video-reactions/",
    "timestamp": "2025-09-24T20:58:17Z"
  },
  {
    "title": "'Enough Words': Colombia's Petro Urges Armed UN Force to End Gaza Genocide",
    "description": "In his stirring final speech to a United Nations General Assembly, Colombian President Gustavo Petro on Tuesday called for an international armed intervention to end Israel's nearly two-year genocide in Gaza.\"We need a powerful army of the countries that do n…",
    "link": "https://www.commondreams.org/news/gustavo-petro-un-speech",
    "timestamp": "2025-09-24T20:58:14Z"
  },
  {
    "title": "Trump's Tariffs Have Already Hurt the Economy—and the Pain Is Only Beginning",
    "description": "The Organization for Economic Cooperation and Development projects that the impact of Trump's tariffs could get worse.",
    "link": "https://reason.com/2025/09/24/trumps-tariffs-have-already-hurt-the-economy-and-the-pain-is-only-beginning/",
    "timestamp": "2025-09-24T20:56:46Z"
  },
  {
    "title": "Treasury Secretary Bessent tells NYC to ‘drop dead’ if it elects Mamdani",
    "description": "Bessent told Fox Business that if Mamdani is elected as NYC mayor, federal gov't would not bail out the city if needed.",
    "link": "https://www.aljazeera.com/economy/2025/9/24/treasury-secretary-bessent-tells-nyc-to-drop-dead-if-it-elects-mamdani",
    "timestamp": "2025-09-24T20:55:40Z"
  },
  {
    "title": "Jessica Chastain Says She's ‘Not Aligned’ on Apple’s Decision to Postpone ‘The Savant.’ Here's Why",
    "description": "Jessica Chastain responded to Apple's decision to postpone the show \"The Savant.\" Here's why the show was postponed and what Apple and Chastain has said.",
    "link": "https://www.today.com/popculture/tv/the-savant-delayed-apple-jessica-chastain-rcna233499",
    "timestamp": "2025-09-24T20:54:06Z"
  },
  {
    "title": "What oil CEOs really think about Trump, tariffs and uncertainty: ‘Those who can are running for the exits’",
    "description": "\"The uncertainty from the administration’s policies has put a damper on all investment in the oilpatch,\" one exec wrote in the quarterly Dallas Fed survey.",
    "link": "https://fortune.com/2025/09/24/oil-ceos-trump-tariffs-bleeding-them/",
    "timestamp": "2025-09-24T20:53:24Z"
  },
  {
    "title": "The Most Ominous Thing That A President Of The United States Has Said In My Entire Lifetime",
    "description": "There will be no peace with Russia, and we all know what that means. When I initially learned what President Trump had said about the war in Ukraine, I had a very difficult time believing it. When he was running against Kamala Harris, Trump reaffirmed his com…",
    "link": "http://theeconomiccollapseblog.com/the-most-ominous-thing-that-a-president-of-the-united-states-has-said-in-my-entire-lifetime/",
    "timestamp": "2025-09-24T20:53:24Z"
  },
  {
    "title": "Golden statue of Trump and Epstein is prematurely removed from National Mall",
    "description": "A statue of President Donald Trump holding hands with late convicted sex offender Jeffrey Epstein, which was unveiled Tuesday on the National Mall in Washington, D.C., was removed early Wednesday by U.S.",
    "link": "https://biztoc.com/x/cd7f7487a8fc32aa",
    "timestamp": "2025-09-24T20:50:22Z"
  },
  {
    "title": "Trump to ink order on 'domestic terrorism' soon",
    "description": "United States President Donald Trump announced on Wednesday that he will be signing an executive order to \"dismantle Domestic Terrorist Networks\" this week.\"I have been briefed on the deadly shooting ...",
    "link": "https://biztoc.com/x/19e18cb076addbed",
    "timestamp": "2025-09-24T20:50:12Z"
  },
  {
    "title": "DAVID BLACKMON: Trump’s Powerful Ultimatum To Europe On Russian Oil",
    "description": "Whether European leaders are now prepared to end their dependence on the country they claim as their mortal enemy is anyone’s guess, but one thing is certain.",
    "link": "https://dailycaller.com/2025/09/24/opinion-trumps-powerful-ultimatum-to-europe-on-russian-oil-david-blackmon/",
    "timestamp": "2025-09-24T20:49:31Z"
  },
  {
    "title": "China, world’s largest carbon polluting nation, announces new climate goal to cut emissions",
    "description": "UNITED NATIONS (AP) — With China leading the way by announcing its first emission cuts, world leaders said Wednesday they are getting more serious about fighting climate change and the deadly extreme weather that comes with it. At the United Nations high-leve…",
    "link": "https://freerepublic.com/focus/f-news/4342433/posts",
    "timestamp": "2025-09-24T20:49:06Z"
  },
  {
    "title": "Democratic senators probe Nexstar, Sinclair over Jimmy Kimmel, warn benching could run ‘afoul of federal law’",
    "description": "Democratic lawmakers are demanding to know whether Nexstar and Sinclair removed \"Jimmy Kimmel Live!\" to curry favor with the Trump administration.",
    "link": "https://www.foxnews.com/media/democratic-senators-probe-nexstar-sinclair-over-jimmy-kimmel-warn-benching-could-run-afoul-federal-law",
    "timestamp": "2025-09-24T20:48:36Z"
  },
  {
    "title": "Top Republican Breaks With Trump Over Autism Claims: ‘Very Concerned’",
    "description": "\"I think there are an awful lot of people in the medical community who come to a different conclusion about the use of Tylenol\"\nThe post Top Republican Breaks With Trump Over Autism Claims: ‘Very Concerned’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/top-republican-breaks-with-trump-over-autism-claims-very-concerned/",
    "timestamp": "2025-09-24T20:46:56Z"
  },
  {
    "title": "Newly appointed US Attorney will attempt to charge James Comey: Sources",
    "description": "The new U.S. Attorney in Virginia is planning to ask a grand jury to indict former FBI Director James Comey for allegedly lying to Congress, sources said.",
    "link": "https://abcnews.go.com/Politics/newly-appointed-us-attorney-attempt-charge-james-comey/story?id=125906268",
    "timestamp": "2025-09-24T20:46:42Z"
  },
  {
    "title": "Trump snubs Biden with autopen photo on new Presidential Walk of Fame",
    "description": "President Donald Trump has added a Presidential Walk of Fame to the White House, featuring portraits of previous commanders-in-chief — except for one",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-snubs-biden-autopen-photo-new-presidential-walk-125906460",
    "timestamp": "2025-09-24T20:46:27Z"
  },
  {
    "title": "Trump's HR Chief Says Resignations Cut 'Too Close to the Bone' (Ian Kullgren/Bloomberg Law)",
    "description": "Ian Kullgren / Bloomberg Law:\nTrump's HR Chief Says Resignations Cut ‘Too Close to the Bone’  —  The Trump administration's offer to let employees stay on paid leave before resigning at the end of September resulted in key federal workers leaving the governme…",
    "link": "https://www.memeorandum.com/250924/p117",
    "timestamp": "2025-09-24T20:45:00Z"
  },
  {
    "title": "How important is this year’s UNGA for world leaders and the UN?",
    "description": "Leaders meet at time of deepening divisions, war and attacks on UN.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/9/24/how-important-is-this-years-unga-for-world-leaders-and-the-un",
    "timestamp": "2025-09-24T20:44:16Z"
  },
  {
    "title": "'This is despicable!' Trump rages at 'deranged radical leftists' after Dallas shooting",
    "description": "President Donald Trump raged at \"deranged radical leftists\" in a new Truth Social post on Wednesday after a shooting at an immigration facility in Dallas left two detainees dead and another one injured. Earlier in the day, gunman Joshua Jahn opened fire at an…",
    "link": "https://www.rawstory.com/trump-2674030421/",
    "timestamp": "2025-09-24T20:44:11Z"
  },
  {
    "title": "UN Blames Trump Team for Escalator Mishap",
    "description": "The teleprompter also failed as Trump started his rambling 57-minute speech denouncing the U.N. for bungling global issues like mass migration and climate change.",
    "link": "https://littlethings.com/entertainment/un-blames-trump-team-for-escalator-mishap",
    "timestamp": "2025-09-24T20:43:54Z"
  },
  {
    "title": "AOC Joins Battle Against GOP Rigging US House Maps for Trump",
    "description": "Congresswoman Alexandria Ocasio-Cortez waded into the national fight over 2026 congressional maps on Tuesday, endorsing Democratic California Gov. Gavin Newsom's proposal to redraw his massive state's districts to counter GOP gerrymandering.\"California, you k…",
    "link": "https://www.commondreams.org/news/2026-election-map",
    "timestamp": "2025-09-24T20:42:25Z"
  },
  {
    "title": "China plans 7-10% greenhouse gas reduction by 2035, Xi tells UN",
    "description": "Alongside the emission-reduction goal, Xi said China plans to increase its installed capacity of wind and solar power to over six times their 2020 levels in 10 years and its share of non-fossil fuels in domestic energy consumption to over 30 percent by 2035.",
    "link": "https://www.channelnewsasia.com/asia/china-plans-7-10-greenhouse-gas-reduction-2035-xi-tells-un-5367456",
    "timestamp": "2025-09-24T20:39:31Z"
  },
  {
    "title": "Americans are more confident about this political party fixing nation's problems: poll",
    "description": "Republicans hold significant advantages over Democrats on key issues including an 18-point edge on immigration and 12-point lead on foreign conflicts, poll finds.",
    "link": "https://www.foxnews.com/politics/americans-are-more-confident-about-this-political-party-fixing-nations-problems-poll",
    "timestamp": "2025-09-24T20:39:03Z"
  },
  {
    "title": "How will the new $100,000 H1-B work visa application fee affect you? Tell us about it here | CNN Business",
    "description": "President Donald Trump’s surprise announcement that he would hike new H1-B application fees to $100,000 sparked fear and confusion among foreign workers. It also sent the companies who employ them scrambling, forcing the White House to clarify that the fee wo…",
    "link": "https://www.cnn.com/2025/09/24/tech/trump-h1b-fee-callout",
    "timestamp": "2025-09-24T20:37:50Z"
  },
  {
    "title": "Trump snubs Biden with autopen photo on new Presidential Walk of Fame",
    "description": "The snub amounts to the latest attempt by Trump to delegitimize a predecessor.",
    "link": "https://www.bostonherald.com/2025/09/24/trump-presidential-walk-of-fame/",
    "timestamp": "2025-09-24T20:37:05Z"
  },
  {
    "title": "WHO rejects Trump’s claims of link between painkiller use and autism",
    "description": "‘Extensive research’ has found no consistent association between Tylenol and condition, says agency",
    "link": "https://www.irishtimes.com/world/2025/09/24/who-rejects-trumps-claims-of-link-between-painkiller-use-and-autism/",
    "timestamp": "2025-09-24T20:35:50Z"
  },
  {
    "title": "Trump links autism to acetaminophen use during pregnancy: Your Tylenol questions answered",
    "description": "Following the Trump administration's announcement earlier this week on Tylenol being linked to autism, FOX 35 News Reporter Marie Edinger decided to closer look into the over-the-counter pain reliever. Here's what she found.",
    "link": "https://www.fox35orlando.com/news/trump-links-autism-acetaminophen-use-during-pregnancy-your-tylenol-questions-answered",
    "timestamp": "2025-09-24T20:34:26Z"
  },
  {
    "title": "Trump unleashes US military power on cartels. Is a wider war looming?",
    "description": "President Donald Trump has authorized military strikes against alleged Venezuelan drug vessels in the Caribbean, prompting congressional questions about legality.",
    "link": "https://www.foxnews.com/politics/trump-unleashes-us-military-power-cartels-wider-war-looming",
    "timestamp": "2025-09-24T20:34:22Z"
  },
  {
    "title": "‘Savage terrorist’: Pentagon to ask Trump to OK execution of convicted Fort Hood shooter",
    "description": "Army officer turned radical Islamist killed 13, now has lost final appeal",
    "link": "https://www.wnd.com/2025/09/savage-terrorist-pentagon-ask-trump-ok-execution-convicted/",
    "timestamp": "2025-09-24T20:34:19Z"
  },
  {
    "title": "Medvedev: \"Trump is casting spells; at the UN he has crossed the threshold of an alternate reality.\"",
    "description": "Deputy Chairman of the Russian Security Council, Dmitry Medvedev, posted an ironic message on Telegram in which he commented on the appearance of the US president Donald Trump at the United Nations General Assembly, accusing him of casting \"a series of politi…",
    "link": "https://freerepublic.com/focus/f-news/4342431/posts",
    "timestamp": "2025-09-24T20:33:38Z"
  },
  {
    "title": "Charlie Kirk's accused assassin stares down death penalty case with limited defense options",
    "description": "Defending Tyler Robinson in the Charlie Kirk murder case proves complex, requiring specialized attorneys and potentially costing Utah taxpayers over $500,000, experts say.",
    "link": "https://www.foxnews.com/us/charlie-kirk-accused-assassin-stares-down-death-penalty-case-limited-defense-options",
    "timestamp": "2025-09-24T20:32:23Z"
  },
  {
    "title": "Conservatives Are Melting Down Over a Tylenol TikTok Trend",
    "description": "Following Trump’s debunked claim that taking Tylenol during pregnancy causes autism, some pregnant women on TikTok are trolling him by taking acetaminophen.",
    "link": "http://www.thecut.com/article/conservatives-tylenol-tiktok-trend.html",
    "timestamp": "2025-09-24T20:32:14Z"
  },
  {
    "title": "VP Vance warns of dire consequences for Russia as Trump loses patience with Moscow",
    "description": "The Trump administration signaled a dramatic shift in its approach to the Ukraine conflict Wednesday, with Vice President JD Vance warning that President Donald Trump is \"growing incredibly impatient\" with Moscow after diplomatic efforts to end the war have f…",
    "link": "https://freerepublic.com/focus/f-chat/4342430/posts",
    "timestamp": "2025-09-24T20:31:56Z"
  },
  {
    "title": "Golden statue of Trump and Epstein is prematurely removed from National Mall",
    "description": "A statue of President Donald Trump holding hands with late convicted sex offender Jeffrey Epstein, which was unveiled Tuesday on the National Mall in Washington, D.C., was removed early Wednesday by U.S.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-epstein-statue-removed-national-mall-rcna233501",
    "timestamp": "2025-09-24T20:31:25Z"
  },
  {
    "title": "Here’s what brought Jimmy Kimmel’s mom to tears as he made viral ABC return: ‘Rough week for everybody’",
    "description": "Kimmel’s mom wiped her eyes ‘several times’ throughout the taping for Tuesday night’s episode",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/jimmy-kimmel-abc-monologue-mom-crying-b2833079.html",
    "timestamp": "2025-09-24T20:31:16Z"
  },
  {
    "title": "8 Times Democrats Demonized ICE Agents for Enforcing Federal Immigration Law",
    "description": "On Wednesday, as Breitbart News is reporting, a gunman opened fire on an Immigration and Customs Enforcement (ICE) facility in Dallas, Texas, leaving one migrant detainee dead and two others in critical condition.\nThe post 8 Times Democrats Demonized ICE Agen…",
    "link": "https://www.breitbart.com/politics/2025/09/24/8-times-democrats-demonized-ice-agents-for-enforcing-federal-immigration-law/",
    "timestamp": "2025-09-24T20:30:47Z"
  },
  {
    "title": "Trump's workforce purge batters DC's job market and leads to rise in homes for sale, report finds",
    "description": "A new report finds the Department of Government Efficiency’s remaking of the federal workforce has battered the Washington job market and put more households in the metropolitan area in financial distress.",
    "link": "https://www.news4jax.com/business/2025/09/24/trumps-workforce-purge-batters-dcs-job-market-and-leads-to-rise-in-homes-for-sale-report-finds/",
    "timestamp": "2025-09-24T20:30:39Z"
  },
  {
    "title": "Statue of Trump, Epstein holding hands taken down by National Park Service",
    "description": "A protest art statue of Trump and Jeffrey Epstein holding hands was removed from the National Mall. Organizers say the park service did not warn them.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/24/trump-epstein-statue-removed/86329248007/",
    "timestamp": "2025-09-24T20:29:32Z"
  },
  {
    "title": "Google is very sorry for pulling down COVID misinfo and pledges never to use outside fact-checkers",
    "description": "It's all Biden's fault, Chocolate Factory claims Google has taken a page out of Mark Zuckerberg's playbook, telling House Republicans that the Biden administration pressured it to push down COVID-19 content that didn't violate its rules, and pledging its comm…",
    "link": "https://www.theregister.com/2025/09/24/google_reinstates_covid_misinfo_spreaders/",
    "timestamp": "2025-09-24T20:29:14Z"
  },
  {
    "title": "Newsom silent on anti-ICE rhetoric after Dallas shooting, despite urging nonviolence",
    "description": "California Governor Gavin Newsom condemned the Dallas ICE facility shooting that killed two detainees after being questioned about his anti-ICE rhetoric.",
    "link": "https://www.foxnews.com/politics/newsom-silent-anti-ice-rhetoric-after-dallas-shooting-despite-urging-nonviolence",
    "timestamp": "2025-09-24T20:29:11Z"
  }
]