[
  {
    "title": "Hegseth says National Guard members shot in DC ambush by Afghan national will receive Purple Heart",
    "description": "Secretary of War Pete Hegseth announced Purple Heart recognition for two West Virginia National Guard members, one killed and another recovering.",
    "link": "https://www.foxnews.com/politics/hegseth-says-national-guard-members-shot-dc-ambush-afghan-national-receive-purple-heart",
    "timestamp": "2026-02-07T04:00:40Z"
  },
  {
    "title": "Appeals court greenlights Trump admin policy of detaining undocumented immigrants without opportunity to seek release | CNN Politics",
    "description": "A divided federal appeals court on Friday ruled in favor of the Trump administration’s policy of detaining millions of undocumented immigrants, even those who have been living in the US for decades, without the opportunity to challenge their detention, handin…",
    "link": "https://www.cnn.com/2026/02/06/politics/appeals-court-trump-immigration-detention-policy",
    "timestamp": "2026-02-07T03:56:57Z"
  },
  {
    "title": "Trump calls U.S. and Iran talks in Oman 'very good' and says there will be another meeting",
    "description": "President Donald Trump said Friday that the high-stakes talks between Iran and the United States in Oman had gone well and that the two sides would meet again next week, though he did not provide any details about the meeting \"They had a very good meeting wit…",
    "link": "https://www.nbcnews.com/world/iran/trump-calls-us-iran-talks-oman-good-says-will-another-meeting-rcna257857",
    "timestamp": "2026-02-07T03:44:41Z"
  },
  {
    "title": "India did better than most other nations to have logical process rather than succumb to chaos: Former US Assistant Secretary of Commerce",
    "description": "India has navigated a bilateral trade agreement framework with the US more logically than many nations, according to former US Assistant Secretary of Commerce Raymond Vickery. He noted that while the US President favors rapid announcements, India's approach a…",
    "link": "https://economictimes.indiatimes.com/news/india/india-did-better-than-most-other-nations-to-have-logical-process-rather-than-succumb-to-chaos-former-us-assistant-secretary-of-commerce/articleshow/128018747.cms",
    "timestamp": "2026-02-07T03:41:06Z"
  },
  {
    "title": "‘TRUMP DID NOTHING WRONG!’ CNN’s Abby Phillip Rattles off MAGA Influencers Defending Trump’s Racist Obama Post",
    "description": "Not everyone is condemning President Donald Trump for posting a video depicting former President Barack Obama and Michelle Obama as apes. \nThe post ‘TRUMP DID NOTHING WRONG!’ CNN’s Abby Phillip Rattles off MAGA Influencers Defending Trump’s Racist Obama Post …",
    "link": "https://www.mediaite.com/media/tv/trump-did-nothing-wrong-cnns-abby-phillip-rattles-off-maga-influencers-defending-trumps-racist-obama-post/",
    "timestamp": "2026-02-07T03:39:47Z"
  },
  {
    "title": "Could It Be That the 2020 Election Fraud Will Be Exposed?",
    "description": "The Left is beginning to panic about Tulsi Gabbard's investigation into the massive election fraud in 2020. They have good reason to. For the first time since then, I actually have hope that the fraud will be exposed for all to see. I would say that the evide…",
    "link": "https://freerepublic.com/focus/f-news/4365782/posts",
    "timestamp": "2026-02-07T03:39:46Z"
  },
  {
    "title": "India, US agree on interim trade pact framework with 18% tariff on India",
    "description": "India and the United States have agreed on a framework for an interim trade pact that will cut tariffs on Indian-origin goods to 18% from 50% and pave the way for a comprehensive Bilateral Trade Agreement covering goods, services, supply chains and digital tr…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-deal-india-us-agree-on-interim-trade-pact-framework-with-18-tariff-on-india/articleshow/128018658.cms",
    "timestamp": "2026-02-07T03:37:10Z"
  },
  {
    "title": "Trump Refuses to Apologize Over Obamas-as-Apes Post: ‘I Didn’t Make a Mistake’ | Video",
    "description": "In the same press session, the president attacked another female reporter, claiming she had \"a very bad attitude\"\nThe post Trump Refuses to Apologize Over Obamas-as-Apes Post: ‘I Didn’t Make a Mistake’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-no-apology-obamas-apes-post/",
    "timestamp": "2026-02-07T03:31:50Z"
  },
  {
    "title": "From drugs to aircraft parts, what India gets under the $500 billion US trade deal",
    "description": "India and the US have agreed on an interim trade framework, improving Indian market access for pharmaceuticals, gems, diamonds, and aircraft parts. This reciprocal agreement aims for balanced trade, resilient supply chains, and sets the stage for a broader Bi…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/from-drugs-to-aircraft-parts-what-india-gets-under-the-500-billion-us-trade-deal/articleshow/128018423.cms",
    "timestamp": "2026-02-07T03:29:21Z"
  },
  {
    "title": "Drive Racists Out of Public Life Forever, And Other Lessons From Black History",
    "description": "On a frigid Thursday afternoon in late January, in a now-viral video, employees at Philadelphia’s Independence National Historical Park were captured removing interpretive signs about slavery posted at the President’s House Site— where George Washington and J…",
    "link": "https://www.motherjones.com/politics/2026/02/brian-jones-black-history-month-everyone/",
    "timestamp": "2026-02-07T03:25:38Z"
  },
  {
    "title": "‘Leave It To The Leftist Media’: Leavitt Says Press Hopes Obama Monkey Video Will Distract Public",
    "description": "Karoline Leavitt accused the left-leaning media outlets on Friday of fixating on a deleted social media meme.",
    "link": "https://dailycaller.com/2026/02/06/leftist-media-leavitt-press-hopes-obama-monkey-video-distract-public/",
    "timestamp": "2026-02-07T03:25:24Z"
  },
  {
    "title": "Trump administration re-approves twice-banned pesticide",
    "description": "The Trump administration re-approved the use of the controversial dicamba pesticide for GMO crops, sparking backlash from environmental and health groups.\n\nRead More: https://punchng.com/trump-administration-re-approves-twice-banned-pesticide/",
    "link": "https://punchng.com/trump-administration-re-approves-twice-banned-pesticide/",
    "timestamp": "2026-02-07T03:19:00Z"
  },
  {
    "title": "No evidence to support US claim China conducted nuclear blast test: Monitor",
    "description": "US wants Beijing to join a revised nuclear weapons treaty after expiration of a previous accord between US and Russia.",
    "link": "https://www.aljazeera.com/news/2026/2/7/no-evidence-to-support-us-claim-china-conducted-nuclear-blast-test-monitor",
    "timestamp": "2026-02-07T03:14:09Z"
  },
  {
    "title": "India-US trade pact to expand market access for American farmers, producers: USTR",
    "description": "The United States Trade Representative (USTR) said the India-US interim trade agreement will expand access for American farmers and producers to one of the world’s largest markets. It said India has committed to eliminating or lowering tariffs on all US indus…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-pact-to-expand-market-access-for-american-farmers-producers-ustr/articleshow/128018177.cms",
    "timestamp": "2026-02-07T03:13:52Z"
  },
  {
    "title": "Addressing non-tariff barriers to tech cooperation, BTA focuses on facilitating trade: Piyush Goyal",
    "description": "India and the United States have signed a significant trade deal. This agreement will ease market access and reduce trade barriers. Cooperation in advanced technologies, including GPUs, will expand. Indian exporters will benefit from reduced tariffs. The deal…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/addressing-non-tariff-barriers-to-tech-cooperation-bta-focuses-on-facilitating-trade-piyush-goyal/articleshow/128018127.cms",
    "timestamp": "2026-02-07T03:12:33Z"
  },
  {
    "title": "Immigrant students in Minneapolis turn to remote learning",
    "description": "Fearing deportation raids, immigrant families in Minneapolis are turning to immigrant remote learning, keeping children home in a self-imposed lockdown.\n\nRead More: https://punchng.com/immigrant-students-in-minneapolis-turn-to-remote-learning/",
    "link": "https://punchng.com/immigrant-students-in-minneapolis-turn-to-remote-learning/",
    "timestamp": "2026-02-07T03:09:55Z"
  },
  {
    "title": "Canada and France opening new consulates in Greenland's capital amid Trump pressure",
    "description": "Canada and France are opening new consulates in Greenland's capital following the Trump administration's push to acquire the Danish territory through tariff threats.",
    "link": "https://www.foxnews.com/world/canada-france-opening-new-consulates-greenlands-capital-trump-pressure",
    "timestamp": "2026-02-07T03:06:35Z"
  },
  {
    "title": "Cuba adopts measures to confront energy crisis",
    "description": "To deal with fuel shortages, Cuba has announced plans to ration fuel and protect essential services. The government has blamed Washington for the crisis. The Cuban government on Friday announced a series of emergency measures as the island prepares for severe…",
    "link": "https://www.dw.com/en/cuba-fuel-shortages/a-75852484",
    "timestamp": "2026-02-07T03:06:00Z"
  },
  {
    "title": "Modi hails interim trade framework with US as big win for jobs, MSMEs and startups; Thanks Trump for 'personal commitment'",
    "description": "India-US interim trade deal: India and the United States have agreed on a framework for an interim trade agreement. This development strengthens economic and strategic ties between New Delhi and Washington. Prime Minister Narendra Modi stated the agreement re…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/modi-hails-interim-trade-framework-with-us-as-big-win-for-jobs-msmes-and-startups-thanks-trump-for-personal-commitment/articleshow/128017796.cms",
    "timestamp": "2026-02-07T03:01:54Z"
  },
  {
    "title": "Trump Insists He 'Didn't Make a Mistake,' Doesn't Need to Apologize After Posting Racist Video of the Obamas",
    "description": "Donald Trump doesn’t feel like he needs to apologize after posting a racist video depicting the Obamas as apes, On Thursday (February 5), the 79-year-old president posted a video on his Truth Social platform, which featured claims about voter fraud. At the en…",
    "link": "https://www.justjared.com/2026/02/06/trump-didnt-make-mistake-doesnt-need-to-apologize-after-racist-obama-vide/",
    "timestamp": "2026-02-07T03:01:07Z"
  },
  {
    "title": "Has the Bitcoin market priced in Kevin Warsh’s nomination?",
    "description": "President Trump’s Fed pick helped rate-cut bets, but Bitcoin remains cautious.",
    "link": "https://ambcrypto.com/has-the-bitcoin-market-priced-in-kevin-warshs-nomination/",
    "timestamp": "2026-02-07T03:00:02Z"
  },
  {
    "title": "Three-Time Trump Voter Apologizes After Racist Obama Post",
    "description": "Donald Trump’s disgusting, racist post depicting former President and First Lady Barack and Michelle Obama as apes has generated such backlash that even Trump lickspittle Sen. Tim Scott has publicly called him out over it.\nIt seemed to be the final straw for …",
    "link": "https://crooksandliars.com/2026/02/three-time-trump-voter-apologizes-after",
    "timestamp": "2026-02-07T03:00:01Z"
  },
  {
    "title": "‘Please remember!' Trump begs blue state for credit after claiming ‘BIG WIN'",
    "description": "President Donald Trump used a lengthy Truth Social post on Friday to claim credit for a new commercial fishing proclamation – while issuing a plea to Maine and New England voters to remember him as the November midterms approach.“Another BIG WIN for Maine, an…",
    "link": "https://www.rawstory.com/trump-2675107672/",
    "timestamp": "2026-02-07T02:59:55Z"
  },
  {
    "title": "Trump \"Didn't Make a Mistake\" with Racist Michelle & Barack Obama Post",
    "description": "Leave it to Donald Trump to find a way to make everything about him in the worst way possible. Overnight on Thursday, Trump was dropping a steaming pile of rants when he went back to his favorite topic: how the U.S. elections have been unfair to him. While do…",
    "link": "https://bleedingcool.com/tv/trump-didnt-make-a-mistake-with-racist-michelle-barack-obama-post/",
    "timestamp": "2026-02-07T02:58:08Z"
  },
  {
    "title": "'New vistas opened up to promote Make in India': EAM S Jaishankar hails India-US interim trade agreement",
    "description": "India-US trade deal: External Affairs Minister S. Jaishankar welcomed the India-US interim trade agreement framework, saying it will expand market access for Indian exporters and support the Make in India initiative. He said, \"The framework for an Interim Agr…",
    "link": "https://economictimes.indiatimes.com/news/india/india-us-trade-deal-new-vistas-opened-up-to-promote-make-in-india-eam-s-jaishankar-hails-india-us-interim-trade-agreement/articleshow/128017753.cms",
    "timestamp": "2026-02-07T02:55:47Z"
  },
  {
    "title": "India gets duty free access to US aircraft, aircraft parts under BTA",
    "description": "India-US trade deal: India will get tariff-free access to certain aircraft and aircraft parts from the US under the framework for an interim bilateral trade agreement announced by both countries, according to a joint statement. India will also receive a prefe…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-deal-india-gets-duty-free-access-to-us-aircraft-aircraft-parts-under-bta/articleshow/128017563.cms",
    "timestamp": "2026-02-07T02:48:20Z"
  },
  {
    "title": "India-US trade deal Live: Joint statement on trade agreement released; tariff on India reduced to 18%, $500 billion US goods to be bought",
    "description": "India-US trade deal Live Updates: Days after US President Donald Trump and Prime Minister Narendra Modi announced the much-awaited India-US trade dea",
    "link": "https://timesofindia.indiatimes.com/business/india-business/india-us-trade-deal-live-updates-joint-statement-agreement-donald-trump-tariffs-pm-narendra-modi-russian-oil-agriculture/liveblog/128017555.cms",
    "timestamp": "2026-02-07T02:48:12Z"
  },
  {
    "title": "CENTCOM: U.S. Abraham Lincoln carrier group sails in Arabian Sea",
    "description": "RECAP: After 'Very Good' Talks, Trump Says Iran 'Badly Wants Deal,' Next Round Set for Early Next Week. After 'Very Good' Talks, Trump Says He Believes Iran 'Badly Wants Deal,' Next Round Set for Early Next Week. Trump Issues Executive Order Threatening Tarif…",
    "link": "https://www.haaretz.com/israel-news/2026-02-07/ty-article-live/.premium/centcom-u-s-abraham-lincoln-carrier-group-sails-in-arabian-sea/0000019c-35de-d6dd-a3bc-75ff880b0000",
    "timestamp": "2026-02-07T02:44:23Z"
  },
  {
    "title": "'Committed to negotiating broader US-India BTA': FM Nirmala Sitharaman hails trade deal",
    "description": "India-US trade deal: Union Finance Minister Nirmala Sitharaman welcomed the India-US interim trade deal and reaffirmed commitment to stronger bilateral ties. Sharing the joint statement on X, she said, \"India-US issue a joint statement: announces 'a framework…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-trade-deal-committed-to-negotiating-broader-us-india-bta-fm-nirmala-sitharaman-hails-trade-deal/articleshow/128017423.cms",
    "timestamp": "2026-02-07T02:42:54Z"
  },
  {
    "title": "The human rights cause Hollywood celebrities won’t say a word about",
    "description": "Hollywood celebrities couldn’t wait to condemn Immigration and Customs Enforcement (ICE) from the stage at the Grammys last weekend. But the self-declared “human rights activists” and “social justice warriors” didn’t utter a word of support or concern for tho…",
    "link": "https://nypost.com/2026/02/06/opinion/the-human-rights-issue-hollywood-celebrities-ignore/",
    "timestamp": "2026-02-07T02:41:41Z"
  },
  {
    "title": "Breaking News Live: Modi says India-US interim trade pact to create jobs and strengthen supply chains",
    "description": "India and the United States have agreed on a framework for an interim trade agreement, marking another step forward in strengthening economic and strategic ties between the two countries. Prime Minister Narendra Modi described the development as a reflection …",
    "link": "https://m.economictimes.com/news/newsblogs/breaking-news-february-7-india-us-trade-deal-trump-tariffs-modi-rahul-gandhi-weather-today-iran-bangladesh-icc-t20-world-cup-india-vs-pakistan-islamabad-blast/liveblog/128017291.cms",
    "timestamp": "2026-02-07T02:36:23Z"
  },
  {
    "title": "Jasmine Crockett: Republicans Will Vote for Me in General Election",
    "description": "Friday on MS NOW's \"The Weeknight,\" Rep. Jasmine Crockett (D-TX) argued Republicans would vote for her in the general election for U.S. Senate.\nThe post Jasmine Crockett: Republicans Will Vote for Me in General Election appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2026/02/06/jasmine-crockett-republicans-will-vote-for-me-in-general-election/",
    "timestamp": "2026-02-07T02:36:18Z"
  },
  {
    "title": "Crockett: 'Real Patriotism Means to Push Back Against' Trump's Immigration Policies",
    "description": "Friday on MS NOW's \"The Weeknight,\" Rep. Jasmine Crockett (D-TX) said \"real patriotism means to push back against\" President Donald Trump's immigration policies.\nThe post Crockett: ‘Real Patriotism Means to Push Back Against’ Trump’s Immigration Policies appe…",
    "link": "https://www.breitbart.com/clips/2026/02/06/crockett-real-patriotism-means-to-push-back-against-trumps-immigration-policies/",
    "timestamp": "2026-02-07T02:33:56Z"
  },
  {
    "title": "Fact Sheet: President Donald J. Trump Addresses Threats to the United States by the Government of Iran - The White House (.gov)",
    "description": "Fact Sheet: President Donald J. Trump Addresses Threats to the United States by the Government of IranThe White House (.gov) Trump signs executive order threatening tariffs for countries trading with IranBBC Trump imposes tariffs on countries that import from…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180751082",
    "timestamp": "2026-02-07T02:33:00Z"
  },
  {
    "title": "Trump Is Hosting Governors at the White House, but Only Republicans - The New York Times",
    "description": "Trump Is Hosting Governors at the White House, but Only RepublicansThe New York Times Democratic governors disinvited from traditionally bipartisan White House gatheringscnn.com White House excluding Dems from its annual governors meetingPolitico U.S. media r…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180751080",
    "timestamp": "2026-02-07T02:32:50Z"
  },
  {
    "title": "In governor's race, Rodriguez proposes state-run health insurance option; says police should honor ICE detainers",
    "description": "MILWAUKEE (CBS 58) -- The state of the race to be Wisconsin's next governor is a tale of two completely different primary races. Seven Democrats are vying to be the party's nominee as they push to keep",
    "link": "https://cbs58.com/news/in-governors-race-rodriguez-proposes-state-run-health-insurance-option-says-police-should-honor-ice-detainers",
    "timestamp": "2026-02-07T02:32:12Z"
  },
  {
    "title": "John Phelan, Trump's Navy secretary, listed in Epstein flight logs (Dan Lamothe/Washington Post)",
    "description": "Dan Lamothe / Washington Post:\nJohn Phelan, Trump's Navy secretary, listed in Epstein flight logs  —  The documents indicate that Phelan was a passenger on Epstein's Boeing 727 for two transatlantic flights in 2006.  —  John Phelan, the billionaire art collec…",
    "link": "https://www.memeorandum.com/260206/p146",
    "timestamp": "2026-02-07T02:15:01Z"
  },
  {
    "title": "Trump lashes out at critics, warns networks against booking his former aides",
    "description": "President Donald Trump slammed former aides Ty Cobb and Miles Taylor as “two dopes” and warned CNN and MS NOW not to book them, claiming they know “nothing” about him. Trump attacked Cobb, a former member of his legal team, and Taylor, a former Homeland Secur…",
    "link": "https://www.rawstory.com/ty-cobb-2675106831/",
    "timestamp": "2026-02-07T02:15:01Z"
  },
  {
    "title": "'Are you for real?' GOP senator under fire for response to Trump taking down racist post",
    "description": "Sen. Bill Cassidy (R-LA) found himself on the receiving end of even more derision on Friday night over his comments on a racist video shared by President Donald Trump.The 79-year-old president shared a video created by the conservative Patriot News Outlet tha…",
    "link": "https://www.rawstory.com/bill-cassidy-2675107612/",
    "timestamp": "2026-02-07T02:12:10Z"
  },
  {
    "title": "Pentagon says it's cutting ties with 'woke' Harvard, discontinuing military training, fellowships",
    "description": "The Pentagon says it will cut ties with Harvard University, ending military training, fellowships and certificate programs",
    "link": "https://abcnews.go.com/US/wireStory/pentagon-cutting-ties-woke-harvard-discontinuing-military-training-129939290",
    "timestamp": "2026-02-07T02:05:48Z"
  },
  {
    "title": "US announces new Iran oil sanctions moments after concluding talks",
    "description": "The United States on Friday announced new sanctions to curb Iran's oil exports, including targeting 14 vessels, moments after the adversaries wrapped up a day of indirect talks in Oman. The State Department said it would order a block of any transactions with…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-announces-new-iran-oil-sanctions-moments-after-concluding-talks/articleshow/128016551.cms",
    "timestamp": "2026-02-07T02:04:26Z"
  },
  {
    "title": "Trump ally blasts Republican's $3M Super Bowl 'gimmick' as massive waste of money",
    "description": "A Republican strategist dismissed Republican efforts to politicize Sunday’s Super Bowl as a waste of money, ripping a $3 million ad as \"a gimmick.\"The moment unfolded on Friday on CNN’s “The Lead” when host Jake Tapper highlighted a $3 million Super Bowl ad b…",
    "link": "https://www.rawstory.com/super-bowl/",
    "timestamp": "2026-02-07T02:02:54Z"
  },
  {
    "title": "‘I didn’t make a mistake’: Trump responds to racist video he posted of the Obamas | CNN Politics",
    "description": "President Donald Trump refused to apologize Friday after posting and then deleting a racist video depicting former President Barack Obama and former first lady Michelle Obama as apes in a jungle, insisting he hadn’t seen the final frames containing the offens…",
    "link": "https://www.cnn.com/2026/02/06/politics/video/trump-obama-racist-video-af1-ebof-digvid",
    "timestamp": "2026-02-07T02:00:36Z"
  },
  {
    "title": "Appeals Court Greenlights Trump Anti-DEI Executive Orders",
    "description": "4th Circuit Court of Appeals rejects and vacates nationwide injunction issued by Maryland federal district court judge.\nThe post Appeals Court Greenlights Trump Anti-DEI Executive Orders first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/02/appeals-court-greenlights-trump-anti-dei-executive-orders/",
    "timestamp": "2026-02-07T02:00:01Z"
  },
  {
    "title": "Trump Declares ‘I Am the Least Racist President’ in ‘A Long Time’ Amid Racist Post Uproar",
    "description": "During a Friday gaggle with the press aboard Air Force One en route to Mar-a-Lago, President Donald Trump declared that he is “the least racist president you’ve had in a long time,” amid uproar from both sides of the aisle after he posted a video to Truth Soc…",
    "link": "https://www.mediaite.com/media/news/trump-declares-i-am-the-least-racist-president-in-a-long-time-amid-racist-post-uproar/",
    "timestamp": "2026-02-07T01:59:27Z"
  },
  {
    "title": "Trump Refuses to Apologize for Racist Meme About Obamas: “I Didn’t Make a Mistake”",
    "description": "Donald Trump addressed reporters after a racist meme targeting Barack and Michelle Obama appeared on his Truth Social account, claiming it was posted by a staffer and dismissing calls to apologize.",
    "link": "https://consequence.net/2026/02/trump-addresses-obamas-meme/",
    "timestamp": "2026-02-07T01:59:10Z"
  },
  {
    "title": "A rare backdown from Trump shows even the 'Teflon president' has limits",
    "description": "Donald Trump has, until now, thrived in controversy. But the US president has now done something which a year ago would have been unthinkable… deleted a social media post.",
    "link": "https://www.abc.net.au/news/2026-02-07/donald-trump-backdown-over-racist-obama-post-analysis/106317296",
    "timestamp": "2026-02-07T01:52:17Z"
  },
  {
    "title": "Exclusive-US plans initial payment towards billions owed to UN-envoy Waltz",
    "description": "WASHINGTON, Feb 6 (Reuters) - The United States will make an initial payment ‌towards the billions of dollars it owes to the United Nations in a matter of weeks, the U.S. ambassador to the world body told Reuters on Friday, while ‌stressing the need for the U…",
    "link": "https://www.thestar.com.my/news/world/2026/02/07/exclusive-us-plans-initial-payment-towards-billions-owed-to-un-envoy-waltz",
    "timestamp": "2026-02-07T01:52:00Z"
  },
  {
    "title": "Judge orders Trump administration to unfreeze more than $16 billion for NY tunnel project | CNN Politics",
    "description": "A federal judge in New York ruled Friday that the Trump administration must unfreeze more than $16 billion earmarked for a major New York infrastructure project and allow construction to continue, saying that public interest would be “harmed by a delay.”",
    "link": "https://www.cnn.com/2026/02/06/politics/judge-orders-trump-unfreeze-ny-infrastructure-funds",
    "timestamp": "2026-02-07T01:49:44Z"
  },
  {
    "title": "Report: Gregory Bovino 'Asked to Leave' Las Vegas Bar",
    "description": "Former Border Patrol Commander Gregory K. Bovino was reportedly \"asked to leave\" a bar in Las Vegas, Nevada, according to a recent report.\nThe post Report: Gregory Bovino ‘Asked to Leave’ Las Vegas Bar appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/06/report-gregory-bovino-asked-to-leave-las-vegas-bar/",
    "timestamp": "2026-02-07T01:49:05Z"
  },
  {
    "title": "Bad Bunny’s key symbols to watch for in his Super Bowl halftime show",
    "description": "The Puerto Rican singer will surprise audiences with a performance that will be a landmark moment for Latino culture",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/bad-bunny-super-bowl-half-time-symbols-b2915784.html",
    "timestamp": "2026-02-07T01:48:59Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,444",
    "description": "These are the key developments from day 1,444 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2026/2/7/russia-ukraine-war-list-of-key-events-day-1444",
    "timestamp": "2026-02-07T01:47:40Z"
  },
  {
    "title": "Trump administration re-approves twice-banned dicamba pesticide",
    "description": "US President Donald Trump's administration on Friday re-approved the use of pesticide dicamba for spraying on top of genetically-modified cotton and soybean crops, drawing swift backlash from environment groups and the Make America Healthy Again movement. \"Th…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-administration-re-approves-twice-banned-dicamba-pesticide/articleshow/128016154.cms",
    "timestamp": "2026-02-07T01:43:55Z"
  },
  {
    "title": "Dow surges above 50,000 for the first time as US stocks regain mojo",
    "description": "The Dow surged above 50,000 points for the first time Friday, shrugging off worries connected to artificial intelligence companies while traders focused on the prospects for US growth and Federal Reserve interest rate cuts. Earlier milestones for the Dow incl…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-surges-above-50000-for-first-time-as-us-stocks-regain-mojo/articleshow/128016084.cms",
    "timestamp": "2026-02-07T01:40:21Z"
  },
  {
    "title": "Trump Claims It Was Chuck Schumer’s Idea to Put President’s Name on Penn Station: ‘He Suggested That To Me’",
    "description": "President Donald Trump claimed that, actually, Sen. Minority Leader Chuck Schumer came up with the idea to name Penn Station after the president.\nThe post Trump Claims It Was Chuck Schumer’s Idea to Put President’s Name on Penn Station: ‘He Suggested That To …",
    "link": "https://www.mediaite.com/politics/trump/trump-claims-it-was-chuck-schumers-idea-to-put-presidents-name-on-penn-station-he-suggested-that-to-me/",
    "timestamp": "2026-02-07T01:36:46Z"
  },
  {
    "title": "Desperate Trump is 'slinging hate' to cover up an even bigger scandal: Dem star",
    "description": "Rep. Jasmine Crockett (D-TX) shredded President Donald Trump on MS NOW Friday evening, in response to his racist social media post of a conspiracy theory video that depicted former President Barack Obama and his wife Michelle as monkeys while jungle music fro…",
    "link": "https://www.rawstory.com/jasmine-crockett-2675107517/",
    "timestamp": "2026-02-07T01:34:05Z"
  },
  {
    "title": "Exclusive-US plans initial payment towards billions owed to UN-envoy Waltz",
    "description": "WASHINGTON, Feb 6 (Reuters) - The United States will make an initial payment towards the billions of dollars it owes to the United Nations in a matter of weeks, the U.S. … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/07/exclusive-us-plans-initial-payment-towards-billions-owed-to-un-envoy-waltz",
    "timestamp": "2026-02-07T01:33:12Z"
  },
  {
    "title": "India, US reach framework for interim trade agreement; US cuts tariffs on Indian goods to 18%",
    "description": "India and the US announce interim trade deal, cutting tariffs to 18%, boosting $500 billion in purchases and expanding technology and digital trade cooperation.",
    "link": "https://www.thehindubusinessline.com/news/india-us-interim-trade-agreement-us-cuts-tariffs/article70602692.ece",
    "timestamp": "2026-02-07T01:28:29Z"
  },
  {
    "title": "US lifts 25% tariff on Indian goods linked to Russia oil purchases",
    "description": "US President Trump has lifted a 25% tariff on Indian goods, fulfilling a trade deal contingent on India ceasing Russian oil imports. The agreement also includes a reduction in reciprocal levies and India's commitment to purchase $500 billion in US energy and …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-lifts-25-tariff-on-indian-goods-linked-to-russia-oil-purchases/articleshow/128015846.cms",
    "timestamp": "2026-02-07T01:27:49Z"
  },
  {
    "title": "Judge rules in favor of New York and New Jersey for now in $16B tunnel fight with Trump",
    "description": "A federal judge ruled Friday to temporarily block the Trump administration from suspending federal disbursements for the Gateway Tunnel Project.",
    "link": "https://www.nbcnews.com/politics/trump-administration/judge-rules-favor-new-york-new-jersey-now-16b-tunnel-fight-trump-rcna257865",
    "timestamp": "2026-02-07T01:25:13Z"
  },
  {
    "title": "Trump could turn 2028 Olympics into a MAGA spectacle, analyst warns",
    "description": "Donald Trump may stage a MAGA-themed extravaganza for the final year of his presidency, Slate columnist Justin Peters suggests, using the 2028 Los Angeles Olympics as a global showcase. Peters predicts Trump could transform the games into a “tacky MAGA horror…",
    "link": "https://www.rawstory.com/maga-2675106710/",
    "timestamp": "2026-02-07T01:25:01Z"
  },
  {
    "title": "Trump administration won’t let student deported to Honduras return",
    "description": "By Nate RaymondBOSTON, Feb 6 (Reuters) - President Donald Trump’s administration on Friday called a judge’s proposal that the government issue a student visa to a college… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/07/trump-administration-won-t-let-student-deported-to-honduras-return",
    "timestamp": "2026-02-07T01:23:09Z"
  },
  {
    "title": "Nigerian leaders respected abroad, bullied at home — Remi Tinubu",
    "description": "First Lady Remi Tinubu says Nigerian leaders are honored abroad but often bullied by citizens at home due to hate-driven political narratives.\n\nRead More: https://punchng.com/nigerian-leaders-respected-abroad-bullied-at-home-remi-tinubu/",
    "link": "https://punchng.com/nigerian-leaders-respected-abroad-bullied-at-home-remi-tinubu/",
    "timestamp": "2026-02-07T01:21:22Z"
  },
  {
    "title": "Iran and US hold indirect talks in Oman. America's military leader in the Mideast joins the talks",
    "description": "Iran and the United States held indirect talks in Oman on Friday to explore a framework for negotiations on Tehran’s nuclear programme, with discussions seen as returning to an initial stage. The U.S. delegation included Central Command chief Adm. Brad Cooper…",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-and-us-hold-indirect-talks-in-oman-americas-military-leader-in-the-mideast-joins-the-talks/articleshow/128015636.cms",
    "timestamp": "2026-02-07T01:16:49Z"
  },
  {
    "title": "JD Vance Loudly Booed On The World Stage During 2026 Winter Olympics Opening Ceremony",
    "description": "When JD Vance and his wife were shown on the stadium's Jumbotron, a loud chorus of boos rang out as Vance and his wife smiled through the moment while waving miniature American flags.",
    "link": "https://hiphopwired.com/3033917/jd-vance-booed-winter-olympics-video-reactions/",
    "timestamp": "2026-02-07T01:16:17Z"
  },
  {
    "title": "India-US trade pact momentum builds with interim framework, full agreement likely by next month",
    "description": "In a joint statement, Washington and New Delhi said the framework confirmed their commitment to negotiating a full trade pact.",
    "link": "https://indianexpress.com/article/world/us-news/us-and-india-unveil-interim-trade-framework-move-closer-to-broad-pact-10518371/",
    "timestamp": "2026-02-07T01:16:06Z"
  },
  {
    "title": "Trump says he didn't see Obama clip in video before it was posted",
    "description": "US President Donald Trump said he did not watch the full video clip that showed former President Barack Obama and Michelle Obama as apes before it was posted on his social media account and said he does not believe he made a mistake. He told reporters aboard …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-he-didnt-see-obama-clip-in-video-before-it-was-posted/articleshow/128015420.cms",
    "timestamp": "2026-02-07T01:05:24Z"
  },
  {
    "title": "‘How Did This Happen?’ Laura Ingraham Confronts Karoline Leavitt on Trump’s Racist Obama Post",
    "description": "Fox's Laura Ingraham confronted White House Press Secretary Karoline Leavitt over a racist AI-generated video that was posted by President Donald Trump's Truth Social account.\nThe post ‘How Did This Happen?’ Laura Ingraham Confronts Karoline Leavitt on Trump’…",
    "link": "https://www.mediaite.com/media/tv/how-did-this-happen-laura-ingraham-confronts-karoline-leavitt-on-trumps-racist-obama-post/",
    "timestamp": "2026-02-07T01:04:48Z"
  },
  {
    "title": "Trump says good talks ongoing on Ukraine",
    "description": "By Kanishka SinghWASHINGTON, Feb 6 (Reuters) - U.S. President Donald Trump said on Friday “very good talks” were ongoing regarding Russia’s war in Ukraine and he added, w… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/07/trump-says-good-talks-ongoing-on-ukraine",
    "timestamp": "2026-02-07T01:03:40Z"
  },
  {
    "title": "Joy Reid says GOP using Nicki Minaj as a 'house pet' to put 'blackface' on MAGA",
    "description": "MSNBC host Joy Reid accused the GOP of using rapper Nicki Minaj for \"cultural cool\" and needing Black people to give MAGA movement credibility in controversial segment.",
    "link": "https://www.foxnews.com/media/joy-reid-says-gop-using-nikki-minaj-house-pet-put-blackface-maga",
    "timestamp": "2026-02-07T01:00:46Z"
  },
  {
    "title": "The Venezuela Oil Mirage: How Washington Mistook Tar for Black Gold",
    "description": "When we referred to the Donald’s cockamamie invasion of Venezuela, that’s exactly what we meant. Washington’s War on Cocaine is already unnecessarily killing 20,000 Americans per year via adulterated cocaine and thousands more in the course of moving contraba…",
    "link": "https://www.activistpost.com/the-venezuela-oil-mirage-how-washington-mistook-tar-for-black-gold/",
    "timestamp": "2026-02-07T01:00:00Z"
  },
  {
    "title": "MAGA Erupts as Mike Pence’s Think Tank Delays Justice for East Palestine",
    "description": "Mike Pence is siding with wealthy donors over victims of the East Palestine, Ohio, rail disaster, earning a cacophony of outrage from conservatives and prominent MAGA voices.\nThe post MAGA Erupts as Mike Pence’s Think Tank Delays Justice for East Palestine ap…",
    "link": "https://www.breitbart.com/politics/2026/02/06/maga-erupts-as-mike-pences-think-tank-delays-justice-for-east-palestine/",
    "timestamp": "2026-02-07T00:57:12Z"
  },
  {
    "title": "US pressuring Ukraine to hold elections soon – Reuters",
    "description": "The US is pushing Ukraine to hold national election as Vladimir Zelensky’s presidential term expired in 2024 Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632137-us-ukraine-hold-election/",
    "timestamp": "2026-02-07T00:55:54Z"
  },
  {
    "title": "Pentagon says it's cutting ties with 'woke' Harvard, discontinuing military training, fellowships",
    "description": "The Pentagon said Friday it is cutting ties with Harvard University, ending all military training, fellowships and certificate programs with the Ivy League...",
    "link": "https://www.yahoo.com/news/articles/pentagon-says-cutting-ties-woke-005515459.html",
    "timestamp": "2026-02-07T00:55:15Z"
  },
  {
    "title": "Trump Refuses To Apologize for Racist AI Video of the Obamas: ‘I Didn’t Make a Mistake’",
    "description": "During a Friday gaggle with the press aboard Air Force One en route to Mar-a-Lago, President Donald Trump refused to apologize for a racist AI-generated video depicting the Obamas as apes that was posted to his Truth Social account on Thursday, telling a repo…",
    "link": "https://www.mediaite.com/media/news/trump-refuses-to-apologize-for-racist-ai-video-of-the-obamas-i-didnt-make-a-mistake/",
    "timestamp": "2026-02-07T00:55:03Z"
  },
  {
    "title": "Government must reach agreement on right to counsel for people at Minnesota ICE facility, judge says",
    "description": "Attorneys for the federal government have until next Thursday to reach an agreement with human rights lawyers who are seeking to ensure the right to counsel for people detained at an Immigration and Customs Enforcement facility in Minnesota, a judge said Frid…",
    "link": "https://japantoday.com/category/world/government-must-reach-agreement-on-right-to-counsel-for-people-at-minnesota-ice-facility-judge-says",
    "timestamp": "2026-02-07T00:54:41Z"
  },
  {
    "title": "Vista Equity Partners and Intel to lead investment in AI chip startup SambaNova: Report",
    "description": "Private equity firm ⁠Vista Equity Partners is leading a new funding round of over $350 million in artificial intelligence chip startup SambaNova Systems, marking a rare departure from its traditional focus on enterprise software.",
    "link": "https://economictimes.indiatimes.com/tech/funding/vista-equity-partners-and-intel-to-lead-investment-in-ai-chip-startup-sambanova-report/articleshow/128015119.cms",
    "timestamp": "2026-02-07T00:52:47Z"
  },
  {
    "title": "US and India reach framework for interim trade agreement: White House",
    "description": "The US and India unveil a framework for an interim trade agreement, cutting tariffs to 18 percent and boosting market access and supply chain cooperation.",
    "link": "https://www.thehindubusinessline.com/news/us-and-india-reach-framework-for-interim-trade-agreement-white-house/article70602691.ece",
    "timestamp": "2026-02-07T00:51:57Z"
  },
  {
    "title": "Trump wanted to drop JFK from Kennedy Center, advisers stopped him",
    "description": "President Donald Trump reportedly wanted to rename the Kennedy Center simply the “Trump Center,” but advisers convinced him to settle on the compromise “Donald J. Trump and John F. Kennedy Center,” his biographer Michael Wolff claimed. Trump has reshaped the …",
    "link": "https://www.rawstory.com/trump-kennedy-center-2675106621/",
    "timestamp": "2026-02-07T00:48:02Z"
  },
  {
    "title": "US, India unveil interim trade deal framework",
    "description": "The deal eases months of tensions between Washington and New Delhi over India's purchases of Russian oil. An additional 25% levy imposed as punishment was also shelved. The United States and India on Friday released the framework for an interim trade agreemen…",
    "link": "https://www.dw.com/en/us-india-unveil-interim-trade-deal-framework/a-75852428",
    "timestamp": "2026-02-07T00:41:00Z"
  },
  {
    "title": "Japan's first female prime minister counts on popularity to help party win election",
    "description": "Japan’s Prime Minister Sanae Takaichi is seeking to leverage her popularity to help her party win Sunday’s snap election as she pushes her right-wing agenda to boost her country's economy and military capabilities in the face growing tensions with Chin...",
    "link": "https://abcnews.go.com/International/wireStory/japans-female-prime-minister-counts-popularity-party-win-129937880",
    "timestamp": "2026-02-07T00:36:00Z"
  },
  {
    "title": "Gregg Jarrett Explains Why Forcing ICE Agents To Get Judicial Warrants Would Effectively End Deportations",
    "description": "Fox News legal analyst Gregg Jarrett warned Friday that Democrats' proposal to restrict Immigration and Customs Enforcement would grind deportations to a halt.",
    "link": "https://dailycaller.com/2026/02/06/gregg-jarrett-forcing-ice-agents-judicial-warrants-end-deportations/",
    "timestamp": "2026-02-07T00:22:54Z"
  },
  {
    "title": "Exclusive–Karoline Leavitt: TrumpRx Will Save Millions of Americans Thousands of Dollars",
    "description": "White House press secretary Karoline Leavitt told The Alex Marlow Show in an exclusive interview on Friday that TrumpRx.com, which offers massive discounts on prescription drugs, is set to save millions of Americans thousands of dollars.\nThe post Exclusive–Ka…",
    "link": "https://www.breitbart.com/politics/2026/02/06/exclusive-karoline-leavitt-trumprx-will-save-millions-of-americans-thousands-of-dollars/",
    "timestamp": "2026-02-07T00:21:52Z"
  },
  {
    "title": "EU has 'serious doubts' about Trump's 'Board of Peace'",
    "description": "Brussels, Belgium (AFP) Jan 23, 2026 -\n European leaders have serious doubts about the scope of President Donald Trump's \"Board of Peace\" but are ready to work with the United States and the newly founded body in Gaza, EU chief Antonio Costa said Friday.\n\n\"We…",
    "link": "https://www.spacewar.com/reports/EU_has_serious_doubts_about_Trumps_Board_of_Peace_999.html",
    "timestamp": "2026-02-07T00:19:43Z"
  },
  {
    "title": "Cuba defends military drills as deterrent against US aggression",
    "description": "Havana (AFP) Jan 25, 2026 -\n Cuban President Miguel Diaz-Canel defended his country's military preparedness exercises on Saturday as a deterrent against potential aggression from the United States.\n\nUS President Donald Trump this month warned that Cuba \"is re…",
    "link": "https://www.spacewar.com/reports/Cuba_defends_military_drills_as_deterrent_against_US_aggression_999.html",
    "timestamp": "2026-02-07T00:19:43Z"
  },
  {
    "title": "China's Xi urges 'central role' of UN in call with Brazil's Lula",
    "description": "Beijing (AFP) Jan 23, 2026 -\n\n Chinese President Xi Jinping called on countries to protect the \"central role\" of the United Nations in international affairs, urging his Brazilian counterpart on Friday to help safeguard international norms, state media reporte…",
    "link": "https://www.spacewar.com/reports/Chinas_Xi_urges_central_role_of_UN_in_call_with_Brazils_Lula_999.html",
    "timestamp": "2026-02-07T00:19:35Z"
  },
  {
    "title": "EU opens probe into Musk's Grok over sexual AI deepfakes",
    "description": "Brussels, Belgium (AFP) Jan 26, 2026 -\n The EU on Monday hit Elon Musk's X with an investigation over AI chatbot Grok's generation of sexualised deepfake images of women and minors, in the latest step of an international backlash against the tool.\n\nGrok faces…",
    "link": "https://www.spacewar.com/reports/EU_opens_probe_into_Musks_Grok_over_sexual_AI_deepfakes_999.html",
    "timestamp": "2026-02-07T00:18:47Z"
  },
  {
    "title": "Level playing field? Tech at forefront of US immigration fight",
    "description": "Minneapolis, United States Feb 2, 2026 -\n\n Technology has become a key battleground in the confrontation between US authorities and migrants along with their supporters, with both sides innovating to try to gain the upper hand.\n\nIt is a David versus Goliath f…",
    "link": "https://www.spacewar.com/reports/Level_playing_field_Tech_at_forefront_of_US_immigration_fight_999.html",
    "timestamp": "2026-02-07T00:18:47Z"
  },
  {
    "title": "I Will Never Fly out of a “Trump International Airport”",
    "description": "The president is trying to bargain with Democrats by asking for their support in naming things after him.",
    "link": "https://www.esquire.com/news-politics/politics/a70273860/trump-airport-penn-station-chuck-schumer/",
    "timestamp": "2026-02-07T00:17:00Z"
  },
  {
    "title": "Blood in the Water",
    "description": "“Subversion works by importing an inverted moral frame and getting the target population to install it as its own conscience.” — Yuri Bezmenov’s Ghost on X Even in the deep-frozen fastness of midwinter, events and tensions surge, and America awaits . . . Bad …",
    "link": "https://freerepublic.com/focus/f-news/4365758/posts",
    "timestamp": "2026-02-07T00:16:57Z"
  },
  {
    "title": "Trump scolded after unusual change at annual governors meeting",
    "description": "President Donald Trump is taking a massive departure from tradition by only inviting Republicans to the annual National Governors Association meeting — an event that by tradition is bipartisan.According to Politico, staffers for governors' offices were alerte…",
    "link": "https://www.rawstory.com/trump-governors/",
    "timestamp": "2026-02-07T00:16:47Z"
  },
  {
    "title": "Dutch tech giant ASML posts bumper profits, eyes bright AI future",
    "description": "The Hague (AFP) Jan 28, 2026 -\n\n Dutch tech giant ASML, which sells cutting-edge machines to make semiconductor chips, reported a significant gain in annual net profit Wednesday and predicted a bright future driven by demand for artificial intelligence.\n\nASML…",
    "link": "https://www.spacedaily.com/reports/Dutch_tech_giant_ASML_posts_bumper_profits_eyes_bright_AI_future_999.html",
    "timestamp": "2026-02-07T00:16:15Z"
  },
  {
    "title": "Nvidia boss hopeful of China allowing chip sales",
    "description": "Taipei (AFP) Jan 29, 2026 -\n\n Nvidia chief executive Jensen Huang expressed optimism Thursday that Beijing will permit the sale to Chinese buyers of a powerful AI chip model made by the US tech giant.\n\nHuang's remarks came a day after the Wall Street Journal …",
    "link": "https://www.spacedaily.com/reports/Nvidia_boss_hopeful_of_China_allowing_chip_sales_999.html",
    "timestamp": "2026-02-07T00:16:15Z"
  }
]