[
  {
    "title": "Jimmy Kimmel's wife calls it a 'fragile time for freedom' after husband's brief suspension",
    "description": "Television writer Molly McNearney said that it's a \"fragile time for freedom\" in the U.S. after her husband Jimmy Kimmel had his show suspended in September.",
    "link": "https://www.foxnews.com/media/jimmy-kimmels-wife-calls-fragile-time-freedom-after-husbands-brief-suspension",
    "timestamp": "2025-12-04T23:29:35Z"
  },
  {
    "title": "Intervenes To Force Payments To Planned Parenthood",
    "description": "Intervenes To Force Payments To Planned Parenthood\n \nAuthored by Jonathan Turley,\nDistrict Court Judge Indira Talwani in Boston has been one of the most active judges in the country in seeking to enjoin the orders of President Donald Trump, including her orde…",
    "link": "https://biztoc.com/x/e92dcb3076418f5f",
    "timestamp": "2025-12-04T23:29:08Z"
  },
  {
    "title": "Appeals court allows Trump National Guard deployment in DC to continue",
    "description": "A United States appeals court on Thursday (Dec 4) handed a victory to President Donald Trump in his effort to keep National Guard troops in Washington, pausing a lower court order that would have ended the de",
    "link": "https://www.channelnewsasia.com/world/us-trump-national-guard-deployment-dc-continue-5558846",
    "timestamp": "2025-12-04T23:29:00Z"
  },
  {
    "title": "Trump’s war crimes scandal, briefly explained",
    "description": "Donald Trump speaks as Defense Secretary Pete Hegseth looks on during a Cabinet meeting at the White House on December 2, 2025. | Chip Somodevilla/Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump…",
    "link": "https://biztoc.com/x/68c1b5496b8560c5",
    "timestamp": "2025-12-04T23:28:58Z"
  },
  {
    "title": "Hochul now open to hiking biz taxes after bullying from left — but she blames Trump",
    "description": "Hochul has drawn a line in the sand on not hiking personal income taxes in order to come up with billions of dollars to fund Mamdani’s major proposals like universal child care and free buses, but she’s considering dinging New Yorkers elsewhere by possibly hi…",
    "link": "https://nypost.com/2025/12/04/us-news/hochul-now-open-to-hiking-biz-taxes-after-bullying-from-left-but-she-blames-trump/",
    "timestamp": "2025-12-04T23:28:40Z"
  },
  {
    "title": "Supreme Court sides with Texas in challenge to congressional map deemed discriminatory",
    "description": "The Supreme Court sided with Texas over civil rights groups in an emergency challenge to the Donald Trump-backed congressional map that aimed to benefit Republicans ahead of the 2026 midterm elections. \nThe court’s three Democratic appointees dissented from t…",
    "link": "https://biztoc.com/x/d0e1ffb8c175a1ba",
    "timestamp": "2025-12-04T23:28:35Z"
  },
  {
    "title": "Democrats’ Venezuela hypocrisy ignores reality — ‘war powers’ rules are dead",
    "description": "Partisans on both sides only pretend to care about war powers when it’s convenient.",
    "link": "https://nypost.com/2025/12/04/opinion/dems-venezuela-hypocrisy-ignores-truth-war-powers-rules-are-dead/",
    "timestamp": "2025-12-04T23:27:02Z"
  },
  {
    "title": "Trump Wants to Trade Fuel Economy for Cheaper Cars. But It Might Not Work",
    "description": "By rolling back auto industry fuel efficiency goals, US president Donald Trump hopes to make new cars cheaper. But prices won't drop for years, and consumers will spend more on gas in the meantime.",
    "link": "https://www.wired.com/story/trump-fuel-economy-standards-rollback-might-not-work/",
    "timestamp": "2025-12-04T23:25:52Z"
  },
  {
    "title": "Election Drama Heats Up in Honduras",
    "description": "The country is the latest target of Trump’s partisan interventions.",
    "link": "http://foreignpolicy.com/2025/12/04/honduras-election-asfura-trump-hernandez-pardon/",
    "timestamp": "2025-12-04T23:23:23Z"
  },
  {
    "title": "Newly sworn-in defence minister declares war on kidnappers",
    "description": "Nigeria’s new Defence Minister, Gen Christopher Musa, vows to end insecurity, declaring war on kidnappers to restore safety to homes, farms, and schools.\n\nRead More: https://punchng.com/newly-sworn-in-defence-minister-declares-war-on-kidnappers/",
    "link": "https://punchng.com/newly-sworn-in-defence-minister-declares-war-on-kidnappers/",
    "timestamp": "2025-12-04T23:23:05Z"
  },
  {
    "title": "'Cult Alert': Marco Rubio Skewered For Fawning Comments On Trump",
    "description": "The Secretary of State was ridiculed for claiming the man who changed the name of the Department of Defense to \"Department of War\" would be remembered as \"the President of Peace.\"",
    "link": "https://www.huffpost.com/entry/marco-rubio-mocked-fawning-over-donald-trump_n_6932025ee4b03cea5ab36173",
    "timestamp": "2025-12-04T23:21:51Z"
  },
  {
    "title": "‘This is shameful’: Tim Walz whines about people driving by his house and calling him retarded",
    "description": "President Trump had used slur in relation to governor's inability to stop Somali fraud scam",
    "link": "https://www.wnd.com/2025/12/this-is-shameful-tim-walz-whines-about-people/",
    "timestamp": "2025-12-04T23:21:46Z"
  },
  {
    "title": "The Bob Cesca Podcast: Tricksy Hobbitses",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Tricksy Hobbitses -- They apparently arrested a suspect in the Jan 6 pipe bomb investigation. The results of the TN-7 special election are great news for Democrats – but don't get happy. ADP's…",
    "link": "https://littlegreenfootballs.com/article/55112_The_Bob_Cesca_Podcast-_Tricksy",
    "timestamp": "2025-12-04T23:21:37Z"
  },
  {
    "title": "Fox News Anchor Drops Disastrous Polling Numbers On Trump’s Top Economic Aide",
    "description": "Kevin Hassett was forced to contend with some tough economic numbers on Fox News as more Americans blame Donald Trump for the affordability crisis.\nThe post Fox News Anchor Drops Disastrous Polling Numbers On Trump’s Top Economic Aide first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/fox-news-anchor-drops-disastrous-polling-numbers-on-trumps-top-economic-aide/",
    "timestamp": "2025-12-04T23:19:21Z"
  },
  {
    "title": "Pete Hegseth’s Bad Week",
    "description": "The defense secretary is under scrutiny for a series of questionable decisions.",
    "link": "http://foreignpolicy.com/2025/12/04/hegseth-signalgate-venezuela-boat-strikes-congress/",
    "timestamp": "2025-12-04T23:17:50Z"
  },
  {
    "title": "Nearly 40% of young Americans say political violence can be justified in certain situations",
    "description": "Harvard poll of young Americans shows 39% see political violence as acceptable in certain situations with wider concerns shaping their views.",
    "link": "https://www.foxnews.com/media/nearly-40-young-americans-say-political-violence-can-justified-certain-situations",
    "timestamp": "2025-12-04T23:17:47Z"
  },
  {
    "title": "Donald Trump Gets Big Supreme Court Win Over Texas Redistricting Map",
    "description": "The Supreme Court on Thursday cleared the way for Texas to use its new congressional map in the 2026 elections, siding with state Republicans and President Donald Trump despite a lower-court finding that the plan likely discriminates on the basis of race. The…",
    "link": "https://biztoc.com/x/ba496e41c63c7ff2",
    "timestamp": "2025-12-04T23:17:46Z"
  },
  {
    "title": "Trump’s war crimes scandal, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: The Trump administration is facing renewed scrutiny ov…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/471313/donald-trump-pete-hegseth-caribbean-boat-strike-war-crime",
    "timestamp": "2025-12-04T23:16:38Z"
  },
  {
    "title": "Grand Jury Says It Won’t Indict Letitia James",
    "description": "A federal grand jury refused Thursday to reindict New York Attorney General Letitia James.",
    "link": "https://dailycaller.com/2025/12/04/grand-jury-says-it-wont-indict-letitia-james/",
    "timestamp": "2025-12-04T23:16:11Z"
  },
  {
    "title": "Presidents of Rwanda, DRC Thank Trump for Brokering Historic Peace Deal",
    "description": "The president of the Republic of Rwanda, Paul Kagame, and the president of the Democratic Republic of the Congo, Felix Tshisekedi, thanked President Donald Trump and his administration Thursday for brokering a historic peace deal between their nations.\nThe po…",
    "link": "https://www.breitbart.com/africa/2025/12/04/presidents-of-rwanda-drc-thank-trump-for-brokering-historic-peace-deal/",
    "timestamp": "2025-12-04T23:15:55Z"
  },
  {
    "title": "Biden commerce secretary to join Costco board as company sues over Trump's tariffs",
    "description": "Costco Wholesale has nominated President Joe Biden's Commerce Secretary, Gina Raimondo, to its board of directors.",
    "link": "https://www.nbcnews.com/business/corporations/gina-raimondo-costco-trump-tariffs-rcna247473",
    "timestamp": "2025-12-04T23:14:28Z"
  },
  {
    "title": "Trump DOJ Adding 'Second Amendment Rights Section' to Civil Rights Division",
    "description": "President Donald Trump's Department of Justice (DOJ) is adding a \"Second Amendment Rights Section\" to its Civil Rights Division.\nThe post Trump DOJ Adding ‘Second Amendment Rights Section’ to Civil Rights Division appeared first on Breitbart.",
    "link": "https://www.breitbart.com/2nd-amendment/2025/12/04/trump-doj-adding-second-amendment-rights-section-to-civil-rights-divisiontrump-doj-adding-second-amendment-rights-section-to-civil-rights-division/",
    "timestamp": "2025-12-04T23:13:40Z"
  },
  {
    "title": "Supreme Court allows Texas to use a congressional map favorable to Republicans in 2026",
    "description": "The Texas congressional map was engineered to give Republicans five additional House seats.",
    "link": "https://www.denverpost.com/2025/12/04/redistricting-texas-supreme-court/",
    "timestamp": "2025-12-04T23:11:09Z"
  },
  {
    "title": "Supreme Court allows Texas to use a congressional map favorable to Republicans in 2026",
    "description": "The Texas congressional map was engineered to give Republicans five additional House seats.",
    "link": "https://www.bostonherald.com/2025/12/04/redistricting-texas-supreme-court/",
    "timestamp": "2025-12-04T23:11:09Z"
  },
  {
    "title": "Supreme Court Allows Texas To Move Forward With Trump-Backed Gerrymander",
    "description": "The Texas congressional map enacted last summer at Trump’s urging was engineered to give Republicans five additional House seats.",
    "link": "https://www.huffpost.com/entry/supreme-court-texas-redistricting_n_6932142ee4b03cea5ab37091",
    "timestamp": "2025-12-04T23:10:07Z"
  },
  {
    "title": "'I've got you man': Australian billionaire's special access for VIP gambler",
    "description": "Leaked messages between an Australian multi-billionaire and his former associate reveal the inner workings of the online casino Stake.",
    "link": "https://www.abc.net.au/news/2025-12-05/ed-craven-vip-gamblers-club-stake-messages/106028000",
    "timestamp": "2025-12-04T23:09:41Z"
  },
  {
    "title": "Omar allies tied to massive Minnesota COVID meal fraud scheme involving Somali community",
    "description": "Investigators say Rep. Ilhan's Omar associates have benefited from Minnesota’s massive COVID children's meal fraud scheme that was recently uncovered.",
    "link": "https://www.foxnews.com/politics/omar-allies-tied-massive-minnesota-covid-meal-fraud-scheme-involving-somali-community",
    "timestamp": "2025-12-04T23:07:27Z"
  },
  {
    "title": "Fox News Host Corrects Trump Official During Live Interview",
    "description": "A Fox News host corrected President Donald Trump’s economic advisor Kevin Hassett in a live interview on Thursday.\nWhen Hassett said wage growth was higher than inflation now, Fox host Martha McCallum corrected him, saying, “inflation is at 2.9 percent.”\n“Rea…",
    "link": "https://biztoc.com/x/26d240a019c7a497",
    "timestamp": "2025-12-04T23:06:41Z"
  },
  {
    "title": "Former Maronite priest still presenting himself as a cleric, Denver Archdiocese warns",
    "description": "Andre Mahanna, a former Maronite Catholic priest. / Credit: “EWTN News Nightly”/Screenshot\n\nSt. Louis, Missouri, Dec 4, 2025 / 18:06 pm (CNA).\nAndre Mahanna, a former Maronite Catholic priest who gained a national profile as a commentator, fundraiser, and adv…",
    "link": "https://www.catholicnewsagency.com/news/268277/prominent-former-maronite-priest-still-presenting-himself-as-a-cleric-denver-archdiocese-warns",
    "timestamp": "2025-12-04T23:06:00Z"
  },
  {
    "title": "Trump Hints MAGA Crowd Is Stupid as He Declares 'Smart People Don't Like Me' in Embarrassing Video... as Support for Prez Dwindles",
    "description": "Donald Trump seemingly dissed his own supporters while speaking at his private New Jersey golf club.",
    "link": "https://radaronline.com/p/donald-trump-shades-maga-voters-admits-smart-people-dont-like-me/",
    "timestamp": "2025-12-04T23:05:00Z"
  },
  {
    "title": "Supreme Court allows Texas to use new congressional district map drawn to favor Republicans",
    "description": "WASHINGTON — The Supreme Court on Thursday allowed Texas to use a new congressional district map in next year's midterm election that was drawn to maximize Republican political power",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-texas-use-new-congressional-district-map-drawn-fa-rcna244696",
    "timestamp": "2025-12-04T23:04:44Z"
  },
  {
    "title": "Trump gives his own White House ballroom architect the boot after clashes: report",
    "description": "President Donald Trump fired his own ballroom architect after clashing with an architect over expanding the project. The boutique architecture firm led by James McCrery II was reportedly replaced after three months when questions surfaced over whether the gro…",
    "link": "https://www.rawstory.com/trump-ballroom-2674371128/",
    "timestamp": "2025-12-04T23:03:17Z"
  },
  {
    "title": "Supreme Court allows Texas to use Trump-backed congressional map in midterms | CNN Politics",
    "description": "The Supreme Court on Thursday allowed Texas to use a congressional map that will boost President Donald Trump’s effort to keep Republicans in control of Congress, blocking a lower court decision that found the new boundaries were likely unconstitutional becau…",
    "link": "https://www.cnn.com/2025/12/04/politics/supreme-court-allows-texas-to-use-trump-backed-congressional-map-in-midterms",
    "timestamp": "2025-12-04T22:59:55Z"
  },
  {
    "title": "Minneapolis Mayor Jacob Frey Has Taken Steps to Fight Back Against Trump’s Inhumane Immigration Crackdown",
    "description": "Local resistance seems to be the only viable way to stop the maniacal administration.",
    "link": "https://www.esquire.com/news-politics/politics/a69636979/bucks-county-minneapolis-jacob-frey-trump-ice/",
    "timestamp": "2025-12-04T22:56:00Z"
  },
  {
    "title": "Costco adds Biden Commerce Sec. Gina Raimondo to board on heels of Trump tariff lawsuit",
    "description": "The Supreme Court is set to soon determine if President Donald Trump had the power to unilaterally impose tariffs that Costco now is seeking to claw back.",
    "link": "https://biztoc.com/x/0ab1dd86acf6ec89",
    "timestamp": "2025-12-04T22:54:52Z"
  },
  {
    "title": "New Car Prices Hit $49,766 in October. Rolling Back Fuel Economy Regulations Could Bring Relief.",
    "description": "The Trump administration reducing strict fuel mandates could lower compliance costs and slow the rise in car prices.",
    "link": "https://reason.com/2025/12/04/new-car-prices-hit-49766-in-october-rolling-back-fuel-economy-regulations-could-bring-relief/",
    "timestamp": "2025-12-04T22:54:06Z"
  },
  {
    "title": "Drug Use Is A Civil Problem",
    "description": "The United States has a drug problem. Provisional data (as of May 14, 2025) from the CDC’s National Center for Health Statistics indicate there were an estimated 80,391 drug overdose deaths in the United States during 2024—a decrease of 26.9% from the 110,037…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/drug-use-is-a-civil-problem",
    "timestamp": "2025-12-04T22:53:33Z"
  },
  {
    "title": "Examining Trump’s Pardon of Former Honduran President Convicted of Trafficking Drugs to U.S.",
    "description": "President Donald Trump pardoned Juan Orlando Hernández, the former president of Honduras, on Dec. 1, claiming without evidence that his prosecution had been a \"setup\" by the Biden administration and that Hernández was targeted because he was president of a co…",
    "link": "https://www.factcheck.org/2025/12/examining-trumps-pardon-of-former-honduran-president-convicted-of-trafficking-drugs-to-u-s/",
    "timestamp": "2025-12-04T22:50:51Z"
  },
  {
    "title": "Appeals court allows Trump National Guard deployment in DC to continue (Reuters)",
    "description": "Reuters:\nAppeals court allows Trump National Guard deployment in DC to continue  —  A U.S. appeals court on Thursday handed a victory to President Donald Trump in his effort to keep National Guard troops in Washington, pausing a lower court order that would h…",
    "link": "https://www.memeorandum.com/251204/p107",
    "timestamp": "2025-12-04T22:50:01Z"
  },
  {
    "title": "Costco adds Biden Commerce Sec. Gina Raimondo to board on heels of Trump tariff lawsuit",
    "description": "The Supreme Court is set to soon determine if President Donald Trump had the power to unilaterally impose tariffs that Costco now is seeking to claw back.",
    "link": "https://www.cnbc.com/2025/12/04/costco-board-gina-raimondo-biden-commerce-trump-tariffs.html",
    "timestamp": "2025-12-04T22:49:39Z"
  },
  {
    "title": "DOJ fails to reindict top Trump foe — for now",
    "description": "A federal grand jury in Norfolk, Virginia, on Thursday refused to return an indictment for New York Attorney General Letitia James, marking yet another setback for President Donald Trump's Justice Department in its bid to prosecute her.However, reported MS NO…",
    "link": "https://www.rawstory.com/letitia-james-2674371162/",
    "timestamp": "2025-12-04T22:48:23Z"
  },
  {
    "title": "A supersized World Cup field begins taking shape at Friday’s draw",
    "description": "In a new twist, the top four teams in the rankings will avoid each other until the semifinals.",
    "link": "https://www.bostonherald.com/2025/12/04/world-cup-draw-preview/",
    "timestamp": "2025-12-04T22:47:07Z"
  },
  {
    "title": "Boat strike briefings help Hegseth - but shipwreck video release may hurt",
    "description": "Republicans and Democrats agreed he didn't order killing everyone on an alleged drug boat. That's where the consensus ended.",
    "link": "https://www.bbc.com/news/articles/c62dg3x8931o",
    "timestamp": "2025-12-04T22:47:01Z"
  },
  {
    "title": "Trump is weaponizing food stamps again — for a terrible new cause",
    "description": "President Donald Trump tried to withhold Supplemental Nutrition Assistance Program benefits, still often called food stamps, from tens of millions of Americans to force Democrats to cave during this fall’s government shutdown. Now he’s once more threatening t…",
    "link": "https://biztoc.com/x/676ba7acba0cdaac",
    "timestamp": "2025-12-04T22:43:34Z"
  },
  {
    "title": "Court Temporarily Lifts Order Blocking Trump’s D.C. National Guard Deployment",
    "description": "The one-page order said the ruling will stay in place as the U.S. Court of Appeals for the D.C. Circuit considers the administration's appeal.\nThe post Court Temporarily Lifts Order Blocking Trump’s D.C. National Guard Deployment first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/12/court-temporarily-lifts-order-blocking-trumps-d-c-national-guard-deployment/",
    "timestamp": "2025-12-04T22:43:26Z"
  },
  {
    "title": "New Politico Poll Shows Americans, Even GOP Voters, Are Blaming Trump For The Affordability Crisis",
    "description": "A new poll shows Republicans and Democrats alike are blaming President Donald Trump for the high cost of living that shows no signs of ending.\nThe post New Politico Poll Shows Americans, Even GOP Voters, Are Blaming Trump For The Affordability Crisis first ap…",
    "link": "https://www.mediaite.com/media/news/new-politico-poll-shows-americans-even-gop-voters-are-blaming-trump-for-the-affordability-crisis/",
    "timestamp": "2025-12-04T22:42:54Z"
  },
  {
    "title": "Stress of Houthi combat was a key factor in series of costly Navy mishaps, investigations show",
    "description": "The four preventable mishaps cost the Navy over $100 million in three lost aircraft.",
    "link": "https://www.bostonherald.com/2025/12/04/us-navy-investigations/",
    "timestamp": "2025-12-04T22:41:59Z"
  },
  {
    "title": "Grand jury declines to indict N.Y. Attorney General Letitia James, less than two weeks after the first case was dismissed",
    "description": "The Justice Department on Thursday failed to secure an indictment against New York Attorney General Letitia James, a person familiar with the matter told NBC News",
    "link": "https://www.nbcnews.com/politics/justice-department/grand-jury-declines-indict-ny-attorney-general-letitia-james-less-two-rcna247310",
    "timestamp": "2025-12-04T22:40:57Z"
  },
  {
    "title": "'Intolerable': Trump roundly rebuked for 'racist and inflammatory' remarks",
    "description": "President Donald Trump is being roundly condemned for making bigoted attacks on Somalis, whom he referred to collectively as “garbage” earlier this week.During a Tuesday Cabinet meeting at the White House, Trump unleashed a racist tirade against Somali Americ…",
    "link": "https://www.rawstory.com/trump-somolia/",
    "timestamp": "2025-12-04T22:40:55Z"
  },
  {
    "title": "Trump Delegates Pardon Power to Subordinates",
    "description": "“When Donald Trump issued a sweeping pardon for allies in his bid to subvert the 2020 election, he stretched the boundaries of the pardon power in unprecedented ways,” Politico reports. “The pardon’s language is so vague and limitless that it could apply to t…",
    "link": "https://politicalwire.com/2025/12/04/trump-delegates-pardon-power-to-subordinates/",
    "timestamp": "2025-12-04T22:38:44Z"
  },
  {
    "title": "What we know about the suspect in January 2021 D.C. pipe bomb case, DOJ says",
    "description": "Brian Cole Jr., 30, was arrested and charged in connection to explosives left near DNC and RNC headquarters in Washington, D.C., the day before Jan. 6.",
    "link": "https://www.nbcnews.com/news/us-news/brian-cole-jr-pipe-bomb-suspect-arrest-washington-dc-what-know-rcna247442",
    "timestamp": "2025-12-04T22:38:43Z"
  },
  {
    "title": "Mamdani and Trump Getting Chummy Is America's 'Horseshoe Theory' Nightmare",
    "description": "When the so-called \"communist lunatic\" and the so-called \"fascist\" find common ground, it means the country needs an intervention.",
    "link": "https://reason.com/2025/12/05/a-trump-mamdani-alliance-is-americas-horseshoe-theory-nightmare/",
    "timestamp": "2025-12-04T22:38:34Z"
  },
  {
    "title": "Speaker Johnson's ever-growing headaches: From the Politics Desk",
    "description": "Republicans are increasingly seeking to work around Speaker Mike Johnson, R-La., in the narrowly divided House.",
    "link": "https://www.nbcnews.com/politics/politics-news/speaker-johnsons-ever-growing-headaches-politics-desk-rcna247470",
    "timestamp": "2025-12-04T22:37:35Z"
  },
  {
    "title": "Appeals Court Grants Administrative Stay to Keep National Guard in D.C.",
    "description": "An Appeals court has ruled that President Donald Trump can continue deploying the National Guard in Washington, D.C. The Washington D.C. Court of Appeals order is an administrative stay, not a ruling on the merits, according to the Dec. 4 order. “Ordered that…",
    "link": "https://freerepublic.com/focus/f-news/4355963/posts",
    "timestamp": "2025-12-04T22:34:04Z"
  },
  {
    "title": "DHS, cyber industry mobilize to get CISA director nominee confirmed",
    "description": "“It’s a national security risk to not have him,” said a current U.S. official.",
    "link": "https://www.nextgov.com/people/2025/12/dhs-cyber-industry-mobilize-get-cisa-director-nominee-confirmed/409951/",
    "timestamp": "2025-12-04T22:33:06Z"
  },
  {
    "title": "Admiral Tells Congress He Had a Good Reason for Ordering Second Strike on Drug Boat",
    "description": "Admiral Frank Bradley told members of Congress during a Thursday briefing that the second strike on a drug smuggler's boat was justified.",
    "link": "https://www.westernjournal.com/admiral-tells-congress-good-reason-ordering-second-strike-drug-boat/",
    "timestamp": "2025-12-04T22:32:47Z"
  },
  {
    "title": "Speaker Johnson pleads with Republicans to keep concerns private after tumultuous week",
    "description": "Rank-and-file Republicans in the House are increasingly going public with anger towards their leadership",
    "link": "https://abcnews.go.com/Politics/wireStory/speaker-johnson-pleads-republicans-concerns-private-after-tumultuous-128123709",
    "timestamp": "2025-12-04T22:30:10Z"
  },
  {
    "title": "US: Processing Freeze Scapegoats Immigrants, Asylum Seekers",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n President Donald Trump speaks during a Cabinet meeting at the White House, Tuesday, Dec. 2, 2025, in Washington, as Secretary of State Marco Rubio, left, and Defense Secretary Pete Hegseth, right, look on. \n © 2025 A…",
    "link": "https://www.hrw.org/news/2025/12/04/us-processing-freeze-scapegoats-immigrants-asylum-seekers",
    "timestamp": "2025-12-04T22:30:00Z"
  },
  {
    "title": "Republicans Drop Trump-Ordered Block On State AI Laws From Defense Bill",
    "description": "A Donald Trump-backed push has failed to wedge a federal measure that would block states from passing AI laws for a decade into the National Defense Authorization Act (NDAA). House Majority Leader Steve Scalise (R-La.) told reporters Tuesday that a sect of Re…",
    "link": "https://slashdot.org/submission/17342947/republicans-drop-trump-ordered-block-on-state-ai-laws-from-defense-bill",
    "timestamp": "2025-12-04T22:26:02Z"
  },
  {
    "title": "Speaker Johnson pleads with Republicans to keep concerns private after tumultuous week",
    "description": "House Speaker Mike Johnson is imploring his fellow Republicans to stop venting their frustrations in public and bring their complaints to him directly...",
    "link": "https://www.yahoo.com/news/articles/speaker-johnson-pleads-republicans-keep-222507637.html",
    "timestamp": "2025-12-04T22:25:07Z"
  },
  {
    "title": "Pete Hegseth’s Weak Excuses",
    "description": "His evasive responses to Signalgate are shameful nonsense.",
    "link": "https://www.theatlantic.com/ideas/2025/12/pete-hegseth-signalgate-unqualified/685145/",
    "timestamp": "2025-12-04T22:24:09Z"
  },
  {
    "title": "These Democrat Narratives Are a Lame Excuse for an Agenda",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post These Democrat Narratives Are a Lame Excuse for an Agenda appeared firs…",
    "link": "https://www.dailysignal.com/2025/12/04/these-democrat-narratives-are-a-lame-excuse-for-an-agenda/",
    "timestamp": "2025-12-04T22:23:39Z"
  },
  {
    "title": "Lawn Order Open Thread: Look, Over There! An Anarchist Pipe Bomber!",
    "description": "Authorities have made an arrest in connection with the placement of two pipe bombs outside RNC and DNC headquarters the night before the Jan. 6, 2021, Capitol attack. abc7ny.com/post/suspect… via ABC7NY App [image or embed] — But did you Skeet? (@thepassionit…",
    "link": "https://balloon-juice.com/2025/12/04/lawn-order-open-thread-look-over-there-an-anarchist-pipe-bomber/",
    "timestamp": "2025-12-04T22:23:26Z"
  },
  {
    "title": "Is Karoline Leavitt a Swiftie?",
    "description": "’Tis the season for Spotify Wrapped, and it appears White House press secretary Karoline Leavitt has been spending a lot of time listening to Donald Trump’s nemesis Taylor Swift.",
    "link": "http://www.thecut.com/article/karoline-leavitt-taylor-swift-spotify-wrapped.html",
    "timestamp": "2025-12-04T22:22:40Z"
  },
  {
    "title": "‘BLATANT LIES’: Josh Shapiro Slams Kamala Harris’ Book",
    "description": "Democrat Pennsylvania Gov. Josh Shapiro has called out former Vice President Kamala Harris over her campaign memoir’s characterization of him, which he says are “blatant... Read More\nThe post ‘BLATANT LIES’: Josh Shapiro Slams Kamala Harris’ Book appeared fir…",
    "link": "https://www.dailysignal.com/2025/12/04/blatant-lies-josh-shapiro-slams-kamala-harris-book/",
    "timestamp": "2025-12-04T22:20:00Z"
  },
  {
    "title": "Vance says antisemitism isn't exploding on the right",
    "description": "Vice President JD Vance, reflecting Thursday on his first year in office, said that he disagrees with fellow Republicans who have warned of a rise in antisemitism in their party.“Judging anybody based on their skin color or immutable characteristics, I think,…",
    "link": "https://www.nbcnews.com/politics/jd-vance/vance-says-antisemitism-isnt-exploding-right-rcna247414",
    "timestamp": "2025-12-04T22:19:22Z"
  },
  {
    "title": "Played them all the old songs, thought that’s why they came",
    "description": "Remember way back in the day, when Oral Roberts testified to his marks loyal followers that God had told him that He was going to call the Rev. Dr. Roberts home if they didn’t send him a whole boatload of cash immediately? I just found this in my in-box: Patr…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/played-them-all-the-old-songs-thought-thats-why-they-came",
    "timestamp": "2025-12-04T22:19:09Z"
  },
  {
    "title": "Sen. Kelly Blasts Trump ‘Suck Up’ Pete Hegseth By Sharing Old Video That Didn’t Age Well",
    "description": "“What changed for Pete?” the Arizona Democrat asked of the now-awkward video from 2016.",
    "link": "https://www.huffpost.com/entry/mark-kelly-shares-pete-hegseth-resurfaced-video-2016-war-crimes_n_6931c62ae4b0824b6df8647a",
    "timestamp": "2025-12-04T22:19:09Z"
  },
  {
    "title": "Donald Trump YMCA dance, explained: Why Village People will play president's favorite song at World Cup draw",
    "description": "The Village People are performing at the 2026 World Cup draw on Friday. One reason why? Donald Trump loves \"Y.M.C.A.\"",
    "link": "https://www.sportingnews.com/us/soccer/news/donald-trump-ymca-dance-song/5f8887f44b0f7cd805da0be5",
    "timestamp": "2025-12-04T22:18:00Z"
  },
  {
    "title": "South Africa Wants ‘Break’ from G20 Under Trump’s Leadership",
    "description": "The office of President Cyril Ramaphosa announced on Thursday that South Africa will take a “commercial break” from the Group of 20 (G20) forum over the coming year because the rotating precedency has passed to the United States under President Donald Trump.\n…",
    "link": "https://www.breitbart.com/africa/2025/12/04/south-africa-wants-break-from-g20-under-trumps-leadership/",
    "timestamp": "2025-12-04T22:17:53Z"
  },
  {
    "title": "'Shameful': Tim Walz 'deeply concerned' over drive-by shouts of Trump's slur",
    "description": "Minnesota Gov. Tim Walz (D) said Thursday that people are driving by his home, rolling down their windows and yelling a slur for developmentally disabled people, mimicking President Donald Trump after he used the derogatory term to attack him.The Democratic g…",
    "link": "https://www.rawstory.com/donald-trump-tim-walz-2674371002/",
    "timestamp": "2025-12-04T22:17:15Z"
  },
  {
    "title": "A supersized World Cup field begins taking shape at Friday's draw",
    "description": "FIFA has invited more teams than ever for a World Cup priced largely for fans in the 1%. The process of figuring out which teams in the expanded 48-nation field will play where begins with Friday's draw at the Kennedy Center for the Performing Arts. Cape Verd…",
    "link": "https://sports.yahoo.com/articles/supersized-world-cup-field-begins-221713414.html",
    "timestamp": "2025-12-04T22:17:13Z"
  },
  {
    "title": "Robert F. Kennedy’s Immunization Board Delays Decision on Future of Hep B Vaccine",
    "description": "Robert F. Kennedy’s hand-picked vaccine advisory board unexpectedly delayed its vote on the future hepatitis B vaccine’s future in the childhood immunization schedule. Advisory Committee... Read More\nThe post Robert F. Kennedy’s Immunization Board Delays Deci…",
    "link": "https://www.dailysignal.com/2025/12/04/robert-f-kennedys-immunization-board-delays-decision-on-future-of-hep-b-vaccine/",
    "timestamp": "2025-12-04T22:14:01Z"
  },
  {
    "title": "US says Pentagon review sees opportunities to strengthen AUKUS submarine deal",
    "description": "WASHINGTON, Dec 4 (Reuters) - The Pentagon has completed its review of the AUKUS project to provide Australia with nuclear-powered submarines and has found areas to put the deal on the \"strongest possible footing,\" a U.S. official said on Thursday. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/12/05/us-says-pentagon-review-sees-opportunities-to-strengthen-aukus-submarine-deal",
    "timestamp": "2025-12-04T22:14:00Z"
  },
  {
    "title": "'Unbelievable': Trump under seige over pricey fixation while cost of living spikes",
    "description": "The White House reportedly will be submitting plans for President Donald Trump’s $300 million ballroom to a federal planning commission later this month, after the East Wing of the White House has already been demolished and as the president replaces the proj…",
    "link": "https://www.rawstory.com/alternet-posts/trump-ballroom-costs/",
    "timestamp": "2025-12-04T22:12:39Z"
  },
  {
    "title": "Akshun Mahajan on his acting craft, growth and discipline: I adapt to every situation than having a preconceived notion",
    "description": "Akshun Mahajan is making waves in Indian cinema with his dedicated approach to acting and refreshing screen presence. He emphasizes a collaborative preparation process, blending his research with directorial vision. Mahajan navigates industry challenges with …",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/akshun-mahajan-on-his-acting-craft-growth-and-discipline-i-adapt-to-every-situation-than-having-a-preconceived-notion/articleshow/125775618.cms",
    "timestamp": "2025-12-04T22:12:03Z"
  },
  {
    "title": "Why Do Trump’s Favorite Tech Bros Look So Sad?",
    "description": "This was supposed to be their year—but a historically unpopular president and fears of an A.I. stock market crash loom large over Silicon Valley.",
    "link": "https://slate.com/technology/2025/12/trump-big-tech-bros-ai-bitcoin-bubble-sam-altman-david-sacks-elon-musk.html",
    "timestamp": "2025-12-04T22:11:06Z"
  },
  {
    "title": "\"It's Going To Take Generations To Undo His Damage\" — Americans Are Calling Out Whether They Believe Donald Trump Has Gone Too Far",
    "description": "Over 1,000 redditors responded to a writer's argument about Trump's \"cruelty\" and immigration policies.View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/reactions-viral-article-trump-cruelty",
    "timestamp": "2025-12-04T22:11:02Z"
  },
  {
    "title": "Per Her Request, Ghislaine Maxwell Expects To Get Out Of Prison",
    "description": "Much remains unknown but The New York Times reported on Wednesday that Ghislaine Maxwell, Jeffrey Epstein’s convicted accomplice, currently serving a 20-year prison sentence for sex trafficking, plans to ask a Manhattan federal court to release her.\n“The lett…",
    "link": "https://crooksandliars.com/2025/12/ghislaine-maxwell-trying-get-out-prison",
    "timestamp": "2025-12-04T22:09:56Z"
  },
  {
    "title": "Admiral says there was no ‘kill them all’ order",
    "description": "A Navy admiral commanding the U.S. military strikes on an alleged drug boat in the Caribbean told lawmakers Thursday that there was no \"kill them all\" order from Defense Secretary Pete Hegseth, but a stark video of the attack left grave questions as Congress …",
    "link": "https://www.bostonherald.com/2025/12/04/admiral-says-there-was-no-kill-them-all-order/",
    "timestamp": "2025-12-04T22:08:36Z"
  },
  {
    "title": "Pete Hegseth could be investigated for illegal orders by 5 different bodies – but none are likely to lead to charges",
    "description": "Allegations are swirling around a US military strike on an alleged drug boat that resulted in 2 civilian deaths. A military law scholar outlines how facts and accountability can be determined.",
    "link": "https://theconversation.com/pete-hegseth-could-be-investigated-for-illegal-orders-by-5-different-bodies-but-none-are-likely-to-lead-to-charges-271284",
    "timestamp": "2025-12-04T22:08:15Z"
  },
  {
    "title": "Republicans Started A Full-Blown Midterms War — But Expert Says It Backfired",
    "description": "The GOP may face a tough road heading into the 2026 midterms, but as one expert on voting rights points out, the fight is far from over.",
    "link": "https://www.huffpost.com/entry/republicans-gerrymandering-redistricting-power-grab-backfiring_n_6931aeb3e4b0824b6df8456a",
    "timestamp": "2025-12-04T22:08:01Z"
  },
  {
    "title": "AG Bondi: Evidence Leading to J6 Pipe Bomber Arrest 'Collecting Dust' at Biden's FBI for 4 Years",
    "description": "Evidence leading to the arrest of a suspect for planting pipe bombs at the DNC and RNC was \"sitting there collecting dust\" at the FBI during the four years of the Biden administration, Attorney General Pam Bondi revealed Thursday.\nThe post AG Bondi: Evidence …",
    "link": "https://www.breitbart.com/politics/2025/12/04/ag-bondi-evidence-leading-to-j6-pipe-bomber-arrest-collecting-dust-at-bidens-fbi-4-years/",
    "timestamp": "2025-12-04T22:07:24Z"
  },
  {
    "title": "Taylor Swift on Trump's White House Press Secretary's Spotify Wrapped",
    "description": "Taylor Swift is on White House press secretary Karoline Leavitt's Spotify Wrapped, despite President Trump's beef with the pop star.",
    "link": "http://www.billboard.com/music/music-news/taylor-swift-trump-white-house-secretary-spotify-wrapped-1236128655/",
    "timestamp": "2025-12-04T22:06:27Z"
  },
  {
    "title": "US health department unveils strategy to expand its adoption of AI technology",
    "description": "The new strategy signals how leaders across the Trump administration have embraced AI innovation.",
    "link": "https://www.twincities.com/2025/12/04/hhs-artificial-intelligence/",
    "timestamp": "2025-12-04T22:03:31Z"
  },
  {
    "title": "Clever Drug Trafficker Turns Himself In So Trump Will Pardon Him Instead Of Blow Him Up",
    "description": "CALEXICO, CA — Venezuelan drug mule-turned-drug lord Gilberto Juarez turned himself in to U.S. federal law enforcement on Thursday so that President Donald Trump would pardon him instead of blowing him up.",
    "link": "https://babylonbee.com/news/clever-drug-trafficker-turns-himself-in-so-trump-will-pardon-him-instead-of-blow-him-up",
    "timestamp": "2025-12-04T22:02:41Z"
  },
  {
    "title": "What’s Next After Trump Voids Biden Autopen Orders?",
    "description": "The Trump administration could have a tough time making all of former President Joe Biden’s autopen actions “null and void,” which likely means he will... Read More\nThe post What’s Next After Trump Voids Biden Autopen Orders? appeared first on The Daily Signa…",
    "link": "https://www.dailysignal.com/2025/12/04/whats-next-after-trump-voids-biden-autopen-orders/",
    "timestamp": "2025-12-04T22:02:34Z"
  },
  {
    "title": "California Republican Caught On Hot Mic Fretting About Dems Redistricting Plans",
    "description": "A California Republican was caught on a hot mic discussing election strategy after the state voted in favor of a new redistricting plan.\nThe post California Republican Caught On Hot Mic Fretting About Dems Redistricting Plans first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/california-repulican-caught-on-hot-mic-fretting-about-dems-redistricting-plans/",
    "timestamp": "2025-12-04T22:01:56Z"
  },
  {
    "title": "'Pardon me, such a terrible mistake!' Grinning Trump teases new name for Kennedy Center",
    "description": "President Donald Trump has completely remade the Kennedy Center in his image — and now he wants to name it after himself.According to The New Republic, Trump let this plan slip \"during a speech at the U.S. Institute of Peace for the signing of a peace agreeme…",
    "link": "https://www.rawstory.com/kennedy-center-2674370827/",
    "timestamp": "2025-12-04T22:00:47Z"
  },
  {
    "title": "Carney doesn’t plan to talk trade with Trump at FIFA event",
    "description": "Mark Carney isn’t planning to discuss trade with U.S. president Donald Trump when they meet for the FIFA 2026 World Cup event. Read here",
    "link": "https://financialpost.com/news/carney-talk-trade-trump-fifa",
    "timestamp": "2025-12-04T22:00:43Z"
  },
  {
    "title": "Controversial antiparasitic ivermectin now easier to buy in Texas",
    "description": "Easier access to the drug, most commonly used as an antiparasitic, has Texas medical professionals worried about the dangers of unchecked use and harmful side effects.",
    "link": "https://www.fox4news.com/news/ivermectin-now-available-without-prescription-texas",
    "timestamp": "2025-12-04T22:00:30Z"
  },
  {
    "title": "Commentary: Trump’s ‘dealmaker’ approach to peace and war is cause for concern",
    "description": "US President Donald Trump is turning to trusted envoys such as his son-in-law to achieve diplomatic breakthroughs. But these efforts come at a cost to America’s allies, argues Kevin Chen from RSIS.",
    "link": "https://www.channelnewsasia.com/commentary/trump-peace-plan-ukraine-gaza-envoy-dealmaker-5550276",
    "timestamp": "2025-12-04T22:00:00Z"
  },
  {
    "title": "Trump Replaces Architect to Lead $300 Million Ballroom Design (Skylar Woodhouse/Bloomberg)",
    "description": "Skylar Woodhouse / Bloomberg:\nTrump Replaces Architect to Lead $300 Million Ballroom Design  —  President Donald Trump has tapped a new architect to help plan his $300 million White House ballroom wing, assigning the former lead designer to a consultant role …",
    "link": "https://www.memeorandum.com/251204/p100",
    "timestamp": "2025-12-04T22:00:00Z"
  },
  {
    "title": "Trump's Bigoted Attack on Somalis Denounced From Minneapolis to DC to Mogadishu",
    "description": "President Donald Trump is being roundly condemned for making bigoted attacks on Somalis, whom he referred to collectively as \"garbage\" earlier this week.During a Tuesday Cabinet meeting at the White House, Trump unleashed a racist tirade against Somali Americ…",
    "link": "https://www.commondreams.org/news/trump-anti-somali-racism",
    "timestamp": "2025-12-04T21:59:09Z"
  }
]