[
  {
    "title": "Hamas rejects Trump remarks on Gaza talks breakdown",
    "description": "GAZA CITY, Palestinian Territories: Hamas officials expressed surprise on Saturday (Jul 26) at US President Donald Trump's accusation that the group \"didn't really want\" a ceasefire and hostage release",
    "link": "https://www.channelnewsasia.com/world/hamas-rejects-trump-remarks-gaza-talks-breakdown-5260486",
    "timestamp": "2025-07-26T19:48:31Z"
  },
  {
    "title": "Trump says Japan is investing $550B in the U.S. at his direction. It may not be a sure thing",
    "description": "President Donald Trump is bragging that Japan has given him, as part of a new trade framework, $550 billion to invest in the United States. It's an astonishing figure, but still subject to negotiation and perhaps not the sure thing he's portraying.",
    "link": "https://biztoc.com/x/32ccdf3ce2c416eb",
    "timestamp": "2025-07-26T19:46:40Z"
  },
  {
    "title": "Trump says Japan will invest $550B in US at his direction",
    "description": "President Donald Trump says that Japan has given him, as part of a new trade framework, $550 billion to invest in the United States. It’s an astonishing figure, but still subject to negotiation and perhaps not the sure thing he’s portraying.\n“Japan is putting…",
    "link": "https://biztoc.com/x/c9f5f81a96a0ddab",
    "timestamp": "2025-07-26T19:46:37Z"
  },
  {
    "title": "US-China trade talks: Can China reduce its export dependence?",
    "description": "China’s high dependence on exports will likely be a key focus of a new round of U.S.-China trade talks this coming week in Stockholm, but a trade deal would not necessarily help Beijing to rebalance its economy.",
    "link": "https://www.bostonherald.com/2025/07/26/us-china-trade-talks-can-china-reduce-its-export-dependence/",
    "timestamp": "2025-07-26T19:44:39Z"
  },
  {
    "title": "Official fired during Trump's first term appointed president of embattled US Institute of Peace",
    "description": "A senior state department official who was fired as a speechwriter during President Donald Trump’s first term and has a history of incendiary statements has been appointed to lead the embattled U.S. Institute of Peace",
    "link": "https://abcnews.go.com/Politics/wireStory/official-fired-trumps-term-appointed-president-embattled-us-124102560",
    "timestamp": "2025-07-26T19:42:17Z"
  },
  {
    "title": "Ghislaine Maxwell's meetings with Justice Department shrouded in secrecy",
    "description": "Deputy Attorney General Todd Blanche completed nine hours of meetings over two days with Ghislaine Maxwell on Friday but made no public statements about what she said or the next steps in the Justice Department’s much-criticized Jeffrey Epstein investigation",
    "link": "https://www.nbcnews.com/politics/justice-department/ghislaine-maxwell-justice-department-meetings-rcna221240",
    "timestamp": "2025-07-26T19:41:34Z"
  },
  {
    "title": "Trump says Japan is investing $550B in the U.S. at his direction. It may not be a sure thing",
    "description": "President Donald Trump is bragging that Japan has given him, as part of a new trade framework, $550 billion to invest in the United States. It's an astonishing figure, but still subject to negotiation and perhaps not the sure thing he's portraying.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-japan-is-investing-550b-in-the-u-s-at-his-direction-it-may-not-be-a-sure-thing",
    "timestamp": "2025-07-26T19:38:11Z"
  },
  {
    "title": "Federal Government Becomes Major Investor Under Donald Trump, Echoing Wartime Scale",
    "description": "Donald Trump administration has been making significant investments in U.S. companies, a move not commonly seen outside of major crises or wartime. This includes taking stakes in companies and embracing state intervention in industries deemed crucial for nati…",
    "link": "https://biztoc.com/x/833912778571447e",
    "timestamp": "2025-07-26T19:35:43Z"
  },
  {
    "title": "Trump says Japan will invest $550B in US at his direction",
    "description": "President Donald Trump says that Japan has given him $550 billion to invest in the United States. It's an astonishing figure, but still subject to negotiation and perhaps not the sure thing he's portraying.",
    "link": "https://www.bostonherald.com/2025/07/26/trump-says-japan-will-invest-550b-in-us-at-his-direction/",
    "timestamp": "2025-07-26T19:34:51Z"
  },
  {
    "title": "Genocide scholar may leave Columbia over university's new definition of antisemitism",
    "description": "The man who drafted the definition called the university's move \"appalling,\" predicting it would spur litigation against the school.",
    "link": "https://roanoke.com/news/nation-world/education/article_b2d4d1de-7895-50ba-be98-0663f4dc19e3.html",
    "timestamp": "2025-07-26T19:30:00Z"
  },
  {
    "title": "Genocide scholar may leave Columbia over university's new definition of antisemitism",
    "description": "The man who drafted the definition called the university's move \"appalling,\" predicting it would spur litigation against the school.",
    "link": "https://richmond.com/news/nation-world/education/article_7280d564-de0e-5c67-83bb-efbab0fb3df9.html",
    "timestamp": "2025-07-26T19:30:00Z"
  },
  {
    "title": "CNN Analyst Stunned After Trump Botches 'Easiest Question In Human History'",
    "description": "President Donald Trump's comments about convicted sex trafficker Ghislaine Maxwell left senior legal analyst Elie Honig in near disbelief.",
    "link": "https://www.huffpost.com/entry/trump-ghislaine-maxwell-answer_n_6884fcf6e4b0d2b6e053785f",
    "timestamp": "2025-07-26T19:26:26Z"
  },
  {
    "title": "Mehdi Hasan Blasts Democrats and Media Over ‘Complete Failure’ To Link Trump to Epstein Years Ago",
    "description": "Zeteo founder and former MSNBC host Mehdi Hasan laid into the Democratic Party and the media for not previously linking President Donald Trump to deceased child sex trafficker Jeffrey Epstein. \nThe post Mehdi Hasan Blasts Democrats and Media Over ‘Complete Fa…",
    "link": "https://www.mediaite.com/media/podcasts/mehdi-hasan-blasts-democrats-and-media-over-complete-failure-to-link-trump-to-epstein-years-ago/",
    "timestamp": "2025-07-26T19:25:17Z"
  },
  {
    "title": "US, South Korea reaffirm pledge to reach trade deal before deadline",
    "description": "South Korea and the U.S. reaffirmed their commitment to pursue a mutually beneficial trade agreement ahead of the Aug. 1 deadline when duties are set to rise, the Asian nation’s industry ministry said.",
    "link": "https://www.bostonherald.com/2025/07/26/us-south-korea-reaffirm-pledge-to-reach-trade-deal-before-deadline/",
    "timestamp": "2025-07-26T19:22:14Z"
  },
  {
    "title": "5 things to know about Gaza’s worsening food crisis",
    "description": "Malnutrition has reached alarming levels in Gaza, aid officials say, with hunger now reportedly affecting civilians as well as journalists, doctors, and other personnel on the ground.",
    "link": "https://www.cfr.org/article/gazas-food-crisis-worsening-what-know",
    "timestamp": "2025-07-26T19:21:24Z"
  },
  {
    "title": "Cambodia and Thailand agree to hold talks after days of cross-border fighting, says Trump | CNN",
    "description": "Bangkok and Phnom Penh have been fighting over territory disputed since colonial power France drew the border between them more than a century ago.",
    "link": "https://www.cnn.com/2025/07/26/asia/thailand-cambodia-ceasefire-talks-trump-intl-latam",
    "timestamp": "2025-07-26T19:21:07Z"
  },
  {
    "title": "JOSH HAMMER: Grading The Second Trump Presidency, Six Months In",
    "description": "JOSH HAMMER: Grading The Second Trump Presidency, Six Months In",
    "link": "https://dailycaller.com/2025/07/26/opinion-grading-the-second-trump-presidency-six-months-in-josh-hammer/",
    "timestamp": "2025-07-26T19:19:54Z"
  },
  {
    "title": "Official fired during Trump's first term appointed president of embattled US Institute of Peace",
    "description": "A senior State Department official who was fired as a speechwriter during President Donald Trump 's first term and has a history of incendiary statements has...",
    "link": "https://www.yahoo.com/news/articles/official-fired-during-trumps-first-191856864.html",
    "timestamp": "2025-07-26T19:18:56Z"
  },
  {
    "title": "‘South Park’ Never Forgot The Assignment—How The Series Came Back From Hiatus Hotter Than Ever",
    "description": "South Park is back for it’s 27th season, and the premiere, “Sermon on the Mount”, takes the beloved series back to its roots in one of its most irreverent and relevant episodes to date.",
    "link": "https://thoughtcatalog.com/nicole-stawiarski/2025/07/south-park-never-forgot-the-assignment-how-the-series-came-back-from-hiatus-hotter-than-ever/",
    "timestamp": "2025-07-26T19:18:00Z"
  },
  {
    "title": "Trump's tough border stance isn't deterring Australian tourists",
    "description": "Australians are defying a global downturn in travel to the United States, with new figures showing a rise in visitor numbers, despite Donald Trump's tough new border controls.",
    "link": "https://www.abc.net.au/news/2025-07-27/australians-travel-to-america-us-despite-trump-border-crackdown/105562904",
    "timestamp": "2025-07-26T19:16:12Z"
  },
  {
    "title": "Far-right Sanseito party gains ground in Japan's latest election",
    "description": "Japan sees big wins for far-right, anti-immigration party that denounced ‘Jewish capital.’",
    "link": "https://www.israelnationalnews.com/news/412274",
    "timestamp": "2025-07-26T19:12:53Z"
  },
  {
    "title": "“Bad hombres”",
    "description": "I am beginning to think that Trump’s blanket travel bans are not about national security: The Cacique Mara team, from Maracaibo, Venezuela, was scheduled to participate in the tournament after winning the Latin American championship in Mexico. “The Cacique Ma…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/bad-hombres",
    "timestamp": "2025-07-26T19:10:11Z"
  },
  {
    "title": "Democrat Advisor Leaves Fox Anchor and Guest In Disbelief with Trump Inflation Claims: ‘That’s Not the Case!’",
    "description": "Democrat advisor Mike Nellis left Fox News anchor Sandra Smith in disbelief as he claimed inflation is up under President Donald Trump.\nThe post Democrat Advisor Leaves Fox Anchor and Guest In Disbelief with Trump Inflation Claims: ‘That’s Not the Case!’ firs…",
    "link": "https://www.mediaite.com/media/tv/democrat-advisor-leaves-fox-anchor-and-guest-in-disbelief-with-trump-inflation-claims-thats-not-the-case/",
    "timestamp": "2025-07-26T19:09:17Z"
  },
  {
    "title": "'Mission accomplished' for Musk as Trump's presidency teeters after exit blow-up: WaPo",
    "description": "If doing irreparable damage to Donald Trump was on Elon Musk's mind when he posted his infamous attack on the president where he stated the president \"is in the Epstein files,\" he certainly got his wish, a report from the Washington Post stated on Saturday.Th…",
    "link": "https://www.rawstory.com/trump-musk-epstein/",
    "timestamp": "2025-07-26T19:09:08Z"
  },
  {
    "title": "Lok Sabha to discuss Operation Sindoor from Monday",
    "description": "STATE TIMES NEWS NEW DELHI: The Lok Sabha will take up on Monday a special discussion on India’s ‘Operation Sindoor’ that was carried out in response to the terror attack in Pahalgam, after a weeklong virtual washout of Parliament proceedings.Defence Minister…",
    "link": "https://statetimes.in/lok-sabha-to-discuss-operation-sindoor-from-monday/",
    "timestamp": "2025-07-26T19:05:39Z"
  },
  {
    "title": "Donald Trump Leverages Trade to Open Ceasefire Talks Between Cambodia and Thailand",
    "description": "President Donald Trump on Saturday leveraged trade with the United States to open up ceasefire negotiations between Thailand and Cambodia over their territorial dispute.\nThe post Donald Trump Leverages Trade to Open Ceasefire Talks Between Cambodia and Thaila…",
    "link": "https://www.breitbart.com/politics/2025/07/26/donald-trump-leverages-trade-to-open-ceasefire-talks-between-cambodia-thailand/",
    "timestamp": "2025-07-26T19:04:40Z"
  },
  {
    "title": "Japan tariff deal to include $550bn investment: Trump",
    "description": "US News: WASHINGTON: President Donald Trump said Japan has given him, as part of a new trade framework, $550 billion to invest in the United States. \\\"Japan is .",
    "link": "https://timesofindia.indiatimes.com/world/us/japan-tariff-deal-to-include-550bn-investment-trump/articleshow/122927326.cms",
    "timestamp": "2025-07-26T19:02:30Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "Investigation into clash between football fans, Trump hits the golf course in Scotland, and tributes on the anniversary of Sinéad O’Connor’s death.",
    "link": "https://www.thejournal.ie/news-fix-26-07-25-6774830-Jul2025/",
    "timestamp": "2025-07-26T19:00:23Z"
  },
  {
    "title": "MEARSHEIMER: The more time goes by, the more Israelis look like the Nazis",
    "description": "Israel is carrying out a Trump-backed genocide John Mearsheimer, the University of Chicago professor, said in an interview on Tuesday that the Israeli rhetoric and action inside Gaza is “truely” appalling” and, with each passing day, they are looking more lik…",
    "link": "https://www.activistpost.com/mearsheimer-the-more-time-goes-by-the-more-israelis-look-like-the-nazis/",
    "timestamp": "2025-07-26T19:00:00Z"
  },
  {
    "title": "U.S. slaps 20.56% anti-dumping duties on Canadian softwood lumber",
    "description": "The U.S. Commerce Department has decided to raise anti-dumping duties on Canadian softwood to 20.56 per cent, with B.C. lumber organizations calling them unjustified, punitive and protectionist.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/us-hikes-softwood-lumber-duties-1.7594807",
    "timestamp": "2025-07-26T18:57:34Z"
  },
  {
    "title": "A little poetic justice for Donald Trump - The Economist",
    "description": "A little poetic justice for Donald TrumpThe Economist  Brooks and Capehart on the Epstein files fracturing Trump&rsquo;s basePBS  Trump&rsquo;s Epstein claims keep falling apartCNN  Trump's distraction methods fall flat against Epstein uproarReuters  Trump Re…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178475714",
    "timestamp": "2025-07-26T18:55:25Z"
  },
  {
    "title": "Melania Trump ‘Very Involved’ in Epstein Scandal: Author",
    "description": "Longtime Trump biographer Michael Wolff believes that First Lady Melania could be the missing link in President Donald Trump’s ties to convicted sex offender...",
    "link": "https://www.thedailybeast.com/melania-trump-very-involved-in-epstein-scandal-author/",
    "timestamp": "2025-07-26T18:49:32Z"
  },
  {
    "title": "Joe Rogan On Trump Administration's Handling Of Epstein Files: 'Do You Think We're Babies?'",
    "description": "The podcaster asked this on the Friday episode of his show.",
    "link": "https://www.huffpost.com/entry/joe-rogan-on-epstein-files-fallout-do-you-think-were-babies_n_68850c70e4b0d2b6e0537af3",
    "timestamp": "2025-07-26T18:49:01Z"
  },
  {
    "title": "Fame, racism, and the American dream — the complicated legacy of Hulk Hogan",
    "description": "Hulk Hogan's death sparks mixed reactions. Some remember his wrestling achievements. Others recall his racist remarks. Dwayne 'The Rock' Johnson praises Hogan's impact. Controversies include racial slurs and support for Donald Trump. Black wrestling fans disc…",
    "link": "https://economictimes.indiatimes.com/news/sports/fame-racism-and-the-american-dream-the-complicated-legacy-of-hulk-hogan/articleshow/122927000.cms",
    "timestamp": "2025-07-26T18:40:18Z"
  },
  {
    "title": "Trump says Thailand, Cambodia seek ceasefire talks",
    "description": "US President Donald Trump has said Thai and Cambodian leaders want an immediate ceasefire after days of deadly clashes. The conflict has killed at least 33 people.",
    "link": "https://www.dw.com/en/trump-says-thailand-cambodia-seek-ceasefire-talks/a-73426025",
    "timestamp": "2025-07-26T18:40:00Z"
  },
  {
    "title": "Independent Voters' Approval Rating Of Donald Trump Plummets, Latest Poll Indicates",
    "description": "President Donald Trump‘s approval rating has seen a notable dip among independent voters, as indicated by a new Gallup survey.\nWhat Happened: The poll, conducted from July 7 to 21, 2025, shows a significant drop in Trump’s job approval rating among all Americ…",
    "link": "https://biztoc.com/x/3a48a95a9fb4e1c6",
    "timestamp": "2025-07-26T18:39:41Z"
  },
  {
    "title": "Pollster Matt Towery Explains Why Trump's Actual Approval Numbers Far Exceed Media Claims",
    "description": "President Donald Trump may have lower approval ratings in some surveys, but pollster Matt Towery expressed doubt in those findings.",
    "link": "https://www.westernjournal.com/pollster-matt-towery-explains-trumps-actual-approval-numbers-far-exceed-media-claims/",
    "timestamp": "2025-07-26T18:38:05Z"
  },
  {
    "title": "South Park Creators Lied to Fans With Season 27 Trailer",
    "description": "South Park Studios\nSouth Park had teased some epic events coming in Season 27 with a new trailer ahead of its premiere this Summer, but it turns out that the creators behind the series lied to fans about what’s actually coming in the new season. When it was f…",
    "link": "http://comicbook.com/tv-shows/news/south-park-episode-lies-season-27/",
    "timestamp": "2025-07-26T18:36:41Z"
  },
  {
    "title": "Fox Host and Guest Rip MAGA’s ‘Preposterous’ Attacks on Jerome Powell: ‘A Lot of Noise About Nothing’",
    "description": "President Donald Trump's attacks on Federal Reserve Chairman Jerome Powell came in for criticism on Fox News on Saturday's edition of The Journal Editorial Report.\nThe post Fox Host and Guest Rip MAGA’s ‘Preposterous’ Attacks on Jerome Powell: ‘A Lot of Noise…",
    "link": "https://www.mediaite.com/media/tv/fox-host-and-guest-rip-magas-preposterous-attacks-on-jerome-powell-a-lot-of-noise-about-nothing/",
    "timestamp": "2025-07-26T18:34:18Z"
  },
  {
    "title": "Trump says Cambodia, Thailand agree to meet for ceasefire",
    "description": "United States President Donald Trump confirmed that Cambodia and Thailand have agreed to meet and work toward a ceasefire following recent border clashes.\n\"They have agreed to immediately meet a...",
    "link": "https://biztoc.com/x/0e69fa47305abc1a",
    "timestamp": "2025-07-26T18:29:01Z"
  },
  {
    "title": "EU chief von der Leyen heads to Scotland for trade talks with Trump",
    "description": "BRUSSELS/EDINBURGH (Reuters) -EU Commission President Ursula von der Leyen headed to Scotland on Saturday ahead of a meeting with U.S. President Donald Trump on Sunday afternoon, commission spokespeople said, as EU officials said the two sides were nearing a …",
    "link": "https://www.thestar.com.my/news/world/2025/07/27/eu-chief-von-der-leyen-heads-to-scotland-for-trade-talks-with-trump",
    "timestamp": "2025-07-26T18:28:00Z"
  },
  {
    "title": "Trump says Thailand and Cambodia agree to hold immediate ceasefire talks",
    "description": "Before Trump spoke to the two leaders, clashes on the Thai-Cambodian border persisted into a third day and new flashpoints emerged on Saturday as both sides said they had acted in self-defense in the border dispute and called on the other to cease fighting an…",
    "link": "https://www.channelnewsasia.com/asia/trump-says-thailand-and-cambodia-agree-hold-immediate-ceasefire-talks-5260426",
    "timestamp": "2025-07-26T18:24:58Z"
  },
  {
    "title": "Trump recalls India-Pak conflict as he speaks to leaders of Thailand and Cambodia",
    "description": "Donald Trump claimed to have intervened in escalating tensions between Cambodia and Thailand, recalling his supposed role in halting the India-Pakistan conflict. He stated he spoke with Cambodian and Thai leaders, urging a ceasefire and end to the ongoing cla…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-recalls-india-pak-conflict-as-he-speaks-to-leaders-of-thailand-and-cambodia/articleshow/122926712.cms",
    "timestamp": "2025-07-26T18:22:37Z"
  },
  {
    "title": "'Ghislaine Maxwell is a liar': Former Bondi appointee undercuts DOJ's fishing expedition",
    "description": "A former Florida prosecutor who was tabbed by then-Florida Attorney General Pam Bondi as her \"drug czar\" laughed off attempts by the Department of Justice to get information out of a convicted child sex trafficker Ghislaine Maxwell, during an appearance on MS…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-pam-bondi/",
    "timestamp": "2025-07-26T18:20:13Z"
  },
  {
    "title": "U.S. analysis finds no evidence of widespread Hamas theft of Gaza aid",
    "description": "An internal U.S. government analysis found no evidence of systematic theft by the Palestinian militant group Hamas of U.S.-funded humanitarian supplies, challenging the main rationale that Israel and the U.S. give for backing a new armed private aid operation.",
    "link": "https://www.cbc.ca/news/world/hamas-aid-theft-no-evidence-analysis-1.7594805",
    "timestamp": "2025-07-26T18:19:49Z"
  },
  {
    "title": "Michael Smerconish Thinks Trump Could’ve Easily Avoided Epstein Storm: ‘Here’s What He Should Have Said’ | Video",
    "description": "The president is \"acting like he has something to hide, guaranteeing that the controversy stays alive and creates division,\" says the CNN host and presenter\nThe post Michael Smerconish Thinks Trump Could’ve Easily Avoided Epstein Storm: ‘Here’s What He Should…",
    "link": "https://www.thewrap.com/michael-smerconish-trump-should-have-said-jeffrey-epstein-video/",
    "timestamp": "2025-07-26T18:17:28Z"
  },
  {
    "title": "Thailand and Cambodia agree to hold immediate ceasefire talks, Trump says (Reuters)",
    "description": "Reuters:\nThailand and Cambodia agree to hold immediate ceasefire talks, Trump says  —  U.S. President Donald Trump said on Saturday that the leaders of Cambodia and Thailand had agreed to meet immediately to quickly work out a ceasefire, as he sought to broke…",
    "link": "https://www.memeorandum.com/250726/p30",
    "timestamp": "2025-07-26T18:15:00Z"
  },
  {
    "title": "Trump calls on Thailand and Cambodia to stop fighting",
    "description": "As he golfs in Scotland, the US president talks to the Thai and Cambodia leaders about stopping fighting.",
    "link": "https://www.bbc.com/news/articles/cy854585r32o",
    "timestamp": "2025-07-26T18:13:03Z"
  },
  {
    "title": "Alexandria Ocasio-Cortez Ordered To Pay Up For “Tax The Rich” Dress",
    "description": "New York representative Alexandria Ocasio-Cortez must up the fee she paid for her 2021 Met Gala dress.",
    "link": "https://www.vanityfair.com/style/story/alexandria-ocasio-cortez-met-gala-dress-fine",
    "timestamp": "2025-07-26T18:12:20Z"
  },
  {
    "title": "The Democratic Party’s Brand Is Cooked",
    "description": "A new poll found that Democrats have their lowest favorability rating in more than three decades.",
    "link": "http://www.rollingstone.com/politics/politics-news/democratic-party-brand-congress-bad-poll-1235394662/",
    "timestamp": "2025-07-26T18:10:13Z"
  },
  {
    "title": "Trump Claims He 'Never Went' To Epstein's Island, Tells People To Focus On Bill Clinton Instead",
    "description": "“You’re making a very big thing over something that’s not a big thing,” President Donald Trump told reporters questioning him about Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/trump-epstein-island-focus-clinton_n_68850023e4b07c2af0282e52",
    "timestamp": "2025-07-26T18:08:34Z"
  },
  {
    "title": "Donald Trump Posts Meme of Himself, J.D. Vance Chasing Obama in O.J.'s White Bronco",
    "description": "Donald Trump and J.D. Vance are hot on Barack Obama's tail, the current prez is saying in a wild new social media post showing him catching up on his predecessor ... like the Los Angeles Police Department caught up with O.J. Simpson back in 1994!…\n Permalink",
    "link": "https://www.tmz.com/2025/07/26/donald-trump-posts-meme-jd-vance-chasing-obama-oj-simpson-white-bronco/",
    "timestamp": "2025-07-26T18:08:21Z"
  },
  {
    "title": "Trump Explains Why He Might Not Make Trade Deals With Thailand And Cambodia",
    "description": "'We happen to be, by coincidence, currently dealing on Trade with both Countries, but do not want to make any Deal, with either Country, if they are fighting'",
    "link": "https://dailycaller.com/2025/07/26/donald-trump-trade-deals-thailand-cambodia-fighting-tariff/",
    "timestamp": "2025-07-26T18:07:12Z"
  },
  {
    "title": "As Trump plays golf in Scotland, protesters take to the streets and decry his visit",
    "description": "President Donald Trump played golf Saturday at his course on Scotland's coast while protesters around the country took to the streets to decry his visit and accuse United Kingdom leaders of pandering to the American.",
    "link": "https://biztoc.com/x/438d6d6fae4820c5",
    "timestamp": "2025-07-26T18:06:15Z"
  },
  {
    "title": "House Democrats Ask Jeffrey Epstein’s Estate For “Birthday Book”",
    "description": "US Representatives Ro Khanna and Robert Garcia requested that Epstein’s estate deliver the book to them by August 10, a day before Ghislaine Maxwell is scheduled to testify before Congress.",
    "link": "https://www.vanityfair.com/news/story/house-democrats-ask-jeffrey-epstein-estate-for-birthday-book",
    "timestamp": "2025-07-26T18:04:59Z"
  },
  {
    "title": "Britain, France, Germany call for end to Gaza war as death toll climbs",
    "description": "Britain, France and Germany are calling for an immediate end Israel's war in Gaza after dozens of people were killed over a 24-hour period in the territory.",
    "link": "https://www.upi.com/Top_News/World-News/2025/07/26/joint-statement-gaza-israeli-war-killed/2661753551623/",
    "timestamp": "2025-07-26T18:00:53Z"
  },
  {
    "title": "Turley: John Brennan Is the Most Vulnerable – ‘Like a 30-Point Buck in the Open’",
    "description": "\"[I]t does appear that a couple of these figures may have committed perjury.\"\nThe post Turley: John Brennan Is the Most Vulnerable – ‘Like a 30-Point Buck in the Open’ first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/turley-john-brennan-is-the-most-vulnerable-like-a-30-point-buck-in-the-open/",
    "timestamp": "2025-07-26T18:00:45Z"
  },
  {
    "title": "'Make America Gay Again': Amsterdam pride gets political...",
    "description": "Thousands of people gathered for Amsterdam Pride march on Saturday in a festive and political mood, stressing the need to defend LGBTQI+ rights increasingly ...",
    "link": "https://www.yahoo.com/news/articles/america-gay-again-amsterdam-pride-165222838.html",
    "timestamp": "2025-07-26T18:00:03Z"
  },
  {
    "title": "As Trump plays golf in Scotland, protesters take to the streets and decry his visit",
    "description": "President Donald Trump played golf Saturday at his course on Scotland's coast while protesters around the country took to the streets to decry his visit and accuse United Kingdom leaders of pandering to the American.",
    "link": "https://www.pbs.org/newshour/politics/as-trump-plays-golf-in-scotland-protesters-take-to-the-streets-and-decry-his-visit",
    "timestamp": "2025-07-26T17:55:56Z"
  },
  {
    "title": "Trump says Japan will invest $550 billion in US at his direction. It may not be a sure thing - AP News",
    "description": "Trump says Japan will invest $550 billion in US at his direction. It may not be a sure thingAP News Fact Sheet: President Donald J. Trump Secures Unprecedented U.S.–Japan Strategic Trade and Investment AgreementThe White House (.gov) Opinion | The UAW Gets a …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178475302",
    "timestamp": "2025-07-26T17:55:13Z"
  },
  {
    "title": "CNN’s Kaitlan Collins and Maggie Haberman Slam Trump Allies Painting Ghislaine As Victim: Epstein’s Victims Would Like A Word’",
    "description": "CNN's Kaitlan Collins and New York Times White House correspondent Maggie Haberman ripped media allies of Trump for painting Ghislaine Maxwell as a victim.\nThe post CNN’s Kaitlan Collins and Maggie Haberman Slam Trump Allies Painting Ghislaine As Victim: Epst…",
    "link": "https://www.mediaite.com/media/news/cnns-kaitlan-collins-and-maggie-haberman-slam-trump-allies-painting-ghislaine-as-victim-epsteins-victims-would-like-a-word/",
    "timestamp": "2025-07-26T17:48:47Z"
  },
  {
    "title": "Will He, or Won’t He? That is the Question as US Frustration With Netanyahu Mounts",
    "description": "Israeli Prime Minister Binyamin Netanyahu appears determined to depopulate Gaza by hook or by crook, even if he has bowed to US pressure by agreeing to a reduced military presence in the Strip as part of a temporary ceasefire. The reduced presence, involving …",
    "link": "https://www.fairobserver.com/politics/will-he-or-wont-he-that-is-the-question-as-us-frustration-with-netanyahu-mounts/",
    "timestamp": "2025-07-26T17:44:20Z"
  },
  {
    "title": "Tom Hiddleston’s ‘The Life Of Chuck’ New On Streaming This Week, Report Says",
    "description": "Director Mike Flanagan’s \"The Life of Chuck,\" starring Tom Hiddleston, is reportedly coming to digital streaming this week. Find out when and where you can watch the movie at home.",
    "link": "https://www.forbes.com/sites/timlammers/2025/07/26/tom-hiddlestons-the-life-of-chuck-new-on-streaming-this-week-report-says/",
    "timestamp": "2025-07-26T17:43:50Z"
  },
  {
    "title": "Trump wades in on Thailand-Cambodia fighting during golf visit in Scotland",
    "description": "The US president's second day golfing at one of his courses has also met protests around the country.",
    "link": "https://www.aljazeera.com/news/2025/7/26/trump-wades-in-on-thailand-cambodia-fighting-during-golf-visit-in-scotland",
    "timestamp": "2025-07-26T17:41:32Z"
  },
  {
    "title": "Trump Is Days Away From Securing His Questionable Air Force One Jet From Qatar",
    "description": "Qatar will send the $400 million Boeing 747 aircraft as an unconditional “donation” to the Department of Defense, The Washington Post reported.",
    "link": "https://www.huffpost.com/entry/trump-is-days-away-from-getting-his-unethical-air-force-one-jet-from-qatar_n_6884ffefe4b02a19bf1f9895",
    "timestamp": "2025-07-26T17:36:30Z"
  },
  {
    "title": "Trump Takes 5-Day 'Working Visit' to His Golf Clubs in Scotland as Epstein Controversy Boils",
    "description": "President Donald Trump retreated to his golf resorts in Scotland, widely seen as an attempt to avoid mounting scrutiny amid the escalating Epstein controversy, as cities across the country staged protests following his arrival.",
    "link": "https://www.ibtimes.com/trump-5-day-working-visit-golf-clubs-scotland-epstein-controversy-boils-3779501",
    "timestamp": "2025-07-26T17:36:09Z"
  },
  {
    "title": "Joe Rogan Cracks Up At South Park’s Trump Micropenis Clip: ‘It’s F**king Hilarious!’",
    "description": "Joe Rogan had nothing but praise for South Park's creators after their show depicted President Donald Trump with a micropenis and sharing a bed with Satan.\nThe post Joe Rogan Cracks Up At South Park’s Trump Micropenis Clip: ‘It’s F**king Hilarious!’ first app…",
    "link": "https://www.mediaite.com/media/podcasts/joe-rogan-cracks-up-at-south-parks-trump-micropenis-clip-its-fking-hilarious/",
    "timestamp": "2025-07-26T17:35:39Z"
  },
  {
    "title": "Alabama Sen. Katie Britt, 13 colleagues urge White House to release delayed health research funds",
    "description": "Sen. Lindsey Graham (R-S.C.), Sen. Dave McCormick (R-Pa.) and Sen. Jerry Moran (R-Kans.) were among the senators that cosigned Britt’s letter.",
    "link": "https://www.al.com/news/2025/07/alabama-sen-katie-britt-13-colleagues-urge-white-house-to-release-delayed-health-research-funds.html",
    "timestamp": "2025-07-26T17:35:23Z"
  },
  {
    "title": "Trump says administration is considering rebate checks for Americans in relation to tariff revenue",
    "description": "\"We're thinking about a little rebate,\" Trump said Friday before leaving on his trip to Scotland. President Donald Trump told reporters that the administration was considering rebate checks for Americans based on tariff revenue.\"We're thinking about a little …",
    "link": "https://freerepublic.com/focus/f-news/4330902/posts",
    "timestamp": "2025-07-26T17:26:01Z"
  },
  {
    "title": "‘Everyone is for Santa Claus’: The Trump policy Dems are quietly backing",
    "description": "The president has secured major deals with countries like Japan, the Philippines, South Korea and Iraq",
    "link": "https://www.wnd.com/2025/07/everyone-is-santa-claus-trump-policy-dems-are/",
    "timestamp": "2025-07-26T17:24:50Z"
  },
  {
    "title": "David Valadao Battles Backlash",
    "description": "“When Rep. David Valadao (R-CA) was knocked out of office in 2018, Democrats around the country were riding a wave of backlash against President Donald Trump and the GOP’s attempts to cut health care,” NBC",
    "link": "https://politicalwire.com/2025/07/26/david-valadao-battles-backlash/",
    "timestamp": "2025-07-26T17:17:39Z"
  },
  {
    "title": "Fired ABC Reporter Terry Moran Claims Trump Plans to End Press Freedom and Must Be 'Stopped'",
    "description": "Former ABC News reporter Terry Moran, who was fired from the network for a social media rant against a White House aide, now is comparing President Donald Trump to Russian dictator Vladimir Putin and claims the U.S. will lose its free press if Trump is not “s…",
    "link": "https://www.breitbart.com/the-media/2025/07/26/fired-abc-reporter-terry-moran-claims-trump-plans-to-end-press-freedom-and-must-be-stopped/",
    "timestamp": "2025-07-26T17:17:08Z"
  },
  {
    "title": "LARRY ELDER: Dems Rail Against Colbert’s Cancellation — Here’s Why",
    "description": "CBS canceled Stephen Colbert's late-night show. Democrats railed against the cancellation. Here's why.",
    "link": "https://dailycaller.com/2025/07/26/opinion-dems-rail-against-colberts-cancellation-heres-why-larry-elder/",
    "timestamp": "2025-07-26T17:11:19Z"
  },
  {
    "title": "Trump Golfs In Scotland Amid Protests And Epstein Files Backlash (Photos)",
    "description": "The president is visiting the country to meet with Scottish leaders and celebrate the opening of a golf course at Trump International Golf Links, which is near Scotland’s coastal city of Aberdeen.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/07/26/trump-golfs-in-scotland-amid-protests-and-epstein-files-backlash-photos/",
    "timestamp": "2025-07-26T17:08:47Z"
  },
  {
    "title": "The rise and fall of John Brennan",
    "description": "In 1980, a graduate student at the University of Texas at Austin saw an ad for the Central Intelligence Agency on a bus. John Brennan decided to apply, thinking that such a job would satisfy his “wanderlust.” This month, the “wanderlust” of John Brennan came …",
    "link": "https://freerepublic.com/focus/f-chat/4330896/posts",
    "timestamp": "2025-07-26T17:07:45Z"
  },
  {
    "title": "The rise and fall of John Brennan",
    "description": "In 1980, a graduate student at the University of Texas at Austin saw an ad for the Central Intelligence Agency on a bus. John Brennan decided to apply, thinking that such a job would satisfy his “wanderlust.” This month, the “wanderlust” of John Brennan came …",
    "link": "https://freerepublic.com/focus/f-news/4330896/posts",
    "timestamp": "2025-07-26T17:07:45Z"
  },
  {
    "title": "DOJ silent on high-profile Epstein links after Maxwell questioning",
    "description": "The notorious pedophile financier’s girlfriend was granted immunity to answer questions for the Department of Justice Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622031-doj-silent-maxwell-questioning/",
    "timestamp": "2025-07-26T17:07:13Z"
  },
  {
    "title": "US Migrant Raids Spark Boom For Private Detention Providers",
    "description": "Donald Trump's promise to carry out the largest deportation operation in US history has appalled some Americans.",
    "link": "https://www.ibtimes.com/us-migrant-raids-spark-boom-private-detention-providers-3779505",
    "timestamp": "2025-07-26T17:06:20Z"
  },
  {
    "title": "US Migrant Raids Spark Boom For Private Detention Providers",
    "description": "Donald Trump's promise to carry out the largest deportation operation in US history has appalled some Americans.",
    "link": "https://www.ibtimes.com.au/us-migrant-raids-spark-boom-private-detention-providers-1859833",
    "timestamp": "2025-07-26T17:06:11Z"
  },
  {
    "title": "If Texas Wants To Play Dirty, Kathy Hochul, Gavin Newsom, And JB Pritzker Are Ready To Get In The Mud",
    "description": "Texas using its 'hey let's do something about flood warnings' special session to cheat like the dickens.",
    "link": "https://www.wonkette.com/p/if-texas-wants-to-play-dirty-kathy",
    "timestamp": "2025-07-26T17:01:48Z"
  },
  {
    "title": "Education Department Will Release Billions in Remaining Withheld Grant Money for Schools",
    "description": "President Donald Trump’s administration had withheld over $6 billion in funding on July 1 as part of a review to ensure spending aligned with the White House’s priorities.",
    "link": "https://www.kqed.org/news/12049944/education-department-will-release-billions-in-remaining-withheld-grant-money-for-schools",
    "timestamp": "2025-07-26T17:00:38Z"
  },
  {
    "title": "Trump Signs Executive Order on College Sports Aimed at Saving Smaller Programs",
    "description": "“Absent guardrails to stop the madness and ensure a reasonable, balanced use of resources across collegiate athletic programs that preserves their educational and developmental benefits, many college sports will soon cease to exist.”\nThe post Trump Signs Exec…",
    "link": "https://legalinsurrection.com/2025/07/trump-signs-executive-order-on-college-sports-aimed-at-saving-smaller-programs/",
    "timestamp": "2025-07-26T17:00:12Z"
  },
  {
    "title": "Trump says Japan will invest $550 billion in US at his direction. It may not be a sure thing",
    "description": "Trump says Japan will invest $550 billion in US at his direction. It may not be a sure thing\nTrump says Japan will invest $550 billion in US at his direction. It may not be a sure thing\nWASHINGTON (AP) — President Donald Trump is bragging that Japan has given…",
    "link": "https://biztoc.com/x/0a42e0a972f44432",
    "timestamp": "2025-07-26T17:00:09Z"
  },
  {
    "title": "Grading the Second Trump Presidency, 6 Months In",
    "description": "Over the course of four years’ banishment to America’s political wilderness while subjected to both a would-be assassin’s bullets and the humiliating and unprecedented spectacle... Read More\nThe post Grading the Second Trump Presidency, 6 Months In appeared f…",
    "link": "https://www.dailysignal.com/2025/07/26/grading-the-second-trump-presidency-six-months-in/",
    "timestamp": "2025-07-26T17:00:00Z"
  },
  {
    "title": "'Great To Be in Scotland': Trump Kicks Off Golf-Filled Getaway",
    "description": "President Donald Trump touched down in Scotland on Friday evening for a private four-day visit, marking his return to a country where he has long-standing personal and business ties.\nTrump arrived at Prestwick Airport shortly before 8:30 p.m. local time and w…",
    "link": "https://biztoc.com/x/80502c54559162a7",
    "timestamp": "2025-07-26T16:59:58Z"
  },
  {
    "title": "No one is above the law",
    "description": "No one, especially the president, is above the law. No one is above the law. Nobody is above the law!",
    "link": "https://freerepublic.com/focus/f-bloggers/4330895/posts",
    "timestamp": "2025-07-26T16:57:41Z"
  },
  {
    "title": "'Make America Gay Again': Amsterdam Pride Gets Political",
    "description": "Thousands of people gathered for Amsterdam Pride march on Saturday in a festive and political mood, stressing the need to defend LGBTQI+ rights increasingly under threat around the world.",
    "link": "https://www.ibtimes.com/make-america-gay-again-amsterdam-pride-gets-political-3779502",
    "timestamp": "2025-07-26T16:57:09Z"
  },
  {
    "title": "Ryan Coogler’s ‘Sinners’ Ends Theatrical Run. How Much Did It Make?",
    "description": "“Sinners,” Ryan Coogler’s hit vampire thriller starring Michael B. Jordan, has ended its run in theaters. How much did the film make at the box office?",
    "link": "https://www.forbes.com/sites/timlammers/2025/07/26/ryan-cooglers-sinners-ends-theatrical-run-how-much-did-it-make/",
    "timestamp": "2025-07-26T16:56:54Z"
  },
  {
    "title": "Biden’s memoir deal falls millions short of Obama, Clinton – media",
    "description": "Former US President Joe Biden has reportedly received much less for his memoirs than his predecessors amid mental decline rumors Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622032-biden-memoir-deal-fall-short/",
    "timestamp": "2025-07-26T16:55:05Z"
  },
  {
    "title": "Third Court This Month Blocks Trump's 'Flagrantly Unconstitutional' Birthright Order",
    "description": "For the third time since the U.S. Supreme Court used the case to limit nationwide injunctions in June, a court has blocked U.S. President Donald Trump's executive order ending birthright citizenship from going into effect. U.S. District Judge Leo Sorokin of M…",
    "link": "https://www.commondreams.org/news/third-court-blocks-birthright-order",
    "timestamp": "2025-07-26T16:46:59Z"
  },
  {
    "title": "Cracks Emerge in G7 Over Macron's Palestine Move",
    "description": "Macron's announcement followed his visit to Egypt's border with Gaza in April where he witnessed the scale of the humanitarian crisis.",
    "link": "https://www.newsweek.com/cracks-emerge-g7-over-macrons-palestine-move-2104529",
    "timestamp": "2025-07-26T16:45:25Z"
  },
  {
    "title": "Anti-Trump Protests Hit Scotland Amid Military Lockdown",
    "description": "Trump is due to meet UK Prime Minister Keir Starmer during his visit to Scotland.",
    "link": "https://www.newsweek.com/anti-trump-protests-hit-scotland-amid-military-lockdown-2104542",
    "timestamp": "2025-07-26T16:42:04Z"
  },
  {
    "title": "DNI Tulsi Gabbard Fires Back at Barack Obama After He Issues a Pathetic Denial of His Treasonous Actions in the Russia Collusion Hoax (VIDEO)",
    "description": "Director of National Intelligence Tulsi Gabbard has responded to Barack Obama’s pathetic attempt to distance himself from his treasonous actions during the Russia Collusion Hoax.\nThe post DNI Tulsi Gabbard Fires Back at Barack Obama After He Issues a Pathetic…",
    "link": "https://www.thegatewaypundit.com/2025/07/dni-tulsi-gabbard-fires-back-barack-obama-after/",
    "timestamp": "2025-07-26T16:40:42Z"
  },
  {
    "title": "Thailand and Cambodia trade fresh attacks and accusations amid calls for a ceasefire",
    "description": "Thailand and Cambodia traded accusations of fresh attacks Saturday as deadly border clashes entered a third day and international pressure mounted for a ceasefire. The fighting has killed at least 33 people and displaced more than 168,000.",
    "link": "https://www.pbs.org/newshour/world/thailand-and-cambodia-trade-fresh-attacks-and-accusations-amid-calls-for-a-ceasefire",
    "timestamp": "2025-07-26T16:40:16Z"
  }
]