[
  {
    "title": "New slogan, same Starmer?",
    "description": "Sky News’ Sam Coates and Poltico’s Anne McElvoy hold their hands up on this episode – to not seeing Keir Starmer’s big defence announcement coming yesterday morning. The plan to shift defence spending to 3% of GDP (and a new Downing Street podium slogan) is a…",
    "link": "https://www.politico.eu/podcast/politics-at-jack-and-sams/new-slogan-same-starmer/",
    "timestamp": "2025-02-26T08:37:38Z"
  },
  {
    "title": "FBI looking into James Comey's off-the-books 'honeypot' operation targeting 2016 Trump campaign (Kerry Picket/Washington Times)",
    "description": "Kerry Picket / Washington Times:\nFBI looking into James Comey's off-the-books ‘honeypot’ operation targeting 2016 Trump campaign  —  New leadership at the FBI is starting an investigation into the origins of the agency's plan a decade ago to infiltrate the ca…",
    "link": "https://www.memeorandum.com/250226/p4",
    "timestamp": "2025-02-26T08:35:00Z"
  },
  {
    "title": "Trump-Backed Byron Donalds Announces Florida Governor Bid, Setting Up Clash With DeSantis",
    "description": "Meanwhile, Florida Governor Ron DeSantis has promoted his wife, Casey, as the potential candidate, setting the stage for a potential showdown between him and Trump.",
    "link": "https://www.ibtimes.com/trump-backed-byron-donalds-announces-florida-governor-bid-setting-clash-desantis-3764920",
    "timestamp": "2025-02-26T08:33:14Z"
  },
  {
    "title": "Trump posts madcap Gaza ‘Riviera’ AI video featuring sunbathing Netanyahu",
    "description": "The clip features a song with the lyrics: \"Donald Trump will set you free, bringing the life for all to see, no more tunnels, no more fear, Trump Gaza is finally here.\"",
    "link": "https://www.politico.eu/article/donald-trump-posts-gaza-riviera-ai-video-sunbathing-benjamin-netanyahu/",
    "timestamp": "2025-02-26T08:32:45Z"
  },
  {
    "title": "Ethereum Tests “Make Or Break” Level, But Altseason Hopes Stay Alive – Details",
    "description": "Ethereum (ETH) has dropped nearly 10% in the past 24 hours, falling from $2,721 on February 24 to $2,313 earlier today. According to crypto analysts, $2,300 is the next critical support level – if ETH fails to hold this level, it could face further losses. Et…",
    "link": "https://bitcoinist.com/ethereum-tests-make-or-break-level-but-altseason-hopes-stay-alive-details/",
    "timestamp": "2025-02-26T08:30:30Z"
  },
  {
    "title": "Modi wants Tesla to build cars in India. Making the plan work may not be easy",
    "description": "Tesla is reportedly recruiting and scouting showroom locations in the country, following a meeting between Prime Minister Modi and  Elon Musk earlier this month.",
    "link": "https://www.cnbc.com/2025/02/26/modi-wants-tesla-to-build-cars-in-india-making-the-plan-work-may-not-be-easy.html",
    "timestamp": "2025-02-26T08:30:01Z"
  },
  {
    "title": "21 federal technology staffers resign rather than help Elon Musk and DOGE slash size of US government",
    "description": "More than 20 civil service employees resigned on Feb 25 from billionaire Trump adviser Elon Musk's Department of Government Efficiency, saying they were refusing to use their technical expertise to \"dismantle critical public services\". Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/02/26/21-federal-technology-staffers-resign-rather-than-help-elon-musk-and-doge-slash-size-of-us-government",
    "timestamp": "2025-02-26T08:30:00Z"
  },
  {
    "title": "Jon Stewart Shares Aftermath of His ‘Daily Show’ Hand Injury",
    "description": "Jon Stewart revealed the aftermath of cutting his hand open during his monologue on 'The Daily Show.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-hand-injury-aftermath-the-daily-show-1235280294/",
    "timestamp": "2025-02-26T08:28:48Z"
  },
  {
    "title": "Taiwan dispatches forces in response to China ‘live-fire’ drills off island",
    "description": "Taiwan dispatched forces on Wednesday in response to China’s “live-fire” drills off the self-ruled island, Taipei’s defence ministry said, condemning the exercises as dangerous. China deployed 32 aircraft around Taiwan as part of a joint combat drill and anno…",
    "link": "https://www.digitaljournal.com/world/taiwan-dispatches-forces-in-response-to-china-live-fire-drills-off-island/article",
    "timestamp": "2025-02-26T08:28:18Z"
  },
  {
    "title": "Hong Kong to slash public spending, build AI institute",
    "description": "Hong Kong will cut public spending and restore fiscal balance by mid-2027 after a string of huge deficits, the city’s finance chief said Wednesday as he unveiled growth plans including an artificial intelligence institute. Officials are under pressure to bala…",
    "link": "https://www.digitaljournal.com/world/hong-kong-to-slash-public-spending-build-ai-institute/article",
    "timestamp": "2025-02-26T08:27:33Z"
  },
  {
    "title": "Trump's First Cabinet Meeting To Include Elon Musk",
    "description": "Despite Elon Musk&#039;s lack of ministerial portfolio or formal decision-making authority, he is classified as a &quot;special government employee&quot; and &quot;senior adviser to the president&quot; by heading DOGE.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-first-cabinet-meeting-to-include-elon-musk-7798390",
    "timestamp": "2025-02-26T08:24:40Z"
  },
  {
    "title": "Canadian Dollar Forecast: USD/CAD Jumps with Trump Tariffs to Hit in April",
    "description": "USD/CAD jumps to a fresh weekly high (1.4366) as US President Donald Trump states that the tariffs for Canada will go into effect on April 2.",
    "link": "https://www.cityindex.com/en-uk/news-and-analysis/canadian-dollar-forecast-usdcad-jumps-with-trump-tariffs-to-hit-in-april-02-26-2025/",
    "timestamp": "2025-02-26T08:20:00Z"
  },
  {
    "title": "Trump orders copper probe in first step to tariffs",
    "description": "Trump orders copper probe in first step to tariffs\nUS President Donald Trump has ordered an investigation of copper imports in what is a first step toward potential tariffs on the metal.\nAdministration officials said the White House wanted to find ways to boo…",
    "link": "https://biztoc.com/x/96cbea078a281411",
    "timestamp": "2025-02-26T08:16:12Z"
  },
  {
    "title": "White House Attacks \"Free Press\", Will Pick Media Who Can Cover Trump",
    "description": "Donald Trump&#039;s spokeswoman Karoline Leavitt said that the independent White House Correspondents&#039; Association (WHCA) would no longer have a &quot;monopoly&quot; on choosing members of the &quot;press pool.&quot;",
    "link": "https://www.ndtv.com/world-news/white-house-attacks-free-press-will-pick-media-who-can-cover-donald-trump-7798328",
    "timestamp": "2025-02-26T08:15:29Z"
  },
  {
    "title": "Michael Lowry and Dáil speaking rights dominate at home as Europe meets on Ukraine",
    "description": "No resolution to Dáil drama weeks into the new term, with more fireworks possible today",
    "link": "https://www.irishtimes.com/politics/2025/02/26/michael-lowry-and-dail-speaking-rights-dominate-at-home-as-europe-meets-on-ukraine/",
    "timestamp": "2025-02-26T08:15:24Z"
  },
  {
    "title": "Pacman Jones Slams White House Boycotts, 'Are You F***ing Kidding Me?'",
    "description": "President Donald Trump is inviting the Philadelphia Eagles to the White House after all ... and Pacman Jones says it would be \"ludicrous\" for players to miss out on the opportunity. TMZ Sports caught up with the former NFL star at LAX on Tuesday --…",
    "link": "https://www.tmz.com/2025/02/26/pacman-jones-white-house-boycotts/",
    "timestamp": "2025-02-26T08:15:04Z"
  },
  {
    "title": "US and Ukraine near an economic deal with mineral rights but no security promise, officials say",
    "description": "Three senior Ukrainian officials say that Ukraine and the U.S. have reached an agreement on a framework for a broad economic deal that would include access to Ukraine's rare earth minerals",
    "link": "https://abcnews.go.com/Business/wireStory/us-ukraine-economic-deal-mineral-rights-security-promise-119188719",
    "timestamp": "2025-02-26T08:14:16Z"
  },
  {
    "title": "Defence secretary denies Trump is reason for UK defence spending boost",
    "description": "Defence Secretary John Healey has denied Donald Trump is the reason UK defence spending is being increased to 2.5% of GDP.",
    "link": "https://news.sky.com/story/defence-secretary-denies-trump-is-reason-for-uk-defence-spending-boost-13317269",
    "timestamp": "2025-02-26T08:11:00Z"
  },
  {
    "title": "U.S. CISA adds Microsoft Partner Center and Synacor Zimbra Collaboration Suite flaws to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds Microsoft Partner Center and Synacor Zimbra Collaboration Suite vulnerabilities to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) …",
    "link": "https://securityaffairs.com/174664/security/u-s-cisa-adds-microsoft-partner-center-and-synacor-zimbra-collaboration-suite-flaws-to-its-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-02-26T08:09:32Z"
  },
  {
    "title": "Over 2.5 Lakh Demand Elon Musk's Canadian Citizenship To Be Revoked",
    "description": "The petition that opened for signatures on February 20 says Elon Musk &quot;has engaged in activities that go against the national interest of Canada.&quot;",
    "link": "https://www.ndtv.com/world-news/over-2-5-lakh-demand-elon-musks-canadian-citizenship-to-be-revoked-7798265",
    "timestamp": "2025-02-26T08:06:31Z"
  },
  {
    "title": "US Companies Could Take a Hit From 'Buy Canadian' Boycott",
    "description": "Canadians are steering clear of American-made products and changing their vacation plans in response to Trump's tariff threats.",
    "link": "https://www.newsweek.com/us-companies-potential-impact-buy-canadian-boycott-2036000",
    "timestamp": "2025-02-26T08:00:01Z"
  },
  {
    "title": "Ukraine’s victory is in the best interest of the United States",
    "description": "The outcome of Ukraine’s war will influence the global struggle between democracy and despotism for decades to come. Opinion.",
    "link": "https://www.israelnationalnews.com/news/404541",
    "timestamp": "2025-02-26T08:00:00Z"
  },
  {
    "title": "Tesla feels the wrath of anti-Elon Musk backlash",
    "description": "The company is showing particular signs of strain in places where its chief executive officer is inserting himself in politics in ways that run counter to Tesla's stated mission and values. Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/02/26/tesla-feels-the-wrath-of-anti-elon-musk-backlash",
    "timestamp": "2025-02-26T08:00:00Z"
  },
  {
    "title": "Survey: What Presidents Really Think",
    "description": "Survey: What Presidents Really Think\n\n \n\n\n \nJosh Moody\n\nWed, 02/26/2025 - 03:00 AM\n\nThe latest Inside Higher Ed Survey of College and University Presidents finds weak support for tenure, high confidence in financial stability and concerns about a lack of prog…",
    "link": "https://www.insidehighered.com/news/governance/executive-leadership/2025/02/26/what-college-presidents-are-thinking-about-2025",
    "timestamp": "2025-02-26T08:00:00Z"
  },
  {
    "title": "Out Now: IHE’s 2025 Survey of College and University Presidents",
    "description": "Inside Higher Ed’s full 2025 Survey of College and University Presidents, conducted with Hanover Research, is out now. The survey picked the brains of 298 presidents of two- and four-year institutions, public and private, on the following timely issues:",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/02/26/out-now-2025-survey-college-and-university-presidents",
    "timestamp": "2025-02-26T08:00:00Z"
  },
  {
    "title": "Analysis: What are Ukraine’s precious minerals and rare earths and why Trump wants them",
    "description": "Without them, the AI race cannot continue and the production of products such as microchips and batteries in mobile phones and tablets, computer monitors and televisions cannot continue.\nThe post Analysis: What are Ukraine’s precious minerals and rare earths …",
    "link": "https://en.protothema.gr/2025/02/26/analysis-what-are-ukraines-precious-minerals-and-rare-earths-and-why-trump-wants-them/",
    "timestamp": "2025-02-26T07:58:00Z"
  },
  {
    "title": "US govt pressures South Korean firms with US$1 billion investment target",
    "description": "Donald Trump, President of the United States, has repeatedly signaled potential tariff increases on semiconductors and possible adjustments to the CHIPS Act subsidies, intensifying pressure on South Korean-based technology corporations such as Samsung Electro…",
    "link": "https://www.digitimes.com/news/a20250226PD231/donald-trump-investment-tariff-chips-act-subsidies.html",
    "timestamp": "2025-02-26T07:57:56Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Dáil ‘not functioning’, Pope Francis still critical and Trump says Zelenskyy will visit White House…",
    "link": "https://www.thejournal.ie/morning-headlines-8-at-8-6633694-Feb2025/",
    "timestamp": "2025-02-26T07:55:13Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed, with Chinese markets gaining after declines on Wall St",
    "description": "Asian shares are mixed, with Chinese markets gaining after Wall Street extended its losses on worries over inflation and tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/stock-market-today-asian-shares-mixed-chinese-markets-119197165",
    "timestamp": "2025-02-26T07:50:18Z"
  },
  {
    "title": "Bitcoin ETFs See Nearly $1 Billion In Outflows As Crypto Market Plunges",
    "description": "For the first time since getting approved, spot Bitcoin ETFs bled out nearly $1 billion on Tuesday, marking the largest single-day outflows in the once very popular offerings.",
    "link": "https://www.ibtimes.com/bitcoin-etfs-see-nearly-1-billion-outflows-crypto-market-plunges-3764926",
    "timestamp": "2025-02-26T07:49:33Z"
  },
  {
    "title": "Thailand Surprises With Rate Cut as Risks to Growth Increase",
    "description": "The Bank of Thailand unexpectedly cut its key interest rate for the first time in four months, acting after disappointing growth data and public calls for lower borrowing costs from both the prime minister and the International Monetary Fund.",
    "link": "https://financialpost.com/pmn/business-pmn/thailand-surprises-with-rate-cut-as-risks-to-growth-increase",
    "timestamp": "2025-02-26T07:46:55Z"
  },
  {
    "title": "CNBC Daily Open: Growing worries over Trump’s policies",
    "description": "The “Trump Bump” — in which stocks and other assets jumped after Donald Trump’s election and inauguration — appears to have leveled off.",
    "link": "https://biztoc.com/x/b438661545e32a58",
    "timestamp": "2025-02-26T07:42:57Z"
  },
  {
    "title": "Is Donald Trump a genius? Indian billionaire reveals gold card US visa could be a $50,000,000,000,000 jackpot",
    "description": "The Trump administration has introduced a $5 million 'gold card' visa program aimed at attracting wealthy investors. This new initiative, which replaces the EB-5 program, is expected to generate substantial revenue for the U.S. and attract high-net-worth indi…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/is-donald-trump-a-genius-indian-billionaire-reveals-gold-card-us-visa-could-be-a-50000000000000-jackpot/articleshow/118574302.cms",
    "timestamp": "2025-02-26T07:39:54Z"
  },
  {
    "title": "War, not peace: The unlikely engine of Europe's economic revival",
    "description": "An era-defining week in geopolitics has heightened hopes for Europe's economic growth, driven not by peace but by significant military rearmament. Amid Washington's surprising talks with Moscow, Europe faces the reality of reduced U.S. military support, neces…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/war-not-peace-the-unlikely-engine-of-europes-economic-revival/articleshow/118574695.cms",
    "timestamp": "2025-02-26T07:38:57Z"
  },
  {
    "title": "Teachers union sues over Trump administration's deadline to end school diversity programs",
    "description": "A new federal lawsuit in Maryland is challenging a Trump administration memo giving the nation’s schools and universities two weeks to eliminate “race-based” practices of any kind or risk losing their federal money",
    "link": "https://abcnews.go.com/Politics/wireStory/teachers-union-sues-trump-administrations-deadline-end-school-119189002",
    "timestamp": "2025-02-26T07:34:19Z"
  },
  {
    "title": "Apple fixing iPhone speech-to-text glitch that interprets 'racist' as 'Trump'",
    "description": "Apple says it is repairing a glitch with its speech-to-text feature on iPhones which interprets the word \"racist\" as \"Trump\" before autocorrecting itself.",
    "link": "https://news.sky.com/story/apple-fixing-bug-in-iphone-speech-to-text-glitch-which-interprets-racist-as-trump-13317255",
    "timestamp": "2025-02-26T07:34:00Z"
  },
  {
    "title": "Trump says Zelenskyy set to visit Washington to sign earth minerals deal",
    "description": "It emerged last night that both countries had agreed on a deal that will see the US jointly develop Ukraine’s mineral wealth.",
    "link": "https://www.thejournal.ie/us-ukraine-trump-zelenskyy-minerals-deal-6633643-Feb2025/",
    "timestamp": "2025-02-26T07:33:21Z"
  },
  {
    "title": "Donald Trump Shares AI Gaza Video Depicting Hotel Built on Strip",
    "description": "The AI-generated video depicts Trump and Israel's Prime Minister Benjamin Netanyahu topless by a hotel pool.",
    "link": "https://biztoc.com/x/6d0351279c0aeb64",
    "timestamp": "2025-02-26T07:32:03Z"
  },
  {
    "title": "CNBC Daily Open: Growing worries over Trump’s policies",
    "description": "The “Trump Bump” — in which stocks and other assets jumped after Donald Trump’s election and inauguration — appears to have leveled off.",
    "link": "https://www.cnbc.com/2025/02/26/cnbc-daily-open-growing-worries-over-trumps-policies.html",
    "timestamp": "2025-02-26T07:30:01Z"
  },
  {
    "title": "More than 250,000 sign petition to strip Elon Musk of Canadian citizenship",
    "description": "The number of people who have signed a petition calling for Elon Musk to lose his Canadian citizenship over his alleged efforts to \"erase\" the nation's sovereignty hit 250,000 on Feb 25. Read full story",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/02/26/more-than-250000-sign-petition-to-strip-elon-musk-of-canadian-citizenship",
    "timestamp": "2025-02-26T07:30:00Z"
  },
  {
    "title": "Trump’s Threat to EV Trucking Rules Undermines Big-Rig Bets",
    "description": "Two years ago, Rudy Diaz made a gutsy bet. The 45-year-old owner of Hight Logistics, a trucking company that hauls containers from the bustling ports around Los Angeles, began adding some of the country’s first electric heavy-duty trucks to his …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/26/813377.htm",
    "timestamp": "2025-02-26T07:28:12Z"
  },
  {
    "title": "Who is Amy Gleason, person named DOGE's acting leader by White House?",
    "description": "Amy Gleason, a health care technology expert who worked in the first Trump administration, has been named acting administrator of the Department of Government Efficiency (DOGE). Gleason's appointment comes amid controversy over DOGE's budget cuts, which have …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/who-is-amy-gleason-person-named-doges-acting-leader-by-white-house/articleshow/118574479.cms",
    "timestamp": "2025-02-26T07:27:34Z"
  },
  {
    "title": "Donald Trump Shares AI Gaza Video Depicting Hotel Built on Strip",
    "description": "The AI-generated video depicts Trump and Israel's Prime Minister Benjamin Netanyahu topless by a hotel pool.",
    "link": "https://www.newsweek.com/donald-trump-gaza-video-hotel-strip-ai-2036292",
    "timestamp": "2025-02-26T07:26:55Z"
  },
  {
    "title": "Tesla feels the wrath of anti-Elon Musk backlash",
    "description": "Tesla is facing a decline in sales and brand loyalty due to Elon Musk's controversial political actions. Customers are increasingly dissatisfied with Musk's behavior, leading to decreased sales in Europe and the US. Alternative electric vehicle brands are gai…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/tesla-feels-the-wrath-of-anti-elon-musk-backlash/articleshow/118574280.cms",
    "timestamp": "2025-02-26T07:23:21Z"
  },
  {
    "title": "BP slashes renewables investment and boosts fossil fuel production",
    "description": "Oil and gas giant BP has again slashed its renewable energy investment and announced more funding for greater fossil fuel production.",
    "link": "https://news.sky.com/story/bp-slashes-renewables-investment-and-boosts-fossil-fuel-production-13317254",
    "timestamp": "2025-02-26T07:23:00Z"
  },
  {
    "title": "BP slashes renewable investment increasing oil and gas production despite pace of global warming",
    "description": "Oil and gas giant BP has again slashed its renewable energy investment and announced more funding for greater fossil fuel production.",
    "link": "https://news.sky.com/story/bp-to-increase-oil-and-gas-investment-despite-pace-of-global-warming-13317254",
    "timestamp": "2025-02-26T07:23:00Z"
  },
  {
    "title": "Sixto: Mexico’s border moves strategic response to Trump",
    "description": "Since Donald Trump’s return to the White House, the United States has returned to a firm stance on border security, emphasizing the need for more vigorous enforcement to combat drug trafficking, illegal migration and other forms of criminal activity.",
    "link": "https://www.bostonherald.com/2025/02/26/sixto-mexicos-border-moves-strategic-response-to-trump/",
    "timestamp": "2025-02-26T07:19:22Z"
  },
  {
    "title": "Latvia FM: Putin will try to achieve in peace talks what he couldn't in Ukraine war — weaken the US",
    "description": "Latvia’s foreign minister is warning that Russian President Vladimir Putin will try to achieve in peace talks what he hasn’t been able to accomplish in his war against Ukraine — weaken the United States and restore control over his smaller neighbor",
    "link": "https://abcnews.go.com/US/wireStory/latvia-fm-putin-achieve-peace-talks-ukraine-war-119196797",
    "timestamp": "2025-02-26T07:10:20Z"
  },
  {
    "title": "Trump shares bizarre AI video of Gaza vision",
    "description": "Donald Trump has shared a bizarre AI-generated video on his Truth Social platform showcasing what appears to be a vision of Gaza under his proposed plan.",
    "link": "https://news.sky.com/story/trump-shares-ai-video-of-gaza-vision-featuring-golden-statues-bearded-belly-dancers-and-netanyahu-on-a-sunbed-13317241",
    "timestamp": "2025-02-26T07:08:00Z"
  },
  {
    "title": "Golden statues, bearded belly dancers and Netanyahu on a sunbed: Trump posts AI video of Gaza vision",
    "description": "Donald Trump has shared a bizarre AI-generated video on his Truth Social social media platform showcasing what appears to be his vision of Gaza under his proposed plan.",
    "link": "https://news.sky.com/story/trump-posts-ai-video-of-gaza-vision-featuring-golden-statues-bearded-belly-dancers-and-netanyahu-on-a-sunbed-13317241",
    "timestamp": "2025-02-26T07:08:00Z"
  },
  {
    "title": "Trump says US could lift Russia sanctions",
    "description": "US President Donald Trump says Washington could lift sanctions on Russia as part of the Ukraine peace process Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613317-trump-us-sanctions-russia/",
    "timestamp": "2025-02-26T07:07:44Z"
  },
  {
    "title": "Even Germany is Gaullist now. Well done, Trump",
    "description": "German indecision over European defense is shifting as Friedrich Merz's incoming coalition in Berlin calls for deeper Euro integration. Merz's €200 billion defense spending proposals signal a potential Franco-German grand bargain, crucial amid US diplomatic u…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/even-germany-is-gaullist-now-well-done-trump/articleshow/118573926.cms",
    "timestamp": "2025-02-26T07:07:22Z"
  },
  {
    "title": "The IMF and World Bank Await Elon Musk",
    "description": "The World Bank’s economists and top administrators are among the highest paid financial functionaries in the world, which explains the reason why the Bank is a major cause of the brain drain from developing countries: a great number of highly trained economis…",
    "link": "https://www.counterpunch.org/2025/02/26/the-imf-and-world-bank-await-elon-musk/",
    "timestamp": "2025-02-26T07:01:26Z"
  },
  {
    "title": "'Bats**t Lunacy': Trump Called Out After Posting Truly Bizarre 'What's Next' Video",
    "description": "The president's midnight message has critics asking: WTF?",
    "link": "https://www.huffpost.com/entry/trump-gaza-future-video_n_67bea7d3e4b0d509934aa5b2",
    "timestamp": "2025-02-26T07:00:42Z"
  },
  {
    "title": "Tánaiste to convene inaugural meeting of trade body set up in response to Trump tariff threat",
    "description": "The creation of this body is part of the Government’s efforts at ensuring Ireland is ‘well placed to withstand any potential trade shocks’.",
    "link": "https://www.thejournal.ie/tanaiste-to-convene-inaugural-meeting-of-trade-body-set-up-in-response-to-trump-6633587-Feb2025/",
    "timestamp": "2025-02-26T07:00:41Z"
  },
  {
    "title": "Trump Mocked for Bizarre ‘Trump Gaza’ Video With Bearded Belly Dancers: ‘Looks Pretty Woke to Me’ | Video",
    "description": "Trump shared the apparently AI-generated clip despite the fact it also depicts him as extremely fat\nThe post Trump Mocked for Bizarre ‘Trump Gaza’ Video With Bearded Belly Dancers: ‘Looks Pretty Woke to Me’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-mocked-for-sharing-bizarre-video-with-bearded-bellydancers/",
    "timestamp": "2025-02-26T06:58:08Z"
  },
  {
    "title": "Bending The Arc of the Moral Universe Toward Justice",
    "description": "Today, racism remains a poisonous force in America. Fascism and authoritarianism are on the rise and President Donald Trump is giving voice to such hate, making it state policy and central to his presidential agenda. Recently, he tried to ban birthright citiz…",
    "link": "https://www.counterpunch.org/2025/02/26/bending-the-arc-of-the-moral-universe-toward-justice/",
    "timestamp": "2025-02-26T06:56:42Z"
  },
  {
    "title": "“Only the People Can Save the People,” Say Migrant Workers",
    "description": "When the Eaton Fire began on January 7, 2025, in Altadena, California, it blazed through residential neighborhoods, destroying thousands of family homes. On the morning of January 8, as businesses burned on North Lake Avenue, a group of migrant workers met 2 …",
    "link": "https://www.counterpunch.org/2025/02/26/only-the-people-can-save-the-people-say-migrant-workers/",
    "timestamp": "2025-02-26T06:55:54Z"
  },
  {
    "title": "US, Ukraine near minerals deal",
    "description": "The United States and Ukraine have a framework deal in place for a joint fund to reinvest revenue from Ukrainian natural resources, according to officials familiar with the negotiations.\n\n\nThe plan would include investing 50% of proceeds from Ukraine’s minera…",
    "link": "https://www.voanews.com/a/us-ukraine-near-minerals-deal/7988464.html",
    "timestamp": "2025-02-26T06:52:13Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events – day 1,098",
    "description": "Here are the key developments on the 1,098th day of Russia’s full-scale invasion of Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/2/26/russia-ukraine-war-list-of-key-events-day-1098",
    "timestamp": "2025-02-26T06:50:34Z"
  },
  {
    "title": "Trump Announces $5M Gold Card – How To Buy US Citizenship Through The New Immigration Scheme",
    "description": "President Trump has announced a new immigration program with a direct pathway to becoming an American citizen, but it's only for \"high-level\" people with funds available to purchase what he called the \"Gold Card.\"",
    "link": "https://www.ibtimes.com/trump-announces-5m-gold-card-how-buy-us-citizenship-through-new-immigration-scheme-3764918",
    "timestamp": "2025-02-26T06:49:49Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed, with Chinese markets gaining after declines on Wall St",
    "description": "Asian shares are mixed, with Chinese markets gaining after Wall Street extended its losses on worries over inflation and tariffs.",
    "link": "https://www.clickondetroit.com/business/2025/02/26/stock-market-today-asian-shares-are-mixed-with-chinese-markets-gaining-after-declines-on-wall-st/",
    "timestamp": "2025-02-26T06:37:33Z"
  },
  {
    "title": "Asian stocks rise on Hong Kong tech boost",
    "description": "Hong Kong stocks resumed their impressive start to the year on Wednesday as they rocketed more than three per cent on the back of a surge in tech firms fuelled by fresh optimism over the sector in China. The rally led gains across most of Asia’s markets, with…",
    "link": "https://punchng.com/asian-stocks-rise-on-hong-kong-tech-boost/",
    "timestamp": "2025-02-26T06:36:18Z"
  },
  {
    "title": "EU launches Clean Industrial Deal to overhaul energy sector",
    "description": "The Clean Industrial Deal will support renewable energy sources within the European Union. The EU is facing cheaper competition from abroad and the threat of US tariffs.",
    "link": "https://www.dw.com/en/eu-launches-clean-industrial-deal-to-overhaul-energy-sector/a-71750700",
    "timestamp": "2025-02-26T06:33:00Z"
  },
  {
    "title": "Private US company set for second Moon landing attempt",
    "description": "Washington (AFP) Feb 26, 2025\n\n\n Intuitive Machines made history last year as the first private company to put a robot on the Moon, although the triumph was marred by the lander tipping onto its side. \n\nNow, the Houston-based firm is gearing up for a second a…",
    "link": "https://www.moondaily.com/reports/Private_US_company_set_for_second_Moon_landing_attempt_999.html",
    "timestamp": "2025-02-26T06:31:04Z"
  },
  {
    "title": "윤석열, 김건희실과 국민의힘 \"싸이코패스 의심\"",
    "description": "South Korea’s impeached President Yoon Suk Yeol will get his last chance to defend himself before judges as they wrap up a trial to decide whether to permanently remove him from office for his ill-fated martial law declaration https://t.co/sGdgIJiXNd— Bloombe…",
    "link": "https://ryueyes11.tistory.com/511505",
    "timestamp": "2025-02-26T06:31:03Z"
  },
  {
    "title": "Meta Must Face Lawsuit Claiming it Prefers Cheaper Foreign Workers",
    "description": "A federal judge on Tuesday said Meta Platforms must face a lawsuit claiming that the Facebook and Instagram parent prefers to hire foreign workers because it can pay them less than American workers. U.S. Magistrate Judge Laurel Beeler in San …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/26/813331.htm",
    "timestamp": "2025-02-26T06:30:58Z"
  },
  {
    "title": "GitVenom campaign targets gamers and crypto investors by posing as fake GitHub projects",
    "description": "GitVenom malware campaign targets gamers and crypto investors by posing as open-source projects on GitHub. Kaspersky researchers warn of a malware campaign, dubbed GitVenom, targeting GitHub users. The threat actors behind this campaign created hundreds of fa…",
    "link": "https://securityaffairs.com/174651/malware/gitvenom-campaign-targets-gamers-and-crypto-investors.html",
    "timestamp": "2025-02-26T06:27:27Z"
  },
  {
    "title": "Trump says Zelensky to sign 'very big agreement' in US on Friday - live updates",
    "description": "\"We've been able to make a deal where we're going to get our money back, and we're going to get a lot of money in the future,\" Trump says.",
    "link": "https://www.bbc.co.uk/news/live/cvg1402yyvet",
    "timestamp": "2025-02-26T06:26:59Z"
  },
  {
    "title": "Trump to convene first cabinet meeting, including Musk",
    "description": "President Trump, after returning to office, is set to hold his first Cabinet meeting to further his agenda. Key figures like advisor Elon Musk and controversial members like Health Secretary Robert F. Kennedy Jr. will attend. The Senate has confirmed most pic…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-convene-first-cabinet-meeting-including-musk/articleshow/118573327.cms",
    "timestamp": "2025-02-26T06:25:52Z"
  },
  {
    "title": "Keir Starmer to meet Donald Trump in Washington as Kyiv and US agree minerals deal",
    "description": "British prime minister Keir Starmer will fly to the USA on Wednesday ahead of crunch talks with Donald Trump, as the Chancellor urged European allies to follow the UK in raising defence spending.",
    "link": "https://www.independent.ie/world-news/europe/keir-starmer-to-meet-donald-trump-in-washington-as-kyiv-and-us-agree-minerals-deal/a703789366.html",
    "timestamp": "2025-02-26T06:25:00Z"
  },
  {
    "title": "'No more tunnels, no more fears': Trump shares 'Trump Gaza' vision in AI video",
    "description": "A song can be heard featuring the lyrics, \"Donald Trump will set you free, bringing the life for all to see, no more tunnels, no more fear, Trump's Gaza is finally here.\"",
    "link": "https://www.jpost.com/israel-news/article-843779",
    "timestamp": "2025-02-26T06:24:14Z"
  },
  {
    "title": "Apple’s iPhone Dictation Bug Confuses ‘Racist’ with ‘Trump’",
    "description": "Apple's iPhone dictation system has encountered a bug where it temporarily transcribes the word \"racist\" as \"Trump\" before correcting itself. This issue was reported by many iPhone users and confirmed by The New York Times.\n\n\n\nAn Apple spokeswoman attributed …",
    "link": "https://www.macobserver.com/news/apples-iphone-dictation-bug-confuses-racist-with-trump/",
    "timestamp": "2025-02-26T06:22:34Z"
  },
  {
    "title": "Trump floats $5 million 'gold card' as a route to US citizenship",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump on Tuesday floated the idea of replacing a visa program for foreign investors with a so-called \"gold card\" that could be bought for $5 million as a route to American citizenship. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/26/trump-floats-5-million-039gold-card039-as-a-route-to-us-citizenship",
    "timestamp": "2025-02-26T06:22:00Z"
  },
  {
    "title": "Musk\u0092s own AI censored",
    "description": "Grok, the AI assistant made by Elon [Roman Salute] Musk\u0092s artificial intelligence firm, was programmed not to use sources that said he and his bestie Donald [Hamburger Eating Surrender Monkey] Trump was responsible for spreading...",
    "link": "http://www.madshrimps.be/news/item/237122",
    "timestamp": "2025-02-26T06:14:32Z"
  },
  {
    "title": "Trump to sell 'gold card' US visas for $5 million",
    "description": "U.S. President Donald Trump has unveiled plans to sell new \"gold card\" residency permits for a price of $5 million each and said Russian oligarchs may be eligible.",
    "link": "https://www.hurriyetdailynews.com/trump-to-sell-gold-card-us-visas-for-5-million-206262",
    "timestamp": "2025-02-26T06:13:44Z"
  },
  {
    "title": "Cabinet officials caught off guard and frustrated by Musk’s directives to federal employees - CNN",
    "description": "Cabinet officials caught off guard and frustrated by Musk’s directives to federal employeesCNN February 25, 2025: Donald Trump presidency newsCNN Less than half of the federal workforce has responded to DOGE's 'what did you do' productivity emailYahoo Musk fi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176547725",
    "timestamp": "2025-02-26T06:13:35Z"
  },
  {
    "title": "Monica Lewinsky vows to reclaim the 'future that had been taken from me' in Call Her Daddy appearance",
    "description": "Monica Lewinsky spoke out about having 'lost her future' after becoming notoriously famous for her affair with Bill Clinton during an appearance on Call Her Daddy. The chat with host Alex Cooper, which will go live Wednesday, delves into what Lewinsky experie…",
    "link": "https://freerepublic.com/focus/f-chat/4300535/posts",
    "timestamp": "2025-02-26T06:08:17Z"
  },
  {
    "title": "Trump tariff turmoil casts a shadow over G-20 meeting",
    "description": "Global finance ministers and central bankers are convening in South Africa amid significant geopolitical turmoil and economic uncertainty. The Trump administration’s trade policies, including tariffs on Chinese imports and potential tariffs on Mexico, Canada,…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tariff-turmoil-casts-a-shadow-over-g-20-meeting/articleshow/118572863.cms",
    "timestamp": "2025-02-26T06:07:35Z"
  },
  {
    "title": "How the Zelensky-Trump deal for Ukraine’s natural resources was done – Express procedures in Kiev to get the signatures",
    "description": "The US president has argued that the deal would bring billions of dollars in revenue for his country - The final draft did not include a key US requirement\nThe post How the Zelensky-Trump deal for Ukraine’s natural resources was done – Express procedures in K…",
    "link": "https://en.protothema.gr/2025/02/26/how-the-zelensky-trump-deal-for-ukraines-natural-resources-was-done-express-procedures-in-kiev-to-get-the-signatures/",
    "timestamp": "2025-02-26T06:05:05Z"
  },
  {
    "title": "So far the grotesque reality of Trump’s ambitions has exceeded all the worst predictions",
    "description": "Trump’s hardly concealed hatred for the EU has not really had a chance to manifest itself yet",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/so-far-the-grotesque-reality-of-trumps-ambitions-has-exceeded-all-the-worst-predictions/",
    "timestamp": "2025-02-26T06:05:00Z"
  },
  {
    "title": "SEC Acknowledges Grayscale's Revised Staking Proposal for its Ethereum ETF",
    "description": "The NYSE Arca filing details how the SEC could allow Grayscale's Ethereum funds to earn staking rewards while maintaining custody safeguards.",
    "link": "https://decrypt.co/307783/sec-acknowledges-grayscales-revised-staking-proposal-for-its-ethereum-etf",
    "timestamp": "2025-02-26T06:03:35Z"
  },
  {
    "title": "America is suffering from an epidemic of mass cowardice",
    "description": "The US is not yet a fascist society, but acting as if it is risks becoming a self-fulfilling prophecy",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/america-is-suffering-from-an-epidemic-of-mass-cowardice/",
    "timestamp": "2025-02-26T06:00:52Z"
  },
  {
    "title": "Kathy Sheridan: Zelenskiy embodies the sacrifice of his people",
    "description": "Ukrainian leader has offered to step down in exchange for Nato membership or if it brings peace",
    "link": "https://www.irishtimes.com/opinion/2025/02/26/never-has-the-contrast-between-zelenskiys-spirit-and-trumps-snarling-ego-been-more-apparent/",
    "timestamp": "2025-02-26T06:00:52Z"
  },
  {
    "title": "Top Ryder Cup official warns hotels on price gouging ahead of 2027 tournament",
    "description": "Alan Evans notes prices already ‘elevated’ for  upcoming tournament",
    "link": "https://www.irishtimes.com/business/2025/02/26/top-ryder-cup-official-warns-hotels-on-price-gouging-ahead-of-2027-tournament/",
    "timestamp": "2025-02-26T06:00:01Z"
  },
  {
    "title": "From prisoner to pardon czar: Alice Johnson’s historic appointment signals a new era in criminal justice reform",
    "description": "President Donald Trump appointed Alice Johnson, a 69-year-old former inmate, as the nation’s first-ever “pardon czar.” Johnson will advise the president on clemency cases and offer recommendations for individuals deserving a second chance. Her journey from in…",
    "link": "https://www.naturalnews.com/2025-02-26-trump-appoints-alice-johnson-as-pardon-czar.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Mike Adams backs Trump and Muskâ\u0080\u0099s bold plan, calls for swift action",
    "description": "Health Ranger Mike Adams endorses Trump and Musk, urging them to keep fighting against corruption and remain relentless in exposing the deep state, ensuring a positive future. Adams views the current political moment as a once-in-a-lifetime opportunity to dis…",
    "link": "https://www.naturalnews.com/2025-02-26-mike-adams-backs-trump-and-musks-bold-plan.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Zelensky’s explosive outburst at Trump official signals growing tensions over Ukraine aid",
    "description": "Ukrainian President Zelensky clashed with U.S. Treasury Secretary Scott Bessent over a deal granting the U.S. 50% of Ukraine’s mineral resources in exchange for security guarantees. The confrontation strained U.S.-Ukraine relations, with the Trump administrat…",
    "link": "https://www.naturalnews.com/2025-02-26-zelensky-outburst-trump-official-ukraine.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Putin offers rare earth minerals deal to U.S. amid Ukraine war tensions",
    "description": "Putin proposes U.S.-Russia joint mining ventures for rare earth minerals in Russia and Russian-occupied Ukraine. The offer counters Trump’s push to access Ukraine’s mineral wealth, which Zelensky resists. Putin highlights Russia’s vast rare earth reserves and…",
    "link": "https://www.naturalnews.com/2025-02-26-putin-rare-earth-minerals-ukraine.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "The new Iron Curtain: How Europeâ\u0080\u0099s speech crackdown threatens American freedoms",
    "description": "The American Center for Law and Justice (ACLJ) has warned that Americans could face arrest in the U.K. for social media posts deemed as “hate speech.” U.K.’s broad and vague “hate speech” laws now apply to Americans who post content while in the U.S., threate…",
    "link": "https://www.naturalnews.com/2025-02-26-europes-speech-crackdown-threatens-american-freedoms.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Lefties losing it: Unhinged liberal pundits have complete meltdowns over the firing of the TDS infected, racist MSNBC host Joy Reid",
    "description": "Liberal media is having a very difficult start of 2025, first being shown their dwindling influence with President Trump’s win against Kamala Harris in the November 2024 presidential election, despite how hard they all tried to “influence” the election result…",
    "link": "https://www.naturalnews.com/2025-02-26-liberal-pundits-complete-meltdowns-firing-joy-reid.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Is Fort Knoxâ\u0080\u0099s gold still there? Trump backs DOGE effort to find out",
    "description": "President Trump supports an audit of Fort Knox’s gold reserves, led by Elon Musk and DOGE, amid concerns over transparency and the lack of yearly audits. Fort Knox holds over 8,100 tonnes of gold, valued at $425 billion, but has only been opened to unauthoriz…",
    "link": "https://www.naturalnews.com/2025-02-26-fort-knox-gold-doge-effort-find-out.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Border crossings DROP BY 94% under Trump’s tough immigration policies",
    "description": "Illegal crossings at the U.S.-Mexico border have dropped by 94 percent since President Donald Trump took office, with daily apprehensions falling from 4,800 to fewer than 300. The second Trump administration replaced Biden-era policies like “catch and release…",
    "link": "https://www.naturalnews.com/2025-02-26-border-crossings-huge-drop-trump-immigration-policies.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s policies strike a chord: Approval soars as America First agenda gains momentum",
    "description": "President Trump’s approval rating has surpassed 50%, marking a significant increase in support for his America First agenda, including border security and tariffs. Trump’s policies on border control and traditional values have garnered widespread support, wit…",
    "link": "https://www.naturalnews.com/2025-02-26-trumps-approval-soars-america-first-agenda-gains-momentum.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Trump pushes for Keystone XL Pipeline revival, citing energy independence",
    "description": "President Trump urges the revival of the Keystone XL Pipeline, calling it a vital step for American energy independence. The $9 billion project, which was canceled by Biden in 2021, faced years of political and environmental opposition. TC Energy, the origina…",
    "link": "https://www.naturalnews.com/2025-02-26-trump-pushes-keystone-pipeline.html",
    "timestamp": "2025-02-26T06:00:00Z"
  },
  {
    "title": "Apple announces $500 billion U.S. investment, including Texas AI server facility, amid Trump tariff pressure",
    "description": "Apple commits to a $500 billion U.S. investment, including a 250,000-square-foot AI server facility in Houston and 20,000 new jobs. The move aligns with Trump’s “America First” agenda and responds to 10% tariffs on Chinese imports. The Houston facility, devel…",
    "link": "https://www.naturalnews.com/2025-02-26-apple-investment-texas-facility-trump-tariff.html",
    "timestamp": "2025-02-26T06:00:00Z"
  }
]