[
  {
    "title": "Jerome Powell’s Two Unique Strengths, According to His Old Boss",
    "description": "The well-respected Fed chair worked at the Carlyle Group under David Rubenstein for eight years before returning to public service.",
    "link": "https://observer.com/2025/04/david-rubenstein-interview-jerome-powell/",
    "timestamp": "2025-04-28T20:30:27Z"
  },
  {
    "title": "Karl Rove Guts Donald Trump in Scathing Fox News Interview: 'In Very Bad Shape' (Corbin Bolies/The Daily Beast)",
    "description": "Corbin Bolies / The Daily Beast:\nKarl Rove Guts Donald Trump in Scathing Fox News Interview: ‘In Very Bad Shape’  —  RAPID FAIL  —  The former adviser to former Vice President Dick Cheney said Americans no longer trust the president on the economy.  —  Fox Ne…",
    "link": "https://www.memeorandum.com/250428/p99",
    "timestamp": "2025-04-28T20:30:01Z"
  },
  {
    "title": "Thailand to navigate a shifting world",
    "description": "The Thai negotiating delegation's failure to meet with their American counterparts last week in Washington, DC, confirmed that Thailand is a low-priority country for the US. That should be a wake-up call for the Paetongtarn government -- the relationship betw…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3013490/thailand-to-navigate-a-shifting-world",
    "timestamp": "2025-04-28T20:30:00Z"
  },
  {
    "title": "Columbus Day 2025: When Is the Federal Holiday?",
    "description": "Donald Trump announced that he plans to bring back Columbus Day, the day commemorating Christopher Columbus’ arrival in the Americas. Learn more about what he said, the federal holiday, and when the day is set to take place below.",
    "link": "https://hollywoodlife.com/feature/columbus-day-2025-5414486/",
    "timestamp": "2025-04-28T20:28:14Z"
  },
  {
    "title": "Trump accidently 'butt dialed' reporter in dead of night",
    "description": "President Donald Trump spoke with reporters from The Atlantic, but according to Ashley Parker and Michael Scherer, Trump had two accidental conversations after 1 a.m. in the morning. \"I should just say it was two conversations and actually one late night, 1:2…",
    "link": "https://www.rawstory.com/trump-butt-dial/",
    "timestamp": "2025-04-28T20:27:05Z"
  },
  {
    "title": "Is Mark Carney Canada’s Answer to Donald Trump?",
    "description": "Tariffs could drive down GDP, but Canada has its own leverage against the U.S.",
    "link": "http://foreignpolicy.com/2025/04/28/canada-answer-trump-ones-and-tooze-mark-carney-elections/",
    "timestamp": "2025-04-28T20:25:41Z"
  },
  {
    "title": "Watch Live: Donald Trump Hosts the Philadelphia Eagles at the White House",
    "description": "President Donald Trump hosts the Super Bowl champion Philadelphia Eagles at the White House on Monday, April 28.\nThe post Watch Live: Donald Trump Hosts the Philadelphia Eagles at the White House appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/04/28/watch-live-donald-trump-hosts-the-philadelphia-eagles-at-the-white-house/",
    "timestamp": "2025-04-28T20:25:11Z"
  },
  {
    "title": "White House Correspondents Dinner Weekend Was the Death Knell for Traditional D.C. Media",
    "description": "As networks and newspapers give way to newsletters and creators, one longtime reporter summed it up nicely: \"This is the year where the transition feels real\"",
    "link": "http://www.rollingstone.com/culture/culture-features/trump-era-white-house-correspondents-dinner-1235326699/",
    "timestamp": "2025-04-28T20:25:02Z"
  },
  {
    "title": "Read The Atlantic's Interview With Donald Trump (Jeffrey Goldberg/The Atlantic)",
    "description": "Jeffrey Goldberg / The Atlantic:\nRead The Atlantic's Interview With Donald Trump  —  A conversation with the president about executive power, Signalgate, and 24-karat gold  —  Editor's Note: Read The Atlantic's related cover story, “'I Run the Country and the…",
    "link": "https://www.memeorandum.com/250428/p97",
    "timestamp": "2025-04-28T20:25:01Z"
  },
  {
    "title": "Trump pushed out AI experts despite saying he wants to advance AI",
    "description": "Despite saying publicly he wants the U.S. to be a leader in artificial intelligence, President Donald Trump forced out scores of recently hired AI experts in his first few months in office, according to a report Monday.Read more...",
    "link": "https://qz.com/trump-artificial-intelligence-experts-fired-time-1851778188",
    "timestamp": "2025-04-28T20:25:00Z"
  },
  {
    "title": "Wagyu beef producer confident about exports despite Trump tariff threat",
    "description": "Australia's wagyu beef industry is poised for export growth amid America's falling beef herd numbers and continued demand for Australia's premium meat in global markets.",
    "link": "https://www.abc.net.au/news/rural/2025-04-29/wagyu-beef-industry-says-outlook-is-strong-despite-tariff-threat/105222532",
    "timestamp": "2025-04-28T20:24:41Z"
  },
  {
    "title": "These are the economic challenges Canada's next Prime Minister must tackle first",
    "description": "Whoever wins the election will have their work cut out for them, but these five challenges will be high on the priority list. Read here",
    "link": "https://financialpost.com/federal_election/economic-challenges-canadas-next-prime-minister-must-tackle",
    "timestamp": "2025-04-28T20:24:39Z"
  },
  {
    "title": "Government is the only reason milk isn’t dangerous. That’s set to change.",
    "description": "Reuters reported that the FDA “is suspending a quality control program for testing of fluid milk and other dairy products due to reduced capacity in its food safety and nutrition division.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/rfk-jr-fda-food-inspection-milk-regulations-rcna202579",
    "timestamp": "2025-04-28T20:23:48Z"
  },
  {
    "title": "Cost of DOGE cuts appear to wipe out most of agency’s reported ‘savings’",
    "description": "Three months after being formed, the Department of Government Efficiency (DOGE) may not be living up to its name, according to the New York Times.\nThe agency, created via executive order by President Donald Trump in January, has been tasked with slashing the …",
    "link": "https://biztoc.com/x/ed8b6f51f01296e5",
    "timestamp": "2025-04-28T20:23:48Z"
  },
  {
    "title": "Trump appoints Hegseth, Noem to FEMA Review Council",
    "description": "United States President Donald Trump announced on Monday that US Secretary of Defense Pete Hegseth and US Secretary of Homeland Security Kristi Noem, among others, will be appointed to the council he ...",
    "link": "https://biztoc.com/x/9b2715f248a62c2e",
    "timestamp": "2025-04-28T20:23:46Z"
  },
  {
    "title": "Rob Manfred says he discussed Pete Rose's status with Donald Trump and will rule on reinstatement",
    "description": "Baseball Commissioner Rob Manfred said he discussed Pete Rose with President Donald Trump at a meeting two weeks ago and he plans to rule on a request to end the sport's permanent ban of the career hits leader, who died in September. Speaking Monday at a meet…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_940a511e-5bfd-419d-9e7e-9eeb7eeee144",
    "timestamp": "2025-04-28T20:21:50Z"
  },
  {
    "title": "Right-Wing Canadian Candidate Begs Trump to Stop Meddling in Election",
    "description": "The leader of Canada’s Conservative Party is begging Donald Trump to stop weighing in on the country’s politics as it holds elections Monday, posting in English and French on X that Trump “should stay out of our election.”\r\n“The only people who will decide th…",
    "link": "https://newrepublic.com/post/194506/canada-conservative-candidate-poilievre-trump-election",
    "timestamp": "2025-04-28T20:21:10Z"
  },
  {
    "title": "Microsoft says U.S. can't afford falling behind China in quantum computers",
    "description": "\"Simply put, the United States cannot afford to fall behind, or worse, lose the race entirely.\"",
    "link": "https://www.cnbc.com/2025/04/28/microsoft-says-us-cant-risk-losing-quantum-computer-lead-to-china.html",
    "timestamp": "2025-04-28T20:20:29Z"
  },
  {
    "title": "Trump to crush sanctuary cities shielding illegal aliens",
    "description": "President Donald Trump is expected to sign an executive order on Monday afternoon that would further crack down on sanctuary cities shielding illegal aliens from federal law enforcement officers.Early Monday morning, press secretary Karoline Leavitt announced…",
    "link": "https://www.theblaze.com/news/trump-to-crush-sanctuary-cities-shielding-illegal-aliens",
    "timestamp": "2025-04-28T20:20:00Z"
  },
  {
    "title": "American Businesses Rally Behind President Trump’s Tariffs to Save Manufacturing",
    "description": "President Donald J. Trump’s decisive trade policies are igniting a resurgence in American manufacturing — earning fervent support from family-owned businesses and others nationwide who have suffered from decades of unfair trade practices. From steel forges to…",
    "link": "https://freerepublic.com/focus/f-news/4313836/posts",
    "timestamp": "2025-04-28T20:19:47Z"
  },
  {
    "title": "US Postal Service Changes Mail Prices for This Summer",
    "description": "Profit losses have caused the USPS to switch up its pricing and packaging policies under the Trump administration as a way to reduce financial costs.",
    "link": "https://www.newsweek.com/us-postal-services-changes-mail-prices-summer-2065279",
    "timestamp": "2025-04-28T20:19:11Z"
  },
  {
    "title": "'Hopes collapsed in a moment': How Trump's immigration crackdown has changed lives",
    "description": "On the campaign trail Donald Trump promised the biggest mass deportation operation in history, railing against illegal immigration and pledging a crackdown on numbers of people crossing the southern border.",
    "link": "https://news.sky.com/story/donald-trumps-immigration-crackdown-has-changed-lives-13357837",
    "timestamp": "2025-04-28T20:17:00Z"
  },
  {
    "title": "'Heads on pikes': Karoline Leavitt disgusts onlookers with immigrant trophy video",
    "description": "The Trump White House is under fire after Press Secretary Karoline Leavitt posted a video showing lawn signs lining the White House driveway, bearing the photos of allegedly undocumented immigrants, the charges against them, and the word “ARRESTED” in bold, c…",
    "link": "https://www.rawstory.com/karoline-leavitt-2671858560/",
    "timestamp": "2025-04-28T20:16:51Z"
  },
  {
    "title": "Cramer becomes increasingly bullish on Boeing after adding the stock to the Bullpen",
    "description": "Boeing shares should soar \"higher and higher,\" Jim Cramer said Monday.",
    "link": "https://www.cnbc.com/2025/04/28/cramer-becomes-increasingly-bullish-on-boeing-after-adding-the-stock-to-the-bullpen.html",
    "timestamp": "2025-04-28T20:15:00Z"
  },
  {
    "title": "Judge snaps at DOJ lawyer arguing Trump executive order targeting Big Law firm can't be illegal",
    "description": "President Donald Trump has issued a series of executive orders targeting law firms he doesn't like.\nChip Somodevilla/Getty Images\nA federal judge appeared impatient with a DOJ lawyer defending a Trump Big Law executive order.\nJenner & Block asked a judge to p…",
    "link": "https://biztoc.com/x/2705d85006752e57",
    "timestamp": "2025-04-28T20:13:06Z"
  },
  {
    "title": "100 days of Trump: US faces dramatic transformation",
    "description": "Republican Donald Trump has been US president for 100 days. Which of his promises has he kept? And what do Americans think about their country in transition?",
    "link": "https://www.dw.com/en/donald-trump-100-days-presidency-us-economy-tariffs-migration-inflation-ukraine/a-72369565",
    "timestamp": "2025-04-28T20:13:00Z"
  },
  {
    "title": "Jalen Hurts snubs Donald Trump: Why did the Eagles QB reject the White House invitation?",
    "description": "The White House reception is one of the most anticipated moments for the champions of US professional sports leagues. However, the event is not without controversy, as evidenced by",
    "link": "https://www.marca.com/en/nfl/philadelphia-eagles/2025/04/28/680fdf11268e3e8f698b459e.html",
    "timestamp": "2025-04-28T20:12:47Z"
  },
  {
    "title": "Thanedar Introduces 7 Articles of Impeachment Against Trump to Halt 'Authoritarian Power Grab'",
    "description": "Faced with two primary challengers and growing public support for impeaching U.S. President Donald Trump a historic third time, Congressman Shri Thanedar on Monday filed seven articles of impeachment against the second-term Republican.\n\n\"Donald Trump has repe…",
    "link": "https://www.commondreams.org/news/impeachment-trump-2025",
    "timestamp": "2025-04-28T20:12:06Z"
  },
  {
    "title": "Trump Assures Nation That Pete Hegseth Will Eventually ‘Get It Together’",
    "description": "Donald Trump told The Atlantic that Defense Secretary Pete Hegseth will \"get it together\" as the Pentagon is wracked with scandal and dysfunction.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-pete-hegseth-get-it-together-1235326840/",
    "timestamp": "2025-04-28T20:11:08Z"
  },
  {
    "title": "'Give me a break!' Bush-appointed judge signals Trump poised to get stinging court blow",
    "description": "A federal judge appointed by former President George W. Bush signaled Monday that he may go further than any court yet in striking down President Donald Trump’s executive orders aimed at major law firms, according to a report in All Rise News.Portions of Trum…",
    "link": "https://www.rawstory.com/trump-law-firms-2671858416/",
    "timestamp": "2025-04-28T20:11:04Z"
  },
  {
    "title": "Man accused of stealing from Homeland Sec. Noem hit with federal charges in three robberies",
    "description": "Homeland Security Secretary Kristi Noem was under Secret Service protection when a man walked into a D.C. restaurant and stole her purse from under a table.",
    "link": "https://www.cnbc.com/2025/04/28/immigrant-kristi-noem-hit-arrested-federal-washington.html",
    "timestamp": "2025-04-28T20:10:52Z"
  },
  {
    "title": "'I Had A Talk With Him': Inside President Trump's Secret Meeting With Defense Secretary Pete Hegseth Following Mounting Scrutiny and Calls For Him To Be 'FIRED Immediately'",
    "description": "Donald Trump huddled with embattled Defense Secretary Pete Hegseth and insisted he's confident he will 'get it together' after his Signal chat scandals.",
    "link": "https://radaronline.com/p/president-donald-trump-talk-pete-hegseth-firing-calls/",
    "timestamp": "2025-04-28T20:10:00Z"
  },
  {
    "title": "The Christian Right is taking over America, according to Talia Lavin – but what is the best response?",
    "description": "Wild Faith is a one-sided response to the rise of Christianity’s far-right fringe. Too often, it seems more like an apoplectic rant than a serious exposé.",
    "link": "https://theconversation.com/the-christian-right-is-taking-over-america-according-to-talia-lavin-but-what-is-the-best-response-253232",
    "timestamp": "2025-04-28T20:09:57Z"
  },
  {
    "title": "How ICE is becoming a secret police force under the Trump administration",
    "description": "The US Immigration and Customs Enforcement meets most criteria that have defined secret police forces in authoritarian regimes. And the worst may be yet to come.",
    "link": "https://theconversation.com/how-ice-is-becoming-a-secret-police-force-under-the-trump-administration-255019",
    "timestamp": "2025-04-28T20:09:10Z"
  },
  {
    "title": "Sean Spicer Asks Karoline Leavitt Why Trump Is ‘Rewarding’ Outlets Who ‘Express Disdain’ For Him",
    "description": "Sean Spicer asked press secretary Karoline Leavitt Monday why President Donald Trump is \"rewarding\" outlets who repeatedly \"express disdain\" for him.",
    "link": "https://dailycaller.com/2025/04/28/sean-spicer-karoline-leavitt-the-atlantic-abc/",
    "timestamp": "2025-04-28T20:07:51Z"
  },
  {
    "title": "JD Vance Tells Charlie Kirk the ‘Ukrainians Aren’t Winning the War’ With Russia: ‘Not the Reality We Live In’",
    "description": "\"The Ukrainians aren't winning the war. I think there's this weird idea among the mainstream media that if this thing goes on for just another few years, the Russians will collapse\"\nThe post JD Vance Tells Charlie Kirk the ‘Ukrainians Aren’t Winning the War’ …",
    "link": "https://www.mediaite.com/podcasts/jd-vance-tells-charlie-kirk-the-ukrainians-arent-winning-the-war-with-russia-not-the-reality-we-live-in/",
    "timestamp": "2025-04-28T20:06:49Z"
  },
  {
    "title": "'Suffered enough': Roseanne Barr says her friends 'lost their jobs' over tariffs",
    "description": "Actress and comedian Roseanne Barr revealed that people she knows \"lost their jobs\" due to policies related to President Donald Trump's tariffs.During a Monday interview with Alex Jones, Barr appeared critical of the president.\"I think Trump is working for th…",
    "link": "https://www.rawstory.com/roseanne-barr-tariffs/",
    "timestamp": "2025-04-28T20:06:37Z"
  },
  {
    "title": "Ch. 9’s Joe Bruno visits White House to discuss Helene recovery, immigration",
    "description": "Border Czar Tom Homan says Mecklenburg County Sheriff Garry McFadden should call ICE before people subject to detainers are released from jail.",
    "link": "https://www.wsoctv.com/news/local/ch-9s-joe-bruno-visits-white-house-discuss-helene-recovery-immigration/3UVWD2JUM5EJJPWBCMY3C45QAE/",
    "timestamp": "2025-04-28T20:04:59Z"
  },
  {
    "title": "House Democrat Shri Thanedar Introduces Impeachment Articles Against Trump",
    "description": "Rep. Shri Thanedar (D-MI) has reportedly introduced articles of impeachment against President Donald Trump — who has a clear mandate from American voters to enact his agenda — accusing him of obstruction of justice, abuse of trade powers, and tyranny, among o…",
    "link": "https://www.breitbart.com/politics/2025/04/28/house-democrat-shri-thanedar-introduces-impeachment-articles-against-trump/",
    "timestamp": "2025-04-28T20:04:49Z"
  },
  {
    "title": "Judge snaps at DOJ lawyer arguing Trump executive order targeting Big Law firm can't be illegal",
    "description": "A judge had little patience for arguments from a Justice Department lawyer trying to toss Jenner & Block's case against the Trump administration.",
    "link": "https://www.businessinsider.com/judge-doj-lawyer-defending-trump-executive-order-targeting-jenner-block-2025-4",
    "timestamp": "2025-04-28T20:04:07Z"
  },
  {
    "title": "Trump’s First 100 Days On Track to be Worst For the Stock Market Since Nixon",
    "description": "President Donald Trump’s first 100 days in office have been the worst start to any elected president’s term since the 1970s, which were rife with geopolitical chaos and domestic upheaval. CNBC’s Sarah Min reported Monday on the findings from CFRA research, an…",
    "link": "https://www.mediaite.com/politics/trumps-first-100-days-on-track-to-be-worst-for-the-stock-market-since-nixon/",
    "timestamp": "2025-04-28T20:03:23Z"
  },
  {
    "title": "Karl Rove Says Trump Is In ‘Very Bad Shape’",
    "description": "\"Fox News analyst Karl Rove tore into President Donald Trump, saying the president was in 'very bad shape' with the general public after his tariffs upended the economy,\" the Daily Beast reports. Said Rove: \"When",
    "link": "https://politicalwire.com/2025/04/28/karl-rove-says-trump-is-in-very-bad-shape/",
    "timestamp": "2025-04-28T20:02:43Z"
  },
  {
    "title": "PROMISES MADE, PROMISES KEPT: Border Security Achieved in Fewer Than 100 Days",
    "description": "Since President Donald J. Trump took office, he and his administration have ushered in the most secure border in modern American history — and he didn’t need legislation to do it. President Trump has made good on the promises he made on the campaign trail to …",
    "link": "https://freerepublic.com/focus/f-news/4313833/posts",
    "timestamp": "2025-04-28T20:02:02Z"
  },
  {
    "title": "Temu adds ‘import charges’ after Trump tariffs",
    "description": "Temu is adding “import charges” of around 145% in response to President Donald Trump’s tariffs on goods shipped from China, CNBC reports.\nThe fees cost more than the products that U.S. consumers are buying, and in some cases are more than doubling the price o…",
    "link": "https://biztoc.com/x/7e21d3f388a32584",
    "timestamp": "2025-04-28T20:01:52Z"
  },
  {
    "title": "‘Republicans cannot know a moment of peace’: Governor joins ranks of Democrats calling for political violence",
    "description": "'The language is all too familiar and can only be described as assassination prep \u0096– carefully cloaked in moral outrage \u0096– designed to incite the most egregious acts'",
    "link": "https://www.wnd.com/2025/04/republicans-cannot-know-a-moment-of-peace-governor-joins-ranks-of-democrats-calling-for-political-violence/",
    "timestamp": "2025-04-28T20:01:48Z"
  },
  {
    "title": "CNN Poll: A growing majority says Trump has made the economy worse, with most skeptical of his tariff plans",
    "description": "A 59% majority of the public now says President Donald Trump’s policies have worsened economic conditions in the country, according to a new CNN poll, up from 51% in March.",
    "link": "https://www.cnn.com/2025/04/28/politics/poll-trump-economy-tariffs/index.html",
    "timestamp": "2025-04-28T20:00:50Z"
  },
  {
    "title": "Trump Official Gives Less-Than-Reassuring Response When Asked if He’s Worried About Empty Shelves: ‘Uh, Not at Present’",
    "description": "Treasury Secretary Scott Bessent said that despite a marked decrease in goods being imported into the U.S., he is not worried about goods shortages \"at present.\"\nThe post Trump Official Gives Less-Than-Reassuring Response When Asked if He’s Worried About Empt…",
    "link": "https://www.mediaite.com/tv/trump-official-gives-less-than-reassuring-response-when-asked-if-hes-worried-about-empty-shelves-uh-not-at-present/",
    "timestamp": "2025-04-28T19:59:24Z"
  },
  {
    "title": "House Republican begs White House to put 'more thought' into major decisions",
    "description": "Rep. Nicole Malliotakis (R-NY) tried her best to defend President Donald Trump's policies when pressed on the administration's cratering poll numbers by CNN's Boris Sanchez on Monday afternoon — but even she admitted that Trump needs to start making decisions…",
    "link": "https://www.rawstory.com/nicole-malliotakis-2671857317/",
    "timestamp": "2025-04-28T19:57:38Z"
  },
  {
    "title": "Rep. Shri Thanedar introduces articles of impeachment against Trump",
    "description": "Rep. Shri Thanedar listed seven articles of impeachment against Trump, claiming the president has \"already done real damage to our Democracy.\"",
    "link": "https://www.mlive.com/news/2025/04/michigan-congressman-introduces-articles-of-impeachment-against-president-trump.html",
    "timestamp": "2025-04-28T19:57:29Z"
  },
  {
    "title": "Karoline Leavitt Lets Unhinged Sycophant Into White House Briefing",
    "description": "A MAGA talking head is the latest new recruit to the White House briefing room. \r\nRogan O’Handley, a.k.a. “DC Draino,” made his first appearance in the new media seat in the coveted federal space Monday, asking a question of White House press secretary Karoli…",
    "link": "https://newrepublic.com/post/194503/karoline-leavitt-white-house-press-briefing-new-media-dc-draino",
    "timestamp": "2025-04-28T19:55:27Z"
  },
  {
    "title": "US senators press for answers on Trump's crypto interests",
    "description": "Massachusetts Senator Elizabeth Warren has called on government officials to address questions related to US President Donald Trump’s memecoin and his media company.In an April 25 letter to Jamieson Greer, acting director of the US Office of Government Ethics…",
    "link": "https://cointelegraph.com/news/us-senators-sec-oge-trump-conflicts-interest",
    "timestamp": "2025-04-28T19:55:14Z"
  },
  {
    "title": "Congressman Shri Thanedar Introduces Articles of Impeachment Against President Donald J. Trump for High Crimes and Misdemeanors (U.S. Congressman Shri Thanedar)",
    "description": "U.S. Congressman Shri Thanedar:\nCongressman Shri Thanedar Introduces Articles of Impeachment Against President Donald J. Trump for High Crimes and Misdemeanors  —  Washington, DC - Today, Congressman Shri Thanedar (MI-13) introduced articles of impeachment ag…",
    "link": "https://www.memeorandum.com/250428/p92",
    "timestamp": "2025-04-28T19:55:02Z"
  },
  {
    "title": "Florida Influencer Kicks Off White House Social Media Meeting by Praising Deportations: ‘Uber Drivers Finally Speak English Again’",
    "description": "Press Secretary Karoline Leavitt says these \"influencer meetings\" will allow President Donald Trump's White House to \"speak to all media outlets and personalities, not just the legacy media\"\nThe post Florida Influencer Kicks Off White House Social Media Meeti…",
    "link": "https://www.thewrap.com/trump-white-house-first-influencer-meeting-uber-deportations/",
    "timestamp": "2025-04-28T19:53:41Z"
  },
  {
    "title": "Trump is Quietly Eviscerating the DEI Regime",
    "description": "The Trump administration is waging a necessary, multifront battle to collapse a DEI regime that’s poisoned Western institutions and caused Americans to lose faith in... Read More\nThe post Trump is Quietly Eviscerating the DEI Regime appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/04/28/trump-is-quietly-eviscerating-the-dei-regime/",
    "timestamp": "2025-04-28T19:51:41Z"
  },
  {
    "title": "Eagles QB Jalen Hurts skipping Super Bowl ceremony at White House",
    "description": "Donald Trump is hosting the 2025 Super Bowl champion Eagles at the White House, but several players, including QB Jalen Hurts, are skipping.",
    "link": "https://www.foxsports.com/stories/nfl/eagles-qb-jalen-hurts-skipping-super-bowl-ceremony-white-house",
    "timestamp": "2025-04-28T19:49:26Z"
  },
  {
    "title": "Donald Trump's Suit For Pope Francis' Funeral Goes Viral",
    "description": "\"Such an embarrassment,” one social media user wrote.",
    "link": "https://www.huffpost.com/entry/trump-blue-suit-pope-francis-funeral_n_680f9c87e4b049bc73d5c205",
    "timestamp": "2025-04-28T19:48:12Z"
  },
  {
    "title": "FCC Chairman Says He Hasn’t Yet Reviewed Public Comments In ’60 Minutes’ Investigation, Says “All Options Remain On The Table”",
    "description": "FCC Chairman Brendan Carr told reporters that he has not yet reviewed public comments in the agency’s investigation of the way that a CBS 60 Minutes interview with Kamala Harris was edited, giving little indication that a resolution was imminent. “Personally …",
    "link": "http://deadline.com/2025/04/fcc-60-minutes-investigation-trump-1236379156/",
    "timestamp": "2025-04-28T19:47:00Z"
  },
  {
    "title": "The public is not on board with Trump’s idea about sending Americans to a foreign prison",
    "description": "The public is overwhelmingly against the idea of sending American citizens to prison in El Salvador. So why does Donald Trump keep talking about it anyway?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/public-not-board-trumps-idea-sending-americans-foreign-prison-rcna203388",
    "timestamp": "2025-04-28T19:46:41Z"
  },
  {
    "title": "Arlington professor challenges legality of Trump’s tariffs in lawsuit",
    "description": "An Arlington law professor is representing a lawsuit attempting to end President Donald Trump's sweeping global tariffs. Ilya Somin, a professor at the Antonin Scalia Law School at George Mason University, is serving as co-counsel for litigation filed shortly…",
    "link": "https://www.arlnow.com/2025/04/28/arlington-professor-challenges-legality-of-trumps-tariffs-in-lawsuit/",
    "timestamp": "2025-04-28T19:45:51Z"
  },
  {
    "title": "Trump Tells The Atlantic What He Learned From Pete Hegseth’s Signalgate Scandal: ‘Maybe Don’t Use Signal, OK?’",
    "description": "The president adds of his defense secretary’s ongoing scandals that for now, “he’s safe” and will keep his job\nThe post Trump Tells The Atlantic What He Learned From Pete Hegseth’s Signalgate Scandal: ‘Maybe Don’t Use Signal, OK?’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-jeffrey-goldberg-atlantic-signalgate-interview/",
    "timestamp": "2025-04-28T19:45:01Z"
  },
  {
    "title": "Earth Kurma APT is actively targeting government and telecommunications orgs in Southeast Asia",
    "description": "Earth Kurma APT carried out a sophisticated campaign against government and telecommunications sectors in Southeast Asia. Trend Research exposed the Earth Kurma APT campaign targeting Southeast Asia’s government and telecom sectors. Threat actors use custom m…",
    "link": "https://securityaffairs.com/177125/apt/earth-kurma-apt-is-actively-targeting-government-and-telecommunications-orgs-in-southeast-asia.html",
    "timestamp": "2025-04-28T19:44:41Z"
  },
  {
    "title": "Longtime Dem congressman will not seek reelection after cancer resurgence",
    "description": "U.S. Rep. Gerry Connolly, D-Fairfax, a fixture in Northern Virginia politics for more than three decades, announced Monday he will not seek reelection after a resurgence of cancer, saying the sun is setting on his time in public service.\nIn a statement publis…",
    "link": "https://www.rawstory.com/longtime-dem-congressman-gerry-connolly-will-not-seek-reelection-after-cancer-resurgence/",
    "timestamp": "2025-04-28T19:44:35Z"
  },
  {
    "title": "Trump admin rules UPenn violated Title IX, demands school return honors to female athletes",
    "description": "The Education Department's Office for Civil Rights determined that UPenn violated Title IX rules and urged the school to meet its demands for compliance.",
    "link": "https://www.foxnews.com/sports/trump-admin-rules-upenn-violated-title-ix-demands-school-return-honors-female-athletes",
    "timestamp": "2025-04-28T19:44:10Z"
  },
  {
    "title": "Airbnb domestic searches surge 20% as Canadians avoid U.S. travel",
    "description": "Consumer patriotism, particularly about \"buying Canadian,\" has been on the rise following tariff and takeover threats from Trump. Read on.",
    "link": "https://financialpost.com/news/economy/airbnb-domestic-searches-canadians-avoid-us-travel",
    "timestamp": "2025-04-28T19:43:32Z"
  },
  {
    "title": "Adidas Responds to New Racism Allegations",
    "description": "German athletic brand Adidas was sued by a now former employee alleging racial discrimination; Adidas said its probe found the accusations \"baseless.\"",
    "link": "http://footwearnews.com/business/business-news/adidas-athletic-brand-sued-racial-discrimination-1234803509/",
    "timestamp": "2025-04-28T19:43:05Z"
  },
  {
    "title": "As Putin signals a three-day ceasefire, what are Kyiv and Moscow's peace deal demands?",
    "description": "Donald Trump says Ukraine is prepared to give up Crimea, territory that Russia annexed after 2014. So what do both sides of the conflict want to see before ending the war?",
    "link": "https://www.abc.net.au/news/2025-04-29/explained-what-ukraine-and-russia-want-to-agree-to-peace/105227018",
    "timestamp": "2025-04-28T19:42:43Z"
  },
  {
    "title": "Trump’s first 100 days show him dictating the terms of press coverage − following Hungarian strongman Viktor Orban’s playbook for media control",
    "description": "In his second term, President Donald Trump asserted new control over the press − as Hungary’s strongman leader Viktor Orbán had urged him to do.",
    "link": "https://theconversation.com/trumps-first-100-days-show-him-dictating-the-terms-of-press-coverage-following-hungarian-strongman-viktor-orbans-playbook-for-media-control-254050",
    "timestamp": "2025-04-28T19:42:23Z"
  },
  {
    "title": "Things to know about the US coal industry and proposed changes under the Trump administration",
    "description": "Trump issued executive orders this month to allow mining on federal land.",
    "link": "https://www.bostonherald.com/2025/04/28/trump-coal/",
    "timestamp": "2025-04-28T19:41:54Z"
  },
  {
    "title": "Dems’ Newest Congressional Candidate Is Proof The Deep State Is Real",
    "description": "A former FBI analyst who resigned over the Trump administration and boasted about working on January 6 cases is running for Congress as a Democrat.",
    "link": "https://dailycaller.com/2025/04/28/john-sullivan-fbi-analyst-congressional-candidate-mike-lawler-kash-patel/",
    "timestamp": "2025-04-28T19:41:33Z"
  },
  {
    "title": "The Demise of Outdoor Dining Isn’t Really Anyone’s Preference. So How Did We End Up Here?",
    "description": "“This rollout has been nothing short of disastrous,” one council member said.",
    "link": "https://slate.com/business/2025/04/outdoor-dining-new-york-city-why-over.html",
    "timestamp": "2025-04-28T19:39:43Z"
  },
  {
    "title": "Trump Issues Wave Of Endorsements For ‘America First’ GOP Lawmakers",
    "description": "President Donald Trump issued a series of emphatic endorsements Monday for four Republican congressmen, calling them “America First” warriors who are key allies in his administration. In posts on Truth Social, Trump praised Rep. Derrick Van Orden (WI-3), a re…",
    "link": "https://biztoc.com/x/38086094bfe01cda",
    "timestamp": "2025-04-28T19:39:16Z"
  },
  {
    "title": "China insists no tariff talks underway with Trump and Xi or top aides, despite U.S. claims",
    "description": "China on Monday once again denied that it is in talks to resolve its tariff war with the United States, after a series of statements by President Donald Trump and his aides suggesting trade negotiations were underway.\n\"Let me make it clear one more time that …",
    "link": "https://biztoc.com/x/62cf023b07bec750",
    "timestamp": "2025-04-28T19:39:15Z"
  },
  {
    "title": "Trump Predicts Hegseth Will ‘Get It Together’ Despite Controversies",
    "description": "President Donald Trump said he thinks embattled Defense Secretary Pete Hegseth will “get it together,” telling the Atlantic he’ll stick with his choice to lead the Pentagon despite recent turmoil.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-predicts-hegseth-will-get-it-together-despite-controversies",
    "timestamp": "2025-04-28T19:39:07Z"
  },
  {
    "title": "White House Directly Involved in House Republicans’ $69B Border Security Funding Plan",
    "description": "FIRST ON THE DAILY SIGNAL—President Donald Trump has been directly involved in House Republicans’ move to dedicate $69 billion to building the border wall and... Read More\nThe post White House Directly Involved in House Republicans’ $69B Border Security Fundi…",
    "link": "https://www.dailysignal.com/2025/04/28/white-house-directly-involved-house-republicans-69b-border-funding-plan/",
    "timestamp": "2025-04-28T19:38:00Z"
  },
  {
    "title": "'Horrifying and baffling': Critics slam border czar as he blames parents for deported kids",
    "description": "WASHINGTON — White House border czar Tom Homan on Monday blamed the parents of U.S. citizen children the Trump administration sent to Honduras over the weekend.\nAt a Monday morning press conference, Homan defended the government’s actions to remove three youn…",
    "link": "https://www.rawstory.com/after-deporting-3-u-s-citizen-children-trumps-border-czar-says-its-the-parents-fault/",
    "timestamp": "2025-04-28T19:35:43Z"
  },
  {
    "title": "Donald Trump is threatening the press because he doesn't like his poll numbers. Can you afford to ignore him? (Peter Kafka/Business Insider)",
    "description": "Peter Kafka / Business Insider:\nDonald Trump is threatening the press because he doesn't like his poll numbers.  Can you afford to ignore him?  — The president says polls published by The New York Times and The Washington Post, along with ABC, are “fake polls…",
    "link": "https://www.memeorandum.com/250428/p91",
    "timestamp": "2025-04-28T19:35:00Z"
  },
  {
    "title": "Bitcoin on Track for Record Price This Quarter as Investors Reallocate Assets: Standard Chartered",
    "description": "The bank continues to be bullish on the price of the asset.",
    "link": "https://decrypt.co/316688/bitcoin-still-on-track-all-time-high-this-quarter-as-investors-reallocate-assets-standard-chartered",
    "timestamp": "2025-04-28T19:33:11Z"
  },
  {
    "title": "US law firm Jenner asks court to permanently bar Trump executive order - Reuters",
    "description": "US law firm Jenner asks court to permanently bar Trump executive orderReuters House Oversight Democrats to probe Trump law firm dealsThe Hill No, the President Cannot Enforce the Law-Firm DealsJust Security Another federal judge expresses skepticism over Trum…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177197877",
    "timestamp": "2025-04-28T19:32:48Z"
  },
  {
    "title": "Hakeem Jeffries presses John Roberts to stop Trump's power grab over Smithsonian museums",
    "description": "In a letter to the Supreme Court's chief justice, the House minority leader compared Trump's March 27 directive to Nazi Germany tactics.",
    "link": "https://www.msnbc.com/top-stories/latest/hakeem-jeffries-john-roberts-smithsonian-black-history-rcna203353",
    "timestamp": "2025-04-28T19:31:29Z"
  },
  {
    "title": "Trump to require truck drivers to speak English, pass literacy tests as 'communication problems' mount",
    "description": "President Donald Trump will sign an executive order requiring truck drivers to pass English literacy tests, White House Press Secretary Karoline Leavitt said.",
    "link": "https://www.foxnews.com/politics/trump-require-truck-drivers-speak-english-pass-literacy-tests-communication-problems-mount",
    "timestamp": "2025-04-28T19:30:38Z"
  },
  {
    "title": "Pink Tariffs Cost Women $2 Billion More Than Men, And The Gap Could Widen",
    "description": "",
    "link": "https://www.benzinga.com/personal-finance/25/04/45047455/pink-tariffs-cost-women-2-billion-more-than-men-and-the-gap-could-widen",
    "timestamp": "2025-04-28T19:30:21Z"
  },
  {
    "title": "Trump Set to Ratchet Up His Immigration Crackdown During Next 100 Days",
    "description": "Trump plans to triple workplace raids and publicly shame so-called sanctuary cities that aren’t cooperating with his deportation efforts",
    "link": "https://time.com/7281034/trump-immigration-crackdown-executive-orders/",
    "timestamp": "2025-04-28T19:28:47Z"
  },
  {
    "title": "Trump's Navy Secretary Keeps Flubbing The Date Of Pearl Harbor",
    "description": "John Phelan, an investor and Trump donor, has never served in the military.",
    "link": "https://www.huffpost.com/entry/navy-secretary-john-phelan-pearl-harbor_n_680fb59be4b0694adc18c581",
    "timestamp": "2025-04-28T19:28:40Z"
  },
  {
    "title": "Canada Elections 2025 results: What will US, China gain from polls?",
    "description": "As Canadians go to the polls for a decisive election, the eyes of the world are on them—particularly America and China. Canada's new leaders will have significant influence on where relations with the US and China head towards in the future. Read to know how …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/canada-elections-2025-results-what-will-us-china-gain-from-polls/articleshow/120707073.cms",
    "timestamp": "2025-04-28T19:28:38Z"
  },
  {
    "title": "Trump is celebrating the Super Bowl champ Eagles, but star QB Jalen Hurts is skipping the ceremony",
    "description": "President Donald Trump is hosting the 2025 Super Bowl champion Philadelphia Eagles at the White House on Monday, but several players, including quarterback Jalen Hurts, are skipping the celebration. Hurts and other players cited scheduling conflicts as the re…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_50aaa3d5-f887-4afb-84c6-ed874e27f18f",
    "timestamp": "2025-04-28T19:28:21Z"
  },
  {
    "title": "Empty ports, empty shelves? Trump tariff battle set to hit home soon",
    "description": "President Donald Trump’s tariff onslaught has roiled Washington and Wall Street for nearly a month. If the trade war persists, the next upheaval will hit much closer to home.\nSince the U.S. raised levies on China to 145% in early April, cargo shipments have p…",
    "link": "https://biztoc.com/x/c57907f66640f844",
    "timestamp": "2025-04-28T19:28:07Z"
  },
  {
    "title": "Trump finds yet another political ally to reward with a presidential pardon",
    "description": "Donald Trump's latest pardon fuels the perception that the criminal justice system increasingly works in favor of those aligned with the White House.",
    "link": "https://biztoc.com/x/07f76b19410c5e28",
    "timestamp": "2025-04-28T19:28:02Z"
  },
  {
    "title": "‘New Media’ Reporter Straight Up Asks Karoline Leavitt to Tell Her What to Cover: ‘What Direction Do You Advise Me to Go In?’",
    "description": "A member of the \"new media\" chosen to cover the White House essentially asked Press Secretary Karoline Leavitt how to cover President Trump's administration.\nThe post ‘New Media’ Reporter Straight Up Asks Karoline Leavitt to Tell Her What to Cover: ‘What Dire…",
    "link": "https://www.mediaite.com/news/new-media-reporter-straight-up-asks-karoline-leavitt-to-tell-her-what-to-cover-what-direction-do-you-advise-me-to-go-in/",
    "timestamp": "2025-04-28T19:24:28Z"
  },
  {
    "title": "Congress Moving Forward On Unconstitutional Take It Down Act",
    "description": "Here’s a puzzle: How do you write a law that’s so badly designed that (1) the people it’s meant to help oppose it, (2) the people who hate regulation support it, and (3) everyone involved admits it will be abused? The answer, it turns out, is the Take It Down…",
    "link": "https://www.techdirt.com/2025/04/28/congress-moving-forward-on-unconstitutional-take-it-down-act/",
    "timestamp": "2025-04-28T19:23:42Z"
  },
  {
    "title": "Swing district GOP congressmen shut down phone lines, close offices amid viral town hall hecklings",
    "description": "Many days over the past two weeks, no one answered the phone at any of US Rep. Scott Perry’s four offices. His strategy is to avoid all interaction with constituents to avoid pushback seen at Republican town halls.",
    "link": "https://nypost.com/2025/04/28/us-news/swing-district-gop-congressmen-shut-down-phone-lines-close-offices-amid-viral-town-hall-hecklings/",
    "timestamp": "2025-04-28T19:23:06Z"
  },
  {
    "title": "Donald Trump Jr launches ‘Executive Branch’ membership club with $500k fees",
    "description": "The club’s founding members include entrepreneur David Sacks and the Winklevoss twins",
    "link": "https://www.the-independent.com/life-style/donald-trump-jr-members-club-washington-dc-b2741045.html",
    "timestamp": "2025-04-28T19:22:30Z"
  },
  {
    "title": "'They're concerned': GOP senator warns 'disruptive' Trump policy gnawing at constituents",
    "description": "Lawmakers are back on Capitol Hill after a break that saw many of them back home at contentious town hall meetings with unhappy constituents. Now that they've heard what voters have to say, both the House and Senate must grapple with passing President Donald …",
    "link": "https://www.rawstory.com/gop-cornyn/",
    "timestamp": "2025-04-28T19:21:22Z"
  },
  {
    "title": "FACT CHECK: Eugene Daniels Says Journalists ‘Care Deeply About Accuracy’ and ‘Are Not the Opposition’",
    "description": "Claim: \"We journalists are a lot of things. We are competitive and pushy. We are impatient and sometimes we think we know everything. But we're also human ... We care deeply about accuracy and take seriously the heavy responsibility of being stewards of the p…",
    "link": "https://freebeacon.com/media/fact-check-eugene-daniels-says-journalists-care-deeply-about-accuracy-and-are-not-the-opposition/",
    "timestamp": "2025-04-28T19:21:07Z"
  },
  {
    "title": "Eagles’ Jalen Hurts Won’t Visit White House—After Saquon Barkley Spotted With Trump",
    "description": "Hurts recently dodged questions about whether he would attend the White House celebration.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/28/eagles-jalen-hurts-wont-visit-white-house-after-saquon-barkley-spotted-with-trump/",
    "timestamp": "2025-04-28T19:19:05Z"
  }
]