[
  {
    "title": "Netanyahu and Trump Are Trying to Have It All",
    "description": "With Israel’s attack on Iran, Netanyahu can distract from his many crises at home. Trump can appease both his faux anti-war backers and the hawks.\nThe post Netanyahu and Trump Are Trying to Have It All appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/14/israel-iran-attack-netanyahu-trump/",
    "timestamp": "2025-06-14T15:08:32Z"
  },
  {
    "title": "Tanks, Helicopters, and a Parade: Inside Donald Trump's Over-the-Top 79th Birthday Bash",
    "description": "In a grand show of celebration, President Donald Trump is preparing to mark his 79th birthday with a massive military parade in Washington D.C., an event anticipated to draw as many as 200,000 attendees.\nThe parade serves a dual purpose: it’s a birthday celeb…",
    "link": "https://biztoc.com/x/c69821967d822565",
    "timestamp": "2025-06-14T15:06:17Z"
  },
  {
    "title": "How to watch the Army Birthday Parade live online for free—and without cable",
    "description": "Almost a decade after he first proposed it, Donald Trump will see a military parade in the streets of Washington, D.C. on Saturday.\nThe parade, which is officially called the Army Birthday Parade and is meant to celebrate the U.S. Army’s 250th birthday, comes…",
    "link": "https://biztoc.com/x/9644eb15ff42e399",
    "timestamp": "2025-06-14T15:06:09Z"
  },
  {
    "title": "Trump clears path for Nippon Steel investment in US Steel, so long as the Japanese firm complies with a ‘national security agreement’",
    "description": "President Donald Trump on Friday signed an executive order paving the way for a Nippon Steel investment in U.S. Steel, so long as the Japanese company complies with a “national security agreement” submitted by the federal government.\nTrump’s order didn’t deta…",
    "link": "https://biztoc.com/x/995f2c11ab81fbc7",
    "timestamp": "2025-06-14T15:05:56Z"
  },
  {
    "title": "MAGA splits over Trump's backing of Israel",
    "description": "US News: TOI correspondent from Washington: MAGA isolationists are up in arms against US involvement in the Middle-East even as President Donald Trump has oste.",
    "link": "https://timesofindia.indiatimes.com/world/us/maga-splits-over-trumps-backing-of-israel/articleshow/121851057.cms",
    "timestamp": "2025-06-14T15:05:31Z"
  },
  {
    "title": "Trump Tried to Destroy Meidas... KARMA STRIKES! (Ben Meiselas/Meidas+)",
    "description": "Ben Meiselas / Meidas+:\nTrump Tried to Destroy Meidas... KARMA STRIKES!  —  It's over, Donald.  —  You failed.  —  Today was going to be your big moment.  —  Your dictator parade.  —  You thought all opposition would be destroyed.  —  You were wrong.  —  The …",
    "link": "https://www.memeorandum.com/250614/p30",
    "timestamp": "2025-06-14T15:05:01Z"
  },
  {
    "title": "Billionaires want to ban Chinese drones and give police free fleets",
    "description": "Silicon Valley technocrats are funding police drone fleets and lobbying to ban Chinese drone companies like DJI.",
    "link": "https://sfstandard.com/2025/06/14/drone-san-francisco-spfd-trump-xi/",
    "timestamp": "2025-06-14T15:04:29Z"
  },
  {
    "title": "Veterans Speak Out Against Trump’s Military Parade: ‘It Feels Gross’",
    "description": "Some veterans have spoken out against Trump's military parade, with one claiming \"there's no regard for veterans from this Administration.\"",
    "link": "https://time.com/7294215/trump-military-parade-veterans-speak-out/",
    "timestamp": "2025-06-14T15:03:12Z"
  },
  {
    "title": "Power play: Two money managers bet big on uranium, predict long shelf life for gains",
    "description": "Sprott Asset Management and VanEck deliver their bullish cases for the radioactive metal.",
    "link": "https://www.cnbc.com/2025/06/14/uranium-as-big-play-due-to-ai-driven-energy-demand.html",
    "timestamp": "2025-06-14T15:00:02Z"
  },
  {
    "title": "‘No Kings’ rally held in Lancaster coinciding with demonstrations around the country",
    "description": "Car horns, blues music and chants of “No kings” echoed through downtown Lancaster on Saturday as around 4,000 people gathered in and around Binns Park to protest Trump administration policies.",
    "link": "https://lancasteronline.com/news/local/no-kings-rally-held-in-lancaster-coinciding-with-demonstrations-around-the-country/article_ec6560b3-ee5b-4275-ae3d-d376bb1712a3.html",
    "timestamp": "2025-06-14T14:57:00Z"
  },
  {
    "title": "ASRA NOMANI: The familiar hidden hand behind today’s #NoKings protests",
    "description": "Investigation reveals Democratic Party's role in organizing #NoKings protests across America, with 70 DNC affiliates coordinating demonstrations in 21 states despite public portrayal",
    "link": "https://www.foxnews.com/opinion/asra-nomani-familiar-hidden-hand-behind-todays-nokings-protests",
    "timestamp": "2025-06-14T14:56:46Z"
  },
  {
    "title": "Former Trump aide calls for ‘America first’ over Israel",
    "description": "The interests of the US and Israel are not necessarily the same in the ongoing escalation, Steve Bannon believes Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619302-bannon-us-israel-interests/",
    "timestamp": "2025-06-14T14:55:53Z"
  },
  {
    "title": "Iran’s lies about its nuclear plans finally at an end",
    "description": "Iran’s nuclear weapons strategy lies in tatters in the wake of this week’s extensive, and ongoing, targeted Israeli strikes.",
    "link": "https://nypost.com/2025/06/14/opinion/irans-lies-about-its-nuclear-plans-finally-at-an-end/",
    "timestamp": "2025-06-14T14:54:51Z"
  },
  {
    "title": "Temu and Amazon Selling 'No Kings' Shirts as Leftists Gear Up for Anti-Trump Protests Across America",
    "description": "The shopping sites Temu and Amazon are selling \"No Kings\" t-shirts as leftists plan to carry out demonstrations against President Donald Trump on Saturday.\nThe post Temu and Amazon Selling ‘No Kings’ Shirts as Leftists Gear Up for Anti-Trump Protests Across A…",
    "link": "https://www.breitbart.com/politics/2025/06/14/temu-and-amazon-selling-no-kings-shirts-as-leftists-gear-up-for-anti-trump-protests/",
    "timestamp": "2025-06-14T14:52:01Z"
  },
  {
    "title": "Democratic state politician Melissa Hortman and husband shot dead in targeted attack, Minnesota officials say - live updates",
    "description": "A manhunt is under way after two attacks in which another local Democratic politician and his wife were shot and injured, Governor Tim Walz says.",
    "link": "https://www.bbc.co.uk/news/live/cvgv4y99n7rt",
    "timestamp": "2025-06-14T14:49:56Z"
  },
  {
    "title": "Trump Set For Huge US Military Parade Amid 'No Kings' Protests",
    "description": "US President Donald Trump will preside over a huge military parade in Washington on his 79th birthday Saturday, as nationwide protests rejecting his brand of politics underscore deep divisions over his second term.",
    "link": "https://www.ibtimes.com.au/trump-set-huge-us-military-parade-amid-no-kings-protests-1859189",
    "timestamp": "2025-06-14T14:45:17Z"
  },
  {
    "title": "More Americans support than oppose Trump's Army celebration parade: Poll (Paul Steinhauser/Fox News)",
    "description": "Paul Steinhauser / Fox News:\nMore Americans support than oppose Trump's Army celebration parade: Poll  —  Still, six in 10 Americans are concerned about the cost of the parade  —  As President Donald Trump hosts events on Saturday to celebrate the U.S. Army's…",
    "link": "https://www.memeorandum.com/250614/p27",
    "timestamp": "2025-06-14T14:45:01Z"
  },
  {
    "title": "Live updates | 'No Kings' protests in Northern California",
    "description": "Opponents of President Donald Trump's administration on Saturday are planning to rally in nearly 2,000 locations across the country, including many in Northern California.",
    "link": "https://www.kcra.com/article/no-kings-protests-northern-california-updates/65064093",
    "timestamp": "2025-06-14T14:44:31Z"
  },
  {
    "title": "As Diddy’s Trial Continues, Suge Knight Reveals What He’d Say To The Rapper If They Could Meet Face To Face: ‘They Probably Got To Put Me In A Cell Him’",
    "description": "The music producer didn't mince words.",
    "link": "https://www.cinemablend.com/streaming-news/as-diddy-trial-continues-suge-knight-reveals-what-hed-say-to-rapper-meet-face-to-face",
    "timestamp": "2025-06-14T14:44:16Z"
  },
  {
    "title": "ThinkCareBelieve: Week 21 of America's Progress under President Trump",
    "description": "Washington D.C., June 14, 2025 (GLOBE NEWSWIRE) -- You can find the article here:  https://thinkcarebelieve.blog/2025/06/14/week-21-of-americas-progress-under-president-trump/",
    "link": "https://www.globenewswire.com/news-release/2025/06/14/3099391/0/en/ThinkCareBelieve-Week-21-of-America-s-Progress-under-President-Trump.html",
    "timestamp": "2025-06-14T14:42:00Z"
  },
  {
    "title": "A Minnesota mayor says two state lawmakers were shot in their homes early Saturday",
    "description": "A Minnesota mayor says two state lawmakers were shot in their homes early Saturdaywpxi.com",
    "link": "https://www.wpxi.com/news/local/minnesota-mayor-says-two-state-lawmakers-were-shot-their-homes-early-saturday/5GQLD5USMZH53BHYBWZH45F5PA/",
    "timestamp": "2025-06-14T14:41:04Z"
  },
  {
    "title": "Trump's long-sought military parade becomes reality",
    "description": "It's among the starkest examples yet of President Donald Trump flexing his role as commander-in-chief since taking office.",
    "link": "https://www.cnbc.com/2025/06/14/trump-parade-washington.html",
    "timestamp": "2025-06-14T14:39:59Z"
  },
  {
    "title": "A Test of Presidential Powers",
    "description": "Panelists discuss the escalating conflict between Israel and Iran—and the rejection of Trump’s dealmaking efforts.",
    "link": "https://www.theatlantic.com/national/archive/2025/06/iran-israel-trump-washington-week/683189/",
    "timestamp": "2025-06-14T14:38:55Z"
  },
  {
    "title": "Israel Air Force Wins Freedom of Operation Above Tehran",
    "description": "The Israeli Air Force (IAF) has won complete freedom of operation above Tehran, the Iranian capital, after 36 hours of conflict, the Israel Defense Forces (IDF) said on Saturday.\nThe post Israel Air Force Wins Freedom of Operation Above Tehran appeared first …",
    "link": "https://www.breitbart.com/middle-east/2025/06/14/israel-air-force-wins-freedom-of-operation-above-tehran/",
    "timestamp": "2025-06-14T14:38:45Z"
  },
  {
    "title": "Tanks, Troops And Trump: D.C. Gears Up For Controversial Military Spectacle",
    "description": "Originally intended as a small festival for 300 people, the event expanded significantly after Trump's election, evolving into a full-scale spectacle with rocket launchers and missiles.",
    "link": "https://www.ibtimes.com/tanks-troops-trump-dc-gears-controversial-military-spectacle-3775676",
    "timestamp": "2025-06-14T14:38:44Z"
  },
  {
    "title": "Best Altcoins to Mimic Trump’s $57.4M Crypto Income – Price Jumps, Staking, and Other Rewards",
    "description": "Donald Trump has disclosed an income of $57.4M from World Liberty Financial tokens. The president filed his public financial disclosure to the US Office of Government Ethics, declaring that he holds 15.75B $WLFI tokens, the native cryptocurrency of WLF. Inter…",
    "link": "http://www.newsbtc.com/news/best-altcoins-to-mimic-trumps-57-4m-crypto-income-price-jumps-staking-and-other-rewards/",
    "timestamp": "2025-06-14T14:37:34Z"
  },
  {
    "title": "Nation Braces For Trump’s Military Parade—And Nationwide ‘No Kings’ Protests (Live Updates)",
    "description": "The parade will coincide with thousands of protests nationwide against the Trump administration’s policies.",
    "link": "https://www.forbes.com/sites/yezensaadah/2025/06/14/nation-braces-for-trumps-military-parade-and-nationwide-no-kings-protests-live-updates/",
    "timestamp": "2025-06-14T14:37:08Z"
  },
  {
    "title": "Ron DeSantis Says Drivers Have Right to Hit Protesters—Is He Right?",
    "description": "Demonstrations against President Donald Trump are expected across the U.S. on Saturday as part of the \"No Kings\" movement.",
    "link": "https://www.newsweek.com/ron-desantis-says-drivers-have-right-hit-protesters-2085525",
    "timestamp": "2025-06-14T14:36:39Z"
  },
  {
    "title": "Ukraine Warns Against Drop In Aid Due To Israel-Iran Escalation",
    "description": "Ukraine said on Saturday it hoped the military escalation between Israel and Iran would not lead to a drop in aid to Kyiv, at a time when European support is stalling without US engagement.",
    "link": "https://www.ibtimes.com/ukraine-warns-against-drop-aid-due-israel-iran-escalation-3775673",
    "timestamp": "2025-06-14T14:33:14Z"
  },
  {
    "title": "7 Issues On The G7 Agenda: The Big Topics Albanese And Trump Could Discuss",
    "description": "7 Issues On The G7 Agenda: The Big Topics Albanese And Trump Could Discuss\n \nAuthored by Crystal-Rose Jones via The Epoch Times,\nAustralian Prime Minister Anthony Albanese has a full plate ahead of him if he secures a face-to-face meeting with U.S. President …",
    "link": "https://biztoc.com/x/3ce02c4dbf323c2f",
    "timestamp": "2025-06-14T14:32:59Z"
  },
  {
    "title": "A Minnesota mayor says two state lawmakers were shot in their homes early Saturday",
    "description": "BROOKLYN PARK, Minn. (AP) — A man posing as a police officer shot and killed a Minnesota lawmaker and her husband in a brazen attack at their home early Saturday, and a second lawmaker and his wife were wounded in a separate shooting in what Gov. Tim Walz des…",
    "link": "https://www.wral.com/story/a-minnesota-mayor-says-two-state-lawmakers-were-shot-in-their-homes-early-saturday/22050727/",
    "timestamp": "2025-06-14T14:31:55Z"
  },
  {
    "title": "Iran warns U.S., U.K., and France: Interfere with Israel strike and your regional bases will be targeted",
    "description": "Iran has told the U.S., U.K., and France not to stop its attacks on Israel, or they will be hit back. The Western countries say they didn’t help Israel, while world leaders are asking everyone to stay calm as the situation gets worse.",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-warns-u-s-u-k-and-france-interfere-with-israel-strike-and-your-regional-bases-will-be-targeted/articleshow/121850626.cms",
    "timestamp": "2025-06-14T14:31:08Z"
  },
  {
    "title": "Geothermal Energy Has A New, 163-Gigawatt Message For Fossil Fuels",
    "description": "New geothermal energy systems are emerging on the US power generation profile, with data centers and the US Department of Defense among key markets.\nThe post Geothermal Energy Has A New, 163-Gigawatt Message For Fossil Fuels appeared first on CleanTechnica.",
    "link": "https://cleantechnica.com/2025/06/14/geothermal-energy-has-a-new-163-gigawatt-message-for-fossil-fuels/",
    "timestamp": "2025-06-14T14:30:56Z"
  },
  {
    "title": "Somebody Is Shooting Minnesota's Democratic Lawmakers, Dressed As A Cop",
    "description": "Well, here is some fucking news.",
    "link": "https://www.wonkette.com/p/somebody-is-shooting-minnesotas-democratic",
    "timestamp": "2025-06-14T14:30:30Z"
  },
  {
    "title": "US scrambles to bring back VOA's Persian service amid Iran-Israel conflict (Ben Johansen/Politico)",
    "description": "Ben Johansen / Politico:\nUS scrambles to bring back VOA's Persian service amid Iran-Israel conflict  —  President Donald Trump ordered the service to shut down in March.  —  Employees of Voice of America's Persian-language service who were sidelined by the Tr…",
    "link": "https://www.memeorandum.com/250614/p24",
    "timestamp": "2025-06-14T14:30:05Z"
  },
  {
    "title": "Opinion - ‘No Kings’ is utter nonsense, but few will notice this weekend",
    "description": "Across the nation today, thousands of protests are being organized by left-wing groups, unions, and other organizations, with chants of “No Kings, No Kings, ...",
    "link": "https://thehill.com/opinion/campaign/5350248-no-kings-is-utter-nonsense-but-few-will-notice-this-weekend/",
    "timestamp": "2025-06-14T14:30:00Z"
  },
  {
    "title": "Cities brace for crowds at nationwide \"No Kings\" demonstrations",
    "description": "Cities large and small are preparing for major demonstrations across the U.S. against President Donald Trump.",
    "link": "https://www.cbsnews.com/news/no-kings-day-demonstration-protest-rally-trump-military-parade/",
    "timestamp": "2025-06-14T14:27:16Z"
  },
  {
    "title": "Protests, parades and Pride: One week in June 2025 is drawing stark American fault lines",
    "description": "The triumphs and frictions of today’s United States are on vivid display.",
    "link": "https://www.bostonherald.com/2025/06/14/two-americas-protests-parades-pride/",
    "timestamp": "2025-06-14T14:26:00Z"
  },
  {
    "title": "Protests, parades and Pride: One week in June 2025 is drawing stark American fault lines",
    "description": "The triumphs and frictions of today’s United States are on vivid display.",
    "link": "https://www.denverpost.com/2025/06/14/two-americas-protests-parades-pride/",
    "timestamp": "2025-06-14T14:26:00Z"
  },
  {
    "title": "Trump Observes US Army Exercises Ahead of Military Parade",
    "description": "President Donald Trump watches US Army troops arrived at the massive military installation in North Carolina to celebrate the 250th anniversary of the US Army. \nDozens of tanks have begun arriving in Washington, DC, for the Army’s 250th anniversary parade on …",
    "link": "https://biztoc.com/x/60ed9e6930f52084",
    "timestamp": "2025-06-14T14:21:54Z"
  },
  {
    "title": "Starbucks CEO admits the struggling chain made a major mistake",
    "description": "Consumers have had a rude awakening this year.\nAfter President Donald Trump announced the finer details of his plan for tariffs on April 2, the reality of how they would affect Americans' everyday lives started to sink in.\nDon't miss the move: Subscribe t…",
    "link": "https://biztoc.com/x/2114e147b81a1135",
    "timestamp": "2025-06-14T14:21:48Z"
  },
  {
    "title": "'Targeted' Attack: Two Democrats And Their Spouses Shot In Their Separate Homes",
    "description": "Minnesota Senator John Hoffman and State Representative Melissa Hortman, along with their spouses, were shot by a man dressed as a police officer in body armor who showed up at their homes in Brooklyn Park and Champlin. \n\"I've been briefed this morning on an …",
    "link": "https://crooksandliars.com/2025/06/targeted-attack-two-democrats-and-their",
    "timestamp": "2025-06-14T14:20:00Z"
  },
  {
    "title": "Spanish-language misinformation on Los Angeles protests pushes a familiar theme",
    "description": "Posts using fake images and baseless claims have sought to connect protests to left-wing Latin American governments, similar to misinformation that has swirled around previous news events.",
    "link": "https://www.nbcnews.com/news/latino/los-angeles-protests-misinformation-spanish-immigration-rcna212862",
    "timestamp": "2025-06-14T14:18:30Z"
  },
  {
    "title": "Israel warns ‘Tehran will burn’ as Iran fires drones and missiles in response to Israeli strikes",
    "description": "Iran retaliated by launching waves of drones and ballistic missiles at Israel",
    "link": "https://www.denverpost.com/2025/06/14/israel-attack-iran-drones-missiles/",
    "timestamp": "2025-06-14T14:17:37Z"
  },
  {
    "title": "Israel warns ‘Tehran will burn’ as Iran fires drones and missiles in response to Israeli strikes",
    "description": "Iran retaliated by launching waves of drones and ballistic missiles at Israel",
    "link": "https://www.bostonherald.com/2025/06/14/israel-attack-iran-drones-missiles/",
    "timestamp": "2025-06-14T14:17:37Z"
  },
  {
    "title": "An old Capitol Hill troublemaker is trying to clinch a megabill deal",
    "description": "It’s a scene jarringly familiar to many Republicans on Capitol Hill: a high-stakes piece of legislation, a tense standoff between GOP leaders and conservative hard-liners — and Mark Meadows in the middle of it all. \nThe former North Carolina congressman and D…",
    "link": "https://biztoc.com/x/852e3167e52ab900",
    "timestamp": "2025-06-14T14:10:59Z"
  },
  {
    "title": "CASEY RYAN: Accreditors Wield Power To End DEI In Schools",
    "description": "Accreditors wield significant power in determining if universities can receive federal funding or even grant recognized degrees.",
    "link": "https://dailycaller.com/2025/06/14/opinion-accreditors-wield-power-to-end-dei-in-schools-casey-ryan/",
    "timestamp": "2025-06-14T14:07:25Z"
  },
  {
    "title": "How US-Israel Gamble Against Iran Could Backfire",
    "description": "The attack on Iran is a joint American-Israeli plan, Elijah J. Magnier, a veteran war correspondent and political analyst, tells Sputnik.",
    "link": "https://sputnikglobe.com/20250614/how-us-israel-gamble-against-iran-could-backfire-1122252289.html",
    "timestamp": "2025-06-14T14:05:17Z"
  },
  {
    "title": "As Trump Throws Himself a Parade, Watch Protesters Across America Say, No Kings",
    "description": "On June 14, 1775, the Second Continental Congress established the United States Army. In 1916 on that same date, President Woodrow Wilson issued a proclamation declaring the day Flag Day, which Congress made an official holiday in 1949. On June 14, 1946, Fred…",
    "link": "https://www.motherjones.com/politics/2025/06/live-blog-no-kings-trump-parade/",
    "timestamp": "2025-06-14T14:02:42Z"
  },
  {
    "title": "Why Are So Many Public Companies Pivoting to Crypto, And What Happens If Bitcoin Crashes?",
    "description": "Although some firms may be forced to sell their Bitcoin if markets cool, others could be acquired by asset managers hunting for deals.",
    "link": "https://decrypt.co/324911/why-public-pivoting-crypto-what-happens-if-bitcoin-crashes",
    "timestamp": "2025-06-14T14:01:02Z"
  },
  {
    "title": "Gov Newsom ‘handcuffed’ police as LA riots expose ‘reactionary’ leadership failure: former sheriff’ s deputy",
    "description": "Former sheriff's deputy Patrick Gipson criticizes Gov. Gavin Newsom and Mayor Karen Bass for handling of LA riots, blaming delayed National Guard deployment and progressive policies.",
    "link": "https://www.foxnews.com/us/gov-newsom-handcuffed-police-la-riots-expose-reactionary-leadership-failure-former-sheriffs-deputy",
    "timestamp": "2025-06-14T14:00:20Z"
  },
  {
    "title": "Cities brace for large crowds at anti-Trump 'No Kings' demonstrations across USA... Developing...",
    "description": null,
    "link": "https://apnews.com/article/no-kings-protest-trump-philadelphia-los-angeles-immigration-raids-a3b67d23733cd060f8d01aef1e391dbf",
    "timestamp": "2025-06-14T14:00:03Z"
  },
  {
    "title": "Tax Breaks: The New Chapter Is Beginning At The IRS Edition",
    "description": "Plus: A new IRS commissioner, update on the Big Beautiful Bill Act, the jock tax, donating clothes to charity, IRS efforts to thwart identity theft, filing deadlines, tax trivia, and more.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/06/14/tax-breaks-the-new-chapter-is-beginning-at-the-irs-edition/",
    "timestamp": "2025-06-14T14:00:00Z"
  },
  {
    "title": "Dignity of Labour: Picket Lines and Coal Mines in Harlan County USA",
    "description": "We've long passed the point where we expect truth from documentary filmmaking. The thin line between documentaries and propaganda (which is to say documentaries that advertise their bias) meant that this was always never a reasonable expectation. This",
    "link": "https://www.steynonline.com/15388/dignity-of-labour-picket-lines-and-coal-mines-in",
    "timestamp": "2025-06-14T14:00:00Z"
  },
  {
    "title": "Desperate Democrats ISO ‘Liberal Joe Rogan’",
    "description": "Seven months after a stinging loss to President Donald Trump, who used podcast appearances and internet virality in his campaign to his advantage, Democrats are... Read More\nThe post Desperate Democrats ISO ‘Liberal Joe Rogan’ appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/06/14/desperate-democrats-iso-liberal-joe-rogan/",
    "timestamp": "2025-06-14T14:00:00Z"
  },
  {
    "title": "Case Not Dismissed: Domestic Violence Is Indeed a Big Deal For Survivors",
    "description": "“It’s just domestic violence.”\n“They did not have a good relationship.”\n If I had a dime for every utterance of those repulsive, dismissive sentiments from TV pundits and legal experts about the details in the Sean “Diddy” Combs trial in New York, I would don…",
    "link": "https://msmagazine.com/2025/06/14/domestic-violence-cassie-ventura-diddy/",
    "timestamp": "2025-06-14T14:00:00Z"
  },
  {
    "title": "DC/DOX Festival Kicks Off With Rousing Documentary On Amy Goodman, ‘Democracy Now!’ Host Who Gives Voice To People “Outside The Frame”",
    "description": "Hours before tanks rumbled into Washington for Donald Trump’s military parade, ground shaking applause erupted in DC for someone who couldn’t be more opposed to everything the president stands for — author and Democracy Now! host Amy Goodman. The renowned jou…",
    "link": "http://deadline.com/2025/06/steal-this-story-please-amy-goodman-documentary-premiere-1236434009/",
    "timestamp": "2025-06-14T14:00:00Z"
  },
  {
    "title": "Trump wishes nation happy 250th Flag Day",
    "description": "\"This is a big day for America!!! HAPPY FLAG DAY!\" United States President Donald Trump wrote on Saturday in a post on X, celebrating 250 years since the adoption of the flag, with a military parade u...",
    "link": "https://biztoc.com/x/94a23a7a6b5adb65",
    "timestamp": "2025-06-14T13:59:55Z"
  },
  {
    "title": "Attack on Padilla Proves We Are Living in an Early-Stage Police State",
    "description": "We’re now living in an early-stage police state. After California Sen. Alex Padilla was assaulted for saying, “I’m Senator Alex Padilla and I have question for the Secretary,” Department of Homeland Security Secretary and notorious puppy murderer Kristi Noem …",
    "link": "https://www.commondreams.org/opinion/sen-padilla-police-state",
    "timestamp": "2025-06-14T13:58:04Z"
  },
  {
    "title": "More Than 1,800 'No Kings' Protests Aim for Nonviolent Pushback Against Trump Policies",
    "description": "The coalition’s national press coordinator says, “We’re all dedicated to championing the cause of nonviolence—not just because it’s moral, but because it’s more effective.”",
    "link": "https://reason.com/2025/06/14/more-than-1800-no-kings-protests-aim-for-nonviolent-pushback-against-trump-policies/",
    "timestamp": "2025-06-14T13:57:30Z"
  },
  {
    "title": "What’s Israel’s Real Endgame With Attacking Iran?",
    "description": "Whether Netanyahu wants to end Iran’s nuclear program or replace its regime, they’re both risky propositions with little chance of success.",
    "link": "http://nymag.com/intelligencer/article/why-did-israel-attack-iran.html",
    "timestamp": "2025-06-14T13:55:02Z"
  },
  {
    "title": "Iran-Israel tensions and an unpredictable Trump to dominate G7",
    "description": "G7 will also be a platform for Canadian PM Carney to showcase his leadership at a time of economic, geopolitical shifts.",
    "link": "https://www.aljazeera.com/economy/2025/6/14/iran-israel-tensions-and-an-unpredictable-trump-to-dominate-g7",
    "timestamp": "2025-06-14T13:55:01Z"
  },
  {
    "title": "The Trump/Musk fight is why we say \"No Kings\" (Lisa Needham/Public Notice)",
    "description": "Lisa Needham / Public Notice:\nThe Trump/Musk fight is why we say “No Kings”  —  Today's protests are about reestablishing a government of laws, not unaccountable oligarchs. …   —  It's hard to believe that it has been less than 10 days since Donald Trump an…",
    "link": "https://www.memeorandum.com/250614/p17",
    "timestamp": "2025-06-14T13:55:00Z"
  },
  {
    "title": "Fans online plan National Barack Obama Day on Donald Trump’s birthday — what’s it all about?",
    "description": "On June 14, a military parade will happen on Donald Trump’s birthday and Flag Day, while many protests are planned across the US.Some people want to celebrate Barack Obama on this day to show they don’t support Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/fans-online-plan-national-barack-obama-day-on-donald-trumps-birthday-whats-it-all-about/articleshow/121850076.cms",
    "timestamp": "2025-06-14T13:54:13Z"
  },
  {
    "title": "Tanks to roll through Washington as Trump hosts US military parade - The Guardian",
    "description": "Tanks to roll through Washington as Trump hosts US military paradeThe Guardian Live updates: Military parade in DC closes streets amid chance of stormsNBC4 Washington Trump military parade live updates: D.C. onlookers line streets; 'No Kings' protests unfold …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178047977",
    "timestamp": "2025-06-14T13:52:59Z"
  },
  {
    "title": "The Grim Reality of the Conflict Between Iran and Israel",
    "description": "\"Is there a path out of this deepening crisis? Perhaps, though not a particularly promising one.\"",
    "link": "https://time.com/7294202/grim-reality-conflict-iran-israel/",
    "timestamp": "2025-06-14T13:52:14Z"
  },
  {
    "title": "Tucker Carlson slams ‘warmongers’ Sean Hannity, Rupert Murdoch amid Israel-Iran strikes",
    "description": "Political pundit Tucker Carlson doubled down on his criticism of Israel’s strikes against Iran, rebuking several media figures, including his former colleagues at Fox News, over what he described as their push for President Trump to engage in the region. “Who…",
    "link": "https://freerepublic.com/focus/f-news/4322998/posts",
    "timestamp": "2025-06-14T13:51:34Z"
  },
  {
    "title": "Jon Stewart: ABC a ‘F**king Joke’ for Firing Terry Moran over Anti-Trump Tweet",
    "description": "ABC’s axing of Terry Moran after the reporter called President Donald Trump a “world-class hater” on social media has drawn the ire of Jon Stewart who airily dismissed the network sneering, “They’re a f–king joke.” While taking listener questions on his Thurs…",
    "link": "https://freerepublic.com/focus/f-news/4322996/posts",
    "timestamp": "2025-06-14T13:49:17Z"
  },
  {
    "title": "Tech execs, Uncle Sam wants you for the US Army",
    "description": "The US Army is looking to recruit senior tech executives to serve as part-time advisors in the Army Reserve.",
    "link": "https://www.businessinsider.com/us-army-tech-executives-meta-openai-palantir-uncle-sam-2025-6",
    "timestamp": "2025-06-14T13:48:57Z"
  },
  {
    "title": "Zelensky insists Trump can stop Putin",
    "description": "\"No one has been able to stop [Russian President Vladimir] Putin. Only [United States President Donald] Trump remains - he can stop him,\" Ukrainian President Volodymyr Zelensky underlined in a Saturda...",
    "link": "https://biztoc.com/x/6d24b7c7497ff0c7",
    "timestamp": "2025-06-14T13:48:41Z"
  },
  {
    "title": "Iran Issues Threat to US, Risks 'Catastrophic' Washington Response",
    "description": "Tehran said American bases in the Middle East could face reprisals if the U.S. helped repel Iranian attacks on Israel.",
    "link": "https://www.newsweek.com/iran-israel-washington-catastrophic-2085497",
    "timestamp": "2025-06-14T13:46:51Z"
  },
  {
    "title": "President Trump, Governor DeSantis Give Disney World Drivers Right To ‘Run Over’ Protesters",
    "description": "Today is the birthday of President Donald Trump, along with the United States Army. Protests are planned to occur across multiple major U.S. cities, including Orlando. Did Disney World guests just get the okay to run over protesters if they feel their lives a…",
    "link": "https://insidethemagic.net/2025/06/disney-world-trump-desantis-guests-emd1/",
    "timestamp": "2025-06-14T13:45:56Z"
  },
  {
    "title": "Russia, Ukraine conduct another round of POWs exchange",
    "description": "The exchanges are part of agreements reached by the warring sides during talks in Istanbul earlier this month.",
    "link": "https://www.aljazeera.com/news/2025/6/14/russia-ukraine-conduct-another-round-of-pows-exchange",
    "timestamp": "2025-06-14T13:44:56Z"
  },
  {
    "title": "Raids and fear cast a large shadow over Club World Cup’s big launch",
    "description": "Governing body cannot avoid the dark political backdrop to its tournament opening as Trump’s authorities flex their muscles",
    "link": "https://www.irishtimes.com/sport/soccer/2025/06/14/raids-and-fear-cast-a-large-shadow-over-club-world-cups-big-launch/",
    "timestamp": "2025-06-14T13:41:49Z"
  },
  {
    "title": "ASRA NOMANI: The $2.1 billion machine behind 'spontaneous' anti-Trump protests Pearl Project investigation exposes 198 Democratic organizations orchestrating Saturday's #NoKings demonstrations",
    "description": "Early Tuesday evening, as National Guard troops faced off against protesters and rioters on the streets of Los Angeles, powerful teachers’ union president Randi Weingarten hosted a virtual town hall with Democratic Kentucky Gov. Andy Beshear.and two leading p…",
    "link": "https://freerepublic.com/focus/f-news/4322993/posts",
    "timestamp": "2025-06-14T13:40:43Z"
  },
  {
    "title": "'Too many DUI hires': Jamie Raskin takes shot at Hegseth over hearing answers",
    "description": "Rep. Jamis Raskin (D-MD) got off a shot at Pete Hegseth's well-documented drinking problems when asked about the defense secretary's alarming answers at a House hearing on Thursday.During an appearance on MSNBC's \"The Weekend,\" Raskin was shown a clip of the …",
    "link": "https://www.rawstory.com/hegseth-2672369727/",
    "timestamp": "2025-06-14T13:40:27Z"
  },
  {
    "title": "More than 30 protests set to take place across the state Saturday",
    "description": "The No Kings protests planned in the Granite State are part of a nationwide effort.",
    "link": "https://www.wmur.com/article/no-kings-protest-trump-concord-portsmouth-ayotte/65063909",
    "timestamp": "2025-06-14T13:35:29Z"
  },
  {
    "title": "People in other countries see what America is becoming (Philip Bump/Washington Post)",
    "description": "Philip Bump / Washington Post:\nPeople in other countries see what America is becoming  —  Two international surveys suggest non-Americans understand Trump better than Americans do.  —  Any of a number of recent images plucked from American politics might serv…",
    "link": "https://www.memeorandum.com/250614/p15",
    "timestamp": "2025-06-14T13:35:01Z"
  },
  {
    "title": "Biden Officials Fear “Tiananmen Square Moment” as Trump Plans Patriotic Military Parade to Honor America",
    "description": "Biden officials and their allies in the legacy media are sounding the alarm over President Donald Trump’s upcoming patriotic military parade, scheduled to coincide with the U.S.\nThe post Biden Officials Fear “Tiananmen Square Moment” as Trump Plans Patriotic …",
    "link": "https://www.thegatewaypundit.com/2025/06/biden-officials-fear-tiananmen-square-moment-as-trump/",
    "timestamp": "2025-06-14T13:30:53Z"
  },
  {
    "title": "Trump Has Completely Wrecked America’s Brand",
    "description": "In Canada, crossing over to America is not just taboo now — it’s a kind of betrayal, even borderline treasonous.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-wrecked-america-brand-canada-1235364578/",
    "timestamp": "2025-06-14T13:30:00Z"
  },
  {
    "title": "DAVID BLACKMON: Trump Ends Newsom’s Terrible Week By Killing His EV Mandate",
    "description": "The week just passed was a rough one for California Governor Gavin Newsom.",
    "link": "https://dailycaller.com/2025/06/14/opinion-trump-ends-newsoms-terrible-week-david-blackmon/",
    "timestamp": "2025-06-14T13:27:47Z"
  },
  {
    "title": "To a friend whose work has come to nothing",
    "description": "This post is just some venting about what is in the larger scheme of things a trivial issue, so you have been forewarned. Almost 15 years ago I started pointing out in faculty meetings that the University of Colorado Law School’s financial model was heading t…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/to-a-friend-whose-work-has-come-to-nothing",
    "timestamp": "2025-06-14T13:24:40Z"
  },
  {
    "title": "US Assisted Israel in Defense Against Iran, Officials Say",
    "description": "According to three U.S. officials, the United States provided support to the Israeli military, shooting down some of the missiles launched by Iran in retaliation for Israel's unprecedented attack Friday morning that targeted Iran's nuclear program and killed …",
    "link": "https://www.today.com/video/us-helped-israel-defend-against-iranian-missiles-officials-say-241598533605",
    "timestamp": "2025-06-14T13:23:11Z"
  },
  {
    "title": "Jeep, Dodge parent has no solution for this emerging problem",
    "description": "President Donald Trump has made his affinity for tariffs clear, and for the duration of his second term, it looks like they are here to stay. \nTrump sees the import taxes as a key negotiating tool and a revenue generator for the U.S. Treasury. \nOne added bene…",
    "link": "https://biztoc.com/x/0a304434389c528d",
    "timestamp": "2025-06-14T13:15:25Z"
  },
  {
    "title": "In L.A., some of those most connected to anti-immigration raids are on the protest sidelines",
    "description": "Tens of thousands of people packed the streets of downtown Los Angeles on Saturday to protest U.S. President Donald Trump and his administration's policies, especially its most recent immigration crackdown. But some of those with the deepest understanding of …",
    "link": "https://www.cbc.ca/news/world/los-angeles-protests-immigration-raids-no-kings-day-trump-1.7561652",
    "timestamp": "2025-06-14T13:12:32Z"
  },
  {
    "title": "Trump protests sweep across U.S. ahead of Saturday's military parade",
    "description": "Demonstrators crowded into streets, parks and plazas across the U.S. Saturday to rally against President Donald Trump as officials urged calm and mobilized National Guard troops ahead of a military parade to mark the army's 250th anniversary that coincides wi…",
    "link": "https://www.cbc.ca/news/world/no-kings-protests-1.7561546",
    "timestamp": "2025-06-14T13:12:32Z"
  },
  {
    "title": "Zelensky Warns Oil Price Surge Amid Israeli Conflict Will Help Russian War Effort",
    "description": "A sharp rise in global oil prices following Israeli strikes on Iran will benefit Russia and bolster its military capabilities in the war in Ukraine, Ukrainian President Volodymyr Zelensky said.\nThe post Zelensky Warns Oil Price Surge Amid Israeli Conflict Wil…",
    "link": "https://www.breitbart.com/europe/2025/06/14/zelensky-warns-oil-price-surge-amid-israeli-conflict-will-help-russian-war-effort/",
    "timestamp": "2025-06-14T13:12:09Z"
  },
  {
    "title": "Give Dads The Gift Of Time: The Push For Paid Leave This Father’s Day",
    "description": "90% of dads qualify for paid leave, only 25% take it. A new campaign from Moms First aims to close the gap by reframing fatherhood through connection and care.",
    "link": "https://www.forbes.com/sites/gemmaallen/2025/06/14/give-dads-the-gift-of-time-the-push-for-paid-leave-this-fathers-day/",
    "timestamp": "2025-06-14T13:06:58Z"
  },
  {
    "title": "Zelenskyy warns oil price surge could help Russia's war effort",
    "description": "Ukrainian President Volodymyr Zelenskyy says rising global oil prices following Israeli strikes on Iran will strengthen Russia by increasing its oil revenues, aiding its war effort in Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-warns-oil-price-surge-russias-war-effort-122840939",
    "timestamp": "2025-06-14T13:02:21Z"
  },
  {
    "title": "2024 Broke the Democrats. Can They Put Themselves Back Together?",
    "description": "For the first time in two decades, the Democratic Party has found itself without a clear political leader—or even an obvious frontrunner. Angry and adrift, voters are clashing with politicians over how to fight back.  Subscribe to Mother Jones podcasts on App…",
    "link": "https://www.motherjones.com/politics/2025/06/democrats-crisis-new-york-mamdani-cuomo/",
    "timestamp": "2025-06-14T13:01:31Z"
  },
  {
    "title": "Mexican Senate president says LA is essentially Mexico: I'd ‘pay for the wall’ if it ceded US southwest",
    "description": "Mexican Senate President Gerardo Fernández Noroña displayed a 1830s map showing California and Texas as Mexican territory during the LA immigration debate.",
    "link": "https://www.foxnews.com/politics/mexican-senate-president-flames-trump-ice-raids-says-hed-pay-wall-ceded-u-s-southwest",
    "timestamp": "2025-06-14T13:00:28Z"
  },
  {
    "title": "RW Extremists Are Promoting Violence At No Kings Protests",
    "description": "Millions are expected to attend a peaceful “No Kings” protest on Saturday as Marie Antoinette Trump celebrates his birthday with an obscene $45-million army parade he’s gifting himself at our expense. While he pushes to rob millions of their health insurance …",
    "link": "https://crooksandliars.com/2025/06/rw-extremists-promoting-violence-no-kings",
    "timestamp": "2025-06-14T13:00:07Z"
  },
  {
    "title": "Did FIFA cancel 2026 World Cup matches in US due to Trump's immigration policies?",
    "description": "Online users claimed FIFA considered canceling U.S.-hosted 2026 World Cup matches, choosing to move them to Mexico or Canada instead.",
    "link": "https://www.snopes.com//news/2025/06/12/trump-fifa-cancels-world-cup-matches-in-us/",
    "timestamp": "2025-06-14T13:00:00Z"
  },
  {
    "title": "Happy 250th Birthday to the US Army!",
    "description": "Today, the nation pauses to honor and join the U.S. Army’s 250th Birthday Celebration Festivities here in the nation’s capital include an Army Birthday Festival... Read More\nThe post Happy 250th Birthday to the US Army! appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/14/happy-250th-birthday-to-the-us-army/",
    "timestamp": "2025-06-14T13:00:00Z"
  },
  {
    "title": "Kansas Senior Meal Delivery Program Shutting Down After Losing Funding",
    "description": "Kansas residents are about to feel the pain of voting for Donald Trump - literally - in their stomachs. This is a sad FAFO, actually. But it is important to report on how voting for Trump really affects people all over the country - and how. KWCH is reporting…",
    "link": "https://crooksandliars.com/2025/06/kansas-senior-meal-delivery-program",
    "timestamp": "2025-06-14T12:58:40Z"
  },
  {
    "title": "‘No Kings’ protests expected to draw thousands across north Georgia on Saturday",
    "description": "Channel 2 Action News has confirmed nearly two dozen protests scheduled across metro Atlanta and north Georgia.",
    "link": "https://www.wsbtv.com/news/local/atlanta/no-kings-protests-expected-draw-thousands-across-north-georgia-saturday/EZ5IWVI7PRFJ3PA7FI5N2L4BSY/",
    "timestamp": "2025-06-14T12:56:07Z"
  },
  {
    "title": "Years of LAPD Impunity Paved Way for Trump’s Repression of Protests Today",
    "description": "Just five years ago, it was Gavin Newsom who unleashed the National Guard on protesters. Now Trump has followed suit.",
    "link": "https://truthout.org/articles/years-of-lapd-impunity-paved-way-for-trumps-repression-of-protests-today/",
    "timestamp": "2025-06-14T12:55:10Z"
  }
]