[
  {
    "title": "Trump Orders Smacked Down In Blistering Ruling On Tariffs",
    "description": "Trump's signature trade policy was smacked down by an appeals court in a blistering decision ruling most of his sweeping tariffs to be unconstitutional.\nThe post Trump Orders Smacked Down In Blistering Ruling On Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-orders-smacked-down-in-blistering-ruling-on-tariffs/",
    "timestamp": "2025-08-30T11:51:16Z"
  },
  {
    "title": "What Does the 7.8% GDP Growth Rate Reflect About the Indian Economy?",
    "description": "The Indian economy's impressive GDP growth of 7.8% in Q1 FY26 has drawn acclaim from economists, showcasing its strong fundamentals. This substantial growth reflects the impact of effective governance and structural reforms, paving the way for future economic…",
    "link": "https://www.nationpress.com/business/indias-economy-grows-by-78percent",
    "timestamp": "2025-08-30T11:49:40Z"
  },
  {
    "title": "Donald Trump Has A Secret Weapon In His War On The Fed",
    "description": "Donald Trump has been ramping up his war of words against the Federal Reserve this year, attacking Fed chair Jerome Powell as economists warn of a looming dollar disaster...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/30/donald-trump-has-a-secret-weapon-in-his-war-on-the-fed/",
    "timestamp": "2025-08-30T11:48:47Z"
  },
  {
    "title": "Ajay Bagga says GST tax cuts could spark market rebound, boost demand",
    "description": "Ajay Bagga expects Indian markets may have bottomed out, citing minimal Q1 downgrades and signs of recovery. He sees the upcoming GST Council meeting and potential consumption tax cuts as critical catalysts for growth.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ajay-bagga-says-gst-tax-cuts-could-spark-market-rebound-boost-demand/articleshow/123601953.cms",
    "timestamp": "2025-08-30T11:46:33Z"
  },
  {
    "title": "Did Trump's niece drop shocking clues and made chilling health revelation? What you need to know",
    "description": "Trump has been spotted with bruising on his right hand and swollen ankles on several occasions last year. President's niece Mary Trump had raised alarms about his cognitive health and suggested he may be battling a specific type of dementia. Rumours surroundi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-dead-rumours-did-trumps-niece-drop-shocking-clues-and-made-chilling-health-revelation-what-you-need-to-know/articleshow/123601862.cms",
    "timestamp": "2025-08-30T11:45:41Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, August 30, 2025: only two more dasy to go until we’re into September.  It’s the Sabbath for Jewish cats, who employ non-Jewish cats (שבת גוי קעץ) to do their work, and also  National Toasted Marshmallow Day. I like mine burnt black, …",
    "link": "https://whyevolutionistrue.com/2025/08/30/saturday-hili-dialogue-547/",
    "timestamp": "2025-08-30T11:45:03Z"
  },
  {
    "title": "Trump trade advisor’s ‘racist’ attack on Modi over India-Russia oil trade",
    "description": "Washington, Aug 30 : Donald Trump’s trade adviser Peter Navarro escalated his attacks on India with a racially tinged thread on X, […]\nThe post Trump trade advisor’s ‘racist’ attack on Modi over India-Russia oil trade appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/30/trump-trade-advisors-racist-attack-on-modi-over-india-russia-oil-trade/",
    "timestamp": "2025-08-30T11:45:00Z"
  },
  {
    "title": "The White House wants government stakes in more companies. The nuclear energy industry could be next.",
    "description": "Nuclear energy could be the next industry the Trump administration targets for equity stakes.",
    "link": "https://finance.yahoo.com/news/the-white-house-wants-government-stakes-in-more-companies-the-nuclear-energy-industry-could-be-next-114249585.html",
    "timestamp": "2025-08-30T11:42:49Z"
  },
  {
    "title": "A walk through a Smithsonian museum reveals American genius and cruelty as Trump presses for change",
    "description": "In an afternoon's walk through ground zero of Americana — the Smithsonian's National Museum of American History — objects around every corner invite one...",
    "link": "https://www.yahoo.com/news/articles/walk-smithsonian-museum-reveals-american-114239041.html",
    "timestamp": "2025-08-30T11:42:39Z"
  },
  {
    "title": "Germany's Merz faces trouble over 'autumn of reform'",
    "description": "Friedrich Merz has decided that the autumn must be the season for tackling Germany's urgent domestic problems, but that means conflict with his center-left coalition partners. Chancellor Friedrich Merz's \"autumn of reform\" could turn into a season of coalitio…",
    "link": "https://www.dw.com/en/germanys-merz-faces-trouble-over-autumn-of-reform/a-73807000",
    "timestamp": "2025-08-30T11:41:00Z"
  },
  {
    "title": "Look How Chickensh*t Vance Avoided Protesters In Wisconsin",
    "description": "Republicans are learning that their policies and this president's authoritarian moves aren't popular with the American people. Republicans are being blasted in town halls, and as one friend suggested to me, they should do town halls in a dunk tank. And now th…",
    "link": "https://crooksandliars.com/2025/08/look-how-chickensht-vance-avoided",
    "timestamp": "2025-08-30T11:32:35Z"
  },
  {
    "title": "White House insiders 'fuming' over concerns about Donald Trump's health - NewsBreak",
    "description": "White House insiders are reportedly fuming over the focus on Donald Trump's health as fears it's catching up with him grow",
    "link": "https://www.newsbreak.com/share/4203881073146-white-house-insiders-fuming-over-concerns-about-donald-trump-s-health?s=a2&amp;share_destination_id=MjA4MTUxNTItMTc1NjU1MzM0NjAzMg%3D%3D&amp;pd=01PKyGbu&amp;hl=en_US&amp;send_time=1756553346&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v3",
    "timestamp": "2025-08-30T11:30:50Z"
  },
  {
    "title": "What polling shows about Trump's pivot from immigration to crime",
    "description": "He took over the Washington, D.C., police and deployed the National Guard despite that violent crime is down in the city and across the U.S.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_1d045477-0219-58e9-b008-506883ac95bc.html",
    "timestamp": "2025-08-30T11:30:00Z"
  },
  {
    "title": "White House insiders 'fuming' over concerns about Donald Trump's health - NewsBreak",
    "description": "White House insiders are reportedly fuming over the focus on Donald Trump's health as fears it's catching up with him grow",
    "link": "https://www.newsbreak.com/share/4203881073146-white-house-insiders-fuming-over-concerns-about-donald-trump-s-health?_f=app_share&amp;pd=0LVzypOH&amp;lang=en_US&amp;send_time=1756553209&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-control&amp;s=i2",
    "timestamp": "2025-08-30T11:27:34Z"
  },
  {
    "title": "Will Democrats Have the Courage to Blame Trump for Hurricane Deaths?",
    "description": "The United States dodged a bullet when Hurricane Erin veered away from its coastline. Put differently, we were lucky enough to survive another round in the game of Russian roulette that President Donald Trump is playing with our lives. But the next hurricane …",
    "link": "https://www.commondreams.org/opinion/hurricane-deaths-blamed-on-trump",
    "timestamp": "2025-08-30T11:18:02Z"
  },
  {
    "title": "Trump administration tells states to remove references to ‘gender ideology’ from sex ed materials",
    "description": "President Donald Trump’s administration this week told 40 states to eliminate parts of lessons that focus on LGBTQ+ issues from federally funded sexual education materials or that they will lose funding. The move is the latest in a line of efforts since Trump…",
    "link": "https://freerepublic.com/focus/f-news/4337599/posts",
    "timestamp": "2025-08-30T11:12:01Z"
  },
  {
    "title": "Analysis-'MAHA' calls for limits on food ads to kids likely to face industry opposition",
    "description": "(Reuters) -A White House call to curtail the marketing of unhealthy food to children would be vulnerable to industry lobbying that killed previous government efforts, nutrition and public health experts said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/analysis-039maha039-calls-for-limits-on-food-ads-to-kids-likely-to-face-industry-opposition",
    "timestamp": "2025-08-30T11:12:00Z"
  },
  {
    "title": "Peter Schiff issued a dire warning on Trump’s trade deficit stance. Here’s why and how to protect yourself",
    "description": "\"What does Donald Trump think would happen?\"",
    "link": "https://finance.yahoo.com/news/peter-schiff-issued-dire-warning-111100449.html",
    "timestamp": "2025-08-30T11:11:00Z"
  },
  {
    "title": "Trump EO Aims to Make Federal Buildings 'Beautiful Again' By Respecting Our 'Heritage'",
    "description": "President Donald Trump announced his latest effort to make “federal architecture beautiful again\" through a new executive action.",
    "link": "https://www.westernjournal.com/trump-eo-aims-make-federal-buildings-beautiful-respecting-heritage/",
    "timestamp": "2025-08-30T11:09:12Z"
  },
  {
    "title": "France and Germany reject Trump's threats on EU tech legislation",
    "description": "Trump on Monday threatened to slap additional tariffs on all countries with digital taxes, legislation or regulations, saying they were designed to harm or discriminate against American technology, in an escalation of his criticism of EU rules on digital serv…",
    "link": "https://economictimes.indiatimes.com/tech/technology/france-and-germany-reject-trumps-threats-on-eu-tech-legislation/articleshow/123601341.cms",
    "timestamp": "2025-08-30T11:02:54Z"
  },
  {
    "title": "Trump dead rumours: When White House offered head-scratching excuse for President's new bruise amid health concerns",
    "description": "X has been buzzing with a bizarre phrase: “Trump is dead.” The chatter traces back to Vice President JD Vance’s interview with USA Today on August 27 where he claimed he is ready to be the next US President if a tragedy happens. The hashtag comes at a time wh…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-dead-rumours-when-white-house-offered-head-scratching-excuse-for-presidents-new-bruise-amid-health-concerns/articleshow/123601254.cms",
    "timestamp": "2025-08-30T11:01:05Z"
  },
  {
    "title": "Poli Sci Experts Predict What Exactly Gavin Newsom's Mockery Of Trump Could Achieve",
    "description": "The California governor is utilizing a particular strategy in his relentless attacks on Trump, and professors of political science have thoughts.",
    "link": "https://www.huffpost.com/entry/poli-sci-experts-predict-how-gavin-newsoms-brutal-mockery-of-trump-and-maga-will-resonate-goog_n_68af1662e4b0c24bc53d0529",
    "timestamp": "2025-08-30T11:00:17Z"
  },
  {
    "title": "Handwriting Analysts Have Seen Trump's Giant Signature — And They Have Thoughts",
    "description": "The way your letters slant or curve and the direction of your pen strokes can reveal a lot about your personality, according to graphologists.",
    "link": "https://www.huffpost.com/entry/donald-trumps-striking-signature-has-people-wondering-if-theres-a-meaning-behind-it-handwriting-analysts-weigh-in-goog_n_68af192fe4b0d635adb31531",
    "timestamp": "2025-08-30T11:00:17Z"
  },
  {
    "title": "Why Team Trump Wants to Deport Abrego Garcia",
    "description": "WASHINGTON—Some 13 years ago, Kilmar Abrego Garcia, then 16, crossed the U.S.-Mexico border illegally. The Salvadoran citizen did not have a run-in with the law... Read More\nThe post Why Team Trump Wants to Deport Abrego Garcia appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/08/30/why-team-trump-wants-to-deport-abrego-garcia/",
    "timestamp": "2025-08-30T11:00:00Z"
  },
  {
    "title": "The Republican Who Isn’t Afraid to Hear From His Constituents",
    "description": "A lawmaker from Missouri bucked his party and held 15 public events this week. Here’s what he heard.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/mark-alford-missouri-town-hall/684048/",
    "timestamp": "2025-08-30T11:00:00Z"
  },
  {
    "title": "Links 8/30/2025",
    "description": "Our vivid daily links: Solar wave? Trump approval tanks, ChatGPT reports to police, US bars Palestian diplomats, Japan-China gas field row, India tariff hit, Israel plans Lebanon invasion, US drug chains halt Covid vaccines, rat population rise, more Lisa Coo…",
    "link": "https://www.nakedcapitalism.com/2025/08/links-8-30-2025.html",
    "timestamp": "2025-08-30T10:55:24Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products",
    "link": "https://www.wftv.com/news/what-happens-trumps/CH4DTXYJMRDG7NDUP5I6GIDISE/",
    "timestamp": "2025-08-30T10:53:19Z"
  },
  {
    "title": "Russia strikes across Ukraine as peace prospects flounder",
    "description": "Russia launched “massive” strikes across Ukraine overnight, rescue services said on Saturday, a new blow to peace efforts that drew a fresh appeal from President Volodymyr Zelensky for US and European help. Despite a recent flurry of international efforts to …",
    "link": "https://www.digitaljournal.com/world/russia-strikes-across-ukraine-as-peace-prospects-flounder/article",
    "timestamp": "2025-08-30T10:52:20Z"
  },
  {
    "title": "Russia Strikes Across Ukraine As Peace Prospects Flounder",
    "description": "Russia launched \"massive\" strikes across Ukraine overnight, rescue services said on Saturday, a new blow to peace efforts that drew a fresh appeal from President Volodymyr Zelensky for US and European help.",
    "link": "https://www.ibtimes.com/russia-strikes-across-ukraine-peace-prospects-flounder-3781995",
    "timestamp": "2025-08-30T10:51:16Z"
  },
  {
    "title": "Donald Trump is conservatism’s realization — not its betrayal",
    "description": "He gave the GOP permission to be themselves, says historian Allan Lichtman",
    "link": "https://www.salon.com/2025/08/30/donald-trump-is-conservatisms-realization-not-its-betrayal/",
    "timestamp": "2025-08-30T10:45:06Z"
  },
  {
    "title": "Brazil launching data center incentives next month to woo big tech, sources say",
    "description": "US President Donald Trump has tied the tariff to the trial of Brazilian former President Jair Bolsonaro, as well as complaints about regulation of US tech companies, including alleged censorship of social media platforms.",
    "link": "https://economictimes.indiatimes.com/tech/technology/brazil-launching-data-center-incentives-next-month-to-woo-big-tech-sources-say/articleshow/123601062.cms",
    "timestamp": "2025-08-30T10:44:40Z"
  },
  {
    "title": "Trump Facing 'Self-Inflicted Disaster,' Nobel Prize-Winning Economist Says",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is facing a \"self-inflicted disaster\" on the economy, a Nobel Prize-winning economist has said.\nA federal appeals court ruled on Friday that most of Trump's tariffs were imposed unlawful…",
    "link": "https://biztoc.com/x/7602c668a9387049",
    "timestamp": "2025-08-30T10:39:36Z"
  },
  {
    "title": "Trump Facing 'Self-Inflicted Disaster,' Nobel Prize-Winning Economist Says",
    "description": "A federal appeals court ruled on Friday that most of President Trump's tariffs were illegal.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-ruling-economy-2122045",
    "timestamp": "2025-08-30T10:31:55Z"
  },
  {
    "title": "Gun violence is an epidemic — and GOP transphobia won’t cure it",
    "description": "Fearmongering and scapegoating do nothing for community safety",
    "link": "https://www.salon.com/2025/08/30/gun-violence-is-an-epidemic-and-gop-transphobia-wont-cure-it/",
    "timestamp": "2025-08-30T10:30:25Z"
  },
  {
    "title": "New $250 \"visa integrity fee\" for non-visa waiver nations like India to deepen US travel slump",
    "description": "New $250 visa fee for U.S. travelers from non-visa waiver countries like Mexico, India, China raises total cost to $442.",
    "link": "https://www.thehindubusinessline.com/news/world/new-250-visa-integrity-fee-for-non-visa-waiver-nations-like-india-to-deepen-us-travel-slump/article69992747.ece",
    "timestamp": "2025-08-30T10:29:04Z"
  },
  {
    "title": "Most of President Donald Trump’s tariffs are not legal, US court rules",
    "description": "The US president has made tariffs a pillar of America’s foreign policy in his second term.",
    "link": "https://7news.com.au/news/most-of-president-donald-trumps-tariffs-are-not-legal-us-court-rules-c-19853986",
    "timestamp": "2025-08-30T10:27:53Z"
  },
  {
    "title": "Past elections echo in governor's race as Labor Day push begins",
    "description": "Lt. Gov. Winsome Earle-Sears is emulating aspects of Gov. Glenn Youngkin's 2021 campaign while Abigail Spanberger's bears similarities to Ralph Northam's 2017 strategy.",
    "link": "https://richmond.com/news/state-regional/government-politics/elections/article_4e76f30f-1fc6-43df-b215-da66945a8cea.html",
    "timestamp": "2025-08-30T10:15:00Z"
  },
  {
    "title": "What's behind the baseless rumours that US President Donald Trump 'is dead'?",
    "description": "Donald Trump has been out of the public eye for a few days, and the internet has lost its mind over it.",
    "link": "https://www.thejournal.ie/is-donald-trump-dead-6803484-Aug2025/",
    "timestamp": "2025-08-30T10:12:19Z"
  },
  {
    "title": "Federal Judge Blocks Kari Lake from Firing VOA President, Ensures Taxpayers Keep Paying Him Six Figures to Do Nothing",
    "description": "Federal Judge Blocks Kari Lake from Firing VOA President, Ensures Taxpayers Keep Paying Him Six Figures to Do Nothingwesternjournal.com",
    "link": "https://www.westernjournal.com/federal-judge-blocks-kari-lake-firing-voa-president-ensures-taxpayers-keep-paying-six-figures-nothing/",
    "timestamp": "2025-08-30T10:04:23Z"
  },
  {
    "title": "Will Venezuela Be the First Target of Trump's New MAGA Monroe Doctrine?",
    "description": "Trump \"believes that if you are powerful, you should use your power,\" a former senior U.S. official told Newsweek.",
    "link": "https://www.newsweek.com/will-venezuela-first-target-trumps-new-maga-monroe-doctrine-2121883",
    "timestamp": "2025-08-30T10:00:01Z"
  },
  {
    "title": "Trump’s immigration crackdown sweeps up 2 firefighters battling a wildfire in Washington state",
    "description": "Chris Hayes blasts the Trump administration for directing immigration agents to arrest firefighters battling Washington's Bear Gulch fire.",
    "link": "https://www.msnbc.com/top-stories/latest/ice-agents-firefighters-washington-bear-gulch-fire-rcna228075",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "One group of Democrats knows how to run — and win — Trump’s crime debate",
    "description": "President Donald Trump’s recent focus on urban crime presents a classic dilemma for Democrats: Push back, or acquiesce to a power grab?",
    "link": "https://www.msnbc.com/news/news-analysis/trump-crime-democratic-mayors-chicago-baltimore-rcna227746",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "JB Pritzker Just Set Himself Apart From All Other Democrats",
    "description": "As Donald Trump’s goon-squad occupation of the nation’s capital wends its way into its third week, the president is already eyeing the next Democratic stronghold he’d like to strangle with his bruised hands in the name of “fighting crime.” Among the municipal…",
    "link": "https://newrepublic.com/post/199800/jb-pritzker-trump-opposition-2028",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "The DOJ Is a Snake Pit—and It’s Only Getting Worse",
    "description": "Trump critics are being targeted by his cronies. No one is safe.",
    "link": "https://www.esquire.com/news-politics/politics/a65937305/doj-edward-martin-joni-ernst-trump/",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "Why the world must reject Israel's reason for attacking Gaza's Nasser Hospital",
    "description": "Israel struck Nasser Hospital in Gaza killing 22 people, including five journalists. Video shows Israel struck the hospital in four deadly successive strikes.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/israel-gaza-al-nasser-hospital-attack-dehumanizes-palestinians-rcna228014",
    "timestamp": "2025-08-30T10:00:00Z"
  },
  {
    "title": "Kamala Harris’ security protection revoked – media",
    "description": "Before leaving office, then-US President Joe Biden extended the former VP’s protection by a full year beyond the six months required by law Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623701-harris-security-protection-revoked/",
    "timestamp": "2025-08-30T09:53:01Z"
  },
  {
    "title": "US Supreme Court to rule on validity of Trump tariffs, in force till Oct 14",
    "description": "The 7-4 decision upholds an earlier ruling striking down Trump’s tariff strategy, but the duties will remain in force until October 14, allowing the administration time to appeal",
    "link": "https://www.thehindubusinessline.com/news/world/us-supreme-court-to-rule-on-validity-of-trump-tariffs-in-force-till-oct-14/article69992667.ece",
    "timestamp": "2025-08-30T09:45:57Z"
  },
  {
    "title": "People Are Actually Standing Up to Trump??",
    "description": "This week, we bring you some things to feel hopeful about (actually!).",
    "link": "https://slate.com/news-and-politics/2025/08/trump-news-lisa-cook-jb-pritzker-national-guard-rfk-jr-democrats-2026-midterms.html",
    "timestamp": "2025-08-30T09:45:00Z"
  },
  {
    "title": "US must join forces with Europe to pressure Putin, say EU foreign ministers",
    "description": "The call comes after U.S. President Donald Trump set a deadline for Vladimir Putin to meet with his Ukrainian counterpart.",
    "link": "https://www.politico.eu/article/us-must-join-forces-europe-pressure-putin-ukraine-russia-war-eu-foreign-ministers/",
    "timestamp": "2025-08-30T09:36:30Z"
  },
  {
    "title": "These two factors — and no others — will lead to Trump's defeat",
    "description": "Despite the inarguably awful actions this administration has taken during its first eight months in office, Donald Trump remains largely impervious in the polls — low to be sure but hardly politically threatening, right in his zone. This despite taking some o…",
    "link": "https://www.rawstory.com/raw-investigates/trump-age-2673924798/",
    "timestamp": "2025-08-30T09:30:01Z"
  },
  {
    "title": "Fmr. Police Chief, GOP Councilman: I Want National Guard in St. Louis",
    "description": "On Friday’s broadcast of NewsNation’s “On Balance,”  former St. Louis County Police Chief and former Republican St. Louis County Councilman Tim Fitch stated that he wants the National Guard sent to St. Louis to help with crime. Host Leland Vittert\nThe post Fm…",
    "link": "https://www.breitbart.com/clips/2025/08/30/fmr-police-chief-gop-councilman-i-want-national-guard-in-st-louis/",
    "timestamp": "2025-08-30T09:27:45Z"
  },
  {
    "title": "Donald Trump dead trend explained: How did it start, and did The Simpsons really predict it?",
    "description": "U.S. President Donald Trump has unexpectedly become a trending topic on social media. The 79-year-old, frequently making headlines for his political actions and statements, has been trending on X, sparking widespread speculation about his health and well-bein…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-dead-trend-explained-how-did-it-start-and-did-the-simpsons-really-predict-it/articleshow/123599642.cms",
    "timestamp": "2025-08-30T09:23:56Z"
  },
  {
    "title": "Republican Floats Melania Trump for Nobel Peace Prize",
    "description": "A number of countries, including Israel and Rwanda, have nominated President Trump for a Nobel Peace Prize.",
    "link": "https://www.newsweek.com/republican-floats-melania-trump-nobel-peace-prize-2122042",
    "timestamp": "2025-08-30T09:23:16Z"
  },
  {
    "title": "As drug deaths hit five-year low, Trump continues to cite fentanyl as major threat",
    "description": "Drug deaths in the U.S. are at their lowest level since March 2025, according to federal data. Trump continues to cite fentanyl as justification for policies ranging from tariffs to immigration.",
    "link": "https://www.npr.org/2025/08/30/nx-s1-5522046/drugs-deaths-trump-fentanyl",
    "timestamp": "2025-08-30T09:15:00Z"
  },
  {
    "title": "Zarif calls Snapback Mechanism activation 'unfounded'",
    "description": "Mohammad-Javad Zarif, the former vice president for strategic affairs and foreign minister, says that the what the European signatories of the Joint Comprehensive Plan of Action (JCPOA) are trying to do is \"unfounded\" because Iran was fully observing the deal…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250829-irna05.htm",
    "timestamp": "2025-08-30T09:14:48Z"
  },
  {
    "title": "European Troika initiates Iran sanctions snapback, but claims extension offer still on the table",
    "description": "The European Troika say that they have \"triggered a 30-day period\" to reinstate the UNSC sanctions on Iran, claiming that it does not mark the end of diplomacy and their extension offer remains on the table.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250829-irna02.htm",
    "timestamp": "2025-08-30T09:14:48Z"
  },
  {
    "title": "Donald Trump's Approval Rating Slumps With College Grads",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is facing steep challenges with college-educated voters, as new polling shows his approval rating among the group steadily declining throughout the summer.\nIn June, just 34 percent of co…",
    "link": "https://biztoc.com/x/674fd1c4e9e2e4a2",
    "timestamp": "2025-08-30T09:10:26Z"
  },
  {
    "title": "Is Donald Trump Undermining Capitalism?",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's Intel deal has faced bipartisan backlash, with critics raising concerns that it is a break from traditional American capitalism. Economists told Newsweek whether they view the deal as …",
    "link": "https://biztoc.com/x/c09d3b62981b0147",
    "timestamp": "2025-08-30T09:10:04Z"
  },
  {
    "title": "Saturday Morning Open Thread: Don’t You Think He Looks… Tired?",
    "description": "The Trump health stuff is starting to feel like wishcasting on all sides [image or embed] — Cooper Lund (@cooperlund.online) August 29, 2025 at 1:57 PM === Dick Cheney is still alive despite his heart exploding a couple of times. But these are fun stories reg…",
    "link": "https://balloon-juice.com/2025/08/30/saturday-morning-open-thread-dont-you-think-he-looks-tired/",
    "timestamp": "2025-08-30T09:04:44Z"
  },
  {
    "title": "Commentary: Thai politics is trapped in a cycle of deja vu",
    "description": "<![CDATA[ Real power remains firmly in the hands of Thailand’s traditional conservative elites, says former foreign correspondent Nirmal Ghosh. ]]>",
    "link": "https://www.channelnewsasia.com/commentary/thailand-prime-minister-paetongtarn-shinawatra-sacked-old-guard-politics-democracy-5324001",
    "timestamp": "2025-08-30T09:03:24Z"
  },
  {
    "title": "'Violator dictates rules of game': Iran slams E3's 'obedience' to US after snapback activation",
    "description": "The spokesman for the Iranian Foreign Ministry has slammed the European signatories to the US-abandoned 2015 nuclear deal for triggering the restoration of UN sanctions against the country, saying the move shows the E3's \"obedience\" to Washington.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250829-presstv03.htm",
    "timestamp": "2025-08-30T09:01:21Z"
  },
  {
    "title": "Iran: 'Snapback' sanctions move will turn Europe into permanently spent force",
    "description": "Iranian Foreign Minister Abbas Araghchi says a decision by the European troika to unleash the snapback mechanism of sanctions on Iran will turn the E3 into a permanently spent force.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250829-presstv01.htm",
    "timestamp": "2025-08-30T09:01:14Z"
  },
  {
    "title": "China, Russia warn of 'irreparable consequences' of Iran sanctions snapback",
    "description": "Russia and China have upbraided a move by Britain, France and Germany — dubbed the European troika or E3 — to unleash the snapback mechanism of sanctions on Iran, warning against the repercussions of imposing curbs on the Islamic Republic's peaceful nuclear p…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/08/iran-250829-presstv02.htm",
    "timestamp": "2025-08-30T09:01:13Z"
  },
  {
    "title": "Top Senate Republican ready to 'roll over' Democrats with rule change to confirm Trump nominees",
    "description": "Senate Majority Whip John Barrasso, R-Wyo., threatened to use the nuclear option to change Senate rules to push through Trump's nominees as Senate Democrats' blockade continues.",
    "link": "https://www.foxnews.com/politics/top-senate-republican-ready-roll-over-democrats-rule-change-confirm-trump-nominees",
    "timestamp": "2025-08-30T09:00:53Z"
  },
  {
    "title": "Donald Trump's Approval Rating Slumps With College Grads",
    "description": "New polling shows that Trump's approval rating has steadily declined with the group over the summer.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-college-2121478",
    "timestamp": "2025-08-30T09:00:03Z"
  },
  {
    "title": "Is Donald Trump Undermining Capitalism?",
    "description": "Economists told Newsweek whether they believe Trump's Intel deal breaks from traditional American capitalism.",
    "link": "https://www.newsweek.com/donald-trump-undermining-capitalism-2121908",
    "timestamp": "2025-08-30T09:00:03Z"
  },
  {
    "title": "Veteran Who Burned US Flag 'Looking Forward' to Supreme Court Trump Battle",
    "description": "Jay Carey, who was awarded a Bronze Star, said he burned the flag as a \"direct challenge\" to an executive order that President Donald Trump signed.",
    "link": "https://www.newsweek.com/veteran-burned-us-flag-supreme-court-battle-2121475",
    "timestamp": "2025-08-30T09:00:02Z"
  },
  {
    "title": "Taylor Swift Prenup Would Likely Include Key Clause—'Won't Be Straightforward'",
    "description": "The billionaire pop star and her fiance, Travis Kelce, may want a prenuptial agreement to protect their assets, experts tell Newsweek.",
    "link": "https://www.newsweek.com/taylor-swift-prenup-travis-kelce-engagement-net-worth-2121459",
    "timestamp": "2025-08-30T09:00:02Z"
  },
  {
    "title": "How the Left Is Losing the Culture, From Tragedy to Taylor Swift",
    "description": "The Left and the Right’s reactions to the events of this week provide a telling insight into why the Right has a hold on the... Read More\nThe post How the Left Is Losing the Culture, From Tragedy to Taylor Swift appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/08/30/how-left-is-losing-culture-tragedy-taylor-swift/",
    "timestamp": "2025-08-30T09:00:00Z"
  },
  {
    "title": "Angry constituents confront Congress on immigration, Medicaid cuts and Gaza",
    "description": "With political tensions running high, the vast majority of congressional lawmakers steered clear of town halls this summer.",
    "link": "https://www.nbcnews.com/politics/congress/summer-town-halls-politicians-trump-medicaid-immigration-gaza-protest-rcna227315",
    "timestamp": "2025-08-30T09:00:00Z"
  },
  {
    "title": "Brazil Strikes Back: Lula to Impose Retaliatory Measures Against US",
    "description": "President Luiz Inacio Lula da Silva has launched formal consultations to apply the Economic Reciprocity Law after the US imposed a 50% tariff hike on Brazilian exports.",
    "link": "https://www.globalsecurity.org/wmd/library/news/brazil/brazil-250829-sputnik01.htm",
    "timestamp": "2025-08-30T08:57:26Z"
  },
  {
    "title": "Social Security Whistleblower Resigns Citing 'Culture Of Panic' Over Trump-Backed Data Modernization Efforts",
    "description": "On Friday, Charles Borges, the Social Security Administration's chief data officer, resigned after filing a whistleblower complaint alleging security risks tied to the President Donald Trump administration-backed efforts to modernize the agency's data systems…",
    "link": "https://biztoc.com/x/03e389fa28c71936",
    "timestamp": "2025-08-30T08:47:31Z"
  },
  {
    "title": "Social Security Whistleblower Resigns Citing 'Culture Of Panic' Over Trump-Backed Data Modernization Efforts",
    "description": "On Friday, Charles Borges, the Social Security Administration's chief data officer, resigned after filing a whistleblower complaint alleging security risks tied to the President Donald Trump administration-backed efforts to modernize the agency's data systems…",
    "link": "https://biztoc.com/x/03e389fa28c71936",
    "timestamp": "2025-08-30T08:47:31Z"
  },
  {
    "title": "Lucas: Jared Kushner gone but not forgotten",
    "description": "While fast buck tourism is flourishing along the coast, Tirana, the capital, has become a paradise for drug money laundering.",
    "link": "https://www.bostonherald.com/2025/08/30/lucas-jared-kushner-gone-but-not-forgotten/",
    "timestamp": "2025-08-30T08:44:42Z"
  },
  {
    "title": "Russian attack on Ukraine’s Zaporizhzhia kills one, injures 24, governor says",
    "description": "More than 500 drones and 45 missiles targeted 14 regions in sweeping assault",
    "link": "https://www.irishtimes.com/world/europe/2025/08/30/russian-attack-on-ukraines-zaporizhzhia-kills-one-injures-24-governor-says/",
    "timestamp": "2025-08-30T08:39:44Z"
  },
  {
    "title": "Russia's 'massive strike' on Ukraine overnight kills 1, injures 24: Ukraine officials",
    "description": "Russia carried out “a massive strike” on Ukraine overnight, launching 537 drones and 45 missiles, the Ukrainian Air Force said Saturday morning.",
    "link": "https://abcnews.go.com/International/russias-massive-strike-ukraine-overnight-kills-1-injures/story?id=125119384",
    "timestamp": "2025-08-30T08:39:25Z"
  },
  {
    "title": "Michael Hudson: How Lenders Sought and Got Power in the Roman Era and Helped Legitimate Later Rentierism",
    "description": "Michael Hudson recaps the long history of limits on lenders' rights for the benefit of society and how the Roman era was an inflection point",
    "link": "https://www.nakedcapitalism.com/2025/08/michael-hudson-how-lenders-sought-and-got-power-in-the-roman-era-and-helped-legitimate-later-rentierism.html",
    "timestamp": "2025-08-30T08:38:08Z"
  },
  {
    "title": "'Where is Trump?' and 'Trump is dead' trend online as health fears grow after President goes MIA - NewsBreak",
    "description": "Donald Trump has not been seen publicly in several days, and has no events on his schedule for the weekend, leading to concerns over his health and wellbei",
    "link": "https://www.newsbreak.com/share/4205358425177-where-is-trump-and-trump-is-dead-trend-online-as-health-fears-grow-after-president-goes-mia?_f=app_share&amp;pd=05LAZlAG&amp;lang=en_US&amp;send_time=1756542613&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.35.0.34%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2025-08-30T08:37:36Z"
  },
  {
    "title": "‘Trump Is Dead’ viral trend: How it started, Trump’s health update, and what happens if a sitting president dies",
    "description": "The phrase \"Trump Is Dead\" trended on X, fueled by public speculation, recent political remarks, and comments from The Simpsons creator Matt Groening. Vice President JD Vance's remarks about succession, coupled with Trump's health updates, further ignited the…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trump-is-dead-viral-trend-why-it-started-trumps-health-update-what-happens-if-a-sitting-president-dies/articleshow/123598873.cms",
    "timestamp": "2025-08-30T08:37:17Z"
  },
  {
    "title": "Most Donald Trump tariffs levied on countries are not legal, US court rules",
    "description": "A divided US appeals court ruled on Friday that most of Donald Trump's tariffs are illegal, undercutting the Republican president's use of the levies as a key international economic policy tool.",
    "link": "https://www.independent.ie/world-news/most-donald-trump-tariffs-levied-on-countries-are-not-legal-us-court-rules/a1683632121.html",
    "timestamp": "2025-08-30T08:33:49Z"
  },
  {
    "title": "Trump calls for half-flag staff across US until Aug 31 in remembrance of Minneapolis church shooting victims; failure in redressal, or patriotism at the right time?",
    "description": "The land of the free, and home of the brave, a sorrow meander, rings through the American soil as amid school shootings, hate crime, and maladministration, issues stemming at the core of American hypocrisy, now stands, exposed as a dark day for American, date…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-calls-for-half-flag-staff-across-us-until-aug-31-in-remembrance-of-minneapolis-church-shooting-victims-failure-in-redressal-or-patriotism-at-the-right-time/articleshow/123599108.cms",
    "timestamp": "2025-08-30T08:33:16Z"
  },
  {
    "title": "Putin Does Not Rule Out Possibility of Meeting With Zelensky - Kremlin",
    "description": "Russian President Vladimir Putin does not rule out the possibility of a meeting with Volodymyr Zelensky, Kremlin spokesman Dmitry Peskov said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250829-sputnik02.htm",
    "timestamp": "2025-08-30T08:31:30Z"
  },
  {
    "title": "Ukraine Mourns Victims Of Mass Russian Missile Strike",
    "description": "Ukrainians mourned the dead as rescuers searched building debris for survivors following one of Russia's biggest missile attacks on the Ukrainian capital amid faltering efforts to bring a halt to Russia's 42-month-old war.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250829-rferl03.htm",
    "timestamp": "2025-08-30T08:31:01Z"
  },
  {
    "title": "Gavin Newsom’s Social Media Gamble",
    "description": "The California governor has started tweeting in the style of Donald Trump to ridicule the president and promote his new redistricting effort in California.",
    "link": "https://slate.com/podcasts/icymi/2025/08/gavin-newsoms-new-trump-like-twitter-strategy",
    "timestamp": "2025-08-30T08:30:00Z"
  },
  {
    "title": "Zelenskyy Seeks New US, Europe Meeting, Says Fresh Russian Offensive Imminent",
    "description": "Ukrainian President Volodymyr Zelenskyy said Kyiv is seeking a fresh meeting with US President Donald Trump and European allies as soon as next week after telling reporters that Russia is poised to launch a new offensive in eastern Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250830-rferl01.htm",
    "timestamp": "2025-08-30T08:29:42Z"
  },
  {
    "title": "Brutal Escalation of Large-Scale Russian Federation Attacks on Ukraine Setting Grim Casualty Records, Jeopardizing Fragile Diplomatic Momentum, Security Council Hears",
    "description": "Warning that the Ukrainian people caught in the crossfire are \"entering the fourth winter of the full-scale war\", a top UN official told the Security Council today that the Russian Federation's large-scale escalation of attacks against civilians persist, kill…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250829-unsc01.htm",
    "timestamp": "2025-08-30T08:29:41Z"
  },
  {
    "title": "Ukraine: 'Diplomatic momentum' at risk amid large-scale Russian strikes",
    "description": "Large-scale attacks by Russia against civilians in Ukraine could see any hopes of a lasting peace deal there rapidly fade, a senior UN official said during an emergency session of the Security Council on Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/08/ukraine-250829-unnews01.htm",
    "timestamp": "2025-08-30T08:29:39Z"
  },
  {
    "title": "Does Starmer realise he got revenge for his ‘freebie’ label after declining Trump’s fancy whisky gift in Scotland?",
    "description": "Amidst allegations of being a ‘freebie’ accepter throughout his start of tenure in 10 Downing last year, Sir Keir Starmer’s unintentional revenge came across as also a win for Scottish pride as he rejected or was ‘stumped’ to reject a whisky from President Tr…",
    "link": "https://economictimes.indiatimes.com/news/international/us/does-starmer-realise-he-got-revenge-for-his-freebie-label-after-declining-trumps-fancy-whisky-gift-in-scotland/articleshow/123599011.cms",
    "timestamp": "2025-08-30T08:27:02Z"
  },
  {
    "title": "'Trump is dead' trends on social media following JD Vance, Simpsons creator's comments",
    "description": "Social media platform X is flooded with the phrase \"Trump Is Dead\" and has become trending days after Vice President JD Vance affirmed the president's fitness in an interview. The surge also comes after comments from The Simpsons creator Matt Groening, linkin…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/trump-is-dead-trends-on-social-media-following-jd-vance-simpsons-creators-comments/articleshow/123598747.cms",
    "timestamp": "2025-08-30T08:11:15Z"
  },
  {
    "title": "SCO summit in China: Who’s attending, what’s at stake amid Trump tariffs?",
    "description": "China is the host of this year’s SCO Summit which takes place in Tianjin from August 31 to September 1.",
    "link": "https://www.aljazeera.com/news/2025/8/30/sco-summit-in-china-whos-attending-whats-at-stake-amid-trump-tariffs",
    "timestamp": "2025-08-30T08:07:46Z"
  },
  {
    "title": "US court says Trump can’t impose tariffs",
    "description": "A US federal appeals court ruled that sweeping global tariffs imposed by President Donald Trump were illegal, but did not immediately lift the duties.\nJustices on the US Court of Appeals for the Federal Circuit said that the American leader overstepped his au…",
    "link": "https://biztoc.com/x/5599f216c89aa59c",
    "timestamp": "2025-08-30T08:02:54Z"
  },
  {
    "title": "Russian attack on Ukraine's Zaporizhzhia kills one, injures 24, governor says",
    "description": "KYIV (Reuters) -Russia launched a sweeping attack on Ukraine which killed one person, injured at least 24 others, and damaged infrastructure and residential buildings, authorities said on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/russian-attack-on-ukraine039s-zaporizhzhia-kills-one-injures-24-governor-says",
    "timestamp": "2025-08-30T08:01:00Z"
  },
  {
    "title": "AI Model Betting Is the New Fantasy Football",
    "description": "Sports gambling has DraftKings. Political junkies have PredictIt. And now the world’s nerdiest corner — the artificial intelligence (AI) scene — has its own set of bettors, where people wager actual money on whether Google’s Gemini will dunk on OpenAI’s GPT-5…",
    "link": "http://www.pymnts.com/artificial-intelligence-2/2025/ai-model-betting-is-the-new-fantasy-football/",
    "timestamp": "2025-08-30T08:00:15Z"
  }
]