[
  {
    "title": "What Kamala Harris Was Really Doing During Oscars 2025",
    "description": "Kamala Harris is kicking back on Oscars night.\nLike many Americans across the country, the former Vice President and her husband Doug Emhoff caught the 2025 Academy Awards from home.\nAs seen in a...",
    "link": "https://www.eonline.com/news/1414180/oscars-2025-no-kamala-harris-didnt-make-surprise-appearance-what-she-did-instead",
    "timestamp": "2025-03-03T04:06:28Z"
  },
  {
    "title": "Adrien Brody forces Oscars orchestra not to cut off his Best Actor speech",
    "description": "Adrien Brody forced the Oscars orchestra to stop cutting off his Best Actor speech: 'I've done this before. Thank you. It's not my first rodeo.'",
    "link": "https://ew.com/adrien-brody-wins-best-actor-forces-orchestra-not-cut-off-speech-2025-oscars-11688937",
    "timestamp": "2025-03-03T04:06:27Z"
  },
  {
    "title": "Macron urges Europe to boost defense spending to over 3 percent of GDP",
    "description": "The EU needs to find ways to massively ramp up defense spending, the French president says.",
    "link": "https://www.politico.eu/article/macron-urges-europe-to-boost-defense-spending-to-over-3-percent-of-gdp/",
    "timestamp": "2025-03-03T04:02:00Z"
  },
  {
    "title": "Trump Cards",
    "description": "This is for you poker players out there: Trump appears to be conceding far too much to Russia, but it could be part of a plan. In poker, the strong hand plays it cool at the start. The weak one bluffs, pretending to be strong. Trump could be bluffing giving a…",
    "link": "https://www.lewrockwell.com/2025/03/taki-theodoracopulos/trump-cards/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "NATO Is the Big Obstacle to Peace in Ukraine",
    "description": "During his recent campaign for president, Donald Trump repeatedly stated that he had a secret plan for settling the war in Ukraine. He suggested that he would be able to resolve the conflict within a day of so of taking office. That obviously was political hy…",
    "link": "https://www.lewrockwell.com/2025/03/jacob-hornberger/nato-is-the-big-obstacle-to-peace-in-ukraine/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Press Falls to Another Record Low in Public Trust",
    "description": "We have previously discussed polling showing the media at record lows in public trust. Well, the latest survey from Gallup shows that the media hit another all-time low. What is most impressive is that plummeting readers, revenues, and layoffs have done littl…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/the-press-falls-to-another-record-low-in-public-trust/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Chance for a New World",
    "description": "For the first time in many years there is hope.  The DEI/Woke/Democrat assault on white Americans has been stopped at least for four years.  For awhile I won’t have to worry that the FBI will break down my door because some creep doesn’t like what I wrote or …",
    "link": "https://www.lewrockwell.com/2025/03/paul-craig-roberts/the-chance-for-a-new-world/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "The Guessing Game Over Trump’s Real Aims in Ukraine",
    "description": "The guessing game about President Donald Trump’s real position on peace in Ukraine continues. Some commentators, including yours truly, think that Trump has blown it by becoming too committed to Ukraine. Others believe that Trump is deceiving the public while…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/the-guessing-game-over-trumps-real-aims-in-ukraine/",
    "timestamp": "2025-03-03T04:01:00Z"
  },
  {
    "title": "Netanyahu pins his hopes on Hamas violating the cease-fire so he can resume the war",
    "description": "With Trump's backing, the Israeli prime minister is allowing himself a free reign in Gaza – and in Lebanon.  Knowing that his political survival is on the line, sacrificing the hostages and exposing IDF soldiers to life-threatening situations are a price he's…",
    "link": "https://www.haaretz.com/israel-news/2025-03-03/ty-article/.premium/netanyahu-pins-his-hopes-on-hamas-violating-the-cease-fire-so-he-can-resume-the-war/00000195-58b4-d965-a395-58b7b8960000",
    "timestamp": "2025-03-03T04:00:11Z"
  },
  {
    "title": "Oscars TV Review: Conan O’Brien Nails It In Hosting Debut On A Night Of Celebration For Cinema, L.A. & Gene Hackman",
    "description": "More than we’ve seen in a while and with a spry 81-year-old Mick Jagger in the house brimming with Bob Dylan jokes, Sunday’s Conan O’Brien-hosted 97th Oscars was a celebration of cinema and the home of Hollywood. Building on last year’s show’s long-overdue ef…",
    "link": "http://deadline.com/2025/03/oscars-2025-tv-review-1236307507/",
    "timestamp": "2025-03-03T03:58:17Z"
  },
  {
    "title": "European leaders back Zelensky in London summit after heated Trump meeting",
    "description": "Washington DC (UPI) Mar 2, 2025 \n\n\n After President Donald Trump's heated exchange with Volodymyr Zelensky at the White House last week, the Ukrainian president met with a summit of European leaders at Lancaster House in London to discuss Russia's war on his …",
    "link": "https://www.spacewar.com/reports/European_leaders_back_Zelensky_in_London_summit_after_heated_Trump_meeting_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Private US company aces lunar landing on first mission",
    "description": "Washington (AFP) Mar 2, 2025\n\n\n A US company successfully landed its spacecraft on the Moon on Sunday, marking only the second private mission to achieve the milestone - and the first to do so upright. \n\nFirefly Aerospace's Blue Ghost Mission 1 touched down a…",
    "link": "https://www.moondaily.com/reports/Private_US_company_aces_lunar_landing_on_first_mission_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Pentagon orders Russian cyber offensive 'stand down'",
    "description": "Washington DC (UPI) Mar 2, 2025 \n\n\n The Trump administration has ordered the United States to end offensive cyber operations targeting Russia, part of an effort to draw Russian President Vladimir Putin into talks on ending the war in Ukraine, sources said Sun…",
    "link": "https://www.spacewar.com/reports/Pentagon_orders_Russian_cyber_offensive_stand_down_999.html",
    "timestamp": "2025-03-03T03:56:44Z"
  },
  {
    "title": "Bitcoin jumps 20% as Trump reveals strategic crypto reserve",
    "description": "Trump announces bitcoin and ether will be core of new U.S. crypto reserve, sparking significant market rally.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/bitcoin-jumps-20-as-trump-reveals-strategic-crypto-reserve/article69284264.ece",
    "timestamp": "2025-03-03T03:55:38Z"
  },
  {
    "title": "Watch: Conan Says Americans 'Excited to See Somebody Finally Stand Up to a Powerful Russian' After 'Anora' Wins",
    "description": "Conan O'Brien remained largely apolitical while hosting the Oscars on Sunday night, save for his one sublte dig at President Donald Trump and Russia.\nThe post Watch: Conan Says Americans ‘Excited to See Somebody Finally Stand Up to a Powerful Russian’ After ‘…",
    "link": "https://www.breitbart.com/entertainment/2025/03/02/watch-conan-jokes-americans-excited-to-see-somebody-finally-stand-up-to-a-powerful-russian-after-anora-wins/",
    "timestamp": "2025-03-03T03:55:03Z"
  },
  {
    "title": "Ishiba says Japan won't take sides in U.S. row with Ukraine",
    "description": "The Japanese leader sought to strike a balance for Japan, the sole Asian G7 member, in its alliance with the U.S. and its longstanding support for Kyiv.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/japan/politics/ishiba-ukraine-trump-reaction/",
    "timestamp": "2025-03-03T03:53:00Z"
  },
  {
    "title": "Asian markets climb on China fiscal hopes against Trump tariffs",
    "description": "Asian markets climbed on Monday on hopes that China will announce a huge stimulus package that will help offset US President Donald Trump’s looming tariffs against Chinese goods. Investors were also watching for any last-ditch deals to ward off the levies hit…",
    "link": "https://www.digitaljournal.com/world/asian-markets-climb-on-china-fiscal-hopes-against-trump-tariffs/article",
    "timestamp": "2025-03-03T03:52:32Z"
  },
  {
    "title": "The risks of Trump tariffs encapsulated in a car key",
    "description": "Electronic car keys are assembled in Mexico, but can cross borders in North America several times before being finished.",
    "link": "https://www.japantimes.co.jp/business/2025/03/03/markets/risks-trump-tariffs-car-key/",
    "timestamp": "2025-03-03T03:47:00Z"
  },
  {
    "title": "Trump sees Zelenskyy as the problem, but Ukrainians stand by him",
    "description": "The more the U.S. President and his vice president squeeze Zelenskyy, the more Ukrainians rally to their leader's side.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/world/politics/trump-zelenskyy-problem-ukrainians/",
    "timestamp": "2025-03-03T03:47:00Z"
  },
  {
    "title": "Demonstrators gather in San Francisco to support Ukraine",
    "description": "Dozens of protesters gathered near the San Francisco ferry building Sunday afternoon expressing support for Ukraine following the disastrous Oval Office meeting last week with President Donald Trump and Ukrainian President Volodymyr Zelenskyy.",
    "link": "https://www.ktvu.com/news/demonstrators-gather-san-francisco-support-ukraine",
    "timestamp": "2025-03-03T03:44:44Z"
  },
  {
    "title": "Zelenskyy says U.S.-Ukraine relationship can be salvaged",
    "description": "Ukrainian president Volodymyr Zelenskyy said Sunday that he believes he will be able to salvage his relationship with the United States.",
    "link": "https://www.nbcnews.com/politics/donald-trump/zelenskyy-us-ukraine-relationship-salvaged-rcna194438",
    "timestamp": "2025-03-03T03:37:24Z"
  },
  {
    "title": "Hero Snow Reporter Who Took on Vance Still Employed",
    "description": "Good news: at least for now, Lucy Welch remains employed by Sugarbush. From the Boston Globe (archive):\n\nIn a statement to the Glo",
    "link": "https://kottke.org/25/03/hero-snow-reporter-who-took-on-vance-still-employed",
    "timestamp": "2025-03-03T03:35:08Z"
  },
  {
    "title": "Volodymyr Zelensky speaks out after disastrous Donald Trump meeting over Ukraine’s war effort against Russia",
    "description": "Volodymyr Zelensky speaks out after disastrous Donald Trump meeting over Ukraine’s war effort against Russia7news.com.au",
    "link": "https://7news.com.au/news/conflict/zelensky-speaks-out-after-disastrous-trump-meeting-c-17904235",
    "timestamp": "2025-03-03T03:33:41Z"
  },
  {
    "title": "Trader profits $6.8M from BTC, ETH bets placed before Trump crypto reserve post",
    "description": "A trader netted $6.8 million from placing hundreds of 50x leveraged long positions on Bitcoin and Ether right before US President Donald Trump’s Crypto Strategic Reserve announcement.",
    "link": "https://cointelegraph.com/news/trader-banks-nearly-7-million-from-trumps-crypto-reserve-announcement",
    "timestamp": "2025-03-03T03:33:18Z"
  },
  {
    "title": "Trump slammed for golfing while South Carolina is burning after deluded theories - NewsBreak",
    "description": "Governor Henry McMaster declared a state of emergency to aid the ongoing response to wildfires across the state",
    "link": "https://www.newsbreak.com/share/3837068853260-trump-slammed-for-golfing-while-south-carolina-is-burning-after-deluded-theories?s=a2&amp;share_destination_id=MTc2NzUyNzkxLTE3NDA5NzIzNDYxODc%3D&amp;pd=0BxdTT3e&amp;hl=en_US&amp;send_time=1740972346&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-control",
    "timestamp": "2025-03-03T03:26:15Z"
  },
  {
    "title": "Conan O’Brien Gets In Dig At Trump With ‘Anora’ Joke: “I Guess Americans Are Excited To See Somebody Finally Stand Up To A Powerful Russian”",
    "description": "Conan O’Brien steered clear of politics in his opening monologue, but as Anora has collected a number of Oscars, he got in a quip directed at Donald Trump without naming him. “Anora is having a good night. Two wins already. I guess Americans are excited to se…",
    "link": "http://deadline.com/2025/03/oscars-2025-trump-conan-obrien-1236308273/",
    "timestamp": "2025-03-03T03:26:05Z"
  },
  {
    "title": "Why Trump’s aluminum tariffs won’t raise the price of your can of Coke",
    "description": "American consumers don’t need to fret about President Donald Trump’s tariffs on aluminum raising the price of their can of soda.\nTwo weeks ago, Trump announced a 25% tariff on all steel and aluminum imports into the United States that would go into effect Mar…",
    "link": "https://biztoc.com/x/6b4b1690b66ecee7",
    "timestamp": "2025-03-03T03:24:12Z"
  },
  {
    "title": "Canada Doesn’t Rule Out Sending Troops to Ukraine — Trudeau",
    "description": "Prime Minister told reporters in London following a meeting of Western leaders devoted to the Ukrainian conflictOTTAWA, March 2. /TASS/. Canada is considering all options to ensure Ukraine's security, including sending military personnel to the country, Prime…",
    "link": "https://freerepublic.com/focus/f-news/4301654/posts",
    "timestamp": "2025-03-03T03:22:52Z"
  },
  {
    "title": "Controversial Trump Movie ‘The Apprentice’ Fails To Win Any Oscars",
    "description": "The film, which President Donald Trump has threatened legal action against, did not win for Best Supporting Actor or Best Actor for Jeremy Strong and Sebastian Stan.",
    "link": "https://www.forbes.com/sites/tonifitzgerald/2025/03/02/controversial-trump-movie-the-apprentice-fails-to-win-any-oscars/",
    "timestamp": "2025-03-03T03:22:47Z"
  },
  {
    "title": "USAID official put on leave after warning of deaths due to Trump's aid block",
    "description": "The Trump administration announced last week that it was canceling nearly 10,000 foreign aid grants and contracts worth almost $60 billion, ending about 90% of USAID's global work.",
    "link": "https://www.japantimes.co.jp/news/2025/03/03/world/politics/usaid-official-deaths-trump-aid/",
    "timestamp": "2025-03-03T03:21:00Z"
  },
  {
    "title": "Ukraine updates: Zelenskyy says peace talks will include US",
    "description": "Just days after his tense encounter with US President Donald Trump at the White House, Volodymyr Zelenskyy has said negotiations will \"definitely\" include Washington. His comments follow a European summit in London.",
    "link": "https://www.dw.com/en/ukraine-updates-zelenskyy-says-peace-talks-will-include-us/live-71806397",
    "timestamp": "2025-03-03T03:20:00Z"
  },
  {
    "title": "Oscars spread love around to 'Anora,' 'Conclave,' 'Dune: Part Two,' 'Wicked'",
    "description": "\"Anora,” a strip-club Cinderalla story without the fairy tale ending, was crowned best picture at the 97th Academy Awards on Sunday, handing Sean Baker’s gritty, Brooklyn-set screwball farce Hollywood’s top prize",
    "link": "https://www.actionnewsjax.com/entertainment/strip-club/RRCMLJUGWZFOFGMOGIGIQSZWUQ/",
    "timestamp": "2025-03-03T03:19:43Z"
  },
  {
    "title": "Tesla’s plummeting sales risk its lucrative emissions credit earnings",
    "description": "CEO Elon Musk has angered European customers and governments, undercutting his EV brand.",
    "link": "https://www.politico.eu/article/tesla-plummeting-sales-risk-emissions-credit-earning/",
    "timestamp": "2025-03-03T03:18:00Z"
  },
  {
    "title": "Musk calls for US to withdraw from NATO - NewsBreak",
    "description": "Elon Musk called for the United States to withdraw from NATO and the United Nations. His statement came amid a flurry of posts on X criticizing Ukrainian P",
    "link": "https://www.newsbreak.com/share/3836818516472-musk-calls-for-us-to-withdraw-from-nato?s=a2&amp;share_destination_id=MTcwOTgwOTYzLTE3NDA5NzE3MDM0MDQ%3D&amp;pd=0BZPxTKu&amp;hl=en_US&amp;send_time=1740971703&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.9.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v2%2Cns_local_strategy_25q1_exp-v3%2Cns_push_exp_rt_bucketv12-v4",
    "timestamp": "2025-03-03T03:15:56Z"
  },
  {
    "title": "Digging Deep: Australian Mining Magnate Gina Rinehart Speaks Her Mind",
    "description": "Gina Rinehart remade Hancock into one of Australia’s largest private companies by revenue. She wants to be remembered as a champion for the mining and agriculture industries.",
    "link": "https://www.forbes.com/sites/shivaunefield/2025/03/02/digging-deep-australian-mining-magnate-gina-rinehart-speaks-her-mind/",
    "timestamp": "2025-03-03T03:10:35Z"
  },
  {
    "title": "Ukraine’s Zelenskyy ‘ready’ for minerals deal after bust-up with Trump",
    "description": "Ukrainian leader says he will resign if Kyiv is granted membership of NATO.",
    "link": "https://www.aljazeera.com/news/2025/3/3/ukraines-zelenskyy-ready-for-minerals-deal-after-bust-up-with-trump",
    "timestamp": "2025-03-03T03:09:59Z"
  },
  {
    "title": "Largest ever CME gap has just printed in Bitcoin futures",
    "description": "A gap of more than $10,000 has opened up on CME Bitcoin futures following the massive market move over the weekend.",
    "link": "https://cointelegraph.com/news/largest-ever-cme-gap-has-just-printed-in-bitcoin-futures",
    "timestamp": "2025-03-03T03:08:15Z"
  },
  {
    "title": "How the US Can Make Myanmar a Foreign Policy Success Story",
    "description": "Supporting the country’s pro-democracy movement is both a moral imperative and a strategic necessity for Washington.",
    "link": "https://thediplomat.com/2025/03/how-the-us-can-make-myanmar-a-foreign-policy-success-story/",
    "timestamp": "2025-03-03T03:06:00Z"
  },
  {
    "title": "Should Canada become the 51st US state? Trump fans are unsure",
    "description": "The BBC asked Maga supporters if they understood why Canadians might be annoyed by Trump’s 51st state jibes.",
    "link": "https://www.bbc.com/news/videos/cvg58d7938yo",
    "timestamp": "2025-03-03T03:05:31Z"
  },
  {
    "title": "'Give Him An Ovation': Mike Johnson Warns Dems To 'Respect' Trump's Speech To Congress",
    "description": "House Speaker Mike Johnson (R-LA) warned Democrats to \"respect\" President Donald Trump when he addresses a joint session of Congress this week.\n\n\n\"Are you expecting the Democrats to put on some kind of a resistance show on Tuesday night?\" Fox News host Maria …",
    "link": "https://crooksandliars.com/2025/03/give-him-ovation-mike-johnson-warns-dems",
    "timestamp": "2025-03-03T03:00:01Z"
  },
  {
    "title": "‘The White Lotus’: Leslie Bibb Reveals That Trump Scene Was Written in 2022 and Explains Why Mike White ‘Writes Great Women’",
    "description": "SPOILER ALERT: This article contains spoilers for Season 3, Episode 3 of “The White Lotus,” now streaming on Max. For a tight-knit group of women like Kate (Leslie Bibb), Jaclyn (Michelle Monaghan) and Laurie (Carrie Coon), taking a trip to Thailand is the pe…",
    "link": "https://variety.com/2025/tv/news/white-lotus-leslie-bibb-reveals-trump-scene-written-2022-explains-mike-white-writing-great-women-1236320516/",
    "timestamp": "2025-03-03T03:00:00Z"
  },
  {
    "title": "‘No Other Land’ Directors Call Out US Foreign Policy in Palestine in Oscars Speech: ‘Can’t You See We Are Intertwined?’",
    "description": "Palestinian director Basel Adra and Israeli director Yuval Abraham decried the \"atrocious destruction\" in Gaza \nThe post ‘No Other Land’ Directors Call Out US Foreign Policy in Palestine in Oscars Speech: ‘Can’t You See We Are Intertwined?’ appeared first on …",
    "link": "https://www.thewrap.com/no-other-land-oscars-speech-palestine-gaza/",
    "timestamp": "2025-03-03T02:58:39Z"
  },
  {
    "title": "'No Other Land' directors plead for an end to Israeli-Palestinian conflict",
    "description": "Basel Adra and Yuval Abraham, two of the four directors of ‘No Other Land’, pleaded for an end to the Israeli-Palestinian conflict in their Oscars acceptance speech.",
    "link": "https://www.nbcnews.com/news/us-news/oscar-winning-no-land-directors-plead-end-israeli-palestinian-conflict-rcna194447",
    "timestamp": "2025-03-03T02:57:26Z"
  },
  {
    "title": "Zelensky says still \"ready to sign\" minerals deal with U.S.",
    "description": "LONDON, March 3 (Xinhua) -- Ukrainian President Volodymyr Zelensky said Sunday that he is still",
    "link": "http://en.people.cn/n3/2025/0303/c90000-20283585.html",
    "timestamp": "2025-03-03T02:55:14Z"
  },
  {
    "title": "Bitcoin Is Digital Gold But 'What's The Rationale For An XRP Reserve', Asks Peter Schiff: Cardano Founder Charles Hoskinson Says Trump Made The Right Decision",
    "description": "Renowned economist Peter Schiff questioned the inclusion of XRP (CRYPTO: XRP) in the cryptocurrency reserve announced by President Donald Trump on Sunday while acknowledging the rationale behind including Bitcoin (CRYPTO: BTC).\nWhat happened: Schiff stated on…",
    "link": "https://biztoc.com/x/dfec23960e809316",
    "timestamp": "2025-03-03T02:50:55Z"
  },
  {
    "title": "Scholz calls Ukraine demilitarization ‘unacceptable’",
    "description": "German Chancellor Olaf Scholz has claimed that European security must center around a “strong” Ukraine, rejecting Russia’s position Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613596-scholz-ukraine-demilitarization-unacceptable/",
    "timestamp": "2025-03-03T02:47:38Z"
  },
  {
    "title": "Trump begs Americans to 'spend less time worrying about Putin' while attacking his ex-aide",
    "description": "Donald Trump on Sunday attacked his former adviser, and asked Americans to \"spend less time worrying about Putin.\"\n\nLt. Gen. H.R. McMaster, who served as Mr. Trump's national security adviser during his first administration, \nsaid over the weekend that Russia…",
    "link": "https://www.rawstory.com/trump-spend-less-time-putin/",
    "timestamp": "2025-03-03T02:45:51Z"
  },
  {
    "title": "DONALD TRUMP: \"We should spend less time worrying about Putin, and more time worrying about migrant rape gangs, so we don't end up like Europe\"",
    "description": "NEW: TRUMP: \"We should spend less time worrying about Putin, and more time worrying about migrant rape gangs, drug lords, murderers, and people from mental institutions entering our Country - So that we don’t end up like Europe!\" pic.twitter.com/ogsyZ6Arbu—…",
    "link": "https://freerepublic.com/focus/f-news/4301646/posts",
    "timestamp": "2025-03-03T02:40:55Z"
  },
  {
    "title": "Laura Kuenssberg: Zelensky bruised but upbeat after diplomatic whirlwind",
    "description": "The Ukrainian president is standing firm after his Oval Office clash with Donald Trump, says the BBC's Laura Kuenssberg.",
    "link": "https://www.bbc.com/news/articles/c0rz178el8go",
    "timestamp": "2025-03-03T02:34:46Z"
  },
  {
    "title": "U.S. tariffs, easing of Middle East tensions threaten reversal of shipping boom",
    "description": "Global liner rates fell 5.9% sequentially in the week ended Feb. 27, after earlier breaking below $3,000 per 12-meter container for the first time since early May",
    "link": "https://www.japantimes.co.jp/business/2025/03/03/markets/shipping-us-tariffs-red-sea-reopening/",
    "timestamp": "2025-03-03T02:34:00Z"
  },
  {
    "title": "Daryl Hannah Stands With Ukraine At Oscars After Trump-Zelensky Showdown: “Slava Ukraine!”",
    "description": "Halfway through an Oscar ceremony largely void of politics until that point, Daryl Hannah stood out. The Kill Bill star was a presenter to mark the 20th anniversary of Quentin Tarantino film’s Part 2 release. As she walked on stage, Hannah went off script, st…",
    "link": "http://deadline.com/2025/03/daryl-hannah-ukraine-oscars-trump-zelensky-1236307930/",
    "timestamp": "2025-03-03T02:33:01Z"
  },
  {
    "title": "European leaders on edge as prospect looms of Trump pulling 20K troops from continent",
    "description": "European leaders are grappling with how to handle icier relations with the U.S. since President Donald Trump regained control of the White House this year.\"The Europeans have a serious problem of readiness … that they’re trying to fix, but it takes time,\" Cam…",
    "link": "https://freerepublic.com/focus/f-news/4301644/posts",
    "timestamp": "2025-03-03T02:31:27Z"
  },
  {
    "title": "Oil recovers as upbeat Chinese manufacturing data increases some optimism",
    "description": "Oil prices increased, supported by positive manufacturing data from China and the hope of improved fuel demand. Brent crude and U.S. West Texas Intermediate crude saw gains. However, potential U.S. tariffs on Chinese exports added uncertainty. Rising concerns…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-recovers-as-upbeat-chinese-manufacturing-data-increases-some-optimism/articleshow/118671761.cms",
    "timestamp": "2025-03-03T02:31:16Z"
  },
  {
    "title": "Daryl Hannah honors 'Kill Bill,' Ukraine on stage at 2025 Oscars",
    "description": "Daryl Hannah shouts out Ukraine by speaking a Ukrainian battle cry on stage at the 2025 Oscars, where she appeared to present and honor her work in the 'Kill Bill' movies.",
    "link": "https://ew.com/daryl-hannah-honors-kill-bill-ukraine-battle-cry-oscars-2025-11689149",
    "timestamp": "2025-03-03T02:30:30Z"
  },
  {
    "title": "The week ahead in business: ECB meeting, EU inflation rates and International Women’s Day",
    "description": "On Monday Eurostat will release a flash estimate of inflation in the euro area for February, coming just ahead of the European Central Bank (ECB) board’s rate setting meeting on Thursday.",
    "link": "https://www.independent.ie/business/the-week-ahead-in-business-ecb-meeting-eu-inflation-rates-and-international-womens-day/a341474369.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "Letters: Mam’s added ingredient of love made her pancakes the nicest I ever tasted",
    "description": "Ash Wednesday is the first day of Lent, when Christians attend mass to receive blessed ashes as a reminder of our human mortality. Lent is a time to reflect, fast and abstain in preparation for the resurrection of Christ on Easter Sunday.",
    "link": "https://www.independent.ie/opinion/letters/letters-mams-added-ingredient-of-love-made-her-pancakes-the-nicest-i-ever-tasted/a226919391.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "Sarah Ellison: New York mayoral race comes down to who can best manage dealings with US president Donald Trump",
    "description": "In a crowded field of mayoral aspirants, two Democrats with complicated relationships with president Donald Trump are poised to turn the race into a referendum on how New York voters want their city to engage with the current occupant of the White House.",
    "link": "https://www.independent.ie/opinion/comment/sarah-ellison-new-york-mayoral-race-comes-down-to-who-can-best-manage-dealings-with-us-president-donald-trump/a1310715867.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "David Blair: By treating foes as friends and allies as adversaries, Donald Trump is weakening America",
    "description": "A thuggish Chinese ambassador once told the people of Sweden that Beijing would “treat our friends with fine wine but for our enemies we’ve got shotguns”.",
    "link": "https://www.independent.ie/opinion/comment/david-blair-by-treating-foes-as-friends-and-allies-as-adversaries-donald-trump-is-weakening-america/a706387921.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "‘Coalition of the willing’ to present US with new plan for Ukraine peace deal",
    "description": "UK prime minister Keir Starmer said yesterday European leaders had agreed to draw up a Ukraine peace plan to take to the United States, a vital step for Washington to be able to offer security guarantees Kyiv says are vital to deter Russia.",
    "link": "https://www.independent.ie/world-news/europe/coalition-of-the-willing-to-present-us-with-new-plan-for-ukraine-peace-deal/a1895137790.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Ireland’s defence can no longer be outsourced to neighbours as tolerance for neutral stance wanes",
    "description": "In the wake of Brexit, Ireland and the UK had to reset their relationship. Before Brexit, aside from the normal meetings around Northern Ireland, the taoiseach and prime minister of the day would meet regularly at EU summit meetings, allowing for one-to-one c…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-irelands-defence-can-no-longer-be-outsourced-to-neighbours-as-tolerance-for-neutral-stance-wanes/a287611234.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "Protesters target Tesla stores across the US over Elon Musk’s DOGE cuts to government spending",
    "description": "Demonstrators gathered outside Tesla stores across the US on Saturday to protest against the automaker’s billionaire chief executive Elon Musk and his push to slash government spending on behalf of president Donald Trump.",
    "link": "https://www.independent.ie/world-news/north-america/protesters-target-tesla-stores-across-the-us-over-elon-musks-doge-cuts-to-government-spending/a412075124.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "Fionnán Sheahan: Shhh! Nobody tell Donald Trump about our Leprechaun economics and ostrich act",
    "description": "A taoiseach used to get away with a Waterford Crystal bowl of shamrock and a joke about the White House being built by an Irishman – twice. The gag was usually at the expense of the UK ambassador present in the crowd, as it was pointed out the celebrated Kilk…",
    "link": "https://www.independent.ie/opinion/comment/fionnan-sheahan-shhh-nobody-tell-donald-trump-about-our-leprechaun-economics-and-ostrich-act/a715552825.html",
    "timestamp": "2025-03-03T02:30:00Z"
  },
  {
    "title": "Calgary's Ukrainian community rallies after Trump-Zelenskyy clash",
    "description": "Hundreds of people rallied at Calgary's Municipal Plaza Sunday in the wake of a heated exchange between Ukrainian President Volodymyr Zelenskyy and U.S. President and Vice-President Donald Trump and JD Vance at the White House on Friday.",
    "link": "https://www.cbc.ca/news/canada/calgary/calgary-ukraine-rally-march-2025-1.7472766",
    "timestamp": "2025-03-03T02:29:28Z"
  },
  {
    "title": "Alarming Trump health fears after video show worrying limp problem - NewsBreak",
    "description": "President Donald Trump was pictured with a limp as he joined his daughter-in-law on stage at a Mar-a-Lago event, along with Elon Musk and his young son",
    "link": "https://www.newsbreak.com/share/3837119360503-alarming-trump-health-fears-after-video-show-worrying-limp-problem?_f=app_share&amp;pd=07ZaHgKj&amp;lang=en_US&amp;send_time=1740968774&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2224.51.0.21%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_local_strategy_25q1_exp-v15%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v9%2Cns_foryou_model_exp_25q1-v9&amp;s=i2",
    "timestamp": "2025-03-03T02:26:42Z"
  },
  {
    "title": "‘No Other Land’ Directors Use Oscar Speech to Call on World ‘to Stop the Ethnic Cleansing of Palestinian People’",
    "description": "As directors Yuval Abraham, Basel Adra, Hamdan Ballal, Rachel Szor took the stage to accept the best documentary Oscar for their work on “No Other Land,” they took the opportunity — in one of the only overtly political moments of the telecast — to make a robu…",
    "link": "https://variety.com/2025/awards/news/no-other-land-oscar-speech-ethnic-cleansing-gaza-1236321688/",
    "timestamp": "2025-03-03T02:26:40Z"
  },
  {
    "title": "Daryl Hannah Shouts Out Ukraine While Presenting at the Oscars",
    "description": "The \"Kill Bill\" actress salutes the war-torn country after Trump defended Russia earlier this week\nThe post Daryl Hannah Shouts Out Ukraine While Presenting at the Oscars appeared first on TheWrap.",
    "link": "https://www.thewrap.com/daryl-hannah-shouts-out-ukraine-while-presenting-at-the-oscars/",
    "timestamp": "2025-03-03T02:26:09Z"
  },
  {
    "title": "USAID official warns of unnecessary deaths from Trump's foreign aid block, then says he's been put on leave",
    "description": "(Reuters) - A senior official with the U.S. Agency for International Development in an email on Sunday warned that the Trump administration's dismantling of the agency will result in unnecessary deaths -- only to email his staff less than 30 minutes later to …",
    "link": "https://www.thestar.com.my/news/world/2025/03/03/usaid-official-warns-of-unnecessary-deaths-from-trump039s-foreign-aid-block-then-says-he039s-been-put-on-leave",
    "timestamp": "2025-03-03T02:25:00Z"
  },
  {
    "title": "USAID Official Warns Of \"Preventable Deaths\" From Trump's Foreign Aid Block",
    "description": "Nicholas Enrich, USAID&#039;s acting assistant administrator for global health, in the seven-page memo shared with staff, said &quot;political leadership&quot; had made it impossible to deliver lifesaving humanitarian assistance around the world.",
    "link": "https://www.ndtv.com/world-news/usaid-official-warns-of-preventable-deaths-from-donald-trumps-foreign-aid-block-7833956",
    "timestamp": "2025-03-03T02:23:22Z"
  },
  {
    "title": "Zelensky's \"Gratitude\" Video Message After Trump's \"Not Thankful\" Charge",
    "description": "Volodymyr Zelensky&#039;s post came days after he was shouted down at the White House by Donald Trump and JD Vance.",
    "link": "https://www.ndtv.com/world-news/volodymyr-zelenskys-gratitude-video-message-after-donald-trump-jd-vance-not-thankful-charge-in-argument-at-white-house-oval-office-7833950",
    "timestamp": "2025-03-03T02:20:57Z"
  },
  {
    "title": "Hit King Pete Rose Could Be Reinstated Following Shocking Turn Of Events",
    "description": "Baseball's hit king and Cincinnati Reds legend Pete Rose could be posthumously reinstated in a shocking turn of events.",
    "link": "https://www.newsweek.com/sports/mlb/hit-king-pete-rose-could-reinstated-following-shocking-turn-events-2038504",
    "timestamp": "2025-03-03T02:19:45Z"
  },
  {
    "title": "Europe is not serious about Ukraine, despite their words of encouragement",
    "description": "If EU heads of state truly want to hurt Russia, they would stop buying their products and sanction the parts of the Russian economy they rely on.",
    "link": "https://www.jpost.com/opinion/article-844378",
    "timestamp": "2025-03-03T02:18:19Z"
  },
  {
    "title": "Chinese manufacturing returns to growth despite threat of higher Trump tariffs",
    "description": "China’s manufacturing activity expanded at the fastest pace in three months in February, despite the looming threat that Donald Trump will impose tariffs this week.\nProduction at China’s factories returned to growth last month, an official survey showed, than…",
    "link": "https://biztoc.com/x/43cd639ecad10bcb",
    "timestamp": "2025-03-03T02:17:36Z"
  },
  {
    "title": "Lindsey Graham Slams Zelensky over Refusal to Resign: 'Until There Is an Election, No One Has a Voice'",
    "description": "Sen. Lindsey Graham (R-SC) criticized Ukrainian President Volodymyr Zelensky for refusing to resign after Zelensky dismissed Graham's previous comments calling for him to resign in the aftermath of his meeting with President Donald Trump in the Oval Office.\nT…",
    "link": "https://www.breitbart.com/politics/2025/03/02/lindsey-graham-slams-zelensky-refusal-resign/",
    "timestamp": "2025-03-03T02:14:08Z"
  },
  {
    "title": "Donald Trump to lay out his govt overhaul plan to US Congress",
    "description": "Donald Trump will address Congress to highlight his executive orders and vision for the next four years. With Elon Musk's support, he's pushing the 'Make America Great Again' agenda. Trump's speech is expected to tout his administration's achievements and lay…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-to-lay-out-his-govt-overhaul-plan-to-us-congress/articleshow/118671588.cms",
    "timestamp": "2025-03-03T02:12:50Z"
  },
  {
    "title": "President slammed for golfing while South Carolina burning...",
    "description": "President slammed for golfing while South Carolina burning...\r\n\n \n \n \n (First column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:State of emergency, evacuations...\r\nMyrtle Beach Danger...",
    "link": "https://www.irishstar.com/news/us-news/south-carolina-declares-state-emergency-34781628",
    "timestamp": "2025-03-03T02:10:36Z"
  },
  {
    "title": "Zelenskiy Signals He Would Meet With Trump If Invited Back (Aliaksandr Kudrytski/Bloomberg)",
    "description": "Aliaksandr Kudrytski / Bloomberg:\nZelenskiy Signals He Would Meet With Trump If Invited Back  — Ukrainian leader is ready to sign natural resources deal  — Says he's convinced his clash with Trump will blow over  —  Ukrainian President Volodymyr Zelenskiy sai…",
    "link": "https://www.memeorandum.com/250302/p89",
    "timestamp": "2025-03-03T02:00:01Z"
  },
  {
    "title": "'They're Wusses': Jasmine Crockett Explains Why MTG's Committee Won't Subpoena Elon Musk",
    "description": "Rep. Jasmine Crockett (D-TX) accused Rep. Marjorie Taylor Greene (R-GA) and Republicans on the House DOGE subcommittee of not having the backbone to subpoena billionaire Elon Musk as he leads an effort to fire thousands of government workers.\n\n\nDuring a Sunda…",
    "link": "https://crooksandliars.com/2025/03/theyre-wusses-jasmine-crockett-explains",
    "timestamp": "2025-03-03T02:00:01Z"
  },
  {
    "title": "US suspends offensive cyber operations against Russia, senior US official says | CNN Politics",
    "description": "The US has suspended operations and planning for offensive cyber operations against Russia, a senior US official told CNN.",
    "link": "https://www.cnn.com/2025/03/02/politics/us-cyber-operations-russia-suspend/index.html",
    "timestamp": "2025-03-03T01:58:45Z"
  },
  {
    "title": "USAID official warns of unnecessary deaths from Trump's foreign aid block, then says he's been put on leave",
    "description": "A senior USAID official, Nicholas Enrich, was placed on administrative leave shortly after warning that the Trump administration's dismantling of the agency could lead to preventable deaths globally. The administration aims to cut nearly $60 billion in foreig…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/usaid-official-warns-of-unnecessary-deaths-from-trumps-foreign-aid-block-then-says-hes-been-put-on-leave/articleshow/118671439.cms",
    "timestamp": "2025-03-03T01:58:30Z"
  },
  {
    "title": "Bitcoin up by a fifth after Trump lists reserve tokens",
    "description": "Bitcoin and several other cryptocurrencies surged after U.S. President Trump announced plans to include them in a new strategic reserve. This news spurred a significant rally in crypto markets, with Bitcoin climbing over 20% from its recent lows and notable g…",
    "link": "https://economictimes.indiatimes.com/markets/cryptocurrency/bitcoin-up-by-a-fifth-after-trump-lists-reserve-tokens/articleshow/118671419.cms",
    "timestamp": "2025-03-03T01:55:44Z"
  },
  {
    "title": "Trump: Bitcoin Will Sit ‘at Heart’ of US Crypto Reserve",
    "description": "President Donald Trump has announced the creation of a U.S. strategic cryptocurrency reserve.\nThe president’s announcement Sunday (March 2) caused a rally in crypto prices, which had been on a downward trend following recent record highs.\nAccording to a post …",
    "link": "https://biztoc.com/x/2e9400c01f0cfe6f",
    "timestamp": "2025-03-03T01:55:34Z"
  },
  {
    "title": "Bitcoin, Ethereum, Dogecoin Rally On Trump's Strategic Crypto Reserve Announcement: Analyst Says BTC's New ATH Possible This Month",
    "description": "The cryptocurrency market soared Sunday after President Donald Trump announced the inclusion of blue-chip coins in a U.S. strategic cryptocurrency reserve.\nCryptocurrency\nGains +/-\nPrice (Recorded at 7:30 p.m. ET)\nBitcoin (CRYPTO: BTC)\n+8.82%\n$93,653.92\nEther…",
    "link": "https://biztoc.com/x/2cd3a59c76e9e059",
    "timestamp": "2025-03-03T01:55:33Z"
  },
  {
    "title": "Europe's nightmare is here: They have to fight Putin without the U.S.",
    "description": "European leaders are confronting their worst-case scenario: maybe they really are going to be dealing with a bellicose Russia alone.When the United States lined up alongside Russia and North Korea earlier this week to oppose a UN motion condemning Vladimir Pu…",
    "link": "https://freerepublic.com/focus/f-news/4301640/posts",
    "timestamp": "2025-03-03T01:55:05Z"
  },
  {
    "title": "Zelensky must mend the breach with Trump - or resign (Marc A. Thiessen/Washington Post)",
    "description": "Marc A. Thiessen / Washington Post:\nZelensky must mend the breach with Trump — or resign  —  Zelensky's stubbornness has badly hurt Ukraine.  —  On Thursday, President Donald Trump was publicly pledging to help Ukrainian President Volodymyr Zelensky regain Ru…",
    "link": "https://www.memeorandum.com/250302/p87",
    "timestamp": "2025-03-03T01:55:01Z"
  },
  {
    "title": "Euro rebounds on Europe's Ukraine peace push; Bitcoin rallies",
    "description": "The euro and the British pound gained due to Europe's peace efforts in Ukraine, while the Canadian dollar and Mexican peso rose on potential tariff relief. Bitcoin surged as U.S. President Trump announced its inclusion in a new cryptocurrency strategic reserv…",
    "link": "https://economictimes.indiatimes.com/markets/forex/euro-rebounds-on-europes-ukraine-peace-push-bitcoin-rallies/articleshow/118671409.cms",
    "timestamp": "2025-03-03T01:53:48Z"
  },
  {
    "title": "China’s February factory activity expands at fastest pace in three months, private survey finds",
    "description": "China's economy has struggled to boost growth amid tepid domestic demand and a prolonged real estate downturn, leaving exports as a key driver of growth.",
    "link": "https://www.cnbc.com/2025/03/03/china-february-caixin-pmi.html",
    "timestamp": "2025-03-03T01:53:39Z"
  },
  {
    "title": "Gold gains on softer dollar, mounting Trump tariff concerns",
    "description": "Gold prices increased on Monday boosted by a weaker U.S. dollar and concerns of a global trade war due to President Trump's tariffs. U.S. gold futures also rose. A falling dollar made gold cheaper for holders of other currencies. Traders expect the Federal Re…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-gains-on-softer-dollar-mounting-trump-tariff-concerns/articleshow/118671400.cms",
    "timestamp": "2025-03-03T01:52:06Z"
  },
  {
    "title": "Bitcoin up by a fifth after Trump lists reserve tokens",
    "description": "SINGAPORE: Bitcoin was trading up a fifth from last week's lows on Monday (Mar 3) and several other cryptocurrencies that US President Donald Trump said would be included in a new US strategic reserve also rallied sharply. Trump said in a post on Truth Social…",
    "link": "https://www.channelnewsasia.com/world/bitcoin-up-fifth-after-trump-lists-reserve-tokens-4971401",
    "timestamp": "2025-03-03T01:49:19Z"
  },
  {
    "title": "Bitcoin up by a fifth after Trump lists reserve tokens",
    "description": "SINGAPORE : Bitcoin was trading up a fifth from last week's lows on Monday and several other cryptocurrencies that U.S. President Donald Trump said would be included in a new U.S. strategic reserve also rallied sharply.Trump said in a post on Truth Social tha…",
    "link": "https://www.channelnewsasia.com/business/bitcoin-up-fifth-after-trump-lists-reserve-tokens-4971401",
    "timestamp": "2025-03-03T01:49:19Z"
  },
  {
    "title": "The only ‘winner’ here is Putin: Ukraine unites in response to Trump-Zelenskyy spat and resigns itself to new reality",
    "description": "A fractious meeting in Washington has left Ukrainians wondering what will become of relations with the US.",
    "link": "https://theconversation.com/the-only-winner-here-is-putin-ukraine-unites-in-response-to-trump-zelenskyy-spat-and-resigns-itself-to-new-reality-251228",
    "timestamp": "2025-03-03T01:42:25Z"
  },
  {
    "title": "Asking Zelenskyy questions, I found him defiant after disastrous confrontation with Trump",
    "description": "During what was an extraordinary round-table with a handful of journalists at Stansted Airport, there was no sign of a bruised Ukrainian president who had just been publicly battered by Donald Trump.",
    "link": "https://news.sky.com/story/asking-zelenskyy-questions-i-found-him-defiant-after-disastrous-confrontation-with-trump-13320606",
    "timestamp": "2025-03-03T01:42:00Z"
  },
  {
    "title": "Donald Trump's Crypto Reserve Post Sparks Rally, Dash For Currencies",
    "description": "President Donald Trump noted that the cryptocurrencies Bitcoin and Ether would be at the heart of the US &quot;strategic reserve.&quot;",
    "link": "https://www.ndtv.com/world-news/donald-trumps-crypto-reserve-post-sparks-rally-dash-for-currencies-7833799",
    "timestamp": "2025-03-03T01:41:24Z"
  },
  {
    "title": "Trump: Bitcoin Will Sit ‘at Heart’ of US Crypto Reserve",
    "description": "President Donald Trump has announced the creation of a U.S. strategic cryptocurrency reserve. The president’s announcement Sunday (March 2) caused a rally in crypto prices, which had been on a downward trend following recent record highs. According to a post …",
    "link": "https://www.pymnts.com/cryptocurrency/2025/trump-bitcoin-will-sit-at-heart-of-us-crypto-reserve/",
    "timestamp": "2025-03-03T01:41:24Z"
  }
]