[
  {
    "title": "Chinese electric vehicle maker BYD reports 2024 revenue over $100B, topping Tesla’s sales",
    "description": "BYD also recently launched of a new sedan and unveiled a super fast charging system.",
    "link": "https://www.bostonherald.com/2025/03/25/china-byd-revenue/",
    "timestamp": "2025-03-25T16:47:08Z"
  },
  {
    "title": "The 5 at 5: Tuesday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-tuesday-191-6658929-Mar2025/",
    "timestamp": "2025-03-25T16:45:53Z"
  },
  {
    "title": "There Is No DeJoy In Mudville, Or In The Postal Service Either",
    "description": "Coming soon: No first-class delivery to Mudville.",
    "link": "https://www.wonkette.com/p/there-is-no-dejoy-in-mudville-or",
    "timestamp": "2025-03-25T16:45:15Z"
  },
  {
    "title": "Wisconsin Supreme Court race; early voting and spending surge",
    "description": "Turnout during the first week of early voting ahead of Wisconsin's pivotal state Supreme Court race is far exceeding levels from another high-stakes election just two years ago, the latest sign of the intense interest in a contest that has obliterated spendin…",
    "link": "https://www.fox6now.com/news/wisconsin-supreme-court-race",
    "timestamp": "2025-03-25T16:45:11Z"
  },
  {
    "title": "Signal event: Why US and European officials rely on the messaging app",
    "description": "No middleman, including service providers, and not even Signal itself, can access the message.",
    "link": "https://www.euractiv.com/section/tech/news/signal-event-why-us-and-european-officials-rely-on-the-messaging-app/",
    "timestamp": "2025-03-25T16:45:05Z"
  },
  {
    "title": "Did Pete Hegseth Break The Law Over War Plans? Experts Weigh In",
    "description": "The National Security Advisor allegedly invited a magazine editor into a chat where plans to bomb Yemen were discussed",
    "link": "https://www.newsweek.com/pete-hegseth-leak-atlantic-magazine-yemen-houthi-rebels-bombing-department-defense-2050195",
    "timestamp": "2025-03-25T16:45:00Z"
  },
  {
    "title": "Republican leaders eye extreme alternatives to impeaching federal judges",
    "description": "Congress' Republican leaders don't see the point in trying to impeach judges, but they have some dramatic alternatives in mind that are nearly as radical.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republican-leaders-eye-extreme-alternatives-impeaching-federal-judges-rcna198004",
    "timestamp": "2025-03-25T16:44:41Z"
  },
  {
    "title": "Democrats Are Reaching a Trump Tipping Point",
    "description": "The party leadership’s tepid response to Donald Trump’s agenda could provoke a grassroots insurgency by its own voters.",
    "link": "https://www.vanityfair.com/news/story/democrats-reaching-trump-tipping-point",
    "timestamp": "2025-03-25T16:44:18Z"
  },
  {
    "title": "CNN’s Enten: Americans Who Think Country on the Right Track Under Trump 'Through the Roof'",
    "description": "CNN senior data reporter Harry Enten said Tuesday on CNN's \"News Central\" that the percentage of Americans who believe the country is on the right track is \"through the roof\" in President Donald Trump's second term.\nThe post CNN’s Enten: Americans Who Think C…",
    "link": "https://www.breitbart.com/clips/2025/03/25/cnns-enten-americans-who-think-country-on-the-right-track-under-trump-through-the-roof/",
    "timestamp": "2025-03-25T16:43:39Z"
  },
  {
    "title": "Autocrats emboldened! World leaders invoke Trump to justify political crackdowns...",
    "description": "Autocrats emboldened! World leaders invoke Trump to justify political crackdowns...\r\n\n \n \n \n (Third column, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Putin just playing Don for time...",
    "link": "https://www.semafor.com/article/03/24/2025/some-world-leaders-invoke-trump-to-justify-political-crackdowns",
    "timestamp": "2025-03-25T16:43:38Z"
  },
  {
    "title": "Not the last Waltz: Trump defends NSA after security breach",
    "description": "US President Donald Trump rejected calls to fire National Security Advisor Michael Waltz after a security lapse involving an unsecured app to coordinate military strikes in Yemen. This exposed sensitive discussions about bombings and reimbursement expectation…",
    "link": "https://timesofindia.indiatimes.com/world/us/not-the-last-waltz-trump-defends-nsa-after-security-breach/articleshow/119490090.cms",
    "timestamp": "2025-03-25T16:43:32Z"
  },
  {
    "title": "Fired federal workers face choices now that a judge wants them rehired",
    "description": "Some employees have already decided to move on, fearing more reductions down the road.",
    "link": "https://www.bostonherald.com/2025/03/25/trump-fired-workers-rehired/",
    "timestamp": "2025-03-25T16:42:06Z"
  },
  {
    "title": "Mike Johnson Downplays Group Chat Leaks As 'Officials Doing Their Job,' Gets Torched On X",
    "description": "The House speaker told reporters Monday that Trump officials were merely \"executing on a plan with precision,\" despite their messages going public.",
    "link": "https://www.huffpost.com/entry/mike-johnson-downplays-group-chat-leaks-as-officials-doing-their-job-gets-torched-on-x_n_67e2a740e4b0210f1ba78098",
    "timestamp": "2025-03-25T16:42:04Z"
  },
  {
    "title": "Donald Trump to Launch External Revenue Service: What to Know",
    "description": "\"We're going to take in a lot of money from the outside and that's going to keep our taxes low,\" Said President Trump of the plan.",
    "link": "https://www.newsweek.com/donald-trump-external-revenue-service-tariffs-2050135",
    "timestamp": "2025-03-25T16:41:09Z"
  },
  {
    "title": "Small businesses prefer ‘minor’ adjustments over layoffs to deal with tariffs: poll",
    "description": "TORONTO — Small and medium business leaders say they could have to make minor adjustments to their operations in the short term to cope with widespread U.S. tariffs on Canadian goods, but more drastic measures may be needed later on. Companies say they prefer…",
    "link": "https://financialpost.com/pmn/small-businesses-prefer-minor-adjustments-over-layoffs-to-deal-with-tariffs-poll",
    "timestamp": "2025-03-25T16:40:49Z"
  },
  {
    "title": "Transgender Americans aim to block Trump’s passport policy change",
    "description": "The president is using a narrow definition of the sexes instead of a broader conception of gender.",
    "link": "https://www.bostonherald.com/2025/03/25/trump-transgender-passports/",
    "timestamp": "2025-03-25T16:39:48Z"
  },
  {
    "title": "Transgender Americans aim to block Trump’s passport policy change",
    "description": "The president is using a narrow definition of the sexes instead of a broader conception of gender.",
    "link": "https://www.denverpost.com/2025/03/25/trump-transgender-passports/",
    "timestamp": "2025-03-25T16:39:48Z"
  },
  {
    "title": "'Prelude to Privatizing Social Security': Cuts Came Straight From White House",
    "description": "The Trump administration's massive cuts to the agency that oversees Social Security benefits that are the primary source of income for 40% of American senior citizens came directly from the White House, the agency's acting administrator confirmed Monday as st…",
    "link": "https://www.commondreams.org/news/is-trump-cutting-social-security",
    "timestamp": "2025-03-25T16:38:54Z"
  },
  {
    "title": "Trump Isn’t Defying The Courts, He’s Defending The Constitution",
    "description": "The courts have an important constitutional role to fulfill. But it’s not to play president.On March 7, I argued in The Federalist that President Donald Trump should ignore a Supreme Court that would allow lower courts to refuse to uphold the Constitution and…",
    "link": "https://freerepublic.com/focus/f-news/4306674/posts",
    "timestamp": "2025-03-25T16:38:32Z"
  },
  {
    "title": "Wall Street sees Donald Trump 'doesn't care' about the market, says Morgan Stanley's Mike Wilson",
    "description": "Morgan Stanley’s Mike Wilson says it’s become clear to Wall Street that President Trump ‘doesn’t care’ about the stock market\nMike Wilson, chief U.S. equity strategist and chief investment officer of Morgan Stanley.\nVictor J. Blue—Bloomberg via Getty Images",
    "link": "https://biztoc.com/x/f447234f00ec03d7",
    "timestamp": "2025-03-25T16:37:43Z"
  },
  {
    "title": "Trump will be ‘pretty much satisfied’ with Elon Musk’s DOGE cuts in a few months, he tells Cabinet: ‘Our country was riddled with fat, and we’re getting rid of the fat’",
    "description": "The Elon Musk-championed Department of Government Efficiency (DOGE) could end its mass firings of federal employees in the next two or three months, President Donald Trump said in a Monday Cabinet meeting. Despite fears the cuts will have negative economic an…",
    "link": "https://biztoc.com/x/188706511eb518c6",
    "timestamp": "2025-03-25T16:37:42Z"
  },
  {
    "title": "US state media gets emergency cash injection",
    "description": "Radio Free Europe/Radio Liberty is set to receive money from its parent US government agency, the broadcaster has announced Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614747-us-state-media-funds/",
    "timestamp": "2025-03-25T16:36:51Z"
  },
  {
    "title": "For the first time, an undergraduate pro-Palestinian protester is facing deportation",
    "description": "Yunseo Chung is suing the Trump administration after agents tried to deport her over a pro-Palestinian protest, part of a broader effort targeting non-citizen students.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-847571",
    "timestamp": "2025-03-25T16:34:42Z"
  },
  {
    "title": "US says it brokered safe shipping in Black Sea in talks with Ukraine, Russia",
    "description": "The United States, Ukraine, and Russia have agreed to ensure safe navigation and prevent the use of commercial vessels for military purposes in the Black Sea. This agreement aims to revive a 2022 deal brokered by the UN and Turkey, which was halted by Russia …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-says-it-brokered-safe-shipping-in-black-sea-in-talks-with-ukraine-russia/articleshow/119490138.cms",
    "timestamp": "2025-03-25T16:33:49Z"
  },
  {
    "title": "Elon Musk’s ‘What Did You Do Last Week?’ Email Clogs Government Inbox",
    "description": "Elon Musk’s demand for federal workers to submit five bullet points detailing their week’s work has hit a new snag: the inbox is full.",
    "link": "https://www.livemint.com/companies/news/elon-musk-s-what-did-you-do-last-week-email-clogs-government-inbox-11742920361406.html",
    "timestamp": "2025-03-25T16:32:40Z"
  },
  {
    "title": "Homan says 'collaterals' were arrested during Boston operation",
    "description": "Tom Homan acknowledged that some of the immigrants wrapped up in a recent enforcement operation in Boston were not the intended targets of federal agents.",
    "link": "https://www.wcvb.com/article/homan-border-czar-boston-arrests/64286145",
    "timestamp": "2025-03-25T16:32:12Z"
  },
  {
    "title": "How CFOs Use Strategy To Tackle Risks",
    "description": "Also in the Forbes CFO newsletter: Businesses may lose a lifeline, stocks go up and consumer expectations go down, United and flight attendants say a contract is near.",
    "link": "https://www.forbes.com/sites/cfo/2025/03/25/how-cfos-use-strategy-to-tackle-risks/",
    "timestamp": "2025-03-25T16:31:59Z"
  },
  {
    "title": "Waltz Must Go",
    "description": "The national security advisor’s incompetence is one thing; chumminess with the enemies of the administration is another.\nThe post Waltz Must Go appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/waltz-must-go/",
    "timestamp": "2025-03-25T16:31:48Z"
  },
  {
    "title": "Trump Officials Ignored Major Pentagon Warning in War Plans Group Chat",
    "description": "Secretary of Defense Pete Hegseth’s ill-advised Signal chat planning an attack onYemen went against a Pentagon warning from last week, and even Department of Defense regulations altogether. \r\nAccording to NPR, a department-wide email went out last week warnin…",
    "link": "https://newrepublic.com/post/193145/trump-officials-ignored-pentagon-warning-war-plans-group-chat",
    "timestamp": "2025-03-25T16:31:34Z"
  },
  {
    "title": "What's With The Memes About Pete Hegseth Texting War Plans? The Atlantic Editor's Viral Article About The 'Houthi PC Small Group' Chat Explained",
    "description": "Secretary of defense Pete Hegseth is in hot water right now because he reportedly leaked confidential war plans to the editor-in-chief of the Atlantic. Here's what's going on.",
    "link": "https://knowyourmeme.com/editorials/guides/whats-with-the-memes-about-pete-hegseth-texting-war-plans-the-atlantic-editors-viral-article-about-the-houthi-pc-small-group-chat-explained",
    "timestamp": "2025-03-25T16:31:33Z"
  },
  {
    "title": "Why Is Consumer Confidence Tanking?",
    "description": "Consumer confidence in the economy is dropping to lows commonly seen during periods of high inflation, stagflation and recessions.",
    "link": "https://www.nerdwallet.com/article/finance/consumer-confidence-drop-2025#article",
    "timestamp": "2025-03-25T16:31:28Z"
  },
  {
    "title": "Israel releases Oscar-winning Palestinian director Hamdan Ballal after attack by Jewish settlers: official",
    "description": "The Oscar-winning director of a documentary on the Israel-Palestinian conflict was arrested late on Monday after being injured during a raid by Israeli settlers on his village in the occupied West Bank, a local official who was present said.",
    "link": "https://nypost.com/2025/03/25/world-news/israel-releases-oscar-winning-palestinian-director-hamdan-ballal-after-attack-by-jewish-settlers/",
    "timestamp": "2025-03-25T16:31:17Z"
  },
  {
    "title": "On US Visit, Estonia Warns Of Putin 'Upper Hand' Through Talks",
    "description": "Estonia's top diplomat said that Russia has gained an upper hand after President Donald Trump initiated talks to end the Ukraine war and suggested the United States consider a time limit if no progress.",
    "link": "https://www.ibtimes.com/us-visit-estonia-warns-putin-upper-hand-through-talks-3767544",
    "timestamp": "2025-03-25T16:30:14Z"
  },
  {
    "title": "Trump Is About to Be Pissed at Tulsi Gabbard’s Canada Admission",
    "description": "Director of National Intelligence Tulsi Gabbard absolutely—and accidentally—shredded Donald Trump’s phony reason for placing steep tariffs on Canada. \r\nDuring a Senate Intelligence Committee hearing Tuesday, Gabbard presented the Annual Threat Assessment (ATA…",
    "link": "https://newrepublic.com/post/193148/donald-trump-tulsi-gabbard-canada-fentanyl",
    "timestamp": "2025-03-25T16:30:14Z"
  },
  {
    "title": "370,000 jobs and $47 billion a year in GDP: This American state could be disproportionately impacted by Donald Trump's tariffs; here's why",
    "description": "Texas will be hit the hardest due to the Trump administration's tariffs on imports, with potential job losses reaching 370,000 annually and a GDP decrease of up to $47 billion. The tariffs primarily affect trade with Mexico, Canada's second-largest trade part…",
    "link": "https://economictimes.indiatimes.com/news/international/us/370000-jobs-and-47-billion-a-year-in-gdp-this-american-state-could-be-disproportionately-impacted-by-donald-trumps-tariffs-heres-why/articleshow/119488750.cms",
    "timestamp": "2025-03-25T16:30:13Z"
  },
  {
    "title": "China’s Purchases Stall After Trump’s Tariff Threat on Buyers of Venezuelan Oil",
    "description": "China, the biggest buyer of oil from Venezuela, saw trade with Venezuela stall on Tuesday after U.S. President Donald Trump threatened on Monday 25% tariffs on the goods of any country buying Venezuelan oil. Traders and refiners in China were caught off guard…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Chinas-Purchases-Stall-After-Trumps-Tariff-Threat-on-Buyers-of-Venezuelan-Oil.html",
    "timestamp": "2025-03-25T16:30:00Z"
  },
  {
    "title": "US says it brokered safe shipping in the Black Sea in talks with Ukraine and Russia",
    "description": "The agreement appears to mark a revival of a 2022 agreement to ensure safe transit via Ukraine’s Black Sea ports.",
    "link": "https://www.bostonherald.com/2025/03/25/russia-ukraine-us-black-sea/",
    "timestamp": "2025-03-25T16:29:55Z"
  },
  {
    "title": "The Bully Lie",
    "description": "In this episode of This American Life from a few weeks ago, Masha Gessen read an excerpt from their book Surviving Autocracy about",
    "link": "https://kottke.org/25/03/the-bully-lie",
    "timestamp": "2025-03-25T16:29:53Z"
  },
  {
    "title": "Trump Admin Intel Officials Say No Classified Information Was Leaked In Signal Messages",
    "description": "Intelligence officials within President Donald Trump's administration said Tuesday there was no classified information in the leaked war plans.",
    "link": "https://dailycaller.com/2025/03/25/trump-admin-intel-classified-information-signal/",
    "timestamp": "2025-03-25T16:29:39Z"
  },
  {
    "title": "Why Climate Change Is Making Greenland More Desirable to Trump",
    "description": "Climate change may be opening up new economic and strategic opportunities in Greenland. But the reality is more complicated.",
    "link": "https://time.com/7271481/climate-change-greenland-trump/",
    "timestamp": "2025-03-25T16:29:36Z"
  },
  {
    "title": "U.S. consumer confidence tumbles for the 4th straight month amid tariff and inflation concerns",
    "description": "The Conference Board's report Tuesday said that the measure of Americans' short-term expectations for income, business and the job market fell 9.6 points to 65.2 - the lowest reading in 12 years.",
    "link": "https://www.pbs.org/newshour/economy/u-s-consumer-confidence-tumbles-for-the-4th-straight-month-amid-tariff-and-inflation-concerns",
    "timestamp": "2025-03-25T16:28:28Z"
  },
  {
    "title": "On US visit, Estonia warns of Putin ‘upper hand’ through talks",
    "description": "Estonia’s top diplomat said that Russia has gained an upper hand after President Donald Trump initiated talks to end the Ukraine war and suggested the United States consider a time limit if no progress. Estonian Foreign Minister Margus Tsahkna and his counter…",
    "link": "https://www.digitaljournal.com/world/on-us-visit-estonia-warns-of-putin-upper-hand-through-talks/article",
    "timestamp": "2025-03-25T16:28:13Z"
  },
  {
    "title": "Trump Considers Two-Step Tariffs",
    "description": "\"Donald Trump is considering a two-step approach to his new tariff regime, deploying rarely used powers to impose emergency duties while probes into trading partners are completed,\" the Financial Times reports. \"The latest mixed message",
    "link": "https://politicalwire.com/2025/03/25/trump-considers-two-step-tariffs/",
    "timestamp": "2025-03-25T16:27:18Z"
  },
  {
    "title": "But Their Signal Chats: Trump Officials Share War Plans With Journalist",
    "description": "Look, I know you’ve probably already seen yesterday’s absolutely stunning story from Jeffrey Goldberg at The Atlantic. The one where Trump administration officials somehow managed to add a journalist to their Signal group chat while planning out their bombing…",
    "link": "https://www.techdirt.com/2025/03/25/but-their-signal-chats-trump-officials-share-war-plans-with-journalist/",
    "timestamp": "2025-03-25T16:27:00Z"
  },
  {
    "title": "In Gaza, We Now Ask: Will It Be the Cold, Hunger or Airstrikes That Kill Us?",
    "description": "This week many Palestinians fled their tents amid airstrikes and icy storms, but where will they go? Where is safety?",
    "link": "https://truthout.org/articles/in-gaza-we-now-ask-will-it-be-the-cold-hunger-or-airstrikes-that-kill-us/",
    "timestamp": "2025-03-25T16:26:44Z"
  },
  {
    "title": "Pete Hegseth Ripped As ‘Careless,' ‘Incompetent’ Amid Calls To Resign Or Be Fired",
    "description": "The National Review’s executive editor was among those urging Trump to “hold someone accountable” while slamming the men’s credibility and intelligence.",
    "link": "https://www.huffpost.com/entry/pete-hegseth-mike-waltz-calls-resign-fired_n_67e2a38fe4b0014ccec80915",
    "timestamp": "2025-03-25T16:26:40Z"
  },
  {
    "title": "U.S. says agreement has been reached in the Black Sea in talks with Ukraine and Russia",
    "description": "A joint statement said the sides have \"agreed to ensure safe navigation, eliminate the use of force, and prevent the use of commercial vessels for military purposes in the Black Sea.\"",
    "link": "https://www.pbs.org/newshour/world/u-s-says-agreement-has-been-reached-in-the-black-sea-in-talks-with-ukraine-and-russia",
    "timestamp": "2025-03-25T16:26:09Z"
  },
  {
    "title": "Is Justice Coming? Hillary Clinton and Soros-Linked Law Firm in Trump’s Crosshairs",
    "description": "US President Donald Trump is closing in on Hillary Clinton and other orchestrators of the Russia collusion hoax, Wall Street analyst Charles Ortel tells Sputnik.",
    "link": "https://sputnikglobe.com/20250325/is-justice-coming-hillary-clinton-and-soros-linked-law-firm-in-trumps-crosshairs-1121690154.html",
    "timestamp": "2025-03-25T16:25:59Z"
  },
  {
    "title": "US says it has brokered agreement on safe navigation in the Black Sea in Ukraine-Russia talks",
    "description": "Details of the prospective deal are yet to be released.",
    "link": "https://www.thejournal.ie/us-says-it-has-brokered-agreement-on-safe-navigation-in-the-black-sea-in-ukraine-russia-talks-6658915-Mar2025/",
    "timestamp": "2025-03-25T16:25:44Z"
  },
  {
    "title": "Democrat decries FBI task force to crackdown on Tesla attacks: 'Political weaponization of the DOJ'",
    "description": "Democratic Rep. Daniel Goldman of New York decries formation of FBI task force to crack down on spate of Tesla-related crimes, calling it \"political weaponization of the DOJ.\"",
    "link": "https://www.foxnews.com/politics/democrat-decries-fbi-task-force-crackdown-tesla-attacks-political-weaponization-doj",
    "timestamp": "2025-03-25T16:24:06Z"
  },
  {
    "title": "Trump admin cuts additional $1M in federal funding for 'transgender animal' experiments",
    "description": "The National Institute of Health quietly cut over $1 million in federally funded research evaluating if rats going through hormone therapy were more likely to overdose on a popular party drug.",
    "link": "https://www.foxnews.com/politics/trump-admin-cuts-additional-1m-funding-transgender-animal-experiments",
    "timestamp": "2025-03-25T16:22:25Z"
  },
  {
    "title": "DOGE Cuts Update Today: Social Security Records Changed For Millions",
    "description": "DOGE said the Social Security Administration has been executing a \"major cleanup\" of records for the past three weeks.",
    "link": "https://www.newsweek.com/doge-cuts-update-today-social-security-records-changed-2050110",
    "timestamp": "2025-03-25T16:22:05Z"
  },
  {
    "title": "Republican Senator Skips Town Hall, Sends Donuts Instead",
    "description": "Jim Banks, an Indiana Republican, cancels meeting with constituents saying it was staged by Democrats against Trump.",
    "link": "https://www.newsweek.com/senator-jim-banks-donut-2050053",
    "timestamp": "2025-03-25T16:21:26Z"
  },
  {
    "title": "New on Crave: April 2025",
    "description": "Bell Media has shared its list of new titles coming to its streaming service Crave in April 2025. Kicking things off on April 4 is The Apprentice, a drama about a young Donald Trump, and Flow, the Oscar-winning animated film about animals surviving a massive …",
    "link": "https://www.iphoneincanada.ca/2025/03/25/new-on-crave-april-2025/",
    "timestamp": "2025-03-25T16:17:49Z"
  },
  {
    "title": "Before He Sent War Plans in a Non-Secure Groupchat, the Head of the Pentagon Said People Who Did That Should Be Fired",
    "description": "Defense Secretary Pete Hegseth used to think that sharing classified information in insecure channels was a fireable offense — until he got caught doing it himself. Following the stunning revelation from The Atlantic's editor-in-chief Jeffrey Goldberg that he…",
    "link": "https://futurism.com/pentagon-hegseth-groupchat-hillary",
    "timestamp": "2025-03-25T16:16:53Z"
  },
  {
    "title": "Video Shows Ukraine's Rarog Regiment Wipe Out Russian BREM-1",
    "description": "\"You can count how many drones they used to completely destroy this armored vehicle,\" Ukraine's government said in a post to social media.",
    "link": "https://www.newsweek.com/video-russia-ukraine-drone-attack-brem1-armored-vehicle-2050190",
    "timestamp": "2025-03-25T16:16:46Z"
  },
  {
    "title": "Trump’s Columbia Funding Halt Draws Suit From Academic Unions",
    "description": "Two educational unions sued the Trump administration over its withholding of $400 million in federal funding from Columbia University, calling the move an illegal attempt to limit academic independence and free speech on campus.",
    "link": "https://www.livemint.com/companies/news/trumps-columbia-funding-halt-draws-suit-from-academic-unions-11742919374542.html",
    "timestamp": "2025-03-25T16:16:14Z"
  },
  {
    "title": "'He doesn’t really do much in the morning': Trump's frantic late-night activity, unusual work schedule revealed",
    "description": "CNN anchor Kaitlan Collins has shared some insight into President Donald Trump's daily work routine in the White House. The anchor explained that the President 'doesn't really do much in the morning' and remains busy in the afternoon. Collins’ insights into T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-donald-trump-cnn-anchor-kaitlan-collins-he-doesnt-really-do-much-in-the-morning-trumps-frantic-late-night-activity-unusual-work-schedule-revealed/articleshow/119489410.cms",
    "timestamp": "2025-03-25T16:16:09Z"
  },
  {
    "title": "On Judicial Impeachments",
    "description": "Over at The Dispatch, I have a new piece on the impeachment of federal judges. In a Truth social post, President Donald Trump did what no sitting president has done before, publicly called for the impeachment of a federal judge. In doing so, he stoked the fla…",
    "link": "https://biztoc.com/x/46a3a58848bd9f8c",
    "timestamp": "2025-03-25T16:15:12Z"
  },
  {
    "title": "Greek Orthodox archbishop praises Trump for Middle East Christian support, gives him cross",
    "description": "“Let this cross guide you as it once guided Constantine,” said Archbishop Elpidophoros of the Greek Orthodox Archdiocese of America upon presenting President Trump with a holy cross at the White House on March 24, 2025. / Credit: Courtesy of the White House/S…",
    "link": "https://www.catholicnewsagency.com/news/262935/archbishop-praises-trump-for-middle-east-christian-support-hands-him-cross",
    "timestamp": "2025-03-25T16:15:00Z"
  },
  {
    "title": "Tariffs Explained: Which Are In Effect and What They Mean for Your Costs",
    "description": "President Donald Trump's tariff plans have been messy and uncertain, with effective dates shuffled around multiple times and still more threatened.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-which-are-in-effect-and-what-they-mean-for-your-costs/",
    "timestamp": "2025-03-25T16:15:00Z"
  },
  {
    "title": "Healey blasts Trump hold on $50M in ‘critical funding’ for lead pipe replacement",
    "description": "Gov. Maura Healey accused President Donald Trump’s administration of delaying the release of more than $50 million in “critical funds” for lead pipe replacement in Massachusetts, critical cash the governor argued would help remove lead from drinking water acr…",
    "link": "https://www.bostonherald.com/2025/03/25/healey-blasts-trump-hold-on-50m-in-critical-funding-for-lead-pipe-replacement/",
    "timestamp": "2025-03-25T16:13:39Z"
  },
  {
    "title": "EU ‘contradicting’ US on Ukraine – Lavrov",
    "description": "The bloc’s push for Kiev’s NATO membership runs counter to the Trump administration’s position, according to Sergey Lavrov Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614743-eu-ukraine-nato-us/",
    "timestamp": "2025-03-25T16:09:43Z"
  },
  {
    "title": "Lesotho's king warns nation will reel from Trump cuts",
    "description": "Lesotho will suffer from Donald Trump's aid cuts and stands to lose up to 40,000 jobs if the US president also cancels a trade pact granting duty-free access...",
    "link": "https://www.yahoo.com/news/lesothos-king-warns-nation-reel-160906832.html",
    "timestamp": "2025-03-25T16:09:06Z"
  },
  {
    "title": "'Here Are the Facts': Karoline Leavitt Issues Blistering Response to Report About Leaked 'War Plans'",
    "description": "\"White House Counsel’s Office has provided guidance on a number of different platforms for President Trump’s top officials to communicate...\"",
    "link": "https://www.westernjournal.com/facts-karoline-leavitt-issues-blistering-response-report-leaked-war-plans/",
    "timestamp": "2025-03-25T16:08:39Z"
  },
  {
    "title": "Full List of Trump Officials on Signal Text Chain With Journalist",
    "description": "Trump administration officials are facing criticism over the text chain on the Signal app.",
    "link": "https://www.newsweek.com/full-list-trump-officials-signal-text-journalist-2050177",
    "timestamp": "2025-03-25T16:08:30Z"
  },
  {
    "title": "White House denies 'war plans' discussed in Signal chat on Yemen",
    "description": "\"At this time, the message thread that was reported appears to be authentic, and we are reviewing how an inadvertent number was added to the chain,\" the NSC said.",
    "link": "https://abcnews.go.com/Politics/white-house-denies-war-plans-classified-information-discussed/story?id=120126088",
    "timestamp": "2025-03-25T16:08:29Z"
  },
  {
    "title": "If Hillary’s Emails Were Disqualifying, So Is Team Trump’s Group Chat",
    "description": "As Team Trump blames the messenger (Jeffrey Goldberg) for disclosing its incompetent handling of sensitive national-security discussions, it owes HRC an apology for many attacks on her emails in 2016 and beyond.",
    "link": "http://nymag.com/intelligencer/article/hillary-clinton-email-group-chat-signal-waltz-hegseth.html",
    "timestamp": "2025-03-25T16:08:03Z"
  },
  {
    "title": "Lib Who Once Said She Watched Tucker Carlson For A Living Announces Congressional Run",
    "description": "Progressive reporter Kat Abughazaleh announced Monday she's running for Congress in Illinois, after spending her time watching Tucker Carlson for a living.",
    "link": "https://dailycaller.com/2025/03/25/kat-abughazaleh-jan-shackowski-primary-illinois/",
    "timestamp": "2025-03-25T16:06:43Z"
  },
  {
    "title": "Dem Rep. Kaptur: Dems Don’t Have a Plan for Economic Progress",
    "description": "During portions of an interview with NPR aired on Monday’s broadcast of “All Things Considered,” Rep. Marcy Kaptur (D-OH) declared that Democrats “better shape up and put together a plan for progress, starting in the places that have fallen behind where peopl…",
    "link": "https://freerepublic.com/focus/f-news/4306671/posts",
    "timestamp": "2025-03-25T16:06:35Z"
  },
  {
    "title": "U.S. Says It Brokered Safe Shipping In The Black Sea In Talks With Ukraine And Russia",
    "description": "The White House said the two countries agreed to develop measures for implementing a deal to ban strikes against energy facilities.",
    "link": "https://www.huffpost.com/entry/us-says-it-brokered-safe-shipping-black-sea-russia-ukraine_n_67e2d31ae4b06ded8a6f3dea",
    "timestamp": "2025-03-25T16:06:16Z"
  },
  {
    "title": "The White House reception, Trump’s historic proclamation on March 25th, and the Greek Americans – “We love you all”",
    "description": "“The cornerstone of security and stability in Europe” – this is how the President of the United States described Greek-American military cooperation. Find out which Greek Americans he mentioned by name and who he called to the podium\nThe post The White House …",
    "link": "https://en.protothema.gr/2025/03/25/the-white-house-reception-trumps-historic-proclamation-on-march-25th-and-the-greek-americans-we-love-you-all/",
    "timestamp": "2025-03-25T16:05:48Z"
  },
  {
    "title": "On Judicial Impeachments",
    "description": "Over at The Dispatch, I have a new piece on the impeachment of federal judges. As a matter of constitutional principle, the abuse of power by a federal judge might well justify impeachment and removal, but identifying such abuses of powers is likely to be dif…",
    "link": "https://reason.com/volokh/2025/03/25/on-judicial-impeachments/",
    "timestamp": "2025-03-25T16:04:01Z"
  },
  {
    "title": "Pam Bondi Now Wants Jasmine Crockett To Apologize For Promoting Peaceful Protest",
    "description": "The attorney general cynically continued to criticize the Democratic congresswoman over her Tesla beef.",
    "link": "https://www.huffpost.com/entry/pam-bondi-apologize-jasmine-crockett-tesla-shareholders_n_67e2a17ee4b0014ccec80806",
    "timestamp": "2025-03-25T16:03:25Z"
  },
  {
    "title": "Trump picks acting CDC director Susan Monarez to lead the agency",
    "description": "President Donald Trump has selected Susan Monarez as his new nominee to head the Centers for Disease Control and Prevention. Monarez, a scientist whose previous work looked at using artificial intelligence to improve health, has already been serving as acting…",
    "link": "https://freerepublic.com/focus/f-news/4306670/posts",
    "timestamp": "2025-03-25T16:03:21Z"
  },
  {
    "title": "Trump reveals who was behind Signal text chain leak",
    "description": "President Donald Trump revealed a staffer with national security advisor Mike Waltz's office added the editor in chief of the Atlantic to a Signal group chat.",
    "link": "https://www.foxnews.com/politics/trump-reveals-who-behind-signal-text-chain-leak",
    "timestamp": "2025-03-25T16:02:32Z"
  },
  {
    "title": "Joy Behar Interrupts Alyssa Farah Griffin To Question If She Really Worked On Pentagon “War Plans” Before Joining ‘The View’",
    "description": "\"I never heard that before.\"",
    "link": "https://decider.com/2025/03/25/joy-behar-alyssa-farah-griffin-question-pentagon-war-plans-the-view/",
    "timestamp": "2025-03-25T16:02:03Z"
  },
  {
    "title": "Apple and Google face $850 billion liability from TikTok ban",
    "description": "TikTok was banned in the United States on January 19, only to be reinstated 13 hours later by an executive order from President Donald Trump.\n\nHe postponed the divestment deadline to April 5, but as the date approaches and the situation has not been resolved,…",
    "link": "https://www.gsmarena.com/apple_and_google_face_850_billion_liability_from_tiktok_ban-news-67093.php",
    "timestamp": "2025-03-25T16:02:02Z"
  },
  {
    "title": "'Futile exercise': House GOP push to impeach judges blocking Trump fizzles out",
    "description": "House Republicans are coalescing around Rep. Darrell Issa's bill to limit judges' ability to issue nationwide injunctions as a push for judicial impeachments appears to fizzle.",
    "link": "https://www.foxnews.com/politics/futile-exercise-house-gop-push-impeach-judges-blocking-trump-fizzles-out",
    "timestamp": "2025-03-25T16:00:12Z"
  },
  {
    "title": "Trump's Tariffs on Venezuelan Crude Spark Bullish Sentiment in Oil Markets",
    "description": "Trump's decision to place sanctions on any country buying Venezuela's oil has sparked some bullishness in oil markets this week.- As London-based energy major Shell (LON:SHEL) issued its 2024 annual report ahead of this year’s Annual General Meeting, its gene…",
    "link": "https://oilprice.com/Energy/Energy-General/Trumps-Tariffs-on-Venezuelan-Crude-Spark-Bullish-Sentiment-in-Oil-Markets.html",
    "timestamp": "2025-03-25T16:00:00Z"
  },
  {
    "title": "Jeff Tiedrich: What’s Going on with National Security, Pete?",
    "description": "The funniest blog out there is Jeff Tiedrich’s “everyone is entitled to my own opinion.” He is all over the scandal of Pete Hegseth & Co. including Jeffrey Goldberg, editor-in-chief of The Atlantic, on a top-secret texting group that discussed war plans. The …",
    "link": "https://dianeravitch.net/2025/03/25/jeff-tiedrich-whats-going-on-with-national-security-pete/",
    "timestamp": "2025-03-25T16:00:00Z"
  },
  {
    "title": "Ex VCU professor says he was fired by Wilder school for not springing question on Avula",
    "description": "He says he was fired after declining to ask Mayor Avula a question about VCU Health’s failed development deal on behalf of former Gov. Doug Wilder during a Wednesday Q-and-A.",
    "link": "https://richmond.com/news/local/government-politics/article_bdc75f85-a958-4647-a339-e42c31712fb2.html",
    "timestamp": "2025-03-25T16:00:00Z"
  },
  {
    "title": "Fire after leaked White House chat: \"I hate having to rescue Europe again\"",
    "description": "It all started as a supposed mistake. The Atlantic editor-in-chief Jeffrey Goldberg was added, possibly by a slip of the tongue, to a group chat of prominent members of the Donald",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/03/25/67e2d0aa22601dad378b45a3.html",
    "timestamp": "2025-03-25T15:59:31Z"
  },
  {
    "title": "Nevada investigates more than 300 potential voter fraud cases from 2024 election",
    "description": "After the 2024 election, the state of Nevada says it is investigating more than 300 cases of people attempting to vote twice in the state.",
    "link": "https://www.foxnews.com/us/nevada-investigates-more-than-300-potential-voter-fraud-cases-2024-election",
    "timestamp": "2025-03-25T15:58:46Z"
  },
  {
    "title": "Trump's Attack on the Courts Channels the Worst of Theodore Roosevelt",
    "description": "An unconstitutional act is still unconstitutional even if lots of people support it.",
    "link": "https://reason.com/2025/03/25/trumps-attack-on-the-courts-channels-the-worst-of-theodore-roosevelt/",
    "timestamp": "2025-03-25T15:58:27Z"
  },
  {
    "title": "How to Take Action to Protest Trump Administration’s Attacks on Democracy",
    "description": "As the Trump administration escalates its attacks on democracy, Americans are fighting back—from the streets to the checkout aisle to the halls of Congress. Whether by joining nationwide protests, boycotting corporations that fund anti-democratic policies, or…",
    "link": "https://msmagazine.com/2025/03/25/trump-musk-protest-march-target-dei-boycott-black-faith-leaders-lent/",
    "timestamp": "2025-03-25T15:57:53Z"
  },
  {
    "title": "EU unveils critical material projects to cut China dependence",
    "description": "The EU unveiled dozens of projects Tuesday to ramp up extraction of critical raw materials in Europe as the bloc seeks to reduce its over-reliance on China. The Covid pandemic and Russia’s invasion of Ukraine exposed the European Union’s reliance on foreign s…",
    "link": "https://www.digitaljournal.com/world/eu-unveils-critical-material-projects-to-cut-china-dependence/article",
    "timestamp": "2025-03-25T15:57:20Z"
  },
  {
    "title": "US says Russia, Ukraine agree to end Black Sea military action",
    "description": "Russia and Ukraine agreed Tuesday to halt military strikes in the Black Sea, achieving a tentative first step towards peace in talks with the United States held in Saudi Arabia. With President Donald Trump pushing for a rapid end to the war that has killed te…",
    "link": "https://www.digitaljournal.com/world/us-says-russia-ukraine-agree-to-end-black-sea-military-action/article",
    "timestamp": "2025-03-25T15:57:20Z"
  },
  {
    "title": "A Third Of All DC District Judges Were Not Born In United States",
    "description": "Of all the judges in the U.S. all five foreign-born judges of the D.C. court managed to get their fingerprints on controversial Trump cases.",
    "link": "https://thefederalist.com/2025/03/25/a-third-of-all-dc-district-judges-were-not-born-in-united-states/",
    "timestamp": "2025-03-25T15:56:12Z"
  },
  {
    "title": "Louis DeJoy steps down as Trump eyes radical plans for the future of the USPS",
    "description": "As Postmaster General Louis DeJoy exits, there's no shortage of questions about the White House's plans for the U.S. Postal Service.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/louis-dejoy-retires-trump-usps-rcna197993",
    "timestamp": "2025-03-25T15:55:47Z"
  },
  {
    "title": "Democrats blast Trump officials over Signal chat 'fiasco' on Yemen airstrikes",
    "description": "A previously scheduled U.S. Senate intelligence committee hearing on global threats was upstaged Tuesday by the revelation that top Trump administration officials mistakenly disclosed war plans in a messaging group that included a journalist shortly before th…",
    "link": "https://www.cbc.ca/news/world/us-senate-intelligence-yemen-signal-1.7492483",
    "timestamp": "2025-03-25T15:55:12Z"
  },
  {
    "title": "Ryan Day confirms national champion Ohio State will visit White House on April 14",
    "description": "Ohio State’s visit comes after it wraps up spring football practices.",
    "link": "https://www.nbcsports.com/college-football/news/ryan-day-confirms-national-champion-ohio-state-will-visit-white-house-on-april-14",
    "timestamp": "2025-03-25T15:54:43Z"
  },
  {
    "title": "WATCH: Rosie O'Donnell V The Don! Comic Accuses Trump of Being 'Out to Get Her' for 20 Years In Loud-Mouthed Interview — After Fleeing U.S. in Protest of His Second Presidency",
    "description": "Rosie O'Donnell said her feud with Donald Trump began roughly 20 years ago, when she spoke the 'truth' about him during an episode of The View.",
    "link": "https://radaronline.com/p/rosie-odonnell-accuses-donald-trump-interview-flee-america-presidency/",
    "timestamp": "2025-03-25T15:54:03Z"
  },
  {
    "title": "The Trump administration axes funding for climate impacts on health research",
    "description": "A growing body of evidence points to mounting health risks posed by climate change. Despite this, it seems the National Institutes of Health (NIH) will quit funding that kind of research. ProPublica first reported the news on Monday, citing internal records t…",
    "link": "https://www.theverge.com/news/635322/health-climate-change-funding-trump-nih-hhs",
    "timestamp": "2025-03-25T15:53:05Z"
  },
  {
    "title": "GOP-led states push for unfettered school aid as Trump promises a smaller federal role in education",
    "description": "Republican-led states are pushing the Trump Administration to lump all school aid. They argue it would save from onerous reporting requirements.",
    "link": "https://www.bostonherald.com/2025/03/25/trump-gop-unfettered-school-aid/",
    "timestamp": "2025-03-25T15:52:45Z"
  }
]