[
  {
    "title": "Trump wants to ban large investors from buying houses",
    "description": "President Donald Trump said Wednesday that he wants to block large institutional investors from buying houses, saying that a ban would make it easier for younger families to buy their first homes.",
    "link": "https://www.bostonherald.com/2026/01/07/trump-wants-to-ban-large-investors-from-buying-houses/",
    "timestamp": "2026-01-07T21:45:44Z"
  },
  {
    "title": "Trump Is Betting MAGA Fans Will Relish an Expanded War on Drugs",
    "description": "Trump’s invasion of Venezuela fuses the “war on drugs” with the “war on terror.”…",
    "link": "https://truthout.org/articles/trump-is-betting-maga-fans-will-relish-an-expanded-war-on-drugs/",
    "timestamp": "2026-01-07T21:45:08Z"
  },
  {
    "title": "Walz gives order to prepare National Guard after ICE officer fatally shoots woman in Minneapolis",
    "description": "Minnesota Gov. Tim Walz says the state \"doesn't need any further help from the federal government\" after federal officials reported a U.S. Immigration and Customs Enforcement officer fatally shot a woman Wednesday morning​ in south Minneapolis.",
    "link": "https://www.cbsnews.com/minnesota/news/walz-natinal-guard-ice-officer-fatal-shooting-minneapolis/",
    "timestamp": "2026-01-07T21:45:00Z"
  },
  {
    "title": "Kai Trump Undergoes Surgery: What to Know",
    "description": "President Donald Trump's granddaughter, Kai, announced on Instagram on Wednesday that she underwent surgery for her hand.\nKai, who recently committed to playing golf at the University of Miami next year, said she had surgery on her left wrist to fix injuries …",
    "link": "https://biztoc.com/x/46e5a1b0ad06942b",
    "timestamp": "2026-01-07T21:44:54Z"
  },
  {
    "title": "Trump tells Republicans to be ‘flexible’ on abortion restrictions for health care deal",
    "description": "President Trump urged Republicans Tuesday to get a health care insurance deal done by being flexible on a long-standing budget policy that bars federal money from being spent on abortion services.",
    "link": "https://www.mlive.com/politics/2026/01/trump-tells-republicans-to-be-flexible-on-abortion-restrictions-for-health-care-deal.html",
    "timestamp": "2026-01-07T21:44:50Z"
  },
  {
    "title": "Trump Secures Deal for 30-50 Million Barrels of Venezuelan Oil at Market Prices",
    "description": "Donald Trump announces a deal for the US to buy 30–50 million barrels of Venezuelan oil after Maduro's capture, rattling markets, cutting prices; Russia warns.",
    "link": "https://www.ibtimes.com/trump-secures-deal-30-50-million-barrels-venezuelan-oil-market-prices-3794667",
    "timestamp": "2026-01-07T21:44:39Z"
  },
  {
    "title": "Johnson praises Trump's 'bold action' in formal State of the Union invitation letter to Congress",
    "description": "House Speaker Mike Johnson formally invited President Donald Trump to address a joint session of Congress next month for the annual State of the Union.",
    "link": "https://www.foxnews.com/politics/johnson-praises-trumps-bold-action-formal-state-union-invitation-letter-congress",
    "timestamp": "2026-01-07T21:43:39Z"
  },
  {
    "title": "China Takes Offense at Trump Declaring ‘This Is Our Hemisphere’ After Nicolas Maduro Raid",
    "description": "The Chinese Foreign Ministry on Wednesday took great umbrage at the U.S. State Department for proclaiming the Western hemisphere is “OUR hemisphere,” and interference from hostile foreign powers like China would no longer be tolerated.\nThe post China Takes Of…",
    "link": "https://www.breitbart.com/national-security/2026/01/07/china-takes-offense-at-trump-declaring-this-is-our-hemisphere-after-nicolas-maduro-raid/",
    "timestamp": "2026-01-07T21:42:49Z"
  },
  {
    "title": "Trump immigration policies and aging population slow U.S. growth projection, budget office says",
    "description": "The U.S. population is projected to grow by 15 million in 30 years, a smaller estimate than in previous years, due to President Donald Trump's hard-line immigration policies and an aging population, the Congressional Budget Office said Wednesday. The nonparti…",
    "link": "https://japantoday.com/category/business/trump-immigration-policies-and-aging-population-slow-us-growth-projection-budget-office-says",
    "timestamp": "2026-01-07T21:42:43Z"
  },
  {
    "title": "Warner Bros rejects Paramount takeover again and tells shareholders to stick with Netflix bid",
    "description": "Warner Bros. again rejected a takeover bid from Paramount and told shareholders Wednesday to stick with a rival offer from Netflix.  Warner’s leadership has repeatedly rebuffed Skydance-owned Paramount’s overtures — and urged shareholders just weeks ago to ba…",
    "link": "https://japantoday.com/category/business/warner-bros-rejects-takeover-offer-from-paramount-tells-shareholders-to-stick-with-netflix-bid1",
    "timestamp": "2026-01-07T21:42:32Z"
  },
  {
    "title": "San Francisco-based Opendoor's stock dives after Trump mulls banning institutions from buying homes",
    "description": "The tech company that enables homeowners to instantly buy and sell properties could be caught up in a potential ban on large institutions buying homes proposed by President Donald Trump.",
    "link": "https://biztoc.com/x/9abdc499a55b4d74",
    "timestamp": "2026-01-07T21:40:59Z"
  },
  {
    "title": "Secret World Deal? Explosive Claim Says Putin and Trump Planned to Trade Ukraine for Venezuela",
    "description": "This investigative report examines claims that Vladimir Putin and Donald Trump considered a covert geopolitical swap of Ukraine for Venezuela, grounded in primary source testimony from former Trump Russia adviser Fiona Hill and official records.",
    "link": "https://www.ibtimes.com/secret-world-deal-explosive-claim-says-putin-trump-planned-trade-ukraine-venezuela-3794649",
    "timestamp": "2026-01-07T21:39:48Z"
  },
  {
    "title": "John Bolton Slams Trump for Sidelining Machado in Venezuelan Transition: 'I Don't Think He Understands Anything'",
    "description": "Former national security adviser John Bolton said President Donald Trump does not understand the situation in Venezuela and is making a mistake by sidelining opposition leader María Corina Machado.",
    "link": "https://www.ibtimes.com/john-bolton-slams-trump-sidelining-machado-venezuelan-transition-i-dont-think-he-understands-3794642",
    "timestamp": "2026-01-07T21:39:02Z"
  },
  {
    "title": "US federal agent fatally shoots woman amid Minneapolis crackdown",
    "description": "Shooting comes as Trump administration ramped up promised crackdown on illegal immigration in Minnesota",
    "link": "https://www.irishtimes.com/world/us/2026/01/07/us-federal-agent-fatally-shoots-woman-amid-minneapolis-crackdown-2/",
    "timestamp": "2026-01-07T21:38:59Z"
  },
  {
    "title": "Can anyone stop Trump from seizing Greenland?",
    "description": "No one is laughing about Greenland anymore. President Donald Trump’s frequently expressed desire for the US to take possession of the world’s largest island may once have been treated as a lark, troll, or distraction, but following last week’s capture of Vene…",
    "link": "https://www.vox.com/politics/474396/trump-greenland-europe-miltiary-sanctions",
    "timestamp": "2026-01-07T21:38:46Z"
  },
  {
    "title": "‘BEWARE’: Trump Tells Defense Industry No More Huge Payouts Until Weapons Come Faster, Better",
    "description": "Trump warned major defense contractors that he would block stock buybacks and curb executive compensation until companies ramp up weapons production.",
    "link": "https://dailycaller.com/2026/01/07/beware-trump-tells-defense-industry-no-more-huge-payouts-until-weapons-come-faster-better/",
    "timestamp": "2026-01-07T21:38:34Z"
  },
  {
    "title": "Zelenskiy seeks new Trump meeting as peace negotiators tackle land issue",
    "description": "Ukrainian President Volodymyr Zelenskyy said on Wednesday he wanted a new meeting with U.S. President Donald Trump as their officials revisited the two most problematic issues ‌in talks aimed at ending Russia's war in Ukraine. Kyiv is under U.S. pressure to s…",
    "link": "https://japantoday.com/category/world/zelenskiy-seeks-new-trump-meeting-as-peace-negotiators-tackle-land-issue1",
    "timestamp": "2026-01-07T21:38:09Z"
  },
  {
    "title": "Venezuela's Opposition Leader Machado Warns that Country's New Interim Leader Is 'Even More Ruthless' Than Maduro",
    "description": "Venezuelan opposition leader María Corina Machado warned that the country's interim president, Delcy Rodríguez, is \"even more ruthless\" than the ousted leader Nicolás Maduro.",
    "link": "https://www.ibtimes.com/venezuelas-opposition-leader-machado-warns-that-countrys-new-interim-leader-even-more-ruthless-3794639",
    "timestamp": "2026-01-07T21:38:06Z"
  },
  {
    "title": "US says it needs to control Venezuelan oil sales indefinitely to drive change",
    "description": "The U.S. needs to control Venezuela's oil sales and revenue indefinitely to stabilize that country's economy and rebuild its oil sector, Energy Secretary Chris Wright said on Wednesday. The comments reflect the importance of crude oil to President ‌Donald Tru…",
    "link": "https://japantoday.com/category/world/us-says-it-needs-to-control-venezuelan-oil-sales-indefinitely-to-drive-change2",
    "timestamp": "2026-01-07T21:38:04Z"
  },
  {
    "title": "Rubio to meet Denmark leaders next week; signals no retreat on Trump's Greenland goal",
    "description": "U.S. Secretary of State Marco Rubio said on Wednesday he would meet leaders of Denmark next week but signaled no retreat from President Donald Trump's aim to take over Greenland, and alarmed allies including France and Germany were working on a plan on how to…",
    "link": "https://japantoday.com/category/world/rubio-to-meet-denmark-leaders-next-week-signals-no-retreat-on-trump%27s-greenland-goal",
    "timestamp": "2026-01-07T21:37:56Z"
  },
  {
    "title": "U.S. seizes Russian-flagged tanker tied to Venezuela as Trump widens oil push",
    "description": "The U.S. seized two Venezuela-linked oil tankers in the Atlantic Ocean on Wednesday, one sailing under Russia's flag, as part of President Donald Trump's aggressive push to dictate oil flows in the Americas and force Venezuela's socialist government to become…",
    "link": "https://japantoday.com/category/world/us-seizes-russian-flagged-tanker-tied-to-venezuela-as-trump-widens-oil-push",
    "timestamp": "2026-01-07T21:37:47Z"
  },
  {
    "title": "Marco Rubio Tells Congress That US Is Seeking to Purchase Greenland",
    "description": "Greenland Prime Minister Jens-Frederik Nielsen called on Trump to end his “fantasies of annexation.”…",
    "link": "https://truthout.org/articles/marco-rubio-tells-congress-that-us-is-seeking-to-purchase-greenland/",
    "timestamp": "2026-01-07T21:36:14Z"
  },
  {
    "title": "Trump Seeks to Ban Institutional Investors From Buying Single-Family Homes",
    "description": "President Donald Trump said Wednesday that he plans to ban institutional investors from buying single-family homes, in a move he hopes will address housing affordability in the U.S. “I am immediately taking steps to ban large institutional investors from buyi…",
    "link": "http://commercialobserver.com/2026/01/donald-trump-ban-institutional-investors-buying-single-family-homes/",
    "timestamp": "2026-01-07T21:35:26Z"
  },
  {
    "title": "Homicides continue to fall in Detroit as city mirrors national trend on violent crime",
    "description": "Murders in Detroit continue to tumble as the city recorded its lowest number of criminal homicides since at least the early- to mid-1960s",
    "link": "https://abcnews.go.com/US/wireStory/homicides-continue-fall-detroit-city-mirrors-national-trend-128993052",
    "timestamp": "2026-01-07T21:35:10Z"
  },
  {
    "title": "What's Going On With Invitation Homes Shares Wednesday?",
    "description": "Invitation Homes Inc. (NYSE:INVH) shares are trading lower Wednesday, among other homebuilders and housing-linked companies, after President Donald Trump said he is taking steps to ban large institutional investors from buying more single-family homes.\n • Inv…",
    "link": "https://biztoc.com/x/989f6156cfa75906",
    "timestamp": "2026-01-07T21:30:10Z"
  },
  {
    "title": "Trump Mobile's golden phone remains nowhere to be found",
    "description": "While the T1 has remained in a holding pattern, Trump Mobile has been selling its wireless service for $47.45 per month — a price tied to Donald Trump's titles as the 47th and 45th president.",
    "link": "https://richmond.com/news/nation-world/business/article_031149e3-def4-5bde-be06-2199cd6be6d0.html",
    "timestamp": "2026-01-07T21:30:00Z"
  },
  {
    "title": "These two things are behind the U.S. interest in Greenland",
    "description": "There are two central reasons that the United States has increasingly threatened to assume control of Greenland, a Danish territory. \nThe first, and most important, is that the U.S. government is currently run by President Donald Trump. Trump’s hostility towa…",
    "link": "https://biztoc.com/x/cf8d3e53d9a380f6",
    "timestamp": "2026-01-07T21:29:53Z"
  },
  {
    "title": "Trump raises military budget to $1.5 trillion",
    "description": "United States President Donald Trump announced on Wednesday that the military budget for 2027 will be raised to $1.5 trillion, instead of the planned $1 trillion.More to come......",
    "link": "https://biztoc.com/x/bc5769a13585c416",
    "timestamp": "2026-01-07T21:29:42Z"
  },
  {
    "title": "Trump threatens ending business with Raytheon",
    "description": "United States President Donald Trump on Wednesday warned the RTX's Raytheon Company that it will no longer be \"doing business with the Department of War\" if it does not \"step up and start investing in...",
    "link": "https://biztoc.com/x/627af159ea5107e8",
    "timestamp": "2026-01-07T21:29:42Z"
  },
  {
    "title": "Trump's State of the Union set for Feb. 24",
    "description": "Speaker Mike Johnson has invited President Donald Trump to deliver his State of the Union address to Congress on Feb. 24. \nThe speech comes as Trump is working to address key cost of living issues, leading military intervention in Venezuela and threatening to…",
    "link": "https://biztoc.com/x/7c82be0458b50ded",
    "timestamp": "2026-01-07T21:29:35Z"
  },
  {
    "title": "Trump Smashes Wall Street's Home Buying Machine—Real Estate Stocks Crater",
    "description": "On Wednesday, President Donald Trump said he would take steps to ban large institutional investors from buying single-family homes. Real estate-related stocks reacted sharply downward. \nBX stock dropped. See the chart and price action here. \nTrump expressed h…",
    "link": "https://biztoc.com/x/7a95f9cb74fe9874",
    "timestamp": "2026-01-07T21:29:31Z"
  },
  {
    "title": "RFK Jr. Tells America to Follow His Wacky Diet",
    "description": "The president’s love of fast food didn’t quite align with his administration’s new guidelines.",
    "link": "https://www.thedailybeast.com/rfk-jr-tells-america-to-follow-his-wacky-diet/",
    "timestamp": "2026-01-07T21:28:19Z"
  },
  {
    "title": "John Fetterman Says He’s Open To US Buying Greenland, But Not Sending Troops There",
    "description": "Democratic Pennsylvania Sen. John Fetterman said on Wednesday that he is open to a U.S. purchase of Greenland given its strategic value and natural resources.",
    "link": "https://dailycaller.com/2026/01/07/john-fetterman-says-hes-open-to-us-buying-greenland-but-not-sending-troops-there/",
    "timestamp": "2026-01-07T21:27:56Z"
  },
  {
    "title": "Trump claims woman \"ran over\" ICE agent in Minneapolis before he fatally shot her, video contradicts claim",
    "description": "President Donald Trump claimed that the woman shot and killed by an ICE officer in south Minneapolis Wednesday \"viciously ran over the ICE Officer\" prior to her death, though the video evidence he shared showed no sign of an officer being run over in the inci…",
    "link": "https://www.cbsnews.com/minnesota/news/trump-claims-woman-ran-over-ice-agent-minneapolis/",
    "timestamp": "2026-01-07T21:27:47Z"
  },
  {
    "title": "ICE agent fatally shoots woman amid immigration crackdown",
    "description": "The mayor of Minneapolis says the Trump administration's claim the incident was self-defence is not true and told Immigration and Customs Enforcement to get out of the city.",
    "link": "https://www.abc.net.au/news/2026-01-08/us-immigration-agent-fatally-shoots-woman/106208464",
    "timestamp": "2026-01-07T21:27:34Z"
  },
  {
    "title": "'Get out of Minneapolis': Mayor's fury after ICE agent shoots and kills woman",
    "description": "The mayor of Minneapolis says the Trump administration's claim that the incident was self-defence is not true and told Immigration and Customs Enforcement to get out of the city.",
    "link": "https://www.abc.net.au/news/2026-01-08/us-immigration-agent-fatally-shoots-womanin-minneapolis/106208464",
    "timestamp": "2026-01-07T21:27:34Z"
  },
  {
    "title": "Cowboys Owner Jerry Jones Channels Trump in Response to Question About DC Search",
    "description": "Cowboys owner Jerry Jones offered up the strange statement that he will be \"running Venezuela\" when asked hiring a new defensive play caller.\nThe post Cowboys Owner Jerry Jones Channels Trump in Response to Question About DC Search appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/01/07/cowboys-owner-jerry-jones-channels-trump-response-question-about-dc-search/",
    "timestamp": "2026-01-07T21:26:30Z"
  },
  {
    "title": "How major US stock indexes fared Wednesday, 1/7/2026",
    "description": "Wall Street’s strong start to the year slowed",
    "link": "https://abcnews.go.com/Business/wireStory/major-us-stock-indexes-fared-wednesday-172026-128996242",
    "timestamp": "2026-01-07T21:25:40Z"
  },
  {
    "title": "The Latest: ICE officer shoots and kills a woman during Minneapolis immigration crackdown",
    "description": "An Immigration and Customs Enforcement officer shot and killed a Minneapolis motorist during the Trump administration’s latest immigration crackdown in a major U.S. city — a shooting that federal officials claimed was an act of self-defense but that th...",
    "link": "https://abcnews.go.com/US/wireStory/latest-ice-officer-shoots-kills-woman-minneapolis-immigration-128994317",
    "timestamp": "2026-01-07T21:25:28Z"
  },
  {
    "title": "Buy Greenland? Take It? Why? An Old Pact Already Gives Trump a Free Hand",
    "description": "It was signed in 1951 by the United States and Denmark, which colonized Greenland more than 300 years ago and still controls some of its affairs. “The U.S. has such a free hand in Greenland that it can pretty much do what it wants,” said Mikkel Runge Olesen, …",
    "link": "https://freerepublic.com/focus/f-news/4360904/posts",
    "timestamp": "2026-01-07T21:25:24Z"
  },
  {
    "title": "Why the DOJ Has Stopped Describing Maduro as the Head of a Literal Drug Cartel",
    "description": "That embarrassing mistake highlights the slipperiness of Trump's attempts to justify legally dubious policies by invoking the specter of \"foreign terrorist organizations.\"",
    "link": "https://reason.com/2026/01/07/why-the-doj-has-stopped-describing-maduro-as-the-head-of-a-literal-drug-cartel/",
    "timestamp": "2026-01-07T21:24:39Z"
  },
  {
    "title": "Woman shot dead by ICE in Minneapolis as city's mayor disputes self-defence claim",
    "description": "Jacob Frey described the claim as “bullshit” and called on the immigration officers to leave the city.",
    "link": "https://www.thejournal.ie/woman-shot-dead-ice-agents-minneapolis-6920703-Jan2026/",
    "timestamp": "2026-01-07T21:24:37Z"
  },
  {
    "title": "Donald Trump Tells NFL Teams to 'Hire' John Harbaugh 'Fast' After Ravens Fire Him",
    "description": "The president said Harbaugh and his brother are \"total winners\" after the Ravens fired the head coach",
    "link": "https://people.com/donald-trump-tells-nfl-teams-hire-john-harbaugh-after-ravens-fire-him-11881023",
    "timestamp": "2026-01-07T21:22:37Z"
  },
  {
    "title": "'You've done enough': Tim Walz preps National Guard as Trump's ICE gets stern ultimatum",
    "description": "Gov. Tim Walz (D-MN) had a blunt message for Immigration and Customs Enforcement after an officer was caught on video fatally shooting a woman as she appeared to drive away in her car: get out of our state.Furthermore, he said in his announcement, he stands r…",
    "link": "https://www.rawstory.com/tim-walz-2674858135/",
    "timestamp": "2026-01-07T21:21:02Z"
  },
  {
    "title": "‘Against my morals’: Fashion insiders spill on dressing Karoline Leavitt and MAGA women",
    "description": "A D.C. fashion retailer, Tuckernuck, has become the go-to brand for prominent MAGA figures, with employees reportedly conflicted by the political leanings of their clientele. Despite the brand's founders being registered Democrats and donors, their clothing i…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/against-my-morals-fashion-insiders-spill-on-dressing-karoline-leavitt-and-maga-women/articleshow/126402165.cms",
    "timestamp": "2026-01-07T21:20:34Z"
  },
  {
    "title": "Who's Ready To Pull Out Of World Cup And Humiliate Trump? Spain? Colombia? Denmark?",
    "description": "Let the booing, mockery, and boycotts commence!",
    "link": "https://www.wonkette.com/p/whos-ready-to-pull-out-of-world-cup",
    "timestamp": "2026-01-07T21:20:33Z"
  },
  {
    "title": "Four Takeaways as Congress Investigates Walz, Minnesota Fraud",
    "description": "Congress probed the matter of what Minnesota Gov. Tim Walz knew about the $9 billion fraud scandal in his state at a hearing on Wednesday. ... Read More\nThe post Four Takeaways as Congress Investigates Walz, Minnesota Fraud appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2026/01/07/4-takeaways-as-congress-investigates-walz-minnesota-fraud/",
    "timestamp": "2026-01-07T21:20:00Z"
  },
  {
    "title": "Trump threatens to ban Wall Street from buying the house next door, saying ‘American Dream is increasingly out of reach for far too many people’",
    "description": "President Donald Trump said his administration will move to bar large Wall Street investors from buying up single-family homes, framing the effort as a bid to restore access to homeownership for ordinary families priced out of the market. In a Truth Social po…",
    "link": "https://biztoc.com/x/bce929940cab5835",
    "timestamp": "2026-01-07T21:18:46Z"
  },
  {
    "title": "“We want to take action”: France gears up for Greenland showdown with Trump",
    "description": "France meets with allies to determine next steps as Trump threatens Greenland.",
    "link": "https://www.salon.com/2026/01/07/we-want-to-take-action-france-gears-up-to-for-greenland-showdown-with-trump/",
    "timestamp": "2026-01-07T21:18:39Z"
  },
  {
    "title": "Cowboys defensive coordinator candidates: Who Jerry Jones and Brian Schottenheimer could target",
    "description": "Schottenheimer may have more of a say in the hiring of his second defensive coordinator than he did with Matt Eberflus",
    "link": "https://www.cbssports.com/nfl/news/cowboys-defensive-coordinator-candidates-matt-eberflus-fired/",
    "timestamp": "2026-01-07T21:17:52Z"
  },
  {
    "title": "Why the US has designs on Venezuela's oil",
    "description": "Venezuela’s oil industry has been in the spotlight since President Donald Trump captured the country’s President Nicolas Maduro",
    "link": "https://abcnews.go.com/US/wireStory/us-designs-venezuelas-oil-128991482",
    "timestamp": "2026-01-07T21:17:47Z"
  },
  {
    "title": "Carney meeting with premiers this month as CUSMA talks intensify",
    "description": "Prime Minister Mark Carney will meet with the premiers in Ottawa later this month, the start of a busy year where the mandatory review of the Canada-U.S.-Mexico-Agreement kicks into high gear.",
    "link": "https://www.cbc.ca/news/politics/first-ministers-meeting-carney-9.7036925",
    "timestamp": "2026-01-07T21:15:56Z"
  },
  {
    "title": "ICYMI: The New Interim Leader Of Venezuela",
    "description": "Last night, President Donald Trump <a href=\"https://www.npr.org/2026/01/06/nx-s1-5667055/trump-says-the-u-s-plans-to-take-back-venezuelas-oil-but-what-does-that-mean\"target=\"_blank\"   >announced that Venezuela would start sending the U.S. oil.</a> He’s voiced…",
    "link": "https://www.npr.org/2026/01/07/nx-s1-5670383/icymi-the-new-interim-leader-of-venezuela",
    "timestamp": "2026-01-07T21:14:17Z"
  },
  {
    "title": "Greenland allies vow action if Trump moves to seize world’s largest island",
    "description": "A German government source told the Reuters news agency that Berlin was 'closely working together' with other allies.",
    "link": "https://www.aljazeera.com/news/2026/1/7/european-allies-reiterate-support-for-greenland-amid-us-threats",
    "timestamp": "2026-01-07T21:13:36Z"
  },
  {
    "title": "Yes, You Should Watch the Video of the ICE Shooting in Minneapolis",
    "description": "You can just watch the video.",
    "link": "https://slate.com/news-and-politics/2026/01/watch-the-video-ice-shooting-minneapolis-frey-dhs.html",
    "timestamp": "2026-01-07T21:13:20Z"
  },
  {
    "title": "‘DENATURALIZE AND DEPORT’: Congress moves to obtain immigration records for Ilhan Omar and her ‘brother/husband’",
    "description": "'Marrying a sibling is illegal in every state. We intend to get to the bottom of it'",
    "link": "https://www.wnd.com/2026/01/denaturalize-deport-congress-moves-obtain-immigration-records-ilhan/",
    "timestamp": "2026-01-07T21:12:26Z"
  },
  {
    "title": "'I'm an American living in Australia': Inside a revealing trend",
    "description": "Americans are posting sunny social media dispatches about their new lives in Australia, but there is something more revealing underneath.",
    "link": "https://www.abc.net.au/news/2026-01-08/what-im-an-american-in-australia-trend-reveals-about-usa-and-us/106135242",
    "timestamp": "2026-01-07T21:12:18Z"
  },
  {
    "title": "Zelensky asks US to kidnap Chechen leader Kadyrov",
    "description": "Ukraine’s Vladimir Zelensky has urged the US to kidnap Chechen leader Ramzan Kadyrov Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630713-zelensky-us-kidnap-kadyrov/",
    "timestamp": "2026-01-07T21:11:06Z"
  },
  {
    "title": "Trump Responds to Minnesota ICE Shooting—and Makes It Way Worse",
    "description": "President Donald Trump was desperate Wednesday to justify a federal immigration officer shooting a U.S. citizen multiple times—but video footage of the incident showed just how indefensible it really was. In a post on Truth Social, Trump shared a “horrible” n…",
    "link": "https://newrepublic.com/post/205045/donald-trump-responds-minnesota-ice-shooting",
    "timestamp": "2026-01-07T21:11:02Z"
  },
  {
    "title": "X’s deepfake machine is infuriating policymakers around the globe",
    "description": "X's Grok chatbot hasn't stopped accepting users' requests to strip down women and, in some cases, apparent minors to AI-generated bikinis. According to some reports, the flood of AI-generated images includes more extreme content that potentially violates laws…",
    "link": "https://www.theverge.com/policy/857924/x-grok-ai-chatbot-bikini-images-regulators-congress",
    "timestamp": "2026-01-07T21:09:54Z"
  },
  {
    "title": "Reports: China Expected to Replace Venezuelan Oil with Iranian Crude",
    "description": "Oil industry analysts expect China to replace its oil imports from Venezuela with increased purchases of Iranian crude, following the arrest of China’s ally Nicolas Maduro by U.S. forces over the weekend.\nThe post Reports: China Expected to Replace Venezuelan…",
    "link": "https://www.breitbart.com/latin-america/2026/01/07/reports-china-expected-to-replace-venezuelan-oil-with-iranian-crude/",
    "timestamp": "2026-01-07T21:09:09Z"
  },
  {
    "title": "US immigration officer fatally shoots woman in Minneapolis",
    "description": "An immigration agent in Minneapolis shot dead a woman Wednesday, triggering outrage from local leaders even as President Donald Trump claimed the officer acted in self-defense. Jacob Frey, the mayor, called the government’s stance “bullshit” and called on ICE…",
    "link": "https://www.digitaljournal.com/world/us-immigration-officer-fatally-shoots-woman-in-minneapolis/article",
    "timestamp": "2026-01-07T21:07:20Z"
  },
  {
    "title": "Coming to Greenland makes you realise how preposterous Trump's claims to territory are",
    "description": "Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first.",
    "link": "https://news.sky.com/story/coming-to-greenland-makes-you-realise-how-preposterous-trumps-claims-to-territory-are-13491743",
    "timestamp": "2026-01-07T21:06:00Z"
  },
  {
    "title": "I Once Supported Regime Change in Iraq. That's Why Venezuela Worries Me.",
    "description": "When we use our military and roll the dice with the fate of nations, the consequences play out in a much longer time frame than social media trends.",
    "link": "https://reason.com/2026/01/07/i-once-supported-regime-change-in-iraq-thats-why-venezuela-worries-me/",
    "timestamp": "2026-01-07T21:04:56Z"
  },
  {
    "title": "Panama’s Noriega Sets Precedent for U.S. Capture of Maduro in Venezuela",
    "description": "The recent U.S. military operation that led to the capture of Venezuelan President Nicolás Maduro echoes a chapter from Latin American history: the 1989 invasion of Panama and the arrest of General Manuel Noriega. Both events unfolded on January 3, separated …",
    "link": "https://freerepublic.com/focus/f-news/4360898/posts",
    "timestamp": "2026-01-07T21:04:33Z"
  },
  {
    "title": "Democrats Despise Trump’s Signature Law — Except For The Millions Going To Their States",
    "description": "Democrats are praising investments in rural health care created by President Donald Trump’s landmark tax and spending cut law after railing against the legislation for months. The Trump administration in late December announced first-year state awards for its…",
    "link": "https://dailycaller.com/2026/01/07/democrats-one-big-beautiful-bill-rural-health-transformation-program/",
    "timestamp": "2026-01-07T21:02:00Z"
  },
  {
    "title": "Trump immigration policies and aging population slow US growth projection, budget office says",
    "description": "The U.S. population is projected to grow more slowly over the next 30 years than previously predicted",
    "link": "https://abcnews.go.com/US/wireStory/trump-immigration-policies-aging-population-slow-us-growth-128993935",
    "timestamp": "2026-01-07T21:01:42Z"
  },
  {
    "title": "Trump defends ICE agent in deadly shooting and blasts screaming 'professional agitator'",
    "description": "President Donald Trump released a comment Wednesday after an ICE agent shot and killed a 37-year-old woman driving in a car in Minneapolis, blaming \"the radical left\" and claiming the agent was in danger.Trump posted on his Truth Social platform, as the inves…",
    "link": "https://www.rawstory.com/trump-minneapolis-shooting/",
    "timestamp": "2026-01-07T21:01:39Z"
  },
  {
    "title": "Guest editorial: Medicaid fraud is a problem, but so is a lack of understanding about the program",
    "description": "Marketing efforts have succeeded in disguising Medicaid, assisting states across the country in rebranding at least part of their public health-insurance programs.",
    "link": "https://www.marinij.com/2026/01/07/guest-editorial-medicaid-fraud-is-a-problem-but-so-is-a-lack-of-understanding-about-the-program/",
    "timestamp": "2026-01-07T21:01:30Z"
  },
  {
    "title": "Trump Says Minnesota Governor Tim Walz Has Been Caught “Red-Handed”",
    "description": "Current United States ruler, Donald Trump, has said that Minnesota governor Tim Walz has been caught \"red-handed.\" Trump's comments come after Walz announced that he won’t run for reelection amid an alleged multi-billion fraud scheme involving the state’s day…",
    "link": "https://www.shtfplan.com/headline-news/trump-says-minnesota-governor-tim-walz-has-been-caught-red-handed",
    "timestamp": "2026-01-07T21:00:56Z"
  },
  {
    "title": "Will Albo U-turn on Bondi RC?",
    "description": "Anthony Albanese is reportedly preparing to backflip on a royal commission into the Bondi attacks. Meanwhile Donald Trump continues to do... well, pretty much whatever he wants.\nThe post Will Albo U-turn on Bondi RC? appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2026/01/08/albanese-bondi-royal-commission-trump-venezuela-russia/",
    "timestamp": "2026-01-07T21:00:34Z"
  },
  {
    "title": "Here's What Happened Today: Wednesday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/heres-what-happened-today-wednesday-84-6920673-Jan2026/",
    "timestamp": "2026-01-07T21:00:29Z"
  },
  {
    "title": "Real Clue Behind The Maduro Capture Might Lie In Trump’s Flashy Past",
    "description": "The real clue as to why Trump launched the raid to capture Maduro lies deep in the president's past, during his life before politics and the White House.",
    "link": "https://dailycaller.com/2026/01/07/donald-trump-tower-1980s-favorite-decade-gold-drug-wars-cartels-nicolas-maduro/",
    "timestamp": "2026-01-07T21:00:17Z"
  },
  {
    "title": "Senate Republican predicts the fall of the Cuban regime",
    "description": "Sen. Rick Scott, R-Fla., is predicting that the Cuban regime will fall in the wake of U.S. intervention in Venezuela and the capture of Nicolás Maduro",
    "link": "https://www.foxnews.com/politics/senate-republican-predicts-fall-cuban-regime",
    "timestamp": "2026-01-07T20:57:42Z"
  },
  {
    "title": "WTI Drops as US Markets Venezuela Oil",
    "description": "Oil prices fell as the US moved to market Venezuelan crude amid an oversupplied market.",
    "link": "https://www.rigzone.com/news/wire/wti_drops_as_us_markets_venezuela_oil-07-jan-2026-182710-article/",
    "timestamp": "2026-01-07T20:57:13Z"
  },
  {
    "title": "DOJ drops assault charges against Georgia election case defendant Harrison Floyd",
    "description": "DOJ drops assault charges against Georgia election case defendant Harrison Floydgo.com",
    "link": "https://abcnews.go.com/US/doj-drops-assault-charges-georgia-election-case-defendant/story?id=128991657",
    "timestamp": "2026-01-07T20:56:49Z"
  },
  {
    "title": "Lockheed Martin Stock Slides After Trump Says No Buybacks At Expense Of Investment",
    "description": "Lockheed Martin Corp (NYSE:LMT) shares are taking a plunge on Wednesday amid President Donald Trump’s social media post criticizing defense contractors over executive compensation, dividends and production speeds. \nLockheed Martin stock is showing notable wea…",
    "link": "https://biztoc.com/x/9e4cf0730cce9e4c",
    "timestamp": "2026-01-07T20:56:36Z"
  },
  {
    "title": "Trump backs ICE, insists shooting was self-defense",
    "description": "United States President Donald Trump shared on Wednesday that he saw the video of the fatal shooting that took place in Minneapolis and involved an Immigration and Customs Enforcement (ICE) officer.\"T...",
    "link": "https://biztoc.com/x/f615707667ea35ca",
    "timestamp": "2026-01-07T20:56:29Z"
  },
  {
    "title": "Kennedy says military action on Greenland would be 'weapons-grade stupid' as GOP resists force",
    "description": "Secretary of State Marco Rubio plans Denmark meetings next week as lawmakers reject idea of military force to capture Greenland, a prized possession sought by President Donald Trump.",
    "link": "https://www.foxnews.com/politics/kennedy-says-military-action-greenland-would-weapons-grade-stupid-gop-resists-force",
    "timestamp": "2026-01-07T20:56:25Z"
  },
  {
    "title": "Father of Slain Conservative Presidential Frontrunner in Colombia Blames Venezuela for Son's Killing",
    "description": "Miguel Uribe Londoño, a conservative Colombian presidential candidate and father of assassinated 2026 frontrunner Miguel Uribe Turbay, accused Nicolás Maduro of playing a role in his son's death following Maduro's arrest this weekend.\nThe post Father of Slain…",
    "link": "https://www.breitbart.com/latin-america/2026/01/07/father-of-slain-conservative-presidential-frontrunner-in-colombia-blames-venezuela-for-sons-killing/",
    "timestamp": "2026-01-07T20:56:17Z"
  },
  {
    "title": "Will Republicans Allow Taxpayer-Funded Abortion?",
    "description": "Most House Republicans appear to uphold the party’s longstanding principle against allocating taxpayer funds for abortion, despite President Trump’s call for them to be “flexible”... Read More\nThe post Will Republicans Allow Taxpayer-Funded Abortion? appeared…",
    "link": "https://www.dailysignal.com/2026/01/07/will-republicans-allow-taxpayer-funded-abortion/",
    "timestamp": "2026-01-07T20:56:08Z"
  },
  {
    "title": "Trump to Ban 'Large Institutional Investors' from Buying Up U.S. Homes",
    "description": "President Donald Trump is moving to ban \"large institutional investors\" from buying up United States homes meant for Americans.\nThe post Trump to Ban ‘Large Institutional Investors’ from Buying Up U.S. Homes appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/07/trump-to-ban-large-investors-buying-up-us-homes/",
    "timestamp": "2026-01-07T20:56:04Z"
  },
  {
    "title": "5 things on Congress' agenda right now",
    "description": "We lay out a rough to-do list for members of Congress as they return from holiday break.",
    "link": "https://www.pbs.org/newshour/politics/5-things-on-congress-agenda-right-now",
    "timestamp": "2026-01-07T20:55:02Z"
  },
  {
    "title": "Somalia’s U.N. ambassador associated with fraud-connected Ohio health company, HHS confirms",
    "description": "Feds announced, 'More to come'",
    "link": "https://www.wnd.com/2026/01/somalias-u-n-ambassador-associated-fraud-connected-ohio/",
    "timestamp": "2026-01-07T20:54:04Z"
  },
  {
    "title": "Trump urged mid-decade redistricting. One-third of states have now looked at reshaping House seats",
    "description": "Officials in about one-third of the states have considered revising their U.S. House districts since President Donald Trump called for mid-decade redistricting",
    "link": "https://abcnews.go.com/US/wireStory/trump-urged-mid-decade-redistricting-states-now-looked-128995082",
    "timestamp": "2026-01-07T20:53:49Z"
  },
  {
    "title": "Signs Point to a Bright Future for U.S. Green Steel in 2026",
    "description": "Some fear the resurgence of the U.S. steel industry could mean an uptick in emissions, but recent investor activity indicates the green steel sector could change that. TriplePundit",
    "link": "https://triplepundit.com/2026/signs-point-to-a-bright-future-for-u-s-green-steel-in-2026/",
    "timestamp": "2026-01-07T20:51:56Z"
  },
  {
    "title": "'Barbarous behavior': Legal experts warn deadly ICE shooting will lead to charges",
    "description": "Legal experts have begun to weigh in on the harrowing video from Minneapolis of an ICE agent fatally shooting a woman through the driver's side window of her car as she began to pull away from them — and at least some believe that state criminal charges could…",
    "link": "https://www.rawstory.com/ice-shooting/",
    "timestamp": "2026-01-07T20:51:14Z"
  },
  {
    "title": "This Isn’t the First Killing by ICE — and It Won’t Be the Last",
    "description": "ICE shot a woman point-blank in Minneapolis. The agency’s raids and impunity were always going to lead to death.\nThe post This Isn’t the First Killing by ICE — and It Won’t Be the Last appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/07/ice-mineapolis-shooting-death/",
    "timestamp": "2026-01-07T20:49:32Z"
  },
  {
    "title": "Distraught woman says ICE killed her wife in video after deadly Minneapolis shooting",
    "description": "“They killed my wife,” the distraught woman says, adding, “They shot her in the head.”",
    "link": "https://www.advocate.com/news/minnesota-ice-killed-wife",
    "timestamp": "2026-01-07T20:48:22Z"
  },
  {
    "title": "'I'm Just Talking About Globally': Forget Greenland, Says Rubio, US Reserves Right for Military Invasion Anywhere It Wants",
    "description": "On the heels of President Donald Trump’s threats to use military force to conquer Greenland, Secretary of State Marco Rubio suggested during a Wednesday press conference that US presidents reserve the right to do so not only in the Danish territory, but anywh…",
    "link": "https://www.commondreams.org/news/rubio-greenland-global-military-force",
    "timestamp": "2026-01-07T20:47:03Z"
  },
  {
    "title": "Morgan Stanley just filed for two crypto ETFs, but one massive omission sends a brutal signal",
    "description": "Morgan Stanley, the $1.8 trillion banking giant, has applied to launch two exchange-traded funds (ETFs) tracking the prices of Bitcoin and Solana with the US Securities and Exchange Commission (SEC). The filings mark a watershed moment for the Wall Street gia…",
    "link": "https://cryptoslate.com/morgan-stanley-files-for-bitcoin-and-solana-etfs-neglects-ethereum-and-xrp/",
    "timestamp": "2026-01-07T20:45:37Z"
  },
  {
    "title": "‘How Dare You!’ Megyn Kelly Rages Over Tim Walz’s ‘Shameful’ Statement on ICE Shooting",
    "description": "Megyn Kelly raged at Minnesota Governor Tim Walz (D) on Wednesday after Walz issued a statement on the shooting of a woman an ICE agent in Minneapolis.\nThe post ‘How Dare You!’ Megyn Kelly Rages Over Tim Walz’s ‘Shameful’ Statement on ICE Shooting first appea…",
    "link": "https://www.mediaite.com/media/news/how-dare-you-megyn-kelly-rages-over-tim-walzs-shameful-statement-on-ice-shooting/",
    "timestamp": "2026-01-07T20:45:21Z"
  },
  {
    "title": "Trump says he wants to ban large investors from buying houses",
    "description": "U.S. President Donald Trump said on Wednesday that he wants to block large institutional investors from buying houses, saying that a ban would make it easier for younger families to buy their first homes.\nTrump – who has been under pressure to address voters’…",
    "link": "https://biztoc.com/x/c52ce685b5865443",
    "timestamp": "2026-01-07T20:45:19Z"
  },
  {
    "title": "Trump’s Greenland takeover would require ‘billions upon billions’ spent over decades to acquire a mineral industry that doesn’t yet exist, experts say",
    "description": "When President Donald Trump entered his second term, he renewed his 2019 vow to take over Greenland. But what started as a seemingly quixotic proposal to purchase the Arctic island has now morphed into an unprecedented threat against a NATO ally—one that expe…",
    "link": "https://biztoc.com/x/099248c26b5c3462",
    "timestamp": "2026-01-07T20:45:08Z"
  },
  {
    "title": "Donald Trump Warns House GOP “I’ll Get Impeached” If They Lose Midterms, Dems On Social Media: “Say Less”",
    "description": "\"But you got to win the midterms, because if we don't win the midterms, it's just going to be — I mean, they'll find a reason to impeach me,\" Trump said. \"I'll get impeached!",
    "link": "https://hiphopwired.com/2990464/donald-trump-warns-impeachment-house-gop-2026-midterms-reactions/",
    "timestamp": "2026-01-07T20:45:03Z"
  },
  {
    "title": "Donald Trump Defends ICE Agent Who Shot Woman in Minneapolis",
    "description": "President Donald Trump defended the Immigration and Customs Enforcement (ICE) agent who fatally shot a woman on Wednesday in Minneapolis, Minnesota.\nA 37-year-old woman was fatally shot on Wednesday during an ICE raid, sparking heavy criticism and protests in…",
    "link": "https://biztoc.com/x/6f8ae94f577c7da8",
    "timestamp": "2026-01-07T20:44:06Z"
  }
]