[
  {
    "title": "The Trump train — and its conductor — are losing steam",
    "description": "Americans are growing weary of the president's cruel policies and stagnant economy",
    "link": "https://www.salon.com/2025/11/28/the-trump-train-and-its-conductor-are-losing-steam/",
    "timestamp": "2025-11-28T11:30:38Z"
  },
  {
    "title": "Victor Davis Hanson: The Left’s ‘Assassination Chic’ and the Inevitability of Another Attack",
    "description": "On this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Sami Winc explore the Left’s troubling and growing acceptance of... Read More\nThe post Victor Davis Hanson: The Left’s ‘Assassination Chic’ and the Inevitability of Another At…",
    "link": "https://www.dailysignal.com/2025/11/28/victor-davis-hanson-the-lefts-assassination-chic-and-the-inevitability-of-another-attack/",
    "timestamp": "2025-11-28T11:30:00Z"
  },
  {
    "title": "The Trump phone was set to be released in August. Months later, it's still nowhere to be found.",
    "description": "The Trump phone was announced in June and was originally set to be released in August. Months later, it has yet to hit the market.",
    "link": "https://www.businessinsider.com/where-is-trump-phone-release-2025-11",
    "timestamp": "2025-11-28T11:29:26Z"
  },
  {
    "title": "Trump Pursues Taiwan Trade Agreement to Expand US Chipmaker Operations",
    "description": "The deal would encourage major Taiwanese chipmakers, including TSMC, to expand their US operations and help train American workers in high-tech manufacturing.",
    "link": "https://www.ibtimes.com/trump-pursues-taiwan-trade-agreement-expand-us-chipmaker-operations-3791579",
    "timestamp": "2025-11-28T11:24:46Z"
  },
  {
    "title": "Christy review: Don’t be distracted by Sydney Sweeney – Christy Martin’s story is a powerful watch",
    "description": "In the media circus that currently surrounds Sydney “great jeans” Sweeney, no one has suffered more than first lady of boxing, Christy Martin. When it was announced in May 2024 that the Euphoria and The White Lotus actress would be playing the former fighter …",
    "link": "https://www.thepinknews.com/2025/11/28/christy-review-sydney-sweeney-christy-martin/",
    "timestamp": "2025-11-28T11:21:48Z"
  },
  {
    "title": "Brussels tells Ukraine: Convict corrupt officials if you want to join the EU",
    "description": "EU justice commissioner says Kyiv must clean up politics, as an alleged $100 million corruption inquiry envelops Volodymyr Zelenskyy’s inner circle.",
    "link": "https://www.politico.eu/article/brussels-tells-ukraine-convict-corrupt-leaders-for-eu-entry/",
    "timestamp": "2025-11-28T11:20:14Z"
  },
  {
    "title": "Showdown with Mexican billionaire Salinas tests Sheinbaum's power",
    "description": "MEXICO CITY (Reuters) -Ricardo Salinas Pliego, one of Mexico's wealthiest tycoons, commands an empire that stretches from banking to media, and casts himself as an anti-corruption crusader. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/28/showdown-with-mexican-billionaire-salinas-tests-sheinbaum039s-power",
    "timestamp": "2025-11-28T11:18:00Z"
  },
  {
    "title": "Fast path to Nebraska political office? Play for the Huskers",
    "description": "NU sports grabs public attention and spur some student-athletes and coaches to starting roles in state politics",
    "link": "https://nebraskaexaminer.com/2025/11/28/fast-path-to-nebraska-political-office-play-for-the-huskers/",
    "timestamp": "2025-11-28T11:15:19Z"
  },
  {
    "title": "Hundreds of children separated from families while fleeing violence in Sudan",
    "description": "Hundreds of children have arrived in a Sudanese refugee camp without their families as thousands of people have fled violence in western Darfur",
    "link": "https://abcnews.go.com/International/wireStory/hundreds-children-separated-families-fleeing-violence-sudans-west-127940517",
    "timestamp": "2025-11-28T11:12:12Z"
  },
  {
    "title": "Trump’s clown car Cabinet keeps humiliating him",
    "description": "This is an adapted excerpt from the Nov. 25 episode of “The Briefing with Jen Psaki.”\nDonald Trump has been humiliated a lot lately. And while most of the time that’s because of his own behavior, it’s also because of the people he surrounds himself with.\nJust…",
    "link": "https://biztoc.com/x/2ff37f132d65b9aa",
    "timestamp": "2025-11-28T11:12:04Z"
  },
  {
    "title": "Amid ‘instability and fear’ in Trump’s economy, Americans are cutting holiday spending",
    "description": "In addition to rising prices and tariffs, readers cite growing unemployment as a reason not to exchange gifts this year\nAmericans are feeling rattled about the state of the economy. Donald Trump has batted away question after question from reporters on concer…",
    "link": "https://biztoc.com/x/53bb8226146afb8a",
    "timestamp": "2025-11-28T11:11:18Z"
  },
  {
    "title": "Trump vows to 'permanently pause' migration from 'third world countries' after D.C. shooting",
    "description": "President Donald Trump has said he will \"permanently pause\" all immigration from what he called \"third world countries\" and demanded a program of \"reverse migration\" as he intensified his rhetoric after the National Guard shooting in Washington, D.C.Trump off…",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-pause-migration-third-world-countries-national-guard-shooting-dc-rcna246299",
    "timestamp": "2025-11-28T11:10:56Z"
  },
  {
    "title": "Venezuela explained in 10 maps and charts",
    "description": "Al Jazeera visualises Venezuela’s political and economic landscape, oil riches, migration crisis and tensions with US.",
    "link": "https://www.aljazeera.com/news/2025/11/28/venezuela-explained-in-10-maps-and-charts",
    "timestamp": "2025-11-28T11:04:56Z"
  },
  {
    "title": "Hungary's Viktor Orbán meets Russia's Vladimir Putin in Moscow for energy talks",
    "description": "Hungarian Prime Minister Viktor Orbán has met Russian President Vladimir Putin for talks at the Kremlin",
    "link": "https://abcnews.go.com/International/wireStory/hungarys-viktor-orbn-meets-russias-vladimir-putin-moscow-127939606",
    "timestamp": "2025-11-28T11:01:56Z"
  },
  {
    "title": "What Will the US Debt Reckoning Look Like?",
    "description": "For now, and in the foreseeable future, fiscal adjustment is a political non-starter in the US, where the prospect of higher taxes or cuts to Social Security and Medicare is a surefire way to lose votes. But this is probably where the country is headed, thoug…",
    "link": "https://www.project-syndicate.org/commentary/us-unsustainable-debt-path-will-probably-end-in-a-painful-fiscal-adjustment-by-jeffrey-frankel-2025-11",
    "timestamp": "2025-11-28T11:01:49Z"
  },
  {
    "title": "Fox News Digital's News Quiz: November 28, 2025",
    "description": "President Donald Trump conducted the traditional turkey pardoning ceremony at the White House, and Rep. Marjorie Taylor Greene planned her post-retirement life.",
    "link": "https://www.foxnews.com/lifestyle/fox-news-digital-news-quiz-november-28-2025",
    "timestamp": "2025-11-28T11:00:25Z"
  },
  {
    "title": "Exposure to geopolitics and bad private credit in spotlight as Big Six banks prepare to report earnings",
    "description": "Canada’s biggest banks are expected to discuss trade tensions when they reveal their fourth-quarter earnings next week. Read more.",
    "link": "https://financialpost.com/fp-finance/banking/exposure-geopolitics-bad-private-credit-big-6-banks-report-earnings",
    "timestamp": "2025-11-28T11:00:23Z"
  },
  {
    "title": "The Trump-Administration Change That Could Cripple Nursing",
    "description": "A federal cap on borrowing for graduate nursing students and others isn’t just making nurses angry, but it could harm the health-care system.",
    "link": "http://nymag.com/intelligencer/article/trump-administration-nursing-profession-graduate-student-loan-cap.html",
    "timestamp": "2025-11-28T11:00:21Z"
  },
  {
    "title": "As hunger rises, Trump administration’s “efficiency” goals cause massive food waste",
    "description": "Farmers are short of workers and money, food is rotting in warehouses, and millions of Americans are going hungry.",
    "link": "https://www.salon.com/2025/11/28/as-hunger-rises-trump-administrations-efficiency-goals-cause-massive-food-waste-partner/",
    "timestamp": "2025-11-28T11:00:18Z"
  },
  {
    "title": "Trump blocks S. Africa from next year's G20 summit",
    "description": "South African President Cyril Ramaphosa said Washington’s decision to not invite his nation to next year’s G20 summit in the US was “regrettable,” the latest sign of fraying bilateral ties.\nUS President Donald Trump’s decision came after he boycotted this mon…",
    "link": "https://biztoc.com/x/42ec649e084652c6",
    "timestamp": "2025-11-28T11:00:15Z"
  },
  {
    "title": "Trump pledges to pause migration after DC attack",
    "description": "US President Donald Trump pledged to pause migration from developing nations in response to the shooting of National Guard members in Washington, DC.\nOne of the two soldiers attacked has died, and the suspect behind the incident — identified as an Afghan refu…",
    "link": "https://biztoc.com/x/8b2d4c5991ba8ab6",
    "timestamp": "2025-11-28T11:00:01Z"
  },
  {
    "title": "Jeffrey Epstein and the Pedophocracy",
    "description": "Underage sex, blackmail, and Israel If you haven’t read it, go online and check out the late, great Dave McGowan’s expose of international child sex trafficking, “The Pedophocracy.” It’s shocking, and exposes our corrupt elite as being the worst kind of sexua…",
    "link": "https://www.activistpost.com/jeffrey-epstein-and-the-pedophocracy/",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "Bari Weiss’s Big Secret Is That She’s Boring",
    "description": "Over the course of her decade-long career in media, Bari Weiss has really only told one story. Sure, she and The Free Press, the website she founded after publicly resigning from The New York Times in the summer of 2020, have covered a number of subjects: col…",
    "link": "https://newrepublic.com/article/203758/bari-weiss-cbs-news-strategy",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "Ukraine peace plan, or Russian ‘wish list’?",
    "description": "After a week full of leaks, counter proposals, and frenzied negotiations, is the possibility of a peace deal in Ukraine actually on the table?",
    "link": "https://www.cbc.ca/radio/frontburner/ukraine-peace-plan-or-russian-wish-list-9.6995415",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "The Best Jokes of 2025",
    "description": "Ian Crouch shares some of the funniest moments of the year, involving Katy Perry in space, J. D. Vance on skis, the cheating tech executives at a Coldplay concert, and the jewelry thieves at the Louvre.",
    "link": "https://www.newyorker.com/culture/2025-in-review/the-best-jokes-of-2025",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "The Quick and Shameful Death of Biden’s Biggest Policy",
    "description": "In late 2024, an operative for the right-wing gotcha group Project Veritas clandestinely filmed his Tinder date with a 29-year-old EPA employee. The employee, who talked freely about his work distributing grant funds allocated by the Inflation Reduction Act, …",
    "link": "https://newrepublic.com/article/202755/inflation-reduction-act-biden-biggest-policy-death",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "Texas vowed to cooperate with ICE, but its big-city police departments face a difficult choice",
    "description": "SAN ANTONIO — When Immigration and Customs Enforcement came calling on Dallas Police Chief Daniel Comeaux months ago to ask his officers to assist in supporting President Donald Trump’s sweeping immigration enforcement operations, the chief of police in the t…",
    "link": "https://www.nbcnews.com/news/us-news/texas-vowed-cooperate-ice-big-city-police-departments-face-difficult-c-rcna245937",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "Nassau Exec Bruce Blakeman plans a wall of surveillance at NYC border after Mamdani win",
    "description": "The technology that’s expected to be implemented includes license plate readers and facial recognition, Blakeman said.",
    "link": "https://nypost.com/2025/11/28/us-news/nassau-exec-bruce-blakeman-plans-a-wall-of-surveillance-at-nyc-border-after-mamdani-win/",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "There’s No Doubt About It: The Great MAGA Crack-Up Has Begun",
    "description": "Here we are, Black Friday, officially Christmastime now. America is in a sour mood. Grocery prices are up, and so are energy prices. Donald Trump lies incessantly about both. The American people are onto him. They’re pessimistic about the future. The distrust…",
    "link": "https://newrepublic.com/article/203744/there-no-doubt-it-great-maga-crack-up-begun-trump",
    "timestamp": "2025-11-28T11:00:00Z"
  },
  {
    "title": "Trump Says He’ll ‘Permanently Pause’ Migration From ‘Third World Countries’",
    "description": "Trump attacked immigrants living in the U.S., claiming without evidence that most of them were from “failed nations” or from “prisons, mental institutions, gangs, or drug cartels.”",
    "link": "https://www.forbes.com/sites/siladityaray/2025/11/28/trump-says-hell-permanently-pause-migration-from-third-world-countries/",
    "timestamp": "2025-11-28T10:59:20Z"
  },
  {
    "title": "Trump’s ‘drug boat’ attacks mirror controversial Obama-era tactic – NYT",
    "description": "US military action in the Caribbean resembles the Barack Obama-era ‘signature strikes’ on terrorist suspects, the New York Times has argued Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628611-signature-strikes-drug-boats/",
    "timestamp": "2025-11-28T10:55:15Z"
  },
  {
    "title": "I Still Cant Believe These Apple, JBL and Roku Black Friday Deals Are Under $25",
    "description": "If you're shopping on a budget this Black Friday, I found the best tech deals under $25 you shouldn't miss.",
    "link": "https://www.cnet.com/deals/best-black-friday-deals-under-25-2025-11-28/",
    "timestamp": "2025-11-28T10:52:00Z"
  },
  {
    "title": "Donald Trump Suffers Polling Blow Over Ukraine Peace Plan",
    "description": "U.S. President Donald Trump has been hit with a negative poll about his plan to end the war between Russia and Ukraine.\nAccording to polling by YouGov, the majority of Americans disapprove of Trump's handling of the conflict, as the U.S. continues its latest …",
    "link": "https://biztoc.com/x/052d63ad396c6cae",
    "timestamp": "2025-11-28T10:49:42Z"
  },
  {
    "title": "Trump White House ‘World’s Most Corrupt Crypto Startup Operation’: House Democrats",
    "description": "President Trump and his family made $800 million from sales of cryptocurrencies in the first half of the year, according to a new report.",
    "link": "https://decrypt.co/350315/trump-white-house-worlds-most-corrupt-crypto-startup-operation-house-democrats",
    "timestamp": "2025-11-28T10:45:23Z"
  },
  {
    "title": "The Republican Responsible For The Most Damaging Jeffrey Epstein Disclosures",
    "description": "House Oversight Committee James Comer (R-Ky.) has been way ahead of his Republican colleagues.",
    "link": "https://www.huffpost.com/entry/james-comer-epstein-files-birthday-book-estate_n_6927225fe4b034dca9c4b595",
    "timestamp": "2025-11-28T10:45:17Z"
  },
  {
    "title": "Israeli forces kill 13 in southern Syria operation",
    "description": "Israeli forces killed 13 people on Friday in an operation in southern Syria, the deadliest since Bashar al-Assad’s fall from power nearly a year ago, which they said was targeting an Islamist group. Since an Islamist coalition overthrew longtime ruler Assad i…",
    "link": "https://www.digitaljournal.com/world/israeli-forces-kill-13-in-southern-syria-operation/article",
    "timestamp": "2025-11-28T10:42:20Z"
  },
  {
    "title": "Crypto hoarding company shares under pressure as risk appetite wanes",
    "description": "Fresh turbulence in the crypto market is weighing on shares of companies that stockpile bitcoin and other tokens on their balance sheets, stoking concerns over stress in the niche but fast-growing sector.Buoyed by U.S. President Donald Trump's crypto-friendly…",
    "link": "https://www.channelnewsasia.com/business/crypto-hoarding-company-shares-under-pressure-risk-appetite-wanes-5495676",
    "timestamp": "2025-11-28T10:35:48Z"
  },
  {
    "title": "Trump’s beef with Nigeria",
    "description": "Trump’s threats of military action against Nigeria are not about Christian genocide, but are about rare earths, China, and the scramble to control Africa’s mineral future.",
    "link": "https://africasacountry.com/2025/11/trumps-beef-with-nigeria/",
    "timestamp": "2025-11-28T10:35:12Z"
  },
  {
    "title": "Mary Trump Has 'Yikes' Moment Over Detail That Will Hurt Uncle 'The Most'",
    "description": "Donald Trump's niece also couldn’t help but laugh at the president's recent spin.",
    "link": "https://www.huffpost.com/entry/mary-trump-donald-trump-yikes_n_69296f37e4b0bf7d7e2c4d1e",
    "timestamp": "2025-11-28T10:34:12Z"
  },
  {
    "title": "Getting beyond the confusion, misinformation on Tylenol | Opinion",
    "description": "The Federal Food and Drug Administration’s recommendation is that the lowest effective dose be used for the shortest possible duration.",
    "link": "https://www.southbendtribune.com/story/opinion/columns/2025/11/28/getting-beyond-the-confusion-misinformation-on-tylenol-opinion/87450549007/",
    "timestamp": "2025-11-28T10:33:19Z"
  },
  {
    "title": "Denmark Sets up Trump ‘Night Watch’ After Greenland Row",
    "description": "The government of Denmark has set up a \"night watch\" in its Foreign Ministry to monitor President Donald Trump's movements and statements while the country sleeps, the Guardian reported Thursday.\nThe post Denmark Sets up Trump ‘Night Watch’ After Greenland Ro…",
    "link": "https://www.breitbart.com/europe/2025/11/28/denmark-sets-up-trump-night-watch-after-greenland-row/",
    "timestamp": "2025-11-28T10:32:27Z"
  },
  {
    "title": "WSJ Editorial Board: Afghan Refugees ‘Shouldn’t Be Blamed for the Violent Act of One Man’",
    "description": "The Wall Street Journal (WSJ) Editorial Board rushed to the defense of Afghan refugees in an op-ed published on Thursday, saying they “shouldn’t be blamed for the violent act of one man.” On Wednesday, 29-year-old Rahmanullah Lakanwal — an Afghan national who…",
    "link": "https://freerepublic.com/focus/f-news/4354951/posts",
    "timestamp": "2025-11-28T10:18:45Z"
  },
  {
    "title": "As Trump meddles with the Fed, Carney must safeguard the Bank of Canada’s independence",
    "description": "U.S. President Donald Trump’s monetary-policy monkeyshines are plumbing new depths.\nMr. Trump has spent months calling Federal Reserve Chair Jerome Powell every name in the book, including “clown,” “nincompoop” and “major loser.” Now, his Treasury Secretary, …",
    "link": "https://biztoc.com/x/74f8a7c05c478255",
    "timestamp": "2025-11-28T10:15:41Z"
  },
  {
    "title": "EU making war plans while Russia and US talk peace – Orban",
    "description": "Hungarian Prime Minister Viktor Orban has accused the EU of deliberately stalling the Ukraine peace process Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628608-eu-war-plans-orban/",
    "timestamp": "2025-11-28T10:12:39Z"
  },
  {
    "title": "Terrible Sign for the Midterms: Leftist Radical Aftyn Behn in Striking Distance of Winning in Trump Country",
    "description": "Van Epps’s paltry lead within the poll’s 3.9 percent margin of error is likely to give Republicans’ heartburn ahead of the special election.",
    "link": "https://www.westernjournal.com/terrible-sign-midterms-leftist-radical-aftyn-behn-striking-distance-winning-trump-country/",
    "timestamp": "2025-11-28T10:12:03Z"
  },
  {
    "title": "Hungary’s Orban arrives in Moscow: Live Updates",
    "description": "Hungarian Prime Minister Viktor Orban has arrived in Russia for a meeting with President Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628600-orban-moscow-visit-energy/",
    "timestamp": "2025-11-28T10:09:51Z"
  },
  {
    "title": "Trump is changing student-loan eligibility for professional degrees. Here's what you need to know",
    "description": "President Donald Trump's administration is placing new student-loan borrowing caps on graduate and professional degrees.\nAnna Moneymaker/Getty Images\nTrump's student-loan repayment overhaul includes new borrowing caps for graduate and professional students.\nI…",
    "link": "https://biztoc.com/x/54df0612c330e939",
    "timestamp": "2025-11-28T10:04:45Z"
  },
  {
    "title": "NEWT GINGRICH: Republicans get second chance to finally fix healthcare",
    "description": "Healthcare reform package could phase out enhanced premium tax credits while empowering patients through health savings accounts and transparency.",
    "link": "https://www.foxnews.com/opinion/newt-gingrich-republicans-second-chance-fix-healthcare",
    "timestamp": "2025-11-28T10:00:35Z"
  },
  {
    "title": "I helped negotiate Trump's trade deal. He can now fix what Pelosi broke",
    "description": "President Donald Trump has a new opportunity to secure intellectual property victories in the upcoming U.S.-Mexico-Canada Agreement review process.",
    "link": "https://www.foxnews.com/opinion/i-helped-negotiate-trumps-trade-deal-he-can-now-fix-what-pelosi-broke",
    "timestamp": "2025-11-28T10:00:25Z"
  },
  {
    "title": "Trump is making life affordable again for every American and here's how",
    "description": "Treasury counselor Joseph Lavorgna explains how Trump's One Big Beautiful Bill will boost wages through capital incentives and eliminate taxes on tips.",
    "link": "https://www.foxnews.com/opinion/trump-making-life-affordable-again-every-american-heres-how",
    "timestamp": "2025-11-28T10:00:08Z"
  },
  {
    "title": "Give Thanks for Incompetence Destroying Trump’s Second Term",
    "description": "Ross Barkan writes that there may be no adults in the room for the second term, but there are plenty of idiots dooming Trump’s political standing.",
    "link": "http://nymag.com/intelligencer/article/give-thanks-for-incompetence-destroying-trumps-second-term.html",
    "timestamp": "2025-11-28T10:00:04Z"
  },
  {
    "title": "Trump's Approval Rating Drops to 36%, New Second-Term Low",
    "description": "President Donald Trump's job approval rating has slipped to a new second-term low point and is approaching his all-time low of 34%.",
    "link": "https://news.gallup.com/poll/699221/trump-approval-rating-drops-new-second-term-low.aspx",
    "timestamp": "2025-11-28T10:00:00Z"
  },
  {
    "title": "An American Comes to Jesus",
    "description": "I spoke at Jesus College, Cambridge, recently. The latest Trump maneuvers gobsmack our British friends. They’re right to alarmed. \nThe post An American Comes to Jesus  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/11/28/jesus-college-britain-alarmed-by-trump/",
    "timestamp": "2025-11-28T10:00:00Z"
  },
  {
    "title": "Zelensky top aide searched by anti-graft investigators",
    "description": "Yermak is implicated in a $100-million kickback scheme in the strategic energy sector. He is Zelenskyy's most important ally, but a divisive figure in Kyiv",
    "link": "https://www.euractiv.com/news/zelensky-top-aide-searched-by-anti-graft-investigators/",
    "timestamp": "2025-11-28T09:59:16Z"
  },
  {
    "title": "Three reasons why China wants global green leadership after Cop30 – and two reasons it doesn’t",
    "description": "China is hesistant about taking over financial leadership over the global fight against climate change. Here’s why.",
    "link": "https://theconversation.com/three-reasons-why-china-wants-global-green-leadership-after-cop30-and-two-reasons-it-doesnt-270329",
    "timestamp": "2025-11-28T09:57:39Z"
  },
  {
    "title": "Hungary's Viktor Orbán To Meet Russia's Vladimir Putin In Moscow For Energy Talks",
    "description": "Orbán, a Putin ally, has convinced Trump to grant his country an exemption to the sanctions the U.S. president has placed on two Russian energy companies.",
    "link": "https://www.huffpost.com/entry/orban-to-visit-putin-in-moscow_n_69296f98e4b0237ded13e2b5",
    "timestamp": "2025-11-28T09:56:10Z"
  },
  {
    "title": "Trump No Longer Held Criminally Accountable for Trying To Overturn Election",
    "description": "Five years after Donald Trump sought to overturn the results of the 2020 presidential race, the final criminal case related to those efforts has been dismissed, meaning the president will face no criminal trial over actions prosecutors once said were supporte…",
    "link": "https://biztoc.com/x/7294993caf626e71",
    "timestamp": "2025-11-28T09:53:38Z"
  },
  {
    "title": "Trump is changing student-loan eligibility for professional degrees. Here's what you need to know.",
    "description": "Trump's administration is capping new student loans for grad students and said that some degrees, like nursing, won't be classified as \"professional.\"",
    "link": "https://www.businessinsider.com/trump-changing-professional-graduate-degrees-student-loan-debt-nursing-2025-11",
    "timestamp": "2025-11-28T09:52:19Z"
  },
  {
    "title": "Trump's targeting of 'third world' immigrants after the DC shooting is spreading fear",
    "description": "America is coming to terms with the shooting of two National Guard members, and even those who have come to the country legally are scared of the fall-out.",
    "link": "https://news.sky.com/story/trumps-targeting-of-third-world-immigrants-after-the-dc-shooting-is-spreading-fear-13476430",
    "timestamp": "2025-11-28T09:48:00Z"
  },
  {
    "title": "Defending Press Freedom in the Age of Trump",
    "description": "As authoritarian leaders seek to delegitimize independent news and AI blurs the line between facts and falsehoods, journalists around the world are fighting to be heard above a rising tide of misinformation and propaganda. In this environment, news outlets mu…",
    "link": "https://www.project-syndicate.org/onpoint/key-to-saving-journalism-from-ai-misinformation-and-propaganda-by-martin-baron-2025-11",
    "timestamp": "2025-11-28T09:37:05Z"
  },
  {
    "title": "Need a New Laptop? These 41 Black Friday Deals Are the Ones You Should Pay Attention To",
    "description": "From MacBooks, Chromebooks and everything in between, these Black Friday laptop deals are dropping fast -- and they’re good.",
    "link": "https://www.cnet.com/deals/best-black-friday-laptop-deals-2025-11-28/",
    "timestamp": "2025-11-28T09:37:00Z"
  },
  {
    "title": "Trump’s ‘Gross’ Answer To National Guard Member Funeral Question Draws Fury Online",
    "description": "Critics on social media ripped the president as self-centered.",
    "link": "https://www.huffpost.com/entry/donald-trump-funeral-comment_n_692963bfe4b0bf7d7e2c4760",
    "timestamp": "2025-11-28T09:32:27Z"
  },
  {
    "title": "Trump Outlines Immigration Crackdown on 'Third World' Nations",
    "description": "President Donald Trump called for “reverse migration” in the US while outlining a series of potential measures to crack down on ...",
    "link": "https://biztoc.com/x/e7a2407e58ac138d",
    "timestamp": "2025-11-28T09:28:40Z"
  },
  {
    "title": "State Dept. Orders U.S. Diplomats To Emphasize 'Negative Social Impacts Of Mass Migration'",
    "description": "The Nov. 21 cable said diplomats stationed in Europe should \"raise U.S. concerns about violent crimes associated with people of a migration background.\"",
    "link": "https://www.huffpost.com/entry/state-dept-cable-against-mass-migration_n_692955b0e4b0308db07b9db4",
    "timestamp": "2025-11-28T09:26:50Z"
  },
  {
    "title": "Trump Says Migration Erodes 'Gains and Living Conditions' for Many Americans",
    "description": "Americans have been very patient while the federal government's \"Immigration Policy has eroded [civic] gains and living conditions for many,\" President Donald Trump declared in a Thanksgiving Day statement on Truth Social as he promised to deport many more mi…",
    "link": "https://www.breitbart.com/economy/2025/11/28/trump-says-migration-erodes-gains-and-living-conditions-for-many-americans/",
    "timestamp": "2025-11-28T09:21:47Z"
  },
  {
    "title": "New legal armour provides unprecedented power for Pakistan’s military",
    "description": "Sweeping legal reforms and regional conflict have consolidated the Pakistani military’s grip on power in the past year, diluting the role of the civilian government while offering an unprecedented legal shield to the army chief, experts say. Widely seen as Pa…",
    "link": "https://www.digitaljournal.com/world/new-legal-armour-provides-unprecedented-power-for-pakistans-military/article",
    "timestamp": "2025-11-28T09:12:20Z"
  },
  {
    "title": "Donald Trump’s Divisive Thanksgiving Message: “Permanently Pause Migration From All Third World Countries”",
    "description": "Donald Trump has delivered a divisive Thanksgiving message, a foul-mouthed rant in which he said he will “permanently pause migration from all Third World Countries.” Taking to Truth Social in the early hours of this morning, the President had anything but a …",
    "link": "http://deadline.com/2025/11/donald-trump-thanksgiving-message-pause-migration-1236630610/",
    "timestamp": "2025-11-28T09:11:14Z"
  },
  {
    "title": "India, US hold virtual trade talks, deal to be locked before year end: Report",
    "description": "India and the United States are holding regular virtual trade talks, with Commerce Secretary Rajesh Agarwal expressing optimism about finalizing a deal by year-end. Most issues are reportedly resolved, and any remaining points could be addressed at the politi…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-us-hold-virtual-trade-talks-deal-to-be-locked-before-year-end-report/articleshow/125633979.cms",
    "timestamp": "2025-11-28T09:10:37Z"
  },
  {
    "title": "Afghan Refugees Worry As US Halts Immigration Requests After Shooting Kills At Least One",
    "description": "The United States said it is halting all immigration requests relating to Afghanistan after an Afghan national shot two members of the National Guard, one of whom died a day after the shooting near the White House.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251128-rferl01.htm",
    "timestamp": "2025-11-28T09:08:17Z"
  },
  {
    "title": "Russia Will Not Be in Situation When US Conducts Nuclear Tests and Moscow Does Not - Putin",
    "description": "Russia cannot find itself in a situation where the United States conducts nuclear tests while Moscow spends another year and a half preparing for them, Russian President Vladimir Putin said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/11/russia-251127-sputnik01.htm",
    "timestamp": "2025-11-28T09:00:55Z"
  },
  {
    "title": "Putin: Russia Ready to Share Weapons, Equipment With CSTO Partners",
    "description": "Russia is ready to share weapons and equipment with its partners in the Collective Security Treaty Organization, Russian President Vladimir Putin said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/11/russia-251127-sputnik03.htm",
    "timestamp": "2025-11-28T09:00:27Z"
  },
  {
    "title": "'Tis the season for holiday shopping. But are Canadian products on the list?",
    "description": "Despite recent data suggesting the Buy Canadian movement is losing steam, some business owners are hopeful the boom they've been seeing will continue through Black Friday sales and throughout the holiday shopping season.",
    "link": "https://www.cbc.ca/news/business/buy-canadian-holiday-shopping-9.6994427",
    "timestamp": "2025-11-28T09:00:00Z"
  },
  {
    "title": "Military family inspires some young Canadians to enlist, despite recruitment hurdles",
    "description": "Against a backdrop of increased tensions with the U.S. and dismal labour prospects for young Canadians, some students are looking to the military for their future careers. They tell CBC News why the Canadian Armed Forces has captured their interest and where …",
    "link": "https://www.cbc.ca/news/canada/caf-students-recruits-9.6993565",
    "timestamp": "2025-11-28T09:00:00Z"
  },
  {
    "title": "Why the White House blames National Guard shooting on program that brought Afghan nationals to the U.S.",
    "description": "The Trump White House is blaming Operation Allies Welcome, a Biden-era program that brought thousands of Afghan nationals to the U.S., for bringing the suspect in Wednesday's National Guard shooting to the U.S. Here's what we know about the program.",
    "link": "https://www.cbc.ca/news/world/afghan-nationals-us-program-9.6995070",
    "timestamp": "2025-11-28T09:00:00Z"
  },
  {
    "title": "Trump Admin ‘Looking at’ Deporting Rahmanullah Lakanwal’s Family",
    "description": "President Donald Trump said Thursday that his administration is examining whether to deport the family members of Rahmanullah Lakanwal, the suspect accused of shooting two National Guard members in Washington, D.C.\nWhen asked directly by a reporter whether he…",
    "link": "https://biztoc.com/x/96ebe4e4a065128a",
    "timestamp": "2025-11-28T08:57:51Z"
  },
  {
    "title": "U.S. National Guard shooting suspect worked with U.S. forces in Afghanistan: media",
    "description": "The suspect in the shooting of two U.S. National Guard soldiers near the White House on Wednesday was an Afghan national who had previously served alongside U.S. forces in Afghanistan, local media reported.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/11/sec-251128-pdo01.htm",
    "timestamp": "2025-11-28T08:56:46Z"
  },
  {
    "title": "After call with China, Trump 'advises Takaichi not to provoke China' on Taiwan; Japanese PM's office declines to comment: media",
    "description": "Multiple Japanese media outlets reported that when asked whether she had discussed the Taiwan question with US President Donald Trump during their recent call, Japanese Prime Minister Sanae Takaichi dodged the question. Meanwhile, the Wall Street Journal repo…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251127-globaltimes04.htm",
    "timestamp": "2025-11-28T08:55:25Z"
  },
  {
    "title": "Chinese FM responds on reports claiming Trump asked Takaichi to tone down Taiwan-related remarks: no comment on matter between US, Japan",
    "description": "In response to a question that it is reported that US President Donald Trump had requested the Japanese prime minister to tone down remarks related to the Taiwan question and whether the reported matter is influenced by the recent China-US leaders' phone call…",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-251127-globaltimes07.htm",
    "timestamp": "2025-11-28T08:55:18Z"
  },
  {
    "title": "Explainer: Is the new Ukraine \"peace plan\" a real deal for peace?",
    "description": "The U.S.-proposed 28-point \"peace plan\" was unveiled last week. Following its release, representatives from the United States, Ukraine and several European countries met in Geneva on Sunday to discuss the plan.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251128-pdo01.htm",
    "timestamp": "2025-11-28T08:54:03Z"
  },
  {
    "title": "Witkoff's Visit to Russia Still on Track, No Reason to Question It - Russian Foreign Ministry",
    "description": "The visit of US special envoy Steve Witkoff to Russia is still on track, there is no reason to question it, Russian Deputy Foreign Minister Sergey Ryabkov said on Thursday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251127-sputnik05.htm",
    "timestamp": "2025-11-28T08:52:44Z"
  },
  {
    "title": "Larijani: US-Israeli efforts to destroy Iran's nuclear capability 'immature and foolish'",
    "description": "The secretary of Iran's Supreme National Security Council (SNSC) has stated that US and Israeli efforts to eliminate Iran's nuclear capabilities are \"immature and foolish,\" as Iran's nuclear industry is an indigenous technology pursued with full determination.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251127-presstv05.htm",
    "timestamp": "2025-11-28T08:50:08Z"
  },
  {
    "title": "US, with all its modern military arsenal, suffered defeat in 12-day war: Leader",
    "description": "Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei says the US suffered severe losses during the 12-day war with Iran in June, despite deploying its most advanced military equipment, including submarines, fighter jets, and state-of-the-art defense…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/11/iran-251127-presstv03.htm",
    "timestamp": "2025-11-28T08:49:17Z"
  },
  {
    "title": "RSF converts hospital in Sudan’s West Kordofan into military base",
    "description": "Sudan Doctors Network says military use of hospital is 'a blatant violation of sanctity of medical institutions'.",
    "link": "https://www.aljazeera.com/news/2025/11/28/rsf-converts-hospital-in-sudans-west-kordofan-into-military-base",
    "timestamp": "2025-11-28T08:47:49Z"
  },
  {
    "title": "Donald Trump Proposes Eliminating Income Tax",
    "description": "President Donald Trump has proposed “almost completely” cutting income tax, which he said could be achieved thanks to the effects of his trade policies.\nIn a Thanksgiving message delivered from his Mar-a-Lago estate in Florida, the president referenced the in…",
    "link": "https://biztoc.com/x/d9e37d1bca894ba9",
    "timestamp": "2025-11-28T08:47:15Z"
  },
  {
    "title": "Europe and Africa send a strong signal together",
    "description": "Press statement by Federal Chancellor Merz ahead of the EU-Africa summit in Luanda Before the summit meeting of the European Union and the African Union in Luanda, Federal Chancellor Merz praised the talks on a ceasefire in Ukraine. He also emphasised the EU'…",
    "link": "https://www.globalsecurity.org/wmd/library/news/germany/2025/germany-251124-de-fedgov01.htm",
    "timestamp": "2025-11-28T08:45:22Z"
  },
  {
    "title": "Trump admits Russian icebreaker dominance",
    "description": "US President Donald Trump has acknowledged Russia’s clear advantage in its icebreaker fleet, which numbers 48 to Washington’s one Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628606-trump-russia-icebreaker-dominance/",
    "timestamp": "2025-11-28T08:38:34Z"
  }
]