[
  {
    "title": "Trump's tariffs insanity begins to fracture the MAGA cult (Noah Berlatsky/Public Notice)",
    "description": "Noah Berlatsky / Public Notice:\nTrump's tariffs insanity begins to fracture the MAGA cult  —  Republican resistance is helpful.  But more of it is needed. … ️  —  Last week, President Donald Trump finally unveiled his tariff policy — an incoherent bolus of …",
    "link": "https://www.memeorandum.com/250407/p23",
    "timestamp": "2025-04-07T12:25:00Z"
  },
  {
    "title": "U.S. stock futures in freefall ahead of market open, will there be another mayhem today?",
    "description": "US stock futures fell sharply on Monday, forecasting a turbulent day on Wall Street. The drop is attributed to President Trump’s aggressive tariffs impacting global markets, leading to significant losses in major indices. Experts warn of severe long-term econ…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-stock-futures-in-freefall-ahead-of-market-open-will-there-be-another-mayhem-today/articleshow/120063972.cms",
    "timestamp": "2025-04-07T12:24:49Z"
  },
  {
    "title": "‘It’s a health issue, not an economic issue’ – Trump tariffs should not delay alcohol labelling plans, campaigners say",
    "description": "The chair of a group that campaigns to highlight the dangers posed by alcohol has warned against dropping plans to put health warnings on alcohol containers due to the threat of US tariffs.",
    "link": "https://www.independent.ie/irish-news/its-a-health-issue-not-an-economic-issue-trump-tariffs-should-not-delay-alcohol-labelling-plans-campaigners-say/a1763407352.html",
    "timestamp": "2025-04-07T12:23:01Z"
  },
  {
    "title": "Man and woman in court over damage to Trump golf resort",
    "description": "A man and a woman have appeared in court accused of maliciously damaging a Scottish golf course owned by US President Donald Trump.",
    "link": "https://news.sky.com/story/man-and-woman-in-court-over-damage-to-trump-turnberry-golf-resort-in-scotland-13343856",
    "timestamp": "2025-04-07T12:23:00Z"
  },
  {
    "title": "Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "President Trump is remaining defiant as global markets continue to plunge after his tariff announcement last week.",
    "link": "https://www.denverpost.com/2025/04/07/trump-reaction-global-markets-dropping/",
    "timestamp": "2025-04-07T12:22:25Z"
  },
  {
    "title": "Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "President Trump is remaining defiant as global markets continue to plunge after his tariff announcement last week.",
    "link": "https://www.bostonherald.com/2025/04/07/trump-reaction-global-markets-dropping/",
    "timestamp": "2025-04-07T12:22:25Z"
  },
  {
    "title": "NATIONAL BEER DAY - April 7",
    "description": "NATIONAL BEER DAY National Beer Day on April 7th annually, recognizes the world's most widely consumed alcoholic beverage. Following water and tea, it is the third most popular drink overall. #NationalBeerDay One of the world’s oldest prepared beverages, beer…",
    "link": "https://freerepublic.com/focus/f-chat/4309377/posts",
    "timestamp": "2025-04-07T12:21:53Z"
  },
  {
    "title": "Dow Futures Tumble 800 Points: Stocks Sink Even Further As Tariff-Driven Recession Fears Accelerate",
    "description": "The benchmark Dow and S&P 500 are both set to open on the cusp of a 20% bear market, with a majority of losses following Trump’s “Liberation Day” tariffs announced last week.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/07/dow-futures-tumble-800-points-stocks-sink-even-further-as-tariff-driven-recession-fears-accelerate/",
    "timestamp": "2025-04-07T12:19:40Z"
  },
  {
    "title": "Euro and government bonds are investors’ refuge amidst the turmoil",
    "description": "As US President Donald Trump’s tariffs have caused a global economic turmoil, the markets are under strong pressure. In this environment, investors are looking for refuge.\nThey find it initially…\nEuro and government bonds are investors’ refuge amidst the turm…",
    "link": "https://www.naftemporiki.gr/english/1942197/euro-and-government-bonds-are-investors-refuge-amidst-the-turmoil/",
    "timestamp": "2025-04-07T12:19:24Z"
  },
  {
    "title": "Ontario unveils $11B aid to shield workers, businesses from tariffs",
    "description": "The provincial government states that it's deferring select administered taxes for six months from April 1, 2025, to Oct. 1, 2025.",
    "link": "https://toronto.citynews.ca/2025/04/07/ontario-businesses-trump-tariffs-financial-aid-doug-ford/",
    "timestamp": "2025-04-07T12:19:12Z"
  },
  {
    "title": "US federal agencies to report crypto holdings to Treasury by April 7",
    "description": "US federal agencies are expected to disclose their cryptocurrency holdings to the Department of the Treasury by April 7, following an executive order signed by President Donald Trump earlier this year.Citing an unnamed White House official, journalist Eleanor…",
    "link": "https://cointelegraph.com/news/federal-agencies-crypto-holdings-disclosure-deadline",
    "timestamp": "2025-04-07T12:18:04Z"
  },
  {
    "title": "Major garment producer Bangladesh says US buyers halting orders",
    "description": "US buyers have begun halting orders from Bangladesh, the world’s second-biggest garment manufacturer, after punishing US tariffs that pushed the government in Dhaka to plead on Monday for a three-month pause to the levies. Textile and garment production accou…",
    "link": "https://www.digitaljournal.com/world/major-garment-producer-bangladesh-says-us-buyers-halting-orders-2/article",
    "timestamp": "2025-04-07T12:17:33Z"
  },
  {
    "title": "‘So Stupid!’ Trump Lashes Out at Reporter Who Confronted Him About Stock Market Disaster on Air Force One",
    "description": "President Donald Trump lashed out at a reporter who confronted him about the stock market's disastrous week, telling her \"Your question is so stupid!\"\nThe post ‘So Stupid!’ Trump Lashes Out at Reporter Who Confronted Him About Stock Market Disaster on Air For…",
    "link": "https://www.mediaite.com/news/so-stupid-trump-lashes-out-at-reporter-who-confronted-him-about-stock-market-disaster-on-air-force-one/",
    "timestamp": "2025-04-07T12:17:02Z"
  },
  {
    "title": "Trump’s Policies Crush Inflation Per Blockchain-Based Inflation Index — Proving Media and “Experts” Wrong Yet Again",
    "description": "Recent data challenges prevailing narratives about inflation, revealing a significant drop under Trump’s policies. This analysis highlights a remarkable economic turnaround, prompting a reevaluation of current leadership’s impact on American finances.\nThe pos…",
    "link": "https://www.thegatewaypundit.com/2025/04/trumps-policies-crush-inflation-per-blockchain-based-inflation/",
    "timestamp": "2025-04-07T12:15:46Z"
  },
  {
    "title": "What’s Coming to Netflix This Week: Kill Tony, Black Mirror, The Addams Family",
    "description": "Everything scheduled to hit Netflix between April 7th to 13th, 2025 with Black Mirror season 7 being the big new highlight.",
    "link": "https://www.whats-on-netflix.com/coming-soon/whats-coming-to-netflix-this-week-kill-tony-black-mirror-the-addams-family/",
    "timestamp": "2025-04-07T12:15:18Z"
  },
  {
    "title": "'Boom!': CNN Data Chief Spots How Trump Just Made History — In The Worst Way",
    "description": "“This is truly unique,\" said Harry Enten.",
    "link": "https://www.huffpost.com/entry/harry-enten-donald-trump-tariffs_n_67f3b4c2e4b0afc2a9d7891a",
    "timestamp": "2025-04-07T12:15:15Z"
  },
  {
    "title": "Joe Scarborough Shreds Billionaire Trump Backer for ‘Shocked’ Tariff Protest: ‘You Knew!’",
    "description": "Morning Joe host Joe Scarborough laid into billionaire Trump backer Bill Ackman for having “seen the light” too late after the Wall Street banker’s panicked pleas to the president for a tariffs stay. With markets reeling from last week’s sweeping tariffs and …",
    "link": "https://www.mediaite.com/tv/joe-scarborough-shreds-billionaire-trump-backer-for-shocked-tariff-protest-you-knew/",
    "timestamp": "2025-04-07T12:15:10Z"
  },
  {
    "title": "Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "President Donald Trump is remaining defiant as global markets continue to plunge and fears of a recession grow after his tariff announcement last week.",
    "link": "https://www.clickondetroit.com/news/politics/2025/04/07/trump-digs-in-his-heels-as-global-markets-keep-dropping-over-tariffs/",
    "timestamp": "2025-04-07T12:14:58Z"
  },
  {
    "title": "Why Tariffs Decrease the Wealth of Nations",
    "description": "Throughout the early modern period—from the rise of the nation state through the nineteenth century—the predominant economic ideology of the Western world was mercantilism, or the belief that nations compete for a fixed amount of wealth in a zero-sum game: th…",
    "link": "https://www.skeptic.com/article/why-tariffs-decrease-the-wealth-of-nations/",
    "timestamp": "2025-04-07T12:14:15Z"
  },
  {
    "title": "EU may target US tech giants in tariff response",
    "description": "By putting services in scope, €18 trillion trade bloc looks to focus tech sector minds Speaking ahead of today's extraordinary meeting of the European Union's trade minister, a spokesperson for the French government was clear that the trading bloc's response …",
    "link": "https://www.theregister.com/2025/04/07/eu_to_target_us_tech/",
    "timestamp": "2025-04-07T12:14:08Z"
  },
  {
    "title": "'NO INFLATION': Trump stands firm on 'beautiful' tariff plan amid market rout, says US bringing billions of dollars",
    "description": "US President Donald Trump on Monday called on the Federal Reserve to cut interest rates and doubled down on his criticism of China and nations who have imposed tariffs on US imports. “There is NO INFLATION,\" Trump wrote, while claiming that the US economy was…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-inflation-trump-stands-firm-on-tariff-plan-amid-market-rout-says-us-bringing-billions-of-dollars/articleshow/120065456.cms",
    "timestamp": "2025-04-07T12:13:18Z"
  },
  {
    "title": "Orange Monday madness: Donald Trump’s tariff tsunami leads to bloodbath in global markets, wipes out portfolios, and shocks the economy as investors panic",
    "description": "Orange Monday market crash shook the world as Donald Trump’s sweeping tariffs triggered a financial firestorm. In one bold move, global markets tanked, portfolios vanished, and panic hit Wall Street. From hedge fund chaos to silver’s surprising potential, thi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/orange-monday-madness-donald-trumps-tariff-tsunami-leads-to-bloodbath-in-global-markets-wipes-out-portfolios-and-shocks-the-economy-as-investors-panic/articleshow/120064944.cms",
    "timestamp": "2025-04-07T12:13:03Z"
  },
  {
    "title": "How Obama and Biden Paved the Way for Trump's Attacks on Universities",
    "description": "President Donald Trump has been laying siege to Columbia University, canceling $400 million in federal grants to the elite school. In exchange for having funds restored, Columbia's administration has agreed to capitulate to a list of demands relating to campu…",
    "link": "https://biztoc.com/x/b95c74b0792bc2d0",
    "timestamp": "2025-04-07T12:12:59Z"
  },
  {
    "title": "Donald Trump Tariffs Update—Stocks Tumble as Trump Team Rejects Deal Offers",
    "description": "The administration shows no signs of backing down despite offers to negotiate, global market selloffs and a brewing GOP rebellion.",
    "link": "https://biztoc.com/x/2582fe006cf17688",
    "timestamp": "2025-04-07T12:12:58Z"
  },
  {
    "title": "Posthaste: Investors warned against catching 'a falling knife' as Trump tariff meltdown deepens",
    "description": "Market forecasts are being slashed as the selloff sparked by U.S. President Donald Trump‘s tariff onslaught shows no signs of abating.\nAfter Trump’s “Liberation Day” last week, the S&P 500 suffered its worst two-day drop since March 2020, wiping out over US$5…",
    "link": "https://biztoc.com/x/53eead8e3b65c2d6",
    "timestamp": "2025-04-07T12:12:56Z"
  },
  {
    "title": "Donald Trump Tariffs Update—Stocks Tumble as Trump Team Rejects Deal Offers",
    "description": "The administration shows no signs of backing down despite offers to negotiate, global market selloffs and a brewing GOP rebellion.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-update-rejects-deals-2056216",
    "timestamp": "2025-04-07T12:11:35Z"
  },
  {
    "title": "Trump vows crackdown on health fraud after letting some go",
    "description": "President Trump vowed to wage a war on fraud in health care, claiming he found billions already. But he let some convicted of the crime go in his first term.",
    "link": "https://www.postandcourier.com/health/trump-fraud-health-care-executives-pardons/article_42dc0345-ddf4-4fb2-aae0-e0524d23c5a9.html",
    "timestamp": "2025-04-07T12:10:20Z"
  },
  {
    "title": "Russia’s Urals Oil Crashes Toward $50 in “Extremely Turbulent” Market",
    "description": "Russia’s flagship Urals crude grade has tumbled alongside all major oil benchmarks in the global market rout and is close to the $50 per barrel threshold for the first time in nearly two years. The Urals price was at around $52 per barrel at the Baltic Sea po…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Russias-Urals-Oil-Crashes-Toward-50-in-Extremely-Turbulent-Market.html",
    "timestamp": "2025-04-07T12:09:00Z"
  },
  {
    "title": "FO° Exclusive: Germany’s Radical New Economic Policy",
    "description": "Glenn Carle: Well, let’s go from the, obviously, profoundly depressing subject for me so people don’t have to watch me fume and steam anymore, impotently, and turn to something which I find is a more hopeful topic, which is Germany’s Radical New Economic Poli…",
    "link": "https://www.fairobserver.com/region/europe/fo-exclusive-germanys-radical-new-economic-policy/",
    "timestamp": "2025-04-07T12:06:55Z"
  },
  {
    "title": "Risk of US recession at 45% – Goldman Sachs",
    "description": "The Wall Street bank has raised the odds of a US economic downturn to 45% following Donald Trump’s tariff hike Read Full Article at RT.com",
    "link": "https://www.rt.com/business/615334-risk-us-recession-goldman/",
    "timestamp": "2025-04-07T12:05:29Z"
  },
  {
    "title": "SNL Mocks Morgan Wallen Leaving the Stage During Last Week’s Episode",
    "description": "Saturday Night Live poked fun at country pop singer Morgan Wallen for abruptly leaving during the live broadcast of last week’s episode. On the April 5 episode of SNL, the incident involving Wallen’s sudden departure was referenced in two separate segments: T…",
    "link": "https://www.comingsoon.net/tv/news/1951162-snl-morgan-wallen-leaving-joke-gods-country",
    "timestamp": "2025-04-07T12:05:00Z"
  },
  {
    "title": "Panic Monday: World stock markets plunge again as Trump doubles down on tariffs",
    "description": "U.S. stocks are swinging following a manic morning as Wall Street tossed around a false rumor about President Donald Trump's plans for his trade war.",
    "link": "https://www.local10.com/business/2025/04/07/asian-markets-plunge-as-japans-nikkei-225-index-dives-nearly-8-after-the-big-meltdown-on-wall-st/",
    "timestamp": "2025-04-07T12:03:26Z"
  },
  {
    "title": "Why iPhone-as-a-service may make sense as tariffs bite Apple",
    "description": "It might be time for Apple-as-a-service as the company looks to plot a cunning course through the post-globalist freeze — and offering its products as a service could help it do just that.\r\n\n\n\n\nApple had been expected to introduce just such a service. In fact…",
    "link": "https://www.computerworld.com/article/3955962/why-iphone-as-a-service-may-make-sense-as-tariffs-bite-apple.html",
    "timestamp": "2025-04-07T12:03:09Z"
  },
  {
    "title": "Global Credit Starts to Wobble as Market Pain Spreads",
    "description": "Global credit markets began to come under fire on Monday, driving the cost of insuring against corporate and sovereign default higher, as recession fears rippled across equities, commodities and currencies. Trillions of dollars have been wiped off global stoc…",
    "link": "https://www.insurancejournal.com/news/international/2025/04/07/818796.htm",
    "timestamp": "2025-04-07T12:02:47Z"
  },
  {
    "title": "How Dangerous are Growing Tensions Between Israel and Egypt?",
    "description": "Tensions have escalated in recent weeks between Israel and Egypt over military activities in Egypt's Sinai Peninsula.\nThe tensions have deepened since U.S. President Donald Trump raised the possibility of Palestinians from the devastated Gaza Strip moving int…",
    "link": "https://biztoc.com/x/ef8504e648696bb0",
    "timestamp": "2025-04-07T12:01:52Z"
  },
  {
    "title": "White House incoherence, contradictions make Trump’s tariffs rollout even worse",
    "description": "The more Team Trump talks about trade tariffs, the harder it is to understand what the White House is doing and why.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/white-house-incoherence-contradictions-make-trumps-tariffs-rollout-eve-rcna199952",
    "timestamp": "2025-04-07T12:01:46Z"
  },
  {
    "title": "Israel's Netanyahu to Talk Tariffs in White House",
    "description": "3 min ago\nIsrael's Netanyahu to Talk Trade in White House. It Will Test Trump's Stance.\nIsrael's Prime Minister Benjamin Netanyahu will be the first world leader to hold in-person talks with President Donald Trump since \"Liberation Day,\" when the pair meet la…",
    "link": "https://biztoc.com/x/b9a7706f2a725389",
    "timestamp": "2025-04-07T12:01:45Z"
  },
  {
    "title": "Trump says China is 'biggest abuser of them all’ on tariffs, is ignoring his warnings ‘not to retaliate’",
    "description": "President Donald Trump called China the \"biggest abuser of them all\" when it comes to tariffs, adding in a Truth Social post Monday that Beijing is ignoring his warnings \"not to retaliate.\" \nTrump made the remark after China’s foreign ministry accused the U.S…",
    "link": "https://biztoc.com/x/11f3e50a2d7c9491",
    "timestamp": "2025-04-07T12:01:42Z"
  },
  {
    "title": "Capitol agenda: Tariff tumult roils GOP agenda",
    "description": "President Donald Trump is doubling down on his trade war as global financial markets melt down and economic calamity looms. It's going to be a brutal week ahead for Republican lawmakers who are already on edge about owning the policy and are struggling to uni…",
    "link": "https://biztoc.com/x/a2664422fde322a6",
    "timestamp": "2025-04-07T12:01:32Z"
  },
  {
    "title": "Global stocks plummet as Trump tariffs stoke recession fears",
    "description": "As stock markets continue to plunge, investors are worried the world could face an economic slump. DW explores the impact of Trump's tariffs on US, Chinese and world growth.",
    "link": "https://www.dw.com/en/global-stocks-plummet-as-trump-tariffs-stoke-recession-fears/a-72158605",
    "timestamp": "2025-04-07T12:01:00Z"
  },
  {
    "title": "Chinese Stocks Plummet Over 12% Amid Escalating Trade War, Set for Worst Single-Day Crash Since Great Financial Crisis in 2008",
    "description": "Chinese stock markets experienced a historic collapse, plunging over 12% amid escalating trade tensions with the U.S. This dramatic downturn raises significant concerns about global economic stability and the potential for a wider trade war.\nThe post Chinese …",
    "link": "https://www.thegatewaypundit.com/2025/04/chinese-stocks-plummet-12-amid-escalating-trade-war/",
    "timestamp": "2025-04-07T12:00:51Z"
  },
  {
    "title": "Colorado food pantries scramble amid steep federal funding cuts",
    "description": "Colorado's food banks and pantries are reeling from a recent wave of funding cuts by President Donald Trump's administration.",
    "link": "https://www.denverpost.com/2025/04/07/colorado-food-bank-pantry-funding-cuts/",
    "timestamp": "2025-04-07T12:00:37Z"
  },
  {
    "title": "Will Trump's Sweeping Global Tariffs Derail Australia's Economy? Chalmers Offers Reassurance",
    "description": "According to the Treasury's modeling, the U.S. tariffs and China's retaliatory measures would lead to a 0.1% drop in Australia's real GDP for the year.",
    "link": "https://www.ibtimes.com.au/will-trumps-sweeping-global-tariffs-derail-australias-economy-chalmers-offers-reassurance-1857620",
    "timestamp": "2025-04-07T12:00:25Z"
  },
  {
    "title": "Conor McGregor’s Memecoin Taps Out—Failed Launch Sparks Refund Pledge",
    "description": "UFC fighter Conor McGregor’s foray into cryptocurrency hit a roadblock this weekend. His “REAL” token failed to launch after raising only $392,315 from 668 bidders during its 28-hour presale. The amount fell far short of the $1,008,000 minimum requirement nee…",
    "link": "https://bitcoinist.com/conor-mcgregors-coin-taps-out-after-failed-launch/",
    "timestamp": "2025-04-07T12:00:24Z"
  },
  {
    "title": "Trump’s 12th week in office to be dominated by tariffs fallout, Netanyahu visit",
    "description": "President Donald Trump's 12th week in office promises to once again be dominated by reactions to the president's controversial tariffs that were announced last week.",
    "link": "https://www.foxnews.com/politics/trumps-12th-week-office-dominated-tariffs-fallout-netanyahu-visit",
    "timestamp": "2025-04-07T12:00:06Z"
  },
  {
    "title": "Meet Lukas Ventouras, Blue America's Pick On Long Island",
    "description": "This cycle Nick LaLota will have an opponent who’s not a Republican-lite corporate shill. Blue America has endorsed Lukas Ventouras and you’ll be hearing lots about him. Let’s start with this guest post in which he introduces himself. If you like what he has …",
    "link": "https://crooksandliars.com/2025/04/meet-lukas-ventouras-blue-americas-pick",
    "timestamp": "2025-04-07T12:00:01Z"
  },
  {
    "title": "Grumble Against God",
    "description": "<ul>\n<li>Crashing The Stock Market To Prevent A Stock Market Crash</li>\n<li>Disband Congress</li>\n<li>Hands Off Our Communist/Jihadi Protests</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/grumble-against-god",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "'Let Him Cook': Glenn Beck And Kevin Roberts Flack For Trump's Tariff Policy",
    "description": "Glenn Beck and Kevin Roberts defend Trump's tariff policy because Trump has established the best cabinet \"since the founding era.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/let-him-cook-glenn-beck-and-kevin-roberts-flack-trumps-tariff-policy",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "Nintendo Shares Plummet In Wake Of Trump Tariff Action",
    "description": "US pre-order postponement woes.In the wake of Nintendo's decision to delay opening its Nintendo Switch 2 pre-orders in the US following upheaval and uncertainty around newly-imposed tariffs, the company has seen a 10% drop in its Tokyo-listed shares, reports …",
    "link": "https://www.nintendolife.com/news/2025/04/nintendo-shares-plummet-in-wake-of-trump-tariff-action",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "For All Its Flaws, American Health Care Gets a Lot Right",
    "description": "We all know the problems with American health care. It costs too much, there are gaps in insurance coverage, health care markets are uncompetitive, provider payments are often... Read More\nThe post For All Its Flaws, American Health Care Gets a Lot Right appe…",
    "link": "https://www.dailysignal.com/2025/04/07/for-all-its-flaws-american-healthcare-gets-a-lot-right/",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "What to Know About the Controversial Comedian Tony Hinchcliffe Ahead of His Netflix Specials",
    "description": "What to know about comedian Tony Hinchcliffe, whose first Netflix special premieres April 7",
    "link": "https://time.com/7275092/tony-hinchcliffe-netflix-comedy-specials/",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "Weak And Stupid",
    "description": "<ul>\n<li>Purging The Underground Railroad</li>\n<li>Trump's Big Parade</li>\n<li>That's Not How Parables Work</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/weak-and-stupid",
    "timestamp": "2025-04-07T12:00:00Z"
  },
  {
    "title": "Posthaste: Investors warned against catching 'a falling knife' as Trump's tariffs fuel market meltdown",
    "description": "Trump's tariffs have sparked a market selloff that has analysts slashing forecasts for the S&ampamp;P 500. Find out more",
    "link": "https://financialpost.com/news/trump-tariffs-fuel-stock-market-meltdown",
    "timestamp": "2025-04-07T11:59:34Z"
  },
  {
    "title": "Forbes Daily: New Tariff Critics Emerge As Thousands Protest Trump",
    "description": "Today’s Forbes Daily covers nationwide Trump protests, tariff blowback, a complicated jobs report, Alex Ovechkin’s big goal, the fight over Lifeway kefir and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/07/forbes-daily-new-tariff-critics-emerge-as-thousands-protest-trump/",
    "timestamp": "2025-04-07T11:59:25Z"
  },
  {
    "title": "California Could Ban ICE From Public Schools",
    "description": "State lawmakers are pushing a bill that would prevent federal immigration authorities from accessing public schools.",
    "link": "https://www.newsweek.com/california-ban-ice-public-schools-immigration-2056198",
    "timestamp": "2025-04-07T11:59:20Z"
  },
  {
    "title": "Citi Confronts Trump, DOGE Fallout as US Government’s Go-To Bank",
    "description": "President Donald Trump’s campaign to cut spending at every level of the government is creating a series of headaches for its go-to banker: Citigroup Inc.",
    "link": "https://www.livemint.com/companies/news/citi-confronts-trump-doge-fallout-as-us-government-s-go-to-bank-11744027113201.html",
    "timestamp": "2025-04-07T11:58:32Z"
  },
  {
    "title": "No-one can stop Trump’s costly new tariffs except Trump himself",
    "description": "President Donald Trump unleashed a flurry of new, reciprocal tariffs at the end of last week, disrupting global trade norms and wreaking havoc on both US and global markets. In this Q&A, Thomas Gift analyzes the politics behind the new tariffs, whether they c…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/04/07/no-one-can-stop-trumps-costly-new-tariffs-except-trump-himself/",
    "timestamp": "2025-04-07T11:57:26Z"
  },
  {
    "title": "How Dangerous are Growing Tensions Between Israel and Egypt?",
    "description": "Israel and Egypt have exchanged accusations of breaching their historic peace treaty",
    "link": "https://www.newsweek.com/trump-hamas-egypt-israel-gaza-war-2056115",
    "timestamp": "2025-04-07T11:56:07Z"
  },
  {
    "title": "Indonesia wants fair and equal relationship with US, says President Prabowo",
    "description": "Indonesia wants a fair and equal relationship with the U.S., and will pursue diplomacy to address a 32% tariff rate imposed by the Trump administration, President Prabowo Subianto said on Monday. Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/07/indonesia-wants-fair-and-equal-relationship-with-us-says-president-prabowo",
    "timestamp": "2025-04-07T11:56:00Z"
  },
  {
    "title": "Tariffs wreak havoc on international markets – $9.5 trillion lost in three days",
    "description": "Analysts fear the worst as the market has yet to price in a full-blown trade war - Trump sticks to his guns despite warnings of a recession\nThe post Tariffs wreak havoc on international markets – $9.5 trillion lost in three days appeared first on ProtoThema E…",
    "link": "https://en.protothema.gr/2025/04/07/tariffs-wreak-havoc-on-international-markets-9-5-trillion-lost-in-three-days/",
    "timestamp": "2025-04-07T11:55:17Z"
  },
  {
    "title": "‘He profits when our economy implodes’: Trump’s commerce secretary under fire over market crash",
    "description": "Bill Ackman criticized US Commerce Secretary Howard Lutnick, accusing him of having a conflict of interest due to his former firm Cantor Fitzgerald's investment in long-term bonds. Ackman claimed Lutnick profits from the economy's struggles. He also warned th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-tariffs-recession-he-profits-when-our-economy-implodes-trumps-commerce-secretary-under-fire-over-market-crash/articleshow/120064586.cms",
    "timestamp": "2025-04-07T11:54:33Z"
  },
  {
    "title": "Things To Look For This Week",
    "description": "I like to subscribe to a number of magazines in solid, paper form. I read them mostly in the evenings with a cat on my lap, usually Jose. Sunday night I was reading the long article in the April 7 New Yorker about John Thune. Since the inauguration, the lag b…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/things-to-look-for-this-week",
    "timestamp": "2025-04-07T11:54:00Z"
  },
  {
    "title": "Ukraine updates: Kyiv wants to 'align' with US over minerals",
    "description": "Ukraine is sending a major delegation to Washington this week in an effort to get a mineral deal back on track. DW has the latest.",
    "link": "https://www.dw.com/en/ukraine-updates-kyiv-wants-to-align-with-us-over-minerals/live-72163772",
    "timestamp": "2025-04-07T11:52:00Z"
  },
  {
    "title": "Second US child dies of measles, almost 650 ill: officials",
    "description": "A measles outbreak has killed a second child in the southwestern United States, authorities said Sunday, with almost 650 people now infected as the highly contagious disease spreads. \"We are deeply saddened to report that a school-aged child who was recently …",
    "link": "https://www.rawstory.com/second-us-child-dies-of-measles-almost-650-ill-officials/",
    "timestamp": "2025-04-07T11:51:24Z"
  },
  {
    "title": "UK iCloud backdoor mandate hearing must be made public -- eventually",
    "description": "After a legal challenge by Apple, the hearing about blowing open Apple's iCloud encryption in the UK for the sake of national security won't be kept secret, but it's not clear when the details will be made public.iCloud security is on the lineAfter the hearin…",
    "link": "https://appleinsider.com/articles/25/04/07/uk-icloud-backdoor-mandate-hearing-must-be-made-public----eventually",
    "timestamp": "2025-04-07T11:50:19Z"
  },
  {
    "title": "Stocks, the economy, and the entire world order are at risk if Trump doubles down on tariffs, Deutsche Bank says",
    "description": "President Donald Trump's tariffs could have global implications, Deutsche Bank says.\nAndrew Harnik/Getty Images\nPresident Donald Trump's tariffs could have consequences for the current world order, Deutsche Bank said.\nThe bank's researchers said US stocks are…",
    "link": "https://biztoc.com/x/3024021d2b2775d0",
    "timestamp": "2025-04-07T11:50:15Z"
  },
  {
    "title": "Millions of people protested in Hands Off rallies on Saturday",
    "description": "Embed from Getty Images Update by CB: As many of you pointed out, the total number of protestors is estimated to be in the millions. The title has been edited to reflect this.",
    "link": "https://www.celebitchy.com/916863/millions_of_people_protested_in_hands_off_rallies_on_saturday/",
    "timestamp": "2025-04-07T11:50:03Z"
  },
  {
    "title": "European shares plunge as markets choke on Trump’s tariffs ‘medicine’",
    "description": "Iseq index down around 4% by noon as shares banks, food groups and homebuilders drop",
    "link": "https://www.irishtimes.com/business/2025/04/07/european-shares-plunge-as-markets-choke-on-trumps-tariffs-medicine/",
    "timestamp": "2025-04-07T11:49:08Z"
  },
  {
    "title": "How long will Trump’s tariffs last?",
    "description": "President Donald Trump told reporters last night that he doesn’t want stocks to go down but that “sometimes you have to take medicine to fix something.” A key matter is whether 10% across-the-board tariffs — and country-specific ones as high as 49% — are perm…",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/how-long-will-trumps-tariffs-last/",
    "timestamp": "2025-04-07T11:45:56Z"
  },
  {
    "title": "Not going to lose a trillion dollars for the privilege of buying pencils from China: Trump",
    "description": "WASHINGTON DC: US President Donald Trump made sharp remarks towards China as the US has implemented retaliatory tariffs with a goal of bridging the trade deficits with several countries. This has also impacted the stock markets. Making the remarks on board US…",
    "link": "https://english.khabarhub.com/2025/07/455946/",
    "timestamp": "2025-04-07T11:45:46Z"
  },
  {
    "title": "Donald Trump on starting a global crash: ‘Sometimes you have to take medicine’",
    "description": "The Asian markets were in turmoil last night, and the US stock futures plunged overnight. Last week, $5.4 trillion was wiped out in the market. Japan’s Nikkei fell 8% when it opened, and as I write this, economists know that today will be Black Monday when th…",
    "link": "https://www.celebitchy.com/916883/donald_trump_on_starting_a_global_crash_sometimes_you_have_to_take_medicine/",
    "timestamp": "2025-04-07T11:45:36Z"
  },
  {
    "title": "Panic Monday: World stock markets plunge again as Trump doubles down on tariffs",
    "description": "Global stock markets are extending a severe plunge, fueled by fears that U.S. tariffs will lead to a global economic slowdown. European and Asian shares saw dramatic losses Monday, the leading U.S. index flirted with bear market territory in pre-market tradin…",
    "link": "https://www.mlive.com/news/2025/04/panic-monday-world-stock-markets-plunge-again-as-trump-doubles-down-on-tariffs.html",
    "timestamp": "2025-04-07T11:45:26Z"
  },
  {
    "title": "Former Joe Rogan Guest Calls Out Podcaster, Sparks Backlash",
    "description": "Philosopher Sam Harris said that society is \"as politically shattered as it is\" in part because of how Rogan \"interacted\" with information.",
    "link": "https://www.newsweek.com/sam-harris-joe-rogan-politics-podcast-social-media-2056158",
    "timestamp": "2025-04-07T11:45:08Z"
  },
  {
    "title": "A US Tariff Idea That Makes Sense",
    "description": "US President Donald Trump’s “Liberation Day” tariffs were the culmination of a terrible first two months for his administration on the world stage. He badly needs a win, and a bipartisan Senate bill could give him one.",
    "link": "https://www.project-syndicate.org/commentary/lindsey-graham-richard-blumenthal-us-senate-bill-russian-oil-tariff-by-simon-johnson-2025-04",
    "timestamp": "2025-04-07T11:44:53Z"
  },
  {
    "title": "‘Billions of dollars’: Trump celebrates success as multi-day market plunge continues",
    "description": "President Donald Trump began Monday with a Truth Social post celebrating his tariff moves — as experts warned a chaotic multi-day market plunge was set to continue.Fears of an international trade war have sent markets spiraling since Trump announced Wednesday…",
    "link": "https://www.rawstory.com/trump-tariff-market/",
    "timestamp": "2025-04-07T11:44:36Z"
  },
  {
    "title": "Trump says China is 'biggest abuser of them all’ on tariffs, is ignoring his warnings ‘not to retaliate’",
    "description": "President Donald Trump called China the \"biggest abuser of them all\" when it comes to tariffs, adding Monday that Beijing is ignoring his warnings \"not to...",
    "link": "https://www.foxbusiness.com/economy/trump-says-china-biggest-abuser-them-all-tariffs-ignoring-his-warnings-not-retaliate",
    "timestamp": "2025-04-07T11:44:36Z"
  },
  {
    "title": "China Would Have Agreed TikTok Deal If Not For US Tariffs: Trump",
    "description": "US President Donald Trump said Sunday that China would have agreed to a deal on the sale of TikTok if it were not for the tariffs imposed by Washington on Beijing last week.",
    "link": "https://www.ibtimes.com.au/china-would-have-agreed-tiktok-deal-if-not-us-tariffs-trump-1857630",
    "timestamp": "2025-04-07T11:42:14Z"
  },
  {
    "title": "Netanyahu And Trump To Talk Tariffs, Iran And Gaza",
    "description": "Israeli Prime Minister Benjamin Netanyahu was in Washington on Monday to meet Donald Trump, whom he will likely ask for a reprieve from US tariffs while seeking further backing on Iran and Gaza.",
    "link": "https://www.ibtimes.com.au/netanyahu-trump-talk-tariffs-iran-gaza-1857627",
    "timestamp": "2025-04-07T11:42:12Z"
  },
  {
    "title": "Texans Warily Eye Impact Of Trump's Tariffs On Their Beloved Trucks",
    "description": "Fearing that US President Donald Trump's 25 percent tariffs on imported cars and auto parts could spark \"paranoia\" among buyers and drive up prices, Arthur Bibbs has decided to go ahead and buy a secondhand truck now.",
    "link": "https://www.ibtimes.com.au/texans-warily-eye-impact-trumps-tariffs-their-beloved-trucks-1857624",
    "timestamp": "2025-04-07T11:42:10Z"
  },
  {
    "title": "China Vows To Stay 'Safe And Promising Land' For Foreign Investment",
    "description": "A top Chinese official has vowed to protect US firms and pledged his country will remain a \"promising land\" for foreign investment, Beijing said Monday, after it slapped 34 percent tariffs on US imports.",
    "link": "https://www.ibtimes.com.au/china-vows-stay-safe-promising-land-foreign-investment-1857623",
    "timestamp": "2025-04-07T11:42:07Z"
  },
  {
    "title": "JPMorgan CEO Jamie Dimon says Trump tariffs will boost inflation, slow an already weakening U.S. economy",
    "description": "JPMorgan Chase CEO Jamie Dimon said Monday that tariffs announced by President Donald Trump last week will likely boost prices on both domestic and imported goods, weighing down a U.S. economy that had already been slowing.",
    "link": "https://www.nbcnews.com/politics/trump-administration/jpmorgan-ceo-jamie-dimon-says-trump-tariffs-will-boost-inflation-slow-rcna199956",
    "timestamp": "2025-04-07T11:41:54Z"
  },
  {
    "title": "Trump Trashes China for Ignoring His Warning Not To Retaliate Over Tariffs",
    "description": "Donald Trump has attacked China for not heeding his warning not to retaliate over tariffs.\nIn a post on his Truth Social platform on Monday morning, Trump called China \"the biggest abuser of all.\"\n\"They've made enough, for decades, taking advantage of the Goo…",
    "link": "https://biztoc.com/x/592b33a5ac0cd595",
    "timestamp": "2025-04-07T11:39:05Z"
  },
  {
    "title": "Stocks, the economy, and the entire world order are at risk if Trump doubles down on tariffs, Deutsche Bank says",
    "description": "Deutsche Bank's research team said US stocks could be hit hard if global trade unravels, and rang the alarm on growth, inflation, and unemployment.",
    "link": "https://www.businessinsider.com/trump-tariffs-stocks-economy-world-order-deutsche-bank-trade-war-2025-4",
    "timestamp": "2025-04-07T11:39:04Z"
  },
  {
    "title": "Iranian state media threatens to kill Trump...",
    "description": "CHILLING threats to kill Donald Trump have emerged in Iran’s propaganda newspaper after he threatened to bomb the regime “like never before”. Iran has placed its military troops o…",
    "link": "https://www.the-sun.com/news/13953096/kill-trump-iran-paper-ayatollah-donald-trump-attack/",
    "timestamp": "2025-04-07T11:37:37Z"
  },
  {
    "title": "If Congress Doesn’t Step In, Rogue Judges Will Trans The Military",
    "description": "Years could pass before the issue reaches the Supreme Court, which may or may not hand down a decision favoring the Trump policy. This puts the ball squarely in Congress’s court.",
    "link": "https://thefederalist.com/2025/04/07/if-congress-doesnt-step-in-rogue-judges-will-trans-the-military/",
    "timestamp": "2025-04-07T11:37:32Z"
  },
  {
    "title": "How State-Sanctioned Donor Doxxing Threatens The Pro-Life Movement",
    "description": "In many states, legislators have introduced bills to make advocacy organizations disclose their donors; the goal is silencing conservatives.",
    "link": "https://thefederalist.com/2025/04/07/how-state-sanctioned-donor-doxxing-threatens-the-pro-life-movement/",
    "timestamp": "2025-04-07T11:37:28Z"
  },
  {
    "title": "EU industry chief hopes bourbon will be spared in response to Trump tariffs",
    "description": "Stéphane Séjourné says he expected \"good news,\" which will provide succor for the French booze industry.",
    "link": "https://www.politico.eu/article/eu-industry-chief-stephane-sejourne-hopes-bourbon-spared-response-donald-trump-tariffs/",
    "timestamp": "2025-04-07T11:36:50Z"
  },
  {
    "title": "Trump calls his tariffs a ‘beautiful thing to behold’ amid stock selloffs",
    "description": "Facing mounting pressure over the economy, President Donald Trump is not backing down, calling his global tariffs a “beautiful thing to behold” and arguing he’s fulfilling a campaign promise to bring back American jobs. It comes as he draws new backlash for s…",
    "link": "https://www.today.com/video/trump-doubles-down-on-tariffs-calling-them-a-beautiful-thing-236692037559",
    "timestamp": "2025-04-07T11:35:54Z"
  },
  {
    "title": "SURVEY: 55% Of Self-Identified Leftists Say Killing Trump Is Justifiable",
    "description": "The more troubling trend is the rising violent rhetoric isn’t just coming from the 'fringe' left, it's being 'normalized' by the left.",
    "link": "https://thefederalist.com/2025/04/07/survey-55-of-self-identified-leftists-say-killing-trump-is-justifiable/",
    "timestamp": "2025-04-07T11:34:32Z"
  },
  {
    "title": "Ukraine's Kryvyi Rih mourns victims of Russian missile strike",
    "description": "KYIV, Ukraine (Reuters) - A central Ukrainian city held vigils on Monday starting three days of mourning for 11 adults and nine children killed by a Russian missile last week, as one of deadliest attacks on civilians in months jeopardised Washington's ceasefi…",
    "link": "https://www.thestar.com.my/news/world/2025/04/07/ukraine039s-kryvyi-rih-mourns-victims-of-russian-missile-strike",
    "timestamp": "2025-04-07T11:34:00Z"
  },
  {
    "title": "Trump Trashes China for Ignoring His Warning Not To Retaliate Over Tariffs",
    "description": "Trump attacked China for \"not acknowledging my warning for abusing countries not to retaliate\" over tariffs.",
    "link": "https://www.newsweek.com/trump-trashes-china-ignoring-his-warning-not-retaliate-over-tariffs-2056238",
    "timestamp": "2025-04-07T11:33:47Z"
  },
  {
    "title": "Apple Advised by Trump Administration to Keep TikTok on App Store",
    "description": "Apple has been advised by the Trump Administration to keep TikTok on the App Store for the time being.\nThe post Apple Advised by Trump Administration to Keep TikTok on App Store first appeared on iPhone in Canada Blog.",
    "link": "https://www.iphoneincanada.ca/2025/04/07/apple-advised-trump-administration-tiktok-app-store/",
    "timestamp": "2025-04-07T11:33:07Z"
  },
  {
    "title": "Quote of the Day",
    "description": "“I don’t think inflation’s gonna be a big deal.” — Donald Trump, talking to reporters.",
    "link": "https://politicalwire.com/2025/04/07/quote-of-the-day-4128/",
    "timestamp": "2025-04-07T11:31:00Z"
  },
  {
    "title": "Trump calls China 'biggest abuser' on tariffs",
    "description": "U.S. President Donald Trump criticized China as \"the biggest abuser of them all\" on tariffs, following Beijing's retaliation with a 34% tariff in response to similar U.S. measures. Posting on Truth Social, Trump expressed frustration that China ignored his wa…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-calls-china-biggest-abuser-on-tariffs/articleshow/120063677.cms",
    "timestamp": "2025-04-07T11:30:40Z"
  },
  {
    "title": "A first-of-its-kind survey reveals just how glued kids are to their phones",
    "description": "The latest episode of “The Poynter Report Podcast” is out today, part two of my conversation with Dr. Justin Martin from the University of South Florida. It’s a fascinating, first-of-its-kind […]\nThe post A first-of-its-kind survey reveals just how glued kids…",
    "link": "https://www.poynter.org/commentary/2025/kids-use-phones-social-media-four-hours-day/",
    "timestamp": "2025-04-07T11:30:39Z"
  },
  {
    "title": "President Trump Pushes Fed to Cut Rates, Says There Is ‘No Inflation’",
    "description": "Oil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, Trump said.",
    "link": "https://www.coindesk.com/markets/2025/04/07/president-trump-pushes-fed-to-cut-rates-says-there-is-no-inflation",
    "timestamp": "2025-04-07T11:30:14Z"
  }
]