[
  {
    "title": "DHS Halts ‘Family Reunification’ Parole for Seven Countries Over Fraud, Security Risks.",
    "description": "PULSE POINTS❓WHAT HAPPENED: The Trump administration is terminating “family reunification” (chain migration) parole (FRP) programs for immigrants from several nations and ending Temporary Protected Status (TPS) for Ethiopia.WHO WAS INVOLVED: The Department …",
    "link": "https://freerepublic.com/focus/f-bloggers/4357278/posts",
    "timestamp": "2025-12-14T01:48:45Z"
  },
  {
    "title": "Ex-Fox News host calls for Trump aide to be 'fired immediately' after president's screw up",
    "description": "Donald Trump released false information about an active shooter on Saturday, despite claiming to have been fully briefed on the matter, leading one prominent conservative to call for the \"immediate\" firing of the individual who provided the faulty information…",
    "link": "https://www.rawstory.com/trump-fired-immediately-aide-shooting/",
    "timestamp": "2025-12-14T01:35:15Z"
  },
  {
    "title": "Iowa National Guard soldiers killed in Syria",
    "description": "Iowa Gov. Kim Reynolds confirmed two Iowa National Guard soldiers were killed and three others were wounded in an attack in Syria on Saturday.",
    "link": "https://www.ketv.com/article/iowa-national-guard-soldiers-killed-in-syria/69718630",
    "timestamp": "2025-12-14T01:34:48Z"
  },
  {
    "title": "Netflix vs Paramount: The high-stakes battle for Warner Bros, explained in 5 charts",
    "description": "The fight between Netflix and Paramount Skydance to acquire Warner Bros could reshape both the streaming market and theatrical distribution—and it's turning political.",
    "link": "https://www.livemint.com/industry/media/netflix-warner-bros-acquisition-paramount-warner-bros-bid-11765546922564.html",
    "timestamp": "2025-12-14T01:30:33Z"
  },
  {
    "title": "7 highlights from Erika Kirk's CBS News town hall",
    "description": "Erika Kirk recalls the emotional fog of Charlie Kirk's assassination, addresses conspiracy theories and takes questions during a CBS News town hall hosted by Bari Weiss.",
    "link": "https://www.cbsnews.com/news/erika-kirk-cbs-news-town-hall-highlights/",
    "timestamp": "2025-12-14T01:30:07Z"
  },
  {
    "title": "‘This Is Just a Nightmare’ Mom of Brown University Student Shares Harrowing Story of Son Barricading Himself in Supply Closet With 12 Students",
    "description": "A mother of a Brown University student described the \"nightmare\" she was living through of having her son text he was hiding in a closet from a gunman on campus\nThe post ‘This Is Just a Nightmare’ Mom of Brown University Student Shares Harrowing Story of Son …",
    "link": "https://www.mediaite.com/media/this-is-just-a-nightmare-mom-of-brown-university-student-shares-harrowing-story-of-son-barricading-himself-in-supply-closet-with-12-students/",
    "timestamp": "2025-12-14T01:25:07Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,389",
    "description": "These are the key developments from day 1,389 of Russia's war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/12/14/russia-ukraine-war-list-of-key-events-day-1389",
    "timestamp": "2025-12-14T01:18:36Z"
  },
  {
    "title": "He was an Uber driver in the US. Now he's scared of jihadists after deportation to Somalia",
    "description": "As some Somali migrants fear what might happen next, the BBC speaks to one deportee in Mogadishu.",
    "link": "https://www.bbc.com/news/articles/cj38rj0y6k5o",
    "timestamp": "2025-12-14T01:05:53Z"
  },
  {
    "title": "Trump pledges retaliation after 3 Americans are killed in Syria attack that the US blames on IS",
    "description": "Two American soldiers and one civilian died in a Syrian attack. President Donald Trump vowed severe retaliation against the Islamic State group. The incident occurred near Palmyra. Syrian forces also sustained injuries. The United States has hundreds of troop…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-pledges-retaliation-after-3-americans-are-killed-in-syria-attack-that-the-us-blames-on-is/articleshow/125956530.cms",
    "timestamp": "2025-12-14T01:01:30Z"
  },
  {
    "title": "Jessica Tarlov Takes Charlie Hurt To Task For Lying About Inflation Rate Trump Inherited",
    "description": "These liars on Fox just repeat this stuff ad nauseam. It's about time one of them was finally corrected. \nDuring a discussion on this Friday's The Five about James Carville's ridiculous rant saying that Trump is \"done,\" and calling him a \"loser,\" as though hi…",
    "link": "https://crooksandliars.com/2025/12/jessica-tarlov-takes-charlie-hurt-task",
    "timestamp": "2025-12-14T01:00:01Z"
  },
  {
    "title": "Thousands of families without power after Russia attacks Ukraine's power grid",
    "description": "Five people were left wounded from the attack that Volodymyr Zelenskyy said consisted of more than 450 drones and 30 missiles.",
    "link": "https://www.abc.net.au/news/2025-12-14/russian-attack-ukraine-power-grid/106141006",
    "timestamp": "2025-12-14T00:57:58Z"
  },
  {
    "title": "WATCH: Trump calls deadly shooting at Brown University ‘a terrible thing’ and ‘a shame’",
    "description": "President Donald Trump said late Saturday afternoon that he had been briefed on the shooting at Brown University that killed at least two people and critically wounded eight.",
    "link": "https://biztoc.com/x/f11377ff58f61c2e",
    "timestamp": "2025-12-14T00:42:43Z"
  },
  {
    "title": "No. 22 Navy Executes Late to Earn Bragging Rights in Close Win vs. Army",
    "description": "For a second straight season, the Midshipmen found a way to beat the rival Black Knights to end the year winning the Commander-In-Chief's Trophy.",
    "link": "https://www.foxsports.com/stories/college-football/no-22-navy-executes-late-earn-bragging-rights-close-win-vs-army",
    "timestamp": "2025-12-14T00:40:23Z"
  },
  {
    "title": "Trump on deadly ISIS ambush in Syria: We will retaliate",
    "description": "Trump vows “very serious” retaliation after two US troops and a civilian were killed in an ISIS ambush in Syria. CENTCOM confirmed the attacker was eliminated.",
    "link": "https://www.israelnationalnews.com/news/419253",
    "timestamp": "2025-12-14T00:38:17Z"
  },
  {
    "title": "'A nightmare' - The battle over Warner Bros is turning Hollywood upside down",
    "description": "Interviews with dozens of actors, producers and camera crews reveal an industry attempting to weigh the lesser of two horrible choices.",
    "link": "https://www.bbc.com/news/articles/c8dyy47qy82o",
    "timestamp": "2025-12-14T00:37:15Z"
  },
  {
    "title": "FBI ousts reinstated whistleblower over unauthorized media talks, ‘poor judgment’",
    "description": "FBI agent and COVID-era whistleblower Steve Friend fired for 'unprofessional conduct' just months after being reinstated.",
    "link": "https://www.foxnews.com/politics/fbi-ousts-reinstated-whistleblower-over-unauthorized-media-talks-poor-judgment",
    "timestamp": "2025-12-14T00:36:39Z"
  },
  {
    "title": "Trump Responds to Brown University Shooting: ‘All We Can Do Right Now Is Pray’",
    "description": "President Donald Trump briefly met with reporters as he returned to the White House Saturday after the Army-Navy football game.\nThe post Trump Responds to Brown University Shooting: ‘All We Can Do Right Now Is Pray’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-responds-to-brown-university-shooting-all-we-can-do-right-now-is-pray/",
    "timestamp": "2025-12-14T00:36:35Z"
  },
  {
    "title": "WATCH: Trump calls deadly shooting at Brown University ‘a terrible thing’ and ‘a shame’",
    "description": "President Donald Trump said late Saturday afternoon that he had been briefed on the shooting at Brown University that killed at least two people and critically wounded eight.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-calls-deadly-shooting-at-brown-university-a-terrible-thing-and-a-shame",
    "timestamp": "2025-12-14T00:34:49Z"
  },
  {
    "title": "Brown University shooting: Attack at Rhode Island school leaves at least two dead, eight critically injured",
    "description": "Brown University shooting: Attack at Rhode Island school leaves at least two dead, eight critically injured7news.com.au",
    "link": "https://7news.com.au/news/brown-university-shooting-attack-at-rhode-island-school-leaves-multiple-people-injured-c-20997052",
    "timestamp": "2025-12-14T00:34:20Z"
  },
  {
    "title": "Blake Horvath’s fourth-quarter touchdown pass lifts Navy over Army in thriller",
    "description": "The Black Knights have not beaten a Navy team that was ranked by the AP since 1955.",
    "link": "https://nypost.com/2025/12/13/sports/blake-horvath-lifts-navy-over-army-in-thriller/",
    "timestamp": "2025-12-14T00:28:05Z"
  },
  {
    "title": "Russia and Ukraine trade attacks as U.S. and European officials prepare to resume peace talks",
    "description": "Moscow pounded Ukrainian power infrastructure with drone and missile strikes on Saturday and Kyiv launched a deadly strike of its own on southwestern Russia, a day before talks involving senior European and U.S. officials aimed at ending the war were set to r…",
    "link": "https://www.pbs.org/newshour/world/russia-and-ukraine-trade-attacks-as-u-s-and-european-officials-prepare-to-resume-peace-talks",
    "timestamp": "2025-12-14T00:25:00Z"
  },
  {
    "title": "Trump on Brown University shooting: What a terrible thing it is",
    "description": "[twitter:2167513]US President Donald Trump told reporters that he's been fully briefed about the deadly shooting at Brown University.\"What a terrible thing it is. And all we can do right now is pray for the victims,\" he said.",
    "link": "https://www.israelnationalnews.com/flashes/672284",
    "timestamp": "2025-12-14T00:20:41Z"
  },
  {
    "title": "Trump, 79, Brags About Tacky White House Signs During Army-Navy Game",
    "description": "President Donald Trump was in Baltimore on Saturday to attend the Army-Navy football game, but his attention seemed elsewhere. Soon after arriving at the M&T...",
    "link": "https://www.thedailybeast.com/trump-79-brags-about-tacky-white-house-signs-during-army-navy-game/",
    "timestamp": "2025-12-14T00:18:20Z"
  },
  {
    "title": "'Dastardly': Ex-GOP lawmaker says 'diehard MAGA' now believes 'hideous' Trump-Epstein link",
    "description": "Even the most \"die-hard\" MAGA supporter is now confident Donald Trump has strong connections with Jeffrey Epstein, according to a former GOP lawmaker.Former \"Tea Party\" Republican Rep. Denver Riggleman (VA), a Trump-skeptic Republican who helped assist the Ho…",
    "link": "https://www.rawstory.com/trump-epstein-2674397763/",
    "timestamp": "2025-12-14T00:15:28Z"
  },
  {
    "title": "Navy tops Army with late touchdown as Trump's attendance in Baltimore sparks protests",
    "description": "Navy edged Army in a dramatic win while President Donald Trump’s appearance drew protests throughout Baltimore, adding political friction to the storied Army-Navy matchup.",
    "link": "https://www.foxnews.com/sports/navy-tops-army-late-touchdown-trumps-attendance-baltimore-sparks-protests",
    "timestamp": "2025-12-14T00:06:57Z"
  },
  {
    "title": "JUST IN: Brown Shooting Suspect Still on the Loose After Killing 2 People",
    "description": "A gunman remains on the loose after killing two people and injuring eight others in an attack on Brown University's campus on Saturday evening, authorities said\nThe post JUST IN: Brown Shooting Suspect Still on the Loose After Killing 2 People first appeared …",
    "link": "https://www.mediaite.com/media/just-in-brown-shooting-suspect-still-on-the-loose-after-killing-2-people/",
    "timestamp": "2025-12-14T00:04:04Z"
  },
  {
    "title": "Abby Phillip Confronts Guest Who Claims ‘Certain Cultures’ Aren't 'Compatible' With U.S: ‘Which Ones?’",
    "description": "“This is not a race issue. This is a cultural issue,” the New York Post correspondent argued.",
    "link": "https://www.huffpost.com/entry/abby-phillip-lydia-moynihan-new-york-post-culture-compatible_n_693de65fe4b0f14dd5dd71d1",
    "timestamp": "2025-12-14T00:02:45Z"
  },
  {
    "title": "Two dead after shooting at Brown University in US - mayor",
    "description": "Two people have been killed and eight others were critically injured following a shooting at Brown University in the northeastern United States, Providence, Rhode Island Mayor Brett Smiley told a news conference.",
    "link": "https://www.rte.ie/news/us/2025/1214/1548920-brown-university-shooting/",
    "timestamp": "2025-12-14T00:01:20Z"
  },
  {
    "title": "Army football can't hold second-half lead, loses to Navy by a point",
    "description": "Army couldn't hold on to a 16-7 third-quarter lead, surrendering a go-ahead touchdown with 6:32 to play to lose by one.",
    "link": "https://www.recordonline.com/story/sports/college/2025/12/13/army-football-loses-to-navy-17-16-in-126th-meeting-score-result-stats/87663963007/",
    "timestamp": "2025-12-14T00:00:53Z"
  },
  {
    "title": "Venezuela’s Oil Future Hinges on U.S. Tensions and Possible Regime Shift",
    "description": "Escalating tensions between the United States and Venezuela could lead to profound changes in the oil industry of the world’s largest crude resource holder. Any regime change of President Nicolas Maduro could be a game-changer for oil production in Venezuela,…",
    "link": "https://oilprice.com/Energy/Energy-General/Venezuelas-Oil-Future-Hinges-on-US-Tensions-and-Possible-Regime-Shift.html",
    "timestamp": "2025-12-14T00:00:00Z"
  },
  {
    "title": "Don’t Go Wobbly on China",
    "description": "As the sun rises on a new Trump-era geopolitical chapter, Washington confronts a defining choice: Will America view the People’s Republic of China and its... Read More\nThe post Don’t Go Wobbly on China appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/12/13/dont-go-wobbly-on-china/",
    "timestamp": "2025-12-14T00:00:00Z"
  },
  {
    "title": "At least 2 people killed, 8 injured in shooting at Brown University in Rhode Island",
    "description": "A shooting in the engineering building at Brown University on the second day of final exams left at least two people dead and eight injured and in critical but stable condition Saturday, Providence's mayor said.",
    "link": "https://www.pbs.org/newshour/nation/at-least-2-people-killed-8-injured-in-shooting-at-brown-university-in-rhode-island",
    "timestamp": "2025-12-13T23:59:31Z"
  },
  {
    "title": "WATCH: Trump Receives Hero's Welcome at Army-Navy Game, Participates in Coin Toss",
    "description": "President Donald Trump received a hero's welcome at the Army-Navy football game at M&T Bank Stadium in Baltimore on Saturday, where he tossed the coin to decide the kickoff.\nThe post WATCH: Trump Receives Hero’s Welcome at Army-Navy Game, Participates in Coin…",
    "link": "https://www.breitbart.com/politics/2025/12/13/watch-trump-receives-heros-welcome-at-army-navy-game-participates-in-coin-toss/",
    "timestamp": "2025-12-13T23:58:31Z"
  },
  {
    "title": "Army-Navy is always a special day for America",
    "description": "The Black Knights and Midshipmen put on quite a show Saturday with Navy rallying for a 17-16 win.",
    "link": "https://www.thesportingtribune.com/2025/12/13/armynavycolumn-dec132025",
    "timestamp": "2025-12-13T23:55:18Z"
  },
  {
    "title": "My trip to Nigeria heartbreaking – US congressman, Moore",
    "description": "US Congressman Riley Moore describes his trip to Nigeria as heartbreaking after meeting victims of violent attacks in the country’s Middle Belt region.\n\nRead More: https://punchng.com/my-trip-to-nigeria-heartbreaking-us-congressman-moore/",
    "link": "https://punchng.com/my-trip-to-nigeria-heartbreaking-us-congressman-moore/",
    "timestamp": "2025-12-13T23:51:19Z"
  },
  {
    "title": "U.S., Mexico strike deal to settle Rio Grande water dispute",
    "description": "The US and Mexico agreed to end a dispute over water at the border with Texas, days after President Donald Trump vowed to impose additional tariffs.\nBoth governments agreed that Mexico will deliver an additional 202,000 acre-feet of water beginning the week o…",
    "link": "https://biztoc.com/x/9b4e482fc06d142c",
    "timestamp": "2025-12-13T23:46:43Z"
  },
  {
    "title": "Trump Responds to Reports of Shooting at Brown University: 'Suspect Is Not In Custody'",
    "description": "President Donald Trump responded to reports of a shooting at Brown University and clarified that the \"suspect is NOT in custody.\"\nThe post Trump Responds to Reports of Shooting at Brown University: ‘Suspect Is Not In Custody’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/12/13/trump-responds-to-reports-of-shooting-at-brown-university-suspect-is-not-in-custody/",
    "timestamp": "2025-12-13T23:45:04Z"
  },
  {
    "title": "Two US soldiers and an interpreter killed in suspected Islamic State attack in Syria",
    "description": "Dec 13 (Reuters) - Two U.S. Army soldiers and a civilian interpreter were killed in Syria on Saturday by a suspected Islamic State attacker who targeted a convoy of American and Syrian forces before being shot dead, the U.S. military said. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/14/two-us-soldiers-and-an-interpreter-killed-in-suspected-islamic-state-attack-in-syria",
    "timestamp": "2025-12-13T23:39:00Z"
  },
  {
    "title": "U.S., Mexico strike deal to settle Rio Grande water dispute",
    "description": "Both governments agreed that Mexico will deliver an additional 202,000 acre-feet of water beginning the week of Dec. 15 and finalize a broader distribution plan by the end of January.",
    "link": "https://fortune.com/2025/12/13/us-mexico-water-deal-rio-grande-dispute-texas/",
    "timestamp": "2025-12-13T23:38:37Z"
  },
  {
    "title": "'Please do not believe Trump': Students in 'chaos' as president spreads false shooter info",
    "description": "Donald Trump on Saturday was forced to issue a correction for his own public statement after the president falsely reported information about an active shooter, but the damage may have already been done, according to numerous observers.An active shooter was r…",
    "link": "https://www.rawstory.com/trump-risking-students-false-shooting/",
    "timestamp": "2025-12-13T23:36:35Z"
  },
  {
    "title": "'Multiple' people shot at Brown University - US official",
    "description": "Two people have been killed and eight others were critically injured following a shooting at Brown University in the northeastern United States, the mayor of Providence has said.",
    "link": "https://www.rte.ie/news/us/2025/1213/1548920-brown-university-shooting/",
    "timestamp": "2025-12-13T23:34:20Z"
  },
  {
    "title": "Trump Admin Sued For Putting Snoozy’s Face On Natl Parks Pass",
    "description": "The jokes write themselves. But a lawsuit brought by Center for Biological Diversity is not about how Trump’s ugly face desecrates something called “America the Beautiful.” No, this particular act of Trump narcissism allegedly violates the Federal Lands Recre…",
    "link": "https://crooksandliars.com/2025/12/trump-admin-sued-putting-snoozy-s-face",
    "timestamp": "2025-12-13T23:30:01Z"
  },
  {
    "title": "There’s Just One Problem With South Park’s 2025 Finale",
    "description": "Courtesy of South Park Studios\nSouth Park has come to an end this year with the final episode of Season 28, and there’s just one problem that’s stuck out about how it all ended. South Park has had a wild road through the year. After spending the first half of…",
    "link": "http://comicbook.com/tv-shows/feature/theres-just-one-problem-with-south-parks-2025-finale/",
    "timestamp": "2025-12-13T23:30:00Z"
  },
  {
    "title": "Jane Fonda Spoofs Nicole Kidman’s AMC Ad In The Wake Of WBD Merger News: “Somehow Corporate Greed Feels Good In A Place Like This”",
    "description": "Heartbreak does not feel good in a place like this. In the wake of the startling news of Netflix’s proposed acquisition of Warner Bros. Discovery (and Paramount’s hostile counter bid), Jane Fonda took to satire to convey her antitrust concerns. Spoofing Nicol…",
    "link": "http://deadline.com/2025/12/jane-fonda-nicole-kidman-amc-ad-wbd-netflix-paramount-1236647972/",
    "timestamp": "2025-12-13T23:17:23Z"
  },
  {
    "title": "Trump corrects himself after making false claim about active shooter",
    "description": "Donald Trump on Saturday was forced to issue a correction for his own public statement after the president falsely reported information about an active shooter.An active shooter was reported on this weekend at Brown University in Providence, Rhode Island, and…",
    "link": "https://www.rawstory.com/trump-shooting-correction/",
    "timestamp": "2025-12-13T23:15:42Z"
  },
  {
    "title": "Multiple victims reported in shooting at Brown University in Rhode Island",
    "description": "The reported shooting occurred near the Barus & Holley building, a seven-story complex that houses the university’s School of Engineering and physics department.",
    "link": "https://fortune.com/2025/12/13/brown-university-school-shooting-victims-suspect-custody/",
    "timestamp": "2025-12-13T23:14:20Z"
  },
  {
    "title": "Trump says Brown suspect in custody, then retracts",
    "description": "United States President Donald Trump said that a suspect in the shooting at Brown University is in custody, before correcting his statement, seemingly citing the university's emergency system, which a...",
    "link": "https://biztoc.com/x/e326f18e451ea644",
    "timestamp": "2025-12-13T23:13:39Z"
  },
  {
    "title": "Lukashenko frees Nobel winner Bialiatski and key Belarus opposition figures in deal with US",
    "description": "VILNIUS, Dec 13 (Reuters) - Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava in a deal brokered by an envoy for U.S. President Donald T…",
    "link": "https://freerepublic.com/focus/f-news/4357264/posts",
    "timestamp": "2025-12-13T23:13:26Z"
  },
  {
    "title": "Fighting rages on Thailand-Cambodia border despite Trump’s claimed ceasefire",
    "description": "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
    "link": "https://biztoc.com/x/151e92e7486d8f57",
    "timestamp": "2025-12-13T23:02:24Z"
  },
  {
    "title": "Brown University in US reports ‘active shooter’ situation on campus",
    "description": "Multiple people have been reported injured in a shooting near the Ivy League campus in Providence, Rhode Island.",
    "link": "https://www.aljazeera.com/news/2025/12/13/brown-university-in-us-reports-active-shooter-situation-on-campus",
    "timestamp": "2025-12-13T23:00:51Z"
  },
  {
    "title": "MULTIPLE VICTIMS",
    "description": "Police say multiple people have been shot in the area of Brown University in Providence, Rhode Island. The school has issued an active shooter alert and urged students and staff to take shelter Saturday, the second day of final exams. Police did not immediate…",
    "link": "https://apnews.com/article/brown-university-active-shooter-c7c9d1c7da19a76c2a27685c7e63d6da",
    "timestamp": "2025-12-13T23:00:15Z"
  },
  {
    "title": "Can money bury the truth?",
    "description": "Zionists are trying to buy their way out of international humiliation.  Read full story",
    "link": "https://www.thestar.com.my/opinion/columnists/all-the-pieces-matter/2025/12/14/can-money-bury-the-truth",
    "timestamp": "2025-12-13T23:00:00Z"
  },
  {
    "title": "LA Mayor Karen Bass launches re-election campaign",
    "description": "Los Angeles Mayor Karen Bass formally began her campaign for re-election on Saturday with a rally in downtown Los Angeles.",
    "link": "https://www.nbclosangeles.com/news/local/karen-bass-re-election-campaign/3815493/",
    "timestamp": "2025-12-13T22:55:53Z"
  },
  {
    "title": "Trump gushes about Stefanik after asserting neutrality in NY governor primary",
    "description": "The White House is denying President Trump’s gushing remarks about Rep. Elise Stefanik at an Oval Office event Friday are a new move toward a primary endorsement. Stefanik scored the prime position behind the president in an Oval Office photo op Friday, celeb…",
    "link": "https://nypost.com/2025/12/13/us-news/trump-gushes-about-stefanik-after-asserting-neutrality-in-ny-governor-primary/",
    "timestamp": "2025-12-13T22:54:43Z"
  },
  {
    "title": "3 Americans killed, 3 injured in Islamic State ambush attack in Palmyra, Syria",
    "description": "US Central Command announced that “two U.S. service members and one U.S. civilian were killed, and three service members were injured, as a result of an ambush by a lone [Islamic State] gunman in Syria.” Syrian government officials confirmed reports that said…",
    "link": "https://www.longwarjournal.org/archives/2025/12/3-americans-killed-3-injured-in-islamic-state-ambush-attack-in-palmyra-syria.php",
    "timestamp": "2025-12-13T22:43:45Z"
  },
  {
    "title": "President Donald Trump calls NIL ‘disaster,’ reiterates willingness to get involved",
    "description": "Speaking from the Oval Office on Friday while honoring the “Miracle on Ice” 1980 U.S. men’s hockey team, President Donald Trump called NIL a “disaster” in college sports. He also further signaled his willingness to get involved. Trump has been vocal about set…",
    "link": "https://www.on3.com/nil/news/president-donald-trump-calls-nil-disaster-reiterates-willingness-get-involved-college-sports/",
    "timestamp": "2025-12-13T22:41:15Z"
  },
  {
    "title": "Two students dead after shooting at Brown University in US",
    "description": "Officers carrying assault weapons and emergency vehicles line many of the streets surrounding the Ivy League school.",
    "link": "https://www.abc.net.au/news/2025-12-14/active-shooter-brown-university/106140822",
    "timestamp": "2025-12-13T22:40:07Z"
  },
  {
    "title": "Ex-GOP aide says MAGA caught in trap of its own making as Trump shows 'signs of old age'",
    "description": "Donald Trump is \"manifesting signs of old age\" and it is putting MAGA in a tough spot, according to a former GOP insider.Kurt Bardella, a former staffer for Republican Senator Olympia Snowe and Republican Congressman Darrell Issa, spoke to The Guardian for an…",
    "link": "https://www.rawstory.com/trump-old/",
    "timestamp": "2025-12-13T22:28:59Z"
  },
  {
    "title": "UK police won't investigate Andrew bodyguard claim",
    "description": "British media has reported that Andrew Mountbatten-Windsor asked his bodyguard to dig up dirt on his accuser Virginia Giuffre in 2011. Giuffre's family expressed disappointment over the police's decision.",
    "link": "https://www.dw.com/en/uk-police-wont-investigate-andrew-bodyguard-claim/a-75147968",
    "timestamp": "2025-12-13T22:25:00Z"
  },
  {
    "title": "Exclusive -- Pastor Doug Wilson: Senate Not Confirming Mark Walker as Religious Freedom Ambassador 'Inexplicable'",
    "description": "Pastor Doug Wilson, the Minister of Christ Church in Moscow, Idaho, described the Senate not moving to confirm former Rep. Mark Walker (R-NC) as President Donald Trump's Religious Freedom ambassador as being \"inexplicable,\" during an appearance on Breitbart N…",
    "link": "https://www.breitbart.com/politics/2025/12/13/exclusive-pastor-doug-wilson-senate-not-confirming-mark-walker-as-religious-freedom-ambassador-inexplicable/",
    "timestamp": "2025-12-13T22:24:02Z"
  },
  {
    "title": "Officials say suspect in custody after reports of active shooter at Brown University in Rhode Island",
    "description": "A shooter dressed in black killed at least two people and wounded nine others at Brown University on Saturday during final exams on the Ivy League campus, authorities said, and police were searching for the suspect.",
    "link": "https://www.wpxi.com/news/national/officials-say-suspect-custody-after-reports-active-shooter-brown-university-rhode-island/H57EMHIQVZFVVIKIIY73ITDKKA/",
    "timestamp": "2025-12-13T22:23:59Z"
  },
  {
    "title": "Belarus frees 123 prisoners as US lifts sanctions",
    "description": "Belarus has freed 123 prisoners, including prominent opposition activist Maria Kolesnikova and Nobel Peace Prize winner Ales Bialiatski, after the US agreed to lift sanctions on the country. Also on the programme, Cambodia has shut its border crossings with T…",
    "link": "https://www.bbc.co.uk/programmes/w172zssgqf8kypx",
    "timestamp": "2025-12-13T22:17:00Z"
  },
  {
    "title": "Detail In 1 New Epstein Estate Pic Makes CNN Anchor Pause: 'Can't Believe I Have To Read This'",
    "description": "Erin Burnett also addressed President Donald Trump's reaction to his appearance in the new batch of photos.",
    "link": "https://www.huffpost.com/entry/erin-burnett-epstein-trump-condoms_n_693db1a8e4b018dc36f34d70",
    "timestamp": "2025-12-13T22:15:03Z"
  },
  {
    "title": "Brown University shooting: Police say multiple people 'shot'",
    "description": "Police have confirmed that several people have been shot after reports of an active shooting situation in the Rhode Island-based university. Brown said the perpetrator was still at large.",
    "link": "https://www.dw.com/en/brown-university-shooting-police-say-multiple-people-shot/a-75148185",
    "timestamp": "2025-12-13T22:15:00Z"
  },
  {
    "title": "Trump’s Posts Spur Threats Against Lawmakers On Both Sides of Aisle",
    "description": "President Donald Trump’s Truth Social rants may be unhinged, but they have serious consequences: His violent rhetoric has spurred threats against nearly two dozen elected officials on both sides of the aisle.According to a new tally by NBC News, Trump’s posts…",
    "link": "https://newrepublic.com/post/204387/trump-violent-threats-lawmakers-republican-democrat",
    "timestamp": "2025-12-13T22:11:52Z"
  },
  {
    "title": "Trump’s No-Flip Coin Toss at Army-Navy Game Stuns Internet: ‘Looked Like a Space Alien Wholly Unfamiliar With the Concept’",
    "description": "President Donald Trump found a new way to get the internet to flip out on Saturday — by doing the ceremonial coin flip before the Army-Navy football game.\nThe post Trump’s No-Flip Coin Toss at Army-Navy Game Stuns Internet: ‘Looked Like a Space Alien Wholly U…",
    "link": "https://www.mediaite.com/media/news/trumps-no-flip-coin-toss-at-army-navy-game-stuns-internet-looked-like-a-space-alien-wholly-unfamiliar-with-the-concept/",
    "timestamp": "2025-12-13T22:05:40Z"
  },
  {
    "title": "Danish intelligence report warns of U.S. economic leverage and military threat under Trump",
    "description": "“China and Russia, together with other like-minded states, are seeking to reduce Western–and particularly US–global influence,\" the report said.",
    "link": "https://fortune.com/2025/12/13/danish-intelligence-report-us-economic-leverage-military-threat-trump/",
    "timestamp": "2025-12-13T22:05:21Z"
  },
  {
    "title": "Trump Threatens “Very Serious Retaliation” After Syria Attack",
    "description": "President Donald Trump raged against ISIS and said the U.S. would retaliate after an attack in Syria on Saturday, possibly laying the groundwork for more American military involvement in another country in the Middle East.Earlier in the day, a lone gunman sho…",
    "link": "https://newrepublic.com/post/204384/trump-isis-syria-military-attack",
    "timestamp": "2025-12-13T22:01:47Z"
  },
  {
    "title": "Active shooter situation reported at Brown University",
    "description": "Two people died after a shooting near the campus of Brown University in Providence, Rhode Island.",
    "link": "https://www.wcvb.com/article/active-shooter-brown-university-providence/69718002",
    "timestamp": "2025-12-13T22:00:25Z"
  },
  {
    "title": "Bill McKibben: “Trump … assault on environmental norms is more shrill than confident”",
    "description": "\"... When historians look back at 2025, ... the story they will tell is ... the U.S. ... surrendered ... primacy to its ... adversary ...\"",
    "link": "https://wattsupwiththat.com/2025/12/13/bill-mckibben-trump-assault-on-environmental-norms-is-more-shrill-than-confident/",
    "timestamp": "2025-12-13T22:00:00Z"
  },
  {
    "title": "Exclusive — Sen. Bill Cassidy: Democrats 'Aren't Serious' About Making Health Care Affordable, Unlike Trump",
    "description": "Sen. Bill Cassidy (R-LA) told Breitbart News in a written statement that Democrats \"aren't serious\" about lowering healthcare costs, unlike Republicans and President Donald Trump.\nThe post Exclusive — Sen. Bill Cassidy: Democrats ‘Aren’t Serious’ About Making…",
    "link": "https://www.breitbart.com/politics/2025/12/13/exclusive-sen-bill-cassidy-democrats-arent-serious-about-making-health-care-affordable-unlike-trump/",
    "timestamp": "2025-12-13T21:59:53Z"
  },
  {
    "title": "Fighting rages on Thailand-Cambodia border despite Trump’s claimed ceasefire",
    "description": "Fighting raged Saturday morning along the border of Thailand and Cambodia, even after U.S. President Donald Trump, acting as a mediator, declared that he had won agreement from both countries for a new ceasefire.",
    "link": "https://www.pbs.org/newshour/world/fighting-rages-on-thailand-cambodia-border-despite-trumps-claimed-ceasefire",
    "timestamp": "2025-12-13T21:57:02Z"
  },
  {
    "title": "Brown University reports active shooter",
    "description": "Brown University reported an active shooter on Saturday, with police saying multiple people were shot.",
    "link": "https://turnto10.com/news/local/brown-university-active-shooter-providence-rhode-island-december-13-2025",
    "timestamp": "2025-12-13T21:54:17Z"
  },
  {
    "title": "Trump vows retaliation after ISIS attack on US forces in Syria",
    "description": "An alleged ISIS gunman killed two US troops and an interpreter in a deadly attack in Palmyra, Syria. President Trump has vowed ‘very serious retaliation’.\n\nRead More: https://punchng.com/trump-vows-retaliation-after-isis-attack-on-us-forces-in-syria/",
    "link": "https://punchng.com/trump-vows-retaliation-after-isis-attack-on-us-forces-in-syria/",
    "timestamp": "2025-12-13T21:53:47Z"
  },
  {
    "title": "DHS proposal could force Israelis to share social media records",
    "description": "Israeli tourists could soon be required to show 5 years of social media history to enter the US.",
    "link": "https://www.israelnationalnews.com/news/419250",
    "timestamp": "2025-12-13T21:53:00Z"
  },
  {
    "title": "Reflections on Lecturing in Mexico",
    "description": "My first-ever visit to Mexico gave me some perspective on America's crucial neighbor.",
    "link": "https://reason.com/volokh/2025/12/13/reflections-on-lecturing-in-mexico/",
    "timestamp": "2025-12-13T21:51:29Z"
  },
  {
    "title": "Donald Trump's Army-Navy coin toss led to so many jokes",
    "description": "Fans had plenty of jokes about Donald Trump's coin toss at the Army-Navy game.",
    "link": "https://ftw.usatoday.com/story/sports/ncaaf/2025/12/13/donald-trump-coin-toss-army-navy/87753528007/",
    "timestamp": "2025-12-13T21:44:51Z"
  },
  {
    "title": "This holiday season isn’t very merry for consumers, a poll finds",
    "description": "The vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts in recent months, a new AP-NORC poll finds",
    "link": "https://www.bostonherald.com/2025/12/13/this-holiday-season-isnt-very-merry-for-consumers-a-poll-finds/",
    "timestamp": "2025-12-13T21:44:32Z"
  },
  {
    "title": "Donald Trump trends after failed Army-Navy coin toss",
    "description": "The Commander-in-Chief did his best.",
    "link": "https://www.sportingnews.com/us/ncaa-football/news/donald-trump-trends-after-failed-army-navy-coin-toss/f703cb6fb845d2dd0121485e",
    "timestamp": "2025-12-13T21:36:49Z"
  },
  {
    "title": "The Daily Caller’s Reagan Reese Joins Steve Bannon As Establishment Republicans Sabotage Trump Redistricting Efforts",
    "description": "Daily Caller's Reagan Reese joined Steve Bannon on \"War Room\" to discuss the Indiana Republicans killing a redistricting plan backed by President Trump.",
    "link": "https://dailycaller.com/2025/12/13/reagan-reese-steve-bannon-war-room-indiana-gop-redistricting-trump/",
    "timestamp": "2025-12-13T21:36:42Z"
  },
  {
    "title": "US, Nigeria near strategic security agreement on terrorism — Congressman",
    "description": "A US congressman reveals that America and Nigeria are close to a strategic security agreement to combat terrorism, including Boko Haram and sectarian viole\n\nRead More: https://punchng.com/us-nigeria-near-strategic-security-agreement-on-terrorism-congressman/",
    "link": "https://punchng.com/us-nigeria-near-strategic-security-agreement-on-terrorism-congressman/",
    "timestamp": "2025-12-13T21:25:42Z"
  },
  {
    "title": "M23 marches on in east Congo as U.S. vows action against Rwanda",
    "description": "The M23 pressed onwards in the eastern Democratic Republic of Congo on Saturday, even as Washington vowed action over its Rwandan backers' violation of a U.S.-brokered peace deal. Top U.S. diplomat Marco Rubio said Saturday that Rwanda had clearly breached th…",
    "link": "https://japantoday.com/category/world/m23-marches-on-in-east-dr-congo-as-us-vows-action-against-rwanda",
    "timestamp": "2025-12-13T21:24:26Z"
  },
  {
    "title": "Thailand vows to keep fighting Cambodia after Trump ceasefire claim",
    "description": "Thailand's leader vowed on Saturday to keep fighting on the disputed border with Cambodia as fighter jets struck targets hours after U.S. President Donald Trump said he had brokered ‌a new ceasefire. Caretaker Thai Prime Minister Anutin Charnvirakul said the …",
    "link": "https://japantoday.com/category/world/thailand-vows-to-keep-fighting-cambodia-after-trump-ceasefire-claim",
    "timestamp": "2025-12-13T21:24:04Z"
  },
  {
    "title": "Belarus frees Nobel winner Bialiatski and key opposition figures in deal with U.S.",
    "description": "Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday including Nobel Peace Prize winner Ales Bialiatski and leading opposition figure Maria Kalesnikava in a deal brokered by an envoy for U.S. President Donald Trump. In return, the U.S. ag…",
    "link": "https://japantoday.com/category/world/lukashenko-frees-nobel-winner-bialiatski-and-key-belarus-opposition-figures-in-deal-with-us2",
    "timestamp": "2025-12-13T21:23:44Z"
  },
  {
    "title": "Jake Tapper Rejects White House Reason For Trump's Bruises: 'There Is Something Going On'",
    "description": "White House press secretary Karoline Leavitt said Thursday that the president wears bandages on the back of his hand because he's “literally constantly shaking hands.”",
    "link": "https://www.huffpost.com/entry/jake-tapper-rejects-white-house-reason-for-trumps-bruises-there-is-something-going-on_n_693da9d5e4b0d58462bed2d3",
    "timestamp": "2025-12-13T21:23:19Z"
  },
  {
    "title": "Two U.S. soldiers and an interpreter killed in suspected Islamic State attack in Syria",
    "description": "Two U.S. Army soldiers and a civilian interpreter were killed in Syria on Saturday by a suspected Islamic State attacker ‌who targeted a convoy of American and Syrian forces before being shot dead, the U.S. military said. The attack was barely a month after S…",
    "link": "https://japantoday.com/category/world/two-us-soldiers-and-an-interpreter-killed-in-suspected-islamic-state-attack-in-syria1",
    "timestamp": "2025-12-13T21:23:14Z"
  },
  {
    "title": "Ukrainian drone attack kills 2 in Russia as over 1 million people in Ukraine lose power",
    "description": "A Ukrainian drone attack in southwestern Russia killed two people on Saturday as parts of Ukraine went without power following Russian assaults on energy infrastructure hours before peace talks were to restart in Germany. Ukrainian President Volodymyr Zelensk…",
    "link": "https://japantoday.com/category/world/2-people-killed-in-russia%E2%80%99s-saratov-region-as-peace-talks-press-on",
    "timestamp": "2025-12-13T21:22:56Z"
  },
  {
    "title": "Protests erupt outside Army-Navy game amid Trump's attendance",
    "description": "Protesters gathered in Baltimore as President Donald Trump attended the Army-Navy game, while two U.S. soldiers were killed in a Syria attack the same day.",
    "link": "https://www.foxnews.com/sports/protests-erupt-outside-army-navy-game-amid-trumps-attendance",
    "timestamp": "2025-12-13T21:20:48Z"
  },
  {
    "title": "Hayes on Indiana: 'They did choose a side, they rejected Trump and Vance'",
    "description": "Indiana's Republican-led Senate on Thursday rejected a new congressional map, breaking with President Donald Trump's push ...",
    "link": "https://biztoc.com/x/cf1862c57e1e195e",
    "timestamp": "2025-12-13T21:17:03Z"
  },
  {
    "title": "Analyst blows up Trump admin's new 'patently illegal' explanation for controversial move",
    "description": "Donald Trump's administration has a new \"explanation\" for a boat strike some have dubbed a war crime, but it doesn't \"survive scrutiny,\" according to a legal expert Saturday.Legal analyst Ryan Goodman over the weekend took apart the Department of Defense's re…",
    "link": "https://www.rawstory.com/boat-strike-trump-new-explanation/",
    "timestamp": "2025-12-13T21:16:22Z"
  },
  {
    "title": "MS NOW’s Legal Expert Incorrectly Claims Trump Picture ‘Suggests’ He Is With ‘Minors and/or Survivors’ of Jeffrey Epstein",
    "description": "MS NOW senior legal reporter Lisa Rubin was wrong when she said a new Trump photo \"suggests\" he was with \"minors and/or survivors\" of Jeffrey Epstein\nThe post MS NOW’s Legal Expert Incorrectly Claims Trump Picture ‘Suggests’ He Is With ‘Minors and/or Survivor…",
    "link": "https://www.mediaite.com/politics/trump/ms-nows-legal-expert-incorrectly-claims-trump-picture-suggests-he-is-with-minors-and-or-survivors-of-jeffrey-epstein/",
    "timestamp": "2025-12-13T21:10:16Z"
  },
  {
    "title": "US Fed dissenters flag need for more data, inflation risks",
    "description": "WASHINGTON: Two officials who voted against the Federal Reserve’s decision to lower interest rates again this week cited a need for more economic data and to...",
    "link": "https://kuwaittimes.com/article/37061/business/us-fed-dissenters-flag-need-for-more-data-inflation-risks/",
    "timestamp": "2025-12-13T21:00:42Z"
  },
  {
    "title": "Two Californians Are Eyeing a White House Run in 2028. Republicans Rejoice",
    "description": "WASHINGTON—Two California Democrats could run for president in 2028: Gov. Gavin Newsom and former Vice President Kamala Harris. Republican operatives must be thinking: Bring it... Read More\nThe post Two Californians Are Eyeing a White House Run in 2028. Repub…",
    "link": "https://www.dailysignal.com/2025/12/13/two-californians-are-eyeing-white-house-run-2028-republicans-rejoice/",
    "timestamp": "2025-12-13T21:00:00Z"
  },
  {
    "title": "Unreleased Epstein Photos Show People 'Engaged in Sexual Acts' and Victims in 'Compromising Positions,' Congressman Says",
    "description": "Rep. Suhas Subramanyam confirmed that sex acts are depicted, while Rep. Robert Garcia stated that \"some are very disturbing [images] of women and their...",
    "link": "https://people.com/unreleased-epstein-photos-sexual-acts-very-disturbing-images-of-women-congressmen-says-11868651",
    "timestamp": "2025-12-13T20:59:29Z"
  },
  {
    "title": "US envoy to meet Zelensky, Europe leaders in Berlin this weekend",
    "description": "US President Donald Trump’s special envoy will meet with Volodymyr Zelensky and other European leaders in Berlin this weekend, the White House said, as Washington presses for a plan to end Russia’s war with Ukraine. Ahead of the meetings, Zelensky warned on S…",
    "link": "https://www.digitaljournal.com/world/us-envoy-to-meet-zelensky-europe-leaders-in-berlin-this-weekend/article",
    "timestamp": "2025-12-13T20:57:20Z"
  },
  {
    "title": "Drone strike in southern Sudan kills 6 UN peacekeepers",
    "description": "Six United Nations peacekeepers from Bangladesh were killed on Saturday in a drone strike on Sudan’s southern Kordofan region, the UN mission said, with Dhaka sharply condemning the attack. The United Nations Interim Security Force for Abyei (UNISFA) said “si…",
    "link": "https://www.digitaljournal.com/world/drone-strike-in-southern-sudan-kills-6-un-peacekeepers/article",
    "timestamp": "2025-12-13T20:57:20Z"
  }
]