[
  {
    "title": "KALLAS COMPLAINS: Top EU Diplomat Gripes That US Is Not Paying for New Weapons for Ukraine, Thinks 50-Day Ultimatum for Russia ‘Is Too Long’",
    "description": "The new NATO initiative to arm Ukraine rubs Kallas wrong.\nThe post KALLAS COMPLAINS: Top EU Diplomat Gripes That US Is Not Paying for New Weapons for Ukraine, Thinks 50-Day Ultimatum for Russia ‘Is Too Long’ appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/07/kallas-complains-top-eu-diplomat-gripes-that-us/",
    "timestamp": "2025-07-16T14:15:47Z"
  },
  {
    "title": "Trump's controversial plan to fire federal workers finds favor with Supreme Court",
    "description": "The Supreme Court cleared the way for mass Education Department layoffs, bolstering President Donald Trump’s federal workforce cuts while legal battles continue.",
    "link": "https://www.foxnews.com/politics/trumps-controversial-plan-fire-federal-workers-finds-favor-supreme-court",
    "timestamp": "2025-07-16T14:15:35Z"
  },
  {
    "title": "The Award For Worst Idea Ever Made on Cable News Goes To…Greg Gutfeld",
    "description": "Greg Gutfeld said conservatives should reclaim the word Nazi like Black Americans did the N-word. It was a joke—but a reckless one with real consequences.\nThe post The Award For Worst Idea Ever Made on Cable News Goes To…Greg Gutfeld first appeared on Mediait…",
    "link": "https://www.mediaite.com/opinion/the-award-for-worst-idea-ever-made-on-cable-news-goes-togreg-gutfeld/",
    "timestamp": "2025-07-16T14:13:24Z"
  },
  {
    "title": "Hunter Biden blames Dems’ disloyalty to his father for their defeat",
    "description": "“We had the advantage of incumbency, we had the advantage of an incredibly successful administration, and the Democratic Party literally melted down,” the former first son said.",
    "link": "https://nypost.com/2025/07/16/us-news/hunter-biden-blames-dems-disloyalty-to-his-father-for-their-defeat/",
    "timestamp": "2025-07-16T14:12:59Z"
  },
  {
    "title": "SEO’s Next Era: Manick Bhan on AI, Content Strategy, and Building a Brand That Lasts",
    "description": "SEO’s Next Era: Manick Bhan on AI, Content Strategy, and Building a Brand That Lasts written by John Jantsch read more at Duct Tape Marketing\nListen to the full episode: Overview In this episode of the Duct Tape Marketing Podcast, John Jantsch interviews Mani…",
    "link": "https://ducttapemarketing.com/ai-seo-strategy-manick-bhan/",
    "timestamp": "2025-07-16T14:12:13Z"
  },
  {
    "title": "GrabAGun Digital Holdings Inc (PEW) crashes 19% on NYSE debut despite Donald Trump Jr. hype — what went wrong and is there a bounce ahead?",
    "description": "GrabAGun Digital Holdings Inc stock (PEW) made a dramatic entrance on the NYSE, catching attention with Donald Trump Jr. ringing the opening bell. But the hype turned fast as the stock tumbled nearly 19% on its debut day, falling to $17.33. Backed by a $179 m…",
    "link": "https://economictimes.indiatimes.com/news/international/us/grabagun-digital-holdings-inc-pew-crashes-19-on-nyse-debut-despite-donald-trump-jr-hype-what-went-wrong-and-is-there-a-bounce-ahead/articleshow/122578321.cms",
    "timestamp": "2025-07-16T14:10:47Z"
  },
  {
    "title": "Trump Slams Supporters for Believing Jeffrey Epstein 'Bulls***'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump has lashed out at Republicans who have criticized the Justice Department's decision to close the Epstein case without releasing a client list or further evidence.\nBlaming \"Radical Left Democrats,\"…",
    "link": "https://biztoc.com/x/7f53de3eb5aed959",
    "timestamp": "2025-07-16T14:10:26Z"
  },
  {
    "title": "Donald Trump reaps US$50 billion tariff haul as world ‘chickens out’",
    "description": "U.S. trading partners have failed to retaliate against Donald Trump's tariffs, allowing him to raise US$50 billion in revenue. Read more.",
    "link": "https://financialpost.com/financial-times/donald-trump-tariff-world-chickens-out",
    "timestamp": "2025-07-16T14:10:11Z"
  },
  {
    "title": "Zelensky urges Trump to revisit Ukrainian missile proposal",
    "description": "Ukraine’s first request to host nuclear-capable Tomahawks was rejected under the Biden administration Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621571-zelensky-trump-missiles-ukraine/",
    "timestamp": "2025-07-16T14:09:36Z"
  },
  {
    "title": "‘I’m Taking A Certain Win’: CNN Airs Segment About Family That Self-Deported To Mexico Under Trump",
    "description": "CNN on Tuesday aired a segment of a family that chose to self-deport to Mexico from Pittsburgh, Pennsylvania under Donald Trump's second administration.",
    "link": "https://dailycaller.com/2025/07/16/cnn-airs-segment-family-that-self-deported-mexico-trump/",
    "timestamp": "2025-07-16T14:06:49Z"
  },
  {
    "title": "Trump Slams Supporters for Believing Jeffrey Epstein 'Bulls***'",
    "description": "Trump has hit out at his \"past\" supporters who criticized the Justice Department's decision to close the Epstein case.",
    "link": "https://www.newsweek.com/trump-slams-supporters-believing-jeffrey-epstein-bulls-2099697",
    "timestamp": "2025-07-16T14:05:24Z"
  },
  {
    "title": "Selected Articles: Fidel Castro’s Message against Nuclear War: “In a nuclear war, the ‘collateral damage’ would be the life of all humanity.”",
    "description": "Fidel Castro’s Message against Nuclear War: “In a nuclear war, the ‘collateral damage’ would be the life of all humanity.”\nBy Fidel Castro Ruz, July 16, 2025\nThe use of nuclear weapons in a new war would mean the …\nThe post Selected Articles: Fidel Castro’s M…",
    "link": "https://www.globalresearch.ca/selected-articles-fidel-castro-message-against-nuclear-war/5895208",
    "timestamp": "2025-07-16T14:05:05Z"
  },
  {
    "title": "Japan decries China threat after string of risky encounters",
    "description": "Japan's defense officials have warned China's intensifying military activities could \"seriously impact\" its security, while also using their annual white paper to highlight the growing alliance of North Korea and Russia.",
    "link": "https://www.dw.com/en/japan-decries-china-threat-after-string-of-risky-encounters/a-73296532",
    "timestamp": "2025-07-16T14:05:00Z"
  },
  {
    "title": "Trump Says He Doesn’t Understand Interest In ‘Boring’ Epstein Files: Here’s A Timeline Of Events",
    "description": "The president asked his supporters to “let Pam Bondi do her job” as she faces scrutiny over handling the release of documents related to the disgraced financier.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/16/trump-says-he-doesnt-understand-interest-in-boring-epstein-files-heres-a-timeline-of-events/",
    "timestamp": "2025-07-16T14:04:15Z"
  },
  {
    "title": "How Trump could use a building renovation to oust Fed Chair Powell",
    "description": "President Donald Trump says he's found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, accusing him of mismanaging the U.S. central bank’s $2.5 billion renovation project.",
    "link": "https://www.news4jax.com/news/politics/2025/07/16/how-trump-could-use-a-building-renovation-to-oust-the-fed-chair/",
    "timestamp": "2025-07-16T14:00:57Z"
  },
  {
    "title": "EXCLUSIVE: Conservative groups urging Trump admin to expose anti-Christian ‘pattern’ in Biden FBI",
    "description": "A coalition of conservative groups is urging the Trump DOJ and FBI to release documents about the “pattern of dishonesty and religious discrimination\" under the Biden FBI.",
    "link": "https://www.foxnews.com/politics/exclusive-conservative-groups-urging-trump-admin-expose-anti-christian-pattern-biden-fbi",
    "timestamp": "2025-07-16T14:00:28Z"
  },
  {
    "title": "Russian bombardment targets Zelenskyy's hometown, injuring at least 15 people",
    "description": "Russia has pounded four Ukrainian cities, injuring at least 15 people in an attack that mostly targeted energy infrastructure, officials said.",
    "link": "https://www.abc.net.au/news/2025-07-17/russian-drone-attack-injures-at-least-15-ahead-of-trump-deadline/105540158",
    "timestamp": "2025-07-16T14:00:02Z"
  },
  {
    "title": "Thom Tillis isn't mad — but he is prepared to tangle with the 'disrespectful' (Burgess Everett/Semafor)",
    "description": "Burgess Everett / Semafor:\nThom Tillis isn't mad — but he is prepared to tangle with the ‘disrespectful’  —  Thom Tillis isn't in rebellion mode against President Donald Trump or Republican leadership.  He's simply making clear that he won't tolerate disrespe…",
    "link": "https://www.memeorandum.com/250716/p53",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Why Donald Trump is facing doubts in the 'manosphere' (Steve Contorno/CNN)",
    "description": "Steve Contorno / CNN:\nWhy Donald Trump is facing doubts in the ‘manosphere’  —  Justin Centers fits the profile of many younger men who helped power Donald Trump's political comeback last fall.  —  He's a 21-year-old autoworker from the Detroit suburbs and wa…",
    "link": "https://www.memeorandum.com/250716/p52",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Heather Cox Richardson: Everything You Need to Know About Immigration Law",
    "description": "Before he was elected President, John F. Kennedy published a book titled “A Nation of Immigrants.” He celebrated the fact that his family was descended from Irish immigrants, and almost every one else (excluding native Americans) was descended from immigrants…",
    "link": "https://dianeravitch.net/2025/07/16/heather-cox-richardson-everything-you-need-to-know-about-immigration-law/",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "Live Around the Planet: Wednesday July 16th",
    "description": "UPPESTDATE! If you missed today's edition of Mark's Clubland Q&A live around the planet, here's the action replay. UPPERDATE! We're live now, so let's have at it! UPDATE! We'll be going live in about fifteen minutes, so do get ready to fire off your",
    "link": "https://www.steynonline.com/15452/live-around-the-planet-wednesday-july-16th",
    "timestamp": "2025-07-16T14:00:00Z"
  },
  {
    "title": "WATCH: Victor Davis Hanson predicts what ‘egomaniac, narcissistic’ judges will try next to sabotage Trump",
    "description": "'They think that they can run the country. I don't know how they would enforce it. They're not federal law enforcement'",
    "link": "https://www.wnd.com/2025/07/watch-victor-davis-hanson-predicts-what-egomaniac-narcissistic/",
    "timestamp": "2025-07-16T13:58:57Z"
  },
  {
    "title": "How Donald Trump's Plan to Arm Ukraine Differs From Joe Biden's",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's push for European NATO members to purchase U.S.-made weapons for Ukraine marks a shift from the more direct military support for Kyiv of his predecessor, Joe Biden.\nBut unlike Biden, T…",
    "link": "https://biztoc.com/x/06df5e58e94f74d7",
    "timestamp": "2025-07-16T13:58:48Z"
  },
  {
    "title": "Trump Melts Down Over Epstein ‘Hoax,’ Slams Supporters Who Believe ‘This Bullsh*t’: ‘I Don’t Want Their Support Anymore!’",
    "description": "Trump, in a stunning social media post, branded the Epstein story a \"hoax\" and said he doesn't want the support of those who \"bought into this bullsh*t.\"\nThe post Trump Melts Down Over Epstein ‘Hoax,’ Slams Supporters Who Believe ‘This Bullsh*t’: ‘I Don’t Wan…",
    "link": "https://www.mediaite.com/media/news/trump-melts-down-over-epstein-hoax-slams-supporters-who-believe-this-bullsht-i-dont-want-their-support-anymore/",
    "timestamp": "2025-07-16T13:57:29Z"
  },
  {
    "title": "US deports ‘uniquely barbaric’ migrants to third country in Africa",
    "description": "The Homeland Security Department has stated that it deported five men to Eswatini to ensure they never harm another American Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/621569-us-barbaric-migrants-africa-deportations/",
    "timestamp": "2025-07-16T13:55:58Z"
  },
  {
    "title": "Donald Trump’s “Soonism” and the Death of Diplomacy",
    "description": "On July 9, weighing in on the never-ending tragedy his guest at the White House has been indicted by the International Criminal Court for initiating and pursuing, US President Donald Trump waxed sanguine about an imminent resolution to a nearly eighty-year-ol…",
    "link": "https://www.fairobserver.com/devils-dictionary/donald-trumps-soonism-and-the-death-of-diplomacy/",
    "timestamp": "2025-07-16T13:55:49Z"
  },
  {
    "title": "‘Really Dangerous For Trump!’ Matt Lewis, Jim Acosta Say Trump’s Hold on Joe Rogan Crowd Imperiled Over Epstein",
    "description": "Matt Lewis told Jim Acosta that President Donald Trump's hold on the Joe Rogan \"Manosphere\" is in danger over the backlash from the \"Epstein Files\" flap.\nThe post ‘Really Dangerous For Trump!’ Matt Lewis, Jim Acosta Say Trump’s Hold on Joe Rogan Crowd Imperil…",
    "link": "https://www.mediaite.com/media/podcasts/really-dangerous-for-trump-matt-lewis-jim-acosta-say-trumps-hold-on-joe-rogan-crowd-imperiled-over-epstein/",
    "timestamp": "2025-07-16T13:55:27Z"
  },
  {
    "title": "The Supreme Court Just Crowned Trump King—Again",
    "description": "Elie Mystal\n\n\n\nIn ruling the president can decimate the Department of Education, the court took a key congressional power—and gave it to Trump.\r\n\n\r\n\n\nThe post The Supreme Court Just Crowned Trump King—Again appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/supreme-court-department-of-education/",
    "timestamp": "2025-07-16T13:54:56Z"
  },
  {
    "title": "Trump’s Ukraine Shift Sends the Right Signal to Putin",
    "description": "But there won’t be peace without additional pressure on the Kremlin.",
    "link": "http://foreignpolicy.com/2025/07/16/trump-ukraine-russia-weapons-putin-war-peace-europe-nato/",
    "timestamp": "2025-07-16T13:54:21Z"
  },
  {
    "title": "How Donald Trump's Plan to Arm Ukraine Differs From Joe Biden's",
    "description": "Trump has put the onus on NATO members to arm Ukraine without the American taxpayer footing the bill.",
    "link": "https://www.newsweek.com/trump-biden-plans-arm-ukraine-compared-2099165",
    "timestamp": "2025-07-16T13:53:31Z"
  },
  {
    "title": "Bank of England Governor Doubts the UK Needs a 'Britcoin' CBDC",
    "description": "BoE Governor Bailey casts doubt on digital pound necessity, warns against stablecoins undermining fiat currencies.",
    "link": "https://decrypt.co/330374/bank-of-england-unconvinced-britcoin-cbdc",
    "timestamp": "2025-07-16T13:53:15Z"
  },
  {
    "title": "Trump's Turnberry faces logistical hurdles for British Open return",
    "description": "President Donald Trump is not getting a British Open to the Turnberry course he owns in the near future, an issue the R&A's new chief executive said Wednesday was more about transportation than politics. Turnberry is regarded as the most beautiful of the link…",
    "link": "https://sports.yahoo.com/article/trumps-turnberry-faces-logistical-hurdles-135037266.html",
    "timestamp": "2025-07-16T13:50:37Z"
  },
  {
    "title": "Trump boxes in Fed with extreme rate cut calls",
    "description": "While almost no one thinks U.S. President Donald Trump’s verbal attacks on Federal Reserve Chair Jerome Powell are a positive development, they have electrified the debate about whether the President is right that interest rates are too high.\nPresidential tir…",
    "link": "https://biztoc.com/x/145d26492bc60676",
    "timestamp": "2025-07-16T13:47:42Z"
  },
  {
    "title": "GENIUS Act update: What’s happening with the stablecoin crypto vote?",
    "description": "It looks like the GENIUS Act might advance through the U.S. House of Representatives after all, following some arm-twisting from President Donald Trump. \nOn Tuesday, the cryptocurrency legislation looked dead in the water, with 223 lawmakers voting against mo…",
    "link": "https://biztoc.com/x/f69d49646c61e8b1",
    "timestamp": "2025-07-16T13:47:39Z"
  },
  {
    "title": "California’s wind and solar projects face new federal hurdles",
    "description": "By Alejandro Lazo, CalMatters\nCalifornia’s drive to run its electric grid entirely on wind, solar and other clean sources of energy just got harder after President Donald Trump signed a sweeping new budget law.\nThe changes in federal tax incentives could affe…",
    "link": "https://biztoc.com/x/e45711bde605d396",
    "timestamp": "2025-07-16T13:47:34Z"
  },
  {
    "title": "Iran-US Negotiations Should Not Be Held Without Preconditions - Parliament",
    "description": "TEHRAN (Sputnik) - New negotiations between Iran and the US should not be held until the American side fully implements the preliminary conditions set by Tehran, the Iranian Majlis (parliament) stated on Wednesday.",
    "link": "https://sputnikglobe.com/20250716/iran-us-negotiations-should-not-be-held-without-preconditions---parliament-1122448281.html",
    "timestamp": "2025-07-16T13:47:28Z"
  },
  {
    "title": "Former Biden adviser admits failure to address border crisis reality led to Trump's re-election",
    "description": "Former Homeland Security assistant secretary Blas Nuñez-Neto outlined what he thought went wrong with immigration reform under the Biden administration.",
    "link": "https://www.foxnews.com/media/former-biden-adviser-admits-failure-address-border-crisis-reality-led-trumps-re-election",
    "timestamp": "2025-07-16T13:46:40Z"
  },
  {
    "title": "Justice Department Files Complaint Against Former Members of the Corporation for Public Broadcasting",
    "description": "WASHINGTON – Today, the Justice Department filed a complaint in the U.S. District Court of Washington, D.C. against three former members of the Corporation for Public Broadcasting for refusing to vacate their offices after being removed by President Donald J.…",
    "link": "https://freerepublic.com/focus/f-chat/4328960/posts",
    "timestamp": "2025-07-16T13:45:42Z"
  },
  {
    "title": "Trump escalates attacks on Adam Schiff, accuses Democratic senator of criminal fraud",
    "description": "The authoritarian-style vision is unsubtle: Donald Trump hates Adam Schiff, so he's been referred to the Justice Department for possible criminal prosecution.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-escalates-attacks-adam-schiff-accuses-democratic-senator-crimina-rcna219062",
    "timestamp": "2025-07-16T13:42:54Z"
  },
  {
    "title": "Cracks in most powerful alliance? France, Italy break ranks — refuse to join US-led NATO arms deal for Ukraine",
    "description": "France and Italy will not join the new NATO arms plan for Ukraine. They prefer to boost their own defense industries. Italy will consider logistical support for US weapons. Poland suggests using Russia's frozen assets to pay for arms. Germany supports the pla…",
    "link": "https://economictimes.indiatimes.com/news/international/us/cracks-in-most-powerful-alliance-france-italy-break-ranks-refuse-to-join-us-led-nato-arms-deal-for-ukraine-nato-news/articleshow/122577185.cms",
    "timestamp": "2025-07-16T13:42:45Z"
  },
  {
    "title": "US producer prices unchanged with wholesale inflation remaining under control",
    "description": "U.S. wholesale inflation cooled last month, despite worries that President Donald Trump’s tariffs would push prices higher",
    "link": "https://abcnews.go.com/Business/wireStory/us-producer-prices-unchanged-wholesale-inflation-remaining-control-123796338",
    "timestamp": "2025-07-16T13:42:27Z"
  },
  {
    "title": "R&A 'really optimistic' about hosting Open in Dublin",
    "description": "The R&A are \"really optimistic\" about the prospect of holding the Open Championship in Portmarnock, according to chief executive Mark Darbon, with a decision to be made near the end of 2025",
    "link": "https://www.rte.ie/sport/golf/2025/0716/1523829-ra-really-optimistic-about-hosting-open-in-dublin/",
    "timestamp": "2025-07-16T13:41:38Z"
  },
  {
    "title": "Column: Of fighting and surviving, ‘Baddest Man’ is a soaring biography of Mike Tyson",
    "description": "“Baddest Man: The Making of Mike Tyson,” moves from the boxer’s birth in 1966 to 1988.",
    "link": "https://www.bostonherald.com/2025/07/16/baddest-man-mike-tyson/",
    "timestamp": "2025-07-16T13:40:57Z"
  },
  {
    "title": "Inflation Rises, Tariffs to Blame",
    "description": "Up until June, inflation had been on the decline. But the president's tariffs are having the effect that economists said they would.",
    "link": "https://reason.com/2025/07/16/inflation-rises-tariffs-to-blame/",
    "timestamp": "2025-07-16T13:39:47Z"
  },
  {
    "title": "US senators exempt HIV/Aids funding from planned spending cuts",
    "description": "While advancing a bill to claw back $9bn in federal spending, lawmakers spare the Pepfar programme from cuts.",
    "link": "https://www.bbc.com/news/articles/c0q8ypew5l0o",
    "timestamp": "2025-07-16T13:38:18Z"
  },
  {
    "title": "US senators exempt HIV/Aids funding from planned spending cuts",
    "description": "While advancing a bill to claw back $9bn in federal spending, lawmakers spare the Pepfar programme from cuts.",
    "link": "https://www.bbc.co.uk/news/articles/c0q8ypew5l0o",
    "timestamp": "2025-07-16T13:38:18Z"
  },
  {
    "title": "Trump hints at Indonesia-style trade pact with India; experts warn of one-sided terms",
    "description": "Donald Trump says the India trade deal will mirror the US-Indonesia pact. India and US are negotiating a trade agreement. The fifth round of negotiations are underway in Washington. India seeks easing of tariffs on steel, aluminium and auto sectors. The US wa…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-hints-at-indonesia-style-trade-pact-with-india-experts-warn-of-one-sided-terms/articleshow/122578009.cms",
    "timestamp": "2025-07-16T13:38:11Z"
  },
  {
    "title": "RFK Jr. fires top aides in HHS shakeup...",
    "description": "US Health and Human Services Secretary Robert F. Kennedy Jr. has fired two of his top aides in an abrupt shakeup of the leadership at the nation’s sprawling health department, two people familiar with the matter told CNN.",
    "link": "https://www.cnn.com/2025/07/16/health/rfk-hhs-aides-fired",
    "timestamp": "2025-07-16T13:37:37Z"
  },
  {
    "title": "Trump to sign legislation cracking down on illicit fentanyl | CNN Politics",
    "description": "President Donald Trump will host congressional leaders and families affected by the fentanyl epidemic on Wednesday for a signing ceremony on bipartisan legislation that would strengthen prison sentences for fentanyl traffickers, White House officials tell CNN.",
    "link": "https://www.cnn.com/2025/07/16/politics/fentanyl-trump-legislation",
    "timestamp": "2025-07-16T13:37:20Z"
  },
  {
    "title": "Trump Cuts Deal To End Republican Revolt On Crypto Bills",
    "description": "Trump Cuts Deal To End Republican Revolt On Crypto Bills\n \nAuthored by Stephen Katte via CoinTelegraph.com,\nUS President Donald Trump says he has convinced most of the Republican lawmakers who pulled support from three crypto bills to vote in favor of them wh…",
    "link": "https://biztoc.com/x/c29fe3241c51df94",
    "timestamp": "2025-07-16T13:36:43Z"
  },
  {
    "title": "Scott Jennings Sends Tiffany Cross Into Tizzy When He Calls Out Her ‘Concentration Camps’ Rhetoric",
    "description": "Former MSNBC host Tiffany Cross melted down when Republican strategist Scott Jennings questioned her use of the term “concentration camps” Tuesday night.",
    "link": "https://dailycaller.com/2025/07/16/scott-jennings-sends-tiffany-cross-into-tizzy/",
    "timestamp": "2025-07-16T13:36:37Z"
  },
  {
    "title": "WLF investor Aqua1 offers few answers to alleged Web3Port ties",
    "description": "World Liberty Financial investor Aqua1’s response to journalist Jacob Silverman skirts the central issue: is the firm truly unrelated to Web3Port?",
    "link": "https://cointelegraph.com/news/wlf-investor-aqua1-offers-few-answers-web3port",
    "timestamp": "2025-07-16T13:36:33Z"
  },
  {
    "title": "Trump accused of ‘slowly losing it’ as latest signs of ‘dementia’ unravel sparking health worries - NewsBreak",
    "description": "The president forgot names, showed confusion over who was with him at the event, and appeared to fabricate stories that could not possibly be true",
    "link": "https://www.newsbreak.com/share/4111006214288-trump-accused-of-slowly-losing-it-as-latest-signs-of-dementia-unravel-sparking-health-worries?_f=app_share&amp;pd=0FHVIyyc&amp;lang=en_US&amp;send_time=1752672885&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.28.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v4%2Cns_foryou_blend_exp_25q2-v1%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v7&amp;s=i2",
    "timestamp": "2025-07-16T13:35:15Z"
  },
  {
    "title": "Defend the Taxpayer. Pass the Rescissions.",
    "description": "For far too long, both parties have allowed waste, fraud, and abuse to fester in nearly every corner of the federal budget while hardworking Americans... Read More\nThe post Defend the Taxpayer. Pass the Rescissions. appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/16/defend-the-taxpayer-pass-the-rescissions/",
    "timestamp": "2025-07-16T13:35:00Z"
  },
  {
    "title": "A look inside a lab making the advanced fuel to power growing US nuclear energy ambitions",
    "description": "At Oak Ridge National Laboratory in Tennessee, a half-dozen workers are making what appear to be gray billiard balls",
    "link": "https://abcnews.go.com/Technology/wireStory/inside-lab-making-advanced-fuel-power-growing-us-123797191",
    "timestamp": "2025-07-16T13:34:37Z"
  },
  {
    "title": "The New American Engine: Trump's $100B AI-Energy Blitz Begins A National Transformation",
    "description": "As construction begins and the first permits are filed, it remains to be seen whether this AI-energy fusion can deliver on its promise. But one thing is certain: the race for AI supremacy is no longer confined to algorithms.",
    "link": "https://www.ibtimes.com/new-american-engine-trumps-100b-ai-energy-blitz-begins-national-transformation-3778637",
    "timestamp": "2025-07-16T13:32:07Z"
  },
  {
    "title": "Conservative legal group presses agency to act on Trump’s voter citizenship mandate despite court injunctions",
    "description": "Following a blocked Trump executive order on election integrity, America First Legal urges a key federal agency to independently require citizenship proof for prospective voters.",
    "link": "https://www.foxnews.com/politics/conservative-legal-group-presses-agency-act-trumps-voter-citizenship-mandate-despite-court-injunctions",
    "timestamp": "2025-07-16T13:30:29Z"
  },
  {
    "title": "Viktor Orban: is time up for Europe's longest-serving premier?",
    "description": "Hungarian PM's power is under threat 'but not in the way – or from the people – one might expect'",
    "link": "https://theweek.com/politics/victor-orban-hungary-succession",
    "timestamp": "2025-07-16T13:30:18Z"
  },
  {
    "title": "Liberal States Are Undermining K-12 Education: The Trump Administration Is Fighting Back",
    "description": "Guest post by Gregory Lyakhov In recent years, several liberal state governments have pursued educational policies that have disrupted traditional K-12 education outcomes.\nThe post Liberal States Are Undermining K-12 Education: The Trump Administration Is Fig…",
    "link": "https://www.thegatewaypundit.com/?p=1422265",
    "timestamp": "2025-07-16T13:30:03Z"
  },
  {
    "title": "I Saw Firsthand Just How Much Even the Idea of Rosie O’Donnell Got Under Donald Trump’s Skin",
    "description": "Even at Trump's Comedy Central Roast, I Saw Rosie O'Donnell irk him — she wasn't even there. But just the idea of Rosie got under his skin.",
    "link": "https://www.indiewire.com/features/commentary/trump-comedy-central-roast-rosie-odonnell-1235138550/",
    "timestamp": "2025-07-16T13:30:00Z"
  },
  {
    "title": "Tillis Says He Won’t Tolerate Disrespect from Trump",
    "description": "\"Thom Tillis isn’t in rebellion mode against President Donald Trump or Republican leadership. He’s simply making clear that he won’t tolerate disrespect from Trump — or anyone else,\" Semafor reports. Said Tillis: “I’ve tried to",
    "link": "https://politicalwire.com/2025/07/16/tillis-says-he-wont-tolerate-disrespect-from-trump/",
    "timestamp": "2025-07-16T13:27:47Z"
  },
  {
    "title": "Wednesday, July 16, 2025",
    "description": "Medicare doc pay increase, funding shifts by White House, mifepristone access, early cancer detection tests, veteran DNA donations, and more.",
    "link": "https://kffhealthnews.org/morning-briefing/wednesday-july-16-2025/",
    "timestamp": "2025-07-16T13:27:18Z"
  },
  {
    "title": "Ether, Bitcoin And More Crypto Rallies After Trump Says Republicans Back His Stablecoin Bills",
    "description": "Thirteen Republicans voted against a motion to advance three pro-crypto bills, 12 of whom Trump said would now vote differently.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/07/16/ether-bitcoin-and-more-crypto-rallies-after-trump-says-republicans-back-his-stablecoin-bills/",
    "timestamp": "2025-07-16T13:25:32Z"
  },
  {
    "title": "Trump’s Brag About His ‘Great’ Uncle Takes A Truly Wild Turn",
    "description": "The president digressed Tuesday while speaking at an energy summit.",
    "link": "https://www.huffpost.com/entry/donald-trump-uncle-taught-unabomber-ted-kaczynski-mit_n_68777bf6e4b05557ffd2e01f",
    "timestamp": "2025-07-16T13:25:05Z"
  },
  {
    "title": "Goldman Sachs tops estimates as traders generate $840 million more revenue than expected",
    "description": "Key Points Goldman Sachs on Wednesday posted results that topped expectations as its trading operations generated $840 million more in revenue than analysts had expected. The bank said that second-quarter profit jumped 22% from a year earlier to $3.72 billion…",
    "link": "https://freerepublic.com/focus/f-news/4328955/posts",
    "timestamp": "2025-07-16T13:23:39Z"
  },
  {
    "title": "DEA, FBI seize $10 million in cryptocurrency 'directly linked to the Sinaloa cartel'",
    "description": "The Justice Department announced that \"over $10 million dollars in cryptocurrency, directly linked to the Sinaloa cartel\" has been seized in Miami, Florida.",
    "link": "https://www.foxnews.com/us/dea-fbi-seize-10-million-cryptocurrency-directly-linked-sinaloa-cartel",
    "timestamp": "2025-07-16T13:22:52Z"
  },
  {
    "title": "Ukraine’s Democracy Has Stalled",
    "description": "With the United States ceasing to care, Ukraine’s domestic reforms are falling flat.",
    "link": "http://foreignpolicy.com/2025/07/16/ukraines-democracy-has-stalled/",
    "timestamp": "2025-07-16T13:22:30Z"
  },
  {
    "title": "Microsoft, US national lab tap AI to speed up nuclear power permitting process",
    "description": "Microsoft and the Idaho National Laboratory (INL) said they will tap Microsoft's AI technology for generating engineering and safety analysis reports that are a standard part of the application process for construction permits and operating licenses for nucle…",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-us-national-lab-tap-ai-to-speed-up-nuclear-power-permitting-process/articleshow/122577658.cms",
    "timestamp": "2025-07-16T13:21:30Z"
  },
  {
    "title": "US producer prices unchanged with wholesale inflation remaining under control",
    "description": "U.S. wholesale inflation cooled last month, despite worries that President Donald Trump’s tariffs would push prices higher.",
    "link": "https://www.clickondetroit.com/business/2025/07/16/us-producer-prices-unchanged-with-wholesale-inflation-remaining-under-control/",
    "timestamp": "2025-07-16T13:21:09Z"
  },
  {
    "title": "Barrick Mining advances talks to sell Hemlo gold mine in Canada",
    "description": "The sale process, initiated in April 2025, is reaching its final stages, although the outcome remains uncertain.",
    "link": "https://www.mining-technology.com/news/barrick-mining-hemlo-discovery-silver/",
    "timestamp": "2025-07-16T13:20:37Z"
  },
  {
    "title": "Trump Declares Those Still Interested in Epstein Are “Bad People”",
    "description": "President Trump thinks his own supporters are “pretty bad people” for demanding full transparency on the Jeffrey Epstein case, which his Justice Department effectively closed. “I know you’ve urged people to move on, but I’m curious, why do you think your supp…",
    "link": "https://newrepublic.com/post/198012/trump-those-interested-epstein-bad-people",
    "timestamp": "2025-07-16T13:17:04Z"
  },
  {
    "title": "Donald Trump goes nuclear in the GOP’s war on science",
    "description": "Billions of dollars of cuts in research are leaving lives at stake",
    "link": "https://www.salon.com/2025/07/16/donald-trump-goes-nuclear-in-the-gops-war-on-science/",
    "timestamp": "2025-07-16T13:16:49Z"
  },
  {
    "title": "Should 65 Be the Age Limit for U.S. Presidents? One Person Said, '35 to 70 Seems Reasonable' and the Internet's Divided",
    "description": "\"Would limiting the age of the President to 65 be something you'd support? Why or why not?\" That question, posted in the r/AskReddit community, quickly...",
    "link": "https://finance.yahoo.com/news/65-age-limit-u-presidents-131507556.html",
    "timestamp": "2025-07-16T13:15:07Z"
  },
  {
    "title": "Bill O’Reilly Says Trump’s Response to Epstein Drama Is a ‘Mystery’: ‘Don’t Know Why He’s So Defensive About This’ | Exclusive",
    "description": "The former Fox host speaks with TheWrap about a post-Trump reckoning in media, the “60 Minutes” settlement and how he’d have prevented that Dominion suit\nThe post Bill O’Reilly Says Trump’s Response to Epstein Drama Is a ‘Mystery’: ‘Don’t Know Why He’s So Def…",
    "link": "https://www.thewrap.com/bill-oreilly-interview-epstein-trump-maga-division-mamdani/",
    "timestamp": "2025-07-16T13:15:00Z"
  },
  {
    "title": "Ghislaine Maxwell's Family Believe She Did Not Receive a Fair Trial in Jeffery Epstein's Sex Scandal and Make Bombshell Claim Pedo 'Paid Someone in Prison to Kill Him'",
    "description": "Ghislaine Maxwell's family have broken their silence to declare Jeffrey Epstein's former right-hand woman is 'innocent' and claim she was made a scapegoat for the financier's crimes.",
    "link": "https://radaronline.com/p/ghislaine-maxwell-family-fair-trial-jeffrey-epstein-paid-someone-prison-death/",
    "timestamp": "2025-07-16T13:15:00Z"
  },
  {
    "title": "Canada Weighs Limiting Lumber Exports to Solve US Trade Dispute, BC Premier Says",
    "description": "Canadian officials are open to considering limits on how much softwood lumber can be exported to the US to try to resolve some of the trade friction between the countries, according to the leader of British Columbia.",
    "link": "https://financialpost.com/pmn/business-pmn/canada-weighs-limiting-lumber-exports-to-solve-us-trade-dispute-bc-premier-says",
    "timestamp": "2025-07-16T13:14:53Z"
  },
  {
    "title": "Canada could limit lumber exports to solve U.S. trade dispute: Eby",
    "description": "David Eby said Canada is considering limits on softwood lumber exports to the U.S. to try to resolve trade friction.. Read more.",
    "link": "https://financialpost.com/commodities/canada-weighs-limiting-lumber-exports-to-solve-us-trade-dispute-bc-premier-says",
    "timestamp": "2025-07-16T13:14:53Z"
  },
  {
    "title": "Trump says he’s found a way to fire Fed Reserve Chair Powell. Here’s how",
    "description": "President Donald Trump says he has finally found a way to achieve his goal of removing Federal Reserve Chair Jerome Powell, accusing him of mismanaging the U.S. central bank’s $2.5 billion renovation project.The push comes after a monthslong campaign by Trump…",
    "link": "https://biztoc.com/x/f61fef707ef89769",
    "timestamp": "2025-07-16T13:14:01Z"
  },
  {
    "title": "Trump downplays possibility of sending Ukraine long-range weapons as it struggles to repel Russia - AP News",
    "description": "Trump downplays possibility of sending Ukraine long-range weapons as it struggles to repel RussiaAP News Trump backtracks from suggestion Ukraine should ‘target Moscow’ but again tells Putin to reach peace deal soon – Europe liveThe Guardian Trump says ‘not l…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178392290",
    "timestamp": "2025-07-16T13:12:30Z"
  },
  {
    "title": "Insurers fight state laws restricting surprise ambulance bills",
    "description": "As more states pass such legislation, concerns grow about raising premiums.",
    "link": "https://www.bostonherald.com/2025/07/16/insurers-fight-state-laws-restricting-surprise-ambulance-bills/",
    "timestamp": "2025-07-16T13:10:58Z"
  },
  {
    "title": "Trump Shares a Personal Story About the Unabomber That Doesn’t Make Any Sense",
    "description": "\"There's very little difference between a madman and a genius,\" Trump said of the Unabomber.",
    "link": "https://gizmodo.com/trump-shares-a-personal-story-about-the-unabomber-that-doesnt-make-any-sense-2000629791",
    "timestamp": "2025-07-16T13:10:00Z"
  },
  {
    "title": "Russia monitoring Western weapons deliveries to Ukraine, Kremlin says",
    "description": "Moscow also confirms that no phone call is currently planned between Presidents Trump and Putin.",
    "link": "https://www.aljazeera.com/news/2025/7/16/russia-monitoring-western-weapons-deliveries-to-ukraine-kremlin-says",
    "timestamp": "2025-07-16T13:09:18Z"
  },
  {
    "title": "Mass firings rock US health department after Supreme Court's decision; RFK Jr fires two top aides",
    "description": "Thousands of employees across US Department of Health and Human Services were terminated Monday evening after the US Supreme Court ruled last week that the Trump administration could move forward with its sweeping reorganization of the agency. Thousands of em…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-mass-firings-at-us-health-department-begin-as-supreme-court-lifts-pause-rfk-jr-fires-two-top-aides/articleshow/122577202.cms",
    "timestamp": "2025-07-16T13:09:01Z"
  },
  {
    "title": "Carney travels to Hamilton to meet steelworkers as US trade talks continue",
    "description": "Prime Minister Mark Carney is scheduled to be in Hamilton today to make an announcement related to the steel industry.",
    "link": "https://www.nationalobserver.com/2025/07/16/news/carney-travels-hamilton-meet-steelworkers-us-trade-talks-continue",
    "timestamp": "2025-07-16T13:08:22Z"
  },
  {
    "title": "Morgan Stanley profit beats estimates as traders shine",
    "description": "MORGAN STANLEY-RESULTS/ (UPDATE 3, PIX):UPDATE 3-Morgan Stanley profit beats estimates as traders shine",
    "link": "https://www.irishtimes.com/business/financial-services/2025/07/16/morgan-stanley-profit-beats-estimates-as-traders-shine/",
    "timestamp": "2025-07-16T13:07:41Z"
  },
  {
    "title": "US producer prices unchanged with wholesale inflation remaining under control",
    "description": "US wholesale inflation showed signs of cooling last month, defying concerns that President Trump's tariffs would drive up prices. The producer price index remained unchanged from May, with core prices also stable. This follows a report of rising consumer pric…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-producer-prices-unchanged-with-wholesale-inflation-remaining-under-control/articleshow/122577330.cms",
    "timestamp": "2025-07-16T13:06:55Z"
  },
  {
    "title": "R&A met Trump's son to discuss Turnberry Open",
    "description": "R&A officials meet US President Donald Trump's son Eric to discuss The Open returning to Turnberry - but say logistical challenges remain.",
    "link": "https://www.bbc.com/sport/golf/articles/crenl5gz4n3o",
    "timestamp": "2025-07-16T13:06:42Z"
  },
  {
    "title": "Trump Tries to Put Down Epstein Revolt by Calling MAGA Rebels 'Bad People' (Julia Ornedo/The Daily Beast)",
    "description": "Julia Ornedo / The Daily Beast:\nTrump Tries to Put Down Epstein Revolt by Calling MAGA Rebels ‘Bad People’  —  BURNING DOWN THE HOUSE  —  Trump ranted about the Epstein case that's causing a serious headache for the president-and his supporters are in the fir…",
    "link": "https://www.memeorandum.com/250716/p38",
    "timestamp": "2025-07-16T13:05:01Z"
  },
  {
    "title": "Italy won’t buy US arms for Ukraine – media",
    "description": "The funds that Italy could allocate for lethal aid are “practically non-existent,” according to La Stampa’s sources Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621567-italy-ukraine-trump-weapons/",
    "timestamp": "2025-07-16T13:04:25Z"
  }
]