[
  {
    "title": "Trump's strikes on Iran: a 'spectacular success'?",
    "description": "\"He came, he bombed, he ended the war.\" That's how Donald Trump would sum up the events of the past week, said The Economist, but the reality was a little more complicated.\nLast Saturday, 48 hours after giving Iran a two-week deadline, the US president launch…",
    "link": "https://biztoc.com/x/62aa5597f5bd5802",
    "timestamp": "2025-06-28T06:16:41Z"
  },
  {
    "title": "Lara Marlowe: US is again betting that installing ‘our sonuvabitch’ will neutralise an adversary. It never does",
    "description": "Every 20 years the US and Israel attempt to remake the Middle East - always with catastrophic consequences",
    "link": "https://www.irishtimes.com/opinion/2025/06/28/lara-marlowe-us-is-again-betting-that-installing-our-sonuvabitch-will-neutralise-an-adversary-it-never-does/",
    "timestamp": "2025-06-28T06:15:00Z"
  },
  {
    "title": "Trump slams CNN over tariff and economy reports",
    "description": "United States President Donald Trump criticized CNN for its reports on tariffs, saying that the new outlet \"will only get worse\" and calling them \"losers.\"In a post on Truth Social, Trump stated that ...",
    "link": "https://biztoc.com/x/b709ebce08317a15",
    "timestamp": "2025-06-28T06:05:59Z"
  },
  {
    "title": "Trump's strikes on Iran: a 'spectacular success'?",
    "description": "Military humiliations 'expose the brittleness' of Tehran's ageing regime, but risk reinforcing its commitment to its nuclear program",
    "link": "https://theweek.com/politics/trump-strikes-iran-success",
    "timestamp": "2025-06-28T06:04:00Z"
  },
  {
    "title": "Delaware governor signs executive order to continue gender alteration procedures in the state",
    "description": "Delaware Gov. Matt Meyer signed Executive Order 11 on June 20, making Delaware a legal refuge for individuals seeking or providing gender transition procedures – including for minors – and protecting both patients and providers from out-of-state legal actions…",
    "link": "https://www.naturalnews.com/2025-06-28-gov-signs-eo-to-continue-gender-alteration-delaware.html",
    "timestamp": "2025-06-28T06:00:00Z"
  },
  {
    "title": "Pentagon to expand military presence along southern border with two new defense zones",
    "description": "The Pentagon is establishing two new National Defense Areas (NDAs) along the southern border, one connected to Joint Base San Antonio (250 miles along the Rio Grande) and another near MCAS Yuma (over 100 miles), to expand military enforcement against illegal …",
    "link": "https://www.naturalnews.com/2025-06-28-pentagon-to-expand-military-along-southern-border.html",
    "timestamp": "2025-06-28T06:00:00Z"
  },
  {
    "title": "Poll: Majority of voters oppose taxpayer funding for groups that provide abortions and gender transition treatments to minors",
    "description": "A national poll of 1,600 registered voters found that 64 percent oppose taxpayer funding for organizations that provide abortions and gender transition treatments to minors, with 51 percent strongly opposed. Opposition is highest among Republicans (76 percent…",
    "link": "https://www.naturalnews.com/2025-06-28-voters-oppose-abortion-gender-treatments-taxpayer-funding.html",
    "timestamp": "2025-06-28T06:00:00Z"
  },
  {
    "title": "Biden-appointed federal judge forces Trump administration to release funds for EV chargers",
    "description": "A federal judge ruled that the Trump administration unlawfully withheld billions in funding for EV charging stations allocated under Biden’s Bipartisan Infrastructure Law, ordering its release. The ruling reignited partisan conflict over green energy subsidie…",
    "link": "https://www.naturalnews.com/2025-06-28-judge-orders-release-funds-for-ev-chargers.html",
    "timestamp": "2025-06-28T06:00:00Z"
  },
  {
    "title": "Why Donald Trump must let Jerome Powell do his job",
    "description": "Donald Trump's criticism of Jerome Powell raises concerns. This interference could destabilize the economy. GDP projections are down. Inflation and unemployment are rising. Powell is trying to navigate stagflation. Trump's tariffs could worsen the situation. …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-donald-trump-must-let-jerome-powell-do-his-job/articleshow/122125220.cms",
    "timestamp": "2025-06-28T05:59:41Z"
  },
  {
    "title": "Why Donald Trump must let Jerome Powell do his job",
    "description": "Donald Trump's criticism of Jerome Powell raises concerns. This interference could destabilize the economy. GDP projections are down. Inflation and unemployment are rising. Powell is trying to navigate stagflation. Trump's tariffs could worsen the situation. …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-donald-trump-must-let-jerome-powell-do-his-job/articleshow/122125262.cms",
    "timestamp": "2025-06-28T05:59:41Z"
  },
  {
    "title": "Japan, U.S. to continue tariff talks as July deadline looms",
    "description": "One focus of the bilateral negotiations is whether the suspension of additional \"reciprocal\" tariffs on Japan will be extended.",
    "link": "https://www.japantimes.co.jp/business/2025/06/28/economy/japan-us-tariff-talks-july-deadline/",
    "timestamp": "2025-06-28T05:54:00Z"
  },
  {
    "title": "Most Trump voters distrust Big Tech’s efforts to suck up to president — with 63% finding Mark Zuckerberg ‘unlikeable’: survey",
    "description": "Most of Donald Trump’s supporters aren’t buying Big Tech’s attempts to suck up to the president, according to nationwide poll results exclusively obtained by The Post. Meta CEO Mark Zuckerberg and other Big Tech bosses have launched a charm offensive since Tr…",
    "link": "https://freerepublic.com/focus/f-news/4325762/posts",
    "timestamp": "2025-06-28T05:49:50Z"
  },
  {
    "title": "Pam Bondi fires three Jan. 6 prosecutors, sending another chill through DOJ workforce",
    "description": "The dismissals were the first time that prosecutors who worked on Jan. 6 cases and were past their probationary period of federal employment had been fired by the Justice Department. ... At least three federal prosecutors who worked on cases against Jan. 6 ri…",
    "link": "https://freerepublic.com/focus/f-news/4325761/posts",
    "timestamp": "2025-06-28T05:49:29Z"
  },
  {
    "title": "Trump supreme: Absolute power at the “behest” of the Supreme Court – Historic decision against nationwide bans",
    "description": "\"Green light\" for the Trump administration to implement its policies even when they are legally challenged, limiting the power of lower courts to block them nationwide - Amazing decision, he commented\nThe post Trump supreme: Absolute power at the “behest” of …",
    "link": "https://en.protothema.gr/2025/06/28/trump-supreme-absolute-power-at-the-behest-of-the-supreme-court-historic-decision-against-nationwide-bans/",
    "timestamp": "2025-06-28T05:39:30Z"
  },
  {
    "title": "Trump victorious again as US Supreme Court wraps up its term",
    "description": "The Supreme Court, with its conservative majority, handed Donald Trump a series of victories, curbing judicial power to impede his policies nationwide. This decision limits judges' ability to issue universal injunctions, potentially easing the implementation …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-victorious-again-as-us-supreme-court-wraps-up-its-term/articleshow/122124882.cms",
    "timestamp": "2025-06-28T05:32:19Z"
  },
  {
    "title": "Trump Management 101: World leaders adapt to his erratic diplomacy with flattery and patience",
    "description": "World leaders navigate Trump's unpredictable behavior, learning to flatter, wait out threats, and deliver what he wants.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-management-101-world-leaders-adapt-to-his-erratic-diplomacy-with-flattery-and-patience/article69747489.ece",
    "timestamp": "2025-06-28T05:29:41Z"
  },
  {
    "title": "Robinhood Introduces Micro Futures Contracts For XRP And SOL",
    "description": "Popular digital brokerage platform Robinhood has launched micro futures contracts for Ripple’s XRP and Solana (SOL).",
    "link": "https://zycrypto.com/robinhood-introduces-micro-futures-contracts-for-xrp-and-sol/",
    "timestamp": "2025-06-28T05:19:32Z"
  },
  {
    "title": "Trump victorious again as US Supreme Court wraps up its term",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court on the last day of rulings for its current term gave Donald Trump his latest in a series of victories at the nation's top judicial body, one that may make it easier for him to implement contentious elements of his …",
    "link": "https://www.thestar.com.my/news/world/2025/06/28/trump-victorious-again-as-us-supreme-court-wraps-up-its-term",
    "timestamp": "2025-06-28T05:10:00Z"
  },
  {
    "title": "US Senate Republicans seek to end EV tax credit by September 30",
    "description": "Senate Republicans have proposed a revised tax and budget bill that aims to end electric vehicle tax credits and eliminate fines for automakers failing to meet fuel economy standards. This bill contrasts with previous policies promoting EVs and renewable ener…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senate-republicans-seek-to-end-ev-tax-credit-by-september-30/articleshow/122124599.cms",
    "timestamp": "2025-06-28T05:08:17Z"
  },
  {
    "title": "Trump says Gaza ceasefire may be ‘close,’ possibly within week",
    "description": "He did not provide further details on how an agreement might unfold or say to whom he spoke about a possible halt in the war that began with the Hamas assault on Israel on Oct. 7, 2023.",
    "link": "https://www.bloomberg.com/news/articles/2025-06-27/trump-says-gaza-ceasefire-may-be-close-possibly-within-week",
    "timestamp": "2025-06-28T05:07:36Z"
  },
  {
    "title": "Iran holds state funeral for top brass slain in war with Israel",
    "description": "Iran held a state funeral for approximately 60 individuals, including military commanders and nuclear scientists, who died in the recent conflict with Israel. This occurred after Iran's foreign minister criticized Donald Trump's remarks about Supreme Leader K…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-holds-state-funeral-for-top-brass-slain-in-war-with-israel/articleshow/122124497.cms",
    "timestamp": "2025-06-28T05:01:15Z"
  },
  {
    "title": "LIVE: Outrage over report Israeli troops ordered to shoot Gaza aid seekers",
    "description": "As death toll from Israel’s bombing of Gaza spirals, US President says a ceasefire is possible ‘within the next week’.",
    "link": "https://www.aljazeera.com/news/liveblog/2025/6/28/live-outrage-over-report-israeli-troops-ordered-to-shoot-gaza-aid-seekers",
    "timestamp": "2025-06-28T05:00:47Z"
  },
  {
    "title": "Rwanda, DR Congo Sign Peace Deal In US After Rebel Sweep",
    "description": "Rwanda and the Democratic Republic of Congo signed a peace agreement Friday in Washington to end fighting that has killed thousands, with the two countries pledging to pull back support for guerrillas -- and President Donald Trump boasting of securing mineral…",
    "link": "https://www.ibtimes.com.au/rwanda-dr-congo-sign-peace-deal-us-after-rebel-sweep-1859441",
    "timestamp": "2025-06-28T05:00:46Z"
  },
  {
    "title": "‘Trump always chickens out’ is starting to look more like ‘the man always gets his way’",
    "description": "Brussels will try to avoid all-out trade war with US, but faces agreeing tariffs deal tilted in Washington’s favour",
    "link": "https://www.irishtimes.com/opinion/2025/06/28/trump-always-chickens-out-is-starting-to-look-more-like-the-man-always-gets-his-way/",
    "timestamp": "2025-06-28T05:00:01Z"
  },
  {
    "title": "Mike Ryan: What next for the ‘Indiana Jones of epidemiology’ as he leaves WHO?",
    "description": "Sligo man exits the crisis-hit World Health Organisation after decades of fighting deadly diseases in some of the most dangerous places",
    "link": "https://www.irishtimes.com/health/2025/06/28/mike-ryan-what-next-for-the-indiana-jones-of-epidemiology-as-he-leaves-who/",
    "timestamp": "2025-06-28T05:00:00Z"
  },
  {
    "title": "Trump denies offering Iran $30B to build nuclear energy",
    "description": "United States President Donald Trump criticized what he called \"the fake news media\" for saying that his administration would grant Iran $30 billion to build a civilian-energy-producing nuclear progra...",
    "link": "https://biztoc.com/x/31466fceb3a79fd5",
    "timestamp": "2025-06-28T04:58:53Z"
  },
  {
    "title": "Trump's 'big, beautiful bill' faces Republican family feud as Senate reveals its final text",
    "description": "Republican leaders advance their modified version of Trump's bill, despite resistance from conservatives and moderates over Medicaid changes and other divisive policy tweaks.",
    "link": "https://www.foxnews.com/politics/trumps-big-beautiful-bill-faces-republican-family-feud-senate-reveals-its-final-text",
    "timestamp": "2025-06-28T04:55:26Z"
  },
  {
    "title": "S&P 500 hits record high after $10 trillion rally",
    "description": "Wall Street traders drive stocks to all-time highs amid tariff headlines, cooling West Asia risks, and US economic resilience.",
    "link": "https://www.bloomberg.com/news/articles/2025-06-26/stock-market-today-dow-s-p-live-updates",
    "timestamp": "2025-06-28T04:40:59Z"
  },
  {
    "title": "Canada To Continue To Conduct \"Complex Negotiations\" With US: Mark Carney",
    "description": "Canadian Prime Minister Mark Carney called the negotiations with the United States \"complex\" when he responded to the announcement of US President Donald Trump to terminate all trade talks with Canada with potential new tariffs. \"We'll continue to conduct the…",
    "link": "https://freerepublic.com/focus/f-news/4325759/posts",
    "timestamp": "2025-06-28T04:39:01Z"
  },
  {
    "title": "Ford forced to idle multiple US plants on China magnet shortage",
    "description": "Ford faced factory shutdowns in the US recently. This happened because of a shortage of rare earth minerals. These minerals are vital for car parts. China's new export rules caused supply delays. CEO Jim Farley stressed the need for a local supply chain. He m…",
    "link": "https://economictimes.indiatimes.com/news/international/business/ford-forced-to-idle-multiple-us-plants-on-china-magnet-shortage/articleshow/122124223.cms",
    "timestamp": "2025-06-28T04:37:59Z"
  },
  {
    "title": "Max Rose: Democrats Will Run on Restoring Birthright Citizenship",
    "description": "Former Rep. Max Rose (D-NY) said Friday on CNN’s “OutFront” that in the 2026 midterm elections, Democrats will run on restoring birthright Citizenship. Rose said, “We’ve always relied on not just a set of laws, but also a set of\nThe post Max Rose: Democrats W…",
    "link": "https://www.breitbart.com/clips/2025/06/27/max-rose-democrats-will-run-on-restoring-birthright-citizenship/",
    "timestamp": "2025-06-28T04:33:29Z"
  },
  {
    "title": "Donald Trump says he will only pick Fed chair who cuts interest rates - Financial Times",
    "description": "Donald Trump says he will only pick Fed chair who cuts interest ratesFinancial Times Trump Encourages Powell to Resign in Latest Attack on the Fed ChairThe New York Times Trump may name a ‘shadow’ Fed chair, an unprecedented development in American historyCNN…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178209696",
    "timestamp": "2025-06-28T04:32:16Z"
  },
  {
    "title": "News Summary-Intelligence Report 6/27/2025*Newsdump Friday*Budapest Pride Organizers Defiant*Israeli Soldiers Ordered To Shoot Gaza Aid Seekers*Supreme Court Limits Anti-Trump Injunctions*China-US Trade Framework*Starmer Backs Down On Benefit Cuts*",
    "description": "\"They have to proclaim Israel...their faith and loyalty in Israel...Wait a minute what about our own country...\"...Congresswoman Marjorie Taylor Greene... In Israel late tonight Jewish settlers on a rampage in a Palestinian... Russian air defenses taking down…",
    "link": "https://freerepublic.com/focus/f-bloggers/4325757/posts",
    "timestamp": "2025-06-28T04:31:57Z"
  },
  {
    "title": "Fireworks will light up this Fourth of July. Next year could be different if tariff talks fizzle",
    "description": "Fireworks are as American as apple pie",
    "link": "https://abcnews.go.com/US/wireStory/fireworks-light-fourth-july-year-tariff-talks-fizzle-123296393",
    "timestamp": "2025-06-28T04:30:16Z"
  },
  {
    "title": "Some government backbench TDs will not attend US embassy’s July 4 celebrations",
    "description": "A number of government backbench TDs have said they will not attend this year’s July 4 celebrations hosted by the US embassy, citing discomfort with the Trump administration and the current geopolitical situation.",
    "link": "https://www.independent.ie/irish-news/some-government-backbench-tds-will-not-attend-us-embassys-july-4-celebrations/a886810864.html",
    "timestamp": "2025-06-28T04:30:00Z"
  },
  {
    "title": "Supreme Court hands Donald Trump win on birthright citizenship",
    "description": "The US Supreme Court handed president Donald Trump a major victory yesterday by curbing the power of federal judges to impose nationwide rulings impeding his policies but it left unresolved the issue of whether he can limit birthright citizenship.",
    "link": "https://www.independent.ie/world-news/north-america/supreme-court-hands-donald-trump-win-on-birthright-citizenship/a178817701.html",
    "timestamp": "2025-06-28T04:30:00Z"
  },
  {
    "title": "Wall Street’s booming June is big bet against economy doomsayers",
    "description": "Wall Street is celebrating a market surge fueled by receding trade war fears, with the S&P 500 hitting a record high. Investor optimism is high despite economic uncertainties and policy concerns. Cooling inflation and improved consumer sentiment are driving t…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-streets-booming-june-is-big-bet-against-economy-doomsayers/articleshow/122123886.cms",
    "timestamp": "2025-06-28T04:14:41Z"
  },
  {
    "title": "Iran nearly succeeded in orchestrating assassination of Mike Pompeo in Europe in 2022, book reveals (Emily Davies/Washington Post)",
    "description": "Emily Davies / Washington Post:\nIran nearly succeeded in orchestrating assassination of Mike Pompeo in Europe in 2022, book reveals  —  Donald Trump and his top advisers, notably former secretary of state Pompeo, faced regular assassination threats after he l…",
    "link": "https://www.memeorandum.com/250628/p1",
    "timestamp": "2025-06-28T04:10:01Z"
  },
  {
    "title": "How Zohran Mamdani’s win in the New York City mayoral Primary could Ripple across the Country",
    "description": "By Lincoln Mitchell, Columbia University (The Conversation) - Top Republicans and Democrats alike are talking about the sudden rise of 33-year-old Zohran Mamdani, a state representative who won the Democratic mayoral primary in New York on June 24, 2025, in a…",
    "link": "https://www.juancole.com/2025/06/mamdanis-mayoral-primary.html",
    "timestamp": "2025-06-28T04:04:53Z"
  },
  {
    "title": "How the Fed Made Housing Unaffordable",
    "description": "Donald Trump and his allies continue to complain that the central bank isn’t inflating the money supply enough. Last week, Bill Pulte, Trump’s appointee to the Federal Housing and Finance Administration—and the head of Fannie and Freddie—complained that Powel…",
    "link": "https://www.lewrockwell.com/2025/06/ryan-mcmaken/how-the-fed-made-housing-unaffordable/",
    "timestamp": "2025-06-28T04:01:00Z"
  },
  {
    "title": "One Year Ago Today… President Trump Takes Down Senile Joe Biden and the Fake News Media in Biden’s One and Only Presidential Debate – ONE AND DONE!",
    "description": "It was one year ago today that President Trump defeated and destroyed Joe Biden in their one and only 2024 presidential debate.\nThe post One Year Ago Today… President Trump Takes Down Senile Joe Biden and the Fake News Media in Biden’s One and Only Presidenti…",
    "link": "https://www.thegatewaypundit.com/2025/06/one-year-ago-today-president-trump-destroys-senile/",
    "timestamp": "2025-06-28T04:00:04Z"
  },
  {
    "title": "Mass. AG Campbell vows to fight on after Supreme Court hands Trump birthright citizenship win",
    "description": "While expressing disappointment with Friday’s U.S. Supreme Court ruling on the birthright citizenship case, Massachusetts Attorney General Andrea J. Campbell is confident states will “absolutely be successful” in defeating President Donald Trump’s executive o…",
    "link": "https://www.thesunchronicle.com/news/local_news/mass-ag-campbell-vows-to-fight-on-after-supreme-court-hands-trump-birthright-citizenship-win/article_e42b4d43-3d08-47fd-a0aa-2d75133ebf84.html",
    "timestamp": "2025-06-28T04:00:00Z"
  },
  {
    "title": "‘Alligator Alcatraz’: Visit to new detention centre shows pleasure some Republicans derive from inflicting cruelty on immigrants",
    "description": "Humiliation of tens of thousands of immigrants in a Florida processing centre surrounded by alligators will generate a backlash",
    "link": "https://www.irishtimes.com/world/us/2025/06/28/alligator-alcatraz-visit-to-new-detention-centre-shows-pleasure-some-republicans-derive-from-inflicting-cruelty-on-immigrants/",
    "timestamp": "2025-06-28T04:00:00Z"
  },
  {
    "title": "Elon Musk...please buy CNN!",
    "description": "Last November saw Donald Trump, Jr. joking with Elon Musk about buying MSNBC.\r\n\r\n“Hey @elonmusk I have the funniest idea ever!!!”\r\n\r\nWith the attached tweet from Wall Street Mav, stating;\r\n\r\n\r\nComcast is putting MSNBC up for sale.\r\n\r\nCNN ...",
    "link": "https://www.americanthinker.com/blog/2025/06/elon_musk_please_buy_cnn.html",
    "timestamp": "2025-06-28T04:00:00Z"
  },
  {
    "title": "Buried News: President Trump ends Africa’s deadliest war",
    "description": "A thirty-year war. Over six million lives lost. Entire villages erased. Generations destroyed by the silent carnage that the world chose to ignore. But in the wake of mounting atrocities in Kasanga and Beni, and after months of quiet diplom...",
    "link": "https://www.americanthinker.com/blog/2025/06/buried_news_president_trump_ends_africa_s_deadliest_war.html",
    "timestamp": "2025-06-28T04:00:00Z"
  },
  {
    "title": "The Untold Reason for Mamdani’s Mayoral Win",
    "description": "The New York City mayoral Democrat primary race results have shaken the political world.\r\n\r\nCandidate Zohran Mamdani, described as a Marxist Muslim, was five months ago languishing in also-ran territory at one percent in the polls. A most recent poll...",
    "link": "https://www.americanthinker.com/articles/2025/06/the_untold_reason_for_mamdani_s_mayoral_win.html",
    "timestamp": "2025-06-28T04:00:00Z"
  },
  {
    "title": "Trump says he won't appoint anyone to Fed who doesn't back rate cuts",
    "description": "Donald Trump insists on appointing a Federal Reserve head who will lower interest rates. He criticizes current chair Jerome Powell's performance. Trump suggests rates should drop to 1%. He has potential candidates in mind for Powell's replacement. Scott Besse…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-says-he-wont-appoint-anyone-to-fed-who-doesnt-back-rate-cuts/articleshow/122123752.cms",
    "timestamp": "2025-06-28T03:58:44Z"
  },
  {
    "title": "Trump calls Fetterman ‘most sensible’ Democrat",
    "description": "President Donald Trump heaped praise on Sen. John Fetterman, singling him out as the “most sensible” Democratic senator. Trump made the remark during a press conference Friday, in which he assailed Democrats in the Senate for not backing his so-called “big, b…",
    "link": "https://freerepublic.com/focus/f-news/4325755/posts",
    "timestamp": "2025-06-28T03:57:22Z"
  },
  {
    "title": "Canada Implements New Tariffs For Steel Imports",
    "description": "Canada has introduced new tariffs for steel mill products imported into the country from partner states that Ottawa has no free trade agreement (FTA) with, the Canadian government informed in a statement.",
    "link": "https://sputnikglobe.com/20250628/canada-implements-new-tariffs-for-steel-imports-1122353992.html",
    "timestamp": "2025-06-28T03:57:00Z"
  },
  {
    "title": "Gavin Newsom Sues Fox News for $787 Million Over Claims He Lied About a Trump Call",
    "description": "The California governor says that the news outlet had used deceptive edits to claim that the governor had lied in saying that Trump had not called him about deploying National Guard troops during the L.A. protests. Logo text Gavin Newsom is suing Fox News for…",
    "link": "https://freerepublic.com/focus/f-news/4325754/posts",
    "timestamp": "2025-06-28T03:54:18Z"
  },
  {
    "title": "5 world market themes for the week ahead",
    "description": "Global markets brace for a volatile second half of 2025. Trade tensions and Federal Reserve policy are key concerns. US jobs data and European Central Bank discussions are closely watched. China's economic recovery remains uncertain. Mergers and acquisitions …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/122123688.cms",
    "timestamp": "2025-06-28T03:53:35Z"
  },
  {
    "title": "Wall Street Week Ahead-Investors eye US jobs data as stocks hit record highs",
    "description": "Investors are shifting their focus from geopolitics to upcoming economic data and policy developments, seeking to sustain the recent stock market rally. Key events include President Trump's tax-cut bill, the monthly employment report, and potential tariff cha…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-investors-eye-us-jobs-data-as-stocks-hit-record-highs/articleshow/122123627.cms",
    "timestamp": "2025-06-28T03:46:46Z"
  },
  {
    "title": "Trump says he could bomb Iran again, as DFAT crisis register grows",
    "description": "The US president says he would consider further military action in Iran, as the Department of Foreign Affairs and Trade confirms 3,200 Australians and family members in the country register with a crisis service.",
    "link": "https://www.abc.net.au/news/2025-06-28/us-president-says-he-could-bomb-iran-again-/105472516",
    "timestamp": "2025-06-28T03:44:57Z"
  },
  {
    "title": "\"Iran has to get back into world order flow...\": US President Trump",
    "description": "Donald Trump asserted that Iran's nuclear sites were \"obliterated\" and warned of worsening conditions if Iran doesn't align with global norms. He claimed to have prevented an Israeli attack on Tehran and halted sanction relief due to perceived animosity from …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/iran-has-to-get-back-into-world-order-flow-us-president-trump/articleshow/122123585.cms",
    "timestamp": "2025-06-28T03:41:20Z"
  },
  {
    "title": "Trump: Ceasefire in Gaza Within Next Week",
    "description": "US President Donald Trump said on Friday that a ceasefire in the Gaza Strip will be be agreed upon within the next week.",
    "link": "https://sputnikglobe.com/20250628/trump-ceasefire-in-gaza-within-next-week-1122353864.html",
    "timestamp": "2025-06-28T03:41:00Z"
  },
  {
    "title": "Trump dismisses reports US is weighing up to $30 billion civilian nuclear deal for Iran",
    "description": "Donald Trump refuted media reports. These reports suggested his administration considered giving Iran $30 billion. The money was allegedly for a civilian nuclear program. Trump called the reports a hoax on Truth Social. Indirect talks between Iran and the U.S…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-dismisses-reports-us-is-weighing-up-to-30-billion-civilian-nuclear-deal-for-iran/articleshow/122123570.cms",
    "timestamp": "2025-06-28T03:38:57Z"
  },
  {
    "title": "Trump says he will 'get the conflict solved with North Korea'",
    "description": "Trump also appeared to spotlight fears among U.S. allies that his administration could put their security in jeopardy by not adhering to alliance commitments.",
    "link": "https://www.japantimes.co.jp/news/2025/06/28/asia-pacific/politics/donald-trump-north-korea-kim-jong-un/",
    "timestamp": "2025-06-28T03:37:00Z"
  },
  {
    "title": "JAMES CARTER And SEVASTIAN HORTON: Reauthorize EXIM: A Cornerstone Of The America First Mandate",
    "description": "The United States’ recent confrontations with Iran dominate the headlines, but the growing, if quieter, confrontation with China is just as real and, ultimately, more consequential. According to CNN, “Xi Jinping has a plan for how the world should work, and ……",
    "link": "https://dailycaller.com/2025/06/27/opinion-reauthorize-exim-a-cornerstone-of-the-america-first-mandate-james-carter-and-sevastian-horton/",
    "timestamp": "2025-06-28T03:34:49Z"
  },
  {
    "title": "Trump May Visit China This Year - Reports",
    "description": "US President Donald Trump may visit China this year accompanied by a delegation of businessmen, the Nikkei Asia newspaper reported.",
    "link": "https://sputnikglobe.com/20250628/trump-may-visit-china-this-year---reports-1122353746.html",
    "timestamp": "2025-06-28T03:18:00Z"
  },
  {
    "title": "US terminating all trade talks with Canada over digital tax, says Trump",
    "description": "WASHINGTON: President Donald Trump announced Friday that the United States is ending trade discussions with Canada over the country's digital services tax on technology companies, Anadolu Ajansi (AA) reported. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/28/us-terminating-all-trade-talks-with-canada-over-digital-tax-says-trump",
    "timestamp": "2025-06-28T03:07:00Z"
  },
  {
    "title": "Trump says Gaza ceasefire possible ‘within the next week’, gives no details",
    "description": "US president's claim greeted with surprise as deaths spiral in Gaza and Israeli forces accused of more 'war crimes'.",
    "link": "https://www.aljazeera.com/news/2025/6/28/trump-says-gaza-ceasefire-possible-within-the-next-week-gives-no-details",
    "timestamp": "2025-06-28T03:02:40Z"
  },
  {
    "title": "Trump's Big Law executive orders go 0-4 after judge slaps down order against Susman Godfrey",
    "description": "Judge Loren AliKhan in a Friday ruling found the Trump administration's order against Susman Godfrey unconstitutional, bringing Trump's record to 0-4.",
    "link": "https://www.businessinsider.com/judge-ruling-donald-trump-big-law-executive-order-susman-godfrey-2025-6",
    "timestamp": "2025-06-28T03:02:35Z"
  },
  {
    "title": "S&P 500, Nasdaq hit record closing highs amid trade negotiations, rate cut bets",
    "description": "Wall Street surged on Friday, propelling the S&P 500 and Nasdaq to record highs amid trade optimism and expectations of Federal Reserve rate cuts. Despite a brief setback caused by President Trump's termination of trade talks with Canada, all major indexes po…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-hit-record-closing-highs-amid-trade-negotiations-rate-cut-bets/articleshow/122123287.cms",
    "timestamp": "2025-06-28T03:02:34Z"
  },
  {
    "title": "Move Over, Google—Bitcoin Is Now One Of The Top 6 Assets Worldwide",
    "description": "According to recent market data, Bitcoin has overtaken Google to become the sixth-largest asset in the world by market capitalization. Its value now sits at $2.12 trillion, edging out Google’s $2.07 trillion. That shift has drawn attention across finance desk…",
    "link": "https://bitcoinist.com/move-over-google-bitcoin-is-now-one-of-the-top-6-assets-worldwide/",
    "timestamp": "2025-06-28T03:00:57Z"
  },
  {
    "title": "Lewis Capaldi makes triumphant return to Glastonbury, two years on from unfinished set",
    "description": "From Lewis Capaldi's emotional performance on the Pyramid Stage to Lorde's surprise album party, here's what happened at Glastonbury on Friday.",
    "link": "https://www.abc.net.au/news/2025-06-28/glastonbury-2025-friday-lewis-capaldi-lorde-1975/105472446",
    "timestamp": "2025-06-28T02:58:40Z"
  },
  {
    "title": "Iran Holds State Funeral For Top Brass Slain In War With Israel",
    "description": "Iran will hold a state funeral service Saturday for around 60 people, including its military commanders, killed in its war with Israel, after Tehran's top diplomat condemned Donald Trump's comments on supreme leader Ali Khamenei as \"unacceptable\".",
    "link": "https://www.ibtimes.com/iran-holds-state-funeral-top-brass-slain-war-israel-3777130",
    "timestamp": "2025-06-28T02:57:19Z"
  },
  {
    "title": "Iran Holds State Funeral For Top Brass Slain In War With Israel",
    "description": "Iran will hold a state funeral service Saturday for around 60 people, including its military commanders, killed in its war with Israel, after Tehran's top diplomat condemned Donald Trump's comments on supreme leader Ali Khamenei as \"unacceptable\".",
    "link": "https://www.ibtimes.com.au/iran-holds-state-funeral-top-brass-slain-war-israel-1859438",
    "timestamp": "2025-06-28T02:57:17Z"
  },
  {
    "title": "Report: Foreign Countries Asked by U.S. to Take Illegal Alien Deportees",
    "description": "United States diplomats have reportedly reached out to several foreign countries about taking in illegal aliens being deported from the U.S., according to a report.\nThe post Report: Foreign Countries Asked by U.S. to Take Illegal Alien Deportees appeared firs…",
    "link": "https://www.breitbart.com/immigration/2025/06/27/rreport-foreign-countries-asked-by-u-s-to-take-illegal-alien-deportees/",
    "timestamp": "2025-06-28T02:56:43Z"
  },
  {
    "title": "Stefanik fires back at ‘worst governor in America’ after Hochul jabs on Medicaid cuts",
    "description": "Rep. Elise Stefanik is rumored to be planning a gubernatorial run in 2026 and called out Gov. Kathy Hochul as the \"worst governor in America.\"",
    "link": "https://nypost.com/2025/06/27/us-news/rep-elise-stefanik-rumored-for-gubernatorial-run-hits-back-against-hochul-worst-governor-in-america/",
    "timestamp": "2025-06-28T02:52:40Z"
  },
  {
    "title": "Marlow: Amy Coney Barrett’s ‘Haymakers’ Against Ketanji Brown Jackson ‘Have to Be Seen to Be Believed’",
    "description": "On Friday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow talked about the SCOTUS ruling on nationwide injunctions. Marlow said Justice Barrett, beyond writing the main opinion “came in with haymakers towards Ketanji Brown Jackson, the le…",
    "link": "https://www.breitbart.com/clips/2025/06/27/marlow-amy-coney-barretts-haymakers-against-ketanji-brown-jackson-have-to-be-seen-to-be-believed/",
    "timestamp": "2025-06-28T02:51:30Z"
  },
  {
    "title": "‘Last Remnant Of Democratic Resistance’: Charlie Kirk Warns ‘Biggest Fight’ Of Trump’s Presidency Awaits",
    "description": "Turning Point USA founder Charlie Kirk outlined on Fox News Friday what he believes will be \"biggest fight\" President Donald Trump will face in his second term.",
    "link": "https://dailycaller.com/2025/06/27/charlie-kirk-trump-biggest-fight/",
    "timestamp": "2025-06-28T02:44:06Z"
  },
  {
    "title": "SC rules in favor of Trump’s control on birthright citizenship",
    "description": "Washington, June 28: The Supreme Court on Friday handed a significant victory to Donald Trump – and future American presidents […]\nThe post SC rules in favor of Trump’s control on birthright citizenship appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/28/sc-rules-in-favor-of-trumps-control-on-birthright-citizenship/",
    "timestamp": "2025-06-28T02:40:00Z"
  },
  {
    "title": "The West waging ‘centuries-old war’ against Moscow – Russia’s top UN diplomat",
    "description": "The Ukraine conflict should be viewed as part of the West’s “centuries-old war” with Russia, Moscow’s senior diplomat says Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/620694-nebenzia-interview-rick-sanchez/",
    "timestamp": "2025-06-28T02:37:33Z"
  },
  {
    "title": "‘Not the Brag You Think It Is’: Jen Psaki Dunks on Trump Complaint About Courts Using His Own Words",
    "description": "Jen Psaki fact-checked Trump's claim about courts as true, using a clip of his presser to dunk on him for treating it like a \"brag\" instead of an indictment.\nThe post ‘Not the Brag You Think It Is’: Jen Psaki Dunks on Trump Complaint About Courts Using His Ow…",
    "link": "https://www.mediaite.com/media/tv/not-the-brag-you-think-it-is-jen-psaki-dunks-on-trump-complaint-about-courts-using-his-own-words/",
    "timestamp": "2025-06-28T02:27:57Z"
  },
  {
    "title": "Republican to Retire as Democrats Eye Potential House Seat: Reports",
    "description": "Nebraska Republican Don Bacon is set to announce his retirement on Monday, according to multiple news outlets.",
    "link": "https://www.newsweek.com/republican-retire-democrats-eye-potential-house-seat-reports-2091920",
    "timestamp": "2025-06-28T02:20:54Z"
  },
  {
    "title": "US Senate rejects bid to curb Trump's Iran war powers",
    "description": "The Senate, led by Republicans, dismissed a Democratic effort to curb President Trump's authority to use military force against Iran, despite Trump's consideration of further bombings. The resolution, requiring congressional approval for hostilities, failed i…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senate-rejects-bid-to-curb-trumps-iran-war-powers/articleshow/122122879.cms",
    "timestamp": "2025-06-28T02:11:08Z"
  },
  {
    "title": "Big Beautiful Bill AI provision unites an unexpected group of critics",
    "description": "Critics as varied as Marjorie Taylor Greene and the NAACP have come out against the rule, which would prevent states from passing AI regulations for 10 years.",
    "link": "https://www.nbcnews.com/tech/tech-news/big-beautiful-bill-ai-moratorium-ted-cruz-pass-vote-rcna215111",
    "timestamp": "2025-06-28T02:09:33Z"
  },
  {
    "title": "Iran warns of 'real capabilities' if Trump doesn't drop 'disrespectful' tone toward supreme leader",
    "description": "Iran’s foreign minister warned President Donald Trump to stop “hurting\" Khamenei and boasted Israel “ran to ‘Daddy’\" before Iran could unleash its “real capabilities.\"",
    "link": "https://www.foxnews.com/world/iran-warns-real-capabilities-trump-doesnt-drop-disrespectful-tone-toward-supreme-leader",
    "timestamp": "2025-06-28T02:07:52Z"
  },
  {
    "title": "Trump’s trade war comes for Nike sneakers: 'Major impact at the cash register'",
    "description": "Nike is warning that Donald Trump’s tariffs will soon cost U.S. consumers at the cash register, saying sneaker prices will jump this fall as the president’s trade war with China escalates. The sportswear giant said the tariffs could cost it $1 billion, and th…",
    "link": "https://www.rawstory.com/trump-tariff-2672488770/",
    "timestamp": "2025-06-28T02:01:13Z"
  },
  {
    "title": "WEEKEND: SENATE SET FOR BIG BEAUTIFUL VOTE",
    "description": "US President Donald Trump's signature domestic policy bill faced major roadblocks Friday, as his Republicans struggled to overcome differences and many of...",
    "link": "https://www.yahoo.com/news/republican-discord-threatens-trump-agenda-193540603.html",
    "timestamp": "2025-06-28T02:00:03Z"
  },
  {
    "title": "Diddy and Weinstein cases test the limits and legacy of #MeToo",
    "description": "Two cases in the New York courts have put the city's once-powerful movie and music moguls — and the #MeToo movement — under new scrutiny.",
    "link": "https://www.abc.net.au/news/2025-06-28/sean-diddy-combs-harvey-weinstein-me-too-movement/105386362",
    "timestamp": "2025-06-28T01:58:44Z"
  },
  {
    "title": "US, China announce a trade agreement — again. Here's what it means",
    "description": "The U.S. and China have reached an agreement — again — to deescalate trade tensions",
    "link": "https://abcnews.go.com/Business/wireStory/us-china-announce-trade-agreement-means-123288646",
    "timestamp": "2025-06-28T01:58:25Z"
  },
  {
    "title": "What's going on with U.S. inflation?",
    "description": "What is the U.S. inflation rate? Will the Federal Reserve cut interest rates? What did President Trump say about Fed Chairman Jerome Powell?",
    "link": "https://www.deseret.com/business/2025/06/27/us-inflation-interest-rates-income-consumer-spending-tariffs-donald-trump/",
    "timestamp": "2025-06-28T01:55:37Z"
  },
  {
    "title": "Indonesia proposes second best offer on reciprocal tariffs to US",
    "description": "Indonesia has proposed a second-best offer to the United States in an effort to negotiate on reciprocal tariffs imposed by President Donald Trump, ...",
    "link": "https://en.antaranews.com/news/362505/indonesia-proposes-second-best-offer-on-reciprocal-tariffs-to-us",
    "timestamp": "2025-06-28T01:55:14Z"
  },
  {
    "title": "Trump abruptly cuts off trade talks with Canada",
    "description": "The move plunges US-Canada relations back into chaos after a period of relative calm that included a cordial G7 meeting in mid-June where the countries' leaders agreed to wrap up a new economic agreement within 30 days.",
    "link": "https://www.abc.net.au/news/2025-06-28/trump-abruptly-cuts-off-trade-talks-with-canada/105472360",
    "timestamp": "2025-06-28T01:50:41Z"
  },
  {
    "title": "Republican Targeted By Trump Says He’s Getting ‘Private Fist Bumps’ from GOP, But Israel Still Has ‘Tight Grip on Congress’",
    "description": "Rep. Thomas Massie told The Daily Caller that he's getting private \"fist bumps\" from Republicans in his feud with Trump over Iran, aid for Israel.\nThe post Republican Targeted By Trump Says He’s Getting ‘Private Fist Bumps’ from GOP, But Israel Still Has ‘Tig…",
    "link": "https://www.mediaite.com/media/news/republican-targeted-by-trump-says-hes-getting-private-fist-bumps-from-gop-but-israel-still-has-tight-grip-on-congress/",
    "timestamp": "2025-06-28T01:46:59Z"
  },
  {
    "title": "'In business, indecision is killer' - Canadian firms seek certainty in tariff war",
    "description": "Intense US-Canada negotiations for a potential new trade and security deal have hit a snag ahead of a mid-July deadline.",
    "link": "https://www.bbc.com/news/articles/cj0mq6p60mqo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-28T01:43:32Z"
  },
  {
    "title": "'In business, indecision is killer' - Canadian firms seek certainty in tariff war",
    "description": "Intense US-Canada negotiations for a potential new trade and security deal have hit a snag ahead of a mid-July deadline.",
    "link": "https://www.bbc.com/news/articles/cj0mq6p60mqo",
    "timestamp": "2025-06-28T01:43:26Z"
  },
  {
    "title": "US stocks close at an all-time high Friday just months after plunging on tariff fears",
    "description": "U.S. stocks closed at an all-time high, another milestone in a remarkable recovery from a springtime plunge caused by fears that the Trump administration’s trade policies could harm the economy.",
    "link": "https://www.gmtoday.com/business/us-stocks-close-at-an-all-time-high-friday-just-months-after-plunging-on-tariff/article_d1b75f7e-4914-4568-a894-cbda5386766b.html",
    "timestamp": "2025-06-28T01:41:07Z"
  },
  {
    "title": "AXRP Episode 44 - Peter Salib on AI Rights for Human Safety",
    "description": "Published on June 28, 2025 1:40 AM GMTYouTube link\n\nIn this episode, I talk with Peter Salib about his paper “AI Rights for Human Safety”, arguing that giving AIs the right to contract, hold property, and sue people will reduce the risk of their trying to att…",
    "link": "https://www.lesswrong.com/posts/vHDowQtsiy2xK38H4/axrp-episode-44-peter-salib-on-ai-rights-for-human-safety",
    "timestamp": "2025-06-28T01:40:06Z"
  },
  {
    "title": "Trump’s ‘big beautiful bill’ could mean slower Wi-Fi for you",
    "description": "The Senate version of the budget reconciliation bill, backed by President Donald Trump, removes protections for unlicensed spectrum that broadens the capacity of the 6GHz Wi-Fi band. This could result in slower Wi-Fi speeds. Under the bill, which may be voted…",
    "link": "https://biztoc.com/x/c006f3bd5d8adb78",
    "timestamp": "2025-06-28T01:39:17Z"
  },
  {
    "title": "'Disrespectful, condemnable': Iran hits back at Donald Trump, asks if he’s 'genuine about a deal'",
    "description": "Iran’s foreign minister Abbas Araghchi has warned Donald Trump to change his “disrespectful and unacceptable” tone towards Supreme Leader Ayatollah Khamenei if the US wants nuclear talks. Trump claimed he saved Khamenei from an “ugly and ignominious death” du…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/disrespectful-condemnable-iran-hits-back-at-donald-trump-asks-if-hes-genuine-about-a-deal/articleshow/122122675.cms",
    "timestamp": "2025-06-28T01:38:09Z"
  },
  {
    "title": "Appeals court puts peace institute back in Trump administration hands with stay of lower court",
    "description": "A federal appeals court is staying a lower court ruling that blocked the Trump administration from moving forward with dismantling the U.S. Institute of Peace",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-puts-peace-institute-back-trump-administration-123289492",
    "timestamp": "2025-06-28T01:33:50Z"
  },
  {
    "title": "'Historically Successful' Strike on Iranian Nuclear Site Was 15 Years in the Making",
    "description": "This weekend's strike on Iran's Fordow Fuel Enrichment Plant used 30,000-pound GBU-57 \"massive ordnance penetrator\" bombs. The design of those weapons and plans for attacking the site had been in the works for some 15 years, which resulted in the destruction …",
    "link": "https://freerepublic.com/focus/f-news/4325742/posts",
    "timestamp": "2025-06-28T01:31:12Z"
  },
  {
    "title": "Gaza: Aid plan should not be 'death sentence,' UN chief says",
    "description": "\"It is killing people,\" UN chief Antonio Guterres told reporters about the controversial Israel and US-backed aid system in Gaza. The new effort bypasses the UN, which says hundreds seeking aid have been killed.",
    "link": "https://www.dw.com/en/gaza-aid-plan-should-not-be-death-sentence-un-chief-says/a-73074000",
    "timestamp": "2025-06-28T01:24:00Z"
  },
  {
    "title": "Senate rejects effort to restrain Trump on Iran as GOP backs his strikes on nuclear sites",
    "description": "Democratic efforts in the Senate to prevent President Donald Trump from further escalating with Iran have fallen short",
    "link": "https://abcnews.go.com/US/wireStory/senate-rejects-effort-restrain-trump-iran-gop-backs-123288644",
    "timestamp": "2025-06-28T01:18:14Z"
  }
]