[
  {
    "title": "Trump administration asks Supreme Court to partly allow birthright citizenship restrictions - NewsBreak",
    "description": "WASHINGTON (AP) — The Trump administration is asking the Supreme Court to allow restrictions on birthright citizenship to partly take effect while legal fi",
    "link": "https://www.newsbreak.com/news/3854677630025-trump-administration-asks-supreme-court-to-partly-allow-birthright-citizenship-restrictions?noAds=1&_f=app_share&s=i2",
    "timestamp": "2025-03-13T19:01:52Z"
  },
  {
    "title": "The price of eggs and ground beef hit an all-time high. Here’s how the cost of everyday consumer goods is shaking out under Trump",
    "description": "President Donald Trump has been in office a little under two months, but the economic landscape looks vastly different than it did last year. A trade war is heating up, the stock market has shown increasing volatility, fears of a recession are on the rise and…",
    "link": "https://biztoc.com/x/e0d71b78c95c61c0",
    "timestamp": "2025-03-13T19:01:16Z"
  },
  {
    "title": "Trump threatens tariffs on European wine and spirits in escalating trade war",
    "description": "WASHINGTON: US President Donald Trump on Thursday (Mar 13) threatened to slap a 200 percent tariff on wine, cognac and other alcohol imports from Europe, opening a new front in",
    "link": "https://www.channelnewsasia.com/world/trump-threatens-tariffs-european-wine-and-spirits-escalating-trade-war-4998396",
    "timestamp": "2025-03-13T19:01:15Z"
  },
  {
    "title": "The Right Might Be Making A Costly Error By Targeting Left-Wing Activist",
    "description": "The right is making a costly error in targeting a single activist for deportation and cheering on his arrest even though he has not been charged with any crime.",
    "link": "https://dailycaller.com/2025/03/13/columbia-university-mahmoud-khalil-arrest-ice-agents-trump-administration/",
    "timestamp": "2025-03-13T19:00:56Z"
  },
  {
    "title": "Trump asks Supreme Court to allow him to end birthright citizenship | CNN Politics",
    "description": "President Donald Trump’s administration asked the Supreme Court in a series of emergency appeals Thursday to allow him to move forward with plans to end birthright citizenship, elevating a fringe legal theory that several lower courts have resoundingly reject…",
    "link": "https://www.cnn.com/2025/03/13/politics/birthright-citizenship-trump-supreme-court/index.html",
    "timestamp": "2025-03-13T19:00:40Z"
  },
  {
    "title": "US multinationals will protect their Irish interests despite Trump pressure, says congressman",
    "description": "Long-serving Democrat Richard Neal says Micheál Martin’s visit to White House will be seen internationally as a victory for Ireland",
    "link": "https://www.irishtimes.com/business/economy/2025/03/13/us-multinationals-will-protect-their-irish-interests-despite-trump-pressure-says-congressman/",
    "timestamp": "2025-03-13T19:00:31Z"
  },
  {
    "title": "Kamala Campaign’s Latest Reported Scapegoat For Failure: Her Chair Height",
    "description": "Harris' campaign because obsessed with the height of her chair after she looked small during her first sit down interview, according to an excerpt.",
    "link": "https://dailycaller.com/2025/03/13/kamala-harris-campaign-chair-height-fight-inside-wildest-battle-white-house-jonathan-allen-amie-parnes/",
    "timestamp": "2025-03-13T18:59:46Z"
  },
  {
    "title": "Judge orders Trump administration to give fired workers their jobs back",
    "description": "A federal judge has ordered the rehiring of probationary workers terminated by the Trump administration.",
    "link": "https://www.bbc.com/news/articles/cgj5w052x3xo",
    "timestamp": "2025-03-13T18:58:41Z"
  },
  {
    "title": "Trump Delivers Update on Peace Negotiations With Russia",
    "description": "President Donald Trump said he’s getting word that conversations about a ceasefire between Ukraine and Russia are “going OK” in Moscow. Trump met with NATO... Read More\nThe post Trump Delivers Update on Peace Negotiations With Russia appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/03/13/trump-delivers-update-peace-negotiations-with-russia/",
    "timestamp": "2025-03-13T18:58:30Z"
  },
  {
    "title": "'Toasts Not Tariffs': Critics Slam Trump's Threat of 200% Levy on EU Alcohol Products",
    "description": "U.S. President Donald Trump on Thursday threatened to slap a 200% tariff on many alcohol products made in the European Union in retaliation for a 50% levy on American whiskey and bourbon recently announced by the 27-nation bloc's executive commission.\n\n\"The E…",
    "link": "https://www.commondreams.org/news/donald-trump-threatens-tariffs-against-european-union",
    "timestamp": "2025-03-13T18:58:23Z"
  },
  {
    "title": "Lord, What In the World Is Going On At The White House? Another Nominee Mishap.",
    "description": "Donald Trump’s political choices since winning the 2024 presidential election have been met with both controversy and confusion. Last November, he seemed determined to have Matt Gaetz serve as his attorney general, overseeing the Justice Department.Read more.…",
    "link": "https://www.theroot.com/lord-what-in-the-world-is-going-on-at-the-white-house-1851769762",
    "timestamp": "2025-03-13T18:57:24Z"
  },
  {
    "title": "All Eyes On Democrats As US Barrels Toward Shutdown Deadline",
    "description": "The US government, already shaken to its core by Donald Trump's radical reforms, could begin shutting down entirely at the weekend as Democrats face the stark option of opposing the president's federal funding plans -- even if it blows up in their faces.",
    "link": "https://www.ibtimes.com/all-eyes-democrats-us-barrels-toward-shutdown-deadline-3766207",
    "timestamp": "2025-03-13T18:57:16Z"
  },
  {
    "title": "Buttigieg won’t seek Michigan Senate seat, leaving door open for 2028 White House bid",
    "description": "Former Transportation Secretary Pete Buttigieg will not seek Michigan's open U.S. Senate seat in 2026.",
    "link": "https://www.pbs.org/newshour/politics/buttigieg-wont-seek-michigan-senate-seat-leaving-door-open-for-2028-white-house-bid",
    "timestamp": "2025-03-13T18:55:04Z"
  },
  {
    "title": "Arizona Billboard Blasts Trump and Musk: 'Screwing The American People'",
    "description": "On a highway in Arizona is a new billboard criticizing the Trump administration for \"screwing the American people.\"\nThe double-sided billboard, which is privately owned by activist and artist Beatrice Moore, depicts Elon Musk holding President Donald Trump as…",
    "link": "https://biztoc.com/x/fd503f00b0e2f54c",
    "timestamp": "2025-03-13T18:54:54Z"
  },
  {
    "title": "Watch: Actress Debra Winger Among Mob Who Stormed Trump Tower",
    "description": "Demonstrators from a Jewish group filled the lobby of Trump Tower on Thursday to denounce the immigration arrest of Mahmoud Khalil, a pro-Palestinian activist who helped lead protests against Israel at Columbia University.",
    "link": "https://www.breitbart.com/entertainment/2025/03/13/watch-actress-debra-winger-among-mob-who-stormed-trump-tower/",
    "timestamp": "2025-03-13T18:54:52Z"
  },
  {
    "title": "S&P 500 approaches correction territory as stagflation fears, Trump tariff threats shake markets",
    "description": "The economic chaos unleashed by President Donald Trump has put the S&P 500 on the cusp of correction territory.",
    "link": "https://www.nbcnews.com/business/markets/sp-500-approaches-correction-territory-stagflation-fears-trump-tariff-rcna196277",
    "timestamp": "2025-03-13T18:54:48Z"
  },
  {
    "title": "Tim Walz Says 'We Wouldn't Be In This Mess' If It Wasn't For Him And Harris",
    "description": "Ex-veep nominee Tim Walz slammed President Donald Trump for creating economic chaos on Wednesday ― but he also blamed himself and presidential nominee Kamala Harris in an MSNBC interview. Walz told host Chris Hayes that Trump was the “worst possible business …",
    "link": "https://freerepublic.com/focus/f-backroom/4304072/posts",
    "timestamp": "2025-03-13T18:53:47Z"
  },
  {
    "title": "How a British parliamentarian is supporting Canada amid U.S. tensions. It involves poutine",
    "description": "On Wednesday, Ed Davey asked U.K. PM if he would show the Canadian people 'that Britain stands with its Commonwealth allies against Trump’s threats and against Trump’s tariffs'",
    "link": "https://nationalpost.com/news/canada/british-politician-canada-amid-tension-u-s",
    "timestamp": "2025-03-13T18:53:28Z"
  },
  {
    "title": "Fox Anchor Cuts In To Defend Trump As James Carville Savages Him Over Tanking Stock Market",
    "description": "Martha MacCallum interrupted to defend Trump when Democratic strategist James Carville savaged the president over the cratering stock market.\nThe post Fox Anchor Cuts In To Defend Trump As James Carville Savages Him Over Tanking Stock Market first appeared on…",
    "link": "https://www.mediaite.com/news/fox-anchor-cuts-in-to-defend-trump-as-james-carville-savages-him-over-tanking-stock-market/",
    "timestamp": "2025-03-13T18:52:50Z"
  },
  {
    "title": "Trump Has Delusional Answer for Small Businesses Scared About Tariffs",
    "description": "Donald Trump can only point to big businesses as the potential benefactors of his trade war.\r\n“Many American small business owners say they are concerned that these tariffs are going to hurt them,” a reporter asked during a White House press conference Thursd…",
    "link": "https://newrepublic.com/post/192724/donald-trump-answer-small-businesses-tariffs",
    "timestamp": "2025-03-13T18:52:24Z"
  },
  {
    "title": "Arizona Billboard Blasts Trump and Musk: 'Screwing The American People'",
    "description": "A double-sided billboard in Arizona depicts Trump as Elon Musk's puppet the same week Trump used the White House to advertise Tesla cars.",
    "link": "https://www.newsweek.com/arizona-billboard-blasts-trump-musk-screwing-american-people-2044334",
    "timestamp": "2025-03-13T18:52:01Z"
  },
  {
    "title": "Fiscal Hawks Warn GOP Spending Plan Must Reject ‘Budget Gimmick’ That Could Add Trillions To Deficit",
    "description": "Conservative fiscal hawks are slamming an untested accounting tactic being pushed by some GOP lawmakers that would allow Congress to extend expiring tax cuts.",
    "link": "https://dailycaller.com/2025/03/13/fiscal-hawks-warn-gop-spending-plan-must-reject-budget-gimmick-could-add-trillions-deficit/",
    "timestamp": "2025-03-13T18:51:47Z"
  },
  {
    "title": "House Dem goes on screaming rant against Elon Musk, DOGE: 'Shame!'",
    "description": "Democratic Rep. John Larson of Connecticut shouted about Elon Musk and the Department of Government Efficiency during a House committee markup.",
    "link": "https://www.foxnews.com/politics/house-dem-goes-screaming-rant-against-elon-musk-doge-shame",
    "timestamp": "2025-03-13T18:51:25Z"
  },
  {
    "title": "'His biggest enemy': Analyst sees Trump falling into trap that dogged his last presidency",
    "description": "President Donald Trump is bleeding support from his own voters, Aaron Blake wrote in an analysis for The Washington Post Thursday — in a pattern very similar to how he sunk himself in his first term.Republicans, wrote Blake, \"appear to not want to just come o…",
    "link": "https://www.rawstory.com/trump-biggest-enemy/",
    "timestamp": "2025-03-13T18:51:05Z"
  },
  {
    "title": "Guilbeault expected to be shuffled out of post as Carney attempts break from Trudeau era",
    "description": "Mark Carney and his cabinet will be sworn in on Friday morning, marking the end of Justin Trudeau’s nine-year run as prime minister.",
    "link": "https://nationalpost.com/news/canada/guilbeault-expected-shuffled-out-of-post",
    "timestamp": "2025-03-13T18:50:05Z"
  },
  {
    "title": "King Charles gives his Canadian attendant a sword as sovereignty threats intensify",
    "description": "King Charles presented his Canadian personal attendant and messenger with a new ceremonial sword at Buckingham Palace on Wednesday, a symbolic gesture that carries added meaning as the country stares down U.S. President Donald Trump and his increasingly force…",
    "link": "https://www.cbc.ca/news/politics/king-charles-sword-canadian-attendant-1.7482738",
    "timestamp": "2025-03-13T18:50:04Z"
  },
  {
    "title": "Voters' Ratings On Economy And Trump Dip, Trade And Russia ... (Quinnipiac University Poll)",
    "description": "Quinnipiac University Poll:\nVoters' Ratings On Economy And Trump Dip, Trade And Russia - Ukraine War Weigh On Trump's Numbers, Quinnipiac University National Poll Finds; Majority Disapprove Of Trump's Handling Of Zelensky Meeting  — mail_outline  —  Seven wee…",
    "link": "https://www.memeorandum.com/250313/p108",
    "timestamp": "2025-03-13T18:50:04Z"
  },
  {
    "title": "FCC grills Google over alleged faith-based discrimination in YouTube TV programming",
    "description": "Google offices in Chelsea, Manhattan, New York. / Credit: MNAphotography/Shutterstock\n\nWashington, D.C. Newsroom, Mar 13, 2025 / 14:50 pm (CNA).\nThe Federal Communications Commission (FCC) is demanding answers from Google over concerns that its YouTube TV str…",
    "link": "https://www.catholicnewsagency.com/news/262721/fcc-grills-google-over-alleged-faith-based-discrimination-in-youtube-tv-programming",
    "timestamp": "2025-03-13T18:50:00Z"
  },
  {
    "title": "Elon Musk Makes Secret Visit to NSA After Saying Agency Needs ‘Overhaul’",
    "description": "The billionaire has previously suggested the NSA needs more straight white men.",
    "link": "https://gizmodo.com/elon-musk-makes-secret-visit-to-nsa-after-saying-agency-needs-overhaul-2000575741",
    "timestamp": "2025-03-13T18:49:33Z"
  },
  {
    "title": "In legislative maneuver, House GOP blocks Trump tariffs vote amid shutdown threat",
    "description": "House Republicans successfully blocked Democrats from forcing votes and debate on President Donald Trump's controversial tariffs.",
    "link": "https://abcnews.go.com/Politics/legislative-maneuver-house-republicans-block-vote-trump-tariffs/story?id=119758683",
    "timestamp": "2025-03-13T18:48:55Z"
  },
  {
    "title": "Germany’s Merz woos Greens with €50 billion climate package for defence vote",
    "description": "Greens also likely to push controversial bill to reform German abortion law",
    "link": "https://www.irishtimes.com/world/europe/2025/03/13/germanys-merz-woos-greens-with-50-billion-climate-package-for-defence-vote/",
    "timestamp": "2025-03-13T18:48:08Z"
  },
  {
    "title": "Vaccinating chickens could help egg prices but U.S. remains hesitant",
    "description": "Vaccines could be a key means of suppressing bird flu and avoiding the slaughter of millions of chickens, which is blamed for egg prices averaging nearly $5 a dozen.",
    "link": "https://www.pbs.org/newshour/nation/vaccinating-chickens-could-help-egg-prices-but-u-s-remains-hesitant",
    "timestamp": "2025-03-13T18:47:47Z"
  },
  {
    "title": "New York and other states sue Trump adminstration over 'dismantling' of the Department of Education",
    "description": "A group of Democratic attorneys general are suing the Trump administration over its attempts to dismantle the Department of Education.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-department-education-states-lawsuit-rcna196245",
    "timestamp": "2025-03-13T18:47:31Z"
  },
  {
    "title": "What is Kash Patel's net worth?",
    "description": "The FBI Director has a number of unique revenue streams",
    "link": "https://theweek.com/politics/kash-patel-net-worth-explained",
    "timestamp": "2025-03-13T18:47:17Z"
  },
  {
    "title": "'We've got options' on critical minerals, Labor warns US",
    "description": "Resources Minister Madeleine King says Australia has other buyers for critical minerals that interest Donald Trump, as the government continues \"tough\" tariff talks.",
    "link": "https://www.abc.net.au/news/2025-03-14/australia-warns-it-has-other-buyers-for-critical-minerals/105049424",
    "timestamp": "2025-03-13T18:47:14Z"
  },
  {
    "title": "Capital flight to safe haven? Investors shift billions from U.S. to Europe as Washington’s chaos fuels market anxiety",
    "description": "Investors are shifting billions from the US to Europe due to economic instability under Donald Trump. US stock markets are under pressure due to trade policy unpredictability. Europe is attracting investors with a unified stance on defense budgets and economi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/capital-flight-to-safe-haven-investors-shift-billions-from-u-s-to-europe-as-washingtons-chaos-fuels-market-anxiety/articleshow/118989843.cms",
    "timestamp": "2025-03-13T18:47:04Z"
  },
  {
    "title": "Dem heard screaming at colleagues despite Schumer’s unity claim as shutdown looms",
    "description": "Democrats in the Senate have different views on how they will vote on a Trump-backed bill to avert a government shutdown.",
    "link": "https://www.foxnews.com/politics/dem-heard-screaming-colleagues-despite-schumers-unity-claim-shutdown-looms",
    "timestamp": "2025-03-13T18:46:04Z"
  },
  {
    "title": "Dem divisions erupt over Trump spending bill to avoid shutdown, despite Schumer claim of unity",
    "description": "Democrats in the Senate have different views on how they will vote on a Trump-backed bill to avert a government shutdown.",
    "link": "https://www.foxnews.com/politics/dem-divisions-erupt-over-trump-spending-bill-avoid-shutdown-despite-schumer-claim-unity",
    "timestamp": "2025-03-13T18:46:04Z"
  },
  {
    "title": "Tulips and Bitcoin",
    "description": "Harlan Boyles is rolling over in his grave as some want the state retirement system to invest in crypto-mania.",
    "link": "https://www.ncspin.com/tulips-and-bitcoin",
    "timestamp": "2025-03-13T18:45:21Z"
  },
  {
    "title": "US Federal Judge Orders Agencies To Rehire Fired Workers",
    "description": "A US judge on Thursday ordered six federal agencies to rehire thousands of probationary workers fired as part of Donald Trump's push to slash the size and scope of government.",
    "link": "https://www.ibtimes.com/us-federal-judge-orders-agencies-rehire-fired-workers-3766205",
    "timestamp": "2025-03-13T18:45:13Z"
  },
  {
    "title": "Mahmoud Khalil and the motte and bailey of anti-Israel activism",
    "description": "Don't be fooled by the anti-Israel motte and bailey. They are part of the same defensive system held by a dishonest and radical actor that will not stop until they win.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-846009",
    "timestamp": "2025-03-13T18:45:01Z"
  },
  {
    "title": "Michelle Obama Admits This One Annoying Habit Bugs Her About Hubby Barack",
    "description": "Former First Lady Michelle Obama has never shied away from keeping it real when it comes to the ins and outs of her marriage to former President Barack Obama. And that’s why her latest interview spilling more details about him should come as no surprise...but…",
    "link": "https://www.theroot.com/michelle-obama-admits-this-one-annoying-habit-bugs-her-1851769755",
    "timestamp": "2025-03-13T18:45:00Z"
  },
  {
    "title": "Tariffs Raise Prices, Spark Conflicts, and Make Everyone Poorer",
    "description": "Back when conservatives championed ideas rather than outsourced their thinking to their leader, they touted a simple saying: \"Ideas have",
    "link": "https://reason.com/2025/03/14/tariffs-raise-prices-spark-conflicts-and-make-everyone-poorer/",
    "timestamp": "2025-03-13T18:44:33Z"
  },
  {
    "title": "Israel's decision to cut power to Gaza hits the strip's water supplies",
    "description": "A water desalination plant in central Gaza, which had been repaired just a few months ago, is now without power after Israel switched off supply to the strip.",
    "link": "https://www.abc.net.au/news/2025-03-14/israel-cuts-power-to-gaza-hits-water-supplies-hamas-ceasfire/105045700",
    "timestamp": "2025-03-13T18:44:16Z"
  },
  {
    "title": "US In Talks With NATO Ally to Reverse Russian Oil Import Ban: Report",
    "description": "European countries have broadly tried to wean themselves off a dependence on Russian oil in the more than three years since Moscow's invasion of Ukraine.",
    "link": "https://www.newsweek.com/us-germany-russia-oil-druzhba-pipeline-2044345",
    "timestamp": "2025-03-13T18:43:24Z"
  },
  {
    "title": "US federal judge orders agencies to rehire fired workers",
    "description": "A US judge on Thursday ordered six federal agencies to rehire thousands of probationary workers fired as part of Donald Trump’s push to slash the size and scope of government. The ruling is the latest judicial setback for the administration, coming on the hee…",
    "link": "https://www.digitaljournal.com/world/us-federal-judge-orders-agencies-to-rehire-fired-workers/article",
    "timestamp": "2025-03-13T18:43:13Z"
  },
  {
    "title": "Carville: Trump's Second Term 'Serious Crisis,' 'Entire Idea of the United States Is in Jeopardy’",
    "description": "Democratic strategist James Carville said Wednesday on \"The Chris Cuomo Project\" podcast that he believed President Donald Trump's second term is the most \"serious crisis\" the United States has ever faced.\nThe post Carville: Trump’s Second Term ‘Serious Crisi…",
    "link": "https://www.breitbart.com/clips/2025/03/13/carville-trumps-second-term-serious-crisis-entire-idea-of-the-united-states-is-in-jeopardy/",
    "timestamp": "2025-03-13T18:43:12Z"
  },
  {
    "title": "The Risk to Travel if There's a U.S. Government Shutdown",
    "description": "Risks to travel are minimal if a government shutdown is short, but the longer it grows on, the more disruption in the industry can take hold. -Jade Wilson and Meghna Maharishi",
    "link": "http://skift.com/2025/03/13/the-risk-to-travel-if-theres-a-u-s-government-shutdown/",
    "timestamp": "2025-03-13T18:42:52Z"
  },
  {
    "title": "Susan Crawford's Chances of Beating Brad Schimel in Wisconsin: Polls",
    "description": "Wisconsin voters will elect a new Supreme Court justice in April.",
    "link": "https://www.newsweek.com/susan-crawfords-chances-beating-brad-schimel-wisconsin-polls-2044399",
    "timestamp": "2025-03-13T18:42:21Z"
  },
  {
    "title": "'GOP delivered': John Fetterman caves and will vote for 'flawed' Republican spending bill",
    "description": "Sen. John Fetterman (D-PA) pledged to support a Republican spending bill even though he admitted it was \"flawed.\"\"The only time we had any leverage … [was if] the Republican needed our votes in the House,\" Fetterman said, according to Jake Sherman of Punchbow…",
    "link": "https://www.rawstory.com/john-fetterman-spending-bill/",
    "timestamp": "2025-03-13T18:42:08Z"
  },
  {
    "title": "Binance Founder Refutes WSJ Reports of Trump Plans To Buy Stake in US Arm of the World’s Largest Crypto Exchange",
    "description": "Former Binance CEO Changpeng Zhao is pushing back on a Wall Street Journal report that Donald Trump has held talks with Binance to buy a stake in Binance.US. Earlier today, the WSJ reported that the Binance founder “pushed” for the Trump administration to par…",
    "link": "https://dailyhodl.com/2025/03/13/binance-founder-refutes-wsj-reports-of-trump-plans-to-buy-stake-in-us-arm-of-the-worlds-largest-crypto-exchange/",
    "timestamp": "2025-03-13T18:41:41Z"
  },
  {
    "title": "Could Low-Wage White Workers Spark Trump’s Undoing?",
    "description": "With time, the resistance movement against Trump’s dangerous agenda will grow to include low-wage white workers, a third of whom live in the South and were perhaps initially pro-Trump, according to a prediction from Bishop William Barber II.\n“The only way a k…",
    "link": "https://msmagazine.com/2025/03/13/low-wage-white-workers-trump-medicaid-cuts-resistance/",
    "timestamp": "2025-03-13T18:40:59Z"
  },
  {
    "title": "BREAKING: Jewish Protestors Storm Trump Tower",
    "description": "VIDEOS AT LINK...................... Demonstrators from the group, Jewish Voice for Peace, protest inside Trump Tower in support of Columbia graduate student Mahmoud Khalil, Thursday, March 13, 2025, in New York. (AP Photo/Yuki Iwamura) ======================…",
    "link": "https://freerepublic.com/focus/f-news/4304065/posts",
    "timestamp": "2025-03-13T18:40:56Z"
  },
  {
    "title": "Elon Musk, Who Promised To Be 'Maximally Transparent,' Makes DOGE's Numbers Even Harder To Check",
    "description": "\"We will make mistakes,\" Elon Musk said at a press conference a month ago. \"Some of the things that I say will be incorrect and should be corrected.\" The",
    "link": "https://reason.com/2025/03/13/elon-musk-who-promised-to-be-maximally-transparent-makes-doges-numbers-even-harder-to-check/",
    "timestamp": "2025-03-13T18:40:42Z"
  },
  {
    "title": "Donald Trump wants to end this Republican maverick's career, but the lawmaker is not too worried; here's why the president is going after him",
    "description": "Rep. Thomas Massie faces renewed opposition from Donald Trump for refusing to support a Trump-backed spending bill. Despite Trump's threats and past attempts to unseat him, Massie remains unconcerned, confident that the backlash will fade as it did in 2020. T…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-wants-to-end-this-republican-mavericks-career-but-the-lawmaker-is-not-too-worried-heres-why-the-president-is-going-after-him/articleshow/118990920.cms",
    "timestamp": "2025-03-13T18:40:31Z"
  },
  {
    "title": "Stein’s State of the State calls for faster Helene relief, better pay for teachers, law enforcement",
    "description": "Gov. Josh Stein’s first speech to the General Assembly urged enactment of a school cell phone ban, free community college for some students, and the establishment of a new fentanyl enforcement unit.",
    "link": "https://www.ncspin.com/steins-state-of-the-state-calls-for-faster-helene-relief-better-pay-for-teachers-law-enforcement",
    "timestamp": "2025-03-13T18:40:00Z"
  },
  {
    "title": "Major Social Security Changes in March 2025—And How It Affects You",
    "description": "Learn about the sweeping changes to Social Security in March 2025, from major policy reforms impacting millions to heightened enforcement measures.",
    "link": "https://www.newsweek.com/social-security-changes-march-2025-2044324",
    "timestamp": "2025-03-13T18:39:54Z"
  },
  {
    "title": "Report: Chuck Schumer Prepares to Cave on Government Funding, Only Talked Tough 'to Save Face'",
    "description": "Senate Democrats have boxed themselves into a corner, and Minority Leader Chuck Schumer (D-NY) is trying to slip out.\nThe post Report: Chuck Schumer Prepares to Cave on Government Funding, Only Talked Tough ‘to Save Face’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/13/report-chuck-schumer-prepares-to-cave-on-government-funding-only-talked-tough-to-save-face/",
    "timestamp": "2025-03-13T18:39:52Z"
  },
  {
    "title": "Chart Shows 2025 Egg Price Surge Wiped Out In Single Week",
    "description": "Egg prices have skyrocketed to historic levels over the past year.",
    "link": "https://www.newsweek.com/2025-eggs-prices-per-dozen-economy-donald-trump-2044401",
    "timestamp": "2025-03-13T18:39:43Z"
  },
  {
    "title": "Trump remains optimistic about odds of acquiring Greenland: 'I think it'll happen'",
    "description": "President Donald Trump’s remarks coincide with a visit from NATO Secretary General Mark Rutte, who said that he didn’t want to “drag NATO\" into the conversation.",
    "link": "https://www.foxnews.com/politics/trump-remains-optimistic-about-odds-acquiring-greenland-i-think-itll-happen",
    "timestamp": "2025-03-13T18:38:48Z"
  },
  {
    "title": "America and the EU are drifting apart – Moscow is watching",
    "description": "Washington is turning away from its European allies. What does this mean for Russia? Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614172-america-and-eu-are-drifting-apart/",
    "timestamp": "2025-03-13T18:38:43Z"
  },
  {
    "title": "Stora protester – här ockuperar de Trump Tower",
    "description": "Se när hundratals demonstranter intar Donald Trumps hotell i New York",
    "link": "https://www.expressen.se/tv/nyheter/varlden/stora-protester-har-ockuperar-de-trump-tower/",
    "timestamp": "2025-03-13T18:38:33Z"
  },
  {
    "title": "'Bizarre': Transgender congresswoman slams Republicans for 'weird' obsession",
    "description": "U.S. Rep. Sarah McBride (D-DE) is calling out House Republicans for their “weird” and “bizarre” fixation on culture war issues — and particularly their obsession with her. As the first openly transgender member of Congress and the highest-ranking transgender …",
    "link": "https://www.rawstory.com/bizarre-transgender-congresswoman-slams-republicans-for-weird-obsession/",
    "timestamp": "2025-03-13T18:38:26Z"
  },
  {
    "title": "Trump Jokingly Proposes Deporting Drug Dealers to NATO Secretary General’s Home Country During White House Meeting",
    "description": "Presdient Donald Trump jokingly proposed deporting drug dealers to NATO Secretary General Mark Rutte’s native country on Thursday as the pair spoke to reporters from the White House. Trump told Rutte he would have no issue sending “some nice people to the Net…",
    "link": "https://www.mediaite.com/tv/trump-jokingly-proposes-deporting-drug-dealers-to-nato-secretary-generals-home-country-during-white-house-meeting/",
    "timestamp": "2025-03-13T18:36:54Z"
  },
  {
    "title": "Algoma Steel foresees challenges, opportunity from trade war as it works to cut costs",
    "description": "The chief executive of one of Canada’s largest steel producers says the company is in discussions with federal and provincial leaders to determine what government support might be available to help offset the Trump administration’s tariffs. Algoma Steel Group…",
    "link": "https://financialpost.com/pmn/algoma-steel-foresees-challenges-opportunity-from-trade-war-as-it-works-to-cut-costs",
    "timestamp": "2025-03-13T18:35:58Z"
  },
  {
    "title": "‘Don’t hesitate to pick up the phone’ – Donald Trump tells Taoiseach in private White House chat",
    "description": "What did the two men talk about privately? Peace and reconciliation, says Micheál Martin.",
    "link": "https://www.thejournal.ie/dont-hesitate-to-pick-up-the-phone-trump-tells-micheal-6649204-Mar2025/",
    "timestamp": "2025-03-13T18:34:04Z"
  },
  {
    "title": "Russian and European Officials See US Interest in Gazprom Ties",
    "description": "Russian and European officials say the US is exploring ways to work with energy giant Gazprom PJSC on global projects, a step toward forging closer ties with the Kremlin while trying to broker a peace deal on Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/russian-and-european-officials-see-us-interest-in-gazprom-ties",
    "timestamp": "2025-03-13T18:33:56Z"
  },
  {
    "title": "FACT CHECK: No, There Are Not Banners Featuring Trump’s Image Currently Hanging At The Kennedy Center",
    "description": "A viral screenshot shared on X purports  to show banners with President Donald Trump’s image currently hanging at the Kennedy Center. Can’t wait till we tear this down one day. Waste of taxpayer money. pic.twitter.com/HaklLbyBnU — James Tate (@JamesTate121) M…",
    "link": "https://checkyourfact.com/2025/03/13/fact-check-no-banners-trumps-image-hanging-kennedy-center/",
    "timestamp": "2025-03-13T18:33:43Z"
  },
  {
    "title": "Trump Considers Using The Military To Take Over The Panama Canal",
    "description": "U.S. Southern Command is apparently developing potential plans that vary from partnering more closely with the Panamanians to seizing the Canal by force.",
    "link": "https://www.jalopnik.com/1810540/trump-take-panama-canal-military-options/",
    "timestamp": "2025-03-13T18:33:18Z"
  },
  {
    "title": "Money Talks: Why foreign aid needs an overhaul",
    "description": "Why foreign aid needs an overhaul\nOur podcast on markets, the economy and business. This week, as the Trump administration slashes USAID, we consider how development aid should be spent\nAt the end of January, Donald Trump’s administration announced that all w…",
    "link": "https://biztoc.com/x/caa4eefd0514f5c9",
    "timestamp": "2025-03-13T18:32:59Z"
  },
  {
    "title": "Russia’s Putin backs idea of Ukraine ceasefire, but voices doubts",
    "description": "Russian president indicates insists on guarantees for a long-lasting peace to address root causes of conflict.",
    "link": "https://www.aljazeera.com/news/2025/3/13/russias-putin-backs-idea-of-ukraine-ceasefire-but-voices-doubts",
    "timestamp": "2025-03-13T18:32:58Z"
  },
  {
    "title": "Clinton judge orders thousands of fired employees to be returned to jobs",
    "description": "Claims dismissals by Trump administration was 'a sad day'",
    "link": "https://www.wnd.com/2025/03/clinton-judge-orders-thousands-of-fired-employees-to-be-returned-to-jobs/",
    "timestamp": "2025-03-13T18:31:10Z"
  },
  {
    "title": "The state and local tax deduction could change amid Trump's tax cuts debate. Here's what to know.",
    "description": "As lawmakers debate President Donald Trump’s tax cuts, a key deduction could become a sticking point in 2025 tax negotiations, policy experts say.",
    "link": "https://www.nbcnews.com/business/personal-finance/state-local-tax-deduction-change-trumps-tax-cuts-debate-know-rcna196307",
    "timestamp": "2025-03-13T18:31:04Z"
  },
  {
    "title": "What Cancellation Of Big Bird Tells Us About The State Of Our Public Good",
    "description": "The cancellation of Big Bird and co. would be a loss, but there’s something bigger going on. Sesame Street’s fate is symptomatic of a larger shift in how corporations, governments, and, increasingly, citizens have lost faith in the spirit of solidarity that m…",
    "link": "https://thewalrus.ca/death-of-big-bird/",
    "timestamp": "2025-03-13T18:31:00Z"
  },
  {
    "title": "U.S. aid cuts hit Ethiopia’s fragile Tigray region",
    "description": "Aid agencies distributing U.S. food aid in Ethiopia's war-affected Tigray region say they have had to stop feeding millions of people because of the Trump administration's restrictions on foreign aid.",
    "link": "https://www.pbs.org/newshour/world/u-s-aid-cuts-hit-ethiopias-fragile-tigray-region",
    "timestamp": "2025-03-13T18:30:54Z"
  },
  {
    "title": "Trump's Threatened 200 Percent Tariffs on European Booze Are His Least Sensible Trade Move Yet",
    "description": "President Donald Trump's trade war is spilling across the Atlantic, and his latest tariff threats might be the least defensible yet. \nIn a Thursday morning post on Truth Social, Trump threatened to slap \"a 200 percent tariff on all wines, Champagnes, & alcoho…",
    "link": "https://biztoc.com/x/6baef57078a624a4",
    "timestamp": "2025-03-13T18:30:29Z"
  },
  {
    "title": "Escalation With Panama Exposes Finance Firms’ Role in US Rivalry With China",
    "description": "As Trump orders the military to look at “reclaiming” the canal, companies like BlackRock stand to profit.",
    "link": "https://truthout.org/articles/escalation-with-panama-exposes-finance-firms-role-in-us-rivalry-with-china/",
    "timestamp": "2025-03-13T18:30:27Z"
  },
  {
    "title": "Crypto regulation shifts as Bitcoin eyes $105K amid liquidity boost",
    "description": "Bitcoin (BTC) price has risen 8% from its March 11 low of $76,703, driven in part by large investors aggressively buying the dip with leverage. Margin longs on Bitfinex surged to their highest level since November 2024, adding 13,787 BTC over 17 days. Current…",
    "link": "https://cointelegraph.com/news/crypto-regulation-shifts-as-bitcoin-eyes-105-k-amid-liquidity-boost",
    "timestamp": "2025-03-13T18:30:00Z"
  },
  {
    "title": "Whoopi Goldberg hits back at haters who want 'The View' to be canceled",
    "description": "Whoopi Goldberg has hit back at haters who want 'The View' to be taken 'off television' over the cohosts' politics: 'We don't tell you what to think,' Goldberg said.",
    "link": "https://ew.com/whoopi-goldberg-view-haters-politics-11696190",
    "timestamp": "2025-03-13T18:30:00Z"
  },
  {
    "title": "Stocks Tumble Into Correction as Trump Policies Roil Sentiment",
    "description": "US stocks resumed a three-week selloff Thursday, with the S&P 500 again falling 10% from its all-time high on renewed worries that tariffs will destabilize the American economy.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-tumble-into-correction-as-trump-policies-roil-sentiment",
    "timestamp": "2025-03-13T18:28:43Z"
  },
  {
    "title": "Donald Trump makes new Greenland threat after revealing plans to take country ‘one way or another’",
    "description": "We regret to inform you that Donald Trump is at it again over Greenland as he's made a new threat",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-greenland-news-latest-523594-20250313",
    "timestamp": "2025-03-13T18:28:38Z"
  },
  {
    "title": "‘New Nostradamus’ made a chilling prediction — just days before it came true this week",
    "description": "The oracle revealed his prescient prophecy in a March 4 YouTube video.",
    "link": "https://nypost.com/2025/03/13/lifestyle/new-nostradamus-made-a-chilling-prediction-just-days-before-it-came-true-this-week/",
    "timestamp": "2025-03-13T18:28:15Z"
  },
  {
    "title": "Canada is a sovereign state: Trump's pick for ambassador to Canada Pete Hoekstra",
    "description": "When asked whether a \"joke\" about annexation is ever appropriate, Hoekstra said he could not comment on the president's relationship with Prime Minister Justin Trudeau, which was notably rocky during the first Trump administration.",
    "link": "https://www.nationalobserver.com/2025/03/13/news/canada-sovereign-state-trump-ambassador-canada-pete-hoekstra",
    "timestamp": "2025-03-13T18:28:05Z"
  },
  {
    "title": "Elon Musk's Grok AI Determines Which Political Party Has Performed Better for the Economy",
    "description": "Elon Musk's \"anti-woke\" AI chatbot Grok is now, apparently a Democratic operative. That's our takeaway, at least, from Grok's response to progressive activist Alex Cole after he tagged the chatbot on X and asked it whether Republicans or Democrats were \"bette…",
    "link": "https://futurism.com/elon-musk-grok-economy-party",
    "timestamp": "2025-03-13T18:27:53Z"
  },
  {
    "title": "BC Hydro bans Tesla from charger rebate program",
    "description": "BC Hydro says Tesla products have been removed from its electric vehicle rebate program as part of the fight against U.S. tariffs. Read more",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/bc-hydro-bans-tesla-charger-rebate-program",
    "timestamp": "2025-03-13T18:27:40Z"
  },
  {
    "title": "Binance Co-Founder Reacts to Report of Possible Deal with Trump Family",
    "description": "Binance co-founder Changpeng Zhao wrote on social media platform X about a Wall Street Journal report that the Trump family is exploring a deal.",
    "link": "https://www.newsweek.com/binance-cofounder-reacts-report-possible-deal-trump-family-2044378",
    "timestamp": "2025-03-13T18:27:14Z"
  },
  {
    "title": "Alex Jones Blames 'Globalists' After Infowars Writer Killed During Car Burglary",
    "description": "Jamie White, 36, was fatally shot in a parking lot in Austin, Texas, police said. Alex Jones said the killing \"could've been a hit.\"",
    "link": "https://www.huffpost.com/entry/alex-jones-spins-conspiracies-after-infowars-worker-killed-during-car-burglary_n_67d30963e4b09ccf129cf02f",
    "timestamp": "2025-03-13T18:26:55Z"
  },
  {
    "title": "Can the US pry Russia away from China?",
    "description": "Western politicians have repeatedly called on China to limit or cease tacit support for Russia’s bloody war against Ukraine. In response, China’s leadership insists it is committed to peace and respect for the territorial integrity of other nations.\nBut unlik…",
    "link": "https://www.voanews.com/a/can-the-us-pry-russia-away-from-china/8009771.html",
    "timestamp": "2025-03-13T18:26:15Z"
  },
  {
    "title": "Steven Soderbergh on Directing ‘Black Bag,’ a Possible ‘Contagion’ Sequel and How Donald Trump Made Him Rethink Political Movies",
    "description": "Steven Soderbergh and David Koepp had a very offbeat idea for their next movie. “David and I talked about what it would be like if George and Martha were spies,” Soderbergh says. “We wanted to make an espionage version of ‘Who’s Afraid of Virginia Woolf.'” Th…",
    "link": "https://variety.com/2025/film/news/steven-soderbergh-black-bag-contagion-sequel-1236335127/",
    "timestamp": "2025-03-13T18:25:35Z"
  },
  {
    "title": "Here’s Where Trump’s Government Layoffs Are Targeted—As Judge Orders Reinstatement Of Thousands Of Fired Workers",
    "description": "The Trump administration has laid off thousands amid cost-cutting efforts.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/13/heres-where-trumps-government-layoffs-are-targeted-as-judge-orders-reinstatement-of-thousands-of-fired-workers/",
    "timestamp": "2025-03-13T18:21:40Z"
  },
  {
    "title": "Joan Baez Sends A Message To 'Incompetent Billionaires'",
    "description": "The folk legend said \"democracy is going up in flames\" during an appearance on Netflix's new show, \"Everybody’s Live With John Mulaney.\"",
    "link": "https://www.huffpost.com/entry/joan-baez-incompetent-billionaires-democracy-in-flames_n_67d300a9e4b04fc45c1df873",
    "timestamp": "2025-03-13T18:21:37Z"
  },
  {
    "title": "Walmart faces Chinese heat after demand for price cuts",
    "description": "Chinese authorities summoned Walmart executives to discuss alleged demands for major price reductions from suppliers due to increased US tariffs. Beijing warned Walmart against such actions, which could damage the global supply chain and harm both US and Chin…",
    "link": "https://economictimes.indiatimes.com/news/international/business/walmart-faces-chinese-heat-after-demand-for-price-cuts/articleshow/118990445.cms",
    "timestamp": "2025-03-13T18:20:50Z"
  },
  {
    "title": "Fan Brought Receipts for Trump National Doral's $1,000 Asking Price",
    "description": "The incredible amount you have to pay to play at Donald Trump's star course has shocked golf fans across social platforms.",
    "link": "https://www.newsweek.com/sports/golf/trump-national-doral-1000-asking-price-receipt-2044306",
    "timestamp": "2025-03-13T18:20:26Z"
  },
  {
    "title": "The White Lotus and Love Is Blind Are the First Big Shows to Tackle Trump 2.0",
    "description": "Though the most recent seasons of both series were filmed before his re-election, they’ve broken the ice on confronting our uncomfortable new reality under Donald Trump’s second term.",
    "link": "https://www.vanityfair.com/hollywood/story/the-white-lotus-and-love-is-blind-are-the-first-big-shows-to-tackle-trump-20",
    "timestamp": "2025-03-13T18:18:51Z"
  },
  {
    "title": "New Brunswick Premier Susan Holt says cutting power to Maine unlikely but still possible",
    "description": "Holt made the comment today during the first of weekly briefings aimed at keeping New Brunswickers informed about the province's response to the economic and emotional fallout from the tariffs imposed by U.S. President Donald Trump.",
    "link": "https://www.nationalobserver.com/2025/03/13/news/new-brunswick-premier-susan-holt-power-maine",
    "timestamp": "2025-03-13T18:18:06Z"
  },
  {
    "title": "Trump Set to Invoke the Alien Enemies Act of 1798 for the Fourth Time in US History: Report",
    "description": "President Donald Trump is plannnig to dust off a 1798 law to speed up deportations of illegal immigrants, a new report says.",
    "link": "https://www.westernjournal.com/donald-trump-set-invoke-alien-enemies-act-1798-fourth-time-us-history-report/",
    "timestamp": "2025-03-13T18:17:35Z"
  }
]