[
  {
    "title": "Five Reasons Donald Trump Fell For Zohran Mamdani",
    "description": "Anyone expecting fireworks when New York City's mayor-elect met with the president was disappointed Friday—unless they were hoping for an explosion of love.",
    "link": "https://www.vanityfair.com/news/story/zohran-mamdani-donald-trump-oval-office-white-house-meeting",
    "timestamp": "2025-11-22T20:07:07Z"
  },
  {
    "title": "Israel launches strikes in Gaza ceasefire’s latest test as hospitals say 24 people killed",
    "description": "Israel’s military on Saturday launched airstrikes against Hamas militants in Gaza in the latest test of the ceasefire that began on Oct. 10, as Prime Minister Benjamin Netanyahu's office said five senior Hamas members were killed. Health officials in Gaza rep…",
    "link": "https://www.pbs.org/newshour/world/israel-launches-strikes-in-gaza-ceasefires-latest-test-as-hospitals-say-24-people-killed",
    "timestamp": "2025-11-22T20:06:12Z"
  },
  {
    "title": "How Did Zohran Mamdani Charm Trump?",
    "description": "Watching the press conference that followed NYC Mayor-elect Zohran Mamdani’s meeting with Trump felt like stepping into an alternate universe. Before they met, Mamdani called Trump names and promised to “Trumpproof” the city. Trump called Mamdani a “radical l…",
    "link": "https://dianeravitch.net/2025/11/22/how-did-zohran-mamdani-charm-trump/",
    "timestamp": "2025-11-22T20:00:00Z"
  },
  {
    "title": "Nursing is no longer counted as a 'professional degree' by Trump admin",
    "description": "The Department of Education has excluded nursing as a “professional degree” program as it sets about implementing various measures regarding student loans laid out in President Donald Trump’s “One Big Beautiful Bill.” The move has sparked significant uproar a…",
    "link": "https://freerepublic.com/focus/f-news/4354053/posts",
    "timestamp": "2025-11-22T19:59:37Z"
  },
  {
    "title": "Trump teaming up with Jack Nicklaus to revamp 'president's golf course' at Joint Base Andrews",
    "description": "President Donald Trump says he's teaming up with legendary golfer Jack Nicklaus to revamp the golf courses at Joint Base Andrews",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-teaming-jack-nicklaus-revamp-presidents-golf-joint-127787087",
    "timestamp": "2025-11-22T19:57:38Z"
  },
  {
    "title": "‘You Don’t Change The Rules If You Didn’t Win’: John Fetterman Smacks Down James Carville’s Call for Dems to Pack Supreme Court",
    "description": "Sen. John Fetterman (D-PA) said he \"strongly\" rejects James Carville's desire to pack the Supreme Court, along with his push to add two new states to the union\nThe post ‘You Don’t Change The Rules If You Didn’t Win’: John Fetterman Smacks Down James Carville’…",
    "link": "https://www.mediaite.com/media/news/you-dont-change-the-rules-if-you-didnt-win-john-fetterman-smacks-down-james-carvilles-call-for-dems-to-pack-supreme-court/",
    "timestamp": "2025-11-22T19:57:37Z"
  },
  {
    "title": "2 UAB players allegedly stabbed by teammate ahead of game against South Florida",
    "description": "UAB said Saturday that two players were injured in an alleged stabbing ahead of the team's game against South Florida. The players, who were not named by the school, were allegedly stabbed at the football facility by a teammate. The player who allegedly commi…",
    "link": "https://freerepublic.com/focus/f-news/4354052/posts",
    "timestamp": "2025-11-22T19:55:45Z"
  },
  {
    "title": "The Party of Billionaires",
    "description": "Is who it always is, but not who the political press has generally told you it is: New York City billionaire John Catsimatidis has long been immersed in politics. But last year the Republican real estate and oil tycoon donated more money than he ever had befo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/the-party-of-billionaires",
    "timestamp": "2025-11-22T19:49:45Z"
  },
  {
    "title": "South Park Season 28 Episode 4 release date, time and how to watch in US and globally: When will new episode air? Here's release schedule and what to expect",
    "description": "South Park Season 28 Episode 4 release date, time and how to watch details are confirmed for viewers. The episode will air on Comedy Central on November 26 and stream on Paramount+ on November 27. The schedule follows the bi-weekly release pattern of the seri…",
    "link": "https://economictimes.indiatimes.com/news/international/us/south-park-season-28-episode-4-release-date-time-and-how-to-watch-in-us-and-globally-when-will-new-episode-air-heres-release-schedule-and-what-to-expect-animated-series-comedy-central-paramount-stream/articleshow/125511207.cms",
    "timestamp": "2025-11-22T19:49:00Z"
  },
  {
    "title": "Exclusive — Jenn Pellegrino on Trump Meeting Zohran Mamdani: Middle Ground Comes Down to Common Sense",
    "description": "Finding middle ground with the left comes down to common sense, Jenn Pellegrino, Executive Director of Defend Forgotten America, said during an appearance on Breitbart News Saturday.\nThe post Exclusive — Jenn Pellegrino on Trump Meeting Zohran Mamdani: Middle…",
    "link": "https://www.breitbart.com/radio/2025/11/22/exclusive-jenn-pellegrino-on-trump-meeting-zohran-mamdani-middle-ground-comes-down-to-common-sense/",
    "timestamp": "2025-11-22T19:48:40Z"
  },
  {
    "title": "Exclusive – Jenn Pellegrino: Defend Forgotten America Aims to Extend MAGA Movement Beyond Trump's Second Term",
    "description": "The MAGA movement needs to keep going beyond President Donald Trump's administration, Jenn Pellegrino said, and Defend Forgotten America aims to do that.\nThe post Exclusive – Jenn Pellegrino: Defend Forgotten America Aims to Extend MAGA Movement Beyond Trump’…",
    "link": "https://www.breitbart.com/radio/2025/11/22/exclusive-jenn-pellegrino-defend-forgotten-america-aims-extend-maga-movement-beyond-trumps-second-term/",
    "timestamp": "2025-11-22T19:48:14Z"
  },
  {
    "title": "WATCH: Trump says U.S. peace plan not his final offer to Ukraine’s Zelenskyy",
    "description": "Ukraine’s Western allies rallied around the war-torn country on Saturday as they pushed to revise a U.S. peace plan seen as favoring Moscow despite its all-out invasion of its neighbor. Speaking to reporters outside the White House on Saturday, President Dona…",
    "link": "https://biztoc.com/x/b5c8b9dd28d63392",
    "timestamp": "2025-11-22T19:47:09Z"
  },
  {
    "title": "Trump Teaming Up With Legendary Golfer To Revamp 'President's Golf Course' At Joint Base Andrews",
    "description": "The potential Andrews redesign follows construction crews already having demolished the East Wing of the White House to make room for a $300 million ballroom.",
    "link": "https://www.huffpost.com/entry/trump-teaming-up-legendary-golfer-to-revamp-presidents-golf-course-joint-base-andrews_n_69220fade4b0d31c0a7aaaca",
    "timestamp": "2025-11-22T19:39:52Z"
  },
  {
    "title": "Trump isolated at G20 with world leaders uniting behind joint declaration",
    "description": "US President Donald Trump was the only G20 member to boycott the summit in South Africa.",
    "link": "https://www.abc.net.au/news/2025-11-23/g20-defies-trump-with-leaders-jointly-signing-statement/106041342",
    "timestamp": "2025-11-22T19:39:25Z"
  },
  {
    "title": "Trump isolated at G20 as world leaders unite behind Paris agreement",
    "description": "US President Donald Trump was the only G20 member to boycott the summit in South Africa.",
    "link": "https://www.abc.net.au/news/2025-11-23/g20-defies-trump-with-leaders-jointly-signing-statement-endorsin/106041342",
    "timestamp": "2025-11-22T19:39:25Z"
  },
  {
    "title": "WATCH: Trump says U.S. peace plan not his final offer to Ukraine’s Zelenskyy",
    "description": "Ukraine’s Western allies rallied around the war-torn country on Saturday as they pushed to revise a U.S. peace plan seen as favoring Moscow despite its all-out invasion of its neighbor. Speaking to reporters outside the White House on Saturday, President Dona…",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-says-u-s-peace-plan-not-his-final-offer-to-ukraines-zelenskyy",
    "timestamp": "2025-11-22T19:39:20Z"
  },
  {
    "title": "How Zohran Mamdani won over Donald Trump — for now",
    "description": "In a triumphant election-night speech earlier this month, New York City Mayor-elect Zohran Mamdani addressed Donald Trump directly, telling the president to “Turn the volume up.” Trump has repeatedly called Mamdani a “Communist” and questioned his citizenship…",
    "link": "https://biztoc.com/x/5df854fccb405d0f",
    "timestamp": "2025-11-22T19:36:56Z"
  },
  {
    "title": "Trump Backs Off Plan to Deploy National Guard to New York City: ‘Other Places Need It More’",
    "description": "President Trump hit the pause button on deploying the National Guard to NYC, with Trump on Saturday saying there are other American cities that \"need it more.\"\nThe post Trump Backs Off Plan to Deploy National Guard to New York City: ‘Other Places Need It More…",
    "link": "https://www.mediaite.com/politics/trump-backs-off-plan-to-deploy-national-guard-to-new-york-city-other-places-need-it-more/",
    "timestamp": "2025-11-22T19:33:37Z"
  },
  {
    "title": "Trump and Mamdani’s handshake reveals something unexpected",
    "description": "New York’s progressive Mayor Zohran Mamdani stepped into the White House expecting tension. Instead, the Nov. 21 encounter with President Donald Trump delivered something far more puzzling: a surprisingly subdued commander in chief. The meeting itself was rem…",
    "link": "https://rollingout.com/2025/11/22/trump-mamdani-handshake-meaning/",
    "timestamp": "2025-11-22T19:27:39Z"
  },
  {
    "title": "Trump-Targeted Democrat Receives Bomb Threat On Her Home",
    "description": "One of the six Democratic lawmakers targeted by President Donald Trump for \"treason\" has received a bomb threat on her home.\nThe post Trump-Targeted Democrat Receives Bomb Threat On Her Home first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-targeted-democrat-receives-bomb-threat-on-her-home/",
    "timestamp": "2025-11-22T19:24:39Z"
  },
  {
    "title": "How Zohran Mamdani won over Donald Trump — for now",
    "description": "In a triumphant election-night speech earlier this month, New York City Mayor-elect Zohran Mamdani addressed Donald Trump directly, telling the president to “Turn the volume up.” Trump has repeatedly called Mamdani a “Communist” and questioned his citizenship…",
    "link": "https://www.vox.com/politics/470169/zohran-mamdani-donald-trump-oval-office-meeting-nyc-queens",
    "timestamp": "2025-11-22T19:24:07Z"
  },
  {
    "title": "Yet Another Discharge Petition – That’s What You Get When You Don’t Let the House Vote on Anything",
    "description": "Big thanks to Simon Rosenberg for collecting all this information in one place. I’m betting that low-life Speaker-Pastor Johnson does not want to be humiliated with yet another successful discharge petition. US Senators issue a formal statement in response to…",
    "link": "https://balloon-juice.com/2025/11/22/yet-another-discharge-petition-thats-what-you-get-when-you-dont-let-the-house-vote-on-anything/",
    "timestamp": "2025-11-22T19:21:09Z"
  },
  {
    "title": "JFK's granddaughter shares terminal cancer diagnosis",
    "description": "Tatiana Schlossberg, 35, says she was diagnosed shortly after giving birth in 2024 and has less than a year to live.",
    "link": "https://www.bbc.com/news/articles/cpvdyg348pko",
    "timestamp": "2025-11-22T19:21:08Z"
  },
  {
    "title": "Zohran Mamdani’s Trump 'Love-Fest' Divides Socialists",
    "description": "Socialists are still trying to make sense of the surprisingly positive meeting between New York City's Mayor-elect Zohran Mamdani and President Donald Trump, with outlets decrying the meeting as a \"grotesque love-fest\" or highlighting the \"gushing\" response T…",
    "link": "https://biztoc.com/x/d47f18fa6c34d51d",
    "timestamp": "2025-11-22T19:16:33Z"
  },
  {
    "title": "Epstein Survivor Says Trump AG Bondi Looks ‘Very Scared’ After Bill Passed: ‘Ghost Of Jeffrey Epstein Still Haunting Them’",
    "description": "Jess Michaels said Pam Bondi had \"a very scared look on her face\" as she was grilled about the passage of the law requiring the release of the Epstein Files.\nThe post Epstein Survivor Says Trump AG Bondi Looks ‘Very Scared’ After Bill Passed: ‘Ghost Of Jeffre…",
    "link": "https://www.mediaite.com/media/news/epstein-survivor-says-trump-ag-bondi-looks-very-scared-after-bill-passed-ghost-of-jeffrey-epstein-still-haunting-them/",
    "timestamp": "2025-11-22T19:15:19Z"
  },
  {
    "title": "Donald Trump and Marjorie Taylor Greene Exchange Jabs After Resignation News: ‘There Are No Leaders That Will Save This Country’",
    "description": "\"Marjorie 'Traitor' Brown, because of PLUMMETING Poll Numbers, and not wanting to face a Primary Challenger ... has decided to call it 'quits,'\" the president writes\nThe post Donald Trump and Marjorie Taylor Greene Exchange Jabs After Resignation News: ‘There…",
    "link": "https://www.thewrap.com/donald-trump-marjorie-taylor-greene-exchange-words-resignation/",
    "timestamp": "2025-11-22T19:14:05Z"
  },
  {
    "title": "Senators Rip Trump’s Ukraine Peace Proposal At International Security Conference",
    "description": "Democratic Sen. Jeanne Shaheen of New Hampshire, the ranking Member of the Senate Foreign Relations Committee, called it an “outrage.”",
    "link": "https://www.huffpost.com/entry/senators-rip-trumps-ukraine-peace-proposal-at-international-security-conference-canada_n_69220777e4b0d31c0a7aaa18",
    "timestamp": "2025-11-22T19:13:23Z"
  },
  {
    "title": "Trump says he would be 'proud' to strike Mexico's cartels, but will he do it?",
    "description": "Donald Trump believes the US has the right to strike directly at those it accuses of trafficking drugs — even beyond America's borders.",
    "link": "https://www.abc.net.au/news/2025-11-23/donald-trump-mexico-drug-cartels/106030748",
    "timestamp": "2025-11-22T19:12:08Z"
  },
  {
    "title": "Maher: Trump's 'Most Supportive President Israel and the Jews Ever Had'",
    "description": "During his closing monologue on Friday’s broadcast of HBO’s “Real Time,” host Bill Maher stated that while there are many issues he has with him, President Donald Trump “is the most supportive President Israel and the Jews ever had.” While\nThe post Maher: Tru…",
    "link": "https://www.breitbart.com/clips/2025/11/22/maher-trumps-most-supportive-president-israel-and-the-jews-ever-had/",
    "timestamp": "2025-11-22T19:11:05Z"
  },
  {
    "title": "MS NOW Host Says Trump ‘Obviously In Love With Mamdani,’ And Her Guest Has A Theory Why",
    "description": "“I've never seen him sort of care for his children, his vice president or his cabinet's credibility the way he seemed committed to honoring Mamdani's credibility,” Nicolle Wallace said.",
    "link": "https://www.huffpost.com/entry/nicolle-wallace-trump-in-love-with-mamdani-affordability_n_6921f70de4b0d31c0a7aa563",
    "timestamp": "2025-11-22T19:08:56Z"
  },
  {
    "title": "‘Let me be blunt’: Trump gives universities another opportunity to sign 10-point compact",
    "description": "Wants to work with schools dedicated to 'commonsense principles, like student equality, financial responsibility, merit-based hiring, and civil discourse'",
    "link": "https://www.wnd.com/2025/11/let-me-be-blunt-trump-gives-universities-another/",
    "timestamp": "2025-11-22T19:05:32Z"
  },
  {
    "title": "American senators rip Trump’s Ukraine peace proposal at international security conference in Canada",
    "description": "American senators panned a U.S. peace proposal on Ukraine at a international security conference in Canada, with one calling it one of the most serious geopolitical mistakes of his lifetime",
    "link": "https://abcnews.go.com/International/wireStory/american-senators-rip-trumps-ukraine-peace-proposal-international-127785276",
    "timestamp": "2025-11-22T19:01:49Z"
  },
  {
    "title": "Trump Axes TPS for Somalis in Minnesota After Alleged Massive Medicaid Scam Is Exposed",
    "description": "\"In 2023 alone, the Somali diaspora sent back $1.7 billion — more than the Somali government’s budget for that year.\"\nThe post Trump Axes TPS for Somalis in Minnesota After Alleged Massive Medicaid Scam Is Exposed first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/trump-axes-tps-for-somalis-in-minnesota-after-alleged-massive-medicaid-scam-is-exposed/",
    "timestamp": "2025-11-22T19:00:15Z"
  },
  {
    "title": "Freed hostage Segev Kalfon hands heartfelt letter to President Trump",
    "description": "Freed hostage Segev Kalfon credits US President Donald Trump's firm leadership for playing a crucial role in securing his release, says the President's determination served as 'a light…in the darkest tunnels.'",
    "link": "https://www.israelnationalnews.com/news/418179",
    "timestamp": "2025-11-22T18:56:23Z"
  },
  {
    "title": "Trump critic Spike Lee is 'puzzled' after cordial Oval Office meeting between Mamdani and president",
    "description": "At the Toronto Film Festival on Saturday, Spike Lee said he was \"puzzled\" by the cordial White House meeting between President Donald Trump and NYC Mayor-elect Zohran Mamdani on Friday.",
    "link": "https://www.foxnews.com/media/trump-critic-spike-lee-puzzled-after-cordial-oval-office-meeting-between-mamdani-president",
    "timestamp": "2025-11-22T18:53:30Z"
  },
  {
    "title": "Minneapolis police chief issues apology for linking Somali youth to local crime",
    "description": "Minneapolis police chief Brian O'Hara apologizes to Somali community after controversial comments linking \"East African kids\" to crime in recent interview.",
    "link": "https://www.foxnews.com/politics/minneapolis-police-chief-issues-apology-linking-somali-youth-local-crime",
    "timestamp": "2025-11-22T18:52:45Z"
  },
  {
    "title": "Another country is lining up behind Israel to cause MAGA's next big 'divide'",
    "description": "Israel may not be President Donald Trump’s only international policy threatening MAGA unity, said Ransom Miller, reporting for the Hill.“More Trump voters disapprove of the president’s handling of China than any other foreign policy issue,” said Ransom, accor…",
    "link": "https://www.rawstory.com/alternet-posts/trump-maga-china/",
    "timestamp": "2025-11-22T18:48:21Z"
  },
  {
    "title": "Trump, Loomer Mock MTG\nAfter Stunning Resignation Announcement",
    "description": "President Donald Trump\ntook to Truth Social Saturday morning to share his thoughts on his former\nally’s shocking resignation. “Marjorie ‘Traitor’\nBrown, because of PLUMMETING Poll Numbers, and not wanting to face a Primary\nChallenger with a strong Trump Endor…",
    "link": "https://newrepublic.com/post/203551/trump-loomer-mock-marjorie-taylor-greene",
    "timestamp": "2025-11-22T18:46:41Z"
  },
  {
    "title": "Trump Terminates Temporary Protected Status for Somalis in Minnesota After Rampant Fraud",
    "description": "Minnesota, under Governor Waltz, is a hub of fraudulent money laundering activity. I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota. Somali gangs are terr…",
    "link": "https://freerepublic.com/focus/f-news/4354037/posts",
    "timestamp": "2025-11-22T18:40:58Z"
  },
  {
    "title": "‘Trump leaves his fingerprints on our city’: Columnist melts down hearing national anthem in Washington, D.C.",
    "description": "After Kennedy Center concert: 'I loved the crashing chords of the Organ Symphony ... The Star-Spangled Banner not so much'",
    "link": "https://www.wnd.com/2025/11/trump-leaves-his-fingerprints-our-city-columnist-melts/",
    "timestamp": "2025-11-22T18:39:29Z"
  },
  {
    "title": "NY Gov Hochul Goes There: Elise Stefanik Is 'Full Of Shit'",
    "description": "New York Gov. Kathy Hochul joined Chris Hayes on his show following the Mamdani-Trump love fest in the Oval Office, where the president kicked Rep. Elise Stefanik to the curb. \n\"Political casualties of today were Elise Stefanik, the New York member of Congres…",
    "link": "https://crooksandliars.com/2025/11/ny-gov-hochel-goes-there-elise-stefanik",
    "timestamp": "2025-11-22T18:38:59Z"
  },
  {
    "title": "Trump’s Mamdani Bromance May Have Just Killed Stefanik Campaign",
    "description": "In case you missed it, Donald Trump fell head over heels on Friday for New York City Mayor-Elect Zohran Mamdani, the guy he once called a “communist lunatic,” had threatened to arrest, and vowed to cut off federal funding to the city if Mamdani won the Novemb…",
    "link": "https://crooksandliars.com/2025/11/trump-s-mamdani-bromance-may-have-just",
    "timestamp": "2025-11-22T18:38:58Z"
  },
  {
    "title": "US Congressman urges FG to disarm Middle Belt militants",
    "description": "US Congressman Riley Moore calls on Nigeria’s government to disarm Middle Belt militants after recent mass kidnappings, calling the violence a genocide.\n\nRead More: https://punchng.com/us-congressman-urges-fg-to-disarm-middle-belt-militants/",
    "link": "https://punchng.com/us-congressman-urges-fg-to-disarm-middle-belt-militants/",
    "timestamp": "2025-11-22T18:38:50Z"
  },
  {
    "title": "Rudy Giuliani Says He Was ‘Sick To My Stomach’ To See Mamdani In The Oval Office",
    "description": "Rudy Giuliani expressed his \"strong feelings\" about seeing \"communist\" Zohran Mamdani standing alongside President Donald Trump in the Oval Office.\nThe post Rudy Giuliani Says He Was ‘Sick To My Stomach’ To See Mamdani In The Oval Office first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/rudy-giuliani-says-he-was-sick-to-my-stomach-to-see-mamdani-in-the-oval-office/",
    "timestamp": "2025-11-22T18:37:22Z"
  },
  {
    "title": "Rudy Giuliani Says He Was ‘Sick To My Stomach’ To See His Mayoral Replacement In The Oval Office",
    "description": "Rudy Giuliani expressed his \"strong feelings\" about seeing \"communist\" Zohran Mamdani standing alongside President Donald Trump in the Oval Office.\nThe post Rudy Giuliani Says He Was ‘Sick To My Stomach’ To See His Mayoral Replacement In The Oval Office first…",
    "link": "https://www.mediaite.com/media/news/rudy-giuliani-says-he-was-sick-to-my-stomach-to-see-his-mayoral-replacement-in-the-oval-office/",
    "timestamp": "2025-11-22T18:37:22Z"
  },
  {
    "title": "‘He can fight his little heart out’: Trump on potential Zelensky refusal",
    "description": "Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628215-trump-zelensky-little-heart/",
    "timestamp": "2025-11-22T18:34:13Z"
  },
  {
    "title": "Shooting at Chicago's Christmas tree lighting event leaves one dead and eight hurt with terrified families forced to run for their lives",
    "description": "A night of celebration spiraled into panic when two shootings rocked Chicago just hours after the city lit its official Christmas tree. One person was killed and eight others were wounded on Friday as terrified crowds fled through an area known as The Loop. T…",
    "link": "https://freerepublic.com/focus/f-news/4354035/posts",
    "timestamp": "2025-11-22T18:33:49Z"
  },
  {
    "title": "Trump Softens On Marjorie Taylor Greene Hours After She Blasts Him In Bombshell Resignation: ‘She’s a Nice Person’",
    "description": "President Donald Trump sounded conciliatory when he was asked about Rep. Marjorie Taylor Greene (R-GA) hours after she savaged him in her shock resignation.\nThe post Trump Softens On Marjorie Taylor Greene Hours After She Blasts Him In Bombshell Resignation: …",
    "link": "https://www.mediaite.com/media/news/trump-softens-on-marjorie-taylor-greene-hours-after-she-blasts-him-in-bombshell-resignation-shes-a-nice-person/",
    "timestamp": "2025-11-22T18:28:24Z"
  },
  {
    "title": "White House Press Sec Tries Desperately to Spin Mamdani Meeting",
    "description": "White House press secretary Karoline Leavitt went on Fox News to attempt to explain the sudden warmth between two political adversaries—but can chemistry ever, truly be explained? After President Donald Trump and New York City Mayor-elect Zohran Mamdani met a…",
    "link": "https://newrepublic.com/post/203550/trump-mamdani-meeting-karoline-leavitt",
    "timestamp": "2025-11-22T18:23:49Z"
  },
  {
    "title": "Bolsonaro arrested over alleged plot to escape and avoid 27-year prison term in Brazil",
    "description": "Brazil's federal police on Saturday arrested former president Jair Bolsonaro over suspicion he was plotting to escape and avoid starting a 27-year prison sentence for leading a coup attempt.",
    "link": "https://www.pbs.org/newshour/world/bolsonaro-arrested-over-alleged-plot-to-escape-and-avoid-27-year-prison-term-in-brazil",
    "timestamp": "2025-11-22T18:22:01Z"
  },
  {
    "title": "Elizabeth Warren Calls Out CBS Owner On His Own Network: 'One Man Named David Ellison'",
    "description": "Ellison's company, Skydance Media, acquired CBS owner Paramount Global earlier this year and is now preparing to purchase Warner Bros. Discovery.",
    "link": "https://www.huffpost.com/entry/elizabeth-warren-calls-out-david-ellison-on-cbs-late-show_n_6921da4be4b0536e01ad45b6",
    "timestamp": "2025-11-22T18:20:18Z"
  },
  {
    "title": "Ohio Police Officer Acquitted in Killing of Pregnant Black Mother Ta’Kiya Young",
    "description": "Sean Walton, an attorney for the Young family, called the outcome “an American tragedy.”…",
    "link": "https://capitalbnews.org/ohio-mom-killed-officer-charged/",
    "timestamp": "2025-11-22T18:18:11Z"
  },
  {
    "title": "The jab: Military organizations’ urgent call for pardons or amnesty ignored",
    "description": "'The failure … prolongs the irreparable damage caused by the illegal military COVID mandate'",
    "link": "https://www.wnd.com/2025/11/jab-military-organizations-urgent-call-pardons-amnesty-ignored/",
    "timestamp": "2025-11-22T18:17:45Z"
  },
  {
    "title": "Over 92 Percent of Homes in Gaza Are Rubble. How Do We Even Start Rebuilding?",
    "description": "To resurrect Gaza, the world must reckon with the genocide. Despite the ceasefire, Israel is blocking access to cement.",
    "link": "https://truthout.org/articles/over-92-percent-of-homes-in-gaza-are-rubble-how-do-we-even-start-rebuilding/",
    "timestamp": "2025-11-22T18:15:17Z"
  },
  {
    "title": "Trump says he will meet with Lula 'soon'",
    "description": "United States President Donald Trump shared on Saturday that he had a telephone conversation with Brazilian President Luiz Inacio Lula da Silva, and added that the two of them will have a meeting shor...",
    "link": "https://biztoc.com/x/5119258c1a999084",
    "timestamp": "2025-11-22T18:15:15Z"
  },
  {
    "title": "Donald Trump Claims Best Poll Numbers Of His Career In Fiery Morning Outburst: 'Just Gotten Highest Poll Numbers Of My Political Career'",
    "description": "President Donald Trump has claimed to have reached the pinnacle of his political career in terms of poll numbers. This statement, however, conflicts with recent reports suggesting a decline in his popularity.\nWhat Happened: Trump made this claim on Truth Soci…",
    "link": "https://biztoc.com/x/03584cd13ba258ee",
    "timestamp": "2025-11-22T18:14:58Z"
  },
  {
    "title": "Donald Trump Suffers Four Legal Setbacks in a Week",
    "description": "A string of four court setbacks this week highlighted growing judicial pushback on Trump’s use of executive power.",
    "link": "https://biztoc.com/x/d0297b1f76c6b2ed",
    "timestamp": "2025-11-22T18:14:47Z"
  },
  {
    "title": "UN climate talks end with deal for more money to countries hit by climate change",
    "description": "BELEM, Brazil (AP) — United Nations climate talks in Brazil reached a subdued agreement Saturday to deliver more money to countries hit hardest by climate change to help them adapt to extreme weather’s wrath. But the agreement doesn’t include an explicit deta…",
    "link": "https://freerepublic.com/focus/f-news/4354030/posts",
    "timestamp": "2025-11-22T18:14:06Z"
  },
  {
    "title": "Everyone ‘Got Played’: Curtis Sliwa Says Americans Were ‘Suckers’ Going Into Trump-Mamdani Meeting",
    "description": "Curtis Sliwa told CNN on Friday he thought President Trump's meeting with Democratic Mayor-Elect Zohran Mamdani proved past barbs by the two were for show.",
    "link": "https://dailycaller.com/2025/11/22/curtis-sliwa-cnn-laura-coates-live-donald-trump-zohran-mamdani-meeting-andrew-yang-fox-news-kayleigh-mcenany-saturday-america/",
    "timestamp": "2025-11-22T18:13:58Z"
  },
  {
    "title": "‘Borders must not change by force’: World leaders disagree with Trump approach to Ukraine",
    "description": "At G20, Taoiseach Micheál Martin said Europe would engage with process while continuing support for Ukraine",
    "link": "https://www.irishtimes.com/politics/2025/11/22/borders-must-not-change-by-force-world-leaders-disagree-with-trump-approach-to-ukraine/",
    "timestamp": "2025-11-22T18:12:10Z"
  },
  {
    "title": "“This is not my final proposal for Ukraine” – New information from Trump on the 28-point plan",
    "description": "This statement significantly shifts the tone — What the agreement includes — Why Europe was caught off guard\nThe post “This is not my final proposal for Ukraine” – New information from Trump on the 28-point plan appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/11/22/this-is-not-my-final-proposal-for-ukraine-new-information-from-trump-on-the-28-point-plan/",
    "timestamp": "2025-11-22T18:09:21Z"
  },
  {
    "title": "Macron says Ukraine peace plan needs revisions; Trump insists proposal not final",
    "description": "WASHINGTON: French President Emmanuel Macron said on Saturday (Nov 22) that a United States proposal to end the war between Ukraine and Russia was a useful starting point but required changes and full European involveme",
    "link": "https://www.channelnewsasia.com/world/macron-says-ukraine-peace-plan-needs-revisions-trump-insists-proposal-not-final-5484801",
    "timestamp": "2025-11-22T18:09:00Z"
  },
  {
    "title": "At least 24 die as Israel launches fresh airstrikes on Gaza",
    "description": "Health officials in Gaza reported at least 24 people killed and another 54 wounded, including children.",
    "link": "https://www.thejournal.ie/gaza-strikes-2-6883001-Nov2025/",
    "timestamp": "2025-11-22T18:02:56Z"
  },
  {
    "title": "'Take a little rest': Trump makes remarkable 180 after blasting longtime ally as 'traitor'",
    "description": "President Donald Trump has openly gloated about Rep. Marjorie Taylor Greene's (R-GA) resignation announcement — going so far as to describe the longtime MAGA ally a \"traitor\" — but told NBC News he'd be happy to see her career resume, after a little break.Tru…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-trump-2674334103/",
    "timestamp": "2025-11-22T18:01:55Z"
  },
  {
    "title": "Enforcing Immigration Laws Is Not the Moral Equivalent of the Holocaust",
    "description": "Whence cometh the conviction, in America and even more in Britain and Europe, that open borders is the only moral immigration policy? Of course, not... Read More\nThe post Enforcing Immigration Laws Is Not the Moral Equivalent of the Holocaust appeared first o…",
    "link": "https://www.dailysignal.com/2025/11/22/enforcing-immigration-laws-not-moral-equivalent-holocaust/",
    "timestamp": "2025-11-22T18:00:00Z"
  },
  {
    "title": "Belarus pardons 31 Ukrainians after deal with Trump",
    "description": "It's the latest step in Minsk’s effort to thaw relations with the West.",
    "link": "https://abcnews.go.com/International/wireStory/belarus-pardons-31-ukrainians-after-deal-trump-127784200",
    "timestamp": "2025-11-22T17:57:08Z"
  },
  {
    "title": "Europe scrambles over US plan to end Ukraine war mostly on Russia's terms",
    "description": "European nations are reacting to a US peace proposal for Ukraine. The plan reportedly grants Russia significant concessions, including territorial gains and military limits for Ukraine. Ukraine emphasizes the need for a dignified and just peace. European lead…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/europe-scrambles-over-us-plan-to-end-ukraine-war-mostly-on-russias-terms/articleshow/125509608.cms",
    "timestamp": "2025-11-22T17:56:50Z"
  },
  {
    "title": "American senators rip Trump’s Ukraine peace proposal at international security conference in Canada",
    "description": "American senators panned a U.S. peace proposal on Ukraine at an international security conference Saturday, with one calling it one of the most serious...",
    "link": "https://www.yahoo.com/news/articles/american-senators-rip-trump-ukraine-175620112.html",
    "timestamp": "2025-11-22T17:56:20Z"
  },
  {
    "title": "Trump says Ukraine peace plan is not his 'final offer'",
    "description": "United States President Donald Trump said on Saturday that his 28-point peace plan for Ukraine is not his \"final proposal\" to Kiev.\"We are trying to end it one way or another. We must finish it. This ...",
    "link": "https://biztoc.com/x/cf484892fa74cd69",
    "timestamp": "2025-11-22T17:53:07Z"
  },
  {
    "title": "G20 leaders back critical minerals access, debt relief",
    "description": "G20 leaders endorse a declaration in South Africa, focusing on securing critical minerals access, debt relief for low-income nations, and climate finance.\n\nRead More: https://punchng.com/g20-leaders-back-critical-minerals-access-debt-relief/",
    "link": "https://punchng.com/?p=1991347",
    "timestamp": "2025-11-22T17:50:09Z"
  },
  {
    "title": "Texas A&M committee rules professor's firing over gender identity lesson unjustified",
    "description": "A Texas A&M committee agreed the university was wrong to fire a professor earlier this year after a controversy over a classroom video that showed a student objecting to a children’s literature lesson about gender identity",
    "link": "https://abcnews.go.com/Politics/wireStory/texas-committee-rules-professors-firing-gender-identity-lesson-127784388",
    "timestamp": "2025-11-22T17:48:11Z"
  },
  {
    "title": "‘It’s a Yes or No Question!’ CNN Anchor Gets In Smackdown With Trump Fan Over Excecuting Democrats Rant",
    "description": "CNN anchor Abby Phillip got into it with Trump defender Terry Schilling over President Donald Trump's rant accusing Democrats of a crime \"punishable by death.\"\nThe post ‘It’s a Yes or No Question!’ CNN Anchor Gets In Smackdown With Trump Fan Over Excecuting D…",
    "link": "https://www.mediaite.com/media/tv/its-a-yes-or-no-question-cnn-anchor-gets-in-smackdown-with-trump-fan-over-excecuting-democrats-rant/",
    "timestamp": "2025-11-22T17:44:16Z"
  },
  {
    "title": "How Greene went from Maga loyalist to quitting Congress",
    "description": "Greene's tenure in Congress may be ending, but her involvement in US political life may not be over.",
    "link": "https://www.bbc.com/news/articles/cwywjz202r7o",
    "timestamp": "2025-11-22T17:43:11Z"
  },
  {
    "title": "US warns western allies against mass migration saying it is an existential threat",
    "description": "US News: The TOI correspondent from from Washington: The United States on Friday extended its campaign against mass migration to cover its European allies, war.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-warns-western-allies-against-mass-migration-saying-it-is-an-existential-threat/articleshow/125509064.cms",
    "timestamp": "2025-11-22T17:41:50Z"
  },
  {
    "title": "Trump pledge to 'immediately' end protections for Minnesota Somalis sparks fear and legal questions",
    "description": "President Donald Trump’s pledge to terminate temporary legal protections for Somalis living in Minnesota is triggering fear in the state’s deeply-rooted...",
    "link": "https://www.yahoo.com/news/articles/trump-pledge-immediately-end-protections-174132051.html",
    "timestamp": "2025-11-22T17:41:32Z"
  },
  {
    "title": "S.Africa G20 declaration highlights: minerals, debt, climate",
    "description": "Leaders from the G20 group of top economies endorsed Saturday a declaration at a summit in South Africa that highlights issues related to access to critical minerals and measures to cope with climate change.  South Africa chose “Solidarity, Equality, Sustaina…",
    "link": "https://www.digitaljournal.com/world/s-africa-g20-declaration-highlights-minerals-debt-climate/article",
    "timestamp": "2025-11-22T17:37:20Z"
  },
  {
    "title": "'Cowering' Republicans are trapped in a 'terrible tightening vise'",
    "description": "A journalist and historian warned Saturday that Republicans have a \"fear that places them in a terrible tightening vise\" — as they're poised to pay the \"butcher's bill\" for President Donald Trump's decisions.Sidney Blumenthal, whose career includes political …",
    "link": "https://www.rawstory.com/republicans-trump-2674334074/",
    "timestamp": "2025-11-22T17:35:37Z"
  },
  {
    "title": "After Snow White Brouhaha, Gal Gadot Shares Thoughts On Possibly Playing The Evil Queen Again",
    "description": "Would she wear the crown again?",
    "link": "https://www.cinemablend.com/movies/after-snow-white-brouhaha-gal-gadot-shares-thoughts-playing-evil-queen-again",
    "timestamp": "2025-11-22T17:34:46Z"
  },
  {
    "title": "Reminders Of What Our Losses From CDC And USAID Mean",
    "description": "With the loss of USAID and much of CDC, our ability to respond to pandemics is at risk. Global health issues are a growing threat.",
    "link": "https://www.forbes.com/sites/judystone/2025/11/22/reminders-of-what-our-losses-from-cdc-and-usaid-mean/",
    "timestamp": "2025-11-22T17:32:14Z"
  },
  {
    "title": "Hamas urges mediators to stop 'Israel's violations'",
    "description": "Hamas urged on Saturday mediators and the administration of United States President Donald Trump to pressure Israel in order to momentary stop \"the ceasefire violations.\"\"We reiterate our rejection of...",
    "link": "https://biztoc.com/x/9ea67c72885f120f",
    "timestamp": "2025-11-22T17:30:37Z"
  },
  {
    "title": "Epstein Scandal Backfires on Democrats [semi-satire]",
    "description": "After months of scurrilous accusations and gloating over how the Epstein case would bring about his end, President Trump agreed to sign the Congressional resolution authorizing the release of all the Epstein files in the government's possession. The results w…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354022/posts",
    "timestamp": "2025-11-22T17:28:56Z"
  },
  {
    "title": "Israel launches strikes in Gaza ceasefire's latest test as hospitals say more than 20 killed",
    "description": "Israeli airstrikes in Gaza on Saturday killed at least 24 people and wounded dozens more.",
    "link": "https://www.nbcnews.com/world/middle-east/israel-launches-strikes-gaza-ceasefire-rcna245320",
    "timestamp": "2025-11-22T17:28:44Z"
  },
  {
    "title": "FBI Gives Its Final Verdict on Trump Shooter Thomas Crooks",
    "description": "FBI officials explained what they have found in their investigation of the man who shot Donald Trump at a 2024 rally.",
    "link": "https://www.westernjournal.com/fbi-gives-final-verdict-trump-shooter-thomas-crooks/",
    "timestamp": "2025-11-22T17:27:37Z"
  },
  {
    "title": "Bill Maher Flings 5-Letter Expletive At Karoline Leavitt Over Her 'Quiet, Piggy' Defense",
    "description": "The White House press secretary had previously characterized the president as being \"frank and honest\" when he called a female reporter \"piggy.\"",
    "link": "https://www.huffpost.com/entry/bill-maher-karoline-leavitt-quiet-piggy_n_6921e131e4b0536e01ad473c",
    "timestamp": "2025-11-22T17:25:47Z"
  },
  {
    "title": "Grayscale Poised To Debut XRP And Dogecoin ETFs On Monday Following NYSE Approvals",
    "description": "Grayscale exchange-traded funds tracking Ripple’s XRP and Dogecoin (DOGE) are set to begin trading on Monday.",
    "link": "https://zycrypto.com/grayscale-poised-to-debut-xrp-and-dogecoin-etfs-on-monday-following-nyse-approvals/",
    "timestamp": "2025-11-22T17:22:40Z"
  },
  {
    "title": "Trump says he would 'love' to see Rep. Marjorie Taylor Greene return to politics at some point (NBC News)",
    "description": "NBC News:\nTrump says he would ‘love’ to see Rep. Marjorie Taylor Greene return to politics at some point  —  Greene abruptly announced her resignation from Congress amid a feud with President Donald Trump.  —  WASHINGTON — President Donald Trump said Saturday…",
    "link": "https://www.memeorandum.com/251122/p44",
    "timestamp": "2025-11-22T17:20:04Z"
  },
  {
    "title": "Brazilian Police Make 'Preventative Arrest' Of Jair Bolsonaro, Fearing He'll Flee",
    "description": "Brazilian Police Make 'Preventative Arrest' Of Jair Bolsonaro, Fearing He'll Flee\n \nThe plot thickens for the man once called the \"Brazilian Donald Trump\" as former Brazilian President Jair Bolsonaro was detained on Saturday at his residence in Brazil's capit…",
    "link": "https://biztoc.com/x/f9cec83b1a9f1d5c",
    "timestamp": "2025-11-22T17:19:25Z"
  },
  {
    "title": "U.N. Climate Conference Rejects EU Demands to Commit to Fossil Fuel Phase-Out",
    "description": "Nations clinched a deal at the UN's COP30 climate summit in the Amazon Saturday without a roadmap for phasing out fossil fuels as demanded by the European Union and other countries.\nThe post U.N. Climate Conference Rejects EU Demands to Commit to Fossil Fuel …",
    "link": "https://www.breitbart.com/europe/2025/11/22/u-n-climate-conference-rejects-eu-demands-to-commit-to-fossil-fuel-phase-out/",
    "timestamp": "2025-11-22T17:15:05Z"
  },
  {
    "title": "‘Nothing ever gets better’: Marjorie Taylor Greene announces resignation from Congress",
    "description": "'Americans are used by the Political Industrial Complex of both Political Parties'",
    "link": "https://www.wnd.com/2025/11/nothing-ever-gets-better-marjorie-taylor-greene-announces/",
    "timestamp": "2025-11-22T17:13:33Z"
  },
  {
    "title": "Trump and Mamdani’s ‘Lovefest’ Exposes the Media’s Broken Script",
    "description": "Trump and Mamdani’s cordial moment didn’t just reveal campaign theater — it exposed how much the political press depends on a fixed script to explain Trump.\nThe post Trump and Mamdani’s ‘Lovefest’ Exposes the Media’s Broken Script first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trump-and-mamdanis-lovefest-exposes-the-medias-broken-script/",
    "timestamp": "2025-11-22T17:12:03Z"
  },
  {
    "title": "Web Of Depraved Satanic Groups Brainwashed School Shooter – Only One Culprit Has Been Unmasked",
    "description": "Officials linked a foreign Satanic group to a Tennessee shooting, but another cult-like group's leader has gone unnoticed after taking credit for the bloodshed.",
    "link": "https://dailycaller.com/2025/11/22/satanic-groups-brainwashed-school-shooter-only-one-culprit-fbi-doj-764-terrorism/",
    "timestamp": "2025-11-22T17:07:49Z"
  }
]