[
  {
    "title": "Are We Fine with Empty Seats?",
    "description": "Not long after the Trump administration took office, my son noticed several empty seats in his sixth-grade classroom. At first, he didn’t understand why his Hispanic classmates were missing. Later, when my wife and I took him to a protest in solidarity with o…",
    "link": "https://www.counterpunch.org/2025/03/21/are-we-fine-with-empty-seats/",
    "timestamp": "2025-03-21T05:44:11Z"
  },
  {
    "title": "Trump denies Musk to be briefed on top-secret plan for potential war with China",
    "description": "U.S. President Donald Trump has denied a New York Times report that his close ally, billionaire Elon Musk, was due to be briefed by the Pentagon on Friday about the U.S. military's plan for any war that might break out with China. &quot;China will not even be…",
    "link": "https://japantoday.com/category/world/Trump-denies-Musk-to-be-briefed-on-secret-plan-for-potential-war-with-China",
    "timestamp": "2025-03-21T05:43:00Z"
  },
  {
    "title": "India's $23 billion plan to rival China factories to lapse after it disappoints",
    "description": "India's $23 billion initiative to boost domestic manufacturing is set to lapse after four years. Despite promises of cash payouts to firms like Foxconn and Reliance Industries, many failed to meet production targets or faced delays in receiving incentives. Th…",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/indias-23-billion-plan-to-rival-china-factories-to-lapse-after-it-disappoints/articleshow/119287689.cms",
    "timestamp": "2025-03-21T05:40:47Z"
  },
  {
    "title": "Tesla trade-ins on pace for record high amid Elon Musk backlash",
    "description": "Musk asks Tesla employees to hang on to stock despite its over 40 per cent drop. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/tesla-trade-ins-on-pace-for-record-high-amid-elon-musk-backlash",
    "timestamp": "2025-03-21T05:40:00Z"
  },
  {
    "title": "US senator and strong Trump supporter Steve Daines visiting Beijing as tariff fight grows",
    "description": "U.S. Senator Steve Daines is visiting Beijing as the U.S. and China swap tariff threats and harsh words over each others’ handling of the illegal trade in fentanyl",
    "link": "https://abcnews.go.com/International/wireStory/us-senator-strong-trump-supporter-steve-daines-visiting-120013196",
    "timestamp": "2025-03-21T05:34:01Z"
  },
  {
    "title": "Micron forecasts upbeat quarterly revenue on strong AI memory chip demand",
    "description": "AI demand has significantly boosted the need for Micron's HBM chips, a type of dynamic random access memory or DRAM standard essential for advanced AI systems, including Nvidia's processors, the main beneficiary of the AI boom.",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/micron-forecasts-upbeat-quarterly-revenue-on-strong-ai-memory-chip-demand/articleshow/119287447.cms",
    "timestamp": "2025-03-21T05:33:24Z"
  },
  {
    "title": "Italian paper prints fully-AI edition, but not to 'kill' journalism",
    "description": "In a world first, an Italian newspaper is printing a fully AI-generated edition for a month in what its director said Thursday was an experiment to &quot;revitalise journalism, not to kill it&quot;. Il Foglio, a daily broadsheet with an irreverent touch and a…",
    "link": "https://japantoday.com/category/tech/italian-paper-prints-fully-ai-edition-but-not-to-%27kill%27-journalism",
    "timestamp": "2025-03-21T05:32:36Z"
  },
  {
    "title": "Tulsi Gabbard's India visit highlights strong relationship bolstered by PM Modi and President Trump: US",
    "description": "US Director of National Intelligence Tulsi Gabbard's visit to India reinforced the strong India-US partnership, focusing on intelligence-sharing and counterterrorism. She engaged with key Indian leaders, attended the Raisina Dialogue, and emphasized President…",
    "link": "https://economictimes.indiatimes.com/news/india/tulsi-gabbards-india-visit-highlights-strong-relationship-bolstered-by-pm-modi-and-president-trump-us/articleshow/119287402.cms",
    "timestamp": "2025-03-21T05:31:52Z"
  },
  {
    "title": "Donald Trump takes on America’s elite",
    "description": "The president appears determined to demolish the pillars of US liberalism",
    "link": "https://biztoc.com/x/decfd71161aa679e",
    "timestamp": "2025-03-21T05:30:02Z"
  },
  {
    "title": "Bernie Sanders, AOC, take aim at Trump and Musk, as well as Democrats, at western rallies",
    "description": "Bernie Sanders and AOC headline a rally in Tempe, Arizona as part of a three-day, five-city swing through Western states where they took aim at President Trump, Elon Musk and Democrats.",
    "link": "https://www.foxnews.com/politics/bernie-sanders-alexandria-ocasio-cortez-rally-tempe-arizona",
    "timestamp": "2025-03-21T05:30:00Z"
  },
  {
    "title": "What Putin wants Ukrainians in Russia to do before September 10 or face the consequences",
    "description": "Russian President Vladimir Putin has warned Ukrainians living in Russia to legalise their immigration status or leave by September 10. The decree specifically targets those from occupied regions, with the ongoing passport push criticised by Ukraine and Wester…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-putin-wants-ukrainians-in-russia-to-do-before-september-10-or-face-the-consequences/articleshow/119287225.cms",
    "timestamp": "2025-03-21T05:27:29Z"
  },
  {
    "title": "US president Donald Trump's son, Eric is now the advisor of a Japanese bitcoin company, Metaplanet. Here's all about it",
    "description": "Japanese bitcoin investment company Metaplanet has appointed Eric F. Trump to its newly formed strategic board of advisors. The board aims to further the bitcoin mission and advance financial innovation. Trump's inclusion highlights his role as a leading advo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-president-donald-trumps-son-eric-is-now-the-advisor-of-a-japanese-bitcoin-company-metaplanet-heres-all-about-it/articleshow/119287222.cms",
    "timestamp": "2025-03-21T05:27:26Z"
  },
  {
    "title": "Kash Patel’s FBI delivers key records to Congress on Biden-era weaponization scandals",
    "description": "CV NEWS FEED // The FBI, now under the leadership of director Kash Patel, has provided Congress with critical documents related to allegations that federal law enforcement was weaponized for political purposes during the Biden administration. The records were…",
    "link": "https://freerepublic.com/focus/f-news/4305759/posts",
    "timestamp": "2025-03-21T05:26:17Z"
  },
  {
    "title": "'You don’t have to burn it down': Elon Musk on backlash against Tesla, says 'it feels like Armageddon'",
    "description": "Facing a surge in vandalism, Elon Musk has urged people not to set Tesla cars on fire. Attacks on Tesla properties have intensified since Trump's inauguration, compelling law enforcement to address these incidents. Musk also encouraged Tesla employees to reta…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/you-dont-have-to-burn-it-down-elon-musk-on-backlash-against-tesla-says-it-feels-like-armageddon/articleshow/119287078.cms",
    "timestamp": "2025-03-21T05:25:44Z"
  },
  {
    "title": "Europe Is Short of Gunpowder and TNT When It Needs Them Most",
    "description": "Ammunition manufacturers are working to secure supplies of chemicals and cotton as they prepare for a massive increase in demand for explosives and propellants.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-is-short-of-gunpowder-and-tnt-when-it-needs-them-most",
    "timestamp": "2025-03-21T05:24:22Z"
  },
  {
    "title": "Ukraine’s Odesa ‘on fire’ from ‘massive’ Russian strikes as Trump projects optimism ahead of peace talks",
    "description": "The southern Ukrainian port city of Odesa was engulfed in flames late Thursday after being struck by a large-scale Russian drone attack, hours after US President Donald Trump expressed optimism about ending the war and as peace talks are set to resume on Mond…",
    "link": "https://www.cnn.com/2025/03/21/europe/ukraine-russia-odesa-fire-trump-intl-hnk/index.html",
    "timestamp": "2025-03-21T05:22:54Z"
  },
  {
    "title": "Gold’s blistering rally: Can it now break Warren Buffett's iron will?",
    "description": "Gold has surged past $3,000 an ounce globally and Rs 90,000 per 10 grams in India, underscoring its appeal as a safe-haven amid economic uncertainties. Despite impressive gains, Warren Buffett remains unpersuaded, maintaining his long-held view that gold is a…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/golds-blistering-rally-can-it-now-break-warren-buffetts-iron-will/articleshow/119286970.cms",
    "timestamp": "2025-03-21T05:21:35Z"
  },
  {
    "title": "Labor group holds rally for federal workers in Santa Rosa",
    "description": "Under the new administration, President Trump and DOGE leader Elon Musk announced their plan for mass layoffs in several federal agencies.",
    "link": "https://www.pressdemocrat.com/article/news/federal-employees-rally-layoffs-santa-rosa/",
    "timestamp": "2025-03-21T05:20:10Z"
  },
  {
    "title": "AMP faces backlash over controversial working from home clause in new employee contract",
    "description": "AMP faces backlash over controversial working from home clause in new employee contract7news.com.au",
    "link": "https://7news.com.au/business/banking/amp-faces-backlash-over-controversial-working-from-home-clause-in-new-employee-contract-c-18113709",
    "timestamp": "2025-03-21T05:19:48Z"
  },
  {
    "title": "Trump signs order to tear down US Education Department",
    "description": "President Donald Trump has signed an executive order to dismantle the US Education Department, fulfilling a long-standing conservative goal of shifting education authority to states. While key federal programs may remain, the move has sparked intense debate, …",
    "link": "https://timesofindia.indiatimes.com/education/news/trump-signs-order-to-tear-down-us-education-department/articleshow/119286435.cms",
    "timestamp": "2025-03-21T05:18:53Z"
  },
  {
    "title": "European military leaders discuss Ukraine peacekeeping force",
    "description": "The number of troops that would help enforce a peace in Ukraine is vague. Officials have cited figures of between 10,000 and 30,000 troops as part of what's been termed a \"reassurance force.\"",
    "link": "https://www.npr.org/2025/03/21/nx-s1-5336095/europe-military-leaders-ukraine-russia-peacekeeping",
    "timestamp": "2025-03-21T05:17:14Z"
  },
  {
    "title": "‘Tesla Takedown’: How Elon Musk’s Trump alliance is triggering backlash",
    "description": "Tesla stock’s value has plunged as unrest grows over Elon Musk’s ties to Donald Trump.",
    "link": "https://www.aljazeera.com/podcasts/2025/3/21/tesla-takedown-how-elon-musks-trump-alliance-is-triggering-backlash",
    "timestamp": "2025-03-21T05:16:15Z"
  },
  {
    "title": "With aid cuts looming, Rohingya refugees in Bangladesh face halved rations and misery",
    "description": "Hundreds of thousands of Rohingya refugees in Bangladesh face a dire situation as potential cuts to foreign aid, driven by a decree from US President Donald Trump, loom. These cuts could result in reduced food rations and financial support, severely impacting…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/with-aid-cuts-looming-rohingya-refugees-in-bangladesh-face-halved-rations-and-misery/articleshow/119286664.cms",
    "timestamp": "2025-03-21T05:14:48Z"
  },
  {
    "title": "Idaho Governor Signs Bill Safeguarding Conscience Rights for Pro-Life Doctors",
    "description": "Idaho Governor Brad Little signed House Bill 59 into law on Wednesday — a measure that would safeguard conscience rights for pro-life medical professionals. The bill, which had been sent to the governor’s desk earlier in the month, aims to protect healthcare …",
    "link": "https://freerepublic.com/focus/f-news/4305756/posts",
    "timestamp": "2025-03-21T05:12:36Z"
  },
  {
    "title": "Taiwan's president pushes to increase defense budget amid rising threat from China",
    "description": "Taiwan's military is seeking funds to retain more service people with higher pay and to lengthen compulsory national service from four months to one year as it faces a rising threat from China.",
    "link": "https://www.npr.org/2025/03/21/nx-s1-5336093/taiwain-military-budget-china-defense",
    "timestamp": "2025-03-21T05:05:50Z"
  },
  {
    "title": "Trump’s FCC chair Brendan Carr may shape tech regulatory clash with EU",
    "description": "The FCC chairman has spoken as both friend and foe of EU tech regulation.",
    "link": "https://www.euractiv.com/section/tech/news/trumps-fcc-chair-brendan-carr-may-shape-tech-regulatory-clash-with-eu/",
    "timestamp": "2025-03-21T05:00:56Z"
  },
  {
    "title": "Raúl Jiménez puts Mexico into Nations League final, and Canada into a clash",
    "description": "A desperate Canadian search for a men’s international trophy will stretch on to the summer after Raul Jiménez clinically guided Mexico to a 2-0 win and a spot in the Concacaf Nations League Final against unlikely opponent Panama, who dispatched the US earlier…",
    "link": "https://sports.yahoo.com/article/ra-l-jim-nez-puts-045921671.html",
    "timestamp": "2025-03-21T04:59:21Z"
  },
  {
    "title": "Elon Musk may soon get access to US's top-secret plans against China",
    "description": "Elon Musk is expected to visit the Pentagon on Friday to access top-secret military plans for a potential war with China. This access would expand his advisory role in the Trump administration. The plans include details on Chinese targets and would be present…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-may-soon-get-access-to-uss-top-secret-plans-against-china/articleshow/119285314.cms",
    "timestamp": "2025-03-21T04:58:10Z"
  },
  {
    "title": "Trump Calls Out \"Failing\" NYT For \"Fake News\" Over Musk's Pentagon Visit",
    "description": "Defense Secretary Pete Hegseth has invited Elon Musk to the Pentagon amid major cuts in spending.",
    "link": "https://www.ndtv.com/world-news/trump-calls-out-failing-nyt-for-fake-news-over-musks-pentagon-visit-7973659",
    "timestamp": "2025-03-21T04:57:57Z"
  },
  {
    "title": "Larry Summers Calls Trump Tariffs 'Self-Inflicted Wound' As Fed Navigates Inflation Worries: 'Policy Is Moving In Wrong Direction'",
    "description": "Former Treasury Secretary Larry Summers warned on Thursday that President Donald Trump‘s tariff policies are creating a “self-inflicted wound” on the U.S. economy, pushing inflation up while threatening growth.\nWhat Happened: “We should be focused on the fact…",
    "link": "https://biztoc.com/x/d7181ac4deb521fa",
    "timestamp": "2025-03-21T04:56:10Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed after Wall St edges lower on US policy uncertainty",
    "description": "Asian shares are mixed after Wall Street retreated as investors were rattled by uncertainties brought by U.S. President Donald Trump",
    "link": "https://abcnews.go.com/Business/wireStory/stock-market-today-asian-shares-mixed-after-wall-120012544",
    "timestamp": "2025-03-21T04:54:34Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed after Wall St edges lower on US policy uncertainty",
    "description": "Asian shares are mixed after Wall Street retreated as investors were rattled by uncertainties brought by U.S. President Donald Trump. U.S. futures were nearly unchanged and oil prices advanced. Hong Kong’s Hang Seng Index tumbled 2% after China kept its key l…",
    "link": "https://www.seattlepi.com/news/world/article/stock-market-today-asian-shares-are-mixed-after-20233376.php",
    "timestamp": "2025-03-21T04:53:26Z"
  },
  {
    "title": "Trump Withdrawing Paul Weiss Order After $40 Million Agreement - Bloomberg",
    "description": "Trump Withdrawing Paul Weiss Order After $40 Million AgreementBloomberg Big Law Firm Reaches Deal With Trump Over Executive OrderThe New York Times ADDRESSING RISKS FROM PAUL WEISSThe White House Conservative former federal judge says Trump has ‘declared war’…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176782173",
    "timestamp": "2025-03-21T04:53:23Z"
  },
  {
    "title": "ΙΟC's new president Coventry wants sit-down with Trump on LA 2028 Games",
    "description": "International Olympic Committee's newly-elected President Kirsty Coventry wants to sit down with United States President Donald Trump to make sure the Los Angeles 2028 Olympics are successful, she said on Thursday. &quot;President Trump is a huge supporter of…",
    "link": "https://japantoday.com/category/sports/olympics-%CE%B9%CE%BFc%27s-new-president-coventry-wants-sit-down-with-trump-on-la-2028-games1",
    "timestamp": "2025-03-21T04:50:06Z"
  },
  {
    "title": "Jordan Klepper Exposes This 'Sloppy' Trump Admin Move Amid 'DEI Purge'",
    "description": "The \"Daily Show\" host mocked the Pentagon over its \"classic mistake\" involving an American icon.",
    "link": "https://www.huffpost.com/entry/daily-show-jordan-klepper-dei-pentagon-jackie-robinson_n_67dcddede4b0460d5a6d8150",
    "timestamp": "2025-03-21T04:49:09Z"
  },
  {
    "title": "With aid cuts looming, Rohingya refugees in Bangladesh face halved rations and misery",
    "description": "Frustration runs high in sprawling camps of Rohingya refugees in Bangladesh after U.S. President Donald Trump ordered the freeze on American foreign aid",
    "link": "https://abcnews.go.com/International/wireStory/aid-cuts-looming-rohingya-refugees-bangladesh-face-halved-120012089",
    "timestamp": "2025-03-21T04:46:25Z"
  },
  {
    "title": "Trump invokes wartime powers to boost U.S. critical mineral production",
    "description": "CANBERRA -- U.S. President Donald Trump will wield wartime powers in a bid to increase U.S. production and processing of critical minerals, characterizing the nation's reliance on foreign country's for such materials as an acute threat to its security.\nAn exe…",
    "link": "https://biztoc.com/x/b79e87f54ebed428",
    "timestamp": "2025-03-21T04:44:54Z"
  },
  {
    "title": "Metaplanet Appoints Eric Trump to Newly Formed Strategic Advisory Board",
    "description": "Metaplanet has named Eric Trump as the first member of its new Strategic Board of Advisors, part of its push to expand Bitcoin \"adoption.\"",
    "link": "https://decrypt.co/311041/metaplanet-appoints-eric-trump-to-newly-formed-strategic-advisory-board",
    "timestamp": "2025-03-21T04:42:35Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed after Wall St edges lower on US policy uncertainty",
    "description": "HONG KONG (AP) — Asian shares were mixed on Friday after Wall Street retreated as investors were rattled by uncertainties brought by U.S. President Donald Trump. U.S. futures were nearly unchanged and oil prices advanced. Chinese markets declined for a second…",
    "link": "https://financialpost.com/pmn/stock-market-today-asian-shares-are-mixed-after-wall-st-edges-lower-on-us-policy-uncertainty",
    "timestamp": "2025-03-21T04:40:24Z"
  },
  {
    "title": "Jimmy Kimmel Says Trump Wants to Close the Department of Education Because ‘Ignorance Is Bliss’ | Video",
    "description": "\"Trump famously said he loves the poorly educated, and now he will have so many more people to love,\" the ABC host jokes\nThe post Jimmy Kimmel Says Trump Wants to Close the Department of Education Because ‘Ignorance Is Bliss’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-monologue-trump-department-of-education/",
    "timestamp": "2025-03-21T04:39:42Z"
  },
  {
    "title": "Facing anti-DEI investigations, colleges cut ties with nonprofit targeted by conservatives",
    "description": "The U.S. Education Department says it has investigated dozens of universities for alleged racial discrimination, citing ties to a nonprofit organization that has helped Black and Latino students pursue business degrees",
    "link": "https://abcnews.go.com/US/wireStory/facing-anti-dei-investigations-colleges-cut-ties-nonprofit-120011462",
    "timestamp": "2025-03-21T04:38:32Z"
  },
  {
    "title": "Hegseth says he'll meet with Musk at the Pentagon to discuss 'efficiencies'",
    "description": "Defense Secretary Pete Hegseth says he will be meeting with billionaire Elon Musk at the Pentagon Friday to discuss “innovation, efficiencies & smarter production.”",
    "link": "https://abcnews.go.com/Politics/wireStory/hegseth-hell-meet-musk-pentagon-discuss-efficiencies-120011009",
    "timestamp": "2025-03-21T04:38:19Z"
  },
  {
    "title": "Pentagon to brief Musk on top-secret plan for potential war with China: Reports",
    "description": "Billionaire Elon Musk is set to be briefed on U.S. military plans concerning potential conflict with China, raising questions about his dual roles as a Trump adviser and business magnate. The Pentagon confirmed Musk's visit but did not share details. The brie…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/pentagon-to-brief-musk-on-top-secret-plan-for-potential-war-with-china-nyt-reports/articleshow/119285035.cms",
    "timestamp": "2025-03-21T04:35:27Z"
  },
  {
    "title": "Exclusive-India's $23 billion plan to rival China factories to lapse after it disappoints",
    "description": "Indian Prime Minister Narendra Modi's government has decided to let lapse a $23 billion program to incentivize domestic manufacturing, just four years after ...",
    "link": "https://sg.finance.yahoo.com/news/exclusive-indias-23-billion-plan-043345254.html",
    "timestamp": "2025-03-21T04:33:45Z"
  },
  {
    "title": "Tahawwur Rana: US SC justices to hear 26/11 Mumbai terror accused's renewed application seeking stay of extradition",
    "description": "US Supreme Court justices will review Tahawwur Rana's renewed application seeking to halt his extradition to India. Rana, accused in the 2008 Mumbai terror attacks, argues that extradition risks torture and worsens his severe health issues. The Supreme Court …",
    "link": "https://economictimes.indiatimes.com/news/india/tahawwur-rana-us-sc-justices-to-hear-26/11-mumbai-terror-accuseds-renewed-application-seeking-stay-of-extradition/articleshow/119284655.cms",
    "timestamp": "2025-03-21T04:24:59Z"
  },
  {
    "title": "Tahawwur Rana: US SC justices to hear 26/11 Mumbai terror accused's renewed application seeking stay of extradition",
    "description": "US Supreme Court justices will review Tahawwur Rana's renewed application seeking to halt his extradition to India. Rana, accused in the 2008 Mumbai terror attacks, argues that extradition risks torture and worsens his severe health issues. The Supreme Court …",
    "link": "https://economictimes.indiatimes.com/news/india/tahawwur-rana-us-sc-justices-to-hear-26/11-mumbai-terror-accuseds-renewed-application-seeking-stay-of-extradition/articleshow/119284836.cms",
    "timestamp": "2025-03-21T04:24:59Z"
  },
  {
    "title": "Trump Admin Threatens to Stop Social Security If DOGE Can’t Have Personal Data",
    "description": "Lee Dudek, Trump’s interim Social Security chief, says he wants to turn off the program if Musk and DOGE can’t access Americans’ most sensitive data.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-musk-stop-social-security-doge-data-1235300785/",
    "timestamp": "2025-03-21T04:18:48Z"
  },
  {
    "title": "Detentions of European tourists at US borders spark fears of traveling to America",
    "description": "U.S. authorities have arrested and detained Canadian and European travelers at U.S. borders in recent weeks",
    "link": "https://abcnews.go.com/Travel/wireStory/detentions-european-tourists-us-borders-spark-fears-traveling-120011457",
    "timestamp": "2025-03-21T04:14:20Z"
  },
  {
    "title": "US Sanctions First Chinese ‘Teapot’ Refinery Over Iran Links",
    "description": "The US is sanctioning a Chinese oil refinery and a terminal operator over links to Iranian crude imports, in the first measures to directly target China’s refining system as President Donald Trump seeks to press Tehran into a fresh nuclear deal.",
    "link": "https://www.livemint.com/companies/news/us-sanctions-first-chinese-teapot-refinery-over-iran-links-11742530419551.html",
    "timestamp": "2025-03-21T04:13:39Z"
  },
  {
    "title": "US Sanctions Chinese Refinery It Says Is Linked to Iran",
    "description": "The US is sanctioning a Chinese oil refinery and its chief executive officer for allegedly buying Iranian oil, as President Donald Trump demands that Tehran agree to a new deal to restrict its nuclear program.",
    "link": "https://www.livemint.com/companies/news/us-sanctions-chinese-refinery-it-says-is-linked-to-iran-11742530419097.html",
    "timestamp": "2025-03-21T04:13:38Z"
  },
  {
    "title": "US Sanctions First Chinese ‘Teapot’ Refinery Over Iran Links",
    "description": "The US is sanctioning a Chinese oil refinery and a terminal operator over links to Iranian crude imports, in the first measures to directly target China’s refining system as President Donald Trump seeks to press Tehran into a fresh nuclear deal.",
    "link": "https://financialpost.com/pmn/business-pmn/us-sanctions-first-chinese-teapot-refinery-over-iran-links",
    "timestamp": "2025-03-21T04:12:50Z"
  },
  {
    "title": "Trump orders dismantling of Department of Education",
    "description": "US President Donald Trump has ordered the dismantling of the Department of Education Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614565-trump-guts-department-education/",
    "timestamp": "2025-03-21T04:10:12Z"
  },
  {
    "title": "Gold Price Paradox: A $13 billion naked short on yellow metal in India that loves glitter",
    "description": "In 2015, India’s finance ministry introduced a sovereign gold bond program to reduce gold imports and offer returns linked to gold prices. However, the program turned costly as gold prices surged, resulting in significant government liabilities. Taxpayers now…",
    "link": "https://economictimes.indiatimes.com/news/economy/finance/gold-price-paradox-a-13-billion-naked-short-on-yellow-metal-in-india-that-loves-glitter/articleshow/119283886.cms",
    "timestamp": "2025-03-21T04:10:08Z"
  },
  {
    "title": "Financial folly or pressure tactic? Trump eyes Ukraine's occupied nuclear plant",
    "description": "The vast plant is beset with problems and it would be years before there is even a hope of it making a return on investment.",
    "link": "https://www.japantimes.co.jp/news/2025/03/21/world/politics/trump-ukraine-nuclear-plant/",
    "timestamp": "2025-03-21T04:10:00Z"
  },
  {
    "title": "China Imports of US Commodities, Cars Collapse in New Trade War",
    "description": "China’s imports of US cotton, cars and some energy products all plunged in the first two months of the year after President Donald Trump started imposing tariffs and Beijing retaliated.",
    "link": "https://financialpost.com/pmn/business-pmn/china-imports-of-us-commodities-cars-collapse-in-new-trade-war",
    "timestamp": "2025-03-21T04:07:51Z"
  },
  {
    "title": "‘Daily Show’ co-host Jordan Klepper calls out studio audience for cheering Tesla arsonists",
    "description": "The scene occurred after Klepper played a montage of news reports about the vandalized and destroyed electric vehicles.",
    "link": "https://nypost.com/2025/03/21/media/the-daily-show-co-host-jordan-klepper-calls-out-audience-for-cheering-tesla-terrorism/",
    "timestamp": "2025-03-21T04:06:54Z"
  },
  {
    "title": "US Citizen George Glezmann Freed From Taliban After 2.5 Years",
    "description": "US Secretary of State Marco Rubio said that George Glezmann, who was wrongfully detained in Afghanistan for two and a half years, was freed.",
    "link": "https://www.ndtv.com/world-news/us-citizen-george-glezmann-freed-from-taliban-after-2-5-years-7973376",
    "timestamp": "2025-03-21T04:05:38Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,121",
    "description": "These are the key developments on day 1,121 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/3/21/russia-ukraine-war-list-of-key-events-day-1121",
    "timestamp": "2025-03-21T04:05:31Z"
  },
  {
    "title": "War on Iran Would Be No Cakewalk",
    "description": "Politicians often fail to grasp how terrible a proposed conflict would be.\nThe post War on Iran Would Be No Cakewalk appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/war-on-iran-would-be-no-cakewalk/",
    "timestamp": "2025-03-21T04:05:00Z"
  },
  {
    "title": "Trump’s Shock and Awe: Move Fast and Break Things",
    "description": "( Tomdispatch.com ) - Yes, “shock and awe” is back in the second age of Donald Trump. His border czar, Tom Homan, used that very phrase to describe border policy from day one of the new administration and, whether the president has actually said it or not, it…",
    "link": "https://www.juancole.com/2025/03/trumps-shock-things.html",
    "timestamp": "2025-03-21T04:04:00Z"
  },
  {
    "title": "Are the El Salvador Deportations Justifiable?",
    "description": "Do unparalleled abuses demand unparalleled solutions?\nThe post Are the El Salvador Deportations Justifiable? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/the-el-salvador-deportations-pros-and-cons/",
    "timestamp": "2025-03-21T04:03:00Z"
  },
  {
    "title": "Time for New Borders Again as Another POTUS Does Yalta",
    "description": "Well, the Trumpian box of chocolates continues to yield its surprises. Just as Forest Grump once averred. We are referring to the news that Donald Trump may acknowledge the obvious in his peace negotiations with Putin. To wit, that the Russian-speaking, Russi…",
    "link": "https://www.lewrockwell.com/2025/03/david-stockman/time-for-new-borders-again-as-another-potus-does-yalta/",
    "timestamp": "2025-03-21T04:01:00Z"
  },
  {
    "title": "19 Reasons Why the Federal Reserve Is at the Heart of Our Economic Problems",
    "description": "Most Americans have absolutely no idea how we got into the mess that we are in today.  The reason why the U.S. government is 36 trillion dollars in debt and our society as a whole is 102 trillion dollars in debt is because the system is performing exactly as …",
    "link": "https://www.lewrockwell.com/2025/03/michael-snyder/19-reasons-why-the-federal-reserve-is-at-the-heart-of-our-economic-problems/",
    "timestamp": "2025-03-21T04:01:00Z"
  },
  {
    "title": "Evidences that Israel Controls the U.S. Government",
    "description": "On March 15th, Chris Hedges headlined “On the Precipice of Darkness: Normalizing genocide and the new world order”, and opened: My old office in Gaza is a pile of rubble. The streets around it, where I went for a coffee, ordered maftool or manakish, had a hai…",
    "link": "https://www.lewrockwell.com/2025/03/no_author/evidences-that-israel-controls-the-u-s-government/",
    "timestamp": "2025-03-21T04:01:00Z"
  },
  {
    "title": "The Ukraine War: Frank Talk, Liberal to Liberal",
    "description": "It doesn’t really pay for a liberal to see through propaganda because you either alienate yourself from all your liberal friends who are wallowing in it, or you sit in crushing silence out of fear of being ostracized. To be true to myself, I’ve opted for the …",
    "link": "https://original.antiwar.com/timothy_cook/2025/03/20/the-ukraine-war-frank-talk-liberal-to-liberal/",
    "timestamp": "2025-03-21T04:00:13Z"
  },
  {
    "title": "President Trump’s Siberian Shuffle: Playing the Long Game with Russia",
    "description": "The spectacle of global diplomacy rarely produces moments of unvarnished clarity, but when President Donald Trump met Ukrainian President Volodymyr Zelensky in Washington on February 28, the message could not have been starker: the war in Ukraine is ...",
    "link": "https://www.americanthinker.com/articles/2025/03/president_trump_s_siberian_shuffle_playing_the_long_game_with_russia.html",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "The sex allegations against influencer Harry Sisson and the rise of the Manchurian",
    "description": "Harry Sisson, the downy-faced youth who made a name for himself telling young voters that Biden was a wonderful, brilliant man and that Kamala was even more wonderful and brilliant, has been accused of being a sex predator who enticed multiple women ...",
    "link": "https://www.americanthinker.com/blog/2025/03/the_sex_allegations_against_influencer_harry_sisson_and_the_rise_of_the_manchurian.html",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "The Borg of Uncle Sam...",
    "description": "I grew up in the shadow of World War II. It had been over for almost 30 years by the time I started school. Nonetheless, WWII was probably the most talked about subject in my history classes throughout. But the funny thing is, as close as it was, it ...",
    "link": "https://www.americanthinker.com/articles/2025/03/the_borg_of_uncle_sam.html",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "How Trump's tariffs are wreaking chaos in the British metal industry",
    "description": "As the clock ticked down towards 12.01am Eastern Standard Time on 12 March, Liam Bates kept refreshing his browser.",
    "link": "https://news.sky.com/story/how-donald-trumps-tariffs-are-wreaking-chaos-in-the-british-metal-industry-13331951",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "Autopen: The ticking time bomb",
    "description": "Joseph Biden’s lack of mental acuity was never a closely guarded secret.  It was just portrayed as irrelevant to his presidency, and the corrupt media swallowed this whole.  Now that an obviously competent president named Do...",
    "link": "https://www.americanthinker.com/blog/2025/03/autopen_the_ticking_time_bomb.html",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "Kennedy Center employee strips naked to whine about Trump, gets himself fired",
    "description": "What is it about crazed leftists and their toddler-like urge to run around without their pants on?\r\n\r\nHere's the latest charmer, who until now, worked for the Kennedy Center for the Performing Arts, as reported by the Los Angeles Times:\r\n\r\n\r\nA Ke...",
    "link": "https://www.americanthinker.com/blog/2025/03/kennedy_center_employee_strips_naked_to_whine_about_trump_gets_himself_fired.html",
    "timestamp": "2025-03-21T04:00:00Z"
  },
  {
    "title": "European Council urges immediate ceasefire and hostage release in Gaza",
    "description": "European Council says it \"deplores\" both the recent breakdown of the ceasefire in Gaza as well as Hamas' refusal to release hostages, calls for full implementation of the ceasefire.",
    "link": "https://www.israelnationalnews.com/news/405698",
    "timestamp": "2025-03-21T03:51:27Z"
  },
  {
    "title": "From bumper stickers to boycotts, how Tesla owners are distancing themselves from Elon Musk",
    "description": "Many Tesla owners who were once proud to own the electric vehicle are reportedly now embarrassed to be associated with the brand as public furor against the company and its CEO, billionaire Elon Musk, gains momentum.",
    "link": "https://www.cbc.ca/news/business/tesla-elon-musk-car-owners-1.7489099",
    "timestamp": "2025-03-21T03:50:14Z"
  },
  {
    "title": "Self-deport or be banned forever: Trump launches CBP Home app for illegal migrants",
    "description": "US President Donald Trump has launched the CBP Home app, allowing illegal residents to self-deport. He warns that those who don't comply will face forcible removal and a lifetime ban, while voluntary departures may be eligible for future legal re-entry.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/self-deport-or-be-banned-forever-trump-launches-cbp-home-app-for-illegal-migrants/articleshow/119283582.cms",
    "timestamp": "2025-03-21T03:49:43Z"
  },
  {
    "title": "Bitcoin price thaws after Trump statement — Trader says ‘stay nimble and cashed up’",
    "description": "price rallied to an intraday high of $87,453 in the early hours of the NY trading session but quickly retraced its gains to $83,655 shortly after US President Donald Trump made a video appearance at the Digital Asset Summit in New York.\nPrior to the video sta…",
    "link": "https://biztoc.com/x/15a869f96e7c56cb",
    "timestamp": "2025-03-21T03:48:07Z"
  },
  {
    "title": "Cybertrucks are being recalled in the US. Will they ever hit Australian roads?",
    "description": "US regulators have recalled 46,000 Cybertrucks in the latest in a series of call-backs for the controversial pick-up truck.",
    "link": "https://www.abc.net.au/news/2025-03-21/regulators-recall-cybertrucks-in-the-us/105079924",
    "timestamp": "2025-03-21T03:46:36Z"
  },
  {
    "title": "Trump’s call for AI deregulation gets strong backing from Big Tech",
    "description": "Major tech firms are pushing the administration of President Donald Trump to loosen rules on building artificial intelligence, arguing it is the only way to maintain a US edge and compete with China.  Spooked by generative AI’s sudden advance, governments ini…",
    "link": "https://www.digitaljournal.com/world/trumps-call-for-ai-deregulation-gets-strong-backing-from-big-tech/article",
    "timestamp": "2025-03-21T03:42:34Z"
  },
  {
    "title": "Trump's Call For AI Deregulation Gets Strong Backing From Big Tech",
    "description": "Major tech firms are pushing the administration of President Donald Trump to loosen rules on building artificial intelligence, arguing it is the only way to maintain a US edge and compete with China.",
    "link": "https://www.ibtimes.com/trumps-call-ai-deregulation-gets-strong-backing-big-tech-3767159",
    "timestamp": "2025-03-21T03:42:10Z"
  },
  {
    "title": "'Up to 20 years in jail for vandalising Teslas': Donald Trump revs ups warnings to attackers, 'financial backers'",
    "description": "US President Donald Trump has warned that individuals involved in sabotaging Teslas could face up to 20 years in prison. This statement comes amidst a series of attacks on Tesla properties in left-leaning cities, which investigators believe may be organized a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/up-to-20-years-in-jail-for-vandalising-teslas-donald-trump-revs-ups-warnings-to-attackers-financial-backers/articleshow/119283121.cms",
    "timestamp": "2025-03-21T03:37:26Z"
  },
  {
    "title": "Trump uses emergency powers to boost mineral production",
    "description": "Trump uses emergency powers to boost mineral production\nUS President Donald Trump has invoked emergency powers to expand domestic production of critical minerals as he tries to reduce US reliance on imports from countries like China.\nThe executive order, whic…",
    "link": "https://biztoc.com/x/6c8f847943ea1938",
    "timestamp": "2025-03-21T03:37:08Z"
  },
  {
    "title": "Nebraska's governor in DC for education executive order",
    "description": "Nebraska Gov. Jim Pillen supports President Trump's order to minimize the Department of Education.",
    "link": "https://www.ketv.com/article/increase-local-influence-gov-pillen-in-dc-for-education-executive-order/64247501",
    "timestamp": "2025-03-21T03:34:36Z"
  },
  {
    "title": "North Korea says it tested new missiles as it threatens strong steps against U.S.-South Korea drills",
    "description": "North Korea said Friday it test-launched new anti-aircraft missiles, as its military threatened unspecified grave steps against the U.S. and South Korea over their joint military drills that it views as an invasion rehearsal.  The official Korean Central News…",
    "link": "https://japantoday.com/category/world/north-korea-says-it-tested-new-missiles-as-it-threatens-strong-steps-against-us-south-korea-drills",
    "timestamp": "2025-03-21T03:30:06Z"
  },
  {
    "title": "Trump uses emergency powers to boost mineral production",
    "description": "The executive order comes as the US president tries to reduce America's reliance on imports of the vital materials.",
    "link": "https://www.bbc.com/news/articles/cwye089j1zdo",
    "timestamp": "2025-03-21T03:29:37Z"
  },
  {
    "title": "Pollster Explains Why He Believes Trump’s Poll Numbers Are Higher Than Reported",
    "description": "Pollster Matt Towery said he believes Trump's poll numbers are likely higher than reported due to the Democratic Party \"plummeting\" in the polls.",
    "link": "https://dailycaller.com/2025/03/20/pollster-matt-towery-donald-trump-polls-democrats/",
    "timestamp": "2025-03-21T03:24:12Z"
  },
  {
    "title": "'Fake News is at it again': Trump lashes out as he blasts 'disgraceful' NYT report",
    "description": "President Donald Trump lashed out at The New York Times late Thursday after the paper reported tech billionaire Elon Musk is set to receive a briefing on top-secret military plans in the event of a war with China.The Times said it spoke with two U.S. official…",
    "link": "https://www.rawstory.com/donald-trump-elon-musk-2671374331/",
    "timestamp": "2025-03-21T03:24:10Z"
  },
  {
    "title": "Trump administration to expand oil, gas drilling in Alaska",
    "description": "WASHINGTON, March 20 (Xinhua) -- The U.S. Secretary of the Interior Doug Burgum on Thursday announce",
    "link": "http://en.people.cn/n3/2025/0321/c90000-20292269.html",
    "timestamp": "2025-03-21T03:23:53Z"
  },
  {
    "title": "North Korea says it tested new missiles as it threatens strong steps against U.S.-South Korea drills",
    "description": "North Korea said it had test-launched new anti-aircraft missiles, as its military threatened unspecified grave steps against the U.S. and South Korea over their joint military drills.",
    "link": "https://www.nbcnews.com/news/world/north-korea-says-tested-new-missiles-threatens-us-south-korea-rcna197419",
    "timestamp": "2025-03-21T03:23:33Z"
  },
  {
    "title": "Oil industry leader goes inside Trump's closed-door meeting with top execs",
    "description": "President Donald Trump has a multi-faceted plan to restore U.S. energy dominance after four years of the Biden administration giving the fossil fuel industry the cold shoulder, oil executive Mike Sommers told FOX Business on Thursday. The American Petroleum I…",
    "link": "https://freerepublic.com/focus/f-chat/4305752/posts",
    "timestamp": "2025-03-21T03:19:27Z"
  },
  {
    "title": "Italian paper prints fully-AI edition, but not to 'kill' journalism",
    "description": "Il Foglio, a daily broadsheet with an irreverent touch and a circulation of about 29,000, says it is the first newspaper in the world to print entire editions created through artificial intelligence, a nascent technology that is rapidly changing how newsrooms…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/italian-paper-prints-fully-ai-edition-but-not-to-kill-journalism/articleshow/119282611.cms",
    "timestamp": "2025-03-21T03:18:02Z"
  },
  {
    "title": "Trump rescinds executive order targeting Paul Weiss after law firm agrees to drop DEI hiring practices",
    "description": "President Donald Trump has reversed his executive order aimed at law firm Paul Weiss.\nCarlos Barria/REUTERS\nPresident Donald Trump reversed an executive order aimed at the law firm Paul Weiss.\nAs part of the agreement, Paul Weiss pledge $40 million in pro bon…",
    "link": "https://biztoc.com/x/a94cfd5df0764bdb",
    "timestamp": "2025-03-21T03:14:41Z"
  },
  {
    "title": "Trump rescinds executive order targeting Paul Weiss after law firm agrees to drop DEI hiring practices",
    "description": "Trump said he'd rescind an executive order targeting Paul Weiss. The firm agreed to drop DEI hiring practices and offer $40 million in pro bono services.",
    "link": "https://www.businessinsider.com/paul-weiss-law-dei-practices-trump-2025-3",
    "timestamp": "2025-03-21T03:09:42Z"
  }
]