[
  {
    "title": "Shrimp shift: Indian seafood exporters turn to China after US tariff shock",
    "description": "US has levied a 50% tax on Indian shipments, making it difficult for shrimp exporters to compete with Ecuador, Vietnam and Indonesia.",
    "link": "https://www.livemint.com/industry/shrimp-indian-seafood-exporters-china-us-tariff-shock-re-export-market-11758625601049.html",
    "timestamp": "2025-09-23T14:30:03Z"
  },
  {
    "title": "Which Way, Democrats",
    "description": "Did they game this one out?\nPresident Donald Trump on Tuesday appeared to cancel a planned meeting this week with the two top Democrats in Congress, just days before the federal government is set to shut down.\n\nTrump had been scheduled to meet with Senate and…",
    "link": "https://www.eschatonblog.com/2025/09/which-way-democrats.html",
    "timestamp": "2025-09-23T14:30:00Z"
  },
  {
    "title": "Ørsted Shares Soar on U.S. Court Win over Offshore Wind Farm",
    "description": "Shares in Ørsted (CPH: ORSTED) surged by 12% at opening in Copenhagen on Tuesday after a U.S. court blocked last month’s Trump Administration stop-work order on a nearly completed offshore wind project. Ørsted and its joint venture partner Skyborn Renewables …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/rsted-Shares-Soar-on-US-Court-Win-over-Offshore-Wind-Farm.html",
    "timestamp": "2025-09-23T14:30:00Z"
  },
  {
    "title": "Wall Street holds near its record heights",
    "description": "U.S. stock indexes are holding near their record heights.",
    "link": "https://www.bostonherald.com/2025/09/23/stock-market-record-heights-run/",
    "timestamp": "2025-09-23T14:29:17Z"
  },
  {
    "title": "Trump administration proposes H-1B overhaul, favours higher-paid skilled workers",
    "description": "The move follows a White House proclamation introducing a $100,000 annual fee for H-1B visas, aimed at protecting American workers from wage competition.",
    "link": "https://www.thehindubusinessline.com/info-tech/trump-administration-proposes-h-1b-overhaul-favours-higher-paid-skilled-workers/article70085321.ece",
    "timestamp": "2025-09-23T14:29:08Z"
  },
  {
    "title": "‘Too much liquid’: Trump pretends he’s qualified to give medical advice (he’s not)",
    "description": "Donald Trump is the last person anyone should ever turn to for guidance on medicine and vaccines, but that didn't stop him from peddling dangerous nonsense.",
    "link": "https://biztoc.com/x/7176518131b34e64",
    "timestamp": "2025-09-23T14:28:47Z"
  },
  {
    "title": "Trump Torches 'Ridiculous' Democratic Leaders, Cancels Shutdown Meeting",
    "description": "President Donald Trump lashed out at what he called \"unserious and ridiculous demands\" from Democrats to avert a federal government shutdown.\nTrump said in a post on Truth Social that he had concluded that \"no meeting with their Congressional Leaders could po…",
    "link": "https://biztoc.com/x/1f6cc5559faecc9a",
    "timestamp": "2025-09-23T14:28:27Z"
  },
  {
    "title": "Trump whines about 'brutal slog' of governing as he cancels shutdown meeting with Dems",
    "description": "President Donald Trump canceled a meeting with top Democrats, stating that he did not want to deal with the \"long and brutal slog\" of governing.In a wild and rambling rant on Tuesday, the president said demands for funding health care were \"unserious and ridi…",
    "link": "https://www.rawstory.com/trump-government-shutdown-2674024843/",
    "timestamp": "2025-09-23T14:28:21Z"
  },
  {
    "title": "Where High-Skilled Immigrants Are Most Urgently Needed",
    "description": "Just as the dust is starting to settle on the flurry of new tariffs imposed by the Trump administration, a new proclamation from President Donald Trump has sent shockwaves through corporate America. On Friday, the president signed a proclamation taking aim at…",
    "link": "https://biztoc.com/x/7c18870f062e81f7",
    "timestamp": "2025-09-23T14:28:17Z"
  },
  {
    "title": "'Whoever is operating this…': When Trump had to deliver his speech at the UN without a teleprompter",
    "description": "Donald Trump's return to the UN was marked by initial technical difficulties, including a malfunctioning teleprompter and a broken escalator, which he addressed with his characteristic humor. Shifting to substantive issues, Trump criticized the UN's peace eff…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/whoever-is-operating-this-when-trump-had-to-deliver-his-speech-at-the-un-without-a-teleprompter/articleshow/124073130.cms",
    "timestamp": "2025-09-23T14:28:15Z"
  },
  {
    "title": "Coalition Backs Trump’s Efforts To Purge ‘Woke’ Smithsonian Exhibits",
    "description": "By George Caldwell, The Daily Signal | September 22, 2025\nA coalition of conservative organizations has written a letter to President Donald Trump urging him to combat the “the woke infestation” in the Smithsonian Institution museum network.\n“We write today i…",
    "link": "https://biztoc.com/x/26ba3ea899b0942b",
    "timestamp": "2025-09-23T14:28:13Z"
  },
  {
    "title": "Trump: UN not living up to its potential",
    "description": "United States President Donald Trump said on Tuesday at the United Nations General Assembly that the UN has \"tremendous potential\" but that it is \"not even coming close\" to living up to it. \"For the m...",
    "link": "https://biztoc.com/x/7a8411eb26e0e92f",
    "timestamp": "2025-09-23T14:28:13Z"
  },
  {
    "title": "Big tech companies hit by H-1B visa nightmare",
    "description": "On September 19, President Donald Trump signed an executive order that imposes a $100,000 fee for applicants to the H-1B visa program for skilled foreign workers. \nThe H-1B program enables employers in the United States to temporarily hire foreign workers in …",
    "link": "https://biztoc.com/x/4b68501516df1586",
    "timestamp": "2025-09-23T14:28:10Z"
  },
  {
    "title": "Watch: Macron Phones Trump for Help After Being Pushed to the Curb by Presidential Motorcade",
    "description": "French President Emmanuel Macron was stranded on the streets of New York after police blocked roads to make a path for President Donald Trump’s motorcade . How did he respond? Macron called Trump personally in a plea for help (as you do).\nThe post Watch: Macr…",
    "link": "https://www.breitbart.com/europe/2025/09/23/watch-macron-phones-trump-for-help-after-being-pushed-to-the-curb-by-presidential-motorcade/",
    "timestamp": "2025-09-23T14:28:02Z"
  },
  {
    "title": "Largest rail union backs $85 billion merger after job protections, but critics warn of monopoly risk",
    "description": "“For generations, railroaders have worried about what mergers might mean for their jobs,\" union president says.",
    "link": "https://fortune.com/2025/09/23/union-pacific-norfolk-southern-rail-merger-trump-union-endorsement-job-protection-2025/",
    "timestamp": "2025-09-23T14:27:02Z"
  },
  {
    "title": "Secret Service Dismantles ‘Imminent Threat’ in New York Ahead of UN General Assembly",
    "description": "The Secret Service has dismantled a telecommunications network in New York that posed a threat to top government officials.  After multiple telecommunications threats were directed... Read More\nThe post Secret Service Dismantles ‘Imminent Threat’ in New York …",
    "link": "https://www.dailysignal.com/2025/09/23/secret-service-dismantles-imminent-threat-in-new-york-ahead-un-general-assembly/",
    "timestamp": "2025-09-23T14:26:44Z"
  },
  {
    "title": "Trump's Ryder Cup presence 'extremely important' after 'tough few weeks,' Scottie Scheffler says",
    "description": "Scottie Scheffler said he is excited about President Donald Trump attending the Ryder Cup at Bethpage Black as Team USA looks to take back the trophy against Team Europe.",
    "link": "https://www.foxnews.com/sports/trumps-ryder-cup-presence-extremely-important-after-tough-few-weeks-scottie-scheffler-says",
    "timestamp": "2025-09-23T14:26:16Z"
  },
  {
    "title": "Lula tells UN that attacks on Brazilian judiciary unacceptable",
    "description": "(Reuters) -Brazilian President Luiz Inacio Lula da Silva told the U.N. General Assembly on Tuesday that recent \"unilateral attacks\" against his country's institutions, economy and judiciary were unacceptable, in a thinly veiled response to U.S. foreign policy…",
    "link": "https://www.thestar.com.my/news/world/2025/09/23/lula-tells-un-that-attacks-on-brazilian-judiciary-unacceptable",
    "timestamp": "2025-09-23T14:24:00Z"
  },
  {
    "title": "US Marshals Find Missing Child With Illegals Near Chicago As Trump Admin Cracks Down On City",
    "description": "U.S. Marshals located a missing girl with two illegal migrants in the Chicago area as the Trump administration cracks down on the infamous sanctuary city.",
    "link": "https://dailycaller.com/2025/09/23/feds-locate-child-with-chicago-illegals/",
    "timestamp": "2025-09-23T14:23:25Z"
  },
  {
    "title": "Donald Trump: Watch his UN speech live",
    "description": "According to the White House press secretary, Trump will criticize the institutions that have “undermined the global order” and will present “his vision for the world”\nThe post Donald Trump: Watch his UN speech live appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/09/23/donald-trump-watch-his-un-speech-live/",
    "timestamp": "2025-09-23T14:22:54Z"
  },
  {
    "title": "Is Trump Taking Treaties Back to the Middle Ages?",
    "description": "The White House has usurped the power to make foreign treaties and keeps their texts secret.",
    "link": "http://foreignpolicy.com/2025/09/23/trump-congress-power-treaties-trade-deals-peace-agreement-king/",
    "timestamp": "2025-09-23T14:22:31Z"
  },
  {
    "title": "Kamala Harris Rattles Off Trump-Defying Acts Like Kimmel’s Return As Signs Of Hope",
    "description": "Kamala Harris cited the return of Jimmy Kimmel among a list of acts defying Trump as she gave Rachel Maddow some encouraging signs for the resistance.\nThe post Kamala Harris Rattles Off Trump-Defying Acts Like Kimmel’s Return As Signs Of Hope first appeared o…",
    "link": "https://www.mediaite.com/media/news/kamala-harris-rattles-off-trump-defying-acts-like-kimmels-return-as-signs-of-hope/",
    "timestamp": "2025-09-23T14:21:19Z"
  },
  {
    "title": "US business activity moderates further in September",
    "description": "WASHINGTON (Reuters) -U.S. business activity slowed for a second straight month in September, and though firms complained about tariffs raising costs, they...",
    "link": "https://finance.yahoo.com/news/us-business-activity-moderates-further-141848724.html",
    "timestamp": "2025-09-23T14:18:48Z"
  },
  {
    "title": "US business activity moderates further in September",
    "description": "WASHINGTON (Reuters) -U.S. business activity slowed for a second straight month in September, and though firms complained about tariffs raising costs, they...",
    "link": "https://ca.finance.yahoo.com/news/us-business-activity-moderates-further-141848339.html",
    "timestamp": "2025-09-23T14:18:48Z"
  },
  {
    "title": "Trump tells UNGA that illegal border crossings in US have been zero for four months",
    "description": "Addressing the UN, US President Donald Trump stated a significant drop in illegal immigration. He highlighted America's economic resurgence, citing lower energy prices and defeated inflation. Trump mentioned record stock market performance and rising wages. H…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-tells-unga-that-illegal-border-crossings-in-us-have-been-zero-for-four-months/articleshow/124072511.cms",
    "timestamp": "2025-09-23T14:18:16Z"
  },
  {
    "title": "Trump cancels meeting with Democratic leaders ahead of government shutdown deadline | CNN Politics",
    "description": "President Donald Trump said he is scrapping a White House meeting with top congressional Democrats later this week, as the threat of a government shutdown looms over Washington.",
    "link": "https://www.cnn.com/2025/09/23/politics/trump-cancels-meeting-democrats-shutdown",
    "timestamp": "2025-09-23T14:17:54Z"
  },
  {
    "title": "Trump 86’s Scheduled Meeting With Schumer and Jeffries Over ‘Unserious and Ridiculous Demands’",
    "description": "If Congress cannot pass another continuing resolution to keep the government funded, it will shut down at midnight on Oct. 1.\nThe post Trump 86’s Scheduled Meeting With Schumer and Jeffries Over ‘Unserious and Ridiculous Demands’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-86s-scheduled-meeting-with-schumer-and-jeffries-over-unserious-and-ridiculous-demands/",
    "timestamp": "2025-09-23T14:17:37Z"
  },
  {
    "title": "Trump: This is golden age of America",
    "description": "United States President Donald Trump reiterated on Tuesday that this is \"the golden age of America.\"Addressing the United Nations General Assembly (UNGA), he insisted that the US is \"the hottest count...",
    "link": "https://biztoc.com/x/e93c23960ce5ffaa",
    "timestamp": "2025-09-23T14:17:20Z"
  },
  {
    "title": "Trump cancels meeting with Democratic leaders",
    "description": "United States President Donald Trump announced on Tuesday that his meeting with Democratic Senate Minority Leader Chuck Schumer and Democratic House Minority Leader Hakeem Jeffries will not happen.\"Af...",
    "link": "https://biztoc.com/x/2f93bcc1d8fa014b",
    "timestamp": "2025-09-23T14:17:16Z"
  },
  {
    "title": "This Ridiculous, Dangerous Antifa Order Is McCarthyism All Over Again—Possibly Worse",
    "description": "Free speech stole the show last week during the joint press conference\r\n between US President Donald Trump and UK Prime Minister Keir Starmer after a British reporter asked point-blank the Yankee wannabe dictator whether free speech is more under attack in Br…",
    "link": "https://www.commondreams.org/opinion/trump-antifa-order",
    "timestamp": "2025-09-23T14:17:15Z"
  },
  {
    "title": "Donald Trump Shows No Compassion for Joe Biden Since Cancer Diagnosis",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump has made a number of unsympathetic statements about former president Joe Biden since Biden's cancer diagnosis was revealed in May.\nIn September, Biden underwent surgery to remove sk…",
    "link": "https://biztoc.com/x/0b5dfbd8f13e9384",
    "timestamp": "2025-09-23T14:17:12Z"
  },
  {
    "title": "Trump says no meeting with top Democrats on shutdown 'could possibly be productive'",
    "description": "President Donald Trump on Tuesday appeared to cancel a planned meeting this week with the two top Democrats in Congress, just days before the federal government is set to shut down.\nTrump had been scheduled to meet with Senate and House Democratic leaders Chu…",
    "link": "https://biztoc.com/x/1e9eb0a7c17b9b11",
    "timestamp": "2025-09-23T14:16:54Z"
  },
  {
    "title": "US government sued for refusing to release ‘vital’ LGBTQ+ census data",
    "description": "A not-for-profit legal services group is suing the US government over its refusal to publish “critical” LGBTQ+ census information. The lawsuit, filed on Monday (22 September), alleged that the Trump administration “unlawfully” withheld data that would result …",
    "link": "https://www.thepinknews.com/2025/09/23/lgbtq-census-data-lawsuit/",
    "timestamp": "2025-09-23T14:16:21Z"
  },
  {
    "title": "Fact-checking claims Trump made about autism",
    "description": "Experts have hit back at claims that use of a common painkiller could cause autism in children.",
    "link": "https://www.bbc.com/news/articles/cj07e3rjev2o",
    "timestamp": "2025-09-23T14:14:44Z"
  },
  {
    "title": "Kamala Harris Half-Heartedly Backs Socialist Zohran Mamdani Without Even Saying His Name",
    "description": "Former Vice President Kamala Harris offered a lackluster endorsement of Democratic New York City mayoral nominee Zohran Mamdani during a Monday interview.",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-zohran-mamdani-rachel-maddow/",
    "timestamp": "2025-09-23T14:14:31Z"
  },
  {
    "title": "Trump advisers now see few checks left to stand in way of his agenda: report",
    "description": "President Donald Trump has gobbled up power and punished his critics in unprecedented ways in just over half a year back in office, and his administration officials warn they're just getting started.Presidents have commonly sought to stretch the limits of the…",
    "link": "https://www.rawstory.com/donald-trump-power-grab/",
    "timestamp": "2025-09-23T14:13:25Z"
  },
  {
    "title": "TSX hits all-time high, topping key level of 30,000",
    "description": "The S&P/TSX Composite Index rose 0.3% to climb above the key psychological threshold of 30,000 for the first time on Sept. 24. Read more.",
    "link": "https://financialpost.com/investing/tsx-hit-all-time-high-topping-30000",
    "timestamp": "2025-09-23T14:12:50Z"
  },
  {
    "title": "Canadian Stocks Hit a Record, Topping Key Level of 30,000",
    "description": "Canadian stocks hit a new all-time high despite tariff threats and a weakening economy.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-stocks-hit-a-record-topping-key-level-of-30000",
    "timestamp": "2025-09-23T14:12:50Z"
  },
  {
    "title": "Trump cancels meeting with Schumer, Jeffries over 'ridiculous demands' as funding deadline looms",
    "description": "President Donald Trump axed a meeting with Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Hakeem Jeffries, D-N.Y., arguing that the pair were \"unserious.\"",
    "link": "https://www.foxnews.com/politics/schumer-jeffries-meet-trump-white-house-shutdown-deadline-looms",
    "timestamp": "2025-09-23T14:12:22Z"
  },
  {
    "title": "France fully supports conclusion of EU-India trade agreement",
    "description": "France’s Secretary General for Foreign Affairs Anne-Marie Descôtes thanked the Indian side for invitation to President Emmanuel Macron to the AI Impact Summit",
    "link": "https://www.thehindubusinessline.com/economy/france-fully-supports-conclusion-of-eu-india-trade-agreement/article70085140.ece",
    "timestamp": "2025-09-23T14:10:40Z"
  },
  {
    "title": "Trump says no meeting with top Democrats on shutdown 'could possibly be productive'",
    "description": "President Donald Trump appeared to cancel a meeting with the two top Democrats in Congress, just days before the government is set to shut down.",
    "link": "https://www.cnbc.com/2025/09/23/trump-democrats-shutdown-schumer-jeffries.html",
    "timestamp": "2025-09-23T14:10:38Z"
  },
  {
    "title": "Budget 2026 plans will limit response to future economic shocks, committee hears",
    "description": "Economy expected to be 1% smaller after Trump tariffs, Central Bank warns",
    "link": "https://www.irishtimes.com/business/2025/09/23/budget-2026-plans-will-limit-response-to-future-economic-shocks-committee-hears/",
    "timestamp": "2025-09-23T14:10:00Z"
  },
  {
    "title": "'Pay no attention': global health agencies dismiss false Trump claim on everyday painkillers (Oliver Holmes/The Guardian)",
    "description": "Oliver Holmes / The Guardian:\n‘Pay no attention’: global health agencies dismiss false Trump claim on everyday painkillers  —  Medical experts and regulators say US president should not be questioning established science  —  Global health agencies and regulat…",
    "link": "https://www.memeorandum.com/250923/p41",
    "timestamp": "2025-09-23T14:10:00Z"
  },
  {
    "title": "Man representing himself against charges of trying to kill Trump will give his closing argument",
    "description": "Ryan Routh and prosecutors will each have one hour and 45 minutes to make their final cases to jurors.",
    "link": "https://www.bostonherald.com/2025/09/23/closing-arguments-trump-assassination-attempt/",
    "timestamp": "2025-09-23T14:09:44Z"
  },
  {
    "title": "Trump bails on meeting with Democrats to avoid shutdown",
    "description": "Shortly after agreeing to a meeting with Democrats to negotiate over government funding, Trump backed out.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/23/trump-schumer-jeffries-meeting/86307942007/",
    "timestamp": "2025-09-23T14:09:05Z"
  },
  {
    "title": "Tylenol maker rebounds a day after Trump's unfounded claims about its safety",
    "description": "Shares of Tylenol maker Kenvue are bouncing back sharply before the opening bell a day after President Donald Trump promoted unproven and in some cases discredited ties between Tylenol, vaccines and autism.",
    "link": "https://www.clickorlando.com/news/2025/09/23/tylenol-maker-rebounds-a-day-after-trumps-unfounded-claims-about-its-safety/",
    "timestamp": "2025-09-23T14:08:24Z"
  },
  {
    "title": "Rubenstein Expects Powell to Leave Fed When Term Is Over",
    "description": "The Carlyle Group co-Chairman David Rubenstein says he thinks President Donald Trump has already made up his mind about ...",
    "link": "https://biztoc.com/x/fcc739e030a502da",
    "timestamp": "2025-09-23T14:08:18Z"
  },
  {
    "title": "Kamala Harris Tries To Clean Up Her Statement About Not Picking Pete Buttigieg Because He’s Gay",
    "description": "Kamala Harris blamed Donald Trump for her decision to choose Tim Walz over Pete Buttigieg as her running mate in 2024 during an interview with Rachel Maddow.",
    "link": "https://dailycaller.com/2025/09/23/kamala-harris-clarifies-comments-on-pete-buttigieg/",
    "timestamp": "2025-09-23T14:06:15Z"
  },
  {
    "title": "How Donald Trump's H-1B visa fee could affect the US economy",
    "description": "Critics say the president's plan to charge $100,000 application fees for the H-1B visa program will greatly stifle the US economy, with universities, nonprofits and tech startups the most affected.",
    "link": "https://www.dw.com/en/how-donald-trumps-h-1b-visa-fee-could-affect-the-us-economy/a-74109570",
    "timestamp": "2025-09-23T14:06:00Z"
  },
  {
    "title": "How Trump's H-1B visa proposal could impact the US economy",
    "description": "Critics say the US President's plan to charge $100,000 application fees for the H-1B visa program will greatly stifle the US economy, with universities, non-profits and tech start-ups most affected.",
    "link": "https://www.dw.com/en/how-trumps-h-1b-visa-proposal-could-impact-the-us-economy/a-74109570",
    "timestamp": "2025-09-23T14:06:00Z"
  },
  {
    "title": "Unpacking Trump's racist and authoritarian ideology",
    "description": "Authors Jamaica Kincaid, Elizabeth Kolbert and William Hitchcock discussed Trump's attacks on free speech and democracy at Berlin's literature festival.",
    "link": "https://www.dw.com/en/unpacking-trumps-racist-and-authoritarian-ideology/a-74093295",
    "timestamp": "2025-09-23T14:05:00Z"
  },
  {
    "title": "How to watch Jimmy Kimmel's return online — U.S. talk show host back on air after suspension",
    "description": "Here's how to watch the return of 'Jimmy Kimmel Live!' online, as the late-night talkshow makes its sensational comeback days after being suspended \"indefinitely\".",
    "link": "https://www.tomsguide.com/entertainment/streaming/watch-jimmy-kimmels-return-online",
    "timestamp": "2025-09-23T14:04:28Z"
  },
  {
    "title": "‘They Don’t Want Her’: CNN’s Harry Enten Says Kamala Harris Has Only Become More Unpopular With Democrats",
    "description": "CNN's Harry Enten said on Monday that former Vice President Kamala Harris has only become more unpopular with Democrats.",
    "link": "https://dailycaller.com/2025/09/23/cnn-harry-enten-kamala-harris-unpopular/",
    "timestamp": "2025-09-23T14:03:07Z"
  },
  {
    "title": "Why Isn't The Right Honoring The Way Charlie Kirk DESTROYED So Many College Students?",
    "description": "Let's not pretend this was something other than it was.",
    "link": "https://www.wonkette.com/p/why-isnt-the-right-honoring-the-way",
    "timestamp": "2025-09-23T14:02:58Z"
  },
  {
    "title": "Trump signed a decree declaring the “Antifa” movement a terrorist organisation",
    "description": "The White House had announced its intention to crack down on domestic terrorism on the left in the wake of Kirk's assassination\nThe post Trump signed a decree declaring the “Antifa” movement a terrorist organisation appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/09/23/trump-signed-a-decree-declaring-the-antifa-movement-a-terrorist-organisation/",
    "timestamp": "2025-09-23T14:01:24Z"
  },
  {
    "title": "Trump links autism to acetaminophen use during pregnancy, despite decades of evidence it’s safe",
    "description": "By Jen Christensen, Brenda Goodman, Meg Tirrell, CNN (CNN) — President Donald Trump announced Monday that the US Food and Drug Administration will",
    "link": "https://krdo.com/health/cnn-health/2025/09/23/fda-will-advise-doctors-about-link-between-autism-acetaminophen-use-during-pregnancy-trump-says/",
    "timestamp": "2025-09-23T14:00:41Z"
  },
  {
    "title": "Fed rate trimmed: What does it mean for you?",
    "description": "Borrowing will get cheaper, but savings returns won’t be as high.",
    "link": "https://www.bostonherald.com/2025/09/23/fed-rate-trimmed-what-does-it-mean/",
    "timestamp": "2025-09-23T14:00:19Z"
  },
  {
    "title": "The EU Remains the World's Biggest Buyer of Russian Gas Despite Sanctions",
    "description": "Since the Russian invasion of Ukraine in early 2022 and the subsequent sanctions on Russian energy, the European Union has encouraged other countries to follow suit by enforcing sanctions, even as Russia offers discounted oil and gas to various countries arou…",
    "link": "https://oilprice.com/Energy/Energy-General/The-EU-Remains-the-Worlds-Biggest-Buyer-of-Russian-Gas-Despite-Sanctions.html",
    "timestamp": "2025-09-23T14:00:00Z"
  },
  {
    "title": "When the \"Nice People\" Want to Kill You",
    "description": "Programming note: Tomorrow, Wednesday, I shall endeavour to be here for our midweek Clubland Q&A taking questions from Mark Steyn Club members live around the planet at 3pm North American Eastern - which is 8pm British Summer Time/9pm Central European.",
    "link": "https://www.steynonline.com/15596/when-the-nice-people-want-to-kill-you",
    "timestamp": "2025-09-23T14:00:00Z"
  },
  {
    "title": "Dave Portnoy rips ‘narrow minded’ Michael Wilbon over Bruce Pearl retirement take",
    "description": "\"What an idiotic comment from Wilbon,\" Portnoy posted Monday night to X.",
    "link": "https://nypost.com/2025/09/23/sports/dave-portnoy-rips-narrow-minded-michael-wilbon-over-bruce-pearl-take/",
    "timestamp": "2025-09-23T13:59:27Z"
  },
  {
    "title": "Trump Cancels Meeting With Top Democrats Ahead Of Government Shutdown",
    "description": "The president initially agreed to the meeting at the White House, but then changed his mind.",
    "link": "https://www.huffpost.com/entry/trump-cancels-meeting-democrats-shutdown_n_68d2a510e4b02b5b9fb2ecb6",
    "timestamp": "2025-09-23T13:58:42Z"
  },
  {
    "title": "Trump cancels meeting with Schumer and Jeffries",
    "description": "The president was due to meet with Democratic leaders on Thursday.",
    "link": "https://www.politico.com/news/2025/09/23/trump-cancels-meeting-schumer-jeffries-00576176",
    "timestamp": "2025-09-23T13:58:29Z"
  },
  {
    "title": "Macron stuck in Trump's traffic in New York, reportedly phones the U.S. president to 'clear the way'",
    "description": "'Guess what? I'm waiting (on) the street because everything is frozen for you,' the French President says, as seen in a video shared online",
    "link": "https://nationalpost.com/news/world/emmanuel-macron-trump-traffic",
    "timestamp": "2025-09-23T13:58:08Z"
  },
  {
    "title": "Stephen Colbert celebrates Jimmy Kimmel's return, CBS host says he’ll be the only late-night ‘martyr’",
    "description": "Stephen Colbert celebrated that he was the \"only martyr in late-night\" after Disney announced Jimmy Kimmel's show will return following his suspension over controversial comments.",
    "link": "https://www.foxnews.com/media/stephen-colbert-celebrates-jimmy-kimmels-return-cbs-host-says-hell-only-late-night-martyr",
    "timestamp": "2025-09-23T13:57:49Z"
  },
  {
    "title": "Brazil's WEG to invest $77 million to boost US plant capacity due to AI demand",
    "description": "Brazilian motor maker WEG will invest $77 million in a U.S. specialty transformer manufacturing facility, it said on Tuesday, seeking to increase the plant's production capacity by 50 per cent as artificial intelligence fuels demand in the country.The investm…",
    "link": "https://www.channelnewsasia.com/business/brazils-weg-invest-77-million-boost-us-plant-capacity-due-ai-demand-5364691",
    "timestamp": "2025-09-23T13:55:23Z"
  },
  {
    "title": "Brazil's WEG to invest $77 million to boost US plant capacity due to AI demand",
    "description": "(Reuters) -Brazilian motor maker WEG will invest $77 million in a U.S. specialty transformer manufacturing facility, it said on Tuesday, seeking to increase ...",
    "link": "https://finance.yahoo.com/news/brazils-weg-invest-77-million-135523922.html",
    "timestamp": "2025-09-23T13:55:23Z"
  },
  {
    "title": "Ukraine has to agree to peace deal – Rubio",
    "description": "Moscow and Kiev must find common ground to end conflict, the US secretary of state has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625118-ukraine-russia-us-peace-deal/",
    "timestamp": "2025-09-23T13:55:19Z"
  },
  {
    "title": "Argentina markets extend stellar rebound ahead of expected Trump-Milei meeting",
    "description": "LONDON (Reuters) -Argentina's international bonds jumped and stocks climbed on Tuesday ahead of an expected meeting between U.S. President Donald Trump and...",
    "link": "https://finance.yahoo.com/news/argentina-markets-extend-stellar-rebound-135508199.html",
    "timestamp": "2025-09-23T13:55:08Z"
  },
  {
    "title": "The president is wrong on Tylenol",
    "description": "The president is wrong on Tylenol\nScientists studying any link between the painkiller and autism have reached no firm conclusions\n“DON’T TAKE Tylenol,” ordered Donald Trump at a press conference on September 22nd. His administration had just highlighted a lin…",
    "link": "https://biztoc.com/x/f77cfdb08e6ab324",
    "timestamp": "2025-09-23T13:54:55Z"
  },
  {
    "title": "Trump rejects meeting with Democrats over government funding demands",
    "description": "Bitcoin price today: muted below $113k after crypto liquidations wipe out $1.5 bln\nInvesting.com -- U.S. President Donald Trump announced Tuesday he will not be meeting with Democratic congressional leaders regarding government funding, calling their demands …",
    "link": "https://biztoc.com/x/cccd899cf7462a96",
    "timestamp": "2025-09-23T13:54:54Z"
  },
  {
    "title": "Week of September 8 Cable News Ratings: All Cable News Networks Record Big Gains",
    "description": "Fox News had triple-digit gains in the primetime demo.",
    "link": "https://www.adweek.com/tvnewser/week-of-september-8-2025-cable-news-ratings/",
    "timestamp": "2025-09-23T13:54:25Z"
  },
  {
    "title": "‘Too much liquid’: Trump pretends he’s qualified to give medical advice (he’s not)",
    "description": "Donald Trump is the last person anyone should ever turn to for guidance on medicine and vaccines, but that didn't stop him from peddling dangerous nonsense.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/-much-liquid-trump-pretends-s-qualified-give-medical-advice-s-not-rcna233159",
    "timestamp": "2025-09-23T13:53:23Z"
  },
  {
    "title": "NYC police force Macron to call Trump (VIDEO)",
    "description": "The French president and his entourage were stopped to make way for his US counterpart’s convoy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625116-nyc-police-macron-call-trump/",
    "timestamp": "2025-09-23T13:52:41Z"
  },
  {
    "title": "Even Fox News Thinks This Pete Hegseth Order Is ‘A Bridge Too Far’",
    "description": "“There is no precedent for what they’re doing here,” said Fox News contributor Jonathan Turley.",
    "link": "https://www.huffpost.com/entry/fox-news-jonathan-turley-bret-baier-shred-pentagon-press-pledge-restrictions_n_68d26f8be4b06a8b846e0f99",
    "timestamp": "2025-09-23T13:51:56Z"
  },
  {
    "title": "Trump Expected To Criticize UN In First General Assembly Speech Since 2019",
    "description": "The Trump administration has refused to pay some UN dues and has cut about $1 billion in congressionally approved U.N. funding for 2025.",
    "link": "https://www.forbes.com/sites/saradorn/2025/09/23/trump-expected-to-criticize-un-in-first-general-assembly-speech-since-2019/",
    "timestamp": "2025-09-23T13:51:53Z"
  },
  {
    "title": "Tylenol maker shares rebound a day after Trump’s unfounded claims about its safety",
    "description": "Trump told pregnant women not to use the painkiller around a dozen times during the White House news conference Monday.",
    "link": "https://www.pbs.org/newshour/nation/tylenol-maker-shares-rebound-a-day-after-trumps-unfounded-claims-about-its-safety",
    "timestamp": "2025-09-23T13:51:24Z"
  },
  {
    "title": "Wild video shows cars spinning at illegal takeovers in Maryland as police announce hit-and-run arrest",
    "description": "Wild video released by the Prince George’s County Police Department shows what officers describe as \"illegal car takeovers\" that have been causing chaos in Maryland. The aerial footage captures dozens of people standing within feet of cars spinning wildly at …",
    "link": "https://freerepublic.com/focus/f-chat/4342187/posts",
    "timestamp": "2025-09-23T13:51:23Z"
  },
  {
    "title": "WHO Sees No Autism Links To Tylenol, Vaccines",
    "description": "Neither the painkiller Tylenol nor vaccines have been shown to cause autism, the World Health Organization said on Tuesday, following comments from the US president and his administration to the contrary.",
    "link": "https://www.ibtimes.com/who-sees-no-autism-links-tylenol-vaccines-3784233",
    "timestamp": "2025-09-23T13:51:18Z"
  },
  {
    "title": "Qué dijeron los medios de EE.UU. sobre la ayuda de Trump al gobierno de Milei",
    "description": "The Wall Street Journal, The New York Times y CNN se hicieron eco de la noticia",
    "link": "https://www.lanacion.com.ar/el-mundo/que-dijeron-los-medios-de-eeuu-sobre-la-ayuda-de-trump-al-gobierno-de-milei-nid23092025/",
    "timestamp": "2025-09-23T13:48:37Z"
  },
  {
    "title": "Nvidia's $100 billion OpenAI play raises big antitrust issues",
    "description": "Nvidia's biggest customer base is already relatively concentrated, with the two largest buyers accounting for 23% and 16% of its revenue in the second quarter of this year, according to its financial filings, which do not name the buyers. The scope of Monday'…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/nvidias-100-billion-openai-play-raises-big-antitrust-issues/articleshow/124072555.cms",
    "timestamp": "2025-09-23T13:48:33Z"
  },
  {
    "title": "Trump, South Korea and the International Purge of Right-Wing Politics",
    "description": "US President Donald Trump recently chastized South Korean President Lee Jae-myung and the Democratic Party of Korea (DPK) for their efforts to oppress all right-wing ideology in South Korea and persecute their political opponents. Although Lee and his governm…",
    "link": "https://www.fairobserver.com/politics/trump-south-korea-and-the-international-purge-of-right-wing-politics/",
    "timestamp": "2025-09-23T13:48:23Z"
  },
  {
    "title": "Seth Meyers Drags Dems for Being ‘High School Nerds’ Who ‘Pre-Shove Themselves Into Lockers’ for Trump | Video",
    "description": "\"Should work out well!\" the NBC host jokes\nThe post Seth Meyers Drags Dems for Being ‘High School Nerds’ Who ‘Pre-Shove Themselves Into Lockers’ for Trump | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-democrats-nerds-who-hurt-themselves-for-trump/",
    "timestamp": "2025-09-23T13:48:13Z"
  },
  {
    "title": "FO° Talks: Donald Trump’s Tariffs Could Boomerang and Unite the BRICS Nations",
    "description": "Video Producer & Social Media Manager Rohan Khattar Singh interviews political commentator Kyle Moran about US President Donald Trump’s tariff policies and their far-reaching consequences. Their conversation probes the uncertainty of Trump’s approach, the rea…",
    "link": "https://www.fairobserver.com/video/fo-talks-donald-trumps-tariffs-could-boomerang-and-unite-the-brics-nations/",
    "timestamp": "2025-09-23T13:47:50Z"
  },
  {
    "title": "WLFI promises Apple Pay card while price slips 10% after $1.7B wipeout amid Asia expansion",
    "description": "World Liberty Financial (WLFI), a project tied to US President Donald Trump, is accelerating its international strategy with new alliances and product launches aimed at mainstream adoption. Bithumb partnership On Sept. 23, South Korean crypto exchange Bithumb…",
    "link": "https://cryptoslate.com/wlfi-promises-apple-pay-card-while-price-slips-10-after-1-7b-wipeout-amid-asia-expansion/",
    "timestamp": "2025-09-23T13:46:31Z"
  },
  {
    "title": "Jimmy Kimmel's return doesn't mean the end of Disney's problems",
    "description": "Now that Jimmy Kimmel's show has become a lightning rod, any decision about it going forward will be viewed with a magnifying glass.",
    "link": "https://www.businessinsider.com/jimmy-kimmel-live-returns-disney-problems-2025-9",
    "timestamp": "2025-09-23T13:46:23Z"
  },
  {
    "title": "'Don’t pay any attention whatsoever': UK's health minister gives Trump epic putdown",
    "description": "Global health experts are aghast that President Donald Trump announced an unproven link between autism and commonly used painkillers and vaccines, and they're warning others to ignore his advice.The U.S. president, along with his Health and Human Services Sec…",
    "link": "https://www.rawstory.com/donald-trump-autism/",
    "timestamp": "2025-09-23T13:46:01Z"
  },
  {
    "title": "A jury will look at whether Amazon tricked customers into joining Prime — and made it hard to leave",
    "description": "The Federal Trade Commission sued Amazon in U.S. District Court in Seattle two years ago and has alleged more than a decade of legal violations.",
    "link": "https://fortune.com/2025/09/23/amazon-ftc-prime-hard-to-cancel-jury-trial/",
    "timestamp": "2025-09-23T13:45:48Z"
  },
  {
    "title": "Tough It Out",
    "description": "Tough it out, ladies: \"Don't take Tylenol,\" President Donald Trump told America's pregnant women yesterday. \"Don't take it. Fight like hell not to take it.\"\nInstead, pregnant women should \"tough it out\" when they're in pain, said Trump, touting a possible lin…",
    "link": "https://biztoc.com/x/29d4609a78deb051",
    "timestamp": "2025-09-23T13:43:44Z"
  },
  {
    "title": "Woke MAGA? Trump, free speech and ‘consequence culture,’ explained",
    "description": "Since Charlie Kirk’s assassination, President Donald Trump and his allies have praised the conservative organizer and provocateur as a free speech champion who set a high First Amendment standard for the “Make America Great Again” movement.\nTrump, eulogizing …",
    "link": "https://biztoc.com/x/791ea5765ebfda48",
    "timestamp": "2025-09-23T13:43:34Z"
  },
  {
    "title": "Overstepping His Mandate",
    "description": "“Empires always have the hubris to think they are indestructible, when in fact they are always unsustainable.” Dan Pfeiffer Trump Is Overstepping His Mandate Donald Trump likes to pretend he won a massive victory with a strong mandate for his MAGA agenda. Lik…",
    "link": "https://balloon-juice.com/2025/09/23/overstepping-his-mandate/",
    "timestamp": "2025-09-23T13:42:30Z"
  },
  {
    "title": "UN chief warns world leaders of ‘an age of reckless disruption and relentless human suffering’",
    "description": "The head of the UN warned that humanity has entered “an age of reckless disruption and relentless human suffering” as world leaders convened.",
    "link": "https://www.bostonherald.com/2025/09/23/un-chief-warns-world-leaders/",
    "timestamp": "2025-09-23T13:41:25Z"
  },
  {
    "title": "CCIA warns of Italy’s back-door route to ‘fair share’ payments",
    "description": "The topic of ‘fair share’ payments is still highly contentiousA European lobby group claims Italy’s telecom regulator, AGCOM, is using a ‘back-door’ route to e…",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/ccia-warns-of-italy-s-back-door-route-to-fair-share-payments-53894/",
    "timestamp": "2025-09-23T13:41:10Z"
  }
]