[
  {
    "title": "Government shutdown update: Flights pile up in US airports, military set to miss first paycheck - here's the latest",
    "description": "US government shutdown 2025:: The US government shutdown is now the second longest ever. Millions of Americans face disrupted travel and missed paychecks. Airports are seeing flight delays due to staff shortages. Federal workers, including air traffic control…",
    "link": "https://economictimes.indiatimes.com/news/international/us/government-shutdown-update-flights-pile-up-in-us-airports-military-set-to-miss-first-paycheck-heres-the-latest/articleshow/124872813.cms",
    "timestamp": "2025-10-28T12:33:18Z"
  },
  {
    "title": "Russia and North Korea Hold Parallel Powwow as Trump Tours Asia",
    "description": "Russian strongman Vladimir Putin hosted North Korea Foreign Minister Choe Son-hui in Moscow on Monday, a visit timed to coincide with President Donald Trump’s whirlwind tour of Asia this week that he has expressed hope would include a meeting with dictator Ki…",
    "link": "https://www.breitbart.com/asia/2025/10/28/russia-and-north-korea-hold-parallel-powwow-as-trump-tours-asia/",
    "timestamp": "2025-10-28T12:32:17Z"
  },
  {
    "title": "Trump Denies B-1 Bomber Deployment Near Venezuela, Warns of Escalating Anti-Drug Operations",
    "description": "President Donald Trump denied reports of B-1 Lancer bombers near Venezuela, calling them \"false,\" but acknowledged displeasure with Venezuela over drug trafficking. Despite the denial, U.S. military operations in the region have intensified, including surveil…",
    "link": "https://www.shtfplan.com/headline-news/trump-denies-b-1-bomber-deployment-near-venezuela-warns-of-escalating-anti-drug-operations",
    "timestamp": "2025-10-28T12:30:13Z"
  },
  {
    "title": "Future of nation’s energy grid hurt by Trump’s funding cuts",
    "description": "Many of the canceled grants were investments in the science and infrastructure necessary to keep the lights on in coming years, especially when the grid is under stress.",
    "link": "https://theconversation.com/future-of-nations-energy-grid-hurt-by-trumps-funding-cuts-267504",
    "timestamp": "2025-10-28T12:27:43Z"
  },
  {
    "title": "Iraq’s Dangerous Deal With Iran",
    "description": "Iraq is oil-rich and buzzing with new construction—yet it still can’t get out from between the U.S. and Iran.",
    "link": "https://www.theatlantic.com/international/archive/2025/10/iran-iraq-deal/684707/",
    "timestamp": "2025-10-28T12:27:42Z"
  },
  {
    "title": "King Trump Makes It Clear He Wants His BFF Larry Ellison To Own Warner Brothers",
    "description": "Whether it’s Jeff Bezos lobotomizing the Washington Post, Elon Musk turning Twitter into a far right propaganda mill, or Larry Ellison buying CBS, CNN, and TikTok, the country’s shittiest right wing billionaires aren’t being subtle about their quest to domina…",
    "link": "https://www.techdirt.com/2025/10/28/king-trump-makes-it-clear-he-wants-his-bff-larry-ellison-to-own-warner-brothers/",
    "timestamp": "2025-10-28T12:27:41Z"
  },
  {
    "title": "Ben & Jerry’s owner stopped brand developing flavour for peace in Gaza",
    "description": "Co-founder accuses ice-cream brand’s parent of taking part in ‘corporate butt kissing’ of Donald Trump\nThe co-founder of Ben & Jerry’s has accused its owner of being part of a movement of “corporate butt kissing” of Donald Trump and says management blocked th…",
    "link": "https://biztoc.com/x/981f0bb1798fa7f3",
    "timestamp": "2025-10-28T12:27:35Z"
  },
  {
    "title": "Why the Trump administration’s comparison of antifa to violent terrorist groups doesn’t track",
    "description": "Kristi Noem’s claim that antifa is like the Islamic State group blurs the line between protest and terrorism – a political move unsupported by evidence.",
    "link": "https://theconversation.com/why-the-trump-administrations-comparison-of-antifa-to-violent-terrorist-groups-doesnt-track-267514",
    "timestamp": "2025-10-28T12:24:40Z"
  },
  {
    "title": "Will Microsoft be able to stop the White House using AI-generated Halo imagery to depict Trump as Master Chief and to promote and recruit for ICE? Depressingly, I doubt it",
    "description": "The US government's use of AI-generated Halo imagery on social media has absolutely been a power-play to appeal to like-minded American gamers. Read more",
    "link": "https://www.eurogamer.net/will-microsoft-be-able-to-stop-the-white-house-using-ai-generated-halo-imagery-to-depict-trump-as-master-chief-and-to-promote-and-recruit-for-ice-depressingly-i-doubt-it",
    "timestamp": "2025-10-28T12:22:52Z"
  },
  {
    "title": "MAGA attorney general sues Tylenol maker over alleged autism links",
    "description": "Texas Attorney General Ken Paxton is suing the makers of Tylenol over its alleged links to autism in children.The state became the first to sue Johnson & Johnson and spinoff company Kenvue after President Donald Trump claimed that using the over-the-counter p…",
    "link": "https://www.rawstory.com/trump-tylenol-lawsuit/",
    "timestamp": "2025-10-28T12:22:06Z"
  },
  {
    "title": "Amazon layoffs, Qualcomm's AI chips, Airbnb cracks down on Halloween and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/28/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-10-28T12:21:52Z"
  },
  {
    "title": "Melania Trump distances herself from Donald’s White House Ballroom project — ‘She’s not on board,’ source says",
    "description": "Melania Trump is not supporting Donald Trump’s plan to build a big White House ballroom. Reports say she does not want the East Wing torn down. The project has started a lot of talk because it changes a historic part of the White House. Many people are worrie…",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trump-distances-herself-from-donalds-white-house-ballroom-project-shes-not-on-board-source-says/articleshow/124873576.cms",
    "timestamp": "2025-10-28T12:21:11Z"
  },
  {
    "title": "Congress Enjoys Ultraluxe Health Care as It Fights to Gut Yours - NewsBreak",
    "description": "If the republic were the Titanic and the government’s end-of-year shutdown over health care the iceberg, Congress would be the first-class passengers alrea",
    "link": "https://www.newsbreak.com/share/4316413102666-congress-enjoys-ultraluxe-health-care-as-it-fights-to-gut-yours?s=a2&amp;share_destination_id=MjkyMzc4OTkwLTE3NjE2NTQwMjU5NDM%3D&amp;pd=0Jmn8Any&amp;hl=en_US&amp;send_time=1761654025&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.32.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-v2",
    "timestamp": "2025-10-28T12:21:05Z"
  },
  {
    "title": "GOP voters in Northern California brace for loss of representation in fight for US House",
    "description": "In a stretch of Northern California known for farming, ranching and a rural way of life, residents worry a ballot measure to redraw U.S. House maps is all...",
    "link": "https://www.yahoo.com/news/articles/gop-voters-northern-california-brace-121929521.html",
    "timestamp": "2025-10-28T12:19:29Z"
  },
  {
    "title": "America's government shutdown 2025 has different political rules",
    "description": "Washington is experiencing a government shutdown. Many Americans are unaware or unconcerned about the ongoing closure. Political leaders in Congress and President Donald Trump show little interest in compromise. This impasse is likely to continue as incentive…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/americas-government-shutdown-2025-has-different-political-rules/articleshow/124873671.cms",
    "timestamp": "2025-10-28T12:19:11Z"
  },
  {
    "title": "Ukraine Says Its Long-Range Strikes Have Taken Out One Fifth of Russia's Oil Refining Capacity",
    "description": "Ukraine´s long-range strikes on refineries have reduced Moscow´s refining capacity by 20%, Volodymyr Zelenskyy said.\nThe post Ukraine Says Its Long-Range Strikes Have Taken Out One Fifth of Russia’s Oil Refining Capacity appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/10/28/ukraine-says-its-long-range-strikes-have-taken-out-one-fifth-of-russias-oil-refining-capacity/",
    "timestamp": "2025-10-28T12:19:05Z"
  },
  {
    "title": "Trump On Track To Recoup $10M Improperly Paid To Agency’s Senior Executives Under Biden",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | October 27, 2025\nThe Biden administration’s Department of Veterans Affairs improperly awarded $10.8 million in bonuses meant for staffers who directly serve veterans to highly paid senior executives. Under Pr…",
    "link": "https://biztoc.com/x/ace68701b49737c7",
    "timestamp": "2025-10-28T12:16:36Z"
  },
  {
    "title": "Netanyahu promises response after Hamas returns remains not belonging to missing hostages",
    "description": "Hamas says efforts to identify bodies is being hindered by a lack of equipment",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/28/netanyahu-promises-response-after-hamas-returns-remains-not-belonging-to-missing-hostages/",
    "timestamp": "2025-10-28T12:12:52Z"
  },
  {
    "title": "ASEAN integration may be incremental but commitment among leaders is firm: PM Wong",
    "description": "Integration efforts within the Association of Southeast Asian Nations (ASEAN) “may seem incremental to some” but there are “considerable commitment and determination” among the leaders, says Singapore Prime Minister Lawrence Wong.",
    "link": "https://www.channelnewsasia.com/singapore/asean-integration-may-be-incremental-commitment-among-leaders-firm-lawrencewong-5429301",
    "timestamp": "2025-10-28T12:12:47Z"
  },
  {
    "title": "The Republican Plan to Reform the Census Could Put Everyone's Privacy at Risk (Vittoria Elliott/Wired)",
    "description": "Vittoria Elliott / Wired:\nThe Republican Plan to Reform the Census Could Put Everyone's Privacy at Risk  —  A little-known algorithmic process called “differential privacy” helps keep census data anonymous.  Conservatives want it gone.  —  President Donald Tr…",
    "link": "https://www.memeorandum.com/251028/p15",
    "timestamp": "2025-10-28T12:10:01Z"
  },
  {
    "title": "‘Trump 2028’: Could the US president really go for a third term?",
    "description": "US president says he'd 'love' a third term in the White Office.",
    "link": "https://www.aljazeera.com/news/2025/10/28/trump-2028-could-the-us-president-really-go-for-a-third-term",
    "timestamp": "2025-10-28T12:09:52Z"
  },
  {
    "title": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely",
    "description": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely\nMoneywise and Yahoo Finance LLC may earn commission or revenue through links in the content below.\nPresident Donald Trump’s new tax bill cuts …",
    "link": "https://biztoc.com/x/bbd72f3b424815ba",
    "timestamp": "2025-10-28T12:06:02Z"
  },
  {
    "title": "Former US Commerce Secretary Slams Trump Tariffs On India",
    "description": "Former US Secretary Of Commerce Gina Raimondo criticised President Donald Trump's reciprocal tariff policy, calling it \"disastrous\" and said that he was making a \"big mistake\" when it comes to India.",
    "link": "https://www.ndtvprofit.com/world/disastrous-policy-former-us-commerce-secretary-slams-trump-tariffs-on-india",
    "timestamp": "2025-10-28T12:05:49Z"
  },
  {
    "title": "US immigration enforcers use Halo art to promote mass detention, while the White House and Gamestop swap Master Trump memes",
    "description": "The USA's Immigration Customs Enforcement service, aka ICE, have started using imagery of Microsoft's sci-fi shooter Halo for recruitment posts on social media, even as Gamestop and the US administration indulge in some bantz characterising Donald Trump as Ma…",
    "link": "https://www.rockpapershotgun.com/us-immigration-enforcers-use-halo-art-to-promote-mass-detention-while-the-white-house-and-gamestop-swap-master-trump-memes",
    "timestamp": "2025-10-28T12:04:26Z"
  },
  {
    "title": "Ahead of COP30, UN Report Shows 1.5°C Will Be Breached as Countries Pledge Just 10% Emissions Cut",
    "description": "Ahead of the United Nations' global summit on the climate emergency in Belém, Brazil, a report on countries' climate plans released Tuesday served as both \"a progress update and a warning siren,\" one campaigner said.According to the Nationally Determined Cont…",
    "link": "https://www.commondreams.org/news/cop30-climate-summit",
    "timestamp": "2025-10-28T12:04:00Z"
  },
  {
    "title": "The Atlantic’s December Cover: David Graham and J. Michael Luttig on “The Coming Election Mayhem”",
    "description": "Donald Trump’s plans to throw the 2026 midterms into chaos are already under way.",
    "link": "https://www.theatlantic.com/press-releases/archive/2025/10/atlantics-december-cover-the-coming-election-mayhem/684716/",
    "timestamp": "2025-10-28T12:03:10Z"
  },
  {
    "title": "Trump slams Fed chair, eyes replacement in a few months",
    "description": "TOKYO (Reuters) -U.S. President Donald Trump on Tuesday said there was a long list of people who could take over the Federal Reserve, slamming current...",
    "link": "https://www.yahoo.com/news/articles/trump-slams-fed-chair-eyes-120059591.html",
    "timestamp": "2025-10-28T12:00:59Z"
  },
  {
    "title": "Vans parent VF Corp beats quarterly estimates on demand",
    "description": "Vans parent VF Corp has today posted better-than-expected results for the second quarter, helped by strong demand for its footwear, bags and lifestyle apparel, even as economic uncertainty looms.",
    "link": "https://www.rte.ie/news/business/2025/1028/1540916-vans-parent-vf-corp-results/",
    "timestamp": "2025-10-28T12:00:33Z"
  },
  {
    "title": "'Serious need for speed' in global climate commitments amid shortfalls in 2035 target",
    "description": "A report from the UN's climate change body shows global carbon emissions appear to be on track to fall by 10 per cent by 2035, far short of its 60 per cent target.",
    "link": "https://www.abc.net.au/news/2025-10-28/climate-goals-not-on-track-to-meet-2035-emissions-target-says-un/105945130",
    "timestamp": "2025-10-28T12:00:21Z"
  },
  {
    "title": "RFR’s Aby Rosen On Midtown Rents, Amazon, Mamdani, the Chrysler Building and More",
    "description": "The name Aby Rosen is one of the few in real estate that has migrated into the wider consciousness. Aby Rosen the art collector. Aby Rosen who travels in circles with Jeff Koons, Damien Hirst, Ian Schrager, Julian Schnabel and Sir Norman Foster. Aby Rosen the…",
    "link": "http://commercialobserver.com/2025/10/aby-rosen-rfr-manhattan-art-chrysler-seagram-2025/",
    "timestamp": "2025-10-28T12:00:01Z"
  },
  {
    "title": "Hungary and Romania Refinery Fire: Sabotage or Negligence?",
    "description": "On Monday, explosions were reported at an oil refinery in Hungary and another in Romania. The initial explosion occurred at the Petrotel-Lukoil refinery located in Ploieşti, Romania, followed by a second fire and subsequent explosions at the AV3 plant of MOL’…",
    "link": "https://www.activistpost.com/hungary-and-romania-refinery-fire-sabotage-or-negligence/",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "The 10 Best ‘Weekend Update’ Jokes So Far This Season on ‘Saturday Night Live’",
    "description": "Michael Che’s at his best with a specific kind of joke",
    "link": "https://www.cracked.com/article_48914_the-10-best-weekend-update-jokes-so-far-this-season-on-saturday-night-live.html",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "The Lingering Delusion",
    "description": "Kamala Harris’s memoir 107 Days succeeds at least in distilling the evasions and weaknesses of the modern Democratic Party.",
    "link": "http://www.nybooks.com/articles/2025/11/20/the-lingering-delusion-107-days-kamala-harris/",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "Eric Metaxas: God Created Curtis Sliwa to be NYC Mayor",
    "description": "Eric Metaxas: \"Is there any question that Curtis Sliwa was created by God to be mayor of New York City?”",
    "link": "https://www.peoplefor.org/rightwingwatch/eric-metaxas-god-created-curtis-sliwa-be-nyc-mayor",
    "timestamp": "2025-10-28T12:00:00Z"
  },
  {
    "title": "MSNBC’s Lawrence O’Donnell Slams ‘Degraded’ CNN for Paying ‘Rabid’ Scott Jennings to ‘Lie’ About Trump",
    "description": "O’Donnell slammed CNN on Monday as an “absurdly degraded” network as he blasted its CEO for paying “rabid” Scott Jennings to “lie about Donald Trump.”\nThe post MSNBC’s Lawrence O’Donnell Slams ‘Degraded’ CNN for Paying ‘Rabid’ Scott Jennings to ‘Lie’ About Tr…",
    "link": "https://www.mediaite.com/media/tv/msnbcs-lawrence-odonnell-slams-degraded-cnn-for-paying-rabid-scott-jennings-to-lie-about-trump/",
    "timestamp": "2025-10-28T11:58:31Z"
  },
  {
    "title": "How Mike Waltz is leading the Trump administration's 'a la carte' approach to UN funding",
    "description": "The new U.S. ambassador to the United Nations has been making the case that the United States will no longer be footing the bill the way it has since the world body’s founding eight decades ago",
    "link": "https://abcnews.go.com/US/wireStory/mike-waltz-leading-trump-administrations-la-carte-approach-126928489",
    "timestamp": "2025-10-28T11:57:53Z"
  },
  {
    "title": "A federal agent's daring plan: Recruit Maduro's pilot to turn on the Venezuelan leader",
    "description": "The federal agent had a daring pitch for Nicolás Maduro’s chief pilot: All he had to do was surreptitiously divert the Venezuelan president’s plane to a...",
    "link": "https://www.yahoo.com/news/articles/federal-agents-daring-plan-recruit-115713137.html",
    "timestamp": "2025-10-28T11:57:13Z"
  },
  {
    "title": "Climate Week Showed What’s Possible; Now New York Has to Deliver",
    "description": "During the last week of September, as Climate Week turned New York City into a hub of panel discussions, protests, and policy announcements, I felt both inspired and unsettled. It is always energizing to watch tens of thousands of people come together from ar…",
    "link": "https://www.commondreams.org/opinion/new-york-deliver-climate-action",
    "timestamp": "2025-10-28T11:55:03Z"
  },
  {
    "title": "Under Trump, millions of Americans could pay $0 in federal income tax — here’s whose bill may be eliminated entirely",
    "description": "And will there be a catch to this tax holiday?",
    "link": "https://finance.yahoo.com/news/under-trump-millions-americans-could-115500503.html",
    "timestamp": "2025-10-28T11:55:00Z"
  },
  {
    "title": "Trump Hints Deployment to More US Cities in Speech to Troops",
    "description": "While on the second stop of his three-country tour of Asia, President Donald Trump met with Japan’s newly elected Prime Minister Sanae Takaichi. After, while addressing American troops on a U.S. carrier, he referenced his controversial use of the military at …",
    "link": "https://biztoc.com/x/d6261761bfbd2da6",
    "timestamp": "2025-10-28T11:54:08Z"
  },
  {
    "title": "Russia’s Latest Attempt to Woo the US Reeks of Desperation",
    "description": "Kirill Dmitriev, the Kremlin’s top economic envoy, arrived in the United States with holes in his sails and no wind to push him forward. He was a man on a desperate mission. A phone call between Sergei Lavrov, Russia’s foreign minister, and Marco Rubio, the U…",
    "link": "https://freerepublic.com/focus/f-news/4349121/posts",
    "timestamp": "2025-10-28T11:53:01Z"
  },
  {
    "title": "Oil falls 1% as investors assess Russia sanctions, OPEC+ output plans",
    "description": "LONDON (Reuters) -Oil prices fell by more than 1% on Tuesday in a third day of declines as investors assess the effect of U. sanctions on Russia's two...",
    "link": "https://finance.yahoo.com/news/oil-falls-1-investors-assess-114925676.html",
    "timestamp": "2025-10-28T11:49:25Z"
  },
  {
    "title": "Soaring electricity bills squeeze households as utilities hike rates",
    "description": "Rising utility bills across the country are leaving customers feeling powerless in the face of the escalating costs.",
    "link": "https://www.cbsnews.com/news/utility-bills-rate-hikes-2025/?ftag=YHF4eb9d17",
    "timestamp": "2025-10-28T11:46:20Z"
  },
  {
    "title": "Oil Falls as Traders Focus on Glut After Sanctions Rally Wanes",
    "description": "Oil declined as mounting signs of oversupply quelled a bumper rally triggered by US sanctions on key Russian producers last week.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-falls-as-traders-focus-on-glut-after-sanctions-rally-wanes",
    "timestamp": "2025-10-28T11:45:56Z"
  },
  {
    "title": "Can Donald Trump Restore American Citizenship?",
    "description": "Once, being an American citizen meant something. The Democrats destroyed that, but Trump (with your help) is working hard to re-ravel this great unraveling. Among the most daunting challenges facing Donald Trump is his determination to restore the value and u…",
    "link": "https://freerepublic.com/focus/f-chat/4349120/posts",
    "timestamp": "2025-10-28T11:45:52Z"
  },
  {
    "title": "Premier of Ontario said the anti-tariff Reagan ad that blew up trade talks with Trump is the 'best ad that ever ran'",
    "description": "Doug Ford said that the Reagan ad that derailed trade talks with Trump is the \"best ad that ever ran,\" as Canada courts Asia for new trade relations.",
    "link": "https://www.businessinsider.com/ontario-premier-not-sorry-for-airing-anti-tariff-reagan-ad-2025-10",
    "timestamp": "2025-10-28T11:44:01Z"
  },
  {
    "title": "Morning Bid: Gold sold, stocks stall",
    "description": "and global markets today , Editor-At-Large, Finance and Markets As U. stock indexes hit new records on Monday ahead of a likely Federal Reserve interest rate...",
    "link": "https://finance.yahoo.com/news/morning-bid-gold-sold-stocks-113934575.html",
    "timestamp": "2025-10-28T11:39:34Z"
  },
  {
    "title": "Transcript: Trump’s Crazed Rant over Cognitive Test Shows His Decline",
    "description": "The following is a lightly edited transcript of the October 28 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent.On Air For…",
    "link": "https://newrepublic.com/article/202333/transcript-trump-crazed-rant-cognitive-test-shows-decline",
    "timestamp": "2025-10-28T11:38:06Z"
  },
  {
    "title": "Jay-Z dismisses backlash over decision to have Bad Bunny perform Super Bowl LV halftime show",
    "description": "Jay-Z came out in defense of Bad Bunny on Monday and dismissed the backlash his selection to do the Super Bowl LX halftime show has gotten.",
    "link": "https://www.foxnews.com/sports/jay-z-dismisses-backlash-over-decision-have-bad-bunny-perform-super-bowl-lv-halftime-show",
    "timestamp": "2025-10-28T11:36:35Z"
  },
  {
    "title": "Donald Trump admits that he had an MRI & brags about acing his dementia test",
    "description": "Donald Trump traveled to Japan this week, and he’ll travel to South Korea on Wednesday. It’s not even about “an idiot abroad” anymore, this is something altogether worse. It’s Dementia Don Abroad, where he’s so senile and out-of-it, he brags about acing his d…",
    "link": "https://www.celebitchy.com/947409/donald_trump_admits_that_he_had_an_mri_brags_about_acing_his_dementia_test/",
    "timestamp": "2025-10-28T11:35:53Z"
  },
  {
    "title": "Obama Fumed at Nancy Pelosi for Endorsing Kamala Harris So Quickly in Tense Phone Call: ‘What the F*ck Did You Just Do?’",
    "description": "Obama was reportedly left blindsided and fuming when Nancy Pelosi broke ranks to endorse Kamala Harris as 2024 Democratic presidential pick.\nThe post Obama Fumed at Nancy Pelosi for Endorsing Kamala Harris So Quickly in Tense Phone Call: ‘What the F*ck Did Yo…",
    "link": "https://www.mediaite.com/media/news/obama-fumed-at-nancy-pelosi-for-endorsing-kamala-harris-so-quickly-in-tense-phone-call-what-the-fck-did-you-just-do/",
    "timestamp": "2025-10-28T11:35:52Z"
  },
  {
    "title": "Trump to meet with Nvidia's Huang tomorrow",
    "description": "United States President Donald Trump announced on Tuesday that he will meet with Nvidia Corporation Chief Executive Officer (CEO) Jensen Huang the next day.Speaking during a meeting with business lead...",
    "link": "https://biztoc.com/x/31c0de7efc2627d9",
    "timestamp": "2025-10-28T11:32:25Z"
  },
  {
    "title": "Trump Says 'Go Out And Buy A Toyota' As Automaker Pledges $10 Billion US Investment",
    "description": "In Tuesday’s address to U.S. troops in Japan, President Donald Trump expressed gratitude for Japan’s substantial investments in the United States and announced a significant development in the automotive industry.\nToyota, Rare Earths, Shipbuilding\nTrump, duri…",
    "link": "https://biztoc.com/x/771b881cd15e8788",
    "timestamp": "2025-10-28T11:32:17Z"
  },
  {
    "title": "Trump’s new trade deals give U.S. an edge over Southeast Asia",
    "description": "The pacts give Trump some clear wins, such as the removal of many tariff and nontariff barriers on U.S. exports into those countries.",
    "link": "https://www.japantimes.co.jp/business/2025/10/28/economy/trump-southeast-asia-trade-edge/",
    "timestamp": "2025-10-28T11:32:00Z"
  },
  {
    "title": "Donald Trump Considers Scott Bessent for Fed Chair",
    "description": "Trump heaps praise on Bessent, and sauys he has the ability to soothe markets.",
    "link": "https://biztoc.com/x/5ae1fcbae14b40b2",
    "timestamp": "2025-10-28T11:31:54Z"
  },
  {
    "title": "Judd Apatow Floats Chilling Theory About Trump's Meme Machine",
    "description": "“My feeling is that it’s always more complicated than we know,\" said the movie director.",
    "link": "https://www.huffpost.com/entry/judd-apatow-trump-memes_n_69009543e4b0973a4c055abf",
    "timestamp": "2025-10-28T11:31:12Z"
  },
  {
    "title": "Nearly Half Of State AGs Ask SCOTUS To End ‘Birthright Citizenship’",
    "description": "If the Supreme Court ends up taking the case and rules in line with the true understanding of the Fourteenth Amendment and the Citizenship Clause, the Trump administration could start turning the corner on removing the true number of illegals in the country.",
    "link": "https://thefederalist.com/2025/10/28/nearly-half-of-state-ags-ask-scotus-to-end-birthright-citizenship/",
    "timestamp": "2025-10-28T11:29:45Z"
  },
  {
    "title": "Nobody wants to go back in Argentina",
    "description": "It took a bit too long for the numbers to be released but it was worth the wait. Maybe the best explanation for the Argentine results comes from a voter in Buenos Aires. I watched a bit of the live coverage from Argentina and one man said it all. \"We don't wa…",
    "link": "https://freerepublic.com/focus/f-chat/4349116/posts",
    "timestamp": "2025-10-28T11:26:18Z"
  },
  {
    "title": "Trump Hints Deployment to More US Cities in Speech to Troops",
    "description": "While on the second stop of his three-country tour of Asia, President Donald Trump met with Japan’s newly elected Prime Minister Sanae Takaichi. After, while addressing American troops on a U.S. carrier, he referenced his controversial use of the military at …",
    "link": "https://www.today.com/video/trump-hints-deployment-of-troops-to-us-cities-is-far-from-over-250763845693",
    "timestamp": "2025-10-28T11:25:28Z"
  },
  {
    "title": "Doctor Identifies Possible Reasons for Trump's Secret MRI (Josh Fiallo/The Daily Beast)",
    "description": "Josh Fiallo / The Daily Beast:\nDoctor Identifies Possible Reasons for Trump's Secret MRI  —  EXPERTS WEIGH IN  —  A neurological issue was the first possibility the doctor mentioned.  —  A prominent cardiologist believes President Donald Trump may have quietl…",
    "link": "https://www.memeorandum.com/251028/p12",
    "timestamp": "2025-10-28T11:25:03Z"
  },
  {
    "title": "UN warns global carbon emissions only on track to fall 10% by 2035, far short of 60% goal",
    "description": "Emissions must fall 60% by 2035, from 2019 levels, for a good chance of limiting global warming to 1.5 Celsius above pre-industrial levels.",
    "link": "https://www.thejournal.ie/un-global-carbon-emissions-fall-far-short-of-goal-6858047-Oct2025/",
    "timestamp": "2025-10-28T11:23:33Z"
  },
  {
    "title": "Impasse leaves Afghanistan-Pakistan peace talks mired in uncertainty",
    "description": "Three days of negotiations in Istanbul fail to yield breakthrough, but both sides maintain ceasefire is holding.",
    "link": "https://www.aljazeera.com/news/2025/10/28/impasse-leaves-afghanistan-pakistan-peace-talks-mired-in-uncertainty",
    "timestamp": "2025-10-28T11:23:26Z"
  },
  {
    "title": "Russia Expects to Receive Positive Response From US to Putin’s Proposal on New START - Lavrov",
    "description": "Russia expects to receive a positive response from the United States to Russian President Vladimir Putin's proposal on the New START (New Strategic Arms Reduction Treaty), Russian Foreign Minister Sergey Lavrov said on Tuesday.",
    "link": "https://sputnikglobe.com/20251028/russia-expects-to-receive-positive-response-from-us-to-putins-proposal-on-new-start---lavrov-1123028702.html",
    "timestamp": "2025-10-28T11:22:02Z"
  },
  {
    "title": "How Mike Waltz is leading the Trump administration's 'a la carte' approach to UN funding",
    "description": "Mike Waltz is approaching his new role as U.S. ambassador to the United Nations and a mandate from President Donald Trump to cut funding for what were once...",
    "link": "https://www.yahoo.com/news/articles/mike-waltz-leading-trump-administrations-111426879.html",
    "timestamp": "2025-10-28T11:14:26Z"
  },
  {
    "title": "Mark Zuckerberg privately met with Pam Bondi to seek advice about how to talk to Trump, book says",
    "description": "Meta CEO Mark Zuckerberg privately sought Attorney General Pam Bondi's advice about speaking to President Donald Trump, a new book says.\nAnna Moneymaker/Getty Images; Chris Unger/Zuffa LLC via Getty Images\nMeta CEO Mark Zuckerberg privately met with Attorney …",
    "link": "https://biztoc.com/x/54bf0b195f4ae445",
    "timestamp": "2025-10-28T11:09:59Z"
  },
  {
    "title": "Trump — And House Republicans — Are Largely Absent As Shutdown Fallout Grows",
    "description": "The House is still out of session, while the president is working on trade agreements abroad.",
    "link": "https://www.huffpost.com/entry/trump-republicans-shutdown_n_69002b15e4b0fb1b95161d61",
    "timestamp": "2025-10-28T11:08:17Z"
  },
  {
    "title": "Venezuela's Nobel Prize-winner bets big on Trump as pressure builds on Maduro",
    "description": "Venezuelan opposition leader Maria Corina Machado's team sought to align with hawks in the Trump administration, arguing President Nicolas Maduro, through links to criminal gangs like Tren de Aragua, poses a direct threat to U.S. national security. This high-…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/venezuelas-nobel-prize-winner-bets-big-on-trump-as-pressure-builds-on-maduro/articleshow/124872116.cms",
    "timestamp": "2025-10-28T11:08:17Z"
  },
  {
    "title": "Trump's 'hot truck' becomes symbol of Japan trade talks",
    "description": "When Trump met Prime Minister Sanae Takaichi in Tokyo on Tuesday, an F-150 was parked prominently outside the Akasaka Palace venue.",
    "link": "https://www.japantimes.co.jp/business/2025/10/28/trump-japan-hot-truck/",
    "timestamp": "2025-10-28T11:05:00Z"
  },
  {
    "title": "Trump's 'hot truck' becomes symbol of Japan trade talks",
    "description": "When Trump met Prime Minister Sanae Takaichi in Tokyo on Tuesday, an F-150 was parked prominently outside the Akasaka Palace venue.",
    "link": "https://www.japantimes.co.jp/news/2025/10/28/japan/trump-japan-hot-truck/",
    "timestamp": "2025-10-28T11:05:00Z"
  },
  {
    "title": "Jamaica braces for Hurricane Melissa and an ICE shakeup: Morning Rundown",
    "description": "Hurricane Melissa nears Jamaica as a “catastrophic” Category 5 storm.",
    "link": "https://www.nbcnews.com/news/us-news/jamaica-braces-hurricane-melissa-ice-shakeup-morning-rundown-rcna240190",
    "timestamp": "2025-10-28T11:01:42Z"
  },
  {
    "title": "‘March on’ Trump protesters. Prolonged, mass protests can — and have — succeeded (Letters)",
    "description": "\"There are so many reasons to protest Trump. No Kings marchers attend for different reasons. March on, my brothers and sisters\" -- Barry Noreen, Denver",
    "link": "https://www.denverpost.com/2025/10/28/march-on-trump-protesters-prolonged-mass-protests-can-and-have-succeeded-letters/",
    "timestamp": "2025-10-28T11:01:11Z"
  },
  {
    "title": "Scoop: Combat veteran launches congressional run in bid to flip longtime Democrat-held seat red",
    "description": "Republican Jennifer-Ruth Green, a combat veteran, enters House race as GOP redistricting could shift northwest Indiana district from blue to red in 2026 elections.",
    "link": "https://www.foxnews.com/politics/scoop-combat-veteran-launches-congressional-run-bid-flip-longtime-democrat-held-seat-red",
    "timestamp": "2025-10-28T11:00:58Z"
  },
  {
    "title": "The Most Embarrassing Thing I’ve Ever Written",
    "description": "The Cut’s E.J. Dickson writes about the story that makes her cringe the most. Everyone has said something stupid online. But this take aged like milk.",
    "link": "http://www.thecut.com/article/most-embarrassing-thing-i-have-ever-written.html",
    "timestamp": "2025-10-28T11:00:55Z"
  },
  {
    "title": "Adam Smith Would Not Approve: The Evidence",
    "description": "Shortly after the “Liberation Day” tariffs were announced back in April, Janet Bufton wrote an excellent post about whether or not Adam Smith would approve of those so-called “reciprocal” tariffs. I also riffed off her post here. In both cases, we argued thes…",
    "link": "https://www.econlib.org/econlog/adam-smith-would-not-approve-the-evidence/",
    "timestamp": "2025-10-28T11:00:26Z"
  },
  {
    "title": "Israel-Hamas conflict would be 'worse' with a Kamala Harris presidency, Jerusalem Post editor says",
    "description": "Jerusalem Post editor says Israel-Hamas situation would be 'worse' under Kamala Harris presidency, praising Trump's unconventional approach to Middle East peace.",
    "link": "https://www.foxnews.com/media/israel-hamas-conflict-would-worse-kamala-harris-presidency-jerusalem-post-editor-says",
    "timestamp": "2025-10-28T11:00:13Z"
  },
  {
    "title": "Mark Zuckerberg privately met with Pam Bondi to seek advice about how to talk to Trump, book says",
    "description": "A new book reports that the Meta CEO privately met with AG Pam Bondi on March 12, during one of his trips to Washington earlier this year.",
    "link": "https://www.businessinsider.com/mark-zuckerberg-pam-bondi-private-meeting-trump-meta-2025-10",
    "timestamp": "2025-10-28T11:00:01Z"
  },
  {
    "title": "President for Life",
    "description": "Donald Trump is trying to amass the powers of a king.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/12/trump-third-term-authoritarianism/684616/",
    "timestamp": "2025-10-28T11:00:00Z"
  },
  {
    "title": "Did Marco Rubio confirm Rosie O'Donnell's passport was revoked?",
    "description": "U.S. Secretary of State Marco Rubio confirmed officials had revoked comedian Rosie O'Donnell's passport after she forfeited her U.S. citizenship, adding, \"She wanted to be an Irish citizen. Now she can stay there.\"",
    "link": "https://www.snopes.com//fact-check/revoked-rosie-odonnells-passport/",
    "timestamp": "2025-10-28T11:00:00Z"
  },
  {
    "title": "The Coming Election Mayhem",
    "description": "Donald Trump’s plans to throw the 2026 midterms into chaos are already under way.",
    "link": "https://www.theatlantic.com/magazine/archive/2025/12/2026-midterms-trump-threat/684615/",
    "timestamp": "2025-10-28T11:00:00Z"
  },
  {
    "title": "Obama was 'not happy' with quick Pelosi endorsement of Harris, book says",
    "description": "President Barack Obama was reportedly furious with Rep. Nancy Pelosi over her quick endorsement of Vice President Kamala Harris in 2024, a new book says.",
    "link": "https://www.foxnews.com/politics/obama-not-happy-quick-pelosi-endorsement-harris-book-says",
    "timestamp": "2025-10-28T10:59:39Z"
  },
  {
    "title": "Flight delays worsen as unpaid air traffic controllers feel government shutdown pain",
    "description": "Flights across the U.S. are facing growing delays as unpaid air traffic controllers feel the strain of the ongoing government shutdown.",
    "link": "https://www.foxnews.com/politics/flight-delays-worsen-unpaid-air-traffic-controllers-feel-government-shutdown-pain",
    "timestamp": "2025-10-28T10:54:36Z"
  },
  {
    "title": "Hamas hands over remains of hostage whose body was recovered nearly 2 years ago",
    "description": "Israel received the remains of a deceased hostage whose body was first returned in 2023. There are 13 deceased hostages in Gaza who are set to be returned.",
    "link": "https://www.foxnews.com/world/hamas-hands-over-remains-hostage-whose-body-recovered-nearly-2-years-ago",
    "timestamp": "2025-10-28T10:53:36Z"
  },
  {
    "title": "Bill Gates softens 'Climate Disaster' approach, says too many resources are going to fight the problem",
    "description": "Microsoft co-founder Bill Gates says countries and leaders need to shift their approach to climate change and focus on 'improving lives'",
    "link": "https://www.cnbc.com/2025/10/28/bill-gates-says-countries-need-to-rethink-their-climate-strategy.html",
    "timestamp": "2025-10-28T10:52:45Z"
  },
  {
    "title": "'Battered and bruised but still standing': WTO chief on global trade after tariffs",
    "description": "The global trade system has remained resilient despite the U.S.'  introduction of import tariffs, the WTO's chief said.",
    "link": "https://www.cnbc.com/2025/10/28/its-battered-and-bruised-but-still-standing-wto-on-global-trade.html",
    "timestamp": "2025-10-28T10:52:27Z"
  },
  {
    "title": "Ukraine strikes cut Russia's oil refining by 20%, says Zelenskyy",
    "description": "Ukrainian President Volodymyr Zelenskyy says long-range strikes on Russian refineries have reduced Moscow's oil refining capacity by 20%. He cites intelligence from Western governments. He says over 90% of these strikes were carried out by Ukrainian-made weap…",
    "link": "https://apnews.com/article/russia-ukraine-war-oil-refineries-zelenskyy-fa04014c6c1bdf0e15123d898c491b03",
    "timestamp": "2025-10-28T10:50:40Z"
  },
  {
    "title": "Trump and Takaichi Forge Rare Earths Deal to Bolster US-Japan Trade Power",
    "description": "Trump and Japan's Sanae Takaichi sign rare earths pact in Tokyo, deepening trade and defence ties while honouring Abe's legacy.",
    "link": "https://www.ibtimes.com/trump-takaichi-forge-rare-earths-deal-bolster-us-japan-trade-power-3788607",
    "timestamp": "2025-10-28T10:49:30Z"
  },
  {
    "title": "What Will Come From Trump-Xi Meeting? Here’s What We Know",
    "description": "By Virginia Allen, The Daily Signal | October 27, 2025\nChina is ready to make a trade deal with the U.S., Treasury Secretary Scott Bessent says. U.S. and Chinese officials have “created a framework” for President Donald Trump and Chinese leader Xi Jinping to …",
    "link": "https://biztoc.com/x/5f3958dcfe3a8e89",
    "timestamp": "2025-10-28T10:48:15Z"
  },
  {
    "title": "Building Architecture of European Security Without Russia is Unrealistic - Hungary's FM",
    "description": "Building the architecture of European security without Russia is unrealistic, Foreign Minister of Hungary Peter Szijjarto said on the sidelines of the 3rd International Conference on Eurasian Security in Minsk.",
    "link": "https://sputnikglobe.com/20251028/building-architecture-of-european-security-without-russia-is-unrealistic---hungarys-fm-1123027845.html",
    "timestamp": "2025-10-28T10:48:01Z"
  },
  {
    "title": "Anwar slams opposition for politicising key issues at Asean Summit",
    "description": "KUALA LUMPUR: As the 47th Asean Summit draws to a close, Prime Minister Datuk Seri Anwar Ibrahim has criticised Opposition leaders who are politicising the visit of United States President Donald Trump. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/28/anwar-slams-opposition-for-politicising-key-issues-at-asean-summit",
    "timestamp": "2025-10-28T10:48:00Z"
  },
  {
    "title": "U.S. Signs Rare Earths Deal With Japan Ahead of China Trade Talks",
    "description": "The United States and Japan signed on Tuesday a framework agreement to support the mining and processing of critical minerals and rare earths, as they seek to counter the dominant Chinese share of the market for minerals crucial for the defense, automotive, e…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/US-Signs-Rare-Earths-Deal-With-Japan-Ahead-of-China-Trade-Talks.html",
    "timestamp": "2025-10-28T10:47:58Z"
  },
  {
    "title": "Has Trump actually ended any wars?",
    "description": "President Donald Trump speaks ahead of the ceremonial signing of a ceasefire agreement between Thailand and Cambodia in Kuala Lumpur on October 26, 2025.﻿ | Andrew Caballero-Reynolds/AFP via Getty Images﻿ \nIn Malaysia on Sunday, on the sidelines of a summit o…",
    "link": "https://biztoc.com/x/af94659839d1531a",
    "timestamp": "2025-10-28T10:47:56Z"
  },
  {
    "title": "Man pleads guilty to Japan ex-prime minister's murder: \"Everything is true\"",
    "description": "\"There is no doubt that I have done all this,\" Tetsuya Yamagami said in court, admitting to the murder of the country's longest-serving leader in 2022.",
    "link": "https://www.cbsnews.com/news/shinzo-abe-murder-suspect-pleads-guilty-japan/",
    "timestamp": "2025-10-28T10:47:00Z"
  },
  {
    "title": "Sean 'Diddy' Combs Receives Prison Release Date Following October Sentencing",
    "description": "Sean \"Diddy\" Combs' federal prison release date is set for May 8, 2028, following his October sentencing for prostitution-related convictions.",
    "link": "https://www.ibtimes.com/sean-diddy-combs-receives-prison-release-date-following-october-sentencing-3788613",
    "timestamp": "2025-10-28T10:46:50Z"
  },
  {
    "title": "Trump’s bulldozer is aimed at more than the White House",
    "description": "The president has a third term — and American democracy — in his sights",
    "link": "https://www.salon.com/2025/10/28/trumps-bulldozer-is-aimed-at-more-than-the-white-house/",
    "timestamp": "2025-10-28T10:45:53Z"
  }
]