[
  {
    "title": "FACT FOCUS: Trump gets it wrong claiming no murders in DC for the last six months",
    "description": "In addition to pardoning two North Carolina turkeys at the annual White House ceremony, President Donald Trump discussed his crime-fighting efforts in Washington, D.C., claiming that it’s been six months since the city has seen a murder",
    "link": "https://abcnews.go.com/Politics/wireStory/fact-focus-trump-gets-wrong-claiming-murders-dc-127878340",
    "timestamp": "2025-11-25T22:53:49Z"
  },
  {
    "title": "US judge orders Trump administration to provide bond hearings to detained migrants",
    "description": "By Daniel Wiessner -A federal judge on Tuesday ruled that President Donald Trump's administration cannot impose mandatory detention on thousands of migrants ...",
    "link": "https://www.yahoo.com/news/articles/us-judge-orders-trump-administration-225337838.html",
    "timestamp": "2025-11-25T22:53:37Z"
  },
  {
    "title": "Insurrection Chic—Democrats’ Dangerous New Fad",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Insurrection Chic—Democrats’ Dangerous New Fad appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/11/25/insurrection-chic-democrats-dangerous-new-fad/",
    "timestamp": "2025-11-25T22:52:57Z"
  },
  {
    "title": "‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russia",
    "description": "Brian Fitzpatrick warned Trump's administration he has a \"major problem\" after Steve Witkoff reportedly advised on how to \"pitch\" their Ukraine plans to Trump.\nThe post ‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russi…",
    "link": "https://www.mediaite.com/politics/major-problem-house-republican-rips-trump-administrations-secret-meetings-with-russia/",
    "timestamp": "2025-11-25T22:52:36Z"
  },
  {
    "title": "Rush Hour 4 Finally Gets the Official Update Fans Have Been Waiting On For Nearly 20 Years",
    "description": "The Rush Hour series ran strong through the 2000s on the unlikely pairing of comedic actor Chris Tucker (Friday) and martial arts movie superstar Jackie Chan (Drunken Master). The ‘East meets West’ appeal of Rush Hour made it an international hit, with the fi…",
    "link": "http://comicbook.com/movies/news/rush-hour-4-finally-gets-the-official-update-fans-have-been-waiting-on-for-nearly-20-years/",
    "timestamp": "2025-11-25T22:51:29Z"
  },
  {
    "title": "Health care plan circulated by the White House runs into familiar GOP divisions",
    "description": "The proposal has so far been met with a stony silence on Capitol Hill.",
    "link": "https://www.bostonherald.com/2025/11/25/congress-health-care-gop/",
    "timestamp": "2025-11-25T22:49:31Z"
  },
  {
    "title": "Nicolle Wallace shuts down key Trump claim about the economy",
    "description": "President Donald Trump's administration has continued to maintain that the economy during Trump's second term has been strong, even as prices for basic necessities continue to climb.During a Tuesday segment, MS NOW host Nicolle Wallace contrasted the words of…",
    "link": "https://www.rawstory.com/alternet-posts/nicolle-wallace-trump-economy/",
    "timestamp": "2025-11-25T22:47:08Z"
  },
  {
    "title": "Sorting out the Facts on Epstein Claims",
    "description": "The House voted nearly unanimously on Nov. 18 to force the Department of Justice to release “all unclassified records, documents, communications, and investigative materials” related to the investigation and prosecution of Jeffrey Epstein. In the days before …",
    "link": "https://www.factcheck.org/2025/11/sorting-out-the-facts-on-epstein-claims/",
    "timestamp": "2025-11-25T22:46:15Z"
  },
  {
    "title": "Zohran Mamdani and Donald Trump Prove That There Are Two Paths Toward Socialism",
    "description": "As fans of horseshoe theory point out, the political extremes might differ on details, but they have a lot in common.",
    "link": "https://reason.com/2025/11/26/zohran-mamdani-and-donald-trump-prove-that-there-are-two-paths-toward-socialism/",
    "timestamp": "2025-11-25T22:45:53Z"
  },
  {
    "title": "Swalwell claims Pulte abused power to target Trump critics",
    "description": "Representative Eric Swalwell, a California Democrat who has been a frequent critic of Donald Trump, filed a lawsuit on Tuesday claiming Federal Housing Finance Agency Director Bill Pulte abused his power to retaliate against one of the president’s political o…",
    "link": "https://biztoc.com/x/f907227e99ffacd8",
    "timestamp": "2025-11-25T22:45:03Z"
  },
  {
    "title": "Is Donald Trump Losing Republicans? What Polls Show",
    "description": "Trump's public break with Representative Marjorie Taylor Greene may not translate to losses with his base, according to polls.",
    "link": "https://biztoc.com/x/1b266f6a950c726b",
    "timestamp": "2025-11-25T22:44:42Z"
  },
  {
    "title": "White House calls MS NOW story about Trump considering firing Kash Patel 'completely made up'",
    "description": "White House Press Secretary Karoline Leavitt is forcefully pushing back against MS NOW's report that President Donald Trump was mulling the firing of FBI Director Kash Patel.",
    "link": "https://www.foxnews.com/media/white-house-calls-ms-now-story-trump-considering-firing-kash-patel-completely-made-up",
    "timestamp": "2025-11-25T22:44:26Z"
  },
  {
    "title": "Jack Smith’s Team Knew They Might Face Legal Challenges For Secretly Seeking Senators’ Phone Records",
    "description": "Special counsel Jack Smith's team pressed forward with secretly seeking phone records for members of Congress after learning of potential litigation risks.",
    "link": "https://dailycaller.com/2025/11/25/jack-smith-gop-phone-recorrds/",
    "timestamp": "2025-11-25T22:42:00Z"
  },
  {
    "title": "Top U.S. military officials will visit Caribbean leaders as Trump weighs next steps",
    "description": "Defense Secretary Pete Hegseth will travel to Santo Domingo, Dominican Republic, and meet Wednesday with the country’s top leaders, the Pentagon said Tuesday.",
    "link": "https://www.pbs.org/newshour/world/top-u-s-military-officials-will-visit-caribbean-leaders-as-trump-weighs-next-steps",
    "timestamp": "2025-11-25T22:40:38Z"
  },
  {
    "title": "White House responds to report claiming Trump is considering removing Kash Patel",
    "description": "As story broke, president was with FBI director in Oval Office, took photo with him to rebut allegation",
    "link": "https://www.wnd.com/2025/11/white-house-responds-report-claiming-trump-is-considering/",
    "timestamp": "2025-11-25T22:37:35Z"
  },
  {
    "title": "‘Just Staggering’: Trump Aide’s Leaked Phone Call With Putin Advisor Stuns Pundits",
    "description": "“This is a major problem. And one of the many reasons why these ridiculous side shows and secret meetings need to stop.\"\nThe post ‘Just Staggering’: Trump Aide’s Leaked Phone Call With Putin Advisor Stuns Pundits first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/just-staggering-trump-aides-leaked-phone-call-with-putin-advisor-stuns-pundits/",
    "timestamp": "2025-11-25T22:35:37Z"
  },
  {
    "title": "Sean Combs: The Reckoning sets December release on Netflix",
    "description": "Curtis \"50 Cent\" Jackson takes aim at Diddy in Sean Combs: The Reckoning, a four-part doc set for a December release on Netflix.\nThe post Sean Combs: The Reckoning sets December release on Netflix appeared first on JoBlo.",
    "link": "https://www.joblo.com/sean-combs-the-reckoning-release-netflix/",
    "timestamp": "2025-11-25T22:34:46Z"
  },
  {
    "title": "Is making ‘Rush Hour 4’ Trump’s latest executive order? Paramount looks to be onboard",
    "description": "Paramount is reportedly close to a deal to revive the long dormant “Rush Hour” franchise, as the request of President Donald Trump.",
    "link": "https://biztoc.com/x/14ff4230fc33043c",
    "timestamp": "2025-11-25T22:34:10Z"
  },
  {
    "title": "Swalwell’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "Rep. Eric Swalwell, who is running for governor of California, served as a House manager in President Donald Trump’s 2021 impeachment trial. His lawsuit claims Federal Housing Finance Agency Director Bill Pulte has played “an integral role in supporting Presi…",
    "link": "https://biztoc.com/x/693e425616600c37",
    "timestamp": "2025-11-25T22:34:02Z"
  },
  {
    "title": "Despite Trump's best efforts to reshore manufacturing, blue-collar employment is plunging for the first time since the pandemic with 59,000 lost jobs",
    "description": "Back in April, President Donald Trump touted his aggressive tariff policy as a catalyst for the reshoring of manufacturing jobs. Eight months later, reshoring progress is nowhere to be seen.\nThe jobs report from the Bureau of Labor Statistics released last we…",
    "link": "https://biztoc.com/x/52c4d7d83ca56903",
    "timestamp": "2025-11-25T22:33:54Z"
  },
  {
    "title": "Trump Comments on His Weight, Says He 'Wants to Lose a Few Pounds' but Not on Thanksgiving",
    "description": "Donald Trump just made another comment about his weight during this week's Turkey Pardon ceremony at the White House.",
    "link": "https://www.ibtimes.com/trump-comments-his-weight-says-he-wants-lose-few-pounds-not-thanksgiving-3791259",
    "timestamp": "2025-11-25T22:32:37Z"
  },
  {
    "title": "Ex-GOP Speaker Says He Wants Nancy Mace ‘To Get The Help She Needs’ In Blistering Takedown",
    "description": "Kevin McCarthy's comments came after Mace and seven other Republicans voted to boot him out as speaker of the House two years ago.",
    "link": "https://www.huffpost.com/entry/kevin-mccarthy-nancy-mace-mental-health-help_n_6925d6f0e4b05f521ddac40d",
    "timestamp": "2025-11-25T22:32:11Z"
  },
  {
    "title": "As Trump Admin Continues Its Immigration Crackdown, Migrants Report Financial Abuse by Attorneys",
    "description": "The high cost of legal representation, combined with the uncertainty created by shifting immigration rules under President Donald Trump, has led fewer migrants to seek help from attorneys.",
    "link": "https://www.ibtimes.com/trump-admin-continues-its-immigration-crackdown-migrants-report-financial-abuse-attorneys-3791262",
    "timestamp": "2025-11-25T22:31:42Z"
  },
  {
    "title": "Swalwell claims Pulte abused power to target Trump critics",
    "description": "The congressman thinks the FHFA director “abused his position” by searching the Fannie and Freddie databases to “concoct\" allegations of mortgage fraud.",
    "link": "https://fortune.com/2025/11/25/swalwell-sues-pulte-fhfa-fannie-freddie-databases-mortgage-fraud/",
    "timestamp": "2025-11-25T22:30:36Z"
  },
  {
    "title": "BBC chair admits broadcaster took too long to address Trump documentary editing scandal",
    "description": "BBC Chair Samir Shah admitted the broadcaster took too long to address the documentary that President Trump has called \"false, defamatory, disparaging and inflammatory.\"",
    "link": "https://www.foxnews.com/media/bbc-chair-admits-broadcaster-took-too-long-address-trump-documentary-editing-scandal",
    "timestamp": "2025-11-25T22:30:35Z"
  },
  {
    "title": "Trump to send top envoy to Russia in push to finalise Ukraine plan",
    "description": "US president sends Steve Witkoff to meet Vladimir Putin to iron out 'a few' differences over plan to end Ukraine war.",
    "link": "https://www.aljazeera.com/news/2025/11/25/trump-says-close-to-ukraine-deal-kyivs-allies-urge-pressure-on-moscow",
    "timestamp": "2025-11-25T22:29:44Z"
  },
  {
    "title": "Russia warns it may reject US-Ukraine peace plan if it fails to uphold Alaska summit 'understandings'",
    "description": "Russia is threatening to reject President Donald Trump's Ukraine peace plan unless \"key understandings\" from his Alaska summit with President Putin are upheld.",
    "link": "https://www.foxnews.com/world/russia-warns-may-reject-us-ukraine-peace-plan-fails-uphold-alaska-summit-understandings",
    "timestamp": "2025-11-25T22:29:10Z"
  },
  {
    "title": "Dartmouth professor grumbles over lack of young people protesting Trump",
    "description": "A Dartmouth government professor warned that youth absence from Trump protests signals the need for new opposition strategies beyond conventional demonstrations.",
    "link": "https://www.foxnews.com/media/dartmouth-professor-grumbles-lack-young-people-protesting-trump",
    "timestamp": "2025-11-25T22:26:54Z"
  },
  {
    "title": "Gemini 3’s Success Means Google Is Back, Baby",
    "description": "Plus: Beware of AI-generated slop recipes this Thanksgiving.",
    "link": "https://www.forbes.com/sites/the-prompt/2025/11/25/gemini-3s-success-means-google-is-back-baby/",
    "timestamp": "2025-11-25T22:24:54Z"
  },
  {
    "title": "Russia Likely To Reject US-Ukraine Peace Plan As War May Last Through Christmas",
    "description": "Russia is said to reject a new peace plan brokered by the US and Ukraine following the controversial 28-point proposal that would see Ukraine making a lot of concessions.",
    "link": "https://www.ibtimes.com/russia-likely-reject-us-ukraine-peace-plan-war-may-last-through-christmas-3791263",
    "timestamp": "2025-11-25T22:24:41Z"
  },
  {
    "title": "Swalwell’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "Rep. Eric Swalwell, who is running for governor of California, served as a House manager in President Donald Trump’s 2021 impeachment trial. His lawsuit claims Federal Housing Finance Agency Director Bill Pulte has played “an integral role in supporting Presi…",
    "link": "https://www.pbs.org/newshour/politics/swalwells-lawsuit-claims-trump-housing-official-abused-post-to-target-trump-critics",
    "timestamp": "2025-11-25T22:24:23Z"
  },
  {
    "title": "BBC Rebuked for Censoring Historian Who Called Trump ‘Most Openly Corrupt President in American History’",
    "description": "The BBC is being accused of bending to pressure from the White House once again after it removed a historian's claim that President Donald Trump was “the most openly corrupt president in American history” from one of its broadcasts.Rutger Bregman, a Dutch aut…",
    "link": "https://www.commondreams.org/news/bbc-censors-historian-trump-criticism",
    "timestamp": "2025-11-25T22:24:12Z"
  },
  {
    "title": "Marjorie Taylor Greene's resignation shocked some in Georgia who say she could've won without Trump",
    "description": "",
    "link": "https://biztoc.com/x/80d7404d1be0fea5",
    "timestamp": "2025-11-25T22:22:39Z"
  },
  {
    "title": "Top US military officials are visiting Caribbean leaders as Trump weighs next steps",
    "description": "Top U.S. military officials are meeting leaders of Caribbean nations this week as the Trump administration has escalated its firepower in the region as part of what it calls a campaign against drug trafficking",
    "link": "https://abcnews.go.com/US/wireStory/top-us-military-officials-visiting-caribbean-leaders-trump-127877197",
    "timestamp": "2025-11-25T22:21:58Z"
  },
  {
    "title": "Trump administration to retroactively vet refugees already resettled in US",
    "description": "Immigration rights advocates say the new policy aims to 'bully some of the most vulnerable' people in US society.",
    "link": "https://www.aljazeera.com/news/2025/11/25/trump-administration-to-retroactively-vet-refugees-already-resettled-in-us",
    "timestamp": "2025-11-25T22:21:27Z"
  },
  {
    "title": "The New Yorker's attempt to evoke pity for illegal alien is obliterated by devastating community note",
    "description": "Another attempt to garner sympathy for the plight of a deported illegal immigrant was undone by devastating information provided in a community note on X.The New Yorker report documented the deportation of Jamaican national Orville Etoria to a prison facility…",
    "link": "https://www.theblaze.com/news/new-yorker-illegal-community-note",
    "timestamp": "2025-11-25T22:20:00Z"
  },
  {
    "title": "Pope Leo headed to Turkey and Lebanon for 1st trip abroad as leader of Catholic Church",
    "description": "Pope Leo will embark on his first trip outside Italy as the leader of the Catholic Church on Thursday, traveling to Turkey and Lebanon, where he is expected to make appeals for peace in the region and urge unity among long-divided Christian churches.",
    "link": "https://www.cbc.ca/news/world/pope-leo-turkey-lebanon-9.6992165",
    "timestamp": "2025-11-25T22:15:44Z"
  },
  {
    "title": "Reality Star Savannah Chrisley Teases Run for Political Office",
    "description": "Reality star Savannah Chrisley could end up launching the next American political dynasty ... because she just talked to her dad, Todd, about the possibility of running for office on Tuesday's episode of the \"Unlocked With Savannah Chrisley\"…\n Permalink",
    "link": "https://www.tmz.com/2025/11/25/savannah-chrisley-teases-run-for-office/",
    "timestamp": "2025-11-25T22:15:22Z"
  },
  {
    "title": "Trump allies seek to slip a visa workaround past MAGA hardliners: report",
    "description": "President Donald Trump's allies are seeking to create a seasonal worker visa to get past MAGA followers' firm stance on removing migrants they think are taking jobs away from Americans, according to a new report. A Mar-a-Lago trade group is pushing to expand …",
    "link": "https://www.rawstory.com/donald-trump-2674342209/",
    "timestamp": "2025-11-25T22:15:15Z"
  },
  {
    "title": "RUSH HOUR 4 Officially Coming From Paramount And Warner Bros. After Reported Interest From Donald Trump",
    "description": "Following claims that Donald Trump was interested in a continuation of the Rush Hour franchise, a fourth installment in the series has now been confirmed.",
    "link": "https://comicbookmovie.com/action/rush-hour-4-officially-coming-from-paramount-and-warner-bros-after-reported-interest-from-donald-trump-a225130",
    "timestamp": "2025-11-25T22:15:00Z"
  },
  {
    "title": "Paramount To Distribute “Rush Hour 4”",
    "description": "Yesterday’s report that U.S. President Donald Trump wants Jackie Chan, Chris Tucker and filmmaker Brett Ratner to re-team for another “Rush Hour” movie appears to have been serious. Puck News reports that Paramount is closing in on a deal to distribute a four…",
    "link": "https://www.darkhorizons.com/paramount-to-distribute-rush-hour-4/",
    "timestamp": "2025-11-25T22:14:39Z"
  },
  {
    "title": "Witkoff advised Russia on how to pitch Ukraine plan to Trump",
    "description": "U.S. presidential envoy Steve Witkoff, fresh from the triumph of the Gaza peace deal, held a phone call last month with a senior Kremlin official to suggest they work together on a similar plan for Ukraine — and that Vladimir Putin should raise it with Donald…",
    "link": "https://biztoc.com/x/186ba1b41b95401c",
    "timestamp": "2025-11-25T22:11:12Z"
  },
  {
    "title": "Trump's 'losing streak' is a 'five alarm fire' for Republicans: ex-GOP analyst",
    "description": "President Donald Trump's sinking numbers are a flashing warning sign for Republican prospects in upcoming elections, former GOP strategist Rick Wilson wrote on his Substack on Tuesday.\"Right before Thanksgiving 2025, the supposedly unstoppable MAGA juggernaut…",
    "link": "https://www.rawstory.com/web-push-notification/trump-losing-2674342127/",
    "timestamp": "2025-11-25T22:09:49Z"
  },
  {
    "title": "Can the World Address Climate Change Without the US?",
    "description": "For many environmental advocates, the COP30 climate negotiations ended this weekend in disappointment. The annual United Nations conference, which brought together more than 190 countries in Belém, Brazil, concluded without any firm plans to phase out fossil …",
    "link": "https://www.motherjones.com/environment/2025/11/cop30-brazil-us-climate-warming-trump/",
    "timestamp": "2025-11-25T22:09:10Z"
  },
  {
    "title": "WATCH: Joy Reid pushes possibility JD Vance is ‘throwing his wife under the bus’ for ‘white queen’ Erika Kirk",
    "description": "'You not doing the right thing. You supposed to be a widow. You wearing leather pants! That's not widow-wear'",
    "link": "https://www.wnd.com/2025/11/watch-joy-reid-pushes-possibility-jd-vance-is/",
    "timestamp": "2025-11-25T22:06:46Z"
  },
  {
    "title": "‘Rush Hour 4’: Everything We Know So Far About the Cast, Release Date, Plot & More",
    "description": "'Rush Hour 4' is reportedly in the works at Paramount after Donald Trump allegedly requested it.",
    "link": "https://hollywoodlife.com/feature/rush-hour-4-cast-release-date-plot-5490201/",
    "timestamp": "2025-11-25T22:06:43Z"
  },
  {
    "title": "Trump’s pardon of top allies may inadvertently cover mass voter fraud: legal experts",
    "description": "Legal experts are warning that President Donald Trump may have unintentionally issued a sweeping pardon that could shield not only Rudy Giuliani and other top allies, but any U.S. citizen who committed voter fraud in 2020 – including people who cast multiple …",
    "link": "https://www.rawstory.com/trump-pardons-2020/",
    "timestamp": "2025-11-25T22:05:49Z"
  },
  {
    "title": "Witkoff advised Russia on how to pitch Ukraine plan to Trump",
    "description": "U.S. presidential envoy Steve Witkoff held a phone call last month with a senior Kremlin official to suggest they work together on a plan for Ukraine.",
    "link": "https://fortune.com/2025/11/25/ukraine-peace-plan-witkoff-call-with-russia-kremlin-official/",
    "timestamp": "2025-11-25T22:04:42Z"
  },
  {
    "title": "The Trump Administration Wants To Review Tens Of Thousands Of Refugees Who Entered Under Biden",
    "description": "It's an unprecedented move that could reopen the cases of many who sought U.S. protection.",
    "link": "https://www.huffpost.com/entry/trump-refugees-biden_n_6926204fe4b0774c10d509bc",
    "timestamp": "2025-11-25T22:02:49Z"
  },
  {
    "title": "Jair Bolsonaro begins 27-year prison sentence for Brazilian coup attempt",
    "description": "The far-right leader had been under house arrest since August and was taken to federal police headquarters Saturday after trying to break his ankle monitor.",
    "link": "https://www.pbs.org/newshour/world/jair-bolsonaro-begins-27-year-prison-sentence-for-brazilian-coup-attempt",
    "timestamp": "2025-11-25T22:01:40Z"
  },
  {
    "title": "Donald Trump says Ukraine peace plan is ‘fine-tuned’ and envoys being sent to Putin",
    "description": "US president Donald Trump said his plan to end the war in Ukraine has been “fine-tuned” and that he is sending envoy Steve Witkoff to meet Russian president Vladimir Putin and army secretary Dan Driscoll to meet Ukrainian officials.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-ukraine-peace-plan-is-fine-tuned-and-envoys-being-sent-to-putin/a60835439.html",
    "timestamp": "2025-11-25T22:01:36Z"
  },
  {
    "title": "Maersk to Resume Suez Canal Shipping Operations ‘as Soon as Conditions Allow’",
    "description": "Shipping giant Maersk said on Tuesday that it was close to resuming shipping through the Suez Canal almost two years after terrorist attacks from the Iran-backed Houthi insurgents of Yemen forced many transport companies to avoid the route through the Red Sea…",
    "link": "https://www.breitbart.com/middle-east/2025/11/25/maersk-to-resume-suez-canal-shipping-operations-as-soon-as-conditions-allow/",
    "timestamp": "2025-11-25T22:01:14Z"
  },
  {
    "title": "Strike CEO forced out after JPMorgan raises ‘fraudulent activities’ concern",
    "description": "Senator Lummis warned the banking restriction could push digital asset industry overseas.",
    "link": "https://ambcrypto.com/strike-ceo-forced-out-after-jpmorgan-raises-fraudulent-activities-concern/",
    "timestamp": "2025-11-25T22:00:45Z"
  },
  {
    "title": "Trump library redo: Miami Dade College board to hold new meeting on land giveaway",
    "description": "Miami Dade College’s board of trustees is hitting the reset button on a land giveaway for Donald Trump’s planned $950 million presidential library and high-rise complex next to downtown Miami’s Freedom Tower, bowing to a legal challenge that accused the schoo…",
    "link": "https://therealdeal.com/miami/2025/11/25/miami-dade-college-board-to-hold-new-vote-on-trump-library/",
    "timestamp": "2025-11-25T22:00:00Z"
  },
  {
    "title": "Decoding the Trump-Xi Phone Call",
    "description": "The leaders talked trade, Taiwan, and—likely—Japan.",
    "link": "http://foreignpolicy.com/2025/11/25/trump-xi-china-united-states-call-diplomacy-japan-taiwan-takaichi/",
    "timestamp": "2025-11-25T21:55:48Z"
  },
  {
    "title": "Ukraine Agrees in Principle to Revised U.S. Peace Proposal",
    "description": "But major points of contention remain unresolved, including possible territorial concessions.",
    "link": "http://foreignpolicy.com/2025/11/25/ukraine-agrees-us-peace-deal-russia-talks-zelensky-putin-trump/",
    "timestamp": "2025-11-25T21:55:06Z"
  },
  {
    "title": "Kyiv Agrees in Principle to Revised U.S. Peace Plan",
    "description": "But major points of contention remain unresolved, including possible territorial concessions.",
    "link": "http://foreignpolicy.com/2025/11/25/ukraine-agrees-us-peace-deal-russia-talks/",
    "timestamp": "2025-11-25T21:55:00Z"
  },
  {
    "title": "Judge orders DOJ to expedite processing of records request about Epstein files",
    "description": "The Department of Justice ignored earlier Freedom of Information Act requests regarding their July decision not to release the Epstein files.",
    "link": "https://abcnews.go.com/US/judge-orders-expedited-processing-request-records-related-dojs/story?id=127872573",
    "timestamp": "2025-11-25T21:53:41Z"
  },
  {
    "title": "“Canary in the coal mine”: McCarthy predicts GOP exodus following Greene resignation",
    "description": "The former House speaker thinks the GOP could see a wider exodus as MAGA rift grows.",
    "link": "https://www.salon.com/2025/11/25/canary-in-the-coal-mine-mccarthy-predicts-gop-exodus-following-greene-resignation/",
    "timestamp": "2025-11-25T21:53:25Z"
  },
  {
    "title": "Zohran Mamdani Appoints Prominent Police Abolitionist to His Transition Team",
    "description": "New York City mayor-elect Zohran Mamdani added Alex Vitale, the author of The End of Policing who has called for the \"abolition\" of cops, to his transition team\nThe post Zohran Mamdani Appoints Prominent Police Abolitionist to His Transition Team first appear…",
    "link": "https://www.mediaite.com/media/news/zohran-mamdani-appoints-prominent-police-abolitionist-to-his-transition-team/",
    "timestamp": "2025-11-25T21:52:55Z"
  },
  {
    "title": "Elton John Says Ending AIDS Could Make Trump “One of the Greatest Presidents in History”",
    "description": "In a recent interview, the British singer appealed to the US president's sense of legacy.\nElton John Says Ending AIDS Could Make Trump “One of the Greatest Presidents in History”\nEddie Fu",
    "link": "https://consequence.net/2025/11/elton-john-trump-ending-aids-greatest-president/",
    "timestamp": "2025-11-25T21:52:28Z"
  },
  {
    "title": "Trump is doing everything in his power to make sure Putin gets what he wants",
    "description": "Almost lost among Donald Trump’s latest assault on America, has been his utter disdain for our democracy, and love for Russian President Vladimir Putin.Amid Trump’s attack on our government, White House, health-care, food benefits, vote, the arts, environment…",
    "link": "https://www.rawstory.com/alternet-posts/trump-putin-deal/",
    "timestamp": "2025-11-25T21:52:07Z"
  },
  {
    "title": "People Are Underestimating America’s Groyper Problem",
    "description": "Rising American anti-Semitism isn’t a foreign influence operation.",
    "link": "https://www.theatlantic.com/politics/2025/11/online-antisemitism-groyper-problem-foreign-accounts/685064/",
    "timestamp": "2025-11-25T21:50:16Z"
  },
  {
    "title": "Wisconsin Supreme Court says 3-judge panels must decide congressional redistricting cases",
    "description": "The Wisconsin Supreme Court has ordered that a pair of three-judge panels hear two lawsuits that argue the battleground state’s congressional maps must be redrawn because they unconstitutionally favor Republicans",
    "link": "https://abcnews.go.com/Politics/wireStory/wisconsin-supreme-court-3-judge-panels-decide-congressional-127875609",
    "timestamp": "2025-11-25T21:49:36Z"
  },
  {
    "title": "Mark Kelly fires back at Trump over military comments, says, ‘I will not be intimidated’",
    "description": "Sen. Mark Kelly, D-Ariz., appeared on MS NOW's \"The Rachel Maddow Show\" on Monday, where he responded to the Pentagon's announcement that it has opened a formal review into allegations of misconduct over a video calling on service members to \"refuse illegal o…",
    "link": "https://freerepublic.com/focus/f-news/4354612/posts",
    "timestamp": "2025-11-25T21:48:46Z"
  },
  {
    "title": "X’s new feature raises questions about the foreign origins of some popular US political accounts",
    "description": "By BARBARA ORTUTAY\nThey go by names like @TRUMP_ARMY— or @MAGANationX, and their verified accounts proudly display portraits of President Donald Trump, voter rallies and American flags. And they’re constantly posting about U.S. politics to their followers, so…",
    "link": "https://biztoc.com/x/15362af08ae22d2d",
    "timestamp": "2025-11-25T21:48:11Z"
  },
  {
    "title": "Bolsonaro behind bars: the fall of Brazil’s polarizing firebrand",
    "description": "Jair Bolsonaro always swore he would never be imprisoned. This trademark defiance crumbled as the man who rose from fringe firebrand to president and reshaped Brazilian politics began serving a 27-year sentence for a failed coup bid. Bolsonaro, a former army …",
    "link": "https://www.digitaljournal.com/world/bolsonaro-behind-bars-the-fall-of-brazils-polarizing-firebrand/article",
    "timestamp": "2025-11-25T21:47:20Z"
  },
  {
    "title": "Top Trump Aide Coached the Russians On How to Butter Up Trump With Fake Flattery — Leaked Transcript Reveals",
    "description": "A transcript of a leaked phone call revealed a top aide of President Donald Trump coaching up the Russians on how to win him over.\nThe post Top Trump Aide Coached the Russians On How to Butter Up Trump With Fake Flattery — Leaked Transcript Reveals first appe…",
    "link": "https://www.mediaite.com/media/news/top-trump-aide-coached-the-russians-on-how-to-butter-up-trump-with-fake-flattery-leaked-transcript-reveals/",
    "timestamp": "2025-11-25T21:45:43Z"
  },
  {
    "title": "DC Mayor Bowser announces she won’t seek fourth term, as Trump’s federal intervention continues",
    "description": "Bowser has served three terms since being first elected in 2015.",
    "link": "https://www.bostonherald.com/2025/11/25/dc-mayor-bowser/",
    "timestamp": "2025-11-25T21:43:30Z"
  },
  {
    "title": "Democratic congressman's lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "A federal lawsuit filed by U.S. Rep. Eric Swalwell accuses the Trump administration’s top housing regulator of abusing his position to misuse private mortgage records belonging to Swalwell and other Democratic critics of the Republican president",
    "link": "https://abcnews.go.com/Politics/wireStory/democratic-congressmans-lawsuit-claims-trump-housing-official-abused-127876862",
    "timestamp": "2025-11-25T21:41:37Z"
  },
  {
    "title": "Democratic congressman's lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "A federal lawsuit filed by U.S. Rep. Eric Swalwell accuses the Trump administration’s top housing regulator of abusing his position to misuse private mortgage records belonging to Swalwell and other Democratic critics of the Republican president",
    "link": "https://abcnews.go.com/US/wireStory/democratic-congressmans-lawsuit-claims-trump-housing-official-abused-127876860",
    "timestamp": "2025-11-25T21:41:36Z"
  },
  {
    "title": "Democrats Panic as Warner Bros. Sale Threatens End to CNN’s Liberal Media Cartel",
    "description": "A potential merger between Paramount Skydance and Warner Bros. Discovery is facing opposition from Sen. Elizabeth Warren and the Writers Guild of America, who warn the deal would consolidate control of major news and entertainment outlets under a single congl…",
    "link": "https://www.breitbart.com/entertainment/2025/11/25/democrats-panic-as-warner-bros-sale-threatens-end-to-cnns-liberal-media-cartel/",
    "timestamp": "2025-11-25T21:40:37Z"
  },
  {
    "title": "Wisconsin Supreme Court says 3-judge panels must decide congressional redistricting cases",
    "description": "It’s unclear whether new districts could be ordered in time for the 2026 midterms.",
    "link": "https://www.bostonherald.com/2025/11/25/wisconsin-supreme-court-redistricting/",
    "timestamp": "2025-11-25T21:38:18Z"
  },
  {
    "title": "Democrats Who Urged Military to ‘Refuse Illegal Orders’ to Be Interviewed by FBI",
    "description": "The FBI and DOJ are seeking to interview six Democrat members of Congress about a controversial video they participated in urging members of the military... Read More\nThe post Democrats Who Urged Military to ‘Refuse Illegal Orders’ to Be Interviewed by FBI ap…",
    "link": "https://www.dailysignal.com/2025/11/25/democrats-who-urged-military-to-refuse-illegal-orders-to-be-interviewed-by-fbi/",
    "timestamp": "2025-11-25T21:37:19Z"
  },
  {
    "title": "Paramount Announces 'Rush Hour 4' in the Works After Trump Pushed for It",
    "description": "Paramount has confirmed that \"Rush Hour 4\" is now in the works after President Donald Trump reportedly urged producers to consider a fourth entry in the blockbuster buddy-cop film series.\nThe post Paramount Announces ‘Rush Hour 4’ in the Works After Trump Pus…",
    "link": "https://www.breitbart.com/entertainment/2025/11/25/paramount-announces-rush-hour-4-in-the-works-after-trump-pushed-for-it/",
    "timestamp": "2025-11-25T21:36:56Z"
  },
  {
    "title": "‘Rush Hour 4’ revived after Trump urged Paramount Skydance to resurrect franchise, reports say",
    "description": "Studios initially declined a fourth movie over concerns around director Brett Ratner, whose career crashed after sexual misconduct allegations he denies.",
    "link": "https://www.cnbc.com/2025/11/25/trump-pushed-paramount-revive-rush-hour-4-reports-say.html",
    "timestamp": "2025-11-25T21:36:55Z"
  },
  {
    "title": "Trump Strong-Armed Paramount Into Reviving ‘Rush Hour’ — And It Worked: REPORT",
    "description": "Donald Trump reportedly wanted Paramount to take on distribution of the upcoming “Rush Hour” sequel, and sources said the deal is all but finalized",
    "link": "https://dailycaller.com/2025/11/25/trump-paramount-rush-hour-4-chris-tucker-jackie-chan-hollywood-culture/",
    "timestamp": "2025-11-25T21:34:31Z"
  },
  {
    "title": "Here’s Macaulay Culkin’s idea for a ‘Home Alone’ sequel",
    "description": "The star is revisiting the film in honor of its 35th anniversary.",
    "link": "https://nypost.com/2025/11/25/entertainment/heres-macaulay-culkins-idea-for-a-home-alone-sequel/",
    "timestamp": "2025-11-25T21:33:55Z"
  },
  {
    "title": "‘I felt a loss for us as a nation’: Michelle Obama stunned by Trump's East Wing demolition",
    "description": "Former First lady Michelle Obama had a serious reaction to President Donald Trump's decision to tear down the century-old East Wing of the White House for a ballroom, saying it symbolized “a loss for us as a nation.”In an interview Tuesday with Jamie Kern Lim…",
    "link": "https://www.rawstory.com/michelle-obama-2674342154/",
    "timestamp": "2025-11-25T21:33:17Z"
  },
  {
    "title": "Rand Paul Warns Trump: These Two Moves Would ‘Dissolve’ His MAGA ‘Movement’",
    "description": "Sen. Rand Paul (R-KY) warned President Donald Trump that his MAGA \"movement\" will be \"dissolved\" if he gives more money to Ukraine or invades Venezuela.\nThe post Rand Paul Warns Trump: These Two Moves Would ‘Dissolve’ His MAGA ‘Movement’ first appeared on Med…",
    "link": "https://www.mediaite.com/media/podcasts/rand-paul-warns-trump-these-two-moves-would-dissolve-his-maga-movement/",
    "timestamp": "2025-11-25T21:32:36Z"
  },
  {
    "title": "Cristiano Ronaldo avoids 2026 World Cup suspension in new FIFA ruling",
    "description": "Cristiano Ronaldo was at risk of missing Portugal's opening match of the 2026 World Cup due to a recent red card before FIFA's decision.",
    "link": "https://www.usatoday.com/story/sports/soccer/worldcup/2025/11/25/cristiano-ronaldo-world-cup-ban-red-card-fifa-ruling/87470411007/",
    "timestamp": "2025-11-25T21:31:21Z"
  },
  {
    "title": "Trump says he's sending his envoys to see Putin and Ukrainians after fine-tuning plan",
    "description": "President Donald Trump said Tuesday his plan to end the war in Ukraine was \"fine-tuned\" and he's sending his representatives to meet Russian and Ukrainian officials.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_c5865e58-c7e2-596b-ae16-dfc909217846.html",
    "timestamp": "2025-11-25T21:30:00Z"
  },
  {
    "title": "Japan fires back at 'unsubstantiated' Chinese letter to U.N.",
    "description": "Japan has dismissed a Chinese letter to the United Nations accusing Tokyo of threatening armed intervention over Taiwan as &quot;inconsistent with the facts and unsubstantiated&quot;. Japan's U.N. ambassador, Kazuyuki Yamazaki, was responding to a letter Chin…",
    "link": "https://japantoday.com/category/politics/Japan-dismisses-unsubstantiated-Chinese-letter-to-UN",
    "timestamp": "2025-11-25T21:29:37Z"
  },
  {
    "title": "Democratic congressman’s lawsuit claims Trump housing official abused post to target Trump critics",
    "description": "U.S. Rep. Eric Swalwell sued Federal Housing Finance Agency Director Bill Pulte.",
    "link": "https://www.bostonherald.com/2025/11/25/justice-department-mortgage-fraud-lawsuit/",
    "timestamp": "2025-11-25T21:29:22Z"
  },
  {
    "title": "Best Buy ups sales outlook heading into holiday shopping ramp-up",
    "description": "Best Buy raised its profit and sales expectations ahead of the holiday shopping ramp-up on Black Friday after a strong third quarter. Comparable-store sales at the nation's largest consumer electronics chain rose 2.7%, fueled by computing, gaming and mobile p…",
    "link": "https://japantoday.com/category/business/best-buy-ups-sales-outlook-heading-into-holiday-shopping-ramp-up",
    "timestamp": "2025-11-25T21:27:56Z"
  },
  {
    "title": "U.S. retail sales lose steam, consumer confidence falls as costs bite",
    "description": "U.S. retail sales lost momentum in September and firms grappled with an uptick in business costs, government data showed Tuesday, underscoring growing concerns about affordability in the world's biggest economy. Beyond these delayed economic figures -- indica…",
    "link": "https://japantoday.com/category/business/us-retail-sales-miss-expectations-as-consumers-see-higher-costs",
    "timestamp": "2025-11-25T21:27:44Z"
  },
  {
    "title": "Trump EPA moves to abandon rule that sets soot pollution standards",
    "description": "The Trump administration is seeking to abandon a rule that sets tough standards for deadly soot pollution, arguing that the Biden administration did not have the authority to set the tighter standard.",
    "link": "https://www.wmur.com/article/trump-epa-soot-pollution-standard/69546664",
    "timestamp": "2025-11-25T21:26:50Z"
  },
  {
    "title": "Trump Push Gets ‘Rush Hour 4’ Greenlit by Close Ally At Paramount, Report Says",
    "description": "Due to an unexpected push from President Donald Trump to make it happen, Paramount has reportedly greenlit the production of a new Rush Hour movie.\nThe post Trump Push Gets ‘Rush Hour 4’ Greenlit by Close Ally At Paramount, Report Says first appeared on Media…",
    "link": "https://www.mediaite.com/media/entertainment/trump-push-gets-rush-hour-4-greenlit-by-close-ally-at-paramount-report-says/",
    "timestamp": "2025-11-25T21:26:46Z"
  },
  {
    "title": "2026 World Cup draw can separate top-ranked Spain, Argentina, France and England until semifinals",
    "description": "The 2026 World Cup draw next week will reward the four highest-ranked teams — Spain, Argentina, France and England — who will be placed in separate sections of a new tennis-style seeded tournament bracket. FIFA said Tuesday the top four teams in the latest me…",
    "link": "https://japantoday.com/category/sports/2026-world-cup-draw-can-separate-top-ranked-spain-argentina-france-and-england-until-semifinals",
    "timestamp": "2025-11-25T21:26:22Z"
  },
  {
    "title": "Neither of Sudan's warring factions has accepted truce plan, Trump advisor says",
    "description": "The United States has presented Sudan's warring parties with a proposal for a truce but neither side has formally accepted it, U.S. envoy Massad Boulos said on Tuesday, as the army accused its rivals of staging an attack despite declaring a ceasefire. Boulos …",
    "link": "https://japantoday.com/category/world/neither-of-sudan%27s-warring-factions-has-accepted-truce-plan-trump-advisor-says1",
    "timestamp": "2025-11-25T21:26:10Z"
  },
  {
    "title": "Trump EPA moves to abandon rule that sets soot pollution standards",
    "description": "The Trump administration is seeking to abandon a rule that sets tough standards for deadly soot pollution, arguing that the Biden administration did not have the authority to set the tighter standard.",
    "link": "https://www.wgal.com/article/trump-epa-soot-pollution-standard/69546664",
    "timestamp": "2025-11-25T21:25:58Z"
  },
  {
    "title": "X’s new feature raises questions about the foreign origins of some popular US political accounts",
    "description": "They go by names like @TRUMP_ARMY— or @MAGANationX, and their verified accounts proudly display portraits of President Donald Trump, voter rallies and American flags. And they’re constantly posting about U.S. politics to their followers, sounding like diehard…",
    "link": "https://biztoc.com/x/c7085a04acea184d",
    "timestamp": "2025-11-25T21:25:41Z"
  },
  {
    "title": "Brazil's former President Bolsonaro begins 27-year prison sentence for coup attempt",
    "description": "Former Brazilian President Jair Bolsonaro started on Tuesday to serve his 27-year prison sentence for leading a coup attempt designed to keep him in office after losing the 2022 presidential elections, a move that many in the South American nation doubted wou…",
    "link": "https://japantoday.com/category/world/brazil%27s-former-president-jair-bolsonaro-begins-27-year-prison-sentence-for-coup-attempt",
    "timestamp": "2025-11-25T21:25:40Z"
  }
]