[
  {
    "title": "‘Saturday Night Live’ Opens With “Fake” Donald Trump Defending Qatar’s “Gift” Of A Jumbo Jet — An Hour After The Real POTUS Did The Same",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_94190164-8002-426c-b32d-2d50c55e51f0",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "‘Saturday Night Live’ Opens With Show’s “Fake” Donald Trump Saying So Long For The Season: “The Real One Will Still Be Omnipresent”",
    "description": "Saturday Night Live opened its season finale with the show’s Donald Trump (James Austin Johnson) taking his seat in the audience and saying farewell until the fall. “After tonight, you won’t be seeing me here for a while,” said Johnson’s Trump. “Well, not the…",
    "link": "http://deadline.com/2025/05/saturday-night-live-trump-middle-east-1236402661/",
    "timestamp": "2025-05-18T03:52:34Z"
  },
  {
    "title": "SNL 50 Cold Open: Trump Loves The Middle East, Morgan Wallen Jokes",
    "description": "With NBC's Saturday Night Live wrapping up Season 50 tonight with host Scarlett Johansson (Jurassic World Rebirth) and musical guest Bad Bunny, we were wondering what SNL would be targeting with its final Cold Open until the fall. Donald Trump (James Austin J…",
    "link": "https://bleedingcool.com/tv/snl-50-cold-open-trump-loves-the-middle-east-morgan-wallen-jokes/",
    "timestamp": "2025-05-18T03:51:07Z"
  },
  {
    "title": "Ex-jihadists with Al-Qaida and Lashkar-e-Taiba links join Trump’s Religious Freedom Advisory board",
    "description": "Two former US jihadists, one trained at Lashkar-e-Taiba’s terror camp in Pakistan, have been appointed to the White House Advisory Board of Lay Leaders under Donald Trump. Ismail Royer, convicted for supporting terror activities including attacks in Kashmir, …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ex-jihadists-with-al-qaida-and-lashkar-e-taiba-links-join-trumps-religious-freedom-advisory-board/articleshow/121244523.cms",
    "timestamp": "2025-05-18T03:46:38Z"
  },
  {
    "title": "Orban: EU Should Follow US on Ukraine",
    "description": "The Hungarian Prime Minister, Viktor Orban, has stated that there is no point in Europe going down different paths with the US.",
    "link": "https://sputnikglobe.com/20250518/orban-eu-should-follow-us-on-ukraine-1122074598.html",
    "timestamp": "2025-05-18T03:43:00Z"
  },
  {
    "title": "Pinkerton: Leo XIV and the Search for a New Social Contract in the Age of AI",
    "description": "Artificial Intelligence could enrich and enslave us—perhaps one or the other, perhaps both at the same time.  So, even non-Catholics should appreciate that Pope Leo XIV is summoning his Church to build a fortress for the free will of faith—the right of each s…",
    "link": "https://www.breitbart.com/faith/2025/05/17/pinkerton-leo-xiv-and-the-search-for-a-new-social-contract-in-the-age-of-ai/",
    "timestamp": "2025-05-18T03:40:21Z"
  },
  {
    "title": "Chinese companies eye Singapore listings to expand markets amid trade war",
    "description": "At least five Chinese and HK firms eye listings on SGX. Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/companies-markets/some-chinese-companies-eye-singapore-listings-to-expand-markets-amid-trade-war",
    "timestamp": "2025-05-18T03:39:14Z"
  },
  {
    "title": "Trump Says Walmart Should 'Eat the Tariffs' Instead of Raising Prices",
    "description": "Walmart said last week it might have to raise prices because of Trump's tariffs.\n- Trump was not happy about it.\n- The president said Walmart made \"billions of dollars\" in 2024 and should \"eat the tariffs.\"\nPresident Donald Trump said on Saturday that Walmart…",
    "link": "https://biztoc.com/x/3e5e16675001a319",
    "timestamp": "2025-05-18T03:33:22Z"
  },
  {
    "title": "Sen. Markwayne Mullin: Plane from Qatar 'Has Been in Negotiations' Under Biden AdminIstration",
    "description": "Sen. Markwayne Mullin (R-OK) pointed out that talks regarding Qatar giving the United States a plane to temporarily replace Air Force One began under the Biden administration.\nThe post Sen. Markwayne Mullin: Plane from Qatar ‘Has Been in Negotiations’ Under B…",
    "link": "https://www.breitbart.com/politics/2025/05/17/sen-markwayne-mullin-plane-from-qatar-has-been-in-negotiations-under-biden-administration/",
    "timestamp": "2025-05-18T03:32:14Z"
  },
  {
    "title": "Trump Wants to Meet With Putin as Soon as Feasible - Rubio",
    "description": "US President Donald Trump wants to hold a meeting with Russian President Vladimir Putin as soon as feasible, US Secretary of State Marco Rubio said on Saturday.",
    "link": "https://sputnikglobe.com/20250518/trump-wants-to-meet-with-putin-as-soon-as-feasible---rubio-1122074484.html",
    "timestamp": "2025-05-18T03:21:00Z"
  },
  {
    "title": "Firefighter named among the dead after responding to tornado in southeastern Kentucky",
    "description": "The Laurel County Fire Department in Kentucky says that one of their firefighters is among the dead after responding to a call related to a tornado that tore through the southeastern part of the state Friday night.",
    "link": "https://www.wlwt.com/article/kentucky-firefighter-named-among-the-dead-after-tornado/64802646",
    "timestamp": "2025-05-18T03:18:07Z"
  },
  {
    "title": "Trump plans talks with Putin, Zelensky to push for Ukraine ceasefire",
    "description": "WASHINGTON DC: US President Donald Trump announced he plans to speak with Russian President Vladimir Putin by phone on Monday in an effort to help end the conflict in Ukraine, referring to the discussion as an attempt to stop the “bloodbath.” In a message pos…",
    "link": "https://english.khabarhub.com/2025/18/468009/",
    "timestamp": "2025-05-18T03:15:14Z"
  },
  {
    "title": "Bruce Springsteen Calls Out 'Unfit President' Trump Again on Stage",
    "description": "Bruce Springsteen resumed denouncing Donald Trump on stage Saturday night (May 17) in Manchester, England, after Trump called him \"dumb as a rock.\"",
    "link": "http://www.billboard.com/music/music-news/bruce-springsteen-trump-unfit-president-stage-speech-1235974885/",
    "timestamp": "2025-05-18T03:12:08Z"
  },
  {
    "title": "Romania votes in second round of presidential election",
    "description": "Polls have opened for the second round of Romania's presidential election - with little separating centrist candidate Nicusor Dan from the populist George Simion.",
    "link": "https://news.sky.com/story/romania-votes-in-second-round-of-presidential-election-with-bucharest-mayor-and-hard-right-trump-supporter-almost-tied-in-polls-13370049",
    "timestamp": "2025-05-18T03:00:00Z"
  },
  {
    "title": "Transactional diplomacy: Israel must defends its interests, not rely on Trump's whims",
    "description": "Israel must recognize that there may be moments when it will need to act to protect its core interests, even in the face of American objections.",
    "link": "https://www.jpost.com/opinion/article-854337",
    "timestamp": "2025-05-18T02:58:45Z"
  },
  {
    "title": "'I give these SleazeBags fair warning!' Trump unloads over 'free' plane coverage",
    "description": "Donald Trump on Saturday lobbed an apparent threat of litigation at ABC.Taking to his own social media site, Truth Social, the president asked, \"Why doesn’t Chairman Bob Iger do something about ABC Fake News, especially since I just won $16,000,000 based on t…",
    "link": "https://www.rawstory.com/trump-qatar-abc-coverage-law/",
    "timestamp": "2025-05-18T02:49:23Z"
  },
  {
    "title": "Libya won't want to host a million Gazans – so the humanitarian crisis will steer the course of the war",
    "description": "Trump reportedly wants to move Gazans to the North African state in exchange for billions of dollars – an improbable move, as Libya has been embroiled in a bloody civil war for over a decade. That leaves Israel with the dangerous burden of handling administra…",
    "link": "https://www.haaretz.com/israel-news/2025-05-18/ty-article/.premium/libya-wont-host-gazans-refugees-the-humanitarian-disaster-will-shape-the-war/00000196-e059-d6c4-a9d7-ead982eb0000",
    "timestamp": "2025-05-18T02:44:13Z"
  },
  {
    "title": "Netanyahu is driving Gideon's Chariots to Gaza, but Trump might still put a spoke in the wheels",
    "description": "Military pressure helped bring Hamas back to the negotiating table, but it didn't guarantee progress in the cease-fire talks. The IDF preparations in Gaza, meanwhile, are for a more minor operation than the army promised",
    "link": "https://www.haaretz.com/israel-news/2025-05-18/ty-article/.premium/netanyahu-drives-gideons-chariots-into-gaza-trump-could-still-put-a-spoke-in-the-wheels/00000196-dfd5-d6c4-a9d7-ffddae2f0000",
    "timestamp": "2025-05-18T02:43:04Z"
  },
  {
    "title": "John Nolte of Breitbart News Breaks Down the Media’s Real Motives in Covering Joe Biden’s Mental Decline (VIDEO)",
    "description": "John Nolte of Breitbart News recently made a video with Alex Marlow, also of Breitbart, where they discussed the Jake Tapper book about Biden’s mental decline and the media coverage of the story.\nThe post John Nolte of Breitbart News Breaks Down the Media’s R…",
    "link": "https://www.thegatewaypundit.com/2025/05/john-nolte-breitbart-news-breaks-down-medias-real/",
    "timestamp": "2025-05-18T02:40:27Z"
  },
  {
    "title": "Rich Rodriguez shows interest joining Nick Saban on Trump's College Sports Commission",
    "description": "May 17—President Donald Trump can be seen at college football games, UFC events, and even NASCAR races. Trump enjoys appearing at sporting events, and recently has entered himself into the college athletics space, attempting to create order in a wild west tha…",
    "link": "https://www.dominionpost.com/2025/05/17/rich-rodriguez-shows-interest-joining-nick-saban-on-trumps-college-sports-commission/",
    "timestamp": "2025-05-18T02:37:00Z"
  },
  {
    "title": "Rich Rodriguez shows interest joining Nick Saban on Trump's College Sports Commission",
    "description": "May 17—President Donald Trump can be seen at college football games, UFC events, and even NASCAR races. Trump enjoys appearing at sporting events, and recently has entered himself into the college athletics space, attempting to create order in a wild west tha…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c509d51e-22ef-4d5b-a58a-e736f90104e9",
    "timestamp": "2025-05-18T02:37:00Z"
  },
  {
    "title": "'You saved my life:' Freed hostage Edan Alexander thanks Trump in emotional phone call",
    "description": "President Donald Trump speaks with Edan Alexander, an American-Israeli soldier freed from Hamas captivity, showing a more human side to the ongoing war against Hamas.",
    "link": "https://www.foxnews.com/politics/you-saved-my-life-freed-hostage-edan-alexander-thanks-president-trump-emotional-phone-call",
    "timestamp": "2025-05-18T02:30:10Z"
  },
  {
    "title": "Supreme Court 'directly communicated' profane response to Stephen Miller: lawyer",
    "description": "Donald Trump's White House Deputy Chief of Staff Stephen Miller got a \"direct\" message from seven of nine Supreme Court justices, a former federal prosecutor said Saturday.\n\nEx-prosecutor Glenn Kirschner over the weekend published a video entitled, \"The Supre…",
    "link": "https://www.rawstory.com/supreme-court-direct-message-miller/",
    "timestamp": "2025-05-18T02:25:27Z"
  },
  {
    "title": "Trump must not leave Israel out of his Middle East deals",
    "description": "May in Israel fear that President Trump is falling in love with a kumbaya fantasy about the Middle East that could end up further isolating and endangering the embattled Jewish state.",
    "link": "https://nypost.com/2025/05/17/opinion/trump-must-not-leave-israel-out-of-his-middle-east-deals/",
    "timestamp": "2025-05-18T02:14:12Z"
  },
  {
    "title": "Trump to Walmart: Make less money",
    "description": "President Donald Trump lashed out at Walmart (WMT) on Saturday, pressuring the retail giant not to raise prices after it warned that his trade war policies would force it to do so.Read more...",
    "link": "https://qz.com/trump-walmart-prices-tariffs-inflation-1851781194",
    "timestamp": "2025-05-18T02:12:00Z"
  },
  {
    "title": "Trump to Walmart: Make less money",
    "description": "President Donald Trump lashed out at Walmart (WMT) on Saturday, pressuring the retail giant not to raise prices after it warned that his trade war policies...",
    "link": "https://finance.yahoo.com/news/trump-walmart-less-money-021200585.html",
    "timestamp": "2025-05-18T02:12:00Z"
  },
  {
    "title": "Walmart’s tariff troubles begin to bite but company posts first profitable quarter in e-commerce",
    "description": "Walmart’s latest earnings report reveals early signs of pressure from rising tariffs even as it celebrates its first profitable quarter in e-commerce. With CFO John David Rainey warning of price hikes and CEO Doug McMillon outlining trade-related challenges, …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/walmarts-tariff-troubles-begin-to-bite-but-company-posts-first-profitable-quarter-in-e-commerce/articleshow/121244200.cms",
    "timestamp": "2025-05-18T02:07:34Z"
  },
  {
    "title": "Poland votes in tight election as Europe watches",
    "description": "Poles vote on Sunday in a tight presidential election that will be decisive for the future of the country’s centrist government as well as for abortion and LGBTQ rights. Pro-EU Warsaw mayor Rafal Trzaskowski is expected to get 30 percent, ahead of nationalist…",
    "link": "https://www.digitaljournal.com/world/poland-votes-in-tight-election-as-europe-watches/article",
    "timestamp": "2025-05-18T02:07:20Z"
  },
  {
    "title": "Poland Votes In Tight Election As Europe Watches",
    "description": "Poles vote on Sunday in a tight presidential election that will be decisive for the future of the country's centrist government as well as for abortion and LGBTQ rights.",
    "link": "https://www.ibtimes.com/poland-votes-tight-election-europe-watches-3773863",
    "timestamp": "2025-05-18T02:06:07Z"
  },
  {
    "title": "Bruce Springsteen Gives Trump the Middle Finger with Another Defiant Concert",
    "description": "Despite a threat from Donald Trump to shut his mouth — or else, Bruce Springsteen stood his ground, unleashing another blistering critique of the president during a concert in Manchester, England.",
    "link": "https://consequence.net/2025/05/springsteen-trump-middle-finger-concert/",
    "timestamp": "2025-05-18T02:04:47Z"
  },
  {
    "title": "Pope Leo Backs Populist Pro-Family Policies to Promote 'Stable Union Between a Man and a Woman'",
    "description": "In an address to members of the Vatican's Diplomatic Corps, Pope Leo XIV stressed the fundamental importance of the union between men and women as the bedrock of civilisation. The Pontiff argued that governments should invest in family formation to foster mor…",
    "link": "https://www.breitbart.com/europe/2025/05/17/pope-leo-backs-populist-pro-family-policies-to-promote-stable-union-between-a-man-and-a-woman/",
    "timestamp": "2025-05-18T02:00:24Z"
  },
  {
    "title": "FBI Deputy Director Dan Bongino: James Comey 'brought shame to the FBI again' with '86 47' post",
    "description": "Dan Bongino, the FBI's deputy director, condemned former FBI Director James Comey's \"86 47\" social media post as the FBI and Secret Service investigate potential threats.",
    "link": "https://www.foxnews.com/politics/fbi-deputy-director-dan-bongino-james-comey-shame-fbi-badge-again-86-47-post",
    "timestamp": "2025-05-18T01:47:17Z"
  },
  {
    "title": "FBI calls deadly California clinic bombing an 'act of terrorism'",
    "description": "A bomb exploded outside a fertility clinic in Palm Springs, California, resulting in one fatality and multiple injuries. The FBI is investigating the incident as an act of terrorism, with evidence suggesting the clinic was deliberately targeted. The explosion…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fbi-calls-deadly-california-clinic-bombing-an-act-of-terrorism/articleshow/121244113.cms",
    "timestamp": "2025-05-18T01:43:57Z"
  },
  {
    "title": "Federal Appeals Court Bats Down Clinton Judge, Lifts Block on Trump’s Executive Order to Strip Federal Workers’ Union Rights",
    "description": "Last month a federal judge blocked President Trump’s executive order to strip federal workers of their ‘collective bargaining’ rights.\nThe post Federal Appeals Court Bats Down Clinton Judge, Lifts Block on Trump’s Executive Order to Strip Federal Workers’ Uni…",
    "link": "https://www.thegatewaypundit.com/2025/05/federal-appeals-court-bats-down-clinton-judge-lifts/",
    "timestamp": "2025-05-18T01:40:39Z"
  },
  {
    "title": "Trump warns Walmart: Don't raise prices due to my tariffs but do eat the costs from those taxes",
    "description": "President Donald Trump has ripped into Walmart, saying on social media that the retail giant should eat the additional costs created by his tariffs",
    "link": "https://www.wftv.com/news/trump-warns-walmart/IOWNVIZOFFF3JBNIGPWELTVW6Q/",
    "timestamp": "2025-05-18T01:34:47Z"
  },
  {
    "title": "Pope Leo stands as a counterpoint to Trump’s polarising leadership",
    "description": "Despite reservations about his US background, Leo’s ties to the Global South and support for the marginalised have won him global acceptance.",
    "link": "https://www.scmp.com/opinion/world-opinion/article/3310259/pope-leo-stands-counterpoint-trumps-polarising-leadership",
    "timestamp": "2025-05-18T01:30:08Z"
  },
  {
    "title": "Shane Ross: Donald Trump wants to be the ultimate peacemaker – and we should indulge his narcissism if it means lives will be saved",
    "description": "Is Donald Trump chasing the Nobel Peace Prize?",
    "link": "https://www.independent.ie/opinion/comment/shane-ross-donald-trump-wants-to-be-the-ultimate-peacemaker-and-we-should-indulge-his-narcissism-if-it-means-lives-will-be-saved/a433133862.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Letters: Catherine Corless never forgot the discarded Tuam babies and was a towering advocate for those children",
    "description": "Madam — Wayne O’Connor’s poignant article highlighting that the gentle excavation of the remains of up to 796 babies in Tuam will commence in a few weeks’ time brings some relief.",
    "link": "https://www.independent.ie/opinion/letters/letters-catherine-corless-never-forgot-the-discarded-tuam-babies-and-was-a-towering-advocate-for-those-children/a1151415227.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Brendan O’Connor: With the camels and sheikhs and ‘YMCA’, Baby Trump’s Big Day Out was a blessed relief",
    "description": "It was like high-end childcare. For the rest of the world, it was like if you were really struggling and someone surprised you by offering to take your toddler off your hands for a few days, to give you a break.",
    "link": "https://www.independent.ie/opinion/comment/brendan-oconnor-with-the-camels-and-sheikhs-and-ymca-baby-trumps-big-day-out-was-a-blessed-relief/a1601820488.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Donald Trump to speak with Putin and Zelensky by phone as Ukraine condemns Russia for killing nine bus passengers",
    "description": "US president Donald Trump says he will speak by phone tomorrow with Russian leader Vladimir Putin about the war in Ukraine.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-to-speak-with-putin-and-zelensky-by-phone-as-ukraine-condemns-russia-for-killing-nine-bus-passengers/a310303911.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "The Sunday Independent’s view: Ten years on, what unites us as the marriage equality referendum did?",
    "description": "This Thursday will mark the 10th anniversary of the marriage equality referendum.",
    "link": "https://www.independent.ie/opinion/editorial/the-sunday-independents-view-ten-years-on-what-unites-us-as-the-marriage-equality-referendum-did/a1223886252.html",
    "timestamp": "2025-05-18T01:30:00Z"
  },
  {
    "title": "Despite the tariff-shaped clouds, the future is still bright for Irish jobs",
    "description": "The precarious position of Ireland’s jobs market became abundantly clear in early April, when Taoiseach Micheál Martin called for calm not even 24 hours ­after Donald Trump announced tariffs on EU goods entering the US.",
    "link": "https://www.independent.ie/business/irelands-best-employers/despite-the-tariff-shaped-clouds-the-future-is-still-bright-for-irish-jobs/a1475604562.html",
    "timestamp": "2025-05-18T01:29:00Z"
  },
  {
    "title": "It's one of the most rowdy US sporting events. Here's what Preakness says about the economy",
    "description": "The Maryland tradition attracts a mix of socioeconomic classes. But this year, the tradition has been thrown into question.",
    "link": "https://www.bbc.com/news/articles/c2lk0zq7kg5o",
    "timestamp": "2025-05-18T01:24:23Z"
  },
  {
    "title": "Bomb At Fertility Clinic In California Kills One",
    "description": "An explosion outside a California fertility clinic killed one person in what the local mayor described as a bomb attack.",
    "link": "https://www.ndtv.com/world-news/bomb-at-fertility-clinic-in-california-kills-one-8442203",
    "timestamp": "2025-05-18T01:22:39Z"
  },
  {
    "title": "Trump’s deals cast China both as foe and prize, blurring signals",
    "description": "Pick through the details of recent U.S. trade negotiations and an outline of Donald Trump’s vision for the global economy starts to come into focus. As do its contradictions.",
    "link": "https://www.japantimes.co.jp/business/2025/05/18/economy/china-trump-trade-strategy-focus/",
    "timestamp": "2025-05-18T01:15:00Z"
  },
  {
    "title": "Isro's PSLV-C61/EOS-09 launch mission fails",
    "description": "ISRO's PSLV-C61 mission, intended to deploy the EOS-09 earth observation satellite, failed after normal performance until the second stage. An observation during the third stage led to the mission's incompletion. This was the third failure for PSLV, despite t…",
    "link": "https://timesofindia.indiatimes.com/science/isros-pslv-c61/eos-09-launch-mission-fails/articleshow/121243904.cms",
    "timestamp": "2025-05-18T01:13:24Z"
  },
  {
    "title": "MAGA 'intimidation' of judges puts their families' safety at 'high risk': expert",
    "description": "President Donald Trump has issued countless executive orders since returning to the White House almost four months ago, and some of them are being blocked — at least temporarily — by judges in the lower federal courts.Trump and many of his appointees, includi…",
    "link": "https://www.rawstory.com/trump-maga-judge-intimidation/",
    "timestamp": "2025-05-18T00:53:16Z"
  },
  {
    "title": "Trump Tells Walmart to ‘Eat the Tariffs’ As Company Warns of ‘Higher Prices’",
    "description": "Donald Trump warned Walmart not to raise prices after the company said it would have to do so “given the magnitude of the tariffs.”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-walmart-eat-tariffs-china-higher-prices-trade-war-1235342061/",
    "timestamp": "2025-05-18T00:52:04Z"
  },
  {
    "title": "Frigate Touted By Trump Is Among Navy’s ‘Least Performing’ Programs",
    "description": "By Tony Capaccio May 13, 2025 (Bloomberg) –A $22 billion frigate project that President Donald Trump once touted as “the most beautiful, they look like yachts” was among the US Navy’s...",
    "link": "https://gcaptain.com/frigate-touted-by-trump-is-among-navys-least-performing-programs/",
    "timestamp": "2025-05-18T00:48:51Z"
  },
  {
    "title": "Bomb at fertility clinic in California kills one",
    "description": "LOS ANGELES (UNITED STATES) - An explosion outside a California fertility clinic Saturday killed one person in what the local mayor described as a bomb attack.",
    "link": "https://www.bangkokpost.com/world/3028255/bomb-at-fertility-clinic-in-california-kills-one",
    "timestamp": "2025-05-18T00:45:00Z"
  },
  {
    "title": "Seven Virginia governors celebrate Brown v. Board of Education; Wilder skips event",
    "description": "Gov. Glenn Youngkin and six other Virginia governors celebrate the 71st anniversary of the Supreme Court's landmark decision barring government-sanctioned school segregation. Former Gov. Doug Wilder boycotted the event, criticizing Youngkin's actions on DEI.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_80b0e2cc-7223-4d16-a7e9-72018fb7c495.html",
    "timestamp": "2025-05-18T00:43:00Z"
  },
  {
    "title": "House Republicans introduce legislation that would bar Comey from federal positions",
    "description": "The resolution comes after Comey shared a post on Instagram that appeared to call for the removal or assassination of President Donald Trump. The Thursday post showed the numbers \"8647\" etched in the sand at a beach via seashells. Lawmakers on the House Repub…",
    "link": "https://freerepublic.com/focus/f-news/4317628/posts",
    "timestamp": "2025-05-18T00:41:23Z"
  },
  {
    "title": "ISRO’s 101st Mission: PSLV-C61 Launches All-Weather EOS-09, Boosts India’s Satellite Surveillance",
    "description": "ISRO marked its 101st mission milestone with the successful launch of PSLV-C61, deploying the EOS-09 earth observation satellite into a sun-synchronous polar orbit. This radar imaging satellite, equipped with Synthetic Aperture Radar (SAR), enhances India's s…",
    "link": "https://timesofindia.indiatimes.com/science/isros-101st-mission-pslv-c61-launches-all-weather-eos-09-boosts-indias-satellite-surveillance/articleshow/121242923.cms",
    "timestamp": "2025-05-18T00:31:03Z"
  },
  {
    "title": "Sebastian Stan’s Marvel Role Was Almost Very Different (Would It Have Been Better?)",
    "description": "Winter Soldier holding Captain America's shield in the MCU.\nThere are countless stories of actors missing out on superhero roles. Sometimes, a big star passes on a part because it’s not right for them, such as Amanda Seyfried turning down the chance to play G…",
    "link": "http://comicbook.com/movies/news/would-sebastian-stan-captain-america-have-been-better/",
    "timestamp": "2025-05-18T00:30:00Z"
  },
  {
    "title": "Four days that took India and Pakistan to the brink",
    "description": "The BBC visits families in Kashmir devastated by the deadliest clashes in years, and speaks to military insiders.",
    "link": "https://www.bbc.com/news/articles/cvgvr4r5d2qo",
    "timestamp": "2025-05-18T00:08:56Z"
  },
  {
    "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
    "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
    "link": "https://www.bbc.com/news/articles/ckg4r54kd8do?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-18T00:00:10Z"
  },
  {
    "title": "Defence deals and palace invites: UK and EU haggle before first summit since Brexit",
    "description": "Defence deals, fishing rights and closer economic ties among the talking points at Downing Street.",
    "link": "https://www.bbc.com/news/articles/ckg4r54kd8do",
    "timestamp": "2025-05-18T00:00:04Z"
  },
  {
    "title": "Democrats and Journalists Still Avoid Biden’s Decline",
    "description": "The first excerpts of the Jake Tapper-Alex Thompson book on denying former President Joe Biden’s obvious mental decline have been posted, and you can already... Read More\nThe post Democrats and Journalists Still Avoid Biden’s Decline appeared first on The Dai…",
    "link": "https://www.dailysignal.com/2025/05/17/democrats-and-journalists-still-avoid-bidens-decline/",
    "timestamp": "2025-05-18T00:00:00Z"
  },
  {
    "title": "Pedro Pascal urges filmmakers to resist Trump",
    "description": "Chilean-American actor Pedro Pascal issued an expletive-laced call for Hollywood to resist political pressure in the United States on Saturday while admitting it is \"scary\" to speak out against President Donald Trump. Asked about Trump's immigration policies,…",
    "link": "https://timesofindia.indiatimes.com/news/pedro-pascal-urges-filmmakers-to-resist-trump-its-very-scary-to-speak-to-issues-like-this/articleshow/121243092.cms",
    "timestamp": "2025-05-17T23:58:36Z"
  },
  {
    "title": "Trump says he will call Putin, then Zelenskyy, on Monday to push for Ukraine ceasefire",
    "description": "KYIV, Ukraine (AP) — U.S. President Donald Trump said he plans to speak by phone Monday with Russian leader Vladimir Putin, followed by Ukrainian President Volodymyr Zelenskyy and leaders of various NATO countries, about ending the war in Ukraine. Trump said …",
    "link": "https://freerepublic.com/focus/f-news/4317619/posts",
    "timestamp": "2025-05-17T23:48:27Z"
  },
  {
    "title": "UK to strike new deal with EU in coming days: PM's office",
    "description": "LONDON - UK Prime Minister Keir Starmer is set to sign a new deal with the EU seeking to reset ties after Brexit, his office said Saturday ahead of landmark talks.",
    "link": "https://www.bangkokpost.com/world/3028260/uk-to-strike-new-deal-with-eu-in-coming-days-pms-office",
    "timestamp": "2025-05-17T23:43:00Z"
  },
  {
    "title": "Canada PM Carney reaffirms support for Ukraine in first meeting with Zelenskiy",
    "description": "TORONTO (Reuters) -Canadian Prime Minister Mark Carney on Saturday reaffirmed the country's support for Ukraine in his first face-to-face meeting with Ukrainian President Volodymyr Zelenskiy since winning the election. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/canada-pm-carney-reaffirms-support-for-ukraine-in-first-meeting-with-zelenskiy",
    "timestamp": "2025-05-17T23:42:00Z"
  },
  {
    "title": "Iran says it will continue nuclear talks with US, shrugging off Trump’s threats",
    "description": "TEHRAN, May 17: Iran’s president said his country will continue talks with the United States over its rapidly advancing nuclear programme but will not withdraw from its rights because of US threats. “We are negotiating, and we will negotiate, we are not after…",
    "link": "https://thehillstimes.in/international/iran-says-it-will-continue-nuclear-talks-with-us-shrugging-off-trumps-threats",
    "timestamp": "2025-05-17T23:40:00Z"
  },
  {
    "title": "Trump says will speak to Putin to end Ukraine 'bloodbath'",
    "description": "Kyiv said Russian negotiators have demanded Ukraine pull its troops out of all Ukrainian regions claimed by Moscow before any ceasefire deal.",
    "link": "https://www.japantimes.co.jp/news/2025/05/18/world/politics/us-russia-trump-putin-call/",
    "timestamp": "2025-05-17T23:39:00Z"
  },
  {
    "title": "As political theatre took centre stage in Turkiye, war went on in Ukraine, Kyiv has few options",
    "description": "KYIV, May 17: Since US-brokered talks began in March, Ukraine’s strategy has been to convince the Trump administration that Vladimir Putin is unreliable, and that Kyiv is serious about peace. Ukrainian President Volodymyr Zelenskyy has few options, analysts a…",
    "link": "https://thehillstimes.in/international/as-political-theatre-took-centre-stage-in-turkiye-war-went-on-in-ukraine-kyiv-has-few-options",
    "timestamp": "2025-05-17T23:35:00Z"
  },
  {
    "title": "Apple iPhone Production In US 'Not Feasible,' Says Tech Bull After Donald Trump Tells Tim Cook To Stay Out Of India",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_7989f34e-2f7a-46fa-88d2-52bec7eecb89",
    "timestamp": "2025-05-17T23:31:49Z"
  },
  {
    "title": "Romanians vote in presidential run-off that could widen EU rifts",
    "description": "BUCHAREST Reuters) -Romanians vote on Sunday in a presidential election run-off that pits a hard-right eurosceptic against a centrist independent, and where the outcome could have implications for both the country's struggling economy and EU unity. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/05/18/romanians-vote-in-presidential-run-off-that-could-widen-eu-rifts",
    "timestamp": "2025-05-17T23:30:00Z"
  },
  {
    "title": "New era beckons for Air Force One after Qatari offer - but what's it like inside?",
    "description": "The famous Boeing 747 which has been part of the fabric of US history for decades could soon be supplied by Qatar.",
    "link": "https://www.bbc.com/news/articles/c5ygvn5g452o",
    "timestamp": "2025-05-17T23:24:46Z"
  },
  {
    "title": "Romanians vote in presidential run-off that could widen EU rifts",
    "description": "BUCHAREST Reuters) -Romanians vote on Sunday in a presidential election run-off that pits a hard-right eurosceptic against a centrist independent, and where ...",
    "link": "https://uk.news.yahoo.com/romanians-vote-presidential-run-off-232113293.html",
    "timestamp": "2025-05-17T23:21:13Z"
  },
  {
    "title": "Just this past weekend Trump reshaped the world",
    "description": "Just this past weekend Trump reshaped the world: Brokered a ceasefire between India and PakistanBrokered and in-person meeting between Ukraine and RussiaAnnounced trade agreement between US and ChinaSigned executive order to slash prices on prescription drugs…",
    "link": "https://freerepublic.com/focus/f-news/4317617/posts",
    "timestamp": "2025-05-17T23:18:13Z"
  },
  {
    "title": "Risks Digest 34.63",
    "description": "Posted by RISKS List Owner on May 17RISKS-LIST: Risks-Forum Digest Saturday 17 May 2025 Volume 34 : Issue 63\n\nACM FORUM ON RISKS TO THE PUBLIC IN COMPUTERS AND RELATED SYSTEMS (comp.risks)\nPeter G. Neumann, founder and still moderator\n\n***** See last item for…",
    "link": "https://seclists.org/risks/2025/q2/3",
    "timestamp": "2025-05-17T23:15:32Z"
  },
  {
    "title": "A GOP congressman says raising taxes on top earners would help push Trump's 'big beautiful bill' forward",
    "description": "Rep. Nick LaLota says raising taxes on top earners would help Trump get the votes he needs to pass his massive tax and immigration package.",
    "link": "https://www.businessinsider.com/trump-lalota-tax-cuts-big-beautiful-bill-salt-2025-5",
    "timestamp": "2025-05-17T23:08:56Z"
  },
  {
    "title": "New Syrian president told lawmakers he wants to move his country away from Iran, China and Russia",
    "description": "Rep. Marlin Stutzman, R-Ind., said he saw \"Make Syria Great Again\" signs around Damascus as Trump's popularity grows inside the war-torn country. One of the few U.S. members of Congress to meet with Syria's new leader, Ahmed al-Sharaa, says the former terrori…",
    "link": "https://freerepublic.com/focus/f-news/4317616/posts",
    "timestamp": "2025-05-17T23:01:02Z"
  },
  {
    "title": "Trump to speak to Russian, Ukrainian leaders on Monday after talks in Turkey",
    "description": "SummaryTrump to speak to Putin, Zelenskiy, wants end to 'bloodbath' Russian conditions go further than US proposal, source says Kremlin says negotiations need to remain private Russia's Lavrov notes 'positive role' of U.S. in talks Moscow says Putin could mee…",
    "link": "https://freerepublic.com/focus/f-news/4317615/posts",
    "timestamp": "2025-05-17T23:00:35Z"
  },
  {
    "title": "Trump warns Walmart not to raise prices due to tariffs",
    "description": "The retailer warned Thursday that everything from bananas to children's car seats could increase in price.",
    "link": "https://godanriver.com/news/nation-world/business/economy/article_6e34edde-3158-5f22-a050-6cbc6d096f80.html",
    "timestamp": "2025-05-17T23:00:06Z"
  },
  {
    "title": "Bomb at fertility clinic in California kills one",
    "description": "LOS ANGELES: An explosion outside a California fertility clinic on Saturday (May 17) killed one person in what the local mayor described as a bomb attack. The blast ripped through downtown Palm Springs, badly damaging the clinic and blowing out the windows an…",
    "link": "https://www.channelnewsasia.com/world/bomb-fertility-clinic-california-kills-one-5137121",
    "timestamp": "2025-05-17T22:58:00Z"
  },
  {
    "title": "Travis Kelce and Taylor Swift 'snub' Mahomes in a big way",
    "description": "The Kansas City Chiefs&apos; Travis Kelce and Patrick Mahomes enjoy a close bond on the NFL field, but even their chemistry can&apos;t survive politics as it&apos;s claimed Kelce a",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/05/18/68290d1022601de0208b45e2.html",
    "timestamp": "2025-05-17T22:54:58Z"
  },
  {
    "title": "US Says No Decision Yet on Whether to Drop Boeing Criminal Case",
    "description": "The US Justice Department told a federal judge in Texas it hasn’t decided whether to enter into an agreement with Boeing Co. that would drop a criminal charge related to two fatal 737 Max crashes, and that federal prosecutors are giving the families of victim…",
    "link": "https://www.livemint.com/companies/news/us-says-no-decision-yet-on-whether-to-drop-boeing-criminal-case-11747522189961.html",
    "timestamp": "2025-05-17T22:49:49Z"
  },
  {
    "title": "Trump calls on Walmart to absorb tariffs rather than raise prices",
    "description": "President Donald Trump on Saturday scolded Walmart for saying that his tariffs would force the retail company to up its prices.",
    "link": "https://biztoc.com/x/48a6f50847d5ddaa",
    "timestamp": "2025-05-17T22:44:00Z"
  },
  {
    "title": "Medvedev issues warning about peace talks",
    "description": "Failed negotiations could lead to more escalation, former Russian President Dmitry Medvedev warns Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/617776-medvedev-peace-talks-warning/",
    "timestamp": "2025-05-17T22:30:44Z"
  },
  {
    "title": "TikTok's Raunchy Love Letter to the National Parks Might Actually Save Them",
    "description": "Viral thirst traps on social media are raising eyebrows... and alarm bells about budget cuts.",
    "link": "https://www.cnet.com/news/social-media/tiktoks-raunchy-love-letter-to-the-national-parks-might-actually-save-them/",
    "timestamp": "2025-05-17T22:30:31Z"
  },
  {
    "title": "Trump Admin Made Public Corruption Easier To Get Away With, Again",
    "description": "Just in time to hinder investigations into Donald Trump’s $400 million “gift” jet from Qatar and Attorney General Pam Bondi’s suspiciously-timed, million-dollar Trump Media stock sale, the FBI is disbanding its public corruption squad and re-assigning its mem…",
    "link": "https://crooksandliars.com/2025/05/trump-admin-made-public-corruption-easier",
    "timestamp": "2025-05-17T22:30:01Z"
  },
  {
    "title": "Trump Tells Walmart to 'Eat' the Cost of His Tariffs",
    "description": "U.S. President Donald Trump verbally thrashed Walmart on Saturday following the retailer's announcement this week that it expects to raise prices on some goods as a result of tariffs imposed by the White House.On his social media platform Truth Social, Trump …",
    "link": "https://www.commondreams.org/news/trump-eat-tariffs-truth-social-walmart",
    "timestamp": "2025-05-17T22:29:38Z"
  },
  {
    "title": "Left-wing extremism reflects psychological disorders, mental health professionals say - NewsBreak",
    "description": "Their images and videos became Exhibit A for the winning 2024 campaign of President Donald Trump and his loyal followers, as Democratic rival Kamala Harris",
    "link": "https://www.newsbreak.com/share/4010278562785-left-wing-extremism-reflects-psychological-disorders-mental-health-professionals-say?s=a2&amp;share_destination_id=NDgwNzI2OTMtMTc0NzUyMDU1Njg1Nw%3D%3D&amp;pd=03Fhu1O9&amp;hl=en_US&amp;send_time=1747520556&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.19.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_local_strategy_25q1_exp-v10%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_blend_exp_25q2-v6%2Cns_foryou_model_exp_25q2_v2-v2%2Cns_foryou_recall_exp_25q2-control",
    "timestamp": "2025-05-17T22:23:19Z"
  },
  {
    "title": "Bill Maher slams Americans for pretending they have ‘core convictions’ and ‘deeply held beliefs’ thanks to politics",
    "description": "Maher argued that Americans don't genuinely believe in anything and 'only care which side is saying something.'",
    "link": "https://nypost.com/2025/05/17/media/bill-maher-slams-americans-for-pretending-they-have-core-convictions-and-deeply-held-beliefs/",
    "timestamp": "2025-05-17T22:21:15Z"
  },
  {
    "title": "Video: Dozens of Neighbors Confront ICE Agents During Arrest Attempt",
    "description": "The arrest of Brazilian national Rosane Ferreira De Oliveira has caused deep upset in Worcester, Massachusetts.",
    "link": "https://www.newsweek.com/video-dozens-neighbors-confront-ice-agents-arrest-attempt-2073681",
    "timestamp": "2025-05-17T22:17:05Z"
  },
  {
    "title": "Former Top Admin Figure Blows Off Concerns About Biden Mental Decline: ‘What Happened, Happened’",
    "description": "The diplomat and former top official with the administration implied that worrying about Biden's mental health is ruining democracy.\nThe post Former Top Admin Figure Blows Off Concerns About Biden Mental Decline: ‘What Happened, Happened’ first appeared on Me…",
    "link": "https://www.mediaite.com/tv/former-top-admin-figure-blows-off-concerns-about-biden-mental-decline-what-happened-happened/",
    "timestamp": "2025-05-17T22:16:02Z"
  },
  {
    "title": "UK To Strike New Deal With EU In Coming Days: PM's Office",
    "description": "UK Prime Minister Keir Starmer is set to sign a new deal with the EU seeking to reset ties after Brexit, his office said Saturday ahead of landmark talks.",
    "link": "https://www.ibtimes.com/uk-strike-new-deal-eu-coming-days-pms-office-3773859",
    "timestamp": "2025-05-17T22:15:25Z"
  },
  {
    "title": "Bomb At Fertility Clinic In California Kills One",
    "description": "An explosion outside a California fertility clinic Saturday killed one person in what the local mayor described as a bomb attack.",
    "link": "https://www.ibtimes.com/bomb-fertility-clinic-california-kills-one-3773856",
    "timestamp": "2025-05-17T22:15:23Z"
  },
  {
    "title": "'Trump lost control': Ex-insider says foreign leader just 'humiliated' president",
    "description": "Donald Trump's team was just \"humiliated\" by a foreign leader, according to a former insider.Author and former Trump associate Lev Parnas on Saturday published an article entitled, \"Putin Humiliates Trump’s Envoy – Witkoff Told Not to Come.\"In the piece, Parn…",
    "link": "https://www.rawstory.com/trump-humiliated-putin-parnas/",
    "timestamp": "2025-05-17T22:15:05Z"
  },
  {
    "title": "Trump says he will speak with Putin and Zelenskiy",
    "description": "Trump to make high-stakes calls amid global tensions on Monday.",
    "link": "https://7news.com.au/news/trump-says-he-will-speak-with-putin-and-zelenskiy-c-18729945",
    "timestamp": "2025-05-17T22:14:19Z"
  },
  {
    "title": "Bomb at fertility clinic in California kills one",
    "description": "An explosion outside a California fertility clinic Saturday killed one person in what the local mayor described as a bomb attack. The blast ripped through downtown Palm Springs, badly damaging the clinic and blowing out the windows and doors of other nearby b…",
    "link": "https://www.digitaljournal.com/world/bomb-at-fertility-clinic-in-california-kills-one/article",
    "timestamp": "2025-05-17T22:12:22Z"
  },
  {
    "title": "UK to strike new deal with EU in coming days: PM’s office",
    "description": "UK Prime Minister Keir Starmer is set to sign a new deal with the EU seeking to reset ties after Brexit, his office said Saturday ahead of landmark talks. Starmer will meet on Monday with EU chiefs for the first post-Brexit EU-UK summit aimed at agreeing step…",
    "link": "https://www.digitaljournal.com/world/uk-to-strike-new-deal-with-eu-in-coming-days-pms-office/article",
    "timestamp": "2025-05-17T22:12:22Z"
  },
  {
    "title": "‘Fight back’: Pedro Pascal urges Cannes to resist US political pressure",
    "description": "Actory calls on filmmakers to 'keep telling the stories, keep expressing yourself and keep fighting to be who you are'.",
    "link": "https://www.aljazeera.com/news/2025/5/17/fight-back-pedro-pascal-urges-cannes-to-resist-trump-policies",
    "timestamp": "2025-05-17T22:05:42Z"
  },
  {
    "title": "Operation Sindoor: Bigger feat than I’ll ever get credit for - Trump on ‘pause’",
    "description": "US President Donald Trump said his talking to India and Pakistan and bringing them back from the brink is a “bigger success” than he’ll ever be given .",
    "link": "https://timesofindia.indiatimes.com/india/operation-sindoor-bigger-feat-than-ill-ever-get-credit-for-trump-on-pause/articleshow/121241812.cms",
    "timestamp": "2025-05-17T22:04:26Z"
  },
  {
    "title": "Distrust and Accountability",
    "description": "CNN’s Kasie Hunt interviewed Senate Minority Leader Chuck Schumer the other day. She confronted him about allegations of a meeting with former President Joe Biden... Read More\nThe post Distrust and Accountability appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/17/distrust-and-accountability/",
    "timestamp": "2025-05-17T22:00:00Z"
  }
]