[
  {
    "title": "Trump administration officially rejects climate change as something that can be addressed via regulation",
    "description": "Remember how he was going to end up way to the left of Hillary? Remember how it was all a big schtick? Remember how people who took what he said literally were being hysterical? I remember. President Trump on Thursday announced he was erasing the scientific f…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/trump-administration-officially-rejects-climate-change-as-something-that-can-be-addressed-via-regulation",
    "timestamp": "2026-02-12T19:10:40Z"
  },
  {
    "title": "Venezuela to Grant More Oil Drilling Blocks to Chevron, Repsol",
    "description": "Venezuela plans to grant more oil-production land to Chevron Corp. and Spain’s Repsol SA as the Trump administration pushes for private companies to rebuild the nation’s energy sector, according to people with knowledge of the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/venezuela-to-grant-more-oil-drilling-blocks-to-chevron-repsol",
    "timestamp": "2026-02-12T19:09:13Z"
  },
  {
    "title": "Meet the American Girl Doll Influencers Protesting ICE",
    "description": "Some may find it surprising, but for those creating the content, it makes perfect sense: \"We've been radicalized since the Nineties!\"",
    "link": "http://www.rollingstone.com/culture/culture-features/american-girl-doll-influencer-ice-1235514789/",
    "timestamp": "2026-02-12T19:08:36Z"
  },
  {
    "title": "‘Unprecedented levels of coordination’: Homan confirms ICE surge in Minnesota winding down",
    "description": "Cites new 'coordination' involving local authorities and 'success' in capturing 'public safety threats'",
    "link": "https://www.wnd.com/2026/02/unprecedented-levels-coordination-homan-confirms-ice-surge-minnesota/",
    "timestamp": "2026-02-12T19:07:45Z"
  },
  {
    "title": "Netflix/WBD Update: Antitrust Division Head Out; Ellison/Trump Meet?",
    "description": "Earlier this week, David Ellison's Paramount Skydance looked to sweeten the pot for Warner Bros. Discovery (WBD) shareholders in Ellison's bid to scuttle the Netflix/WBD deal. Paramount's revised offer now includes a $0.25-per-share \"ticking fee\" paid to WBD …",
    "link": "https://bleedingcool.com/tv/netflix-wbd-update-antitrust-division-head-out-ellison-trump-meet/",
    "timestamp": "2026-02-12T19:07:08Z"
  },
  {
    "title": "Bondi’s Paperwork at Epstein Hearing Suggests Trump’s DOJ Is Spying on Congress",
    "description": "Bondi's notes at a House hearing included the search history of a lawmaker who has been reviewing the Epstein files.",
    "link": "https://truthout.org/articles/bondis-paperwork-at-epstein-hearing-suggests-trumps-doj-is-spying-on-congress/",
    "timestamp": "2026-02-12T19:06:40Z"
  },
  {
    "title": "When Are Federal Immigration Agents Leaving Minnesota?",
    "description": "Border czar Tom Homan announced the end of Operation Metro Surge, saying that an ongoing drawdown of immigration officers in Minnesota will continue next week.",
    "link": "http://nymag.com/intelligencer/article/when-are-federal-immigration-agents-leaving-minnesota.html",
    "timestamp": "2026-02-12T19:04:47Z"
  },
  {
    "title": "Judge Temporarily Blocks Hegseth From Reducing Sen. Mark Kelly’s Rank",
    "description": "It's one of the wildest opinions, in terms of language and punctuation use, I've ever read. Leon loves the exclamation point as much as Elaine Benes in Seinfeld.\nThe post Judge Temporarily Blocks Hegseth From Reducing Sen. Mark Kelly’s Rank first appeared on …",
    "link": "https://legalinsurrection.com/2026/02/judge-temporarily-blocks-hegseth-from-reducing-sen-mark-kellys-rank/",
    "timestamp": "2026-02-12T19:04:33Z"
  },
  {
    "title": "Democrats Block DHS Funding Ahead Of Partial Government Shutdown",
    "description": "“Americans are crystal clear on how they feel about ICE – the status quo cannot continue,” Senate Minority Leader Chuck Schumer (D-N.Y.) said Thursday.",
    "link": "https://www.huffpost.com/entry/democrats-dhs-shutdown-ice_n_698e17f2e4b0967ff007969d",
    "timestamp": "2026-02-12T19:03:35Z"
  },
  {
    "title": "Virginia redistricting and raw political power",
    "description": "Virginia’s proposed new congressional map, which gives Democrats all but one seat in a state that still votes more than 40% Republican, is sparking new debates over the proper use of political power.Conservatives in particular are split over whether Virginia …",
    "link": "https://freerepublic.com/focus/f-news/4366599/posts",
    "timestamp": "2026-02-12T19:02:19Z"
  },
  {
    "title": "Trump just killed the EPA’s ability to fight climate change. It may backfire.",
    "description": "The EPA’s repeal of the “endangerment finding” could threaten automakers and oil companies — if it survives in court.",
    "link": "https://grist.org/politics/trump-epa-endangerment-finding-greenhouse-gases/",
    "timestamp": "2026-02-12T19:01:38Z"
  },
  {
    "title": "US plans to reduce forces in Europe, says Pentagon policy chief",
    "description": "Elbridge Colby tells European Nato members they must step up combat capabilities",
    "link": "https://www.irishtimes.com/world/europe/2026/02/12/us-plans-to-reduce-forces-in-europe-says-pentagon-policy-chief/",
    "timestamp": "2026-02-12T19:01:21Z"
  },
  {
    "title": "Denver developer behind Union Station project identified in Epstein files",
    "description": "Chad McWhinney, who founded the real estate company McWhinney — recently renamed Realberry — 35 years ago, is the subject of a single email exchange between an unknown person and Jeffrey Epstein.…",
    "link": "https://www.denverpost.com/2026/02/12/chad-mcwhinney-epstein-files/",
    "timestamp": "2026-02-12T18:58:21Z"
  },
  {
    "title": "Trump agrees to end deportation surge in Minnesota, White House border czar says (Reuters)",
    "description": "Reuters:\nTrump agrees to end deportation surge in Minnesota, White House border czar says  —  U.S. President Donald Trump's border czar Tom Homan said on Thursday that a significant drawdown of immigration enforcement agents in Minnesota was underway and that…",
    "link": "https://www.memeorandum.com/260212/p71",
    "timestamp": "2026-02-12T18:55:02Z"
  },
  {
    "title": "How Americans view key members of the Trump administration",
    "description": "A 58% majority say they have an unfavorable view of President Donald Trump, and 40% have a favorable view.\nThe post How Americans view key members of the Trump administration appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2026/02/12/how-americans-view-key-members-of-the-trump-administration/",
    "timestamp": "2026-02-12T18:54:12Z"
  },
  {
    "title": "Trump's EPA revokes scientific finding that underpinned US fight against climate change",
    "description": "The Environmental Protection Agency has revoked a key scientific finding that supported U.S. regulations on greenhouse gas emissions.",
    "link": "https://www.news4jax.com/health/2026/02/12/trumps-epa-revokes-scientific-finding-that-underpinned-us-fight-against-climate-change/",
    "timestamp": "2026-02-12T18:53:48Z"
  },
  {
    "title": "Trump Administration Takes Chainsaw to Science-Based Endangerment Finding Endangering Us All",
    "description": "The U.S. Environmental Protection Agency (EPA) today announced its final rule to undo the agency’s 2009 foundational scientific finding that global warming emissions endanger public health and the environment—referred to as the Endangerment Finding. EPA also …",
    "link": "https://www.commondreams.org/newswire/trump-administration-takes-chainsaw-to-science-based-endangerment-finding-endangering-us-all",
    "timestamp": "2026-02-12T18:53:31Z"
  },
  {
    "title": "Judge blocks Defense Sec. Pete Hegseth's attempt to discipline/demote Sen. Mark Kelly over his comments re Trump-ordered boat strikes",
    "description": "BREAKING: Judge blocks Defense Sec. Pete Hegseth's attempt to discipline/demote Sen. Mark Kelly over his comments re Trump-ordered boat strikes. Judge Richard Leon (GWBush) says admin is trying to strip 1st Amendment rights of military retirees. Doc: https://…",
    "link": "https://freerepublic.com/focus/f-bloggers/4366596/posts",
    "timestamp": "2026-02-12T18:52:50Z"
  },
  {
    "title": "EPA revokes scientific finding underpinning climate change fight",
    "description": "EPA revokes scientific finding underpinning climate change fighttwincities.com",
    "link": "https://www.twincities.com/2026/02/12/trump-epa-climate-change/",
    "timestamp": "2026-02-12T18:51:39Z"
  },
  {
    "title": "Ilhan Omar under fire for ‘execute Trump’ tweet",
    "description": "Minnesota Rep. Ilhan Omar has said that Trump would be executed in Somalia for his ties to Jeffrey Epstein Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632383-ilhan-omar-execute-trump/",
    "timestamp": "2026-02-12T18:51:31Z"
  },
  {
    "title": "More Democrats Than Ever Want To Abolish ICE. What’s Their Plan If They Succeed?",
    "description": "More Democrats are demanding Immigration and Customs Enforcement be abolished, but few are articulating what would come next if that goal is achieved.",
    "link": "https://dailycaller.com/2026/02/12/democrats-abolish-ice-plan/",
    "timestamp": "2026-02-12T18:51:18Z"
  },
  {
    "title": "Democrats Seethe At Pam Bondi Over Epstein Spying, Childish Insults",
    "description": "Lawmakers told HuffPost the attorney general should resign and be held in contempt of Congress.",
    "link": "https://www.huffpost.com/entry/pramila-jayapal-bam-bondi-jamie-raskin_n_698e151ee4b0e2bc551261d6",
    "timestamp": "2026-02-12T18:51:12Z"
  },
  {
    "title": "Trump ditches key US climate rule as warming risks surge",
    "description": "The US has revoked what's know as the endangerment finding, an Obama-era scientific finding that's been central to US actions against climate change. Experts say the shift comes at a fragile point for the warming planet.",
    "link": "https://www.dw.com/en/trump-ditches-key-us-climate-rule-as-warming-risks-surge/a-75939736",
    "timestamp": "2026-02-12T18:51:00Z"
  },
  {
    "title": "Trump drops key US climate rule, swaps health for cheap cars",
    "description": "The US has revoked what's known as the endangerment finding, a scientific finding central to US climate actions, to boost cheaper, gas-powered cars. Experts say the shift comes at a fragile point for the warming planet.",
    "link": "https://www.dw.com/en/trump-drops-key-us-climate-rule-swaps-health-for-cheap-cars/a-75939736",
    "timestamp": "2026-02-12T18:51:00Z"
  },
  {
    "title": "Obama-era greenhouse gas rules gone as EPA’s Zeldin signs ‘single largest deregulatory action’ in history",
    "description": "EPA administrator Lee Zeldin eliminates Obama-era greenhouse gas finding in what he calls the \"largest deregulatory action,\" saving $1.3 trillion.",
    "link": "https://www.foxnews.com/politics/obama-era-greenhouse-gas-rules-gone-epas-zeldin-signs-single-largest-deregulatory-action-history",
    "timestamp": "2026-02-12T18:48:10Z"
  },
  {
    "title": "Trump’s EPA revokes scientific finding that underpinned US fight against climate change",
    "description": "Critics argue it undermines efforts to combat climate change and could lead to more pollution.",
    "link": "https://www.bostonherald.com/2026/02/12/trump-epa-climate-change/",
    "timestamp": "2026-02-12T18:47:51Z"
  },
  {
    "title": "Trump revokes EPA finding on greenhouse gas threat in huge blow to climate change regulations",
    "description": "EPA Administrator Lee Zeldin officially revoked the endangerment finding, in a huge blow to U.S. efforts to fight climate change.",
    "link": "https://www.cnbc.com/2026/02/12/trump-epa-endangerment-finding-climate-change-greenhouse-gas.html",
    "timestamp": "2026-02-12T18:47:07Z"
  },
  {
    "title": "EPA reverses longstanding climate change finding, stripping its own ability to regulate emissions",
    "description": "The Environmental Protection Agency is rescinding the legal finding about climate change that it has long relied on to regulate greenhouse gas emissions.",
    "link": "https://www.nbcnews.com/science/climate-change/epa-reverses-endangerment-climate-change-finding-rcna258452",
    "timestamp": "2026-02-12T18:45:14Z"
  },
  {
    "title": "New York City Council advances resolution opposing Stonewall Pride flag removal",
    "description": "The New York City Council has advanced a resolution urging Congress to protect LGBTQ history at Stonewall National Monument after the Trump administration ordered Pride flags to be removed from the site\r\n.",
    "link": "https://www.advocate.com/politics/nyc-council-stonewall-pride-flag",
    "timestamp": "2026-02-12T18:45:00Z"
  },
  {
    "title": "Trump Says Bondi Was 'Fantastic' At Bizarre Hearing, Claims Epstein Scandal 'Backfiring' On Dems",
    "description": "The president gave the under-pressure attorney general his public support after that performance before the House Judiciary Committee.",
    "link": "https://www.huffpost.com/entry/trump-bondi-fantastic-hearing_n_698dfe4ee4b0e2bc55123ad6",
    "timestamp": "2026-02-12T18:44:53Z"
  },
  {
    "title": "Cargill to close Wisconsin beef plant, cut 221 jobs",
    "description": "USA-CARGILL/BEEF (PIX):Cargill to close Wisconsin beef plant, cut 221 jobs",
    "link": "https://www.livemint.com/companies/cargill-to-close-wisconsin-beef-plant-cut-221-jobs-11770921887792.html",
    "timestamp": "2026-02-12T18:44:47Z"
  },
  {
    "title": "Judge temporarily blocks Pentagon from punishing Sen. Kelly for call to resist unlawful orders",
    "description": "U.S. District Judge Richard Leon ruled that Pentagon officials violated Kelly's First Amendment free speech rights and \"threatened the constitutional liberties of millions of military retirees.\"",
    "link": "https://www.pbs.org/newshour/politics/judge-temporarily-blocks-pentagon-from-punishing-sen-kelly-for-call-to-resist-unlawful-orders",
    "timestamp": "2026-02-12T18:44:40Z"
  },
  {
    "title": "The EPA revokes a key legal underpinning in fighting climate change",
    "description": "The Environmental Protection Agency has revoked a key scientific finding that supported U.S. regulations on greenhouse gas emissions. This decision rescinds a 2009 declaration that carbon dioxide and other gases endanger public health. EPA Administrator Lee Z…",
    "link": "https://apnews.com/article/trump-climate-change-epa-clean-air-act-c149d5ea6ec71c862e6c4b578adf92cd",
    "timestamp": "2026-02-12T18:44:01Z"
  },
  {
    "title": "Meidas: Trump Surrenders in AM and Admits Defeat",
    "description": "To be honest, I'm not very confident that ICE is actually ending their invasion of Minneapolis, because these people are liars who lie. Also, why does Tom Homan always sound like he's drunk? MeidasTouch host Ben Meiselas reports on Donald Trump surrendering i…",
    "link": "https://littlegreenfootballs.com/article/55280_Meidas-_Trump_Surrenders_in_AM",
    "timestamp": "2026-02-12T18:42:52Z"
  },
  {
    "title": "Was Ivanka Trump's passport seized? Look out for sensational videos making claim",
    "description": "U.S. marshals seized the passport of U.S. President Donald Trump's daughter Ivanka Trump at her Miami residence shortly after first lady Melania Trump gave closed-door testimony as part of a federal money-laundering case.",
    "link": "https://www.snopes.com//fact-check/ivanka-trump-passport-seized/",
    "timestamp": "2026-02-12T18:41:00Z"
  },
  {
    "title": "Trump repeals EPA’s ability to regulate climate pollution | CNN",
    "description": "The Trump Environmental Protection Agency delivered a significant blow to longstanding US climate policy on Thursday, finalizing rules to revoke a 2009 scientific finding that human-caused climate change endangers human health and safety.",
    "link": "https://www.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
    "timestamp": "2026-02-12T18:40:10Z"
  },
  {
    "title": "Reports: Trump to Host Anti-China Summit with Latin American Leaders",
    "description": "President Donald Trump invited Argentina's Javier Milei and other allied regional heads of state to a summit on March 7 Summit to discuss stopping China's encroachment in the region, Argentine outlets reported on Wednesday.\nThe post Reports: Trump to Host Ant…",
    "link": "https://www.breitbart.com/latin-america/2026/02/12/reports-trump-to-host-anti-china-summit-with-latin-american-leaders/",
    "timestamp": "2026-02-12T18:39:22Z"
  },
  {
    "title": "'Not an Anomaly... A Blueprint': Homan Says Minnesota ICE Surge Ending—But Mass Deportations Aren't",
    "description": "While people across Minnesota and beyond welcomed \"border czar\" Tom Homan's Thursday announcement that \"Operation Metro Surge is ending,\" he also made clear that the administration's deadly immigration operations still threaten other US communities, declaring…",
    "link": "https://www.commondreams.org/news/ice-minnesota",
    "timestamp": "2026-02-12T18:39:18Z"
  },
  {
    "title": "U.S. Olympic Medalist Amber Glenn Rips Critics: 'They Hate to See Two Woke B*tch*s Winning'",
    "description": "U.S. Olympic figure skater Amber Glenn is attacking pro-America supporters who have criticized her woke comments.\nThe post U.S. Olympic Medalist Amber Glenn Rips Critics: ‘They Hate to See Two Woke B*tch*s Winning’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2026/02/12/u-s-olympic-medalist-amber-glenn-rips-critics-they-hate-to-see-two-woke-btchs-winning/",
    "timestamp": "2026-02-12T18:39:06Z"
  },
  {
    "title": "Trump Disavows Oil Executive’s Role in Venezuela Talks",
    "description": "President Donald Trump on Thursday rejected any suggestion that a private U.S. oil executive is shaping Washington’s approach to Venezuela, stepping into a sensitive debate over who gets influence in the future of the world’s largest stranded crude reserves. …",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Trump-Disavows-Oil-Executives-Role-in-Venezuela-Talks.html",
    "timestamp": "2026-02-12T18:38:02Z"
  },
  {
    "title": "State Department Ran Covert Ops To Smuggle Starlink Internet To Iran Protesters",
    "description": "The Trump administration reportedly smuggled thousands of Starlink internet terminals into Iran following the Islamic regime’s deadly crackdown on protestors.",
    "link": "https://dailycaller.com/2026/02/12/state-department-ran-covert-ops-to-smuggle-starlink-internet-to-iran-protesters/",
    "timestamp": "2026-02-12T18:37:09Z"
  },
  {
    "title": "The U.S. Is Launching a Regulatory Assault on Drone Users",
    "description": "New restrictions try to shield ICE from being watched from above.",
    "link": "http://foreignpolicy.com/2026/02/12/united-states-trump-drones-china/",
    "timestamp": "2026-02-12T18:36:31Z"
  },
  {
    "title": "Mexican ships arrive in Cuba with humanitarian cargo amid US oil blockade",
    "description": "President Sheinbaum called for dialogue and pledged to send more supplies as soon as the two ships return to Mexico.",
    "link": "https://www.aljazeera.com/news/2026/2/12/mexican-ships-arrive-in-cuba-with-humanitarian-cargo-amid-us-oil-blockade",
    "timestamp": "2026-02-12T18:34:04Z"
  },
  {
    "title": "Trump Twists Himself Into A Knot Trying To Defend 'Fantastic' Pam Bondi",
    "description": "Donald J. Trump came to the defense of Attorney General Pam Bondi over her widely panned testimony on Wednesday. Bondi's testimony was so bad that even Fox News cut away from live coverage. Trump's defense is weak and littered with his usual lies. Still, Trum…",
    "link": "https://crooksandliars.com/2026/02/trump-twists-himself-knot-trying-defend",
    "timestamp": "2026-02-12T18:33:46Z"
  },
  {
    "title": "Anti-Trump judge demands president fetch 100 illegal alien criminals from overseas jail",
    "description": "Boasberg's order calls for government to 'facilitate' return of violent offenders to U.S.",
    "link": "https://www.wnd.com/2026/02/anti-trump-judge-demands-president-fetch-100-illegal/",
    "timestamp": "2026-02-12T18:33:36Z"
  },
  {
    "title": "Exclusive-Trump plans to announce Gaza funding plan, troops at first Board of Peace meeting, US officials say",
    "description": "By Steve HollandWASHINGTON, Feb 12 (Reuters) - President Donald Trump will announce a multi-billion dollar reconstruction plan for Gaza and detail plans for a U.N.-author… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/exclusive-trump-plans-to-announce-gaza-funding-plan-troops-at-first-board-of-peace-meeting-us-officials-say",
    "timestamp": "2026-02-12T18:33:34Z"
  },
  {
    "title": "Karoline Leavitt Shares a CNN Clip to Pitch the Popularity of Voter ID Laws",
    "description": "Trump makes it clear as day almost everyday that they are no fans of CNN, but Karoline Leavitt took to sharing a clip from the network to back voter ID laws.\nThe post Karoline Leavitt Shares a CNN Clip to Pitch the Popularity of Voter ID Laws first appeared o…",
    "link": "https://www.mediaite.com/media/tv/karoline-leavitt-shares-a-cnn-clip-to-pitch-the-popularity-of-voter-id-laws/",
    "timestamp": "2026-02-12T18:33:19Z"
  },
  {
    "title": "Joe Rogan Thinks People Are Not Allowed To Leave Oxford, England",
    "description": "People are allowed to leave Oxford, England.",
    "link": "https://www.wonkette.com/p/joe-rogan-thinks-people-are-not-allowed",
    "timestamp": "2026-02-12T18:31:21Z"
  },
  {
    "title": "Zelensky Makes His Pitch to Trump",
    "description": "Ukraine’s president calls on his most powerful ally not to squander the chance to make peace. ​​​",
    "link": "https://www.theatlantic.com/national-security/2026/02/zelensky-trump-peace-deal-ukraine-russia/685972/",
    "timestamp": "2026-02-12T18:31:00Z"
  },
  {
    "title": "The shrunken ambition of Ryan Murphy’s “Love Story”",
    "description": "A decade after \"The People v. O. J. Simpson\" comes an empty romance whose existence hangs on the Kennedy name.",
    "link": "https://www.salon.com/2026/02/12/the-shrunken-ambition-of-ryan-murphys-love-story/",
    "timestamp": "2026-02-12T18:30:23Z"
  },
  {
    "title": "Democrats Urge Trump To Force Canada And Mexico Into A Trade War",
    "description": "Washington should force the neighboring countries to turn their backs on Beijing, a group of democratic United States senators has said. They are suggesting that U.S. ruler Donald Trump drag both Canada and Mexico into the ongoing trade war.",
    "link": "https://www.shtfplan.com/economics/democrats-urge-trump-to-force-canada-and-mexico-into-a-trade-war",
    "timestamp": "2026-02-12T18:30:11Z"
  },
  {
    "title": "What independents think of Trump's recent immigration actions, according to a new AP-NORC poll (Associated Press)",
    "description": "Associated Press:\nWhat independents think of Trump's recent immigration actions, according to a new AP-NORC poll  —  About 6 in 10 U.S. adults say President Donald Trump has “gone too far” in sending federal immigration agents into American cities, according …",
    "link": "https://www.memeorandum.com/260212/p67",
    "timestamp": "2026-02-12T18:30:03Z"
  },
  {
    "title": "Repeal of EPA’s Endangerment Finding Will Have Devastating Impact",
    "description": "The U.S. Environmental Protection Agency (EPA) today revoked its long-standing, science-based conclusion that planet-warming greenhouse gases threaten public health and welfare. Known as the “endangerment finding,” the scientific conclusion gave the EPA the a…",
    "link": "https://www.commondreams.org/newswire/repeal-of-epas-endangerment-finding-will-have-devastating-impact",
    "timestamp": "2026-02-12T18:27:27Z"
  },
  {
    "title": "Trump UN aviation ambassador pick faces scrutiny after $426K tax liens missing from ethics filing",
    "description": "Jeffrey Anderson's nomination as aviation ambassador stalls amid ethics questions over unreported IRS liabilities in Senate confirmation process.",
    "link": "https://www.foxnews.com/politics/trump-un-aviation-envoy-pick-faces-scrutiny-after-426k-tax-liens-missing-from-ethics-filing",
    "timestamp": "2026-02-12T18:26:06Z"
  },
  {
    "title": "‘Potential impeachment referrals’: DOJ assembling examples of ‘egregious abuses’ by federal judges",
    "description": "District courts repeatedly have overruled Trump decisions on how to run Executive Branch",
    "link": "https://www.wnd.com/2026/02/potential-impeachment-referrals-doj-assembling-examples-egregious-abuses/",
    "timestamp": "2026-02-12T18:24:30Z"
  },
  {
    "title": "Trump Caves: ICE To End Federal Invasion In Minneapolis",
    "description": "Tom Homan, who serves as border czar under Donald J. Trump, announced that ICE personnel are withdrawing from Minnesota in what he describes as a major reduction of forces. This decision comes after several weeks of turmoil in the state. Despite two American …",
    "link": "https://crooksandliars.com/2026/02/trump-caves-ice-ends-federal-occupation",
    "timestamp": "2026-02-12T18:22:46Z"
  },
  {
    "title": "‘Morning Joe’ Demolishes Pam Bondi’s ‘Repulsive’ Behavior at Epstein Files Hearing: ‘It’s a Cover-Up’ | Video",
    "description": "\"The Epstein class who is running this government is still being protected by Pam Bondi,\" host Joe Scarborough says\nThe post ‘Morning Joe’ Demolishes Pam Bondi’s ‘Repulsive’ Behavior at Epstein Files Hearing: ‘It’s a Cover-Up’ | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/media-platforms/journalism/morning-joe-pam-bondi-epstein-files-hearing-video/",
    "timestamp": "2026-02-12T18:22:31Z"
  },
  {
    "title": "NEW POLL: Trump Approval Crashes To 36 In AP Survey — Getting Clobbered on Deportation Crackdown",
    "description": "President Donald Trump's approval took a hit in the latest Associated Press poll, dropping to 36 percent amid overwhelmingly unpopular deportation operations.\nThe post NEW POLL: Trump Approval Crashes To 36 In AP Survey — Getting Clobbered on Deportation Crac…",
    "link": "https://www.mediaite.com/media/news/new-poll-trump-approval-crashes-to-36-in-ap-survey-getting-clobbered-on-deportation-crackdown/",
    "timestamp": "2026-02-12T18:22:12Z"
  },
  {
    "title": "House votes to end Trump’s Canada tariffs",
    "description": "Six Republicans joined with Democrats to repeal the president’s tariffs",
    "link": "https://theweek.com/politics/house-republicans-trump-canada-tariff-vote",
    "timestamp": "2026-02-12T18:21:29Z"
  },
  {
    "title": "Tim Cook's political tightrope is fraying",
    "description": "FTC Chairman Andrew Ferguson is questioning Apple's article curation on Apple News, citing potential ideological bias in favor of left-wing outlets.",
    "link": "https://www.businessinsider.com/apple-faces-ftc-scrutiny-apple-news-content-curation-2026-2",
    "timestamp": "2026-02-12T18:21:06Z"
  },
  {
    "title": "Senate Democrats weigh skipping Trump State of the Union address (David Sivak/Washington Examiner)",
    "description": "David Sivak / Washington Examiner:\nSenate Democrats weigh skipping Trump State of the Union address  —  EXCLUSIVE — Senate Democrats are grappling with whether to leave their chairs empty later this month when President Donald Trump travels to the Capitol to …",
    "link": "https://www.memeorandum.com/260212/p62",
    "timestamp": "2026-02-12T18:20:00Z"
  },
  {
    "title": "Jeffrey Epstein might not have created /pol/, but he helped carry out its mission",
    "description": "On October 24th, 2011, Jeffrey Epstein was emailing back and forth with Boris Nikolic, a biotech venture capitalist who would later be named as a backup executor of Epstein's will. The two appeared to be discussing a meeting Nikolic had helped arrange between…",
    "link": "https://www.theverge.com/tech/877903/jeffrey-epstein-4chan-pol-moot",
    "timestamp": "2026-02-12T18:19:43Z"
  },
  {
    "title": "Alberta separatists step up efforts to leave Canada after meeting with Trump officials",
    "description": "CALGARY, Feb 12 (Reuters) - Separatists in Alberta are ramping up a petition campaign aimed at triggering an independence vote in the western province that has long compl… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/12/alberta-separatists-step-up-efforts-to-leave-canada-after-meeting-with-trump-officials",
    "timestamp": "2026-02-12T18:16:20Z"
  },
  {
    "title": "RFK Jr. pledged transparency. Here's what public doesn't know anymore",
    "description": "Health information has been delayed, deleted and in some cases stopped all together.",
    "link": "https://www.twincities.com/2026/02/12/kennedy-health-transparency/",
    "timestamp": "2026-02-12T18:15:26Z"
  },
  {
    "title": "Republicans Have Found the Real Victims of Trump’s Effort to Build Mass Immigrant Detention Centers",
    "description": "It is somehow not the people who'll be imprisoned in them.",
    "link": "https://slate.com/news-and-politics/2026/02/ice-deportation-stephen-miller-donald-trump.html",
    "timestamp": "2026-02-12T18:15:14Z"
  },
  {
    "title": "New Poll Shows Trump’s Popularity Cratering With Key Demographic Behind His Reelection",
    "description": "\"These numbers should be nothing but alarming for President Trump and his allies.\"\nThe post New Poll Shows Trump’s Popularity Cratering With Key Demographic Behind His Reelection first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/new-poll-shows-trumps-popularity-cratering-with-key-demographic-behind-his-reelection/",
    "timestamp": "2026-02-12T18:13:34Z"
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations",
    "description": "Marimar Martinez, a teaching assistant and U.S. citizen, was shot five times by a Border Patrol agent in October while in her vehicle. She was charged with a felony after Homeland Security officials accused her of trying to ram agents with her vehicle. But th…",
    "link": "https://www.pbs.org/newshour/politics/lawyers-of-chicago-woman-shot-by-federal-agents-say-documents-show-how-dhs-lies-about-investigations",
    "timestamp": "2026-02-12T18:13:34Z"
  },
  {
    "title": "Deaths in Iran’s crackdown on protests reach at least 7,000, activists say",
    "description": "The U.S.-based Human Rights Activists News Agency offered the latest figures Thursday.",
    "link": "https://www.bostonherald.com/2026/02/12/iran-crackdown-death-toll/",
    "timestamp": "2026-02-12T18:13:22Z"
  },
  {
    "title": "Bondi, Democrats clash over Epstein in hearing",
    "description": "Attorney General Pam Bondi ignored survivors of convicted sex offender Jeffrey Epstein and demanded that Democrats apologize to Trump",
    "link": "https://theweek.com/politics/bondi-testimony-epstein-files",
    "timestamp": "2026-02-12T18:11:41Z"
  },
  {
    "title": "This U.S. Winter Olympian Just Broke A Record That Stood For 90-Plus Years",
    "description": "Rich Ruohonen, a curling alternate for the American men's team, was brought in for the squad's preliminary round game against Switzerland at the Milan Cortina Games.",
    "link": "https://www.huffpost.com/entry/curler-rich-ruohonen-oldest-ever-usa-winter-olympian-2026-milan-cortina-games_n_698dfccfe4b0ba74045b7935",
    "timestamp": "2026-02-12T18:11:05Z"
  },
  {
    "title": "RFK Jr. pledged more transparency. Here’s what the public doesn’t know anymore",
    "description": "Health information has been delayed, deleted and in some cases stopped all together.",
    "link": "https://www.bostonherald.com/2026/02/12/kennedy-health-transparency/",
    "timestamp": "2026-02-12T18:08:23Z"
  },
  {
    "title": "Judge Blocks Pentagon's Effort To Punish Mark Kelly Over Urging Military To Follow The Law",
    "description": "The Trump administration tried to cut the veteran's military rank and pension because the senator told troops to reject orders that violate the Constitution.",
    "link": "https://www.huffpost.com/entry/judge-blocks-pentagon-punish-mark-kelly-military_n_698e136ae4b0967ff007914d",
    "timestamp": "2026-02-12T18:03:48Z"
  },
  {
    "title": "US claims Peru risking sovereignty in megaport dispute with China",
    "description": "The US has warned Peru may lose sovereignty over the Chinese-operated Chancay port after a court ruling Read Full Article at RT.com",
    "link": "https://www.rt.com/business/632379-us-claims-peru-risking-sovereignty-china/",
    "timestamp": "2026-02-12T18:01:13Z"
  },
  {
    "title": "Judge temporarily blocks Pentagon from punishing Sen. Mark Kelly for call to resist unlawful orders",
    "description": "The judge ruled Pentagon officials have violated Kelly’s First Amendment free speech rights.",
    "link": "https://www.bostonherald.com/2026/02/12/pentagon-kelly-punishment-blocked/",
    "timestamp": "2026-02-12T18:01:09Z"
  },
  {
    "title": "Key Senate Democrat wants U.S. crypto bill to move, and SEC chief reveals danger of defeat",
    "description": "Senator Mark Warner, a leading Democratic negotiator on the market structure bill, said he wants it to pass, and SEC chief Paul Atkins said durable policy actually requires it.",
    "link": "https://www.coindesk.com/policy/2026/02/12/key-senate-democrat-wants-u-s-crypto-bill-to-move-and-sec-chief-reveals-danger-of-defeat",
    "timestamp": "2026-02-12T18:00:16Z"
  },
  {
    "title": "Netflix stock (NFLX) down 5%, hits 52-week low - here's what investors need to know",
    "description": "Netflix stock NFLX today: Netflix shares hit a new 52-week low of $79, down 5%, as the streaming giant faces industry-wide pressure and intense competition. Despite a 23.71% annual stock decline, analysis suggests Netflix is undervalued, though a proposed acq…",
    "link": "https://economictimes.indiatimes.com/news/international/us/netflix-stock-nflx-down-5-hits-52-week-low-heres-what-investors-need-to-know/articleshow/128270068.cms",
    "timestamp": "2026-02-12T17:59:10Z"
  },
  {
    "title": "Dems cheer end to Minnesota immigration operation; GOP calls it success",
    "description": "(The Center Square) – Democrats are applauding White House border czar Tom Homan’s Thursday announcement that immigration enforcement operation in Minnesota ...",
    "link": "https://www.thecentersquare.com/minnesota/article_ab00997a-7665-4b0f-a1c2-eb13c7b7acec.html",
    "timestamp": "2026-02-12T17:58:00Z"
  },
  {
    "title": "Netanyahu before returning to Israel: Doubtful about a deal with Iran",
    "description": "Netanyahu calls meeting with President Trump 'excellent,' says any deal with Iran must include ballistic missile threat and proxies.",
    "link": "https://www.israelnationalnews.com/news/422344",
    "timestamp": "2026-02-12T17:57:47Z"
  },
  {
    "title": "Republicans Should ‘Unwrap the Gift of MAHA’ to Win Midterms, Health Advocacy Group Says",
    "description": "Republicans can “win big” in midterm elections if they “unwrap the gift of MAHA” that President Donald Trump has handed them, according to a new... Read More\nThe post Republicans Should ‘Unwrap the Gift of MAHA’ to Win Midterms, Health Advocacy Group Says app…",
    "link": "https://www.dailysignal.com/2026/02/12/republicans-should-unwrap-the-gift-of-maha-to-win-midterms-health-advocacy-group-says/",
    "timestamp": "2026-02-12T17:57:38Z"
  },
  {
    "title": "Mike Johnson Plays Dumb on Pam Bondi Tracking Epstein Searches",
    "description": "House Speaker Mike Johnson pretended Thursday that he knew nothing about Attorney General Pam Bondi’s plot to spy on lawmakers—even though one Democrat had already warned him. A photograph of Bondi’s notes at a House Judiciary Committee hearing Wednesday show…",
    "link": "https://newrepublic.com/post/206527/mike-johnson-pam-bondi-tracking-epstein-searches",
    "timestamp": "2026-02-12T17:57:07Z"
  },
  {
    "title": "The ‘largest immigration enforcement operation ever’ in Minnesota is ending",
    "description": "Border czar Tom Homan said border agents will leave Minneapolis following a controversial two-month operation.",
    "link": "https://fortune.com/2026/02/12/largest-immigration-enforcement-operation-ending-tom-homan-minneapolis-minnesota-ice-leaving/",
    "timestamp": "2026-02-12T17:56:25Z"
  },
  {
    "title": "BBC set to cut costs by about 10% in latest restructuring plan",
    "description": "Director-general Tim Davie tells staff broadcaster aims to trim annual budget by hundreds of millions of pounds",
    "link": "https://www.irishtimes.com/business/2026/02/12/bbc-set-to-cut-costs-by-about-10-in-latest-restructuring-plan/",
    "timestamp": "2026-02-12T17:53:33Z"
  },
  {
    "title": "House GOP pushes strict proof-of-citizenship requirement for voters ahead of midterm elections",
    "description": "The bill passed Wednesday is a Trump administration priority aimed at scrutinizing ballot access. But it faces blowback in the Senate.",
    "link": "https://www.pbs.org/newshour/politics/house-gop-pushes-strict-proof-of-citizenship-requirement-for-voters-ahead-of-midterm-elections",
    "timestamp": "2026-02-12T17:52:55Z"
  },
  {
    "title": "Democratic-led states sue to stop Trump from withholding $600M in health grants",
    "description": "Several of the largest cuts are to HIV programs.",
    "link": "https://www.bostonherald.com/2026/02/12/federal-funding-democratic-states-lawsuit/",
    "timestamp": "2026-02-12T17:52:14Z"
  },
  {
    "title": "Ukraine: if elections are held this spring, who might be the next president?",
    "description": "There are several credible candidates who might emerge to rival the wartime president.",
    "link": "https://theconversation.com/ukraine-if-elections-are-held-this-spring-who-might-be-the-next-president-275702",
    "timestamp": "2026-02-12T17:49:34Z"
  },
  {
    "title": "Republicans Have Moved Into a New, Even Dumber Phase of Bad Bunny Outrage",
    "description": "Right-wing lawmakers have now called for multiple investigations into Bad Bunny's Super Bowl performance, calling the halftime show \"pure smut.\"",
    "link": "http://www.rollingstone.com/music/music-news/republicans-investigations-bad-bunny-super-bowl-1235515336/",
    "timestamp": "2026-02-12T17:49:03Z"
  },
  {
    "title": "‘Will Help You Get to the Airport’: Tim Walz Calls For ICE to Leave His State ‘Immediately’ After Homan Announcement",
    "description": "Minnesote Gov. Tim Walz wants ICE agents to leave the state \"immediately\" after Border Czar Tom Homan announced the end of their surge operation.\nThe post ‘Will Help You Get to the Airport’: Tim Walz Calls For ICE to Leave His State ‘Immediately’ After Homan …",
    "link": "https://www.mediaite.com/media/news/will-help-you-get-to-the-airport-tim-walz-calls-for-ice-to-leave-his-state-immediately-after-homan-announcement/",
    "timestamp": "2026-02-12T17:46:16Z"
  },
  {
    "title": "Antitrust chief fired from Trump's DOJ after months of 'friction': CNN",
    "description": "Attorney General Pam Bondi reportedly fired Gail Slater, the head of the Department of Justice's Antitrust Division.In a Thursday post on X, Slater revealed that she was leaving the role \"with great sadness and abiding hope.\"\"It was indeed the honor of a life…",
    "link": "https://www.rawstory.com/antitrust-chief-gail-slater-fired/",
    "timestamp": "2026-02-12T17:44:56Z"
  },
  {
    "title": "Trump administration moves to revoke EPA finding that greenhouse gases endanger public health",
    "description": "The administration of US President Donald Trump plans to announce the repeal of a scientific finding that greenhouse gas emissions endanger human health, removing the legal basis for federal climate regulations.",
    "link": "https://www.independent.ie/world-news/north-america/trump-administration-moves-to-revoke-epa-finding-that-greenhouse-gases-endanger-public-health/a404215502.html",
    "timestamp": "2026-02-12T17:43:31Z"
  },
  {
    "title": "Judge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video | CNN Politics",
    "description": "A federal judge on Thursday shut down Defense Secretary Pete Hegseth’s attempts to punish Democratic Sen. Mark Kelly over his urging of US service members to refuse illegal orders, ruling that the Pentagon chief’s actions were unconstitutionally retaliatory.",
    "link": "https://www.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
    "timestamp": "2026-02-12T17:42:14Z"
  }
]