[
  {
    "title": "Pam Grier Claims Her Mother Shielded Her From Seeing Lynched Bodies — But The Story Crumbles With Basic Fact-Check",
    "description": "Actress Pam Grier claimed that her mother had to shield her from seeing a lynched body but the last lynching in the state happened decades before she was born.",
    "link": "https://dailycaller.com/2026/01/20/pam-grier-lynchings-ohio-the-view/",
    "timestamp": "2026-01-20T19:35:04Z"
  },
  {
    "title": "'This is sell America' — U.S. dollar, Treasury prices tumble and gold spikes as globe flees U.S. assets (Alex Harring/CNBC)",
    "description": "Alex Harring / CNBC:\n‘This is sell America’ — U.S. dollar, Treasury prices tumble and gold spikes as globe flees U.S. assets … The “sell America” trade is in full swing Tuesday morning after President Donald Trump and European leaders escalated tensions over …",
    "link": "https://www.memeorandum.com/260120/p85",
    "timestamp": "2026-01-20T19:35:00Z"
  },
  {
    "title": "Trump says he won’t attend G7 meeting in Paris",
    "description": "WASHINGTON, Jan 20 (Reuters) - U.S. President Donald Trump said on Tuesday he got along with the leaders of France and the United Kingdom but that he would not attend a G… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/trump-says-he-won-t-attend-g7-meeting-in-paris",
    "timestamp": "2026-01-20T19:32:55Z"
  },
  {
    "title": "Trump's First Year: ICE Arrests 7,000 Gang Members, Including Convicted Killers and Assailants",
    "description": "In Trump's first year of his second term, ICE has arrested some 7,000 illegal alien gang members across the United States.\nThe post Trump’s First Year: ICE Arrests 7,000 Gang Members, Including Convicted Killers and Assailants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/20/trumps-first-year-ice-arrests-7000-gang-members-including-convicted-killers-assailants/",
    "timestamp": "2026-01-20T19:32:30Z"
  },
  {
    "title": "How the U.S. withdrawal from WHO could affect global health powers and disease threats",
    "description": "As the U.S. withdraws from the World Health Organization, it cedes influence over global health programs. A more immediate concern is disruption of disease surveillance and emerging health threats.",
    "link": "https://theconversation.com/how-the-u-s-withdrawal-from-who-could-affect-global-health-powers-and-disease-threats-273768",
    "timestamp": "2026-01-20T19:32:25Z"
  },
  {
    "title": "Roblox User Creates In-Game Version of Jeffrey Epstein's Island",
    "description": "A Roblox user has created an in-game version of Jeffrey Epstein's private island, Little St. James ... and the attention to detail is disturbing.",
    "link": "https://www.tmz.com/2026/01/20/roblox-user-creates-epstein-island/",
    "timestamp": "2026-01-20T19:30:35Z"
  },
  {
    "title": "Is Trump building a secret White House bunker? Reports fuel nuclear-shelter speculation",
    "description": "President Donald Trump is reportedly constructing a secret White House bunker. This underground facility is designed to survive a nuclear attack. The project involves modern technology and replaces an older complex. National security concerns have been cited …",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-trump-building-a-secret-white-house-bunker-reports-fuel-nuclear-shelter-speculation/articleshow/126851563.cms",
    "timestamp": "2026-01-20T19:30:27Z"
  },
  {
    "title": "Trump says tariffs face Supreme Court test, warns US may have to refund billions",
    "description": "President Trump acknowledged potential billions in tariff refunds if the Supreme Court rules against his administration. He also defended his economic record, attacked Biden's immigration policies, and made unsubstantiated claims about financial crimes in Min…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-tariffs-face-supreme-court-test-warns-us-may-have-to-refund-billions/articleshow/126856672.cms",
    "timestamp": "2026-01-20T19:30:27Z"
  },
  {
    "title": "We Want an Independent Fed, Not One With Trump Derangement Syndrome or Foreign Influence",
    "description": "Global central bankers issued a statement last Tuesday defending U.S. Federal Reserve Chair Jerome Powell following the launch of a criminal investigation into the central... Read More\nThe post We Want an Independent Fed, Not One With Trump Derangement Syndro…",
    "link": "https://www.dailysignal.com/2026/01/20/we-want-an-independent-fed-not-one-with-trump-derangement-syndrome-or-foreign-influence/",
    "timestamp": "2026-01-20T19:30:00Z"
  },
  {
    "title": "Mommy He Shot Me Back",
    "description": "Repeating my assertion that if we invade Greenland, our great newspapers will adopt the view that defending their territory is Not Fair.Greenland’s prime minister said the Arctic island’s population and its authorities need to start preparing for a possible m…",
    "link": "https://www.eschatonblog.com/2026/01/mommy-he-shot-me-back_01841727105.html",
    "timestamp": "2026-01-20T19:30:00Z"
  },
  {
    "title": "Ex-Trump chief of staff sends warning shot over political gamble: 'What are we doing?'",
    "description": "President Donald Trump's former chief of staff warned Tuesday that his aggressive push to seize Greenland could cost him support among Americans. Mick Mulvaney, who served during Trump's first term, suggested in an interview with News Nation that the presiden…",
    "link": "https://www.rawstory.com/trump-greenland-affordability/",
    "timestamp": "2026-01-20T19:29:58Z"
  },
  {
    "title": "Green Day Makes An 'American Idiot' Out Of Top Trump Adviser With A Key Lyric Change",
    "description": "The rock band used a Los Angeles concert to send a blunt message about Trump's immigration crackdown.",
    "link": "https://www.huffpost.com/entry/green-day-los-angeles-holiday-lyrics_n_696fbc70e4b0559a85913162",
    "timestamp": "2026-01-20T19:29:55Z"
  },
  {
    "title": "‘Do You Want to Live With These People?’ Trump Opens Up First-Year Celebration Briefing by Profiling ‘Worst’ ICE Apprehensions",
    "description": "President Donald Trump celebrated his first year back in office by showing off pictures of \"violent illegal aliens\" who have been apprehended by ICE\nThe post ‘Do You Want to Live With These People?’ Trump Opens Up First-Year Celebration Briefing by Profiling …",
    "link": "https://www.mediaite.com/politics/do-you-want-to-live-with-these-people-trump-opens-up-first-year-celebration-briefing-by-profiling-worst-ice-apprehensions/",
    "timestamp": "2026-01-20T19:29:28Z"
  },
  {
    "title": "A Majority of Americans View Trump’s First Year as a Failure, Polls Show",
    "description": "Most surveys show Trump's net approval rating in the negatives — and by double digits.",
    "link": "https://truthout.org/articles/a-majority-of-americans-view-trumps-first-year-as-a-failure-polls-show/",
    "timestamp": "2026-01-20T19:29:21Z"
  },
  {
    "title": "Donald Trump ‘Decides What Gets Seen’ At One of America’s Biggest News Networks — Source",
    "description": "Becoming state news? The post Donald Trump ‘Decides What Gets Seen’ At One of America’s Biggest News Networks — Source appeared first on Reality Tea.",
    "link": "https://www.realitytea.com/2026/01/20/donald-trump-decides-cbs-news-control-administration/",
    "timestamp": "2026-01-20T19:28:53Z"
  },
  {
    "title": "Gavin Newsom The KneePad Salesmen Finds A New Audience At Davos",
    "description": "Gavin Newsom, who appears to sell kneepads for donations, found a new audience for his kneepads while speaking to a reporter during the WEF on Tuesday.",
    "link": "https://dailycaller.com/2026/01/20/gavin-newsom-kneepads-davos-world-economic-forum-donald-trump/",
    "timestamp": "2026-01-20T19:28:23Z"
  },
  {
    "title": "Justice Department subpoenas Walz and 5 other Minnesota officials in immigration enforcement obstruction investigation",
    "description": "MINNEAPOLIS (AP) — Federal prosecutors served six grand jury subpoenas Tuesday to Minnesota officials as part of an investigation into whether they obstructed or impeded<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/justice-department-subpoenas-walz…",
    "link": "https://whdh.com/news/justice-department-subpoenas-walz-and-others-in-immigration-enforcement-obstruction-probe/",
    "timestamp": "2026-01-20T19:27:04Z"
  },
  {
    "title": "DOJ Says It May Use KKK Act To Prosecute Don Lemon For Reporting On Church ICE Protest",
    "description": "\"It’s notable that I’ve been cast as the face of a protest I was covering as a journalist,\" the former CNN host said.",
    "link": "https://www.huffpost.com/entry/don-lemon-ice-church-protest-doj-kkk-backlash_n_696fbc51e4b06c2b97368a7e",
    "timestamp": "2026-01-20T19:27:03Z"
  },
  {
    "title": "‘I’ve Changed My Mind’ — Rand Paul Does Major About Face On Big Tech",
    "description": "Rand Paul pivoted his stance on Google and YouTube on Monday, writing \"YouTube and its parent company Google deserves to be sued,\" in an op-ed for the NY Post.",
    "link": "https://dailycaller.com/2026/01/20/rand-paul-pivot-big-tech-google-sued-new-york-post/",
    "timestamp": "2026-01-20T19:26:41Z"
  },
  {
    "title": "Bresnahan touts rural health funding at roundtable with Trump",
    "description": "U.S. Rep. Rob Bresnahan touted the impact the Rural Health Transformation Fund will have in his district during a discussion last week with President Donald Trump on rural health care.",
    "link": "https://www.thetimes-tribune.com/2026/01/20/bresnahan-touts-rural-health-funding-at-roundtable-with-trump/",
    "timestamp": "2026-01-20T19:25:58Z"
  },
  {
    "title": "Noem digs at agitators, sanctuary politicians in touting ICE mission continues 1 year into Trump's second term",
    "description": "ICE continues arresting criminal illegal immigrants nationwide despite what DHS Secretary Kristi Noem deems obstruction by agitators in sanctuary cities.",
    "link": "https://www.foxnews.com/politics/noem-digs-agitators-sanctuary-politicans-touting-ice-mission-continues-1-year-trumps-second-term",
    "timestamp": "2026-01-20T19:25:05Z"
  },
  {
    "title": "Trump slams UK deal to hand over Chagos Islands after he previously supported it",
    "description": "Trump said that relinquishing the remote Indian Ocean archipelago was an act of stupidity that shows why he needs to take over Greenland.",
    "link": "https://www.pbs.org/newshour/world/trump-slams-uk-deal-to-hand-over-chagos-islands-after-he-previously-supported-it",
    "timestamp": "2026-01-20T19:23:56Z"
  },
  {
    "title": "Who Gained the Most During Trump’s First Year? Billionaires and Corporations.",
    "description": "Big banks saw their stocks skyrocket by 29 percent during Trump’s first year. Here’s who else cashed in.",
    "link": "https://truthout.org/articles/who-gained-the-most-during-trumps-first-year-billionaires-and-corporations/",
    "timestamp": "2026-01-20T19:21:06Z"
  },
  {
    "title": "NEH Awards $75.1 M. In Grants to Projects Promoting Classical Arts, Conservative Values",
    "description": "Grand Central Atelier, a small art school in New York that promotes “art untouched by modernism\", is among the grant awardees.",
    "link": "https://www.artnews.com/art-news/news/neh-awards-grants-promote-classical-art-conservative-values-1234770194/",
    "timestamp": "2026-01-20T19:20:38Z"
  },
  {
    "title": "Supreme Court takes up politically charged case with independence of the Federal Reserve at stake",
    "description": "President Donald Trump’s bid to reshape the Federal Reserve board is putting the Supreme Court in a familiar position, weighing an emergency appeal from the president’s lawyers in a politically charged case",
    "link": "https://abcnews.go.com/Business/wireStory/supreme-court-takes-politically-charged-case-independence-federal-129391352",
    "timestamp": "2026-01-20T19:20:24Z"
  },
  {
    "title": "Amazon CEO Says Tariffs Bleeding Into Product Prices",
    "description": "Amazon’s CEO says White House tariffs have begun showing up in the price of some goods. The tech giant and many of its third-party sellers bought products ahead of time to fend off tariff-related price hikes, though most of that inventory has since run out, A…",
    "link": "https://www.pymnts.com/news/retail/2026/amazon-ceo-says-tariffs-bleeding-into-product-prices/",
    "timestamp": "2026-01-20T19:20:07Z"
  },
  {
    "title": "Glowing Trump praise shut down on Fox News by economist: ‘Quit gaslighting!'",
    "description": "Economist Robert Wolf, a former economic adviser to President Barack Obama, shut down a Fox News host and guest Tuesday after their relentless praise of the economy under President Donald Trump, praise that Wolf argued was unsupported by facts.Conservative ec…",
    "link": "https://www.rawstory.com/tariffs-2674913329/",
    "timestamp": "2026-01-20T19:20:05Z"
  },
  {
    "title": "Trump Says ‘I Felt Terribly’ About ICE Killing Renee Good: ‘I Understand Both Sides of It’",
    "description": "\"You know, when the woman was shot, I felt terribly about that. I understand both sides of it,\" Trump said on Wednesday\nThe post Trump Says ‘I Felt Terribly’ About ICE Killing Renee Good: ‘I Understand Both Sides of It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-says-i-felt-terribly-about-ice-killing-renee-good-i-understand-both-sides-of-it/",
    "timestamp": "2026-01-20T19:18:18Z"
  },
  {
    "title": "EU moves closer to using its trade bazooka against the US",
    "description": "Capitals are backing a more forceful response to Donald Trump's tariff threats.",
    "link": "https://www.politico.eu/article/eu-bazooka-trade-us-greenland-france-threat-nato/",
    "timestamp": "2026-01-20T19:16:50Z"
  },
  {
    "title": "Jerome Powell could stay at the Fed even after being removed as chair. Here's what that means",
    "description": "The saga over President Donald Trump's efforts to reshape the Federal Reserve has another twist.",
    "link": "https://www.cnbc.com/2026/01/20/powell-could-stay-at-fed-even-after-being-removed-as-chair.html",
    "timestamp": "2026-01-20T19:12:39Z"
  },
  {
    "title": "Trump Agriculture Sec. Has Demented Plan to Keep Food Costs Down",
    "description": "Agriculture Secretary Brooke Rollins just made her viral “let them eat chicken” moment so much worse.Rollins landed in hot water last week after she claimed that following the Trump administration’s new dietary guidelines wouldn’t force Americans to spend mor…",
    "link": "https://newrepublic.com/post/205449/donald-trump-agriculture-secretary-plan-food-costs",
    "timestamp": "2026-01-20T19:11:45Z"
  },
  {
    "title": "Supreme Court hears arguments over Trump bid to oust Fed governor Cook",
    "description": "President Donald Trump’s bid to reshape the Federal Reserve board is putting the Supreme Court in a familiar position, weighing an emergency appeal from the president’s lawyers in a politically charged case. The court hears arguments Wednesday over Trump’s ef…",
    "link": "https://apnews.com/article/supreme-court-trump-fed-cook-powell-5ec0745169bf2fdb123d0fb16c8d6967",
    "timestamp": "2026-01-20T19:10:07Z"
  },
  {
    "title": "Trump's 'Great Healthcare Plan' Is Neither Great, Healthcare, Nor A Plan. Discuss!",
    "description": "Still in the 'concepts of a plan' phase, we see.",
    "link": "https://www.wonkette.com/p/trumps-great-healthcare-plan-is-neither",
    "timestamp": "2026-01-20T19:09:37Z"
  },
  {
    "title": "Trump Blasts UK’s Plan To Give Away Island Hosting Critical US Military Base",
    "description": "President Donald Trump tore into the UK for moving to transfer sovereignty over the Chagos Islands, home to a key military hub, calling the move “STUPIDITY.”",
    "link": "https://dailycaller.com/2026/01/20/donald-trump-united-kingdom-diego-garcia-mauritius-military-base/",
    "timestamp": "2026-01-20T19:08:49Z"
  },
  {
    "title": "Trump's ‘Board of Peace’ could upend world order, but faces pushback from allies",
    "description": "Russian President Vladimir Putin’s invited, along with Chinese leader Xi Jinping and strongmen from Hungary to Belarus and beyond.",
    "link": "https://www.nbcnews.com/world/gaza/trump-board-peace-world-order-pushback-allies-price-tag-rcna254851",
    "timestamp": "2026-01-20T19:08:36Z"
  },
  {
    "title": "EXCLUSIVE: Watchdog Tries Throwing Anti-ICE Org Into Trump IRS’ Jaws",
    "description": "CASA is demanding federal regulators look into the tax-exempt status of Cooperation Cannon River, a group financially backing anti-ICE agitators in Minneapolis.",
    "link": "https://dailycaller.com/2026/01/20/casa-demands-ccr-tax-status-be-reviewed/",
    "timestamp": "2026-01-20T19:08:28Z"
  },
  {
    "title": "ICE breaks into Minnesota home, drags barely clothed U.S. citizen into snow | Honolulu Star-Advertiser",
    "description": "SAINT PAUL, Minn. >> A Minnesota man told Reuters that he felt fear, shame and desperation after ICE officers broke down his door with guns drawn Sunday, handcuffed him and dragged him into the snow wearing shorts and Crocs.",
    "link": "https://www.staradvertiser.com/2026/01/20/breaking-news/ice-breaks-into-minnesota-home-drags-barely-clothed-u-s-citizen-into-snow/",
    "timestamp": "2026-01-20T19:08:28Z"
  },
  {
    "title": "Supreme Court takes up case on independence of Federal Reserve",
    "description": "Supreme Court takes up case on independence of Federal Reservetwincities.com",
    "link": "https://www.twincities.com/2026/01/20/supreme-court-federal-reserve/",
    "timestamp": "2026-01-20T19:07:28Z"
  },
  {
    "title": "Why France's Emmanuel Macron was wearing sunglasses at Davos",
    "description": "French President Emmanuel Macron was seen wearing sunglasses indoors at the World Economic Forum annual meetings in Davos, Switzerland on Tuesday.",
    "link": "https://nationalpost.com/news/world/france-emmanuel-macron-sunglasses-world-economic-forum",
    "timestamp": "2026-01-20T19:05:08Z"
  },
  {
    "title": "Trump's ICE force is sweeping America. Billions in his tax and spending cuts bill are paying for it",
    "description": "One budget expert says the GOP's big bill is \"supercharging ICE\" in ways Americans may not fully realize. There are few restraints on the spending, which lasts through 2029, when Trump's term ends.",
    "link": "https://www.pbs.org/newshour/nation/trumps-ice-force-is-sweeping-america-billions-in-his-tax-and-spending-cuts-bill-are-paying-for-it",
    "timestamp": "2026-01-20T19:04:32Z"
  },
  {
    "title": "Capitalizing on Trump Corruption, Scammers Trick Davos Elites With Phony Pay-for-Access Scheme",
    "description": "Scammers have succeeded in tricking global elites at the 2026 World Economic Forum in Davos, Switzerland into paying top dollar for false promises of access to US President Donald Trump, whose open corruption has astonished experts and watchdog organizations.…",
    "link": "https://www.commondreams.org/news/trump-davos-access-scam",
    "timestamp": "2026-01-20T19:04:11Z"
  },
  {
    "title": "Carney leaves door open to paying $1B to join Trump’s Gaza 'Board of Peace'",
    "description": "Prime Minister wants assurances that funding would go directly to the people of Gaza",
    "link": "https://nationalpost.com/news/carney-leaves-door-open-to-paying-1b-to-join-trumps-gaza-board-of-peace",
    "timestamp": "2026-01-20T19:01:45Z"
  },
  {
    "title": "Supreme Court takes up politically charged case with independence of the Federal Reserve at stake",
    "description": "No president has fired a Fed governor in the agency’s 112-year history.",
    "link": "https://www.bostonherald.com/2026/01/20/supreme-court-federal-reserve/",
    "timestamp": "2026-01-20T19:01:31Z"
  },
  {
    "title": "Stewart Brand – Maintenance: Of Everything, Part One",
    "description": "An in-depth exploration of maintenance, and a powerful argument for its civilizational importance.",
    "link": "https://press.stripe.com/maintenance-part-one",
    "timestamp": "2026-01-20T19:01:30Z"
  },
  {
    "title": "IMF lifts 2026 global growth forecast but flags AI, trade risks",
    "description": "IMF upgraded its 2026 global growth forecast, citing a boost from tech investments but warning that a reevaluation of AI productivity gains or renewed trade tensions could bring disruptions.",
    "link": "https://www.standardmedia.co.ke/business/business/article/2001538952/imf-lifts-2026-global-growth-forecast-but-flags-ai-trade-risks",
    "timestamp": "2026-01-20T19:01:09Z"
  },
  {
    "title": "Biden push to revive Ted Kennedy-era law now haunts Democrats as charges loom in Minnesota church riot",
    "description": "Trump DOJ opens investigation into protesters who allegedly crashed Minneapolis church service, citing potential FACE Act violations against religious freedom.",
    "link": "https://www.foxnews.com/politics/biden-push-revive-ted-kennedy-era-law-now-haunts-democrats-charges-loom-minnesota-church-riot",
    "timestamp": "2026-01-20T19:00:28Z"
  },
  {
    "title": "Why is crypto down today? Tariff jitters, seller dominance explained",
    "description": "The Taker Buy/Sell Ratio showed that the 90-day taker aggression Z-score reached -1.81.",
    "link": "https://ambcrypto.com/why-is-crypto-down-today-tariff-jitters-seller-dominance-explained/",
    "timestamp": "2026-01-20T19:00:25Z"
  },
  {
    "title": "Flashback: Trump 2.0 Inaugurated One Year Ago Today",
    "description": "The highlight of the day came from Elon Musk and Barron Trump.\nThe post Flashback: Trump 2.0 Inaugurated One Year Ago Today first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2026/01/flashback-trump-2-0-inaugurated-one-year-ago-today/",
    "timestamp": "2026-01-20T19:00:18Z"
  },
  {
    "title": "Scientists investigate ‘dark oxygen’ in deep-sea mining zone",
    "description": "Startling findings in 2024 suggested that metallic nodules on the sea floor produce oxygen and might support life. Now researchers are planning an expedition to learn more and refute criticism from mining companies",
    "link": "https://www.newscientist.com/article/2512625-scientists-investigate-dark-oxygen-in-deep-sea-mining-zone/",
    "timestamp": "2026-01-20T19:00:15Z"
  },
  {
    "title": "Country With 20,000-Person Military Suggests It Can Fight America Over Greenland",
    "description": "Danish PM Mette Frederiksen said she can't rule out the use of military force as President Trump continues to insist that Greenland should become U.S. territory.",
    "link": "https://dailycaller.com/2026/01/20/country-with-20000-person-military-suggests-it-can-fight-america-over-greenland/",
    "timestamp": "2026-01-20T18:57:40Z"
  },
  {
    "title": "Trump appears at White House briefing one year since inauguration",
    "description": "President Donald Trump made a rare appearance Tuesday at a White House press briefing on the 1-year anniversary of his second inauguration as president.",
    "link": "https://www.foxnews.com/politics/trump-appears-white-house-briefing-one-year-since-inauguration",
    "timestamp": "2026-01-20T18:55:48Z"
  },
  {
    "title": "US CFTC chair Selig appoints crypto lawyer as senior adviser",
    "description": "Still facing a dearth of leadership at the CFTC, Chair Michael Selig announced the appointment of two senior advisers and plans to “future-proof” the agency's agenda.",
    "link": "https://cointelegraph.com/news/us-cftc-chair-selig-appoints-crypto-lawyer-as-senior-adviser",
    "timestamp": "2026-01-20T18:54:34Z"
  },
  {
    "title": "Netflix switches its Warner Bros offer to all-cash deal to quell Paramount",
    "description": "The switch in its offer comes as Paramount Skydance has campaigned that its bid is superior to Netflix's.",
    "link": "https://www.aljazeera.com/economy/2026/1/20/netflix-switches-its-warner-bros-offer-to-all-cash-deal-to-quell-paramount",
    "timestamp": "2026-01-20T18:52:47Z"
  },
  {
    "title": "U.S. Small Business Administration Releases 2025 Annual Report",
    "description": "Trump SBA Highlights Historic Year of Main Street Growth and Optimism driven by Tax Cuts, Deregulation, Fair Trade and Record Lending Trump SBA Highlights Historic Year of Main Street Growth and Optimism driven by Tax Cuts, Deregulation, Fair Trade and Record…",
    "link": "https://www.globenewswire.com/news-release/2026/01/20/3222205/0/en/U-S-Small-Business-Administration-Releases-2025-Annual-Report.html",
    "timestamp": "2026-01-20T18:52:00Z"
  },
  {
    "title": "“The Gaps Between Rhetoric and Reality”",
    "description": "The Canadian PM, a guy who lives in an apartment above a meth lab, speaks up. It’s worth listening to his remarks in full because he goes beyond what’s captioned and speaks to the baseline hypocrisy that was part of the untenable bargain. Good for him. Carney…",
    "link": "https://balloon-juice.com/2026/01/20/the-gaps-between-rhetoric-and-reality/",
    "timestamp": "2026-01-20T18:51:56Z"
  },
  {
    "title": "Executive orders, pardons and golf: Trump's first year of his second term by the numbers",
    "description": "Tuesday marks the first anniversary of President Donald Trump being sworn into office for a second term.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trumps-first-year-second-term-numbers-executive-orders-pardons-golf-rcna255003",
    "timestamp": "2026-01-20T18:51:06Z"
  },
  {
    "title": "Russia's Lavrov says 'we are watching' as NATO faces crisis over Trump and Greenland",
    "description": "Lavrov said Trump's actions upended the Western concept of the \"rule-based global order\" that Russia has long criticized.",
    "link": "https://www.pbs.org/newshour/world/russias-lavrov-says-we-are-watching-as-nato-faces-crisis-over-trump-and-greenland",
    "timestamp": "2026-01-20T18:51:02Z"
  },
  {
    "title": "Watch Live: Donald Trump Joins Karoline Leavitt for White House Press Briefing",
    "description": "Trump Press Secretary Karoline Leavitt speaks with reporters at the White House of Tuesday, January 20.\nThe post Watch Live: Donald Trump Joins Karoline Leavitt for White House Press Briefing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/20/watch-live-donald-trump-joins-karoline-leavitt-for-white-house-press-briefing/",
    "timestamp": "2026-01-20T18:50:21Z"
  },
  {
    "title": "Carney says old world order 'is not coming back'",
    "description": "Canada's prime minister said powerful countries are using economic weapons to pursue their interests, while affirming support for Greenland and Nato.",
    "link": "https://www.bbc.com/news/articles/cly3d28p4p8o",
    "timestamp": "2026-01-20T18:49:50Z"
  },
  {
    "title": "How can Europe respond to Trump’s Greenland tariffs threat?",
    "description": "The United States's claim to the Danish territory has sparked fears of a trade war.",
    "link": "https://www.aljazeera.com/video/inside-story/2026/1/20/how-can-europe-respond-to-trumps-greenland-tariffs",
    "timestamp": "2026-01-20T18:49:37Z"
  },
  {
    "title": "IIM-Bodh Gaya bid to boost AI education",
    "description": "IIM Bodh Gaya is collaborating with Automation Anywhere to elevate the standards of AI and automation education. This partnership will grant students exclusive access to Automation Anywhere’s learning platform and certification opportunities. Additionally, th…",
    "link": "https://timesofindia.indiatimes.com/city/patna/iim-bodh-gaya-bid-to-boost-ai-education/articleshow/126851312.cms",
    "timestamp": "2026-01-20T18:49:17Z"
  },
  {
    "title": "Because ICE Is Losing In Minnesota, Hegseth Is Prepping For Actual Martial Law",
    "description": "LOL this government thought actual murder would shut Minneapolis down. You absolute idiots. Whatever kills us makes us stronger. And I say that as only a part-time Minnesotan. I’ve split time between there and South Dakota over the past couple of decades. And…",
    "link": "https://www.techdirt.com/2026/01/20/because-ice-is-losing-in-minnesota-hegseth-is-prepping-for-actual-martial-law/",
    "timestamp": "2026-01-20T18:48:46Z"
  },
  {
    "title": "Who is Shanzay Ali Rohail? Meet the granddaughter-in-law of Nawaz Sharif",
    "description": "Junaid Safdar's recent wedding to Shanzay Ali Rohail has captivated Pakistan, making her a trending topic. As granddaughter-in-law to former PM Nawaz Sharif and granddaughter of his associate Rohail Asghar, Shanzay's union links two prominent families. Her el…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-is-shanzay-ali-rohail-meet-the-granddaughter-in-law-of-nawaz-sharif/articleshow/126850173.cms",
    "timestamp": "2026-01-20T18:48:39Z"
  },
  {
    "title": "Trump’s Greenland ambitions push NATO to the edge",
    "description": "The military alliance is facing its worst-ever crisis",
    "link": "https://theweek.com/politics/trump-greenland-nato-crisis",
    "timestamp": "2026-01-20T18:47:23Z"
  },
  {
    "title": "Houselisting in Odisha from April 16 to May 15 before Census",
    "description": "Odisha will conduct house-listing operations for Census 2027 from April 16 to May 15. Citizens can opt for self-enumeration of housing data via a web portal or mobile app between April 1 and April 15. Population enumeration is scheduled for February-March nex…",
    "link": "https://timesofindia.indiatimes.com/city/bhubaneswar/houselisting-in-odisha-from-april-16-to-may-15-before-census/articleshow/126850630.cms",
    "timestamp": "2026-01-20T18:45:40Z"
  },
  {
    "title": "This Is the End — Putinism abroad always morphs into Putinism at home. And we chose this path. (Jonathan V. Last/The Bulwark)",
    "description": "Jonathan V. Last / The Bulwark:\nThis Is the End  —  Putinism abroad always morphs into Putinism at home.  And we chose this path.  Why?  Because something-something the price of eggs.  —  One year ago today Donald Trump was sworn in as president and the Ameri…",
    "link": "https://www.memeorandum.com/260120/p78",
    "timestamp": "2026-01-20T18:45:01Z"
  },
  {
    "title": "US will soon target drugs coming in by land, Trump says",
    "description": "WASHINGTON, Jan 20 (Reuters) - U.S. President Donald Trump on Tuesday said his administration would “very shortly” start targeting drugs coming into the United States by … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/us-will-soon-target-drugs-coming-in-by-land-trump-says",
    "timestamp": "2026-01-20T18:44:56Z"
  },
  {
    "title": "Democracy Watchdog Exposes 'Heartbreaking Catalog of DOGE's Depredations'",
    "description": "Exactly a year after President Donald Trump returned to office and swiftly signed an executive order establishing the Department of Government Efficiency, the Revolving Door Project on Tuesday released a report detailing all the damage that DOGE has done.\"Und…",
    "link": "https://www.commondreams.org/news/department-of-government-efficiency",
    "timestamp": "2026-01-20T18:43:23Z"
  },
  {
    "title": "One Year of Darkness, Cruelty — and Hope",
    "description": "Today marks one year since Donald Trump was sworn in for a second term as President of the United States.Public Citizen co-presidents Robert Weissman and Lisa Gilbert issued the following statement:“In just one year, Donald Trump and his administration passed…",
    "link": "https://www.commondreams.org/newswire/one-year-of-darkness-cruelty-and-hope",
    "timestamp": "2026-01-20T18:43:12Z"
  },
  {
    "title": "Nashville artists praise Trump's no-tax-on-tips policy one year into presidency",
    "description": "Nashville artists and bartenders praised President Donald Trump's elimination of taxes on tips during his first year back in office, according to Rep. Andy Ogles.",
    "link": "https://www.foxnews.com/politics/nashville-artists-praise-trumps-no-tax-on-tips-policy-one-year-presidency",
    "timestamp": "2026-01-20T18:42:54Z"
  },
  {
    "title": "Wedbush analyst Dan Ives calls Greenland tariff threats ‘noise,’ urges buying Apple and other tech stocks on the dip",
    "description": "Wedbush Securities analyst Daniel Ives dismissed the latest U.S.-Europe tariff threats over Greenland as temporary market \"noise\" in a note…\nThe post Wedbush analyst Dan Ives calls Greenland tariff threats ‘noise,’ urges buying Apple and other tech stocks on …",
    "link": "https://macdailynews.com/2026/01/20/wedbush-analyst-dan-ives-calls-greenland-tariff-threats-noise-urges-buying-apple-and-other-tech-stocks-on-the-dip/",
    "timestamp": "2026-01-20T18:42:52Z"
  },
  {
    "title": "Eurodiputada compara al jefe de la OTAN con el \"empleado del mes de McDonald’s\"",
    "description": "\"Mark Rutte no dirige la OTAN\", aseveró Nathalie Loiseau.",
    "link": "https://actualidad.rt.com/actualidad/583099-eurodiputada-comparar-jefe-otan-empleado-mcdonalds",
    "timestamp": "2026-01-20T18:41:05Z"
  },
  {
    "title": "Trump's first year in office proves that nothing is ever enough for him",
    "description": "Donald Trump’s\r\n latest attempt to insert himself into world affairs wasn’t a diplomatic initiative or a peace process. It was a lust to take over Greenland\r\n, a sovereign territory, as though it were a distressed hotel property in Saudi Arabia he could slap …",
    "link": "https://www.advocate.com/opinion/trump-nothing-is-enough",
    "timestamp": "2026-01-20T18:40:55Z"
  },
  {
    "title": "Mamdani Calls for Abolishing ICE on The View: ‘Terrorizing People’ and Wrecking Lives",
    "description": "New York City Mayor Zohran Mamdani called for abolishing ICE during an appearance on The View, saying the agency was \"terrorizing people\" across the USA\nThe post Mamdani Calls for Abolishing ICE on The View: ‘Terrorizing People’ and Wrecking Lives first appea…",
    "link": "https://www.mediaite.com/politics/mamdani-calls-for-abolishing-ice-on-the-view-terrorizing-people-and-wrecking-lives/",
    "timestamp": "2026-01-20T18:40:10Z"
  },
  {
    "title": "Trump considers role in Venezuela for Machado",
    "description": "By Trevor Hunnicutt and Bo EricksonWASHINGTON, Jan 20 (Reuters) - President Donald Trump said on Tuesday he was considering involving Venezuelan opposition leader Maria C… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/trump-considers-role-in-venezuela-for-machado",
    "timestamp": "2026-01-20T18:39:08Z"
  },
  {
    "title": "Goa police demotes six ad hoc PIs to PSIs over pending criminal cases",
    "description": "Six Goa Police inspectors have been demoted to sub-inspectors as they were not fully cleared in criminal cases. This action follows a High Court observation against promoting officers with pending criminal proceedings. The promotions were made subject to the …",
    "link": "https://timesofindia.indiatimes.com/city/goa/goa-police-demotes-six-ad-hoc-pis-to-psis-over-pending-criminal-cases/articleshow/126850263.cms",
    "timestamp": "2026-01-20T18:37:53Z"
  },
  {
    "title": "Inside the program teaching US ICE agents to 'defend the Homeland'",
    "description": "For the thousands of \"patriots\" who've applied, a position with ICE is a source of pride. Experts, elected officials and activists say otherwise.",
    "link": "https://www.abc.net.au/news/2026-01-21/ice-us-agent-training-program-to-defend-the-homeland/106231394",
    "timestamp": "2026-01-20T18:36:27Z"
  },
  {
    "title": "John Harbaugh Says Donald Trump Endorsement 'Feels Really Great'",
    "description": "John Harbaugh was officially introduced as the head coach of the New York Giants on Tuesday ... and the 63-year-old admitted it felt \"really great\" to know the leader of the free world is on board with his hiring. Harbaugh was asked about President…\n Permalink",
    "link": "https://www.tmz.com/2026/01/20/john-harbaugh-donald-trump-new-york-giants-coaching-job/",
    "timestamp": "2026-01-20T18:35:00Z"
  },
  {
    "title": "Trump heckles Europe before heading to Davos",
    "description": "President Trump and his aides are openly displaying contempt for European leaders, mocking their efforts to block his Greenland seizure and dismissing their opinions. Trump's administration views Europe as weak and bureaucratic, a sentiment amplified by his d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-heckles-europe-before-heading-to-davos/articleshow/126849519.cms",
    "timestamp": "2026-01-20T18:33:48Z"
  },
  {
    "title": "Transcript: Why Trump Is Losing Ground Even in This Deep-Red State",
    "description": "This is a lightly edited transcript of the January 16 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: I’m Perry Bacon. I’m the host of The New Republic show Right Now. I’m joine…",
    "link": "https://newrepublic.com/article/205413/transcript-trump-even-losing-support-ruby-red-tennessee",
    "timestamp": "2026-01-20T18:33:31Z"
  },
  {
    "title": "Trump Disguises Himself As Muslim Migrant So Europe Will Let Him Invade Greenland",
    "description": "WASHINGTON, D.C. — In a brilliant stroke of genius, President Donald Trump has just disguised himself as a Muslim migrant so that Europe now has to let him invade Greenland.",
    "link": "https://babylonbee.com/news/trump-disguises-himself-as-muslim-migrant-so-europe-will-let-him-invade-greenland",
    "timestamp": "2026-01-20T18:32:41Z"
  },
  {
    "title": "Broglio: US personnel could disobey ‘immoral’ orders against Greenland",
    "description": "Catholic personnel in the US military could in good conscience consider disobeying orders to attack Greenland, according to the bishop responsible for their pastoral care. The Archbishop of the Military Services Timothy Broglio said personnel “could be put in…",
    "link": "https://freerepublic.com/focus/f-news/4363146/posts",
    "timestamp": "2026-01-20T18:31:04Z"
  },
  {
    "title": "In Trump’s First Year He’s Delivering on His Signature Promise",
    "description": "What a difference a year makes. For the first time in half a century, the United States experienced net negative migration, according to a recent report... Read More\nThe post In Trump’s First Year He’s Delivering on His Signature Promise appeared first on The…",
    "link": "https://www.dailysignal.com/2026/01/20/in-trumps-first-year-hes-delivering-on-his-signature-promise/",
    "timestamp": "2026-01-20T18:30:00Z"
  },
  {
    "title": "Trump and Putin envoys say Davos meting on Ukraine was ‘very positive’ and ‘constructive’",
    "description": "By Dmitry ZhdannikovDAVOS, Jan 20 - Envoys for U.S. President Donald Trump and Russian President Vladimir Putin said on Tuesday that their meeting in Davos on a possible … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/20/trump-and-putin-envoys-say-davos-meting-on-ukraine-was-very-positive-and-constructive",
    "timestamp": "2026-01-20T18:29:26Z"
  },
  {
    "title": "Military models Canadian response to hypothetical American invasion",
    "description": "Armed Forces envision insurgency tactics like those used by Afghan mujahedeen, sources say. But officials and experts stress a U.S. operation is unlikely, and the scenarios are conceptual",
    "link": "https://www.theglobeandmail.com/politics/article-military-models-canadian-response-to-hypothetical-american-invasion/",
    "timestamp": "2026-01-20T18:28:38Z"
  },
  {
    "title": "Danish Politician Unleashes Foul-Mouthed Rant at Trump: ‘Mr. President, F*ck Off!’",
    "description": "A Danish member of the European Parliament body-slammed President Donald Trump as the president intensifies his pursuit of acquiring Greenland.\nThe post Danish Politician Unleashes Foul-Mouthed Rant at Trump: ‘Mr. President, F*ck Off!’ first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/danish-politician-unleashes-foul-mouthed-rant-at-trump-mr-president-fck-off/",
    "timestamp": "2026-01-20T18:27:06Z"
  },
  {
    "title": "Giants John Harbaugh reacts to endorsement from President Trump: 'It feels really great'",
    "description": "John Harbaugh has been officially introduced as the Giants new coach. During the press conference, he also reacted to President Trump's endorsement.",
    "link": "https://www.usatoday.com/story/sports/nfl/2026/01/20/john-harbaugh-president-donald-trump-endorsement-giants/88266334007/",
    "timestamp": "2026-01-20T18:25:30Z"
  },
  {
    "title": "Trump says UK's Chagos Islands deal with Mauritius is an act of 'great stupidity'",
    "description": "The US president said the UK's decision to cede the Chagos Islands to Mauritius is among the reasons he wants to take control of Greenland. US President Donald Trump on Tuesday criticised the UK's deal to hand sovereignty of the Chagos Islands to Mauritius, c…",
    "link": "https://freerepublic.com/focus/f-news/4363145/posts",
    "timestamp": "2026-01-20T18:24:54Z"
  },
  {
    "title": "Top US Catholic leaders condemn Washington’s foreign policy",
    "description": "Washington’s partisan and polarizing approach calls the moral foundations of its policy into question, top archbishops have said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631231-us-catholic-condemn-foreign-policy/",
    "timestamp": "2026-01-20T18:24:19Z"
  },
  {
    "title": "Top EU official warns Trump's tariff threat over Greenland pushback is 'a mistake'",
    "description": "EU chief calls President Donald Trump's Greenland tariff threats \"a mistake\" as European leaders warn of downward spiral in transatlantic trade relations.",
    "link": "https://www.foxnews.com/world/top-eu-official-warns-trumps-tariff-threat-over-greenland-pushback-a-mistake",
    "timestamp": "2026-01-20T18:23:56Z"
  },
  {
    "title": "WEF: Is Greenland the wake-up call Europe needed?",
    "description": "Europe faces waning influence amid wars, trade tensions, climate inaction and a US administration quick to hurl insults at its oldest allies. In Davos, leaders discuss how Europe can regain its mojo.",
    "link": "https://www.dw.com/en/wef-is-greenland-the-wake-up-call-europe-needed/a-75584471",
    "timestamp": "2026-01-20T18:23:00Z"
  },
  {
    "title": "WEF in Davos: Is Greenland the wake-up call Europe needed?",
    "description": "Europe faces waning influence amid wars, trade tensions, climate inaction and a US administration quick to hurl insults at its oldest allies. In Davos, leaders discuss how Europe can regain its mojo.",
    "link": "https://www.dw.com/en/wef-davos-trump-european-union-greenland-trade-tariffs-nato/a-75584471",
    "timestamp": "2026-01-20T18:23:00Z"
  },
  {
    "title": "NATO’s Suez moment: The Greenland drama shows the US will no longer be Europe’s guarantor",
    "description": "n 1969, Charles de Gaulle told his friend André Malraux that America’s “desire – and one day it will satisfy it – is to desert Europe. You will see.” It has taken nearly six decades, but de Gaulle’s prophecy now looks uncomfortably close to fulfillment. After…",
    "link": "https://freerepublic.com/focus/f-news/4363144/posts",
    "timestamp": "2026-01-20T18:20:49Z"
  },
  {
    "title": "Russia Cheering On Trump To Destroy NATO",
    "description": "Trump's insane assault on Denmark and Greenland has our NATO allies in an uproar, while there is one nation that gleefully hopes Trump destroys the seventy-seven-year-old treaty by invading the icy island. \nYou guessed it, Russia.\n“The situation is unusual, I…",
    "link": "https://crooksandliars.com/2026/01/russia-cheering-trump-destroy-nato",
    "timestamp": "2026-01-20T18:20:43Z"
  },
  {
    "title": "The View Asks Zohran Mamdani About ‘Bromance’ With Trump: ‘Seemed to Be Madly in Love With You’",
    "description": "New York Mayor Zohran Mamdani on Tuesday was asked by the hosts of The View about his rumored \"bromance\" with President Donald Trump.\nThe post The View Asks Zohran Mamdani About ‘Bromance’ With Trump: ‘Seemed to Be Madly in Love With You’ first appeared on Me…",
    "link": "https://www.mediaite.com/media/tv/the-view-asks-zohran-mamdani-about-bromance-with-trump-seemed-to-be-madly-in-love-with-you/",
    "timestamp": "2026-01-20T18:19:22Z"
  },
  {
    "title": "Minnesota National Guard to wear reflective vests",
    "description": "Minneapolis has seen daily protests since an agent with U.S. immigration and Customs Enforcement shot and killed a woman on Jan. 7.",
    "link": "http://taskandpurpose.com/news/minnesota-national-guard-vests/",
    "timestamp": "2026-01-20T18:17:46Z"
  }
]