[
  {
    "title": "Democrats and Their DEI Albatrosses",
    "description": "Democrats are trapped by the toxic DEI ideology they created—too afraid to reform, too broken to survive without it. Afew Democrat officeholders, activists, and pundits are finally coming to their senses that their brand is toxic to a majority of the American…",
    "link": "https://www.activistpost.com/democrats-and-their-dei-albatrosses/",
    "timestamp": "2025-06-06T16:00:00Z"
  },
  {
    "title": "The Travel Ban Shows That Americans Have Grown Numb",
    "description": "Less than a decade ago, a similar policy sparked an outcry. Today, people seem far more accepting.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/authoritarianism-trump-travel-ban/683052/",
    "timestamp": "2025-06-06T15:59:26Z"
  },
  {
    "title": "Remember America’s Dead on the USS Liberty. Philip Giraldi",
    "description": "It often pays, literally, to be perceived as a perpetual victim, a status that Israel and the Jewish institutional constituency have exploited relentlessly since 1945. It is now 80 years since the Second World War ended and the numbers of …\nThe post Remember …",
    "link": "https://www.globalresearch.ca/remember-america-dead-uss-liberty/5889799",
    "timestamp": "2025-06-06T15:58:42Z"
  },
  {
    "title": "Migrants and ICE officers contend with heat, smog and illness after detoured South Sudan flight",
    "description": "Migrants are now being held in a converted shipping container in Djibouti.",
    "link": "https://www.bostonherald.com/2025/06/06/immigration-deportations-south-sudan-illness/",
    "timestamp": "2025-06-06T15:58:03Z"
  },
  {
    "title": "President Trump 'not particularly' interested in Musk talks",
    "description": "The US president doesn't appear to be in a hurry to mend fences with his former adviser and referred to Musk as \"the man who has lost his mind\" in an interview with ABC News, a day after a very public blowout. Follow DW.",
    "link": "https://www.dw.com/en/president-trump-not-particularly-interested-in-musk-talks/live-72825065",
    "timestamp": "2025-06-06T15:56:00Z"
  },
  {
    "title": "Why Can't Elon Musk and Donald Trump Both Win?",
    "description": "In a petty, public war of words, Trump threatens to cut off federal support to Musk's companies after the billionaire attacked his deficit-busting budget bill.",
    "link": "https://reason.com/2025/06/06/why-cant-elon-musk-and-donald-trump-both-win/",
    "timestamp": "2025-06-06T15:55:42Z"
  },
  {
    "title": "Elon Musk's Father Reacts to Jeffrey Epstein Files Claim About Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk's father has weighed in on his son's high profile feud with President Donald Trump.\nErrol Musk compared yesterday's clash as two \"elephant bulls or alphas having a go at each other,\" during an interv…",
    "link": "https://biztoc.com/x/075bf8d608612b59",
    "timestamp": "2025-06-06T15:55:36Z"
  },
  {
    "title": "AVAX Surges 6% After Musk-Trump Dispute Sell-Off",
    "description": "Crypto markets were shaken on Thursday when U.S. President Donald Trump and Tesla CEO Elon Musk engaged in a heated argument on social media over the U.S. national debt, which cumulated in the world's richest man endorsing Trump's impeachment and claiming the…",
    "link": "https://biztoc.com/x/47fb265c31a7c9d8",
    "timestamp": "2025-06-06T15:55:17Z"
  },
  {
    "title": "Mark Cuban backs Musk’s poll on a new political party as investors react to tech billionaire’s feud with Trump",
    "description": "As the Donald Trump-Elon Musk axis disintegrated spectacularly on Thursday, billionaires and investors were among the many who were transfixed by the public spat. During the melee, Musk posted a poll on X asking if it was time to create a new political party,…",
    "link": "https://biztoc.com/x/0706e41475d2a182",
    "timestamp": "2025-06-06T15:55:15Z"
  },
  {
    "title": "What Tesla investors need to know about Trump and Musk's mind-blowing meltdown",
    "description": "The spectacular falling out between U.S. President Donald Trump and the world’s richest person, Elon Musk, is reverberating across global markets this morning. The tit-for-tat feud, which has taken place via snarky social media posts and Oval Office camera in…",
    "link": "https://biztoc.com/x/ddd15b097b9d60dd",
    "timestamp": "2025-06-06T15:55:06Z"
  },
  {
    "title": "The Fallout Between President Trump and Elon Musk—This Week in Your Words",
    "description": "Newsweek takes a look at reader comments, focusing this week on the fallout between Elon Musk and President Donald Trump.",
    "link": "https://biztoc.com/x/12f2428910b33473",
    "timestamp": "2025-06-06T15:55:04Z"
  },
  {
    "title": "‘Absurd’: Conservatives Slam Musk’s Trump-Epstein Claim",
    "description": "Elon Musk ignited controversy online by suggesting President Donald Trump appears in Jeffrey Epstein’s files, tweeting, “Donald Trump is in the Epstein files... Have a nice day, DJT!” \nThe claim drew swift rebuttals from prominent conservatives. Daily Wire co…",
    "link": "https://biztoc.com/x/7ff321603273338f",
    "timestamp": "2025-06-06T15:54:54Z"
  },
  {
    "title": "Trump Golf Club Calls Piss-Poor Health Inspection a ‘Politically Motivated Attack’",
    "description": "The Trump Bedminster Golf Club claimed their poor rating after a surprise health inspection was a \"politically motivated attack.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-golf-club-health-inspection-1235357736/",
    "timestamp": "2025-06-06T15:54:30Z"
  },
  {
    "title": "In Trump-Musk feud, a once-steady alliance turns into an online spectacle",
    "description": "The world’s most powerful man and its wealthiest began attacking each other in a spectacle that left Washington breathless.",
    "link": "https://www.pbs.org/newshour/politics/in-trump-musk-feud-a-once-steady-alliance-turns-into-an-online-spectacle",
    "timestamp": "2025-06-06T15:53:49Z"
  },
  {
    "title": "Trump urges Supreme Court to allow mass layoffs at Education Department | CNN Politics",
    "description": "President Donald Trump’s administration urged the Supreme Court on Friday to allow officials to gut the Department of Education, a key priority for the president that has been stymied by a series of lower court decisions.",
    "link": "https://www.cnn.com/2025/06/06/politics/trump-supreme-court-education",
    "timestamp": "2025-06-06T15:53:36Z"
  },
  {
    "title": "Trump ban on entry of international Harvard students blocked by US judge",
    "description": "In Thursday's court filing, Harvard said Trump had violated federal law by failing to back up his claims about national security.",
    "link": "https://www.jpost.com/international/article-856821",
    "timestamp": "2025-06-06T15:53:24Z"
  },
  {
    "title": "A timeline of Donald Trump and Elon Musk's falling out",
    "description": "Elon Musk and Donald Trump's friendship unraveled publicly over a tax bill dispute. Here's how their friendship fractured on Thursday.",
    "link": "https://www.businessinsider.com/a-timeline-of-donald-trump-and-elon-musks-falling-out-2025-6",
    "timestamp": "2025-06-06T15:53:23Z"
  },
  {
    "title": "Polymarket Partners Up With Elon Musk's xAI",
    "description": "Shayne Coplan, the prediction market's CEO, said that the two \"truth-seeking apps\" would be stronger together.",
    "link": "https://www.coindesk.com/business/2025/06/06/polymarket-partners-up-with-elon-musks-xai",
    "timestamp": "2025-06-06T15:53:21Z"
  },
  {
    "title": "Elon Musk's Father Reacts to Jeffrey Epstein Files Claim About Trump",
    "description": "Elon Musk's father has weighed in on his son's feud with President Donald Trump.",
    "link": "https://www.newsweek.com/elon-musks-father-reacts-jeffrey-epstein-files-claim-about-trump-2082041",
    "timestamp": "2025-06-06T15:52:23Z"
  },
  {
    "title": "Kanye West and Bill Ackman are rooting for Trump and Musk to get back together",
    "description": "Musk accused Trump of reckless spending -- prompting the president to lash out with threats of retaliation and character attacks.",
    "link": "https://nypost.com/2025/06/06/business/kanye-west-and-bill-ackman-are-rooting-for-trump-and-musk-to-get-back-together/",
    "timestamp": "2025-06-06T15:52:03Z"
  },
  {
    "title": "Republicans Prepare Bill Declaring “Free Palestine” Is Antisemitic",
    "description": "The House of Representatives is trying to pass a resolution making the term “Free Palestine” an official antisemitic slogan. \r\nRepublican Representative Gabe Evans from Colorado introduced the resolution in the wake of the attack on a gathering for Israeli ho…",
    "link": "https://newrepublic.com/post/196241/house-republicans-bill-free-palestine-antisemitic",
    "timestamp": "2025-06-06T15:51:38Z"
  },
  {
    "title": "Trump administration asks Supreme Court to leave mass layoffs at Education Department in place",
    "description": "A federal appeals court refused to put the order on hold during appeals.",
    "link": "https://www.bostonherald.com/2025/06/06/trump-education-mass-layoffs/",
    "timestamp": "2025-06-06T15:51:23Z"
  },
  {
    "title": "'Biggest failure': Congress questions achievements of govt delegations sent abroad",
    "description": "The Congress party criticized the Modi government's foreign policy, citing a lack of high-level meetings for Indian delegations abroad and questioning the benefits gained from these trips. They alleged India is being isolated, with even traditional allies dis…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/biggest-failure-congress-questions-achievements-of-govt-delegations-sent-abroad/articleshow/121679991.cms",
    "timestamp": "2025-06-06T15:51:06Z"
  },
  {
    "title": "There’s Only One Question Here: Can Musk Bring Trump Down if He Wants?",
    "description": "For starters, I say Donald Trump is due our congratulations and respect. He finally found a white Afrikaner he’d like to throw out of the country. The early conventional wisdom on the Trump-Elon Musk divorce is that it was simultaneously shocking and inevitab…",
    "link": "https://newrepublic.com/article/196244/musk-trump-leverage-takedown-feud",
    "timestamp": "2025-06-06T15:50:19Z"
  },
  {
    "title": "How rising US national debt impacts the average American",
    "description": "While many Americans may not think about how the federal deficit affects their lives, America's excessive borrowing can drive up interest rates.",
    "link": "https://www.newsweek.com/how-rising-us-national-debt-impacts-average-american-2082006",
    "timestamp": "2025-06-06T15:48:49Z"
  },
  {
    "title": "The Fallout Between President Trump and Elon Musk—This Week in Your Words",
    "description": "Newsweek takes a look at reader comments, focusing this week on the fallout between Elon Musk and President Donald Trump.",
    "link": "https://www.newsweek.com/fallout-between-president-trump-elon-muskthis-week-your-words-2081958",
    "timestamp": "2025-06-06T15:48:44Z"
  },
  {
    "title": "Corrupt Cop Who Leaked To Proud Boys Learns His Fate",
    "description": "He once led the intelligence division for the D.C. Metropolitan Police Department. Now he’s going to prison.",
    "link": "https://www.huffpost.com/entry/corrupt-cop-who-leaked-to-proud-boys-learns-his-fate_n_6842eaeee4b04a6fce05e83b",
    "timestamp": "2025-06-06T15:48:01Z"
  },
  {
    "title": "Trump administration asks Supreme Court to leave mass layoffs at Education Department in place",
    "description": "The judge wrote that the layoffs “will likely cripple the department.”",
    "link": "https://www.pbs.org/newshour/education/trump-administration-asks-supreme-court-to-leave-mass-layoffs-at-education-department-in-place",
    "timestamp": "2025-06-06T15:47:26Z"
  },
  {
    "title": "News brief: CISA and partners face budget overhauls, cuts",
    "description": "Check out the latest security news from the Informa TechTarget team.",
    "link": "https://www.techtarget.com/searchsecurity/news/366625613/News-brief-CISA-and-partners-face-budget-overhauls-cuts",
    "timestamp": "2025-06-06T15:47:00Z"
  },
  {
    "title": "Stephen A. Smith Can’t Resist Inserting Himself in Trump-Musk Drama as He Chooses a Side",
    "description": "Stephen A. Smith couldn't resist getting involved in the blistering back-and-forth between President Trump and Elon Musk as he appeared to choose a side.\nThe post Stephen A. Smith Can’t Resist Inserting Himself in Trump-Musk Drama as He Chooses a Side first a…",
    "link": "https://www.mediaite.com/media/news/stephen-a-smith-cant-resist-inserting-himself-in-trump-musk-drama-as-he-chooses-a-side/",
    "timestamp": "2025-06-06T15:46:49Z"
  },
  {
    "title": "This uranium company wants to break the grip that foreign state corporations have on U.S. nuclear fuel",
    "description": "Centrus Energy CEO Amir Vexler said the world needs an American-owned uranium enricher.",
    "link": "https://www.cnbc.com/2025/06/06/centrus-uranium-trump-nuclear-energy-russia.html",
    "timestamp": "2025-06-06T15:46:46Z"
  },
  {
    "title": "Advisers reveal one Musk quote that 'catty' Trump 'can't walk away from': report",
    "description": "CNN's Kevin Liptak revealed the high stakes embedded in the \"catty\" feud between president Donald Trump and his former ally Elon Musk.\n\nThe pair traded insults Thursday in an escalating grudge match on social media after Trump spoke out against Musk's critici…",
    "link": "https://www.rawstory.com/trump-musk-2672323152/",
    "timestamp": "2025-06-06T15:46:38Z"
  },
  {
    "title": "The Pentagon Can’t Support Two Sixth-Gen Fighter Jet Programs",
    "description": "The Pentagon is prioritizing the Air Force’s F-47 stealth fighter over the Navy’s F/A-XX, citing budget constraints and production risks—potentially delaying the Navy’s next-generation aircraft program.\nThe post The Pentagon Can’t Support Two Sixth-Gen Fighte…",
    "link": "https://nationalinterest.org/blog/buzz/the-pentagon-cant-support-two-sixth-gen-fighter-jet-programs",
    "timestamp": "2025-06-06T15:46:09Z"
  },
  {
    "title": "Trump Is Holding Back From Calling Out China Over Russia War Aid",
    "description": "President Donald Trump is holding back from pushing China to halt support for Russia’s war machine as he focuses on other issues in the relationship with its biggest geopolitical rival, according to US and European officials familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-is-holding-back-from-calling-out-china-over-russia-war-aid",
    "timestamp": "2025-06-06T15:45:57Z"
  },
  {
    "title": "Tapper: Trump/Musk Partnership Is Officially Dead, Time of Death 12:46 p.m.",
    "description": "CNN's Jake Tapper reports the timeline of the rollercoaster posting dispute between President Trump and Elon Musk that took place Thursday afternoon:\r\n\r\nJAKE TAPPER: Just in the last few hours, the relationship between President Donald J. Trump and billionair…",
    "link": "https://www.realclearpolitics.com/video/2025/06/06/tapper_trumpmusk_friendship_is_officially_dead_time_of_death_1246_pm.html",
    "timestamp": "2025-06-06T15:45:28Z"
  },
  {
    "title": "What the Trump travel ban means for the 2026 World Cup and 2028 Olympic Games",
    "description": "Here’s a look at the potential effects of the travel ban on those events.",
    "link": "https://www.bostonherald.com/2025/06/06/trump-travel-ban-world-cup-olympics-fallout/",
    "timestamp": "2025-06-06T15:45:11Z"
  },
  {
    "title": "Gulf Coast Communities Take on Insurers Backing Trump-Approved Fossil Fuels",
    "description": "Organizers in Louisiana are fighting the Trump administration’s efforts to expand methane export infrastructure.",
    "link": "https://truthout.org/articles/gulf-coast-communities-take-on-insurers-backing-trump-approved-fossil-fuels/",
    "timestamp": "2025-06-06T15:45:05Z"
  },
  {
    "title": "Trump plays down spat with Musk",
    "description": "US President Donald Trump minimized his dispute with Elon Musk while speaking to The New York Post about his survey results and the unexpectedly positive May employment statistics on Friday.\"Nothing c...",
    "link": "https://biztoc.com/x/cb5d41974258f778",
    "timestamp": "2025-06-06T15:44:06Z"
  },
  {
    "title": "Republicans urge Donald Trump and Elon Musk to end their feud",
    "description": "President Donald Trump and billionaire Elon Musk are showing no signs of reconciling on Friday, but Republicans are increasingly urging them to settle their dispute",
    "link": "https://biztoc.com/x/c35b1d40bf99b786",
    "timestamp": "2025-06-06T15:43:57Z"
  },
  {
    "title": "Tesla rebounds 6% after Musk's break with Trump",
    "description": "Tesla Inc. stock bounced back 6% on Friday, erasing some of yesterday's losses after a heated social media exchange between the company's CEO Elon Musk and United States President Donald Trump escalat...",
    "link": "https://biztoc.com/x/232ba9d4b2c24a2a",
    "timestamp": "2025-06-06T15:43:53Z"
  },
  {
    "title": "Trump And Musk Enter Into A War Of Insults",
    "description": "Trump is \"very disappointed in Elon,\" but Elon keeps spilling secrets.",
    "link": "https://littlethings.com/entertainment/have-a-nice-day-djt-trumps-breakup-with-musk-devolves-into-a-war-of-insults",
    "timestamp": "2025-06-06T15:43:45Z"
  },
  {
    "title": "Democrats Call for Epstein Files in Wake of Musk Accusations Against Trump",
    "description": "In a bizarre twist of events, Democrats have begun calling for the release of the long-awaited Jeffrey Epstein files after Elon Musk claimed they contain bombshell revelations about President Donald Trump – even though the documents may backfire on the Party.…",
    "link": "https://freerepublic.com/focus/f-bloggers/4321363/posts",
    "timestamp": "2025-06-06T15:43:43Z"
  },
  {
    "title": "Elon Musk is Lashing Out at Trump’s ‘Big Beautiful Bill,’ But He’s Missing This Critical Point.",
    "description": "PULSE POINTS:❓What Happened: The Office of Management and Budget (OMB) says its analysis of President Donald J. Trump’s “One Big Beautiful Bill” finds the legislation introduces historic fiscal reforms, achieving $1.7 trillion in mandatory savings and reducin…",
    "link": "https://freerepublic.com/focus/f-news/4321362/posts",
    "timestamp": "2025-06-06T15:42:32Z"
  },
  {
    "title": "Trump-Musk feud: Who deserves the most credit for president's resounding 2024 White House win?",
    "description": "Former allies President Donald Trump and Elon Musk are trading fire over credit for the 2024 election win, with Musk highlighting his fundraising and campaigning in battlegrounds.",
    "link": "https://www.foxnews.com/politics/trump-musk-feud-who-deserves-most-credit-presidents-resounding-2024-white-house-win",
    "timestamp": "2025-06-06T15:42:24Z"
  },
  {
    "title": "Trump Team Scrambles After Report He’s Killing Manufacturing Jobs",
    "description": "The labor market is slowing, but it’s all good news in the White House.\r\nThe U.S. added 139,000 jobs in May, a slight decline from April, according to a jobs report released Friday. The unemployment rate remained at 4.2 percent, still within the ballpark of h…",
    "link": "https://newrepublic.com/post/196235/donald-trump-team-scrambles-report-manufacturing-jobs",
    "timestamp": "2025-06-06T15:42:03Z"
  },
  {
    "title": "What Tesla investors need to know about Trump and Musk’s mind-blowing meltdown",
    "description": "The feud between two of the world's most powerful men wiped $153 billion off the EV maker's value yesterday. Can it get worse?",
    "link": "https://financialpost.com/investing/trump-musk-feud-what-tesla-investors-should-know",
    "timestamp": "2025-06-06T15:41:29Z"
  },
  {
    "title": "Trump vs. Musk: Majority of Americans Side With Neither, Poll Finds",
    "description": "A new YouGov poll finds that 52% of Americans say they back \"neither\" the president nor the world's richest man in their public spat \nThe post Trump vs. Musk: Majority of Americans Side With Neither, Poll Finds appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-musk-feud-majority-americans-support-neither/",
    "timestamp": "2025-06-06T15:41:19Z"
  },
  {
    "title": "Tesla stock rebounds 5%. Wedbush says shares were 'way oversold' on the Trump-Musk breakup",
    "description": "Tesla (TSLA) investors exhaled Friday. After a brutal selloff that shaved more than $150 billion off the EV-maker’s market cap in a single day, Tesla shares bounced back almost 6% in mid-morning trading — a modest but much-needed reprieve after what one analy…",
    "link": "https://qz.com/tesla-stock-rebounds-elon-musk-donald-trump-feud-1851783829",
    "timestamp": "2025-06-06T15:41:00Z"
  },
  {
    "title": "Modi to Attend G-7 Summit in Canada in Sign of Warming Ties",
    "description": "Prime Minister Narendra Modi will be attending the Canada-hosted Group of Seven summit later this month as ties between the two nations improve.",
    "link": "https://financialpost.com/pmn/business-pmn/modi-to-attend-g-7-summit-in-canada-in-sign-of-warming-ties",
    "timestamp": "2025-06-06T15:40:54Z"
  },
  {
    "title": "When Megalomaniacs Collide: Trump Threatens to Ditch His Tesla as War with Musk Goes Nuclear",
    "description": "What began as budget bickering has spiraled into a political cage match.",
    "link": "https://www.vanityfair.com/news/story/the-trump-v-musk-fight",
    "timestamp": "2025-06-06T15:40:52Z"
  },
  {
    "title": "Trump administration closes iconic Dupont Circle Park during WorldPride against city’s objections",
    "description": "The Trump administration has closed Dupont Circle Park for the peak weekend of WorldPride in Washington, D.C., fencing off a landmark deeply tied to LGBTQ+ history despite objections from local officials and organizers.",
    "link": "https://www.advocate.com/news/trump-closes-dupont-circle-worldpride",
    "timestamp": "2025-06-06T15:40:21Z"
  },
  {
    "title": "Trump wants but Putin gets it! Russian central bank cuts key interest rate by a full percentage point",
    "description": "Russia's economic growth rate fell to 1.5 per cent year-on-year in the first four months of 2025, compared to 4.3 per cent last year.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-wants-but-putin-gets-it-russian-central-bank-cuts-key-interest-rate-by-a-full-percentage-point/articleshow/121679793.cms",
    "timestamp": "2025-06-06T15:39:59Z"
  },
  {
    "title": "Fox News host gets visibly frustrated with Trump trade adviser during interview",
    "description": "Fox Business anchor Maria Bartiromo lost her patience with President Donald Trump’s senior counselor for trade and manufacturing, Peter Navarro, on Friday morning as she pressed when trade deals will be released. “Are you expecting more trade deals in the nea…",
    "link": "https://www.rawstory.com/trump-trade-deal-2672323261/",
    "timestamp": "2025-06-06T15:38:55Z"
  },
  {
    "title": "Shadowy startup unveils AI city at California military base...",
    "description": "Shadowy startup unveils AI city at California military base...\r\n\n \n \n \n (Second column, 4th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Musk warns Bitcoin to take over!\r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://capital.news/p/california-s-new-golden-city-revealed",
    "timestamp": "2025-06-06T15:37:36Z"
  },
  {
    "title": "How Wall Street’s exuberance — despite Trump’s tariffs — masks major warning signs",
    "description": "The recent maybe irrational exuberance comes even as Trump keeps throwing fuel on the tariff fire.",
    "link": "https://nypost.com/2025/06/06/business/wall-streets-exuberance-despite-trumps-tariffs-masks-major-warning-signs/",
    "timestamp": "2025-06-06T15:35:22Z"
  },
  {
    "title": "Good Morning, News: Musk Trump Tweet War, Twee Portland Imagination Aquarium, and Watch Out for the Heat Wave (and, Tweeny Turtles)",
    "description": "As Twitter's AI maid Grok explained \"public narratives often differ from verified facts.\"\nThis one's going to put me in the battery mines for real this time.\n\nhttps://www.gettyimages.com/detail/news-photo/president-elect-donald-trump-and-elon-musk-watch-the-l…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/06/06/47825068/good-morning-news-musk-trump-tweet-war-twee-portland-imagination-aquarium-and-watch-out-for-the-heat-wave-and-tweeny-turtles",
    "timestamp": "2025-06-06T15:35:00Z"
  },
  {
    "title": "Republicans urge Donald Trump and Elon Musk to end their feud",
    "description": "President Donald Trump and billionaire Elon Musk are showing no signs of reconciling on Friday, but Republicans are increasingly urging them to settle their dispute",
    "link": "https://abcnews.go.com/Business/wireStory/republicans-urge-donald-trump-elon-musk-end-feud-122577674",
    "timestamp": "2025-06-06T15:34:49Z"
  },
  {
    "title": "Thomas Fugate: A novice who replaced an army veteran to lead US terror prevention centre",
    "description": "A 22-year-old former landscaper and grocery store worker with minimal national security experience will now tackle extremism in the US. Thomas Fugate, who graduated from the University of Texas at San Antonio just 12 months ago, is currently heading up the Ce…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/thomas-fugate-a-novice-who-replaced-an-army-veteran-to-lead-us-terror-prevention-centre/articleshow/121679621.cms",
    "timestamp": "2025-06-06T15:34:34Z"
  },
  {
    "title": "Billion-dollar battery plant pauses construction amid electric vehicle and tariff uncertainty",
    "description": "A Japanese company has halted construction on a $1_6 billion factory in South Carolina to help make batteries for electric BMWs, citing “policy and market uncertainty.”",
    "link": "https://abcnews.go.com/US/wireStory/billion-dollar-battery-plant-pauses-construction-amid-electric-122576769",
    "timestamp": "2025-06-06T15:34:03Z"
  },
  {
    "title": "AVAX Surges 6% After Musk-Trump Dispute Sell-Off",
    "description": "Buyers show strong accumulation patterns at key support levels despite broader market uncertainty.",
    "link": "https://www.coindesk.com/markets/2025/06/06/avax-surges-6-after-musk-trump-dispute-sell-off",
    "timestamp": "2025-06-06T15:33:44Z"
  },
  {
    "title": "Donald Trump Approval Rating Update: Support Hits Highest Level in Months",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's net approval rating has hit its highest level in months.\nDecision Desk HQ's tracker currently shows that Trump's net approval rating sits at -1 point, with 47.8 percent approving and 4…",
    "link": "https://biztoc.com/x/cc9d7b12b809d3c4",
    "timestamp": "2025-06-06T15:33:16Z"
  },
  {
    "title": "Judge temporarily blocks Trump’s ban on foreign students attending Harvard",
    "description": "Trump's proclamation was the latest attempt by his Republican administration to prevent the nation’s oldest and wealthiest college from enrolling a quarter of its students, who account for much of its research and scholarship.",
    "link": "https://www.pbs.org/newshour/education/judge-temporarily-blocks-trumps-ban-on-foreign-students-attending-harvard",
    "timestamp": "2025-06-06T15:32:38Z"
  },
  {
    "title": "Bitcoin Could Break The Dollar — $250K Prediction Still In Play, Billionaire Says",
    "description": "Tim Draper, a Silicon Valley venture capitalist, has doubled down on his call for Bitcoin to hit $250,000 by the end of 2025. He shared this on X, renewing a prediction he first made in 2018 when he set his sights on reaching that mark by 2022. Related Readin…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-could-break-the-dollar-250k-prediction-still-in-play-billionaire-says/",
    "timestamp": "2025-06-06T15:30:49Z"
  },
  {
    "title": "US-UAE multi-billion dollar AI data campus deal far from finalised, sources say",
    "description": "The project, which plans to use advanced Nvidia AI chips, has been promoted by Trump officials as a win in steering Gulf states toward US technology over Chinese alternatives. But according to five sources briefed on the project, US officials have yet to dete…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-uae-multi-billion-dollar-ai-data-campus-deal-far-from-finalised-sources-say/articleshow/121679737.cms",
    "timestamp": "2025-06-06T15:30:48Z"
  },
  {
    "title": "Trump presses Powell for a full-point interest rate cut despite strong jobs report (CNBC)",
    "description": "CNBC:\nTrump presses Powell for a full-point interest rate cut despite strong jobs report  —  President Donald Trump on Friday urged Federal Reserve Chairman Jerome Powell to slash interest rates by a full percentage point, despite a better-than-expected resul…",
    "link": "https://www.memeorandum.com/250606/p53",
    "timestamp": "2025-06-06T15:30:03Z"
  },
  {
    "title": "NY judge orders Trump administration not to arrest or relocate Columbia student protester",
    "description": "People take part in a protest outside Federal Court in Manhattan in solidarity Yunseo Chung.\n \n\nYunseo Chung immigrated to the U.S. from South Korea when she was 7. [ more › ]",
    "link": "https://gothamist.com/news/ny-judge-orders-trump-administration-not-to-arrest-or-relocate-columbia-student-protester",
    "timestamp": "2025-06-06T15:30:00Z"
  },
  {
    "title": "Billion-Dollar Carolina Battery Plant Pauses Construction Amid Tariff Uncertainty",
    "description": "A Japanese company has halted construction on a $1.6 billion factory in South Carolina to help make batteries for electric BMWs, citing “policy and market uncertainty.” While AESC didn’t specify what those problems are, South Carolina’s Republican governor sa…",
    "link": "https://www.insurancejournal.com/news/southeast/2025/06/06/826625.htm",
    "timestamp": "2025-06-06T15:29:55Z"
  },
  {
    "title": "Republican Gets Good Sign in New Jersey Governor's Race Poll",
    "description": "Republican Jack Ciattarelli and the top Democratic candidate are viewed favorably by a similar percentage of voters, a poll shows.",
    "link": "https://www.newsweek.com/republican-good-sign-new-jersey-governor-race-poll-favorability-2081969",
    "timestamp": "2025-06-06T15:29:13Z"
  },
  {
    "title": "Donald Trump Approval Rating Update: Support Hits Highest Level in Months",
    "description": "Decision Desk HQ's tracker shows Trump's net approval rating rose, with 47.8 percent approving and 48.8 percent disapproving.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-polls-2081992",
    "timestamp": "2025-06-06T15:28:31Z"
  },
  {
    "title": "Trump says he has no evidence to justify his unprecedented Biden investigation",
    "description": "As Donald Trump launches an investigation into Joe Biden, it's the third time the Republican has engaged in such a flagrant abuse of presidential power.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-says-no-evidence-justify-unprecedented-biden-investigation-rcna211439",
    "timestamp": "2025-06-06T15:28:30Z"
  },
  {
    "title": "Yale’s $2.5 Billion Private Equity Sale Tests Its Vaunted Endowment Model",
    "description": "(Bloomberg) -- Yale University’s $41 billion endowment, led for decades by the late investing giant David Swensen, has been the envy – and the blueprint...",
    "link": "https://finance.yahoo.com/news/yale-2-5-billion-private-113032100.html",
    "timestamp": "2025-06-06T15:28:23Z"
  },
  {
    "title": "Epstein, Israel, ISIS, Palantir",
    "description": "…\nThe post Epstein, Israel, ISIS, Palantir appeared first on Global Research.",
    "link": "https://www.caitlinjohnst.one/p/epstein-israel-isis-palantir",
    "timestamp": "2025-06-06T15:27:13Z"
  },
  {
    "title": "Republicans urge Donald Trump and Elon Musk to end their feud",
    "description": "As the Republican Party braces for aftershocks from President Donald Trump's spectacular clash with Elon Musk, lawmakers and conservative figures are urging ...",
    "link": "https://www.yahoo.com/news/republicans-urge-donald-trump-elon-152710022.html",
    "timestamp": "2025-06-06T15:27:10Z"
  },
  {
    "title": "Comics Folk React To… Elon Musk And Donald Trump's Fanboy Rampage",
    "description": "America is currently going through another Civil War, and not one in which it is revealed Captain America doesn't know what MySpace is. Instead, it's the bustup between Zaphod Beeblebrox himself, President Donald Trump and Man In The Shack, Elon Musk. Musk sa…",
    "link": "https://bleedingcool.com/comics/comics-folk-react-to-elon-musk-and-donald-trumps-fanboy-rampage/",
    "timestamp": "2025-06-06T15:27:07Z"
  },
  {
    "title": "Early Twitter Investor Builds $100 Million Bitcoin Treasury for Public Healthtech Company",
    "description": "Publicly traded healthtech firm Know Labs is planning to buy 1,000 Bitcoin under its new leader, noted fintech investor Greg Kidd.",
    "link": "https://decrypt.co/323987/early-twitter-investor-builds-100-million-bitcoin-treasury-public-company",
    "timestamp": "2025-06-06T15:26:37Z"
  },
  {
    "title": "Trump To Ditch His Tesla After Elon Brouhaha",
    "description": "President Donald Trump is planning to either sell or give away his Tesla over his online feud with Tesla CEO Elon Musk, White House officials said on Friday.",
    "link": "https://dailycaller.com/2025/06/06/donald-trump-ditch-tesla-elon-musk/",
    "timestamp": "2025-06-06T15:26:10Z"
  },
  {
    "title": "Despite Trump-Musk Feud, CO2 Milestone Is the 'Important News of the Day'",
    "description": "The concentration of carbon dioxide in the atmosphere peaked above 430 parts per million in 2025—the highest it has been in millions of years—according to data released by the National Oceanic and Atmospheric Administration and Scripps Institution of Oceanogr…",
    "link": "https://www.commondreams.org/news/carbon-dioxide-record",
    "timestamp": "2025-06-06T15:25:56Z"
  },
  {
    "title": "Newark Mayor Ras Baraka on Defying ICE and Charting a New Course for Democrats",
    "description": "In May, Newark Mayor Ras Baraka made headlines when he was arrested during a protest outside of an immigration detention facility in New Jersey and charged with trespassing. Baraka has staunchly opposed the reopening of the 1,000-bed detention center, called …",
    "link": "https://www.motherjones.com/politics/2025/06/newark-mayor-ras-baraka-ice-arrest-governors-race/",
    "timestamp": "2025-06-06T15:25:25Z"
  },
  {
    "title": "13 of the Funniest Late-Night Jokes About the Elon Musk/Donald Trump Feud",
    "description": "A Musk/Trump feud is like Christmas for the comedians of late night",
    "link": "https://www.cracked.com/article_46889_13-of-the-funniest-late-night-jokes-about-the-elon-muskdonald-trump-feud.html",
    "timestamp": "2025-06-06T15:25:00Z"
  },
  {
    "title": "California Fourth Grader Detained By ICE Sparks Outrage",
    "description": "A spokesperson for ICE told Newsweek they remain in federal custody pending removal from the United States back to Honduras.",
    "link": "https://www.newsweek.com/fourth-grader-martir-garcia-lara-detained-ice-calfornia-2082005",
    "timestamp": "2025-06-06T15:24:00Z"
  },
  {
    "title": "CNN’s Bash: Trump Told Me He Has No Plans to Talk, Says Elon Has a 'Problem'",
    "description": "Friday on CNN's \"The Situation Room,\" chief political correspondent Dana Bash detailed her morning phone conversation with President Donald Trump.\nThe post CNN’s Bash: Trump Told Me He Has No Plans to Talk, Says Elon Has a ‘Problem’ appeared first on Breitbar…",
    "link": "https://www.breitbart.com/clips/2025/06/06/cnns-bash-trump-told-me-he-has-no-plans-to-talk-says-elon-has-a-problem/",
    "timestamp": "2025-06-06T15:23:47Z"
  },
  {
    "title": "Elon Musk calls for impeachment of Donald Trump - here's how the President could be removed from office",
    "description": "Elon Musk and Donald Trump had a big fight online after Musk slammed Trump’s tax bill. Trump then threatened to cut Elon’s government deals. Musk responded by saying Trump should be impeached. The drama could affect U.S. politics and business ties.",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-calls-for-impeachment-of-donald-trump-heres-how-the-president-could-be-removed-from-office/articleshow/121679402.cms",
    "timestamp": "2025-06-06T15:23:30Z"
  },
  {
    "title": "Jeffrey Epstein Had Zero Dirt on Donald Trump, Says Epstein's Defense Lawyer",
    "description": "Elon Musk thinks he dropped the \"bomb\" on President Trump by claiming he's in the so-called Epstein files, but the defense attorney for the deceased sex criminal is calling BS on Musk. David Schoen, one of Epstein's lawyers, tells TMZ ... the…",
    "link": "https://www.tmz.com/2025/06/06/jeffrey-epstein-defense-lawyer-says-sex-criminal-had-no-dirt-on-trump/",
    "timestamp": "2025-06-06T15:23:29Z"
  },
  {
    "title": "On Its 240th Anniversary, US Dollar is Weakened and Challenged",
    "description": "June 6 marks 240 years since the Continental Congress officially adopted the US dollar as the unit of money for the country. But how does the greenback feel today?",
    "link": "https://sputnikglobe.com/20250606/on-its-240th-anniversary-us-dollar-is-weakened-and-challenged-1122202051.html",
    "timestamp": "2025-06-06T15:23:00Z"
  },
  {
    "title": "Iran Turns to China for Ballistic Missile Materials as Nuclear Threat Grows",
    "description": "While negotiations over Iran’s nuclear program appear to have made little progress, Iran is further arming itself, a new report indicates.   Iran has ordered... Read More\nThe post Iran Turns to China for Ballistic Missile Materials as Nuclear Threat Grows app…",
    "link": "https://www.dailysignal.com/2025/06/06/iran-turns-to-china-for-ballistic-missile-materials-as-nuclear-threat-grows/",
    "timestamp": "2025-06-06T15:22:27Z"
  },
  {
    "title": "Democrats Should Stay Out of the Trump-Musk Feud and Enjoy It",
    "description": "Some Democrats say they should invite Elon Musk to ‘come back.’ But it’s far smarter for them to give the Musk-Trump feud a very wide berth. Maybe their quarrel will undermine the BBB, but no one should forget who they are and what they stand for.",
    "link": "http://nymag.com/intelligencer/article/democrats-should-stay-out-of-trump-versus-elon-musk.html",
    "timestamp": "2025-06-06T15:22:12Z"
  },
  {
    "title": "People Cannot Believe Donald Trump Made This \"Ignorant\" And \"Embarrassing\" Comment About D-Day In Front Of The German Chancellor",
    "description": "\"The President of the United States is a f—king moron and a disgrace on the world stage.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/michaelabramwell/trumps-joke-about-d-day-to-german-chancellor",
    "timestamp": "2025-06-06T15:22:08Z"
  },
  {
    "title": "US jobs market slows down as businesses cope with Trump trade war uncertainty",
    "description": "May’s jobs report was dragged down by loss of 22,000 federal workers’ jobs as Doge cut positions\nThe US economy added 139,000 jobs in May, a slowdown compared with recent months as American businesses cope with uncertainty around Donald Trump’s continuing tra…",
    "link": "https://biztoc.com/x/f5550adaed66084a",
    "timestamp": "2025-06-06T15:21:45Z"
  },
  {
    "title": "Trump Orders Inquiry Into Biden’s Health, Use of Autopen",
    "description": "President Donald Trump directed aides to investigate whether former President Joe Biden’s staff conspired to hide information about his health from the public and enacted any executive actions without his predecessor’s knowledge.\nThe memorandum, published Wed…",
    "link": "https://biztoc.com/x/3210e48cd9bd35f3",
    "timestamp": "2025-06-06T15:21:37Z"
  },
  {
    "title": "After Trump Deportation Attempt, Migrants and ICE Agents Stranded in Shipping Container in Djibouti",
    "description": "The Trump administration could have sent eight migrants with deportation orders and the immigration agents who were escorting them to a facility in the U.S. after a federal judge recently barred officials from deporting them to war-torn South Sudan, where the…",
    "link": "https://www.commondreams.org/news/djibouti-migrants",
    "timestamp": "2025-06-06T15:21:37Z"
  },
  {
    "title": "This week on \"Sunday Morning\" (June 8)",
    "description": "A look at the features for this week's broadcast of the Emmy-winning program, hosted by Jane Pauley.",
    "link": "https://www.cbsnews.com/news/this-week-on-sunday-morning-june-8-2025/",
    "timestamp": "2025-06-06T15:21:02Z"
  },
  {
    "title": "Billion-dollar battery plant pauses construction amid electric vehicle and tariff uncertainty",
    "description": "COLUMBIA, S.C. (AP) — A Japanese company has halted construction on a $1.6 billion factory in South Carolina to help make batteries for electric BMWs, citing “policy and market uncertainty.” While AESC didn’t specify what those problems are, South Carolina’s …",
    "link": "https://financialpost.com/pmn/billion-dollar-battery-plant-pauses-construction-amid-electric-vehicle-and-tariff-uncertainty",
    "timestamp": "2025-06-06T15:20:38Z"
  },
  {
    "title": "Taco man, Taco man. Taco man hates Melon man. They get in a fight, Fark Man wins [Dumbass]",
    "description": "Taco man, Taco man. Taco man hates Melon man. They get in a fight, Fark Man wins",
    "link": "https://www.fark.com/comments/13697548/Taco-man-Taco-man-Taco-man-hates-Melon-man-They-get-in-a-fight-Fark-Man-wins",
    "timestamp": "2025-06-06T15:20:10Z"
  },
  {
    "title": "Trump Adviser Urges Immigration Investigation Into Elon Musk's Past as \"Illegal Alien\"",
    "description": "As Elon Musk and Donald Trump's bromance experiences a rapid but totally predictable disassembly, Steve Bannon, Musk's archnemesis, is calling on the president to investigate the world's richest man for being an \"illegal alien.\" \"They should initiate a formal…",
    "link": "https://futurism.com/trump-adviser-elon-musk-immigration",
    "timestamp": "2025-06-06T15:20:04Z"
  }
]