[
  {
    "title": "Did Donald Trump order piracy on the high seas?",
    "description": "This newsletter was first published in The Conversation UK’s World Affairs Briefing email. Sign up to receive weekly analysis of the latest developments in international relations, direct to your inbox…",
    "link": "https://theconversation.com/did-donald-trump-order-piracy-on-the-high-seas-271881",
    "timestamp": "2025-12-12T08:46:34Z"
  },
  {
    "title": "On the Question of a Third Term:  An Open Letter to President Mahama",
    "description": "Your Excellency, With the deepest respect for your long and distinguished service to Ghana, I write as a citizen profoundly committed to the enduring strength of our democracy. At a moment when your leadership is widely lauded, voices, some sincere, others op…",
    "link": "https://thechronicle.com.gh/on-the-question-of-a-third-term-an-open-letter-to-president-mahama/",
    "timestamp": "2025-12-12T08:31:52Z"
  },
  {
    "title": "UGC NET December 2025 session: Marking scheme, paper wise exam pattern explained",
    "description": "The National Testing Agency will conduct the UGC NET December 2025 cycle. The exam is scheduled for the first week of December 2025. It will be a Computer-Based Test. The assessment determines eligibility for Assistant Professorship and Junior Research Fellow…",
    "link": "https://timesofindia.indiatimes.com/education/news/ugc-net-december-2025-session-marking-scheme-paper-wise-exam-pattern-explained/articleshow/125929693.cms",
    "timestamp": "2025-12-12T08:29:19Z"
  },
  {
    "title": "Zelensky claims referendum on territorial concessions necessary",
    "description": "Ukrainians could be asked to vote on the status of Donbass in a referendum or election, Vladimir Zelensky has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/629353-ukraine-referendum-donbass-zelensky/",
    "timestamp": "2025-12-12T08:29:15Z"
  },
  {
    "title": "Trump signs order to curb state-level AI regulations",
    "description": "US President Donald Trump has moved to curb state-level AI regulation through legal action and funding leverage Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629348-trump-ai-state-laws/",
    "timestamp": "2025-12-12T08:26:29Z"
  },
  {
    "title": "Zodiac signs who should not miss reciting Hanuman Chalisa",
    "description": "Reciting the Hanuman Chalisa offers immense strength and courage, particularly beneficial for Aries, Leo, Scorpio, and Cancer natives. Daily chanting is advised for consistent divine connection and protection. The article also outlines the proper method for r…",
    "link": "https://timesofindia.indiatimes.com/astrology/zodiacs-astrology/zodiac-signs-who-should-not-miss-reciting-hanuman-chalisa/articleshow/125928065.cms",
    "timestamp": "2025-12-12T08:25:29Z"
  },
  {
    "title": "Donald Trump wants a Europe in chaos – a sure sign for Britain to shore up its democracy | Polly Toynbee",
    "description": "With the US threatening to support ‘patriotic’ parties here, we need better defences, starting with tough new rules about political donations\nThe new threat is so dizzyingly bizarre that Europe, and especially Britain, is slow to believe it. The US declares i…",
    "link": "https://biztoc.com/x/e554bece3744d436",
    "timestamp": "2025-12-12T08:24:17Z"
  },
  {
    "title": "Bangladesh plans to buy Eurofighter Typhoon: Here's how it compares to Rafale, can S-400 detect it?",
    "description": "Bangladesh is exploring the acquisition of Eurofighter Typhoon combat jets from Italy as part of its air force modernization. This preliminary step follows recent aviation decisions, including a planned purchase of Boeing aircraft. The Eurofighter Typhoon, a …",
    "link": "https://economictimes.indiatimes.com/news/defence/bangladesh-plans-to-buy-eurofighter-typhoon-heres-how-it-compares-to-rafale-can-s-400-detect-it/articleshow/125928372.cms",
    "timestamp": "2025-12-12T08:21:39Z"
  },
  {
    "title": "HP Patwari recruitment 2025: Registration begins for 530 vacancies, direct link to apply here",
    "description": "Himachal Pradesh is opening doors for 530 Patwari positions, with applications commencing December 12, 2025, through January 16, 2026. Aspiring candidates, aged 18-45 and holding a Class 12 certificate, can apply online at hprca.hp.gov.in. The selection invol…",
    "link": "https://timesofindia.indiatimes.com/education/news/hp-patwari-recruitment-2025-registration-begins-for-530-vacancies-direct-link-to-apply-here/articleshow/125928843.cms",
    "timestamp": "2025-12-12T08:20:39Z"
  },
  {
    "title": "Congo refugees recount death and chaos as war reignites",
    "description": "Congolese refugees described neighbours being massacred and losing children in the chaos as they fled into Rwanda to escape a surge in fighting despite a peace deal brokered by US President Donald Trump. “I have 10 kids, but I’m here with only three. I don’t …",
    "link": "https://www.digitaljournal.com/world/congo-refugees-recount-death-and-chaos-as-war-reignites/article",
    "timestamp": "2025-12-12T08:12:20Z"
  },
  {
    "title": "Kilmar Abrego Garcia freed from US immigration detention, returns home",
    "description": "The Department of Homeland Security has pledged to appeal the latest ruling, slamming it as 'naked judicial activism'.",
    "link": "https://www.aljazeera.com/news/2025/12/12/kilmar-abrego-garcia-freed-from-us-immigration-detention-returns-home",
    "timestamp": "2025-12-12T08:03:40Z"
  },
  {
    "title": "Trump signs order to block state AI regulations",
    "description": "President Donald Trump has signed an executive order to block states from regulating artificial intelligence",
    "link": "https://www.wsbtv.com/news/politics/trump-signs/DU46BQUTGE3EZJKCNOULMP4NJQ/",
    "timestamp": "2025-12-12T08:00:56Z"
  },
  {
    "title": "Prabowo pushes for US tariff talks to conclude by year's end",
    "description": "Indonesian President Prabowo Subianto has set a year-end target for his aides to conclude tariff negotiations with the United States, according to ...",
    "link": "https://en.antaranews.com/news/396256/prabowo-pushes-for-us-tariff-talks-to-conclude-by-years-end",
    "timestamp": "2025-12-12T07:59:40Z"
  },
  {
    "title": "Elefsis Port Authority: Investment interest from the USA",
    "description": "The Growthfund’s plan to utilize the Elefsis Port Authority by 2026 is attracting strong US investment interest. Port industry officials, who are closely monitoring developments, pointed out to “N” that…\nElefsis Port Authority: Investment interest from the US…",
    "link": "https://www.naftemporiki.gr/english/2045677/elefsis-port-authority-investment-interest-from-the-usa/",
    "timestamp": "2025-12-12T07:57:47Z"
  },
  {
    "title": "‘I’m the one Trump fears’: Democratic firebrand Jasmine Crockett’s bold political move",
    "description": "With a viral campaign launch and a promise to take the fight to the US president, the Texas congresswoman enters a high-stakes race that could reshape the balance of power in Washington",
    "link": "https://www.irishtimes.com/world/us/2025/12/12/im-the-one-trump-fears-democratic-firebrand-jasmine-crocketts-bold-political-move/",
    "timestamp": "2025-12-12T07:57:04Z"
  },
  {
    "title": "Trump ‘pardons’ jailed US election denier",
    "description": "US President Donald Trump said Thursday he would “pardon” a Colorado official jailed on charges linked to efforts to overturn the 2020 presidential election.  Tina Peters, a former official in Colorado’s Mesa County, was sentenced in October 2024 for allowing…",
    "link": "https://www.digitaljournal.com/world/trump-pardons-jailed-us-election-denier/article",
    "timestamp": "2025-12-12T07:47:20Z"
  },
  {
    "title": "South Africa's ANC says it needs to reform to regain support",
    "description": "JOHANNESBURG, Dec 12 (Reuters) - South Africa's African National Congress, the liberation movement that brought Nelson Mandela to power, said it was facing a crisis over corruption, poor governance, and persistent racial inequality, and pledged to clean up it…",
    "link": "https://www.thestar.com.my/news/world/2025/12/12/south-africa039s-anc-says-it-needs-to-reform-to-regain-support",
    "timestamp": "2025-12-12T07:47:00Z"
  },
  {
    "title": "Deutsche Bank, Goldman See Fed Cuts Rekindling Dollar’s Slide",
    "description": "Deutsche Bank AG, Goldman Sachs Group Inc. and other Wall Street banks are forecasting that the US dollar will resume its slide next year as the Federal Reserve keeps nudging down interest rates.",
    "link": "https://financialpost.com/pmn/business-pmn/deutsche-bank-goldman-see-fed-cuts-rekindling-dollars-slide",
    "timestamp": "2025-12-12T07:46:43Z"
  },
  {
    "title": "US sanctions bring uncertainty to the lives of International Criminal Court judges and prosecutors",
    "description": "International Criminal Court judges and prosecutors are trying to live and work under the same financial and travel restrictions brought against Russian President Vladimir Putin and Osama bin Laden. Six judges, the chief prosecutor and two other staff members…",
    "link": "https://apnews.com/article/international-court-sanctions-trump-icc-hague-4cdefe4de067432f6cdb9b137908c463",
    "timestamp": "2025-12-12T07:44:27Z"
  },
  {
    "title": "Oakridge Gachibowli hosts Artificial Intelligence education conference, promotes sustainable AI practices and student safety",
    "description": "Hyderabad's educators convened at Oakridge International School for a pioneering conference on AI's role in education. Led by international coach Ann Palmer, the event explored practical AI integration for teaching, learning, and leadership, emphasizing respo…",
    "link": "https://timesofindia.indiatimes.com/education/news/oakridge-gachibowli-hosts-city-wide-leading-with-ai-shaping-the-future-of-education-conference-for-school-leaders/articleshow/125928591.cms",
    "timestamp": "2025-12-12T07:32:22Z"
  },
  {
    "title": "Rights group accuses RSF of systematic sexual violence in Sudan’s civil war",
    "description": "Report finds paramilitary group responsible for vast majority of attacks as conflict devastates civilian population.",
    "link": "https://www.aljazeera.com/news/2025/12/12/rights-group-accuses-rsf-of-systematic-sexual-violence-in-sudans-civil-war",
    "timestamp": "2025-12-12T07:31:47Z"
  },
  {
    "title": "Modi and Trump discuss trade and defense in phone call",
    "description": "India and the US have emphasized the need to sustain momentum in economic cooperation Read Full Article at RT.com",
    "link": "https://www.rt.com/india/629347-modi-and-trump-discuss-trade/",
    "timestamp": "2025-12-12T07:30:56Z"
  },
  {
    "title": "Murdoch Paper Slams Trump Deal as Worse Than the Sale of Manhattan",
    "description": "The Rupert Murdoch-owned Wall Street Journal has mocked a deal announced by Donald Trump that allows powerful artificial intelligence chips to be exported from the U.S. to China in return for a small cut of the revenue.\nThe paper’s editorial board questioned …",
    "link": "https://biztoc.com/x/63b1bd36fa14b3ab",
    "timestamp": "2025-12-12T07:28:21Z"
  },
  {
    "title": "JORGE MARTINEZ: Ignore The Noise. America Finally Affording A Comeback",
    "description": "If you listened only to the woke media, you’d think America is still stuck in crisis. But after 11 months under President Donald J. Trump and Vice President",
    "link": "https://dailycaller.com/2025/12/12/opinion-ignore-the-noise-america-is-finally-affording-a-comeback-jorge-martinez/",
    "timestamp": "2025-12-12T07:25:16Z"
  },
  {
    "title": "Trump Administration Doubles Down On Cruel 'Franklin' Posts Despite Publisher Criticism",
    "description": "The Department of Justice used the beloved children's book character in another twisted meme.",
    "link": "https://www.huffpost.com/entry/trump-administration-doubles-down-franklin-the-turtle-memes_n_693b9d60e4b07bcd2541cdc3",
    "timestamp": "2025-12-12T07:22:06Z"
  },
  {
    "title": "Verdict in Hong Kong media tycoon Jimmy Lai’s trial due next week",
    "description": "The 156-day trial, the most high-profile use of Beijing's draconian national security law, is set to come to a close.",
    "link": "https://www.aljazeera.com/news/2025/12/12/verdict-in-hong-kong-media-tycoon-jimmy-lais-trial-due-next-week",
    "timestamp": "2025-12-12T07:21:30Z"
  },
  {
    "title": "Jeffrey Sachs: Trump’s Empire of Hubris and Thuggery",
    "description": "Trump’s latest National Security Strategy memorandum treats the freedom to coerce others as the essence of US sovereignty.",
    "link": "https://www.nakedcapitalism.com/2025/12/jeffrey-sachs-trumps-empire-of-hubris-and-thuggery.html",
    "timestamp": "2025-12-12T07:15:57Z"
  },
  {
    "title": "The US is already at war with Venezuela",
    "description": "Trump’s violent new tactics build on years of US sanctions and intervention that have devastated ordinary Venezuelans.",
    "link": "https://www.aljazeera.com/opinions/2025/12/12/the-us-is-already-at-war-with-venezuela",
    "timestamp": "2025-12-12T07:12:57Z"
  },
  {
    "title": "Schools and banks closed in Meghalaya as government observes holiday marking Pa Togan Sangma sacrifice",
    "description": "Meghalaya schools closed: Schools, colleges, and banks in Meghalaya remained closed as the government observed a holiday to honour Pa Togan Nengminza Sangma, a Garo leader and early freedom fighter who led the first protest against British colonial forces in …",
    "link": "https://timesofindia.indiatimes.com/education/news/schools-and-banks-closed-in-meghalaya-as-government-observes-holiday-marking-pa-togan-sangma-sacrifice/articleshow/125927697.cms",
    "timestamp": "2025-12-12T07:10:44Z"
  },
  {
    "title": "Cut off by their banks and even iced out by Alexa, sanctioned ICC staffers remain resolute",
    "description": "International Criminal Court judges and prosecutors are trying to live and work under the same financial and travel restrictions brought against Russian President Vladimir Putin and Osama bin Laden",
    "link": "https://abcnews.go.com/Business/wireStory/cut-off-banks-iced-alexa-sanctioned-icc-staffers-128335932",
    "timestamp": "2025-12-12T07:02:00Z"
  },
  {
    "title": "As Authoritarianism Grows, Psychologists Must Not Be Silent",
    "description": "Note: The authors and contributors to this statement had initially envisioned that it would be published as an official statement from the Society for the Study of Peace, Conflict, and Violence — Division 48 of the American Psychological Association (APA). Ho…",
    "link": "https://www.counterpunch.org/2025/12/12/as-authoritarianism-grows-psychologists-must-not-be-silent/",
    "timestamp": "2025-12-12T07:01:55Z"
  },
  {
    "title": "TIME Magazine’s 2025 person of the year is a group including Elon Musk, Nvidia CEO Jensen Huang, OpenAI's Sam Altman and …",
    "description": "TIME Magazine has named 'The Architects of AI' as its 2025 Person of the Year, recognizing tech leaders like Jensen Huang, Sam Altman, and Elon Musk. These innovators are credited with unleashing AI's full potential, profoundly impacting global information, c…",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/time-magazines-2025-person-of-the-year-is-a-group-including-elon-musk-nvidia-ceo-jensen-huang-openais-sam-altman-and-/articleshow/125927980.cms",
    "timestamp": "2025-12-12T06:59:21Z"
  },
  {
    "title": "International Law and U.S./Trump Egocentrism",
    "description": "What should be done about Donald Trump and the U.S. strikes on boats in the Caribbean and Pacific Oceans? Should we really be quibbling about who ordered the second strike on the survivors of the boat off the coast of Venezuela? By quibbling, “there’s a risk …",
    "link": "https://www.counterpunch.org/2025/12/12/international-law-and-u-s-trump-egocentrism/",
    "timestamp": "2025-12-12T06:59:13Z"
  },
  {
    "title": "Thai PM dissolves parliament, paving way for national elections",
    "description": "Thailand's prime pinister dissolved parliament on Friday, paving the way for general elections early next year as deadly border clashes continue with neighbour Cambodia.",
    "link": "https://www.hurriyetdailynews.com/thai-pm-dissolves-parliament-paving-way-for-national-elections-216735",
    "timestamp": "2025-12-12T06:59:08Z"
  },
  {
    "title": "Thai PM says he will speak to Trump late Friday on Cambodia clashes",
    "description": "BANGKOK: Thailand's caretaker Prime Minister Anutin Charnvirakul said on Friday (Dec 12) he was scheduled to speak to United States President Donald Trump late in the day, as border clash",
    "link": "https://www.channelnewsasia.com/asia/thailand-pm-anutin-call-trump-late-friday-cambodia-border-clashes-5577901",
    "timestamp": "2025-12-12T06:58:22Z"
  },
  {
    "title": "US issues new sanctions targeting Venezuela oil sector and Maduro’s family",
    "description": "The Trump administration is seeking the legal authority to seize the oil from the tanker that US forces boarded",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/12/11/us/politics/maduro-oil-sanctions-venezuela-tanker.html",
    "timestamp": "2025-12-12T06:57:17Z"
  },
  {
    "title": "The real reason behind Trump’s nasty breakup with Europe – podcast",
    "description": "This week, Donald Trump described Europe as ‘weak’ and ‘decaying’ and warned of ‘civilisational collapse’ on the continent due to immigration. His administration also published its blueprint for national security, which suggests that democracy might not be as…",
    "link": "https://biztoc.com/x/53bda82d285f3f66",
    "timestamp": "2025-12-12T06:55:21Z"
  },
  {
    "title": "BITSAT 2026 registration to begin on this day: BITS Pilani announces fresh exam schedule, details here",
    "description": "BITS Pilani has unveiled the BITSAT 2026 schedule, opening registrations on December 15, 2025, for two exam sessions. The first session runs April 15-17, with a second from May 24-26. Aspirants can aim for one or both, with the best score considered for admis…",
    "link": "https://timesofindia.indiatimes.com/education/news/bitsat-2026-registration-to-begin-on-this-day-bits-pilani-announces-fresh-exam-schedule-details-here/articleshow/125927906.cms",
    "timestamp": "2025-12-12T06:53:34Z"
  },
  {
    "title": "Are White Nationalists Driving Trump’s Immigration Policies?",
    "description": "At the end of November 2025, President Donald Trump permanently paused migration from nations he described as ‘Third World Countries.’” Then he followed up by halting all asylum claims, pausing visa issuances for Afghan nationals, and in December, he began ca…",
    "link": "https://www.counterpunch.org/2025/12/12/are-white-nationalists-driving-trumps-immigration-policies/",
    "timestamp": "2025-12-12T06:52:54Z"
  },
  {
    "title": "Charlie Kirk murder suspect appears in US court",
    "description": "Tyler Robinson, 22, was arrested the day after the 10 September.",
    "link": "https://www.thejournal.ie/charlie-kirk-murder-suspect-22-appears-in-us-court-6901452-Dec2025/",
    "timestamp": "2025-12-12T06:45:53Z"
  },
  {
    "title": "Jimmy Kimmel Has A Rich Response After Getting A Check With Trump's Name On It",
    "description": "The late-night host roasted the president over one thing he \"loves\" to do.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-ftc-settlement-amazon_n_693ba124e4b0898f02ff2c5a",
    "timestamp": "2025-12-12T06:40:25Z"
  },
  {
    "title": "Intel has tested chipmaking tools from firm with sanctioned China unit",
    "description": "Chipmaker Intel, has tested chipmaking tools this year from a toolmaker with deep roots in China and two overseas units that were targeted by US sanctions, according to two sources with direct knowledge of the matter.",
    "link": "https://www.thehindubusinessline.com/news/world/intel-has-tested-chipmaking-tools-from-firm-with-sanctioned-china-unit/article70387574.ece",
    "timestamp": "2025-12-12T06:32:45Z"
  },
  {
    "title": "Escapism or exaltation? ‘Narco-culture’ games raise concern in Mexico",
    "description": "In violence-riddled Mexico, children as young as 13 are hooked on bloody video games that vividly recreate the horrors of the country’s narco war. Some experts say it’s a way of coping. Critics, including President Claudia Sheinbaum, see it as monetized glori…",
    "link": "https://www.digitaljournal.com/world/escapism-or-exaltation-narco-culture-games-raise-concern-in-mexico/article",
    "timestamp": "2025-12-12T06:32:20Z"
  },
  {
    "title": "Will Tommy Robinson put ‘Christ back into Christmas’?",
    "description": "Often described as ‘Far Right’, Robinson is seen as an unlikely standard bearer for Christianity.",
    "link": "https://www.christiantoday.com/news/will-tommy-robinson-put-christ-back-into-christmas",
    "timestamp": "2025-12-12T06:29:00Z"
  },
  {
    "title": "Pete Buttigieg Says Trump ‘Is Not Unstoppable’ After Indiana Republicans Reject Redistricting Bill: ‘Absolutely Extraordinary’ | Video",
    "description": "\"The vice president said they have to pick a side and they did,\" the former United States Secretary of Transportation adds\nThe post Pete Buttigieg Says Trump ‘Is Not Unstoppable’ After Indiana Republicans Reject Redistricting Bill: ‘Absolutely Extraordinary’ …",
    "link": "https://www.thewrap.com/pete-buttigieg-reacts-indiana-republicans-reject-redistricting-bill-trump/",
    "timestamp": "2025-12-12T06:27:56Z"
  },
  {
    "title": "Thailand dissolves parliament, heightening political turmoil as Trump seeks to salvage ceasefire with Cambodia",
    "description": "The escalation broke the ceasefire brokered in July by Trump who threatened to halt trade talks with the two countries unless they ended the fight.",
    "link": "https://www.cnbc.com/2025/12/12/thailand-dissolves-parliament-dissolution-escalating-border-strife-tensions-cambodia.html",
    "timestamp": "2025-12-12T06:20:43Z"
  },
  {
    "title": "U.S. aid cuts disrupt life-saving treatment for starving children in Kenya",
    "description": "LOMOLEM, Kenya, Dec 12 (Reuters) - Hellen Etiman, a Kenyan pastoralist, believed her severely malnourished son would soon recover after starting a course of life-saving specialised food. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/12/12/us-aid-cuts-disrupt-life-saving-treatment-for-starving-children-in-kenya",
    "timestamp": "2025-12-12T06:16:00Z"
  },
  {
    "title": "Daniel Aruebose inquiry latest, a polarising Texas congresswoman and where is Dee Forbes?",
    "description": "Early Edition with Aideen Finnegan",
    "link": "https://www.irishtimes.com/podcasts/early-edition/daniel-aruebose-inquiry-latest-a-polarising-texas-congresswoman-and-where-is-dee-forbes/",
    "timestamp": "2025-12-12T06:13:06Z"
  },
  {
    "title": "US bringing seized tanker to port as Venezuela war fears build",
    "description": "An oil tanker seized by American forces off the Venezuelan coast will be brought to a port in the United States, the White House said Thursday, as fears mount of open conflict between the two countries.",
    "link": "https://www.hurriyetdailynews.com/us-bringing-seized-tanker-to-port-as-venezuela-war-fears-build-216726",
    "timestamp": "2025-12-12T06:11:59Z"
  },
  {
    "title": "Intel has tested chipmaking tools from firm with sanctioned China unit, sources say",
    "description": "Intel has been testing chipmaking tools from ACM Research, a firm with sanctioned China-linked units, raising national-security concerns despite no evidence of wrongdoing. Lawmakers warn the use of such equipment risks exposing sensitive U.S. technology and d…",
    "link": "https://economictimes.indiatimes.com/tech/technology/intel-has-tested-chipmaking-tools-from-firm-with-sanctioned-china-unit-sources-say/articleshow/125927249.cms",
    "timestamp": "2025-12-12T06:09:11Z"
  },
  {
    "title": "Intel has tested chipmaking tools from firm with sanctioned China unit, sources say",
    "description": "Chipmaker Intel, has tested chipmaking tools this year from a toolmaker with deep roots in China and two overseas units that were targeted by U.S. sanctions,...",
    "link": "https://finance.yahoo.com/news/exclusive-intel-tested-chipmaking-tools-060133653.html",
    "timestamp": "2025-12-12T06:01:33Z"
  },
  {
    "title": "Diarmaid Ferriter: Like Neville Chamberlain in 1938, Donald Trump is errand boy of gangsters",
    "description": "The British leader pledged ‘peace in our time’ after appeasing a tyrant – will history repeat itself?",
    "link": "https://www.irishtimes.com/opinion/2025/12/12/like-neville-chamberlain-in-1938-donald-trump-is-the-errand-boy-of-gangsters/",
    "timestamp": "2025-12-12T06:00:01Z"
  },
  {
    "title": "Beijing’s lack of criticism of latest US security strategy reflects warmer relations",
    "description": "Credibility of US security guarantee in Pacific left in question by disdainful comments about Europe",
    "link": "https://www.irishtimes.com/world/asia-pacific/2025/12/12/beijings-lack-of-criticism-of-latest-us-security-strategy-reflects-warmer-relations/",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Trump’s tariffs expose China’s fragile economy",
    "description": "The 25% tariffs on $200B of Chinese goods have caused a 28.7% drop in exports to the U.S., exposing China’s economic fragility and reliance on exploitative trade practices. With collapsing exports, a deflating property market and hidden unemployment crises, B…",
    "link": "https://www.naturalnews.com/2025-12-12-trumps-tariffs-expose-chinas-fragile-economy.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Trump administration pressures Israel to ease Syria offensive, expresses frustration toward Tel Aviv",
    "description": "A diplomatic rift is growing between the U.S. and Israel over the latter’s military actions in southern Syria, with the Trump administration frustrated by the stalled security talks and pushing for a faster resolution to avoid regional destabilization. Israel…",
    "link": "https://www.naturalnews.com/2025-12-12-trump-admin-pressures-israel-ease-syria-offensive.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Odds of Trump declassifying UFO files before end of 2025 skyrocket",
    "description": "Cryptocurrency prediction platform Polymarket saw a surge in bets that President Donald Trump will soon declassify UFO/UAP files, with large trades suggesting insider knowledge. Over $7 million was wagered, including single bets exceeding $20,000. Retired Air…",
    "link": "https://www.naturalnews.com/2025-12-12-odds-of-trump-declassifying-ufo-files-skyrocket.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "U.S. seizes oil tanker transporting SANCTIONED crude off Venezuela’s coast",
    "description": "The U.S. seized a major oil tanker off Venezuela’s coast, involving FBI, DHS and Coast Guard personnel in a dramatic helicopter-led operation. The vessel, The Skipper, was accused of transporting sanctioned crude from Venezuela and Iran, allegedly to support …",
    "link": "https://www.naturalnews.com/2025-12-12-us-seizes-oil-tanker-off-venezuela-coast.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "The new US poverty line: $140,000",
    "description": "Claim by Wall Street portfolio manager that families need $140,000 income to function goes viral",
    "link": "https://www.irishtimes.com/business/economy/2025/12/12/the-new-us-poverty-line-140000/",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Trump administration reports record 2.5 million illegal immigrants have left U.S.",
    "description": "Since January 2025, 2.5 million illegal immigrants have left the U.S.—605,000 deportations and 1.9 million voluntary departures—driven by aggressive enforcement and incentives like $1,000 cash payments and free airfare. A multimillion-dollar international cam…",
    "link": "https://www.naturalnews.com/2025-12-12-trump-administration-2m-illegal-immigrants-left-us.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Trump unveils hardline National Security Strategy, warns of “civilizational erasure” in Europe due to mass migration",
    "description": "President Trump warns that unchecked mass migration, driven by EU policies, threatens to make Western Europe “unrecognizable” by eroding its cultural foundations, national identities, and social cohesion. The U.S. National Security Strategy explicitly express…",
    "link": "https://www.naturalnews.com/2025-12-12-president-trump-unveils-hardline-national-security-strategy.html",
    "timestamp": "2025-12-12T06:00:00Z"
  },
  {
    "title": "Church nativity scenes add zip ties, gas masks and ICE to protest immigration raids",
    "description": "Nativity scenes at some churches are sparking fierce debates",
    "link": "https://abcnews.go.com/US/wireStory/church-nativity-scenes-add-zip-ties-gas-masks-128336277",
    "timestamp": "2025-12-12T05:57:59Z"
  },
  {
    "title": "Lithium May Get Much-Needed Demand Boost From Battery Storage",
    "description": "Lithium bulls are betting on energy storage systems as the next meaningful pillar of demand for the battery metal, nudging the global market back toward balance after years of oversupply.",
    "link": "https://financialpost.com/pmn/business-pmn/lithium-may-get-much-needed-demand-boost-from-battery-storage",
    "timestamp": "2025-12-12T05:54:29Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Donald Trump With All The Reasons He's Actually An Infant - HuffPost",
    "description": "Jimmy Kimmel Roasts Donald Trump With All The Reasons He's Actually An InfantHuffPost Jimmy Kimmel on Trump: ‘What a child he is’The Guardian Kimmel Goes Nuclear on Trump’s Health: ‘Something Is Wrong’The Daily Beast Jimmy Kimmel questions Trump's health, cal…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180367189",
    "timestamp": "2025-12-12T05:52:37Z"
  },
  {
    "title": "Trump 'extremely frustrated' with Russia, Ukraine over talks on war",
    "description": "U.S. President Donald Trump is \"extremely frustrated\" with Russia and Ukraine, his spokeswoman said on Thursday, as Kyiv said Washington was still pushing it to make major territorial concessions as part of its plan to end the nearly four-year war.",
    "link": "https://www.hurriyetdailynews.com/trump-extremely-frustrated-with-russia-ukraine-over-talks-on-war-216721",
    "timestamp": "2025-12-12T05:49:48Z"
  },
  {
    "title": "Trump greets Dems at 'politics aside' Congressional Ball",
    "description": "United States President Donald Trump delivered a rare reconciliatory message at this year's Congressional Ball, welcoming Democrats and Republicans alike and urging attendees to set \"all political dif...",
    "link": "https://biztoc.com/x/1ea000e0368bdeab",
    "timestamp": "2025-12-12T05:48:38Z"
  },
  {
    "title": "Trump Signals Possible Move To Eliminate Taxes On Gambling Winnings: 'Have To Think About That'",
    "description": "US President Donald Trump said on Tuesday that he might consider ending federal taxes on gambling winnings, as part of his administration’s efforts to cut taxes across the board, including on tips and overtime. According to Fox Business, when asked about the …",
    "link": "https://www.ndtvprofit.com/world/trump-signals-possible-move-to-eliminate-taxes-on-gambling-winnings-have-to-think-about-that",
    "timestamp": "2025-12-12T05:46:24Z"
  },
  {
    "title": "Flood misery for Gazans awaiting next stage of peace plan",
    "description": "Gazans in tents have been hit by heavy rain as failure to find last Israeli hostage risks derailing peace plan.",
    "link": "https://www.bbc.com/news/articles/c2lvplrxpe9o",
    "timestamp": "2025-12-12T05:43:02Z"
  },
  {
    "title": "Maduro says Trump wants Venezuela's oil. But is that the real US goal?",
    "description": "The South American nation's output has plummeted and restoring its former glory would be a heavy lift.",
    "link": "https://www.bbc.com/news/articles/cy95pr790pro",
    "timestamp": "2025-12-12T05:42:29Z"
  },
  {
    "title": "India frees up visas for Chinese professionals in key step to boost ties",
    "description": "New Delhi drops extra vetting layer, cutting approval times to under a month in bid to revive business ties and curb production losses",
    "link": "https://www.thehindubusinessline.com/news/world/india-frees-up-visas-for-chinese-professionals-in-key-step-to-boost-ties/article70387501.ece",
    "timestamp": "2025-12-12T05:42:06Z"
  },
  {
    "title": "President Donald Trump Just Delivered Incredible News for Nvidia Investors",
    "description": "Nvidia (NVDA 1.55%) has been witnessing incredible demand for its artificial intelligence (AI) chips in recent years, which has led to remarkable growth in the company's revenue and earnings. However, the company's impressive growth could have been even bette…",
    "link": "https://biztoc.com/x/e25f896b7180c19e",
    "timestamp": "2025-12-12T05:37:43Z"
  },
  {
    "title": "YouTube Now Lets US Creators Take Earnings in PayPal's Stablecoin: Report",
    "description": "YouTube has reportedly adopted the feature shortly after PayPal enabled PYUSD as a payout method for recipients in the third quarter.",
    "link": "https://decrypt.co/352125/youtube-us-creators-take-earnings-paypals-stablecoin",
    "timestamp": "2025-12-12T05:37:31Z"
  },
  {
    "title": "Abrego Garcia won release from detention. He must check in with immigration officials 14 hours later",
    "description": "Kilmar Abrego Garcia was due to check-in with immigration authorities less than 14 hours after he was released from detention on a judge’s orders",
    "link": "https://abcnews.go.com/US/wireStory/abrego-garcia-won-release-detention-check-immigration-officials-128335971",
    "timestamp": "2025-12-12T05:33:32Z"
  },
  {
    "title": "Nobel Peace Prize winner Maria Corina Machado says she will return to Venezuela and continue push for democracy",
    "description": "Venezuelan dissident Maria Corina Machado said she plans to ultimately go back home and disappear from authorities to continue fighting for democracy.",
    "link": "https://www.independent.ie/world-news/latin-america/nobel-peace-prize-winner-maria-corina-machado-says-she-will-return-to-venezuela-and-continue-push-for-democracy/a1668846888.html",
    "timestamp": "2025-12-12T05:30:00Z"
  },
  {
    "title": "Max Hastings: It is time for Europe to stop pretending that Donald Trump is not the enemy",
    "description": "Donald Trump describes Europe as a “decaying” continent, its leaders as “weak”. He attributes blame for the continuation of the Ukraine war to the victim country and to European governments.",
    "link": "https://www.independent.ie/opinion/comment/max-hastings-it-is-time-for-europe-to-stop-pretending-that-donald-trump-is-not-the-enemy/a1511586648.html",
    "timestamp": "2025-12-12T05:30:00Z"
  },
  {
    "title": "Suspect in murder of Charlie Kirk makes his first court appearance",
    "description": "Tyler Robinson, the accused killer of conservative American activist Charlie Kirk, made his first in-person court appearance yesterday as his lawyers sought to limit media access in his high-profile case.",
    "link": "https://www.independent.ie/world-news/north-america/suspect-in-murder-of-charlie-kirk-makes-his-first-court-appearance/a548610468.html",
    "timestamp": "2025-12-12T05:30:00Z"
  },
  {
    "title": "Trump blocks state AI regulations with federal order",
    "description": "President Donald Trump just handed technology giants exactly what they’ve been lobbying for by signing an executive order that essentially kills state-level artificial intelligence regulations across America. The move centralizes AI oversight under federal co…",
    "link": "https://rollingout.com/2025/12/12/trump-ai-regulations/",
    "timestamp": "2025-12-12T05:27:03Z"
  },
  {
    "title": "Immigration crackdown leaves teens to care for siblings after parents get detained",
    "description": "An immigration crackdown in Louisiana has forced some teenagers to grow up fast after their parents were arrested by federal agents",
    "link": "https://abcnews.go.com/US/wireStory/immigration-crackdown-leaves-teens-care-siblings-after-parents-128335633",
    "timestamp": "2025-12-12T05:26:00Z"
  },
  {
    "title": "Susie Wiles Recognized by Forbes as One of World’s Most Powerful Women",
    "description": "White House Chief of Staff Susie Wiles has been named to Forbes’ 2025 list of the World’s Most Powerful Women, standing out as the only American woman in politics to be included this year.\nThe post Susie Wiles Recognized by Forbes as One of World’s Most Power…",
    "link": "https://www.breitbart.com/politics/2025/12/11/susie-wiles-recognized-forbes-one-worlds-most-powerful-women/",
    "timestamp": "2025-12-12T05:25:05Z"
  },
  {
    "title": "A day after release, Kilmar Abrego Garcia must check in with immigration officials",
    "description": "Kilmar Abrego Garcia has walked away after a scheduled appointment at an Immigration and Customs Enforcement field office after a federal judge ordered that officials could not detain him",
    "link": "https://www.wsbradio.com/news/national/abrego-garcia-won/DZDHTFWNPQYYVPDXGDNO2F2XIA/",
    "timestamp": "2025-12-12T05:24:15Z"
  },
  {
    "title": "Israel's Syria actions delaying SDF deal with Damascus: Turkish FM",
    "description": "Foreign Minister Hakan Fidan stated that Israel's heightened activities in Syria are prompting the YPG/PKK-led Syrian Democratic Forces (SDF) to postpone fulfilling a March 10 agreement with the Syrian government.",
    "link": "https://www.hurriyetdailynews.com/israels-syria-actions-delaying-sdf-deal-with-damascus-turkish-fm-216719",
    "timestamp": "2025-12-12T05:21:57Z"
  },
  {
    "title": "Thailand-Cambodia fighting enters 5th day, Thai PM confirms Trump call",
    "description": "Cambodia rejects claims of preparing to launch Chinese-made missiles and using foreign fighters in border clashes.",
    "link": "https://www.aljazeera.com/news/2025/12/12/cambodia-thailand-fighting-enters-5th-day-thai-pm-confirms-trump-call",
    "timestamp": "2025-12-12T05:20:30Z"
  },
  {
    "title": "Indiana Lt. Gov. Confirms Trump Threatened Entire State if It Didn’t Redraw Congressional Map",
    "description": "Indiana Lt. Gov. Micah Beckwith said the Trump administration threatened the state if the Republican-controlled legislature failed to gerrymander its congressional map.\nThe post Indiana Lt. Gov. Confirms Trump Threatened Entire State if It Didn’t Redraw Congr…",
    "link": "https://www.mediaite.com/politics/indiana-lt-gov-confirms-trump-threatened-entire-state-if-it-didnt-redraw-congressional-map/",
    "timestamp": "2025-12-12T05:18:23Z"
  },
  {
    "title": "Spectacular loss by Honduras' governing party spurs reflection and criticism",
    "description": "Honduras’ governing LIBRE party experienced a spectacular collapse in the presidential election, going from more than 50% of the vote four years ago to less than 20% this time",
    "link": "https://abcnews.go.com/International/wireStory/spectacular-loss-honduras-governing-party-spurs-reflection-criticism-128335609",
    "timestamp": "2025-12-12T05:17:41Z"
  },
  {
    "title": "Israel is Sinking into the Abyss of Netanyahu’s Dictatorship",
    "description": "Oakland, Ca. (Special to Informed Comment; Feature) - It appears unlikely that the Israeli Justice Ministry will approve a pardon for Israeli PM Benjamin 'Bibi' Netanyahu, related to his criminal charges for blackmail, corruption and breach of public trust. B…",
    "link": "https://www.juancole.com/2025/12/sinking-netanyahus-dictatoship.html",
    "timestamp": "2025-12-12T05:15:06Z"
  },
  {
    "title": "New judicial panels to hear Wisconsin redistricting lawsuits for the first time",
    "description": "Two lawsuits seeking to redraw Wisconsin’s congressional districts are scheduled to be discussed in court as a pair of three-judge panels never-before-used in the state meet for the first time",
    "link": "https://abcnews.go.com/Politics/wireStory/new-judicial-panels-hear-wisconsin-redistricting-lawsuits-time-128335587",
    "timestamp": "2025-12-12T05:10:32Z"
  },
  {
    "title": "Ryan Crosswell quit Trump's DOJ. Now his resignation letter is part of his stump speech for Congress",
    "description": "Ryan Crosswell, a former federal prosecutor, is running for Congress after resigning when the Trump administration dropped corruption charges against New York City Mayor Eric Adams",
    "link": "https://abcnews.go.com/Politics/wireStory/ryan-crosswell-quit-trumps-doj-now-resignation-letter-128335542",
    "timestamp": "2025-12-12T05:10:26Z"
  },
  {
    "title": "Trump as Nero: The Bible Condemns Rich Predators, Not Poor Trans Lovers",
    "description": "( Tomdispatch.com ) - As more of the Epstein files are released, reminding us of Donald Trump’s close association with Jeffrey Epstein and the young people he abused and trafficked, as well as the president’s ongoing array of misogynist insults and actions (l…",
    "link": "https://www.juancole.com/2025/12/condemns-predators-lovers.html",
    "timestamp": "2025-12-12T05:06:29Z"
  },
  {
    "title": "Democrats grill homeland security chief over immigration crackdown",
    "description": "Democratic lawmakers grill Homeland Security chief Kristi Noem over the Trump administration’s harsh immigration crackdown, calling for her resignation.\n\nRead More: https://punchng.com/democrats-grill-homeland-security-chief-over-immigration-crackdown/",
    "link": "https://punchng.com/democrats-grill-homeland-security-chief-over-immigration-crackdown/",
    "timestamp": "2025-12-12T05:05:49Z"
  },
  {
    "title": "Trump led Republicans to power in 2024. But 2026 could be a different story",
    "description": "Republican strategists face a tough road ahead.  Recent election losses signal a shift in voter sentiment.  President Trump's core issues like the economy, immigration, and crime are no longer resonating as strongly.  This presents a significant challenge for…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-led-republicans-to-power-in-2024-but-2026-could-be-a-different-story/articleshow/125926334.cms",
    "timestamp": "2025-12-12T05:04:25Z"
  }
]