[
  {
    "title": "Trump administration asks Supreme Court to allow firing of Fed Governor Lisa Cook",
    "description": "President Donald Trump has cited allegations of mortgage fraud by Federal Reserve Governor Lisa Cook in seeking to remove her.",
    "link": "https://www.cnbc.com/2025/09/18/trump-supreme-court-lisa-cook-fed.html",
    "timestamp": "2025-09-18T15:48:25Z"
  },
  {
    "title": "FCC chief considers charging Kimmel, ABC with spreading misinformation over jokes, remarks about the ideology of Charlie Kirk assassin",
    "description": "“We’re reinvigorating the FCC’s enforcement of the public interest,” Brendan Carr said on CNBC, “and I think that’s a good thing.”",
    "link": "https://fortune.com/2025/09/18/jimmy-kimmel-misinformation-fcc-brendan-carr-abc-disney/",
    "timestamp": "2025-09-18T15:46:48Z"
  },
  {
    "title": "Prince William and Kate Middleton Hold Hands After State Banquet in Rare Pic",
    "description": "Prince William and Kate Middleton had a behind-the-scenes moment during the U.S state banquet.",
    "link": "https://www.today.com/popculture/prince-william-kate-middleton-holding-hands-photo-state-banquet-rcna232117",
    "timestamp": "2025-09-18T15:46:46Z"
  },
  {
    "title": "Trump asks Supreme Court for emergency order to remove Fed Gov. Cook",
    "description": "President Donald Trump's administration is asking the Supreme Court for an emergency order to remove Lisa Cook from the Federal Reserve’s board of governors. The Republican administration turned to the high court Thursday after an appeals court refused to go …",
    "link": "https://apnews.com/article/supreme-court-trump-lisa-cook-federal-reserve-d7cd7bf7b8bca591b1748591836c3645",
    "timestamp": "2025-09-18T15:46:35Z"
  },
  {
    "title": "Pro-MAGA Reporter Sends Trump on Bonkers Anti-Democrat Rant at Presser With UK Prime Minister",
    "description": "Pro-MAGA journalist Brian Glenn sparked an anti-Joe Biden tirade from President Donald Trump when he asked about the former president's use of an autopen as the current president stood with U.K. Prime Minister Keir Starmer.\nThe post Pro-MAGA Reporter Sends Tr…",
    "link": "https://www.mediaite.com/media/news/pro-maga-reporter-sends-trump-on-bonkers-anti-democrat-rant-at-presser-with-uk-prime-minister/",
    "timestamp": "2025-09-18T15:44:38Z"
  },
  {
    "title": "Trump goes off on rambling 'autopen' conspiracy rant at UK press conference",
    "description": "Prompted by an off-the-wall question from the boyfriend of Rep. Marjorie Taylor Greene (R-GA), Donald Trump regaled British and American reporters with an “autopen” conspiracy rant during a press conference in the UK.Long a staple of his U.S. press availabili…",
    "link": "https://www.rawstory.com/trump-autopen-conspiracy-uk-rant/",
    "timestamp": "2025-09-18T15:44:27Z"
  },
  {
    "title": "‘Lots of gasps and dropped jaws’: Stephen Colbert learned of Jimmy Kimmel’s suspension while taping his own canceled CBS show",
    "description": "ABC’s suspension of Jimmy Kimmel’s show following comments he made about the killing of Charlie Kirk set off a flood of reactions, including from President Donald Trump and a fellow late-night host whose show was canceled after he criticized a deal between th…",
    "link": "https://biztoc.com/x/94eff01386b57f97",
    "timestamp": "2025-09-18T15:44:22Z"
  },
  {
    "title": "JD Vance: \"Under Donald Trump's leadership, we may disagree with your views, but we will fight to defend your right to offer it in the public square, agree or disagree.*\" [Unlikely]",
    "description": "JD Vance: \"Under Donald Trump's leadership, we may disagree with your views, but we will fight to defend your right to offer it in the public square, agree or disagree.*\"",
    "link": "https://www.fark.com/comments/13815904/JD-Vance-Under-Donald-Trumps-leadership-we-may-disagree-with-your-views-but-we-will-fight-to-defend-your-right-to-offer-it-in-public-square-agree-disagree",
    "timestamp": "2025-09-18T15:44:16Z"
  },
  {
    "title": "Kimmel's suspension is the latest display of Trump's growing power over the US media landscape",
    "description": "President Donald Trump has intensified his efforts to reshape the media landscape, using threats, lawsuits and government pressure.",
    "link": "https://www.clickondetroit.com/business/2025/09/18/kimmels-suspension-is-the-latest-display-of-trumps-growing-power-over-the-us-media-landscape/",
    "timestamp": "2025-09-18T15:43:22Z"
  },
  {
    "title": "Trump Pushes Back On British Journo Asking Him to Pressure Netanyahu on Gaza",
    "description": "“But you do understand about October 7th. You do understand, one of the worst days in the history of humanity. What happened—I have seen the tapes\"\nThe post Trump Pushes Back On British Journo Asking Him to Pressure Netanyahu on Gaza first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/news/trump-pushes-back-on-british-journo-asking-him-to-pressure-netanyahu-on-gaza/",
    "timestamp": "2025-09-18T15:43:21Z"
  },
  {
    "title": "Chinese Defense Minister: Beijing 'Always Ready' to Attack Taiwan",
    "description": "Chinese Defense Minister Dong Jun delivered his first high-profile public address in months on Thursday, emphasizing the Communist Party's resolve to destroy Taiwanese sovereignty.\nThe post Chinese Defense Minister: Beijing ‘Always Ready’ to Attack Taiwan app…",
    "link": "https://www.breitbart.com/asia/2025/09/18/chinese-defense-minister-beijing-always-ready-attack-taiwan/",
    "timestamp": "2025-09-18T15:42:25Z"
  },
  {
    "title": "US Government’s Intel Stake Worth $14 Billion After Nvidia Deal",
    "description": "The US government’s bet on Intel Corp. is paying off in a big way after a surprise investment from Nvidia Corp. sparked the biggest rally in the chipmaker’s shares in nearly four decades.",
    "link": "https://www.livemint.com/companies/company-results/us-government-s-intel-stake-worth-14-billion-after-nvidia-deal-11758210116209.html",
    "timestamp": "2025-09-18T15:41:55Z"
  },
  {
    "title": "Trump says he’ll designate antifa as a terrorist group but offers few details",
    "description": "Antifa, short for “anti-fascists,” is not a singular entity.",
    "link": "https://www.denverpost.com/2025/09/18/trump-antifa/",
    "timestamp": "2025-09-18T15:41:13Z"
  },
  {
    "title": "Trump says he’ll designate antifa as a terrorist group but offers few details",
    "description": "Antifa, short for “anti-fascists,” is not a singular entity.",
    "link": "https://www.bostonherald.com/2025/09/18/trump-antifa/",
    "timestamp": "2025-09-18T15:41:13Z"
  },
  {
    "title": "ICE Detains Dad for Months After He Was Shot When Someone Tried to Rob Him",
    "description": "Felipe de Jesus Hernandez Marcelo was taken by ICE after going to the police to pick up his belongings after being released from the hospital.",
    "link": "https://www.newsweek.com/ice-detains-man-released-hospital-2131933",
    "timestamp": "2025-09-18T15:40:33Z"
  },
  {
    "title": "Cruz Falsely Labels Right-Wing Shooter As 'Leftist'",
    "description": "Sen. Ted Cruz tried to portray the murderer who killed a Democratic Minnesota lawmaker and her husband as a \"leftist.\" \nHe used this lie to claim political violence only comes from the left. \nNewshound Ellen writes, \"But despite the dangerously irresponsible …",
    "link": "https://crooksandliars.com/2025/09/ted-cruz-claimed-murderer-who-had-liberal",
    "timestamp": "2025-09-18T15:39:01Z"
  },
  {
    "title": "Fed cuts interest rates a quarter point",
    "description": "‘The cut suggests a broader shift toward concern about cracks forming in the job market’",
    "link": "https://theweek.com/business/economy/fed-cuts-interest-rates-quarter-point",
    "timestamp": "2025-09-18T15:38:52Z"
  },
  {
    "title": "The Homelessness Crisis Under Trump Will Only Get Worse",
    "description": "Mattea Kramer, Dr. Sean Fogler\n\n\n\nThe Trump administration is counting on us to renounce those living on the streets, while struggling with their mental health or the cost of housing (or both).\r\n\n\r\n\n\nThe post The Homelessness Crisis Under Trump Will Only Get …",
    "link": "https://www.thenation.com/article/society/homeless-crisis-trump-housing/",
    "timestamp": "2025-09-18T15:38:03Z"
  },
  {
    "title": "‘We Want That Base Back’: Trump Says US Working To Take Back Massive Air Base Abandoned in Afghanistan",
    "description": "Trump announced Thursday that the U.S. is trying to regain an Afghanistan airfield abandoned during Biden's disastrous withdraw from the nation.",
    "link": "https://dailycaller.com/2025/09/18/we-want-that-base-back-trump-says-us-working-to-take-back-massive-air-base-abandoned-in-afghanistan/",
    "timestamp": "2025-09-18T15:37:15Z"
  },
  {
    "title": "The Brief – Europe’s new monarch",
    "description": "Entertaining as the Windsor spectacle might have been to those still bitter over Brexit, the sad truth is that there's not a government in Europe that would follow the British example",
    "link": "https://www.euractiv.com/opinion/the-brief-europes-new-monarch/",
    "timestamp": "2025-09-18T15:36:48Z"
  },
  {
    "title": "US Supreme Court to hear Trump's tariffs case on November 5",
    "description": "The U.S. Supreme Court will hear oral arguments on November 5 regarding the legality of Donald Trump's global tariffs, a key aspect of his economic policy. This decision follows a lower court ruling that Trump exceeded his authority in imposing these tariffs …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-supreme-court-to-hear-trumps-tariffs-case-on-november-5/articleshow/123980068.cms",
    "timestamp": "2025-09-18T15:36:20Z"
  },
  {
    "title": "Donald Trump Doubles Down on Jimmy Kimmel Insults, Denies ‘Free Speech’ Infringement: He Was ‘Fired for Lack of Talent’",
    "description": "Donald Trump has offered further applause for ABC’s shock decision to take “Jimmy Kimmel Live!” off air indefinitely over comments about the killing of conservative activist Charlie Kirk that were deemed “insensitive.” Speaking at a press conference in London…",
    "link": "https://variety.com/2025/tv/global/donald-trump-jimmy-kimmel-denies-free-speech-infringement-1236523342/",
    "timestamp": "2025-09-18T15:35:44Z"
  },
  {
    "title": "The unsettling consequence of Trump designating antifa as a ‘major terrorist organization’",
    "description": "Five years after Donald Trump tried to designate antifa as a terrorist organization, he's giving it another try. The sequel will likely be worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/unsettling-consequence-trump-designating-antifa-major-terrorist-organi-rcna232143",
    "timestamp": "2025-09-18T15:35:33Z"
  },
  {
    "title": "Kamala Harris says Pete Buttigieg would have been ideal running mate if she was a straight white man",
    "description": "Former US vice president Kamala Harris has offered some insight into her selection process for a running mate in last year’s Presidential election, including sharing her thoughts on gay politician Pete Buttigieg. Kamala Harris, who served as vice president un…",
    "link": "https://www.thepinknews.com/2025/09/18/kamala-harris-pete-buttigieg-vp/",
    "timestamp": "2025-09-18T15:34:48Z"
  },
  {
    "title": "Royals, Maga and tech CEOs: What we learned from state banquet guest list",
    "description": "The event is as much about diplomacy as it is about fine dining.",
    "link": "https://www.bbc.com/news/articles/cp98031vyjko",
    "timestamp": "2025-09-18T15:34:16Z"
  },
  {
    "title": "Chipmaker Nvidia to invest $5bn in rival Intel",
    "description": "The two American chipmakers will partner to make personal computer and data centre chips, in a lifeline for Intel as it struggles to profit from the AI boom.",
    "link": "https://www.bbc.com/news/articles/c4gjd1mnjpyo",
    "timestamp": "2025-09-18T15:34:09Z"
  },
  {
    "title": "Uganda has signed a deal with the US to take asylum seekers – what’s behind it and what’s at stake",
    "description": "The US is not alone in its attempts to send asylum seekers to countries in Africa.",
    "link": "https://theconversation.com/uganda-has-signed-a-deal-with-the-us-to-take-asylum-seekers-whats-behind-it-and-whats-at-stake-265545",
    "timestamp": "2025-09-18T15:34:04Z"
  },
  {
    "title": "U.S. economy is plunging in recession? Economists make stunning claims",
    "description": "Recession in the U.S economy is a reality as economists are making predictions.",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-economy-is-plunging-in-recession-economists-make-stunning-claims/articleshow/123979947.cms",
    "timestamp": "2025-09-18T15:32:10Z"
  },
  {
    "title": "Supreme Court Issues Major Announcement",
    "description": "Small businesses and states challenging the tariffs say Trump illegally invoked emergency powers to levy import taxes on goods.",
    "link": "https://www.newsweek.com/trump-tariffs-supreme-court-arguments-court-update-2131983",
    "timestamp": "2025-09-18T15:31:24Z"
  },
  {
    "title": "U.K. Prime Minister Practically Begs Trump to Be Tougher on Putin",
    "description": "America’s allies have resorted to practically begging Donald Trump to be harder on Russia.During a joint press conference Thursday, British Prime Minister Keir Starmer pushed back against the U.S. president’s interpretation of the Russia-Ukraine conflict, mak…",
    "link": "https://newrepublic.com/post/200635/donald-trump-uk-prime-minister-begs-tougher-putin",
    "timestamp": "2025-09-18T15:31:23Z"
  },
  {
    "title": "Harris says Buttigieg was her ‘first choice’ for 2024 running mate but the pairing was too risky",
    "description": "She wrote that America wasn't ready for the pairing.",
    "link": "https://www.bostonherald.com/2025/09/18/kamala-harris-buttigieg/",
    "timestamp": "2025-09-18T15:31:00Z"
  },
  {
    "title": "FTC files bombshell suit against Ticketmaster that seeks billions in fines",
    "description": "The Federal Trade Commission filed a lawsuit against Ticketmaster on Thursday, accusing the online broker of raking in profits through exorbitant fees and turning a blind eye as bots illegally resell millions of tickets to customers.",
    "link": "https://nypost.com/2025/09/18/business/ftc-files-bombshell-suit-against-ticketmaster-that-seeks-billions-in-fines/",
    "timestamp": "2025-09-18T15:30:29Z"
  },
  {
    "title": "Trump Opposes Political Violence Only When It Comes From the Left",
    "description": "Charlie Kirk’s assassination was a tragedy. It is also an opportunity for conservatives who hope to silence their political rivals.",
    "link": "https://www.theatlantic.com/politics/archive/2025/09/trump-political-violence-charlie-kirk/684253/",
    "timestamp": "2025-09-18T15:30:05Z"
  },
  {
    "title": "SCOOP: Iryna Zarutska stabbing fuels transit safety overhaul talks in House",
    "description": "House lawmakers to meet with transit and police leaders after a deadly Charlotte stabbing raised alarms about safety on U.S. public transit.",
    "link": "https://www.foxnews.com/politics/scoop-iryna-zarutska-stabbing-fuels-transit-safety-overhaul-talks-house",
    "timestamp": "2025-09-18T15:29:42Z"
  },
  {
    "title": "‘Lots of gasps and dropped jaws’: Stephen Colbert learned of Jimmy Kimmel’s suspension while taping his own canceled CBS show",
    "description": "President Trump called it “Great News for America: The ratings challenged Jimmy Kimmel Show is CANCELLED.\" (The show was suspended, not cancelled.)",
    "link": "https://fortune.com/2025/09/18/jimmy-kimmel-suspension-reactions-colbert-learned-while-taping/",
    "timestamp": "2025-09-18T15:28:57Z"
  },
  {
    "title": "Trump says US seeking control of Bagram air base given up in Afghanistan withdrawal",
    "description": "During a joint news conference with British Prime Minister Keir Starmer, President Donald Trump stated the United States is actively pursuing the return of Bagram air base in Afghanistan. Trump emphasized the strategic importance of the base, particularly its…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-us-seeking-control-of-bagram-air-base-given-up-in-afghanistan-withdrawal/articleshow/123979967.cms",
    "timestamp": "2025-09-18T15:28:40Z"
  },
  {
    "title": "Trump Wildly Claims Jimmy Kimmel Was ‘Fired For Lack of Talent’ When Pressed on Free Speech in the US",
    "description": "President Donald Trump insisted that the recently-suspended Jimmy Kimmel was actually \"fired\" due to an apparent \"lack of talent.\"\nThe post Trump Wildly Claims Jimmy Kimmel Was ‘Fired For Lack of Talent’ When Pressed on Free Speech in the US first appeared on…",
    "link": "https://www.mediaite.com/politics/trump-wildly-claims-jimmy-kimmel-was-fired-for-lack-of-talent-when-pressed-on-free-speech-in-the-us/",
    "timestamp": "2025-09-18T15:28:06Z"
  },
  {
    "title": "Kimmel said 'horrible thing' about Charlie Kirk, Trump says",
    "description": "CHEQUERS, England (Reuters) -U.S. President Donald Trump on Thursday praised ABC's decision to pull \"Jimmy Kimmel Live\" off the air, saying the late-night television host had said \"a horrible thing\" about assassinated political activist Charlie Kirk. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/09/18/kimmel-said-039horrible-thing039-about-charlie-kirk-trump-says",
    "timestamp": "2025-09-18T15:28:00Z"
  },
  {
    "title": "Kimmel's future hangs in balance after ABC suspends his late-night show",
    "description": "Jimmy Kimmel’s television future is hanging in the balance after ABC suspended his late-night show following the host’s comments about Charlie Kirk’s killing. The comments prompted dozens of stations to say they wouldn’t air the show, a move that was cheered …",
    "link": "https://apnews.com/article/jimmy-kimmel-show-suspended-charlie-kirk-2c79d56fa53779014f2bb2ed9e47da1f",
    "timestamp": "2025-09-18T15:27:58Z"
  },
  {
    "title": "Bitcoin Spot ETF Records $51M Outflow Snaps 7-Day Inflow Streak as ETH Bleeds Again",
    "description": "Bitcoin spot exchange-traded funds (ETFs) in the United States recorded their first significant outflow in over a week, with $51.28 million leaving the...",
    "link": "https://cryptonews.com/news/bitcoin-spot-etf-records-51m-outflow-snaps-7-day-inflow-streak-as-eth-bleeds-again/",
    "timestamp": "2025-09-18T15:27:30Z"
  },
  {
    "title": "Access To Key Student Loan Payment Plan Delayed By Department Of Education",
    "description": "The department’s delay may be preventing certain borrowers from accessing legally authorized federal student loan forgiveness.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/09/18/access-to-key-student-loan-payment-plan-delayed-by-department-of-education/",
    "timestamp": "2025-09-18T15:27:21Z"
  },
  {
    "title": "Tesla, Inc. (TSLA)’s Board Chair Dismisses Concerns About Elon Musk’s Political Activities",
    "description": "Tesla, Inc. (NASDAQ:TSLA) is among the 15 Stocks ChatGPT Predicts Could Make You Wealthy in 5 Years. Recently, board chair Robyn Denholm dismissed concerns...",
    "link": "https://finance.yahoo.com/news/tesla-inc-tsla-board-chair-152553193.html",
    "timestamp": "2025-09-18T15:25:53Z"
  },
  {
    "title": "Oval office photos contradict Trump's latest Epstein scramble",
    "description": "President Donald Trump Thursday said \"I don't know him\" in response to a question about Britain's ambassador to the United States, Peter Mandelson, who was fired this month over his connection to the financier and convicted sex offender Jeffrey Epstein. \"And …",
    "link": "https://www.rawstory.com/epstein-2674006666/",
    "timestamp": "2025-09-18T15:25:40Z"
  },
  {
    "title": "Bug Spray Applied to Jimmy Kimmel",
    "description": "Moonbats are used to getting their way. They are not used to being held accountable. This accounts for their characteristic smug arrogance. But times are changing. Quintessential leftist a-hole Jimmy Kimmel has been canned. Sneered Kimmel on his show: “We … C…",
    "link": "https://moonbattery.com/bug-spray-applied-to-jimmy-kimmel/",
    "timestamp": "2025-09-18T15:24:55Z"
  },
  {
    "title": "ABC shelves ‘Kimmel Live’ after Trump FCC threat",
    "description": "‘A free and democratic society cannot silence comedians because the president doesn’t like what they say’",
    "link": "https://theweek.com/politics/abc-shelves-kimmel-trump-fcc-threat",
    "timestamp": "2025-09-18T15:23:42Z"
  },
  {
    "title": "Wesley Hunt's Chances of Winning Texas GOP Senate Primary—Poll",
    "description": "A new poll found how Hunt, a Texas representative, may fare in the primary against Senator Cornyn and Attorney General Paxton.",
    "link": "https://www.newsweek.com/wesley-hunt-chances-winning-texas-gop-senate-primary-2131934",
    "timestamp": "2025-09-18T15:23:30Z"
  },
  {
    "title": "Trump Says He Disagrees With Starmer Bid to Recognize Palestine",
    "description": "Donald Trump reaffirmed his opposition to a looming UK decision to recognize a Palestinian state, but the US president passed up the chance to personally urge Prime Minister Keir Starmer to reconsider the move.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-he-disagrees-with-starmer-bid-to-recognize-palestine",
    "timestamp": "2025-09-18T15:23:24Z"
  },
  {
    "title": "Trump Says May Extend China Truce Alongside TikTok Talks With Xi",
    "description": "President Donald Trump indicated he could further extend his trade truce with Chinese President Xi Jinping when the leaders speak on Friday, in addition to brokering a sale for TikTok’s US operations.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-may-extend-china-truce-alongside-tiktok-talks-with-xi",
    "timestamp": "2025-09-18T15:23:04Z"
  },
  {
    "title": "EU Plans to Phase Out Russian LNG More Quickly After Trump Call",
    "description": "The European Union is planning measures to accelerate the bloc’s phaseout of Russian liquefied natural gas, just days after US President Donald Trump called on the EU to do more to curb Moscow’s energy trade.",
    "link": "https://financialpost.com/pmn/business-pmn/eu-plans-to-phase-out-russian-lng-more-quickly-after-trump-call",
    "timestamp": "2025-09-18T15:22:50Z"
  },
  {
    "title": "Tucker Carlson Urges 'Civil Disobedience' if Trump DOJ Targets Hate Speech",
    "description": "\"You hope Charlie Kirk's death won't be used by...bad actors to create a society that was the opposite of the one he worked to build,\" Carlson said.",
    "link": "https://www.newsweek.com/tucker-carlson-jimmy-kimmel-abc-trump-free-speech-2131881",
    "timestamp": "2025-09-18T15:22:43Z"
  },
  {
    "title": "Fox’s Peter Doocy Grills UK Prime Minister on Recognizing Palestine: Isn’t that ‘Rewarding Hamas?’",
    "description": "Peter Doocy pressed Keir Starmer on his decision to recognize Palestine as a state and why exactly he's waiting until after a visit from Donald Trump to do so.\nThe post Fox’s Peter Doocy Grills UK Prime Minister on Recognizing Palestine: Isn’t that ‘Rewarding…",
    "link": "https://www.mediaite.com/media/tv/foxs-peter-doocy-grills-uk-prime-minister-on-recognizing-palestine-isnt-that-rewarding-hamas/",
    "timestamp": "2025-09-18T15:21:21Z"
  },
  {
    "title": "Melania Trump Chooses Her Go-to Designer Ballet Flats for Meeting With Kate Middleton in England",
    "description": "On Friday, Melania Trump met with Kate Middleton in Windsor, England. The first lady opted for Roger Vivier's signature ballet flat for the outing.",
    "link": "http://wwd.com/footwear-news/shoe-trends/melania-trump-roger-vivier-flats-kate-middleton-england-1238202218/",
    "timestamp": "2025-09-18T15:21:17Z"
  },
  {
    "title": "India Praises ‘Positive’ and ‘Forward-Looking’ Trade Talks with U.S.",
    "description": "The Indian Ministry of Commerce and Industry said on Tuesday that trade discussions with a U.S. delegation to New Delhi were “positive” and “forward-looking.”\nThe post India Praises ‘Positive’ and ‘Forward-Looking’ Trade Talks with U.S. appeared first on Brei…",
    "link": "https://www.breitbart.com/economy/2025/09/18/india-praises-positive-and-forward-looking-trade-talks-with-u-s/",
    "timestamp": "2025-09-18T15:21:08Z"
  },
  {
    "title": "Jimmy Kimmel Expressed Hope That if Trump Came After Him, Those on the Right ‘Will Support My Right’ to Free Speech — but the Opposite Has Happened",
    "description": "Call Jimmy Kimmel naive. In an interview this summer with Variety for a story examining Donald Trump’s attacks on media companies and journalists, Kimmel was asked if he was worried that the Trump administration would start coming after comedians in the same …",
    "link": "https://variety.com/2025/tv/news/jimmy-kimmel-hoped-right-support-free-speech-trump-charlie-kirk-1236523250/",
    "timestamp": "2025-09-18T15:20:48Z"
  },
  {
    "title": "The Biggest Takeaways From The Case Against Adnan Syed Episode 5",
    "description": "Six years after it premiered, ‘The Case Against Adnan Syed’ is back with a new bonus episode. Here are the biggest takeaways, including a new suspect in the case.",
    "link": "http://www.vulture.com/article/the-case-against-adnan-syed-episode-5-details.html",
    "timestamp": "2025-09-18T15:20:40Z"
  },
  {
    "title": "Cleveland-Cliffs (CLF) Declines 3.67% as Investors Await US-UK Steel Trade Deal",
    "description": "We recently published 10 Big Names Investors Are Dumping. Cleveland-Cliffs Inc. (NYSE:CLF) is one of the worst performers on Wednesday. Shares of Cleveland...",
    "link": "https://finance.yahoo.com/news/cleveland-cliffs-clf-declines-3-152023756.html",
    "timestamp": "2025-09-18T15:20:23Z"
  },
  {
    "title": "Starbucks says customers can ask for political names on drinks after a viral video of a barista declining to write the name Charlie Kirk on a cup",
    "description": "A viral TikTok showed a Starbucks barista refusing to write Charlie Kirk's name on a customer's drink. Some baristas say they feel trapped.",
    "link": "https://www.businessinsider.com/charlie-kirk-starbucks-drink-mint-majesty-tea-2025-9",
    "timestamp": "2025-09-18T15:20:19Z"
  },
  {
    "title": "In Charlie Kirk's name: Trump officials signal move to limit free speech (Kaye Wiggins/Financial Times)",
    "description": "Kaye Wiggins / Financial Times:\nIn Charlie Kirk's name: Trump officials signal move to limit free speech  —  White House shifts from defending dissent to vowing crackdown on ‘hateful’ rhetoric in wake of killing  —  Among President Donald Trump's first execut…",
    "link": "https://www.memeorandum.com/250918/p55",
    "timestamp": "2025-09-18T15:20:01Z"
  },
  {
    "title": "Kimmel’s future hangs in balance after ABC suspends his late-night show over Charlie Kirk comments",
    "description": "ABC has aired “Jimmy Kimmel Live!” since 2003.",
    "link": "https://www.bostonherald.com/2025/09/18/jimmy-kimmel-future/",
    "timestamp": "2025-09-18T15:19:47Z"
  },
  {
    "title": "Kimmel’s future hangs in balance after ABC suspends his late-night show over Charlie Kirk comments",
    "description": "ABC has aired “Jimmy Kimmel Live!” since 2003.",
    "link": "https://www.denverpost.com/2025/09/18/jimmy-kimmel-future/",
    "timestamp": "2025-09-18T15:19:47Z"
  },
  {
    "title": "Trump-Appointed Judge Hands Trump an L in Court",
    "description": "A federal judge appointed by Trump dealt the president a legal setback by halting the administration’s attempt to deport Guatemalan children.\nThe post Trump-Appointed Judge Hands Trump an L in Court first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-appointed-judge-hands-trump-an-l-in-court/",
    "timestamp": "2025-09-18T15:18:44Z"
  },
  {
    "title": "WATCH: Coast Guard seizes cocaine, suspected narco-terrorists in Pacific Viper raid",
    "description": "The Coast Guard has seized more than 75,000 pounds of cocaine as part of its new Operation Pacific Viper, which the Trump administration unveiled in August.",
    "link": "https://www.foxnews.com/politics/watch-coast-guard-seizes-cocaine-suspected-narco-terrorists-pacific-viper-raid",
    "timestamp": "2025-09-18T15:17:22Z"
  },
  {
    "title": "Hannity Claims No Conservative Wanted Kimmel Fired — Completely Ignoring Trump Doing Just That",
    "description": "Hannity claimed no conservative called for Jimmy Kimmel’s firing. Trump, FCC’s Brendan Carr, and Fox contributors explicitly did.\nThe post Hannity Claims No Conservative Wanted Kimmel Fired — Completely Ignoring Trump Doing Just That first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/tv/hannity-claims-no-conservative-wanted-kimmel-fired-completely-ignoring-trump-doing-just-that/",
    "timestamp": "2025-09-18T15:17:00Z"
  },
  {
    "title": "Dogecoin Is Still Here—And Now There's an ETF That Tracks It",
    "description": "The Rex-Osprey DOGE ETF, which uses the ticker symbol \"DOJE,\" is the first Dogecoin ETF listed in the U.S. market, and it's in some ways hard to believe it...",
    "link": "https://www.investopedia.com/dogecoin-is-still-here-and-now-there-s-an-etf-that-tracks-it-11806181",
    "timestamp": "2025-09-18T15:16:55Z"
  },
  {
    "title": "'Call that free speech or not': Trump contradicts his own team on Jimmy Kimmel firing",
    "description": "President Donald Trump's reasons for the firing of late-night host Jimmy Kimmel are conflicting with statements from Federal Communications Commission Chairman (FCC) Brendan Carr, who spoke on CNBC Thursday morning. Trump spoke at a press conference in the U.…",
    "link": "https://www.rawstory.com/trump-jimmy-kimmel-2674006660/",
    "timestamp": "2025-09-18T15:16:42Z"
  },
  {
    "title": "Schumer Seeks to Use Shutdown Leverage to His Advantage",
    "description": "With an end-of-September deadline approaching to fund the government, both parties appear locked into a shutdown showdown. Speaker of the House Mike Johnson, R-La., is... Read More\nThe post Schumer Seeks to Use Shutdown Leverage to His Advantage appeared firs…",
    "link": "https://www.dailysignal.com/2025/09/18/schumer-seeks-shutdown-leverage-his-advantage/",
    "timestamp": "2025-09-18T15:15:00Z"
  },
  {
    "title": "Russia Responds to Charlie Kirk Accusations",
    "description": "Moscow's embassy in the U.S. has rejected a report that Russian bots pushed disinformation about Kirk's killing.",
    "link": "https://www.newsweek.com/russia-kirk-accusations-disinformation-2131911",
    "timestamp": "2025-09-18T15:14:48Z"
  },
  {
    "title": "Disgruntled Starbucks workers in 3 states sue over dress-code changes, saying the company refused to reimburse them",
    "description": "“As part of this change, and to ensure out partners were prepared, partners received two shirts at no cost,” Starbucks said about its workers.",
    "link": "https://fortune.com/2025/09/18/starbucks-lawsuit-dress-code-reimbursement/",
    "timestamp": "2025-09-18T15:14:26Z"
  },
  {
    "title": "What is Antifa, the leftist movement Trump says he’s labeling ‘major terrorist organization’? | CNN Politics",
    "description": "The name is loosely applied to factions of black-clad leftists or anarchists who show up at protests opposing the police or the government, but has also been used by several on the right, including Trump, as a sort of catch-all reference to any type of left-w…",
    "link": "https://www.cnn.com/2025/09/18/politics/antifa-what-is-explained",
    "timestamp": "2025-09-18T15:13:43Z"
  },
  {
    "title": "Antifa and Charlie Kirk's assassination chilling connection established? Trump's big move decoded",
    "description": "President Trump announced plans to designate antifa as a major terrorist organization following the assassination of right-wing activist Charlie Kirk. Trump blamed the \"radical left\" for Kirk's death, prompting investigations into antifa's funding and suppres…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-what-is-antifa-and-charlie-kirk-assassinations-chilling-connection-established-trumps-big-move-decoded/articleshow/123979582.cms",
    "timestamp": "2025-09-18T15:12:27Z"
  },
  {
    "title": "Trump Calls on Friendly Reporter Who Asks British PM If the UK Is ‘Still a Christian Country’",
    "description": "Donald Trump called on a friendly reporter during a press conference in the UK Thursday who complemented him on being a \"proud Christian leader.\"\nThe post Trump Calls on Friendly Reporter Who Asks British PM If the UK Is ‘Still a Christian Country’ first appe…",
    "link": "https://www.mediaite.com/media/news/trump-calls-on-friendly-reporter-who-asks-british-pm-if-the-uk-is-still-a-christian-country/",
    "timestamp": "2025-09-18T15:11:50Z"
  },
  {
    "title": "Keir Starmer says UK's migrant deal must work, Trump urges him to use military action",
    "description": "British Prime Minister Keir Starmer emphasized the importance of making a migrant returns deal with France effective to manage the number of arrivals. This comes as U.S. President Donald Trump urged Starmer to consider using military force, if necessary, to h…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/keir-starmer-says-uks-migrant-deal-must-work-trump-urges-him-to-use-military-action/articleshow/123979672.cms",
    "timestamp": "2025-09-18T15:11:40Z"
  },
  {
    "title": "Historic U.S.-U.K. Prosperity Pact Worth $340 Billion To Boost AI, Jobs",
    "description": "President Donald Trump and U.K. Prime Minister Sir Keir Starmer signed a sweeping $340 billion U.K.-U.S. Tech Prosperity Deal on Thursday, calling it the largest commercial package ever secured during a state visit. The agreement underscores the depth of the …",
    "link": "https://biztoc.com/x/9a03d25804025243",
    "timestamp": "2025-09-18T15:11:06Z"
  },
  {
    "title": "“We can do this the easy way or the hard way”: Trump’s FCC again uses the threat of its regulatory powers to push a critic off the air",
    "description": "This is supposed to be a website about media innovation, so I suppose we must acknowledge the innovation of Brendan Carr, Donald Trump’s chair of the Federal Communications Commission. For decades, the renewal of television licenses was overwhelmingly pro for…",
    "link": "https://www.niemanlab.org/2025/09/we-can-do-this-the-easy-way-or-the-hard-way-trumps-fcc-again-uses-the-threat-of-its-regulatory-powers-to-push-a-critic-off-the-air/",
    "timestamp": "2025-09-18T15:10:44Z"
  },
  {
    "title": "Trump claims Jimmy Kimmel was fired for ‘bad ratings’ — and for saying a ‘horrible thing’ about Charlie Kirk",
    "description": "ABC late night host Jimmy Kimmel was suspended over his “bad ratings,” President Trump claimed, though he incorrectly said Kimmel was fired.",
    "link": "https://nypost.com/2025/09/18/us-news/trump-claims-jimmy-kimmel-was-fired-for-bad-ratings-and-for-saying-a-horrible-thing-about-charlie-kirk/",
    "timestamp": "2025-09-18T15:10:04Z"
  },
  {
    "title": "Eric Swalwell Dons ‘Jimmy Kimmel Live’ Hat, Whines That Host’s Benching Should ‘Shake’ Americans",
    "description": "Democratic California Rep. Eric Swalwell lamented late-night comedy host Jimmy Kimmel's firing from ABC on Thursday while wearing a \"Jimmy Kimmel Live!\" hat.",
    "link": "https://dailycaller.com/2025/09/18/eric-swalwell-jimmy-kimmel-live-cancellation/",
    "timestamp": "2025-09-18T15:09:33Z"
  },
  {
    "title": "CNN Data Chief Spots How Trump Could Absolutely Spoil GOP's Big Texas Bet",
    "description": "Harry Enten said Republicans in the Lone Star State may have \"bit off a bit more than they can chew.\"",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-texas-republicans-redistricting-latinos_n_68cc06a5e4b0aa8d99fe7dca",
    "timestamp": "2025-09-18T15:09:10Z"
  },
  {
    "title": "Jimmy Kimmel pressured to make 'meaningful personal donation' to Kirk's family: report",
    "description": "Jimmy Kimmel drew the wrath of Federal Communications Commission (FCC) Brendan Carr in response to the late-night host's comments on the murder of MAGA activist and Turning Point USA founder Charlie Kirk and the suspect in his shooting: 22-year-old Utah resid…",
    "link": "https://www.rawstory.com/jimmy-kimmel-pressured-to-make-meaningful-personal-donation-to-kirk-s-family-report/",
    "timestamp": "2025-09-18T15:08:36Z"
  },
  {
    "title": "Lawmaker who tied Kirk to ‘domestic terrorism’ facing expulsion calls amid politician blowback nationwide",
    "description": "Several mayors and lawmakers face backlash for controversial posts about Charlie Kirk's death, including a West Virginia delegate who called his words domestic terrorism.",
    "link": "https://www.foxnews.com/politics/lawmaker-who-tied-kirk-domestic-terrorism-facing-expulsion-calls-amid-politician-blowback-nationwide",
    "timestamp": "2025-09-18T15:08:10Z"
  },
  {
    "title": "The FCC’s Censorship of Jimmy Kimmel Is Insanely Corrupt",
    "description": "The censorship of Jimmy Kimmel was evidently a sacrifice at the altar of corporate interests.ABC’s Wednesday decision to suspend Jimmy Kimmel Live! came after decisions to pull the show from Nexstar Media Group and then Sinclair Broadcast Group, which own man…",
    "link": "https://newrepublic.com/post/200632/fcc-censorship-jimmy-kimmel-insanely-corrupt",
    "timestamp": "2025-09-18T15:07:58Z"
  },
  {
    "title": "Trump says US may extend deadline on TikTok sale",
    "description": "Donald Trump said the US is nearing a deal with China to transfer TikTok’s ownership to American firms but may extend the divestiture deadline under current terms. Speaking with UK Prime Minister Keir Starmer, he confirmed talks with Xi Jinping on Friday afte…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-says-us-may-extend-deadline-on-tiktok-sale/articleshow/123979575.cms",
    "timestamp": "2025-09-18T15:07:18Z"
  },
  {
    "title": "Why Egypt is not bowing to pressure to accept Palestinian refugees",
    "description": "There are three primary reasons why Egypt objects to any expulsion of Palestinians.",
    "link": "https://theconversation.com/why-egypt-is-not-bowing-to-pressure-to-accept-palestinian-refugees-265517",
    "timestamp": "2025-09-18T15:06:09Z"
  },
  {
    "title": "Top German conservative floats broadcaster fee freeze over snub to journalist",
    "description": "BERLIN (Reuters) -The second most senior person in Chancellor Friedrich Merz's conservative party has floated the idea of freezing funding to Germany's public broadcasters after the airtime of a right-leaning journalist and commentator was cut. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/18/top-german-conservative-floats-broadcaster-fee-freeze-over-snub-to-journalist",
    "timestamp": "2025-09-18T15:06:00Z"
  },
  {
    "title": "Zelenskyy: Ukraine expects $3.5 billion in NATO PURL pledges by October",
    "description": "European NATO allies have already pledged over $2 billion in US weapons for Kyiv",
    "link": "https://www.euractiv.com/news/zelenskyy-ukraine-expects-3-5-billion-in-nato-purl-pledges-by-october/",
    "timestamp": "2025-09-18T15:05:05Z"
  },
  {
    "title": "Donald Trump finally tells the truth about what he does in business, with women and while playing golf (possible nsfw content on page) [Obvious]",
    "description": "Donald Trump finally tells the truth about what he does in business, with women and while playing golf (possible nsfw content on page)",
    "link": "https://www.fark.com/comments/13815564/Donald-Trump-finally-tells-truth-about-what-he-does-in-business-with-women-while-playing-golf-possible-nsfw-content-on-page",
    "timestamp": "2025-09-18T15:05:03Z"
  },
  {
    "title": "Trump administration may not end Venezuelan migrants' protections, court rules",
    "description": "(Reuters) -A federal appeals court has rejected a bid by U.S. President Donald Trump's administration to set aside a judge's order holding it unlawfully rolled back temporary protections from deportation granted to 600,000 Venezuelans living in the United Sta…",
    "link": "https://www.thestar.com.my/news/world/2025/09/18/trump-administration-may-not-end-venezuelan-migrants039-protections-court-rules",
    "timestamp": "2025-09-18T15:05:00Z"
  },
  {
    "title": "Legally Bondi",
    "description": "This post Legally Bondi appeared first on Daily Reckoning.\nU.S. Attorney General Pam Bondi is easily President Donald J. Trump’s worst appointment. I honestly don’t know how he could get it so wrong. Bondi has done nothing worthy of note, other than saying sh…",
    "link": "https://dailyreckoning.com/legally-bondi/",
    "timestamp": "2025-09-18T15:04:46Z"
  },
  {
    "title": "Trump says US to get 'tremendous fee' as part of TikTok deal",
    "description": "Donald Trump said the US will receive a “tremendous fee plus” under a deal on TikTok’s ownership, which he expects to finalise with Chinese President Xi Jinping on Friday. Speaking alongside UK Prime Minister Keir Starmer, Trump framed the agreement as a fina…",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-says-us-to-get-tremendous-fee-as-part-of-tiktok-deal/articleshow/123979490.cms",
    "timestamp": "2025-09-18T15:02:52Z"
  },
  {
    "title": "Eight months later, Trump’s promise to ‘bring back free speech’ collapses into farce",
    "description": "Months after Donald Trump said he'd \"stopped all government censorship and brought back free speech,\" it’s hard to know whether to laugh or cry.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/eight-months-later-trumps-promise-bring-back-free-speech-collapses-far-rcna232115",
    "timestamp": "2025-09-18T15:02:47Z"
  },
  {
    "title": "Trump Says Putin ‘Let Me Down’ After Meeting Starmer on Ukraine",
    "description": "President Donald Trump said Russian President Vladimir Putin had “really let me down” after meeting with UK Prime Minister Keir Starmer to discuss efforts to heighten pressure on Russia to enter negotiations that could help bring the Kremlin’s three-year war …",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-putin-let-me-down-after-meeting-starmer-on-ukraine",
    "timestamp": "2025-09-18T15:02:20Z"
  },
  {
    "title": "Donald Trump Says Jimmy Kimmel Was “Fired” Over “Lack Of Talent” Not Free Speech",
    "description": "Donald Trump has been sounding off again over Jimmy Kimmel being taken off air as he commited to “a movement to defend the glorious traditions of freedom of speech on both sides of the Atlantic” during his trip to the UK. Responding to a question about whethe…",
    "link": "http://deadline.com/2025/09/donald-trump-says-jimmy-kimmel-was-fired-over-lack-of-talent-not-free-speech-1236547961/",
    "timestamp": "2025-09-18T15:02:09Z"
  },
  {
    "title": "'I don't know him': Trump sidesteps question about Mandelson and Epstein at UK press conference",
    "description": "The UK Prime Ministers and US President met at Starmer’s country home in Chequers, on Trump’s last day of his state visit.",
    "link": "https://www.thejournal.ie/the-uk-prime-minister-discussed-the-big-issues-with-trump-at-his-country-home-in-chequers-today-on-the-final-day-of-the-us-presidents-state-visit-6820340-Sep2025/",
    "timestamp": "2025-09-18T15:01:06Z"
  }
]