[
  {
    "title": "Trump orders US govt to stop using Anthropic AI tech",
    "description": "US President Donald Trump told the US government to \"immediately\" stop using Anthropic's technology after the AI start-up rejected the Pentagon's demand that it agree to unconditional military use of its Claude models.",
    "link": "https://www.rte.ie/news/us/2026/0228/1560898-us-anthropic-ai/",
    "timestamp": "2026-02-28T04:29:38Z"
  },
  {
    "title": "Robert F. Kennedy Jr. Won't Stop Posting Super-Cringe Workout Videos",
    "description": "Robert F. Kennedy Jr. Won't Stop Posting Super-Cringe Workout Videosthedailybeast.com",
    "link": "https://www.thedailybeast.com/robert-f-kennedy-jr-wont-stop-posting-super-cringe-workout-videos/",
    "timestamp": "2026-02-28T04:27:44Z"
  },
  {
    "title": "Global stocks: Global stocks fall as investors mull AI disruptions, oil prices rise",
    "description": "Global stocks saw a dip on Friday. Concerns over AI's impact and high tech valuations weighed on markets. Meanwhile, rising US-Iran tensions pushed oil prices higher. Sterling also experienced a fall following a Labour election defeat. Investors are closely w…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-stocks-global-stocks-fall-as-investors-mull-ai-disruptions-oil-prices-rise/articleshow/128873902.cms",
    "timestamp": "2026-02-28T04:26:33Z"
  },
  {
    "title": "Trump raises the possibility of a ‘friendly takeover of Cuba' coming out of talks with Havana",
    "description": "Trump hints at a potential \"friendly takeover of Cuba\" amid high-level talks, emphasizing the island's economic struggles.",
    "link": "https://www.thehindubusinessline.com/news/world/trump-raises-the-possibility-of-a-friendly-takeover-of-cuba-coming-out-of-talks-with-havana/article70686951.ece",
    "timestamp": "2026-02-28T04:22:15Z"
  },
  {
    "title": "Trump administration seeks delay in tariff refunds battle",
    "description": "US President Donald Trump's administration is seeking to delay legal proceedings linked to tariff refunds for importers, a court filing showed Friday, a week after the Supreme Court struck down his global duties. The administration argued Friday for a delay o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-seeks-delay-in-tariff-refunds-battle/articleshow/128873688.cms",
    "timestamp": "2026-02-28T04:18:01Z"
  },
  {
    "title": "Biden, 83, jokes about age, brags about his border numbers during rare post-presidency speech: ‘I’m getting pretty old’",
    "description": "The former president used the forum to tout his record as commander in chief, even in the policy areas where voters gave him his lowest marks.",
    "link": "https://nypost.com/2026/02/27/us-news/biden-83-jokes-about-age-and-brags-about-his-border-numbers-during-rare-speech/",
    "timestamp": "2026-02-28T04:16:14Z"
  },
  {
    "title": "Trump suggests ‘friendly takeover of Cuba’",
    "description": "President Donald Trump has claimed Havana is on the brink of collapse and is actively negotiating with Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/633152-trump-cuba-friendly-takeover/",
    "timestamp": "2026-02-28T04:15:01Z"
  },
  {
    "title": "Democrats weigh how harshly to go after firms that courted Trump (Nicholas Wu/Semafor)",
    "description": "Nicholas Wu / Semafor:\nDemocrats weigh how harshly to go after firms that courted Trump  —  Know More  —  Room For Disagreement  —  Nicholas Wu's View  —  Notable  —  Top Democrats are weighing how harshly they would go after corporations that have courted Pr…",
    "link": "https://www.memeorandum.com/260227/p123",
    "timestamp": "2026-02-28T04:15:01Z"
  },
  {
    "title": "Politics are laced through the Epstein affair - and why listening to the victims is so vital",
    "description": "For two Republicans to suggest that Jeffrey Epstein's victims have exonerated Donald Trump is simply wrong and risks undermining the survivors' pursuit of justice.",
    "link": "https://news.sky.com/story/politics-are-laced-through-the-epstein-affair-and-why-listening-to-the-victims-is-so-vital-13513196",
    "timestamp": "2026-02-28T04:15:00Z"
  },
  {
    "title": "I get along with Pakistan very well and they are doing terrifically well: Trump",
    "description": "US President Donald Trump expressed strong positive relations with Pakistan. He praised its leadership and stated the country is performing exceptionally well. Meanwhile, a US State Department official conveyed condolences for recent conflict casualties. The …",
    "link": "https://economictimes.indiatimes.com/news/defence/i-get-along-with-pakistan-very-well-and-they-are-doing-terrifically-well-trump/articleshow/128873628.cms",
    "timestamp": "2026-02-28T04:13:04Z"
  },
  {
    "title": "President Trump terminates AI tech deal following showdown",
    "description": "President Donald Trump terminated a government-tech contract with AI company Anthropic on Friday, following a public dispute with the Pentagon over ethical and national security concerns.",
    "link": "https://www.wpbf.com/article/trump-anthropic-ban/70541722",
    "timestamp": "2026-02-28T04:10:01Z"
  },
  {
    "title": "OpenAI strikes deal with Pentagon, hours after rival Anthropic was blacklisted by Trump",
    "description": "OpenAI CEO Sam Altman said on X that his company has come to terms with the Defense Department for use of its models.",
    "link": "https://www.cnbc.com/2026/02/27/openai-strikes-deal-with-pentagon-hours-after-rival-anthropic-was-blacklisted-by-trump.html",
    "timestamp": "2026-02-28T04:06:32Z"
  },
  {
    "title": "Fox’s Mark Levin Tells Trump To End Talks With Iran and Start Bombing: ‘Time Is Up!’",
    "description": "Fox News host Mark Levin urged President Donald Trump to cut off talks with Iran and to commence military action against the country. \nThe post Fox’s Mark Levin Tells Trump To End Talks With Iran and Start Bombing: ‘Time Is Up!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-mark-levin-tells-trump-to-end-talks-with-iran-and-start-bombing-time-is-up/",
    "timestamp": "2026-02-28T04:05:08Z"
  },
  {
    "title": "Biden accuses Trump of erasing history and squandering US leadership role on global stage: 'Dark days'",
    "description": "Former President Biden accused President Trump of trying to erase truth and history, claiming he threatens democracy and America's global leadership role.",
    "link": "https://www.foxnews.com/politics/biden-accuses-trump-erasing-history-squandering-us-leadership-role-global-stage-dark-days",
    "timestamp": "2026-02-28T04:01:08Z"
  },
  {
    "title": "Southeast Asia, do not mistake Trump’s tariff defeat for a reprieve",
    "description": "The much-anticipated Supreme Court ruling on US President Donald Trump’s use of the International Emergency Economic Powers Act (IEEPA) to implement his tariff regime has been handed down.\nIn a sharp rebuke to his administration, the nation’s highest court ha…",
    "link": "https://www.scmp.com/week-asia/opinion/article/3344911/southeast-asia-do-not-mistake-trumps-tariff-defeat-reprieve",
    "timestamp": "2026-02-28T04:00:10Z"
  },
  {
    "title": "'Get rid of Trump': Robert De Niro ups the ante against US President, calls on Americans to oust him in midterms",
    "description": "Actor Robert De Niro has sharply criticized Donald Trump. He warns of an internal crisis facing the United States. De Niro urges peaceful public resistance before the midterm elections. He believes the polls are crucial for the country's future. The goal is t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/get-rid-of-trump-robert-de-niro-ups-the-ante-against-us-president-calls-on-americans-to-oust-him-in-midterms/articleshow/128873119.cms",
    "timestamp": "2026-02-28T03:59:36Z"
  },
  {
    "title": "Peace ‘within reach’ as Iran agrees no nuclear material stockpile: Oman FM",
    "description": "Oman's Foreign Minister says most recent indirect talks between US, Iran 'really advanced, substantially'.",
    "link": "https://www.aljazeera.com/news/2026/2/28/peace-within-reach-as-iran-agrees-no-nuclear-material-stockpile-oman-fm",
    "timestamp": "2026-02-28T03:51:14Z"
  },
  {
    "title": "Major Progress: Iran agrees to 'never, ever' have nuclear bomb material, says Oman FM",
    "description": "Oman's foreign minister said US-Iran nuclear talks have made major progress, including agreement on zero stockpiling of enriched uranium and full IAEA verification, urging more time to finalize the deal.Oman’s Foreign Minister Badr Albusaidi said Iran has agr…",
    "link": "https://freerepublic.com/focus/f-news/4368636/posts",
    "timestamp": "2026-02-28T03:42:20Z"
  },
  {
    "title": "Mediator in U.S.-Iran Talks Says ‘Peace Deal Is Within Our Reach’",
    "description": "\"Substantial progress\" has been made in negotiations between the U.S. and Iran, Omani Foreign Minister Badr Albusaidi told CBS News on Friday.\nThe post Mediator in U.S.-Iran Talks Says ‘Peace Deal Is Within Our Reach’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/mediator-in-u-s-iran-talks-says-peace-deal-is-within-our-reach/",
    "timestamp": "2026-02-28T03:40:27Z"
  },
  {
    "title": "Trump Settles With Isaac Hayes’ Estate Over Use Of Music During The Campaign",
    "description": "One of the unfortunate knock on effects of being generally insufferable is that many people don’t want to be associated with you in any way. And when you’re both insufferable and happen to be the most divisive American political figure in modern history, all …",
    "link": "https://www.techdirt.com/2026/02/27/trump-settles-with-isaac-hayes-estate-over-use-of-music-during-the-campaign/",
    "timestamp": "2026-02-28T03:39:00Z"
  },
  {
    "title": "‘Scorcher of a brief’: Catholic bishops rebuke Trump order",
    "description": "The U.S. Conference of Catholic Bishops has filed what legal analysts are calling a blistering Supreme Court brief urging the justices to strike down President Donald Trump’s executive order abolishing birthright citizenship for many immigrants’ children.The …",
    "link": "https://www.rawstory.com/trump-birthright-citizenship-2675389480/",
    "timestamp": "2026-02-28T03:38:35Z"
  },
  {
    "title": "Biden seizes on Trump's sinking favorability in a combative speech in South Carolina",
    "description": "Former President Joe Biden stood before a South Carolina crowd on Friday and took aim at President Donald Trump's State of the Union address.\"Is he still talking?\" Biden asked, to laughter",
    "link": "https://www.nbcnews.com/politics/joe-biden/biden-trump-favorability-combative-speech-south-carolina-rcna261085",
    "timestamp": "2026-02-28T03:30:31Z"
  },
  {
    "title": "Rubio Confirms Venezuelan Elections. Trump Confirms... 'Friendly Takeover' of Cuba?",
    "description": "On Thursday, Venezuela's \"acting president\" Delcy Rodríguez held a regime-sponsored event for young people, \"Gran Encuentro con la Juventud Venezolana\" (Great Meeting with Venezuelan Youth), during which she got up on stage in front of a crowd, flashing peace…",
    "link": "https://freerepublic.com/focus/f-news/4368633/posts",
    "timestamp": "2026-02-28T03:27:19Z"
  },
  {
    "title": "Former Trump AI Adviser Torches President’s War on Anthropic: ‘Attempted Corporate Murder’",
    "description": "A former senior artificial intelligence adviser to President Donald Trump lambasted the president's treatment of Anthropic for failing to cave to the president's demands.\nThe post Former Trump AI Adviser Torches President’s War on Anthropic: ‘Attempted Corpor…",
    "link": "https://www.mediaite.com/media/tech/former-trump-ai-adviser-torches-presidents-war-on-anthropic-attempted-corporate-murder/",
    "timestamp": "2026-02-28T03:24:04Z"
  },
  {
    "title": "'We have a big decision to make...they're very dangerous people': Trump on nuclear talks with Iran",
    "description": "US President Donald Trump has called Iran very difficult and dangerous. He is considering the next steps in nuclear negotiations. Trump prefers a peaceful resolution to ongoing military tensions in the Middle East. He stated that any deal with Iran must be me…",
    "link": "https://economictimes.indiatimes.com/news/defence/we-have-a-big-decision-to-make-theyre-very-dangerous-people-trump-on-nuclear-talks-with-iran/articleshow/128872821.cms",
    "timestamp": "2026-02-28T03:22:32Z"
  },
  {
    "title": "Mark Levin: If this 'mass-killing regime' gets a nuclear weapon, it will use it | Fox News Video",
    "description": "Fox News host Mark Levin discusses U.S.-Iran tension and praises President Donald Trump for his action on ‘Hannity.’",
    "link": "https://www.foxnews.com/video/6390117557112",
    "timestamp": "2026-02-28T03:18:37Z"
  },
  {
    "title": "Joe Biden returns to bask in 'thank you' event from South Carolina Democrats",
    "description": "Former President Joe Biden returned to South Carolina on Friday for a warm homecoming from the Democrats who resurrected his 2020 presidential campaign",
    "link": "https://abcnews.com/US/wireStory/joe-biden-returns-bask-event-south-carolina-democrats-130585126",
    "timestamp": "2026-02-28T03:17:46Z"
  },
  {
    "title": "'Disastrous Mistake': Trump Calls Out Anthropic, Orders All Federal Agencies to Cut Ties",
    "description": "Well, that escalated quickly...As Ben Smith reported earlier on Friday, the Pentagon and AI giant Anthropic were in the midst of a showdown regarding the deployment terms of its Claude AI model in defense systems. The Pentagon wanted to authorize \"all lawful …",
    "link": "https://freerepublic.com/focus/f-news/4368631/posts",
    "timestamp": "2026-02-28T03:17:34Z"
  },
  {
    "title": "Anthropic calls Pentagon's supply chain risk tag 'unprecedented', vows to challenge in court",
    "description": "The company argued that current frontier AI models are &quot;not reliable enough&quot; for fully autonomous weapons and warned that such use could endanger US troops and civilians.",
    "link": "https://www.moneycontrol.com/news/business/anthropic-calls-pentagon-s-supply-chain-risk-tag-unprecedented-vows-to-challenge-in-court-13846464.html",
    "timestamp": "2026-02-28T03:16:32Z"
  },
  {
    "title": "New: Trump DOJ Drops the Hammer on Anti-ICE Activists Who Invaded Minnesota Church",
    "description": "If the previously unindicted left-wing activists who stormed a church in Minnesota thought they were off the hook, they thought wrong. The Trump administration has dropped a slew of new charges related to the incident, targeting 30 people in total. According …",
    "link": "https://freerepublic.com/focus/f-news/4368630/posts",
    "timestamp": "2026-02-28T03:12:58Z"
  },
  {
    "title": "Trump Announces 'Big Decision' on Iran",
    "description": "WASHINGTON, Sputnik - US President Donald Trump announced a \"big decision\" on Iran.",
    "link": "https://sputnikglobe.com/20260228/trump-announces-big-decision-on-iran-1123707332.html",
    "timestamp": "2026-02-28T03:11:18Z"
  },
  {
    "title": "California is the fraud capital of America – and we will expose it",
    "description": "The rampant fraud uncovered in the state of Minnesota has shocked America and ended the political career of Gov. Tim Walz.  Yet as I told Attorney General Pam Bondi at a recent House Judiciary Committee hearing, the fraud in Minnesota pales in comparison to w…",
    "link": "https://nypost.com/2026/02/27/opinion/california-is-fraud-central/",
    "timestamp": "2026-02-28T03:08:23Z"
  },
  {
    "title": "Why did the Trump administration ban Anthropic? #politics",
    "description": "What happened and what it means President Donald Trump directed federal agencies to stop using Anthropic’s artificial intelligence products and ordered a six month phase out. The move followed a months long standoff between the company and the Department of D…",
    "link": "https://alltoc.com/politics/why-did-the-trump-administration-ban-anthropic",
    "timestamp": "2026-02-28T03:06:35Z"
  },
  {
    "title": "Pentagon casts cloud of doubt over Anthropic’s AI business",
    "description": "Anthropic PBC, one of the fastest-growing AI startups, faces a major setback after the Trump administration ordered federal agencies to stop using its software and the Pentagon labelled it a supply-chain risk.",
    "link": "https://economictimes.indiatimes.com/news/international/business/pentagon-casts-cloud-of-doubt-over-anthropics-ai-business/articleshow/128872591.cms",
    "timestamp": "2026-02-28T03:05:47Z"
  },
  {
    "title": "Why did the government ban Anthropic? #tech",
    "description": "A political and contractual standoff over AI guardrails Federal action this week escalated an ongoing dispute between an AI company and the U.S. government after the company resisted Pentagon demands that would remove safety limits on its model. The immediate…",
    "link": "https://alltoc.com/tech/why-did-the-government-ban-anthropic",
    "timestamp": "2026-02-28T03:03:23Z"
  },
  {
    "title": "Spanberger’s Subtext: What the Governor’s Rebuttal Really Reveals",
    "description": "In a remarkably efficient 12 minutes, Virginia Gov. Abigail Spanberger told Americans quite a bit—less about the formal trappings of the State of the Union, and much more about... Read More\nThe post Spanberger’s Subtext: What the Governor’s Rebuttal Really Re…",
    "link": "https://www.dailysignal.com/2026/02/27/spanbergers-subtext-what-governors-rebuttal-reveals/",
    "timestamp": "2026-02-28T03:00:54Z"
  },
  {
    "title": "'Unprecedented': Anthropic responds to Hegseth's directive calling company a 'supply chain risk'",
    "description": "US President Donald Trump has ordered all government agencies to immediately stop using Anthropic AI after the company’s CEO, Dario Amodei, refused to accede to the Pentagon’s demands to use its tech for mass surveillance",
    "link": "https://www.firstpost.com/tech/unprecedented-anthropic-responds-to-hegseths-directive-calling-company-a-supply-chain-risk-13984550.html",
    "timestamp": "2026-02-28T02:50:26Z"
  },
  {
    "title": "Kristi Noem's 'dirty little secret' on border security exposed by conservative outlet",
    "description": "President Donald Trump and Homeland Security Secretary Kristi Noem have repeatedly bragged that the Trump administration is allowing \"zero\" unauthorized immigrants to cross the border into the United States. But a new scoop from the conservative Washington Ex…",
    "link": "https://www.rawstory.com/kristi-noem-2675383737/",
    "timestamp": "2026-02-28T02:47:02Z"
  },
  {
    "title": "Donald Trump Declares War on Anthropic",
    "description": "The Trump administration is severing all ties with the “woke” AI firm.",
    "link": "https://www.theatlantic.com/technology/2026/02/pentagon-anthropic-contract/686188/",
    "timestamp": "2026-02-28T02:34:26Z"
  },
  {
    "title": "Trump floats Ted Cruz for Supreme Court, jokes he’d get ‘100%’ bipartisan vote to ‘get him out of there’",
    "description": "President Donald Trump joked about putting Sen. Ted Cruz on the Supreme Court, saying he'd get \"100% of votes\" because lawmakers want to \"get him out\" of Congress.",
    "link": "https://www.foxnews.com/politics/trump-floats-ted-cruz-supreme-court-jokes-hed-get-100-bipartisan-vote-get-him-out-there",
    "timestamp": "2026-02-28T02:33:14Z"
  },
  {
    "title": "Flight logs and hot tub photo among key moments from Bill Clinton's deposition",
    "description": "The former US president, who is featured in photographs within the Epstein files, denies having any knowledge of the convicted sex offender's crimes.",
    "link": "https://www.bbc.com/news/videos/ce94d4xk5mvo",
    "timestamp": "2026-02-28T02:32:50Z"
  },
  {
    "title": "President Donald Trump floats 'friendly takeover' of Cuba",
    "description": "The comment came after being asked about a deadly confrontation between a U.S.-registered speedboat and Cuban border troops off the coast of Cuba on Wednesday.",
    "link": "https://abcnews.com/US/president-donald-trump-floats-friendly-takeover-cuba/story?id=130574566",
    "timestamp": "2026-02-28T02:31:41Z"
  },
  {
    "title": "Republicans Divided Over Saving the SAVE Act [semi-satire]",
    "description": "Everyone knows Democrats cheat in elections. Many illegal immigrants say \"President Biden invited us to come to America. When we did he took care of us. He gave us places to live, food, cell phones, all the good things that are available to people in America.…",
    "link": "https://freerepublic.com/focus/f-bloggers/4368625/posts",
    "timestamp": "2026-02-28T02:26:15Z"
  },
  {
    "title": "Costa Rica’s Grynspan pledges reform in bid for UN chief job",
    "description": "Rebeca Grynspan is upbeat about her chances of becoming the next head of the United Nations, which she insists must become more agile in tackling the world’s crises. The Costa Rican former vice-president said she wanted to rebuild global trust in the United N…",
    "link": "https://www.digitaljournal.com/world/costa-ricas-grynspan-pledges-reform-in-bid-for-un-chief-job/article",
    "timestamp": "2026-02-28T02:23:26Z"
  },
  {
    "title": "Trump says he's thinking of putting Republican Senator Ted Cruz on Supreme Court (Reuters)",
    "description": "Reuters:\nTrump says he's thinking of putting Republican Senator Ted Cruz on Supreme Court  —  President Donald Trump on Friday said he was considering nominating Republican Senator Ted Cruz for a future seat on the U.S. Supreme Court, although Cruz last month…",
    "link": "https://www.memeorandum.com/260227/p113",
    "timestamp": "2026-02-28T02:20:01Z"
  },
  {
    "title": "Tucker Carlson hit with scathing attack from irate ambassador over 'disgusting' conspiracy",
    "description": "Israel's ambassador to the U.S. unleashed a blistering attack on Tucker Carlson Friday, blasting the former Fox News host's rhetoric as offensive and deeply troubling. Carlson has repeatedly suggested that Benjamin Netanyahu, the prime minister of Israel, is …",
    "link": "https://www.rawstory.com/tucker-carlson-2675383351/",
    "timestamp": "2026-02-28T02:17:01Z"
  },
  {
    "title": "ICE agents said to have posed as police, a tactic some fear could erode trust in real cops",
    "description": "Federal immigration agents arrested a Columbia student after allegedly gaining access to her apartment by posing as police in search of a missing child",
    "link": "https://abcnews.com/US/wireStory/ice-agents-posed-police-tactic-fear-erode-trust-130582391",
    "timestamp": "2026-02-28T02:13:33Z"
  },
  {
    "title": "GOP strategist bewildered by Republicans' 'terrible' move to haul in Clintons to testify",
    "description": "A former Trump strategist expressed confusion Friday over House Republicans’ decision to subpoena former President Bill Clinton, questioning what lawmakers hoped to accomplish.Appearing on Anderson Cooper 360, GOP strategist David Urban suggested the effort p…",
    "link": "https://www.rawstory.com/bill-clinton-epstein-2675382354/",
    "timestamp": "2026-02-28T02:08:02Z"
  },
  {
    "title": "The teenage women making Denmark 'a hard target'",
    "description": "Denmark is fast-tracking female conscription as it muscles up to Russia and faces threats of invasion from the US.",
    "link": "https://www.abc.net.au/news/2026-02-28/denmark-female-conscription-in-face-of-russia-us-threats/106339920",
    "timestamp": "2026-02-28T02:03:20Z"
  },
  {
    "title": "Crowd Goes Wild As President Trump Orders Hamburgers For Everyone at Whataburger in Corpus Christi, Texas (VIDEO)",
    "description": "President Trump stopped at a Whataburger in Corpus Christi, Texas, after he delivered remarks on his energy agenda.\nThe post Crowd Goes Wild As President Trump Orders Hamburgers For Everyone at Whataburger in Corpus Christi, Texas (VIDEO) appeared first on Th…",
    "link": "https://www.thegatewaypundit.com/2026/02/crowd-goes-wild-as-trump-visits-whataburger-corpus/",
    "timestamp": "2026-02-28T02:00:15Z"
  },
  {
    "title": "Anthropic faces 6-month federal phaseout after Trump orders agencies to halt its AI use",
    "description": "Trump ordered federal agencies to halt use of Anthropic after the Pentagon labelled the AI firm a supply-chain risk amid a dispute over military guardrails.",
    "link": "https://indianexpress.com/article/technology/artificial-intelligence/anthropic-faces-6-month-federal-phaseout-after-donald-trump-orders-agencies-to-halt-its-ai-use-10556648/",
    "timestamp": "2026-02-28T02:00:00Z"
  },
  {
    "title": "Anthropic vs Pentagon: Dario Amodei-led AI firm vows legal action against Pentagon after ‘supply chain risk’ designation",
    "description": "This came hours after Defense Secretary Pete Hegseth issued the order in a statement on X following a directive from President Donald Trump who asked every federal agency to drop Anthropic and Claude from its workflow.",
    "link": "https://www.livemint.com/companies/news/anthropic-vs-pentagon-dario-amodei-led-ai-firm-vows-legal-action-against-pentagon-after-supply-chain-risk-designation-11772243384253.html",
    "timestamp": "2026-02-28T01:54:58Z"
  },
  {
    "title": "House democrats join thomas massie to curb Trump’s iran war powers (browser title).",
    "description": "Massie-led push to handcuff Trump on Iran gets Jeffries' backing (article title) A resolution led by Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., aimed at curbing President Donald Trump's war powers in Iran is getting the blessing of the House of Repr…",
    "link": "https://freerepublic.com/focus/f-news/4368621/posts",
    "timestamp": "2026-02-28T01:53:34Z"
  },
  {
    "title": "Carville trashes Trump – maybe Carville should sit this one out",
    "description": "'How about we keep this to, \"It's the economy, stupid\"'?",
    "link": "https://www.wnd.com/2026/02/carville-trashes-trump-maybe-carville-should-sit-this/",
    "timestamp": "2026-02-28T01:53:01Z"
  },
  {
    "title": "Indonesia's palm oil group urges stronger global trade diplomacy",
    "description": "The Indonesian Palm Oil Association (GAPKI) has called for stronger trade diplomacy to counter rising tariff and non-tariff barriers in global markets, as ...",
    "link": "https://en.antaranews.com/news/406418/indonesias-palm-oil-group-urges-stronger-global-trade-diplomacy",
    "timestamp": "2026-02-28T01:52:38Z"
  },
  {
    "title": "Anthropic says it will challenge Pentagon's supply chain risk designation in court",
    "description": "Anthropic ​said on ​Friday it will challenge ‌in ⁠court the ⁠Pentagon's ​decision to ​declare the AI firm ​a ⁠supply-chain risk, ‌hours ​after ​U.S. ⁠President Donald Trump also ​directed every ​federal agency to stop ‌work with ​the company.",
    "link": "https://economictimes.indiatimes.com/news/international/business/anthropic-says-it-will-challenge-pentagons-supply-chain-risk-designation-in-court/articleshow/128871369.cms",
    "timestamp": "2026-02-28T01:52:02Z"
  },
  {
    "title": "Democrats Vow Revenge Against Corporations that Courted Trump if They Take Back Power After the Midterms",
    "description": "Democrats are weighing how to target corporations that have courted President Donald Trump’s approval if they retake the House after the midterm elections.Semafor reported that, given Democrats’ chances of retaking the House, top Democrats are now devising ho…",
    "link": "https://freerepublic.com/focus/f-chat/4368620/posts",
    "timestamp": "2026-02-28T01:49:34Z"
  },
  {
    "title": "JAMES CARTER: America’s Tech Strategy Must Put US Interests First",
    "description": "The choice is simple",
    "link": "https://dailycaller.com/2026/02/27/opinion-americas-tech-strategy-must-put-u-s-interests-first-james-carter/",
    "timestamp": "2026-02-28T01:41:12Z"
  },
  {
    "title": "Trump says he is 'not happy' with the Iran nuclear talks but indicates he'll give them more time",
    "description": "President Trump is unhappy with Iran nuclear talks. U.S. envoys held inconclusive discussions in Geneva. American forces are gathering in the region. Trump has threatened military action if Iran does not agree to a deal. Oman's Foreign Minister believes a dea…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-he-is-not-happy-with-the-iran-nuclear-talks-but-indicates-hell-give-them-more-time/articleshow/128871225.cms",
    "timestamp": "2026-02-28T01:40:21Z"
  },
  {
    "title": "Anthropic says it will challenge Pentagon's supply chain risk designation in court",
    "description": "Feb 27 : Anthropic said on Friday it will challenge in court the Pentagon's decision to declare the AI firm a supply-chain risk, hours after U.S. President Donald Trump also directed every federal agency to stop work with the company.",
    "link": "https://www.channelnewsasia.com/business/anthropic-says-it-will-challenge-pentagons-supply-chain-risk-designation-in-court-5959916",
    "timestamp": "2026-02-28T01:35:59Z"
  },
  {
    "title": "Health experts debate cancer-linked pesticide: 'Toxic by design'",
    "description": "HHS Secretary Kennedy supports Trump's glyphosate order while acknowledging pesticides \"are toxic by design\" and pose risks to Americans' health.",
    "link": "https://www.foxnews.com/health/cancer-linked-herbicide-spotlight-after-controversial-order-toxic-design",
    "timestamp": "2026-02-28T01:32:56Z"
  },
  {
    "title": "Warner Bros. Sale Winner: Paramount... And Netflix?",
    "description": "Paramount’s revised bid beats Netflix for Warner Bros. Discovery, but the game isn't over yet...",
    "link": "https://www.forbes.com/sites/legalentertainment/2026/02/27/warner-bros-sale-winner-paramount-and-netflix/",
    "timestamp": "2026-02-28T01:32:21Z"
  },
  {
    "title": "When Diplomacy Becomes Theology: Israel and The Mike Huckabee Affair. The Erosion of Legal Order",
    "description": "There are diplomatic missteps.\nAnd then there are moments that reveal structural drift within the machinery of power itself.\nWhen United States Ambassador to Israel Mike Huckabee stated in February 2026 that it would be “fine” if Israel were to …\nThe post Whe…",
    "link": "https://www.globalresearch.ca/diplomacy-theology-huckabee-affair-erosion-legal-order/5916882",
    "timestamp": "2026-02-28T01:29:51Z"
  },
  {
    "title": "USA Rugby to introduce 'open' gender category for trans athletes",
    "description": "USA Rugby announced a new open gender division for trans athletes in response to President Donald Trump's executive order requiring men to stay out of women's sports.",
    "link": "https://www.foxnews.com/sports/usa-rugby-introduce-open-gender-category-trans-athlete",
    "timestamp": "2026-02-28T01:28:45Z"
  },
  {
    "title": "Trump administration cannot 'terrorize' Minnesota's refugees with arrests, US judge rules",
    "description": "A federal judge on Friday said he would not allow President Donald Trump's administration to &quot;terrorize&quot; Minnesota's 5,600 refugees by arresting ‌and detaining them under a new policy that &quot;turns the refugees' American Dream into a dystopian ni…",
    "link": "https://japantoday.com/category/world/trump-administration-cannot-%27terrorize%27-minnesota%27s-refugees-with-arrests-us-judge-rules1",
    "timestamp": "2026-02-28T01:27:42Z"
  },
  {
    "title": "David Ellison used political ties, deep pockets to buy Warner Bros.",
    "description": "Paramount's David Ellison has successfully acquired Warner Bros. Discovery.  Ellison's company outbid Netflix in a surprising turn of events.  This massive deal creates one of the largest entertainment empires globally.  Paramount and Warner Bros. announced t…",
    "link": "https://economictimes.indiatimes.com/news/international/business/david-ellison-used-political-ties-deep-pockets-to-buy-warner-bros-/articleshow/128870969.cms",
    "timestamp": "2026-02-28T01:27:32Z"
  },
  {
    "title": "Trump Pitches Everyone’s Most-Hated Senator for SCOTUS",
    "description": "President Donald Trump floated the idea of nominating Texas Sen. Ted Cruz to the Supreme Court on Thursday during a visit to the state. The president was...",
    "link": "https://www.thedailybeast.com/donald-trump-pitches-ted-cruz-everyones-most-hated-senator-for-scotus/",
    "timestamp": "2026-02-28T01:26:03Z"
  },
  {
    "title": "Trump scolds Republicans for calling controversial legislation by its official name",
    "description": "President Donald Trump erupted at Republican lawmakers on Friday over their failure to use his preferred name for the voter eligibility bill. The legislation's official name is the SAVE Act (Safeguard American Voter Eligibility Act), but Trump demanded Republ…",
    "link": "https://www.rawstory.com/trump-erupts-at-own-party/",
    "timestamp": "2026-02-28T01:25:02Z"
  },
  {
    "title": "US designates Iran 'state sponsor of wrongful detention'",
    "description": "The United States designated Iran a \"state sponsor of wrongful detention,\" its first such move under a new blacklist that could eventually result in a travel ban.",
    "link": "https://www.rte.ie/news/world/2026/0228/1560893-us-iran/",
    "timestamp": "2026-02-28T01:24:46Z"
  },
  {
    "title": "Israel announces 'preventive strike' on Iran",
    "description": "Israel's defence ministry has announced it had launched a \"pre-emptive strike\" on Iran as sirens sounded in Jerusalem and people across the country received phone alerts about an \"extremely serious\" threat.",
    "link": "https://www.rte.ie/news/2026/0228/1560893-us-iran-israel/",
    "timestamp": "2026-02-28T01:24:46Z"
  },
  {
    "title": "Judge slams brakes on Trump's 'dystopian nightmare' to lock up refugees",
    "description": "A federal judge in Minnesota has blocked President Donald Trump's plan to arrest thousands of legal refugees for questioning and re-evaluation, calling the plan a \"dystopian nightmare.\"The order was first reported by Chris Geidner, who runs the Law Dork blog.…",
    "link": "https://www.rawstory.com/trump-court-2675378812/",
    "timestamp": "2026-02-28T01:24:21Z"
  },
  {
    "title": "Trump Administration Cannot ‘Terrorize' Minnesota's Refugees With Arrests, U.S. Judge Rules",
    "description": "The judge ruled shortly after a group of refugees filed a similar but broader lawsuit in federal court in Massachusetts seeking to challenge the policy's enforcement nationwide.",
    "link": "https://www.huffpost.com/entry/trump-administration-cannot-terrorize-minnesotas-refugees-with-arrests-us-judge-rules_n_69a23ab6e4b0790713155d27",
    "timestamp": "2026-02-28T01:12:46Z"
  },
  {
    "title": "Denmark warns of interference from Russia, US in its election",
    "description": "Denmark’s intelligence services have warned that foreign powers may seek to interfere in the country’s March 24 general election, singling out Russia as the primary threat but also flagging the US and China as potential sources of influence.\nIn a statement pu…",
    "link": "https://www.scmp.com/news/world/europe/article/3344947/denmark-warns-interference-russia-us-its-election",
    "timestamp": "2026-02-28T01:10:37Z"
  },
  {
    "title": "Trump raises prospect of 'friendly takeover' of Cuba, says Rubio in talks",
    "description": "US President Donald Trump hints at a 'friendly takeover' of Cuba. He states the Cuban government is in 'big trouble' and talking with the US. Secretary of State Marco Rubio is reportedly handling the issue at a high level. Trump believes this change could be …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-raises-prospect-of-friendly-takeover-of-cuba-says-rubio-in-talks/articleshow/128870826.cms",
    "timestamp": "2026-02-28T01:09:55Z"
  },
  {
    "title": "Trump administration charges 30 more people for Minnesota church protest",
    "description": "The expanded indictment targets protesters who rallied at Cities Church in St Paul against Trump's immigration surge.",
    "link": "https://www.aljazeera.com/news/2026/2/28/trump-administration-charges-30-more-people-for-minnesota-church-protest",
    "timestamp": "2026-02-28T01:06:22Z"
  },
  {
    "title": "Trump Directs Federal Agencies to 'Immediately Cease' Use of Anthropic Technology",
    "description": "President Donald Trump announced that he was directing federal agencies to \"IMMEDIATELY CEASE all use of\" technology from AI giant Anthropic, adding there would be a \"Six Month phase out period\" for agencies using the company's products.\nThe post Trump Direct…",
    "link": "https://www.breitbart.com/politics/2026/02/27/trump-directs-federal-agencies-to-immediately-cease-use-of-anthropic-technology/",
    "timestamp": "2026-02-28T01:05:51Z"
  },
  {
    "title": "Hilary Knight not amused by Donald Trump comments",
    "description": "One of the biggest moments of the 2026 Olympic Winter Games in Milan/Cortina d’Ampezzo was when the United States won the gold medal in women’s hockey on February 19. In a dramatic gold medal game, the United States beat Canada…",
    "link": "https://www.thebiglead.com/hilary-knight-not-amused-by-donald-trump-comments/",
    "timestamp": "2026-02-28T01:05:28Z"
  },
  {
    "title": "U.S. men's Olympic hockey controversy explained: All about the backlash (and how the women's team responded)",
    "description": "The women's team captain, Hilary Knight, called the joke \"distasteful.\"",
    "link": "https://ew.com/olympic-hockey-team-white-house-controversy-explained-11916360",
    "timestamp": "2026-02-28T01:05:15Z"
  },
  {
    "title": "President Trump's joke sparks Las Vegas celebration for U.S. Women's Hockey champions",
    "description": "The U.S. women&apos;s hockey team is finally getting the celebration it deserves after an unforgettable 2-1 gold-medal win over Canada at the 2026 Milano Cortina Olympics-thanks to",
    "link": "https://www.marca.com/en/lifestyle/us-news/2026/02/28/69a23aacca4741f4268b4599.html",
    "timestamp": "2026-02-28T01:04:56Z"
  },
  {
    "title": "Retail customers file lawsuits over tariffs against FedEx and Ray-Bans maker",
    "description": "At least two retail customers have filed proposed class-action lawsuits against companies that have sued in trade court to ensure they receive refunds from tariffs now-deemed illegal",
    "link": "https://abcnews.com/Business/wireStory/retail-customers-file-lawsuits-tariffs-fedex-ray-bans-130581558",
    "timestamp": "2026-02-28T01:03:13Z"
  },
  {
    "title": "Confused Trump Says the Civil War and Reconstruction Were the Same Thing: ‘A Fancy Way of Saying the Civil War’",
    "description": "President Donald Trump botched 19th-century U.S. history on Friday, telling a crowd of supporters that the Civil War and Reconstruction were the same thing. \nThe post Confused Trump Says the Civil War and Reconstruction Were the Same Thing: ‘A Fancy Way of Sa…",
    "link": "https://www.mediaite.com/media/tv/confused-trump-says-the-civil-war-and-reconstruction-were-the-same-thing-a-fancy-way-of-saying-the-civil-war/",
    "timestamp": "2026-02-28T01:02:01Z"
  },
  {
    "title": "Bill Clinton to lawmakers investigating Epstein: 'I saw nothing'",
    "description": "Former President Bill Clinton appeared before Congress to discuss his association with Jeffrey Epstein. Clinton stated he observed no wrongdoing during their interactions.  His testimony marks a significant congressional event.  Democrats called for President…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/bill-clinton-to-lawmakers-investigating-epstein-i-saw-nothing/articleshow/128870722.cms",
    "timestamp": "2026-02-28T01:01:24Z"
  },
  {
    "title": "Trump Cuts Off Anthropic, AI Firm That Stood Against Killer Robots and Mass Surveillance",
    "description": "US President Donald Trump \"is throwing this tantrum and calling Anthropic 'radical left' because they refuse to have their AI be used for illegal mass surveillance and murder. That's literally it.\"That's how progressive commentator Kyle Kulinski described Tru…",
    "link": "https://www.commondreams.org/news/anthropic-trump",
    "timestamp": "2026-02-28T00:59:42Z"
  },
  {
    "title": "Satellite images show more aircraft at Saudi airbase used by US forces",
    "description": "Satellite imagery revealed a surge in U.S. military aircraft at Saudi Arabia’s Prince Sultan Airbase in February, including refuelling tankers and AWACS planes, as Washington increased forces amid tensions with Iran. Aircraft numbers rose from 27 to 43 before…",
    "link": "https://economictimes.indiatimes.com/news/defence/satellite-images-show-more-aircraft-at-saudi-airbase-used-by-us-forces/articleshow/128870645.cms",
    "timestamp": "2026-02-28T00:57:03Z"
  },
  {
    "title": "GAPKI sees zero tariff lifting US palm oil sales",
    "description": "The Indonesian Palm Oil Association (GAPKI) expects exports to the US to climb toward 3 million tons within three years if tariffs return to zero, as trade ...",
    "link": "https://en.antaranews.com/news/406406/gapki-sees-zero-tariff-lifting-us-palm-oil-sales",
    "timestamp": "2026-02-28T00:46:59Z"
  },
  {
    "title": "Anthropic vs Pentagon: The Trump administration is waging war on American genius",
    "description": "The US administration has barred government agencies from using AI tools made by Anthropic after a dispute over military access to its technology. The Pentagon also labelled the company a “supply chain risk,” a step that could block defence contractors from w…",
    "link": "https://economictimes.indiatimes.com/news/defence/anthropic-vs-pentagon-the-trump-administration-is-waging-war-on-american-genius/articleshow/128870529.cms",
    "timestamp": "2026-02-28T00:46:10Z"
  },
  {
    "title": "President Trump terminates AI tech deal following showdown",
    "description": "President Donald Trump terminated a government-tech contract with AI company Anthropic on Friday, following a public dispute with the Pentagon over ethical and national security concerns.",
    "link": "https://www.ketv.com/article/trump-anthropic-ban/70541722",
    "timestamp": "2026-02-28T00:45:24Z"
  },
  {
    "title": "President Trump terminates AI tech deal following showdown",
    "description": "President Donald Trump terminated a government-tech contract with AI company Anthropic on Friday, following a public dispute with the Pentagon over ethical and national security concerns.",
    "link": "https://www.wtae.com/article/trump-anthropic-ban/70541722",
    "timestamp": "2026-02-28T00:44:41Z"
  },
  {
    "title": "President Trump terminates AI tech deal following showdown",
    "description": "President Donald Trump terminated a government-tech contract with AI company Anthropic on Friday, following a public dispute with the Pentagon over ethical and national security concerns.",
    "link": "https://www.4029tv.com/article/trump-anthropic-ban/70541722",
    "timestamp": "2026-02-28T00:44:27Z"
  },
  {
    "title": "Treasury Department terminates union contracts for IRS and Bureau of the Fiscal Service workers",
    "description": "Workers at the Bureau of the Fiscal Service are also affected.",
    "link": "https://www.bostonherald.com/2026/02/27/treasury-union-contracts/",
    "timestamp": "2026-02-28T00:38:09Z"
  },
  {
    "title": "Trump orders federal agencies to stop using Anthropic AI in dispute over safety",
    "description": "The Trump administration has ordered all US agencies to stop using Anthropic's artificial intelligence technology and imposed other major penalties, culminating an unusually public clash between the government and the company over AI safeguards.",
    "link": "https://www.abc.net.au/news/2026-02-28/us-president-orders-six-month-phaseout-of-anthropic-technology/106400088",
    "timestamp": "2026-02-28T00:35:55Z"
  },
  {
    "title": "Trump orders federal agencies to stop using Anthropic AI in dispute over safety",
    "description": "The Trump administration has ordered all US agencies to stop using Anthropic's artificial intelligence technology and imposed other major penalties, culminating an unusually public clash between the government and the company over AI safeguards.",
    "link": "https://www.abc.net.au/news/2026-02-28/president-s-post-orders-six-month-phaseout-of-anthropic-technolo/106400088",
    "timestamp": "2026-02-28T00:35:55Z"
  },
  {
    "title": "Trump Predicts Unanimous Senate Vote for Hypothetical Ted Cruz SCOTUS Nom: ‘They Want to Get Him Out of There, He Is Such a Pain in the Ass’",
    "description": "Trump was introducing Cruz at a rally when he riffed on potentially nominating the senator to the court that recently shut down his emergency tariff powers.\nThe post Trump Predicts Unanimous Senate Vote for Hypothetical Ted Cruz SCOTUS Nom: ‘They Want to Get …",
    "link": "https://www.mediaite.com/media/tv/trump-predicts-unanimous-senate-vote-for-hypothetical-ted-cruz-scotus-nom-they-want-to-get-him-out-of-there-he-is-such-a-pain-in-the-ass/",
    "timestamp": "2026-02-28T00:35:40Z"
  },
  {
    "title": "Trump may hurl 'vulnerable' fall guy  overboard to fight Epstein heat: NYT reporter",
    "description": "President Donald Trump has an easy scapegoat to throw under the bus if he continues to feel the heat from the Jeffrey Epstein sex trafficking scandal, New York Times reporter Michelle Goldberg told MS NOW's Ari Melber on Friday: Commerce Secretary Howard Lutn…",
    "link": "https://www.rawstory.com/trump-epstein-2675373929/",
    "timestamp": "2026-02-28T00:34:18Z"
  },
  {
    "title": "Maryland Officials Demand $4B Tariff Reimbursement from Trump",
    "description": "Several Maryland officials demanded that President Donald Trump issue a $4 billion tariff reimbursement after the Supreme Court struck down Trump’s global tariffs imposed under the International Emergency Economic Powers Act (IEEPA). In a joint letter address…",
    "link": "https://www.breitbart.com/politics/2026/02/27/maryland-officials-demand-4b-tariff-reimbursement-from-trump/",
    "timestamp": "2026-02-28T00:33:22Z"
  },
  {
    "title": "Trump orders US agencies to stop using Anthropic technology in clash over AI safety",
    "description": "The Trump administration has ordered all U.S. government agencies to stop using artificial intelligence technology from Anthropic and imposed penalties on the company after a dispute over military access to its AI tools.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-orders-us-agencies-to-stop-using-anthropic-technology-in-clash-over-ai-safety/articleshow/128870385.cms",
    "timestamp": "2026-02-28T00:32:29Z"
  },
  {
    "title": "Trump orders US agencies to stop using Anthropic technology in clash over AI safety",
    "description": "The Trump administration has ordered all U.S. government agencies to stop using artificial intelligence technology from Anthropic and imposed penalties on the company after a dispute over military access to its AI tools.",
    "link": "https://economictimes.indiatimes.com/tech/technology/trump-orders-us-agencies-to-stop-using-anthropic-technology-in-clash-over-ai-safety/articleshow/128871712.cms",
    "timestamp": "2026-02-28T00:32:29Z"
  }
]