[
  {
    "title": "Do Democratic voters still care about scandals?",
    "description": "Democratic voters are facing questions in Maine and Virginia over how seriously to take personal scandals involving candidates for key races.",
    "link": "https://www.msnbc.com/inside-with-jen-psaki/graham-platner-jay-jones-scandals-democrats-blueprint-newsletter-rcna240585",
    "timestamp": "2025-10-29T21:27:50Z"
  },
  {
    "title": "Ex-LSU coach Ed Orgeron ‘would love’ to return after Brian Kelly firing",
    "description": "A familiar face would welcome an LSU reunion.",
    "link": "https://nypost.com/2025/10/29/sports/ed-orgeron-would-love-to-return-to-lsu-after-brian-kelly-firing/",
    "timestamp": "2025-10-29T21:26:24Z"
  },
  {
    "title": "Ex-LSU coach Ed Orgeron ‘would love’ to return after Brian Kelly firing",
    "description": "A familiar face would welcome an LSU reunion.",
    "link": "https://nypost.com/2025/10/29/sports/ed-orgeron-would-love-to-return-to-lsu-after-brian-kelly-firing/?utm_source=yahoo&amp;utm_campaign=nypost&amp;utm_medium=referral",
    "timestamp": "2025-10-29T21:26:24Z"
  },
  {
    "title": "Nvidia Becomes First Public Company to Hit $5 Trillion Market Capitalization Thanks to AI Demand",
    "description": "Nvidia has become the first publicly-held company to reach a $5 trillion market capitalization.Read More...",
    "link": "https://www.mactrast.com/2025/10/nvidia-becomes-first-public-company-to-hit-5-trillion-market-capitalization-thanks-to-ai-demand/",
    "timestamp": "2025-10-29T21:26:17Z"
  },
  {
    "title": "Trump and China's Xi are meeting in South Korea to try to roll back months of trade tensions",
    "description": "President Donald Trump and Chinese leader Xi Jinping are meeting face-to-face today in South Korea",
    "link": "https://abcnews.go.com/International/wireStory/trump-chinas-xi-meeting-south-korea-roll-back-126996456",
    "timestamp": "2025-10-29T21:25:49Z"
  },
  {
    "title": "Supreme Court handed Trump a 'loaded gun' — and he's pulling it in case after case: expert",
    "description": "Slate legal columnist Dahlia Lithwick issued a warning Wednesday that the U.S. Supreme Court has effectively opened the door for President Donald Trump to act with unprecedented freedom. MSNBC host Nicolle Wallace cited ABC News reporting that two Justice Dep…",
    "link": "https://www.rawstory.com/trump-immunity-2674247690/",
    "timestamp": "2025-10-29T21:24:38Z"
  },
  {
    "title": "Trump-Xi meeting nears with high stakes and hopes, but few details",
    "description": "A high-stakes meeting between President Donald Trump and Chinese President Xi Jinping could yield a breakthrough in the quarrelsome trade relationship between the two economic superpowers.\nBut while both the Trump administration and Beijing are projecting opt…",
    "link": "https://biztoc.com/x/915f6db0dceed67e",
    "timestamp": "2025-10-29T21:24:02Z"
  },
  {
    "title": "What shutdown? Trump isn’t canceling travel, golf or his ballroom even with the government shuttered",
    "description": "Other presidents have cut back on travel and events during past shutdowns, including Trump himself.",
    "link": "https://www.bostonherald.com/2025/10/29/government-shutdown-trump/",
    "timestamp": "2025-10-29T21:23:37Z"
  },
  {
    "title": "‘Sanaenomics’ – Takaichi revives Abe’s economic vision but with a twist",
    "description": "Sanae Takaichi, a hardline conservative with nationalist views, was elected as Japan’s first ever female prime minister on October 21. Known as a protege of the assassinated former Japanese prime minister, Shinzo Abe, she is assertive on defense, hawkish on C…",
    "link": "https://japantoday.com/category/features/opinions/Sanaenomics-%E2%80%93-Takaichi-revives-Abe%E2%80%99s-economic-vision-%E2%80%93-with-a-twist",
    "timestamp": "2025-10-29T21:22:34Z"
  },
  {
    "title": "Fuji from Air Force One",
    "description": "Air Force One with President Donald Trump aboard passes near Mount Fuji as he travels from Tokyo to South Korea on Wednesday.",
    "link": "https://japantoday.com/category/picture-of-the-day/fuji-from-air-force-one",
    "timestamp": "2025-10-29T21:20:44Z"
  },
  {
    "title": "Trump's Move To Replace 12 ICE Directors Could Mean More Aggressive and Unconstitutional Immigration Enforcement",
    "description": "To fill the roles, the Trump administration is turning to agents from Customs and Border Protection, the agency that has led aggressive immigration enforcement operations in Los Angeles and Chicago.",
    "link": "https://reason.com/2025/10/29/trumps-move-to-replace-12-ice-directors-could-mean-more-aggressive-and-unconstitutional-immigration-enforcement/",
    "timestamp": "2025-10-29T21:20:30Z"
  },
  {
    "title": "Justice Department withdraws filing that told truth about Jan. 6",
    "description": "Two Justice Department prosecutors cited a “mob of rioters” in their sentencing memo for Taylor Taranto, who got his Jan. 6 charges dismissed but still faced other charges.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/jan-6-doj-withdraws-filing-taylor-taranto-mob-rioters-rcna240570",
    "timestamp": "2025-10-29T21:20:01Z"
  },
  {
    "title": "EXCLUSIVE: 'Real Housewives' Divorce Bombshell — Bravo Star Could Be 'Individually Charged and Prosecuted in Criminal Court' If She Walks Away From Marriage",
    "description": "A 'Real Housewives' star could still be charged in criminal court if she were to walk away from her marriage, a legal expert shared.",
    "link": "https://radaronline.com/p/real-housewives-wendy-osefo-divorce-charged-in-criminal-court/",
    "timestamp": "2025-10-29T21:20:00Z"
  },
  {
    "title": "“I’ll do whatever I want”: Trump threatens to deploy other military branches in US cities",
    "description": "The president said he could send troops from other branches of the military into American cities.",
    "link": "https://www.salon.com/2025/10/29/ill-do-whatever-i-want-trump-threatens-to-deploy-other-military-branches-in-us-cities/",
    "timestamp": "2025-10-29T21:18:32Z"
  },
  {
    "title": "South Korea Courts Trump During Visit",
    "description": "East Asian countries are using a tried-and-true method to woo the U.S. president and secure better trade deals.",
    "link": "http://foreignpolicy.com/2025/10/29/trump-south-korea-visit-crown-trade-japan-apec/",
    "timestamp": "2025-10-29T21:18:12Z"
  },
  {
    "title": "Gavin Newsom: 5 Things to Know About the California Governor",
    "description": "Learn more about Gavin Newsom, the California governor at the center of recent political discussions and national attention.",
    "link": "https://hollywoodlife.com/feature/who-is-gavin-newsom-governor-california-3545424/",
    "timestamp": "2025-10-29T21:15:50Z"
  },
  {
    "title": "Trump-Xi meeting nears with high stakes and hopes, but few details",
    "description": "The bilat with President Donald Trump and Chinese President Xi Jinping comes just as a recent flare-up in U.S.-China trade relations has appeared to calm down.",
    "link": "https://www.cnbc.com/2025/10/29/trump-xi-meeting-trade.html",
    "timestamp": "2025-10-29T21:15:46Z"
  },
  {
    "title": "US Department of Homeland Security says it won't stop using videogame memes to stoke anti-immigrant sentiment: 'We aren't slowing down'",
    "description": "So far the agency has used Pokémon and Halo to promote immigrant crackdowns on social media, and there's likely more to come.",
    "link": "https://www.pcgamer.com/games/us-department-of-homeland-security-says-it-wont-stop-using-videogame-memes-to-stoke-anti-immigrant-sentiment-we-arent-slowing-down/",
    "timestamp": "2025-10-29T21:12:54Z"
  },
  {
    "title": "Pritzker’s Inaccurate Pushback on Chicago Murder Rate Claim",
    "description": "Defending Chicago in a recent Fox News interview, Illinois Gov. JB Pritzker said it was \"not in the top 30” of “big cities” with the highest rates of murder. But in 2024, Chicago had the 15th highest murder rate among U.S. cities with at least 250,000 residen…",
    "link": "https://www.factcheck.org/2025/10/pritzkers-inaccurate-pushback-on-chicago-murder-rate-claim/",
    "timestamp": "2025-10-29T21:12:28Z"
  },
  {
    "title": "Trump and Xi meet today to talk about their trade war",
    "description": "President Donald Trump said he has decided to lower his combined tariff rates on imports of Chinese goods to 47% after talks with Chinese leader Xi Jinping on curbing fentanyl trafficking. Trump’s aggressive use of tariffs since returning to the White House f…",
    "link": "https://apnews.com/article/trump-xi-china-trade-war-4c19a752c97828246c08f60f0dc54c79",
    "timestamp": "2025-10-29T21:12:26Z"
  },
  {
    "title": "Louisiana governor says he'll let Donald Trump pick next LSU football coach before athletic director does",
    "description": "It seems pretty clear that LSU AD Scott Woodward won't be leading the search for Brian Kelly's replacement.",
    "link": "https://sports.yahoo.com/college-football/breaking-news/article/louisiana-governor-says-hell-let-donald-trump-pick-next-lsu-football-coach-before-athletic-director-does-211057289.html",
    "timestamp": "2025-10-29T21:10:57Z"
  },
  {
    "title": "Does President Trump Actually Write His Own Tweets?",
    "description": "Trump posts just 5% of the tweets under his name, according to a new report.",
    "link": "https://gizmodo.com/does-president-trump-actually-write-his-own-tweets-2000678754",
    "timestamp": "2025-10-29T21:10:43Z"
  },
  {
    "title": "Inside a high-security Chinese factory pumping out fentanyl",
    "description": "YICHANG, China — Behind a large glass wall, a worker in full protective gear watches as hundreds of tiny glass bottles whizz by every minute, sterilized, filled and packaged by a ballet of robotic arms",
    "link": "https://www.nbcnews.com/world/asia/high-security-chinese-factory-pumping-fentanyl-rcna240439",
    "timestamp": "2025-10-29T21:10:15Z"
  },
  {
    "title": "Anca Faur Cause of Death: Buzz Aldrin’s Wife Passes Away at 66",
    "description": "Reading Time: 3 minutesAnca Faur, the wife of Buzz Aldren, has passed away at age 66.\nAnca Faur Cause of Death: Buzz Aldrin’s Wife Passes Away at 66 was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/anca-faur-cause-of-death-buzz-aldrins-wife-passes-away-at-66/",
    "timestamp": "2025-10-29T21:09:23Z"
  },
  {
    "title": "Putin aide weighs in on prospects for Ukraine peace",
    "description": "Russian President Vladimir Putin’s aide Kirill Dmitriev has expressed hope for peace in the Ukraine conflict within a year Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627120-dmitriev-russia-ukraine-peace/",
    "timestamp": "2025-10-29T21:09:01Z"
  },
  {
    "title": "Live: ASX set to dip as Federal Reserve divided on rates",
    "description": "The US central bank cut interest rates overnight but it wasn't a unanimous decision. James Hardie investors have ousted the company's chair and several directors in a backlash against a controversial takeover deal. Follow live.",
    "link": "https://www.abc.net.au/news/2025-10-30/asx-markets-business-live-news-30-oct/105950212",
    "timestamp": "2025-10-29T21:08:45Z"
  },
  {
    "title": "La. Gov. Jeff Landry says LSU AD Scott Woodward will not select Brian Kelly's replacement",
    "description": "Louisiana Gov. Jeff Landry expressed his apprehension with allowing LSU AD Scott Woodward to lead a football coaching search to replace Brian Kelly.",
    "link": "https://www.theadvertiser.com/story/sports/college/lsu/2025/10/29/jeff-landry-scott-woodward-lsu-football-brian-kelly-buyout-fired/86971001007/",
    "timestamp": "2025-10-29T21:07:50Z"
  },
  {
    "title": "Senate Democrats Cling To Shutdown As 40 Million Americans Face Food Aid Lapse",
    "description": "\"People are suffering\"",
    "link": "https://dailycaller.com/2025/10/29/senate-democrats-cling-to-shutdown-as-40-million-americans-face-food-aid-lapse/",
    "timestamp": "2025-10-29T21:07:26Z"
  },
  {
    "title": "Trump and China’s Xi are meeting in South Korea to try to roll back months of trade tensions",
    "description": "GYEONGJU, South Korea (AP) — President Donald Trump is set to meet face-to-face with Chinese leader Xi Jinping on Thursday, a chance for the leaders of the world’s two largest economies to stabilize relations after months of turmoil over trade issues. Trump’s…",
    "link": "https://financialpost.com/pmn/trump-and-chinas-xi-are-meeting-in-south-korea-to-try-to-roll-back-months-of-trade-tensions",
    "timestamp": "2025-10-29T21:06:54Z"
  },
  {
    "title": "US hockey star Brady Tkachuk opens up on Trump phone call ahead of 4-Nations face-off final vs Canada",
    "description": "U.S. hockey star Brady Tkachuk discussed President Donald Trump's locker room call before the 4 Nations Face-Off final and its impact heading into the Olympics.",
    "link": "https://www.foxnews.com/sports/us-hockey-star-brady-tkachuk-reflects-trump-phone-call-ahead-4-nations-face-off-final-vs-canada",
    "timestamp": "2025-10-29T21:05:02Z"
  },
  {
    "title": "'Itnullnullnullnullnullnullnullnullnullnull",
    "description": "Donald Trump on Wednesday told reporters aboard Air Force One en route to South Korea that he knows he's prohibited from serving a third term. The Constitution's 22nd Amendment establishes a two-term limit on the presidency. Still, Sloppy Steve Bannon, Sen. T…",
    "link": "https://crooksandliars.com/2025/10/there-it-trump-finally-says-hes-not",
    "timestamp": "2025-10-29T21:04:18Z"
  },
  {
    "title": "Donald Trump’s Bad Poll Numbers Have Turned Terrible",
    "description": "A new poll from The Economist/YouGov shows Trump’s approval rating, -18%, is the lowest it has ever been, even lower than in his first term, which was the lowest in modern presidential history\n\nDonald Trump's approval rating in our tracker has fallen to -18, …",
    "link": "https://crooksandliars.com/2025/10/donald-trump-s-bad-poll-numbers-have",
    "timestamp": "2025-10-29T21:03:32Z"
  },
  {
    "title": "CNBC Host Presses Don Jr. On Investments in Musk’s SpaceX and More: People ‘Wonder if This is Just Crony Capitalism’",
    "description": "Donald Trump Jr. on Wednesday disputed the claims that his investments present a conflict of interest with his father in the Oval Office.\nThe post CNBC Host Presses Don Jr. On Investments in Musk’s SpaceX and More: People ‘Wonder if This is Just Crony Capital…",
    "link": "https://www.mediaite.com/politics/cnbc-host-presses-don-jr-on-investments-in-musks-spacex-and-more-people-wonder-if-this-is-just-crony-capitalism/",
    "timestamp": "2025-10-29T21:02:33Z"
  },
  {
    "title": "Louisiana governor says LSU AD Scott Woodward will not be hiring Tigers' football coach",
    "description": "Louisiana governor Jeff Landry said LSU athletic director Scott Woodward will not be hiring the Tigers' next football coach after Brian Kelly's firing",
    "link": "https://www.usatoday.com/story/sports/ncaaf/2025/10/29/jeff-landry-scott-woodward-lsu-football-coaching-search-brian-kelly/86971657007/",
    "timestamp": "2025-10-29T21:02:03Z"
  },
  {
    "title": "Autonomous weapons need more guardrails as AI takes hold",
    "description": "Reed’s view\nIs it time for society to start having a serious discussion about autonomous weapons? With Presidents Donald Trump and Xi Jinping set to meet on Thursday, and Taiwan sure to be a topic of discussion, it’s clear that the US and China are both inves…",
    "link": "https://biztoc.com/x/6765afb5db23457d",
    "timestamp": "2025-10-29T21:01:50Z"
  },
  {
    "title": "Trump isn’t canceling travel, golf, or his ballroom, even with the government shuttered and 750,000 furloughed federal employees",
    "description": "President Donald Trump isn’t curtailing travel. He’s not avoiding golf or making do with a skeleton staff in the West Wing. Even hamburgers served at the White House aren’t from McDonalds, this time.\nIn shutdowns past — including during Trump’s first term — p…",
    "link": "https://biztoc.com/x/d3074163bf28b978",
    "timestamp": "2025-10-29T21:01:28Z"
  },
  {
    "title": "Republicans are growing tired of Marjorie Taylor Greene...",
    "description": "Greene has doubled down on her critiques of the speaker and his team, with the shutdown now well into its fourth week.",
    "link": "https://www.politico.com/news/2025/10/29/marjorie-taylor-greene-shutdown-attacks-00628195",
    "timestamp": "2025-10-29T21:00:03Z"
  },
  {
    "title": "Trump Signs Flurry Of  Rare Earths Deals In Asia",
    "description": "Trump has launched the United States’ most aggressive rare-earth and critical-minerals expansion in more than a decade, signing over $10 billion in supply-chain deals across Australia, Japan, Malaysia, and Thailand in less than a week. The flurry of agreement…",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Signs-Flurry-Of-Rare-Earths-Deals-In-Asia.html",
    "timestamp": "2025-10-29T21:00:00Z"
  },
  {
    "title": "Hegseth Reportedly To Announce Huge Overhaul To How America Arms Its Allies",
    "description": "War Secretary Pete Hegseth will reportedly announce a massive overhaul to how America provides weapons to allies around the world.",
    "link": "https://dailycaller.com/2025/10/29/hegseth-to-announce-massive-foreign-arms-overhaul/",
    "timestamp": "2025-10-29T20:59:58Z"
  },
  {
    "title": "House Dem Warns ‘MAGA Friends’ to Rethink Trump Drug Boat Strikes: They ‘Need to Imagine Who Gets Killed’ When AOC is President",
    "description": "Rep. Jim Himes (D-CT) warned MAGA to \"imagine who gets killed\" if AOC becomes president one day — while criticizing Trump striking suspected drug traffickers.\nThe post House Dem Warns ‘MAGA Friends’ to Rethink Trump Drug Boat Strikes: They ‘Need to Imagine Wh…",
    "link": "https://www.mediaite.com/politics/house-dem-warns-maga-friends-to-rethink-trump-drug-boat-strikes-they-need-to-imagine-who-gets-killed-when-aoc-is-president/",
    "timestamp": "2025-10-29T20:59:34Z"
  },
  {
    "title": "Jim Himes Insinuates AOC Could Kill Her Enemies As President Because MAGA Supports Striking Narco-Terrorists",
    "description": "Democratic Connecticut Rep. Jim Himes suggested on Wednesday that Democratic New York Rep. Alexandria Ocasio-Cortez could kill any of her enemies as president",
    "link": "https://dailycaller.com/2025/10/29/dem-rep-jim-himes-aoc-kill-enemies-narcoterrorists/",
    "timestamp": "2025-10-29T20:59:26Z"
  },
  {
    "title": "Report: Trump Advisers Weigh Holding Midterm Republican Convention in Las Vegas",
    "description": "President Trump's advisers are looking at holding a 2026 midterm Republican convention in Las Vegas shortly before early voting begins.\nThe post Report: Trump Advisers Weigh Holding Midterm Republican Convention in Las Vegas appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/29/report-trump-advisers-weigh-holding-midterm-republican-convention-las-vegas/",
    "timestamp": "2025-10-29T20:59:15Z"
  },
  {
    "title": "‘Bloodbath’: CBS ‘Race and Culture’ unit dies swift death as network sheds jobs",
    "description": "Cuts reportedly involve about 1,000 total employees across Paramount",
    "link": "https://www.wnd.com/2025/10/bloodbath-cbs-race-culture-unit-dies-swift-death/",
    "timestamp": "2025-10-29T20:57:28Z"
  },
  {
    "title": "New report details Trump’s devastating impact on Black America",
    "description": "A new report attempts to quantify Donald Trump’s government-assisted attacks on Black people and communities in the U.S.The “Blackout Report,” published this month by liberal consulting firm Onyx Impact, attempts an accounting of the many ways Trump’s policie…",
    "link": "https://www.msnbc.com/top-stories/latest/blackout-report-black-america-trump-onyx-impact-rcna239013",
    "timestamp": "2025-10-29T20:56:43Z"
  },
  {
    "title": "Nvidia Becomes First Company to Hit $5 Trillion Valuation on AI Momentum",
    "description": "Shares surge after major chip orders and geopolitical spotlight",
    "link": "https://finance.yahoo.com/news/nvidia-becomes-first-company-hit-205615350.html",
    "timestamp": "2025-10-29T20:56:15Z"
  },
  {
    "title": "Fed Interest Rate Cut Shows Trump Agenda 'Pushing Our Economy to the Brink': Economist",
    "description": "As Americans face tariff-related price hikes, surging health insurance premiums, and fallout from the government shutdown, from missed paychecks to no food assistance, the Federal Reserve on Wednesday announced its second interest rate cut of the year.\"Job ga…",
    "link": "https://www.commondreams.org/news/interest-rate-cuts-2025",
    "timestamp": "2025-10-29T20:53:35Z"
  },
  {
    "title": "WATCH: Chuck Schumer Will Not Say If He's Voting for Socialist Zohran Mamdani",
    "description": "Senate Minority Leader Chuck Schumer (D-NY) will not say if he is voting for socialist Zohran Mamdani in New York City's mayoral race next week.\nThe post WATCH: Chuck Schumer Will Not Say If He’s Voting for Socialist Zohran Mamdani appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/10/29/watch-chuck-schumer-will-not-say-if-hes-voting-for-socialist-zohran-mamdani/",
    "timestamp": "2025-10-29T20:53:21Z"
  },
  {
    "title": "Louisiana Governor Crushes LSU AD Scott Woodward For Giving Brian Kelly $100 Million Contract",
    "description": "Louisiana Governor Jeff Landry has addressed the Brian Kelly fiasco at LSU, and he’s not happy with Scott Woodward. Over the weekend, Landry got involved in the firing of Kelly after the team’s embarrassing blowout loss to LSU. I think @LSUsports and the LSU …",
    "link": "https://brobible.com/sports/article/louisiana-governor-jeff-landry-scott-woodward/",
    "timestamp": "2025-10-29T20:52:10Z"
  },
  {
    "title": "Turning Point table flipper threatened Trump, arrested by feds after firing from teaching assistant job: FBI",
    "description": "Federal agents arrested former Illinois State University teaching assistant Derek Lopez on federal charges for allegedly threatening President Donald Trump online.",
    "link": "https://www.foxnews.com/us/turning-point-table-flipper-threatened-trump-arrested-feds-after-firing-from-teaching-assistant-job-fbi",
    "timestamp": "2025-10-29T20:51:43Z"
  },
  {
    "title": "Giving Nvidia's Blackwell chip to China would slash US's AI advantage, experts say",
    "description": "By Karen Freifeld (Reuters) -If the Trump administration allows Nvidia to sell a version of its best AI chip to China, as the President opened the door to on...",
    "link": "https://finance.yahoo.com/news/giving-nvidias-blackwell-chip-china-204949665.html",
    "timestamp": "2025-10-29T20:49:49Z"
  },
  {
    "title": "Colorado sues Trump over Space Command move, calls relocation unconstitutional",
    "description": "Colorado files federal lawsuit against Trump, alleging unconstitutional retaliation over Space Command move to Alabama as punishment for state's mail-in voting.",
    "link": "https://www.foxnews.com/politics/colorado-sues-trump-over-space-command-move-calls-relocation-unconstitutional",
    "timestamp": "2025-10-29T20:48:56Z"
  },
  {
    "title": "Trump DOJ fights court order requiring Border Patrol boss to report daily on crackdowns",
    "description": "President Donald Trump's Department of Justice appealed a federal court order requiring an immigration official to attend court daily after he was found to be using excessive force against protesters, according to a new court filing. On Tuesday, U.S. District…",
    "link": "https://www.rawstory.com/trump-doj-2674247633/",
    "timestamp": "2025-10-29T20:48:23Z"
  },
  {
    "title": "With SNAP benefits set to halt, Thune says he can't clarify Trump's plan to fund program",
    "description": "With SNAP benefits set to halt, Thune says he can't clarify Trump's plan to fund programgo.com",
    "link": "https://abcnews.go.com/Politics/snap-benefits-set-halt-thune-clarify-trumps-plan/story?id=126980773",
    "timestamp": "2025-10-29T20:46:34Z"
  },
  {
    "title": "China Experts Offer Advice to Trump on Fentanyl Fight Ahead of Meeting With Xi",
    "description": "Tens of thousands of Americans are dying every year due to fentanyl, and China is complicit, warns author and China expert Gordon Chang. It’s now... Read More\nThe post China Experts Offer Advice to Trump on Fentanyl Fight Ahead of Meeting With Xi appeared fir…",
    "link": "https://www.dailysignal.com/2025/10/29/china-experts-offer-advice-trump-fentanyl-fight-ahead-meeting-with-xi/",
    "timestamp": "2025-10-29T20:45:07Z"
  },
  {
    "title": "House Candidate Kat Abughazaleh Calls Her Indictment for Protesting a “Political Prosecution”",
    "description": "On Wednesday, President Donald Trump’s Department of Justice unsealed an indictment against six protesters—including 26-year-old Democratic congressional candidate Kat Abughazaleh—for allegedly impeding an ICE officer outside of a federal immigration facility…",
    "link": "https://www.motherjones.com/politics/2025/10/kat-abughazaleh-chicago-trump-indictment-doj-political-perscution-ice/",
    "timestamp": "2025-10-29T20:41:51Z"
  },
  {
    "title": "Ex-Biden spox who asserted he saw ‘sharp’ prez frequently admits to seeing him twice in 2 years",
    "description": "Former Biden spokesperson Ian Sams, who aggressively defended the aging president as \"sharp\" and vigorous behind the scenes during the frenzy that ensued after his fumbling debate, privately admitted to House investigators that he barely met the 46th presiden…",
    "link": "https://nypost.com/2025/10/29/us-news/ex-biden-spox-who-asserted-he-saw-sharp-prez-frequently-admits-to-seeing-him-twice-in-2-years/",
    "timestamp": "2025-10-29T20:40:45Z"
  },
  {
    "title": "NCLA Asks Supreme Court to Uphold President’s Ability to Keep Federal Reserve Board Accountable",
    "description": "Donald J. Trump, President of the United States v. Lisa D. Cook, member of the Board of Governors of the Federal Reserve System, et al. Donald J. Trump, President of the United States v. Lisa D. Cook, member of the Board of Governors of the Federal Reserve Sy…",
    "link": "https://www.globenewswire.com/news-release/2025/10/29/3176923/0/en/NCLA-Asks-Supreme-Court-to-Uphold-President-s-Ability-to-Keep-Federal-Reserve-Board-Accountable.html",
    "timestamp": "2025-10-29T20:40:00Z"
  },
  {
    "title": "DOJ Suspends Prosecutors Who Accurately Described January 6 as a ‘Riot’ by a ‘Mob’",
    "description": "In the Trump administration's latest attempt to rewrite the history of the January 6, 2021 insurrection attempt at the US Capitol, the Department of Justice has suspended a pair of federal prosecutors who referred to the attack as a \"riot\" carried out by a \"m…",
    "link": "https://www.commondreams.org/news/doj-suspends-prosecutors-who-accurately-described-january-6-as-a-riot-by-a-mob",
    "timestamp": "2025-10-29T20:39:40Z"
  },
  {
    "title": "Trump's 'Golden Dome' Missile Defense Could Cost $3.6 Trillion: Report",
    "description": "The pie-in-the-sky space system promises to be a government spending bonanza—and might be a very bad idea.",
    "link": "https://reason.com/2025/10/29/trumps-golden-dome-missile-defense-could-cost-3-6-trillion-report/",
    "timestamp": "2025-10-29T20:36:38Z"
  },
  {
    "title": "FDA Encourages Cheaper Generics Of Pricey Medications",
    "description": "President Donald Trump’s top health advisers announced a push to cut health costs by bringing more cutting-edge generic drugs to market in a press conference on Wednesday. The Food and Drug Administration (FDA) will eliminate bureaucratic hurdles that protect…",
    "link": "https://dailycaller.com/2025/10/29/fda-encourages-cheaper-generic-medications/",
    "timestamp": "2025-10-29T20:36:14Z"
  },
  {
    "title": "Fed cuts interest rates for 2nd time, down quarter point",
    "description": "Trying to balance changes that address both inflation and unemployment",
    "link": "https://www.wnd.com/2025/10/fed-cuts-interest-rates-2nd-time-down-quarter/",
    "timestamp": "2025-10-29T20:35:22Z"
  },
  {
    "title": "The Worst Democratic Appointment of My Life",
    "description": "Yep, Biden really had his pulse on the nation--depoliticizing everything through having Merrick Garland as his AG was a real winner! Acting on a mix of principle and caution, Justice Department officials under former President Joe Biden made a series of decis…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/10/the-worst-democratic-appointment-of-my-life",
    "timestamp": "2025-10-29T20:35:16Z"
  },
  {
    "title": "I Grew Up Muslim in New Jersey After 9/11. I Know Why Attacking Zohran Works.",
    "description": "Islamophobia has long been one of the last socially acceptable forms of bigotry in American politics.",
    "link": "https://slate.com/news-and-politics/2025/10/zohran-mamdani-mayoral-race-nyc-islamophobia-cuomo.html",
    "timestamp": "2025-10-29T20:35:14Z"
  },
  {
    "title": "Trump calls Jack Smith a 'criminal' who should be in prison in latest attack on his perceived foes (Rebecca Shabad/NBC News)",
    "description": "Rebecca Shabad / NBC News:\nTrump calls Jack Smith a ‘criminal’ who should be in prison in latest attack on his perceived foes  —  Former special counsel Jack Smith oversaw the two federal criminal indictments against Trump when he was a presidential candidate…",
    "link": "https://www.memeorandum.com/251029/p111",
    "timestamp": "2025-10-29T20:35:02Z"
  },
  {
    "title": "Fed cuts key rate",
    "description": "The Federal Reserve cut its key interest rate Wednesday for a second time this year as it seeks to shore up economic growth and hiring even as inflation stays elevated.",
    "link": "https://www.bostonherald.com/2025/10/29/fed-cuts-key-rate/",
    "timestamp": "2025-10-29T20:34:51Z"
  },
  {
    "title": "CNN's Abby Phillip Defends Having 'MAGA People' On Her Show: 'It's An Opportunity'",
    "description": "The \"NewsNight\" host touched on two supporters of President Donald Trump who made particularly controversial comments on her show.",
    "link": "https://www.huffpost.com/entry/cnn-abby-phillip-defends-maga-guests-newsnight_n_690244a4e4b03f34d7f90ec9",
    "timestamp": "2025-10-29T20:34:30Z"
  },
  {
    "title": "Food aid at risk of expiring as effort to fund SNAP benefits fails in Senate",
    "description": "Food aid for more than 40 million Americans is at risk of expiring at week's end. Republican leaders in Congress said it’s all or nothing Wednesday as they rejected a Democratic push for a temporary fix. Senate Democratic leader Chuck Schumer said that SNAP b…",
    "link": "https://apnews.com/article/snap-benefits-government-shutdown-democrats-0cb0858eca47c90e2379f823d360083b",
    "timestamp": "2025-10-29T20:34:27Z"
  },
  {
    "title": "LeBron James and the complicated art of saying goodbye",
    "description": "Above the Rim is a season-long series of essays around the NBA that looks at the game far beyond the hardwood and box score. Instead, it’s an examination of the characters, storylines, and conversations that fuel an insatiable appetite for the game and the co…",
    "link": "https://andscape.com/features/lebron-james-lakers-complicated-art-of-saying-goodbye/",
    "timestamp": "2025-10-29T20:33:45Z"
  },
  {
    "title": "There Was Finally a Little Bit of Variety in Late Night’s Monologue Jokes",
    "description": "By\n Opheli Garcia Lawler\n Published: October 29th, 2025",
    "link": "https://www.cracked.com/article_48951_there-was-finally-a-little-bit-of-variety-in-late-nights-monologue-jokes.html",
    "timestamp": "2025-10-29T20:30:00Z"
  },
  {
    "title": "New Jersey Democrat breaks ranks to support Republican Jack Ciattarelli for governor",
    "description": "New Jersey Democratic councilman endorses Republican Jack Ciattarelli over party nominee Mikie Sherrill in tight governor race, citing dissatisfaction with Democratic candidate.",
    "link": "https://www.foxnews.com/media/new-jersey-democrat-breaks-ranks-support-republican-jack-ciattarelli-governor",
    "timestamp": "2025-10-29T20:27:54Z"
  },
  {
    "title": "CyberCorps talent pipeline buckles under Trump hiring freezes",
    "description": "The cornerstone program for training and placing student talent into government cybersecurity positions has been hobbled by recent federal employment logjams, jeopardizing workforce pipelines and leaving many recruits burdened by debt.",
    "link": "https://www.nextgov.com/cybersecurity/2025/10/cybercorps-talent-pipeline-buckles-under-trump-hiring-freezes/409145/",
    "timestamp": "2025-10-29T20:27:00Z"
  },
  {
    "title": "How Many Kids Does Elon Musk Have? Get to Know His 14 Children (and Their 4 Moms)",
    "description": "Here is everything we know about Elon Musk’s 14 children, who he shares with four partners: Justine Wilson, Grimes, Shivon Zilis, and Ashley St. Clair.",
    "link": "https://www.cosmopolitan.com/entertainment/celebs/a68004709/elon-musk-kids/",
    "timestamp": "2025-10-29T20:25:00Z"
  },
  {
    "title": "Trump Says Trade Deal with South Korea ‘Pretty Much Finalized’",
    "description": "President Donald Trump said that he and South Korean President Lee Jae-myung have worked out most of the details of a bilateral trade deal.\nThe post Trump Says Trade Deal with South Korea ‘Pretty Much Finalized’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/10/29/trump-says-trade-deal-south-korea-pretty-much-finalized/",
    "timestamp": "2025-10-29T20:24:49Z"
  },
  {
    "title": "CBS ‘Race And Culture’ Unit Dies Swift Death As Outlet Sheds Jobs Under Bari Weiss",
    "description": "CBS News Editor-in-Chief Bari Weiss’ tenure began with significant layoffs announced by Paramount Skydance CEO David Ellison in a memo, The Guardian reported.",
    "link": "https://dailycaller.com/2025/10/29/cbs-race-culture-unit-dies-outlet-sheds-jobsbari-weiss/",
    "timestamp": "2025-10-29T20:23:42Z"
  },
  {
    "title": "Transmissions From The Multiverse: The Feature Google AI Said Is Our Destiny",
    "description": "This post was not written by AI. But an AI would say that, wouldn't it?",
    "link": "https://www.wonkette.com/p/transmissions-from-the-multiverse",
    "timestamp": "2025-10-29T20:20:24Z"
  },
  {
    "title": "Here's what happened today: Wednesday",
    "description": "More issues at RTÉ, Hurricane Melissa passes through Cuba and DJ Carey court hearing postponed.",
    "link": "https://www.thejournal.ie/news-fix-wednesday-65-6859693-Oct2025/",
    "timestamp": "2025-10-29T20:18:19Z"
  },
  {
    "title": "Trump and Xi's High-Profile Summit Is About to Kick Off. What's on the Agenda",
    "description": "7 min ago\nTrump and Xi's High-Profile Summit Is About to Kick Off. What's on the Agenda.\nPresident Donald Trump and Chinese leader Xi Jinping’s much-anticipated meeting is set for 11 am local time in South Korea, with Trump set to depart Asia about two hours …",
    "link": "https://biztoc.com/x/ba7e1574d1c712b4",
    "timestamp": "2025-10-29T20:18:01Z"
  },
  {
    "title": "Why Trump’s DOJ Hasn’t Thrown The Book At Tyler Robinson — Yet",
    "description": "The DOJ has yet to prosecute Tyler Robinson in the killing of Charlie Kirk more than a month after his arrest as evidence piles up in Robinson's Utah case.",
    "link": "https://dailycaller.com/2025/10/29/why-trumps-doj-hasnt-thrown-the-book-at-tyler-robinson-yet/",
    "timestamp": "2025-10-29T20:17:49Z"
  },
  {
    "title": "Federal Trial Over Trump’s Portland Guard Deployment Highlights Chaos, Conflicting Testimony",
    "description": "The federal trial over Trump's National Guard in Portland, as both sides gave their opening arguments and a witness police witness testifying.",
    "link": "https://dailycaller.com/2025/10/29/federal-trial-over-trumps-portland-guard-deployment-highlights-chaos-conflicting-testimony/",
    "timestamp": "2025-10-29T20:17:11Z"
  },
  {
    "title": "‘Morning Joe’ Rips GOP Leaders’ ‘Ignorance’ on SNAP Cuts: ‘They Think They’re Owning the Libs’ | Video",
    "description": "\"When in fact, it's their constituents who disproportionately take from the government,\" co-host Joe Scarborough says of Alabama Sen. Tommy Tuberville\nThe post ‘Morning Joe’ Rips GOP Leaders’ ‘Ignorance’ on SNAP Cuts: ‘They Think They’re Owning the Libs’ | Vi…",
    "link": "https://www.thewrap.com/morning-joe-tommy-tuberville-republicans-snap-benefits/",
    "timestamp": "2025-10-29T20:14:56Z"
  },
  {
    "title": "Food aid at risk of expiring as effort to fund SNAP benefits fails in Senate",
    "description": "Food aid for more than 40 million Americans is at risk of expiring at week's end.",
    "link": "https://www.bostonherald.com/2025/10/29/snap-benefits-senate/",
    "timestamp": "2025-10-29T20:14:50Z"
  },
  {
    "title": "Food aid at risk of expiring as effort to fund SNAP benefits fails in Senate",
    "description": "Food aid for more than 40 million Americans is at risk of expiring at week's end.",
    "link": "https://www.denverpost.com/2025/10/29/snap-benefits-senate/",
    "timestamp": "2025-10-29T20:14:50Z"
  },
  {
    "title": "US deal to divest TikTok could be finalized in South Korea",
    "description": "The Trump administration has been signaling that it may have finally reached a deal with China to keep TikTok running in the U.S., with the two countries finalizing the details as soon as Thursday",
    "link": "https://www.wsbtv.com/news/business/white-house-says/XUKOZGDQXIYYJATNXAOF73NBU4/",
    "timestamp": "2025-10-29T20:14:34Z"
  },
  {
    "title": "The tariffs case is Trump’s ultimate loyalty test for the Supreme Court",
    "description": "As recently as one year ago, the Supreme Court’s Republican majority was determined to reduce executive power. Joe Biden, a Democrat, was in the White House, and the Republican justices were very concerned that the executive branch was claiming “highly conseq…",
    "link": "https://www.vox.com/politics/466510/supreme-court-trump-tariffs-loyalty-test-major-questions",
    "timestamp": "2025-10-29T20:13:32Z"
  },
  {
    "title": "‘Star Candidates’ — Leftist PAC Likens Virginia Democratic Nominee To Zohran Mamdani",
    "description": "Emgage Action's subsidiary named Democrat Virginia candidate Ghazala Hashmi and Democrat New York City candidate Zohran Mamdani \"star candidates.\"",
    "link": "https://dailycaller.com/2025/10/29/ghazala-hashmi-zohran-mamdani-virginia-emgage-action-leftists-muslims-trump/",
    "timestamp": "2025-10-29T20:09:53Z"
  },
  {
    "title": "Warren, Sanders Blast Trump Admin for Legitimizing 'Dangerous' Bitcoin and Crypto 401Ks",
    "description": "In a letter sent to the SEC and Department of Labor, the senators warned that the Trump admin’s push to expose the $31 trillion retirement savings industry to crypto could end in disaster.",
    "link": "https://decrypt.co/346685/warren-sanders-blast-trump-admin-legitimizing-dangerous-bitcoin-crypto-401ks",
    "timestamp": "2025-10-29T20:09:26Z"
  },
  {
    "title": "Vance says 1.3 million U.S. troops will be paid at the end of the week as pressure mounts for Democrats to end the shutdown",
    "description": "“We do think that we can continue paying the troops, at least for now,” Vance told reporters on Tuesday.",
    "link": "https://fortune.com/2025/10/29/vance-trump-troops-congress-federal-government-shutdown-history/",
    "timestamp": "2025-10-29T20:07:35Z"
  },
  {
    "title": "Air Traffic Staffing Issues Amid Shutdown Cause Ground Stop At Newark",
    "description": "Air traffic controllers are calling out of work in greater numbers—often forcing the Federal Aviation Administration (FAA) to slow traffic at some of the nation’s busiest airports.",
    "link": "https://www.forbes.com/sites/suzannerowankelleher/2025/10/29/air-traffic-staffing-triggers-shutdown-ground-stop-newark/",
    "timestamp": "2025-10-29T20:07:13Z"
  },
  {
    "title": "These Republican cowards won't call out Trump even as he decimates their state",
    "description": "There was a time in the distant past when Idaho elected officials had moral compasses and were dedicated to serving the interests of the Gem State. Since agriculture is so important to the Idaho economy, they were constantly on guard against federal plans and…",
    "link": "https://www.rawstory.com/trump-beef-2674246299/",
    "timestamp": "2025-10-29T20:07:03Z"
  },
  {
    "title": "In rare move, top Republican lawmakers criticize US troop reduction in Romania",
    "description": "WASHINGTON (Reuters) -The top two Republican lawmakers who lead the Pentagon's oversight committees in the U.S. Congress issued a rare joint statement on Wednesday slamming the Trump's administration's decision to reduce the number of troops in Romania. Read …",
    "link": "https://www.thestar.com.my/news/world/2025/10/30/in-rare-move-top-republican-lawmakers-criticize-us-troop-reduction-in-romania",
    "timestamp": "2025-10-29T20:06:00Z"
  },
  {
    "title": "Live: Labor to introduce long-awaited environmental protection bill to parliament",
    "description": "Labor will introduce its overhauled environmental protection laws to parliament today, despite opposition to the bill from the Coalition and Greens. Follow live.",
    "link": "https://www.abc.net.au/news/2025-10-30/federal-politics-live-blog-oct-30/105949134",
    "timestamp": "2025-10-29T20:03:01Z"
  },
  {
    "title": "US Needs 'Finesse' to Stay Ahead of China, Nvidia Boss Says",
    "description": "Nvidia chief executive Jensen Huang said that maintaining the US edge in AI will require a steady approach that ensures China remains hooked on American technology. From a report: The chipmaker is in an \"awkward place\" as President Donald Trump prepares to me…",
    "link": "https://news.slashdot.org/story/25/10/29/1722259/us-needs-finesse-to-stay-ahead-of-china-nvidia-boss-says",
    "timestamp": "2025-10-29T20:01:00Z"
  },
  {
    "title": "Kamala Harris must tread the Richard Nixon path to the White House",
    "description": "Richard Nixon did what Kamala Harris wants to. But for her to get to the White House, she is going to have to make tough decisions she has failed to in the past.",
    "link": "https://www.abc.net.au/news/2025-10-30/kamala-harris-joe-biden-issues-behind-her-for-white-house/105947760",
    "timestamp": "2025-10-29T20:00:50Z"
  }
]