[
  {
    "title": "The Trump Administration Is Turning Its Back on More Than 40 Million Hungry Americans",
    "description": "When we turn back the clocks this weekend, the Trump administration will simultaneously turn its back on nearly 42 million people in this country—those who rely on the Supplemental Nutrition Assistance Program (SNAP) to make a warm, healthy meal.\nThe majority…",
    "link": "https://msmagazine.com/2025/10/30/trump-republicans-shutdown-snap-food-stamps-women/",
    "timestamp": "2025-10-30T16:21:56Z"
  },
  {
    "title": "How Americans feel about changing the clocks, according to a new AP-NORC poll",
    "description": "Only 12% of U.S. adults favor the current system of daylight saving time.",
    "link": "https://www.bostonherald.com/2025/10/30/ap-poll-daylight-saving-time/",
    "timestamp": "2025-10-30T16:20:55Z"
  },
  {
    "title": "Elon Musk DOGE Stooge Just Got Control of Billions of Military Dollars",
    "description": "Donald Trump has replaced an experienced admiral with a 33-year-old with no naval experience.",
    "link": "https://newrepublic.com/post/202466/donald-trump-elon-musk-doge-navy",
    "timestamp": "2025-10-30T16:19:30Z"
  },
  {
    "title": "The Last Temptation Of Andrew Cuomo",
    "description": "Spoiler, it's racism!",
    "link": "https://www.wonkette.com/p/the-last-temptation-of-andrew-cuomo",
    "timestamp": "2025-10-30T16:15:26Z"
  },
  {
    "title": "What the Latest Trump-Xi Meeting Means for Luxury’s Recovery in China",
    "description": "With a palpable rebound in energy, Erwan Rambourg of HSBC believes the stalemate over the past 24 months in the luxury sector in China is over.",
    "link": "http://wwd.com/business-news/government-trade/trump-xi-deal-impact-on-luxury-recovery-china-1238327911/",
    "timestamp": "2025-10-30T16:14:44Z"
  },
  {
    "title": "Trump’s Social Security Commissioner Should Resign Immediately",
    "description": "The following is a statement from Nancy Altman, President of Social Security Works: “This week, Fiserv’s stock price plunged by over 40 percent. The current CEO said that the decline happened because of exaggerated projections made by the previous CEO, Frank …",
    "link": "https://www.commondreams.org/newswire/trumps-social-security-commissioner-should-resign-immediately",
    "timestamp": "2025-10-30T16:14:26Z"
  },
  {
    "title": "Video shows Zohran Mamdani fervently shouting about defunding ‘Israeli settler violence’ just months before Oct. 7",
    "description": "Socialist mayoral frontrunner Zohran Mamdani fervently shouted about defunding “Israeli settler violence” at a Big Apple rally — just months before Hamas carried out its deadly Oct. 7, 2023 terror attack, newly surfaced video shows. Mamdani was filmed repeate…",
    "link": "https://freerepublic.com/focus/f-news/4349628/posts",
    "timestamp": "2025-10-30T16:14:09Z"
  },
  {
    "title": "Trump Absolutely Craters With Young Voters in New Poll — Whopping 63-Point Swing i Net Approval",
    "description": "Trump's support among young voters has absolutely cratered in a new poll with a massive 63-point swing in net approval since the beginning of his second term.\nThe post Trump Absolutely Craters With Young Voters in New Poll — Whopping 63-Point Swing i Net Appr…",
    "link": "https://www.mediaite.com/media/news/trump-absolutely-craters-with-young-voters-in-new-poll-whopping-63-point-swing-i-net-approval/",
    "timestamp": "2025-10-30T16:13:46Z"
  },
  {
    "title": "Last-minute scramble over pay takes a toll on military families during the shutdown",
    "description": "Treasury Secretary Bessent said money may be unavailable for the troop's next paycheck.",
    "link": "https://www.bostonherald.com/2025/10/30/military-pay-shutdown/",
    "timestamp": "2025-10-30T16:13:04Z"
  },
  {
    "title": "‘Truly great’: Trump negotiates with China over rare earths, soybeans",
    "description": "'We have a deal. Now every year we’ll renegotiate the deal'",
    "link": "https://www.wnd.com/2025/10/truly-great-trump-negotiates-china-rare-earths-soybeans/",
    "timestamp": "2025-10-30T16:12:59Z"
  },
  {
    "title": "Farage 'sad' as constituency village named most deprived",
    "description": "The Reform MP reacts after the Essex neighbourhood topped the ranking for the most deprived.",
    "link": "https://www.bbc.com/news/articles/cp85jz7xe4mo",
    "timestamp": "2025-10-30T16:12:13Z"
  },
  {
    "title": "DOJ Removes Trump Reference in Jan. 6 Defendant Court Document",
    "description": "The Justice Department has quietly filed a revised sentencing memorandum in the case of Taylor Taranto, a Washington state man convicted of weapons and threat-related offenses after being arrested near former President Barack Obama’s home, removing earlier re…",
    "link": "https://biztoc.com/x/87d2565250b691bd",
    "timestamp": "2025-10-30T16:12:10Z"
  },
  {
    "title": "Full List of Trump Appointees Found to Be Serving Illegally",
    "description": "A federal judge ruled that a prosecutor appointed by President Donald Trump was serving illegally in a ruling filed Tuesday.\nU.S. District Judge J. Michael Seabright of the Central District of California said Bilal A. Essayli “is not lawfully serving” as acti…",
    "link": "https://biztoc.com/x/b533359836d1a576",
    "timestamp": "2025-10-30T16:11:57Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on whether to repeal Trump’s global tariffs",
    "description": "The Senate is taking a series of votes this week to terminate the national emergencies that President Donald Trump has used to impose tariffs. The resolutions won't ultimately take effect.",
    "link": "https://biztoc.com/x/724219797916da20",
    "timestamp": "2025-10-30T16:11:54Z"
  },
  {
    "title": "Massachusetts advancing $4M to help with food aid amid SNAP standoff",
    "description": "Ahead of public food benefits running out for over a million Bay Staters on Saturday, Gov. Maura Healey announced Thursday that the state will advance a scheduled $4 million payment for food pantries — but is not tapping into the state's reserves, despite cal…",
    "link": "https://www.bostonherald.com/2025/10/30/massachusetts-advancing-4m-to-help-with-food-aid-amid-snap-standoff/",
    "timestamp": "2025-10-30T16:11:36Z"
  },
  {
    "title": "These Small Business Owners Explain How Trump's Tariffs Are More of an 'Existential Crisis' Than COVID",
    "description": "President Donald Trump has imposed tariffs on $2.2 trillion worth of imported goods, claiming they protect domestic producers. Ironically, American small businesses are among those bearing the heaviest burden of these taxes. Now, these businesses are telling …",
    "link": "https://biztoc.com/x/cd6d106d87ae4493",
    "timestamp": "2025-10-30T16:11:22Z"
  },
  {
    "title": "The US is unlikely to test nuclear weapons, despite what Trump says",
    "description": "President Donald Trump appears to have ordered a return to nuclear testing after decades of uneasy but effective treaties banning the practice – but will it actually happen?",
    "link": "https://www.newscientist.com/article/2502130-the-us-is-unlikely-to-test-nuclear-weapons-despite-what-trump-says/",
    "timestamp": "2025-10-30T16:10:12Z"
  },
  {
    "title": "Trump's surgeon general pick goes into labour before confirmation hearing",
    "description": "Casey Means, who does not have an active medical license, is known for her scepticism of conventional medicine and elements of childhood vaccination.",
    "link": "https://www.bbc.com/news/articles/c3rjv93vj2do",
    "timestamp": "2025-10-30T16:08:49Z"
  },
  {
    "title": "Trump call for nuclear tests sows confusion",
    "description": "President Donald Trump Thursday sowed confusion among experts with his call for the start of nuclear weapons testing, with some pundits interpreting the announcement as US preparations for a shock resumption of explosive testing after more than 30 years. The …",
    "link": "https://www.digitaljournal.com/world/trump-call-for-nuclear-tests-sows-confusion/article",
    "timestamp": "2025-10-30T16:07:20Z"
  },
  {
    "title": "Bipartisan Senators Bring Forth the ‘No Coffee Tax Act’",
    "description": "Senators Catherine Cortez Masto (D-Nevada) and Rand Paul (R-Kentucky) this week brought forth the “No Coffee Tax Act,” proposing to repeal all Donald Trump-era tariffs on coffee while preventing...",
    "link": "https://dailycoffeenews.com/2025/10/30/bipartisan-senators-bring-forth-the-no-coffee-tax-act/",
    "timestamp": "2025-10-30T16:06:27Z"
  },
  {
    "title": "AI Chip Sales to China: A Risky Gamble?",
    "description": "Republican Leader Equates Selling Nvidia AI Chips to China with Nuclear Proliferation A leading Republican on the US Congress China policy has stated that selling Nvidia’s cutting-edge AI chips to China would be like giving “weapons-grade uranium to Iran.” Ac…",
    "link": "https://nep123.com/ai-chip-sales-to-china-a-risky-gamble/",
    "timestamp": "2025-10-30T16:05:50Z"
  },
  {
    "title": "J.B. Pritzker Wants ICE Operations Halted in Chicago for Halloween: 'Let Children Be Children'",
    "description": "Gov. J.B. Pritzker (D-IL) wants federal officials to halt immigration operations in Chicago over the Halloween weekend, even as residents welcome their presence after enduring years of illegal alien crime.\nThe post J.B. Pritzker Wants ICE Operations Halted in…",
    "link": "https://www.breitbart.com/immigration/2025/10/30/j-b-pritzker-wants-ice-operations-halted-in-chicago-for-halloween-let-children-be-children/",
    "timestamp": "2025-10-30T16:05:44Z"
  },
  {
    "title": "Jasmine Crockett Accepts Trump's Challenge to Take His 'IQ Test,' Then Studies by Identifying Picture of Elephant",
    "description": "\"I know that he can't seem to find himself in the Oval Office to make sure that he can end this shutdown, but he does have time to troll me. So listen, if...",
    "link": "https://people.com/jasmine-crockett-accepts-donald-trump-challenge-to-take-his-iq-test-studies-by-identifying-photo-elephant-11840116",
    "timestamp": "2025-10-30T16:05:36Z"
  },
  {
    "title": "Ukraine Defends U.S. 'Embargo' on Cuba at U.N., Shuts Down Havana Embassy",
    "description": "The government of Ukraine confirmed on Wednesday that it is shutting down its embassy in Havana, Cuba, in response to the Communist Party offering thousands of mercenaries to Russia to participate in the ongoing invasion of its territory.\nThe post Ukraine Def…",
    "link": "https://www.breitbart.com/latin-america/2025/10/30/ukraine-defends-u-s-embargo-on-cuba-at-u-n-shuts-down-havana-embassy/",
    "timestamp": "2025-10-30T16:05:28Z"
  },
  {
    "title": "WATCH LIVE: Senate expected to vote on whether to repeal Trump’s global tariffs",
    "description": "The Senate is taking a series of votes this week to terminate the national emergencies that President Donald Trump has used to impose tariffs. The resolutions won't ultimately take effect.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-expected-to-vote-on-whether-to-repeal-trumps-global-tariffs",
    "timestamp": "2025-10-30T16:04:32Z"
  },
  {
    "title": "Mike Johnson’s House Is Fox News With a Gavel",
    "description": "Chris Lehmann\n\n\n\nThe House Speaker admits that his legislative chamber no longer matters. That’s the outcome of a series of deliberate leadership decisions to ensure its powerlessness.\r\n\n\r\n\n\nThe post Mike Johnson’s House Is Fox News With a Gavel appeared firs…",
    "link": "https://www.thenation.com/article/politics/mike-johnson-house-shutdown/",
    "timestamp": "2025-10-30T16:03:27Z"
  },
  {
    "title": "Democrats hope for a 'shot in the arm' in New Jersey and Virginia after 2024 losses",
    "description": "The Democratic candidates' focus on affordability could provide a future road map for the party, even as they’ve danced around trans rights and immigration.",
    "link": "https://www.nbcnews.com/politics/elections/democrats-hope-shot-arm-new-jersey-virginia-2024-losses-rcna240731",
    "timestamp": "2025-10-30T16:02:46Z"
  },
  {
    "title": "Trump Blames Obamacare for Premium Hikes His Own Policies Created",
    "description": "Trump is calling for a cheaper, more effective health care system. Medicare for All fits both of those criteria.",
    "link": "https://truthout.org/articles/trump-blames-obamacare-for-premium-hikes-his-own-policies-created/",
    "timestamp": "2025-10-30T16:02:33Z"
  },
  {
    "title": "Trump ends Asia trip with Xi meeting, nuke threat",
    "description": "Trump had spent the last six days in Asia",
    "link": "https://theweek.com/politics/trump-asia-xi-nuke",
    "timestamp": "2025-10-30T16:00:44Z"
  },
  {
    "title": "Apple reports fourth quarter earnings after the bell",
    "description": "The fourth quarter, which runs through the end of September, is the first quarter that includes sales from new iPhone 17 models.",
    "link": "https://www.cnbc.com/2025/10/30/apple-aapl-earnings-report-q4-2025.html",
    "timestamp": "2025-10-30T16:00:01Z"
  },
  {
    "title": "The “Betrayal List” trend turns a Kanye West meltdown into group therapy",
    "description": "Social media has found a cathartic new outlet for their daily frustrations: by turning them into a “betrayal list.” The trend, which riffs on a now-deleted Kanye West post listing everyone he believed wronged him (which included Harriet Tubman as well as his …",
    "link": "https://www.dailydot.com/culture/betrayal-list-trend-tiktok/",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "The left’s new religion has no logic — and AOC is its perfect preacher",
    "description": "As New York City heads into its next mayoral election, Rep. Alexandria Ocasio-Cortez (D-N.Y.) is doing few favors for the campaign of Zohran Mamdani — at least not for those who value coherence. Her remarks at a recent rally could serve as a Logic 101 case st…",
    "link": "https://www.theblaze.com/columns/opinion/the-lefts-new-religion-has-no-logic-and-aoc-is-its-perfect-preacher",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "Bringing peace to Gaza a top priority, says Anwar",
    "description": "KUALA LUMPUR: Malaysia has been consistent in calling for a comprehensive peace solution for Gaza, including during every engagement with US President Donald Trump during the 47th Asean Summit and Related Summits, says the Prime Minister. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/10/31/bringing-peace-to-gaza-a-top-priority-says-anwar",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "U.S. Physical Therapy Clinics Back-Office Software Market Insights and Growth Outlook by Towards Healthcare",
    "description": "This report, published by Towards Healthcare, a sister firm of Precedence Research, provides an insightful overview of the U.S. physical therapy clinics back-office software market. It highlights key trends, growth drivers, and technological innovations shapi…",
    "link": "https://www.globenewswire.com/news-release/2025/10/30/3177714/0/en/U-S-Physical-Therapy-Clinics-Back-Office-Software-Market-Insights-and-Growth-Outlook-by-Towards-Healthcare.html",
    "timestamp": "2025-10-30T16:00:00Z"
  },
  {
    "title": "Trump says Nvidia chip talks with Xi didn’t cover Blackwell",
    "description": "(Bloomberg/Mackenzie Hawkins) — US President Donald Trump said he didn’t discuss approving sales of Nvidia Corp.’s Blackwell chips to China with his counterpart Xi Jinping, dampening speculation that Washington will allow exports of the powerful AI accelerato…",
    "link": "https://biztoc.com/x/2f8b15ee1bd39a90",
    "timestamp": "2025-10-30T15:59:59Z"
  },
  {
    "title": "FBI targeted hundreds of Republicans in Trump probe – Senate records",
    "description": "Senate records show that nearly 400 GOP members were subpoenaed in the investigation into alleged 2020 election interference Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627161-fbi-probe-targeted-republicans/",
    "timestamp": "2025-10-30T15:59:50Z"
  },
  {
    "title": "New Trump rule bars student loan relief for public workers tied to ‘illegal’ activity",
    "description": "The move could cut off some teachers, doctors and other public workers from federal loan cancellation.",
    "link": "https://www.pbs.org/newshour/education/new-trump-rule-bars-student-loan-relief-for-public-workers-tied-to-illegal-activity",
    "timestamp": "2025-10-30T15:58:26Z"
  },
  {
    "title": "Last-minute scramble over pay takes a toll on military families during the shutdown",
    "description": "The government shutdown is taking a toll on military families as they live without the guarantee of a paycheck",
    "link": "https://abcnews.go.com/US/wireStory/minute-scramble-pay-takes-toll-military-families-shutdown-127023037",
    "timestamp": "2025-10-30T15:57:50Z"
  },
  {
    "title": "These Small Business Owners Explain How Trump's Tariffs Are More of an 'Existential Crisis' Than COVID",
    "description": "President Donald Trump says his tariffs protect American businesses, but more than 700 small businesses represented by We Pay The Tariffs beg to differ.",
    "link": "https://reason.com/2025/10/30/these-small-business-owners-explain-how-trumps-tariffs-are-more-of-an-existential-crisis-than-covid/",
    "timestamp": "2025-10-30T15:55:53Z"
  },
  {
    "title": "US delays expansion of export restrictions on Chinese firms after Trump-Xi meeting, Bessent says",
    "description": "will suspend for one year a new measure that vastly expanded the number of Chinese firms facing tough restrictions on access to U. Treasury Secretary Scott...",
    "link": "https://www.yahoo.com/news/articles/us-delays-expansion-export-restrictions-155516401.html",
    "timestamp": "2025-10-30T15:55:16Z"
  },
  {
    "title": "Gold Pushes Higher as Market Digests Outcome of Xi-Trump Meeting",
    "description": "Trump said it was an “amazing meeting” and that China would halt rare earth controls and resume purchases of American soybeans.  Xi said his country is...",
    "link": "https://finance.yahoo.com/news/gold-rises-fed-divisions-raise-011119368.html",
    "timestamp": "2025-10-30T15:54:18Z"
  },
  {
    "title": "Police Charge Man Who Allegedly Freaked Out Over TPUSA Table With Threatening Trump’s Life In Separate Incident",
    "description": "A former teaching assistant fired after footage showed a viral incident at a Turning Point USA was charged with making threats against President Donald Trump.",
    "link": "https://dailycaller.com/2025/10/30/teaching-assistant-derek-lopez-charged-threats-trump-table-tpusa-event-illinois/",
    "timestamp": "2025-10-30T15:54:11Z"
  },
  {
    "title": "Trump Chief Stephen Miller’s Wife Explicitly Threatens Cenk Uygur’s Citizenship in Shocking On-Air Meltdown",
    "description": "Miller warned Uygur, a naturalized citizen, that he “better check” his citizenship application is clean.\nThe post Trump Chief Stephen Miller’s Wife Explicitly Threatens Cenk Uygur’s Citizenship in Shocking On-Air Meltdown first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-chief-stephen-millers-wife-explicitly-threatens-cenk-uygurs-citizenship-in-shocking-on-air-meltdown/",
    "timestamp": "2025-10-30T15:52:21Z"
  },
  {
    "title": "World Leaders Figure Out the Trump Children’s Menu",
    "description": "Officials ensured that Donald Trump’s immature palate was catered to while the U.S. president was served lavish meals during his visit to three Asian nations...",
    "link": "https://www.thedailybeast.com/world-leaders-figure-out-the-donald-trump-childrens-menu/",
    "timestamp": "2025-10-30T15:51:54Z"
  },
  {
    "title": "Debunked: Advanced deepfake scam ad featuring Simon Harris viewed more than 184,000 times",
    "description": "The footage successfully clones voices, but fails to pronounce Taoiseach in fewer than four syllables.",
    "link": "https://www.thejournal.ie/facetcheck-debunk-ai-scam-ad-deepfake-simon-harris-tainaiste-sharon-ni-bheolain-fintan-o-toole-youtube-6860505-Oct2025/",
    "timestamp": "2025-10-30T15:51:41Z"
  },
  {
    "title": "Results of Trump’s Meeting With Xi",
    "description": "President Donald Trump says he had a “truly great meeting” with Chinese President Xi Jinping.  “There is enormous respect between our two Countries, and that... Read More\nThe post Results of Trump’s Meeting With Xi appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/10/30/results-of-trumps-meeting-with-xi/",
    "timestamp": "2025-10-30T15:51:36Z"
  },
  {
    "title": "India studying implications of US sanctions on Russian oil companies: MEA",
    "description": "Trump says India has been “very good” on issue of Russian oil; India maintains its sourcing is guided by its energy security needs",
    "link": "https://www.thehindubusinessline.com/economy/india-studying-implications-of-us-sanctions-on-russian-oil-companies-mea/article70222291.ece",
    "timestamp": "2025-10-30T15:50:32Z"
  },
  {
    "title": "Bitcoin, Ethereum Bulls Get Rekt: Liquidations Top $1.1 Billion as Prices Fall After Trump Meets Xi",
    "description": "The price of Bitcoin slid on Thursday, bringing major coins and tokens with it, after U.S. President Donald Trump wrapped up a highly anticipated meeting with Chinese leader Xi Jinping.\nBitcoin dropped below $108,000 and was recently trading 4% lower over a 2…",
    "link": "https://biztoc.com/x/b889677ea242b8f4",
    "timestamp": "2025-10-30T15:49:54Z"
  },
  {
    "title": "How US Nuclear Weapons Compare to China, Russia as Trump Orders New Tests",
    "description": "The United States is \"immediately\" restarting nuclear weapons testing, President Donald Trump has said.\n\"Because of other countries' testing programs, I have instructed the Department of War to start testing our nuclear weapons on an equal basis,\" Trump said …",
    "link": "https://biztoc.com/x/657aac3519c3da02",
    "timestamp": "2025-10-30T15:49:52Z"
  },
  {
    "title": "Trump says the U.S. will share closely held tech with South Korea to build a nuclear-powered submarine",
    "description": "The United States will share closely held technology to allow South Korea to build a nuclear-powered submarine, President Donald Trump said on social media Thursday after meeting with the country’s president.\nPresident Lee Jae Myung stressed to Trump in their…",
    "link": "https://biztoc.com/x/b9ee89867070e133",
    "timestamp": "2025-10-30T15:49:27Z"
  },
  {
    "title": "Trump's Lawyers Seek Dismissal Of President's Criminal Conviction",
    "description": "Trump's Lawyers Seek Dismissal Of President's Criminal Conviction\n \nAuthored by Zachary Stieber via The Epoch Times,\nLawyers for President Donald Trump asked an appeals court in New York state this week to throw out Trump’s criminal conviction for falsifying …",
    "link": "https://biztoc.com/x/b9cbebd5e6e322a6",
    "timestamp": "2025-10-30T15:49:13Z"
  },
  {
    "title": "6 takeaways from Trump’s meeting with Chinese leader Xi",
    "description": "President Donald Trump met with China's Xi Jinping on the sidelines of Pacific Rim summit gatherings in South Korea, where the two leaders agreed to dial back some of their trade measures and work together to resolve others.",
    "link": "https://biztoc.com/x/9615a77834d68894",
    "timestamp": "2025-10-30T15:49:10Z"
  },
  {
    "title": "A trade truce, a nuclear threat: What to make of the Trump-Xi meeting",
    "description": "President Donald Trump takes part in a welcoming ceremony with China’s leader, Xi Jinping, on November 9, 2017 in Beijing during Trump’s first term in office. | Thomas Peter/Pool/Getty Images \nSince President Donald Trump’s second term began, his administrati…",
    "link": "https://biztoc.com/x/75f9c9658919b966",
    "timestamp": "2025-10-30T15:49:04Z"
  },
  {
    "title": "USA Energy Sec Says USA Is Ready to Sell More Oil, Gas to China",
    "description": "Energy Secretary Chris Wright said the U.S. is prepared to sell more oil and natural gas to China if Beijing cuts back on purchases from Russia.",
    "link": "https://www.rigzone.com/news/wire/usa_energy_sec_says_usa_is_ready_to_sell_more_oil_gas_to_china-30-oct-2025-182205-article/",
    "timestamp": "2025-10-30T15:47:37Z"
  },
  {
    "title": "Trump appears to suggest the U.S. will resume testing nuclear weapons for first time in 30 years",
    "description": "There was no indication that the U.S. would start detonating warheads, but the president offered few details about what seemed to be a significant shift in U.S. policy.",
    "link": "https://www.pbs.org/newshour/politics/trump-appears-to-suggest-the-u-s-will-resume-testing-nuclear-weapons-for-first-time-in-30-years",
    "timestamp": "2025-10-30T15:47:33Z"
  },
  {
    "title": "Special interview: How Hungary stands against the anti-Israel tide in Europe",
    "description": "Miklós Szánthó, Director General of the Center for Fundamental Rights in Hungary, spoke to Arutz Sheva - Israel National News at the International Pro-Israel Summit in Budapest about Hungary's continued pro-Israel stance in an increasingly anti-Israel EU.",
    "link": "https://www.israelnationalnews.com/news/417071",
    "timestamp": "2025-10-30T15:47:00Z"
  },
  {
    "title": "Eli Lilly says weight-loss pill a candidate for speedy approval under new US program",
    "description": "(Reuters) -Eli Lilly said on Thursday its experimental weight-loss pill met most criteria for the U. Food and Drug Administration's new national priority...",
    "link": "https://finance.yahoo.com/news/eli-lilly-says-weight-loss-154612603.html",
    "timestamp": "2025-10-30T15:46:12Z"
  },
  {
    "title": "Banks and retailers run short on pennies as the US Mint stops making them",
    "description": "The abrupt decision has left retailers and banks without guidance.",
    "link": "https://www.bostonherald.com/2025/10/30/penny-shortage/",
    "timestamp": "2025-10-30T15:45:50Z"
  },
  {
    "title": "Banks and retailers run short on pennies as the US Mint stops making them",
    "description": "The abrupt decision has left retailers and banks without guidance.",
    "link": "https://www.denverpost.com/2025/10/30/penny-shortage/",
    "timestamp": "2025-10-30T15:45:50Z"
  },
  {
    "title": "Gun Rights Group Claims Lower Court Decision ‘Defies’ Major First Amendment Victory At SCOTUS",
    "description": "After scoring a major First Amendment victory at the Supreme Court, the National Rifle Association (NRA) is returning to the justices.",
    "link": "https://dailycaller.com/2025/10/30/gun-rights-group-claims-lower-court-decision-defies-major-first-amendment-victory-at-scotus/",
    "timestamp": "2025-10-30T15:45:02Z"
  },
  {
    "title": "'Sometimes, you have to let them fight,' Trump says on Russia's war in Ukraine (Veronika Melkozerova/Politico)",
    "description": "Veronika Melkozerova / Politico:\n‘Sometimes, you have to let them fight,’ Trump says on Russia's war in Ukraine  —  Kyiv had hoped Donald Trump would persuade China's Xi Jinping to stop buying Russian oil to hasten the conflict's end.  —  KYIV — China and the…",
    "link": "https://www.memeorandum.com/251030/p73",
    "timestamp": "2025-10-30T15:45:00Z"
  },
  {
    "title": "Nvidia’s Huang joins Apple, other tech titans funding President Trump’s new White House State Ballroom",
    "description": "Nvidia CEO Jensen Huang announced a personal donation to fund the construction of President Donald Trump's White House State Ballroom…\nThe post Nvidia’s Huang joins Apple, other tech titans funding President Trump’s new White House State Ballroom appeared fir…",
    "link": "https://macdailynews.com/2025/10/30/nvidias-huang-joins-apple-other-tech-titans-funding-president-trumps-new-white-house-state-ballroom/",
    "timestamp": "2025-10-30T15:44:35Z"
  },
  {
    "title": "Trump Complains About Turbulence, Jokes People Will Think He's Got the Shakes",
    "description": "Air Force One served up a bumpy ride for President Donald Trump Thursday ... and he wanted to get ahead of the inevitable rumors that could crop up. While conducting interviews during the flight back from his Asian tour, Trump was practically…\n Permalink",
    "link": "https://www.tmz.com/2025/10/30/donald-trump-air-force-one-turbulence/",
    "timestamp": "2025-10-30T15:44:30Z"
  },
  {
    "title": "Rosie O'Donnell Heartbreakingly Vents After Daughter Sentenced To Prison",
    "description": "Rosie O'Donnell Heartbreakingly Vents After Daughter Sentenced To Prisonhuffpost.com",
    "link": "https://www.huffpost.com/entry/rosie-odonnell-daughter-chelsea-prison_n_690361cbe4b017cd270f17e5",
    "timestamp": "2025-10-30T15:44:16Z"
  },
  {
    "title": "Louisiana Gov. Jeff Landry Would Rather Trump Pick Next LSU Coach over AD Scott Woodward",
    "description": "Jeff Landry said that he would rather President Trump selected the next head coach for LSU over current Athletics Director Scott Woodward. \nThe post Louisiana Gov. Jeff Landry Would Rather Trump Pick Next LSU Coach over AD Scott Woodward appeared first on Bre…",
    "link": "https://www.breitbart.com/sports/2025/10/30/louisiana-gov-jeff-landry-would-rather-trump-pick-next-lsu-coach-over-ad-scott-woodward/",
    "timestamp": "2025-10-30T15:43:50Z"
  },
  {
    "title": "Jasmine Crockett Accepts Jimmy Kimmel’s Pitch to Face Trump in a Live IQ Test: ‘A Once-in-a-Lifetime Television Event’ | Video",
    "description": "\"I want to give our brilliant, bigly-brained president a chance to teach those left-wing lightweights a thing or two about brain power,\" the ABC late night host says\nThe post Jasmine Crockett Accepts Jimmy Kimmel’s Pitch to Face Trump in a Live IQ Test: ‘A On…",
    "link": "https://www.thewrap.com/jimmy-kimmel-trump-iq-test-jasmine-crockett-accepts/",
    "timestamp": "2025-10-30T15:43:40Z"
  },
  {
    "title": "Stable Genius Threatens Nuclear Armageddon Based On Voices In His Head",
    "description": "Donald Trump has now reopened a nuclear arms race with Russia and China after proclaiming US will start testing nuclear armaments once again.\nSpeaking on Air Force One, Trump was asked about his nuclear aspirations.\n\nQ: Nuclear testing, what about resuming nu…",
    "link": "https://crooksandliars.com/2025/10/trump-claims-everyone-testing-nuclear",
    "timestamp": "2025-10-30T15:43:24Z"
  },
  {
    "title": "A trade truce, a nuclear threat: What to make of the Trump-Xi meeting",
    "description": "Since President Donald Trump’s second term began, his administration’s approach to China has been arguably the toughest aspect of its foreign policy to parse. In part, that’s because the top members of Trump’s team haven’t always seemed to be on the same page…",
    "link": "https://www.vox.com/politics/466624/xi-trump-trade-nukes-taiwan",
    "timestamp": "2025-10-30T15:42:17Z"
  },
  {
    "title": "Trump’s Excuse to Resume Nuclear Testing Will Make You Want to Scream",
    "description": "If Xi Jinping jumped off a bridge, would Donald Trump do the same?",
    "link": "https://newrepublic.com/post/202465/donald-trump-excuse-resume-nuclear-testing",
    "timestamp": "2025-10-30T15:42:11Z"
  },
  {
    "title": "6 takeaways from Trump’s meeting with Chinese leader Xi",
    "description": "President Donald Trump met with China's Xi Jinping on the sidelines of Pacific Rim summit gatherings in South Korea, where the two leaders agreed to dial back some of their trade measures and work together to resolve others.",
    "link": "https://www.pbs.org/newshour/world/6-takeaways-from-trumps-meeting-with-chinese-leader-xi",
    "timestamp": "2025-10-30T15:41:02Z"
  },
  {
    "title": "Russia's boasting big moves on a couple of nuclear 'super weapons.' Another may be operational soon.",
    "description": "Russia said it tested a nuclear-powered cruise missile and torpedo, two of its experimental weapons, in recent days.",
    "link": "https://www.businessinsider.com/russia-says-made-nuclear-powered-super-weapons-work-another-coming-2025-10",
    "timestamp": "2025-10-30T15:38:28Z"
  },
  {
    "title": "A House of Dynamite has already aged like milk – for one key reason",
    "description": "Kathryn Bigelow’s new Netflix film seems, at first, to be a chillingly plausible tale of a hypothetical nuclear attack. But in making one key departure from our reality, it ends up becoming an absurd fantasy, writes Louis Chilton",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/house-of-dynamite-netflix-idris-elba-b2855438.html",
    "timestamp": "2025-10-30T15:37:52Z"
  },
  {
    "title": "New Trump administration rule bars student loan relief for public workers tied to ‘illegal’ activity",
    "description": "Critics say it turns the program into a tool of political retribution for Trump.",
    "link": "https://www.bostonherald.com/2025/10/30/trump-student-loans/",
    "timestamp": "2025-10-30T15:37:44Z"
  },
  {
    "title": "President Trump’s ballroom design might not be AI — but it’s still a mess",
    "description": "When President Donald Trump revealed the physical model of the sprawling ballroom that will replace the now-demolished East Wing of the White House, something just seemed off. The model, small enough to fit on a table, is supposed to be a representation of th…",
    "link": "https://www.theverge.com/policy/809914/trump-white-house-ballroom-3d-model-ai",
    "timestamp": "2025-10-30T15:37:41Z"
  },
  {
    "title": "Turkiye’s Erdogan urges Germany to help end Israel’s ‘genocide’ in Gaza",
    "description": "Despite a fragile US-brokered ceasefire, Israel has unleashed a series of bombardments on Gaza this week.",
    "link": "https://www.aljazeera.com/news/2025/10/30/turkiyes-erdogan-urges-germany-to-help-end-israels-genocide-in-gaza",
    "timestamp": "2025-10-30T15:36:21Z"
  },
  {
    "title": "Wikipedia Page Claims ‘Adult Human Female’ Constitutes ‘Hate Speech’",
    "description": "A Wikipedia article created earlier this year about the term “adult human female” characterizes it as “hate speech” against transgender individuals. The page, created by an editor who has smeared numerous conservative figures, was added last month to a naviga…",
    "link": "https://www.breitbart.com/tech/2025/10/30/wikipedia-page-claims-adult-human-female-constitutes-hate-speech/",
    "timestamp": "2025-10-30T15:36:02Z"
  },
  {
    "title": "Trade takeaways from Trump's meeting with Chinese leader Xi",
    "description": "President Trump and China's leader Xi Jinping held a significant meeting. They agreed to reduce some trade measures and cooperate on resolving others. China will increase purchases of American farm products and computer chips. Discussions also covered rare ea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trade-takeaways-from-trumps-meeting-with-chinese-leader-xi/articleshow/124959595.cms",
    "timestamp": "2025-10-30T15:36:00Z"
  },
  {
    "title": "Good Morning, News: Feds Have TERRIBLE Day in Court, Kotek Sends $5 Million to Food Banks, and Trump Resumes Nuclear Tests (What Could Go Wrong?)",
    "description": "by Wm. Steven Humphrey\n \n \n \n If you’re reading this, you probably know the value of the Mercury’s news reporting, arts and culture coverage, event calendar, and the bevy of events we host throughout the year. The work we do helps our city shine, but we can’t…",
    "link": "https://www.portlandmercury.com/good-morning-news/2025/10/30/48096189/good-morning-news-feds-have-terrible-day-in-court-kotek-sends-5-million-to-food-banks-and-trump-resumes-nuclear-tests-what-could-go-wron",
    "timestamp": "2025-10-30T15:35:00Z"
  },
  {
    "title": "Canadian Singer Makes 1 Subtle Change To National Anthem To Protest Trump",
    "description": "The president has made repeated remarks about annexing Canada as America's 51st state.",
    "link": "https://www.huffpost.com/entry/canadian-singer-makes-one-subtle-change-to-national-anthem-to-protest-trump_n_6903752fe4b0b0c6441c5f6e",
    "timestamp": "2025-10-30T15:32:59Z"
  },
  {
    "title": "Turley calls out Jack Smith's 'total lack of restraint' in sweeping Trump election probe",
    "description": "Constitutional attorney Jonathan Turley slams Jack Smith's special counsel investigation as showing 'total lack of restraint' in 2020 election probe.",
    "link": "https://www.foxnews.com/media/turley-calls-out-jack-smiths-total-lack-restraint-sweeping-trump-election-probe",
    "timestamp": "2025-10-30T15:31:47Z"
  },
  {
    "title": "Bitcoin, Ethereum Bulls Get Rekt: Liquidations Top $1.1 Billion as Prices Fall After Trump Meets Xi",
    "description": "President Trump hailed his meeting with China leader Xi Jinping as \"amazing\" and put a halt on tariffs. But markets aren't happy.",
    "link": "https://decrypt.co/346788/bitcoin-ethereum-bulls-get-rekt-liquidations-1-1-billion-trump-meets-xi",
    "timestamp": "2025-10-30T15:30:13Z"
  },
  {
    "title": "FDA Is Investigating the Abortion Pill Mifepristone despite Decades of Studies Showing It’s Safe",
    "description": "Some scientists are concerned that the Trump administration will use “junk science” when reviewing mifepristone’s safety record",
    "link": "https://www.scientificamerican.com/article/fda-is-investigating-the-abortion-pill-mifepristone-despite-decades-of/",
    "timestamp": "2025-10-30T15:30:00Z"
  },
  {
    "title": "Trump says the U.S. will share closely held tech with South Korea to build a nuclear-powered submarine",
    "description": "President Lee Jae Myung stressed to Trump in their Wednesday meeting that the goal was to modernize the alliance with the U.S., noting plans to increase military spending to reduce the financial burden on America.",
    "link": "https://fortune.com/2025/10/30/united-states-technology-to-allow-south-korea-to-build-a-nuclear-powered-submarine-financial-burgen-lee-jae-myung-trump/",
    "timestamp": "2025-10-30T15:29:56Z"
  },
  {
    "title": "Pentagon Order Brings Trump Dictator Fantasies Closer To Reality",
    "description": "So our wanna-be dictator is determined to turn the National Guard into “quick reaction forces” trained in “riot control”, including use of batons, body shields, Tasers and pepper spray, according to an internal Pentagon directive. Via the Guardian:\nThe memo, …",
    "link": "https://crooksandliars.com/2025/10/pentagon-order-brings-trump-dictator",
    "timestamp": "2025-10-30T15:29:06Z"
  },
  {
    "title": "Trump and Xi hold first face-to-face talks in six years",
    "description": "Xi Jinping and Donald Trump have held their first face-to-face talks in six years in a moment of high trade tension between China and the US.\n\nMr Trump hailed an \"amazing\" meeting with his Chinese counterpart, but Beijing was less effusive. Thursday's talks d…",
    "link": "https://www.bbc.co.uk/programmes/w172zssdjtcpf0s",
    "timestamp": "2025-10-30T15:29:00Z"
  },
  {
    "title": "Trump Announces When US Will Start Testing Nuclear Weapons",
    "description": "President Donald Trump has ordered testing of American nuclear weapons to start “immediately.” “Because of other countries testing programs, I have instructed the Department of... Read More\nThe post Trump Announces When US Will Start Testing Nuclear Weapons a…",
    "link": "https://www.dailysignal.com/2025/10/30/trump-announces-when-us-will-start-testing-nuclear-weapons/",
    "timestamp": "2025-10-30T15:28:52Z"
  },
  {
    "title": "Trump administration to limit student loan forgiveness eligibility for some public servants",
    "description": "The Trump administration is moving closer to limiting eligibility for the Public Service Loan Forgiveness program.",
    "link": "https://www.cnbc.com/2025/10/30/public-service-loan-forgiveness-eligibility-trump.html",
    "timestamp": "2025-10-30T15:26:45Z"
  },
  {
    "title": "Hamas hands Red Cross coffins it says contains two Gaza hostages' bodies",
    "description": "The Israeli military say the bodies will be transferred to its forces in Gaza, before being taken to forensic experts for identification.",
    "link": "https://www.bbc.com/news/articles/c4gj90j2g8jo",
    "timestamp": "2025-10-30T15:26:27Z"
  },
  {
    "title": "Confused Trump, 79, Asks How to Walk Off Stage (Janna Brancolini/The Daily Beast)",
    "description": "Janna Brancolini / The Daily Beast:\nConfused Trump, 79, Asks How to Walk Off Stage  —  STRANDED  —  The president looked lost as it was time to leave introductions with China's Xi Jinping.  —  President Donald Trump's meeting with his Chinese counterpart Xi J…",
    "link": "https://www.memeorandum.com/251030/p67",
    "timestamp": "2025-10-30T15:25:00Z"
  },
  {
    "title": "Trump Cuts Tariffs on China After Xi Agrees to Purchase 'Massive Amount' of US Crops in 'Truly Great' Meeting",
    "description": "The Xi meeting was the most critical moment of Trump's Asian trip, but the agreement was just one of several with other regional leaders.",
    "link": "https://www.westernjournal.com/trump-cuts-tariffs-china-xi-agrees-purchase-massive-amount-us-crops-truly-great-meeting/",
    "timestamp": "2025-10-30T15:24:35Z"
  },
  {
    "title": "Math crisis began a decade ago and has only worsened, report says",
    "description": "American students are experiencing a math crisis marked by a decline in scores that began over a decade ago and rapidly accelerated in the wake of the COVID-19 pandemic, a new report shows Almost 4 in 10 eighth-graders scored below basic in math on the Nation…",
    "link": "https://freerepublic.com/focus/f-chat/4349619/posts",
    "timestamp": "2025-10-30T15:23:09Z"
  },
  {
    "title": "Trump stirs tensions with surprise order to test nuclear weapons",
    "description": "President Donald Trump landed back in the United States Thursday after a surprise directive to begin nuclear weapons testing that raised the specter of renewed superpower tensions. The announcement on social media was issued right as Trump was going into a su…",
    "link": "https://www.digitaljournal.com/world/trump-stirs-tensions-with-surprise-order-to-test-nuclear-weapons/article",
    "timestamp": "2025-10-30T15:22:20Z"
  },
  {
    "title": "Trump Cabinet Members Moving Into Military Housing Amid Wave of Political Violence: Report",
    "description": "A number of high-profile members of President Donald Trump's cabinet have moved onto military bases amid a wave of political violence.\nThe post Trump Cabinet Members Moving Into Military Housing Amid Wave of Political Violence: Report first appeared on Mediai…",
    "link": "https://www.mediaite.com/politics/trump-cabinet-members-moving-into-military-housing-amid-wave-of-political-violence-report/",
    "timestamp": "2025-10-30T15:22:09Z"
  },
  {
    "title": "Why Trump Is Allowing Food Stamp Funding to Run Out",
    "description": "Joel Berg\n\n\n\nI warned that Trump and Congressional Republicans could use a shutdown to deny SNAP benefits but was told there was no way our political system would allow that to occur.\r\n\n\r\n\n\nThe post Why Trump Is Allowing Food Stamp Funding to Run Out appeared…",
    "link": "https://www.thenation.com/article/society/trump-food-stamps-snap-ending-hunger/",
    "timestamp": "2025-10-30T15:20:57Z"
  }
]