[
  {
    "title": "THIS Republican senator is leading the charge against Trump’s tariffs",
    "description": "Sen. Rand Paul — a right-wing firebrand from a deep red state — is in some ways an unlikely figure to articulate a searing case against Donald Trump’s agenda. But the senator from Kentucky is issuing a stark warning to fellow Republicans that Trump’s tariff p…",
    "link": "https://freerepublic.com/focus/f-news/4309397/posts",
    "timestamp": "2025-04-07T13:58:20Z"
  },
  {
    "title": "Trump’s Tariffs Backfiring as Catalyst for Broader Multipolar World",
    "description": "The recent escalation of U.S. tariffs under Donald Trump has sparked a seismic shift in global economic dynamics, thereby inadvertently accelerating the reinforcement of a multipolar world. In a stunning development, China, Japan, and South Korea (three of As…",
    "link": "https://www.globalresearch.ca/trump-tariffs-backfiring-catalyst-broader-multipolar-world/5883764",
    "timestamp": "2025-04-07T13:57:25Z"
  },
  {
    "title": "Elon Musk Breaks Rank, Rages Against Donald Trump's Tariffs",
    "description": "Billionaire Elon Musk and president Donald Trump's honeymoon appears to be over. Musk lashed out at the architect of Trump's catastrophic tariff policy, which has ravaged international markets and stoked fears of an imminent recession. In a tweet, Musk took a…",
    "link": "https://futurism.com/elon-musk-rages-against-donald-trump-tariffs",
    "timestamp": "2025-04-07T13:56:48Z"
  },
  {
    "title": "Wall Street drops 20% below its record and markets reel worldwide as Trump digs in on his tariffs",
    "description": "Wall Street drops 20% below its record and markets reel worldwide as Trump digs in on his tariffsksat.com",
    "link": "https://www.ksat.com/business/2025/04/07/asian-markets-plunge-as-japans-nikkei-225-index-dives-nearly-8-after-the-big-meltdown-on-wall-st/",
    "timestamp": "2025-04-07T13:56:31Z"
  },
  {
    "title": "Temu boosts product safety and compliance with Eurofins partnership",
    "description": "Eurofins Assurance will perform independent inspections across a variety of merchandise.",
    "link": "https://www.retail-insight-network.com/news/temu-eurofins-partnership/",
    "timestamp": "2025-04-07T13:56:03Z"
  },
  {
    "title": "Trump Tariffs on Africa Creates Economic Uncertainties, Accelerates Pivot to the BRICS+ Alliance",
    "description": "The US has started a global trade war with the world targeting every region including the poorest countries in Africa. What is interesting is that one of the countries that Trump is targeting is Lesotho which according to an article …\nThe post Trump Tariffs o…",
    "link": "https://www.globalresearch.ca/trump-tariffs-africa-economic-uncertainties-pivot-brics-alliance/5883702",
    "timestamp": "2025-04-07T13:55:47Z"
  },
  {
    "title": "Trump Administration Touts Supreme Court Victory in Funding Cut Dispute",
    "description": "President Donald Trump has been \"vindicated\" by the Supreme Court's decision to stay a preliminary injunction against his freeze on federal grants, his lawyers have told a court.\nWhy It Matters\nTens of billions of dollars in federal grants are at stake and th…",
    "link": "https://biztoc.com/x/546722a3f601d717",
    "timestamp": "2025-04-07T13:55:12Z"
  },
  {
    "title": "Tech stocks fall for third session, Tesla sinks 10% as Trump stands by tariffs",
    "description": "Technology stocks fell for a third session on Monday, continuing the momentum of last week's devastating selloff after President Donald Trump stood by his sweeping global tariff plans and global market turmoil intensified.\nTesla led the Magnificent Seven's lo…",
    "link": "https://biztoc.com/x/97ca6b9e90992bd5",
    "timestamp": "2025-04-07T13:54:30Z"
  },
  {
    "title": "Trump, Ishiba agree to start tariff talks",
    "description": "United States President Donald Trump and Japanese Prime Minister Shigeru Ishiba held a phone conversation on Monday following last week's announcement of new tariffs by the Trump administration.Speaki...",
    "link": "https://biztoc.com/x/b07d007e4b8cb555",
    "timestamp": "2025-04-07T13:54:29Z"
  },
  {
    "title": "Trump’s tariffs will make almost everything you wear more expensive. Here’s why",
    "description": "Sending children back to school in new sneakers, jeans, and T-shirts is likely to cost U.S. families significantly more this fall if the bespoke tariffs President Donald Trump put on leading exporters take effect as planned, American industry groups warn.Abou…",
    "link": "https://biztoc.com/x/f8afb6658fe41adb",
    "timestamp": "2025-04-07T13:54:27Z"
  },
  {
    "title": "U.S. Mine Safety and Health Administration targeted by DOGE",
    "description": "By John Raby And Leah Willingham The U.S. Mine Safety…\nThe post U.S. Mine Safety and Health Administration targeted by DOGE appeared first on OHS Canada Magazine.",
    "link": "https://www.ohscanada.com/things-to-know-about-the-u-s-mine-safety-and-health-administration-and-the-coal-industry/",
    "timestamp": "2025-04-07T13:54:24Z"
  },
  {
    "title": "US and Russia squabble over Arctic security as melting ice opens up shipping routes",
    "description": "\"You cannot annex another country.\" This was the clear message given by the Danish prime minister, Mette Frederiksen, at a recent press conference with the outgoing and incoming prime ministers of Greenland. It did not appear aimed at Russian president Vladim…",
    "link": "https://phys.org/news/2025-04-russia-squabble-arctic-ice-shipping.html",
    "timestamp": "2025-04-07T13:54:04Z"
  },
  {
    "title": "Trump Tells Americans to Stop Panicking as Markets Plunge: ‘Don’t Be Weak! Don’t Be Stupid!’",
    "description": "President Donald Trump promised that his controversial new tariff policy will produce \"GREATNESS\" on Monday morning.\nThe post Trump Tells Americans to Stop Panicking as Markets Plunge: ‘Don’t Be Weak! Don’t Be Stupid!’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/trump-tells-americans-to-stop-panicking-as-markets-plunge-dont-be-weak-dont-be-stupid/",
    "timestamp": "2025-04-07T13:53:15Z"
  },
  {
    "title": "Why a blockbuster lawsuit against Donald Trump has grabbed Americans' attention; here's what the case is and why so many law firms are taking the President head-on",
    "description": "Over 500 law firms are backing a lawsuit against Donald Trump, initiated by Perkins Coie, alleging that his executive order threatens legal independence and First Amendment rights. The legal community fears potential client loss but stands united against Trum…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-a-blockbuster-lawsuit-against-donald-trump-has-grabbed-americans-attention-heres-what-the-case-is-and-why-so-many-law-firms-are-taking-the-president-head-on/articleshow/120067664.cms",
    "timestamp": "2025-04-07T13:52:06Z"
  },
  {
    "title": "Why a Minnesota police chief says a female Tesla vandalism suspect won't be charged — and even 'may have been a victim'",
    "description": "'Based on the totality of the circumstances here, and along with our core value of being compassionate, this is the best outcome for everybody involved in this case.' In a twist amid the recent and widespread rash of attacks against Tesla vehicles, a Minnesot…",
    "link": "https://freerepublic.com/focus/f-news/4309395/posts",
    "timestamp": "2025-04-07T13:51:53Z"
  },
  {
    "title": "Trump Administration Touts Supreme Court Victory in Funding Cut Dispute",
    "description": "The president has put a freeze on all federal grants while his administration carries out a major review.",
    "link": "https://www.newsweek.com/president-donald-trump-federal-funding-freeze-rhode-island-new-york-letitia-james-supreme-court-2056175",
    "timestamp": "2025-04-07T13:51:31Z"
  },
  {
    "title": "Bitcoin Falls Below $77,000 As Trump’s Tariffs Erase Election Boost",
    "description": "Several cryptocurrencies have lost nearly all their gains since Trump’s election win in November.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/04/07/bitcoin-falls-below-77000-as-trumps-tariffs-erase-election-boost/",
    "timestamp": "2025-04-07T13:51:03Z"
  },
  {
    "title": "Israeli strike kills and wounds journalists outside Gaza hospital",
    "description": "Israel struck a media tent early Monday, killing two people, including a local reporter, and wounding six other journalists, medics said. The Israeli military said the strike targeted a man it says was a Hamas militant posing as a journalist.",
    "link": "https://www.pbs.org/newshour/world/israeli-strike-kills-and-wounds-journalists-outside-gaza-hospital",
    "timestamp": "2025-04-07T13:50:28Z"
  },
  {
    "title": "Trump adviser Navarro dismisses Musk as 'car assembler' after tariff comments",
    "description": "Peter Navarro, President Donald Trump's top trade adviser, on Monday dismissed tech-billionaire Elon Musk's push for \"zero tariffs\" between the United States...",
    "link": "https://finance.yahoo.com/news/trump-adviser-navarro-dismisses-musk-134911849.html",
    "timestamp": "2025-04-07T13:49:11Z"
  },
  {
    "title": "A member of the Scattered Spider cybercrime group pleads guilty",
    "description": "A 20-year-old man linked to the Scattered Spider cybercrime group has pleaded guilty to charges filed in Florida and California. Noah Urban, a 20-year-old from Palm Coast, pleaded guilty to conspiracy, wire fraud, and identity theft in two federal cases, one …",
    "link": "https://securityaffairs.com/176323/cyber-crime/scattered-spider-cybercrime-group-member-pleaded-guilty.html",
    "timestamp": "2025-04-07T13:48:11Z"
  },
  {
    "title": "Elon Musk wants to rewrite all the COBOL code behind U.S. Social Security—in just a few months",
    "description": "What could possibly go wrong? — The Department of Government Efficiency (DOGE), now under the command of the ever-controversial Elon Musk since Donald Trump’s return to office, just keeps shaking up American institutions. At the helm is Steve Davis and his sq…",
    "link": "https://thecodinglove.com/elon-musk-wants-to-rewrite-all-the-cobol-code-behind-u-s-social-security-in-just-a-few-months",
    "timestamp": "2025-04-07T13:48:04Z"
  },
  {
    "title": "'Trump Recession': US President spends weekend at National golf club in Florida as stock markets crash",
    "description": "US President Donald Trump spent his Friday morning at Mar-a-Lago, his private club in Palm Beach despite the stock market crash due to his reciprocal tariffs. The tariffs are expected to increase prices by thousands of dollars per year and slow economic growt…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-recession-us-president-spends-weekend-at-national-golf-club-in-florida-as-stock-markets-crash/articleshow/120067634.cms",
    "timestamp": "2025-04-07T13:47:31Z"
  },
  {
    "title": "US Stocks Join Global Selloff Sparked By Trump Tariffs",
    "description": "Wall Street stocks opened sharply lower Monday, joining a global selloff on worries that a trade war induced by US President Donald Trump&#039;s tariffs will spark a global economic slowdown.",
    "link": "https://www.ndtv.com/world-news/us-stocks-join-global-selloff-sparked-by-trump-tariffs-8109338",
    "timestamp": "2025-04-07T13:47:14Z"
  },
  {
    "title": "Jamie Dimon has a warning about tariffs",
    "description": "JPMorgan Chase CEO Jamie Dimon sounded the alarm on President Donald Trump’s tariffs in his annual letter to shareholders, warning the trade policy will likely spike inflation and is sure to slow down growth.Read more...",
    "link": "https://qz.com/jamie-dimon-warning-trump-tariffs-jpmorgan-recession-1851775032",
    "timestamp": "2025-04-07T13:47:08Z"
  },
  {
    "title": "Tech stocks fall for third session, Tesla sinks 10% as Trump stands by tariffs",
    "description": "The Magnificent Seven stocks collectively shed more than $1.8 trillion in market value during a two-day market selloff.",
    "link": "https://www.cnbc.com/2025/04/07/tech-tesla-nvidia-stocks-fall-as-trump-stands-by-tariffs-selloff-deepens.html",
    "timestamp": "2025-04-07T13:45:41Z"
  },
  {
    "title": "Russia, accused of stalling, wants answers before truce",
    "description": "<p>MOSCOW - The Kremlin on Monday said that it supported the idea of a truce in Ukraine but had many \"questions\" about how it would work, pushing back at US and European suggestions that it was playing for time.</p>",
    "link": "https://www.bangkokpost.com/world/2997679/russia-accused-of-stalling-wants-answers-before-truce",
    "timestamp": "2025-04-07T13:45:00Z"
  },
  {
    "title": "Trump digs in his heels, telling people to be patient as global markets keep dropping over tariffs",
    "description": "Trump digs in his heels, telling people to be patient as global markets keep dropping over tariffswftv.com",
    "link": "https://www.wftv.com/news/world/trump-threatens-more/3D3AK2T34FH7FPWRMW7LCMRFN4/",
    "timestamp": "2025-04-07T13:44:24Z"
  },
  {
    "title": "Sellouts and Selloffs",
    "description": "Three-day selloff continues: \"The carnage in financial markets worsened on Monday with stressed-out investors abandoning hopes that President Donald Trump would change his tariff policy,\" reports Bloomberg. \"Stocks tumbled, taking the three-day wipeout in glo…",
    "link": "https://biztoc.com/x/bf531673a484f5cc",
    "timestamp": "2025-04-07T13:43:31Z"
  },
  {
    "title": "Donald Trump's Approval Rating Goes Negative With His Top Pollster",
    "description": "Just 46 percent of people approval of Trump's overall job performance, according to a survey conducted for the Wall Street Journal.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-negative-pollster-2056230",
    "timestamp": "2025-04-07T13:43:30Z"
  },
  {
    "title": "Canadians pull back on travel to California because of Donald Trump: ‘I will miss the desert’",
    "description": "California tourism could lose billions of dollars because of President Donald Trump’s policies on tariffs, immigration and gender identity, as well as his talk of annexing Canada.\nVisit California, a nonprofit organization that promotes tourism in the Golden …",
    "link": "https://biztoc.com/x/0859c60ebc51daa4",
    "timestamp": "2025-04-07T13:43:29Z"
  },
  {
    "title": "Some Observations on Tariff Hysteria",
    "description": "Fear not. I am not going to subject you to a detailed analysis of the economic and political consequences of Donald Trump’s recently implemented tariffs. While I do have a Ph.D. comprehensive field in international economics, I am not a …\nThe post Some Observ…",
    "link": "https://www.globalresearch.ca/some-observations-tariff-hysteria/5883745",
    "timestamp": "2025-04-07T13:43:28Z"
  },
  {
    "title": "Dow Tanks 1,300 Points And S&P 500 Enters Bear Market As Recession Fears Accelerate (Live Updates)",
    "description": "The benchmark S&P 500 entered a 20% bear market, with a majority of losses following Trump’s “Liberation Day” tariffs announced last week.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/07/stock-market-meltdown-trump-tariffs-trade-war-04-07-25/",
    "timestamp": "2025-04-07T13:42:14Z"
  },
  {
    "title": "US stocks enter bear market territory as tariff misery continues on Wall Street | CNN Business",
    "description": "US stocks opened lower Monday as markets around the world tumbled over concerns about how President Donald Trump’s sweeping tariffs might upend the global economy and stymie US economic growth.",
    "link": "https://www.cnn.com/2025/04/07/investing/us-stock-market-dow-tariffs/index.html",
    "timestamp": "2025-04-07T13:41:33Z"
  },
  {
    "title": "Recession 2025 in US: After J.P. Morgan, other investment banks, now Goldman Sachs raises odds",
    "description": "Odds of a U.S. recession have been raised by Goldman Sachs for the next 12 months.",
    "link": "https://economictimes.indiatimes.com/news/international/us/recession-2025-in-us-after-j-p-morgan-other-investment-banks-now-goldman-sachs-raises-odds/articleshow/120067568.cms",
    "timestamp": "2025-04-07T13:40:57Z"
  },
  {
    "title": "US President Donald Trump’s billionaire supporter urges him to delay tariffs amid fears of ‘economic nuclear winter’",
    "description": "Billionaire hedge fund manager Bill Ackman has cautioned US President Donald Trump that his broad new tariffs would cause an ‘economic nuclear winter’ unless suspended for renegotiation. Supported by JPMorgan's Jamie Dimon, Ackman urged a 90-day delay to prev…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-president-donald-trumps-billionaire-supporter-urges-him-to-delay-tariffs-amid-fears-of-economic-nuclear-winter/articleshow/120067590.cms",
    "timestamp": "2025-04-07T13:40:49Z"
  },
  {
    "title": "Why has Trump revoked all South Sudanese visas?",
    "description": "A US deportee who South Sudanese officials say is not from the country is at the root of the spat.",
    "link": "https://www.aljazeera.com/news/2025/4/7/why-has-trump-revoked-all-south-sudanese-visas",
    "timestamp": "2025-04-07T13:40:33Z"
  },
  {
    "title": "Appeals court reinstates agency members but Supreme Court could have the last word",
    "description": "“Only the Supreme Court can decide the dispute and, in my opinion, the sooner, the better,\" a dissenting judge wrote.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/appeals-court-reinstates-gwynne-wilcox-cathy-harris-supreme-court-rcna199976",
    "timestamp": "2025-04-07T13:40:19Z"
  },
  {
    "title": "Bitcoin Price Breaks Below $75,000 as Global Tariff War Roils Risk Assets",
    "description": "\"Does Bitcoin behave more like a tech stock or a safe-haven asset like gold? So far, we’re seeing elements of both,\" an analyst told Decrypt.",
    "link": "https://decrypt.co/313614/bitcoin-price-below-75000-global-tariff-war",
    "timestamp": "2025-04-07T13:40:07Z"
  },
  {
    "title": "Viola Davis’ ‘G20’ Movie: Release Date, Where to Watch & More",
    "description": "Viola plays a president in the latest action movie titled 'G20.' Find out how you can watch it, what it's about and more details here.",
    "link": "https://hollywoodlife.com/feature/viola-davis-g20-movie-5378940/",
    "timestamp": "2025-04-07T13:39:44Z"
  },
  {
    "title": "US stocks nosedive, with S&P 500 entering bear territory as global tariff rout worsens",
    "description": "Investors had been hoping for foreign nations to rush to the negotiating table so the US could avoid the impact from President Donald Trump's latest hefty tariffs.",
    "link": "https://nypost.com/2025/04/07/business/us-stocks-nosedive-with-sampp-500-entering-bear-territory/",
    "timestamp": "2025-04-07T13:39:39Z"
  },
  {
    "title": "Pressure on Fed and Powell rise as Wall Street rate cut bets mount",
    "description": "The markets and President Trump are piling more pressure on the Fed to consider near-term rate cuts as the tariff turmoil deepens.",
    "link": "https://finance.yahoo.com/news/pressure-on-fed-and-powell-rises-as-wall-street-rate-cut-bets-mount-133812429.html",
    "timestamp": "2025-04-07T13:38:12Z"
  },
  {
    "title": "Who is Peter Navarro? The man Elon Musk is publicly lashing out at for influencing Donald Trump to impose tariffs that have rattled markets",
    "description": "Peter Navarro is at the center of a storm after Elon Musk blamed him for pushing Donald Trump toward harsh tariffs that wiped trillions off the stock market. This explosive clash between the Tesla CEO and the Harvard-trained economist has sparked public outra…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-peter-navarro-the-man-elon-musk-is-publicly-lashing-out-at-for-influencing-donald-trump-to-impose-tariffs-that-have-rattled-markets/articleshow/120067216.cms",
    "timestamp": "2025-04-07T13:37:28Z"
  },
  {
    "title": "New Trump Tariffs Send Nike & Other Sneaker Brands Stock Plunging",
    "description": "Now that Donald Trump has decided to accelerate America’s path to a recession and implement unnecessary tariffs on every country and penguin inhabited island outside of Russia (of course), stocks have plummeted for every single sneaker brand as they make all …",
    "link": "https://hiphopwired.com/2668730/new-trump-tariffs-send-nike-other-sneaker-brands-stock-plunging/",
    "timestamp": "2025-04-07T13:36:40Z"
  },
  {
    "title": "Reporter Asks Trump Straight-Up If He’s ‘Crashing the Markets on Purpose’ on Air Force One",
    "description": "CBS's Jennifer Jacobs straight-up asked President Donald Trump if he's \"crashing the markets on purpose\" amid a disastrous week for the stock market.\nThe post Reporter Asks Trump Straight-Up If He’s ‘Crashing the Markets on Purpose’ on Air Force One first app…",
    "link": "https://www.mediaite.com/news/reporter-asks-trump-straight-up-if-hes-crashing-the-markets-on-purpose-on-air-force-one/",
    "timestamp": "2025-04-07T13:36:33Z"
  },
  {
    "title": "Dow crashes 1,400 points at open, Nasdaq, S&P drop 4% as Trump tariffs push markets further down",
    "description": "Wall Street's main indexes opened sharply lower on Monday, with the S&P 500 on track to confirm bear market territory, as investors sought refuge in government bonds on economic worries over the fallout of U.S. President Donald Trump's sweeping tariff plans.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-crashes-1400-points-at-open-nasdaq-sp-drop-4-as-trump-tariffs-push-markets-further-down/articleshow/120067522.cms",
    "timestamp": "2025-04-07T13:35:45Z"
  },
  {
    "title": "60 Minutes tells us what we all already knew: at least 75% of those deported to El Salvador don't appear to have a criminal record [Obvious]",
    "description": "60 Minutes tells us what we all already knew: at least 75% of those deported to El Salvador don't appear to have a criminal record",
    "link": "https://www.fark.com/comments/13625142/-60-Minutes-tells-us-what-we-all-already-knew-at-least-75-of-those-deported-to-El-Salvador-dont-appear-to-have-a-criminal-record",
    "timestamp": "2025-04-07T13:34:43Z"
  },
  {
    "title": "Is Donald Trump Planning a US Military Parade? What We Know",
    "description": "US President Donald Trump is planning a military parade through Washington, D.C. that will coincide with his birthday this summer, according to a city news report.\nIt's claimed that the event will mark the 250th anniversary of the U.S. Army on June 14, which …",
    "link": "https://biztoc.com/x/a92afb83b15d3dcd",
    "timestamp": "2025-04-07T13:32:39Z"
  },
  {
    "title": "Sellouts and Selloffs",
    "description": "Plus: A deportation fight, pussy hats in, antagonizing Brown University, and more...",
    "link": "https://reason.com/2025/04/07/sellouts-and-selloffs/",
    "timestamp": "2025-04-07T13:32:31Z"
  },
  {
    "title": "AG Pam Bondi moves the goalposts on the nation’s ‘constitutional crisis’",
    "description": "Attorney General Pam Bondi argued that when Americans take their legal concerns about the administration to the courts, it creates a “constitutional crisis.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ag-pam-bondi-moves-goalposts-nations-constitutional-crisis-rcna199967",
    "timestamp": "2025-04-07T13:32:22Z"
  },
  {
    "title": "Video Gamers Angry About Impacts of Trump Tariffs – LT",
    "description": "Gaming is one of many sectors expected to be hit hard by US President Donald Trump’s tariff scheme and video game fans are already up in arms about the impacts of his controversial policy.\nGamers were quick to voice their anger last week, condemning Trump’s r…",
    "link": "https://biztoc.com/x/1870931a9739e595",
    "timestamp": "2025-04-07T13:32:19Z"
  },
  {
    "title": "Porno for Pyros",
    "description": "As we watch the international financial markets burn down today, a few observations: (1) Trump is extremely stupid, extremely evil, and extremely mentally ill. I’ve noticed that very many people have an overwhelming desire to deny one or more of these things.…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/porno-for-pyros",
    "timestamp": "2025-04-07T13:32:15Z"
  },
  {
    "title": "President Donald Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "WASHINGTON — President Donald Trump remained defiant on Monday as global markets continued plunging and fears of a recession grew after his tariff announcement last week.\nHe said other countries had been “taking advantage of the Good OL’ USA!” in a post on Tr…",
    "link": "https://biztoc.com/x/ba621bd97d2dbebd",
    "timestamp": "2025-04-07T13:32:05Z"
  },
  {
    "title": "WATCH LIVE: Trump and Israeli PM Netanyahu hold news conference at White House",
    "description": "President Donald Trump plans to meet with Israeli Prime Minister Benjamin Netanyahu on Monday in what would be their second White House sit-down since Trump's return to office.",
    "link": "https://biztoc.com/x/a2bc8bd8bb4b8aef",
    "timestamp": "2025-04-07T13:32:04Z"
  },
  {
    "title": "The enduring appeal of pens and paper in a digital era",
    "description": "Analog forms of communication are far from dead. Indie stationery brands are capitalizing on a dedicated customer base who typically had to look abroad for special stationery goods.",
    "link": "https://www.retaildive.com/news/stationery-indie-retail-thrives-analog-pens-paper-digital-world/743985/",
    "timestamp": "2025-04-07T13:32:00Z"
  },
  {
    "title": "New-age firms’ Monday blues; Juspay’s soonicorn raise",
    "description": "The global stock market carnage has come for India’s freshly-listed new-age tech firms. This and more in today’s ETtech Top 5.",
    "link": "https://economictimes.indiatimes.com/tech/newsletters/tech-top-5/new-age-firms-monday-blues-juspays-soonicorn-raise/articleshow/120067081.cms",
    "timestamp": "2025-04-07T13:31:53Z"
  },
  {
    "title": "Is Donald Trump Planning a US Military Parade? What We Know",
    "description": "An official in Washington D.C. claims that Trump is planning a 4-mile long military parade through the capital in honor of the Army's 250th anniversary.",
    "link": "https://www.newsweek.com/trump-military-parade-army-washington-2056227",
    "timestamp": "2025-04-07T13:30:52Z"
  },
  {
    "title": "Red tape, labour shortage preventing homes from being built, says home builders' association",
    "description": "Increased costs, red tape and labour shortages are preventing more homes from being built in Newfoundland and Labrador, according to companies that attended the Canadian Home Builders' Association's (CHBA) annual expo in Mount Pearl over the weekend.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/home-building-problems-1.7503370",
    "timestamp": "2025-04-07T13:30:07Z"
  },
  {
    "title": "Think twice before bailing out of the stock market, financial advisers say",
    "description": "Here's a glimpse at what's behind the market's wild moves and what experts advise.",
    "link": "https://roanoke.com/news/nation-world/business/personal-finance/article_ed6a8d27-ccc3-54de-a6d8-e1f2a5db3858.html",
    "timestamp": "2025-04-07T13:30:00Z"
  },
  {
    "title": "Think twice before bailing out of the stock market, financial advisers say",
    "description": "Here's a glimpse at what's behind the market's wild moves and what experts advise.",
    "link": "https://richmond.com/news/nation-world/business/personal-finance/article_714cce2e-dfe1-545e-a350-3b82798eee24.html",
    "timestamp": "2025-04-07T13:30:00Z"
  },
  {
    "title": "US appeals court blocks Trump from removing Democrats from labor boards (Reuters)",
    "description": "Reuters:\nUS appeals court blocks Trump from removing Democrats from labor boards  —  A federal appeals court blocked U.S. President Donald Trump from removing Democratic members from two federal labor boards on Monday, setting aside its earlier ruling.  —  Th…",
    "link": "https://www.memeorandum.com/250407/p31",
    "timestamp": "2025-04-07T13:30:00Z"
  },
  {
    "title": "Longtime critic Bill Maher touts Trump as ‘one of the most effective politicians’ days after White House dinner with prez",
    "description": "“The people are not savvy about issues but they smell a phony a mile away and that kind of s--t, nobody else does it,\" Maher said on his \"Club Random\" podcast.",
    "link": "https://nypost.com/2025/04/07/us-news/bill-maher-touts-trump-as-one-of-the-most-effective-politicians/",
    "timestamp": "2025-04-07T13:29:49Z"
  },
  {
    "title": "Trump’s advise for people as markets tumble: 'Don’t be Stupid! Don’t be a PANICAN'",
    "description": "Ahead of a sharply declining stock market opening, U.S. President Donald Trump urged Americans to \"be strong, courageous, and patient,\" defending his tariff policies. He framed the reforms as long-overdue actions to fix global trade imbalances, declaring that…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-advise-for-people-as-markets-tumble-dont-be-stupid-dont-be-a-panican/articleshow/120067339.cms",
    "timestamp": "2025-04-07T13:29:06Z"
  },
  {
    "title": "A$AP Rocky & Meek Mill Lawyer Joe Tacopina Is Representing Wendy Williams",
    "description": "Media personality Wendy Williams has been on the offensive in trying to free herself from guardianship, and her latest move has been to secure the services of Joe Tacopina. Tacopina, a high-profile attorney, confirmed the news on Thursday (April 3) while appe…",
    "link": "https://hiphopwired.com/2668412/aap-rocky-meek-mill-lawyer-joe-tacopina-is-representing-wendy-williams/",
    "timestamp": "2025-04-07T13:28:58Z"
  },
  {
    "title": "Polls worsen for Donald Trump: New survey finds 75% of Americans unhappy with the financial situation under the new president",
    "description": "A recent poll indicates growing American dissatisfaction with the economy under Donald Trump, with a majority reporting financial distress worsened by inflation and tariffs. Consumer confidence is declining, leading to reduced spending on essentials like groc…",
    "link": "https://economictimes.indiatimes.com/news/international/us/polls-worsen-for-donald-trump-new-survey-finds-75-of-americans-unhappy-with-the-financial-situation-under-the-new-president/articleshow/120067363.cms",
    "timestamp": "2025-04-07T13:27:50Z"
  },
  {
    "title": "Bill Ackman is turning on Trump because of tariffs. And he is not alone | CNN Business",
    "description": "Wealthy business leaders are turning on US President Donald Trump over his plan to impose a colossal set of tariffs on America’s trading partners, as losses mount on stock markets around the world.",
    "link": "https://www.cnn.com/2025/04/07/business/bill-ackman-criticize-trump-tariffs-intl/index.html",
    "timestamp": "2025-04-07T13:27:48Z"
  },
  {
    "title": "No Inflation? Markets tumble, $5 trillion erased in two days but President Donald Trump stands firm on tariff plans. Here’s his message to investors",
    "description": "President Donald Trump reaffirmed his commitment to broad tariff policies, dismissing inflation concerns and rejecting talks with China. His comments came as stock futures dropped sharply and market value fell significantly. Trump blamed previous US leaders a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/no-inflation-markets-tumble-5-trillion-erased-in-two-days-but-president-donald-trump-stands-firm-on-tariff-plans-heres-his-message-to-investors/articleshow/120067265.cms",
    "timestamp": "2025-04-07T13:27:44Z"
  },
  {
    "title": "Wall Street Oracle Bill Ackman Admits He Misjudged Trump: ‘My Bad’",
    "description": "\"I don’t think this was foreseeable. I assumed economic rationality would be paramount,\" the Pershing Square Capital Management CEO writes of the tariffs\nThe post Wall Street Oracle Bill Ackman Admits He Misjudged Trump: ‘My Bad’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-ackman-trump-tariffs-response/",
    "timestamp": "2025-04-07T13:27:23Z"
  },
  {
    "title": "Trump’s Tariff ‘Medicine’ Engulfs Markets as U.S. Stocks Brace for More Turmoil",
    "description": "President Donald Trump's sweeping tariff plans hammered global financial markets and U.S. stocks braced for more turmoil on Monday, after he warned foreign governments they would have to pay \"a lot of money\" to lift the levies he called \"medicine.\"",
    "link": "https://gcaptain.com/trumps-tariff-medicine-engulfs-markets-as-u-s-stocks-brace-for-more-turmoil/",
    "timestamp": "2025-04-07T13:27:01Z"
  },
  {
    "title": "Orange Monday / 2025 Stock Market Crash",
    "description": "Overview The 2025 Stock Market Crash also known as the Orange Monday refers to memes and jokes about a significant decline in global stock markets around t",
    "link": "https://knowyourmeme.com/memes/events/orange-monday-2025-stock-market-crash",
    "timestamp": "2025-04-07T13:26:21Z"
  },
  {
    "title": "2025 Stock Market Crash",
    "description": "Overview The 2025 Stock Market Crash refers to memes and jokes about a significant decline in global stock markets around the world in early April 2025. Th",
    "link": "https://knowyourmeme.com/memes/events/2025-stock-market-crash",
    "timestamp": "2025-04-07T13:26:21Z"
  },
  {
    "title": "Jamie Dimon warns Trump tariffs could reheat inflation, slow growth: ‘The quicker this issue is resolved, the better’",
    "description": "In his annual letter to shareholders, the longtime CEO warned of several possible negative effects from President Donald Trump’s hefty new tariffs.",
    "link": "https://nypost.com/2025/04/07/business/jpmorgan-ceo-jamie-dimon-warns-trump-tariffs-could-reheat-inflation-slow-growth/",
    "timestamp": "2025-04-07T13:26:08Z"
  },
  {
    "title": "Trump Said Cuts Wouldn't Affect Public Safety. Then He Fired Hundreds of Workers Who Help Fight Wildfires. (Mark Olalde/ProPublica)",
    "description": "Mark Olalde / ProPublica:\nTrump Said Cuts Wouldn't Affect Public Safety.  Then He Fired Hundreds of Workers Who Help Fight Wildfires.  —  President Donald Trump's executive orders shrinking the federal workforce make a notable exception for public safety staf…",
    "link": "https://www.memeorandum.com/250407/p30",
    "timestamp": "2025-04-07T13:25:00Z"
  },
  {
    "title": "Mark Cuban told investors not to sell stocks amid the market mayhem — but then walked back his advice",
    "description": "\"Shark Tank\" star Mark Cuban said he deleted his X post because \"no one knows\" if stocks will rebound, and people had to make their own decisions.",
    "link": "https://www.businessinsider.com/mark-cuban-sell-stocks-advice-trump-tariffs-market-selloff-2025-4",
    "timestamp": "2025-04-07T13:23:39Z"
  },
  {
    "title": "D.C. Appeals Court Blocks Trump From Firing NLRB, MSPB Employees",
    "description": "\"In Humphrey’s Executor v. United States, 295 U.S. 602 (1935), and Wiener v. United States, 357 U.S. 349 (1958), the Supreme Court unanimously upheld removal restrictions for government officials on multimember adjudicatory boards.\"\nThe post D.C. Appeals Cour…",
    "link": "https://legalinsurrection.com/2025/04/d-c-appeals-court-blocks-trump-from-firing-nlrb-mspb-employees/",
    "timestamp": "2025-04-07T13:23:12Z"
  },
  {
    "title": "JPMorgan Chase CEO Jamie Dimon, fund manager Bil Ackman warn on tariffs as Wall Street roiled by trade war",
    "description": "Wall Street leaders, including JPMorgan Chase CEO Jamie Dimon and fund manager Bill Ackman, have cautioned about the potential negative consequences of U.S. tariffs. Dimon fears lasting damage to economic alliances and slower growth, while Ackman warns of an …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jpmorgan-chase-ceo-jamie-dimon-fund-manager-bil-ackman-warn-on-tariffs-as-wall-street-roiled-by-trade-war/articleshow/120067289.cms",
    "timestamp": "2025-04-07T13:23:08Z"
  },
  {
    "title": "Onset of economic nuclear winter? Dimon, Ackman sound a warning",
    "description": "Wall Street leaders, including JPMorgan Chase CEO Jamie Dimon and fund manager Bill Ackman, have cautioned about the potential negative consequences of U.S. tariffs. Dimon fears lasting damage to economic alliances and slower growth, while Ackman warns of an …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jpmorgan-chase-ceo-jamie-dimon-fund-manager-bil-ackman-warn-on-tariffs-as-wall-street-roiled-by-trade-war/articleshow/120078944.cms",
    "timestamp": "2025-04-07T13:23:08Z"
  },
  {
    "title": "WATCH: Adam Schiff claims Kamala lost 2024 election for one reason",
    "description": "'The vice president as the vice president, I think, ran a great campaign, but ... '",
    "link": "https://www.wnd.com/2025/04/watch-adam-schiff-claims-kamala-lost-2024-election-for-one-reason/",
    "timestamp": "2025-04-07T13:22:58Z"
  },
  {
    "title": "Trump digs in his heels as global markets keep dropping over tariffs",
    "description": "President Donald Trump is telling people to “Be Strong, Courageous, and Patient, and GREATNESS will be the result” as he remains defiant in the face of plunging global markets and recession fears after his tariff announcement.",
    "link": "https://www.wsls.com/news/politics/2025/04/07/trump-digs-in-his-heels-as-global-markets-keep-dropping-over-tariffs/",
    "timestamp": "2025-04-07T13:22:33Z"
  },
  {
    "title": "Has Japan gained $30.6 billion despite Trump’s tariffs hitting global trade?",
    "description": "Amidst global economic turmoil triggered by Trump's tariffs, Japan has discovered vast cobalt and nickel reserves worth $30.6 billion near Minami-Tori-shima. This windfall, a result of University of Tokyo's research, boosts Japan's economy and offers strategi…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/how-japan-gained-30-6-billion-despite-donald-trumps-tariffs-hitting-global-trade/articleshow/120066772.cms",
    "timestamp": "2025-04-07T13:21:56Z"
  },
  {
    "title": "The trade trap for Indian farmers",
    "description": "Trade wars and tariffs strike directly at the heart of Indian agriculture. Without strategic safeguards and domestic reforms, Indian farmers cannot move from the margins of survival to the centre of a thriving, trade-driven future",
    "link": "https://www.thehindubusinessline.com/opinion/the-trade-trap-for-indian-farmers/article69422283.ece",
    "timestamp": "2025-04-07T13:21:55Z"
  },
  {
    "title": "Ex-Goldman Banker Who Worked on Chips Program Will Run AI Firm",
    "description": "A former Goldman Sachs Group Inc. managing director who worked on the US government’s semiconductor-production program was tapped to run an artificial-intelligence chip company at a time when American companies face international competition to cheaply scale …",
    "link": "https://financialpost.com/pmn/business-pmn/ex-goldman-banker-who-worked-on-chips-program-will-run-ai-firm",
    "timestamp": "2025-04-07T13:21:29Z"
  },
  {
    "title": "Ex-Goldman Banker Who Worked on Chips Program Will Run AI Firm",
    "description": "A former Goldman Sachs Group Inc. managing director who worked on the US government’s semiconductor-production program was tapped to run an artificial-intelligence chip company at a time when American companies face international competition to cheaply scale …",
    "link": "https://www.livemint.com/companies/news/exgoldman-banker-who-worked-on-chips-program-will-run-ai-firm-11744032080444.html",
    "timestamp": "2025-04-07T13:21:19Z"
  },
  {
    "title": "WATCH LIVE: Trump and Israeli PM Netanyahu hold news conference at White House",
    "description": "President Donald Trump plans to meet with Israeli Prime Minister Benjamin Netanyahu on Monday in what would be their second White House sit-down since Trump's return to office.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-and-israeli-pm-netanyahu-hold-news-conference-at-white-house",
    "timestamp": "2025-04-07T13:20:59Z"
  },
  {
    "title": "JPMorgan CEO Jamie Dimon says Trump tariffs will boost inflation, slow an already weakening U.S. economy",
    "description": "JPMorgan Chase CEO Jamie Dimon said tariffs announced by President Donald Trump will likely boost prices on both domestic and imported goods, weighing down a U.S. economy that had already been slowing.\n- Dimon addressed the tariff policy in his annual shareho…",
    "link": "https://biztoc.com/x/97f91f02bbb636b6",
    "timestamp": "2025-04-07T13:20:45Z"
  },
  {
    "title": "Trump Tariffs: Will Brexit Help UK Trade Talks?",
    "description": "Brexit spared the UK from the worst of President Donald Trump’s latest barrage of tariffs. Britain will now find out whether being small, open and alone helps the country to weather a trade war between its two biggest economic partners.\nTrump’s decision to li…",
    "link": "https://biztoc.com/x/685be1e3b471bfaa",
    "timestamp": "2025-04-07T13:20:43Z"
  },
  {
    "title": "Nio Stock Is Moving Lower Monday: What's Going On?",
    "description": "NIO Inc (NYSE:NIO) shares are trading lower Monday morning alongside several Chinese names as trade tensions rise between the U.S. and China.\nWhat Happened: Last week, U.S. President Donald Trump announced sweeping reciprocal tariffs on several countries, inc…",
    "link": "https://biztoc.com/x/dbc2cec2ecb02285",
    "timestamp": "2025-04-07T13:20:39Z"
  },
  {
    "title": "Markets tumble again as Trump tariffs spark fears of ‘economic nuclear war’",
    "description": "Those hoping that the stock market pain from President Donald Trump’s tariff announcements last week was over are in for a rude awakening this morning. As of the time of this writing, stock markets across the world have gotten hammered, adding to fears of a n…",
    "link": "https://biztoc.com/x/0e9d3f8854750935",
    "timestamp": "2025-04-07T13:20:38Z"
  },
  {
    "title": "Trump: Be strong, patient, not 'PANICAN'",
    "description": "United States President Donald Trump took to Truth Social on Monday to urge patience and strength amid the ongoing market turmoil. \"The United States has a chance to do something that should have been...",
    "link": "https://biztoc.com/x/cefcb4fe3dc6023a",
    "timestamp": "2025-04-07T13:20:35Z"
  },
  {
    "title": "Sights Set on Somaliland: The Threat of a Total US–UK–Israeli Takeover",
    "description": "In recent weeks, Somaliland has drawn unprecedented attention from western media. As Israeli and US officials scramble to find a destination to forcibly relocate Gaza’s population, the globally unrecognized breakaway territory is increasingly floated as a pot…",
    "link": "https://www.globalresearch.ca/somaliland-threat-total-us-uk-israeli-takeover/5883707",
    "timestamp": "2025-04-07T13:20:33Z"
  },
  {
    "title": "'Child Abuse': Israel Slams Use of Children with Mock AK-47s in Pro-Palestinian March in South Africa",
    "description": "Israel condemned the use of children carrying mock AK-47s in a pro-Palestinian march in Cape Town, South Africa, last week, calling it a form of \"child abuse\" on Monday.\nThe post ‘Child Abuse’: Israel Slams Use of Children with Mock AK-47s in Pro-Palestinian …",
    "link": "https://www.breitbart.com/africa/2025/04/07/child-abuse-israel-slams-use-of-children-with-mock-ak-47s-in-pro-palestinian-march-in-south-africa/",
    "timestamp": "2025-04-07T13:20:02Z"
  },
  {
    "title": "Trump Celebrates His Tariffs as Global Markets Collapse",
    "description": "On Monday morning, Donald Trump seemed to be celebrating even as the global stock market continued to plunge. \r\nThe president boasted on his Truth Social page of low oil prices, lower food prices, and of “Billions of Dollars a week from the abusing countries …",
    "link": "https://newrepublic.com/post/193663/trump-celebrates-tariffs-global-markets-collapse",
    "timestamp": "2025-04-07T13:19:16Z"
  },
  {
    "title": "France Warns EU Could Take ‘Extremely Aggressive’ Actions in Response to Trump Tariffs",
    "description": "France’s trade minister said the European Union’s response to U.S. President Donald Trump’s tariffs could be “extremely aggressive” amid increasingly heated rhetoric from Paris. Speaking ahead of crunch talks in Luxembourg, French Minister of Foreign Trade La…",
    "link": "https://freerepublic.com/focus/f-news/4309388/posts",
    "timestamp": "2025-04-07T13:19:10Z"
  },
  {
    "title": "Tesla stock tanks. A big Wall Street bull says Elon Musk faces 'a pivotal moment of truth'",
    "description": "Tesla (TSLA) stock was falling yet again Monday, down 6% in premarket trading as markets headed for another brutal day in the wake of President Donald Trump’s sweeping tariffs.Read more...",
    "link": "https://qz.com/tesla-stock-elon-musk-wedbush-dan-ives-trump-tariffs-1851775030",
    "timestamp": "2025-04-07T13:19:00Z"
  },
  {
    "title": "boAt’s Parent Firm Announces Imagine Marketing Files for IPO Papers |  LatestLY",
    "description": "Homegrown wearables brand boAt’s parent company, Imagine Marketing, on Monday announced it has filed draft papers for an initial public offering (IPO) with market regulator Securities and Exchange Board of India (SEBI) through the confidential pre-filing rout…",
    "link": "https://www.latestly.com/technology/boats-parent-firm-announces-imagine-marketing-files-for-ipo-papers-6765128.html",
    "timestamp": "2025-04-07T13:18:47Z"
  },
  {
    "title": "What to know TODAY: The ‘Group Chat’ that has become the internet’s favorite show",
    "description": "Read TODAY.com's Morning Rundown for April 7, 2025, including how President Trump's tariffs could affect your grocery bill and how the \"Group Chat\" TikTok series has gone viral.",
    "link": "https://www.today.com/news/today-morning-rundown-april-7-2025-rcna199963",
    "timestamp": "2025-04-07T13:18:35Z"
  },
  {
    "title": "Report: Iran-Backed Militias in Iraq Open to Disarming to Avoid Trump Airstrikes",
    "description": "The leaders of some of the most powerful Iran-backed terror groups in Iraq, including the notorious Kata'ib Hezbollah (KH), are considering disarming, Reuters reported on Monday, in response to threats of airstrikes from President Donald Trump.\nThe post Repor…",
    "link": "https://www.breitbart.com/middle-east/2025/04/07/report-iran-backed-militias-in-iraq-open-to-disarming-to-avoid-trump-airstrikes/",
    "timestamp": "2025-04-07T13:17:27Z"
  }
]