[
  {
    "title": "Democrat Pulls Off Shocker In Miami, Defeating Trump's Pick",
    "description": "A Democrat hasn't won in Miami since 1997. Eileen Higgins also becomes Miami's first female mayor.\nSource: Miami Herald\nDemocrat Eileen Higgins has defeated Trump-backed opponent Emilio González in Tuesday night’s runoff for Miami mayor, with the former Miami…",
    "link": "https://crooksandliars.com/2025/12/democrat-pulls-shocker-miami-defeating",
    "timestamp": "2025-12-10T16:21:58Z"
  },
  {
    "title": "Justice Department can unseal records from Epstein's 2019 sex trafficking case, judge says",
    "description": "A judge has ruled secret grand jury transcripts from Jeffrey Epstein’s 2019 sex trafficking case can be made public",
    "link": "https://abcnews.go.com/US/wireStory/justice-department-unseal-records-epsteins-2019-sex-trafficking-128279998",
    "timestamp": "2025-12-10T16:21:55Z"
  },
  {
    "title": "US demands ICC rewrite rules to shield Trump – Reuters",
    "description": "The US reportedly wants the ICC to amend the Rome Statute to block any prosecution of Donald Trump, warning refusal would trigger sanctions Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629272-us-demands-icc-amend-rome-statute/",
    "timestamp": "2025-12-10T16:21:03Z"
  },
  {
    "title": "Is Gov. Jared Polis really a ‘sleazebag’ or does he just like sleazebags on social media? (Opinion)",
    "description": "Polis \"scraped the bottom of the barrel to encourage Coloradans to read the work of two men who often say outlandish things to get attention and circle the drain of white supremacy, misogyny and even child pornography to be provocative,\" Megan Schrader writes.",
    "link": "https://www.denverpost.com/2025/12/10/gov-jared-polis-richard-hanania-nicholas-decker/",
    "timestamp": "2025-12-10T16:20:17Z"
  },
  {
    "title": "Wallace Says What Needed To Be Said About Trump's Misogyny",
    "description": "MSNOW's Nicolle Wallace went through a laundry list of all the times in recent weeks that Trump spewed misogynistic comments towards female reporters, including calling them ugly, obnoxious, stupid, and piggy. Then Wallace said what should have been said long…",
    "link": "https://crooksandliars.com/2025/12/wallace-says-what-needed-be-said-about",
    "timestamp": "2025-12-10T16:19:57Z"
  },
  {
    "title": "Jake Tapper Confronts Jasmine Crockett Over Suggesting Hispanic Trump Voters Have ‘Slave Mentality’",
    "description": "CNN's Jake Tapper pressed Rep. Jasmine Crockett (D-TX) on whether she believes Hispanic voters supportive of President Donald Trump have a \"slave mentality.\"\nThe post Jake Tapper Confronts Jasmine Crockett Over Suggesting Hispanic Trump Voters Have ‘Slave Men…",
    "link": "https://www.mediaite.com/media/tv/jake-tapper-confronts-jasmine-crockett-over-suggesting-hispanic-trump-voters-have-slave-mentality/",
    "timestamp": "2025-12-10T16:17:20Z"
  },
  {
    "title": "Donald Trump attacks trans people in grim, fact-free rant",
    "description": "Donald Trump has lashed out at trans people and the Democrats in another speech completely devoid of facts. The President was speaking in Pennsylvania on Tuesday (9 December) when he made the disparaging remarks. The event was billed as being about affordabil…",
    "link": "https://www.thepinknews.com/2025/12/10/donald-trump-attacks-trans-people-in-grim-fact-free-rant/",
    "timestamp": "2025-12-10T16:16:54Z"
  },
  {
    "title": "What Explains Trump's Aggression Against Venezuela? Who Knows?",
    "description": "To better understand the president’s foreign policy, one must study the behavior of small children.",
    "link": "https://www.theatlantic.com/politics/2025/12/trump-boat-strikes-war-venezuela/685199/",
    "timestamp": "2025-12-10T16:14:00Z"
  },
  {
    "title": "Exclusive — Pastor Brunson Calls on Chairman Jim Risch to Schedule Hearing for Trump Religious Freedom Ambassador to Ensure Confirmation before Christmas",
    "description": "Pastor Andrew Brunson, who was imprisoned in Turkey for two years before President Donald Trump secured his release back in Trump’s first term, is ratcheting up pressure on Senate Foreign Relations Committee chairman Sen. Jim Risch (R-ID) to get Trump’s Relig…",
    "link": "https://www.breitbart.com/politics/2025/12/10/exclusive-pastor-brunson-calls-on-chairman-jim-risch-to-schedule-hearing-for-trump-religious-freedom-ambassador-to-ensure-confirmation-before-christmas/",
    "timestamp": "2025-12-10T16:13:59Z"
  },
  {
    "title": "How Republicans Tricked Jasmine Crockett Into Running for Senate",
    "description": "Republicans are taking credit for Representative Jasmine Crockett’s last-minute decision to run for the United States Senate, as part of their efforts to recruit “very vulnerable Democrats” to run for office, NOTUS reported. Crockett’s surprise announcement l…",
    "link": "https://newrepublic.com/post/204242/republicans-jasmine-crockett-running-senate-texas-polls",
    "timestamp": "2025-12-10T16:12:07Z"
  },
  {
    "title": "Trump Jokes About Dying In a Plane Crash During Rough Ride on Air Force One",
    "description": "Trump joked with reporters about the possibility of not seeing them again during a \"rough flight\" aboard Air Force One en route to Pennsylvania.\nThe post Trump Jokes About Dying In a Plane Crash During Rough Ride on Air Force One first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/weird/trump-jokes-about-dying-in-a-plane-crash-during-rough-ride-on-air-force-one/",
    "timestamp": "2025-12-10T16:11:32Z"
  },
  {
    "title": "Democrat John Fetterman decries 'dehumanizing' attack against Charlie Kirk's widow Erika",
    "description": "Senate Democrat John Fetterman decried the \"dehumanizing\" attack against Erika Kirk, a widow and mother, after a left-wing figure called her a \"grifter.\"",
    "link": "https://www.foxnews.com/politics/democrat-john-fetterman-decries-dehumanizing-attack-against-charlie-kirks-widow-erika",
    "timestamp": "2025-12-10T16:11:20Z"
  },
  {
    "title": "Trump: 'I love This Ilhan Omar,' She 'Does Nothing but B*tch'",
    "description": "President Donald Trump blasted Rep. Ilhan Omar (D-MN) during his speech in Pennsylvania on Wednesday for \"always complaining,\" alleging that she married her brother and is in the United States illegally.\nThe post Trump: ‘I love This Ilhan Omar,’ She ‘Does Not…",
    "link": "https://www.breitbart.com/politics/2025/12/10/trump-i-love-ilhan-omar-she-does-nothing-but-btch/",
    "timestamp": "2025-12-10T16:10:34Z"
  },
  {
    "title": "‘They Always Have a Hoax’: Trump Kicks Off Affordability Tour in Pennsylvania",
    "description": "On the first stop of President Donald Trump’s affordability tour, he said making America affordable is his highest priority, while again calling the term a... Read More\nThe post ‘They Always Have a Hoax’: Trump Kicks Off Affordability Tour in Pennsylvania app…",
    "link": "https://www.dailysignal.com/2025/12/10/they-always-have-hoax-trump-kicks-off-affordability-tour-pennsylvania/",
    "timestamp": "2025-12-10T16:10:28Z"
  },
  {
    "title": "Zelenskyy warns Russia, China stepping up military-industrial cooperation",
    "description": "A new report by Ukraine's foreign intelligence has warned of intensifying ties between the strategic partners.",
    "link": "https://www.aljazeera.com/news/2025/12/10/zelenskyy-warns-russia-china-stepping-up-military-industrial-cooperation",
    "timestamp": "2025-12-10T16:08:08Z"
  },
  {
    "title": "Powell's Fed Just Cut Rates Again -- But the Real Shock Is What Happens Next",
    "description": "A split central bank leaves Wall Street watching every word as inflation and missing data collide.",
    "link": "https://finance.yahoo.com/news/powells-fed-just-cut-rates-160559162.html",
    "timestamp": "2025-12-10T16:05:59Z"
  },
  {
    "title": "‘You can give up certain products’: Trump tells Americans to settle for less",
    "description": "Donald Trump has spent months struggling with a brutal dynamic: The more the president fails to deliver on his economic promises, the more the public turns against him. The result has been a steep slide in the Republican’s approval rating, as Americans expres…",
    "link": "https://biztoc.com/x/4b8492f36f1094a6",
    "timestamp": "2025-12-10T16:04:44Z"
  },
  {
    "title": "Trump, EU leaders said to have discussed Ukraine today",
    "description": "United States President Donald Trump spoke on Wednesday with the leaders of European countries about the conflict in Ukraine, according to Axios correspondent Barak Ravid.The leaders included France's...",
    "link": "https://biztoc.com/x/5b59f473f13e09da",
    "timestamp": "2025-12-10T16:04:35Z"
  },
  {
    "title": "Texas Gov. Demands A TPUSA Club In Every School, Donald Trump Portrait In Every Home",
    "description": "OK, maybe not the second one ... yet.",
    "link": "https://www.wonkette.com/p/texas-gov-demands-a-tpusa-club-in",
    "timestamp": "2025-12-10T16:03:11Z"
  },
  {
    "title": "Heather Cox Richardson: Winning with Racism and Culture Wars",
    "description": "Historian Heather Cox Richardson explains the GOP formula for winning elections. It is columns like this that have caused 3,000,000 people to subscribe to her Substack. She writes: When G. Elliott Morris of Strength in Numbers asked ChatGPT to fact-check an a…",
    "link": "https://dianeravitch.net/2025/12/10/heather-cox-richardson-winning-with-racism-and-culture-wars/",
    "timestamp": "2025-12-10T16:01:00Z"
  },
  {
    "title": "How Foreign Governments Police U.S. Speech",
    "description": "Sarah McLaughlin reveals how foreign governments pressure American universities through speech codes and satellite campuses, and examines the broader threat international authoritarianism poses to free expression.",
    "link": "https://reason.com/podcast/2025/12/10/how-foreign-governments-police-u-s-speech/",
    "timestamp": "2025-12-10T16:00:50Z"
  },
  {
    "title": "US Chamber of Commerce accused of leading ‘woke corporate America’ as Trump dismantles DEI agenda",
    "description": "Conservative group Consumers' Research publishes \"Woke Alert\" targeting the U.S. Chamber of Commerce for pushing diversity initiatives and climate agenda.",
    "link": "https://www.foxnews.com/politics/us-chamber-commerce-accused-leading-woke-corporate-america-trump-dismantles-dei-agenda",
    "timestamp": "2025-12-10T16:00:48Z"
  },
  {
    "title": "Trump’s Speech On Inflation Turned to Fighting Immigration",
    "description": "President Donald Trump tried to focus on combating inflation during a speech while traveling in Pennsylvania. Yet the issue was quickly dropped in favor of complaining about immigration.",
    "link": "https://www.shtfplan.com/headline-news/trumps-speech-on-inflation-turned-to-fighting-immigration",
    "timestamp": "2025-12-10T16:00:46Z"
  },
  {
    "title": "'Making a terrible mistake': Analyst warns Trump is doing something voters 'hate'",
    "description": "With his speech in Pennsylvania this week, President Donald Trump is falling into the exact same trap that former President Joe Biden did as he tries to assuage voters about affordability issues in America, MS NOW commentator Donny Deutsch said on MS NOW Wedn…",
    "link": "https://www.rawstory.com/trump-2674386747/",
    "timestamp": "2025-12-10T16:00:35Z"
  },
  {
    "title": "Florida Sues Medical Groups Pushing Transgender Mutilation on Children",
    "description": "Florida Attorney General James Uthmeier: \"Florida will always follow the evidence protect children and defend parents' rights to make informed decisions.\"\nThe post Florida Sues Medical Groups Pushing Transgender Mutilation on Children first appeared on Le·gal…",
    "link": "https://legalinsurrection.com/2025/12/florida-sues-medical-groups-pushing-transgender-mutilation-on-children/",
    "timestamp": "2025-12-10T16:00:20Z"
  },
  {
    "title": "Will Vivek Ramaswamy’s $500M Strive plan shift Bitcoin demand again?",
    "description": "Vivek’s Strive unveiled a $500 million ATM program aimed at expanding its balance sheet strategy.",
    "link": "https://ambcrypto.com/will-vivek-ramaswamys-500m-strive-plan-shift-bitcoin-demand-again/",
    "timestamp": "2025-12-10T16:00:12Z"
  },
  {
    "title": "Martina Navratilova discusses her criticism of Donald Trump: 'I just can't be compliant' (Matthew Futterman/The Athletic)",
    "description": "Matthew Futterman / The Athletic:\nMartina Navratilova discusses her criticism of Donald Trump: 'I just can't be compliant'  —  Martina Navratilova has never been shy about putting herself in line for criticism.  —  She defected from Czechoslovakia to the Unit…",
    "link": "https://www.memeorandum.com/251210/p44",
    "timestamp": "2025-12-10T16:00:05Z"
  },
  {
    "title": "How Netflix’s WB Megadeal Stunned Hollywood — and Sparked a Fight From David Ellison",
    "description": "Who do you believe? The battle for control of Warner Bros. and HBO is coming down to an enormous bet on competing visions of the future of the entertainment industry. On Dec. 5, Netflix landed a whale of a deal that sent shock waves through the community. The…",
    "link": "https://variety.com/2025/film/news/why-netflix-buying-warner-bros-ted-sarandos-1236604802/",
    "timestamp": "2025-12-10T16:00:00Z"
  },
  {
    "title": "PM call with President Trump of the United States, President Macron of France and Chancellor Merz of Germany: 10 December 2025",
    "description": "The Prime Minister spoke to the President of the United States, Donald Trump, the President of France, Emmanuel Macron, and the Chancellor of Germany, Friedrich Merz today.",
    "link": "https://www.gov.uk/government/news/pm-call-with-president-trump-of-the-united-states-president-macron-of-france-and-chancellor-merz-of-germany-10-december-2025",
    "timestamp": "2025-12-10T15:59:02Z"
  },
  {
    "title": "Tax Prosecutions Plummet to Lowest Level in Decades as Trump Guts Enforcement Efforts",
    "description": "President Donald Trump's administration has drastically slashed resources for enforcing tax laws, and the result has been a massive plunge in tax-related prosecutions.A Tuesday report from Reuters found that federal tax prosecutions in 2025 fell to \"their low…",
    "link": "https://www.commondreams.org/news/trump-irs-tax-prosecutions",
    "timestamp": "2025-12-10T15:58:53Z"
  },
  {
    "title": "Who Is Eileen Higgins? Meet the New Miami Mayor",
    "description": "Newly elected Miami mayor Eileen Higgins is making headlines after flipping the city blue for the first time in decades. Here’s what to know about her.",
    "link": "https://hollywoodlife.com/feature/who-is-eileen-higgins-miami-mayor-5492382/",
    "timestamp": "2025-12-10T15:58:32Z"
  },
  {
    "title": "US plans to order foreign tourists to disclose social media histories",
    "description": "The proposal would apply to visitors from 42 countries, including Britain, France, Australia and Japan.",
    "link": "https://www.euractiv.com/news/us-plans-to-order-foreign-tourists-to-disclose-social-media-histories/",
    "timestamp": "2025-12-10T15:58:18Z"
  },
  {
    "title": "Judge orders Trump to end California National Guard troop deployment in Los Angeles",
    "description": "A federal judge has ordered the Trump administration to stop deploying California National Guard troops in Los Angeles",
    "link": "https://abcnews.go.com/US/wireStory/judge-orders-trump-end-california-national-guard-troop-128280164",
    "timestamp": "2025-12-10T15:58:03Z"
  },
  {
    "title": "Watch Jake Tapper Humiliate Jasmine Crockett With Her Own Words",
    "description": "CNN anchor Jake Tapper confronted Democratic Texas Rep. Jasmine Crockett for previously saying that Latinos who voted for President Donald Trump are \"slaves.\"",
    "link": "https://dailycaller.com/2025/12/10/jake-tapper-jasmine-crockett-latinos-trump-slave-mentality/",
    "timestamp": "2025-12-10T15:57:26Z"
  },
  {
    "title": "Jack Smith To Launch His Own Law Firm With Prosecutors Who Targeted Trump",
    "description": "Special counsel Jack Smith is launching a new law firm with attorneys who helped him target President Donald Trump, according to several reports.",
    "link": "https://dailycaller.com/2025/12/10/jack-smith-to-launch-his-own-law-firm-with-prosecutors-who-targeted-trump/",
    "timestamp": "2025-12-10T15:56:52Z"
  },
  {
    "title": "Donald Trump health update: U.S President blasts media, calls health reports as 'seditious'",
    "description": "Donald Trump regularly accuses the media of having failed to cover the health of his predecessor Joe Biden, who dropped out of the 2024 election after a shambolic debate performance raised concerns about the Democrat's age.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-health-update-u-s-president-blasts-media-calls-health-reports-as-seditious/articleshow/125893678.cms",
    "timestamp": "2025-12-10T15:56:40Z"
  },
  {
    "title": "MAGA Influencers Torch Netflix-WBD Deal Over Streamer’s Obama Ties",
    "description": "The right-wing cadre’s influence over the Trump administration could hold some weight as it reviews Warner Bros. Discovery bids\nThe post MAGA Influencers Torch Netflix-WBD Deal Over Streamer’s Obama Ties appeared first on TheWrap.",
    "link": "https://www.thewrap.com/maga-influencers-netflix-wbd-deal-barack-obama/",
    "timestamp": "2025-12-10T15:56:36Z"
  },
  {
    "title": "Judge says Justice Department can unseal records from Epstein’s 2019 sex trafficking case",
    "description": "The judge Wednesday joined two other judges in granting the Justice Department’s requests to unseal material from investigations into the late financier’s sexual abuse.",
    "link": "https://www.pbs.org/newshour/politics/judge-says-justice-department-can-unseal-records-from-epsteins-2019-sex-trafficking-case",
    "timestamp": "2025-12-10T15:55:15Z"
  },
  {
    "title": "Trump Backs GOP Alternative to Obamacare Subsidies",
    "description": "President Donald Trump signaled his support Tuesday for a Republican alternative to the pandemic-era extra Obamacare subsidies Democrats championed during the government shutdown earlier this... Read More\nThe post Trump Backs GOP Alternative to Obamacare Subs…",
    "link": "https://www.dailysignal.com/2025/12/10/trump-backs-gop-alternative-obamacare-subsidies/",
    "timestamp": "2025-12-10T15:55:04Z"
  },
  {
    "title": "Trump’s crackdown on immigration is taking a toll on child care workers",
    "description": "About one-fifth of the child care workforce is Latino, and one-fifth were born outside the United States.",
    "link": "https://www.bostonherald.com/2025/12/10/trump-immigration-child-care-impact/",
    "timestamp": "2025-12-10T15:54:26Z"
  },
  {
    "title": "USPS returns hundreds of troop care packages as charity turns to Trump for 'Christmas miracle'",
    "description": "Nonprofit Boxes to Boots asks President Trump to help after USPS returned 800+ Christmas packages meant for deployed troops, leaving families without support.",
    "link": "https://www.foxnews.com/media/usps-rejects-troop-care-packages-charity-turns-trump-christmas-miracle",
    "timestamp": "2025-12-10T15:54:14Z"
  },
  {
    "title": "Judge orders Trump to end California National Guard troop deployment in Los Angeles",
    "description": "U.S. District Judge Charles Breyer in San Francisco granted a preliminary injunction sought by California officials who opposed President Donald Trump’s extraordinary move to use state Guard troops without the governor’s approval to further his immigration en…",
    "link": "https://www.wpxi.com/news/local/judge-orders-trump-end-california-national-guard-troop-deployment-los-angeles/4BYOWBJEFBAE3FFJVK4UCLTASQ/",
    "timestamp": "2025-12-10T15:54:14Z"
  },
  {
    "title": "A Big Win in Miami Shows Democrats May Ride a Midterm Wave",
    "description": "Stressing affordability and opposing Trump’s mass deportation initiative, Eileen Higgins won big, becoming first the Democratic mayor of Miami since 1997 and continuing a 2025 trend that bodes well for the midterms.",
    "link": "http://nymag.com/intelligencer/article/eileen-higgins-miami-win-suggests-democratic-midterm-wave.html",
    "timestamp": "2025-12-10T15:53:51Z"
  },
  {
    "title": "Is SpaceX publicly traded? Elon Musk's company seeks 1st IPO, reports say",
    "description": "Can you buy SpaceX stock? Several recent reports have suggested that billionaire Elon Musk's rocket company is planning to go public sometime in 2026.",
    "link": "https://www.usatoday.com/story/money/2025/12/10/spacex-stock-ipo-elon-musk/87697839007/",
    "timestamp": "2025-12-10T15:53:29Z"
  },
  {
    "title": "Will Trump Lower Tariffs To Address Affordability?",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | December 09, 2025\nPresident Donald Trump didn’t rule out reducing tariffs on some goods in order to address affordability concerns.\nWhen asked by Politico if he would rule out reducing tariffs on any more goo…",
    "link": "https://biztoc.com/x/75b69b5def520f27",
    "timestamp": "2025-12-10T15:53:24Z"
  },
  {
    "title": "There are no good outcomes for the Warner Bros. sale",
    "description": "Netflix is the frontrunner to become Warner Bros.' new owner, but the war for control of the legacy studio isn't over just yet. Paramount Skydance has made its own outsize offer for the company that would give CEO David Ellison even more control over the news…",
    "link": "https://www.theverge.com/streaming/841581/warner-bros-netflix-paramount-skydance-ellison-hostile-bid",
    "timestamp": "2025-12-10T15:52:28Z"
  },
  {
    "title": "Trump’s $12bn aid package: Are tariffs bleeding US farmers?",
    "description": "Trump says funds will be made available from tariff revenues and promises trade policies will make US farmers 'strong’.",
    "link": "https://www.aljazeera.com/economy/2025/12/10/trumps-12bn-aid-package-are-tariffs-bleeding-us-farmers",
    "timestamp": "2025-12-10T15:52:18Z"
  },
  {
    "title": "Democracies must fight for freedom, Nobel Peace Prize laureate Machado says",
    "description": "Democracies must be prepared to fight for freedom in order to survive, Nobel Peace Prize laureate and Venezuelan opposition leader Maria Corina Machado says in a speech delivered by her daughter.",
    "link": "https://www.abc.net.au/news/2025-12-11/democracies-must-fight-for-freedom-nobel-peace-prize-machado/106128196",
    "timestamp": "2025-12-10T15:51:57Z"
  },
  {
    "title": "Kerry Kennedy honors late father RFK with impassioned plea for US to ‘do better’",
    "description": "Exclusive: ‘The Independent’ spoke with Kerry Kennedy at the 2025 RFK Human Rights Ripple of Hope Award Gala, held to honor the legacy of her father, the late senator Robert F Kennedy",
    "link": "https://www.the-independent.com/life-style/kerry-kennedy-rfk-human-rights-b2881863.html",
    "timestamp": "2025-12-10T15:50:51Z"
  },
  {
    "title": "Rachel Maddow Blasts CBS For 'Absolutely Transparent' Cancellation Of The Late Show With Stephen Colbert, Then Has One Request",
    "description": "Rachel Maddow knows how to handle The Late Show situation, and it's pretty simple.",
    "link": "https://www.cinemablend.com/television/rachel-maddow-blasts-cbs-the-late-show-with-stephen-colbert-cancellation-one-request",
    "timestamp": "2025-12-10T15:50:21Z"
  },
  {
    "title": "Chick-fil-A",
    "description": "Chick-fil-A is an American fast-food chain, specializing in chicken sandwiches. Franchised in the American South in the late 1960s, Chick-fil-A grew global",
    "link": "https://knowyourmeme.com/memes/subcultures/chick-fil-a",
    "timestamp": "2025-12-10T15:50:03Z"
  },
  {
    "title": "Could Ukraine hold a presidential election right now, as Trump demands?",
    "description": "What are the practicalities of holding an election in wartime?",
    "link": "https://www.aljazeera.com/features/2025/12/10/could-ukraine-hold-a-presidential-election-right-now-as-trump-demands",
    "timestamp": "2025-12-10T15:46:49Z"
  },
  {
    "title": "Guy Parmelin elected Swiss president for 2026",
    "description": "Switzerland rotates the presidency annually among the Federal Council, the seven-member cabinet that serves as the country's government and collective head of state.",
    "link": "https://www.euractiv.com/news/guy-parmelin-elected-swiss-president-for-2026/",
    "timestamp": "2025-12-10T15:46:20Z"
  },
  {
    "title": "WATCH LIVE: Senate meets ahead of dueling health care proposal votes",
    "description": "Both the Republican plan, which would replace the subsidies with new savings accounts, and a Democratic bill to extend the enhanced Affordable Care Act tax credits for three years lack the bipartisan support needed for passage.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-senate-meets-ahead-of-dueling-health-care-proposal-votes",
    "timestamp": "2025-12-10T15:46:04Z"
  },
  {
    "title": "Judge orders Trump to end National Guard troop deployment in Los Angeles",
    "description": "The Trump administration must stop deploying the California National Guard in Los Angeles and return control of the troops to the state, a federal judge ruled Wednesday.",
    "link": "https://www.pbs.org/newshour/politics/judge-orders-trump-to-end-national-guard-troop-deployment-in-los-angeles",
    "timestamp": "2025-12-10T15:44:34Z"
  },
  {
    "title": "Trump brags over working hours as Dems raise fitness concerns",
    "description": "He further insisted his recent medical exams had shown him to be in good health.",
    "link": "https://justthenews.com/politics-policy/trump-brags-over-working-hours-dems-raise-fitness-concerns",
    "timestamp": "2025-12-10T15:44:03Z"
  },
  {
    "title": "Trump attack on London mayor is wrong, says No 10",
    "description": "Sir Keir Starmer's press secretary says Donald Trump's comments about the London mayor were \"wrong\".",
    "link": "https://www.bbc.com/news/articles/cvgkdvpyypeo",
    "timestamp": "2025-12-10T15:44:00Z"
  },
  {
    "title": "Judge orders Trump to end California National Guard troop deployment in Los Angeles",
    "description": "The Trump administration must stop deploying the California National Guard in Los Angeles and return control of the troops to the state, a federal judge ruled Wednesday. U.S. District Judge Charles Breyer in San Francisco granted a preliminary injunction soug…",
    "link": "https://freerepublic.com/focus/f-news/4356769/posts",
    "timestamp": "2025-12-10T15:42:26Z"
  },
  {
    "title": "Trump Defends Inflation, Affordability Record in Pennsylvania",
    "description": "President Donald Trump said people were “starting to learn” the benefits of his tariff regime as he sought to convince voters his administration was moving to address affordability concerns, taking to the road in hopes of countering a mounting political vulne…",
    "link": "https://biztoc.com/x/6428043656b65633",
    "timestamp": "2025-12-10T15:42:12Z"
  },
  {
    "title": "A Democrat wins Miami mayor’s race for the first time in nearly 30 years",
    "description": "Democrat Eileen Higgins won the Miami mayor’s race on Tuesday, defeating a Republican endorsed by President Donald Trump to end her party’s nearly three-decade losing streak and give Democrats a boost in one of the last electoral battles ahead of the 2026 mid…",
    "link": "https://biztoc.com/x/d588d04bf07ecaae",
    "timestamp": "2025-12-10T15:41:43Z"
  },
  {
    "title": "Humphrey's Executor On The Ropes",
    "description": "Can Congress create federal agencies with power to enforce the laws and prosecute crimes, but which agencies are outside the control of the President? In a 1935 decision called Humphrey’s Executor, the Supreme Court held that it could. I first wrote about thi…",
    "link": "https://freerepublic.com/focus/f-chat/4356768/posts",
    "timestamp": "2025-12-10T15:40:49Z"
  },
  {
    "title": "‘Can you imagine if Donald Trump married his sister?’ President takes war with Ilhan Omar to next level",
    "description": "'She married her brother to get in. Therefore, she's here illegally. She should get the hell out. Throw her the hell out'",
    "link": "https://www.wnd.com/2025/12/can-you-imagine-if-donald-trump-married-his/",
    "timestamp": "2025-12-10T15:40:36Z"
  },
  {
    "title": "China says no to Nvidia H200 chips, but quietly holds secret meet with Alibaba, Tencent and ByteDance to gauge demand",
    "description": "China may limit access to Nvidia H200 chips despite Trump approving exports. Beijing held emergency talks with Alibaba, ByteDance, and Tencent to gauge demand. Companies may need approval and must explain why local chips can’t meet needs. H200 chips outperfor…",
    "link": "https://economictimes.indiatimes.com/news/international/us/china-says-no-to-nvidia-h200-chips-but-quietly-holds-secret-meet-with-alibaba-tencent-and-bytedance-to-gauge-demand/articleshow/125892356.cms",
    "timestamp": "2025-12-10T15:40:15Z"
  },
  {
    "title": "Voters Got Us Into This Mess. They're Getting Us Out. (The Bulwark)",
    "description": "The Bulwark:\nVoters Got Us Into This Mess.  They're Getting Us Out.  —  Georgia on our minds.  —  At a speech in Pennsylvania last night, in the midst of a remarkably racist rant about Somali Americans and Democratic Rep. Ilhan Omar, Donald Trump said somethi…",
    "link": "https://www.memeorandum.com/251210/p41",
    "timestamp": "2025-12-10T15:40:05Z"
  },
  {
    "title": "Historic ally flags US as major 'security risk' for first time ever: report",
    "description": "For the first time, a close European ally of the U.S. has called the nation a \"security risk\" in response to President Donald Trump's insistence that Greenland should become an American territory, according to Bloomberg.Trump first began expressing a desire t…",
    "link": "https://www.rawstory.com/alternet-posts/trump-greenland-2674386858/",
    "timestamp": "2025-12-10T15:39:39Z"
  },
  {
    "title": "Justice Department can unseal records from Jeffrey Epstein’s 2019 sex trafficking case, judge rules",
    "description": "Secret grand jury transcripts from Jeffrey Epstein’s 2019 sex trafficking case can be made public, a judge ruled Wednesday, joining two other judges in granting the Justice Department’s requests to unseal material from investigations into the late financier’s…",
    "link": "https://nypost.com/2025/12/10/us-news/justice-department-can-unseal-records-from-jeffrey-epsteins-2019-sex-trafficking-case-judge-rules/",
    "timestamp": "2025-12-10T15:39:29Z"
  },
  {
    "title": "More athletes in the 'Games for the doped': Olympic swimmers, another sprinter and a weightlifter",
    "description": "The &apos;Enhanced Games&apos;, an event open to athletes who dope, adds more names to the list of participants for its first edition. The likes of Frenchman  Mouhamadou Fall, seve",
    "link": "https://www.marca.com/en/more-sports/2025/12/10/693992ce22601dec378b4581.html",
    "timestamp": "2025-12-10T15:39:27Z"
  },
  {
    "title": "Zelenskyy appears to change his mind on holding elections after Trump's criticism",
    "description": "Zelenskyy could be Ukraine ready for its first election since Russia's 2022 invasion if international partners provide security guarantees.",
    "link": "https://www.foxnews.com/world/zelenskyy-appears-change-his-mind-holding-elections-after-trumps-criticism",
    "timestamp": "2025-12-10T15:39:15Z"
  },
  {
    "title": "Miami Is (Finally) Being Run By a Woman",
    "description": "It’s about time.",
    "link": "https://www.jezebel.com/miami-is-finally-being-run-by-a-woman",
    "timestamp": "2025-12-10T15:39:07Z"
  },
  {
    "title": "P.E.I. to sell remaining U.S. booze, donate profits to food banks",
    "description": "Prince Edward Islanders who have been missing their favourite American wines will soon have a chance to stock up. The provincial government has directed the P.E.I. Liquor Control Commission to put its existing inventory of U.S. alcohol on shelves starting Thu…",
    "link": "https://www.cbc.ca/news/canada/prince-edward-island/pei-to-sell-remaining-american-booze-9.7009924",
    "timestamp": "2025-12-10T15:38:45Z"
  },
  {
    "title": "'They always have a hoax. The new word is 'affordability'': Trump addresses inflation concerns at Pa. rally",
    "description": "President Donald Trump assured supporters in Pennsylvania that inflation is no longer an issue, as he criticized Democrats for using \"affordability\" to damage his reputation.",
    "link": "https://www.wtae.com/article/hoax-affordability-president-trump-addresses-inflation-pa-rally/69684055",
    "timestamp": "2025-12-10T15:35:12Z"
  },
  {
    "title": "Trump 'may not make it to the end' of his term amid visible decline: analyst",
    "description": "Political commentator Jim Acosta warned that Donald Trump “may not make it to the end of this term,” arguing on Fast Politics that the 79-year-old president is showing stark signs of decline just a year into his second run in the White House. Acosta said Trum…",
    "link": "https://www.rawstory.com/trump-health-2674386889/",
    "timestamp": "2025-12-10T15:35:02Z"
  },
  {
    "title": "US judge blocks Trump's National Guard deployment in Los Angeles",
    "description": "The judge has ordered control of the the troops, which were deployed in June, to be returned to California's governor.",
    "link": "https://www.bbc.com/news/articles/c0r9p1yr1y7o",
    "timestamp": "2025-12-10T15:32:25Z"
  },
  {
    "title": "A Democrat wins Miami mayor’s race for the first time in nearly 30 years",
    "description": "Democrat Eileen Higgins won the Miami mayor’s race on Tuesday, defeating a Republican endorsed by President Donald Trump to end her party’s nearly three-decade losing streak and give Democrats a boost in one of the last electoral battles ahead of the 2026 mid…",
    "link": "https://www.pbs.org/newshour/politics/a-democrat-wins-miami-mayors-race-for-the-first-time-in-nearly-30-years",
    "timestamp": "2025-12-10T15:31:57Z"
  },
  {
    "title": "Starmer belatedly defends Sadiq Khan - and calls out Trump comments",
    "description": "Downing Street has belatedly hit back at comments made by Donald Trump about the Mayor of London, saying the remarks were \"wrong\".",
    "link": "https://news.sky.com/story/keir-starmer-belatedly-defends-sadiq-khan-after-horrible-mayor-jibe-and-calls-out-donald-trump-comments-13481832",
    "timestamp": "2025-12-10T15:31:00Z"
  },
  {
    "title": "Trump floats autopen investigation into Biden’s Fed nominees",
    "description": "Trump's comments represent the latest encroachment by the president on the independence of the central bank.",
    "link": "https://www.bostonherald.com/2025/12/10/trump-biden-autopen-fed-nominees/",
    "timestamp": "2025-12-10T15:30:57Z"
  },
  {
    "title": "Cheryl Hines admits Larry David ‘not happy about politics’ but says the pair are cordial",
    "description": "Hines starred as David’s wife and then ex-wife in ‘Curb Your Enthusiasm’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/cheryl-hines-larry-david-politics-rfk-b2881842.html",
    "timestamp": "2025-12-10T15:30:39Z"
  },
  {
    "title": "Democracy means ‘we must be willing to fight for freedom’, says Nobel Prize laureate",
    "description": "Venezuelan opposition leader Maria Corina Machado’s speech was delivered at Oslo ceremony by her daughter",
    "link": "https://www.irishtimes.com/world/americas/2025/12/10/democracy-means-we-must-be-willing-to-fight-for-freedom-says-nobel-prize-laureate/",
    "timestamp": "2025-12-10T15:30:35Z"
  },
  {
    "title": "Who’s Afraid of Stablecoins?",
    "description": "From transaction-processing bottlenecks to data-validation delays, a number of factors make stablecoins poorly suited to retail and even wholesale payments. Crucially, the barriers to widespread use of stablecoins are structural: they cannot be overcome witho…",
    "link": "https://www.project-syndicate.org/commentary/stablecoins-poorly-suited-to-widespread-use-in-retail-or-wholesale-payments-by-daniel-gros-2025-12",
    "timestamp": "2025-12-10T15:30:01Z"
  },
  {
    "title": "Malaise",
    "description": "Hi Donald, this is Susie Wiles speaking, and I encourage you to keep saying this shit.\nTrump at his speech on the economy: \"You can give up certain products. You can give up pencils…They only need one or two. They don't need that many…You don't need 37 dolls …",
    "link": "https://www.eschatonblog.com/2025/12/malaise.html",
    "timestamp": "2025-12-10T15:30:00Z"
  },
  {
    "title": "Trump Wanders Through Bizarre Riff About Not Buying Pencils or ’37 Dolls’ Amid Affordability Crisis",
    "description": "Trump wandered through a bizarre riff on pencils and the oddly specific avoidance of purchasing \"37 dolls for your daughter\" as he defended his policies.\nThe post Trump Wanders Through Bizarre Riff About Not Buying Pencils or ’37 Dolls’ Amid Affordability Cri…",
    "link": "https://www.mediaite.com/media/news/trump-wanders-through-bizarre-riff-about-not-buying-pencils-or-37-dolls-to-combat-affordability-crisis/",
    "timestamp": "2025-12-10T15:28:45Z"
  },
  {
    "title": "Netflix director takes the stand, recounts 5-week scramble to save sci-fi project at heart of his $11 million fraud trial",
    "description": "Carl Rinsch, the director behind \"Ronin 47\" with Keanu Reeves, took the stand in his own defense. He faces up to 90 years in prison if convicted.",
    "link": "https://www.businessinsider.com/netflix-director-carl-rinsch-testifies-11-million-fraud-trial-2025-12",
    "timestamp": "2025-12-10T15:27:24Z"
  },
  {
    "title": "Congressional Democrats widen 2026 battlefield, zero in on new House Republican targets",
    "description": "Democrats expand House battleground map to 39 seats for 2026 midterms, targeting Republican districts in California, Texas, Florida and North Carolina.",
    "link": "https://www.foxnews.com/politics/congressional-democrats-widen-2026-battlefield-zero-new-house-republican-targets",
    "timestamp": "2025-12-10T15:26:22Z"
  },
  {
    "title": "‘Enough is enough’: Rep. Haley Stevens moves to impeach RFK Jr.",
    "description": "Rep. Stevens claims Kennedy's actions on vaccines and medical research threaten Michigan families, though Republican House majority makes removal unlikely.",
    "link": "https://www.mlive.com/news/2025/12/enough-is-enough-rep-haley-stevens-moves-to-impeach-rfk-jr.html",
    "timestamp": "2025-12-10T15:26:16Z"
  },
  {
    "title": "New York Times Defends Story On Trump’s “Signs Of Fatigue” Amid POTUS Attack: “Our Reporting Is Heavily Sourced”",
    "description": "The New York Times defended a recent story that examined Donald Trump’s reduced public schedule and “signs of fatigue,” as the president has claimed that the outlet was being “seditious, perhaps even treasonous” in their reporting on him.” On Tuesday evening,…",
    "link": "http://deadline.com/2025/12/trump-new-york-times-aging-1236644380/",
    "timestamp": "2025-12-10T15:26:02Z"
  },
  {
    "title": "'Absolute kryptonite': Data expert finds Trump hurting GOP candidates 'over and over'",
    "description": "A Democrat won the Miami mayor's race for the first time in decades over a Republican endorsed by President Donald Trump, and CNN's Harry Enten said that's the latest example of an unmistakeable trend.Eileen Higgins campaigned as a proud Democrat against the …",
    "link": "https://www.rawstory.com/trump-republican-mayors-gop-enten/",
    "timestamp": "2025-12-10T15:25:45Z"
  },
  {
    "title": "What provoked Trump's Indian rice outburst?",
    "description": "President Trump's accusations of India  dumping  rice in the U.S. market appear politically motivated, aimed at appeasing American farmers hurt by his tariff wars.  Despite the trade's small scale, the move signals pressure to address rural discontent ahead o…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/what-provoked-trumps-indian-rice-outburst/articleshow/125893366.cms",
    "timestamp": "2025-12-10T15:25:32Z"
  },
  {
    "title": "Justice Department can unseal records from Epstein’s 2019 sex trafficking case, judge says",
    "description": "Secret grand jury transcripts from Jeffrey Epstein’s 2019 sex trafficking case can be made public, a judge ruled Wednesday.",
    "link": "https://www.wpxi.com/news/local/justice-department-can-unseal-records-epsteins-2019-sex-trafficking-case-judge-says/WC76DTC5N5GILKQMBYSSU2BCFM/",
    "timestamp": "2025-12-10T15:25:32Z"
  },
  {
    "title": "Trump's New Imperialism — Just like the neocons he criticizes, Trump embraces the wielding ... (Adam Serwer/The Atlantic)",
    "description": "Adam Serwer / The Atlantic:\nTrump's New Imperialism  —  Just like the neocons he criticizes, Trump embraces the wielding of American power to impose his own worldview on countries that do not share it.  —  Donald Trump hates the neocons.  He'll tell you so hi…",
    "link": "https://www.memeorandum.com/251210/p37",
    "timestamp": "2025-12-10T15:25:00Z"
  },
  {
    "title": "These Are The Modern Kei Cars You'd Actually Buy",
    "description": "Your choices ranged from roadsters to trucks to the coolest of boxy little vans ever to be seen between Hokkaido and Okinawa.",
    "link": "https://www.jalopnik.com/2048350/modern-kei-cars-reader-answers/",
    "timestamp": "2025-12-10T15:25:00Z"
  },
  {
    "title": "‘Sir, Excuse Me!’ CNN Anchor Presses House Republican on Affordability Crisis and Trump’s Farmer Bailout",
    "description": "Brianna Keilar pressed Mark Alford on affordability in a tense exchange, asking him if he's listening to farmers saying trade policies are driving prices up.\nThe post ‘Sir, Excuse Me!’ CNN Anchor Presses House Republican on Affordability Crisis and Trump’s Fa…",
    "link": "https://www.mediaite.com/media/tv/sir-excuse-me-cnn-anchor-presses-house-republican-on-affordability-crisis-and-trumps-farmer-bailout/",
    "timestamp": "2025-12-10T15:23:58Z"
  },
  {
    "title": "Trump’s $12 billion farm aid falls short of covering losses",
    "description": "The emergency package offers temporary relief but fails to address billions in losses from trade disputes and market instability American farmers facing unprecedented financial strain are expressing cautious appreciation for President Donald Trump’s newly ann…",
    "link": "https://rollingout.com/2025/12/10/trumps-12-billion-farm-aid-falls-short/",
    "timestamp": "2025-12-10T15:23:38Z"
  },
  {
    "title": "U.S. Justice Department can unseal records from Epstein's 2019 sex trafficking case, judge says",
    "description": "Justice Department asked judges to lift secrecy orders after the Epstein Files Transparency Act",
    "link": "https://www.cbc.ca/news/world/justice-department-epstein-records-sex-trafficking-case-9.7010091",
    "timestamp": "2025-12-10T15:22:50Z"
  },
  {
    "title": "Leaked Pam Bondi memo targets 'anyone who isn’t a Trump supporter': investigator",
    "description": "A leaked memo by U.S. Attorney General Pam Bondi directs the Justice Department and FBI to compile a list of groups that may be labeled “domestic terrorism” organizations based on political views related to immigration, gender and U.S. policy. The memo was ob…",
    "link": "https://www.rawstory.com/leaked-pam-bondi-memo-targets-anyone-who-isnt-a-trump-supporter-investigator/",
    "timestamp": "2025-12-10T15:22:44Z"
  }
]