[
  {
    "title": "Trump Greeted by King Charles as UK State Visit Begins",
    "description": "US President Donald Trump arrived at Windsor Castle on Wednesday, greeted by King Charles III, kicking off a historic state visit ...",
    "link": "https://biztoc.com/x/3ad49a71ba7953d4",
    "timestamp": "2025-09-17T15:14:37Z"
  },
  {
    "title": "China Bans Top Tech Firms From Buying Nvidia Chips, Report Says",
    "description": "China has reportedly banned its largest tech firms from buying Nvidia AI chips, adding pressure on the U.S. chipmaker’s sales in the country.",
    "link": "https://www.investopedia.com/china-bans-top-tech-firms-from-buying-nvidia-chips-report-says-11811683",
    "timestamp": "2025-09-17T15:13:01Z"
  },
  {
    "title": "UK sees major investment from some of the biggest names in tech - here's all the top deals announced today",
    "description": "Some of the biggest names in tech have announced billions in investments for UK cloud and AI infrstructure.",
    "link": "https://www.techradar.com/pro/uk-tech-space-sees-major-investment-from-some-of-the-biggest-names-in-tech-heres-all-the-top-deal-announced-today",
    "timestamp": "2025-09-17T15:11:10Z"
  },
  {
    "title": "Tim Walz Is Not Surprised Trump Didn’t Know Melissa Hortman’s Name: ‘There’s No Empathy in This Man’ | Video",
    "description": "\"We're supposed to believe that they're definitely concerned about political violence?\" the Minnesota Governor asks Jen Psaki\nThe post Tim Walz Is Not Surprised Trump Didn’t Know Melissa Hortman’s Name: ‘There’s No Empathy in This Man’ | Video appeared first …",
    "link": "https://www.thewrap.com/tim-walz-trump-melissa-hortman-assassination-empathy-jen-psaki/",
    "timestamp": "2025-09-17T15:10:54Z"
  },
  {
    "title": "DOJ Deletes Study Showing Domestic Terror Predominantly Right-Wing",
    "description": "The Trump administration has so exploited the murder of Charlie Kirk that if I were a conspiracy theorist I could easily believe it was a false flag set up to give MAGA world an excuse to unleash hatred, potential violence and legal and financial mayhem on th…",
    "link": "https://crooksandliars.com/2025/09/doj-removes-study-showing-domestic",
    "timestamp": "2025-09-17T15:10:22Z"
  },
  {
    "title": "DHS blames political rhetoric for surge in assaults on ICE agents after Charlie Kirk murder",
    "description": "Federal officials call for reduced inflammatory language about immigration enforcement following attacks on ICE agents and the Charlie Kirk murder in Utah.",
    "link": "https://www.foxnews.com/politics/dhs-blames-political-rhetoric-surge-assaults-ice-agents-after-charlie-kirk-murder",
    "timestamp": "2025-09-17T15:07:32Z"
  },
  {
    "title": "US Treasury's Bessent made contradictory mortgage pledges, Bloomberg reports",
    "description": "WASHINGTON (Reuters) -U.S. Treasury Secretary Scott Bessent previously agreed to occupy two different houses at the same time as his \"principal residence...",
    "link": "https://finance.yahoo.com/news/us-treasurys-bessent-made-contradictory-150712424.html",
    "timestamp": "2025-09-17T15:07:12Z"
  },
  {
    "title": "These Are the First Words Donald Trump Said Upon Seeing Princess Kate",
    "description": "The U.S. president and first lady arrived to Windsor Castle for their second state visit, where Trump greeted the Princess of Wales in a very typical way.",
    "link": "https://www.harpersbazaar.com/celebrity/latest/a66140450/donald-trump-calls-kate-middleton-beautiful-state-visit-day-one/",
    "timestamp": "2025-09-17T15:06:00Z"
  },
  {
    "title": "Inside Trumpworld’s Reality Distortion Field",
    "description": "In the immediate aftermath of Charlie Kirk's killing, Donald Trump's advisors were sure who was to blame. Whether they actually were didn't, and doesn't, much seem to matter.",
    "link": "https://www.wired.com/story/inside-trumpworlds-reality-distortion-field/",
    "timestamp": "2025-09-17T15:04:52Z"
  },
  {
    "title": "Nvidia’s chips are no longer welcome in China",
    "description": "Alibaba, ByteDance, and other Chinese technology companies are barred from purchasing Nvidia’s latest AI chips custom-made for China, the Financial Times reported on Wednesday. The Cyberspace Administration of China banned buying and testing the RTX Pro 6000D…",
    "link": "https://www.theverge.com/news/779934/nvidia-ban-china-no-longer-welcome",
    "timestamp": "2025-09-17T15:03:12Z"
  },
  {
    "title": "Ex-CDC chief testifies RFK Jr. fired her over vaccine science",
    "description": "Former Centers for Disease Control and Prevention Director Susan Monarez is testifying before Congress about her firing. Monarez told senators Health Secretary Robert F. Kennedy Jr. fired her for refusing to endorse vaccine recommendations without reviewing s…",
    "link": "https://apnews.com/article/monarez-cdc-vaccines-kennedy-rfk-jr-194fd4336aaa74cb6e7c715d0605b47e",
    "timestamp": "2025-09-17T15:02:22Z"
  },
  {
    "title": "Little progress being made in Canada-U.S. trade talks as Carney's focus shifts to Mexico",
    "description": "Canada-U.S. trade talks remain quiet as Washington focuses on UK visit, and Ottawa eyes Mexico partnership ahead of CUSMA review.",
    "link": "https://nationalpost.com/news/little-progress-being-made-in-canada-u-s-trade-talks-as-carneys-focus-shifts-to-mexico",
    "timestamp": "2025-09-17T15:01:18Z"
  },
  {
    "title": "Did Donald Trump Break Royal Protocol in Front of King Charles? What to Know",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump was criticized for \"walking [in front] of the king, like Charles doesn't even exist or matter\" during his state visit to Britain—though Newsweek understands he followed the intended orde…",
    "link": "https://biztoc.com/x/9fde373d31787890",
    "timestamp": "2025-09-17T15:01:14Z"
  },
  {
    "title": "Louisiana Republican demands social media companies delete anti-Charlie Kirk posts & ban users",
    "description": "Republican U.S. Rep. Clay Higgins, a former sheriff’s deputy from Louisiana, is demanding that social media platforms delete posts and permanently ban users who celebrated the assassination of conservative activist Charlie Kirk.",
    "link": "https://www.advocate.com/news/clay-higgins-social-media-censorship",
    "timestamp": "2025-09-17T15:01:02Z"
  },
  {
    "title": "Republican Ruler Says Democrat Ruler Is “Inciting Violence”",
    "description": "The United States ruling class is becoming increasingly unhinged. They no longer seek just to control those underneath them; they are now eating their own, likely with a wider goal in mind. Representative Nancy Mace has accused Ilhan Omar of inciting violence…",
    "link": "https://www.shtfplan.com/headline-news/republican-ruler-says-democrat-ruler-is-inciting-violence",
    "timestamp": "2025-09-17T15:00:56Z"
  },
  {
    "title": "Scott Bessent Reportedly Made 2 Homes His ‘Primary Residence’ — Same Thing Trump Wants to Fire Fed Gov Over",
    "description": "Treasury boss Scott Bessent once agreed to make two homes his \"principal residence\" simultaneously, drawing comparisons to the allegations against Lisa Cook\nThe post Scott Bessent Reportedly Made 2 Homes His ‘Primary Residence’ — Same Thing Trump Wants to Fir…",
    "link": "https://www.mediaite.com/media/news/scott-bessent-reportedly-made-2-homes-his-primary-residence-same-thing-trump-wants-to-fire-fed-gov-over/",
    "timestamp": "2025-09-17T15:00:34Z"
  },
  {
    "title": "Green Card Update: State Department Proposes Major Change to Applications",
    "description": "The government is proposing a $1 fee to register for the Diversity Visa lottery program.",
    "link": "https://www.newsweek.com/green-card-state-department-change-2131187",
    "timestamp": "2025-09-17T15:00:24Z"
  },
  {
    "title": "White House Account Backfires in Storm of Trolling...",
    "description": "A White House TikTok account aimed at appealing to younger voters has instead become a magnet for relentless trolling.The @whitehouse",
    "link": "https://dnyuz.com/2025/09/17/white-house-tiktok-account-backfires-in-a-storm-of-trump-trolling/",
    "timestamp": "2025-09-17T15:00:03Z"
  },
  {
    "title": "Slovakia Resists Pressure to Quickly Halt Russian Energy",
    "description": "U.S. President Donald Trump said over the weekend that he's prepared to move ahead with 'major' sanctions on Russian oil if European nations do the same.",
    "link": "https://www.rigzone.com/news/wire/slovakia_and_hungary_resist_trump_bid_to_halt_russian_energy-17-sep-2025-181825-article/",
    "timestamp": "2025-09-17T15:00:01Z"
  },
  {
    "title": "Man With Green Card Who Was Held by ICE for 77 Days Speaks Out—'Inhumane'",
    "description": "Reza Zavvar, a green card holder living in Maryland, has been released from ICE detention after 77 days.",
    "link": "https://www.newsweek.com/green-card-holder-released-ice-77-days-reza-zavvar-2131304",
    "timestamp": "2025-09-17T14:59:45Z"
  },
  {
    "title": "President Trump gushes over ‘so beautiful’ Kate Middleton in touching exchange during state visit with royals",
    "description": "Donald Trump praised Kate Middleton as \"so beautiful\" in a touching exchange between the pair.",
    "link": "https://nypost.com/2025/09/17/us-news/president-trump-gushes-over-so-beautiful-kate-middleton-in-touching-exchange-during-state-visit-with-royals/",
    "timestamp": "2025-09-17T14:59:40Z"
  },
  {
    "title": "MARA Holdings (MARA) Soars 7.9% as Crypto Stakeholders Work on 1-Million Bitcoin Purchase",
    "description": "We recently published 10 Hot Stocks Investors Are Buying, 5 Break Fresh Records. MARA Holdings Inc. (NASDAQ:MARA) is one of the best performers on Tuesday...",
    "link": "https://finance.yahoo.com/news/mara-holdings-mara-soars-7-145909531.html",
    "timestamp": "2025-09-17T14:59:09Z"
  },
  {
    "title": "Confronting Evil: Bill O’Reilly Spills on Why Fox News Is ‘Not What It Was’",
    "description": "Bestselling author Bill O'Reilly opened up about his definition of evil, how Trump is dealing with Putin and why Fox News is \"not today what it was.\nThe post Confronting Evil: Bill O’Reilly Spills on Why Fox News Is ‘Not What It Was’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/opinion/confronting-evil-bill-oreilly-explains-why-fox-news-is-not-what-it-was-mediaite-qa/",
    "timestamp": "2025-09-17T14:58:40Z"
  },
  {
    "title": "UCLA race and equity official sounded off after Charlie Kirk’s slaying. Now he’s on leave",
    "description": "A UCLA official with its Equity, Diversity and Inclusion Office has been placed on leave amid an investigation over remarks made on social media concerning the killing of Charlie Kirk, according to social media reports and university sources. Johnathan Perkin…",
    "link": "https://freerepublic.com/focus/f-news/4341037/posts",
    "timestamp": "2025-09-17T14:57:57Z"
  },
  {
    "title": "Former CDC chief Susan Monarez testifies RFK Jr. fired her over vaccine science",
    "description": "Former Centers for Disease Control and Prevention Director Susan Monarez is testifying before Congress about her firing",
    "link": "https://www.wsbradio.com/news/health/former-cdc-chief/AZMXXQV7WZECFHEHUT5NTHT7UY/",
    "timestamp": "2025-09-17T14:57:38Z"
  },
  {
    "title": "Obama says US faces 'political crisis' after killing of Charlie Kirk",
    "description": "The former president criticised the response to the shooting by President Trump, who has vowed to tackle \"radical leftists\".",
    "link": "https://www.bbc.com/news/articles/c9dxge2ep4xo",
    "timestamp": "2025-09-17T14:57:35Z"
  },
  {
    "title": "Did Donald Trump Break Royal Protocol in Front of King Charles? What to Know",
    "description": "The president was welcomed to Windsor Castle by King Charles III and was treated to a royal carriage procession.",
    "link": "https://www.newsweek.com/donald-trump-royal-protocol-king-charles-2131277",
    "timestamp": "2025-09-17T14:57:34Z"
  },
  {
    "title": "EU says India’s Russia links jeopardise closer ties",
    "description": "The European Union’s top diplomat warned Wednesday that its push for closer ties with India could be hampered by New Delhi’s purchases of Russian oil and involvement in military drills with Moscow.  The 27-nation bloc is pressing to seal a trade deal with the…",
    "link": "https://www.digitaljournal.com/business/eu-says-indias-russia-links-jeopardise-closer-ties/article",
    "timestamp": "2025-09-17T14:57:33Z"
  },
  {
    "title": "US Treasury official expected to be named IMF’s second-in-command: source",
    "description": "The US Treasury Department’s chief of staff is anticipated to join the International Monetary Fund (IMF) in a key role as its number-two official, a source told AFP on Wednesday. Dan Katz, who currently works with Treasury Secretary Scott Bessent, is expected…",
    "link": "https://www.digitaljournal.com/business/us-treasury-official-expected-to-be-named-imfs-second-in-command-source/article",
    "timestamp": "2025-09-17T14:57:33Z"
  },
  {
    "title": "California Rancher Kevin Kester Remarks at Republican Press Event",
    "description": "NCBA Past-President and California rancher Kevin Kester, spoke at a House Republican Conference press event yesterday on the importance of the One Big Beautiful Bill for America’s cattle farmers and ranchers. Kester thanked House Leadership and President Dona…",
    "link": "https://agwired.com/2025/09/17/california-rancher-kevin-kester-remarks-at-republican-press-event/",
    "timestamp": "2025-09-17T14:56:10Z"
  },
  {
    "title": "On CNN, Daily Signal President Addresses Kirk Assassination, Liberal Hypocrisy",
    "description": "“There have been political disputes and fights throughout the course of the 250 years that our country has existed” but we’re seeing a unique reaction to the assassination of... Read More\nThe post On CNN, Daily Signal President Addresses Kirk Assassination, L…",
    "link": "https://www.dailysignal.com/2025/09/17/cnn-daily-signal-president-addresses-kirk-assassination-liberal-hypocrisy/",
    "timestamp": "2025-09-17T14:54:33Z"
  },
  {
    "title": "Republican Who Defied Trump Announces Bid for Governor",
    "description": "Georgia’s Republican Secretary of State Brad Raffensperger has thrown his hat in the ring for governor.Raffensperger garnered national attention in 2021 when he refused to “find” Donald Trump enough votes to throw Georgia’s 2020 presidential election results.…",
    "link": "https://newrepublic.com/post/200568/donald-trump-2020-brad-raffensperger-governor",
    "timestamp": "2025-09-17T14:51:33Z"
  },
  {
    "title": "Watch live: FBI Director Kash Patel grilled in new congressional hearing",
    "description": "FBI Director Kash Patel will testify Wednesday before the House Judiciary Committee, his second hearing since the killing of right-wing influencer Charlie Kirk, and just one day after an explosive hearing\r\n on Tuesday before that saw Patel grilled by a Senate…",
    "link": "https://www.rawstory.com/kash-patel-2674003049/",
    "timestamp": "2025-09-17T14:51:04Z"
  },
  {
    "title": "Trump's Complaint Against the New York Times: A Long Press Release that Mangles \"Actual Malice\"",
    "description": "The complaint for Donald Trump against the New York Times reads like a long press release. It says little to show the falsity of the factual statements it identifies, and mainly praises Trump. Among the many examples: in its second paragraph it states that in…",
    "link": "https://biztoc.com/x/c89159efdeb2f59b",
    "timestamp": "2025-09-17T14:49:39Z"
  },
  {
    "title": "What is new in UK-US tech deal and what will it mean for British economy?",
    "description": "Nvidia, OpenAI and Microsoft announce investments as part of multibillion-dollar package alongside Trump visit\nBusiness live – latest updates\nDonald Trump’s arrival in the UK on Tuesday night was accompanied by a multibillion-dollar transatlantic tech agreeme…",
    "link": "https://biztoc.com/x/ca2ad37a147d6227",
    "timestamp": "2025-09-17T14:49:27Z"
  },
  {
    "title": "Germany's Merz vows 'autumn of reforms' in turbulent times",
    "description": "Germany will need sweeping change to remain free and prosperous, Chancellor Friedrich Merz warned Wednesday, calling on the country to unite in the face of Russian aggression, economic woes and rising extremism.",
    "link": "https://www.thelocal.de/20250917/germanys-merz-vows-autumn-of-reforms-in-turbulent-times",
    "timestamp": "2025-09-17T14:48:27Z"
  },
  {
    "title": "Britain Indulges 'King Trump' Fantasy With Historic Ceremony...",
    "description": "Britain Indulges 'King Trump' Fantasy With Historic Ceremony...\r\n\n \n \n \n (Third column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:UK state visit begins under shadow of Epstein scandal...\r\nAir Force One in near miss with SPIRIT jet as it flew to Britain...…",
    "link": "https://dnyuz.com/2025/09/17/britain-indulges-king-trump-fantasy-with-historic-ceremony/",
    "timestamp": "2025-09-17T14:46:37Z"
  },
  {
    "title": "Trump's Complaint Against the New York Times: A Long Press Release that Mangles \"Actual Malice\"",
    "description": "It’s mainly praise for Trump: “President Trump secured the greatest personal and political achievement in American history.”",
    "link": "https://reason.com/volokh/2025/09/17/trumps-complaint-against-the-new-york-times-a-long-press-release-that-mangles-actual-malice/",
    "timestamp": "2025-09-17T14:46:27Z"
  },
  {
    "title": "Obama Implies Trump to Blame for Charlie Kirk Assassination: 'Extreme Views Were Not in My White House'",
    "description": "Former President Barack Obama implied Tuesday that President Donald Trump was to blame for Charlie Kirk's assassination, because of \"extreme\" personnel and policies that aroused violent opposition.\nThe post Obama Implies Trump to Blame for Charlie Kirk Assass…",
    "link": "https://www.breitbart.com/politics/2025/09/17/obama-implies-trump-to-blame-for-charlie-kirk-assassination-extreme-views-were-not-in-my-white-house/",
    "timestamp": "2025-09-17T14:45:16Z"
  },
  {
    "title": "US tech giants underpin UK’s digital infrastructure future",
    "description": "US President Donald Trump is visiting the UKDigital infrastructure investments are among the related business announcements made to coincide with the occasionG…",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/us-tech-giants-underpin-uk-s-digital-infrastructure-future-53868/",
    "timestamp": "2025-09-17T14:45:06Z"
  },
  {
    "title": "'Open season': Expert says Trump heading straight for a 'danger moment' with UK visit",
    "description": "Donald Trump’s so far smooth appearance as he visits the United Kingdom could end badly, according to the former Deputy to Foreign Secretary Boris Johnson.Appearing on CNN International, Sir Alan Duncan claimed the beginning of the visit has gone well while a…",
    "link": "https://www.rawstory.com/trump-uk-2674002858/",
    "timestamp": "2025-09-17T14:44:37Z"
  },
  {
    "title": "House approves bills to reshape DC’s criminal justice system",
    "description": "The House has passed legislation to change how youth offenders are prosecuted in Washington, D.C.",
    "link": "https://www.bostonherald.com/2025/09/17/house-bill-dc-crimical-justice-system/",
    "timestamp": "2025-09-17T14:44:15Z"
  },
  {
    "title": "Bank of Canada cuts key lending rate citing Trump tariffs",
    "description": "Canada's central bank cut its key lending rate to 2.5% today, offering a boost to borrowers in an economy squeezed by US President Donald Trump's trade war.",
    "link": "https://www.rte.ie/news/business/2025/0917/1534000-bank-of-canada-cuts-rates/",
    "timestamp": "2025-09-17T14:42:23Z"
  },
  {
    "title": "Trump Got a Hell of a Greeting in the U.K.",
    "description": "“Forgive the cliche, but it is rather Orwellian for a piece of journalism, which raises questions about our guest’s relationship with America’s most notorious child sex trafficker to lead to arrests,\" a spokesperson for the group behind the protest said.",
    "link": "https://www.jezebel.com/trump-got-a-hell-of-a-greeting-in-the-u-k",
    "timestamp": "2025-09-17T14:42:14Z"
  },
  {
    "title": "Trump broke protocol during his visit to Windsor Castle",
    "description": "\"You look beautiful,\" Trump said to Princess Kate - See photos\nThe post Trump broke protocol during his visit to Windsor Castle appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/09/17/trump-broke-protocol-during-his-visit-to-windsor-castle/",
    "timestamp": "2025-09-17T14:42:13Z"
  },
  {
    "title": "Fed set to announce first interest rate cut in nine months as Trump continues to push for influence",
    "description": "Fed announces first interest rate cut since December as Trump continues to push for influence at the central bank",
    "link": "https://www.cnn.com/business/live-news/federal-reserve-interest-rate-09-17-25",
    "timestamp": "2025-09-17T14:41:23Z"
  },
  {
    "title": "Trump Meets UK Royals in Windsor During State Visit",
    "description": "A royal carriage ride and more than a thousand UK service members greeted US President Donald Trump at Windsor Castle on Wednesday, kicking off a historic state visit that will be set against the backdrop of heightened global and domestic tensions.\nThe presid…",
    "link": "https://biztoc.com/x/507a7766fe648815",
    "timestamp": "2025-09-17T14:38:45Z"
  },
  {
    "title": "Why does sport struggle with equal pay?",
    "description": "International Equal Pay Day, on September 18, highlights gender inequalities across employment sectors. But sport has a series of circumstances that make it a particularly tough nut to crack. At a glance, women's sport seems to be accelerating towards equal p…",
    "link": "https://www.dw.com/en/why-does-sport-struggle-with-equal-pay/a-73970135",
    "timestamp": "2025-09-17T14:38:00Z"
  },
  {
    "title": "Zelensky has no intention of ending conflict with Moscow – MP",
    "description": "The Ukrainian leader wants “to fight to the last but with others doing the fighting,” Georgy Mazurashu has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624819-zelensky-ukraine-conflict/",
    "timestamp": "2025-09-17T14:37:11Z"
  },
  {
    "title": "UK cops seize mobile billboard with Trump-Epstein photo amid president's visit",
    "description": "Police have seized a truck driving a billboard around Windsor Castle, where President Donald Trump is visiting for a state visit. The billboard showed a giant photo of convicted child abuser Jeffrey Epstein standing with Trump. The National, a Scottish newspa…",
    "link": "https://www.rawstory.com/trump-epstein-2674002890/",
    "timestamp": "2025-09-17T14:37:07Z"
  },
  {
    "title": "Marjorie Taylor Greene Reveals Recent Text Messages from Charlie Kirk",
    "description": "The messages were sent on August 27, about two weeks before the conservative activist was assassinated.",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-reveals-recent-messages-charlie-kirk-2131301",
    "timestamp": "2025-09-17T14:36:00Z"
  },
  {
    "title": "Federal Reserve rate cut today: Will the Fed cut rates today? What to know as Powell faces his toughest decision of 2025",
    "description": "Fed rate cuts today: Federal Reserve’s September 17 rate decision is shaping up to be the most consequential of 2025. The probability of this cut is about 96%, with only a small chance of a larger 0.5% cut. With inflation still above target but job market dat…",
    "link": "https://economictimes.indiatimes.com/news/international/us/federal-reserve-rate-cut-today-will-the-fed-cut-rates-today-what-to-know-as-powell-faces-his-toughest-decision-of-2025/articleshow/123948361.cms",
    "timestamp": "2025-09-17T14:35:44Z"
  },
  {
    "title": "IA pode elevar valor do comércio global em quase 40% até 2040, diz OMC",
    "description": "IA pode elevar valor do comércio global em quase 40% até 2040, diz OMC\nThe post IA pode elevar valor do comércio global em quase 40% até 2040, diz OMC appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/economia/ia-pode-elevar-valor-do-comercio-global-em-quase-40-ate-2040-diz-omc/",
    "timestamp": "2025-09-17T14:35:42Z"
  },
  {
    "title": "Stephen Colbert Pokes at Trump’s Lack of Emmys in Extended Acceptance Bit | Video",
    "description": "\"Man, I'm telling you, we should have gotten canceled years ago,\" the CBS host jokes of his first win\nThe post Stephen Colbert Pokes at Trump’s Lack of Emmys in Extended Acceptance Bit | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/stephen-colbert-makes-fun-trump-no-emmy/",
    "timestamp": "2025-09-17T14:35:33Z"
  },
  {
    "title": "Trump finally gets his demand for a US rate cut",
    "description": "Financial markets believe more interest rate cuts are on the way in the US - music to Donald Trump's ears as the US economy shows signs of slowing.",
    "link": "https://news.sky.com/story/trump-finally-gets-his-demand-for-a-us-rate-cut-13432797",
    "timestamp": "2025-09-17T14:35:00Z"
  },
  {
    "title": "Trump Deputies Shrink Asylum Loophole by 65 Percent",
    "description": "President Donald Trump's deputies have shrunk President Joe Biden's huge asylum loophole in the nation's borders by 65 percent, and they are installing new judges and rules to block even more fake asylum claims.\nThe post Trump Deputies Shrink Asylum Loophole …",
    "link": "https://www.breitbart.com/immigration/2025/09/17/trump-deputies-shrink-asylum-loophole-by-66-percent/",
    "timestamp": "2025-09-17T14:33:32Z"
  },
  {
    "title": "Bill Barr, Trump's former top lawyer, quashes Epstein conspiracy theory that he was murdered while in jail [Unlikely]",
    "description": "Bill Barr, Trump's former top lawyer, quashes Epstein conspiracy theory that he was murdered while in jail",
    "link": "https://www.fark.com/comments/13814282/Bill-Barr-Trumps-former-top-lawyer-quashes-Epstein-conspiracy-theory-that-he-was-murdered-while-in-jail",
    "timestamp": "2025-09-17T14:33:30Z"
  },
  {
    "title": "President Trump arrives in UK for state visit",
    "description": "Donald Trump has begun the first full day of his unprecedented second state visit to Britain. Also on the programme, Israel says it will open another route out of Gaza City, after the main road south became clogged with vehicles; and, Pablo Picasso takes to t…",
    "link": "https://www.bbc.co.uk/programmes/w172zss8jw098dq",
    "timestamp": "2025-09-17T14:32:00Z"
  },
  {
    "title": "Trump Dangerously Escalates Efforts to Get Revenge on Letitia James",
    "description": "President Donald Trump is mounting a pressure campaign to indict New York Attorney General Letitia James for mortgage fraud, without providing any evidence to support the charges against her, ABC News reported Wednesday. After five months of digging, investig…",
    "link": "https://newrepublic.com/post/200565/donald-trump-revenge-letitia-james-mortgage-fraud",
    "timestamp": "2025-09-17T14:31:44Z"
  },
  {
    "title": "Zelensky ready to meet Putin without preconditions except one",
    "description": "Ukraine’s Vladimir Zelensky says he is ready to hold talks with Russian President Vladimir Putin but has rejected Moscow as the venue Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624815-zelensky-putin-meeting/",
    "timestamp": "2025-09-17T14:28:30Z"
  },
  {
    "title": "Donald Trump’s three words to Princess Kate upon arrival for state visit",
    "description": "Donald Trump appeared to compliment the Princess of Wales on her appearance as he arrived at Windsor Castle for his state visit on Wednesday (17 September).",
    "link": "https://www.the-independent.com/tv/news/donald-trump-kate-middleton-beautiful-video-b2828394.html",
    "timestamp": "2025-09-17T14:28:04Z"
  },
  {
    "title": "Donald Trump Is Fueling Uranium Fever And This Nuclear Stock Just Capitalized",
    "description": "",
    "link": "https://biztoc.com/x/ffec9ced13480f6f",
    "timestamp": "2025-09-17T14:27:15Z"
  },
  {
    "title": "A king, a carriage and an ancient castle greet Trump at historic U.K. visit",
    "description": "Britain's King Charles III and U.S. President Donald Trump travel in The Irish State Coach during a horse-drawn procession towards Windsor Castle, in Windsor, England, on Sept. 17, 2025.",
    "link": "https://biztoc.com/x/09d28062aa5dc3bf",
    "timestamp": "2025-09-17T14:27:12Z"
  },
  {
    "title": "EU Says India's Russia Links Jeopardise Closer Ties",
    "description": "The European Union's top diplomat warned Wednesday that its push for closer ties with India could be hampered by New Delhi's purchases of Russian oil and involvement in military drills with Moscow.",
    "link": "https://www.ibtimes.com/eu-says-indias-russia-links-jeopardise-closer-ties-3783676",
    "timestamp": "2025-09-17T14:27:11Z"
  },
  {
    "title": "Video: UK Welcomes Trump with Largest Ever Guard of Honor",
    "description": "Britain's Royal Family rolled out a massive precedent-shattering welcome for President Donald Trump and first lady Melania Trump.",
    "link": "https://www.westernjournal.com/video-uk-welcomes-trump-largest-ever-guard-honor/",
    "timestamp": "2025-09-17T14:26:13Z"
  },
  {
    "title": "King Charles III greets Trump in Windsor at start of president’s second state visit to the UK",
    "description": "Prince William and his wife Catherine met Trump's helicopter as it landed in the private Walled Garden on the vast estate, and they walked the American president and first lady Melania Trump over to be greeted by the king and Queen Camilla.",
    "link": "https://www.pbs.org/newshour/politics/king-charles-iii-greets-trump-in-windsor-at-start-of-presidents-second-state-visit-to-the-uk",
    "timestamp": "2025-09-17T14:26:12Z"
  },
  {
    "title": "US justice department removes study finding far-right extremists commit ‘far more’ violence",
    "description": "Report finding rightwing extremists have killed more Americans than other domestic terrorist groups vanished from DoJ website",
    "link": "https://www.yahoo.com/news/articles/us-justice-department-removes-study-142600191.html",
    "timestamp": "2025-09-17T14:26:00Z"
  },
  {
    "title": "‘No tax on tips’ offers financial planning opportunities. But don’t make ‘major moves’ yet, pro says — here's why",
    "description": "President Donald Trump's \"no tax on tips\" deduction offers financial planning opportunities for some workers. But here's what to know first.",
    "link": "https://www.cnbc.com/2025/09/17/no-tax-on-tips-planning-opportunities.html",
    "timestamp": "2025-09-17T14:24:21Z"
  },
  {
    "title": "'I'm disappointed with what I see' says Nvidia CEO Jensen Huang, amid reports that China has banned some of the country's biggest tech companies from buying its AI chips",
    "description": "Fits and starts, now a no-go?",
    "link": "https://www.pcgamer.com/hardware/im-disappointed-with-what-i-see-says-nvidia-ceo-jensen-huang-amid-reports-that-china-has-banned-some-of-the-countrys-biggest-tech-companies-from-buying-its-ai-chips/",
    "timestamp": "2025-09-17T14:23:41Z"
  },
  {
    "title": "Jamie Lee Curtis breaks down in tears over Charlie Kirk’s death despite opposing views",
    "description": "Jamie Lee Curtis broke down in tears over Charlie Kirk's death mid-way through an interview on Marc Maron's \"WTF\" podcast.",
    "link": "https://www.the-independent.com/tv/lifestyle/jamie-lee-curtis-charlie-kirk-abhorrent-b2828384.html",
    "timestamp": "2025-09-17T14:23:09Z"
  },
  {
    "title": "Has Elon Musk really been awarded a $1 trillion pay deal?",
    "description": "And why has the South African entrepreneur been busy buying up shares in Tesla?",
    "link": "https://www.aljazeera.com/news/2025/9/17/has-elon-musk-really-been-awarded-a-1-trillion-pay-deal",
    "timestamp": "2025-09-17T14:22:48Z"
  },
  {
    "title": "Trump’s Memphis Takeover Another Step Down the Road to Authoritarianism",
    "description": "In his crime-fighting initiative in Memphis, Trump goes a step beyond his Washington takeover by pushing a red-state governor to let him take over law enforcement in a blue city, polarizing the crime issue more than ever.",
    "link": "http://nymag.com/intelligencer/article/trumps-memphis-takeover-another-step-down-a-dangerous-road.html",
    "timestamp": "2025-09-17T14:22:14Z"
  },
  {
    "title": "Controller scolds Spirit Airlines pilot to ‘pay attention’ to radio calls as Air Force One flies 8 miles away",
    "description": "A Spirit Airlines pilot was scolded by air traffic control on Tuesday after not immediately responding to a controller’s instructions as Air Force One flew about 8 miles away.",
    "link": "https://www.cnn.com/2025/09/17/us/af1-spirit-airlines",
    "timestamp": "2025-09-17T14:22:00Z"
  },
  {
    "title": "President or king? Supreme Court's Sonia Sotomayor is concerned Americans don't know the difference",
    "description": "Supreme Court Justice Sonia Sotomayor's comments about kings come at a time when President Trump is pushing the boundaries on presidential power.",
    "link": "https://www.usatoday.com/story/news/politics/2025/09/17/sotomayor-trump-king-supreme-court-president/86198043007/",
    "timestamp": "2025-09-17T14:21:53Z"
  },
  {
    "title": "George Takei: Trump Employing ‘Nazi Playbook’ to Exploit Charlie Kirk’s Assassination(barffy)",
    "description": "Actor George Takei accused President Donald Trump and his allies of employing a Nazi playbook to exploit the assassination of conservative icon Charlie Kirk. The Star Trek actor made his claim when sharing a Substack article on BlueSky with the headline, “Is …",
    "link": "https://freerepublic.com/focus/f-news/4341027/posts",
    "timestamp": "2025-09-17T14:21:34Z"
  },
  {
    "title": "Royalist: The Windsors ‘debased’ themselves for Donald Trump’s state visit",
    "description": "Bad news? I think they’ve pumped so many drugs into Donald Trump, he now looks somewhat healthier than King Charles. I would feel bad about saying that, except I remember Charles’s courtiers running around, briefing the press about Joe Biden’s age several yea…",
    "link": "https://www.celebitchy.com/941031/royalist_the_windsors_debased_themselves_for_donald_trumps_state_visit/",
    "timestamp": "2025-09-17T14:20:49Z"
  },
  {
    "title": "Anyone Who Blames 'Both Sides' After Charlie Kirk's Murder Is A Liar And Coward (Peachy Keenan/The Federalist)",
    "description": "Peachy Keenan / The Federalist:\nAnyone Who Blames ‘Both Sides’ After Charlie Kirk's Murder Is A Liar And Coward  —  Unity with people who hate us and want us dead is suicide.  —  “I'd like to see [the nation] heal.  But we're dealing with a radical left group…",
    "link": "https://www.memeorandum.com/250917/p44",
    "timestamp": "2025-09-17T14:20:01Z"
  },
  {
    "title": "This is the last month the government will send paper checks",
    "description": "Beginning Sept. 30, the federal government will switch from paper checks to electronic payments, which could cause headaches for some people",
    "link": "https://qz.com/social-security-irs-paper-checks-ending-september-2025",
    "timestamp": "2025-09-17T14:19:55Z"
  },
  {
    "title": "Criticizing Charlie Kirk’s death is getting people fired - here’s who are affected",
    "description": "Charlie Kirk death firing: Following conservative activist Charlie Kirk's death, a wave of firings and disciplinary actions has impacted various sectors. Educators, airline employees, and media figures faced repercussions for online comments. Secretary of Sta…",
    "link": "https://economictimes.indiatimes.com/news/international/us/criticizing-charlie-kirks-death-is-getting-people-fired-heres-who-are-affected/articleshow/123947485.cms",
    "timestamp": "2025-09-17T14:19:37Z"
  },
  {
    "title": "Fired CDC chief to testify Kennedy pressed her to endorse vaccine recommendations without evidence",
    "description": "Ex-CDC director Susan Monarez told senators Health Secretary RFK Jr. fired her for refusing to endorse vaccine recommendations without reviewing scientific evidence.",
    "link": "https://www.twincities.com/2025/09/17/fired-cdc-director-congress-hearing/",
    "timestamp": "2025-09-17T14:19:27Z"
  },
  {
    "title": "Canada names descendant of Ukrainian Nazi collaborator as Ukraine envoy",
    "description": "Chrystia Freeland’s grandfather served as an editor of a Nazi propaganda newspaper during World War II Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624821-canada-descendant-nazi-ukraine-envoy/",
    "timestamp": "2025-09-17T14:17:54Z"
  },
  {
    "title": "Gun seller takes stand in Trump assassination attempt trial with key testimony about rifle purchase",
    "description": "Federal prosecutors call new witnesses, including the alleged rifle seller, in Ryan Routh's assassination attempt trial against President Donald Trump in Florida.",
    "link": "https://www.foxnews.com/politics/gun-seller-takes-stand-trump-assassination-attempt-trial-key-testimony-about-rifle-purchase",
    "timestamp": "2025-09-17T14:17:27Z"
  },
  {
    "title": "Changes In Bond Yields After Trump Targeted Lisa Cook Suggest Inflation Would Be Lower If He Took Over The Fed",
    "description": "Changes In Bond Yields After Trump Targeted Lisa Cook Suggest Inflation Would Be Lower If He Took Over The Fed\nIs it possible that inflation would actually be lower if President Donald Trump took over the Federal Reserve? While some critics believe a potentia…",
    "link": "https://biztoc.com/x/5bdae649a24a8b49",
    "timestamp": "2025-09-17T14:16:48Z"
  },
  {
    "title": "Maggie Haberman Teases Epstein Questions Trump Hopes to Avoid at Global Presser: ‘We Will See’",
    "description": "Maggie Haberman told CNN anchor Jake Tapper that Trump hopes to avoid questions about Jeffrey Epstein, but added \"We will see\" if that works out for him.\nThe post Maggie Haberman Teases Epstein Questions Trump Hopes to Avoid at Global Presser: ‘We Will See’ f…",
    "link": "https://www.mediaite.com/media/tv/maggie-haberman-teases-epstein-questions-trump-hopes-to-avoid-at-global-presser-we-will-see/",
    "timestamp": "2025-09-17T14:16:37Z"
  },
  {
    "title": "‘We Disenfranchised Ourselves’: Stephen A. Smith Laments Black Voters’ Blind Loyalty To Dems",
    "description": "Stephen A. Smith bemoaned black voters' unconditional loyalty to the Democratic Party arguing it disempowers them.",
    "link": "https://dailycaller.com/2025/09/17/we-disenfranchised-ourselves-stephen-a-smith-laments-black-voters-blind-loyalty-to-dems/",
    "timestamp": "2025-09-17T14:15:04Z"
  },
  {
    "title": "Bipartisan Senate group releases new bill to help increase affordable child care",
    "description": "Alleviating the rising cost of child care for millions of American families is an area Republicans and Democrats in Washington believe they can find common ground.",
    "link": "https://www.nbcnews.com/politics/congress/bipartisan-child-care-funding-bill-released-senate-rcna228860",
    "timestamp": "2025-09-17T14:15:00Z"
  },
  {
    "title": "We Brits are finally getting a slice of Nvidia pie as up to 60,000 Blackwell GPUs will be heading to the UK as part of $42 billion deal with the US",
    "description": "Any chips going spare?",
    "link": "https://www.pcgamer.com/hardware/graphics-cards/we-brits-are-finally-getting-a-slice-of-nvidia-pie-as-up-to-60-000-blackwell-gpus-will-be-heading-to-the-uk-in-a-new-deal-with-the-us/",
    "timestamp": "2025-09-17T14:14:11Z"
  },
  {
    "title": "King Charles greets Trump with royal pageantry in UK’s Windsor Castle",
    "description": "US President Trump receives a royal welcome at the UK's Windsor Castle, with a dazzling display of military bands.",
    "link": "https://www.aljazeera.com/gallery/2025/9/17/king-charles-greets-trump-with-royal-pageantry-in-uks-windsor-castle",
    "timestamp": "2025-09-17T14:10:29Z"
  },
  {
    "title": "Fired CDC chief will testify Kennedy pressed her to endorse vaccine recommendations without evidence",
    "description": "Former CDC director Susan Monarez will accuse Robert F. Kennedy Jr. of pressuring her to endorse vaccine recommendations without scientific evidence.",
    "link": "https://www.bostonherald.com/2025/09/17/fired-cdc-director-congress-hearing/",
    "timestamp": "2025-09-17T14:09:53Z"
  }
]