[
  {
    "title": "The Price of Politicizing Public Health",
    "description": "Collateral damage, broken trust, children in the crossfire of power, and a parent’s view of a public health collapse",
    "link": "https://marygeddry.com/p/the-price-of-politicizing-public",
    "timestamp": "2026-01-06T17:42:32Z"
  },
  {
    "title": "Delcy Rodríguez: Maduro’s second in command now running Venezuela",
    "description": "Rodríguez has held positions of power throughout the country",
    "link": "https://theweek.com/world-news/delcy-rodriguez-maduro-venezuela-trump",
    "timestamp": "2026-01-06T17:42:20Z"
  },
  {
    "title": "Trump jokes Melania is not a fan of his signature dance, says it’s ‘not presidential’",
    "description": "President Trump revealed to a gathering of House Republicans that his wife Melania hates his signature shimmy, deriding it as \"not presidential.\"",
    "link": "https://nypost.com/2026/01/06/us-news/trump-reveals-why-his-wife-melania-hates-his-signature-dance/",
    "timestamp": "2026-01-06T17:40:10Z"
  },
  {
    "title": "Ontario local union head says national leadership not stepping up for auto workers",
    "description": "As Oshawa’s GM plant faces layoffs at the end of the month, Unifor Local 222’s president says the national union and the Carney government need to do more for auto workers in the face of tariffs.",
    "link": "https://www.cbc.ca/news/canada/toronto/auto-workers-local-union-president-criticizes-national-leadership-9.7034733",
    "timestamp": "2026-01-06T17:39:24Z"
  },
  {
    "title": "Sebastian Stan in Talks to Join ‘The Batman: Part II’",
    "description": "He'd mark the second Marvel actor to sign on for the DC project\nThe post Sebastian Stan in Talks to Join ‘The Batman: Part II’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/movies/sebastian-stan-the-batman-2-cast/",
    "timestamp": "2026-01-06T17:39:20Z"
  },
  {
    "title": "'The Batman Part II' Eyes Sebastian Stan",
    "description": "He would join Robert Pattinson and Scarlett Johansson in the feature.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/the-batman-part-ii-eyes-sebastian-stan-1236465730/",
    "timestamp": "2026-01-06T17:39:16Z"
  },
  {
    "title": "WATCH: 'MAGA Granny' Pamela Hemphill makes emotional apology to Jan. 6 officers",
    "description": "\"I am truly sorry from the bottom of my heart for being part of the mob that put you and so many officers in danger,\" Hemphill said in her testimony.",
    "link": "https://www.pbs.org/newshour/politics/watch-maga-granny-pamela-hemphill-makes-emotional-apology-to-jan-6-officers",
    "timestamp": "2026-01-06T17:36:36Z"
  },
  {
    "title": "HISTORIC SHIFT: Republicans have overtaken Democrats in North Carolina voter registration for the first time in state history",
    "description": "HISTORIC SHIFT: Republicans have overtaken Democrats in North Carolina voter registration for the first time in state history, signaling a major political turning point in the closely watched battleground state. New data shows roughly 2.315 million registered…",
    "link": "https://freerepublic.com/focus/f-news/4360701/posts",
    "timestamp": "2026-01-06T17:35:21Z"
  },
  {
    "title": "Slog AM: Maduro Pleads Not Guilty, ICE Swarms Twin Cities, WSF Low on Ferries",
    "description": "The Stranger's Morning News Roundup\n \n by Vivian McCall\n \n \n \n It’s January 6th: Four years ago today, a far-right mob of Trump zealots and anti-Democracy extremists stormed the Capitol in Washington DC to keep Trump in power and stop Congress from certifying…",
    "link": "https://www.thestranger.com/slog-am/2026/01/06/80406469/slog-am-maduro-pleads-not-guilty-ice-swarms-twin-cities-wsf-low-on-ferries",
    "timestamp": "2026-01-06T17:33:00Z"
  },
  {
    "title": "Trump says first lady 'hates when I do this' in public — the moment he can't help repeating (Fox News)",
    "description": "Fox News:\nTrump says first lady ‘hates when I do this’ in public — the moment he can't help repeating  —  ‘Could you imagine FDR dancing,’ Melania Trump asked President Trump  —  President Donald Trump said Tuesday in an address before Republican lawmakers th…",
    "link": "https://www.memeorandum.com/260106/p74",
    "timestamp": "2026-01-06T17:30:01Z"
  },
  {
    "title": "Security forces clash with protesters in Iran’s main market as at least 36 killed in demonstrations",
    "description": "The protests Tuesday come as Iran's rial currency fell to a record low.",
    "link": "https://www.bostonherald.com/2026/01/06/iran-protests/",
    "timestamp": "2026-01-06T17:29:45Z"
  },
  {
    "title": "Trump team puts a target on Cuba, with threats and oil blockade",
    "description": "President Donald Trump and Secretary of State Marco Rubio have made clear that the collapse of Cuba’s communist government is not only a likely side benefit of Maduro’s ouster but a goal.No place was hit harder than Cuba by the shock waves that Saturday morni…",
    "link": "https://freerepublic.com/focus/f-news/4360700/posts",
    "timestamp": "2026-01-06T17:29:37Z"
  },
  {
    "title": "Trump Remembers Late Congressman Doug LaMalfa: 'A Fantastic Person'",
    "description": "WASHINGTON — President Donald Trump remembered the late Rep. Doug LaMalfa (R-CA) on Tuesday at the House Republican retreat at the Kennedy Center after news of the California congressman's death broke.\nThe post Trump Remembers Late Congressman Doug LaMalfa: ‘…",
    "link": "https://www.breitbart.com/politics/2026/01/06/trump-remembers-late-congressman-doug-lamalfa-a-fantastic-person/",
    "timestamp": "2026-01-06T17:29:17Z"
  },
  {
    "title": "'MAGA Granny' Who Rejected Trump's Pardon Blasts Him On Jan. 6",
    "description": "At a hearing marking five years since the attempted coup, Pam Hemphill owned her guilt while praising Capitol Police for protecting her that day.",
    "link": "https://www.huffpost.com/entry/maga-granny-blasts-trump-capitol-jan-6_n_695d3245e4b0b0e75cf08ea9",
    "timestamp": "2026-01-06T17:29:06Z"
  },
  {
    "title": "Sen. Mark Kelly Taunts Trump on MSNOW After Censure News: ‘I Hurt His Ego’",
    "description": "Kelly taunted Trump after Hegseth announced he will seek censure over Kelly's reminder not to obey unlawful orders, saying he had hurt Trump's \"ego.\"\nThe post Sen. Mark Kelly Taunts Trump on MSNOW After Censure News: ‘I Hurt His Ego’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/tv/sen-mark-kelly-taunts-trump-on-msnow-after-censure-news-i-hurt-his-ego/",
    "timestamp": "2026-01-06T17:28:54Z"
  },
  {
    "title": "‘The Batman Part II’: Sebastian Stan In Talks For Role Opposite Robert Pattinson In Sequel – The Dish",
    "description": "EXCLUSIVE: After landing Scarlett Johansson for a new role in The Batman Part II, director Matt Reeves looks to have snagged one of her Avengers co-stars for another new role in the upcoming sequel. Sources tell Deadline Sebastian Stan is in talks to join the…",
    "link": "http://deadline.com/2026/01/the-batman-part-ii-sebastian-stan-1236665032/",
    "timestamp": "2026-01-06T17:28:00Z"
  },
  {
    "title": "European leaders rally behind Greenland amid threats of a Trump take-over",
    "description": "The US president and his officials are continuing to push for an American take over of the Danish territory, saying the island is needed for national security.",
    "link": "https://www.abc.net.au/news/2026-01-07/european-leaders-back-greenland-after-trump-threats/106205394",
    "timestamp": "2026-01-06T17:27:37Z"
  },
  {
    "title": "Chevron Lines Up 11 Oil Ships as Venezuela’s Dark Fleet Vanishes",
    "description": "A small armada of ships booked by Chevron Corp is sailing to Venezuela as the company emerges as the only exporter of the country’s oil following the ouster of President Nicolas Maduro by US forces.",
    "link": "https://financialpost.com/pmn/business-pmn/chevron-lines-up-11-oil-ships-as-venezuelas-dark-fleet-vanishes",
    "timestamp": "2026-01-06T17:26:42Z"
  },
  {
    "title": "UK and France would send troops to Ukraine in event of peace deal, Starmer says after Paris talks",
    "description": "Downing Street says it has agreed a \"declaration of intent to deploy forces to Ukraine in event of a peace deal\"; President Zelensky calls it a \"huge step forward\".",
    "link": "https://www.bbc.co.uk/news/live/c14rn8m00j4t",
    "timestamp": "2026-01-06T17:26:37Z"
  },
  {
    "title": "Transcript: Why Trump Overthrowing Venezuela’s Government Was Crazy",
    "description": "This is a lightly edited transcript of the January 3 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: This is Perry Bacon from The New Republic, and I’m joined by Elizabeth Saund…",
    "link": "https://newrepublic.com/article/204926/transcript-trump-overthrowing-venezuela-government-crazy",
    "timestamp": "2026-01-06T17:26:22Z"
  },
  {
    "title": "Jimmy Kimmel Takes Cognitive Test That Trump Claims He 'Aced'",
    "description": "Late-night host Jimmy Kimmel reviewed Donald Trump's last two weeks, in which he spoke of Melania's underpants, hosted the lowest-rated Kennedy Center Honors telecast ever, and posted on Truth Social a whopping 556 times.\n Kimmel said, \"Over the last two week…",
    "link": "https://crooksandliars.com/2026/01/jimmy-kimmel-takes-cognitive-test-trump",
    "timestamp": "2026-01-06T17:26:12Z"
  },
  {
    "title": "‘Crooked as Hell!’ Trump Goes on Rigged Election Rant on January 6 Anniversary",
    "description": "Trump made the remarks on the 5th anniversary of the January 6 Capitol riot, which was fueled by his claims of voter fraud as rioters tried to stop the certification.\nThe post ‘Crooked as Hell!’ Trump Goes on Rigged Election Rant on January 6 Anniversary firs…",
    "link": "https://www.mediaite.com/media/news/crooked-as-hell-trump-goes-on-rigged-election-rant-on-january-6-anniversary/",
    "timestamp": "2026-01-06T17:25:46Z"
  },
  {
    "title": "Trump, 79, Complains He Was Reported Dead in Bonkers Rant",
    "description": "Trump, 79, Complains He Was Reported Dead in Bonkers Rantthedailybeast.com",
    "link": "https://www.thedailybeast.com/trump-79-complains-he-was-reported-dead-in-bonkers-rant/",
    "timestamp": "2026-01-06T17:24:25Z"
  },
  {
    "title": "‘Nobody can take us’ – Donald Trump boasts of US military capabilities after Venezuela strikes",
    "description": "US President Donald Trump said \"nobody can take us” after the January 3 strikes in Venezuela, in which it captured Venezuelan leader Nicolas Maduro.",
    "link": "https://www.independent.ie/world-news/north-america/nobody-can-take-us-donald-trump-boasts-of-us-military-capabilities-after-venezuela-strikes/a1055754032.html",
    "timestamp": "2026-01-06T17:24:01Z"
  },
  {
    "title": "Public broadcasting agency CPB dissolves after loss of federal funding",
    "description": "Public broadcasting agency CPB dissolves after loss of federal fundingstatesman.com",
    "link": "https://www.statesman.com/business/article/public-broadcasting-agency-cpb-dissolves-loss-21279508.php",
    "timestamp": "2026-01-06T17:23:56Z"
  },
  {
    "title": "Alyssa Farah Griffin Fires Back At Sunny Hostin’s Claims On ‘The View’ That Trump Broke International Law By Capturing Maduro: “We’ve Done This For 30 Years”",
    "description": "\"The way he was removed from that country matters.\"",
    "link": "https://decider.com/2026/01/06/alyssa-farah-griffin-fires-back-sunny-hostin-trump-broke-international-law-maduro/",
    "timestamp": "2026-01-06T17:23:00Z"
  },
  {
    "title": "January 6 was a day of horror in DC — but we must remember where it came from",
    "description": "Five years ago today we were transfixed by the surreal spectacle of the attack on the U.S. Capitol. The violence and horror of that day was made more bearable when the insurrectionists were arrested and the election results they tried to overturn were certifi…",
    "link": "https://www.rawstory.com/january-6-2674851821/",
    "timestamp": "2026-01-06T17:22:50Z"
  },
  {
    "title": "Corporation for Public Broadcasting shutters months after Trump, Congress yanked its funding",
    "description": "John Kennedy: 'Funneled your money to NPR and PBS to call birds, roads, and country music racist – is officially DISSOLVED. Good riddance'",
    "link": "https://www.wnd.com/2026/01/corporation-public-broadcasting-shutters-months-after-trump-congress/",
    "timestamp": "2026-01-06T17:21:10Z"
  },
  {
    "title": "White House torches Democrats’ Jan 6 ‘gaslighting’ claims in anniversary takedown",
    "description": "Trump administration publishes Jan. 6 timeline alleging security lapses by former Speaker Nancy Pelosi and criticizing Democratic investigations of 2021 Capitol breach as politicized.",
    "link": "https://www.foxnews.com/politics/white-house-torches-democrats-jan-6-gaslighting-claims-anniversary-takedown",
    "timestamp": "2026-01-06T17:20:40Z"
  },
  {
    "title": "GOP Rep. Jim Baird and wife hospitalized after car accident—here's what happened and why does this matter for House Republicans",
    "description": "Indiana Republican Congressman Jim Baird and his wife are recovering after a serious car accident, President Trump announced. While details remain scarce, Trump expressed confidence in their recovery. This incident, alongside the recent passing of another Rep…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gop-rep-jim-baird-and-wife-hospitalized-after-car-accidentheres-what-happened-and-why-does-this-matter-for-house-republicans/articleshow/126378431.cms",
    "timestamp": "2026-01-06T17:20:39Z"
  },
  {
    "title": "‘The View’: Alyssa Farah Griffin Says GOP Has ‘Privilege of Not Caring’ About Jan. 6 Because of Mike Pence | Video",
    "description": "\"This would be a very different conversation if he'd not certified the election,\" the ABC host says\nThe post ‘The View’: Alyssa Farah Griffin Says GOP Has ‘Privilege of Not Caring’ About Jan. 6 Because of Mike Pence | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/the-view-january-6-anniversary-gop-privilege-mike-pence/",
    "timestamp": "2026-01-06T17:19:17Z"
  },
  {
    "title": "Texan oil pipeline billionaire behind €30m investment in Waterford airport",
    "description": "The investor is a long-time funder of US Republican Party candidates including Donald Trump, and also owns Castletown Cox in Co Kilkenny",
    "link": "https://www.irishtimes.com/business/2026/01/06/texan-oil-pipeline-billionaire-behind-30m-investment-in-waterford-airport/",
    "timestamp": "2026-01-06T17:19:07Z"
  },
  {
    "title": "Democratic governor caught ‘red-handed’ – Trump",
    "description": "US President Trump has called Minnesota governor Tim Walz “corrupt” after he was forced to drop his reelection bid amid a fraud scandal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630672-trump-corrupt-minnesota-governor-walz-fraud-scheme/",
    "timestamp": "2026-01-06T17:18:50Z"
  },
  {
    "title": "Why a top investment strategist says don't give up on the classic 60/40 portfolio in 2026",
    "description": "A foundation of portfolio construction has wobbled in recent years, but a top strategist at BlackRock urges investors not to give up on the 60/40 mix.",
    "link": "https://www.businessinsider.com/investing-strategy-60-40-portfolio-stocks-bonds-yields-hedge-blackrock-2026-1",
    "timestamp": "2026-01-06T17:18:20Z"
  },
  {
    "title": "Canada's Indigenous governor general to visit Greenland as Trump renews talk of annexing it",
    "description": "Prime Minister Mark Carney says his foreign minister and the governor general will visit Greenland in early February in the wake of renewed threats by U.S. President Donald Trump to annex the Danish territory",
    "link": "https://abcnews.go.com/International/wireStory/canadas-indigenous-governor-general-visit-greenland-trump-renews-128950737",
    "timestamp": "2026-01-06T17:17:54Z"
  },
  {
    "title": "Indiana US Rep. Jim Baird expected to make a full recovery following car accident, his office says",
    "description": "Republican U.S. Rep. Jim Baird of Indiana is recovering from a car crash and expected to make a full recovery, A statement from Baird's office says he is recovering, but details of the crash are not immediately clear",
    "link": "https://abcnews.go.com/US/wireStory/indiana-us-rep-jim-baird-expected-make-full-128949499",
    "timestamp": "2026-01-06T17:17:45Z"
  },
  {
    "title": "The Dramatic Arraignment of Nicolás Maduro",
    "description": "By forcibly bringing the ousted President and his wife into jurisdiction of U.S. federal courts, Trump will now have to accept that at least two Venezuelans deserve the basic right to due process.",
    "link": "https://www.newyorker.com/news/the-lede/the-dramatic-arraignment-of-nicolas-maduro",
    "timestamp": "2026-01-06T17:17:40Z"
  },
  {
    "title": "'Have you had plastic surgery?' Trump puts Jim Jordan on the spot for looking 'rough'",
    "description": "President Donald Trump mocked Rep. Jim Jordan (R-OH) by suggesting he had plastic surgery on his ears.At a House GOP retreat on Tuesday, Trump noted that Jordan was a former wrestler.\"The first time I met Jim, I looked at him, I said, it's a tough-looking guy…",
    "link": "https://www.rawstory.com/trump-jordan-ears/",
    "timestamp": "2026-01-06T17:17:34Z"
  },
  {
    "title": "The ‘Donroe doctrine’: Maduro is the guinea pig for Donald Trump’s new world order",
    "description": "The capture of Nicolas Maduro marks a return to gunboat diplomacy, or as the US president says: the ‘Donroe doctrine’.",
    "link": "https://theconversation.com/the-donroe-doctrine-maduro-is-the-guinea-pig-for-donald-trumps-new-world-order-272687",
    "timestamp": "2026-01-06T17:17:08Z"
  },
  {
    "title": "Florida’s Surgeon General Is Now Peddling Fake Water",
    "description": "In a recent social media post, Joseph Ladapo endorsed the use of structured water, which doesn't actually seem to exist.",
    "link": "https://gizmodo.com/floridas-surgeon-general-is-now-peddling-fake-water-2000705629",
    "timestamp": "2026-01-06T17:15:54Z"
  },
  {
    "title": "January 6: Where Are They Now?",
    "description": "A moment of silence for the 174 injured Capitol police officers, and democracy.",
    "link": "https://www.wonkette.com/p/january-6-where-are-they-now",
    "timestamp": "2026-01-06T17:15:29Z"
  },
  {
    "title": "Europe issues statement on Trump’s Greenland claim",
    "description": "European leaders have called on the US to respect Denmark’s borders after Trump restated interest in taking over Greenland Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630673-europe-statement-trump-greenland/",
    "timestamp": "2026-01-06T17:14:58Z"
  },
  {
    "title": "Oil Executives Don’t Even Want to Touch Trump’s Mess in Venezuela",
    "description": "And they’re the greediest bastards into whom God breathed life.",
    "link": "https://www.esquire.com/news-politics/politics/a69926186/oil-companies-trump-venezuela/",
    "timestamp": "2026-01-06T17:13:00Z"
  },
  {
    "title": "Nvidia CEO says purchase orders, not formal declaration, will signal Chinese approval of H200",
    "description": "Nvidia CEO Jensen Huang said on Tuesday he does not believe China's government will make a formal declaration that it has allowed Chinese firms to import the...",
    "link": "https://finance.yahoo.com/news/us-government-working-feverishly-nvidia-171247058.html",
    "timestamp": "2026-01-06T17:12:47Z"
  },
  {
    "title": "Newsom accuses Trump of spreading 'hurricane force bulls---' during deadly California wildfires",
    "description": "California governor Gavin Newsom blasted President Donald Trump and Elon Musk for spreading misinformation during the state's 2025 wildfires, calling their claims \"weaponized lies.\"",
    "link": "https://www.foxnews.com/media/newsom-accuses-trump-spreading-hurricane-force-bulls-during-deadly-california-wildfires",
    "timestamp": "2026-01-06T17:12:24Z"
  },
  {
    "title": "European leaders push back on Trump's comments about U.S. taking over Greenland",
    "description": "The leaders of France, Germany, Italy, Poland, Spain and the United Kingdom joined Danish Prime Minister Mette Frederiksen in defending Greenland's sovereignty.",
    "link": "https://www.pbs.org/newshour/world/european-leaders-push-back-on-trumps-comments-about-u-s-taking-over-greenland",
    "timestamp": "2026-01-06T17:12:19Z"
  },
  {
    "title": "Nobel Peace Prize Winner Implies She'd Be Willing to Give Trump the Award amid Reports He's Snubbing Her for Leadership Role",
    "description": "The winner of the 2025 Nobel Peace Prize is seemingly considering giving up the award and handing it to President Donald Trump. While the 79-year-old Republican has long campaigned to receive the historic prize, in 2025 it was awarded to Venezuelan opposition…",
    "link": "https://www.justjared.com/2026/01/06/nobel-peace-prize-winner-implies-shed-be-willing-to-give-trump-the-award-amid-reports-hes-snubbing-her-for-leadership-role/",
    "timestamp": "2026-01-06T17:11:33Z"
  },
  {
    "title": "Pete Hegseth Targets Retired Astronaut’s Pension for ‘Illegal Orders’ Video",
    "description": "The 90-second video urging U.S. military personnel to refuse to follow illegal orders was deemed \"punishable by DEATH!\"",
    "link": "https://gizmodo.com/pete-hegseth-targets-retired-astronauts-pension-for-illegal-orders-video-2000706202",
    "timestamp": "2026-01-06T17:10:52Z"
  },
  {
    "title": "Bangladeshi traders form human chain to seek justice for slain Hindu businessman",
    "description": "South Asia News: DHAKA/NEW DELHI: Business owners in Bangladesh's Narsingdi district on Tuesday formed a human chain demanding justice for the murder of a Hindu trader.",
    "link": "https://timesofindia.indiatimes.com/world/south-asia/bangladeshi-traders-form-human-chain-to-seek-justice-for-slain-hindu-businessman/articleshow/126378879.cms",
    "timestamp": "2026-01-06T17:10:36Z"
  },
  {
    "title": "Who is Trey Yesavage’s fiancée? Taylor Frick shares sunny beach photo as Toronto Blue Jays pitcher enjoys tropical break",
    "description": "Toronto Blue Jays pitcher Trey Yesavage appeared in a new beach photo shared by fiancée Taylor Frick on Sunday. The post showed him relaxing before his first full MLB season. The couple, engaged since November, has spent the offseason traveling and sharing we…",
    "link": "https://timesofindia.indiatimes.com/sports/mlb/news/who-is-trey-yesavages-fiance-taylor-frick-shares-sunny-beach-photo-as-toronto-blue-jays-pitcher-enjoys-tropical-break/articleshow/126378893.cms",
    "timestamp": "2026-01-06T17:08:30Z"
  },
  {
    "title": "Many Colorado Trans Youth Stranded After Denver Health, CHCO Withdraw Care",
    "description": "For the second time in as many years, many young trans Coloradans have suddenly lost access to life-saving care.",
    "link": "https://www.erininthemorning.com/p/many-colorado-trans-youth-stranded",
    "timestamp": "2026-01-06T17:07:40Z"
  },
  {
    "title": "Trump Says Quiet Part Out Loud About Wanting to Win Midterm Elections",
    "description": "Forget a conservative majority—Donald Trump personally needs Republicans to win big in the coming midterms.The president tossed aside the significance of his allies’ local elections while speaking at the GOP retreat Tuesday, telling lawmakers that he needs th…",
    "link": "https://newrepublic.com/post/204980/donald-trump-midterm-elections-gerrymandering-impeachment",
    "timestamp": "2026-01-06T17:07:25Z"
  },
  {
    "title": "After Maduro capture, Trump’s tough talk evokes a return to the days of American imperialism",
    "description": "It's the kind of talk not heard since the late 19th and early 20th centuries.",
    "link": "https://www.bostonherald.com/2026/01/06/trump-american-imperialism/",
    "timestamp": "2026-01-06T17:06:30Z"
  },
  {
    "title": "A U.S. takeover of Greenland would mark the end of NATO, Danish prime minister says",
    "description": "Danish Prime Minister Mette Frederiksen said Monday an American takeover of Greenland would amount to the end of the NATO military alliance.",
    "link": "https://www.pbs.org/newshour/world/a-u-s-takeover-of-greenland-would-mark-the-end-of-nato-danish-prime-minister-says",
    "timestamp": "2026-01-06T17:06:28Z"
  },
  {
    "title": "Trump says the US ‘needs’ Greenland for Arctic security. Here’s why",
    "description": "Greenland is a self-governing territory of Denmark.",
    "link": "https://www.denverpost.com/2026/01/06/why-trump-wants-greenland/",
    "timestamp": "2026-01-06T17:05:39Z"
  },
  {
    "title": "Trump says the US ‘needs’ Greenland for Arctic security. Here’s why",
    "description": "Greenland is a self-governing territory of Denmark.",
    "link": "https://www.bostonherald.com/2026/01/06/why-trump-wants-greenland/",
    "timestamp": "2026-01-06T17:05:39Z"
  },
  {
    "title": "Akshita Mudgal on Lakshmi Niwas: Playing someone so simple and grounded feels special",
    "description": "Television actress Akshita Mudgal is set to portray Radhika in the upcoming daily soap, Lakshmi Niwas. The show centers on the relatable lives of middle-class Indian joint families, highlighting dreams, responsibilities, and bonding. Mudgal describes Radhika …",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/akshita-mudgal-on-lakshmi-niwas-playing-someone-so-simple-and-grounded-feels-special/articleshow/126378716.cms",
    "timestamp": "2026-01-06T17:05:36Z"
  },
  {
    "title": "US Congressman Doug LaMalfa dies unexpectedly at 65",
    "description": "The death of LaMalfa, a Trump ally, shaves the Republican majority in the US House of Representatives to just a few seats.",
    "link": "https://www.bbc.com/news/articles/cgl8y4gx9lyo",
    "timestamp": "2026-01-06T17:05:21Z"
  },
  {
    "title": "Justin Gaethje slams staph infection speculation views UFC 324 final shot at UFC gold",
    "description": "MMA social media is full of speculations, but to Justin Gaethje, this is all untrue. Justin Gaethje quickly justified himself on social media, claiming that still images of his neck and lip are not even near what they've been made out to be, providing a diffe…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/justin-gaethje-slams-staph-infection-speculation-views-ufc-324-final-shot-at-ufc-gold/articleshow/126378751.cms",
    "timestamp": "2026-01-06T17:04:43Z"
  },
  {
    "title": "Venezuelan Nobel Prize Winner Would ‘Love’ To Give Trump Her Award Despite Him Not Supporting Her",
    "description": "“So if I believe he deserved it on October, imagine now,” María Corina Machado said on Fox News.",
    "link": "https://www.huffpost.com/entry/maria-corina-machado-nobel-trump_n_695d23ede4b0b1914ed19739",
    "timestamp": "2026-01-06T17:04:25Z"
  },
  {
    "title": "FBI improperly surveilled Catholic schoolteacher for 2 years, Senate report details",
    "description": "Oops! FBI failed to substantiate unverified tip before putting woman on federal watchlist",
    "link": "https://www.wnd.com/2026/01/fbi-improperly-surveilled-catholic-schoolteacher-2-years-senate/",
    "timestamp": "2026-01-06T17:04:10Z"
  },
  {
    "title": "Iranian security forces clash with protesters at Tehran’s grand bazaar",
    "description": "Nationwide protests continue to grow as rights groups accuse authorities of cracking down on demonstrators",
    "link": "https://uk.news.yahoo.com/iranian-security-forces-clash-protesters-170404006.html",
    "timestamp": "2026-01-06T17:04:04Z"
  },
  {
    "title": "'Obsession for White skin': Video of Indian men looking at Azerbaijani women reveals the racist side of internet",
    "description": "A viral video on X shows Azerbaijani women posing at Mumbai's Taj hotels while Indian men observe. The post's caption ignited a firestorm of racist remarks online. Many comments expressed prejudiced views about India and its people. However, some users pointe…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/obsession-for-white-skin-video-of-indian-men-looking-at-azerbaijani-women-reveals-the-racist-side-of-internet/articleshow/126378380.cms",
    "timestamp": "2026-01-06T17:03:14Z"
  },
  {
    "title": "Michigan Organizer Speaks After Being Arrested Live on Camera for Protesting Trump Venezuela Attack",
    "description": "A 22-year-old woman who was detained for several hours by police in Grand Rapids, Michigan on Saturday after speaking out against President Donald Trump's invasion of Venezuela had allegedly \"obstructed a roadway\" and failed to obey officers—but she described…",
    "link": "https://www.commondreams.org/news/protests-michigan",
    "timestamp": "2026-01-06T17:02:39Z"
  },
  {
    "title": "'I'll get impeached!' Trump freaks out about losing midterms in speech to Republicans",
    "description": "President Donald Trump publicly predicted that he would be impeached if Republicans lost the House in the 2026 midterm elections.During a House GOP retreat on Tuesday, Trump begged Republicans not to lose the midterms.\"But you got to win the midterms, because…",
    "link": "https://www.rawstory.com/trump-midterms-impeached/",
    "timestamp": "2026-01-06T17:02:05Z"
  },
  {
    "title": "Trump suggests US taxpayers could reimburse oil firms for Venezuela investment",
    "description": "Donald Trump has suggested US taxpayers could reimburse energy companies for repairing Venezuelan infrastructure for extracting and shipping oil.\nTrump acknowledged that “a lot of money” would need to be spent to increase oil production in Venezuela after US …",
    "link": "https://biztoc.com/x/9166dcdf68cb0843",
    "timestamp": "2026-01-06T17:01:59Z"
  },
  {
    "title": "Trump Warns He’ll Be Impeached If Republicans Don’t Win Midterms",
    "description": "President Donald Trump implored Republicans to turn around their political fortunes ahead of November’s midterm elections, warning that if Democrats retake control of Congress he would be impeached for a third time.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-warns-hell-be-impeached-if-republicans-dont-win-midterms",
    "timestamp": "2026-01-06T17:01:16Z"
  },
  {
    "title": "House GOP bill could trigger self-deportation for Somali refugees amid Minnesota fraud probe",
    "description": "Texas Republican introduces congressional bill to terminate refugee status for five countries amid alleged Minnesota social services fraud investigations.",
    "link": "https://www.foxnews.com/politics/house-gop-bill-could-trigger-self-deportation-somali-refugees-amid-minnesota-fraud-probe",
    "timestamp": "2026-01-06T17:00:34Z"
  },
  {
    "title": "Iranian Regime Cracking Down Hard on Emboldened Protesters",
    "description": "The Iranian regime is brutally cracking down on protesters despite warnings from President Trump but the people will not be deterred.  Only hours before the capture and arrest of Venezuelan terrorist leader Maduro, President Trump shared a message to the lead…",
    "link": "https://joehoft.com/iranian-regime-cracking-down-hard-on-emboldened-protesters/",
    "timestamp": "2026-01-06T17:00:26Z"
  },
  {
    "title": "“People died”: Rich vacationers are “trapped” in St. Barths after Venezuelan airspace shuts down and the internet is unmoved",
    "description": "Rich vacationers on a Caribbean island complained on TikTok that they were “stranded” by the U.S. invasion of Venezuela this weekend. The Trump administration’s incursion into Caracas to abduct President Nicolás Maduro and his wife closed airspace over the ne…",
    "link": "https://www.dailydot.com/culture/trapped-st-barths-venezuela-air-space/",
    "timestamp": "2026-01-06T17:00:00Z"
  },
  {
    "title": "January 6: The Worst Day in U.S. History",
    "description": "Like many of you, I sat glued to the television on January 6, 2021, and watched the terrible events unfold. I had seen Trump’s tweet a few weeks earlier, urging his followers to show up on January 6 and promising that it would be “wild.” They did show up. Tho…",
    "link": "https://dianeravitch.net/2026/01/06/january-6-the-worst-day-in-u-s-history/",
    "timestamp": "2026-01-06T17:00:00Z"
  },
  {
    "title": "Trump panic over Republican's shock death spurred last-minute speech to House GOP: expert",
    "description": "President Donald Trump responded to the dwindling lead of GOP congressional leaders in his address to the Republican Party on Tuesday in Washington, D.C. Jeff Zeleny, CNN'S chief national affairs correspondent, told anchors Wolf Blitzer and Pamela Brown that …",
    "link": "https://www.rawstory.com/hanging-in-the-balance-trump-trying-to-keep-gop-majority-after-lawmaker-s/",
    "timestamp": "2026-01-06T16:56:14Z"
  },
  {
    "title": "Before There Was Nicolás Maduro, There Was Cipriano Castro",
    "description": "Greg Grandin\n\n\n\nBehind today’s headlines is a history of imperial outrage—including a Philadelphia contract man who wreaked havoc in early 20th century Venezuela and helped oust a president.\r\n\n\r\n\n\nThe post Before There Was Nicolás Maduro, There Was Cipriano C…",
    "link": "https://www.thenation.com/article/world/venezuela-tar-wars/",
    "timestamp": "2026-01-06T16:55:27Z"
  },
  {
    "title": "‘Can You Imagine FDR Dancing?’ Trump Admits ‘Very Classy’ Melania ‘Hates’ His Rally Tradition",
    "description": "President Donald Trump broke into full stand-up comic mode on Tuesday morning when he shared his wife Melania Trump \"hates\" when he dances.\nThe post ‘Can You Imagine FDR Dancing?’ Trump Admits ‘Very Classy’ Melania ‘Hates’ His Rally Tradition first appeared o…",
    "link": "https://www.mediaite.com/politics/can-you-imagine-fdr-dancing-trump-admits-very-classy-melania-hates-his-rally-tradition/",
    "timestamp": "2026-01-06T16:54:57Z"
  },
  {
    "title": "What actually is the “Donroe Doctrine”?",
    "description": "The Trump administration is taking a shockingly interventionist approach to the Western Hemisphere, as shown by last weekend’s capture of Venezuelan President Nicolás Maduro and his threats of military intervention against several other countries in the regio…",
    "link": "https://www.vox.com/politics/474168/donroe-doctrine-trump-latin-america-venezuela-colombia-mexico-cuba",
    "timestamp": "2026-01-06T16:54:23Z"
  },
  {
    "title": "Tim Allen says one conversation made Trump walk away from Hollywood movie investing",
    "description": "Tim Allen reveals how Donald Trump backed away from Hollywood investing after learning about financial risks in the movie business during conversation.",
    "link": "https://www.foxnews.com/entertainment/tim-allen-says-one-conversation-made-trump-walk-away-from-hollywood-movie-investing",
    "timestamp": "2026-01-06T16:53:52Z"
  },
  {
    "title": "Texas Democrat Jasmine Crockett Melts Down, Screams ‘F--- You’ at Supreme Court Over GOP‑Favored Maps",
    "description": "Rep. Jasmine Crockett, D‑Texas, sounded off in a profanity‑filled rant after the U.S. Supreme Court refused to block Texas’s new congressional redistricting maps. Crockett unloaded on the Court and accused President Donald Trump and the GOP of “rigging the sy…",
    "link": "https://www.breitbart.com/border/2026/01/06/texas-democrat-jasmine-crockett-melts-down-screams-f-you-at-supreme-court-over-gop%e2%80%91favored-maps/",
    "timestamp": "2026-01-06T16:52:12Z"
  },
  {
    "title": "This Maine school district passed trans-inclusive policies. Online comments forced it to up security",
    "description": "A school district in Maine has been forced to amp up security after receiving \"unsettling and concerning\" comments in response to its transgender-inclusive policies.",
    "link": "https://www.advocate.com/politics/maine-school-district-security-transgender",
    "timestamp": "2026-01-06T16:50:57Z"
  },
  {
    "title": "The 5 at 5: Tuesday",
    "description": "Five minutes, five stories, five o’clock…",
    "link": "https://www.thejournal.ie/5-at-5-tuesday-201-6919593-Jan2026/",
    "timestamp": "2026-01-06T16:50:50Z"
  },
  {
    "title": "What Project 2025 Says About Venezuela",
    "description": "Project 2025, the plan to reshape the United States federal government under a Republican president, described Venezuela as a critical nation that required closer American attention well before Donald Trump was reelected.\nThe 900-page document from the conser…",
    "link": "https://biztoc.com/x/dd080dc5d5c93f9e",
    "timestamp": "2026-01-06T16:50:38Z"
  },
  {
    "title": "‘Morning Joe’ Scarborough Details 20-Minute Call With Trump: ‘We’re Going to Keep the Oil’ | Video",
    "description": "\"The difference between Iraq and this is that Bush didn't keep the oil,\" the MS NOW host quotes the president as saying\nThe post ‘Morning Joe’ Scarborough Details 20-Minute Call With Trump: ‘We’re Going to Keep the Oil’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/media-platforms/journalism/morning-joe-scarborough-trump-phone-call-venezuela-oil/",
    "timestamp": "2026-01-06T16:50:38Z"
  },
  {
    "title": "Trump: If GOP doesn't win midterms, I'll be impeached",
    "description": "United States Donald Trump addressed Republican House lawmakers at their annual retreat on Tuesday, telling them that if they do not win the midterm election this year, he will be impeached.\"You've go...",
    "link": "https://biztoc.com/x/56ef55b6a1d14a95",
    "timestamp": "2026-01-06T16:50:21Z"
  },
  {
    "title": "George Conway launches New York congressional bid",
    "description": "Former conservative lawyer George Conway, a staunch critic of President Donald Trump, announced Tuesday that he is running for the New York congressional seat held by Rep. Jerry Nadler, who is retiring ahead of the midterm elections in November.\n“I’m running …",
    "link": "https://biztoc.com/x/e75bb3f11b9c4222",
    "timestamp": "2026-01-06T16:50:09Z"
  },
  {
    "title": "Trump Kept Venezuela Under Maduro Loyalists After CIA Flagged Opposition Risks: REPORT",
    "description": "A CIA assessment concluded that top figures within Maduro’s regime would be best positioned to maintain short-term stability in Venezuela.",
    "link": "https://dailycaller.com/2026/01/06/trump-kept-venezuela-under-maduro-loyalists-after-cia-flagged-opposition-risks-report/",
    "timestamp": "2026-01-06T16:48:03Z"
  },
  {
    "title": "Trump says first lady ‘hates when I do this’ in public — the moment he can’t help repeating",
    "description": "First lady Melania Trump calls President Donald Trump's dancing \"unpresidential,\" the president recounted Tuesday.",
    "link": "https://www.foxnews.com/politics/trump-says-first-lady-hates-when-i-do-this-public-moment-he-cant-help-repeating",
    "timestamp": "2026-01-06T16:47:40Z"
  },
  {
    "title": "Hakeem Jeffries endorses NY Rep. Dan Goldman against left-wing challenger — setting up Mamdani rift",
    "description": "It's a proxy war!",
    "link": "https://nypost.com/2026/01/06/us-news/hakeem-jeffries-endorses-ny-rep-dan-goldman-against-left-wing-challenger-setting-up-mamdani-rift/",
    "timestamp": "2026-01-06T16:46:41Z"
  },
  {
    "title": "After Claiming Maduro Was Its Kingpin, DOJ Now Admits in Court That 'Cartel De Los Soles' Isn't a Real Group",
    "description": "One of the central claims the Trump administration has used to justify the overthrow of Venezuelan President Nicolás Maduro and describe his government as “illegitimate” is the allegation that he is the leader of a multinational narco-terrorist organization k…",
    "link": "https://www.commondreams.org/news/doj-cartel-de-los-soles-not-real",
    "timestamp": "2026-01-06T16:46:33Z"
  },
  {
    "title": "Is This the End of American Capitalism?",
    "description": "If interest rates stop being market signals and become policy decisions, what survives may look less like capitalism—and more like permanent crisis management.",
    "link": "https://reason.com/2026/01/06/is-this-the-end-of-american-capitalism/",
    "timestamp": "2026-01-06T16:46:29Z"
  },
  {
    "title": "‘You Feel Safe!’ Trump Raves Over Sight of ‘Beautiful’ Soldiers in DC",
    "description": "Trump hailed Washington D.C. as “safe” and the restaurant business “booming” as he raved at the sight of “beautiful” soldiers stationed in the city.\nThe post ‘You Feel Safe!’ Trump Raves Over Sight of ‘Beautiful’ Soldiers in DC first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/you-feel-safe-trump-raves-over-sight-of-beautiful-soldiers-in-dc/",
    "timestamp": "2026-01-06T16:45:46Z"
  },
  {
    "title": "CDC announces massive overhaul of child vax schedule, drops numerous recommended jabs",
    "description": "At the time President Donald Trump took office last year, the Centers for Disease Control and Prevention was recommending that all American children get vaccines for 18 diseases, loading kids up with more than twice as many doses as their European counterpart…",
    "link": "https://www.theblaze.com/news/cdc-announces-massive-overhaul-of-child-vax-schedule-drops-numerous-recommended-jabs",
    "timestamp": "2026-01-06T16:45:00Z"
  },
  {
    "title": "Here's why Trump says the U.S. 'needs' Greenland for Arctic security",
    "description": "Increasing international tensions, global warming and the changing world economy have put Greenland at the heart of the debate over global trade and security.",
    "link": "https://www.pbs.org/newshour/world/heres-why-trump-says-the-u-s-needs-greenland-for-arctic-security",
    "timestamp": "2026-01-06T16:44:35Z"
  },
  {
    "title": "Billionaire investor Ray Dalio says gold's rapid rally is a warning for markets and the economy",
    "description": "Ray Dalio, the founder of Bridgwater Associates, says the blistering rally in gold last year is a reflection of precarious macro developments.",
    "link": "https://www.businessinsider.com/ray-dalio-gold-price-rally-warning-stocks-economy-dollar-currencies-2026-1",
    "timestamp": "2026-01-06T16:43:47Z"
  },
  {
    "title": "Trump’s vague claims of the US running Venezuela raise questions about planning for what comes next",
    "description": "It's complicated by seemingly contradictory statements from Trump and Rubio.",
    "link": "https://www.bostonherald.com/2026/01/06/venezuela-us-plans/",
    "timestamp": "2026-01-06T16:41:34Z"
  }
]