[
  {
    "title": "Lee heads to Washington for key summit with Trump (Son Ji-hyoung/The Korea Herald)",
    "description": "Son Ji-hyoung / The Korea Herald:\nLee heads to Washington for key summit with Trump  —  Agenda expected to include thorny issues such as tariffs, USFK deployment, civil nuclear cooperation  —  South Korean President Lee Jae Myung flew to Washington on Sunday …",
    "link": "https://www.memeorandum.com/250824/p4",
    "timestamp": "2025-08-24T12:35:02Z"
  },
  {
    "title": "Global mail carriers suspend U.S. deliveries amid confusion over new duties",
    "description": "Postal services across the world are halting shipments to the United States this week amid mounting confusion over new import duties that will apply to parcels starting Friday.",
    "link": "https://www.nbcnews.com/world/europe/global-mail-carriers-suspend-us-deliveries-confusion-new-duties-rcna226828",
    "timestamp": "2025-08-24T12:32:40Z"
  },
  {
    "title": "August 23, 2025 — \"It is my Great Honor to report that the United States of America ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nAugust 23, 2025  —  “It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” President Don…",
    "link": "https://www.memeorandum.com/250824/p3",
    "timestamp": "2025-08-24T12:30:00Z"
  },
  {
    "title": "Trump plans to deploy several thousand National Guard troops in Chicago",
    "description": "The reports come after US President Donald Trump deployed National Guard troops this month in the capital Washington DC.",
    "link": "https://www.thejournal.ie/trump-plans-to-deploy-several-thousand-national-guard-troops-in-chicago-6797967-Aug2025/",
    "timestamp": "2025-08-24T12:27:55Z"
  },
  {
    "title": "Pentagon Actively Planning a Military Deployment to Chicago, Following Trump’s DC Crackdown: Report",
    "description": "A new report reveals the Pentagon has been actively planning a military deployment to Chicago — on the heels of President Trump's crackdown in Washington, DC.\nThe post Pentagon Actively Planning a Military Deployment to Chicago, Following Trump’s DC Crackdown…",
    "link": "https://www.mediaite.com/media/news/pentagon-actively-planning-a-military-deployment-to-chicago-following-trumps-dc-crackdown-report/",
    "timestamp": "2025-08-24T12:26:01Z"
  },
  {
    "title": "Foundation Or Cover-Up? Trump’s 'Swollen' Right Hand Draws Attention! Makeup Patch Ignites Health Debate News24",
    "description": "US President Donald Trump has often drawn scrutiny for his political statements and public appearances. His latest visit to Washington, D.C., on Friday (August 22) was no exception. He is back at the center of attention, but this time for a minor cosmetic det…",
    "link": "https://news24online.com/world/foundation-or-cover-up-trumps-swollen-right-hand-draws-attention-makeup-patch-ignites-health-debate/619420/",
    "timestamp": "2025-08-24T12:25:30Z"
  },
  {
    "title": "US Envoy Visits Ukraine On Independence Day As Peace Efforts Stall",
    "description": "US President Donald Trump's envoy Keith Kellogg attended Ukraine's independence celebrations Sunday in Kyiv, as the push to end the war appeared to have stalled, with Ukraine and Russia trading accusations of hampering the peace efforts.",
    "link": "https://www.ibtimes.com.au/us-envoy-visits-ukraine-independence-day-peace-efforts-stall-1860230",
    "timestamp": "2025-08-24T12:18:12Z"
  },
  {
    "title": "Why Mexico seems to keep winning in the Trump trade wars",
    "description": "Next month Prime Minister Mark Carney is set to travel to Mexico to meet his counterpart as the two countries struggle with the erratic trade policies of the United States.\nOne question he may have for Mexican President Claudia Sheinbaum: How does her country…",
    "link": "https://biztoc.com/x/f636ff579fc7525a",
    "timestamp": "2025-08-24T12:14:49Z"
  },
  {
    "title": "Zelensky vows to retake Crimea despite Trump’s peace push",
    "description": "The US president earlier called it “impossible” for the peninsula, which voted to join Russia in 2014, to return to Kiev’s control Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/623468-zelensky-trump-crimea-retake/",
    "timestamp": "2025-08-24T12:09:11Z"
  },
  {
    "title": "Getting Rid of Non-English Tax Help Is a Lose-Lose Policy",
    "description": "When the thrash-metal band Stormtroopers of Death recorded “Speak English or Die,” its members went out of their way to remind listeners that they “didn’t really mean” what they were singing. By contrast, the Trump administration is apparently quite serious a…",
    "link": "https://itep.org/trump-english-irs-public-trust-budge-deficits/",
    "timestamp": "2025-08-24T12:06:02Z"
  },
  {
    "title": "Donald Trump’s hands were smeared with off-color makeup for some reason",
    "description": "Embed from Getty Images As someone who has to look up and use recent photos of Donald Trump for this job, I consistently find it interesting that Trump’s second term is not photographed as much as his first. I suspect it’s mostly to do with limiting the press…",
    "link": "https://www.celebitchy.com/937426/donald_trumps_hands_were_smeared_with_off-color_makeup_for_some_reason/",
    "timestamp": "2025-08-24T12:04:19Z"
  },
  {
    "title": "‘Weaponization of a sandwich’ — Subway’s footlong is becoming an icon of resistance against Trump’s D.C. police takeover",
    "description": "The sandwich chain hasn’t responded to the incident. Some experts say it has a responsibility to do so.",
    "link": "https://fortune.com/2025/08/24/subway-footlong-trump-dc-federal-takeover-police-ice-protests-bondi-pirro-marketing-brand/",
    "timestamp": "2025-08-24T12:03:00Z"
  },
  {
    "title": "Ghislaine Maxwell ‘never saw the president in any type of massage setting’",
    "description": "Last month, Donald Trump’s severely compromised Department of Justice sent high-ranking officials down to “interview” Ghislaine Maxwell. Maxwell is sitting in federal prison, where she’s three years into a 20-year sentence for human trafficking and more. Ghis…",
    "link": "https://www.celebitchy.com/937444/ghislaine_maxwell_never_saw_the_president_in_any_type_of_massage_setting/",
    "timestamp": "2025-08-24T12:02:52Z"
  },
  {
    "title": "Airbnb Co-Founder Aims to Give U.S. Gov’t an Apple Store Look",
    "description": "Airbnb co-founder Joe Gebbia has been tapped by President Donald Trump as America’s first chief design officer, with a mandate to bring Apple-level polish to outdated government websites and apps. Now that sounds like a huge undertaking. “That means it’s beau…",
    "link": "https://www.iphoneincanada.ca/2025/08/24/airbnb-co-founder-aims-to-give-u-s-govt-an-apple-store-look/",
    "timestamp": "2025-08-24T12:00:53Z"
  },
  {
    "title": "New RNC chair Joe Gruters vows to 'ride the president all the way to victory' in midterms",
    "description": "Trump ally Joe Gruters takes over as RNC chair, signaling president's complete control over national party committee ahead of challenging midterm elections.",
    "link": "https://www.foxnews.com/politics/new-rnc-chairman-counting-trump-win-midterms",
    "timestamp": "2025-08-24T12:00:23Z"
  },
  {
    "title": "Why Mexico seems to keep winning in the Trump trade wars",
    "description": "Mexico has seemed to benefit from a softer touch by the White House, and experts see potential lessons for Canada",
    "link": "https://www.theglobeandmail.com/business/article-why-mexico-seems-to-keep-winning-in-the-trump-trade-wars/",
    "timestamp": "2025-08-24T12:00:00Z"
  },
  {
    "title": "VA Redirects Millions From 'Wasteful' Union Spending to Veterans",
    "description": "The announcement follows the termination of most collective bargaining agreements with unions on August 6.",
    "link": "https://www.newsweek.com/va-redirects-millions-wasteful-union-spending-veterans-unions-2118417",
    "timestamp": "2025-08-24T11:58:26Z"
  },
  {
    "title": "TikTok Roundup: Sad Beige Moms, Pickpockets, & Bam Bam the Support Dog",
    "description": "<ul><li>A woman got fired from her job as the manger of the MAC in LAX because she posted a TikTok containing multiple security risks. She made timestamped videos of her day, showing details such as the commission that various employees made, where the store …",
    "link": "https://ohnotheydidnt.livejournal.com/131077987.html",
    "timestamp": "2025-08-24T11:52:47Z"
  },
  {
    "title": "Why we can trust the stats that violent crime is down",
    "description": "President Donald Trump shows crime statistics as he delivers remarks during a press conference in the James S. Brady Press Briefing Room of the White House August 11, 2025 in Washington, DC.",
    "link": "https://biztoc.com/x/44f8f041ec90d3ce",
    "timestamp": "2025-08-24T11:52:23Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "Welcome to Sunday, the sabbath for goyische cats. It’s August 24, 2025, and back to school time. It’s also National Waffle Day, which you can even have with chicken (I haven’t tried that.) Here are waffles with ice cream (the waffle itself dates back to the 1…",
    "link": "https://whyevolutionistrue.com/2025/08/24/sunday-hili-dialogue-548/",
    "timestamp": "2025-08-24T11:45:50Z"
  },
  {
    "title": "WATCH: Jim Jordan Claims Trump is Totally in the Clear On Epstein — Because Ghislaine Maxwell Said So",
    "description": "Jordan is holding up Ghislaine Maxwell's DOJ interview as confirmation that President Trump \"didn't do anything wrong\" as it relates to Jeffrey Epstein.\nThe post WATCH: Jim Jordan Claims Trump is Totally in the Clear On Epstein — Because Ghislaine Maxwell Sai…",
    "link": "https://www.mediaite.com/media/news/watch-jim-jordan-claims-trump-is-totally-in-the-clear-on-epstein-because-ghislaine-maxwell-said-so/",
    "timestamp": "2025-08-24T11:45:17Z"
  },
  {
    "title": "Erdoğan congratulates Ukraine for Independence Day",
    "description": "President Recep Tayyip Erdoğan has congratulated Ukrainian President Volodymyr Zelensky on the occasion of the 34th Independence Day of the country.",
    "link": "https://www.hurriyetdailynews.com/erdogan-congratulates-ukraine-for-independence-day-212833",
    "timestamp": "2025-08-24T11:32:51Z"
  },
  {
    "title": "North Korea's Kim Jong Un Oversees New 'Unique and Special' Missile Test",
    "description": "The newly-tested air-defense missiles \"are very suitable for destroying various aerial targets,\" North Korean state media reported.",
    "link": "https://www.newsweek.com/north-korea-kim-jong-un-air-defense-missile-tests-south-2118418",
    "timestamp": "2025-08-24T11:26:31Z"
  },
  {
    "title": "Russia looks to update nuclear program amid ‘colossal threats’ from West",
    "description": "Russian nuclear chief warns of threats to country's existence, emphasizes need to strengthen nuclear shield as US-Russia arms control future remains unclear.",
    "link": "https://www.foxnews.com/world/russia-looks-update-nuclear-program-amid-colossal-threats-from-west",
    "timestamp": "2025-08-24T11:00:36Z"
  },
  {
    "title": "Sex Workers Already Predicted There's A Recession Coming — Here's How They Know",
    "description": "The past has shown that nontraditional measures like brothels, beer and lipstick can tell us a lot about the economy’s health.",
    "link": "https://www.huffpost.com/entry/sex-worker-recession-indicator-goog_n_68a87185e4b037ca0b42d08d",
    "timestamp": "2025-08-24T11:00:17Z"
  },
  {
    "title": "Americans Are Struggling With This Travel Dilemma Following The Election",
    "description": "\"Before last fall, I usually answered this question easily and without any hesitation.\"",
    "link": "https://www.huffpost.com/entry/americans-are-struggling-with-this-travel-dilemma-following-the-election-goog_l_68a76ad5e4b00911ce4460dd",
    "timestamp": "2025-08-24T11:00:17Z"
  },
  {
    "title": "At least 21 hospitals have ended or restricted trans care for minors since January",
    "description": "More than 20 hospitals and health systems have temporarily or indefinitely rolled back transgender care for minors and some young adults this year amid threats of federal investigations and cuts to government funding, an NBC News analysis found.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/least-21-hospitals-ended-restricted-trans-care-minors-january-rcna226640",
    "timestamp": "2025-08-24T11:00:00Z"
  },
  {
    "title": "The Real Reason American Socialists Don’t Win",
    "description": "Only part of the left’s most promising political party even wants to win elections or come to power.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/dsa-mamdani-losing-elections/683970/",
    "timestamp": "2025-08-24T11:00:00Z"
  },
  {
    "title": "‘Pattern of lawfare’: Trump is targeting opponents with mortgage fraud claims",
    "description": "Donald Trump and his allies have been accused of executing a “pattern of lawfare” akin to those exerted by authoritarian regimes in Hungary and Russia after adopting a new strategy to target political opponents: allegations of mortgage fraud.\nFirst it was Let…",
    "link": "https://biztoc.com/x/1a67abbb3e395686",
    "timestamp": "2025-08-24T10:56:07Z"
  },
  {
    "title": "Russian minister claims West trying to ‘block’ Ukraine peace talks",
    "description": "US President Donald Trump has been championing a bilateral meeting between the Ukrainian and Russian presidents – but both sides have blamed each other for not wanting the talks to come through.\n\"They're just looking for a pretext to block negotiations,\" Lavr…",
    "link": "https://biztoc.com/x/14a7876309c16fc4",
    "timestamp": "2025-08-24T10:55:50Z"
  },
  {
    "title": "Nancy Mace Cancels Speech After Just 8 People Show Up...",
    "description": "GOP Rep. Nancy Mace—who is currently running as a South Carolina gubernatorial candidate—was reportedly forced to cancel a Thursday speech after nearly no...",
    "link": "https://www.thedailybeast.com/nancy-mace-cancels-speech-after-just-8-people-show-up/",
    "timestamp": "2025-08-24T10:55:37Z"
  },
  {
    "title": "Maureen Dowd: Donald Trump needs to learn there is nothing positive to say about slavery",
    "description": "US president sticks his nose where it doesn’t belong, from John Bolton’s closets to the Smithsonian",
    "link": "https://www.irishtimes.com/world/us/2025/08/24/donald-trump-needs-to-learn-there-is-nothing-positive-to-say-about-slavery/",
    "timestamp": "2025-08-24T10:53:43Z"
  },
  {
    "title": "Trump plans to deploy National Guard in Chicago - reports",
    "description": "The Trump administration has been planning for weeks to deploy National Guard troops in Chicago as part of an expanded crackdown on crime and immigration, according to reports in US media.",
    "link": "https://www.rte.ie/news/2025/0824/1529912-national-guard-trump/",
    "timestamp": "2025-08-24T10:53:13Z"
  },
  {
    "title": "Trump appoints Airbnb co-founder to revamp public websites after Musk DOGE exit",
    "description": "US President Donald Trump has appointed Airbnb co-founder Joe Gebbia as the new design chief for online government services. Many US public service websites are seen as difficult to use and outmoded. Airbnb co-founder Joe Gebbia has said he wants to streamlin…",
    "link": "https://www.dw.com/en/trump-appoints-airbnb-co-founder-to-revamp-public-websites-after-musk-doge-exit/a-73744139",
    "timestamp": "2025-08-24T10:50:00Z"
  },
  {
    "title": "Mythical creature cutouts capture Happy Valley-Goose Bay's imagination",
    "description": "Silhouette cutouts of the mythical Traverspine gorilla have been making appearances all over Happy Valley-Goose Bay this summer.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/traverspine-gorilla-cutouts-mystery-1.7612459",
    "timestamp": "2025-08-24T10:49:45Z"
  },
  {
    "title": "We need a new theory of democracy — because this version has failed",
    "description": "It's time to look in the mirror, America: We chose catastrophe — there's no one else to blame",
    "link": "https://www.salon.com/2025/08/24/we-need-a-new-theory-of-democracy-because-this-version-has-failed/",
    "timestamp": "2025-08-24T10:45:35Z"
  },
  {
    "title": "Russian minister claims West trying to ‘block’ Ukraine peace talks",
    "description": "Trump is pushing for peace talks, but Russia's chief diplomat is blaming others for holding up a summit",
    "link": "https://www.euractiv.com/section/defence/news/russian-minister-claims-west-trying-to-block-ukraine-peace-talks/",
    "timestamp": "2025-08-24T10:44:48Z"
  },
  {
    "title": "Mint Explainer | Can US and Europe help steer Ukraine towards peace?",
    "description": "Ukraine marks its 34th Independence Day under the shadow of war, raising questions over whether the nation is any closer to peace as the conflict grinds on.",
    "link": "https://www.livemint.com/opinion/online-views/russia-ukraine-war-outlook-us-europe-peace-efforts-11756030742411.html",
    "timestamp": "2025-08-24T10:34:02Z"
  },
  {
    "title": "10 Sunday Reads",
    "description": "Avert your eyes! My Sunday morning look at incompetency, corruption and policy failures: • The umpire who picked a side: John Roberts and the death of rule of law in America: The chief justice of the US has painted himself as a modern institutionalist over th…",
    "link": "https://ritholtz.com/2025/08/10-sunday-reads-196/",
    "timestamp": "2025-08-24T10:30:59Z"
  },
  {
    "title": "Fox News sees the power of Gavin Newsom’s trolling",
    "description": "That’s why the network’s stars are fuming",
    "link": "https://www.salon.com/2025/08/24/fox-news-sees-the-power-of-gavin-newsoms-trolling/",
    "timestamp": "2025-08-24T10:30:57Z"
  },
  {
    "title": "Open Thread: The Great Khan of the Plains Will Not Be Cowed",
    "description": "The State of Illinois at this time has received no requests or outreach from the federal government asking if we need assistance, and we have made no requests for federal intervention. — Governor JB Pritzker (@govpritzker.illinois.gov) August 23, 2025 at 9:07…",
    "link": "https://balloon-juice.com/2025/08/24/open-thread-the-great-khan-of-the-plains-will-not-be-cowed/",
    "timestamp": "2025-08-24T10:27:31Z"
  },
  {
    "title": "Western Countries, Zelensky Trying to Thwart Peace Talks on Ukraine - Lavrov",
    "description": "MOSCOW (Sputnik) - Russian Foreign Minister Sergey Lavrov said on Sunday that Western countries, along with Volodymyr Zelensky, were trying to block peace talks on Ukraine, but Russia hoped that these attempts would be in vain.",
    "link": "https://sputnikglobe.com/20250824/western-countries-zelensky-trying-to-thwart-peace-talks-on-ukraine---lavrov-1122668381.html",
    "timestamp": "2025-08-24T10:18:55Z"
  },
  {
    "title": "Ukraine marks independence day with drone strikes on Russia",
    "description": "KYIV: Ukraine launched a wave of drone strikes on Russia on Sunday (Aug 24), triggering a fire at a nuclear power plant as it celebrated Ukrainian independence day against a backdrop of fading hopes for recent peace efforts. After a flurry of diplomacy and a …",
    "link": "https://www.channelnewsasia.com/world/ukraine-independence-day-drone-strikes-russia-5311361",
    "timestamp": "2025-08-24T10:13:38Z"
  },
  {
    "title": "Trump’s D.C. Takeover Is Scaring Immigrant Parents Out of Taking Kids Back to School",
    "description": "While parents fear pickup and drop-off, teachers say the D.C. public school district has offered little support.\nThe post Trump’s D.C. Takeover Is Scaring Immigrant Parents Out of Taking Kids Back to School appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/24/washington-dc-national-guard-ice-school/",
    "timestamp": "2025-08-24T10:04:00Z"
  },
  {
    "title": "Analysis-Trump's redistricting push could bring decades of Republican rule to the US House",
    "description": "WASHINGTON (Reuters) -President Donald Trump's push for Republican-led states to redraw their U.S. House of Representatives districts to protect their...",
    "link": "https://ca.news.yahoo.com/analysis-trumps-redistricting-push-could-100315117.html",
    "timestamp": "2025-08-24T10:03:15Z"
  },
  {
    "title": "Getting “DOGED”: DOGE targeted him on social media. Then the Taliban took his family",
    "description": "DOGE put his family’s lives at risk by exposing his sensitive work for a U.S.-funded nonprofit.",
    "link": "https://www.salon.com/2025/08/24/getting-doged-doge-targeted-him-on-social-media-then-the-taliban-took-his-family/",
    "timestamp": "2025-08-24T10:00:28Z"
  },
  {
    "title": "A Treasure Trove of Key Minerals Is Being Wasted in the U.S., Study Claims",
    "description": "There’s enough lithium in one year of U.S. mine waste to power 10 million electric vehicles.",
    "link": "https://gizmodo.com/a-treasure-trove-of-key-minerals-is-being-wasted-in-the-u-s-study-claims-2000646858",
    "timestamp": "2025-08-24T10:00:10Z"
  },
  {
    "title": "Stopping Trump’s Dictatorship Is a Vital Message—and a Winning One",
    "description": "CNN and MSNBC with a constant “The Trump Dictatorship” chyron on-screen. How Democracies Die authors Steven Levitsky and Daniel Ziblatt writing weekly columns in The New York Times, The Washington Post, or The Wall Street Journal. Reporters at major news outl…",
    "link": "https://newrepublic.com/article/199474/trump-dictatorship-winning-message-democrats",
    "timestamp": "2025-08-24T10:00:00Z"
  },
  {
    "title": "Trump sends shocking threat to top Dem: ‘She won’t be mayor very long’",
    "description": "President Donald Trump issued a shocking threat to Democratic Mayor Muriel Bowser on Friday.",
    "link": "https://www.nj.com/politics/2025/08/trump-sends-shocking-threat-to-top-dem-she-wont-be-mayor-very-long.html",
    "timestamp": "2025-08-24T10:00:00Z"
  },
  {
    "title": "Why we can trust the stats that violent crime is down",
    "description": "Contrary to Trump's claim, it's  highly unlikely that manipulation explains Washington, D.C.'s reported drop in crime. Violent crime is down across the country.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/dc-crime-stats-investigation-doj-trump-rcna226692",
    "timestamp": "2025-08-24T10:00:00Z"
  },
  {
    "title": "Pastor: Donald Trump is worried about getting into heaven. He shouldn’t be. | Opinion",
    "description": "It is unsurprising that the man who co-wrote “The Art of the Deal” believes that heaven is a luxury property purchased by good deeds. | Opinion",
    "link": "https://www.sacbee.com/opinion/article311824251.html",
    "timestamp": "2025-08-24T10:00:00Z"
  },
  {
    "title": "A Putin-Zelenskyy summit remains possible, but where to hold it?",
    "description": "The biggest logistical hurdle for would-be hosts remains the ICC arrest warrant against Putin",
    "link": "https://www.euractiv.com/section/politics/news/a-putin-zelenskyy-summit-remains-possible-but-where-to-hold-it/",
    "timestamp": "2025-08-24T09:50:13Z"
  },
  {
    "title": "Nikki Haley asks India to take Trump’s view on Russian oil ‘seriously’",
    "description": "Nikki Haley defends India amid US tariff tensions, emphasizing the importance of the US-India partnership against China.",
    "link": "https://www.thehindubusinessline.com/news/nikki-haley-asks-india-to-take-trumps-view-on-russian-oil-seriously/article69971356.ece",
    "timestamp": "2025-08-24T09:48:03Z"
  },
  {
    "title": "Russia hits Ukraine with drones as Kyiv celebrates independence day",
    "description": "Russia launched 72 drones and one ballistic missile into Ukraine overnight into Sunday, the air force in Kyiv said.",
    "link": "https://abcnews.go.com/International/russia-hits-ukraine-drones-kyiv-celebrates-independence-day/story?id=124929154",
    "timestamp": "2025-08-24T09:45:14Z"
  },
  {
    "title": "Turkish first lady urges Melania Trump to speak out for Gaza’s children",
    "description": "Emine Erdogan writes to Melania Trump after the US first lady's letter to Putin about children in Ukraine and Russia.",
    "link": "https://www.aljazeera.com/news/2025/8/24/turkish-first-lady-urges-melania-trump-to-speak-out-for-gazas-children",
    "timestamp": "2025-08-24T09:42:44Z"
  },
  {
    "title": "‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers | CNN Business",
    "description": "‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers | CNN Businesscnn.com",
    "link": "https://www.cnn.com/2025/08/24/economy/us-tariffs-passthrough-consumers",
    "timestamp": "2025-08-24T09:38:44Z"
  },
  {
    "title": "Trump-Modi rift threatens global stability with China in mind",
    "description": "TOKYO -- Few could have predicted the recent developments that have plunged the once-vaunted friendship between U.S. President Donald Trump and Indian Prime Minister Narendra Modi into sudden and serious conflict.\nDeal-driven U.S. diplomacy deepens fissures b…",
    "link": "https://biztoc.com/x/cf2ad57bc438c4cf",
    "timestamp": "2025-08-24T09:37:16Z"
  },
  {
    "title": "Zelensky Thanks Donald Trump for 'Kind Words' on Ukrainian Independence Day",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nUkrainian President Volodymyr Zelensky has thanked U.S. President Donald Trump for his \"heartfelt congratulations\" on the country's independence day, as Washington presses on with its efforts to broker a deal …",
    "link": "https://biztoc.com/x/06d83c59807f3be2",
    "timestamp": "2025-08-24T09:37:14Z"
  },
  {
    "title": "Ukraine marks independence day with drone strikes on Russia",
    "description": "Ukraine launched a wave of drone strikes on Russia Sunday, triggering a fire at a nuclear power plant as it celebrated Ukrainian independence day against a backdrop of fading hopes for recent peace efforts. After a flurry of diplomacy and a push by US Preside…",
    "link": "https://www.digitaljournal.com/world/ukraine-marks-independence-day-with-drone-strikes-on-russia/article",
    "timestamp": "2025-08-24T09:32:20Z"
  },
  {
    "title": "Zelensky Thanks Donald Trump for 'Kind Words' on Ukrainian Independence Day",
    "description": "\"Now is the moment to bring an end to the senseless killing,\" Trump said in a message published by Zelensky on Sunday.",
    "link": "https://www.newsweek.com/volodymyr-zelensky-donald-trump-ukraine-independence-day-xi-jinping-2118408",
    "timestamp": "2025-08-24T09:30:56Z"
  },
  {
    "title": "This Trump outrage is no mere 'distraction'",
    "description": "I have grown sick and tired of the word, “distraction.”And if you are a patriot doing what you can to fight against the most anti-American administration in our nation’s history, I bet you know exactly what I am talking about.I am done being lectured to by so…",
    "link": "https://www.rawstory.com/this-trump-outrage-is-no-mere-distraction/",
    "timestamp": "2025-08-24T09:30:02Z"
  },
  {
    "title": "CASEY: Activists rent downtown Roanoke billboard to slam Rep. Ben Cline",
    "description": "The upcoming, huge report-card-style sign on Jefferson Street features many bright red Fs, organizers said. It will be unveiled Monday at noon directly across from Rep. Ben Cline’s Roanoke district office.",
    "link": "https://roanoke.com/news/local/government-politics/article_8382571c-d3b3-4747-a4b8-825fd31159c4.html",
    "timestamp": "2025-08-24T09:30:00Z"
  },
  {
    "title": "Gold may consolidate, but bias stays positive on Fed rate-cut hopes: Analysts",
    "description": "Last week, the precious metal regained the psychological ₹1 lakh level on the Multi Commodity Exchange, by rising ₹956 or 1% ₹1,00,391 per 10 grams",
    "link": "https://www.thehindubusinessline.com/markets/gold/gold-may-consolidate-but-bias-stays-positive-on-fed-rate-cut-hopes-analysts/article69971346.ece",
    "timestamp": "2025-08-24T09:25:01Z"
  },
  {
    "title": "Ukraine marks independence day with drone strikes on Russia",
    "description": "Ukraine launched a wave of drone strikes on Russia on Aug. 24, triggering a fire at a nuclear power plant as it celebrated Ukrainian independence day against a backdrop of fading hopes for recent peace efforts.",
    "link": "https://www.hurriyetdailynews.com/ukraine-marks-independence-day-with-drone-strikes-on-russia-212827",
    "timestamp": "2025-08-24T09:21:26Z"
  },
  {
    "title": "Trump has handed EU ‘a brutal wake-up call’ – ex-ECB chief",
    "description": "The EU’s “illusion” of geopolitical might has “evaporated,” Mario Draghi has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623465-draghi-trump-eu-wake-up/",
    "timestamp": "2025-08-24T09:18:45Z"
  },
  {
    "title": "Crypto in Late 2025 and Beyond: What Powell’s Speech Signals for Rates, Inflation and Assets",
    "description": "Powell’s Jackson Hole speech showed how the Fed is weighing inflation against jobs. That balance could shape policy in the fourth quarter of 2025 and beyond.",
    "link": "https://www.coindesk.com/markets/2025/08/24/crypto-in-late-2025-and-beyond-what-powell-s-speech-signals-for-rates-inflation-and-assets",
    "timestamp": "2025-08-24T09:16:44Z"
  },
  {
    "title": "Extra US tariff on India, SCO summit, Lee in Washington",
    "description": "Welcome to Your Week in Asia.\nIndian Prime Minister Narendra Modi has taken a defiant stance in the face of an additional 25% tariff threatened by U.S. President Donald Trump, but Indian businesses will begin to feel the true impact of the levy once it takes …",
    "link": "https://biztoc.com/x/b103197ec5f08a56",
    "timestamp": "2025-08-24T09:14:48Z"
  },
  {
    "title": "‘Sneakflation’: How Trump’s tariffs are gradually raising costs for American consumers",
    "description": "When tariffs are tacked on to many imported goods, someone’s got to foot the bill.\nAccording to President Donald Trump, foreign countries and overseas businesses are eating the cost. But evidence shows that American consumers and businesses are paying for the…",
    "link": "https://biztoc.com/x/ff00ce9b8451c570",
    "timestamp": "2025-08-24T09:14:37Z"
  },
  {
    "title": "Newsom Hopes to Turn Gerrymander Fight into Referendum on Trump",
    "description": "California Gov. Gavin Newsom (D) hopes to turn a special election in November on his gerrymandered congressional map into a referendum on President Donald Trump, rather than on his own partisan ambition.\nThe post Newsom Hopes to Turn Gerrymander Fight into Re…",
    "link": "https://www.breitbart.com/politics/2025/08/24/newsom-hopes-to-turn-gerrymander-fight-into-referendum-on-trump/",
    "timestamp": "2025-08-24T09:14:12Z"
  },
  {
    "title": "Killing the Moonlight",
    "description": "Electric light, the telephone, radio, the automobile, the movie camera, the airplane: the last years of the nineteenth century and the first years of the twentieth were a blur of technological innovation. In Italy, a provincial, largely agrarian country only …",
    "link": "http://www.nybooks.com/online/2025/08/24/killing-the-moonlight/",
    "timestamp": "2025-08-24T09:13:01Z"
  },
  {
    "title": "Indian envoy discusses 'fair' trade with US lawmakers amid tariff tensions",
    "description": "Indian envoy Vinay Mohan Kwatra engaged with US lawmakers, advocating for equitable trade relations amidst existing tariff disagreements. He emphasized the need for balanced and mutually advantageous trade ties during discussions with multiple congressmen. Kw…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-envoy-discusses-fair-trade-with-us-lawmakers-amid-tariff-tensions/articleshow/123482605.cms",
    "timestamp": "2025-08-24T09:08:23Z"
  },
  {
    "title": "Trump Sees Whitewashed U.S. Past and Dystopian Present",
    "description": "Trump envisions a whitewashed U.S. past and a dystopian present. His demands to the Smithsonian and other museums are about depicting a nation that was perfect — until his Democratic predecessors, Obama and Biden, unleashed ‘American carnage.’",
    "link": "http://nymag.com/intelligencer/article/trump-sees-whitewashed-u-s-past-and-dystopian-present.html",
    "timestamp": "2025-08-24T09:00:14Z"
  },
  {
    "title": "Ghislaine Maxwell speaks out for first time as she shares how much Jeffrey Epstein paid her",
    "description": "Transcripts from Ghislaine Maxwell's prison interview revealed how much Jeffrey Epstein paid her every year until his 2019 arrest.",
    "link": "https://www.ladbible.com/news/us-news/ghislaine-maxwell-jeffrey-epstein-prison-interview-034912-20250824",
    "timestamp": "2025-08-24T08:53:17Z"
  },
  {
    "title": "Illinois Governor Calls Trump's Plan To Deploy National Guard In Chicago 'Abuse Of Power'",
    "description": "President Donald Trump‘s plan to deploy National Guard troops to Chicago represents an “abuse of power” and an attempt to “manufacture a crisis,” Illinois Governor JB Pritzker said Friday. The Democratic governor stated there is no emergency justifying milita…",
    "link": "https://biztoc.com/x/31ef1e59b5ac9a41",
    "timestamp": "2025-08-24T08:52:14Z"
  },
  {
    "title": "China says 'rampant' US protectionism threatens agricultural ties",
    "description": "Agriculture has emerged as a major point of contention between China and the US as the superpowers are locked in a tariff war launched by President Donald Trump",
    "link": "https://www.thehindubusinessline.com/news/world/china-says-rampant-us-protectionism-threatens-agricultural-ties/article69971160.ece",
    "timestamp": "2025-08-24T08:34:07Z"
  },
  {
    "title": "Ukraine marks independence day with drone strikes on Russia",
    "description": "Canada's Mark Carney arrived in Kyiv to join celebrations of Ukraine's independence amid the ongoing war",
    "link": "https://www.euractiv.com/section/defence/news/ukraine-marks-independence-day-with-drone-strikes-on-russia/",
    "timestamp": "2025-08-24T08:24:05Z"
  },
  {
    "title": "Ukraine Marks Independence Day With Drone Strikes On Russia",
    "description": "Ukraine launched a wave of drone strikes on Russia Sunday, triggering a fire at a nuclear power plant as it celebrated Ukrainian independence day against a backdrop of fading hopes for recent peace efforts.",
    "link": "https://www.ibtimes.com/ukraine-marks-independence-day-drone-strikes-russia-3781556",
    "timestamp": "2025-08-24T08:12:21Z"
  },
  {
    "title": "Ukraine marks independence day with drone strikes on Russia",
    "description": "Ukraine launched a wave of drone strikes on Russia Sunday, triggering a fire at a nuclear power plant as it celebrated Ukrainian independence day against a...",
    "link": "https://www.yahoo.com/news/articles/ukraine-marks-independence-day-drone-080845516.html",
    "timestamp": "2025-08-24T08:08:45Z"
  },
  {
    "title": "Hispanic Voters Are Turning Against Donald Trump: Polls",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump faces a sharp erosion of support among Hispanic voters, according to new polling that shows his approval sinking to its lowest point of his second term.\nA Reuters survey released th…",
    "link": "https://biztoc.com/x/22b78f52b51687cf",
    "timestamp": "2025-08-24T08:07:25Z"
  },
  {
    "title": "Today in History: August 24, Hurricane Andrew strikes Florida",
    "description": "Hurricane Andrew smashed into Florida; the storm resulted in 65 deaths and caused more than $26 billion in damage across Florida, Louisiana and the Bahamas.",
    "link": "https://www.bostonherald.com/2025/08/24/today-in-history-august-24-hurricane-andrew-strikes-florida-2/",
    "timestamp": "2025-08-24T08:00:26Z"
  },
  {
    "title": "Today in History: August 24, Hurricane Andrew strikes Florida",
    "description": "Hurricane Andrew smashed into Florida; the storm resulted in 65 deaths and caused more than $26 billion in damage across Florida, Louisiana and the Bahamas.",
    "link": "https://www.denverpost.com/2025/08/24/today-in-history-august-24-hurricane-andrew-strikes-florida-2/",
    "timestamp": "2025-08-24T08:00:26Z"
  },
  {
    "title": "Hispanic Voters Are Turning Against Donald Trump: Polls",
    "description": "Donald Trump faces a sharp erosion of support among Hispanic voters, according to new polling.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-polls-hispanics-2117009",
    "timestamp": "2025-08-24T08:00:03Z"
  },
  {
    "title": "트럼프 관세 폭풍 현실로",
    "description": "FBI agents carried out a search of former National Security Advisor John Bolton’s home over an investigation regarding classified documents, a person familiar with the matter said on Friday https://t.co/Qav2pFn4T7— Bloomberg (@business) August 22, 2025 Trump …",
    "link": "https://ryueyes11.tistory.com/511796",
    "timestamp": "2025-08-24T07:53:58Z"
  },
  {
    "title": "Illinois leaders speak out on Washington Post report President Donald Trump preparing to deploy National Guard troops to Chicago - ABC7 Chicago",
    "description": "Illinois leaders speak out on Washington Post report President Donald Trump preparing to deploy National Guard troops to ChicagoABC7 Chicago Trump's plan to send troops to Chicago is abuse of power, Illinois governor saysBBC Trump seeking to 'manufacture a cr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178845764",
    "timestamp": "2025-08-24T07:52:36Z"
  },
  {
    "title": "Trump’s new India envoy has Soviet past",
    "description": "Sergio Gor’s nomination comes amid strained ties, with Washington threatening tariffs over New Delhi buying Russian oil Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623464-trump-reveals-soviet-born-ambassador/",
    "timestamp": "2025-08-24T07:43:32Z"
  },
  {
    "title": "Harsh Goenka shares a picture of a half-eaten toast: Can you guess which political figure it resembles?",
    "description": "Industrialist Harsh Goenka shared a humorous incident on social media involving a piece of toast that he believed resembled former US President Donald Trump. The post quickly went viral, eliciting a flurry of witty remarks and jokes from amused users. This li…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/harsh-goenka-shares-a-picture-of-a-half-eaten-toast-can-you-guess-which-political-figure-it-resembles/articleshow/123481962.cms",
    "timestamp": "2025-08-24T07:40:15Z"
  },
  {
    "title": "China says 'rampant' US protectionism threatens agricultural ties",
    "description": "BEIJING (Reuters) -U.S. protectionism is undermining agricultural cooperation with China, Beijing's ambassador to Washington said, warning that farmers...",
    "link": "https://finance.yahoo.com/news/china-says-rampant-us-protectionism-073111849.html",
    "timestamp": "2025-08-24T07:31:11Z"
  },
  {
    "title": "China says 'rampant' US protectionism threatens agricultural ties",
    "description": "BEIJING (Reuters) -U.S. protectionism is undermining agricultural cooperation with China, Beijing's ambassador to Washington said, warning that farmers...",
    "link": "https://finance.yahoo.com/news/china-says-rampant-us-protectionism-073111609.html",
    "timestamp": "2025-08-24T07:31:11Z"
  },
  {
    "title": "Russia Says Novatek Fuel Terminal At Ust-Luga Port Catches Fire",
    "description": "Russia said Novatek PJSC’s fuel terminal at the Baltic port of Ust-Luga caught fire early Sunday after wreckage from downed drones hit the facility.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-says-novatek-fuel-terminal-at-ust-luga-port-catches-fire",
    "timestamp": "2025-08-24T07:30:42Z"
  }
]