[
  {
    "title": "Musk’s Government Business Is Too Vital for Trump to Cancel. There’s Still a Way He Could Punish Him.",
    "description": "It’s a penalty that Musk would deserve by objective measures, quite apart from Trump’s vengeful motives.",
    "link": "https://slate.com/news-and-politics/2025/06/elon-musk-donald-trump-fight-government-contracts.html",
    "timestamp": "2025-06-09T21:45:36Z"
  },
  {
    "title": "US State Department cable says agency using AI to help staff job panels",
    "description": "WASHINGTON :The U.S. State Department will use an artificial intelligence chatbot to help it select the people who will perform annual reviews of promotions and moves, according to a cable issued Monday and reviewed by Reuters.The cable said that StateChat, a…",
    "link": "https://www.channelnewsasia.com/business/us-state-department-cable-says-agency-using-ai-help-staff-job-panels-5171866",
    "timestamp": "2025-06-09T21:45:28Z"
  },
  {
    "title": "Trump’s Immigration Crackdown Guru Stephen Miller Wants Even More Arrests",
    "description": "Miller recently set a new daily ICE arrest quota of 3,000 per day.",
    "link": "https://www.forbes.com/sites/saradorn/2025/06/09/trumps-immigration-crackdown-guru-stephen-miller-wants-even-more-arrests/",
    "timestamp": "2025-06-09T21:45:27Z"
  },
  {
    "title": "LA protests: US deploying hundreds of Marines",
    "description": "Pentagon is deploying some 700 Marines to Los Angeles amid the immigration protests, officials told the media. LA Governor Newsam meanwhile vowed to sue the Trump administration over the National Guard deployment.",
    "link": "https://www.dw.com/en/la-protests-us-deploying-hundreds-of-marines/live-72839578",
    "timestamp": "2025-06-09T21:45:00Z"
  },
  {
    "title": "LA protests: US deploying hundreds of Marines",
    "description": "Pentagon is deploying some 700 Marines to Los Angeles amid the immigration protests, officials told the media. LA Governor Newsam meanwhile vowed to sue the Trump administration over the National Guard deployment. Hundreds of Marines are to be deployed to Los…",
    "link": "https://www.dw.com/en/la-protests-us-deploying-hundreds-of-marines/live-72839578",
    "timestamp": "2025-06-09T21:45:00Z"
  },
  {
    "title": "LA protests: US deploying hundreds of Marines - reports",
    "description": "Pentagon is deploying at least 500 Marines to Los Angeles amid the immigration protests, officials told the media. LA Governor Newsam meanwhile vowed to sue the Trump administration over the National Guard deployment.",
    "link": "https://www.dw.com/en/la-protests-us-deploying-hundreds-of-marines-reports/live-72839578",
    "timestamp": "2025-06-09T21:45:00Z"
  },
  {
    "title": "LA protests: US deploying hundreds of Marines - reports",
    "description": "Pentagon is deploying at least 500 Marines to Los Angeles amid the immigration protests, officials told the media. LA Governor Newsam meanwhile vowed to sue the Trump administration over the National Guard deployment. Hundreds of Marines are to be deployed to…",
    "link": "https://www.dw.com/en/la-protests-us-deploying-hundreds-of-marines-reports/live-72839578",
    "timestamp": "2025-06-09T21:45:00Z"
  },
  {
    "title": "Key Gov Race In Right-Trending State Poised To Be Referendum On Trump Admin, One Day Out From Primary Vote",
    "description": "'We don’t count victories before they’re earned'",
    "link": "https://dailycaller.com/2025/06/09/new-jersey-governor-race-democratic-republican-primary/",
    "timestamp": "2025-06-09T21:43:45Z"
  },
  {
    "title": "Some visitors report extra scrutiny at US airports as Trump's new travel ban begins",
    "description": "President Donald Trump’s new ban on travel to the United States by citizens from 12 mainly African and Middle Eastern countries is now in effect",
    "link": "https://www.wftv.com/news/some-visitors-report/4T5FQENJUZDDZL463UPLNHAAGY/",
    "timestamp": "2025-06-09T21:42:07Z"
  },
  {
    "title": "U.S.–China Trade Talks Will Continue in London",
    "description": "LONDON — High-level trade negotiations between the United States and China will continue into a second day on Tuesday, as both sides seek to ease tensions over technology exports and critical mineral shipments.\nThe post U.S.–China Trade Talks Will Continue in…",
    "link": "https://www.breitbart.com/economy/2025/06/09/u-s-china-trade-talks-will-continue-in-london/",
    "timestamp": "2025-06-09T21:41:15Z"
  },
  {
    "title": "JD Vance says the ‘blood feud’ between Trump and Musk is ‘not going to be good for Elon’ but admits he ‘suffered a lot’ for the White House",
    "description": "Vice President JD Vance acknowledged the deepening feud between Elon Musk and President Trump but emphasized his hope that Musk could eventually reconcile with the Trump administration, praising Musk’s past efforts with DOGE and calling him a “transformationa…",
    "link": "https://freerepublic.com/focus/f-news/4322002/posts",
    "timestamp": "2025-06-09T21:40:46Z"
  },
  {
    "title": "Elon Musk’s Dad Blames Social Media Meltdown on Adult Son Being Tired, Cranky",
    "description": "He also added that Musk f--ked up by taking on the president.",
    "link": "https://www.vanityfair.com/news/story/elon-musks-dad-blames-social-media-meltdown-on-adult-son-being-tired",
    "timestamp": "2025-06-09T21:40:13Z"
  },
  {
    "title": "Judge blocks administration from enforcing anti-diversity and anti-transgender executive orders",
    "description": "A federal judge in California has blocked the Trump administration from enforcing anti-diversity and anti-transgender executive orders in grant funding requirements that LGBTQ+ organizations say are unconstitutional.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/judge-blocks-administration-enforcing-anti-diversity-anti-transgender-rcna211949",
    "timestamp": "2025-06-09T21:39:15Z"
  },
  {
    "title": "The LA Chaos Is an Illusion and Trump Will Not Fall for It",
    "description": "Let’s understand what’s going on in Los Angeles because most people don’t. This is not a battle of cops versus rioters; it is a battle between narratives. Most people see regime media video of Third World savages waving the tacky banners of their garbage home…",
    "link": "https://freerepublic.com/focus/f-news/4322000/posts",
    "timestamp": "2025-06-09T21:38:39Z"
  },
  {
    "title": "Trump plan provides every American newborn with a $1,000 investment account",
    "description": "'Will put the lives of young Americans on the right financial path'",
    "link": "https://www.wnd.com/2025/06/trump-plan-provides-every-american-newborn-with-a-1000-investment-account/",
    "timestamp": "2025-06-09T21:38:26Z"
  },
  {
    "title": "Archbishop Gomez urges calm and restraint as ICE protests erupt in Los Angeles",
    "description": "Waymo cars are set on fire and vandalized during a protest against immigration raids on June 8, 2025, in Los Angeles. / Credit: Nick Ut/Getty Images\n\nCNA Staff, Jun 9, 2025 / 17:38 pm (CNA).\nArchbishop José H. Gomez of Los Angeles, the nation’s largest Cathol…",
    "link": "https://www.catholicnewsagency.com/news/264637/archbishop-gomez-urges-calm-and-restraint-as-ice-protests-erupt-in-los-angeles",
    "timestamp": "2025-06-09T21:38:00Z"
  },
  {
    "title": "Democratic senator seeks guardrails as Trump deploys troops to LA",
    "description": "President Donald Trump’s decision to deploy troops to Los Angeles in response to protests is driving a new push in Congress to rein in presidential power. \nSen. Richard Blumenthal (D-Conn.) told POLITICO he is drafting new legislation to sharply limit a presi…",
    "link": "https://biztoc.com/x/4f96ea214960150a",
    "timestamp": "2025-06-09T21:37:33Z"
  },
  {
    "title": "How a little-known law became Trump’s weapon of choice against immigration",
    "description": "President Donald Trump can’t stop using — and abusing — his legal authority to block the entry of noncitizens into the country. When he issued a travel ban on citizens of Muslim-majority countries early in his first term, he did so by invoking Section 212(f) …",
    "link": "https://www.vox.com/policy/416131/trump-travel-ban-harvard-immigration-green-card",
    "timestamp": "2025-06-09T21:36:09Z"
  },
  {
    "title": "VA chief blasts rioters after LA clinic shuttered amid chaos: ‘Your actions are interfering with vets health'",
    "description": "Secretary Collins promises to reopen facility when safety can be guaranteed for veterans seeking care",
    "link": "https://www.foxnews.com/politics/va-chief-blasts-rioters-after-la-clinic-shuttered-amid-chaos",
    "timestamp": "2025-06-09T21:36:02Z"
  },
  {
    "title": "Marines will be deployed to LA to respond to immigration protests",
    "description": "Trump authorized on Monday the deployment of an additional 2,000 National Guard members to help respond to protests in Los Angeles over immigration raids, according to U.S. officials.",
    "link": "https://www.ketv.com/article/pentagon-deploys-marines-los-angeles/65015070",
    "timestamp": "2025-06-09T21:35:21Z"
  },
  {
    "title": "Marines will be deployed to LA to respond to immigration protests",
    "description": "About 700 Marines will formally deploy to LA in the coming hours to respond to immigration protests, US officials say",
    "link": "https://www.wmur.com/article/pentagon-deploys-marines-los-angeles/65015070",
    "timestamp": "2025-06-09T21:35:18Z"
  },
  {
    "title": "Trump Deploys National Guard to California Over Immigration Protests",
    "description": "Protests against the White House’s immigration policies have rocked Los Angeles.",
    "link": "http://foreignpolicy.com/2025/06/09/los-angeles-protests-trump-national-guard-newsom-immigration/",
    "timestamp": "2025-06-09T21:33:32Z"
  },
  {
    "title": "California Sues Trump Over National Guard Deployment",
    "description": "Protests against the White House’s immigration policies have rocked Los Angeles.",
    "link": "http://foreignpolicy.com/2025/06/09/los-angeles-anti-ice-protests-trump-national-guard-newsom-immigration/",
    "timestamp": "2025-06-09T21:33:28Z"
  },
  {
    "title": "What is the Insurrection Act, and what happens if Trump uses it to quell LA protests?",
    "description": "Trump was asked by ABC News if he's prepared to use the 1807 Insurrection Act to curb protests against his immigration crackdown in Los Angeles. His answer: \"It depends.\"",
    "link": "https://abcnews.go.com/Politics/insurrection-act-trump-quell-la-protests/story?id=122650690",
    "timestamp": "2025-06-09T21:31:21Z"
  },
  {
    "title": "Nintendo Is Trading Away Something That Used to Be Central to Its Identity",
    "description": "The company’s new console is here. I’m enjoying it. But it’s missing something all the others had.",
    "link": "https://slate.com/culture/2025/06/switch-2-nintendo-price-mario-kart-world-trump-tariffs.html",
    "timestamp": "2025-06-09T21:30:38Z"
  },
  {
    "title": "Billie Eilish’ Brother Finneas Says He Was Tear-Gassed During Protest",
    "description": "Finneas is standing up for what he believes in.\nBillie Eilish’ elder brother alleged that while protesting the recent raids by Immigration Customs Enforcement (ICE) in greater Los Angeles June 8,...",
    "link": "https://www.eonline.com/news/1418514/billie-eilish-brother-finneas-says-he-was-tear-gassed-during-protest",
    "timestamp": "2025-06-09T21:29:57Z"
  },
  {
    "title": "Trump Suddenly Cares About ‘Insurrectionists’ and Protecting Cops",
    "description": "Donald Trump promised retribution against those who \"disrespect\" law enforcement after pardoning hundreds of Jan. 6 rioters who assaulted cops.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-insurrectionists-protecting-cops-1235359943/",
    "timestamp": "2025-06-09T21:29:39Z"
  },
  {
    "title": "Marines Will Be Deployed to LA as Riots Continue",
    "description": "State of the Union: Trump is the first president to federalize the National Guard since Lyndon Johnson.\nThe post Marines Will Be Deployed to LA as Riots Continue appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/marines-will-be-deployed-to-la-as-riots-continue/",
    "timestamp": "2025-06-09T21:29:10Z"
  },
  {
    "title": "Trump on China Trade Talks: 'Not Easy'",
    "description": "\"We are doing well with China. China's not easy,” President Donald Trump says while telling reporters about the state of trade ...",
    "link": "https://biztoc.com/x/3a17730529558e09",
    "timestamp": "2025-06-09T21:29:05Z"
  },
  {
    "title": "Trump on Newsom: His 'primary crime is running for governor'",
    "description": "President Donald Trump on Monday accused Gov. Gavin Newsom of \"destroying\" California, after Newsom said the state would ...",
    "link": "https://biztoc.com/x/0661e1d368696543",
    "timestamp": "2025-06-09T21:29:01Z"
  },
  {
    "title": "Why Trump Sending the National Guard to LA Is Different From Its Deployment There in 1992",
    "description": "More than 30 years before Trump deployed the National Guard to Los Angeles, another President called it up to quell unrest in the same city.",
    "link": "https://time.com/7292493/trump-national-guard-la-1992-riots/",
    "timestamp": "2025-06-09T21:27:14Z"
  },
  {
    "title": "'Screeching halt': House Republicans just axed major red state cash cow",
    "description": "WASHINGTON — Clean energy manufacturers and advocates say they’re perplexed how the repeal of tax credits in President Donald Trump’s “one big beautiful bill” will keep their domestic production lines humming across the United States, particularly in states t…",
    "link": "https://www.rawstory.com/screeching-halt-house-republicans-just-axed-major-red-state-cash-cow/",
    "timestamp": "2025-06-09T21:26:31Z"
  },
  {
    "title": "Can $1,000 at birth change a child's future? A Republican proposal aims to find out",
    "description": "A House Republican proposal backed by President Donald Trump would set up tax-deferred investment accounts with $1,000 for infants born across the U.S. It builds on the concept of baby bonds, which some cities have begun introducing as a way to reduce ...",
    "link": "https://abcnews.go.com/Politics/wireStory/1000-birth-change-childs-future-republican-proposal-aims-122662584",
    "timestamp": "2025-06-09T21:26:26Z"
  },
  {
    "title": "CNN, MSNBC Called LA Riots ‘Peaceful’ 170 Times",
    "description": "CNN and MSNBC referred to riots in Los Angeles as “peaceful” 171 times since the violence broke out following a raid by ICE the DCNF learned.",
    "link": "https://dailycaller.com/2025/06/09/cnn-msnbc-called-la-riots-peaceful-171-times/",
    "timestamp": "2025-06-09T21:26:16Z"
  },
  {
    "title": "Gavin Newsom’s ‘Reckless’ Surrender of LA to Foreign National Riots",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Gavin Newsom’s ‘Reckless’ Surrender of LA to Foreign National Riots app…",
    "link": "https://www.dailysignal.com/2025/06/09/gavin-newsoms-reckless-surrender-of-la-to-foreign-national-riots/",
    "timestamp": "2025-06-09T21:25:39Z"
  },
  {
    "title": "The Man Who Attempted to Assassinate Trump Was Reportedly \"Having Conversations With Someone That Wasn’t There\"",
    "description": "Assassin's Creed The Pennsylvania man who tried to assassinate President Donald Trump last year during a campaign rally was apparently mentally unraveling in the months before the shooting, The New York Times reports, with anecdotes of him talking to himself …",
    "link": "https://futurism.com/trump-assassin-trump-thomas-crooks",
    "timestamp": "2025-06-09T21:23:52Z"
  },
  {
    "title": "America Has Theories on Whether Trump-Elon Musk Feud Is All Fake",
    "description": "Many Americans are awfully suspicious of the timing between Trump's spending bill and his feud with Musk. \nThe post America Has Theories on Whether Trump-Elon Musk Feud Is All Fake appeared first on The Root.",
    "link": "https://www.theroot.com/america-has-theories-on-whether-trump-elon-musk-feud-is-2000044549",
    "timestamp": "2025-06-09T21:22:08Z"
  },
  {
    "title": "Live: LA braces for more protests as California sues Trump administration",
    "description": "California Governor Gavin Newsom says the state will sue Donald Trump's administration after the US president deployed the National Guard to handle protests. Follow live.",
    "link": "https://www.abc.net.au/news/2025-06-10/gavin-newsom-says-file-lawsuit-la-protests-live-blog/105395844",
    "timestamp": "2025-06-09T21:21:54Z"
  },
  {
    "title": "Inside the star-studded push to save the public arts from Trump’s cuts",
    "description": "Publicly funded art programs are on the Trump administration’s chopping block, particularly the National Endowment for the Arts.",
    "link": "https://www.msnbc.com/top-stories/latest/national-endowment-arts-cuts-nea-creative-coalition-rcna211882",
    "timestamp": "2025-06-09T21:19:23Z"
  },
  {
    "title": "Gavin Newsom Slams Trump's Arrest Endorsement As 'Authoritarian'",
    "description": "\"This is a day I hoped I would never see in America,\" the California governor said on social media.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-slams-trumps-arrest-endorsement-as-authoritarian_n_684735ffe4b0c1bc4e80a063",
    "timestamp": "2025-06-09T21:18:26Z"
  },
  {
    "title": "'Authoritarian Escalation': Trump Deploys US Marines to Help Put Down LA Protests",
    "description": "As President Donald Trump deployed U.S. Marines to Los Angeles on Monday in response to protests against immigration raids and the violent arrest of a popular labor leader, California Attorney General Rob Bonta's office announced that he and Democratic Gov. G…",
    "link": "https://www.commondreams.org/news/california-ice-trump",
    "timestamp": "2025-06-09T21:17:59Z"
  },
  {
    "title": "Mexican REIT bosses drop $18M on another Acqualina condo",
    "description": "The heads of Mexico’s largest real estate investment trust, Fibra Uno, dropped $17.9 million on another condo at Sunny Isles Beach’s Estates at Acqualina. Records show Daniel Shiff sold unit TS-4205 at 17901 Collins Avenue to Estatemann South LLC, a Florida e…",
    "link": "https://therealdeal.com/miami/2025/06/09/mexican-reit-bosses-buy-another-acqualina-condo-for-18m/",
    "timestamp": "2025-06-09T21:16:17Z"
  },
  {
    "title": "Trump deploying the National Guard is part of a bigger plan (Abdallah Fayyad/Vox)",
    "description": "Abdallah Fayyad / Vox:\nTrump deploying the National Guard is part of a bigger plan  —  After protests erupted in response to federal agents raiding businesses around Los Angeles to arrest immigrants, President Donald Trump quickly decided to dump fuel on the …",
    "link": "https://www.memeorandum.com/250609/p119",
    "timestamp": "2025-06-09T21:15:00Z"
  },
  {
    "title": "Left-wing journalists back suspended Terry Moran following anti-Trump administration post",
    "description": "Terry Moran, ABC News's senior national correspondent, was suspended after he called President Donald Trump's deputy chief of staff, Stephen Miller, a “world-class hater” in a since-deleted X post.",
    "link": "https://www.washingtonexaminer.com/news/entertainment/3435503/left-wing-journalists-support-terry-moran-suspended-anti-trump-administration-post/",
    "timestamp": "2025-06-09T21:14:26Z"
  },
  {
    "title": "Log Cabin Republicans NYC to host Pride event at Trump Tower",
    "description": "President Donald Trump may not recognize Pride Month anymore. But his most famous property will host the Log Cabin Republicans of New York City’s annual “PrideRight” event in New York City.",
    "link": "https://www.advocate.com/politics/log-cabin-republicans-pride-month-trump-tower",
    "timestamp": "2025-06-09T21:13:27Z"
  },
  {
    "title": "Trump reveals the major holdup in Iran nuclear deal",
    "description": "WASHINGTON — President Trump disclosed Monday that Iran is pushing hard for the right to continue enriching uranium in any new nuclear deal — which the US “can’t have.” “They’re just asking for things that you can’t do,” Trump, 78, told reporters at the White…",
    "link": "https://nypost.com/2025/06/09/us-news/trump-reveals-the-major-holdup-in-iran-nuclear-deal/",
    "timestamp": "2025-06-09T21:12:26Z"
  },
  {
    "title": "‘We dissent’: NIH scientists sign letter criticizing Trump’s cuts in public health research",
    "description": "In his confirmation hearings to lead the National Institutes of Health, Jay Bhattacharya pledged his openness to views that might conflict with his own. “Dissent,” he said, ”is the very essence of science.”\n\n\n\nThat commitment is being put to the test.\n\n\n\nOn M…",
    "link": "https://www.fastcompany.com/91349093/nih-scientists-bethesda-declaration-trump-public-health-research",
    "timestamp": "2025-06-09T21:11:29Z"
  },
  {
    "title": "No bold new agenda: Albanese says he won’t utilise massive majority for big change",
    "description": "The prime minister will use today's address at the National Press Club to refute speculation about a radical new agenda, and Tasmania looks like it might be heading to the polls for yet another election.\nThe post No bold new agenda: Albanese says he won’t uti…",
    "link": "http://www.crikey.com.au/2025/06/10/anthony-albanese-national-press-club-jeremy-rockliff-tasmania/",
    "timestamp": "2025-06-09T21:10:49Z"
  },
  {
    "title": "Telegram boss blasts France’s ‘unprecedented’ case against him",
    "description": "The French case against Telegram is baseless, Telegram founder has told Tucker Carlson in an interview Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618873-telegram-boss-blasts-france-case/",
    "timestamp": "2025-06-09T21:10:23Z"
  },
  {
    "title": "Trump: Iran involved in Israel-Hamas hostage talks",
    "description": "After speaking to Netanyahu, President Trump reveals Iran's involvement in indirect negotiations between Israel and Hamas for a hostage release. He calls Iranians \"tough negotiators\" on a nuclear deal, citing their unacceptable demands on uranium enrichment.",
    "link": "https://www.israelnationalnews.com/news/409707",
    "timestamp": "2025-06-09T21:10:08Z"
  },
  {
    "title": "Fighting state violence from Gaza to Los Angeles",
    "description": "Israel's attacks on the Madleen aid mission to Gaza and the repression of the anti-deportation protests in Los Angeles represent the same imperial logic: any challenge to injustice will be met with state violence.",
    "link": "https://mondoweiss.net/2025/06/fighting-state-violence-from-gaza-to-los-angeles/",
    "timestamp": "2025-06-09T21:09:46Z"
  },
  {
    "title": "Newsom’s political future 'practically nonexistent' as LA devolves into riots, social media critics predict",
    "description": "Democratic Gov. Gavin Newsom's potential run for the White House in 2028 was likely thwarted by his handling of the anti-ICE riots gripping LA, conservative social media critics predict.",
    "link": "https://www.foxnews.com/politics/newsoms-political-future-practically-nonexistent-la-devolves-riots-social-media-critics-predict",
    "timestamp": "2025-06-09T21:09:19Z"
  },
  {
    "title": "Trump guts Biden-era digital identity policies, citing false claims about immigrants",
    "description": "The rollback of policies that were intended to help counter fraud comes even as the Trump administration says that fighting fraud is a top priority.",
    "link": "https://www.nextgov.com/digital-government/2025/06/trump-guts-biden-era-digital-identity-policies-citing-false-claims-about-immigrants/405935/",
    "timestamp": "2025-06-09T21:06:00Z"
  },
  {
    "title": "Johnson Urges Senate to Minimize Changes to $40,000 SALT Deal",
    "description": "House Speaker Mike Johnson said he’s pressuring Senate Republicans to refrain from changing a deal to increase the state and local tax deduction cap to $40,000, pushing back on President Donald Trump’s willingness to scale back the write-off.",
    "link": "https://financialpost.com/pmn/business-pmn/johnson-urges-senate-to-minimize-changes-to-40000-salt-deal",
    "timestamp": "2025-06-09T21:05:41Z"
  },
  {
    "title": "Bannon demands probe into Elon Musk's drug use as MAGA feud escalates",
    "description": "Steve Bannon is demanding a special counsel investigation into fellow MAGA bro Elon Musk’s federal contracts as well as his alleged drug use, The Daily Beast reported.Bannon told the podcast, \"Sunday Night with Chuck Todd,\" that there should be formal investi…",
    "link": "https://www.rawstory.com/steve-bannon-elon-musk-2672336584/",
    "timestamp": "2025-06-09T21:04:24Z"
  },
  {
    "title": "Port Traffic Plummets for Full Month Following Trump Tariff Announcement",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPort traffic has plummeted significantly since President Donald Trump announced his widespread tariffs on imports, with the Ports of Seattle and Tacoma recording lower numbers over the past month.\nFor the last…",
    "link": "https://biztoc.com/x/f01d6b010c44f49a",
    "timestamp": "2025-06-09T21:04:21Z"
  },
  {
    "title": "House Speaker says July 4 still the target for passing 'big beautiful bill'",
    "description": "House Speaker Mike Johnson still believes July 4 is a realistic target for passing President Donald Trump’s “big beautiful bill,” as Republicans in the Senate weigh changes to a package that cleared the House by just a single vote in May. \nBut Johnson, while …",
    "link": "https://biztoc.com/x/0913d7d2f645e744",
    "timestamp": "2025-06-09T21:03:57Z"
  },
  {
    "title": "Port Traffic Plummets for Full Month Following Trump Tariff Announcement",
    "description": "For the last week in May, volumes were down for the fourth consecutive week, according to the Northwest Seaport Alliance.",
    "link": "https://www.newsweek.com/port-traffic-plummetts-full-month-following-trump-tariff-announcement-2083088",
    "timestamp": "2025-06-09T21:03:32Z"
  },
  {
    "title": "Exclusive -- U.S. Attorney Bill Essayli: Gavin Newsom Needs to 'Turn on the TV'",
    "description": "U.S. Attorney for the Central District of California Bill Essayli told Breitbart News exclusively on Monday that California Gov. Gavin Newsom (D) needs to \"turn on the TV\" and pay attention to riots engulfing his city.\nThe post Exclusive — U.S. Attorney Bill …",
    "link": "https://www.breitbart.com/politics/2025/06/09/exclusive-u-s-attorney-bill-essayli-gavin-newsom-needs-to-turn-on-the-tv/",
    "timestamp": "2025-06-09T21:01:44Z"
  },
  {
    "title": "CA SUES...",
    "description": "AG Bonta says the state's sovereignty was \"trampled\" by Trump when he ordered the National Guard to the immigration protests in LA",
    "link": "https://abc7.com/post/california-gov-gavin-newsom-suing-trump-administration-national-guard-deployment/16705429/",
    "timestamp": "2025-06-09T21:00:03Z"
  },
  {
    "title": "DOGE staff fear being axed by DOGE – WSJ",
    "description": "US Department of Government Efficiency (DOGE) employees are reportedly worried about layoffs following Elon Musk’s departure Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618865-doge-musk-employees-layoffs/",
    "timestamp": "2025-06-09T20:57:15Z"
  },
  {
    "title": "'Bleachers are back!' Support for ingesting toxic chemicals explodes under Trump",
    "description": "Online communities that advocate the use of a \"toxic bleach solution\" to treat diseases like cancer, HIV, and even prevent things like autism think they have finally found an ally who will listen to them: Health and Human Services Secretary Robert F. Kennedy …",
    "link": "https://www.rawstory.com/robert-f-kennedy-jr-2672336431/",
    "timestamp": "2025-06-09T20:56:22Z"
  },
  {
    "title": "Apple unveils software redesign while reeling from AI missteps and Trump’s trade war",
    "description": "After stumbling out of the starting gate in Big Tech’s pivotal race to capitalize on artificial intelligence, Apple tried to regain its footing Monday during a developers conference that focused mostly on incremental advances and cosmetic changes in its techn…",
    "link": "https://www.pbs.org/newshour/economy/apple-unveils-software-redesign-while-reeling-from-ai-missteps-and-trumps-trade-war",
    "timestamp": "2025-06-09T20:56:11Z"
  },
  {
    "title": "Pentagon To Deploy 700 Marines To Los Angeles",
    "description": "The number of National Guard troops is expected to rise to 2,000 by Wednesday and until then, the Marines are expected to provide support.",
    "link": "https://www.huffpost.com/entry/marines-deployed-los-angeles-protests-ice_n_684748cde4b07d60ea7431fb",
    "timestamp": "2025-06-09T20:56:10Z"
  },
  {
    "title": "JD Vance sheds light on Trump-Musk feud in interview with Theo Von",
    "description": "Vice President JD Vance responded to the disagreement between Elon Musk and President Donald Trump as it broke out during his interview with comedian Theo Von last week. Vance had hinted that he would talk about the Trump-Musk feud when he posted a joke about…",
    "link": "https://www.theblaze.com/news/vance-trump-musk-theo-von",
    "timestamp": "2025-06-09T20:55:00Z"
  },
  {
    "title": "Republicans focus on trans athletes in their early attacks against Jon Ossoff in Georgia",
    "description": "Republicans seeking to unseat Georgia Sen.",
    "link": "https://www.nbcnews.com/politics/2026-election/republicans-focus-trans-athletes-early-attacks-jon-ossoff-georgia-rcna211005",
    "timestamp": "2025-06-09T20:54:46Z"
  },
  {
    "title": "Debunking rumor that Elon Musk said he 'took' Stephen Miller's wife in X post",
    "description": "A screenshot authentically shows an X post from Elon Musk in June 2025 that said, \"Just like I took your wife,\" in response to an X post from Stephen Miller that said, \"We will take back America.\"",
    "link": "https://www.snopes.com//fact-check/musk-stephen-miller-wife-post/",
    "timestamp": "2025-06-09T20:51:00Z"
  },
  {
    "title": "Republican lawmakers back Trump administration in the heat of Los Angeles riots (Ally Goelz/Washington Examiner)",
    "description": "Ally Goelz / Washington Examiner:\nRepublican lawmakers back Trump administration in the heat of Los Angeles riots  —  Congressional Republicans took to social media to support President Donald Trump's efforts to stop the Los Angeles riots.  —  Protests erupte…",
    "link": "https://www.memeorandum.com/250609/p113",
    "timestamp": "2025-06-09T20:50:00Z"
  },
  {
    "title": "Trump Says He’d Arrest Gavin Newsom",
    "description": "Donald Trump endorsed the arrest of California governor Gavin Newsom as he and the state’s attorney general, Rob Bonta, announced plans to sue over Trump’s deployment of the National Guard.",
    "link": "http://nymag.com/intelligencer/article/trump-says-hed-arrest-california-governor-gavin-newsom.html",
    "timestamp": "2025-06-09T20:49:20Z"
  },
  {
    "title": "Trump says Iran counter-proposal 'not acceptable' as negotiations continue",
    "description": "Trump discusses Iran negotiations with Netanyahu, says US is \"trying to make a deal\" to avoid conflict while UN nuclear watchdog expresses concerns about Tehran's nuclear program",
    "link": "https://www.foxnews.com/world/trump-rejects-irans-counter-proposal-nuclear-negotiations-its-just-not-acceptable",
    "timestamp": "2025-06-09T20:48:31Z"
  },
  {
    "title": "U.S. State Department resumes processing Harvard student visas after judge's ruling",
    "description": "The U.S. State Department directed all U.S. missions abroad and consular sections to resume processing Harvard University student and exchange visitor visas after a federal judge in Boston last week temporarily blocked President Donald Trump's ban on foreign …",
    "link": "https://japantoday.com/category/world/us-state-dept-resumes-processing-harvard-student-visas-after-judge%27s-ruling",
    "timestamp": "2025-06-09T20:46:34Z"
  },
  {
    "title": "As Trump’s new travel ban begins, some visitors report extra scrutiny at U.S. airports",
    "description": "President Donald Trump's new ban on travel to the U.S. by citizens from a dozen countries took effect Monday with relative calm, as some travelers with valid visas reported extra scrutiny at American airports before being allowed entry.",
    "link": "https://www.pbs.org/newshour/politics/as-trumps-new-travel-ban-begins-some-visitors-report-extra-scrutiny-at-u-s-airports",
    "timestamp": "2025-06-09T20:45:45Z"
  },
  {
    "title": "Trump Sending In The Marines As Newsom Sues Over “Illegal Order” To Deploy National Guard In LA Over ICE Protests",
    "description": "The streets of Los Angeles are calmer today after a weekend of ICE raids, protests, police actions and Donald Trump’s federalization of the California National Guard over the objections of Gov. Gavin Newsom. However, as Newsom sues Trump over his “illegal ord…",
    "link": "http://deadline.com/2025/06/trump-marines-gavin-newsom-national-guard-la-ice-protests-1236428432/",
    "timestamp": "2025-06-09T20:45:37Z"
  },
  {
    "title": "Judge blocks administration from enforcing anti-diversity and anti-transgender executive orders",
    "description": "A federal judge in California has blocked the Trump administration from enforcing anti-diversity and anti-transgender executive orders that LGBTQ+ rights organizations say are unconstitutional.",
    "link": "https://www.kpbs.org/news/politics/2025/06/09/judge-blocks-administration-from-enforcing-anti-diversity-and-anti-transgender-executive-orders",
    "timestamp": "2025-06-09T20:45:28Z"
  },
  {
    "title": "Apple plays it safe on AI despite Wall Street pressure",
    "description": "Apple on Monday remained on its cautious path to embracing generative AI even as rivals race ahead with the technology and Wall Street expresses doubts over its strategy. The pressure was on Apple not to disappoint at its annual Worldwide Developers Conferenc…",
    "link": "https://japantoday.com/category/tech/apple-plays-it-safe-on-ai-despite-wall-street-pressure",
    "timestamp": "2025-06-09T20:45:00Z"
  },
  {
    "title": "EXCLUSIVE: ‘Absolute Disgusting Lie’ — California Sheriff Rips Democrats Blaming Trump For LA Riots",
    "description": "Riverside County Sheriff and Republican gubernatorial candidate Chad Bianco slammed Democratic efforts to blame Trump.",
    "link": "https://dailycaller.com/2025/06/09/california-chad-bianco-democrats-trump-la-riots-kamala-harris-gavin-newsom/",
    "timestamp": "2025-06-09T20:41:59Z"
  },
  {
    "title": "DEEP STATE ACTOR? Former Schiff Committee Staffer Took ‘Career’ Role in Federal Bureaucracy",
    "description": "A former FBI analyst who spent two years advising then-Rep. Adam Schiff while Schiff pushed the Trump-Russia narrative and led the first Trump impeachment subsequently... Read More\nThe post DEEP STATE ACTOR? Former Schiff Committee Staffer Took ‘Career’ Role …",
    "link": "https://www.dailysignal.com/2025/06/09/deep-state-actor-former-schiff-committee-staffer-took-career-role-federal-bureaucracy/",
    "timestamp": "2025-06-09T20:41:53Z"
  },
  {
    "title": "Paramount Chief Financial Officer Naveen Chopra to Exit",
    "description": "He will be replaced in the interim by former Discovery Communications CFO Andrew Warren\nThe post Paramount Chief Financial Officer Naveen Chopra to Exit appeared first on TheWrap.",
    "link": "https://www.thewrap.com/paramount-chief-financial-officer-naveen-chopra-exit/",
    "timestamp": "2025-06-09T20:41:50Z"
  },
  {
    "title": "DOJ Brings Kilmar Abrego Garcia Back to the U.S. After Insisting It Couldn't",
    "description": "Kilmar Abrego Garcia returned to the U.S. to appear in court on Friday, more than two months after being deported to a prison in El Salvador, the country",
    "link": "https://reason.com/2025/06/09/doj-brings-kilmar-abrego-garcia-back-to-the-u-s-after-insisting-it-couldnt/",
    "timestamp": "2025-06-09T20:41:48Z"
  },
  {
    "title": "Trump deploying the National Guard is part of a bigger plan",
    "description": "California National Guard troops in downtown Los Angeles.﻿ | Jason Almond/Los Angeles Times via Getty Images\nAfter protests erupted in response to federal agents raiding businesses around Los Angeles to arrest immigrants, President Donald Trump quickly decide…",
    "link": "https://biztoc.com/x/0a175c6becf21fe4",
    "timestamp": "2025-06-09T20:41:40Z"
  },
  {
    "title": "Fingers crossed! Talks to avoid recession begin",
    "description": "U.S. stocks drifted through a quiet Monday as the world's two largest economies began talks on trade that could help avoid a recession.",
    "link": "https://www.bostonherald.com/2025/06/09/fingers-crossed-talks-to-avoid-recession-begin/",
    "timestamp": "2025-06-09T20:41:30Z"
  },
  {
    "title": "Trump Confirms Musk-Bessent Argument, Denies Fight: ‘Didn’t See a Lot of Physicality’",
    "description": "The president appears to be moving past his high-profile verbal battle with Musk, saying on Monday he wishes the Tesla boss \"very well\" \nThe post Trump Confirms Musk-Bessent Argument, Denies Fight: ‘Didn’t See a Lot of Physicality’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-confirm-elon-musk-scott-bessent-argument-denies-fight/",
    "timestamp": "2025-06-09T20:40:40Z"
  },
  {
    "title": "LA Protesters Aren’t Inviting Violent Authoritarianism, They’re Mobilizing to Stop It",
    "description": "Adam Schiff and centrist concern trolls have is completely backwards: Trump’s immigration crackdown is the source of pervasive violence.\nThe post LA Protesters Aren’t Inviting Violent Authoritarianism, They’re Mobilizing to Stop It appeared first on The Inter…",
    "link": "https://theintercept.com/2025/06/09/la-protests-ice-national-guard-trump-adam-schiff/",
    "timestamp": "2025-06-09T20:39:32Z"
  },
  {
    "title": "MANOSPHERE MELTOWN!",
    "description": "In which the world’s richest man gets marginalized, and right-wingers choose their daddy.",
    "link": "https://www.wonkette.com/p/manosphere-meltown",
    "timestamp": "2025-06-09T20:37:36Z"
  },
  {
    "title": "Cole Escola References Nicole Scherzinger Hat Drama After Tonys",
    "description": "Cole Escola References Nicole Scherzinger Hat Drama After Tonyshuffpost.com",
    "link": "https://www.huffpost.com/entry/cole-escola-nicole-scherzinger-tonys-hat-controversy_n_68472c5be4b0c07e517989bb",
    "timestamp": "2025-06-09T20:36:48Z"
  },
  {
    "title": "Brother of AG Pam Bondi and a former Ed Martin aide lose bid to take over DC Bar",
    "description": "Bradley Bondi, the brother of Attorney General Pam Bondi, overwhelmingly lost his bid to be the next president of the DC Bar in a closely watched election that drew national attention, the organization announced Monday.",
    "link": "https://www.cnn.com/2025/06/09/politics/bradley-bondi-dc-bar",
    "timestamp": "2025-06-09T20:36:22Z"
  },
  {
    "title": "Trump Asked Why He Thinks He Can Arrest Gavin Newsom — Says He Committed ‘Crime’ of ‘Running For Governor’",
    "description": "Trump was fielding questions from the media in the State Dining Room at the White House when a reporter asked about threats to arrest Newsom.\nThe post Trump Asked Why He Thinks He Can Arrest Gavin Newsom — Says He Committed ‘Crime’ of ‘Running For Governor’ f…",
    "link": "https://www.mediaite.com/media/tv/trump-asked-why-he-thinks-he-can-arrest-gavin-newsom-says-he-committed-crime-of-running-for-governor/",
    "timestamp": "2025-06-09T20:36:11Z"
  },
  {
    "title": "Elon Musk Responds to Drug Abuse Rumors",
    "description": "Elon Musk is responding to unconfirmed speculation that he’s on drugs. During a Q&A with Donald Trump, the President was asked about the rumors. When asked if he thought Musk ever had drugs at the White House, Trump responded, “I really don’t know. I don’t th…",
    "link": "https://www.justjared.com/2025/06/09/elon-musk-responds-to-drug-abuse-rumors/",
    "timestamp": "2025-06-09T20:35:47Z"
  },
  {
    "title": "Downtown Houston No Kings immigration protest to counter military parade on Trump’s 79th birthday",
    "description": "A large protest is being planned in Houston that is expected to counter a military parade for the 250th anniversary of the U.S. Army and President Donald Trump’s 79th birthday this weekend.",
    "link": "https://www.click2houston.com/news/local/2025/06/09/downtown-houston-no-kings-immigration-protest-to-counter-military-parade-on-trumps-79th-birthday/",
    "timestamp": "2025-06-09T20:35:04Z"
  },
  {
    "title": "Trump Admin Deploying 700 Marines to Los Angeles Amid Riots",
    "description": "U.S. military sends 700 Marines to support National Guard operations in Los Angeles amid immigration protests.",
    "link": "https://www.newsweek.com/trump-admin-deploying-700-marines-los-angeles-amid-riots-2083113",
    "timestamp": "2025-06-09T20:34:30Z"
  },
  {
    "title": "Podcast: Trump Has Meltdown at WH Lawn and Loses It on CA Gov",
    "description": "On arresting Gavin Newsom (for what?), Donald Trump says, \"I would do it, I think it's great. Gavin likes the publicity. But I think it would be great.\" MeidasTouch host Ben Meiselas reports on Donald Trump’s meltdown on the White House lawn where he threaten…",
    "link": "https://littlegreenfootballs.com/article/54670_Podcast-_Trump_Has_Meltdown_at",
    "timestamp": "2025-06-09T20:32:00Z"
  },
  {
    "title": "Trump Says Gavin Newsom and Karen Bass Are Lying to Californians About What's Happening in LA",
    "description": "Trump Says Gavin Newsom and Karen Bass Are Lying to Californians About What's Happening in LAwesternjournal.com",
    "link": "https://www.westernjournal.com/trump-says-gavin-newsom-karen-bass-lying-californians-happening-la/",
    "timestamp": "2025-06-09T20:31:56Z"
  },
  {
    "title": "BREAKING: 500 US Marines Mobilized in Response to Violent Anti-ICE Riots in Downtown Los Angeles",
    "description": "About 500 US Marines have been mobilized in response to the violent Los Angeles riots, according to CNN.\nThe post BREAKING: 500 US Marines Mobilized in Response to Violent Anti-ICE Riots in Downtown Los Angeles appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/breaking-500-us-marines-mobilized-response-violent-los/",
    "timestamp": "2025-06-09T20:30:30Z"
  },
  {
    "title": "Donald Trump Weighs In on 'Civil War' Concerns",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Monday, President Donald Trump was asked about Democratic California Governor Gavin Newsom's remarks that his Republican administration wants \"civil war on the streets\" amid ongoing protests against raids b…",
    "link": "https://biztoc.com/x/ed833c944c090e2c",
    "timestamp": "2025-06-09T20:30:18Z"
  },
  {
    "title": "Biden’s Pentagon Spox Admits Trump Has Legal Authorization To Send National Guard To LA",
    "description": "Former Pentagon spokeswoman Sabrina Singh said that President Donald Trump is legally authorized to deploy the National Guard to handle the Los Angeles riots.",
    "link": "https://dailycaller.com/2025/06/09/biden-pentagon-spox-trump-legal-national-guard-los-angeles/",
    "timestamp": "2025-06-09T20:30:16Z"
  }
]