[
  {
    "title": "Tom Cotton Torches Judges Who Dared Rule Against Trump",
    "description": "Republican lawmakers are going after the judicial branch, claiming that the legal appointees are attempting to usurp Donald Trump’s power for merely ruling against the president’s agenda.\r\n“These far-left Resistance™ district court judges are under the impres…",
    "link": "https://newrepublic.com/post/192833/tom-cotton-fox-judges-donald-trump",
    "timestamp": "2025-03-17T18:56:54Z"
  },
  {
    "title": "Prince Harry: Deadline looms for Homeland Security to release visa records",
    "description": "A US judge ordered the prince's immigration record to be made public after a think tank alleged he lied about past drug use.",
    "link": "https://www.bbc.co.uk/news/articles/c3w13w757lgo",
    "timestamp": "2025-03-17T18:56:44Z"
  },
  {
    "title": "Prince Harry's US visa records must be released, judge rules",
    "description": "A US-based think tank alleged the Duke of Sussex lied to immigration officers about his past drug use.",
    "link": "https://www.bbc.com/news/articles/c3w13w757lgo",
    "timestamp": "2025-03-17T18:56:44Z"
  },
  {
    "title": "Don Jr. Reminds Us He’s Dating Someone, Too",
    "description": "Donald Trump Jr. and his girlfriend, Bettina Anderson, stepped out for a Palm Beach gala amid rumors his ex-wife, Vanessa Trump, is dating Tiger Woods.",
    "link": "http://www.thecut.com/article/don-jr-and-bettina-anderson-pop-up-amid-tiger-woods-rumors.html",
    "timestamp": "2025-03-17T18:56:42Z"
  },
  {
    "title": "US paid El Salvador to take Venezuelan Tren de Aragua members: 'pennies on the dollar,' White House says",
    "description": "The U.S. is paying El Salvador $6 million to take in illegal migrants linked to the Venezuelan Tren de Aragua gang, the White House said Monday.",
    "link": "https://www.foxnews.com/politics/us-paid-el-salvador-take-venezuelan-tren-de-aragua-members-pennies-dollar-white-house-says",
    "timestamp": "2025-03-17T18:56:22Z"
  },
  {
    "title": "Allies Cancel Orders of F-35s, the Fighter Jets That Will Cost $2 Trillion",
    "description": "So far, President Donald Trump's second term in office has been characterized by antagonism to allied nations. In just two months, Trump has shown hostility to the NATO defense alliance while gleefully pursuing a trade war against Canada and Mexico by imposin…",
    "link": "https://biztoc.com/x/e20c5ef0b8cc297b",
    "timestamp": "2025-03-17T18:56:08Z"
  },
  {
    "title": "Foreign CEOs to flock to China for key summit, Xi meeting, sources say",
    "description": "Dozens of foreign CEOs, including leaders from FedEx, Siemens, BMW, and Mercedes-Benz, will attend the China Development Forum in Beijing on March 23-24. The conference aims to attract foreign investment amidst geopolitical tensions. President Xi may meet sel…",
    "link": "https://economictimes.indiatimes.com/news/international/business/foreign-ceos-to-flock-to-china-for-key-summit-xi-meeting-sources-say/articleshow/119129172.cms",
    "timestamp": "2025-03-17T18:55:55Z"
  },
  {
    "title": "These Federal Staffers Will Be Rehired As Appeals Court Rules Against Trump Administration’s Mass Firings",
    "description": "The order affects workers at six federal agencies, plus workers who had already been granted relief through an earlier ruling.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/17/these-federal-staffers-will-be-rehired-as-appeals-court-rules-against-trump-administrations-mass-firings/",
    "timestamp": "2025-03-17T18:55:21Z"
  },
  {
    "title": "The market heads for back to back gains — plus, rumors hitting our newest stock",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/03/17/the-market-heads-for-back-to-back-gains-plus-rumors-hitting-our-newest-stock.html",
    "timestamp": "2025-03-17T18:54:57Z"
  },
  {
    "title": "ECB official claims Trump’s pro-crypto stance could trigger financial turbulence",
    "description": "A senior European Central Bank (ECB) official said that President Donald Trump’s aggressive push for crypto adoption could fuel financial instability and urged EU policymakers to strengthen their regulatory stance to mitigate potential fallout. François Ville…",
    "link": "https://cryptoslate.com/ecb-official-claims-trumps-pro-crypto-stance-could-trigger-financial-turbulence/",
    "timestamp": "2025-03-17T18:54:39Z"
  },
  {
    "title": "We've never been closer to a Ukraine peace deal, White House says ahead of Trump-Putin talks",
    "description": "Summary The White House says \"we've never been closer to peace than at this moment\" ahead of Donald Trump and Vladimir Putin holding talks on Ukraine on Tuesday Trump says he and Putin will discuss \"land\", \"power plants\" and \"dividing up certain assets\", whil…",
    "link": "https://freerepublic.com/focus/f-news/4304886/posts",
    "timestamp": "2025-03-17T18:54:38Z"
  },
  {
    "title": "Map Shows Australia's Rare Earth Deposits as Tariff Battle Escalates",
    "description": "Australia's substantial mineral wealth provides it potential leverage in ongoing trade negotiations with the Trump administration.",
    "link": "https://www.newsweek.com/map-australia-rare-earth-reserves-trump-tariffs-2046027",
    "timestamp": "2025-03-17T18:54:07Z"
  },
  {
    "title": "‘His Miserable Life Was Terminated’: US Military Strikes ISIS No. 2 Terrorist Leader Abdallah Makki Muslih al-Rifai",
    "description": "A U.S.-led coalition airstrike killed the second-highest-ranking leader of the Islamic State of Iraq and al-Sham (ISIS) Thursday, officials revealed hours before President Donald Trump announced additional targets. The U.S. Central Command (CENTCOM) said its …",
    "link": "https://freerepublic.com/focus/f-news/4304884/posts",
    "timestamp": "2025-03-17T18:53:02Z"
  },
  {
    "title": "The Alien Enemies Act: What to know about a 1798 law that Trump has invoked for deportations",
    "description": "The U.S. deported hundreds of immigrants after Trump invoked the act for the first time since World War II.",
    "link": "https://www.bostonherald.com/2025/03/17/what-is-the-alien-enemies-act/",
    "timestamp": "2025-03-17T18:52:30Z"
  },
  {
    "title": "The Alien Enemies Act: What to know about a 1798 law that Trump has invoked for deportations",
    "description": "The U.S. deported hundreds of immigrants after Trump invoked the act for the first time since World War II.",
    "link": "https://www.denverpost.com/2025/03/17/what-is-the-alien-enemies-act/",
    "timestamp": "2025-03-17T18:52:30Z"
  },
  {
    "title": "White House press secretary says Statue of Liberty going nowhere, replies to French politician",
    "description": "White House press secretary Karoline Leaviitt reminded a French politician who wants the Statue of Liberty back that the U.S. saved him from Nazi Germany.",
    "link": "https://www.foxnews.com/politics/white-house-press-secretary-says-statue-liberty-going-nowhere-replies-french-politician",
    "timestamp": "2025-03-17T18:52:30Z"
  },
  {
    "title": "Boeing Starliner astronauts finally head home, nine months later",
    "description": "Eight days. That’s how long Boeing Starliner’s mission — its first flight test with crew aboard — was supposed to last. But this mission has been singular in almost every way, and astronauts Butch Wilmore and Suni Williams have instead spent the past nine and…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176754469",
    "timestamp": "2025-03-17T18:52:10Z"
  },
  {
    "title": "Not only jobs report; here are other indicators that signal America is heading for a recession",
    "description": "Trade tariffs, government layoffs, funding cuts, and immigration restrictions in the US are generating economic uncertainty, potentially leading to a recession. Business leaders and consumers are losing confidence, affecting investments, hiring, and spending.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/not-only-jobs-report-here-are-other-indicators-that-signal-america-is-heading-for-a-recession/articleshow/119127746.cms",
    "timestamp": "2025-03-17T18:50:07Z"
  },
  {
    "title": "Remember When Biden Bragged About Defying SCOTUS And Corporate Media Shrugged?",
    "description": "The glaring double standard is part of a calculated effort by the media to peddle the phony narrative that Trump is an authoritarian threat.",
    "link": "https://thefederalist.com/2025/03/17/remember-when-biden-bragged-about-defying-scotus-and-corporate-media-shrugged/",
    "timestamp": "2025-03-17T18:48:44Z"
  },
  {
    "title": "Fox News Anchor Confronts Pro-Trump Senator With Brutal Forecast: ‘Does Not Sound Like a Manufacturing Boom’",
    "description": "Jacqui Heinrich confronted Sen. Bernie Moreno (R-OH) with a brutal forecast on the effect of President Donald Trump's trade policies.\nThe post Fox News Anchor Confronts Pro-Trump Senator With Brutal Forecast: ‘Does Not Sound Like a Manufacturing Boom’ first a…",
    "link": "https://www.mediaite.com/news/fox-news-anchor-confronts-pro-trump-senator-with-brutal-forecast-does-not-sound-like-a-manufacturing-boom/",
    "timestamp": "2025-03-17T18:47:40Z"
  },
  {
    "title": "Russian-occupied Zaporizhzhia nuclear plant part of peace talks, Trump says",
    "description": "Washington has discussed with Ukraine the control of the Russian-occupied Zaporizhzhia Nuclear Power Plant as part of a potential peace deal, U.S. President Donald Trump said on March 13. Trump's remarks come days after Kyiv agreed to a 30-day ceasefire propo…",
    "link": "https://freerepublic.com/focus/f-chat/4304882/posts",
    "timestamp": "2025-03-17T18:46:05Z"
  },
  {
    "title": "XRP’s role in US Digital Asset Stockpile raises questions on token utility — Does it belong?",
    "description": "Ripple’s XRP (XRP), the third-largest cryptocurrency by market cap, gained national recognition after President Donald Trump mentioned the “valuable cryptocurrency” alongside BTC, ETH, SOL, and ADA as part of a planned US strategic crypto reserve. Trump’s exe…",
    "link": "https://cointelegraph.com/news/xrp-s-role-in-us-digital-asset-stockpile-raises-questions-on-token-utility-does-it-belong",
    "timestamp": "2025-03-17T18:45:00Z"
  },
  {
    "title": "House Republicans Zero In On 26 ‘Vulnerable’ Democratic Incumbents",
    "description": "Twenty-six House Democrats have been deemed \"vulnerable\" in the 2026 midterm elections by the National Republican Congressional Committee (NRCC).",
    "link": "https://dailycaller.com/2025/03/17/house-republicans-democratic-incumbents/",
    "timestamp": "2025-03-17T18:44:54Z"
  },
  {
    "title": "Chuck Schumer postpones book tour amid liberal criticism over spending vote",
    "description": "Some liberal groups had planned to stage protests.",
    "link": "https://www.bostonherald.com/2025/03/17/chuck-schumer-postpones-book-tour/",
    "timestamp": "2025-03-17T18:44:51Z"
  },
  {
    "title": "WH Press Secretary Karoline Leavitt's response to French politician demanding the return of the Statue of Liberty",
    "description": "OMG...MIC DROP. DOOCY: There is now a member of the European Parliament from France who does not think The US represents the values of the Statue of Liberty anymore. They want the Statue of Liberty back. So is President Trump going to send the Statue of Liber…",
    "link": "https://freerepublic.com/focus/f-bloggers/4304880/posts",
    "timestamp": "2025-03-17T18:44:26Z"
  },
  {
    "title": "What is an autopen and why is Trump talking about this signature-making machine?",
    "description": "Trump alleges that pardons by Biden are \"void\" because he used an autopen to sign off on them.",
    "link": "https://nationalpost.com/news/world/what-is-an-autopen",
    "timestamp": "2025-03-17T18:44:21Z"
  },
  {
    "title": "Donald Trump Jr. and Bettina Anderson Put Their Romance on Display, on the Heels of His Ex-Wife's Romance News",
    "description": "Vanessa Trump and Tiger Woods made headlines last week, but elder sons are not ones to be outdone. Ergo, the Junior appeared with his Palm Beach socialite girlfriend.",
    "link": "https://www.vanityfair.com/style/story/donald-trump-jr-girlfriend-tiger-woods-bettina-anderson-vanessa-trump",
    "timestamp": "2025-03-17T18:43:50Z"
  },
  {
    "title": "Why Americans care so much about eggs prices – and how this issue got so political",
    "description": "The escalating price of eggs has become a major political issue for the Trump government, and it doesn’t look like it’s going away.",
    "link": "https://theconversation.com/why-americans-care-so-much-about-eggs-prices-and-how-this-issue-got-so-political-251752",
    "timestamp": "2025-03-17T18:43:47Z"
  },
  {
    "title": "Why Americans care so much about egg prices – and how this issue got so political",
    "description": "The escalating price of eggs has become a major political issue for the Trump government, and it doesn’t look like it’s going away.",
    "link": "https://theconversation.com/why-americans-care-so-much-about-egg-prices-and-how-this-issue-got-so-political-251752",
    "timestamp": "2025-03-17T18:43:47Z"
  },
  {
    "title": "Trump shrugs off stock market slump, but economic warning signs loom",
    "description": "US stock market left reeling after Trump’s ‘chaotic’ trade agenda prompts downturn in economic outlook.",
    "link": "https://theconversation.com/trump-shrugs-off-stock-market-slump-but-economic-warning-signs-loom-251988",
    "timestamp": "2025-03-17T18:43:44Z"
  },
  {
    "title": "US: White House denies flouting court order on deportations",
    "description": "The White House said it was acting within the \"confines of the law\" after carrying out deportations of immigrants it says are members of a Venezuelan gang. A judge had ordered a block to those deportation flights.",
    "link": "https://www.dw.com/en/us-white-house-denies-flouting-court-order-on-deportations/live-71952411",
    "timestamp": "2025-03-17T18:42:00Z"
  },
  {
    "title": "Allies Cancel Orders of F-35s, the Fighter Jets That Will Cost $2 Trillion",
    "description": "So far, President Donald Trump's second term in office has been characterized by antagonism to allied nations. In just two months, Trump has shown",
    "link": "https://reason.com/2025/03/17/allies-cancel-orders-of-f-35s-the-fighter-jets-that-will-cost-2-trillion/",
    "timestamp": "2025-03-17T18:41:45Z"
  },
  {
    "title": "Why Greg Abbott Is Closing a Texas Jail",
    "description": "The Jim Hogg County booking facility was opened in 2022 as part of the governor's own border control operation.",
    "link": "https://www.newsweek.com/texas-immigrant-booking-center-closing-trump-administration-2046066",
    "timestamp": "2025-03-17T18:41:40Z"
  },
  {
    "title": "'Failed group of incompetents': Trump uses plight of stuck astronauts to shame Biden",
    "description": "President Donald Trump posted on Truth Social Monday that former President Joe Biden is to blame for the astronauts who have been stuck in space for nine months. \"I just spoke with the Acting Administrator of NASA, Janet Petro. She is coordinating our Team of…",
    "link": "https://www.rawstory.com/trump-nasa-2671343322/",
    "timestamp": "2025-03-17T18:41:36Z"
  },
  {
    "title": "Smart about smartphones: India must act fast to retain electronics trade advantage amid US tariff shift",
    "description": "The US has imposed a 20% tariff on Chinese goods, offering India a chance to become a key supplier in the electronics market. However, reciprocal tariffs by the US on Indian exports could shift investments to Vietnam. Fast-tracking tariff reductions and secur…",
    "link": "https://m.economictimes.com/opinion/et-commentary/smart-about-smartphones-india-must-act-fast-to-retain-electronics-trade-advantage-amid-us-tariff-shift/articleshow/119128810.cms",
    "timestamp": "2025-03-17T18:40:52Z"
  },
  {
    "title": "Robinhood shares up 8% after launching betting markets hub",
    "description": "Robinhood has launched a betting markets hub as the online brokerage — best known for stock trading — expands its presence in emergent asset classes, including cryptocurrencies and event contracts, according to a March 17 announcement. Robinhood’s stock, HOOD…",
    "link": "https://cointelegraph.com/news/robinhood-launches-betting-markets-hub",
    "timestamp": "2025-03-17T18:40:00Z"
  },
  {
    "title": "Police: Second Man Assisted Transgender in Tesla Dealership Arson Attack",
    "description": "A 24-year-old man from Fort Collins, Colorado, has been arrested on suspicion of arson and other charges related to a fire at a Tesla dealership in Loveland, following the earlier arrest of a man who claims to be a woman in the case. \nThe post Police: Second …",
    "link": "https://www.breitbart.com/tech/2025/03/17/police-second-man-assisted-transgender-in-tesla-dealership-arson-attack/",
    "timestamp": "2025-03-17T18:39:22Z"
  },
  {
    "title": "Trump warns Iran will be ‘held responsible’ for Houthi attacks from Yemen",
    "description": "The president has escalated his rhetoric against Iran, in the wake of a weekend of US attacks on Houthi sites in Yemen.",
    "link": "https://www.aljazeera.com/news/2025/3/17/trump-warns-iran-will-be-held-responsible-for-houthi-attacks-from-yemen",
    "timestamp": "2025-03-17T18:38:19Z"
  },
  {
    "title": "Republicans launch bid to make 'Trump Derangement Syndrome' an official mental illness",
    "description": "Republican lawmakers have launched a bid to have 'Trump Derangement Syndrome' considered a real mental illness. The group of GOP senators in Minnesota filed a bill that would classify the term as an official disorder. Their proposal details how Trump Derangem…",
    "link": "https://freerepublic.com/focus/f-chat/4304878/posts",
    "timestamp": "2025-03-17T18:37:56Z"
  },
  {
    "title": "Who are the NASA astronauts who have been stuck in space for 9 months?",
    "description": "NASA's stuck astronauts are heading home now that a replacement crew has arrived at the International Space Station.",
    "link": "https://www.clickorlando.com/tech/2025/03/17/who-are-the-nasa-astronauts-who-have-been-stuck-in-space-for-9-months/",
    "timestamp": "2025-03-17T18:37:47Z"
  },
  {
    "title": "Republican bill would classify 'Trump derangement' as a mental illness in Minnesota",
    "description": "Senate Republicans are seeking to define “Trump Derangement Syndrome” in Minnesota statute as the “acute onset paranoia” related to Trump policies.",
    "link": "https://www.inforum.com/news/minnesota/republican-bill-would-classify-trump-derangement-as-a-mental-illness-in-minnesota",
    "timestamp": "2025-03-17T18:37:43Z"
  },
  {
    "title": "PM Modi speaking in Trump's language on Global bodies, claims Congress",
    "description": "Congress accused PM Modi of aligning with President Trump's rhetoric that international organizations like the UN have become irrelevant. Congress spokesperson Jairam Ramesh argued that such institutions have significantly benefitted India and that they requi…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/pm-modi-speaking-in-trumps-language-on-global-bodies-claims-congress/articleshow/119128695.cms",
    "timestamp": "2025-03-17T18:36:44Z"
  },
  {
    "title": "India weighs lower tariffs for US medical devices amid trade talks",
    "description": "The Indian government is considering lowering tariffs on US medical devices to mitigate potential US tariff threats on Indian exports. While this aims to ease trade tensions, industry experts express concerns about the impact on India's self-reliance. Stakeho…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/healthcare/india-weighs-lower-tariffs-for-us-medical-devices-amid-trade-talks/articleshow/119128692.cms",
    "timestamp": "2025-03-17T18:36:40Z"
  },
  {
    "title": "Who is James Boasberg, the US judge at the center of Trump's deportation efforts?",
    "description": "Judge James Boasberg blocked Trump’s use of the Alien Enemies Act to deport Venezuelan migrants, fueling a legal battle. Trump’s border czar vows mass deportations will continue.",
    "link": "https://www.foxnews.com/politics/who-james-boasberg-us-judge-center-trump-deportation-efforts",
    "timestamp": "2025-03-17T18:36:06Z"
  },
  {
    "title": "The Ultimate Trump Story",
    "description": "The president’s dangerous tendencies are now magnifying one another in a uniquely risky way.",
    "link": "https://www.theatlantic.com/politics/archive/2025/03/trump-alien-enemies-act/682068/",
    "timestamp": "2025-03-17T18:35:47Z"
  },
  {
    "title": "Will Bitcoin Go Up If Donald Trump Eliminates Income Tax For Americans Making Less Than $150,000?",
    "description": "President Donald Trump's tax reduction plans, paired with his aggressive tariff policies, have significantly disrupted the cryptocurrency market, prompting heightened volatility and an ETF-driven sell-off in Bitcoin (CRYPTO: BTC) over the past weeks.\nDonald T…",
    "link": "https://biztoc.com/x/e8260bd44bc909fd",
    "timestamp": "2025-03-17T18:34:05Z"
  },
  {
    "title": "European shares close higher courtesy of energy and healtcare",
    "description": "The pan-European Stoxx 600 index rose 0.8 per cent as Irish market trades light on St Patrick’s Day",
    "link": "https://www.irishtimes.com/business/2025/03/17/european-shares-close-higher-courtesy-of-energy-and-healtcare/",
    "timestamp": "2025-03-17T18:31:40Z"
  },
  {
    "title": "Facing Calls to Resign for Caving to Trump and GOP, Schumer Postpones Book Tour",
    "description": "Senate Minority Leader Chuck Schumer has opted to postpone events promoting his \nforthcoming book amid sustained outrage over his decision to back a Republican-authored government funding plan that bolsters President Donald Trump's lawless assault on federal …",
    "link": "https://www.commondreams.org/news/schumer-book-tour",
    "timestamp": "2025-03-17T18:31:35Z"
  },
  {
    "title": "'Danish Viking blood is boiling.' Danes boycott US goods with fervor as others in Europe do so too",
    "description": "Consumers across Europe furious over President Donald Trump’s policies are boycotting U.S. goods",
    "link": "https://abcnews.go.com/Business/wireStory/danish-viking-blood-boiling-danes-boycott-us-goods-119879965",
    "timestamp": "2025-03-17T18:30:35Z"
  },
  {
    "title": "Ukraine and Russia have conditions that could affect a ceasefire. What are they willing to concede?",
    "description": "A ceasefire in Russia’s 3-year-old war in Ukraine hinges on Moscow accepting the U.S. proposal of a 30-day pause in fighting as a confidence-building measure for both sides to hammer out a longer-term peace plan",
    "link": "https://abcnews.go.com/International/wireStory/ukraine-russia-conditions-affect-ceasefire-concede-119883057",
    "timestamp": "2025-03-17T18:30:16Z"
  },
  {
    "title": "Trump to Iran: Stop Arming Houthis or Face US Military Action",
    "description": "President Donald Trump on Monday warned Iran that the United States will hold it responsible for any further attacks by the Yemen-based Houthis, accusing the Islamic Republic of \"dictating every move\" by the terrorist group.\nThe post Trump to Iran: Stop Armin…",
    "link": "https://freebeacon.com/latest-news/trump-to-iran-stop-arming-houthis-or-face-us-military-action/",
    "timestamp": "2025-03-17T18:30:04Z"
  },
  {
    "title": "Here’s How Trump’s Executive Orders Align With Project 2025—As Author Hails President’s Agenda As ‘Beyond My Wildest Dreams’",
    "description": "Trump has long distanced himself from the controversial policy blueprint Project 2025, but is still taking steps that reflect its policy proposals.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/17/heres-how-trumps-executive-orders-align-with-project-2025-as-he-touts-agenda-in-speech-to-congress/",
    "timestamp": "2025-03-17T18:29:13Z"
  },
  {
    "title": "Transgender Influencer Hits Back at Nancy Mace: 'Bullying Me for Being Hot'",
    "description": "Sabre told Newsweek that Republican Representative Nancy Mace of South Carolina posting about her was \"insane.\"",
    "link": "https://www.newsweek.com/nancy-mace-transgender-influencer-social-media-row-2046034",
    "timestamp": "2025-03-17T18:28:49Z"
  },
  {
    "title": "The View From Greenland",
    "description": "Scenes from daily life, a national election, and protests supporting autonomy in a vast territory caught in the global spotlight",
    "link": "https://www.theatlantic.com/photo/2025/03/photos-greenland/682067/",
    "timestamp": "2025-03-17T18:28:03Z"
  },
  {
    "title": "Ukraine and Russia have conditions that could affect a ceasefire. What are they willing to concede?",
    "description": "Both sides seem unwilling to make large concessions to the other.",
    "link": "https://www.bostonherald.com/2025/03/17/ukraine-russia-ceasefire-conditions/",
    "timestamp": "2025-03-17T18:27:58Z"
  },
  {
    "title": "February Retail Sales Miss Expectations With Tepid 0.2% Gain",
    "description": "February retail sales rose just .2%, missing forecasts amid inflation and cautious consumer spending, reflecting economic and policy uncertainties.",
    "link": "http://wwd.com/business-news/financial/february-retail-sales-tepid-growth-1237049669/",
    "timestamp": "2025-03-17T18:27:39Z"
  },
  {
    "title": "Trump tries to void Biden's pardons, blaming autopen. Many presidents have used it",
    "description": "Trump claims without evidence that Biden's Jan. 6 panel pardons are void because he allegedly used an autopen. Autopens have been popular with presidents for decades. Here's what to know about them.",
    "link": "https://www.npr.org/2025/03/17/nx-s1-5330709/autopen-biden-pardon-void",
    "timestamp": "2025-03-17T18:27:27Z"
  },
  {
    "title": "NASA astronauts who flew on Boeing's capsule are about to return home after 9 months in space",
    "description": "Suni Williams and Butch Wilmore originally planned to stay just a week on the space station, but problems with their Boeing vehicle forced them to remain there.",
    "link": "https://www.nbcnews.com/science/space/boeing-starliner-nasa-astronauts-return-suni-williams-butch-wilmore-rcna194926",
    "timestamp": "2025-03-17T18:27:23Z"
  },
  {
    "title": "Trump Appears To Walk Back Executive Order Eliminating Two National Monuments",
    "description": "The White House appeared to delete phrasing arguing to eliminate two national monuments established by Biden.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/03/17/trump-appears-to-walk-back-executive-order-eliminating-two-national-monuments/",
    "timestamp": "2025-03-17T18:27:21Z"
  },
  {
    "title": "Who can be sent to 'worst prison on Earth' as first prisoners from America arrive following Trump deal",
    "description": "Donald Trump could send US citizens and legal residents who are locked up in the US to El Salvador's fearsome CECOT prison as well as alleged gang members.",
    "link": "https://www.ladbible.com/news/world-news/el-salvador-cecot-prison-who-sent-us-donald-trump-051576-20250317",
    "timestamp": "2025-03-17T18:26:46Z"
  },
  {
    "title": "The Absurdity of Trump’s Autopen Meltdown",
    "description": "President Donald Trump has a new hobbyhorse: That his predecessor, President Joe Biden, didn’t legally grant pardons to people Trump wants to harass because the pardons were signed with an autopen, a device for replicating a signature, rather than by hand. Tr…",
    "link": "https://www.motherjones.com/politics/2025/03/autopen-donald-trump/",
    "timestamp": "2025-03-17T18:25:54Z"
  },
  {
    "title": "Socialist Venezuela Compares Trump Deporting Tren de Aragua Thugs to the Holocaust",
    "description": "Venezuela's socialist regime on Sunday condemned President Donald Trump’s use of the 1798 Alien Enemies Act to deport suspected members of the Tren de Aragua terrorist organization, comparing it to \"slavery\" and \"Nazi concentration camps.\"\nThe post Socialist …",
    "link": "https://www.breitbart.com/latin-america/2025/03/17/hold-for-ezra-socialist-venezuela-compares-trump-deporting-tren-de-aragua-thugs-to-the-holocaust/",
    "timestamp": "2025-03-17T18:25:09Z"
  },
  {
    "title": "Rob Arnott made staff read Sun Tzu — or at least this ChatGPT summary of it",
    "description": "\"I think most of the people who fret about his use of tariffs haven't read\" Sun Tzu's \"The Art of War,\" says Rob Arnott.",
    "link": "https://www.businessinsider.com/tariffs-trade-war-rob-arnott-chatgpt-ai-summary-art-war-2025-3",
    "timestamp": "2025-03-17T18:23:44Z"
  },
  {
    "title": "GREGG JARRETT: The law supports Trump's deportation of violent gang members, despite judge's errant ruling",
    "description": "President Donald Trump was on solid legal footing when he ordered the deportation of violent gang members.",
    "link": "https://www.foxnews.com/opinion/gregg-jarrett-law-supports-trumps-deportation-violent-gang-members-despite-judges-errant-ruling",
    "timestamp": "2025-03-17T18:23:01Z"
  },
  {
    "title": "Drag queen The Vivienne died after taking ketamine, family says",
    "description": "Drag queen James Lee Williams - known as \"The Vivienne\"- died after taking ketamine, their family has said.",
    "link": "https://news.sky.com/story/drag-queen-the-vivienne-died-after-taking-ketamine-family-says-13331059",
    "timestamp": "2025-03-17T18:22:00Z"
  },
  {
    "title": "Major Tesla Investor Sends Elon Musk DOGE Warning",
    "description": "Tesla's stop has dropped since he joined the Trump administration.",
    "link": "https://www.newsweek.com/tesla-investor-warning-elon-musk-2046033",
    "timestamp": "2025-03-17T18:21:11Z"
  },
  {
    "title": "Whoopi Goldberg Panicked That No American Is Safe From Trump’s Deportations",
    "description": "\"The View\" co-host Whoopi Goldberg warned with a straight face Monday that no American is safe from being deported under President Donald Trump.",
    "link": "https://dailycaller.com/2025/03/17/the-view-whoopi-goldberg-americans-trump-deportations/",
    "timestamp": "2025-03-17T18:20:53Z"
  },
  {
    "title": "America’s “Pause” on Support for Ukraine Could Be Bad for Army",
    "description": "Since the heated spat between American president Donald Trump and Ukrainian president Volodymyr Zelensky, the pause of military support has left American ordinance abroad, able to be captured by Russian troops. This week, a video circulated on social media sh…",
    "link": "https://nationalinterest.org/blog/buzz/americas-pause-on-support-for-ukraine-could-be-bad-for-army/",
    "timestamp": "2025-03-17T18:20:17Z"
  },
  {
    "title": "Rearm Europe could fortify new alliances",
    "description": "Donald Trump has criticized NATO for exploiting the US, prompting Europe to boost its defense contributions. Ursula von der Leyen's €800 billion plan aims to bolster Europe's defense, reduce reliance on the US, and enhance cooperation with nations like India.…",
    "link": "https://m.economictimes.com/opinion/et-editorial/rearm-europe-could-fortify-new-alliances/articleshow/119128178.cms",
    "timestamp": "2025-03-17T18:20:01Z"
  },
  {
    "title": "Trump Trade Chief Pushes for Order After Rocky Tariff Rollout",
    "description": "President Donald Trump’s top trade negotiator is attempting to inject order into sweeping new tariffs expected next month, after previous announcements roiled markets and fueled business uncertainty.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-trade-chief-pushes-for-order-after-rocky-tariff-rollout",
    "timestamp": "2025-03-17T18:19:14Z"
  },
  {
    "title": "Trump administration says South African ambassador has to leave US by Friday",
    "description": "The US has declared South Africa's ambassador to the United States, Ebrahim Rasool, as 'persona non grata' and given him until Friday to leave the country. Secretary of State Marco Rubio announced the decision, citing Rasool's recent comments about the Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-says-south-african-ambassador-has-to-leave-us-by-friday/articleshow/119128119.cms",
    "timestamp": "2025-03-17T18:17:49Z"
  },
  {
    "title": "Ukraine and Russia have conditions that could affect a ceasefire. What are they willing to concede?",
    "description": "A ceasefire in Ukraine's war hinges on Russia accepting a 30-day pause proposed by the U.S. However, both Russia and Ukraine have firm demands and red lines, making long-term peace difficult. The complex negotiations involve territorial issues, military capab…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-and-russia-have-conditions-that-could-affect-a-ceasefire-what-are-they-willing-to-concede/articleshow/119128086.cms",
    "timestamp": "2025-03-17T18:16:48Z"
  },
  {
    "title": "QAnon crowd thinks fabled ‘storm’ is here after Trump claims Biden’s pardons ‘void’",
    "description": "Followers of the QAnon conspiracy theory are celebrating after President Donald Trump claimed that former President Joe Biden’s pardons are “VOID, VACANT, AND OF NO FURTHER FORCE OR EFFECT.”\n\n\nMade in a late night post on Truth Social, Trump's declaration fol…",
    "link": "https://www.dailydot.com/debug/qanon-storm-trump-biden-pardons-void/",
    "timestamp": "2025-03-17T18:16:42Z"
  },
  {
    "title": "Trump Defies Courts as ‘Rule of Law’ Becomes a Punchline",
    "description": "Trump's lawlessness is going to touch every aspect of American life.",
    "link": "https://gizmodo.com/trump-defies-courts-as-rule-of-law-becomes-a-punchline-2000576853",
    "timestamp": "2025-03-17T18:16:06Z"
  },
  {
    "title": "Palmer Luckey reveals his latest texts with Elon Musk",
    "description": "Palmer Luckey, founder of startup Anduril, said on a podcast he hangs  out at Mar-a-Lago and texts Elon Musk regularly — sometimes about pop culture.",
    "link": "https://www.businessinsider.com/elon-musk-palmer-luckey-black-eyed-peas-song-2025-3",
    "timestamp": "2025-03-17T18:15:16Z"
  },
  {
    "title": "What to know about Yemen's Houthi rebels as the US steps up attacks on Iran-backed group (Jon Gambrell/Associated Press)",
    "description": "Jon Gambrell / Associated Press:\nWhat to know about Yemen's Houthi rebels as the US steps up attacks on Iran-backed group  —  The United States under President Donald Trump has launched a new campaign of intense airstrikes targeting Yemen's Houthi rebels.  Th…",
    "link": "https://www.memeorandum.com/250317/p77",
    "timestamp": "2025-03-17T18:15:00Z"
  },
  {
    "title": "Heads of FCC, Senate intelligence hope to convince Europe to ditch Huawei",
    "description": "(Bloomberg) -- The head of the Federal Communications Commission and the chairman of the Senate Intelligence Committee are teaming up to persuade European...",
    "link": "https://finance.yahoo.com/news/heads-fcc-senate-intelligence-hope-181307656.html",
    "timestamp": "2025-03-17T18:13:07Z"
  },
  {
    "title": "Tom Homan Lights Into Judge Who Ordered Terrorists Be Returned To US",
    "description": "Tom Homan told “Fox and Friends” co-host Lawrence Jones he couldn’t understand why a judge ordered the Trump administration to return terrorists to America.",
    "link": "https://dailycaller.com/2025/03/17/tom-homan-judge-ordered-terrorists-return-us/",
    "timestamp": "2025-03-17T18:12:15Z"
  },
  {
    "title": "A federal judge intends to press the Trump administration on whether it violated his order on deportation flights.",
    "description": "A federal judge in Washington plans to press the Trump administration at a hearing on Monday about whether it has violated an order he issued barring officials from removing any detained noncitizens — including several suspected Venezuelan gang members — from…",
    "link": "https://freerepublic.com/focus/f-news/4304873/posts",
    "timestamp": "2025-03-17T18:12:06Z"
  },
  {
    "title": "Donald Trump's Deportation Move Rebuked by Legal Experts: 'Violation'",
    "description": "Legal experts have condemned President Donald Trump's move to deport hundreds of suspected gang members to El Salvador.",
    "link": "https://www.newsweek.com/trump-deportation-move-alien-enemies-act-tren-de-aragua-2045988",
    "timestamp": "2025-03-17T18:10:50Z"
  },
  {
    "title": "Karoline Leavitt Hits Back at French Politician Wanting The Statue of Liberty Back: Be Grateful You Are ‘Not Speaking German’",
    "description": "White House Press Secretary Karoline Leavitt said Monday a French politician who called on the US to return the Statue of Liberty should be thankful he is “not speaking German.” Leavitt made the comment after she was asked by Fox News correspondent Peter Dooc…",
    "link": "https://www.mediaite.com/tv/karoline-leavitt-hits-back-at-french-politician-wanting-the-statue-of-liberty-back-be-grateful-you-are-not-speaking-german/",
    "timestamp": "2025-03-17T18:10:42Z"
  },
  {
    "title": "Judge who ordered deportation flights of Venezuelan gang members be returned faces calls for impeachment",
    "description": "After Obama-appointed Judge James Boasberg halted Trump's rapid deportation of Venezuelan gang members, Rep. Brandon Gill, R-Texas, said he would be taking formal steps to impeach him.",
    "link": "https://www.foxnews.com/politics/judge-who-ordered-deportations-flights-venezuelan-gang-members-returned-faces-impeachment-calls",
    "timestamp": "2025-03-17T18:08:45Z"
  },
  {
    "title": "Schumer Postpones Book Tour After Backlash",
    "description": "Senate Minority Leader Chuck Schumer has shut down his book tour amid anger over his vote to prevent a government shutdown. The Democrat had been scheduled to appear in Baltimore; Washington, DC; New York City; Philadelphia; Los Angeles; and San Francisco thi…",
    "link": "https://www.newser.com/story/365794/schumer-postpones-book-tour-after-backlash.html",
    "timestamp": "2025-03-17T18:08:18Z"
  },
  {
    "title": "Trump's, Musk's Goals Are Saving US, Not Money or Fame",
    "description": "President Donald Trump, who literally came within one inch of his life dodging a sniper’s bullet, and Elon Musk, who now faces serious death threats for working to save the country from bankruptcy over wasteful government spending, don’t take on these volunta…",
    "link": "https://freerepublic.com/focus/f-news/4304870/posts",
    "timestamp": "2025-03-17T18:07:53Z"
  },
  {
    "title": "WATCH: Tom Homan Shuts Down Reporter Challenging Him on Using ‘Old Law’ to Deport Migrants",
    "description": "President Donald Trump's border czar dunked on a reporter challenging him on the use of a 1798 law that's being used to deport migrants.\nThe post WATCH: Tom Homan Shuts Down Reporter Challenging Him on Using ‘Old Law’ to Deport Migrants first appeared on Medi…",
    "link": "https://www.mediaite.com/news/watch-tom-homan-shuts-down-reporter-challenging-him-on-using-old-law-to-deport-migrants/",
    "timestamp": "2025-03-17T18:07:22Z"
  },
  {
    "title": "Conor McGregor Meets With President Trump to Mark St. Patrick's Day",
    "description": "Conor McGregor was feeling patriotic on St. Patrick's Day.\nThe Irish mixed martial arts fighter made an appearance at the White House alongside Press Secretary Karoline Leavitt March 17, where he...",
    "link": "https://www.eonline.com/news/1414871/conor-mcgregor-meets-with-president-trump-to-mark-st-patricks-day",
    "timestamp": "2025-03-17T18:05:38Z"
  },
  {
    "title": "Courtney Love reveals she’s getting her UK citizenship after Trump’s reelection: ‘It’s frightening now’",
    "description": "Courtney Love wants to become a permanent UK citizen after Trump's reelection victory.",
    "link": "https://nypost.com/2025/03/17/entertainment/courtney-love-is-getting-uk-citizenship-after-trump-victory/",
    "timestamp": "2025-03-17T18:04:02Z"
  },
  {
    "title": "Trump warns Iran it will face 'consequences' of further attacks from Yemen's Houthi rebels",
    "description": "President Donald Trump linked Yemen's Houthi rebels to Iran, warning of dire consequences for further attacks. U.S. airstrikes targeting the Houthis killed 53 people, and more are expected. The Houthis attacked over 100 vessels, raising their profile in the A…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-warns-iran-it-will-face-consequences-of-further-attacks-from-yemens-houthi-rebels/articleshow/119127709.cms",
    "timestamp": "2025-03-17T18:03:13Z"
  },
  {
    "title": "Eight countries could run out of HIV treatments due to USAID cuts, WHO says",
    "description": "(Reuters) -The Trump administration's decision to pause U.S. foreign aid has \"substantially disrupted\" supply of HIV treatments in eight countries, which could soon run out of these life-saving medicines, the World Health Organization said on Monday. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/03/18/eight-countries-could-run-out-of-hiv-treatments-due-to-usaid-cuts-who-says",
    "timestamp": "2025-03-17T18:02:00Z"
  },
  {
    "title": "DOGE allegedly froze spending on care, feeding of TSA bomb-sniffing dogs. Here's what we know",
    "description": "The Department of Government Efficiency issued guidance restricting Transportation Security Administration employees from submitting requests related to food, kenneling and veterinary care for dogs on the agency's explosives detection canine teams.",
    "link": "https://www.snopes.com//fact-check/doge-tsa-dogs-spending/",
    "timestamp": "2025-03-17T18:01:00Z"
  },
  {
    "title": "Coffee Break: Across the Pond – Europe on the Brink",
    "description": "As Europe prepares for war, the democratic and fiscal deficits are growing wider as European countries create new ways of obtaining cash",
    "link": "https://www.nakedcapitalism.com/2025/03/coffee-break-across-the-pond-europe-on-the-brink.html",
    "timestamp": "2025-03-17T18:00:59Z"
  },
  {
    "title": "Conor McGregor meets Donald Trump at White House on St. Patrick’s Day, calls for US support on Ireland's issues",
    "description": "During his St. Patrick’s Day visit to the White House, Conor McGregor described his meeting with Donald Trump as crucial for Ireland’s future. The UFC star criticised the Irish government for inaction on immigration and economic issues, urging America to ackn…",
    "link": "https://economictimes.indiatimes.com/news/international/us/conor-mcgregor-meets-donald-trump-at-white-house-on-st-patricks-day-calls-for-us-support-on-irelands-issues/articleshow/119127566.cms",
    "timestamp": "2025-03-17T18:00:12Z"
  },
  {
    "title": "U.S. Senate OKs Plan to Reinstate D.C.’s New Budget Level",
    "description": "The U.S. Senate acted quickly on Friday evening to pass a revised version of its federal spending bill that would allow Washington, D.C., to use its fiscal 2025 budget, but the District isn’t out of the woods just yet. The updated bill is now in the hands of …",
    "link": "http://commercialobserver.com/2025/03/senate-dc-budget-spending-update-congress/",
    "timestamp": "2025-03-17T18:00:06Z"
  },
  {
    "title": "Trade War Fears Hit UK Manufacturing Sector",
    "description": "UK manufacturing output fell during the first quarter of the year for the first time in a decade, as fears over a global trade war and rising taxes hit firms. Output fell one per cent in the first three months of 2025 after a 20 per cent rise in the quarter b…",
    "link": "https://oilprice.com/Finance/the-Economy/Trade-War-Fears-Hit-UK-Manufacturing-Sector.html",
    "timestamp": "2025-03-17T18:00:00Z"
  }
]