[
  {
    "title": "Turkish top diplomat to pay snap visit to US amid Gaza peace efforts",
    "description": "Foreign Minister Hakan Fidan will go to the United States on Nov. 10, the Foreign Ministry has announced, amid intensified efforts to implement the Gaza peace deal between Israel and Hamas.",
    "link": "https://www.hurriyetdailynews.com/turkish-top-diplomat-to-pay-snap-visit-to-us-amid-gaza-peace-efforts-215533",
    "timestamp": "2025-11-09T11:30:22Z"
  },
  {
    "title": "Retirees Can Live On Social Security Alone In This State Out West (But Only If You Don't Have A Mortgage)",
    "description": "Even if their house is paid off, many people still need some form of income to get by once they leave the workforce - unless they move to the desert.",
    "link": "https://www.moneydigest.com/2008170/retirees-live-on-social-security-alone-western-state-nevada-no-mortgage/",
    "timestamp": "2025-11-09T11:30:00Z"
  },
  {
    "title": "Sharaa to become 1st Syrian president at White House",
    "description": "Syria's President Ahmad al-Sharaa is set to meet U.S. President Donald Trump on Nov. 10 at the White House during a landmark official visit, days after Washington removed him from a blacklist.",
    "link": "https://www.hurriyetdailynews.com/sharaa-to-become-1st-syrian-president-at-white-house-215529",
    "timestamp": "2025-11-09T11:26:23Z"
  },
  {
    "title": "Al-Sharaa to become the first Syrian president to visit the White House after an unlikely rise",
    "description": "Ahmad al-Sharaa, once detained by the U.S. for joining al-Qaida in Iraq, will be the first Syrian president to visit Washington since 1946",
    "link": "https://abcnews.go.com/International/wireStory/al-sharaa-become-syrian-president-visit-white-house-127349680",
    "timestamp": "2025-11-09T11:22:46Z"
  },
  {
    "title": "China halts ban on export to US of some dual-use metals",
    "description": "China suspended an export ban to the US that had targeted gallium, germanium and antimony, metals crucial for modern technology.",
    "link": "https://www.standardmedia.co.ke/business/business/article/2001533798/china-halts-ban-on-export-to-us-of-some-dual-use-metals",
    "timestamp": "2025-11-09T11:01:04Z"
  },
  {
    "title": "What I Learned About Dick Cheney",
    "description": "The former vice president was certain he knew better than the citizens he served what was good for them.",
    "link": "https://www.theatlantic.com/ideas/2025/11/barton-gellman-what-i-learned-about-dick-cheney/684875/",
    "timestamp": "2025-11-09T11:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene 2028? It sure looks like she's trying.",
    "description": "Marjorie Taylor Greene's changing positions on Donald Trump, Nancy Pelosi and a variety of issues like the shutdown can be explainer by presidential interests.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/marjorie-taylor-greene-president-2028-trump-pelosi-rcna242449",
    "timestamp": "2025-11-09T11:00:00Z"
  },
  {
    "title": "Liberal Elites Kicked the Door Wide Open for Trump’s Flagrant Corruption",
    "description": "The president’s corruption is audaciously out in the open, but decades of letting the wealthy play by their own rules enabled him.\nThe post Liberal Elites Kicked the Door Wide Open for Trump’s Flagrant Corruption appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/11/09/trump-corruption-graft/",
    "timestamp": "2025-11-09T11:00:00Z"
  },
  {
    "title": "The White House effect: Why America reneged on its pledges to tackle climate change",
    "description": "A new Netflix documentary tracks how, since 1989, the US has sabotaged efforts to reduce global emissions",
    "link": "https://www.irishtimes.com/world/us/2025/11/09/the-white-house-effect-why-america-reneged-on-its-pledges-to-tackle-climate-change/",
    "timestamp": "2025-11-09T11:00:00Z"
  },
  {
    "title": "The Trump administration drags its feet on feeding the hungry",
    "description": "The Supplemental Nutrition Assistance Program, or SNAP, which helps 42 million Americans obtain enough food each month, is currently not issuing benefits.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/november-snap-benefits-trump-court-ruling-rcna242683",
    "timestamp": "2025-11-09T11:00:00Z"
  },
  {
    "title": "Republicans push to strip Zohran Mamdani of US citizenship. Is it possible?",
    "description": "GOP seeks to revoke NYC Mayor-elect Mamdani’s citizenship; experts say they must prove false claims in his application.",
    "link": "https://www.aljazeera.com/news/2025/11/9/republicans-push-to-strip-zohran-mamdani-of-us-citizenship-is-it-possible",
    "timestamp": "2025-11-09T10:59:08Z"
  },
  {
    "title": "Bye Bye United Captains In The Daily LITG, 9th of November, 2025",
    "description": "\"Bye Bye United Captains\" was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history o…",
    "link": "https://bleedingcool.com/comics/bye-bye-united-captains-in-the-daily-litg-9th-of-november-2025/",
    "timestamp": "2025-11-09T10:58:04Z"
  },
  {
    "title": "An Expert on Hamas Explains Why the Group Isn’t Going Anywhere",
    "description": "I wanted to know what Gaza would look like after Hamas. But is that really the right question?",
    "link": "https://slate.com/news-and-politics/2025/11/israel-hamas-ceasefire-gaza-palestine.html",
    "timestamp": "2025-11-09T10:45:00Z"
  },
  {
    "title": "BBC Plans Apology Over “Dishonest” Trump Edit, As UK Minister Says Incident Is “Incredibly Serious”",
    "description": "The BBC’s chairman is planning to apologize after a documentary edited Donald Trump‘s January 6 speech to make it appear as if the president was encouraging the 2021 Capitol riot. On Monday, Samir Shah will write to UK Parliament’s Culture, Media and Sport Co…",
    "link": "http://deadline.com/2025/11/bbc-apology-trump-edit-lisa-nandy-1236611987/",
    "timestamp": "2025-11-09T10:43:10Z"
  },
  {
    "title": "Watch live: Remembrance Sunday service led by King Charles at Cenotaph",
    "description": "Watch live from the Remembrance Sunday service at the Cenotaph on Sunday (9 November), marking 80 years since the Second World War ended.",
    "link": "https://www.the-independent.com/news/remembrance-sunday-service-king-charles-live-stream-b2861639.html",
    "timestamp": "2025-11-09T10:36:52Z"
  },
  {
    "title": "Lavrov reappears and says ready to meet Rubio",
    "description": "\"We communicate by telephone and are ready to hold face-to-face meetings when necessary,\" Russian foreign minister tells Ria Novosti news agency.",
    "link": "https://www.politico.eu/article/russia-sergey-lavrov-ready-to-meet-us-marco-rubio-ukraine-war/",
    "timestamp": "2025-11-09T10:29:22Z"
  },
  {
    "title": "Checks and Balance newsletter: How Donald Trump became Joe Biden",
    "description": "Charlotte Howard, our executive editor and New York bureau chief, considers the parallelisms between the two men",
    "link": "https://biztoc.com/x/58563b4ce208f4ba",
    "timestamp": "2025-11-09T10:23:07Z"
  },
  {
    "title": "American Bitcoin, Backed By Eric And Donald Trump Jr., Adds 139 BTC, Boosting Treasury Above $415 Million",
    "description": "American Bitcoin Corp, a Miami-based mining company majority owned by Hut 8 and backed by the Trump family, has added more BTC to its holdings.",
    "link": "https://zycrypto.com/american-bitcoin-backed-by-eric-and-donald-trump-jr-adds-139-btc-boosting-treasury-above-415-million/",
    "timestamp": "2025-11-09T10:22:16Z"
  },
  {
    "title": "Putin’s Nuclear Threats Don’t Work on Trump. Here's Why",
    "description": "Donald Trump does not fear the nuclear threats that Russian President Vladimir Putin has made during his full-scale invasion of Ukraine, historian and author Serhii Plokhy has told Newsweek.\nPlokhy's latest book, The Nuclear Age, charts the trajectory from th…",
    "link": "https://biztoc.com/x/c53239c7da39b428",
    "timestamp": "2025-11-09T10:12:14Z"
  },
  {
    "title": "Skeptics to ask Legislature to ban mail-in voting in Hawaii | Honolulu Star-Advertiser",
    "description": "The state Legislature will be asked to ban wildly popular mail-in voting and return to one-day, in-person voting as a majority of Hawaii Elections Commission members continue to echo election doubts repeated by President Donald Trump and his MAGA supporters s…",
    "link": "https://www.staradvertiser.com/2025/11/09/hawaii-news/skeptics-to-ask-legislature-to-ban-mail-in-voting-in-hawaii/",
    "timestamp": "2025-11-09T10:08:07Z"
  },
  {
    "title": "ACA enrollment: Skyrocketing health insurance premiums force enrollees to make tough decisions",
    "description": "Millions of Americans with Affordable Care Act policies are contending with the looming lapse of the enhanced subsidies. The increased cost of coverage can lead to agonizing tradeoffs for many enrollees.",
    "link": "https://www.cnn.com/2025/11/09/politics/aca-enrollment-premiums-increase-impact",
    "timestamp": "2025-11-09T10:07:26Z"
  },
  {
    "title": "Is Melania happy without Trump? Body language expert says his absence ‘boosted’ her confidence",
    "description": "Trump vs. Melania: First Lady Melania Trump accepted the Fox Nation 'Patriot of the Year' award alone.  Her husband, President Donald Trump, was in Washington, D.C.  A body language expert noted her confident demeanor during her speech on patriotism and innov…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-melania-happy-without-trump-body-language-expert-says-his-absence-boosted-her-confidence/articleshow/125199765.cms",
    "timestamp": "2025-11-09T10:01:24Z"
  },
  {
    "title": "What the Polls Got Right and Wrong in the 2025 Elections",
    "description": "In the scattered elections of 2025, polls underestimated the Democratic vote in New Jersey and Virginia and missed a Republican collapse in New York City — though they did predict Zohran Mamdani’s election as mayor.",
    "link": "http://nymag.com/intelligencer/article/what-the-polls-got-right-and-wrong-in-the-2025-elections.html",
    "timestamp": "2025-11-09T10:00:22Z"
  },
  {
    "title": "Why is Donald Trump at Lions vs. Commanders? Explaining the president's NFL Week 10 appearance",
    "description": "President Trump will attend Washington’s game on Sunday -- here’s why.",
    "link": "https://www.sportingnews.com/us/nfl/news/donald-trump-lions-commanders-president-nfl-week-10/56f7d871b51b754a825d4d10",
    "timestamp": "2025-11-09T10:00:01Z"
  },
  {
    "title": "How one photo and a deluge of threats turned an Arizona high school upside down",
    "description": "VAIL, Ariz. — Cienega High School Principal Kim Middleton woke up early last Saturday to urgent messages from district administrators.",
    "link": "https://www.nbcnews.com/news/us-news/one-photo-deluge-threats-arizona-high-school-turned-upside-right-wing-rcna241672",
    "timestamp": "2025-11-09T10:00:00Z"
  },
  {
    "title": "Trump doubles down on the economy despite a strong rebuke from voters",
    "description": "Even as Republicans have started to feel political heat on economic issues, Trump has continued to insist that the economy is better than ever.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-economy-strong-rebuke-voters-rcna242686",
    "timestamp": "2025-11-09T10:00:00Z"
  },
  {
    "title": "Baby boomers have turned into Generation Can't-Let-Go",
    "description": "As boomers cling to power, America's become a gerontocracy — in business, housing, and the workforce. Here's what it means for millennials and Gen Z.",
    "link": "https://www.businessinsider.com/baby-boomers-generation-working-not-retiring-selling-homes-miellnnials-2025-11",
    "timestamp": "2025-11-09T09:36:01Z"
  },
  {
    "title": "China halts export ban to US of some 'dual use' materials",
    "description": "China suspended an export ban to the U.S. that had targeted gallium, germanium and antimony, metals crucial for modern technology, including semiconductors, Beijing's commerce ministry announced on Nov. 9.",
    "link": "https://www.hurriyetdailynews.com/china-halts-export-ban-to-us-of-some-dual-use-materials-215520",
    "timestamp": "2025-11-09T09:32:55Z"
  },
  {
    "title": "US Informs Russia Extension of New START Restrictions Under Consideration - Lavrov",
    "description": "MOSCOW (Sputnik) - The United States has informed Russia through diplomatic channels that it is considering Russian President Vladimir Putin's idea of maintaining the restrictions laid down in the Strategic Arms Reduction Treaty (START) beyond February 2026, …",
    "link": "https://sputnikglobe.com/20251109/us-informs-russia-extension-of-new-start-restrictions-under-consideration---lavrov-1123081037.html",
    "timestamp": "2025-11-09T09:30:23Z"
  },
  {
    "title": "Arun Maira: Bill Gates has changed how he thinks climate change should be tackled—Here’s what’s different",
    "description": "Bill Gates has long championed grand, top-down fixes to global crises—from vaccines to climate change. His latest essay, however, signals a surprising rethink: that the world’s toughest problems may not need global blueprints, but millions of local solutions …",
    "link": "https://www.livemint.com/opinion/online-views/bill-gates-climate-change-gdp-local-solutions-global-problems-sustainable-development-goals-11762572450804.html",
    "timestamp": "2025-11-09T09:30:19Z"
  },
  {
    "title": "Ships Stop Here campaign aims to bolster N.L.’s marine sector",
    "description": "Dozens of Newfoundland and Labrador companies and organizations have come together to push the federal government to tap into their expertise in the marine sector.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/ships-stop-here-9.6964953",
    "timestamp": "2025-11-09T09:30:00Z"
  },
  {
    "title": "GOP pushes to question Trump prosecutor Jack Smith quietly. What are they hiding? | Opinion",
    "description": "Republicans in Congress want to put Jack Smith under a microscope, in private. He's cornering them in their own game, very much in public.",
    "link": "https://www.usatoday.com/story/opinion/columnist/2025/11/09/jack-smith-report-trump-classified-documents/87110234007/",
    "timestamp": "2025-11-09T09:02:26Z"
  },
  {
    "title": "The 9 at 9: Sunday",
    "description": "Fianna Fáil election review delays, a super typhoon in the Philippines and cyber safety warnings",
    "link": "https://www.thejournal.ie/9-at-9-sunday-204-6869243-Nov2025/",
    "timestamp": "2025-11-09T08:55:36Z"
  },
  {
    "title": "Gavin Newsom trolls Trump with ‘The Nodfather’ meme after viral sleepy photos",
    "description": "California Governor Gavin Newsom has again mocked President Donald Trump, sharing an edited \"The Nodfather\" meme featuring images of Trump appearing to nod off at public events. This latest jab follows previous AI-generated mockery and escalates the ongoing p…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gavin-newsom-trolls-trump-with-the-nodfather-meme-after-viral-sleepy-photos/articleshow/125199231.cms",
    "timestamp": "2025-11-09T08:53:34Z"
  },
  {
    "title": "The anti-Trump vote appears as strong as ever (Aaron Blake/CNN)",
    "description": "Aaron Blake / CNN:\nThe anti-Trump vote appears as strong as ever  —  President Donald Trump on Friday downplayed his role in a pretty grim 2025 election for Republicans.  —  “I watched that election, which I was not much involved in,” Trump said in the Oval O…",
    "link": "https://www.memeorandum.com/251109/p6",
    "timestamp": "2025-11-09T08:50:10Z"
  },
  {
    "title": "The filibuster is the new MAGA litmus test (Adam Wren/Politico)",
    "description": "Adam Wren / Politico:\nThe filibuster is the new MAGA litmus test  —  With help from Eli Okun, Bethany Irvine, Ali Bianco and Rachel Umansky-Castro  —  Happy Saturday morning.  This is Adam Wren.  Get in touch.  —  DRIVING THE DAY  —  When President Donald Tru…",
    "link": "https://www.memeorandum.com/251109/p1",
    "timestamp": "2025-11-09T08:50:10Z"
  },
  {
    "title": "US airstrikes in Caribbean, Pacific violating intl. humanitarian law: UN chief",
    "description": "The UN chief has expressed support for the legal view that condemns the US airstrikes in the Caribbean and Pacific regions as violations of international humanitarian law.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/11/mil-251108-presstv04.htm",
    "timestamp": "2025-11-09T08:45:22Z"
  },
  {
    "title": "North Korea threatens 'offensive action' as US aircraft carrier arrives in South Korea",
    "description": "North Korea has threatened to take \"offensive action\" as the United States and South Korea hold talks on strengthening military ties.",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2025/dprk-251108-presstv01.htm",
    "timestamp": "2025-11-09T08:42:27Z"
  },
  {
    "title": "Russia Received No Diplomatic Clarification on Trump's Call to Resume Nuclear Tests - Lavrov",
    "description": "Russia has not received any explanation through diplomatic channels as to what US President Donald Trump meant when he announced the resumption of nuclear testing, Russian Foreign Minister Sergey Lavrov told reporters.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/11/russia-251108-sputnik01.htm",
    "timestamp": "2025-11-09T08:38:07Z"
  },
  {
    "title": "Trump says no U.S. officials to attend upcoming G20 summit in South Africa",
    "description": "U.S. President Donald Trump said on Friday that no U.S. officials will attend G20 summit scheduled to be held in South Africa late this month.",
    "link": "https://www.globalsecurity.org/wmd/library/news/safrica/safrica-251108-pdo01.htm",
    "timestamp": "2025-11-09T08:37:32Z"
  },
  {
    "title": "Zelenskyy Urges Allies To Respond As Ukraine Battles To Restore Power After Attacks",
    "description": "Ukrainian President Volodymyr Zelenskyy kept up his call for additional Western pressure on the Kremlin as the death toll rose from the latest Russian attacks and as authorities struggled to restore power following strikes on Ukraine's energy infrastructure.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251109-rferl01.htm",
    "timestamp": "2025-11-09T08:35:43Z"
  },
  {
    "title": "Homes, Energy Sector Hit In Deadly Russian Attack On Ukraine",
    "description": "Russia carried out a large, overnight combined strike using drones and missiles across multiple regions of Ukraine, with Ukrainian officials emphasizing that energy infrastructure and civilian facilities were key targets.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/11/ukraine-251108-rferl02.htm",
    "timestamp": "2025-11-09T08:35:11Z"
  },
  {
    "title": "US Nuclear Test Plan Risks New Global Arms Race - Russia's UN Envoy",
    "description": "US President Donald Trump's statement on nuclear testing has caused chaos worldwide and following through could lead to a renewed arms race with dire implications, Russian Ambassador to the UN Vassily Nebenzia told RIA Novosti.",
    "link": "https://www.globalsecurity.org/wmd/library/news/usa/2025/usa-251108-sputnik01.htm",
    "timestamp": "2025-11-09T08:34:14Z"
  },
  {
    "title": "US Taxpayers May See 'Record Refund Season' In 2026 Over Trump's 'Big Beautiful Bill'",
    "description": "Certain taxpayers may be in for a pleasant surprise next year, as retroactive tax changes introduced under President Donald Trump’s July legislation could lead to significantly larger refunds in 2026. The law, dubbed the “big beautiful bill,” includes expande…",
    "link": "https://www.ndtvprofit.com/business/income-tax-refunds-us-taxpayers-may-see-record-refund-season-in-2026-over-trumps-bill-beautiful-bill-says-report",
    "timestamp": "2025-11-09T08:26:19Z"
  },
  {
    "title": "Syria’s new president visits US a day after removal from terror blacklist ahead of Trump meeting",
    "description": "The visit marks a dramatic shift in ties with the US, as Syria seeks to rebuild after years of war.",
    "link": "https://www.thejournal.ie/syria-president-us-visit-trump-6869223-Nov2025/",
    "timestamp": "2025-11-09T08:15:43Z"
  },
  {
    "title": "The Fed’s newest governor brings a Trump perspective on the economy. Is anyone buying it?",
    "description": "The Federal Reserve’s newest policymaker has an unconventional perspective on the US economy that’s proving tough to sell.\nIn September, President Donald Trump appointed Stephen Miran, one of his top economic advisers, to temporarily fill a vacated seat on th…",
    "link": "https://biztoc.com/x/15ea5ffc77e76f44",
    "timestamp": "2025-11-09T08:09:30Z"
  },
  {
    "title": "'10-Year National Mission': Sridhar Vembu Offers 'Plan B' To Tackle US Tech Dependency",
    "description": "Amid growing concerns over India's reliance on foreign tech platforms, Zoho founder Sridhar Vembu has called for a ten-year \"National Mission for Tech Resilience\" to promote domestic tech platforms. Vembu shared his thoughts on X while replying to a post made…",
    "link": "https://www.ndtvprofit.com/technology/sridhar-vembu-wants-tech-resilience-amid-potential-google-facebook-instagram-ban-from-trump",
    "timestamp": "2025-11-09T07:57:39Z"
  },
  {
    "title": "Trump’s trade war: has China won?",
    "description": "Donald Trump was in a “buoyant mood” as he flew back from his tour of Asia last week, said Rob Crilly in The Telegraph. “Air Force One was packed with gleaming gifts – a crown, a golf putter, a Nobel Peace Prize nomination.” On board, the US president boasted…",
    "link": "https://biztoc.com/x/3ddd099d461a1693",
    "timestamp": "2025-11-09T07:25:12Z"
  },
  {
    "title": "Is Wall Street losing faith in AI?",
    "description": "A rough week for tech stocks might signal a loss of investor confidence in artificial intelligence.\nThe Wall Street Journal reports that the Nasdaq Composite Index was down 3% — making this its worst week since President Donald Trump announced his sweeping ta…",
    "link": "https://biztoc.com/x/7a739adb715a9f67",
    "timestamp": "2025-11-09T07:25:08Z"
  },
  {
    "title": "Trump’s trade war: has China won?",
    "description": "US president wanted to punish Beijing, but the Asian superpower now holds the whip hand",
    "link": "https://theweek.com/politics/trumps-trade-war-has-china-won",
    "timestamp": "2025-11-09T07:11:00Z"
  },
  {
    "title": "A neuropsychologist’s view on DJ Carey: Living through the eyes of others hollows a person out",
    "description": "DJ Carey’s values got crushed between the noble mission of the GAA and the glitz of fame",
    "link": "https://www.irishtimes.com/opinion/2025/11/08/a-neuropsychologists-view-on-dj-carey-living-through-the-eyes-of-others-hollows-a-person-out/",
    "timestamp": "2025-11-09T07:10:00Z"
  },
  {
    "title": "Cliff Taylor: A large hole is going to appear in our finances - and guess who will end up paying for it?",
    "description": "A new report suggests we have a ten year window before the hole appears, but we can’t afford to bet on it",
    "link": "https://www.irishtimes.com/opinion/2025/11/09/cliff-taylor-a-large-hole-is-going-to-appear-in-our-finances-and-guess-who-will-end-up-paying-for-it/",
    "timestamp": "2025-11-09T07:08:00Z"
  },
  {
    "title": "Joe Rogan Experience: Russell Crowe sticks up for Anthony Albanese after podcaster asks about Australia",
    "description": "Joe Rogan Experience: Russell Crowe sticks up for Anthony Albanese after podcaster asks about Australia7news.com.au",
    "link": "https://7news.com.au/news/joe-rogan-experience-russell-crowe-sticks-up-for-anthony-albanese-after-podcaster-asks-about-australia-c-20623321",
    "timestamp": "2025-11-09T06:59:11Z"
  },
  {
    "title": "Türkiye develops plans to increase its aid to Gaza: Erdoğan",
    "description": "Türkiye is exerting intense efforts to deliver humanitarian aid to the civilians in Gaza and expanding its plans accordingly, President Recep Tayyip Erdoğan has said, criticizing Israel for blocking the entrance of trucks into the enclave at the expense of br…",
    "link": "https://www.hurriyetdailynews.com/turkiye-develops-plans-to-increase-its-aid-to-gaza-erdogan-215514",
    "timestamp": "2025-11-09T06:53:00Z"
  },
  {
    "title": "President presiding over economic and governmental trainwreck laser-focused on gratifying his own ego",
    "description": "Here’s a man definitely moving heaven and Earth to get the government open to prevent the affliction of further suffering: President Donald Trump wants the Washington Commanders to name their planned $3.7 billion stadium after him, multiple sources with knowl…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/11/president-presiding-over-economic-and-governmental-trainwreck-laser-focused-on-gratifying-his-own-ego",
    "timestamp": "2025-11-09T06:40:39Z"
  },
  {
    "title": "Before talks with Trump, Saudi Arabia doubles down on terms for Israel ties",
    "description": "Normalized relations between Israel and Saudi Arabia could shake up the Middle East, and possibly strengthen U.S. influence there.",
    "link": "https://www.japantimes.co.jp/news/2025/11/09/world/politics/trump-saudi-arabia-israel-ties/",
    "timestamp": "2025-11-09T06:24:00Z"
  },
  {
    "title": "‘SNL’ Weekend Update Roasts Andrew Cuomo’s Failed Campaign, ‘Suspicious’ RFK Jr.",
    "description": "SNL's Weekend Update mocks Andrew Cuomo's filed bid for New York mayor, as well as RFK Jr.'s odd reaction to a man fainting in the Oval Office.",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-weekend-update-roasts-andrew-cuomo-failed-campaign-suspicious-rfk-jr-1235462182/",
    "timestamp": "2025-11-09T06:22:41Z"
  },
  {
    "title": "THOMAS LIMBERGER : Only Trump Can End Russian Game Of Deception",
    "description": "When the history of Europe’s strategic decline is written, it will not begin with the war in Ukraine — but with Germany’s fatal misreading of Russia.",
    "link": "https://dailycaller.com/2025/11/09/opinion-only-trump-can-end-the-russian-game-of-deception-thomas-limberger/",
    "timestamp": "2025-11-09T06:19:34Z"
  },
  {
    "title": "Syrian president Ahmed al-Sharaa arrives in US for landmark visit",
    "description": "Syria's President Ahmed al-Sharaa arrived in the United States on Saturday for a landmark official visit, his country's state news agency reported, a day after Washington removed him from a terrorism blacklist. The Syrian interior ministry announced on Saturd…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/syrian-president-ahmed-al-sharaa-arrives-in-us-for-landmark-visit/articleshow/125197756.cms",
    "timestamp": "2025-11-09T06:16:33Z"
  },
  {
    "title": "Turkey REFUSES to ditch Russian S-400 missile systems despite pressure from Washington",
    "description": "Despite relentless U.S. demands, Turkey refuses to dismantle its Russian-made S-400 missile defense systems –  though it remains open to limited compromises, such as joint oversight mechanisms. Turkey’s 2017 $2.5 billion S-400 deal led to its removal from the…",
    "link": "https://www.naturalnews.com/2025-11-09-turkey-refuses-to-ditch-russian-s400-missile-systems.html",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "The Edmund Fitzgerald tragedy 50 years on: ‘The lake, it is said, never gives up her dead’",
    "description": "The Great Lakes’ most famous shipwreck – and inspiration for Gordon Lightfoot’s chilling ballad – still resonates: a tale of courage, loss and the haunting pull of the inland seas",
    "link": "https://www.irishtimes.com/world/us/2025/11/09/the-lake-it-is-said-never-gives-up-her-dead-the-edmund-fitzgerald-tragedy-50-years-on/",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "Israel escalates strikes in Lebanon against Hezbollah as U.S. establishes military presence in Syria",
    "description": "IDF targets alleged Hezbollah weapons storage and rearming efforts, violating UN Resolution 1701. Lebanese President Joseph Aoun condemns strikes as “fully fledged crimes” amid Lebanon’s willingness to negotiate. Hezbollah vows resistance, accusing Israel of …",
    "link": "https://www.naturalnews.com/2025-11-09-israel-escalates-strikes-in-lebanon-against-hezbollah.html",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "North Korea escalates tensions with latest ballistic missile launch over Japan",
    "description": "North Korea fired a ballistic missile that flew over the Sea of Japan before landing 200 nautical miles outside Japan’s exclusive economic zone (EEZ). The launch demonstrates Pyongyang’s advancing missile technology, including short-range ballistic missiles (…",
    "link": "https://www.naturalnews.com/2025-11-09-nokor-launches-ballistic-missile-over-japan-sea.html",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "Russia’s Poseidon and Burevestnik: Doomsday weapons or coercive nuclear signaling?",
    "description": "Russian President Vladimir Putin announced successful tests of two advanced nuclear systems – the Burevestnik (a nuclear-powered, nuclear-armed cruise missile with unlimited range, making it nearly impossible to intercept) and the Poseidon (an autonomous nucl…",
    "link": "https://www.naturalnews.com/2025-11-09-russia-poseidon-burevestnik-doomsday-weapons-nuclear-signaling.html",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "Streamlined federal dietary guidelines DELAYED amid government shutdown",
    "description": "HHS Secretary Robert F. Kennedy Jr. announced that the release of the new federal dietary guidelines, originally planned for summer, has been postponed to December due to the ongoing government shutdown—the longest in U.S. history. The updated guidelines will…",
    "link": "https://www.naturalnews.com/2025-11-09-federal-dietary-guidelines-delayed-amid-government-shutdown.html",
    "timestamp": "2025-11-09T06:00:00Z"
  },
  {
    "title": "Government shutdown reaches its 40th day as senators work through a crucial weekend",
    "description": "The government shutdown has stretched into its 40th day",
    "link": "https://abcnews.go.com/US/wireStory/government-shutdown-reaches-40th-day-senators-work-crucial-127347432",
    "timestamp": "2025-11-09T05:49:53Z"
  },
  {
    "title": "The comedian hosted the show for the first time on Saturday night.",
    "description": "Comedian Nikki Glaser made her Saturday Night Live hosting debut this week, and made sure to tick all of the topical—and controversial—boxes in her monologue...",
    "link": "https://www.thedailybeast.com/snl-host-nikki-glaser-roasts-trump-epstein-and-rfk-jr/",
    "timestamp": "2025-11-09T05:43:14Z"
  },
  {
    "title": "Nextrush Unplugged Weekend*RIP Jim Robinson*Afghanistan-Pakistan Talks Break Down*Don't Be **** Cheney*339 Dollars, 28 Cents More Per Person*Mamdani The Antichrist!*China's Flying Cars*\"God Loves You And...\"*",
    "description": "Newsdump Alert: Afghanistan-Pakistan Peace Talks Break Down Conflict Follows Pakistan Leader's White House Visit, Trump Demand For Use Of Bagram Air Base... Back in September Israeli Prime Minister Benjamin Netanyahu made his country's priority clear when mee…",
    "link": "https://freerepublic.com/focus/f-bloggers/4351552/posts",
    "timestamp": "2025-11-09T05:42:35Z"
  },
  {
    "title": "Twenty One Pilots Perform “Seven Nation Army” in Honor of The White Stripes at Rock & Roll Hall of Fame",
    "description": "Jack White himself opted not to performance at the induction ceremony.\nTwenty One Pilots Perform “Seven Nation Army” in Honor of The White Stripes at Rock & Roll Hall of Fame\nScott Sterling",
    "link": "https://consequence.net/2025/11/twenty-one-pilots-seven-nation-army-the-white-stripes-rock-and-roll-hall-of-fame/",
    "timestamp": "2025-11-09T05:37:44Z"
  },
  {
    "title": "‘SNL’ Cold Open: Trump Ignores Oval Office Emergency to Grouse About Mamdani’s Win",
    "description": "SNL's Donald Trump doesn't help a man who faints in the Oval Office, and instead reveals that he's \"not crazy about a Muslim\" mayor in Zohran Mamdani",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/snl-cold-open-trump-ignores-oval-office-emergency-grouse-zohran-mamdani-win-1235462309/",
    "timestamp": "2025-11-09T05:30:33Z"
  },
  {
    "title": "Jon Bon Jovi: 'We’re in a quandary in America. It’s bad. It’s bad'",
    "description": "“America’s on fire, ain’t it?” says Jon Bon Jovi. He looks like John Travolta in Saturday Night Fever, without many signs of his 63 years. His waistline is that of a 20-year-old and his hair is thick, even bouffant. He is a rock star who has sold over 150 mil…",
    "link": "https://www.independent.ie/entertainment/music/jon-bon-jovi-were-in-a-quandary-in-america-its-bad-its-bad/a170857954.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Donald Trump vows to stand firm as US government shutdown rumbles on",
    "description": "Senators are working through the weekend for the first time since the US government shutdown began more than a month ago, hoping to find a bipartisan resolution that has eluded them.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-vows-to-stand-firm-as-us-government-shutdown-rumbles-on/a1924469662.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Nadine Doherty: Informed questioning has to be encouraged",
    "description": "Elon Musk contributed $290m to Donald Trump’s presidential campaign in 2024 during which an abrupt and intense alliance flourished between two of the world’s most powerful men.",
    "link": "https://www.independent.ie/sport/gaelic-games/ladies-football/nadine-doherty-informed-questioning-has-to-be-encouraged/a1772383810.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Jon Bon Jovi: ‘I sit before you with grey hair and 63-year-old lines on my face but it’s OK, I don’t want to be something I’m not’’",
    "description": "“America’s on fire, ain’t it?” says Jon Bon Jovi. He looks like John Travolta in Saturday Night Fever, without many signs of his 63 years. His waistline is that of a 20-year-old and his hair is thick, even bouffant. He is a rock star who has sold over 150 mil…",
    "link": "https://www.independent.ie/entertainment/music/jon-bon-jovi-i-sit-before-you-with-grey-hair-and-63-year-old-lines-on-my-face-but-its-ok-i-dont-want-to-be-something-im-not/a170857954.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "What would the Irish architect who designed the White House think of Donald Trump’s ‘big, beautiful’ ballroom?",
    "description": "Since US president Donald Trump sent in a wrecking ball to demolish the White House East Wing last month, there has been much outrage over his plans to replace it with a $300m (€259m) ballroom sponsored by private donors.",
    "link": "https://www.independent.ie/irish-news/what-would-the-irish-architect-who-designed-the-white-house-think-of-donald-trumps-big-beautiful-ballroom/a1464776930.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Work under way on Putin’s nuclear test plan",
    "description": "Russian foreign minister Sergei Lavrov said yesterday that work is under way on Vladimir Putin’s order to prepare proposals for a possible Russian nuclear test, state news agency TASS reported.",
    "link": "https://www.independent.ie/world-news/work-under-way-on-putins-nuclear-test-plan/a168754710.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Palestinian death toll tops 69,000 as bodies exchanged",
    "description": "More than 69,000 Palestinians have been killed in the Israel-Hamas war so far, Gaza health officials said yesterday, as both sides completed the latest exchange of bodies under the terms of the tenuous ceasefire.",
    "link": "https://www.independent.ie/world-news/palestinian-death-toll-tops-69000-as-bodies-exchanged/a1892651265.html",
    "timestamp": "2025-11-09T05:30:00Z"
  },
  {
    "title": "Syrian president arrives in US for landmark visit",
    "description": "Syria’s President Ahmed al-Sharaa arrived in the United States on Saturday for a landmark official visit, his country’s state news agency reported, a day after Washington removed him from a terrorism blacklist. Sharaa, whose rebel forces ousted longtime ruler…",
    "link": "https://www.digitaljournal.com/world/syrian-president-arrives-in-us-for-landmark-visit/article",
    "timestamp": "2025-11-09T05:27:20Z"
  },
  {
    "title": "Anti-doping chiefs clash over pro-steroid sports competition",
    "description": "Heads of US and global bodies row over controversial Enhanced Games backed by Donald Trump Jr and Peter Thiel",
    "link": "https://biztoc.com/x/5b0fdcfe50957851",
    "timestamp": "2025-11-09T05:22:53Z"
  },
  {
    "title": "‘Entertainment Welfare’: Greg Gutfeld Confronts NYT Journo With the Truth of Late-Night TV’s Demise",
    "description": "Network television late-night shows are finally dying despite years of plummeting ratings. Greg Gutfeld, whose Fox News late-night cable show,...",
    "link": "https://twitchy.com/warren-squire/2025/11/09/greg-gutfeld-leftwing-late-night-shows-have-been-propped-up-by-entertainment-welfare-n2421433",
    "timestamp": "2025-11-09T05:22:39Z"
  },
  {
    "title": "One Month into Gaza Ceasefire, what does Palestinians’ Future look like?",
    "description": "Paul Rogers ( openDemocracy.net ) - Less than a month ago, received wisdom was that Donald Trump was so angered by the Israeli bombing of Hamas negotiators in Qatar that he had forced Binyamin Netanyahu to agree to a peace deal. The first stage of that deal w…",
    "link": "https://www.juancole.com/2025/11/ceasefire-palestinians-future.html",
    "timestamp": "2025-11-09T05:04:24Z"
  },
  {
    "title": "Trump has accused Venezuelan boat crews of being narco-terrorists. The truth, AP found, is more nuanced",
    "description": "GÜIRIA, Venezuela (AP) — One was a fisherman struggling to eke out a living on $100 a month. Another was a career criminal. A third was a former military cadet. And a fourth was a down-on-his-luck bus driver. The men had little in common beyond their Venezuel…",
    "link": "https://freerepublic.com/focus/f-news/4351549/posts",
    "timestamp": "2025-11-09T05:01:47Z"
  },
  {
    "title": "'Think' Tanks vs. Doers",
    "description": "I confess to a bias against political think tanks. If candidates can’t figure out what they believe in and why they do, armies of bow-tied college grads aren’t the answer: Better candidates are.\r\n\r\nI feel the same way about campaign consu...",
    "link": "https://www.americanthinker.com/articles/2025/11/think_tanks_vs_doers.html",
    "timestamp": "2025-11-09T05:00:00Z"
  },
  {
    "title": "Has Donald Trump really gone Joe Biden?",
    "description": "The modern Democrat party is defined by projection. Dictionary.com helpfully defines the word:\r\n\r\n\r\nThe tendency to ascribe to another person feelings, thoughts, or attitudes present in oneself, or to regard external reality as embodying such fe...",
    "link": "https://www.americanthinker.com/blog/2025/11/has_donald_trump_gone_biden.html",
    "timestamp": "2025-11-09T05:00:00Z"
  },
  {
    "title": "Heads start rolling at the BBC for defaming Donald Trump",
    "description": "I grew up in a home that revered the BBC, which gave us the wonders of some of the best Masterpiece Theater productions (e.g., The Six Wives of Henry VIII, Elizabeth I, I, Claudius, etc.), along with delightful comedies (e.g., Monty Python’s Fl...",
    "link": "https://www.americanthinker.com/blog/2025/11/heads_start_rolling_at_the_bbc_for_defaming_donald_trump.html",
    "timestamp": "2025-11-09T05:00:00Z"
  },
  {
    "title": "Gag-inducing: Gavin Newsom lectures President Trump about 'God's will'",
    "description": "There's probably no better indicator of Gavin Newsom running for president than his sudden interest in promoting what he calls 'God's will.'\r\n\r\nHere's his repulsive media interview with Jake Tapper:\r\n\r\n\r\n\r\nGavin Newsom takes a mom...",
    "link": "https://www.americanthinker.com/blog/2025/11/gag_inducing_gavin_newsom_lectures_president_trump_about_god_s_will.html",
    "timestamp": "2025-11-09T05:00:00Z"
  },
  {
    "title": "WSJ runs a sorry op-ed blaming Trump for Venezuelans' flight from socialism",
    "description": "Is Trump-hate so overwhelming at the Wall Street Journal's editorial page that they can't even read their own columnists and reporters, who've done pretty good reporting over the years on Venezuela's socialist downhill slide?\r\n\r\nYou&#...",
    "link": "https://www.americanthinker.com/blog/2025/11/wsj_runs_a_sorry_op_ed_blaming_trump_for_venezuelans_flight_from_socialism.html",
    "timestamp": "2025-11-09T05:00:00Z"
  },
  {
    "title": "As COP30 gathers, what's the latest in climate science?",
    "description": "Sea levels are rising faster now too – at about 4.5\nmillimeters per year over the last decade, compared with 1.85 mm\nper year measured across the decades since 1900",
    "link": "https://www.thehindubusinessline.com/news/as-cop30-gathers-whats-the-latest-in-climate-science/article70258721.ece",
    "timestamp": "2025-11-09T04:54:45Z"
  },
  {
    "title": "Is Trump a Socialist?",
    "description": "Donald Trump’s new stock-buying strategy isn’t socialism, but it is a step toward a government-controlled economy. Recently, a handful of people—none of whom have ever invited me to their birthday party—accused President Donald Trump of being a socialist. Gav…",
    "link": "https://freerepublic.com/focus/f-news/4351547/posts",
    "timestamp": "2025-11-09T04:53:23Z"
  },
  {
    "title": "‘Saturday Night Live’ Features Donald Trump Ignoring Rising Prices And An Election Rebuke, As Well As The Guy Who Collapsed In The Oval Office",
    "description": "James Austin Johnson’s Donald Trump returned to the Saturday Night Live cold open, this time in a spoof of the moment this week when a man collapsed in the Oval Office during a press conference on lowering the cost of weight-loss drugs. In the skit, Trump ign…",
    "link": "http://deadline.com/2025/11/saturday-night-live-trump-election-oval-office-1236611884/",
    "timestamp": "2025-11-09T04:51:24Z"
  }
]