[
  {
    "title": "Maurene Comey, daughter of James Comey, is fired from her job as a federal prosecutor (Erica Orden/Politico)",
    "description": "Erica Orden / Politico:\nMaurene Comey, daughter of James Comey, is fired from her job as a federal prosecutor … In recent weeks, President Donald Trump and Attorney General Pam Bondi have faced a firestorm of criticism over their decision not to release addit…",
    "link": "https://www.memeorandum.com/250716/p154",
    "timestamp": "2025-07-16T22:50:00Z"
  },
  {
    "title": "Trump didn't post 'MAGA agrees that 14 year-old girls are almost women anyway'",
    "description": "Pressure has mounted for the release of more files related to sex offender Jeffrey Epstein, whom Trump once said was a \"terrific guy.\"",
    "link": "https://www.snopes.com//fact-check/trump-maga-truth-social-post/",
    "timestamp": "2025-07-16T22:49:00Z"
  },
  {
    "title": "US judge fails to rule on status of returned deportee Abrego; future of smuggling case uncertain",
    "description": "NASHVILLE, Tennessee (Reuters) -A federal judge in Tennessee failed to rule on Wednesday on the legal status of Kilmar Abrego, the migrant returned to the U.S. after being wrongly deported to El Salvador, prolonging uncertainty about the fate of Abrego, who w…",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/us-judge-fails-to-rule-on-status-of-returned-deportee-abrego-future-of-smuggling-case-uncertain",
    "timestamp": "2025-07-16T22:48:00Z"
  },
  {
    "title": "'You will see the stock market crash': MAGA senator puts Trump on notice",
    "description": "Sen. John Kennedy (R-LA) is leading the charge to warn President Donald Trump that his threats against Federal Reserve Chairman Jerome Powell, which have brewed for weeks, would be a disaster, CNN's Phil Mattingly reported on Wednesday.\"Turning back to what T…",
    "link": "https://www.rawstory.com/john-kennedy-2673283811/",
    "timestamp": "2025-07-16T22:47:02Z"
  },
  {
    "title": "Walmart is cutting hundreds of store-support roles, Bloomberg News reports",
    "description": "The U.S. retail bellwether is eliminating the market coordinator job that supports some managers, the report said.  The company is also cutting some coach...",
    "link": "https://finance.yahoo.com/news/walmart-cutting-hundreds-store-support-224214079.html",
    "timestamp": "2025-07-16T22:42:14Z"
  },
  {
    "title": "Israel Begins Talks With Countries That Could Take In Gazans Under Trump Plan",
    "description": "EL AVIV—Israel on Monday began negotiations with several countries it hopes will take in Gazans as part of a mass emigration plan first proposed by President Donald Trump, two Israeli officials with knowledge of the talks told the Washington Free Beacon. Isra…",
    "link": "https://freerepublic.com/focus/f-news/4329081/posts",
    "timestamp": "2025-07-16T22:42:02Z"
  },
  {
    "title": "US resumes third country deportations",
    "description": "The US resumed deportation flights to so-called “third countries” after the Supreme Court cleared the way for the controversial practice.\nFive migrants from five different countries were flown on Tuesday to the small Southern African nation of Eswatini. The D…",
    "link": "https://biztoc.com/x/cc548a4f5192844d",
    "timestamp": "2025-07-16T22:41:23Z"
  },
  {
    "title": "US resumes third country deportations",
    "description": "The US resumed deportation flights to so-called “third countries” after the Supreme Court cleared the way for the controversial practice.\nFive migrants from five different countries were flown on Tuesday to the small Southern African nation of Eswatini. The D…",
    "link": "https://biztoc.com/x/cc548a4f5192844d",
    "timestamp": "2025-07-16T22:41:23Z"
  },
  {
    "title": "Trump's Epstein strategy could pit him against loyal supporters",
    "description": "In defending how his administration is handling supposed files on Jeffrey Epstein, he says \"some stupid Republicans\" fell for a hoax.",
    "link": "https://www.bbc.com/news/articles/cjrlg94wnq9o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-16T22:39:16Z"
  },
  {
    "title": "Republican Senator Demands Trump ‘Just Release the Damn Files’ on Epstein",
    "description": "Sen. Thom Tillis called on President Donald Trump to release all files relating to the case of deceased child sex trafficker Jeffrey Epstein.\nThe post Republican Senator Demands Trump ‘Just Release the Damn Files’ on Epstein first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/republican-senator-demands-trump-just-release-the-damn-files-on-epstein/",
    "timestamp": "2025-07-16T22:38:47Z"
  },
  {
    "title": "Assaults against US immigration officials surge by 830%",
    "description": "US immigration officials have faced a major surge in assaults against them this year, the US Department of Homeland Security has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621593-us-ice-assaults-surge/",
    "timestamp": "2025-07-16T22:37:53Z"
  },
  {
    "title": "'Amazing': Enraged Musk calls out Trump in spree of posts as feud reignites",
    "description": "President Donald Trump's wealthiest supporter, Elon Musk, unleashed a posting spree on X about the files around the federal investigation into sex trafficker Jeffrey Epstein. It was only a month ago that Musk had his falling out with Trump, where he alleged t…",
    "link": "https://www.rawstory.com/elon-musk-epstein/",
    "timestamp": "2025-07-16T22:37:22Z"
  },
  {
    "title": "‘They Were Going To Kill Us’: Reporter Claims He Got ‘PTSD’ After Trump Shooting Because Crowd Blamed Media",
    "description": "Scott MacFarlane claimed that he received a Post-Traumatic Stress Disorder diagnosis in the aftermath of the assassination attempt against Donald Trump.",
    "link": "https://dailycaller.com/2025/07/16/they-were-going-to-kill-us-reporter-claims-he-got-ptsd-after-trump-shooting-because-crowd-blamed-media/",
    "timestamp": "2025-07-16T22:35:17Z"
  },
  {
    "title": "U.S. stocks close higher after Trump denies plans to fire Fed chair",
    "description": "NEW YORK, July 16 (Xinhua) -- U.S. stocks ended higher on Wednesday after U.S. President Donald Trump tempered speculation about potential changes at the Federal Reserve. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/us-stocks-close-higher-after-trump-denies-plans-to-fire-fed-chair",
    "timestamp": "2025-07-16T22:35:00Z"
  },
  {
    "title": "Russia Launches Drone Swarm Attack on Ukraine as Trump's Peace Deadline Nears",
    "description": "Russian forces launched a massive drone attack against Ukraine on Wednesday, with targets including Kryvyi Rih, the hometown of Ukrainian President Volodymyr Zelensky.\nThe post Russia Launches Drone Swarm Attack on Ukraine as Trump’s Peace Deadline Nears appe…",
    "link": "https://www.breitbart.com/europe/2025/07/16/russia-launches-drone-swarm-attack-on-ukraine-as-trumps-peace-deadline-nears/",
    "timestamp": "2025-07-16T22:33:32Z"
  },
  {
    "title": "The crimes Trump doesn’t care about",
    "description": "When the topic is immigrants or Democratic cities, President Donald Trump loves to talk about crime. But when it comes to Wall Street bankers and C-suite executives, he tends to keep his mouth shut. Within the first 100 days of his second term, Trump pardoned…",
    "link": "https://www.vox.com/policy/419953/white-collar-crime-trump-department-of-justice-enforcement-priorities",
    "timestamp": "2025-07-16T22:31:38Z"
  },
  {
    "title": "The Split over Epstein Tells Us Something Important about the MAGA Movement",
    "description": "Last Sunday, Donald Trump’s Department of Justice announced that they had concluded that Jeffrey Epstein did not have a list of clients and that the convicted sex offender and formerly well-connected financier really did die by suicide. To back that up, the D…",
    "link": "https://www.shtfplan.com/headline-news/the-split-over-epstein-tells-us-something-important-about-the-maga-movement",
    "timestamp": "2025-07-16T22:30:25Z"
  },
  {
    "title": "Alcoa Says Trump Tariff Added $115 Million in Aluminum Costs",
    "description": "Alcoa Corp., the largest US aluminum producer, said tariffs on imports from Canada cost it $115 million in the second quarter, showing how US President Donald Trump’s trade agenda has affected the industry.",
    "link": "https://financialpost.com/pmn/business-pmn/alcoa-says-trump-tariff-added-115-million-in-aluminum-costs",
    "timestamp": "2025-07-16T22:30:19Z"
  },
  {
    "title": "Trump says Coca-Cola agreed to use real cane sugar in U.S. after talks",
    "description": "U.S. President Donald Trump said on Wednesday that Coca-Cola had agreed to use cane sugar in its beverages in the U.S. after his discussions with the company.\n“I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and the…",
    "link": "https://biztoc.com/x/5e6c48f66d932c2a",
    "timestamp": "2025-07-16T22:30:05Z"
  },
  {
    "title": "What happens if Trump fires Fed Chair Powell: 'This would be a mess,' analysts warn",
    "description": "A new research note gaming out possible scenarios if President Donald Trump decides to fire Federal Reserve Chairman Jerome Powell warns that, regardless of what exactly happens next, \"this would be a mess.\"\n\"We expect, as does everyone else, that it would be…",
    "link": "https://biztoc.com/x/ffb5aaaaafe9f768",
    "timestamp": "2025-07-16T22:29:45Z"
  },
  {
    "title": "Trump says Coca-Cola will use real sugar in its US flagship drink. The company isn't confirming that",
    "description": "Make American Coke Great Again?  President Donald Trump said Wednesday that Coca-Cola has agreed to use real cane sugar in its flagship soft drink in the U.S...",
    "link": "https://www.yahoo.com/news/trump-says-coca-cola-real-222843451.html",
    "timestamp": "2025-07-16T22:28:43Z"
  },
  {
    "title": "Steve Scalise: Inside the Final Push to Pass Trump’s ‘Big, Beautiful Bill’",
    "description": "It was an incredibly hectic and high-stakes 48 hours as House leadership cobbled together the votes to send the One Big, Beautiful Bill to President... Read More\nThe post Steve Scalise: Inside the Final Push to Pass Trump’s ‘Big, Beautiful Bill’ appeared firs…",
    "link": "https://www.dailysignal.com/2025/07/16/steve-scalise-inside-the-final-push-to-pass-trumps-big-beautiful-bill/",
    "timestamp": "2025-07-16T22:28:09Z"
  },
  {
    "title": "Trump says Coca-Cola to switch to cane sugar in US",
    "description": "Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media. The company currently uses high-fructose corn syrup (HFCS) in its domestic beverages — a sweetener that has long drawn…",
    "link": "https://www.digitaljournal.com/world/trump-says-coca-cola-to-switch-to-cane-sugar-in-us/article",
    "timestamp": "2025-07-16T22:27:32Z"
  },
  {
    "title": "Trump Says Coca-Cola To Switch To Cane Sugar In US",
    "description": "Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.",
    "link": "https://www.ibtimes.com/trump-says-coca-cola-switch-cane-sugar-us-3778687",
    "timestamp": "2025-07-16T22:27:14Z"
  },
  {
    "title": "Zohran Mamdani Meets With Democrats As He Attempts To Gather Key Support",
    "description": "The meeting comes as the party navigates internal divisions over policy direction and electoral strategy in the run-up to the November general election.",
    "link": "https://www.newsweek.com/zohran-mamdani-meets-democrats-gather-support-2099996",
    "timestamp": "2025-07-16T22:26:25Z"
  },
  {
    "title": "‘You appointed him!’ Stunned Jake Tapper yells at ‘confused’ Trump on CNN",
    "description": "CNN host Jake Tapper was shocked at President Donald Trump's new claims regarding Federal Reserve Chairman Jerome Powell. On Wednesday, Trump told reporters that Powell is a \"terrible Fed chair\" and that he is \"surprised [Powell] was appointed.\" Those comment…",
    "link": "https://www.rawstory.com/jake-tapper-2673283709/",
    "timestamp": "2025-07-16T22:25:02Z"
  },
  {
    "title": "“It’s like a death”: Donald Trump linked to Gisele Bündchen’s split from Tom Brady as Supermodel finally exposes truth",
    "description": "Tom Brady and Gisele Bündchen's divorce sparked speculation, fueled by the infamous MAGA hat in Brady's locker. Bündchen addressed rumors linking Donald Trump to their split, clarifying in an interview that politics didn't cause their separation. She emphasiz…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/its-like-a-death-donald-trump-linked-to-gisele-bndchens-split-from-tom-brady-as-supermodel-finally-exposes-truth/articleshow/122574778.cms",
    "timestamp": "2025-07-16T22:24:35Z"
  },
  {
    "title": "Whitmer says ‘massive economic uncertainty’ is to blame on semiconductor project failure in Michigan",
    "description": "LANSING, Mich. (AP) — Plans to build a semiconductor manufacturing plant in Michigan have fallen through and Democratic Gov. Gretchen Whitmer said Wednesday that “massive economic uncertainty” is to blame. Bringing the company to Michigan was a key goal for W…",
    "link": "https://financialpost.com/pmn/whitmer-says-massive-economic-uncertainty-is-to-blame-on-semiconductor-project-failure-in-michigan",
    "timestamp": "2025-07-16T22:24:24Z"
  },
  {
    "title": "Trump says Coca-Cola to switch to cane sugar in US",
    "description": "Beverage giant Coca-Cola has agreed to use real cane sugar in its US production, President Donald Trump announced Wednesday on social media.\"I have been...",
    "link": "https://www.yahoo.com/news/trump-says-coca-cola-switch-222408895.html",
    "timestamp": "2025-07-16T22:24:08Z"
  },
  {
    "title": "Trump Media files AI trademarks to expand Truth Social, present ‘non-woke’ news",
    "description": "Trump Media and Technology Group Corp, a company majority-owned by President Donald Trump, has filed AI trademarks to expand Truth Social and become a source for \"non-woke\" news.",
    "link": "https://cointelegraph.com/news/trump-media-ai-trademarks-truth-social-non-woke-news",
    "timestamp": "2025-07-16T22:23:57Z"
  },
  {
    "title": "Kevin Spacey posted about releasing Epstein files?",
    "description": "In mid-July 2025, actor Kevin Spacey made a post on X reading: \"Release the Epstein files. All of them. For those of us with nothing to fear, the truth can't come soon enough.\"",
    "link": "https://www.snopes.com//fact-check/kevin-spacey-epstein-files/",
    "timestamp": "2025-07-16T22:22:00Z"
  },
  {
    "title": "Trump and Netanyahu dither on Gaza ceasefire",
    "description": "Congressman Randy Fine makes a new bigoted foray.",
    "link": "https://electronicintifada.net/blogs/michael-f-brown/trump-and-netanyahu-dither-gaza-ceasefire",
    "timestamp": "2025-07-16T22:20:34Z"
  },
  {
    "title": "What happens if Trump fires Fed Chair Powell: 'This would be a mess,' analysts warn",
    "description": "Former deputy Treasury Secretary Roger Altman said he did not think Jerome Powell would agree to leave if the president asked him to.",
    "link": "https://www.cnbc.com/2025/07/16/trump-fed-powell-court.html",
    "timestamp": "2025-07-16T22:20:21Z"
  },
  {
    "title": "Coca-Cola agrees to use real cane sugar in its soda, Trump says",
    "description": "President Donald Trump said the Coca-Cola company has agreed to start using real cane sugar in its soda after he persuaded them on the issue.The president made the announcement on his social media account on Wednesday. Many praised the decision and said they …",
    "link": "https://www.theblaze.com/news/trump-coca-cola-cane-sugar",
    "timestamp": "2025-07-16T22:20:16Z"
  },
  {
    "title": "Trump says he made a deal with Coca-Cola. It'd turn all Coke into Mexican Coke",
    "description": "President Donald Trump on Wednesday said he'd reached a deal with Coca-Cola to swap corn syrup for cane sugar in its US formula.\nKevin Carter/Getty Images\nPresident Donald Trump said that Coca-Cola agreed to swap corn syrup for real cane sugar in Coke.\nCoca-C…",
    "link": "https://biztoc.com/x/15520ceb74f3264b",
    "timestamp": "2025-07-16T22:18:47Z"
  },
  {
    "title": "Trump-Hating Native American Tribe Gets Millions In Taxpayer Dollars As Leaders Hobnob With Dems",
    "description": "A Native American tribe in California whose leaders aggressively back Democrat candidates has raked in millions of taxpayer dollars for needy families while operating a lucrative casino, a watchdog found. The American Accountability Foundation released a repo…",
    "link": "https://freerepublic.com/focus/f-news/4329075/posts",
    "timestamp": "2025-07-16T22:17:48Z"
  },
  {
    "title": "RINO Congresswoman Maria Salazar Introduces Bipartisan Mass Amnesty “Dignity Act” to Provide “Earned Opportunity” for Millions of Illegals to Stay and Work – “Yes, They Broke the Law, but…” (VIDEO)",
    "description": "Pro-illegal alien Congresswoman Maria Salazar (R-FL) announced on Wednesday that she introduced a bipartisan bill, co-sponsored by Rep. Veronica Escobar (D-TX), to grant work visas to illegal aliens. She says the bill is “not amnesty,” but work visas for ille…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329074/posts",
    "timestamp": "2025-07-16T22:16:01Z"
  },
  {
    "title": "Xi Jinping is losing his grip on China— and Trump can give him a push",
    "description": "A change in China's leadership could be an unalloyed benefit to the United States and our democratic allies worldwide.",
    "link": "https://nypost.com/2025/07/16/opinion/xi-jinping-is-losing-power-in-china-trump-must-push-reform/",
    "timestamp": "2025-07-16T22:15:58Z"
  },
  {
    "title": "Federal lawsuit seeks to stop ICE agents from arresting people at immigration courts",
    "description": "The class-action lawsuit says the arrests have stripped them of rights under U.S. immigration laws.",
    "link": "https://www.bostonherald.com/2025/07/16/immigration-court-arrests-lawsuit/",
    "timestamp": "2025-07-16T22:14:29Z"
  },
  {
    "title": "Federal lawsuit seeks to stop ICE agents from arresting people at immigration courts",
    "description": "The class-action lawsuit says the arrests have stripped them of rights under U.S. immigration laws.",
    "link": "https://www.denverpost.com/2025/07/16/immigration-court-arrests-lawsuit/",
    "timestamp": "2025-07-16T22:14:29Z"
  },
  {
    "title": "Donald Trump's 'significant' health issue addressed by doctor after worrying photo - NewsBreak",
    "description": "EXCLUSIVE: A health expert has suggested that Donald Trump's swollen ankles could be the sign of something major as speculation about his health continues",
    "link": "https://www.newsbreak.com/share/4111484021135-donald-trump-s-significant-health-issue-addressed-by-doctor-after-worrying-photo?s=a2&amp;share_destination_id=MTkyMDAwNjg3LTE3NTI3MDM4NDg3NTU%3D&amp;pd=0Czc9HH5&amp;hl=en_US&amp;send_time=1752703848&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.27.2%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v7%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v5",
    "timestamp": "2025-07-16T22:13:33Z"
  },
  {
    "title": "Bible Scholars Now Believe The Seventh Seal In The Book Of Revelation Is The Full Release Of The Epstein List",
    "description": "LONDON — In the wake of recent geopolitical developments, a team of esteemed biblical scholars said they now believe that the seventh seal in the book of Revelation was likely to be the release of the Epstein list.",
    "link": "https://babylonbee.com/news/bible-scholars-now-believe-the-seventh-seal-in-the-book-of-revelation-is-the-full-release-of-the-epstein-list",
    "timestamp": "2025-07-16T22:12:39Z"
  },
  {
    "title": "Benny Johnson Bludgeons Trump for ‘Abysmal’ Handling of Epstein Files: ‘So Much’ Information Was Brought Up By Trump Himself",
    "description": "In another clip from the show flagged by Collin Rugg, Johnson directly criticized Trump and his administration for their \"abysmal\" handling of the Epstein matter, and cued up several video clips to argue his point. \nThe post Benny Johnson Bludgeons Trump for …",
    "link": "https://www.mediaite.com/media/podcasts/benny-johnson-bludgeons-trump-for-abysmal-handling-of-epstein-files-so-much-information-was-brought-up-by-trump-himself/",
    "timestamp": "2025-07-16T22:11:17Z"
  },
  {
    "title": "Republicans Again Kneel Before Trump, Giving Up More Powers",
    "description": "The lack of courage in Congress to reassert its constitutional power of the purse has left senior lawmakers of both parties deeply frustrated.",
    "link": "https://www.huffpost.com/entry/donald-trump-recissions-congress_n_68781dcfe4b0e8b95ec836af",
    "timestamp": "2025-07-16T22:11:05Z"
  },
  {
    "title": "Where Is The Tariff Shock? It’s Complicated And Probably Still Coming",
    "description": "The likelihood of tariff impact maybe has started to show up. But there are other pressures that will hit close to home.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/07/16/where-is-the-tariff-shock-its-complicated-and-probably-still-coming/",
    "timestamp": "2025-07-16T22:10:56Z"
  },
  {
    "title": "Trump says he made a deal with Coca-Cola. It'd turn all Coke into Mexican Coke.",
    "description": "In a Truth Social post, President Donald Trump said he'd made a deal with Coca-Cola to replace corn syrup with real can sugar in its Coke drinks.",
    "link": "https://www.businessinsider.com/trump-says-coca-cola-drinks-real-cane-sugar-mexican-coke-2025-7",
    "timestamp": "2025-07-16T22:09:33Z"
  },
  {
    "title": "Trump says he’s ‘highly unlikely’ to fire Fed Chair Jerome Powell after floating that idea in private",
    "description": "WASHINGTON — President Donald Trump said Wednesday that he was “highly unlikely” to fire Federal Reserve Chair Jerome Powell, a public statement made less than 24 hours after suggesting in a private meeting that he was leaning in favor of dismissing the head …",
    "link": "https://biztoc.com/x/b79f6a5d3723f7fa",
    "timestamp": "2025-07-16T22:08:09Z"
  },
  {
    "title": "The online gunseller with Donald Trump Jr. on its board makes its market debut. Shares plunge",
    "description": "By MATT OTT\nWASHINGTON (AP) — Online firearms seller GrabAGun Digital Holdings, with the stock ticker “PEW,” made its market debut on Wednesday after board member and son of the U.S. president, Donald Trump Jr., rang the opening bell at the New York Stock Exc…",
    "link": "https://biztoc.com/x/9a7478ee8fd794f6",
    "timestamp": "2025-07-16T22:07:59Z"
  },
  {
    "title": "Trump says Coca-Cola will use cane sugar in US drinks - 'It's just better!'",
    "description": "'It's just better!' Trump says Coca-Cola to change key US ingredient\nPresident Donald Trump says Coca-Cola has agreed to use real cane sugar in its drinks sold in the US.\nCoca-Cola uses corn syrup in its American products, but Trump's Health Secretary Robert …",
    "link": "https://biztoc.com/x/1525704711517f69",
    "timestamp": "2025-07-16T22:07:39Z"
  },
  {
    "title": "Trump brokers deal for Coca-Cola to use ‘REAL Cane Sugar’ in U.S. Coke products",
    "description": "Coca-Cola will soon return to using real cane sugar in its U.S. products after decades of relying on high fructose corn syrup, according to none other than President Donald Trump, who claimed personal credit for brokering the shift. In a social media post, th…",
    "link": "https://biztoc.com/x/16863e1b0e19634b",
    "timestamp": "2025-07-16T22:07:33Z"
  },
  {
    "title": "California Republican lawmakers launch campaign to require voter ID",
    "description": "The proposal would mandate proof of citizenship for voter registration and ID verification at polling places. It also calls for an extra layer of identification for mail-in ballots.",
    "link": "https://www.kpbs.org/news/politics/2025/07/16/california-republican-lawmakers-launch-campaign-to-require-voter-id",
    "timestamp": "2025-07-16T22:07:16Z"
  },
  {
    "title": "Here’s Why Avelo Airlines Is Ending California and West Coast Flights Amid Controversy",
    "description": "Avelo Airlines is ending its California and West Coast flights following backlash over its deportation flight contracts with the Department of Homeland Security, citing financial challenges and operational changes.",
    "link": "https://www.kqed.org/news/12048388/heres-why-avelo-airlines-is-ending-california-and-west-coast-flights-amid-controversy",
    "timestamp": "2025-07-16T22:07:08Z"
  },
  {
    "title": "Fox News Sports Huddle Newsletter: Caitlin Clark's latest injury setback",
    "description": "Receive your weekly recap of all the happenings around the world of sports.",
    "link": "https://www.foxnews.com/sports/fox-news-sports-huddle-newsletter-caitlin-clarks-latest-injury-setback",
    "timestamp": "2025-07-16T22:06:56Z"
  },
  {
    "title": "You’re probably not going to see the Epstein Files",
    "description": "In the week and a half since the Justice Department released a memo saying there’s no evidence that indicted sex trafficker Jeffrey Epstein was murdered, that he never kept a “client list,” and that the department doesn’t plan on releasing any new documents o…",
    "link": "https://www.vox.com/today-explained-podcast/419905/jeffrey-epstein-files-client-list-donald-trump-pam-bondi",
    "timestamp": "2025-07-16T22:06:53Z"
  },
  {
    "title": "Merz visits UK as Europe closes ranks in face of threats",
    "description": "BERLIN/LONDON (Reuters) -Friedrich Merz embarks on his first trip to London as German chancellor on Thursday to meet with British Prime Minister Keir Starmer and sign a wide-ranging friendship treaty, as part of a broader push to reset the EU's relationship w…",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/merz-visits-uk-as-europe-closes-ranks-in-face-of-threats",
    "timestamp": "2025-07-16T22:05:00Z"
  },
  {
    "title": "UK lawmakers push to ban crypto donations in political campaigns",
    "description": "UK officials discuss a ban on crypto donations to political parties, citing transparency and foreign interference risks. As campaign funding evolves, lawmakers worldwide are reevaluating digital asset contributions.",
    "link": "https://cointelegraph.com/news/uk-lawmakers-push-ban-crypto-donations-political-campaigns",
    "timestamp": "2025-07-16T22:04:52Z"
  },
  {
    "title": "Congressional Dems’ Approval Hits Record Low",
    "description": "Only 19 percent of respondents to a new Quinnipiac University poll approve of the way the the party is handling their job in Congress",
    "link": "http://www.rollingstone.com/politics/politics-news/democrat-approval-hits-record-low-poll-1235387561/",
    "timestamp": "2025-07-16T22:04:48Z"
  },
  {
    "title": "At least two killed in ‘horrific’ Russian attack on Ukraine’s Dobropillia",
    "description": "President Volodymyr Zelenskyy described the attack as 'simply horrific, stupid Russian terror'.",
    "link": "https://www.aljazeera.com/news/2025/7/16/at-least-two-killed-in-horrific-russian-attack-on-ukraines-dobropillia",
    "timestamp": "2025-07-16T22:04:25Z"
  },
  {
    "title": "President Donald Trump signs historic NILs executive order, NCAA stars braced for major changes",
    "description": "President Donald Trump is set to issue an executive order that would establish national regulations for name, image, and likeness (NIL) activities in college athletics, in a potent",
    "link": "https://www.marca.com/en/ncaa/2025/07/17/6878213aca4741ce068b45a1.html",
    "timestamp": "2025-07-16T22:03:58Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks rebounded on Wednesday after President Donald Trump denied reports that he was close to ousting Powell as chairman of the Federal Reserve.",
    "link": "https://www.cnbc.com/2025/07/16/stock-market-today-live-updates.html",
    "timestamp": "2025-07-16T22:03:53Z"
  },
  {
    "title": "TSMC quarterly profit seen hitting record but Trump tariffs, forex a concern",
    "description": "TSMC-RESULTS/ (PIX):TSMC quarterly profit seen hitting record but Trump tariffs, forex a concern",
    "link": "https://www.livemint.com/companies/company-results/tsmc-quarterly-profit-seen-hitting-record-but-trump-tariffs-forex-a-concern-11752703347833.html",
    "timestamp": "2025-07-16T22:02:27Z"
  },
  {
    "title": "TSMC quarterly profit seen hitting record but Trump tariffs, forex a concern",
    "description": "TAIPEI :TSMC, the world's main producer of advanced AI chips, is expected to post a 52 per cent jump in second-quarter profit to record levels on Thursday, though U.S. tariffs and a strong Taiwan dollar could weigh on its outlook.Taiwan Semiconductor Manufact…",
    "link": "https://www.channelnewsasia.com/business/tsmc-quarterly-profit-seen-hitting-record-trump-tariffs-forex-concern-5242346",
    "timestamp": "2025-07-16T22:01:57Z"
  },
  {
    "title": "Democrats’ Medicaid Meltdown Totally Ignores Inconvenient Facts",
    "description": "Dems have called the GOP's Medicaid reforms “draconian,” but a closer look at the changes reveals that reforms are far more modest than the rhetoric suggests.",
    "link": "https://dailycaller.com/2025/07/16/democrats-medicaid-meltdown-totally-ignores-inconvenient-facts/",
    "timestamp": "2025-07-16T22:01:02Z"
  },
  {
    "title": "Advocacy group CEO claims he was offered $20 million to recruit protesters for anti-Trump demonstrations",
    "description": "Adam Swart revealed his company, Crowds on Demand, turned down a $20 million contract to organize anti-Trump protests, saying such demonstrations would be \"ineffective.\"",
    "link": "https://www.foxnews.com/media/advocacy-group-ceo-claims-he-offered-20-million-recruit-protesters-anti-trump-demonstrations",
    "timestamp": "2025-07-16T22:00:37Z"
  },
  {
    "title": "“Back in my day they used to make 22-episode seasons”: Has the enthusiasm for “Stranger Things” died of old age?",
    "description": "It's been 9 years since Stranger Things first came into our lives.\n\n\nThe release of a teaser for the final season of Stranger Things inspired jokes about how long the series has run vs. its episode count. The Netflix show will end at nine and a half years pas…",
    "link": "https://www.dailydot.com/entertainment/9-years-stranger-things-enthusiasm-died-of-old-age/",
    "timestamp": "2025-07-16T22:00:29Z"
  },
  {
    "title": "Jon Jones wants to face ‘whoever’s holding the belt’ at heavyweight on UFC White House card",
    "description": "Jon Jones can’t guarantee he’ll end up on the UFC White House card, but he expects that’s his next fight and he’s targeting the heavyweight champion as an opponent.",
    "link": "https://www.mmafighting.com/2025/7/16/24469023/jon-jones-wants-to-face-whoevers-holding-the-belt-at-heavyweight-on-ufc-white-house-card",
    "timestamp": "2025-07-16T22:00:00Z"
  },
  {
    "title": "Commentary: At 100, Dr Mahathir shows that legacy is never static",
    "description": "There is a profound, almost paradoxical, power in former Malaysian Prime Minister Dr Mahathir Mohamad issuing warnings about the trajectory of Western democracy, says Southeast Asian politics expert Sophie Lemiere.",
    "link": "https://www.channelnewsasia.com/commentary/malaysia-mahathir-mohamad-100-legacy-trump-western-double-standards-5241296",
    "timestamp": "2025-07-16T22:00:00Z"
  },
  {
    "title": "How Elon Musk’s Chatbot Turned Evil",
    "description": "From the daily newsletter: the politically incorrect A.I. model is influencing government policy.",
    "link": "https://www.newyorker.com/newsletter/the-daily/how-elon-musks-chatbot-turned-evil",
    "timestamp": "2025-07-16T22:00:00Z"
  },
  {
    "title": "Write What You Don’t Know",
    "description": "Author and writing coach Colleen Patrick shares how writing what you don't know (or at least as if you don't) leads to deeper writing.\nThe post Write What You Don’t Know appeared first on Writer's Digest.",
    "link": "https://www.writersdigest.com/write-what-you-dont-know-2",
    "timestamp": "2025-07-16T22:00:00Z"
  },
  {
    "title": "Trump brokers deal for Coca-Cola to use ‘REAL Cane Sugar’ in U.S. Coke products",
    "description": "First it was the Gulf of Mexico, now Trump is coming for \"Mexican Coke.\"",
    "link": "https://fortune.com/2025/07/16/trump-coca-cola-real-cane-sugar-mexican-coke-corn-syrup/",
    "timestamp": "2025-07-16T21:59:44Z"
  },
  {
    "title": "Tariffs are a tax. Are you already paying it?",
    "description": "It's been over three months since President Trump announced very big across-the-board tariffs on imports from nearly every territory on Earth–including uninhabited islands. It's a move he said would revitalize the U.S. economy.<br><br>Since that splashy White…",
    "link": "https://www.npr.org/2025/07/16/1255755373/tariffs-are-a-tax-are-you-already-paying-it",
    "timestamp": "2025-07-16T21:58:21Z"
  },
  {
    "title": "The online gunseller with Donald Trump Jr. on its board makes its market debut. Shares plunge",
    "description": "Shares of GrabAGun spiked at first but then sank, closing down nearly 24%.",
    "link": "https://www.bostonherald.com/2025/07/16/grabagun-market-debut/",
    "timestamp": "2025-07-16T21:58:10Z"
  },
  {
    "title": "Switzerland Copes With Jobless UN Bureaucrats Defunded by Trump",
    "description": "President Donald Trump’s “America First” policies are compelling the rest of the world to share the burden of dealing with displaced international bureaucrats. Thousands of... Read More\nThe post Switzerland Copes With Jobless UN Bureaucrats Defunded by Trump …",
    "link": "https://www.dailysignal.com/2025/07/16/switzerland-supports-un-bureaucrats-defunded-trump/",
    "timestamp": "2025-07-16T21:55:00Z"
  },
  {
    "title": "UK and Germany to Pledge to Defend Each Other in Reset of Ties",
    "description": "UK Prime Minister Keir Starmer and German Chancellor Friedrich Merz will sign a new Anglo-German treaty in London on Thursday that includes a commitment to assist each other in case of armed attack.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-and-germany-to-pledge-to-defend-each-other-in-reset-of-ties",
    "timestamp": "2025-07-16T21:54:43Z"
  },
  {
    "title": "Federal court says Arkansas can enforce ban on critical race theory in classrooms",
    "description": "A federal appeals court has ruled that Arkansas can enforce its ban on critical race theory in classrooms",
    "link": "https://abcnews.go.com/US/wireStory/federal-court-arkansas-enforce-ban-critical-race-theory-123815345",
    "timestamp": "2025-07-16T21:54:19Z"
  },
  {
    "title": "USAID food for nearly 30,000 hungry kids to be destroyed: Official",
    "description": "Senior US official calls destruction of 500 tonnes of biscuits a 'casualty' of the USAID shutdown.",
    "link": "https://www.aljazeera.com/news/2025/7/16/usaid-food-for-nearly-30000-hungry-kids-to-be-destroyed-official",
    "timestamp": "2025-07-16T21:54:17Z"
  },
  {
    "title": "U.S. judge fails to rule on status of returned deportee Abrego; future of smuggling case uncertain",
    "description": "A federal judge in Tennessee failed to rule on Wednesday on the legal status of Kilmar Abrego, the migrant returned to the U.S. after being wrongly deported to El Salvador, prolonging uncertainty about the fate of Abrego, who was in the courtroom. Federal pro…",
    "link": "https://japantoday.com/category/world/us-judge-fails-to-rule-on-status-of-returned-deportee-abrego-future-of-smuggling-case-uncertain",
    "timestamp": "2025-07-16T21:51:50Z"
  },
  {
    "title": "The Supreme Court has been captured by a dangerous cabal that resorts to sneaky and improper methods to get its ways",
    "description": "Adam Liptak has a useful article [gift link] summuziaring the Supreme Court’s run of unreasoned orders permitting Trump to go ahead with actions that are both highly consequential and illegal. At one point, he reminds us of Sam Alito’s defense of the Court’s …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/the-supreme-court-has-been-captured-by-a-dangerous-cabal-that-resorts-to-sneaky-and-improper-methods-to-get-its-ways",
    "timestamp": "2025-07-16T21:50:38Z"
  },
  {
    "title": "Trump's approval on immigration falls to lowest level of his term, Reuters/Ipsos poll finds",
    "description": "President Donald Trump's public approval rating on immigration fell in recent weeks to 41%, the lowest since his return to the White House, as Americans took a dour view of heavy-handed tactics, a Reuters/Ipsos poll that closed on Wednesday found. The same sh…",
    "link": "https://japantoday.com/category/world/trump%27s-approval-on-immigration-falls-to-lowest-level-of-his-term-reuters-ipsos-poll-finds",
    "timestamp": "2025-07-16T21:50:31Z"
  },
  {
    "title": "No cages, due process rights intact: ICE agents set the record straight on Trump's immigration enforcement",
    "description": "Four I.C.E. agents discuss their pride in protecting the public, explaining how detention centers operate and debunking claims about cages while detailing bond hearings",
    "link": "https://www.foxnews.com/media/no-cages-due-process-rights-intact-ice-agents-set-record-straight-trumps-immigration-enforcement",
    "timestamp": "2025-07-16T21:50:06Z"
  },
  {
    "title": "Trump blasts 'stupid' supporters as they question him over handling of Epstein case",
    "description": "The Trump administration has been accused of covering up lurid details of Epstein’s crimes to protect rich and powerful figures.",
    "link": "https://www.thejournal.ie/trump-calls-supporters-stupid-as-they-question-him-over-epstein-allegations-6765168-Jul2025/",
    "timestamp": "2025-07-16T21:48:51Z"
  },
  {
    "title": "Trump's approval on immigration falls to lowest level of his term, Reuters/Ipsos poll finds",
    "description": "WASHINGTON (Reuters) -President Donald Trump's public approval rating on immigration fell in recent weeks to 41%, the lowest since his return to the White House, as Americans took a dour view of heavy-handed tactics, a Reuters/Ipsos poll that closed on Wednes…",
    "link": "https://www.thestar.com.my/news/world/2025/07/17/trump039s-approval-on-immigration-falls-to-lowest-level-of-his-term-reutersipsos-poll-finds",
    "timestamp": "2025-07-16T21:47:00Z"
  },
  {
    "title": "Trump announces that Coca-Cola has agreed to use real cane sugar in the US",
    "description": "I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so. I’d like to thank all of those in authority at Coca-Cola. This will be a very good move by them — You’ll see. It’s just better!",
    "link": "https://freerepublic.com/focus/f-news/4329068/posts",
    "timestamp": "2025-07-16T21:46:26Z"
  },
  {
    "title": "How Trump Primed His Base to Turn Against Him",
    "description": "The president spent years undermining voters’ belief in the government. Now he’s asking them to just trust him.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/07/trump-epstein-scandal-maga-base/683571/",
    "timestamp": "2025-07-16T21:46:00Z"
  },
  {
    "title": "“Highly Overrated” Bruce Springsteen Wraps Biggest Tour of Career with $729.7 Million in Ticket Sales",
    "description": "More than twice the gross sales of his previous best-selling tour.\n“Highly Overrated” Bruce Springsteen Wraps Biggest Tour of Career with $729.7 Million in Ticket Sales\nScott Sterling",
    "link": "https://consequence.net/2025/07/bruce-springsteen-700-million-biggest-tour-ever/",
    "timestamp": "2025-07-16T21:44:21Z"
  },
  {
    "title": "Donald Trump's 'significant' health issue addressed by doctor after worrying photo - NewsBreak",
    "description": "EXCLUSIVE: A health expert has suggested that Donald Trump's swollen ankles could be the sign of something major as speculation about his health continues",
    "link": "https://www.newsbreak.com/share/4111484021135-donald-trump-s-significant-health-issue-addressed-by-doctor-after-worrying-photo?_f=app_share&amp;pd=0HGKfy4p&amp;lang=en_US&amp;send_time=1752702202&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.28.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v2%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v4%2Cns_foryou_blend_exp_25q2-v4&amp;s=i2",
    "timestamp": "2025-07-16T21:44:10Z"
  },
  {
    "title": "S&P/TSX composite nearly 100 points higher, U.S. markets also rise",
    "description": "TORONTO — Canada’s main stock index was up nearly 100 points to finish trading on Wednesday, helped by gains in the tech sector, while U.S. markets also rose following a broad reversal. The S&P/TSX composite index was up 98.83 points at 27,152.97. In New York…",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-nearly-100-points-higher-u-s-markets-also-rise",
    "timestamp": "2025-07-16T21:41:26Z"
  },
  {
    "title": "Investing News: Tech, Crypto, Banking, And Inflation Headlines Could Spur Volatility",
    "description": "Six investing headlines to watch plus three steps to prepare for stock price volatility this summer and beyond.",
    "link": "https://www.forbes.com/sites/catherinebrock/2025/07/16/investing-news-tech-crypto-banking-and-inflation-headlines-could-spur-volatility/",
    "timestamp": "2025-07-16T21:40:52Z"
  }
]