[
  {
    "title": "Trump says public entitlements like Social Security, Medicaid won't be touched in GOP budget bill",
    "description": "President Donald Trump said public entitlements, such as Social Security and Medicaid, will not be touched in the GOP's contentious new budget bill currently working its way through Congress, during a town hall Tuesday night hosted by NewsNation.",
    "link": "https://www.foxnews.com/politics/trump-says-public-entitlements-like-social-security-medicaid-wont-touched-gop-budget-bill",
    "timestamp": "2025-05-01T01:44:24Z"
  },
  {
    "title": "RFK Jr. says diabetes, chronic illnesses pose ‘existential threat’ — not measles outbreak: ‘Should be getting the headlines’",
    "description": "Kennedy said the media “never” covers the rates of autism or diabetes increasing, and they “only want to cover measles.”",
    "link": "https://nypost.com/2025/04/30/us-news/rfk-jr-says-diabetes-chronic-illnesses-pose-existential-threat-not-measles/",
    "timestamp": "2025-05-01T01:44:16Z"
  },
  {
    "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
    "description": "The US president blames the first quarterly GDP decline in three years on his Democratic predecessor.",
    "link": "https://www.bbc.co.uk/news/articles/c807n4rnmjyo",
    "timestamp": "2025-05-01T01:44:13Z"
  },
  {
    "title": "Trump tells business chiefs he needs 'little bit of time' as US economy shrinks",
    "description": "The US president blames the first quarterly GDP decline in three years on his Democratic predecessor.",
    "link": "https://www.bbc.com/news/articles/c807n4rnmjyo",
    "timestamp": "2025-05-01T01:44:13Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,162",
    "description": "These are the key events on day 1,162 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/1/russia-ukraine-war-list-of-key-events-day-1162",
    "timestamp": "2025-05-01T01:42:52Z"
  },
  {
    "title": "Tesla dismisses report of board plan to replace Elon Musk | CNN Business",
    "description": "Tesla’s chair Robyn Denholm has rejected a Wall Street Journal report that the company’s board has begun a search process for a new CEO to replace Elon Musk.",
    "link": "https://www.cnn.com/2025/04/30/business/tesla-board-elon-musk-ceo-search",
    "timestamp": "2025-05-01T01:41:54Z"
  },
  {
    "title": "George and Amal Clooney's globe-trotting lifestyle potentially in jeopardy under Trump sanctions",
    "description": "George Clooney and his humanitarian lawyer wife, Amal, have traveled all over the world but reportedly may have difficulty entering the U.S. due to an executive order.",
    "link": "https://www.foxnews.com/entertainment/george-amal-clooneys-globetrotting-lifestyle-potentially-jeopardy-under-trump-sanctions",
    "timestamp": "2025-05-01T01:41:00Z"
  },
  {
    "title": "'Not telling the truth': MSNBC host says only 'low information' voters believe Trump's lie",
    "description": "Television host Stephanie Ruhle warned Wall Street and Main Street sources are fully reacting with “paralysis, anger and devastation” at what Trump is doing to the economy.Recent numbers predict the U.S. economy will be shrinking for the first time since a ma…",
    "link": "https://www.rawstory.com/trump-voters-2671875109/",
    "timestamp": "2025-05-01T01:36:04Z"
  },
  {
    "title": "트럼프 경제 역성장, \"노동자 일자리 잃고 소규모 사업 망했다\"",
    "description": "Hiring at US companies moderated in April to the slowest pace in nine months, indicating waning demand for workers amid economic uncertainty. https://t.co/DBafhczwtn— Bloomberg (@business) April 30, 2025 Hiring at US companies declined to the slowest pace in …",
    "link": "https://ryueyes11.tistory.com/511598",
    "timestamp": "2025-05-01T01:35:52Z"
  },
  {
    "title": "Abrego Garcia judge says U.S. must give answers on his return",
    "description": "U.S. District Judge Paula Xinis ruled Wednesday that the government must answer questions on its efforts to bring Kilmar Abrego Garcia back to the United States.",
    "link": "https://www.japantimes.co.jp/news/2025/05/01/world/politics/abrego-garcia-judge-us/",
    "timestamp": "2025-05-01T01:34:00Z"
  },
  {
    "title": "Letters: New office aimed at boosting house-building needs additional primary legislation to achieve its aims",
    "description": "The Housing Minister has ann­ounced the creation of a Strategic Housing Activation Office (SHAO), as promised in the Programme for Government.",
    "link": "https://www.independent.ie/opinion/letters/letters-new-office-aimed-at-boosting-house-building-needs-additional-primary-legislation-to-achieve-its-aims/a393753516.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "Ellen Coyne: Donald Trump and the right-wing pronatalists want to help women have more babies – is that really such a bad idea?",
    "description": "This was a different kind of trad fest than we’re used to. ‘NatalCon’, which took place in Austin, Texas, in March, was only in its second ever year but it attracted the attention of national and international media.",
    "link": "https://www.independent.ie/opinion/comment/ellen-coyne-donald-trump-and-the-right-wing-pronatalists-want-to-help-women-have-more-babies-is-that-really-such-a-bad-idea/a1340302873.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "2023 video authentically shows Trump announcing plans for a tuition-free college program",
    "description": "A video authentically showed U.S. President Donald Trump announcing his plan for the American Academy, a free university funded by taxing, fining and suing large private universities.",
    "link": "https://www.snopes.com//fact-check/college-video-trump-tuition-free/",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "US economy shrank for first time in three years as Donald Trump says Americans will be paying more due to trade war",
    "description": "US president Donald Trump and his cabinet spent the better part of a meeting yesterday touting the administration’s record on everything from immigration to the economy.",
    "link": "https://www.independent.ie/world-news/north-america/us-economy-shrank-for-first-time-in-three-years-as-donald-trump-says-americans-will-be-paying-more-due-to-trade-war/a805253181.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "Samsung executives warn of trade uncertainty as demand for chips softens",
    "description": "Samsung Electronics reported slower profit growth and softening demand for storage chips, a sign that the US-China trade war may be triggering cuts in artificial intelligence hardware spending.",
    "link": "https://www.independent.ie/business/technology/samsung-executives-warn-of-trade-uncertainty-as-demand-for-chips-softens/a1508809097.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "AerCap raises guidance as profits rise at Dublin-based aircraft leasing company",
    "description": "AerCap, the world’s largest lessor of aircraft, has raised its profit guidance for the year on the back of a strong financial performance during the first quarter.",
    "link": "https://www.independent.ie/business/aercap-raises-guidance-as-profits-rise-at-dublin-based-aircraft-leasing-company/a2145670969.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "Philip Bump: Why Donald Trump may be trapped in the bubble that created him",
    "description": "Republican senators – who undoubtedly knew better – went along with the appointment of Pete Hegseth as US defence secretary. They took a bet that things wouldn’t get so bad under Hegseth that it was worth stirring up the fury of that pro-Trump bubble.",
    "link": "https://www.independent.ie/opinion/comment/philip-bump-why-donald-trump-may-be-trapped-in-the-bubble-that-created-him/a1956026464.html",
    "timestamp": "2025-05-01T01:30:00Z"
  },
  {
    "title": "Rahm Emanuel: Trump Is 'Ruling Versus Governing'",
    "description": "CNN senior political commentator Rahm Emanuel said Wednesday on \"Anderson Cooper 360\" that in his first hundred days, President Donald Trump was \"ruling versus governing.\"\nThe post Rahm Emanuel: Trump Is ‘Ruling Versus Governing’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/04/30/rahm-emanuel-trump-is-ruling-versus-governing/",
    "timestamp": "2025-05-01T01:29:39Z"
  },
  {
    "title": "“'We deserve respect, we expect respect”: Carney prepares for high stakes Trump meet",
    "description": "Mark Carney, Canada's new Prime Minister, plans a White House visit soon. This follows strained relations with the US. President Trump had suggested Canada become a US state. He also imposed tariffs, hurting Canada's economy. Carney aims to address these issu…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/we-deserve-respect-we-expect-respect-carney-prepares-for-high-stakes-trump-meet/articleshow/120781279.cms",
    "timestamp": "2025-05-01T01:29:33Z"
  },
  {
    "title": "Trump: We Might End Harvard Grants Entirely, They Don't 'Really Need It' and Teach Remedial Math",
    "description": "During an interview with NewsNation on Wednesday, President Donald Trump stated that there may be a permanent end to Harvard getting billions from the government and “We can grant that money to people that really need it,” and cited issues\nThe post Trump: We …",
    "link": "https://www.breitbart.com/clips/2025/04/30/trump-we-might-end-harvard-grants-entirely-they-dont-really-need-it-and-teach-remedial-math/",
    "timestamp": "2025-05-01T01:29:11Z"
  },
  {
    "title": "Bill O’Reilly Says He’s ‘Fine With Diversity’ and ‘Inclusion’: ‘It’s a Strength’",
    "description": "Conservative author Bill O'Reilly declared on Wednesday that he was \"fine with diversity\" and \"inclusion,\" calling it \"a strength.\"\nThe post Bill O’Reilly Says He’s ‘Fine With Diversity’ and ‘Inclusion’: ‘It’s a Strength’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/bill-oreilly-says-hes-fine-with-diversity-and-inclusion-its-a-strength/",
    "timestamp": "2025-05-01T01:26:21Z"
  },
  {
    "title": "Pfizer CEO Albert Bourla Praises Trump but Warns Against Tariffs: Chinese Biotech Science Progressing at ‘Speed of Light’",
    "description": "Pfizer Chairman and CEO Albert Bourla warned on Tuesday that Chinese biotechnology science is progressing at \"the speed of light,\" presenting commercial and national security risks to the U.S.\nThe post Pfizer CEO Albert Bourla Praises Trump but Warns Against …",
    "link": "https://www.breitbart.com/politics/2025/04/30/pfizer-ceo-albert-bourla-praises-trump-warns-tariffs-chinese-biotech-science-progressing/",
    "timestamp": "2025-05-01T01:25:51Z"
  },
  {
    "title": "Senate rejects bill to undo Trump's tariffs as US economy shrinks",
    "description": "The U.S. Senate blocked a Democratic resolution to overturn President Donald Trump’s sweeping global tariffs, with Vice President JD Vance breaking a tie. The vote followed a fresh Commerce Department report showing a 0.3% economic contraction—the first in th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/senate-rejects-bill-to-undo-trumps-tariffs-as-us-economy-shrinks/articleshow/120781220.cms",
    "timestamp": "2025-05-01T01:23:48Z"
  },
  {
    "title": "MAGA Influencers Now Have Their Own Special White House Briefings",
    "description": "\"My Uber drivers finally speak English again,\" one pro-Trump influencer eagerly told White House press secretary Karoline Leavitt.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-maga-influencers-briefings_n_68129d94e4b04cfa6e2b467d",
    "timestamp": "2025-05-01T01:22:08Z"
  },
  {
    "title": "Exclusive — Senate Majority Leader John Thune Targeting July 4 as Deadline to Send Reconciliation Plan Extending Trump Tax Cuts to President’s Desk",
    "description": "WASHINGTON — Senate Majority Leader John Thune told Breitbart News exclusively he is targeting a July 4 deadline to get the big budget reconciliation plan that would extend President Donald Trump’s 2017 tax cuts– adding no tax on tips, Social Security income,…",
    "link": "https://freerepublic.com/focus/f-news/4314311/posts",
    "timestamp": "2025-05-01T01:21:32Z"
  },
  {
    "title": "Trump 'Not Happy' With Declining US-China Trade",
    "description": "President Donald Trump said Wednesday he saw encouraging signs his tariffs were starting to have an impact, even while maintaining they “haven’t kicked in yet.” Trump paused higher duties on dozens of trading partners except China, which he hit with a 145% le…",
    "link": "https://biztoc.com/x/41f19abbad0fb9f4",
    "timestamp": "2025-05-01T01:17:34Z"
  },
  {
    "title": "Statewide poll shows falling approval for Trump in GA as GOP blames Biden for economic downfall",
    "description": "A new statewide poll shows numbers that suggest President Donald Trump’s approval rating is falling, and so is Georgians’ confidence in how he is handling the economy.",
    "link": "https://www.wsbtv.com/news/local/atlanta/statewide-poll-shows-falling-approval-trump-ga-gop-blames-biden-economic-downfall/JMXQKLZELZEHZODBU2SAPPLNME/",
    "timestamp": "2025-05-01T01:17:03Z"
  },
  {
    "title": "JD Vance Casts Tiebreaking Vote to Defeat Democrats on Trump Tariff Plan",
    "description": "The vice president stepped in to vote to table the resolution aimed at thwarting the president's power to impose global tariffs.",
    "link": "https://www.newsweek.com/jd-vance-casts-tiebreaking-vote-defeat-democrats-trump-tariff-plan-2066490",
    "timestamp": "2025-05-01T01:16:39Z"
  },
  {
    "title": "White House views Harvard’s recent changes as ‘positive’ but says more needs to be done, signals additional funding cuts",
    "description": "The White House characterized recent steps by Harvard University to rectify its apparent mishandling of antisemitism as “positive,” but signaled Wednesday that the university needs to do more to crack down on what it sees as anti-Israel bias on campus for the…",
    "link": "https://www.cnn.com/2025/04/30/us/harvard-university-white-house-antisemitism/index.html",
    "timestamp": "2025-05-01T01:12:08Z"
  },
  {
    "title": "Trump compliments Chris Cuomo over post-assassination attempt ‘comfort call’: ‘I actually appreciate your family’",
    "description": "“I do remember your call. I appreciate your call, and I actually appreciate your family. I've known your family for a long time,” Trump told the NewsNation anchor Wednesday night in a live-broadcast phone interview.",
    "link": "https://nypost.com/2025/04/30/us-news/trump-tells-chris-cuomo-i-actually-appreciate-your-family/",
    "timestamp": "2025-05-01T01:09:57Z"
  },
  {
    "title": "Pakistan says it shot down Indian drone along Kashmir border",
    "description": "Islamabad (AFP) April 29, 2025 -\n\n Pakistan's military shot down an Indian drone along the de facto Kashmir border, state radio in Islamabad reported on Tuesday, a week after the deadliest attack on civilians in the contested region in years.\n\nThe Indian army…",
    "link": "https://www.spacewar.com/reports/Pakistan_says_it_shot_down_Indian_drone_along_Kashmir_border_999.html",
    "timestamp": "2025-05-01T01:09:36Z"
  },
  {
    "title": "US military envoy in Argentina for 'regional security' talks",
    "description": "Buenos Aires (AFP) April 29, 2025 -\n\n A senior US military official met Argentina's President Javier Milei in Buenos Aires on Tuesday for talks about bolstering regional security, the two parties said.\n\nAdmiral Alvin Holsey, commander of the US Southern Comma…",
    "link": "https://www.spacewar.com/reports/US_military_envoy_in_Argentina_for_regional_security_talks_999.html",
    "timestamp": "2025-05-01T01:09:32Z"
  },
  {
    "title": "Facing Trump, Microsoft vows to protect Europeans' data",
    "description": "Brussels, Belgium (AFP) April 30, 2025 -\n\n Microsoft on Wednesday committed to boosting its presence in Europe and protecting European citizens' data against a backdrop of rising \"geopolitical volatility\".\n\nThe tech titan's pledges come as the return of Presi…",
    "link": "https://www.spacewar.com/reports/Facing_Trump_Microsoft_vows_to_protect_Europeans_data_999.html",
    "timestamp": "2025-05-01T01:08:54Z"
  },
  {
    "title": "Microsoft reports strong results driven by cloud and AI",
    "description": "San Francisco (AFP) April 30, 2025 -\n Technology giant Microsoft posted robust quarterly results on Wednesday, with revenue rising 13 percent to $70.1 billion, powered by a strong performance in its cloud computing and artificial intelligence businesses.\n\nThe…",
    "link": "https://www.spacedaily.com/reports/Microsoft_reports_strong_results_driven_by_cloud_and_AI_999.html",
    "timestamp": "2025-05-01T01:07:45Z"
  },
  {
    "title": "IBM to invest $150 bn in US over five years",
    "description": "New York (AFP) April 28, 2025 -\n\n Technology giant IBM announced plans on Monday to invest $150 billion in the United States over five years, including $30 billion earmarked for research and development to bolster manufacturing of mainframe and quantum comput…",
    "link": "https://www.spacedaily.com/reports/IBM_to_invest_150_bn_in_US_over_five_years_999.html",
    "timestamp": "2025-05-01T01:07:05Z"
  },
  {
    "title": "Sheryl Crow says armed man showed up at her home after she sold Tesla",
    "description": "Sheryl Crow says after she sold her Tesla in protest of Elon Musk, an armed man showed up at her home in Nashville, Tenn. She felt 'very afraid.'",
    "link": "https://ew.com/sheryl-crow-says-armed-man-showed-up-at-her-home-after-she-sold-tesla-11725439",
    "timestamp": "2025-05-01T01:06:37Z"
  },
  {
    "title": "The U.S. Must Not Gift Crimea to Putin",
    "description": "Washington’s latest peace proposal would reward Russia for starting its war in Ukraine.",
    "link": "http://foreignpolicy.com/2025/04/30/us-peace-plan-russia-ukraine-crimea/",
    "timestamp": "2025-05-01T01:05:47Z"
  },
  {
    "title": "Just In: Biden-Appointed Mexican Judge Stops Trump from Ending Taxpayer-Funded Lawyers for Migrants",
    "description": "American taxpayers must continue funding attorneys for Unaccompanied Alien Children (UACs) facing deportation, United States District Judge Araceli Martinez Olguin has ruled. Olguin, born in Mexico City, Mexico, and appointed to the U.S. District Court for th…",
    "link": "https://freerepublic.com/focus/f-news/4314308/posts",
    "timestamp": "2025-05-01T01:04:11Z"
  },
  {
    "title": "US and Ukraine ink strategic minerals deal after long delay",
    "description": "The United States and Ukraine have signed a long-negotiated investment deal granting Washington access to Kyiv’s critical mineral reserves. This agreement, framed as part of a broader peace strategy, comes as the war with Russia continues into its third year …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-and-ukraine-ink-strategic-minerals-deal-after-long-delay/articleshow/120781073.cms",
    "timestamp": "2025-05-01T01:03:54Z"
  },
  {
    "title": "US Secretary Of State Marco Rubio Dials S Jaishankar, Pak PM. What He Said",
    "description": "Amid escalating tension between India and Pakistan after the Pahalgam terror attack that claimed 26 lives, the United States has encouraged New Delhi and Islamabad to de-escalate tensions.",
    "link": "https://www.ndtv.com/world-news/us-secretary-of-state-marco-rubio-dials-s-jaishankar-pak-pm-what-he-said-8300322",
    "timestamp": "2025-05-01T01:03:12Z"
  },
  {
    "title": "President Trump COOKS Fake News ABC Reporter | Drew Hernandez",
    "description": "President Donald Trump clashed with cringe ABC News reporter Terry Moran during an exclusive interview marking his first 100 days in office on April 29, 2025, in the Oval Office. The interview turned contentious as Trump slammed Moran for asking “fake” and “s…",
    "link": "https://www.thegatewaypundit.com/2025/04/president-trump-cooks-fake-news-abc-reporter-drew/",
    "timestamp": "2025-05-01T01:00:47Z"
  },
  {
    "title": "Trump Starts Talking About ‘Harlem’ When Stephen A. Smith Asks About ‘Harvard’: ‘I Got a Very High Black Vote’",
    "description": "President Donald Trump offered a puzzling response to a question about his attempt to bring Harvard University to heel on Wednesday night.\nThe post Trump Starts Talking About ‘Harlem’ When Stephen A. Smith Asks About ‘Harvard’: ‘I Got a Very High Black Vote’ …",
    "link": "https://www.mediaite.com/tv/trump-starts-talking-about-harlem-when-asked-about-harvard/",
    "timestamp": "2025-05-01T01:00:17Z"
  },
  {
    "title": "Bannon Worries About Trump's 'Approval Ratings' Over Amazon's Display Of Tariff Costs",
    "description": "MAGA influencer Steve Bannon sounded the alarm over President Donald Trump's approval rating after reports said Amazon would display the cost of tariffs on product pages.\n\nAlthough Amazon has denied the reports, White House Press Secretary Karoline Leavitt ca…",
    "link": "https://crooksandliars.com/2025/04/steve-bannon-panics-about-trumps-approval",
    "timestamp": "2025-05-01T01:00:01Z"
  },
  {
    "title": "\"We're in a strong position\": Trump teases trade deals with India, South Korea, Japan",
    "description": "President Trump has revealed that the U.S. is in talks with India, South Korea, and Japan for potential trade deals as part of his broader tariff policy. Despite concerns about rising consumer costs, Trump insists the U.S. holds the upper hand in negotiations…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/were-in-a-strong-position-trump-teases-trade-deals-with-india-south-korea-japan/articleshow/120781101.cms",
    "timestamp": "2025-05-01T00:59:48Z"
  },
  {
    "title": "Republicans love Trump’s economy-destroying regressive taxes",
    "description": "Your reminder that Congress can take away the president’s power to drive the economy into the lake because he heard Cybertrucks can swim anytime, but the Republican conference won’t do that because they affirmatively support higher prices and fewer jobs: A bi…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/republicans-love-trumps-economy-destroying-regressive-taxes",
    "timestamp": "2025-05-01T00:59:20Z"
  },
  {
    "title": "Trump administration’s plans for tariff relief are a tacit admission of failure",
    "description": "President Donald Trump holds a chart as he delivers remarks on reciprocal tariffs during an event in the Rose Garden entitled \"Make America Wealthy Again\" at the White House on April 2, 2025.",
    "link": "https://biztoc.com/x/cf69e42840ad4398",
    "timestamp": "2025-05-01T00:55:44Z"
  },
  {
    "title": "100 Days: How Trump Tricked Democrats into Embracing 97/3 Issues",
    "description": "On Wednesday’s “Alex Marlow Show,” host and Breitbart Editor-in-Chief Alex Marlow stated that President Donald Trump has gotten Democrats to take ridiculous stances due to their blind hatred of him. Marlow said the first position is that “Harvard needs $8\nThe…",
    "link": "https://www.breitbart.com/clips/2025/04/30/100-days-how-trump-tricked-democrats-into-embracing-97-3-issues/",
    "timestamp": "2025-05-01T00:54:59Z"
  },
  {
    "title": "Trump backs Stephen A. Smith for possible 2028 bid for president: ‘I’d love to see him run’",
    "description": "The phone interview included Smith and former CNN anchor Chris Cuomo and former Fox News commentator Bill O’Reilly — with the conservative O’Reilly floating Smith’s candidacy, possibly in jest.…",
    "link": "https://nypost.com/2025/04/30/us-news/trump-backs-stephen-a-smith-for-possible-2028-run-for-president/",
    "timestamp": "2025-05-01T00:51:15Z"
  },
  {
    "title": "Town Hall Audience Bursts Into Laughter After Trump Says He Hasn’t Made Any Mistakes",
    "description": "The audience at NewsNation's town hall with President Donald Trump burst into laughter after Trump said he did not believe he had many any mistakes.\nThe post Town Hall Audience Bursts Into Laughter After Trump Says He Hasn’t Made Any Mistakes first appeared o…",
    "link": "https://www.mediaite.com/tv/town-hall-audience-bursts-into-laughter-after-trump-says-he-hasnt-made-any-mistakes/",
    "timestamp": "2025-05-01T00:49:14Z"
  },
  {
    "title": "The real lesson for Trump in today's disappointing GDP report",
    "description": "The Commerce Department's data showed a 0.3% GDP contraction, and Trump’s tariffs are a big reason why.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/gdp-report-trump-tariffs-trade-war-rcna203707",
    "timestamp": "2025-05-01T00:44:50Z"
  },
  {
    "title": "Trump company strikes Qatari golf resort deal in a sign it's not holding back from foreign business",
    "description": "Trump company strikes Qatari golf resort deal in a sign it's not holding back from foreign businessclick2houston.com",
    "link": "https://www.click2houston.com/news/politics/2025/04/30/trump-company-strikes-qatari-golf-resort-deal-in-a-sign-its-not-holding-back-from-foreign-business/",
    "timestamp": "2025-05-01T00:42:00Z"
  },
  {
    "title": "South Korea April exports surprisingly rise on robust chip demand",
    "description": "South Korea's exports surprisingly rose in April, led by strong chip sales, trade data showed on Thursday, although the auto sector was weighed by U.S...",
    "link": "https://finance.yahoo.com/news/south-korea-april-exports-surprisingly-004056059.html",
    "timestamp": "2025-05-01T00:40:56Z"
  },
  {
    "title": "Trump: Very good chance we will make deal with China",
    "description": "United States President Donald Trump phoned into a town hall hosted by NewsNation's Chris Cuomo and stressed that there is a \"very good chance\" that the US will make a deal with China.\n...",
    "link": "https://biztoc.com/x/2a834f1e3cd0c207",
    "timestamp": "2025-05-01T00:33:48Z"
  },
  {
    "title": "Mike Johnson has work to do convincing Donald Trump to slash Medicaid - Politico",
    "description": "Mike Johnson has work to do convincing Donald Trump to slash MedicaidPolitico Explainer: Republicans weigh cuts to Medicaid that could dramatically affect millionsReuters Republicans consider unraveling a key part of Obamacare in Trump agenda billNBC News 'Pr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177229343",
    "timestamp": "2025-05-01T00:32:56Z"
  },
  {
    "title": "'White Lotus' Feud? Everything to Know About Walton Goggins and Aimee Lou Wood's Rumored Drama After 'Cheap and Mean' Parody on 'SNL'",
    "description": "Feud rumors flared between 'The White Lotus' costars Walton Goggins and Aimee Lou Wood after a 'Saturday Night Live' sketch parodied the latter's character, Chelsea.",
    "link": "https://okmagazine.com/p/walton-goggins-aimee-lou-wood-feud-rumors/",
    "timestamp": "2025-05-01T00:30:00Z"
  },
  {
    "title": "Dutton hints at Coalition campaign failure as polls show Albanese majority in sight",
    "description": "A YouGov poll suggests Labor's momentum over the Coalition has firmed, with a two-party preferred vote approaching 53 per cent.",
    "link": "https://www.abc.net.au/news/2025-05-01/dutton-hints-at-coalition-campaign-failure/105237478",
    "timestamp": "2025-05-01T00:27:01Z"
  },
  {
    "title": "Kamala Harris to make 1st major speech since losing election in San Francisco",
    "description": "Former Vice President Kamala Harris is set to speak in San Francisco on Wednesday night in what's expected to be her biggest speech since losing the 2024 election to President Donald Trump.",
    "link": "https://www.ktvu.com/news/kamala-harris-make-1st-major-speech-since-losing-election-san-francisco",
    "timestamp": "2025-05-01T00:25:36Z"
  },
  {
    "title": "Ukraine Signs Rare Earth Minerals Agreement with U.S.",
    "description": "Treasury Secretary Scott Bessent announced that Ukraine has signed a \"historic economic partnership agreement\" with the United States that establishes the United States-Ukraine Reconstruction Investment Fund and allows the U.S. access to Ukraine's rare earth …",
    "link": "https://www.breitbart.com/europe/2025/04/30/ukraine-signs-rare-earth-minerals-agreement-u-s/",
    "timestamp": "2025-05-01T00:24:26Z"
  },
  {
    "title": "Senate rejects resolution to halt Trump’s global tariffs amid economic strain",
    "description": "Senate Republicans narrowly vote down Democratic resolution blocking Trump's global tariffs, giving president a modest win.",
    "link": "https://www.thehindubusinessline.com/news/world/senate-rejects-resolution-to-halt-trumps-global-tariffs-amid-economic-strain/article69512670.ece",
    "timestamp": "2025-05-01T00:24:18Z"
  },
  {
    "title": "100 days down, 1361 to go: Donald Trump’s blitz has barely begun – Audrey Young",
    "description": "OPINION: Kiwis just got a hint of how much America's lurch to the right will cost.",
    "link": "https://www.nzherald.co.nz/nz/politics/100-days-down-1361-to-go-donald-trumps-blitz-has-barely-begun-audrey-young/6LUQUC7IO5G3VHERCSJ72T4AZI/",
    "timestamp": "2025-05-01T00:22:33Z"
  },
  {
    "title": "Trump says he understands interest rates more than Fed chair",
    "description": "Donald Trump has continued to spruik his government's economic record, hours after a government report showed the US economy had contracted for the first time in three years.",
    "link": "https://www.abc.net.au/news/2025-05-01/trump-says-he-understands-interest-rates-more-than-fed-reserve/105237394",
    "timestamp": "2025-05-01T00:22:16Z"
  },
  {
    "title": "WATCH: Will Cain BLOWS UP Loathsome Rep. Dan Goldman With Multiple Truth Bombs After Goldman Questions Trump’s Cognitive State and Suggests Invoking the 25th Amendment",
    "description": "Will Cain GOES OFF on Rep Dan Goldman after he brings up the 25th amendment. Goldman: \"Well I don't think he is competent Will, I don't know what to tell you.\"\nThe post WATCH: Will Cain BLOWS UP Loathsome Rep. Dan Goldman With Multiple Truth Bombs After Goldm…",
    "link": "https://www.thegatewaypundit.com/2025/04/watch-will-cain-blows-up-loathsome-rep-dan/",
    "timestamp": "2025-05-01T00:20:15Z"
  },
  {
    "title": "Is WisdomTree Japan Hedged SmallCap Equity Fund (DXJS) the Best International Index Fund to Invest In?",
    "description": "We recently published a list of 9 Best International Index Funds to Invest In. In this article, we are going to take a look at where WisdomTree Japan Hedged ...",
    "link": "https://finance.yahoo.com/news/wisdomtree-japan-hedged-smallcap-equity-002005587.html",
    "timestamp": "2025-05-01T00:20:05Z"
  },
  {
    "title": "House GOP Must Convince Trump on Medicaid Cuts",
    "description": "“President Donald Trump is skeptical of congressional Republicans’ emerging plans to make deep cuts to Medicaid, the safety-net health program covering nearly 80 million Americans,“ Politico reports. “Speaker Mike Johnson and other House leaders are",
    "link": "https://politicalwire.com/2025/04/30/house-gop-must-convince-trump-on-medicaid-cuts/",
    "timestamp": "2025-05-01T00:19:28Z"
  },
  {
    "title": "CNN Data Chief Calls 'BS' On This Trump Polling Claim: 'Way Underwater!'",
    "description": "Harry Enten said the figure is \"historically low,\" and Trump is \"way below\" where his predecessors were at this point in their presidencies.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-trust-polling_n_6812a49be4b08d7465599082",
    "timestamp": "2025-05-01T00:18:17Z"
  },
  {
    "title": "Senate committee approves amendment stating criticism of Israeli government isn’t antisemitic",
    "description": "The amendment was proposed by Bernie Sanders, the Jewish progressive leader, and approved in a 12-11 vote in the Senate Health, Education, Labor and Pensions Committee.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-852218",
    "timestamp": "2025-05-01T00:17:35Z"
  },
  {
    "title": "Trump's photo of Abrego Garcia's tattoos was edited; no proof symbols are gang-related",
    "description": "A post from U.S. President Donald Trump showing Kilmar Abrego Garcia's hand tattoos was unedited and proves he was affiliated with the Salvadoran gang MS-13.",
    "link": "https://www.snopes.com//fact-check/abrego-garcia-tattoo-trump/",
    "timestamp": "2025-05-01T00:16:00Z"
  },
  {
    "title": "Senate rebuke on President Donald Trump's tariffs narrowly fails",
    "description": "As the economy wobbles under tariffs, select GOP senators joined with Democrats to vote against them.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/30/senate-rebuke-donald-trumps-tariffs/83352021007/",
    "timestamp": "2025-05-01T00:15:51Z"
  },
  {
    "title": "Taiwan confident of US support under Trump, minister says",
    "description": "In interview, Taiwan's minister of mainland affairs says Chinese President Xi is stoking 'fanatic nationalism'.",
    "link": "https://www.aljazeera.com/news/2025/5/1/taiwan-confident-of-us-support-under-trump-minister-says",
    "timestamp": "2025-05-01T00:15:19Z"
  },
  {
    "title": "Explainer: Republicans weigh cuts to Medicaid that could dramatically affect millions - Reuters",
    "description": "Explainer: Republicans weigh cuts to Medicaid that could dramatically affect millionsReuters Mike Johnson has work to do convincing Donald Trump to slash MedicaidPolitico Republicans consider unraveling a key part of Obamacare in Trump agenda billNBC News 'Pr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177229267",
    "timestamp": "2025-05-01T00:13:05Z"
  },
  {
    "title": "Ex-FBI informant who made bribery story about Bidens will stay in prison, judge rules",
    "description": "A federal judge in Los Angeles has denied the U.S. government's request to release a former FBI informant while he appeals his case",
    "link": "https://abcnews.go.com/US/wireStory/fbi-informant-made-bribery-story-bidens-stay-prison-121339531",
    "timestamp": "2025-05-01T00:10:53Z"
  },
  {
    "title": "Mike Johnson has work to do convincing Donald Trump to slash Medicaid (Politico)",
    "description": "Politico:\nMike Johnson has work to do convincing Donald Trump to slash Medicaid  —  House Republicans are relying on deep cuts to the safety-net health program to finance their megabill.  But the president is deeply wary.  —  President Donald Trump is skeptic…",
    "link": "https://www.memeorandum.com/250430/p149",
    "timestamp": "2025-05-01T00:10:01Z"
  },
  {
    "title": "Trump hints no more grants to Harvard: They are not behaving well",
    "description": "US President hints at halting federal grants to Harvard, citing concerns over the university's handling of speech, hiring, and recent pro-Palestinian Arab protests.",
    "link": "https://www.israelnationalnews.com/news/407669",
    "timestamp": "2025-05-01T00:09:36Z"
  },
  {
    "title": "US, Ukraine ink economic deal following Trump’s call for cost-sharing on war efforts",
    "description": "The deal aims to foster joint investment and improve Ukraine’s post-war economy while granting the US access to Ukraine’s rare earth minerals",
    "link": "https://www.thehindubusinessline.com/news/world/us-ukraine-ink-economic-deal-following-trumps-call-for-cost-sharing-on-war-efforts/article69512663.ece",
    "timestamp": "2025-05-01T00:09:16Z"
  },
  {
    "title": "Trump: Private Sector Investment Nearing $8 Trillion Since I Took Office",
    "description": "President Donald Trump said Wednesday that private sector investments into the United States since he returned to office are nearing $8 trillion.\nThe post Trump: Private Sector Investment Nearing $8 Trillion Since I Took Office appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/30/trump-private-sector-investment-nearing-8-trillion-since-i-took-office/",
    "timestamp": "2025-05-01T00:07:26Z"
  },
  {
    "title": "Pope Francis Successor? Gamblers Favour Parolin As Bookies Cash In On Conclave Speculation",
    "description": "As the Catholic Church moves towards selecting its next leader, global attention focuses on potential candidates.",
    "link": "https://www.ibtimes.com/pope-francis-successor-gamblers-favour-parolin-bookies-cash-conclave-speculation-3772054",
    "timestamp": "2025-05-01T00:05:25Z"
  },
  {
    "title": "Labour Should Be Ready to Bend Rules During Trade Talks, IPPR Says",
    "description": "The UK’s Labour government must be willing to bend international rules and ease its concerns over other countries’ human rights records when negotiating new trade partnerships, the left-wing Institute for Public Policy Research think tank said.",
    "link": "https://financialpost.com/pmn/business-pmn/labour-should-be-ready-to-bend-rules-during-trade-talks-ippr-says",
    "timestamp": "2025-05-01T00:03:00Z"
  },
  {
    "title": "Former CNN analyst says media turned blind eye to Biden's alleged decline because most 'vote for Democrats'",
    "description": "Chris Cillizza pushed back on the accusation that the media coordinated to conceal former President Biden's purported decline.",
    "link": "https://www.foxnews.com/media/former-cnn-analyst-says-media-turned-blind-eye-bidens-alleged-decline-because-most-vote-democrats",
    "timestamp": "2025-05-01T00:02:53Z"
  },
  {
    "title": "Trump Goes Full Grinch as Tariffs Threaten to Ruin Christmas",
    "description": "As the U.S. economy shrank for the first time in three years, President Trump dismissed concerns that Americans would pay the price for his tariffs.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-grinch-tariffs-threaten-christmas-1235328881/",
    "timestamp": "2025-05-01T00:02:32Z"
  },
  {
    "title": "House Democrat Says It’s ‘Batsh*t Crazy’ That He Has to Introduce Amendment to Prevent Citizen Deportations",
    "description": "Rep. Ted Lieu (D-CA) said it was \"batsh*t crazy\" that Democrats felt \"the need to even introduce an amendment that says ICE cannot deport U.S. citizens.\"\nThe post House Democrat Says It’s ‘Batsh*t Crazy’ That He Has to Introduce Amendment to Prevent Citizen D…",
    "link": "https://www.mediaite.com/politics/house-democrat-says-its-batsht-crazy-that-he-has-to-introduce-amendment-to-prevent-citizen-deportations/",
    "timestamp": "2025-05-01T00:02:04Z"
  },
  {
    "title": "Why I was wrong about Donald Trump — he’s a ‘strange attractor’ with a mission",
    "description": "I have no wish to glorify Donald Trump or to assess his moral worth but only to figure out why, as an analyst, I missed the consequential dimension of his character.",
    "link": "https://nypost.com/2025/04/30/opinion/why-i-was-wrong-about-donald-trump-hes-a-strange-attractor-with-a-mission/",
    "timestamp": "2025-05-01T00:01:30Z"
  },
  {
    "title": "Saudi Signals and Trump Tariffs Are Cracking the Oil Market",
    "description": "Low inventories reported today by the Energy Information Administration (EIA) did nothing to staunch the bleeding, with WTI getting gutted nearly 4% on the day, and Saudi rumors throwing another spanner in the works, while new U.S. economic data suggests more…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Saudi-Signals-and-Trump-Tariffs-Are-Cracking-the-Oil-Market.html",
    "timestamp": "2025-05-01T00:00:00Z"
  },
  {
    "title": "‘Unforced Error’: Energy Experts Say ‘Rush To Renewables’ Helped Trip The Switch On Spain’s Grid Crash",
    "description": "A blackout that left millions in western Europe in the dark raised concerns among energy experts that the event stemmed from an overreliance on renewable energy.",
    "link": "https://dailycaller.com/2025/04/30/energy-experts-rush-renewables-spain-portugal-grid-blackout/",
    "timestamp": "2025-04-30T23:58:55Z"
  },
  {
    "title": "Wyden-backed anti-tariff measure comes up short in U.S. Senate",
    "description": "The resolution would have pulled the plug on President Donald Trump’s sweeping tariff hikes.",
    "link": "https://www.oregonlive.com/business/2025/04/wyden-backed-anti-tariff-measure-comes-up-short-in-us-senate.html",
    "timestamp": "2025-04-30T23:55:36Z"
  },
  {
    "title": "Exclusive: House Republicans Applaud Trump’s Border, Tariff Accomplishments in First 100 Days",
    "description": "House Republicans touted President Donald Trump's accomplishments at the U.S.-Mexico border and his success at getting dozens of countries to the trade negotiation table as his biggest wins during his first 100 days in office in exclusive interviews with Brei…",
    "link": "https://www.breitbart.com/politics/2025/04/30/exclusive-house-republicans-applaud-trumps-border-tariff-accomplishments-in-first-100-days/",
    "timestamp": "2025-04-30T23:54:25Z"
  },
  {
    "title": "'Proof?' Even El Salvador's anti-gang chief doubts Trump's MS-13 tattoo claims",
    "description": "El Salvador’s top anti-gang official has joined others who are skeptical over President Donald Trump’s claims that tattoos prove a Maryland father wrongly deported in March is a member of the notorious MS-13 gang, according to media reports. Salvadoran Minist…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2671874318/",
    "timestamp": "2025-04-30T23:53:59Z"
  },
  {
    "title": "Meta says China retailers are reducing digital ad spend",
    "description": "Chinese online retailers have cut back their spending on Facebook and Instagram ads in reaction to President Donald Trump's tough trade policy with the country.",
    "link": "https://www.cnbc.com/2025/04/30/meta-says-china-retailers-are-reducing-digital-ad-spend.html",
    "timestamp": "2025-04-30T23:51:20Z"
  },
  {
    "title": "What is the actual National Debt?",
    "description": "I went looking for an official source of information about the amount of US National Debt, and found a table maker that produces PDF's for each month end. Here's an example; https://fiscaldata.treasury.gov/static-data/published-reports/mspd-entire/MonthlyStat…",
    "link": "https://freerepublic.com/focus/f-chat/4314301/posts",
    "timestamp": "2025-04-30T23:50:24Z"
  },
  {
    "title": "Veteran fund manager reboots Palantir stock price target ahead of earnings",
    "description": "There's gold in that thar Capitol Hill; you just have to know where to look.\nDuring his first address to a joint session of Congress on March 4, President Donald Trump said the U.S. would pursue a \"Golden Dome” similar to Israel's \"Iron Dome\" defense system, …",
    "link": "https://biztoc.com/x/84be886a9370eca1",
    "timestamp": "2025-04-30T23:50:22Z"
  },
  {
    "title": "David Horowitz, ’60s radical turned right-wing firebrand and critic of Islam, dies at 86",
    "description": "A self-described agnostic Jew who wrote in 2016 that he had never been to Israel, he nonetheless became one of the fiercest critics of Democrats, claiming that he had “empowered” Israel’s enemies.",
    "link": "https://www.jpost.com/diaspora/article-852217",
    "timestamp": "2025-04-30T23:46:36Z"
  },
  {
    "title": "President Trump celebrates economic agenda in first 100 days despite first quarter decline",
    "description": "President Donald Trump blames his predecessor for the U.S. economy's first quarterly decline in three years, while economists point to his tariff policies as a significant factor.",
    "link": "https://www.wmur.com/article/trump-celebrates-economic-agenda-first-100-days-despite-first-quarter-decline/64637735",
    "timestamp": "2025-04-30T23:46:33Z"
  },
  {
    "title": "President Trump celebrates economic agenda in first 100 days despite first quarter decline",
    "description": "President Donald Trump blames his predecessor for the U.S. economy's first quarterly decline in three years, while economists point to his tariff policies as a significant factor.",
    "link": "https://www.ketv.com/article/trump-celebrates-economic-agenda-first-100-days-despite-first-quarter-decline/64637735",
    "timestamp": "2025-04-30T23:46:33Z"
  },
  {
    "title": "President Trump celebrates economic agenda in first 100 days despite first quarter decline",
    "description": "President Donald Trump blames his predecessor for the U.S. economy's first quarterly decline in three years, while economists point to his tariff policies as a significant factor.",
    "link": "https://www.wtae.com/article/trump-celebrates-economic-agenda-first-100-days-despite-first-quarter-decline/64637735",
    "timestamp": "2025-04-30T23:46:33Z"
  },
  {
    "title": "President Trump celebrates economic agenda in first 100 days despite first quarter decline",
    "description": "President Donald Trump blames his predecessor for the U.S. economy's first quarterly decline in three years, while economists point to his tariff policies as a significant factor.",
    "link": "https://www.wyff4.com/article/trump-celebrates-economic-agenda-first-100-days-despite-first-quarter-decline/64637735",
    "timestamp": "2025-04-30T23:44:46Z"
  },
  {
    "title": "These 3 GOP senators voted to block Trump's sweeping tariffs",
    "description": "Three GOP senators voted for a resolution to terminate Trump's April 2 tariffs. It would have passed if not for some absences.",
    "link": "https://www.businessinsider.com/which-republican-senators-voted-block-trump-tariffs-2025-4",
    "timestamp": "2025-04-30T23:44:05Z"
  },
  {
    "title": "Ukraine, U.S. sign minerals deal sought by Trump | Honolulu Star-Advertiser",
    "description": "KYIV/WASHINGTON >> Ukraine and the U.S. today signed a deal heavily promoted by President Donald Trump that will give the United States preferential access to new Ukrainian minerals deals and fund investment in Ukraine’s reconstruction.",
    "link": "https://www.staradvertiser.com/2025/04/30/breaking-news/ukraine-u-s-sign-minerals-deal-sought-by-trump/",
    "timestamp": "2025-04-30T23:41:30Z"
  },
  {
    "title": "US Senate rejects bill to rein in Trump tariffs as economy contracts (David Morgan/Reuters)",
    "description": "David Morgan / Reuters:\nUS Senate rejects bill to rein in Trump tariffs as economy contracts  —  An evenly split U.S. Senate rejected the latest bipartisan bid to block President Donald Trump's tariffs on Wednesday, hours after the federal government reported…",
    "link": "https://www.memeorandum.com/250430/p143",
    "timestamp": "2025-04-30T23:40:03Z"
  },
  {
    "title": "Despite Ethics Pledges, Trump Organization Cuts Foreign Deal",
    "description": "The Trump family company struck a deal Wednesday to build a luxury golf resort in Qatar, an indication that it has no plans to hold back from foreign dealmaking during a second Trump administration, despite concerns that a president might shape US public poli…",
    "link": "https://www.newser.com/story/367973/despite-ethics-pledges-trump-organization-cuts-foreign-deal.html",
    "timestamp": "2025-04-30T23:40:00Z"
  },
  {
    "title": "Trump Says Canada's Carney Wants To Make A Deal, Will Visit US Soon",
    "description": "U.S. President Donald Trump said on Wednesday that Canadian Prime Minister Mark Carney is looking to make a trade deal and will visit the White House within the next week.",
    "link": "https://www.ndtv.com/world-news/us-president-donald-trump-says-canadas-carney-wants-to-make-a-deal-will-visit-us-soon-8300038",
    "timestamp": "2025-04-30T23:36:29Z"
  }
]