[
  {
    "title": "Oil Holds Near Month-Low As Trump Hails Progress On Ukraine Deal",
    "description": "West Texas Intermediate was near $58 a barrel after losing 1.5% Tuesday, while Brent closed above $62. US President Donald Trump said \"there are only a few remaining points of disagreement,\" as he sent negotiators to more meetings, while the Ukrainian leader’…",
    "link": "https://www.ndtvprofit.com/markets/oil-holds-near-month-low-as-trump-hails-progress-on-ukraine-deal",
    "timestamp": "2025-11-26T01:16:21Z"
  },
  {
    "title": "Trump Says He's Sending His Envoys To See Putin And Ukrainians After Fine-tuning Plan To End War",
    "description": "President Donald Trump says his plan to end the war in Ukraine has been \"fine-tuned.\"",
    "link": "https://www.huffpost.com/entry/russia-ukraine-war-fine-tuned-trump_n_69265293e4b063285311637d",
    "timestamp": "2025-11-26T01:11:40Z"
  },
  {
    "title": "Ronaldo can play in 2026 World Cup opener as FIFA 'suspend' ban",
    "description": "Portugal superstar Cristiano Ronaldo can play in the opening matches of the 2026 World Cup after global football governing body FIFA gave him a partially \"suspended\" ban on Tuesday following a red card.FIFA banned Ronaldo for three matches, two of which will …",
    "link": "https://sports.yahoo.com/articles/ronaldo-play-2026-world-cup-173711596.html",
    "timestamp": "2025-11-26T01:09:33Z"
  },
  {
    "title": "US budget deficit hits $284 billion in October; report impacted by shutdown",
    "description": "America's government reported a $284 billion deficit in October. This figure was influenced by a federal shutdown and a shift of some November benefit payments. Record tariff revenues helped offset these factors. The deficit saw a 10% increase compared to the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-budget-deficit-hits-284-billion-in-october-report-impacted-by-shutdown/articleshow/125577163.cms",
    "timestamp": "2025-11-26T01:01:22Z"
  },
  {
    "title": "Oil Holds Near Month-Low as Trump Hails Progress on Ukraine Deal",
    "description": "Oil steadied after closing at a one-month low on signs a Ukrainian peace deal is getting closer, a development that could herald the removal of curbs on Russian crude just as a global glut looms.",
    "link": "https://financialpost.com/pmn/business-pmn/oil-holds-near-month-low-as-trump-hails-progress-on-ukraine-deal",
    "timestamp": "2025-11-26T00:59:27Z"
  },
  {
    "title": "Scott Jennings Delivers Perfect Retort When Asked About FBI Investigating Dems Who Told Military To Ignore Trump",
    "description": "Scott Jennings shut down a CNN anchor’s line of questioning in a discussion over whether the FBI should investigate the six Democratic lawmakers.",
    "link": "https://dailycaller.com/2025/11/25/scott-jennings-fbi-inquiry-dems/",
    "timestamp": "2025-11-26T00:57:36Z"
  },
  {
    "title": "FBI probes congressional Democrats who warned military about illegal orders",
    "description": "The FBI is seeking interviews with six Democratic members of the US Congress. These lawmakers had advised military personnel on legally refusing unlawful orders. President Donald Trump has accused them of sedition. The Pentagon has also threatened action agai…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/fbi-probes-congressional-democrats-who-warned-military-about-illegal-orders/articleshow/125577135.cms",
    "timestamp": "2025-11-26T00:57:25Z"
  },
  {
    "title": "Trump's Niece Claims Don is 'Fuming' Over Gavin Newsom's Vicious Trolling... as Prez's 'Frantic Behavior' Put on Display Amid Rival's Insults",
    "description": "Donald Trump's estranged niece, Mary, said his 'increasingly frantic behavior' is due to online taunts from Gavin Newsom.",
    "link": "https://radaronline.com/p/donald-trump-niece-mary-gavin-newsom-trolling/",
    "timestamp": "2025-11-26T00:55:00Z"
  },
  {
    "title": "Ex-President Bolsonaro starts serving 27-year sentence for Brazil coup plot",
    "description": "Former Brazilian President Jair Bolsonaro begins a 27-year prison sentence. The Supreme Court finalized his conviction for a coup plot. Bolsonaro was detained after tampering with his ankle monitor. This marks a significant moment for Brazilian democracy. His…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ex-president-bolsonaro-starts-serving-27-year-sentence-for-brazil-coup-plot/articleshow/125577102.cms",
    "timestamp": "2025-11-26T00:53:03Z"
  },
  {
    "title": "‘We’re Going to Clean House’: UN Amb. Waltz Touts $1B Saved in Early UN Reforms — ‘We’re Just Getting Started’",
    "description": "U.S. Ambassador to the United Nations Mike Waltz vowed that “we’re going to clean house” at the UN as he and reform envoy Jeff Bartos walked outside UN headquarters in Manhattan, blasting the body as “bloated and bureaucratic” while touting more than a billio…",
    "link": "https://www.breitbart.com/the-media/2025/11/25/were-going-to-clean-house-un-amb-waltz-touts-1b-saved-in-early-un-reforms-were-just-getting-started/",
    "timestamp": "2025-11-26T00:50:49Z"
  },
  {
    "title": "Trump says he's sending his envoys to see Putin and Ukrainians after fine-tuning plan to end war",
    "description": "President Donald Trump is advancing his plan to end the Ukraine war. Envoys are meeting with Russian and Ukrainian officials. Trump suggests Ukraine may need to cede territory. European leaders are also involved in peace efforts. Talks are ongoing, with both …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-hes-sending-his-envoys-to-see-putin-and-ukrainians-after-fine-tuning-plan-to-end-war/articleshow/125577051.cms",
    "timestamp": "2025-11-26T00:48:31Z"
  },
  {
    "title": "Judge Ends James Comey And Letitia James Federal Cases",
    "description": "Efforts by President Donald Trump to use the judicial system against his perceived enemies took a serious hit, as a federal judge dismissed separate cases against former FBI Director James Comey and New York Attorney General Letitia James. United States Distr…",
    "link": "https://hiphopwired.com/2922670/judge-ends-comey-and-james-federal-cases/",
    "timestamp": "2025-11-26T00:47:24Z"
  },
  {
    "title": "Trump says China's Xi 'more or less agreed' to accelerate purchases of US goods",
    "description": "President Donald Trump stated that Chinese President Xi Jinping has agreed to speed up and boost Beijing's purchases of American products. This follows a phone call between the two leaders. China has already restarted buying U.S. soybeans and eased restrictio…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-says-chinas-xi-more-or-less-agreed-to-accelerate-purchases-of-us-goods/articleshow/125577037.cms",
    "timestamp": "2025-11-26T00:46:12Z"
  },
  {
    "title": "White House denies Trump weighing ouster of FBI Director Kash Patel",
    "description": "Reports suggested President Trump might remove FBI Director Kash Patel due to negative headlines. The White House has strongly denied these claims. Spokesperson Karoline Leavitt called the story fabricated. She shared a photo of Trump and Patel in the Oval Of…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-denies-trump-weighing-ouster-of-fbi-director-kash-patel/articleshow/125577011.cms",
    "timestamp": "2025-11-26T00:43:23Z"
  },
  {
    "title": "Trump says he'd 'rather not' extend Obamacare subsidies",
    "description": "United States President Donald Trump told reporters aboard Air Force One that he's against extending Obamacare subsidies, stressing that he'd \"rather not extend them at all.\"\"Somebody said I want to e...",
    "link": "https://biztoc.com/x/27f4a31bf5216ff1",
    "timestamp": "2025-11-26T00:37:20Z"
  },
  {
    "title": "Trump says Ukraine is happy, Zelensky visit hinges on deal",
    "description": "United States President Donald Trump told reporters aboard Air Force One that discussions to end the Ukraine war have begun and progress is being made. He said Ukraine is \"doing well\" and ad...",
    "link": "https://biztoc.com/x/e27155144fe05824",
    "timestamp": "2025-11-26T00:37:09Z"
  },
  {
    "title": "Trump says Europe to be largely involved in Ukraine peace",
    "description": "United States President Donald Trump said on Tuesday that Washington and European partners are discussing security guarantees for Ukraine.\nHe noted that Europe is expected to play a central role and ...",
    "link": "https://biztoc.com/x/5f661f565c3cd6b5",
    "timestamp": "2025-11-26T00:37:08Z"
  },
  {
    "title": "Zelenskiy says Ukraine ready to advance peace plan, will discuss disputed points with Trump",
    "description": "Ukraine signals readiness for a U.S.-backed peace plan. President Zelenskiy wants to discuss key issues with President Trump, including European allies. U.S. officials are working to bridge differences with Ukraine, which fears accepting Russian terms. Presid…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskiy-says-ukraine-ready-to-advance-peace-plan-will-discuss-disputed-points-with-trump/articleshow/125576974.cms",
    "timestamp": "2025-11-26T00:37:02Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,371",
    "description": "Here are the key events from day 1,371 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/26/russia-ukraine-war-list-of-key-events-day-1371",
    "timestamp": "2025-11-26T00:35:40Z"
  },
  {
    "title": "Pentagon investigation of Sen. Mark Kelly revives Cold War persecution of Americans with supposedly disloyal views",
    "description": "President Donald Trump and his supporters cast their domestic opponents as disloyal, traitorous or worse, rather than seeing dissent as part of democracy.",
    "link": "https://theconversation.com/pentagon-investigation-of-sen-mark-kelly-revives-cold-war-persecution-of-americans-with-supposedly-disloyal-views-265964",
    "timestamp": "2025-11-26T00:34:02Z"
  },
  {
    "title": "Binance accused of aiding terrorists in new lawsuit",
    "description": "The lawsuit comes a month after Trump pardoned its founder over money laundering charges.",
    "link": "https://www.bbc.com/news/articles/c87lx2gx3yvo",
    "timestamp": "2025-11-26T00:33:41Z"
  },
  {
    "title": "Report: FBI Wants to Interview Democrats Who Told Military to Refuse Illegal Orders",
    "description": "The Defense Department already announced an investigation into Sen. Kelly for alleged \"serious allegations of misconduct.\"\nThe post Report: FBI Wants to Interview Democrats Who Told Military to Refuse Illegal Orders first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/report-fbi-wants-to-interview-democrats-who-told-military-to-refuse-illegal-orders/",
    "timestamp": "2025-11-26T00:30:46Z"
  },
  {
    "title": "'Unthinkable': Ukrainian MP bashes Trump for 'making concessions to appease the aggressor'",
    "description": "A Ukrainian lawmaker bashed President Donald Trump's proposal to end the country's four-year war with Russia during a new interview on Tuesday. The Trump administration recently laid out a 28-point peace plan for Russia's war in Ukraine, a plan that some expe…",
    "link": "https://www.rawstory.com/ukraine-2674342687/",
    "timestamp": "2025-11-26T00:29:53Z"
  },
  {
    "title": "Trump: Great talks with Japan's Takaichi, China's Xi",
    "description": "United States President Donald Trump told reporters that he had a \"great\" conversation with Japanese Prime Minister Sanae Takaichi, adding that he has \"a very good relationship\" with her.\"I also had a...",
    "link": "https://biztoc.com/x/f6c7028d280e869a",
    "timestamp": "2025-11-26T00:25:44Z"
  },
  {
    "title": "Swalwell: We Are Democrat 'Avengers' Fighting for 'Truth over Trump'",
    "description": "Tuesday on CNN's \"The Arena,\" Rep. Eric Swalwell (D-CA) said he and his fellow Democratic \"avengers\" would fight for truth over President Donald Trump.\nThe post Swalwell: We Are Democrat ‘Avengers’ Fighting for ‘Truth over Trump’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/11/25/swalwell-we-are-democrat-avengers-fighting-for-truth-over-trump/",
    "timestamp": "2025-11-26T00:25:23Z"
  },
  {
    "title": "Congress’s Week of Crazy, Part One: A Legislative Body or a Dysfunctional Family Drama?",
    "description": "Fox News announced Thursday that California-based reporter Bill Melugin has been “promoted” to congressional correspondent. He might as well have stayed in L.A. covering the... Read More\nThe post Congress’s Week of Crazy, Part One: A Legislative Body or a Dys…",
    "link": "https://www.dailysignal.com/2025/11/25/congresss-week-of-crazy-part-one-a-legislative-body-or-a-dysfunctional-family-drama/",
    "timestamp": "2025-11-26T00:22:28Z"
  },
  {
    "title": "Trump targets the Muslim Brotherhood wisely — taking down its terror arms piece by piece",
    "description": "President Trump's executive order aims to strangle the diffuse Muslim Brotherhood by designating its branches as terror groups.",
    "link": "https://nypost.com/2025/11/25/opinion/trump-tackles-the-muslim-brotherhood-wisely-piece-by-piece/",
    "timestamp": "2025-11-26T00:21:54Z"
  },
  {
    "title": "Universities Have Sold a Whole Generation a Lie",
    "description": "Some day, Donald Trump may lead America into a golden era of reindustrialisation, or perhaps one last hurrah before China’s domination of materials and manufacturing knocks the US off its number one perch. Yet what if we start to build new factories and ports…",
    "link": "http://www.newgeography.com/content/008731-universities-have-sold-a-whole-generation-a-lie",
    "timestamp": "2025-11-26T00:18:28Z"
  },
  {
    "title": "Trump’s Truth Social post on Ukraine surprises Zelensky’s chief aide pushing for Mar-a-Lago peace deal",
    "description": "Ukrainian President Volodymyr Zelensky’s chief advisor, Andriy Yermak, was in the middle of an interview with Post on Tuesday when Trump posted on Truth Social the next steps in the Russia-Ukraine plans.",
    "link": "https://nypost.com/2025/11/25/world-news/trumps-truth-social-post-dashes-hopes-of-zelenskys-aide-pushing-for-mar-a-lago-peace-deal/",
    "timestamp": "2025-11-26T00:15:35Z"
  },
  {
    "title": "Trump: Great talk with Takaichi, Xi",
    "description": "United States President Donald Trump told reporters that the talks he had separately with Japanese Prime Minister Sanae Takaichi and Chinese President Xi Jinping were \"great.\"More to come......",
    "link": "https://biztoc.com/x/cfa2cd285a552bce",
    "timestamp": "2025-11-26T00:14:40Z"
  },
  {
    "title": "Judge gives Justice Department a day to detail Ghislaine Maxwell trial materials to be released",
    "description": "A federal judge has given the Justice Department a day to say what materials it plans to make publicly available from the file it built to prosecute Ghislaine Maxwell in the sex trafficking case brought against her after financier Jeffrey Epstein died",
    "link": "https://abcnews.go.com/US/wireStory/judge-justice-department-day-detail-ghislaine-maxwell-trial-127879731",
    "timestamp": "2025-11-26T00:13:34Z"
  },
  {
    "title": "Republican Senator Blasts FBI for Investigating Democratic Colleagues",
    "description": "Sen. Lisa Murkowski rebuked the Trump administration on Tuesday after the FBI interviewed six Democratic lawmakers who released a video urging members of the armed services and the intelligence community to \"refuse illegal orders.\"\nThe post Republican Senator…",
    "link": "https://www.mediaite.com/politics/republican-senator-blasts-fbi-for-investigating-democratic-colleagues/",
    "timestamp": "2025-11-26T00:13:03Z"
  },
  {
    "title": "FACT FOCUS: Trump gets it wrong claiming no murders in DC for the last six months",
    "description": "There have been 62 homicides in Washington since May 25, including one last week.",
    "link": "https://www.bostonherald.com/2025/11/25/fact-check-murder-claim-dc/",
    "timestamp": "2025-11-26T00:10:46Z"
  },
  {
    "title": "Trump Humiliated in Peace Talks: Putin Set to 'Weaken the Resolve of the United States'",
    "description": "NATO Ambassador Matthew Whitaker admits there is truth to claims that Vladimir Putin is weakening US resolve, as lawmakers slam Trump's initial peace plan as a surrender.",
    "link": "https://www.ibtimes.com/trump-humiliated-peace-talks-putin-set-weaken-resolve-united-states-3791268",
    "timestamp": "2025-11-26T00:09:01Z"
  },
  {
    "title": "X's new feature reveals surprising origins of some popular accounts",
    "description": "Over the weekend, Elon Musk's X unveiled a feature that lets users see where an account is based — and it led to some surprises.",
    "link": "https://www.cbsnews.com/news/x-foreign-origins-political-accounts/",
    "timestamp": "2025-11-26T00:09:00Z"
  },
  {
    "title": "‘Take My Temperature’: View Host Surprised She Agrees With Trump Official",
    "description": "The View's Ana Navarro surprised herself as she found she agreed with Transportation Secretary Sean Duffy on people's fashion choices when flying.\nThe post ‘Take My Temperature’: View Host Surprised She Agrees With Trump Official first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/take-my-temperature-view-host-surprised-she-agrees-with-trump-official/",
    "timestamp": "2025-11-26T00:07:41Z"
  },
  {
    "title": "Political consultant defies court order in lawsuit over AI robocalls that mimicked Biden",
    "description": "A federal court has ordered a political consultant to pay $22,500 for sending robocalls mimicking former President Joe Biden to New Hampshire voters",
    "link": "https://abcnews.go.com/Politics/wireStory/political-consultant-defies-court-order-lawsuit-ai-robocalls-127874816",
    "timestamp": "2025-11-26T00:05:36Z"
  },
  {
    "title": "Sen. Mark Kelly is doubling down on his self-dishonor over the ‘Disobey’ video",
    "description": "Slammed for his leading role in Democrats' disgraceful \"Disobey!\" video, Sen. Mark Kelly has gotten on his moral high horse, citing his decades of honorable service in the US military.",
    "link": "https://nypost.com/2025/11/25/opinion/sen-mark-kelly-is-doubling-down-on-his-self-dishonor-over-the-disobey-video/",
    "timestamp": "2025-11-26T00:03:56Z"
  },
  {
    "title": "Did the Supreme Court set hearing date over Trump's East Wing demolition? Here's the truth",
    "description": "In November 2025, the U.S. Supreme Court announced a hearing date regarding President Donald Trump's \"alleged illegal\" demolition of the White House East Wing.",
    "link": "https://www.snopes.com//fact-check/supreme-court-hearing-date-east-wing/",
    "timestamp": "2025-11-26T00:02:00Z"
  },
  {
    "title": "Judge gives Justice Department a day to detail Ghislaine Maxwell trial materials to be released",
    "description": "A federal judge in Manhattan is demanding more information from the Justice Department as he weighs its request to unseal records from the sex trafficking case against Jeffrey Epstein’s longtime confidante Ghislaine Maxwell. Judge Paul A. Engelmayer on Tuesda…",
    "link": "https://japantoday.com/category/world/judge-gives-justice-department-a-day-to-detail-ghislaine-maxwell-trial-materials-to-be-released",
    "timestamp": "2025-11-26T00:01:49Z"
  },
  {
    "title": "The looming election Trump can't afford to lose",
    "description": "In a Tennessee district Trump won by 22% last year, the result could prompt Republican panic at a time when Trump is vulnerable.",
    "link": "https://www.bbc.com/news/articles/clyzdgqk771o",
    "timestamp": "2025-11-26T00:01:16Z"
  },
  {
    "title": "Jack Smith’s Team Knew They Might Face Legal Challenges for Secretly Seeking Senators’ Phone Records",
    "description": "THE DAILY CALLER NEWS FOUNDATION—Special counsel Jack Smith’s team pressed forward with secretly seeking phone records for Republican members of Congress, even after being warned... Read More\nThe post Jack Smith’s Team Knew They Might Face Legal Challenges fo…",
    "link": "https://www.dailysignal.com/2025/11/25/newly-revealed-emails-show-jack-smith-teams-thinking/",
    "timestamp": "2025-11-26T00:01:06Z"
  },
  {
    "title": "Victor Davis Hanson: Insurrection Chic—Democrats’ Dangerous New Fad",
    "description": "Hoover Institution fellow Victor Davis Hanson says six Democrat lawmakers urged members of the military to openly defy their commands from President Donald Trump and War Secretary Pete Hegseth last week. Trump called their actions “SEDITIOUS BEHAVIOR, punisha…",
    "link": "https://www.hoover.org/research/victor-davis-hanson-insurrection-chic-democrats-dangerous-new-fad",
    "timestamp": "2025-11-26T00:00:00Z"
  },
  {
    "title": "Kiron Skinner: Zelenskyy Reportedly 'Ready To Meet With Trump' Over War With Russia",
    "description": "Hoover Institution fellow Kiron Skinner discusses the Russia-Ukraine war after Zelenskyy signaled he is open to meeting with President Donald Trump.",
    "link": "https://www.hoover.org/research/kiron-skinner-zelenskyy-reportedly-ready-meet-trump-over-war-russia",
    "timestamp": "2025-11-26T00:00:00Z"
  },
  {
    "title": "Why Aluminum Scrap Is Europe’s Hottest Critical Mineral",
    "description": "The global energy and industrial sectors run on rare earth elements (REEs), a group of 17 metals indispensable for everything from EV batteries and smartphones to wind turbines and catalytic converters. While REEs are often found in small quantities, generall…",
    "link": "https://oilprice.com/Metals/Commodities/Why-Aluminum-Scrap-Is-Europes-Hottest-Critical-Mineral.html",
    "timestamp": "2025-11-26T00:00:00Z"
  },
  {
    "title": "Why the world must wake up to China’s science leadership",
    "description": "The nation’s next generation of scientists and technologists will shape the coming decades.",
    "link": "https://www.nature.com/articles/d41586-025-03853-4",
    "timestamp": "2025-11-26T00:00:00Z"
  },
  {
    "title": "Trump's AI ‘Genesis Mission': what are the risks and opportunities?",
    "description": "National laboratories have been instructed to broaden access to their data sets to accelerate research as part of the federal government's AI platform. But who stands to benefit?",
    "link": "https://www.nature.com/articles/d41586-025-03890-z",
    "timestamp": "2025-11-26T00:00:00Z"
  },
  {
    "title": "'The absolute worst of us': Trump blasted for 'deranged' remark on governor's weight",
    "description": "President Donald Trump deviated from his speech pardoning two turkeys ahead of Thanksgiving to attack one prominent Democratic governor presumed to run for the presidency in 2028.During his remarks at the White House on Tuesday, Trump spent a portion of his s…",
    "link": "https://www.rawstory.com/alternet-posts/trump-jb-pritzker/",
    "timestamp": "2025-11-25T23:58:30Z"
  },
  {
    "title": "S&P 500, Nasdaq and Dow rally for third day as Fed rate-cut bets surge amid growing spotlight on Google-Nvidia AI chip battle",
    "description": "The Dow Jones Industrial Average surged 664 points, marking a three-day winning streak, as investor focus shifted to the Federal Reserve's potential December rate cut. This sentiment was further fueled by reports of a potential Fed chair candidate favoring lo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/sp-500-nasdaq-and-dow-rally-for-third-day-as-fed-rate-cut-bets-surge-amid-growing-spotlight-on-google-nvidia-ai-chip-battle/articleshow/125576767.cms",
    "timestamp": "2025-11-25T23:56:56Z"
  },
  {
    "title": "Morning Headlines 11/26/25",
    "description": "Hospitals to move away from paper records to new digital ...",
    "link": "https://histalk2.com/2025/11/25/morning-headlines-11-26-25/",
    "timestamp": "2025-11-25T23:56:14Z"
  },
  {
    "title": "Why Republicans in Congress Hate Trump’s Health Care Plan - NewsBreak",
    "description": "Donald Trump has a health care plan. Or so we’ve been led to believe. The president was set to unveil it at the White House on Monday, but then postponed t",
    "link": "https://www.newsbreak.com/share/4366217047153-why-republicans-in-congress-hate-trump-s-health-care-plan?s=a2&amp;share_destination_id=MzQ4NTY2ODkwLTE3NjQxMTQ4MTgxMjA%3D&amp;pd=0NaYAcoI&amp;hl=en_US&amp;send_time=1764114818&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.47.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-11-25T23:55:46Z"
  },
  {
    "title": "Judge gives Justice Department a day to detail Ghislaine Maxwell trial materials to be released",
    "description": "Maxwell is serving a 20-year prison sentence after her 2021 conviction.",
    "link": "https://www.bostonherald.com/2025/11/25/ghislaine-maxwell-trial-materials/",
    "timestamp": "2025-11-25T23:52:23Z"
  },
  {
    "title": "Pentagon boss to visit Dominican Republic amid US-Venezuela row",
    "description": "US Defense Secretary Pete Hegseth on Wednesday will visit the Dominican Republic, a close US Caribbean ally, for talks on combatting drug trafficking amid a standoff between Washington and Venezuela, officials said. The Pentagon confirmed the visit, which com…",
    "link": "https://www.digitaljournal.com/world/pentagon-boss-to-visit-dominican-republic-amid-us-venezuela-row/article",
    "timestamp": "2025-11-25T23:52:20Z"
  },
  {
    "title": "Michelle Obama Sums Up Donald Trump's East Wing Demolition In 6 Words",
    "description": "The former first lady told podcaster Jamie Kern Lima that she felt the loss mostly for America because \"That’s the people’s house.”",
    "link": "https://www.huffpost.com/entry/michelle-obama-melancholy-over-trumps-east-wing-demolition_n_692627b8e4b0632853114751",
    "timestamp": "2025-11-25T23:41:09Z"
  },
  {
    "title": "Asia-Pacific markets set to track Wall Street gains on rising Fed rate-cut expectations",
    "description": "Overnight, the key U.S. indexes rose on growing hopes for a U.S. Federal Reserve rate cut next month.",
    "link": "https://www.cnbc.com/2025/11/26/asia-pacific-markets-live-nikkei-225-hang-seng-csi300-.html",
    "timestamp": "2025-11-25T23:39:50Z"
  },
  {
    "title": "Should Albanese ‘fight Tories’ harder? Or is blandness a safe bet in a fearful, populist world?",
    "description": "Sean Kelly’s Quarterly Essay asking what Labor stands for today focuses excessively on the prime minister, ignoring the wider party.",
    "link": "https://theconversation.com/should-albanese-fight-tories-harder-or-is-blandness-a-safe-bet-in-a-fearful-populist-world-270454",
    "timestamp": "2025-11-25T23:39:45Z"
  },
  {
    "title": "Report: Biden Admin Made Airports Less Safe Using Them to House Migrants",
    "description": "The Biden administration made airports less safe, using some of them to house migrants, a report released by the Senate Commerce Committee revealed.\nThe post Report: Biden Admin Made Airports Less Safe Using Them to House Migrants appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/25/report-biden-admin-made-airports-less-safe-using-them-to-house-migrants/",
    "timestamp": "2025-11-25T23:36:08Z"
  },
  {
    "title": "Medicare announces price cuts for 15 prescription drugs, including Ozempic",
    "description": "The Centers for Medicare and Medicaid Services on Tuesday announced lower prices on 15 costly prescription drugs under Medicare, including Ozempic and Wegovy.",
    "link": "https://www.nbcnews.com/health/health-news/medicare-announces-price-cuts-15-prescription-drugs-ozempic-rcna240466",
    "timestamp": "2025-11-25T23:33:55Z"
  },
  {
    "title": "'It's just embarrassing': Analyst stunned as Trump undercuts JD Vance on global stage",
    "description": "Vice President JD Vance appears to be aggressively positioning himself as the heir apparent to the MAGA movement by taking an isolationist stance on Russia's war in Ukraine, a move that President Donald Trump keeps undermining, according to one analyst. The v…",
    "link": "https://www.rawstory.com/it-s-just-embarassing-analyst-stunned-as-trump-undercuts-jd-vance-on-world-s-stage/",
    "timestamp": "2025-11-25T23:33:43Z"
  },
  {
    "title": "Pressure mounts on Gov. Jared Polis to deny Tina Peters prison transfer request: ‘The silence is deafening.’",
    "description": "\"There was a lot of pressure coming from the (Trump) administration and from the right, and the governor was being silent on it,\" the clerks association director said. \"And the silence is deafening.\"",
    "link": "https://www.denverpost.com/2025/11/25/colorado-tina-peters-prison-jared-polis-federal-request/",
    "timestamp": "2025-11-25T23:30:38Z"
  },
  {
    "title": "Will 2025 be the year that MAGA broke apart?",
    "description": "What if Trump rode a wave of populist sentiment, painting himself as an upstart outsider to the political establishment, while covertly working to protect the political elites (and his friends) all along? What if conservatives’ wishful thinking was tied up in…",
    "link": "https://www.shtfplan.com/headline-news/will-2025-be-the-year-that-maga-broke-apart",
    "timestamp": "2025-11-25T23:30:23Z"
  },
  {
    "title": "EXCLUSIVE: How Donald Trump Could Be 'On Verge' of Confirming Existence of Aliens",
    "description": "Donald Trump may be on the verge of confirming the existence of aliens, according to a new report.",
    "link": "https://radaronline.com/p/donald-trump-confirming-alien-existence/",
    "timestamp": "2025-11-25T23:30:00Z"
  },
  {
    "title": "'I Saw It On Tape!' Bill Maher Stunned As Lara Trump Denies Trump Called Woman 'Piggy'",
    "description": "Bill Maher called out Lara Trump after she tried to deny that her father-in-law called a reporter \"piggy.\"\n\n\nDuring his Monday Club Random podcast, Maher told Lara Trump that some of President Donald Trump's rhetoric made it difficult for him to win over oppo…",
    "link": "https://crooksandliars.com/2025/11/i-saw-it-tape-bill-maher-stunned-lara",
    "timestamp": "2025-11-25T23:26:00Z"
  },
  {
    "title": "Trump Cancels Release Of Yet Another Key Economic Report",
    "description": "Donald J. Trump insists that the economy is booming, grocery prices and inflation are down, but everyday Americans are feeling the crunch of Trump's policies, which are driving up costs. Treasury Secretary Scott Bessent wasn't very reassuring when he said he’…",
    "link": "https://crooksandliars.com/2025/11/again-trump-cancels-release-yet-another",
    "timestamp": "2025-11-25T23:25:59Z"
  },
  {
    "title": "Report: Trump-MBS meeting turned tense over Israel normalization",
    "description": "Axios reports that Trump’s meeting with Saudi Crown Prince turned tense over Saudi-Israel normalization, leaving Trump disappointed.",
    "link": "https://www.israelnationalnews.com/news/418366",
    "timestamp": "2025-11-25T23:24:08Z"
  },
  {
    "title": "Democratic Rep. Eric Swalwell sues Trump official over mortgage fraud accusations",
    "description": "Rep. Eric Swalwell is suing Bill Pulte, the head of the Federal Housing Finance Agency, accusing him of abusing his position to “concoct fanciful allegations of mortgage fraud” against Swalwell, a prominent critic of President Donald Trump",
    "link": "https://www.nbcnews.com/politics/congress/eric-swalwell-sues-trump-official-bill-pulte-mortgage-fraud-allegation-rcna245970",
    "timestamp": "2025-11-25T23:23:42Z"
  },
  {
    "title": "Judge gives Justice Department a day to detail Ghislaine Maxwell trial materials to be released",
    "description": "A federal judge in Manhattan is demanding more information from the Justice Department as he weighs its request to unseal records from the sex trafficking...",
    "link": "https://www.yahoo.com/news/articles/judge-gives-justice-department-day-232321696.html",
    "timestamp": "2025-11-25T23:23:21Z"
  },
  {
    "title": "‘Politically motivated influence operation:’ Now FBI begins review of video from ‘Seditious Six’",
    "description": "Nation 'does not need political actors injecting doubt into an already clear chain of command'",
    "link": "https://www.wnd.com/2025/11/politically-motivated-influence-operation-now-fbi-begins-review/",
    "timestamp": "2025-11-25T23:23:17Z"
  },
  {
    "title": "BBC faces UK parliament heat over Trump 'scandal'",
    "description": "UK News: LONDON: The BBC's chairman acknowledged Monday that it was too slow in responding over a misleading edit of a speech by US President Donald Trump but .",
    "link": "https://timesofindia.indiatimes.com/world/uk/bbc-faces-uk-parliament-heat-over-trump-scandal/articleshow/125576687.cms",
    "timestamp": "2025-11-25T23:22:57Z"
  },
  {
    "title": "Trump Says 'Tremendous Progress’ Being Made to Resolve Ukraine War",
    "description": "President Donald Trump announced Tuesday that \"tremendous progress\" has been made in the past week on efforts to wind down the Russia-Ukraine war.\nThe post Trump Says ‘Tremendous Progress’ Being Made to Resolve Ukraine War appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/11/25/trump-says-tremendous-progress-being-made-to-resolve-ukraine-war/",
    "timestamp": "2025-11-25T23:21:54Z"
  },
  {
    "title": "Trump says envoy Witkoff to meet Putin in Moscow as Ukraine signals ‘understanding’ reached with US on peace plan",
    "description": "The 28-point peace plan proposal was presented to Kyiv by Washington last week, and the American and Ukrainian officials worked on it over the weekend during talks in Geneva.",
    "link": "https://indianexpress.com/article/world/trump-says-envoy-witkoff-meet-putin-in-moscow-ukraine-understanding-reached-peace-plan-10386316/",
    "timestamp": "2025-11-25T23:20:41Z"
  },
  {
    "title": "Ex-BBC board member criticised chair's handling of bias crisis in resignation letter",
    "description": "Shumeet Banerji resigned on Friday citing \"governance issues\" but the full reasons were not known until now.",
    "link": "https://www.bbc.com/news/articles/c5y9rz7eggko",
    "timestamp": "2025-11-25T23:20:09Z"
  },
  {
    "title": "Transcript: Trump Spiral Worsens as Push to Jail Foes Backfires Badly",
    "description": "The following is a lightly edited transcript of the November 25 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. This wee…",
    "link": "https://newrepublic.com/article/203683/transcript-trump-spiral-worsens-push-jail-foes-backfires-badly",
    "timestamp": "2025-11-25T23:19:47Z"
  },
  {
    "title": "Congressional Democrats Say They're Targets Of FBI Probe",
    "description": "Several Democratic members of Congress say they're the targets of an FBI probe following a controversial video they released last week urging military service personnel to be aware of their duty to refuse un-Constitutional and unlawful orders from…\n Permalink",
    "link": "https://www.tmz.com/2025/11/25/democrats-targets-fbi-probe/",
    "timestamp": "2025-11-25T23:17:26Z"
  },
  {
    "title": "Washington DC mayor Muriel Bowser won't seek re-election",
    "description": "The Democrat has led the US capital since 2015, most recently clashing with Trump over the deployment of the National Guard.",
    "link": "https://www.bbc.com/news/articles/cm28zp50dd9o",
    "timestamp": "2025-11-25T23:14:12Z"
  },
  {
    "title": "Medicare for All Backers Argue It's a Better Solution Than Whatever Trump Is Cooking Up",
    "description": "As President Donald Trump postpones unveiling his supposed plan to tackle soaring US healthcare costs—reportedly after pushback from congressional Republicans—Medicare for All advocates have renewed calls for shifting to a single-payer system.\"Republicans hav…",
    "link": "https://www.commondreams.org/news/medicare-for-all-act-2025",
    "timestamp": "2025-11-25T23:13:27Z"
  },
  {
    "title": "FBI seeks interviews with Dems",
    "description": "Democratic lawmakers who appeared in a social media video urging U.S. troops to defy \"illegal orders\" say the FBI has contacted them to begin scheduling interviews, signaling a possible inquiry into the matter.",
    "link": "https://www.bostonherald.com/2025/11/25/fbi-seeks-interviews-with-dems/",
    "timestamp": "2025-11-25T23:13:23Z"
  },
  {
    "title": "Can Canada wait out the trade war with the US?",
    "description": "Canada’s prime minister is weighing a trip to Washington after recently suggesting he is in no rush to reboot derailed trade talks.",
    "link": "https://www.bbc.com/news/articles/c17x025jj21o",
    "timestamp": "2025-11-25T23:12:22Z"
  },
  {
    "title": "After Visiting White House, Ronaldo Gets Suspension Cut By FIFA",
    "description": "About a week after visiting the White House, Cristiano Ronaldo had his FIFA suspension cut by two games. The Portuguese striker will be able to participate in three group stage mathes.",
    "link": "https://www.forbes.com/sites/michaellewis/2025/11/25/after-visiting-white-house-ronaldo-gets-suspension-cut-by-fifa/",
    "timestamp": "2025-11-25T23:11:03Z"
  },
  {
    "title": "Trump hopes to meet Putin and Zelenskyy 'soon' - but only if peace deal struck",
    "description": "A Ukrainian diplomat has warned major sticking points remain in the peace deal being thrashed out - primarily the prospect of territorial concessions. Meanwhile, Moscow has stressed that it will not allow any agreement to stray too far from its own objectives.",
    "link": "https://news.sky.com/story/trump-hopes-to-meet-putin-and-zelenskyy-soon-but-only-if-peace-deal-struck-13475500",
    "timestamp": "2025-11-25T23:10:00Z"
  },
  {
    "title": "Judge throws out Trump media group’s lawsuit against The Guardian",
    "description": "A judge on Monday dismissed a defamation lawsuit filed by Donald Trump’s media organization against The Guardian over reports on its ties to a Russian oligarch. \nThe president’s legal onslaught against the media – launched via personal lawsuits and through hi…",
    "link": "https://biztoc.com/x/b95fe8996ee762ae",
    "timestamp": "2025-11-25T23:07:29Z"
  },
  {
    "title": "Uncommon Knowledge: Thanksgiving 2025 Is Cheaper Than You Think",
    "description": "As two turkeys made the media rounds this week ahead of getting pardoned by President Donald Trump on Tuesday, Americans flocked to the stores to load up on Thanksgiving goodies—filled with anxiety over rising grocery costs and the overall state of the econom…",
    "link": "https://biztoc.com/x/9ec0daaa7bb10a0b",
    "timestamp": "2025-11-25T23:07:09Z"
  },
  {
    "title": "Health care plan circulated by the White House runs into familiar GOP divisions",
    "description": "Health care plan circulated by the White House runs into familiar GOP divisionstwincities.com",
    "link": "https://www.twincities.com/2025/11/25/congress-health-care-gop/",
    "timestamp": "2025-11-25T23:02:50Z"
  },
  {
    "title": "Activist Nicaraguan priest: The Ortega dictatorship ‘can’t take away our faith’",
    "description": "Father Nils de Jesús Hernández speaks out for Nicaragua from exile in the United States. / Credit: “EWTN Noticias”/Screenshot\n\nACI Prensa Staff, Nov 25, 2025 / 18:01 pm (CNA).\nNils de Jesús Hernández, 56, has lived in the United States for 36 years, far from …",
    "link": "https://www.catholicnewsagency.com/news/268089/activist-nicaraguan-priest-the-ortega-dictatorship-can-t-take-away-our-faith",
    "timestamp": "2025-11-25T23:01:00Z"
  },
  {
    "title": "How Immigration Enforcement Works Now",
    "description": "Scrambling to meet high deportation goals, DHS operations are becoming more indiscriminate and more grueling.",
    "link": "https://www.theatlantic.com/newsletters/2025/11/how-immigration-enforcement-works-ice-dhs/685068/",
    "timestamp": "2025-11-25T23:01:00Z"
  },
  {
    "title": "The Vanishing World of Inuit Polar-Bear Hunters",
    "description": "From the daily newsletter: our far-flung correspondent braves the ice.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-vanishing-world-of-inuit-polar-bear-hunters",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Trump Reportedly Lobbies Paramount to Distribute ‘Rush Hour 4’: A Glimpse of the Studio’s Ellison-Led Future?",
    "description": "According to several outlets, the president has used his connections at the studio to breathe new life into disgraced director Brett Ratner's long-stalled sequel.",
    "link": "https://www.indiewire.com/news/breaking-news/rush-hour-4-paramount-1235162974/",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Anwar coy on Cabinet reshuffle amid vacant key posts",
    "description": "NAIROBI: If there are plans to reshuffle the Cabinet, Datuk Seri Anwar Ibrahim is keeping that decision close to his chest. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/11/26/anwar-coy-on-cabinet-reshuffle-amid-vacant-key-posts",
    "timestamp": "2025-11-25T23:00:00Z"
  },
  {
    "title": "Trump Admin to Begin 'Comprehensive Review' of Every Refugee Admitted to US Under Biden",
    "description": "\"For four straight years, the Biden administration accelerated refugee admissions from terror and gang-prone countries.\"",
    "link": "https://www.westernjournal.com/trump-admin-begin-comprehensive-review-every-refugee-admitted-us-biden/",
    "timestamp": "2025-11-25T22:58:00Z"
  },
  {
    "title": "How Trump Brought Netanyahu to Heel",
    "description": "Across the region, he has made it harder for Israel to act militarily.",
    "link": "http://foreignpolicy.com/2025/11/25/trump-netanyahu-gaza-hamas-hezbollah-israel-qatar/",
    "timestamp": "2025-11-25T22:57:20Z"
  },
  {
    "title": "The US Navy is canceling its future frigates in a blow to its ambitions to grow the fleet",
    "description": "The Constellation-class frigate program has been weighed down by several delays and missteps over the years.",
    "link": "https://www.businessinsider.com/navy-cancels-future-constellation-class-frigates-raising-fleet-size-concerns-2025-11",
    "timestamp": "2025-11-25T22:55:58Z"
  },
  {
    "title": "FACT FOCUS: Trump gets it wrong claiming no murders in DC for the last six months",
    "description": "In addition to pardoning two North Carolina turkeys at the annual White House ceremony, President Donald Trump discussed his crime-fighting efforts in Washington, D.C., claiming that it’s been six months since the city has seen a murder",
    "link": "https://abcnews.go.com/Politics/wireStory/fact-focus-trump-gets-wrong-claiming-murders-dc-127878340",
    "timestamp": "2025-11-25T22:53:49Z"
  },
  {
    "title": "US judge orders Trump administration to provide bond hearings to detained migrants",
    "description": "By Daniel Wiessner -A federal judge on Tuesday ruled that President Donald Trump's administration cannot impose mandatory detention on thousands of migrants ...",
    "link": "https://www.yahoo.com/news/articles/us-judge-orders-trump-administration-225337838.html",
    "timestamp": "2025-11-25T22:53:37Z"
  },
  {
    "title": "Insurrection Chic—Democrats’ Dangerous New Fad",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post Insurrection Chic—Democrats’ Dangerous New Fad appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/11/25/insurrection-chic-democrats-dangerous-new-fad/",
    "timestamp": "2025-11-25T22:52:57Z"
  },
  {
    "title": "‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russia",
    "description": "Brian Fitzpatrick warned Trump's administration he has a \"major problem\" after Steve Witkoff reportedly advised on how to \"pitch\" their Ukraine plans to Trump.\nThe post ‘Major Problem’: House Republican Rips Trump Administration’s ‘Secret Meetings’ With Russi…",
    "link": "https://www.mediaite.com/politics/major-problem-house-republican-rips-trump-administrations-secret-meetings-with-russia/",
    "timestamp": "2025-11-25T22:52:36Z"
  }
]