[
  {
    "title": "Demolition of White House East Wing begins ahead of ballroom construction",
    "description": "A portion of the White House's East Wing is currently being demolished to make space for president Donald Trump's neoclassical ballroom, with construction teams using a backhoe to rip through the facade. In a photo shared with US newspaper The Washington Post…",
    "link": "https://www.dezeen.com/2025/10/20/demolition-white-house-east-wing-begins-ballroom-construction/",
    "timestamp": "2025-10-20T21:06:17Z"
  },
  {
    "title": "Demolition of White House East Wing begins ahead of ballroom construction",
    "description": "A portion of the White House's East Wing is currently being demolished to make space for president Donald Trump's neoclassical ballroom, with construction teams using a backhoe to rip through the facade. In photos shared with The Washington Post, a demolition…",
    "link": "https://www.dezeen.com/2025/10/20/demolition-of-white-house-east-wing-begins-ahead-of-ballroom-construction/",
    "timestamp": "2025-10-20T21:06:17Z"
  },
  {
    "title": "US stock market rallies today: Dow jumps over 500 points, S&P 500 up 1.07%, Nasdaq gains 1.37% as Apple stock surges & investors await Netflix, Tesla, Intel, Coca-Cola earnings this week",
    "description": "US stock market today: US stocks surged on Monday, led by a significant rally in Apple shares following a positive analyst upgrade. Renewed optimism surrounding a potential end to the government shutdown also boosted investor sentiment. Wall Street is now eag…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-october-20-dow-jumps-over-500-points-sp-500-up-1-07-nasdaq-gains-1-37-as-apple-stock-surges-investors-await-netflix-tesla-intel-coca-cola-earnings-this-week/articleshow/124710412.cms",
    "timestamp": "2025-10-20T21:05:23Z"
  },
  {
    "title": "Comey’s lawyers say case against him is driven by Trump’s ‘personal animus’ and must be thrown out",
    "description": "The double-barrel attack is the opening salvo ahead of a Jan. 5 trial.",
    "link": "https://www.bostonherald.com/2025/10/20/comey-justice-department/",
    "timestamp": "2025-10-20T21:04:56Z"
  },
  {
    "title": "Trump signs rare earths deal with Australian prime minister as a way to counter China",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese have signed a deal for $8.5 billion in rare earth minerals, as a counterpoint to China’s new export restrictions.",
    "link": "https://www.pbs.org/newshour/politics/trump-signs-rare-earths-deal-with-australian-prime-minister-as-a-way-to-counter-china",
    "timestamp": "2025-10-20T21:04:52Z"
  },
  {
    "title": "Trump’s impending San Francisco crackdown sparks backlash from Newsom, mayor",
    "description": "Gov. Gavin Newsom, D-Calif., opposed the White House plan to send the National Guard to San Francisco, saying deployment will ruin one of America's greatest cities.",
    "link": "https://www.foxnews.com/politics/trumps-impending-san-francisco-crackdown-sparks-backlash-from-newsom-mayor",
    "timestamp": "2025-10-20T21:04:43Z"
  },
  {
    "title": "Trump Effect: Gas Prices Fall Below $3 Per Gallon for First Time in over Four Years",
    "description": "Americans are seeing a welcome sight at gas pumps across the nation as the average price falls below $3 per gallon.\nThe post Trump Effect: Gas Prices Fall Below $3 Per Gallon for First Time in over Four Years appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/10/20/trump-effect-gas-prices-fall-below-3-per-gallon-for-first-time-in-over-four-years/",
    "timestamp": "2025-10-20T21:02:04Z"
  },
  {
    "title": "The ‘No Kings’ Protests Against Democracy Itself",
    "description": "Trump’s decisive 2024 victory exposed the irony of the left’s “No Kings” protests—an anti-democracy tantrum against the most democratic act of all: an election. On November 5, 2024, Donald Trump won the United States presidential election against Kamala Harri…",
    "link": "https://freerepublic.com/focus/f-news/4347598/posts",
    "timestamp": "2025-10-20T21:01:15Z"
  },
  {
    "title": "10 major moments from 50 years of PBS News",
    "description": "Relive half a cenutry of PBS News history through these big moments.",
    "link": "https://www.pbs.org/newshour/nation/10-major-moments-from-50-years-of-pbs-news",
    "timestamp": "2025-10-20T21:00:21Z"
  },
  {
    "title": "Unlike Biden, Trump Really Is Addressing the ‘Root Causes’ of the Border Crisis",
    "description": "President Donald Trump is truly addressing the “root causes” of our border problem. He’s doing this by cracking down on the crime and criminal organizations... Read More\nThe post Unlike Biden, Trump Really Is Addressing the ‘Root Causes’ of the Border Crisis …",
    "link": "https://www.dailysignal.com/2025/10/20/unlike-biden-trump-really-is-addressing-the-root-causes-of-the-border-crisis/",
    "timestamp": "2025-10-20T21:00:00Z"
  },
  {
    "title": "Hamas is a pale shadow of what it was - but it could yet reinvent itself",
    "description": "After governing with an iron rod for so many years, is Hamas really prepared to relinquish control in Gaza?",
    "link": "https://www.bbc.com/news/articles/cn51w77vlp9o",
    "timestamp": "2025-10-20T20:58:30Z"
  },
  {
    "title": "Crisis-hit Argentina Inks $20 Bn Rescue With US",
    "description": "Argentina and the United States signed off on a $20 billion financial lifeline Monday, hoping to avert economic meltdown and boost President Javier Milei ahead of tough legislative elections.",
    "link": "https://www.ibtimes.com/crisis-hit-argentina-inks-20-bn-rescue-us-3787699",
    "timestamp": "2025-10-20T20:57:12Z"
  },
  {
    "title": "James Comey asks judge to toss criminal case, says Trump-picked prosecutor Lindsey Halligan was appointed unlawfully",
    "description": "Former FBI Director James Comey on Monday asked a federal judge to dismiss his criminal case, arguing that he is being vindictively prosecuted because of President Donald Trump's animus toward him.\nComey, in a pair of motions for dismissal filed in federal co…",
    "link": "https://biztoc.com/x/566da8917704c65e",
    "timestamp": "2025-10-20T20:56:25Z"
  },
  {
    "title": "As the White House hires another ‘Stop the Steal’ lawyer, failure is inevitable",
    "description": "Donald Trump has hired a lawyer to oversee yet another investigation into his 2020 defeat, apparently because the original probes were too reality-based for him",
    "link": "https://biztoc.com/x/c17aebc3b23e1c27",
    "timestamp": "2025-10-20T20:56:16Z"
  },
  {
    "title": "James Comey Asks Judge To Dismiss Criminal Case Against Him",
    "description": "The former FBI director said he is being unfairly targeted because of President Donald Trump's \"personal spite\" against him.",
    "link": "https://www.huffpost.com/entry/james-comey-criminal-charges_n_68f6a0a0e4b09d351b44ea17",
    "timestamp": "2025-10-20T20:56:05Z"
  },
  {
    "title": "Jamie Raskin Paints Rosy Picture Of ‘No Kings’ Protests, Ignores Death Threats Against Trump, Stephen Miller",
    "description": "Democratic Rep. Jamie Raskin celebrated Saturday’s “No Kings” protests, claiming they were “positive” and patriotic” despite death threats to conservatives.",
    "link": "https://dailycaller.com/2025/10/20/jamie-raskin-paints-rosy-picture-of-no-kings-protests-ignores-death-threats-against-trump-stephen-miller/",
    "timestamp": "2025-10-20T20:55:43Z"
  },
  {
    "title": "CNN Just Delivered a Brutal Poll Number for Dems on the Shutdown Fight",
    "description": "It’s day 20 of the Schumer Shutdown, and Donald Trump is winning. Don’t take my word for it—CNN is admitting that this Democrat-led fiasco has done nothing to hurt the president’s approval. In fact, Trump’s approval has increased. CNN’s Harry Enten broke down…",
    "link": "https://freerepublic.com/focus/f-news/4347595/posts",
    "timestamp": "2025-10-20T20:55:17Z"
  },
  {
    "title": "Trump, Albanese Sign Major Critical Minerals Deal",
    "description": "The agreement aims to counter China’s near monopoly on supply chains.",
    "link": "http://foreignpolicy.com/2025/10/20/trump-albanese-australia-critical-minerals-rare-earths-china/",
    "timestamp": "2025-10-20T20:55:08Z"
  },
  {
    "title": "Trump suggests US will buy Argentine beef to bring down prices for American consumers (Christopher Megerian/Associated Press)",
    "description": "Christopher Megerian / Associated Press:\nTrump suggests US will buy Argentine beef to bring down prices for American consumers  —  Add AP News to Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  President Donald Tru…",
    "link": "https://www.memeorandum.com/251020/p108",
    "timestamp": "2025-10-20T20:55:02Z"
  },
  {
    "title": "DOJ hedges on Trump's anti-trans views while defending military ban in federal appeals court",
    "description": "In a Portland, Oregon, courtroom Monday morning, a three-judge panel of the U.S. Court of Appeals for the Ninth Circuit heard Shilling v. Trump, a challenge to President Donald Trump’s revived ban on military service by transgender Americans. The arguments — …",
    "link": "https://www.advocate.com/news/shilling-trump-arguments-military-ban",
    "timestamp": "2025-10-20T20:54:47Z"
  },
  {
    "title": "Trump Wrongly Claims He Can Invoke Insurrection Act to Shut Down Courts",
    "description": "The president hinted that he may invoke the Insurrection Act to send the US military into San Francisco.",
    "link": "https://truthout.org/articles/trump-wrongly-claims-he-can-invoke-insurrection-act-to-shut-down-courts/",
    "timestamp": "2025-10-20T20:54:02Z"
  },
  {
    "title": "Coast Guard’s Pacific mission continues to expand | Honolulu Star-Advertiser",
    "description": "The ocean can be a lawless place. Far from shore, the vast seas have become plagued with everything from piracy, rampant illegal fishing and environmental crime, drug smuggling, human trafficking, and even spying and espionage.",
    "link": "https://www.staradvertiser.com/2025/10/20/hawaii-news/coast-guards-pacific-mission-continues-to-expand/",
    "timestamp": "2025-10-20T20:53:55Z"
  },
  {
    "title": "Trump and Albanese sign critical minerals deal, Kevin Rudd humiliated",
    "description": "Anthony Albanese has finally met with Donald Trump, with the pair signing a critical minerals deal (although not before the US president got in a dig at Kevin Rudd).\nThe post Trump and Albanese sign critical minerals deal, Kevin Rudd humiliated appeared first…",
    "link": "http://www.crikey.com.au/2025/10/21/trump-albanese-critical-minerals-kevin-rudd-humiliated/",
    "timestamp": "2025-10-20T20:53:04Z"
  },
  {
    "title": "Official defends use of tear gas in Chicago and says agents on immigration sweeps have cameras",
    "description": "A official says U.S. border agents assigned to immigration enforcement in the Chicago area have been given body cameras. A judge is holding a hearing Monday to learn more about the Trump administration’s immigration crackdown.",
    "link": "https://www.pbs.org/newshour/nation/official-defends-use-of-tear-gas-in-chicago-and-says-agents-on-immigration-sweeps-have-cameras",
    "timestamp": "2025-10-20T20:52:42Z"
  },
  {
    "title": "Trump Wins Again: 9th Circuit Says He Can Send National Guard to Portland",
    "description": "The U.S. Court of Appeals for the Ninth Circuit ruled Monday that President Donald Trump has the authority to deploy the National Guard to Portland, Oregon, reversing a decision by a district judge earlier this month.\nThe post Trump Wins Again: 9th Circuit Sa…",
    "link": "https://www.breitbart.com/law-and-order/2025/10/20/trump-wins-again-9th-circuit-says-he-can-send-national-guard-to-portland/",
    "timestamp": "2025-10-20T20:52:38Z"
  },
  {
    "title": "Demolition Begins on Part of White House After Trump Promised Ballroom Wouldn’t ‘Interfere’ With Historic Structure",
    "description": "Demolition has begun on a portion of the East Wing of the White House in preparation for Donald Trump's $250 million ballroom project.\nThe post Demolition Begins on Part of White House After Trump Promised Ballroom Wouldn’t ‘Interfere’ With Historic Structure…",
    "link": "https://www.mediaite.com/media/news/demolition-begins-on-part-of-white-house-after-trump-promised-ballroom-wouldnt-interfere-with-historic-structure/",
    "timestamp": "2025-10-20T20:51:02Z"
  },
  {
    "title": "Live: Trump and PM sign critical minerals deal, Amazon Web Services suffers outage",
    "description": "US and Australian leaders Donald Trump and Anthony Albanese meet and sign a deal to invest in critical minerals. Plus, Amazon suffers a mega-internet outage. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-10-21/asx-markets-business-live-news-october-21-2025/105914064",
    "timestamp": "2025-10-20T20:49:37Z"
  },
  {
    "title": "US, Australia sign rare earth deal",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese signed a critical-minerals deal at the White House on Monday as the U.S. eyes the continent's rich rare-earth resources when China is imposing tougher rules on exporting its own critical mi…",
    "link": "https://www.bostonherald.com/2025/10/20/us-australia-sign-rare-earth-deal/",
    "timestamp": "2025-10-20T20:49:09Z"
  },
  {
    "title": "The Ridiculous No Kings Protest",
    "description": "Aging lefties waste a beautiful Saturday to pretend they are speaking truth to power.It’s difficult to think of a more effective way to illustrate the moral and intellectual emptiness of the American left than to have them march around demanding an end to an …",
    "link": "https://freerepublic.com/focus/f-news/4347594/posts",
    "timestamp": "2025-10-20T20:48:30Z"
  },
  {
    "title": "US Senate to ‘Pause’ Russia Sanctions Bill, GOP Leader Says",
    "description": "The US Senate will hold off on considering new sanctions legislation on Russia until after President Donald Trump’s planned meeting with Russian President Vladimir Putin, the chamber’s Republican leader said.",
    "link": "https://financialpost.com/pmn/business-pmn/us-senate-to-pause-russia-sanctions-bill-gop-leader-says",
    "timestamp": "2025-10-20T20:47:20Z"
  },
  {
    "title": "WATCH: Clueless ‘No Kings’ activists can’t name one reason why they’re protesting Trump",
    "description": "'I don't even think it's appropriate for me to have this interview'",
    "link": "https://www.wnd.com/2025/10/watch-clueless-no-kings-activists-cant-name-one/",
    "timestamp": "2025-10-20T20:47:00Z"
  },
  {
    "title": "Federal Appeals Court Allows Trump's National Guard Deployment in Oregon",
    "description": "Federal Appeals Court Allows Trump's National Guard Deployment in Oregon\n \nA federal appeals court ruled on Monday that President Donald Trump can send National Guard troops to Portland, Oregon while a lawsuit against the action works its way through lower co…",
    "link": "https://biztoc.com/x/7137aceeba640b60",
    "timestamp": "2025-10-20T20:45:22Z"
  },
  {
    "title": "Donald Trump TEARS DOWN part of the White House to make way for his new golden ballroom",
    "description": "The White House's East Wing was being demolished on Monday to make way for President Donald Trump's gilded $250 million ballroom. Daily Mail photos showed a backhoe ripping into the once-pristine structure that has formed part of the White House complex for m…",
    "link": "https://freerepublic.com/focus/f-news/4347593/posts",
    "timestamp": "2025-10-20T20:45:03Z"
  },
  {
    "title": "James Comey asks judge to toss criminal case, says Trump-picked prosecutor Lindsey Halligan was appointed unlawfully",
    "description": "Comey argued that he is being vindictively prosecuted because of President Donald Trump's animus toward him.",
    "link": "https://www.cnbc.com/2025/10/20/comey-trump-halligan-criminal-case.html",
    "timestamp": "2025-10-20T20:44:50Z"
  },
  {
    "title": "Copper rises as investors weigh trade tensions and China outlook",
    "description": "Copper rose to trade near a record as investors assess conflicting comments from Donald Trump about trade relations. Find out more here",
    "link": "https://financialpost.com/commodities/copper-rises-investors-weigh-trade-tensions",
    "timestamp": "2025-10-20T20:43:34Z"
  },
  {
    "title": "RFK Jr. Offered His Actress Wife a Fake Separation During His 2024 Presidential Run",
    "description": "Actress Cheryl Hines revealed that Robert F. Kennedy Jr. offered to pretend they were separated to take the heat off her during his presidential run.\nThe post RFK Jr. Offered His Actress Wife a Fake Separation During His 2024 Presidential Run first appeared o…",
    "link": "https://www.mediaite.com/media/entertainment/rfk-jr-offered-his-actress-wife-a-fake-separation-during-his-2024-presidential-run/",
    "timestamp": "2025-10-20T20:41:11Z"
  },
  {
    "title": "Trump's own words hurled back in his face by Jim Comey: CNN reporter",
    "description": "CNN reporter Katelyn Polantz revealed on Monday that former FBI Director James Comey appears to be using President Donald Trump's own words against him in court. Comey's lawyers filed a motion to dismiss Trump's prosecution against Comey because it is a \"sele…",
    "link": "https://www.rawstory.com/james-comey-2674216336/",
    "timestamp": "2025-10-20T20:41:03Z"
  },
  {
    "title": "White House shares trolling response after Kenny Loggins demands removal of unauthorized use of 'Danger Zone'",
    "description": "A representative for the White House sent a \"Top Gun\" meme in response to EW's request for comment.",
    "link": "https://ew.com/white-house-shares-trolling-response-kenny-loggins-demands-removal-unauthorized-danger-zone-11833283",
    "timestamp": "2025-10-20T20:39:33Z"
  },
  {
    "title": "School Scrambling After Teacher Goes Viral for Mocking Charlie Kirk's Death at 'No Kings' Protest",
    "description": "The woman's actions weren't the only \"no kings\" incident spreading around social media. At least one speaker called for violence against ICE.",
    "link": "https://www.westernjournal.com/school-scrambling-teacher-goes-viral-mocking-charlie-kirks-death-no-kings-protest/",
    "timestamp": "2025-10-20T20:39:32Z"
  },
  {
    "title": "ICE Spent 700% More on Weapons. What They Bought Will Terrify You.",
    "description": "President Donald Trump is reportedly spending millions more on weapons for his masked militia descending on American cities—who will now have access to “guided missile warheads.” Independent journalist Judd Legum reported Monday that between Trump’s inaugurat…",
    "link": "https://newrepublic.com/post/202031/donald-trump-ice-increase-weapons-spending",
    "timestamp": "2025-10-20T20:39:23Z"
  },
  {
    "title": "CNN’s Harry Enten Says Trump Not Taking Political Hit From Government Shutdown",
    "description": "CNN senior data analyst Harry Enten said on Monday that the government shutdown is not harming President Donald Trump's popularity in any way.",
    "link": "https://dailycaller.com/2025/10/20/cnn-harry-enten-trump-government-shutdown/",
    "timestamp": "2025-10-20T20:38:36Z"
  },
  {
    "title": "Shock Poll: Trump Impeacher Bill Cassidy Trailing Primary Challenger John Fleming in Louisiana",
    "description": "A statewide poll shows Louisiana Treasurer John Fleming overtaking incumbent Sen. Bill Cassidy six months ahead of the Republican U.S. Senate primary.\nThe post Shock Poll: Trump Impeacher Bill Cassidy Trailing Primary Challenger John Fleming in Louisiana appe…",
    "link": "https://www.breitbart.com/politics/2025/10/20/shock-poll-trump-impeacher-bill-cassidy-trailing-primary-challenger-john-fleming-louisiana/",
    "timestamp": "2025-10-20T20:36:37Z"
  },
  {
    "title": "Appeals Court Issues Ruling On Trump National Guard Deployment To Riot-Plagued City",
    "description": "A federal appeals court ruled Monday that Trump may send National Guard troops to Portland while a legal challenge proceeds.",
    "link": "https://dailycaller.com/2025/10/20/appeals-court-issues-ruling-on-trump-national-guard-deployment-to-riot-plagued-city/",
    "timestamp": "2025-10-20T20:36:32Z"
  },
  {
    "title": "Houston's Democrat Mayor Says He and Socialist Zohran Mamdani Exist in 'Different Universes'",
    "description": "The Democrat mayor of Houston, Texas, criticized Democrat socialist and New York City mayoral candidate Zohran Mamdani during a recent interview with the New York Times.\nThe post Houston’s Democrat Mayor Says He and Socialist Zohran Mamdani Exist in ‘Differen…",
    "link": "https://www.breitbart.com/politics/2025/10/20/houstons-democrat-mayor-says-he-and-socialist-zohran-mamdani-exist-in-different-universes/",
    "timestamp": "2025-10-20T20:35:50Z"
  },
  {
    "title": "Text Messages Reveal Trump Nominee Said He Has a ‘Nazi Streak’ While Making Racist Remarks",
    "description": "Trump stunned the political world in May by nominating Paul Ingrassia to the key watchdog position\nThe post Text Messages Reveal Trump Nominee Said He Has a ‘Nazi Streak’ While Making Racist Remarks first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/text-messages-reveal-trump-nominee-said-he-has-a-nazi-streak-while-making-racist-remarks/",
    "timestamp": "2025-10-20T20:35:43Z"
  },
  {
    "title": "Appeals Court Rules National Guard Can Be Deployed to Portland",
    "description": "In a 2-1 decision, the 9th Circuit Court says president has authority to deploy the military to Portland, amid ongoing protests at the ICE facility. \n \n by Abe Asher\n \n \n \n The US Court of Appeals for the 9th Circuit ruled Monday that President Donald Trump c…",
    "link": "https://www.portlandmercury.com/news/2025/10/20/48082652/appeals-court-rules-national-guard-can-be-deployed-to-portland",
    "timestamp": "2025-10-20T20:35:00Z"
  },
  {
    "title": "Update: Oregon Requests New Hearing After Appeals Court Rules National Guard Can Deploy to Portland",
    "description": "In a 2-1 decision, the 9th Circuit Court says president has authority to deploy the military to Portland, amid ongoing protests at the ICE facility. The Oregon Attorney General's Office wants the case reheard.\n \n by Abe Asher\n \n \n \n Updated: 3:44 pm October 2…",
    "link": "https://www.portlandmercury.com/news/2025/10/20/48082652/update-oregon-requests-new-hearing-after-appeals-court-rules-national-guard-can-deploy-to-portland",
    "timestamp": "2025-10-20T20:35:00Z"
  },
  {
    "title": "Update: Oregon Calls For New Hearing After Appeals Court Rules National Guard Can Deploy to Portland",
    "description": "In a 2-1 decision, the 9th Circuit Court says the president has authority to deploy the military to Portland, amid ongoing protests at the ICE facility. The Oregon Attorney General's Office wants the case reheard.\n \n by Abe Asher\n \n \n \n Updated: 5:02 pm Octob…",
    "link": "https://www.portlandmercury.com/news/2025/10/20/48082652/update-oregon-calls-for-new-hearing-after-appeals-court-rules-national-guard-can-deploy-to-portland",
    "timestamp": "2025-10-20T20:35:00Z"
  },
  {
    "title": "Poilievre clarifies remarks on 'despicable leadership' at RCMP, says he was talking about past commissioner",
    "description": "Conservative Leader Pierre Poilievre on Monday sought to clarify his statement that RCMP leadership was \"despicable\" over its handling of Trudeau-era scandals, by saying he supports the force and was talking about its past commissioner.",
    "link": "https://nationalpost.com/news/politics/poilievre-clarifies-remarks-on-despicable-leadership-at-rcmp-says-he-was-talking-about-past-commissioner",
    "timestamp": "2025-10-20T20:34:06Z"
  },
  {
    "title": "Major implications as court weighs in on Trump's National Guard deployment to ICE facility",
    "description": "President Donald Trump got the all-clear from the U.S. Court of Appeals for the Ninth Circuit to deploy the Oregon National Guard to protect the Immigration and Customs Enforcement Facility in Portland — at least for the time being, while litigation continues…",
    "link": "https://www.rawstory.com/trump-guard/",
    "timestamp": "2025-10-20T20:33:07Z"
  },
  {
    "title": "White House Starts Tearing Down Part of East Wing As Part Of Construction Of Trump’s New Ballroom",
    "description": "Construction crews began demolishing part of the East Wing, the part of the White House complex that houses the offices of the first lady, as part of Donald Trump’s plans for building a $250 million ballroom that will dominate the grounds. Reporters spotted t…",
    "link": "http://deadline.com/2025/10/east-wing-torn-down-trump-white-house-ballroom-1236592547/",
    "timestamp": "2025-10-20T20:33:05Z"
  },
  {
    "title": "US Appeals Court Says Trump Can Deploy Soldiers In Portland",
    "description": "A US appeals court said Monday that President Donald Trump can send National Guard troops to Portland, despite objections from Oregon's governor.",
    "link": "https://www.ibtimes.com/us-appeals-court-says-trump-can-deploy-soldiers-portland-3787698",
    "timestamp": "2025-10-20T20:30:50Z"
  },
  {
    "title": "Students for Justice in Palestine Backs Gaza Executions: ‘Death to Collaborators’",
    "description": "The national body of Students for Justice in Palestine backed Hamas’s grisly public executions of fellow Palestinians in Gaza on Sunday, posting “Death to the Occupation, Death to Collaborators” on Instagram. The call for executions followed the murder of “jo…",
    "link": "https://freerepublic.com/focus/f-news/4347590/posts",
    "timestamp": "2025-10-20T20:30:44Z"
  },
  {
    "title": "I worked for Biden. Here’s the gold in Trump’s foreign policy.",
    "description": "The president leverages America’s power well and ignores domestic criticism.Ned Price served in the Biden administration as deputy to the U.S. ambassador to the United Nations and as a senior adviser and spokesperson in the State Department.President Donald T…",
    "link": "https://freerepublic.com/focus/f-news/4347589/posts",
    "timestamp": "2025-10-20T20:30:36Z"
  },
  {
    "title": "U.S. appeals court lets Trump send troops to Portland",
    "description": "A divided U.S. appeals court ruled on Monday that Donald Trump can send National Guard troops into Portland, Ore., despite objections by the leaders of the city and state, giving the Republican president an important legal victory as he dispatches military fo…",
    "link": "https://www.cbc.ca/news/world/us-appeals-court-allows-troops-in-portland-9.6945763",
    "timestamp": "2025-10-20T20:29:38Z"
  },
  {
    "title": "James Comey wants 'vindictive' case dropped and Trump's prosecutor disqualified",
    "description": "Former FBI Director James Comey on Monday filed motions seeking the dismissal of criminal charges against him, arguing Lindsey Halligan wasn't properly appointed and that the case was politically motivated.",
    "link": "https://www.nbcnews.com/politics/justice-department/james-comey-wants-case-dropped-trumps-prosecutor-disqualified-rcna238736",
    "timestamp": "2025-10-20T20:27:18Z"
  },
  {
    "title": "Supreme Court Is Told Trump Tariffs Are Illegal $3 Trillion Tax",
    "description": "Small businesses challenging many of President Donald Trump’s global tariffs urged the US Supreme Court to affirm lower court rulings that the import levies amount to a massive illegal tax on American companies.",
    "link": "https://financialpost.com/pmn/business-pmn/supreme-court-is-told-trump-tariffs-are-illegal-3-trillion-tax",
    "timestamp": "2025-10-20T20:26:47Z"
  },
  {
    "title": "Trump Demolishes Part of White House as He Builds His Tacky Ballroom",
    "description": "President Donald Trump said his new 90,000-square-foot White House ballroom “won’t interfere with the current building.” But footage from 1600 Pennsylvania Avenue on Monday afternoon shows a crew tearing down the facade of the East Wing to make way for the ga…",
    "link": "https://newrepublic.com/post/202025/trump-demolishes-part-white-house-ballroom-construction",
    "timestamp": "2025-10-20T20:25:39Z"
  },
  {
    "title": "Nearly Half of Dems in Competitive Primary Districts Say They 'Could Never' Support a Candidate Backed by AIPAC",
    "description": "As voters sour on Israel after over two years of genocide in Gaza, an internal poll suggests that backing from the pro-Israel lobby may be a liability for Democrats seeking to win their primaries.The Democratic polling firm Upswing Strategies canvassed 850 De…",
    "link": "https://www.commondreams.org/news/democrats-could-never-support-aipac-candidate",
    "timestamp": "2025-10-20T20:24:26Z"
  },
  {
    "title": "Oil Dips as Surplus Signs Grow",
    "description": "Oil prices eased as rising tanker storage and contango spreads signaled an emerging surplus.",
    "link": "https://www.rigzone.com/news/wire/oil_dips_as_surplus_signs_grow-20-oct-2025-182123-article/",
    "timestamp": "2025-10-20T20:23:17Z"
  },
  {
    "title": "Russia sanctions bill on hold for now, Thune says",
    "description": "Senate Majority Leader John Thune indicated Monday that legislation slapping new sanctions on Russia and its trading partners is on hold until after an upcoming meeting between President Donald Trump and Russian President Vladimir Putin. \n“I think they’re thi…",
    "link": "https://biztoc.com/x/2d0ee26500aabfc8",
    "timestamp": "2025-10-20T20:23:00Z"
  },
  {
    "title": "If Trump’s cease-fire holds, the anti-Israel haters will have little to rant about",
    "description": "Rather than celebrate an end to hostilities, the left is now struggling to reconcile its rhetoric with a reality shaped by a president it vehemently opposes.",
    "link": "https://nypost.com/2025/10/20/opinion/if-trumps-cease-fire-holds-the-anti-israel-haters-will-have-little-to-rant-about/",
    "timestamp": "2025-10-20T20:22:30Z"
  },
  {
    "title": "3I/Atlas: Is a Manhattan-sized ALIEN SHIP hurtling towards Earth?!",
    "description": "I have held off on covering this because I wanted to see how things shook out and whether the “research” on this was valid, but now that Glenn Beck is covering it, I want to at least bring it to your attention. Is a Manhattan-sized ALIEN SHIP hurtling towards…",
    "link": "https://freerepublic.com/focus/f-chat/4347588/posts",
    "timestamp": "2025-10-20T20:21:42Z"
  },
  {
    "title": "Trump Is Literally Demolishing the White House",
    "description": "The president previously said that construction for his $250 million ballroom would not “interfere” with the people’s house.",
    "link": "http://nymag.com/intelligencer/article/trump-demolishes-white-house-east-wing-for-his-ballroom.html",
    "timestamp": "2025-10-20T20:21:00Z"
  },
  {
    "title": "Kenny Loggins Slams Donald Trump for Using 'Danger Zone' in AI Video Bombing No Kings Protesters With Poop: 'I Request That My Recording Is Removed Immediately' (Ellise Shafer/Variety)",
    "description": "Ellise Shafer / Variety:\nKenny Loggins Slams Donald Trump for Using ‘Danger Zone’ in AI Video Bombing No Kings Protesters With Poop: ‘I Request That My Recording Is Removed Immediately’  —  Kenny Loggins has spoken out against Donald Trump using his song “Dan…",
    "link": "https://www.memeorandum.com/251020/p100",
    "timestamp": "2025-10-20T20:20:01Z"
  },
  {
    "title": "Trump’s War on ‘Illegal DEI’ Leaves Diversity Industry in Ruins, Study Shows",
    "description": "DAILY CALLER NEWS FOUNDATION—The plight of corporate diversity, equity, and inclusion (DEI) jobs is only getting worse as the Trump administration’s crackdown takes hold, new... Read More\nThe post Trump’s War on ‘Illegal DEI’ Leaves Diversity Industry in Ruin…",
    "link": "https://www.dailysignal.com/2025/10/20/trumps-war-illegal-dei-leaves-diversity-industry-ruins-study-shows/",
    "timestamp": "2025-10-20T20:20:00Z"
  },
  {
    "title": "Trump just made Hillary Clinton's 'deplorables' comment look 'tasteful': MSNBC host",
    "description": "President Donald Trump's video that dumps feces on America while wearing a crown has drawn criticism since it was posted, but even MSNBC host Katy Tur is commenting that there's no comparison. Since the shooting death of Charlie Kirk, Republican officials and…",
    "link": "https://www.rawstory.com/trump-no-kings-video/",
    "timestamp": "2025-10-20T20:19:19Z"
  },
  {
    "title": "Fox News Politics Newsletter: Trump blasts Colombia’s Petro after alleged drug strike death",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-trump-blasts-colombias-petro-after-alleged-drug-strike-death",
    "timestamp": "2025-10-20T20:18:07Z"
  },
  {
    "title": "Trump threatens Hamas if Gaza ceasefire collapses as JD Vance to visit Israel",
    "description": "President Donald Trump warns Hamas the U.S.-brokered Gaza truce must hold, vowing serious consequences if violence resumes, as Vice President JD Vance to visit Israel.",
    "link": "https://www.foxnews.com/world/trump-threatens-hamas-if-gaza-ceasefire-collapses-jd-vance-visit-israel",
    "timestamp": "2025-10-20T20:17:15Z"
  },
  {
    "title": "Appeals court allows Trump to deploy National Guard to Portland",
    "description": "A US appeals court rules to halt a judge's order that blocked the deployment while a challenge to Trump's action plays out.",
    "link": "https://www.bbc.com/news/articles/c201k3qky9lo",
    "timestamp": "2025-10-20T20:17:14Z"
  },
  {
    "title": "Official defends use of tear gas in Chicago",
    "description": "U.S. Border Patrol agents assigned to immigration enforcement in the Chicago area have been given body cameras, an official testified Monday as a judge held a hearing to learn more about the Trump administration's crackdown, which has produced more than 1,000…",
    "link": "https://www.bostonherald.com/2025/10/20/official-defends-use-of-tear-gas-in-chicago/",
    "timestamp": "2025-10-20T20:17:08Z"
  },
  {
    "title": "US appeals court lets Trump send troops to Portland (Dietrich Knauth/Reuters)",
    "description": "Dietrich Knauth / Reuters:\nUS appeals court lets Trump send troops to Portland  —  A divided U.S. appeals court ruled on Monday that Donald Trump can send National Guard troops into Portland, Oregon, despite objections by the leaders of the city and state, gi…",
    "link": "https://www.memeorandum.com/251020/p99",
    "timestamp": "2025-10-20T20:15:01Z"
  },
  {
    "title": "BREAKING: James Comey Files Motion to Dismiss Trump DOJ Charges",
    "description": "James Comey and his legal team filed a motion to dismiss the federal case against him, arguing it is the result of President Trump's \"personal animus\"\nThe post BREAKING: James Comey Files Motion to Dismiss Trump DOJ Charges first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/breaking-james-comey-files-motion-to-dismiss-trump-doj-charges/",
    "timestamp": "2025-10-20T20:14:51Z"
  },
  {
    "title": "United States and Australia sign critical-minerals agreement as a way to counter China",
    "description": "The two leaders described the agreement as an $8.5 billion deal between the allies.",
    "link": "https://www.bostonherald.com/2025/10/20/us-australia-critical-minerals/",
    "timestamp": "2025-10-20T20:14:49Z"
  },
  {
    "title": "Bitcoin Mining Stocks Surge as Another Firm Embraces AI Boom",
    "description": "CleanSpark's shares rose on Monday, along with those of other major mining stocks.",
    "link": "https://decrypt.co/345037/bitcoin-mining-surge-firm-embraces-ai-boom",
    "timestamp": "2025-10-20T20:14:06Z"
  },
  {
    "title": "GOP’s immigration pitch to New Jersey Latinos aims for some distance from Trump in governor’s race",
    "description": "TRENTON, N.J. (AP) — At a Spanish-speaking town hall, the Republican candidate for New Jersey governor assured two young Mexican immigrants who were brought to the United States as children that people without criminal records would not face deportation. Thre…",
    "link": "https://freerepublic.com/focus/f-news/4347581/posts",
    "timestamp": "2025-10-20T20:13:40Z"
  },
  {
    "title": "How Trump-Zelensky meeting turned acrimonious over demands for territorial concessions - CNN",
    "description": "How Trump-Zelensky meeting turned acrimonious over demands for territorial concessionsCNN Trump calls for Ukraine to be carved up with Russia after tense meeting with ZelenskyyCNBC Trump calls for Ukraine war to halt with Russia in control of occupied territo…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179837612",
    "timestamp": "2025-10-20T20:13:34Z"
  },
  {
    "title": "Report: Bible Sales Soar Since the Assassination of Charlie Kirk",
    "description": "Bible sales soared 36 percent in September compared to the same month in 2024, The Wall Street Journal reported, citing data from the publishing sales tracker Circana BookScan.\nThe post Report: Bible Sales Soar Since the Assassination of Charlie Kirk appeared…",
    "link": "https://www.breitbart.com/politics/2025/10/20/report-bible-sales-soar-since-the-assassination-of-charlie-kirk/",
    "timestamp": "2025-10-20T20:13:29Z"
  },
  {
    "title": "Trump Bashes Australian Ambassador Who Once Called Him 'Village Idiot'",
    "description": "President Donald Trump slammed Australian Ambassador to the United States Kevin Rudd, who once called Trump \"a village idiot,\" during Monday's bilateral meeting with Australian Prime Minister Anthony Albanese of the left-wing Labor Party.\nThe post Trump Bashe…",
    "link": "https://www.breitbart.com/politics/2025/10/20/trump-bashes-australian-ambassador-who-once-called-him-village-idiot/",
    "timestamp": "2025-10-20T20:13:25Z"
  },
  {
    "title": "US and Australia sign rare earths deal to counter China's dominance - BBC",
    "description": "US and Australia sign rare earths deal to counter China's dominanceBBC Trump administration: Shutdown hits 20-day mark as Australia’s PM visits White HouseCNN Trump and Australian prime minister sign critical minerals deal as U.S. looks for alternatives to Ch…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179837610",
    "timestamp": "2025-10-20T20:13:24Z"
  },
  {
    "title": "Immigration Service Issues Guidance On Who Pays The $100,000 H-1B Fee",
    "description": "U.S. Citizenship and Immigration Services has issued new guidance on who pays the $100,000 H-1B fee and how to apply for an exception.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/10/20/immigration-service-issues-guidance-on-who-pays-the-100000-h-1b-fee/",
    "timestamp": "2025-10-20T20:13:18Z"
  },
  {
    "title": "Trump Mobile is selling ‘renewed’ iPhones that are really terrible deals",
    "description": "Macworld\n\n\n\r\n\n\n\n\nAs we wait for the T1, the first phone from Trump Mobile, the mobile phone service provider run by Donald Trump’s Trump Organization, the would-be carrier is now offering iPhones for sale with its service–not any of the iPhones from Apple’s c…",
    "link": "https://www.macworld.com/article/2947542/trump-mobile-is-selling-renewed-iphones-that-are-really-terrible-deals.html",
    "timestamp": "2025-10-20T20:12:45Z"
  },
  {
    "title": "U.S. and Australia sign $8.5 billion critical-minerals deal to counter China",
    "description": "President Donald Trump and Australian Prime Minister Anthony Albanese signed a critical-minerals deal at the White House on Monday as the U.S. eyes the continent’s rich rare-earth resources when China is imposing tougher rules on exporting its own critical mi…",
    "link": "https://biztoc.com/x/0c6d20f87b32d98c",
    "timestamp": "2025-10-20T20:11:58Z"
  },
  {
    "title": "Fox News Anchor Drops All-Time Fact Check On Dem Guest Ripping Trump’s ‘Defecating’ Clip",
    "description": "Fox anchor Sandra Smith on Monday provided a succinct fact-check in response to a Democrat fuming over Trump's AI-generated video about the \"No Kings\" protests.\nThe post Fox News Anchor Drops All-Time Fact Check On Dem Guest Ripping Trump’s ‘Defecating’ Clip …",
    "link": "https://www.mediaite.com/media/tv/fox-news-anchor-drops-all-time-fact-check-on-dem-guest-ripping-trumps-defecating-clip/",
    "timestamp": "2025-10-20T20:11:53Z"
  },
  {
    "title": "Ticker: Trump suggests US will buy Argentine beef; Can pot smokers legally own guns?",
    "description": "President Donald Trump said the United States could buy Argentine beef in an attempt to bring down prices for American consumers.\n“We would buy some beef from Argentina,” the Republican president told reporters aboard Air Force One during a flight from Florid…",
    "link": "https://biztoc.com/x/ada31db866563698",
    "timestamp": "2025-10-20T20:11:50Z"
  },
  {
    "title": "Fyodor Lukyanov: A Palestine without Palestinians is impossible",
    "description": "The Middle East cannot be stabilized by money alone Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626736-fyodor-lukyanov-palestine-without-palestinians/",
    "timestamp": "2025-10-20T20:11:05Z"
  },
  {
    "title": "Trump claims 'unquestioned power' in vow to send troops to San Francisco (Dani Anguiano/The Guardian)",
    "description": "Dani Anguiano / The Guardian:\nTrump claims ‘unquestioned power’ in vow to send troops to San Francisco  —  President claims on Fox News ‘they want us in San Francisco’ despite opposition from city officials  —  Donald Trump has again pledged to send troops to…",
    "link": "https://www.memeorandum.com/251020/p98",
    "timestamp": "2025-10-20T20:10:01Z"
  },
  {
    "title": "House Republican Admits on CNN He’s So ‘Intense’ It ‘Scares’ People As He Argues Against Islam Spreading in US",
    "description": "Rep. Randy Fine (R-FL) repeatedly told CNN's Brianna Keilar Monday that he's very \"intense\" when he talks about the \"islamification of America.\"\nThe post House Republican Admits on CNN He’s So ‘Intense’ It ‘Scares’ People As He Argues Against Islam Spreading …",
    "link": "https://www.mediaite.com/media/tv/house-republican-admits-on-cnn-hes-so-intense-it-scares-people-as-he-argues-against-islam-spreading-in-us/",
    "timestamp": "2025-10-20T20:09:58Z"
  },
  {
    "title": "13-Year-Old Boy Arrested by ICE Still Waiting for a Bond Hearing More Than 11 Days Later",
    "description": "A 13-year-old boy who was taken more than 500 miles away from his family by ICE remains in custody awaiting a bond hearing.",
    "link": "https://reason.com/2025/10/20/13-year-old-boy-arrested-by-ice-still-waiting-for-a-bond-hearing-more-than-11-days-later/",
    "timestamp": "2025-10-20T20:08:23Z"
  },
  {
    "title": "Ticker: Trump suggests US will buy Argentine beef; Can pot smokers legally own guns?",
    "description": "Ticker: Trump suggests US will buy Argentine beef; Can pot smokers legally own guns?",
    "link": "https://www.bostonherald.com/2025/10/20/ticker-trump-suggests-us-will-buy-argentine-beef-can-pot-smokers-legally-own-guns/",
    "timestamp": "2025-10-20T20:08:19Z"
  },
  {
    "title": "Apple Tops Microsoft As World’s Second-Most Valuable Company After Stock Rally",
    "description": "The surge in shares was fueled by the iPhone 17 outselling the iPhone 16 in China and the U.S., according to a report from Counterpoint Research.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/10/20/apple-tops-microsoft-as-worlds-second-most-valuable-company-after-stock-rally/",
    "timestamp": "2025-10-20T20:07:14Z"
  },
  {
    "title": "The GOP cult of political bullying must be stopped — here's how we do it",
    "description": "Professor Emeritus Roddey Reid could have retired from the University of California San Diego to a life of deserved leisure. Instead, he has just published a handbook on “Political Intimidation and Public Bullying,” which is increasingly dominating government…",
    "link": "https://www.rawstory.com/republicans-2674214967/",
    "timestamp": "2025-10-20T20:05:28Z"
  }
]