[
  {
    "title": "As RFK Jr. defends cuts to public health, experts warn of devastating effects that could haunt Americans for decades",
    "description": "The chaotic first few months of Donald Trump’s second U.S. presidency have produced much more heat than light, with Trump alternately invoking and rescinding massive tariffs, issuing sweeping executive orders that are quickly thrown into court challenges, and…",
    "link": "https://biztoc.com/x/6184771c1b6c52fd",
    "timestamp": "2025-04-13T12:14:02Z"
  },
  {
    "title": "Trump “Shower Wars”: Water Pressure, Hair Care, and Freedom",
    "description": "A global trade war? Pfft. That’s small potatoes compared to what President Donald Trump tackled on Wednesday: the epic battle to redefine the humble “shower head.” Yes, in a move that the White House boldly declared would “end the Obama-Biden war on water pre…",
    "link": "https://english.gossiplankanews.com/2025/04/trump-shower-wars-water-pressure-hair.html",
    "timestamp": "2025-04-13T12:14:00Z"
  },
  {
    "title": "What Trump Said About China Tariffs This Week",
    "description": "China retaliated against Donald Trump’s latest tariffs by hiking duties on all US goods, while calling the administration’s actions a “joke” and saying it no longer considers them worth matching.\nBeijing will raise tariffs on all US goods from 84% to 125% sta…",
    "link": "https://biztoc.com/x/9bb15dd7e58b5d2f",
    "timestamp": "2025-04-13T12:13:59Z"
  },
  {
    "title": "Here comes the tariff: Brides are scrambling as wedding gowns get caught in Trump's trade war",
    "description": "Most wedding dresses are made in China. That means Trump's huge tariffs on Chinese goods could make getting married more expensive.",
    "link": "https://www.businessinsider.com/tariffs-trump-china-wedding-dresses-2025-4",
    "timestamp": "2025-04-13T12:10:02Z"
  },
  {
    "title": "Iran says talks with US to focus solely on nuclear issue, lifting sanctions",
    "description": "Indirect talks between Iran and the US, mediated by Oman, are set to continue, focusing solely on nuclear issues and sanctions relief. This follows recent discussions in Muscat, the highest-level since the 2015 accord's collapse. Iran insists on limiting the …",
    "link": "https://economictimes.indiatimes.com/news/defence/iran-says-talks-with-us-to-focus-solely-on-nuclear-issue-lifting-sanctions/articleshow/120254456.cms",
    "timestamp": "2025-04-13T12:09:48Z"
  },
  {
    "title": "Kremlin teases potential Putin-Trump meeting",
    "description": "“We need to prepare for it,” spokesman Dmitry Peskov has said, following US envoy Steve Witkoff’s talks with the Russian president on Friday Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615706-trump-putin-potential-meeting/",
    "timestamp": "2025-04-13T12:09:23Z"
  },
  {
    "title": "'Clear indications that Donald Trump’s presidency is endangered' after climbdown: expert",
    "description": "After only three months in office full of missteps, some political observers are admitting Donald Trump's second time in the Oval Office is going poorly with one Washington insider pointing out his tariff plan has turned into a \"self-inflicted wound\" that has…",
    "link": "https://www.rawstory.com/trump-endangered/",
    "timestamp": "2025-04-13T12:04:31Z"
  },
  {
    "title": "Sudanese paramilitary kill at least 100 in attacks on famine-stricken camps",
    "description": "Sudan’s paramilitary Rapid Support Forces have killed at least 100 people, including 20 children and nine aid workers, after launching an assault on two famine-stricken camps in the Darfur region.",
    "link": "https://www.nbcnews.com/news/world/rsf-sudan-paramilitary-kill-100-famine-camps-rcna201030",
    "timestamp": "2025-04-13T12:03:39Z"
  },
  {
    "title": "Trump Tariff Surcharges Are Starting To Appear on Receipts",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCompanies are making it clear to customers that some rising prices are down to President Donald Trump's slew of tariffs on international trade.\nWhy It Matters\nTrump announced his sweeping tariff agenda on Apri…",
    "link": "https://biztoc.com/x/fed03ea0c6b1b705",
    "timestamp": "2025-04-13T12:03:03Z"
  },
  {
    "title": "Could the U.S. become a manufacturing hub again?",
    "description": "President Donald Trump recently implemented the biggest tariff increase from the U.S. since the 1930s. He said one of his goals is to grow manufacturing stateside.\nIn his announcement, the president said the U.S. could be a manufacturing hub again. “Empty, de…",
    "link": "https://biztoc.com/x/11add280406d3c1f",
    "timestamp": "2025-04-13T12:02:56Z"
  },
  {
    "title": "Sunday Morning Talk Show Thread 13 April 2025",
    "description": "The Talk ShowsApril 13th, 2025 Guests to be interviewed today on major television talk shows:FACE THE NATION (CBS): Margaret Brennan anchors: Rep. Ro Khanna (D-Calif.); Neel Kashkari, president of the Federal Reserve Bank of Minneapolis; Fired director of the…",
    "link": "https://freerepublic.com/focus/f-news/4310728/posts",
    "timestamp": "2025-04-13T12:01:45Z"
  },
  {
    "title": "Trump Tariff Surcharges Are Starting To Appear on Receipts",
    "description": "Several companies have made it clear to U.S. customers that price rises are a result of the Trump administration's tariff agenda.",
    "link": "https://www.newsweek.com/trump-tariff-surcharges-appear-receipts-2059132",
    "timestamp": "2025-04-13T12:01:37Z"
  },
  {
    "title": "White House plans 'extraordinary' Holy Week as Trump honors Easter with 'the observance it deserves'",
    "description": "EXCLUSIVE: The White House is gearing up for an “extraordinary\" weeklong celebration for Holy Week ahead of Easter, with President Trump participating in a number of events.",
    "link": "https://www.foxnews.com/politics/white-house-hold-extraordinary-holy-week-events-trump-honors-easter-the-observance-deserves",
    "timestamp": "2025-04-13T12:00:52Z"
  },
  {
    "title": "Newspoll steady but Albanese’s ratings jump; swing to Labor in marginal seats",
    "description": "While the two-party preferred numbers are steady, the prime minister’s approval rating has improved, as have Labor’s chances in marginal seats.",
    "link": "https://theconversation.com/newspoll-steady-but-albaneses-ratings-jump-swing-to-labor-in-marginal-seats-254445",
    "timestamp": "2025-04-13T12:00:18Z"
  },
  {
    "title": "Opinion: No, Donald Trump Does Not Know What The Hell He Is Doing",
    "description": "Only Congress can save us from the consequences of his trade war right now. So … bon courage.",
    "link": "https://www.huffpost.com/entry/trump-trade-war-disaster_n_67f99409e4b0c859a8c0bd9e",
    "timestamp": "2025-04-13T12:00:10Z"
  },
  {
    "title": "Are you paying more than before to buy Canadian?; Tariff travel trauma: CBC's Marketplace Cheat Sheet",
    "description": "CBC's Marketplace rounds up the consumer and health news you need from the week.",
    "link": "https://www.cbc.ca/news/business/marketplace-cheat-sheet-april-13-1.7508296",
    "timestamp": "2025-04-13T12:00:00Z"
  },
  {
    "title": "Only Trump Is Brave Enough for This Job",
    "description": "DAILY CALLER NEWS FOUNDATION—Aside from congressional Democrats, there’s widespread agreement among the American people that the failed status quo in Washington must be confronted immediately.... Read More\nThe post Only Trump Is Brave Enough for This Job appe…",
    "link": "https://www.dailysignal.com/2025/04/13/only-trump-brave-enough-job/",
    "timestamp": "2025-04-13T12:00:00Z"
  },
  {
    "title": "Donald Trump Shouldn’t Make a Deal with Iran",
    "description": "Trump should abandon the peace talks with Iran and instead focus on creating an alliance consisting of Israel and the Sunni Arab states.\nThe post Donald Trump Shouldn’t Make a Deal with Iran appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/donald-trump-shouldnt-make-a-deal-with-iran",
    "timestamp": "2025-04-13T12:00:00Z"
  },
  {
    "title": "Trump Concocted the ‘Tariffs Hoax’ to ‘Decouple’ with China",
    "description": "The Trump tariff extravaganza was never about trade deficits, reindustrialization, or bringing jobs back to America. It was always about China. Now that Trump has either eased or lifted the tariffs on 90 other countries, we can see what’s …\nThe post Trump Con…",
    "link": "https://www.globalresearch.ca/trump-concocted-tariffs-hoax-decouple-china/5884304",
    "timestamp": "2025-04-13T11:59:14Z"
  },
  {
    "title": "NATO Has Failed, and the EU Wants Turkiye on Its Knees. Ret. Admiral Cem Gurdeniz",
    "description": "In the second decade of the 21st century, seismic geopolitical shifts pushed global powers to reassess the importance of Turkiye’s position within Eurasia. This growing focus –n from Washington to Moscow, Brussels to Beijing – has only intensified as the …\nTh…",
    "link": "https://www.globalresearch.ca/nato-failed-eu-wants-turkiye/5884307",
    "timestamp": "2025-04-13T11:56:59Z"
  },
  {
    "title": "'Protect the Dolls': Trans Rights T-Shirt Slogan Explained",
    "description": "The T-shirt, created by U.S. designer Conner Ives, has been worn by the likes of Troye Sivan and Pedro Pascal.",
    "link": "https://www.newsweek.com/protect-dolls-trans-rights-t-shirt-pedro-pascal-troye-sivan-2059135",
    "timestamp": "2025-04-13T11:52:51Z"
  },
  {
    "title": "U.S.-China tariff tensions could turn military disputes into something more dire",
    "description": "Facing intense pressure from Wall Street and newly spooked by the alarming drop in the bond market, President Donald Trump largely reversed course on his global trade war Wednesday.",
    "link": "https://biztoc.com/x/388a6964905509c8",
    "timestamp": "2025-04-13T11:52:04Z"
  },
  {
    "title": "Some Democrats in Congress are starting to talk about impeachment. They’re right",
    "description": "House impeachment manager Rep. David Cicilline, D-R.I., speaks during closing arguments in the second impeachment trial of Donald Trump in the Senate at the U.S. Capitol on Feb. 13, 2021.",
    "link": "https://biztoc.com/x/96f247573e428035",
    "timestamp": "2025-04-13T11:51:56Z"
  },
  {
    "title": "Iran says seeks 'real and fair' deal in nuclear talks with US",
    "description": "Tehran (AFP) April 12, 2025\n\n Iran said Friday it seeks a \"real and fair\" agreement on its nuclear programme, as the United States signalled a willingness to compromise ahead of high-stakes weekend talks - while insisting that Tehran cannot have a nuclear wea…",
    "link": "https://www.spacewar.com/reports/Iran_says_seeks_real_and_fair_deal_in_nuclear_talks_with_US_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "US in hurry for nuclear deal, Iran says after high-stakes talks",
    "description": "Muscat, Oman (AFP) April 13, 2025\n\n The United States wants a nuclear agreement \"as soon as possible\", Iran said after rare talks on Saturday, as US President Donald Trump threatens military action if they fail to reach a deal. \n\nThe long-term adversaries, wh…",
    "link": "https://www.spacewar.com/reports/US_in_hurry_for_nuclear_deal_Iran_says_after_high-stakes_talks_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "Russian strike on city centre in Ukraine's Sumy kills 21",
    "description": "Kyiv, Ukraine (AFP) April 13, 2025\n\n\n A Russian ballistic missile attack on Ukraine's northeastern city of Sumy killed at least 21 people and wounded 83 on Palm Sunday, Kyiv said, in another deadly attack on civilians that came after a top US official travell…",
    "link": "https://www.spacewar.com/reports/Russian_strike_on_city_centre_in_Ukraines_Sumy_kills_21_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "Iran says talks with US to focus solely on nuclear issue, lifting sanctions",
    "description": "Tehran (AFP) April 13, 2025\n\n\n Iran's foreign ministry said Sunday that talks with the United States slated for next weekend will remain \"indirect\" with Omani mediation, and focused solely on the nuclear issue and lifting of sanctions. \n\nIranian Foreign Minis…",
    "link": "https://www.spacewar.com/reports/Iran_says_talks_with_US_to_focus_solely_on_nuclear_issue_lifting_sanctions_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "E. Europe watching closely as US weighs troop numbers",
    "description": "Paris (AFP) April 11, 2025\n\n\n A reduction in the number of US soldiers in eastern Europe would be seen as Washington moving another step closer to Moscow and a worrying sign for Europeans, according to analysts. \n\nThe NBC news channel, quoting US and European…",
    "link": "https://www.spacewar.com/reports/E_Europe_watching_closely_as_US_weighs_troop_numbers_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "Trump carves up world and international order with it",
    "description": "Paris (AFP) April 12, 2025\n\n\n By casting doubt on the world order, Donald Trump risks dragging the globe back into an era where great powers impose their imperial will on the weak, analysts warn. \n\nRussia wants Ukraine, China demands Taiwan and now the US pre…",
    "link": "https://www.spacewar.com/reports/Trump_carves_up_world_and_international_order_with_it_999.html",
    "timestamp": "2025-04-13T11:48:46Z"
  },
  {
    "title": "U.S. tariffs are about to trigger the greatest trade diversion the world has ever seen",
    "description": "Trump’s tariffs have redirected billions of dollars in exports originally bound for the U.S. to other markets.",
    "link": "https://theconversation.com/u-s-tariffs-are-about-to-trigger-the-greatest-trade-diversion-the-world-has-ever-seen-254049",
    "timestamp": "2025-04-13T11:46:32Z"
  },
  {
    "title": "'I can't keep up': Trump's changing tariffs leave shoppers feeling paralysed",
    "description": "When his camera stopped working on his iPhone recently, New Yorker Richard Medina didn't waste any time. With the threat of tariff-fuelled price hikes on smartphones bearing down, he quickly called his phone company for a new one. \"I said, 'We've got to switc…",
    "link": "https://freerepublic.com/focus/f-news/4310727/posts",
    "timestamp": "2025-04-13T11:46:20Z"
  },
  {
    "title": "Top Fed Official Confirms The Bank Is Ready To Bail Out Trump",
    "description": "A top Federal Reserve official has said it “would absolutely be prepared\" to step in to rescue markets if Trump’s trade war threatens the financial system...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/13/top-fed-official-confirms-the-bank-is-ready-to-bail-out-trump/",
    "timestamp": "2025-04-13T11:45:18Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "Welcome to the second day of Passover: Sunday, April 13, 2025, and National Peach Cobbler Day. It’s also Scrabble Day (celebrating the birthday of its creator, Alfred Mosher Butts [1899-1993]), Palm Sunday, and Thomas Jefferson Day (he was born on this day in…",
    "link": "https://whyevolutionistrue.com/2025/04/13/sunday-hili-dialogue-529/",
    "timestamp": "2025-04-13T11:45:10Z"
  },
  {
    "title": "NFT trader faces prison for $13M tax fraud on CryptoPunk profits",
    "description": "A non-fungible token (NFT) trader could face up to six years in prison after pleading guilty to underreporting nearly $13 million in profits from trading CryptoPunks, according to the US Attorney’s Office for the Middle District of Pennsylvania.Waylon Wilcox,…",
    "link": "https://cointelegraph.com/news/cryptopunk-trader-six-year-sentence-13-m-gains",
    "timestamp": "2025-04-13T11:42:58Z"
  },
  {
    "title": "Trump’s bullying must stop but the true costs of globalisation will remain | Richard Partington",
    "description": "We cannot return to the status quo before ‘liberation day’, with western economies hollowed out by free-market capitalism \nFundamentally wrong, brutal and paranoid. A preacher of voodoo economics, attacking the US’s allies and enemies alike. Condemnation of D…",
    "link": "https://biztoc.com/x/3241279c77bf8196",
    "timestamp": "2025-04-13T11:41:01Z"
  },
  {
    "title": "Terminations at U.S. government agencies that monitor extreme weather events will have negative effects",
    "description": "Weather forecasting relies on international collaboration. Cuts at U.S. government agencies will negatively impact attempts to predict and mitigate the effects of extreme weather events.",
    "link": "https://theconversation.com/terminations-at-u-s-government-agencies-that-monitor-extreme-weather-events-will-have-negative-effects-251314",
    "timestamp": "2025-04-13T11:39:13Z"
  },
  {
    "title": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41",
    "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape Lazarus Expands Malicious npm Campaign: 11 New Packages Add Malware Loaders and Bitbucket Payloads BadBazaar: iOS and Android…",
    "link": "https://securityaffairs.com/176503/malware/security-affairs-malware-newsletter-round-41.html",
    "timestamp": "2025-04-13T11:39:10Z"
  },
  {
    "title": "US Visa Bulletin For May 2025 Brings Bad News For Indians",
    "description": "Amid US President Donald Trump&#039;s immigration crackdown, the American dream of thousands of Indians seems to be fading.",
    "link": "https://www.ndtv.com/world-news/american-dream-in-trouble-us-visa-bulletin-for-may-2025-bring-bad-news-for-indians-8154869",
    "timestamp": "2025-04-13T11:38:36Z"
  },
  {
    "title": "Trump admin makes new move to bring South African refugees to US as president blasts nation's rulers again",
    "description": "As the U.S. begins refugee processing for South African Afrikaners, a group is pushing Washington to support its bid for an autonomous Afrikaner homeland within South Africa.",
    "link": "https://www.foxnews.com/world/trump-admin-makes-new-move-bring-south-african-refugees-us-president-blasts-nations-rulers-again",
    "timestamp": "2025-04-13T11:30:17Z"
  },
  {
    "title": "Apple has few incentives to start making iPhones in US, despite Trump's trade war",
    "description": "The Trump administration predicts its barrage of tariffs will push Apple to manufacture the iPhone in the U.S. for the first time, but that's an unlikely scenario.",
    "link": "https://richmond.com/news/nation-world/business/economy/article_49608965-0c3e-5f91-a045-1f05cf24fa1a.html",
    "timestamp": "2025-04-13T11:30:00Z"
  },
  {
    "title": "Peskov: Ukraine not clicking with Trump admin",
    "description": "Russian presidential spokesperson Dmitry Peskov claimed on Sunday that the Ukrainian government is \"not getting along well\" with the administration of United States President Donald Trump.\"The thing i...",
    "link": "https://biztoc.com/x/f5682803d7d3b249",
    "timestamp": "2025-04-13T11:29:56Z"
  },
  {
    "title": "America is now an unstable emerging market",
    "description": "The US will pay a market penalty for Trump’s turmoil",
    "link": "https://www.irishtimes.com/business/2025/04/13/america-is-now-unstable-emerging-market/",
    "timestamp": "2025-04-13T11:29:47Z"
  },
  {
    "title": "Bernie Sanders fights apathy on American left",
    "description": "Bernie Sanders is emerging as one of the most vocal opponents to US President Donald Trump, with the 83-year-old senator drawing tens of thousands of people to his \"fighting oligarchy\" rallies around the country.Supporters packed the Gloria Molina Grand Park …",
    "link": "https://www.rawstory.com/bernie-rally/",
    "timestamp": "2025-04-13T11:28:31Z"
  },
  {
    "title": "Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Symbolic Link …",
    "link": "https://securityaffairs.com/176494/breaking-news/security-affairs-newsletter-round-519-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-04-13T11:23:40Z"
  },
  {
    "title": "Worry for Trump? Nate Silver reveals shocking approval ratings of US President since tariff announcement",
    "description": "Famed pollster Nate Silver has revealed that US President Donald Trump's approval ratings have taken a big hit ever since he announced tariffs on countries. Trump has, however, paused tariffs on all countries except China. Nate Silver has pointed recent sharp…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/worry-for-trump-nate-silver-reveals-shocking-approval-ratings-of-us-president-since-tariff-announcement/articleshow/120253881.cms",
    "timestamp": "2025-04-13T11:21:37Z"
  },
  {
    "title": "'All hands on deck': Democrats unleash new strategy to derail Trump",
    "description": "WASHINGTON — Democrats are getting their groove back. Or, at the very least, desperately trying to. \nAfter some party members faced heckling during recent town halls and even outright protests — including outside Senate Minority Leader Chuck Schumer’s Brookly…",
    "link": "https://www.rawstory.com/raw-investigates/town-halls-democrats/",
    "timestamp": "2025-04-13T11:18:58Z"
  },
  {
    "title": "At least 21 people killed in Russian attack on Ukrainian city",
    "description": "A Russian ballistic missile strike killed at least 31 people and injured more than 80 others in the Ukrainian city of Sumy on Sunday, according to Ukrainian President Volodymyr Zelenskyy, marking one of the deadliest single attacks on the country this year.",
    "link": "https://www.nbcnews.com/news/world/russia-attack-sumy-ukraine-dealiest-rcna201029",
    "timestamp": "2025-04-13T11:14:09Z"
  },
  {
    "title": "US-funded Arabic network ends broadcasts after Trump cuts",
    "description": "Alhurra, the Arabic-language network created by the US government after the Iraq invasion, said Saturday it would cease broadcasts and lay off most staff after President Donald Trump's administration shut off funds.The network went on air in 2004, when US off…",
    "link": "https://www.rawstory.com/alhurra-trump/",
    "timestamp": "2025-04-13T11:12:56Z"
  },
  {
    "title": "Farage says Elon Musk was 'trying to encourage' him with tweet calling for new Reform UK leader",
    "description": "Elon Musk and Nigel Farage have clashed over the former’s support for the jailed far-right activist Tommy Robinson.",
    "link": "https://www.thejournal.ie/nigel-farage-elon-musk-call-for-new-leader-6676900-Apr2025/",
    "timestamp": "2025-04-13T11:11:53Z"
  },
  {
    "title": "Thousands attend Sanders’ ‘fighting oligarchy’ rally in Los Angeles",
    "description": "US senator joined by AOC, who slams Trump’s ‘corrupt and disastrous tariff scheme’ as ploy to enrich corporate cronies.",
    "link": "https://www.aljazeera.com/news/2025/4/13/bernie-sanders-draws-tens-of-thousands-at-la-rally-to-fight-oligarchy",
    "timestamp": "2025-04-13T11:09:34Z"
  },
  {
    "title": "Donald Trump is the most powerful car bloke on the planet",
    "description": "Mike Rutherford wonders why many car companies remained quiet when Donald Trump announced sweeping tariffs",
    "link": "https://www.autoexpress.co.uk/opinion/366510/uk-worlds-best-building-and-shipping-expensive-cars-america",
    "timestamp": "2025-04-13T11:08:32Z"
  },
  {
    "title": "LDP's Moriyama will coordinate for extra budget to combat inflation",
    "description": "Regarding the size of a possible budget, Moriyama said, \"We would like (to compile it) without issuing deficit-covering bonds.\"",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/japan/politics/moriyama-extra-budget/",
    "timestamp": "2025-04-13T11:08:00Z"
  },
  {
    "title": "LDP's Moriyama says to coordinate for extra budget",
    "description": "Regarding the size of a possible budget, Moriyama said, \"We would like (to compile it) without issuing deficit-covering bonds.\"",
    "link": "https://www.japantimes.co.jp/news/2025/04/13/japan/politics/moriyama-to-coordinate-extra-budget/",
    "timestamp": "2025-04-13T11:08:00Z"
  },
  {
    "title": "Democrat mother confronts California lawmaker over trans athletes, says issue 'not partisan'",
    "description": "A Democrat mother says she was dismissed by a California lawmaker after raising concerns about transgender athletes competing in women’s sports.",
    "link": "https://www.foxnews.com/media/democrat-mother-confronts-california-lawmaker-over-trans-athletes-says-issue-not-partisan",
    "timestamp": "2025-04-13T11:00:11Z"
  },
  {
    "title": "As Trump's tariffs cause whiplash in stocks and bonds, what does Louisiana's delegation say?",
    "description": "President Donald Trump's tariffs have caused whiplash in the stock market and bond market. Here's what Louisiana's representatives and senators have said about it.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/what-louisianas-delegations-says-about-trump-tariffs/article_7fea14cc-1315-591d-8e70-c2ad7ea80c02.html",
    "timestamp": "2025-04-13T11:00:00Z"
  },
  {
    "title": "This Washington border county is desperate for Canadians",
    "description": "Anti-Trump boycotts are hurting businesses in Whatcom County, where the economy depends on cross-border spending by residents of British Columbia.",
    "link": "https://www.nbcnews.com/business/economy/whatcom-county-washington-canadians-trump-boycotts-rcna198234",
    "timestamp": "2025-04-13T11:00:00Z"
  },
  {
    "title": "Links 4/13/2025",
    "description": "Our strategic daily links: glyp breaking, sea slugs, biometric shopping, beer trays, Trumpomania, DOGEy moves, immigration troubles, AI everywhere, QR scams, and wretched excess",
    "link": "https://www.nakedcapitalism.com/2025/04/links-4-13-2025.html",
    "timestamp": "2025-04-13T10:55:54Z"
  },
  {
    "title": "Somaliland Offers Trump Red Sea Base in Exchange for Recognition",
    "description": "MOSCOW (Sputnik) - Somalia's breakaway region of Somaliland wants to be recognized as an independent state by US President Donald Trump in exchange for leasing its Berbera port and airstrip to the US, media reported on Saturday.",
    "link": "https://sputnikglobe.com/20250413/somaliland-offers-trump-red-sea-base-in-exchange-for-recognition-1121865164.html",
    "timestamp": "2025-04-13T10:51:21Z"
  },
  {
    "title": "Trump prosecutor to investigate blue state governor, AG over reported order to ignore ICE warrants (NJ)",
    "description": "President Donald Trump's longtime legal counsel and appointee as U.S. attorney for New Jersey announced Thursday she will launch a probe into Gov. Phil Murphy and Attorney General Matt Platkin over reports that state police were asked to ignore new immigratio…",
    "link": "https://freerepublic.com/focus/f-chat/4310723/posts",
    "timestamp": "2025-04-13T10:51:10Z"
  },
  {
    "title": "Russian strike on city centre in Ukraine's Sumy kills 21",
    "description": "<p>KYIV (UKRAINE) - A Russian ballistic missile attack on Ukraine's northeastern city of Sumy killed at least 21 people and wounded 83 on Palm Sunday, Kyiv said, in another deadly attack on civilians that came after a top US official travelled to Russia.</p>",
    "link": "https://www.bangkokpost.com/world/3002341/russian-strike-on-city-centre-in-ukraines-sumy-kills-21",
    "timestamp": "2025-04-13T10:45:00Z"
  },
  {
    "title": "Donald Trump reveals what will happen if countries don’t ‘make a deal for both parties’ on tariffs during 90-day pause",
    "description": "Donald Trump placed a 90-day pause on most of the tariffs for nearly every country",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-90-day-tariff-pause-china-435482-20250413",
    "timestamp": "2025-04-13T10:43:56Z"
  },
  {
    "title": "Trump says Ukraine-Russia talks 'going ok'",
    "description": "United States President Donald Trump said to reporters on Air Force One that he believes progress is being made in resolving the Ukraine conflict.\"I think that Ukraine-Russia might be going ok,\" Trump...",
    "link": "https://biztoc.com/x/951ee37a20826cbf",
    "timestamp": "2025-04-13T10:35:42Z"
  },
  {
    "title": "Iran says talks with US to focus solely on nuclear issue, lifting sanctions",
    "description": "Iran’s foreign ministry said Sunday that talks with the United States slated for next weekend will remain “indirect” with Omani mediation, and focused solely on the nuclear issue and lifting of sanctions.  Iranian Foreign Minister Abbas Araghchi and US Middle…",
    "link": "https://www.digitaljournal.com/world/iran-says-talks-with-us-to-focus-solely-on-nuclear-issue-lifting-sanctions/article",
    "timestamp": "2025-04-13T10:33:13Z"
  },
  {
    "title": "Iran Ready to Return to 2015 Nuclear Deal Enrichment Levels - But With Key Conditions for the US",
    "description": "MOSCOW (Sputnik) - Iran is ready to return to the levels of uranium enrichment envisaged by the 2015 nuclear deal, subject to certain conditions from the United States, the Wall Street Journal reported, citing Iranian and European officials.",
    "link": "https://sputnikglobe.com/20250413/iran-ready-to-return-to-2015-nuclear-deal-enrichment-levels---but-with-key-conditions-for-the-us-1121864990.html",
    "timestamp": "2025-04-13T10:32:22Z"
  },
  {
    "title": "Solana Triggers Long Thesis After Pushing Above $125 – Start Of A Bigger Rally?",
    "description": "Solana is trading above the $125 mark after bulls stepped in with force, reclaiming critical technical levels and bringing some relief to a market that had been dominated by selling pressure. After weeks of steep declines and heightened volatility, Solana is …",
    "link": "http://www.newsbtc.com/news/solana/solana-triggers-long-thesis-after-pushing-above-125-start-of-a-bigger-rally/",
    "timestamp": "2025-04-13T10:30:54Z"
  },
  {
    "title": "Iran Says Talks With US To Focus Solely On Nuclear Issue, Lifting Sanctions",
    "description": "Iran's foreign ministry said Sunday that talks with the United States slated for next weekend will remain \"indirect\" with Omani mediation, and focused solely on the nuclear issue and lifting of sanctions.",
    "link": "https://www.ibtimes.com/iran-says-talks-us-focus-solely-nuclear-issue-lifting-sanctions-3769883",
    "timestamp": "2025-04-13T10:30:21Z"
  },
  {
    "title": "Meet The Billionaire Whose European Real Estate Empire Caters To Brands Like Hyundai And H&M",
    "description": "Dutch billionaire Remon Vos moved to the Czech Republic in the 1990s and built an industrial real estate giant. Higher tariffs could make him even richer.",
    "link": "https://www.forbes.com/sites/giacomotognini/2025/04/13/meet-the-billionaire-whose-european-real-estate-empire-caters-to-brands-like-hyundai-and-hm/",
    "timestamp": "2025-04-13T10:30:00Z"
  },
  {
    "title": "Phones on, no vacation: China adopts wartime footing to counter Trump's tariff tantrums",
    "description": "China has adopted a wartime footing in response to Donald Trump's tariffs. Government officials are on high alert. They are also seeking international support against the US measures. Beijing is trying to establish communication channels with the Trump admini…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/phones-on-no-vacation-china-adopts-wartime-footing-to-counter-trumps-tariff-tantrums/articleshow/120253213.cms",
    "timestamp": "2025-04-13T10:29:37Z"
  },
  {
    "title": "Kremlin says instant results not possible after Trump demands Ukraine progress",
    "description": "This comes after President Trump told reporters that \"there’s a point at which you just have to either put up or shut up,\" in regards to the war in Ukraine.",
    "link": "https://www.jpost.com/breaking-news/article-849974",
    "timestamp": "2025-04-13T10:25:49Z"
  },
  {
    "title": "Russian strike on city centre in Ukraine’s Sumy kills 21",
    "description": "A Russian ballistic missile attack on Ukraine’s northeastern city of Sumy killed at least 21 people and wounded 83 on Palm Sunday, Kyiv said, in another deadly attack on civilians that came after a top US official travelled to Russia.   Sumy lies close to the…",
    "link": "https://www.digitaljournal.com/world/russian-strike-on-city-centre-in-ukraines-sumy-kills-21/article",
    "timestamp": "2025-04-13T10:25:40Z"
  },
  {
    "title": "Examining Russian and Chinese Military Operations in Venezuela",
    "description": "January 21, 2022 With inflation at a record high, millions of its citizens fleeing the country, and a political opposition recognized by most Western democracies as the legitimate government of Venezuela, the regime of Nicolás Maduro seemed to be on the brink…",
    "link": "https://freerepublic.com/focus/f-chat/4310721/posts",
    "timestamp": "2025-04-13T10:25:32Z"
  },
  {
    "title": "Kremlin says instant results not possible after Trump demands Ukraine progress",
    "description": "MOSCOW (Reuters) - The Kremlin said on Sunday contacts with U.S. President Donald Trump's team were moving ahead very well but that it was too early to expect instant results due to the level of damage done to relations under Trump's predecessor Joe Biden. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/13/kremlin-says-instant-results-not-possible-after-trump-demands-ukraine-progress",
    "timestamp": "2025-04-13T10:25:00Z"
  },
  {
    "title": "Thai govt urged to reconsider barriers on US imports",
    "description": "<p>CHIANG MAI: Former prime minister Thaksin Shinawatra said that he had been in contact with people close to US President Donald Trump to talk about <strong>tariff issues</strong> between Thailand and the United States.</p>",
    "link": "https://www.bangkokpost.com/business/general/3002327/thai-govt-urged-to-reconsider-barriers-on-us-imports",
    "timestamp": "2025-04-13T10:24:00Z"
  },
  {
    "title": "Kremlin says instant results not possible after Trump demands Ukraine progress",
    "description": "The Kremlin said on Sunday contacts with U.S. President Donald Trump's team were moving ahead very well but that it was too early to expect instant results...",
    "link": "https://uk.news.yahoo.com/kremlin-says-instant-results-not-102142231.html",
    "timestamp": "2025-04-13T10:21:42Z"
  },
  {
    "title": "'Bingo hopper or...': Jimmy Kimmel's scathing take on Trump's tariff madness as trade war with China escalates",
    "description": "Jimmy Kimmel criticized Donald Trump's escalating tariffs on Chinese imports, mocking the erratic increases from 20% to 145%. These tariffs, aimed at addressing unfair trade practices, could end the era of cheap consumer goods in the U.S. Experts warn of pote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/hes-working-a-bingo-hopper-or-jimmy-kimmel-roasts-president-trump-as-trade-war-with-china-escalates/articleshow/120253081.cms",
    "timestamp": "2025-04-13T10:16:43Z"
  },
  {
    "title": "Preparations are ongoing about Erdoğan, Trump meeting: Fidan",
    "description": "Foreign Minister Hakan Fidan said preparations are ongoing for a potential meeting between President Recep Tayyip Erdoğan and U.S. President Donald Trump, though the location and date have not yet been finalized.",
    "link": "https://www.hurriyetdailynews.com/preparations-are-ongoing-about-erdogan-trump-meeting-fidan-208004",
    "timestamp": "2025-04-13T10:15:47Z"
  },
  {
    "title": "Mayor of Ukraine's Sumy says over 20 dead from Russian missile strike",
    "description": "<p>KYIV &ndash; More than 20 people were killed by a Russian missile strike on the northern Ukrainian city of Sumy on Sunday, its acting mayor Artem Kobzar said.</p>",
    "link": "https://www.bangkokpost.com/world/3002317/mayor-of-ukraines-sumy-says-over-20-dead-from-russian-missile-strike",
    "timestamp": "2025-04-13T10:14:00Z"
  },
  {
    "title": "Faisal Islam: Trump's iPhone olive branch is a significant trade war retreat",
    "description": "Exempting electronics from US tariffs is a stunning about-turn by the Trump administration after 10 days of chaos.",
    "link": "https://www.bbc.com/news/articles/cde2z6jpzp8o",
    "timestamp": "2025-04-13T10:13:57Z"
  },
  {
    "title": "Russian Strike On City Centre In Ukraine's Sumy Kills 21",
    "description": "A Russian ballistic missile attack on Ukraine's northeastern city of Sumy killed at least 21 people and wounded 83 on Palm Sunday, Kyiv said, in another deadly attack on civilians that came after a top US official travelled to Russia.",
    "link": "https://www.ibtimes.com/russian-strike-city-centre-ukraines-sumy-kills-21-3769881",
    "timestamp": "2025-04-13T10:12:21Z"
  },
  {
    "title": "Analysis-Trump officials push immigrant gang message, but sometimes don't back it up in court",
    "description": "WASHINGTON (Reuters) -As U.S. President Donald Trump's administration cracks down on immigration, its officials have repeatedly publicly identified detainees as gang leaders or even terrorists, without attempting to back those inflammatory claims up in court.…",
    "link": "https://www.thestar.com.my/news/world/2025/04/13/analysis-trump-officials-push-immigrant-gang-message-but-sometimes-don039t-back-it-up-in-court",
    "timestamp": "2025-04-13T10:11:00Z"
  },
  {
    "title": "Boeing Tops Q1 Delivery Forecasts� But Faces New Threats",
    "description": "Aircraft Deliveries Could Be Stalled by Political and Supply Chain Pressures Boeing delivered 130 commercial jets in the first quarter of 2025, surpassing analyst expectations and marking a sharp rebound from the same period last year. The company also handed…",
    "link": "https://www.aero-news.net/index.cfm?do=main.textpost&id=72031C70-9F5B-4370-947E-3C2990A31959",
    "timestamp": "2025-04-13T10:05:00Z"
  },
  {
    "title": "How China went from courting Trump to ‘never yield’ tariff defiance",
    "description": "China has put civilian government officials in Beijing on “wartime footing” and ordered a diplomatic charm offensive aimed at encouraging other countries to ...",
    "link": "https://www.yahoo.com/news/china-went-courting-trump-never-100431206.html",
    "timestamp": "2025-04-13T10:04:31Z"
  },
  {
    "title": "21 Killed, Over 80 Wounded In Russian Missile Strike On Ukraine's Sumy",
    "description": "At least 21 people were killed and 83 others were wounded by a Russian ballistic missile strike in the heart of the northern Ukrainian city of Sumy on Sunday morning, Ukraine&#039;s interior minister Ihor Klymenko said.",
    "link": "https://www.ndtv.com/world-news/21-killed-over-80-wounded-in-russian-missile-strike-on-ukraines-sumy-8154331",
    "timestamp": "2025-04-13T10:04:01Z"
  },
  {
    "title": "Bitcoin jumps as Trump tariff shock rattles global markets",
    "description": "Global financial markets were rocked on Wednesday by Donald Trump’s announcement of sweeping tariffs, targeting China and the European Union in particular, with the risk of undermining the international economy. The US president laid out the new measures afte…",
    "link": "https://punchng.com/bitcoin-jumps-as-trump-tariff-shock-rattles-global-markets/",
    "timestamp": "2025-04-13T10:02:54Z"
  },
  {
    "title": "‘Democracy under fire’: My remarks at the London Press Conference on the Vanishing Right to Protest (11-4-2025) alongside Juliet Stevenson, Holocaust survivor Stephen Kapos, Jeremy Corbyn, Chris Nineham and Ben Jamal",
    "description": "We are here today because democracy is on death row, because the treasured right to dissent is at gunpoint, because your capacity to do journalism is under fire. I remember when I came to Britain as a student in 1978 how overjoyed I was to be in a country whe…",
    "link": "https://www.yanisvaroufakis.eu/2025/04/13/democracy-under-fire-my-remarks-at-the-london-press-conference-on-the-vanishing-right-to-protest-11-4-2025-alongside-juliet-stevenson-holocaust-survivor-stephen-kapos-jeremy-cor/",
    "timestamp": "2025-04-13T10:00:53Z"
  },
  {
    "title": "Trump’s drive against top universities could carry a big economic cost",
    "description": "President Donald Trump’s offensive against elite universities is also an assault on the nation’s most economically dynamic metropolitan areas — and a threat to America’s global competitiveness.",
    "link": "https://www.cnn.com/2025/04/13/politics/trump-universities-research-economy-nih-cuts/index.html",
    "timestamp": "2025-04-13T10:00:36Z"
  },
  {
    "title": "Democrats Are Fighting Trump’s Tariffs, And Each Other",
    "description": "Party members who allow space for tariffs when criticizing Trump's trade war have faced heavy criticism.",
    "link": "https://www.huffpost.com/entry/democrats-fighting-trumps-tariffs-each-other_n_67fa82f9e4b048c9d9597607",
    "timestamp": "2025-04-13T10:00:31Z"
  },
  {
    "title": "Mike Huckabee Is Both a MAGA Predecessor and Survivor",
    "description": "Newly confirmed extremist envoy to Israel Mike Huckabee anticipated Trump in national Republican politics in several important respects: as a populist, a messianic figure, and a nativist. Now he’s an ambassador and a MAGA dad.",
    "link": "http://nymag.com/intelligencer/article/mike-huckabee-israel-ambassador-maga-history.html",
    "timestamp": "2025-04-13T10:00:14Z"
  },
  {
    "title": "Moment Donald Trump brutally 'snubs' RFK Jr.'s wife Cheryl Hines at UFC 314 leaving her stunned",
    "description": "Curb Your Enthusiasm star Cheryl Hines was snubbed by President Donald Trump as she outstretched a hand to him at UFC 314, despite him greeting RFK Jr.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-snubs-rfk-jr-wife-cheryl-hines-ufc-314-viral-video-881759-20250413",
    "timestamp": "2025-04-13T10:00:13Z"
  },
  {
    "title": "How Trump’s advisors got tied up in knots over his tariff obsession",
    "description": "Rarely has the US seen such a spectacle of confusion over policy. Most of Trump’s team lost credibility, though Treasury Secretary Scott Bessent seemed to emerge as a voice of reason.",
    "link": "https://www.livemint.com/opinion/online-views/trump-tariffs-us-trade-policy-global-trade-war-trump-economic-strategy-tariff-market-impact-commerce-secretary-lutnick-11744372209612.html",
    "timestamp": "2025-04-13T10:00:10Z"
  },
  {
    "title": "Poll of Sask. voters has Conservatives maintaining strong support, but Liberals gaining ground",
    "description": "A Saskatchewan-specific poll of voters suggests Trump tariffs and leader favourability may be boosting Liberal fortunes in the province's two largest cities.",
    "link": "https://www.cbc.ca/news/canada/saskatchewan/federal-election-saskatchewan-poll-results-1.7508391",
    "timestamp": "2025-04-13T10:00:00Z"
  }
]