[
  {
    "title": "Ram Madhav writes: Trump isn’t making America great",
    "description": "The US President has overturned the foundational ideas of his country",
    "link": "https://indianexpress.com/article/opinion/columns/ram-madhav-writes-trump-isnt-making-america-great-10219410/",
    "timestamp": "2025-08-30T02:13:43Z"
  },
  {
    "title": "US court rules most of Trump's tariffs illegal",
    "description": "The decision marks a blow to the president, who has wielded duties as a wide-ranging economic policy tool.",
    "link": "https://www.thejournal.ie/us-court-rules-trumps-global-tariffs-illegal-6803420-Aug2025/",
    "timestamp": "2025-08-30T02:08:50Z"
  },
  {
    "title": "2028 Looks Like Trouble for Democrats — and Republicans Are Poised to Capitalize",
    "description": "Vance starts the 2028 race with advantages in the Rust Belt and Sun BeltAs we settle into the second Trump administration, eyes are already turning toward 2028. With President Donald Trump barred from a third elected term by the 22nd Amendment, the Republican…",
    "link": "https://freerepublic.com/focus/f-news/4337572/posts",
    "timestamp": "2025-08-30T02:08:48Z"
  },
  {
    "title": "Randy 'Duke' Cunningham, Vietnam War hero convicted of accepting bribes as a congressman, dies at 83",
    "description": "Randy “Duke” Cunningham, whose feats as a U.S. Navy flying ace during the Vietnam War catapulted him to a U",
    "link": "https://abcnews.go.com/US/wireStory/randy-duke-cunningham-vietnam-war-hero-convicted-accepting-125115035",
    "timestamp": "2025-08-30T02:06:25Z"
  },
  {
    "title": "Bondi: DoJ will appeal court's tariff decision",
    "description": "United States Attorney General Pam Bondi said that the Department of Justice (DoJ) will appeal the federal court of appeals decision declaring President Donald Trump's tariffs illegal.\"Trump found the...",
    "link": "https://biztoc.com/x/7394b142539f9d26",
    "timestamp": "2025-08-30T02:05:02Z"
  },
  {
    "title": "Federal judge blocks Trump's expanded deportation plan over due process concerns for illegal immigrants",
    "description": "U.S. District Judge Jia Cobb prevented the Trump administration from using fast-track deportations on immigrants with granted parole status in interior areas.",
    "link": "https://www.foxnews.com/politics/federal-judge-blocks-trumps-expanded-deportation-plan-due-process-concerns-illegal-immigrants",
    "timestamp": "2025-08-30T02:03:24Z"
  },
  {
    "title": "Bitcoin To Hit $1 Million? Eric Trump Shares Optimistic Outlook On Cryptocurrency",
    "description": "At the Bitcoin Asia conference in Hong Kong, Eric Trump, the son of President Donald Trump, predicted that the market’s leading cryptocurrency, Bitcoin (BTC) could soar to $1 million within the next few years, which could represent a major 825% increase from …",
    "link": "https://bitcoinist.com/bitcoin-to-hit-1-million-eric-trump-shares/",
    "timestamp": "2025-08-30T02:00:46Z"
  },
  {
    "title": "EPA fires employees who publicly criticized agency policies under Trump",
    "description": "The Environmental Protection Agency has fired at least eight employees who signed a letter criticizing the agency’s leadership under Administrator Lee Zeldin and President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/epa-fires-employees-publicly-criticized-agency-policies-trump-125114837",
    "timestamp": "2025-08-30T01:58:16Z"
  },
  {
    "title": "CNN’s Elie Honig Says Judge Could ‘Defer’ To Trump In Lisa Cook Case",
    "description": "Elie Honig said Friday that a federal judge may defer to President Donald Trump’s judgment in the controversy surrounding Lisa Cook’s real estate dealings.",
    "link": "https://dailycaller.com/2025/08/29/elie-honig-judge-defer-trump-lisa-cook-case/",
    "timestamp": "2025-08-30T01:52:02Z"
  },
  {
    "title": "South Korea and U.S. agree to discuss nuclear reprocessing, minister says",
    "description": "Changing an agreement on the issue would mark a major shift for the U.S., which has long sought to limit the number of countries with this capability.",
    "link": "https://www.japantimes.co.jp/news/2025/08/30/asia-pacific/south-korea-us-nuclear-reprocessing/",
    "timestamp": "2025-08-30T01:35:00Z"
  },
  {
    "title": "Bondi fires Justice Department employee for gesturing at National Guard",
    "description": "WASHINGTON (Reuters) -U.S. Attorney General Pam Bondi on Friday fired a Department of Justice official for making a vulgar gesture to members of the National...",
    "link": "https://ca.news.yahoo.com/bondi-fires-justice-department-employee-013418218.html",
    "timestamp": "2025-08-30T01:34:18Z"
  },
  {
    "title": "Most Trump tariffs illegal, US court rules",
    "description": "The tariffs have given the Trump administration leverage to extract economic concessions from trading partners but also increased volatility in...",
    "link": "https://www.odt.co.nz/business/most-trump-tariffs-illegal-us-court-rules",
    "timestamp": "2025-08-30T01:32:53Z"
  },
  {
    "title": "US appeals court rules Trump’s sweeping tariffs illegal, but keeps them in place for now",
    "description": "Trump denounced the ruling, warning of “financial ruin” if it stands, while his administration argued the levies were lawful and crucial for national security and trade leverage.",
    "link": "https://www.thehindubusinessline.com/news/world/us-appeals-court-rules-trumps-sweeping-tariffs-illegal-but-keeps-them-in-place-for-now/article69991950.ece",
    "timestamp": "2025-08-30T01:31:19Z"
  },
  {
    "title": "The headline of this week has been weeks in the making",
    "description": "Donald Trump made good on his threat to impose an additional 25% tariffs on India, taking the total levy to 50%—the steepest among the US's trading partners. Only Brazil comes close.&nbsp;",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-trade-tariffs-india-us-ties-narendra-modi-china-visit-sco-vladimir-putin-russia-ukraine-war-gaza-11756441715415.html",
    "timestamp": "2025-08-30T01:30:05Z"
  },
  {
    "title": "Claim Trump executive order aims to 'institutionalize anyone disabled' lacks key context",
    "description": "The order encourages forcible commitment of \"homeless individuals into long-term institutional settings for humane treatment.\"",
    "link": "https://www.snopes.com//fact-check/trump-institutionalize-disabled/",
    "timestamp": "2025-08-30T01:30:00Z"
  },
  {
    "title": "Trump withdraws Kamala Harris' Secret Service protection",
    "description": "The move comes just weeks before Harris is set to go on a tour to promote a new book about her failed presidential campaign against Trump last year.",
    "link": "https://www.japantimes.co.jp/news/2025/08/30/world/politics/trump-kamala-harris-secret-service/",
    "timestamp": "2025-08-30T01:29:00Z"
  },
  {
    "title": "Bolsonaro Coup Trial Enters Final Phase As Ally Trump Watches",
    "description": "Brazil's far-right former president Jair Bolsonaro will learn soon whether he is headed to prison as his trial on attempted coup charges enters the final stretch despite pressure from his US ally, President Donald Trump.",
    "link": "https://www.ibtimes.com/bolsonaro-coup-trial-enters-final-phase-ally-trump-watches-3781981",
    "timestamp": "2025-08-30T01:21:21Z"
  },
  {
    "title": "House Republican Says Melania Trump Should Be Considered for Peace Prize Because ‘She’s Been Very Instrumental’ in Russia Talks",
    "description": "Rep. Anna Paulina Luna said it is high time that First Lady Melania Trump be considered for the Nobel Peace Prize. \nThe post House Republican Says Melania Trump Should Be Considered for Peace Prize Because ‘She’s Been Very Instrumental’ in Russia Talks first …",
    "link": "https://www.mediaite.com/media/tv/house-republican-says-melania-trump-should-be-considered-for-peace-prize-because-shes-been-very-instrumental-in-russia-talks/",
    "timestamp": "2025-08-30T01:21:18Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products",
    "link": "https://abcnews.go.com/US/wireStory/trumps-tariffs-now-federal-appeals-court-knocked-125113276",
    "timestamp": "2025-08-30T01:18:28Z"
  },
  {
    "title": "Trump notifies Congress of plan to rescind billions in foreign aid",
    "description": "The maneuver challenges Congress’ spending powers and intensifies an already contentious battle over government funding, which is due to lapse Sept. 30.",
    "link": "https://www.japantimes.co.jp/news/2025/08/30/world/politics/trump-congress-foreign-aid/",
    "timestamp": "2025-08-30T01:18:00Z"
  },
  {
    "title": "Bolsonaro coup trial enters final phase as ally Trump watches",
    "description": "Brazil’s far-right former president Jair Bolsonaro will learn soon whether he is headed to prison as his trial on attempted coup charges enters the final stretch despite pressure from his US ally, President Donald Trump. On Tuesday, Brazil’s Supreme Court wil…",
    "link": "https://www.digitaljournal.com/world/bolsonaro-coup-trial-enters-final-phase-as-ally-trump-watches/article",
    "timestamp": "2025-08-30T01:17:20Z"
  },
  {
    "title": "Trump's new CDC chief: A Washington health insider with a libertarian streak",
    "description": "President Donald Trump has picked a former investor and critic of health regulations to oversee the Centers for Disease Control and Prevention.",
    "link": "https://www.news4jax.com/health/2025/08/29/trumps-new-cdc-chief-a-washington-health-insider-with-a-libertarian-streak/",
    "timestamp": "2025-08-30T01:16:50Z"
  },
  {
    "title": "Democratic Leaders Respond To Trump’s Hypocritical And Unconstitutional Ban On US Flag Burning",
    "description": "Earlier this week, President Donald Trump signed an executive order that would make it a criminal offense to burn the American flag, despite the fact that, in 1989, the U.S. Supreme Court ruled that burning the flag was protected speech under the First Amendm…",
    "link": "https://hiphopwired.com/2820083/democratic-leaders-respond-trump-ban-on-u-s-flag-burning/",
    "timestamp": "2025-08-30T01:15:43Z"
  },
  {
    "title": "Matt Towery Delivers Blunt News To GOP About Midterms And Advises Them How To Prepare",
    "description": "Matt Towery Republicans need to motivate voters to turn out in the 2026 midterm elections, as polls reportedly indicate a Democrat lead.",
    "link": "https://dailycaller.com/2025/08/29/matt-towery-delivers-blunt-news-gop-midterms-advises-prepare-democrats/",
    "timestamp": "2025-08-30T01:13:27Z"
  },
  {
    "title": "Former San Diego congressman and Navy Ace Randy 'Duke' Cunningham dies at 83",
    "description": "Cunningham served more than eight years in prison for accepting bribes before being released in 2013. President Donald Trump pardoned him in 2021.",
    "link": "https://www.kpbs.org/news/living/2025/08/29/former-san-diego-congressman-and-navy-ace-randy-duke-cunningham-dies-at-83",
    "timestamp": "2025-08-30T01:12:34Z"
  },
  {
    "title": "EPA fires employees who publicly criticized policies under Trump",
    "description": "The Environmental Protection Agency fired at least eight employees who criticized the agency's leadership under Administrator Lee Zeldin and President Donald Trump. EPA spokeswoman Molly Vaseliou stated the employees' declaration of dissent contained inaccura…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/epa-fires-employees-who-publicly-criticized-agency-policies-under-trump/articleshow/123593879.cms",
    "timestamp": "2025-08-30T01:11:45Z"
  },
  {
    "title": "What happens to Trump's tariffs now that a federal appeals court has knocked them down?",
    "description": "A federal appeals court has challenged President Trump's authority to unilaterally impose sweeping tariffs on foreign products by declaring national emergencies. The court's ruling limits Trump's ability to bypass Congress in trade policy, potentially impacti…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-happens-to-trumps-tariffs-now-that-a-federal-appeals-court-has-knocked-them-down/articleshow/123593853.cms",
    "timestamp": "2025-08-30T01:07:35Z"
  },
  {
    "title": "In NCLA Amicus Win, en Banc Federal Circuit Rules Trump’s Emergency Tariffs Are Unlawful",
    "description": "V.O.S. Selections, Inc.; Plastic Services and Products, LCC, d/b/a Genova Pipe; MicroKits, LCC; FishUSA Inc.; Terry Precision Cycling LLC v. President Donald J. Trump, et al. V.O.S. Selections, Inc.; Plastic Services and Products, LCC, d/b/a Genova Pipe; Micr…",
    "link": "https://www.globenewswire.com/news-release/2025/08/30/3141847/0/en/In-NCLA-Amicus-Win-en-Banc-Federal-Circuit-Rules-Trump-s-Emergency-Tariffs-Are-Unlawful.html",
    "timestamp": "2025-08-30T01:06:00Z"
  },
  {
    "title": "Trump ends security protection for former Vice President Kamala Harris",
    "description": "Donald Trump has cancelled Secret Service protection for Kamala Harris. Harris is Trump's Democratic rival in 2024. The protection was to last until January 2026. Joe Biden had extended it. Harris will start a 15-city book tour in September. Her memoir is abo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-ends-security-protection-for-former-vice-president-kamala-harris/articleshow/123593814.cms",
    "timestamp": "2025-08-30T01:03:31Z"
  },
  {
    "title": "Seeking more power, Trump uses firings to test presidential limits",
    "description": "The actions underscored Trump's desire for influence in sectors normally seen as independent from overt political control.",
    "link": "https://www.japantimes.co.jp/news/2025/08/30/world/politics/trump-firings-power-analysis/",
    "timestamp": "2025-08-30T01:03:00Z"
  },
  {
    "title": "Ex-ABC News Reporter Spells Out Why Disney Doesn't Want A 'Problem' With Trump",
    "description": "Terry Moran explained how network news is \"failing\" to meet the moment.",
    "link": "https://www.huffpost.com/entry/abc-news-terry-moran-disney-trump_n_68b22d56e4b072bf6d649df4",
    "timestamp": "2025-08-30T01:01:53Z"
  },
  {
    "title": "Zelenskyy wants higher-level talks on security guarantees",
    "description": "The call came as European Union defense ministers pledged to train Kyiv's troops on Ukrainian soil in the event of a truce.",
    "link": "https://www.japantimes.co.jp/news/2025/08/30/world/zelenskyy-talks-security-guarantees/",
    "timestamp": "2025-08-30T01:01:00Z"
  },
  {
    "title": "Appeals court rules against Trump tariffs, but Supreme Court appeal may soon follow",
    "description": "President Donald Trump holds up a chart during a \"Make America Wealthy Again\" trade announcement at the White House on April 2.",
    "link": "https://biztoc.com/x/88b72c6c39c9ee4c",
    "timestamp": "2025-08-30T00:57:25Z"
  },
  {
    "title": "Tether scraps plan to freeze USDT on five blockchains",
    "description": "Tether has scrapped its plan to discontinue USDT on five blockchains, however, the tokens will only be transferable, not issued or redeemed.",
    "link": "https://cointelegraph.com/news/tether-drops-plan-to-end-usdt-on-five-chains",
    "timestamp": "2025-08-30T00:54:36Z"
  },
  {
    "title": "Appeals court finds Trump's sweeping tariffs unconstitutional but leaves them in place for now",
    "description": "A US appeals court decided that President Donald Trump did not have the power to impose widespread tariffs. The court largely supported a previous decision. It stated Trump could not declare national emergencies to tax imports from almost every country. Howev…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/appeals-court-finds-trumps-sweeping-tariffs-unconstitutional-but-leaves-them-in-place-for-now/articleshow/123593730.cms",
    "timestamp": "2025-08-30T00:51:34Z"
  },
  {
    "title": "Op-Ed: Trump tariffs illegal but SCOTUS will probably support them. There’s a problem with that",
    "description": "\"Sic transit ingloria\". So goes the inglorious. \nThe post Op-Ed: Trump tariffs illegal but SCOTUS will probably support them. There’s a problem with that appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/business/op-ed-trump-tariffs-illegal-but-scotus-will-probably-support-them-theres-a-problem-with-that/article",
    "timestamp": "2025-08-30T00:48:34Z"
  },
  {
    "title": "Op-Ed: Trump tariffs illegal but SCOTUS will probably support them. There’s a problem with that.",
    "description": "\"Sic transit ingloria\". So goes the inglorious. \nThe post Op-Ed: Trump tariffs illegal but SCOTUS will probably support them. There’s a problem with that. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-trump-tariffs-illegal-but-scotus-will-probably-support-them-theres-a-problem-with-that/article",
    "timestamp": "2025-08-30T00:48:34Z"
  },
  {
    "title": "White House rips new Neil Young song slamming Trump's DC crime crackdown as 'cringe'",
    "description": "Rocker Neil Young's new anti-Trump song claims \"big crime\" exists at the White House, opposing the president's Washington, D.C., law enforcement measures.",
    "link": "https://www.foxnews.com/media/white-house-rips-new-neil-young-song-slamming-trumps-dc-crime-crackdown-cringe",
    "timestamp": "2025-08-30T00:47:33Z"
  },
  {
    "title": "CNN's Erin Burnett 'stunned' by Eric Trump's bold guess that could 'explode' dad's wealth",
    "description": "Eric Trump's eye-popping prediction for Bitcoin floored CNN anchor Erin Burnett on Friday evening, who warned if it comes true, President Donald Trump's wealth will \"explode.\"Eric Trump predicted Bitcoin would reach $1 million during his speech at the Bitcoin…",
    "link": "https://www.rawstory.com/eric-trump-2673942266/",
    "timestamp": "2025-08-30T00:44:15Z"
  },
  {
    "title": "US Appeals Court Finds President Trump’s Tariffs Illegal",
    "description": "The court said that Trump exceeded his authority, but that the tariffs will stay in place until a lower court determines how far-reaching the determination is.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/08/29/us-appeals-court-finds-president-trumps-tariffs-illegal/",
    "timestamp": "2025-08-30T00:42:05Z"
  },
  {
    "title": "Lawyer Alan Dershowitz loses appeal in CNN defamation case | CNN Business",
    "description": "Retired Harvard Law professor Alan Dershowitz lost his bid on Friday to overturn a ruling that dismissed his defamation lawsuit against CNN over the news channel’s coverage of remarks he made during President Donald Trump’s 2020 impeachment trial.",
    "link": "https://www.cnn.com/2025/08/29/business/alan-dershowitz-defamation-cnn",
    "timestamp": "2025-08-30T00:41:31Z"
  },
  {
    "title": "Bennet: 'Donald Trump Has Really Been a Wrecking Ball'",
    "description": "Senator Michael Bennet (D-CO) said Friday on MSNBC's \"All In\" that President Donald Trump is a \"wrecking ball\" when it comes to the economy and his tariff policy.\nThe post Bennet: ‘Donald Trump Has Really Been a Wrecking Ball’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/08/29/bennet-donald-trump-has-really-been-a-wrecking-ball/",
    "timestamp": "2025-08-30T00:40:09Z"
  },
  {
    "title": "Waters: Invoke the 25th Amendment — 'Something's Wrong' with Trump",
    "description": "Friday on MSNBC's \"The Weeknight,\" Rep. Maxine Waters (D-CA) said it was time for the cabinet to invoke the 25th Amendment to remove President Donald Trump.\nThe post Waters: Invoke the 25th Amendment — ‘Something’s Wrong’ with Trump appeared first on Breitbar…",
    "link": "https://www.breitbart.com/clips/2025/08/29/waters-invoke-the-25th-amendment-somethings-wrong-with-trump/",
    "timestamp": "2025-08-30T00:38:48Z"
  },
  {
    "title": "Appeals court rules against Trump tariffs, but Supreme Court appeal may soon follow",
    "description": "The Federal Circuit's ruling won't immediately take effect, giving the administration time to seek Supreme Court review.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-tariffs-appeals-court-rules-against-rcna228136",
    "timestamp": "2025-08-30T00:38:38Z"
  },
  {
    "title": "Pope Leo Tells Catholic Politicians: You Can’t be Catholic and Pro-Abortion",
    "description": "Pope Leo XIV has issued a clarion call to Catholic politicians worldwide, urging them to align their actions with the Church’s teachings on the sanctity of life. This new message follows on the heels of a recent pro-life message where the Pope emphasized the …",
    "link": "https://freerepublic.com/focus/f-religion/4337558/posts",
    "timestamp": "2025-08-30T00:36:42Z"
  },
  {
    "title": "Missouri redistricting: Kansas City mayor slams map, says city will fight it",
    "description": "Kansas City Mayor Quinton Lucas criticized a newly proposed congressional map for the state, saying it would diminish Kansas City's voice.",
    "link": "https://www.kmbc.com/article/lucas-denounces-trump-kehoe-missouri-redistricting-map/65936772",
    "timestamp": "2025-08-30T00:32:00Z"
  },
  {
    "title": "Trump cuts billions more in approved US foreign aid",
    "description": "US President Donald Trump has bypassed Congress to cut nearly $5 billion in funding earmarked for international aid. The move could spark a fight over who truly holds the power of the purse in the United States.",
    "link": "https://www.dw.com/en/trump-cuts-billions-more-in-approved-us-foreign-aid/a-73817138",
    "timestamp": "2025-08-30T00:32:00Z"
  },
  {
    "title": "India warms to Chinese investment in manufacturing, renewables and auto parts amid US tariff pressures",
    "description": "India plans to ease Covid-era curbs on Chinese FDI, allowing 20-25% investments in manufacturing, renewable energy, and auto components through the automatic route, while keeping strategic sectors off-limits.",
    "link": "https://www.livemint.com/industry/india-press-note-3-eases-china-fdi-11756467547288.html",
    "timestamp": "2025-08-30T00:30:20Z"
  },
  {
    "title": "Newsom: Trump loses 'big time' in court",
    "description": "California Governor Gavin Newsom commented on the recent court ruling that found United States President Donald Trump's reciprocal tariffs unlawful, declaring the president has lost \"big time in court...",
    "link": "https://biztoc.com/x/f24e7bfa971f5aa7",
    "timestamp": "2025-08-30T00:23:53Z"
  },
  {
    "title": "Appeals court blocks Trump administration from ending legal protections for 600,000 Venezuelans",
    "description": "A federal appeals court on Friday blocked President Donald Trump's plans to end protections for 600,000 people from Venezuela who have had permission to live and work in the United States, saying that plaintiffs are likely to win their claim that the Republic…",
    "link": "https://japantoday.com/category/world/appeals-court-blocks-trump-administration-from-ending-legal-protections-for-600-000-venezuelans1",
    "timestamp": "2025-08-30T00:23:41Z"
  },
  {
    "title": "Court finds Trump's tariffs an illegal use of emergency power, but leaves them in place for now",
    "description": "A federal appeals court ruled Friday that President Donald Trump had no legal right to impose sweeping tariffs on almost every country on earth but left in place for now his effort to build a protectionist wall around the American economy. The ruling from U.S…",
    "link": "https://japantoday.com/category/world/appeals-court-finds-trump%27s-tariffs-illegally-used-emergency-power-but-leaves-them-in-place-for-now",
    "timestamp": "2025-08-30T00:21:48Z"
  },
  {
    "title": "Johnson pins gun violence on 'mental health' as Trump slashes $1 billion in school counseling - NewsBreak",
    "description": "Speaker of the House Mike Johnson is criticizing prominent voices on the left who denounced Republicans for urging prayer but taking no action on gun viole",
    "link": "https://www.newsbreak.com/share/4204089886922-johnson-pins-gun-violence-on-mental-health-as-trump-slashes-1-billion-in-school-counseling?s=a2&amp;share_destination_id=MjkyMjEzNDQzLTE3NTY1MTMyMjczNzI%3D&amp;pd=0Jm643A4&amp;hl=en_US&amp;send_time=1756513227&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v1",
    "timestamp": "2025-08-30T00:21:04Z"
  },
  {
    "title": "Most Trump tariffs are not legal, US appeals court rules",
    "description": "NEW YORK:  A divided U.S. appeals court ruled on Friday that most of Donald Trump's tariffs are illegal, undercutting the Republican president's use of the levies as a key international economic policy tool. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/30/most-trump-tariffs-are-not-legal-us-appeals-court-rules",
    "timestamp": "2025-08-30T00:21:00Z"
  },
  {
    "title": "Wasserman Schultz: Trump Will 'Tank the Dollar' by Eliminating Fed's Independence",
    "description": "On Friday, on MSNBC's \"The Weeknight,\" Rep. Debbie Wasserman Schultz (D-FL) said that President Donald Trump would \"tank the dollar\" if he eliminates the independence of the Federal Reserve.\nThe post Wasserman Schultz: Trump Will ‘Tank the Dollar’ by Eliminat…",
    "link": "https://www.breitbart.com/clips/2025/08/29/wasserman-schultz-trump-will-tank-the-dollar-by-eliminating-feds-independence/",
    "timestamp": "2025-08-30T00:20:44Z"
  },
  {
    "title": "US appeals court finds Trump's global tariffs illegal",
    "description": "A US appeals court yesterday ruled that many of President Donald Trump's tariffs, which have upended global trade, were illegal - but allowed them to remain in place for now, giving him time to take the fight to the Supreme Court.",
    "link": "https://www.rte.ie/news/2025/0830/1530912-us/",
    "timestamp": "2025-08-30T00:18:22Z"
  },
  {
    "title": "Wendy Williams doesn’t want to return to TV as a host, but could go on speaking tour to expose ‘abusive’ guardianship system",
    "description": "\"If there's one thing Wendy knows how to do, it's talk,\" said a source of the star.",
    "link": "https://pagesix.com/2025/08/29/celebrity-news/wendy-williams-lawyer-joe-tacopina-says-she-wants-to-expose-abusive-guardianship-industry/",
    "timestamp": "2025-08-30T00:15:09Z"
  },
  {
    "title": "Trump to get hit with nearly 1K protests in fight for 'soul of our nation'",
    "description": "Unions and progressive organizations are planning nearly 1,000 \"Workers Over Billionaires\" demonstrations across the United States this Labor Day to protest President Donald Trump's assault on workers' rights.The day of national action has been organized by t…",
    "link": "https://www.rawstory.com/trump-protests-2673942230/",
    "timestamp": "2025-08-30T00:15:02Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products.",
    "link": "https://www.ksat.com/news/politics/2025/08/29/what-happens-to-trumps-tariffs-now-that-a-federal-appeals-court-has-knocked-them-down/",
    "timestamp": "2025-08-30T00:07:55Z"
  },
  {
    "title": "Venezuelan migrants in Guantanamo subjected to isolation, poor hygiene and stale food, HRW says | CNN",
    "description": "Migrants sent by the United States to the Guantanamo Bay naval base in Cuba earlier this year faced “abusive and inhumane detention conditions” that seriously affected their health and even led to suicide attempts, according to a new report by Human Rights Wa…",
    "link": "https://www.cnn.com/2025/08/29/americas/guantanamo-venezuela-migrants-detained-hrw-intl-latam",
    "timestamp": "2025-08-30T00:05:49Z"
  },
  {
    "title": "Congressman Reveals Epstein Estate Will Hand Over Book Containing Trump Birthday Message",
    "description": "Rep. Robert Garcia broke some news on Friday's 'All In' on MSNBC.\nThe post Congressman Reveals Epstein Estate Will Hand Over Book Containing Trump Birthday Message first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/congressman-reveals-epstein-estate-will-hand-over-book-containing-trump-birthday-message/",
    "timestamp": "2025-08-30T00:03:19Z"
  },
  {
    "title": "US Will Deny Visas to Top Palestinian Leaders Before UN Meeting",
    "description": "The Trump administration said it will deny visas to Palestinian Authority President Mahmoud Abbas and 80 other Palestinian officials in a move that will likely make it impossible for them to attend next month’s meeting of the UN General Assembly.",
    "link": "https://financialpost.com/pmn/business-pmn/us-will-deny-visas-to-top-palestinian-leaders-before-un-meeting",
    "timestamp": "2025-08-30T00:00:18Z"
  },
  {
    "title": "Alert the media: The White House is lying about Trump's health - NewsBreak",
    "description": "PN is supported by paid subscribers. Become one. Donald Trump held a bonkers press conference last Friday during which he lied about his authoritarian oc",
    "link": "https://www.newsbreak.com/share/4203592035776-alert-the-media-the-white-house-is-lying-about-trump-s-health?s=a2&amp;share_destination_id=ODg1MTU1ODEtMTc1NjUxMTk3MTAwNA%3D%3D&amp;pd=05zOwfH7&amp;hl=en_US&amp;send_time=1756511971&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.34.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_android_comment_share_v3-v3",
    "timestamp": "2025-08-29T23:59:57Z"
  },
  {
    "title": "Missouri Is Next To Answer Trump's Call For Redrawn Maps Ahead Of Midterms",
    "description": "Democrats swiftly expressed outrage as Missouri's House Minority Leader Ashley Aune calling Gov. Mike Kehoe a “Trump puppet” looking to steal a congressional seat for the GOP.",
    "link": "https://www.huffpost.com/entry/missouri-redistricting-redrawing-congressional-maps-republicans-2026-midterms_n_68b23b36e4b072bf6d64a24d",
    "timestamp": "2025-08-29T23:58:29Z"
  },
  {
    "title": "Appeals Court Rules Trump’s Sweeping Global Tariffs Are Illegal",
    "description": "The U.S. Court of Appeals for the Federal Circuit has upheld a lower court's ruling that the law President Donald Trump has been using to enact his widespread tariff policy does not actually grant him that power, setting up a final appeal to the Supreme Court…",
    "link": "https://petapixel.com/2025/08/29/appeals-court-rules-trumps-sweeping-global-tariffs-are-illegal/",
    "timestamp": "2025-08-29T23:57:20Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products.  Now a federal...",
    "link": "https://finance.yahoo.com/news/happens-trump-tariffs-now-federal-235505485.html",
    "timestamp": "2025-08-29T23:55:05Z"
  },
  {
    "title": "What happens to Trump’s tariffs now that a federal appeals court has knocked them down?",
    "description": "President Donald Trump has audaciously claimed virtually unlimited power to bypass Congress and impose sweeping taxes on foreign products.  Now a federal...",
    "link": "https://www.yahoo.com/news/articles/happens-trump-tariffs-now-federal-235505076.html",
    "timestamp": "2025-08-29T23:55:05Z"
  },
  {
    "title": "US court rules many of Trump's global tariffs are illegal - BBC",
    "description": "US court rules many of Trump's global tariffs are illegalBBC Appeals court strikes down many Trump tariffs, saying he overstepped his authorityCNN Gavin Newsom mocks Donald Trump after tariff plan struck downNewsweek Appeals court invalidates many of Trump's …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178937472",
    "timestamp": "2025-08-29T23:52:37Z"
  },
  {
    "title": "Court finds Trump’s tariffs an illegal use of emergency power, but leaves them in place for now",
    "description": "A federal appeals court ruled Friday that President Donald Trump had no legal right to impose sweeping tariffs on almost every country on earth but left in place for now his effort to build a protectionist wall around the American economy.\nThe U.S. Court of A…",
    "link": "https://biztoc.com/x/94dd7584b0cf8717",
    "timestamp": "2025-08-29T23:49:53Z"
  },
  {
    "title": "'Holy tariff mess, Batman!' Nobel-winner Paul Krugman 'shocked' by​ Trump's tariff blow",
    "description": "President Donald Trump's tariff battle suffered a major defeat Friday when a federal appeals court ruled that his most extensive tariffs were illegal, saying he overstepped his authority. And Nobel Prize-winning economist Paul Krugman expressed \"shock.\"The co…",
    "link": "https://www.rawstory.com/paul-krugman-2673942202/",
    "timestamp": "2025-08-29T23:44:27Z"
  },
  {
    "title": "A conservative Wisconsin Supreme Court justice won’t run again, creating an open seat",
    "description": "The open race is to be decided in April.",
    "link": "https://www.bostonherald.com/2025/08/29/wisconsin-supreme-court-open-seat/",
    "timestamp": "2025-08-29T23:42:50Z"
  },
  {
    "title": "A conservative Wisconsin Supreme Court justice won’t run again, creating an open seat",
    "description": "The open race is to be decided in April.",
    "link": "https://www.denverpost.com/2025/08/29/wisconsin-supreme-court-open-seat/",
    "timestamp": "2025-08-29T23:42:50Z"
  },
  {
    "title": "Gavin Newsom Mocks Trump After Tariff Plan Struck Down",
    "description": "The rebuke comes as Newsom has taken aim at Republicans' redistricting efforts and Trump's implementation of national guard troops in U.S. cities.",
    "link": "https://www.newsweek.com/gavin-newsom-mocks-donald-trump-tariff-plan-struck-down-2121980",
    "timestamp": "2025-08-29T23:41:11Z"
  },
  {
    "title": "RFK Jr. is a shaky leader for much-needed public-health reform",
    "description": "While the lefty ideology that drove insane COVID vaccine policy needs to be purged, Health and Human Services Secretary Robert F. Kennedy Jr. is proving himself to be the wrong man for the job.",
    "link": "https://nypost.com/2025/08/29/opinion/rfk-jr-is-a-shaky-leader-for-much-needed-public-health-reform/",
    "timestamp": "2025-08-29T23:40:46Z"
  },
  {
    "title": "Breitbart Business Digest: How the Fed Destroyed Its Own Independence",
    "description": "This week saw a series of unprecedented events that may signal the end of the form of central bank independence as we have known it for more than a century.\nThe post Breitbart Business Digest: How the Fed Destroyed Its Own Independence appeared first on Breit…",
    "link": "https://www.breitbart.com/economy/2025/08/29/breitbart-business-digest-how-the-fed-destroyed-its-own-independence/",
    "timestamp": "2025-08-29T23:40:17Z"
  },
  {
    "title": "Trump's rebuke, Xi's handshake, Putin's oil: India's foreign policy test",
    "description": "India’s foreign policy sits uneasily in the Trump-led order, caught between Russia and strained US relations.",
    "link": "https://www.bbc.com/news/articles/c80d2nvzg72o",
    "timestamp": "2025-08-29T23:38:20Z"
  },
  {
    "title": "White House defends Robert F Kennedy Jr amid CDC turmoil",
    "description": "The Centers for Disease Control had several top officials depart recently, leading to calls for the health secretary's resignation.",
    "link": "https://www.bbc.com/news/articles/cedv3gg3x6xo",
    "timestamp": "2025-08-29T23:37:32Z"
  },
  {
    "title": "JD Vance Accuses Politico of 'Journalistic Malpractice' Over New Report: 'It's a Foreign Influence Operation'",
    "description": "\"Two possible explanations: Felicia is just not very smart, and allowed herself to be used by deep state con men. Or she's in on it.\"",
    "link": "https://www.westernjournal.com/jd-vance-accuses-politico-journalistic-malpractice-new-report-foreign-influence-operation/",
    "timestamp": "2025-08-29T23:37:01Z"
  },
  {
    "title": "Open borders and welfare bloat have Europe at the brink of disaster: Will it shift course?",
    "description": "Europe's open borders and leftward tilt has become unsustainable, sparking crime, budget crises and defense challenges. Will it shift course to stave off disaster?",
    "link": "https://nypost.com/2025/08/29/opinion/europes-open-borders-welfare-largess-has-it-facing-disaster-will-it-shift-course/",
    "timestamp": "2025-08-29T23:36:10Z"
  },
  {
    "title": "Trump Lashes Out at ‘Highly Partisan’ Court That Just Ruled His Tariffs Illegal",
    "description": "President Donald Trump slammed a federal court on Friday after it ruled that most of his tariffs are illegal.\nThe post Trump Lashes Out at ‘Highly Partisan’ Court That Just Ruled His Tariffs Illegal first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-lashes-out-at-highly-partisan-court-that-just-ruled-his-tariffs-illegal/",
    "timestamp": "2025-08-29T23:33:40Z"
  },
  {
    "title": "VP Vance: Ready to lead if needed, but President Trump remains in ‘Excellent health’",
    "description": "When asked about President Donald Trump’s health during an interview, Vice President JD Vance affirmed that the president remains in “incredibly good health,” though he emphasized that he stands ready to assume the responsibilities of presidential leadership …",
    "link": "https://www.oann.com/newsroom/vp-vance-ready-to-lead-if-needed-but-president-trump-remains-in-excellent-health/",
    "timestamp": "2025-08-29T23:32:20Z"
  },
  {
    "title": "JD Vance just said the 'quiet part out loud' in Trump's escalating feud: analyst",
    "description": "Vice President JD Vance just said the \"quiet part out loud\" when it comes to President Donald Trump's attack on the Federal Reserve.Trump has repeatedly attacked the Fed, including unprecedented moves such as firing Fed Governor Lisa Cook over unproven allega…",
    "link": "https://www.rawstory.com/jd-vance-2673942180/",
    "timestamp": "2025-08-29T23:30:03Z"
  },
  {
    "title": "Federal Appeals Court Says Trump's Tariffs Are Unlawful, Allows Them To Remain in Place",
    "description": "President Donald Trump overstepped the limits of executive authority when he used emergency powers to levy tariffs, a federal appeals court ruled on Friday.\nThat decision, from the U.S. Court of Appeals for the Federal Circuit, is the latest in a string of le…",
    "link": "https://biztoc.com/x/6c64883f23074f4b",
    "timestamp": "2025-08-29T23:27:55Z"
  },
  {
    "title": "Most of Donald Trump's tariffs illegal, US court rules",
    "description": "But the US president says the ruling is \"incorrect\", and is indicating taking the case to the Supreme Court.",
    "link": "https://www.abc.net.au/news/2025-08-30/trump-tariffs-illegal/105715692",
    "timestamp": "2025-08-29T23:23:01Z"
  },
  {
    "title": "Federal Appeals Court Says Trump's Tariffs Are Unlawful, Allows Them To Remain in Place",
    "description": "Trump went \"beyond the authority delegated to the President,\" the court ruled, but it vacated an injunction that could have provided immediate tariff relief to American businesses.",
    "link": "https://reason.com/2025/08/29/federal-appeals-court-says-trumps-tariffs-are-unlawful-allows-them-to-remain-in-place/",
    "timestamp": "2025-08-29T23:19:16Z"
  },
  {
    "title": "RINO Sen. Lisa Murkowski to Face Primary Challenge from Governor Mike Dunleavy in 2028",
    "description": "Alaska’s swamp-friendly Senator Lisa Murkowski may finally be facing the reckoning that conservatives have been demanding for years.\nThe post RINO Sen. Lisa Murkowski to Face Primary Challenge from Governor Mike Dunleavy in 2028 appeared first on The Gateway …",
    "link": "https://www.thegatewaypundit.com/2025/08/rino-sen-lisa-murkowski-face-primary-challenge-governor/",
    "timestamp": "2025-08-29T23:15:40Z"
  },
  {
    "title": "Alert the media: The White House is lying about Trump's health - NewsBreak",
    "description": "PN is supported by paid subscribers. Become one. Donald Trump held a bonkers press conference last Friday during which he lied about his authoritarian oc",
    "link": "https://www.newsbreak.com/share/4203592035776-alert-the-media-the-white-house-is-lying-about-trump-s-health?_f=app_share&amp;pd=05bDv0Of&amp;lang=en_US&amp;send_time=1756509198&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.1.10%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button-v2&amp;s=i2",
    "timestamp": "2025-08-29T23:13:51Z"
  },
  {
    "title": "Trump administration cancels $679 million in funding for offshore wind projects",
    "description": "The Transportation Department on Friday canceled $679 million in federal funding for a dozen offshore wind projects, the latest attack by the Trump administration on the reeling U.S. offshore wind industry.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-cancels-679-million-in-funding-for-offshore-wind-projects",
    "timestamp": "2025-08-29T23:12:51Z"
  },
  {
    "title": "Lisa Cook and the fight for the Fed",
    "description": "The Federal Reserve has been under intense pressure from President Donald Trump as he pushes for more control over the historically independent agency. The Fed is tasked with keeping inflation and unemployment under control, and it’s supposed to be insulated …",
    "link": "https://www.npr.org/2025/08/29/nx-s1-5522330/lisa-cook-trump-lawsuit-federal-reserve-independence",
    "timestamp": "2025-08-29T23:12:17Z"
  },
  {
    "title": "Social Security Whistleblower Quits, Cites 'Potentially Unlawful' Data Practices",
    "description": "Charles Borges, Social Security's chief data officer, says the agency retaliated against him for exposing sketchy handling of Americans' private information.",
    "link": "https://www.huffpost.com/entry/social-security-whistleblower-charles-borges_n_68b21768e4b0733c061a8262",
    "timestamp": "2025-08-29T23:11:30Z"
  },
  {
    "title": "Missouri GOP under fire for 'rigging the game’ rather than face voter 'consequences'",
    "description": "Democracy defenders on Friday blasted elected Texas Republicans, including Gov. Greg Abbott, after he signed a new congressional map gerrymandered for the GOP at the request of President Donald Trump—and Missouri Gov. Mike Kehoe, for launching a copycat effor…",
    "link": "https://www.rawstory.com/missouri-republicans-2673942142/",
    "timestamp": "2025-08-29T23:09:21Z"
  },
  {
    "title": "US court rules many of Trump's global tariffs are illegal",
    "description": "The tariffs can remain in place until mid-October to allow the Trump administration time to request the Supreme Court take up the case.",
    "link": "https://www.bbc.com/news/articles/ckgj7jxkq58o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-08-29T23:06:42Z"
  },
  {
    "title": "Most of Trump’s tariffs are illegal, federal court rules",
    "description": "Supreme court will now have to rule on issue of if president overstepped his authority in upending trade policy\nDonald Trump overstepped his presidential powers with most of his globe-rattling tariff policies, a federal appeals court in Washington DC ruled on…",
    "link": "https://biztoc.com/x/8079b457ddf8a433",
    "timestamp": "2025-08-29T23:05:20Z"
  },
  {
    "title": "RFK Jr. uses Minneapolis church shooting to push his latest health initiative - NewsBreak",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. appeared to suggest without any evidence that antidepressant medication might have played a role",
    "link": "https://www.newsbreak.com/share/4202483511015-rfk-jr-uses-minneapolis-church-shooting-to-push-his-latest-health-initiative?_f=app_share&amp;pd=0KnnffVr&amp;lang=en_US&amp;send_time=1756508619&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.34.0.35%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_ios_comment_share_v2-v3%2Csc_play_button-v2&amp;s=i2",
    "timestamp": "2025-08-29T23:04:47Z"
  },
  {
    "title": "Trump, Witkoff and the Art of the Peace Deal | If You're Listening",
    "description": "It's no secret that Donald Trump has his sights set on a Nobel Peace Prize. He already claims to have brokered peace in a number ...",
    "link": "https://biztoc.com/x/f39d59ed1f22fd2e",
    "timestamp": "2025-08-29T23:04:30Z"
  }
]