[
  {
    "title": "Trump says he could impose tariffs on countries that oppose his goal of acquiring Greenland (Rebecca Shabad/NBC News)",
    "description": "Rebecca Shabad / NBC News:\nTrump says he could impose tariffs on countries that oppose his goal of acquiring Greenland  —  Officials from Greenland and Denmark, which controls the semi-autonomous territory, as well as a host of major U.S. allies, have rejecte…",
    "link": "https://www.memeorandum.com/260116/p86",
    "timestamp": "2026-01-16T19:55:01Z"
  },
  {
    "title": "Extreme makeovers: Federal Reserve vs. White House renovations (Dareh Gregorian/NBC News)",
    "description": "Dareh Gregorian / NBC News:\nExtreme makeovers: Federal Reserve vs. White House renovations  —  Both President Donald Trump and Federal Reserve Chair Jerome Powell are involved in controversial — and costly — rehabs of government buildings.  — Add NBC News to …",
    "link": "https://www.memeorandum.com/260116/p87",
    "timestamp": "2026-01-16T19:55:01Z"
  },
  {
    "title": "Putin talks to Iranian president",
    "description": "Russian President Vladimir Putin has phoned his Iranian counterpart, Masoud Pezeshkian, amid mass protests in the Islamic Republic Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/631055-putin-iran-president-phone-call-protests/",
    "timestamp": "2026-01-16T19:54:09Z"
  },
  {
    "title": "Omar, Minneapolis mayor accuse Trump admin of unleashing 'political retribution,' 'invasion' with ICE activity",
    "description": "Democrats are speaking out Friday against the Trump administration's immigration enforcement activity in Minnesota following the shooting of Renee Nicole Good.",
    "link": "https://www.foxnews.com/politics/omar-minneapolis-mayor-accuse-trump-admin-unleashing-political-retribution-invasion-ice-activity",
    "timestamp": "2026-01-16T19:53:58Z"
  },
  {
    "title": "White House economic advisor floats idea of 'Trump cards’ amid credit card battle with banks - CNBC",
    "description": "White House economic advisor floats idea of 'Trump cards’ amid credit card battle with banksCNBC Trump’s affordability pledge strikes directly at the heart of Wall Street’s profit engineCNN Anthony Scaramucci thinks Trump's 'hard-left' move to cap credit-card…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180602212",
    "timestamp": "2026-01-16T19:52:45Z"
  },
  {
    "title": "Trump Threatens Tariffs on Any Nation That Opposes US Efforts to Conquer Greenland",
    "description": "President Donald Trump on Friday suggested that he would expand his legally contested and costly tariff regime to target any countries that don't support his plan to conquer Greenland, a self-governing Danish territory opposed to a US takeover. While he was s…",
    "link": "https://www.commondreams.org/news/trump-greenland-tariffs",
    "timestamp": "2026-01-16T19:52:22Z"
  },
  {
    "title": "US says Canada will regret decision to allow Chinese EVs into their market",
    "description": "US comments came in response to deal by Canada PM Carney to allow 49,000 EVs into Canada at 15% tariff, down from 100%.",
    "link": "https://www.aljazeera.com/economy/2026/1/16/us-says-canada-will-regret-decision-to-allow-chinese-evs-into-their-market",
    "timestamp": "2026-01-16T19:51:13Z"
  },
  {
    "title": "Legendary basketball coach Bruce Pearl slams anti-Israel college protesters going silent on Iran",
    "description": "On the \"Ruthless\" podcast, former Auburn Tigers basketball coach Bruce Pearl slammed college protesters for going silent on the unrest in Iran after expressing outrage towards Israel.",
    "link": "https://www.foxnews.com/media/legendary-basketball-coach-bruce-pearl-slams-anti-israel-college-protesters-going-silent-iran",
    "timestamp": "2026-01-16T19:50:58Z"
  },
  {
    "title": "Jerome Powell’s Thankless Rescue of Trump",
    "description": "The Fed chair has saved Trump from his worst instincts but failed to do so for Biden.",
    "link": "https://www.theatlantic.com/ideas/2026/01/jerome-powell-fed-trump-thankless/685653/",
    "timestamp": "2026-01-16T19:50:54Z"
  },
  {
    "title": "Arizona Senator Shares Harshest Criticism Yet of Trump's Greenland Aspirations: 'Being an Idiot'",
    "description": "Arizona Sen. Ruben Gallego slammed President Donald Trump over his push to take over Greenland, saying it has \"nothing to do with actual security concerns.\"",
    "link": "https://www.ibtimes.com/arizona-senator-shares-harshest-criticism-yet-trumps-greenland-aspirations-being-idiot-3795550",
    "timestamp": "2026-01-16T19:50:21Z"
  },
  {
    "title": "US officials provide shifting accounts of ICE detainee death in Texas military camp",
    "description": "WASHINGTON, Jan 16 (Reuters) - U.S. immigration ‌officials on Friday provided a new but incomplete account of an immigrant detainee's death in Texas ‌after a report emerged suggesting it may have been homicide. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/17/us-officials-provide-shifting-accounts-of-ice-detainee-death-in-texas-military-camp",
    "timestamp": "2026-01-16T19:48:00Z"
  },
  {
    "title": "Blue state takes big step to pass revenge map against Trump-backed election-rigging scheme",
    "description": "Democrats in Virginia just took a big step in their plan to retaliate against mid-decade Republican gerrymanders enacted last year on President Donald Trump's orders.According to Politico, \"The Democrat-dominated Virginia Senate passed a constitutional amendm…",
    "link": "https://www.rawstory.com/virginia-gerrymandering-2674902808/",
    "timestamp": "2026-01-16T19:47:56Z"
  },
  {
    "title": "Trump’s Fateful Choice in Iran",
    "description": "Taking military action is risky. Falsely encouraging freedom fighters would be shameful.",
    "link": "https://www.theatlantic.com/international/2026/01/trump-iran-protests-irgc-khamenei/685648/",
    "timestamp": "2026-01-16T19:47:11Z"
  },
  {
    "title": "The Left Is So Desperate to Defend Their Minneapolis Narrative, They’ve Hit a New Low",
    "description": "The Democrats are desperate to maintain the narrative that Renee Good was an innocent woman gunned down by a fascist ICE agent. We all know it's not true, and we've all seen the multiple videos from different angles showing Good hit that ICE agent with her ve…",
    "link": "https://freerepublic.com/focus/f-news/4362488/posts",
    "timestamp": "2026-01-16T19:46:27Z"
  },
  {
    "title": "Emergency calls reveal chaos after Minneapolis ICE shooting as city braces for more unrest",
    "description": "By Brad Brooks, Joseph Ax and Renee HickmanMINNEAPOLIS, Jan 16 (Reuters) - Newly released transcripts of 911 calls and emergency dispatch records detail the chaotic and d… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/16/emergency-calls-reveal-chaos-after-minneapolis-ice-shooting-as-city-braces-for-more-unrest",
    "timestamp": "2026-01-16T19:45:40Z"
  },
  {
    "title": "Venezuela on Screen",
    "description": "From a contemplative documentary to a swashbuckling biopic, these films lend a sense of humanity to the present crisis.",
    "link": "http://foreignpolicy.com/2026/01/16/venezuela-movies-nicolas-maduro-donald-trump-documentary-biopic-review-simon-bolivar-films/",
    "timestamp": "2026-01-16T19:45:25Z"
  },
  {
    "title": "Affordability, rural health care among 2026 priorities for House, Speaker Hall says",
    "description": "Republican House Speaker Matt Hall said affordability is going to be the focus for the Michigan House in 2026, with healthcare costs key.",
    "link": "https://www.mlive.com/politics/2026/01/affordability-rural-health-care-among-2026-priorities-for-house-speaker-hall-says.html",
    "timestamp": "2026-01-16T19:45:10Z"
  },
  {
    "title": "Trump Has An Unpopular New Message For Americans",
    "description": "In the week and a half since Renee Good’s killing, the Trump administration has committed itself to a sinister new philosophy in Minneapolis.",
    "link": "https://www.huffpost.com/entry/renee-good-trump-ice-opinion_n_696a6aafe4b0eee204af38b4",
    "timestamp": "2026-01-16T19:42:42Z"
  },
  {
    "title": "Trump pardons former Puerto Rican Gov. Wanda Vázquez Garced",
    "description": "WASHINGTON — President Donald Trump pardoned former Puerto Rican Gov.",
    "link": "https://www.nbcnews.com/politics/white-house/trump-pardons-former-puerto-rican-gov-wanda-vazquez-garced-rcna254457",
    "timestamp": "2026-01-16T19:39:01Z"
  },
  {
    "title": "Trump offers to restart mediation between Egypt and Ethiopia on Nile River water sharing",
    "description": "Jan 16 (Reuters) - The United States is ready to restart mediation between Egypt and Ethiopia to help resolve the issue of Nile River water sharing, President Donald Trum… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/01/16/trump-offers-to-restart-mediation-between-egypt-and-ethiopia-on-nile-river-water-sharing",
    "timestamp": "2026-01-16T19:38:03Z"
  },
  {
    "title": "Scott Jennings Mocked For 'F**king Stupid' Take On Tim Walz Statement About Minnesota",
    "description": "The conservative commentator delivered what critics called an \"unfathomably\" dumb misreading of Gov. Tim Walz's clear call for peace in Minnesota.",
    "link": "https://www.huffpost.com/entry/scott-jennings-mocked-take-tim-walz-statement-minnesota_n_696a4f62e4b0eee204af1e34",
    "timestamp": "2026-01-16T19:37:43Z"
  },
  {
    "title": "Palestinian committee set to govern Gaza under U.S. supervision meets in Cairo",
    "description": "The Palestinian committee set to govern Gaza under U.S. supervision met for the first time Friday in Cairo, as its leader pledged to get to work quickly to improve conditions there.",
    "link": "https://www.cbc.ca/news/world/gaza-palestinian-committee-trump-west-bank-9.7048942",
    "timestamp": "2026-01-16T19:36:29Z"
  },
  {
    "title": "US may punish nations resisting Greenland plan, says Trump",
    "description": "Indigenous Inuit leaders criticised the White House for treating Greenland as an asset rather than a people, warning that such rhetoric undermines international norms and disregards the sovereignty and rights of Indigenous populations.",
    "link": "https://www.thehindubusinessline.com/news/world/us-may-punish-nations-resisting-greenland-plan-says-trump/article70516400.ece",
    "timestamp": "2026-01-16T19:35:11Z"
  },
  {
    "title": "Extreme makeovers: Federal Reserve vs. White House renovations",
    "description": "Both President Donald Trump and Federal Reserve Chair Jerome Powell are involved in controversial — and costly — rehabs of government buildings.",
    "link": "https://www.nbcnews.com/politics/white-house/extreme-makeovers-federal-reserve-vs-white-house-renovations-rcna253717",
    "timestamp": "2026-01-16T19:34:53Z"
  },
  {
    "title": "Elon Musk's Baby Mama Drama: Ashley St. Clair Sues Tesla Billionaire's xAI Over Grok Sexual Images",
    "description": "The former MAGA queen sued Musk's social media platform X for allowing AI-generated explicit, 'unlawful images' to widely circulate.",
    "link": "https://radaronline.com/p/elon-musk-sued-son-mother-ashley-st-clair-grok-sexual-images/",
    "timestamp": "2026-01-16T19:33:43Z"
  },
  {
    "title": "12 ways the Trump administration dismantled civil rights law and the foundations of inclusive democracy in its first year",
    "description": "At its one-year mark, the Trump administration is dismantling the systems that once helped the US move toward a more open and equal democracy.",
    "link": "https://theconversation.com/12-ways-the-trump-administration-dismantled-civil-rights-law-and-the-foundations-of-inclusive-democracy-in-its-first-year-273433",
    "timestamp": "2026-01-16T19:33:00Z"
  },
  {
    "title": "Donald Trump to unveil home buying plan involving retirement funds - BBC",
    "description": "Donald Trump to unveil home buying plan involving retirement fundsBBC Trump to Announce 401(k) Home Investment Plan at DavosBloomberg.com Trump housing plan to allow 401k money for down payments, adviser saysYahoo Finance White House Plan Would Let Americans …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180602104",
    "timestamp": "2026-01-16T19:32:47Z"
  },
  {
    "title": "Americans Say Trump Is Failing on Nearly Everything, Brutal Poll Shows",
    "description": "A majority of Americans said that President Donald Trump’s first year back in office was a failure, according to a humiliating CNN poll published Friday. No kidding.Fifty-eight percent of Americans called Trump’s first year a failure, according to the poll, w…",
    "link": "https://newrepublic.com/post/205397/trump-failing-poll",
    "timestamp": "2026-01-16T19:32:15Z"
  },
  {
    "title": "Bitcoin Seized From Samourai Wallet Has Not Been Sold, White House Says",
    "description": "Advocates for the incarcerated Samourai Wallet developers have argued that the DOJ liquidated the Bitcoin funds against the president’s wishes.",
    "link": "https://decrypt.co/354941/bitcoin-seized-samourai-wallet-reserve-not-sold-white-house",
    "timestamp": "2026-01-16T19:31:52Z"
  },
  {
    "title": "Jimmy Fallon Mocks Trump’s Greenland Ambitions Amid Venezuela Oil Plans | Video",
    "description": "\"‘Now, Donald, if you want Greenland, you have to finish your Venezuela first,’” the \"Tonight Show\" host jokes\nThe post Jimmy Fallon Mocks Trump’s Greenland Ambitions Amid Venezuela Oil Plans | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/jimmy-fallon-trump-venezuela-oil-plans/",
    "timestamp": "2026-01-16T19:30:40Z"
  },
  {
    "title": "Trump says no need to invoke Insurrection Act ‘right now’ amid anti-ICE unrest in Minnesota",
    "description": "President Donald Trump said the Insurrection Act was not necessary in Minnesota, for now, despite him threatening to invoke the law earlier this week.",
    "link": "https://www.foxnews.com/politics/trump-no-need-invoke-insurrection-act-right-now-violent-anti-ice-protests-minnesota",
    "timestamp": "2026-01-16T19:29:28Z"
  },
  {
    "title": "Judge allows a third offshore wind project to resume construction as the industry challenges Trump",
    "description": "It's the third project this week to successfully challenge the Trump administration in court.",
    "link": "https://www.bostonherald.com/2026/01/16/trump-offshore-wind/",
    "timestamp": "2026-01-16T19:28:56Z"
  },
  {
    "title": "Trump threatens tariffs for nations that don't support his aim to acquire Greenland",
    "description": "Trump threatens tariffs for nations that don't support his aim to acquire Greenlandgo.com",
    "link": "https://abcnews.go.com/Politics/trump-threatens-tariffs-nations-support-aim-acquire-greenland/story?id=129283902",
    "timestamp": "2026-01-16T19:26:14Z"
  },
  {
    "title": "Boeing Finally Overtakes Airbus In Annual Sales Again",
    "description": "Boeing seems to finally be pulling out of its years-long nosedive.",
    "link": "https://www.jalopnik.com/2076673/boeing-overtakes-airbus-annual-sales/",
    "timestamp": "2026-01-16T19:25:00Z"
  },
  {
    "title": "Most Americans Believe Trump is Focusing on the Wrong Priorities, New Poll Reveals",
    "description": "A new poll from CNN has found that a whopping 58% of Americans call President Donald Trump's first year of his second term a failure.",
    "link": "https://www.ibtimes.com/most-americans-believe-trump-focusing-wrong-priorities-new-poll-reveals-3795548",
    "timestamp": "2026-01-16T19:24:38Z"
  },
  {
    "title": "Carney clears the way for Chinese EVs in potential blow to auto sector",
    "description": "Canada’s auto sector has been struggling and a new dynamic is about to shake things up further: Chinese EVs are coming here. Read more.",
    "link": "https://financialpost.com/commodities/energy/electric-vehicles/carney-chinese-evs-potential-blow-auto-sector",
    "timestamp": "2026-01-16T19:23:05Z"
  },
  {
    "title": "Trump Is Helping Right-Wing Groups Target Chicago Teachers Union",
    "description": "Dark-money groups want a look at the Chicago Teachers Union’s finances. The Trump administration could help them get it.\nThe post Trump Is Helping Right-Wing Groups Target Chicago Teachers Union appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/01/16/chicago-teachers-union-trump/",
    "timestamp": "2026-01-16T19:22:18Z"
  },
  {
    "title": "Trump’s Threat to Invoke the Insurrection Act, Explained",
    "description": "President Donald Trump threatened to invoke the Insurrection Act in Minnesota this week, continuing to stoke fear and chaos in a situation his administration created by unleashing lawless, armed federal agents against our communities..\nThis is not the first t…",
    "link": "https://www.aclu.org/news/civil-liberties/trumps-threat-to-invoke-the-insurrection-act-explained",
    "timestamp": "2026-01-16T19:22:10Z"
  },
  {
    "title": "Newsom’s 9% Homeless ‘Win’ Is Built On Half-Baked Data",
    "description": "The data the Newsom used was not only missing nearly half of the state's collection, but there have been cited concerns with the information cited.",
    "link": "https://dailycaller.com/2026/01/16/gavin-newsom-homeless-count-california-data/",
    "timestamp": "2026-01-16T19:22:03Z"
  },
  {
    "title": "Rahm Emanuel: ICE Has Become a 'Lawless Mob' Under President Trump",
    "description": "Friday on CNN's \"Inside Politics,\" former mayor of Chicago Rahm Emanuel said Immigration and Customs Enforcement (ICE) had become a \"lawless mob\" under President Donald Trump.\nThe post Rahm Emanuel: ICE Has Become a ‘Lawless Mob’ Under President Trump appeare…",
    "link": "https://www.breitbart.com/clips/2026/01/16/rahm-emanuel-ice-has-become-a-lawless-mob-under-president-trump/",
    "timestamp": "2026-01-16T19:22:00Z"
  },
  {
    "title": "NATO official allegedly said Europe would take every US base if Trump takes Greenland. Here's the real story",
    "description": "A video shared online in January 2026 authentically showed a NATO official saying that if the U.S. takes Greenland, \"We take every single base of the Americans,\" and, \"If you take Greenland, you have to leave.\"",
    "link": "https://www.snopes.com//fact-check/nato-greenland-every-us-base/",
    "timestamp": "2026-01-16T19:22:00Z"
  },
  {
    "title": "Would Russia negotiate with Stubb? Don’t count on it",
    "description": "Moscow would likely reject the appointment of Finnish President Alexander Stubb as EU negotiator Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631062-would-russia-negotiate-with-stubb/",
    "timestamp": "2026-01-16T19:21:09Z"
  },
  {
    "title": "CIA director was in Venezuela to meet with acting President Delcy Rodríguez, official says",
    "description": "CIA Director Ratcliffe met with Venezuela's acting president in Caracas on Thursday, following the ouster of Nicolás Maduro, a U.S. official told Fox News.",
    "link": "https://www.foxnews.com/politics/cia-director-venezuela-meet-acting-president-delcy-rodriguez-official-says",
    "timestamp": "2026-01-16T19:21:03Z"
  },
  {
    "title": "Venezuelan opposition leader is confident about return of democracy but says little of her plans",
    "description": "She avoided giving any details on her plans to return home or any timetable for elections in Venezuela.",
    "link": "https://www.bostonherald.com/2026/01/16/maria-corina-machado/",
    "timestamp": "2026-01-16T19:19:39Z"
  },
  {
    "title": "‘Is Help Still on the Way?’ Reporter Grills Trump on Stunning Iran Reversal",
    "description": "In the midst of Donald Trump's reversal on getting involved in Iran's anti-regime protests, a reporter asked if he was still planning to send help.\nThe post ‘Is Help Still on the Way?’ Reporter Grills Trump on Stunning Iran Reversal first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/is-help-still-on-the-way-reporter-grills-trump-on-stunning-iran-reversal/",
    "timestamp": "2026-01-16T19:19:19Z"
  },
  {
    "title": "Federal judge allows Virginia offshore wind project to resume",
    "description": "A federal judge has ruled that work on a Virginia offshore wind project could resume. It's the third project this week to successfully challenge the Trump administration in court. The administration announced last month it was suspending leases for at least 9…",
    "link": "https://apnews.com/article/trump-offshore-wind-energy-climate-lawsuits-8b6d14485da8c213058f07af4f1946a4",
    "timestamp": "2026-01-16T19:14:16Z"
  },
  {
    "title": "‘Thank you!’ Trump notes Iran’s decision not to carry out 800 executions",
    "description": "President says 'I convinced myself' to hold off on U.S. intervention",
    "link": "https://www.wnd.com/2026/01/thank-you-trump-notes-irans-decision-not-carry/",
    "timestamp": "2026-01-16T19:13:39Z"
  },
  {
    "title": "Iran in limbo: What’s next for country under internet blackout?",
    "description": "Heavy presence of armed forces on streets as Iranians stay home in wake of deadly protests.",
    "link": "https://www.aljazeera.com/features/2026/1/16/iran-in-limbo-whats-next-for-country-under-internet-blackout",
    "timestamp": "2026-01-16T19:12:11Z"
  },
  {
    "title": "Most Germans see Trump's policies as threat to NATO",
    "description": "A majority of Germans say President Donald Trump's approach to foreign policy endangers the NATO alliance, according to a new survey.",
    "link": "https://www.dw.com/en/most-germans-see-trumps-policies-as-threat-to-nato/a-75540685",
    "timestamp": "2026-01-16T19:12:00Z"
  },
  {
    "title": "Kyrsten Sinema Faces 'Homewrecker' Lawsuit for Alleged Affair With Former Bodyguard",
    "description": "Barf Bag: The former Senator and current lobbyist is being sued under an \"alienation of affection\" law for a saga involving Signal chats, concerts, and psychedelics.",
    "link": "https://www.jezebel.com/kyrsten-sinema-faces-homewrecker-lawsuit-for-alleged-affair-with-former-bodyguard",
    "timestamp": "2026-01-16T19:11:44Z"
  },
  {
    "title": "Donald Trump hints US could 'pull out of NATO' over Greenland as he doubles down on blistering tariff threat and Europe puts boots on the ground",
    "description": "Donald Trump has warned the US may pull out of NATO if America's allies don't agree to its acquisition of Greenland. 'Will you pull out of NATO if it doesn't help you acquire Greenland,' a reporter asked the president outside the White House on Friday. Trump …",
    "link": "https://freerepublic.com/focus/f-news/4362484/posts",
    "timestamp": "2026-01-16T19:11:39Z"
  },
  {
    "title": "My unforgettable weekend with President Trump discussing the royals, Ukraine, Africa and the next foreign enemy in his sights. He's SO unlike 'nursing home' Biden",
    "description": "Breakfast is barely under way and President Donald Trump has already discussed Ukraine, the Middle East, the Royal Family – and now he is on to the dangers of a furtive South American foe... [snip] It’s a sunny Saturday morning at Trump International Golf Clu…",
    "link": "https://freerepublic.com/focus/f-news/4362483/posts",
    "timestamp": "2026-01-16T19:11:32Z"
  },
  {
    "title": "Trump Confronted to His Face Over Nobel Yoink: ‘Why Would You Want Somebody Else’s Nobel Prize?’",
    "description": "A reporter confronted President Donald Trump Friday afternoon over his acceptance of a gift award that he did not win — the Nobel Peace Prize.\nThe post Trump Confronted to His Face Over Nobel Yoink: ‘Why Would You Want Somebody Else’s Nobel Prize?’ first appe…",
    "link": "https://www.mediaite.com/media/news/trump-confronted-to-his-face-over-nobel-yoink-why-would-you-want-somebody-elses-nobel-prize/",
    "timestamp": "2026-01-16T19:11:09Z"
  },
  {
    "title": "Canada Inks Trade Deal With China in Break From Trump Agenda",
    "description": "China and Canada reached a wide-ranging agreement to lower trade barriers and rebuild ties, signaling a pivot in Canadian foreign policy and a break from alignment with President Donald Trump’s trade agenda.",
    "link": "https://www.livemint.com/companies/canada-inks-trade-deal-with-china-in-break-from-trump-agenda-11768590609793.html",
    "timestamp": "2026-01-16T19:10:09Z"
  },
  {
    "title": "Donald Trump Bought Netflix And Discovery Corporate Bonds After Merger Deal Was Signed, According To Latest Financial Disclosure",
    "description": "Donald Trump purchased corporate bonds from Netflix and Warner Bros. Discovery in a series of transactions in mid-December, shortly after the two companies signed a landmark deal for the streaming giant to buy major assets. According to the latest financial d…",
    "link": "http://deadline.com/2026/01/trump-netflix-warner-bros-discovery-1236685412/",
    "timestamp": "2026-01-16T19:08:58Z"
  },
  {
    "title": "Cuban Guards Killed Defending Nicolas Maduro Returned Home in Small Boxes",
    "description": "A plane carrying the remains of 32 identified Cuban state security agents killed in the American military operation to arrest deposed Venezuelan dictator Nicolás Maduro landed in Havana on Thursday. Shocking footage of its arrival showed that the remains of t…",
    "link": "https://www.breitbart.com/latin-america/2026/01/16/cuban-guards-killed-defending-nicolas-maduro-returned-home-in-small-boxes/",
    "timestamp": "2026-01-16T19:07:32Z"
  },
  {
    "title": "Trump Warns Minnesota If The Riots Don’t Stop He Will Start Posting In All-Caps",
    "description": "WASHINGTON, D.C. — President Donald Trump warned this week that if the Minnesota government is unable to get the riots under control, he will be forced to start posting online using all-caps.",
    "link": "https://babylonbee.com/news/trump-warns-minnesota-if-the-riots-dont-stop-he-will-start-posting-in-all-caps",
    "timestamp": "2026-01-16T19:05:18Z"
  },
  {
    "title": "Trump’s pardon of convicted woman is the second time he’s erased her sentence in a criminal case | CNN Politics",
    "description": "President Donald Trump is issuing a slew of pardons, a White House official said Friday, including granting clemency again to a woman who was convicted for a second time after he commuted her sentence in his first term.",
    "link": "https://www.cnn.com/2026/01/16/politics/wanda-vazquez-trump-pardon-puerto-rico",
    "timestamp": "2026-01-16T19:02:19Z"
  },
  {
    "title": "This Is Not Solidarity. It Is Predation.",
    "description": "Sina Toossi\n\n\n\nThe Iranian people are caught between severe domestic repression and external powers that exploit their suffering.\r\n\n\r\n\n\nThe post This Is Not Solidarity. It Is Predation. appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/iran-protests-violence-repression-israel/",
    "timestamp": "2026-01-16T19:01:14Z"
  },
  {
    "title": "Leftist candidate tries to orchestrate Trump 'gotcha' — and fails miserably",
    "description": "A leftist congressional candidate launched a lousy attempt to further conflate President Donald Trump with literal Nazis, but failed miserably. Candidate Mark Davis of Florida sounded the alarm Thursday, noting the website \"Nazis.us\" redirects users to the De…",
    "link": "https://www.theblaze.com/news/leftist-candidate-tries-to-orchestrate-trump-gotcha-and-fails-miserably",
    "timestamp": "2026-01-16T19:00:16Z"
  },
  {
    "title": "The Pillaging of the American Arctic",
    "description": "How Alaskans are navigating the Trump administration’s critical mineral drive.",
    "link": "http://foreignpolicy.com/2026/01/16/trump-critical-minerals-arctic-alaska-mining-uranium/",
    "timestamp": "2026-01-16T19:00:04Z"
  },
  {
    "title": "Bitcoin rallies, ETF flows rebound as US crypto policy stalls: Finance Redefined",
    "description": "Bitcoin breached the $95,000 mark this week amid a wider market recovery, as investors digested regulatory delays to the much-awaited CLARITY Act in the US.",
    "link": "https://cointelegraph.com/news/bitcoin-rallies-etf-flows-rebound-us-crypto-policy",
    "timestamp": "2026-01-16T19:00:00Z"
  },
  {
    "title": "In their words: Greenlanders talk about Trump’s desire to own their Arctic island",
    "description": "Many Greenlanders believe Trump is interested in Greenland's critical minerals.",
    "link": "https://www.bostonherald.com/2026/01/16/greenland-in-their-words/",
    "timestamp": "2026-01-16T18:59:54Z"
  },
  {
    "title": "‘Deeply Concerned’: GOP Pushes Back on Trump’s Greenland Rhetoric",
    "description": "Representative Jeff Hurd (R-CO) said he was \"deeply concerned\" about President Donald Trump's potential plan to take over Greenland.\nThe post ‘Deeply Concerned’: GOP Pushes Back on Trump’s Greenland Rhetoric first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/deeply-concerned-gop-pushes-back-on-trumps-greenland-rhetoric/",
    "timestamp": "2026-01-16T18:59:21Z"
  },
  {
    "title": "Palestinian committee set to govern Gaza under US supervision meets in Cairo",
    "description": "It is the first meeting of the Palestinian committee, backed by US President Donald Trump.",
    "link": "https://www.channelnewsasia.com/world/gaza-palestine-hamas-israel-ceasefire-us-trump-5864746",
    "timestamp": "2026-01-16T18:59:00Z"
  },
  {
    "title": "Report: Trump, Netanyahu held second phone call to discuss Iran",
    "description": "Axios reports that Trump and Netanyahu spoke on Thursday night to discuss Iran, their second phone call in two days on the Iran crisis.",
    "link": "https://www.israelnationalnews.com/news/421020",
    "timestamp": "2026-01-16T18:56:13Z"
  },
  {
    "title": "Trump is taking aim at a power grid operator in a bid to bring electricity costs down",
    "description": "Trump and a group of northeastern governors are pressuring a major power grid operator to hold a new auction.",
    "link": "https://www.businessinsider.com/trump-power-plant-auction-tech-companies-governors-2026-1",
    "timestamp": "2026-01-16T18:53:50Z"
  },
  {
    "title": "‘Let’s Go, C’Mon!’ Watch a Visibly-Bored Trump Grouse at Numerous Speakers to Hurry Up During Wild Panel",
    "description": "President Donald Trump on Friday was so eager to finish up a health meeting that he repeatedly urged speakers to pick up the pace.\nThe post ‘Let’s Go, C’Mon!’ Watch a Visibly-Bored Trump Grouse at Numerous Speakers to Hurry Up During Wild Panel first appeared…",
    "link": "https://www.mediaite.com/politics/lets-go-cmon-watch-a-visibly-bored-trump-grouse-at-numerous-speakers-to-hurry-up-during-wild-panel/",
    "timestamp": "2026-01-16T18:51:40Z"
  },
  {
    "title": "Ludacris Pulls Out of Rock the Country Festival, Citing “Mix-Up”",
    "description": "The Atlanta rapper's rep claims that \"lines got crossed\" and Ludacris wasn't supposed to be in the lineup.\nLudacris Pulls Out of Rock the Country Festival, Citing “Mix-Up”\nEddie Fu",
    "link": "https://consequence.net/2026/01/ludacris-kid-rock-rock-the-country-tour-backlash/",
    "timestamp": "2026-01-16T18:51:28Z"
  },
  {
    "title": "Exiled Iranian crown prince reveals 6-step plan to exert pressure on Tehran's regime",
    "description": "Exiled Iranian crown prince Reza Pahlavi outlined his 6-step plan to exert international pressure on the regime, describing it as being \"close to collapse\"",
    "link": "https://www.foxnews.com/world/exiled-iranian-crown-prince-reveals-6-step-plan-exert-pressure-tehrans-regime",
    "timestamp": "2026-01-16T18:50:31Z"
  },
  {
    "title": "‘The alternative will be a bad one’: Trump aide reveals what could come next in Iran",
    "description": "White House envoy Steve Witkoff revealed that military strikes in Iran might not be off the table for the United States as diplomatic talks continue. The top Trump administration aide told Axios that President Donald Trump had a second phone call with Israeli…",
    "link": "https://www.rawstory.com/donald-trump-iran-2674902764/",
    "timestamp": "2026-01-16T18:50:14Z"
  },
  {
    "title": "ICE agent who shot Renee Good dead set to become millionaire through fundraisers",
    "description": "ICE agent Jonathan Ross has reportedly not returned to work since the incident that sparked protests across the US",
    "link": "https://www.ladbible.com/news/us-news/renee-good-death-ice-agent-jonathan-ross-fundraiser-millionaire-452458-20260116",
    "timestamp": "2026-01-16T18:49:20Z"
  },
  {
    "title": "‘The multilateral system’: Western leader touts coming ‘new world order,’ then tries to explain it",
    "description": "Comment prompted by discussions over tariffs, exports, imports, more",
    "link": "https://www.wnd.com/2026/01/multilateral-system-western-leader-touts-coming-new-world/",
    "timestamp": "2026-01-16T18:49:02Z"
  },
  {
    "title": "White House economic advisor floats idea of 'Trump cards’ amid credit card battle with banks",
    "description": "Trump called for banks to cap credit card interest rates at 10%, an idea that has been roundly rejected by industry executives and their lobbyists this week.",
    "link": "https://www.cnbc.com/2026/01/16/white-house-hassett-trump-cards-credit-card-battle.html",
    "timestamp": "2026-01-16T18:48:58Z"
  },
  {
    "title": "Trump casts doubt on Kevin Hassett as Fed chair as Kevin Warsh takes the lead",
    "description": "Donald Trump is rethinking who should lead the Federal Reserve next. Kevin Hassett’s chances dropped after controversial comments, while Kevin Warsh moved ahead as the top choice. Some senators are blocking any decision until an investigation ends. The race n…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-casts-doubt-on-kevin-hassett-as-fed-chair-as-kevin-warsh-takes-the-lead/articleshow/126588876.cms",
    "timestamp": "2026-01-16T18:48:05Z"
  },
  {
    "title": "Families of nine British plane crash victims sue Air India in London HC",
    "description": "UK News: TOI correspondent from London: The families of nine British victims of the AI 171 June 12, 2025 plane crash are suing Air India in the London high cou.",
    "link": "https://timesofindia.indiatimes.com/world/uk/families-of-nine-british-plane-crash-victims-sue-air-india-in-london-hc/articleshow/126589649.cms",
    "timestamp": "2026-01-16T18:45:44Z"
  },
  {
    "title": "Lancaster County SNAP participation drops as federal government rolls out new eligibility requirements",
    "description": "State food bank officials say “misinformation” related to a federal restructuring of the Supplemental Nutrition Assistance Program has discouraged thousands of food insecure people in Lancaster County and across the state from using food benefits.",
    "link": "https://lancasteronline.com/news/local/lancaster-county-snap-participation-drops-as-federal-government-rolls-out-new-eligibility-requirements/article_28968a3a-02c3-49f4-9c36-a0e17459e649.html",
    "timestamp": "2026-01-16T18:45:00Z"
  },
  {
    "title": "Does 'Nazis.us' redirect to DHS website? Yes, here's who bought the domain",
    "description": "In mid-January 2026, typing the domain \"nazis.us\" into a web browser redirected to the U.S. Department of Homeland Security's official website.",
    "link": "https://www.snopes.com//fact-check/nazis-us-redirect-dhs-website/",
    "timestamp": "2026-01-16T18:44:00Z"
  },
  {
    "title": "Title 'inseparably' linked to person, Nobel Institute says",
    "description": "Nobel prize title 'remains inseparably linked to the person,' organizers of the prize said in statement, after Maria Corina Machado gifted her peace prize medal to Donald Trump. The Nobel Institute clarifies in a statement that the Nobel Peace Prize honor rem…",
    "link": "https://www.dw.com/en/title-inseparably-linked-to-person-nobel-institute-says/a-75543903",
    "timestamp": "2026-01-16T18:44:00Z"
  },
  {
    "title": "Inside the failed 2020 coup in Venezuela that resulted in the capture of ex-US Special Forces",
    "description": "The recent capture of Venezuelan president Nicolás Maduro recalls a botched 2020 coup attempt that resulted in the imprisonment of two former US Army Green Berets.",
    "link": "https://www.businessinsider.com/inside-the-failed-coup-in-venezuela-that-captured-special-forces-2026-1",
    "timestamp": "2026-01-16T18:43:32Z"
  },
  {
    "title": "Canada, breaking with US, agrees to cut tariff on Chinese EVs in return for lower tariffs on Canadian farm products",
    "description": "By KEN MORITSUGU and ROB GILLIES BEIJING (AP) — Breaking with the United States, Canada has agreed to cut its 100% tariff on Chinese electric cars in return for lower tariffs on Canadian farm…",
    "link": "https://www.mercurynews.com/2026/01/16/canada-agrees-to-cut-tariff-on-chinese-evs-in-return-for-lower-tariffs-on-canadian-farm-products/",
    "timestamp": "2026-01-16T18:42:22Z"
  },
  {
    "title": "Trump considers punishing countries with tariffs if they don't back U.S. takeover of Greenland",
    "description": "President Donald Trump suggested Friday that he may punish countries with tariffs if they don't back the U.S. controlling Greenland, a message that came as a bipartisan Congressional delegation sought to lower tensions in the Danish capital.",
    "link": "https://www.pbs.org/newshour/politics/trump-considers-punishing-countries-with-tariffs-if-they-dont-back-u-s-takeover-of-greenland",
    "timestamp": "2026-01-16T18:42:20Z"
  },
  {
    "title": "Construction work, 3 trains to skip Bengaluru’s Majestic",
    "description": "Bengaluru: Due to the ongoing reconstruction work of the pit line at KSR railway station (Majestic) in Bengaluru, the terminal of three trains will be.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/construction-work-3-trains-to-skip-bengalurus-majestic/articleshow/126587506.cms",
    "timestamp": "2026-01-16T18:42:00Z"
  },
  {
    "title": "President Trump Unveils The Great Healthcare Plan to Lower Costs and Deliver Money Directly to the People",
    "description": "President Donald J. Trump’s Great Healthcare Plan is a broad healthcare initiative that will slash prescription drug prices, reduce insurance premiums, hold big insurance companies accountable, and maximize price transparency in the American healthcare system…",
    "link": "https://freerepublic.com/focus/f-news/4362480/posts",
    "timestamp": "2026-01-16T18:41:15Z"
  },
  {
    "title": "China Celebrates ‘New Starting Point’ with Canada, Welcoming Old Friend PM Mark Carney",
    "description": "Chinese Premier Li Qiang embraced Canadian Prime Minister Mark Carney to Beijing on Thursday, telling the Canadian leader that his visit represented a “new starting point” for the previously strained relations between their countries.\nThe post China Celebrate…",
    "link": "https://www.breitbart.com/asia/2026/01/16/china-celebrates-new-starting-point-with-canada-welcoming-old-friend-pm-mark-carney/",
    "timestamp": "2026-01-16T18:40:32Z"
  },
  {
    "title": "Carney to Trump: Back off on Greenland (Elena Giordano/Politico)",
    "description": "Elena Giordano / Politico:\nCarney to Trump: Back off on Greenland  —  Canadian Prime Minister Mark Carney warned Friday that a decision on who owns Greenland doesn't belong to U.S. President Donald Trump.  —  “The future of Greenland is a decision for Greenla…",
    "link": "https://www.memeorandum.com/260116/p75",
    "timestamp": "2026-01-16T18:40:00Z"
  },
  {
    "title": "Jaipur Literature Festival 2026 witnesses discourse that sparks change and inspires reflection",
    "description": "The much-anticipated 19th edition of the Jaipur Literature Festival brought together some of the most influential voices from literature, politics, me.",
    "link": "https://timesofindia.indiatimes.com/entertainment/events/jaipur/jaipur-literature-festival-2026-witnesses-discourse-that-sparks-change-and-inspires-reflection/articleshow/126587353.cms",
    "timestamp": "2026-01-16T18:39:39Z"
  },
  {
    "title": "Nigerian imam honoured for saving Christian lives dies aged 90",
    "description": "Abubakar Abdullahi sheltered 262 people after they came under attack from Fulani herders in 2018.",
    "link": "https://www.bbc.com/news/articles/cql4z369zk6o",
    "timestamp": "2026-01-16T18:35:53Z"
  },
  {
    "title": "What are the hurdles to implementing phase two of Gaza ceasefire?",
    "description": "The US says its Gaza plan is moving towards disarmament and reconstruction.",
    "link": "https://www.aljazeera.com/video/inside-story/2026/1/16/what-are-the-hurdles-to-implementing-phase-two-of-gaza-ceasefire",
    "timestamp": "2026-01-16T18:33:10Z"
  },
  {
    "title": "Trump announces Gaza 'board of peace' as phase two of US-backed plan begins",
    "description": "The US president is expected to chair the board, which is to oversee a Palestinian committee charged with managing war-ravaged Gaza as the peace plan enters its second stage. Since the plan came into effect in October, Israeli attacks have continued in the en…",
    "link": "https://freerepublic.com/focus/f-news/4362477/posts",
    "timestamp": "2026-01-16T18:32:25Z"
  },
  {
    "title": "Trump says ‘thank you’ to Iran for not hanging protesters",
    "description": "US President Donald Trump thanked Iran’s leadership on Friday after saying Tehran had called off the executions of hundreds of protesters arrested in a brutal crackdown. “I greatly respect the fact that all scheduled hangings, which were to take place yesterd…",
    "link": "https://www.digitaljournal.com/world/trump-says-thank-you-to-iran-for-not-hanging-protesters/article",
    "timestamp": "2026-01-16T18:32:20Z"
  },
  {
    "title": "Immigration Agents Teargas Minneapolis Family’s Car With 6 Kids Inside",
    "description": "The family's 6-month-old baby stopped breathing and was unconscious for several minutes after the attack.",
    "link": "https://truthout.org/articles/immigration-agents-teargas-minneapolis-familys-car-with-6-kids-inside/",
    "timestamp": "2026-01-16T18:31:34Z"
  },
  {
    "title": "‘Common sense’: Lawmaker introduces bill to eliminate capital gains taxes on home sales",
    "description": "'It doesn’t promote anything other than government greed'",
    "link": "https://www.wnd.com/2026/01/common-sense-lawmaker-introduces-bill-eliminate-capital-gains/",
    "timestamp": "2026-01-16T18:31:12Z"
  },
  {
    "title": "Venezuelan Attorney General Says Maduro’s Abduction Was An Act Of WAR",
    "description": "Tarek William Saab, Venezuela's attorney general, has said that the abduction of Nicolas Maduro was an \"act of war.\"  The United States kidnapped the Venezuelan ruler during an operation a few weeks ago.",
    "link": "https://www.shtfplan.com/war/venezuelan-attorney-general-says-maduros-abduction-was-an-act-of-war",
    "timestamp": "2026-01-16T18:30:26Z"
  }
]