[
  {
    "title": "Clip Of Donald Trump Talking About Lindsay Lohan Resurfaces",
    "description": "Clip Of Donald Trump Talking About Lindsay Lohan Resurfaceslittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-lindsay-lohan-resurfaced-clip",
    "timestamp": "2025-07-27T17:32:43Z"
  },
  {
    "title": "Zelensky Went Soft on Corruption Because the U.S. Did",
    "description": "Trump withdrew from the fight against kleptocracy, and other countries have absorbed that fact.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/zelensky-ukraine-anti-corruption-agencies/683672/",
    "timestamp": "2025-07-27T17:30:00Z"
  },
  {
    "title": "Trump: US will not allow Iran's uranium enrichment",
    "description": "United States President Donald Trump on Sunday issued a stark warning to Iran over its nuclear ambitions, saying Tehran is \"stupid\" to continue uranium enrichment after having been \"beaten up very bad...",
    "link": "https://biztoc.com/x/84ea656fe879abc3",
    "timestamp": "2025-07-27T17:27:26Z"
  },
  {
    "title": "Trump hits EU for lack of Gaza aid, says Israel needs to 'make a decision' with Hamas not releasing hostages",
    "description": "President Donald Trump says Hamas is reluctant to release the remaining hostages amid Israel's increase in humanitarian aid efforts in Gaza on Sunday.",
    "link": "https://www.foxnews.com/politics/trump-hits-eu-lack-gaza-aid-says-israel-needs-make-decision-hamas-not-releasing-hostages",
    "timestamp": "2025-07-27T17:23:32Z"
  },
  {
    "title": "Trump says US is close to reaching a trade deal with China",
    "description": "U.S. President Donald Trump said on Sunday his administration was close to reaching a trade deal with China, but gave no other details. \"We're very close to ...",
    "link": "https://www.yahoo.com/news/articles/trump-says-us-close-reaching-172304512.html",
    "timestamp": "2025-07-27T17:23:04Z"
  },
  {
    "title": "Reporter Asks Trump if He’s in a ‘Bad Mood’ Because He Had a ‘Bad Morning of Golf’",
    "description": "President Donald Trump was confronted, during a press engagement Sunday, about whether he was in a bad mood because of a lousy day on the Scottish links.\nThe post Reporter Asks Trump if He’s in a ‘Bad Mood’ Because He Had a ‘Bad Morning of Golf’ first appeare…",
    "link": "https://www.mediaite.com/media/news/reporter-asks-trump-if-hes-in-a-bad-mood-because-he-had-a-bad-morning-of-golf/",
    "timestamp": "2025-07-27T17:22:03Z"
  },
  {
    "title": "Trump says '50-50' chance of trade deal as crunch talks with EU chief begin",
    "description": "US President Donald Trump and EU chief Ursula von der Leyen confirm the deal after \"tough negotiations\" in Scotland.",
    "link": "https://www.bbc.co.uk/news/live/c5y0d0yz282t",
    "timestamp": "2025-07-27T17:20:34Z"
  },
  {
    "title": "Concern over future of planned €300m Wicklow film studio",
    "description": "There are concerns about the future of a €300m film studio planned for Greystones in Co Wicklow, with no progress three years after the project was launched.",
    "link": "https://www.rte.ie/news/regional/2025/0727/1525594-wicklow-film-studio/",
    "timestamp": "2025-07-27T17:19:49Z"
  },
  {
    "title": "Concern over future of planned €300m Wicklow film studio",
    "description": "There are concerns about the future of a €300m film studio planned for Greystones in Co Wicklow, with no progress three years after the project was launched.",
    "link": "https://www.rte.ie/news/regional/2025/0727/1525594-concern-over-future-of-planned-300m-wicklow-film-studio/",
    "timestamp": "2025-07-27T17:19:49Z"
  },
  {
    "title": "History’s Hard Lessons and America’s New Resolve",
    "description": "From Reims to the Rio Grande, history repeats—but in Trump’s America, the border holds, and the ghosts of appeasement find no sanctuary.There is never a dull moment in the second, more cheerful reign of Donald Trump. I am writing from London, but was in Franc…",
    "link": "https://freerepublic.com/focus/f-bloggers/4331073/posts",
    "timestamp": "2025-07-27T17:19:21Z"
  },
  {
    "title": "Lutnick: Trump wants 'good enough' EU trade offer — but what that means is unclear",
    "description": "Commerce Secretary Howard Lutnick said Sunday that the European Union should agree to open its markets for U.S. exports to convince President Donald Trump to lower \"reciprocal\" tariffs on the 27-member bloc.\nLutnick's comments suggest that Trump is open to a …",
    "link": "https://biztoc.com/x/627e3d283b1eeb34",
    "timestamp": "2025-07-27T17:16:12Z"
  },
  {
    "title": "EU and US agree trade deal, with 15% tariffs for European exports to America",
    "description": "US President Donald Trump and EU chief Ursula von der Leyen confirm the deal after \"tough negotiations\" in Scotland.",
    "link": "https://www.bbc.com/news/live/c5y0d0yz282t",
    "timestamp": "2025-07-27T17:12:19Z"
  },
  {
    "title": "Trump says US will work with Thailand and Cambodia, adds both 'want to settle'",
    "description": "TURNBERRY, Scotland (Reuters) -U.S. President Donald Trump said on Sunday he believed both Thailand and Cambodia wanted to settle their differences after he told the leaders of both countries that he would not conclude trade deals with them unless they ended …",
    "link": "https://www.thestar.com.my/news/world/2025/07/28/trump-says-us-will-work-with-thailand-and-cambodia-adds-both-039want-to-settle039",
    "timestamp": "2025-07-27T17:12:00Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" July 27, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, OMB director Russell Vought and French Foreign Minister Jean-Noël Barrot join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-episode-transcript-07-27-2025/",
    "timestamp": "2025-07-27T17:11:51Z"
  },
  {
    "title": "Johnson says Ghislaine Maxwell deserves life sentence over Epstein crimes, rejects potential pardon",
    "description": "House Speaker Mike Johnson rejects pardoning Ghislaine Maxwell, stating she deserves life in prison for her role in Jeffrey Epstein sex trafficking crimes.",
    "link": "https://www.foxnews.com/politics/johnson-says-ghislaine-maxwell-deserves-life-sentence-over-epstein-crimes-rejects-potential-pardon",
    "timestamp": "2025-07-27T17:11:51Z"
  },
  {
    "title": "Democrats self-own bragging about inflation shows the left has learned NOTHING",
    "description": "Everybody makes mistakes. Not everyone makes the same mistakes over and over again.",
    "link": "https://nypost.com/2025/07/27/opinion/democrats-self-own-bragging-about-inflation-shows-the-left-has-learned-nothing/",
    "timestamp": "2025-07-27T17:11:13Z"
  },
  {
    "title": "Trump Gripes That Gazans Didn’t ‘Say Thank You’ for Food Aid: ‘Would Be Nice to Have at Least a Thank You’",
    "description": "President Donald Trump complained on Sunday that Gazans have not thanked him for some food assistance to the country.\nThe post Trump Gripes That Gazans Didn’t ‘Say Thank You’ for Food Aid: ‘Would Be Nice to Have at Least a Thank You’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/tv/trump-gripes-that-gazans-didnt-say-thank-you-for-food-aid-would-be-nice-to-have-at-least-a-thank-you/",
    "timestamp": "2025-07-27T17:10:32Z"
  },
  {
    "title": "US and EU agree trade deal, says Trump",
    "description": "The United States and European Union have agreed a trade deal, says Donald Trump.",
    "link": "https://news.sky.com/story/us-and-eu-agree-trade-deal-says-donald-trump-13402672",
    "timestamp": "2025-07-27T17:04:00Z"
  },
  {
    "title": "Tens of Thousands March Against 'Big Ugly Budget Bill' With Call to Put 'Families First'",
    "description": "Tens of thousands of people in more than 225 towns and cities across the U.S. came out on Saturday as part of the Families First National Day of Action to protest Trump administration and Republican policies that defund the safety net while funneling unpreced…",
    "link": "https://www.commondreams.org/news/families-first-rally",
    "timestamp": "2025-07-27T17:01:20Z"
  },
  {
    "title": "Trump: Israel Has To “Clean It Up” And “Get Rid Of” Hamas",
    "description": "United States President Donald Trump has said that Israel will have to drive the terrorist group Hamas out of Gaza, as ceasefire talks have once again stalled. Trump claims that Hamas doesn't want a ceasefire, and that those still engaged with said terrorist …",
    "link": "https://www.shtfplan.com/headline-news/trump-israel-has-to-clean-it-up-and-get-rid-of-hamas",
    "timestamp": "2025-07-27T17:00:56Z"
  },
  {
    "title": "What polls show about a very confusing political landscape | CNN Politics",
    "description": "The political landscape right now is more confusing than a corn maze. For every data point that suggests Republicans face headwinds, there seems to be another that suggests Democrats should hold their britches.",
    "link": "https://www.cnn.com/2025/07/27/politics/midterms-polls-landscape",
    "timestamp": "2025-07-27T17:00:43Z"
  },
  {
    "title": "Yale Prof Describes How Democrats Lost Non-White Voters in the 2024 Election",
    "description": "\"eventually disaffected after becoming tired of the party's identity politics and empty promises\"\nThe post Yale Prof Describes How Democrats Lost Non-White Voters in the 2024 Election first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/07/yale-prof-describes-how-democrats-lost-non-white-voters-in-the-2024-election/",
    "timestamp": "2025-07-27T17:00:37Z"
  },
  {
    "title": "Massie urges subpoena against Epstein estate, joins progressive Dem in push for ‘full release’ of files",
    "description": "Republican Thomas Massie and Democrat Ro Khanna united to demand full disclosure of Epstein documents on Sunday, including Trump's alleged birthday letter.",
    "link": "https://www.foxnews.com/politics/massie-urges-subpoena-against-epstein-estate-joins-progressive-dem-push-full-release-files",
    "timestamp": "2025-07-27T17:00:31Z"
  },
  {
    "title": "'Wow': MSNBC host dumbfounded after 'batcoop crazy' Sunday Trump press conference",
    "description": "Immediately after Donald Trump concluded a press availability with Ursula von der Leyen, president of the European Commission, MSNBC host Ali Velshi admitted he was stunned by the president's rambling and blustering answers to reporters' questions.During the …",
    "link": "https://www.rawstory.com/trump-crazy-press-conference/",
    "timestamp": "2025-07-27T17:00:10Z"
  },
  {
    "title": "Jordan and UAE drop aid in Gaza as Israel begins 'tactical pause'",
    "description": "Israel's concession to aid come as it faces growing international pressure to alleviate mass starvation in Gaza.",
    "link": "https://www.bbc.com/news/articles/ckgj270grkxo",
    "timestamp": "2025-07-27T17:00:05Z"
  },
  {
    "title": "Breaking the Public School Monopoly on Education Overdue",
    "description": "The Donald Trump administration has been pursuing, on two fronts, the critical objective of fixing America’s broken education system. One, an executive order by President... Read More\nThe post Breaking the Public School Monopoly on Education Overdue appeared …",
    "link": "https://www.dailysignal.com/2025/07/27/breaking-the-public-school-monopoly-on-education-overdue/",
    "timestamp": "2025-07-27T17:00:00Z"
  },
  {
    "title": "‘Stain On Our Country’: CIA Director Suggests Indictments Are On Table For Brennan, Comey",
    "description": "Central Intelligence Agency (CIA) Director John Ratcliffe hinted at future indictments in the ongoing Russiagate investigation on Fox News this Sunday.",
    "link": "https://dailycaller.com/2025/07/27/john-ratcliffe-indictments-russiagate-fox-news/",
    "timestamp": "2025-07-27T16:54:52Z"
  },
  {
    "title": "Trump Says Supreme Court's Immunity Ruling Likely Helps Obama Following DNI Disclosures",
    "description": "Trump Says Supreme Court's Immunity Ruling Likely Helps Obama Following DNI Disclosures\n \nAuthored by Jack Phillips via The Epoch Times (emphasis ours),\nPresident Donald Trump on Friday said that former President Barack Obama likely has immunity following a U…",
    "link": "https://biztoc.com/x/ae205865c19e5563",
    "timestamp": "2025-07-27T16:53:53Z"
  },
  {
    "title": "Leaders of Thailand and Cambodia meeting for talks to end deadly border dispute",
    "description": "Thai and Cambodian leaders will meet in Malaysia for talks to end hostilities, a spokesperson for the Thai prime minister’s office said on Sunday. This comes following pressure from U.S. President Donald Trump to end a deadly border dispute, now in its fourth…",
    "link": "https://biztoc.com/x/384cd3281e4e7149",
    "timestamp": "2025-07-27T16:53:47Z"
  },
  {
    "title": "Bless Netanyahu and Trump, because what comes next could be awful",
    "description": "Can you imagine a Mamdani ruining New York City and a Hunter Biden finishing up the rest of the counttry? It could happen. Opinion.",
    "link": "https://www.israelnationalnews.com/news/412329",
    "timestamp": "2025-07-27T16:48:50Z"
  },
  {
    "title": "Report: Donations to NPR, PBS Have ‘Exploded’ in Aftermath of Congressional Defunding",
    "description": "For decades, Republicans have argued that if supporters of NPR and PBS were so fond of keeping the purported “news” organizations operational, then they should have no problem forking over the donations needed to keep them going. As it turns out, that is exac…",
    "link": "https://freerepublic.com/focus/f-news/4331064/posts",
    "timestamp": "2025-07-27T16:48:24Z"
  },
  {
    "title": "Beyoncé’s Cowboy Carter Is Rewriting American Culture — And Boosting The Economy",
    "description": "From hotel booking surges to small business booms, Beyoncé’s latest tour proves cultural power can move markets — and challenge the politics of profit in Trump’s  America.",
    "link": "https://www.forbes.com/sites/richardfowler/2025/07/27/beyoncs-cowboy-carter-is-rewriting-american-culture---and-boosting-the-economy/",
    "timestamp": "2025-07-27T16:48:16Z"
  },
  {
    "title": "Speaker Mike Johnson Slams Ghislaine Maxwell’s 20-Year Sentence: ‘A Pittance’ | Video",
    "description": "\"I think she should have a life sentence at least,\" he tells NBC’s \"Meet the Press with Kristen Welker\"\nThe post Speaker Mike Johnson Slams Ghislaine Maxwell’s 20-Year Sentence: ‘A Pittance’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/speaker-mike-johnson-ghislaine-maxwell-20-year-sentence-pittance/",
    "timestamp": "2025-07-27T16:44:54Z"
  },
  {
    "title": "Leaders of Thailand and Cambodia meeting for talks to end deadly border dispute",
    "description": "Thai and Cambodian leaders will meet in Malaysia for talks to end hostilities, a spokesperson for the Thai prime minister’s office said on Sunday. This comes following pressure from U.S. President Donald Trump to end a deadly border dispute, now in its fourth…",
    "link": "https://www.pbs.org/newshour/world/leaders-of-thailand-and-cambodia-meeting-for-talks-to-end-deadly-border-dispute",
    "timestamp": "2025-07-27T16:43:57Z"
  },
  {
    "title": "Thailand, Cambodia agree to talks to resolve border dispute",
    "description": "Thailand and Cambodia agreed to talks in Malaysia on Monday aimed at ending their ballooning border dispute.\nThe negotiations follow pressure from US President Donald Trump, who said further fighting would jeopardize the countries’ trade talks with Washington…",
    "link": "https://biztoc.com/x/df9c361e3fa3f7e6",
    "timestamp": "2025-07-27T16:43:04Z"
  },
  {
    "title": "Trump’s bold move targets Beyoncé and 2 more",
    "description": "President Donald Trump has escalated his criticism of former Vice President Kamala Harris by demanding criminal prosecution over alleged payments to celebrities during the 2024 presidential campaign. The accusations center on millions of dollars that Trump cl…",
    "link": "https://rollingout.com/2025/07/27/trumps-bold-move-target-beyonce-and-more/",
    "timestamp": "2025-07-27T16:40:28Z"
  },
  {
    "title": "Trump says Israel will have to 'make a decision' on next steps in Gaza",
    "description": "Donald Trump said Israel will decide on the next steps in Gaza. This follows Israel's withdrawal from ceasefire and hostage negotiations with Hamas. Trump emphasized the importance of releasing hostages held by Hamas. He noted Hamas has become more rigid on t…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-israel-will-have-to-make-a-decision-on-next-steps-in-gaza/articleshow/122937871.cms",
    "timestamp": "2025-07-27T16:39:32Z"
  },
  {
    "title": "Trump: Once Hamas Gives Up Last Hostages They Know It's \"The End Of Them,\" So They Won't Make A Deal",
    "description": "President Trump comments on the Israel-Gaza war during a meeting Sunday in Scotland with EU Commission President Ursula von der Leyen: \r\n\r\n\"I know what I'd do, but I don't think it's appropriate that I say. But Israel is going to have to make a decision,\" Tru…",
    "link": "https://www.realclearpolitics.com/video/2025/07/27/trump_on_gaza_that_whole_place_is_a_mess_once_hamas_gives_up_hostages_they_know_its_the_end_of_them.html",
    "timestamp": "2025-07-27T16:35:17Z"
  },
  {
    "title": "EU's von der Leyen says any US trade deal would be based on fairness and rebalancing",
    "description": "Ursula von der Leyen assessed the likelihood of a trade agreement with Donald Trump at 50-50, emphasizing fairness and rebalancing. Meeting in Scotland, both leaders aimed to resolve a transatlantic trade dispute before an August 1 deadline, when the U.S. cou…",
    "link": "https://economictimes.indiatimes.com/news/international/business/eus-von-der-leyen-says-any-us-trade-deal-would-be-based-on-fairness-and-rebalancing/articleshow/122937819.cms",
    "timestamp": "2025-07-27T16:33:33Z"
  },
  {
    "title": "Trump: 'I know what I'd do in Gaza, Israel has to make a decision'",
    "description": "US President says America gave $60 million to provide food to Gaza, but no other nation contributed to the effort, Hamas has less reason to negotiated with fewer hostages in its grasp.",
    "link": "https://www.israelnationalnews.com/news/412327",
    "timestamp": "2025-07-27T16:32:00Z"
  },
  {
    "title": "Trump says tariff on EU won't go below 15%",
    "description": "United States President Donald Trump stood firm on Sunday regarding the tariffs that may be imposed on European Union goods, saying he will not lower them below 15%. In a meeting with European Commiss...",
    "link": "https://biztoc.com/x/57621d9be3a2852e",
    "timestamp": "2025-07-27T16:31:50Z"
  },
  {
    "title": "Threat of U.S.-EU trade war looms as Trump, von der Leyen plan talks in Scotland",
    "description": "President Donald Trump is meeting Sunday with European Commission chief Ursula von der Leyen, taking a break from golfing in Scotland to discuss trade as both sides seek an agreement on tariff rates with the White House’s deadline to impose stiff import taxes…",
    "link": "https://biztoc.com/x/e0a9528bac74e629",
    "timestamp": "2025-07-27T16:31:45Z"
  },
  {
    "title": "Donald Trump Trashed in Scotland's Biggest Newspaper: 'Menace'",
    "description": "The Daily Record blasted Trump but said that \"we also have to separate the man from the office he holds.\"",
    "link": "https://biztoc.com/x/c82dedb0e433c953",
    "timestamp": "2025-07-27T16:31:37Z"
  },
  {
    "title": "‘Are You Trying to Rewrite History?!’ NBC’s Kristen Welker Throws Down With Lindsey Graham in Heated Battle About Trump Accusing Obama of Treason",
    "description": "NBC's Kristen Welker got in a heated battle with Sen. Lindsey Graham (R-SC) about Trump's claim that Obama committed treason.\nThe post ‘Are You Trying to Rewrite History?!’ NBC’s Kristen Welker Throws Down With Lindsey Graham in Heated Battle About Trump Accu…",
    "link": "https://www.mediaite.com/media/news/are-you-trying-to-rewrite-history-nbcs-kristen-welker-throws-down-with-lindsey-graham-in-heated-battle-about-trump-accusing-obama-of-treason/",
    "timestamp": "2025-07-27T16:29:02Z"
  },
  {
    "title": "Ex-MSNBC host praises Trump's political instincts, ability to connect to country culturally",
    "description": "Former MSNBC host Chris Matthews praised President Trump's political abilities on Saturday and said the president is plugged in to the country's culture.",
    "link": "https://www.foxnews.com/media/ex-msnbc-host-praises-trumps-political-instincts-ability-connect-country-culturally",
    "timestamp": "2025-07-27T16:28:54Z"
  },
  {
    "title": "Trump’s Aug. 1 tariff deadline is set in stone, Lutnik says: ‘No extensions, no more grace periods’",
    "description": "The customized tariff rates were slated to take effect on April 9, but then got delayed 90 days and then postponed again until Aug. 1.",
    "link": "https://nypost.com/2025/07/27/us-news/trumps-aug-1-tariff-deadline-is-set-in-stone-lutnik-says/",
    "timestamp": "2025-07-27T16:28:20Z"
  },
  {
    "title": "Donald Trump Trashed in Scotland's Biggest Newspaper: 'Menace'",
    "description": "The Daily Record blasted Trump but said that \"we also have to separate the man from the office he holds.\"",
    "link": "https://www.newsweek.com/donald-trump-trashed-scotlands-biggest-newspapers-menace-2104704",
    "timestamp": "2025-07-27T16:28:16Z"
  },
  {
    "title": "Trump Calls For Kamala Harris To Be Prosecuted, Again Alleging She Paid For Celebrity Endorsements",
    "description": "The president went on a rant Saturday, claiming — without evidence — Harris' campaign paid Beyoncé and others millions of dollars for their support.",
    "link": "https://www.huffpost.com/entry/trump-harris-endorsements_n_68863962e4b09838bd9f0a7f",
    "timestamp": "2025-07-27T16:27:26Z"
  },
  {
    "title": "'So Much Disappointment': GOP Lawmaker Scolds Trump For Doing 'A 180' On Epstein",
    "description": "Rep. Thomas Massie (R-KY) said that Republicans were feeling \"so much disappointment\" in President Donald Trump after he did \"a 180\" and declined to release files on convicted sex offender Jeffrey Epstein.\n\n\n\"I don't think it's a hoax at all,\" Massie told ABC…",
    "link": "https://crooksandliars.com/2025/07/so-much-disappointment-gop-lawmaker-scolds",
    "timestamp": "2025-07-27T16:26:54Z"
  },
  {
    "title": "How the Hunter Biden cover-up continues to this day",
    "description": "All the obstruction and interference and slow walking past statutes of limitation happened under the benign leadership of David Weiss.",
    "link": "https://nypost.com/2025/07/27/opinion/how-the-hunter-biden-cover-up-continues-to-this-day/",
    "timestamp": "2025-07-27T16:26:18Z"
  },
  {
    "title": "Trump meets EU chief in push to clinch trade deal",
    "description": "EU chief Ursula von der Leyen is hoping to strike a trade deal with the US to avoid a transatlantic trade war. Trump describes the prospect of an agreement as \"50-50.\"",
    "link": "https://www.dw.com/en/trump-meets-eu-chief-in-push-to-clinch-trade-deal/a-73429993",
    "timestamp": "2025-07-27T16:23:00Z"
  },
  {
    "title": "US and EU reach trade deal to avoid tariffs",
    "description": "EU chief Ursula von der Leyen has managed to negotiate a 15% US tariff.",
    "link": "https://www.dw.com/en/us-and-eu-reach-trade-deal-to-avoid-tariffs/a-73429993",
    "timestamp": "2025-07-27T16:23:00Z"
  },
  {
    "title": "‘US exceptionalism roars back’ as markets defy doomsayers and draw record foreign inflows after panic over Trump tariffs",
    "description": "Foreign investors returned to U.S. stocks and bonds in force in May, just a month after retreating in the wake of President Donald Trump’s unexpectedly aggressive tariffs. New data show record net inflows, as the highest tariff rates were on hold to allow bre…",
    "link": "https://biztoc.com/x/8a61acd95b235366",
    "timestamp": "2025-07-27T16:20:53Z"
  },
  {
    "title": "Trump, VDL agree on 50-50 chance for trade deal",
    "description": "United States President Donald Trump and European Commission President Ursula von der Leyen on Sunday agreed that the likelihood of a trade agreement between the United States and the European Union f...",
    "link": "https://biztoc.com/x/fb6cc708047911f7",
    "timestamp": "2025-07-27T16:20:41Z"
  },
  {
    "title": "Trump says US, EU have 'good chance' of reaching trade deal",
    "description": "TURNBERRY, Scotland (Reuters) -U.S. President Donald Trump on Sunday said there is a good chance that the United States and European Union would reach a trade agreement, citing three or four main sticking points. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/28/trump-says-us-eu-have-039good-chance039-of-reaching-trade-deal",
    "timestamp": "2025-07-27T16:19:00Z"
  },
  {
    "title": "Trump meets Von der Leyen in Scotland",
    "description": "Donald Trump and Ursula von der Leyen are meeting at the US president’s golf course in Scotland to discuss the prospect of a trade deal. The summit with the president of the EU commission could mark a breakthrough in trade negotiations, ending months of uncer…",
    "link": "https://freerepublic.com/focus/f-news/4331063/posts",
    "timestamp": "2025-07-27T16:18:56Z"
  },
  {
    "title": "Trump team in a panic over 'nightmare' GOP candidate getting past the primary: report",
    "description": "There is a growing fear in the Donald Trump White House that a far-right candidate for Pennsylvania governor’s seat could get past the primary, make it to the general election and then cripple the chances for every other Republican on the ballot in 2026.Accor…",
    "link": "https://www.rawstory.com/mastriano-trump-2673768473/",
    "timestamp": "2025-07-27T16:16:21Z"
  },
  {
    "title": "Today’s News in a Nutshell",
    "description": "KATHMANDU: Khabarhub brings you a glimpse of major developments of the day in Nepal, including politics, business/economy, sports, entertainment, and more. Shankar Pokharel: UML halted Bhandari’s membership renewal to restore her role as national guardian CPN…",
    "link": "https://english.khabarhub.com/2025/27/487946/",
    "timestamp": "2025-07-27T16:15:30Z"
  },
  {
    "title": "Trump says US, EU have 'good chance' of reaching trade deal",
    "description": "U.S. President Donald Trump on Sunday said there is a good chance that the United States and European Union would reach a trade agreement, citing three or...",
    "link": "https://www.yahoo.com/news/articles/trump-says-us-eu-good-161434652.html",
    "timestamp": "2025-07-27T16:14:34Z"
  },
  {
    "title": "House Republican Accuses Trump DOJ of ‘Hiding Behind’ a ‘Strawman’ to Avoid Releasing Epstein Files",
    "description": "Rep. Thomas Massie accused the leaders in his own party of obstructing the release of government files relating to Jeffrey Epstein because they include embarrassing information. \nThe post House Republican Accuses Trump DOJ of ‘Hiding Behind’ a ‘Strawman’ to A…",
    "link": "https://www.mediaite.com/media/tv/house-republican-accuses-trump-doj-of-hiding-behind-a-strawman-to-avoid-releasing-epstein-files/",
    "timestamp": "2025-07-27T16:12:57Z"
  },
  {
    "title": "Gabbard Accuses Obama of Dodging the Truth of 'Treasonous Conspiracy' Following Release of Intel Files",
    "description": "Gabbard Accuses Obama of Dodging the Truth of 'Treasonous Conspiracy' Following Release of Intel Fileswesternjournal.com",
    "link": "https://www.westernjournal.com/gabbard-accuses-obama-dodging-truth-treasonous-conspiracy-following-release-intel-files/",
    "timestamp": "2025-07-27T16:11:45Z"
  },
  {
    "title": "Fact check: Trump calls to prosecute Beyoncé based on a nonexistent $11 million payment | CNN Politics",
    "description": "There is no basis for Trump’s claim that Beyoncé received an $11 million payment related to the Harris campaign, let alone for the endorsement in particular.",
    "link": "https://www.cnn.com/2025/07/27/politics/trump-beyonce-prosecute-fact-check",
    "timestamp": "2025-07-27T16:08:57Z"
  },
  {
    "title": "Sen. Mark Kelly Changes Subject To Trump When Pressed On Biden Inflation Chart Dems Posted",
    "description": "Democratic Arizona Sen. Mark Kelly floundered on CNN Sunday when pressed about a chart Democrats posted",
    "link": "https://dailycaller.com/2025/07/27/mark-kelly-trump-democrats-chart-inflation/",
    "timestamp": "2025-07-27T16:07:56Z"
  },
  {
    "title": "‘US exceptionalism roars back’ as markets defy doomsayers and draw record foreign inflows after panic over Trump tariffs",
    "description": "\"The hurdle for the US to experience genuine capital flight is high and certainly wasn’t breached in April.\"",
    "link": "https://fortune.com/2025/07/27/us-markets-american-exceptionalism-foreign-investors-stocks-treasury-bonds/",
    "timestamp": "2025-07-27T16:05:48Z"
  },
  {
    "title": "Trump says US very close to a deal with China, 50-50 chance of having a deal with EU",
    "description": "US President Donald Trump today said that the United States is very close to a deal with China. During a press briefing with European Commission President Ursula von der Leyen, Trump also said that there is a 50-50 chance of having a US-EU trade deal but he s…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-says-us-very-close-to-a-deal-with-china-50-50-chance-of-having-a-deal-with-eu/articleshow/122937527.cms",
    "timestamp": "2025-07-27T16:05:41Z"
  },
  {
    "title": "Jay Leno Questions Why Late-Night Hosts “Alienate” Half Their Audience: “Get To The Joke”",
    "description": "While many in the late-night community are standing by Stephen Colbert, one veteran host has a different perspective. Jay Leno recently commented on the political comedy of today’s late-night hosts after The Late Show with Stephen Colbert was unceremoniously …",
    "link": "http://deadline.com/2025/07/jay-leno-late-night-hosts-alienate-half-audience-1236469963/",
    "timestamp": "2025-07-27T16:02:26Z"
  },
  {
    "title": "Elon Musk's SpaceX Moves Bitcoin For The First Time In 3 Years: Is A Sell-Off Incoming?",
    "description": "SpaceX has reportedly moved parts of its Bitcoin holdings after a long period of dormancy. Cryptocurrency intelligence platform Arkham said Tuesday on X that...",
    "link": "https://finance.yahoo.com/news/elon-musks-spacex-moves-bitcoin-160154685.html",
    "timestamp": "2025-07-27T16:01:54Z"
  },
  {
    "title": "WWE star Chelsea Green leaves social media after backlash for Hulk Hogan comments",
    "description": "WWE star Chelsea Green was among those in the pro wrestling world to comment on the death of Hulk Hogan on Thursday, but she received social media hate for it.",
    "link": "https://www.foxnews.com/sports/wwe-star-chelsea-green-leaves-social-media-after-backlash-hulk-hogan-comments",
    "timestamp": "2025-07-27T16:00:56Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with President of the European Commission",
    "description": "President Donald Trump meets with the president of the European Commission on Sunday, July 27.\nThe post Watch Live: Donald Trump Meets with President of the European Commission appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/07/27/watch-live-donald-trump-meets-with-president-of-the-european-commission/",
    "timestamp": "2025-07-27T15:56:17Z"
  },
  {
    "title": "How Trump facilitated Netanyahu's Gaza starvation policy - and failed to bring the hostages home",
    "description": "Instead of holding Netanyahu to the terms of the January ceasefire deal, Trump and Witkoff allowed the Israeli prime minister to resume the war, strangle Gaza's aid supply and trigger a humanitarian catastrophe. All of which failed to bring the hostages home",
    "link": "https://www.haaretz.com/israel-news/2025-07-27/ty-article/.highlight/trump-facilitated-netanyahus-gaza-starvation-policy-and-failed-to-bring-the-hostages-home/00000198-4bcf-de88-a9d8-4bef57790000",
    "timestamp": "2025-07-27T15:55:28Z"
  },
  {
    "title": "How Trump facilitated Netanyahu's Gaza starvation policy - and failed to bring the hostages home",
    "description": "Instead of holding Netanyahu to the terms of the January ceasefire deal, Trump and Witkoff allowed the Israeli prime minister to resume the war, strangle Gaza's aid supply and trigger a humanitarian catastrophe. All of which failed to bring the hostages home",
    "link": "https://www.haaretz.com/israel-news/2025-07-27/ty-article/.premium/trump-facilitated-netanyahus-gaza-starvation-policy-and-failed-to-bring-the-hostages-home/00000198-4bcf-de88-a9d8-4bef57790000",
    "timestamp": "2025-07-27T15:55:28Z"
  },
  {
    "title": "Destiny’s Child reunion a reality at Beyoncé’s final “Cowboy Carter” show",
    "description": "Beyoncé's final \"Cowboy Carter\" stop included a surprise reunion of the girl group.",
    "link": "https://www.salon.com/2025/07/27/destinys-child-reunion-a-reality-at-beyonces-final-cowboy-carter-show/",
    "timestamp": "2025-07-27T15:53:36Z"
  },
  {
    "title": "RUBIO: Maduro Not President of Venezuela -- Heads Narco-Terrorist Cartel",
    "description": "U.S. Secretary of State Marco Rubio declared on Sunday that Nicolas Maduro is \"not the president of Venezuela.\" Instead, Rubio says Maduro is the head of a narco-terrorist cartel that has \"taken possession of the country.\"\nThe post RUBIO: Maduro Not President…",
    "link": "https://www.breitbart.com/border/2025/07/27/rubio-maduro-not-president-of-venezuela-heads-narco-terrorist-cartel/",
    "timestamp": "2025-07-27T15:47:10Z"
  },
  {
    "title": "South Park’s Trump-Satan sex scene earns fake apology and real White House backlash",
    "description": "The White House has accused the cartoon of chasing attention amid slipping relevance Read Full Article at RT.com",
    "link": "https://www.rt.com/pop-culture/622053-south-park-trump-satire/",
    "timestamp": "2025-07-27T15:46:49Z"
  },
  {
    "title": "Jay Leno Blasts Late Night Hosts For Partisan Jokes That Alienate Viewers",
    "description": "Jay Leno is pushing back against the rise of partisan politics in late-night comedy, saying hosts today are dividing audiences with one-sided jokes.",
    "link": "https://dailycaller.com/2025/07/27/jay-leno-late-night-hosts-partisan-jokes-colbert-cbs-paramount/",
    "timestamp": "2025-07-27T15:46:33Z"
  },
  {
    "title": "Rubio reflects on remarkable political journey from Trump critic to trusted cabinet member",
    "description": "Secretary of State Marco Rubio shares insights on working with President Trump, praising his action-oriented leadership and instincts in a Fox News interview.",
    "link": "https://www.foxnews.com/media/rubio-reflects-remarkable-political-journey-from-trump-critic-trusted-cabinet-member",
    "timestamp": "2025-07-27T15:46:11Z"
  },
  {
    "title": "Unfiltered Pic Of Trump Hits The Internet After Health Diagnosis & He Looks Older Than Ever - NewsBreak",
    "description": "A recent candid photo of President Donald Trump following his chronic venous insufficiency diagnosis proves he's beginning to show every bit of his 79 year",
    "link": "https://www.newsbreak.com/share/4124867909124-unfiltered-pic-of-trump-hits-the-internet-after-health-diagnosis-he-looks-older-than-ever?_f=app_share&amp;pd=03zDexdI&amp;lang=en_US&amp;send_time=1753631116&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.12.1.3%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v6%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v6&amp;s=i2",
    "timestamp": "2025-07-27T15:45:52Z"
  },
  {
    "title": "Trump-inspired 'Japanese first' politician shakes up nation's establishment",
    "description": "Sohei Kamiya's Sanseitō Party won 14 seats in Japan's Upper House elections, appealing to young voters with a \"Japanese first\" platform focused on culture, birth rates and food security.",
    "link": "https://www.foxnews.com/world/trump-inspired-japanese-first-politician-shakes-up-japans-traditional-political-landscape",
    "timestamp": "2025-07-27T15:45:16Z"
  },
  {
    "title": "Thailand and Cambodia to Meet for Ceasefire Talks",
    "description": "Thai and Cambodia leaders are scheduled to meet in Malaysia for ceasefire talks on Monday.",
    "link": "https://www.newsweek.com/thailand-cambodia-meet-ceasefire-talks-2104710",
    "timestamp": "2025-07-27T15:44:46Z"
  },
  {
    "title": "‘The left losing their minds over this’: CIA Director John Ratcliffe expects Russiagate indictments and reveals ‘what hasn’t come out yet’",
    "description": "'There is no doubt in my mind that they conspired against President Trump. They conspired against the American people'",
    "link": "https://www.wnd.com/2025/07/left-losing-their-minds-this-cia-director-john/",
    "timestamp": "2025-07-27T15:39:54Z"
  },
  {
    "title": "US-EU trade deal with 15% tariff is on the table but needs sign-off from Trump, diplomat says",
    "description": "US President Donald Trump and EU chief Ursula von der Leyen were set for make-or-break talks in Scotland Sunday, aimed at ending a months-long transatlantic trade standoff, as negotiations went down to the wire.\nTrump has said he sees a one-in-two chance of a…",
    "link": "https://biztoc.com/x/eeb4533ac0a882c6",
    "timestamp": "2025-07-27T15:36:04Z"
  },
  {
    "title": "Trump's inner circle accused of 'pure malpractice' for mismanaging Epstein blowback",
    "description": "According to a former Donald Trump communications official, there is no way that the president and his White House should be at the center of the Jeffrey Epstein files scandal which should be handled instead by the Department of Justice.During an appearance o…",
    "link": "https://www.rawstory.com/trump-epstein-white-house/",
    "timestamp": "2025-07-27T15:31:36Z"
  },
  {
    "title": "White House orders Hegseth to stop polygraphs on Pentagon staff suspected of leaking: report",
    "description": "A current adviser to Secretary of Defense Pete Hegseth alerted senior officials in the Trump administration of the use of polygraphs to find leakers at the Pentagon.",
    "link": "https://www.foxnews.com/politics/white-house-orders-hegseth-stop-polygraph-tests-pentagon-staff",
    "timestamp": "2025-07-27T15:25:26Z"
  },
  {
    "title": "Lutnick: Trump wants 'good enough' EU trade offer — but what that means is unclear",
    "description": "Commerce Secretary Howard Lutnick said Sunday that the European Union should agree to open its markets for U.S. exports to convince President Donald Trump to lower \"reciprocal\" tariffs on the 27-member bloc.\nLutnick's comments suggest that Trump is open to a …",
    "link": "https://biztoc.com/x/5f6773b59db31485",
    "timestamp": "2025-07-27T15:25:09Z"
  },
  {
    "title": "Jay Leno hits out at ‘political’ late night talk shows amid Stephen Colbert cancellation",
    "description": "The former host of ‘The Tonight Show’ said that you lose ‘half an audience’ by making political jokes",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/jay-leno-politics-stephen-colbert-b2796878.html",
    "timestamp": "2025-07-27T15:21:51Z"
  },
  {
    "title": "’20 Years Was a Pittance!’ Mike Johnson Takes Fiery Stand Against a Ghislane Maxwell Pardon — As Trump Keeps Door Open",
    "description": "House Speaker Mike Johnson (R-LA) took a fiery stand against a pardon for Ghislaine Maxwell — something on which President Donald Trump has not closed the door.\nThe post ’20 Years Was a Pittance!’ Mike Johnson Takes Fiery Stand Against a Ghislane Maxwell Pard…",
    "link": "https://www.mediaite.com/media/news/20-years-was-a-pittance-mike-johnson-takes-fiery-stand-against-a-ghislane-maxwell-pardon-as-trump-keeps-door-open/",
    "timestamp": "2025-07-27T15:20:44Z"
  },
  {
    "title": "US-EU trade deal with 15% tariff is on the table but needs sign-off from Trump, diplomat says",
    "description": "Under the proposal described to AFP, the EU would commit to ramp up purchases of US liquefied natural gas, along with other investment pledges.",
    "link": "https://fortune.com/2025/07/27/us-eu-trade-deal-15-perent-tariff-trump-talks-lng-carveouts/",
    "timestamp": "2025-07-27T15:20:20Z"
  },
  {
    "title": "Imperialists Using NATO and G7 to Maintain Global Domination",
    "description": "“Let’s work for peace and justice! Canada out of NATO! Canada out of the G7!”\n– Tamara Lorincz, this week’s show\n \n***\nLISTEN TO THE SHOW\n\r\n\n\r\n\n Click to download the audio (MP3 format) \nLast month, in a report …\nThe post Imperialists Using NATO and G7 to Mai…",
    "link": "https://www.globalresearch.ca/imperialists-using-nato-and-g7-to-maintain-global-domination/5896126",
    "timestamp": "2025-07-27T15:16:14Z"
  },
  {
    "title": "'Not My Lane': Watch Mike Johnson Squirm Out Of Question On Ghislaine Maxwell Pardon",
    "description": "House Speaker Mike Johnson (R-LA) said it was \"not my lane\" when he was asked if he supported President Donald Trump granting a pardon for Jeffrey Epstein's accomplice, Ghislaine Maxwell.\n\n\nDuring a Sunday interview on Meet the Press, host Kristen Welker aske…",
    "link": "https://crooksandliars.com/2025/07/not-my-lane-watch-mike-johnson-squirm-out",
    "timestamp": "2025-07-27T15:15:41Z"
  },
  {
    "title": "House Dems Request Epstein ‘Birthday Book’ From Estate",
    "description": "This could be very bad news for Donald Trump, his $10 billion libel lawsuit against The Wall Street Journal and his Epstein scandal cover up.\nDemocratic Reps. Robert Garcia, the ranking Democrat on the Oversight and Accountability Committee, and Ro Khanna hav…",
    "link": "https://crooksandliars.com/2025/07/house-dems-request-epstein-birthday-book",
    "timestamp": "2025-07-27T15:14:17Z"
  },
  {
    "title": "Trump: Macron's Two-State Talk \"Doesn't Matter\" & \"Carries No Weight\"",
    "description": "Trump: Macron's Two-State Talk \"Doesn't Matter\" & \"Carries No Weight\"\n \nFrance this week became the largest European nation, and the first G7 country, to recognize a Palestinian state, a move strongly condemned by Israel - and which has also angered Washingto…",
    "link": "https://biztoc.com/x/6b1dbe6745c2135a",
    "timestamp": "2025-07-27T15:14:01Z"
  },
  {
    "title": "Democratic financial officials warn Medicaid cuts will disrupt entire health systems - NewsBreak",
    "description": "Colorado State Treasurer Dave Young’s sister Dorothy has relied heavily on Medicaid “for health care and for life-sustaining support” as she lives with sev",
    "link": "https://www.newsbreak.com/share/4132117718484-democratic-financial-officials-warn-medicaid-cuts-will-disrupt-entire-health-systems?s=a2&amp;share_destination_id=MjQyMzAxNTkzLTE3NTM2MjkxOTkwOTE%3D&amp;pd=0GOfiD2V&amp;hl=en_US&amp;send_time=1753629199&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v3%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v2",
    "timestamp": "2025-07-27T15:13:48Z"
  },
  {
    "title": "Watch: Fed Chair Jerome Powell Fumes as Trump Hands Him a Document During Building Tour",
    "description": "President Donald Trump warned Federal Reserve Chairman Jerome Powell that he'd be visiting the Fed's headquarters.",
    "link": "https://www.westernjournal.com/watch-fed-chair-jerome-powell-fumes-trump-hands-document-building-tour/",
    "timestamp": "2025-07-27T15:10:06Z"
  },
  {
    "title": "Rep. Massie Calls For Ghislaine Maxwell To Testify ‘If She Has Information That Could Help Us’",
    "description": "Rep. Thomas Massie said on NBC News Sunday that Ghislaine Maxwell should testify if she possesses information beneficial to investigations related to Epstein.",
    "link": "https://dailycaller.com/2025/07/27/thomas-massie-ghislaine-maxwell-testify-nbc/",
    "timestamp": "2025-07-27T15:09:23Z"
  }
]