[
  {
    "title": "Dow surges 2,600 as stocks soar after Trump pauses some tariffs",
    "description": "S&P 500 was up 8% in afternoon trading and heading toward one of its best days in decades",
    "link": "https://www.wnd.com/2025/04/dow-surges-2600-as-stocks-soar-after-trump-pauses-some-tariffs/",
    "timestamp": "2025-04-09T19:12:15Z"
  },
  {
    "title": "Volkswagen Says First-quarter Profits Impacted By Trump Tariffs",
    "description": "German auto giant Volkswagen said Wednesday that tariffs on car imports into the United States ordered by President Donald Trump had dragged down its first quarter operating profit.",
    "link": "https://www.ibtimes.com/volkswagen-says-first-quarter-profits-impacted-trump-tariffs-3769457",
    "timestamp": "2025-04-09T19:12:13Z"
  },
  {
    "title": "XRP price gains 13% after Trump 90-day tariff pause and XXRP ETF launch",
    "description": "XRP (XRP) price is up 13% on the day, trading above the $2 level after President Donald Trump announced a 90-day pause on all reciprocal tariffs, except for China, which saw an additional 125% hike in response to their counter-tariffs against the US. XRP’s ra…",
    "link": "https://cointelegraph.com/news/xrp-price-gains-13-after-trump-90-day-tariff-pause-and-xxrp-etf-launch",
    "timestamp": "2025-04-09T19:10:35Z"
  },
  {
    "title": "Kamala Harris's 'I told you so' statement goes viral after stock market bloodbath wipes out trillions following Trump's tariffs",
    "description": "Donald Trump’s global tariff rollout sparked a $2 trillion stock market crash, with the S&P, Dow, and Nasdaq all plunging. Kamala Harris’s viral “I told you so” reaction captured the mood as Americans expressed fear, anger, and grim humor. From lost 401ks to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/kamala-harriss-i-told-you-so-statement-goes-viral-after-stock-market-bloodbath-wipes-out-trillions-following-trumps-tariffs/articleshow/120137815.cms",
    "timestamp": "2025-04-09T19:10:15Z"
  },
  {
    "title": "Framework raised prices and then un-raised them an hour later because of Trump",
    "description": "Thanks to Framework, one of the most transparent computer companies out there, we now have a sterling example of just how ridiculous President Donald Trump’s tariffs can make life in the year 2025. Today, the company made all of its computers more expensive. …",
    "link": "https://www.theverge.com/news/646057/framework-raised-prices-and-then-un-raised-them-an-hour-later-because-of-trump",
    "timestamp": "2025-04-09T19:09:59Z"
  },
  {
    "title": "Trump further raises tariffs on Chinese goods by 21% to 125% – over 75 countries get 10% for 90 days",
    "description": "Well, that didn’t take long. Mere hours after China announced it would raise tariffs on good imported from the US from 34% to 84%, United States president Donald Trump has hit back by slapping China […]\nThe post Trump further raises tariffs on Chinese goods b…",
    "link": "https://paultan.org/2025/04/10/trump-hits-back-against-china-retaliatory-tariffs-with-additional-tariffs/",
    "timestamp": "2025-04-09T19:09:14Z"
  },
  {
    "title": "No Intention of 'downplaying Tariffs': PSP's Leong Mun Wai Calls for New Trade Deal With US 9Singapore)",
    "description": "Leong Mun Wai, secretary-general of the Progress Singapore Party (PSP), has called on the Government to negotiate a new trade deal with the US following the latest imposition of tariffs by President Donald Trump. On Wednesday (April 9), Leong, speaking on beh…",
    "link": "https://freerepublic.com/focus/f-news/4309998/posts",
    "timestamp": "2025-04-09T19:08:23Z"
  },
  {
    "title": "'I actually feel bad for you': House Democrat heaps pity on Trump trade rep",
    "description": "U.S. Trade Representative Jamieson Greer spent his second day on Capitol Hill Wednesday, testifying before the House as President Donald Trump made a significant announcement about his trade war. On Truth Social, Trump announced that he would suspend many of …",
    "link": "https://www.rawstory.com/trump-trade-war-2671728841/",
    "timestamp": "2025-04-09T19:06:29Z"
  },
  {
    "title": "Trump's federal return-to-office mandate descends into chaos",
    "description": "Was the administration unprepared, or was it a tactic to drive employees to quit?",
    "link": "https://theweek.com/politics/federal-return-office-mandate",
    "timestamp": "2025-04-09T19:06:25Z"
  },
  {
    "title": "Zelensky Says Russia Dragging Beijing Into War By Recruiting Chinese Fighters",
    "description": "President Volodymyr Zelensky on Wednesday said Russia was \"dragging\" China into the war in Ukraine, as he accused Beijing of knowing that dozens of its citizens were being recruited by Moscow's army to fight.",
    "link": "https://www.ibtimes.com.au/zelensky-says-russia-dragging-beijing-war-recruiting-chinese-fighters-1857723",
    "timestamp": "2025-04-09T19:06:15Z"
  },
  {
    "title": "Fox Business Reporter Says He Broke News of Tariff Pause to Trump White House Staffers: ‘Looked at Me With Blank Stares’",
    "description": "A Fox Business Network reporter claims he informed White House communications staffers of the 90-day hold on tariffs after they apparently didn’t know President Donald Trump had posted his intentions on Truth Social. Edward Lawrence says White House communica…",
    "link": "https://www.mediaite.com/tv/fox-business-reporter-claims-he-had-to-tell-white-house-staffers-of-pause-on-tariffs-after-trump-post-looked-at-me-with-blank-stares/",
    "timestamp": "2025-04-09T19:05:43Z"
  },
  {
    "title": "Ethereum 2X short ETFs lead performance with triple-digit YTD returns",
    "description": "The two best-performing exchange-traded funds (ETFs) year-to-date are exposed to short Ethereum (ETH) 2x leveraged positions. Bloomberg senior ETF analyst Eric Balchunas shared on April 9 that the UltraShort Ether ETF (ETHD), managed by ProShares, surpassed 2…",
    "link": "https://cryptoslate.com/ethereum-2x-short-etfs-lead-performance-with-triple-digit-ytd-returns/",
    "timestamp": "2025-04-09T19:05:32Z"
  },
  {
    "title": "‘It’s Taking Too Long’: Homan, DHS Urges Congress To Advance ‘One Big Beautiful Bill’",
    "description": "Key border security officials in President Donald Trump's administration are warning about failures to pass the president's \"one big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/04/09/homan-dhs-urges-congress-to-advance-one-big-beautiful-bill/",
    "timestamp": "2025-04-09T19:04:44Z"
  },
  {
    "title": "Treasury Report Exposes How Fentanyl Traffickers Exploit Financial System",
    "description": "The fentanyl trade—which claimed tens of thousands of American lives in 2024 alone—is a multibillion-dollar business supported by sophisticated money laundering schemes, a new report... Read More\nThe post Treasury Report Exposes How Fentanyl Traffickers Explo…",
    "link": "https://www.dailysignal.com/2025/04/09/treasury-report-exposes-how-fentanyl-traffickers-use-financial-system/",
    "timestamp": "2025-04-09T19:04:37Z"
  },
  {
    "title": "Meghan Markle Might Be One of the Few Winners In Trump’s Tariff Wars",
    "description": "In an interview with Fortune, the royal entrepreneur explained that her lifestyle products are offered at recession-proof prices and made in the US.",
    "link": "https://www.vanityfair.com/style/story/meghan-markle-might-be-one-of-the-few-winners-in-trumps-tariff-wars",
    "timestamp": "2025-04-09T19:03:23Z"
  },
  {
    "title": "End of the road: 26/11 accused Tahawwur Rana flown to India",
    "description": "Tahawwur Rana, a key accused in the 2008 Mumbai terror attacks, has been extradited to India after exhausting his legal options in the US. The US Supreme Court rejected his petition to delay the extradition. Rana, a Pakistani-origin businessman and associate …",
    "link": "https://economictimes.indiatimes.com/news/india/end-of-the-road-26/11-accused-tahawwur-rana-flown-to-india/articleshow/120137776.cms",
    "timestamp": "2025-04-09T19:02:58Z"
  },
  {
    "title": "Stocks Soar as Trump Pauses Tariffs",
    "description": "U.S. stocks soared after Trump paused some tariffs, sparking the biggest rally since March 2020.",
    "link": "https://www.rigzone.com/news/wire/stocks_soar_as_trump_pauses_tariffs-09-apr-2025-180191-article/",
    "timestamp": "2025-04-09T19:02:16Z"
  },
  {
    "title": "Business leaders from Bill Ackman to Mark Cuban react to Trump's tariff pause",
    "description": "Donald Trump on Wednesday announced a 90-day pause in his tariff plan against some countries, causing disparate reactions among business leaders.\nBloomberg/Bloomberg via Getty Images\nDonald Trump on Wednesday announced a 90-day pause in his tariff plan agains…",
    "link": "https://biztoc.com/x/544018651302b0f5",
    "timestamp": "2025-04-09T19:01:58Z"
  },
  {
    "title": "Bank Of America And Wells Fargo Surge As Bank Stocks Soar On Tariff Pause News",
    "description": "The U.S. financial sector roared to life Wednesday afternoon, with the Financial Select Sector SPDR Fund (NASDAQ:XLF) posting one of its strongest single-day gains in years, soaring 6.8% to $46.89.\nWhat To Know: A surprise move by President Donald Trump annou…",
    "link": "https://biztoc.com/x/312b9ffd03e66aa0",
    "timestamp": "2025-04-09T19:01:57Z"
  },
  {
    "title": "Why China Isn't Included in Trump's 90-Day Pause on Reciprocal Tariffs",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced a temporary 90-day pause on his administration's broad tariff scheme for more than 75 countries — but excluding China, which he accused of showing \"disrespect\" to global market…",
    "link": "https://biztoc.com/x/2895efb782523c28",
    "timestamp": "2025-04-09T19:01:53Z"
  },
  {
    "title": "EXCLUSIVE: White House rolls out implementation of AI for federal employee records",
    "description": "The U.S. Office of Personnel Management (OPM) will post an updated Privacy Impact Assessment (PIA) at the close of business Wednesday that paves the way for a major artificial intelligence rollout.",
    "link": "https://www.foxnews.com/politics/exclusive-white-house-rolls-out-implementation-ai-federal-employee-records",
    "timestamp": "2025-04-09T19:01:17Z"
  },
  {
    "title": "Crypto under siege: Bitcoin and Ether fall as tariff fears intensify – What’s next?",
    "description": "BlackRock’s IBIT sees biggest outflows in ETF market meltdown triggered by Trump’s 104% China tariff threat.",
    "link": "https://ambcrypto.com/crypto-under-siege-bitcoin-and-ether-fall-as-tariff-fears-intensify-whats-next/",
    "timestamp": "2025-04-09T19:00:41Z"
  },
  {
    "title": "Trump’s Own Team Can’t Explain His Sudden Reversal on Tariffs",
    "description": "Donald Trump’s reversal on tariffs Wednesday afternoon seems to have caught his administration off guard. \r\nThe president announced on Truth Social that tariffs would return to a baseline 10 percent level in most countries, while staggering 125 percent duties…",
    "link": "https://newrepublic.com/post/193808/trump-team-cant-explain-reversal-tariffs",
    "timestamp": "2025-04-09T19:00:22Z"
  },
  {
    "title": "US bond rout leaves investors bruised despite Trump pause on tariffs",
    "description": "U.S. Treasury investors were left bruised on Wednesday despite a temporary pause in U.S. tariffs, as some funds were forced to sell bonds in a dash for cash while others called into question the bonds' status as the world's safest asset.",
    "link": "https://economictimes.indiatimes.com/markets/bonds/us-bond-rout-leaves-investors-bruised-despite-trump-pause-on-tariffs/articleshow/120137735.cms",
    "timestamp": "2025-04-09T19:00:22Z"
  },
  {
    "title": "Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%",
    "description": "Donald Trump has paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days - while increasing those on China to 125%.",
    "link": "https://news.sky.com/story/trump-pauses-higher-tariffs-for-most-countries-for-90-days-but-increases-those-on-china-to-125-13345402",
    "timestamp": "2025-04-09T19:00:00Z"
  },
  {
    "title": "US admits 'running up the score' with Australia, leaving little room for deals",
    "description": "The third week on the campaign trail will be critical, before the Easter break and the commencement of early voting, and polls suggest the contest remains tight.",
    "link": "https://www.abc.net.au/news/2025-04-10/week-two-campaign-federal-election-trump-tariffs/105155668",
    "timestamp": "2025-04-09T19:00:00Z"
  },
  {
    "title": "Trump Caved: Why The White House Rollout of His Tariff Pause Is Evidence of Defeat",
    "description": "All the evidence points to Trump caving under the pressure of cratering stocks and bond markets and the political peril that came with it.\nThe post Trump Caved: Why The White House Rollout of His Tariff Pause Is Evidence of Defeat first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/trump-caved-why-the-white-house-rollout-of-his-tariff-pause-is-evidence-of-defeat/",
    "timestamp": "2025-04-09T18:59:43Z"
  },
  {
    "title": "Tesla Canada says its shady $43 million incentive grab was a misunderstanding",
    "description": "Tesla has sent a response to Transport Canada about its sudden incentive cash grab from March, stating that this is standard process and suggesting that the incentives were for backdated sales that Tesla hadn’t filed yet.\n\n\n\n more…",
    "link": "http://electrek.co/2025/04/09/tesla-canada-says-its-shady-43-million-incentive-grab-was-a-misunderstanding/",
    "timestamp": "2025-04-09T18:59:12Z"
  },
  {
    "title": "Amazon Seeking Finance Partner for Potential $15B Warehouse Expansion",
    "description": "Tech and e-commerce giant Amazon is seeking a financing partner for a potential $15 billion plan to build warehouses in the U.S. Amazon hopes to see nearly 80 new logistics facilities built in key U.S. cities and rural areas, Bloomberg reported. Amazon offici…",
    "link": "http://commercialobserver.com/2025/04/amazon-15b-warehouse-expansion/",
    "timestamp": "2025-04-09T18:58:08Z"
  },
  {
    "title": "Business leaders from Bill Ackman to Mark Cuban react to Trump's tariff pause",
    "description": "Donald Trump paused some tariffs from going into effect Wednesday, sending ripples through the business community.",
    "link": "https://www.businessinsider.com/business-leaders-react-donald-trump-temporary-tariff-pause-2025-4",
    "timestamp": "2025-04-09T18:57:35Z"
  },
  {
    "title": "Why China Isn't Included in Trump's 90-Day Pause on Reciprocal Tariffs",
    "description": "The president announced a temporary pause on his broad tariff scheme for over 75 countries, excluding China, accusing it of disrespecting global markets.",
    "link": "https://www.newsweek.com/trump-tariff-pause-china-2057597",
    "timestamp": "2025-04-09T18:57:12Z"
  },
  {
    "title": "Maggie Haberman Confronts Trump Treasury Chief On White House Driveway Over Tariff Pause — Hours After Trump Said ‘Be Cool’",
    "description": "Maggie Haberman confronted Scott Bessent on Trump's tariff move just hours after telling investors to \"BE COOL!\" — asking why believe \"this is the last word?\"\nThe post Maggie Haberman Confronts Trump Treasury Chief On White House Driveway Over Tariff Pause — …",
    "link": "https://www.mediaite.com/news/maggie-haberman-confronts-trump-treasury-chief-on-white-house-driveway-over-tariff-pause-hours-after-trump-said-be-cool/",
    "timestamp": "2025-04-09T18:57:10Z"
  },
  {
    "title": "Donald Trump's golf cheating scandal: Caddy's confession to Mike Tirico revealed",
    "description": "Donald Trump&apos;s love for golf is no secret-he owns 16 courses worldwide and boasts a handicap that&apos;s sparked plenty of chatter. But on April 9, a wild story surfaced that&",
    "link": "https://www.marca.com/en/golf/2025/04/09/67f6c2cb22601d487c8b45ba.html",
    "timestamp": "2025-04-09T18:56:35Z"
  },
  {
    "title": "Bitcoin (BTC) Jumps To $82,000 As Trump Announces 90-Day Pause On Tariffs Except China",
    "description": "Crypto and stock prices have surged in the past hour after US President Donald Trump announced a 90-day pause for tariffs on multiple nations, except China. Bitcoin (BTC), the flagship crypto, now eyes the $83,000 barrier after jumping 6.1% following the news…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-btc-jumps-to-82000-as-trump-announces-90-day-pause-on-tariffs-except-china/",
    "timestamp": "2025-04-09T18:56:22Z"
  },
  {
    "title": "US-China Tariff War Could Cut Trade Between Two By 80%: WTO",
    "description": "The World Trade Organization chief said Tuesday the US-China tariff war could reduce trade in goods between the two economic giants by 80 percent.",
    "link": "https://www.ndtv.com/world-news/trump-tariffs-us-china-tariff-war-could-cut-trade-between-two-by-80-wto-8127980",
    "timestamp": "2025-04-09T18:56:17Z"
  },
  {
    "title": "Alignment with global tax norms to benefit India: David Linke, KPMG",
    "description": "\"As the US administration's trade policy will be targeted against most of the trading partners, India will not be solely impacted. It could be that India is less impacted than other trading partners, which can be a comparative advantage,\" Linke said.",
    "link": "https://economictimes.indiatimes.com/industry/services/consultancy-/-audit/alignment-with-global-tax-norms-to-benefit-india-david-linke-kpmg/articleshow/120137689.cms",
    "timestamp": "2025-04-09T18:56:09Z"
  },
  {
    "title": "Stocks soar as Trump announces tariffs respite for most trade partners",
    "description": "But Trump also raises tariffs on goods from China to at least 125% \"effective immediately\".",
    "link": "https://www.bbc.com/news/articles/cgrggqydxv5o",
    "timestamp": "2025-04-09T18:55:40Z"
  },
  {
    "title": "XRP, Solana and Dogecoin Lead Altcoin Comeback After Trump Tariff Pause",
    "description": "Altcoins like DOGE and XRP are ripping higher after President Trump put a 90-day pause on most of his \"reciprocal\" tariffs.",
    "link": "https://decrypt.co/314175/xrp-solana-dogecoin-comeback-trump-tariff-pause",
    "timestamp": "2025-04-09T18:54:11Z"
  },
  {
    "title": "ICE Director: Deportation Should Operate Like Amazon ‘But With Human Beings’",
    "description": "Acting ICE Director Todd Lyons said at the order Security Expo that deportations should be carried out as efficiently as a business like Amazon.",
    "link": "http://www.rollingstone.com/politics/politics-news/ice-director-todd-lyons-deportation-operate-amazon-1235314047/",
    "timestamp": "2025-04-09T18:52:02Z"
  },
  {
    "title": "Trans female fencer no longer on college team amid latest controversy",
    "description": "Redmond Sullivan, the transgender female fencer at the center of a USA Fencing controversy, is no longer competing on Wagner College's team.",
    "link": "https://www.foxnews.com/sports/trans-female-fencer-no-longer-college-team-amid-latest-controversy",
    "timestamp": "2025-04-09T18:51:50Z"
  },
  {
    "title": "Peter Navarro Pushes Back As Fox Host Says It Seemed He Was ‘Mucking Up the Public Relations’ Ahead of Tariff Pause",
    "description": "Peter Navarro pushed back after Fox's Charles Payne suggested Navarro may have been \"mucking up\" the public messaging for President Donald Trump's tariffs.\nThe post Peter Navarro Pushes Back As Fox Host Says It Seemed He Was ‘Mucking Up the Public Relations’ …",
    "link": "https://www.mediaite.com/tv/peter-navarro-pushes-back-as-fox-host-says-it-seemed-he-was-mucking-up-the-public-relations-ahead-of-tariff-pause/",
    "timestamp": "2025-04-09T18:51:40Z"
  },
  {
    "title": "TikTok and the Retreat from Technological Globalization",
    "description": "Kyle Chayka writes about why the sale of TikTok has been postponed, again, and what that might say about the future of technology and of globalization.",
    "link": "https://www.newyorker.com/culture/infinite-scroll/tiktok-and-the-retreat-from-technological-globalization",
    "timestamp": "2025-04-09T18:51:31Z"
  },
  {
    "title": "Trump administration appeals court decision ordering AP journalists back into White House events",
    "description": "The Trump administration says it will appeal a federal court decision that ordered it to readmit Associated Press journalists to White House events on First Amendment grounds.",
    "link": "https://www.wsls.com/news/national/2025/04/09/trump-administration-appeals-court-decision-ordering-ap-journalists-back-into-white-house-events/",
    "timestamp": "2025-04-09T18:48:54Z"
  },
  {
    "title": "How to get ignored by White House: Demand press secretary use YOUR ‘pronouns’",
    "description": "Communications director suggests media outlets try 'actually reporting the truth'",
    "link": "https://www.wnd.com/2025/04/how-to-get-ignored-by-white-house-demand-press-secretary-use-your-pronouns/",
    "timestamp": "2025-04-09T18:47:09Z"
  },
  {
    "title": "Goldman Sachs Sees 65% Chance of US Recession in Next Year",
    "description": "Goldman Sachs Group Inc. economists said they now see a 65% chance of a US recession in the next 12 months, citing President Donald Trump’s tariffs on US trading partners.",
    "link": "https://financialpost.com/pmn/business-pmn/goldman-sachs-sees-65-chance-of-us-recession-in-next-year",
    "timestamp": "2025-04-09T18:47:08Z"
  },
  {
    "title": "GOP To Change House Rules To Prevent Themselves From Blocking Trump’s Tariffs",
    "description": "They’re sneaking language into a procedural vote to bar lawmakers from terminating the national emergency Trump declared in order to impose his tariffs.",
    "link": "https://www.huffpost.com/entry/house-rules-change-trump-tariffs_n_67f6a344e4b01be203957673",
    "timestamp": "2025-04-09T18:46:35Z"
  },
  {
    "title": "‘Recession Highly, Highly Likely Still’: CNN’s Richard Quest Pours Cold Water All Over Stock Market Rally",
    "description": "\"The underlying policy prescription hasn't altered. All that's happened is the capriciousness of the execution has become all the more clear. So a recession, highly, highly likely still.\"\nThe post ‘Recession Highly, Highly Likely Still’: CNN’s Richard Quest P…",
    "link": "https://www.mediaite.com/tv/recession-highly-highly-likely-still-cnns-richard-quest-pours-cold-water-all-over-stock-market-rally/",
    "timestamp": "2025-04-09T18:46:27Z"
  },
  {
    "title": "Trump’s Long Game With Tariffs\nRestoring America's industrial base.",
    "description": "Donald Trump is playing the long game with tariffs. His goal is to restore our industrial base by revolutionizing the way the United States trades with the rest of the world. We no longer make antibiotics, and import much of our steel, computer chips, and car…",
    "link": "https://freerepublic.com/focus/f-news/4309993/posts",
    "timestamp": "2025-04-09T18:45:53Z"
  },
  {
    "title": "‘This Is All So Stupid’: Conservatives Exhale, Then Fume About Trump’s ‘Mercurial’ Tariff Pause",
    "description": "President Donald Trump announced on Wednesday that he was putting a 90-day pause on the sweeping tariffs he imposed, plus an additional levy for China, sparking a stock market rally and garnering relieved but annoyed reactions from conservatives who openly ch…",
    "link": "https://www.mediaite.com/trump/this-is-all-so-stupid-conservatives-exhale-then-fume-about-trumps-mercurial-tariff-pause/",
    "timestamp": "2025-04-09T18:45:35Z"
  },
  {
    "title": "Crypto Products See $240,000,000 in Outflows Likely in Response to US Tariff Threats: CoinShares",
    "description": "Crypto asset manager and research firm CoinShares says US tariffs were the likely cause of an outflow of hundreds of millions of dollars last week from digital asset investment products. In its latest Digital Asset Fund Flows Weekly Report, CoinShares notes c…",
    "link": "https://dailyhodl.com/2025/04/09/crypto-products-see-240000000-in-outflows-likely-in-response-to-us-tariff-threats-coinshares/",
    "timestamp": "2025-04-09T18:45:12Z"
  },
  {
    "title": "Trump Admin Presses California Judge To Recuse Herself From Immigration Case Featuring Her Former Employer",
    "description": "The Trump administration is pressing a California judge to recuse herself from a lawsuit over funding for a federal immigration program, saying her past work for a plaintiff in the case creates \"concerning conflicts of interest that have created a serious app…",
    "link": "https://freebeacon.com/trump-administration/trump-admin-presses-california-judge-to-recuse-herself-from-immigration-case-featuring-her-former-employer/",
    "timestamp": "2025-04-09T18:45:07Z"
  },
  {
    "title": "Tevogen Announces Tevogen Generics, a New Effort in Support of President Trump’s Initiative to Encourage Pharmaceutical Manufacturing in United States",
    "description": "WARREN, N.J., April 09, 2025 (GLOBE NEWSWIRE) -- Tevogen (“Tevogen Bio Holdings Inc.” or “Company”) (Nasdaq: TVGN), today announces its newest effort: Tevogen Generics. This effort is in response to the growing national focus on pharmaceutical affordability a…",
    "link": "https://www.globenewswire.com/news-release/2025/04/09/3058814/0/en/Tevogen-Announces-Tevogen-Generics-a-New-Effort-in-Support-of-President-Trump-s-Initiative-to-Encourage-Pharmaceutical-Manufacturing-in-United-States.html",
    "timestamp": "2025-04-09T18:45:00Z"
  },
  {
    "title": "Elon Musk, conservatives drag Trump-appointed justice following Venezuelan deportations ruling",
    "description": "Conservatives are reeling after Supreme Court Justice Amy Coney Barrett joined liberal justices, dissenting in the 5-4 decision allowing the Trump administration to deport Venezuelan nationals.",
    "link": "https://www.foxnews.com/politics/elon-musk-conservatives-drag-trump-appointed-justice-following-venezuelan-deportations-ruling",
    "timestamp": "2025-04-09T18:44:43Z"
  },
  {
    "title": "Courtroom Coup: Ending the district judges' war on presidential authority",
    "description": "President Trump is doing everything he can to deliver on his promises, but rogue judges are undermining him.",
    "link": "https://www.foxnews.com/opinion/courtroom-coup-ending-district-judges-war-presidential-authority",
    "timestamp": "2025-04-09T18:43:59Z"
  },
  {
    "title": "Tariffs are bad news for batteries",
    "description": "Update: Since this story was first published in The Spark, our weekly climate newsletter, the White House announced that most reciprocal tariffs would be paused for 90 days. That pause does not apply to China, which will see an increased tariff rate of 125%. …",
    "link": "https://www.technologyreview.com/2025/04/09/1114736/tariffs-batteries/",
    "timestamp": "2025-04-09T18:43:58Z"
  },
  {
    "title": "Press Coalition Challenges Trump’s Executive Order Threatening Press Freedom and Legal Representation",
    "description": "Sixty-one media organizations and press freedom advocates filed an amicus brief warning of the chilling effect on First Amendment rights.\nThe post Press Coalition Challenges Trump’s Executive Order Threatening Press Freedom and Legal Representation appeared f…",
    "link": "https://theintercept.com/2025/04/09/trump-press-freedom-defense-fund/",
    "timestamp": "2025-04-09T18:43:52Z"
  },
  {
    "title": "Trump administration backs off Nvidia's H20 chip crackdown after Mar-a-Lago dinner: Report",
    "description": "The change in plans came after Nvidia promised the Trump administration new U.S. investments in AI data centers, the NPR report said. US President Donald Trump's administration was considering tightening restrictions on the AI leader's sales of its H20 chips …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/trump-administration-backs-off-nvidias-h20-chip-crackdown-after-mar-a-lago-dinner-report/articleshow/120137553.cms",
    "timestamp": "2025-04-09T18:43:00Z"
  },
  {
    "title": "Trump's 'Great Time to Buy' Claim Hours Before Tariff Pause Raises Insider Trading Concerns",
    "description": "President Donald Trump's post claiming it is a \"great time to buy\" hours before announcing a tariff pause has sparked concerns of possible insider trading.",
    "link": "https://www.ibtimes.com/trumps-great-time-buy-claim-hours-before-tariff-pause-raises-insider-trading-concerns-3769452",
    "timestamp": "2025-04-09T18:42:59Z"
  },
  {
    "title": "I operate a small Judaica business. Trump’s tariffs will squelch Jewish innovation",
    "description": "If you thought the cost of living Jewishly was already high, wait until you see what happens next.",
    "link": "https://www.jpost.com/opinion/article-849554",
    "timestamp": "2025-04-09T18:42:41Z"
  },
  {
    "title": "CNN Analyst Hints at Negative Impact of Trump’s 90-Day Tariff Pause: ‘Don’t Know How You Could Possibly Think the US Is a Sound’ Place to Invest",
    "description": "A financial analyst Wednesday explained why President Donald Trump's decision to pause tariffs could actually have negative long-term impact.\nThe post CNN Analyst Hints at Negative Impact of Trump’s 90-Day Tariff Pause: ‘Don’t Know How You Could Possibly Thin…",
    "link": "https://www.mediaite.com/news/cnn-analyst-hints-at-negative-impact-of-trumps-90-day-tariff-pause-dont-know-how-you-could-possibly-think-the-us-is-a-sound-place-to-invest/",
    "timestamp": "2025-04-09T18:42:25Z"
  },
  {
    "title": "'This Is Cowardice': House GOP Sneakily Tries to Shield Trump Tariff Powers",
    "description": "House Republicans have reportedly inserted \nlanguage into a procedural measure that would effectively prevent the chamber from voting on resolutions to curtail U.S. President Donald Trump's authority to impose tariffs unilaterally, a move that Democratic lawm…",
    "link": "https://www.commondreams.org/news/republicans-on-trump-tariffs",
    "timestamp": "2025-04-09T18:42:23Z"
  },
  {
    "title": "In Yet Another Cruel Blow To China, General Tso’s Chicken To Be Renamed ‘General Don's Oriental Chicky Nugs’",
    "description": "WASHINGTON, D.C. — Global tensions over tariffs continued to rise amid the ongoing trade war, as the White House announced that General Tso's Chicken would be renamed General Don's Oriental Chicky Nugs. The renaming of the popular Chinese dish was only the la…",
    "link": "https://freerepublic.com/focus/f-chat/4309991/posts",
    "timestamp": "2025-04-09T18:42:06Z"
  },
  {
    "title": "Trump Pauses Higher Duties on Most Nations, Hikes China Rate",
    "description": "President Donald Trump announced a 90-day pause on higher reciprocal tariffs that hit dozens of trade partners after midnight, while raising duties on China to 125%.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-pauses-higher-duties-on-most-nations-hikes-china-rate",
    "timestamp": "2025-04-09T18:41:59Z"
  },
  {
    "title": "Is Trump “Insane”? Investors Freak Out About His Economic Policies",
    "description": "As Donald Trump’s tariff plan slams the stock market, investors are beginning to wonder if the president doesn’t have some broader economic agenda—but rather if he’s just mentally ill.\r\n“In the last few days, we have had many conversations with macro fund man…",
    "link": "https://newrepublic.com/post/193805/donald-trump-investors-freak-out-economic-policies",
    "timestamp": "2025-04-09T18:41:47Z"
  },
  {
    "title": "Wallets Linked to President Trump’s World Liberty Financial Selling Ethereum at a Loss: Lookonchain",
    "description": "Data from blockchain intelligence firm Lookonchain suggests that crypto wallets associated with President Donald Trump-backed decentralized finance (DeFi) platform World Liberty Financial (WLFI) are selling Ethereum (ETH) at a loss. Citing data from Arkham, L…",
    "link": "https://dailyhodl.com/2025/04/09/wallets-linked-to-president-trumps-world-liberty-financial-selling-ethereum-at-a-loss-lookonchain/",
    "timestamp": "2025-04-09T18:41:32Z"
  },
  {
    "title": "Trump favorite Jon Husted launches 2026 U.S. Senate campaign in Ohio",
    "description": "U.S. Sen. Jon Husted of Ohio has launched a bid to retain his seat with the backing of President Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-favorite-jon-husted-launches-2026-us-senate-120650433",
    "timestamp": "2025-04-09T18:41:23Z"
  },
  {
    "title": "Senate approves Peter Hoekstra as next US ambassador to Canada",
    "description": "The Senate approved Peter Hoekstra to be the next US ambassador to Canada amid one of the toughest times in Washington's relationship with Ottawa as the tariff war heats up.",
    "link": "https://www.foxnews.com/world/senate-approves-peter-hoekstra-next-us-ambassador-canada",
    "timestamp": "2025-04-09T18:40:21Z"
  },
  {
    "title": "Nasdaq jumps over 10% after Trump's tariff pause; Tesla spikes 18%, Nvidia 16%",
    "description": "Nasdaq jumped more than 10% as stocks hit a rebound from lows after US President Donald Trump announced a 90-day pause on tariffs imposed worldwide, except China upon which he raised duties to 125%.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-jumps-over-10-after-trumps-tariff-pause-tesla-spikes-18-nvidia-16/articleshow/120137513.cms",
    "timestamp": "2025-04-09T18:40:06Z"
  },
  {
    "title": "Trump suspends tariffs, markets surge",
    "description": "The News\nStocks surged Wednesday after US President Donald Trump announced a 90-day tariff reprieve for most countries, even as he ramped up tariffs on China to 125%.\nWhite House officials said the tariff level for other countries, scores of which have sought…",
    "link": "https://biztoc.com/x/6c260072f70157b7",
    "timestamp": "2025-04-09T18:39:54Z"
  },
  {
    "title": "US resurrects: Dow up over 2,000 pts, Nasdaq up 8%",
    "description": "The United States stock markets continued to thrive on Wednesday as United States President Donald Trump dropped a bombshell, stating that tariffs on most countries will be postponed, while duties on ...",
    "link": "https://biztoc.com/x/5de745d4bc2e9d04",
    "timestamp": "2025-04-09T18:39:51Z"
  },
  {
    "title": "Smithsonian under fire: Trump orders an ideological purge",
    "description": "\"For someone who claims to abhor censorship, Donald Trump sure has a funny way of showing it,\" said Issie Lapowsky in Vanity Fair. In his latest attempt to police thought in America, the president issued an executive order last week that aims to control museu…",
    "link": "https://biztoc.com/x/e99750b1f3b97286",
    "timestamp": "2025-04-09T18:39:50Z"
  },
  {
    "title": "House Republicans forge ahead with budget vote as holdouts dig in",
    "description": "Some conservatives in the narrowly divided House remain opposed to the budget blueprint, even as Trump has dialed up the pressure on them to fall in line.",
    "link": "https://www.nbcnews.com/politics/congress/house-republican-budget-vote-trump-agenda-rcna200422",
    "timestamp": "2025-04-09T18:39:21Z"
  },
  {
    "title": "Stocks Surge After Trump Pauses Some Tariffs, Raises Taxes on Chinese Imports",
    "description": "Global markets surged after President Trump abruptly backed down on imposing tariffs on most nations for 90 days.",
    "link": "https://time.com/7276107/trump-tariff-pause/",
    "timestamp": "2025-04-09T18:38:22Z"
  },
  {
    "title": "Trump pauses tariffs for 90 days but hits China harder",
    "description": "While all other countries in trade with the US will receive a 10 per cent tariff, US President Donald Trump hit back with higher tariffs on China - to 125%.",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-90-day-pause-china-125-cent-raise-5055626",
    "timestamp": "2025-04-09T18:38:08Z"
  },
  {
    "title": "What is a gravity bomb? US ramps up production for new nuclear weapon amid World War III fears",
    "description": "US President Donald Trump's tariff war has rocked global markets and could trigger significant shifts in the world order. Initially dismissed as a mere threat during his campaign, the tariffs unleashed by Trump from the White House have escalated, with China …",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/what-is-a-gravity-bomb-us-ramps-up-production-for-new-nuclear-weapon-amid-world-war-iii-fears/articleshow/120137359.cms",
    "timestamp": "2025-04-09T18:36:56Z"
  },
  {
    "title": "Stocks Surge as Trump Increases Tariffs On China Even Further, Pauses Them For Non-retaliating Countries",
    "description": "Donald Trump further raised tariffs on China to 125% and announced a \"pause, and a substantially lowered reciprocal tariff\" to countries that have not imposed retaliatory measures on the U.S.",
    "link": "https://www.ibtimes.com/stocks-surge-trump-increases-tariffs-china-even-further-pauses-them-non-retaliating-countries-3769445",
    "timestamp": "2025-04-09T18:36:37Z"
  },
  {
    "title": "Whoopi Goldberg Falsely Claims Egg Prices Have Not Fallen ‘One Cent’ Since Trump Took Office",
    "description": "\"The View\" co-host Whoopi Goldberg falsely claimed on Wednesday that egg prices have not fallen by \"one cent\" since President Donald Trump took office.",
    "link": "https://dailycaller.com/2025/04/09/the-view-whoopi-goldberg-egg-prices-trump/",
    "timestamp": "2025-04-09T18:36:29Z"
  },
  {
    "title": "Amazon To Launch First Batch Of Satellites Rivaling Musk",
    "description": "The US retail giant Amazon is preparing to launch Wednesday its first full batch of Project Kuiper satellites, marking a crucial milestone in the battle with Elon Musk's Starlink to provide high-speed internet.",
    "link": "https://www.ibtimes.com/amazon-launch-first-batch-satellites-rivaling-musk-3769450",
    "timestamp": "2025-04-09T18:36:16Z"
  },
  {
    "title": "Trump Stuns With Tariffs Reversal But Hits China Harder",
    "description": "US President Donald Trump abruptly backed down Wednesday in his global trade war with a 90 day tariff pause for most countries -- but slapped even more levies against China in what has become a brutal duel between the world's two largest economies.",
    "link": "https://www.ibtimes.com.au/trump-stuns-tariffs-reversal-hits-china-harder-1857722",
    "timestamp": "2025-04-09T18:36:12Z"
  },
  {
    "title": "Gabbard launches task force to root out politics in intel | Honolulu Star-Advertiser",
    "description": "Tulsi Gabbard, the director of national intelligence, announced on Tuesday a new task force that would work on declassifying information in the public interest and improving efficiency inside the intelligence agencies.",
    "link": "https://www.staradvertiser.com/2025/04/09/breaking-news/gabbard-launches-task-force-to-root-out-politics-in-intel/",
    "timestamp": "2025-04-09T18:35:57Z"
  },
  {
    "title": "Donald Trump was given grave warning over Chinese tariffs during first term as president",
    "description": "Donald Trump was warned about his 'obsession' with China years ago by former Australian Prime Minister Malcolm Turnbull",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-tariffs-china-malcolm-turnbull-warning-657171-20250409",
    "timestamp": "2025-04-09T18:35:26Z"
  },
  {
    "title": "Smithsonian under fire: Trump orders an ideological purge",
    "description": "The president has issued an executive order to control Smithsonian exhibits and restore removed statues linked to slavery",
    "link": "https://theweek.com/culture-life/art/smithsonian-trump-ideological-purge",
    "timestamp": "2025-04-09T18:34:24Z"
  },
  {
    "title": "The market rips higher on Trump's tariff pause. Here are big portfolio rebound stocks",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/04/09/the-market-rips-higher-on-trumps-tariff-pause-here-are-big-rebound-stocks.html",
    "timestamp": "2025-04-09T18:33:37Z"
  },
  {
    "title": "House GOP moves to prevent votes on rescinding Trump tariffs",
    "description": "House Republicans are exhausting all legislative tools to prevent future votes on repealing Donald Trump's tariffs -- doubling down on their support for his policies.",
    "link": "https://abcnews.go.com/Politics/house-gop-moves-prevent-votes-rescinding-trump-tariffs/story?id=120644968",
    "timestamp": "2025-04-09T18:32:55Z"
  },
  {
    "title": "'Presidential betrayal': What Republicans believe Trump 'owes' loyalist Elise Stefanik",
    "description": "When President Donald Trump announced last month that he was pulling his MAGA loyalist Rep. Elise Stefanik's (R-NY) nomination to be United States ambassador to the United Nations, it marked a low point in her career.However, a new report claims that Stefanik…",
    "link": "https://www.rawstory.com/presidential-betrayal-what-republicans-believe-trump-owes-maga-loyalist-elise-stefani/",
    "timestamp": "2025-04-09T18:32:36Z"
  },
  {
    "title": "Nuclear threat is on! North Korean leader Kim Jong Un's powerful sister sends shocking warning message to Washington",
    "description": "North Korean leader Kim Jong's sister Kim Yo Jong looks after country's foreign policy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/nuclear-threat-is-on-north-korean-leader-kim-jong-uns-powerful-sister-sends-shocking-warning-message-to-washington/articleshow/120137166.cms",
    "timestamp": "2025-04-09T18:32:26Z"
  },
  {
    "title": "Dem takes aim at Trump, Tillis in 2026 Senate launch video for 'tanking our economy'",
    "description": "Democrat former Rep. Wiley Nickel is aiming to unseat GOP Sen. Thom Tillis in 2026, saying the North Carolina Republican is helping President Donald Trump in \"tanking our economy.\"",
    "link": "https://www.foxnews.com/politics/dem-takes-aim-trump-tillis-2026-senate-launch-video-tanking-our-economy",
    "timestamp": "2025-04-09T18:32:13Z"
  },
  {
    "title": "Media Stocks Skyrocket With Dow Up 2,700 Points As Donald Trump Pauses Latest Round Of Tariffs",
    "description": "“BE COOL!” urged President Donald Trump early Wednesday amid widespread dismay at global tariffs that went into effect overnight. By mid-afternoon, facing massive blowback, he reversed course, announcing a 90-days suspension of most new import taxes, fueling …",
    "link": "http://deadline.com/2025/04/media-stocks-markets-surge-donald-trump-pauses-most-tariffs-1236364548/",
    "timestamp": "2025-04-09T18:32:06Z"
  },
  {
    "title": "Trump Can Fire Probationary Workers, Appeals Court Says",
    "description": "The decision was in response to a lawsuit from nearly two dozen states alleging the Trump administration violated federal law by not following common procedure when firing thousands of employees.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/09/trump-can-fire-probationary-workers-appeals-court-says/",
    "timestamp": "2025-04-09T18:31:41Z"
  },
  {
    "title": "Warner Bros. Discovery, Netflix, Disney and More Media Stocks Rally as Trump Sets 90-Day Pause on Tariffs for Some Countries",
    "description": "The S&P 500 jumped nearly 8% Wednesday following President Donald Trump’s announcement that a 90-day pause would be put on the proposed tariffs for non-retaliating countries. That does not include China, which will see a 125% tax rate increase on imported goo…",
    "link": "https://variety.com/2025/tv/news/stock-market-rally-trump-tariffs-pause-1236364876/",
    "timestamp": "2025-04-09T18:31:35Z"
  },
  {
    "title": "For this year, Trump executive order on voting steers clear of Arlington",
    "description": "At least for the time being, a new executive order on election matters is unlikely to impact Arlington. Virginia \"already does\" many of the things included in the executive order that President Donald Trump signed on March 25, county registrar Gretchen Reinem…",
    "link": "https://www.arlnow.com/2025/04/09/for-this-year-trump-executive-order-on-voting-steers-clear-of-arlington/",
    "timestamp": "2025-04-09T18:30:13Z"
  },
  {
    "title": "US Stock Market Turmoil: Should You Ride Out Tariff Fallout or Buy the Dip?",
    "description": "Don't give in to panic. Experts say the best strategy is to stay the course.",
    "link": "https://www.cnet.com/personal-finance/investing/us-stock-market-turmoil-should-you-ride-out-tariff-fallout-or-buy-the-dip/",
    "timestamp": "2025-04-09T18:30:00Z"
  },
  {
    "title": "Donald Trump backs down in global trade war",
    "description": "Washington scraps most tariffs against countries that have not retaliated but increases levies on China",
    "link": "https://biztoc.com/x/8a54ebf32c3e9d11",
    "timestamp": "2025-04-09T18:28:49Z"
  }
]