[
  {
    "title": "Musk said 'Trump would have lost the election' without him",
    "description": "Elon Musk posted a message on X that read, \"Without me, Trump would have lost the election, Dems would control the House and the Republicans would be 51-49 in the Senate.\"",
    "link": "https://www.snopes.com//fact-check/musk-trump-2024-election-results/",
    "timestamp": "2025-06-05T21:11:00Z"
  },
  {
    "title": "Here’s how much Elon Musk’s government contracts are really worth — as Trump threatens to cut them",
    "description": "As the war of the words erupts between President Trump and SpaceX CEO Elon Musk, the commander in chief has threatened to sever ties with the tech titan's businesses, which adds up to at least $38 billion.",
    "link": "https://nypost.com/2025/06/05/us-news/heres-how-much-elon-musks-government-contracts-are-really-worth/",
    "timestamp": "2025-06-05T21:10:29Z"
  },
  {
    "title": "Trump’s travel ban sparks confusion and fear among affected families",
    "description": "The travel ban goes into effect on Monday, leaving many to fear a future in which they can't visit family or loved ones are unable to escape dire circumstances in their home countries.",
    "link": "https://www.nbcnews.com/news/us-news/trump-travel-ban-sparks-confusion-affected-families-rcna211169",
    "timestamp": "2025-06-05T21:10:28Z"
  },
  {
    "title": "Trump compares Ukraine-Russia war to children’s brawl: ‘Sometimes you’re better off letting them fight’ | CNN Politics",
    "description": "Trump compares Ukraine-Russia war to children’s brawl: ‘Sometimes you’re better off letting them fight’ | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/06/05/politics/ukraine-war-trump-kids-fighting",
    "timestamp": "2025-06-05T21:10:26Z"
  },
  {
    "title": "Donald Trump’s travel ban: Why? And why now?",
    "description": "US administration says order aims to keep America safe, but advocates say 'arbitrary' ban will keep families apart.",
    "link": "https://www.aljazeera.com/news/2025/6/5/donald-trumps-travel-ban-why-and-why-now",
    "timestamp": "2025-06-05T21:10:07Z"
  },
  {
    "title": "Musk and Trump’s lover’s quarrel for the ages",
    "description": "The US president and his former lap DOGE are engaged in one of the great social media spats as their previously cosy relationship implodes, and it's bye-bye to Tasmanian Premier Jeremy Rockliff after a vote of no confidence. \nThe post Musk and Trump’s lover’s…",
    "link": "http://www.crikey.com.au/2025/06/06/elon-musk-donald-trump-jeremy-rockliff-tasmania/",
    "timestamp": "2025-06-05T21:09:43Z"
  },
  {
    "title": "Tesla Crashes as Musk Turns Against Trump and GOP Tax Cut Bill",
    "description": "Musk's turn against Trump triggers a $180 billion drop in the company’s market value.\nThe post Tesla Crashes as Musk Turns Against Trump and GOP Tax Cut Bill appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/05/tesla-crashes-as-musk-turns-against-trump-and-gop-tax-cut-bill/",
    "timestamp": "2025-06-05T21:09:16Z"
  },
  {
    "title": "Tesla Stock Continues to Crash as Musk vs. Trump Feud Goes Nuclear",
    "description": "The rapidly escalating feud between President Donald Trump and Elon Musk has not only stunned the political media world but also caused Tesla's stock price to plummet throughout the day Thursday.\nThe post Tesla Stock Continues to Crash as Musk vs. Trump Feud …",
    "link": "https://www.mediaite.com/media/news/tesla-stock-continues-to-crash-as-musk-vs-trump-feud-goes-nuclear/",
    "timestamp": "2025-06-05T21:09:02Z"
  },
  {
    "title": "Trump’s DHS shuts down airline passenger surveillance program",
    "description": "Scheme that tracked Tulsi Gabbard failed to 'stop a single terrorist attack'",
    "link": "https://www.wnd.com/2025/06/trumps-dhs-shuts-down-airline-passenger-surveillance-program/",
    "timestamp": "2025-06-05T21:05:16Z"
  },
  {
    "title": "Israel said to have assured US it won't attack Iran unless talks fail",
    "description": "Israel supposedly told the White House it won't attack Iran's nuclear facilities unless United States President Donald Trump signals that talks with Tehran have reached a dead end, Axios repor...",
    "link": "https://biztoc.com/x/9884e6198c6707b6",
    "timestamp": "2025-06-05T21:04:41Z"
  },
  {
    "title": "U.S. CISA adds Google Chromium V8 flaw to its Known Exploited Vulnerabilities catalog",
    "description": "U.S. Cybersecurity and Infrastructure Security Agency (CISA) adds a Google Chromium V8 vulnerability to its Known Exploited Vulnerabilities catalog. The U.S. Cybersecurity and Infrastructure Security Agency (CISA) added Google Chromium V8 Out-of-Bounds Read a…",
    "link": "https://securityaffairs.com/178678/security/u-s-cisa-google-chromium-v8-flaw-known-exploited-vulnerabilities-catalog.html",
    "timestamp": "2025-06-05T21:03:56Z"
  },
  {
    "title": "Israel won't launch Iran attack unless US negotiations fail",
    "description": "One official told Axios that Israel made it clear to the US that they wouldn't surprise the Trump administration with any attacks on Iran without informing the US first.",
    "link": "https://www.jpost.com/israel-news/article-856771",
    "timestamp": "2025-06-05T21:03:35Z"
  },
  {
    "title": "Mark Carney directly negotiating with Donald Trump to end trade war",
    "description": "Ontario Premier Doug Ford said the prime minister is in 'deep, deep discussions right now with... President Trump.'",
    "link": "https://nationalpost.com/news/carney-directly-negotiating-with-trump-to-end-trade-war",
    "timestamp": "2025-06-05T21:02:47Z"
  },
  {
    "title": "Don Johnson Reveals He Smoked Pot At The White House",
    "description": "The \"Miami Vice\" actor revealed he'd had some wild times in Washington D.C. during a stop by \"Jimmy Kimmel Live!\"",
    "link": "https://www.huffpost.com/entry/don-johnson-smoking-pot-white-house_n_6841e8a3e4b0a8e2861b44b7",
    "timestamp": "2025-06-05T21:02:46Z"
  },
  {
    "title": "Musk says SpaceX will decommission Dragon spacecraft after Trump threat",
    "description": "Elon Musk on Thursday said that his company SpaceX will begin decommissioning its Dragon spacecraft “immediately” because of threats by President Donald Trump to cancel government contracts with Musk’s businesses. Musk’s announcement, on his social media site…",
    "link": "https://freerepublic.com/focus/f-news/4321215/posts",
    "timestamp": "2025-06-05T21:02:31Z"
  },
  {
    "title": "Bitcoin Threatens $100K, Crypto Losses Grow as Musk/Trump Feud Goes Nuclear",
    "description": "Musk accused Trump of being implicated with Jeffrey Epstein, while Trump threatened to terminate all of his government contracts.",
    "link": "https://www.coindesk.com/markets/2025/06/05/bitcoin-threatens-100k-crypto-losses-grow-as-musktrump-feud-goes-nuclear",
    "timestamp": "2025-06-05T21:01:37Z"
  },
  {
    "title": "Live: ASX set to slip after Trump-Musk feud triggers sell-off on Wall Street",
    "description": "The Australian share market is in for a lacklustre start after closing flat on Thursday. Follow the day's events and insights from our business reporters on the ABC News live markets blog.",
    "link": "https://www.abc.net.au/news/2025-06-06/asx-markets-business-live-news-date-year/105383750",
    "timestamp": "2025-06-05T21:01:28Z"
  },
  {
    "title": "Karine Jean-Pierre hoped to be a co-host on 'The View' after exiting Biden White House: Report",
    "description": "Karine Jean-Pierre reportedly wanted to co-host \"The View,\" a former Biden official told Politico, as the ex-press secretary announced she was writing revealing a new book.",
    "link": "https://www.foxnews.com/media/karine-jean-pierre-hoped-co-host-the-view-after-exiting-biden-white-house-report",
    "timestamp": "2025-06-05T21:00:52Z"
  },
  {
    "title": "Exclusive: 'I have done nothing wrong.' Lawyer says DHS called her 'suspected terrorist'",
    "description": "Lawyer Celine Atallah said she's the \"known or suspected terrorist\" mentioned in a Homeland Security statement. “I have done nothing wrong,\" she said.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/05/jeanne-shaheen-husband-dhs-terrorist-celine-attalah/84056413007/",
    "timestamp": "2025-06-05T20:59:53Z"
  },
  {
    "title": "The Trump-Musk Feud Heard Round the World",
    "description": "Sasha Abramsky\n\n\n\nQuite frankly, I’m rooting for each of them to destroy the other.\r\n\n\r\n\n\nThe post The Trump-Musk Feud Heard Round the World appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-musk-feud/",
    "timestamp": "2025-06-05T20:59:36Z"
  },
  {
    "title": "Elon Musk Blows Up Internet & Maybe DC With Claim That Trump Is In Epstein Files: “Holy Sh*t”",
    "description": "The war of words and tweets between Donald Trump and his top donor Elon Musk just went nuclear. As the former DOGE chief and POTUS tossed slings and arrows at each other over the president’s “Big Beautiful Bill’s” effect on the federal deficit and whether or …",
    "link": "http://deadline.com/2025/06/trump-musk-epstein-files-claim-reaction-1236425119/",
    "timestamp": "2025-06-05T20:59:26Z"
  },
  {
    "title": "Volatility Slows IPOs But No Cause for Panic, NYSE’s Martin Says",
    "description": "The US tariff war has spurred a surge in trading volatility and delayed initial public offerings, but shouldn’t keep investors out of the market, said NYSE Group President Lynn Martin.",
    "link": "https://financialpost.com/pmn/business-pmn/volatility-slows-ipos-but-no-cause-for-panic-nyses-martin-says",
    "timestamp": "2025-06-05T20:59:12Z"
  },
  {
    "title": "Here’s 5 Huge Reasons Donald Trump Is Absolutely Scared of Elon Musk",
    "description": "Elon Musk keeps attacking Trump on and Trump \nThe post Here’s 5 Huge Reasons Donald Trump Is Absolutely Scared of Elon Musk appeared first on The Root.",
    "link": "https://www.theroot.com/heres-5-huge-reasons-donald-trump-is-absolutely-scared-2000043973",
    "timestamp": "2025-06-05T20:58:34Z"
  },
  {
    "title": "Elon Musk says he'll 'decommission' SpaceX's Dragon after Trump threatens his businesses",
    "description": "Elon Musk said SpaceX would decommission its Dragon spacecraft, used by NASA, after Trump threatened his government contracts.",
    "link": "https://www.businessinsider.com/elon-musk-spacex-decommission-dragon-ship-trump-threat-2025-6",
    "timestamp": "2025-06-05T20:55:01Z"
  },
  {
    "title": "NATO boss demands huge military spending hike",
    "description": "Mark Rutte has said he will propose a target of 5% of member states’ GDP at the bloc’s upcoming summit in The Hague Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618714-nato-rutte-military-spending-increase-summit/",
    "timestamp": "2025-06-05T20:54:41Z"
  },
  {
    "title": "Tesla stock plunges as Musk’s feud with Trump over GOP tax bill spooks investors",
    "description": "By BERNARD CONDON, Associated Press\nShares of Elon Musk’s electric vehicle maker fell sharply Thursday as investors feared his dispute with President Donald Trump will hurt the company.\nTesla closed down more than 14% as a disagreement over the U.S. president…",
    "link": "https://biztoc.com/x/29901de9c36504b1",
    "timestamp": "2025-06-05T20:53:45Z"
  },
  {
    "title": "Musk says SpaceX will decommission Dragon spacecraft after Trump threat",
    "description": "Elon Musk on Thursday said that his company SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" because of threats by President Donald Trump to cancel government contracts with Musk's businesses.\nMusk's announcement, on his social media site…",
    "link": "https://biztoc.com/x/64e6b5bbd1e551df",
    "timestamp": "2025-06-05T20:53:42Z"
  },
  {
    "title": "‘Clinging to hope’: Harvard students slam latest Trump visa ban",
    "description": "Donald Trump’s late night proclamation blocking Harvard’s new international students has sparked fear and anger among existing students left in limbo amid the escalating showdown between the president and their university. Alfred Williamson, a Welsh-Danish ph…",
    "link": "https://www.digitaljournal.com/world/clinging-to-hope-harvard-students-slam-latest-trump-visa-ban/article",
    "timestamp": "2025-06-05T20:53:26Z"
  },
  {
    "title": "‘I’m the Next Person on Their List’",
    "description": "Representative LaMonica McIver spoke with the Cut about the charges Trump’s DOJ brought against her and how Democrats can continue to stand up to the president.",
    "link": "http://www.thecut.com/article/congresswoman-lamonica-mciver-charges-alleged-ice-assault.html",
    "timestamp": "2025-06-05T20:53:05Z"
  },
  {
    "title": "Elon Musk Net Worth Drops About $30 Billion Amid Trump Feud",
    "description": "Elon Musk‘s net worth is dipping. The 53-year-old world’s richest man’s company, Tesla, faced a steep 14% plunge on Thursday (June 5) as Elon continues to battle it out with his former political friend, President Donald Trump. He is now $26.6 billion less ric…",
    "link": "https://www.justjared.com/2025/06/05/elon-musk-net-worth-drops-about-30-billion-amid-trump-feud/",
    "timestamp": "2025-06-05T20:51:34Z"
  },
  {
    "title": "SpaceX will decommission Dragon spacecraft, Musk says as feud with Trump escalates",
    "description": "(Reuters) -Elon Musk's rocket company SpaceX will begin decommissioning its Dragon spacecraft immediately, the billionaire said on Thursday in response to U.S. President Donald Trump's statement that the government should cancel Musk's federal contracts. Read…",
    "link": "https://www.thestar.com.my/news/world/2025/06/06/spacex-will-decommission-dragon-spacecraft-musk-says-as-feud-with-trump-escalates",
    "timestamp": "2025-06-05T20:51:00Z"
  },
  {
    "title": "This Clash With Trump Is Going to End Poorly for Elon Musk",
    "description": "As the world’s richest man limps away from Washington, he will be, if nothing else, a cautionary tale.",
    "link": "http://nymag.com/intelligencer/article/trump-elon-musk-fight-loser.html",
    "timestamp": "2025-06-05T20:50:45Z"
  },
  {
    "title": "MYTHBUSTER: The One Big Beautiful Bill Cuts Spending, Deficit — and That’s a Fact",
    "description": "By every honest metric, President Donald J. Trump’s One Big Beautiful Bill dramatically improves the fiscal trajectory of the United States and unleashes an era of unprecedented economic growth.HOAX: The One Big Beautiful Bill increases spending.FACT: The One…",
    "link": "https://freerepublic.com/focus/f-news/4321213/posts",
    "timestamp": "2025-06-05T20:50:27Z"
  },
  {
    "title": "Brazil Drags Jair Bolsonaro into Investigation of Son for Denouncing Rogue Court Attacks",
    "description": "Brazil's Federal Police called former President Jair Bolsonaro to testify on Thursday as part of a probe into the actions of his son Eduardo.\nThe post Brazil Drags Jair Bolsonaro into Investigation of Son for Denouncing Rogue Court Attacks appeared first on B…",
    "link": "https://www.breitbart.com/latin-america/2025/06/05/brazil-drags-jair-bolsonaro-into-investigation-son-denouncing-rogue-court-attacks/",
    "timestamp": "2025-06-05T20:49:37Z"
  },
  {
    "title": "Elon Musk Declares That He's \"Immediately\" Cutting Off NASA's Access to Space",
    "description": "Billionaire Elon Musk has countered president Donald Trump's threat to \"terminate Elon’s Governmental Subsidies and Contracts,\" threatening to permanently cut the United States off from space. \"In light of the President’s statement about cancellation of my go…",
    "link": "https://futurism.com/elon-musk-cutting-off-nasa",
    "timestamp": "2025-06-05T20:49:18Z"
  },
  {
    "title": "Best social media reactions to Aaron Rodgers signing with the Pittsburgh Steelers",
    "description": "From Donald Trump-Elon Musk quips to existential realms, social media nailed the jokes when news dropped Aaron Rodgers was headed to Pittsburgh.",
    "link": "https://thelistwire.usatoday.com/story/sports/2025/06/05/aaron-rodgers-signs-pittsburgh-steelers-social-media-reactions/84055252007/",
    "timestamp": "2025-06-05T20:49:04Z"
  },
  {
    "title": "NATO likely to hike defense spending, despite economic concerns",
    "description": "The military alliance looks set to satisfy US President Donald Trump's demands to commit to a massive increase in defense spending. Some creative counting proposed by NATO head Mark Rutte could soften the financial blow. A NATO defense ministers' meeting in B…",
    "link": "https://www.dw.com/en/nato-defense-spending-boost-economic-concerns-trump/a-72809085",
    "timestamp": "2025-06-05T20:49:00Z"
  },
  {
    "title": "NATO likely to hike defense spending, amid economic concerns",
    "description": "The military alliance looks set to satisfy US President Donald Trump's demands to commit to a massive increase in defense spending. Some creative counting proposed by NATO head Mark Rutte could soften the financial blow. NATO defense ministers meeting in Brus…",
    "link": "https://www.dw.com/en/nato-likely-to-hike-defense-spending-amid-economic-concerns/a-72809085",
    "timestamp": "2025-06-05T20:49:00Z"
  },
  {
    "title": "Elon Musk Donald Trump Breakup",
    "description": "The Elon Musk Donald Trump Breakup refers to a feud and falling out between United States President Donald Trump and Tesla and X CEO Elon Musk regarding Trump's \"One Big Beautiful Bill\" (OBBB) act. In late May 2025, it was reported that Musk was leaving the T…",
    "link": "https://knowyourmeme.com/memes/events/elon-musk-donald-trump-breakup",
    "timestamp": "2025-06-05T20:48:41Z"
  },
  {
    "title": "Watch: D-Day 'not a pleasant day for you', Trump tells German chancellor",
    "description": "This is the first meeting between both leaders since Friedrich Merz won the election on 6 May.",
    "link": "https://www.bbc.com/news/videos/c989r2569y4o",
    "timestamp": "2025-06-05T20:48:17Z"
  },
  {
    "title": "Tesla stock plunges as Musk’s feud with Trump over GOP tax bill spooks investors",
    "description": "Tesla closed down more than 14% as a disagreement over the U.S. president’s budget bill turned nasty.",
    "link": "https://www.denverpost.com/2025/06/05/trump-musk-tesla-stock/",
    "timestamp": "2025-06-05T20:48:04Z"
  },
  {
    "title": "Tesla stock plunges as Musk’s feud with Trump over GOP tax bill spooks investors",
    "description": "Tesla closed down more than 14% as a disagreement over the U.S. president’s budget bill turned nasty.",
    "link": "https://www.bostonherald.com/2025/06/05/trump-musk-tesla-stock/",
    "timestamp": "2025-06-05T20:48:04Z"
  },
  {
    "title": "A Timeline of Elon Musk's and Donald Trump's Bromance",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump and Elon Musk are facing a rift in their relationship over the president's \"Big Beautiful Bill,\" after the pair emerged as close allies during the 2024 presidential election.\nWhy It Matt…",
    "link": "https://biztoc.com/x/5212cf79ea1d0894",
    "timestamp": "2025-06-05T20:47:34Z"
  },
  {
    "title": "Ron DeSantis' PAC Defends Musk as Billionaire's Feud With Trump Explodes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nAs the public feud between billionaire Elon Musk and President Donald Trump exploded this week, a political action committee supporting Florida Governor Ron DeSantis stepped forward to defend Musk's record.\nTh…",
    "link": "https://biztoc.com/x/cc19540f5797e442",
    "timestamp": "2025-06-05T20:47:25Z"
  },
  {
    "title": "The Musk-Trump Implosion Can Be Seen From Space",
    "description": "It’s a breakup that stands to shake up Trump's entire second term. And we are all in the blast radius.",
    "link": "https://time.com/7291550/elon-musk-trump-implosion-can-be-seen-from-space/",
    "timestamp": "2025-06-05T20:47:23Z"
  },
  {
    "title": "US slaps sanctions on four ICC judges over Israel, US cases",
    "description": "The United States on Thursday imposed sanctions on four judges at the International Criminal Court including over an arrest warrant for Israeli Prime Minister Benjamin Netanyahu, ramping up pressure on The Hague-based court of last resort. The four judges, al…",
    "link": "https://www.digitaljournal.com/world/us-slaps-sanctions-on-four-icc-judges-over-israel-us-cases/article",
    "timestamp": "2025-06-05T20:47:20Z"
  },
  {
    "title": "Yes, Musk alleged Trump appears in the Epstein files",
    "description": "Tech billionaire and Tesla CEO Elon Musk posted on X that U.S. President Donald Trump \"is in the [Jeffrey] Epstein files,\" and that, \"That is the real reason they have not been made public.\"",
    "link": "https://www.snopes.com//fact-check/elon-musk-epstein-trump/",
    "timestamp": "2025-06-05T20:47:00Z"
  },
  {
    "title": "SpaceX will decommission Dragon spacecraft, Musk says as feud with Trump escalates",
    "description": "NASA relies on SpaceX's Dragon spacecraft to ferry astronauts to and from the International Space Station under a contract worth roughly $4.9 billion...",
    "link": "https://www.yahoo.com/news/spacex-decommission-dragon-spacecraft-musk-204603534.html",
    "timestamp": "2025-06-05T20:46:03Z"
  },
  {
    "title": "Critics have meltdown and accuse Trump of imposing renewed 'Muslim ban' through 'disgusting' travel order",
    "description": "Democrat lawmakers and social media critics are accusing President Donald Trump of rolling out a \"bigoted\" travel ban they say is riddled with \"Islamophobia.\"",
    "link": "https://www.foxnews.com/politics/critics-meltdown-trump-imposing-renewed-muslim-ban-via-disgusting-travel-order-after-terror-attack",
    "timestamp": "2025-06-05T20:45:51Z"
  },
  {
    "title": "Ron DeSantis' PAC Defends Musk as Billionaire's Feud With Trump Explodes",
    "description": "Ron DeSantis' PAC stepped up to defend Musk as the billionaire's public spat with Trump boiled over.",
    "link": "https://www.newsweek.com/ron-desantis-trump-elon-musk-feud-2081702",
    "timestamp": "2025-06-05T20:44:33Z"
  },
  {
    "title": "Elon Musk responds 'yes' to post calling for Trump's impeachment as pair exchange barbs",
    "description": "Their sparring hammered shares of Musk's electric vehicle maker Tesla, which lost about $150 billion in value, closing down 14.3% for the day.",
    "link": "https://www.jpost.com/breaking-news/article-856769",
    "timestamp": "2025-06-05T20:44:10Z"
  },
  {
    "title": "A Timeline of Elon Musk's and Donald Trump's Bromance",
    "description": "Trump and Musk, once close allies, erupted into a major feud this week.",
    "link": "https://www.newsweek.com/timeline-elon-musk-donald-trump-bromance-2081659",
    "timestamp": "2025-06-05T20:43:38Z"
  },
  {
    "title": "When Titans Collide: Trump-Musk Feud Spirals Out of Control",
    "description": "Time to drop the really big bomb: \"@realDonaldTrump is in the Epstein files. That is the real reason they have not been made public. Have a nice day, DJT!\"\nThe post When Titans Collide: Trump-Musk Feud Spirals Out of Control first appeared on Le·gal In·sur·re…",
    "link": "https://legalinsurrection.com/2025/06/when-titans-collide-trump-musk-feud-spirals-out-of-control/",
    "timestamp": "2025-06-05T20:43:34Z"
  },
  {
    "title": "‘Have a nice day, DJT!’— Raging feud between Trump-Musk tanks Tesla after Trump-Xi call calmed markets",
    "description": "Stock markets digested multiple major developments today including President Donald Trump’s announcement that he spoke with Chinese leader Xi Jinping on tariffs and trade. Meanwhile, Trump and his former confidant Tesla CEO Elon Musk continued to trade passiv…",
    "link": "https://biztoc.com/x/3d0ab190900de4d2",
    "timestamp": "2025-06-05T20:42:32Z"
  },
  {
    "title": "Elon Musk and Donald Trump are smack talking each other into their own digital echo chambers",
    "description": "Well, it finally happened. This town wasn’t big enough for the two towering egos of billionaire Elon Musk and President Donald Trump, and now they’re duking it out publicly, albeit from their own separate corners of the web.\nMusk is taking to his own social m…",
    "link": "https://biztoc.com/x/14c556950aefab78",
    "timestamp": "2025-06-05T20:42:28Z"
  },
  {
    "title": "Elon Musk has GOP leaders scrambling to save the megabill",
    "description": "Mike Johnson has spent his 19 months as speaker forging a close relationship with President Donald Trump — in part to avoid the social-media bombshells that derailed so many Republican priorities during Trump’s first term. \nNow he has to deal with another, pe…",
    "link": "https://biztoc.com/x/85b7e887a98fe74f",
    "timestamp": "2025-06-05T20:42:27Z"
  },
  {
    "title": "Musk: Trump tariffs will cause recession later this year",
    "description": "The unfolding row between United States President Donald Trump and the former head of the Department of Government Efficiency (DOGE) Elon Musk gained momentum on Thursday, with the billionaire declari...",
    "link": "https://biztoc.com/x/4752e754dd7852fd",
    "timestamp": "2025-06-05T20:42:22Z"
  },
  {
    "title": "Elon Musk Yanks SpaceX Program After Trump Threatens to Cut Contracts",
    "description": "Billions of dollars are on the line as Donald Trump and Elon Musk continue their excruciatingly public breakup.\r\n“In light of the President’s statement about cancellation of my government contracts, @SpaceX will begin decommissioning its Dragon spacecraft imm…",
    "link": "https://newrepublic.com/post/196215/elon-musk-spacex-program-donald-trump-threatens-contracts",
    "timestamp": "2025-06-05T20:42:06Z"
  },
  {
    "title": "Donald Trump Jr. and Omeed Malik on GrabAGun Going Public – CNBC",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_6cc1879c-b9a8-4b15-ba2f-3a82caebe068",
    "timestamp": "2025-06-05T20:42:02Z"
  },
  {
    "title": "‘God Help Us ALL…’: MAGA Melts Down After Musk Implicates Trump in the ‘Epstein Files’",
    "description": "Musk accusing Trump of being involved with Epstein is a kind of worst possible scenario for the MAGA base, which has also long dabbled in QAnon\nThe post ‘God Help Us ALL…’: MAGA Melts Down After Musk Implicates Trump in the ‘Epstein Files’ first appeared on M…",
    "link": "https://www.mediaite.com/media/news/god-help-us-all-maga-melts-down-after-musk-implicates-trump-in-the-epstein-files/",
    "timestamp": "2025-06-05T20:41:45Z"
  },
  {
    "title": "Tesla stocks close way down amid Musk and Trump's bitter battle",
    "description": "President Donald Trump threatened to pull federal contracts from tech billionaire Elon Musk — and the stock market immediately reflected spooked investors. Trump's threat on Truth Social came amid a vicious afternoon in which Musk complained of the president'…",
    "link": "https://www.rawstory.com/musk-tesla-trump/",
    "timestamp": "2025-06-05T20:41:22Z"
  },
  {
    "title": "Trump slashing VOA staff to just 18 people, leaked letter reveals",
    "description": "Administration already put hundreds on leave, selling HQ building and canceling lease for new location",
    "link": "https://www.wnd.com/2025/06/trump-slashing-voa-staff-to-just-18-people-leaked-letter-reveals/",
    "timestamp": "2025-06-05T20:39:32Z"
  },
  {
    "title": "Musk posted X poll asking if it's time for 3rd US political party",
    "description": "Elon Musk posted a poll on X asking whether it’s time to create a new, third political party in the U.S. that would represent the \"80% in the middle.\"",
    "link": "https://www.snopes.com//fact-check/musk-3rd-us--political-party/",
    "timestamp": "2025-06-05T20:39:00Z"
  },
  {
    "title": "Cellebrite just spent $200 million on the iPhone virtualization company Apple tried to bury",
    "description": "Cellebrite, the Israeli firm responsible for one of the world’s most famous iPhone hacking tools, has acquired Corellium, the company best known for creating virtual iPhones used in security research. This is huge news.\n\n\n\n more…",
    "link": "https://9to5mac.com/2025/06/05/cellebrite-acquires-corellium-for-200-million/",
    "timestamp": "2025-06-05T20:38:58Z"
  },
  {
    "title": "What Trump ordering an investigation into Biden's actions might mean legally and politically",
    "description": "President Donald Trump has ordered an investigation into pardons and other executive actions issued by his predecessor, Joe Biden — launching an unprecedented effort to show that the Democrat hid his cognitive decline and was otherwise too mentally imp...",
    "link": "https://abcnews.go.com/US/wireStory/trump-ordering-investigation-bidens-actions-legally-politically-122552909",
    "timestamp": "2025-06-05T20:38:45Z"
  },
  {
    "title": "US declines to label China a currency manipulator, but blasts its transparency policies",
    "description": "The U.S. declined to label China a currency manipulator in a new Treasury report, but accuses Beijing of standing out among America’s major trading partners for lacking transparency",
    "link": "https://abcnews.go.com/Business/wireStory/us-declines-label-china-currency-manipulator-blasts-transparency-122552908",
    "timestamp": "2025-06-05T20:38:40Z"
  },
  {
    "title": "Elon Musk and Donald Trump are smack talking each other into their own digital echo chambers | TechCrunch",
    "description": "Elon Musk and Donald Trump are smack talking each other into their own digital echo chambers | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2025/06/05/elon-musk-and-donald-trump-are-smack-talking-each-other-into-their-own-digital-echo-chambers/",
    "timestamp": "2025-06-05T20:38:26Z"
  },
  {
    "title": "Correction: Saudi Arabia’s Quality of Life Program Showcased During President of the US Visit Amid National Transformation",
    "description": "U.S. President Donald Trump was introduced to a new chapter in Saudi Arabia’s national narrative U.S. President Donald Trump was introduced to a new chapter in Saudi Arabia’s national narrative",
    "link": "https://www.globenewswire.com/news-release/2025/06/05/3094797/0/en/Correction-Saudi-Arabia-s-Quality-of-Life-Program-Showcased-During-President-of-the-US-Visit-Amid-National-Transformation.html",
    "timestamp": "2025-06-05T20:38:00Z"
  },
  {
    "title": "Literally Just 35 Very, Very, Very Funny Tweets About Donald Trump And Elon Musk's Breakup",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_bd01df62-2547-4dbd-ba90-ec2242bf70a6",
    "timestamp": "2025-06-05T20:37:55Z"
  },
  {
    "title": "Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files",
    "description": "Trump threatens to cut Musks government contracts after backlash over $1.6T bill. Musk fires back with Epstein claim as Tesla sinks 20%.\nThe post Trump–Musk feud escalates as Musk accuses Trump of appearing in Epstein files appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/trump-musk-contracts-epstein-allegation/",
    "timestamp": "2025-06-05T20:37:52Z"
  },
  {
    "title": "Trump and Xi Break the Silence With Phone Call",
    "description": "The leaders claimed progress on thorny issues, but it remains to be seen if the rhetoric will translate into reality.",
    "link": "http://foreignpolicy.com/2025/06/05/trump-xi-jinping-phone-call-trade-tariffs-student-visas-china/",
    "timestamp": "2025-06-05T20:36:33Z"
  },
  {
    "title": "How Far Will Trump’s Feud With Elon Musk Go?",
    "description": "President Donald Trump’s feud with Elon Musk continued to escalate on Thursday afternoon, when the billionaire entrepreneur accused Trump of being in the Epstein files.... Read More\nThe post How Far Will Trump’s Feud With Elon Musk Go? appeared first on The D…",
    "link": "https://www.dailysignal.com/2025/06/05/how-far-will-trumps-feud-with-elon-musk-go/",
    "timestamp": "2025-06-05T20:35:31Z"
  },
  {
    "title": "What Trump ordering an investigation into Biden's actions might mean legally and politically",
    "description": "President Donald Trump has ordered an investigation into pardons and other executive actions issued by his predecessor, Joe Biden — launching an...",
    "link": "https://www.yahoo.com/news/trump-ordering-investigation-bidens-actions-203514763.html",
    "timestamp": "2025-06-05T20:35:14Z"
  },
  {
    "title": "Tesla stock, share price prediction: Experts sound red alert. Details here",
    "description": "Musk has slowly started to separate himself from the White House in recent weeks, stung in part by the wave of protests against Tesla.",
    "link": "https://economictimes.indiatimes.com/news/international/us/tesla-stock-share-price-prediction-experts-sound-red-alert-details-here/articleshow/121659193.cms",
    "timestamp": "2025-06-05T20:34:44Z"
  },
  {
    "title": "Fox News Host Crestfallen Over Trump-Musk Slugfest: ‘Not a Story We Wanted Today for America’",
    "description": "Fox News host Will Cain opened his show Thursday on a more somber note in response to the heated social media feud between Elon Musk and President Donald Trump.\nThe post Fox News Host Crestfallen Over Trump-Musk Slugfest: ‘Not a Story We Wanted Today for Amer…",
    "link": "https://www.mediaite.com/media/tv/fox-news-host-crestfallen-over-trump-musk-slugfest-not-a-story-we-wanted-today-for-america/",
    "timestamp": "2025-06-05T20:34:17Z"
  },
  {
    "title": "Musk Takes Shot at Trump, Claims Epstein Files 'Have Not Been Made Public' Because Trump is in Them",
    "description": "Elon Musk took a shot at President Donald Trump as the two appear to be feuding over social media, claiming that files relating to Jeffrey Epstein's client list \"have not been made public\" because the president is in them.\nThe post Musk Takes Shot at Trump, C…",
    "link": "https://www.breitbart.com/politics/2025/06/05/musk-takes-shot-at-trump-claims-epstein-files-have-not-been-made-public-because-trump-is-in-them/",
    "timestamp": "2025-06-05T20:33:42Z"
  },
  {
    "title": "Biden only hand-signed one pardon during final spree, and it was his most controversial one",
    "description": "The Justice Department is reviewing the list of people granted pardons by President Joe Biden amid new concerns about his use of an autopen to automatically sign documents.",
    "link": "https://www.foxnews.com/politics/biden-only-hand-signed-one-pardon-during-final-spree-his-most-controversial-one",
    "timestamp": "2025-06-05T20:33:41Z"
  },
  {
    "title": "Milton Friedman Disproved Trump's Argument for Tariffs Decades Ago",
    "description": "In a 1978 appearance at Utah State University, the Nobel Prize–winning economist provided the perfect retort to those who blindly argue we should \"build in America.\"",
    "link": "https://reason.com/2025/06/05/milton-friedman-disproved-trumps-argument-for-tariffs-decades-ago/",
    "timestamp": "2025-06-05T20:33:06Z"
  },
  {
    "title": "US declines to label China a currency manipulator, but blasts its transparency policies",
    "description": "WASHINGTON (AP) — The U.S. declined to label China a currency manipulator in a new Treasury report released Thursday, but accuses Beijing of standing out among America’s major trading partners for lacking transparency in its exchange rate policies. Treasury’s…",
    "link": "https://financialpost.com/pmn/us-declines-to-label-china-a-currency-manipulator-but-blasts-its-transparency-policies",
    "timestamp": "2025-06-05T20:32:04Z"
  },
  {
    "title": "Trump Family Hits Magic Eden With Cease-and-Desist Over Crypto Wallet Plans: Bloomberg",
    "description": "The family of U.S. President Donald Trump has allegedly sent a cease-and-desist letter to two entities behind a forthcoming — and already heavily disputed — Trump-branded crypto wallet, according to a Thursday report from Bloomberg.\nSince the announcement of …",
    "link": "https://biztoc.com/x/18f3c91c4ae0a771",
    "timestamp": "2025-06-05T20:31:44Z"
  },
  {
    "title": "In the DOGE-house: Trump threatens Musk with ‘billions and billions’ in fed funding cuts",
    "description": "WASHINGTON — President Donald Trump on Thursday threatened to cut Elon Musk’s government contracts as their fractured alliance rapidly escalated into a public feud with Trump suggesting he would use the U.S. government to hurt his fellow billionaire financial…",
    "link": "https://biztoc.com/x/43776834039f390d",
    "timestamp": "2025-06-05T20:31:37Z"
  },
  {
    "title": "Donald Trump and Elon Musk’s relationship flames out",
    "description": "WASHINGTON — Donald Trump and Elon Musk’s alliance took off like one of SpaceX’s rockets. It was supercharged and soared high. And then it blew up.\nThe spectacular flameout Thursday hit a crescendo when Trump threatened to cut Musk’s government contracts and …",
    "link": "https://biztoc.com/x/89e72770fd8debb3",
    "timestamp": "2025-06-05T20:31:33Z"
  },
  {
    "title": "Tesla shares sink as Musk and Trump ridicule each other",
    "description": "Tesla's shares have fallen 16% since CEO Elon Musk began bashing President Donald Trump's spending bill on May 27, and the stock remains about 33% lower since Inauguration Day.",
    "link": "https://biztoc.com/x/309297beffddd710",
    "timestamp": "2025-06-05T20:31:30Z"
  },
  {
    "title": "Trump, Musk feud explodes into the open",
    "description": "A clash between US President Donald Trump and Elon Musk burst into the open Thursday, as disagreements over Republicans’ spending bill quickly morphed into a personal feud.\nMusk, once a close Trump ally and adviser, has repeatedly criticized the Trump-backed …",
    "link": "https://biztoc.com/x/37581dc2b5756211",
    "timestamp": "2025-06-05T20:31:23Z"
  },
  {
    "title": "Elon Musk Melts Down, Claims Trump Is In The \"Epstein Files\" and That's the Reason They Haven't Been Released",
    "description": "In a dramatic escalation of the pair's nasty public breakup, Elon Musk is now claiming that Donald Trump had a closer relationship to dead pedophile Jeffrey Epstein than previously known. \"Time to drop the really big bomb,\" Musk tweeted. \"[Trump] is in the Ep…",
    "link": "https://futurism.com/the-byte/elon-musk-trump-epstein-files",
    "timestamp": "2025-06-05T20:30:23Z"
  },
  {
    "title": "Diver convicted of freeing sharks off Florida coast says he was surprised by presidential pardon",
    "description": "A boat captain convicted of theft for freeing 19 sharks from a fisherman’s longline off Florida says he felt like he was living in an alternate universe for the past five years",
    "link": "https://abcnews.go.com/Politics/wireStory/diver-convicted-freeing-sharks-off-florida-coast-surprised-122552291",
    "timestamp": "2025-06-05T20:30:17Z"
  },
  {
    "title": "Diver convicted of freeing sharks off Florida coast says he was surprised by presidential pardon",
    "description": "A boat captain convicted of theft for freeing 19 sharks from a fisherman’s longline off Florida says he felt like he was living in an alternate universe for the past five years",
    "link": "https://abcnews.go.com/US/wireStory/diver-convicted-freeing-sharks-off-florida-coast-surprised-122552290",
    "timestamp": "2025-06-05T20:30:16Z"
  },
  {
    "title": "Musk says Trump would have lost the 2024 election without his help (Washington Post)",
    "description": "Washington Post:\nMusk says Trump would have lost the 2024 election without his help  —  Trump says he's ‘very disappointed’ with Musk  —  Elon Musk argued Thursday that President Donald Trump would have lost the 2024 election without Musk's support, as the tw…",
    "link": "https://www.memeorandum.com/250605/p111",
    "timestamp": "2025-06-05T20:30:01Z"
  },
  {
    "title": "Trump floats revoking Musk's federal contracts (Gregory Svirnovskiy/Politico)",
    "description": "Gregory Svirnovskiy / Politico:\nTrump floats revoking Musk's federal contracts  —  The president's relationship with Musk has deteriorated rapidly since Musk left the White House last week.  —  President Donald Trump on Thursday threatened Elon Musk's federal…",
    "link": "https://www.memeorandum.com/250605/p112",
    "timestamp": "2025-06-05T20:30:01Z"
  },
  {
    "title": "Trump attacks Musk as public feud escalates over tax-cut bill (Reuters)",
    "description": "Reuters:\nTrump attacks Musk as public feud escalates over tax-cut bill  —  President Donald Trump lashed out on Thursday against his ally Elon Musk, saying he was “disappointed” by the billionaire's public opposition to the sweeping tax-cut and spending bill …",
    "link": "https://www.memeorandum.com/250605/p113",
    "timestamp": "2025-06-05T20:30:01Z"
  },
  {
    "title": "Morgan Freeman didn't lecture Karoline Leavitt about racism on live TV",
    "description": "In May or June 2025, actor Morgan Freeman lectured White House Press Secretary Karoline Leavitt about racism on live television.",
    "link": "https://www.snopes.com//fact-check/karoline-leavitt-morgan-freeman-racism/",
    "timestamp": "2025-06-05T20:30:00Z"
  },
  {
    "title": "In the DOGE-house: Trump threatens Musk with ‘billions and billions’ in fed funding cuts",
    "description": "\"Without me, Trump would have lost the election,\" Musk retorted. \"Such ingratitude,\" Musk said in a follow-up post.",
    "link": "https://www.bostonherald.com/2025/06/05/in-the-doge-house-trump-threatens-musk-with-billions-and-billions-in-fed-funding-cuts/",
    "timestamp": "2025-06-05T20:29:49Z"
  }
]