[
  {
    "title": "Tulsi Gabbard gives exclusive glimpse of Trump's first Cabinet meeting",
    "description": "Director of National Intelligence Tulsi Gabbard described the energetic feeling in the room during President Donald Trump's first Cabinet meeting.",
    "link": "https://www.foxnews.com/politics/tulsi-gabbard-gives-exclusive-glimpse-trumps-first-cabinet-meeting",
    "timestamp": "2025-02-26T22:48:55Z"
  },
  {
    "title": "President Trump says U.S. can pay off $36 trillion debt by selling wealthy immigrants $5 million ‘gold card’ visas and eventual citizenship",
    "description": "Details of President Trump’s “gold card” visa program are still being finalized, but the proceeds are already earmarked to help tackle America’s national d",
    "link": "https://www.newsbreak.com/share/3830710558306-president-trump-says-u-s-can-pay-off-36-trillion-debt-by-selling-wealthy-immigrants-5-million-gold-card-visas-and-eventual-citizenship?s=a2&amp;share_destination_id=MTc5MjM0NDU0LTE3NDA2MTAwMzUzNjc%3D&amp;pd=0C834I2x&amp;hl=en_US&amp;send_time=1740610035&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_recall_exp_25q1-v5%2Cns_foryou_blend_exp_25q1-v1%2Cns_local_strategy_25q1_exp-v3%2Cns_push_exp_rt_bucketv12-v6",
    "timestamp": "2025-02-26T22:48:41Z"
  },
  {
    "title": "Anti-abortion groups claim they don’t want to punish women. New lawsuits say otherwise.",
    "description": "The antiabortion movement is grappling with an internal divide about whether women should be punished for abortion, as a growing number of state legislatures consider personhood bills authorizing the punishment of abortion seekers.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/abortion-pregnant-workers-state-lawsuits-texas-rcna193892",
    "timestamp": "2025-02-26T22:47:57Z"
  },
  {
    "title": "Hegseth Says Pentagon Is Doing a 'Full Review' of 'Botched Withdrawal of Afghanistan'",
    "description": "Pete Hegseth reiterated that the Pentagon is doing a \"full review\" of the Biden administration's withdrawal from Afghanistan ahead of Wednesday's Cabinet meeting.",
    "link": "https://www.ibtimes.com/hegseth-says-pentagon-doing-full-review-botched-withdrawal-afghanistan-3764954",
    "timestamp": "2025-02-26T22:47:42Z"
  },
  {
    "title": "Trump Has A Plan To Lower Gas Prices, Experts Discuss Potential Backlashes",
    "description": "President Donald Trump issued plans Wednesday to cut taxes for domestic oil and gas producers while allowing full expense deductions for new factory construction, aiming to boost production and lower consumer costs.\n“As long as you invest in America, build in…",
    "link": "https://biztoc.com/x/fc5ba3e896ca5cec",
    "timestamp": "2025-02-26T22:41:50Z"
  },
  {
    "title": "Trump signs DOGE's cost efficiency initiative order",
    "description": "United States President Donald Trump signed on Wednesday an executive order giving the Department of Government Efficiency (DOGE) more oversight on government spending.\nMore to come......",
    "link": "https://biztoc.com/x/4d030bba8684bc61",
    "timestamp": "2025-02-26T22:41:33Z"
  },
  {
    "title": "'Don’t ever, ever take the position': GOP senator gives stern warning to Trump DOJ nominee",
    "description": "During a confirmation hearing for nominees chosen for high-profile posts within the Department of Justice, two of President Donald Trump's appointees wouldn't rule out disobeying federal court orders.NBC News reported Wednesday that both Aaron Reitz and Dean …",
    "link": "https://www.rawstory.com/john-kennedy-2671226399/",
    "timestamp": "2025-02-26T22:41:24Z"
  },
  {
    "title": "UK's Starmer says only U.S. 'backstop' can secure lasting Ukraine peace",
    "description": "WASHINGTON (Reuters) - British Prime Minister Keir Starmer urged the United States on Wednesday to provide a security \"backstop\" to any future European peacekeepers in Ukraine, saying only that would offer Kyiv a lasting peace rather than a temporary ceasefir…",
    "link": "https://www.thestar.com.my/news/world/2025/02/27/uk039s-starmer-says-only-us-039backstop039-can-secure-lasting-ukraine-peace",
    "timestamp": "2025-02-26T22:41:00Z"
  },
  {
    "title": "A warning from a Finn on Vladimir Putin ---\nThe Finnish border with Russia runs over 800 miles; the Finns have skin in this game.",
    "description": "In April 2023, Finland became the 31st member of North Atlantic Treaty Organization, aligning itself with the United States, ending generations of Finnish military neutrality between the West and Russia. The Kremlin’s invasion of Ukraine in 2022 provoked the …",
    "link": "https://freerepublic.com/focus/f-bloggers/4300736/posts",
    "timestamp": "2025-02-26T22:40:54Z"
  },
  {
    "title": "Despite Trump’s Promises, Eggs Are About to Get Way More Expensive",
    "description": "Don’t expect egg prices to come down anytime soon.\r\nThe Agriculture Department announced Wednesday that the current cost of eggs could rise by more than 40 percent before the end of the year.\r\nThe sticker shock warning came amid the unveiling of a new plan by…",
    "link": "https://newrepublic.com/post/192048/donald-trump-promises-eggs-more-expensive",
    "timestamp": "2025-02-26T22:40:53Z"
  },
  {
    "title": "Economists are starting to worry about a serious Trump recession (Ambrose Evans-Pritchard/Telegraph)",
    "description": "Ambrose Evans-Pritchard / Telegraph:\nEconomists are starting to worry about a serious Trump recession  —  Tariffs on America's neighbours and assault on federal government will hit US economy  —  Donald Trump's assault on the US federal government and the wor…",
    "link": "https://www.memeorandum.com/250226/p128",
    "timestamp": "2025-02-26T22:40:02Z"
  },
  {
    "title": "Man who said he was upset with Musk and Trump charged with threatening to burn down xAI facility",
    "description": "Authorities say a Tennessee man has been charged with an act of terrorism after he threatened to burn down an xAI facility because he was upset with its founder, Elon Musk, and President Donald Trump. Authorities say 25-year-old Ethan Paul Early was arrested …",
    "link": "https://www.seattlepi.com/news/politics/article/man-who-said-he-was-upset-with-musk-and-trump-20190175.php",
    "timestamp": "2025-02-26T22:36:03Z"
  },
  {
    "title": "White House Bars Reuters, HuffPost, AP From Covering Trump Cabinet Meeting",
    "description": "The White House on Wednesday denied reporters from Reuters and other news organizations access to President Donald Trump&#039;s first cabinet meeting in keeping with the administration&#039;s new policy regarding media coverage.",
    "link": "https://www.ndtv.com/world-news/white-house-bars-reuters-huffpost-ap-from-covering-trump-cabinet-meeting-7803401",
    "timestamp": "2025-02-26T22:35:58Z"
  },
  {
    "title": "Trump’s HHS Halts Multimillion-Dollar Biden-Era Contract to Create New COVID-19 Vaccine",
    "description": "HHS Secretary Robert F. Kennedy Jr. has halted a Biden-era contract to create a new COVID-19 vaccine, according to a report.\nThe post Trump’s HHS Halts Multimillion-Dollar Biden-Era Contract to Create New COVID-19 Vaccine appeared first on Breitbart.",
    "link": "https://www.breitbart.com/health/2025/02/26/trumps-hhs-halts-multimillion-dollar-biden-era-contract-to-create-new-covid-19-vaccine/",
    "timestamp": "2025-02-26T22:35:29Z"
  },
  {
    "title": "America Last: How Foreign Aid Undermined US Interests Around the World",
    "description": "Editor’s note: The following is prepared testimony to the House Oversight Committee’s Subcommittee on Delivering on Government Efficiency, or DOGE, from Max Primorac, a former... Read More\nThe post America Last: How Foreign Aid Undermined US Interests Around …",
    "link": "https://www.dailysignal.com/2025/02/26/america-last-how-foreign-aid-undermined-interests-around-world/",
    "timestamp": "2025-02-26T22:35:14Z"
  },
  {
    "title": "GOP Senator Warns Trump DOJ Nominees to Uphold the Rule of Law: ‘Don’t Ever, Ever’ Say You Won’t Follow a Court Order",
    "description": "Sen. John Kennedy (R-LA) warned some of President Donald Trump’s judicial nominees to obey court rulings whether they agree with them or not. Kennedy cautioned during a Senate Judiciary Committee hearing that once the courts no longer have “legitimacy,” the j…",
    "link": "https://www.mediaite.com/tv/gop-senator-warns-trump-doj-nominees-to-uphold-the-rule-of-law-dont-ever-ever-say-you-wont-follow-a-court-order/",
    "timestamp": "2025-02-26T22:35:08Z"
  },
  {
    "title": "Bill Pulte, Trump’s Housing Nominee, Has Quite a History With Meme Stocks",
    "description": "The White House pick to oversee trillions in mortgage loans spent 2023 promoting Bed Bath and Beyond stocks, which ended up costing investors",
    "link": "http://www.rollingstone.com/politics/politics-news/bill-pulte-bbby-fhfa-meme-stock-mrbeast-1235281161/",
    "timestamp": "2025-02-26T22:34:21Z"
  },
  {
    "title": "Trump Posts AI-Generated Video of Genderqueer Bellydancers Frolicking",
    "description": "Late last night, president Donald Trump took to Truth Social, the social media platform he has a majority stake in, to publish a — strange? Baffling? Horrifying? All of the above? — AI-generated video of what he purports a Trump-ruled Gaza Strip might one day…",
    "link": "https://futurism.com/trump-ai-genderqueer-bellydancers",
    "timestamp": "2025-02-26T22:34:15Z"
  },
  {
    "title": "Economists Start to Worry About a Trump Recession",
    "description": "\"Donald Trump’s assault on the U.S. federal government and the world’s interlinked manufacturing system have together reached an economic tipping point,\" the Telegraph reports. Said economist Jesse Rothstein:  \"It seems almost unavoidable that we are",
    "link": "https://politicalwire.com/2025/02/26/economists-start-to-worry-about-a-trump-recession/",
    "timestamp": "2025-02-26T22:34:11Z"
  },
  {
    "title": "Newly Released Footage Shows Theft of 18-Karat Golden Toilet",
    "description": "The $6.1 million artwork by Maurizio Cattelan was stolen from the Blenheim Palace in England in September 2019.",
    "link": "http://hyperallergic.com/992500/newly-released-footage-shows-theft-of-18-karat-golden-toilet/",
    "timestamp": "2025-02-26T22:32:20Z"
  },
  {
    "title": "SEC, Justin Sun, Tron Ask Court to Pause Fraud Case Over 'Potential Resolution'",
    "description": "SEC, Justin Sun, Tron Ask Court to Pause Fraud Case Over 'Potential Resolution'",
    "link": "https://www.coindesk.com/policy/2025/02/26/sec-justin-sun-tron-ask-court-to-pause-fraud-case-over-potential-resolution",
    "timestamp": "2025-02-26T22:32:12Z"
  },
  {
    "title": "Left-Wing Groups Funded Anti-DOGE Protests At Republican Town Halls",
    "description": "George Soros-funded organizations and other Democrat activists led the protests in GOP districts, which media presented as organic backlash. The so-called backlash to Elon Musk’s Department of Government Efficiency (DOGE) project on display at recent Republic…",
    "link": "https://freerepublic.com/focus/f-chat/4300734/posts",
    "timestamp": "2025-02-26T22:32:07Z"
  },
  {
    "title": "Is Trump lying about cutting Medicaid — or is Congress?",
    "description": "The Logoff is a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff. Today I’m focused on Donald Trump’s mixed messages on the fate of Medicaid,…",
    "link": "https://www.vox.com/politics/401630/is-trump-lying-about-cutting-medicaid-or-is-congress",
    "timestamp": "2025-02-26T22:31:57Z"
  },
  {
    "title": "Ukraine needs US security guarantee to deter Putin - PM",
    "description": "The PM stresses the importance of US help but Trump suggests responsibility lies with Europe.",
    "link": "https://www.bbc.com/news/articles/c5ymvygpj7go",
    "timestamp": "2025-02-26T22:31:30Z"
  },
  {
    "title": "Man who said he was upset with Musk and Trump charged with threatening to burn down xAI facility",
    "description": "Authorities say a Tennessee man has been charged with an act of terrorism after he threatened to burn down an xAI facility because he was upset with its founder, Elon Musk, and President Donald Trump",
    "link": "https://abcnews.go.com/Politics/wireStory/man-upset-musk-trump-charged-threatening-burn-xai-119229768",
    "timestamp": "2025-02-26T22:30:26Z"
  },
  {
    "title": "Man who said he was upset with Musk and Trump charged with threatening to burn down xAI facility",
    "description": "A Tennessee man has been charged with an act of terrorism after he threatened to burn down an xAI facility because he was upset with its founder, Elon Musk, and President Donald Trump, authorities said.\nEthan Paul Early, 25, of Ashland City, was arrested and …",
    "link": "https://biztoc.com/x/534f1faf6c371bfe",
    "timestamp": "2025-02-26T22:30:00Z"
  },
  {
    "title": "Jeff Bezos’s Hypocritical Assertion of Power",
    "description": "His decision will only make The Washington Post a weaker institution.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/washington-post-editorial-independence/681847/",
    "timestamp": "2025-02-26T22:29:49Z"
  },
  {
    "title": "Trump’s Chaotic Agenda Has a Critical Through Line",
    "description": "What do Greenland, Canada, and Ukraine have in common? Critical minerals.",
    "link": "https://foreignpolicy.com/2025/02/26/trump-rare-earth-critical-mineral-resource-ukraine-greenland-canada/",
    "timestamp": "2025-02-26T22:29:34Z"
  },
  {
    "title": "Regretful Illegal Migrants Flocking Home In Droves After Trump Border Crackdown",
    "description": "Latin American migrants are traveling south in droves and expressing regret at attempting to cross unlawfully into the U.S. under President Donald Trump.",
    "link": "https://dailycaller.com/2025/02/26/migrants-regret-crossing-under-trump/",
    "timestamp": "2025-02-26T22:28:36Z"
  },
  {
    "title": "Rep. Mike Levin responds to Trump, House Republicans",
    "description": "U.S. Rep. Mike Levin responds to Trump's first month of executive actions and support by House Republicans.",
    "link": "https://www.kpbs.org/podcasts/kpbs-midday-edition/rep-mike-levin-responds-to-trump-house-republicans",
    "timestamp": "2025-02-26T22:28:00Z"
  },
  {
    "title": "VA Sec. Collins Cancels Nearly $2 Billion in Wasteful Consulting Contracts",
    "description": "Veteran Affairs (VA) Sec. Doug Collins has announced nearly $2 billion in savings from canceled contracts that can be \"put back into healthcare, benefits, and making sure we're doing what the VA is supposed to do.\"\nThe post VA Sec. Collins Cancels Nearly $2 B…",
    "link": "https://www.breitbart.com/national-security/2025/02/26/va-sec-collins-cancels-nearly-2-billion-in-wasteful-consulting-contracts/",
    "timestamp": "2025-02-26T22:26:55Z"
  },
  {
    "title": "IAEA: Iran Has Accelerated Nuclear Enrichment Since Trump Won",
    "description": "The International Atomic Energy Agency (IAEA) said Wednesday that Iran has accelerated its enrichment of uranium since the election of President Donald Trump in November, apparently racing toward a nuclear weapon before he can stop it.\nThe post IAEA: Iran Has…",
    "link": "https://www.breitbart.com/middle-east/2025/02/26/iaea-iran-has-accelerated-nuclear-enrichment-since-trump-won/",
    "timestamp": "2025-02-26T22:26:45Z"
  },
  {
    "title": "John Deere thumbs nose at Trump as shareholders rebuff anti-DEI bid",
    "description": "A right-wing think tank pressuring shareholders of large public companies to prohibit diversity, equity, and inclusion programs suffered a blowout defeat when they took their case to farming equipment manufacturer John Deere, independent journalist and author…",
    "link": "https://www.rawstory.com/john-deere/",
    "timestamp": "2025-02-26T22:26:13Z"
  },
  {
    "title": "Nearly 80% of Chicagoans disapprove of Mayor Brandon Johnson, new poll finds",
    "description": "The overwhelming disapproval comes from a survey of nearly 700 likely Chicago voters in a poll conducted between Feb. 20 and 21 by M3 Strategies. It’s the latest sign of residents’ frustration with Johnson who took office in May of 2023 and whose tenure has b…",
    "link": "https://freerepublic.com/focus/f-news/4300732/posts",
    "timestamp": "2025-02-26T22:26:10Z"
  },
  {
    "title": "Michael Moore: Trump is deporting someone who might have found the cure for cancer!",
    "description": "Blasts agenda to enforce American border law and remove illegal alien criminals",
    "link": "https://www.wnd.com/2025/02/michael-moore-trump-is-deporting-someone-who-might-have-found-the-cure-for-cancer/",
    "timestamp": "2025-02-26T22:24:26Z"
  },
  {
    "title": "Apple Says It's Fixing Transcription Glitch That Transcribes 'Racist' as 'Trump'",
    "description": "Apple says a speech-recognition model bug is causing the problem and that it will update iOS to address the issue.",
    "link": "https://www.cnet.com/tech/services-and-software/apple-says-its-fixing-transcription-glitch-that-transcribes-racist-as-trump/",
    "timestamp": "2025-02-26T22:23:44Z"
  },
  {
    "title": "\"America is bloated, fat and disgusting. Thank you very much.\" -President Donald J. Trump [Hero]",
    "description": "\"America is bloated, fat and disgusting. Thank you very much.\" -President Donald J. Trump",
    "link": "https://www.fark.com/comments/13577498/America-is-bloated-fat-disgusting-Thank-you-very-much-President-Donald-J-Trump",
    "timestamp": "2025-02-26T22:21:59Z"
  },
  {
    "title": "Canada's Jesse Marsch to U.S. president Donald Trump: 'Lay off the ridiculous' 51st state 'rhetoric'",
    "description": "The Canada coach, an American, did not hold back on Wednesday when talking about the current political tension between his country of birth and where he now works",
    "link": "https://www.cbssports.com/soccer/news/canadas-jesse-marsch-to-u-s-president-donald-trump-lay-off-the-ridiculous-51st-state-rhetoric/",
    "timestamp": "2025-02-26T22:19:17Z"
  },
  {
    "title": "Trump's New 'Pardon Czar' Brings Hope for Criminal Justice Reform | Opinion",
    "description": "Donald Trump led a bipartisan effort during his first term to pass the First Step Act—landmark legislation designed to encourage rehabilitation.",
    "link": "https://biztoc.com/x/6cdaf12ca41e15f1",
    "timestamp": "2025-02-26T22:19:02Z"
  },
  {
    "title": "Trump Asks Cabinet Secretaries If They're Upset With Musk's Work",
    "description": "President Donald Trump said approximately 1 million federal workers who did not respond to billionaire Elon Musk’s demand to explain their activities are at risk of losing their jobs.\n“Those million people that haven’t responded to Elon, they are on the bubbl…",
    "link": "https://biztoc.com/x/63ec9ae3daf638ac",
    "timestamp": "2025-02-26T22:18:54Z"
  },
  {
    "title": "Jeff Bezos Is Greasing America’s Slide Toward Autocracy",
    "description": "Billionaires controlling key elements of the media are helping U.S. President Donald Trump establish an authoritarian regime. Jeff Bezos, owner of The Washington Post, has become a poster child for the phenomenon. American democracy may be a casualty.From the…",
    "link": "https://www.commondreams.org/opinion/bezos-trump-autocracy",
    "timestamp": "2025-02-26T22:18:49Z"
  },
  {
    "title": "Exclusive: Pentagon Orders the Removal of DEI from All Official Online Content",
    "description": "Chief Pentagon Spokesman Sean Parnell on Wednesday sent a memo to the entire department ordering the removal of all official online content promoting diversity, equity, and inclusion in line with President Donald Trump and Defense Secretary Pete Hegseth's pri…",
    "link": "https://www.breitbart.com/politics/2025/02/26/exclusive-pentagon-orders-removal-dei-all-official-online-content/",
    "timestamp": "2025-02-26T22:18:02Z"
  },
  {
    "title": "Roger Stone didn't send memo to Trump about limiting gun access of 'enemies'",
    "description": "In March 2024, Roger Stone sent a memo to U.S. presidential candidate Donald Trump calling for a “new licensing program that would ensure our enemies can’t get guns by empowering the FBI and local law enforcement with the right to confiscate guns of anyone de…",
    "link": "https://www.snopes.com//fact-check/trump-roger-stone-guns-memo/",
    "timestamp": "2025-02-26T22:18:00Z"
  },
  {
    "title": "Trump ends Chevron permit in major blow to Venezuela",
    "description": "US President Donald Trump said Wednesday he was revoking permission for oil giant Chevron to operate in Venezuela, a major blow to the wobbly economy run by leftist adversary Nicolas Maduro. Trump accused Maduro of failing to live up to promises to take back …",
    "link": "https://www.digitaljournal.com/world/trump-ends-chevron-permit-in-major-blow-to-venezuela/article",
    "timestamp": "2025-02-26T22:17:32Z"
  },
  {
    "title": "Is there a deal to end Russia's war with Ukraine?",
    "description": "On Friday, Ukrainian President Volodymyr Zelenskyy is scheduled to meet President Donald Trump at the White House.<br><br>On the agenda — a deal for Ukraine to share its rich natural resources. <a href=\"https://www.npr.org/2025/02/26/nx-s1-5309488/us-ukraine-…",
    "link": "https://www.npr.org/2025/02/26/1233894745/is-there-a-deal-to-end-russias-war-with-ukraine",
    "timestamp": "2025-02-26T22:16:09Z"
  },
  {
    "title": "Trump Says He and Zelensky Will Sign 'Very Big Agreement' on Friday",
    "description": "President Donald Trump confirmed reports of a deal between the US and Ukraine, with plans to meet with Ukrainian President Volodymyr Zelensky in DC on Friday.",
    "link": "https://www.ibtimes.com/trump-says-he-zelensky-will-sign-very-big-agreement-friday-3764948",
    "timestamp": "2025-02-26T22:15:29Z"
  },
  {
    "title": "State Department Completes Foreign Funding Review, Identifying 15,000 Grants Worth $60 Billion for Elimination",
    "description": "President Donald Trump's State Department completed its review of U.S. foreign aid, identifying nearly 15,000 grants worth $60 billion for elimination, an internal memo reviewed by the Washington Free Beacon shows. The review pertained to foreign aid that flo…",
    "link": "https://freebeacon.com/trump-administration/state-department-completes-foreign-funding-review-identifying-15000-grants-worth-60-billion-for-elimination/",
    "timestamp": "2025-02-26T22:15:29Z"
  },
  {
    "title": "Canada coach Marsch takes aim at Trump over 51st state talk",
    "description": "Jesse Marsch, the American-born head coach of the Canadian men's soccer team, took aim at President Donald Trump on Wednesday and suggested he back off the \"ridiculous rhetoric\" of making Canada the 51st U.S. state.Marsch, speaking during a CONCACAF Nations L…",
    "link": "https://www.channelnewsasia.com/sport/canada-coach-marsch-takes-aim-trump-over-51st-state-talk-4963021",
    "timestamp": "2025-02-26T22:15:27Z"
  },
  {
    "title": "Trump Drops Wild AI Video of Gaza’s Future With Israeli Prime Minister",
    "description": "Donald Trump recently dropped a wild AI-generated video that’s got everyone scratching their heads. The clip supposedly shows the “future of Gaza,” but it’s packed with bizarre scenes that seem totally out of touch with reality.     Trump has posted a siniste…",
    "link": "https://hiphopwired.com/playlist/donald-trump-netanyahu-ai/",
    "timestamp": "2025-02-26T22:14:45Z"
  },
  {
    "title": "Elon Musk Calls Himself 'Humble Tech Support' for Trump Administration",
    "description": "Despite neither being an elected official nor a member of the Cabinet, Elon Musk kicked off the Trump administration's first full Cabinet meeting with another new title.",
    "link": "https://www.ibtimes.com/elon-musk-calls-himself-humble-tech-support-trump-administration-3764946",
    "timestamp": "2025-02-26T22:14:30Z"
  },
  {
    "title": "Trump says Zelensky to sign 'very big agreement' in US on Friday",
    "description": "US President Donald Trump says Ukrainian President Volodymyr Zelensky will visit Washington on Friday to sign an agreement on sharing Ukraine's mineral resources. Mr Zelensky says he's still looking for American security guarantees.\n\nAlso on the programme: A …",
    "link": "https://www.bbc.co.uk/programmes/w172zb9dgmf56g8",
    "timestamp": "2025-02-26T22:14:00Z"
  },
  {
    "title": "Second 'Exonerated 5' Member Announces Run For Office In New York",
    "description": "Raymond Santana, who at 14 was wrongfully convicted in the 1989 Central Park jogger rape, is following Yusef Salaam's footsteps in vying for City Council.",
    "link": "https://www.huffpost.com/entry/second-exonerated-five-member-run-office-new-york-raymond-santana_n_67bf619fe4b0c1f0afe34145",
    "timestamp": "2025-02-26T22:13:51Z"
  },
  {
    "title": "Opinion: By banning Associated Press, Trump strikes at the backbone of our free press",
    "description": "\"Even during the height of the Watergate scandal, President Richard Nixon didn’t kick the Washington Post out of the pool.\"",
    "link": "https://www.denverpost.com/2025/02/26/donald-trump-associated-press-ban-white-house-media/",
    "timestamp": "2025-02-26T22:13:50Z"
  },
  {
    "title": "Opinion: Trump strikes at the backbone of our free presss",
    "description": "The Associated Press is not just a single newspaper. Rather it supplies subscribing newspapers and websites around the world with content that a single organization could never collect on its own. The AP has been at the crux of history for almost two centurie…",
    "link": "https://www.denverpost.com/2025/02/26/donald-trump-free-press-speech-media-fake-news/",
    "timestamp": "2025-02-26T22:13:50Z"
  },
  {
    "title": "A Project 2025 author carries out his vision for mass federal layoffs",
    "description": "Here is the context of the Wednesday memo and Russell Vought’s previous work.",
    "link": "https://www.bostonherald.com/2025/02/26/trump-doge-project-2025/",
    "timestamp": "2025-02-26T22:12:49Z"
  },
  {
    "title": "AI betrays Donald Trump! Gaza video shows him obese, with belly dancing bearded men, social media users roast him for hilarious blunders",
    "description": "Donald Trump is facing the heat for sharing a video that appears to have been created using AI, that was riddled with a lot of mistakes and has now become the center point of controversy surrounding the Palestine-Israel issue",
    "link": "https://economictimes.indiatimes.com/news/international/us/ai-betrays-donald-trump-gaza-video-shows-him-obese-with-belly-dancing-bearded-men-social-media-users-roast-him-for-hilarious-blunders/articleshow/118587558.cms",
    "timestamp": "2025-02-26T22:11:07Z"
  },
  {
    "title": "Marjorie Taylor Greene Denounces ‘Threats Against the President’ After Democrat Says ‘We Will Fight Back’ Against Trump",
    "description": "Rep. Marjorie Taylor Greene admonished Rep. Melanie Stansbury over \"threats\" that came in the form of comparing President Donald Trump to a \"king.\"\nThe post Marjorie Taylor Greene Denounces ‘Threats Against the President’ After Democrat Says ‘We Will Fight Ba…",
    "link": "https://www.mediaite.com/politics/marjorie-taylor-greene-denounces-threats-against-the-president-after-democrat-says-we-will-fight-back-against-trump/",
    "timestamp": "2025-02-26T22:10:48Z"
  },
  {
    "title": "Washington Post owner Jeff Bezos says opinion pages will defend free market and ‘personal liberties’",
    "description": "Jeff Bezos, who also owns Amazon, said on X that \"viewpoints opposing those pillars will be left to be published by others.\"",
    "link": "https://www.pbs.org/newshour/politics/washington-post-owner-bezos-says-opinion-pages-shift-from-broad-focus-to-will-defend-free-market-and-personal-liberties",
    "timestamp": "2025-02-26T22:10:12Z"
  },
  {
    "title": "Hegseth Visits Guantanamo Bay, Engages With Troops",
    "description": "Defense Secretary Pete Hegseth traveled to Naval Station Guantanamo Bay, Cuba, where he took time to speak to service members who are currently supporting the illegal alien holding operations being led by the Department of Homeland Security.",
    "link": "https://www.defense.gov/News/News-Stories/Article/Article/4078647/hegseth-visits-guantanamo-bay-engages-with-troops/",
    "timestamp": "2025-02-26T22:10:00Z"
  },
  {
    "title": "Dem Attorney General Under Legal Fire For Allegedly Selling Out To Enviro Activists",
    "description": "A coalition of dairy farmers sued Wisconsin AG Josh Kaul for hiring a special assistant attorney general allegedly paid by a third-party organization.",
    "link": "https://dailycaller.com/2025/02/26/dairy-groups-sue-josh-kaul-hiring-environmental-attorney/",
    "timestamp": "2025-02-26T22:09:08Z"
  },
  {
    "title": "As Trump backs off of clean jobs, EU sees an opening with €100B investment",
    "description": "Europe will give €100 billion in short-term relief to clean manufacturing in order to compete with China, as it unveiled today in its Clean Industrial Deal. The money comes at the same time as the US is actively seeking to harm its manufacturing sector and se…",
    "link": "http://electrek.co/2025/02/26/as-trump-backs-off-of-clean-jobs-eu-sees-an-opening-with-e100b-investment/",
    "timestamp": "2025-02-26T22:07:52Z"
  },
  {
    "title": "New Ghostwriter campaign targets Ukrainian Government and opposition activists in Belarus",
    "description": "A Ghostwriter campaign using a new variant of PicassoLoader targets opposition activists in Belarus, and Ukrainian military and government organizations. SentinelLABS observed a new Ghostwriter campaign targeting Belarusian opposition activists and Ukrainian …",
    "link": "https://securityaffairs.com/174696/intelligence/ghostwriter-targets-ukrainian-gov-and-opposition-in-belarus.html",
    "timestamp": "2025-02-26T22:05:25Z"
  },
  {
    "title": "Rachel Maddow's Searing Remarks About Joy Reid's MSNBC Exit Touched On This Big Media Problem",
    "description": "Experts weigh in on Maddow's remarks and one glaring issue that's been plaguing news media organizations for years.",
    "link": "https://www.huffpost.com/entry/rachel-maddow-joy-reid-msnbc-departure-experts_n_67be08bbe4b08044e02bd928",
    "timestamp": "2025-02-26T22:01:44Z"
  },
  {
    "title": "Team Canada soccer coach, an American, blasts President Trump for '51st state' remarks: 'Insulting'",
    "description": "Canadian men's national soccer coach Jesse Marsch, who played for Team USA in the past, ripped President Trump for this \"51st State\" rhetoric in recent weeks.",
    "link": "https://www.foxnews.com/sports/team-canada-soccer-coach-american-blasts-president-trump-51st-state-remarks-insulting",
    "timestamp": "2025-02-26T22:00:33Z"
  },
  {
    "title": "Trump Admin Called Out for 'Sitting On' Epstein Client List: 'What're You Waiting For?'",
    "description": "Legislators and political figures are placing pressure upon Attorney General Pam Bondi to release the \"client list\" of New York financier Jeffrey Epstein.",
    "link": "https://www.ibtimes.com/trump-admin-called-out-sitting-epstein-client-list-whatre-you-waiting-3764940",
    "timestamp": "2025-02-26T22:00:25Z"
  },
  {
    "title": "Abortion pill maker enters legal battle over FDA rules (Alejandra O'Connell-Domenech/The Hill)",
    "description": "Alejandra O'Connell-Domenech / The Hill:\nAbortion pill maker enters legal battle over FDA rules  —  The country's only manufacturer of generic abortion medication asked to be a part of the first legal fight over the procedure since President Donald Trump retu…",
    "link": "https://www.memeorandum.com/250226/p119",
    "timestamp": "2025-02-26T22:00:23Z"
  },
  {
    "title": "Is The Stage Being Set For Damascus To Be Utterly Destroyed And Turned Into A Heap Of Ruins?",
    "description": "The Sunni radicals that have taken over Syria are demanding that all Israeli forces must leave Syrian territory.  On the other side, the IDF is hammering military targets in southern Syria with a blistering wave of airstrikes, and Israeli Prime Minister Benja…",
    "link": "http://theeconomiccollapseblog.com/is-the-stage-being-set-for-damascus-to-be-utterly-destroyed-and-turned-into-a-heap-of-ruins/",
    "timestamp": "2025-02-26T22:00:20Z"
  },
  {
    "title": "Madison Cawthorn Eyes Political Comeback...",
    "description": "Madison Cawthorn and Bob Rommel seem like strong possibilities. Spencer Roach and Jack Lombardi are considering it. Who else is in the mix?",
    "link": "https://floridapolitics.com/archives/723169-who-will-run-for-byron-donalds-seat-in-congress/",
    "timestamp": "2025-02-26T22:00:03Z"
  },
  {
    "title": "100 spies fired for sexually explicit chats, Gabbard says...",
    "description": "Agents involved in the ‘disgusting’ chats were from the NSA, CIA, and DIA, according to a report",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/nsa-inappropriate-chat-fired-gabbard-b2705027.html",
    "timestamp": "2025-02-26T22:00:03Z"
  },
  {
    "title": "Randy Moore retires as Forest Service chief, encourages workers in 'unsettling' times",
    "description": "Moore's encouragement of Forest Service workers was directly at odds with the combative rhetoric around the federal workforce coming from Trump and his administration's officials tasked with overseeing that workforce.",
    "link": "https://missoulian.com/news/local/government-politics/article_f8acb634-f47f-11ef-b33d-afdb53efcc58.html",
    "timestamp": "2025-02-26T22:00:00Z"
  },
  {
    "title": "Commentary: Why Trump really wants Ukraine’s minerals – China has put theirs off limits",
    "description": "<![CDATA[ If President Donald Trump’s deal goes ahead, he will have to wait a while before Ukraine’s minerals will fulfil the US’ needs, says this international relations expert. ]]>",
    "link": "https://www.channelnewsasia.com/commentary/trump-us-ukraine-minerals-russia-war-china-4961266",
    "timestamp": "2025-02-26T22:00:00Z"
  },
  {
    "title": "No One Cares When Presidential Advisers Want Bigger Government",
    "description": "Elon Musk's unclear position on the federal government's organization chart continues to generate controversy and legal problems for the Trump",
    "link": "https://reason.com/2025/02/26/no-one-cares-when-presidential-advisers-want-bigger-government/",
    "timestamp": "2025-02-26T21:59:40Z"
  },
  {
    "title": "Morning Bid: Yields, stocks sag as 'Tariff Man' flexes muscles, Nvidia reports",
    "description": "A look at the day ahead in Asian markets. The Asia-Pacific economic and corporate calendar is virtually empty on Thursday, allowing investors to take their cue from global drivers, two of which stand out above all others - Nvidia's earnings and U.S. President…",
    "link": "https://www.channelnewsasia.com/business/morning-bid-yields-stocks-sag-tariff-man-flexes-muscles-nvidia-reports-4962986",
    "timestamp": "2025-02-26T21:59:19Z"
  },
  {
    "title": "Nvidia sales surge in the fourth quarter on demand for AI chips",
    "description": "The tech giant posted revenue of $39.3 billion, up 12% from the previous quarter.",
    "link": "https://www.ocregister.com/2025/02/26/nvidia-fourth-quarter-sales-surge/",
    "timestamp": "2025-02-26T21:59:10Z"
  },
  {
    "title": "Trump Says US Has Decided to Impose Tariffs on EU",
    "description": "President Donald Trump reportedly said Wednesday (Feb. 26) that the U.S. has decided to impose tariffs on the European Union (EU) and will announce the details soon. “It’ll be 25% generally speaking, and that will be on cars and all other things,” Trump said …",
    "link": "https://www.pymnts.com/politics/2025/trump-says-us-has-decided-to-impose-tariffs-on-eu/",
    "timestamp": "2025-02-26T21:57:41Z"
  },
  {
    "title": "A Ukraine ceasefire deal is starting to come into view. Would it work?",
    "description": "Russia’s President Vladimir Putin, left, and President Donald Trump arrive for a group photo at the G20 Summit in Osaka on June 28, 2019. | Brendan Smialowski/AFP via Getty Images\nAfter a dramatic week that saw both the third anniversary of the war in Ukraine…",
    "link": "https://biztoc.com/x/f4886eac76327732",
    "timestamp": "2025-02-26T21:56:45Z"
  },
  {
    "title": "Trump administration tells NYC to shut down congestion pricing by March 21",
    "description": "Trump administration tells NYC to shut down congestion pricing by March 21go.com",
    "link": "https://abcnews.go.com/US/trump-administration-nyc-shut-congestion-pricing-end-deadline/story?id=119226723",
    "timestamp": "2025-02-26T21:56:44Z"
  },
  {
    "title": "Transport Minister Anita Anand to reverse course and seek re-election: sources",
    "description": "Transport Minister Anita Anand is set to reverse her decision to retire from politics and announce she will seek re-election if Mark Carney is the Liberal leader, CBC News has learned.",
    "link": "https://www.cbc.ca/news/politics/anita-anand-reelection-1.7469420",
    "timestamp": "2025-02-26T21:56:25Z"
  },
  {
    "title": "Fox News Anchor Slams White House for Hand-Picking Press Pool: 'This Does Not Give Power to the People'",
    "description": "Fox News host Jacqui Heinrich lambasted the White House for its decision to choose the media outlets that will be able to cover President Donald Trump closely.",
    "link": "https://www.ibtimes.com/fox-news-anchor-slams-white-house-hand-picking-press-pool-this-does-not-give-power-people-3764938",
    "timestamp": "2025-02-26T21:55:37Z"
  },
  {
    "title": "Nvidia sales surge in the fourth quarter on demand for AI chips",
    "description": "Nvidia on Wednesday reported a surge in fourth-quarter profit and sales as demand for its specialized Blackwell chips that power artificial intelligence systems continued to grow",
    "link": "https://abcnews.go.com/Business/wireStory/nvidia-sales-surge-fourth-quarter-demand-ai-chips-119228582",
    "timestamp": "2025-02-26T21:55:33Z"
  },
  {
    "title": "'No time to waste': Navy's ousted top officer speaks to staff after DOD leadership shakeup",
    "description": "Adm. Lisa Franchetti was the first woman to serve as the chief of naval operations and on the Joint Chiefs of Staff.",
    "link": "https://www.foxnews.com/politics/no-time-waste-navys-ousted-top-officer-speaks-staff-after-dod-leadership-shakeup",
    "timestamp": "2025-02-26T21:55:08Z"
  },
  {
    "title": "'No time to waste': Navy's ousted top officer speaks out after DOD leadership shakeup",
    "description": "Adm. Lisa Franchetti was the first woman to serve as the chief of naval operations and on the Joint Chiefs of Staff.",
    "link": "https://www.foxnews.com/politics/no-time-waste-navys-ousted-top-officer-speaks-out-after-dod-leadership-shakeup",
    "timestamp": "2025-02-26T21:55:08Z"
  },
  {
    "title": "Richmond Fed president says economy may face 'inflationary headwinds'",
    "description": "With Northern Virginia fearful of losing federal jobs, Richmond Fed President Tom Barkin says business leaders shouldn't forget about inflation.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_0cce3994-f46c-11ef-b10b-77ddee7de87e.html",
    "timestamp": "2025-02-26T21:55:00Z"
  },
  {
    "title": "US Rep Jasmine Crockett Tells Elon Musk To “F*** Off” In Viral Video, X Appreciates The Realness",
    "description": "Democratic Congresswoman Jasmine Crockett kept it real when asked what she would say if she had the opportunity to speak with Elon Musk.",
    "link": "https://hiphopwired.com/playlist/jasmine-crockett-cursing-out-elon-musk-viral-video-reactions/",
    "timestamp": "2025-02-26T21:54:35Z"
  },
  {
    "title": "Trump’s Cabinet meeting serves as a backdrop to Musk’s power | CNN Politics",
    "description": "If anyone was still in doubt where the power lies in President Donald Trump’s new administration, Wednesday’s first Cabinet meeting made clear it wasn’t in the actual Cabinet.",
    "link": "https://www.cnn.com/2025/02/26/politics/cabinet-meeting-musk-trump/index.html",
    "timestamp": "2025-02-26T21:54:14Z"
  },
  {
    "title": "US can no longer subsidize NATO – Rubio",
    "description": "Washington can no longer allow its Western European NATO allies to take advantage of US taxpayers, Secretary of State Marco Rubio has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613363-us-subsidize-nato-rubio/",
    "timestamp": "2025-02-26T21:54:00Z"
  },
  {
    "title": "What to know about CDL’s father-and-son duo and other family members in the business",
    "description": "More than 15 family members are reportedly involved in the Hong Leong Group, the conglomerate that controls CDL. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/what-to-know-about-cdls-father-and-son-duo-and-other-family-members-in-the-business",
    "timestamp": "2025-02-26T21:53:37Z"
  },
  {
    "title": "House unanimously passes bill to quadruple the pensions of Medal of Honor recipients",
    "description": "Legislation to quadruple pensions for Medal of Honor heroes passed the House Wednesday with strong bipartisan support and now goes to the United States Senate.",
    "link": "https://www.foxnews.com/politics/house-medal-honor-pension",
    "timestamp": "2025-02-26T21:53:33Z"
  },
  {
    "title": "Biden-Appointed Judge Blocking Trump’s ‘Spending Freeze’ Always Sides With The Left",
    "description": "Judge Loren AliKhan's decisions are usually outside common sense and in alignment with her own leftist political views.",
    "link": "https://thefederalist.com/2025/02/26/biden-appointed-judge-blocking-trumps-spending-freeze-always-sides-with-the-left/",
    "timestamp": "2025-02-26T21:52:42Z"
  },
  {
    "title": "Nvidia sales surge in Q4 on demand for AI chips",
    "description": "Nvidia Corp. reported a surge in fourth-quarter profit and sales as demand for its AI chips continued to grow. Find out more.",
    "link": "https://financialpost.com/investing/nvidia-sales-surge-q4-demand-ai-chips",
    "timestamp": "2025-02-26T21:52:13Z"
  },
  {
    "title": "Trump appeals court order to restart foreign aid as Catholic groups remain without funds",
    "description": "People wait outside a distribution point to receive aid rations in Oromia Region, Ethiopia, in February 2018. / Credit: Will Baxter/Catholic Relief Services\n\nWashington, D.C. Newsroom, Feb 26, 2025 / 16:50 pm (CNA).\nPresident Donald Trump’s administration is …",
    "link": "https://www.catholicnewsagency.com/news/262455/trump-appeals-court-order-to-restart-foreign-aid-as-catholic-groups-remain-without-funds",
    "timestamp": "2025-02-26T21:50:00Z"
  }
]