[
  {
    "title": "Modi-Trump meeting: What’s at stake for India in this MAGA-infused visit?",
    "description": "Prime Minister Narendra Modi arrives in Washington for a high-wire diplomatic visit, balancing India’s economic interests and strategic autonomy against a US driven by President Donald Trump’s “America First” agenda. Key discussions will cover trade, immigrat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/modi-trump-meeting-whats-at-stake-for-india-in-this-maga-infused-visit/articleshow/118190584.cms",
    "timestamp": "2025-02-12T20:28:16Z"
  },
  {
    "title": "Kennedy one step closer to confirmation as health secretary after Senate vote",
    "description": "Robert F. Kennedy Jr., a known vaccine critic, moved one step closer to becoming the nation’s health secretary Wednesday.",
    "link": "https://www.boston.com/news/politics/2025/02/12/kennedy-one-step-closer-to-confirmation-as-health-secretary-after-senate-vote/",
    "timestamp": "2025-02-12T20:27:46Z"
  },
  {
    "title": "By axing Alvin Bragg, Hochul can sweeten deal with Trump AND serve the city’s safety",
    "description": "Gov. Hochul should fire Alvin Bragg because he is bad at his job and loves criminals.",
    "link": "https://nypost.com/2025/02/12/opinion/by-axing-alvin-bragg-hochul-can-sweeten-deal-with-trump-and-serve-the-citys-safety/",
    "timestamp": "2025-02-12T20:27:46Z"
  },
  {
    "title": "Eby says U.S. economic integration 'last thing' B.C. wants, ahead of White House trip",
    "description": "British Columbia Premier David Eby says \"the last thing\" the province is considering is further economic integration with the United States, as he and other premiers prepare for a White House meeting with President Donald Trump's advisers.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/eby-us-tariffs-white-house-trip-1.7457498",
    "timestamp": "2025-02-12T20:26:01Z"
  },
  {
    "title": "Exclusive: Gabbard to meet with US allies in Munich on first trip as DNI",
    "description": "During her first full day as director of national intelligence, Tulsi Gabbard will meet with U.S. allies at the Munich Security Conference.",
    "link": "https://abcnews.go.com/Politics/exclusive-gabbard-meet-us-allies-munich-trip-dni/story?id=118737473",
    "timestamp": "2025-02-12T20:25:59Z"
  },
  {
    "title": "Grimes says son X Æ A-XII ‘should not be in the public like this’ after ex Elon Musk brings him to White House",
    "description": "On Tuesday, Musk brought the 4-year-old to a press conference in Oval Office with President Donald Trump before he signed an executive order slashing federal jobs.",
    "link": "https://pagesix.com/2025/02/12/parents/grimes-does-not-want-son-in-the-public-after-white-house-appearance-with-dad-elon-musk/",
    "timestamp": "2025-02-12T20:24:46Z"
  },
  {
    "title": "Trump Mocked After Blaming Bad Inflation Report On Biden",
    "description": "One social media user noted that Trump also took credit when the stock market was up under Biden, and asked, “How does anyone take this guy seriously?”",
    "link": "https://www.huffpost.com/entry/trump-mocked-for-blaming-bad-inflation-report-on-biden_n_67ace219e4b0239406decef9",
    "timestamp": "2025-02-12T20:24:09Z"
  },
  {
    "title": "How America's chief consumer-protection agency came into the Trump administration's crosshairs",
    "description": "When the Consumer Financial Protection Bureau made an appearance in the Heritage Foundation’s Project 2025 blueprint, the conservative group’s plan was simple: Abolish it entirely.",
    "link": "https://www.nbcnews.com/business/business-news/how-cfpb-came-under-trump-administration-attack-what-to-know-rcna191483",
    "timestamp": "2025-02-12T20:24:05Z"
  },
  {
    "title": "FRANKSPEECH NETWORK, INC further known as Mike Lindell Media Corp. (OTC Pink “FSBN”) Announces America's Mayor, Rudolph \"Rudy\" Giuliani Added to the Company Board of Directors.",
    "description": "Mayor Rudy Giuliani Has Accepted a Director Position with FrankSpeech Network, Inc. Further Known as Mike Lindell Media Corp. (OTC:PINK FSBN) Mayor Rudy Giuliani Has Accepted a Director Position with FrankSpeech Network, Inc. Further Known as Mike Lindell Med…",
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3025380/0/en/FRANKSPEECH-NETWORK-INC-further-known-as-Mike-Lindell-Media-Corp-OTC-Pink-FSBN-Announces-America-s-Mayor-Rudolph-Rudy-Giuliani-Added-to-the-Company-Board-of-Directors.html",
    "timestamp": "2025-02-12T20:24:00Z"
  },
  {
    "title": "Reciprocal Tariffs to Be Announced Tomorrow",
    "description": "\"President Donald Trump could announce his reciprocal tariff plan before he meets with Indian Prime Minister Narendra Modi on Thursday,\" CNBC reports. \"The apparently imminent move would underscore the extent to which Trump is making",
    "link": "https://politicalwire.com/2025/02/12/reciprocal-tariffs-to-be-announced-tomorrow/",
    "timestamp": "2025-02-12T20:22:49Z"
  },
  {
    "title": "Trump Punishes Mainstream Outlet For Refusing To Acknowledge Gulf Of America",
    "description": "President Donald Trump is holding media outlets accountable for refusing to abide by his executive order renaming the Gulf of Mexico the Gulf of America. He even shut one of the world’s biggest news sources out of a Tuesday evening news conference. News outle…",
    "link": "https://freerepublic.com/focus/f-chat/4297094/posts",
    "timestamp": "2025-02-12T20:22:41Z"
  },
  {
    "title": "Trump State Department official has repeatedly called for mass sterilization of people like Donald Trump [Murica]",
    "description": "Trump State Department official has repeatedly called for mass sterilization of people like Donald Trump",
    "link": "https://www.fark.com/comments/13559274/Trump-State-Department-official-has-repeatedly-called-for-mass-sterilization-of-people-like-Donald-Trump",
    "timestamp": "2025-02-12T20:21:52Z"
  },
  {
    "title": "‘The Boys From Brazil’: Jeremy Strong To Play Nazi Hunter In Series From ‘The Crown’s Peter Morgan",
    "description": "Jeremy Strong is heading into the final stretch of the Oscars season with the Best Supporting Actor nominee poised to potentially nab a statue for his compelling performance as Roy Cohn in the Donald Trump biopic, “The Apprentice.” While Strong has ended his …",
    "link": "https://theplaylist.net/jeremy-strong-the-boys-from-brazil-netflix-series-20250212/",
    "timestamp": "2025-02-12T20:21:34Z"
  },
  {
    "title": "MASSIVE DOWNSIZE: Why Trump’s Latest DOGE Order Will Help Restore Sanity to Our Government",
    "description": "While many Americans may be familiar with the three branches of government in the Constitution, fewer are aware of the fourth branch of government—a vast... Read More\nThe post MASSIVE DOWNSIZE: Why Trump’s Latest DOGE Order Will Help Restore Sanity to Our Gov…",
    "link": "https://www.dailysignal.com/2025/02/12/massive-downsize-why-trumps-latest-doge-order-will-help-restore-sanity-government/",
    "timestamp": "2025-02-12T20:21:23Z"
  },
  {
    "title": "‘Mr. Brexit’ advocates for UK DOGE over 'complete waste' of taxpayer money",
    "description": "Farage said Elon Musk’s DOGE investigations inspired him to reevaluate where British taxpayer money is going.",
    "link": "https://www.foxnews.com/politics/mr-brexit-advocates-uk-doge-over-complete-waste-taxpayer-money",
    "timestamp": "2025-02-12T20:21:11Z"
  },
  {
    "title": "Elon Musk Drops Bombshell on Social Security: ‘Magnitude of Fraud is Staggering’",
    "description": "Since President Donald Trump took office and appointed Elon Musk to head up the Department of Government Efficiency (DOGE), Musk and his team have been hard at work rooting out “fraud” and “abuse” throughout multiple government departments. From dismantling U…",
    "link": "https://biztoc.com/x/5c2bafc091b9f5c1",
    "timestamp": "2025-02-12T20:21:09Z"
  },
  {
    "title": "The Trump effect no longer boosts Tesla: Stock drops by nearly a third since peak",
    "description": "The close, almost familial relationship between Tesla CEO Elon Musk and the most powerful man in the world is no small matter when it comes to a company’s interests — especially when that man is Donald Trump, who is known for rewarding loyalty with personal f…",
    "link": "https://biztoc.com/x/0581feb31b847d5f",
    "timestamp": "2025-02-12T20:20:56Z"
  },
  {
    "title": "Why Are Soulja Boy and Marlon Wayans Beefing on Social Media?",
    "description": "Soulja Boy has not been shy about attacking people on social media, even if that person is not able to defend themselves. So it shouldn’t be a shock that the Atlanta rapper is attacking Marlon Wayans over comments he made a couple of weeks ago.Read more...",
    "link": "https://www.theroot.com/why-are-soulja-boy-and-marlon-wayans-beefing-on-social-1851761703",
    "timestamp": "2025-02-12T20:20:22Z"
  },
  {
    "title": "Trump upends US Ukraine policy, says he and Putin agreed to begin negotiations to end war",
    "description": "U.S. Defense Secretary Pete Hegseth said Ukraine joining NATO is unrealistic and suggested Kyiv should abandon hopes of winning back all its territory.",
    "link": "https://roanoke.com/news/nation-world/government-politics/russia-nato-zelenskyy-kyiv-europe-security/article_cbeee15e-2568-5039-97bf-d2acb3f8ef2c.html",
    "timestamp": "2025-02-12T20:20:00Z"
  },
  {
    "title": "Ben Folds Resigns from Advisory Position at Kennedy Center",
    "description": "Folds' decision to step down comes in response to Trump's self-appointment as chairman of the Kennedy Center.\nBen Folds Resigns from Advisory Position at Kennedy Center\nScoop Harrison",
    "link": "https://consequence.net/2025/02/ben-folds-resigns-from-advisory-position-at-kennedy-center/",
    "timestamp": "2025-02-12T20:19:24Z"
  },
  {
    "title": "Olympic boxer Imane Khelif fights back as boxing association files suit in gender row",
    "description": "Olympic champion Imane Khelif has accused the International Boxing Association of making “false and offensive” accusations after it launched legal action against the International Olympic Committee for allowing her to compete.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/olympic-boxer-imane-khelif-fights-back-boxing-association-files-suit-g-rcna191917",
    "timestamp": "2025-02-12T20:19:12Z"
  },
  {
    "title": "N.H. teens to fight Trump order on trans athletes",
    "description": "A 15-year-old soccer player and 14-year-old tennis player who are challenging New Hampshire's ban on transgender athletes on girls sports teams will now fight President Trump's executive order \"Keeping Men Out of Women's Sports.\"",
    "link": "https://www.espn.com/espn/story/_/id/43812374/teens-fight-trump-keep-men-women-sports-order",
    "timestamp": "2025-02-12T20:18:55Z"
  },
  {
    "title": "IDF increases reservists, special forces near Gaza, but mostly holding fire",
    "description": "Sources have told The Jerusalem Post there were no plans to attack anytime before playing out what Hamas will do on Saturday.",
    "link": "https://www.jpost.com/israel-news/defense-news/article-841903",
    "timestamp": "2025-02-12T20:18:08Z"
  },
  {
    "title": "Chicago Housing Development Shrinks Itself by 80% in Face of Trump Tariffs",
    "description": "Economists say tariffs could get in the way of Trump's promise to make housing more affordable.",
    "link": "https://www.newsweek.com/chicago-development-shrinks-trump-tariffs-2030178",
    "timestamp": "2025-02-12T20:18:00Z"
  },
  {
    "title": "Trump says Zelensky ready for peace",
    "description": "The US president made the comment after holding phone talks with both the Ukrainian and Russian leaders on Wednesday Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612607-trump-zelensky-wants-peace/",
    "timestamp": "2025-02-12T20:17:46Z"
  },
  {
    "title": "Why Trump 2.0 Looks Unstoppable",
    "description": "If they don't already, Democrats will soon wish that President Donald Trump had won reelection in 2020. \nIt's staggering what Trump has already accomplished....",
    "link": "https://www.realclearpolitics.com/articles/2025/02/12/why_trump_20_looks_unstoppable__152343.html",
    "timestamp": "2025-02-12T20:17:32Z"
  },
  {
    "title": "Trump Steel/Aluminum Tariffs Could Drive Up Car Insurance Costs",
    "description": "President Trump wants new tariffs on steel and aluminum, which could raise the cost of cars. But as the Wall Street Journal (WSJ) reported Wednesday (Feb. 12), these tariffs could also affect the price of car insurance. Car insurance costs, that report notes,…",
    "link": "https://www.pymnts.com/economy/2025/trump-steel-aluminum-tariffs-could-drive-up-car-insurance-costs/",
    "timestamp": "2025-02-12T20:17:13Z"
  },
  {
    "title": "Trump’s Anti-DEI Crusade Has a New Target: Comcast",
    "description": "Donald Trump’s Federal Communications Commission is taking aim at broadcast outlets for promoting diversity, equity, and inclusion programs, with Comcast, the parent company of NBC and Universal, being the first target. \r\nIn a letter sent to Comcast CEO Brian…",
    "link": "https://newrepublic.com/post/191472/fcc-comcast-dei-investigation",
    "timestamp": "2025-02-12T20:15:45Z"
  },
  {
    "title": "Scarlett Johansson Calls for New AI Laws After Fake Video of Her Goes Viral",
    "description": "Johansson said that AI is a far bigger threat than Kanye West.",
    "link": "https://gizmodo.com/scarlett-johansson-calls-for-new-ai-laws-after-fake-video-of-her-goes-viral-2000563076",
    "timestamp": "2025-02-12T20:15:39Z"
  },
  {
    "title": "Fighter Jet Crashes in San Diego, Caught on Video",
    "description": "A fighter jet crashed in San Diego Wednesday ... and, video captured the plane coming down to the earth in a shocking freefall. Check out the viral video of a two-seat EA-18G Growler plummeting out of the sky ... appearing in a flash before…",
    "link": "https://www.tmz.com/2025/02/12/navy-fighter-jet-crashes-san-diego-bay-video/",
    "timestamp": "2025-02-12T20:15:33Z"
  },
  {
    "title": "Donald Trump Announces That He’s Been Elected Chairman Of The Kennedy Center",
    "description": "Donald Trump announced that he has been elected the new chairman of the Kennedy Center, after he ousted about half of the arts organization’s board members who were appointed by Joe Biden. Trump posted on Truth Social, “President Donald J. Trump was just unan…",
    "link": "http://deadline.com/2025/02/trump-kennedy-center-chairman-1236287220/",
    "timestamp": "2025-02-12T20:15:13Z"
  },
  {
    "title": "Trump nominates Jonathan McKernan as director of CFPB",
    "description": "President Donald Trump has nominated Jonathan McKernan as the new director of the Consumer Financial Protection Bureau (CFPB), a major move in the administration's broader government restructuring. McKernan's nomination has been sent to the Senate for confirm…",
    "link": "https://www.inman.com/2025/02/12/trump-nominates-jonathan-mckernan-as-new-director-of-cfpb/",
    "timestamp": "2025-02-12T20:13:51Z"
  },
  {
    "title": "President DonalD J. Trump Brings Marc Fogel Home - The White House",
    "description": "President DonalD J. Trump Brings Marc Fogel HomeThe White House Accused Russian money launderer is being released in exchange for Marc FogelCNN U.S. to send cybercriminal Alexander Vinnik to Russia in prisoner swap for Marc FogelCBS News U.S. Is Releasing Rus…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176211443",
    "timestamp": "2025-02-12T20:13:43Z"
  },
  {
    "title": "DOGE Is Uncovering The Government Corruption America’s Media Spent Years Ignoring",
    "description": "DOGE has done more to unearth government corruption in one month than corporate media 'journalists' have done in years.",
    "link": "https://thefederalist.com/2025/02/12/doge-is-uncovering-the-government-corruption-americas-media-spent-years-ignoring/",
    "timestamp": "2025-02-12T20:13:27Z"
  },
  {
    "title": "Are Canadians really cancelling their trips to the U.S.? Here's what we found",
    "description": "Porter told the National Post it was 'mindful of the overall economic situation' and it was 'monitoring booking patterns' between the U.S. and Canada",
    "link": "https://nationalpost.com/news/canadians-cancel-trips-u-s-amid-tariffs-tension",
    "timestamp": "2025-02-12T20:12:36Z"
  },
  {
    "title": "'Ridiculous': Bondi personally strips DOJ walls of Biden, Harris, Garland portraits",
    "description": "Attorney General Pam Bondi called it \"ridiculous\" that portraits of former President Joe Biden, former Vice President Kamala Harris and former Attorney General Merrick Garland were still hanging on the Justice Department walls three days into Trump's term.",
    "link": "https://www.foxnews.com/politics/ridiculous-bondi-personally-strips-doj-walls-biden-harris-garland-portraits",
    "timestamp": "2025-02-12T20:12:32Z"
  },
  {
    "title": "ACLU lawsuit seeks access to migrants sent to Guantanamo Bay",
    "description": "WASHINGTON - The American Civil Liberties Union filed a lawsuit on Wednesday seeking access to dozens of migrants flown to a U.S. naval base in Guantanamo Bay, Cuba, saying they were being denied the right to an attorney. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/02/13/aclu-lawsuit-seeks-access-to-migrants-sent-to-guantanamo-bay",
    "timestamp": "2025-02-12T20:12:00Z"
  },
  {
    "title": "Belarus releases three detainees, including an American, White House says",
    "description": "WASHINGTON (Reuters) -Three detainees have been released from detention in Belarus, including one American, the White House said on Wednesday, as U.S. President Donald Trump looks to forge a deal to end the war in Ukraine with Minsk's ally, Russia. Read full …",
    "link": "https://www.thestar.com.my/news/world/2025/02/13/belarus-releases-three-detainees-including-an-american-white-house-says",
    "timestamp": "2025-02-12T20:12:00Z"
  },
  {
    "title": "Canada will be 'unequivocal' in its response to U.S. tariffs: Trudeau",
    "description": "'Canada will respond as appropriate in a calibrated but extremely strong way, regardless of what the U.S. moves forward with,' said Trudeau.",
    "link": "https://nationalpost.com/news/justin-trudeau-trump-tariff-threat-response",
    "timestamp": "2025-02-12T20:11:29Z"
  },
  {
    "title": "Illinois university sued after professor alleges he was fired for objecting to race-based hiring policies",
    "description": "The University of Illinois Chicago (UIC) is facing a lawsuit over its racial hiring quotas after a former professor claimed he was illegally “retaliated” against for objecting to its allegedly discriminatory practices. Professor Stephen Kleinschmit was a clin…",
    "link": "https://nypost.com/2025/02/12/us-news/illinois-university-sued-after-professor-alleges-he-was-fired-for-objecting-to-race-based-hiring-policies/",
    "timestamp": "2025-02-12T20:11:25Z"
  },
  {
    "title": "Did Kimberly Guilfoyle Just Soft-Launch a New Lover?",
    "description": "After receiving an enormous Valentine’s Day bouquet, the people are wondering — has she moved on from Don Jr.?",
    "link": "http://www.thecut.com/article/kimberly-guilfoyle-valentines-day-bouquet.html",
    "timestamp": "2025-02-12T20:11:06Z"
  },
  {
    "title": "Zelenskiy, Trump discuss 'opportunities to achieve peace' by phone",
    "description": "KYIV (Reuters) -Ukrainian President Volodymyr Zelenskiy said on Wednesday he spoke by phone with U.S. President Donald Trump and discussed \"opportunities to achieve peace\" and the preparation of a document governing security and economic cooperation. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/02/13/zelenskiy-trump-discuss-039opportunities-to-achieve-peace039-by-phone",
    "timestamp": "2025-02-12T20:11:00Z"
  },
  {
    "title": "Trump and Putin start Ukraine talks",
    "description": "Donald Trump and Vladimir Putin have discussed negotiations to end Russia's war in Ukraine, and NSW Police are investigating a video in which two nurses claimed they would kill Israeli patients.\nThe post Trump and Putin start Ukraine talks appeared first on C…",
    "link": "http://www.crikey.com.au/2025/02/13/donald-trump-vladimir-putin-ukraine-israel-nurses/",
    "timestamp": "2025-02-12T20:10:27Z"
  },
  {
    "title": "Soulja Boy, Marlon Wayans Engage in Most Unlikely Beef of 2025",
    "description": "Things get dark. Continue reading…",
    "link": "https://www.xxlmag.com/soulja-boy-marlon-wayans-beef/",
    "timestamp": "2025-02-12T20:10:23Z"
  },
  {
    "title": "Musk Defends DOGE in Rare Oval Office Appearance",
    "description": "President Donald Trump directed agencies to work with Elon Musk’s government cost-cutting effort to slash their workforces, according to a White House official, his latest move to gut the federal bureaucracy.\nTrump’s action orders agency heads to coordinate w…",
    "link": "https://biztoc.com/x/6ee16ac887b526bc",
    "timestamp": "2025-02-12T20:10:02Z"
  },
  {
    "title": "Treasuries tumble as inflation surprise reduces odds of interest-rate cut",
    "description": "U.S. government debt slid on Wednesday, sending yields higher across the range of maturities, after faster-than-expected inflation made investors less optimistic about the Federal Reserve cutting interest rates this year, especially given the unknown effects …",
    "link": "https://qz.com/treasuries-jerome-powell-interest-rate-cut-cpi-1851761783",
    "timestamp": "2025-02-12T20:10:00Z"
  },
  {
    "title": "Trans athlete Sadie Schreiner not competing for RIT women's track team after Trump's executive order",
    "description": "Transgender track and field runner Sadie Schreiner is not competing in future women's track events for Rochester Institute of Technology amid a new NCAA policy.",
    "link": "https://www.foxnews.com/sports/trans-athlete-sadie-schreiner-not-competing-rit-womens-track-team-after-trumps-executive-order",
    "timestamp": "2025-02-12T20:09:20Z"
  },
  {
    "title": "WH Official After Inflation Surge: Trump Is Tackling 'Lingering Damage of Biden's Failed Economic Policies'",
    "description": "Former President Joe Biden was in office for most of January, which saw an increase in inflation, and a White House official told Breitbart News that President Donald Trump \"is quickly undoing the lingering damage of\" the Biden administration's economic polic…",
    "link": "https://www.breitbart.com/politics/2025/02/12/wh-official-trump-tackling-lingering-damage-of-bidens-economic-policies/",
    "timestamp": "2025-02-12T20:08:10Z"
  },
  {
    "title": "What Does The Return Of The US Monroe Doctrine Mean For Cleantech?",
    "description": "After the first three weeks that Trump 2.0 has been unfolding, with a mix of absurd ego, drill baby drill, radical loyalty requirements, elimination of soft power, purging of ‘enemies’ and devastation of science, it’s worth asking what the foreign policy tea …",
    "link": "https://cleantechnica.com/2025/02/12/what-does-the-return-of-the-us-monroe-doctrine-mean-for-cleantech/",
    "timestamp": "2025-02-12T20:07:13Z"
  },
  {
    "title": "Tennessee governor to sign new school voucher program that will exclude some immigrant families",
    "description": "Gov. Bill Lee will sign legislation designed to drastically expand school voucher access throughout the Volunteer State that will allow families to use taxpayer dollars on private school expenses regardless of income",
    "link": "https://abcnews.go.com/Politics/wireStory/tennessee-governor-sign-new-school-voucher-program-exclude-118750506",
    "timestamp": "2025-02-12T20:06:46Z"
  },
  {
    "title": "Trump's former personal lawyer defends him at a Senate hearing and decries 'partisan lawfare'",
    "description": "President Donald Trump’s former personal attorney, Todd Blanche, criticized the criminal cases against the Republican as “partisan lawfare” during his confirmation hearing to become the No. 2 Justice Department official",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-former-personal-lawyer-defends-senate-hearing-decries-118749367",
    "timestamp": "2025-02-12T20:06:18Z"
  },
  {
    "title": "Elon Musk’s DOGE Job Approval Less Than 40% In New Poll, Trailing Nearly 10 Points Behind Trump",
    "description": "A new Economist/YouGov poll found less than 40% approve of the job Elon Musk is doing with DOGE, while Donald Trump is enjoying more favorable numbers.\nThe post Elon Musk’s DOGE Job Approval Less Than 40% In New Poll, Trailing Nearly 10 Points Behind Trump fi…",
    "link": "https://www.mediaite.com/politics/elon-musks-doge-job-approval-less-than-40-in-new-poll-trailing-nearly-10-points-behind-trump/",
    "timestamp": "2025-02-12T20:06:04Z"
  },
  {
    "title": "Venezuelans linked to 'violent cases' were on radar of Aurora authorities months before viral video: emails",
    "description": "Law enforcement officials in Aurora, Colorado knew of a surge in crime linked to Venezuelan migrants as early as the summer of 2023, emails reviewed by Fox News Digital show.",
    "link": "https://www.foxnews.com/politics/venezuelans-linked-violent-cases-on-radar-aurora-authorities-months-before-viral-video",
    "timestamp": "2025-02-12T20:04:37Z"
  },
  {
    "title": "Elon Musk Implausibly Claims 'Competence and Caring' Can Cut the Federal Budget Deficit in Half",
    "description": "Speaking to reporters for the first time since he took charge of the Trump administration's cost-cutting initiative, Elon Musk yesterday portrayed the",
    "link": "https://reason.com/2025/02/12/elon-musk-implausibly-claims-competence-and-caring-can-cut-the-federal-budget-deficit-in-half/",
    "timestamp": "2025-02-12T20:04:20Z"
  },
  {
    "title": "Senate Finance Committee approves Jamieson Greer, Trump's choice to be top U.S. trade negotiator",
    "description": "The Senate Finance Committee approved President Donald Trump’s choice to be America’s top trade negotiator Wednesday, largely along party lines. Jamieson Greer, an attorney and trade official in Trump’s first term, was cleared by the panel 15-12. All Republic…",
    "link": "https://www.seattlepi.com/news/politics/article/senate-finance-committee-approves-jamieson-greer-20163424.php",
    "timestamp": "2025-02-12T20:04:10Z"
  },
  {
    "title": "President Trump nominates Apple exec to serve as top auto safety administrator",
    "description": "President Donald Trump has nominated an Apple employee to serve as the nation's top auto safety regulator overseeing a number of…\nThe post President Trump nominates Apple exec to serve as top auto safety administrator appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/02/12/president-trump-nominates-apple-exec-to-serve-as-top-auto-safety-administrator/",
    "timestamp": "2025-02-12T20:03:45Z"
  },
  {
    "title": "Corewell resumes gender-affirming care for minors after brief pause",
    "description": "Corewell resumes gender-affirming care for minors after brief pausemlive.com",
    "link": "https://www.mlive.com/public-interest/2025/02/corewell-resumes-gender-affirming-care-for-minors-after-brief-pause.html",
    "timestamp": "2025-02-12T20:03:26Z"
  },
  {
    "title": "Van Hollen: Trump 'Lit a Fire and Threw It on a Keg of Gasoline' in the Middle East",
    "description": "Senator Chris Van Hollen (D-MD) said Wednesday on CNN's \"Newsroom Live\" that President Donald Trump's proposal to take over Gaza and turn it into a resort had \"lit a fire and thrown it on a keg of gasoline.\"\nThe post Van Hollen: Trump ‘Lit a Fire and Threw It…",
    "link": "https://www.breitbart.com/clips/2025/02/12/van-hollen-trump-lit-a-fire-and-threw-it-on-a-keg-of-gasoline-in-the-middle-east/",
    "timestamp": "2025-02-12T20:02:25Z"
  },
  {
    "title": "Marjorie Taylor Greene shares what's next for House DOGE panel, whether Elon Musk would testify",
    "description": "House GOP Rep. Marjorie Taylor Greene spoke with reporters after the first hearing of her DOGE subcommittee under the House Committee on Oversight.",
    "link": "https://www.foxnews.com/politics/marjorie-taylor-greene-shares-whats-next-house-doge-panel-whether-elon-musk-would-testify",
    "timestamp": "2025-02-12T20:02:04Z"
  },
  {
    "title": "Fred Hutton defends Florida vacation amid potential trade war, N.L. push to buy local",
    "description": "A Liberal cabinet minister from Newfoundland and Labrador is defending his decision to vacation in Florida last week at a time when his government was launching a buy-local campaign and U.S. President Donald Trump was threatening tariffs on Canadian products.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/hutton-vacation-tariffs-1.7457340",
    "timestamp": "2025-02-12T20:01:23Z"
  },
  {
    "title": "Trump Speaks to Putin, Zelensky to Start Negotiations to End War",
    "description": "Trump assigned VP JD Vance and Secretary of State Marco Rubio to lead the negotiating delegation.\nThe post Trump Speaks to Putin, Zelensky to Start Negotiations to End War first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/trump-speaks-to-putin-zelensky-to-start-negotiations-to-end-war/",
    "timestamp": "2025-02-12T20:00:56Z"
  },
  {
    "title": "Pete Hegseth Just Did the Funniest Thing Imaginable",
    "description": "It’s Fort Bragg again. So why are Confederate heritage groups so mad?",
    "link": "https://slate.com/news-and-politics/2025/02/fort-bragg-name-alvin-trump-pete-hegseth-liberty.html",
    "timestamp": "2025-02-12T20:00:44Z"
  },
  {
    "title": "Who is Kevin Brosseau, Canada's new 'fentanyl czar'?",
    "description": "The Harvard Law School graduate, originally from Alberta, has held several posts in the RCMP and at the federal government.",
    "link": "https://nationalpost.com/news/canada/who-is-canadas-fentanyl-czar-kevin-brosseau",
    "timestamp": "2025-02-12T20:00:44Z"
  },
  {
    "title": "Soulja Boy & Marlon Wayans Get Into Heated Spat Over Rap Career Slander",
    "description": "Soulja Boy and Marlon Wayans have got into a heated war of words online after the comedian mocked the rapper's appearance at the Crypto Ball.",
    "link": "https://hiphopdx.com/news/soulja-boy-marlon-wayans-heated-spat",
    "timestamp": "2025-02-12T20:00:41Z"
  },
  {
    "title": "Secretary Hegseth Says Ukraine Can’t Return to Old Borders, Will Not Be Part of NATO – Europeans Must Bear the Security Burden With No US Troops Acting as Peacemakers (VIDEO)",
    "description": "Pentagon chief Pete Hegseth addresses the implications of a potential draft amid the ongoing Ukraine conflict, shedding light on military readiness and national security concerns. Insights that warrant your attention.\nThe post Secretary Hegseth Says Ukraine C…",
    "link": "https://www.thegatewaypundit.com/2025/02/secretary-hegseth-says-ukraine-cant-return-old-borders/",
    "timestamp": "2025-02-12T20:00:40Z"
  },
  {
    "title": "Why Trump wants to buy Greenland — and how much it could cost",
    "description": "The U.S. has tried to buy Denmark before, but why does President Trump covet the Arctic territory today? Read here for more",
    "link": "https://financialpost.com/news/why-trump-wants-to-buy-greenland-and-how-much-it-could-cost",
    "timestamp": "2025-02-12T19:59:56Z"
  },
  {
    "title": "Dem shames GOP for not investigating '$8 million a day' Elon Musk gets from taxpayers - NewsBreak",
    "description": "Rep. Greg Casar (D-TX) on Wednesday let loose on Republicans for giving X owner Elon Musk a pass when it comes to government waste. During a House Departme",
    "link": "https://www.newsbreak.com/share/3806171692788-dem-shames-gop-for-not-investigating-8-million-a-day-elon-musk-gets-from-taxpayers?s=a2&share_destination_id=NzkwMzQ0Ni0xNzM5MzkwMzMwNjQ2&pd=00XA2wkM&hl=en_US&send_time=1739390330&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v9%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_recall_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v2",
    "timestamp": "2025-02-12T19:59:21Z"
  },
  {
    "title": "CFPB’s new leadership begins staff purge with dozens of employees terminated",
    "description": "The terminations have sowed more confusion at the bureau; several of those being laid off had already accepted federal buyout offers, said a person familiar.",
    "link": "https://www.cnbc.com/2025/02/12/cfpb-staff-purge-begins-with-dozens-of-employees-terminated.html",
    "timestamp": "2025-02-12T19:59:18Z"
  },
  {
    "title": "Federal health agencies restore webpages and datasets following judge’s order",
    "description": "The Centers for Disease Control and Prevention and the Food and Drug Administration brought back information following the judge's order on Tuesday.",
    "link": "https://www.valleynewslive.com/2025/02/12/federal-health-agencies-restore-webpages-datasets-following-judges-order/",
    "timestamp": "2025-02-12T19:58:47Z"
  },
  {
    "title": "Judge Blocking Trump Spending Freeze Likened Trump To A ‘Tyrant’ In Unearthed Video",
    "description": "The judge who is trying to force President Donald Trump to resume spending billions of taxpayer dollars likened Trump to a 'tyrant' in 2021.",
    "link": "https://thefederalist.com/2025/02/12/judge-blocking-trump-spending-freeze-likened-trump-to-a-tyrant-in-unearthed-video/",
    "timestamp": "2025-02-12T19:58:44Z"
  },
  {
    "title": "Judge Blocking Trump Spending Freeze Likened Trump To A ‘Tyrant’ In Unearthed Video",
    "description": "The judge who is trying to force President Donald Trump to resume spending billions of taxpayer dollars likened Trump to a 'tyrant' in 2021.",
    "link": "https://thefederalist.com/2025/02/12/judge-blocking-trump-spending-freeze-likened-trump-to-tyrant-in-unearthed-video/",
    "timestamp": "2025-02-12T19:58:44Z"
  },
  {
    "title": "What is DOGE? Here's everything you need to know about the Elon Musk-led effort to cut government spending",
    "description": "President Donald Trump tapped Tesla CEO Elon Musk to lead the Department of Government Efficiency.\nAndrew Harnik/Getty Images\nDOGE is one of the most ambitious efforts to reform the federal government in decades.\nElon Musk is working closely with President Tr…",
    "link": "https://biztoc.com/x/a8836df6b852e70b",
    "timestamp": "2025-02-12T19:58:35Z"
  },
  {
    "title": "US inflation got worse with rising groceries and gasoline prices",
    "description": "U.S. inflation accelerated last month as the cost of groceries and gasoline rose, a trend that will likely underscore the Federal Reserve’s resolve to delay any further interest rate cuts",
    "link": "https://abcnews.go.com/US/wireStory/us-inflation-worse-rising-groceries-gasoline-prices-118724194",
    "timestamp": "2025-02-12T19:58:17Z"
  },
  {
    "title": "Trump elected chair of the Kennedy Center by newly constituted board | CNN Politics",
    "description": "The newly constituted board of the Kennedy Center for the Performing Arts has elected President Donald Trump as its chairman.",
    "link": "https://www.cnn.com/2025/02/12/politics/kennedy-center-chair-trump-elected-board/index.html",
    "timestamp": "2025-02-12T19:57:25Z"
  },
  {
    "title": "Here’s Why a Judge Can’t Block Trump’s Pause on Spending",
    "description": "Shortly after taking office, President Donald Trump, quite sensibly, paused some federal spending programs to see whether they are lawful and advance America’s interests, which... Read More\nThe post Here’s Why a Judge Can’t Block Trump’s Pause on Spending app…",
    "link": "https://www.dailysignal.com/2025/02/12/judges-order-blocking-trumps-spending-pause-should-be-quickly-set-aside-appeal/",
    "timestamp": "2025-02-12T19:55:19Z"
  },
  {
    "title": "A how-to guide to dismantling the Education Department",
    "description": "Trump wants Musk to go after the Education Department. The administration needs to know there are three areas that the operation oversees, including $1.6 trillion in student loans.",
    "link": "https://www.foxnews.com/opinion/how-to-guide-dismantling-education-department",
    "timestamp": "2025-02-12T19:55:12Z"
  },
  {
    "title": "Trump adviser hails contacts with Putin",
    "description": "Steve Witkoff has highlighted the “great friendship” existing between the US and Russian presidents Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612600-trump-advisor-witkoff-putin-friendship/",
    "timestamp": "2025-02-12T19:54:43Z"
  },
  {
    "title": "Elon Musk calls Bush-appointed judge ‘evil’ after court orders Trump to restore CDC and health websites - NewsBreak",
    "description": "Elon Musk wants a federal judge to be “fired” after Donald Trump ’s administration was ordered to restore public health data that was removed from governm",
    "link": "https://www.newsbreak.com/share/3806594089156-elon-musk-calls-bush-appointed-judge-evil-after-court-orders-trump-to-restore-cdc-and-health-websites?s=a2&share_destination_id=MjYxNzc0MjcwLTE3Mzk0MDQ5MzU2OTQ%3D&pd=0HiNRexm&hl=en_US&send_time=1739404935&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v6%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v5%2Cns_push_exp_rt_bucketv12-v7",
    "timestamp": "2025-02-12T19:54:23Z"
  },
  {
    "title": "The Dirty Truth Behind Musk and Altman’s Mud Fight",
    "description": "The boys are fighting again. But this time the stakes are higher.",
    "link": "https://slate.com/technology/2025/02/elon-musk-sam-altman-feud-openai-trump-ai-policy.html",
    "timestamp": "2025-02-12T19:54:20Z"
  },
  {
    "title": "Waste.gov locks down after people discover it’s just a WordPress template",
    "description": "Waste.gov, a new government website registered by the Trump administration, has been hidden and locked down after 404 Media reported that it mostly displayed an unedited WordPress template. The archived version of the site contained the tagline, “Tracking gov…",
    "link": "https://www.theverge.com/news/611238/waste-gov-password-protected-wordpress-template",
    "timestamp": "2025-02-12T19:54:08Z"
  },
  {
    "title": "Exclusive: Dept. of Education Launches Investigation Into Two Athletic Associations That Publicly Defied Trump's Order Protecting Girls' Sports",
    "description": "The DOE is launching investigations into two blue state athletic associations who have publicly announced plans to flout Trump's executive order protecting women and girls' sports teams from the incursion of males who identify as transgender. \nThe post Exclus…",
    "link": "https://www.breitbart.com/politics/2025/02/12/exclusive-dept-education-launches-investigation-two-athletic-associations-publicly-defied-trumps-order-protecting-girls-sports/",
    "timestamp": "2025-02-12T19:53:59Z"
  },
  {
    "title": "Trump Bends The Knee To Putin",
    "description": "US President Donald Trump spoke with Russian President Vladimir Putin today. The United States has had a policy of “Nothing about Ukraine without Ukraine.” It looks like that is now at an end. Putin has wanted to negotiate spheres of interest with the United …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/trump-bends-the-knee-to-putin",
    "timestamp": "2025-02-12T19:53:57Z"
  },
  {
    "title": "Trump seeks ‘successful conclusion’ to Russia-Ukraine war",
    "description": "The White House spokeswoman says President Trump is looking to bring Russia’s war in Ukraine to a successful conclusion.",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/2/12/trump-seeks-successful-conclusion-to-russia-ukraine-war",
    "timestamp": "2025-02-12T19:53:49Z"
  },
  {
    "title": "White House Criticizes Court Rulings",
    "description": "The White House says court rulings going against the Trump administration are coming from \"judicial activists\" on the bench whose decisions amount to a \"constitutional crisis.\"",
    "link": "https://www.wcvb.com/article/white-house-criticizes-court-rulings-trump/63774983",
    "timestamp": "2025-02-12T19:53:44Z"
  },
  {
    "title": "Saudi Arabia launches ferocious state media attack on Netanyahu",
    "description": "Onslaught points to growing frustration in Gulf state’s royal court with Israeli prime minister and war in Gaza",
    "link": "https://www.irishtimes.com/world/middle-east/2025/02/12/saudi-arabia-launches-ferocious-state-media-attack-on-netanyahu/",
    "timestamp": "2025-02-12T19:53:29Z"
  },
  {
    "title": "What is DOGE? Here's everything you need to know about the Elon Musk-led effort to cut government spending.",
    "description": "The Department of Government Efficiency is one of the most ambitious efforts to reform US government. It could define President Trump's second term.",
    "link": "https://www.businessinsider.com/doge-department-of-government-efficiency",
    "timestamp": "2025-02-12T19:52:50Z"
  },
  {
    "title": "DAVID BLACKMON: Lee Zeldin Should Actually Speed One Thing Up At EPA",
    "description": "This really isn’t complicated.",
    "link": "https://dailycaller.com/2025/02/12/0pinion-lee-zeldin-epa-carbon-capture-permitting-david-blackmon/",
    "timestamp": "2025-02-12T19:52:45Z"
  },
  {
    "title": "WATCH: Democrats line up behind new talking point in campaign to undermine Trump",
    "description": "And president mocks them, assuring he, unlike Joe Biden, follows court orders",
    "link": "https://www.wnd.com/2025/02/watch-democrats-line-up-behind-new-talking-point-in-campaign-to-undermine-president-trump/",
    "timestamp": "2025-02-12T19:51:53Z"
  },
  {
    "title": "2 top ICE officials are reassigned amid Trump administration frustrations over immigration arrests",
    "description": "Two top immigration enforcement officials have been reassigned amid frustrations in the Trump administration about the pace of immigration arrests",
    "link": "https://abcnews.go.com/US/wireStory/2-top-ice-officials-reassigned-amid-trump-administration-118749376",
    "timestamp": "2025-02-12T19:50:51Z"
  },
  {
    "title": "Leftist Group ‘Families Over Billionaires’ Undermining Trump Admin In Cahoots With Billionaires",
    "description": "Families Over Billionaires assembled to undermine Trump’s tax cut policy, though the group has ties to several billionaires.",
    "link": "https://dailycaller.com/2025/02/12/leftist-group-families-over-billionaires-undermining-trump-admin-cahoots-billionaires/",
    "timestamp": "2025-02-12T19:50:36Z"
  },
  {
    "title": "Senate Finance Committee approves Jamieson Greer, Trump's choice to be top U.S. trade negotiator",
    "description": "The Senate Finance Committee approved President Donald Trump’s choice to be America’s top trade negotiator Wednesday, largely along party lines",
    "link": "https://abcnews.go.com/Business/wireStory/senate-finance-committee-approves-jamieson-greer-trumps-choice-118748837",
    "timestamp": "2025-02-12T19:50:20Z"
  }
]