[
  {
    "title": "SCOOP: Dept of Energy says it saved $700M in Trump's first 100 days by cutting 'wasteful' programs",
    "description": "During Trump's first 100 days in office, the Energy Department has immediately saved taxpayers $700 million. It is projected that over time the cuts will amount to a total savings of $3 billion.",
    "link": "https://www.foxnews.com/politics/scoop-dept-energy-says-saved-700m-trumps-first-100-days-cutting-wasteful-programs",
    "timestamp": "2025-04-28T14:20:07Z"
  },
  {
    "title": "60 Minutes Addresses Bill Owens’ Exit: ‘It Was Hard on Him and on Us”",
    "description": "The turmoil surrounding Owens' exit went public on Sunday night.",
    "link": "https://www.adweek.com/tvnewser/60-minutes-bill-owens-scott-pelley/",
    "timestamp": "2025-04-28T14:19:51Z"
  },
  {
    "title": "America May Leave the Ukraine Peace Talks Soon",
    "description": "Ukraine is resisting concessions, Russia is escalating nuclear threats and denouncing NATO involvement, and Western peacekeeping proposals stir controversy.\nThe post America May Leave the Ukraine Peace Talks Soon appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/buzz/america-may-leave-the-ukraine-peace-talks-soon",
    "timestamp": "2025-04-28T14:19:32Z"
  },
  {
    "title": "Russia declares unilateral 72-hour ceasefire in Ukraine to mark Victory Day in World War II",
    "description": "Russian President Vladimir Putin has ordered the truce will run from the start of May 8 and last through the end of May 10 to mark Moscow's defeat of Nazi Germany in 1945.",
    "link": "https://www.pbs.org/newshour/world/russia-declares-unilateral-72-hour-ceasefire-in-ukraine-to-mark-victory-day-in-world-war-ii",
    "timestamp": "2025-04-28T14:18:01Z"
  },
  {
    "title": "Trump’s justice department appointees remove managers of voting unit",
    "description": "Section is responsible for enforcing laws designed to prevent voter discrimination, raised alarm about voting rights enforcement",
    "link": "https://www.yahoo.com/news/trump-justice-department-appointees-remove-141750934.html",
    "timestamp": "2025-04-28T14:17:50Z"
  },
  {
    "title": "Trumpworld Is Ruled by Group Chats, Damning New Report Shows",
    "description": "A sprawling network of Signal group chats involving hundreds of top business executives, Silicon Valley leaders, and journalists, as well as legal and economic analysts, has massively reshaped national politics since the pandemic—in large part thanks to the p…",
    "link": "https://newrepublic.com/post/194469/donald-trump-world-ruled-group-chats-damning-report",
    "timestamp": "2025-04-28T14:17:48Z"
  },
  {
    "title": "Saquon Barkley fires back at critics over Trump hangout: ‘Not a hard concept’",
    "description": "Saquon Barkley was laughing about the public outrage over him hanging out with President Donald Trump on Sunday.",
    "link": "https://nypost.com/2025/04/28/sports/saquon-barkley-fires-back-at-critics-over-trump-hangout/",
    "timestamp": "2025-04-28T14:15:46Z"
  },
  {
    "title": "Portrait that Putin Gifted to Trump Unveiled, Wolfram Weimer Slated to Be Germany’s Culture Minister, Experts Argue Over Bayeux Tapestry Penises: Morning Links for April 28, 2025",
    "description": "Trump is shown a few pounds lighters and pumping his fist.",
    "link": "https://www.artnews.com/art-news/news/portrait-that-putin-gifted-to-trump-unveiled-wolfram-weimer-slated-to-be-germanys-culture-minister-1234739993/",
    "timestamp": "2025-04-28T14:15:16Z"
  },
  {
    "title": "A protective force must be deployed to occupied Palestine",
    "description": "States have the duty to stop genocide. Sending a peacekeeping force to Gaza and the West Bank would fulfil it.",
    "link": "https://www.aljazeera.com/opinions/2025/4/28/a-protective-force-must-be-deployed-to-occupied-palestine",
    "timestamp": "2025-04-28T14:15:09Z"
  },
  {
    "title": "Banking Industry Shifts: 14 Key Themes Set to Define 2025",
    "description": "Discover the 14 critical themes shaping the banking sector in 2025. This report offers predictions, winners, and further insights. With AI projected to surpass $1 trillion by 2030, banks aim for precise implementation by prioritizing key use cases. Explore st…",
    "link": "https://www.globenewswire.com/news-release/2025/04/28/3069366/28124/en/Banking-Industry-Shifts-14-Key-Themes-Set-to-Define-2025.html",
    "timestamp": "2025-04-28T14:15:00Z"
  },
  {
    "title": "IBM says it will invest $150 billion in the U.S. over 5 years",
    "description": "IBM (IBM) announced Monday it plans to invest $150 million in the U.S. in the next five years to “fuel the economy” and accelerate the country’s role as a “global leader in computing.”Read more...",
    "link": "https://qz.com/ibm-invests-150-billion-in-the-u-s-over-5-years-1851778076",
    "timestamp": "2025-04-28T14:15:00Z"
  },
  {
    "title": "OnePlus backs off its Watch 3’s huge price hike",
    "description": "OnePlus has reversed a big price hike for the Watch 3 and will sell the smartwatch for $349.99, OnePlus spokesperson Spencer Blank tells The Verge via email. That’s $20 more than the price it was initially announced at, but a big drop from the unexplained $49…",
    "link": "https://www.theverge.com/news/657170/oneplus-watch-3-price-hike-reversed",
    "timestamp": "2025-04-28T14:14:49Z"
  },
  {
    "title": "'Call your bluff': Political expert decries Trump tactic that any parent knows backfires",
    "description": "President Donald Trump's escalating threats have produced chaos and fear across American political and economic life, but that dynamic could ultimately undo his presidency as many of those ultimatums ring hollow.The president has been threatening to fire Fede…",
    "link": "https://www.rawstory.com/donald-trump-lunatic-agenda/",
    "timestamp": "2025-04-28T14:13:22Z"
  },
  {
    "title": "I Think The Government Broke the Online Passport Renewal Portal",
    "description": "Many U.S. citizens who already had passports were thrilled when the government, after several years of development and pilot programs, finally made online renewals a permanent feature. Besides being an…",
    "link": "https://yourmileagemayvary.com/2025/04/28/government-broke-online-passport-renewal-portal/",
    "timestamp": "2025-04-28T14:13:11Z"
  },
  {
    "title": "UN Food Programme To Slash Quarter Of Staff As Funding Falls",
    "description": "The UN World Food Programme will cut staff by 25 to 30 percent as funding for the global aid agency plummets, according to an internal email seen Monday by AFP.",
    "link": "https://www.ndtv.com/world-news/un-world-food-programme-to-slash-quarter-of-staff-as-funding-falls-8279165",
    "timestamp": "2025-04-28T14:12:59Z"
  },
  {
    "title": "Trump implies Canadians should vote for him on election day",
    "description": "U.S. President Donald Trump injected himself into the federal election on Monday, appearing to suggest Canadians vote for him when they go to the polls.",
    "link": "https://www.cbc.ca/news/politics/donald-trump-election-canada-truth-social-1.7520212",
    "timestamp": "2025-04-28T14:12:56Z"
  },
  {
    "title": "Trump fans gloat over FBI arrest of judge with ‘crying’ AI mugshot",
    "description": "Supporters of President Donald Trump gleefully shared what they believed to be the mugshot of Hannah Dugan, the county judge arrested by the FBI in Milwaukee last week for allegedly obstructing attempts by ICE to detain an undocumented immigrant.\n\n\nBut the im…",
    "link": "https://www.dailydot.com/debug/judge-hannah-dugan-mugshot-ai-debunk/",
    "timestamp": "2025-04-28T14:12:19Z"
  },
  {
    "title": "Saquon Barkley Defends Donald Trump Visit, 'I Respect The Office'",
    "description": "Saquon Barkley is addressing the backlash he's received for hangin' with Donald Trump on Sunday ahead of the Eagles' White House visit on Monday, making it clear he respects anyone who holds the office of the President! The Philadelphia Eagles star…\n Permalink",
    "link": "https://www.tmz.com/2025/04/28/saquon-barkley-defends-donald-trump-visit-white-house-eagles/",
    "timestamp": "2025-04-28T14:10:23Z"
  },
  {
    "title": "Donald Trump is making a huge mistake on one particular issue, reveals legendary conservative pundit Bill O’Reilly",
    "description": "Bill O'Reilly, a staunch Trump supporter, has criticized the president for defying a Supreme Court order regarding Kilmar Abrego Garcia, a Maryland resident wrongly deported to El Salvador. The Supreme Court had unanimously ruled that the US government must f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-is-making-a-huge-mistake-on-one-particular-issue-reveals-legendary-conservative-pundit-bill-oreilly/articleshow/120699303.cms",
    "timestamp": "2025-04-28T14:09:14Z"
  },
  {
    "title": "Trump to Put Sanctuary Cities and States on Notice with New Executive Order: Report",
    "description": "President Donald Trump will be putting more pressure on sanctuary cities that protect illegal immigrants, a new report says.",
    "link": "https://www.westernjournal.com/trump-put-sanctuary-cities-states-notice-new-executive-order-report/",
    "timestamp": "2025-04-28T14:08:37Z"
  },
  {
    "title": "Wall St mixed in start to busy week for earnings, data",
    "description": "(Reuters) -The S&P 500 and the Dow inched higher in choppy trading on Monday as investors braced for a week packed with key economic data and earnings from...",
    "link": "https://finance.yahoo.com/news/wall-street-set-muted-open-140755755.html",
    "timestamp": "2025-04-28T14:07:55Z"
  },
  {
    "title": "The Missing Immigration Document: Where Is The DHS Refugee Report?",
    "description": "The Trump administration appears to have missed an immigration deadline for a report on restarting the U.S. refugee admissions program.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/04/28/the-missing-immigration-document-where-is-the-dhs-refugee-report/",
    "timestamp": "2025-04-28T14:06:42Z"
  },
  {
    "title": "Matthew Dowd: Trump 'Has Broken Every Single' Election Promise",
    "description": "Failed Texas Democrat lieutenant gubernatorial candidate Matthew Dowd claimed Sunday on \"MSNBC Reports\" that President Donald Trump had broken \"every single promise that he made during the election.\"\nThe post Matthew Dowd: Trump ‘Has Broken Every Single’ Elec…",
    "link": "https://www.breitbart.com/clips/2025/04/28/matthew-dowd-trump-has-broken-every-single-election-promise/",
    "timestamp": "2025-04-28T14:05:01Z"
  },
  {
    "title": "Trump's second term will be the worst presidential term ever (Steven Greenhouse/The Guardian)",
    "description": "Steven Greenhouse / The Guardian:\nTrump's second term will be the worst presidential term ever  —  Tragically, the president's second term is already more lawless and more authoritarian than any in US history  —  In his first 100 days back in office, Donald T…",
    "link": "https://www.memeorandum.com/250428/p35",
    "timestamp": "2025-04-28T14:05:00Z"
  },
  {
    "title": "Trump Comments on Third Term Rumors—and It’s Not Exactly Reassuring",
    "description": "Donald Trump can’t help speculating about serving a third term as president—even as he claims “[i]t’s not something that I’m looking to do. And I think it would be a very hard thing to do.”\r\nThe president made the comments to The Atlantic in a new interview p…",
    "link": "https://newrepublic.com/post/194474/trump-comment-third-term",
    "timestamp": "2025-04-28T14:04:14Z"
  },
  {
    "title": "Trump to Target Sanctuary Cities",
    "description": "\"President Donald Trump will sign a pair of executive orders the White House says will help law enforcement implement his sweeping deportation agenda by cracking down on places that restrict cooperation with immigration enforcement,\" Bloomberg",
    "link": "https://politicalwire.com/2025/04/28/trump-to-target-sanctuary-cities/",
    "timestamp": "2025-04-28T14:02:50Z"
  },
  {
    "title": "'They have no leader!' Gleeful Trump gloats about state of Democratic Party",
    "description": "Three months into Donald Trump's second presidency, journalists Ashley Parker and Michael Scherer covered a lot of ground with him during a late April interview for The Atlantic — from foreign policy to immigration.The reporters also addressed embattled Defen…",
    "link": "https://www.rawstory.com/they-have-no-leader-gleeful-trump-gloats-about-state-of-dems/",
    "timestamp": "2025-04-28T14:01:38Z"
  },
  {
    "title": "Trump Melts Down Over Plummeting Popularity, Says Pollsters Are ‘Criminals’",
    "description": "President Donald Trump called pollsters \"criminals\" and demanded they be investigated after a series of polls showing declining approval ratings.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-melts-down-poll-numbers-investigations-1235326327/",
    "timestamp": "2025-04-28T14:01:11Z"
  },
  {
    "title": "Is Trump Shutting Down LGBTQ+ Suicide Hotline? What We Know",
    "description": "The Trump administration reportedly plans to eliminate the 988 Suicide & Crisis Lifeline's specialized services for LGBTQ+ youth.",
    "link": "https://www.newsweek.com/trump-shutting-lgbtq-suicide-hotline-2064986",
    "timestamp": "2025-04-28T14:01:04Z"
  },
  {
    "title": "How Ezra Klein’s YouTube Makeover Points to Podcasting’s TV Future",
    "description": "Major news outlets, like ‘The New York Times’ and ‘The Atlantic,’ and ex-cable stars, are finding audiences on YouTube. “It is television,” says ‘Mediaite’ founder Dan Abrams. “Anyone who still thinks of YouTube as something for your phone or computer isn’t p…",
    "link": "https://www.vanityfair.com/news/story/ezra-klein-youtube-dan-abrams-mediaite-new-york-times",
    "timestamp": "2025-04-28T14:01:04Z"
  },
  {
    "title": "China Insight: Under Dual Pressures of Tariffs and Inventory, China’s Fashion Industry Seeks a New Breakthrough",
    "description": "Facing economic headwinds at home and mounting external pressures, China’s fashion industry is entering a critical phase of transformation — aiming to evolve from a growth model driven by scale to one built on systemic resilience.",
    "link": "http://wwd.com/business-news/business-features/china-tariffs-economy-trump-fashion-industry-1237105483/",
    "timestamp": "2025-04-28T14:01:00Z"
  },
  {
    "title": "EXCLUSIVE: Indiana Middle School Hosted ‘Racially Exclusive Party’ For Students, New Complaint Alleges",
    "description": "An Indiana middle school is facing a civil rights complaint over a \"racially exclusive party\" one teacher hosted for select students in her class.",
    "link": "https://dailycaller.com/2025/04/28/indiana-middle-school-party-new-complaint/",
    "timestamp": "2025-04-28T14:00:50Z"
  },
  {
    "title": "Trump Demands Criminal Probe After Most Brutal Poll Numbers Yet",
    "description": "President Trump woke up early and angry Monday morning after multiple polls showed he has the lowest first 100 days approval rating of any president in the last 80 years. \r\n“Great Pollster John McLaughlin, one of the most highly respected in the industry, has…",
    "link": "https://newrepublic.com/post/194479/trump-criminal-probe-poll-numbers-100-days",
    "timestamp": "2025-04-28T14:00:39Z"
  },
  {
    "title": "Fired FTC commissioners on fighting for their jobs back",
    "description": "Today, we have something special for you: A few days ago, I hosted a panel with FTC commissioners Rebecca Slaughter and Alvaro Bedoya at the IAPP Global Privacy Summit in Washington, DC. We recorded the discussion, and we’re bringing it to you today. That’s a…",
    "link": "https://www.theverge.com/decoder-podcast-with-nilay-patel/657115/ftc-bedoya-slaughter-trump-fired-supreme-court-interview",
    "timestamp": "2025-04-28T14:00:17Z"
  },
  {
    "title": "Simpering Timidity",
    "description": "J.B. Pritzker is not messing around and unlike Gavin Newsom, he understands who will be voting in the 2028 Democratic primaries. Gov. JB Pritzker of Illinois strode into a ballroom filled with top New Hampshire Democrats on Sunday and by the end of his nearly…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/simpering-timidity",
    "timestamp": "2025-04-28T14:00:00Z"
  },
  {
    "title": "Squeezed By Tariffs, California Winemakers Fret About Future",
    "description": "California winemakers are worried that the Trump administration's tariffs could hurt their businesses for years to come.",
    "link": "https://www.forbes.com/sites/johnkell/2025/04/28/squeezed-by-tariffs-california-winemakers-fret-about-future/",
    "timestamp": "2025-04-28T14:00:00Z"
  },
  {
    "title": "Elite Universities Should Stop Digging Themselves Into a Hole",
    "description": "Elite universities are so determined to fight the Donald Trump administration that they’ve decided to double down on their antisemitism and stick with anti-Israel protestors and ideological rigidity. If they... Read More\nThe post Elite Universities Should Sto…",
    "link": "https://www.dailysignal.com/2025/04/28/elite-universities-should-stop-digging-themselves-into-a-hole/",
    "timestamp": "2025-04-28T14:00:00Z"
  },
  {
    "title": "Fox’s Peter Doocy Asks Karoline Leavitt if Trump Administration Would Ever Arrest a Supreme Court Justice After Milwaukee Judge Jailed",
    "description": "Fox's Peter Doocy asked White House Press Secretary Karoline Leavitt whether President Donald Trump's administration would ever arrest a Supreme Court Justice.\nThe post Fox’s Peter Doocy Asks Karoline Leavitt if Trump Administration Would Ever Arrest a Suprem…",
    "link": "https://www.mediaite.com/news/foxs-peter-doocy-asks-karoline-leavitt-if-trump-administration-would-ever-arrest-a-supreme-court-justice-after-milwaukee-judge-jailed/",
    "timestamp": "2025-04-28T13:59:06Z"
  },
  {
    "title": "‘I Run The Country And The World,’ Trump Boasts In Interview",
    "description": "The president answered a call from The Atlantic on his cellphone one Saturday afternoon with “who’s calling?”",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/28/i-run-the-country-and-the-world-trump-boasts-in-interview/",
    "timestamp": "2025-04-28T13:58:13Z"
  },
  {
    "title": "Op-ed: Trump's first 100 days - a plethora of achievements",
    "description": "President Trump's first 100 days are marked by a plethora of achievements. His flurry of success in such a short period of time distinguishes him as a rare man of action.",
    "link": "https://www.israelnationalnews.com/news/407528",
    "timestamp": "2025-04-28T13:55:54Z"
  },
  {
    "title": "Mark Carney's Chances Against Pierre Poilievre Drop",
    "description": "Carney's poll lead in Canada's election race has narrowed.",
    "link": "https://www.newsweek.com/canada-election-odds-mark-carney-pierre-poilievre-2064930",
    "timestamp": "2025-04-28T13:55:53Z"
  },
  {
    "title": "Elon Musk approval low, reflecting opposition to Trump cuts: POLL",
    "description": "Elon Musk approval low, reflecting opposition to Trump cuts: POLL\nViews of Musk’s work also are related to perceptions of waste in the government.\nElon Musk is well underwater in public views of his work for President Donald Trump, according to a new ABC News…",
    "link": "https://biztoc.com/x/28344d6d68bb47bb",
    "timestamp": "2025-04-28T13:55:49Z"
  },
  {
    "title": "Israel to Make Trade Concession",
    "description": "\"Israel plans to make a major regulatory concession to Washington in a bid to get a better deal from President Donald Trump over tariffs,\" Bloomberg reports. \"Israel told the US, its largest trading partner and",
    "link": "https://politicalwire.com/2025/04/28/israel-to-make-trade-concession/",
    "timestamp": "2025-04-28T13:55:20Z"
  },
  {
    "title": "A Road Map of Trump's Lawless Presidency, According to 35 Legal Scholars (New York Times)",
    "description": "New York Times:\nA Road Map of Trump's Lawless Presidency, According to 35 Legal Scholars  —  In his first hours back as president, Donald J. Trump did an extraordinary thing: He made a direct assault on the Constitution.  He declared that his government would…",
    "link": "https://www.memeorandum.com/250428/p30",
    "timestamp": "2025-04-28T13:55:00Z"
  },
  {
    "title": "Canada Votes as Trump Overshadows a Crucial Election. Here’s What to Know",
    "description": "Canadians head to the polls Monday to determine if Mark Carney or Pierre Poilievre will be PM. Here's what you need to know.",
    "link": "https://time.com/7280857/canada-election-carney-poilievre-trump-explainer/",
    "timestamp": "2025-04-28T13:54:25Z"
  },
  {
    "title": "Under Trump Order, Federal Unions May No Longer Be Able to Protect Poor Performers",
    "description": "First things first: President Donald Trump’s executive order on collective bargaining does not “strip unionization rights from most federal workers,” as some media outlets have... Read More\nThe post Under Trump Order, Federal Unions May No Longer Be Able to P…",
    "link": "https://www.dailysignal.com/2025/04/28/federal-unions-may-longer-be-able-protect-poor-performers-trump-order/",
    "timestamp": "2025-04-28T13:54:12Z"
  },
  {
    "title": "Indian, UK trade ministers meet to push for deal under added pressure from Trump",
    "description": "British and Indian trade ministers began two days of talks to finalise a long-delayed trade pact, driven by urgency from US tariffs. Negotiations focus on tariffs, regulations, and worker provisions, with leaders aiming to conclude after over three years.",
    "link": "https://economictimes.indiatimes.com/tech/technology/indian-uk-trade-ministers-meet-to-push-for-deal-under-added-pressure-from-trump/articleshow/120699563.cms",
    "timestamp": "2025-04-28T13:53:42Z"
  },
  {
    "title": "Brian Kilmeade's Logic For His Wild Trump Claim Prompts Internet Meltdown",
    "description": "The Fox News host made a bit of a reach in assessing Trump's presidency.",
    "link": "https://www.huffpost.com/entry/brian-kilmeade-trump-normal-presidency-dodgers_n_680f6a37e4b0c1c6dcd850ff",
    "timestamp": "2025-04-28T13:53:01Z"
  },
  {
    "title": "Saquon Barkley Responds to Critics After Spending Time with Donald Trump Ahead of Eagles' White House Trip",
    "description": "Some of Saquon Barkley‘s fans are not happy that he has been hanging out with President Donald Trump. If you don’t know, the Philadelphia Eagles are set to visit the White House today, though it’s unclear if the entire team will attend after Jalen Hurts‘ vira…",
    "link": "https://www.justjared.com/2025/04/28/saquon-barkley-responds-to-critics-after-spending-time-with-donald-trump-ahead-of-eagles-white-house-trip/",
    "timestamp": "2025-04-28T13:52:49Z"
  },
  {
    "title": "Gold declines Rs 1,000 to Rs 98,400/10 gm amid US-China trade deal optimism",
    "description": "NEW DELHI: Gold prices declined Rs 1,000 to Rs 98,400 per 10 grams in the national capital on Monday amid weak global trend, according to the All India Sarafa Association. The precious metal of 99.9 per cent purity had closed at Rs 99,400 per 10 grams on Thur…",
    "link": "https://statetimes.in/gold-declines-rs-1000-to-rs-98400-10-gm-amid-us-china-trade-deal-optimism/",
    "timestamp": "2025-04-28T13:52:31Z"
  },
  {
    "title": "Eagles star Saquon Barkley hangs out with Trump after Jalen Hurts dodges question on White House visit - CNN",
    "description": "Eagles star Saquon Barkley hangs out with Trump after Jalen Hurts dodges question on White House visitCNN Eagles' Saquon Barkley hangs out with Trump after teammate dodges question on White House visitFox News Eagles heading to the White House; Saquon Barkley…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177192273",
    "timestamp": "2025-04-28T13:52:16Z"
  },
  {
    "title": "Illinois Gov. J.B. Pritzker Calls for Democrats to Deny ‘Peace’ to Trump, Republicans",
    "description": "Illinois Gov. J.B. Pritzker told an audience of Democrats in New Hampshire on Sunday that they should take up mass protests against President Donald Trump and Republicans, denying them any “moment of peace.” The New York Times reported — admiringly: Gov. JB P…",
    "link": "https://freerepublic.com/focus/f-news/4313753/posts",
    "timestamp": "2025-04-28T13:51:46Z"
  },
  {
    "title": "It's the tariffs, stupid (Politico)",
    "description": "Politico:\nIt's the tariffs, stupid  —  Thanks for reading Ottawa Playbook.  —  Let's get into it.  —  → How do you stand up to DONALD TRUMP, anyway?  —  → PIERRE POILIEVRE and MARK CARNEY make their closing arguments.  —  → DOUG FORD's advice to the Conservat…",
    "link": "https://www.memeorandum.com/250428/p29",
    "timestamp": "2025-04-28T13:50:03Z"
  },
  {
    "title": "'If Canada becomes the cherished 51st US state...': Trump's big election message to Canadians",
    "description": "As Canadians voted in a major federal election, Donald Trump on Monday stirred a controversy by suggesting Canada should join the United States as its 51st state. Posting on his Truth Social platform, the US President described the border between the two nati…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-canada-elections-if-canada-becomes-the-cherished-51st-us-state-trumps-big-election-message-to-canadians/articleshow/120699365.cms",
    "timestamp": "2025-04-28T13:48:45Z"
  },
  {
    "title": "Promises made, promises kept? Trump’s agenda remains a work in progress after 100 days",
    "description": "As Donald Trump hits his 100th day in office Tuesday, his imprint is everywhere. But the long-term impact is often unclear.",
    "link": "https://www.bostonherald.com/2025/04/28/trump-100-days-promises-agenda/",
    "timestamp": "2025-04-28T13:48:11Z"
  },
  {
    "title": "Jalen Hurts won't attend Eagles' meeting with President Trump at the White House",
    "description": "Super Bowl MVP Jalen Hurts won't attend the Philadelphia Eagles' meeting with President Trump at the White House on Monday, NBC News confirmed.",
    "link": "https://www.nbcsportsboston.com/nfl/jalen-hurts-eagles-white-house-visit-president-donald-trump/706043/?partner=yahoo",
    "timestamp": "2025-04-28T13:46:42Z"
  },
  {
    "title": "RECAP | Photos of ex-world junior hockey players flashing championship rings shown at sex assault trial",
    "description": null,
    "link": "https://www.cbc.ca/news/canada/london/livestory/recap-photos-of-ex-world-junior-hockey-players-flashing-championship-rings-shown-at-sex-assault-trial-9.6738345",
    "timestamp": "2025-04-28T13:46:09Z"
  },
  {
    "title": "Photos of ex-world junior hockey players flashing championship rings shown at sex assault trial",
    "description": null,
    "link": "https://www.cbc.ca/news/canada/london/livestory/photos-of-ex-world-junior-hockey-players-flashing-championship-rings-shown-at-sex-assault-trial-9.6738345",
    "timestamp": "2025-04-28T13:46:09Z"
  },
  {
    "title": "Jim Cramer Says Palantir Technologies (PLTR) is the ‘Number One Meme Stock of All Time’",
    "description": "We recently published a list of 10 Stocks Analysts are Talking About Amid Trump’s Tariff War. In this article, we are going to take a look at where Palantir ...",
    "link": "https://finance.yahoo.com/news/jim-cramer-says-palantir-technologies-134543502.html",
    "timestamp": "2025-04-28T13:45:43Z"
  },
  {
    "title": "Elon Musk approval low, reflecting opposition to Trump cuts: POLL (Jaclyn S. Wong/ABC News)",
    "description": "Jaclyn S. Wong / ABC News:\nElon Musk approval low, reflecting opposition to Trump cuts: POLL  —  Views of Musk's work also are related to perceptions of waste in the government.  —  Elon Musk listens to President Donald Trump speak in the Oval Office of the W…",
    "link": "https://www.memeorandum.com/250428/p28",
    "timestamp": "2025-04-28T13:45:01Z"
  },
  {
    "title": "5 charts that show how Trump’s first 100 days have shaped Americans’ finances",
    "description": "After years of high inflation, President Donald Trump won back the White House on a promise to lower prices and improve Americans’ personal finances. “As president, I’m fighting every day to … make America affordable again,” he said in his joint address to Co…",
    "link": "https://biztoc.com/x/246b4cfb683ffeaa",
    "timestamp": "2025-04-28T13:44:59Z"
  },
  {
    "title": "Canadians Vote to Replace Justin Trudeau in Election Reshaped by Trump",
    "description": "Polls opened in Canada on Monday morning after a turbulent election season in which the ruling Liberals have attempted to make President Donald Trump the top issue of the race, while the Conservatives offer a departure from what they call the \"lost Liberal de…",
    "link": "https://www.breitbart.com/politics/2025/04/28/canadians-vote-to-replace-justin-trudeau-in-election-reshaped-by-trump/",
    "timestamp": "2025-04-28T13:44:57Z"
  },
  {
    "title": "'Frustrated' Trump Wants Putin to Go Further",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is \"increasingly frustrated\" by the leaders of Ukraine and Russia, and wants Russian President Vladimir Putin to go further than his declaration of a temporary ceasefire, the White House…",
    "link": "https://biztoc.com/x/c4cdf440bc9cee23",
    "timestamp": "2025-04-28T13:44:51Z"
  },
  {
    "title": "Analyst Says It’s Going to Be a ‘Rough’ Year for Apple (AAPL) Amid Tariff Impact",
    "description": "We recently published a list of 10 Stocks Analysts are Talking About Amid Trump’s Tariff War. In this article, we are going to take a look at where Apple Inc...",
    "link": "https://finance.yahoo.com/news/analyst-says-going-rough-apple-134451682.html",
    "timestamp": "2025-04-28T13:44:51Z"
  },
  {
    "title": "Trump claims he’s already struck 200 trade deals, but reality proves otherwise",
    "description": "Instead of successfully negotiating trade deals, Donald Trump wants to change the meaning of a what a “trade deal” is.",
    "link": "https://biztoc.com/x/b95944a7eaa880a1",
    "timestamp": "2025-04-28T13:44:20Z"
  },
  {
    "title": "Where is Justin Trudeau in the 2025 Canada election? How Mark Carney’s rise and Trudeau’s quiet exit reshaped the race and revived Liberal hopes",
    "description": "The story of Justin Trudeau's exit and Mark Carney’s rise has reshaped Canada’s 2025 election. Trudeau, after a decade in power, quietly stepped aside, giving way to Carney’s fresh leadership. As Donald Trump's return stirring fears across Canada, Carney posi…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/where-is-justin-trudeau-in-the-2025-canada-election-how-mark-carneys-rise-and-trudeaus-quiet-exit-reshaped-the-race-and-revived-liberal-hopes/articleshow/120698414.cms",
    "timestamp": "2025-04-28T13:43:34Z"
  },
  {
    "title": "'Carney's not the messiah!' How 10 Canadians decided who to back",
    "description": "The BBC spoke to eight voters asking who they voted for and what their main election issues are.",
    "link": "https://www.bbc.com/news/articles/c0r54kej8jwo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-28T13:41:55Z"
  },
  {
    "title": "Eagles' Saquon Barkley slams critics after hanging out with Trump",
    "description": "Philadelphia Eagles star Saquon Barkley defended his decision to hang out with President Donald Trump on Monday ahead of the team's Super Bowl celebration at the White House.",
    "link": "https://www.foxnews.com/sports/eagles-saquon-barkley-slams-critics-after-hanging-out-trump",
    "timestamp": "2025-04-28T13:41:00Z"
  },
  {
    "title": "Gold price falls big, experts predict near future gold rate",
    "description": "Gold rate was down today even as experts have predicted future bullion price.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-falls-big-experts-predict-near-future-gold-rate/articleshow/120699351.cms",
    "timestamp": "2025-04-28T13:40:52Z"
  },
  {
    "title": "‘Statesman’ Prince William is being praised for attending Pope Francis’s funeral",
    "description": "As we discussed on Sunday, Prince Harry stepped out at the Living Legends of Aviation event on Friday, specifically to honor the California firefighters and aerial crews who saved Southern California during the fires earlier this year. Then, on Saturday, Prin…",
    "link": "https://www.celebitchy.com/919721/statesman_prince_william_is_being_praised_for_attending_pope_franciss_funeral/",
    "timestamp": "2025-04-28T13:40:38Z"
  },
  {
    "title": "US Jews worry Trump's changes could change their milk's kosher status",
    "description": "Could changes at the FDA call the kosher status of milk into question? Many are asking.",
    "link": "https://www.israelnationalnews.com/news/407527",
    "timestamp": "2025-04-28T13:40:15Z"
  },
  {
    "title": "Ukraine issues ceasefire demand to Russia",
    "description": "Ukrainian Foreign Minister Andrey Sibiga has criticized Russia’s Victory Day ceasefire announcement and has called for a longer truce Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616440-ukraine-ceasefire-response/",
    "timestamp": "2025-04-28T13:39:53Z"
  },
  {
    "title": "'Frustrated' Trump Wants Putin to Go Further",
    "description": "Putin has announced a temporary ceasefire from the Russian side for a couple of days in May.",
    "link": "https://www.newsweek.com/frustrated-trump-wants-putin-go-further-2065024",
    "timestamp": "2025-04-28T13:39:07Z"
  },
  {
    "title": "Kashmir: Why an all-out India-Pakistan war is unlikely",
    "description": "Following the deadly attack in India-administered Kashmir, New Delhi has closed borders and cut nearly all ties with Pakistan. Are military strikes coming next? Ordinary people in Karachi, Pakistan's largest and most populous city, reacted to the news about a…",
    "link": "https://www.dw.com/en/kashmir-why-an-all-out-india-pakistan-war-is-unlikely/a-72374249",
    "timestamp": "2025-04-28T13:37:00Z"
  },
  {
    "title": "Kashmir: An all-out India-Pakistan war is unlikely",
    "description": "Following a deadly attack in India-administered Kashmir, New Delhi has closed borders and cut nearly all ties with Pakistan. Could military strikes be coming next? Ordinary people in Karachi, Pakistan's largest and most populous city, reacted to news about at…",
    "link": "https://www.dw.com/en/kashmir-an-all-out-india-pakistan-war-is-unlikely/a-72374249",
    "timestamp": "2025-04-28T13:37:00Z"
  },
  {
    "title": "Bill Maher Bashes Pete Hegseth as 'Worst Thing to Hit the Pentagon' Since 9/11",
    "description": "Comedian Bill Maher recently bashed Secretary of Defense Pete Hegseth, calling him the \"worst thing to hit the Pentagon\" since the September 11 terrorist attack.",
    "link": "https://www.breitbart.com/entertainment/2025/04/28/bill-maher-bashes-pete-hegseth-worst-thing-to-hit-the-pentagon-since-9-11/",
    "timestamp": "2025-04-28T13:36:24Z"
  },
  {
    "title": "Germany's next cabinet takes shape under leader-in-waiting Merz",
    "description": "Germany's conservatives under chancellor-in-waiting Friedrich Merz on Monday announced their cabinet ministers, including an outspoken Ukraine backer as foreign minister, before they are set to take power next week.",
    "link": "https://www.thelocal.de/20250428/germanys-next-cabinet-takes-shape-under-leader-in-waiting-merz",
    "timestamp": "2025-04-28T13:35:54Z"
  },
  {
    "title": "A World of Unintended Consequences",
    "description": "One of the great, underappreciated facts about our technology-driven age is that unintended consequences tend to outnumber intended ones. As much as we would like to believe that we are in control, scholars who have studied catastrophic failures have shown th…",
    "link": "https://www.project-syndicate.org/onpoint/technology-brings-more-unintended-consequences-than-intended-ones-by-edward-tenner-2025-04",
    "timestamp": "2025-04-28T13:35:19Z"
  },
  {
    "title": "Prediction Markets Traders Bet Big on Easy Liberal Win as Canadians Head to the Polls",
    "description": "Political betting platforms show Mark Carney leading with a 78% chance of becoming Canada's next Prime Minister, while Pierre Poilievre has a 22% chance.",
    "link": "https://www.coindesk.com/markets/2025/04/28/prediction-markets-traders-bet-big-on-easy-liberal-win-as-canadians-head-to-the-polls",
    "timestamp": "2025-04-28T13:34:15Z"
  },
  {
    "title": "Trump Team Stumbles Trying to Defend How Many Trade Deals He’s Made",
    "description": "Donald Trump’s outlandish claim that he’d struck 200 trade deals was a complete fiction, according to members of his own Cabinet. \r\nDuring an appearance on ABC News’s This Week Sunday, Treasury Secretary Scott Bessent admitted the president’s statement that h…",
    "link": "https://newrepublic.com/post/194467/donald-trump-scott-bessent-brooke-rollins-trade-deals",
    "timestamp": "2025-04-28T13:33:24Z"
  },
  {
    "title": "Five key quotes from Trump's interview with The Atlantic",
    "description": "President Trump mused on his political comeback and the first 100 days of his second term in a newly published interview with The Atlantic out Monday.\nThe big picture: The Atlantic's June cover story, \"Donald Trump Is Enjoying This,\" lays out Trump's thinking…",
    "link": "https://biztoc.com/x/90bf104ca054b679",
    "timestamp": "2025-04-28T13:33:12Z"
  },
  {
    "title": "Is Donald Trump losing trade war? America's allies are slowly leaning towards China",
    "description": "Donald Trump's trade policies are causing shifts in global alliances. America's allies are seeking economic stability with China. Trump's tariffs impact American companies. Shipping containers at the Port of Los Angeles are down. Xi Jinping is strengthening t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-donald-trump-losing-trade-war-americas-allies-are-slowly-leaning-towards-china/articleshow/120698255.cms",
    "timestamp": "2025-04-28T13:32:50Z"
  },
  {
    "title": "America is living in tariff limbo",
    "description": "For millions of people, any one of the many unprecedented actions in the first 100 days of the second Trump presidency was enough to show that the US is barreling toward - or has already arrived at - billionaire-helmed fascism. Sure, Elon Musk's Department of…",
    "link": "https://www.theverge.com/tech/656695/trump-tariffs-china-canada-mexico-trade-war-anxiety",
    "timestamp": "2025-04-28T13:32:45Z"
  },
  {
    "title": "Victor Davis Hanson Dismantles Narrative That Trump Is Governing Like A ‘Fascist’",
    "description": "Hoover Institution senior fellow Victor Davis Hanson refuted the narrative that President Donald Trump is governing as a fascist during a Thursday interview.",
    "link": "https://dailycaller.com/2025/04/28/victor-davis-hanson-blows-up-narrative-trump-fascist/",
    "timestamp": "2025-04-28T13:31:04Z"
  },
  {
    "title": "32 Amazing SNL Impressions Of Politicians",
    "description": "From Ford To Trump and everyone in between",
    "link": "https://www.cinemablend.com/television/amazing-snl-impressions-politicians",
    "timestamp": "2025-04-28T13:31:00Z"
  },
  {
    "title": "Bitcoin’s Most Unique Cycle In History: Here’s Why This Cycle Could Be Different",
    "description": "Just when crypto participants are discussing that Bitcoin seems to have entered a bearish phase due to its sharp pullback from its current all-time high and prolonged consolidation phase, the digital asset has rebounded strongly, revisiting levels like $95,00…",
    "link": "https://bitcoinist.com/bitcoins-most-unique-cycle/",
    "timestamp": "2025-04-28T13:30:24Z"
  },
  {
    "title": "The Race For Global Wealth Creators: Golden Visa Considerations",
    "description": "A \"gold card\" visa priced at $5 million could attract more entrepreneurs and wealth creators to the U.S.",
    "link": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/04/28/the-race-for-global-wealth-creators-golden-visa-considerations/",
    "timestamp": "2025-04-28T13:30:00Z"
  },
  {
    "title": "Nexo Reportedly Bringing Crypto Operation Back to US",
    "description": "Two years after paying a $45 million fine, cryptocurrency company Nexo is returning to America. As Reuters reported, the company announced this plan Sunday (April 28) at a conference in Sofia, Bulgaria while hosting Donald Trump, Jr., eldest son of the U.S. P…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/nexo-reportedly-bringing-crypto-operation-back-to-us/",
    "timestamp": "2025-04-28T13:29:41Z"
  },
  {
    "title": "Deporting the Cancer Kid",
    "description": "Plus: Pell Grant fraud, New York mayoral candidate defaulting on student loans, and more...",
    "link": "https://reason.com/2025/04/28/deporting-the-cancer-kid/",
    "timestamp": "2025-04-28T13:28:54Z"
  },
  {
    "title": "Gaza aid blockade imposed by Israel contested in International Court of Justice hearings",
    "description": "UN and Palestinian representatives at the International Court of Justice accused Israel of breaking international law by refusing to let aid into Gaza, on the first day of hearings about Israel's obligations to facilitate aid deliveries.",
    "link": "https://www.cbc.ca/news/world/gaza-united-nations-international-court-of-justice-blockade-1.7520183",
    "timestamp": "2025-04-28T13:28:21Z"
  },
  {
    "title": "Canadians vote in an election dominated by Trump’s trade war and bluster",
    "description": "Trump's truculence has infuriated many Canadians and led to a tightening of the race.",
    "link": "https://www.bostonherald.com/2025/04/28/canada-election/",
    "timestamp": "2025-04-28T13:27:46Z"
  },
  {
    "title": "President Donald Trump Wants Columbus Day Revival, But The Holiday Never Ended",
    "description": "President Donald Trump took to Truth Social and called for a revival of Columbus Day, despite the holiday never being removed.",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-columbus-day-revival-reactions/",
    "timestamp": "2025-04-28T13:27:17Z"
  },
  {
    "title": "EXCLUSIVE: UK, EU to frame partnership as bulwark against Trump turmoil",
    "description": "At a May summit, the UK will agree a broad \"strategic partnership\" with Brussels that includes a veiled rebuke of Washington.",
    "link": "https://www.euractiv.com/section/defence/news/exclusive-uk-eu-to-frame-partnership-as-bulwark-against-trump-turmoil/",
    "timestamp": "2025-04-28T13:27:06Z"
  },
  {
    "title": "We are not a serious country",
    "description": "Donald Trump’s poll numbers are cratering pretty much across the board, despite: (1) The larger economic effects of his idiotic tariff policies haven’t even hit yet, but will soon; and (2) Trump is doing exactly what he said he would do when he was running fo…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/04/we-are-not-a-serious-country",
    "timestamp": "2025-04-28T13:25:24Z"
  },
  {
    "title": "New Yorkers Boo and Jeer GOP's Lawler at Circus-Like Town Hall (Billy House/Bloomberg)",
    "description": "Billy House / Bloomberg:\nNew Yorkers Boo and Jeer GOP's Lawler at Circus-Like Town Hall  —  Boos, shouts and insults dominated New York Representative Mike Lawler's rowdy town hall on Sunday as the GOP lawmaker's constituents seethed over President Donald Tru…",
    "link": "https://www.memeorandum.com/250428/p22",
    "timestamp": "2025-04-28T13:25:00Z"
  }
]