[
  {
    "title": "Trump tariffs could ‘wipe out’ European steel sector, senior industry figure says",
    "description": "ThyssenKrupp executive warns of ‘collateral damage’ to supply chains and urges protective action on energy pricing",
    "link": "https://www.yahoo.com/news/trump-tariffs-could-wipe-european-141120987.html",
    "timestamp": "2025-06-08T14:11:20Z"
  },
  {
    "title": "‘I Can’t See Anything!’ Tear Gas Leaves Reporter Gasping for Breath in Stunning Live Hit from LA Protest",
    "description": "A reporter was left gasping for breath during a live hit — as federal law enforcement used tear gas to break up a demonstration in Los Angeles Saturday night.\nThe post ‘I Can’t See Anything!’ Tear Gas Leaves Reporter Gasping for Breath in Stunning Live Hit fr…",
    "link": "https://www.mediaite.com/media/news/i-cant-see-anything-tear-gas-leaves-reporter-gasping-for-breath-in-stunning-live-hit-from-la-protest/",
    "timestamp": "2025-06-08T14:06:30Z"
  },
  {
    "title": "Norm Eisen's Perfectly Legal Color Revolution Against Trump",
    "description": "Was there a coup? That question, when asked in the context of American politics, invites ridicule from respectable quarters. Yet when the subject turns to foreign regimes, that same question is treated with analytic seriousness. Political scientists pore over…",
    "link": "https://freerepublic.com/focus/f-chat/4321685/posts",
    "timestamp": "2025-06-08T14:03:48Z"
  },
  {
    "title": "Bitcoin At A Crossroads: $97,000 Cost Basis Holds Key To Next Breakout",
    "description": "Bitcoin prices have returned above $105,000 in the past 24 hours following a sharp price decline on Thursday triggered by macroeconomic pressures. Notably, US President Donald Trump and former political ally Elon Musk had engaged in a public spat which spiked…",
    "link": "http://www.newsbtc.com/news/bitcoin/bitcoin-at-a-crossroads-97000-cost-basis-holds-key-to-next-breakout/",
    "timestamp": "2025-06-08T14:00:24Z"
  },
  {
    "title": "For Trump, This Is a Dress Rehearsal",
    "description": "Ordering the National Guard to deploy in Los Angeles is a warning of what to expect when his hold on power is threatened.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/los-angeles-dress-rehearsal-trump/683078/",
    "timestamp": "2025-06-08T14:00:00Z"
  },
  {
    "title": "The Biggest Boondoggles in Trump’s Big Beautiful Bill",
    "description": "Trump’s tax bill, which robs from the poor to boost the rich, steers hundreds of billions of dollars into wasteful pet projects.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-tax-bill-biggest-boondoggles-waste-pentagon-1235358134/",
    "timestamp": "2025-06-08T14:00:00Z"
  },
  {
    "title": "Friends With Benefits: Stacey Abrams Funneled $20 Million to Her Lawyer",
    "description": "A nonprofit founded by Georgia Democratic politician Stacey Abrams to protect voting rights paid more than $20 million to a lawyer who is a close... Read More\nThe post Friends With Benefits: Stacey Abrams Funneled $20 Million to Her Lawyer appeared first on T…",
    "link": "https://www.dailysignal.com/2025/06/08/friends-with-benefits-stacey-abrams-funneled-20-million-to-her-lawyer/",
    "timestamp": "2025-06-08T14:00:00Z"
  },
  {
    "title": "Why Donald Trump is eyeing the sale of Fannie Mae and Freddie Mac",
    "description": "Elon Musk, the world’s richest man, is worth $381 billion, according to the Bloomberg Billionaires Index. A snip compared with Fannie Mae and Freddie Mac, a Washington couple cohabiting for decades. Their combined market value is estimated to be in the trilli…",
    "link": "https://biztoc.com/x/ee5624d13aceac52",
    "timestamp": "2025-06-08T13:59:30Z"
  },
  {
    "title": "White House aims to water down Russia sanctions bill – WSJ",
    "description": "Trump’s administration may leave the new legislation “toothless,” according to the Wall Street Journal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618802-trump-water-down-russia-sanctions/",
    "timestamp": "2025-06-08T13:52:33Z"
  },
  {
    "title": "WH official: Trump-Musk relations 'totally uncertain'",
    "description": "The future of the relationship between United States President Donald Trump and billionaire Elon Musk is \"totally uncertain,\" Politico reported on Sunday, citing an unnamed White House official. The s...",
    "link": "https://biztoc.com/x/3a3fc8d8e002f02c",
    "timestamp": "2025-06-08T13:48:33Z"
  },
  {
    "title": "Trump to Deploy National Guard in LA Amid ICE Protests",
    "description": "President Donald Trump has ordered the National Guard to Los Angeles as federal agents continue to clash with protesters in the wake of a series of immigration raids around the city. The president signed a memorandum federalizing 2,000 California National Gua…",
    "link": "https://biztoc.com/x/30030e18de134bd5",
    "timestamp": "2025-06-08T13:48:18Z"
  },
  {
    "title": "Johnson: Trump did 'exactly what he needed to do' in sending National Guard to LA",
    "description": "Johnson: Trump did 'exactly what he needed to do' in sending National Guard to LAgo.com",
    "link": "https://abcnews.go.com/Politics/johnson-trump-needed-sending-national-guard-la/story?id=122614224",
    "timestamp": "2025-06-08T13:42:06Z"
  },
  {
    "title": "Donald Trump to meet with key college sports decision-makers in golf outing where they'll discuss industry's future",
    "description": "The significance of the meeting cannot be overstated as it comes two days after the approval of a major court settlement that will shift the direction of college athletics.",
    "link": "https://sports.yahoo.com/college-football/article/donald-trump-to-meet-with-key-college-sports-decision-makers-in-golf-outing-where-theyll-discuss-industrys-future-134037159.html",
    "timestamp": "2025-06-08T13:40:37Z"
  },
  {
    "title": "Drivers put a brake on Tesla sales,",
    "description": "Seen & heard: Developers warn on housing policy; Billionaire hotelier’s Heathrow bid; and State urged to act on biogas",
    "link": "https://www.irishtimes.com/business/2025/06/08/drivers-put-a-brake-on-tesla-sales/",
    "timestamp": "2025-06-08T13:40:13Z"
  },
  {
    "title": "Coco Gauff says Trump's election led to 'down period' in US following French Open victory",
    "description": "After winning the 2025 French Open, Coco Gauff reflected on what it means to travel and represent the U.S., where she described time after Donald Trump's election as a \"down period.\"",
    "link": "https://www.foxnews.com/sports/coco-gauff-says-trumps-election-led-down-period-us-following-french-open-victory",
    "timestamp": "2025-06-08T13:38:44Z"
  },
  {
    "title": "The Quiet Unraveling of the Man Who Almost Killed Trump (New York Times)",
    "description": "New York Times:\nThe Quiet Unraveling of the Man Who Almost Killed Trump  —  Thomas Crooks was a nerdy engineering student on the dean's list.  He stockpiled explosive materials for months before his attack on Donald Trump, as his mental health eroded.  —  Tho…",
    "link": "https://www.memeorandum.com/250608/p21",
    "timestamp": "2025-06-08T13:35:01Z"
  },
  {
    "title": "Over 950K weekly downloads at risk in ongoing supply chain attack on Gluestack packages",
    "description": "A supply chain attack hit NPM, threat actors compromised 16 popular Gluestack packages, affecting 950K+ weekly downloads. Researchers from Aikido Security discovered a new supply chain attack targeted NPM, compromising 16 popular Gluestack ‘react-native-aria’…",
    "link": "https://securityaffairs.com/178772/malware/over-950k-weekly-downloads-at-risk-in-ongoing-supply-chain-attack-on-gluestack-packages.html",
    "timestamp": "2025-06-08T13:35:00Z"
  },
  {
    "title": "Iran claims without evidence that it took Israeli nuclear files",
    "description": "By JON GAMBRELL DUBAI, United Arab Emirates (AP) — Iran’s intelligence minister claimed without offering evidence Sunday that Tehran seized an “important treasury” of information regarding Israel’s nuclear program, ahead of a week in which the Islamic Republi…",
    "link": "https://www.bostonherald.com/2025/06/08/iran-claims-without-evidence-that-it-took-israeli-nuclear-files/",
    "timestamp": "2025-06-08T13:34:31Z"
  },
  {
    "title": "The modern appeal of Shakespeare",
    "description": "Why are the plays of William Shakespeare still so popular 400 years after his death? \"Sunday Morning\" talks with New York Times columnist Maureen Dowd and actor Patrick Page about the Bard's enduring tales – and the appeal of his villains.",
    "link": "https://www.cbsnews.com/news/the-modern-appeal-of-shakespeare/",
    "timestamp": "2025-06-08T13:32:07Z"
  },
  {
    "title": "Obama WH physician says Biden doc should have performed cognitive test",
    "description": "Obama's former doctor states Joe Biden should have undergone cognitive testing while Republicans probe claims of a cover-up of Biden's mental fitness.",
    "link": "https://www.foxnews.com/politics/obama-wh-physician-says-biden-doc-should-have-performed-cognitive-test",
    "timestamp": "2025-06-08T13:30:54Z"
  },
  {
    "title": "MUST SEE: The “Prodigal Musk” on X – Incredibly Moving, Remarkably Lifelike for and AI Production – Artistic Masterpiece by Ari Kuschnir",
    "description": "It was a very explosive public “breakup” this week between the richest and brilliant man in the world, Elon Musk, and the most powerful man in the world, President Donald Trump.\nThe post MUST SEE: The “Prodigal Musk” on X – Incredibly Moving, Remarkably Lifel…",
    "link": "https://www.thegatewaypundit.com/2025/06/must-see-prodigal-musk-x-incredibly-moving-remarkably/",
    "timestamp": "2025-06-08T13:30:47Z"
  },
  {
    "title": "What to know about Trump's deployment of National Guard troops to LA protests (Rebecca Boone/Associated Press)",
    "description": "Rebecca Boone / Associated Press:\nWhat to know about Trump's deployment of National Guard troops to LA protests  —  President Donald Trump says he's deploying 2,000 California National Guard troops to Los Angeles to respond to immigration protests, over the o…",
    "link": "https://www.memeorandum.com/250608/p18",
    "timestamp": "2025-06-08T13:30:00Z"
  },
  {
    "title": "Will Beijing De-Dollarize Or Dump US Treasury Debt?",
    "description": "Will Beijing De-Dollarize Or Dump US Treasury Debt?\n \nAuthored by Milton Ezrati via The Epoch Times,\nAnticipating what tactics Beijing might use against U.S. President Donald Trump amid trade negotiations, several media outlets here, in Europe, and elsewhere …",
    "link": "https://biztoc.com/x/d19fae3d2f47d376",
    "timestamp": "2025-06-08T13:26:13Z"
  },
  {
    "title": "The 100 ways Elon Musk and his companies allegedly benefited from working with Donald Trump",
    "description": "A new report accuses Elon Musk and the Trump administration of taking over 100 actions to benefit Musk’s companies. Here's what the report outlined.",
    "link": "https://biztoc.com/x/4f45bff2ddefd9c8",
    "timestamp": "2025-06-08T13:26:05Z"
  },
  {
    "title": "Donald Trump Is Destroying the Economy and Waging War on the Poor (Paul Krugman/Rolling Stone)",
    "description": "Paul Krugman / Rolling Stone:\nDonald Trump Is Destroying the Economy and Waging War on the Poor  —  Trump and MAGAnomics are wrecking the economy, dismantling democracy, and making America backward again  —  f you weren't deeply afraid months ago of what a se…",
    "link": "https://www.memeorandum.com/250608/p17",
    "timestamp": "2025-06-08T13:25:00Z"
  },
  {
    "title": "President Trump Slams Gavin Newsom and Karen Bass Over L.A. Riots",
    "description": "President Donald Trump slammed California’s top politicians for what he’s calling a complete leadership failure -- unleashing a fiery rant after ICE raids in Los Angeles ignited violent street clashes and left parts of the city in chaos. Trump…\n Permalink",
    "link": "https://www.tmz.com/2025/06/08/donald-trump-slams-gavin-newsom-los-angeles-riots/",
    "timestamp": "2025-06-08T13:22:28Z"
  },
  {
    "title": "Trump deploys National Guard to Los Angeles as anti-ICE riots rock city",
    "description": "'California's feckless Democrat leaders have completely abdicated their responsibility to protect their citizens'",
    "link": "https://www.wnd.com/2025/06/trump-deploys-national-guard-to-los-angeles-as-anti-ice-riots-rock-city/",
    "timestamp": "2025-06-08T13:20:40Z"
  },
  {
    "title": "Republicans are right to blanch at this Elon Musk gravy train (Washington Post)",
    "description": "Washington Post:\nRepublicans are right to blanch at this Elon Musk gravy train  —  Musk turned on Trump only after losing green subsidies from House GOP.  —  Elon Musk last week slammed President Donald Trump's “big, beautiful bill” for the trillions in new f…",
    "link": "https://www.memeorandum.com/250608/p16",
    "timestamp": "2025-06-08T13:20:00Z"
  },
  {
    "title": "Former Librarian of Congress Carla Hayden speaks out on her firing by Trump",
    "description": "Last month, Carla Hayden, the first woman and first African American to serve as Librarian of Congress, received an email announcing her dismissal. She talks about libraries as bastions of democracy, for which the \"freedom to read,\" she says, is essential.",
    "link": "https://www.cbsnews.com/news/former-librarian-of-congress-carla-hayden-speaks-out-on-her-firing-by-trump/",
    "timestamp": "2025-06-08T13:16:48Z"
  },
  {
    "title": "Trump White House sends message to Minnesota after trans softball pitcher leads team to state championship",
    "description": "The White House has responded to news of a transgender softball pitcher leading a team in Minnesota to a state championship, defying Trump.",
    "link": "https://www.foxnews.com/sports/white-house-sends-message-minnesota-after-trans-softball-pitcher-leads-team-state-championship",
    "timestamp": "2025-06-08T13:16:30Z"
  },
  {
    "title": "What is the US National Guard and how is it deployed?",
    "description": "The US National Guard is usually deployed to fight natural disasters, but it can be used for much more than that. What are its powers and who commands it? DW provides an overview.",
    "link": "https://www.dw.com/en/what-is-the-us-national-guard-and-how-is-it-deployed/a-72836481",
    "timestamp": "2025-06-08T13:14:00Z"
  },
  {
    "title": "What is the US National Guard and how is it deployed?",
    "description": "The US National Guard is usually deployed to fight natural disasters, but it can be used for much more than that. What are its powers and who commands it? DW provides an overview. However, US President Donald Trump has sent the National Guard to Los Angeles, …",
    "link": "https://www.dw.com/en/what-is-the-us-national-guard-and-how-is-it-deployed/a-72836481",
    "timestamp": "2025-06-08T13:14:00Z"
  },
  {
    "title": "Trump's CIA director details strategy using Mandarin videos to tap Chinese dissent for intelligence gains",
    "description": "John Ratcliffe discusses CIA's strategy to recruit Chinese informants through dark web communications while emphasizing his commitment to depoliticizing the intelligence agency.",
    "link": "https://www.foxnews.com/media/trumps-cia-director-details-strategy-using-mandarin-videos-tap-chinese-dissent-intelligence-gains",
    "timestamp": "2025-06-08T13:11:17Z"
  },
  {
    "title": "Trump orders National Guard to LA after clashes",
    "description": "US President Donald Trump has deployed the National Guard to Los Angeles following clashes over raids on undocumented migrants.\n\nAlso on the programme: we will hear from the President of the International Red Cross on Gaza; and the potential power of using \"p…",
    "link": "https://www.bbc.co.uk/programmes/w172zss32v8zj5d",
    "timestamp": "2025-06-08T13:10:00Z"
  },
  {
    "title": "Displaced Again and Again, Gazans Ask: Where Do We Go?",
    "description": "Fear in Gaza has surged again after Israeli forces threatened to turn Khan Younis refugee camp into barren swaths.",
    "link": "https://truthout.org/articles/displaced-again-and-again-gazans-ask-where-do-we-go/",
    "timestamp": "2025-06-08T13:09:25Z"
  },
  {
    "title": "Global streamers fight CRTC’s rule requiring them to fund Canadian content",
    "description": "Some of the world’s biggest streaming companies will argue in court on Monday that they shouldn’t have to make CRTC-ordered financial contributions to Canadian content and news.",
    "link": "https://toronto.citynews.ca/2025/06/08/global-streamers-fight-crtcs-rule-requiring-them-to-fund-canadian-content/",
    "timestamp": "2025-06-08T13:09:16Z"
  },
  {
    "title": "Trump’s War on OSHA Could Spell the End for Biden-Era Heat Protections",
    "description": "A proposed rule from the Biden administration would protect 36 million workers from the hazards of extreme heat.",
    "link": "https://truthout.org/articles/trumps-war-on-osha-could-spell-the-end-for-biden-era-heat-protections/",
    "timestamp": "2025-06-08T13:07:50Z"
  },
  {
    "title": "How Biden's attempt to add a constitutional amendment raises questions about his fitness",
    "description": "Former President Joe Biden attempted to add an amendment to the Constitution at a time when aides say he was in cognitive decline.",
    "link": "https://www.washingtonexaminer.com/in_focus/3434232/how-biden-constitutional-amendment-raises-questions-fitness/",
    "timestamp": "2025-06-08T13:05:38Z"
  },
  {
    "title": "DAVID MARCUS: CNN’s airing of ‘Good Night And Good Luck\" proves it has learned nothing",
    "description": "CNN's live telecast of \"Good Night and Good Luck\" draws criticism for comparing Trump to McCarthy while ignoring media's own failures in Biden coverage and Harris interview editing",
    "link": "https://www.foxnews.com/opinion/david-marcus-cnns-airing-good-night-good-luck-proves-has-learned-nothing",
    "timestamp": "2025-06-08T13:05:21Z"
  },
  {
    "title": "Trump Confirms Imminent Fed Decision—Bitcoin And Crypto Brace For Huge Price Earthquake",
    "description": "Bitcoin has struggled to break out in recent months despite hitting a fresh all-time high in May and fears building over a $37 trillion “ticking time bomb.”\nThe bitcoin price rocketed higher following U.S. president Donald Trump’s November election victory bu…",
    "link": "https://biztoc.com/x/3b31ce4ec782ab1b",
    "timestamp": "2025-06-08T13:03:57Z"
  },
  {
    "title": "Poll: Trump deportation program nets positive approval, contrasting views on scope",
    "description": "Americans think tariffs will lead to higher prices; Trump's perceived goals fare better than his approach.",
    "link": "https://www.cbsnews.com/news/deportation-immigration-opinion-poll/",
    "timestamp": "2025-06-08T13:03:27Z"
  },
  {
    "title": "Russia says pushing offensive into Ukraine's Dnipropetrovsk region",
    "description": "Russia announced its forces are pushing into Ukraine's Dnipropetrovsk region, marking a significant escalation in the conflict. This advance into a new region follows stalled peace talks where Moscow demanded Kyiv's concessions, including ending Western arms …",
    "link": "https://economictimes.indiatimes.com/news/defence/russia-says-pushing-offensive-into-ukraines-dnipropetrovsk-region/articleshow/121707691.cms",
    "timestamp": "2025-06-08T13:03:12Z"
  },
  {
    "title": "Chinese hackers and user lapses turn smartphones into a 'mobile security crisis'",
    "description": "Hackers tied to China's government have tried repeatedly to access the phones of prominent Americans, part of Beijing's sprawling cyberespionage efforts",
    "link": "https://abcnews.go.com/Technology/wireStory/chinese-hackers-user-lapses-turn-smartphones-mobile-security-122624673",
    "timestamp": "2025-06-08T13:02:13Z"
  },
  {
    "title": "Trump deploys National Guard, clashes with California officials over immigration raid unrest",
    "description": "Los Angeles protests against federal immigration raids enter third day, as Trump threatens to deploy the National Guard over objections by CA Gov. Gavin Newsom and L.A. Mayor Karen Bass.",
    "link": "https://www.nbcnews.com/news/us-news/live-blog/trump-los-angeles-immigration-protests-rcna211695",
    "timestamp": "2025-06-08T13:01:10Z"
  },
  {
    "title": "Donald Trump Is Destroying the Economy and Waging War on the Poor",
    "description": "Trump and MAGAnomics are wrecking the economy, dismantling democracy, and making America backward again, Paul Krugman writes",
    "link": "http://www.rollingstone.com/p/trump-destroy-economy-democracy-backward/",
    "timestamp": "2025-06-08T13:01:00Z"
  },
  {
    "title": "Sunday Summary: A Big Office Sale … in Los Angeles?",
    "description": "There have been interesting nine-figure office transactions in South Florida and New York City over the last few months — just last week Tishman Speyer spent $105.5 million on 148 Lafayette Street for its first U.S. office purchase since 2021 — but the big of…",
    "link": "http://commercialobserver.com/2025/06/sunday-summary-a-big-office-sale-in-los-angeles/",
    "timestamp": "2025-06-08T13:00:41Z"
  },
  {
    "title": "Trump Calls in National Guard to Quell Anti-ICE Violence in CA As Dem ‘Leaders’ Dither",
    "description": "\"If Governor Gavin Newscum, of California, and Mayor Karen Bass, of Los Angeles, can’t do their jobs, which everyone knows they can’t, then the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved!!!\"\nThe post Tr…",
    "link": "https://legalinsurrection.com/2025/06/trump-calls-in-national-guard-to-quell-anti-ice-violence-in-ca-as-dem-leaders-dither/",
    "timestamp": "2025-06-08T13:00:28Z"
  },
  {
    "title": "60 Minutes’ Scott Pelley Goes OFF About Potential Settlement With Trump: Would Be ‘Very Damaging’ to the Reputation of CBS",
    "description": "60 Minutes correspondent Scott Pelley went off on the potential settlement of the lawsuit brought by Trump over the show's interview with former VP Harris.\nThe post 60 Minutes’ Scott Pelley Goes OFF About Potential Settlement With Trump: Would Be ‘Very Damagi…",
    "link": "https://www.mediaite.com/media/news/60-minutes-scott-pelley-goes-off-about-potential-settlement-with-trump-would-be-very-damaging-to-the-reputation-of-cbs/",
    "timestamp": "2025-06-08T13:00:28Z"
  },
  {
    "title": "Afghans who helped US war effort feel betrayed by Trump’s travel ban | CNN Politics",
    "description": "When President Donald Trump’s issued a proclamation on Wednesday evening that citizens from Afghanistan, along with 11 other nations, would be blocked from coming to the United States, it added even more fear, uncertainty and for some, a sense of betrayal, fo…",
    "link": "https://www.cnn.com/2025/06/08/politics/afghans-who-helped-us-war-effort-feel-betrayed-by-trumps-travel-ban",
    "timestamp": "2025-06-08T13:00:05Z"
  },
  {
    "title": "Heather Cox Richardson: History Matters. Truth Matters. Here is a Plan.",
    "description": "Heather Cox Richardson is a historian so naturally she recoils at the daily misuse and distortion of history by Trump and his appointees. They don’t know much about history, and they want to distort it for partisan purposes. She has a plan to set the record s…",
    "link": "https://dianeravitch.net/2025/06/08/heather-cox-richardson-history-matters-truth-matters/",
    "timestamp": "2025-06-08T13:00:00Z"
  },
  {
    "title": "“It’s not just one”: Target customer spots Pride collection. Then they take a closer look at the tags",
    "description": "A Target customer went viral on TikTok after calling out the store’s tone-deaf Pride collection.\n\n\nUser @riversidechat, a former Target employee, said they visited the store last week and checked out its Pride section—only to notice something bizarre.\n\n\nSever…",
    "link": "https://www.dailydot.com/news/target-pride-collection-lorem-ipsum/",
    "timestamp": "2025-06-08T13:00:00Z"
  },
  {
    "title": "$3.3 Trillion Energy Boom: Renewables Soar As Grid Bottlenecks Loom",
    "description": "The unprecedented dollars flowing into renewable energy aren’t just reshaping power markets—they mark a tipping point in the global energy transition.",
    "link": "https://www.forbes.com/sites/kensilverstein/2025/06/08/33-trillion-energy-boom-renewables-soar-as-grid-bottlenecks-loom/",
    "timestamp": "2025-06-08T13:00:00Z"
  },
  {
    "title": "Breaking down claims Stephen Miller's wife, Katie, left him for Elon Musk",
    "description": "Reports that Katie Miller left DOGE to work for Musk led the internet to speculate she had left her husband for the tech magnate, too.",
    "link": "https://www.snopes.com//news/2025/06/07/musk-stephen-miller-wife/",
    "timestamp": "2025-06-08T13:00:00Z"
  },
  {
    "title": "Florida farmers now plowing over perfectly good tomatoes as Trump’s tariff policies cause prices to plummet",
    "description": "Deportations, cheap imports eat into profits.",
    "link": "https://www.yahoo.com/news/florida-farmers-now-plowing-over-130000347.html",
    "timestamp": "2025-06-08T13:00:00Z"
  },
  {
    "title": "Usyk invites Trump to 'live in my house' to experience Ukraine war",
    "description": "Unified heavyweight champion Oleksandr Usyk offers US president Donald Trump the chance to live in his house for a week to experience the reality of the war in Ukraine.",
    "link": "https://www.bbc.com/sport/boxing/videos/c201j1d5p0do",
    "timestamp": "2025-06-08T12:55:01Z"
  },
  {
    "title": "Ukraine Destroys 13 Russian Tanks, 100 Armored Vehicles as Locomotive Hit",
    "description": "The Southern Defense Forces of Ukraine has struck a Russian train carrying military equipment.",
    "link": "https://www.newsweek.com/russia-ukraine-military-war-2082437",
    "timestamp": "2025-06-08T12:47:55Z"
  },
  {
    "title": "Trump deploys California National Guard to LA to quell protests despite the governor's objections",
    "description": "President Donald Trump is deploying 2,000 California National Guard troops despite the governor’s objections to Los Angeles, where protests led to clashes between immigration authorities and demonstrators",
    "link": "https://www.boston.com/news/immigration/2025/06/08/trump-deploys-california-national-guard-to-la-to-quell-protests-despite-the-governors-objections/",
    "timestamp": "2025-06-08T12:47:49Z"
  },
  {
    "title": "Senate Judiciary Committee declassifies FBI’s files outlining plot to undermine Trump",
    "description": "The Federal Bureau of Investigation has been hiding the truth from Congress and the public, and they’ve just been caught. Senate Judiciary Committee Chairman Chuck Grassley on Friday called for an investigation of the internal tools the G-men have been using …",
    "link": "https://freerepublic.com/focus/f-chat/4321672/posts",
    "timestamp": "2025-06-08T12:47:39Z"
  },
  {
    "title": "Russia says pushing offensive into Ukraine’s Dnipropetrovsk region",
    "description": "Russia said Sunday it was pushing into Ukraine’s eastern industrial Dnipropetrovsk region for the first time in its three-year offensive — a significant territorial escalation amid stalled peace talks. Moscow, which has the initiative on the battlefield, has …",
    "link": "https://www.digitaljournal.com/world/russia-says-pushing-offensive-into-ukraines-dnipropetrovsk-region/article",
    "timestamp": "2025-06-08T12:47:20Z"
  },
  {
    "title": "Pope Leo condemns ‘exclusionary mindset’ in Pentecost address",
    "description": "Pope Leo XIV exhorted the faithful on Sunday to reject an “exclusionary mindset” he said had led to nationalism around the world. Leo’s homily did not call out current events and conflicts nor identify individual leaders. But his choice of language was signif…",
    "link": "https://www.digitaljournal.com/world/pope-leo-condemns-exclusionary-mindset-in-pentecost-address/article",
    "timestamp": "2025-06-08T12:47:20Z"
  },
  {
    "title": "Adam Schiff Defends 'Insurrection' in L.A. Against Federalized National Guard",
    "description": "California Sen. Adam Schiff (D), who served on the January 6 Committee accusing protesters of insurrection, backed an insurrection Saturday against federal law enforcement arresting illegal aliens in Los Angeles.\nThe post Adam Schiff Defends ‘Insurrection’ in…",
    "link": "https://www.breitbart.com/politics/2025/06/08/adam-schiff-defends-insurrection-in-l-a-against-federalized-national-guard/",
    "timestamp": "2025-06-08T12:46:42Z"
  },
  {
    "title": "Trump and Musk aides have spoken amid pause in hostilities (Politico)",
    "description": "Politico:\nTrump and Musk aides have spoken amid pause in hostilities  —  A behind-the-scenes look at what irked Trump the most.  —  The shaky detente in the social media strife between President Donald Trump and Elon Musk is holding following a call between r…",
    "link": "https://www.memeorandum.com/250608/p9",
    "timestamp": "2025-06-08T12:45:00Z"
  },
  {
    "title": "JD Vance reacts to Donald Trump and Elon Musk feud following Epstein file claim in heated X rant",
    "description": "US Vice President JD Vance claimed to have not seen Elon Musk's claims about Donald Trump being in 'the Epstein files'.",
    "link": "https://www.ladbible.com/news/politics/jd-vance-elon-musk-reaction-donald-trump-epstein-045814-20250608",
    "timestamp": "2025-06-08T12:40:37Z"
  },
  {
    "title": "Chinese hackers, user lapses turn smartphones into 'mobile security crisis'",
    "description": "A sophisticated cyberattack, potentially linked to Chinese hackers, targeted smartphones of individuals in government, politics, tech, and journalism, raising concerns about mobile device vulnerabilities. US authorities are increasingly focused on China's cyb…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/chinese-hackers-user-lapses-turn-smartphones-into-mobile-security-crisis/articleshow/121707494.cms",
    "timestamp": "2025-06-08T12:39:07Z"
  },
  {
    "title": "Live updates: Trump deploys National Guard to LA in response to immigration clashes | CNN Politics",
    "description": "President Donald Trump signed a presidential memorandum deploying 2,000 National Guardsmen to Los Angeles to disperse protests that began in response to immigration raids, the White House said last night. Follow for live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-presidency-news-06-08-25",
    "timestamp": "2025-06-08T12:38:40Z"
  },
  {
    "title": "'Have my house' - Usyk invites Trump to witness Ukraine war",
    "description": "Ukrainian heavyweight champion Oleksandr Usyk offers his house to US president Donald Trump to experience the war in his country.",
    "link": "https://www.bbc.com/sport/boxing/articles/c4gej271x22o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-08T12:35:18Z"
  },
  {
    "title": "'Have my house' - Usyk invites Trump to witness Ukraine war",
    "description": "Ukrainian heavyweight champion Oleksandr Usyk offers his house to US president Donald Trump to experience the war in his country.",
    "link": "https://www.bbc.com/sport/boxing/articles/c4gej271x22o",
    "timestamp": "2025-06-08T12:35:15Z"
  },
  {
    "title": "Trump: $100 Million Ballroom For Me; No Health Care For You!",
    "description": "Trump also paused his adolescent feud with former Co-president Elon Musk to boast about the royal trappings the wannabe dictator longs for.\nVia Raw Story:\nPresident Donald Trump bragged that he was funding a \"beautiful Ballroom\" attached to the White House in…",
    "link": "https://crooksandliars.com/2025/06/trump-100-million-ballroom-me-no-health",
    "timestamp": "2025-06-08T12:33:27Z"
  },
  {
    "title": "Trump Federalizes CA Guard, Says He Will Send Troops To L.A.",
    "description": "So far, the national media mostly has taken the weekend off. As far as I know, no \"rioting and looting.\" Via BBC.com:\nUS President Donald Trump is deploying 2,000 National Guardsmen in Los Angeles to deal with unrest over raids on undocumented migrants.\r\n\nHis…",
    "link": "https://crooksandliars.com/2025/06/trump-federalizes-ca-guard-says-he-will",
    "timestamp": "2025-06-08T12:33:18Z"
  },
  {
    "title": "Bitcoin Rebound From $100,000 – Healthy Pullback Or Start Of Deeper Correction?",
    "description": "On Thursday, Bitcoin (BTC) prices dipped to below $101,000 as fallout between US President Donald Trump and world’s wealthiest man Elon Musk rocked the US financial markets. However, in the past 48 hours, the maiden cryptocurrency has registered a rebound cli…",
    "link": "https://bitcoinist.com/bitcoin-rebound-100000-pullback-deeper-correction/",
    "timestamp": "2025-06-08T12:30:49Z"
  },
  {
    "title": "What Hitler, Putin And Trump May Have In Common — By A Psychologist",
    "description": "Recent research reveals that the roots of a power-hungry leadership style may lie in early childhood experiences of trauma.",
    "link": "https://www.forbes.com/sites/traversmark/2025/06/08/what-hitler-putin-and-trump-may-have-in-common---by-a-psychologist/",
    "timestamp": "2025-06-08T12:30:43Z"
  },
  {
    "title": "Trump Taps Musk to “Rebuild Government from the Ground Up,” Says One Tech Insider",
    "description": "New briefing uncovers AI facility in Tennessee designed to power America’s future — and it’s not run by Washington, but by Elon Musk New briefing uncovers AI facility in Tennessee designed to power America’s future — and it’s not run by Washington, but by Elo…",
    "link": "https://www.globenewswire.com/news-release/2025/06/08/3095566/0/en/Trump-Taps-Musk-to-Rebuild-Government-from-the-Ground-Up-Says-One-Tech-Insider.html",
    "timestamp": "2025-06-08T12:30:00Z"
  },
  {
    "title": "U.S.-Backed Aid Project in Gaza Reopens After Threats from Hamas",
    "description": "The Gaza Humanitarian Foundation (GHF) reopened on Sunday after closing for the day on Saturday due to specific threats from Hamas, which opposes the project because it undermines its control over access to aid.\nThe post U.S.-Backed Aid Project in Gaza Reopen…",
    "link": "https://www.breitbart.com/middle-east/2025/06/08/u-s-backed-aid-project-in-gaza-reopens-after-threats-from-hamas/",
    "timestamp": "2025-06-08T12:25:35Z"
  },
  {
    "title": "June 7, 2025 — In April, John Phelan, the U.S. Secretary of the Navy under President Donald J. Trump ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nJune 7, 2025  —  In April, John Phelan, the U.S. Secretary of the Navy under President Donald J. Trump, posted that he visited the U.S.S. Arizona Memorial “to pay my respects to the service members and civili…",
    "link": "https://www.memeorandum.com/250608/p6",
    "timestamp": "2025-06-08T12:25:00Z"
  },
  {
    "title": "Chinese hackers and user lapses turn smartphones into a ‘mobile security crisis’ - Boston News, Weather, Sports | WHDH 7News",
    "description": "Cybersecurity investigators noticed a highly unusual software crash — it was affecting a small number of smartphones belonging to people who worked in government, politics,<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/chinese-hackers-and-user-lapse…",
    "link": "https://whdh.com/news/chinese-hackers-and-user-lapses-turn-smartphones-into-a-mobile-security-crisis/",
    "timestamp": "2025-06-08T12:24:08Z"
  },
  {
    "title": "How Will Trump-Elon Musk Feud Impact the ‘Big Beautiful Bill?’",
    "description": "Meet the Press moderator Kristen Welker joins Sunday TODAY’s Willie Geist to discuss how President Donald Trump and billionaire Elon Musk’s falling out over Trump’s budget bill will impact its fate in the Senate and Republican lawmakers who are forced to take…",
    "link": "https://www.today.com/video/how-will-trump-elon-musk-feud-impact-the-big-beautiful-bill-241132613743",
    "timestamp": "2025-06-08T12:23:49Z"
  },
  {
    "title": "Dave Chappelle Talks Political Comedy, Donald Trump and Hosting ‘SNL’",
    "description": "Dave Chappelle\r\n sat down with fellow comedian Mo Amer\r\n for a one-on-one interview as part of Variety’s “\r\nActors On Actors” series\r\n. In the interview, Chappelle admits that he wasn’t especially prepared for his first time hosting Saturday Night Live.\n“The …",
    "link": "https://www.okayplayer.com/dave-chappelle-talks-political-comedy-donald-trump-and-hosting-snl",
    "timestamp": "2025-06-08T12:21:48Z"
  },
  {
    "title": "Trump Tells NBC He Has ‘No Intention’ of Speaking to Elon Musk",
    "description": "After President Donald Trump and Elon Musk’s relationship ruptured over disagreement about the deficit impact in the president’s massive budget bill, the president told NBC he has “no intention” of speaking to Musk. Trump warned Musk not to retaliate politica…",
    "link": "https://www.today.com/video/trump-tells-nbc-he-has-no-intention-of-speaking-to-elon-musk-241131589578",
    "timestamp": "2025-06-08T12:21:37Z"
  },
  {
    "title": "LA Protests: Trump's National Guard Move Sparks Legal Concerns",
    "description": "On Saturday, the White House ordered the deployment of the National Guard to Los Angeles to quell protests against immigration raids.",
    "link": "https://www.newsweek.com/la-protests-trump-national-guard-move-legal-concerns-2082432",
    "timestamp": "2025-06-08T12:20:42Z"
  },
  {
    "title": "Congress is moving ahead on this Trump campaign promise",
    "description": "As a presidential candidate last year, Donald Trump called for no taxes on tips — an exemption from the federal income tax for all tipped income.\nSo where does that promise stand now? There is a provision in the “big, beautiful bill” passed by the House in Ma…",
    "link": "https://biztoc.com/x/b8943876fbd447b7",
    "timestamp": "2025-06-08T12:20:01Z"
  },
  {
    "title": "The Trump-Musk feud is a lose-lose for the American people",
    "description": "President Donald Trump and Elon Musk's fight has one threatening to fund Democrats or a new party and the other attacking SpaceX and Tesla funding.",
    "link": "https://biztoc.com/x/86372ba8a384d7f9",
    "timestamp": "2025-06-08T12:20:00Z"
  },
  {
    "title": "Trump to Deploy National Guard in LA Amid ICE Protests",
    "description": "President Donald Trump has ordered the National Guard to Los Angeles as federal agents continue to clash with protesters in the wake of a series of immigration raids around the city. The president signed a memorandum federalizing 2,000 California National Gua…",
    "link": "https://www.today.com/video/trump-orders-national-guard-to-la-amid-ice-protests-241130053988",
    "timestamp": "2025-06-08T12:18:50Z"
  },
  {
    "title": "President Trump Sans Elon Musk Receives a Rock Star Welcome at UFC 316 in Newark, NJ (Video)",
    "description": "Once again, President Trump received a rock star welcome on Saturday night as he entered the Prudential Center for UFC 316 in Newark, New Jersey.\nThe post President Trump Sans Elon Musk Receives a Rock Star Welcome at UFC 316 in Newark, NJ (Video) appeared fi…",
    "link": "https://www.thegatewaypundit.com/2025/06/president-trump-sans-elon-receives-rock-star-welcome/",
    "timestamp": "2025-06-08T12:15:35Z"
  },
  {
    "title": "Hegseth accused of 'straining at the leash' with threat to send Marines to LA",
    "description": "A decision by Defense Secretary Pete Hegseth to inflame tensions in Los Angeles as protesters take to the streets to confront militarized ICE and DHS agents invading communities looking for immigrants, led one military expert to be very alarmed on MSNBC on Su…",
    "link": "https://www.rawstory.com/hegseth-la-protesters/",
    "timestamp": "2025-06-08T12:13:01Z"
  },
  {
    "title": "Democrats wooing Musk after the Trump breakup is US plutocracy at its best",
    "description": "Apparently, Musk’s money can buy quick forgiveness in the ‘Democratic’ Party.",
    "link": "https://www.aljazeera.com/opinions/2025/6/8/democrats-wooing-musk-after-the-trump-breakup-is-us-plutocracy-at-its-best",
    "timestamp": "2025-06-08T12:11:31Z"
  },
  {
    "title": "Trump wants to bring manufacturing jobs back. The aviation industry can't hire fast enough",
    "description": "LAFAYETTE, Ind. — President Donald Trump has said he wants to bolster manufacturing jobs and other technical employment in the United States. But in the aviation industry, finding skilled workers to make airplanes and engines — and maintaining those jobs for …",
    "link": "https://biztoc.com/x/73654bafb0e8d720",
    "timestamp": "2025-06-08T12:09:06Z"
  },
  {
    "title": "Boston Consulting Group CEO Caves to Antisemitic Mob; Apologizes for Helping U.S.-Backed Gaza Aid Project",
    "description": "Christoph Schweizer, CEO of Boston Consulting Group (BCG), apologized Friday under pressure from anti-Israel activists for his company's past role in a U.S.-backed alternative to Hamas and the United Nations in Gaza.\nThe post Boston Consulting Group CEO Caves…",
    "link": "https://www.breitbart.com/middle-east/2025/06/08/boston-consulting-group-ceo-caves-to-antisemitic-mob-apologizes-for-helping-u-s-backed-gaza-aid-project/",
    "timestamp": "2025-06-08T12:08:53Z"
  },
  {
    "title": "Elon Musk couldn’t change Trump’s mind on electric vehicles",
    "description": "Elon Musk and President Donald Trump — two of the most powerful, outspoken billionaires in America — are still tangled up in a messy breakup over a variety of issues. It’s no shock that these two men with huge egos would have friction, but it’s interesting to…",
    "link": "https://biztoc.com/x/0a0317e06423a05b",
    "timestamp": "2025-06-08T12:08:43Z"
  },
  {
    "title": "Is strengthening the Canadian economic union another way for Ottawa to centralize power?",
    "description": "Mark Carney aims to create of a highly integrated Canadian economy. But will the provinces have their say and will they be considered true partners?",
    "link": "https://theconversation.com/is-strengthening-the-canadian-economic-union-another-way-for-ottawa-to-centralize-power-258132",
    "timestamp": "2025-06-08T12:07:00Z"
  },
  {
    "title": "Westinghouse pursues US nuclear expansion after Trump orders, FT says",
    "description": "Westinghouse is discussing with US officials and industry partners about deploying ten large reactors. This is in response to President Donald Trump's executive orders. These orders aim to cut regulations and fast-track licenses for reactors. The goal is to r…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/westinghouse-pursues-us-nuclear-expansion-after-trump-orders-ft-says/articleshow/121707194.cms",
    "timestamp": "2025-06-08T12:02:27Z"
  },
  {
    "title": "Golf has a long history in the White House — but for Trump, it's more than a pastime",
    "description": "From Taft to Biden, presidents have had varying relationships with golf, with Trump's approach standing out for using the course as a place to conduct business and forge political relationships.",
    "link": "https://www.foxnews.com/opinion/golf-long-history-white-house-trump-more-than-pastime",
    "timestamp": "2025-06-08T12:00:49Z"
  },
  {
    "title": "OPINION: What Is A Fact? Unfortunately, In Court, It Is Whatever Donald Trump Says It Is",
    "description": "The “political question” doctrine affords the president deference on factual assertions in court, presenting grave dangers to the republic.",
    "link": "https://www.huffpost.com/entry/trump-facts-political-question-doctrine_n_68424444e4b004bd5409c942",
    "timestamp": "2025-06-08T12:00:45Z"
  }
]