[
  {
    "title": "Even Trump’s forgotten Americans are turning against him",
    "description": "Low-information and poor white voters are turning against the president. Can Democrats win them back?",
    "link": "https://www.salon.com/2026/02/21/even-trumps-forgotten-americans-are-turning-against-him/",
    "timestamp": "2026-02-21T11:45:56Z"
  },
  {
    "title": "Federal agents: Uniforms, masks increase intimidating behavior (Letters)",
    "description": "\"How many ICE agents are bullies and see ICE as a means to satisfy a desire to dominate other people, while in real life, unmasked, they can’t?\" -- Marsha Budz, Boulder",
    "link": "https://www.denverpost.com/2026/02/21/federal-agents-intimidation-masks/",
    "timestamp": "2026-02-21T11:45:08Z"
  },
  {
    "title": "(VIDEO) Supreme Court Strikes Down Trump's Sweeping Tariffs in 6-3 Ruling, Prompting New 10% Global Levy",
    "description": "The U.S. Supreme Court on Friday, Feb. 20, 2026, struck down President Donald Trump's broad tariffs imposed under the International Emergency Economic Powers Act (IEEPA), ruling 6-3 that the president exceeded his authority by using the 1977 emergency law to …",
    "link": "https://www.ibtimes.com.au/video-supreme-court-strikes-down-trumps-sweeping-tariffs-6-3-ruling-prompting-new-10-global-1861850",
    "timestamp": "2026-02-21T11:44:44Z"
  },
  {
    "title": "Finnish foreign minister on Trump's second term: \"We’ve learned not to be shocked by minor things\"",
    "description": "Foreign Minister Elina Valtonen (NCP) also claimed that recent racism scandals have not affected Finland’s international image \"at all\".",
    "link": "https://yle.fi/a/74-20211635",
    "timestamp": "2026-02-21T11:38:54Z"
  },
  {
    "title": "Susan Rice Threatens Trump Supporters: 'Revenge Is Best Served Cold'",
    "description": "President Joe Biden's domestic policy chief is promising revenge against the voters, business executives, and appointees who support President Donald Trump's 2024 election mandate.\nThe post Susan Rice Threatens Trump Supporters: ‘Revenge Is Best Served Cold’ …",
    "link": "https://www.breitbart.com/economy/2026/02/21/susan-rice-threatens-trump-supporters-revenge-best-served-cold/",
    "timestamp": "2026-02-21T11:30:50Z"
  },
  {
    "title": "IOC will probe FIFA President Gianni Infantino after Donald Trump meeting",
    "description": "The International Olympic Committee has announced it will examine the conduct of FIFA president Gianni Infantino following his appearance at a Donald Trump event in Washington, D. C.",
    "link": "https://www.hitc.com/ioc-will-probe-fifa-president-gianni-infantino-after-donald-trump-meeting/",
    "timestamp": "2026-02-21T11:30:00Z"
  },
  {
    "title": "Trump admin seeks to strike Epstein connections from record",
    "description": "The Trump admin employs an extreme stalling tactic in suit concerning potential Epstein-related Trump interviews",
    "link": "https://www.salon.com/2026/02/21/trump-admin-seeks-to-strike-epstein-connections-from-record/",
    "timestamp": "2026-02-21T11:30:00Z"
  },
  {
    "title": "Brazil, India seal rare earth deal amid global supply strains",
    "description": "The deal comes soon after India joined the US-led Pax Silica initiative to build resilient supply chains in semiconductors, artificial intelligence, and critical minerals",
    "link": "https://www.bloomberg.com/news/articles/2026-02-21/brazil-india-seal-rare-earth-deal-amid-global-supply-strains",
    "timestamp": "2026-02-21T11:26:36Z"
  },
  {
    "title": "Alysa Liu vs Eileen Gu — How two Chinese American stars wound up on opposite sides of an Olympic proxy war",
    "description": "Chinese American athletes Alysa Liu and Eileen Gu face contrasting views over Olympic loyalties as Liu represents Team USA and Gu competes for China.",
    "link": "https://www.foxnews.com/sports/alysa-liu-vs-eileen-gu-who-chinese-american-stars-who-took-diverging-paths-winter-olympics",
    "timestamp": "2026-02-21T11:22:55Z"
  },
  {
    "title": "Wayne Gretzky maintaining patriotism to Canada",
    "description": "Wayne Gretzky is the greatest hockey player of all-time. There is no argument. He is the all-time leader in assists (1963), points (2857), shorthanded goals (73), and even strength goals (617). What Gretzky accomplished in the 1980s was simply revolutionary. …",
    "link": "https://www.thebiglead.com/wayne-gretzky-maintaining-patriotism-to-canada/",
    "timestamp": "2026-02-21T11:19:05Z"
  },
  {
    "title": "With tariffs ruling, Supreme Court reasserts its power to check Trump​",
    "description": "WASHINGTON, Feb 21 (Reuters) - After siding with President Donald Trump in two dozen cases in ⁠the past year in ways that boosted his power and let him quickly transform U.S. policies on immigration, military service, federal employment and beyond, the U.S. S…",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/with-tariffs-ruling-supreme-court-reasserts-its-power-to-check-trump",
    "timestamp": "2026-02-21T11:16:00Z"
  },
  {
    "title": "Exclusive-Cuban security forces exit Venezuela as US pressure mounts",
    "description": "CARACAS, Feb 21 (Reuters) - Cuban security advisers and doctors have been leaving Venezuela as Interim President ⁠Delcy Rodriguez's government faces intense pressure from Washington to unwind Latin America's most consequential leftist alliance, according to 1…",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/exclusive-cuban-security-forces-exit-venezuela-as-us-pressure-mounts",
    "timestamp": "2026-02-21T11:15:00Z"
  },
  {
    "title": "US Supreme Court rules Trump exceeded powers in imposing global tariffs",
    "description": "US President Donald Trump has imposed a new 10% global tariff to replace ones struck down by the Supreme Court, calling the ruling 'terrible' and lambasting the justices who rejected his trade policy as 'fools'.",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/US-Supreme-Court-rules-Trump-exceeded-powers-in-imposing-global-tariffs-2022694",
    "timestamp": "2026-02-21T11:04:06Z"
  },
  {
    "title": "Judge forces CA hospital to keep trans treatments for minors despite Trump funding threat",
    "description": "The diverging approaches from hospitals in New York and California preview of what could become a fight over compliance, and threatening millions in federal funding.",
    "link": "https://www.foxnews.com/politics/judge-forces-ca-hospital-keep-trans-treatments-minors-despite-trump-funding-threat",
    "timestamp": "2026-02-21T11:00:58Z"
  },
  {
    "title": "Judge forces CA hospital to keep trans treatments for minors despite Trump funding threat",
    "description": "The diverging approaches from hospitals in New York and California preview of what could become a fight over compliance, and threatening millions in federal funding.",
    "link": "https://www.foxnews.com/politics/judge-forces-ca-hospital-keep-trans-treatments-minors-trump-funding-threat",
    "timestamp": "2026-02-21T11:00:58Z"
  },
  {
    "title": "Liberals lose their minds over Justice Department banner featuring Trump",
    "description": "Trump's face on DOJ banner sparks fierce criticism from Democrats who call it authoritarian imagery questioning department impartiality and weaponization.",
    "link": "https://www.foxnews.com/politics/liberals-lose-minds-over-justice-department-banner-featuring-trump",
    "timestamp": "2026-02-21T11:00:49Z"
  },
  {
    "title": "Analysis: GDP growth, trade deficit figures blow a hole in Trump’s rosy narrative | CNN Politics",
    "description": "Two new pieces of economic data, one released Thursday and one released Friday, blew another hole in President Donald Trump’s triumphant narrative about the effects of his tariffs.",
    "link": "https://www.cnn.com/2026/02/21/politics/economy-gdp-trade-deficit-trump-tariffs",
    "timestamp": "2026-02-21T11:00:34Z"
  },
  {
    "title": "Israelis keep suitcases packed and ready as Trump weighs potential Iran strike decision",
    "description": "Israel appears normal with busy cafés and beaches, but citizens live with constant anxiety about potential U.S. strikes on Iran and retaliation fears.",
    "link": "https://www.foxnews.com/world/israelis-keep-suitcases-packed-ready-trump-weighs-potential-iran-strike-decision",
    "timestamp": "2026-02-21T11:00:33Z"
  },
  {
    "title": "James Talarico Squeezes Jasmine Crockett In 'Ugly' Texas Senate Race",
    "description": "The Texas congresswoman is facing questions about her campaign strategy as her Democratic opponent James Talarico continues to gain momentum.",
    "link": "https://www.huffpost.com/entry/texas-crockett-talarico_n_6997c468e4b069f45569860f",
    "timestamp": "2026-02-21T11:00:20Z"
  },
  {
    "title": "Tony Gonzales accuses dead staffer’s husband of trying to blackmail him amid affair scandal",
    "description": "The Texas Republican shared an email requesting a settlement of up to $300,000 in exchange for an NDA.",
    "link": "https://www.salon.com/2026/02/21/texas-republican-tony-gonzales-accuses-dead-staffers-husband-of-trying-to-blackmail-him-amid-affai-partner/",
    "timestamp": "2026-02-21T11:00:07Z"
  },
  {
    "title": "The Quad God and American Reckoning at the Olympics",
    "description": "Vinson Cunningham reviews the Winter Games, where the ice skater Ilia Malinin, the snowboarder Chloe Kim, and the Norwegian biathlete Sturla Holm Lægreid are a few of the athletes who battled it out.",
    "link": "https://www.newyorker.com/magazine/2026/03/02/the-quad-god-and-the-american-reckoning-at-the-olympics",
    "timestamp": "2026-02-21T11:00:00Z"
  },
  {
    "title": "Trump's tariff loss could be a win for watch collectors",
    "description": "The watch world is rejoicing over the Supreme Court's ruling on Trump's tariffs as dealers say the prices of pre-owned Swiss watches could dip.",
    "link": "https://www.businessinsider.com/watch-collectors-could-gain-from-trumps-tariff-loss-2026-2",
    "timestamp": "2026-02-21T10:58:01Z"
  },
  {
    "title": "Govt studying developments on US tariff: Commerce ministry",
    "description": "\"Some steps have been announced by the US administration. We are studying all these developments for their implications,\" the ministry added",
    "link": "https://www.thehindubusinessline.com/economy/govt-studying-developments-on-us-tariff-commerce-ministry/article70659723.ece",
    "timestamp": "2026-02-21T10:56:54Z"
  },
  {
    "title": "Here's who could benefit from the Supreme Court's decision on Trump's IEEPA tariffs and who could lose out",
    "description": "Consumers, small businesses, and trade lawyers could all benefit in some way from the SCOTUS decision against IEEPA tariffs, but it's complicated.",
    "link": "https://www.businessinsider.com/winner-and-losers-of-scotus-decision-strike-down-ieepa-tariffs-2026-2",
    "timestamp": "2026-02-21T10:55:02Z"
  },
  {
    "title": "World Leaders Scope Out US’s Next Steps After Trump Tariff Loss",
    "description": "Governments around the world reacted with caution after the US Supreme Court invalidated President Donald Trump’s broad emergency tariffs, with some reaffirming existing agreements and others taking a wait-and-see approach to evaluate his next steps.",
    "link": "https://financialpost.com/pmn/business-pmn/world-leaders-scope-out-uss-next-steps-after-trump-tariff-loss",
    "timestamp": "2026-02-21T10:52:29Z"
  },
  {
    "title": "RSS defamation: Rahul names Sapkal new court guarantor, faces BJP backlash over AI Summit protest",
    "description": "Gandhi, on his way to the court in Maharashtra's Thane district, faced a black-flag protest by BJP activists at Mulund toll plaza.",
    "link": "https://indianexpress.com/article/mumbai/rss-defamation-rahul-sapkal-bjp-backlash-ai-summit-protest-10544444/",
    "timestamp": "2026-02-21T10:45:43Z"
  },
  {
    "title": "The Supreme Court Just Basically Held Up a “No Kings” Sign",
    "description": "One of Trump’s biggest power grabs just got gutted.",
    "link": "https://slate.com/news-and-politics/2026/02/donald-trump-tariffs-supreme-court-john-roberts.html",
    "timestamp": "2026-02-21T10:45:00Z"
  },
  {
    "title": "Brazil, India Seal Rare Earth Deal Amid Global Supply Strains",
    "description": "Brazil and India sealed a framework pact on critical minerals with the two countries agreeing to work closely on processing in a move aimed at securing rare earth supplies at a time of global disruption.",
    "link": "https://financialpost.com/pmn/business-pmn/brazil-india-seal-rare-earth-deal-amid-global-supply-strains",
    "timestamp": "2026-02-21T10:42:18Z"
  },
  {
    "title": "Nifty and Bank Nifty Prediction for the week 23 Feb’26 to 27 Feb’26 by BL GURU",
    "description": "Weekly Nifty and Bank Nifty predictions highlight a positive bias with key support levels for potential upward movement.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/nifty-and-bank-nifty-prediction-for-the-week-23-feb26-to-27-feb26-by-bl-guru/article70659286.ece",
    "timestamp": "2026-02-21T10:40:26Z"
  },
  {
    "title": "Corporate America's toughest job? Being COO during the tariff whiplash",
    "description": "America's supply-chain bosses are experiencing a fresh bout of uncertainty after Friday's tariff ruling by the Supreme Court.",
    "link": "https://www.businessinsider.com/coo-job-is-especially-challenging-with-tariff-uncertainty-scotus-2026-2",
    "timestamp": "2026-02-21T10:39:01Z"
  },
  {
    "title": "Conan O’Brien describes being ‘in shock’ over Rob Reiner’s death hours after his holiday party",
    "description": "‘It’s awful. It’s just so awful,’ said the TV host",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/conan-obrien-rob-reiner-holiday-party-death-nick-b2924877.html",
    "timestamp": "2026-02-21T10:36:30Z"
  },
  {
    "title": "US Supreme Court’s end to Trump’s tariff tantrum boosts India’s hand",
    "description": "The US Supreme Court's blocking of Donald Trump's threat of higher tariffs may allow India to re-examine the terms of the trade deal.",
    "link": "https://www.livemint.com/opinion/columns/us-supreme-court-ruling-trump-tariffs-india-trade-impact-global-economy-11771656486603.html",
    "timestamp": "2026-02-21T10:32:21Z"
  },
  {
    "title": "Panicking Trump proves he sees a real threat",
    "description": "The pattern is clear: Corporate billionaires who either own\r\n or are purchasing\r\n U.S. media are censoring content to support Donald Trump. Trump’s blatantly illegal\r\n carrot is the conditioning of federal contracts\r\n, mergers\r\n, licensing\r\n, tax and regulato…",
    "link": "https://www.rawstory.com/raw-investigates/james-talarico/",
    "timestamp": "2026-02-21T10:30:01Z"
  },
  {
    "title": "3 reasons dire economic predictions about Trump's policies haven't played out, according to one think tank",
    "description": "According to new commentary from the Brookings Institution, there are a few major reasons that economists have been wrong on Trump's policies.",
    "link": "https://www.businessinsider.com/trump-tariffs-inflation-reasons-why-economic-predictions-were-wrong-brookings-2026-2",
    "timestamp": "2026-02-21T10:30:01Z"
  },
  {
    "title": "ECB’s Panetta Says Tariffs Have Damaged the US More Than Others",
    "description": "Speaking at an annual Assiom-Forex event, Panetta highlighted that “overall, tariffs are estimated to have contributed just over half a percentage point to...",
    "link": "https://finance.yahoo.com/news/ecb-panetta-says-tariffs-damaged-102424690.html",
    "timestamp": "2026-02-21T10:24:24Z"
  },
  {
    "title": "Boebert jokes about endorsing Crockett in Texas' Senate race to give her Democratic rival a boost",
    "description": "Rep. Lauren Boebert criticized Rep. Jasmine Crockett on \"Real Time with Bill Maher\" and joked about endorsing the Texas lawmaker to hopes of boosting her rival in Texas' Senate race.",
    "link": "https://www.foxnews.com/media/boebert-jokes-about-endorsing-crockett-texas-senate-race-give-her-democratic-rival-boost",
    "timestamp": "2026-02-21T10:23:49Z"
  },
  {
    "title": "Charting the Global Economy: Trump’s Tariffs Struck Down by Supreme Court",
    "description": "US President Donald Trump’s global tariffs were struck down by the Supreme Court, undercutting his signature economic policy and kicking off what could be a prolonged battle over refunds.",
    "link": "https://financialpost.com/pmn/business-pmn/charting-the-global-economy-trumps-tariffs-struck-down-by-supreme-court",
    "timestamp": "2026-02-21T10:22:08Z"
  },
  {
    "title": "Trump Tariffs Highlights: India faces a lower 10% US tariff rate under Trump’s new trade move",
    "description": "Donald Trump New Tariffs announcements, US Stocks & market news highlights: Trump signs 10% global tariff in bid to salvage trade agenda",
    "link": "https://www.thehindubusinessline.com/news/trump-tariffs-highlights-india-gets-10-us-tariff-cut-under-trumps-new-trade-move/article70659119.ece",
    "timestamp": "2026-02-21T10:19:32Z"
  },
  {
    "title": "Proposed US-Saudi pact could allow Riyadh to build nuclear weapons – report",
    "description": "The US is finalizing a multibillion-dollar deal with Saudi Arabia that could reportedly enable the kingdom to pursue nuclear weapons Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632861-us-saudi-pact-nuclear-weapons/",
    "timestamp": "2026-02-21T10:18:34Z"
  },
  {
    "title": "Justice Department swiftly fires lawyer chosen as top federal prosecutor for Virginia office",
    "description": "While the law says that the district court may choose US attorneys when an initial appointment expires, the Trump administration has insisted that the power lies only in the hands of the executive branch.",
    "link": "https://nypost.com/2026/02/21/us-news/virginia-attorney-james-hundley-swiftly-fired-by-justice-department/",
    "timestamp": "2026-02-21T10:05:15Z"
  },
  {
    "title": "VOS Selections owner Victor Schwartz risked his business to challenge Trump’s tariffs | CNN Business",
    "description": "When President Donald Trump announced plans to raise the nation’s effective tariff rate to levels not seen since 1930 on April 2, 2025, most CEOs were silent. They’d seen how voicing opposition to any of the president’s ambitions – let alone his signature eco…",
    "link": "https://www.cnn.com/2026/02/21/business/vos-selections-trump-tariffs-lawsuit-risk-takers",
    "timestamp": "2026-02-21T10:00:34Z"
  },
  {
    "title": "How Justice Alito’s Retirement Might Upend the Midterms",
    "description": "Justice Samuel Alito’s retirement might upend the midterms. Republicans believe the Kavanaugh fight saved the GOP Senate in 2018. They’d love to see a repeat, but it could backfire this time.",
    "link": "http://nymag.com/intelligencer/article/alito-retirement-might-upend-the-midterms.html",
    "timestamp": "2026-02-21T10:00:27Z"
  },
  {
    "title": "New CBO report shows national debt spiraling into uncharted territory by 2035—and Trump’s tariff defeat will make the picture even worse",
    "description": "By 2035, the CBO expects the deficit to reach $2.96 trillion or 6.2% of GDP versus 5.8% today, and almost double the multi-decade, pre-pandemic average.",
    "link": "https://fortune.com/2026/02/21/cbo-national-debt-deficit-today-projections/",
    "timestamp": "2026-02-21T10:00:00Z"
  },
  {
    "title": "‘Narco-Submarine’ Carrying 4 Tons of Cocaine Captured by Mexico's Navy",
    "description": "Following increased surveillance and patrols of routes used by transnational drug-trafficking networks, Mexican authorities have seized approximately 10 tons of cocaine in the past week alone.",
    "link": "https://www.wired.com/story/narco-submarine-carrying-4-tons-of-cocaine-captured-by-mexicos-navy/",
    "timestamp": "2026-02-21T10:00:00Z"
  },
  {
    "title": "In tariff case, Supreme Court justices bicker over treating Trump and Biden differently",
    "description": "Supreme Court justices fought in their opinions in Donald Trump's tariffs case over whether they are treating Joe Biden and Trump equally.",
    "link": "https://www.nbcnews.com/politics/supreme-court/tariffs-case-supreme-court-justices-bicker-biden-trump-treatment-rcna259922",
    "timestamp": "2026-02-21T10:00:00Z"
  },
  {
    "title": "SCOTUS Tells Trump His Illegal Tariffs Are Illegal. He Should Be Thanking the Justices.",
    "description": "The high court finally says no to Trump, and the foundational constitutional right that SCOTUS has fallen out of love with.",
    "link": "https://slate.com/podcasts/amicus/2026/02/tariffs-trump-stephen-colbert-press-clause",
    "timestamp": "2026-02-21T10:00:00Z"
  },
  {
    "title": "Venezuela grants amnesty to 379 political prisoners",
    "description": "The move is in line with a new law, giving hope to throngs of others imprisoned over alleged plots to oust the government.",
    "link": "https://www.aljazeera.com/news/2026/2/21/venezuela-grants-amnesty-to-379-political-prisoners",
    "timestamp": "2026-02-21T09:51:57Z"
  },
  {
    "title": "Trump's New Tariff Will Take Effect February 24 for 150 Days - White House",
    "description": "WASHINGTON (Sputnik) - New tariffs imposed by US President Donald Trump will take effect on February 24 for 150 days, the White House said in a statement.",
    "link": "https://sputnikglobe.com/20260221/trumps-new-tariff-will-take-effect-february-24-for-150-days---white-house-1123667437.html",
    "timestamp": "2026-02-21T09:47:15Z"
  },
  {
    "title": "RI-US trade pack marks new chapter in relations",
    "description": "Indonesia and the United States have signed the Agreement on Reciprocal Trade (ART), which provides tariff exemptions for 1,819 Indonesian products entering ...",
    "link": "https://en.antaranews.com/news/405390/ri-us-trade-pack-marks-new-chapter-in-relations",
    "timestamp": "2026-02-21T09:46:18Z"
  },
  {
    "title": "US Authorities Discussing If Deal With Iran Should Cover Only Nuclear Program - Reports",
    "description": "MOSCOW (Sputnik) - The US Administration is discussing whether a possible deal with Iran should cover only its nuclear program or also extend to Iranian missiles and proxy forces, the Wall Street Journal reported on Saturday, citing US and Middle Eastern offi…",
    "link": "https://sputnikglobe.com/20260221/us-authorities-discussing-if-deal-with-iran-should-cover-only-nuclear-program---reports-1123667190.html",
    "timestamp": "2026-02-21T09:43:13Z"
  },
  {
    "title": "World reacts as US top court limits Trump’s tariff powers",
    "description": "Some countries welcome the ruling, while others review trade deals and economic effect.",
    "link": "https://www.aljazeera.com/news/2026/2/21/trump-tariff-reactions",
    "timestamp": "2026-02-21T09:40:50Z"
  },
  {
    "title": "Serbia urges citizens to quit Iran 'as soon as possible'",
    "description": "Serbia has advised its citizens in Iran to depart immediately. This comes as the United States considers military action against Iran's nuclear activities. Tensions are high, prompting Serbia to issue a strong travel warning. Citizens already in Iran are urge…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/serbia-urges-citizens-to-quit-iran-as-soon-as-possible/articleshow/128640124.cms",
    "timestamp": "2026-02-21T09:35:13Z"
  },
  {
    "title": "Federal court clears way for Ten Commandments to be displayed in Louisiana public school classrooms",
    "description": "Federal appeals court lifts block on Louisiana law requiring Ten Commandments in public school classrooms, sparking intense constitutional debate.",
    "link": "https://www.foxnews.com/us/federal-court-clears-way-ten-commandments-displayed-louisiana-public-school-classrooms",
    "timestamp": "2026-02-21T09:20:15Z"
  },
  {
    "title": "I'm a small-business owner who paid thousands in tariffs over the last year. Now I have more questions than answers.",
    "description": "Marc Bowker, a small business owner, said Trump continues to cause uncertainty for small businesses after Supreme Court tariff ruling.",
    "link": "https://www.businessinsider.com/small-business-owner-more-uncertainty-trump-tariffs-overturned-supreme-court-2026-2",
    "timestamp": "2026-02-21T09:14:01Z"
  },
  {
    "title": "Trump's tariffs are illegal and money must be returned, says US Senator Chuck Schumer",
    "description": "The US Supreme Court has ruled President Trump's global tariffs unlawful. Senator Chuck Schumer has declared these tariffs illegal and insists the collected money must be returned. He criticizes Trump's reaction and his attempts to reimpose similar tariffs. S…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-tariffs-are-illegal-and-money-must-be-returned-says-us-senator-chuck-schumer/articleshow/128639616.cms",
    "timestamp": "2026-02-21T09:12:54Z"
  },
  {
    "title": "Inside Germany: Money back for Deutsche Bahn delays, the efficiency chancellor and aliens",
    "description": "From how to collect compensation when your train is delayed, to why young tech workers are mocking Friedrich Merz, to how you can report a UFO sighting in Germany, here's what we're talking about at The Local this week.",
    "link": "https://www.thelocal.de/20260221/inside-germany-money-back-for-deutsche-bahn-delays-the-efficiency-chancellor-and-aliens",
    "timestamp": "2026-02-21T09:05:12Z"
  },
  {
    "title": "Three dead in latest US strike on alleged drug boat: Pentagon",
    "description": "WASHINGTON: US forces on Friday (Feb 20) launched a strike against alleged drug traffickers in the Eastern Pacific, killing three people, the military said.\"Joint Task Force Southern Spear conducted a lethal kinetic strike on a vessel operated by designated t…",
    "link": "https://www.channelnewsasia.com/world/us-strike-alleged-drug-boat-pacific-pentagon-5944321",
    "timestamp": "2026-02-21T09:03:00Z"
  },
  {
    "title": "Macron says US Supreme Court tariff ruling shows it is good to have counterweights to power in democracies",
    "description": "PARIS, Feb 21 (Reuters) - ⁠French President Emmanuel Macron said on ⁠Saturday that the U.S. Supreme Court ‌ruling on President Donald Trump's trade tariffs shows that it is good to have counterweights to power ​and the rule of law ⁠in democracies.  Read full …",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/macron-says-us-supreme-court-tariff-ruling-shows-it-is-good-to-have-counterweights-to-power-in-democracies",
    "timestamp": "2026-02-21T09:02:00Z"
  },
  {
    "title": "Cuba running on fumes as Canada considers sending relief",
    "description": "Canada says it will consider sending humanitarian aid to Cuba as the country deals with severe blackouts and shortages greatly exacerbated by the Trump administration's oil blockade. While Canada could probably send food and humanitarian aid without provoking…",
    "link": "https://www.cbc.ca/news/politics/cuba-canada-embargo-aid-9.7100202",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "What to know about the Gordie Howe Windsor-Detroit bridge at the centre of Donald Trump's threats",
    "description": "U.S. Democrats are probing the relationship between Donald Trump and the owner of the nearly century-old Ambassador Bridge linking Detroit and Windsor, Ont., after the president threatened to block this year's planned opening of a competing crossing — the Gor…",
    "link": "https://www.cbc.ca/news/canada/windsor/gordie-howe-bridge-backgrounder-9.7100029",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "As Iranian Canadians mark 40 days of mourning, fate of some loved ones still unknown",
    "description": "Many Canadians are enduring long waits to learn the fate of relatives who have been arrested or gone missing in the wake of a violent crackdown on protests during which at least 7,000 people were killed, rights group say.",
    "link": "https://www.cbc.ca/radio/thecurrent/canadians-calling-for-change-in-iran-9.7099484",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "Former FIFA president pans mixing soccer with politics, blasts U.S. ahead of World Cup",
    "description": "In an exclusive interview, former FIFA president Sepp Blatter blasted the United States administration's 'defamatory' policies and the 'crumbs' given to Canada for the 2026 World Cup, which the country is co-hosting with the U.S. and Mexico.",
    "link": "https://www.cbc.ca/sports/soccer/sepp-blatter-fifa-worse-9.7096151",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "Warning Shot: How Canada fits into Washington's rebuke of the EU's 'buy European' defence drive",
    "description": "Just days before Canada unveiled its defence industrial strategy prioritizing domestic production, Washington quietly warned the European Union against favouring its own arms makers as it rebuilds.",
    "link": "https://www.cbc.ca/news/politics/defence-industry-europe-trump-arms-warning-9.7100449",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "What's next for Trump's tariffs after Supreme Court ruling",
    "description": "Based simply on the barely suppressed anger that U.S. President Donald Trump showed throughout his news conference on the Supreme Court's decision on tariffs, it's a fair bet that Friday was the worst day so far of his second term.",
    "link": "https://www.cbc.ca/news/world/trump-tariffs-supreme-court-analysis-9.7099838",
    "timestamp": "2026-02-21T09:00:00Z"
  },
  {
    "title": "Despite headwinds, Germany's Merz wins strong party backing",
    "description": "A year after his national election win, German Chancellor Friedrich Merz on Friday passionately rallied his conservatives and won a strong endorsement with a 91 percent vote to confirm him as party chairman.",
    "link": "https://www.thelocal.de/20260221/despite-headwinds-germanys-merz-wins-strong-party-backing",
    "timestamp": "2026-02-21T08:55:50Z"
  },
  {
    "title": "Government will study US Supreme Court tariff ruling: Union Minister Pralhad Joshi",
    "description": "Union Minister Pralhad Joshi announces government's review of US Supreme Court tariff ruling, with responses from Commerce Ministry and MEA pending.",
    "link": "https://www.thehindubusinessline.com/news/government-will-study-us-supreme-court-tariff-ruling-union-minister-pralhad-joshi/article70659427.ece",
    "timestamp": "2026-02-21T08:53:58Z"
  },
  {
    "title": "Ukraine nears four years of war, no breakthrough in sight",
    "description": "Next Tuesday marks four years since Russia launched its full-scale invasion of Ukraine by land, sea and air.",
    "link": "https://www.rte.ie/news/world/2026/0221/1559656-ukraine-war-analysis/",
    "timestamp": "2026-02-21T08:51:00Z"
  },
  {
    "title": "Trump imposes 10 pct global tariff after stinging court rebuke",
    "description": "President Donald Trump imposed Friday an additional 10 percent tariff on imports into the United States after the Supreme Court struck down many of his sweeping and often arbitrary duties, delivering a stinging rebuke on his signature economic policy.",
    "link": "https://www.hurriyetdailynews.com/trump-imposes-10-pct-global-tariff-after-stinging-court-rebuke-219184",
    "timestamp": "2026-02-21T08:50:30Z"
  },
  {
    "title": "Tariff reboot: The catch in Trump's new weapons of choice",
    "description": "Following a Supreme Court ruling, President Trump has shifted his trade strategy, replacing emergency tariffs with a temporary global import duty under Section 122 of the Trade Act of 1974. New investigations under Sections 301 and 232 will now underpin more …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tariff-reboot-the-catch-in-trumps-new-weapons-of-choice/articleshow/128638914.cms",
    "timestamp": "2026-02-21T08:48:26Z"
  },
  {
    "title": "A US war with Iran is close. But what's the goal?",
    "description": "Tensions are escalating between the United States and Iran, with the specter of conflict looming ominously. This potential war lacks defined boundaries, leaving both nations in a precarious position. President Trump is feeling the heat to take decisive action…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-iran-war-trump-policy-nuclear-deal-middle-east-tensions-khamenei-israel/articleshow/128638996.cms",
    "timestamp": "2026-02-21T08:47:31Z"
  },
  {
    "title": "Tech sector braces for Trump's 10% tariff reset",
    "description": "Global technology supply chains are facing renewed uncertainty after US President Donald Trump announced a temporary 10% tariff on most imports, days after the Supreme Court of struck down his earlier tariff framework.",
    "link": "https://www.digitimes.com/news/a20260221VL204/technology-supreme-equipment-donald-trump-hardware.html",
    "timestamp": "2026-02-21T08:41:02Z"
  },
  {
    "title": "India-US tariffs after Supreme Court verdict: An explainer",
    "description": "The US Supreme Court’s ruling is expected to reshape trade dynamics, prompting Indian exporters to anticipate a 10% reduction in tariffs, affecting costs of goods entering the US and leading to a reevaluation of the trade pact",
    "link": "https://www.thehindubusinessline.com/news/india-us-tariffs-after-supreme-court-verdict-an-explainer/article70659329.ece",
    "timestamp": "2026-02-21T08:35:02Z"
  },
  {
    "title": "Analysis-Trump pushes US toward war with Iran as advisers urge focus on economy",
    "description": "WASHINGTON, Feb 21 (Reuters) - President Donald Trump ⁠has pushed the United States to the brink of war with Iran even as aides urge him to focus more on voters' economic worries, highlighting the political risks of military escalation ahead of this year's mi…",
    "link": "https://www.thestar.com.my/news/world/2026/02/21/analysis-trump-pushes-us-toward-war-with-iran-as-advisers-urge-focus-on-economy",
    "timestamp": "2026-02-21T08:28:00Z"
  },
  {
    "title": "Trump pushes US toward war with Iran as advisers urge focus on economy",
    "description": "WASHINGTON: President Donald Trump has pushed the United States to the brink of war with Iran even as aides urge him to focus more on voters' economic wor",
    "link": "https://www.channelnewsasia.com/world/analysis-trump-pushes-us-toward-iran-war-advisers-urge-economy-focus-5944266",
    "timestamp": "2026-02-21T08:26:00Z"
  },
  {
    "title": "Three dead in US strike on alleged drug boat: Pentagon",
    "description": "US forces launched a strike against alleged drug traffickers in the Eastern Pacific, killing three people, the military said.",
    "link": "https://www.rte.ie/news/world/2026/0221/1559662-us-strike-pacific/",
    "timestamp": "2026-02-21T08:21:00Z"
  },
  {
    "title": "Sweeping tariffs gone but Trump's 10% global tariffs on. What to expect from markets on Monday?",
    "description": "Markets may open strong after the US Supreme Court struck down Trump’s tariffs, with GIFT Nifty signalling gains. However, a new 10% global tariff introduces uncertainty. Export sectors, metals and pharma remain in focus, while investors track policy response…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sweeping-tariffs-gone-but-trumps-10-global-tariffs-on-what-to-expect-from-markets-on-monday/articleshow/128638352.cms",
    "timestamp": "2026-02-21T08:15:22Z"
  },
  {
    "title": "The 8 at 8: Saturday",
    "description": "Trump lashes out over tariffs, Starmer considers cutting Andrew from succession line and how many houses Ireland is actually building.",
    "link": "https://www.thejournal.ie/8-at-8-269-6963630-Feb2026/",
    "timestamp": "2026-02-21T08:10:00Z"
  },
  {
    "title": "Trump's reciprocal tariffs: What the US Supreme Court ruling means for Bangladesh",
    "description": "For Bangladesh’s garment sector - highly dependent on the US market -predictability is almost as important as the tariff rate itself",
    "link": "https://www.thedailystar.net/business/news/trumps-reciprocal-tariffs-what-the-us-supreme-court-ruling-means-bangladesh-4111236",
    "timestamp": "2026-02-21T08:07:48Z"
  },
  {
    "title": "Iran prepares counterproposal as US considers strikes",
    "description": "Iran's foreign minister has said he expected to have a draft counterproposal ready within days following nuclear talks with the United States this ⁠week, while US President Donald Trump said he was considering limited military strikes.",
    "link": "https://www.rte.ie/news/world/2026/0221/1559660-iran-us/",
    "timestamp": "2026-02-21T08:06:06Z"
  },
  {
    "title": "PM should put India-US trade agreement on hold, renegotiate terms of deal: Congress",
    "description": "Congress leader Jairam Ramesh says government must state categorically that there will be no import liberalisation till clear cut clarifications from the American side and ensure that Indian farmers’ interests are not hurt",
    "link": "https://www.thehindubusinessline.com/economy/pm-should-put-india-us-trade-agreement-on-hold-renegotiate-terms-of-deal-congress/article70659331.ece",
    "timestamp": "2026-02-21T08:04:52Z"
  },
  {
    "title": "As the Trump Administration Erases Black History, These Writers Are Keeping It Alive",
    "description": "One of the unmistakable throughlines of the second Trump administration is how it’s overhauling policies that directly affect African Americans, most notably by targeting programs and initiatives that promote diversity, equity, and inclusion, or DEI.  For jou…",
    "link": "https://www.motherjones.com/politics/2026/02/black-history-month-nikole-hannah-jones-jelani-cobb-trymaine-lee/",
    "timestamp": "2026-02-21T08:01:00Z"
  },
  {
    "title": "US Expects Iran to Present Detailed Nuclear Deal Proposal in Coming Days - Reports",
    "description": "Iran is expected to present a detailed and written version of its proposal on the nuclear deal to the United States in the coming days, CBS News reported on Friday, citing sources.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-sputnik01.htm",
    "timestamp": "2026-02-21T07:54:24Z"
  },
  {
    "title": "Tehran says US has not sought zero enrichment, warns war hawks pushing for 'catastrophic war'",
    "description": "Iran's Foreign Minister has said Washington has not demanded zero uranium enrichment in ongoing indirect talks, while warning that hardliners are attempting to steer US policy toward a \"catastrophic war.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-presstv01.htm",
    "timestamp": "2026-02-21T07:54:24Z"
  },
  {
    "title": "Chidambaram questions Centre on impact of US tariff ruling on India-US Trade Framework",
    "description": "Chidambaram urges the Indian government to clarify the implications of the US Supreme Court's tariff ruling on trade relations.",
    "link": "https://www.thehindubusinessline.com/news/chidambaram-questions-centre-on-impact-of-us-tariff-ruling-on-india-us-trade-framework/article70659293.ece",
    "timestamp": "2026-02-21T07:54:17Z"
  },
  {
    "title": "Araghchi: Swift agreement desirable for both Tehran and Washington",
    "description": "Foreign Minister Seyyed Abbas Araghchi has rejected the idea of any deadlines for Iran-US negotiations, saying that a quick deal is something both sides are interested in.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-irna01.htm",
    "timestamp": "2026-02-21T07:54:04Z"
  },
  {
    "title": "Kazakh, Uzbek Leaders Seek Trump Approval With Gaza Peace Pledges",
    "description": "The decision by Kazakhstan and Uzbekistan to join US allies in the Arab world in providing cash and other help - possibly including troops - for the reconstruction of Gaza marks another moment in efforts to forge a new, close relationship with US President Do…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260220-rferl01.htm",
    "timestamp": "2026-02-21T07:54:04Z"
  },
  {
    "title": "Trump plans to establish 'massive' military base in southern Gaza: Report",
    "description": "US President Donald Trump has plans to set up a large military base in the Gaza Strip to serve as the \"military operating base\" for thousands of international troops, a report says.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260220-presstv06.htm",
    "timestamp": "2026-02-21T07:54:04Z"
  },
  {
    "title": "Iran won't initiate war, but will 'decisively' defend itself against aggression: UN envoy",
    "description": "The Iranian ambassador and permanent representative to the United Nations has stressed that the Islamic Republic will not initiate any war but will deliver a \"decisive\" response to an act of aggression against the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-presstv06.htm",
    "timestamp": "2026-02-21T07:53:58Z"
  },
  {
    "title": "Trump Considering Initial Limited Strike on Iran - Reports",
    "description": "US President Donald Trump is considering a possibility to carry out an initial limited strike on Iran to force it make a nuclear deal, The Wall Street Journal reported, citing sources.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-sputnik04.htm",
    "timestamp": "2026-02-21T07:53:58Z"
  },
  {
    "title": "US lawmakers move towards vote on limiting Trump's Iran strike authority",
    "description": "Members of the US Congress could vote as soon as next week on legislation aimed at blocking President Donald Trump from launching military strikes against Iran without explicit congressional approval.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260220-presstv02.htm",
    "timestamp": "2026-02-21T07:53:58Z"
  },
  {
    "title": "US Intends to Complete Middle East Troop Deployment by Mid-March - Reports",
    "description": "The United States plans to wrap up its troop deployment in the Middle East by mid-March in case of a possible operation against Iran, The Washington Post newspaper reported, citing US officials.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260220-sputnik05.htm",
    "timestamp": "2026-02-21T07:53:58Z"
  },
  {
    "title": "Unthinkable torture in Iran’s prisons: Police rape women and remove their uteruses to eliminate evidence",
    "description": "“Men and women are raped in prisons. Those who are arrested are not fed, they are beaten, their nails are pulled out and they are bitten. Detainees are killed every day by the government,” protesters allege\nThe post Unthinkable torture in Iran’s prisons: Poli…",
    "link": "https://en.protothema.gr/2026/02/21/unthinkable-torture-in-irans-prisons-police-rape-women-and-remove-their-uteruses-to-eliminate-evidence/",
    "timestamp": "2026-02-21T07:44:32Z"
  }
]