[
  {
    "title": "Trump Tariffs Plunge Local NYC Businesses Into Uncertainty",
    "description": "A look at the damage being done by Trump tariffs, though the eyes of small business operators in New York City.",
    "link": "https://www.nakedcapitalism.com/2025/03/trump-tariffs-plunge-local-nyc-businesses-into-uncertainty.html",
    "timestamp": "2025-03-13T05:38:17Z"
  },
  {
    "title": "Ukraine Ceasefire Bid, Trade War To Dominate As G7 Diplomats Meet",
    "description": "US Secretary of State Marco Rubio is set to meet his Canadian counterpart at a G7 gathering Thursday, but discussion of American annexation threats has been ruled off-limits at talks expected to be dominated by efforts to agree a ceasefire in Ukraine.",
    "link": "https://www.ibtimes.com/ukraine-ceasefire-bid-trade-war-dominate-g7-diplomats-meet-3766119",
    "timestamp": "2025-03-13T05:33:21Z"
  },
  {
    "title": "Ukraine ceasefire bid, trade war to dominate as G7 diplomats meet",
    "description": "US Secretary of State Marco Rubio is set to meet his Canadian counterpart at a G7 gathering Thursday, but discussion of American annexation threats has been ruled off-limits at talks expected to be dominated by efforts to agree a ceasefire in Ukraine.  Rubio …",
    "link": "https://www.digitaljournal.com/world/ukraine-ceasefire-bid-trade-war-to-dominate-as-g7-diplomats-meet/article",
    "timestamp": "2025-03-13T05:32:20Z"
  },
  {
    "title": "Tim Walz Going on Tour of Republican House Districts, Tells Americans to 'Fight Back' Against Trump",
    "description": "Failed 2024 vice presidential candidate Tim Walz is launching a national town hall tour in Republican-controlled House districts, telling CNN that he wants to tell people \"they can mobilize to fight back\" against President Donald Trump.\nThe post Tim Walz Goin…",
    "link": "https://www.breitbart.com/politics/2025/03/12/tim-walz-tour-republican-house-districts-americans-fight-trump/",
    "timestamp": "2025-03-13T05:30:41Z"
  },
  {
    "title": "Erdogan Tries to Leverage Turkey’s NATO Muscle as US Retreats",
    "description": "Turkey wants closer cooperation with Europe in return for security as the continent looks at ways to reduce reliance on Trump’s America.",
    "link": "https://financialpost.com/pmn/business-pmn/erdogan-tries-to-leverage-turkeys-nato-muscle-as-us-retreats",
    "timestamp": "2025-03-13T05:25:21Z"
  },
  {
    "title": "Why Elon Musk wants a US govt shutdown against the wishes of his boss Donald Trump?",
    "description": "Elon Musk is reportedly advocating for a U.S. government shutdown, according to a Wired report. A House-approved bill proposes significant domestic budget cuts while increasing defense funding. The bill’s fate in the Senate remains uncertain, as it faces stro…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-elon-musk-wants-a-us-govt-shutdown-against-the-wishes-of-his-boss-donald-trump/articleshow/118962161.cms",
    "timestamp": "2025-03-13T05:24:50Z"
  },
  {
    "title": "The Destructiveness of “America First” Begins at Home",
    "description": "Trump’s Exaggerated Opportunity Donald Trump’s embrace of “America First” represents a dramatic U-turn from the liberal internationalism that Democratic and Republican presidents alike adopted as a foreign policy framework. Free trade and economic globalizati…",
    "link": "https://www.counterpunch.org/2025/03/13/the-destructiveness-of-america-first-begins-at-home/",
    "timestamp": "2025-03-13T05:24:47Z"
  },
  {
    "title": "THE ECONOMIST: Elon Musk’s antics are not the only problem for Tesla",
    "description": "THE ECONOMIST: Elon Musk’s antics are not the only problem for Teslathenightly.com.au",
    "link": "https://thenightly.com.au/business/the-economist-elon-musks-antics-are-not-the-only-problem-for-tesla-c-18023287",
    "timestamp": "2025-03-13T05:24:40Z"
  },
  {
    "title": "Trump might be willing to do a 'big trade deal' with China, veteran Singapore diplomat Mahbubani says",
    "description": "It is more likely that the Trump administration negotiates a deal with China, compared with the Biden administration, Kishore Mahbubani said.",
    "link": "https://www.cnbc.com/2025/03/13/trump-might-be-willing-to-do-a-big-trade-deal-with-china-mahbubani.html",
    "timestamp": "2025-03-13T05:20:57Z"
  },
  {
    "title": "Germany Readies to Finally Lead Europe, If Merz Can Pull It Off",
    "description": "Prospective chancellor’s legacy already hangs in the balance as spending push gets underway.",
    "link": "https://financialpost.com/pmn/business-pmn/germany-readies-to-finally-lead-europe-if-merz-can-pull-it-off",
    "timestamp": "2025-03-13T05:20:19Z"
  },
  {
    "title": "'Tackling the Trumpian world view': Kevin Rudd speaks out on tariff talks",
    "description": "Australia's ambassador to the United States has warned negotiations with the second Trump administration will continue to be \"tough and rough\".",
    "link": "https://www.abc.net.au/news/2025-03-13/kevin-rudd-details-australia-s-efforts-to-sway-donald-trump/105046514",
    "timestamp": "2025-03-13T05:19:49Z"
  },
  {
    "title": "King Charles conveys ‘deepest affection’ for Canada amid Trump’s 51st state threat",
    "description": "Trump continues to call for Canada to become the 51st state - a position that has infuriated Canadians",
    "link": "https://www.the-independent.com/news/uk/home-news/trump-king-charles-canada-51-state-b2714212.html",
    "timestamp": "2025-03-13T05:19:14Z"
  },
  {
    "title": "Asian shares decline despite rebound on Wall St as investors await next steps in trade wars",
    "description": "Asian shares are mostly lower despite a rebound on Wall Street fueled by an encouraging inflation update",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-decline-despite-rebound-wall-st-investors-119741549",
    "timestamp": "2025-03-13T05:18:17Z"
  },
  {
    "title": "Retail investors cut stakes in these 63 small & midcaps before they plunged up to 60% in 2025 — Smart move or just luck?",
    "description": "Retail investors have reduced their stakes in 63 small and midcap stocks, which saw declines between 61% and 20% in 2025. The sell-off started over the past three quarters, indicating a potential prediction of market downturns or profit booking. Some top name…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-cut-stakes-in-these-63-small-midcaps-before-they-plunged-up-to-60-in-2025-smart-move-or-just-luck/articleshow/118962540.cms",
    "timestamp": "2025-03-13T05:15:01Z"
  },
  {
    "title": "There’s a bipartisan conspiracy of silence on AUKUS — and it flies in the face of democracy",
    "description": "Australian voters have never been allowed to vote on — or hear a proper debate about — the disastrous AUKUS pact.\nThe post There’s a bipartisan conspiracy of silence on AUKUS — and it flies in the face of democracy appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/03/13/aukus-labor-coalition-conspiracy-silence/",
    "timestamp": "2025-03-13T05:08:14Z"
  },
  {
    "title": "Pressed to accept a ceasefire in Ukraine, Putin seems likely to seek his own conditions",
    "description": "By signaling its openness to a ceasefire, Ukraine has handed the Kremlin a difficult challenge at a time when the Russian military has the upper hand in the war: Should Moscow accept a truce and abandon hopes of making new gains, or should it reject the offer…",
    "link": "https://japantoday.com/category/world/pressed-to-accept-a-ceasefire-in-ukraine-putin-seems-likely-to-seek-his-own-conditions",
    "timestamp": "2025-03-13T05:03:28Z"
  },
  {
    "title": "Politics with Michelle Grattan: Peter Dutton on why he’s not Australia’s Trump – ‘I’m my own person’",
    "description": "Opposition leader Peter Dutton joins the podcast to discuss his ambitions if he becomes Prime Minster at the May election.",
    "link": "https://theconversation.com/politics-with-michelle-grattan-peter-dutton-on-why-hes-not-australias-trump-im-my-own-person-252156",
    "timestamp": "2025-03-13T05:02:37Z"
  },
  {
    "title": "Elon Musk’s behaviour is hurting Tesla",
    "description": "Elon Musk's online behaviour has become even more erratic since he became an adviser to the US President, and his businesses are suffering.",
    "link": "https://www.euractiv.com/section/politics/news/elon-musks-behaviour-is-hurting-tesla/",
    "timestamp": "2025-03-13T05:00:15Z"
  },
  {
    "title": "The stockpiling temptation",
    "description": "Trade disruptions, climate change, conflicts, are bringing renewed interest in Europe to be ready for emergencies",
    "link": "https://www.euractiv.com/section/agriculture-food/news/the-stockpiling-temptation/",
    "timestamp": "2025-03-13T05:00:11Z"
  },
  {
    "title": "German Bundestag buries Swabian housewife under €1 trillion debt pile",
    "description": "With an eye on Donald Trump’s Nato threats, Friedrich Merz has a plan that will permit effectively unlimited spending on defence",
    "link": "https://www.irishtimes.com/world/europe/2025/03/13/german-bundestag-buries-swabian-housewife-under-1-trillion-debt-pile/",
    "timestamp": "2025-03-13T05:00:00Z"
  },
  {
    "title": "More big EU decisions may come on defence as US shift on Ukraine causes Brussels to rethink bloc’s security",
    "description": "Europe letter: Period of European leaders carefully tiptoeing around Trump seems to be over",
    "link": "https://www.irishtimes.com/world/europe/2025/03/13/more-big-eu-decisions-may-come-on-defence-as-us-shift-on-ukraine-causes-brussels-to-rethink-blocs-security/",
    "timestamp": "2025-03-13T05:00:00Z"
  },
  {
    "title": "Rubio could face an unfriendly reception from close G7 allies over Trump's policies",
    "description": "U.S. Secretary of State Marco Rubio may be walking into unusually unfriendly territory this week when he meets his counterparts from the Group of 7 industrialized democracies — strong American allies stunned by President Donald Trump’s actions against them. J…",
    "link": "https://japantoday.com/category/world/rubio-could-face-an-unfriendly-reception-from-close-g7-allies-over-trump%27s-policies",
    "timestamp": "2025-03-13T04:59:47Z"
  },
  {
    "title": "Donald Trump vows to respond to EU retaliatory tariffs as trade war escalates",
    "description": "US President Donald Trump said he would respond to the European Union’s retaliatory tariffs against his 25% import levies on steel and aluminum.",
    "link": "https://biztoc.com/x/2e2a2b3d113a5cf5",
    "timestamp": "2025-03-13T04:59:02Z"
  },
  {
    "title": "NASA, SpaceX delay mission meant to bring back astronauts stranded on ISS",
    "description": "Butch Wilmore and Sunita Williams have been stranded on the ISS for nine months after reaching there in June last year. They were supposed to stay there for about a week",
    "link": "https://www.thehindubusinessline.com/news/science/nasa-spacex-delay-mission-meant-to-bring-back-astronauts-stranded-on-iss/article69324645.ece",
    "timestamp": "2025-03-13T04:56:11Z"
  },
  {
    "title": "Asian shares decline despite rebound on Wall St as investors await next steps in trade wars",
    "description": "Asian shares are mostly lower despite a rebound on Wall Street fueled by an encouraging inflation update. Chinese markets were lower as investors watched for the next steps in President Donald Trump’s trade war. U.S. futures fell and oil prices were little ch…",
    "link": "https://www.seattlepi.com/news/world/article/asian-shares-decline-despite-rebound-on-wall-st-20218832.php",
    "timestamp": "2025-03-13T04:54:49Z"
  },
  {
    "title": "Power, Money, Territory: How Trump shook the world in 50 days",
    "description": "In just 50 days, President Donald Trump has undermined the international system the U.S. built post-WWII. His actions include siding with Russia in the Ukraine war, threatening allies, and questioning NATO commitments, thus raising concerns about America's lo…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/power-money-territory-how-trump-shook-the-world-in-50-days/articleshow/118961886.cms",
    "timestamp": "2025-03-13T04:53:17Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,113",
    "description": "These are the key developments on day 1,113 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/3/13/russia-ukraine-war-list-of-key-events-day-1113",
    "timestamp": "2025-03-13T04:51:51Z"
  },
  {
    "title": "Video: JD Vance's Socks Distract Donald Trump At Oval Office Meeting",
    "description": "The lighthearted moment occurred during a White House meeting with Ireland&amp;#039;s Prime Minister Michael Martin on Wednesday",
    "link": "https://www.ndtv.com/world-news/video-jd-vances-socks-distract-donald-trump-at-oval-office-meeting-7913254",
    "timestamp": "2025-03-13T04:51:04Z"
  },
  {
    "title": "Judge extends ban on deportation of U.S. student over opposition to war in Gaza",
    "description": "The case that has become a flash point following a pledge by the administration of U.S. President Donald Trump to deport some pro-Palestinian college activists.",
    "link": "https://www.japantimes.co.jp/news/2025/03/13/world/politics/judge-ban-columbia-student-deportation-us/",
    "timestamp": "2025-03-13T04:50:00Z"
  },
  {
    "title": "Asian shares decline despite rebound on Wall St as investors await next steps in trade wars",
    "description": "BANGKOK (AP) — Asian shares were mostly lower on Thursday despite a rebound on Wall Street fueled by an encouraging update on U.S. consumer prices. U.S. futures fell and oil prices were little changed. Chinese markets slipped as investors watched for the next…",
    "link": "https://financialpost.com/pmn/asian-shares-decline-despite-rebound-on-wall-st-as-investors-await-next-steps-in-trade-wars",
    "timestamp": "2025-03-13T04:49:22Z"
  },
  {
    "title": "Anand Mahindra once had lunch with Canada's new PM Mark Carney. Indian billionaire says he will not repeat his 'mistake'",
    "description": "Anand Mahindra reminisces about his 2017 meeting with Canada's Prime Minister-designate Mark Carney, known for his intelligence and pragmatism. As Carney transitions from central banking to politics, he faces challenges like strained US-Canada trade relations…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/anand-mahindra-once-had-lunch-with-canadas-new-pm-mark-carney-indian-billionaire-says-he-will-not-repeat-his-mistake/articleshow/118960802.cms",
    "timestamp": "2025-03-13T04:47:46Z"
  },
  {
    "title": "Rupee jumps 19 paise to 87.03 against US dollar in early trade",
    "description": "At the interbank foreign exchange, the rupee opened stronger at 87.13 and touched a high of 87.03 against the greenback in early deals, registering a sharp gain of 19 paise from its previous closing level",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-jumps-19-paise-to-8703-against-us-dollar-in-early-trade/article69324590.ece",
    "timestamp": "2025-03-13T04:46:50Z"
  },
  {
    "title": "Tariff tensions continue to impact crude oil market",
    "description": "Weekly petroleum status report by the US EIA (Energy Information Administration) showed that US commercial crude oil inventories increased by 1.4 million barrels for the week ending March 7",
    "link": "https://www.thehindubusinessline.com/markets/commodities/tariff-tensions-continue-to-impact-crude-oil-market/article69324615.ece",
    "timestamp": "2025-03-13T04:44:49Z"
  },
  {
    "title": "Who is Tan Lip-Bu, the Singapore-raised tech titan tasked with steering Intel's comeback?",
    "description": "SAN FRANCISCO: Tan Lip-Bu may be one of the most powerful technology executives you've never heard of. As he steps into one of the highest-profile jobs on the planet - CEO of troubled, storied chipmaker Intel - his performance will be on full display.",
    "link": "https://www.channelnewsasia.com/business/who-intel-ceo-tan-lip-bu-4997466",
    "timestamp": "2025-03-13T04:44:00Z"
  },
  {
    "title": "Judge blocks Trump's EO targeting law firm linked to Hillary Clinton's 2016 campaign",
    "description": "A federal judge on Wednesday issued a temporary restraining order against President Donald Trump's executive order targeting a law firm over its work for...",
    "link": "https://www.upi.com/Top_News/US/2025/03/13/judge-blocks-Trump-law-firm-executive-order/2501741837042/",
    "timestamp": "2025-03-13T04:43:51Z"
  },
  {
    "title": "South Korea to Scrutinize Steel Imports in US Tariff Response",
    "description": "South Korea will strengthen its scrutiny of metals imports to protect its producers from potential dumping in the local market after President Donald Trump proceeded with plans to apply 25% tariffs on global steel and aluminum imports.",
    "link": "https://financialpost.com/pmn/business-pmn/south-korea-to-scrutinize-steel-imports-in-us-tariff-response",
    "timestamp": "2025-03-13T04:39:31Z"
  },
  {
    "title": "Trump’s $1.4 trillion tariff threat spurs companies to seek cover",
    "description": "Companies like Novo Nordisk, Boeing, and Walmart are preparing for the impacts of President Donald Trump’s tariffs. Executives are assessing the potential costs and strategising responses, with some firms planning to increase U.S. production. However, the tar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-1-4-trillion-tariff-threat-spurs-companies-to-seek-cover/articleshow/118960627.cms",
    "timestamp": "2025-03-13T04:34:25Z"
  },
  {
    "title": "Gavin Newsom drops bombshell Elon Musk claim on podcast with Trump ally Steve Bannon",
    "description": "Gavin Newsom and Steve Bannon found common ground over the idea that California is responsible for Elon Musk's rise to power. The pair traded blows in a 56-minute chat for Newsom's new podcast, one that has drawn outrage from the governor's party for platform…",
    "link": "https://freerepublic.com/focus/f-bloggers/4303926/posts",
    "timestamp": "2025-03-13T04:34:14Z"
  },
  {
    "title": "US public souring on Trump’s handling of economy, polls show",
    "description": "Majority of Americans disapprove of Trump’s economic management amid stock market turmoil, polls show.",
    "link": "https://www.aljazeera.com/economy/2025/3/13/us-public-souring-on-trumps-handling-of-economy-polls-show",
    "timestamp": "2025-03-13T04:33:34Z"
  },
  {
    "title": "Ari Melber Says It’s Important Not to Lose ‘Your Ability to Be Outraged About Lies’ Amid Trump-Musk Corruption | Video",
    "description": "\"It's not what a free market looks like,\" the MSNBC host says about the White House Tesla promotion\nThe post Ari Melber Says It’s Important Not to Lose ‘Your Ability to Be Outraged About Lies’ Amid Trump-Musk Corruption | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/ari-melber-donald-trump-elon-musk-msnbc/",
    "timestamp": "2025-03-13T04:32:51Z"
  },
  {
    "title": "Rupee jumps 19 paise to 87.03 against US dollar in early trade",
    "description": "The rupee appreciated 19 paise to 87.03 against the US dollar, aided by favourable macroeconomic data. Lower crude oil prices and a weaker dollar index supported the local currency. India's retail inflation dipped to a seven-month low, and industrial producti…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-jumps-19-paise-to-87-03-against-us-dollar-in-early-trade/articleshow/118960936.cms",
    "timestamp": "2025-03-13T04:31:15Z"
  },
  {
    "title": "Vaccinating poultry could help cut soaring egg prices but US remains hesitant",
    "description": "Vaccines could be a key means of suppressing bird flu and avoiding the slaughter of millions of chickens, which is blamed for egg prices averaging nearly $5 a dozen",
    "link": "https://abcnews.go.com/Technology/wireStory/vaccinating-poultry-cut-soaring-egg-prices-us-remains-119741021",
    "timestamp": "2025-03-13T04:30:16Z"
  },
  {
    "title": "SpaceX cancel earlier launch date to rescue stuck astronauts following Trump and Musk request",
    "description": "SpaceX cancel earlier launch date to rescue stuck astronauts following Trump and Musk request7news.com.au",
    "link": "https://7news.com.au/news/spacex-cancel-earlier-launch-date-to-rescue-stuck-astronauts-following-trump-and-musk-request-c-18026042",
    "timestamp": "2025-03-13T04:28:05Z"
  },
  {
    "title": "Contentious Republican town halls are going viral",
    "description": "In a TikTok video from CNN that has been viewed more than 3 million times since late February, the voice of a voter in Roswell, Georgia, pierces through a town hall event held by Rep. Rich McCormick (R-GA).  “Tyranny is rising in the White House, and a man ha…",
    "link": "https://www.theverge.com/news/628284/republican-town-hall-videos-doge-musk-trump-tiktok",
    "timestamp": "2025-03-13T04:25:58Z"
  },
  {
    "title": "Rubio could face an unfriendly reception from close G7 allies over Trump's policies",
    "description": "U.S. Secretary of State Marco Rubio may be walking into unusually unfriendly territory this week when he meets his counterparts from the Group of 7 industrialized democracies",
    "link": "https://abcnews.go.com/International/wireStory/rubio-face-unfriendly-reception-close-g7-allies-trumps-119740550",
    "timestamp": "2025-03-13T04:22:20Z"
  },
  {
    "title": "Doubts Over Climate Funding As Donors Squeeze Aid",
    "description": "There are growing doubts about a pledge by rich nations to provide more climate finance to poorer nations, as foreign aid budgets are slashed and the US guts environmental spending.",
    "link": "https://www.ibtimes.com/doubts-over-climate-funding-donors-squeeze-aid-3766116",
    "timestamp": "2025-03-13T04:18:12Z"
  },
  {
    "title": "Greenland Just Had An Election. Here's How Its Only Pro-Trump Candidate Did.",
    "description": "President Donald Trump has been openly courting the Danish territory to join the United States.",
    "link": "https://www.huffpost.com/entry/greeland-election-results-trump_n_67d242b1e4b072b61d66936e",
    "timestamp": "2025-03-13T04:17:37Z"
  },
  {
    "title": "Doubts over climate funding as donors squeeze aid",
    "description": "There are growing doubts about a pledge by rich nations to provide more climate finance to poorer nations, as foreign aid budgets are slashed and the US guts environmental spending. Richer nations committed at the UN COP29 summit in November to boost spending…",
    "link": "https://www.digitaljournal.com/world/doubts-over-climate-funding-as-donors-squeeze-aid/article",
    "timestamp": "2025-03-13T04:17:20Z"
  },
  {
    "title": "Kash Patel Announces a CBP Director Is Under Investigation for Alleged FEMA Fraud",
    "description": "The rooting out of government fraud and waste continues, this time at the U.S. Customs and Border Protection Agency (CBP). A career CBP employee—a director, no less—appears to have gamed the federal system and siphoned from money slated for emergency manageme…",
    "link": "https://freerepublic.com/focus/f-bloggers/4303924/posts",
    "timestamp": "2025-03-13T04:14:59Z"
  },
  {
    "title": "Trump’s $1.4 Trillion Tariff Threat Spurs Companies to Seek Cover",
    "description": "Ozempic-maker Novo Nordisk A/S is planning to make more of its medicines for the US market in the country; Boeing Co. risks a gummed up supply chain and higher aircraft costs it may not be able to pass on; Chinese online retailer Shein Group Ltd. is offering …",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-1-4-trillion-tariff-threat-spurs-companies-to-seek-cover",
    "timestamp": "2025-03-13T04:14:12Z"
  },
  {
    "title": "Vaccinating poultry could help cut soaring egg prices but US remains hesitant",
    "description": "OMAHA, Neb. (AP) — Vaccines could be a key means of suppressing bird flu and avoiding the slaughter of millions of chickens, which is blamed for egg prices averaging nearly $6 a dozen. But the move has been delayed in part because of concerns it could jeopard…",
    "link": "https://financialpost.com/pmn/vaccinating-poultry-could-help-cut-soaring-egg-prices-but-us-remains-hesitant",
    "timestamp": "2025-03-13T04:14:01Z"
  },
  {
    "title": "Trump Pardons Ex-Tennessee State Senator Imprisoned for Campaign Fraud - The New York Times",
    "description": "Trump Pardons Ex-Tennessee State Senator Imprisoned for Campaign FraudThe New York Times Ex-Tennessee lawmaker announces Trump's pardon 2 weeks into prison time for campaign finance schemeYahoo A former Tennessee lawmaker wasn't allowed to reverse his guilty …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176699665",
    "timestamp": "2025-03-13T04:12:38Z"
  },
  {
    "title": "Trump Shouldn’t Impose His Will on Ukraine",
    "description": "Engineering Zelensky’s ouster to secure a U.S.-designed peace deal could backfire.\nThe post Trump Shouldn’t Impose His Will on Ukraine appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-shouldnt-impose-his-will-on-ukraine/",
    "timestamp": "2025-03-13T04:05:00Z"
  },
  {
    "title": "Chagos Islands for Sale",
    "description": "If Trump is looking to add American territory, why not step into the UK’s farcical negotiations with Mauritius?\nThe post Chagos Islands for Sale appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/chagos-islands-for-sale/",
    "timestamp": "2025-03-13T04:01:00Z"
  },
  {
    "title": "Three Cheers For Rep.Tom Massie!",
    "description": "Told you so! Donald Trump doesn’t give two hoots about the true agenda that might actually make America freer and more prosperous again. We are referring to the principles of—- peaceful commerce with every nation, entangling alliances with none. minimalist, s…",
    "link": "https://www.lewrockwell.com/2025/03/david-stockman/902380-2/",
    "timestamp": "2025-03-13T04:01:00Z"
  },
  {
    "title": "How can Trump push Putin toward peace?",
    "description": "The United States-Ukraine plan for a temporary ceasefire has turned up the heat on Russian President Vladimir Putin. What are Donald Trump’s next moves if Putin either refuses to accept the deal or places unacceptable demands on Ukraine and its allies? Host A…",
    "link": "https://www.politico.eu/podcast/power-play/how-can-trump-push-putin-toward-peace/",
    "timestamp": "2025-03-13T04:00:57Z"
  },
  {
    "title": "Moral Bankruptcy: Justifying the Ukraine War as Good for the US Economy",
    "description": "Supporters of the U.S.-NATO proxy war in Ukraine employ a range of dubious justifications.  One is a refurbished version of the old domino theory used during the Cold War – if the United States and its allies don’t help Ukraine expel Russian occupation forces…",
    "link": "https://original.antiwar.com/ted_galen_carpenter/2025/03/12/moral-bankruptcy-justifying-the-ukraine-war-as-good-for-the-us-economy/",
    "timestamp": "2025-03-13T04:00:39Z"
  },
  {
    "title": "Canada’s Navy Sails With US Ships as Trump Talks Annexation",
    "description": "Reprinted from Yves Engler’s website. As Donald Trump seeks to cripple Canada economically to pursue annexation, the Royal Canadian Navy (RCN) is assisting the US bid to stoke war with China. With far-right Trump supporters calling for the US to invade, Canad…",
    "link": "https://original.antiwar.com/yves_engler/2025/03/12/canadas-navy-sails-with-us-ships-as-trump-talks-annexation/",
    "timestamp": "2025-03-13T04:00:27Z"
  },
  {
    "title": "The Danes and the Greenlanders: How They See Trump's America",
    "description": "I am afraid that the Danes are in danger of losing their good old-fashioned judgment, especially when it comes to the U.S.A. and its people.\r\n\r\nI am in Denmark, and the other day, I listened to a podcast from a popular Danish radio station where the ...",
    "link": "https://www.americanthinker.com/articles/2025/03/the_danes_the_greenlanders_and_how_they_see_trump_s_america.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Is ActBlue a Criminal Enterprise?",
    "description": "Photo Credit:\n \n ActBlueNever in the 236-year political history of the United States has there been a more expansive, criminal, and blatant scheme to manipulate the electoral process than the actions of ActBlue in league with the Democrat Party.",
    "link": "https://www.americanthinker.com/articles/2025/03/is_actblue_a_criminal_enterprise.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Biden and the U.S. Steel case",
    "description": "Periodic democratic elections are a hallmark of our republican form of government and provide both safeguards and opportunities for all Americans. A problem occurs when those in power act in self-interest to corrupt fundamental principles and process...",
    "link": "https://www.americanthinker.com/blog/2025/03/biden_and_the_u_s_steel_case.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Getting the left out of the political wilderness",
    "description": "President Trump has the left’s number.  He spent a lifetime among the leftist glitterati.  He knows the moves they are going to make.  He’s setting them up for a fall every time, and he’s boosting his p...",
    "link": "https://www.americanthinker.com/blog/2025/03/getting_the_left_out_of_the_political_wilderness.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Art, Activism, and the City: Illuminating Social Change",
    "description": "The creative fusion of art and activism in urban spaces has propelled the British collective Led by Donkeys into the spotlight, garnering millions of views for their interventions on social media. Their critical visual occupations - whether billboard messages…",
    "link": "https://www.archdaily.com/1027904/art-activism-and-the-city-illuminating-social-change",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Reforming the Kennedy Center",
    "description": "During his first term, President Trump ably governed the nation to ensure prosperity but overlooked the cultural aspect. Perhaps he underestimated the effect of arts and culture in shaping public opinion. \r\n\r\nConsequently, there was no impa...",
    "link": "https://www.americanthinker.com/articles/2025/03/reforming_the_kennedy_center.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "The (un)masked magician’s apprentice",
    "description": "In 2017, at the beginning of the first Trump administration, I wrote an American Thinker piece titled “Donald Trump, the (Un)Masked Magician,” The essay compared to the Masked Magician, the 1990s TV show in which a masked magician reveale...",
    "link": "https://www.americanthinker.com/blog/2025/03/the_un_masked_magician_s_apprentice.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "After blowing $9 billion on 'free' health care for illegals, California's Gov. Gavin Newsom asks for a bailout",
    "description": "Gavin Newsom wants a bailout.\r\n\r\nOh, not from Donald Trump. At this point, he probably knows better than that. But from the state's rainy day",
    "link": "https://www.americanthinker.com/blog/2025/03/after_blowing_9_billion_on_free_health_care_for_illegals_california_s_gov_gavin_newsom_asks_for_a_bailout.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "The Democrats are so passionate ...",
    "description": "About what are the Democrats so passionate? \r\n\r\nWell, it’s not national security.  It is not the economy.  It is not the education of America’s youth.  It is not crime; they are, however, passionate about criminals and...",
    "link": "https://www.americanthinker.com/blog/2025/03/the_democrats_are_so_passionate.html",
    "timestamp": "2025-03-13T04:00:00Z"
  },
  {
    "title": "Sensex rises 100 pts as soft inflation data eases market mood; Nifty above 22,450",
    "description": "Indian equity indices open higher with gains in banking and IT stocks, spurred by softer inflation data in U.S. and India. However, global tensions loom as Trump's tariff threats persist. Key gains include Tata Steel and MTNL, while tech stocks lead in Asia. …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-rise-in-early-trade-as-soft-inflation-data-eases-market-mood/articleshow/118959904.cms",
    "timestamp": "2025-03-13T03:58:35Z"
  },
  {
    "title": "Trump Warns Putin: Refusing Ceasefire \"Would Be Devastating For Russia\"",
    "description": "Donald Trump said that US negotiators are headed to Russia &quot;right now&quot; for talks on a possible ceasefire with Ukraine, a day after Kyiv agreed to a 30-day truce.",
    "link": "https://www.ndtv.com/world-news/donald-trump-warns-vladimir-putin-refusing-russia-ukraine-war-ceasefire-would-be-devastating-for-russia-7912950",
    "timestamp": "2025-03-13T03:58:14Z"
  },
  {
    "title": "Mohamed El-Erian Says 'Fed Put' Optimism Rises As Inflation Cools—But 'Trump Put' Hopes Are Shaken",
    "description": "U.S. markets rallied on Wednesday after February’s inflation report came in softer than anticipated, bolstering expectations for Federal Reserve rate cuts while investors reassess the economic impact of President Donald Trump administration’s policies.\nWhat H…",
    "link": "https://biztoc.com/x/6651d8f8a61a1d23",
    "timestamp": "2025-03-13T03:58:04Z"
  },
  {
    "title": "US Military Getting Ready To Fire All Its Transgendered Troops—No More Recruitment For Trans Group - NewsBreak",
    "description": "Among several campaign promises, one promise that Donald Trump made was to get trans people out of the military. In all his years in politics, he has made",
    "link": "https://www.newsbreak.com/share/3851935742101-us-military-getting-ready-to-fire-all-its-transgendered-troops-no-more-recruitment-for-trans-group?_f=app_share&pd=0GPe6ZbU&lang=en_US&send_time=1741838113&trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.10.2.4%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_rank_exp_25q1-v4%2Cns_local_strategy_25q1_exp-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v4%2Cns_foryou_model_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v6&s=i2",
    "timestamp": "2025-03-13T03:55:44Z"
  },
  {
    "title": "'Beneath any POTUS': ADL turns on Trump after 'slur' targeting Schumer",
    "description": "The Anti-Defamation League has backed President Donald Trump and his allies recently — including those who've faced accusations of making a Nazi salute — but found itself at odds with the president after he once again attacked Senate Minority Leader Chuck Sch…",
    "link": "https://www.rawstory.com/chuck-schumer-donald-trump/",
    "timestamp": "2025-03-13T03:52:04Z"
  },
  {
    "title": "Fetterman urges Democrats to talk like ‘regular’ people instead of ranting about ‘oligarchs’",
    "description": "The Pennsylvania senator said most people don't know what oligarchy means.",
    "link": "https://nypost.com/2025/03/12/us-news/fetterman-urges-democrats-to-talk-like-regular-people-instead-of-ranting-about-oligarchs/",
    "timestamp": "2025-03-13T03:50:30Z"
  },
  {
    "title": "Former Texas megachurch pastor indicted in Oklahoma on child sexual abuse charges",
    "description": "The Oklahoma Attorney General’s office says a former pastor of a Texas megachurch who resigned after a woman accused him of sexually abusing her in the 1980s has been indicted on child sexual abuse charges",
    "link": "https://abcnews.go.com/US/wireStory/former-texas-megachurch-pastor-indicted-oklahoma-child-sexual-119736409",
    "timestamp": "2025-03-13T03:50:26Z"
  },
  {
    "title": "WATCH: Border Czar Tom Homan Gives New Meaning to the Word ICE, Calmly Eats an Apple While Protesters Scream at Him",
    "description": "Not only is Tom Homan ready to flood New York state with ICE (Immigration and Customs Enforcement) agents to carry out mass deportation efforts, but he apparently has ICE flowing through his veins as well. Get it? See what I did there? Homan was in the Empire…",
    "link": "https://freerepublic.com/focus/f-bloggers/4303920/posts",
    "timestamp": "2025-03-13T03:49:57Z"
  },
  {
    "title": "Why Trump can’t drive the Tesla he just bought",
    "description": "Donald Trump turned the White House lawn into a Tesla showroom on Tuesday as he attempted to buoy his ally's brand. But can he even drive the car he bought?",
    "link": "https://www.abc.net.au/news/2025-03-13/audience-why-trump-can-t-drive-the-tesla-he-just-bought/105047050",
    "timestamp": "2025-03-13T03:49:53Z"
  },
  {
    "title": "Elon Musk must turn over records and answer questions on what he's doing at DOGE, judge orders",
    "description": "DOGE has been hit with nearly two dozen lawsuits since the start of President Donald Trump's second term.",
    "link": "https://www.businessinsider.com/judge-orders-elon-musk-turn-over-records-answer-questions-doge-2025-3",
    "timestamp": "2025-03-13T03:49:50Z"
  },
  {
    "title": "Stocks gain after mild US inflation; yields buoyed by trade tensions",
    "description": "TOKYO : Tech stocks led advances in Asia on Thursday, taking their cue from Wall Street's gains after tepid inflation data allayed concerns over the state of the U.S. economy.U.S. Treasury yields remained elevated after pulling further away from recent lows t…",
    "link": "https://www.channelnewsasia.com/business/stocks-gain-after-mild-us-inflation-yields-buoyed-trade-tensions-4997471",
    "timestamp": "2025-03-13T03:46:15Z"
  },
  {
    "title": "Indian generic drugs linked to deaths in US? Trade group slams study blaming desi pharma",
    "description": "A study found Indian generics sold in the US between 2009-2018 linked to a 54% higher risk of serious side effects compared to domestic drugs. The findings have drawn criticism from the Indian Pharmaceutical Alliance, which disputes the study’s methodology an…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indian-generic-drugs-linked-to-deaths-in-us-trade-group-slams-study-blaming-desi-pharma/articleshow/118959152.cms",
    "timestamp": "2025-03-13T03:46:14Z"
  },
  {
    "title": "Indian generic drugs linked to deaths in US? Trade group slams study blaming desi pharma",
    "description": "A study found Indian generics sold in the US between 2009-2018 linked to a 54% higher risk of serious side effects compared to domestic drugs. The findings have drawn criticism from the Indian Pharmaceutical Alliance, which disputes the study’s methodology an…",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/indian-generic-drugs-linked-to-deaths-in-us-trade-group-slams-study-blaming-desi-pharma/articleshow/118959632.cms",
    "timestamp": "2025-03-13T03:46:14Z"
  },
  {
    "title": "Miranda Devine: Elon Musk playing the role of ‘super man’ — even as haters try to drag him, DOGE down",
    "description": "Despite all Elon Musk is achieving, the richest man on Earth is down in the dumps.",
    "link": "https://nypost.com/2025/03/12/opinion/miranda-devine-elon-musk-playing-the-role-of-super-man-even-as-haters-try-to-drag-him-doge-down/",
    "timestamp": "2025-03-13T03:43:47Z"
  },
  {
    "title": "Nomura exits bank climate group, joining Wall Street exodus",
    "description": "Nomura said it will stick to its target set four years ago, to deploy $125 billion of sustainable financing through March 2026.",
    "link": "https://www.japantimes.co.jp/business/2025/03/13/companies/nomura-exit-climate-group/",
    "timestamp": "2025-03-13T03:43:00Z"
  },
  {
    "title": "Judith Collins ‘not aware’ of diversity quotas in public service after Winston Peters’ comments",
    "description": "There are targets in a public service plan.",
    "link": "https://www.nzherald.co.nz/nz/politics/judith-collins-not-aware-of-diversity-quotas-in-public-service-after-winston-peters-comments/FJ7ZI6JXLBCGZMZ7LEUWXWQPGY/",
    "timestamp": "2025-03-13T03:40:45Z"
  },
  {
    "title": "Intel's new CEO Lip-Bu Tan has a history as a successful underdog",
    "description": "Tan, named Intel CEO on Wednesday, faces an enormous challenge in turning around the operations of a company that put the \"silicon\" in Silicon Valley.",
    "link": "https://economictimes.indiatimes.com/tech/technology/intels-new-ceo-lip-bu-tan-has-a-history-as-a-successful-underdog/articleshow/118959372.cms",
    "timestamp": "2025-03-13T03:36:48Z"
  },
  {
    "title": "Tesla troubles mount as market weighs potential lifelines",
    "description": "Tesla is facing mounting challenges, from slumping demand for EVs to setbacks in AI-driven self-driving technology. While former US President Donald Trump has pledged to buy a Tesla, opinions remain split on whether his support offers relief or adds to the tu…",
    "link": "https://www.digitimes.com/news/a20250313PD213/tesla-market-demand-apple-technology.html",
    "timestamp": "2025-03-13T03:33:08Z"
  },
  {
    "title": "USAID’s demise raises fears for millions of lives across the Global South",
    "description": "US President Donald Trump's administration has abolished 83 percent of aid agency's humanitarian programmes.",
    "link": "https://www.aljazeera.com/news/2025/3/13/across-global-south-usaids-demise-raises-fears-of-malaria-tb-resurgence",
    "timestamp": "2025-03-13T03:32:42Z"
  }
]