[
  {
    "title": "Trump Imposes 15% Global Tariff After Supreme Court Ruling",
    "description": "President Donald Trump is responding to the Supreme Court’s ruling against his tariff program, lashing out at the justices including two of his own appointees and imposing a 15% blanket tariff on all imports. The administration also says it's waiting on guida…",
    "link": "https://www.today.com/video/what-happens-to-130b-raised-by-tariffs-now-deemed-illegal-258120261582",
    "timestamp": "2026-02-23T12:35:54Z"
  },
  {
    "title": "25 Mexican National Guard troops left dead during an operation that killed cartel leader ‘El Mencho’",
    "description": "He was killed during a shoot-out as the Mexican military attempted to capture him.",
    "link": "https://www.denverpost.com/2026/02/23/mexico-violence-jalisco-cartel/",
    "timestamp": "2026-02-23T12:32:41Z"
  },
  {
    "title": "Mexico fears more violence after army kills leader of powerful Jalisco cartel",
    "description": "He was killed during a shoot-out as the Mexican military attempted to capture him.",
    "link": "https://www.bostonherald.com/2026/02/23/mexico-violence-jalisco-cartel/",
    "timestamp": "2026-02-23T12:32:41Z"
  },
  {
    "title": "The Substance star Dennis Quaid admits he’s ‘conservative’ as he gushes over Trump",
    "description": "Dennis Quaid, star of The Substance and The Parent Trap, has hit out at Hollywood for being too left-wing as he gushed over president Donald Trump. The veteran actor, 71, appeared on pastor Greg Laurie’s podcast The Greg Laurie Show!, on 18 February, where he…",
    "link": "https://www.thepinknews.com/2026/02/23/the-substance-dennis-quaid-conservative-donald-trump/",
    "timestamp": "2026-02-23T12:32:17Z"
  },
  {
    "title": "How Trump Appointees Derailed a Clean Energy Future at the Nation’s Largest Public Utility",
    "description": "This story was originally published by Grist and is reproduced here as part of the Climate Desk collaboration. This coverage is made possible through a partnership between Grist and BPR, a public radio station serving western North Carolina. The Tennessee Val…",
    "link": "https://www.motherjones.com/environment/2026/02/tva-how-trumps-appointees-derailed-a-clean-energy-future-at-the-nations-largest-public-utility/",
    "timestamp": "2026-02-23T12:30:00Z"
  },
  {
    "title": "Netflix boss responds to Trump's call to fire Susan Rice: 'This is a business deal, not a political deal'",
    "description": "Ted Sarandos, co-CEO of Netflix, has responded to Trump's calls for the company to fire Susan Rice from its board as it bids for Warner Bros.",
    "link": "https://www.businessinsider.com/netflix-ceo-responds-trump-susan-rice-board-warner-bros-paramount-2026-2",
    "timestamp": "2026-02-23T12:28:31Z"
  },
  {
    "title": "Indian bonds tick higher as US-Iran jitters ease, but hefty debt sales loom",
    "description": "Indian government bonds edged ​higher on Monday as geopolitical ​jitters ebbed ahead of a third round of ​U.S.-Iran nuclear talks, though heavy debt supply due this week capped gains.",
    "link": "https://economictimes.indiatimes.com/markets/bonds/indian-bonds-tick-higher-as-us-iran-jitters-ease-but-hefty-debt-sales-loom/articleshow/128713782.cms",
    "timestamp": "2026-02-23T12:22:30Z"
  },
  {
    "title": "Trump plans to 'scold' justices as Republicans ready for 'awkward' State of Union: analyst",
    "description": "President Donald Trump is expected to boast about his accomplishments Tuesday during his State of the Union address Tuesday, but according to one political analyst the event may turn into an “awkward” affair due to the president’s fury over the Supreme Court’…",
    "link": "https://www.rawstory.com/state-of-the-union-2675293340/",
    "timestamp": "2026-02-23T12:20:43Z"
  },
  {
    "title": "Supreme Court tariff ruling lifts Sensex 480 points; IT bleeds as PSU banks shine",
    "description": "The Sensex gained 479.95 points, or 0.58%, to close at 83,294.66, while the Nifty rose 141.75 points, or 0.55%, to settle at 25,713",
    "link": "https://www.thehindubusinessline.com/markets/supreme-court-tariff-ruling-lifts-sensex-480-points-it-bleeds-as-psu-banks-shine/article70666821.ece",
    "timestamp": "2026-02-23T12:19:49Z"
  },
  {
    "title": "Scared Yet? Iran Promises to Respond ‘Ferociously’ If U.S. Dares to Attack",
    "description": "Don't even think about it. That was Iran's warning Monday that any U.S. attack on its soil would spur the Islamic republic to respond \"ferociously\" after President Donald Trump said he was considering limited strikes against the country.\nThe post Scared Yet? …",
    "link": "https://www.breitbart.com/middle-east/2026/02/23/scared-yet-iran-promises-to-respond-ferociously-if-u-s-dares-to-attack/",
    "timestamp": "2026-02-23T12:18:43Z"
  },
  {
    "title": "Transcript: Trump’s Rage at SCOTUS Backfires as GOPers Turn on Him",
    "description": "The following is a lightly edited transcript of the February 23 episode of the Daily Blast podcast. Listen to it here.After we recorded this episode, more Republicans voiced concerns about Trump. Senator Mitch McConnell pointedly noted that Congress is “not a…",
    "link": "https://newrepublic.com/article/206885/transcript-trump-rage-scotus-backfires-gopers-turn",
    "timestamp": "2026-02-23T12:18:26Z"
  },
  {
    "title": "John Oliver Flips An Infamous Elon Musk Stunt Back At Him In Scathing X Takedown",
    "description": "The \"Last Week Tonight\" host delivered a damning deep dive on the platform formerly known as Twitter.",
    "link": "https://www.huffpost.com/entry/john-oliver-elon-musk-twitter_n_699c2a14e4b0f41da8d4bf4b",
    "timestamp": "2026-02-23T12:15:44Z"
  },
  {
    "title": "Donald Trump fixes Uros Medic’s immigration issues after KOTY win at UFC Houston",
    "description": "UFC fighters with visa problems just learned something in Houston over the weekend: ask and ye shall receive. Uros Medic won his co-main fight against Geoff Neal via violent first round knockout (watch it here) and then followed that up not with a request — n…",
    "link": "https://www.mmamania.com/ufc-news/424326/donald-trump-fixes-uros-medics-immigration-issues-after-koty-win-at-ufc-houston",
    "timestamp": "2026-02-23T12:15:30Z"
  },
  {
    "title": "Tariff travails resurface, bitcoin holders prepare for declines",
    "description": "The day ahead in crypto: Feb. 23, 2026",
    "link": "https://www.coindesk.com/daybook-us/2026/02/23/tariff-travails-resurface-bitcoin-holders-prepare-for-declines",
    "timestamp": "2026-02-23T12:15:00Z"
  },
  {
    "title": "How did the Supreme Court ruling change Trump's tariffs? #world",
    "description": "Ruling, reaction and ripple effects The U.S. Supreme Court found that the authority President Donald Trump relied on to impose sweeping, country‑specific tariffs did not give him the power to do so unilaterally. That decision invalidated a large portion of th…",
    "link": "https://alltoc.com/world/how-did-the-supreme-court-ruling-change-trump-s-tariffs",
    "timestamp": "2026-02-23T12:14:11Z"
  },
  {
    "title": "How many interest rate cuts could the Federal Reserve deliver this year? What markets expect now",
    "description": "Federal Reserve rate cuts 2026: Federal Reserve rate cut expectations for 2026 are shifting. Markets initially anticipated two cuts this year. However, recent inflation data shows a slight cooling. This could lead to more than two quarter-point reductions. Fe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-many-interest-rate-cuts-could-the-federal-reserve-deliver-this-year-what-markets-expect-now/articleshow/128712621.cms",
    "timestamp": "2026-02-23T12:14:10Z"
  },
  {
    "title": "US futures slip and world markets are mixed after the Supreme Court nixes Trump’s tariffs",
    "description": "Despite the ruling, tariffs aren’t going away.",
    "link": "https://www.denverpost.com/2026/02/23/financial-markets-trump-tariffs-supreme-court/",
    "timestamp": "2026-02-23T12:10:48Z"
  },
  {
    "title": "US futures slip and world markets are mixed after the Supreme Court nixes Trump’s tariffs",
    "description": "Despite the ruling, tariffs aren’t going away.",
    "link": "https://www.bostonherald.com/2026/02/23/financial-markets-trump-tariffs-supreme-court/",
    "timestamp": "2026-02-23T12:10:48Z"
  },
  {
    "title": "'Is this a confession?' Morning Joe calls Trump smear 'worst moment of presidency'",
    "description": "A stunning accusation Donald Trump aimed at the six Supreme Court justices who ruled against his tariff policies caused “Morning Joe” co-host Joe Scarborough to have his producers cut off the clip of the Friday White House rant on Monday morning.The MS NOW ho…",
    "link": "https://www.rawstory.com/trump-supreme-court-2675293246/",
    "timestamp": "2026-02-23T12:10:06Z"
  },
  {
    "title": "Who was ‘El Mencho'?",
    "description": "Nemesio “El Mencho” Oseguera Cervantes was a feared Mexican drug lord and the leader of a ruthless cartel accused of masterminding efforts to push fentanyl into the United States.",
    "link": "https://www.wcvb.com/article/el-mencho-death-cjng-fentanyl/70460668",
    "timestamp": "2026-02-23T12:07:56Z"
  },
  {
    "title": "Yet another hospital abandons trans youth healthcare",
    "description": "Yet another US hospital is spiking its gender-affirming care program for trans youth following pressure from the Trump administration. NYU Langone Health, an academic health system in New York City, announced plans to shutter its Transgender Youth Health Prog…",
    "link": "https://www.thepinknews.com/2026/02/23/hospital-trans-youth-healthcare-abandoned/",
    "timestamp": "2026-02-23T12:06:45Z"
  },
  {
    "title": "US military begins withdrawing from key base in northeastern Syria",
    "description": "Pullout comes after Syrian forces take control of northeast region from Kurdish-led SDF.",
    "link": "https://www.aljazeera.com/news/2026/2/23/us-military-begins-withdrawing-from-key-base-in-northeastern-syria",
    "timestamp": "2026-02-23T12:05:53Z"
  },
  {
    "title": "Fact-check: Trump's Latest Claims on Jobs, Inflation and Crime (New York Times)",
    "description": "New York Times:\nFact-check: Trump's Latest Claims on Jobs, Inflation and Crime  —  Trends on jobs, inflation and crime that began before Donald Trump retook office continued, largely unabated, in his first year back.  —  In the days before his State of the Un…",
    "link": "https://www.memeorandum.com/260223/p14",
    "timestamp": "2026-02-23T12:05:02Z"
  },
  {
    "title": "FBI identifies gunman shot dead at entrance of Trump's Florida estate",
    "description": "The FBI and U.S. Secret Service have released more details after an armed man drove into the secure perimeter of Mar-a-Lago, President Donald Trump's resort in Palm Beach, Fla., on Sunday morning. He was identified as Austin Martin, 21, a North Carolina nativ…",
    "link": "https://www.cbc.ca/news/world/fla-trump-estate-gunman-shot-9.7102181",
    "timestamp": "2026-02-23T12:02:36Z"
  },
  {
    "title": "Your Tan Might Be Giving MAGA Vibes, Whether You Like It Or Not",
    "description": "It's no secret the Trump world is very into being tan. But they're also often a very specific kind of tan.",
    "link": "https://www.huffpost.com/entry/maga-tan-how-to-fix_l_69986e66e4b041f92b41754b",
    "timestamp": "2026-02-23T12:00:17Z"
  },
  {
    "title": "What To Do (And What NOT To Do) If ICE Raids A Restaurant",
    "description": "Experts share what to know (and do) if the unexpected were to happen, whether you're a worker or a diner.",
    "link": "https://www.huffpost.com/entry/what-to-do-if-ice-raids-restaurant_l_69947391e4b0000f6418877a",
    "timestamp": "2026-02-23T12:00:17Z"
  },
  {
    "title": "Call Them What They Are",
    "description": "The Republican Party has become a haven for Nazi sympathizers.",
    "link": "https://www.theatlantic.com/magazine/2026/04/republican-party-nazi-problem/686055/",
    "timestamp": "2026-02-23T12:00:00Z"
  },
  {
    "title": "CHAD WOLF: Space isn’t just the final frontier, it’s the ‘ultimate high ground’",
    "description": "Strategic competition between the US and China intensifies as both nations race to establish lunar bases and secure valuable moon resources at stake.",
    "link": "https://www.foxnews.com/opinion/chad-wolf-space-isnt-just-final-frontier-its-ultimate-high-ground",
    "timestamp": "2026-02-23T12:00:00Z"
  },
  {
    "title": "Trump shares bizarre AI video of himself besting Canada's hockey team after Team USA win",
    "description": "President Donald Trump shared an AI-generated video of himself playing hockey for Team USA after the actual national team won a gold medal over Canada in the Olympics.The American team won its first gold medal in men's hockey since 1980 thanks to 24-year-old …",
    "link": "https://www.rawstory.com/trump-calls-usa-hockey-team/",
    "timestamp": "2026-02-23T11:59:59Z"
  },
  {
    "title": "'This Is Not a Drill': Ad Promoting California Billionaire Tax Airs During Olympics",
    "description": "Organizers behind a proposed billionaire wealth tax in California aired their first campaign advertisement on the final day of the 2026 Winter Olympics over the weekend, styling the 30-second spot as an emergency alert warning of a looming healthcare catastro…",
    "link": "https://www.commondreams.org/news/california-billionaire-tax-ad",
    "timestamp": "2026-02-23T11:56:30Z"
  },
  {
    "title": "'We're worried': Experts fear Supreme Court will follow tariff case with huge Trump gift",
    "description": "If the U.S. Supreme Court issues a decision in a high-profile redistricting case within the next few weeks — likely weakening the Voting Rights Act, as experts\r\n anticipate — Republicans are poised to gerrymander as many as eight House seats in their favor ah…",
    "link": "https://www.rawstory.com/raw-investigates/supreme-court-2675289905/",
    "timestamp": "2026-02-23T11:55:04Z"
  },
  {
    "title": "Oil pulls back as U.S.–Iran talks set to resume: Here’s where negotiations stand",
    "description": "Tensions have remained on high alert throughout the Middle East for weeks after U.S. President Donald Trump indicated a strike on Iran could be imminent.",
    "link": "https://www.cnbc.com/2026/02/23/iran-us-talks-oil-falls-nuclear-negotiations.html",
    "timestamp": "2026-02-23T11:48:11Z"
  },
  {
    "title": "DHS spokeswoman Tricia McLaughlin’s replacement is even worse",
    "description": "Kristi Noem isn’t shaking up DHS, she’s doubling down on violence and propaganda",
    "link": "https://www.salon.com/2026/02/23/dhs-spokeswoman-tricia-mclaughlins-replacement-is-even-worse/",
    "timestamp": "2026-02-23T11:45:54Z"
  },
  {
    "title": "Singapore may lose slight competitive edge under new 15% US tariffs, but analysts say it remains resilient",
    "description": "Singapore offers a “certainty premium” backed by institutional stability and fiscal strength, observers say.",
    "link": "https://www.channelnewsasia.com/singapore/us-tariffs-asean-exports-markets-economy-growth-5946966",
    "timestamp": "2026-02-23T11:45:51Z"
  },
  {
    "title": "‘A check on his power’: Trump weakened but not deterred after tariff ruling, say analysts",
    "description": "The US Supreme Court may have imposed a legal check on Donald Trump’s presidential power, but for global businesses and governments, the era of tariff turbulence is far from over, say experts.",
    "link": "https://www.channelnewsasia.com/asia/usa-donald-trump-traiffs-supreme-court-trade-uncertainty-analysts-5947051",
    "timestamp": "2026-02-23T11:42:36Z"
  },
  {
    "title": "‘A check on his power’: Trump weakened but not deterred after tariff ruling, say analysts",
    "description": "<![CDATA[ The US Supreme Court may have imposed a legal check on Donald Trump’s presidential power, but for global businesses and governments, the era of tariff turbulence is far from over, say experts.  ]]>",
    "link": "https://www.channelnewsasia.com/asia/trump-tariffs-supreme-court-trade-uncertainty-analysts-5947051",
    "timestamp": "2026-02-23T11:42:00Z"
  },
  {
    "title": "Iran says ready for talks but will defend itself against US aggression",
    "description": "Remarks from Ministry of Foreign Affairs come after Trump says he is considering an attack if nuclear deal not reached.",
    "link": "https://www.aljazeera.com/news/2026/2/23/iran-says-ready-for-talks-but-will-defend-itself-against-us-aggression",
    "timestamp": "2026-02-23T11:40:38Z"
  },
  {
    "title": "Bitcoin treasury firms log rare selling streak as BTC trades near $66K",
    "description": "Continued selling from treasury companies and US Bitcoin ETFs threatens a deeper retracement for BTC, but analysts see it as a sign of a healthy flush in speculative leverage.",
    "link": "https://cointelegraph.com/news/bitcoin-treasury-selling-streak-btc-66-000",
    "timestamp": "2026-02-23T11:38:21Z"
  },
  {
    "title": "JPMorgan Chase Closed Trump Accounts After Capitol Riot, Court Filing Reveals",
    "description": "JPMorgan Chase admits it closed Donald Trump's accounts after Jan. 6 as he pursues a $5 billion lawsuit alleging political discrimination.",
    "link": "https://www.ibtimes.com.au/jpmorgan-chase-closed-trump-accounts-after-capitol-riot-court-filing-reveals-1861906",
    "timestamp": "2026-02-23T11:32:11Z"
  },
  {
    "title": "EU Pushes Back on US Tariff Moves Following Supreme Court Decision",
    "description": "The EU urges the U.S. to honor their trade deal after new tariffs were introduced following a Supreme Court ruling.",
    "link": "https://www.ibtimes.com.au/eu-pushes-back-us-tariff-moves-following-supreme-court-decision-1861904",
    "timestamp": "2026-02-23T11:31:10Z"
  },
  {
    "title": "Bitcoin stabilizes after overnight crypto rout, bouncing to $66,000",
    "description": "Bitcoin fell to $64,270 shortly after midnight UTC before rebounding to $66,300, as thin liquidity amplified moves tied to fresh U.S. tariff plans and geopolitical tensions.",
    "link": "https://www.coindesk.com/markets/2026/02/23/overnight-crypto-rout-reverses-bitcoin-rebounds-to-usd66-300",
    "timestamp": "2026-02-23T11:30:00Z"
  },
  {
    "title": "EU to suspend trade deal with US after supreme court ruled Trump's tariffs unlawful",
    "description": "The parliament’s trade committee had been due to give its green light tomorrow.",
    "link": "https://www.thejournal.ie/eu-to-suspend-trade-deal-with-us-after-supreme-court-ruled-trumps-tariffs-unlawful-6965050-Feb2026/",
    "timestamp": "2026-02-23T11:28:03Z"
  },
  {
    "title": "Evaluating the Trump Administration's New Most Favored Nation (MFN) Medicaid GENEROUS Model",
    "description": "The implementation of the Most Favored Nation (MFN) pricing and the introduction of the GENEROUS model in U.S. Medicaid present opportunities for pharmaceutical companies to align with international reference pricing strategies, potentially expanding market a…",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242441/28124/en/Evaluating-the-Trump-Administration-s-New-Most-Favored-Nation-MFN-Medicaid-GENEROUS-Model.html",
    "timestamp": "2026-02-23T11:27:00Z"
  },
  {
    "title": "$100 Oil Price Forecasts Resurface Amid U.S.-Iran Standoff",
    "description": "Oil price spikes to $90-$100 per barrel are “within reach” as the United States and Iran appear close to war, Fereidun Fesharaki, Chairman Emeritus at energy market consultancy FGE NexantECA, told Bloomberg Television on Monday. “I don’t think the US has a ch…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/100-Oil-Price-Forecasts-Resurface-Amid-US-Iran-Standoff.html",
    "timestamp": "2026-02-23T11:26:39Z"
  },
  {
    "title": "Ted Sarandos Pushes Back On Trump’s Call For Netflix To Fire Board Member Susan Rice: “He Likes To Do A Lot Of Things On Social Media”",
    "description": "Ted Sarandos attempted to playdown Donald Trump’s fiery request over the weekend for Netflix to fire board member Susan Rice, when questioned on the social media outburst in an interview on the BBC’s Today program on Monday. The Netflix co-CEO was asked about…",
    "link": "http://deadline.com/2026/02/ted-sarandos-trumps-netflix-susan-rice-1236732988/",
    "timestamp": "2026-02-23T11:25:14Z"
  },
  {
    "title": "JPMorgan admits closing accounts linked to Donald Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_37c7e3a1-8d09-4fd6-80cd-b81d11a0efff",
    "timestamp": "2026-02-23T11:21:11Z"
  },
  {
    "title": "India-US trade deal: Why a ‘modify commitments’ clause in framework agreement offers New Delhi wriggle room",
    "description": "As US President Donald Trump says that the bilateral deal is on, this clause could now provide some much-needed space for India to recalibrate tariff and non-tariff concessions from its side.",
    "link": "https://indianexpress.com/article/explained/explained-economics/india-us-trade-deal-modify-commitments-clause-10547517/",
    "timestamp": "2026-02-23T11:16:20Z"
  },
  {
    "title": "Stocks sell off as traders wake up to the realization that Trump has ‘highly punitive’ options for new trade tariffs",
    "description": "Some of the things Trump might do next could be more extreme than his “Liberation Day” tariffs, and will certainly be more complex.",
    "link": "https://finance.yahoo.com/news/stocks-sell-off-traders-wake-111342816.html",
    "timestamp": "2026-02-23T11:13:42Z"
  },
  {
    "title": "US Market | Wall Street futures dip as tariff doubts hit risk appetite",
    "description": "U.S. stock index futures slipped on Monday as renewed ​tariff uncertainty unnerved investors after President Donald Trump announced a new 15% duty despite a Supreme Court ruling that struck down his broader levies.",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-wall-street-futures-dip-as-tariff-doubts-hit-risk-appetite/articleshow/128711181.cms",
    "timestamp": "2026-02-23T11:13:11Z"
  },
  {
    "title": "US Market Today | All eyes on big tech earnings as AI anxiety and tariff turmoil keep investors on edge",
    "description": "Investors brace for a pivotal week, with Nvidia's earnings at the forefront, seeking AI reassurance amid trade policy shifts.  Tech stocks face scrutiny, while energy and industrials offer support.  Global markets, including India's IT sector, keenly await si…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-today-all-eyes-on-big-tech-earnings-as-ai-anxiety-and-tariff-turmoil-keep-investors-on-edge/articleshow/128711069.cms",
    "timestamp": "2026-02-23T11:07:59Z"
  },
  {
    "title": "Kristi Noem Repeatedly Claimed ICE Deported a Cannibal. It Was “Completely Made Up.”",
    "description": "Law enforcement sources told The Intercept that Noem’s tale about a cannibal was a fabrication.\nThe post Kristi Noem Repeatedly Claimed ICE Deported a Cannibal. It Was “Completely Made Up.” appeared first on The Intercept.",
    "link": "https://theintercept.com/2026/02/23/kristi-noem-ice-cannibal/",
    "timestamp": "2026-02-23T11:07:00Z"
  },
  {
    "title": "Why are gold and silver prices rising again and will precious metals continue dream run or fall back sharply? Gold and silver rise, analysts insights and market outlook explained. Here's what should investors do now",
    "description": "Why are gold and silver prices rising again and will precious metals continue dream run or fall back sharply? Gold reached a three-week high after tariff changes, inflation data, and dollar weakness. Silver also gained. Investors shifted to precious metals du…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-are-gold-and-silver-prices-rising-again-and-will-precious-metals-continue-dream-run-or-fall-back-sharply-gold-and-silver-rise-analysts-insights-and-market-outlook-explained-heres-what-should-investors-do-now/articleshow/128710311.cms",
    "timestamp": "2026-02-23T11:05:53Z"
  },
  {
    "title": "India delays trade talks with US after Supreme Court ruling on tariffs – Reuters",
    "description": "The decision has reportedly come after the Supreme Court shut down Donald Trump’s tariffs imposed on various US trading partners Read Full Article at RT.com",
    "link": "https://www.rt.com/india/632925-india-trading-trump-tariffs/",
    "timestamp": "2026-02-23T11:02:19Z"
  },
  {
    "title": "The Payphone That Lets San Franciscans ‘Call a Republican’",
    "description": "Two pay phones, in San Francisco and Abilene, Texas, aimed to connect Americans across political divides.",
    "link": "https://www.kqed.org/news/12074002/the-payphone-that-lets-san-franciscans-call-a-republican",
    "timestamp": "2026-02-23T11:00:41Z"
  },
  {
    "title": "The Real State of the Union: Millions of\nAmericans Are Just Disgusted",
    "description": "This Tuesday night, America will bear witness to Donald Trump’s first State of the Union address of his second term. I know—the mere thought of it rots a little piece of our souls that we’re never getting back. At least you can skip it; I have to watch it. Wh…",
    "link": "https://newrepublic.com/article/206888/trump-state-union-failure-economy",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "James Talarico Puts His Faith in Texas Voters",
    "description": "The Senate candidate believes that Democrats can win in Texas by appealing to higher values. Will a politics “based on love” succeed in the age of Trump? Tad Friend reports on the G.O.P. primary race between John Cornyn and Ken Paxton, and on the primary cont…",
    "link": "https://www.newyorker.com/magazine/2026/03/02/james-talarico-profile",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "Jan Staller, Constructor of Image",
    "description": "The photographer shoots the bolts and beams of building sites. His latest subject? The Gateway tunnel project being targeted by Donald Trump, Nick Paumgarten reports.",
    "link": "https://www.newyorker.com/magazine/2026/03/02/jan-staller-constructor-of-image",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "Did Trump make over 4K wire transfers to Epstein totaling $1B? Claim doesn't add up",
    "description": "U.S. President Donald Trump made 4,725 wire transfers to the late, disgraced financier and convicted sex offender Jeffrey Epstein for a total of $1.1 billion.",
    "link": "https://www.snopes.com//fact-check/trump-money-transfers-epstein/",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "The Supreme Court’s Complicated Takedown of Trump’s Tariffs",
    "description": "The Supreme Court struck down President Donald Trump’s latest tariffs, but the ruling lacks full consensus on its reasoning or implications, Amy Davidson Sorkin writes.",
    "link": "https://www.newyorker.com/news/the-lede/the-supreme-courts-complicated-takedown-of-trumps-tariffs",
    "timestamp": "2026-02-23T11:00:00Z"
  },
  {
    "title": "German business morale sees biggest rise in nearly a year",
    "description": "German business morale posted its biggest rise in almost a year in February, data showed Monday, boosting hopes that Europe's top economy could be emerging from the worst of its slump.",
    "link": "https://www.thelocal.de/20260223/german-business-morale-sees-biggest-rise-in-nearly-a-year",
    "timestamp": "2026-02-23T10:58:34Z"
  },
  {
    "title": "'Staring down the barrel at higher costs': UK businesses face uncertain future over US tariffs",
    "description": "The UK has not ruled out retaliatory tariffs against the US, while the EU has put on hold the ratification of its trade deal with Washington.",
    "link": "https://news.sky.com/story/staring-down-the-barrel-at-higher-costs-uk-businesses-face-uncertain-future-over-us-tariffs-13511105",
    "timestamp": "2026-02-23T10:54:00Z"
  },
  {
    "title": "US tariff shuffle spins Indian exports into a trade puzzle",
    "description": "Indian exporters now face a temporary 10 percent tariff on shipments to the US for the next 150 days. This decision comes in response to a Supreme Court ruling that overturned previous tariff structures. Meanwhile, President Trump has hinted at a possible hik…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/indian-exports-trump-modi-us-tariff-10-percent-trade-uncertainty-footwear-leather-seafood/articleshow/128709979.cms",
    "timestamp": "2026-02-23T10:53:11Z"
  },
  {
    "title": "EU says US must honor a trade deal after court blocks Trump tariffs",
    "description": "The European Union’s executive arm requested “full clarity” from the United States and asked its trade partner to fulfill its commitments after the U.S. Supreme Court struck down some of President Donald Trump’s most sweeping tariffs. Trump has lashed out at …",
    "link": "https://freerepublic.com/focus/f-backroom/4367958/posts",
    "timestamp": "2026-02-23T10:52:28Z"
  },
  {
    "title": "All we know about 21-year-old shot at Donald Trump’s Mar-a-Lago residence",
    "description": "A 21-year-old was shot and killed in a Mar-a-Lago shooting after attempting to breach the perimeter. Here’s everything we know about the incident.\n\nRead More: https://punchng.com/all-we-know-about-21-year-old-shot-at-donald-trumps-mar-a-lago-residence/",
    "link": "https://punchng.com/all-we-know-about-21-year-old-shot-at-donald-trumps-mar-a-lago-residence/",
    "timestamp": "2026-02-23T10:51:57Z"
  },
  {
    "title": "Analysts Examine What Tariff Decision Means for Oil",
    "description": "'The stick is now the same size for everyone', Rystad Chief Economist Claudio Galimberti warned.",
    "link": "https://www.rigzone.com/news/analysts_examine_what_tariff_decision_means_for_oil-23-feb-2026-183043-article/",
    "timestamp": "2026-02-23T10:47:41Z"
  },
  {
    "title": "Gold Rises as Trump Tariff Defeat Throws Trade Deals Into Doubt",
    "description": "President Donald Trump said Saturday he would impose a global tariff of 15% to preserve measures after the Supreme Court ruled against his use of emergency...",
    "link": "https://finance.yahoo.com/news/gold-rises-trump-tariff-defeat-030341452.html",
    "timestamp": "2026-02-23T10:47:31Z"
  },
  {
    "title": "Australia to Get Its First Trump Tower, Will Be Country's Tallest Building",
    "description": "Australia will soon have its first Trump Tower after plans for the $1.5 billion Australian dollar project are set to go ahead, local outlets reported on Monday.\nThe post Australia to Get Its First Trump Tower, Will Be Country’s Tallest Building appeared first…",
    "link": "https://www.breitbart.com/europe/2026/02/23/australia-to-get-its-first-trump-tower-will-be-countrys-tallest-building/",
    "timestamp": "2026-02-23T10:43:22Z"
  },
  {
    "title": "Decoding Section 122: The rarely used law behind Donald Trump’s new 15% global tariffs",
    "description": "President Trump has utilized a decades-old law, Section 122 of the Trade Act of 1974, to impose up to 15% import tariffs. This provision allows for temporary surcharges on goods, bypassing lengthy trade processes. However, these tariffs are subject to a 150-d…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/decoding-section-122-the-rarely-used-law-behind-donald-trumps-new-15-global-tariffs/articleshow/128709631.cms",
    "timestamp": "2026-02-23T10:41:59Z"
  },
  {
    "title": "Indian exports to attract 10% tariff in US for 150 days from Feb 24; uncertainty persists",
    "description": "Following a Supreme Court verdict against his earlier sweeping tariffs last week, Trump on February 21 imposed a 10 per cent tariff on all countries, including India, from February 24 for 150 days",
    "link": "https://www.thehindubusinessline.com/news/indian-exports-to-attract-10-tariff-in-us-for-150-days-from-feb-24-uncertainty-persists/article70666665.ece",
    "timestamp": "2026-02-23T10:41:14Z"
  },
  {
    "title": "How Trump's ICE Built Nationwide Police Alliance Right Under Democrats' Noses",
    "description": "Liberal activists and officials are coming up with ways to thwart the contracts after Trump’s officials gained a foothold for ICE.",
    "link": "https://www.westernjournal.com/trumps-ice-built-nationwide-police-alliance-right-democrats-noses/",
    "timestamp": "2026-02-23T10:41:04Z"
  },
  {
    "title": "China Urges U.S. to Scrap Tariffs After SCOTUS Ruling",
    "description": "China's Commerce Ministry on Monday called for the United States to rescind all tariffs after the U.S. Supreme Court struck down President Donald Trump's emergency tariffs.\nThe post China Urges U.S. to Scrap Tariffs After SCOTUS Ruling appeared first on Breit…",
    "link": "https://www.breitbart.com/asia/2026/02/23/china-urges-u-s-to-scrap-tariffs-after-scotus-ruling/",
    "timestamp": "2026-02-23T10:35:50Z"
  },
  {
    "title": "Top Trump Stooge Has Tantrum After Keystone Kash Busted at Team USA Hockey Bash",
    "description": "President Trump’s top mouthpiece has flipped out over criticism leveled at “Keystone” Kash Patel after the FBI director was busted celebrating with a U.S...",
    "link": "https://www.thedailybeast.com/top-trump-stooge-has-tantrum-after-keystone-kash-busted-at-team-usa-hockey-bash/",
    "timestamp": "2026-02-23T10:28:58Z"
  },
  {
    "title": "The Potomac Interceptor Disaster: Causes and Public Health Impact",
    "description": "The Potomac Interceptor Disaster: Causes and Public Health Impactthefocalpoints.com",
    "link": "https://www.thefocalpoints.com/p/the-potomac-interceptor-disaster",
    "timestamp": "2026-02-23T10:27:20Z"
  },
  {
    "title": "India sees more options on US trade deal after tariff ruling",
    "description": "India is reviewing its trade agreement with the United States. A recent US Supreme Court ruling has impacted tariff decisions. This development provides India an opportunity to re-evaluate its negotiation approach. The nation is not planning to withdraw from …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-sees-more-options-on-us-trade-deal-after-tariff-ruling/articleshow/128709331.cms",
    "timestamp": "2026-02-23T10:21:46Z"
  },
  {
    "title": "Mexico Fears More Violence After Army Kills Leader Of Powerful Jalisco Cartel",
    "description": "President Claudia Sheinbaum urged calm and authorities announced late Sunday they had cleared most of the cartel roadblocks across 20 states.",
    "link": "https://www.huffpost.com/entry/violence-erupts-over-mexico-cartel-leader-killing_n_699c27d4e4b074e2825a5919",
    "timestamp": "2026-02-23T10:17:42Z"
  },
  {
    "title": "Performative Negotiations to Humor Trump",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/us-russia-ukraine-trump-putin-negotiations-four-years-peace-deal/",
    "timestamp": "2026-02-23T10:15:20Z"
  },
  {
    "title": "Trump’s Tariffs Weren’t Really About Trade Policy",
    "description": "They were about his nostalgia, his ego, his bigotry, and his greed.\nThe post Trump’s Tariffs Weren’t Really About Trade Policy appeared first on The American Prospect.",
    "link": "http://prospect.org/2026/02/23/trump-tariffs-trade-policy-supreme-court/",
    "timestamp": "2026-02-23T10:15:00Z"
  },
  {
    "title": "\"Khamenei and These [Islamic].Nazis\": Trump Reposts Combative Speech Signaling Hardline Stance on Iran",
    "description": "President Trump amplifies a message calling for the elimination of the Iranian regime. Following a foiled Mar-a-Lago plot, the President signals a \"deal\" is off the table, citing Iran’s history of nuclear violations. U.S. President Donald Trump sparked intens…",
    "link": "https://freerepublic.com/focus/f-news/4367955/posts",
    "timestamp": "2026-02-23T10:13:10Z"
  },
  {
    "title": "S’pore retains lowest tariff edge in Asia even after US court ruling narrows the gap",
    "description": "Trade-oriented economies like Singapore will be supported by any pick-up in trade activity on lower tariffs.  Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/spore-retains-lowest-tariff-edge-in-asia-even-after-us-court-ruling-narrows-the-gap",
    "timestamp": "2026-02-23T10:11:48Z"
  },
  {
    "title": "India Sees More Options on US Trade Deal After Tariff Ruling",
    "description": "The US Supreme Court decision to strike down President Donald Trump’s emergency tariffs gives India more scope in negotiations over a trade deal, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/india-sees-more-options-on-us-trade-deal-after-tariff-ruling",
    "timestamp": "2026-02-23T10:09:47Z"
  },
  {
    "title": "Tariffs and prices: The Supreme Court just gave Trump an off ramp. He’s not taking it",
    "description": "President Donald Trump’s unprecedented use of tariffs has injected enormous uncertainty into the global economy, depressing US job growth and raising prices along the way.",
    "link": "https://www.cnn.com/2026/02/23/business/tariffs-prices-trump",
    "timestamp": "2026-02-23T10:09:25Z"
  },
  {
    "title": "Australia’s first Trump Tower planned for Gold Coast, set to be tallest in the country",
    "description": "The six-star hotel and residential tower will feature 285 hotel rooms, 272 residences and retail and dining space.",
    "link": "https://7news.com.au/news/australias-first-trump-tower-planned-for-gold-coast-set-to-be-tallest-in-the-country--c-21731062",
    "timestamp": "2026-02-23T10:07:54Z"
  },
  {
    "title": "Putin vows to bolster Russia’s nuclear triad",
    "description": "Developing the nuclear arsenal remains one of Russia’s absolute priorities, President Vladimir Putin has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/632923-putin-bolster-russia-nuclear-weapons/",
    "timestamp": "2026-02-23T10:07:31Z"
  },
  {
    "title": "How Putin Sold a False Win in Ukraine to Trump",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/trump-putin-russia-ukraine-war-casualties-cost-territory-gains-negotiations-peace-deal/",
    "timestamp": "2026-02-23T10:07:24Z"
  },
  {
    "title": "From dabblers to day traders, small investors' impact on Wall Street grows even in volatile market",
    "description": "For years, retail investors were dismissed by some on Wall Street as “dumb money.”",
    "link": "https://abcnews.com/Business/wireStory/dabblers-day-traders-small-investors-impact-wall-street-130401427",
    "timestamp": "2026-02-23T10:05:27Z"
  },
  {
    "title": "Four Years on, Europe Is Taking Over",
    "description": "Eight thinkers on four years of Russia’s war against Ukraine.",
    "link": "http://foreignpolicy.com/2026/02/23/russia-europe-war-ukraine-nato-military-aid-defense-security-eu/",
    "timestamp": "2026-02-23T10:02:39Z"
  },
  {
    "title": "Trump eyes Section 301 probes as tariff backup: What it means for global trade and why it matters",
    "description": "America's trade chief signals new investigations under Section 301. This law allows action against unfair foreign trade practices. Probes could cover industrial policies, drug pricing, digital trade, and ocean pollution. Such moves could lead to new tariffs o…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-eyes-section-301-probes-as-tariff-backup-what-it-means-for-global-trade-and-why-it-matters-explainer-points/articleshow/128706706.cms",
    "timestamp": "2026-02-23T10:01:13Z"
  },
  {
    "title": "SEN ELIZABETH WARREN: President Trump's broken promise on credit cards",
    "description": "President Trump could lower costs quickly if he would follow through on his campaign promise to put a 10% cap on credit card interest rates.",
    "link": "https://www.foxnews.com/opinion/sen-elizabeth-warren-president-trumps-broken-promise-credit-cards",
    "timestamp": "2026-02-23T10:00:54Z"
  }
]