[
  {
    "title": "Donald Trump's Travel Ban: Exceptions Travellers Need to Know",
    "description": "Newsweek has broken down which categories of people are exempt from Donald Trump's new travel ban.",
    "link": "https://www.newsweek.com/donald-trump-travel-ban-exceptions-2081231",
    "timestamp": "2025-06-05T08:55:56Z"
  },
  {
    "title": "Ex-Trump Aide Spells Out How Elon Musk Could Gain Ultimate Revenge On The President",
    "description": "It is \"kind of devastating\" for Donald Trump's administration, said Alyssa Farah Griffin.",
    "link": "https://www.huffpost.com/entry/alyssa-farah-griffin-elon-musk-revenge-trump_n_68414fb1e4b04981b63b1012",
    "timestamp": "2025-06-05T08:55:19Z"
  },
  {
    "title": "Fact check: Will ‘big beautiful bill’ really allow Trump to delay election?",
    "description": "No, the US president would not be able to delay or cancel elections if his tax-and-spending bill becomes law.",
    "link": "https://www.aljazeera.com/news/2025/6/5/fact-check-will-big-beautiful-bill-really-allow-trump-to-delay-election",
    "timestamp": "2025-06-05T08:55:14Z"
  },
  {
    "title": "“You can’t fight a war without American steel”: US declares economic war on Canada, the ally that armed it in WWII with steel",
    "description": "America has increased tariffs on steel and aluminum from Canada. This move has upset Canadian producers. It has also raised worries about North American supply chains. The US Commerce Secretary defends the tariffs citing national security. A senator questions…",
    "link": "https://economictimes.indiatimes.com/news/international/us/you-cant-fight-a-war-without-american-steel-us-declares-economic-war-on-canada-the-ally-that-armed-it-in-wwii-with-steel/articleshow/121644776.cms",
    "timestamp": "2025-06-05T08:54:15Z"
  },
  {
    "title": "Illinois Dems Lay Budget Woes At Trump’s Feet After Taxing Their Citizens Into Ground",
    "description": "By Melissa O'Rourke, Daily Caller News Foundation | June 02, 2025\nDemocrats hold a supermajority in Illinois, but Democrat Gov. J.B. Pritzker is blaming President Donald Trump for the state’s latest budget woes, according to the Chicago Tribune.\nOn Saturday, …",
    "link": "https://biztoc.com/x/0cb2f76aeee314f8",
    "timestamp": "2025-06-05T08:53:11Z"
  },
  {
    "title": "Trump tariffs would cut deficits by $2.8 trillion over 10 years—while shrinking the economy and raising inflation, CBO says",
    "description": "President Donald Trump’s sweeping tariff plan would cut deficits by $2.8 trillion over a 10-year period while shrinking the economy, raising the inflation rate and reducing the purchasing power of households overall, according to an analysis released Wednesda…",
    "link": "https://biztoc.com/x/90ec47ef27cac6cf",
    "timestamp": "2025-06-05T08:52:58Z"
  },
  {
    "title": "Donald Trump’s advisor Bo Hines meets Nayib Bukele as US eyes El Salvador’s Bitcoin strategy",
    "description": "Bo Hines, who leads President Donald Trump’s advisory council on digital assets, recently met with El Salvador’s President Nayib Bukele to discuss potential partnerships in the crypto space. In a post shared on June 5, Hines revealed that the meeting centered…",
    "link": "https://cryptoslate.com/donald-trumps-advisor-bo-hines-meets-nayib-bukele-as-us-eyes-el-salvadors-bitcoin-strategy/",
    "timestamp": "2025-06-05T08:52:54Z"
  },
  {
    "title": "If you come at Donald Trump, he's going to respond. Unless, apparently, you're Elon Musk. - Business Insider",
    "description": "If you come at Donald Trump, he's going to respond. Unless, apparently, you're Elon Musk.Business Insider Scoop: Four reasons Musk attacked Trump's \"big beautiful bill\"Axios Stephen Colbert Wonders if Elon Musk’s Ketamine Has Worn OffThe New York Times Musk w…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177933918",
    "timestamp": "2025-06-05T08:52:38Z"
  },
  {
    "title": "Trump's F-47 Could Become Sitting Ducks for China",
    "description": "\"We are in a new era of asset vulnerability,\" said John Hemmings, the Council on Geostrategy's deputy director for geopolitics.",
    "link": "https://www.newsweek.com/trump-f47-fighter-jets-indo-pacific-china-missiles-pete-hegseth-2080850",
    "timestamp": "2025-06-05T08:52:12Z"
  },
  {
    "title": "Britain to invest billions in defense spending following escalating fears, threats of World War III",
    "description": "Britain will build at least six new munitions plants, procure up to 7,000 British-made long-range weapons, and launch new communication systems for the battlefield.",
    "link": "https://www.jpost.com/international/article-856680",
    "timestamp": "2025-06-05T08:49:45Z"
  },
  {
    "title": "Why this Holocaust survivors son thanks President Trump",
    "description": "My Holocaust survivor roots taught me to sense danger early. On October 7, that sense returned",
    "link": "https://www.jpost.com/opinion/article-856672",
    "timestamp": "2025-06-05T08:48:40Z"
  },
  {
    "title": "NATO’s defence spending obsession eclipses other strategic discussions",
    "description": "Negotiations over raising NATO spending targets and eagerness to avoid clashes with Trump have crowded out other debates at the alliance.",
    "link": "https://www.euractiv.com/section/defence/news/natos-defence-spending-obsession-eclipses-other-strategic-discussions/",
    "timestamp": "2025-06-05T08:45:11Z"
  },
  {
    "title": "How 3 years of war have ravaged Ukraine’s forests, and the people who depend on them",
    "description": "Nearly 5 million acres have burned since Russia’s latest invasion in 2022, ignited by rocket fire, artillery shelling, and explosive devices.",
    "link": "http://grist.org/international/how-three-years-of-war-have-ravaged-ukraines-forests-and-the-people-who-depend-on-them/",
    "timestamp": "2025-06-05T08:45:00Z"
  },
  {
    "title": "What is Trump’s new travel ban, and which countries are affected?",
    "description": "Trump announces a new sweeping travel ban that targets citizens from more than a dozen countries",
    "link": "https://www.irishtimes.com/world/us/2025/06/05/what-is-trumps-new-travel-ban-and-which-countries-are-affected/",
    "timestamp": "2025-06-05T08:43:02Z"
  },
  {
    "title": "Trump directs administration to investigate Biden’s actions as president, alleging aides masked his ‘cognitive decline’",
    "description": "President Donald Trump on Wednesday directed his administration to investigate Joe Biden’s actions as president, alleging aides masked his predecessor’s “cognitive decline” and casting doubts on the legitimacy of his use of the autopen to sign pardons and oth…",
    "link": "https://biztoc.com/x/b1344b8fe827d6fc",
    "timestamp": "2025-06-05T08:41:57Z"
  },
  {
    "title": "Trump moves to block nearly all foreign students from entering the country to attend Harvard",
    "description": "President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body.\nIn …",
    "link": "https://biztoc.com/x/2f907f24eb076047",
    "timestamp": "2025-06-05T08:41:56Z"
  },
  {
    "title": "Germany's Merz heads for delicate talks with Trump",
    "description": "German Chancellor Friedrich Merz is set to meet with US President Donald Trump on Thursday, hoping to build a personal relationship despite discord over Ukraine and the threat of a trade war. On the Ukraine war, where Germany strongly backs Kyiv, Merz will ho…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/germanys-merz-heads-for-delicate-talks-with-trump/articleshow/121644462.cms",
    "timestamp": "2025-06-05T08:41:35Z"
  },
  {
    "title": "Harvard battle is Trump’s ‘Mao moment’: lessons from China’s state-sanctioned university crackdown",
    "description": "US universities are the envy of the world, but Trump’s Harvard confrontation threatens their dominance.",
    "link": "https://theconversation.com/harvard-battle-is-trumps-mao-moment-lessons-from-chinas-state-sanctioned-university-crackdown-258127",
    "timestamp": "2025-06-05T08:40:34Z"
  },
  {
    "title": "David Jolly, a Trump critic and former GOP congressman, to run for Florida governor as a Democrat",
    "description": "US News: TALLAHASSEE: A former Republican congressman and vocal critic of Donald Trump says he wants to become governor in the president's adopted home state o.",
    "link": "https://timesofindia.indiatimes.com/world/us/david-jolly-a-trump-critic-and-former-gop-congressman-to-run-for-florida-governor-as-a-democrat/articleshow/121644165.cms",
    "timestamp": "2025-06-05T08:40:10Z"
  },
  {
    "title": "US presses NATO to agree defence spending hike",
    "description": "Defense Secretary Pete Hegseth has said he thinks that the committment to the increased budget will happen this month.",
    "link": "https://www.aljazeera.com/news/2025/6/5/us-presses-nato-to-agree-defence-spending-hike",
    "timestamp": "2025-06-05T08:39:44Z"
  },
  {
    "title": "Critical flaw in Cisco ISE impacts cloud deployments on AWS, Microsoft Azure, and Oracle Cloud Infrastructure",
    "description": "Cisco fixed a critical flaw in the Identity Services Engine (ISE) that could allow unauthenticated attackers to conduct malicious actions. A vulnerability tracked as CVE-2025-20286 (CVSS score 9.9) in cloud deployments of Cisco ISE on AWS, Microsoft Azure, an…",
    "link": "https://securityaffairs.com/178659/uncategorized/critical-flaw-in-cisco-ise-impacts-cloud-deployments-on-aws-microsoft-azure-and-oracle-cloud-infrastructure.html",
    "timestamp": "2025-06-05T08:31:27Z"
  },
  {
    "title": "Trump said while campaigning he’d give green cards to all foreign college students who graduated in the U.S",
    "description": "To attract the brightest minds to America, President Donald Trump proposed a novel idea while campaigning: If elected, he would grant green cards to all foreign students who graduate from U.S. colleges.\n“It’s so sad when we lose people from Harvard, MIT, from…",
    "link": "https://biztoc.com/x/66b1f0a8a02ad421",
    "timestamp": "2025-06-05T08:30:51Z"
  },
  {
    "title": "Jeffrey Epstein Video Release: What Footage Shows of His Death",
    "description": "FBI Deputy Director Dan Bongino said video footage will prove Epstein took his own life, refuting theories that the disgraced financier may have been killed.",
    "link": "https://www.newsweek.com/jeffrey-epstein-video-release-video-death-2081227",
    "timestamp": "2025-06-05T08:28:40Z"
  },
  {
    "title": "Why rare earths are the new battleground in US-China trade war",
    "description": "China Rare Earths Policy: Two months after China enforced strict export controls on key rare earth elements, manufacturing industries across the United States, Europe, and India face mounting disruptions. These elements are vital to defence, electronics, and …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chinas-new-rare-earth-policy-rare-earth-magnet-export-why-rare-earths-are-the-new-battleground-in-us-china-trade-war/articleshow/121642918.cms",
    "timestamp": "2025-06-05T08:25:03Z"
  },
  {
    "title": "Trump Orders Investigation Into Biden’s Actions—What To Know About Autopen Claims",
    "description": "Since taking office, Trump has repeatedly suggested without evidence that Biden’s aides used an autopen to put his signature on presidential orders without his knowledge.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/06/05/trump-orders-investigation-into-bidens-actions-what-to-know-about-autopen-claims/",
    "timestamp": "2025-06-05T08:21:59Z"
  },
  {
    "title": "ICE Hits New Migrant Arrest Record In Single Day: What To Know",
    "description": "Immigration and Customs Enforcement hit a new milestone this week, arresting more than 2,200 undocumented migrants in a single day, according to reports.",
    "link": "https://www.newsweek.com/ice-hits-new-migrant-arrest-record-milestone-2200-single-day-2081206",
    "timestamp": "2025-06-05T08:16:49Z"
  },
  {
    "title": "White House Killed NASA Role to Punish Elon Musk, Isaacman Suggests",
    "description": "Would-be NASA administrator Jared Isaacman reveals \"exactly how it went.\"",
    "link": "https://www.newsweek.com/white-house-killed-nasa-punish-elon-musk-podcast-jared-isaacman-2081214",
    "timestamp": "2025-06-05T08:10:15Z"
  },
  {
    "title": "Stephen Colbert Exposes Elon Musk's Most Glaring Trump Hypocrisy",
    "description": "The \"Late Show\" host won't let the billionaire wiggle out of this one.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-elon-musk-trump-hypocrisy_n_68413dc6e4b00b2e94c5bb28",
    "timestamp": "2025-06-05T08:09:46Z"
  },
  {
    "title": "Donald Trump's Travel Ban Surprisingly Omits One Country",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has reinstated and expanded a travel ban targeting citizens from 12 countries, citing national security concerns following a recent terror attack in Boulder, Colorado. The National Irani…",
    "link": "https://biztoc.com/x/03440c3ee7fa75e0",
    "timestamp": "2025-06-05T08:09:07Z"
  },
  {
    "title": "China Reacts to Trump's Steel Tariffs Hike",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nChina accused President Donald Trump of causing severe disruption to global supply chains after he doubled the U.S. steel and aluminum tariffs to 50 percent.\nTrump hiked the Section 232 tariffs in a proclamati…",
    "link": "https://biztoc.com/x/7028c8f4d1f0a2ca",
    "timestamp": "2025-06-05T08:09:02Z"
  },
  {
    "title": "Bryson DeChambeau admired by President Trump's golf game",
    "description": "LIV Golf is back in the USA, playing near the nation's capital at the Robert Trent Jones Golf Club. The HyFlyers GC team talked about the growth of the international league.",
    "link": "https://www.foxnews.com/sports/bryson-dechambeau-admired-president-trumps-golf-game",
    "timestamp": "2025-06-05T08:08:53Z"
  },
  {
    "title": "How Trump Administration Can Tackle America's Addiction Problems: Experts",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has long been adamant about fixing what he described as America's \"opioid crisis,\" something which was a key focus of his first term as president as well as his second.\nThe opioid crisis…",
    "link": "https://biztoc.com/x/e3e2d6303eccb409",
    "timestamp": "2025-06-05T08:08:29Z"
  },
  {
    "title": "Samoa implements new plan to sustainably manage its ocean by 2030",
    "description": "To help protect its future, the Samoan government announced June 3 that it has enacted a law establishing a marine spatial plan to sustainably manage 100% of its ocean by 2030.",
    "link": "https://www.resilience.org/stories/2025-06-05/samoa-implements-new-plan-to-sustainably-manage-its-ocean-by-2030/",
    "timestamp": "2025-06-05T08:08:18Z"
  },
  {
    "title": "Wes Anderson names actor he’s tried and failed to cast the most: ‘It used to be every movie’",
    "description": "Filmmaker says he once tried to secure the Oscar-winner ‘three movies in a row’",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/wes-anderson-jodie-foster-casting-films-b2764081.html",
    "timestamp": "2025-06-05T08:02:55Z"
  },
  {
    "title": "Donald Trump's Travel Ban Surprisingly Omits One Country",
    "description": "The U.S. president has announced restrictions on citizens from 12 countries in response to the terror attack in Boulder, Colorado.",
    "link": "https://www.newsweek.com/trump-immigration-ban-egypt-2081193",
    "timestamp": "2025-06-05T08:01:55Z"
  },
  {
    "title": "China Reacts to Trump's Steel Tariffs Hike",
    "description": "President Donald Trump doubled steel and aluminum tariffs over national security concerns.",
    "link": "https://www.newsweek.com/china-reacts-trump-steel-aluminum-tariffs-hike-2081228",
    "timestamp": "2025-06-05T08:01:19Z"
  },
  {
    "title": "Like China, a Mexico Tariffs Own Goal: US Dependence on Mexico Energy Trade Means “Those Tariffs Never Stood a Chance”?",
    "description": "More evidence of Trump cluelessness in his Mexico and China tariffs bobs and weaves.",
    "link": "https://www.nakedcapitalism.com/2025/06/like-china-a-mexico-tariffs-own-goal-us-dependence-on-mexico-energy-trade-means-those-tariffs-never-stood-a-chance.html",
    "timestamp": "2025-06-05T08:00:52Z"
  },
  {
    "title": "Ex- GOP Congressman David Jolly Announces Run For Florida Governor, As A Dem",
    "description": "Given the lack of Democrats with statewide name recognition, he could well cruise to the nomination unchallenged by a serious opponent.",
    "link": "https://www.huffpost.com/entry/david-jolly-florida-governor_n_6840ac83e4b0280f7518680a",
    "timestamp": "2025-06-05T08:00:25Z"
  },
  {
    "title": "Trump's 'big, beautiful' tax reform bill could cost Canadians billions",
    "description": "A small, obscure section in U.S. President Donald Trump's One Big Beautiful Bill Act could cost Canadians and Canadian companies billions of dollars, CBC News has learned. It could also put pressure on Prime Minister Mark Carney to scrap Canada's digital serv…",
    "link": "https://www.cbc.ca/news/politics/trump-tax-reform-canada-1.7552653",
    "timestamp": "2025-06-05T08:00:10Z"
  },
  {
    "title": "How Trump Administration Can Tackle America's Addiction Problems: Experts",
    "description": "The \"opioid crisis\" claimed the lives of over 80,000 Americans last year, and that figure was a 27 percent drop on the drug overdose death toll in 2023.",
    "link": "https://www.newsweek.com/how-trump-administration-can-tackle-americas-addiction-problems-2080167",
    "timestamp": "2025-06-05T08:00:01Z"
  },
  {
    "title": "Former Republican congressman-turned-Democrat launches bid for governor in push to flip red-state Florida",
    "description": "Democrats face an uphill battle in Florida's 2026 gubernatorial election as former Republican congressman David Jolly joins the race with a focus on the affordability crisis.",
    "link": "https://www.foxnews.com/politics/former-republican-congressman-turned-democrat-launches-bid-governor",
    "timestamp": "2025-06-05T08:00:01Z"
  },
  {
    "title": "The FIFA World Cup is heading to Trump's U.S. Will the world want to come — or even be able to?",
    "description": "FIFA President Gianni Infantino has promised that international fans will be welcome at the World Cup. But Trump's immigration stance has raised questions about potential challenges for the numerous international fans expected to travel to the U.S.",
    "link": "https://www.cbc.ca/news/world/world-cup-trump-1.7549793",
    "timestamp": "2025-06-05T08:00:00Z"
  },
  {
    "title": "Hamilton steelworkers hang onto jobs for now but brace for impact as U.S. doubles industry tariffs",
    "description": "As the U.S. increases tariffs on steel to 50 per cent, workers and industry leaders in Hamilton predict pain and warn of the damage uncertainty does to the local economy.",
    "link": "https://www.cbc.ca/news/canada/hamilton/hamilton-reacts-to-50-per-cent-steel-tariffs-1.7552471",
    "timestamp": "2025-06-05T08:00:00Z"
  },
  {
    "title": "Former Republican David Jolly launches longshot bid for Florida governor as a Democrat",
    "description": "Democrats face a huge uphill climb in 2026 to retake Florida’s governorship for the first time in more than two decades, but David Jolly says he is up to the challenge.",
    "link": "https://www.nbcnews.com/politics/2026-election/former-republican-david-jolly-launches-long-shot-bid-florida-governor-rcna211069",
    "timestamp": "2025-06-05T08:00:00Z"
  },
  {
    "title": "Bank of Canada must get comfortable with the unknown as long as Trump is in charge",
    "description": "The Bank of Canada is waiting for more information from the U.S. on the trade landscape before moving on interest rates. What if it never comes?",
    "link": "https://www.cbc.ca/news/business/armstrong-bank-of-canada-interest-rates-1.7552374",
    "timestamp": "2025-06-05T08:00:00Z"
  },
  {
    "title": "Trump travel ban: Why did he spare Pakistan?",
    "description": "Donald Trump's administration imposed a travel ban on 12 countries, excluding Pakistan. This is a shift from his earlier stance. Previously, Trump criticized Pakistan for harboring terrorists and cut aid. Now, he praises Pakistan and offered to mediate in Kas…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-travel-ban-on-countries-why-did-donald-trump-spare-pakistan-whom-he-accused-of-hiding-osama-bin-laden-and-is-known-for-housing-terrorists/articleshow/121642978.cms",
    "timestamp": "2025-06-05T07:57:59Z"
  },
  {
    "title": "Trump Says Putin Could Help in Iran Nuclear Negotiations",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump said Russian President Vladimir Putin is willing to join talks on Iran's nuclear program and may help bring the negotiations to a close. In a Truth Social post on Wednesday, Trump descri…",
    "link": "https://biztoc.com/x/67e7ff3ae3f56d8b",
    "timestamp": "2025-06-05T07:57:44Z"
  },
  {
    "title": "'You Wussed Out': David Mamet Reveals Trump's 20-Minute Call After He Committed A MAGA Sin",
    "description": "The Pulitzer Prize-winning screenwriter dared not to go full MAGA on Bill Maher's TV show and received a lengthy call from Trump as a consequence.",
    "link": "https://www.huffpost.com/entry/david-mamet-donald-trump-call_n_68414321e4b04981b63b05ce",
    "timestamp": "2025-06-05T07:52:56Z"
  },
  {
    "title": "Trump Says Putin Could Help in Iran Nuclear Negotiations",
    "description": "Following a lengthy call, Trump said Putin could help bring Iran to a nuclear agreement and warned Tehran's delay must end soon.",
    "link": "https://www.newsweek.com/donald-trump-vladimir-putin-iran-nuclear-deal-2081202",
    "timestamp": "2025-06-05T07:51:54Z"
  },
  {
    "title": "How Democrats Could Woo Elon Musk Back: Fired Trump Aide",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDemocrats could persuade Elon Musk to support their cause by persuading him that most of his customers are Democrats, Anthony Scaramucci has suggested.\nSpeaking on his podcast The Rest is Politics US, Scaramuc…",
    "link": "https://biztoc.com/x/1a21bb411578ccfd",
    "timestamp": "2025-06-05T07:47:06Z"
  },
  {
    "title": "Trump Suspends Entry Of Foreign Students To Harvard For Six Months, Citing National Security —University Calls Move 'Illegal Retaliatory Step'",
    "description": "President Donald Trump has suspended the entry of foreign nationals seeking to study at Harvard University for an initial six months, escalating an ongoing federal dispute with the Cambridge-based institution. \nWhat Happened: Trump’s proclamation cited nation…",
    "link": "https://biztoc.com/x/7f895e6fadeb7866",
    "timestamp": "2025-06-05T07:46:59Z"
  },
  {
    "title": "How Democrats Could Woo Elon Musk Back: Fired Trump Aide",
    "description": "Speaking on a podcast, Anthony Scaramucci and Stephanie Ruhle discussed the Tesla CEO's potential political future.",
    "link": "https://www.newsweek.com/democrats-woo-elon-musk-back-podcast-fired-trump-aide-scaramucci-2081213",
    "timestamp": "2025-06-05T07:46:00Z"
  },
  {
    "title": "Trump Blocks New Foreign Student Visas for Harvard U.",
    "description": "President Donald Trump used his authority over the nation's borders Wednesday to deny F-1 education visas to foreigners seeking places at Harvard University.\nThe post Trump Blocks New Foreign Student Visas for Harvard U. appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/06/05/trump-blocks-new-foreign-student-visas-for-harvard-u/",
    "timestamp": "2025-06-05T07:44:12Z"
  },
  {
    "title": "Shein and Temu see U.S. demand plunge on ‘de minimis’ trade loophole closure",
    "description": "Use of low-cost e-commerce giants Temu and Shein has slowed significantly in the key U.S. market amid President Donald Trump’s tariffs on Chinese imports and the closure of the de minimis loophole, new data shows.",
    "link": "https://www.nbcnews.com/world/asia/shein-temu-see-us-demand-plunge-de-minimis-trade-loophole-closure-rcna211113",
    "timestamp": "2025-06-05T07:39:51Z"
  },
  {
    "title": "NATO allies cannot rely on America for their defense, warns US defense chief",
    "description": "\"It's deterrence and peace through strength, but it cannot be reliance,\" U.S. Defense Secretary Pete Hegseth says.",
    "link": "https://www.politico.eu/article/nato-allies-cannot-rely-on-us-for-their-defense-warns-us-defense-secretary/",
    "timestamp": "2025-06-05T07:39:43Z"
  },
  {
    "title": "Trump views Zelensky as ‘bad guy’ – NYT",
    "description": "The US president believes that the Ukrainian leader “is edging the world to the precipice of nuclear war,” the report says Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618671-trump-views-zelensky-bad-guy/",
    "timestamp": "2025-06-05T07:36:01Z"
  },
  {
    "title": "Lucas: Healey’s challengers don’t have easy road ahead",
    "description": "Democratic Gov. Maura Healey is going to be tough to beat in 2026 no matter what the early polls say.",
    "link": "https://www.bostonherald.com/2025/06/05/lucas-healeys-challengers-dont-have-easy-road-ahead/",
    "timestamp": "2025-06-05T07:34:58Z"
  },
  {
    "title": "Pentagon chief Pete Hegseth confident NATO will commit to Trump's defence spending target",
    "description": "NATO countries are in talks about raising their defence budgets. US wants members to spend 5% of their GDP on defence. The goal is to strengthen the alliance. Mark Rutte suggests a 3.5% defence spend and 1.5% on security. New targets for troops and weapons ar…",
    "link": "https://economictimes.indiatimes.com/news/defence/pentagon-chief-pete-hegseth-confident-nato-will-commit-to-trumps-defence-spending-target/articleshow/121642735.cms",
    "timestamp": "2025-06-05T07:34:27Z"
  },
  {
    "title": "How the fragile US-China trade truce is unraveling",
    "description": "Donald Trump has accused Beijing of breaching last month's deal to cut steep tit-for-tat tariffs. Could a much-awaited call between the US and Chinese presidents break the deadlock?",
    "link": "https://www.dw.com/en/how-the-fragile-us-china-trade-truce-is-unraveling/a-72755224",
    "timestamp": "2025-06-05T07:32:00Z"
  },
  {
    "title": "Hamas rejects any deal lacking guarantees to end Israel's aggression",
    "description": "The Palestinian resistance movement Hamas says it will not agree to any ceasefire deal that does not guarantee a complete halt to Israel's military offensive in the besieged Gaza Strip.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250604-presstv03.htm",
    "timestamp": "2025-06-05T07:31:36Z"
  },
  {
    "title": "Trump Revives Travel Ban, Placing Restrictions On 12 Countries Beginning Next Week",
    "description": "US President Donald Trump on June 4 signed a proclamation resurrecting the travel ban from his first term, ordering a new ban on citizens of 12 countries, including Afghanistan and Iran, from entering the United States.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/06/mil-250605-rferl01.htm",
    "timestamp": "2025-06-05T07:31:15Z"
  },
  {
    "title": "Notes from History for Surviving the Trade War",
    "description": "The trade war isn’t coming. It’s already here.Alarming as the daily news may be, this is not the first time nations have clashed over trade. In the 20th and 21st centuries, there have been many moments of conflict over tariffs and dire warnings of imminent tr…",
    "link": "https://warontherocks.com/2025/06/notes-from-history-for-surviving-the-trade-war/",
    "timestamp": "2025-06-05T07:30:33Z"
  },
  {
    "title": "What a weakening dollar means for Trump - and the UK",
    "description": "The weakening of the US dollar has arguably been the story of the year for financial markets.",
    "link": "https://news.sky.com/story/trade-war-what-a-weakening-dollar-means-for-trump-and-the-uk-13379435",
    "timestamp": "2025-06-05T07:25:00Z"
  },
  {
    "title": "Japan to propose cooperation on rare earths in US tariff talks, Nikkei reports",
    "description": "Japan is planning to propose strengthening cooperation with the United States on rare earth supply chains in upcoming tariff talks, with recent export...",
    "link": "https://ca.finance.yahoo.com/news/japan-propose-cooperation-rare-earths-072259220.html",
    "timestamp": "2025-06-05T07:22:59Z"
  },
  {
    "title": "Politique commerciale, guerre en Ukraine et au Proche-Orient... Le nouveau chancelier allemand à Washington pour aborder les dossiers internationaux",
    "description": "Friedrich Merz rencontre Donald Trump jeudi à Washington.",
    "link": "https://www.franceinfo.fr/monde/europe/allemagne/politique-commerciale-guerre-en-ukraine-et-au-proche-orient-le-nouveau-chancelier-allemand-a-washington-pour-aborder-les-dossiers-internationaux_7293237.html",
    "timestamp": "2025-06-05T07:20:53Z"
  },
  {
    "title": "Iran's Leader: US cannot do a damn thing on nuclear issue",
    "description": "Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei says uranium enrichment is the key to Iran's nuclear issue, dismissing US proposals for Tehran to ultimately stop all enrichment in the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250604-presstv02.htm",
    "timestamp": "2025-06-05T07:18:50Z"
  },
  {
    "title": "Khamenei Says Iran Will Not Bow To US Pressure Over Uranium Enrichment",
    "description": "Iranian Supreme Leader Ayatollah Ali Khamenei has rejected a US proposal on Iran's nuclear program that demands giving up uranium enrichment, saying it is a crucial part of the country's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250604-rferl01.htm",
    "timestamp": "2025-06-05T07:18:10Z"
  },
  {
    "title": "What you need to know about Trump's travel ban",
    "description": "Donald Trump has banned people from 12 countries entering the US, in a move he said protects against \"foreign terrorists\" and other security threats.",
    "link": "https://news.sky.com/story/what-you-need-to-know-about-trumps-travel-ban-13379431",
    "timestamp": "2025-06-05T07:16:00Z"
  },
  {
    "title": "Will South Korea's new president restart dialogue with North Korea?",
    "description": "South Korea has elected a new president - liberal opposition candidate Lee Jae-myung - which represents a change in political direction for the country after the ouster of his conservative predecessor.",
    "link": "https://www.globalsecurity.org/wmd/library/news/rok/2025/rok-250604-rfa01.htm",
    "timestamp": "2025-06-05T07:14:21Z"
  },
  {
    "title": "Late-Night Hosts Take Aim at Trump’s Feud With Musk: ‘Blew Up Faster Than a SpaceX Rocket’",
    "description": "\"I'm starting to worry that two narcissistic megalomaniacs with a total inability to see value in other humans might have a hard time making friends,\" Stephen Colbert noted",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/late-night-hosts-donald-trump-elon-musk-feud-1235356048/",
    "timestamp": "2025-06-05T07:13:28Z"
  },
  {
    "title": "Putin-Trump Phone Call Lasted 70 Minutes - Kremlin Aide",
    "description": "The conversation between Russian President Vladimir Putin and US President Donald Trump lasted 70 minutes, Kremlin aide Yuri Ushakov said on Wednesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/06/russia-250604-sputnik01.htm",
    "timestamp": "2025-06-05T07:09:37Z"
  },
  {
    "title": "Why did Trump exclude terror-hub Pakistan from travel ban: Brahma Chellaney hints at US' Deep State's anti-India stance",
    "description": "Geostrategist Brahma Chellaney has criticised Donald Trump’s latest travel ban for excluding Pakistan, a known terror hub, while targeting countries like Myanmar where the US reportedly supports rebels. Chellaney argues the decision reflects a US “Deep State”…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-did-trump-exclude-terror-hub-pakistan-from-travel-ban-brahma-chellaney-hints-at-us-deep-states-anti-india-stance/articleshow/121641551.cms",
    "timestamp": "2025-06-05T07:09:20Z"
  },
  {
    "title": "Critics Cackle Over Mike Johnson's Awkward Confession About Elon Musk Phone Call",
    "description": "The top Donald Trump ally's admission turned into an instant punchline on social media.",
    "link": "https://www.huffpost.com/entry/mike-johnson-elon-musk-admission_n_684135d5e4b04981b63af935",
    "timestamp": "2025-06-05T07:04:39Z"
  },
  {
    "title": "Zelenskyy Calls On Putin To Sign Cease-Fire, Meet Him 'Any Day'",
    "description": "Ukrainian President Volodymyr Zelenskyy has challenged his Russian counterpart, Vladimir Putin, to sign a cease-fire to end fighting as the two sides work to set up a meeting to create a lasting peace after more than three years of war sparked by Moscow's ful…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250604-rferl02.htm",
    "timestamp": "2025-06-05T07:03:42Z"
  },
  {
    "title": "Putin 'Strongly' Warns Trump Of Response To Ukraine's Drone Strikes On Russia's Air Bases",
    "description": "US President Donald Trump says his Russian counterpart, Vladimir Putin, warned him \"very strongly\" of Russia's intention to respond to Ukraine's drone attack, which struck dozens of long-range bomber aircraft across Russian regions over the weekend.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250605-rferl01.htm",
    "timestamp": "2025-06-05T07:03:19Z"
  },
  {
    "title": "Putin vows to hit Ukraine back for attacks on Russia's strategic air bases: Trump",
    "description": "U.S. President Donald Trump disclosed Wednesday that Russian President Vladimir Putin told him that Moscow would \"have to respond\" to the massive Ukrainian drone attacks on Russia's strategic air bases days ago.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/06/ukraine-250605-pdo02.htm",
    "timestamp": "2025-06-05T07:03:17Z"
  },
  {
    "title": "After courting and criticizing Trump from afar, Merz now set to meet U.S. leader",
    "description": "Past meetings between the two countries’ leaders have often been formalities to reinforce their unshakable postwar partnership. This time is different.",
    "link": "https://www.japantimes.co.jp/news/2025/06/05/world/politics/merz-trump-meet/",
    "timestamp": "2025-06-05T07:03:00Z"
  },
  {
    "title": "Joe Biden Calls Trump Probe A 'Distraction' From 'Disastrous' GOP Bill Aiming To Raise Costs For Americans: 'All To Pay For Tax Breaks For The Ultra-Wealthy'",
    "description": "Former President Joe Biden has refuted allegations made by President Donald Trump concerning his mental health and the use of an autopen for signing official documents, dismissing them as a mere distraction.\nWhat Happened: On Wednesday, Trump launched a probe…",
    "link": "https://biztoc.com/x/ee53124333b67f59",
    "timestamp": "2025-06-05T07:02:33Z"
  },
  {
    "title": "Trump Shuts The Door On Permanent Immigration And Most Visas From These 12 Nations",
    "description": "President Donald Trump on Wednesday barred nearly all immigration and travel from Afghanistan, Myanmar, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen, citing poor vetting and terrorism threats.\nWhat …",
    "link": "https://biztoc.com/x/34a16994f89cdc62",
    "timestamp": "2025-06-05T07:02:14Z"
  },
  {
    "title": "Defence alert: Crypto is turning into a geopolitical weapon",
    "description": "It’s a tech innovation that the US under Trump seems bent on legitimizing. As crypto can be used to fund illicit activities and also be weaponized to destabilize financial systems, India needs a digital defence apparatus to guard against threats.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-cryptocurrency-binance-pakistan-imf-fatf-blockchain-india-bitcoin-ehawala-changpeng-zhao-justin-sun-us-11749039300659.html",
    "timestamp": "2025-06-05T07:00:04Z"
  },
  {
    "title": "The 8 at 8: Thursday",
    "description": "New Trump travel ban, CHI report referred to gardaí and Bulgaria gets euro green light.",
    "link": "https://www.thejournal.ie/eight-at-eight-8-at-8-6723474-Jun2025/",
    "timestamp": "2025-06-05T07:00:00Z"
  },
  {
    "title": "Trump Wants Grant Makers to Become Political Appointees",
    "description": "Trump Wants Grant Makers to Become Political Appointees\n\n \n\n\n \nkathryn.palmer…\n\nThu, 06/05/2025 - 03:00 AM\n\nOfficials say the policy, which would make it easier to fire thousands of government employees, is designed to increase accountability. But experts say…",
    "link": "https://www.insidehighered.com/news/government/science-research-policy/2025/06/05/trump-policy-moves-make-grant-makers-political",
    "timestamp": "2025-06-05T07:00:00Z"
  },
  {
    "title": "Sweden’s Core Inflation Slowdown Backs June Rate Cut",
    "description": "Sweden’s underlying inflation rate fell to a five-month low, broadly in line with expectations and strengthening the case for the Riksbank to reduce interest rates later this month.",
    "link": "https://financialpost.com/pmn/business-pmn/swedens-core-inflation-slowdown-backs-june-rate-cut",
    "timestamp": "2025-06-05T06:55:50Z"
  },
  {
    "title": "Trump orders probe into Joe Biden's alleged use of 'autopen'",
    "description": "Donald Trump says the alleged conspiracy — a cover-up of Joe Biden's cognitive decline — marks \"one of the most dangerous and concerning scandals in American history\".",
    "link": "https://www.abc.net.au/news/2025-06-05/trump-s-new-investigation-into-biden-s-use-of-autopen/105380240",
    "timestamp": "2025-06-05T06:53:31Z"
  },
  {
    "title": "Trump airs frustrations with Xi and Jerome Powell over elusive economic goals",
    "description": "President Donald Trump’s overnight volley of social media posts revealed his frustrations with decision makers whose cooperation he needs to secure some of his top economic objectives.\nEarly Wednesday morning, Trump pointed to fresh data from the private payr…",
    "link": "https://biztoc.com/x/6f0e823a879444de",
    "timestamp": "2025-06-05T06:51:15Z"
  },
  {
    "title": "Trump moves to block US entry for foreign students planning to study at Harvard University",
    "description": "President Donald Trump is moving to block nearly all foreign students from entering the country to attend Harvard University, his latest attempt to choke the Ivy League school from an international pipeline that accounts for a quarter of the student body",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-moves-block-us-entry-foreign-students-planning-122517924",
    "timestamp": "2025-06-05T06:43:31Z"
  },
  {
    "title": "Ειδικοί της Τεχνητής Νοημοσύνης προειδοποιούν εδώ και χρόνια: Είναι θέμα χρόνου να στραφεί εναντίον της ανθρωπότητας!",
    "description": "Η τεχνολογία τεχνητής νοημοσύνης (AI) αναπτύσσεται με εκθετικούς ρυθμούς, και φαίνεται πως είναι απλώς θέμα χρόνου να δημιουργηθούν οντότητες που μπορούν να σκέφτονται εκατομμύρια φορές πιο γρήγορα από τους ανθρώπους και να κάνουν σχεδόν τα πάντα καλύτερα απ’…",
    "link": "https://i-epikaira.blogspot.com/2025/06/blog-post_17.html",
    "timestamp": "2025-06-05T06:43:00Z"
  },
  {
    "title": "Jimmy Kimmel Exposes Real Reason 'Furious' Trump Suddenly 'Disappeared'",
    "description": "The late night host said the president has had one noticeable change in recent days.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-disappear_n_68411bbde4b0280f7518ac03",
    "timestamp": "2025-06-05T06:42:49Z"
  },
  {
    "title": "Green card holders, athletes and Afghans: Who escapes Trump’s sweeping new travel restrictions",
    "description": "Donald Trump has signed a sweeping new travel ban targeting citizens from 19 countries, citing national security and inadequate vetting systems. Set to take effect on 9 June, the ban blocks travel from 12 nations outright and restricts travellers from seven o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-travel-ban-2025-green-cards-athletes-and-afghans-who-escapes-trumps-sweeping-new-travel-restrictions/articleshow/121641146.cms",
    "timestamp": "2025-06-05T06:38:46Z"
  },
  {
    "title": "Russian strike kills 5, including 1 year old, hours after Trump calls Putin",
    "description": "At least five people, including a one-year-old child, were killed in a Russian drone strike on the northern Ukrainian city of Pryluky overnight, regional governor Viacheslav Chaus said Thursday",
    "link": "https://abcnews.go.com/International/wireStory/russian-strike-kills-5-including-1-year-hours-122522293",
    "timestamp": "2025-06-05T06:38:21Z"
  },
  {
    "title": "Joe Biden's Doctor to Be Subpoenaed to Testify About Former President",
    "description": "The House Oversight Committee is probing what its chairman called \"one of the greatest scandals in our nation's history\".",
    "link": "https://www.newsweek.com/joe-biden-doctor-subpoena-testify-house-investigation-autopen-2081191",
    "timestamp": "2025-06-05T06:32:53Z"
  },
  {
    "title": "US pressures NATO to seal deal on ramping up defence spending",
    "description": "US News: BRUSSELS: US defence chief Pete Hegseth on Thursday pushed Nato to agree a deal on ramping up defence spending that can satisfy President Donald Trump.",
    "link": "https://timesofindia.indiatimes.com/world/us/us-pressures-nato-to-seal-deal-on-ramping-up-defence-spending/articleshow/121640510.cms",
    "timestamp": "2025-06-05T06:32:26Z"
  },
  {
    "title": "German Chancellor Merz prepares for delicate talks with Trump",
    "description": "German Chancellor Friedrich Merz is set to meet US President Donald Trump Thursday, hoping to build a personal relationship despite discord over Ukraine and the threat of a trade war.",
    "link": "https://www.thelocal.de/20250605/german-chancellor-merz-prepares-for-delicate-talks-with-trump",
    "timestamp": "2025-06-05T06:31:06Z"
  },
  {
    "title": "Trump Family To ‘Legally Challenge’ Magic Eden’s ‘Official’ Crypto Wallet – Report",
    "description": "Amid the controversial announcement of an “official” TRUMP crypto wallet, the Trump family is allegedly considering taking legal action against the project for using the likeness of the US President. Related Reading: Coinbase Faces Backlash For Allegedly Dela…",
    "link": "https://bitcoinist.com/trump-family-to-legally-challenge-magic-edens-official-crypto-wallet-report/",
    "timestamp": "2025-06-05T06:30:30Z"
  }
]