[
  {
    "title": "Former Mexican Governor Sends Letter to Trump Over Alleged Cartel Connections of Mexico’s New Consul in Miami",
    "description": "A former Mexican governor sent a series of letters to U.S. President Donald J. Trump, warning him about the alleged cartel connections of Mexico’s new consul in Miami. In the letters, the politician warned Trump to have the U.S. Department of State and the Na…",
    "link": "https://www.breitbart.com/border/2025/02/12/former-mexican-governor-sends-letter-to-trump-over-alleged-cartel-connections-of-mexicos-new-consul-in-miami/",
    "timestamp": "2025-02-12T21:13:03Z"
  },
  {
    "title": "Patel camp decries Durbin accusations as ‘politically motivated’ attempt to derail FBI confirmation",
    "description": "A team member for President Donald Trump's FBI director nominee, Kash Patel, pushed back Wednesday on allegations that Patel played a role in the firings of bureau personnel just hours after swearing not to do so during his confirmation hearing late last mont…",
    "link": "https://freerepublic.com/focus/f-news/4297105/posts",
    "timestamp": "2025-02-12T21:12:00Z"
  },
  {
    "title": "Dem trolls MTG with ‘d–k pic’ at DOGE hearing — by unveiling photo of Elon Musk",
    "description": "He is putting the D in DOGE.",
    "link": "https://nypost.com/2025/02/12/us-news/dem-brings-d-pic-image-of-smiling-elon-musks-face-to-mtgs-chaotic-doge-hearing/",
    "timestamp": "2025-02-12T21:11:58Z"
  },
  {
    "title": "Everyday Americans are demanding answers on Elon Musk",
    "description": "Rachel Maddow explains how many Americans are speaking out against Elon Musk's DOGE cuts by protesting Tesla and demanding answers from their representatives",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-doge-tesla-protest-rcna191871",
    "timestamp": "2025-02-12T21:10:43Z"
  },
  {
    "title": "Taking Axe to 'Human Needs Budget', Trump and Musk Nowhere to Be Found at 'Slash the Pentagon' Event",
    "description": "As billionaire Elon Musk's Department of Government Efficiency makes its way through federal agencies with the aim of cutting spending that goes toward protecting workers' rights, providing disaster assistance and healthcare in the Global South, and defending…",
    "link": "https://www.commondreams.org/news/pentagon-failed-audit",
    "timestamp": "2025-02-12T21:09:56Z"
  },
  {
    "title": "First lady Melania Trump announces reopening of public White House tours",
    "description": "The Office of First Lady Melania Trump announces White House tours will resume on Tuesday, Feb. 25, as she and President Donald Trump returned to the official residence.",
    "link": "https://www.foxnews.com/travel/first-lady-melania-trump-announces-reopening-public-white-house-tours",
    "timestamp": "2025-02-12T21:08:43Z"
  },
  {
    "title": "Tulsi Gabbard sworn in at White House hours after Senate confirmation",
    "description": "Tulsi Gabbard was sworn in as Director of National Intelligence (DNI) on Wednesday after being confirmed by the Senate several hours earlier.",
    "link": "https://www.foxnews.com/politics/tulsi-gabbard-sworn-white-house-hours-after-senate-confirmation",
    "timestamp": "2025-02-12T21:08:41Z"
  },
  {
    "title": "Trump Says He’s Been ‘Unanimously’ Elected Kennedy Center Chair After Its President Is Fired",
    "description": "Artistic advisor Ben Folds resigned from his position in response to the news\nThe post Trump Says He’s Been ‘Unanimously’ Elected Kennedy Center Chair After Its President Is Fired appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-national-symphony-orchestra-chairman-kennedy-center/",
    "timestamp": "2025-02-12T21:08:28Z"
  },
  {
    "title": "Trump says he and Putin expect to meet, probably in Saudi Arabia",
    "description": "US President Donald Trump and Russian President Vladimir Putin expect to meet in the future, probably in Saudi Arabia, Trump said on Wednesday after a call with the Russian leader.",
    "link": "https://freerepublic.com/focus/f-chat/4297103/posts",
    "timestamp": "2025-02-12T21:07:38Z"
  },
  {
    "title": "Aid groups tell judge that Trump's foreign aid pause has 'devastated' operations",
    "description": "A coalition of aid groups said at an emergency hearing Wednesday that the Trump administration's 90-day pause on foreign aid had already \"devastated\" their operations.",
    "link": "https://abcnews.go.com/US/nonprofits-accuse-administration-accelerating-foreign-aid-cuts/story?id=118737424",
    "timestamp": "2025-02-12T21:07:04Z"
  },
  {
    "title": "Trump Should Reinstate Obama’s Moratorium on Risky Biological Research",
    "description": "President Donald Trump is reportedly preparing an executive order to halt funding of risky viral gain-of-function research—lab experimentation designed to genetically manipulate biological agents to make them... Read More\nThe post Trump Should Reinstate Obama…",
    "link": "https://www.dailysignal.com/2025/02/12/trump-should-reinstate-obamas-moratorium-on-risky-biological-research/",
    "timestamp": "2025-02-12T21:06:46Z"
  },
  {
    "title": "Trump: We're on the way to peace with Russia, Ukraine",
    "description": "\"I think we're on the way to peace with Russia and Ukraine,\" United States President Donald Trump told reporters on Wednesday in the Oval Office, adding, however, that it is unlikely that Ukraine will...",
    "link": "https://biztoc.com/x/7d3b531cd38d3a6b",
    "timestamp": "2025-02-12T21:05:28Z"
  },
  {
    "title": "Maine's School Sports Officials Reject Trump's Orders, Will Allow Transgender Athletes",
    "description": "The governing body for school sports in Maine rejected President Donald Trump's new rules banning transgender athletes in girl's sports.\nThe post Maine’s School Sports Officials Reject Trump’s Orders, Will Allow Transgender Athletes appeared first on Breitbar…",
    "link": "https://www.breitbart.com/sports/2025/02/12/maines-school-sports-officials-reject-trumps-orders-will-allow-transgender-athletes/",
    "timestamp": "2025-02-12T21:05:26Z"
  },
  {
    "title": "'Makes sense': GOP, Dems unite behind Trump's plan to fire the penny",
    "description": "Democratic and Republican lawmakers spoke with Fox News Digital on Capitol Hill about whether they agree with President Donald Trump's elimination of the penny.",
    "link": "https://www.foxnews.com/politics/makes-sense-gop-dems-behind-trumps-plan-fire-penny",
    "timestamp": "2025-02-12T21:05:19Z"
  },
  {
    "title": "'$600M on Sushi!' Republican hits 'wild' govt waste using examples from parody X account",
    "description": "Oregon’s Senate Republican leader shared debunked claims from a social media parody account about federal government spending in a state-issued email newsletter decrying “fear-mongering and misinformation.”\nSen. Daniel Bonham, R-The Dalles, dedicated the firs…",
    "link": "https://www.rawstory.com/spending-on-sushi/",
    "timestamp": "2025-02-12T21:04:31Z"
  },
  {
    "title": "Did Donald Trump really drop $20M on a Super Bowl cameo, just to leave early—and who picked up the tab?",
    "description": "US President Donald Trump’s attendance at Super Bowl LIX sparked debate over its high security costs, estimated between $10 and $20 million, largely funded by taxpayers. His early departure raised further questions, with theories ranging from security concern…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-donald-trump-really-drop-20m-on-a-super-bowl-cameo-just-to-leave-earlyand-who-picked-up-the-tab/articleshow/118191221.cms",
    "timestamp": "2025-02-12T21:04:02Z"
  },
  {
    "title": "Hamas delegation in Egypt as mediators push to maintain Gaza ceasefire",
    "description": "Fragile ceasefire appears strained, with Hamas saying it will not bow down to threats from Israel and the US.",
    "link": "https://www.aljazeera.com/news/2025/2/12/hamas-delegation-in-egypt-as-mediators-push-to-maintain-gaza-ceasefire",
    "timestamp": "2025-02-12T21:03:54Z"
  },
  {
    "title": "Sen. Elizabeth Warren’s Two-Word Plan to Save the CFPB From Elon Musk",
    "description": "Following the 2008 global financial crisis, the Consumer Financial Protection Bureau (CFPB) was established by Congress to reign in the subprime lending schemes and other bad practices that spurred the market implosion. Now, President Donald Trump, Elon Musk,…",
    "link": "https://www.motherjones.com/politics/2025/02/sen-elizabeth-warrens-two-word-plan-to-save-the-cfpb-from-elon-musk/",
    "timestamp": "2025-02-12T21:03:21Z"
  },
  {
    "title": "ACLU sues for access to migrants flown to Guantanamo this month",
    "description": "Civil rights attorneys have sued the Trump administration to gain access to detained migrants who they say have been flown to Guantanamo Bay and held there without being able to consult lawyers or speak to relatives",
    "link": "https://abcnews.go.com/US/wireStory/aclu-sues-access-migrants-flown-guantanamo-month-118753541",
    "timestamp": "2025-02-12T21:02:39Z"
  },
  {
    "title": "Trump's slapping of reciprocal tariffs to begin after meeting with Indian PM Narendra Modi? Here's what could be in store",
    "description": "Donald Trump has recently announced that he would be slapping reciprocal tariffs on countries that impose import duties on US goods, and this could now become a reality after the crucial meeting between Donald Trump and Indian PM Narendra Modi",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-slapping-of-reciprocal-tariffs-to-begin-after-meeting-with-indian-pm-narendra-modi-heres-what-could-be-in-store/articleshow/118191270.cms",
    "timestamp": "2025-02-12T21:02:05Z"
  },
  {
    "title": "'Canada 51st state' hats sparks outrage among Canadians. Will Amazon pull the merch?",
    "description": "On the other side of the commercial-political divide, consumers can find products proclaiming that Canada is not for sale.",
    "link": "https://nationalpost.com/news/canada/canada-51st-state-hats-sparks-outrage-among-canadians-will-amazon-pull-the-merch",
    "timestamp": "2025-02-12T21:01:29Z"
  },
  {
    "title": "Melania Trump Announces Reopening of White House Public Tours",
    "description": "First lady Melania Trump announces the reopening of White House public tours, following weeks of public absence and missed high-profile events.",
    "link": "https://www.newsweek.com/melania-trump-white-house-reopens-public-tours-february-2025-2030237",
    "timestamp": "2025-02-12T21:01:07Z"
  },
  {
    "title": "Indian Prime Minister Modi to meet with U.S. President Trump to discuss trade this week",
    "description": "This week, Indian Prime Minister Narendra Modi will meet with U.S. President Donald Trump in a significant bilateral engagement focused…\nThe post Indian Prime Minister Modi to meet with U.S. President Trump to discuss trade this week appeared first on MacDail…",
    "link": "https://macdailynews.com/2025/02/12/indian-prime-minister-modi-to-meet-with-u-s-president-trump-to-discuss-trade-this-week/",
    "timestamp": "2025-02-12T21:01:02Z"
  },
  {
    "title": "Federal health agencies restore webpages and datasets following judge’s order",
    "description": "The Centers for Disease Control and Prevention and the Food and Drug Administration brought back information following the judge's order on Tuesday.",
    "link": "https://www.wtoc.com/2025/02/12/federal-health-agencies-restore-webpages-datasets-following-judges-order/",
    "timestamp": "2025-02-12T21:00:36Z"
  },
  {
    "title": "Russian President Vladimir Putin invites Donald Trump to Moscow to discuss ending the war in Ukraine after ‘lengthy’ phone call",
    "description": "US President Donald Trump has been invited to Moscow by Russian leader Vladimir Putin as they discussed ending the war in Ukraine during a phone call on Wednesday. Russian President Vladimir Putin has invited United States President Donald Trump to Moscow in …",
    "link": "https://freerepublic.com/focus/f-news/4297100/posts",
    "timestamp": "2025-02-12T21:00:22Z"
  },
  {
    "title": "Kingsley Ben Adir's 10 Best Movies And TV Shows",
    "description": "The best Kingsley Ben-Adir Movies and TV show reveal a career that's on the cusp of reaching full momentum.",
    "link": "https://screenrant.com/kingsley-ben-adir-best-movies-tv-shows-ranked/",
    "timestamp": "2025-02-12T21:00:16Z"
  },
  {
    "title": "Attorney General Pam Bondi to Hold Press Conference from the Trump White House at 5:00 PM ET – VIDEO",
    "description": "Attorney General Pam Bondi is set to address the nation from the Trump White House, focusing on what she terms judicial overreach by far-left judges. Her remarks promise to ignite significant political discourse.\nThe post Attorney General Pam Bondi to Hold Pr…",
    "link": "https://www.thegatewaypundit.com/2025/02/attorney-general-pam-bondi-hold-press-conference-trump/",
    "timestamp": "2025-02-12T21:00:15Z"
  },
  {
    "title": "Petrobras Can Cope With Cheaper Oil Under Trump, CEO Says",
    "description": "Petrobras Chief Executive Officer Magda Chambriard said the Brazilian oil giant can withstand global prices sliding a little lower under Donald Trump.",
    "link": "https://www.rigzone.com/news/wire/petrobras_can_cope_with_cheaper_oil_under_trump_ceo_says-12-feb-2025-179615-article/",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Tisco ESU: Fed to keep rate stable until midyear",
    "description": "<p>Tisco Economic Strategy Unit (ESU) expects the Federal Reserve to keep the US interest rate unchanged until mid-2025, dampening prospects for global stock markets, with banks the exception.</p>",
    "link": "https://www.bangkokpost.com/business/general/2960011/tisco-esu-fed-to-keep-rate-stable-until-midyear",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Trade Wars Bring Pain… And Opportunity",
    "description": "It’s game on for the trade wars. After months of threatening tariffs on U.S. trading partners during his 2024 presidential campaign, Trump has now taken definitive action on that front. On Saturday, February 1, Trump announced that the U.S. was imposing 25% t…",
    "link": "https://www.activistpost.com/trump-trade-wars-implications-and-impact-on-global-economy/",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "War: two steps forward, two steps back?",
    "description": "<p>In classical civilisations, there was a continuing, unresolved debate about whether history moved forward or just went around in circles: was it linear or was it cyclical? But that debate was largely settled once human beings learned about their deeper pas…",
    "link": "https://www.bangkokpost.com/opinion/opinion/2960046/war-two-steps-forward-two-steps-back-",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Immigration divides New Jersey Democrats in an early test for the party",
    "description": "The New Jersey governor’s race is providing an early test for Democrats trying to navigate the thorny issues of immigration and border security following Donald Trump’s victory, and those issues are already dividing the party's candidates.",
    "link": "https://www.nbcnews.com/politics/elections/immigration-divides-new-jersey-democrats-early-test-party-rcna191686",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Tisco: Fed to keep rate stable until midyear",
    "description": "<p>Tisco Economic Strategy Unit (ESU) expects the Federal Reserve to keep the US interest rate unchanged until mid-2025, dampening prospects for global stock markets, with banks the exception.</p>",
    "link": "https://www.bangkokpost.com/business/general/2960011/tisco-fed-to-keep-rate-stable-until-midyear",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Marc Fogel’s family: Rosary and faith sustained them through his detainment in Russia",
    "description": "U.S. President Donald Trump welcomes Marc Fogel back to the United States after being released from Russian custody, at the White House on Feb. 11, 2025 in Washington, DC. / Credit: Photo by Al Drago/Getty Images\n\nWashington, D.C. Newsroom, Feb 12, 2025 / 16:…",
    "link": "https://www.catholicnewsagency.com/news/262187/marc-fogel-s-family-rosary-and-faith-sustained-them-through-his-detainment-in-russia",
    "timestamp": "2025-02-12T21:00:00Z"
  },
  {
    "title": "Trump, allies ramp up attacks on judges as Musk calls for impeachments",
    "description": "Donald Trump and his supporters on Wednesday continued to ramp up their criticism of judges who they say have",
    "link": "https://www.jpost.com/breaking-news/article-841913",
    "timestamp": "2025-02-12T20:58:18Z"
  },
  {
    "title": "Hegseth Rules Out U.S. Peacekeeping in Ukraine",
    "description": "The Trump administration has placed the onus of Kyiv’s security on Europe to allow Washington to shift its focus toward China.",
    "link": "https://foreignpolicy.com/2025/02/12/russia-ukraine-nato-hegseth-trump-putin-zelensky-call/",
    "timestamp": "2025-02-12T20:58:13Z"
  },
  {
    "title": "How Elon Musk's DOGE took over the Education Department, one office at a time",
    "description": "President Donald Trump wants to dismantle the Department of Education. He can't eliminate it without Congress, but Elon Musk's DOGE can slowly starve it.",
    "link": "https://www.cnbc.com/2025/02/12/trump-doge-education-elon-musk-cuts.html",
    "timestamp": "2025-02-12T20:57:55Z"
  },
  {
    "title": "Karoline Leavitt Falsely Says 'Constitutional Crisis' Is Coming From Judges",
    "description": "The White House press secretary told a bald-faced lie about the separation of powers.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-falsely-says-constitutional-crisis-is-coming-from-judges_n_67acf913e4b0232270788c92",
    "timestamp": "2025-02-12T20:55:48Z"
  },
  {
    "title": "DOGE Executive Order Asks Agency Employees To Justify Their Existence",
    "description": "President Donald Trump ordered federal agencies Tuesday to demonstrate that their employees’ roles are legally required, granting Elon Musk’s Department of Government Efficiency (DOGE) broad new powers to eliminate positions deemed unnecessary. The executive …",
    "link": "https://freerepublic.com/focus/f-news/4297099/posts",
    "timestamp": "2025-02-12T20:55:33Z"
  },
  {
    "title": "US rejects NATO membership for Ukraine",
    "description": "United States Secretary of Defence Pete Hegseth stated on Wednesday that the war between Ukraine and Russia “must end,” but emphasised that Ukraine’s membership in NATO was not a realistic outcome of a negotiated settlement. Speaking before the Ukraine Defenc…",
    "link": "https://punchng.com/us-rejects-nato-membership-for-ukraine/",
    "timestamp": "2025-02-12T20:55:24Z"
  },
  {
    "title": "Israel Says Will Implement Trump's Gaza Plan If Hostages Not Freed",
    "description": "Israel on Wednesday threatened to launch a &quot;new&quot; war on Hamas and implement US President Donald Trump&#039;s plan to displace Palestinians from the ravaged Gaza Strip if the militants do not release hostages this weekend.",
    "link": "https://www.ndtv.com/world-news/israel-says-will-implement-trumps-gaza-plan-if-hostages-not-freed-7697439",
    "timestamp": "2025-02-12T20:55:12Z"
  },
  {
    "title": "Trump: US, Russia Agree to Start Talks on Ending Ukraine War",
    "description": "President Donald Trump said he spoke with Russian President Vladimir Putin Wednesday about starting negotiations \"immediately\" to end the war in Ukraine. Trump said in a social media post that he and Putin held a lengthy phone call during which they committed…",
    "link": "https://freerepublic.com/focus/f-news/4297097/posts",
    "timestamp": "2025-02-12T20:55:06Z"
  },
  {
    "title": "Ben Folds Resigns From National Symphony Orchestra Role as Trump Seizes Kennedy Center",
    "description": "Ben Folds has resigned as the artistic advisor for the National Symphony Orchestra as Donald Trump solidified his takeover of the Kennedy Center.",
    "link": "http://www.rollingstone.com/music/music-news/ben-folds-resigns-orchestra-trump-kennedy-center-1235265504/",
    "timestamp": "2025-02-12T20:55:05Z"
  },
  {
    "title": "Hamas official: Hostage release to go on as planned",
    "description": "Hamas official says terror group won't release all hostages on Saturday, but will release hostages in accordance with the agreement already signed, Kan News reports.",
    "link": "https://www.israelnationalnews.com/news/403832",
    "timestamp": "2025-02-12T20:54:37Z"
  },
  {
    "title": "Cardi B Accuses Trump of Ruining Her $3,000 Shoes",
    "description": "Cardi B was not pleased that the Secret Service messed with her footwear at the Super Bowl on Sunday, February 9.\nThe \"Up\" songstress, 32, took to Instagram live after the game, and in a video that's since circulated on X (formerly Twitter), she blamed the pr…",
    "link": "https://biztoc.com/x/2eeb239eb6e8383d",
    "timestamp": "2025-02-12T20:54:26Z"
  },
  {
    "title": "Trump Bans AP From Oval Office for Not Saying 'Gulf of America'",
    "description": "A dust-up over geographical nomenclature is silly, but it signals the Trump administration's hostility to the First Amendment and freedom of the press.",
    "link": "https://reason.com/2025/02/12/trump-bans-ap-from-oval-office-for-not-saying-gulf-of-america/",
    "timestamp": "2025-02-12T20:54:15Z"
  },
  {
    "title": "‘Constitutional Crisis’: White House Slams ‘Judicial Activist’ Injunctions Against Trump",
    "description": "While legacy media claim there is a “constitutional crisis” in the Trump administration, the real crisis comes from federal judges blocking President Donald Trump’s executive... Read More\nThe post ‘Constitutional Crisis’: White House Slams ‘Judicial Activist’…",
    "link": "https://www.dailysignal.com/2025/02/12/constitutional-crisis-white-house-slams-judicial-activist-injunction-trump/",
    "timestamp": "2025-02-12T20:52:55Z"
  },
  {
    "title": "Why Trump’s Takeover of the Kennedy Center Will Reverberate in Hollywood and Beyond",
    "description": "Trump is now the Kennedy Center's board chairman, giving him control over a beloved arts institution that regularly interacts with Hollywood",
    "link": "https://time.com/7221538/donald-trump-kennedy-center/",
    "timestamp": "2025-02-12T20:52:01Z"
  },
  {
    "title": "What does it mean to be in a “constitutional crisis”?",
    "description": "We’re less than two months into the second Trump administration, but one thing is clear: President Donald Trump would very much like to be unbound by the Constitution. A whole range of Trump’s early actions, from his attempt to roll back birthright citizenshi…",
    "link": "https://www.vox.com/politics/399487/trump-musk-doge-constitutional-crisis-definition",
    "timestamp": "2025-02-12T20:52:01Z"
  },
  {
    "title": "Trumpflation",
    "description": "Congratulations to the voters who chose fascism because BURGER TOO EXPONSIVE: It’s not just eggs. Many commonly purchased goods and services got more expensive in January, driving inflation in the wrong direction and to its highest rate since June of last yea…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/trumpflation-2",
    "timestamp": "2025-02-12T20:51:47Z"
  },
  {
    "title": "Dem shames GOP for not investigating '$8 million a day' Elon Musk gets from taxpayers - NewsBreak",
    "description": "Rep. Greg Casar (D-TX) on Wednesday let loose on Republicans for giving X owner Elon Musk a pass when it comes to government waste. During a House Departme",
    "link": "https://www.newsbreak.com/share/3806171692788-dem-shames-gop-for-not-investigating-8-million-a-day-elon-musk-gets-from-taxpayers?s=a2&share_destination_id=MTc2NzUyNzkxLTE3MzkzOTM0MTMyMTc%3D&pd=0BxdTT3e&hl=en_US&send_time=1739393413&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_rank_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v9",
    "timestamp": "2025-02-12T20:50:41Z"
  },
  {
    "title": "Federal Judge Mandates Return of Scrubbed Health Resources by Trump Admin",
    "description": "A Public Citizen attorney called the order “an important victory for doctors, patients, and the public health.”…",
    "link": "https://truthout.org/articles/federal-judge-mandates-return-of-scrubbed-health-resources-by-trump-admin/",
    "timestamp": "2025-02-12T20:50:35Z"
  },
  {
    "title": "Trump Gives EPA One Week to Decide on Abandoning Climate Pollution Regulation",
    "description": "President Trump ordered EPA Administrator Lee Zeldin to decide by next week whether the agency could abandon its authority to regulate climate pollution under the Clean Air Act",
    "link": "https://subscriber.politicopro.com/article/eenews/2025/02/12/trump-set-a-deadline-on-the-endangerment-finding-heres-how-it-could-play-out-00203693",
    "timestamp": "2025-02-12T20:50:00Z"
  },
  {
    "title": "Cardi B Accuses Trump of Ruining Her $3,000 Shoes",
    "description": "The 'Bodak Yellow' songstress found that her Louboutins did not make it out of the Super Bowl unscathed.",
    "link": "https://www.newsweek.com/entertainment/celebrity-news/cardi-b-accuses-trump-ruining-3000-shoes-2030253",
    "timestamp": "2025-02-12T20:49:26Z"
  },
  {
    "title": "FCC Chairman Launches Probe Into Comcast and NBCU DEI Practices, Says He Is ‘Concerned’ They May Be ‘Promoting Invidious Forms of Discrimination’",
    "description": "FCC Chairman Brendan Carr has taken the Trump administration’s war on diversity, equity and inclusion to a new target: Comcast and NBCUniversal. Carr said he sent a letter Tuesday to Comcast CEO Brian Roberts “to let him know that I’ve asked the FCC’s Enforce…",
    "link": "https://variety.com/2025/tv/news/fcc-probe-comcast-nbcuniversal-dei-invidious-discrimination-1236305683/",
    "timestamp": "2025-02-12T20:47:54Z"
  },
  {
    "title": "Angry Google Maps Users Report Gulf Of America As Mislabeled",
    "description": "Vexed Google Maps users are rallying on social media to report the Gulf of America as mislabeled in protest of the company’s decision to rename the Gulf of Mexico.",
    "link": "https://www.forbes.com/sites/dimitarmixmihov/2025/02/12/angry-google-maps-users-report-gulf-of-america-as-mislabeled/",
    "timestamp": "2025-02-12T20:47:09Z"
  },
  {
    "title": "Donald Trump Was Asked If He Views JD Vance As His \"Successor,\" And His Response Was Soooo Petty",
    "description": "\"I've never heard him actually give a direct answer like this before.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/reactions-trump-vance-successor",
    "timestamp": "2025-02-12T20:46:07Z"
  },
  {
    "title": "Trump injects poisonous concept of ethnic cleansing into already difficult Gaza rebuild",
    "description": "Gaza has no shortage of problems – a lack of luxury hotels isn't one of them. U.S. President Donald Trump's plan for it is not a solution, it is a needless distraction from a very real problem",
    "link": "https://www.haaretz.com/us-news/2025-02-12/ty-article-magazine/.premium/trump-injects-poisonous-concept-of-ethnic-cleansing-into-already-difficult-gaza-rebuild/00000194-fa6f-df1c-ad94-fb6f23d60000",
    "timestamp": "2025-02-12T20:45:52Z"
  },
  {
    "title": "WATCH: “Utterly Ridiculous” – White House Press Secretary Karoline Leavitt Responds to Lunatic Rep. Jamie Raskin’s Calls to Impeach Elon Musk",
    "description": "In a heated exchange, White House Press Secretary Karoline Leavitt addresses Congressman Jamie Raskin's provocative impeachment demands regarding Elon Musk, highlighting the escalating tensions within the political landscape.\nThe post WATCH: “Utterly Ridiculo…",
    "link": "https://www.thegatewaypundit.com/2025/02/watch-utterly-ridiculous-white-house-press-secretary-karoline/",
    "timestamp": "2025-02-12T20:45:30Z"
  },
  {
    "title": "Trump Boasts That He Was ‘Unanimously’ Elected as New Chairman of Kennedy Center After Firing Dissenters on Board of Trustees",
    "description": "President Donald Trump reacted on Truth Social with joy after being elected by the Kennedy Center to lead the board of trustees as their chairman.\nThe post Trump Boasts That He Was ‘Unanimously’ Elected as New Chairman of Kennedy Center After Firing Dissenter…",
    "link": "https://www.mediaite.com/trump/trump-boasts-that-he-was-unanimously-elected-as-new-chairman-of-kennedy-center-after-firing-dissenters-on-board-of-trustees/",
    "timestamp": "2025-02-12T20:45:26Z"
  },
  {
    "title": "Trump pushes for lower interest rates alongside tariffs",
    "description": "WASHINGTON — As his trade advisers finalized plans to enact reciprocal measures on every country that charges duties on U.S. imports, President Donald Trump announced Wednesday he will push for lower interest rates alongside his tariff policies.\n\n\n“Interest R…",
    "link": "https://www.voanews.com/a/trump-pushes-for-lower-interest-rates-alongside-tariffs/7972678.html",
    "timestamp": "2025-02-12T20:44:44Z"
  },
  {
    "title": "Biden administration slow-walked Marc Fogel designation as 'wrongful detainee,' Republicans say",
    "description": "The Biden administration had slow-walked its designation of American Marc Fogel as a \"wrongful detainee\" in Russia, Republicans and officials who worked on freeing Fogel told Fox News Digital.",
    "link": "https://www.foxnews.com/politics/biden-administration-slow-walked-marc-fogel-designation-wrongful-detainee-republicans-say",
    "timestamp": "2025-02-12T20:44:27Z"
  },
  {
    "title": "Trump Has Made His Major Decisions on His Crypto Regulation Team, Now Also OCC",
    "description": "Trump Has Made His Major Decisions on His Crypto Regulation Team, Now Also OCC\nWith picks at the banking agency and consumer watchdog, the field of major nominees is mostly complete, showing a deep roster of finance and federal know-how.\nWhat to know:\n- Presi…",
    "link": "https://biztoc.com/x/7fe7ab0ee97a100d",
    "timestamp": "2025-02-12T20:43:03Z"
  },
  {
    "title": "Tulsi Gabbard confirmed as US spy chief",
    "description": "The US Senate confirms military veteran Tulsi Gabbard as the Director of National Intelligence, a role involving the oversight of all spy agencies.",
    "link": "https://www.abc.net.au/news/2025-02-13/trump-names-tulsi-gabbard-director-of-national-intelligence/104930278",
    "timestamp": "2025-02-12T20:42:56Z"
  },
  {
    "title": "Trump administration’s cuts at NIH are helping fuel RFK Jr.’s worst idea",
    "description": "The Trump administration has created an existential crisis for several government agencies and departments — few more critical than the National Institutes of Health, as bird flu spreads through the U.S.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/trump-rfk-jr-infectious-disease-chronic-nih-research-rcna191902",
    "timestamp": "2025-02-12T20:42:49Z"
  },
  {
    "title": "Federal layoffs incoming? Donald Trump’s plan to shrink the Bureaucracy gains momentum",
    "description": "President Donald Trump has signed an executive order initiating widespread layoffs in federal agencies. The move, enforced by Elon Musk’s Department of Government Efficiency (DOGE), prioritises cuts in diversity, equity, and inclusion roles, temporary employe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/federal-layoffs-incoming-donald-trumps-plan-to-shrink-the-bureaucracy-gains-momentum/articleshow/118191030.cms",
    "timestamp": "2025-02-12T20:42:29Z"
  },
  {
    "title": "Zelenskyy, Trump discuss 'opportunities to achieve peace' by phone",
    "description": "KYIV: Ukrainian President Volodymyr Zelenskyy said on Wednesday (Feb 12) that he spoke by phone with US President Donald Trump and discussed \"opportunities to achieve peace\" and the preparation of a document governing security and economic cooperation. The ca…",
    "link": "https://www.channelnewsasia.com/world/zelenskyy-trump-discuss-opportunities-achieve-peace-phone-4934401",
    "timestamp": "2025-02-12T20:42:28Z"
  },
  {
    "title": "Maná is the first Spanish-language rock band nominated for the Rock & Roll Hall of Fame",
    "description": "The Mexican rock band is the most popular and influential Latin rock band of all time, according to  the Rock Hall, which celebrates the history of rock music.",
    "link": "https://www.nbcnews.com/news/latino/mana-first-spanish-language-rock-band-rock-roll-hall-fame-nomination-rcna191889",
    "timestamp": "2025-02-12T20:42:21Z"
  },
  {
    "title": "Social Media Reacts To Tulsi Gabbard's Confirmation As National Intelligence Director",
    "description": "Sen. Sheldon Whitehouse noted that Russian state media refers to the former Congresswoman as \"our friend Tulsi.\"",
    "link": "https://www.huffpost.com/entry/social-media-reaction-tulsi-gabbard_n_67acf56be4b0239406deda0f",
    "timestamp": "2025-02-12T20:40:43Z"
  },
  {
    "title": "‘Without Words!’ House Dem Fumes Over GOP Wanting To Raise Debt Limit By $4 Trillion During Hearing on Government Waste",
    "description": "\"Okay, guys. Like, literally. I'm just like, without words! Inflation is going up. You want to raise the debt ceiling by $4 trillion?\"\nThe post ‘Without Words!’ House Dem Fumes Over GOP Wanting To Raise Debt Limit By $4 Trillion During Hearing on Government W…",
    "link": "https://www.mediaite.com/tv/without-words-house-dem-fumes-over-gop-wanting-to-raise-debt-limit-by-4-trillion-during-hearing-on-government-waste/",
    "timestamp": "2025-02-12T20:36:41Z"
  },
  {
    "title": "‘Obama Bros’ admit they should’ve done ‘some of the stuff’ Trump is doing with DOGE",
    "description": "Former aides to President Barack Obama admitted on an episode of \"Pod Save America\" they should have done \"some of the stuff\" President Trump is doing with the Department of Government Efficiency.",
    "link": "https://nypost.com/2025/02/12/us-news/obama-bros-admit-they-shouldve-done-some-of-the-stuff-trump-is-doing-with-doge/",
    "timestamp": "2025-02-12T20:36:05Z"
  },
  {
    "title": "News agency AP blocked by Donald Trump's Oval office; here's the reason why",
    "description": "Latest developments have revealed that the renowned news agency Associated Press is being recently blocked by the Oval Office of US President Donald Trump and there is a significant reason behind it.",
    "link": "https://economictimes.indiatimes.com/news/international/us/news-agency-ap-blocked-by-donald-trumps-oval-office-heres-the-reason-why/articleshow/118190929.cms",
    "timestamp": "2025-02-12T20:34:57Z"
  },
  {
    "title": "How DOGE Is Putting State Secrets at Risk",
    "description": "Elon Musk’s takeover of federal agencies is a counterintelligence crisis.",
    "link": "https://www.theatlantic.com/international/archive/2025/02/doge-intelligence-agencies-harm/681667/",
    "timestamp": "2025-02-12T20:34:34Z"
  },
  {
    "title": "Top US Grid Wins Speedy Review of Power Plants to Feed AI Boom",
    "description": "The largest US grid is set to speed the review process for new power plants, in a move that supports gas in the race to feed a surge in demand from data centers amid the AI boom.",
    "link": "https://financialpost.com/pmn/business-pmn/top-us-grid-wins-speedy-review-of-power-plants-to-feed-ai-boom",
    "timestamp": "2025-02-12T20:34:26Z"
  },
  {
    "title": "Trump wants lower interest rates to go ‘hand-in-hand’ with tariffs, but yields are soaring after inflation data came in hot",
    "description": "Trump wants lower interest rates to go ‘hand-in-hand’ with tariffs, but yields are soaring after inflation data came in hot\nPresident Donald Trump has said he should have a say on interest rates.\nKevin Mazur—Getty Images for Roc Nation",
    "link": "https://biztoc.com/x/53f5a560ac845a32",
    "timestamp": "2025-02-12T20:32:23Z"
  },
  {
    "title": "The Canadian forestry industry fears it will be next in Trump’s sights",
    "description": "Since Trump took office four weeks ago, St-Gelais has seen a drop of about 25 per cent in orders from Canada and the United States",
    "link": "https://nationalpost.com/news/canada/the-canadian-forestry-industry-fears-it-will-be-next-in-trumps-sights",
    "timestamp": "2025-02-12T20:32:17Z"
  },
  {
    "title": "Donald Trump euphoria fades fast: CEOs & bankers sound the alarm after initial hype; here's why",
    "description": "Business executives and Wall Street bankers are growing uneasy as the excitement surrounding Trump's presidency fades, with concerns over unpredictable policies and rising inflation. Despite a quiet start to the year in the deals market, some remain hopeful t…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trump-euphoria-fades-fast-ceos-bankers-sound-the-alarm-after-initial-hype-heres-why/articleshow/118190330.cms",
    "timestamp": "2025-02-12T20:31:52Z"
  },
  {
    "title": "A Third DOGE Staffer’s Racist and Misogynistic Online Footprint Comes to Light",
    "description": "Edward Coristine created URLs that promoted racism against Black people and sexual violence against women and children.",
    "link": "https://truthout.org/articles/a-third-doge-staffers-racist-and-misogynistic-online-footprint-comes-to-light/",
    "timestamp": "2025-02-12T20:31:43Z"
  },
  {
    "title": "Donald Trump and the Politics of Looking Busy",
    "description": "“We’re confused a little bit … But it’s definitely like, Something’s happening.”",
    "link": "https://www.theatlantic.com/politics/archive/2025/02/trump-busy-second-term/681664/",
    "timestamp": "2025-02-12T20:31:37Z"
  },
  {
    "title": "Married women warn SAVE Act is backdoor disenfranchisement",
    "description": "A growing number of TikTok videos are expressing concern about the future of married women's right to vote in America.\n\n\n\"Me showing up to the 2028 polls as the only woman in my family who can vote because I'm the raging liberal who didn't take my husband's l…",
    "link": "https://www.dailydot.com/debug/save-act-married-women-voting/",
    "timestamp": "2025-02-12T20:31:01Z"
  },
  {
    "title": "Three Trump Policies That Have Americans Rethinking Their Retirement",
    "description": "President Trump's economic strategies are reshaping retirement planning for many Americans, particularly through tariffs, currency valuation, and interest rates. Understand how these policies are influencing investment choices today.\nThe post Three Trump Poli…",
    "link": "https://www.thegatewaypundit.com/2025/02/three-trump-policies-that-have-americans-rethinking-their/",
    "timestamp": "2025-02-12T20:30:52Z"
  },
  {
    "title": "APS transgender policy faces dilemma after change in athletic league’s rules",
    "description": "A major policy shift by the Virginia High School League (VHSL) could impact how Arlington Public Schools approaches transgender athletes. VHSL announced this week that it will follow an executive order from President Donald Trump that attempts to ban students…",
    "link": "https://www.arlnow.com/2025/02/12/aps-transgender-policy-faces-dilemma-after-change-in-athletic-leagues-rules/",
    "timestamp": "2025-02-12T20:30:16Z"
  },
  {
    "title": "New Bird Flu Strain in Cows and Animal Infections Raise Concern for Human Exposure",
    "description": "Scientists have reported a new strain of bird flu in Nevada dairy cattle. And viral spread in pet cats has fueled worries over increased risk of exposure to humans",
    "link": "https://www.scientificamerican.com/article/new-bird-flu-strain-in-cows-and-animal-infections-raise-concern-for-human/",
    "timestamp": "2025-02-12T20:30:00Z"
  },
  {
    "title": "Trump Speaks to Putin and Zelensky About Striking Peace Deal in Russia-Ukraine War",
    "description": "President Donald Trump spoke with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky on Wednesday as he looks to wind down the war between their nations. \nThe post Trump Speaks to Putin and Zelensky About Striking Peace Deal in Russia…",
    "link": "https://www.breitbart.com/politics/2025/02/12/trump-speaks-putin-zelensky-about-striking-peace-deal-russia-ukraine-war/",
    "timestamp": "2025-02-12T20:29:54Z"
  },
  {
    "title": "Grimes Reacts to Ex Elon Musk Parading Their Son X Æ A-12 at White House",
    "description": "Grimes is condemning her ex Elon Musk in a new post on Twitter/X. The 36-year-old singer responded to a comment someone made about their son X Æ A-12, 4, being on good behavior during a visit and press briefing in the White House’s Oval Office with Elon and P…",
    "link": "https://www.justjared.com/2025/02/12/grimes-reacts-to-ex-elon-musk-parading-their-son-x-ae-a-12-at-white-house/",
    "timestamp": "2025-02-12T20:29:52Z"
  },
  {
    "title": "Elon Claimed DOGE.gov Was Filled With Information About His Accomplishments, When In Reality It Was Completely Blank",
    "description": "404 Error Elon Musk's Department of Government Efficiency (DOGE) is off to a strange start, to say the least. Hoping to clear the air yesterday, Musk and Donald Trump responded to criticism of doge head-on in a ridiculously uncomfortable press conference. Fla…",
    "link": "https://futurism.com/the-byte/musk-doge-transparency",
    "timestamp": "2025-02-12T20:28:59Z"
  },
  {
    "title": "Modi-Trump meeting: What’s at stake for India in this MAGA-infused visit?",
    "description": "Prime Minister Narendra Modi arrives in Washington for a high-wire diplomatic visit, balancing India’s economic interests and strategic autonomy against a US driven by President Donald Trump’s “America First” agenda. Key discussions will cover trade, immigrat…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/modi-trump-meeting-whats-at-stake-for-india-in-this-maga-infused-visit/articleshow/118190584.cms",
    "timestamp": "2025-02-12T20:28:16Z"
  },
  {
    "title": "Kennedy one step closer to confirmation as health secretary after Senate vote",
    "description": "Robert F. Kennedy Jr., a known vaccine critic, moved one step closer to becoming the nation’s health secretary Wednesday.",
    "link": "https://www.boston.com/news/politics/2025/02/12/kennedy-one-step-closer-to-confirmation-as-health-secretary-after-senate-vote/",
    "timestamp": "2025-02-12T20:27:46Z"
  },
  {
    "title": "By axing Alvin Bragg, Hochul can sweeten deal with Trump AND serve the city’s safety",
    "description": "Gov. Hochul should fire Alvin Bragg because he is bad at his job and loves criminals.",
    "link": "https://nypost.com/2025/02/12/opinion/by-axing-alvin-bragg-hochul-can-sweeten-deal-with-trump-and-serve-the-citys-safety/",
    "timestamp": "2025-02-12T20:27:46Z"
  },
  {
    "title": "Eby says U.S. economic integration 'last thing' B.C. wants, ahead of White House trip",
    "description": "British Columbia Premier David Eby says \"the last thing\" the province is considering is further economic integration with the United States, as he and other premiers prepare for a White House meeting with President Donald Trump's advisers.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/eby-us-tariffs-white-house-trip-1.7457498",
    "timestamp": "2025-02-12T20:26:01Z"
  },
  {
    "title": "Exclusive: Gabbard to meet with US allies in Munich on first trip as DNI",
    "description": "During her first full day as director of national intelligence, Tulsi Gabbard will meet with U.S. allies at the Munich Security Conference.",
    "link": "https://abcnews.go.com/Politics/exclusive-gabbard-meet-us-allies-munich-trip-dni/story?id=118737473",
    "timestamp": "2025-02-12T20:25:59Z"
  },
  {
    "title": "Grimes says son X Æ A-XII ‘should not be in the public like this’ after ex Elon Musk brings him to White House",
    "description": "On Tuesday, Musk brought the 4-year-old to a press conference in Oval Office with President Donald Trump before he signed an executive order slashing federal jobs.",
    "link": "https://pagesix.com/2025/02/12/parents/grimes-does-not-want-son-in-the-public-after-white-house-appearance-with-dad-elon-musk/",
    "timestamp": "2025-02-12T20:24:46Z"
  },
  {
    "title": "Trump Mocked After Blaming Bad Inflation Report On Biden",
    "description": "One social media user noted that Trump also took credit when the stock market was up under Biden, and asked, “How does anyone take this guy seriously?”",
    "link": "https://www.huffpost.com/entry/trump-mocked-for-blaming-bad-inflation-report-on-biden_n_67ace219e4b0239406decef9",
    "timestamp": "2025-02-12T20:24:09Z"
  },
  {
    "title": "How America's chief consumer-protection agency came into the Trump administration's crosshairs",
    "description": "When the Consumer Financial Protection Bureau made an appearance in the Heritage Foundation’s Project 2025 blueprint, the conservative group’s plan was simple: Abolish it entirely.",
    "link": "https://www.nbcnews.com/business/business-news/how-cfpb-came-under-trump-administration-attack-what-to-know-rcna191483",
    "timestamp": "2025-02-12T20:24:05Z"
  },
  {
    "title": "FRANKSPEECH NETWORK, INC further known as Mike Lindell Media Corp. (OTC Pink “FSBN”) Announces America's Mayor, Rudolph \"Rudy\" Giuliani Added to the Company Board of Directors.",
    "description": "Mayor Rudy Giuliani Has Accepted a Director Position with FrankSpeech Network, Inc. Further Known as Mike Lindell Media Corp. (OTC:PINK FSBN) Mayor Rudy Giuliani Has Accepted a Director Position with FrankSpeech Network, Inc. Further Known as Mike Lindell Med…",
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3025380/0/en/FRANKSPEECH-NETWORK-INC-further-known-as-Mike-Lindell-Media-Corp-OTC-Pink-FSBN-Announces-America-s-Mayor-Rudolph-Rudy-Giuliani-Added-to-the-Company-Board-of-Directors.html",
    "timestamp": "2025-02-12T20:24:00Z"
  }
]