[
  {
    "title": "Who will the key ministers be in Germany's next government?",
    "description": "Germany came a step closer to having a new government next month after the CDU/CSU and SPD finalised their coalition deal on Wednesday. Here's a look of some of the politicians tipped to take the top jobs.",
    "link": "https://www.thelocal.de/20250410/who-will-the-key-ministers-be-in-germanys-next-government",
    "timestamp": "2025-04-10T07:54:08Z"
  },
  {
    "title": "Yuan Sinks to 17-year Low as Trump Excludes China From Tariffs Pause",
    "description": "President Donald Trump also cranked up his tariff on Chinese goods imports to 125 percent.",
    "link": "https://www.newsweek.com/yuan-usd-trump-china-tariffs-pause-2057799",
    "timestamp": "2025-04-10T07:53:42Z"
  },
  {
    "title": "Selected Articles: The Tariff War: First Step Towards a Slave Society",
    "description": "The Tariff War: First Step Towards a Slave Society. Emanuel Pastreich\nBy Emanuel Pastreich, April 09, 2025\nThe imposition of these tariffs will cause damage to the economies off all nations of the world. It is best seen as …\nThe post Selected Articles: The Ta…",
    "link": "https://www.globalresearch.ca/selected-articles-tariff-war-first-step-slave-society/5884116",
    "timestamp": "2025-04-10T07:53:33Z"
  },
  {
    "title": "AI surge to double data center electricity demand by 2030, report says",
    "description": "AI can also unlock opportunities to produce and consume electricity more efficiently, the International Energy Agency said in its first report on the technology's implications.",
    "link": "https://www.japantimes.co.jp/environment/2025/04/10/ai-data-center-electricity/",
    "timestamp": "2025-04-10T07:53:00Z"
  },
  {
    "title": "The bond market humbles Donald Trump - Financial Times",
    "description": "The bond market humbles Donald TrumpFinancial Times Sell-Off in U.S. Bonds and Dollar Raises Questions About ‘Safe Haven’ StatusThe New York Times Trump’s tariffs pushed the U.S. uncomfortably close to a financial crisis before pauseThe Washington Post Why th…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176991983",
    "timestamp": "2025-04-10T07:52:33Z"
  },
  {
    "title": "Don't give special treatment, biryani to Tahawwur Rana: Tea seller who helped 26/11 victims",
    "description": "Mohammed Taufiq, a tea seller who aided many during the 2008 Mumbai attacks, urges no special treatment for Tahawwur Rana, demanding his execution. Recounting the horrors he witnessed at CSMT, Taufiq seeks stricter anti-terror laws.",
    "link": "https://economictimes.indiatimes.com/news/india/dont-give-special-treatment-biryani-to-rana-tea-seller-who-helped-26/11-victims/articleshow/120151243.cms",
    "timestamp": "2025-04-10T07:51:28Z"
  },
  {
    "title": "Thailand says US tariff talks to factor in high Chinese levy",
    "description": "<p><strong>Thailand&rsquo;s tariff talks</strong> with the Trump administration will factor in the impact of the high taxes slapped on <strong>China</strong> as local producers fret over the risk of an increase in the influx of cheap imports from the Asian ne…",
    "link": "https://www.bangkokpost.com/business/general/3000357/thailand-says-us-tariff-talks-to-factor-in-high-chinese-levy",
    "timestamp": "2025-04-10T07:51:00Z"
  },
  {
    "title": "Trump’s tariff: Negotiations could take longer for smaller economies, says Lao Minister",
    "description": "KUALA LUMPUR: Negotiations with the United States on tariffs could take longer than expected, says Lao Deputy Finance Minister, Soulivath Souvannachoumkham. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/10/trumps-tariff-negotiations-could-take-longer-for-smaller-economies-says-lao-minister",
    "timestamp": "2025-04-10T07:50:00Z"
  },
  {
    "title": "Ray Dalio says Trump should negotiate a 'win-win' trade deal with China",
    "description": "The Bridgewater founder also advised investors to rethink their risk appetite after U.S. tariffs policies sparked wild swings in financial markets.",
    "link": "https://www.cnbc.com/2025/04/10/ray-dalio-trump-must-negotiate-trade-with-china.html",
    "timestamp": "2025-04-10T07:49:06Z"
  },
  {
    "title": "LVMH finds making Louis Vuitton bags messy in Texas",
    "description": "Louis Vuitton's Texas factory, inaugurated with fanfare by Bernard Arnault and Donald Trump, has struggled with production due to a shortage of skilled labor and high waste. Despite tax breaks and promises of numerous jobs, the plant has underperformed, leadi…",
    "link": "https://economictimes.indiatimes.com/news/international/business/lvmh-finds-making-louis-vuitton-bags-messy-in-texas/articleshow/120151166.cms",
    "timestamp": "2025-04-10T07:48:12Z"
  },
  {
    "title": "Bitcoin drawdown widened to 27% near FTX levels amid US-China trade tensions",
    "description": "Bitcoin has endured its most significant drop since the collapse of FTX in late 2022, with market pressure mounting due to escalating global tariff disputes. While markets have taken a breather after Donald Trump announced a 90-day pause on reciprocal tariffs…",
    "link": "https://cryptoslate.com/insights/bitcoin-drawdown-widened-to-27-near-ftx-levels-amid-escalating-us-china-trade-tensions/",
    "timestamp": "2025-04-10T07:47:30Z"
  },
  {
    "title": "How Trump changed his mind on tariffs",
    "description": "\"Liberation Day\" just gave way to Capitulation Day.",
    "link": "https://news.sky.com/story/how-us-president-donald-trump-changed-his-mind-on-tariffs-13345606",
    "timestamp": "2025-04-10T07:46:00Z"
  },
  {
    "title": "EU chief welcomes Trump's tariff pause but is quiet about the bloc's own retaliatory duty plan",
    "description": "European Commission President Ursula von der Leyen on Thursday welcomed President Donald Trump’s decision to temporarily halt most U.S. tariffs, but she did ...",
    "link": "https://finance.yahoo.com/news/eu-chief-welcomes-trumps-tariff-074431156.html",
    "timestamp": "2025-04-10T07:44:31Z"
  },
  {
    "title": "Trump keeps tariff pressure on China, EU welcomes pause",
    "description": "What you need to know\nUS President Donald Trump has abruptly backed down on tariffs on most nations for 90 days. China has not been afforded such respite.\nAfter Beijing slapped an 84% tariff on US goods, Trump responded by announcing a 125% levy on Chinese im…",
    "link": "https://biztoc.com/x/f636d219e4bf5a55",
    "timestamp": "2025-04-10T07:43:41Z"
  },
  {
    "title": "Cryptocurrencies and Crypto-Related Stocks Rise After Trump Pauses Tariffs",
    "description": "The prices of cryptocurrencies and crypto-related stocks leapt Wednesday (April 9) after President Donald Trump paused the new tariffs that he had placed on more than 75 countries.\nAs of 2:55 p.m. ET, bitcoin’s price had surged 7.6% over the previous 24 hours…",
    "link": "https://biztoc.com/x/89772110df88cb62",
    "timestamp": "2025-04-10T07:43:32Z"
  },
  {
    "title": "\"Back On Track\": Friedrich Merz Seals Coalition Deal To Lead Germany",
    "description": "Friedrich Merz is set to take over as leader of Europe&#039;s top economy just as US President Donald Trump has sparked global trade turmoil.",
    "link": "https://www.ndtv.com/world-news/friedrich-merz-seals-coalition-deal-to-lead-germany-back-on-track-8131133",
    "timestamp": "2025-04-10T07:43:01Z"
  },
  {
    "title": "How ‘scary market freak out’ forced Donald Trump to cave in on tariffs",
    "description": "President Donald Trump is driving the US economy into a recession. The early signs are already apparent with autoworker layoffs in Indiana and Michigan, a stock market sell-off in recent days and Americans pulling back on spending. But as Trump’s tariffs took…",
    "link": "https://www.independent.ie/world-news/north-america/how-scary-market-freak-out-forced-donald-trump-to-cave-in-on-tariffs/a1156567294.html",
    "timestamp": "2025-04-10T07:42:53Z"
  },
  {
    "title": "Activists pour hundreds of litres of blood-red dye into US Embassy pond in protest against arms sales to Israel",
    "description": "Activists from Greenpeace UK have poured 300 litres of blood-red dye into the US embassy pond to highlight the death and devastation caused in Gaza as a direct result of the US’ continued sale of weapons to Israel. Photos and videos available here Twelve acti…",
    "link": "https://www.greenpeace.org.uk/news/activists-pour-hundreds-of-litres-of-blood-red-dye-into-us-embassy-pond-in-protest-against-arms-sales-to-israel/",
    "timestamp": "2025-04-10T07:40:56Z"
  },
  {
    "title": "ASEAN bloc seeks dialogue with US on tariffs but won't retaliate",
    "description": "KUALA LUMPUR — Southeast Asian countries are pressing for dialogue with the United States on trade tariffs and will not impose retaliatory measures,",
    "link": "https://interaksyon.philstar.com/business/2025/04/10/294701/asean-bloc-seeks-dialogue-with-us-on-tariffs-but-wont-retaliate/",
    "timestamp": "2025-04-10T07:40:54Z"
  },
  {
    "title": "'Irony Meter Is Dead': Trump Accidentally Roasts Himself With Oval Office Question",
    "description": "The president's question about being \"stupid\" went awry on social media.",
    "link": "https://www.huffpost.com/entry/donald-trump-oval-office-question_n_67f76b71e4b0eac07502aead",
    "timestamp": "2025-04-10T07:40:02Z"
  },
  {
    "title": "Trump hikes China tariffs from 104% to 125% despite global pause for three months",
    "description": "President Donald Trump announced a complete three-month pause on all the “reciprocal” tariffs that went into effect at midnight, with the exception of China, a stunning reversal from a president who had insisted historically high tariffs were...",
    "link": "https://www.ghanaweb.com/GhanaHomePage/business/Trump-hikes-China-tariffs-from-104-to-125-despite-global-pause-for-three-months-1979261",
    "timestamp": "2025-04-10T07:37:49Z"
  },
  {
    "title": "Crypto Investors Flee Spot Bitcoin, Ether ETFs on Tariff-Driven Uncertainty",
    "description": "The withdrawals took place even as prices zoomed higher alongside a risk-reset on Wall Street.",
    "link": "https://www.coindesk.com/markets/2025/04/10/crypto-investors-flee-spot-bitcoin-ether-etfs-on-tariff-driven-uncertainty",
    "timestamp": "2025-04-10T07:36:42Z"
  },
  {
    "title": "Trump-backed bill to stop 'rogue' judges passes House",
    "description": "The House of Representatives passed a bill Wednesday to limit federal district judges' ability to affect Trump administration policies on a national scale. The No Rogue Rulings Act, led by Rep. Darrell Issa, R-Calif., passed the House and limits district cour…",
    "link": "https://freerepublic.com/focus/f-news/4310108/posts",
    "timestamp": "2025-04-10T07:36:40Z"
  },
  {
    "title": "Harris flies into 'fluid' situation in US but says tariff pause provides 'space for negotiation'",
    "description": "An Tánaiste said the trip was ‘timely’ as it coincided with Trump’s tariff pause yesterday evening.",
    "link": "https://www.thejournal.ie/simon-harris-washington-6673968-Apr2025/",
    "timestamp": "2025-04-10T07:34:05Z"
  },
  {
    "title": "'Like egrets and water buffalo': Startup founder says US-China trade war too shall be solved soon",
    "description": "Trump's move, announced this week, shocked markets and marked a sharp escalation in the trade conflict. While the US paused tariff hikes for over 75 trading partners, citing cooperation, it singled out China for immediate action.",
    "link": "https://www.businesstoday.in/latest/economy/story/like-egrets-and-water-buffalo-startup-founder-says-us-china-trade-war-too-shall-be-solved-soon-471512-2025-04-10",
    "timestamp": "2025-04-10T07:33:51Z"
  },
  {
    "title": "Why did Donald Trump buckle?",
    "description": "The market turmoil and pressure from Wall Street to Capitol Hill proved too much for the US president",
    "link": "https://www.irishtimes.com/business/2025/04/10/why-did-donald-trump-buckle/",
    "timestamp": "2025-04-10T07:30:39Z"
  },
  {
    "title": "European Stocks Jump Most in Five Years on Trump Tariff Reprieve",
    "description": "European stocks rallied after US President Donald Trump paused plans to implement higher reciprocal tariffs on dozens of trade partners, easing concerns about a global trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/european-stocks-jump-most-in-five-years-on-trump-tariff-reprieve",
    "timestamp": "2025-04-10T07:29:19Z"
  },
  {
    "title": "Israel-Gaza protest at the US embassy: what you need to know",
    "description": "Activists from Greenpeace UK have poured blood-red dye into the pond at the US embassy in London, in a protest against weapons sales to Israel.\nThe post Israel-Gaza protest at the US embassy: what you need to know appeared first on Greenpeace UK.",
    "link": "https://www.greenpeace.org.uk/news/israel-gaza-protest-us-embassy/",
    "timestamp": "2025-04-10T07:27:41Z"
  },
  {
    "title": "Trump tariffs spark US government debt sell-off",
    "description": "Confidence in the US economy is plummeting as investors dumped government debt amid growing concerns over the impact of Donald Trump’s tariffs. On Wednesday, the yield – or interest rate – on US bonds spiked sharply to touch the highest level since February a…",
    "link": "https://thechronicle.com.gh/trump-tariffs-spark-us-government-debt-sell-off/",
    "timestamp": "2025-04-10T07:24:25Z"
  },
  {
    "title": "Von der Leyen welcomes Trump’s tariff U-turn",
    "description": "Europe exhales as U.S. president hits pause button on most severe tariff regime.",
    "link": "https://www.politico.eu/article/von-der-leyen-welcomes-trumps-90-day-pause-on-tariffs/",
    "timestamp": "2025-04-10T07:23:17Z"
  },
  {
    "title": "SPY, QQQ Call Volumes Spiked Minutes Before Tariff Pause Announcement: Alexandria Ocasio-Cortez Demands Disclosure From Congress Members",
    "description": "Alexandria Ocasio-Cortez (D-N.Y.) has called for a disclosure by Congress members after observing that the Nasdaq call volume spiked minutes before President Donald Trump‘s announcement on a tariff pause.\nWhat Happened: Trump announced a pause in the tariffs …",
    "link": "https://biztoc.com/x/29da7d44669387e7",
    "timestamp": "2025-04-10T07:21:55Z"
  },
  {
    "title": "LVMH finds making Louis Vuitton bags messy in Texas",
    "description": "Six years ago, LVMH's billionaire CEO Bernard Arnault and President Donald Trump cut the blue ribbon on a factory in rural Texas that would make designer handbags for Louis Vuitton, one of the world’s best-known luxury brands.\nBut since the high-profile openi…",
    "link": "https://biztoc.com/x/2421ef9fe249b37b",
    "timestamp": "2025-04-10T07:21:37Z"
  },
  {
    "title": "Trump Says 'This Is A Great Time To Buy,' But Portfolio Managers Give A Reality Check: 'Permanent Damage Has Been Done'",
    "description": "President Donald Trump indicated a more lenient approach to his trade agenda on Wednesday, leading to a significant rally in the stock market, but portfolio managers and analysts aren’t fully convinced.\nWhat Happened: Investors had been anxious about the esca…",
    "link": "https://biztoc.com/x/249f5c7531c245e0",
    "timestamp": "2025-04-10T07:21:34Z"
  },
  {
    "title": "Finnish foreign minister Valtonen in US to meet Marco Rubio",
    "description": "Minister Elina Valtonen and US Secretary of State Rubio are scheduled to discuss bilateral relations, Russia's war in Ukraine as well as Euro-Atlantic security.",
    "link": "https://yle.fi/a/74-20155120",
    "timestamp": "2025-04-10T07:17:26Z"
  },
  {
    "title": "Trump-Xi potential showdown on cards as US targets China alone in tariff war",
    "description": "US President Trump's tariff U-turn isolates China, escalating trade tensions as US tariffs on Chinese imports surge. This move pressures China's economy, prompting revised growth forecasts and defensive strategies from Beijing, including seeking alliances and…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-xi-potential-showdown-on-cards-as-us-targets-china-alone-in-tariff-war/articleshow/120149877.cms",
    "timestamp": "2025-04-10T07:16:25Z"
  },
  {
    "title": "Pentagon chief Pete Hegseth says US could 'revive' Panama bases",
    "description": "US Defense Secretary Pete Hegseth's suggestion of re-establishing US military presence in Panama to secure the canal was swiftly rejected by the Panamanian government. Hegseth cited concerns over China's growing influence and sought preferential treatment for…",
    "link": "https://economictimes.indiatimes.com/news/defence/pentagon-chief-pete-hegseth-says-us-could-revive-panama-bases/articleshow/120150520.cms",
    "timestamp": "2025-04-10T07:14:35Z"
  },
  {
    "title": "Trump's 'buy' tip on social media before tariffs pause made money for investors",
    "description": "President Donald Trump offered some financial advice on Wednesday morning that ended up making a lot of money for any lucky investor who listened to him",
    "link": "https://abcnews.go.com/Technology/wireStory/trumps-buy-tip-social-media-tariffs-pause-made-120661711",
    "timestamp": "2025-04-10T07:14:33Z"
  },
  {
    "title": "Trump tariffs latest: Pause sees stock markets surge but 125% measure against China takes effect",
    "description": "Despite 90-day ceaasfire in trade war deep uncertainty continues to spook the global economy, financial markets and US trading partners",
    "link": "https://www.irishtimes.com/business/economy/2025/04/10/donald-trump-tariff-latest-updates-china-stock-markets/",
    "timestamp": "2025-04-10T07:14:11Z"
  },
  {
    "title": "DOGE Cuts Update Today: Over a Dozen Buildings Sold Off",
    "description": "The General Services Administration has sold 13 federal properties, according to the Department of Government Efficiency.",
    "link": "https://www.newsweek.com/doge-cuts-update-buildings-sold-off-2057360",
    "timestamp": "2025-04-10T07:14:09Z"
  },
  {
    "title": "New Aer Lingus route to Nashville flies into trade storm",
    "description": "Service set to kick off while US relations with rest of world are at a low point",
    "link": "https://www.irishtimes.com/transport/2025/04/10/new-aer-lingus-route-to-nashville-flies-into-trade-storm/",
    "timestamp": "2025-04-10T07:12:42Z"
  },
  {
    "title": "Trump Tariffs Wiped $10 Trillion From Stock Markets. It's 50% Of EU Economy",
    "description": "The stock market rout triggered by US President Donald Trump&#039;s punishing tariff wars wiped over $10 trillion off major markets across the globe.",
    "link": "https://www.ndtv.com/world-news/donald-trump-tariff-chaos-wiped-10-trillion-from-stock-markets-losses-equal-50-percent-of-eus-economy-8130946",
    "timestamp": "2025-04-10T07:12:36Z"
  },
  {
    "title": "Taiwan’s TSMC says first quarter revenue up 42 percent",
    "description": "Taiwanese chipmaking giant TSMC reported Thursday a better-than-expected revenue for the first quarter on strong demand for AI technology, after tariffs slapped onto major economies by US President Donald Trump caused global uncertainty. Taiwan Semiconductor …",
    "link": "https://www.digitaljournal.com/world/taiwans-tsmc-says-first-quarter-revenue-up-42-percent/article",
    "timestamp": "2025-04-10T07:12:35Z"
  },
  {
    "title": "Taiwan's TSMC Says First Quarter Revenue Up 42 Percent",
    "description": "Taiwanese chipmaking giant TSMC reported Thursday a better-than-expected revenue for the first quarter on strong demand for AI technology, after tariffs slapped onto major economies by US President Donald Trump caused global uncertainty.",
    "link": "https://www.ibtimes.com/taiwans-tsmc-says-first-quarter-revenue-42-percent-3769544",
    "timestamp": "2025-04-10T07:12:20Z"
  },
  {
    "title": "EU Chief Welcomes Trump Tariffs Pause, But Still Looking to Trade Elsewhere",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nEuropean Commission President Ursula von der Leyen welcomed President Donald Trump's 90-day pause on his tariffs, and said the EU is committed to working towards \"frictionless\" trade with the U.S.\nBut she made…",
    "link": "https://biztoc.com/x/4b62d684e129df68",
    "timestamp": "2025-04-10T07:10:44Z"
  },
  {
    "title": "Europe opens higher, DAX, EURO STOXX soar 8%",
    "description": "European markets soared on Thursday, lifted by signs of easing trade tensions after US President Donald Trump delayed the introduction of new tariffs for some countries by three months. The move mirro...",
    "link": "https://biztoc.com/x/dca8798906062710",
    "timestamp": "2025-04-10T07:10:40Z"
  },
  {
    "title": "Oaktree's Howard Marks warns the trade war risks the US's 'golden credit card'",
    "description": "The US has relied on its 'golden credit card' to run fiscal deficits for decades, the Oaktree cofounder wrote.",
    "link": "https://www.businessinsider.com/oaktree-howard-marks-trump-trade-tariff-war-national-debt-treasurys-2025-4",
    "timestamp": "2025-04-10T07:10:10Z"
  },
  {
    "title": "Spain’s Premier Says US Tariff Pause Opens Door to Bargaining",
    "description": "Spanish Prime Minister Pedro Sanchez said the US decision to pause a round of global tariffs can serve as a way to open “a door to negotiation” and therefore could lead to an agreement.",
    "link": "https://financialpost.com/pmn/business-pmn/spains-premier-says-us-tariff-pause-opens-door-to-bargaining",
    "timestamp": "2025-04-10T07:08:58Z"
  },
  {
    "title": "Tariffs could deeply impact prescription drug prices: What to know",
    "description": "Among other ramifications, tariffs would exasperate medication shortages because many cheaper generic drugs are produced in places like India and Ireland where…",
    "link": "https://www.nbcnewyork.com/news/health/tariffs-impact-costs-prescription-drugs-what-to-know/6219515/",
    "timestamp": "2025-04-10T07:08:53Z"
  },
  {
    "title": "Trump keeps tariff pressure on China, EU welcomes pause",
    "description": "Markets breathed a sign of relief after Trump's tariff reprieve. However, a US trade war with China looms, as the world's two largest economies engage in tit-for-tat retaliation.",
    "link": "https://www.dw.com/en/trump-keeps-tariff-pressure-on-china-eu-welcomes-pause/live-72194124",
    "timestamp": "2025-04-10T07:08:00Z"
  },
  {
    "title": "LVMH finds making Louis Vuitton bags messy in Texas",
    "description": "Former staff say Louis Vuitton’s Texas plant wastes up to 40% of leather and encouraged defect coverups to hit targets.",
    "link": "https://www.japantimes.co.jp/business/2025/04/10/companies/lvmh-louis-vuitton-bags-texas/",
    "timestamp": "2025-04-10T07:07:00Z"
  },
  {
    "title": "Here are the top 10 ASX 200 shares today",
    "description": "It was once again back to the races for investors today. \nThe post Here are the top 10 ASX 200 shares today appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/10/here-are-the-top-10-asx-200-shares-today-10-april-2025/",
    "timestamp": "2025-04-10T07:06:27Z"
  },
  {
    "title": "Schiff wants to know if anyone in the White House profited off of Trump's tariff pause announcement",
    "description": "The stock market rebounded after President Donald Trump's Thursday announcement about a tariff pause for many countries.",
    "link": "https://www.businessinsider.com/schiff-white-house-profit-from-trump-tariff-pause-2025-4",
    "timestamp": "2025-04-10T07:04:59Z"
  },
  {
    "title": "Billionaire Ray Dalio Says He’s ‘Very Concerned’ About Trump Tariffs, Predicts Worldwide Economic Slowdown",
    "description": "Iconic investor Ray Dalio is warning that US President Donald Trump’s tariff policies may cause a global economic slowdown. In a new interview on CNBC, the Bridgewater Associates founder says he has serious concerns that increasing tariffs may wreak macroecon…",
    "link": "https://dailyhodl.com/2025/04/10/billionaire-ray-dalio-says-hes-very-concerned-about-trump-tariffs-predicts-worldwide-economic-slowdown/",
    "timestamp": "2025-04-10T07:04:38Z"
  },
  {
    "title": "AI surge to double data centre electricity demand by 2030: IEA",
    "description": "Electricity consumption by data centres will more than double by 2030, driven by artificial intelligence applications that will create new challenges for energy security and CO2 emission goals, the IEA said Thursday. According to the IEA, data centre electric…",
    "link": "https://economictimes.indiatimes.com/tech/technology/ai-surge-to-double-data-centre-electricity-demand-by-2030-iea/articleshow/120150317.cms",
    "timestamp": "2025-04-10T07:04:15Z"
  },
  {
    "title": "How Trump's TikTok negotiations were upended by China and tariffs",
    "description": "Under the plan, new investors would own 50% of a new American TikTok entity, while Chinese owners would retain less than 20%, the limit specified by the law. ByteDance told the White House that Beijing was comfortable with the general structure.",
    "link": "https://economictimes.indiatimes.com/tech/technology/how-trumps-tiktok-negotiations-were-upended-by-china-and-tariffs/articleshow/120150221.cms",
    "timestamp": "2025-04-10T07:02:12Z"
  },
  {
    "title": "EU Chief Welcomes Trump Tariffs Pause, But Still Looking to Trade Elsewhere",
    "description": "Ursula von der Leyen made clear the EU sees its trading future as largely outside of the U.S.",
    "link": "https://www.newsweek.com/eu-trump-tariffs-pause-trade-us-2057777",
    "timestamp": "2025-04-10T07:02:04Z"
  },
  {
    "title": "Bitcoin to hit $250,000 this year and Magnificent 7 to adopt stablecoins, Cardano founder predicts",
    "description": "Bitcoin could hit $250,000 as early as this year, Cardano blockchain founder Charles Hoskinson told CNBC's \"Beyond The Valley\" podcast.",
    "link": "https://www.cnbc.com/2025/04/10/bitcoin-to-hit-250000-mag-7-adopt-stablecoins-charles-hoskinson.html",
    "timestamp": "2025-04-10T07:01:27Z"
  },
  {
    "title": "TSMC's first-quarter revenue surges 42%, slightly ahead of forecasts",
    "description": "Revenue for January-March came in at T$839.3 billion ($25.6 billion), Taiwan Semiconductor Manufacturing Co said in a brief statement.",
    "link": "https://economictimes.indiatimes.com/tech/technology/tsmcs-first-quarter-revenue-surges-42-slightly-ahead-of-forecasts/articleshow/120150170.cms",
    "timestamp": "2025-04-10T07:00:38Z"
  },
  {
    "title": "Bennett to Pro-Palestinian Heckler: Time You Stopped Whining and Started Building",
    "description": "Former Israeli Prime Minister Naftali Bennett told a pro-Palestinian heckler at Princeton University on Wednesday that it was time that Palestinians stopped \"whining\" and trying to kill Jews, started trying to build a better future instead.\nThe post Bennett t…",
    "link": "https://www.breitbart.com/education/2025/04/10/bennett-to-pro-palestinian-heckler-time-you-stopped-whining-and-started-building/",
    "timestamp": "2025-04-10T07:00:37Z"
  },
  {
    "title": "Peter Schiff slams Trump’s Bitcoin Reserve – ‘Gold would have been a better bet!’",
    "description": "Crypto community fired back at Schiff, dismissing his gold-first argument.",
    "link": "https://ambcrypto.com/peter-schiff-slams-trumps-bitcoin-reserve-gold-would-have-been-a-better-bet/",
    "timestamp": "2025-04-10T07:00:33Z"
  },
  {
    "title": "Schiff: Trump Should Be Investigated for Insider Trading",
    "description": "Some Democrats are calling foul on President Trump's abrupt tariff pause, which caused stock prices to soar —days after the announcement of the tariffs led to the worst market plunge in years . Sen. Adam Schiff of California called on Congress to investigate …",
    "link": "https://www.newser.com/story/366967/schiff-trump-should-be-investigated-for-insider-trading.html",
    "timestamp": "2025-04-10T07:00:00Z"
  },
  {
    "title": "Community Colleges Make Difficult Calls and Cuts Under Trump",
    "description": "Community Colleges Make Difficult Calls and Cuts Under Trump\n\n \n\n\n \nSara Weissman\n\nThu, 04/10/2025 - 03:00 AM\n\nSome community colleges have stripped back DEI programming and made other cuts under federal and state pressures.\n \n Byline(s)\r\n\n \n Sara Weissman",
    "link": "https://www.insidehighered.com/news/institutions/community-colleges/2025/04/10/community-colleges-make-difficult-cuts-under-trump",
    "timestamp": "2025-04-10T07:00:00Z"
  },
  {
    "title": "NSF, NIH Slash Support for Early-Career Scientists",
    "description": "Both the National Science Foundation and the National Institutes of Health are slashing funding support for graduate students and early-career researchers as President Donald Trump continues dramatic federal budget cuts.",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/04/10/nsf-nih-slash-support-early-career-scientists",
    "timestamp": "2025-04-10T07:00:00Z"
  },
  {
    "title": "Donald Trump explains decision to pause US tariffs for 90 days - video",
    "description": "Donald Trump discussed his decision to pause tariffs during an event in front of the White House, saying he thought people were 'getting yippy' and a 'little queasy' so he decided to enact the 90-day pause. The US president also said he would raise the tariff…",
    "link": "https://biztoc.com/x/70951ff34ac47f5a",
    "timestamp": "2025-04-10T06:59:46Z"
  },
  {
    "title": "TSMC sales beat estimates amid AI demand ahead of US tariffs",
    "description": "The main chipmaker for Apple and Nvidia faces threats by US President Donald Trump to slap tariffs on semiconductor imports.",
    "link": "https://biztoc.com/x/ad0d9c61594199ef",
    "timestamp": "2025-04-10T06:59:45Z"
  },
  {
    "title": "Trump's new energy order puts states' climate laws in the crosshairs of the Department of Justice",
    "description": "A new executive order from President Donald Trump that's part of his effort to invigorate energy production launches the possibility that his Department of Justice will go to court against state laws aimed at slashing planet-warming greenhouse gas poll...",
    "link": "https://biztoc.com/x/0454e01a9b198edf",
    "timestamp": "2025-04-10T06:59:35Z"
  },
  {
    "title": "Japan says 90-day reprieve from U.S. reciprocal tariffs 'positive development'",
    "description": "U.S. President Donald Trump's decision to pause his so-called reciprocal tariffs for 90 days is a &quot;positive development,&quot; Japan's top government spokesman said Thursday, though Tokyo will continue to urge Washington to roll back other newly imposed …",
    "link": "https://japantoday.com/category/politics/Japan-says-90-day-reprieve-from-U.S.-reciprocal-tariffs-positive-development",
    "timestamp": "2025-04-10T06:59:09Z"
  },
  {
    "title": "European Gas Jumps as US Tariff Pause Eases Demand Concerns",
    "description": "European natural gas prices rebounded after US President Donald Trump paused plans to implement higher reciprocal tariffs on dozens of trade partners bar China, easing concerns about an economic hit that could weigh on demand for energy.",
    "link": "https://financialpost.com/pmn/business-pmn/european-gas-jumps-as-us-tariff-pause-eases-demand-concerns",
    "timestamp": "2025-04-10T06:58:49Z"
  },
  {
    "title": "Why Trump decided to take the win and paused tariff war",
    "description": "Donald Trump finally decided to take the proverbial “win” on trade and the stock market rallied nearly 3,000 points. You can thank the bond market, with an assist from Treasury Secretary Scott Bessent, for making it happen. We have been hyper-focused on how t…",
    "link": "https://freerepublic.com/focus/f-news/4310107/posts",
    "timestamp": "2025-04-10T06:58:22Z"
  },
  {
    "title": "PM tries to win over Queensland with a little help from Tom Cruise",
    "description": "The prime minister tried to turn around Labor's fortunes in Queensland, the opposition leader visited a must-win Melbourne seat and a deadline looms in the NSW seat of Whitlam.",
    "link": "https://www.abc.net.au/news/2025-04-10/albanese-tom-cruise-dutton-melbourne-china-federal-election/105156122",
    "timestamp": "2025-04-10T06:54:57Z"
  },
  {
    "title": "Trump renews opposition to sale of U.S. Steel to Nippon Steel",
    "description": "U.S. President Donald Trump on Wednesday renewed his opposition to the sale of United States Steel Corp to Japan's Nippon Steel Corp, as he touted his tariff plans as an effective means to revive his country's steel and other legacy industries. Calling U.S. S…",
    "link": "https://japantoday.com/category/business/update1-trump-renews-opposition-to-sale-of-u.s.-steel-to-japan%27s-nippon-steel",
    "timestamp": "2025-04-10T06:54:51Z"
  },
  {
    "title": "Asean won't retaliate to Trump tariffs",
    "description": "<p>KUALA LUMPUR &mdash; Southeast Asian countries are pressing for dialogue with the United States on trade tariffs and will not impose retaliatory measures, economic ministers of the Association of Southeast Asian Nations (Asean) stated on Thursday.</p>",
    "link": "https://www.bangkokpost.com/business/general/3000289/asean-bloc-seeks-dialogue-with-united-states-on-tariffs-but-wont-retaliate",
    "timestamp": "2025-04-10T06:54:00Z"
  },
  {
    "title": "Trump signs order to 'make America's showers great again'",
    "description": "The White House said the order \"frees Americans from excessive regulations that turned a basic household item into a bureaucratic nightmare\" and ends the \"Obama-Biden war on showers\".",
    "link": "https://www.channelnewsasia.com/world/donald-trump-executive-order-water-conservation-make-america-showers-great-again-5056806",
    "timestamp": "2025-04-10T06:54:00Z"
  },
  {
    "title": "AI surge to double data center electricity demand by 2030: IEA",
    "description": "Electricity consumption by data centers will more than double by 2030, driven by artificial intelligence applications that will create new challenges for energy security and CO2 emission goals, the IEA said Thursday.",
    "link": "https://www.hurriyetdailynews.com/ai-surge-to-double-data-center-electricity-demand-by-2030-iea-207891",
    "timestamp": "2025-04-10T06:53:11Z"
  },
  {
    "title": "Most Americans don’t want the US to conquer Gaza, Pew survey finds",
    "description": "Pew survey finds over 60% of Americans oppose Trump's Gaza plan, but 46% believe he will pursue it regardless.",
    "link": "https://www.israelnationalnews.com/news/406696",
    "timestamp": "2025-04-10T06:51:55Z"
  },
  {
    "title": "Karoline Leavitt Puts 'Laughable' Spin On Trump Tariffs Reversal, Sparks Mockery Online",
    "description": "The Trump White House press secretary's remarks were slammed as \"insane,\" \"shameful\" and more.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-donald-trump-tariff-reversal_n_67f760e3e4b07a2fc455a01e",
    "timestamp": "2025-04-10T06:51:50Z"
  },
  {
    "title": "Stock markets rally after Trump pauses most tariffs for 90 days",
    "description": "Stock markets rallied in Thursday trading in response to President Donald Trump's dramatic decision to suspend planned tariffs on most American trading partners.",
    "link": "https://abcnews.go.com/Business/stock-markets-rally-after-trump-pauses-tariffs-90/story?id=120669224",
    "timestamp": "2025-04-10T06:51:22Z"
  },
  {
    "title": "Chinese sellers on Amazon to hike prices or exit US as tariffs soar",
    "description": "Chinese companies that sell products on Amazon are preparing to hike prices for the U.S. or quit that market due to President Donald Trump's unprecedented tariff hikes.",
    "link": "https://www.citizen.digital/business/chinese-sellers-on-amazon-to-hike-prices-or-exit-us-as-tariffs-soar-n360776",
    "timestamp": "2025-04-10T06:50:56Z"
  },
  {
    "title": "AI data centre growth means more coal and gas plants, IEA says",
    "description": "Renewable supplies won’t be enough to power surge in data centre consumption",
    "link": "https://www.irishtimes.com/business/2025/04/10/ai-data-centre-growth-means-more-coal-and-gas-plants-iea-says/",
    "timestamp": "2025-04-10T06:49:24Z"
  },
  {
    "title": "Donald Trump Sends Warning to China: 'Most Powerful Weapons in the World'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump has dismissed concerns of his trade war with China escalating beyond the exchange of eye-watering tariffs, alluding to a cache of \"the most powerful weapons in the world.\"\nSpeaking …",
    "link": "https://biztoc.com/x/9e4e7f5f940a3bf2",
    "timestamp": "2025-04-10T06:48:39Z"
  },
  {
    "title": "Iran Shows Off Nuclear Advances Ahead of US Talks",
    "description": "Iran's president said nuclear achievements cannot not be compromised and the Islamic Republic does not seek weapons",
    "link": "https://www.newsweek.com/iran-nuclear-trump-technology-weapons-2057760",
    "timestamp": "2025-04-10T06:46:31Z"
  },
  {
    "title": "Donald Trump Sends Warning to China: 'Most Powerful Weapons in the World'",
    "description": "\"I think we'll end up making a very good deal for both,\" Trump told reporters in the White House on Wednesday.",
    "link": "https://www.newsweek.com/donald-trump-china-weapons-tariffs-xi-jinping-2057772",
    "timestamp": "2025-04-10T06:46:20Z"
  },
  {
    "title": "TSMCs first-quarter revenue surges 42%, slightly ahead of forecasts",
    "description": "TSMC-SALES:TSMC's first-quarter revenue surges 42%, slightly ahead of forecasts",
    "link": "https://www.livemint.com/companies/news/tsmcs-first-quarter-revenue-surges-42-slightly-ahead-of-forecasts-11744267567801.html",
    "timestamp": "2025-04-10T06:46:07Z"
  },
  {
    "title": "Auto tariffs take effect, components supply chain hit hardest",
    "description": "The US government under President Donald Trump initiated a new round of trade protection policies on April 3, 2025, imposing a 25% tariff on all automobiles produced outside the US and planning to further expand this to the automotive component supply chain s…",
    "link": "https://www.digitimes.com/news/a20250410PD209/government-donald-trump-supply-chain-exports-2024.html",
    "timestamp": "2025-04-10T06:44:56Z"
  },
  {
    "title": "Poll: Majority of Americans have unfavorable view of Israel's actions",
    "description": "Even among traditionally pro-Israel Republicans, there have been large shifts in negative sentiment amid Israel’s war on GazaHundreds demonstrate outside a New York City court to protest against the arrest and detention of Mahmoud Khalil, a Palestinian green …",
    "link": "https://i-epikaira.blogspot.com/2025/04/poll-majority-of-americans-have.html",
    "timestamp": "2025-04-10T06:44:00Z"
  },
  {
    "title": "Sarawak Tegas to help startups weather US tariff uncertainties",
    "description": "KUCHING: Tabung Ekonomi Gagasan Anak Sarawak (Tegas) says it would help start-ups under its auspices mitigate challenges from the United States' tariffs. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/10/sarawak-tegas-to-help-startups-weather-us-tariff-uncertainties",
    "timestamp": "2025-04-10T06:42:00Z"
  },
  {
    "title": "White House Says Trump's Reversal on Tariffs Was 'The Art of the Deal'",
    "description": "Trump paused most of his tariffs for 90 days—with China the big exception—amid sharp losses in the markets and fears of a recession.",
    "link": "https://www.newsweek.com/white-house-trump-tariffs-reversal-art-deal-2057775",
    "timestamp": "2025-04-10T06:40:26Z"
  },
  {
    "title": "Uniqlo operator Fast Retailing's Q2 profit jumps 33%; raises forecast",
    "description": "TOKYO: The Japanese operator of Uniqlo on Thursday (Apr 10) said earnings soared 33 per cent in its second quarter and raised its full-year forecast even after accounting for the impact of US tariffs on its global clothing enterprise. Fast Retailing said oper…",
    "link": "https://www.channelnewsasia.com/business/uniqlo-operator-fast-retailings-q2-profit-jumps-33-raises-forecast-5056801",
    "timestamp": "2025-04-10T06:40:00Z"
  },
  {
    "title": "Video shows 4 captive Ukrainian troops killed by men identified as Russian forces",
    "description": "Ukrainian drone video seen by The Associated Press shows four Ukrainian soldiers being shot to death by soldiers with Russian uniform markings in the village of Piatykhatky on March 13",
    "link": "https://abcnews.go.com/International/wireStory/video-shows-4-captive-ukrainian-troops-killed-men-120669404",
    "timestamp": "2025-04-10T06:38:58Z"
  },
  {
    "title": "Trump's 104% China tariff making Americans pay as much as 1200% more!",
    "description": "The U.S. and China's trade war intensifies as President Trump raises tariffs on Chinese imports to 125%, impacting American consumers and businesses. A small business owner's tariff bill surged dramatically, highlighting the financial strain. While Trump paus…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-104-china-tariff-making-americans-pay-as-much-as-1200-more/articleshow/120149166.cms",
    "timestamp": "2025-04-10T06:36:00Z"
  },
  {
    "title": "ASEAN bloc seeks dialogue with US on tariffs but won't retaliate",
    "description": "KUALA LUMPUR (Reuters) -Southeast Asian countries are pressing for dialogue with the United States on trade tariffs and will not impose retaliatory measures, economic ministers of the regional bloc ASEAN said on Thursday.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/04/10/asean-bloc-seeks-dialogue-with-us-on-tariffs-but-won039t-retaliate",
    "timestamp": "2025-04-10T06:34:00Z"
  },
  {
    "title": "ASEAN bloc seeks dialogue with US on tariffs but won't retaliate",
    "description": "Southeast Asian nations are seeking discussions with the U.S. regarding trade tariffs, opting against retaliatory actions. ASEAN economic ministers voiced concerns over unexpectedly high tariffs imposed on several member countries before a temporary pause. Th…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/asean-bloc-seeks-dialogue-with-us-on-tariffs-but-wont-retaliate/articleshow/120149195.cms",
    "timestamp": "2025-04-10T06:32:45Z"
  },
  {
    "title": "China reaches out to others as Trump layers on tariffs",
    "description": "China is reaching out to other nations as the U.S. layers on tariffs, in what appears to be an attempt by Beijing to form a united front to compel Washington to retreat",
    "link": "https://abcnews.go.com/Business/wireStory/china-reaches-trump-layers-tariffs-120669128",
    "timestamp": "2025-04-10T06:30:27Z"
  },
  {
    "title": "CNBC Daily Open: Global markets soar on Trump tariff pause — but pauses are temporary",
    "description": "U.S. President Donald Trump allowed a mere 90-day pause for deals to be made. The 10% tariff is not the permanent rate.",
    "link": "https://www.cnbc.com/2025/04/10/cnbc-daily-open-global-markets-pop-as-trump-pauses-tariffs-for-now.html",
    "timestamp": "2025-04-10T06:30:01Z"
  },
  {
    "title": "China retaliates again as Trump trade tariffs kick in",
    "description": "China will impose 84% tariffs on U.S. goods from Thursday, up from the 34% previously announced, its finance ministry said on Wednesday, firing the latest salvo in a global trade war sparked by U.S. President Donald Trump. - REUTERS",
    "link": "https://www.bangkokpost.com/video/world/3000241",
    "timestamp": "2025-04-10T06:29:00Z"
  },
  {
    "title": "Asian stocks jump as Trump postpones tough tariffs",
    "description": "Stocks rocketed Thursday as a relief rally spread through markets after Donald Trump paused crippling tariffs on US partners, with Chinese markets even brushing off his decision to ramp up duties on Beijing to 125 percent. The across-the-board gains tracked a…",
    "link": "https://punchng.com/asian-stocks-jump-as-trump-postpones-tough-tariffs/",
    "timestamp": "2025-04-10T06:27:11Z"
  }
]