[
  {
    "title": "PM Modi to meet Prez Trump, visit expected to give further momentum to Indo-US ties",
    "description": "Prime Minister Narendra Modi will embark on a two-day visit to the US and hold a bilateral meeting with President Donald Trump to further strengthen the India-US partnership. The visit will cover areas of mutual interest like trade, defense cooperation, and p…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-to-meet-prez-trump-visit-expected-to-give-further-momentum-to-indo-us-ties/articleshow/118172701.cms",
    "timestamp": "2025-02-12T09:31:47Z"
  },
  {
    "title": "Self-harm alert: Trump’s ‘man of steel’ ambitions will make America grate again",
    "description": "Perceptions of trade being a zero-sum game need to be dispelled. The US must learn from history: Metal tariffs will injure the US as well as its allies",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-steel-tariff-aluminium-tariff-steel-price-canada-mexico-imports-steel-industry-shigeru-ishiba-nippon-steel-11739253332169.html",
    "timestamp": "2025-02-12T09:30:16Z"
  },
  {
    "title": "Tánaiste warns against 'tit for tat' tariff war with US",
    "description": "‘It’s important that we’re calm and mature in terms of how we respond to these matters.’",
    "link": "https://www.thejournal.ie/trump-ireland-tariffs-6620605-Feb2025/",
    "timestamp": "2025-02-12T09:28:49Z"
  },
  {
    "title": "Putin 'not preparing for peace,' Zelenskyy says after deadly ballistic missile strike",
    "description": "President Volodymyr Zelenskyy called on Western partners to apply more pressure to Russia after a deadly overnight ballistic missile and strike.",
    "link": "https://abcnews.go.com/International/putin-preparing-peace-zelenskyy-after-deadly-ballistic-missile/story?id=118724387",
    "timestamp": "2025-02-12T09:22:51Z"
  },
  {
    "title": "Scores dead as Islamic State attacks military base in Somalia",
    "description": "Nearly 100 people were killed and up to 60 others wounded when members of the Islamic State terror group launched a deadly attack on a military base belonging to security forces from Somalia's Puntland region, officials said Tuesday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa07.htm",
    "timestamp": "2025-02-12T09:21:49Z"
  },
  {
    "title": "EU, Canada vow to stand firm against Trump's tariffs on metals",
    "description": "The 27-nation European Union and Canada quickly vowed Tuesday to stand firm against U.S. President Donald Trump's move to impose 25% tariffs on their steel and aluminum exports, verbal sparring that could lead to a full-blown trade war between the traditional…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa08.htm",
    "timestamp": "2025-02-12T09:21:37Z"
  },
  {
    "title": "Advocates applaud NJ appeals court upholding K12 transgender student protections",
    "description": "An appellate panel ruled that orders blocking four NJ districts from removing transgender student protections were legal and should remain in place.",
    "link": "https://www.northjersey.com/story/news/education/2025/02/12/nj-appeals-court-upholds-k12-transgender-student-protections/78429891007/",
    "timestamp": "2025-02-12T09:21:37Z"
  },
  {
    "title": "Japan's SoftBank reports loss weeks after announcing AI investment with U.S. President Trump",
    "description": "Japanese technology company SoftBank Group Corp. reported a 369.2 billion yen, or $2.4 billion, loss for the fiscal third quarter, as it racked up red ink from its Vision Fund investments. Tokyo-based SoftBank said Wednesday its quarterly sales rose 3% to 1.8…",
    "link": "https://www.seattlepi.com/news/world/article/japan-s-softbank-reports-loss-weeks-after-20162421.php",
    "timestamp": "2025-02-12T09:21:33Z"
  },
  {
    "title": "'Let’s buy California from Donald Trump': Denmark's next big step to spite US President's Greenland aims",
    "description": "Danish citizens have launched a petition to purchase America’s most populous and prosperous state, California, in response to Donald Trump’s efforts to acquire Greenland. This comes after Trump has made claims to buy Greenland. The tongue-in-cheek petition, w…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-denmark-wants-to-buy-california-lets-buy-california-from-donald-trump-denmarks-next-big-step-to-spite-us-presidents-greenland-aims/articleshow/118172145.cms",
    "timestamp": "2025-02-12T09:21:25Z"
  },
  {
    "title": "How pause in US foreign aid is impacting South, Central Asia",
    "description": "In Kabul, Afghanistan, a major midwifery program — girls' only higher education option — has closed.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa09.htm",
    "timestamp": "2025-02-12T09:21:25Z"
  },
  {
    "title": "Trump pauses enforcement, orders review of foreign corruption act",
    "description": "President Donald Trump has ordered a pause and review of a law that has defined the activities of U.S. business overseas for nearly five decades, claiming that the strict prohibitions against bribing foreign officials strangle American competitiveness in a to…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa11.htm",
    "timestamp": "2025-02-12T09:20:54Z"
  },
  {
    "title": "Netanyahu warns Gaza ceasefire will end if hostages not freed",
    "description": "Israeli Prime Minister Benjamin Netanyahu warned Tuesday that a ceasefire with Hamas will end and intense fighting will resume in Gaza if more hostages held by the militant group are not freed by Saturday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa05.htm",
    "timestamp": "2025-02-12T09:20:25Z"
  },
  {
    "title": "US withdrawal from UN human rights body draws mixed reactions",
    "description": "Human rights experts in Washington are divided over whether the U.S. withdrawal from a United Nations body on human rights will hurt North Korea's already poor human rights situation.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa03.htm",
    "timestamp": "2025-02-12T09:20:17Z"
  },
  {
    "title": "US military not 'abandoning' allies, defense chief says",
    "description": "World leaders are making a mistake if they conclude that an effort by U.S. President Donald Trump to review America's global military posture means Washington is pulling back, according to Defense Secretary Pete Hegseth.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa02.htm",
    "timestamp": "2025-02-12T09:20:04Z"
  },
  {
    "title": "Senior Arab officials warn Trump’s Gaza plan would inflame Middle East as Egypt to host summit to address Palestinian issues",
    "description": "US president Donald Trump's plan to take over Gaza and resettle Palestinians, which has drawn global condemnation, will threaten a fragile ceasefire in the enclave and fuel regional instability, senior Arab officials said on Wednesday.",
    "link": "https://www.independent.ie/world-news/middle-east/senior-arab-officials-warn-trumps-gaza-plan-would-inflame-middle-east-as-egypt-to-host-summit-to-address-palestinian-issues/a770520418.html",
    "timestamp": "2025-02-12T09:19:47Z"
  },
  {
    "title": "Is Elon Musk Taking Over The US Government? How \"State Capture\" Works",
    "description": "Many Americans have watched in horror as Elon Musk, the worlds richest person, has been permitted to tear through various offices of the United States government",
    "link": "https://www.ndtv.com/world-news/is-elon-musk-taking-over-the-us-government-how-state-capture-works-7692925",
    "timestamp": "2025-02-12T09:19:26Z"
  },
  {
    "title": "Key Islamic State planner killed in airstrike, US says",
    "description": "The main target in a series of U.S. airstrikes against the Islamic State terror group in Somalia earlier this month is dead, according to the most recent assessment by military officials.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa01.htm",
    "timestamp": "2025-02-12T09:19:20Z"
  },
  {
    "title": "OPEC Won’t Budge on Production Cuts",
    "description": "OPEC has signaled it would not change its production policy despite calls from the U.S. president to bring more oil to market. “We read the market. We analyze the supply, demand, away from political considerations, purely on technical, sound technical conside…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/OPEC-Wont-Budge-on-Production-Cuts.html",
    "timestamp": "2025-02-12T09:17:38Z"
  },
  {
    "title": "Israel warns of Gaza offensive resumption if Hamas fails to free hostages by Saturday",
    "description": "Israeli Prime Minister Benjamin Netanyahu said Tuesday that if the Israeli hostages held in Gaza were not returned by Saturday, the ceasefire with Hamas would be canceled, and Israel would resume \"intensive fighting\" in the war-torn enclave.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250212-pdo02.htm",
    "timestamp": "2025-02-12T09:16:13Z"
  },
  {
    "title": "Vance stakes claim to US leadership in AI",
    "description": "U.S. Vice President J.D. Vance on Tuesday vowed that the United States would maintain its leadership position in the development of advanced artificial intelligence and warned leaders of other countries not to adopt regulatory standards that might \"kill\" the …",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa12.htm",
    "timestamp": "2025-02-12T09:15:49Z"
  },
  {
    "title": "Moving Gazans to Jordan and Egypt would threaten Israeli security, senior Israeli MK says",
    "description": "Likud lawmaker Yuli Edelstein is the first Israeli official to openly question Trump's push for Jordan and Egypt to absorb hundreds of thousands of Palestinians from Gaza, calling it 'solving a problem by creating a larger one'",
    "link": "https://www.haaretz.com/israel-news/2025-02-12/ty-article/.premium/moving-gazans-to-jordan-and-egypt-would-threaten-israeli-security-senior-israeli-mk-says/00000194-f91e-d542-ad9e-f95e41d50000",
    "timestamp": "2025-02-12T09:15:35Z"
  },
  {
    "title": "Trump readies matching tariffs on trade partners, possibly setting up a major economic showdown",
    "description": "President Donald Trump could sign an order as soon as Wednesday to require that U.S. tariffs on imports match the tax rates charged by other countries.",
    "link": "https://www.clickondetroit.com/news/politics/2025/02/12/trump-readies-matching-tariffs-on-trade-partners-possibly-setting-up-a-major-economic-showdown/",
    "timestamp": "2025-02-12T09:15:15Z"
  },
  {
    "title": "Trump’s push for ‘efficiency’ may destroy the EPA. What does that mean for you?",
    "description": "Current and former EPA staff say millions of Americans could lose access to clean air and water.",
    "link": "http://grist.org/regulation/donald-trump-efficiency-epa-lee-zeldin/",
    "timestamp": "2025-02-12T09:15:00Z"
  },
  {
    "title": "Netanyahu orders military to beef up troops around Gaza, threatens to end truce deal",
    "description": "Israeli prime minister Benjamin Netanyahu has threatened to end the Gaza ceasefire if the Palestinian resistance movement Hamas does not release the captives by midday Saturday, ordering the military to beef up troops in and around the besieged territory.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv03.htm",
    "timestamp": "2025-02-12T09:14:54Z"
  },
  {
    "title": "Japan economy grows 1.0% on month in December: JCER",
    "description": "TOKYO -- Japan's economy is estimated to have grown at an annualized rate of 1.0% in December from the previous month, driven by a surge in exports ahead of possible new tariffs imposed by U.S. President Donald Trump, the Japan Center for Economic Research sa…",
    "link": "https://biztoc.com/x/5a842369d445c82e",
    "timestamp": "2025-02-12T09:14:03Z"
  },
  {
    "title": "Dollar steady before US CPI, yen weak",
    "description": "LONDON :The dollar held mostly steady against other major currencies on Wednesday as traders awaited U.S. inflation data, though remarks from Federal Reserve Chair Jerome Powell a day earlier lifted U.S. Treasury yields and lent some support against the yen.T…",
    "link": "https://www.channelnewsasia.com/business/dollar-steady-us-cpi-yen-weak-4932396",
    "timestamp": "2025-02-12T09:13:59Z"
  },
  {
    "title": "Trump raises aluminum tariffs to 25 pct, ends exemptions on steel and aluminum",
    "description": "U.S. President Donald Trump on Monday signed proclamations to raise tariffs on aluminum from 10 percent to 25 percent and ended duty-free quotas, exemptions and exclusions for steel and aluminum tariffs.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-pdo03.htm",
    "timestamp": "2025-02-12T09:12:04Z"
  },
  {
    "title": "Palestinian Authority halts payments to martyrs' families, sparking immediate backlash",
    "description": "The Palestinian Authority (PA) has halted payments to the families of Palestinian martyrs, injured, and prisoners, drawing a harsh rebuke from Palestinian resistance movements.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-irna04.htm",
    "timestamp": "2025-02-12T09:10:43Z"
  },
  {
    "title": "Japan’s SoftBank reports loss weeks after announcing AI investment with U.S. President Trump",
    "description": "TOKYO (AP) — Japanese technology company SoftBank Group Corp. reported a 369.2 billion yen ($2.4 billion) loss for the fiscal third quarter as it racked up red ink from its Vision Fund investments. That’s compared to a 950 billion yen profit in October-Decemb…",
    "link": "https://financialpost.com/pmn/japans-softbank-reports-loss-weeks-after-announcing-ai-investment-with-u-s-president-trump",
    "timestamp": "2025-02-12T09:10:26Z"
  },
  {
    "title": "Yemen ready to 'attack Israel' if it resumes war on Gaza: Ansarullah",
    "description": "Leader of Yemen's Ansarullah movement Abdul Malik al-Houthi has warned that Yemeni fighters are ready to \"attack Israel\" if the occupying regime resumes its military offensive in Gaza in violation of a ceasefire agreement.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-irna01.htm",
    "timestamp": "2025-02-12T09:10:19Z"
  },
  {
    "title": "'All hell to break loose': Trump threatens end to Gaza ceasefire if captives are not released",
    "description": "US President Donald Trump has issued a so-called ultimatum, saying if all the Zionist captives held by the Palestinian resistance movement Hamas in Gaza were not released by Saturday at noon, he would propose canceling the ceasefire and \"let all hell break lo…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv11.htm",
    "timestamp": "2025-02-12T09:09:30Z"
  },
  {
    "title": "US proposal to 'take over' Gaza would shatter fundamental rules of international order, warn UN experts",
    "description": "UN experts* today condemned shocking threats by US President Donald Trump to \"take over\" and \"own\" Gaza and move the Palestinian population elsewhere, using military force if necessary.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-ohchr01.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Hamas strongly rejects Trump ultimatum, says ceasefire only way to return Israeli captives",
    "description": "Hamas has denounced US president's call for cancellation of the Gaza ceasefire unless the Palestinian resistance movement frees all remaining Israeli captives in a matter of days, saying Donald Trump must remember that the only way for the return of Israeli c…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv09.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Official says UN opposes US president's plan to forcibly displace Palestinians",
    "description": "Deputy Spokesperson for the UN Secretary-General Farhan Haq has reacted to the US President Donald Trump's plan to displace Palestinians from Gaza and said that the United Nations is against forced displacement of the Palestinians.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-irna03.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Trump doubles down on Gaza takeover plan to Jordan's King Abdullah",
    "description": "King Abdullah II was at the White House on Tuesday as U.S. President Donald Trump doubled down on his demand that Jordan permanently take in Palestinians and support the United States to take over Gaza — a plan that Trump said will \"be wonderful\" for the Midd…",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-voa04.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Egypt's Sisi: Gaza must be rebuilt without 'displacing Palestinians'",
    "description": "Egyptian President Abdel Fattah el-Sisi says the reconstruction of the Gaza Strip must take place without displacing the Palestinian inhabitants.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv07.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Jordan's king rejects Trump plan to relocate Palestinians",
    "description": "Jordan's King Abdullah II has told Donald Trump that Arab nations are united in opposition to the US president's plan to take over Gaza and relocate Palestinians.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv01.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Trump says Palestinians won't have right to return once relocated",
    "description": "U.S. President Donald Trump said Monday that he did not think the Palestinian people whom he wanted to drive out of the Gaza Strip should return to the enclave once the reconstruction there has been completed.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-pdo02.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Trump threatens to cut aid to Jordan, Egypt if they reject his Gaza plan",
    "description": "U.S. President Donald Trump has threatened to cut off aid to Jordan and Egypt if they refuse to take Palestinian inhabitants of Gaza, who would be forcibly relocated under his controversial plan for the coastal enclave.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-irna02.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Palestinians slam Trump's Gaza scheme as 'declaration of war'",
    "description": "Palestinians have denounced as a \"declaration of war\" US President Donald Trump's scheme to take over the besieged Gaza Strip and relocate its residents.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv06.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Tension erupts between Egypt, US after Trump's threat; Sisi 'may postpone' Washington visit",
    "description": "Egyptian President Abdel Fattah el-Sisi might postpone his planned visit to Washington, marking a significant diplomatic setback amid rising tensions with American President Donald Trump over the ongoing Gaza crisis and aid cut threats.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/02/mil-250211-presstv08.htm",
    "timestamp": "2025-02-12T09:06:30Z"
  },
  {
    "title": "Musk Aide Given Payment System Access By Mistake: US Official",
    "description": "The employee, Marko Elez -- who had no federal government status -- resigned Friday after being linked to a racist social media account, only for Musk to announce that he was being reinstated.",
    "link": "https://www.ibtimes.com/musk-aide-given-payment-system-access-mistake-us-official-3763367",
    "timestamp": "2025-02-12T09:05:20Z"
  },
  {
    "title": "Trump Takes on Xi and Putin at Their Own Great Power Game",
    "description": "Speaking in the crowded rotunda of the U.S. Capitol Building that his supporters stormed just four years earlier in an effort to return him to power, President Donald Trump appeared to declare war on all that came before.\nHis fiery second inaugural address on…",
    "link": "https://biztoc.com/x/f79a7baa238873ec",
    "timestamp": "2025-02-12T09:03:16Z"
  },
  {
    "title": "Trade war game plan: Trump's going bigger this time",
    "description": "Trump's sweeping tariff strategy is bigger than his first-term in office. BI broke down what the trade war means for Americans' wallets.",
    "link": "https://www.businessinsider.com/trump-tariffs-trade-war-what-it-means-for-consumers-2025-2",
    "timestamp": "2025-02-12T09:01:02Z"
  },
  {
    "title": "Feds likely eyeing 'cover-ups' to bust Mexican cartels along border: former DEA agent",
    "description": "The U.S. Drug and Enforcement Agency could hire informants to reveal where Mexican drug cartel tunnel \"cover-ups\" are located in the U.S., a former DEA special agent says.",
    "link": "https://www.foxnews.com/us/feds-likely-eyeing-cover-ups-bust-mexican-cartels-along-border-former-dea-agent",
    "timestamp": "2025-02-12T09:00:25Z"
  },
  {
    "title": "Ex-NY Giants player is helping deported migrants in Guatemala, blames Biden for the problem",
    "description": "Former New York Giants safety Jack Brewer tells Fox News Digital he is in Guatemala helping the return of deported migrants to the country and uncovering lies they've been told.",
    "link": "https://www.foxnews.com/politics/ex-ny-giants-player-deported-migrants-guatemala-biden-problem",
    "timestamp": "2025-02-12T09:00:19Z"
  },
  {
    "title": "Federal agency in DOGE's crosshairs played key role in Harris’ strategy to curb migrant crisis",
    "description": "USAID played a significant role in the implementation of Vice President Kamala Harris' strategy to tackle migration at the southern border.",
    "link": "https://www.foxnews.com/politics/federal-agency-doge-crosshairs-played-key-role-harris-strategy-curb-migrant-crisis",
    "timestamp": "2025-02-12T09:00:18Z"
  },
  {
    "title": "Legal expert 'baffled' by courts 'intruding significantly' on Trump's presidential authority",
    "description": "Jonathan Turley slammed a federal judge for blocking a buyout offer to federal workers, arguing President Trump's order is \"perfectly within the wheelhouse of the president.\"",
    "link": "https://www.foxnews.com/media/legal-expert-baffled-courts-intruding-significantly-trumps-presidential-authority",
    "timestamp": "2025-02-12T09:00:13Z"
  },
  {
    "title": "Joe Rogan Warns Democrats Are Heading \"Off A Cliff\" After Trump's Win",
    "description": "Television host-podcaster Joe Rogan has criticised the Democratic Party for refusing to adjust after President Donald Trump&#039;s 2024 election win.",
    "link": "https://www.ndtv.com/world-news/joe-rogan-warns-democrats-are-heading-off-a-cliff-after-trumps-win-7691992",
    "timestamp": "2025-02-12T09:00:05Z"
  },
  {
    "title": "Trump Takes on Xi and Putin at Their Own Great Power Game",
    "description": "\"Talking directly to our adversaries from a position of strength\" is a way Trump can ensure peace, according to a former official.",
    "link": "https://www.newsweek.com/trump-takes-xi-putin-their-own-great-power-game-2028386",
    "timestamp": "2025-02-12T09:00:02Z"
  },
  {
    "title": "Health insurance for millions could vanish as states put Medicaid expansion on chopping block",
    "description": "Some states are already moving to end or shrink their expanded Medicaid programs.",
    "link": "https://www.denverpost.com/2025/02/12/medicaid-trump/",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "DOGE scrutiny could 'take handcuffs off' police officers to do their jobs: expert",
    "description": "President Donald Trump's creation of DOGE could \"take the handcuffs off\" local law enforcement and provide accountability on spending, a former NYPD lieutenant said.",
    "link": "https://www.foxnews.com/us/doge-scrutiny-could-take-handcuffs-off-police-officers-do-jobs-expert",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "Angered by Trump's threats, Canadians cancel U.S. trips",
    "description": "Donald Trump's repeated chirps about Canada becoming a 51st state and threats to impose sweeping tariffs have riled America’s normally mild-mannered northern neighbours.",
    "link": "https://www.cbc.ca/news/canada/ottawa/angered-by-trump-s-threats-canadians-cancel-u-s-trips-1.7456243",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "Why Doug Ford's political rivals face steep challenges going up against 'Captain Canada'",
    "description": "Ontario Premier Doug Ford, who's in the middle of a provincial election campaign, has been given the moniker 'Captain Canada,' becoming an unofficial advocate for the entire country as it faces off against Donald Trump's tariffs.",
    "link": "https://www.cbc.ca/news/politics/doug-ford-captain-canada-tariffs-trump-1.7456440",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "Don't expect Trump to keep the pressure on India over hit squads operating in Canada",
    "description": "With Donald Trump back in office, the U.S. is much less likely to pressure India over assassination plots than it was under Joe Biden — including one that targeted a U.S. citizen on U.S. soil.",
    "link": "https://www.cbc.ca/news/politics/modi-trump-assassination-plots-1.7456450",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "Trump’s budget cuts could kill your local weather forecast — and put you in danger",
    "description": "President Trump and DOGE have their sights on NOAA and the National Weather Service. Gutting them could imperil millions and cost billions",
    "link": "http://grist.org/extreme-weather/trumps-budget-cuts-could-kill-your-local-weather-forecast-and-put-you-in-danger/",
    "timestamp": "2025-02-12T09:00:00Z"
  },
  {
    "title": "PM Modi, President Macron's special friendship marked by extraordinary gestures during France visit",
    "description": "Prime Minister Narendra Modi's visit to France has been marked by an exceptional display of camaraderie and respect from President Emmanuel Macron, showcasing the strength of their bilateral relationship.",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-president-macrons-special-friendship-marked-by-extraordinary-gestures-during-france-visit/articleshow/118171511.cms",
    "timestamp": "2025-02-12T08:57:47Z"
  },
  {
    "title": "Alina Habba’s Take On Trump’s ‘Authority’ Leaves Critics Stunned",
    "description": "\"I really don’t think ANY of these folks understand our system of government,\" said one commenter.",
    "link": "https://www.huffpost.com/entry/alina-habba-donald-trump-claim-reaction_n_67ac5965e4b0239406de5579",
    "timestamp": "2025-02-12T08:55:42Z"
  },
  {
    "title": "Ford CEO blames Trump for US car industry ‘chaos’",
    "description": "Jim Farley has warned that 25% tariffs on Mexico and Canada could devastate domestic automakers, leading to industry upheaval Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612555-ford-ceo-blames-trump-for-chaos/",
    "timestamp": "2025-02-12T08:53:22Z"
  },
  {
    "title": "Blair House: Historic Residence Where PM Modi Will Stay During US Visit",
    "description": "During his stay, PM Modi will be hosted at Blair House, the official presidential guest house, which has a rich history of hosting world leaders.",
    "link": "https://www.ndtv.com/india-news/inside-blair-house-historic-residence-where-prime-minister-modi-will-stay-during-us-visit-7692754",
    "timestamp": "2025-02-12T08:53:10Z"
  },
  {
    "title": "US, Japan aligned in 'peace through strength' to counter China",
    "description": "After the meeting between U.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba last week, the two nations voiced alignment on Trump's \"peace through strength\" approach toward countering China in the Indo-Pacific region, analysts said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/japan/2025/japan-250211-voa01.htm",
    "timestamp": "2025-02-12T08:49:48Z"
  },
  {
    "title": "Exclusive: Russia says E3 cannot legally 'snap back' sanctions on Iran",
    "description": "Russia says that Britain, France, and Germany, known informally as the E3, do not have the right to \"snap back\" sanctions on Iran, as they have not implemented the requirements of U.N. Security Council Resolution 2231, which enshrines the now-stalled nuclear …",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-irna03.htm",
    "timestamp": "2025-02-12T08:49:30Z"
  },
  {
    "title": "Public Anger Rises As Iran's Economy Worsens",
    "description": "Public outrage is mounting in Iran as the country's struggling economy worsens under crippling U.S. sanctions.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-rferl01.htm",
    "timestamp": "2025-02-12T08:49:05Z"
  },
  {
    "title": "Official says Iran will write a letter of protest to Security Council over U.S.'s threats",
    "description": "Deputy Foreign Minister for Legal and International Affairs Kazem Gharibabadi says Iran will write a letter to the United Nations Security Council to protest U.S. President Donald Trump's threats of conducting military strikes against Iran.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-irna04.htm",
    "timestamp": "2025-02-12T08:48:33Z"
  },
  {
    "title": "Iran writes to Security Council to register protest at U.S. president's threats",
    "description": "Iran has written a letter to the United Nations Security Council to register its protest at U.S. President Donald Trump threatening the country with military strikes.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-irna01.htm",
    "timestamp": "2025-02-12T08:48:25Z"
  },
  {
    "title": "'Frightened' Iran Ready To Make Nuclear Deal, Trump Says",
    "description": "U.S. President Donald Trump says he believes a deal with Iran over its nuclear program can be reached as Tehran is eager to negotiate and avoid an escalation that could involve a military option.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-rferl02.htm",
    "timestamp": "2025-02-12T08:48:22Z"
  },
  {
    "title": "Iran files complaint to UN Security Council over Trump's threats: Deputy FM",
    "description": "The deputy foreign minister for legal and international affairs says Iran has complained to the United Nations Security Council over US President Donald Trump's threats against the Islamic Republic.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250211-presstv02.htm",
    "timestamp": "2025-02-12T08:48:16Z"
  },
  {
    "title": "Opinion: Great Expectations From Modi-Trump Talks",
    "description": "Prime Minister Narendra Modi is due in the US soon, raising speculation on the result given a series of actions by the new US administration that appear to be directed against India.",
    "link": "https://www.ndtv.com/opinion/opinion-great-expectations-from-modi-trump-talks-7692700",
    "timestamp": "2025-02-12T08:48:08Z"
  },
  {
    "title": "Modi to meet Trump with focus on trade, immigration and strategic ties",
    "description": "As Indian Prime Minister Narendra Modi heads to the United States for a two-day visit starting Wednesday, officials in New Delhi expressed optimism that the visit will herald a renewed and substantive partnership. However analysts said there will be contentio…",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-250211-voa01.htm",
    "timestamp": "2025-02-12T08:47:18Z"
  },
  {
    "title": "Russia supports US-North Korea dialogue, envoy says",
    "description": "Russia would welcome North Korea resuming talks with the United States, the Russian ambassador in Pyongyang said, adding that while dialogue was better than no contact at all, North Korea got \"practically nothing\" from its previous engagement with the U.S.",
    "link": "https://www.globalsecurity.org/wmd/library/news/dprk/2025/dprk-250211-rfa01.htm",
    "timestamp": "2025-02-12T08:46:58Z"
  },
  {
    "title": "Cognizant-L&T bribery case put on hold after Trump halts FCPA enforcement",
    "description": "A New Jersey court halted pretrial proceedings in a bribery case involving Cognizant Technology Solutions. This decision raises concerns over international corruption enforcement and impacts ongoing legal actions against former Cognizant executives accused of…",
    "link": "https://www.livemint.com/companies/cognizant-larsen-and-toubro-bribery-case-donald-trump-fcpa-gordon-coburn-steven-schwartz-11739344924005.html",
    "timestamp": "2025-02-12T08:45:31Z"
  },
  {
    "title": "Elon Musk's son 'X', perched on father's shoulders, steals the spotlight at Oval Office; netizens say 'cuteness overload'",
    "description": "Tech billionaire Elon Musk, accompanied by his four-year-old son X, was seen in the Oval Office alongside Donald Trump as the US President signed an executive order to continue downsizing the federal workforce. Born in 2020, \"Lil X\" -- as his father calls him…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musks-son-x-a-xii-x-perched-on-fathers-shoulders-steals-the-spotlight-at-oval-office-donald-trump-netizens-say-cuteness-overload/articleshow/118170638.cms",
    "timestamp": "2025-02-12T08:44:21Z"
  },
  {
    "title": "Russia rejects swapping occupied territory with Ukraine",
    "description": "Russia on Wednesday dismissed the idea of exchanging occupied territory with Kyiv as part of any future peace deal, just hours after launching a barrage of drones and missiles on the Ukrainian capital that killed one person. Ukrainian President Volodymyr Zele…",
    "link": "https://punchng.com/russia-rejects-swapping-occupied-territory-with-ukraine/",
    "timestamp": "2025-02-12T08:41:35Z"
  },
  {
    "title": "Myanmar refugees in limbo after US suspends resettlement program",
    "description": "Saw Ba had been living in a refugee camp on the Thai-Myanmar border for 16 years when he got the news last month that he'd been waiting years for: He and his family would be boarding a plane to resettle in America.",
    "link": "https://www.globalsecurity.org/wmd/library/news/myanmar/2025/myanmar-250211-rfa02.htm",
    "timestamp": "2025-02-12T08:40:08Z"
  },
  {
    "title": "Trump Welcomes American Teacher Freed By Russia To White House",
    "description": "U.S. President Donald Trump on February 11 welcomed an American teacher freed by Moscow to the White House after he landed on U.S. soil, saying the Russians had been \"very fair\" in agreeing to his release and indicating that Russia would release another Ameri…",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250212-rferl01.htm",
    "timestamp": "2025-02-12T08:38:05Z"
  },
  {
    "title": "US teacher returns home after being freed by Russia",
    "description": "U.S. President Donald Trump welcomed American teacher Marc Fogel to the White House late Tuesday after Fogel was freed from Russia where he had been detained since August 2021 for bringing medically prescribed marijuana into the country.",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250211-voa01.htm",
    "timestamp": "2025-02-12T08:38:02Z"
  },
  {
    "title": "Release Of American Is 'Good Faith' Move By Russia As U.S. Seeks End To War In Ukraine, White House Says",
    "description": "An American teacher serving a 14-year sentence in Russia on charges of marijuana possession has been freed in an exchange that the White House said \"serves as a show of good faith from the Russians\" as the United States seeks a settlement to end the war in Uk…",
    "link": "https://www.globalsecurity.org/wmd/library/news/russia/2025/02/russia-250211-rferl01.htm",
    "timestamp": "2025-02-12T08:37:57Z"
  },
  {
    "title": "Trump Warns Kyiv Ukraine 'May Be Russian Someday'",
    "description": "U.S. President Donald Trump said he is seeking hundreds of billions of dollars worth of rare earth resources from Ukraine in exchange for Washington's support in the war against Russia, implying that failing to do so could mean a loss of the country's soverei…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250211-rferl04.htm",
    "timestamp": "2025-02-12T08:34:11Z"
  },
  {
    "title": "Trump deportations send construction workers 'back to the shadows'",
    "description": "Such a response could worsen a labor shortage that already threatens to delay homebuilding and exacerbate a housing affordability crisis.",
    "link": "https://www.japantimes.co.jp/news/2025/02/12/world/crime-legal/trump-deportations-construction-workers/",
    "timestamp": "2025-02-12T08:34:00Z"
  },
  {
    "title": "Ukraine may be Russia's someday, Trump says",
    "description": "US President Donald Trump has said Ukraine may belong to Russia someday as Russian troops continue to make advancements on the eastern Ukrainian frontline.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250211-presstv01.htm",
    "timestamp": "2025-02-12T08:33:13Z"
  },
  {
    "title": "Russia, Ukraine strike each other's energy infrastructure",
    "description": "Russia and Ukraine attacked each other's energy infrastructure early Tuesday, just days before U.S. and Ukrainian officials were set to discuss steps toward ending the nearly three-year war sparked by Russia's 2022 invasion.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/02/ukraine-250211-voa01.htm",
    "timestamp": "2025-02-12T08:33:07Z"
  },
  {
    "title": "Reporter blocked from Oval Office over Gulf of Mexico policy",
    "description": "The White House blocked an Associated Press (AP) reporter from an event in the Oval Office after demanding the news agency alter its style on the Gulf of Mexico.",
    "link": "https://www.independent.ie/world-news/north-america/reporter-blocked-from-oval-office-over-gulf-of-mexico-policy/a2130591001.html",
    "timestamp": "2025-02-12T08:31:55Z"
  },
  {
    "title": "\"Andrew Schulz: LIFE\" - New Comedy Special on Netflix March 5, 2025",
    "description": "In Andrew Schulz's most personal special yet, he takes us on a hilarious and humbling journey of trying to start a family.",
    "link": "http://www.thefutoncritic.com/news/2025/02/12/andrew-schulz-life-new-comedy-special-on-netflix-march-5-2025-421512/20250212netflix04/",
    "timestamp": "2025-02-12T08:31:00Z"
  },
  {
    "title": "\"Andrew Schulz: LIFE\" - New Comedy Special on Netflix March 4, 2025",
    "description": "In Andrew Schulz's most personal special yet, he takes us on a hilarious and humbling journey of trying to start a family.",
    "link": "http://www.thefutoncritic.com/news/2025/02/12/andrew-schulz-life-new-comedy-special-on-netflix-march-4-2025-421512/20250212netflix04/",
    "timestamp": "2025-02-12T08:31:00Z"
  },
  {
    "title": "India should double down on climate action in the face of Trump’s policy rollback",
    "description": "The economic case for sustainability is clear and a green transition has capital market backing for good reason. A policy reversal in the US should nudge us to speed up our own efforts.",
    "link": "https://www.livemint.com/opinion/online-views/climate-action-trump-climate-policy-green-energy-renewable-energy-solar-panels-windmills-carbon-credits-sustainability-11739264879035.html",
    "timestamp": "2025-02-12T08:30:14Z"
  },
  {
    "title": "Arab League: Displacing Palestinians unacceptable",
    "description": "Arab League Secretary-General Ahmed Aboul Gheit denounced on Wednesday plans put forward by United States President Donald Trump to remove Palestinians from the Gaza Strip. \"It's unacceptable for the ...",
    "link": "https://biztoc.com/x/905d2baf646b50c6",
    "timestamp": "2025-02-12T08:29:47Z"
  },
  {
    "title": "Moscow brushes off Zelensky’s land swap idea",
    "description": "Russian Foreign Ministry spokeswoman Maria Zakharova has commented on Ukraine’s intention of a land swap Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612550-zakharova-land-swap-zelensky/",
    "timestamp": "2025-02-12T08:29:35Z"
  },
  {
    "title": "Trump’s plan is already getting Egypt, Jordan to make moves",
    "description": "King Abdullah has said he could take in 2,000 children from Gaza. He even specified how he might be able to get them to Jordan by helicopter.",
    "link": "https://www.jpost.com/middle-east/article-841764",
    "timestamp": "2025-02-12T08:28:46Z"
  },
  {
    "title": "Judge orders LSU to reinstate professor who was removed following political comments",
    "description": "A judge has ordered Louisiana State University to fully reinstate a professor who was removed from his teaching duties last month after he used vulgar language to criticize Gov. Jeff Landry and President Donald Trump during a lecture",
    "link": "https://abcnews.go.com/US/wireStory/judge-orders-lsu-reinstate-professor-removed-class-political-118724098",
    "timestamp": "2025-02-12T08:21:33Z"
  },
  {
    "title": "US, Japan aligned in 'peace through strength' to counter China",
    "description": "WASHINGTON — After the meeting between U.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba last week, the two nations voiced alignment on Trump's \"peace through strength\" approach toward countering China in the Indo-Pacific region, analysts…",
    "link": "https://www.voanews.com/a/us-japan-aligned-in-peace-through-strength-to-counter-china/7971803.html",
    "timestamp": "2025-02-12T08:21:06Z"
  },
  {
    "title": "Middle East latest: Israel threatens to restart war in Gaza if Hamas doesn't release hostages",
    "description": "Israeli PM Netanyahu has threatened to resume war against Hamas if hostages are not released by Saturday, while Hamas accuses Israel of violating the ceasefire by restricting aid. Meanwhile, President Trump pressures Jordan to take in Gaza refugees, proposing…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/middle-east-latest-israel-threatens-to-restart-war-in-gaza-if-hamas-doesnt-release-hostages/articleshow/118170003.cms",
    "timestamp": "2025-02-12T08:20:20Z"
  },
  {
    "title": "Elon Musk rails against 'unelected' bureaucrats as he holds court in the Oval Office",
    "description": "Dressed in a black ‘MAGA’ cap, black t-shirt and overcoat, the Tesla tycoon defended his actions in the White House.",
    "link": "https://www.thejournal.ie/musk-oval-office-6620541-Feb2025/",
    "timestamp": "2025-02-12T08:19:23Z"
  },
  {
    "title": "Mohamed El-Erian Says Trump's 'Uncooperative' Tariff Play Can Benefit America, But Could Lead To 'Welfare Losses' In Long-Term",
    "description": "Allianz Chief Economic Advisor Mohamed El-Erian warned that while President Donald Trump‘s evolving tariff strategy may deliver immediate gains, it risks longer-term economic damage through stagflation and eroded U.S. global influence.\nWhat Happened: El-Erian…",
    "link": "https://biztoc.com/x/14a5dd5f3bed3356",
    "timestamp": "2025-02-12T08:18:16Z"
  },
  {
    "title": "UPDATED: Trump’s Federal Government is Blocking Gender Marker Changes",
    "description": "Here's What You Can Change Right Now, and What You Can't\n \n by Vivian McCall\n \n \n \n Editor's Note: This story was updated on February 12th to reflect new information from the State Department about \"X\" gender markers for passports. The original story was publ…",
    "link": "https://www.thestranger.com/queer/2025/02/12/79897450/updated-trumps-federal-government-is-blocking-gender-marker-changes",
    "timestamp": "2025-02-12T08:16:00Z"
  },
  {
    "title": "Solana ETFs Inch Closer Toward Approval As SEC Acknowledges Filings From Multiple Asset Managers",
    "description": "On Tuesday, the U.S. Securities and Exchange Commission acknowledged several Solana-based exchange-traded fund applications.",
    "link": "https://zycrypto.com/solana-etfs-inch-closer-toward-approval-as-sec-acknowledges-filings-from-multiple-asset-managers/",
    "timestamp": "2025-02-12T08:15:58Z"
  }
]