[
  {
    "title": "He is rated as Britain's most unpopular leader ever. Can he turn it around?",
    "description": "British Prime Minister Keir Starmer will address the Labour Party conference in Liverpool, seeking to reverse dire polling topped by Reform U.K.'s Nigel Farage.",
    "link": "https://www.nbcnews.com/world/united-kingdom/keir-starmer-speech-labour-party-conference-liverpool-reform-farage-rcna234378",
    "timestamp": "2025-09-30T11:32:25Z"
  },
  {
    "title": "Bad Bunny is headlining the Super Bowl halftime show. The reaction says as much as the pick.",
    "description": "This is The Poynter Report, your daily guide to the news about news. Subscribe to get it in your inbox every weekday. Latin superstar and multi-Grammy winner Bad Bunny has […]\nThe post Bad Bunny is headlining the Super Bowl halftime show. The reaction says as…",
    "link": "https://www.poynter.org/commentary/2025/bad-bunny-halftime-show-super-bowl-2026/",
    "timestamp": "2025-09-30T11:30:27Z"
  },
  {
    "title": "Trump and His Minions Are Eyeing “Wholesale Destruction” of Environmental Science",
    "description": "This story was originally published by Bulletin of the Atomic Scientists and is reproduced here as part of the Climate Desk collaboration. The United States is hurtling towards a potential government shutdown if Congress does not pass a budget or short-term f…",
    "link": "https://www.motherjones.com/politics/2025/09/trump-administration-destruction-environmental-climate-science-shutdown-mass-layoffs-agencies/",
    "timestamp": "2025-09-30T11:30:00Z"
  },
  {
    "title": "Gen-Z revolution: Who plans our destiny?",
    "description": "By Rabi Raj Thapa Who plans our destiny? Big and powerful forces, not necessarily domestic. Has the day of Nepali […]\nThe post Gen-Z revolution: Who plans our destiny? appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/09/30/gen-z-revolution-who-plans-our-destiny/",
    "timestamp": "2025-09-30T11:28:17Z"
  },
  {
    "title": "Democrats wary support may be sliding among typically loyal voters in New Jersey governor's race",
    "description": "New Jersey's contest for governor is seeing some groups that traditionally support Democrats, like union and Black leaders, raising concerns about prospects in November",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-wary-support-sliding-typically-loyal-voters-new-126069027",
    "timestamp": "2025-09-30T11:26:25Z"
  },
  {
    "title": "Vance and Don Jr. Tighten Ties to Charlie Kirk’s Group",
    "description": "“Vice President Vance and Donald Trump Jr. are planning to bolster Turning Point USA — the conservative group co-founded by the late Charlie Kirk — by appearing at its events in the coming months,” Axios",
    "link": "https://politicalwire.com/2025/09/30/vance-and-don-jr-tighten-ties-to-charlie-kirks-group/",
    "timestamp": "2025-09-30T11:25:30Z"
  },
  {
    "title": "US government shutdown looms amid 'large differences'",
    "description": "The US could see its first government shutdown in almost seven years as both parties stand firm on their demands.",
    "link": "https://www.dw.com/en/us-government-shutdown-looms-amid-large-differences/a-74185020",
    "timestamp": "2025-09-30T11:24:00Z"
  },
  {
    "title": "Trump Says Israel Has ‘Full Backing’ If Hamas Rejects Peace Deal",
    "description": "President Donald Trump and Israeli Prime Minister Benjamin Netanyahu agreed to a peace deal to end the war in Gaza and threatened Hamas to accept it, as is, or else. “I have a feeling that we're going to have a positive answer. But if not, as you know, Bibi, …",
    "link": "https://www.today.com/video/trump-says-israel-has-full-backing-if-hamas-rejects-peace-deal-248721989993",
    "timestamp": "2025-09-30T11:20:21Z"
  },
  {
    "title": "120 Iranians deported after US reaches deal with Tehran, officials say",
    "description": "The U.S. started deporting Iranian nationals after Washington and Tehran reached an agreement in a rare moment of cooperation under President Donald Trump.",
    "link": "https://www.foxnews.com/politics/120-iranians-deported-after-us-reaches-deal-tehran-officials-say",
    "timestamp": "2025-09-30T11:18:47Z"
  },
  {
    "title": "Government Appears Poised to Shut Down: What to Know",
    "description": "The government appears to be headed toward a shutdown, with both sides walking away from a high-stakes meeting blaming the other for the impending shutdown. After the meeting, President Donald Trump posted an AI-generated video mocking Democratic leaders Chuc…",
    "link": "https://www.today.com/video/trump-mocks-dems-with-ai-video-as-shutdown-looms-248723525505",
    "timestamp": "2025-09-30T11:16:36Z"
  },
  {
    "title": "Government Appears Poised to Shut Down: What to Know",
    "description": "The government appears to be headed toward a shutdown, with both sides walking away from a high-stakes meeting blaming the other for the impending shutdown. After the meeting, President Donald Trump posted an AI-generated video mocking Democratic leaders Chuc…",
    "link": "https://www.today.com/video/trump-mocks-dems-with-ai-video-as-shutdowns-looms-248723525505",
    "timestamp": "2025-09-30T11:16:36Z"
  },
  {
    "title": "US coal auctions will test industry appetite for Trump mining revival",
    "description": "The Trump administration will auction off coal leases on federal lands in four U.S. states in the coming days, a key test of mining industry interest in its efforts to revive a sector in decline.\nThe sales in Alabama, Montana, Utah and Wyoming will be the fir…",
    "link": "https://biztoc.com/x/1c3f4d19295d4297",
    "timestamp": "2025-09-30T11:15:20Z"
  },
  {
    "title": "After Repeatedly Losing in Lower Court, Trump Asks SCOTUS To Review His Birthright Citizenship Order",
    "description": "The U.S. Supreme Court's 2025–2026 term, which officially kicks off next week, was already on track to be a notable one thanks to the impending SCOTUS showdown over the scope of President Donald Trump's power to fire top officials from \"independent\" agencies …",
    "link": "https://biztoc.com/x/028cb44af44942d6",
    "timestamp": "2025-09-30T11:15:04Z"
  },
  {
    "title": "Trump administration responds to Ariana Grande resharing post about Trump’s anti-trans agenda",
    "description": "The White House has responded to pop star Ariana Grande after she reshared an Instagram post criticising Donald Trump’s administration. On Sunday (28 September), the “We Can’t Be Friends (Wait For Your Love)” singer shared a post from queer content creator Ma…",
    "link": "https://www.thepinknews.com/2025/09/30/trump-administration-responds-ariana-grande-trans-post/",
    "timestamp": "2025-09-30T11:14:15Z"
  },
  {
    "title": "Qatar to continue mediation after Israel expresses regret over strike on Hamas",
    "description": "Donald Trump hosted a phone call between the Israeli and Qatari PMs to ease tensions after Israel's air strike on Hamas chiefs in Doha three weeks ago.",
    "link": "https://www.bbc.com/news/articles/c20z3ykyxwzo",
    "timestamp": "2025-09-30T11:13:46Z"
  },
  {
    "title": "Bruce Springsteen: Trump is who the 25th Amendment and impeachment were for",
    "description": "October is upon us, putting us that much closer to the release of Springsteen: Deliver Me From Nowhere. Ok, we’re still three weeks away from the Boss biopic that stars Jeremy Allen White as Bruce while he was making the album Nebraska, with Jeremy Strong as …",
    "link": "https://www.celebitchy.com/942910/bruce_springsteen_trump_is_who_the_25th_amendment_and_impeachment_were_for/",
    "timestamp": "2025-09-30T11:10:33Z"
  },
  {
    "title": "Transcript: Trump Press Sec Milking of Mormon Shooting Just Got Darker",
    "description": "The following is a lightly edited transcript of the September 30 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network. I’m your host, Greg Sargent. Investi…",
    "link": "https://newrepublic.com/article/201087/transcript-trump-press-sec-milking-mormon-shooting-just-got-darker",
    "timestamp": "2025-09-30T11:08:45Z"
  },
  {
    "title": "The push for peace in Gaza and a government shutdown looms: Morning Rundown",
    "description": "The White House details its Gaza peace deal plan.",
    "link": "https://www.nbcnews.com/news/us-news/push-peace-gaza-government-shutdown-looms-morning-rundown-rcna234610",
    "timestamp": "2025-09-30T11:08:29Z"
  },
  {
    "title": "XRP Tundra Presale Gains Traction as Trump’s Strategic Crypto Reserve Adds XRP and Dual-Token Model Targets 2400% Growth",
    "description": "LISBON, Portugal, Sept. 30, 2025 (GLOBE NEWSWIRE) -- XRP Tundra has announced continued momentum for its dual-token presale, coinciding with U.S. policy changes that have reshaped the role of digital assets at a national level. Following the inclusion of XRP …",
    "link": "https://www.globenewswire.com/news-release/2025/09/30/3158443/0/en/XRP-Tundra-Presale-Gains-Traction-as-Trump-s-Strategic-Crypto-Reserve-Adds-XRP-and-Dual-Token-Model-Targets-2400-Growth.html",
    "timestamp": "2025-09-30T11:05:00Z"
  },
  {
    "title": "Saudi Arabia to buy world’s largest video games publisher",
    "description": "The California-based Electronic Arts has been valued at $55  billion in the deal Read Full Article at RT.com",
    "link": "https://www.rt.com/business/625628-saudi-arabia-buys-electronic-arts/",
    "timestamp": "2025-09-30T11:04:02Z"
  },
  {
    "title": "US coal auctions will test industry appetite for Trump mining revival",
    "description": "The sales in Alabama, Montana, Utah and Wyoming will be the first since President Donald Trump’s administration rolled out measures to support the coal...",
    "link": "https://finance.yahoo.com/news/us-coal-auctions-test-industry-110352932.html",
    "timestamp": "2025-09-30T11:03:52Z"
  },
  {
    "title": "Lavrov on US Statements on Tomahawks: This is Result of European Pressure on US",
    "description": "MOSCOW (Sputnik) - Statements about possible Tomahawk missile deliveries to Kiev are prompted by pressure on Washington from European countries, Russian Foreign Minister Sergey Lavrov said on Tuesday.",
    "link": "https://sputnikglobe.com/20250930/lavrov-on-us-statements-on-tomahawks-this-is-result-of-european-pressure-on-us-1122890195.html",
    "timestamp": "2025-09-30T11:03:23Z"
  },
  {
    "title": "Trump’s rambling U.N. speech should be major cause of concern (Letters)",
    "description": "\"Following President Trump’s United Nations speech, described on the front page of The Denver Post this morning, it is time to raise the question about his mental acuity. His speech was unhinged, often not founded in fact, and rambled badly.\" -- Lynn K. Rhode…",
    "link": "https://www.denverpost.com/2025/09/30/trump-speech-un-rambling-mental-decline/",
    "timestamp": "2025-09-30T11:02:56Z"
  },
  {
    "title": "Trump and Hegseth to address top US generals in unusual military gathering",
    "description": "The short-notice meeting has prompted speculation - which the Trump administration has tried to dampen.",
    "link": "https://www.bbc.com/news/articles/cvgq044n72po",
    "timestamp": "2025-09-30T11:01:48Z"
  },
  {
    "title": "Donald Trump Will Never Be a Restrainer",
    "description": "The final verdict is in.",
    "link": "http://foreignpolicy.com/2025/09/30/donald-trump-will-never-be-a-restrainer/",
    "timestamp": "2025-09-30T11:00:36Z"
  },
  {
    "title": "Trump’s Favorite Insult Reveals More Than He Might Realize",
    "description": "This one small word the president likes to use offers a key window into his worldview.",
    "link": "https://www.huffpost.com/entry/trump-insult-sick_n_68d56a83e4b0b2f96b452094",
    "timestamp": "2025-09-30T11:00:17Z"
  },
  {
    "title": "Examining claim Trump accepted $2B bribe to sell highly sensitive AI chips to UAE, China",
    "description": "The claim was based on a New York Times article about two deals made within two weeks.",
    "link": "https://www.snopes.com//news/2025/09/30/trump-bribe-2-billion-uae-china/",
    "timestamp": "2025-09-30T11:00:00Z"
  },
  {
    "title": "Live updates: Government shutdown looms as Trump and Hegseth address military | CNN Politics",
    "description": "The federal government will shut down at midnight tonight unless Congress approves a federal spending bill. Follow live news updates.",
    "link": "https://www.cnn.com/politics/live-news/government-shutdown-trump-09-30-25",
    "timestamp": "2025-09-30T10:59:47Z"
  },
  {
    "title": "Ryder Cup, Trump's racist video prove what history shows: Decency, decorum are victims when democracy dies",
    "description": "When I learned about what happened over the weekend at the Ryder Cup in at the Bethpage golf course in New York, I felt like I was seeing America’s rot on display. Not just the loss of decorum, but something far more dangerous.",
    "link": "https://www.advocate.com/voices/ryder-cup-loss-common-decency",
    "timestamp": "2025-09-30T10:58:35Z"
  },
  {
    "title": "Links 9/30/2025",
    "description": "Our ferocious daily links: language shape reality? bone glue, climate crop impact, China economy slides, Labour disses Starmer, Israel losing backing, Argentina crisis, Tomahawk Russia threat, shutdown, George Galloway interrogation, debt and stock market wor…",
    "link": "https://www.nakedcapitalism.com/2025/09/links-9-30-2025.html",
    "timestamp": "2025-09-30T10:55:32Z"
  },
  {
    "title": "Trump wants to force mentally ill homeless people into hospitals and treatment. He’s cutting the programs that fund them",
    "description": "Trump’s cuts to Medicaid, housing assistance and mental health programs will undermine his goal of increasing involuntary commitment.",
    "link": "https://www.cnn.com/2025/09/30/business/homelessness-mental-illness-trump-policies",
    "timestamp": "2025-09-30T10:54:55Z"
  },
  {
    "title": "Censorship, Surveillance, and Spin: EU, UK, and Ukraine Try to Drive the Narrative",
    "description": "The EU, UK, and Ukraine are using a mix of expanded surveillance, censorship, and spin in an attempt to influence the narrative in their homeland and in the U.S.",
    "link": "https://www.nakedcapitalism.com/2025/09/censorship-surveillance-spin-eu-uk-ukraine-narrative-control-digital-id.html",
    "timestamp": "2025-09-30T10:54:50Z"
  },
  {
    "title": "Zohran Mamdani And Andrew Cuomo Vow To Defend New York City From Trump’s Threats",
    "description": "The Democratic nominee said he’d employ “every tool of the law” against the president’s bullying.",
    "link": "https://www.huffpost.com/entry/mamdani-cuomo-trump-nyc-mayor_n_68db51fce4b0d2dd3157a8f4",
    "timestamp": "2025-09-30T10:52:39Z"
  },
  {
    "title": "Netanyahu Corrects Donald Trump in Front of TV Cameras",
    "description": "\"I like to say it that way because the real people, that's what they call it,\" the U.S. President said on Monday.",
    "link": "https://biztoc.com/x/83df07c160a26619",
    "timestamp": "2025-09-30T10:52:24Z"
  },
  {
    "title": "British Mandate 2.0? Arch Globalist Tony Blair in Line to Lead Post-War Gaza",
    "description": "Former British Prime Minister Tony Blair may be tasked with a governing role in a potential post-war Gaza should the Islamist Hamas terrorists agree to a framework proposed by U.S. President Donald Trump.\nThe post British Mandate 2.0? Arch Globalist Tony Blai…",
    "link": "https://www.breitbart.com/europe/2025/09/30/british-mandate-2-0-arch-globalist-tony-blair-in-line-to-lead-post-war-gaza/",
    "timestamp": "2025-09-30T10:49:02Z"
  },
  {
    "title": "US department bans ‘climate change’ – Politico",
    "description": "The US Energy Department has added “climate change” to a list of words to avoid in communications, according to Politico Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625634-climate-change-banned-trump/",
    "timestamp": "2025-09-30T10:48:02Z"
  },
  {
    "title": "Japan and South Korea leaders commit to closer ties in their final summit",
    "description": "Japanese Prime Minister Shigeru Ishiba and South Korean President Lee Jae Myung have emphasized the need for stronger cooperation between their countries",
    "link": "https://abcnews.go.com/Business/wireStory/japan-south-korea-leaders-commit-closer-ties-final-126067915",
    "timestamp": "2025-09-30T10:46:43Z"
  },
  {
    "title": "Trump’s welcome letter to new citizens isn’t very welcoming",
    "description": "His message to naturalized citizens is part of an effort to redefine American identity and patriotism",
    "link": "https://www.salon.com/2025/09/30/trumps-welcome-letter-to-new-citizens-isnt-very-welcoming/",
    "timestamp": "2025-09-30T10:45:51Z"
  },
  {
    "title": "Stephen Colbert Begs Viewers to Grasp Wildest Part of Trump’s AI ‘Medbed’ Gaffe",
    "description": "Colbert howled in disbelief at Trump for sharing a fabricated AI video on social media “of himself” endorsing miracle “medbeds.”\nThe post Stephen Colbert Begs Viewers to Grasp Wildest Part of Trump’s AI ‘Medbed’ Gaffe first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/stephen-colbert-begs-audience-to-grasp-how-wild-trumps-medbed-gaffe-was/",
    "timestamp": "2025-09-30T10:45:46Z"
  },
  {
    "title": "Your peace or mine? Prospects for Gaza deal",
    "description": "After pressure from US President Donald Trump, Israel’s Prime Minister Bibi Netanyahu has been strong-armed into agreeing a deal for Gaza. Will Hamas sign up too? Our correspondent analyses the path to peace. Lululemon needs a legging-up. And why leopards, cr…",
    "link": "https://biztoc.com/x/3985aa3203606eed",
    "timestamp": "2025-09-30T10:41:10Z"
  },
  {
    "title": "Finally, a 'day after' plan for Gaza that just might work",
    "description": "The odds of Trump's 20-point plan actually coming to fruition remain poor, but unlike the Riviera scheme, this one makes a fair amount of sense",
    "link": "https://www.haaretz.com/israel-news/2025-09-30/ty-article/.premium/finally-a-day-after-plan-for-gaza-that-just-might-work/00000199-9a26-d0f3-a599-dee74ed00000",
    "timestamp": "2025-09-30T10:39:07Z"
  },
  {
    "title": "'Drunk with power': Author tells how Chief Justice John Roberts 'corrupted' Supreme Court",
    "description": "Twenty years ago this week, John Roberts was sworn in as chief justice of the Supreme Court, at 50 years old. On that day, Lisa Graves “wept.” As chief counsel for nominations with the Senate Judiciary Committee from 2002 to 2005, she anticipated Roberts’ com…",
    "link": "https://www.rawstory.com/raw-investigates/john-roberts-2674100974/",
    "timestamp": "2025-09-30T10:38:47Z"
  },
  {
    "title": "Donald Trump vs Bollywood: How new US tariffs will impact Indian films",
    "description": "American President Donald Trump's decision to finally impose a massive 100% tariff — import duty or tax — on movies made outside the US comes as another major blow to India, which has been facing his wrath, with blips of bonhomie, for the past three months an…",
    "link": "https://freerepublic.com/focus/f-chat/4343435/posts",
    "timestamp": "2025-09-30T10:38:39Z"
  },
  {
    "title": "The Simpsons’ New Season to Avoid Politics Following South Park Drama",
    "description": "The series' showrunner is hopeful that viewers on both side of the aisle can enjoy The Simpsons.\nThe Simpsons’ New Season to Avoid Politics Following South Park Drama\nScott Sterling",
    "link": "https://consequence.net/2025/09/the-simpsons-new-season-avoid-politics-south-park-drama/",
    "timestamp": "2025-09-30T10:37:33Z"
  },
  {
    "title": "Morning Bid: Shutdown talks go to the wire as Q3 ends",
    "description": "A looming U.S. government shutdown is casting a shadow over the final day of a stellar third quarter for most world markets.  U.S. President Donald Trump and...",
    "link": "https://finance.yahoo.com/news/morning-bid-shutdown-talks-wire-103732373.html",
    "timestamp": "2025-09-30T10:37:32Z"
  },
  {
    "title": "Rupee falls 4 paise to fresh low of 88.79 against US dollar",
    "description": "At the interbank foreign exchange, the rupee opened at 88.73 against the dollar and traded in the range of 88.69-88.80 before settling at 88.79 (provisional), lower by 4 paise against its previous close",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-falls-4-paise-to-fresh-low-of-8879-against-us-dollar/article70112493.ece",
    "timestamp": "2025-09-30T10:36:20Z"
  },
  {
    "title": "Qatari and Turkish representatives to meet with Hamas officials on Trump plan",
    "description": "The spokesperson for the Qatari Foreign Ministry announced that today, a meeting will be held with a Hamas delegation and representatives from Turkey to consult regarding US President Donald Trump’s plan to end the war.",
    "link": "https://www.israelnationalnews.com/flashes/667449",
    "timestamp": "2025-09-30T10:34:11Z"
  },
  {
    "title": "Government shutdown nears with no deal in Washington",
    "description": "WASHINGTON (Reuters) -Washington braced for a fast-approaching government shutdown on Tuesday, as Republicans and Democrats appeared unlikely to reach an agreement that would extend funding past a midnight deadline.  Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/30/government-shutdown-nears-with-no-deal-in-washington",
    "timestamp": "2025-09-30T10:34:00Z"
  },
  {
    "title": "YouTube agrees to $24.5m settlement with Trump",
    "description": "Court filings indicate that Trump will allocate $22m of the settlement to the Trust for the National Mall and the development of a White House ballroom.",
    "link": "https://www.verdict.co.uk/youtube-trump-account-suspension/",
    "timestamp": "2025-09-30T10:31:58Z"
  },
  {
    "title": "'Offends them': Analyst warns top military brass is seething over Hegseth 'waste of time'",
    "description": "Defense Secretary Pete Hegseth's planned meeting with the top brass of America's military Tuesday is facing strong pushback from within the ranks, according to one columnist. David Rothkopf, columnist for The Daily Beast, spoke with the outlet's executive edi…",
    "link": "https://www.rawstory.com/pete-hegseth-2674106548/",
    "timestamp": "2025-09-30T10:30:56Z"
  },
  {
    "title": "Losing the shutdown in the best way is Democrats' only realistic goal",
    "description": "House Minority Leader Hakeem Jeffries, D-N.Y., and Senate Minority Leader Charles Schumer, D-N.Y., deliver remarks following a meeting with President Donald Trump at the White House on Sept. 29, 2025.",
    "link": "https://biztoc.com/x/9dc2da68e634d103",
    "timestamp": "2025-09-30T10:30:15Z"
  },
  {
    "title": "GOP Senator Says Trump's Latest Wild Stunt Is 'Little Boy' Maneuver",
    "description": "GOP Sen. Roger Marshall inadvertently dissed the president for his bigoted AI video with Chuck Schumer and Hakeem Jeffries.",
    "link": "https://www.huffpost.com/entry/roger-marshall-donald-trump-racist-ai-video-little-boy_n_68db9e7be4b0d2dd3157ca54",
    "timestamp": "2025-09-30T10:28:34Z"
  },
  {
    "title": "EA's new owners are making \"a huge bet\" on generative AI cost-cutting to help repay a $20 billion loan, claims report",
    "description": "Yesterday, a group of moneyfolk including private equity firm Silver Lake, Saudi Arabia's Public Investment Fund, and Donald Trump son-in-law Jared Kushner's Affinity Partners unveiled plans to acquire Electronic Arts for an estimated $55 billion. \n\nThe buyer…",
    "link": "https://www.rockpapershotgun.com/eas-new-owners-are-making-a-huge-bet-on-generative-ai-cost-cutting-to-help-repay-a-20-billion-loan-claims-report",
    "timestamp": "2025-09-30T10:24:06Z"
  },
  {
    "title": "US to see largest mass resignation in history? As government shutdown looms, Trump's plans exposed",
    "description": "The Trump administration is set to oversee the largest mass resignation in US history on Tuesday. This shutdown, if happens, is different from others as the White House has threatened more than 100,000 federal are set to be reportedly fired. However, benefits…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-us-to-see-largest-mass-resignation-in-history-as-government-shutdown-looms-trumps-plans-revealed/articleshow/124232054.cms",
    "timestamp": "2025-09-30T10:21:37Z"
  },
  {
    "title": "Trump to preside over unusual military gathering in Virginia",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump will preside on Tuesday over an extraordinary gathering of America's top generals and admirals from around the world, who were summoned to a Marine base in Virginia without explanation last week. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/09/30/trump-to-preside-over-unusual-military-gathering-in-virginia",
    "timestamp": "2025-09-30T10:16:00Z"
  },
  {
    "title": "Virginia warily waits for outcome of funding showdown",
    "description": "How much more pain can Northern Virginia's economy take? The answer might come after midnight on Tuesday, if Congress fails to pass a short-term funding resolution to keep the federal government open.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_239eb836-7ac0-4cce-8997-e4866e96d267.html",
    "timestamp": "2025-09-30T10:15:00Z"
  },
  {
    "title": "Trump Celebrates YouTube Settlement With Meme Depicting a Humiliated Tech Exec Handing Him a Check for $24.5 Million",
    "description": "President Donald Trump took a victory lap after his latest shakedown of a big tech company, sharing a meme showing an embarrassed YouTube exec handing over a giant-size check for $24.5 million to the president. On Monday, a court filing revealed that Alphabet…",
    "link": "https://variety.com/2025/digital/news/trump-celebrates-youtube-settlement-meme-tech-exec-24-5-million-check-1236534721/",
    "timestamp": "2025-09-30T10:14:10Z"
  },
  {
    "title": "Memphis and Portland, Ore. brace for troops. Why Chicago might be next",
    "description": "Illinois Gov. JB Pritzker said the Department of Homeland Security has requested for 100 military personnel to help protect ICE agents and facilities in his state.",
    "link": "https://www.npr.org/2025/09/30/nx-s1-5557337/chicago-portland-memphis-national-guard",
    "timestamp": "2025-09-30T10:10:28Z"
  },
  {
    "title": "Shutdown would add to Hawaii’s economic woes | Honolulu Star-Advertiser",
    "description": "Federal workers in Hawaii who are worried about a shutdown of the federal government that could begin at 6:01 p.m. today (12:01 a.m EDT Wednesday) are likely already cutting back on local spending, adding to Hawaii’s already sluggish economy, according to the…",
    "link": "https://www.staradvertiser.com/2025/09/30/hawaii-news/shutdown-would-add-to-hawaiis-economic-woes/",
    "timestamp": "2025-09-30T10:08:56Z"
  },
  {
    "title": "Wall Street Journal Slams ‘Suffering’ Caused By Key Trump Policy",
    "description": "The newspaper made a damning prediction, too.",
    "link": "https://www.huffpost.com/entry/wall-street-journal-suffering-donald-trump_n_68dba62ee4b003b6c8dbfeb2",
    "timestamp": "2025-09-30T10:08:11Z"
  },
  {
    "title": "Tata bought slabs from rival British Steel as it sought to beat Trump tariff plans",
    "description": "Sale of product from Scunthorpe plant came when Indian-owned firm tried to avoid US rules that were later dropped\nBusiness live – latest updates\nBritish Steel has made the unusual move to sell slabs of metal to its rival Tata Steel, as the latter sought ways …",
    "link": "https://biztoc.com/x/ec0759e0b1476f13",
    "timestamp": "2025-09-30T10:07:13Z"
  },
  {
    "title": "Hamas weighs its response to Trump's Gaza peace proposal",
    "description": "DUBAI/CAIRO (Reuters) -A U.S.-sponsored ceasefire proposal for Gaza on Tuesday was hinging on Hamas's response to the 20-point plan which President Donald...",
    "link": "https://ca.news.yahoo.com/hamas-weighs-response-trumps-gaza-100625105.html",
    "timestamp": "2025-09-30T10:06:25Z"
  },
  {
    "title": "US government faces brain drain as 154,000 federal workers exit this week",
    "description": "WASHINGTON (Reuters) -More than 150,000 federal employees will leave the U.S. government payroll this week after accepting buyouts - the largest single-year ...",
    "link": "https://www.yahoo.com/news/articles/us-government-faces-brain-drain-100606151.html",
    "timestamp": "2025-09-30T10:06:06Z"
  },
  {
    "title": "New US$100,000 H-1B visa fee does not apply to H-1B1 visa available to Singaporeans: US Embassy",
    "description": "The H-1B1 visa is a special variant of the H-1B visa that is only available to citizens of Singapore and Chile.",
    "link": "https://www.channelnewsasia.com/world/new-us100000-h-1b-visa-fee-does-not-apply-h-1b1-visas-available-singaporeans-us-embassy-5377346",
    "timestamp": "2025-09-30T10:05:12Z"
  },
  {
    "title": "States to end nutrition education programs after Trump cuts",
    "description": "WASHINGTON/SAN FRANCISCO (Reuters) -On a warm September day in the courtyard of a San Francisco senior living community, a dozen residents shake their hips...",
    "link": "https://www.yahoo.com/news/articles/states-end-nutrition-education-programs-100421519.html",
    "timestamp": "2025-09-30T10:04:21Z"
  },
  {
    "title": "The Real Violent Extremists Are The Freaks Who Run The US Empire",
    "description": "I think it’s worth remembering this as the empire harnesses the emotional hysteria around Charlie Kirk’s death to whip up a moral panic about violent radical leftists in the United States in order to justify increased authoritarian measures to stomp out polit…",
    "link": "https://www.activistpost.com/the-real-violent-extremists-are-the-freaks-who-run-the-us-empire/",
    "timestamp": "2025-09-30T10:04:00Z"
  },
  {
    "title": "Trump's Gaza peace plan wins global support as world awaits Hamas response",
    "description": "President Donald Trump's peace plan was met with cautious optimism Tuesday by leaders across the Middle East and the world, but others were more skeptical about the proposal — and whether it would be welcomed by Hamas.",
    "link": "https://www.nbcnews.com/world/middle-east/trump-gaza-peace-plan-israel-support-hamas-response-rcna234620",
    "timestamp": "2025-09-30T10:03:30Z"
  },
  {
    "title": "PMO: Summit invitation to Trump reflects Asean mandate, not policy endorsement",
    "description": "KUALA LUMPUR: The participation of United States President Donald Trump and other world leaders at the 47th Asean Summit to be held in Kuala Lumpur in October is part of the diplomatic mandate entrusted to Malaysia. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/09/30/pmo-summit-invitation-to-trump-reflects-asean-mandate-not-policy-endorsement",
    "timestamp": "2025-09-30T10:02:00Z"
  },
  {
    "title": "Opinion: Canada’s innovation paradox is a business problem and being 'nice' won’t fix it",
    "description": "Alice de Koning and Yrjo Koskinen: Canadian niceness is a virtue in civic life; in business, it can blur into comfortable mediocrity",
    "link": "https://financialpost.com/technology/canada-innovation-paradox-business-problem-being-nice-wont-fix-it",
    "timestamp": "2025-09-30T10:00:33Z"
  },
  {
    "title": "How much digital sovereignty does the UK have left?",
    "description": "Policy experts and CIOs alike are fretting over the extent to which the UK tech sector is beholden to US tech giants.",
    "link": "https://www.techmonitor.ai/policy/digital-sovereignty-uk-future/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The Stunning Reversal in U.S.-India Relations",
    "description": "Isaac Chotiner interviews Milan Vaishnav on the tensions between India and the United States and the role that Donald Trump and Narendra Modi play in the fraying relationship.",
    "link": "https://www.newyorker.com/news/q-and-a/the-stunning-reversal-in-us-india-relations",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The New Deal Masterpieces Threatened by Trump’s D.C. Downsizing",
    "description": "Last Friday, the Voice of America’s Washington staff—a skeletal remnant of its workforce because President Donald Trump has fired everybody else or placed them on administrative leave—received a text from H.R. stating that they’ll be relocated “as quickly as …",
    "link": "https://newrepublic.com/article/201055/ben-shahn-wpa-art-trump",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Erika Kirk isn't in the Epstein files as a 'recruiter'",
    "description": "Erika Kirk, widow of conservative activist Charlie Kirk, recruited victims for convicted sex offender Jeffrey Epstein and had her husband killed to keep him quiet about her ties to Epstein.",
    "link": "https://www.snopes.com//fact-check/erika-kirk-recruit-victims-epstein/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Zohran Mamdani and the Future of American Politics",
    "description": "NYC’s mayoral candidate has Kennedy-like charisma, a global profile, and nepo baby instincts. He is also a proud democratic socialist who has both Donald Trump and the left-wing establishment in a lather. Is Zohran Mamdani the future of American politics—or a…",
    "link": "https://www.vanityfair.com/news/story/zohran-mamdani-and-the-future-of-american-politics",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Losing the shutdown in the best way is Democrats' only realistic goal",
    "description": "Monday's White House meeting with President Trump and Democrats Chuck Schumer and Hakeem Jeffries didn't appear to help the country avoid a government shutdown.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/chuck-schumer-hakeem-jeffries-meeting-trump-was-never-going-stop-shutd-rcna233994",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "The Slow and Steady passive portfolio update: Q3 2025",
    "description": "Are you watching Donald Trump?\nThe post The Slow and Steady passive portfolio update: Q3 2025 appeared first on Monevator.",
    "link": "https://monevator.com/the-slow-and-steady-passive-portfolio-update-q3-2025/",
    "timestamp": "2025-09-30T10:00:00Z"
  },
  {
    "title": "Venezuelan President Nicolas Maduro expands his powers in case US attacks",
    "description": "Venezuela's President Nicolas Maduro has signed a decree to give himself increased security powers should the US military enter the country.",
    "link": "https://news.sky.com/story/venezuelan-president-nicolas-maduro-expands-his-powers-in-case-us-attacks-13441463",
    "timestamp": "2025-09-30T09:58:00Z"
  },
  {
    "title": "Trump admin may defund inspector general watch group",
    "description": "United States President Donald Trump's administration is planning to stop funding the Council of the Inspectors General on Integrity and Efficiency (CIGIE), the oversight group comprising 72 inspector...",
    "link": "https://biztoc.com/x/36aab5b01fc68998",
    "timestamp": "2025-09-30T09:56:11Z"
  },
  {
    "title": "Long Read: How a new European ideological patriotism could be a counter for Trumpism",
    "description": "Donald Trump’s second administration has upturned many long-established approaches to political decision-making. Peter Nedergaard writes that Trump’s challenges to these approaches have included moving from a regime based on free trade to high tariffs, fiscal…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/09/30/long-read-how-a-new-european-ideological-patriotism-could-be-a-counter-for-trumpism/",
    "timestamp": "2025-09-30T09:54:18Z"
  },
  {
    "title": "Entire Ukrainian family killed in Russian drone strike, officials say",
    "description": "The bodies of two young boys and their parents were recovered from their destroyed home in the Sumy region, rescuers say.",
    "link": "https://www.bbc.co.uk/news/articles/cdxqdpgznzeo",
    "timestamp": "2025-09-30T09:53:28Z"
  },
  {
    "title": "Gold Slips as Traders Take Stock of Record-Breaking Rally",
    "description": "The precious metal jumped more than 10% this month.  “Following a non-stop rally throughout September, I suspect we are seeing some end-of-month profit...",
    "link": "https://finance.yahoo.com/news/gold-hits-fresh-record-us-044125912.html",
    "timestamp": "2025-09-30T09:53:23Z"
  },
  {
    "title": "Hamas yet to respond on Trump’s Gaza plan",
    "description": "Hamas had yet to respond Tuesday to Donald Trump on his plan for Gaza, while Prime Minister Benjamin Netanyahu said the Israeli military would stay in most of the territory after he gave the US president his backing. The plan calls for a ceasefire, release of…",
    "link": "https://www.digitaljournal.com/world/hamas-yet-to-respond-on-trumps-gaza-plan/article",
    "timestamp": "2025-09-30T09:52:20Z"
  },
  {
    "title": "Bennett criticizes: 'Apology to Qatar was difficult but necessary'",
    "description": "Former PM Naftali Bennett praised President Donald Trump’s role in securing hostage release but blasted Israel for the deal, calling it a heavy price and a grave failure.",
    "link": "https://www.israelnationalnews.com/news/415621",
    "timestamp": "2025-09-30T09:48:00Z"
  },
  {
    "title": "Tariffs, tech and trouble: Gurmeet Chadha sees bubble in US stocks",
    "description": "Concerns over stretched US tech valuations are mounting as Donald Trump revives tariff-driven trade policies. Gurmeet Chadha warns of a potential “big bubble,” citing digital sovereignty and declining global dependence on American platforms, threatening futur…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariffs-tech-and-trouble-gurmeet-chadha-sees-bubble-in-us-stocks/articleshow/124231439.cms",
    "timestamp": "2025-09-30T09:46:54Z"
  },
  {
    "title": "US to deport hundreds of Iranians after deal with Tehran: official",
    "description": "\"In the first step, they decided to deport 120 Iranians who entered the US illegally, most of whom through Mexico.\"",
    "link": "https://nypost.com/2025/09/30/us-news/us-to-deport-hundreds-of-iranians-after-deal-with-tehran-iranian-official-says/",
    "timestamp": "2025-09-30T09:46:22Z"
  },
  {
    "title": "CNBC Daily Open: Fed's path ahead could be clouded if U.S. government shuts down",
    "description": "After a seemingly unproductive meeting between lawmakers and U.S. President Donald Trump on Monday, the chances that the country's government will be shutting down two days later appear to be growing.\nIf the U.S. government shuts down, it's essentially like a…",
    "link": "https://biztoc.com/x/34180c029a559cb0",
    "timestamp": "2025-09-30T09:44:50Z"
  },
  {
    "title": "‘Cruel joke’: How Indian H-1B dreams are crash-landing after Trump fee hike",
    "description": "Thousands of young Indians have mapped their adult lives with the aim of moving to the US, plans that now lie in tatters. Meghna Gupta* had planned it all – a master’s degree by 23, a few years of working in India, and then a move to the United States before …",
    "link": "https://freerepublic.com/focus/f-chat/4343430/posts",
    "timestamp": "2025-09-30T09:37:54Z"
  },
  {
    "title": "China Backs Trump's Peace Plan To End Gaza War",
    "description": "US administration led by President Donald Trump introduced a 20 point peace plan on Sept. 29 for Israel and Hamas. The plan was accepted by Israeli Prime Minister Benjamin Netanyahu. If it comes into the effect, it will result in full withdrawal of Israel Def…",
    "link": "https://www.ndtvprofit.com/markets/china-backs-trumps-peace-plan-to-end-gaza-war",
    "timestamp": "2025-09-30T09:37:04Z"
  },
  {
    "title": "EA $55 Billion Deal Might Bring Massive Layoffs Between AI Pivot and $20 Billion of Debt",
    "description": "Just a few days after the original rumor, Electronic Arts (EA) confirmed yesterday that it is indeed getting a $55 billion buyout from a Consortium of investors that includes PIF, Saudi Arabia's sovereign investment fund, Silver Lake (an American global priva…",
    "link": "https://wccftech.com/ea-55-billion-deal-might-bring-massive-layoffs-ai-pivot-20-billion-debt/",
    "timestamp": "2025-09-30T09:35:00Z"
  },
  {
    "title": "Senators Draft Plan to Curb Hidden L-1 Visa Migration Program",
    "description": "A bipartisan duo in the Senate has drafted an unprecedented bill to curb the little-known but huge L-1 visa program, which allows multinationals to import hundreds of thousands of white collar workers while paying them home country wages.\nThe post Senators Dr…",
    "link": "https://www.breitbart.com/economy/2025/09/30/senators-draft-plan-to-curb-hidden-l-1-visa-migration-program/",
    "timestamp": "2025-09-30T09:32:10Z"
  }
]