[
  {
    "title": "President Baby Hands Attends NFL Game, Gets Booed Harder Than On His Wedding Night",
    "description": "At least one good thing happened on Sunday.",
    "link": "https://www.wonkette.com/p/president-baby-hands-attends-nfl",
    "timestamp": "2025-11-10T21:20:11Z"
  },
  {
    "title": "Ahmed al-Sharaa meets Trump as US extends Syria sanctions relief",
    "description": "Syrian presidency says al-Sharaa and Trump discussed ways to 'strengthen and develop' ties between the US and Syria.",
    "link": "https://www.aljazeera.com/news/2025/11/10/ahmed-al-sharaa-meets-trump-as-us-extends-syria-sanctions-relief",
    "timestamp": "2025-11-10T21:19:14Z"
  },
  {
    "title": "DNC rakes in major grassroots haul thanks to Trump at the helm",
    "description": "Democrats had a major grassroots fundraising surge in October, thanks to voter discontent with President Trump, according to data shared exclusively with MSNBC",
    "link": "https://www.msnbc.com/msnbc/news/exclusive-dnc-rakes-grassroots-haul-thanks-trump-rcna243036",
    "timestamp": "2025-11-10T21:18:56Z"
  },
  {
    "title": "China Dominance of Rare Earths Poses Biggest Threat for Transatlantic Allies - US Lawmaker",
    "description": "WASHINGTON (Sputnik) - The greatest danger for the Transatlantic Alliance today is China's leadership in the field of rare earths, US Congressman and chairman of the House Select Committee on the Strategic Competition between the United States and the Chinese…",
    "link": "https://sputnikglobe.com/20251110/china-dominance-of-rare-earths-poses-biggest-threat-for-transatlantic-allies---us-lawmaker-1123092913.html",
    "timestamp": "2025-11-10T21:17:00Z"
  },
  {
    "title": "Alaska’s U.S. senators support end of federal shutdown, with fate of health care subsidies still unknown",
    "description": "Alaska’s U.S. senators support end of federal shutdown, with fate of health care subsidies still unknownadn.com",
    "link": "https://www.adn.com/politics/2025/11/10/alaskas-us-senators-support-end-of-federal-shutdown-with-fate-of-health-care-subsidies-still-unknown/",
    "timestamp": "2025-11-10T21:16:55Z"
  },
  {
    "title": "‘Woke pro-trans’ BBC staff rebel – media",
    "description": "The broadcaster’s staff are reportedly in a “civil war” against its management after the latter admitted to doctoring a Trump documentary Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627593-woke-pro-trans-bbc-staff-rebel/",
    "timestamp": "2025-11-10T21:15:21Z"
  },
  {
    "title": "Trump: Syria important part of Middle East",
    "description": "United States President Donald Trump shared on Monday that Syria is \"an important part of the Middle East.\"Talking to reporters after his meeting with Syrian President Ahmed al-Sharaa, Trump said that...",
    "link": "https://biztoc.com/x/ffa75ae00a948b86",
    "timestamp": "2025-11-10T21:14:40Z"
  },
  {
    "title": "Trump: We want Switzerland to remain successful",
    "description": "US President Donald Trump revealed Monday that his administration is negotiating a new trade deal with Switzerland, while also expressing optimism about the talks.Speaking during a swearing-in ceremon...",
    "link": "https://biztoc.com/x/277d2c78f39969d1",
    "timestamp": "2025-11-10T21:14:39Z"
  },
  {
    "title": "8 Democrats voted with Republicans on a shutdown deal. Here’s what they’ve said about why",
    "description": "They faced almost instant blowback from members of their own party as they voted to allow the Senate to move forward on compromise legislation that would reopen the government.",
    "link": "https://www.pbs.org/newshour/politics/8-democrats-voted-with-republicans-on-a-shutdown-deal-heres-what-theyve-said-about-why",
    "timestamp": "2025-11-10T21:13:45Z"
  },
  {
    "title": "What to know about Trump's promise of $2,000 tariff dividend payments - abcnews.go.com",
    "description": "What to know about Trump's promise of $2,000 tariff dividend paymentsabcnews.go.com Trump floats $2,000 tariff rebate checks. What you need to knowCNN Is Trump giving Americans $2000 tariff dividend payment, stimulus check 2025?The News Journal Donald Trump S…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180029648",
    "timestamp": "2025-11-10T21:12:48Z"
  },
  {
    "title": "Citing ‘assault on the rule of law,’ federal judge appointed by Reagan resigns so he can speak out",
    "description": "A federal judge appointed in 1985 by then-President Ronald Reagan has resigned from the bench, citing a Trump administration “assault on the rule of law” that compels him to speak out.",
    "link": "https://www.abajournal.com/news/article/citing-assault-on-the-rule-of-law-federal-judge-appointed-by-reagan-resigns-so-he-can-speak-out",
    "timestamp": "2025-11-10T21:12:00Z"
  },
  {
    "title": "Dave Ramsey In Critical Condition After Learning Of 50-Year Mortgage",
    "description": "FRANKLIN, TN — Financial consultant and radio host Dave Ramsey was reported to be in critical condition Monday after learning that President Donald Trump had begun pushing a 50-year home mortgage. According to sources, Ramsey collapsed at his desk after readi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4351832/posts",
    "timestamp": "2025-11-10T21:11:48Z"
  },
  {
    "title": "An emerging shutdown deal doesn't extend expiring health subsidies. Here's what could happen to them",
    "description": "A legislative package that could end the weekslong government shutdown leaves out any clear resolution on the expiring Affordable Care Act tax credits that have made private health insurance less costly for millions.",
    "link": "https://www.news4jax.com/health/2025/11/10/an-emerging-shutdown-deal-doesnt-extend-expiring-health-subsidies-heres-what-could-happen-to-them/",
    "timestamp": "2025-11-10T21:10:30Z"
  },
  {
    "title": "Trump says US getting close to reaching a trade deal with India",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump said on Monday the United States was getting close to reaching a deal with India that would expand economic and security ties between the two countries, boost U.S. energy exports and promote investments in key…",
    "link": "https://www.thestar.com.my/news/world/2025/11/11/trump-says-us-getting-close-to-reaching-a-trade-deal-with-india",
    "timestamp": "2025-11-10T21:10:00Z"
  },
  {
    "title": "Trump Healthcare Payment Proposal Sparks Fresh Medicare for All Demands to Fix ‘Broken’ Healthcare System",
    "description": "As the government appears poised to reopen, with Republicans having successfully avoided concessions on their goal of eliminating Affordable Care Act tax credits, President Donald Trump has proposed his own solution to the looming explosion in health insuranc…",
    "link": "https://www.commondreams.org/news/trump-healthcare-proposal-medicare-for-all",
    "timestamp": "2025-11-10T21:09:13Z"
  },
  {
    "title": "Rosters announced for Rory McIlroy/Scottie Scheffler primetime event",
    "description": "Rory McIlroy and Scottie Scheffler will headline their respective teams for a primetime event airing on Golf Channel on Dec. 17, 2025.",
    "link": "https://golf.com/news/rosters-mcilroy-scheffler-golf-channel-event/",
    "timestamp": "2025-11-10T21:08:50Z"
  },
  {
    "title": "BBC Execs Resigned For Spreading Hoaxes About Trump. When Will US Media Do The Same?",
    "description": "While media across the pond take some responsibility for painting Trump as the villain of Jan. 6, the legacy media in the United States — instead of facing reprimands or firings for their relentless propagation of Trump hoaxes — enjoy promotions and Pulitzers.",
    "link": "https://thefederalist.com/2025/11/10/bbc-execs-resigned-for-spreading-hoaxes-about-trump-when-will-us-media-do-the-same/",
    "timestamp": "2025-11-10T21:08:33Z"
  },
  {
    "title": "Joe Scarborough: It’s time for Democrats to ‘take a win’ and end the shutdown",
    "description": "Joe Scarborough urges Democrats to \"take a win\" and end the shutdown, arguing the American people won't forget the pain Trump and the GOP inflicted on them.",
    "link": "https://www.msnbc.com/top-stories/latest/government-shutdown-democrats-senate-deal-republicans-trump-rcna243084",
    "timestamp": "2025-11-10T21:08:21Z"
  },
  {
    "title": "Syria’s Sharaa Meets with President Trump at White House",
    "description": "Syrian President Ahmed al-Sharaa met with President Donald Trump at the White House, hoping to get sanctions lifted permanently.\nThe post Syria’s Sharaa Meets with President Trump at White House appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/11/10/syrias-sharaa-meets-with-president-trump-at-white-house/",
    "timestamp": "2025-11-10T21:07:58Z"
  },
  {
    "title": "Democrats were never going to win the shutdown fight",
    "description": "After forcing the longest US government shutdown in history, Senate Democrats threw in the towel Sunday night. Eight Democratic senators voted with the Republicans Sunday to advance a deal to reopen the government, even though the deal includes no significant…",
    "link": "https://www.vox.com/politics/468203/democrats-shutdown-cave-why-filibuster-schumer",
    "timestamp": "2025-11-10T21:07:21Z"
  },
  {
    "title": "Trump threatens to 'pay back' $2 trillion if Supreme Court rules against tariffs",
    "description": "President Donald Trump warned that there would be a $2 trillion \"catastrophe\" if the U.S. Supreme Court ruled against his ability to impose emergency tariffs, despite having collected only around $100 billion.\"The 'Pay Back' Numbers being quoted by the Radica…",
    "link": "https://www.rawstory.com/trump-2-billion-tariffs/",
    "timestamp": "2025-11-10T21:07:03Z"
  },
  {
    "title": "Oil Rises on Shutdown Hopes",
    "description": "Oil prices rose as optimism over a potential U.S. government reopening boosted risk appetite across markets.",
    "link": "https://www.rigzone.com/news/wire/oil_rises_on_shutdown_hopes-10-nov-2025-182284-article/",
    "timestamp": "2025-11-10T21:05:02Z"
  },
  {
    "title": "Trump names his former lawyer Coale to serve as Belarus envoy",
    "description": "Coale is currently serving as a deputy special envoy to Ukraine.",
    "link": "https://www.bostonherald.com/2025/11/10/trump-names-his-former-lawyer-coale-to-serve-as-belarus-envoy/",
    "timestamp": "2025-11-10T21:04:13Z"
  },
  {
    "title": "Chief Justice Faces Career-Defining Decision on Trump",
    "description": "“Chief Justice John Roberts faces a defining challenge as he enters his third decade leading the Supreme Court: how far to let Donald Trump’s presidency rewrite the bounds of executive power,” the Wall Street Journal reports. “Over Trump’s first year back in …",
    "link": "https://politicalwire.com/2025/11/10/chief-justice-faces-career-defining-decision-on-trump/",
    "timestamp": "2025-11-10T21:03:31Z"
  },
  {
    "title": "Chuck Schumer Needs to Go",
    "description": "The Democratic Senate leader has lost the thread. Everyone is suffering because of his lack of judgment.",
    "link": "https://newrepublic.com/article/202985/chuck-schumer-failure-government-shutdown",
    "timestamp": "2025-11-10T21:03:29Z"
  },
  {
    "title": "Trump: Deal with India to be different than past one",
    "description": "United States President Donald Trump announced on Monday that Washington will make a deal with India, adding that this agreement will be \"different to the one we had in the past.\"\"Right now, the tarif...",
    "link": "https://biztoc.com/x/4a174b04ee8e3a4d",
    "timestamp": "2025-11-10T21:03:26Z"
  },
  {
    "title": "The last fortress of Donbass: Why Pokrovsk matters – and what its fall would mean for Ukraine",
    "description": "Behind the headlines, Russia’s advance in Donbass reveals shifting tactics, collapsing defenses, and the stakes of 2025’s decisive fight Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/627586-battle-world-is-watching-pokrovsk/",
    "timestamp": "2025-11-10T21:02:20Z"
  },
  {
    "title": "50-Year Home Mortgage Means Debt For LIFE",
    "description": "The Trump Administration has suggested that the majority of the American population be in debt for the majority of their life, but by creating a 50-year home mortgage. Federal Housing Finance Agency (FHFA) Director Bill Pulte confirmed this Saturday.",
    "link": "https://www.shtfplan.com/economics/50-year-home-mortgage-means-debt-for-life",
    "timestamp": "2025-11-10T21:00:47Z"
  },
  {
    "title": "The Humiliating No Kings Boycott Failure",
    "description": "It’s only fair to give credit where credit is due. Former Democrats who now comprise the socialist base of that party are very good at inciting people to vent their collective... Read More\nThe post The Humiliating No Kings Boycott Failure appeared first on Th…",
    "link": "https://www.dailysignal.com/2025/11/10/humiliating-no-kings-boycott-failure/",
    "timestamp": "2025-11-10T21:00:00Z"
  },
  {
    "title": "End to US government shutdown in sight as Democrats quarrel",
    "description": "House Speaker Johnson said the “nightmare is finally coming to an end” after the Senate voted 60-40 to consider a compromise bill to fund the government.",
    "link": "https://www.channelnewsasia.com/world/end-us-government-shutdown-in-sight-democrats-quarrel-5458536",
    "timestamp": "2025-11-10T20:58:33Z"
  },
  {
    "title": "No time for time-wasting as Cop30 climate summit aims to put decades of words into action",
    "description": "Talks began immediately after early agreement on agenda",
    "link": "https://www.irishtimes.com/world/americas/2025/11/10/no-time-for-time-wasting-as-cop30-climate-summit-aims-to-put-decades-of-words-into-action/",
    "timestamp": "2025-11-10T20:55:16Z"
  },
  {
    "title": "Giant Climate Fest To Host ‘Ending Deforestation’ Panel After Ripping ‘The Hell Out Of Rainforest’",
    "description": "COP30 is expected to host talks on \"ending deforestation\" after developers carved a highway through the Amazon rainforest to facilitate attendees.",
    "link": "https://dailycaller.com/2025/11/10/un-cop30-deforestation-amazon-rainforest-trump-brazil/",
    "timestamp": "2025-11-10T20:54:33Z"
  },
  {
    "title": "Trump’s 50-Year Mortgage Is the Best Deal in Finance",
    "description": "President Donald Trump recently floated a proposal to introduce 50-year mortgages, a move aimed at helping more first-time homebuyers enter a housing market that has been increasingly out of reach.\nFor years, younger generations have sounded the alarm about a…",
    "link": "https://biztoc.com/x/7ddef31828a9b2e0",
    "timestamp": "2025-11-10T20:52:28Z"
  },
  {
    "title": "US mediator Kushner and Netanyahu discuss phase two of Gaza truce",
    "description": "US mediator Jared Kushner and Israeli Prime Minister Benjamin Netanyahu held talks Monday on the second phase of the Gaza ceasefire, as Washington intensified its efforts to ensure the fragile truce endures. Netanyahu, meanwhile, said Israel would enforce the…",
    "link": "https://www.digitaljournal.com/world/us-mediator-kushner-and-netanyahu-discuss-phase-two-of-gaza-truce/article",
    "timestamp": "2025-11-10T20:52:20Z"
  },
  {
    "title": "First time: The Jihadist in the White House",
    "description": "This is an unusual meeting that just a few months ago would have been hard to believe would take place. It was reported that the two discussed relations between the countries and the promotion of common interests.",
    "link": "https://www.israelnationalnews.com/news/417593",
    "timestamp": "2025-11-10T20:50:21Z"
  },
  {
    "title": "US airline disruptions persist amid prolonged government shutdown chaos",
    "description": "US airline havoc continues with over 1,700 cancellations and 5,000 delays despite signs shutdown may be ending.",
    "link": "https://www.aljazeera.com/economy/2025/11/10/us-airline-disruptions-persist-amid-prolonged-government-shutdown-chaos",
    "timestamp": "2025-11-10T20:49:03Z"
  },
  {
    "title": "Democrats Call for New Leadership After Schumer Caves on “Terrible” GOP Deal",
    "description": "“If you can’t lead the fight to stop healthcare premiums from skyrocketing … what will you fight for?” said Ro Khanna.",
    "link": "https://truthout.org/articles/democrats-call-for-new-leadership-after-schumer-caves-on-terrible-gop-deal/",
    "timestamp": "2025-11-10T20:48:22Z"
  },
  {
    "title": "Here's what could happen to expiring health subsidies as a deal to end the shutdown emerges",
    "description": "A legislative package that could end the weekslong government shutdown leaves out any clear resolution on the expiring Affordable Care Act tax credits that have made private health insurance less costly for millions. The deal agreed to by Senate Republicans a…",
    "link": "https://apnews.com/article/shutdown-health-tax-credits-affordable-care-act-2b5ae3651ff16783a00e00dc1ce264bf",
    "timestamp": "2025-11-10T20:47:46Z"
  },
  {
    "title": "Here's What Happened Today: Monday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-monday-november-2-6870435-Nov2025/",
    "timestamp": "2025-11-10T20:46:12Z"
  },
  {
    "title": "Latin America’s Disjointed Reaction to Trump’s Drug Boat War",
    "description": "The region is facing historic levels of fragmentation, one expert said.",
    "link": "http://foreignpolicy.com/2025/11/10/latin-america-trump-drug-boat-war-venezuela-maduro/",
    "timestamp": "2025-11-10T20:46:01Z"
  },
  {
    "title": "Trump's Packing! Melania Trump 'Snapped at Pal' for Claiming Husband Donald Has a 'Small Manhood'",
    "description": "Melania Trump 'snapped' at a pal for claiming Donald Trump has a 'small manhood,' according to a book.",
    "link": "https://radaronline.com/p/melania-trump-donald-trump-manhood-small-response-snapped/",
    "timestamp": "2025-11-10T20:46:00Z"
  },
  {
    "title": "Trump Threatens Air Traffic Controllers 'Who Did Nothing but Complain' amid Shutdown, Promises $10,000 to Those Who Work",
    "description": "As delays at major airports start to build up, the president went on a rant against federal employees for refusing to work without pay",
    "link": "https://people.com/trump-threatens-air-traffic-controllers-who-did-nothing-but-complain-amid-shutdown-11846949",
    "timestamp": "2025-11-10T20:45:26Z"
  },
  {
    "title": "Disbarred Rudy Giuliani wants his law license back after Trump pardon over 2020 election",
    "description": "Long ago a respected lawman, who served as U.S. attorney for the Southern District of New York in the 1980s and later became known as “America’s Mayor” for his leadership at City Hall following the…",
    "link": "https://www.nydailynews.com/2025/11/10/disbarred-rudy-giuliani-wants-his-law-license-back-after-trump-pardon-over-2020-election/",
    "timestamp": "2025-11-10T20:45:05Z"
  },
  {
    "title": "Michelle Obama Says President Trump’s East Wing Demolition Is a ‘Reflection’ of How He Views the ‘Role’ of First Lady",
    "description": "Michelle Obama isn’t too fond of the changes President Donald Trump has made to the White House. Last month, Trump demolished the East Wing, where the First ...",
    "link": "https://globemagazine.com/michelle-obama-says-president-trumps-east-wing-demolition-is-a-reflection-of-how-he-views-the-role-of-first-lady/",
    "timestamp": "2025-11-10T20:43:38Z"
  },
  {
    "title": "SNAP fully funded, Healey says, as she urges residents to use benefits",
    "description": "Gov. Maura Healey tore into President Donald Trump, saying he made a choice to \"starve Americans.\"",
    "link": "https://www.boston.com/news/local-news/2025/11/10/snap-fully-funded-healey-says-as-she-urges-residents-to-use-benefits/",
    "timestamp": "2025-11-10T20:41:39Z"
  },
  {
    "title": "Canadian author's latest novel imagines a plot to make Canada the 51st state before Trump did",
    "description": "Louise Penny's The Black Wolf includes a cross-border plot to leverage control of water systems and resources in Canada",
    "link": "https://nationalpost.com/news/canada/louise-penny-the-black-wolf-51st-state",
    "timestamp": "2025-11-10T20:41:15Z"
  },
  {
    "title": "Canadian author's latest novel imagines a plot to make Canada the 51st state before Trump did",
    "description": "Louise Penny's The Black Wolf includes a cross-border plot to leverage control of water systems and resources in Canada",
    "link": "https://nationalpost.com/entertainment/louise-penny-the-black-wolf-51st-state",
    "timestamp": "2025-11-10T20:41:15Z"
  },
  {
    "title": "Trump claims $2 trillion at stake in tariff dispute",
    "description": "United States President Donald Trump escalated his defense of his tariff strategy on Monday, warning that repealing or reversing his trade policies could cost the country over $2 trillion in lost reve...",
    "link": "https://biztoc.com/x/13df900eef151ca9",
    "timestamp": "2025-11-10T20:41:10Z"
  },
  {
    "title": "Why did Donald Trump exclude himself in his pardons for 2020 election-related crimes?",
    "description": "President Donald Trump’s pardon of political allies for crimes related to the 2020 election raises a host questions, one of them being: Why did Trump go out of his way to exclude himself?",
    "link": "https://biztoc.com/x/0a345e63b6b28939",
    "timestamp": "2025-11-10T20:40:46Z"
  },
  {
    "title": "Deal announced with makers of GLP-1 obesity medications",
    "description": "Access to the obesity medications known as GLP-1 receptor agonists has been a consistent problem for patients because of their cost and spotty insurance coverage.",
    "link": "https://omaha.com/news/nation-world/business/health-care/article_0044fdf0-d834-5497-925f-f5943c019e39.html",
    "timestamp": "2025-11-10T20:39:35Z"
  },
  {
    "title": "Love your kids, have lots of them? The future is yours. Love your \"stuff\", don't want kids? You're doomed.",
    "description": "Think Mamdami is the worst thing? No matter. If you don't have all your kids, if you practiced contraception and abortion, you're already pitching yourself headlong over the lemming cliff. I live in the area with the greatest variety of ethnic groups. Forty y…",
    "link": "https://freerepublic.com/focus/f-chat/4351825/posts",
    "timestamp": "2025-11-10T20:38:27Z"
  },
  {
    "title": "No decision yet on transgender athletes' Games eligibility, IOC says",
    "description": "The International Olympic Committee heard from experts from the \"Protection of the Female Category\" working group last week, with a decision set to be made on whether transgender athletes can compete in the Olympics.",
    "link": "https://www.abc.net.au/news/2025-11-11/ioc-moves-closer-to-banning-transgender-women-from-female-sport/105994628",
    "timestamp": "2025-11-10T20:38:14Z"
  },
  {
    "title": "Trump threatens to sue BBC for $1bn over speech edit",
    "description": "The BBC has been engulfed in a crisis, with both its director-general and head of news resigning after it emerged a speech by Donald Trump was edited misleadingly in a Panorama documentary that aired last year.",
    "link": "https://news.sky.com/story/trump-threatens-to-sue-bbc-for-1bn-over-speech-edit-13468285",
    "timestamp": "2025-11-10T20:37:00Z"
  },
  {
    "title": "Trump Pardons All His Election-Stealing Pals, Because Of Course",
    "description": "Guess we all knew this was coming.",
    "link": "https://www.wonkette.com/p/trump-pardons-all-his-election-stealing",
    "timestamp": "2025-11-10T20:36:05Z"
  },
  {
    "title": "Trump Proposes $2,000 Tariff Refund Check For Americans",
    "description": "President Donald Trump shared on social media that some Americans might receive a $2,000 stimulus check funded by tariffs",
    "link": "https://www.wftv.com/news/local/trump-proposes-2000-tariff-refund-check-americans/EHVFJDAD75DEBHRM3JOUUDOGOE/",
    "timestamp": "2025-11-10T20:34:58Z"
  },
  {
    "title": "Man Pardoned By Trump Sentenced to Jail For New Crimes, Including Alleged Sexual Abuse",
    "description": "Jonathan Braun is being sent back to prison after he committed a series of heinous acts, including assaulting a three-year-old and sexually abusing a nanny. \nThe post Man Pardoned By Trump Sentenced to Jail For New Crimes, Including Alleged Sexual Abuse first…",
    "link": "https://www.mediaite.com/politics/man-pardoned-by-trump-sentenced-to-jail-for-new-crimes-including-alleged-sexual-abuse/",
    "timestamp": "2025-11-10T20:34:51Z"
  },
  {
    "title": "US extends pause on Syria sanctions",
    "description": "Washington has extended a waiver on comprehensive sanctions against Syria for another 180 days Read Full Article at RT.com",
    "link": "https://www.rt.com/news/627591-us-extend-pause-syria-sanctions/",
    "timestamp": "2025-11-10T20:33:43Z"
  },
  {
    "title": "‘I’m Not Making Things Up!’ MSNBC’s Katy Tur Snaps At Tim Kaine For Accusing Her of ‘Overdramatizing’ Dem Split",
    "description": "Katy Tur snapped back at Tim Kaine after he accused her of \"overdramatizing\" a rift in the Democratic Party following the Senate vote reopening the government.\nThe post ‘I’m Not Making Things Up!’ MSNBC’s Katy Tur Snaps At Tim Kaine For Accusing Her of ‘Overd…",
    "link": "https://www.mediaite.com/media/news/im-not-making-things-up-msnbcs-katy-tur-snaps-at-tim-kaine-for-accusing-her-of-overdramatizing-dem-split/",
    "timestamp": "2025-11-10T20:32:11Z"
  },
  {
    "title": "Trump’s warning to Nigeria offers hope to nation's persecuted Christians",
    "description": "Many Nigerians welcome Trump’s threat of action over Christian killings, hoping it will pressure their government to protect churches after years of deadly attacks.",
    "link": "https://www.foxnews.com/world/trumps-warning-nigeria-offers-hope-nations-persecuted-christians",
    "timestamp": "2025-11-10T20:30:50Z"
  },
  {
    "title": "Ros Atkins on... the BBC resignations",
    "description": "The BBC's Analysis Editor Ros Atkins looks at the resignations of BBC bosses - and how this crisis didn't come out of nowhere.",
    "link": "https://www.bbc.com/news/videos/cr7mp7rnx48o",
    "timestamp": "2025-11-10T20:30:33Z"
  },
  {
    "title": "Trump’s promise to send Americans $2,000 would blow massive hole in his budget: report",
    "description": "President Donald Trump's proposed $2,000-per-person plan could cost the government $300 billion, according to a new report.The president confirmed his intention to give away $2,000 per person in a post to Truth Social on Sunday. Trump claimed \"a dividend of a…",
    "link": "https://www.rawstory.com/donald-trump-2000/",
    "timestamp": "2025-11-10T20:30:07Z"
  },
  {
    "title": "Trump's 50-year mortgage proposal: What would it mean for homebuyers?",
    "description": "President Donald Trump and administration officials signaled that they're planning to develop a 50-year mortgage that they think could expand access to homeownership, though experts are cautioning the longer-term mortgages could hamstring homebuyers.\nTrump on…",
    "link": "https://biztoc.com/x/13b4e39bd995e4df",
    "timestamp": "2025-11-10T20:30:00Z"
  },
  {
    "title": "The Irish Times view on public service media: a principle worth defending",
    "description": "To dismantle the BBC would constitute an act of extraordinary self-harm",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/11/10/the-irish-times-view-on-public-service-media-a-principle-worth-defending/",
    "timestamp": "2025-11-10T20:30:00Z"
  },
  {
    "title": "BBC Chiefs Quit After Report Criticizes Editing of Trump Speech",
    "description": "The BBC apologized for a misleading edit of remarks by Donald Trump that featured in a documentary last year, prompting a lawsuit threat by the US president and fresh questions about the future of Britain’s national broadcaster.\nBritish Broadcasting Corp. Cha…",
    "link": "https://biztoc.com/x/e44e6b56d0c2b2fc",
    "timestamp": "2025-11-10T20:29:51Z"
  },
  {
    "title": "The government shutdown may last longer because of a fight over hemp",
    "description": "WASHINGTON — Though Congress appears to have a deal to end the government shutdown, a vote on that agreement is being held up by an unexpected issue: hemp.Sen.",
    "link": "https://www.nbcnews.com/politics/congress/government-shutdown-may-last-longer-fight-hemp-rcna243075",
    "timestamp": "2025-11-10T20:28:47Z"
  },
  {
    "title": "Mike Johnson eyes Wednesday vote with end of government shutdown in sight",
    "description": "House Speaker Mike Johnson expects a Wednesday vote to end government shutdown as GOP lawmakers rush back to Washington for a critical session.",
    "link": "https://www.foxnews.com/politics/mike-johnson-eyes-wednesday-vote-end-government-shutdown-sight",
    "timestamp": "2025-11-10T20:26:16Z"
  },
  {
    "title": "Whoopi Goldberg: Trump Administration Acting 'Insane,' Like 'Clowns'",
    "description": "Monday on ABC's \"The View,\" co-host Whoopi Goldberg said the Trump administration was acting \"insane\" and like \"clowns\" who can't figure out \"what the hell they're doing.\"\nThe post Whoopi Goldberg: Trump Administration Acting ‘Insane,’ Like ‘Clowns’ appeared …",
    "link": "https://www.breitbart.com/clips/2025/11/10/whoopi-goldberg-trump-administration-acting-insane-like-clowns/",
    "timestamp": "2025-11-10T20:24:15Z"
  },
  {
    "title": "An emerging shutdown deal doesn't extend expiring health subsidies. Here's what could happen to them",
    "description": "A legislative package that could end the weekslong government shutdown leaves out any clear resolution on the expiring Affordable Care Act tax credits that have made private health insurance less costly for millions.",
    "link": "https://www.clickondetroit.com/health/2025/11/10/an-emerging-shutdown-deal-doesnt-extend-expiring-health-subsidies-heres-what-could-happen-to-them/",
    "timestamp": "2025-11-10T20:22:48Z"
  },
  {
    "title": "J6 rioter now accused of kidnapping and aggravated assault",
    "description": "A pattern has emerged as another Jan. 6 rioter has landed in legal trouble, as Republicans have aimed to minimize the insurrectionist rioters and whether they were armed, according to an MSNBC report Monday. John Emanuel Banuelos, 40, was arrested last month …",
    "link": "https://www.rawstory.com/january-6-rioter/",
    "timestamp": "2025-11-10T20:21:02Z"
  },
  {
    "title": "Brazil's COP30 Climate Summit Opens With A Plea For Countries To Get Along",
    "description": "The world’s biggest historical emitter of greenhouse gases – the United States – opted to skip the two-week summit in the Amazon city of Belem.",
    "link": "https://www.huffpost.com/entry/brazil-cop30-climate-change-countries-get-along_n_6912417ce4b0b840aac157a5",
    "timestamp": "2025-11-10T20:19:56Z"
  },
  {
    "title": "Jasmine Crockett Spouts Conspiracy Theory About GOP Rigging Midterm Elections Using Dominion Machines",
    "description": "Jasmine Crockett baselessly theorized that Republicans may be planning to rig the 2026 midterm elections using Dominion voting machines.",
    "link": "https://dailycaller.com/2025/11/10/jasmine-crockett-conspiracy-theory-gop-rigging-midterm-elections-dominion/",
    "timestamp": "2025-11-10T20:19:45Z"
  },
  {
    "title": "Targeting Obama, Trump promotes a satirical item about the ACA as if it were real",
    "description": "There were already concerns about Donald being too gullible to do his job. Then prompted a satirical item about Barack Obama receiving \"Obamacare\" royalties.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/targeting-obama-trump-promotes-satirical-item-aca-real-rcna243085",
    "timestamp": "2025-11-10T20:19:38Z"
  },
  {
    "title": "Trump tells air traffic controllers to return to work as flight cancellations jump",
    "description": "Summary Trump threatens penalties for absent air traffic controllers FAA reports 20-40% of controllers have been absent at major airports Senate advances bill to end government shutdown WASHINGTON, Nov 10 (Reuters) - President Donald Trump on Monday demanded …",
    "link": "https://freerepublic.com/focus/f-news/4351819/posts",
    "timestamp": "2025-11-10T20:19:20Z"
  },
  {
    "title": "Trump hosts 'tough guy' Syrian president in historic meeting",
    "description": "Ahmed al Sharaa, 43, led rebel forces that overturned Syrian dictator Bashar al Assad last December. He has been described by Donald Trump as a \"very strong leader\".",
    "link": "https://news.sky.com/story/trump-hosts-syrian-president-al-sharaa-at-historic-oval-office-meeting-13468274",
    "timestamp": "2025-11-10T20:19:00Z"
  },
  {
    "title": "If Capital Strikes Against Mamdani, Organized Worker Power Can Strike Back",
    "description": "Let’s study how Wall Street sank Mamdani-style municipal plans back in 1975 — and get prepared for a similar fight.",
    "link": "https://truthout.org/articles/if-capital-strikes-against-mamdani-organized-worker-power-can-strike-back/",
    "timestamp": "2025-11-10T20:17:24Z"
  },
  {
    "title": "Is a 4th stimulus check really coming this month? Here’s what we know so far",
    "description": "Americans may receive stimulus checks if President Trump's proposals gain traction. He suggests funding these payments through tariff revenue and contributing to health savings accounts. However, any such plan requires approval from Congress. A key hurdle is …",
    "link": "https://economictimes.indiatimes.com/news/international/us/is-a-4th-stimulus-check-really-coming-this-month-heres-what-we-know-so-far/articleshow/125233610.cms",
    "timestamp": "2025-11-10T20:13:32Z"
  },
  {
    "title": "President Trump to Recommend $10K Bonuses for Air Traffic Controllers Who Worked During Democrat Shutdown",
    "description": "President Donald Trump is recommending air traffic controllers who remained at their posts during the Democrat government shutdown be rewarded.\nThe post President Trump to Recommend $10K Bonuses for Air Traffic Controllers Who Worked During Democrat Shutdown …",
    "link": "https://www.breitbart.com/politics/2025/11/10/president-trump-to-recommend-10k-bonuses-air-traffic-controllers-who-worked-during-democrat-shutdown/",
    "timestamp": "2025-11-10T20:12:52Z"
  },
  {
    "title": "Streamer Cinna claims YourRAGE once said he didn’t like her before Pokémon collab",
    "description": "Popular streamer Brittany “Cinna” revealed that fellow content creator Josh “YourRAGE” initially disliked her due to unfounded rumors. He later admitted this to her, explaining his negative first impression stemmed from misinformation. Their eventual Pokémon …",
    "link": "https://timesofindia.indiatimes.com/world/us-streamers/streamer-cinna-claims-yourrage-once-said-he-didnt-like-her-before-pokmon-collab/articleshow/125234158.cms",
    "timestamp": "2025-11-10T20:12:25Z"
  },
  {
    "title": "Why did Donald Trump exclude himself in his pardons for 2020 election-related crimes?",
    "description": "President Donald Trump’s pardon of political allies for crimes related to the 2020 election raises a host questions, one of them being: Why did Trump go out of his way to exclude himself?",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/donald-trump-pardons-2020-election-rcna243013",
    "timestamp": "2025-11-10T20:12:23Z"
  },
  {
    "title": "EToro stock jumps on Q3 results, $150M buyback plan",
    "description": "eToro’s assets rose 76% to $20.8B in Q3 as crypto trading and AI tools fueled growth. The company also announced a $150M share repurchase program.",
    "link": "https://cointelegraph.com/news/etoro-stock-q3-results-150m-buyback-plan",
    "timestamp": "2025-11-10T20:12:03Z"
  },
  {
    "title": "Israeli official: Goal is to topple Iranian regime by 2029",
    "description": "Amid reports of Iran restoring its nuclear facilities, an Israeli official tells Kan News that Israel seeks to topple the Islamic regime by the time President Trump ends his term.",
    "link": "https://www.israelnationalnews.com/news/417592",
    "timestamp": "2025-11-10T20:11:07Z"
  },
  {
    "title": "Dave Ramsey In Critical Condition After Learning Of 50-Year Mortgage",
    "description": "FRANKLIN, TN — Financial consultant and radio host Dave Ramsey was reported to be in critical condition Monday after learning that President Donald Trump had begun pushing a 50-year home mortgage.",
    "link": "https://babylonbee.com/news/dave-ramsey-in-critical-condition-after-learning-of-50-year-mortgage",
    "timestamp": "2025-11-10T20:09:12Z"
  },
  {
    "title": "Award-Winning Photographers Describe Emotional Toll of Documenting ICE Arrests",
    "description": "Award-winning photographers documenting immigration arrests in New York City have witnessed far-flung strife and conflict, but nothing quite like this.\n[Read More]",
    "link": "https://petapixel.com/2025/11/10/award-winning-photographers-describe-emotional-toll-of-documenting-ice-arrests/",
    "timestamp": "2025-11-10T20:07:47Z"
  },
  {
    "title": "Americanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion?",
    "description": "And how will the U.S. government shutdown end?",
    "link": "https://www.bbc.co.uk/sounds/play/p0mfxsk5",
    "timestamp": "2025-11-10T20:07:00Z"
  },
  {
    "title": "‘Trainwreck!’ More Democrats Fume at Shutdown Deal, Call for Schumer’s Head",
    "description": "Re. Jared Moskowitz (D-FL) posted a meme on X, showing Schumer in the movie poster for “Trainwreck” and added, “Different Schumer, same title.”\nThe post ‘Trainwreck!’ More Democrats Fume at Shutdown Deal, Call for Schumer’s Head first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trainwreck-more-democrats-fume-at-shutdown-deal-call-for-schumers-head/",
    "timestamp": "2025-11-10T20:05:48Z"
  },
  {
    "title": "Speaker Johnson calls back House to vote after Senate budges on shutdown",
    "description": "House Speaker Mike Johnson said he called representatives to return to Washington, D.C., to vote on a Senate-backed measure to fund the government.",
    "link": "https://www.upi.com/Top_News/US/2025/11/10/Mike-Johnson-congress-government-Senate-shutdown-bill-vote/4811762796242/",
    "timestamp": "2025-11-10T20:05:26Z"
  },
  {
    "title": "No Federal Stimulus Checks in 2025—Here's What's Actually Happening",
    "description": "Despite viral claims and political proposals, no federal stimulus checks are being issued in 2025. Here's what's real, what's hearsay, and what Americans can expect.",
    "link": "https://www.ibtimes.com/no-federal-stimulus-checks-2025heres-whats-actually-happening-3790045",
    "timestamp": "2025-11-10T20:01:00Z"
  },
  {
    "title": "Cheryl Hines Calls Larry David’s Takedown of Bill Maher ‘Crazy’",
    "description": "Hines isn’t taking her ‘Curb Your Enthusiasm’ co-star’s side when it comes to Trump",
    "link": "https://www.cracked.com/article_49071_cheryl-hines-calls-larry-davids-takedown-of-bill-maher-crazy.html",
    "timestamp": "2025-11-10T20:00:00Z"
  },
  {
    "title": "Not just anti-Trump: BBC now hit with SECOND scandal over its gender ‘reporting’",
    "description": "'A constant drip-feed of one-sided stories, usually news features, celebrating the trans experience without adequate balance or objectivity'",
    "link": "https://www.wnd.com/2025/11/not-just-anti-trump-bbc-now-hit-second/",
    "timestamp": "2025-11-10T19:59:01Z"
  },
  {
    "title": "'A very bad night': Democrats face blowback from their own party over shutdown deal",
    "description": "'A very bad night': Democrats face blowback from their own party over shutdown dealgo.com",
    "link": "https://abcnews.go.com/Politics/bad-night-democrats-face-blowback-party-shutdown-deal/story?id=127379532",
    "timestamp": "2025-11-10T19:58:18Z"
  },
  {
    "title": "AI stocks lead Wall Street rebound as Nvidia, Palantir surge and S&P 500 claws back last week’s losses",
    "description": "Nvidia was by far the strongest force lifting the market and rallied 4.8%. It's a bounceback after Nvidia and other winners in the frenzy around artificial-intelligence technology were at the center of last week’s drop.",
    "link": "https://fortune.com/2025/11/10/ai-stocks-lead-wall-street-rebound-as-nvidia-palantir-surge-and-sp-500-claws-back-last-weeks-losses-market/",
    "timestamp": "2025-11-10T19:58:18Z"
  },
  {
    "title": "Bolivia Restores Ties with U.S. on President Rodrigo Paz's First Day in Office After 20 Years of Socialist Rule",
    "description": "Recently inaugurated Bolivian President Rodrigo Paz, in the first hours of his administration, restored Bolivia's full diplomatic relations with the United States over the weekend, ending a 17-year long rupture caused by the formerly ruling Movement Towards S…",
    "link": "https://www.breitbart.com/latin-america/2025/11/10/bolivia-restores-ties-with-u-s-on-president-rodrigo-pazs-first-day-in-office-after-20-years-of-socialist-rule/",
    "timestamp": "2025-11-10T19:58:00Z"
  },
  {
    "title": "Eric Trump Says Q4 2025 Will Be ‘Unbelievable For Bitcoin’, Calls $1 Million BTC Price",
    "description": "Eric Trump, son of US President Donald Trump and executive vice president of the Trump Organization, has revealed new bullish predictions for Bitcoin (BTC).",
    "link": "https://zycrypto.com/eric-trump-says-q4-2025-will-be-unbelievable-for-bitcoin-calls-1-million-btc-price/",
    "timestamp": "2025-11-10T19:57:28Z"
  },
  {
    "title": "'Chaos has gone' - quiet streets on Texas border after Trump crackdown",
    "description": "In Chicago, Los Angeles and Portland, the immigration debate has spilled into the streets, sparking almost daily demonstrations while immigration agents ramp up arrests. But in El Paso - a city in Texas on the US-Mexico border - the streets are unusually quie…",
    "link": "https://freerepublic.com/focus/f-news/4351814/posts",
    "timestamp": "2025-11-10T19:56:12Z"
  },
  {
    "title": "A look at prominent people pardoned by Trump after they tried to overturn his 2020 election loss",
    "description": "They're part of the effort to rewrite the history of Trump's election defeat.",
    "link": "https://www.bostonherald.com/2025/11/10/trump-pardons-2020-election/",
    "timestamp": "2025-11-10T19:55:44Z"
  }
]