[
  {
    "title": "‘Scheduling issues’ scupper Rubio-Kallas meeting in Washington",
    "description": "Sit-down between top diplomats is off.",
    "link": "https://www.politico.eu/article/kaja-kallas-marco-rubio-scheduling-issues-meeting-washington/",
    "timestamp": "2025-02-26T15:57:59Z"
  },
  {
    "title": "‘The Daily Show’ Host Desi Lydic Uncovers Trump’s True Kryptonite: ‘I Assumed It Was Vegetables!’ | Video",
    "description": "\"Look at him! Look at that smile! The guy is smitten,\" the Comedy Central star marvels\nThe post ‘The Daily Show’ Host Desi Lydic Uncovers Trump’s True Kryptonite: ‘I Assumed It Was Vegetables!’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-daily-show-trump-kryptonite-sexy-accents-desi-lydic/",
    "timestamp": "2025-02-26T15:57:24Z"
  },
  {
    "title": "Elon Musk Seizes on Plane Crashes to Make Himself Even Richer",
    "description": "As he works to slash millions in federal spending, Elon Musk is boosting his own company through yet another government contract, this time at the disaster-ridden Federal Aviation Administration.\r\nFollowing a number of high-profile plane crashes—including the…",
    "link": "https://newrepublic.com/post/192006/elon-musk-plane-crashes-faa-starlink-contract",
    "timestamp": "2025-02-26T15:56:51Z"
  },
  {
    "title": "The Scoop: Investors left ‘gobsmacked’ after Unilever’s abrupt CEO ouster",
    "description": "Also: American consumer confidence continues to drop; McDonald’s promotion emphasizes commitment to providing customer value. Unilever surprised investors on Tuesday by ousting well-regarded CEO Hein Schumacher after less than two years on the job.  Schumache…",
    "link": "https://www.prdaily.com/the-scoop-investors-left-gobsmacked-after-unilevers-abrupt-ceo-ouster/",
    "timestamp": "2025-02-26T15:56:42Z"
  },
  {
    "title": "Minnesota Gov. Tim Walz Says No To 2026 U.S. Senate Run",
    "description": "The former Democratic vice presidential nominee had previously considered running to replace outgoing Sen. Tina Smith (D).",
    "link": "https://www.huffpost.com/entry/tim-walz-not-running-for-us-senate_n_67bf24b3e4b0d509934af8f3",
    "timestamp": "2025-02-26T15:56:32Z"
  },
  {
    "title": "VA Job Cuts Spark Anger: 'Putting Veterans Last'",
    "description": "Sen. Richard Blumenthal, a Democrat and the ranking member of the Senate VA committee, expressed concerns following the administration's sweeping cuts.",
    "link": "https://www.newsweek.com/va-job-cuts-veterans-association-2036543",
    "timestamp": "2025-02-26T15:53:26Z"
  },
  {
    "title": "Ukraine minerals deal: What we know so far - BBC.com",
    "description": "Ukraine minerals deal: What we know so farBBC.com What We Know About the U.S.-Ukraine Minerals DealThe New York Times Zelensky calls US-Ukraine minerals deal a ‘framework’ as it emerges agreement has no security guaranteesCNN Donald Trump is closer to getting…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176551283",
    "timestamp": "2025-02-26T15:53:07Z"
  },
  {
    "title": "The Latest: House GOP pushes ‘big’ budget resolution to passage",
    "description": "With a push from President Donald Trump, House Republicans have sent a GOP budget blueprint to passage, a step toward delivering Trump’s “big, beautiful bill.”",
    "link": "https://abcnews.go.com/Politics/wireStory/latest-house-gop-pushes-big-budget-resolution-passage-119203646",
    "timestamp": "2025-02-26T15:50:29Z"
  },
  {
    "title": "Stock market today: Wall Street climbs and heads for its first gain in 5 days",
    "description": "U.S. stock indexes are rising after a four-day losing streak knocked Wall Street off its all-time high and threw some of its brightest stars into reverse",
    "link": "https://abcnews.go.com/US/wireStory/stock-market-today-wall-street-climbs-heads-gain-119197164",
    "timestamp": "2025-02-26T15:50:29Z"
  },
  {
    "title": "The Latest: House GOP pushes ‘big’ budget resolution to passage",
    "description": "With a push from President Donald Trump, House Republicans have sent a GOP budget blueprint to passage, a step toward delivering Trump’s “big, beautiful bill.”",
    "link": "https://abcnews.go.com/US/wireStory/latest-house-gop-pushes-big-budget-resolution-passage-119203645",
    "timestamp": "2025-02-26T15:50:28Z"
  },
  {
    "title": "NYC Mayor Eric Adams claims prosecutorial misconduct, asking judge to dismiss criminal case",
    "description": "New York City Mayor Eric Adams is asking a federal judge to toss out the corruption case against him, alleging prosecutorial misconduct, even as the Justice Department seeks dismissal of the charges on the Democrat's behalf",
    "link": "https://abcnews.go.com/US/wireStory/nyc-mayor-eric-adams-claims-prosecutorial-misconduct-judge-119203643",
    "timestamp": "2025-02-26T15:50:17Z"
  },
  {
    "title": "Canada's ruling Liberals mount a comeback with Trump threats, polls show",
    "description": "OTTAWA (Reuters) - Canada's ruling Liberals, who a few weeks ago looked certain to lose an election this year, are mounting a major comeback amid the threat of U.S. tariffs and are tied with their rival Conservatives, according to three new polls. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/02/26/canada039s-ruling-liberals-mount-a-comeback-with-trump-threats-polls-show",
    "timestamp": "2025-02-26T15:49:00Z"
  },
  {
    "title": "‘Last Chance’ to Achieve Two-State Solution, UN Mediator Tells Security Council, as Speakers Highlight Need to Sustain Gaza Ceasefire",
    "description": "This may be “the last chance” to achieve a two-State solution — the creation of independent Israel and Palestine coexisting peacefully side by side — a United Nations mediator told the Security Council today, as it considered the fragile ceasefire in the Gaza…",
    "link": "https://press.un.org/en/2025/sc16007.doc.htm",
    "timestamp": "2025-02-26T15:48:56Z"
  },
  {
    "title": "Trump eyes $5 million ‘gold card’ plan for ‘high-level’ immigrants",
    "description": "In some countries, if you’re willing to write a sizable check, you can become a citizen. Donald Trump's \"gold card\" program would make the U.S. such a country.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-eyes-5-million-gold-card-plan-high-level-immigrants-rcna193815",
    "timestamp": "2025-02-26T15:48:31Z"
  },
  {
    "title": "Trump calls on Congress to make tax cuts permanent",
    "description": "United States President Donald Trump took to Truth Social on Wednesday to share his hopes that Congress will concur to pass long-term tax reform per the proposed budget framework.\"I hope the House and...",
    "link": "https://biztoc.com/x/125079a5a1ce15de",
    "timestamp": "2025-02-26T15:47:51Z"
  },
  {
    "title": "Straight woman's 'reverse' discrimination being heard by US Supreme Court",
    "description": "Marlean Ames is asking the justices to revive her civil rights lawsuit against her employer, Ohio's Department of Youth Services, after lower courts threw it out.",
    "link": "https://www.jpost.com/international/article-843863",
    "timestamp": "2025-02-26T15:47:22Z"
  },
  {
    "title": "NYC Mayor Adams asks judge to dismiss criminal case, claiming prosecutorial misconduct",
    "description": "In papers filed in Manhattan federal court, New York City Mayor Eric Adams' lawyers alleged that the misconduct occurred when the government publicly leaked a letter then-U.S. Attorney Danielle Sassoon wrote to Attorney General Pam Bondi explaining why charge…",
    "link": "https://www.pbs.org/newshour/politics/nyc-mayor-adams-asks-judge-to-dismiss-criminal-case-claiming-prosecutorial-misconduct",
    "timestamp": "2025-02-26T15:46:55Z"
  },
  {
    "title": "The Trump White House will select which media outlets will be part of the press pool",
    "description": "Over the past year, many sensible, intelligent people simply began to tune out the news. There was a bump with the 2024 election, but newspapers, cable news and network news were completely unprepared for the steep drop-off in readership and viewership post-e…",
    "link": "https://www.celebitchy.com/910932/the_trump_white_house_will_select_which_media_outlets_will_be_part_of_the_press_pool/",
    "timestamp": "2025-02-26T15:45:35Z"
  },
  {
    "title": "Metsola in Murica to talk tech tariff tensions",
    "description": "\"Europe is prepared for any outcome, and will speak from a position of strength\", Metsola said in an address to EU ambassadors.",
    "link": "https://www.euractiv.com/section/tech/news/metsola-in-murica-to-talk-tech-tariff-tensions/",
    "timestamp": "2025-02-26T15:45:34Z"
  },
  {
    "title": "After a hiatus, Scientific American once again shows signs of wokeness, dissing the binary nature of biological sex",
    "description": "I had hoped and expected, after the departure of woke editor Laura Helmuth from Scientific American, that the magazine would go back to what it was good at and famous for: presenting solid articles on popular science actually written by scientists. The ideolo…",
    "link": "https://whyevolutionistrue.com/2025/02/26/after-a-hiatus-scientific-american-once-again-shows-signs-of-wokeness-dissing-the-binary-nature-of-biological-sex/",
    "timestamp": "2025-02-26T15:45:23Z"
  },
  {
    "title": "'Crossed the line': Analysts warn 'something has changed' for Musk's place in Trump team",
    "description": "Donald Trump remains publicly supportive of his billionaire benefactor Elon Musk, but some of the president's cabinet members and other administration officials are reportedly frustrated by the highly visible quasi-government official.Musk's role in the admin…",
    "link": "https://www.rawstory.com/what-is-elon-musk-s-role-in-government/",
    "timestamp": "2025-02-26T15:45:19Z"
  },
  {
    "title": "Attorney Tells Congress Biden Prosecuted Pro-Life Americans as “Domestic Terrorists”",
    "description": "A key pro-life attorney who represented peaceful pro-life Americans that President Donald Trump pardoned says Joe Biden and Kamala Harris targeted them for prosecution as “domestic terrorists.” Thomas More Society attorney Peter Breen testified before Congres…",
    "link": "https://freerepublic.com/focus/f-news/4300605/posts",
    "timestamp": "2025-02-26T15:44:54Z"
  },
  {
    "title": "USAID Staff Given 15 Minutes To Collect Belongings, Warned Against Bringing Weapons",
    "description": "The USAID will allow ousted employees 15 minutes to retrieve personal effects from the agency's headquarters Thursday and Friday.",
    "link": "https://dailycaller.com/2025/02/26/usaid-donald-trump-elon-musk-doge-staff-15-minutes-office-belongings/",
    "timestamp": "2025-02-26T15:44:52Z"
  },
  {
    "title": "Oscars A-Z: From Anora to a (disqualified) Hans Zimmer",
    "description": "Understanding this year's Oscars is as simple as learning your ABC - so here's an alphabetical run-down of this year's Academy Awards.",
    "link": "https://news.sky.com/story/oscars-a-z-from-anora-to-a-disqualified-hans-zimmer-13317507",
    "timestamp": "2025-02-26T15:44:00Z"
  },
  {
    "title": "Letters to Editor",
    "description": "Letters to Editor",
    "link": "https://www.thehindubusinessline.com/opinion/letters/letters-to-editor/article69267534.ece",
    "timestamp": "2025-02-26T15:43:47Z"
  },
  {
    "title": "Dark Mark Appears on Trump's Hand",
    "description": "Septuagenarian president Donald Trump isn't the strong and virile world leader the White House likes to portray him as. While receiving a visit from French president Emmanuel Macron at the White House this week, a large, greenish-blue bruise appeared on the b…",
    "link": "https://futurism.com/neoscope/dark-bruise-trump-hand",
    "timestamp": "2025-02-26T15:43:12Z"
  },
  {
    "title": "Fox News Legal Editor Predicts Supreme Court Will Strike Down Trump’s Executive Order on Trans Athletes",
    "description": "Fox News legal editor Kerri Urbahn on Wednesday predicted that the Supreme Court will not side with President Donald Trump on the issue of trans athletes.\nThe post Fox News Legal Editor Predicts Supreme Court Will Strike Down Trump’s Executive Order on Trans …",
    "link": "https://www.mediaite.com/tv/fox-news-legal-editor-predicts-supreme-court-will-strike-down-trumps-executive-order-on-trans-athletes/",
    "timestamp": "2025-02-26T15:43:07Z"
  },
  {
    "title": "Ukraine’s resources mostly hard to access or needed at home",
    "description": "A large part of the country's resources has fallen under Russian occupation.",
    "link": "https://www.euractiv.com/section/eet/news/ukraine-raw-materials-rare-earths-minerals/",
    "timestamp": "2025-02-26T15:42:53Z"
  },
  {
    "title": "What should Trump and Elon Musk's DOGE tackle relative to trucking?",
    "description": "We asked -- a dozen or so readers answered, offering a range of ideas for areas for review at the intersection of government and trucking. What do you think? Weigh in yourself here.",
    "link": "https://www.overdriveonline.com/voices/article/15738207/what-truckers-want-doge-to-target-in-gov-relative-to-industry",
    "timestamp": "2025-02-26T15:42:21Z"
  },
  {
    "title": "Wisconsin Governor Tony Evers Wants to Call Women “Inseminated Persons”",
    "description": "Wisconsin Governor Tony Evers is under fire for an absurdly woke proposal that demeans women by calling them “inseminated persons.” The proposed changes include replacing gender-specific terms such as “mother” and “father” with more inclusive language like “i…",
    "link": "https://freerepublic.com/focus/f-news/4300603/posts",
    "timestamp": "2025-02-26T15:41:42Z"
  },
  {
    "title": "Eli Lilly unveils $27bn US investment as corporate America seeks to woo Trump",
    "description": "CEO Dave Ricks credits Donald Trump with inspiring its push for US-based manufacturing",
    "link": "https://www.irishtimes.com/business/2025/02/26/eli-lilly-unveils-27bn-us-investment-as-corporate-america-seeks-to-woo-trump/",
    "timestamp": "2025-02-26T15:41:32Z"
  },
  {
    "title": "Trump Ramps Up Dangerous Attacks on Media in Bizarre Rant",
    "description": "Donald Trump is working on bullying his way out of public criticism.\r\nIn an alarming Truth Social post Wednesday morning, the president threatened to wield his attorneys against those who criticize him, and even proposed making a “nice new law” that would inf…",
    "link": "https://newrepublic.com/post/192003/donald-trump-media-anonymous-sources",
    "timestamp": "2025-02-26T15:41:29Z"
  },
  {
    "title": "As Paramount’s Merger With Skydance Creeps Toward Finish Line, Company Goes Back Under Microscope With Q4 Earnings Report",
    "description": "Just weeks ago, Paramount Global employees were optimistic about finally entering a more hopeful era thanks to the company’s long-awaited merger with Skydance Media. Management expected the $8 billion deal to close by the springtime. But as the company gets s…",
    "link": "http://deadline.com/2025/02/paramount-skydance-merger-q4-2024-earnings-1236300268/",
    "timestamp": "2025-02-26T15:40:23Z"
  },
  {
    "title": "Jeff Bezos announces ‘significant shift’ coming to the Washington Post. A key editor is leaving because of it",
    "description": "Washington Post owner Jeff Bezos on Wednesday announced a “significant shift” to the publisher’s opinion page that led David Shipley, the paper’s editorial page editor, to leave the paper.",
    "link": "https://www.cnn.com/2025/02/26/media/washington-post-opinion-jeff-bezos-david-shipley/index.html",
    "timestamp": "2025-02-26T15:40:23Z"
  },
  {
    "title": "Was 40-year-old Trump recruited by the KGB? (Alexander J. Motyl/The Hill)",
    "description": "Alexander J. Motyl / The Hill:\nWas 40-year-old Trump recruited by the KGB?  —  The former head of Kazakhstan's intelligence service, Alnur Mussayev, recently claimed in a Facebook post that Donald Trump was recruited by the KGB in 1987, when the 40-year-old r…",
    "link": "https://www.memeorandum.com/250226/p36",
    "timestamp": "2025-02-26T15:40:00Z"
  },
  {
    "title": "Egg prices aren't done soaring. Here's what to know",
    "description": "After hitting a record high this year, egg prices are set to rise even further.Read more...",
    "link": "https://qz.com/egg-prices-bird-flu-explained-1851766544",
    "timestamp": "2025-02-26T15:40:00Z"
  },
  {
    "title": "Trump administration says it cannot meet court deadline for foreign aid payments",
    "description": "(Reuters) - President Donald Trump's administration said in a court filing late Tuesday night that it \"cannot\" meet a federal judge's 11:59 p.m. Wednesday deadline for releasing frozen funds to foreign aid contractors and grant recipients, potentially setting…",
    "link": "https://www.thestar.com.my/news/world/2025/02/26/trump-administration-says-it-cannot-meet-court-deadline-for-foreign-aid-payments",
    "timestamp": "2025-02-26T15:39:00Z"
  },
  {
    "title": "Trump Says Apple Needs to ‘Get Rid’ of DEI After $500 Billion US Investment",
    "description": "The president calls on the world's biggest company to ditch diversity, equity and inclusion efforts a day after investors rejected a plan to do so\nThe post Trump Says Apple Needs to ‘Get Rid’ of DEI After $500 Billion US Investment appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-apple-get-rid-of-dei/",
    "timestamp": "2025-02-26T15:38:12Z"
  },
  {
    "title": "Bruise on Trump's Hand Prompts Health Speculation: What We Know",
    "description": "People are speculating online about President Donald Trump's health after he was pictured with a bruise on his right hand as he met with French President Emmanuel Macron.\nWhy It Matters\nTrump is the oldest person to become U.S. president in history. During th…",
    "link": "https://biztoc.com/x/a58cc01fee826b2d",
    "timestamp": "2025-02-26T15:36:56Z"
  },
  {
    "title": "Trump’s Approval Ratings Are Higher Than Those He Reached During His First Term",
    "description": "One month after returning to the White House, President Donald Trump’s approval ratings are higher than those he reached during his first term. The memory of Joe Biden’s terrible administration is helping the Republicans in polls, especially as Trump has …\nTh…",
    "link": "https://www.globalresearch.ca/trump-approval-ratings-higher-first-term/5880941",
    "timestamp": "2025-02-26T15:35:28Z"
  },
  {
    "title": "Scientists find clues on why COVID vaccine causes chronic health problems in some - NewsBreak",
    "description": "Yale researchers have found clues as to why certain people experience adverse health effects after the COVID-19 vaccine, which they have dubbed “post-vacci",
    "link": "https://www.newsbreak.com/share/3827656864106-scientists-find-clues-on-why-covid-vaccine-causes-chronic-health-problems-in-some?_f=app_share&amp;pd=0CKp6Js2&amp;lang=en_US&amp;send_time=1740584064&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v7%2Cns_local_strategy_25q1_exp-v12%2Cns_foryou_blend_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-v5%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v5&amp;s=i2",
    "timestamp": "2025-02-26T15:35:18Z"
  },
  {
    "title": "Karoline Leavitt Cites Trump’s ‘Ratings Bonanza’ During Campaign YouTube Hits to Defend Seizing Control of Press Pool",
    "description": "White House Press Secretary Karoline Leavitt defended the Trump administration's new policy of dictating which press members get to join the pool on Fox News.\nThe post Karoline Leavitt Cites Trump’s ‘Ratings Bonanza’ During Campaign YouTube Hits to Defend Sei…",
    "link": "https://www.mediaite.com/opinion/karoline-leavitt-cites-trumps-ratings-bonanza-during-campaign-youtube-hits-to-defend-seizing-control-of-press-pool/",
    "timestamp": "2025-02-26T15:34:17Z"
  },
  {
    "title": "The Netanyahu-Trump bromance: How long till Israel's PM ends up in the president's doghouse?",
    "description": "Netanyahu's visit to Washington turned out to be more positive than he could ever have imagined, winning a blank check and an unshakable ally. But how long will it last?",
    "link": "https://www.haaretz.com/opinion/2025-02-26/ty-article-opinion/.premium/netanyahu-trump-bromance-how-long-till-israels-pm-ends-up-in-the-doghouse/00000195-415e-d806-a7f5-e97f94bd0000",
    "timestamp": "2025-02-26T15:33:54Z"
  },
  {
    "title": "‘It’s batsh*t crazy’: Mark Halperin teams up with corporate media reporter to rip industry’s liberal bias",
    "description": "'A sitting president seeking reelection had his press secretary go and work for a major media enterprise and anchor a show. And no one [bleeping] said anything about how irregular, how newsworthy, how out of line that was'",
    "link": "https://www.wnd.com/2025/02/its-batsht-crazy-mark-halperin-teams-up-with-corporate-media-reporter-to-rip-industrys-liberal-bias/",
    "timestamp": "2025-02-26T15:32:40Z"
  },
  {
    "title": "Under Threat of Trump, A Blueprint for Resurgence of Local and Independent Journalism",
    "description": "Journalism is a public good.That's the basic premise of a 12-page policy roadmap released Tuesday by Free Press Action, the 501(c)(4) arm of the advocacy group Free Press, and created by members of Media Power Collaborative, an organizing space for media work…",
    "link": "https://www.commondreams.org/news/free-press-action-media-power-collective-blueprint",
    "timestamp": "2025-02-26T15:31:36Z"
  },
  {
    "title": "Donald Trump tells Apple to \"get rid\" of diversity programs after shareholders back them",
    "description": "Meta and Google are just two of the tech firms to end their diversity hiring goals and scrap DEI programs in the wake of Trump's inauguration. The president has called these initiatives discriminatory against those whose race or gender does not align with tho…",
    "link": "https://www.techspot.com/news/106932-donald-trump-tells-apple-get-rid-diversity-programs.html",
    "timestamp": "2025-02-26T15:31:00Z"
  },
  {
    "title": "America’s Second Largest Teachers Union Sues Trump Admin To Keep Left-Wing Ideology Embedded In Schools",
    "description": "The American Federation of Teachers filed a lawsuit against the Trump administration over its crackdown on diversity, equity and inclusion (DEI) in schools.",
    "link": "https://dailycaller.com/2025/02/26/aft-sues-trump-admin-dei-schools/",
    "timestamp": "2025-02-26T15:30:53Z"
  },
  {
    "title": "Whale Dumps Entire TRUMP Position for $24,400,000 Loss During Price Crash: Lookonchain",
    "description": "A crypto whale is booking millions of dollars in losses after a long position on the Official Trump (TRUMP) turned against him, onchain data reveals. According to blockchain tracking platform Lookonchain, the whale liquidated his position in the TRUMP memecoi…",
    "link": "https://dailyhodl.com/2025/02/26/whale-dumps-entire-trump-position-for-24400000-loss-during-price-crash-lookonchain/",
    "timestamp": "2025-02-26T15:30:46Z"
  },
  {
    "title": "Trump admin plans to 'permanently cripple' climate protections in single blow: report",
    "description": "President Donald Trump's Environmental Protection Agency administrator, Lee Zeldin, is reportedly pursuing plans that would wipe away most federal climate change rules with a single move.According to Bloomberg, the EPA considered scrapping \"its formal conclus…",
    "link": "https://www.rawstory.com/lee-zeldin-climate-change/",
    "timestamp": "2025-02-26T15:30:45Z"
  },
  {
    "title": "These Should Be The Next Mail Trucks When The Post Office Gets Privatized",
    "description": "Our readers' suggestions featured a balanced mix of serious recommendations and attempts at comedic political commentary",
    "link": "https://www.jalopnik.com/1799942/usps-privatized-next-mail-trucks-reader-answer/",
    "timestamp": "2025-02-26T15:30:24Z"
  },
  {
    "title": "GOP House passes budget blueprint; consumer confidence plummets | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_58cdccda-d8c7-5be1-b21d-2122d61e8b13.html",
    "timestamp": "2025-02-26T15:30:00Z"
  },
  {
    "title": "Emergency fundraisers offer a lifeline to groups who've lost foreign aid",
    "description": "Nonprofits are fundraising to help organizations affected by the Trump administration's freeze on foreign aid. Unlock Aid launched the Foreign Aid Bridge Fund to mitigate the funding gap, and other groups like Founders Pledge and The Life You Can Save are als…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/emergency-fundraisers-offer-a-lifeline-to-groups-whove-lost-foreign-aid/articleshow/118583395.cms",
    "timestamp": "2025-02-26T15:29:54Z"
  },
  {
    "title": "Trump Admin Stonewalls Epstein Doc Revelations —Why the Limited Hangout?",
    "description": "“We know that they are lying, they know that they are lying, they even know that we know they are lying, we also know that they know we know they are lying too, they of course know that we certainly …\nThe post Trump Admin Stonewalls Epstein Doc Revelations —W…",
    "link": "https://www.globalresearch.ca/trump-admin-stonewalls-epstein-doc-revelations/5880944",
    "timestamp": "2025-02-26T15:28:15Z"
  },
  {
    "title": "Trump Strips Security Clearances From Members Of Law Firm Who Worked With Jack Smith",
    "description": "President Donald Trump issued an order Tuesday stripping members of a law firm who worked with former special counsel Jack Smith of security clearances.",
    "link": "https://dailycaller.com/2025/02/26/trump-strips-security-clearances-law-firm-jack-smith/",
    "timestamp": "2025-02-26T15:28:12Z"
  },
  {
    "title": "Bruise on Trump's Hand Prompts Health Speculation: What We Know",
    "description": "A large bruise was pictured on the president's right hand, sparking feverish speculation online.",
    "link": "https://www.newsweek.com/trump-hand-bruise-online-health-speculation-2036455",
    "timestamp": "2025-02-26T15:26:56Z"
  },
  {
    "title": "Trump Can Reverse a Biden Foreign Policy Mistake",
    "description": "The Biden administration’s rejection of Nippon Steel’s takeover bid for U.S. Steel made little sense. Trump has a chance to reverse course.",
    "link": "https://thediplomat.com/2025/02/trump-can-reverse-a-biden-foreign-policy-mistake/",
    "timestamp": "2025-02-26T15:25:00Z"
  },
  {
    "title": "‘You’re Defending The Status Quo’: Chris Cuomo Confronts Dem Rep For Opposing DOGE Efforts To Cut Spending",
    "description": "Chris Cuomo confronted Seth Moulton over his opposition to the Department of Government Efficiency's (DOGE) ongoing cost-cutting endeavors.",
    "link": "https://dailycaller.com/2025/02/26/chris-cuomo-confronts-seth-moulton-opposing-doge-spending-cuts/",
    "timestamp": "2025-02-26T15:23:57Z"
  },
  {
    "title": "Trump’s Trumpy Ukraine Gambit",
    "description": "Let’s not be squirrels who find the same nut over and over and are surprised each time. Donald Trump’s latest outburst represents, by my count, the third round of Mr. Trump popping off at Ukraine’s President Zelensky, perhaps for no reason deeper than Mr. Zel…",
    "link": "https://freerepublic.com/focus/f-news/4300600/posts",
    "timestamp": "2025-02-26T15:22:19Z"
  },
  {
    "title": "Zelensky calls US-Ukraine minerals deal a ‘framework’ as it emerges agreement has no security guarantees | CNN",
    "description": "Ukraine’s President Volodymyr Zelensky says a proposed deal with the United States on natural resources is a “framework,” and he will want to discuss the countries’ relationship further in person with President Donald Trump, as a draft of the text obtained by…",
    "link": "https://www.cnn.com/2025/02/26/europe/ukraine-us-zelensky-trump-rare-earth-security-intl/index.html",
    "timestamp": "2025-02-26T15:22:03Z"
  },
  {
    "title": "Lilly to Spend $27 Billion to Bolster US Drug Manufacturing",
    "description": "Eli Lilly & Co. will spend at least $27 billion to build four US manufacturing plants, the latest company to brace for the potential impact of President Donald Trump’s tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/lilly-to-spend-27-billion-to-bolster-us-drug-manufacturing",
    "timestamp": "2025-02-26T15:20:25Z"
  },
  {
    "title": "Donald Trump's $5 million gold card visa: Will it replace EB-5s? Will one get permanent U.S citizenship? All queries answered",
    "description": "US president Donald Trump announced a new Gold Card visa for wealthy investors. This visa will require a $5 million investment and will offer a direct route to US citizenship. The visa aims to replace the EB-5 program and bring significant investments to the …",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-5-million-gold-card-visa-will-it-replace-eb-5s-will-one-get-permanent-u-s-citizenship-all-queries-answered/articleshow/118582366.cms",
    "timestamp": "2025-02-26T15:20:19Z"
  },
  {
    "title": "Musk to loom large at Trump's first cabinet meeting",
    "description": "U.S. President Donald Trump holds his first cabinet meeting Wednesday, joined by billionaire adviser Elon Musk, who is in charge of radically downsizing the US government and wields more power than anyone else in Trump's inner circle.Musk is not part of the c…",
    "link": "https://www.rawstory.com/musk-to-loom-large-at-trump-s-first-cabinet-meeting/",
    "timestamp": "2025-02-26T15:20:16Z"
  },
  {
    "title": "Jeff Bezos’ Plan to Revamp Washington Post Opinion Section Leads Editor to Quit",
    "description": "Jeff Bezos is shaking up the Washington Post again. The billionaire owner of the newspaper said Wednesday he will change the focus of the opinion section to focus on “support and defense of two pillars: personal liberties and free markets.” According to Bezos…",
    "link": "https://variety.com/2025/digital/news/jeff-bezos-washington-post-opinion-editor-quits-1236321120/",
    "timestamp": "2025-02-26T15:20:07Z"
  },
  {
    "title": "Putin's Subtle Shift on Ukraine",
    "description": "Ukrainian leader Volodymyr Zelensky has said elections will take place in the country once martial law is lifted.",
    "link": "https://www.newsweek.com/putin-shift-zelensky-elections-2036494",
    "timestamp": "2025-02-26T15:19:18Z"
  },
  {
    "title": "US citizenship for $5 million: Trump’s costly ‘gold card’ visa may deter Indians, say immigration experts",
    "description": "On Tuesday, US President Donald Trump announced that Gold Card scheme will be rolled out in the next two weeks, replacing the EB-5 visa programme.",
    "link": "https://www.thehindubusinessline.com/news/world/us-citizenship-for-5-million-trumps-costly-gold-card-visa-may-deter-indians-say-immigration-experts/article69267277.ece",
    "timestamp": "2025-02-26T15:18:43Z"
  },
  {
    "title": "US citizenship for $5 million: Trump’s costly ‘gold card’ visa may deter Indians, say immigration experts",
    "description": "On Tuesday, US President Donald Trump announced that Gold Card scheme will be rolled out in the next two weeks, replacing the EB-5 visa programme.",
    "link": "https://www.thehindubusinessline.com/economy/us-citizenship-for-5-million-trumps-costly-gold-card-visa-may-deter-indians-say-immigration-experts/article69267277.ece",
    "timestamp": "2025-02-26T15:18:43Z"
  },
  {
    "title": "Keir Starmer heads to Washington with UK defense spending pledge to help sway Trump over Ukraine",
    "description": "U.K. Prime Minister Keir Starmer flies to Washington on a trip aimed at persuading U.S. President Donald Trump to maintain military support for Ukraine",
    "link": "https://abcnews.go.com/US/wireStory/keir-starmer-heads-washington-uk-defense-spending-pledge-119208956",
    "timestamp": "2025-02-26T15:18:26Z"
  },
  {
    "title": "Ukraine confirms 'preliminary' agreement on mineral resources with U.S.",
    "description": "Ukraine said on Wednesday it had reached a \"preliminary\" deal to hand revenue from some of its mineral resources to the United States, before an expected trip to Washington by President Volodymyr Zelenskyy on Friday.",
    "link": "https://www.cbc.ca/news/world/ukraine-us-mineral-agreement-1.7468727",
    "timestamp": "2025-02-26T15:17:00Z"
  },
  {
    "title": "Trump’s Next Deal Should Be With Kim Jong Un",
    "description": "Washington’s North Korea policy is at a dead end, and it’s time for something new.",
    "link": "https://foreignpolicy.com/2025/02/26/trump-kim-north-korea-nuclear-diplomacy-deal/",
    "timestamp": "2025-02-26T15:16:55Z"
  },
  {
    "title": "Trump Eviscerates a Bedrock Public Health and Environmental Protection Law",
    "description": "In one fell swoop, the National Environmental Policy Act was effectively neutered by Trump, but in this small Newark neighborhood, the fight goes on",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-eviscerates-bedrock-public-health-environmental-law-1235280240/",
    "timestamp": "2025-02-26T15:15:37Z"
  },
  {
    "title": "Savage Shutdown! Elon Musk’s AI company tries to poach OpenAI engineer, his brutal response to job offer goes viral",
    "description": "Elon Musk's AI company, xAI, attempted to hire OpenAI engineer Javier Soto, but his harsh rejection became viral. Soto called Musk's rhetoric a \"threat to democracy\" and criticized xAI's handling of misinformation, igniting a heated online debate.",
    "link": "https://economictimes.indiatimes.com/news/international/us/savage-shutdown-elon-musks-ai-company-tries-to-poach-openai-engineer-his-brutal-response-to-job-offer-goes-viral/articleshow/118583120.cms",
    "timestamp": "2025-02-26T15:14:39Z"
  },
  {
    "title": "Donald Trump Turns Tables on Jack Smith as Special Counsel Faces Probe",
    "description": "President Donald Trump has signed an executive order targeting a law firm that assisted Trump's prosecutor, Jack Smith.\nNewsweek sought email comment on Wednesday from the office of Attorney General Pam Bondi, former special counsel Jack Smith and the law off…",
    "link": "https://biztoc.com/x/80f261c283e0f0e3",
    "timestamp": "2025-02-26T15:14:28Z"
  },
  {
    "title": "Ukraine to Agree With US on Terms for Minerals Deal",
    "description": "Ukraine has agreed with the US on a deal to jointly develop its natural resources, people familiar with the matter said, a move that could ease recent tension with President Donald Trump and advance his administration’s goal of a ceasefire with Russia.\nUkrain…",
    "link": "https://biztoc.com/x/b209eaf103e972e4",
    "timestamp": "2025-02-26T15:14:14Z"
  },
  {
    "title": "Hundreds protest Musk at Libertyville Tesla dealership: ‘What Elon has done to the brand is just make it feel dirty’",
    "description": "Hundreds of anti-Elon Musk and Donald Trump protesters gathered along Milwaukee Avenue in Libertyville Saturday, criticizing the new administration and the outsized influence the world’s richest man has had on the federal government and joining a wave of simi…",
    "link": "https://biztoc.com/x/a93860da989426a2",
    "timestamp": "2025-02-26T15:14:08Z"
  },
  {
    "title": "Why Ukraine’s mineral wealth matters: US seeks critical resources as Volodymyr Zelenskyy plans White House visit",
    "description": "Ukraine’s mineral wealth has become a major point in global geopolitics. As Ukraine President Volodymyr Zelenskyy prepares for a White House visit, the US aims to secure critical minerals needed for technology and defence. With China dominating mineral refini…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-ukraines-mineral-wealth-matters-us-seeks-critical-resources-as-volodymyr-zelenskyy-plans-white-house-visit/articleshow/118583098.cms",
    "timestamp": "2025-02-26T15:12:46Z"
  },
  {
    "title": "Hinge’s new feature wants to help trans and neurodivergent daters",
    "description": "Dating apps are a notoriously hostile space towards transgender users. If they list their transness in their profiles, they’re outing themselves to the world. If they don’t, matches could accuse them of catfishing. Picking the right time to tell matches can f…",
    "link": "https://www.fastcompany.com/91284805/hinge-match-note-trans-and-neurodivergent-daters",
    "timestamp": "2025-02-26T15:12:38Z"
  },
  {
    "title": "Donald Trump Turns Tables on Jack Smith as Special Counsel Faces Probe",
    "description": "Attorney General Pam Bondi has set up a \"Weaponization Working Group.\"",
    "link": "https://www.newsweek.com/donald-trump-pam-bondi-jack-smith-weaponization-washington-law-firm-investigation-2036475",
    "timestamp": "2025-02-26T15:12:14Z"
  },
  {
    "title": "Ukraine’s Zelenskyy says framework economic deal with US is ready but security guarantees undecided",
    "description": "Donald Trump let Ukraine know that he wanted something in return for tens of billions of dollars in U.S. help to fend off the full-scale invasion by Russia",
    "link": "https://www.bostonherald.com/2025/02/26/ukraine-us-economic-deal-zelenskyy/",
    "timestamp": "2025-02-26T15:11:33Z"
  },
  {
    "title": "GE Vernova and NRG to Build 5 Gigawatts of Gas Plants for AI",
    "description": "GE Vernova Inc., NRG Energy Inc. and Kiewit Corp. have signed an agreement to develop up to 5.4 gigawatts of gas-fired power plants as the energy industry anticipates a surge in electricity demand from artificial intelligence.",
    "link": "https://financialpost.com/pmn/business-pmn/ge-vernova-and-nrg-to-build-5-gigawatts-of-gas-plants-for-ai",
    "timestamp": "2025-02-26T15:09:43Z"
  },
  {
    "title": "President Trump Confirms Eagles Will Be Invited to White House: 'Absolutely'",
    "description": "After internet-fueled confusion and controversy, President Donald Trump has set the record straight: The Eagles will be invited to the White House to celebrate their Super Bowl victory.\nThe post President Trump Confirms Eagles Will Be Invited to White House: …",
    "link": "https://www.breitbart.com/sports/2025/02/26/president-trump-confirms-eagles-will-be-invited-to-white-house-absolutely/",
    "timestamp": "2025-02-26T15:09:14Z"
  },
  {
    "title": "Newborns in Gaza are dying from the cold as fears rise over ceasefire's next phase",
    "description": "Bundled up in baby blankets and wrapped in the warmth of her father’s arms, Sham Al-Shanbari came into the world at a time of relative calm in Gaza, born two weeks ago during the hard-won ceasefire between Hamas and Israel.",
    "link": "https://www.nbcnews.com/news/world/gaza-babies-cold-dying-israel-hamas-rcna193784",
    "timestamp": "2025-02-26T15:08:45Z"
  },
  {
    "title": "WATCH: Congressman asks if U.S. marshals could haul Trump to jail for ‘contempt’",
    "description": "'What would then be the state of our democracy?'",
    "link": "https://www.wnd.com/2025/02/watch-congressman-asks-if-u-s-marshals-could-haul-trump-to-jail-for-contempt/",
    "timestamp": "2025-02-26T15:08:13Z"
  },
  {
    "title": "Trump’s AI-generated fever dream for Gaza Strip infuriates supporters: ‘This is filth’",
    "description": "President Donald Trump posted an AI-generated video envisioning “Trump Gaza” on his Truth Social account late last night, making even his most hardcore fans recoil. \n\n\nThe 30-second video begins with computer-generated clips of children and armed men walking …",
    "link": "https://www.dailydot.com/debug/trump-ai-gaza-video/",
    "timestamp": "2025-02-26T15:07:36Z"
  },
  {
    "title": "Keir Starmer heads to Washington with UK defense spending pledge to help sway Trump over Ukraine",
    "description": "LONDON (AP) _ U.K Prime Minister Keir Starmer flies to Washington on Wednesday after announcing a big increase in the British defense budget, an investment that he hopes will help persuade U.S. President Donald Trump to maintain support for Ukraine as Washing…",
    "link": "https://financialpost.com/pmn/keir-starmer-heads-to-washington-with-uk-defense-spending-pledge-to-help-sway-trump-over-ukraine",
    "timestamp": "2025-02-26T15:05:59Z"
  },
  {
    "title": "White House Kicks Out HuffPost Reporter From Press Pool (Kevin Robillard/HuffPost)",
    "description": "Kevin Robillard / HuffPost:\nWhite House Kicks Out HuffPost Reporter From Press Pool  —  Breaking with decades of precedent, the Trump White House is insisting on the ability to choose which reporters cover the president.  —  Donald Trump's White House kicked …",
    "link": "https://www.memeorandum.com/250226/p28",
    "timestamp": "2025-02-26T15:05:01Z"
  },
  {
    "title": "Republicans Send Goons After Voters, Dodge DOGE Questions. Another Town Hall Roundup!",
    "description": "Also, a plea to Democrats: Be like John Lewis, please!",
    "link": "https://www.wonkette.com/p/republicans-send-goons-after-voters",
    "timestamp": "2025-02-26T15:03:36Z"
  },
  {
    "title": "Petition To Strip Elon Musk Of Citizenship Gets 250,000 Signatures",
    "description": "The tech mogul has citizenship through his Canadian born mother, Maye Musk.",
    "link": "https://www.newsweek.com/elon-musk-canada-petition-citizenship-2036532",
    "timestamp": "2025-02-26T15:03:33Z"
  },
  {
    "title": "Potential US copper tariffs seen costing domestic industry dearly",
    "description": "The U.S. industrial sector will have the most to lose from potential U.S. tariffs on copper, analysts say, with costs seen rising significantly during what would be a lengthy process of reviving domestic mining and refining of the metal.\nPresident Donald Trum…",
    "link": "https://biztoc.com/x/556b234a52aad232",
    "timestamp": "2025-02-26T15:02:45Z"
  },
  {
    "title": "Karoline Leavitt Tells Fox News It’s Time For ‘Elitist Journalists’ To Make Way For New Media",
    "description": "White House press secretary Karoline Leavitt detailed how they are ending the media's century-long stronghold on the White House press corps.",
    "link": "https://dailycaller.com/2025/02/26/karoline-leavitt-white-house-press-corp-whca/",
    "timestamp": "2025-02-26T15:02:42Z"
  },
  {
    "title": "Progressives tap a rising star to deliver their response to Trump",
    "description": "Progressives are naming California Rep. Lateefah Simon, a rising Democratic star, to deliver their response to President Donald Trump’s joint address to Congress next week, according to a statement provided first to POLITICO. \n“I’m honored to speak on behalf …",
    "link": "https://biztoc.com/x/92ed9c2f3375a1a6",
    "timestamp": "2025-02-26T15:02:40Z"
  },
  {
    "title": "Trump says he will offer 'gold cards' for $5 million path to citizenship, replacing investor visas",
    "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-offer-gold-cards-5-million-path-citizenship-119189004",
    "timestamp": "2025-02-26T15:02:23Z"
  },
  {
    "title": "Singer-musician Rhiannon Giddens calls off Kennedy Center show, citing Trump takeover",
    "description": "Award-winning singe-musician Rhiannon Giddens has become the latest artist to call off an appearance at the Kennedy Center, which has been in upheaval since President Donald Trump took office",
    "link": "https://abcnews.go.com/Entertainment/wireStory/singer-musician-rhiannon-giddens-calls-off-kennedy-center-119181070",
    "timestamp": "2025-02-26T15:02:22Z"
  },
  {
    "title": "Trump says he will offer 'gold cards' for $5 million path to citizenship, replacing investor visas",
    "description": "President Donald Trump says he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors",
    "link": "https://abcnews.go.com/US/wireStory/trump-offer-gold-cards-5-million-path-citizenship-119189003",
    "timestamp": "2025-02-26T15:02:22Z"
  }
]