[
  {
    "title": "USDA suspends Maine university funding after Trump row over transgender athletes",
    "description": "The Department of Agriculture has suspended funding at the University of Maine after President Trump clashed with Gov. Janet Mills over transgender athletic participation.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/usda-suspends-maine-university-funding-trump-row-transgender-athletes-rcna196011",
    "timestamp": "2025-03-12T14:11:34Z"
  },
  {
    "title": "Can IMEC Transition From Vision to Reality?",
    "description": "A year and a half after its launch, the India-Middle East-Europe Economic Corridor remains at best a political statement of intent.",
    "link": "https://thediplomat.com/2025/03/can-imec-transition-from-vision-to-reality/",
    "timestamp": "2025-03-12T14:11:00Z"
  },
  {
    "title": "Civil society in the crosshairs in Central, Eastern Europe",
    "description": "Faced with political challenges at home and emboldened by President Trump's dismantling of USAID, the illiberal governments of Hungary, Serbia and Slovakia are cracking down on civil society organizations.",
    "link": "https://www.dw.com/en/civil-society-in-the-crosshairs-in-central-eastern-europe/a-71897019",
    "timestamp": "2025-03-12T14:10:00Z"
  },
  {
    "title": "FAIR: US Media’s Sorry History of Abetting Immigration Panics",
    "description": "From Chinese exclusion to Japanese internment to Operation Wetback, media of all kinds have repeatedly sensationalized the immigrant “other,” constructing an all-encompassing threat to native-born US labor and culture that can always be neutralized through a …",
    "link": "https://fair.org/home/us-medias-sorry-history-of-abetting-immigration-panics/",
    "timestamp": "2025-03-12T14:09:53Z"
  },
  {
    "title": "'Struggling': Veterans and mental health therapists on edge over White House moves",
    "description": "Both mental health therapists and the veterans they serve are \"suffering\" on several fronts due to President Donald Trump's job cuts and anti DEI policies, according to a new report by National Public Radio.First, the therapists themselves say they're terrifi…",
    "link": "https://www.rawstory.com/doge-to-cut-veterans-benefits/",
    "timestamp": "2025-03-12T14:09:44Z"
  },
  {
    "title": "Health care for more than 100 million Americans is being turned over to a supplement salesman - NewsBreak",
    "description": "President Donald Trump’s health team has deep financial ties to the supplements industry. Now they’re poised to boost its growth and remake the government’",
    "link": "https://www.newsbreak.com/share/3852205066870-health-care-for-more-than-100-million-americans-is-being-turned-over-to-a-supplement-salesman?s=a2&amp;share_destination_id=MTM1ODcyNzIyLTE3NDE3ODg1MTUyNzU%3D&amp;pd=09C6hWpd&amp;hl=en_US&amp;send_time=1741788515&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_recall_exp_25q1-control%2Cns_local_strategy_25q1_exp-v1%2Cns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v1",
    "timestamp": "2025-03-12T14:09:28Z"
  },
  {
    "title": "Lawyer Extradited From Kyrgyzstan to California to Face Visa Fraud Charges",
    "description": "On the run since 2018, former immigration lawyer Danhong “Jean” Chen was recently detained in Kyrgyzstan and extradited to the United States.",
    "link": "https://thediplomat.com/2025/03/lawyer-extradited-from-kyrgyzstan-to-california-to-face-visa-fraud-charges/",
    "timestamp": "2025-03-12T14:09:00Z"
  },
  {
    "title": "Factbox-Dental floss and diamonds in EU sights to counter U.S. tariffs",
    "description": "From dental floss to diamonds, bathrobes to bourbon, the U.S. products chosen by the European Union for counter-tariffs next month are designed to make...",
    "link": "https://uk.finance.yahoo.com/news/factbox-dental-floss-diamonds-eu-140644080.html",
    "timestamp": "2025-03-12T14:06:44Z"
  },
  {
    "title": "Jeanne Shaheen won't run for re-election, opening another Democratic Senate seat in 2026",
    "description": "Sen. Jeanne Shaheen, D-N.H., on Wednesday announced that she will not seek re-election in 2026, kicking off a competitive race to fill her seat.",
    "link": "https://www.nbcnews.com/politics/2026-election/jeanne-shaheen-wont-run-re-election-opening-another-democratic-senate-rcna196015",
    "timestamp": "2025-03-12T14:06:31Z"
  },
  {
    "title": "Stephanie Ruhle Really Wants John Fetterman To Condemn ‘Oligarchs’ Under Trump — He Doesn’t Bite",
    "description": "Stephanie Ruhle unsuccessfully pushed Democratic Pennsylvania Sen. John Fetterman to criticize the so-called oligarchy under Donald Trump's administration.",
    "link": "https://dailycaller.com/2025/03/12/stephanie-ruhle-really-wants-john-fetterman-to-condemn-oligarchs-under-trump-he-doesnt-bite/",
    "timestamp": "2025-03-12T14:06:25Z"
  },
  {
    "title": "‘Drunk Auntie’ Vibes: Kamala Rambles About Doritos at AI summit, Leaving Audience Baffled",
    "description": "Failed Democrat presidential candidate Kamala Harris appeared drunk and rambled about nonsense during the AI conference HumanX at Fontainebleau in Las Vegas over the weekend. It’s hard to understand why Harris would be invited to speak at such a conference be…",
    "link": "https://freerepublic.com/focus/f-bloggers/4303758/posts",
    "timestamp": "2025-03-12T14:06:11Z"
  },
  {
    "title": "Goldman’s Solomon Says CEOs Want Policy Certainty From Trump",
    "description": "The morning after President Donald Trump addressed corporate America in Washington, one of the nation’s top chief executives called on him for more policy certainty.",
    "link": "https://financialpost.com/pmn/business-pmn/goldmans-solomon-says-ceos-want-policy-certainty-from-trump",
    "timestamp": "2025-03-12T14:05:54Z"
  },
  {
    "title": "In blow to Democrats, Sen. Jeanne Shaheen will not seek reelection in New Hampshire",
    "description": "Sen. Jeanne Shaheen, D-N.H. will not seek reelection next year, a decision that will end the longtime senator's historic political career and deals a significant blow to Democrats who were already facing a difficult path to reclaiming the Senate majority.",
    "link": "https://www.bostonherald.com/2025/03/12/in-blow-to-democrats-sen-jeanne-shaheen-will-not-seek-reelection-in-new-hampshire/",
    "timestamp": "2025-03-12T14:04:32Z"
  },
  {
    "title": "Former Treasury Secretary Steven Mnuchin says 'people are overreacting a bit' to Trump's policies",
    "description": "Former Treasury Secretary Steven Mnuchin said Wednesday he believes \"people are overreacting a bit\" to the policy changes from the current Trump administration.\nMnuchin, who served in President Donald Trump's cabinet during the Republican's first term in offi…",
    "link": "https://biztoc.com/x/cb4164c2059ea25c",
    "timestamp": "2025-03-12T14:04:12Z"
  },
  {
    "title": "Is Trump tanking the economy?",
    "description": "Then-President-elect Donald Trump rings the opening bell on the trading floor of the New York Stock Exchange on December 12, 2024. | Spencer Platt/Getty Images\nIs Donald Trump tanking the economy?\nThe stock market has taken a beating, giving up six months of …",
    "link": "https://biztoc.com/x/685b2be989b2fbcf",
    "timestamp": "2025-03-12T14:04:03Z"
  },
  {
    "title": "Canada to announce retaliatory tariffs on $21 billion of U.S. goods in response to Trump's steel and aluminum duties",
    "description": "Canada will announce new trade duties on some $21 billion-worth of U.S. goods in response to President Donald Trump implementing universal steel and aluminum tariffs Wednesday that were also applied to Canada.",
    "link": "https://www.nbcnews.com/business/economy/canada-retaliatory-tariffs-21-billion-us-goods-trump-tariffs-latest-rcna196012",
    "timestamp": "2025-03-12T14:02:59Z"
  },
  {
    "title": "Greenland’s center-right party wins in latest elections as nation calls for a united front against Trump",
    "description": "The center-right Demokraatit Party won the most votes in a surprising result in Greenland’s parliamentary elections, held in the shadow of U.S. President Donald Trump’s stated goal of taking control of the island one way or another.Both Demokraatit, or the De…",
    "link": "https://biztoc.com/x/bf921bf78ee5aabb",
    "timestamp": "2025-03-12T14:02:17Z"
  },
  {
    "title": "The Wisconsin Supreme Court Election Is a Referendum on Elon Musk",
    "description": "“If you are concerned about what Elon Musk and Donald Trump are doing to this country, to this state, and to this county, raise your hand,” Wisconsin Democratic Party Chair Ben Wikler told a meeting of Democrats in Sauk County, Wisconsin, on March 6. Practica…",
    "link": "https://www.motherjones.com/politics/2025/03/elon-musk-wisconsin-supreme-court-brad-schimel-susan-crawford/",
    "timestamp": "2025-03-12T14:02:14Z"
  },
  {
    "title": "Bank of Canada cuts its key interest rate to 2.75% as tariffs roil economy",
    "description": "OTTAWA — The Bank of Canada lowered its benchmark interest rate by a quarter point on Wednesday as the tariff battle with the United States starts to weigh on the Canadian economy. The policy rate stands at 2.75 per cent after the central bank’s seventh conse…",
    "link": "https://financialpost.com/pmn/bank-of-canada-cuts-its-key-interest-rate-to-2-75-as-tariffs-roil-economy",
    "timestamp": "2025-03-12T14:01:52Z"
  },
  {
    "title": "South Korea to Finalise Crypto-Focussed ‘Corporate Market Participation' Guidelines by April",
    "description": "The guidelines for corporate firms’ participation in crypto will be finalised by April, South Korea’s FSC said Wednesday. Kim So-young, the Vice Chairperson of the FSC, chaired the meeting. He said that US President Donald Trump’s pro-crypto actions had sharp…",
    "link": "https://www.gadgets360.com/cryptocurrency/news/south-korea-fsc-corporate-market-crypto-participation-guidelines-april-7909350",
    "timestamp": "2025-03-12T14:01:46Z"
  },
  {
    "title": "Trump’s Mass Deportations Are Decades in the Making",
    "description": "This past weekend marked a major escalation in the Trump administration’s mass deportation efforts, with the dramatic detention of Mahmoud Khalil, a Palestinian activist who played a prominent role in the protests against Israel on Columbia University’s campu…",
    "link": "https://www.motherjones.com/politics/2025/03/reveal-podcast-trump-deportation-jonathan-blitzer/",
    "timestamp": "2025-03-12T14:01:23Z"
  },
  {
    "title": "‘Fight in the Streets?’ A Bit of Advice to Hakeem, Zelenskyy, and Friends",
    "description": "House Minority Leader Hakeem Jeffries recently declared Democrats would “fight in the streets” against President Donald Trump. Since then, everyone from “the squad” to “The... Read More\nThe post ‘Fight in the Streets?’ A Bit of Advice to Hakeem, Zelenskyy, an…",
    "link": "https://www.dailysignal.com/2025/03/12/fight-streets-bit-advice-hakeem-zelenskyy-friends/",
    "timestamp": "2025-03-12T14:01:00Z"
  },
  {
    "title": "Why Russia’s armed forces have proven resilient in the war in Ukraine",
    "description": "There are considerable risks for Ukraine if it chooses to fight on rather than seek a deal to end the war with Russia.",
    "link": "https://theconversation.com/why-russias-armed-forces-have-proven-resilient-in-the-war-in-ukraine-251588",
    "timestamp": "2025-03-12T14:00:13Z"
  },
  {
    "title": "The IndusInd Bank share crash holds many lessons: Most of all for RBI",
    "description": "The lender lost over a quarter of its market cap in a single day. Thankfully, investors and depositors march to a different tune, but this week’s mayhem in its shares leaves all stakeholders with much to mull over.",
    "link": "https://www.livemint.com/opinion/online-views/indusind-bank-stocks-derivatives-market-ceo-sumant-kathpalia-nifty-50-sensex-rbi-reserve-bank-of-india-ashok-hinduja-11741780531847.html",
    "timestamp": "2025-03-12T14:00:02Z"
  },
  {
    "title": "Harassment, Stalkers, Death Threats: A Day in the Life of Women on Twitch",
    "description": "Valkyrae, Cinna, and Emiru were threatened on a live stream — but they're not the only women dealing with constant harassment",
    "link": "http://www.rollingstone.com/culture/culture-features/valkyrae-cinna-emiru-women-twitch-streamers-harassment-1235289509/",
    "timestamp": "2025-03-12T14:00:00Z"
  },
  {
    "title": "Trump Is the World’s Worst Dictator",
    "description": "Dictators crave power. President Donald Trump is using his power to give Americans more freedom. That’s a massive difference. Desperate to find an effective attack... Read More\nThe post Trump Is the World’s Worst Dictator appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/12/trump-worlds-worst-dictator/",
    "timestamp": "2025-03-12T14:00:00Z"
  },
  {
    "title": "Live Around the Planet: Wednesday March 12th",
    "description": "UPPESTDATE! If you missed today's edition of Mark's Clubland Q&A live around the planet, the action replay can be heard in full here. UPPERDATE! We're live now, so let's have at it! UPDATE! We'll be going live in about fifteen minutes, so do get ready",
    "link": "https://www.steynonline.com/15103/live-around-the-planet-wednesday-march-12th",
    "timestamp": "2025-03-12T14:00:00Z"
  },
  {
    "title": "The Man Who Could Not Remain Silent",
    "description": "Sadegh Zibakalam is in trouble again for criticizing Iranian foreign policy.",
    "link": "https://www.theatlantic.com/international/archive/2025/03/iran-protest-zibakalam-palestine/682006/",
    "timestamp": "2025-03-12T14:00:00Z"
  },
  {
    "title": "FACT CHECK: Viral Image Does Not Show Authentic X Post From Elon Musk",
    "description": "A viral image shared on X purports to show a post from Elon Musk reading, “The USA needs to hold an election.” Verdict: False An advanced search of Musk’s verified X account @elonmusk does not return any results for the purported remark, and there is no other…",
    "link": "https://checkyourfact.com/2025/03/12/fact-check-image-authentic-post-musk/",
    "timestamp": "2025-03-12T13:59:19Z"
  },
  {
    "title": "Fox Analyst Praises Rosie O’Donnell Fleeing US for Ireland Over Trump: ‘This May Surprise Viewers a Little Bit’",
    "description": "Guy Benson offered some surprising praise for Rosie O'Donnell after she revealed she's packed up her family and fled to Ireland because of Donald Trump.\nThe post Fox Analyst Praises Rosie O’Donnell Fleeing US for Ireland Over Trump: ‘This May Surprise Viewers…",
    "link": "https://www.mediaite.com/tv/fox-analyst-praises-rosie-odonnell-fleeing-us-for-ireland-over-trump-this-may-surprise-viewers-a-little-bit/",
    "timestamp": "2025-03-12T13:59:13Z"
  },
  {
    "title": "Is Trump tanking the economy?",
    "description": "Is Donald Trump tanking the economy? The stock market has taken a beating, giving up six months of gains. Several economic indicators — consumer confidence, GDP estimates — have gotten gloomier.  All signs point to the main culprit being Trump and his trade w…",
    "link": "https://www.vox.com/politics/403564/trump-recession-markets-economy-crash",
    "timestamp": "2025-03-12T13:57:47Z"
  },
  {
    "title": "WATCH Lavrov speaks to US bloggers",
    "description": "The Russian foreign minister has been interviewed by Mario Nawfal, Larry Johnson, and Andrew Napolitano Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614088-lavrov-bloggers-trump-ukraine/",
    "timestamp": "2025-03-12T13:56:59Z"
  },
  {
    "title": "U.S. inflation slows for first time in six months, trade war threatens to hike prices",
    "description": "The consumer price index increased 2.8% in February from a year ago, Wednesday's report from the Labor Department showed, down from 3% the previous month.",
    "link": "https://www.pbs.org/newshour/politics/u-s-inflation-slows-for-first-time-in-six-months-trade-war-threatens-to-hike-prices",
    "timestamp": "2025-03-12T13:56:12Z"
  },
  {
    "title": "Iran, Russia, China set to discuss Iran’s nuclear program in meeting",
    "description": "This is an important meeting that is coming as Iran increasingly seeks to ingratiate itself with China and Russia.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-845749",
    "timestamp": "2025-03-12T13:56:11Z"
  },
  {
    "title": "Toward a North American Economic Union",
    "description": "To resolve their current tensions, Canada, Mexico, and the United States should start drafting plans for a North American Economic Union. A single market in goods, services, capital, labor, technology, data, and information would benefit all three countries f…",
    "link": "https://www.project-syndicate.org/commentary/north-american-economic-union-us-canada-mexico-by-nouriel-roubini-2025-03",
    "timestamp": "2025-03-12T13:56:07Z"
  },
  {
    "title": "Could Europe benefit from Trump's 'assault on science'?",
    "description": "The Trump administration's science policies are driving scientists to look for jobs in Europe. Europe wants to help. But some warn against exploiting the situation. Barely six weeks after taking office for a second term, the Trump administration's cost-cuttin…",
    "link": "https://www.dw.com/en/could-europe-benefit-from-trumps-assault-on-science/a-71897988",
    "timestamp": "2025-03-12T13:56:00Z"
  },
  {
    "title": "‘It’s insulting’: Watch Karoline Leavitt get into testy exchange with national reporter lecturing her",
    "description": "'I now regret giving a question'",
    "link": "https://www.wnd.com/2025/03/its-insulting-watch-karoline-leavitt-get-into-testy-exchange-with-national-reporter-lecturing-her/",
    "timestamp": "2025-03-12T13:55:56Z"
  },
  {
    "title": "Whoopi Goldberg Claims Trump Ruined Biden’s Wonderful Economy Without Once Mentioning High Prices",
    "description": "“The View” co-host Whoopi Goldberg claimed Tuesday that President Donald Trump ruined former President Joe Biden’s economy without once mentioning high prices or the record high deficit. Goldberg argued that Trump inherited a “very robust” economy, crediting …",
    "link": "https://freerepublic.com/focus/f-bloggers/4303753/posts",
    "timestamp": "2025-03-12T13:55:35Z"
  },
  {
    "title": "Former Treasury Secretary Steven Mnuchin says 'people are overreacting a bit' to Trump's policies",
    "description": "Mnuchin, who served under Trump in the Republican's first term in office, said does not see signs of an imminent slowdown for the U.S. economy.",
    "link": "https://www.cnbc.com/2025/03/12/steven-mnuchin-says-people-are-overreacting-a-bit-to-trumps-policies.html",
    "timestamp": "2025-03-12T13:55:34Z"
  },
  {
    "title": "US Inflation Eases, Offering Some Relief Ahead of Tariffs",
    "description": "US consumer prices rose at the slowest pace in four months in February, offering some reprieve ahead of tariffs that are expected to drive costs higher.",
    "link": "https://financialpost.com/pmn/business-pmn/us-inflation-eases-offering-some-relief-ahead-of-tariffs",
    "timestamp": "2025-03-12T13:55:15Z"
  },
  {
    "title": "Elon Musk Protesters Want to 'Buy' a Tesla. Here's Why",
    "description": "Some in the 50501 movement aim to waste dealerships' time by pretending to buy Elon Musk's cars, only to walk away.",
    "link": "https://www.newsweek.com/tesla-musk-trump-50501-protest-2043415",
    "timestamp": "2025-03-12T13:52:06Z"
  },
  {
    "title": "Trump Administration Ends $20 Billion Funding For Greenhouse Gas Reduction",
    "description": "The Trump administration has ended $20 billion in funding for greenhouse gas reduction projects in a move that climate advocates and Democrats say illegally seizes money allocated for clean energy and transportation.",
    "link": "https://www.ndtv.com/world-news/trump-administration-ends-20-billion-funding-for-greenhouse-gas-reduction-projects-7909274",
    "timestamp": "2025-03-12T13:52:00Z"
  },
  {
    "title": "Ayo Edebiri calls out ‘idiot’ Elon Musk for inciting ‘death threats and racial slurs’ against her",
    "description": "The Bear actress Ayo Edebiri has claimed that tech billionaire turned Donald Trump advisor Elon Musk was responsible for inciting “insane death threats” against her after he spread misinformation about an acting role.  In a post on his platform X, formerly Tw…",
    "link": "https://www.thepinknews.com/2025/03/12/the-bear-ayo-edebiri-elon-musk-death-threats-pirates-of-the-caribbean/",
    "timestamp": "2025-03-12T13:50:51Z"
  },
  {
    "title": "US arms flow to Ukraine again as the Kremlin mulls a ceasefire proposal",
    "description": "Ukrainian and Polish officials say U.S. arms deliveries to Ukraine have resumed",
    "link": "https://abcnews.go.com/Business/wireStory/us-arms-flow-ukraine-kremlin-mulls-ceasefire-proposal-119711075",
    "timestamp": "2025-03-12T13:50:17Z"
  },
  {
    "title": "US arms flow to Ukraine again as the Kremlin mulls a ceasefire proposal",
    "description": "Ukrainian and Polish officials say U.S. arms deliveries to Ukraine have resumed",
    "link": "https://abcnews.go.com/International/wireStory/us-arms-flow-ukraine-kremlin-mulls-ceasefire-proposal-119704524",
    "timestamp": "2025-03-12T13:50:16Z"
  },
  {
    "title": "Trump’s Economic Approval Rating Sinks to Lowest Figure Since 2017 in New CNN Poll",
    "description": "President Donald Trump is facing the worst economic approval rating of his second term. A new CNN poll indicates that a majority of Americans disapprove of his handling of the economy — it’s the first time as president he’s been underwater on the issue since …",
    "link": "https://www.mediaite.com/tv/trumps-economic-approval-rating-sinks-to-lowest-figure-since-2017-in-new-cnn-poll/",
    "timestamp": "2025-03-12T13:50:05Z"
  },
  {
    "title": "DOE mass layoffs update: Department of Education is slashing its workforce, but Trump’s overhaul faces backlash",
    "description": "The U.S. Department of Education (DOE) is set to slash its workforce by more than half, eliminating over 1,300 positions as part of a broader effort by the Trump administration to downsize the federal government. \n\n\n\nPresident Donald Trump has characterized t…",
    "link": "https://www.fastcompany.com/91296268/doe-mass-layoffs-update-department-of-education-slashing-workforce-backlash",
    "timestamp": "2025-03-12T13:50:00Z"
  },
  {
    "title": "Trump Wants Violence Against Tesla Charged As Domestic Terrorism",
    "description": "While Donald Trump destroys the livelihoods of thousands of Americans and threatens the health and wellbeing of millions more, there’s one person he’s bending over backwards to protect: his illegal immigrant buddy and megadonor who is also the world’s richest…",
    "link": "https://crooksandliars.com/2025/03/trump-wants-violence-against-tesla-charged",
    "timestamp": "2025-03-12T13:49:23Z"
  },
  {
    "title": "Trump Is Undermining the Canadians Most Sympathetic to Him",
    "description": "The U.S. president wants support for his unorthodox agenda—yet he has weakened those in Canada who would have done so.",
    "link": "http://foreignpolicy.com/2025/03/12/canada-trump-tariffs-carney-poilievre-conservative/",
    "timestamp": "2025-03-12T13:48:35Z"
  },
  {
    "title": "Trump turns White House lawn into car lot for megadonor Musk",
    "description": "It’s easy to grow inured to Trump’s corruption, but his Tesla event on the South Lawn was one of the most brazen and obscene events in White House history.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-turns-white-house-lawn-car-lot-megadonor-musk-rcna196000",
    "timestamp": "2025-03-12T13:48:21Z"
  },
  {
    "title": "North Korea Blasts US 'War Rehearsal'",
    "description": "On Monday, North Korea carried out its fifth round of missile launches of the year.",
    "link": "https://www.newsweek.com/north-korea-state-media-us-south-korea-freedom-shield-nuclear-war-exercise-2043358",
    "timestamp": "2025-03-12T13:47:47Z"
  },
  {
    "title": "I flew to SXSW to check the pulse of TV, film, and the creator economy. These were the 6 hottest topics among insiders.",
    "description": "I spent three days in SXSW, where the entertainment industry is divided over AI, LA's future, and more.",
    "link": "https://www.businessinsider.com/sxsw-debates-takeaways-tv-film-creator-economy-2025-3",
    "timestamp": "2025-03-12T13:46:40Z"
  },
  {
    "title": "Dustin Nguyen Vs Marvel Comics in The Daily LITG, 12th March, 2025",
    "description": "Dustin Nguyen Vs Marvel was the most-read story on Bleeding Cool yesterday. I should have been at London Book Fair right now but someone there gave me concrud, which is also whjy this is late today. Lying In The Gutters is the daily runaround for the most-rea…",
    "link": "https://bleedingcool.com/comics/dustin-nguyen-vs-marvel-comics-in-the-daily-litg-12th-march-2025/",
    "timestamp": "2025-03-12T13:46:07Z"
  },
  {
    "title": "Canada will announce more than $20 billion in tariffs on the US, EU retaliates as well",
    "description": "TORONTO (AP) — Canada will announce Canadian $29.8 billion ($20.7 billion) in retaliatory tariffs in response to the 25% steel and aluminum tariffs that U.S. President Donald Trump has leveled, a senior Canadian government official said Wednesday.",
    "link": "https://www.theadvocate.com/baton_rouge/news/politics/canada-trump-tariffs-response-steel/article_55fbb32b-b3f8-5a41-8e68-6a285fc15263.html",
    "timestamp": "2025-03-12T13:46:00Z"
  },
  {
    "title": "Taoiseach invites JD Vance back to Ireland as 'sock diplomacy' discussed over breakfast",
    "description": "Vance showed attendees at this morning’s breakfast that he was wearing Irish-themed socks.",
    "link": "https://www.thejournal.ie/jd-vance-micheal-martin-6646925-Mar2025/",
    "timestamp": "2025-03-12T13:45:22Z"
  },
  {
    "title": "Dogecoin, SHIB and PEPE Bounce as Official Trump Meme Coin Sees Middling Gains",
    "description": "Major meme coins are bouncing despite the traditional stock market continuing to decline amid President Donald Trump’s trade war.",
    "link": "https://decrypt.co/309658/doge-shib-pepe-official-trump-meme-coin-gains",
    "timestamp": "2025-03-12T13:44:44Z"
  },
  {
    "title": "Tesla Stock Surges After Donald Trump Endorsement",
    "description": "Tesla stock reacted positively to Donald Trump's endorsement of the brand yesterday.\nWith shares having closed at $230.58 on Tuesday, they opened around seven percent higher on Wednesday morning, according to Yahoo Finance.\nTesla gained 3.8 percent on Tuesday…",
    "link": "https://biztoc.com/x/534e2e0fe3b058b1",
    "timestamp": "2025-03-12T13:44:30Z"
  },
  {
    "title": "Tesla Stock Surges After Donald Trump Endorsement",
    "description": "Trump's strong backing of his ally's company has eased some of Tesla's stock struggles - but also sparked major ethical concerns.",
    "link": "https://www.newsweek.com/tesla-stock-latest-rises-trump-endorsement-2043492",
    "timestamp": "2025-03-12T13:41:34Z"
  },
  {
    "title": "U.S. inflation cooled in February, but tariffs and trade war loom",
    "description": "Inflation slowed more than expected in February and cooled for the first time in four months, but that progress may be short lived as President Donald Trump ramps up his",
    "link": "https://www.abc12.com/news/business/u-s-inflation-cooled-in-february-but-tariffs-and-trade-war-loom/article_6bf405a2-66ca-5f98-99db-f3d520ffc75a.html",
    "timestamp": "2025-03-12T13:41:29Z"
  },
  {
    "title": "Taoiseach invites JD Vance to Ireland as vice-president flashes shamrock socks ahead of Oval Office meeting with Trump",
    "description": "Taoiseach Micheál Martin is due to meet US President Donald Trump later today in a hotly anticipated meeting as part of St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-invites-jd-vance-to-ireland-as-vice-president-flashes-shamrock-socks-ahead-of-trump-meeting-burkes-spotted-near-white-house/a438244273.html",
    "timestamp": "2025-03-12T13:40:49Z"
  },
  {
    "title": "Taoiseach invites JD Vance to Ireland as vice-president flashes shamrocks socks ahead of Oval Office meeting with Trump",
    "description": "Taoiseach Micheál Martin is due to meet US President Donald Trump later today in a hotly anticipated meeting as part of St Patrick’s Day celebrations.",
    "link": "https://www.independent.ie/irish-news/politics/taoiseach-invites-jd-vance-to-ireland-as-vice-president-flashes-shamrocks-socks-ahead-of-oval-office-meeting-with-trump/a438244273.html",
    "timestamp": "2025-03-12T13:40:49Z"
  },
  {
    "title": "Gigi Hadid: My relationship with Bradley Cooper is ‘very romantic and happy’",
    "description": "Many economists and historians have remarked that the past few years or so have felt like the “Roaring ‘20s” in the 20th century. The Roaring ‘20s preceded the Great Depression, so we’re on track for that, probably this year under Donald Trump. I bring this u…",
    "link": "https://www.celebitchy.com/912997/gigi_hadid_my_relationship_with_bradley_cooper_is_very_romantic_and_happy/",
    "timestamp": "2025-03-12T13:40:31Z"
  },
  {
    "title": "Wall Street gets good news and bounces higher after an encouraging inflation report",
    "description": "Wall Street got some relief after an encouraging report said inflation slowed last month by more than expected.",
    "link": "https://www.bostonherald.com/2025/03/12/wall-street-reaction-inflation-report/",
    "timestamp": "2025-03-12T13:40:29Z"
  },
  {
    "title": "Abu Dhabi’s MGX Hires From Apollo, Warburg Amid Trump’s AI Push",
    "description": "Abu Dhabi’s MGX, which is helping bankroll the $100 billion artificial intelligence venture touted by Donald Trump, is beefing up its US operations with hires from the likes of Apollo Global Management Inc. and Warburg Pincus LLC.",
    "link": "https://financialpost.com/pmn/business-pmn/abu-dhabis-mgx-hires-from-apollo-warburg-amid-trumps-ai-push",
    "timestamp": "2025-03-12T13:40:25Z"
  },
  {
    "title": "US Bitcoin reserve vs. gold and oil reserves: How do they compare?",
    "description": "US reserves status quo: Gold, oil and the emerging role of Bitcoin \r\nThe US government has long relied on gold and oil as reserve assets, but with the growing institutional adoption of Bitcoin (BTC), its potential role as a strategic reserve has increased sub…",
    "link": "https://cointelegraph.com/explained/us-bitcoin-reserve-vs-gold-and-oil-reserves-how-do-they-compare",
    "timestamp": "2025-03-12T13:40:00Z"
  },
  {
    "title": "Maggie Haberman Calls Out Trump for Blockbuster Elon Musk Cash Dump: He’d Be ‘Very Upset’ If a Democrat Did It",
    "description": "Maggie Haberman called Trump out over Elon Musk's cash dump into Trump's political operation — which he'd be \"very upset\" about if a Democrat did it.\nThe post Maggie Haberman Calls Out Trump for Blockbuster Elon Musk Cash Dump: He’d Be ‘Very Upset’ If a Democ…",
    "link": "https://www.mediaite.com/news/maggie-haberman-calls-out-trump-for-blockbuster-elon-musk-cash-dump-hed-be-very-upset-if-a-democrat-did-it/",
    "timestamp": "2025-03-12T13:39:46Z"
  },
  {
    "title": "Ayo Edibiri Got ‘Death Threats’ After Elon Musk Shared Fake Report About Her Replacing Johnny Depp in ‘Pirates of the Caribbean’: He’s an ‘Idiot’ and a ‘Fascist’",
    "description": "Ayo Edebiri revealed on her Instagram story that she got “insane death threats” because of Elon Musk. The X owner shared a fake report in February 2024 claiming Disney was considering Edebiri as a replacement for Johnny Depp in the “Pirates of the Caribbean” …",
    "link": "https://variety.com/2025/film/news/ayo-edibiri-death-threats-elon-musk-pirates-of-the-carribbean-1236335148/",
    "timestamp": "2025-03-12T13:38:19Z"
  },
  {
    "title": "Trump’s Steel And Aluminum Tariffs Take Effect Today—Here’s How They Could Impact Prices",
    "description": "Trump’s 2018 metals tariffs created job growth in the steel industry, but ultimately cost consumers more money as a result of job losses in industries that rely on steel and aluminum, studies have shown.",
    "link": "https://www.forbes.com/sites/saradorn/2025/03/12/trumps-steel-and-aluminum-tariffs-take-effect-today-heres-how-they-could-impact-prices/",
    "timestamp": "2025-03-12T13:38:12Z"
  },
  {
    "title": "Trump's tariffs: is EU's retaliation the best move?",
    "description": "Global US levy on steel and aluminium imports has the EU hitting back but the UK keeping options open",
    "link": "https://theweek.com/business/economy/trumps-tariffs-is-eus-retaliation-the-best-move",
    "timestamp": "2025-03-12T13:36:10Z"
  },
  {
    "title": "OPEC+ Oil Production Surges as Kazakhstan Further Breaches Quota",
    "description": "OPEC+ crude production surged last month as Kazakhstan, which has long flouted the cartel’s output quotas, further breached its agreed limit.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-oil-production-surges-as-kazakhstan-further-breaches-quota",
    "timestamp": "2025-03-12T13:36:02Z"
  },
  {
    "title": "Greenland Voters Give Two Independence-Oriented Parties Top Spots in March 11th Election",
    "description": "The new ruling coalition could be open to a Compact of Free Association, which would benefit both Greenlanders and Americans.\nThe post Greenland Voters Give Two Independence-Oriented Parties Top Spots in March 11th Election first appeared on Le·gal In·sur·rec…",
    "link": "https://legalinsurrection.com/2025/03/greenland-voters-give-two-independence-oriented-parties-top-spots-in-march-11th-election/",
    "timestamp": "2025-03-12T13:36:00Z"
  },
  {
    "title": "Disney Won't Allow Press At SNOW WHITE Premiere Following Rachel Zegler And Gal Gadot Controversies",
    "description": "Perhaps unsurprisingly after the past few years, Disney has decided that Snow White won't receive a traditional premiere, with the press no longer set to be part of the usual splashy red carpet event...",
    "link": "https://comicbookmovie.com/disney/disney-wont-allow-press-at-snow-white-premiere-following-rachel-zegler-and-gal-gadot-controversies-a216778",
    "timestamp": "2025-03-12T13:35:48Z"
  },
  {
    "title": "Opposition leads in Greenland election",
    "description": "Greenlanders are holding a historic vote which could lead to seeking independence from Denmark or closer ties with the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614078-greenland-election-trump-denmark/",
    "timestamp": "2025-03-12T13:35:47Z"
  },
  {
    "title": "Corporate gloom deepens as new Trump tariffs take effect",
    "description": "In This Article:\nLONDON (Reuters) - Makers of goods from sportswear to luxury cars and chemicals painted a gloomy picture on Wednesday of consumer and industrial health, adding to concerns about the damage from U.S. President Donald Trump's trade wars and hit…",
    "link": "https://biztoc.com/x/3a402d01af797221",
    "timestamp": "2025-03-12T13:35:28Z"
  },
  {
    "title": "Rubio says G7 won't discuss US 'takeover' of Canada",
    "description": "SHANNON, Ireland (Reuters) - U.S. Secretary of State Marco Rubio on Wednesday said the issue of how the United States is going to \"take over Canada\" will not be discussed at a gathering of G7 foreign ministers due to take place in Canada on Thursday. Read ful…",
    "link": "https://www.thestar.com.my/news/world/2025/03/12/rubio-says-g7-won039t-discuss-us-039takeover039-of-canada",
    "timestamp": "2025-03-12T13:35:00Z"
  },
  {
    "title": "Will a bilateral trade deal between India and the US help against reciprocal tariffs?",
    "description": "Exporters pin hopes on a deal, willing to support lower tariffs",
    "link": "https://www.businesstoday.in/latest/economy/story/will-a-bilateral-trade-deal-between-india-and-the-us-help-against-reciprocal-tariffs-467779-2025-03-12",
    "timestamp": "2025-03-12T13:34:52Z"
  },
  {
    "title": "Lauren Boebert shares racist AI meme to claim her Al Green insult wasn’t racist",
    "description": "Rep. Lauren Boebert (R-Colo.) isn't apologizing for her \"pimp cane\" insult to Rep. Al Green (D-Texas), which ignited accusations of racism and ableism.\n\n\nHer remark came in the wake of Green disrupting President Donald Trump's joint address to Congress, for w…",
    "link": "https://www.dailydot.com/debug/lauren-boebert-cane-al-green/",
    "timestamp": "2025-03-12T13:34:41Z"
  },
  {
    "title": "Canada will announce more than $20 billion in tariffs in response to Trump's metal tariffs",
    "description": "Canada will announce Canadian $29.8 billion or $20.7 billion in retaliatory tariffs in response to the 25% steel and aluminum tariffs that U.S. President Donald Trump has leveled.",
    "link": "https://www.clickondetroit.com/business/2025/03/12/canada-will-announce-more-than-20-billion-in-tariffs-in-response-to-trumps-metal-tariffs/",
    "timestamp": "2025-03-12T13:33:54Z"
  },
  {
    "title": "Tesla Stock Is Racing Higher Wednesday: What's Driving The Action?",
    "description": "Zinger Key Points\n- Tesla CEO Elon Musk commits to doubling Tesla's U.S. vehicle production totals within two years.\n- The news comes after U.S. President Donald Trump announced he was going to buy a Tesla vehicle in support of Musk.\n- The new Benzinga Rankin…",
    "link": "https://biztoc.com/x/694045ef88a0ba8c",
    "timestamp": "2025-03-12T13:33:48Z"
  },
  {
    "title": "Critics Trash Alina Habba for Giddy Tour of Biden’s ‘Fake Oval Office’: ‘I Cracked the Case!’",
    "description": "Trump legal advisor Alina Habba was trashed by critics and lauded by MAGA after she “cracked the case” of former President Joe Biden’s “fake oval office” in a video she posted Tuesday. “You guys, I just finished a show. Look at the room that they put me in,” …",
    "link": "https://www.mediaite.com/tv/critics-trash-alina-habba-for-giddy-tour-of-bidens-fake-oval-office-i-cracked-the-case/",
    "timestamp": "2025-03-12T13:33:12Z"
  },
  {
    "title": "DOE Set To Die",
    "description": "Department of Education cut in half: As of Tuesday, the Education Department is about half the size it was when President Donald Trump took office just a",
    "link": "https://reason.com/2025/03/12/doe-set-to-die/",
    "timestamp": "2025-03-12T13:33:12Z"
  },
  {
    "title": "Covid Taught Americans To Stop Trusting A Government That Puts Them Last",
    "description": "The reaction to Covid showed Americans the system wasn’t going to save them. They were going to have to do it themselves. When Donald Trump first sailed into the Oval Office, his detractors shrieked that his blunt rhetoric was dividing the country. His suppor…",
    "link": "https://freerepublic.com/focus/f-chat/4303746/posts",
    "timestamp": "2025-03-12T13:33:00Z"
  },
  {
    "title": "Russia hedges on U.S. truce proposal for Ukraine as it presses its gains",
    "description": "The Trump administration appears to be back in Ukraine's corner, but it's unclear if Putin, while enjoying battlefield victories, can be convinced to halt his assault.",
    "link": "https://www.cbsnews.com/news/russia-ukraine-war-trump-us-ceasefire-push-putin-forces-advance/",
    "timestamp": "2025-03-12T13:33:00Z"
  },
  {
    "title": "Saudi Arabia’s role in Ukraine talks could bring more clout",
    "description": "With more clout in the Trump White House, the Saudis could position themselves to be game changers in the region.",
    "link": "https://www.jpost.com/international/article-845746",
    "timestamp": "2025-03-12T13:32:59Z"
  },
  {
    "title": "North Korea fires ballistic missiles as U.S.-South Korea joint military drill kicks off",
    "description": "Washington DC (UPI) Mar 10, 2025 \n\n\n North Korea launched several ballistic missiles toward the Yellow Sea on Monday afternoon, Seoul's military said, on the first day of a large-scale joint U.S-South Korea military exercise on the Peninsula. \n \"The military …",
    "link": "https://www.spacewar.com/reports/North_Korea_fires_ballistic_missiles_as_US-South_Korea_joint_military_drill_kicks_off_999.html",
    "timestamp": "2025-03-12T13:32:49Z"
  },
  {
    "title": "Musk says X hit by major cyberattack",
    "description": "San Francisco (AFP) Mar 10, 2025\n\n\n Elon Musk said X was hit Monday by a major cyberattack, raising questions as to whether the politically divisive billionaire is being targeted or his decision to gut staff at what was once Twitter is haunting the social net…",
    "link": "https://www.spacewar.com/reports/Musk_says_X_hit_by_major_cyberattack_999.html",
    "timestamp": "2025-03-12T13:32:49Z"
  },
  {
    "title": "Four killed in Kursk as Russia studies ceasefire deal — the latest from the Ukraine-Russia war",
    "description": "Four civilians have been killed in a Ukrainian attack on Russia's western Kursk region, Russian officials say.",
    "link": "https://www.abc.net.au/news/2025-03-13/russia-ukraine-war-latest/105044596",
    "timestamp": "2025-03-12T13:32:16Z"
  },
  {
    "title": "Mortgage Predictions for March 2025: Rates Fall As Economic Concerns Ramp Up",
    "description": "Lower mortgage rates are good for housing affordability, but the reason behind the recent dip — a weakening economic outlook — is less cheery.",
    "link": "https://www.cnet.com/personal-finance/mortgage-predictions-for-march-2025-rates-fall-as-economic-concerns-ramp-up/",
    "timestamp": "2025-03-12T13:32:00Z"
  },
  {
    "title": "DOE Set To Die",
    "description": "Department of Education cut in half: As of Tuesday, the Education Department is about half the size it was when President Donald Trump took office just a few weeks ago. \nSeemingly per the Department of Government Efficiency's guidance, the Department of Educa…",
    "link": "https://biztoc.com/x/6f403bc6feeafa85",
    "timestamp": "2025-03-12T13:31:59Z"
  },
  {
    "title": "Kevin O'Leary Blames Bad Scores in Schools on Unions",
    "description": "O'Leary said unions \"keep mediocre teachers in place in every high school in America when we should be firing them.\"",
    "link": "https://www.newsweek.com/kevin-oleary-unions-bad-scores-math-reading-schools-teachers-2043442",
    "timestamp": "2025-03-12T13:31:39Z"
  },
  {
    "title": "Opinion: An 'Unsuitable' Question",
    "description": "If Elon Musk can turn up to the White House in a T-shirt and jeans without scrutiny, then surely a war-time leader like Zelensky deserves the same courtesy.",
    "link": "https://www.ndtv.com/opinion/trump-to-zelensky-an-unsuitable-question-7909109",
    "timestamp": "2025-03-12T13:31:27Z"
  },
  {
    "title": "Canada will announce more than $20 billion in tariffs in response to Trump’s metal tariffs",
    "description": "The move by America's neighbor comes after President Donald Trump levied 25% tariffs on steel and aluminum.",
    "link": "https://www.bostonherald.com/2025/03/12/canada-us-trump-tariff-retaliation/",
    "timestamp": "2025-03-12T13:31:01Z"
  },
  {
    "title": "Trump’s Cuts to The Department of Education Are Part of a Long Fight by Conservative Christians",
    "description": "President Donald Trump's cuts to the Department of Education are part of a nearly century-long crusade by conservative Christian groups.",
    "link": "https://time.com/7216493/trumps-cuts-department-of-education-conservative-christians/",
    "timestamp": "2025-03-12T13:30:00Z"
  },
  {
    "title": "Photographer captures what was written on Donald Trump's bizarre note as he bought Tesla from Elon Musk",
    "description": "A photographer was able to capture what was written on Donald Trump's bizarre note as he bought Tesla from Elon Musk in a public display of confidence.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-elon-musk-tesla-purchase-note-954311-20250312",
    "timestamp": "2025-03-12T13:29:45Z"
  },
  {
    "title": "Is the US rethinking its command role in South Korea?",
    "description": "Many South Koreans insist the nation's military is ready to assume wartime control of forces on the peninsula. However, there are fears the Trump administration is laying the groundwork for Seoul to fend for itself.",
    "link": "https://www.dw.com/en/is-the-us-rethinking-its-command-role-in-south-korea/a-71897857",
    "timestamp": "2025-03-12T13:29:00Z"
  },
  {
    "title": "Russia tight-lipped on ceasefire deal as US arms to Ukraine resume",
    "description": "Sources claims Kremlin wary, as Poland reports that US military aid flow to Ukraine is already back up to speed.",
    "link": "https://www.aljazeera.com/news/2025/3/12/russia-tight-lipped-on-ceasefire-deal-as-us-arms-to-ukraine-resume",
    "timestamp": "2025-03-12T13:28:36Z"
  }
]