[
  {
    "title": "Billionaire Richard Branson's take on Trump's 'erratic' and 'catastrophic' tariffs",
    "description": "Virgin Group billionaire Richard Branson criticized Trump's \"erratic\" tariffs, urging a change in course to prevent uncertainty and economic damage.",
    "link": "https://www.businessinsider.com/richard-branson-calls-out-donald-trump-over-tariff-war-2025-4",
    "timestamp": "2025-04-24T15:53:31Z"
  },
  {
    "title": "Trump Team Sinks Even Lower With New Attack on Abrego Garcia’s Wife",
    "description": "Donald Trump’s administration is now attempting to smear the wife of Kilmar Abrego Garcia, the Maryland man deported to El Salvador due to an “administrative error.”\r\nDuring an interview on Newsmax’s Wake Up America Thursday, assistant secretary for the Depar…",
    "link": "https://newrepublic.com/post/194360/donald-trump-team-new-attack-kilmar-abrego-garcia-wife",
    "timestamp": "2025-04-24T15:52:04Z"
  },
  {
    "title": "Keeping Score: Bill Disenfranchising Women Voters Passes U.S. House, Heads to Senate; Barbara Lee Becomes Mayor of Oakland; Republicans Threaten SNAP and Medicaid",
    "description": "In every issue of Ms., we track research on our progress in the fight for equality, catalogue can’t-miss quotes from feminist voices and keep tabs on the feminist movement’s many milestones. We’re Keeping Score online, too—in this biweekly roundup.\nThis week:…",
    "link": "https://msmagazine.com/2025/04/24/keeping-score-feminist-news-save-act-women-voters-senate-barbara-lee-mayor-oakland-republicans-snap-medicaid/",
    "timestamp": "2025-04-24T15:50:53Z"
  },
  {
    "title": "Trump's Skin Returns To Normal Human Color After Ban On Artificial Dyes",
    "description": "WASHINGTON, D.C. — The leader of the free world was sporting a new look this morning, as witnesses noticed that President Donald Trump's skin had returned to normal human color just one day after HHS Secretary Robert F. Kennedy Jr. began phasing out artificia…",
    "link": "https://freerepublic.com/focus/f-chat/4312999/posts",
    "timestamp": "2025-04-24T15:49:19Z"
  },
  {
    "title": "Foreign Policy Experts Warn Against Attack on Iran’s Nuke Facilities",
    "description": "Some lawmakers are calling for President Donald Trump to help Israel strike Iran’s nuclear facilities even as foreign policy experts warn about the potential consequences... Read More\nThe post Foreign Policy Experts Warn Against Attack on Iran’s Nuke Faciliti…",
    "link": "https://www.dailysignal.com/2025/04/24/trump-officials-warn-against-attack-iran/",
    "timestamp": "2025-04-24T15:48:40Z"
  },
  {
    "title": "US to Demand Putin Accept Ukraine’s Right to Military Force",
    "description": "The US will demand that Russia accept Ukraine’s right to have its own army and defense industry as part of a peace agreement between Moscow and Kyiv, according to people familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/us-to-demand-putin-accept-ukraines-right-to-military-force",
    "timestamp": "2025-04-24T15:48:28Z"
  },
  {
    "title": "Germany sees zero growth in 2025, blames Trump tariffs",
    "description": "The German government cut its economic growth forecast to zero citing the impact of US President Donald Trump's trade policies .\n\"There is above all one reason for this, namely Donald Trump's trade policy and the effects of the trade policy on Germany,\" outgo…",
    "link": "https://biztoc.com/x/b4bebeae95864944",
    "timestamp": "2025-04-24T15:47:40Z"
  },
  {
    "title": "Trump Says Could Meet Putin 'Shortly After' Upcoming Middle East Trip",
    "description": "Trump Says Could Meet Putin 'Shortly After' Upcoming Middle East Trip\n \nPresident Donald Trump has said he could meet with Russia's Vladimir Putin shortly after his upcoming trip to the Middle East in May, where's he expected to visit Saudi Arabia, Qatar and …",
    "link": "https://biztoc.com/x/22afec97abdca223",
    "timestamp": "2025-04-24T15:47:37Z"
  },
  {
    "title": "Trump’s Russia-Ukraine war negotiation strategy is incredibly unusual — and not in a good way",
    "description": "Ukrainian President Volodymyr Zelenskyy meeting with US President Donald Trump in the Oval Office of the White House on Friday, Feb. 28, 2025.",
    "link": "https://biztoc.com/x/39b064ca9f410a44",
    "timestamp": "2025-04-24T15:47:35Z"
  },
  {
    "title": "Trump blames Zelenskyy for peace deal setbacks",
    "description": "What happened\nPresident Donald Trump Wednesday criticized Ukrainian President Volodymyr Zelenskyy for rejecting elements of a \"final\" U.S. peace plan presented to Kyiv and Moscow last week. Vice President J.D. Vance, traveling in India, said Trump's \"very exp…",
    "link": "https://biztoc.com/x/43821a85108b0b08",
    "timestamp": "2025-04-24T15:47:14Z"
  },
  {
    "title": "Germany expects zero growth in 2025, blames Trump tariffs",
    "description": "Germany was the only G7 economy that failed to grow for the last two years, and is on track for a third year without growth in 2025.",
    "link": "https://www.dw.com/en/germany-expects-zero-growth-in-2025-blames-trump-tariffs/a-72338707",
    "timestamp": "2025-04-24T15:47:00Z"
  },
  {
    "title": "How GDP of US states Compare With Major Global Economies",
    "description": "Two U.S. states made it into the top 10 largest economies in the world, according to the latest data from the IMF.",
    "link": "https://www.newsweek.com/gdp-us-states-compare-global-economy-2063626",
    "timestamp": "2025-04-24T15:46:45Z"
  },
  {
    "title": "Trump to Investigate Democrat Fundraising Platform Under Scrutiny for Alleged Money Laundering",
    "description": "President Donald Trump will sign a presidential memorandum Thursday launching an investigation into ActBlue for potentially illegal methods of fundraising for Democrats, The Daily Signal... Read More\nThe post Trump to Investigate Democrat Fundraising Platform…",
    "link": "https://www.dailysignal.com/2025/04/24/trump-administration-investigate-democrat-fundraising-platform-scrutiny-alleged-money-laundering/",
    "timestamp": "2025-04-24T15:46:43Z"
  },
  {
    "title": "’60 Minutes’ Producer Quits Over Trump Interference",
    "description": "The top producer for \"60 Minutes\" resigned, citing the loss of journalistic freedom as President Donald Trump has been pressuring its parent network, CBS.",
    "link": "https://hiphopwired.com/2686908/60-minutes-producer-quits-trump-interference/",
    "timestamp": "2025-04-24T15:45:30Z"
  },
  {
    "title": "The US Space Force unveils its plans for fighting wars in outer space",
    "description": "America and China are gearing up for a future where robots do battle throughout our solar system – which is probably less fun than it sounds",
    "link": "https://www.dazeddigital.com/life-culture/article/66667/1/what-is-us-space-force-unveils-plans-for-fighting-wars-in-outer-space-china?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=the-us-space-force-unveils-its-plans-for-fighting-wars-in-outer-space",
    "timestamp": "2025-04-24T15:45:00Z"
  },
  {
    "title": "EU Energy Crisis: Chasing ‘Freedom’ at the Cost of Its Wallet",
    "description": "The European Union’s anti-Russia stance burned cash and left it with sky-high energy costs, while India and China thrive.",
    "link": "https://sputnikglobe.com/20250424/eu-energy-crisis-chasing-freedom-at-the-cost-of-its-wallet--1121928182.html",
    "timestamp": "2025-04-24T15:44:45Z"
  },
  {
    "title": "Ukraine debt talks fail",
    "description": "Kiev could default if it doesn’t make the $600 million debt payment due next month Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616209-ukraine-debt-talks-fail/",
    "timestamp": "2025-04-24T15:44:43Z"
  },
  {
    "title": "I Was Swatted",
    "description": "A disturbing surge of swatting attacks has struck media personalities, conservative influencers, and me too. The FBI is investigating. FBI Director Kash Patel has said, “This isn’t about politics—weaponizing law enforcement against ANY American is not only mo…",
    "link": "https://freerepublic.com/focus/f-chat/4312997/posts",
    "timestamp": "2025-04-24T15:44:32Z"
  },
  {
    "title": "‘Very Dangerous’: National Review Rakes Trump Over the Coals for Trying to Get Ukraine to ‘Surrender to Russia’",
    "description": "National Review raked President Donald Trump over coals over his attempts at forcing Ukraine to accept an unfavorable peace with Russia.\nThe post ‘Very Dangerous’: National Review Rakes Trump Over the Coals for Trying to Get Ukraine to ‘Surrender to Russia’ f…",
    "link": "https://www.mediaite.com/news/very-dangerous-national-review-rakes-trump-over-the-coals-for-trying-to-get-ukraine-to-surrender-to-russia/",
    "timestamp": "2025-04-24T15:43:28Z"
  },
  {
    "title": "Trump expected to target ActBlue, a major Democratic fundraising platform",
    "description": "President Donald Trump will sign an executive order or memorandum Thursday aimed at ActBlue, the leading Democratic fundraising platform, a senior White House official told NBC News.",
    "link": "https://www.nbcnews.com/politics/trump-administration/trump-expected-sign-memo-targeting-act-blue-rcna202673",
    "timestamp": "2025-04-24T15:43:24Z"
  },
  {
    "title": "Trump’s Newest Crypto Scheme Is His Most Corrupt Yet",
    "description": "Donald Trump’s memecoin rocketed in value following news that the president would meet with some of the cryptocurrency’s top investors.\r\nTrump is scheduled to have a private dinner on May 22 at Trump National Golf Club in Washington with the 220 people who ha…",
    "link": "https://newrepublic.com/post/194358/donald-trump-crypto-currency-scheme-corrupt",
    "timestamp": "2025-04-24T15:43:00Z"
  },
  {
    "title": "As Trump Scraps EV Policy, Can Electric Freight Companies Keep on Trucking?",
    "description": "A new charging station is a step forward in the electric trucking transition, but the industry faces headwinds from Trump's tariffs and hostility toward EVs.",
    "link": "https://www.newsweek.com/trump-scraps-ev-policy-can-electric-freight-companies-keep-trucking-2063584",
    "timestamp": "2025-04-24T15:41:37Z"
  },
  {
    "title": "Kent State student's violent anti-Trump art display spurs outrage",
    "description": "A Kent State student's art exhibit that depicted a violent image and message toward President Trump went viral and prompted the university to respond last week.",
    "link": "https://www.foxnews.com/media/kent-state-students-violent-anti-trump-art-display-spurs-outrage",
    "timestamp": "2025-04-24T15:41:35Z"
  },
  {
    "title": "Bank of England chief focused on tariff 'growth shock' but downplays UK recession risk",
    "description": "The Bank of England is focused on the potential U.K. growth shock from U.S. tariffs if there is a slowdown in global trade, the central bank's governor Andrew Bailey said Thursday.",
    "link": "https://www.cnbc.com/2025/04/24/bank-of-england-chief-focused-on-tariff-growth-shock.html",
    "timestamp": "2025-04-24T15:41:08Z"
  },
  {
    "title": "'Biden effect' hits the Senate: Wave of retirements clears path for younger Dems",
    "description": "After Sen. Dick Durbin announced his retirement, the idea of the \"Biden effect\" came back into focus.",
    "link": "https://www.foxnews.com/politics/biden-effect-hits-senate-wave-retirements-clears-path-younger-dems",
    "timestamp": "2025-04-24T15:40:54Z"
  },
  {
    "title": "Chris Cuomo to Host Trump Town Hall With Stephen A. Smith, Bill O’Reilly",
    "description": "Next week's NewsNation event will recap President Trump's first 100 days back in office with RFK Jr., Sarah Palin and more\nThe post Chris Cuomo to Host Trump Town Hall With Stephen A. Smith, Bill O’Reilly appeared first on TheWrap.",
    "link": "https://www.thewrap.com/cuomo-trump-town-hall-news-nation/",
    "timestamp": "2025-04-24T15:40:31Z"
  },
  {
    "title": "Buttigieg Calls Out ‘Societal Problem’ of Getting Your News From ‘Some Dude on the Internet’ While on a Manosphere Podcast",
    "description": "\"We no longer have access to the editorial function, by which I mean like a professional news organization,” Buttigieg told Andrew Schulz\nThe post Buttigieg Calls Out ‘Societal Problem’ of Getting Your News From ‘Some Dude on the Internet’ While on a Manosphe…",
    "link": "https://www.mediaite.com/news/buttigieg-calls-out-societal-problem-of-getting-your-news-from-some-dude-on-the-internet-while-on-a-manosphere-podcast/",
    "timestamp": "2025-04-24T15:38:38Z"
  },
  {
    "title": "Trump blames Zelenskyy for peace deal setbacks",
    "description": "Ukrainian President Volodymyr Zelenskyy has rejected the US proposal, which includes Russia's takeover of Crimea",
    "link": "https://theweek.com/politics/trump-zelenskyy-russia-ukraine-war-peace-talks",
    "timestamp": "2025-04-24T15:38:38Z"
  },
  {
    "title": "Guess Who's Approval Numbers Are In The Potty",
    "description": "President Donald Trump loves to crow about polling numbers, but he won’t be boasting about new polling from Pew Research, which shows that the longer Trump is president, the less Americans approve of what he’s doing.\nIt may seem like Trump has been in office …",
    "link": "https://crooksandliars.com/2025/04/guess-whos-approval-numbers-are-potty",
    "timestamp": "2025-04-24T15:38:27Z"
  },
  {
    "title": "Donald Trump Makes Emergency Supreme Court Appeal",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Thursday, the Trump administration requested that the U.S. Supreme Court permit enforcement of its ban on transgender individuals serving in the military, even as legal challenges to the policy continue.\nTh…",
    "link": "https://biztoc.com/x/673ed045da28fe9f",
    "timestamp": "2025-04-24T15:36:45Z"
  },
  {
    "title": "Rubio’s reforms address Trump’s unfinished business with ‘bloated’ State Department",
    "description": "'Comprehensive reorganization plan will bring the department into the 21st Century'",
    "link": "https://www.wnd.com/2025/04/rubios-reforms-address-trumps-unfinished-business-with-bloated-state-department/",
    "timestamp": "2025-04-24T15:36:38Z"
  },
  {
    "title": "George Clooney: Democrats 'Don’t Have Anybody as Charismatic as' Trump",
    "description": "Actor George Clooney acknowledged that Democrats have a problem relating to the common man and advised they get a sense of humor in the hopes of beating President Donald Trump.",
    "link": "https://www.breitbart.com/entertainment/2025/04/24/george-clooney-democrats-need-a-sense-of-humor-to-beat-trump/",
    "timestamp": "2025-04-24T15:36:24Z"
  },
  {
    "title": "Donald Trump Makes Emergency Supreme Court Appeal",
    "description": "Despite representing less than 1 percent of the active-duty force, thousands of transgender people serve in the U.S. military.",
    "link": "https://www.newsweek.com/donald-trump-makes-emergency-supreme-court-appeal-2063701",
    "timestamp": "2025-04-24T15:35:25Z"
  },
  {
    "title": "Harvard President Explains Why Suing The Trump Administration Was Inevitable",
    "description": "Donald Trump on Thursday called the elite school a \"threat to Democracy.\"",
    "link": "https://www.huffpost.com/entry/harvard-president-trump-administration-lawsuit_n_680a1597e4b0c44791370dec",
    "timestamp": "2025-04-24T15:34:21Z"
  },
  {
    "title": "Megyn Kelly Defends Dramatic Turn On Trump As Stephen A. Smith Presses Her On President’s Past Insults: ‘Professionally, I Fell In Love With Him’",
    "description": "Megyn Kelly declared that she \"fell in love\" with President Donald Trump \"professionally\" leading to her moving past their feud.\nThe post Megyn Kelly Defends Dramatic Turn On Trump As Stephen A. Smith Presses Her On President’s Past Insults: ‘Professionally, …",
    "link": "https://www.mediaite.com/podcasts/megyn-kelly-defends-dramatic-turn-on-trump-as-stephen-a-smith-presses-her-on-presidents-past-insults-professionally-i-fell-in-love-with-him/",
    "timestamp": "2025-04-24T15:33:46Z"
  },
  {
    "title": "China Says US Should Revoke Unilateral Tariffs, Denies Talks",
    "description": "China demanded that the US revoke all unilateral tariffs and denied there were talks on reaching a trade deal, maintaining a defiant stance despite President Donald Trump’s recent easing of criticism of the country.",
    "link": "https://financialpost.com/pmn/business-pmn/china-says-us-should-revoke-unilateral-tariffs-denies-talks",
    "timestamp": "2025-04-24T15:33:32Z"
  },
  {
    "title": "Private Lenders in Europe Want In on the ‘Sell America’ Movement",
    "description": "They’ve long been a second thought in the US-dominated world of private credit, but fund managers in Europe are now getting a spike in interest from global LPs — and they’re eager to grab a piece of the “Sell America” movement.",
    "link": "https://financialpost.com/pmn/business-pmn/private-lenders-in-europe-want-in-on-the-sell-america-movement",
    "timestamp": "2025-04-24T15:33:19Z"
  },
  {
    "title": "The Supreme Court’s ‘Selective Proceduralism’ Would Suffocate the Constitution",
    "description": "The law allows for extraordinary interventions under extraordinary circumstances, such as when human beings face the possibility of lifetime incarceration without due process.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/alito-thomas-dissent/682571/",
    "timestamp": "2025-04-24T15:33:11Z"
  },
  {
    "title": "Canada Election Prediction Map Offers Good News for Mark Carney",
    "description": "The Liberal Party is forecast to win 186 seats in Monday's election, surpassing the 172 seats required for a majority, according to an election projection.",
    "link": "https://www.newsweek.com/canada-election-prediction-map-mark-carney-liberal-party-2063625",
    "timestamp": "2025-04-24T15:32:44Z"
  },
  {
    "title": "Trump should be ‘free’ to criticize the Fed, senior official says",
    "description": "President Donald Trump should be free to voice his opinion about the US Federal Reserve, a senior bank official said Thursday, while defending the central bank’s independence to tackle inflation.  “Criticism of what we do, that’s the job,” Fed Governor Christ…",
    "link": "https://www.digitaljournal.com/business/trump-should-be-free-to-criticize-the-fed-senior-official-says/article",
    "timestamp": "2025-04-24T15:32:33Z"
  },
  {
    "title": "Trump should be ‘free’ to criticize the Fed, senior official says",
    "description": "President Donald Trump should be free to voice his opinion about the US Federal Reserve, a senior bank official said Thursday, while defending the central bank’s independence to tackle inflation.  “Criticism of what we do, that’s the job,” Fed Governor Christ…",
    "link": "https://www.digitaljournal.com/world/trump-should-be-free-to-criticize-the-fed-senior-official-says/article",
    "timestamp": "2025-04-24T15:32:33Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
    "description": "Markets traded range-bound on April expiry day amid global selling pressure and weak FMCG earnings; analysts expect continued consolidation and advise stock-specific buying on dips.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/120590270.cms",
    "timestamp": "2025-04-24T15:32:17Z"
  },
  {
    "title": "Trump’s Trade Deals Vexed by Cautious Countries",
    "description": "\"Two weeks after President Donald Trump paused plans for steep tariffs with promises that a flurry of negotiated deals would ensue, the relative quiet has been deafening – roiling markets and calling into question the",
    "link": "https://politicalwire.com/2025/04/24/trumps-trade-deals-vexed-by-cautious-countries/",
    "timestamp": "2025-04-24T15:31:02Z"
  },
  {
    "title": "‘Not Even Close!’ CNN Anchor Abby Phillip Torpedoes Trump ‘Lies’ — Rubs Salt In Tanking Polls",
    "description": "CNN anchor Abby Phillip torpedoed President Donald Trump over several recent \"lies\" and noted new polling that shows Trump at historic levels of unpopularity\nThe post ‘Not Even Close!’ CNN Anchor Abby Phillip Torpedoes Trump ‘Lies’ — Rubs Salt In Tanking Poll…",
    "link": "https://www.mediaite.com/news/not-even-close-cnn-anchor-abby-phillip-torpedoes-trump-lies-rubs-salt-in-tanking-polls/",
    "timestamp": "2025-04-24T15:30:59Z"
  },
  {
    "title": "Trump Should Be 'Free' To Criticize The Fed, Senior Official Says",
    "description": "President Donald Trump should be free to voice his opinion about the US Federal Reserve, a senior bank official said Thursday, while defending the central bank's independence to tackle inflation.",
    "link": "https://www.ibtimes.com/trump-should-free-criticize-fed-senior-official-says-3771258",
    "timestamp": "2025-04-24T15:30:23Z"
  },
  {
    "title": "ICE Awarded a $3.8 Billion Contract to Hold Immigrants on a Military Base. Days Later, It Was Canceled.",
    "description": "by Jeff Ernsthausen, Mica Rosenberg and Avi Asher-Schapiro \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nIn an unusual move, the administrati…",
    "link": "https://www.propublica.org/article/ice-cancels-contract-immigrant-detention-camp-fort-bliss",
    "timestamp": "2025-04-24T15:30:00Z"
  },
  {
    "title": "Elon Musk forced back to the boardroom as Doge ‘blowback’ pummels Tesla",
    "description": "Billionaire’s foray into government coincided with increased competition from Chinese rivals",
    "link": "https://www.irishtimes.com/business/2025/04/24/elon-musk-forced-back-to-the-boardroom-as-doge-blowback-pummels-tesla/",
    "timestamp": "2025-04-24T15:30:00Z"
  },
  {
    "title": "Kanye West Blames Jay-Z Lyrics For Why They Haven't Collaborated On Music Since Donda",
    "description": "Ye was not happy with what Jay said on his song.",
    "link": "https://www.cinemablend.com/television/kanye-west-blames-jay-z-lyrics-for-no-music-collaborations-since-donda",
    "timestamp": "2025-04-24T15:28:28Z"
  },
  {
    "title": "Israel pauses as the Jewish state honors and remembers victims of the Holocaust",
    "description": "Israel marked Holocaust Remembrance Day as the nation came to a standstill to remember the victims of the Nazi genocide against the Jews.",
    "link": "https://www.foxnews.com/world/israel-pauses-jewish-state-honors-remembers-victims-holocaust",
    "timestamp": "2025-04-24T15:27:23Z"
  },
  {
    "title": "A pair of tuition-free schools started by Mark Zuckerberg and Priscilla Chan will close this year, and it’s not clear why",
    "description": "A pair of tuition-free schools started by the Chan Zuckerberg Initiative will close at the end of this school year. The Primary School, which operates both locations, did not give a reason for the closure. Mark Zuckerberg has become increasingly close with Do…",
    "link": "https://biztoc.com/x/33b43f5f4f03bd77",
    "timestamp": "2025-04-24T15:25:40Z"
  },
  {
    "title": "Trump trade war spreads more gloom across businesses",
    "description": "By Richa Naidu, Hyunjoo Jin and Jessica DiNapoli\nLONDON/SEOUL/NEW YORK (Reuters) -Businesses across multiple industries are increasing prices, cutting financial guidance and warning of growing uncertainty as U.S. President Donald Trump's trade war pushes up c…",
    "link": "https://biztoc.com/x/057ee810f2e3c670",
    "timestamp": "2025-04-24T15:25:22Z"
  },
  {
    "title": "Feds accidentally publish secret plan to kill NYC congestion pricing",
    "description": "U.S. Transportation Secretary Sean Duffy might want to reconsider his legal argument to shut down congestion pricing, according to a letter accidentally published by federal lawyers this week.\n \n\nLawyers for the federal government briefly uploaded a letter la…",
    "link": "https://gothamist.com/news/feds-accidentally-publish-secret-plan-to-kill-nyc-congestion-pricing",
    "timestamp": "2025-04-24T15:25:00Z"
  },
  {
    "title": "Trump urges Supreme Court to let trans military ban proceed",
    "description": "The Trump administration is asking the Supreme Court to lift a lower court's order blocking the Pentagon's transgender military ban from going into effect.",
    "link": "https://www.foxnews.com/politics/trump-urges-supreme-court-let-trans-military-ban-proceed",
    "timestamp": "2025-04-24T15:24:56Z"
  },
  {
    "title": "Letitia James Gives Update on Plans Amid Mortgage Fraud Allegations",
    "description": "The New York Attorney General said on a podcast on Tuesday that she was on Donald Trump's \"enemies list.\"",
    "link": "https://www.newsweek.com/letitia-james-mortgage-fraud-bondi-trump-2063325",
    "timestamp": "2025-04-24T15:24:55Z"
  },
  {
    "title": "Procter & Gamble Cuts Full-year Forecast Amid Tariffs and Weaker Demand, Signals Price Hikes",
    "description": "“We also need to consider some level of consumer pricing in affected categories and markets,” said P&G chief financial officer Andre Schulten.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/procter-gamble-cuts-full-year-forecast-tariffs-weaker-sale-1237102084/",
    "timestamp": "2025-04-24T15:24:21Z"
  },
  {
    "title": "Elon Poll: Two-thirds of Americans fear a constitutional crisis between the Trump administration and the courts",
    "description": "Public deeply divided on the President’s executive actions and judicial responses",
    "link": "https://www.ncspin.com/elon-poll-two-thirds-of-americans-fear-a-constitutional-crisis-between-the-trump-administration-and-the-courts",
    "timestamp": "2025-04-24T15:23:35Z"
  },
  {
    "title": "White House hits back at ‘talentless’ Jimmy Kimmel after Hegseth roast: ‘Severe case of Trump Derangement Syndrome’",
    "description": "The president and the TV talk show host have a history of taking potshots at each other",
    "link": "https://www.the-independent.com/news/world/americas/us-politics/jimmy-kimmel-trump-hegeseth-signal-b2738679.html",
    "timestamp": "2025-04-24T15:23:24Z"
  },
  {
    "title": "Airlines, rattled by trade war and spending pullback, continue to cut flights, pull outlooks",
    "description": "Major U.S. airlines are reducing their flight schedules and revising or withdrawing their profit outlooks for the year due to less domestic travel demand as sentiment about the national and global economies sours. American Airlines pulled its financial guidan…",
    "link": "https://www.seattlepi.com/living/article/airlines-rattled-by-trade-war-and-spending-20292378.php",
    "timestamp": "2025-04-24T15:22:55Z"
  },
  {
    "title": "Trump: Harvard is antisemitic, far-left, and accepts foreign students who want to rip apart US",
    "description": "\"The place is a liberal mess, allowing a certain group of crazed lunatics to enter and exit the classroom and spew fake anger and hate,\" said Trump.",
    "link": "https://www.jpost.com/diaspora/antisemitism/article-851401",
    "timestamp": "2025-04-24T15:20:51Z"
  },
  {
    "title": "Biggest Russian attack on Kyiv since last summer leaves 12 dead",
    "description": "It was Russia's deadliest assault on the Ukrainian capital since last July, and it occurred just as peace efforts are coming to a head.",
    "link": "https://www.pbs.org/newshour/world/biggest-russian-attack-on-kyiv-since-last-summer-leaves-12-dead",
    "timestamp": "2025-04-24T15:20:47Z"
  },
  {
    "title": "Tornado victims blocked from federal recovery aid after Trump denied request (Ella Nilsen/CNN)",
    "description": "Ella Nilsen / CNN:\nTornado victims blocked from federal recovery aid after Trump denied request  —  Disaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected th…",
    "link": "https://www.memeorandum.com/250424/p59",
    "timestamp": "2025-04-24T15:20:01Z"
  },
  {
    "title": "Trump asks Supreme Court to allow ban on transgender members of the military to take effect, for now",
    "description": "A federal judge blocked the ban in March.",
    "link": "https://www.denverpost.com/2025/04/24/trump-transgender-military-ban-supreme-court/",
    "timestamp": "2025-04-24T15:19:31Z"
  },
  {
    "title": "Trump asks Supreme Court to allow ban on transgender members of the military to take effect, for now",
    "description": "A federal judge blocked the ban in March.",
    "link": "https://www.bostonherald.com/2025/04/24/trump-transgender-military-ban-supreme-court/",
    "timestamp": "2025-04-24T15:19:31Z"
  },
  {
    "title": "Trump administration asks Supreme Court to allow ban on transgender military troops",
    "description": "Two federal district judges have said the Trump administration hasn't supported its claim that transgender troops hurt military readiness.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/24/supreme-court-trump-transgender-troops-military-ban/82761802007/",
    "timestamp": "2025-04-24T15:19:30Z"
  },
  {
    "title": "Is China really negotiating with Trump? The truth behind tariff talks",
    "description": "China refuted claims of active tariff negotiations with the U.S., dismissing them as baseless. This response follows Trump's suggestion of potential tariff reductions. Chinese officials emphasized their openness to dialogue based on mutual respect and equalit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-china-really-negotiating-with-trump-the-truth-behind-tariff-talks/articleshow/120590087.cms",
    "timestamp": "2025-04-24T15:18:55Z"
  },
  {
    "title": "Drive-By Pooping: Ohio Woman Faces Arrest for Allegedly Pelting Tesla with Dog Feces from Moving Car",
    "description": "An Ohio woman is facing littering and criminal mischief charges after allegedly throwing dog feces onto a Tesla Cybertruck from her moving vehicle in a Costco parking lot in a Cleveland-area suburb. The woman's dog temporarily escaped from her vehicle during …",
    "link": "https://www.breitbart.com/tech/2025/04/24/drive-by-pooping-ohio-woman-faces-arrest-for-allegedly-pelting-tesla-with-dog-feces-from-moving-car/",
    "timestamp": "2025-04-24T15:17:40Z"
  },
  {
    "title": "'Clearly dangerous' Army reservist remains ready to deploy despite white nationalism probe",
    "description": "A former North Carolina National Guard member remains in reserve status — part of a pool of soldiers on standby for deployment — more than 18 months after the Army initiated an investigation into his extremist activities, Raw Story has learned.The Army Human …",
    "link": "https://www.rawstory.com/u-s-army-reservist-who-organized-white-nationalist-paramilitary-group-still-on-standby/",
    "timestamp": "2025-04-24T15:16:55Z"
  },
  {
    "title": "Trump Prefers Original 'Redskins' Name over 'Washington Commanders'",
    "description": "President Donald Trump said that he prefers the original Washington Redskins name over its politically correct replacement.\nThe post Trump Prefers Original ‘Redskins’ Name over ‘Washington Commanders’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/04/24/trump-prefers-original-redskins-name-over-washington-commanders/",
    "timestamp": "2025-04-24T15:15:49Z"
  },
  {
    "title": "China Demands Trump Make the First Move in Trade Talks After Revealing 'No Negotiations' Have Taken Place Yet",
    "description": "China said no trade talks with the U.S. are underway after Trump officials hinted at possible negotiations, and won't begin unless Trump lifts tariffs.",
    "link": "https://www.ibtimes.com/china-demands-trump-make-first-move-trade-talks-after-revealing-no-negotiations-have-taken-3771250",
    "timestamp": "2025-04-24T15:15:33Z"
  },
  {
    "title": "Former NATO Supreme Allied Commander Mocks Trump’s ‘Vladimir, STOP!’ Message to Putin",
    "description": "Retired Supreme Allied Commander of NATO appeared on CNN Thursday morning and mocked Trump's beggin Putin to stop bombing Ukraine amid ongoing peace talks.\nThe post Former NATO Supreme Allied Commander Mocks Trump’s ‘Vladimir, STOP!’ Message to Putin first ap…",
    "link": "https://www.mediaite.com/tv/former-nato-supreme-allied-commander-mocks-trumps-vladimir-stop-message-to-putin/",
    "timestamp": "2025-04-24T15:15:27Z"
  },
  {
    "title": "Trump’s peace offer on Ukraine is generous to Russia, and may not even be enough for Putin | CNN",
    "description": "Imposing a deadline on a negotiation for a deal you desperately want is a risky tactic if your only move is to walk away from a deal you desperately want.",
    "link": "https://www.cnn.com/2025/04/24/europe/trump-putin-peace-ukraine-analysis-intl/index.html",
    "timestamp": "2025-04-24T15:15:13Z"
  },
  {
    "title": "Trump’s Russia-Ukraine war negotiation strategy is incredibly unusual — and not in a good way",
    "description": "Trump's right to want an immediate, diplomatic end to the carnage in Ukraine. He's wrong if he thinks what he's doing is \"diplomacy.\"",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-ukraine-zelenskyy-russia-putin-war-rcna202724",
    "timestamp": "2025-04-24T15:15:11Z"
  },
  {
    "title": "Trump Ramps Up Pressure on Zelenskiy to Accept Peace Deal",
    "description": "President Donald Trump ratcheted up pressure on Volodymyr Zelenskiy to accept a peace deal that critics fear will favor Moscow, accusing the Ukrainian president of prolonging the war that’s now in its fourth year.\nTrump’s latest broadside against Zelenskiy, m…",
    "link": "https://biztoc.com/x/ca9e81a0bc05555f",
    "timestamp": "2025-04-24T15:14:09Z"
  },
  {
    "title": "This senator met with Abrego Garcia in El Salvador. He tells us what he saw.",
    "description": "Since being deported to El Salvador last month, Kilmar Abrego Garcia has had very little contact with the outside world — something that Democratic Maryland Sen. Chris Van Hollen tried to change.  Last week, Van Hollen flew to El Salvador to meet with Abrego …",
    "link": "https://www.vox.com/politics/410207/chris-van-hollen-el-salvador-kilmar-abrego-garcia-interview",
    "timestamp": "2025-04-24T15:13:36Z"
  },
  {
    "title": "Strong DTC, Americas Help Zegna Group Offset Wholesale Declines in Q1",
    "description": "The group expects to raise prices in the U.S. come fall to offset the tariffs being imposed on imports by the Trump administration.",
    "link": "http://wwd.com/business-news/financial/strong-dtc-americas-help-zegna-group-offset-wholesale-declines-first-quarter-1237101672/",
    "timestamp": "2025-04-24T15:13:06Z"
  },
  {
    "title": "WATCH LIVE: Trump meets with prime minister of Norway at White House",
    "description": "Later this evening, at 6:30 p.m., Trump will travel to his golf club in Washington, D.C., where he will attend a MAGA Inc. dinner.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-meets-with-prime-minister-of-norway-at-white-house",
    "timestamp": "2025-04-24T15:12:40Z"
  },
  {
    "title": "Rumping For Joy + Pedro Pascal Thumps J.K. Rowling + Jolly For Florida? + LOVE ON THE SPECTRUM vs. RFK Jr. + MORE! — 6-PACK",
    "description": "Rumping For Joy + Pedro Pascal Thumps J.K. Rowling + Jolly For Florida? + LOVE ON THE SPECTRUM vs. RFK Jr. + MORE! — 6-PACK",
    "link": "https://www.boyculture.com/boy_culture/2025/04/rfk-jr-autism-trump-shirtless-gay-underwear-rowling-pascal.html",
    "timestamp": "2025-04-24T15:11:57Z"
  },
  {
    "title": "Baby Bonus in the U.S.: How much could it cost and will eligibility extend beyond new mothers?",
    "description": "The United States recorded just over 3.59 million births in 2023—the lowest figure in recent years, according to the Centers for Disease Control and Prevention.",
    "link": "https://economictimes.indiatimes.com/news/international/us/baby-bonus-in-the-u-s-how-much-could-it-cost-and-will-eligibility-extend-beyond-new-mothers/articleshow/120589809.cms",
    "timestamp": "2025-04-24T15:10:51Z"
  },
  {
    "title": "Pope Francis' funeral will feature huge security operation in Rome",
    "description": "ROME (Reuters) - From patrols on the River Tiber to surveillance drones and snipers deployed around St. Peter's Square, Rome is preparing to throw a thoroughly modern security shield around the ancient rituals of a papal funeral and its attendant huge crowds.…",
    "link": "https://www.thestar.com.my/news/world/2025/04/24/pope-francis039-funeral-will-feature-huge-security-operation-in-rome",
    "timestamp": "2025-04-24T15:10:00Z"
  },
  {
    "title": "Airlines, rattled by trade war and spending pullback, continue to cut flights, pull outlooks",
    "description": "Major U.S. airlines are reducing their flight schedules and revising or withdrawing their profit outlooks for the year due to less domestic travel demand as sentiment about the national and global economies sours. American Airlines pulled its financial guidan…",
    "link": "https://financialpost.com/pmn/airlines-rattled-by-trade-war-and-spending-pullback-continue-to-cut-flights-pull-outlooks",
    "timestamp": "2025-04-24T15:09:57Z"
  },
  {
    "title": "Corporate America puts Wall Street on alert over damage from Trump’s trade war",
    "description": "As S&P 500 firms kick off Q1 earnings season, 90 per cent cite tariffs impacts, including on costs and profit guidance.  Find out more",
    "link": "https://financialpost.com/financial-times/corporate-america-puts-wall-street-on-alert",
    "timestamp": "2025-04-24T15:07:26Z"
  },
  {
    "title": "A Certain Idea of Europe",
    "description": "With Donald Trump destroying America’s role in the world, Europe must fashion itself into a self-sufficient real-world power – and fast. That means embracing a shared conception of “Europe” and taking the steps necessary to embody a singular, supranational po…",
    "link": "https://www.project-syndicate.org/commentary/europe-after-trumps-abandonment-by-joschka-fischer-2025-04",
    "timestamp": "2025-04-24T15:07:14Z"
  },
  {
    "title": "German coalition member backs US easing Nord Stream sanctions in Russia peace talks",
    "description": "A move by the White House to grant a reprieve to Russian energy divides Berlin's incoming government.",
    "link": "https://www.politico.eu/article/german-spd-lawmaker-open-to-easing-nord-stream-sanctions-in-peace-talks/",
    "timestamp": "2025-04-24T15:06:18Z"
  },
  {
    "title": "Trump trade war spreads more gloom across businesses",
    "description": "LONDON/SEOUL/NEW YORK (Reuters) -Businesses across multiple industries are increasing prices, cutting financial guidance and warning of growing uncertainty...",
    "link": "https://finance.yahoo.com/news/trump-trade-war-spreads-more-150605606.html",
    "timestamp": "2025-04-24T15:06:05Z"
  },
  {
    "title": "Germany sees zero growth in 2025, blames Trump tariffs",
    "description": "Germany was the only G7 economy that failed to grow for the last two years, and is on track for a third year without growth in 2025.",
    "link": "https://www.dw.com/en/germany-sees-zero-growth-in-2025-blames-trump-tariffs/a-72338707",
    "timestamp": "2025-04-24T15:05:00Z"
  },
  {
    "title": "Air raids and ABCs",
    "description": "William Fleeson |  A Christian school in Kyiv defies bombings, low enrollment, and dim peace prospects to serve missionary and expat families",
    "link": "https://wng.org/articles/air-raids-and-abcs-1745504981",
    "timestamp": "2025-04-24T15:05:00Z"
  },
  {
    "title": "Western aggression could trigger Russian nuclear response – security chief",
    "description": "Moscow is closely monitoring the EU’s militarization amid the Ukraine conflict, Sergey Shoigu has warned Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/616220-western-aggression-russian-nuclear-response/",
    "timestamp": "2025-04-24T15:03:47Z"
  },
  {
    "title": "Trump’s ‘art of retreat’ may signal he’s setting Powell up to take the fall for economic turmoil",
    "description": "Trump’s ‘art of retreat’ may signal he’s setting Powell up to take the fall for economic turmoil\nDonald Trump nominated Powell to be chairman of the Fed. Before and during Trump's second term he has criticized Powell, before abruptly changing his tune this we…",
    "link": "https://biztoc.com/x/1ff339f5ffa3752c",
    "timestamp": "2025-04-24T15:03:28Z"
  },
  {
    "title": "US appeals court pauses NC elections board action in the Supreme Court election case",
    "description": "Once again the NC Supreme Court race is thrown into turmoil.",
    "link": "https://www.ncspin.com/us-appeals-court-pauses-nc-elections-board-action-in-the-supreme-court-election-case",
    "timestamp": "2025-04-24T15:03:00Z"
  },
  {
    "title": "New polls show Trump’s approval rating sinking lower, weakening his power",
    "description": "Why should the public care about Donald Trump's sinking approval rating?  Because flailing presidents wield less power — domestically and abroad.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-polls-show-trumps-approval-rating-sinking-lower-weakening-power-rcna202783",
    "timestamp": "2025-04-24T15:02:39Z"
  },
  {
    "title": "Is Trump's tariff strategy driving America towards recession? Shocking poll results",
    "description": "A recent poll indicates declining American confidence in President Donald Trump's economic policies. Many fear a potential recession due to his tariffs. Concerns are rising about increased prices. While skepticism grows, a complete rejection of Trump's trade …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-trumps-tariff-strategy-driving-america-towards-recession-shocking-poll-results/articleshow/120589700.cms",
    "timestamp": "2025-04-24T15:01:58Z"
  },
  {
    "title": "Trump Blocks Federal Aid for Tornado Victims",
    "description": "\"Disaster survivors in Arkansas left homeless by recent tornadoes have been blocked from receiving federal recovery aid after President Donald Trump rejected the state’s request to declare a major disaster in March,\" CNN reports. \"The",
    "link": "https://politicalwire.com/2025/04/24/trump-blocks-federal-aid-for-tornado-victims/",
    "timestamp": "2025-04-24T15:01:33Z"
  },
  {
    "title": "US Existing Home Sales See Biggest Drop Since 2022",
    "description": "Sales of existing US homes pulled back more than expected in March, logging their biggest drop since late-2022 according to industry data released Thursday, as high mortgage rates weighed on affordability for homebuyers.",
    "link": "https://www.ibtimes.com/us-existing-home-sales-see-biggest-drop-since-2022-3771252",
    "timestamp": "2025-04-24T15:00:24Z"
  }
]