[
  {
    "title": "Trump demands end to cashless bail, says 'complete disaster' driving crime in cities, endangering police (Danielle Wallace/Fox News)",
    "description": "Danielle Wallace / Fox News:\nTrump demands end to cashless bail, says ‘complete disaster’ driving crime in cities, endangering police  —  Trump warns that ‘WORST criminals are flooding our streets’ due to no-cash bail laws  —  President Donald Trump demanded …",
    "link": "https://www.memeorandum.com/250721/p75",
    "timestamp": "2025-07-21T17:50:00Z"
  },
  {
    "title": "Hunter Biden Says He Would ‘F*cking Invade’ Sovereign Nation To Bring Illegals Back To US",
    "description": "Hunter Biden said that if he became president, he'd threaten to \"invade\" El Salvador to retrieve illegal migrants Donald Trump's administration has sent there.",
    "link": "https://dailycaller.com/2025/07/21/hunter-biden-invade-sovereign-nation-illegals-us/",
    "timestamp": "2025-07-21T17:48:55Z"
  },
  {
    "title": "The Trump Administration “Cheated” Alaska Senator Lisa Murkowski Out of a Deal",
    "description": "You’re telling me the president lied to someone? I’m shocked.",
    "link": "https://www.esquire.com/news-politics/politics/a65465854/lisa-murkowski-gop-bill-trump-alaska/",
    "timestamp": "2025-07-21T17:48:00Z"
  },
  {
    "title": "Here’s exactly how much you’ll save on your 2026 taxes, by income bracket: Trump Big Beautiful Bill benefits",
    "description": "Now that President Donald Trump’s so-called Big Beautiful Bill is the law, you’re probably wondering how much you’ll save on your taxes when you file next year. The Tax Policy Center (TPC), a nonpartisan think tank staffed by the Urban Institute and the Brook…",
    "link": "https://www.fastcompany.com/91371700/2026-taxes-exactly-how-much-youll-save-by-income-bracket-trump-big-beautiful-bill-benefits-analysis",
    "timestamp": "2025-07-21T17:45:00Z"
  },
  {
    "title": "State Department Revokes Visa for Brazil's Bolsonaro-Persecuting Judge Alexandre de Moraes",
    "description": "U.S. Secretary of State Marco Rubio imposed U.S. visa restrictions over the weekend on Brazil Supreme Federal Tribunal (STF) Justice Alexandre de Moraes in response to his involvement in the censorship of the free speech rights of Americans and the political …",
    "link": "https://www.breitbart.com/latin-america/2025/07/21/state-department-revokes-visa-for-brazils-bolsonaro-persecuting-judge-alexandre-de-moraes/",
    "timestamp": "2025-07-21T17:44:37Z"
  },
  {
    "title": "It would be surprising if Trump wins his Epstein lawsuit against Murdoch and the Journal",
    "description": "President Donald Trump filed a defamation lawsuit Friday over a Wall Street Journal article related to Jeffrey Epstein.",
    "link": "https://biztoc.com/x/c2dee2e607bfd536",
    "timestamp": "2025-07-21T17:42:01Z"
  },
  {
    "title": "WATCH: Trump Jokes About Dating Young Girl ‘In 10 Years’ in Newly Resurfaced Clip",
    "description": "President Donald Trump joked about dating a young girl \"in 10 years\" in a resurfaced clip published by Entertainment Tonight.\nThe post WATCH: Trump Jokes About Dating Young Girl ‘In 10 Years’ in Newly Resurfaced Clip first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/watch-trump-jokes-about-dating-young-girl-in-10-years-in-newly-resurfaced-clip/",
    "timestamp": "2025-07-21T17:41:49Z"
  },
  {
    "title": "Guardians Dismiss Trump's Demand to Drop Woke Name, Commanders Silent",
    "description": "The Cleveland Guardians are waving off President Donald Trump's suggestion that they return their name and mascot to the Cleveland Indians.\nThe post Guardians Dismiss Trump’s Demand to Drop Woke Name, Commanders Silent appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/07/21/guardians-dismiss-trumps-demand-drop-woke-name-commanders-silent/",
    "timestamp": "2025-07-21T17:41:17Z"
  },
  {
    "title": "What was JD Vance doing at Rupert Murdoch’s ranch just before WSJ dropped Trump-Epstein bombshell? Rumors swirl",
    "description": "Vice President JD Vance met with Rupert Murdoch in Montana shortly before the Wall Street Journal published a story linking Donald Trump to Jeffrey Epstein. The report triggered Trump’s anger and a $10 billion lawsuit. The trip was unannounced and included ot…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jd-vance-rupert-murdoch-wall-street-journal-trump-epstein-letter-birthday-lawsuit-news-corp-fox-news-lachlan-murdoch-emma-tucker-truth-social-montana-defamation-fake-news/articleshow/122820251.cms",
    "timestamp": "2025-07-21T17:38:23Z"
  },
  {
    "title": "Judge Warns Trump Is Turning Into Henry II With His Dangerous Rants",
    "description": "A federal judge compared Donald Trump to Henry II for his blatant efforts to punish his administration’s critics.While overseeing a lawsuit Monday concerning the Trump administration’s crackdown on non-citizens’ pro-Palestinian speech, U.S. District Judge Wil…",
    "link": "https://newrepublic.com/post/198175/judge-warns-donald-trump-henry-ii-dangerous-rants",
    "timestamp": "2025-07-21T17:38:21Z"
  },
  {
    "title": "President Donald Trump threatens to shut down Commanders' NFL stadium deal unless team reverts to old name",
    "description": "The franchise is in the process of trying to get a $3.7 billion stadium complex built in D.C",
    "link": "https://www.cbssports.com/nfl/news/president-donald-trump-threatens-to-shut-down-commanders-nfl-stadium-deal-unless-team-reverts-to-old-name/",
    "timestamp": "2025-07-21T17:35:28Z"
  },
  {
    "title": "Cat account with 1M followers to protest JD Vance on Nantucket",
    "description": "Local activist groups will hold the “Meowtucket” rally to protest JD Vance's fundraiser visit to the island. Here's what to know.",
    "link": "https://www.boston.com/news/local-news/2025/07/21/jd-vance-nantucket-fundraiser-meowtucket-protest/",
    "timestamp": "2025-07-21T17:35:07Z"
  },
  {
    "title": "Hunter Biden Gives His Take On What Caused His ‘Horrible Debate’ Performance With Trump",
    "description": "Former president Joe Biden’s son gave his own explanation for what caused his father’s “horrible debate” against President Donald Trump in the 2024 election. Hunter Biden spoke with journalist Andrew Callaghan on his YouTube show Channel 5, admitting that “it…",
    "link": "https://www.mediaite.com/media/news/hunter-biden-gives-his-take-on-what-caused-his-horrible-debate-performance-with-trump/",
    "timestamp": "2025-07-21T17:32:49Z"
  },
  {
    "title": "Trump Should Kill Commanders Stadium Deal, but Not Because of the Team's Name",
    "description": "If Trump kills the deal over the team changing its name, he'd be doing the right thing but in perhaps the most corrupt possible way.",
    "link": "https://reason.com/2025/07/21/trump-should-kill-commanders-stadium-deal-but-not-because-of-the-teams-name/",
    "timestamp": "2025-07-21T17:32:09Z"
  },
  {
    "title": "Senate Republicans Sabotage $400 Million of Trump’s Anti-Woke Cuts",
    "description": "For a party with such distrust in the mainstream media, Republicans certainly put a lot of stock in the headlines about PEPFAR. While thousands of people would most certainly not die from the targeted cuts to the President’s Emergency Plan for AIDS Relief, Se…",
    "link": "https://freerepublic.com/focus/f-chat/4329927/posts",
    "timestamp": "2025-07-21T17:31:08Z"
  },
  {
    "title": "ABC's Martha Raddatz admits Trump border policies 'certainly working' in stemming migrant flow",
    "description": "ABC News correspondent Martha Raddatz fact-checked LA Mayor Karen Bass on Trump's immigration policies as border crossings hit record lows under the new administration.",
    "link": "https://www.foxnews.com/media/abcs-martha-raddatz-admits-trump-border-policies-certainly-working-stemming-migrant-flow",
    "timestamp": "2025-07-21T17:30:41Z"
  },
  {
    "title": "Donald Trump Had No Idea ‘Drunk Uncle’ Was Roasting Him on ‘SNL’",
    "description": "By\n Matt Solomon\n Published: July 21st, 2025",
    "link": "https://www.cracked.com/article_47472_donald-trump-had-no-idea-drunk-uncle-was-roasting-him-on-snl.html",
    "timestamp": "2025-07-21T17:30:00Z"
  },
  {
    "title": "Poll Position: Mamdani's the frontrunner, but isn't running away with NYC mayoral race just yet",
    "description": "Polls show Zohran Mamdani narrowly leading Andrew Cuomo in the NYC mayoral race, with incumbent Mayor Eric Adams and Republican Curtis Sliwa trailing in an unusually competitive election.",
    "link": "https://www.foxnews.com/politics/poll-position-mamdanis-front-runner-isnt-running-away-nyc-mayoral-race",
    "timestamp": "2025-07-21T17:29:01Z"
  },
  {
    "title": "UK sanctions 135 oil tankers in Russia's shadow fleet",
    "description": "Britain has imposed sanctions on 135 Russian shadow fleet oil tankers, targeting vessels used to evade restrictions and fund Moscow’s war in Ukraine. The move also includes sanctions on two firms linked to oil transport. The UK aims to curb Russia’s $24 billi…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/uk-sanctions-135-oil-tankers-in-russias-shadow-fleet/articleshow/122820088.cms",
    "timestamp": "2025-07-21T17:27:40Z"
  },
  {
    "title": "Hunter Unhinged:F-bomb Tirade Against Trump Deportations -- ‘Who Do You Think Washes Your Dishes!?’",
    "description": "Hunter Biden, the troubled son of former President Joe Biden, gave a big, fat “f you” to those who are upset about illegal immigration in the country, asking how people expect their hotel rooms to be cleaned. Hunter Biden ranted about those who are upset over…",
    "link": "https://freerepublic.com/focus/f-news/4329926/posts",
    "timestamp": "2025-07-21T17:27:34Z"
  },
  {
    "title": "President Trump Posts Fake Video Depicting Barack Obama’s Arrest Amid Esptein Scandal",
    "description": "President Trump shared an AI-generated video of Barack Obama being arrested along with attacks at President Obama's cabinet.",
    "link": "https://hiphopwired.com/2782331/president-trump-fake-video-barack-obama-arrest/",
    "timestamp": "2025-07-21T17:27:18Z"
  },
  {
    "title": "Border Czar Homan Pledges to ‘Flood the Zone’ of Sanctuary Cities",
    "description": "New York City is going to get more of what its left-wing politicians do not want, border czar Tom Homan says. Homan is pledging to... Read More\nThe post Border Czar Homan Pledges to ‘Flood the Zone’ of Sanctuary Cities appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/21/border-czar-homan-pledges-flood-zone-sanctuary-cities/",
    "timestamp": "2025-07-21T17:26:48Z"
  },
  {
    "title": "The Telling Emptiness of Trump’s Doodles",
    "description": "What’s interesting is how hard Trump’s drawings work to reveal nothing. You can feel him trying. The exception is his reported drawing for Epstein.",
    "link": "http://nymag.com/intelligencer/article/jerry-saltz-reviews-trumps-doodles.html",
    "timestamp": "2025-07-21T17:24:35Z"
  },
  {
    "title": "'Biggest thing that keeps Trump up at night': Dems share major plan to counter GOP",
    "description": "House Democrats are pushing back against President Donald Trump’s directive to eliminate Democratic seats in Texas by launching an aggressive redistricting strategy of their own—hiring top attorneys to help cut down the number of GOP-held seats in five key st…",
    "link": "https://www.rawstory.com/biggest-thing-that-keeps-trump-up-at-night-dems-announce-major-plan-to-counter-gop/",
    "timestamp": "2025-07-21T17:23:52Z"
  },
  {
    "title": "Obama now 'squarely in Russiagate crosshairs,' journalist Matt Taibbi claims",
    "description": "Matt Taibbi reports that Obama is now at the 'center square' of Gabbard's Russiagate investigation following the release of Trump-Russia documents.",
    "link": "https://www.foxnews.com/media/obama-now-squarely-russiagate-crosshairs-journalist-matt-taibbi-claims",
    "timestamp": "2025-07-21T17:23:26Z"
  },
  {
    "title": "James Gunn said he thought his ‘career was over’ when Disney fired him: ‘I didn’t think I was gonna make another dime in this industry’",
    "description": "\"This started out as the worst day of my life, but I actually think it's the best day of my life,\" Gunn recalled thinking on the day he was fired.",
    "link": "https://fortune.com/2025/07/21/james-gunn-disney-fired-rehired-controversy-career-over/",
    "timestamp": "2025-07-21T17:22:48Z"
  },
  {
    "title": "Trump demands end to cashless bail, says 'complete disaster' driving crime in cities, endangering police",
    "description": "President Donald Trump calls for ending cashless bail, linking criminal justice reform to crime in U.S. cities and increased attacks on law enforcement.",
    "link": "https://www.foxnews.com/politics/trump-demands-end-cashless-bail-says-complete-disaster-driving-crime-cities-endangering-police",
    "timestamp": "2025-07-21T17:22:30Z"
  },
  {
    "title": "Judge Affirms 'Americans Have a Right to Know How Taxpayer Money Is Being Spent'",
    "description": "Advocacy groups that sued U.S. President Donald Trump's administration this spring for taking offline a legally mandated website that details federal spending celebrated on Monday after a federal judge ordered the restoration of the Public Apportionments Data…",
    "link": "https://www.commondreams.org/news/russell-vought",
    "timestamp": "2025-07-21T17:22:24Z"
  },
  {
    "title": "Hunter Biden says dad Joe was on Ambien during disastrous 2024 debate with Trump",
    "description": "Hunter ripped into portrayals of his father’s decline as a conspiracy theory, and insisted that the 46th president simply “got old before our eyes.”",
    "link": "https://nypost.com/2025/07/21/us-news/hunter-biden-says-dad-joe-was-on-ambien-during-disastrous-2024-debate-with-trump/",
    "timestamp": "2025-07-21T17:21:32Z"
  },
  {
    "title": "ICE Agents Are Desperate to Quit Under Stephen Miller’s Regime",
    "description": "Federal immigration officials are looking for their own path away from the Trump administration.Veronica Cardenas, a former Immigration and Customs Enforcement prosecutor, told MSNBC Sunday that many ICE agents are “unhappy” and experiencing “very low” morale…",
    "link": "https://newrepublic.com/post/198167/stephen-miller-ice-agents-desperate-quit",
    "timestamp": "2025-07-21T17:20:43Z"
  },
  {
    "title": "U.S. Treasury’s Bessent calls for examination of Federal Reserve as an institution, determine its success",
    "description": "U.S. Treasury Secretary Scott Bessent on Monday said the entire Federal Reserve needed to be examined as an institution and whether it had been successful.\nBessent, speaking with CNBC, declined to comment on a report that he had advised President Donald Trump…",
    "link": "https://biztoc.com/x/170fd891cdec6ad6",
    "timestamp": "2025-07-21T17:19:42Z"
  },
  {
    "title": "What Is The Trisha Paytas Baby Theory, And How Does It Involve Trump?",
    "description": "\"Is it just any influential person that dies get to come reincarnated as my baby?\" Paytas said on their podcast in April.",
    "link": "https://www.newsweek.com/trisha-paytas-baby-theory-reincarnation-donaldt-trump-chronic-venous-insufficiency-2101841",
    "timestamp": "2025-07-21T17:19:40Z"
  },
  {
    "title": "A judge partially struck down Trump's travel ban",
    "description": "In a revival of a travel ban he instituted during his first term in the White House, Donald Trump announced a new version denying citizens of 12 countries from entering the U.S. for any reason at the start of June.\nIran, Somalia, Sudan, Libya, and Yemen were …",
    "link": "https://biztoc.com/x/1d3e8da76c29f64a",
    "timestamp": "2025-07-21T17:19:36Z"
  },
  {
    "title": "Trump's threats to fire Jerome Powell are unsettling the markets",
    "description": "We do not know if President Donald Trump will fire Jerome Powell from his job as chair of the Federal Reserve. We do know the financial markets do not much like the idea.\nTrump's attacks on Powell for not reducing interest rates have \"rattled financial market…",
    "link": "https://biztoc.com/x/51f5b0cb5e2990c0",
    "timestamp": "2025-07-21T17:19:34Z"
  },
  {
    "title": "5 reasons you should care about Texas' Trump-inspired redistricting scheme",
    "description": "Texas Gov. Greg Abbott speaks as then-former President Donald Trump look son during a tour to an unfinished section of the border wall on June 30, 2021 in Pharr, Texas.",
    "link": "https://biztoc.com/x/92cc158ba9957af2",
    "timestamp": "2025-07-21T17:19:19Z"
  },
  {
    "title": "It would be surprising if Trump wins his Epstein lawsuit against Murdoch and the Journal",
    "description": "President Donald Trump filed a defamation lawsuit Friday over a Wall Street Journal article related to Jeffrey Epstein.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/wall-street-journal-trump-epstein-lawsuit-rcna219968",
    "timestamp": "2025-07-21T17:18:28Z"
  },
  {
    "title": "South African president removes minister criticised by key coalition partner",
    "description": "JOHANNESBURG (Reuters) -South African President Cyril Ramaphosa has removed the higher education minister from her position, his office said on Monday, after his party's key coalition partner accused her of misconduct. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/07/22/south-african-president-removes-minister-criticised-by-key-coalition-partner",
    "timestamp": "2025-07-21T17:18:00Z"
  },
  {
    "title": "Nick Offerman Was So Upset About This \"Huge Mistake\" Trump Made That He Stopped By \"The Daily Show\" To Give An Emotional Speech",
    "description": "The Parks and Recreation star hit the president with a brutal reality check.",
    "link": "https://www.buzzfeed.com/benblanchet/daily-show-nick-offerman-trump-national-parks-funding-cuts",
    "timestamp": "2025-07-21T17:17:51Z"
  },
  {
    "title": "Michael Flynn floats 'military trial for Obama' despite presidential immunity",
    "description": "Disgraced former National Security Adviser Michael Flynn suggested former President Barack Obama should face a \"military trial\" after Director of National Intelligence Tulsi Gabbard accused him of a \"treasonous conspiracy\" to undermine Donald Trump's presiden…",
    "link": "https://www.rawstory.com/michael-flynn-obama/",
    "timestamp": "2025-07-21T17:15:52Z"
  },
  {
    "title": "Jeep maker Stellantis says it will lose $2.7 billion due partly to tariffs",
    "description": "Jeep maker Stellantis says it will lose $2.7 billion due partly to tariffsgo.com",
    "link": "https://abcnews.go.com/Business/jeep-maker-stellantis-lose-27-billion-due-partly/story?id=123921743",
    "timestamp": "2025-07-21T17:14:26Z"
  },
  {
    "title": "‘The President’s Being Petty’: Stephen A. Smith Accuses Donald Trump Of Threatening Commanders Just To Distract From Epstein Files",
    "description": "President Donald Trump is once again pushing for the Washington Commanders to change their name back to the Redskins. Only now he is threatening to throw a wrench into the team’s plans to build a new stadium. Trump’s comments must have struck a nerve with Ste…",
    "link": "https://brobible.com/sports/article/stephen-smith-donald-trump-commanders-epstein-files/",
    "timestamp": "2025-07-21T17:14:12Z"
  },
  {
    "title": "UK Chancellor Mulls Selling $7.2B Bitcoin Stash to Plug Gap in National Finances",
    "description": "Trade association CryptoUK urged the government to take a “long-term view” on holding Bitcoin seized from criminals.",
    "link": "https://decrypt.co/331022/uk-chancellor-mulls-selling-7-2b-bitcoin-stash-to-plug-gap-in-national-finances",
    "timestamp": "2025-07-21T17:14:08Z"
  },
  {
    "title": "UK sanctions 135 oil tankers in Russia's shadow fleet",
    "description": "The UK has placed sanctions on 135 oil tankers in Russia's shadow fleet in a bid to disrupt the flow of money helping Moscow fund the war in Ukraine.",
    "link": "https://www.rte.ie/news/business/2025/0721/1524610-uk-russia-sanctions/",
    "timestamp": "2025-07-21T17:13:21Z"
  },
  {
    "title": "Hunter Biden Lets Loose On George Clooney And the Democrats in First Interview Since Election: ‘F*ck Him and Everyone Around Him’",
    "description": "In his first interview since Donald Trump won the 2024 election, Hunter Biden was unsparing in criticisms of those on the left, deriding everyone from David Axelrod to George Clooney.  The son of former president Joe Biden sat down with journalist Andrew Call…",
    "link": "https://www.mediaite.com/media/news/hunter-biden-lets-loose-on-george-clooney-and-the-democrats-in-first-interview-since-election-fck-him-and-everyone-around-him/",
    "timestamp": "2025-07-21T17:12:30Z"
  },
  {
    "title": "Obama Arrest Video Is Trump’s Most Unhinged Epstein Diversion",
    "description": "The Obama arrest video is Trump’s most unhinged Epstein diversion. Here’s a brief guide to how Trump’s deranged Truth Social posts, including an AI video calling for Obama’s arrest, helped him flip the Epstein scandal back on his enemies.",
    "link": "http://nymag.com/intelligencer/article/obama-arrest-ai-video-trump-epstein.html",
    "timestamp": "2025-07-21T17:10:52Z"
  },
  {
    "title": "ROOKE: Gavin Newsom And His California Lackeys Seem To Find Sneaky Way To Hurt Trump’s Economic Comeback",
    "description": "California Democrats appear to have found a way to hinder President Donald Trump's economic recovery plan by increasing the cost of egg prices nationwide.",
    "link": "https://dailycaller.com/2025/07/21/rooke-gavin-newsom-california-proposition-twelve-12-trump-economy-egg-meat-prices-farm/",
    "timestamp": "2025-07-21T17:10:25Z"
  },
  {
    "title": "With Tariffs Now Linked to Inflation, I'm Tracking 11 Key Products for Price Moves",
    "description": "A new report found inflation on the rise in June, another indicator of the affect Donald Trump's tariffs are having on the US economy.",
    "link": "https://www.cnet.com/tech/with-tariffs-now-linked-to-inflation-im-tracking-11-key-products-for-price-moves/",
    "timestamp": "2025-07-21T17:10:00Z"
  },
  {
    "title": "Trump’s media company reports $2B in Bitcoin after crypto bills pass US House",
    "description": "Part of a strategy to acquire cryptocurrency, the company that owns Donald Trump’s Truth Social platform said it held $2 billion in BTC and “Bitcoin-related securities.”",
    "link": "https://cointelegraph.com/news/donald-trump-media-company-bitcoin-crypto-bills",
    "timestamp": "2025-07-21T17:07:55Z"
  },
  {
    "title": "Trump's threats to fire Jerome Powell are unsettling the markets",
    "description": "Expect a 'period of volatility' if he follows through",
    "link": "https://theweek.com/business/economy/trump-threat-fire-jerome-powell-unsettling-markets",
    "timestamp": "2025-07-21T17:07:36Z"
  },
  {
    "title": "Tom Homan Shifts ICE Detention Goalposts, As Fascists Do",
    "description": "Donald Trump's Border Czar Tom Homan cried to the media that a migrant doesn't have to be a criminal to be arrested, detained and deported now because their immigration status decides if they are a criminal. This, despite the fact that being undocumented is n…",
    "link": "https://crooksandliars.com/2025/07/tom-homan-moves-goalposts-over-who-ice",
    "timestamp": "2025-07-21T17:06:31Z"
  },
  {
    "title": "Bitcoin dominance slips as Ethereum explodes after record $4.39 billion inflows week",
    "description": "Digital asset investment products set a new all-time high last week, attracting $4.39 billion in inflows. The surge came as investor appetite for Bitcoin and Ethereum ETFs continued to rise, according to the latest weekly report from CoinShares. This figure s…",
    "link": "https://cryptoslate.com/bitcoin-dominance-slips-as-ethereum-explodes-after-record-4-39-billion-inflows-week/",
    "timestamp": "2025-07-21T17:02:59Z"
  },
  {
    "title": "Bitcoin dominance slips as Ethereum explode in record $4.39 billion inflows week",
    "description": "Digital asset investment products set a new all-time high last week, attracting $4.39 billion in inflows. The surge came as investor appetite for Bitcoin and Ethereum ETFs continued to rise, according to the latest weekly report from CoinShares. This figure s…",
    "link": "https://cryptoslate.com/bitcoin-dominance-slips-as-ethereum-explode-in-record-4-39-billion-inflows-week/",
    "timestamp": "2025-07-21T17:02:59Z"
  },
  {
    "title": "Trump's Approval Rating Has 'Started To Drop More Quickly'—Nate Silver",
    "description": "The pollster said the president's approval rating had declined quickly in July.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-nate-silver-2101616",
    "timestamp": "2025-07-21T17:02:52Z"
  },
  {
    "title": "Philippines’ Marcos to meet Trump seeking trade deal",
    "description": "Leaders expected to hold talks on bilateral trade days before US tariffs on Philippine goods set to take effect.",
    "link": "https://www.aljazeera.com/news/2025/7/21/philippines-marcos-to-meet-trump-seeking-trade-deal",
    "timestamp": "2025-07-21T17:02:16Z"
  },
  {
    "title": "Maria Farmer, Jeffrey Esptein accuser, details chilling encounter with Trump: Who is she?",
    "description": "Maria Farmer, an early accuser of Jeffrey Epstein, linked US President Donald Trump to the sex offender. She reported Trump's connection to the FBI twice. Farmer recalled an incident in 1995 at Epstein’s Manhattan office. She also testified at Ghislaine Maxwe…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-maria-farmer-jeffrey-esptein-accuser-details-chilling-encounter-with-trump-who-is-she/articleshow/122819640.cms",
    "timestamp": "2025-07-21T17:00:38Z"
  },
  {
    "title": "One reason for optimism for every NFL team, plus ranking the best 25 teams since 2000 and more NFLPA fallout",
    "description": "Here's everything you need to know about the NFL for July 21",
    "link": "https://www.cbssports.com/nfl/news/one-reason-for-optimism-for-every-nfl-team-plus-ranking-the-best-25-teams-since-2000-and-more-nflpa-fallout/",
    "timestamp": "2025-07-21T17:00:30Z"
  },
  {
    "title": "‘Flood the zone’: 2nd suspect arrested in attack on Border Patrol agent has something in common with alleged shooter",
    "description": "'There's absolutely zero reason that someone who is scum of the earth like this should be running loose on the streets of New York City'",
    "link": "https://www.wnd.com/2025/07/flood-zone-2nd-suspect-arrested-attack-border-patrol/",
    "timestamp": "2025-07-21T17:00:29Z"
  },
  {
    "title": "GAY BLACK JUDGE TO HEAR TRUMP'S MURDOCH 'LAWSUIT'... DEVELOPING...",
    "description": "The lawsuit is the latest legal action the president has taken against a media outlet.",
    "link": "https://www.thedailybeast.com/obama-judge-gets-trump-lawsuit-over-spicy-epstein-letter/",
    "timestamp": "2025-07-21T17:00:03Z"
  },
  {
    "title": "5 reasons you should care about Texas' Trump-inspired redistricting scheme",
    "description": "Why is this about the Texas Republicans' redistricting gambit a story with importance far beyond the Lone Star State? Several reasons, actually.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/5-reasons-care-texas-trump-inspired-redistricting-scheme-rcna220026",
    "timestamp": "2025-07-21T16:59:55Z"
  },
  {
    "title": "Marjorie Taylor Greene Warns Trump “There’s No Going Back” on Epstein",
    "description": "Representative Marjorie Taylor Greene on Monday urged President Donald Trump to release more Epstein files, lest his base turn against him.The Georgia lawmaker wrote on X that Trump, having entertained a number of conspiracy theories (to which she, of course,…",
    "link": "https://newrepublic.com/post/198170/marjorie-taylor-greene-warns-trump-epstein",
    "timestamp": "2025-07-21T16:59:18Z"
  },
  {
    "title": "This EPA research office safeguarded Americans’ health. Trump just eliminated it.",
    "description": "The Office of Research and Development produced the science underpinning regulations on everything from PFAS to pesticides to lead.",
    "link": "http://grist.org/politics/this-epa-research-office-safeguarded-americans-health-trump-just-eliminated-it/",
    "timestamp": "2025-07-21T16:59:06Z"
  },
  {
    "title": "'Struggling' Trump spirals as 'usual playbook' fails to get him out of jam: report",
    "description": "President Donald Trump's proven method for getting out of a scandal he claims is a \"hoax\" or a \"witch hunt\" is falling flat this time around mostly because of his own doing, according to The New Republic.Writer Matt Ford posited that Trump is \"struggling to a…",
    "link": "https://www.rawstory.com/trump-epstein-2673535382/",
    "timestamp": "2025-07-21T16:56:46Z"
  },
  {
    "title": "UK may be seeking to pull back from Apple encryption row with US",
    "description": "UK government officials say that attempts by the Home Office to require Apple to introduce ‘back doors’ to its secure encrypted storage service will cross US red lines",
    "link": "https://www.computerweekly.com/news/366627928/UK-may-be-seeking-to-pull-back-from-Apple-encryption-row-with-US",
    "timestamp": "2025-07-21T16:56:00Z"
  },
  {
    "title": "'It'll Take All of Us': Indivisible Launches Effort to Train 1 Million+ Organizers to Oppose Trump",
    "description": "Progressive advocacy organization Indivisible is launching an ambitious new campaign aimed at training more than one million organizers to oppose the policies of U.S. President Donald Trump and his administration.Over the next several weeks, Indivisible will …",
    "link": "https://www.commondreams.org/news/indivisible-one-million-rising",
    "timestamp": "2025-07-21T16:53:09Z"
  },
  {
    "title": "Immigrants at Florida ICE Centers Treated “Like Dogs”—or Worse",
    "description": "Immigrants detained as part of Donald Trump’s deportation scheme are being treated like animals, according to a horrifying report published by Human Rights Watch Monday. The report found that detainees had been subjected to “conditions that flagrantly violate…",
    "link": "https://newrepublic.com/post/198162/immigrants-florida-ice-centers-inhumane-conditions",
    "timestamp": "2025-07-21T16:52:53Z"
  },
  {
    "title": "CBS staffers question why Stephen Colbert’s show was canceled, calling it a ‘chilling of free speech’",
    "description": "CBS staff question Colbert cancellation's motives, citing free speech concerns.",
    "link": "https://nypost.com/2025/07/21/media/cbs-staffer-calls-stephen-colbert-cancellation-a-chilling-of-free-speech/",
    "timestamp": "2025-07-21T16:52:33Z"
  },
  {
    "title": "Trump's Wildly Fascistic Posting Spree Isn't Just a Distraction From Epstein (Rolling Stone)",
    "description": "Rolling Stone:\nTrump's Wildly Fascistic Posting Spree Isn't Just a Distraction From Epstein  —  The president spent Sunday night posting content fantasizing about the arrest of Barack Obama and other Democrats  —  President Donald Trump shared an AI-generated…",
    "link": "https://www.memeorandum.com/250721/p65",
    "timestamp": "2025-07-21T16:50:04Z"
  },
  {
    "title": "Trump to Legalized Immigrants: Citizenship Carries the 'Highest Responsibility' to the U.S.",
    "description": "New legal immigrants accept civic responsibilities when they join the American family, President Donald Trump says in a short video for use in naturalization ceremonies.\nThe post Trump to Legalized Immigrants: Citizenship Carries the ‘Highest Responsibility’ …",
    "link": "https://www.breitbart.com/immigration/2025/07/21/trump-to-legalized-immigrants-citizenship-carries-the-highest-responsibility-to-the-u-s/",
    "timestamp": "2025-07-21T16:49:12Z"
  },
  {
    "title": "Brazil's President's Message To The American People Is Definitely Going To ENRAGE Donald Trump",
    "description": "\"We're a joke to the rest of the planet.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/brazil-president-message-to-americans",
    "timestamp": "2025-07-21T16:49:01Z"
  },
  {
    "title": "THE TRASH REPORT: Kiss Cams at the Coldplay Show, and Other Chaotic Choices",
    "description": "Get ready for your weekly dose of trash!\n \n by Elinor Jones\n \n \n \n Hello, and welcome back to the Trash Report! I am Elinor Jones, and I am so glad you are here. I, for one, am living for today's cool weather because I recently got a horrific sunburn and need…",
    "link": "https://www.portlandmercury.com/the-trash-report/2025/07/21/47933826/the-trash-report-kiss-cams-at-the-coldplay-show-and-other-chaotic-choices",
    "timestamp": "2025-07-21T16:49:00Z"
  },
  {
    "title": "Daily Caller White House Correspondent Calls Out Media For Ignoring New Obama Admin Allegations",
    "description": "Reagan Reese argued that the media should be covering new allegations against Barack Obama's administration as much as it has covered Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/07/21/daily-caller-white-house-correspondent-calls-out-media-for-ignoring-new-obama-admin-allegations/",
    "timestamp": "2025-07-21T16:48:33Z"
  },
  {
    "title": "Treasury Secretary Wants to Review ‘Entire Federal Reserve’",
    "description": "America’s treasury secretary says the entire Federal Reserve needs to be examined.\n \n [contact-form-7]\n \n \nInterviewed by CNBC Monday (July 21), Scott Bessent declined to comment on reports that he had advised President Donald Trump not to fire Federal Reserv…",
    "link": "https://biztoc.com/x/e03c8c2652b4f769",
    "timestamp": "2025-07-21T16:45:51Z"
  },
  {
    "title": "Brian Stelter’s Son Crashes CNN Interview Live on Air: ‘I Apologize for My 5-Year-Old’ | Video",
    "description": "\"I tried my best not to break out laughing,\" the news correspondent says\nThe post Brian Stelter’s Son Crashes CNN Interview Live on Air: ‘I Apologize for My 5-Year-Old’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/brian-stelter-son-crashes-cnn-interview-reactions-video/",
    "timestamp": "2025-07-21T16:44:01Z"
  },
  {
    "title": "UK Backing Down on Apple Encryption Backdoor After Pressure From US",
    "description": "Sir Keir Starmer's government is seeking a way out of a clash with the Trump administration over the UK's demand that Apple provide it with access to secure customer data, Financial Times reported Monday, citing two officials. From the report: The officials b…",
    "link": "https://news.slashdot.org/story/25/07/21/1643245/uk-backing-down-on-apple-encryption-backdoor-after-pressure-from-us",
    "timestamp": "2025-07-21T16:44:00Z"
  },
  {
    "title": "Trump Media Buys $2 Billion in Bitcoin, BTC Securities for Treasury",
    "description": "The company,  which owns the Truth Social social media platform and has struggled financially, joins a growing number of companies to create Bitcoin treasuries.",
    "link": "https://decrypt.co/331015/trump-media-2-billion-bitcoin-corporate-treasury",
    "timestamp": "2025-07-21T16:42:12Z"
  },
  {
    "title": "Fed chief Jerome Powell accused of criminally lying under oath: report",
    "description": "MAGA Rep. Anna Paulina Luna (R-FL) has referred Fed Chairman Jerome Powell to the Department of Justice on two criminal counts of lying under oath, according to Fox News Digital.The outlet first reported Luna's accusations after obtaining her letter to the DO…",
    "link": "https://www.rawstory.com/jerome-powell-2673535615/",
    "timestamp": "2025-07-21T16:41:44Z"
  },
  {
    "title": "Trump Ally Accuses Powell of Lying Under Oath, Recommends Criminal Charges",
    "description": "The move comes amid ongoing pressure from President Trump and his allies, who continue to call for Jerome Powell's removal.",
    "link": "https://www.newsweek.com/jerome-powell-criminal-charges-doj-trump-ally-fed-2101884",
    "timestamp": "2025-07-21T16:41:04Z"
  },
  {
    "title": "The great debate: Cane sugar vs. corn syrup",
    "description": "Coca-Cola has not yet said it would use real cane sugar in regular Coke — even if Trump says the company agreed",
    "link": "https://www.the-independent.com/news/health/cane-sugar-corn-syrup-coca-cola-b2793156.html",
    "timestamp": "2025-07-21T16:40:51Z"
  },
  {
    "title": "Obama Argues He Can’t Be Charged With Treason Since He Wasn’t Born In America",
    "description": "WASHINGTON, D.C. — In a blow to hopes from conservatives that the former president would face severe consequences for allegedly overseeing an attempt to deligitimize the Trump presidency, Barack Obama argued that he can't be charged with treason since he wasn…",
    "link": "https://freerepublic.com/focus/f-bloggers/4329917/posts",
    "timestamp": "2025-07-21T16:40:42Z"
  },
  {
    "title": "‘Less than human’: Report details Trump immigration detention centre abuses",
    "description": "Detainees at three Florida detention centres report being denied medical care while subjected to degrading conditions.",
    "link": "https://www.aljazeera.com/news/2025/7/21/less-than-human-report-details-trump-immigration-detention-centre-abuses",
    "timestamp": "2025-07-21T16:39:51Z"
  },
  {
    "title": "George Clooney ‘Forced’ Jack Black to Break Up Tenacious D After Trump Assassination Comment, Journalist Claims",
    "description": "In a long interview with former President Joe Biden’s son Hunter, reporter Andrew Callaghan alleges that George Clooney ordered Jack Black to break up Tenacious D after the duo’s guitarist Kyle Gass asked that Thomas Matthew Crooks, who allegedly attempted to…",
    "link": "https://variety.com/2025/music/news/george-clooney-forced-jack-black-break-up-tenacious-d-1236465988/",
    "timestamp": "2025-07-21T16:38:47Z"
  },
  {
    "title": "Trump-Epstein latest: FBI agents were told to ‘flag’ any files that mentioned the president, Sen. Durbin says, as an Epstein accuser recalls an encounter with both men",
    "description": "Pressure continues to mount on the administration to release more files from the investigation into the late accused sex trafficker.",
    "link": "https://www.yahoo.com/news/trump-epstein-latest-fbi-agents-were-told-to-flag-any-files-that-mentioned-the-president-sen-durbin-says-as-an-epstein-accuser-recalls-an-encounter-with-both-men-163644244.html",
    "timestamp": "2025-07-21T16:36:44Z"
  },
  {
    "title": "A weak housing market could deliver rate cuts and rescue the Fed from Trump",
    "description": "President Donald Trump’s tariffs are expected to heat up prices later this year, but the housing market is looking weak enough that it may cool overall inflation. That would clear the way for the Federal Reserve to lower interest rates, which Trump has been p…",
    "link": "https://biztoc.com/x/3bb6a94e09457c10",
    "timestamp": "2025-07-21T16:34:44Z"
  },
  {
    "title": "Tulsi Gabbard Uses The Twitter Files Playbook To Mislead Gullible MAGA Fools",
    "description": "I’ve been warning people since the beginning of the year to expect the Trump regime to use the Twitter Files playbook on the US government and now we’re seeing exactly that play out. Trump is facing a bunch of pushback over the Jeffrey Epstein nonsense, so he…",
    "link": "https://www.techdirt.com/2025/07/21/tulsi-gabbard-uses-the-twitter-files-playbook-to-mislead-gullible-maga-fools/",
    "timestamp": "2025-07-21T16:32:47Z"
  },
  {
    "title": "Hunter Biden Says Joe Biden Was Taking Ambien While President",
    "description": "Hunter Biden admits Monday that his father, former President Joe Biden, took Ambien before his \"absolutely horrible debate\" with President Donald Trump in 2024.",
    "link": "https://dailycaller.com/2025/07/21/hunter-biden-joe-ambien-president-debate-channel-5-interview-clooney/",
    "timestamp": "2025-07-21T16:32:11Z"
  },
  {
    "title": "Kremlin comments on possible Putin-Trump meeting in Beijing",
    "description": "Talks between the Russian and US leaders could be possible in China in September, Kremlin spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621779-peskov-putin-trump-meeting-china/",
    "timestamp": "2025-07-21T16:32:04Z"
  },
  {
    "title": "Bondi's slapdash release of Epstein docs could free Ghislaine Maxwell: expert",
    "description": "Jeffrey Epstein may have died in 2019, but his partner Ghislaine Maxwell remains in prison for her role in some of his schemes. She was convicted of conspiring to sexually abuse minors in 2021, but has appealed.There is now concern that releasing some of the …",
    "link": "https://www.rawstory.com/pam-bondi-2673535406/",
    "timestamp": "2025-07-21T16:31:59Z"
  },
  {
    "title": "Scott Bessent calls for probe into ‘the entire Federal Reserve institution’",
    "description": "Treasury secretary is latest top Trump administration official to criticise the central bank",
    "link": "https://www.irishtimes.com/business/2025/07/21/scott-bessent-calls-for-probe-into-the-entire-federal-reserve-institution/",
    "timestamp": "2025-07-21T16:31:31Z"
  },
  {
    "title": "The risks and rewards of tokenization as crypto heavyweights push for it",
    "description": "Industry heavyweights are racing for a long-sought goal of turning real-world assets into digital tokens.",
    "link": "https://www.bostonherald.com/2025/07/21/crypto-tokenization/",
    "timestamp": "2025-07-21T16:31:29Z"
  },
  {
    "title": "Trump threatens Commanders stadium over team name, contradicting 2013 stance",
    "description": "Trump has threatened to hold up a new stadium for the Washington Commanders unless they revert back to the Redskins name.",
    "link": "https://www.mlive.com/news/2025/07/sanctimonious-tweet-from-2013-comes-back-to-haunt-trump-over-washington-commanders-name-change.html",
    "timestamp": "2025-07-21T16:31:28Z"
  },
  {
    "title": "A weak housing market could deliver rate cuts and rescue the Fed from Trump",
    "description": "\"Toward the end of the year, the housing market may become a bigger deal for inflation than tariffs,\" Comerica Bank chief economist Bill Adams said.",
    "link": "https://fortune.com/2025/07/21/weak-housing-market-fed-rate-cuts-trump-tariffs-inflation-jerome-powell/",
    "timestamp": "2025-07-21T16:28:37Z"
  },
  {
    "title": "Japan’s Ishiba says he’ll stay in office to tackle rising prices and U.S. tariffs despite election loss",
    "description": "Ishiba's ruling Liberal Democratic Party and its junior coalition partner Komeito were short three seats to maintain a majority in the 248-seat upper house in Sunday's vote.",
    "link": "https://www.pbs.org/newshour/world/japans-ishiba-says-hell-stay-in-office-to-tackle-rising-prices-and-u-s-tariffs-despite-election-loss",
    "timestamp": "2025-07-21T16:28:27Z"
  },
  {
    "title": "Trump Turns on Putin, Ducks Epstein, and Congress Rolls Over",
    "description": "Six months into his second term, Trump's Ukraine pivot is shaky, his Epstein strategy is backfiring, and Republicans are torching congressional norms because they can. The Washington Monthly politics roundtable unpacks the week's unraveling.\nThe post Trump Tu…",
    "link": "http://washingtonmonthly.com/2025/07/21/trump-turns-on-putin-ducks-epstein-and-congress-rolls-over/",
    "timestamp": "2025-07-21T16:27:38Z"
  },
  {
    "title": "Trump’s Bitcoin mentor bet on BTC treasury strategies — and his wealth is exploding",
    "description": "Entrepreneur David Bailey helped turn Donald Trump into a Bitcoin supporter — and now his hedge fund, 210k Capital, is seeing 640% returns. Here’s how BTC treasury strategies are reshaping corporate investing.",
    "link": "https://cointelegraph.com/news/david-bailey-trump-bitcoin-210k-capital-crypto-returns",
    "timestamp": "2025-07-21T16:27:23Z"
  },
  {
    "title": "Taylor Swift was nominated by Pope Leo XIV for Nobel Peace Prize?",
    "description": "Pope Leo XIV nominated pop superstar Taylor Swift for the Nobel Peace Prize for 2025.",
    "link": "https://www.snopes.com//fact-check/taylor-swift-pope-leo-nobel-prize/",
    "timestamp": "2025-07-21T16:25:00Z"
  }
]