[
  {
    "title": "Fox News AI Newsletter: Warning on electricity prices",
    "description": "Stay up to date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.",
    "link": "https://www.foxnews.com/tech/ai-newsletter-warning-electricity-prices",
    "timestamp": "2025-07-19T12:30:47Z"
  },
  {
    "title": "Nooz, etc.",
    "description": "A few news items have come to my attention: *I have finally got a tenuous handle on the Jeffrey Epstein case. Tell me if I’m wrong, but there is no evidence that the government has a list of Epstein’s clients, nor any evidence that he died other than by suici…",
    "link": "https://whyevolutionistrue.com/2025/07/19/nooz-etc/",
    "timestamp": "2025-07-19T12:30:25Z"
  },
  {
    "title": "Trump's pace of early travel largely mirrors Biden's, but with more sports events and golf",
    "description": "Moving at the “speed of Trump” is one of the White House’s favorite phrases, but when it comes to presidential travel, Donald Trump’s pace is about the same as that of his Democratic predecessor, Joe Biden",
    "link": "https://abcnews.go.com/US/wireStory/trumps-pace-early-travel-largely-mirrors-bidens-sports-123887344",
    "timestamp": "2025-07-19T12:30:16Z"
  },
  {
    "title": "Trump Signs GENIUS Act, Establishing First U.S. Crypto Law, Strengthening Dollar",
    "description": "The GENIUS Act introduces the first federal stablecoin regulation in the U.S., linking digital assets to Treasury reserves and reinforcing dollar dominance.",
    "link": "https://www.forbes.com/sites/beccabratcher/2025/07/19/trump-signs-genius-act-establishing-first-us-crypto-law-strengthening-dollar/",
    "timestamp": "2025-07-19T12:29:14Z"
  },
  {
    "title": "빅테크 실적 발표 앞둔 트럼프의 관세에 무역전쟁 터지나",
    "description": "Canada has long resisted changing its trade practices on lumber. But as the Trump administration has become more bellicose about its trade relationship with Canada, the country’s stance may be softening. Here's what to know https://t.co/lNvmGxf82T— Bloomberg …",
    "link": "https://ryueyes11.tistory.com/511734",
    "timestamp": "2025-07-19T12:20:27Z"
  },
  {
    "title": "The Hashtag That Shows Trump Is Losing Control of MAGA",
    "description": "A viral online rebellion is shaking the foundation of Trump’s MAGA movement, as furious supporters demand he release the Epstein Files, and accuse him of protecting the very elite he once vowed to expose.",
    "link": "https://gizmodo.com/the-hashtag-that-shows-trump-is-losing-control-of-maga-2000631671",
    "timestamp": "2025-07-19T12:15:23Z"
  },
  {
    "title": "Trump DOJ order on Jeffrey Epstein could create legal and ethical challenges - NBC News",
    "description": "Trump DOJ order on Jeffrey Epstein could create legal and ethical challengesNBC News Trump Administration Requests Release of Epstein Grand Jury Records. What’s Next?The New York Times Trump meets toughest opponent: his Epstein-fixated baseAxios July 18, 2025…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178417252",
    "timestamp": "2025-07-19T12:14:52Z"
  },
  {
    "title": "Ukrainians have lost faith in Zelensky",
    "description": "Donald Trump this week boosted Ukraine’s air defences with new Patriot batteries, threatened Vladimir Putin with sanctions if he does not agree to a ceasefire, and even reportedly gave tacit approval to more Ukrainian strikes on Moscow. Trump’s newfound suppo…",
    "link": "https://freerepublic.com/focus/f-news/4329542/posts",
    "timestamp": "2025-07-19T12:13:22Z"
  },
  {
    "title": "It’s well past time to start talking about Trump’s decline",
    "description": "President Donald Trump attends the inaugural Pennsylvania Energy and Innovation Summit on the campus of Carnegie Mellon University in Pittsburgh, Pa., on July 15, 2025.",
    "link": "https://biztoc.com/x/9d1d78d804725d5d",
    "timestamp": "2025-07-19T12:11:46Z"
  },
  {
    "title": "Who is in charge? The prime minister's authority is in question again",
    "description": "It's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.",
    "link": "https://www.bbc.com/news/articles/czxwe3g4wl5o",
    "timestamp": "2025-07-19T12:09:50Z"
  },
  {
    "title": "The Epstein Enigma",
    "description": "“It would make [Epstein] a story with which we have to be persistent and steady in our demands; but also cautious, and methodical, and discerning.” —Naomi Wolf. Do you detect the signs of Rope-a-Dope in Mr. Trump’s recent blasts against the Epstein mess? It m…",
    "link": "https://freerepublic.com/focus/f-chat/4329540/posts",
    "timestamp": "2025-07-19T12:08:49Z"
  },
  {
    "title": "Trump’s Brand of Law Enforcement: Deportation Yes, Worker Protection No",
    "description": "U.S. President Donald Trump claims to be all about law enforcement. But what laws he chooses to prioritize, and which get the back seat, or are ignored entirely, speak volumes about the heart and soul of this administration. Recent developments in immigration…",
    "link": "https://www.commondreams.org/opinion/trump-immigrants-labor-enforcement",
    "timestamp": "2025-07-19T12:04:02Z"
  },
  {
    "title": "WV hospitals brace for negative impacts from GOP mega-law",
    "description": "The West Virginia Hospital Association and independent analysts predict costly consequences from sweeping Medicaid cuts built into the Republican budget reconciliation law, the One Big Beautiful Bill Act. Hospital advocates hope to undo the law's most concern…",
    "link": "https://www.wvgazettemail.com/news/health/already-struggling-wv-hospitals-brace-for-costly-budget-reconciliation-law-impacts/article_8b6a8b2a-af95-4be7-a44f-ecdcb38795fd.html",
    "timestamp": "2025-07-19T12:01:31Z"
  },
  {
    "title": "Why Donald Trump’s Jeffrey Epstein Cover-Up Matters",
    "description": "The conspiracism that propels MAGA has turned on its host.",
    "link": "https://www.huffpost.com/entry/donald-trump-jeffrey-epstein_n_687a9dbce4b00f995df560f0",
    "timestamp": "2025-07-19T12:01:17Z"
  },
  {
    "title": "She left her federal job because of Trump. Now she’s running for office to fight his policies | CNN Politics",
    "description": "Becoming a federal prosecutor was a longtime professional dream for Erika Evans, one she achieved nearly four years ago.",
    "link": "https://www.cnn.com/2025/07/19/politics/democrats-federal-employees-midterms",
    "timestamp": "2025-07-19T12:01:01Z"
  },
  {
    "title": "BROADCAST BIAS: Networks snooze as top Biden aides take the Fifth on Biden-decline scandal",
    "description": "Media coverage disparities show networks devoted airtime to Trump issues while ignoring investigations into who made decisions during Biden's presidency",
    "link": "https://www.foxnews.com/opinion/broadcast-bias-networks-snooze-top-biden-aides-take-fifth-biden-decline-scandal",
    "timestamp": "2025-07-19T12:00:18Z"
  },
  {
    "title": "After stock market’s torrid run, earnings misses face punishment",
    "description": "(Bloomberg) -- The second-quarter earnings season is off to a ripping start, with consumer strength powering resilient corporate profits. In the stock market...",
    "link": "https://finance.yahoo.com/news/stock-market-torrid-run-earnings-120007117.html",
    "timestamp": "2025-07-19T12:00:07Z"
  },
  {
    "title": "Trump just took out a pillar of U.S. democracy",
    "description": "U.S. Congress’ decision early Friday morning to completely defund the Corporation for Public Broadcasting (CPB) is a blow to anyone who cares about the role the media must play to sustain the health of a democracy. The move follows a request by President Dona…",
    "link": "https://www.rawstory.com/cpb/",
    "timestamp": "2025-07-19T12:00:02Z"
  },
  {
    "title": "What's The Hell REALLY Going On With Trump's Health?",
    "description": "Donald Trump has some serious shit going on with his...um, body, which is a thought that repulses me, but we stil must discuss it, as it looks...well, not very not healthy. \nWe'll let the video do most of the talking here, but let's put it this way--you know …",
    "link": "https://crooksandliars.com/2025/07/whats-hell-really-going-trumps-health",
    "timestamp": "2025-07-19T12:00:01Z"
  },
  {
    "title": "‘Crypto Week’ ushers in big change: What happens now?",
    "description": "The US crypto industry is celebrating as Congress passed three major bills in its “Crypto Week” legislative bonanza.",
    "link": "https://cointelegraph.com/news/crypto-week-what-happens-now",
    "timestamp": "2025-07-19T12:00:00Z"
  },
  {
    "title": "Making America Great Means Making Buildings Beautiful",
    "description": "On Jan. 20, President Donald Trump signed an executive order to “Make Federal Buildings Beautiful Again,” calling for a return to neoclassical architecture in federal... Read More\nThe post Making America Great Means Making Buildings Beautiful appeared first o…",
    "link": "https://www.dailysignal.com/2025/07/19/making-america-great-means-making-buildings-beautiful/",
    "timestamp": "2025-07-19T12:00:00Z"
  },
  {
    "title": "Biden's feud with the New York Times, his controversial autopen interview, and why it matters",
    "description": "The New York Times famously sparred with the Biden White House over the refusal to grant interviews with its journalists during his presidency, but former President Joe Biden finally ran to the paper this month as President Donald Trump and GOP lawmakers put …",
    "link": "https://freerepublic.com/focus/f-chat/4329539/posts",
    "timestamp": "2025-07-19T11:48:33Z"
  },
  {
    "title": "Trump said he 'never wrote a picture in my life.' Here are four. (Jonathan Edwards/Washington Post)",
    "description": "Jonathan Edwards / Washington Post:\nTrump said he ‘never wrote a picture in my life.’ Here are four.  —  The president's blanket denial of a Wall Street Journal report could further inflame the Epstein case.  —  Summary1965  —  President Donald Trump denied e…",
    "link": "https://www.memeorandum.com/250719/p12",
    "timestamp": "2025-07-19T11:45:00Z"
  },
  {
    "title": "From 'Untamed' to 'The Summer I Turned Pretty': List of movies, TV series you can watch on Netflix, HBO Max, Hulu and more",
    "description": "The weekend brings a fresh wave of entertainment. Superman dominates the box office. Netflix, Amazon Prime Video, and others offer new series and movies. 'The Actor' streams on Hulu. 'The Summer I Turned Pretty' returns on Amazon. 'Foundation Season 3' is on …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-from-untamed-to-the-summer-i-turned-pretty-list-of-movies-tv-series-you-can-watch-on-netflix-hbo-max-hulu-and-more/articleshow/122782467.cms",
    "timestamp": "2025-07-19T11:40:20Z"
  },
  {
    "title": "Trump DOJ order on Jeffrey Epstein could create legal and ethical challenges (NBC News)",
    "description": "NBC News:\nTrump DOJ order on Jeffrey Epstein could create legal and ethical challenges  —  The Justice Department said unsealing grand jury transcripts related to Epstein's case is necessary given “longstanding and legitimate” public interest in the case.  — …",
    "link": "https://www.memeorandum.com/250719/p11",
    "timestamp": "2025-07-19T11:40:00Z"
  },
  {
    "title": "'Big problem' hovers over Trump's WSJ lawsuit filled with grave errors: attorney",
    "description": "President Donald Trump's legal team made several grave errors in their new $10 billion lawsuit against the Wall Street Journal, NewsCorp and Rupert Murdoch, according to an attorney who specializes in First Amendment law.In a thread posted to his X account Fr…",
    "link": "https://www.rawstory.com/trump-lawsuit-2673383772/",
    "timestamp": "2025-07-19T11:39:33Z"
  },
  {
    "title": "US: Trump signs law paving way for dollar-based stablecoins",
    "description": "US President Donald Trump signed a law to create a regulatory framework for stablecoins. This could create a way for the US-dollar-based cryptocurrencies to come into regular use for making payments and moving money.\nThe bill, also known as the GENIUS Act (Gu…",
    "link": "https://biztoc.com/x/b94f24cc2ece716e",
    "timestamp": "2025-07-19T11:38:00Z"
  },
  {
    "title": "Top economist drops 6-word verdict on Trump tariffs, inflation",
    "description": "Inflation is ticking higher, and President Donald Trump's tariffs are back in the spotlight.\nRecent data points to a marked shift in key consumer categories, with some prices rising quicker than forecasted. \nDon't miss the move: Subscribe to TheStreet's f…",
    "link": "https://biztoc.com/x/8195d2a7cd54394f",
    "timestamp": "2025-07-19T11:37:25Z"
  },
  {
    "title": "‘Stronger, Bigger, Better’—Trump Issues Huge Prediction For $4 Trillion Crypto Amid Bitcoin, Ethereum And XRP Price Boom",
    "description": "U.S. president Donald Trump has predicted a “golden age” will make crypto and the U.S. dollar “stronger and bigger and better than ever before”...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/19/stronger-bigger-better-trump-issues-huge-prediction-for-4-trillion-crypto-amid-bitcoin-ethereum-and-xrp-price-boom/",
    "timestamp": "2025-07-19T11:32:17Z"
  },
  {
    "title": "Nursing homes struggle with Trump's immigration crackdown",
    "description": "Nursing homes around the U.S. say they're feeling the effects of President Donald Trump's immigration crackdown.",
    "link": "https://richmond.com/news/nation-world/article_9de042dd-f167-576d-89fb-93ecbbe4bd99.html",
    "timestamp": "2025-07-19T11:30:00Z"
  },
  {
    "title": "'The Ultimate Friday Night Purge': Public Health Experts Appalled by Trump EPA's Gutting of Research Arm",
    "description": "The U.S. Environmental Protection Agency's decision Friday to eliminate its scientific research arm drew horrified responses from public health experts and climate advocates, who warned that the Trump administration is targeting the foundation of the departme…",
    "link": "https://www.commondreams.org/news/epa-scientific-research-office",
    "timestamp": "2025-07-19T11:23:37Z"
  },
  {
    "title": "Bands pull out of Denver's Punk in the Park festival over political donations",
    "description": "Bands pull out of Denver's Punk in the Park festival over political donations Denver7 is getting to the bottom of alleged political donations by the festival organizer that caused backlash among performers Two bands have withdrawn from the Punk in the Park fe…",
    "link": "https://freerepublic.com/focus/f-chat/4329533/posts",
    "timestamp": "2025-07-19T11:19:48Z"
  },
  {
    "title": "Trump’s ‘One Big Beautiful Bill’ Means Bigger Electric Bills for Millions",
    "description": "Millions of Americans across the country will receive higher electric bills because of President Donald Trump’s self-proclaimed “One Big Beautiful Bill,” which was signed into law on July 4. The culprit here is that the OBBB eliminated tax credits for solar a…",
    "link": "https://www.commondreams.org/opinion/budget-bill-higher-electric-bills",
    "timestamp": "2025-07-19T11:18:02Z"
  },
  {
    "title": "Congo and M23 militants sign ceasefire deal in Qatar",
    "description": "Congo and Rwanda-backed M23 rebels have signed a preliminary ceasefire aimed at facilitating a peace agreement to be signed in August. The African Union called the signing a \"significant development.\"",
    "link": "https://www.dw.com/en/congo-and-m23-militants-sign-ceasefire-deal-in-qatar/a-73335437",
    "timestamp": "2025-07-19T11:16:00Z"
  },
  {
    "title": "Ukraine Gets Major Abrams Tank Boost",
    "description": "Australia has sent the first batch of decommissioned tanks as part of its support for Ukraine's fight against Russia.",
    "link": "https://www.newsweek.com/ukraine-gets-major-abrams-tank-boost-australia-2101127",
    "timestamp": "2025-07-19T11:15:01Z"
  },
  {
    "title": "'EMBARRASSINGLY WASTEFUL': Trump's National Guard stunt in L.A. shown to be pointless and expensive",
    "description": "The California National Guard troops that Donald Trump sent to intimidate the residents of L.A. are mostly doing nothing except ...",
    "link": "https://biztoc.com/x/30832cd4678f0339",
    "timestamp": "2025-07-19T11:06:36Z"
  },
  {
    "title": "Emerald AI Has a New Approach to Meeting AI's Energy Demand",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump and members of his cabinet highlighted the surging demand for energy that will be needed to power the growth in artificial intelligence (AI) at an event this week in Pennsylvania.\nPennsy…",
    "link": "https://biztoc.com/x/308817b84f42f614",
    "timestamp": "2025-07-19T11:04:14Z"
  },
  {
    "title": "Congo, M23 rebel group sign declaration of principles to end fighting",
    "description": "The signing comes after months of Qatari mediation.",
    "link": "https://www.abc.net.au/news/2025-07-19/congo-m23-sign-declaration-of-principles-to-end-fighting/105550840",
    "timestamp": "2025-07-19T11:01:27Z"
  },
  {
    "title": "Emerald AI Has a New Approach to Meeting AI's Energy Demand",
    "description": "The company's platform shifts energy demand for AI, potentially reducing the strain on regional power suppliers and turning data centers into \"grid allies.\"",
    "link": "https://www.newsweek.com/emerald-ai-has-new-approach-meeting-ais-energy-demand-2101058",
    "timestamp": "2025-07-19T11:01:01Z"
  },
  {
    "title": "Powell is costing the US by not lowering rates, says Trump. Here’s what he may mean",
    "description": "As part of his campaign to get rid of Jerome Powell, President Donald Trump has blamed the Federal Reserve chair for costing the country “hundreds of billions of dollars” by not slashing interest rates.",
    "link": "https://www.cnn.com/2025/07/19/business/powell-trump-interest-rates-fed",
    "timestamp": "2025-07-19T11:00:42Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "The Trump administration requested a court to unseal documents related to Jeffrey Epstein's case. This move came amidst pressure from supporters and questions about transparency. The Justice Department had previously declined to release further evidence. A le…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-seeks-release-of-epstein-grand-jury-records-but-not-justice-department-files/articleshow/122782064.cms",
    "timestamp": "2025-07-19T11:00:42Z"
  },
  {
    "title": "Trump diagnosed with chronic venous insufficiency after swelling in hands, legs. What is CVI and is it life-threatening?",
    "description": "The White House announced on Thursday that President Donald Trump has been diagnosed with chronic venous insufficiency (CVI). The announcement followed growing public speculation over visible swelling in the president's legs and bruises on his hands. The 79-y…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-diagnosed-with-chronic-venous-insufficiency-after-swelling-in-hands-legs-what-is-cvi-and-is-it-life-threatening/articleshow/122781958.cms",
    "timestamp": "2025-07-19T10:56:31Z"
  },
  {
    "title": "Millions of New Yorkers Warned Over Health Insurance",
    "description": "Governor Kathy Hochul warned that millions of New Yorkers could lose health insurance under the president's One Big Beautiful Bill.",
    "link": "https://www.newsweek.com/new-york-health-insurance-medicaid-obbba-2101129",
    "timestamp": "2025-07-19T10:43:32Z"
  },
  {
    "title": "Donald Trump’s lawsuit against Rupert Murdoch ruptures bond that has shaped the US right - Financial Times",
    "description": "Donald Trump’s lawsuit against Rupert Murdoch ruptures bond that has shaped the US rightFinancial Times Trump said he never ‘wrote a picture.’ This woman solicited two drawings from himCNN Exclusive | Jeffrey Epstein’s Friends Sent Him Bawdy Letters for a 50t…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178416884",
    "timestamp": "2025-07-19T10:34:52Z"
  },
  {
    "title": "Anwar needs to remain PM for the sake of the country's stability, says Rafizi",
    "description": "KUALA LUMPUR: Datuk Seri Anwar Ibrahim must stay as Prime Minister until the end of the term to ensure a stable government amid economic challenges, says Datuk Seri Rafizi Ramli. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/07/19/anwar-needs-to-remain-pm-for-the-sake-of-the-country039s-stability-says-rafizi",
    "timestamp": "2025-07-19T10:34:00Z"
  },
  {
    "title": "Pressure grows to unmask ICE",
    "description": "Democrats in California, New York and other states are trying to prevent ICE agents from concealing their identity",
    "link": "https://www.salon.com/2025/07/19/it-comes-across-as-kidnapping-pressure-grows-to-unmask-ice/",
    "timestamp": "2025-07-19T10:30:33Z"
  },
  {
    "title": "Virginia's unemployment rate rises for sixth straight month",
    "description": "Virginia's unemployment rate rose in June for the six consecutive month, as the state continues to feel the effects of cuts in federal employment and government contracts under President Donald Trump.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_b8053dee-03b4-4338-964f-cc94cabfef13.html",
    "timestamp": "2025-07-19T10:30:00Z"
  },
  {
    "title": "China’s Salt Typhoon Hackers Breached the US National Guard for Nearly a Year",
    "description": "Plus: Secret IRS data-sharing with ICE, a 20-year-old hackable vulnerability in train brakes, and more.",
    "link": "https://www.wired.com/story/chinas-salt-typhoon-hackers-breached-the-us-national-guard-for-nearly-a-year/",
    "timestamp": "2025-07-19T10:30:00Z"
  },
  {
    "title": "Tariffs trickling to US consumers",
    "description": "While strong exports help boost the figure, they also masked a worsening decline in prices that threatens to drag the world’s second-largest economy into a prolonged slowdown",
    "link": "https://www.bloomberg.com/news/articles/2025-07-19/world-economy-latest-tariffs-are-trickling-more-to-us-consumers",
    "timestamp": "2025-07-19T10:24:35Z"
  },
  {
    "title": "What have Trump's tariffs achieved so far? Experts weigh in.",
    "description": "The policy remains in flux months after \"Liberation Day.\"",
    "link": "https://abcnews.go.com/Business/trumps-tariffs-achieved-experts-weigh/story?id=123859218",
    "timestamp": "2025-07-19T10:17:56Z"
  },
  {
    "title": "Trump Sues Wall Street Journal for Article on Note to Epstein - The New York Times",
    "description": "Trump Sues Wall Street Journal for Article on Note to EpsteinThe New York Times Trump said he never ‘wrote a picture.’ This woman solicited two drawings from himCNN Donald Trump’s lawsuit against Rupert Murdoch ruptures bond that has shaped the US rightFinanc…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178416808",
    "timestamp": "2025-07-19T10:15:08Z"
  },
  {
    "title": "Supersonic flight is on its way back. I went on board the first Concorde, where it all began.",
    "description": "I went on board the first Concorde prototype, and one of the last built, at a Paris museum. Boom's Overture means supersonic flight could soon return.",
    "link": "https://www.businessinsider.com/on-board-first-concorde-supersonic-airliner-returning-boom-overture-2025-7",
    "timestamp": "2025-07-19T10:13:01Z"
  },
  {
    "title": "Trump signs stablecoin law as crypto industry aims for mainstream adoption",
    "description": "President Donald Trump signed the GENIUS Act Friday, creating a regulatory framework for stablecoins.\n- The law requires stablecoins to be backed by liquid assets, such as dollars, and issuers to disclose publicly their reserves monthly.\n- Democrats and criti…",
    "link": "https://biztoc.com/x/2e673c3bb48c648a",
    "timestamp": "2025-07-19T10:07:56Z"
  },
  {
    "title": "Tariffs are likely here to stay. What now, for Canada?",
    "description": "When Donald Trump took office earlier this year, trading partners were unsure how serious he was about pursuing the tariffs he campaigned on, and many wondered whether the levies would be primarily used as a negotiation tactic. \nBut six months later, it’s inc…",
    "link": "https://biztoc.com/x/16a227f9bc41c28b",
    "timestamp": "2025-07-19T10:07:54Z"
  },
  {
    "title": "Donald Trump's New 'Masterpiece' Golf Course Set To Open to the Public",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nU.S. President Donald Trump's company is set to open a new golf course in Scotland, in addition to the two he already has there.\nTrump International Scotland announced that the new course, which will be built …",
    "link": "https://biztoc.com/x/273e9b426362fc8e",
    "timestamp": "2025-07-19T10:07:29Z"
  },
  {
    "title": "Trump issues new threat to BRICS",
    "description": "Russia has said the group is not a rival to the US, but won’t let it be pressured Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621685-trump-threat-brics/",
    "timestamp": "2025-07-19T10:04:40Z"
  },
  {
    "title": "Did Trump just earn $93M from his memecoin’s token unlock?",
    "description": "No sell-off. No pump. Just $93 million more on the books for the President’s circle.",
    "link": "https://ambcrypto.com/did-trump-just-earn-93m-from-his-memecoins-token-unlock/",
    "timestamp": "2025-07-19T10:00:47Z"
  },
  {
    "title": "Biden's feud with the New York Times, his controversial autopen interview, and why it matters",
    "description": "The New York Times sparred with the Biden White House over the refusal to grant interviews during his presidency, but he finally ran to the paper last week.",
    "link": "https://www.foxnews.com/media/bidens-feud-new-york-times-his-controversial-autopen-interview-why-matters",
    "timestamp": "2025-07-19T10:00:37Z"
  },
  {
    "title": "How the “big, beautiful bill” will deepen the racial wealth gap",
    "description": "A law scholar explains how it reduces poor families’ ability to afford food and health care.",
    "link": "https://www.salon.com/2025/07/19/how-the-big-beautiful-bill-will-deepen-the-racial-wealth-gap/",
    "timestamp": "2025-07-19T10:00:15Z"
  },
  {
    "title": "CBS is treating Stephen Colbert’s smart fans like fools by citing a ‘financial decision’",
    "description": "Starting when I was about 10 years old, my summer bedtime didn’t exist. I stayed up late not to sneak around or watch horror movies but for one sacred reason: The Tonight Show Starring Johnny Carson. Carson was my hero. When, for years, I was asked what I wan…",
    "link": "https://www.advocate.com/voices/cbs-stephen-colbert-cancellation",
    "timestamp": "2025-07-19T10:00:02Z"
  },
  {
    "title": "Donald Trump's New 'Masterpiece' Golf Course Set To Open to the Public",
    "description": "President Donald Trump is expected to visit the course this month on Air Force One.",
    "link": "https://www.newsweek.com/donald-trump-golf-course-scotland-2097905",
    "timestamp": "2025-07-19T10:00:01Z"
  },
  {
    "title": "How Rembrandt Saw Esther",
    "description": "What the queen means to Jewish tradition and to resisting tyranny and persecution—in the seventeenth century and today.",
    "link": "https://www.newyorker.com/culture/critics-notebook/how-rembrandt-saw-esther",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "Another Doctor Is Dead in Gaza",
    "description": "Clayton Dalton on the Palestinian physician Marwan Sultan, who was killed by Israeli missile, and the growing number of health-care workers dying in the Strip.",
    "link": "https://www.newyorker.com/news/the-lede/another-doctor-is-dead-in-gaza",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "The cancellation of Stephen Colbert’s ‘Late Show’ is a warning for comedy’s future",
    "description": "Stephen Colbert announced that CBS has canceled “The Late Show with Stephen Colbert.”",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/stephen-colbert-late-show-cancelled-trump-rcna219591",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "It’s well past time to start talking about Trump’s decline",
    "description": "Earlier this week, President Donald Trump told a story that, even for the least honest president in American history, was notable.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-unabomber-story-biden-cognitive-decline-rcna219453",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "The Epstein Files Are Going to Haunt Trump’s Presidency",
    "description": "Donald Trump’s second term has been, more or less from the moment he placed his hand on the Bible on January 20, an endless succession of horrors. Law-abiding residents are being disappeared to foreign countries by Trump’s army of masked-up goons. He just sig…",
    "link": "https://newrepublic.com/article/198136/epstein-files-scandal-haunt-trump-russiagate",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "The biggest political fights over Trump's megabill are converging in Nevada",
    "description": "When it comes to President Donald Trump’s “big, beautiful bill,” few places could be impacted more significantly than Nevada — one of the country’s most closely divided swing states",
    "link": "https://www.nbcnews.com/politics/politics-news/biggest-political-fights-trumps-megabill-are-converging-nevada-rcna219368",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "Behind Trump’s Jeffrey Epstein Problem",
    "description": "The President has tried to blame the Democrats, and, more unexpectedly, he has called those in his base who have asked for a fuller accounting “weaklings” and “stupid.”",
    "link": "https://www.newyorker.com/magazine/2025/07/28/behind-trumps-jeffrey-epstein-problem",
    "timestamp": "2025-07-19T10:00:00Z"
  },
  {
    "title": "Americans are hungry for a third party — but not one created by Elon Musk",
    "description": "Several polls this week found that while many voters would consider joining a third party, far fewer are interested in one created by Elon Musk.",
    "link": "https://www.businessinsider.com/elon-musk-america-party-polling-quinnipiac-2025-7",
    "timestamp": "2025-07-19T09:51:01Z"
  },
  {
    "title": "Who is responsible for PFAS contamination?",
    "description": "Hazardous \"forever chemicals\" contaminate drinking water, soil and food worldwide. Who is responsible for their contamination?",
    "link": "https://www.dw.com/en/who-is-responsible-for-pfas-contamination/a-73215481",
    "timestamp": "2025-07-19T09:51:00Z"
  },
  {
    "title": "Donald Trump Suffers Triple Legal Setback Within Hours",
    "description": "On Friday, the president saw three legal defeats as the courts continue to be one of the main impediments to his policy agenda.",
    "link": "https://biztoc.com/x/c9ea1b1226570ffe",
    "timestamp": "2025-07-19T09:45:23Z"
  },
  {
    "title": "Trump DOJ order on Jeffrey Epstein could create legal and ethical challenges",
    "description": "President Donald Trump has directed Attorney General Pam Bondi to \"produce any and all pertinent Grand Jury testimony\" in the Jeffrey Epstein case — but it's unclear what's in that material, or whether a judge will even allow it to be released",
    "link": "https://biztoc.com/x/c73332fd7a19317e",
    "timestamp": "2025-07-19T09:45:12Z"
  },
  {
    "title": "Donald Trump Suffers Triple Legal Setback Within Hours",
    "description": "On Friday, the president saw three legal defeats as the courts continue to be one of the main impediments to his policy agenda.",
    "link": "https://www.newsweek.com/donald-trump-suffers-triple-legal-setback-within-hours-2101120",
    "timestamp": "2025-07-19T09:43:25Z"
  },
  {
    "title": "Heritage Foundation founder Edwin J. Feulner dead at 83",
    "description": "Edwin J. Feulner's cause of death was not released.",
    "link": "https://nypost.com/2025/07/19/us-news/heritage-foundation-founder-edwin-j-feulner-dead-at-83/",
    "timestamp": "2025-07-19T09:34:04Z"
  },
  {
    "title": "Trump toughens stance in EU trade talks – FT",
    "description": "US president Trump is trying to test the “pain threshold” of the EU, the Financial Times reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621683-trump-us-eu-tariff/",
    "timestamp": "2025-07-19T09:32:50Z"
  },
  {
    "title": "Judge Dismissed Trump’s Lawsuit Against Bob Woodward",
    "description": "“A federal judge on Friday dismissed a lawsuit brought by President Donald Trump that attempted to sue Washington Post journalist Bob Woodward for publishing interviews during his first administration in an October 2022 audiobook called",
    "link": "https://politicalwire.com/2025/07/19/judge-dismissed-trumps-lawsuit-against-bob-woodward/",
    "timestamp": "2025-07-19T09:32:00Z"
  },
  {
    "title": "RIC reboot: Can Trump threats revive Russia-India-China troika?",
    "description": "Russia is pushing to revive the Russia-India-China (RIC) trilateral mechanism amid Western pressure, particularly on energy trade. While China quickly endorsed the idea, India is cautiously open. The RIC aims to counterbalance Western dominance and promote mu…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/ric-reboot-can-trump-threats-revive-russia-india-china-troika/articleshow/122780672.cms",
    "timestamp": "2025-07-19T09:31:03Z"
  },
  {
    "title": "This Supreme Court ruling may be the worst yet",
    "description": "When the Executive publicly announces its intent to break the law, and then executes on that promise, it is the Judiciary’s duty to check that lawlessness, not expedite it.— Dissent, Justice Sonia Sotomayor, joined by Justices Elena Kagan and Ketanji Brown Ja…",
    "link": "https://www.rawstory.com/raw-investigates/supreme-court-trump-2673363186/",
    "timestamp": "2025-07-19T09:30:02Z"
  },
  {
    "title": "SY Hersh Reveals Zelenskyy's Imminent Replacement by Ukrainian General",
    "description": "WASHINGTON (Sputnik) – US journalist and Pulitzer Prize winner Seymour Hersh asserts in a new article that Ukrainian Ambassador to the UK and former top general Valerii Zaluzhny could potentially replace President Volodymyr Zelensky if US President Donald Tru…",
    "link": "https://sputnikglobe.com/20250719/sy-hersh-reveals-zelenskyys-imminent-replacement-by-ukrainian-general-1122458547.html",
    "timestamp": "2025-07-19T09:27:20Z"
  },
  {
    "title": "Zelensky may not last much longer – Hersh",
    "description": "Former General Valery Zaluzhny could step in amid declining support for the Ukrainian leader, according to the journalist Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/621684-zelensky-replace-zaluzhny-months-hersh/",
    "timestamp": "2025-07-19T09:24:36Z"
  },
  {
    "title": "Are US tariffs starting to bite? Trump, in denial over rising prices, targets Fed chief Powell",
    "description": "The White House is trying to drive out the Federal Reserve chair. Critics warn it would be a costly bid to pass the buck\nMemo from the White House: inflation is “right on track”, it declared this week, citing the latest official data. Price growth is now “ver…",
    "link": "https://biztoc.com/x/d9c2e41020dd7aa9",
    "timestamp": "2025-07-19T09:23:01Z"
  },
  {
    "title": "China firmly opposes US report touting 'big power rivalry' and 'China threat': Chinese FM",
    "description": "When asked to comment on a report released Monday by Democrats serving on the US Senate Foreign Relations Committee, which claimed that the Trump administration has ceded diplomatic ground and global influence to China since Donald Trump took office six month…",
    "link": "https://www.globalsecurity.org/wmd/library/news/china/2025/07/china-250718-globaltimes02.htm",
    "timestamp": "2025-07-19T09:17:36Z"
  },
  {
    "title": "Trump Pivots On Weapons For Ukraine And Resets The Clock For Putin",
    "description": "When US President Donald Trump said he would make a \"major statement\" on Russia, it led to speculation he might tap nearly $4 billion in unused US military aid for Ukraine or finally slap sanctions on Moscow and its major trading partners.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250715-rferl05.htm",
    "timestamp": "2025-07-19T09:17:36Z"
  },
  {
    "title": "Russia warns West of possible 'preemptive strikes' as US missiles head to Ukraine",
    "description": "A senior Russian official has warned of possible \"preemptive strikes\" in the face of what Moscow sees as intensifying Western hostility, amid reports that US-made Patriot missile systems are being delivered to Ukraine through NATO partners.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250718-presstv01.htm",
    "timestamp": "2025-07-19T09:17:05Z"
  },
  {
    "title": "Iran Tells Europeans To Abandon 'Worn Out' Threats Amid Nuclear Sanctions Debate",
    "description": "Iranian Foreign Minister Abbas Araqchi has called on European powers to halt threats against Tehran, including warnings about reinstating UN sanctions.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250718-rferl01.htm",
    "timestamp": "2025-07-19T09:10:18Z"
  },
  {
    "title": "Analysts Question Whether Trump's 50-Day Ultimatum Will Push Putin Toward a Deal",
    "description": "US President Donald Trump handed the Kremlin a clear warning this week, announcing plans for weapons supplies to Kyiv via Europe and saying the United States will impose \"very severe tariffs\" on Russia if it doesn't reach a deal on the war in Ukraine within 5…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250719-rferl01.htm",
    "timestamp": "2025-07-19T09:10:18Z"
  },
  {
    "title": "EY Report Says Italy’s GDP Could Fall 1.4 Percent If U.S. Tariffs Hit 30 Percent",
    "description": "According to EY's latest report, U.S. President Donald's Trump's new tariffs on EU exports would have a negative impact of just under 30 billion euros on the Italian economy.",
    "link": "http://wwd.com/business-news/government-trade/ey-report-italy-gdp-drop-30-percent-us-tariffs-1237986847/",
    "timestamp": "2025-07-19T09:09:56Z"
  },
  {
    "title": "460,000 student loan borrowers to be kicked off from repayment plan? Know the big changes from August 1",
    "description": "Under President Trump, the dismantling of the Education Department is causing turmoil for student loan borrowers. Nearly half a million applications for income-driven repayment plans face rejection, while interest charges are set to resume for millions, poten…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-460000-student-loan-borrowers-to-be-kicked-off-from-repayment-plan-know-the-big-changes-from-august-1/articleshow/122780352.cms",
    "timestamp": "2025-07-19T09:06:52Z"
  },
  {
    "title": "Exclusive: Trade partners have realized America is ‘simply not reliable’ after Trump’s tariff regime, says Elizabeth Warren—believing impact will be felt for generations to come",
    "description": "The White House believes tariffs are a win for American voters, but Sen. Warren tells Fortune the policy has driven up tariff-vulnerable costs, delayed manufacturing investment, and forced the Fed to keep interest rates higher than it otherwise would.",
    "link": "https://fortune.com/2025/07/19/elizabeth-warren-trade-tariff-trump/",
    "timestamp": "2025-07-19T09:02:00Z"
  },
  {
    "title": "Trump cuts could leave 250,000 Washingtonians without health coverage, shutter rural hospitals - NewsBreak",
    "description": "State leaders and hospital officials say the so-called \"Big Beautiful Bill\" signed into law earlier this month by President Donald Trump could impact the a",
    "link": "https://www.newsbreak.com/share/4117073331536-trump-cuts-could-leave-250-000-washingtonians-without-health-coverage-shutter-rural-hospitals?_f=app_share&amp;pd=0Io61lVN&amp;lang=en_US&amp;send_time=1752915395&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.26.0.30%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v8%2Cns_foryou_model_exp_25q2_v2-v9%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_rank_exp_25q2-v4&amp;s=i2",
    "timestamp": "2025-07-19T09:01:40Z"
  },
  {
    "title": "Donald Trump Is Most Successful President After Six Months Since FDR",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe first six months of Donald Trump's second presidency have been the most \"successful\" of any American president since Franklin D. Roosevelt, according to an analysis conducted by Newsweek using AI.\nThe mode…",
    "link": "https://biztoc.com/x/ca6b2582d19c1db6",
    "timestamp": "2025-07-19T09:01:00Z"
  },
  {
    "title": "Donald Trump's Approval Rating Plunges with America's Richest",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is experiencing a sharp decline in support among high-income Americans, according to new polling.\nNew polling from The Economist/YouGov shows a drop in the president's approval among tho…",
    "link": "https://biztoc.com/x/82ce09036e140856",
    "timestamp": "2025-07-19T09:00:58Z"
  },
  {
    "title": "If Britain Is Our Bellwether, Things Do Not Bode Well",
    "description": "The “special relationship” between the United Kingdom and the United States has often been a rocky one—as it is now. In spite of Prime Minister Keir Starmer’s workmanlike efforts to get on President Trump’s good side, London and Washington have frequently bee…",
    "link": "https://freebeacon.com/columns/if-britain-is-our-bellwether-things-do-not-bode-well/",
    "timestamp": "2025-07-19T09:00:05Z"
  }
]