[
  {
    "title": "Hamas Says Israeli Troops Sticking Point In Truce Talks As Gaza Pounded",
    "description": "Hamas on Thursday said it opposes any ceasefire deal that includes a large Israeli military presence in Gaza, after offering to release some hostages and as the civil defence reported scores of civilians killed across the Palestinian territory.",
    "link": "https://www.ibtimes.com.au/hamas-says-israeli-troops-sticking-point-truce-talks-gaza-pounded-1859622",
    "timestamp": "2025-07-10T13:06:16Z"
  },
  {
    "title": "EU opens new probe into TikTok data transfer to China",
    "description": "An Irish regulator helping police European Union data privacy said Thursday it had launched an investigation into TikTok over the transfer of European users'...",
    "link": "https://www.yahoo.com/news/eu-opens-probe-tiktok-data-130555434.html",
    "timestamp": "2025-07-10T13:05:55Z"
  },
  {
    "title": "Trump quietly claimed a power even King George wasn't allowed to have (Zack Beauchamp/Vox)",
    "description": "Zack Beauchamp / Vox:\nTrump quietly claimed a power even King George wasn't allowed to have  —  A truly scary new revelation about Trump's effort to circumvent the TikTok ban. … Just before the July Fourth holiday, we learned that President Donald Trump secre…",
    "link": "https://www.memeorandum.com/250710/p24",
    "timestamp": "2025-07-10T13:05:01Z"
  },
  {
    "title": "Ukraine War: Historic Telephone Conversation. Trump “Strategically” Defeated by Putin. Trump Decision to Suspend Arms Shipments to Ukraine",
    "description": "The telephone conversation between Russian President Vladimir Putin and his US counterpart, Donald Trump, showed that Moscow has a clear position on the Ukrainian conflict. The call between the leaders of the two great powers has also made it …\nThe post Ukrai…",
    "link": "https://www.globalresearch.ca/trump-defeated-by-putin-sanctions-wont-make-difference/5894571",
    "timestamp": "2025-07-10T13:04:47Z"
  },
  {
    "title": "US copper tariffs threat are met with shrugs, skepticism, though risks remain",
    "description": "US threats to impose 50 per cent tariffs on copper imports have been met with shrugs by Canadian mining companies and skepticism by analysts, though long-term risks remain.",
    "link": "https://www.nationalobserver.com/2025/07/10/news/us-copper-tariffs-threat-are-met-shrugs-skepticism-though-risks-remain",
    "timestamp": "2025-07-10T13:03:26Z"
  },
  {
    "title": "How to Negotiate With Trump",
    "description": "Donald Trump’s reckless, capricious, and antagonistic behavior is designed to overwhelm and distract. Countries attempting to reach trade deals with his administration must remain patient, think strategically, and, where possible, bring mutually beneficial of…",
    "link": "https://www.project-syndicate.org/commentary/countries-should-resist-trump-pressure-to-strike-quick-trade-deals-by-koichi-hamada-2025-07",
    "timestamp": "2025-07-10T13:01:31Z"
  },
  {
    "title": "Texas floods show that Trump’s America is a cold, hard place",
    "description": "The president would rather intimidate and detain immigrants than help flood victims",
    "link": "https://www.salon.com/2025/07/10/texas-floods-show-that-trumps-america-is-a-cold-hard-place/",
    "timestamp": "2025-07-10T13:00:21Z"
  },
  {
    "title": "Is Democratic Rhetoric Fueling Violence Among Fringe Progressives?",
    "description": "\"Obviously, these are Democrats who have moved beyond the defeat-them-at-the-ballot-box stage of politics, and even beyond the protest-by-civil-disobedience stage.\"\nThe post Is Democratic Rhetoric Fueling Violence Among Fringe Progressives? first appeared on …",
    "link": "https://legalinsurrection.com/2025/07/is-democratic-rhetoric-fueling-violence-among-fringe-progressives/",
    "timestamp": "2025-07-10T13:00:19Z"
  },
  {
    "title": "MAGA hats burn as president faces major backlash from supporters...",
    "description": null,
    "link": "https://www.themirror.com/news/us-news/maga-hat-burning-trump-supporters-1257768",
    "timestamp": "2025-07-10T13:00:03Z"
  },
  {
    "title": "10 reasons the DOJ and FBI face backlash over Epstein files flop",
    "description": "DOJ leaders are facing criticism and resignation calls from one-time supporters after they ended their inquiry into Jeffrey Epstein’s sex trafficking case without releasing new files.",
    "link": "https://www.foxnews.com/politics/10-reasons-doj-fbi-face-backlash-over-epstein-files-flop",
    "timestamp": "2025-07-10T13:00:03Z"
  },
  {
    "title": "US applications for jobless benefits fall to 227,000 last week, remain at historically healthy level",
    "description": "U.S. applications for unemployment benefits fell last week, remaining in the historically healthy range of the past couple years.",
    "link": "https://www.clickondetroit.com/business/2025/07/10/us-applications-for-jobless-benefits-fall-to-227000-last-week-remain-at-historically-healthy-level/",
    "timestamp": "2025-07-10T12:59:56Z"
  },
  {
    "title": "Five things Trump should know about Liberia and why they speak 'good English'",
    "description": "Liberia was founded by freed slaves and the country has long-standing historical ties with the US.",
    "link": "https://www.bbc.com/news/articles/c5y72w17vpwo",
    "timestamp": "2025-07-10T12:58:58Z"
  },
  {
    "title": "OPEC+ Discussing Pause to Output Hikes After Next Increase",
    "description": "OPEC+ is discussing a pause in further production increases from October after its next monthly hike, according to delegates familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/opec-discussing-pause-to-output-hikes-after-next-increase",
    "timestamp": "2025-07-10T12:58:04Z"
  },
  {
    "title": "Jeffrey Epstein Did Not Kill Himself",
    "description": "Pam Bondi in February 2025) Jeffrey Epstein carried out the most successful, deeply rooted blackmail operation in modern history. US intelligence agencies suddenly pivoted to say that Jeffrey Epstein never kept a client list, did not blackmail political figur…",
    "link": "https://freerepublic.com/focus/f-chat/4327876/posts",
    "timestamp": "2025-07-10T12:56:46Z"
  },
  {
    "title": "Jeffrey Epstein Did Not Kill Himself",
    "description": "Pam Bondi in February 2025) Jeffrey Epstein carried out the most successful, deeply rooted blackmail operation in modern history. US intelligence agencies suddenly pivoted to say that Jeffrey Epstein never kept a client list, did not blackmail political figur…",
    "link": "https://freerepublic.com/focus/f-news/4327876/posts",
    "timestamp": "2025-07-10T12:56:46Z"
  },
  {
    "title": "Trump Ag Chief Tells Fox No Amnesty for Farm Workers Days After Trump Floated Leniency For Farm Workers",
    "description": "Brooke Rollins told Fox anchor Maria Bartiromo that Trump's plans include no amnesty for farm workers just days after Trump seemed to float leniency.\nThe post Trump Ag Chief Tells Fox No Amnesty for Farm Workers Days After Trump Floated Leniency For Farm Work…",
    "link": "https://www.mediaite.com/media/news/trump-ag-chief-tells-fox-no-amnesty-for-farm-workers-days-after-trump-floated-leniency-for-farm-workers/",
    "timestamp": "2025-07-10T12:56:32Z"
  },
  {
    "title": "Is the Trump-Putin bromance over... again?",
    "description": "The US president has admitted he's 'p*ssed off' with his opposite number",
    "link": "https://theweek.com/politics/is-the-trump-putin-bromance-over-again",
    "timestamp": "2025-07-10T12:56:00Z"
  },
  {
    "title": "Forget About Epstein, MAGA! Comey And Brennan Under Investigation For 'Seashells' And Russia Russia Russia!",
    "description": "This is very serious and also the stupidest fucking thing we have ever heard.",
    "link": "https://www.wonkette.com/p/forget-about-epstein-maga-comey-and",
    "timestamp": "2025-07-10T12:55:12Z"
  },
  {
    "title": "Canadian pharmaceutical industry alarmed after Trump hints at a 200 per cent tariff",
    "description": "Canada likely isn't the main target of US President Donald Trump's threat to impose a 200 per cent tariff on pharmaceutical imports, an industry representative said Wednesday — but his plan could still put parts of the Canadian sector in peril.",
    "link": "https://www.nationalobserver.com/2025/07/10/news/canadian-pharmaceutical-industry-alarmed-after-trump-hints-200-cent-tariff",
    "timestamp": "2025-07-10T12:54:02Z"
  },
  {
    "title": "Major BRICS country responds to Trump’s tariff threat",
    "description": "Indonesia has said it is ready to face the consequences of being part of BRICS despite pressure from the US Read Full Article at RT.com",
    "link": "https://www.rt.com/news/621289-brics-tariffs-trump-us/",
    "timestamp": "2025-07-10T12:52:48Z"
  },
  {
    "title": "Taking time out to think",
    "description": "Because of the ongoing political-military-religious fireworks our concentration becomes distorted, and we are often oblivious to that factor which is closest to us, namely - ourselves.",
    "link": "https://www.israelnationalnews.com/news/411455",
    "timestamp": "2025-07-10T12:51:26Z"
  },
  {
    "title": "‘He’s Out of His Depth’: GOP Senator Who Cast Deciding Vote for Pete Hegseth Says He’d Take It Back If He Could",
    "description": "The Republican senator who cast the deciding vote to confirm Pete Hegseth as Secretary of Defense trashed him in a CNN interview Wednesday.\nThe post ‘He’s Out of His Depth’: GOP Senator Who Cast Deciding Vote for Pete Hegseth Says He’d Take It Back If He Coul…",
    "link": "https://www.mediaite.com/media/news/hes-out-of-his-depth-gop-senator-who-cast-deciding-vote-for-pete-hegseth-says-hed-take-it-back-if-he-could/",
    "timestamp": "2025-07-10T12:50:42Z"
  },
  {
    "title": "Trump loves ICE. Its Workforce Has Never Been So Miserable. (Nick Miroff/The Atlantic)",
    "description": "Nick Miroff / The Atlantic:\nTrump loves ICE.  Its Workforce Has Never Been So Miserable.  —  ICE occupies an exalted place in President Donald Trump's hierarchy of law enforcement.  He praises the bravery and fortitude of Immigration and Customs Enforcement o…",
    "link": "https://www.memeorandum.com/250710/p22",
    "timestamp": "2025-07-10T12:50:09Z"
  },
  {
    "title": "Ericsson (ERIC) Loses 4% on US-EU Tariff Uncertainty",
    "description": "Telefonaktiebolaget LM Ericsson (NASDAQ:ERIC) is one of the 10 Stocks That Investors Are Dumping. Ericsson dropped for a second day on Wednesday, losing 4.04...",
    "link": "https://finance.yahoo.com/news/ericsson-eric-loses-4-us-124941089.html",
    "timestamp": "2025-07-10T12:49:41Z"
  },
  {
    "title": "Iranian Cleric Offers Reward for Whoever 'Brings the Head of Trump'",
    "description": "It comes after Mohammad-Javad Larijani, an aide close to Iran's Supreme Leader Ali Khamenei, said the U.S. President \"can no longer sunbathe in Mar-a-Lago.\"",
    "link": "https://www.newsweek.com/iran-donald-trump-assassination-2097095",
    "timestamp": "2025-07-10T12:49:30Z"
  },
  {
    "title": "Trump’s new tariff letters hit 22 countries ahead of August 1 — even allies not spared, BRICS suffer most… who’s next on the radar?",
    "description": "Trump’s new tariff letters have sent shockwaves across global markets as he targets 22 countries with tough new trade threats just weeks before the August 1 deadline. From close allies like Japan and South Korea to BRICS nations like Brazil and South Africa, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-new-tariff-letters-hit-22-countries-ahead-of-august-1-even-allies-not-spared-brics-suffer-most-whos-next-on-the-radar-heres-the-complete-list/articleshow/122367239.cms",
    "timestamp": "2025-07-10T12:48:20Z"
  },
  {
    "title": "Kathy Griffin stands by belief that Trump didn't win 2024 election, despite 'tinfoil hat' label",
    "description": "Kathy Griffin shared doubts about the legitimacy of the 2024 election results during a Substack Live with E. Jean Carroll, stating she doesn't believe Trump won.",
    "link": "https://www.foxnews.com/media/kathy-griffin-stands-belief-trump-didnt-win-2024-election-despite-tinfoil-hat-label",
    "timestamp": "2025-07-10T12:46:54Z"
  },
  {
    "title": "Inside Trump’s latest blow-up on tariffs: Furious over climbdown, he goes off on inner circle",
    "description": "Donald Trump is unhappy with the slow progress of trade negotiations. He is considering extending tariff deadlines. New tariffs on imports from several nations are scheduled. Treasury Secretary Scott Bessent suggests patience. He says EU and India talks are a…",
    "link": "https://economictimes.indiatimes.com/news/international/us/inside-trumps-latest-blow-up-on-tariffs-furious-over-climbdown-he-goes-off-on-inner-circle-donald-trump-tariffs-news/articleshow/122366769.cms",
    "timestamp": "2025-07-10T12:46:16Z"
  },
  {
    "title": "Cato Institute, NCLA Urge Appeals Court To Reject Trump Tariffs Citing Unauthorized Use Of Statute: Report",
    "description": "The Cato Institute and the New Civil Liberties Alliance (NCLA) have called on the Federal Circuit to strike down President Donald Trump‘s tariffs, arguing they rely on a statute that does not grant any authority to impose such tariffs.\nWhat Happened: Accordin…",
    "link": "https://biztoc.com/x/9bf5d5055aba2fc6",
    "timestamp": "2025-07-10T12:45:43Z"
  },
  {
    "title": "Pop Star Billie Eilish Pushes Anti-ICE Propaganda as Trump Ramps Up Illegal Alien Arrests",
    "description": "Pop star Billie Eilish is pushing anti-ICE propaganda as President Donald Trump ramps up illegal alien arrests throughout the country.\nThe post Pop Star Billie Eilish Pushes Anti-ICE Propaganda as Trump Ramps Up Illegal Alien Arrests appeared first on Breitba…",
    "link": "https://www.breitbart.com/entertainment/2025/07/10/pop-star-billie-eilish-pushes-anti-ice-propaganda-as-trump-ramps-up-illegal-alien-arrests/",
    "timestamp": "2025-07-10T12:45:43Z"
  },
  {
    "title": "Fox News Stars Dump on Trump Killing Epstein Conspiracy for ‘Political Purposes’",
    "description": "Fox News is now openly questioning Trump’s Epstein cover-up, signaling a stunning shift as loyalty gives way to outrage from the MAGA base they helped create.\nThe post Fox News Stars Dump on Trump Killing Epstein Conspiracy for ‘Political Purposes’ first appe…",
    "link": "https://www.mediaite.com/media/tv/fox-news-stars-dump-on-trump-killing-epstein-conspiracy-for-political-purposes/",
    "timestamp": "2025-07-10T12:45:38Z"
  },
  {
    "title": "New Hampshire judge to hear arguments on class action against Trump’s birthright citizenship order",
    "description": "The lawsuit seeks to block Trump’s January order denying citizenship to babies born to undocumented or temporary residents.",
    "link": "https://www.bostonherald.com/2025/07/10/immigration-birthright-citizenship-class-action/",
    "timestamp": "2025-07-10T12:40:34Z"
  },
  {
    "title": "New Hampshire judge to pause Trump’s birthright citizenship order",
    "description": "The judge says the order will include a seven-day stay to allow for appeal.",
    "link": "https://www.denverpost.com/2025/07/10/immigration-birthright-citizenship-class-action/",
    "timestamp": "2025-07-10T12:40:34Z"
  },
  {
    "title": "Rhode Island man arrested for threatening to kill Trump, members of his cabinet",
    "description": "PROVIDENCE -- A city man has been arrested for threatening to kill President Donald Trump, U.S. Attorney General Pamela Bondi, and White House Deputy Chief of Staff Stephen Miller, Acting Rhode Island United States Attorney Sara Miron Bloom said.",
    "link": "https://www.thesunchronicle.com/news/local_news/rhode-island-man-arrested-for-threatening-to-kill-trump-members-of-his-cabinet/article_1caf034d-9e75-4f98-b849-3487809e50fe.html",
    "timestamp": "2025-07-10T12:39:00Z"
  },
  {
    "title": "Trump Deportations Lag Behind Obama’s",
    "description": "\"Immigration and Customs Enforcement agents last month arrested the most people in at least five years, but deportations are still lagging far behind what President Donald Trump has promised — and even behind those in",
    "link": "https://politicalwire.com/2025/07/10/trump-deportations-lag-behind-obamas/",
    "timestamp": "2025-07-10T12:38:08Z"
  },
  {
    "title": "The three energy topics on everyone’s lips at the OPEC seminar",
    "description": "Energy ministers talked through production capacity, investment and the green transition at this week’s OPEC conference in Vienna.",
    "link": "https://www.cnbc.com/2025/07/10/the-three-energy-topics-on-everyones-lips-at-the-opec-seminar.html",
    "timestamp": "2025-07-10T12:37:43Z"
  },
  {
    "title": "Bill Ackman's Abysmal Pro-Tennis Debut Sparks Mockery: 'Biggest Joke'",
    "description": "Andy Roddick, the former professional tennis player said that Ackman's game was \"beneath the Hall of Fame.\"",
    "link": "https://www.newsweek.com/bill-ackman-pro-tennis-game-mockery-social-media-2097102",
    "timestamp": "2025-07-10T12:36:38Z"
  },
  {
    "title": "Gold rate today: Gold price rises, US Dollar falls",
    "description": "Gold price was up on Thursday and US dollar (USD) fell as investors seek more clarity over Donald Trump's trade deal.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-rate-today-gold-price-rises-us-dollar-falls/articleshow/122367260.cms",
    "timestamp": "2025-07-10T12:35:14Z"
  },
  {
    "title": "U.S. Consumer Protection Is Dead: Lobbyists And Lawyers Kill New FTC Rule That Would Have Made It Easier To Cancel Subscriptions",
    "description": "Have I mentioned lately that the U.S. no longer has functional federal consumer protection and corporate oversight thanks to Donald Trump? And how that should probably be more of a story across journalism? Last fall you might recall that the FTC created a pop…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178325936",
    "timestamp": "2025-07-10T12:35:11Z"
  },
  {
    "title": "German Chancellor urges Trump to 'stay with us' Europeans on Ukraine",
    "description": "German Chancellor Friedrich Merz urged US President Donald Trump Thursday to \"stay with us\" Europeans in maintaining support for Ukraine. He also called out Slovakia for holding up new EU sanctions on Russia.",
    "link": "https://www.thelocal.de/20250710/german-chancellor-urges-trump-to-stay-with-us-europeans-on-ukraine",
    "timestamp": "2025-07-10T12:33:32Z"
  },
  {
    "title": "Thinking the Unthinkable: Do Republicans Want Some of Us to Die?",
    "description": "“Well, we all are going to die,” Iowa Republican Sen. Joni Ernst responded to a constituent who said “people are going to die” because of the cruel provisions of U.S. President Donald Trump’s “Big, Beautiful Bill.” Ernst is correct, we are all going to die, b…",
    "link": "https://www.commondreams.org/opinion/republicans-want-some-to-die",
    "timestamp": "2025-07-10T12:33:03Z"
  },
  {
    "title": "'Why date an unattractive Indian-American': Kash Patel's girlfriend smeared into Jeffrey Epstein conspiracy",
    "description": "Kash Patel's girlfriend, Alexis Wilkins, is unexpectedly caught in Jeffrey Epstein conspiracy theories, fueled by the US administration's denial of Epstein files. Social media users speculate about Wilkins' connection to PragerU and its alleged ties to Israel…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-why-date-an-unattractive-indian-american-kash-patels-girlfriend-smeared-into-jeffrey-epstein-conspiracy/articleshow/122367107.cms",
    "timestamp": "2025-07-10T12:32:32Z"
  },
  {
    "title": "Donald Trump Is Going Viral For Awkwardly Complimenting Someone On Their English-Speaking Skills",
    "description": "\"He sure did his research.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/trump-liberia-english-exchange",
    "timestamp": "2025-07-10T12:32:30Z"
  },
  {
    "title": "Trump’s ‘big’ bill gives millions of taxpayers a new charitable tax break, but whether it will help nonprofits is unclear",
    "description": "A new broadly available tax break of up to $1,000 will become available for those giving to a charity if they file on their own. Couples filing jointly may deduct $2,000 from their taxable income.",
    "link": "https://theconversation.com/trumps-big-bill-gives-millions-of-taxpayers-a-new-charitable-tax-break-but-whether-it-will-help-nonprofits-is-unclear-260379",
    "timestamp": "2025-07-10T12:31:29Z"
  },
  {
    "title": "TikToker Launches Fake ‘Alligator Alcatraz’ Tour Website That Redirects to Photos of Trump With Epstein",
    "description": "The joke's on anyone who is disturbed enough to want a tour of Florida's new horror show.",
    "link": "https://gizmodo.com/tiktoker-launches-fake-alligator-alcatraz-tour-website-that-redirects-to-photos-of-trump-with-epstein-2000627141",
    "timestamp": "2025-07-10T12:30:34Z"
  },
  {
    "title": "Should You Be Having More Babies?",
    "description": "It’s time for liberals to engage in the depopulation debate, says Dean Spears, a co-author of After the Spike.",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/should-you-be-having-more-babies/683473/",
    "timestamp": "2025-07-10T12:30:00Z"
  },
  {
    "title": "Trump announces 50 percent tariff on Brazil, citing Bolsonaro trial (Washington Post)",
    "description": "Washington Post:\nTrump announces 50 percent tariff on Brazil, citing Bolsonaro trial  —  Trump announced a 50 percent tariff on all Brazilian goods, escalating a feud over Brazil's prosecution of former president Jair Bolsonaro.  Brazil vowed to retaliate.  —…",
    "link": "https://www.memeorandum.com/250710/p15",
    "timestamp": "2025-07-10T12:30:00Z"
  },
  {
    "title": "\"Apocalypse in the Tropics\": Brazilian Filmmaker on Evangelicals, Bolsonaro & Trump's Tariff Threat",
    "description": "Brazilian filmmaker Petra Costa’s latest documentary, Apocalypse in the Tropics, explores the impact of evangelical Christianity on Brazil’s political landscape. Once a small minority, evangelicals now constitute about 30% of Brazil’s population and played a …",
    "link": "https://www.democracynow.org/2025/7/10/apocalypse_in_the_tropics_petra_costa",
    "timestamp": "2025-07-10T12:29:10Z"
  },
  {
    "title": "Desperate for a Nobel Peace Prize? Donald Trump's dream faces these brutal committee rules",
    "description": "Benjamin Netanyahu nominated Donald Trump for the Nobel Peace Prize for his efforts in promoting peace, particularly between Israel and Hamas. While nominations are open to many, the Nobel Committee follows a strict selection process. Despite past nominations…",
    "link": "https://economictimes.indiatimes.com/news/international/us/desperate-for-a-nobel-peace-prize-donald-trumps-dream-faces-these-brutal-committee-rules/articleshow/122366762.cms",
    "timestamp": "2025-07-10T12:28:34Z"
  },
  {
    "title": "Brazil’s President Flatly Rejects Trump’s Demand to Drop Bolsonaro Case",
    "description": "Lula issued a rebuke to Trump’s trade tariffs and firmly refused his demand that the case against the Brazil's former president Jair Bolsonaro be dropped.\nThe post Brazil’s President Flatly Rejects Trump’s Demand to Drop Bolsonaro Case first appeared on Media…",
    "link": "https://www.mediaite.com/media/news/brazils-president-flatly-rejects-trumps-demand-to-drop-bolsonaro-case/",
    "timestamp": "2025-07-10T12:27:34Z"
  },
  {
    "title": "'Disaster': Trump's plan would reportedly 'undercut' his own 'creepy' goals",
    "description": "Donald Trump and JD Vance have pushed the notion of having as many kids as possible, but their own plan would make that more difficult for citizens, according to a conservative writer.Former Washington Post columnist Jennifer Rubin wrote an essay called, \"MAG…",
    "link": "https://www.rawstory.com/trump-natalism-undercuts-own-goals/",
    "timestamp": "2025-07-10T12:27:24Z"
  },
  {
    "title": "Hundreds gather in Kerrville to mourn victims of Texas flash floods",
    "description": "Over 120 people lost their lives in catastrophic flash floods in Kerr County, Texas, during the July Fourth holiday",
    "link": "https://www.wisn.com/article/kerrville-texas-flash-floods-vigil/65364670",
    "timestamp": "2025-07-10T12:26:14Z"
  },
  {
    "title": "Trump Wants Washington Commanders To Use Former Team Name, Praised For Suggestion",
    "description": "The Washington Commanders took its name in 2022, but President Trump prefers the slur and was praised for the suggestion",
    "link": "https://hiphopwired.com/2769578/washington-commanders-president-trump-team-name/",
    "timestamp": "2025-07-10T12:25:56Z"
  },
  {
    "title": "Former reality TV star appointed NASA Interim Administrator",
    "description": "Can Sean Duffy embrace the challenge?\nNASA has a new interim Administrator. US President Donald Trump has announced that former reality TV star and current Transportation Secretary Sean Duffy will be taking on the role.…",
    "link": "https://biztoc.com/x/72ca567b083d37c9",
    "timestamp": "2025-07-10T12:23:04Z"
  },
  {
    "title": "U.S. Consumer Protection Is Dead: Lobbyists And Lawyers Kill New FTC Rule That Would Have Made It Easier To Cancel Subscriptions",
    "description": "Have I mentioned lately that the U.S. no longer has functional federal consumer protection and corporate oversight thanks to Donald Trump? And how that should probably be more of a story across journalism? Last fall you might recall that the FTC created a pop…",
    "link": "https://www.techdirt.com/2025/07/10/u-s-consumer-protection-is-dead-lobbyists-and-lawyers-kill-new-ftc-rule-that-would-have-made-it-easier-to-cancel-subscriptions/",
    "timestamp": "2025-07-10T12:22:00Z"
  },
  {
    "title": "Bad Bunny Imagines Trump Doing The Absolutely Unthinkable In New Music Video",
    "description": "The Puerto Rican star flipped the script on the president in “NUEVAYoL.”",
    "link": "https://www.huffpost.com/entry/bad-bunny-donald-trump-music-video_n_686f9f8be4b045e0e37f2c2b",
    "timestamp": "2025-07-10T12:21:06Z"
  },
  {
    "title": "Virginia falls out of top spot as CNBC's best state for business",
    "description": "Virginia, named No. 1 last year, fell to fourth in the new ranking that the cable network unveiled on Thursday morning.",
    "link": "https://richmond.com/news/state-regional/business/article_18b94abe-ca8b-45ea-9da0-d485819cb004.html",
    "timestamp": "2025-07-10T12:21:00Z"
  },
  {
    "title": "Former reality TV star appointed NASA Interim Administrator",
    "description": "Can Sean Duffy embrace the challenge? NASA has a new interim Administrator. US President Donald Trump has announced that former reality TV star and current Transportation Secretary Sean Duffy will be taking on the role.…",
    "link": "https://www.theregister.com/2025/07/10/nasa_interim_administrator/",
    "timestamp": "2025-07-10T12:19:15Z"
  },
  {
    "title": "Massachusetts bill would force ICE agents to unmask",
    "description": "New Massachusetts legislation targeting masked ICE agents joins similar Democratic proposals at the federal level, drawing criticism from President Trump.",
    "link": "https://www.foxnews.com/politics/massachusetts-bill-would-force-ice-agents-unmask",
    "timestamp": "2025-07-10T12:18:41Z"
  },
  {
    "title": "US funding cuts could reverse decades of gains in AIDS fight: UN",
    "description": "The United Nations warns that the halt to US foreign aid, initiated by President Trump in February 2025, poses a significant threat to global AIDS progress. UNAIDS reports potential surges in infections and deaths, reversing decades of gains due to shuttered …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-funding-cuts-could-reverse-decades-of-gains-in-aids-fight-un/articleshow/122366853.cms",
    "timestamp": "2025-07-10T12:16:52Z"
  },
  {
    "title": "Donald Trump’s assault on American greatness",
    "description": "In just six months, the US president has made huge strides in advancing his agenda",
    "link": "https://www.irishtimes.com/business/economy/2025/07/10/donald-trumps-assault-on-american-greatness/",
    "timestamp": "2025-07-10T12:16:38Z"
  },
  {
    "title": "NASA Cuts: What We Know as Trump Appoints Sean Duffy to Run Agency",
    "description": "NASA's leadership change comes at a pivotal moment for the agency, which is already bracing for potentially severe funding cuts.",
    "link": "https://www.newsweek.com/nasa-cuts-sean-duffy-donald-trump-2097079",
    "timestamp": "2025-07-10T12:15:33Z"
  },
  {
    "title": "Rubio holds talks with Russia's Lavrov as Ukraine tensions soar",
    "description": "U.S. Secretary of State Marco Rubio has met with his Russian counterpart in Malaysia as tensions between the countries rise over Moscow's increasing attacks on Ukraine",
    "link": "https://abcnews.go.com/Business/wireStory/rubio-holds-talks-russias-lavrov-ukraine-tensions-soar-123636110",
    "timestamp": "2025-07-10T12:14:17Z"
  },
  {
    "title": "Jeffrey Epstein sent shocking final text hours before his death, author claims",
    "description": "Author Michael Wolff claims Jeffrey Epstein sent him a text before his death",
    "link": "https://www.ladbible.com/news/us-news/jeffrey-epstein-text-message-death-945971-20250710",
    "timestamp": "2025-07-10T12:12:09Z"
  },
  {
    "title": "Trump taps transportation secretary Sean Duffy as acting NASA chief",
    "description": "President Donald Trump appointed Secretary of Transportation Sean Duffy to lead NASA.",
    "link": "https://biztoc.com/x/226367ce5d3a9313",
    "timestamp": "2025-07-10T12:12:02Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV.",
    "link": "https://www.click2houston.com/business/2025/07/10/un-says-if-us-funding-for-hiv-programs-is-not-replaced-millions-more-will-die-by-2029/",
    "timestamp": "2025-07-10T12:08:46Z"
  },
  {
    "title": "Rubio holds talks with Russia’s Lavrov as Ukraine tensions soar",
    "description": "Thursday's meeting occurred shortly after the U.S. resumed some shipments of defensive weapons to Ukraine.",
    "link": "https://www.bostonherald.com/2025/07/10/rubio-talks-russian-counterpart-asean/",
    "timestamp": "2025-07-10T12:08:40Z"
  },
  {
    "title": "Pete Hegseth Seems to Have Lost Control of One of His Top Defense Department Lieutenants",
    "description": "The same guy who cut off air-defense missiles to Ukraine has managed to piss off the British, the Japanese, the Australians, and the New Zealanders.",
    "link": "https://www.esquire.com/news-politics/politics/a65356964/pentagon-elbridge-colby-irritate-trump/",
    "timestamp": "2025-07-10T12:08:00Z"
  },
  {
    "title": "Gaza doctors forced to cram babies into single incubator",
    "description": "At Gaza's largest hospital, doctors say crippling fuel shortages have led them to put several premature babies in a single incubator as they struggle to keep the newborns alive while Israel presses on with its military campaign.",
    "link": "https://www.rte.ie/news/2025/0710/1522868-gaza-baby-incubators/",
    "timestamp": "2025-07-10T12:07:59Z"
  },
  {
    "title": "Iran tells IAEA to end ‘double standards’ before nuclear talks can resume",
    "description": "Iran links future IAEA cooperation to impartiality, after deadly June conflict with Israel and US.",
    "link": "https://www.aljazeera.com/news/2025/7/10/iran-tells-iaea-to-end-double-standards-before-nuclear-talks-can-resume",
    "timestamp": "2025-07-10T12:05:48Z"
  },
  {
    "title": "Posthaste: Summer is market meltdown season and this year there’s plenty of triggers",
    "description": "Markets have been remarkably resilient this year, but there is no shortage of potential triggers,  says Deutsche Bank Research. Read on",
    "link": "https://financialpost.com/news/what-could-trigger-market-meltdown-this-summer",
    "timestamp": "2025-07-10T12:05:29Z"
  },
  {
    "title": "The Law Firms' Deals With Trump Are Looking Worse and Worse (Ankush Khardori/Politico)",
    "description": "Ankush Khardori / Politico:\nThe Law Firms' Deals With Trump Are Looking Worse and Worse  —  Trump's assault on Big Law has been a big mess.  —  The Trump administration is on an unbroken losing streak in the courts — 0 for 4 — in its effort to defend Presiden…",
    "link": "https://www.memeorandum.com/250710/p12",
    "timestamp": "2025-07-10T12:05:00Z"
  },
  {
    "title": "Trump taps transportation secretary Sean Duffy as acting NASA chief | TechCrunch",
    "description": "Trump taps transportation secretary Sean Duffy as acting NASA chief | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2025/07/10/trump-taps-transportation-secretary-sean-duffy-as-acting-nasa-chief/",
    "timestamp": "2025-07-10T12:04:56Z"
  },
  {
    "title": "US Ally Issues Warning Over China Military Expansion in Pacific",
    "description": "The Philippines' defense chief said the risk of war was \"remote\" but entirely dependent on China.",
    "link": "https://www.newsweek.com/philippines-warns-china-expansionism-indo-pacific-2097011",
    "timestamp": "2025-07-10T12:03:43Z"
  },
  {
    "title": "Trump’s Brazil Tariffs Gift Lula Surprise Tailwind for 2026 Vote",
    "description": "Brazil spent months flying under the radar as Donald Trump upended global trade. Now that it’s in the spotlight, President Luiz Inacio Lula da Silva may stand to benefit from the attention.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-brazil-tariffs-gift-lula-surprise-tailwind-for-2026-vote",
    "timestamp": "2025-07-10T12:02:53Z"
  },
  {
    "title": "US stock market futures dip as Dow, S&P 500, Nasdaq weigh Trump’s tariff shock against Nvidia’s $4T rally",
    "description": "US stock market today opened slightly lower as Dow, S&P 500, and Nasdaq futures paused after a powerful tech rally led by Nvidia, which just hit a historic $4 trillion market value. Meanwhile, President Trump’s new tariff threats—including a proposed 50% impo…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-futures-dip-as-dow-sp-500-nasdaq-weigh-trumps-tariff-shock-against-nvidias-4t-rally/articleshow/122366094.cms",
    "timestamp": "2025-07-10T12:01:10Z"
  },
  {
    "title": "Here’s how the Trump tax bill will impact Colorado, from Medicaid to new tax breaks to energy credits",
    "description": "The tax bill signed into law by President Donald Trump last week includes seismic implications for Colorado.",
    "link": "https://www.denverpost.com/2025/07/10/colorado-impact-trump-tax-bill-medicaid-snap-energy-climate/",
    "timestamp": "2025-07-10T12:00:46Z"
  },
  {
    "title": "Trump Failed To Deliver His ‘No Tax’ Promises And Is Now Just Lying That He Did",
    "description": "Trump’s tax and spending bill does not eliminate taxes on Social Security, overtime and tip income, but merely provides temporary tax deductions",
    "link": "https://www.huffpost.com/entry/trump-tax-lies_n_686ee78fe4b045e0e37ea265",
    "timestamp": "2025-07-10T12:00:20Z"
  },
  {
    "title": "Immigration court observer says ICE detained her for hours",
    "description": "Hear from the 71-year-old San Diego immigration court watcher who says she was handcuffed and detained after an ICE agent accused her of assault. Then, will the county allow a neighborhood golf course to be converted into a sand mine? Also, in part two of our…",
    "link": "https://www.kpbs.org/podcasts/san-diego-news-now/immigration-court-observer-says-ice-detained-her-for-hours",
    "timestamp": "2025-07-10T12:00:00Z"
  },
  {
    "title": "MAGA Cultists Struggle To Spin The Trump Administration's Epstein Memo",
    "description": "MAGA cultists are desperately struggling to spin the Trump administration's handling of the Jeffrey Epstein case.",
    "link": "https://www.peoplefor.org/rightwingwatch/maga-cultists-struggle-spin-trump-administrations-epstein-memo",
    "timestamp": "2025-07-10T12:00:00Z"
  },
  {
    "title": "The Precarious Position of Iranian Jews",
    "description": "The remnants of an ancient community face a new age of anxiety after decades of uneasy coexistence with the mullahs’ regime.",
    "link": "https://www.theatlantic.com/international/archive/2025/07/precarious-position-iranian-jews/683486/",
    "timestamp": "2025-07-10T12:00:00Z"
  },
  {
    "title": "Forbes Daily: Nvidia Reaches A $4 Trillion Milestone",
    "description": "Today’s Forbes Daily features AI giant Nvidia’s record valuation, X’s CEO steps down as Grok unveils new model, Fed eyes rate cuts, Les Wexner’s CoreWeave bet and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/07/10/forbes-daily-nvidia-reaches-a-4-trillion-milestone/",
    "timestamp": "2025-07-10T11:59:47Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new U.N. AIDS agency report says the sudden withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV",
    "link": "https://abcnews.go.com/International/wireStory/us-funding-hiv-programs-replaced-millions-die-2029-123636204",
    "timestamp": "2025-07-10T11:58:16Z"
  },
  {
    "title": "UN says if US funding for HIV programs is not replaced, millions more will die by 2029",
    "description": "A new report says the withdrawal of U.S. funding has caused a “systemic shock” to the global effort against AIDS and HIV.",
    "link": "https://www.bostonherald.com/2025/07/10/aids-report-us-withdrawal-impact/",
    "timestamp": "2025-07-10T11:53:30Z"
  },
  {
    "title": "Biden’s physician refuses to answer questions from Republicans in House probe of former president’s mental fitness - NewsBreak",
    "description": "Joe Biden’s White House physician on Wednesday declined to answer questions during a closed-door deposition with the House Oversight Committee, invoking hi",
    "link": "https://www.newsbreak.com/share/4097433982925-biden-s-physician-refuses-to-answer-questions-from-republicans-in-house-probe-of-former-president-s-mental-fitness?_f=app_share&amp;pd=0BsB8IAC&amp;lang=en_US&amp;send_time=1752148129&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.27.0.36%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v5%2Cns_foryou_blend_exp_25q2-control&amp;s=i2",
    "timestamp": "2025-07-10T11:50:28Z"
  },
  {
    "title": "As Q2 Deliveries Plunge 14%, Is Tesla Stock a Buy, Sell, or Hold?",
    "description": "Tesla stock is under pressure in 2025 as the EV giant grapples with rising competition, a challenging macroeconomic environment, and consumer backlash.",
    "link": "https://www.barchart.com/story/news/33321253/as-q2-deliveries-plunge-14-is-tesla-stock-a-buy-sell-or-hold",
    "timestamp": "2025-07-10T11:50:02Z"
  },
  {
    "title": "Trump's Copper Tariff Echoes Through Global Mining Tunnels",
    "description": "President Donald Trump announced that the United States will impose a 50% tariff on all copper imports starting August 1. The decision threatens to disrupt a global supply chain for one of the key inputs for the American industry and a crucial commodity for t…",
    "link": "https://biztoc.com/x/2b92faf1b54cc4dc",
    "timestamp": "2025-07-10T11:49:22Z"
  },
  {
    "title": "Again, Trump’s Way or the Highway",
    "description": "It’s hard not to love US President Donald Trump. He is the world’s most powerful president and wears his preeminence on his sleeve. Not for him the crooked modesty of the Chinese or the boring self-effacements of the British. Six months into his second inaugu…",
    "link": "https://thechronicle.com.gh/again-trumps-way-or-the-highway/",
    "timestamp": "2025-07-10T11:49:09Z"
  },
  {
    "title": "Ukraine says Russia launched largest drone, missile attack of war",
    "description": "Kyiv, Ukraine (AFP) July 9, 2025\n\n\n Russia fired its largest missile and drone attack on Ukraine in more than three years of war, Kyiv said Wednesday after strikes that mainly targeted areas furthest from the front line. \n\nThe attack comes just after US Donal…",
    "link": "https://www.spacewar.com/reports/Ukraine_says_Russia_launched_largest_drone_missile_attack_of_war_999.html",
    "timestamp": "2025-07-10T11:48:32Z"
  },
  {
    "title": "Wall Street Quietly Braced For Crypto ‘Floodgates’ To Open As Bitcoin Suddenly Tops All-Time High Price",
    "description": "A closely-watched Wall Street analyst has predicted the “floodgates” are about to open for crypto ETFs...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/10/wall-street-quietly-braced-for-crypto-floodgates-to-open-as-bitcoin-suddenly-tops-all-time-high-price/",
    "timestamp": "2025-07-10T11:45:19Z"
  },
  {
    "title": "NY paper’s ‘vile’ political cartoon appears to mock Trump-voting Texas flood victims",
    "description": "Buffalo News cartoonist Adam Zyglis appeared to blame President Trump and DOGE spending cuts for the deadly floods.",
    "link": "https://nypost.com/2025/07/10/us-news/ny-papers-vile-political-cartoon-draws-outrage-for-appearing-to-mock-trump-voting-texas-flood-victims/",
    "timestamp": "2025-07-10T11:44:30Z"
  },
  {
    "title": "T-Mobile does a 180 after claiming it was committed to core values",
    "description": "T-Mobile has abandoned its DEI programs to get its pending deals approved.",
    "link": "https://www.phonearena.com/news/t-mobile-ends-dei_id172153",
    "timestamp": "2025-07-10T11:41:48Z"
  },
  {
    "title": "Starmer, Macron to announce closer UK-France nuclear weapons coordination",
    "description": "NATO's two European nuclear powers are expected to sign a declaration on closer bilateral nuclear coordination.",
    "link": "https://www.euractiv.com/section/defence/news/starmer-macron-to-announce-closer-uk-france-nuclear-weapons-coordination/",
    "timestamp": "2025-07-10T11:40:21Z"
  },
  {
    "title": "NATO Ally Warns of Iranian Assassination Threat",
    "description": "The UK faces a \"rising\" and unpredictable threat from Iran, according to a new report that highlights an increase in assassination attempts.",
    "link": "https://www.newsweek.com/uk-report-iran-assassination-threat-espionage-2097144",
    "timestamp": "2025-07-10T11:39:55Z"
  },
  {
    "title": "Trump Has No Reason To Compromise With Democrats On Immigration",
    "description": "Inviting Democrats to sit at the immigration-policy table will accomplish nothing and will jeopardize this core issue of the president’s.",
    "link": "https://thefederalist.com/2025/07/10/trump-has-no-reason-to-compromise-with-democrats-on-immigration/",
    "timestamp": "2025-07-10T11:38:32Z"
  }
]