[
  {
    "title": "Is Khamenei Dead? Trump Claims Iran's Supreme Leader Ayatollah Khamenei Is Dead But Iran Says His Not",
    "description": "President Donald Trump declared on February 28, 2026, that Iran's Supreme Leader Ayatollah Ali Khamenei has been killed in joint U.S.-Israeli military strikes, calling his death \"justice\" and the \"single greatest chance for the Iranian people to take back the…",
    "link": "https://www.ibtimes.com.au/khamenei-dead-trump-claims-irans-supreme-leader-ayatollah-khamenei-dead-iran-says-his-not-1862372",
    "timestamp": "2026-02-28T23:19:08Z"
  },
  {
    "title": "Iran strikes: US says 'no reports' of American casualties",
    "description": "The US said a wide range of servicemembers, from army to the coast guard, were involved in the operation against Iran.",
    "link": "https://www.dw.com/en/iran-strikes-us-says-no-reports-of-american-casualties/a-76169908",
    "timestamp": "2026-02-28T23:18:00Z"
  },
  {
    "title": "Tehran resident: We don't know what to do as Iranians prepare for attacks",
    "description": "People in Iran have prepared for attacks. \"It's war again. We don't know what to do,\" a Tehran resident told TT. The Iranian population has been preparing for a possible war for weeks. Many have stockpiled water and bought tens of kilos of dry goods and other…",
    "link": "https://freerepublic.com/focus/f-news/4368754/posts",
    "timestamp": "2026-02-28T23:15:52Z"
  },
  {
    "title": "Four Guys Walked Into a DC Bar And Bragged About Iran Strikes Hours Before The Military Operation: TMZ",
    "description": "Four men in a Washington, D.C., bar reportedly bragged about the U.S. strikes on Iran hours before the military action took place, according to Mark Geragos.\nThe post Four Guys Walked Into a DC Bar And Bragged About Iran Strikes Hours Before The Military Oper…",
    "link": "https://www.mediaite.com/media/news/four-guys-walked-into-a-dc-bar-and-bragged-about-iran-strikes-hours-before-the-military-operation-tmz/",
    "timestamp": "2026-02-28T23:15:49Z"
  },
  {
    "title": "No more whining — Trump and Israel are busy saving the world from Iran",
    "description": "The adults are finally back in the room: The era of appeasing terrorists is dead.",
    "link": "https://nypost.com/2026/02/28/opinion/no-more-whining-trump-and-israel-are-saving-the-world-from-iran/",
    "timestamp": "2026-02-28T23:13:49Z"
  },
  {
    "title": "Australia 'did not participate' in Operation Epic Fury in Iran",
    "description": "Foreign Minister Penny Wong has confirmed Australia was not involved in the major Israeli-United States operation in Iran that has reportedly decapitated its leadership.",
    "link": "https://www.abc.net.au/news/2026-03-01/australia-not-involved-iran-operation-epic-fury/106401742",
    "timestamp": "2026-02-28T23:13:46Z"
  },
  {
    "title": "Trump bashed for using Mar-a-Lago 'blanket fort' to monitor Iran strikes",
    "description": "President Donald Trump was bashed on Saturday after photos emerged of the \"blanket fort\" at his Mar-a-Lago estate that he used as a Situation Room to monitor the strikes in Iran. The White House posted a photo of Trump alongside Secretary of State Marco Rubio…",
    "link": "https://www.rawstory.com/trump-iran-2675455322/",
    "timestamp": "2026-02-28T23:12:50Z"
  },
  {
    "title": "OpenAI details layered protections in US defense department pact",
    "description": "Feb 28 : OpenAI said on Saturday that the agreement it struck a day ago with the Pentagon to deploy technology on the U.S. defense department's classified network includes additional safeguards to protect its use cases.U.S. President Donald Trump on Friday di…",
    "link": "https://www.channelnewsasia.com/business/openai-details-layered-protections-in-us-defense-department-pact-5961201",
    "timestamp": "2026-02-28T23:05:36Z"
  },
  {
    "title": "Why did the US and Israel attack Iran and what happens next?",
    "description": "US-Israel strikes on Iran have sharply escalated Middle East tensions, with reports of top leadership casualties and swift Iranian retaliation. Here’s a clear breakdown of why it happened and what it means for the region",
    "link": "https://www.thehindubusinessline.com/news/world/why-did-the-us-and-israel-attack-iran-and-what-happens-next/article70689559.ece",
    "timestamp": "2026-02-28T23:01:25Z"
  },
  {
    "title": "Banking Giant Barclays Considers Blockchain Payment Platform – Details",
    "description": "Prominent British multinational bank Barclays Plc is exploring the development of a blockchain platform to support payments, signaling a deeper push by traditional finance lenders into digital-asset technology. Notably, the move places Barclays alongside glob…",
    "link": "https://bitcoinist.com/banking-giant-barclays-consider-blockchain-platform/",
    "timestamp": "2026-02-28T23:00:55Z"
  },
  {
    "title": "Claude is the Number 2 Free App in Apple’s App Store Now",
    "description": "Has Donald Trump brought about Claudemania?",
    "link": "https://gizmodo.com/claude-is-the-number-2-free-app-in-apples-app-store-now-2000728146",
    "timestamp": "2026-02-28T23:00:00Z"
  },
  {
    "title": "‘The Worst-Case Outcome Is Complete Chaos’",
    "description": "Donald Trump’s plans to oust the Iranian regime, which led to the death of Ayatollah Ali Khamenei, made some of his advisers nervous, The Atlantic reports. Read about what went into the decision to attack Iran, and what might come next:",
    "link": "https://www.theatlantic.com/national-security/2026/02/iran-war-trump-us-strikes/686197/",
    "timestamp": "2026-02-28T22:59:33Z"
  },
  {
    "title": "From Tehran to Dubai: Geolocated videos show the shockwaves of US-Israeli strikes — and Iran’s retaliation | CNN",
    "description": "From Tehran to Dubai: Geolocated videos show the shockwaves of US-Israeli strikes — and Iran’s retaliation | CNNcnn.com",
    "link": "https://www.cnn.com/2026/02/28/world/us-israeli-strikes-video-breakdown-invs",
    "timestamp": "2026-02-28T22:57:58Z"
  },
  {
    "title": "President Trump says Iran's Supreme Leader is dead",
    "description": "US President Donald Trump says that Iran's supreme leader, Ayatollah Ali Khamenei, is dead following after a day of U.S. and Israeli military strikes. Iranian state media denies Mr Khamenei is dead. We bring you the latest political and diplomatic development…",
    "link": "https://www.bbc.co.uk/programmes/w172zsslqcr4ld4",
    "timestamp": "2026-02-28T22:57:00Z"
  },
  {
    "title": "Watch: How US-Israel strikes on Iran unfolded",
    "description": "Iran launched retaliatory attacks in the Middle East after US-Israel strikes across the country.",
    "link": "https://www.bbc.com/news/videos/clyv5rnd8r0o",
    "timestamp": "2026-02-28T22:56:36Z"
  },
  {
    "title": "Trump: Khamenei dead after US strikes Iran",
    "description": "US President Donald Trump says Iran’s Supreme Leader Ayatollah Ali Khamenei was killed in joint US-Israeli strikes.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/28/trump-khamenei-dead-after-us-strikes-iran",
    "timestamp": "2026-02-28T22:56:24Z"
  },
  {
    "title": "X Is Drowning in Disinformation Following US and Israel's Attack on Iran (David Gilbert/Wired)",
    "description": "David Gilbert / Wired:\nX Is Drowning in Disinformation Following US and Israel's Attack on Iran  —  WIRED has reviewed hundreds of posts on X that promote misleading claims about the locations and scale of the attack.  —  Minutes after Donald Trump announced …",
    "link": "https://www.memeorandum.com/260228/p81",
    "timestamp": "2026-02-28T22:55:01Z"
  },
  {
    "title": "Trump Confirms Ayatollah Ali Khamenei Is Dead: 'One of the Most Evil People in History'",
    "description": "President Donald Trump confirmed reports that Iranian Supreme Leader Ayatollah Ali Khamenei, \"one of the most evil people in History,\" had been killed during an Israeli strike on his compound in Tehran.\nThe post Trump Confirms Ayatollah Ali Khamenei Is Dead: …",
    "link": "https://www.breitbart.com/middle-east/2026/02/28/trump-confirms-ayatollah-ali-khamenei-is-dead-one-of-the-most-evil-people-in-history/",
    "timestamp": "2026-02-28T22:54:35Z"
  },
  {
    "title": "'Largest Military Flyover in IAF History’: 200 Israeli Jets Strike 500+ Targets Across Iran",
    "description": "Israel conducted what it described as the “largest military flyover in the history of the Israeli Air Force” on Saturday.\nThe post ‘Largest Military Flyover in IAF History’: 200 Israeli Jets Strike 500+ Targets Across Iran appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/28/largest-military-flyover-iaf-history-200-jets-strike-500-targets-iran/",
    "timestamp": "2026-02-28T22:50:22Z"
  },
  {
    "title": "Iranian Crown Prince: Regime successor to Khamenei ‘doomed to fail’",
    "description": "After President Trump confirms Khamenei’s elimination, Reza Pahlavi urges security forces to abandon the regime and calls for decisive action in the streets.",
    "link": "https://www.israelnationalnews.com/news/423136",
    "timestamp": "2026-02-28T22:49:04Z"
  },
  {
    "title": "Trump’s ‘America First’ campaign battle cry gives way to military strikes abroad",
    "description": "Trump’s decision to strike Iran pulls him toward the kind of conflict he once attacked.",
    "link": "https://www.bostonherald.com/2026/02/28/trump-military-intervention/",
    "timestamp": "2026-02-28T22:48:15Z"
  },
  {
    "title": "The Latest: Trump says Iranian Supreme Leader Ali Khamenei is dead",
    "description": "Iranian Supreme Leader Ayatollah Ali Khamenei was killed in a major attack on Iran launched by Israel and the United States, President Donald Trump said, calling it the “single greatest chance” for the Iranian people to “take back” their country.The death occ…",
    "link": "https://freerepublic.com/focus/f-news/4368749/posts",
    "timestamp": "2026-02-28T22:47:34Z"
  },
  {
    "title": "Joe Biden Warns U.S. Trump Will Try To Steal Election",
    "description": "Joe Biden has warned that Trump will attempt to “steal” the midterm elections, in what for him is a rare public address.\nHe was being honored in South Carolina for his lifetime achievement in politics. Biden also said the US is experiencing “dark days”, in a …",
    "link": "https://crooksandliars.com/2026/02/joe-biden-warns-us-trump-will-try-steal",
    "timestamp": "2026-02-28T22:47:20Z"
  },
  {
    "title": "Bombing expected for days as Donald Trump says Iran’s Supreme Leader is dead",
    "description": "Supreme Leader Ayatollah Ali Khamenei has died in a major attack on Iran launched by Israel and the United States, Donald Trump has said.",
    "link": "https://www.independent.ie/world-news/bombing-expected-for-days-as-donald-trump-says-irans-supreme-leader-is-dead/a520805842.html",
    "timestamp": "2026-02-28T22:46:19Z"
  },
  {
    "title": "Iran Likely To Pull Out From World Cup After U.S. Airstrikes, Death Of Supreme Leader Ayatollah Ali Khamenei",
    "description": "It doesn’t appear Iran will be coming to the United States for the World Cup this season. On Saturday morning, the United States and Israel delivered a surprise attack on Iran that killed from top level Iranian leaders. According to reports from Israel, Iran’…",
    "link": "https://brobible.com/sports/article/iran-likely-to-pull-out-from-world-cup/",
    "timestamp": "2026-02-28T22:44:32Z"
  },
  {
    "title": "Donald Trump says Ayatollah Ali Khamenei killed in US-Israel strike on Iran",
    "description": "Trump claims Khamenei killed in US-Israel strikes on Iran. Tehran retaliates with missiles as fears of regime crisis and wider Middle East war grow.",
    "link": "https://www.thehindubusinessline.com/news/world/donald-trump-says-ayatollah-ali-khamenei-killed-in-us-israel-strike-on-iran/article70689547.ece",
    "timestamp": "2026-02-28T22:43:27Z"
  },
  {
    "title": "Trump says Iranian Supreme Leader Ali Khamenei killed in U.S.-Israeli strikes",
    "description": "President Donald Trump said on social media Saturday that Iran's Supreme Leader Ali Khamenei is dead, saying his passing is \"the single greatest chance for the Iranian people to take back their Country.\"",
    "link": "https://www.pbs.org/newshour/world/trump-says-iranian-supreme-leader-ali-khamenei-killed-in-u-s-israeli-strikes",
    "timestamp": "2026-02-28T22:43:08Z"
  },
  {
    "title": "As Trump Bombs Iran, We Need to Reckon With the American War Machine",
    "description": "We cannot afford to slip into despair. We must push back against militarism everywhere, at every turn.",
    "link": "https://truthout.org/articles/as-trump-bombs-iran-we-need-to-reckon-with-the-american-war-machine/",
    "timestamp": "2026-02-28T22:41:08Z"
  },
  {
    "title": "X Is Drowning in Disinformation Following US and Israel’s Attack on Iran",
    "description": "WIRED has reviewed hundreds of posts on X that promote misleading claims about the locations and scale of the attack.",
    "link": "https://www.wired.com/story/x-is-drowning-in-disinformation-following-us-and-israels-attack-on-iran/",
    "timestamp": "2026-02-28T22:40:53Z"
  },
  {
    "title": "Martina Navratilova calls Trump 'psychopath' for Iran strikes but says Khamenei’s death is ‘good news’",
    "description": "Tennis legend Martina Navratilova called President Donald Trump a \"psychopath\" over the strikes in Iran while supporting Iranian Supreme Leader Ali Khamenei's death.",
    "link": "https://www.foxnews.com/sports/martina-navratilova-calls-trump-psychopath-iran-strike-supports-killing-supreme-leader-khamenei",
    "timestamp": "2026-02-28T22:39:17Z"
  },
  {
    "title": "President Connolly calls for immediate diplomacy following strikes in Middle East",
    "description": "Irish citizens should not undertake travel to Iran, Minister says",
    "link": "https://www.irishtimes.com/politics/2026/02/28/president-connolly-calls-for-immediate-diplomacy-following-middle-east-military-strikes/",
    "timestamp": "2026-02-28T22:38:58Z"
  },
  {
    "title": "Trump Says Iranian Supreme Leader Is Dead",
    "description": "Iran has not confirmed Ayatollah Ali Khamenei’s death.",
    "link": "http://foreignpolicy.com/2026/02/28/trump-iran-khamenei-dead-ayatollah-supreme-leader/",
    "timestamp": "2026-02-28T22:37:19Z"
  },
  {
    "title": "WATCH LIVE: War with Iran | PBS News Special Report",
    "description": "A major U.S.-Israeli attack on Iran killed the country's Supreme Leader Ali Khamenei, President Donald Trump said, in \"major combat operations\" that followed weeks of rising tensions over Iran's nuclear program.",
    "link": "https://www.pbs.org/newshour/world/watch-live-war-with-iran-pbs-news-special-report",
    "timestamp": "2026-02-28T22:36:38Z"
  },
  {
    "title": "Starmer is cautious on Iran because he knows the chaos Trump's strikes could trigger",
    "description": "Sir Keir Starmer is treading a characteristically cautious diplomatic path in his response to the attacks on Iran by the US and Israel.",
    "link": "https://news.sky.com/story/starmer-is-cautious-on-iran-because-he-knows-the-chaos-trumps-strikes-could-trigger-13513689",
    "timestamp": "2026-02-28T22:36:00Z"
  },
  {
    "title": "UN Chief Condemns US-Israeli Attacks On Iran During Emergency Security Council Meeting",
    "description": "Israel’s U.N. Ambassador Danny Danon, speaking to reporters before the meeting, said it was “hypocrisy” to condemn the airstrikes.",
    "link": "https://www.huffpost.com/entry/united-nations-chief-condemns-us-israeli-attacks-on-iran-during-emergency-security-council-meeting_n_69a36ccbe4b008ee6ce236f9",
    "timestamp": "2026-02-28T22:35:00Z"
  },
  {
    "title": "Fact-Checking Trump’s Justifications for Attacking Iran - The New York Times",
    "description": "Fact-Checking Trump’s Justifications for Attacking IranThe New York Times Trump advisers scramble to justify possible US military intervention in IranThe Guardian Trump’s Chaotic and Reckless Iran Nuclear PolicyArms Control Association Why now? Donald Trump’s…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180875018",
    "timestamp": "2026-02-28T22:32:45Z"
  },
  {
    "title": "Trump declares Khamenei dead, offers immunity to ayatollah’s supporters if they stopped fighting",
    "description": "President Trump confirmed the death of Ayatollah Ali Khamenei in the American-Israeli airstrikes on Tehran, calling it \"justice.\"",
    "link": "https://nypost.com/2026/02/28/us-news/president-trump-announces-irans-ayatollah-ali-khamenei-is-dead-justice/",
    "timestamp": "2026-02-28T22:29:23Z"
  },
  {
    "title": "Mamdani, Harris condemn strikes on Iran",
    "description": "NYC mayor and former vice president denounce joint US-Israeli strikes on Iran as 'reckless escalation' and 'a war of choice.'",
    "link": "https://www.israelnationalnews.com/news/423134",
    "timestamp": "2026-02-28T22:26:45Z"
  },
  {
    "title": "UN chief condemns U.S.-Israeli attacks on Iran during emergency Security Council meeting",
    "description": "The United Nations chief condemned the U.S.-Israeli airstrikes on Iran and called for an immediate return to negotiations \"to pull the region, and our world, back from the brink.\"",
    "link": "https://www.pbs.org/newshour/world/un-chief-condemns-u-s-israeli-attacks-on-iran-during-emergency-security-council-meeting",
    "timestamp": "2026-02-28T22:25:03Z"
  },
  {
    "title": "Defense Minister: Any enemy who tries to interfere will pay a heavy price",
    "description": "Defense Minister Israel Katz stresses goal of Iran strike to remove 'immediate threat' to Israel's security, global and regional stability.",
    "link": "https://www.israelnationalnews.com/news/423131",
    "timestamp": "2026-02-28T22:25:00Z"
  },
  {
    "title": "Dozens of top Iranian regime officials, supreme leader killed in Israeli strikes",
    "description": "An Israeli strike killed dozens of members of the Iranian leadership, including the ayatollah during surprise Saturday morning strikes in Tehran, U.S. and Israeli officials confirmed.",
    "link": "https://www.foxnews.com/world/dozens-top-iranian-regime-officials-supreme-leader-killed-israeli-strikes",
    "timestamp": "2026-02-28T22:24:24Z"
  },
  {
    "title": "Jewish leaders back decisive action against Iran",
    "description": "Leaders of the Conference of Presidents of Major American Jewish Organizations issued a statement supporting the USA and Israel in their attacks against Iran.",
    "link": "https://www.israelnationalnews.com/news/423132",
    "timestamp": "2026-02-28T22:21:44Z"
  },
  {
    "title": "Ayatollah Ali Khamenei: The leader who shaped Iran’s defiance",
    "description": "The supreme leader of the Islamic Republic of Iran, has been killed in a joint US-Israeli air strikes on Saturday.",
    "link": "https://www.aljazeera.com/news/2026/2/28/ayatollah-ali-khamenei-the-leader-who-shaped-irans-defiance",
    "timestamp": "2026-02-28T22:20:41Z"
  },
  {
    "title": "What countries has Trump attacked since returning to office?",
    "description": "The US president, who had said he would avoid needless foreign wars, has embraced military power with few limits.",
    "link": "https://www.aljazeera.com/news/2026/2/28/what-countries-has-trump-attacked-since-returning-to-office",
    "timestamp": "2026-02-28T22:20:01Z"
  },
  {
    "title": "Iran's Supreme Leader, Ayatollah Ali Khamenei, Is Reported Dead",
    "description": "Khamenei's rule was marked by a combination of cruelty and incompetence. His death may have unfolded much the same way.",
    "link": "https://reason.com/2026/02/28/irans-supreme-leader-ayatollah-ali-khamenei-is-reported-dead/",
    "timestamp": "2026-02-28T22:19:26Z"
  },
  {
    "title": "US officials reveal the urgency behind ‘Operation Epic Fury’ attack on Iran",
    "description": "Iran posed an “intolerable risk” to the U.S. with its missile threat and, during negotiations, wouldn’t accept “free nuclear fuel forever” – all of which led up to Saturday’s attack on Tehran.…",
    "link": "https://nypost.com/2026/02/28/us-news/us-officials-reveal-the-urgency-behind-operation-epic-fury-attack-on-iran/",
    "timestamp": "2026-02-28T22:19:18Z"
  },
  {
    "title": "Fox’s Mark Levin: Killing Khamenei Is ‘Like Hitler’ Dying — A ‘Massive Success’ for Trump",
    "description": "Fox News anchor Mark Levin was absolutely stoked Iranian Supreme Leader Ali Khamenei was killed on Saturday, saying it was \"like Hitler\" had been eliminated\nThe post Fox’s Mark Levin: Killing Khamenei Is ‘Like Hitler’ Dying — A ‘Massive Success’ for Trump fir…",
    "link": "https://www.mediaite.com/media/foxs-mark-levin-killing-khamenei-is-like-hitler-dying-a-massive-success-for-trump/",
    "timestamp": "2026-02-28T22:18:26Z"
  },
  {
    "title": "Ticker: Retail customers file lawsuits over tariffs against FedEx and Ray-Bans maker",
    "description": "At least two retail customers pursuing tariff-related refunds have filed proposed class-action lawsuits in U.S. courts against companies that also sued to recoup costs from President Trump's tariffs.",
    "link": "https://www.bostonherald.com/2026/02/28/ticker-retail-customers-file-lawsuits-over-tariffs-against-fedex-and-ray-bans-maker/",
    "timestamp": "2026-02-28T22:16:15Z"
  },
  {
    "title": "Iran's Supreme Leader Khamenei is dead, state media confirms",
    "description": "Following US and Israeli strikes on Tehran, Iran state media confirmed the death of Ali Khamenei. DW has more.",
    "link": "https://www.dw.com/en/irans-supreme-leader-khamenei-is-dead-state-media-confirms/live-76161011",
    "timestamp": "2026-02-28T22:16:00Z"
  },
  {
    "title": "Officials Say Trump Preempted Iranian Strike to Prevent ‘Serious’ Casualties; Iran Was Rebuilding Nuclear Program",
    "description": "As joint U.S.-Israeli military operations continued against Iranian targets, Breitbart News Washington Bureau Chief Matt Boyle relayed statements from senior administration officials who described intelligence assessments behind President Donald Trump’s decis…",
    "link": "https://www.breitbart.com/politics/2026/02/28/officials-say-trump-preempted-iranian-strike-to-prevent-serious-casualties-iran-was-rebuilding-nuclear-program/",
    "timestamp": "2026-02-28T22:15:28Z"
  },
  {
    "title": "Trump calls death of Ayatollah Ali Khamenei the ‘single greatest chance for the Iranian people to take back their Country’",
    "description": "The assassination of the second leader of the Islamic Republic, who had no designated successor, would throw its future into doubt and raise the prospect of a protracted conflict.",
    "link": "https://fortune.com/2026/02/28/trump-death-supreme-leader-ayatollah-ali-khamenei-regime-overthrow/",
    "timestamp": "2026-02-28T22:15:17Z"
  },
  {
    "title": "Republicans face a 'major test of loyalty' after Trump's latest 'slap in the face'",
    "description": "Republicans in Congress will return next week to face a \"major test of loyalty\" after President Donald Trump's most recent \"slap in the face,\" a new report revealed. CNN reported on Saturday that Congress will formally debate and vote on potential military co…",
    "link": "https://www.rawstory.com/trump-iran-2675453658/",
    "timestamp": "2026-02-28T22:14:08Z"
  },
  {
    "title": "Why did Netflix back down from its deal to acquire Warner Bros.? | TechCrunch",
    "description": "Why did Netflix back down from its deal to acquire Warner Bros.? | TechCrunchtechcrunch.com",
    "link": "https://techcrunch.com/2026/02/28/why-did-netflix-back-down-from-its-deal-to-acquire-warner-bros/",
    "timestamp": "2026-02-28T22:09:39Z"
  },
  {
    "title": "John Bolton: If There Ever Were a Moment to Topple Iran, This Is It",
    "description": "Missiles streaked across the skies of the Middle East on Saturday morning as the United States and Israel began “Operation Epic Fury,” a joint operation targeting the Iranian regime—and one that President Donald Trump hopes will not only destroy the Iranian b…",
    "link": "https://freerepublic.com/focus/f-bloggers/4368745/posts",
    "timestamp": "2026-02-28T22:07:12Z"
  },
  {
    "title": "Iran’s Supreme Leader “Dead,” Trump Posts; Iran Says Not True As U.S. & Israeli Strikes Continues",
    "description": "Iran’s Supreme Leader is dead, Donald Trump has proclaimed in a lengthy social media. However, under bombardment from American and Israeli forces, the Iranian government still insists Ali Khamenei is alive, though no one has seen the much feared cleric in day…",
    "link": "http://deadline.com/2026/02/trump-iran-supreme-leader-dead-1236739723/",
    "timestamp": "2026-02-28T22:04:23Z"
  },
  {
    "title": "Trump's Healthy Pal RFK Jr. Reveals Bizarre Reason Prez Enjoys Constantly Stuffing His Face With Fast Food on the Road",
    "description": "Robert F. Kennedy Jr. explained there's a method to the madness behind why Donald Trump only eats McDonald's when not at home.",
    "link": "https://radaronline.com/p/rfk-jr-reveals-bizarre-reason-trump-eats-fast-food-mcdonalds/",
    "timestamp": "2026-02-28T22:04:21Z"
  },
  {
    "title": "Ayatollah Ali Khamenei, Iran's supreme leader, is dead, Trump says",
    "description": "President Trump confirmed the supreme leader's death in a social media post.",
    "link": "https://abcnews.com/International/ayatollah-ali-khamenei-irans-supreme-leader-dead-trump/story?id=122947671",
    "timestamp": "2026-02-28T22:01:18Z"
  },
  {
    "title": "Papers: Barca making progress over Rashford summer move",
    "description": "The top stories and transfer rumours from Sunday's newspapers...",
    "link": "https://www.skysports.com/football/transfer-paper-talk/12709/13513684/marcus-rashford-barcelona-making-progress-over-signing-manchester-united-forward-paper-talk-and-transfer-gossip",
    "timestamp": "2026-02-28T22:00:00Z"
  },
  {
    "title": "Putin’s friendship has limits — as Khamenei just found out",
    "description": "Leaders in Syria, Venezuela and now Iran have all discovered that Russian support only goes so far.",
    "link": "https://www.politico.eu/article/vladimir-putin-friendship-limits-iran-leader-khamenei-found-out/",
    "timestamp": "2026-02-28T21:58:16Z"
  },
  {
    "title": "Iran is now on ‘death ground’ amid existential threat from U.S. attacks and could ‘go big’ in retaliation, former NATO commander warns",
    "description": "With President Donald Trump calling for regime change in Iran, the country’s leadership now faces an existential threat and is likely to respond to U.S.-Israeli airstrikes accordingly, experts said.So far, the Islamic Republic appears to be launching fewer mi…",
    "link": "https://freerepublic.com/focus/f-news/4368743/posts",
    "timestamp": "2026-02-28T21:56:18Z"
  },
  {
    "title": "U.S. Backs Israel’s Assessment That Khamenei Was Killed in Airstrike",
    "description": "Iran’s Supreme Leader, Ali Khamenei, has been killed during the strikes in Iran, according to both Israel and the U.S. Following the strikes on Iran’s territory on Feb. 28, 2026, Israel and the U.S. are now saying that Iran’s Supreme Leader, Ali Khamenei, is …",
    "link": "https://theaviationist.com/2026/02/28/khamenei-killed/",
    "timestamp": "2026-02-28T21:54:46Z"
  },
  {
    "title": "Trump says Iran's Khamenei is dead",
    "description": "Feb ⁠28 (Reuters) - Iranian ⁠Supreme Leader ‌Ayatollah Ali Khamenei is ​dead, U.S. ⁠President ⁠Donald Trump said ⁠on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/03/01/trump-says-iran039s-khamenei-is-dead",
    "timestamp": "2026-02-28T21:54:00Z"
  },
  {
    "title": "My Colleague Niall Ferguson on Iran",
    "description": "From his Free Press article; Ferguson is a Senior Fellow at the Hoover Institution, a former Harvard history professor, and…\nThe post My Colleague Niall Ferguson on Iran appeared first on Reason.com.",
    "link": "https://reason.com/volokh/2026/02/28/my-colleague-niall-ferguson-on-iran/",
    "timestamp": "2026-02-28T21:52:29Z"
  },
  {
    "title": "UN chief condemns US-Israeli attacks on Iran during emergency Security Council meeting",
    "description": "He said everything must be done to prevent further escalation.",
    "link": "https://www.bostonherald.com/2026/02/28/us-attacks-iran-un-response/",
    "timestamp": "2026-02-28T21:52:28Z"
  },
  {
    "title": "Ottawa's Iranian diaspora shares hopes, fears in the wake of military strike",
    "description": "There's a mix of reactions from Iranian Canadians in Ottawa on Saturday in the wake of U.S. and Israeli airstrikes targeting their home country. Some feel the airstrikes are overdue, while some worry war won't bring peace.",
    "link": "https://www.cbc.ca/news/canada/ottawa/ottawa-s-iranian-diaspora-split-after-airstrikes-target-iran-9.7110043",
    "timestamp": "2026-02-28T21:51:45Z"
  },
  {
    "title": "BREAKING: Trump Says Khamenei Is Dead. What Happens Now in Iran?",
    "description": "President Donald Trump said that Iranian Supreme Leader Ayatollah Ali Khamenei is dead, following reports of his killing in a joint military operation conducted by... Read More\nThe post BREAKING: Trump Says Khamenei Is Dead. What Happens Now in Iran?  appeare…",
    "link": "https://www.dailysignal.com/2026/02/28/breaking-trump-says-khamenei-is-dead-what-happens-now-in-iran/",
    "timestamp": "2026-02-28T21:51:38Z"
  },
  {
    "title": "Trump confirms: Khamenei is dead",
    "description": "US President Donald Trump declares Iran’s Supreme Leader Ali Khamenei is dead, calling it justice for victims of the regime worldwide and promising military pressure will continue.",
    "link": "https://www.israelnationalnews.com/news/423130",
    "timestamp": "2026-02-28T21:50:00Z"
  },
  {
    "title": "Iran’s Foreign Ministry defends retaliatory strikes, slams US betrayal",
    "description": "Spokesman Esmaeil Baghaei says Iran's attacks on US targets across the region are legitimate defensive actions.",
    "link": "https://www.aljazeera.com/news/2026/2/28/irans-foreign-ministry-defends-retaliatory-strikes-slams-us-betrayal",
    "timestamp": "2026-02-28T21:49:24Z"
  },
  {
    "title": "FBI raises terrorism alert over fears of retaliation by Iran",
    "description": "In New York, the FBI and the New York Police Department’s Joint Terrorism Task Force were monitoring pro-Iran groups who were active on social media.",
    "link": "https://fortune.com/2026/02/28/fbi-us-terrorism-high-alert-iran-retaliation-kash-patel-dhs/",
    "timestamp": "2026-02-28T21:49:07Z"
  },
  {
    "title": "‘Khamenei…is Dead’: Donald Trump Confirms Death of Iran’s Supreme Leader",
    "description": "President Donald Trump declared via Truth Social on Saturday, \"Khamenei, one of the most evil people in History, is dead.\"\nThe post ‘Khamenei…is Dead’: Donald Trump Confirms Death of Iran’s Supreme Leader first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/khameni-is-dead-donald-trump-confirms-death-of-irans-supreme-leader/",
    "timestamp": "2026-02-28T21:49:05Z"
  },
  {
    "title": "Trump says Iranian Supreme Leader Ayatollah Khamenei was killed during strikes on Iran",
    "description": "Ayatollah Khamenei led Iran for nearly four decades before he was killed in a joint campaign by the US and Israel on Saturday.",
    "link": "https://www.businessinsider.com/trump-says-iran-ayatollah-khamenei-dead-after-us-israel-strikes-2026-2",
    "timestamp": "2026-02-28T21:48:45Z"
  },
  {
    "title": "Trump Says Iranian Supreme Leader Ali Khamenei Is Dead",
    "description": "President Donald Trump called Iranian Supreme Leader Ali Khamenei \"one of the most evil people in history.\"",
    "link": "https://www.huffpost.com/entry/trump-says-khamenei-dead_n_69a1f94fe4b022e3a5587eab",
    "timestamp": "2026-02-28T21:48:25Z"
  },
  {
    "title": "Iran Supreme Leader Ali Khamenei Killed in U.S.-Israeli Strikes",
    "description": "The Ayatollah’s assassination marks a turning point for Iran, raising uncertainty over future tensions with Israel and Washington.",
    "link": "https://time.com/7381829/iran-supreme-leader-ali-khamenei-dead/",
    "timestamp": "2026-02-28T21:48:11Z"
  },
  {
    "title": "'Hard to be optimistic': Expert flags 'cynical' reasons Trump ordered Iran strikes",
    "description": "A legal expert flagged a \"cynical\" reason why President Donald Trump ordered the U.S. to coordinate strikes against Iran on early Saturday morning. Jack Goldsmith, a law professor at Harvard University, argued in a new Substack essay on Saturday that Trump's …",
    "link": "https://www.rawstory.com/trump-iran-2675452224/",
    "timestamp": "2026-02-28T21:46:39Z"
  },
  {
    "title": "Winnipeggers with ties to Iran celebrate at rally after U.S., Israel launch major attack",
    "description": "Members of the Iranian diaspora living in Winnipeg celebrated in the aftermath of major attacks U.S. President Donald Trump says will topple the Iranian government.",
    "link": "https://www.cbc.ca/news/canada/manitoba/iran-israel-us-attacks-winnipeg-rally-9.7110036",
    "timestamp": "2026-02-28T21:44:43Z"
  },
  {
    "title": "Guess Ilhan, Mancini, and Tlaib will REALLY scream obscenities today",
    "description": "I mean…it’s been a rough week for them. A huge cash flow for their elections just got eradicated, apparently. Are investigations in their future?",
    "link": "https://freerepublic.com/focus/f-chat/4368742/posts",
    "timestamp": "2026-02-28T21:44:32Z"
  },
  {
    "title": "Iran’s Ayatollah Ali Khamenei ‘is gone’ – Netanyahu",
    "description": "Israeli Prime Minister Benjamin Netanyahu has announced that he believes that Iranian Supreme Leader Ayatollah Ali Khamenei is dead Read Full Article at RT.com",
    "link": "https://www.rt.com/news/633253-khamenei-gone-netanyahu/",
    "timestamp": "2026-02-28T21:38:06Z"
  },
  {
    "title": "Trump says that Iran's Supreme Leader Khamenei is dead",
    "description": "<![CDATA[ After the US and Israel launched attacks on Iran on Saturday, President Donald Trump said on social media that Iran's Ayatollah \"Khamenei, one of the most evil people in history, is dead\" ]]>",
    "link": "https://www.channelnewsasia.com/world/trump-says-irans-supreme-leader-khamenei-dead-5961081",
    "timestamp": "2026-02-28T21:37:00Z"
  },
  {
    "title": "Iran's Surpreme Leader Khamenei is dead, says Trump",
    "description": "After the US and Israel launched attacks on Iran on Saturday, President Donald Trump said on social media that Iran's Ayatollah \"Khamenei, one of the most evil people in history, is dead\".",
    "link": "https://www.channelnewsasia.com/world/trump-irans-supreme-leader-khamenei-dead-israel-attack-5961081",
    "timestamp": "2026-02-28T21:37:00Z"
  },
  {
    "title": "Trump Says He's Weighing Several ‘Off Ramps’ From Iran Strike: ‘I Can Go Long’",
    "description": "President Donald Trump told Axios it will take Iranians \"several years to recover from this attack.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-off-ramps-iran-operation-epic-fury_n_69a35153e4b0213c06760e54",
    "timestamp": "2026-02-28T21:34:58Z"
  },
  {
    "title": "FDA to offer bonus payments to staffers who complete speedy drug reviews",
    "description": "The head of the Food and Drug Administration plans to start offering bonus payments to agency drug reviewers who complete their work ahead of schedule, the latest in a flurry of changes to longstanding norms and procedures. FDA Commissioner Marty Makary descr…",
    "link": "https://japantoday.com/category/features/health/fda-to-offer-bonus-payments-to-staffers-who-complete-speedy-drug-reviews",
    "timestamp": "2026-02-28T21:33:13Z"
  },
  {
    "title": "Donald Trump Dances At Fundraiser Just Before Iran Airstrikes",
    "description": "President Donald Trump authorized a major attack on Iran Saturday, reportedly leaving hundreds dead and even more injured ... but first, he had to dance. In videos going viral online, Trump is seen dancing during a dinner at Mar-a-Lago to \"God…",
    "link": "https://www.tmz.com/2026/02/28/donald-trump-dancing-at-fundraiser-before-iran-attack/",
    "timestamp": "2026-02-28T21:32:38Z"
  },
  {
    "title": "Democrats Voice Opposition to Operation Epic Fury: Ilhan Omar Calls It 'Reckless Abuse of Power'",
    "description": "Democrat lawmakers are voicing their frustration at President Donald Trump regarding Operation Epic Fury in Iran.\nThe post Democrats Voice Opposition to Operation Epic Fury: Ilhan Omar Calls It ‘Reckless Abuse of Power’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/02/28/democrats-voice-opposition-operation-epic-fury-ilhan-omar-calls-it-reckless-abuse-power/",
    "timestamp": "2026-02-28T21:30:55Z"
  },
  {
    "title": "Twice Bombed, Still Nuclear: The Limits of Force Against Iran’s Atomic Program",
    "description": "On Feb. 28, the United States and Israel launched coordinated but separately named military campaigns against Iran — the United States under Operation Epic Fury and Israel under Operation Roaring Lion — striking Iran’s nuclear facilities, ballistic missile in…",
    "link": "https://warontherocks.com/2026/02/twice-bombed-still-nuclear-the-limits-of-force-against-irans-atomic-program/",
    "timestamp": "2026-02-28T21:28:55Z"
  },
  {
    "title": "What to know about the landmark Warner Bros. Discovery sale | TechCrunch",
    "description": "Learn more about Paramount's planned acquisition of Warner Bros. Discovery — a historic Hollywood megadeal valued at $111 billion — as it continues to develop.",
    "link": "https://techcrunch.com/2026/02/28/warner-bros-netflix-paramount-acquisition-timeline-wbd/",
    "timestamp": "2026-02-28T21:28:06Z"
  },
  {
    "title": "Kyiv says Russia accepted U.S. plan for Ukraine security guarantees",
    "description": "Russia said at recent talks in Geneva it ‌would accept the U.S. proposal for Ukraine's post-war security guarantees, Ukrainian President Volodymyr Zelenskyy's chief ‌of staff said on Saturday. &quot;At ⁠the last talks, the Russian ⁠side said ⁠for example that…",
    "link": "https://japantoday.com/category/world/kyiv-says-russia-accepted-us-plan-for-ukraine-security-guarantees",
    "timestamp": "2026-02-28T21:27:03Z"
  },
  {
    "title": "Kyiv says Russia accepted US plan for Ukraine security guarantees",
    "description": "KYIV, Feb 28 (Reuters) - ⁠Russia said at recent talks in Geneva it ⁠would accept the U.S. proposal for Ukraine's ‌post-war security guarantees, Ukrainian President Volodymyr Zelenskiy's chief of staff said on Saturday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/03/01/kyiv-says-russia-accepted-us-plan-for-ukraine-security-guarantees",
    "timestamp": "2026-02-28T21:27:00Z"
  },
  {
    "title": "War powers debate intensifies after Trump orders attack on Iran without approval by Congress",
    "description": "Key members of Congress are demanding a swift vote on a war powers resolution that would restrain President Donald Trump's military attack on Iran unless the administration wins their approval for what they warn is a potentially illegal campaign that risks pu…",
    "link": "https://japantoday.com/category/world/war-powers-debate-intensifies-after-trump-orders-attack-on-iran-without-congress-approval",
    "timestamp": "2026-02-28T21:26:44Z"
  },
  {
    "title": "Israeli officials say Supreme Leader Ayatollah Ali Khamenei is dead; no word from U.S. or Iran",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei has been killed in a major attack on Iran launched by Israel and the United States, Israeli officials told The Associated Press on Saturday. There was no immediate comment from the U.S. or Iran on his status. The a…",
    "link": "https://japantoday.com/category/world/Israeli-officials-say-Supreme-Leader-Ayatollah-Ali-Khamenei-is-dead-no-word-from-U.S.-or-Iran",
    "timestamp": "2026-02-28T21:26:28Z"
  }
]