[
  {
    "title": "WATCH: Matt Gaetz reveals ‘most masculine’ constituency for Dems",
    "description": "'Who's left in the Democratic Party are like the beta males, the unsuccessful males, the angry pitbull-adopting lesbians and then the transsexuals'",
    "link": "https://www.wnd.com/2025/05/watch-matt-gaetz-reveals-most-masculine-constituency-for-dems/",
    "timestamp": "2025-05-07T13:03:18Z"
  },
  {
    "title": "Eastern Europe bets on Trump – but at what cost?",
    "description": "Eastern Europe’s love affair with Trump runs deep - but economic fallout may soon cool the romance.",
    "link": "https://www.aljazeera.com/opinions/2025/5/7/eastern-europe-bets-on-trump-but-at-what-cost",
    "timestamp": "2025-05-07T13:02:31Z"
  },
  {
    "title": "Trump’s order to quicken US drug-making plant approvals will not impact Indian pharma industry: Uday Bhaskar",
    "description": "Focus of order probably more on patented medicines imported from countries like Germany, Switzerland and Ireland, according to AIDCOC training academy director Uday Bhaskar",
    "link": "https://www.thehindubusinessline.com/economy/trumps-order-to-quicken-us-drug-making-plant-approvals-will-not-impact-indian-pharma-industry-uday-bhaskar/article69548877.ece",
    "timestamp": "2025-05-07T13:02:15Z"
  },
  {
    "title": "Rick Caruso Warns: Los Angeles at 'Tipping Point' of Failure; Only 31 Rebuilding Permits Approved",
    "description": "Developer Rick Caruso warned Wednesday that Los Angeles is at the \"tipping point\" of failure in the effort to recover from the Palisades Fire, adding that the private sector should be given a greater role in the recovery.\nThe post Rick Caruso Warns: Los Angel…",
    "link": "https://www.breitbart.com/politics/2025/05/07/rick-caruso-warns-los-angeles-at-tipping-point-of-failure-private-sector-must-lead-31-permits/",
    "timestamp": "2025-05-07T13:01:48Z"
  },
  {
    "title": "‘Stop The Jingoism!’ CNN’s Scott Jennings Scolded On-Air For Boasting ‘We’re the Most Significant Country’",
    "description": "Scott Jennings was scolded by a fellow panelist and told to \"stop the jingoism\" when he boasted the United States is \"the most significant country\" for trade.\nThe post ‘Stop The Jingoism!’ CNN’s Scott Jennings Scolded On-Air For Boasting ‘We’re the Most Signi…",
    "link": "https://www.mediaite.com/news/stop-the-jingoism-cnns-scott-jennings-scolded-on-air-for-boasting-were-the-most-significant-country/",
    "timestamp": "2025-05-07T13:01:15Z"
  },
  {
    "title": "D.C. Protestors Rally for Embattled National African American Museum, Sotheby’s Halts Controversial Buddha Gem Sale: Morning Links for May 7, 2025",
    "description": "Sotheby’s has postponed a controversial Buddha gem sale, D.C. protestors come out for Smithsonian African American Museum, and more.",
    "link": "https://www.artnews.com/art-news/news/d-c-protestors-rally-for-embattled-national-african-american-museum-sothebys-halts-controversial-buddha-gem-sale-morning-links-for-may-7-2025-1234741021/",
    "timestamp": "2025-05-07T13:00:58Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.weau.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T13:00:36Z"
  },
  {
    "title": "Playboi Carti Claims He Was Banned From The Met Gala",
    "description": "Playboi Carti has claimed that he has been banned from attending the Met Gala meaning he would join an exclusive club including Donald Trump.",
    "link": "https://hiphopdx.com/news/playboi-carti-claims-banned-met-gala",
    "timestamp": "2025-05-07T13:00:31Z"
  },
  {
    "title": "Cory Booker: ‘People Want to Know You Give a Shit’",
    "description": "New Jersey Senator Cory Booker on his record-setting speech, what he learned as mayor of Newark, and what’s next for him politically",
    "link": "http://www.rollingstone.com/politics/politics-features/cory-booker-interview-speech-newark-1235333105/",
    "timestamp": "2025-05-07T13:00:00Z"
  },
  {
    "title": "Under Trump Pressure, ABA Is Poised To Suspend Law School DEI Accreditation Standard Through August 2026",
    "description": "Reuters, Under Trump Pressure, ABA Poised to Suspend Law School DEI Rule into 2026: The American Bar Association is set to extend the suspension of its law school diversity and inclusion rule through August 2026 as the organization faces mounting pressure fro…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/05/under-trump-pressure-aba-is-poised-to-suspend-law-school-dei-accreditation-standard-into-2026.html",
    "timestamp": "2025-05-07T13:00:00Z"
  },
  {
    "title": "Profiles in Courage: In Defense of Fired Federal Workers, Cathy Harris Took on the Trump Administration—And Won",
    "description": "Profiles in Courage is a new series honoring the extraordinary women and men who have transformed American institutions through principled public service. At a time when trust in government is fragile, these stories offer a powerful reminder of what ethical l…",
    "link": "https://msmagazine.com/2025/05/07/profiles-in-courage-in-defense-of-fired-federal-workers-cathy-harris-took-on-the-trump-administration-and-won/",
    "timestamp": "2025-05-07T13:00:00Z"
  },
  {
    "title": "If You Were President For A Day, What Transportation-Related Executive Order Would You Sign?",
    "description": "What sweeping changes to transportation would you make, if you could tear up the rule book?",
    "link": "https://www.jalopnik.com/1853458/transportation-related-legislation-changes-reader-question/",
    "timestamp": "2025-05-07T13:00:00Z"
  },
  {
    "title": "Ford hikes prices on Mexico-produced models, citing tariffs",
    "description": "Ford hikes prices on Mexico-produced models, citing tariffscnbc.com",
    "link": "https://www.cnbc.com/2025/05/07/ford-hikes-prices-on-mexico-produced-models-citing-tariffs.html",
    "timestamp": "2025-05-07T12:58:44Z"
  },
  {
    "title": "US may soon deport migrants to Libya on military flight, sources say",
    "description": "Libya's Government of National Unity has said it rejected the use of Libyan territory as a destination for deporting migrants without its knowledge or consent.",
    "link": "https://www.jpost.com/international/article-853030",
    "timestamp": "2025-05-07T12:58:10Z"
  },
  {
    "title": "I may be in Fargo for Flag Day",
    "description": "Mark your calendars. Donald Trump is planning a gigantic military parade — $90 million dollars sunk into rolling tanks and missiles down Pasadena Avenue — but the rest of us should be planning to rise up in protest on Saturday, 14 June, instead. There will be…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/05/07/i-may-be-in-fargo-for-flag-day/",
    "timestamp": "2025-05-07T12:58:08Z"
  },
  {
    "title": "Secretary Sh*tfaced Ain't Need No Generals, He's Nailing This All By Himself!",
    "description": "He's a big kid now.",
    "link": "https://www.wonkette.com/p/secretary-shtfaced-aint-need-no-generals",
    "timestamp": "2025-05-07T12:55:38Z"
  },
  {
    "title": "Top Trump Crypto Buyers Vying for Dinner Seats Are Likely Foreign, Data Shows (Bloomberg)",
    "description": "Bloomberg:\nTop Trump Crypto Buyers Vying for Dinner Seats Are Likely Foreign, Data Shows  —  The majority of top holders of Donald Trump's memecoin have used foreign exchanges that say they ban US users, suggesting many purchasers are based abroad  —  More th…",
    "link": "https://www.memeorandum.com/250507/p31",
    "timestamp": "2025-05-07T12:55:00Z"
  },
  {
    "title": "India's appeal for investors dimmed but not derailed by conflict with Pakistan",
    "description": "Recent India-Pakistan tensions might affect foreign investment. However, analysts believe the impact will be limited. India's economy has little direct trade with Pakistan. Past conflicts had short-lived effects on Indian assets. Focus remains on trade deals,…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/indias-appeal-for-investors-dimmed-but-not-derailed-by-conflict-with-pakistan/articleshow/120966149.cms",
    "timestamp": "2025-05-07T12:53:56Z"
  },
  {
    "title": "HSBC launches Trump tariff payment process for US clients",
    "description": "LONDON (Reuters) -HSBC has launched a new financing tool for U.S. clients to pay import duties following the imposition of sweeping tariffs by President...",
    "link": "https://finance.yahoo.com/news/hsbc-launches-trump-tariff-payment-125306731.html",
    "timestamp": "2025-05-07T12:53:06Z"
  },
  {
    "title": "Disney parks thrive in second quarter and it adds 1.4 million new streaming subscribers",
    "description": "Disney posted solid profits and revenue in the second quarter.",
    "link": "https://www.bostonherald.com/2025/05/07/disney-results-parks-streaming/",
    "timestamp": "2025-05-07T12:52:39Z"
  },
  {
    "title": "Could Saudi Arabia be next piece of Abraham Accords puzzle?",
    "description": "For Israel, a deal with Saudi Arabia, the guardian of the holiest sites in Islam, would represent a major diplomatic success at a time of growing international criticism due to the war with Hamas.",
    "link": "https://www.jpost.com/middle-east/article-853029",
    "timestamp": "2025-05-07T12:51:48Z"
  },
  {
    "title": "As Papal Conclave Begins, Brace Yourself For More Misinformation",
    "description": "As cardinals meet in conclave to start choosing a new pope, misinformation is starting to circulate, while the Vatican takes steps to keep discussions secure.",
    "link": "https://www.forbes.com/sites/emmawoollacott/2025/05/07/as-papal-conclave-begins-brace-yourself-for-more-misinformation/",
    "timestamp": "2025-05-07T12:50:31Z"
  },
  {
    "title": "U.S.-Yemen ceasefire deal does not include attacks on Israel, says Houthi official",
    "description": "A ceasefire deal between Yemen's Houthis and the U.S. does not include sparing Israel, the group said on Wednesday, suggesting its shipping attacks that have disrupted global trade and challenged world powers will not come to a complete halt.",
    "link": "https://www.cbc.ca/news/world/yemen-united-states-houthi-deal-israel-1.7528470",
    "timestamp": "2025-05-07T12:49:45Z"
  },
  {
    "title": "Yemen's Huthis To Keep Attacking Israeli Ships Despite US Deal",
    "description": "Yemen's Huthi rebels will continue targeting Israeli ships in the Red Sea, an official told AFP on Wednesday, despite a ceasefire that ended weeks of intense US strikes on the Iran-backed group.",
    "link": "https://www.ibtimes.com/yemens-huthis-keep-attacking-israeli-ships-despite-us-deal-3772795",
    "timestamp": "2025-05-07T12:48:17Z"
  },
  {
    "title": "Republicans confirm Trump’s divisive choice to lead the Social Security Administration",
    "description": "Frank Bisignano gave his critics plenty of material to work with. Senate Republicans confirmed him as the new Social Security Administration commissioner anyway",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-confirm-trumps-divisive-choice-lead-social-security-admini-rcna205301",
    "timestamp": "2025-05-07T12:46:24Z"
  },
  {
    "title": "Trump Admin Reportedly Stepping Up Intel Gathering On Greenland As Annexation Campaign Intensifies",
    "description": "The U.S. is reportedly increasing intel gathering on Greenland as President Donald Trump keeps his annexation plans at the top of the geopolitical agenda",
    "link": "https://www.ibtimes.com/trump-admin-reportedly-stepping-intel-gathering-greenland-annexation-campaign-intensifies-3772793",
    "timestamp": "2025-05-07T12:46:12Z"
  },
  {
    "title": "Biden blasts Trump as 'foolish' appeaser of Russia, says first 100 days were no triumph",
    "description": "Former President Joe Biden was deeply critical of the first 100 days of his successor, President Donald Trump, in his first broadcast interview since leaving the White House.",
    "link": "https://www.foxnews.com/media/biden-blasts-trump-foolish-appeaser-russia-says-first-100-days-were-no-triumph",
    "timestamp": "2025-05-07T12:45:45Z"
  },
  {
    "title": "Trump-backed USD1 is now the seventh-largest stablecoin worldwide",
    "description": "USD1, the US dollar stablecoin launched by the US President Donald Trump-backed World Liberty Financial (WLFI), has become the seventh-largest stablecoin worldwide in just two months since its launch.WLFI’s snapshot vote for a USD1 airdrop proposal is underwa…",
    "link": "https://cointelegraph.com/news/trump-backed-usd1-is-now-the-seventh-largest-stablecoin-worldwide",
    "timestamp": "2025-05-07T12:45:22Z"
  },
  {
    "title": "Forget Alcatraz, Mr. President. Think Nevada",
    "description": "WASHINGTON—Forget rehabbing Alcatraz, President Donald Trump, as you proposed on social media over the weekend. It’s not worth the years and treasure that would be... Read More\nThe post Forget Alcatraz, Mr. President. Think Nevada appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/05/07/forget-alcatraz-mr-president-think-nevada/",
    "timestamp": "2025-05-07T12:45:00Z"
  },
  {
    "title": "Criminal court summons for cyclists who run red lights “excessive, unfair and offensive”, say New York’s cycling community",
    "description": "Reaction comes after New York police announces crackdown on cyclists, with many suggesting the policy could unfairly target minorities and immigrants, one cyclist even claiming it’s a way “to round up deportees”",
    "link": "https://road.cc/content/news/criminal-summons-red-light-running-new-york-cyclists-313875",
    "timestamp": "2025-05-07T12:44:57Z"
  },
  {
    "title": "58 Wallets Made Over $10 Million Apiece on Trump Meme Coin — While 764,000 Lost Money: Report",
    "description": "Exactly 58 wallets cashed in over $10 million each on President Donald Trump’s meme coin while a staggering 764,000 wallets are sitting on losses, according to a new report from Chainalysis. The Trump-themed token, $TRUMP, exploded onto the blockchain scene e…",
    "link": "https://www.mediaite.com/news/58-wallets-made-over-10-million-apiece-on-trump-meme-coin-while-764000-lost-money-report/",
    "timestamp": "2025-05-07T12:44:55Z"
  },
  {
    "title": "Breitbart News' Joel Pollak Receives 'Hero Award' for Palisades Fire Coverage",
    "description": "Breitbart News Senior Editor-at-Large and In-house Counsel Joel B. Pollak received a \"Hero Award\" from the Pali Strong Foundation for his coverage and assistance to the community during the Palisades Fire.\nThe post Breitbart News’ Joel Pollak Receives ‘Hero A…",
    "link": "https://www.breitbart.com/the-media/2025/05/07/breitbart-news-joel-pollak-receives-hero-award-for-palisades-fire-coverage/",
    "timestamp": "2025-05-07T12:40:05Z"
  },
  {
    "title": "Donald Trump can't figure out how to lie about Medicaid cuts (James Downie/MSNBC)",
    "description": "James Downie / MSNBC:\nDonald Trump can't figure out how to lie about Medicaid cuts  —  His inability to settle on a message perhaps reflects the difficulty of the sale.  —  President Donald Trump may still style himself as a D.C. outsider, but since his first…",
    "link": "https://www.memeorandum.com/250507/p28",
    "timestamp": "2025-05-07T12:40:00Z"
  },
  {
    "title": "Russia to host leaders of China and Brazil for the 80th anniversary of its World War II victory",
    "description": "Vladimir Putin is set to host heads of states for festivities marking the 80th anniversary of the defeat of Nazi Germany in World War II.",
    "link": "https://www.bostonherald.com/2025/05/07/russia-victory-day-world-leaders/",
    "timestamp": "2025-05-07T12:38:04Z"
  },
  {
    "title": "Top Trump Crypto Buyers Are Likely Foreign",
    "description": "\"More than half of the top holders of President Donald Trump’s memecoin — who are jockeying for dinner with the president — have used foreign exchanges that say they ban US users, suggesting that many",
    "link": "https://politicalwire.com/2025/05/07/top-trump-crypto-buyers-are-likely-foreign/",
    "timestamp": "2025-05-07T12:36:41Z"
  },
  {
    "title": "Trump’s trans military ban will impact thousands of people in the US armed forces",
    "description": "The US Supreme Court will allow the Trump administration to remove transgender service people from the military whilst legal challenges to the policy continue to play out in court. But how many people, exactly, will this impact? The unsigned, emergency order …",
    "link": "https://www.thepinknews.com/2025/05/07/how-many-trans-people-in-us-military-donald-trump-ban/",
    "timestamp": "2025-05-07T12:35:12Z"
  },
  {
    "title": "Addiction Took Me To Rock Bottom. So I Sold Everything I Owned And Moved Abroad For A Simpler Life.",
    "description": "“At 38, I’m feeling real joy for the first time. Not a high or a buzz, but something lasting.\"",
    "link": "https://www.huffpost.com/entry/addiction-drinking-pills-move-overseas-cambodia-buddhism_n_680b73b4e4b04aefca79efea",
    "timestamp": "2025-05-07T12:33:19Z"
  },
  {
    "title": "Indonesia’s ‘thousand friends, zero enemies’ approach sees President Subianto courting China and US",
    "description": "Negotiators from the Southeast Asian nation have been in Washington discussing Trump’s proposed tariffs.",
    "link": "https://theconversation.com/indonesias-thousand-friends-zero-enemies-approach-sees-president-subianto-courting-china-and-us-252219",
    "timestamp": "2025-05-07T12:32:51Z"
  },
  {
    "title": "Repealing the estate tax could create headaches for the rich – as well as worsen inequality",
    "description": "Only a tiny fraction of Americans are rich enough for it to matter anyway. And many wealthy taxpayers already locked their existing assets into estate plans that they can’t change.",
    "link": "https://theconversation.com/repealing-the-estate-tax-could-create-headaches-for-the-rich-as-well-as-worsen-inequality-254871",
    "timestamp": "2025-05-07T12:32:06Z"
  },
  {
    "title": "President Trump Begins Filling 46 Judicial Vacancies — Launches First Wave of Nominees to Restore Rule of Law",
    "description": "President Donald Trump has officially kicked off his next historic reshaping of the federal judiciary, announcing the first wave of six powerhouse judicial nominations to fill the current 46 lifetime vacancies on the bench. During his first term, President Tr…",
    "link": "https://www.thegatewaypundit.com/2025/05/president-trump-begins-filling-46-judicial-vacancies-launches/",
    "timestamp": "2025-05-07T12:30:28Z"
  },
  {
    "title": "Iran Reacts to Trump Renaming \"Persian Gulf\"",
    "description": "Iran's foreign minister has condemned President Trump's plan to rename the Persian Gulf, calling it a hostile move against the Iranian people.",
    "link": "https://www.newsweek.com/iran-reacts-trump-renaming-persian-gulf-2068997",
    "timestamp": "2025-05-07T12:29:01Z"
  },
  {
    "title": "Illinois Rep. Krishnamoorthi jumps into crowded Democratic race for Senate",
    "description": "Rep. Raja Krishnamoorthi, D-Ill.,is running for the senate seat held by longtime lawmaker Sen. Dick Durbin, who recently announced that he would not seek another term.",
    "link": "https://www.foxnews.com/politics/illinois-rep-krishnamoorthi-jumps-crowded-democratic-race-senate",
    "timestamp": "2025-05-07T12:29:00Z"
  },
  {
    "title": "ICAN calls for immediate de-escalation of conflict between nuclear-armed India and Pakistan",
    "description": "The International Campaign to Abolish Nuclear Weapons (Nobel Peace Prize 2017) has issued the following statement from its Executive Director, Melissa Parke:“ICAN is gravely concerned at the escalation of hostilities between India and Pakistan, particularly l…",
    "link": "https://www.commondreams.org/newswire/ican-calls-for-immediate-de-escalation-of-conflict-between-nuclear-armed-india-and-pakistan",
    "timestamp": "2025-05-07T12:28:26Z"
  },
  {
    "title": "Laura Loomer hammers Trump ally for backing Medicaid cuts",
    "description": "Far-right activist Laura Loomer is going after a prominent conservative health policy expert and former Trump administration official for his proposals to overhaul Medicaid — stoking larger intraparty tensions at a pivotal moment for negotiations over Preside…",
    "link": "https://biztoc.com/x/bec52a2f0f08af4b",
    "timestamp": "2025-05-07T12:28:19Z"
  },
  {
    "title": "ConocoPhillips (COP): Among Billionaire Mario Gabelli’s Large-Cap Stock Picks with Huge Upside Potential",
    "description": "We recently published a list of Billionaire Mario Gabelli’s 10 Large-Cap Stock Picks with Huge Upside Potential. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/conocophillips-cop-among-billionaire-mario-122733667.html",
    "timestamp": "2025-05-07T12:27:33Z"
  },
  {
    "title": "Hamas Insists On 'Comprehensive' Deal To End Gaza War",
    "description": "Hamas insisted Wednesday on a \"comprehensive\" agreement to end its war with Israel, as rescuers said Israeli bombardment of Gaza killed at least 26 people amid a growing humanitarian catastrophe.",
    "link": "https://www.ibtimes.com/hamas-insists-comprehensive-deal-end-gaza-war-3772791",
    "timestamp": "2025-05-07T12:27:22Z"
  },
  {
    "title": "Can Trump reset Iran ties, despite Israel’s best efforts to thwart it?",
    "description": "Donald Trump pushed out national security advisor because he was reportedly coordinating Iran bombing plans with Israel.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/5/7/can-trump-reset-iran-ties-despite-israels-best-efforts-to-thwart-it",
    "timestamp": "2025-05-07T12:27:15Z"
  },
  {
    "title": "Hamas Insists On 'Comprehensive' Deal To End Gaza War",
    "description": "Hamas insisted Wednesday on a \"comprehensive\" agreement to end its war with Israel, as rescuers said Israeli bombardment of Gaza killed at least 26 people amid a growing humanitarian catastrophe.",
    "link": "https://www.ibtimes.com.au/hamas-insists-comprehensive-deal-end-gaza-war-1858608",
    "timestamp": "2025-05-07T12:27:06Z"
  },
  {
    "title": "Disney parks thrive in second quarter and it adds well over 1 million streaming subscribers",
    "description": "Disney’s posted solid profits and revenue in the second quarter as its domestic theme parks thrived and the company added well over a million subscribers to its streaming service. For the three months ended March 30, Disney earned $3.28 billion, or $1.81 per …",
    "link": "https://financialpost.com/pmn/disney-parks-thrive-in-second-quarter-and-it-adds-well-over-1-million-streaming-subscribers-2",
    "timestamp": "2025-05-07T12:25:52Z"
  },
  {
    "title": "Merck & Co., Inc. (MRK): Among Billionaire Mario Gabelli’s Large-Cap Stock Picks with Huge Upside Potential",
    "description": "We recently published a list of Billionaire Mario Gabelli’s 10 Large-Cap Stock Picks with Huge Upside Potential. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/merck-co-inc-mrk-among-122532131.html",
    "timestamp": "2025-05-07T12:25:32Z"
  },
  {
    "title": "Republicans to Pay for Trump Tax Cuts With Sales of Public Land (Ari Natter/Bloomberg)",
    "description": "Ari Natter / Bloomberg:\nRepublicans to Pay for Trump Tax Cuts With Sales of Public Land  —  House Republicans have added a plan to raise billions of dollars to help pay for US President Donald Trump's massive tax cuts through the sale of thousands of acres of…",
    "link": "https://www.memeorandum.com/250507/p25",
    "timestamp": "2025-05-07T12:25:02Z"
  },
  {
    "title": "The Trump Effect: Reflections on how academic life has improved for a Jewish professor",
    "description": "How the \"Trump Effect\" has transformed campus dynamics for Jewish academics, reducing extremist disruptions and creating a more balanced environment for intellectual discourse and recognition.",
    "link": "https://www.foxnews.com/opinion/trump-effect-reflections-how-academic-life-has-improved-jewish-professor",
    "timestamp": "2025-05-07T12:24:03Z"
  },
  {
    "title": "Dell Technologies (DELL): Among Billionaire Mario Gabelli’s Large-Cap Stock Picks with Huge Upside Potential",
    "description": "We recently published a list of Billionaire Mario Gabelli’s 10 Large-Cap Stock Picks with Huge Upside Potential. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/dell-technologies-dell-among-billionaire-122358283.html",
    "timestamp": "2025-05-07T12:23:58Z"
  },
  {
    "title": "5 things to know before the stock market opens Wednesday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/05/07/5-things-to-know-before-the-stock-market-opens-wednesday-may-7.html",
    "timestamp": "2025-05-07T12:23:20Z"
  },
  {
    "title": "The Walt Disney Company (DIS): Among Billionaire Mario Gabelli’s Large-Cap Stock Picks with Huge Upside Potential",
    "description": "We recently published a list of Billionaire Mario Gabelli’s 10 Large-Cap Stock Picks with Huge Upside Potential. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/walt-disney-company-dis-among-122248381.html",
    "timestamp": "2025-05-07T12:22:48Z"
  },
  {
    "title": "PMQs: Badenoch misses open goal on India trade deal",
    "description": "The Tory leader opted not to press her party's attacks on the British-India trade deal and instead attacked Keir Starmer on winter fuel and net zero.",
    "link": "https://www.politico.eu/article/pmqs-kemi-badenoch-open-goal-india-trade-deal-keir-starmer/",
    "timestamp": "2025-05-07T12:21:54Z"
  },
  {
    "title": "Foreign Aid Official Who Resisted DOGE Took Secret Payments After Steering Africa Money To Friend",
    "description": "Part one: African Development Foundation CFO told the White House he would not acknowledge a Trump appointee as agency head. Mathieu Zahui, chief financial officer of the African Development Foundation / ADF ***************************************************…",
    "link": "https://freerepublic.com/focus/f-news/4315502/posts",
    "timestamp": "2025-05-07T12:20:58Z"
  },
  {
    "title": "Regeneron Pharmaceuticals (REGN): Among Billionaire Mario Gabelli’s Large-Cap Stock Picks with Huge Upside Potential",
    "description": "We recently published a list of Billionaire Mario Gabelli’s 10 Large-Cap Stock Picks with Huge Upside Potential. In this article, we are going to take a look...",
    "link": "https://finance.yahoo.com/news/regeneron-pharmaceuticals-regn-among-billionaire-122034782.html",
    "timestamp": "2025-05-07T12:20:34Z"
  },
  {
    "title": "'He can, in fact, be stopped': Buttigieg exhorts Democrats to show voters more in fight with Trump (MSNBC)",
    "description": "MSNBC:\n‘He can, in fact, be stopped’: Buttigieg exhorts Democrats to show voters more in fight with Trump  —  Former Transportation Secretary Pete Buttigieg talks with Jen Psaki about how Democrats can reassert their appeal to voters and take control of the c…",
    "link": "https://www.memeorandum.com/250507/p24",
    "timestamp": "2025-05-07T12:20:00Z"
  },
  {
    "title": "Conclave: Cardinals get ready to pick the new Pope",
    "description": "As of today, all telephone communications within the Vatican will be cut off and will only be restored after the announcement of the election of the new pontiff.",
    "link": "https://www.euractiv.com/section/politics/news/conclave-cardinals-get-ready-to-pick-the-new-pope/",
    "timestamp": "2025-05-07T12:18:21Z"
  },
  {
    "title": "Why the Fed is expected to keep interest rates steady: Live updates",
    "description": "Despite President Donald Trump pressing for lower interest rates, economists say the Federal Reserve will likely stick to its wait-and-see approach and hold rates steady on May 7.\nThe Fed will likely need more clarity before ending the pause, economists say. …",
    "link": "https://biztoc.com/x/5ae0d663f30effe4",
    "timestamp": "2025-05-07T12:18:17Z"
  },
  {
    "title": "Alcatraz: America's most infamous prison",
    "description": "Donald Trump has ordered the re-opening of Alcatraz, the notorious US island prison off the coast of San Francisco that was closed down over 60 years ago.\nIn a post on Truth Social, the US president said he was tasking the Federal Bureau of Prisons, the Depar…",
    "link": "https://biztoc.com/x/ba322deb8956383f",
    "timestamp": "2025-05-07T12:17:32Z"
  },
  {
    "title": "Trump, Ukraine propel EU and UK towards defence pact",
    "description": "Brussels, Belgium (AFP) May 7, 2025\n\n\n The EU and Britain look set to seal a defence pact at a landmark summit this month as worries about US President Donald Trump and the war in Ukraine spur them beyond the wrangles of Brexit. \n\nMultiple EU diplomats and of…",
    "link": "https://www.spacewar.com/reports/Trump_Ukraine_propel_EU_and_UK_towards_defence_pact_999.html",
    "timestamp": "2025-05-07T12:17:24Z"
  },
  {
    "title": "Moscow says 'no reason' to expect better German relations as Xi heads to Moscow",
    "description": "Moscow (AFP) May 7, 2025\n\n Moscow said Wednesday there were no grounds for relations with Berlin to improve under new German Chancellor Friedrich Merz and that any plans to supply Kyiv with longer-range Taurus missiles would not \"save\" Ukraine. \n\n\"Against the…",
    "link": "https://www.spacewar.com/reports/Moscow_says_no_reason_to_expect_better_Russian-German_relations_under_Merz_999.html",
    "timestamp": "2025-05-07T12:17:24Z"
  },
  {
    "title": "Dozens killed as India, Pakistan clash in worst violence in decades",
    "description": "Muzaffarabad, Pakistan (AFP) May 7, 2025\n\n India and Pakistan exchanged heavy artillery fire along their contested frontier on Wednesday after New Delhi launched deadly missile strikes on its arch-rival, in the worst violence between the nuclear-armed neighbo…",
    "link": "https://www.spacewar.com/reports/Dozens_killed_as_India_Pakistan_clash_in_worst_violence_in_decades_999.html",
    "timestamp": "2025-05-07T12:17:24Z"
  },
  {
    "title": "Sigma Price Increase Set for June 2025 Due to New U.S. Tariffs",
    "description": "If you’re planning to add a Sigma lens to your kit, you may want to act quickly. A significant Sigma price increase is coming on...\nThe post Sigma Price Increase Set for June 2025 Due to New U.S. Tariffs appeared first on DIY Photography.",
    "link": "https://www.diyphotography.net/sigma-price-increase-set-for-june-2025-due-to-new-u-s-tariffs/",
    "timestamp": "2025-05-07T12:16:16Z"
  },
  {
    "title": "Houthis say US 'backed down' and Israel not covered by ceasefire",
    "description": "A senior official rejects US President Donald Trump's claim the Yemeni group \"capitulated\" when agreeing a ceasefire deal.",
    "link": "https://www.bbc.com/news/articles/cglxl67g28no",
    "timestamp": "2025-05-07T12:14:53Z"
  },
  {
    "title": "When will interest rates go down again?",
    "description": "Interest rates, set by the Bank of England, affect mortgage, loan and savings rates for millions.",
    "link": "https://www.bbc.com/news/articles/c3dky111m40o",
    "timestamp": "2025-05-07T12:12:07Z"
  },
  {
    "title": "US may soon deport migrants to Libya - reports",
    "description": "Migrants may be flown to the troubled North African nation as part of the US' immigration crackdown.",
    "link": "https://www.bbc.com/news/articles/c5yry9y089eo",
    "timestamp": "2025-05-07T12:11:21Z"
  },
  {
    "title": "Durbin calls on DOJ to investigate anonymous pizza deliveries to judges' homes",
    "description": "Sen. Dick Durbin, D-Ill., called on the Justice Department and the FBI to open investigations into mysterious pizza deliveries sent to judges' homes.",
    "link": "https://www.foxnews.com/politics/durbin-calls-doj-investigate-anonymous-pizza-deliveries-judges-homes",
    "timestamp": "2025-05-07T12:10:20Z"
  },
  {
    "title": "Joe Biden Gives Stunning Answer When Asked If He Should Have Withdrawn Earlier",
    "description": "The former president’s interview with the BBC took a surprising turn when he looked back at the election.",
    "link": "https://www.huffpost.com/entry/joe-biden-dont-think-it-wouldve-mattered_n_681b34d1e4b0529436a1a8ae",
    "timestamp": "2025-05-07T12:09:45Z"
  },
  {
    "title": "Alcatraz: America's most infamous prison",
    "description": "Donald Trump wants to re-open notorious 'escape-proof' jail for 'most ruthless and violent prisoners' in the US",
    "link": "https://theweek.com/crime/alcatraz-americas-most-infamous-prison",
    "timestamp": "2025-05-07T12:08:00Z"
  },
  {
    "title": "China rolls out more stimulus and agrees to trade talks with the US as tariffs hit economy",
    "description": "China has rolled out a barrage of measures meant to counter the blow to its economy from U.S. President Donald Trump's trade war",
    "link": "https://abcnews.go.com/Business/wireStory/china-rolls-stimulus-agrees-trade-talks-us-tariffs-121542601",
    "timestamp": "2025-05-07T12:06:41Z"
  },
  {
    "title": "Maggie Haberman Praises Carney For Handling Trump With ‘Not For Sale’ Line Without Setting Him Off",
    "description": "Maggie Haberman said PM Mark Carney succeeded at making his point without setting President Donald Trump off when he told Trump Canada is \"not for sale.\"\nThe post Maggie Haberman Praises Carney For Handling Trump With ‘Not For Sale’ Line Without Setting Him O…",
    "link": "https://www.mediaite.com/news/maggie-haberman-praises-carney-for-handling-trump-with-not-for-sale-line-without-setting-him-off/",
    "timestamp": "2025-05-07T12:06:23Z"
  },
  {
    "title": "Trump claims three more hostages dead, but Israel insists 24 still alive",
    "description": "Discrepancy due to confirmation threshold, as families furious over learning news via press",
    "link": "https://www.jewishnews.co.uk/trump-claims-three-more-hostages-dead-but-israel-insists-24-still-alive/",
    "timestamp": "2025-05-07T12:05:43Z"
  },
  {
    "title": "US reaches truce with Houthis hours after Israel bombs their airport in Yemen",
    "description": "Israel was reportedly not notified of the ceasefire in advance",
    "link": "https://www.jewishnews.co.uk/us-reaches-truce-with-houthis-hours-after-israel-bombs-their-airport-in-yemen/",
    "timestamp": "2025-05-07T12:04:23Z"
  },
  {
    "title": "Another US fighter jet falls into sea from Truman aircraft carrier, US officials say",
    "description": "Both members of the crew ejected before the jet plunged into the water and were recovered by a rescue helicopter, the official said.",
    "link": "https://www.abc.net.au/news/2025-05-07/us-fighter-jet-falls-into-red-sea-from-aircraft-carrier/105266396",
    "timestamp": "2025-05-07T12:03:08Z"
  },
  {
    "title": "Pandora warns U.S. tariffs will spark sweeping jewelry price rises",
    "description": "Danish jewelry brand Pandora warned of significant price rises in the affordable jewelry industry if President Donald Trump's proposed tariff hikes take effect.",
    "link": "https://www.cnbc.com/2025/05/07/pandora-warns-us-tariffs-will-spark-sweeping-jewelry-price-rises.html",
    "timestamp": "2025-05-07T12:02:01Z"
  },
  {
    "title": "U.S. may soon deport migrants to Libya on military flight, sources say",
    "description": "President Donald Trump's administration may deport migrants to Libya for the first time this week, three U.S. officials said on Tuesday, as part of his immigration crackdown.",
    "link": "https://nypost.com/2025/05/07/world-news/u-s-may-soon-deport-migrants-to-libya-on-military-flight-sources-say/",
    "timestamp": "2025-05-07T12:01:50Z"
  },
  {
    "title": "ATF agents discussed new suppressors on site they thought was private",
    "description": "by Lee Williams  Why do ATF agents need new suppressors for their ARs? No one was willing to answer this simple question, not the private company making the silencers and certainly not the ATF.  However, ATF agents themselves were discussing the new silencers…",
    "link": "https://www.thetruthaboutguns.com/atf-suppressor-rollout-huxwrx-budget-cuts/",
    "timestamp": "2025-05-07T12:01:20Z"
  },
  {
    "title": "Colorado economists question the goals, approach of U.S. tariffs",
    "description": "President Donald Trump has said tariffs he has imposed on countries around the world will bring \"jobs and factories roaring back\" to the U.S. but two local economists are skeptical.",
    "link": "https://www.denverpost.com/2025/05/07/colorado-economists-tariffs-manufacturing/",
    "timestamp": "2025-05-07T12:00:53Z"
  },
  {
    "title": "‘Made in USA’ gives edge to Denver manufacturer, but doesn’t spare it effects of tariffs",
    "description": "Denver-based Hercules Industries, which has been making its HVAC products domestically since 1962, is paying more for its steel, but it's holding off on raising customers' prices in hopes of picking up business.",
    "link": "https://www.denverpost.com/2025/05/07/hercules-industries-denver-manufacturing-tariffs/",
    "timestamp": "2025-05-07T12:00:41Z"
  },
  {
    "title": "Op-Ed: It’s an all-American fiasco. The world isn’t hanging around to see what happens.",
    "description": "You idiots. Get your butts in gear and back into the 21st century with the rest of the world.\nThe post Op-Ed: It’s an all-American fiasco. The world isn’t hanging around to see what happens. appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/op-ed-its-an-all-american-fiasco-the-world-isnt-hanging-around-to-see-what-happens/article",
    "timestamp": "2025-05-07T12:00:36Z"
  },
  {
    "title": "What Time Is Joe And Jill Biden’s Interview On ‘The View’? How To Watch",
    "description": "Former President Joe Biden and Dr. Jill Biden are appearing on \"The View\" in their first interview since Joe Biden left office. What time will the interview be and where can you see it?",
    "link": "https://www.forbes.com/sites/timlammers/2025/05/07/what-time-is-joe-and-jill-bidens-interview-on-the-view-how-to-watch/",
    "timestamp": "2025-05-07T12:00:28Z"
  },
  {
    "title": "Wait, Partiful’s Founders Worked at Palantir?",
    "description": "The RSVP app was started by alumni of the controversial data-analytics firm that’s helping Trump track and deport immigrants.",
    "link": "http://www.thecut.com/article/wait-partifuls-founders-worked-at-palantir.html",
    "timestamp": "2025-05-07T12:00:26Z"
  },
  {
    "title": "UK Clean Power Goal Slips Further Out of Reach After Wind Farm Axed",
    "description": "The UK’s goal of having a clean power grid by 2030 is looking even more difficult to achieve after Denmark’s Orsted A/S canceled plans to build a massive wind farm in the North Sea on Wednesday.",
    "link": "https://financialpost.com/pmn/business-pmn/uk-clean-power-goal-slips-further-out-of-reach-after-wind-farm-axed",
    "timestamp": "2025-05-07T12:00:15Z"
  },
  {
    "title": "Is this the end of free parking in Balboa Park?",
    "description": "Options abound for paid parking systems in Balboa Park meant to help the city’s budget shortfall. And San Diego County is also looking for budget solutions, this time toward its reserve. Also, part one of a two-part story looking at the Trump Administration’s…",
    "link": "https://www.kpbs.org/podcasts/san-diego-news-now/is-this-the-end-of-free-parking-in-balboa-park",
    "timestamp": "2025-05-07T12:00:00Z"
  },
  {
    "title": "Lance Wallnau Mobilizes Prayer To 'Defeat The Judicial Activism' That Is Thwarting Trump's Lawlessness",
    "description": "Christian nationalist Trump cultist Lance Wallnau urges Christians to pray to \"defeat the judicial activism\" that is thwarting Trump and calls on God to change the hearts of Supreme Court justices who have ruled against the administration.",
    "link": "https://www.peoplefor.org/rightwingwatch/lance-wallnau-mobilizes-prayer-defeat-judicial-activism-thwarting-trumps-lawlessness",
    "timestamp": "2025-05-07T12:00:00Z"
  },
  {
    "title": "Day 1,169 of WW3. Helsinki Commission realizes the bloody obvious and says russia is committing genocide. 205 POWs return to Ukraine, and Moscow releases the target/guest list for the Victory Day parade. This is your Wednesday Ukraine War thread [News]",
    "description": "Day 1,169 of WW3. Helsinki Commission realizes the bloody obvious and says russia is committing genocide. 205 POWs return to Ukraine, and Moscow releases the target/guest list for the Victory Day parade. This is your Wednesday Ukraine War thread",
    "link": "https://www.fark.com/comments/13661816/Day-1169-of-WW3-Helsinki-Commission-realizes-bloody-obvious-says-russia-is-committing-genocide-205-POWs-return-to-Ukraine-Moscow-releases-targetguest-list-for-Victory-Day-parade-This-is-your-Wednesday-Ukraine-War-thread",
    "timestamp": "2025-05-07T12:00:00Z"
  },
  {
    "title": "Trump’s Rumble on Sesame Street",
    "description": "President Donald Trump has fought plenty of political heavyweights, but now he’s up against a foe far tougher than Hillary Clinton or Kamala Harris: Big... Read More\nThe post Trump’s Rumble on Sesame Street appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/07/trumps-rumble-sesame-street-npr/",
    "timestamp": "2025-05-07T12:00:00Z"
  },
  {
    "title": "IVF Treatment Faces Threats from ‘Fetal Personhood’ Laws That Would Grant Fetuses Legal Rights",
    "description": "In the new book Personhood, historian and law professor Mary Ziegler explores how the push to grant embryos and fetuses full legal rights is reshaping U.S. reproductive health care, research and policy",
    "link": "https://www.scientificamerican.com/article/ivf-treatment-faces-threats-from-fetal-personhood-laws-that-would-grant/",
    "timestamp": "2025-05-07T12:00:00Z"
  },
  {
    "title": "Thank Trump for not getting your dolls: US Treasury Secretary tells girls amid ongoing trade war with China",
    "description": "US President Donald Trump recently faced backlash for repeatedly saying in recent days that children can get by with fewer dolls this year if his sweeping tariff policies drive up living costs for families. Trump's US Treasury Secretary Scott has now come out…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/thank-trump-for-not-getting-your-dolls-us-treasury-secretary-tells-girls-amid-ongoing-trade-war-with-china/articleshow/120964887.cms",
    "timestamp": "2025-05-07T11:59:41Z"
  },
  {
    "title": "Forbes Daily: AI Models Are Hallucinating More Despite Advancements",
    "description": "Today's Forbes Daily newsletter covers the REAL ID requirement, India strikes Pakistan, Amazon-owned robotaxi recall, Trump's grip on his business empire and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/05/07/forbes-daily-ai-models-are-hallucinating-more-despite-advancements/",
    "timestamp": "2025-05-07T11:59:29Z"
  },
  {
    "title": "Trump’s Tariffs Undermine Hollywood’s Soft Power and Boost Foreign Film Industries",
    "description": "US President Donald Trump’s dramatic tariffs, created to allegedly restore the strength of the American industry, may have the opposite effect in one of the country’s most powerful areas: media and entertainment. Tariffs will harm America’s film industry Alth…",
    "link": "https://www.fairobserver.com/politics/trumps-tariffs-undermine-hollywoods-soft-power-and-boost-foreign-film-industries/",
    "timestamp": "2025-05-07T11:58:07Z"
  },
  {
    "title": "Trump Eases Auto Tariffs, Auto Makers 'Welcome And Appreciate' The Move",
    "description": "In This Article:\n-\nPresident Donald Trump eased auto tariffs with an executive order and proclamation on Tuesday\n-\nWhile not a permanent rollback, the changes are intended to give U.S. auto companies \"a little bit of a break\"\n-\nAuto companies like Ford and St…",
    "link": "https://biztoc.com/x/0a1a26ceaa25653c",
    "timestamp": "2025-05-07T11:55:52Z"
  },
  {
    "title": "DOGE cuts at IRS are ‘Christmas coming early’ for tax cheats, policy analyst says",
    "description": "President Donald Trump says he wants to close the federal budget deficit, but his administration is slashing staffing at the agency that collects the government’s money. \nEarly rounds of cuts at the Internal Revenue Service have eliminated nearly one-third of…",
    "link": "https://biztoc.com/x/f07fac4b4a5cfd7c",
    "timestamp": "2025-05-07T11:55:12Z"
  },
  {
    "title": "Government in 'active discussions' with US over film tariffs",
    "description": "The government is in \"active discussions\" with top officials in the White House about Donald Trump's film tariffs, a minister has said.",
    "link": "https://news.sky.com/story/government-in-active-discussions-with-us-over-film-tariffs-as-starmer-urged-to-stand-up-to-trump-13363295",
    "timestamp": "2025-05-07T11:55:00Z"
  },
  {
    "title": "Trump is desperate for a boost from the Fed. Here are 2 reasons the bank's hands may be tied",
    "description": "President Donald Trump has called for the Fed to cut rates, but the central bank is in a tough spot.\n- One-year inflation expectations are surging, while data doesn't yet indicate a cut is needed.\nPresident Donald Trump has been making increasingly urgent cal…",
    "link": "https://biztoc.com/x/550fee61d655a64b",
    "timestamp": "2025-05-07T11:54:56Z"
  },
  {
    "title": "Biden calls Trump’s pressure on Ukraine ‘modern-day appeasement’ in 1st post-presidential interview",
    "description": "Biden also said that Trump's statements about acquiring Panama, Greenland and Canada have bred distrust in Europe.",
    "link": "https://www.bostonherald.com/2025/05/07/biden-trump-modern-day-appeasement/",
    "timestamp": "2025-05-07T11:54:31Z"
  }
]