[
  {
    "title": "US Student Visa Pause: What Interviews Are Impacted",
    "description": "The Trump administration is also considering a policy requiring foreign student visa applicants to undergo social media screening.",
    "link": "https://www.newsweek.com/us-student-visa-pause-interview-2077963",
    "timestamp": "2025-05-28T14:59:00Z"
  },
  {
    "title": "Fox News Host Roasts Trump's Mornings: 'Wake Up, Watch Cable News, Create Chaos, Watch The Futures Tank'",
    "description": "Fox News co-host Jessica Tarlov took a swipe at President Donald Trump on X recently, mocking his “morning schedule” as he continues to publicly threaten individual companies like Apple (NASDAQ:AAPL) with tariffs. \nTrump recently warned that he would impose a…",
    "link": "https://biztoc.com/x/6b1c9eead0e404ef",
    "timestamp": "2025-05-28T14:56:33Z"
  },
  {
    "title": "JD Vance accuses courts of trying to ‘literally overturn’ the will of American voters",
    "description": "It is not the job of the courts to defer to a branch of government based on election results. JD Vance apparently finds this confusing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/jd-vance-accuses-courts-trying-literally-overturn-will-american-voters-rcna209442",
    "timestamp": "2025-05-28T14:56:31Z"
  },
  {
    "title": "Trump Family's Expanding Crypto Ties Raise Questions On Ethics, Influence, And Investor Risk",
    "description": "The Trump family's growing engagement with the cryptocurrency world has triggered increasing scrutiny, with projects involving everything from meme coins and NFTs to stablecoins and DeFi ventures, many of which are raising ethical and regulatory questions.\nWh…",
    "link": "https://biztoc.com/x/d6be9c1149ed7a6a",
    "timestamp": "2025-05-28T14:56:19Z"
  },
  {
    "title": "Toyota moves production of popular US sedan to Britain",
    "description": "President Donald Trump made tariffs the focal point of his administration's economic policy during the first year of his second non-consecutive term in office. \nAlthough the duties have been unpredictable and unpopular with much of the business community, the…",
    "link": "https://biztoc.com/x/2badc907790f3e4b",
    "timestamp": "2025-05-28T14:56:02Z"
  },
  {
    "title": "A judge refuses to toss states' lawsuit against Elon Musk and DOGE",
    "description": "A federal judge has refused to throw out a lawsuit that accuses billionaire Elon Musk and the Department of Government Efficiency of illegally accessing government data systems, canceling government contracts and firing federal employees",
    "link": "https://abcnews.go.com/US/wireStory/judge-refuses-toss-states-lawsuit-elon-musk-doge-122268367",
    "timestamp": "2025-05-28T14:54:26Z"
  },
  {
    "title": "Fox News’ Andy McCarthy Pours Cold Water on Trump’s ‘Dubious’ Attempt to Defund PBS and NPR",
    "description": "Fox News' Andy McCarthy poured cold water on President Donald Trump's \"dubious\" attempt at unilaterally defunding NPR and PBS.\nThe post Fox News’ Andy McCarthy Pours Cold Water on Trump’s ‘Dubious’ Attempt to Defund PBS and NPR first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/fox-news-andy-mccarthy-pours-cold-water-on-trumps-dubious-attempt-to-defund-pbs-and-npr/",
    "timestamp": "2025-05-28T14:52:44Z"
  },
  {
    "title": "Vladimir Putin issues his conditions for ending the war in Ukraine",
    "description": "President Vladimir Putin's conditions for ending the war in Ukraine include a demand that Western leaders pledge in writing to stop enlarging NATO eastwards, according to reports.",
    "link": "https://nypost.com/2025/05/28/world-news/vladimir-putin-issues-his-conditions-for-ending-war-in-ukraine/",
    "timestamp": "2025-05-28T14:52:05Z"
  },
  {
    "title": "Deep State Feeds Trump Pro-Ukraine Lies?",
    "description": "US President Donald Trump isn’t getting the full scope of intelligence briefings, Michael Maloof, former senior security policy analyst in the Office of the Secretary of Defense, tells Sputnik.",
    "link": "https://sputnikglobe.com/20250528/deep-state-feeds-trump-pro-ukraine-lies-1122148078.html",
    "timestamp": "2025-05-28T14:51:23Z"
  },
  {
    "title": "Live updates: Trump administration news",
    "description": "Follow here for the latest live news updates as President Donald Trump continues to forge ahead with his domestic and foreign policy agenda.",
    "link": "https://www.cnn.com/politics/live-news/trump-presidency-news-05-28-25",
    "timestamp": "2025-05-28T14:50:37Z"
  },
  {
    "title": "Trump FBI launches investigation into leftist violence against Christians in Seattle",
    "description": "Conservative Christians held a prayer rally with music, speeches, and giveaways at Cal Anderson Park in Seattle, Washington, on Saturday. The Mayday USA event — held in support of the \"sanctity of human life, the sacrality of biological gender, the importance…",
    "link": "https://www.theblaze.com/news/trump-fbi-launches-investigation-into-leftist-violence-against-christians-in-seattle",
    "timestamp": "2025-05-28T14:50:00Z"
  },
  {
    "title": "Zelensky: Trump Thinks Putin Is More Annoying than I Am",
    "description": "Ukrainian President Volodymyr Zelensky told reporters on Tuesday that he believed President Donald Trump found his Russian counterpart, Vladimir Putin, more irritating than him because of his dishonesty.\nThe post Zelensky: Trump Thinks Putin Is More Annoying …",
    "link": "https://www.breitbart.com/europe/2025/05/28/zelensky-trump-thinks-putin-is-more-annoying-than-i-am/",
    "timestamp": "2025-05-28T14:48:35Z"
  },
  {
    "title": "7 million new jobs will evaporate this year because of trade war, UN predicts | CNN Business",
    "description": "The United Nations expects that millions of potential jobs will vanish this year because of an economic slowdown triggered by US President Donald Trump’s trade war.",
    "link": "https://www.cnn.com/2025/05/28/business/ilo-7-million-jobs-trade-war-intl",
    "timestamp": "2025-05-28T14:48:26Z"
  },
  {
    "title": "DOGE Cuts Put Margate Icon Lucy the Elephant On Endangered Species List",
    "description": "Check phillymag.com each morning Monday through Thursday for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly […]",
    "link": "https://www.phillymag.com/news/2025/05/28/lucy-the-elephant-margate-doge/",
    "timestamp": "2025-05-28T14:46:53Z"
  },
  {
    "title": "Elon Musk criticizes Trump's 'big beautiful bill,' a fracture in a key relationship",
    "description": "Elon Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, saying he's “disappointed” in what the president calls his “big beautiful bill.”",
    "link": "https://abcnews.go.com/US/wireStory/elon-musk-criticizes-trumps-big-beautiful-bill-fracture-122267091",
    "timestamp": "2025-05-28T14:46:28Z"
  },
  {
    "title": "Israel Is Taking Its Cues From Spanish Conquistadors",
    "description": "Greg Grandin\n\n\n\nCortés has given way to Netanyahu, Putin, and Trump. A new age of conquest is upon us.\r\n\n\r\n\n\nThe post Israel Is Taking Its Cues From Spanish Conquistadors appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/israel-gaza-conquistadors-aztec/",
    "timestamp": "2025-05-28T14:45:55Z"
  },
  {
    "title": "What are Germany’s Taurus missiles that Ukraine wants?",
    "description": "German Chancellor Merz's recent comments cause speculation Berlin will finally send the weapons to Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/28/what-are-germanys-taurus-missiles-that-ukraine-wants",
    "timestamp": "2025-05-28T14:45:36Z"
  },
  {
    "title": "Earthquake between Musk and Trump: Tesla CEO lashes out with harsh statements and defends DOGE team",
    "description": "The stage of harmony and solidarity between tech mogul Elon Musk and President  Donald Trump seems to be going through a rough patch, after the billionaire resigned from the leader",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/05/28/68371f5222601ddb778b458d.html",
    "timestamp": "2025-05-28T14:45:17Z"
  },
  {
    "title": "Elon Musk ‘Disappointed’ in ‘Big Beautiful’ Spending Bill",
    "description": "Department of Government Efficiency head Elon Musk told CBS News Tuesday he is “disappointed” in the spending codified in the Republicans’ “big, beautiful bill.” “I... Read More\nThe post Elon Musk ‘Disappointed’ in ‘Big Beautiful’ Spending Bill appeared first…",
    "link": "https://www.dailysignal.com/2025/05/28/musk-disappointed-big-beautiful-bill/",
    "timestamp": "2025-05-28T14:45:16Z"
  },
  {
    "title": "Bono Sides with Springsteen Against Trump: “There’s Only One Boss in America”",
    "description": "The U2 vocalist became the latest Rock and Roll Hall of Famer to speak out in support of the Jersey rocker.\nBono Sides with Springsteen Against Trump: “There’s Only One Boss in America”\nEddie Fu",
    "link": "https://consequence.net/2025/05/bono-bruce-springsteen-donald-trump/",
    "timestamp": "2025-05-28T14:45:14Z"
  },
  {
    "title": "Missouri will hand over personal data of food aid recipients to feds",
    "description": "Missouri has agreed to abide by a request from the federal government to turn over personal data about anyone receiving food assistance.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_39def998-7cda-48c7-b087-bc4daa581f0f.html",
    "timestamp": "2025-05-28T14:45:00Z"
  },
  {
    "title": "Barbara Walters Grills Taylor Swift, Donald Trump in ‘Tell Me Everything’ Doc Trailer",
    "description": "New film celebrating the famed journalist's career will drop on Hulu next month",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/barbara-walters-tell-me-everything-trailer-taylor-swift-1235349239/",
    "timestamp": "2025-05-28T14:44:47Z"
  },
  {
    "title": "Chrisley children celebrate Trump's plan to pardon reality TV parents in fraud, tax evasion case",
    "description": "Shortly after President Donald Trump announced his plan to pardon Todd and Julie Chrisley for their bank fraud and tax evasion charges, the “Chrisley Knows Best\" stars' children were quick to share their excitement.",
    "link": "https://www.foxnews.com/entertainment/chrisley-children-celebrate-trumps-plan-pardon-reality-tv-parents-fraud-tax-evasion-case",
    "timestamp": "2025-05-28T14:44:46Z"
  },
  {
    "title": "WATCH: Stephen A. Smith says media’s Biden cover-up ‘makes Trump look right’ about fake news and lawfare",
    "description": "'Now the American people are sitting here not knowing what to believe or who to believe anymore. And then you wonder why I'm pissed'",
    "link": "https://www.wnd.com/2025/05/watch-stephen-a-smith-says-medias-biden-cover-up-makes-trump-look-right-about-fake-news-and-lawfare/",
    "timestamp": "2025-05-28T14:44:28Z"
  },
  {
    "title": "Editor Daily Rundown: NPR Claims Trump Admin Pulling Taxpayer Funding Violates First Amendment",
    "description": "NPR SAYS TRUMP YANKING THEIR FUNDING IS A VIOLATION OF THE *FIRST AMENDMENT* ... NPR Sues Trump, Claims Cutting Its Taxpayer Funding Amounts To 'Free Speech' Violation\n\nNational Public Radio (NPR) announced Tuesday that it is suing President Donald Trump over…",
    "link": "https://dailycaller.com/2025/05/28/npr-trump-admin-taxpayer-funding-first-amendment-free-speech/",
    "timestamp": "2025-05-28T14:43:16Z"
  },
  {
    "title": "Will Trump Start Deporting Cows?",
    "description": "A❤️415-wordunder2.5-minuteread All right. Even Donald Trump isn’t likely to start loading cattle on planes destined for El Salvador. I just thought the headline might get people’s attention and I need to broaden my social media footprint to monetize my …",
    "link": "https://energycentral.com/c/cp/will-trump-start-deporting-cows",
    "timestamp": "2025-05-28T14:38:30Z"
  },
  {
    "title": "A judge refuses to toss states’ lawsuit against Elon Musk and DOGE",
    "description": "U.S. District Judge Tanya Chutkan ruled Tuesday that 14 states can proceed with their claims against Musk and DOGE.",
    "link": "https://www.bostonherald.com/2025/05/28/musk-doge-data-access-lawsuit/",
    "timestamp": "2025-05-28T14:38:26Z"
  },
  {
    "title": "Macy's beats on earnings but cuts 2025 guidance due to tariffs",
    "description": "Macy’s gave Wall Street a masterclass in mixed signals on Wednesday: The department store chain beat first-quarter earnings expectations — then cut its full-year profit forecast, citing tariff pressures and cautious consumer spending related to the U.S. trade…",
    "link": "https://qz.com/macys-q1-2025-earnings-guidance-tariffs-1851782670",
    "timestamp": "2025-05-28T14:36:35Z"
  },
  {
    "title": "Israel Going It Alone Against Houthis In Yemen With Long-Range Strikes",
    "description": "Israel will have to settle for sending it jets every few weeks to hit what’s left of the economic infrastructure in the beggared Houthi-controlled parts of Yemen.",
    "link": "https://www.forbes.com/sites/pauliddon/2025/05/28/israel-going-it-alone-against-houthis-in-yemen-with-long-range-strikes/",
    "timestamp": "2025-05-28T14:34:17Z"
  },
  {
    "title": "Musk Must Face Suit Over Power as Trump Aide, Judge Says",
    "description": "Elon Musk will have to face a lawsuit that claims the billionaire wielded illegal power by orchestrating President Donald Trump’s dramatic cuts in federal government jobs and spending, a judge ruled.\nUS District Judge Tanya Chutkan on Tuesday denied a request…",
    "link": "https://biztoc.com/x/773bfec9893f9a35",
    "timestamp": "2025-05-28T14:34:12Z"
  },
  {
    "title": "Are American Forces Leaving South Korea En Masse?",
    "description": "Despite reports of troop reductions, US officials deny plans to withdraw forces from South Korea. Tensions persist over cost-sharing and America’s military footprint under the “America First” foreign policy.\nThe post Are American Forces Leaving South Korea En…",
    "link": "https://nationalinterest.org/blog/buzz/are-american-forces-leaving-south-korea-en-masse",
    "timestamp": "2025-05-28T14:34:06Z"
  },
  {
    "title": "Netanyahu calls NYT report on Iran strike plans ‘fake news’",
    "description": "Israel could attack Iranian nuclear sites within hours, the newspaper has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618251-israel-iran-us-nuclear-talks/",
    "timestamp": "2025-05-28T14:33:52Z"
  },
  {
    "title": "Trump's 'War Of Words' With Russia Could Spark Global Conflict",
    "description": "President Trump doubled down on his criticism of Vladimir Putin, suggesting the Russian leader was \"playing with fire\" after refusing to engage in peace negotiations",
    "link": "https://www.forbes.com/sites/petersuciu/2025/05/28/trumps-war-of-words-with-russia-could-spark-global-conflict/",
    "timestamp": "2025-05-28T14:31:56Z"
  },
  {
    "title": "Most South African farmers are black: why Trump got it so wrong",
    "description": "Incomplete and inaccurate official data provides fertile ground for radical statements.",
    "link": "https://theconversation.com/most-south-african-farmers-are-black-why-trump-got-it-so-wrong-257668",
    "timestamp": "2025-05-28T14:31:08Z"
  },
  {
    "title": "Exclusive-NATO to ask Berlin for seven more brigades under new targets, sources say",
    "description": "BERLIN (Reuters) - NATO will ask Germany to provide seven more brigades, or some 40,000 troops, for the alliance's defence, three sources told Reuters, under new targets for weapons and troop numbers that its members' defence ministers are set to agree on nex…",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/exclusive-nato-to-ask-berlin-for-seven-more-brigades-under-new-targets-sources-say",
    "timestamp": "2025-05-28T14:31:00Z"
  },
  {
    "title": "SpaceX rocket Starship goes further in its 9th test launch — but spins out of control",
    "description": "Space X’s big ambitions came crashing back to Earth on Tuesday, when its Starship made what the company calls a “rapid unscheduled disassembly” six minutes after launch, with parts landing in the Indian Ocean. Read more...",
    "link": "https://qz.com/spacex-9th-launch-spins-out-of-control-1851782671",
    "timestamp": "2025-05-28T14:30:00Z"
  },
  {
    "title": "After a decade worth of attempts, Indigenous Peoples Day is an official Montana holiday",
    "description": "“We've worked like heck to bring this. It took a lot of people to bring this throughout the years,” one advocate said. “It's been amazing to watch.”",
    "link": "https://helenair.com/news/local/indigenous/article_0763c947-852f-4905-9693-03efb59dc559.html",
    "timestamp": "2025-05-28T14:30:00Z"
  },
  {
    "title": "Trump targeted public media. Now NPR is taking him to court (Tom Jones/Poynter)",
    "description": "Tom Jones / Poynter:\nTrump targeted public media.  Now NPR is taking him to court  —  A coalition of public radio stations says the president's order to cut funding is unconstitutional retaliation and a threat to press freedom  —  NPR is fighting back.  —  Ea…",
    "link": "https://www.memeorandum.com/250528/p52",
    "timestamp": "2025-05-28T14:30:00Z"
  },
  {
    "title": "Elon Musk disses Trump's 'big, beautiful bill' for growing the national debt",
    "description": "Tesla (TSLA) CEO Elon Musk swiped at the large Republican domestic policy bill making its way through Congress, in a notable break from President Donald Trump.Read more...",
    "link": "https://qz.com/elon-musk-trump-republican-bill-deficit-debt-spending-1851782673",
    "timestamp": "2025-05-28T14:29:00Z"
  },
  {
    "title": "Bono Weighs In on Trump-Springsteen Feud: ‘There’s Only One Boss in America’ | Video",
    "description": "The music superstar also pokes fun at the president's social media platform\nThe post Bono Weighs In on Trump-Springsteen Feud: ‘There’s Only One Boss in America’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bono-sides-with-bruce-springsteen-against-trump-jimmy-kimmel/",
    "timestamp": "2025-05-28T14:27:34Z"
  },
  {
    "title": "‘Mar-a-Lago face’ now the most in-demand plastic surgery — doctor reveals who everyone is requesting to look like",
    "description": "Forget “Instagram Face” — everyone now wants a curated blend of full lips, chiseled cheekbones, wide eyes, and smooth, taut foreheads that never wrinkle in worry.",
    "link": "https://nypost.com/2025/05/28/lifestyle/mar-a-lago-face-now-the-most-in-demand-plastic-surgery-doctor-reveals-who-everyone-is-requesting-to-look-like/",
    "timestamp": "2025-05-28T14:27:11Z"
  },
  {
    "title": "Chase Chrisley breaks silence on his parents' pardons",
    "description": "Chase Chrisley is breaking his silence on his parents' planned pardons.",
    "link": "https://www.nbcnews.com/news/us-news/chase-chrisley-breaks-silence-parents-pardons-rcna209412",
    "timestamp": "2025-05-28T14:26:20Z"
  },
  {
    "title": "Divided Loyalties In Today's One World Under Doom Tie-Ins (Spoilers)",
    "description": "There may be just One World Under Doom, but it's only affecting two Marvel Comics titles this week. Doom's Division and Avengers, so at least they are playing their part, unlike Doctor Strange and Doom's Academy, come on now. Although Doctor Doom doesn't appe…",
    "link": "https://bleedingcool.com/comics/divided-loyalties-in-todays-one-world-under-doom-tie-ins-spoilers/",
    "timestamp": "2025-05-28T14:25:08Z"
  },
  {
    "title": "Trump Dwarfing Biden In Media Accessibility Since Returning To White House",
    "description": "President Donald Trump has trampled former President Joe Biden by becoming one of the \"most accessible\" presidents in modern history.",
    "link": "https://dailycaller.com/2025/05/28/trump-biden-media-accessibility-white-house/",
    "timestamp": "2025-05-28T14:24:10Z"
  },
  {
    "title": "Gold steadies as investors buy the dip ahead of US PCE data—can easing Trump tariffs and rising demand fuel a breakout?",
    "description": "Gold prices today are showing signs of recovery as investors buy the dip following a steep fall below the $3,300 mark. Spot gold rose 0.4% to $3,312.15 as markets await the Federal Reserve meeting minutes and the U.S. PCE inflation data. Traders are adjusting…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-steadies-as-investors-buy-the-dip-ahead-of-us-pce-datacan-easing-trump-tariffs-and-rising-demand-fuel-a-breakout/articleshow/121466978.cms",
    "timestamp": "2025-05-28T14:23:34Z"
  },
  {
    "title": "What Is Due Process?",
    "description": "In the first months of his administration, President Donald Trump repeatedly threatened due process, a fundamental principle enshrined in the U.S. Constitution. His attacks have spanned from the arbitrary use of the Alien Enemies Act to deport legal residents…",
    "link": "https://www.aclu.org/news/civil-liberties/what-is-due-process",
    "timestamp": "2025-05-28T14:22:15Z"
  },
  {
    "title": "Top Kremlin aide says Trump ‘not sufficiently informed’ about Ukraine after US president lashes out at Putin | CNN",
    "description": "A top Kremlin aide has accused Donald Trump of being “not sufficiently informed” about the situation in Ukraine after the US president said Russian leader Vladimir Putin was “playing with fire.”",
    "link": "https://www.cnn.com/2025/05/28/world/trump-not-informed-ukraine-kremlin-aide-intl",
    "timestamp": "2025-05-28T14:21:35Z"
  },
  {
    "title": "Todd Chrisley’s daughter Savannah reacts to Trump pardoning her parents of fraud convictions",
    "description": "Todd and Julie Chrisley have been appealing their case since being sentenced in November 2022",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/todd-julie-chrisley-trump-pardon-savannah-b2759279.html",
    "timestamp": "2025-05-28T14:20:47Z"
  },
  {
    "title": "'I Was Bemused': Cyril Ramaphosa Recounts Explosive Oval Office Meeting With Trump",
    "description": "While their White House meeting last week started on a good note, Trump shortly after ambushed the South African leader over conspiracy theories.",
    "link": "https://www.huffpost.com/entry/cyril-ramaphosa-recounts-trump-meeting_n_6836eb2ce4b09d67a28cdc14",
    "timestamp": "2025-05-28T14:20:14Z"
  },
  {
    "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley of fraud and tax evasion convictions (Will Weissert/Associated Press)",
    "description": "Will Weissert / Associated Press:\nTrump set to pardon reality TV stars Todd and Julie Chrisley of fraud and tax evasion convictions  —  President Donald Trump announced Tuesday that he's planning to pardon TV stars Todd and Julie Chrisley, famous for “Chrisle…",
    "link": "https://www.memeorandum.com/250528/p49",
    "timestamp": "2025-05-28T14:20:00Z"
  },
  {
    "title": "California opens track-and-field finals to more girls after success of trans athlete",
    "description": "The governing board for California high school sports is changing its competition rules at this weekend’s state track-and-field championships to allow more girls to take part amid controversy over the participation of a trans student-athlete.",
    "link": "https://www.nbcnews.com/nbc-out/out-news/california-opens-track-field-finals-girls-success-trans-athlete-rcna209414",
    "timestamp": "2025-05-28T14:19:43Z"
  },
  {
    "title": "Trump Press Secretary Gives Bonkers Defense of His Attacks on Harvard",
    "description": "Karoline Leavitt is trying to claim Donald Trump’s attacks on Harvard are justified because the U.S. needs more trade workers. \r\nThe White House press secretary made the wild defense to Sean Hannity on Fox News Tuesday night, telling the conservative pundit t…",
    "link": "https://newrepublic.com/post/195775/press-secretary-karoline-leavitt-trump-attacks-harvard",
    "timestamp": "2025-05-28T14:19:04Z"
  },
  {
    "title": "Exclusive-NATO to ask Berlin for seven more brigades under new targets, sources say",
    "description": "NATO will ask Germany to provide seven more brigades, or some 40,000 troops, for the alliance's defence, three sources told Reuters, under new targets for...",
    "link": "https://www.yahoo.com/news/exclusive-nato-ask-berlin-seven-141857085.html",
    "timestamp": "2025-05-28T14:18:57Z"
  },
  {
    "title": "Stocks Waver in Run-Up to Nvidia’s Earnings Test: Markets Wrap",
    "description": "Wall Street trading was fairly muted in the run-up to the highly anticipated results from Nvidia Corp. — the last of the “Magnificent Seven” megacaps to report.",
    "link": "https://financialpost.com/pmn/business-pmn/stocks-waver-in-run-up-to-nvidias-earnings-test-markets-wrap",
    "timestamp": "2025-05-28T14:17:27Z"
  },
  {
    "title": "Bureau of Land Management ousts official who reportedly resisted DOGE",
    "description": "Michael “Mike” Nedd, a 30-year veteran of the agency, reportedly told career employees to ignore a memo from an appointee of the U.S. DOGE Service... Security officers escorted a top official at the Bureau of Land Management out of the agency’s building on Tu…",
    "link": "https://freerepublic.com/focus/f-news/4319537/posts",
    "timestamp": "2025-05-28T14:16:37Z"
  },
  {
    "title": "Rep. Jasmine Crockett Wants Trump To Seek Professional Help After Ridiculous West Point Commencement Speech",
    "description": "Rep. Jasmine Crockett, one of the few Democratic leaders who is consistently willing to call out the absurdity of President Donald Trump without pulling punches and mincing words, is asking when someone is going to get the president the mental help he truly n…",
    "link": "https://hiphopwired.com/2721085/rep-jasmine-crockett-rips-trump-west-point-commencement-speech/",
    "timestamp": "2025-05-28T14:15:29Z"
  },
  {
    "title": "Trump Branded With Embarrassing Nickname Over Tariff Confusion",
    "description": "Wall Street is beginning to understand the president’s roller-coaster foreign trade decisions with the help of a trendy acronym: TACO—or “Trump Always Chickens Out.”\r\nThe TACO theory was coined earlier this month by Financial Times columnist Robert Armstrong,…",
    "link": "https://newrepublic.com/post/195780/donald-trump-nickname-tariffs-taco",
    "timestamp": "2025-05-28T14:14:14Z"
  },
  {
    "title": "MS-13 member, child sex offender nabbed amid federal immigration enforcement on Nantucket, Martha's Vineyard",
    "description": "About 40 arrests resulted due to immigration enforcement efforts on the islands of Nantucket and Martha's Vineyard on Tuesday, ICE indicated.",
    "link": "https://www.foxnews.com/us/ms-13-member-child-sex-offender-nabbed-amid-federal-immigration-enforcement-nantucket-marthas-vineyard",
    "timestamp": "2025-05-28T14:12:19Z"
  },
  {
    "title": "'Identify specifics!' Fox Business host loses patience with Rick Scott on budget",
    "description": "Fox Business host Maria Bartiromo lost her patience with Sen. Rick Scott (R-FL) after he equivocated on which cuts were needed to earn his support for President Donald Trump's budget.\"I think we can clearly get his Big, Beautiful Bill done,\" Scott said during…",
    "link": "https://www.rawstory.com/rick-scott-budget-cuts-patience/",
    "timestamp": "2025-05-28T14:11:46Z"
  },
  {
    "title": "Elon Musk is leaving the Trump administration after criticizing president’s ‘big beautiful bill’",
    "description": "The billionaire entrepreneur spearheaded efforts to reduce and overhaul the federal bureaucracy.",
    "link": "https://www.denverpost.com/2025/05/28/musk-criticizes-trump-bill-doge/",
    "timestamp": "2025-05-28T14:09:59Z"
  },
  {
    "title": "Elon Musk criticizes Trump’s ‘big beautiful bill,’ a fracture in a key relationship",
    "description": "Musk said said the legislation “undermines the work” of his Department of Government Efficiency.",
    "link": "https://www.bostonherald.com/2025/05/28/musk-criticizes-trump-bill-doge/",
    "timestamp": "2025-05-28T14:09:59Z"
  },
  {
    "title": "Elon Musk criticizes Trump’s ‘big beautiful bill,’ a fracture in a key relationship",
    "description": "WASHINGTON (AP) — Elon Musk is criticizing the centerpiece of President Donald Trump’s legislative agenda, a significant fracture in a partnership that was forged during last year’s campaign and was poised to reshape American politics and the federal governme…",
    "link": "https://financialpost.com/pmn/elon-musk-criticizes-trumps-big-beautiful-bill-a-fracture-in-a-key-relationship",
    "timestamp": "2025-05-28T14:09:53Z"
  },
  {
    "title": "Italy’s right-wing government, Israel’s former prime minister join call for Israel to end war in Gaza\n“The bombing must end,” the Italian foreign minister said.",
    "description": "Italy’s right-wing government has joined with Germany, France, Canada and the United Kingdom in calling on Israel to end its military campaign in Gaza. “The legitimate reaction of the Israeli government to a terrible and senseless act of terrorism is unfortun…",
    "link": "https://freerepublic.com/focus/f-chat/4319535/posts",
    "timestamp": "2025-05-28T14:09:18Z"
  },
  {
    "title": "Spheres of Influence Are Not the Answer",
    "description": "Even if the great powers could carve up an interconnected world, Washington may not get the result it wants.",
    "link": "http://foreignpolicy.com/2025/05/28/spheres-of-influence-great-powers/",
    "timestamp": "2025-05-28T14:09:09Z"
  },
  {
    "title": "‘SHHH DON’T TELL JOE!’ Infamous Democrat named on national TV as controlling Biden’s autopen",
    "description": "Trump calls it 'Biggest Scandal in American History'",
    "link": "https://www.wnd.com/2025/05/shhh-dont-tell-joe-infamous-democrat-named-on-national-tv-as-controlling-bidens-autopen/",
    "timestamp": "2025-05-28T14:08:08Z"
  },
  {
    "title": "Germany to help Ukraine increase missile production",
    "description": "Chancellor Friedrich Merz met Ukrainian President Volodymyr Zelenskyy in Berlin and reiterated his tough stance on Russia. Germany's new chancellor has already made it clear that support for Ukraine is one of his top priorities. Friedrich Merz, leader of the …",
    "link": "https://www.dw.com/en/germany-to-help-ukraine-increase-missile-production/a-72701811",
    "timestamp": "2025-05-28T14:08:00Z"
  },
  {
    "title": "Poland's high-stakes presidential vote pits pro-EU centrist against MAGA nationalist",
    "description": "WARSAW (Reuters) - Poles vote in a closely fought presidential election run-off on Sunday that pits the centrist, pro-European ruling party's candidate against a nationalist challenger who draws inspiration from U.S. President Donald Trump. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/poland039s-high-stakes-presidential-vote-pits-pro-eu-centrist-against-maga-nationalist",
    "timestamp": "2025-05-28T14:07:00Z"
  },
  {
    "title": "Right after King Charles waves goodbye, Quebec lawmakers vote unanimously to end ties with British monarchy",
    "description": "On May 27 Quebec lawmakers voted to cut all ties with the British monarchy, saying Quebecers don’t feel connected to it. On the same day King Charles III gave a speech in Ottawa.",
    "link": "https://economictimes.indiatimes.com/news/international/us/right-after-king-charles-waves-goodbye-quebec-lawmakers-vote-unanimously-to-end-ties-with-british-monarchy/articleshow/121468220.cms",
    "timestamp": "2025-05-28T14:06:08Z"
  },
  {
    "title": "Trump Admin Set to 'Supercharge' Illegal Alien Arrests and Deportations: Report",
    "description": "The Trump administration wants to increase the number of deportations to 3,000 illegal immigrants per month.",
    "link": "https://www.westernjournal.com/trump-admin-set-supercharge-illegal-alien-arrests-deportations-report/",
    "timestamp": "2025-05-28T14:05:59Z"
  },
  {
    "title": "'No Kings' Protest Leader Reveals 'Big Baby' Trump Plan",
    "description": "Ezra Levin revealed plans for upcoming protests to Jim Acosta.",
    "link": "https://www.newsweek.com/big-baby-trump-protest-no-kings-2077891",
    "timestamp": "2025-05-28T14:05:45Z"
  },
  {
    "title": "‘I Was Disappointed’: Elon Musk Throws Cold Water On Trump’s ‘Big, Beautiful Bill’",
    "description": "Elon Musk issued sharp criticism for President Donald Trump's \"one big, beautiful bill\" incorporating vast swathes of the president's legislative agenda.",
    "link": "https://dailycaller.com/2025/05/28/elon-musk-disappointed-trump-big-beautiful-bill/",
    "timestamp": "2025-05-28T14:05:30Z"
  },
  {
    "title": "Frustrated with Trump's U.S. policy, Greenland rethinks investment alliances and considers China as an alternative",
    "description": "Greenland is reportedly re-evaluating its foreign investment options due to unease with the US under the Trump administration. Greenland's minister, Naaja Nathanielsen, expressed a desire for diverse partnerships, including European and American, but indicate…",
    "link": "https://economictimes.indiatimes.com/news/international/us/frustrated-with-trumps-u-s-policy-greenland-rethinks-investment-alliances-and-considers-china-as-an-alternative-greenland-us-news/articleshow/121467315.cms",
    "timestamp": "2025-05-28T14:05:12Z"
  },
  {
    "title": "Podcasting, alcohol branding, and consulting: What we know about Kimberly Guilfoyle's multimillion-dollar fortune",
    "description": "Guilfoyle's financial disclosure shows she made more than $1.7 million last year and is worth millions.",
    "link": "https://www.businessinsider.com/kimberly-guilfoyle-trump-greece-ambassador-net-worth-financial-disclosure-2025-5",
    "timestamp": "2025-05-28T14:03:20Z"
  },
  {
    "title": "Was Barron Trump rejected by Harvard? US First Lady Melania finally breaks her silence amid university battle",
    "description": "Did Barron Trump apply to Harvard and get rejected? That's the question doing rounds on social media amid political tensions between the US President Donald Trump's administration and elite universities. Melania Trump has finally broken her silence on whether…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/was-barron-trump-rejected-by-harvard-us-first-lady-melania-finally-breaks-her-silence-amid-university-battle/articleshow/121468180.cms",
    "timestamp": "2025-05-28T14:02:43Z"
  },
  {
    "title": "New PumaBot targets Linux IoT surveillance devices",
    "description": "PumaBot targets Linux IoT devices, using SSH brute-force attacks to steal credentials, spread malware, and mine crypto. Darktrace researchers discovered a new botnet called PumaBot targets Linux-based IoT devices, using SSH brute-force attacks to steal creden…",
    "link": "https://securityaffairs.com/178386/malware/pumabot-targets-linux-iot-devices.html",
    "timestamp": "2025-05-28T14:01:56Z"
  },
  {
    "title": "Nvidia earnings updates: Wall Street watching for tariff impact, China market share",
    "description": "Nvidia's earnings call is today at 5 pm ET. NVDA stock heads into the report up 0.9% YTD. Investors are focused on Trump tariff impact.",
    "link": "https://www.businessinsider.com/nvidia-earnings-call-report-nvda-stock-live-updates-2025-5",
    "timestamp": "2025-05-28T14:01:47Z"
  },
  {
    "title": "Wall Street Investors Mock Trump With A Brutal 4-Letter Code Word",
    "description": "Wall Street investors have cooked up a new term for betting against President Donald Trump ― and some have used it to score big gains at a time when the markets are behaving erratically due to the president’s on-again, off-again tariffs.\nIt’s called “TACO,” w…",
    "link": "https://biztoc.com/x/0904df4eb7348983",
    "timestamp": "2025-05-28T14:00:50Z"
  },
  {
    "title": "NBC News’ Kelly O’Donnell To Lead Coverage Of Justice Department",
    "description": "Kelly O’Donnell will lead NBC News’ coverage of the Justice Department, as the network announced her promotion today to chief justice and national affairs correspondent. O’Donnell, who has been senior White House correspondent for the past four years, “brings…",
    "link": "http://deadline.com/2025/05/kelly-odonnell-nbc-news-justice-department-1236412259/",
    "timestamp": "2025-05-28T14:00:21Z"
  },
  {
    "title": "Maurice Cunningham: DFER Moves into MAGA Orbit",
    "description": "Maurice Cunningham, a retired professor of political science at the university of Massachusetts and a specialist on dark money in education, exposes the rightward shift of Democrats for Education Reform, as well as its continuing disintegration. DFER spent ye…",
    "link": "https://dianeravitch.net/2025/05/28/maurice-cunningham-dfer-moves-into-maga-orbit/",
    "timestamp": "2025-05-28T14:00:00Z"
  },
  {
    "title": "Can Bacteria Serve as ‘Microscopic Miners’ of the Metals We Need?",
    "description": "“This story was originally published on the author’s substack, Field Notes with Alexander C Kaufman, to which you can subscribe here.” Five years after President Donald Trump signaled his support for extracting metals from the moon, his new administration is …",
    "link": "https://www.motherjones.com/environment/2025/05/can-bacteria-serve-as-microscopic-miners-of-the-metals-we-need/",
    "timestamp": "2025-05-28T13:59:46Z"
  },
  {
    "title": "Legal scholar compares Trump to history's worst despots — and offers free course",
    "description": "Former Harvard constitutional law professor Laurence Tribe compared President Donald Trump's disregard of the law to some of history's worst autocrats in a CNN interview Wednesday.\n\nTribe's comments came after Trump upped his retaliatory measures against the …",
    "link": "https://www.rawstory.com/trump-autocrat-2672222094/",
    "timestamp": "2025-05-28T13:58:58Z"
  },
  {
    "title": "Joe Exotic Slams White House After Trump Pardons Todd and Julie Chrisley",
    "description": "Joe Exotic let his inner tiger come out Tuesday ... absolutely blasting Donald Trump for pardoning Todd and Julie Chrisley while he continues to sit in prison with no word on his appeal. ICYMI ... 47 issued a full pardon for the \"Chrisley Knows…\n Permalink",
    "link": "https://www.tmz.com/2025/05/28/joe-exotic-slams-trump-todd-julie-chrisley-pardoned/",
    "timestamp": "2025-05-28T13:58:54Z"
  },
  {
    "title": "US Issues Travel Warning For South Africa",
    "description": "The U.S. has updated its travel advice for South Africa a week after a contentious Oval Office meeting between Trump and the country's president.",
    "link": "https://www.newsweek.com/us-travel-advice-south-africa-2077938",
    "timestamp": "2025-05-28T13:57:10Z"
  },
  {
    "title": "'No MAGA left behind': Trump turning pardons into partisan exercise, critics say",
    "description": "After Donald Trump's sweeping pardon of hundreds convicted of 2021 Capitol riot offences, other priorities of his administration have dominated the discourse. But his administration continues to issue periodic pardons, and critics say they reek of hyperpartis…",
    "link": "https://www.cbc.ca/news/world/trump-pardons-jenkins-fiore-1.7544575",
    "timestamp": "2025-05-28T13:56:11Z"
  },
  {
    "title": "GameStop Just Bought Half A Billion Worth Of Bitcoin",
    "description": "Video game retailer GameStop is a big believer in Bitcoin. The Grapevine, Texas-based company disclosed today, May 28, that it had purchased 4,710 Bitcoin. At the current trading rates, that's worth more than $510 million USD.Bitcoin is one of the world's mos…",
    "link": "https://www.gamespot.com/articles/gamestop-just-bought-half-a-billion-worth-of-bitcoin/1100-6531856/",
    "timestamp": "2025-05-28T13:56:00Z"
  },
  {
    "title": "Gold Star son who hugged Trump at Arlington still dreams of becoming a Marine like his father",
    "description": "Gold Star son Christian Jacobs, who met Trump at Arlington in 2017, cherishes memories of his Marine father and aims to follow in his footsteps.",
    "link": "https://www.foxnews.com/media/gold-star-son-hugged-trump-arlington-dreams-becoming-marine-father",
    "timestamp": "2025-05-28T13:55:49Z"
  },
  {
    "title": "Dodging Taurus debate, Germany pledges to help Ukraine build own long-range weapons",
    "description": "The German defence ministry said the first systems could be deployed by Ukraine “within just a few weeks”.",
    "link": "https://www.euractiv.com/section/defence/news/dodging-taurus-debate-germany-pledges-to-help-ukraine-build-own-long-range-weapons/",
    "timestamp": "2025-05-28T13:55:19Z"
  },
  {
    "title": "Dodging Taurus debate, Germany pledges to help Ukraine build own long-range weapons",
    "description": "The German defence ministry said the first systems could be deployed by Ukraine “within just a few weeks”.",
    "link": "https://www.euractiv.com/section/politics/news/dodging-taurus-debate-germany-pledges-to-help-ukraine-build-own-long-range-weapons/",
    "timestamp": "2025-05-28T13:55:19Z"
  },
  {
    "title": "Russia’s state-run media mocks Trump over his weakness toward Putin",
    "description": "As Russia’s state-run media mocks Donald Trump over his weakness, the president's posture toward Russia has become a punch line to a sad joke.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/russias-state-run-media-mocks-trump-weakness-putin-rcna209411",
    "timestamp": "2025-05-28T13:53:18Z"
  },
  {
    "title": "Elon Musk breaks with Trump after $250 million investment",
    "description": "Elon Musk has publicly criticized President Donald Trump’s signature spending legislation, creating a notable policy rift between the tech billionaire and the president he supported with more than 250 million dollars during the 2024 election campaign. The dis…",
    "link": "https://rollingout.com/2025/05/28/elon-musk-angry-trump-after-investment/",
    "timestamp": "2025-05-28T13:53:11Z"
  },
  {
    "title": "Trump Defender on CNN Trashes ‘Gross, Inexcusable’ New Pardons",
    "description": "Marc Short trashed Trump over a new raft of pardons, telling CNN he's willing to defend Trump policies, but not \"gross\" and \"inexcusable\" pardons.\nThe post Trump Defender on CNN Trashes ‘Gross, Inexcusable’ New Pardons first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/trump-defender-on-cnn-trashes-gross-inexcusable-new-pardons/",
    "timestamp": "2025-05-28T13:52:13Z"
  },
  {
    "title": "Ex-Israeli PM Accuses Netanyahu ‘Thugs’ of Gaza War Crimes, Pleads for Trump to End It",
    "description": "Olmert delivered a blistering attack on Netanyahu’s government, accusing it of presiding over a “criminal” Israeli military campaign in Gaza.\nThe post Ex-Israeli PM Accuses Netanyahu ‘Thugs’ of Gaza War Crimes, Pleads for Trump to End It first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/ex-israeli-pm-accuses-netanyahu-thugs-of-gaza-war-crimes-pleads-for-trump-to-end-it/",
    "timestamp": "2025-05-28T13:50:44Z"
  },
  {
    "title": "Carney faces questions about US trade war, federal budget on his first day in House of Commons",
    "description": "Prime Minister Mark Carney fielded questions about the trade war with the United States and his decision to delay the federal budget to the fall as he faced his first ever grilling in question period in the House of Commons Wednesday.",
    "link": "https://www.nationalobserver.com/2025/05/28/news/carney-faces-questions-about-us-trade-war-federal-budget-his-first-day-house",
    "timestamp": "2025-05-28T13:50:38Z"
  },
  {
    "title": "Trump Will Walk Away From Ukraine (Brandon J. Weichert/The American ...)",
    "description": "Brandon J. Weichert / The American Conservative:\nTrump Will Walk Away From Ukraine … Loading the Elevenlabs Text to Speech AudioNative Player...  “This is not my war,” stated President Donald Trump emphatically to a dubious—nay, hostile—White House Press Corp…",
    "link": "https://www.memeorandum.com/250528/p44",
    "timestamp": "2025-05-28T13:50:00Z"
  },
  {
    "title": "Elon Musk's Bromance With Donald Trump Appears to Sour",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe relationship that has defined the second Trump administration is breaking down, according to those closest to the president.\nThe partnership of Elon Musk and President Donald Trump has been central to Whit…",
    "link": "https://biztoc.com/x/3b1bee20390d71e7",
    "timestamp": "2025-05-28T13:49:47Z"
  },
  {
    "title": "Trump Is The Most Accessible President Ever",
    "description": "President Donald Trump is setting a new standard for media accessibility, with even Politico calling him “just about the most-accessible president in modern history,” according to a recent episode of its Playbook podcast. White House Press Secretary Karoline …",
    "link": "https://biztoc.com/x/347dae6f1d8f2a9c",
    "timestamp": "2025-05-28T13:49:09Z"
  }
]