[
  {
    "title": "Everything is blowing up in Elon Musk’s face",
    "description": "All it took was losing $100 billion in three months to make Elon Musk change his tune on government work.",
    "link": "https://www.cnn.com/2025/04/03/business/elon-musk-tesla-sales-nightcap",
    "timestamp": "2025-04-03T11:40:25Z"
  },
  {
    "title": "Mark Carney Joins World Leaders Attacking Trump's Tariffs: 'Going To Fight'",
    "description": "Mark Carney has vowed to respond to Donald Trump's tariffs with countermeasures and to act \"with force.\"",
    "link": "https://www.newsweek.com/donald-trump-tariffs-mark-carney-vows-fight-canada-2054630",
    "timestamp": "2025-04-03T11:38:50Z"
  },
  {
    "title": "Emerging-Market Investors Brace for ‘Body Blow’ From US Tariffs",
    "description": "Assets across the developing world tumbled after President Donald Trump announced steep tariffs on export-driven nations, with the smallest and weakest economies targeted alongside China.",
    "link": "https://financialpost.com/pmn/business-pmn/emerging-market-investors-brace-for-body-blow-from-us-tariffs",
    "timestamp": "2025-04-03T11:37:54Z"
  },
  {
    "title": "Russian punk band PUSSY RIOT warns America to 'wake up!' at protest in NYC...",
    "description": "NEW YORK — Pussy Riot, the provocative, political Russian punk band, came to Washington Square Park\nWednesday to deliver a stern warning: “Wake up, America!”",
    "link": "https://www.arcamax.com/currentnews/newsheadlines/s-3659698",
    "timestamp": "2025-04-03T11:37:36Z"
  },
  {
    "title": "Mayor Adams’ charges are gone. Will his reelection campaign gain enough steam?",
    "description": "Mayor Eric Adams celebrated his case dismissal and told New Yorkers to read a book by Trump FBI director Kash Patel\n \n\nThe corruption case that cast a shadow over Adams' mayoralty is over, but he still faces accusations that he's beholden to Trump. [ more › ]",
    "link": "https://gothamist.com/news/mayor-adams-charges-are-gone-for-good-will-his-primary-campaign-bounce-back",
    "timestamp": "2025-04-03T11:37:00Z"
  },
  {
    "title": "Apple’s Stock Takes a Dip as Tariffs Affect Supply Chain",
    "description": "Apple's stock fell 7.5 percent following the rollout of US President Trump's latest tariff announcements.\nThe post Apple’s Stock Takes a Dip as Tariffs Affect Supply Chain first appeared on iPhone in Canada Blog.",
    "link": "https://www.iphoneincanada.ca/2025/04/03/apples-stock-takes-a-dip-as-tariffs-affect-supply-chain/",
    "timestamp": "2025-04-03T11:36:52Z"
  },
  {
    "title": "Smithsonian Exhibits Need Great Storytelling, Not More Politics",
    "description": "A Smithsonian exhibit on American entertainment eliminated country music from our nation's history. Trump’s executive order will change that.",
    "link": "https://thefederalist.com/2025/04/03/smithsonian-exhibits-need-great-storytelling-not-more-politics/",
    "timestamp": "2025-04-03T11:36:30Z"
  },
  {
    "title": "‘Rich guys like me get tax cuts, you'll pay...’: Indian-American author slams MAGA voters over Trump's tariffs",
    "description": "Sethi broke down how the tariffs on imports—including household essentials like sponges, towels, and toothpaste—will drive up costs for consumers",
    "link": "https://www.businesstoday.in/latest/world/story/rich-guys-like-me-get-tax-cuts-youll-pay-indian-american-author-slams-maga-voters-over-trumps-tariffs-470574-2025-04-03",
    "timestamp": "2025-04-03T11:36:18Z"
  },
  {
    "title": "Trump's 25% tariffs on imported cars take effect",
    "description": "The Trump administration is enacting a 25% tariff on imported vehicles, which could drive up car prices by more than $10,000.",
    "link": "https://www.wtae.com/article/trump-25-tariffs-on-imported-cars-take-effect/64374257",
    "timestamp": "2025-04-03T11:35:41Z"
  },
  {
    "title": "Donald Trump announced massive tariffs & the markets reacted with horror",
    "description": "April 2 was dubbed “Liberation Day” by Donald Trump and his cult. Most people had no idea what the hell those idiots were talking about, but we soon found out when Trump waddled outside for his big announcement. Liberation Day = Trump’s plan for massive tarif…",
    "link": "https://www.celebitchy.com/916401/donald_trump_announced_massive_tariffs_the_markets_reacted_with_horror/",
    "timestamp": "2025-04-03T11:35:17Z"
  },
  {
    "title": "'To Bargain or Not to Bargain.’ The Dilemma Facing World Leaders",
    "description": "5 min ago\n'To Bargain or Not to Bargain.’ The Dilemma Facing World Leaders.\nAll the nations hit by President Donald Trump’s tariffs now face a dilemma. They can either retaliate in the hope that pressure on U.S. firms leads Trump to back down, or they can try…",
    "link": "https://biztoc.com/x/3ffa9789b141ae7a",
    "timestamp": "2025-04-03T11:34:31Z"
  },
  {
    "title": "Trump Tariffs Spark Fears For Asian Jobs, Exporting Sectors",
    "description": "Across Asia, factory workers, directors, trade associations and analysts voiced concern Thursday that US President Donald Trump's stinging tariffs could put jobs at risk and hammer key sectors of industry.",
    "link": "https://www.ibtimes.com.au/trump-tariffs-spark-fears-asian-jobs-exporting-sectors-1857525",
    "timestamp": "2025-04-03T11:34:16Z"
  },
  {
    "title": "Teen accused of killing New Jersey police officer to be charged as adult, new US attorney says",
    "description": "A14-year-old gang member accused of fatally shooting a Newark police detective will be charged as an adult in federal court, interim New Jersey U.S. Attorney Alina Habba has announced.",
    "link": "https://www.foxnews.com/us/teen-accused-killing-new-jersey-police-officer-charged-adult-new-us-attorney-says",
    "timestamp": "2025-04-03T11:34:14Z"
  },
  {
    "title": "Layoff announcements surge to the most since the pandemic as Musk's DOGE slices Federal labor force",
    "description": "The surge in March was exceeded only by when the country shut down in 2020 for the Covid pandemic,",
    "link": "https://www.cnbc.com/2025/04/03/layoff-announcements-surge-to-the-most-since-the-pandemic-as-musks-doge-slices-federal-labor-force.html",
    "timestamp": "2025-04-03T11:33:07Z"
  },
  {
    "title": "Exclusive: Colorado Father Fights To Keep Government From Sterilizing His 14-Year-Old Son",
    "description": "In Colorado, and around the country, parents can be stripped of their rights to oversee their child's medical decisions by government courts.",
    "link": "https://thefederalist.com/2025/04/03/exclusive-colorado-father-fights-to-keep-government-from-sterilizing-his-14-year-old-son/",
    "timestamp": "2025-04-03T11:33:06Z"
  },
  {
    "title": "Transcript: Trump Suddenly Set to Cut Musk Loose as WI Loss Roils MAGA",
    "description": "The following is a lightly edited transcript of the April 3 episode of the Daily Blast podcast. Listen to it here.\r\nGreg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.\r\nAfter Dem…",
    "link": "https://newrepublic.com/article/193516/transcript-trump-suddenly-set-cut-musk-loose-wi-loss-roils-maga",
    "timestamp": "2025-04-03T11:32:57Z"
  },
  {
    "title": "Lia Thomas vows to fight Trump’s trans athlete bans",
    "description": "Trans swimmer Lia Thomas has vowed to keep fighting for trans inclusion in sport. Following his inauguration in January, Donald Trump issued several executive orders explicitly targeting the trans community, including declaring the official policy of the US w…",
    "link": "https://www.thepinknews.com/2025/04/03/lia-thomas-trans-sport-trump-us/",
    "timestamp": "2025-04-03T11:31:21Z"
  },
  {
    "title": "Trump launches 10% minimum tariffs on every US trading partner",
    "description": "President Donald Trump announced an across-the-board minimum 10% tariff on all trading partners, with some \"reciprocal tariffs\" imposed on dozens of countries he says are ripping the United States off the most. Many economists say the actions are certain to h…",
    "link": "https://www.today.com/video/trump-imposes-tariffs-on-goods-from-countries-around-the-world-236341829715",
    "timestamp": "2025-04-03T11:31:12Z"
  },
  {
    "title": "NSF grants plummet nearly 50% under Trump, raising research concerns",
    "description": "The National Science Foundation (NSF) has experienced a nearly 50% decline in new grants since President Donald Trump took office, reducing research funding by over $400 million. This sharp drop is particularly affecting students, early-career researchers, an…",
    "link": "https://timesofindia.indiatimes.com/education/news/nsf-grants-plummet-nearly-50-under-trump-raising-research-concerns/articleshow/119943024.cms",
    "timestamp": "2025-04-03T11:30:56Z"
  },
  {
    "title": "'Oh god!' MSNBC host gasps as economic expert warns of new path Trump put the U.S. on",
    "description": "Reacting to the sweeping tariffs Donald Trump is imposing on the world that sent markets spiraling downward overnight, an MSNBC financial analyst made a prediction that made the host audibly gasp.Late Wednesday, the president revealed his \"Liberation Day\" pla…",
    "link": "https://www.rawstory.com/trump-tariffs-oh-god/",
    "timestamp": "2025-04-03T11:30:35Z"
  },
  {
    "title": "Donald Trump's 'Liberation Day' tariff numbers questioned for simply 'not adding up'",
    "description": "There's been some confusion over Donald Trump's 'Liberation Day' tariff numbers as they've been questioned on certain figures",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-liberation-day-tariff-numbers-questioned-086720-20250403",
    "timestamp": "2025-04-03T11:30:34Z"
  },
  {
    "title": "As the US deadline for TikTok looms, Trump says he wants to keep it alive",
    "description": "Here we are again, with the clock ticking down on TikTok. Saturday is the deadline for the social media company to either be sold by its Chinese owner, ByteDance, or […]\nThe post As the US deadline for TikTok looms, Trump says he wants to keep it alive appear…",
    "link": "https://www.poynter.org/commentary/2025/what-will-happen-to-tiktok/",
    "timestamp": "2025-04-03T11:30:32Z"
  },
  {
    "title": "Job Cuts Soared 60% In March To Highest Since Spring 2020—Almost All Because Of DOGE",
    "description": "March would have been a “fairly quiet month for layoffs” without the impacts from the Department of Government Efficiency, according to the March Challenger report.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/04/03/job-cuts-soared-60-in-march-to-highest-since-spring-2020-almost-all-because-of-doge/",
    "timestamp": "2025-04-03T11:30:00Z"
  },
  {
    "title": "Democrats demoralized by Trump get boosts from Wisconsin voters and Cory Booker's speech",
    "description": "Victories this week gave Democratic leaders moments of relief and vindicated their strategy to focus on Trump's alliances with billionaires.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_db44a72e-3a94-5c4f-941f-852238d736b7.html",
    "timestamp": "2025-04-03T11:30:00Z"
  },
  {
    "title": "Rubio tries to reassure NATO allies as Trump sends mixed signals",
    "description": "Rubio is at a meeting of NATO foreign ministers at which many are hoping he will shed light on U.S. security plans in Europe.",
    "link": "https://www.twincities.com/2025/04/03/rubio-nato-allies-us-commitment/",
    "timestamp": "2025-04-03T11:28:44Z"
  },
  {
    "title": "Trump will claim victory in the next couple of weeks and then reverse the policies he has introduced: Ramesh Damani",
    "description": "Ramesh Damani believes Donald Trump will reverse his policies and declare victory to avoid admitting failure. He argues Trump's actions are damaging global order and U.S. economic power, but the world is rapidly forming new alliances and moving on. Damani ass…",
    "link": "https://economictimes.indiatimes.com/markets/expert-view/trump-will-claim-victory-in-the-next-couple-of-weeks-and-then-reverse-the-policies-he-has-introduced-ramesh-damani/articleshow/119943165.cms",
    "timestamp": "2025-04-03T11:27:18Z"
  },
  {
    "title": "Trump’s tariff plan includes a ‘fallback’ in case fentanyl justification falters",
    "description": "U.S. President Donald Trump’s sweeping reciprocal tariff plan comes with a “fallback” for free trade partners Canada and Mexico. Read more.",
    "link": "https://financialpost.com/news/trumps-tariff-plan-fallback-fentanyl-falters",
    "timestamp": "2025-04-03T11:26:46Z"
  },
  {
    "title": "When Fascism Comes to America",
    "description": "There's a relatively obscure quotation, sometimes attributed to the 20th-century American author Sinclair Lewis, that reads, \"When fascism comes to America, it will be wrapped in the flag and carrying a cross.\"Although no one’s actually sure that Sinclair Lew…",
    "link": "https://www.commondreams.org/opinion/trump-fascism-america",
    "timestamp": "2025-04-03T11:26:03Z"
  },
  {
    "title": "Trump creates U.S. Investment Accelerator to manage CHIPS Act and 'negotiate much better deals'",
    "description": "President Trump established the U.S. Investment Accelerator office to manage CHIPS Act awards and make it easier for investors to build businesses within the U.S.",
    "link": "https://www.tomshardware.com/tech-industry/trump-creates-u-s-investment-accelerator-to-manage-chips-act-and-negotiate-much-better-deals",
    "timestamp": "2025-04-03T11:25:51Z"
  },
  {
    "title": "Measuring the Cost of Extending Trump’s Tax Cuts Becomes a Flashpoint in Congress",
    "description": "Republicans are looking to change how extending many of Trump’s 2017 tax cuts would be scored when it comes to future federal deficits.",
    "link": "https://time.com/7274226/measuring-cost-of-extending-trump-tax-cuts-becomes-congress-flashpoint/",
    "timestamp": "2025-04-03T11:25:14Z"
  },
  {
    "title": "Trump and DOGE Defund Program That Boosted American Manufacturing for Decades (Wired)",
    "description": "Wired:\nTrump and DOGE Defund Program That Boosted American Manufacturing for Decades  —  President Donald Trump says taxing imports will strengthen domestic manufacturing.  Hours before announcing new tariffs, his administration cut support for centers that h…",
    "link": "https://www.memeorandum.com/250403/p15",
    "timestamp": "2025-04-03T11:25:11Z"
  },
  {
    "title": "Business Brief: Tariffs hit the world. Canada catches its breath",
    "description": "Good morning. Donald Trump imposed a sweeping set of tariffs on U.S. allies and adversaries alike – a move that threatens to upend decades of global trade integration. While the scale of the announcement rattles governments and industries around the world, th…",
    "link": "https://biztoc.com/x/058f90561cca199e",
    "timestamp": "2025-04-03T11:23:21Z"
  },
  {
    "title": "U.S. dollar slides, Wall Street losses expected as global markets react to tariffs",
    "description": "The dollar weakened broadly and U.S. stock futures sank early Thursday, with the euro rallying after President Donald Trump announced harsher-than-expected tariffs on American trading partners, unsettling markets as investors flocked to safe havens such as th…",
    "link": "https://biztoc.com/x/6a5ef1f08db716f2",
    "timestamp": "2025-04-03T11:23:08Z"
  },
  {
    "title": "Rubio reassures allies on US commitment to NATO",
    "description": "America \"is as active in NATO as ever, and some of this hysteria and hyperbole that I see … is unwarranted,” says Donald Trump's top diplomat.",
    "link": "https://www.politico.eu/article/rubio-reassures-allies-on-us-commitment-to-nato/",
    "timestamp": "2025-04-03T11:22:35Z"
  },
  {
    "title": "Top Russian official in Washington for talks on improving ties",
    "description": "Russia’s top economic negotiator announced Thursday that he was in Washington for talks on improving ties, the highest-level visit by a Kremlin official to the United States since Russia invaded Ukraine. Kirill Dmitriev, the head of Russia’s sovereign wealth …",
    "link": "https://www.digitaljournal.com/world/top-russian-official-in-washington-for-talks-on-improving-ties/article",
    "timestamp": "2025-04-03T11:22:20Z"
  },
  {
    "title": "Almost $2 trillion was erased from the S&P 500 because of Donald Trump’s tariffs",
    "description": "Yesterday, Donald Trump announced massive and widespread tariffs on nearly every country (except Russia and North Korea). He even announced tariffs on islands only inhabited by penguins. This announcement came after the markets closed on Wednesday, but the fu…",
    "link": "https://www.celebitchy.com/916509/almost_2_trillion_was_erased_from_the_sp_500_because_of_donald_trumps_tariffs/",
    "timestamp": "2025-04-03T11:22:20Z"
  },
  {
    "title": "Trump's 'Liberation Day' tariffs will also apply to Israel",
    "description": "A day after Israel eliminated all tariffs on imports from the United States, the White House slapped a 17 percent tariff on all imports from Israel. Economic officials said they hope to negotiate lower rates",
    "link": "https://www.haaretz.com/israel-news/2025-04-03/ty-article/trumps-liberation-day-tariffs-will-also-apply-to-israel/00000195-fb0c-d6b6-a9dd-ff7feb110000",
    "timestamp": "2025-04-03T11:22:01Z"
  },
  {
    "title": "Adam Schiff Gets Reminded of His Past After He Virtue Signals About 'Truth' on Senate Floor",
    "description": "Nothing stirs us to outrage more quickly than the combination of theatrical self-righteousness and brazen dishonesty from a cold-blooded liar. Of course, nothing of consequence ever seems to happen to such people. In Washington, D.C., they receive promotions.…",
    "link": "https://freerepublic.com/focus/f-news/4308534/posts",
    "timestamp": "2025-04-03T11:21:42Z"
  },
  {
    "title": "Trump’s Tariff Shock: What It Means For U.S. Consumers",
    "description": "President Donald Trump surprised global markets with his much-anticipated announcement of sweeping import tariffs. How will they affect U.S. consumers?",
    "link": "https://www.forbes.com/sites/garthfriesen/2025/04/03/trumps-tariff-shock-what-it-means-for-us-consumers/",
    "timestamp": "2025-04-03T11:21:14Z"
  },
  {
    "title": "Rubio Says US Committed To NATO - But Tells Allies To Spend More",
    "description": "US Secretary of State Marco Rubio told nervous NATO members on Thursday that Washington remained committed to the alliance, but said they must agree to massively ramp up their spending targets for defence.",
    "link": "https://www.ibtimes.com.au/rubio-says-us-committed-nato-tells-allies-spend-more-1857522",
    "timestamp": "2025-04-03T11:21:12Z"
  },
  {
    "title": "Reciprocal tariff on India: What’s the actual US tariff on India - 26% or 27%?",
    "description": "A review of published data conducted by Bloomberg found discrepancies in the future reciprocal tariff rates listed in a White House annex compared to the charts presented during President Donald Trump's announcement of the \"Liberation Day\" tariffs early on Th…",
    "link": "https://www.businesstoday.in/latest/economy/story/reciprocal-tariff-on-india-whats-the-actual-us-tariff-on-india-26-or-27-470566-2025-04-03",
    "timestamp": "2025-04-03T11:20:10Z"
  },
  {
    "title": "Russia says U.S. threats of military strikes against Iran are unacceptable",
    "description": "MOSCOW (Reuters) - Russia said on Thursday that threats of military strikes against its ally Iran were unacceptable and warned that attacking the Islamic Republic could lead to potentially catastrophic results if nuclear installations were bombed. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/04/03/russia-says-us-threats-of-military-strikes-against-iran-are-unacceptable",
    "timestamp": "2025-04-03T11:20:00Z"
  },
  {
    "title": "Trump's tariffs are a longtime goal fulfilled - and his biggest GAMBLE yet",
    "description": "Donald Trump's politics have shifted considerably over his decades in the public sphere. But one thing he has been consistent on, since the 1980s, is his belief that tariffs are an effective means of boosting the US economy. Now, he's staking his presidency o…",
    "link": "https://freerepublic.com/focus/f-chat/4308533/posts",
    "timestamp": "2025-04-03T11:19:48Z"
  },
  {
    "title": "'South Park' Goes After Elon Musk in New Season",
    "description": "A reference to the tech billionaire featured in the trailer for the upcoming season of the show.",
    "link": "https://www.newsweek.com/south-park-season-27-elon-musk-2054695",
    "timestamp": "2025-04-03T11:19:03Z"
  },
  {
    "title": "Rubio tries to reassure wary allies of US commitment to NATO as Trump sends mixed signals",
    "description": "Rubio is at a meeting of NATO foreign ministers at which many are hoping he will shed light on U.S. security plans in Europe.",
    "link": "https://www.bostonherald.com/2025/04/03/rubio-nato-allies-us-commitment/",
    "timestamp": "2025-04-03T11:18:14Z"
  },
  {
    "title": "Abandon All Hope: Dire Times for Europe",
    "description": "The meeting between Trump and Putin to discuss the end of the war in Ukraine (without the participation of Ukraine, let alone the EU) has made it clear that we are entering a new phase in the decline of our civilization, that we are already in the first stage…",
    "link": "https://www.resilience.org/stories/2025-04-03/abandon-all-hope-dire-times-for-europe/",
    "timestamp": "2025-04-03T11:17:45Z"
  },
  {
    "title": "Germany and France Push for a More Aggressive Tariff Response",
    "description": "France and Germany are pushing for a more robust reaction to US President Donald Trump’s tariff measures, advocating for a forceful retaliation that could strengthen the EU’s negotiating position.",
    "link": "https://financialpost.com/pmn/business-pmn/germany-and-france-push-for-a-more-aggressive-tariff-response",
    "timestamp": "2025-04-03T11:17:18Z"
  },
  {
    "title": "Trump tariffs impact ‘mixed bag’– New Delhi",
    "description": "India is analyzing the impact of reciprocal tariffs levied by the US, with officials indicating it is not a setback for trade Read Full Article at RT.com",
    "link": "https://www.rt.com/india/615179-trump-tariffs-impact-mixed-bag/",
    "timestamp": "2025-04-03T11:17:08Z"
  },
  {
    "title": "Memes Flood Social Media After Trump's Reciprocal Tariffs Announcement",
    "description": "2025 April Donald Trump's Tariffs, also known as Trump's Import Tariffs, refers to a viral debate based on United States President Donald Trump's plans for sweeping new import taxes on all goods entering the country. The Trump tariffs were announced in early …",
    "link": "https://knowyourmeme.com/memes/events/donald-trumps-reciprocal-tariffs-trump-recession",
    "timestamp": "2025-04-03T11:15:30Z"
  },
  {
    "title": "Trump's tariff keeps everyone guessing. Is it a recipe for economic disaster?",
    "description": "The impact of President Trump's tariff plan remains uncertain, with potential economic damage and international retaliation yet to be seen. The announcement has caused spikes in trade uncertainty and market instability. Concerns arise over the efficacy of tar…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-tariff-plan-keeps-everyone-guessing-is-it-a-recipe-for-economic-disaster/articleshow/119942918.cms",
    "timestamp": "2025-04-03T11:14:58Z"
  },
  {
    "title": "Trump unveils new tariffs and CDC's IVF team is eliminated: Morning Rundown",
    "description": "Global markets fall after Trump’s tariff. CDC’s IVF team is fired. College student says rumor amplified by ESPN's Pat McAfee ruined her life.",
    "link": "https://www.nbcnews.com/news/us-news/trump-new-tariffs-cdc-ivf-job-cuts-morning-rundown-rcna199429",
    "timestamp": "2025-04-03T11:14:48Z"
  },
  {
    "title": "Top Russian official in Washington for talks on improving ties",
    "description": "Russia's top economic negotiator announced Thursday that he was in Washington for talks on improving ties, the highest-level visit by a Kremlin official to the United States since Russia invaded Ukraine.Kirill Dmitriev, the head of Russia's sovereign wealth f…",
    "link": "https://www.rawstory.com/top-russian-official-in-washington-for-talks-on-improving-ties/",
    "timestamp": "2025-04-03T11:14:15Z"
  },
  {
    "title": "U.S. dollar slides, Wall Street losses expected as global markets react to tariffs",
    "description": "The dollar weakened broadly and U.S. stock futures sank early Thursday, with the euro rallying after President Donald Trump announced harsher-than-expected tariffs on American trading partners, unsettling markets as investors flocked to safe havens such as th…",
    "link": "https://www.cbc.ca/news/business/eu-countermeasures-us-tariffs-1.7500731",
    "timestamp": "2025-04-03T11:13:32Z"
  },
  {
    "title": "Trump's New Tariffs Send Global Markets Into Sharp Decline: Live Updates",
    "description": "Global markets took a sharp dive after President Donald Trump announced sweeping new tariffs on major U.S. trading partners, including the European Union and Japan. The move sent stocks tumbling worldwide, with S&P 500 futures down more than 3% and major inde…",
    "link": "https://biztoc.com/x/4c92cc687960c8e1",
    "timestamp": "2025-04-03T11:12:18Z"
  },
  {
    "title": "What are tariffs? How Trump's tariff plan works, who pays them, and how they could affect prices and jobs",
    "description": "US President Donald Trump announced new import tariffs.\nChip Somodevilla/Getty Images\nPresident Donald Trump has announced a slew of \"Liberation Day\" tariffs on 60 trade partners.\nTariffs are meant to raise government revenue, but may also affect prices and e…",
    "link": "https://biztoc.com/x/226315c36b4ba7af",
    "timestamp": "2025-04-03T11:12:17Z"
  },
  {
    "title": "Trump tariffs could undermine Brexit deal in Northern Ireland",
    "description": "US president imposes two-tier rate on island of Ireland, raising concerns over impact on 1998 peace pact\nTrump’s tariffs: the full list\nBusiness live – latest updates\nDonald Trump’s tariff plan could undermine the Brexit deal between the EU and the UK for tra…",
    "link": "https://biztoc.com/x/90f43c3bab16b354",
    "timestamp": "2025-04-03T11:12:10Z"
  },
  {
    "title": "India 'carefully examining' US tariffs",
    "description": "India's Department of Commerce announced Thursday it is \"carefully examining the implications\" of the new tariffs unveiled by United States President Donald Trump a day earlier. The 27% levy on India...",
    "link": "https://biztoc.com/x/0767dde680ae4902",
    "timestamp": "2025-04-03T11:12:02Z"
  },
  {
    "title": "Trump's New Tariffs Send Global Markets Into Sharp Decline: Live Updates",
    "description": "Markets plunge as Trump's tariffs hit major trade partners, sinking stocks. Stay with Newsweek for the latest.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-stock-market-plunge-eu-asia-live-updates-2054749",
    "timestamp": "2025-04-03T11:10:19Z"
  },
  {
    "title": "Indira Rajaraman: US Liberation Day tariffs target the WTO’s playing field",
    "description": "Import levies announced on 2 April by the US have effectively declared war on global trade protocols as part of President Donald Trump’s dramatic reset. He is overturning the core principles of cross-border commerce.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-liberation-day-reciprocal-tariffs-india-us-trade-ustr-wto-mfn-china-canada-mexico-gatt-bilateral-europe-eu-11743677512284.html",
    "timestamp": "2025-04-03T11:10:09Z"
  },
  {
    "title": "BMW, Mercedes-Benz call for free trade based on low tariffs, reduced trade barriers",
    "description": "BMW and Mercedes-Benz in India call for more free trade agreements, highlighting that low tariffs and reduced trade barriers would benefit all. This follows the US imposing 27% reciprocal tariffs on India, citing high import duties on American goods. Cooperat…",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-news/bmw-mercedes-benz-call-for-free-trade-based-on-low-tariffs-reduced-trade-barriers/articleshow/119942628.cms",
    "timestamp": "2025-04-03T11:07:47Z"
  },
  {
    "title": "Republicans Link Arms with Trump",
    "description": "“On one of the most politically stressful days of Donald Trump’s presidency, his party sent a more reassuring signal: Most Republicans are ready to back his new tariffs and the next step of his slow-moving",
    "link": "https://politicalwire.com/2025/04/03/republicans-link-arms-with-trump/",
    "timestamp": "2025-04-03T11:07:09Z"
  },
  {
    "title": "Trump tariffs: DPM Gan warns of 'rough waters'; Singapore reassessing growth forecast",
    "description": "SINGAPORE: While Singapore was hit with the lowest level of tariffs - 10 per cent - in sweeping new levies announced by the United States, the impact will be significant, said Singapore Deputy Prime Minister Gan Kim Yong on Thursday (Apr 3). \"I think our hous…",
    "link": "https://www.channelnewsasia.com/singapore/trade-minister-gan-kim-yong-says-singapore-disappointed-us-donald-trump-reciprocal-tariffs-5042211",
    "timestamp": "2025-04-03T11:07:05Z"
  },
  {
    "title": "The Devastating Impacts of Trump's War on Workers: A Personal Dispatch",
    "description": "The second administration of President Donald J. Trump has already started working its special magic across the Washington, D.C. capital region. Elon Musk and his Department of Government Efficiency (DOGE) have fired tens of thousands of federal workers, with…",
    "link": "https://tomdispatch.com/the-costs-of-trumps-war-on-federal-workers/",
    "timestamp": "2025-04-03T11:07:02Z"
  },
  {
    "title": "US tariffs ‘to cost Thai economy B360bn’",
    "description": "<p>Reciprocal <strong>tariffs</strong> imposed by the United States could result in economic losses for <strong>Thailand</strong> of 359 billion baht, reducing gross domestic product (GDP) by nearly 2%, according to the University of the Thai Chamber of Comme…",
    "link": "https://www.bangkokpost.com/business/general/2994917/us-tariffs-to-cost-thai-economy-b360bn",
    "timestamp": "2025-04-03T11:07:00Z"
  },
  {
    "title": "Auto giants surprisingly resilient as sweeping U.S. tariffs spare Canada and Mexico for now",
    "description": "Shares of some of the world's biggest automakers appeared surprisingly resilient on Thursday.",
    "link": "https://www.cnbc.com/2025/04/03/trump-tariffs-auto-stocks-resilient-as-us-spares-canada-and-mexico.html",
    "timestamp": "2025-04-03T11:06:57Z"
  },
  {
    "title": "Apple Production Hubs Hit by Tariffs, Sending Shares Plummeting",
    "description": "Apple is finding itself squarely in the crosshairs of President Donald Trump’s new tariffs. The tariffs cover many Apple manufacturing centers, undercutting efforts to shift away from China. India, where Apple is increasingly building iPhones and AirPods for …",
    "link": "https://www.gadgets360.com/mobiles/news/apple-production-hubs-tariffs-shares-plummet-8077923",
    "timestamp": "2025-04-03T11:05:24Z"
  },
  {
    "title": "Trump’s DEI Purge Drives 34% Drop in Pro-ESG Investor Proposals",
    "description": "President Donald Trump’s crackdown on diversity, equity and inclusion helped prompt a plunge in shareholder resolutions from progressive investors that typically push companies on social reform. Motions filed by groups in favor of environmental, social and go…",
    "link": "https://www.insurancejournal.com/news/national/2025/04/03/818203.htm",
    "timestamp": "2025-04-03T11:04:28Z"
  },
  {
    "title": "What are tariffs? How Trump's tariff plan works, who pays them, and how they could affect prices and jobs",
    "description": "President Donald Trump imposed a slew of tariffs ranging from 10 to 49% on trading partners. Here's what to know, who pays them, and how they work.",
    "link": "https://www.businessinsider.com/how-do-trump-tariffs-work-what-are-tariffs-trump-plan-2025-4",
    "timestamp": "2025-04-03T11:03:43Z"
  },
  {
    "title": "Trump's tariffs 'very painful' for Welsh firm",
    "description": "Halen Mon says new tariffs on exports to the US might mean it can no longer sell its products there.",
    "link": "https://www.bbc.com/news/articles/cg41l00eg5go",
    "timestamp": "2025-04-03T11:03:22Z"
  },
  {
    "title": "'Inflation day': How Germany is responding to the latest round of US tariffs",
    "description": "In the latest blow to the German economy, US President Donald Trump announced blanket tarriffs of 20 percent on all EU imports on Wednesday. How have German business leaders, politicians and the media responded to the news?",
    "link": "https://www.thelocal.de/20250403/inflation-day-how-germany-is-responding-to-the-latest-round-of-us-tariffs",
    "timestamp": "2025-04-03T11:02:23Z"
  },
  {
    "title": "Here are the smartest takes on Trump's 'Liberation Day' tariffs",
    "description": "President Donald Trump announced his tariffs on Wednesday.\nAlex Wong/Getty Images\nPresident Donald Trump announced his \"Liberation Day\" tariffs on Wednesday.\nMany commentators have questioned the tariffs and highlighted their potential economic consequences.\n…",
    "link": "https://biztoc.com/x/b8bd896474d487a4",
    "timestamp": "2025-04-03T11:01:20Z"
  },
  {
    "title": "Trump Tariffs To 'Plug The Hole' For Income Tax Cuts To Come: Economists Predict What More Could Be Expected",
    "description": "After President Donald Trump unveiled the tariffs on all its trading partners on Wednesday, this economist recalled his analysis of tariffs being used to fund tax cuts. Meanwhile, another senior economist highlighted other possible implications of the tariff …",
    "link": "https://biztoc.com/x/b37c5383851402ad",
    "timestamp": "2025-04-03T11:01:15Z"
  },
  {
    "title": "Crapitalism: Psychoanalysis and the Profit Motive",
    "description": "Moving from cultures of greed to cultures of gratitude requires institutional change, but it also requires that we look inwards, gently put our infantile wishes to bed, and wake up to this rich earth, with its soils made healthy by shit and decay.",
    "link": "https://www.resilience.org/stories/2025-04-03/crapitalism-psychoanalysis-and-the-profit-motive/",
    "timestamp": "2025-04-03T11:00:52Z"
  },
  {
    "title": "I spent 36 years in prison for a crime I didn’t do. Trump’s early pardons are the right idea",
    "description": "Donald Trump is not like his predecessors. Biden, Obama and Clinton all waited till the end of their terms to pardon prisoners. Trump has done so early and that is the right path.",
    "link": "https://www.foxnews.com/opinion/i-spent-36-years-prison-crime-i-didnt-do-trumps-early-pardons-right-idea",
    "timestamp": "2025-04-03T11:00:26Z"
  },
  {
    "title": "Columbia Activists Give New President Shipman Her First Test. Plus, Will Doug Emhoff Have to Hire an Ugly Secretary?",
    "description": "This shall not pass: A group of student activists with Columbia's Jewish Voice for Peace handed the school’s new president, Claire Shipman, a test on Wednesday when they chained themselves to a campus gate and chanted \"globalize the intifada.\"\nThe post Columb…",
    "link": "https://freebeacon.com/newsletters/columbia-activists-give-new-president-shipman-her-first-test-plus-will-doug-emhoff-have-to-hire-an-ugly-secretary/",
    "timestamp": "2025-04-03T11:00:22Z"
  },
  {
    "title": "Trump Third Term – Yes. He. Could.",
    "description": "But should he?\nThe post Trump Third Term – Yes. He. Could. first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/trump-third-term-yes-he-could/",
    "timestamp": "2025-04-03T11:00:20Z"
  },
  {
    "title": "Trump faces Judge Boasberg over migrant deportation flights defying court order",
    "description": "President Donald Trump clashes with federal judge over emergency deportation order as Supreme Court weighs controversial use of 18th-century immigration law.",
    "link": "https://www.foxnews.com/politics/trump-deportation-flights-court-order-boasberg",
    "timestamp": "2025-04-03T11:00:08Z"
  },
  {
    "title": "America's 21st Century 'Moonshot' Needs the Moon | Opinion",
    "description": "If America isn't on the moon permanently, China will be.",
    "link": "https://www.newsweek.com/americas-21st-century-moonshot-needs-moon-opinion-2053138",
    "timestamp": "2025-04-03T11:00:01Z"
  },
  {
    "title": "Is DOGE a real agency? Here's what to know about the initiative's creation, legality and purpose",
    "description": "The Department of Government Efficiency, announced by Donald Trump in November 2024, has been the subject of ongoing controversy.",
    "link": "https://www.snopes.com//news/2025/04/03/doge-explainer/",
    "timestamp": "2025-04-03T11:00:00Z"
  },
  {
    "title": "Australia’s Leader Takes On Social Media. Can He Win?",
    "description": "Prime Minister Anthony Albanese has plenty of reasons to ban social media for under-16s.",
    "link": "https://time.com/7273443/australia-social-media-ban-anthony-albanese/",
    "timestamp": "2025-04-03T11:00:00Z"
  },
  {
    "title": "What to Know About the Countries Facing the Highest Trump ‘Reciprocal’ Tariffs",
    "description": "Here’s what to know about U.S. trade with the 20 countries Trump just levied the bigger tariffs than China on.",
    "link": "https://time.com/7274194/trump-reciprocal-tariffs-highest-country-rates-calculation-math-imports-exports/",
    "timestamp": "2025-04-03T11:00:00Z"
  },
  {
    "title": "The Story of the Gilded Age Wasn’t Wealth. It Was Corruption.",
    "description": "Richard White, the historian and author of \"The Republic for Which It Stands,\" explains what made the late 19th century gilded.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/history-rich-influence-government/682266/",
    "timestamp": "2025-04-03T11:00:00Z"
  },
  {
    "title": "Milbank Bends a Knee",
    "description": "“A fourth major law U.S. law firm, Milbank, struck a deal on Wednesday with Donald Trump amid the U.S. president's campaign against perceived enemies within the legal industry, while another law firm fought back in",
    "link": "https://politicalwire.com/2025/04/03/milbank-bends-a-knee/",
    "timestamp": "2025-04-03T10:58:53Z"
  },
  {
    "title": "High-stakes hearing set for Trump administration to argue that it didn’t violate a judge’s order with deportation flights",
    "description": "US District Judge James Boasberg said Thursday that he is looking at whether “probable cause” exists to hold Trump administration officials in contempt for violating his orders halting the use of the Alien Enemies Act to deport alleged Venezuelan gang members.",
    "link": "https://www.cnn.com/2025/04/03/politics/boasberg-alien-enemies-act-deportation-flights-hearing/index.html",
    "timestamp": "2025-04-03T10:58:45Z"
  },
  {
    "title": "India eyes opportunity despite Trump tariffs hit",
    "description": "India reacted cautiously on Thursday to US President Donald Trump’s sweeping tariffs, with the government saying it was examining both “implications” and “opportunities” from the duty hikes. Indian stocks fell at the open of trading on Thursday, with the benc…",
    "link": "https://www.digitaljournal.com/world/india-eyes-opportunity-despite-trump-tariffs-hit/article",
    "timestamp": "2025-04-03T10:57:33Z"
  },
  {
    "title": "India Eyes Opportunity Despite Trump Tariffs Hit",
    "description": "India reacted cautiously on Thursday to US President Donald Trump's sweeping tariffs, with the government saying it was examining both \"implications\" and \"opportunities\" from the duty hikes.",
    "link": "https://www.ibtimes.com/india-eyes-opportunity-despite-trump-tariffs-hit-3768699",
    "timestamp": "2025-04-03T10:57:20Z"
  },
  {
    "title": "Links 4/3/2025",
    "description": "Recapping 'Liberation Day,' plus ICE goes after labor and an AI app has you covered for cyanide ice cream recipes.",
    "link": "https://www.nakedcapitalism.com/2025/04/links-4-3-2025.html",
    "timestamp": "2025-04-03T10:55:17Z"
  },
  {
    "title": "'Only my name was correct': Elon Musk's DOGE issues termination notices to USAID staff filled with errors",
    "description": "Termination notices sent by Elon Musk's cost-cutting team to USAID staff were riddled with errors, impacting pensions and pay. The agency's disrupted operations have left staff with inaccurate termination dates and other critical details. The issue has led to…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/only-my-name-was-correct-elon-musks-doge-issues-termination-notices-to-usaid-staff-filled-with-errors/articleshow/119942263.cms",
    "timestamp": "2025-04-03T10:54:38Z"
  },
  {
    "title": "Here are the smartest takes on Trump's 'Liberation Day' tariffs",
    "description": "Figures including Larry Summers, Nouriel Roubini and Mohamed El-Erian are reacting to President Donald Trump's tariff announcement.",
    "link": "https://www.businessinsider.com/trump-liberation-day-tariffs-reactions-commentators-2025-4",
    "timestamp": "2025-04-03T10:54:21Z"
  },
  {
    "title": "Republicans Break With Trump On Symbolic Vote To Stop Tariffs",
    "description": "Senate Republicans joined Democrats yesterday in a rare rebuke of President Donald Trump and his tariff \"trade\" agenda. (Expect the stock market to tank.) Via Politico:\nSenators voted 51-48 Wednesday to reject the national emergency Trump declared earlier thi…",
    "link": "https://crooksandliars.com/2025/04/republicans-break-trump-symbolic-vote-stop",
    "timestamp": "2025-04-03T10:53:02Z"
  },
  {
    "title": "'Dangerously naive': Lawmaker flags Trump's ulterior motive for 'new super dangerous tool'",
    "description": "Donald Trump has an ulterior motive for enacting his controversial tariff policy, but there is a way that opponents can fight back, according to Democratic Senator Chris Murphy.\n\nMurphy, who represents Connecticut, said in the wake of Trump's major trade war …",
    "link": "https://www.rawstory.com/trump-ulterior-motive-tariff-murphy/",
    "timestamp": "2025-04-03T10:52:38Z"
  },
  {
    "title": "Gold slips after hitting all-time high on Trump tariffs",
    "description": "Gold prices took a breather on Thursday after surging to yet another all-time high following U.S. President Donald Trump's announcement of sweeping import tariffs, which drove investors to the safe-haven asset.Spot gold was down 0.5 per cent at $3,119.09 by 1…",
    "link": "https://www.channelnewsasia.com/business/gold-slips-after-hitting-all-time-high-trump-tariffs-5042426",
    "timestamp": "2025-04-03T10:52:17Z"
  },
  {
    "title": "Gold retreats after hitting all-time high on Trump tariffs",
    "description": "Gold prices took a breather on Thursday after surging to yet another all-time high following U.S. President Donald Trump's announcement of sweeping import tariffs, which drove investors to the safe-haven asset.Spot gold was down 1.4 per cent to $3,090.00 at 1…",
    "link": "https://www.channelnewsasia.com/business/gold-retreats-after-hitting-all-time-high-trump-tariffs-5042426",
    "timestamp": "2025-04-03T10:52:17Z"
  },
  {
    "title": "Pam Bondi Seeks 20-year Sentence For Tesla Firebomber",
    "description": "Pam Bondi has made it clear alright. Her number one priority (after protecting Trump) is protecting Tesla. Following the Constitution, not so much.\nSource: Business Insider\nAttorney General Pam Bondi has said the Department of Justice will seek a 20-year pris…",
    "link": "https://crooksandliars.com/2025/04/pam-bondi-seeks-20-year-sentence-tesla",
    "timestamp": "2025-04-03T10:51:46Z"
  }
]