[
  {
    "title": "While Dems Tell Themselves MAGA Voters Regret Their Choice, Trump Has Best Approval Rating Run He’s Ever Had",
    "description": "Various major media outlets and Democrats have criticized Trump's handling of the presidency as he implements his \"America First\" agenda.",
    "link": "https://dailycaller.com/2025/02/19/dems-say-maga-voters-regret-choice-trump-has-best-approval-rating-run/",
    "timestamp": "2025-02-19T23:52:09Z"
  },
  {
    "title": "Rubio to skip G20 meeting after calling host South Africa's policies anti-American",
    "description": "U.S. Secretary of State Marco Rubio will skip a two-day meeting of foreign ministers from the leading rich and developing nations that starts on Thursday after criticizing host South Africa's policies as anti-American. Instead, Rubio was headed back to the Un…",
    "link": "https://japantoday.com/category/world/rubio-will-skip-a-g20-meeting-after-calling-host-south-africa%27s-policies-anti-american",
    "timestamp": "2025-02-19T23:51:54Z"
  },
  {
    "title": "Hooray! Team Trump is rescuing working-class motorists from Kathy Hochul’s elitist Midtown tolls",
    "description": "Hooray! Team Trump has come to the rescue of working-class motorists and killed the city’s despised congestion-pricing tolls. Kudos to President Donald Trump and Transportation Secretary Sean Duffy.",
    "link": "https://nypost.com/2025/02/19/opinion/hooray-trump-amp-co-is-saving-working-class-drivers-from-kathy-hochuls-elitist-midtown-tolls/",
    "timestamp": "2025-02-19T23:51:34Z"
  },
  {
    "title": "Despite DOGE budget cut crusade, Trump has already spent $10.7 million of taxpayer money on golf trips: report - NewsBreak",
    "description": "Donald Trump has reportedly spent almost $11 million of taxpayer money funding his golfing hobby since returning to office, despite his and Elon Musk ’ s",
    "link": "https://www.newsbreak.com/share/3820330012232-despite-doge-budget-cut-crusade-trump-has-already-spent-10-7-million-of-taxpayer-money-on-golf-trips-report?s=a2&share_destination_id=MzEyODIwNDIzLTE3NDAwMDg5ODMwMjQ%3D&pd=0LAYshvT&hl=en_US&send_time=1740008983&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.47.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v6%2Cns_foryou_recall_exp_25q1-v7%2Cns_foryou_rank_exp_25q1-v6%2Cns_push_exp_rt_bucketv12-control",
    "timestamp": "2025-02-19T23:50:12Z"
  },
  {
    "title": "Could 'Terrorist' Designation Lead To US Strikes On Drug Cartels?",
    "description": "US President Donald Trump's decision to designate eight Latin American drug trafficking groups as \"terrorist\" organizations has raised speculation about possible military action on foreign soil.",
    "link": "https://www.ibtimes.com/could-terrorist-designation-lead-us-strikes-drug-cartels-3764334",
    "timestamp": "2025-02-19T23:48:22Z"
  },
  {
    "title": "Trump makes another power grab",
    "description": "The Logoff is a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff. Today I’m focusing on the Trump administration’s effort to exert control ov…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/400441/the-logoff-trump-makes-another-power-grab",
    "timestamp": "2025-02-19T23:48:15Z"
  },
  {
    "title": "Senate Dems issue warning on ‘massive cuts’ to Medicaid predicted in GOP budget",
    "description": "by Jennifer Shutt, Nevada Current\n\nFebruary 19, 2025\n\nWASHINGTON — U.S. Senate Democrats on Wednesday urged Americans throughout the country who rely on Medicaid for their or a family member’s health care to call up GOP members of Congress and urge them not t…",
    "link": "https://www.rawstory.com/gop-budget-2671185015/",
    "timestamp": "2025-02-19T23:48:08Z"
  },
  {
    "title": "Asia markets live update: Stocks to trade mixed on Trump tariff worries",
    "description": "Australia's seasonally adjusted unemployment rate is set to rise 4.1% in January from 4% the month before, estimates from a Reuters' poll shows.",
    "link": "https://www.cnbc.com/2025/02/20/asia-markets-live-update-stocks-to-trade-mixed-on-trump-tariff-worries.html",
    "timestamp": "2025-02-19T23:47:30Z"
  },
  {
    "title": "Alan Ritchson Has Nothing Nice to Say About High School Classmate Matt Gaetz: ‘We Are Adversaries’",
    "description": "\"That motherf---ker,\" the \"Reacher\" star calls the divisive Republican\nThe post Alan Ritchson Has Nothing Nice to Say About High School Classmate Matt Gaetz: ‘We Are Adversaries’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/alan-ritchson-matt-gaetz-high-school-classmates/",
    "timestamp": "2025-02-19T23:46:25Z"
  },
  {
    "title": "Civil rights groups sue Trump over anti-DEIA executive orders",
    "description": "Three civil rights organizations filed a federal lawsuit Wednesday charging that three of President Trump’s executive orders attacking DEIA in the federal government hinder their ability to help marginalized communities.",
    "link": "https://www.nbcnews.com/news/nbcblk/civil-rights-groups-sue-trump-anti-deia-executive-orders-rcna192877",
    "timestamp": "2025-02-19T23:46:15Z"
  },
  {
    "title": "Republicans rebuke Trump on Ukraine - gently (Aaron Blake/Washington Post)",
    "description": "Aaron Blake / Washington Post:\nRepublicans rebuke Trump on Ukraine — gently  —  On the first big foreign policy test of the GOP's obeisance to Trump, some lawmakers are obliquely distancing themselves from Trump.  —  Republican lawmakers have been remarkably …",
    "link": "https://www.memeorandum.com/250219/p132",
    "timestamp": "2025-02-19T23:45:00Z"
  },
  {
    "title": "Ex-NFL punter Chris Kluwe arrested over protest of MAGA plaque",
    "description": "Kluwe, 43, and other residents were on hand to protest a plaque at the library they viewed as a “propaganda statement” because of its references to the Make America Great Again movement.",
    "link": "https://nypost.com/2025/02/19/sports/ex-nfl-punter-chris-kluwe-arrested-over-maga-plaque-protest/",
    "timestamp": "2025-02-19T23:44:39Z"
  },
  {
    "title": "“They’re Scared Shitless”: The Threat of Political Violence Informing Trump’s Grip on Congress",
    "description": "With the president smashing norm after norm, even lawmakers within his party have feared for their personal safety, and at least one has told confidants that it has swayed his decision-making.",
    "link": "https://www.vanityfair.com/news/story/trump-congress-political-violence",
    "timestamp": "2025-02-19T23:43:55Z"
  },
  {
    "title": "President Donald Trump to sign executive order instructing federal agencies to hunt down regulations that violate Constitution",
    "description": "The executive order will require federal agencies to submit a list to the Office of Management and Budget of regulations that could violate the Constitution.",
    "link": "https://www.foxnews.com/politics/trump-sign-executive-order-instructing-agencies-create-list-regulations-violate-constitution",
    "timestamp": "2025-02-19T23:42:31Z"
  },
  {
    "title": "Trump’s Pro-Union Labor Secretary Pick Draws Scrutiny From Senators of Both Parties",
    "description": "Senators from both parties had tough questions Wednesday for Lori Chavez-DeRemer, President Donald Trump’s nominee for Labor secretary, who breaks the traditional GOP mold in... Read More\nThe post Trump’s Pro-Union Labor Secretary Pick Draws Scrutiny From Sen…",
    "link": "https://www.dailysignal.com/2025/02/19/chavez-deremer/",
    "timestamp": "2025-02-19T23:41:00Z"
  },
  {
    "title": "Jasmine Crockett Says We Need Daily Briefings to Prevent ‘Idiots’ Trump and Musk From Lining Billionaires’ Pockets | Video",
    "description": "\"He's not out there trying to save money for the American people,\" the congresswoman tells MSNBC's Chris Hayes\nThe post Jasmine Crockett Says We Need Daily Briefings to Prevent ‘Idiots’ Trump and Musk From Lining Billionaires’ Pockets | Video appeared first o…",
    "link": "https://www.thewrap.com/jasmine-crockett-trump-musk-billionaires-msnbc-interview/",
    "timestamp": "2025-02-19T23:39:49Z"
  },
  {
    "title": "HHS employees decry hole left by federal firings: 'It almost feels like a bomb site'",
    "description": "Bracing frigid temperatures, crowds of former and current federal workers protested the deep cuts to HHS, warning it will permanently set back scientific progress.",
    "link": "https://abcnews.go.com/Politics/people-sick-fired-hhs-scientists-protest-federal-terminations/story?id=118982479",
    "timestamp": "2025-02-19T23:39:01Z"
  },
  {
    "title": "Elon Musk Posts That Cartels Are Eligible for Drone Strikes",
    "description": "\"Socalj\" for Borderland Beat Elon Musk suggested that the new FTO designations of Mexican drug cartels means using drones to attack the drug...",
    "link": "https://www.borderlandbeat.com/2025/02/elon-musk-posts-that-cartels-are.html",
    "timestamp": "2025-02-19T23:39:00Z"
  },
  {
    "title": "Ex-NFL Punter Chris Kluwe Arrested, Carried Out of Council Meeting After Anti-MAGA Rant",
    "description": "Former Minnesota Vikings punter Chris Kluwe was arrested and carried out of a city council meeting after becoming disruptive during an anti-MAGA rant! Kluwe, who played for the Vikings from 2005 to 2012, showed up to the meeting in Huntington Beach…",
    "link": "https://www.tmz.com/2025/02/19/vikings-punter-chris-kluwe-arrested-anti-maga-trump/",
    "timestamp": "2025-02-19T23:38:47Z"
  },
  {
    "title": "‘Utter Fabrication’: What One Former FAA Chief Says About Media’s Claim About Elon Musk and Air Safety",
    "description": "A former Federal Aviation Administration chief said Wednesday that it’s a “complete and utter fabrication” that entrepreneur Elon Musk forced out the head of the... Read More\nThe post ‘Utter Fabrication’: What One Former FAA Chief Says About Media’s Claim Abo…",
    "link": "https://www.dailysignal.com/2025/02/19/utter-fabrication-what-one-former-faa-chief-says-medias-claim-elon-musk-air-safety/",
    "timestamp": "2025-02-19T23:38:00Z"
  },
  {
    "title": "4 Nations notes: Injured Americans return",
    "description": "CBC Sports' daily newsletter brings you some news and notes ahead of Thursday night's big Canada-U.S. showdown.",
    "link": "https://www.cbc.ca/sports/the-buzzer-newsletter-4-nations-face-off-notes-1.7463393",
    "timestamp": "2025-02-19T23:36:27Z"
  },
  {
    "title": "Trump can't quickly or easily kill the CHIPS Act, but he can fire the workers funded by it",
    "description": "Reported layoffs suggest R&D functions may be hobbled, fab subsidies also at risk Comment  US President Donald Trump has made it plain he’s not a fan of the $53 billion CHIPS and Science Act that funds semiconductor manufacturing and research on American soil…",
    "link": "https://www.theregister.com/2025/02/19/trump_layoffs_nist/",
    "timestamp": "2025-02-19T23:36:06Z"
  },
  {
    "title": "White House says Elon Musk not in charge at DOGE but advising president",
    "description": "Washington -- The White House says billionaire Elon Musk is not technically part of the Department of Government Efficiency team that is sweeping through federal agencies but is rather a senior advisor to President Donald Trump. Musk’s exact role could be key…",
    "link": "https://freerepublic.com/focus/f-news/4298925/posts",
    "timestamp": "2025-02-19T23:35:21Z"
  },
  {
    "title": "US President Donald Trump car tariff threat puts pressure on stock markets",
    "description": "Global stocks were under pressure after Trump broadened his tariff threats.",
    "link": "https://www.nzherald.co.nz/business/trump-car-tariff-threat-puts-pressure-on-stock-markets/7H47JIHE3ZDDPCJX5INUSQVKEA/",
    "timestamp": "2025-02-19T23:34:58Z"
  },
  {
    "title": "A Federal Judge Is Weighing Whether to Drop the Case Against Eric Adams",
    "description": "On Wednesday afternoon, New York City Mayor Eric Adams arrived at a federal courthouse in lower Manhattan for what may be the last hearing in his criminal case. US District Judge Dale Ho heard arguments from Adams’ lawyer and deputy US attorney Emil Bove over…",
    "link": "https://www.motherjones.com/politics/2025/02/eric-adams-court-hearing/",
    "timestamp": "2025-02-19T23:33:40Z"
  },
  {
    "title": "Ukrainian leader to meet US envoy Keith Kellogg on Thursday",
    "description": "Ukrainian President Volodymyr Zelenskyy says he will be meeting Washington's Ukraine envoy, Keith Kellogg, on Thursday, APA reports citing BBC. During his daily evening address, a tradition since Russia launched its full-scale invasion of Ukraine, Zelenskyy s…",
    "link": "https://freerepublic.com/focus/f-chat/4298922/posts",
    "timestamp": "2025-02-19T23:33:06Z"
  },
  {
    "title": "One Month Under Trump: Are You Keeping Up?",
    "description": "This week on The Intercept Briefing, politics reporters Jessica Washington and Akela Lacy assess the full scope of Trump's first month in office. \nThe post One Month Under Trump: Are You Keeping Up? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/02/19/briefing-podcast-one-month-trump/",
    "timestamp": "2025-02-19T23:30:00Z"
  },
  {
    "title": "Defense secretary orders military to prepare for major budget cuts | CNN Politics",
    "description": "Defense Secretary Pete Hegseth has ordered the military to prepare plans to make drastic budget cuts over the next five years, with an exception for border security, according to a new memo obtained by CNN.",
    "link": "https://www.cnn.com/2025/02/19/politics/hegseth-military-major-budget-cuts/index.html",
    "timestamp": "2025-02-19T23:29:05Z"
  },
  {
    "title": "Trump pushing EU to take 'Europe first' approach would benefit Israel, Palestinians",
    "description": "President Trump’s bold vision for peace, which is still in its early days, can only move forward if the hurdle of European disruptive intervention is removed.",
    "link": "https://www.jpost.com/opinion/article-842871",
    "timestamp": "2025-02-19T23:28:31Z"
  },
  {
    "title": "Investigate Chuck Schumer For Threats Against DOGE Workers? We're Off the Diving Board Now",
    "description": "The acting U.S. Attorney for the District of Columbia is nothing if not a loyal acolyte of the Compendium of Wingnut Magic.",
    "link": "https://www.esquire.com/news-politics/politics/a63845653/trump-attorney-ed-martin-investigation-chuck-schumer/",
    "timestamp": "2025-02-19T23:28:00Z"
  },
  {
    "title": "Republican Wants Tyson Foods Prosecuted for Child Labor",
    "description": "Senator Josh Hawley brought up accusations of child labor at Tyson Foods' facilities on social media on Wednesday.",
    "link": "https://www.newsweek.com/tyson-foods-josh-hawley-child-labor-2033498",
    "timestamp": "2025-02-19T23:27:44Z"
  },
  {
    "title": "Judge deliberates after Justice Department pushes to end corruption case against NYC Mayor Adams",
    "description": "During a hearing on Wednesday, Judge Dale Ho questioned federal prosecutors over their decision to suspend criminal charges against Mayor Eric Adams. Judge Ho's ruling is expected soon.",
    "link": "https://www.npr.org/2025/02/19/nx-s1-5302553/adams-doj-nyc-hochul",
    "timestamp": "2025-02-19T23:26:31Z"
  },
  {
    "title": "Eric Adams Is Not a Free Man",
    "description": "After thanking the Trump Justice Department for mercy, Mayor Eric Adams is told in court he could still be prosecuted.",
    "link": "http://nymag.com/intelligencer/article/eric-adams-court-trump-justice-department-bove.html",
    "timestamp": "2025-02-19T23:26:06Z"
  },
  {
    "title": "Kennedy Centre cancels Pride concert featuring Gay Men’s Chorus of Washington, DC",
    "description": "The Kennedy Centre has cancelled a Pride concert featuring the Gay Men’s Chorus of Washington, DC and the National Symphony Orchestra. The group did not provide a reason for the cancellation. The concert was scheduled for 21 May as part of WorldPride 2025, wi…",
    "link": "https://www.thepinknews.com/2025/02/19/kennedy-centre-cancels-gay-mens-chorus-washington-dc/",
    "timestamp": "2025-02-19T23:26:02Z"
  },
  {
    "title": "Donald Trump Floats New 'Concept' to Pay Americans with DOGE Savings",
    "description": "Elon Musk posted on X that he would \"check with the president\" on a proposal to return 20 percent of DOGE savings to taxpayers.",
    "link": "https://www.newsweek.com/donald-trump-floats-new-concept-pay-americans-doge-savings-2033516",
    "timestamp": "2025-02-19T23:25:37Z"
  },
  {
    "title": "Trump acknowledges 'inflation is back' but blames Biden (David Goldman/CNN)",
    "description": "David Goldman / CNN:\nTrump acknowledges ‘inflation is back’ but blames Biden  —  President Donald Trump, in an interview with Fox News' Sean Hannity that aired Tuesday night, acknowledged that inflation is on the rise again — bucking his campaign promise to l…",
    "link": "https://www.memeorandum.com/250219/p131",
    "timestamp": "2025-02-19T23:25:01Z"
  },
  {
    "title": "Illinois Gov. J.B. Pritzker likens Trump administration actions to Nazi Germany",
    "description": "SPRINGFIELD, Ill. – With an eye toward a potential third term as governor and a possible White House bid, Gov. JB Pritzker on Wednesday used his budget and State of the State address to outline an optimistic no-tax-hike spending plan…",
    "link": "https://www.stltoday.com/news/local/illinois/illinois-gov-j-b-pritzker-likens-trump-administration-actions-to-nazi-germany/article_cd5a1a2e-ef18-11ef-b4c3-83559ec34cbe.html",
    "timestamp": "2025-02-19T23:25:00Z"
  },
  {
    "title": "Trump Media sues judge involved in Bolsonaro’s indictment | CNN Business",
    "description": "President Donald Trump’s media company is suing a Brazilian Supreme Court Justice in an unusual case that ties in first amendment rights, international law, and internal Brazilian politics.",
    "link": "https://www.cnn.com/2025/02/19/tech/trump-media-bolsonaro-indictment/index.html",
    "timestamp": "2025-02-19T23:23:25Z"
  },
  {
    "title": "'Blatant Conflict': Fired FDA Workers Were Reviewing Musk's Neuralink",
    "description": "A U.S. watchdog group and other critics are responding with alarm to reporting that federal employees reviewing applications related to a brain implant developed by Elon Musk's company Neuralink are among those fired as part of the billionaire and President D…",
    "link": "https://www.commondreams.org/news/neuralink-fda",
    "timestamp": "2025-02-19T23:21:36Z"
  },
  {
    "title": "'Long live the king': Trump adds rhetoric to actions that critics say exceed his authority",
    "description": "President Donald Trump is branding himself a monarch.",
    "link": "https://www.nbcnews.com/politics/donald-trump/king-trump-rcna192912",
    "timestamp": "2025-02-19T23:20:32Z"
  },
  {
    "title": "'Astonishing': Senator slams Trump over 'complete betrayal' to America",
    "description": "President Donald Trump's abandonment of Ukraine in the darkest hour of the Russian invasion, and strongarm tactics to try to force \"peace talks\" that lopsidedly benefit Russia, represent a \"complete betrayal\" of our allies and our democratic values, Sen. Tamm…",
    "link": "https://www.rawstory.com/tammy-duckworth-trump-russia/",
    "timestamp": "2025-02-19T23:20:26Z"
  },
  {
    "title": "Fetterman Staff Quit Amid Frustration Over “Just Working on Israel All the Time”",
    "description": "A former campaign staffer said Sen. John Fetterman’s single-minded focus came at the exclusion of the progressive positions he ran on.\nThe post Fetterman Staff Quit Amid Frustration Over “Just Working on Israel All the Time” appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/02/19/fetterman-staff-quit-resign-israel/",
    "timestamp": "2025-02-19T23:20:25Z"
  },
  {
    "title": "US declares drug cartels, criminal gangs global terrorist organisations",
    "description": "Trump frequently depicts immigration and drug smuggling as part of an 'invasion' of the US to justify harsh measures.",
    "link": "https://www.aljazeera.com/news/2025/2/19/us-declares-drug-cartels-criminal-gangs-global-terrorist-organisations",
    "timestamp": "2025-02-19T23:20:22Z"
  },
  {
    "title": "Judge Invokes 'Jesus' To Absolutely Eviscerate Trump's DOJ In Court Hearing",
    "description": "The Trump administration’s attempt to ban transgender people from military service is under fire in court.",
    "link": "https://www.huffpost.com/entry/judge-blasts-trumps-doj-after-they-try-to-say-transgender-people-arent-discriminated-against_n_67b640bae4b0cc5d77995671",
    "timestamp": "2025-02-19T23:20:02Z"
  },
  {
    "title": "Breaking Down Trump’s Trans Military Ban",
    "description": "A US District Judge Called it “Ridiculous” and “Unadulterated Animus.” She’s Right\n \n by Vivian McCall\n \n \n \n The fate of the trans military ban still hangs in the balance, but on Tuesday, a federal judge pressed the Justice Department’s lawyer on the clear, …",
    "link": "https://www.thestranger.com/news/2025/02/19/79930310/breaking-down-trumps-trans-military-ban",
    "timestamp": "2025-02-19T23:20:00Z"
  },
  {
    "title": "GOP Senate leaders vow to defy Trump demands with budget vote",
    "description": "WASHINGTON — U.S. Senate Republicans plan to vote on their budget resolution this week as planned, despite President Donald Trump throwing his support behind the House’s budget on Wednesday morning.\n“I think he’s made it clear for a long time that he would pr…",
    "link": "https://www.rawstory.com/gop-senate-leaders-vow-to-defy-trump-demands-with-budget-vote/",
    "timestamp": "2025-02-19T23:19:50Z"
  },
  {
    "title": "Trump's seismic foreign policy shift: From the Politics Desk",
    "description": "Within a week, Trump upended decades of U.S. foreign policy with Russia and Europe. And he raised grave questions in the minds of every American ally.",
    "link": "https://www.nbcnews.com/politics/trumps-seismic-foreign-policy-shift-politics-desk-rcna192911",
    "timestamp": "2025-02-19T23:17:08Z"
  },
  {
    "title": "Think of it, a modestly successful comedian, Volodymyr Zelenskyy, talked the United States of America into spending $350 Billion Dollars, to go into a War...",
    "description": "...that couldn't be won, that never had to start, but a War that he, without the U.S. and \"TRUMP,\" will never be able to settle. The United States has spent $200 Billion Dollars more than Europe, and Europe's money is guaranteed, while the United States will …",
    "link": "https://freerepublic.com/focus/f-bloggers/4298916/posts",
    "timestamp": "2025-02-19T23:15:02Z"
  },
  {
    "title": "We’re about to learn just how eager the Supreme Court is to help Trump",
    "description": "Hampton Dellinger, a federal official who President Donald Trump attempted to fire earlier this month, seems very likely to lose a lawsuit challenging that firing … eventually.  But the Trump administration is impatient to make that happen as soon as possible…",
    "link": "https://www.vox.com/scotus/400323/supreme-court-trump-hampton-dellinger-unitary-executive",
    "timestamp": "2025-02-19T23:14:39Z"
  },
  {
    "title": "Trump administration tells Pentagon to slash budget by 8% a year",
    "description": "UPDATED Feb 20, 2025, 07:00 AM Washington - The Trump administration has ordered senior US military leaders to plan for expansive cuts that could slash the defence budget by 8 per cent annually, or some US$290 billion (S$390 billion) within the next five year…",
    "link": "https://freerepublic.com/focus/f-chat/4298914/posts",
    "timestamp": "2025-02-19T23:12:45Z"
  },
  {
    "title": "PERVERSE: Your Tax Dollars Must Continue Funding Experimental Transgender ‘Treatments,’ Judges Rule",
    "description": "Did you know that your tax dollars have been funding experimental “transgender” medical interventions that leave kids stunted, scarred, and infertile? Did you know that... Read More\nThe post PERVERSE: Your Tax Dollars Must Continue Funding Experimental Transg…",
    "link": "https://www.dailysignal.com/2025/02/19/perverse-tax-dollars-must-continue-funding-experimental-transgender-treatments-judges-rule/",
    "timestamp": "2025-02-19T23:12:21Z"
  },
  {
    "title": "Big swings, big misses: DOGE struggles to back up its outsized claims",
    "description": "Elon Musk’s cost-cutting and fraud-finding apparatus, the Department of Government Efficiency, came out swinging in recent days. The result? Two stunning strikeouts. A series of announcements by DOGE as well as claims by Musk and President Donald Trump about …",
    "link": "https://freerepublic.com/focus/f-news/4298912/posts",
    "timestamp": "2025-02-19T23:12:05Z"
  },
  {
    "title": "DOGE Savings Dividend Checks for Americans? Musk Conferring with Trump",
    "description": "Fishback called for 20 percent of DOGE's total savings to be refunded to taxpayers and the other 80 percent go toward deficit reduction.",
    "link": "https://www.westernjournal.com/doge-savings-dividend-checks-americans-musk-conferring-trump/",
    "timestamp": "2025-02-19T23:11:28Z"
  },
  {
    "title": "The Administration's Pointless Assault on USAID Is Decimating the Independent Global Press",
    "description": "Of course, if it brings together Russian kleptocrats, Central American autocrats, and the mullahs in Tehran, it sounds like the same kind of foreign policy triumph that the president is seeking in Ukraine.",
    "link": "https://www.esquire.com/news-politics/politics/a63845204/foreign-aid-freeze-international-journalism/",
    "timestamp": "2025-02-19T23:11:00Z"
  },
  {
    "title": "Kennedys v Trump! Caroline Kennedy Set for Face Off With The Don Over His Brutal Overhaul of Political Dynasty’s Beloved Ultra-Liberal Cultural Center",
    "description": "Caronline Kennedy and her daughter are getting ready to meet with Donald Trump after the president shockingly overhauled the Kennedy Center last week.",
    "link": "https://radaronline.com/p/donald-trump-feud-caroline-rose-meeting-overhaul-kennedy-center/",
    "timestamp": "2025-02-19T23:10:00Z"
  },
  {
    "title": "Fact Check: Did the US Give $350B to Ukraine, as Trump Claims?",
    "description": "President Donald Trump cited a figure not backed by evidence during a social media attack on Ukrainian President Volodymyr Zelensky.",
    "link": "https://www.newsweek.com/fact-check-trump-says-usa-spent-350-billion-ukraine-2033333",
    "timestamp": "2025-02-19T23:09:57Z"
  },
  {
    "title": "Surprising new poll numbers released on Trump's performance so far in the White House",
    "description": "Three new national polls released indicate President Donald Trump's approval ratings are edging down slightly since taking over in the White House one month ago",
    "link": "https://www.foxnews.com/politics/surprising-new-poll-numbers-released-trumps-performance-so-far-white-house",
    "timestamp": "2025-02-19T23:09:54Z"
  },
  {
    "title": "'Sycophantic': Analyst notes MAGA world fell in line as Trump dubbed himself a ‘king’",
    "description": "President Donald Trump’s startling declaration of himself as a “king” on Wednesday grew even more concerning after his loyal band of MAGA followers quickly fell in line, according to the New Republic's Edith Olmsted.That includes officials at the White House,…",
    "link": "https://www.rawstory.com/trump-monarchy/",
    "timestamp": "2025-02-19T23:09:42Z"
  },
  {
    "title": "Vance Stands by Trump in Spat With Frustrated Zelenskyy",
    "description": "Vice President J.D. Vance, who met Volodymyr Zelenskyy last week at the Munich Security Conference, said Wednesday that Ukraine's leader is making a mistake by criticizing President Donald Trump, who is seeking a rapid end to the nearly three-year-old war wit…",
    "link": "https://freerepublic.com/focus/f-news/4298911/posts",
    "timestamp": "2025-02-19T23:08:31Z"
  },
  {
    "title": "Commentary: Elon Musk is torching America on behalf of Donald Trump",
    "description": "What is a good way of reducing plane crashes? Obviously do not fire air safety experts and instil paranoia in those who remain. Yet that is what Elon Musk is doing to the Federal Aviation Administration (FAA), three weeks after America’s deadliest air collisi…",
    "link": "https://freerepublic.com/focus/f-news/4298910/posts",
    "timestamp": "2025-02-19T23:07:37Z"
  },
  {
    "title": "Have changes in the DoD or VA affected you?",
    "description": "The first weeks of the second Donald Trump Administration brought a whirlwind of changes to military and veterans organizations throughout San Diego.",
    "link": "https://www.kpbs.org/news/military/2025/02/19/have-changes-in-the-dod-or-va-affected-you",
    "timestamp": "2025-02-19T23:07:36Z"
  },
  {
    "title": "Jake Tapper Rips Trump’s Zelensky Insults: ‘Breaking With Basic Decency’",
    "description": "CNN’s Jake Tapper accused President Donald Trump of “breaking with truth” and “basic decency” Wednesday over comments he made earlier in the day about Ukrainian President Volodymyr Zelensky. Trump began the day blasting Ukraine’s leader as a “dictator” who wa…",
    "link": "https://www.mediaite.com/tv/jake-tapper-rips-trumps-zelensky-insults-breaking-with-basic-decency/",
    "timestamp": "2025-02-19T23:07:15Z"
  },
  {
    "title": "Aurora police show conditions inside troubled Edge at Lowry apartments, now shuttered with residents relocated",
    "description": "\"We have turned the corner on that crime. We have turned that corner on that mismanagement,\" Aurora's police chief said Wednesday inside a now-vacant unit at the notorious Edge at Lowry Apartments.",
    "link": "https://www.denverpost.com/2025/02/19/edge-at-lowry-aurora-apartments-tren-de-aragua-cbz/",
    "timestamp": "2025-02-19T23:06:54Z"
  },
  {
    "title": "Trump ‘Dragged Through Courts’ Over False Russia Election Collusion Claims — Putin",
    "description": "The Russian leader stressed that Russia had never interfered in Euro-Atlantic relations, nor speculated on issues that arise between the United States and the European UnionST. PETERSBURG, February 19. /TASS/. US President Donald Trump was accused of having a…",
    "link": "https://freerepublic.com/focus/f-news/4298908/posts",
    "timestamp": "2025-02-19T23:04:45Z"
  },
  {
    "title": "GOP senators fact check Trump's Ukraine rhetoric, while still backing his strategy",
    "description": "Lawmakers sought to dispel Kremlin talking points echoed by the president that Ukraine was responsible for the war with Russia. But they said Trump should be given room to negotiate.",
    "link": "https://www.npr.org/2025/02/19/nx-s1-5302885/ukraine-russia-trump-congress",
    "timestamp": "2025-02-19T23:03:35Z"
  },
  {
    "title": "Senate GOP budget bill back on track hours after Trump threw it into turmoil",
    "description": "Senate Republicans are pushing ahead with their $340 billion budget bill focused on funding the White House’s mass deportations and border security agenda",
    "link": "https://abcnews.go.com/US/wireStory/senate-gop-budget-bill-back-track-hours-after-118974331",
    "timestamp": "2025-02-19T23:02:24Z"
  },
  {
    "title": "Trump says he's considering returning 20% of DOGE savings to Americans",
    "description": "U.S. President Donald Trump on Wednesday said his administration is considering returning 20% of savings identified by Elon Musk's Department of Government...",
    "link": "https://www.yahoo.com/news/trump-says-hes-considering-returning-230212911.html",
    "timestamp": "2025-02-19T23:02:12Z"
  },
  {
    "title": "Top Crypto Market Maker Wintermute Opens New York Office Amid Trump Optimism: Report",
    "description": "A crypto market maker is reportedly opening up a new office in New York due to the pro-crypto nature of President Donald Trump. According to a new report from Bloomberg, crypto liquidity provider Wintermute – which already has offices in London and Singapore …",
    "link": "https://dailyhodl.com/2025/02/19/top-crypto-market-maker-wintermute-opens-new-york-office-amid-trump-optimism-report/",
    "timestamp": "2025-02-19T23:01:48Z"
  },
  {
    "title": "Is Trump about to hand Ukraine to Russia?",
    "description": "Despite Donald Trump’s campaign promise to end the war in Ukraine in 24 hours, and despite his team’s overall move-fast-and-break-things approach, the administration’s approach to the now nearly three-year-old conflict started out slowly.  Although the White …",
    "link": "https://www.vox.com/world-politics/400408/ukraine-talks-trump-putin-zelenskyy",
    "timestamp": "2025-02-19T23:01:00Z"
  },
  {
    "title": "Clive Palmer trumpets his return, Nine’s awkward Slacks, and ScoMo’s family photos",
    "description": "Plus: an NRL icon makes his pitch to Donald Trump.\nThe post Clive Palmer trumpets his return, Nine’s awkward Slacks, and ScoMo’s family photos appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/02/20/clive-palmer-returns-scott-morrison-photo-album/",
    "timestamp": "2025-02-19T23:00:29Z"
  },
  {
    "title": "HHS Updates Guidance Recognizing Two Sexes: Male and Female",
    "description": "I cannot believe we have to do this in 2025.\nThe post HHS Updates Guidance Recognizing Two Sexes: Male and Female first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/02/hhs-updates-guidance-recognizing-two-sexes-male-and-female/",
    "timestamp": "2025-02-19T23:00:13Z"
  },
  {
    "title": "Revealed: George Clooney's Surprise Message to Donald Trump AND the Democrats After Leftie A-Lister Was Hammered With Hate for 'Ousting' Joe Biden From Presidential Race",
    "description": "The liberal actor had a few shocking words for president Trump during his recent talk show appearance, which came after he urged Biden to step down last year.",
    "link": "https://radaronline.com/p/george-clooney-message-donald-trump-democrats-joe-biden-backlash-presidential-race/",
    "timestamp": "2025-02-19T23:00:00Z"
  },
  {
    "title": "How Many People Have Died in the Russia-Ukraine War?",
    "description": "President Donald Trump recently posted that \"millions\" have died in the war between Russia and Ukraine. Here are the latest casualties.",
    "link": "https://www.newsweek.com/people-died-casualties-russia-ukraine-war-update-2033371",
    "timestamp": "2025-02-19T22:59:55Z"
  },
  {
    "title": "EU trade chief promises 'firm and swift' response if US imposes tariffs",
    "description": "Europe is bracing for heightened tariff tensions with the United States.",
    "link": "https://www.thejournal.ie/eu-trade-chief-promises-firm-and-swift-response-if-us-imposes-tariffs-6627715-Feb2025/",
    "timestamp": "2025-02-19T22:58:54Z"
  },
  {
    "title": "Can the president override Congress on spending?",
    "description": "So the president can't spend more money than Congress has agreed and voted to spend. But can the president spend less money than Congress wants?It all comes down to something called \"impoundment\" and the Impoundment Control Act of 1974, which controls when an…",
    "link": "https://www.npr.org/2025/02/19/1232435554/impoundment-trump-usaid-doge",
    "timestamp": "2025-02-19T22:57:41Z"
  },
  {
    "title": "Trump's Labor Nominee Walks Back Pro-union Stances",
    "description": "Donald Trump's labor secretary nominee on Wednesday distanced herself from previous pro-union stances that sparked Republican criticism, as she called herself a champion of the US president's \"America First agenda.\"",
    "link": "https://www.ibtimes.com/trumps-labor-nominee-walks-back-pro-union-stances-3764330",
    "timestamp": "2025-02-19T22:57:13Z"
  },
  {
    "title": "Rallygoers protest Trump administration's job, budget cuts",
    "description": "Hundreds gathered outside the Department of Health and Human Services on Wednesday, protesting the Trump administration's decision to slash jobs and budgets at multiple agencies.",
    "link": "https://www.wbaltv.com/article/fund-dont-freeze-washington-trump-administration-job-cuts/63842952",
    "timestamp": "2025-02-19T22:56:58Z"
  },
  {
    "title": "Trump’s likely spent millions going to sport events while slashing programs that help Americans",
    "description": "Donald Trump and his associates have been spending money on all sorts of frivolous affairs as his administration slashes critical government functions.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/trump-super-bowl-daytona-500-government-efficiency-rcna192887",
    "timestamp": "2025-02-19T22:56:38Z"
  },
  {
    "title": "DOGE uncovers over 4M government credit cards responsible for 90M transactions - NewsBreak",
    "description": "The Department of Government Efficiency announced on X Tuesday that it had uncovered over four million government credit cards that spent nearly $40 billio",
    "link": "https://www.newsbreak.com/share/3820237293103-doge-uncovers-over-4m-government-credit-cards-responsible-for-90m-transactions?_f=app_share&amp;pd=0JRH97Hc&amp;lang=en_US&amp;send_time=1740005764&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.4.0.27%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v9%2Cns_foryou_rank_exp_25q1-v2%2Cns_foryou_recall_exp_25q1-v1%2Cns_foryou_blend_exp_25q1-v9&amp;s=i2",
    "timestamp": "2025-02-19T22:56:30Z"
  },
  {
    "title": "It took Donald Trump less than a decade to turn the US toward Putin’s Russia | CNN Politics",
    "description": "President Donald Trump defended the US taking part in peace talks that excluded Ukraine by rewriting history.",
    "link": "https://www.cnn.com/2025/02/19/politics/putin-trump-ukraine-war-what-matters/index.html",
    "timestamp": "2025-02-19T22:56:10Z"
  },
  {
    "title": "Elon Musk’s DOGE Ditches 100 Government Leases So Far",
    "description": "Elon Musk’s Department of Government Efficiency (DOGE) has revealed more details about the leases, contracts and programs it has cut so far in Washington, D.C., and around the country.  Less than one month into President Donald Trump’s second term, DOGE termi…",
    "link": "http://commercialobserver.com/2025/02/elon-musk-doge-government-leases-office/",
    "timestamp": "2025-02-19T22:55:54Z"
  },
  {
    "title": "Trump State Department declares Tren de Aragua, MS-13, Mexican drug cartels as foreign terrorist organizations",
    "description": "The Trump administration designated eight dangerous gangs and cartels, including Tren de Aragua, MS-13 and the Sinaloa Cartel, as foreign terrorist organizations.",
    "link": "https://www.foxnews.com/politics/trump-state-department-declares-tren-de-aragua-ms13-mexican-drug-cartels-foreign-terrorist-organizations",
    "timestamp": "2025-02-19T22:54:05Z"
  },
  {
    "title": "Jack Schlossberg goes on foul-mouthed tirade against DOGE after JFK Library shuts down over cuts to taxpayer-funded staff",
    "description": "Jack Schlossberg goes on foul-mouthed tirade against DOGE after JFK Library shuts down over cuts to taxpayer-funded staff Kennedy scion Jack Schlossberg unleashed a foul-mouthed rant against Elon Musk’s Department of Government Efficiency (DOGE) late Tuesday …",
    "link": "https://freerepublic.com/focus/f-chat/4298906/posts",
    "timestamp": "2025-02-19T22:52:13Z"
  },
  {
    "title": "Trump calls Zelensky a 'dictator'",
    "description": "Donald Trump has stepped up his verbal attacks on Volodymyr Zelensky, branding him a dictator who could lose his country, after the Ukrainian leader said the US president had been taken in by Russian disinformation. \n\nAlso in the programme: The Netherlands is…",
    "link": "https://www.bbc.co.uk/programmes/w172zb9d3c3d1vf",
    "timestamp": "2025-02-19T22:52:00Z"
  },
  {
    "title": "DOJ Prosecutors in Tennessee Refuse to Drop Jan. 6 Rioter’s Conviction for Conspiring to Murder FBI Agents and Police",
    "description": "President Donald Trump may have issued pardons to the Capitol rioters, but that doesn't let them evade consequences for other crimes, as Department of Justice prosecutors argued in a motion filed in a federal court in Tennessee opposing the efforts of a defen…",
    "link": "https://www.mediaite.com/crime/doj-prosecutors-in-tennessee-refuse-to-drop-jan-6-rioters-conviction-for-conspiring-to-murder-fbi-agents-and-police/",
    "timestamp": "2025-02-19T22:50:33Z"
  },
  {
    "title": "Federal judge waits to decide about dismissing corruption charges against NYC Mayor Eric Adams",
    "description": "A federal judge did not make a determination on Wednesday whether to dismiss corruption charges against New York City Mayor Eric Adams.",
    "link": "https://www.foxnews.com/politics/federal-judge-doesnt-decide-whether-dismiss-nyc-mayor-eric-adams-corruption-charges",
    "timestamp": "2025-02-19T22:49:46Z"
  },
  {
    "title": "The Christian nationalist legal scholar behind Trump’s purges",
    "description": "There are a lot of main characters in the second Trump administration. Donald Trump himself, of course, but also Elon Musk, Robert F. Kennedy Jr., and JD Vance.  Russell Vought does not make that list. The soft-spoken bureaucrat was recently confirmed to lead…",
    "link": "https://www.vox.com/today-explained-podcast/400358/russell-vought-omb-doge-project-2025",
    "timestamp": "2025-02-19T22:49:45Z"
  },
  {
    "title": "Pro-Trump sheriff announces campaign for CA Governor",
    "description": "Riverside County Sheriff Chad Bianco has announced his candidacy for California Governor. Bianco made the announcement Monday morning at an event in Riverside alongside supporters and other elected officials; it was also streamed on his personal Facebook page…",
    "link": "https://freerepublic.com/focus/f-news/4298904/posts",
    "timestamp": "2025-02-19T22:49:24Z"
  },
  {
    "title": "No Immediate Ruling On 'Unusual' Move To Drop New York Mayor Corruption Case",
    "description": "A US federal judge peppered a top member of Donald Trump's Justice Department with questions Wednesday during a hearing over the office's extraordinary move to drop corruption charges against New York Mayor Eric Adams.",
    "link": "https://www.ibtimes.com.au/no-immediate-ruling-unusual-move-drop-new-york-mayor-corruption-case-1856353",
    "timestamp": "2025-02-19T22:48:21Z"
  },
  {
    "title": "Who Will Hold Trump Accountable for Violating the Constitution?",
    "description": "Donald Trump is undermining the Constitution to expand his own power. What recourses do we have?",
    "link": "https://www.yesmagazine.org/video/ruws-trump-attacking-constitution",
    "timestamp": "2025-02-19T22:47:59Z"
  },
  {
    "title": "Hegseth could soon fire or remove generals and senior officers, US officials say",
    "description": "Hegseth could soon fire or remove generals and senior officers, US officials saygo.com",
    "link": "https://abcnews.go.com/Politics/hegseth-fire-remove-generals-senior-officers-us-officials/story?id=118985348",
    "timestamp": "2025-02-19T22:47:00Z"
  },
  {
    "title": "Trump Trades Barbs With Zelensky",
    "description": "The two leaders’ war of words has triggered a breakdown in U.S.-Ukraine relations.",
    "link": "https://foreignpolicy.com/2025/02/19/zelensky-trump-dictator-ukraine-elections-putin/",
    "timestamp": "2025-02-19T22:46:13Z"
  }
]