[
  {
    "title": "Musk Shocks Tesla Staff After Asking If Trump's Tariffs Were Affecting His Company: Report",
    "description": "Following the end of his temporary stint in government, billionaire Trump supporter Elon Musk has returned to his tech empire, surprising his own staff by inquiring about the impact of Trump tariffs upon his businesses.",
    "link": "https://www.ibtimes.com/musk-shocks-tesla-staff-after-asking-if-trumps-tariffs-were-affecting-his-company-report-3775091",
    "timestamp": "2025-06-03T15:58:12Z"
  },
  {
    "title": "Opinion: Why this year's G7 summit in Canada could be the most important one yet",
    "description": "Matthew Holmes: Canada could be the bridge that keeps the G7 together, linking economic security to the certainty that comes from common purpose",
    "link": "https://financialpost.com/news/economy/g7-summit-canada-most-important-one-yet",
    "timestamp": "2025-06-03T15:57:17Z"
  },
  {
    "title": "Native Americans hurt by Federal health cuts, despite RFK Jr.’s promises of protection",
    "description": "Navajo Nation leaders took turns talking with the U.S. government’s top health official as they hiked along a sandstone ridge overlooking their rural, high-dese",
    "link": "https://nbcmontana.com/news/local/native-americans-hurt-by-federal-health-cuts-despite-rfk-jrs-promises-of-protection",
    "timestamp": "2025-06-03T15:56:08Z"
  },
  {
    "title": "Young people on TikTok are trying to make the 80s happen again",
    "description": "Tired of the endless micro-trend cycle and muted tones of millennial grey, a growing number of young people are cosplaying a 1980s aesthetic and lifestyle",
    "link": "https://www.dazeddigital.com/beauty/article/66943/1/young-people-on-tiktok-trying-to-make-the-80s-happen-again?utm_source=Link&utm_medium=Link&utm_campaign=RSSFeed&utm_term=young-people-on-tiktok-are-trying-to-make-the-80s-happen-again",
    "timestamp": "2025-06-03T15:56:00Z"
  },
  {
    "title": "3. The role of the international community",
    "description": "Israelis broadly agree that the U.S. is helpful in the work toward lasting peace between Israelis and Palestinians, and that Iran is harmful.\nThe post 3. The role of the international community appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/global/2025/06/03/the-role-of-the-international-community/",
    "timestamp": "2025-06-03T15:55:40Z"
  },
  {
    "title": "Israeli Public Is Increasingly Skeptical About Lasting Peace",
    "description": "21% of Israelis think Israel and a Palestinian state can coexist peacefully, the lowest share since 2013.\nThe post Israeli Public Is Increasingly Skeptical About Lasting Peace appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/global/2025/06/03/israeli-public-is-increasingly-skeptical-about-lasting-peace/",
    "timestamp": "2025-06-03T15:55:36Z"
  },
  {
    "title": "Ford sees sales bump in May on employee pricing despite tariffs",
    "description": "Ford Motor Company (F)reported a 16% increase in year-over-year sales in May, led by an upticks in hybrid and traditional vehicle sales.Read more...",
    "link": "https://qz.com/ford-sees-sales-bump-may-employee-pricing-tariffs-1851783473",
    "timestamp": "2025-06-03T15:54:00Z"
  },
  {
    "title": "The great global unravelling",
    "description": "The US has lost its grip, Europe’s falling behind, China’s pushing forward — and nobody’s in charge",
    "link": "https://www.thehindubusinessline.com/opinion/the-great-global-unravelling/article69653697.ece",
    "timestamp": "2025-06-03T15:52:41Z"
  },
  {
    "title": "Harvey Weinstein's new trial is almost over. It could be a litmus test for #MeToo",
    "description": "Weinstein's sex crimes conviction in New York was overturned last year. In a new trial, three accusers have testified that Weinstein assaulted them. Closing arguments are underway.",
    "link": "https://www.npr.org/2025/06/03/nx-s1-5417917/harvey-weinstein-new-york-sex-crimes-trial-closing-arguments-me-too",
    "timestamp": "2025-06-03T15:52:01Z"
  },
  {
    "title": "As Federal Agencies Move Away From Checks, GAO Highlights $43 Billion in Card Payments",
    "description": "In March, President Donald Trump signed an executive order that mandated a shift away from paper checks for government-related transactions. Disbursements from federal agencies, payments to those agencies and transactions across supply chains will be done via…",
    "link": "http://www.pymnts.com/digital-payments/2025/federal-agencies-move-away-from-checks-government-accountability-office-highlights-43-billion-dollars-card-payments/",
    "timestamp": "2025-06-03T15:49:18Z"
  },
  {
    "title": "Russian rockets kill 3 in northeastern Ukraine as Kyiv claims it damaged Crimean bridge",
    "description": "The attack came a day after direct peace talks in Istanbul made no progress on ending the fighting.",
    "link": "https://www.pbs.org/newshour/world/russian-rockets-kill-3-in-northeastern-ukraine-as-kyiv-claims-it-damaged-crimean-bridge",
    "timestamp": "2025-06-03T15:46:56Z"
  },
  {
    "title": "What makes Trump’s new portrait different from his predecessors’ | CNN Politics",
    "description": "Trump’s new official portrait lacked two elements his predecessors had in their photographs in recent decades, including an American flag in the background.",
    "link": "https://www.cnn.com/2025/06/03/politics/trump-new-official-portrait-white-house",
    "timestamp": "2025-06-03T15:46:50Z"
  },
  {
    "title": "EXCLUSIVE: Comer hails DOJ's Biden probe as House investigation heats up",
    "description": "House Oversight Committee Chairman James Comer is praising the reported Trump administration probe into former President Biden's pardons.",
    "link": "https://www.foxnews.com/politics/exclusive-comer-hails-dojs-biden-probe-house-investigation-heats-up",
    "timestamp": "2025-06-03T15:46:15Z"
  },
  {
    "title": "Bryson DeChambeau hits golf balls on White House South Lawn during visit with Trump",
    "description": "The White House South Lawn was turned into a Par 3 course on Monday and Bryson DeChambeau took his shots on it after golfing with President Donald Trump.",
    "link": "https://www.outkick.com/sports/bryson-dechambeau-hits-golf-balls-south-lawn-white-house-trump-visit",
    "timestamp": "2025-06-03T15:46:06Z"
  },
  {
    "title": "TACO vs. the Game-Theoretic Art of the Deal",
    "description": "It is certain that President Trump’s reply to the TACO (“Trump Always Chickens Out”) accusation will not win him a Nobel prize in economics. The Wall Street Journal reports (“The ‘TACO Trade’ That Has Trump Fuming,” May 28, 2025):\nThe president rejected claim…",
    "link": "https://www.econlib.org/taco-vs-the-game-theoretic-art-of-the-deal/",
    "timestamp": "2025-06-03T15:45:34Z"
  },
  {
    "title": "Iowa health care center ends gender-affirming care for adult transgender patients",
    "description": "A federally funded health care center in central Iowa has terminated core care for its transgender patients for fear of losing federal funding, four sources have confirmed.",
    "link": "https://www.kcrg.com/2025/06/03/iowa-health-care-center-ends-gender-affirming-care-adult-transgender-patients/",
    "timestamp": "2025-06-03T15:44:56Z"
  },
  {
    "title": "The Meaning of Lee Jae-myung’s Election Triumph",
    "description": "Exit polls project a win for the veteran center-left leader—closing a tumultuous chapter in South Korea's politics, writes Ian Bremmer.",
    "link": "https://time.com/7290682/lee-jae-myung-south-korea-election-win/",
    "timestamp": "2025-06-03T15:44:43Z"
  },
  {
    "title": "Joy Reid rails against MSNBC for demanding silence before firing her",
    "description": "Joy Reid railed against her former employer, MSNBC, for ordering her not to use social media the way she wanted to. “Anytime I would tweet anything, I would get calls—I would get, ‘Please get off Twitter, we hate it,’” Reid said during an episode of Joy’s Hou…",
    "link": "https://www.rawstory.com/joy-reid-2672255934/",
    "timestamp": "2025-06-03T15:43:52Z"
  },
  {
    "title": "CNN polling expert marvels at collapse of Democratic advantage with middle class in Trump era",
    "description": "Democrats face declining trust on middle class issues as CNN polling shows Republicans closing the gap, challenging traditional party advantages.",
    "link": "https://www.foxnews.com/media/cnn-polling-expert-marvels-collapse-democratic-advantage-middle-class-trump-era",
    "timestamp": "2025-06-03T15:43:18Z"
  },
  {
    "title": "De-escalating to escalate: Ceasefire is no longer on the horizon in Ukraine",
    "description": "Despite pressure from Donald Trump and meetings in Istanbul, Kyiv and Moscow seem far from committed to ending the war.",
    "link": "https://www.aljazeera.com/opinions/2025/6/3/de-escalating-to-escalate-ceasefire-is-no-longer-on-the-horizon-in-ukraine",
    "timestamp": "2025-06-03T15:43:00Z"
  },
  {
    "title": "Putin Is a Gambler, not a Grand Master",
    "description": "The Russian president has abandoned real strategy for a single goal.",
    "link": "http://foreignpolicy.com/2025/06/03/russia-putin-ukraine-war-trump-strategy-politics/",
    "timestamp": "2025-06-03T15:42:14Z"
  },
  {
    "title": "Democrats could learn an important lesson from Trump's broken promises",
    "description": "As a candidate, Donald Trump staked out moderate and popular positions on key issues that Democrats could also run on.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-election-promises-immigration-project-47-rcna210394",
    "timestamp": "2025-06-03T15:40:07Z"
  },
  {
    "title": "Newark mayor sues Trump's NJ prosecutor Alina Habba over 'false arrest' at immigration jail",
    "description": "President Donald Trump has tapped Habba, his former defense lawyer, to serve as acting interim U.S. attorney for New Jersey.",
    "link": "https://www.cnbc.com/2025/06/03/trump-habba-baraka-lawsuit-ice.html",
    "timestamp": "2025-06-03T15:39:49Z"
  },
  {
    "title": "GOP Senator Insists 'Medicaid Cuts Are Going to Strengthen Medicaid' in Defense of Trump's 'Big, Beautiful Bill'",
    "description": "A Republican senator defended the Trump administration's spending bill by stating that the cuts to Medicaid the bill proposes will actually strengthen it.",
    "link": "https://www.ibtimes.com/gop-senator-insists-medicaid-cuts-are-going-strengthen-medicaid-defense-trumps-big-3775090",
    "timestamp": "2025-06-03T15:39:16Z"
  },
  {
    "title": "Depleted FEMA struggling as hurricane season begins",
    "description": "FEMA has lost a third of its workforce amid DOGE cuts enforced by President Donald Trump",
    "link": "https://theweek.com/politics/fema-struggles-hurricane-season-begins",
    "timestamp": "2025-06-03T15:37:52Z"
  },
  {
    "title": "Kathy Hochul's Chances of Losing New York Primary to Antonio Delgado: Polls",
    "description": "Polls suggest that most New Yorkers are unfamiliar with Delgado, but he has more than a year to make his case to voters.",
    "link": "https://www.newsweek.com/kathy-hochul-chances-losing-new-york-primary-antonio-delgado-polls-2080378",
    "timestamp": "2025-06-03T15:37:36Z"
  },
  {
    "title": "The Top Five Best UFC Knockouts Of All Time Ranked",
    "description": "We’re taking a look at the best UFC knockouts of all time, and ranking the top five most unforgettable stoppages...\nThe post The Top Five Best UFC Knockouts Of All Time Ranked appeared first on The Sports Daily.",
    "link": "https://thesportsdaily.com/news/the-top-five-best-ufc-knockouts-of-all-time-ranked/",
    "timestamp": "2025-06-03T15:37:07Z"
  },
  {
    "title": "‘I Was Like Wow!’ NBC Anchor Stunned Trump-Era Local News Dominated by Tariffs and Raids",
    "description": "NBC News anchor Tom Llamas told CNBC that he was stunned by how dominant Trump tariffs and immigration raids have been on local newscasts.\nThe post ‘I Was Like Wow!’ NBC Anchor Stunned Trump-Era Local News Dominated by Tariffs and Raids first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/i-was-like-wow-nbc-anchor-stunned-trump-era-local-news-dominated-by-tariffs-and-raids/",
    "timestamp": "2025-06-03T15:36:59Z"
  },
  {
    "title": "Ex-Democratic leader warns party is 'dying' as key issues leave voters wanting 'new way forward'",
    "description": "Gloria Romero praises bipartisan efforts in a debate highlighting border security and antisemitism, urging Democrats to move beyond identity politics.",
    "link": "https://www.foxnews.com/media/ex-democratic-leader-warns-party-dying-key-issues-leave-voters-wanting-new-way-forward",
    "timestamp": "2025-06-03T15:36:25Z"
  },
  {
    "title": "Desperate Michael Cohen, Others Forced to Beg Trump for Help After Being Ignored by Biden",
    "description": "Michael Cohen says Joe Biden must have been nuts not to pardon him, and now he wants President Donald Trump to do the job.",
    "link": "https://www.westernjournal.com/desperate-michael-cohen-others-forced-beg-trump-help-ignored-biden/",
    "timestamp": "2025-06-03T15:35:58Z"
  },
  {
    "title": "Major economy facing sharpest slowdown named",
    "description": "The Organization for Economic Co-operation and Development has slashed US growth outlook amid tariff-related policy uncertainty Read Full Article at RT.com",
    "link": "https://www.rt.com/business/618592-us-growth-forecast-slashed/",
    "timestamp": "2025-06-03T15:34:40Z"
  },
  {
    "title": "Here’s why she lost — Bernie Sanders bluntly dissects Kamala Harris’s collapse against Donald Trump in 2024",
    "description": "Bernie Sanders said Kamala Harris lost the 2024 election because her team didn’t focus on working-class issues. He blamed bad advice, rich allies, and celebrity support for making the campaign feel out of touch with everyday people.",
    "link": "https://economictimes.indiatimes.com/news/international/us/heres-why-she-lost-bernie-sanders-bluntly-dissects-kamala-harriss-collapse-against-donald-trump-in-2024/articleshow/121601840.cms",
    "timestamp": "2025-06-03T15:34:38Z"
  },
  {
    "title": "GHF names Rev. Dr. Johnnie Moore as Executive Chairman amid expanding aid efforts",
    "description": "Moore was interviewed by The Jerusalem Post earlier in May, where he spoke about Evangelical Christians and support for Israel.",
    "link": "https://www.jpost.com/middle-east/article-856426",
    "timestamp": "2025-06-03T15:34:03Z"
  },
  {
    "title": "Flurry of Executions Scheduled Over Four Days",
    "description": "Four men are scheduled to be executed in four states between June 10 and 13.",
    "link": "https://www.newsweek.com/flurry-executions-four-days-2080275",
    "timestamp": "2025-06-03T15:33:04Z"
  },
  {
    "title": "Swimming world body to banish athletes of PED-fueled Enhanced Games",
    "description": "Swimmers and officials who compete in and support The Enhanced Games will suffer consequences in the form of banishment, says the governing body for World Aquatics.",
    "link": "https://www.foxsports.com/stories/other/swimming-world-body-banish-athletes-ped-fueled-enhanced-games",
    "timestamp": "2025-06-03T15:32:25Z"
  },
  {
    "title": "Tory Leader Blurts Out the Truth: Britain Is at the Heart of Gaza ‘Proxy War’",
    "description": "If you have spent the past 20 months wondering why British leaders on both sides of the aisle have barely criticised Israel, even as it slaughtered and starved Gaza’s population of more than two million people, you finally got an answer last week. Conservativ…",
    "link": "https://www.antiwar.com/blog/2025/06/03/tory-leader-blurts-out-the-truth-britain-is-at-the-heart-of-gaza-proxy-war/",
    "timestamp": "2025-06-03T15:32:17Z"
  },
  {
    "title": "Wall Street stocks close higher, dollar bounces back amid tariff talks, economic data",
    "description": "NEW YORK :U.S. stocks advanced and the dollar rebounded on Tuesday as investors weighed progress in ongoing U.S. tariff talks and lowered economic expectations ahead of Friday's crucial U.S. employment report.All three major U.S. stock indexes ended the sessi…",
    "link": "https://www.channelnewsasia.com/business/wall-street-stocks-close-higher-dollar-bounces-back-amid-tariff-talks-economic-data-5163566",
    "timestamp": "2025-06-03T15:32:02Z"
  },
  {
    "title": "Wall Street advances, dollar bounces back amid tariff talks, economic data",
    "description": "NEW YORK :Wall Street stocks rose and the dollar rebounded on Tuesday as investors weighed progress in ongoing U.S. tariff talks and lowered economic expectations ahead of Friday's crucial U.S. employment report.All three major U.S. stock indexes advanced, wi…",
    "link": "https://www.channelnewsasia.com/business/wall-street-advances-dollar-bounces-back-amid-tariff-talks-economic-data-5163566",
    "timestamp": "2025-06-03T15:32:02Z"
  },
  {
    "title": "Trump's foreign student policies alarm Rep. Ro Khanna: They're 'embedded in Silicon Valley'",
    "description": "The warning from Silicon Valley's representative in Congress comes as the Trump administration rolls out visa restrictions targeting foreign students.",
    "link": "https://www.cnbc.com/2025/06/03/ro-khanna-silicon-valley-elon-musk-international-students.html",
    "timestamp": "2025-06-03T15:31:54Z"
  },
  {
    "title": "Illinois school board meeting madness continues as tensions escalate over trans athletes in girls' sports",
    "description": "Protests at Illinois school board meeting over trans athletes in girls' sports sparked national attention, with debates on federal law and state rights.",
    "link": "https://www.foxnews.com/sports/illinois-school-board-meeting-madness-continues-tensions-escalate-over-trans-athletes-girls-sports",
    "timestamp": "2025-06-03T15:30:49Z"
  },
  {
    "title": "DNC trolls Trump on tariffs with free 'TACO' truck parked outside RNC headquarters",
    "description": "The DNC rolled out a taco truck outside RNC headquarters to troll President Donald Trump on tariffs, using the Wall Street term \"TACO\" – \"Trump Always Chickens Out\" – to spotlight how he's backed off from tariffs.",
    "link": "https://www.foxnews.com/politics/dnc-trolls-trump-tariffs-free-taco-truck-parked-outside-rnc-headquarters",
    "timestamp": "2025-06-03T15:30:12Z"
  },
  {
    "title": "Trump Is Headed to War With the Federalist Society—and It’s Gonna Be Huge",
    "description": "Elie Mystal\n\n\n\nThe fight might between the president and the conservative old guard might just be the biggest legal development of Trump’s second term.\r\n\n\r\n\n\nThe post Trump Is Headed to War With the Federalist Society—and It’s Gonna Be Huge appeared first on …",
    "link": "https://www.thenation.com/article/politics/trump-war-federalist-society-leo/",
    "timestamp": "2025-06-03T15:29:58Z"
  },
  {
    "title": "Jasmine Crockett agrees during town hall that 'Republicans want poor people to die'",
    "description": "Rep. Jasmine Crockett agreed with former police officer who defended the U.S. Capitol on Jan. 6, 2021, that “Republicans want poor people to die as quickly as humanly possible,\" on Monday.",
    "link": "https://www.foxnews.com/politics/jasmine-crockett-agrees-during-town-hall-republicans-want-poor-people-die",
    "timestamp": "2025-06-03T15:29:16Z"
  },
  {
    "title": "Florida meteorologist halts forecast to give dire on-air warning against Trump",
    "description": "Miami meteorologist John Morales‬ issued a dire warning Monday about hurricane season as it begins this month. He began with a clip of Hurricane Dorian slowly moving due west directly towards Florida in 2019. Morales promised it would turn north and dodge Flo…",
    "link": "https://www.rawstory.com/hurricane-season-forcasting-noaa-nws/",
    "timestamp": "2025-06-03T15:28:45Z"
  },
  {
    "title": "US economic outlook slashed by OECD as Trump's tariffs upend global growth",
    "description": "\"Global economic prospects are weakening,\" the OECD said.",
    "link": "https://abcnews.go.com/Business/us-economic-outlook-slashed-oecd-trumps-tariffs-upend/story?id=122443152",
    "timestamp": "2025-06-03T15:28:21Z"
  },
  {
    "title": "50 Cent Shares Clips of Diddy Criticizing Trump Amid Pardon Speculation: 'Run Your Mouth Too Much'",
    "description": "Trump previously said he would \"look at the facts\" in the case.",
    "link": "https://www.complex.com/music/a/tracewilliamcowen/50-cent-shares-clips-diddy-criticizing-trump-amid-pardon-speculation",
    "timestamp": "2025-06-03T15:26:15Z"
  },
  {
    "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
    "description": "Markets closed lower on Tuesday with IT, financials, and rate-sensitive stocks dragging indices down. Investors remain cautious ahead of RBI’s policy and global fiscal concerns.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/121601848.cms",
    "timestamp": "2025-06-03T15:24:57Z"
  },
  {
    "title": "Newark Mayor Ras Baraka sues Alina Habba, alleging ‘false arrest and malicious prosecution’",
    "description": "Alina Habba's criminal case against Ras Baraka collapsed quickly. Now, the tables have turned, and the Newark mayor is suing the Trump-appointed prosecutor.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/newark-mayor-ras-baraka-sues-alina-habba-ice-arrest-rcna210629",
    "timestamp": "2025-06-03T15:21:32Z"
  },
  {
    "title": "Trump reaffirms hard line on Iran nuclear deal: 'will not allow any enrichment of uranium'",
    "description": "President Donald Trump denies U.S. proposal for Iran's uranium enrichment, contradicting reports as Iran insists on its right to enrich uranium amid nuclear talks.",
    "link": "https://www.foxnews.com/world/trump-reaffirms-hard-line-iran-nuclear-deal-will-not-allow-any-enrichment-uranium",
    "timestamp": "2025-06-03T15:20:44Z"
  },
  {
    "title": "Rand Paul Fires Back After Trump’s Brutal Attack: ‘Kentuckians Sent Me Here to Fight Reckless Debt’",
    "description": "Sen. Rand Paul (R-KY) hit back at President Donald Trump by doubling down on the criticism of the president's budget bill that set off Trump in the first place.\nThe post Rand Paul Fires Back After Trump’s Brutal Attack: ‘Kentuckians Sent Me Here to Fight Reck…",
    "link": "https://www.mediaite.com/media/tv/rand-paul-hits-back-following-trumps-brutal-attack-kentuckians-sent-me-here-to-fight-reckless-debt/",
    "timestamp": "2025-06-03T15:20:18Z"
  },
  {
    "title": "Trump criticizes Rand Paul over tax bill opposition: 'Votes no on everything'",
    "description": "Trump criticizes Rand Paul for opposing his \"big, beautiful bill,\" highlighting a GOP divide over the package's impact on national debt and fiscal policy.",
    "link": "https://www.foxnews.com/politics/trump-criticizes-rand-paul-over-tax-bill-opposition-votes-no-everything",
    "timestamp": "2025-06-03T15:19:58Z"
  },
  {
    "title": "The D Brief: DOD civilians, on the move; Ukraine-strike details; Trump’s nuke offer to Iran; Syria’s jihadis, in uniform?; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/06/the-d-brief-june-03-2025/405760/",
    "timestamp": "2025-06-03T15:19:51Z"
  },
  {
    "title": "MAGA Really, Really, Really, Really, Really, Really, Really Doesn't Like Tim Walz Saying We Need To \"Bully The Sh—t Out\" Of Donald Trump",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_ece2e266-61e2-4742-b284-683489d1e4ab",
    "timestamp": "2025-06-03T15:19:16Z"
  },
  {
    "title": "MAGA Really, Really, Really, Really, Really, Really, Really Doesn't Like Tim Walz Saying We Need To \"Bully The Sh—t Out\" Of Donald Trump",
    "description": "As you can imagine, MAGA was not pleased.View Entire Post ›",
    "link": "https://www.buzzfeed.com/alexalisitza/tim-walz-bully-trump",
    "timestamp": "2025-06-03T15:19:16Z"
  },
  {
    "title": "6 Nobel prize-winning economists wrote a letter opposing Trump's budget bill: 'We have grave concerns'",
    "description": "Economists are asking Congress to reconsider cuts to Medicaid and SNAP, which they say would hurt low-income Americans.",
    "link": "https://www.cnbc.com/2025/06/03/why-nobel-prize-winning-economists-oppose-trumps-budget-bill.html",
    "timestamp": "2025-06-03T15:19:11Z"
  },
  {
    "title": "Trump Says New Iran Deal Will Not Allow Uranium Enrichment, Contradicting Reports",
    "description": "President Donald Trump said Monday night the administration's new Iran nuclear deal would not include any uranium enrichment, contradicting prior reports.",
    "link": "https://dailycaller.com/2025/06/03/trump-says-new-iran-deal-will-not-allow-uranium-enrichment-contradicting-reports/",
    "timestamp": "2025-06-03T15:18:21Z"
  },
  {
    "title": "Senate Republics Battle Democrat Obstruction on Trump Nominees",
    "description": "One of the Senate’s biggest fights is happening right now, but it is not getting much attention. President Donald Trump still has around 100 nominees... Read More\nThe post Senate Republics Battle Democrat Obstruction on Trump Nominees appeared first on The Da…",
    "link": "https://www.dailysignal.com/2025/06/03/senate-republics-battle-democrat-obstruction-trump-nominees/",
    "timestamp": "2025-06-03T15:17:41Z"
  },
  {
    "title": "Trump Pardons 2 Divers Who Freed 19 Sharks Off Florida Coast",
    "description": "Tanner Mansell and John Moore Jr. were pardoned Monday after being convicted in 2022 for theft of property within special maritime jurisdiction.",
    "link": "https://www.huffpost.com/entry/trump-pardons-2-divers-who-freed-19-sharks-off-florida-coastons_n_683f0fb4e4b02a49cce71cdd",
    "timestamp": "2025-06-03T15:17:05Z"
  },
  {
    "title": "Democrats Will Hand Out Free Tacos to Mock Trump",
    "description": "The Democratic Party has commissioned a taco truck to serve free lunch outside the Republican National Committee’s DC headquarters beginning at noon on Tuesday. “Trump always chickens out—we’re just bringing the tacos to match.” The giveaway is not just to ma…",
    "link": "https://www.motherjones.com/politics/2025/06/taco-truck-donald-trump-always-chickens-out/",
    "timestamp": "2025-06-03T15:15:00Z"
  },
  {
    "title": "‘The Ban Is Lifted!’ Steve Bannon’s Podcast Returns to Spotify Five Years After Beheadings Controversy",
    "description": "Spotify has over 268 million subscribers and has been a key driver behind the rise of podcasting and alternative media in recent years\nThe post ‘The Ban Is Lifted!’ Steve Bannon’s Podcast Returns to Spotify Five Years After Beheadings Controversy first appear…",
    "link": "https://www.mediaite.com/media/podcasts/the-ban-is-lifted-steve-bannons-podcast-returns-to-spotify-five-years-after-beheadings-controversy/",
    "timestamp": "2025-06-03T15:14:35Z"
  },
  {
    "title": "Trump DOJ Probes Biden Pardons Amid Autopen, Competency Questions",
    "description": "President Donald Trump’s Justice Department is investigating last-minute pardons issued by former President Joe Biden to his family members and federal death row inmates.\nIn an internal email seen by Reuters, Pardon Attorney Ed Martin said he was directed to …",
    "link": "https://biztoc.com/x/cb6d7798dd54042f",
    "timestamp": "2025-06-03T15:13:36Z"
  },
  {
    "title": "U.S. to scale down its military bases in Syria, envoy says",
    "description": "The new envoy to Syria says the U.S. is changing its century-old policy in Damascus. Military equipment and vehicles have already been moved out of the eastern Deir el-Zor",
    "link": "https://www.haaretz.com/israel-news/2025-06-03/ty-article/u-s-to-scale-down-its-military-bases-in-syria-envoy-says/00000197-3624-da41-a9f7-3fa40e0c0000",
    "timestamp": "2025-06-03T15:13:35Z"
  },
  {
    "title": "Trump tells Iran sanctions will remain until it ends nuclear programme",
    "description": "US demands Iran end all uranium-enrichment activities, including those relating to power generation and medical treatment",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/03/us-iran-uranium/",
    "timestamp": "2025-06-03T15:13:17Z"
  },
  {
    "title": "Elon Musk backer Tim Draper says Bitcoin will rule retail — dollar’s days may be numbered, he warns",
    "description": "Venture capitalist Tim Draper forecasts a decline in the US dollar's value. He anticipates a shift towards Bitcoin as retailers begin to favor it. Draper, a long-time Bitcoin advocate, highlights its potential stability. The US Dollar Index faces challenges, …",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musk-backer-tim-draper-says-bitcoin-will-rule-retail-dollars-days-may-be-numbered-he-warns-bitcoin-news-us-dollar-news/articleshow/121601112.cms",
    "timestamp": "2025-06-03T15:13:01Z"
  },
  {
    "title": "Russia says no quick breakthrough in ‘complex’ Ukraine talks",
    "description": "Russia on Tuesday said it was wrong to expect a quick breakthrough in Ukraine talks, a day after Moscow rejected Kyiv’s call for an unconditional ceasefire at negotiations in Istanbul. The sides agreed on a large-scale swap of captured soldiers and exchanged …",
    "link": "https://www.digitaljournal.com/world/russia-says-no-quick-breakthrough-in-complex-ukraine-talks/article",
    "timestamp": "2025-06-03T15:12:20Z"
  },
  {
    "title": "Ukraine's Drones Just Took Down a Chunk of Russia's Bomber Fleet. What Does That Mean for America?",
    "description": "When anyone can have an air force, superpowers aren't as powerful as they used to be.",
    "link": "https://reason.com/2025/06/03/ukraines-drones-just-took-down-a-chunk-of-russias-bomber-fleet-what-does-that-mean-for-america/",
    "timestamp": "2025-06-03T15:08:35Z"
  },
  {
    "title": "CNBC Drops Brutal Breakdown on ‘Real Cost’ of Trump Tariffs",
    "description": "CNBC senior retail reporter Courtney Reagan dropped a brutal and exclusive breakdown on the \"real cost\" of Trump's tariffs. Spoiler alert: it's a lot.\nThe post CNBC Drops Brutal Breakdown on ‘Real Cost’ of Trump Tariffs first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnbc-drops-brutal-breakdown-on-real-cost-of-trump-tariffs/",
    "timestamp": "2025-06-03T15:06:27Z"
  },
  {
    "title": "Indo-Pak conflict: PM Modi surrendered after Trump's call, says Rahul Gandhi",
    "description": "Rahul Gandhi alleged that Prime Minister Modi surrendered to US pressure during a military conflict with Pakistan, contrasting it with Indira Gandhi's firm stance in 1971. He accused the BJP-RSS of undermining the Constitution and favoring select industrialis…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/indo-pak-conflict-pm-modi-surrendered-after-trumps-call-says-rahul-gandhi/articleshow/121601624.cms",
    "timestamp": "2025-06-03T15:06:26Z"
  },
  {
    "title": "Trump rages against Amy Coney Barrett in meltdowns over rulings: sources",
    "description": "A new CNN report claims \r\nPresident Donald Trump “has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda.”The outlet cites multiple sources who are familiar with more than one conversation. Justices…",
    "link": "https://www.rawstory.com/trump-scotus-2672255846/",
    "timestamp": "2025-06-03T15:05:33Z"
  },
  {
    "title": "Palantir defies tech gloom as Trump momentum powers stellar share gains",
    "description": "Palantir Technologies has succeeded where most tech stocks have struggled this year: staying hot in a cooling market.The company's military-grade AI tools along with its deep defense ties and high-level government connections at a time when the U.S. is boosti…",
    "link": "https://www.channelnewsasia.com/business/palantir-defies-tech-gloom-trump-momentum-powers-stellar-share-gains-5164566",
    "timestamp": "2025-06-03T15:05:08Z"
  },
  {
    "title": "HHS ends Biden-era COVID-19 testing program that bled taxpayers years after pandemic",
    "description": "The Department of Health and Human Services announced it is shuttering a nationwide program that offered free COVID-19 tests to community organizations, citing it bled taxpayer funds despite the pandemic's end.",
    "link": "https://www.foxnews.com/politics/hhs-ends-biden-era-covid-19-testing-program-bled-taxpayers-years-after-pandemic",
    "timestamp": "2025-06-03T15:05:06Z"
  },
  {
    "title": "Don Jr. GRILLED by CNBC Hosts About Trump Meme Coin: ‘As Bad as Hunter’s Art’",
    "description": "The hosts of CNBC's Squawk Box grilled Donald Trump Jr. about the $TRUMP meme coin — which has been heavily criticized by ethics watchdogs\nThe post Don Jr. GRILLED by CNBC Hosts About Trump Meme Coin: ‘As Bad as Hunter’s Art’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/don-jr-grilled-by-cnbc-hosts-about-trump-meme-coin-as-bad-as-hunters-art/",
    "timestamp": "2025-06-03T15:03:38Z"
  },
  {
    "title": "US Wants Vietnam To Cut Trade With China As Part Of Tariff Deal",
    "description": "The Donald Trump government wants Vietnam to cut back on its imports from China if it wants to avoid 46% “reciprocal” tariffs on shipments to the United States.\nThe demand is part of a “long” list of “tough” requests the Trump administration has sent to Vietn…",
    "link": "https://biztoc.com/x/33cffce392e23e0e",
    "timestamp": "2025-06-03T15:02:36Z"
  },
  {
    "title": "Rand Paul Doesn’t Get The Big Growth Bill: Trump",
    "description": "President Donald Trump on Tuesday slammed Senator Rand Paul for opposing the administration’s sweeping Big, Beautiful, Bill (BBB), accusing the Kentucky Republican of offering “crazy” ideas and blocking progress without alternatives. \nIn a post on Truth Socia…",
    "link": "https://biztoc.com/x/79e1bae6393700f8",
    "timestamp": "2025-06-03T15:02:29Z"
  },
  {
    "title": "Gold price prediction: Why did gold fall after hitting a 4-week high and could it rebound soon amid U.S. dollar strength, trade tensions, and key economic data?",
    "description": "Gold prices retreat after briefly hitting a four-week high on June 3, as a stronger U.S. dollar and profit-taking pressure the market. Spot gold dropped 0.7% to $3,356.75 an ounce, while U.S. futures slipped 0.5%. Investors are closely watching trade tensions…",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-prediction-why-did-gold-fall-after-hitting-a-4-week-high-and-could-it-rebound-soon-amid-u-s-dollar-strength-trade-tensions-and-key-economic-data/articleshow/121598505.cms",
    "timestamp": "2025-06-03T15:00:37Z"
  },
  {
    "title": "Trump privately complains about Amy Coney Barrett and other Supreme Court justices he nominated",
    "description": "President Donald Trump has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda, according to multiple sources familiar with the conversations. But he has directed particular ire at Justice Amy Coney …",
    "link": "https://freerepublic.com/focus/f-news/4320726/posts",
    "timestamp": "2025-06-03T15:00:37Z"
  },
  {
    "title": "RFK Jr. gives his Covid vaccine advice | June 3 editorial cartoons",
    "description": "Tuesday's political cartoons include RFK Jr. and the CDC, Elon Musk's DOGE exit, and Donald Trump versus academic freedom",
    "link": "https://theweek.com/cartoons/june-3-editorial-cartoons",
    "timestamp": "2025-06-03T15:00:00Z"
  },
  {
    "title": "Pentagon Aligns Greenland with the U.S.",
    "description": "\"The Pentagon is poised to shift its oversight of Greenland by putting it under U.S. Northern Command, a symbolic gesture that would more closely align the island territory with the U.S. as President Donald Trump",
    "link": "https://politicalwire.com/2025/06/03/pentagon-aligns-greenland-with-the-u-s/",
    "timestamp": "2025-06-03T14:59:02Z"
  },
  {
    "title": "Swimming world body to banish athletes and supporters of doping-fueled event in Las Vegas",
    "description": "Swimmers and officials who compete in and support a doping-fueled sports event planned in Las Vegas will be banished from the sport, the governing body World Aquatics said on Tuesday. Organizers of the Enhanced Games scheduled next May promise $1 million bonu…",
    "link": "https://sports.yahoo.com/article/swimming-world-body-banish-athletes-145855411.html",
    "timestamp": "2025-06-03T14:58:55Z"
  },
  {
    "title": "Murder Rates Plummet Under President Trump",
    "description": "President Donald Trump’s law and order agenda is to thank for the murder rate dropping by 20% this year so far, the White House said... Read More\nThe post Murder Rates Plummet Under President Trump appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/03/murder-rates-plummet-under-president-trump/",
    "timestamp": "2025-06-03T14:56:51Z"
  },
  {
    "title": "US Stocks Wobble at the Open as Growth Concerns Return",
    "description": "US equities fluctuated at the open on Tuesday, as concerns about growth resurfaced after Paris-based OECD warned that Donald Trump’s trade policies have tipped the world economy into a downturn.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-wobble-at-the-open-as-growth-concerns-return",
    "timestamp": "2025-06-03T14:56:17Z"
  },
  {
    "title": "Savannah Chrisley Details Todd and Julie Chrisley’s Life After Prison",
    "description": "Todd Chrisley and Julie Chrisley have been making up for lost time.\nNearly a week after the Chrisley Knows Best alums were released from prison after receiving pardons from President Donald Trump,...",
    "link": "https://www.eonline.com/news/1418258/savannah-chrisley-details-todd-julies-life-after-prison",
    "timestamp": "2025-06-03T14:55:30Z"
  },
  {
    "title": "Trump ramps up criticism of Republican senators who could stall his funding bill",
    "description": "Trump is ramping up his criticism of GOP senators who are threatening to complicate the passage of the \"One Big Beautiful Bill Act.\"",
    "link": "https://abcnews.go.com/Politics/trump-ramps-criticism-republican-senators-stall-funding-bill/story?id=122447199",
    "timestamp": "2025-06-03T14:54:12Z"
  },
  {
    "title": "CDC Decides America’s Children Could Do With More Lead In Their Blood",
    "description": "With all the conversations weve had in the past few months about the decline of the Department of Health and Human Services (HHS) under the leadership, or lack thereof, of RFK Jr. and Donald Trump, you might have been left with the impression that everything …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177908825",
    "timestamp": "2025-06-03T14:52:27Z"
  },
  {
    "title": "Exit poll shows liberal candidate Lee forecast to win South Korean presidential election",
    "description": "The exit poll by South Korea's three major TV stations showed Lee projected to get 51.7% of the total votes cast during Tuesday's election, beating conservative candidate Kim Moon Soo with 39.3%.",
    "link": "https://www.pbs.org/newshour/world/exit-poll-shows-liberal-candidate-lee-forecast-to-win-south-korean-presidential-election",
    "timestamp": "2025-06-03T14:52:07Z"
  },
  {
    "title": "Former ‘Anonymous’ Author Files Legal Challenge Over Trump Memo Targeting Him",
    "description": "Miles Taylor filed a complaint urging DHS and DOJ to investigate Trump for allegedly weaponizing government to punish political dissent.",
    "link": "https://time.com/7290748/trump-miles-taylor-treason-legal-challenge/",
    "timestamp": "2025-06-03T14:51:42Z"
  },
  {
    "title": "Hunter Biden’s Favorite Prostitute Charged With Manslaughter",
    "description": "One of Hunter Biden’s favorite prostitutes and drug buddies was charged with manslaughter in Nevada this year after allegedly bringing drugs into a jail, leading to another inmate’s death. Cheryl Ann Deboves was arraigned on involuntary manslaughter and drug …",
    "link": "https://freerepublic.com/focus/f-chat/4320724/posts",
    "timestamp": "2025-06-03T14:50:58Z"
  },
  {
    "title": "Republicans cling to brazen falsehoods to sell their far-right megabill",
    "description": "The question Americans should ask themselves is simple: If the Republicans' domestic policy package is so great, why can’t the party tell the truth about it?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republicans-cling-brazen-falsehoods-sell-far-right-megabill-rcna210607",
    "timestamp": "2025-06-03T14:50:50Z"
  },
  {
    "title": "This Pride Month, Let’s Fight Back by Learning From History of Trans Resistance",
    "description": "In the fight for dignity and democracy, trans people have much to teach.",
    "link": "https://tomdispatch.com/the-war-on-trans-people/",
    "timestamp": "2025-06-03T14:50:36Z"
  },
  {
    "title": "'He Chose Billionaires': New Ad Targets Vulnerable Republican Over Vote to Gut Medicaid",
    "description": "Republican Rep. Don Bacon of Nebraska, one of the House lawmakers most vulnerable to losing their seats in the 2026 midterms, was the target of a new ad that aired Tuesday as part of a nationwide campaign to draw public attention and outrage to the GOP plan t…",
    "link": "https://www.commondreams.org/news/don-bacon-medicaid-cuts",
    "timestamp": "2025-06-03T14:49:24Z"
  },
  {
    "title": "The Truth About Diddy Might Be Darker Than the Rumors",
    "description": "The conspiratorial guesswork distracts from the all-too-ordinary issues at the center of his case.",
    "link": "https://www.theatlantic.com/culture/archive/2025/06/diddy-trial-allegations-rumors/683015/",
    "timestamp": "2025-06-03T14:48:32Z"
  },
  {
    "title": "Trump Loses It at Rand Paul as GOP Budget Bill Seems Doomed in Senate",
    "description": "Donald Trump decided to start his Tuesday morning by attacking Republican Senator Rand Paul.\r\n“Rand Paul has very little understanding of the BBB, especially the tremendous GROWTH that is coming,” Trump angrily posted on Truth Social, referring to the budget …",
    "link": "https://newrepublic.com/post/196040/trump-rand-paul-republican-budget-bill-deficit",
    "timestamp": "2025-06-03T14:47:39Z"
  },
  {
    "title": "ICE Arrests Migrant for Drunk Driving. He Has No Car and Can't Drive",
    "description": "Masked agents grabbed the man from his work site on Maple Avenue in Great Barrington, Massachusetts.",
    "link": "https://www.newsweek.com/ice-arrests-migrant-drunk-driving-no-car-2080265",
    "timestamp": "2025-06-03T14:46:31Z"
  },
  {
    "title": "Inmate admits writing Trump threat letters to frame migrant, court filing says",
    "description": "According to a court filing Monday, Ramon Morales-Reyes was framed by another inmate so he would no longer be able to testify against him in an upcoming trial.",
    "link": "https://abcnews.go.com/US/inmate-admits-writing-trump-threat-letters-frame-migrant/story?id=122448893",
    "timestamp": "2025-06-03T14:46:12Z"
  }
]