[
  {
    "title": "Mayor Adams to headline crypto convention in Vegas— on taxpayer’s dime",
    "description": "Mayor Eric Adams is heading to Vegas tomorrow on the taxpayers' dime, where he's slated to talk bitcoin at a crypto industry convention, The Post has learned.",
    "link": "https://nypost.com/2025/05/27/us-news/mayor-adams-to-headline-crypto-convention-in-vegas-tomorrow-on-taxpayers-dime/",
    "timestamp": "2025-05-27T22:55:41Z"
  },
  {
    "title": "King's Canadian speech doesn't mention you-know-who",
    "description": "There were calls for Canada to remain \"strong and free\" in what King Charles called a \"critical moment\".",
    "link": "https://www.bbc.com/news/articles/c5y84pn0erxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-27T22:54:12Z"
  },
  {
    "title": "‘Game Over’: Senate GOP Readies Sanction Push To Force Russia To Negotiating Table With Ukraine",
    "description": "Prominent Republican senators are urging President Donald Trump to get behind a Russian sanctions push that would escalate economic pressure on the country",
    "link": "https://dailycaller.com/2025/05/27/senate-gop-sanction-push-russia-ukraine/",
    "timestamp": "2025-05-27T22:53:46Z"
  },
  {
    "title": "Who are Todd and Julie Chrisley? What to Know After Donald Trump Pardon",
    "description": "President Donald Trump has pardoned Todd and Julie Chrisley, reality TV stars from the series 'Chrisley Knows Best.' Here's a closer look at the couple.",
    "link": "https://www.newsweek.com/todd-julie-chrisley-prison-donald-trump-pardon-2077728",
    "timestamp": "2025-05-27T22:53:14Z"
  },
  {
    "title": "Ramaphosa Recalls His Bemusement at Trump Oval Office Encounter - Bloomberg.com",
    "description": "Ramaphosa Recalls His Bemusement at Trump Oval Office EncounterBloomberg.com Trump Showed Images of ‘Genocide’ in South Africa. One Was From the War in Congo.The New York Times South Africa’s president jokes about Trump dust-upPolitico Cyril Ramaphosa keeps h…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177818075",
    "timestamp": "2025-05-27T22:52:39Z"
  },
  {
    "title": "President Trump Pardons Todd & Julie Chrisley",
    "description": "Todd and Julie Chrisley will go free, thanks to President Donald Trump.\n The reality stars just received full pardons from the POTUS after they were convicted of tax evasion and bank fraud in 2022. Todd and Julie reported to separate prisons in January 2023.\n…",
    "link": "https://extratv.com/2025/05/27/president-trump-pardons-todd-and-julie-chrisley/",
    "timestamp": "2025-05-27T22:50:49Z"
  },
  {
    "title": "S&P 500 surges after surprising consumer confidence report",
    "description": "The stock market has been on a tear since President Donald Trump paused most reciprocal tariffs on April 9. The S&P 500 has gained nearly 20%, including a stretch of nine consecutive up days. The technology-heavy Nasdaq Composite has done even better, returni…",
    "link": "https://biztoc.com/x/24c1b2d0e6255f31",
    "timestamp": "2025-05-27T22:48:20Z"
  },
  {
    "title": "Trump says working on taking Fannie Mae, Freddie Mac public",
    "description": "United States President Donald Trump said that he is working on taking two government-sponsored mortgage giants, the Federal National Mortgage Association (Fannie Mae) and the Federal Home Loan Mortga...",
    "link": "https://biztoc.com/x/c9215277abb9b35a",
    "timestamp": "2025-05-27T22:48:17Z"
  },
  {
    "title": "Goldbugs upbeat on price",
    "description": "Gold prices could soar to US$3,700 an ounce later this year, from around $3,300 now, if the US and China fail to reach an agreement on trade and tariffs, says local trader YLG Group.",
    "link": "https://www.bangkokpost.com/business/investment/3036115/goldbugs-upbeat-on-price",
    "timestamp": "2025-05-27T22:48:00Z"
  },
  {
    "title": "Exasperated Judge Smacks Down Trump Executive Order by Dropping 26 Exclamation Marks in Ruling",
    "description": "It is extraordinarily rare to see a judge use an exclamation point in a written opinion, but one federal judge deployed more than two dozen on Tuesday to strike down one of President Donald Trump's executive orders targeting a law firm.\nThe post Exasperated J…",
    "link": "https://www.mediaite.com/lawcrime/exasperated-judge-smacks-down-trump-executive-order-by-dropping-26-exclamation-marks-in-ruling/",
    "timestamp": "2025-05-27T22:47:23Z"
  },
  {
    "title": "The US is squandering its two most important privileges",
    "description": "In 1965, then-French finance minister Valéry Giscard d’Estaing came up with the mot juste for describing the way that the supremacy of the dollar provided the foundation for the financial supremacy of the US. The fact the dollar was so dominant in internation…",
    "link": "https://www.vox.com/future-perfect/414544/trump-administration-harvard-universities-foreign-students-science",
    "timestamp": "2025-05-27T22:47:23Z"
  },
  {
    "title": "Trump’s Latest Move in His Battle with Harvard Is Blatantly Illegal",
    "description": "His administration actually cites civil rights law in a letter to the university.",
    "link": "https://www.esquire.com/news-politics/politics/a64896004/harvard-trump-title-vii-trade-schools/",
    "timestamp": "2025-05-27T22:47:00Z"
  },
  {
    "title": "The problem with pessimism",
    "description": "At various points in my life, I’ve been very pessimistic about a variety of things. In 2008, it was monetary policy. Today, it’s fiscal policy and authoritarian nationalism. At the same time, I’ve never been so pessimistic that I started planning a move to Ca…",
    "link": "https://www.econlib.org/the-problem-with-pessimism/",
    "timestamp": "2025-05-27T22:46:06Z"
  },
  {
    "title": "Maura Healey’s hiring freeze begs the question of who should follow suit: Bruce Tarr",
    "description": "Massachusetts' executive branch hiring freeze went into effect on Tuesday, and the idea has got one member of the State Senate wondering if the chill should spread to other parts of the state payroll.",
    "link": "https://www.bostonherald.com/2025/05/27/maura-healeys-hiring-freeze-begs-the-question-of-who-should-follow-suit-bruce-tarr/",
    "timestamp": "2025-05-27T22:42:25Z"
  },
  {
    "title": "Kevin Bacon’s Wife, Actress Kyra Sedgwick, Rants About Losing Rights Under Trump While Promoting ‘Hands Off’ Protest",
    "description": "Kevin Bacon's wife, actress Kyra Sedgwick, ranted about \"losing rights as a woman\" under President Donald Trump while promoting a \"Hands Off\" protest.\nThe post Kevin Bacon’s Wife, Actress Kyra Sedgwick, Rants About Losing Rights Under Trump While Promoting ‘H…",
    "link": "https://www.breitbart.com/entertainment/2025/05/27/kevin-bacons-wife-actress-kyra-sedgwick-rants-about-losing-rights-under-trump-while-promoting-hands-off-protest/",
    "timestamp": "2025-05-27T22:41:22Z"
  },
  {
    "title": "Trump to pardon reality TV stars Julie and Todd Chrisley of fraud, tax evasion convictions",
    "description": "WASHINGTON -- The White House said Tuesday that President Donald Trump is set to pardon reality TV stars Julie and Todd Chrisley, the couple famous for “Chrisle",
    "link": "https://weartv.com/news/local/trump-to-pardon-reality-tv-stars-julie-and-todd-chrisley-of-fraud-tax-evasion-convictions",
    "timestamp": "2025-05-27T22:39:35Z"
  },
  {
    "title": "Trump to pardon reality TV couple convicted on federal fraud charges",
    "description": "President Donald Trump called two of the children of imprisoned reality television couple Todd and Julie Chrisley from the Oval Office on Tuesday, informing them of his plans to pardon their parents as soon as Wednesday.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-pardon-reality-tv-couple-convicted-federal-fraud-charges-rcna209349",
    "timestamp": "2025-05-27T22:39:04Z"
  },
  {
    "title": "Trump to pardon reality TV stars Todd and Julie Chrisley, convicted of fraud and tax evasion",
    "description": "President Donald Trump said Tuesday that he will pardon reality television stars Todd and Julie Chrisley, who were convicted of tax evasion and bank fraud, and sentenced to several years behind bars.\n\"It's a terrible thing, but it's a great thing because your…",
    "link": "https://biztoc.com/x/7583ae542c400127",
    "timestamp": "2025-05-27T22:36:49Z"
  },
  {
    "title": "‘Considering the offer!’ Trump offers Canada missile shield – at a price",
    "description": "President Donald Trump claimed Tuesday that Canada is weighing an offer to become the 51st U.S. state to dodge a $61 billion fee for joining what he called his \"fabulous\" so-called Golden Dome missile shield. “I told Canada, which very much wants to be part o…",
    "link": "https://www.rawstory.com/trump-canada-2672215922/",
    "timestamp": "2025-05-27T22:34:39Z"
  },
  {
    "title": "Trump's Media Startup To Buy $2.5 Billion In Bitcoin Amid His Crypto Push",
    "description": "Trump Media & Technology Group, which owns Truth Social, said it intends to create a “bitcoin Treasury,\" allowing it to expand into crypto and financial services.",
    "link": "https://www.huffpost.com/entry/trump-media-to-buy-25-billion-in-bitcoin-amid-potus-crypto-push_n_683604dbe4b0b885650d79aa",
    "timestamp": "2025-05-27T22:34:39Z"
  },
  {
    "title": "California track star's family reacts to Trump shaking up girls' championship meet amid trans athlete drama",
    "description": "A California family shares its reaction to President Donald Trump shaking up a championship meet where the family's daughter will face at rans athlete.",
    "link": "https://www.foxnews.com/sports/california-family-grateful-trump-wades-states-transgender-athlete-controversy",
    "timestamp": "2025-05-27T22:34:07Z"
  },
  {
    "title": "Trump to pardon reality TV stars Todd and Julie Chrisley, convicted of fraud and tax evasion",
    "description": "President Donald Trump has granted many high-profile pardons since returning to the White House, including for individuals convicted of white-collar crimes.",
    "link": "https://www.cnbc.com/2025/05/27/trump-pardons-todd-julie-chrisley-reality-tv.html",
    "timestamp": "2025-05-27T22:34:07Z"
  },
  {
    "title": "Trump to Pardon Reality TV Stars Todd and Julie Chrisley, Who Were Convicted for Fraud, Tax Evasion",
    "description": "President Trump said he will pardon Julie and Todd Chrisley, who were convicted of conspiracy to defraud banks out of more than $30 million in 2022.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-pardons-todd-julie-chrisley-fraud-tax-evasion-1235349035/",
    "timestamp": "2025-05-27T22:33:17Z"
  },
  {
    "title": "It Appears That 2025’s “Summer Of Chaos” Is Off To An Early Start",
    "description": "This summer, vast numbers of radical leftists that absolutely hate Donald Trump, vast numbers of protesters that are deeply angry about the war in the Middle East, vast numbers of people that are in this country illegally, and vast numbers of ultra-violent pr…",
    "link": "https://www.shtfplan.com/conspiracy-fact-and-theory/it-appears-that-2025s-summer-of-chaos-is-off-to-an-early-start",
    "timestamp": "2025-05-27T22:30:44Z"
  },
  {
    "title": "Trump’s Government of Billionaires",
    "description": "From the daily newsletter: how we ended up with an oligarch-in-chief. Plus: Plus: the consequences of a lack of consensus on A.I.; and the latest addition to the rich-people-suck genre.",
    "link": "https://www.newyorker.com/newsletter/the-daily/the-fight-against-trumps-pay-to-play-politics",
    "timestamp": "2025-05-27T22:30:00Z"
  },
  {
    "title": "Tennessee Congressman Vows to Investigate Nashville Mayor on ICE Cooperation",
    "description": "Rep. Andy Ogles, R-Tenn., is spearheading an effort to ensure the Nashville city government in his state is cooperating with federal immigration enforcement. Nashville is... Read More\nThe post Tennessee Congressman Vows to Investigate Nashville Mayor on ICE C…",
    "link": "https://www.dailysignal.com/2025/05/27/tennessee-congressman-vows-investigate-nashville-mayor-illegal-immigrants/",
    "timestamp": "2025-05-27T22:30:00Z"
  },
  {
    "title": "US adversaries trash Trump’s $175 billion Golden Dome missile shield as ‘dangerous’ threat",
    "description": "US foes call Trump's Golden Dome 'arrogant.'",
    "link": "https://nypost.com/2025/05/27/us-news/russia-china-north-korea-trash-trumps-175-billion-golden-dome-missile-shield-as-dangerous/",
    "timestamp": "2025-05-27T22:29:53Z"
  },
  {
    "title": "Harvard Professor Slams Trump’s Crackdown in Scathing NYT Op-Ed: ‘None of This is Good for the Jews’",
    "description": "“The concern for Jews is patently disingenuous, given Mr. Trump’s sympathy for Holocaust deniers and Hitler fans.\"\nThe post Harvard Professor Slams Trump’s Crackdown in Scathing NYT Op-Ed: ‘None of This is Good for the Jews’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/harvard-professor-slams-trumps-crackdown-in-scathing-nyt-op-ed-none-of-this-is-good-for-the-jews/",
    "timestamp": "2025-05-27T22:27:45Z"
  },
  {
    "title": "Melania Trump found the perfect narrator for her soulless audiobook",
    "description": "Melania Trump is having her memoir narrated by AI, a fitting move for a first lady who avoids the White House and makes money through questionable schemes.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/melania-trump-memoir-ai-audiobook-rcna209207",
    "timestamp": "2025-05-27T22:27:39Z"
  },
  {
    "title": "Baptist Refugee Program Welcomes Afrikaners After Episcopalians Say No",
    "description": "A Baptist refugee charity group in North Carolina is welcoming some newly-arrived white South Africans with furnished apartments, following the departure of an Episcopal group from a taxpayer-funded refugee program due to the inclusion of said Afrikaners.\nThe…",
    "link": "https://www.breitbart.com/faith/2025/05/27/baptist-refugee-program-welcomes-afrikaners-after-episcopalians-say-no/",
    "timestamp": "2025-05-27T22:27:06Z"
  },
  {
    "title": "Trump admin asks SCOTUS to allow South Sudan deportations",
    "description": "United States President Donald Trump's administration asked the US Supreme Court to lift a judge's order that stopped the administration's plans to rapidly deport immigrants to countries w...",
    "link": "https://biztoc.com/x/24c54949953c816e",
    "timestamp": "2025-05-27T22:25:57Z"
  },
  {
    "title": "EXCLUSIVE: Harris Faulkner Dishes On What Happened Behind The Scenes During Viral Trump Black Journalist Event",
    "description": "Harris Faulkner appeared modest about her appearance on “Fox and Friends” where she reacted to Donald Trump’s interview with a panel during the NABJ conference.",
    "link": "https://dailycaller.com/2025/05/27/exclusive-harris-faulkner-dishes-on-what-happened-behind-the-scenes-during-viral-trump-black-journalist-event/",
    "timestamp": "2025-05-27T22:25:28Z"
  },
  {
    "title": "Cook tries to find an off-ramp ↦",
    "description": "The New York Times’s DealBook newsletter published a smart piece about how Tim Cook might placate Donald Trump regarding his insistence that the iPhone be made in America when it can’t actually be, anytime soon if ever:\n\n Cook could announce plans to begin as…",
    "link": "https://sixcolors.com/link/2025/05/cook-tries-to-find-an-off-ramp/",
    "timestamp": "2025-05-27T22:25:01Z"
  },
  {
    "title": "Trump to pardon Todd and Julie Chrisley (ABC News)",
    "description": "ABC News:\nTrump to pardon Todd and Julie Chrisley  —  The reality TV series stars were convicted of tax evasion and bank fraud.  —  In this Nov. 20, 2019, file photo, Julie Chrisley and Todd Chrisley attend an event in Nashville, Tenn.  —  President Donald Tr…",
    "link": "https://www.memeorandum.com/250527/p135",
    "timestamp": "2025-05-27T22:25:00Z"
  },
  {
    "title": "Putin is playing with fire, Trump says (Rami Ayyub/Reuters)",
    "description": "Rami Ayyub / Reuters:\nPutin is playing with fire, Trump says  —  U.S. President Donald Trump said on Tuesday that Russian President Vladimir Putin was “playing with fire.”  —  Trump's latest comments follow some of the biggest drone and missile attacks on Ukr…",
    "link": "https://www.memeorandum.com/250527/p134",
    "timestamp": "2025-05-27T22:25:00Z"
  },
  {
    "title": "Trump Says Golden Dome Missile System to Cost Canada $61 Billion",
    "description": "President Donald Trump said Canada would need to pay $61 billion to join the “Golden Dome” system he’s proposed to boost missile defense with space-based interceptors.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-golden-dome-missile-system-to-cost-canada-61-billion",
    "timestamp": "2025-05-27T22:23:51Z"
  },
  {
    "title": "Donald Trump’s Timeline for Todd & Julie Chrisley’s Pardon Revealed",
    "description": "Todd Chrisley and Julie Chrisley will be freed from prison soon.\nAfter President Donald Trump announced May 27 that he will pardon the Chrisley Knows Best couple from their respective prison...",
    "link": "https://www.eonline.com/news/1418027/donald-trump-timeline-for-todd-chrisley-julie-chrisley-pardon",
    "timestamp": "2025-05-27T22:20:42Z"
  },
  {
    "title": "Focus Group Participants Describe Republicans as “Apex Predators”, Democrats as “Tortoises, Slugs or Sloths”: Report",
    "description": "Focus groups run by a Democratic Party strategist show a consistent response when asked to describe Republicans and Democrats using animals, according to a report this past weekend by the New York Times that also reported on a $20 million proposed study to he…",
    "link": "https://www.thegatewaypundit.com/2025/05/focus-group-participants-describe-republicans-as-apex-predators/",
    "timestamp": "2025-05-27T22:20:13Z"
  },
  {
    "title": "Trump Dubiously Claims Canada Is ‘Considering’ Becoming the 51st State in Exchange for ‘Golden Dome’ Protection",
    "description": "President Donald Trump claimed that Canada's leaders are \"considering\" becoming a U.S. state in exchange for the protection of his proposed \"Golden Dome.\"\nThe post Trump Dubiously Claims Canada Is ‘Considering’ Becoming the 51st State in Exchange for ‘Golden …",
    "link": "https://www.mediaite.com/politics/trump/trump-dubiously-claims-canada-is-considering-becoming-the-51st-state-in-exchange-for-golden-dome-protection/",
    "timestamp": "2025-05-27T22:20:11Z"
  },
  {
    "title": "Melania Trump didn't sign executive order — here's what she did sign",
    "description": "In mid-May 2025, U.S. first lady Melania Trump signed an executive order alongside President Donald Trump.",
    "link": "https://www.snopes.com//fact-check/melania-trump-executive-order/",
    "timestamp": "2025-05-27T22:20:00Z"
  },
  {
    "title": "‘In your face’: Tony-winning actress wants Kennedy Center under Trump ‘blown up’",
    "description": "Longtime Broadway performer also calls for state of New York to secede from the U.S.",
    "link": "https://www.wnd.com/2025/05/in-your-face-tony-winning-actress-wants-kennedy-center-under-trump-blown-up/",
    "timestamp": "2025-05-27T22:17:06Z"
  },
  {
    "title": "Trump Used 1 Particularly ’Gross’ Term About Women During His Latest ‘Nonsensical Ramble’",
    "description": "One gender studies expert said that the phrase the president used during his address \"succinctly captures a toxic set of misogynistic ideas.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-trophy-wives-commencement-speech-experts_n_6836081ae4b0a70b65d5c079",
    "timestamp": "2025-05-27T22:16:45Z"
  },
  {
    "title": "Bo Hines declares the US won’t sell Bitcoin, seek endless accumulation for strategic reserve",
    "description": "Bo Hines told the 2025 Bitcoin Conference in Las Vegas on May 27 that the federal government will hold every Bitcoin (BTC) already in custody and pursue additional budget-neutral ways to increase its Strategic Bitcoin Reserve. Hines, who serves as the executi…",
    "link": "https://cryptoslate.com/bo-hines-declares-the-us-wont-sell-bitcoin-seek-endless-accumulation-for-strategic-reserve/",
    "timestamp": "2025-05-27T22:15:48Z"
  },
  {
    "title": "Higher Education Faces an Existential Crisis of Its Own Making",
    "description": "Harvard University is having a rough time. I know, how tragic, right? On Monday, President Donald Trump announced on Truth Social that his administration was... Read More\nThe post Higher Education Faces an Existential Crisis of Its Own Making appeared first o…",
    "link": "https://www.dailysignal.com/2025/05/27/higher-education-faces-an-existential-crisis-of-its-own-making/",
    "timestamp": "2025-05-27T22:15:00Z"
  },
  {
    "title": "Donald Trump Makes Canada a New Offer to Become 51st State",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOn Tuesday, President Donald Trump said Canada can either pay $61 billion to be covered by the proposed U.S. \"Golden Dome\" missile defense system or become the 51st state and be covered for free.\nThe president…",
    "link": "https://biztoc.com/x/d24c3e436f78f6c5",
    "timestamp": "2025-05-27T22:14:41Z"
  },
  {
    "title": "Todd & Julie Chrisley Pardoned by Donald Trump, President Calls Their Kids in Newly Released Video",
    "description": "Reality stars Todd Chrisley and Julie Chrisley will be getting out of prison a lot earlier than expected, all thanks to fellow reality star Donald Trump. The President of the Untied States has announced his plans to pardon the Chrisleys, who were convicted of…",
    "link": "https://www.justjared.com/2025/05/27/todd-julie-chrisley-pardoned-by-donald-trump-president-calls-their-kids-in-newly-released-video/",
    "timestamp": "2025-05-27T22:13:49Z"
  },
  {
    "title": "Donald Trump warns Vladimir Putin he is ‘playing with fire’ in Ukraine - Financial Times",
    "description": "Donald Trump warns Vladimir Putin he is ‘playing with fire’ in UkraineFinancial Times Trump warns Putin is 'playing with fire' after declaring the Russian president has 'gone absolutely CRAZY'Fox News The Memo: Trump paints himself into a corner on Putin and …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177817685",
    "timestamp": "2025-05-27T22:13:49Z"
  },
  {
    "title": "South Africa’s president jokes about Trump dust-up - Politico",
    "description": "South Africa’s president jokes about Trump dust-upPolitico Trump Showed Images of ‘Genocide’ in South Africa. One Was From the War in Congo.The New York Times Cyril Ramaphosa keeps his cool with Donald TrumpThe Economist Trump's image of dead 'white farmers' …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177817679",
    "timestamp": "2025-05-27T22:13:18Z"
  },
  {
    "title": "Lindsey Graham Vows to ‘Grind’ Russia’s ‘War Machine’ to a Halt if Trump and Putin Can’t Reach a Deal Soon",
    "description": "Sen. Lindsey Graham (R-SC) wrote a letter to the editors of The Wall Street Journal that was published on Tuesday in which he vowed that the U.S. Senate was ready to “grind” Vladimir Putin’s “war machine to a halt” if President Donald Trump is unable to broke…",
    "link": "https://freerepublic.com/focus/f-bloggers/4319429/posts",
    "timestamp": "2025-05-27T22:13:01Z"
  },
  {
    "title": "Circle IPO has peculiar Facebook-like characteristic",
    "description": "In its updated IPO prospectus on Tuesday, Circle indicated that most of the shares being sold are coming from existing stakeholders rather than the company.",
    "link": "https://www.cnbc.com/2025/05/27/circle-ipo-has-peculiar-facebook-like-characteristic.html",
    "timestamp": "2025-05-27T22:12:11Z"
  },
  {
    "title": "35 Richest Republicans Set to 'Line Their Own Pockets' While Taking Food, Healthcare From Millions",
    "description": "As U.S. President Donald Trump and congressional Republicans' so-called \"Big Beautiful Bill\" heads to the Senate, a watchdog group on Tuesday released a report highlighting that dozens of GOP members of Congress worth a total of $2.5 billion are set to benefi…",
    "link": "https://www.commondreams.org/news/big-beautiful-bill",
    "timestamp": "2025-05-27T22:12:03Z"
  },
  {
    "title": "Live: ASX to rise, Wall Street surges on Donald Trump's EU tariff delay",
    "description": "The Australian share market is set to rise ahead of the latest ABS inflation figures and a likely interest rate cut by the Reserve Bank of New Zealand. Wall Street surges on US President Donald Trump's decision to delay a proposed tariff hike on European Unio…",
    "link": "https://www.abc.net.au/news/2025-05-28/asx-markets-business-live-news/105345922",
    "timestamp": "2025-05-27T22:09:48Z"
  },
  {
    "title": "U.S.-EU trade talks reignite as tariff threat paused",
    "description": "President Trump has delayed imposing new tariffs on the European Union, leading to renewed trade negotiations and a surge in stock markets.",
    "link": "https://www.mynbc5.com/article/us-eu-trade-talks-reignite-tariff-threat-paused/64895884",
    "timestamp": "2025-05-27T22:09:44Z"
  },
  {
    "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley",
    "description": "The White House said Tuesday that President Donald Trump is set to pardon reality TV stars Julie and Todd Chrisley, the couple famous for “Chrisley Knows Best.\"",
    "link": "https://www.newschannel5.com/news/trump-set-to-pardon-reality-tv-stars-todd-and-julie-chrisley-of-fraud-and-tax-evasion-convictions",
    "timestamp": "2025-05-27T22:08:18Z"
  },
  {
    "title": "U.S. poised to receive golden share in U.S. Steel-Nippon Steel tie-up",
    "description": "The plan, which would give the government de facto veto rights on certain company decisions, is part of ongoing talks.",
    "link": "https://www.japantimes.co.jp/business/2025/05/28/companies/golden-share-us-steel-nippon-steel/",
    "timestamp": "2025-05-27T22:08:00Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Investor attention will turn to the AI chipmaker as it navigates China restrictions, amid strong demand for its graphics processors.",
    "link": "https://www.cnbc.com/2025/05/27/stock-market-today-live-updates.html",
    "timestamp": "2025-05-27T22:07:30Z"
  },
  {
    "title": "US halts student visa appointments and plans expanded social media vetting",
    "description": "The state department says the policy will have \"significant implications\" for embassies and consulates.",
    "link": "https://www.bbc.com/news/articles/cy75eenl46eo",
    "timestamp": "2025-05-27T22:07:03Z"
  },
  {
    "title": "Donald Trump Makes Canada a New Offer to Become 51st State",
    "description": "President Trump unveiled initial plans for the \"state of the art\" missile defense system dubbed \"Golden Dome\" earlier this month.",
    "link": "https://www.newsweek.com/donald-trump-makes-canada-new-offer-become-51st-state-2077734",
    "timestamp": "2025-05-27T22:06:39Z"
  },
  {
    "title": "US suspends student visa processing as Trump administration ramps up social media vetting",
    "description": "An internal cable said the US State Department “plans to issue guidance on expanded social media vetting for all such applications”.",
    "link": "https://www.thejournal.ie/us-suspends-student-visa-processing-trump-social-media-vetting-6716771-May2025/",
    "timestamp": "2025-05-27T22:06:34Z"
  },
  {
    "title": "Chrisley Knows Best Stars Todd and Julie Chrisley Pardoned by President Trump After Federal Fraud Convictions",
    "description": "The stars of Chrisley Knows Best will soon be free again: Todd and Julie Chrisley, who are both in prison on federal bank fraud and tax evasion convictions, have officially been pardoned by President Donald Trump. Trump’s team posted a video on social media o…",
    "link": "https://tvline.com/news/todd-julie-chrisley-pardoned-trump-chrisley-knows-best-1235453782/",
    "timestamp": "2025-05-27T22:06:05Z"
  },
  {
    "title": "NPR sues Trump over executive order cutting federal funding",
    "description": "Claims EO 'threatens the existence of a public radio system that millions of Americans across the country rely on for vital news and information'",
    "link": "https://www.wnd.com/2025/05/npr-sues-trump-over-executive-order-cutting-federal-funding/",
    "timestamp": "2025-05-27T22:04:15Z"
  },
  {
    "title": "Yes, 13.7M in US may lose health insurance as Democrats claim — but GOP bill isn't only culprit",
    "description": "The CBO estimates U.S. President Donald Trump's \"One Big Beautiful Bill\" would account for about 8.6 million people cut from Medicaid.",
    "link": "https://www.snopes.com//fact-check/14-million-lose-insurance-medicaid/",
    "timestamp": "2025-05-27T22:04:00Z"
  },
  {
    "title": "Melania Trump Shoots Down Rumor Barron Applied to Harvard",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nFirst lady Melania Trump dismissed rumors that her son with President Donald Trump, Barron, had applied to Harvard University in a statement to The Palm Beach Post on Tuesday.\nNewsweek reached out to the White…",
    "link": "https://biztoc.com/x/97b79e1b674a42c5",
    "timestamp": "2025-05-27T22:03:46Z"
  },
  {
    "title": "Trump And Putin's 'Egos' Could Be 'End of Civilization': Charlamagne Tha God",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nCharlamagne Tha God said this week that President Donald Trump and Russian President Vladimir Putin's egos could bring about \"the end of civilization as we know it.\"\nNewsweek reached out to the White House for…",
    "link": "https://biztoc.com/x/bb437a7ea77d109f",
    "timestamp": "2025-05-27T22:03:44Z"
  },
  {
    "title": "Trump: Will cost Canada $61B to join Golden Dome unless it joins US",
    "description": "United States President Donald Trump said that he told Canada, \"which very much wants to be part of our fabulous Golden Dome System,\" that such a move would cost $61 billion, if it remains s...",
    "link": "https://biztoc.com/x/89656902a16a68f8",
    "timestamp": "2025-05-27T22:03:30Z"
  },
  {
    "title": "Trump can bluster and bluff all he wants, but iPhone manufacturing isn't coming to the US",
    "description": "Trump can bluster and bluff all he wants, but iPhone manufacturing isn't coming to the US\nHe'll need to be way more aggressive than a 25% tariff, say analysts, and even then it would take years\nUS President Donald Trump can huff, puff, and threaten to blow Ti…",
    "link": "https://biztoc.com/x/dccff9fa5ea5bb4e",
    "timestamp": "2025-05-27T22:03:27Z"
  },
  {
    "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley of fraud and tax evasion convictions",
    "description": "WASHINGTON (AP) — The White House said Tuesday that President Donald Trump is set to pardon reality TV stars Julie and Todd Chrisley, the couple famous for “Chrisley Knows Best,” which followed their tightly knit family and extravagant lifestyle. A jury in 20…",
    "link": "https://freerepublic.com/focus/f-news/4319426/posts",
    "timestamp": "2025-05-27T22:03:11Z"
  },
  {
    "title": "Todd Chrisley and Julie Chrisley to Be Pardoned By Donald Trump",
    "description": "Todd Chrisley and Julie Chrisley are one step closer to regaining their freedom.\nPresident Donald Trump revealed his plans May 27 to pardon the couple, currently serving prison sentences for tax...",
    "link": "https://www.eonline.com/news/1418029/todd-chrisley-and-julie-chrisley-to-be-pardoned-by-donald-trump",
    "timestamp": "2025-05-27T22:01:42Z"
  },
  {
    "title": "Trump announces pardon for Todd and Julie Chrisley after reality TV stars' fraud, tax evasion convictions",
    "description": "President Trump plans to pardon reality stars Todd and Julie Chrisley, convicted of bank fraud and tax evasion, as he revealed in a call with their daughter Savannah.",
    "link": "https://www.foxnews.com/entertainment/trump-announces-pardon-todd-julie-chrisley-after-reality-tv-stars-fraud-tax-evasion-convictions",
    "timestamp": "2025-05-27T22:01:33Z"
  },
  {
    "title": "'The Founding Fathers Knew This!' Judge Scorches Trump Order Targeting Law Firm",
    "description": "For the third time in a month, a judge struck down an executive order by the president seeking to sanction a law firm.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-law-firms_n_683634f1e4b0362038795f47",
    "timestamp": "2025-05-27T22:01:26Z"
  },
  {
    "title": "Trump’s Tirades Aren’t Swaying Putin",
    "description": "The president stamping his feet on social media will do nothing to quell Russia's aims.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/05/trump-called-putin-crazy/682948/",
    "timestamp": "2025-05-27T22:01:00Z"
  },
  {
    "title": "Donald Trump Says He Plans To Pardon Reality Stars Todd And Julie Chrisley",
    "description": "Donald Trump said that he plans to pardon Todd and Julie Chrisley, the reality show stars who were sentenced in 2022 after tax evasion convictions. “Your parents are going to be free and clean, and I am hoping we can do it by tomorrow,” Trump said in an Oval …",
    "link": "http://deadline.com/2025/05/trump-pardon-todd-chrisley-julie-chrisley-1236411967/",
    "timestamp": "2025-05-27T22:00:34Z"
  },
  {
    "title": "Why the socialist left gets the far right wrong",
    "description": "As right-wing populism has surged globally in the past 10 years, the socialist left has advanced a distinctive explanation for its emergence and how to respond. Their theory: President Donald Trump and other right-wing leaders’ ascendance is a symptom of Demo…",
    "link": "https://www.vox.com/politics/414503/left-materialism-far-right-trump-economic-anxiety",
    "timestamp": "2025-05-27T22:00:26Z"
  },
  {
    "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley of fraud and tax evasion convictions",
    "description": "President Donald Trump says he’s planning to pardon TV stars Todd and Julie Chrisley, famous for “Chrisley Knows Best,” a reality show that followed their tight-knit family and extravagant lifestyle",
    "link": "https://www.wftv.com/entertainment/trump-set-pardon/NM4Y5QJO4ZHFFA5TVHAM4KGGBI/",
    "timestamp": "2025-05-27T22:00:19Z"
  },
  {
    "title": "PBS disputes Trump’s claims of ‘bias’ following his executive order targeting the network",
    "description": "Trump's executive order to cut PBS and NPR funding sparks debate on media bias. PBS CEO defends coverage, citing diverse news options and confirmation bias issues.",
    "link": "https://www.foxnews.com/media/pbs-disputes-trumps-claims-bias-following-his-executive-order-targeting-network",
    "timestamp": "2025-05-27T22:00:16Z"
  },
  {
    "title": "Commentary: What Trump gets right about China",
    "description": "US President Donald Trump's diagnosis of the global trading system is not entirely wrong. However, his solutions miss the mark in tackling the issue, says Yi Fuxian of the University of Wisconsin-Madison.",
    "link": "https://www.channelnewsasia.com/commentary/trump-tariff-trade-war-china-global-trading-system-5155186",
    "timestamp": "2025-05-27T22:00:00Z"
  },
  {
    "title": "US pauses student visa processing amid plans to up social media vetting",
    "description": "Latest Trump administration move comes amid wider pressure campaign against top universities, targeting of students.",
    "link": "https://www.aljazeera.com/news/2025/5/27/us-pauses-student-visa-processing-amid-plans-to-up-social-media-vetting",
    "timestamp": "2025-05-27T21:59:14Z"
  },
  {
    "title": "California Athletic Organization Announces Changes To Girls Track Rules After Trump Lays Out Threats",
    "description": "A California state organization that governs high school sports has announced a changed its entry process hours after President Donald Trump gave a warning.",
    "link": "https://dailycaller.com/2025/05/27/gavin-newsom-donald-trump-transgender-womens-track-california-interscholastic-federation/",
    "timestamp": "2025-05-27T21:58:54Z"
  },
  {
    "title": "Judge finds Trump's EO against WilmerHale unconstitutional: 'to rule otherwise would be unfaithful to the judgment and vision of the Founding Fathers!'",
    "description": "Federal Judge Richard Leon on Tuesday ruled that Donald Trump's executive order targeting the Big Law firm WilmerHale amounts to illegal retaliation.",
    "link": "https://www.businessinsider.com/donald-trump-executive-order-wilmerhale-big-law-unconstitutional-coercion-retaliation-2025-5",
    "timestamp": "2025-05-27T21:56:42Z"
  },
  {
    "title": "The Handmaid's Tale is over after 6 seasons, but our obsession with dystopian TV will go on",
    "description": "If there's one thing you can expect from a series like The Handmaid's Tale, it's that it won't wrap up neatly. But the popularity of shows that depict our worst fears for society only seems to grow in times of political uncertainty and cultural shifts, accord…",
    "link": "https://www.cbc.ca/news/entertainment/the-handmaids-tale-dystopian-shows-1.7541183",
    "timestamp": "2025-05-27T21:56:03Z"
  },
  {
    "title": "The Bob Cesca Podcast: Cryptologogic",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Cryptologogic -- Donald Trump is attacking an 11th grade trans girl now. Gavin Newsom and Donald used the same language to describe trans youth athletes. The president and grownups setting a t…",
    "link": "https://littlegreenfootballs.com/article/54637_The_Bob_Cesca_Podcast-_Cryptol",
    "timestamp": "2025-05-27T21:56:00Z"
  },
  {
    "title": "US, Argentina launch alternative international health system to WHO",
    "description": "The US and Argentina said Tuesday they are launching an alternative international health system separate from the World Health Organization WHO. The WHOs handling of the COVID-19 pandemic revealed serious structural and operational shortcomings that undermine…",
    "link": "https://www.anews.com.tr/world/2025/05/27/us-argentina-launch-alternative-international-health-system-to-who",
    "timestamp": "2025-05-27T21:55:38Z"
  },
  {
    "title": "Trump And Putin's 'Egos' Could Be 'End of Civilization': Charlamagne Tha God",
    "description": "\"That could get stupid real fast,\" Charlamagne said on Tuesday's episode of \"The Breakfast Club.\"",
    "link": "https://www.newsweek.com/charlamagne-tha-god-trump-putin-egos-end-civilization-2077725",
    "timestamp": "2025-05-27T21:55:22Z"
  },
  {
    "title": "Melania Trump Shoots Down Rumor Barron Applied to Harvard",
    "description": "The first lady confirmed in a statement from her communications director that Barron did not apply to the Ivy League school.",
    "link": "https://www.newsweek.com/melania-trump-denies-barron-applied-harvard-2077730",
    "timestamp": "2025-05-27T21:54:44Z"
  },
  {
    "title": "Trump set to pardon reality TV stars Todd and Julie Chrisley of fraud and tax evasion convictions",
    "description": "President Donald Trump says he’s planning to pardon TV stars Todd and Julie Chrisley, famous for “Chrisley Knows Best,” a reality show that followed their tight-knit family and extravagant lifestyle",
    "link": "https://www.wsbradio.com/entertainment/trump-set-pardon/NM4Y5QJO4ZHFFA5TVHAM4KGGBI/",
    "timestamp": "2025-05-27T21:53:16Z"
  },
  {
    "title": "Trump Pardons Todd and Julie Chrisley After Tax Evasion and Fraud Conviction",
    "description": "The reality stars were originally sentenced to 12 and seven years in prison in 2022\nThe post Trump Pardons Todd and Julie Chrisley After Tax Evasion and Fraud Conviction appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-pardons-todd-julie-chrisley-tax-evasion/",
    "timestamp": "2025-05-27T21:52:34Z"
  },
  {
    "title": "Trump campaign against law firms dealt another setback as judge blocks executive order",
    "description": "President Donald Trump's campaign against the legal profession hit another setback Tuesday as a federal judge struck down yet another executive order that sought to sanction one of the country's most prestigious law firms. The order in favor of WilmerHale mar…",
    "link": "https://japantoday.com/category/world/trump-campaign-against-law-firms-dealt-another-setback-as-judge-blocks-executive-order",
    "timestamp": "2025-05-27T21:52:32Z"
  },
  {
    "title": "Growing BTC reserve requires Congressional legislation — VanEck exec",
    "description": "Building a permanent US strategic Bitcoin reserve would likely require targeted legislation rather than executive action, according to VanEck’s head of digital assets, Matthew Sigel. Speaking at Bitcoin 2025 in Las Vegas, Sigel said the most viable path forwa…",
    "link": "https://cointelegraph.com/news/btc-reserve-requires-congressional-legislation",
    "timestamp": "2025-05-27T21:52:14Z"
  },
  {
    "title": "You probably won’t notice Trump’s tax break for car loans once you factor in tariffs",
    "description": "While President Donald Trump and his fellow Republicans have celebrated a provision in their megabill that delivers a tax break for Americans with car loans, its modest benefit looks set to get blotted out by Trump’s tariffs on the auto sector.",
    "link": "https://biztoc.com/x/22995d702f26dc1f",
    "timestamp": "2025-05-27T21:52:12Z"
  },
  {
    "title": "Trump Knows Best? Don Pardons Todd and Julie Chrisley After Disgraced Reality Couple Was Tossed Behind Bars For Bank Fraud and Tax Evasion",
    "description": "The Chrisleys have been behind bars since January 2023 after being convicted of bank fraud and tax evasion.",
    "link": "https://radaronline.com/p/donald-trump-todd-chrisley-julie-chrisley-pardons-tax-evasion/",
    "timestamp": "2025-05-27T21:52:10Z"
  },
  {
    "title": "Trump pressured Gavin Newsom over trans teen athlete. Then California changed its track championship rules",
    "description": "California’s high school sports authority quietly expanded eligibility for this weekend’s state track and field championships Tuesday, hours after President Donald Trump threatened to cut federal funding unless the state disqualified a transgender girl athlet…",
    "link": "https://www.advocate.com/news/california-transgender-track-rules-changed",
    "timestamp": "2025-05-27T21:50:42Z"
  },
  {
    "title": "Trump Legal Team Threatens CBS News With Additional Defamation Claim Amid Ongoing '60 Minutes' Settlement Talks",
    "description": "President Donald Trump's legal team is threatening to slap CBS News and parent company Paramount with a fresh defamation lawsuit over a 60 Minutes segment that likened Trump to a \"mob boss\" and accused him of criminal bribery.\nThe post Trump Legal Team Threat…",
    "link": "https://freebeacon.com/media/trump-legal-team-threatens-cbs-news-with-additional-defamation-claim-amid-ongoing-60-minutes-settlement-talks/",
    "timestamp": "2025-05-27T21:50:05Z"
  },
  {
    "title": "Donald Trump pardons reality TV stars Todd and Julie Chrisley over bank fraud and tax evasion",
    "description": "The couple were convicted in 2022 and have been in prison since January 2023",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/donald-trump-todd-julie-chrisley-pardon-b2758854.html",
    "timestamp": "2025-05-27T21:49:24Z"
  },
  {
    "title": "U.S. stocks advance as Trump eases EU tariff threat",
    "description": "NEW YORK, May 27 (Xinhua) -- U.S. stocks ended higher on Tuesday, after U.S. President Donald Trump softened his stance on tariff threats toward the European Union, signaling that trade negotiations were regaining momentum. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/us-stocks-advance-as-trump-eases-eu-tariff-threat",
    "timestamp": "2025-05-27T21:49:00Z"
  },
  {
    "title": "Trump’s Attacks on Harvard Cause Alarm in China",
    "description": "Ongoing fears of student espionage are largely unfounded.",
    "link": "http://foreignpolicy.com/2025/05/27/harvard-trump-china-international-student-visa-university-college/",
    "timestamp": "2025-05-27T21:48:24Z"
  },
  {
    "title": "Trump to pardon reality TV stars Todd and Julie Chrisley",
    "description": "Trump will pardon reality TV stars Todd and Julie Chrisley who were sentenced to prison for tax evasion and bank fraud.",
    "link": "https://abcnews.go.com/Politics/trump-pardon-todd-julie-chrisley/story?id=122248116",
    "timestamp": "2025-05-27T21:46:26Z"
  }
]