[
  {
    "title": "Trump and China Reach Agreement to Lower Tariffs",
    "description": "State of the Union: The U.S. will impose a 55 percent rate and not restrict Chinese enrollment in U.S. colleges.\nThe post Trump and China Reach Agreement to Lower Tariffs appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/trump-and-china-reach-agreement-to-lower-tariffs/",
    "timestamp": "2025-06-11T15:12:35Z"
  },
  {
    "title": "Trump’s National Guard hypocrisy will intensify protests (Letters)",
    "description": "\"Where was the National Guard on Jan. 6, 2021? President Donald Trump had the power to call them out in the event of an insurrection.\" -- William Green, Colorado Springs",
    "link": "https://www.denverpost.com/2025/06/11/trump-fuels-protests-los-angeles/",
    "timestamp": "2025-06-11T15:10:23Z"
  },
  {
    "title": "Los Angeles Riots, Trump-Musk Spat… Will Crisis in America Escalate? Drago Bosnic",
    "description": "At the moment, it's too early to say that the situation would escalate into a full-blown civil war, but it goes to show that the Deep State will stop at nothing to regain full power.\nThe post Los Angeles Riots, Trump-Musk Spat… Will Crisis in America Escalate…",
    "link": "https://www.globalresearch.ca/los-angeles-riots-trump-musk-spat/5890534",
    "timestamp": "2025-06-11T15:10:21Z"
  },
  {
    "title": "Elon Musk Suffers Polling Blow With Republicans After Trump Feud",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRepublican voters view Elon Musk less favorably after his falling out with President Donald Trump last week, according to a new poll.\nNewsweek reached out to Musk for comment via Tesla's press email.\nWhy It Ma…",
    "link": "https://biztoc.com/x/37adb5602c2e3225",
    "timestamp": "2025-06-11T15:08:50Z"
  },
  {
    "title": "Denver, Colorado ‘No Kings’ Protest: When, Where, What to Know",
    "description": "The No Kings rally in Denver is part of a \"mass protest\" against the Trump administration, with smaller protests taking place across Colorado.",
    "link": "https://www.westword.com/news/denver-colorado-no-kings-protest-when-where-what-to-know-24777364",
    "timestamp": "2025-06-11T15:05:34Z"
  },
  {
    "title": "DAVID BLACKMON: Trump’s New National Permitting ‘Sherpa’ Has A Big, Complex Job",
    "description": "By now it should be obvious to everyone that, if America is to have any hope of maintaining a stable power grid and a strong level of national energy security, the pace of permitting for major energy-related projects must be dramatically accelerated. Fortunat…",
    "link": "https://dailycaller.com/2025/06/11/opinion-trumps-new-national-permitting-sherpa-has-a-big-complex-job-david-blackmon/",
    "timestamp": "2025-06-11T15:04:47Z"
  },
  {
    "title": "Elon Musk Suffers Polling Blow With Republicans After Trump Feud",
    "description": "Some Republicans are changing their tune about Musk after his falling out with the president.",
    "link": "https://www.newsweek.com/elon-musk-polling-blow-republicans-trump-feud-2083981",
    "timestamp": "2025-06-11T15:04:28Z"
  },
  {
    "title": "French drivers sue Tesla over Elon Musk’s right-wing politics",
    "description": "EV tycoon drives owners to distraction with embrace of far-right positions.",
    "link": "https://www.politico.eu/article/french-sue-tesla-elon-musks-politics-electric-vehicle-ev-europe-afd-courts/",
    "timestamp": "2025-06-11T15:03:26Z"
  },
  {
    "title": "CNN’s Stelter Predicts Boycotted Les Mis Show Will Be ‘A Rousing Celebration of Trump!’",
    "description": "Brian Stelter said a boycott-threatened performance of Les Misérables will be a \"rousing celebration of Trump,\" and that \"we're not going to be hearing boos.\"\nThe post CNN’s Stelter Predicts Boycotted Les Mis Show Will Be ‘A Rousing Celebration of Trump!’ fir…",
    "link": "https://www.mediaite.com/media/news/cnns-stelter-predicts-boycotted-les-mis-show-will-be-a-rousing-celebration-of-trump/",
    "timestamp": "2025-06-11T15:01:24Z"
  },
  {
    "title": "Elon Musk Pestered About Epstein Files Bombshell After Admitting Some of His Trump Tweets 'Went Too Far': 'Are You Covering?'",
    "description": "Elon Musk is being badgered about posts he made when feuding with Donald Trump, particularly ones linking him to convicted sex offender Jeffrey Epstein.",
    "link": "https://www.ibtimes.com/elon-musk-pestered-about-epstein-files-bombshell-after-admitting-some-his-trump-tweets-went-too-3775373",
    "timestamp": "2025-06-11T15:01:10Z"
  },
  {
    "title": "Netflix Co-CEO Greg Peters Calls U.K. Production Ecosystem A Great Example For U.S.",
    "description": "Netflix co-CEO Greg Peter on Wednesday talked up the company’s investment in U.K. production and why it’s so extensive – the combination of talent and incentives. “We’ve spent over a billion pounds on UK productions since 2020, so this is over 100 titles that…",
    "link": "http://deadline.com/2025/06/netflix-co-ceo-greg-geters-uk-production-example-united-states-1236430643/",
    "timestamp": "2025-06-11T15:00:39Z"
  },
  {
    "title": "Cardi B Slams Donald Trump Over Immigration Raids",
    "description": "Cardi B has taken Donald Trump to task over his conduct over the last week in dealing with protests against immigration raids in Los Angeles.",
    "link": "https://hiphopdx.com/news/cardi-b-slams-donald-trump-immigration-raids",
    "timestamp": "2025-06-11T15:00:20Z"
  },
  {
    "title": "Trump: ‘We Want to Wean Off FEMA,’ Bring It Back to the States",
    "description": "Yes, please!\nThe post Trump: ‘We Want to Wean Off FEMA,’ Bring It Back to the States first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/trump-we-want-to-wean-off-fema-bring-it-back-to-the-states/",
    "timestamp": "2025-06-11T15:00:12Z"
  },
  {
    "title": "RFK JR. takes scientific advice from his brain worm | June 11 editorial cartoons",
    "description": "Wednesday's political cartoons include the removal of medical experts from the Centers for Disease Control, the Village People, and Donald Trump as a Home Despot at Home Depot",
    "link": "https://theweek.com/cartoons/crackdown-at-home-depot-june-11-editorial-cartoons",
    "timestamp": "2025-06-11T15:00:00Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump's VERY Close Friendship With Jeffrey Epstein Exposed Amid Elon Musk's Cover-Up Claims",
    "description": "The true extent of Donald Trump's friendship with pedophile sex trafficker Jeffrey Epstein can be exposed after the U.S. president's 'First Buddy' Elon Musk made new accusations about their bond.",
    "link": "https://radaronline.com/p/donald-trump-very-close-friendship-jeffrey-epstein-exposed/",
    "timestamp": "2025-06-11T15:00:00Z"
  },
  {
    "title": "Elon Musk says he regrets social media posts lashing out at President Trump",
    "description": "By William Selway, Bloomberg\nElon Musk, who served as a close adviser and confidant to President Donald Trump until a bitter public falling out last week in a series of social-media posts, issued his strongest sign of contrition yet over how he handled the ru…",
    "link": "https://biztoc.com/x/734e834a2cc350de",
    "timestamp": "2025-06-11T14:57:19Z"
  },
  {
    "title": "CFPB Enforcement Director Cara Petersen Quits Saying Agency ‘Under Attack’",
    "description": "Cara Petersen, acting enforcement director of the Consumer Financial Protection Bureau, resigned from her post.\n \n [contact-form-7]\n \n \nPetersen said CFPB leadership under President Donald Trump “has no intention to enforce the law in any meaningful way,” Reu…",
    "link": "https://biztoc.com/x/d0b340a35de691ca",
    "timestamp": "2025-06-11T14:57:15Z"
  },
  {
    "title": "Kim Kardashian Slams ‘Inhumane’ ICE Raids—Joining Celebrity Critics Including Doechii, Eva Longoria And More",
    "description": "Kardashian criticized “hardworking people being ripped from their families in inhumane ways” by immigration authorities in a statement on her Instagram story.",
    "link": "https://www.forbes.com/sites/conormurray/2025/06/11/kim-kardashian-slams-inhumane-ice-raids-joining-celebrity-critics-including-doechii-eva-longoria-and-more/",
    "timestamp": "2025-06-11T14:56:49Z"
  },
  {
    "title": "Why did Donald Trump deploy the National Guard to LA protest, but not on Jan 6? asks Nancy Pelosi",
    "description": "LA Protests: Nancy Pelosi has slammed Donald Trump for deploying National Guard troops to Los Angeles without state approval, calling it a \"brazen abuse of power\". The move, triggered by immigration raids, has sparked citywide protests and national legal chal…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/troops-tensions-and-ice-raids-why-did-donald-trump-deploy-the-national-guard-to-la-protest-but-not-on-jan-6-asks-nancy-pelosi/articleshow/121781777.cms",
    "timestamp": "2025-06-11T14:55:25Z"
  },
  {
    "title": "Republicans Are Fleeing Town to Avoid Trump’s Birthday Military Parade",
    "description": "Congressional Republicans aren’t sticking around to watch Donald Trump blow millions of taxpayer dollars on himself this weekend.\r\nJust seven of 50 surveyed GOP lawmakers are planning to actually attend the president’s birthday festivities over the weekend, r…",
    "link": "https://newrepublic.com/post/196684/republicans-not-attending-trump-birthday-military-parade",
    "timestamp": "2025-06-11T14:55:21Z"
  },
  {
    "title": "ICE says it detained TikTok star Khaby Lame and told him to leave the U.S.",
    "description": "U.S. immigration officials said they detained Khaby Lame, one of the world's most popular TikTok personalities, last week and told him to leave the country after they said he \"overstayed the terms of his visa.\"",
    "link": "https://www.nbcnews.com/tech/internet/ice-says-detained-tiktok-star-khaby-lame-told-leave-us-rcna212137",
    "timestamp": "2025-06-11T14:55:15Z"
  },
  {
    "title": "DOJ finds Trump can abolish areas protected as national monuments (Jake Spring/Washington Post)",
    "description": "Jake Spring / Washington Post:\nDOJ finds Trump can abolish areas protected as national monuments  —  An opinion released by the Office of Legal Counsel concludes the president can abolish national monuments declared by past administrations.  —  Trump administ…",
    "link": "https://www.memeorandum.com/250611/p52",
    "timestamp": "2025-06-11T14:55:01Z"
  },
  {
    "title": "US Fed rate cut: When are next meeting dates? Will there be big change in interest rates following Inflation data?",
    "description": "US Inflation data is out and now all eyes are on whether the Federal Reserve go for big interest rate cut or not.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-fed-rate-cut-when-are-next-meeting-dates-will-there-be-big-change-in-interest-rates-following-inflation-data/articleshow/121782000.cms",
    "timestamp": "2025-06-11T14:54:48Z"
  },
  {
    "title": "Trump Drops Plans to Revoke Chinese Student Visas",
    "description": "President Donald Trump says the U.S. has reached a trade deal with China and is ditching plans to revoke Chinese student visas.   “Our deal... Read More\nThe post Trump Drops Plans to Revoke Chinese Student Visas appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/11/trump-drops-plans-to-revoke-chinese-student-visas/",
    "timestamp": "2025-06-11T14:53:11Z"
  },
  {
    "title": "Will the US-China ‘framework’ agreement defuse trade tension?",
    "description": "The US and China have agreed to a framework that restores a truce in their trade war after two days of talks in London.",
    "link": "https://www.aljazeera.com/program/counting-the-cost/2025/6/11/will-the-us-china-framework-agreement-defuse-trade-tension",
    "timestamp": "2025-06-11T14:52:53Z"
  },
  {
    "title": "Denmark greenlights US military bases on Danish soil",
    "description": "Critics say the vote ceded Danish sovereignty to the US",
    "link": "https://www.irishtimes.com/world/europe/2025/06/11/denmark-greenlights-us-military-bases-on-danish-soil/",
    "timestamp": "2025-06-11T14:52:20Z"
  },
  {
    "title": "US stock market today: Market rise as S&P 500 nears record, Nasdaq jumps on chip optimism, Dow climbs 100+ points ahead of May CPI report and US-China trade deal",
    "description": "US Stocks rise after inflation data showed a softer-than-expected increase in May, while a new U.S.-China trade agreement lifted investor sentiment. The Dow Jones added 126 points, the S&P 500 and Nasdaq Composite also gained. Inflation rose just 0.1%, calmin…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-today-market-rise-as-sp-500-nears-record-nasdaq-jumps-on-chip-optimism-dow-climbs-100-points-ahead-of-may-cpi-report-and-us-china-trade-deal/articleshow/121781932.cms",
    "timestamp": "2025-06-11T14:52:08Z"
  },
  {
    "title": "SpaceX Is Taking Over a Competitor’s Launchpad to Ramp Up Starship Flights",
    "description": "Originally built to support the Apollo program, Space Launch Complex 37 will soon be converted to a Starship launch mount.",
    "link": "https://gizmodo.com/spacex-is-taking-over-a-competitors-launchpad-to-ramp-up-starship-flights-2000614213",
    "timestamp": "2025-06-11T14:50:53Z"
  },
  {
    "title": "Iran threatens to strike US bases if conflict erupts over nuclear programme",
    "description": "US President Donald Trump says he is losing confidence about reaching a deal with Iran.",
    "link": "https://www.aljazeera.com/news/2025/6/11/iran-threatens-to-strike-us-bases-if-conflict-erupts-over-nuclear-programme",
    "timestamp": "2025-06-11T14:49:07Z"
  },
  {
    "title": "CISA’s executive director is leaving the agency",
    "description": "Bridget Bean had been with CISA for over three years, during which time she also briefly served as the acting director of the cyber agency.",
    "link": "https://www.nextgov.com/cybersecurity/2025/06/cisas-executive-director-leaving-agency/405981/",
    "timestamp": "2025-06-11T14:49:00Z"
  },
  {
    "title": "Trump Urges Fed to Cut Rates",
    "description": "5 min ago\nTrump Urges Fed to Cut Rates\nPresident Donald Trump said that the softer-than-expected inflation result for May looked great, again calling for the Federal Reserve to cut interest rates by a full percentage point.\n“CPI JUST OUT. GREAT NUMBERS! FED S…",
    "link": "https://biztoc.com/x/3acd0a1fa9726468",
    "timestamp": "2025-06-11T14:46:36Z"
  },
  {
    "title": "Tesla gains for a fourth day as Musk sets robotaxi date, Trump tensions cool",
    "description": "Tesla shares rallied for a fourth straight session as the spat between CEO Elon Musk and President Donald Trump showed signs of a cooldown.",
    "link": "https://biztoc.com/x/0e953563bd96449b",
    "timestamp": "2025-06-11T14:46:20Z"
  },
  {
    "title": "ICE Launches Campaign to Crack Down on Marriage Fraud — Could Ilhan Omar Finally Face Justice?",
    "description": "U.S.\nThe post ICE Launches Campaign to Crack Down on Marriage Fraud — Could Ilhan Omar Finally Face Justice? appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/06/ice-launches-campaign-crack-down-marriage-fraud-could/",
    "timestamp": "2025-06-11T14:45:31Z"
  },
  {
    "title": "California City Shuts Down Immigration Court Following Protests",
    "description": "An immigration court in San Francisco was shut down after protesters descended on the building on Tuesday.",
    "link": "https://www.newsweek.com/san-francisco-immigration-court-protests-2083905",
    "timestamp": "2025-06-11T14:44:38Z"
  },
  {
    "title": "People think Donald Trump was just ‘outplayed’ by world leader on his own trademark move",
    "description": "US president Donald Trump's 'trademark move' was blocked by Germany's Friedrich Merz in a recent viral video",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-handshake-chancellor-merz-076266-20250611",
    "timestamp": "2025-06-11T14:43:50Z"
  },
  {
    "title": "US Stocks Waffle as Traders Weigh US-China Trade Progress",
    "description": "US stocks oscillated between small gains and losses on Wednesday, as traders look past an upbeat report on cooling consumer prices and assess the outlook for global trade.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-waffle-as-traders-weigh-us-china-trade-progress",
    "timestamp": "2025-06-11T14:43:43Z"
  },
  {
    "title": "MAGA celebrates 'big surprise' in inflation data — but experts urge caution",
    "description": "MAGA world celebrated Wednesday's inflation report as proof that President Donald Trump's tariffs are good for the economy, while experts struck a more cautious tone.According to The Washington Post, \"Inflation picked up in May — but not as much as economists…",
    "link": "https://www.rawstory.com/maga-celebrates-better-than-expected-inflation-numbers-as-experts-urge-caution/",
    "timestamp": "2025-06-11T14:43:22Z"
  },
  {
    "title": "US inflation edges up but Trump tariff hit limited for now",
    "description": "US consumer inflation ticked up in May, in line with analyst expectations, government data showed Wednesday as President Donald Trump’s sweeping tariffs began to ripple through the world’s biggest economy. The consumer price index (CPI) came in at 2.4 percent…",
    "link": "https://www.digitaljournal.com/world/us-inflation-edges-up-but-trump-tariff-hit-limited-for-now/article",
    "timestamp": "2025-06-11T14:42:35Z"
  },
  {
    "title": "Brewer Heineken unveils $2.75 bn investment in Mexico",
    "description": "Dutch brewing giant Heineken announced Wednesday a $2.75 billion investment in Mexico  — the latest vote of confidence in Latin America’s second-largest economy despite US President Donald Trump’s trade war. The pledge follows similar moves by companies such …",
    "link": "https://www.digitaljournal.com/world/brewer-heineken-unveils-2-75-bn-investment-in-mexico/article",
    "timestamp": "2025-06-11T14:42:34Z"
  },
  {
    "title": "Poland: PM Tusk's pro-EU government wins confidence vote",
    "description": "Tusk's call for a confidence vote came after right-wing nationalist Karol Nawrocki was elected president, narrowly beating the Tusk-backed candidate. The opposition had said the lost election would be Tusk's downfall. Polish Prime Minister Donald Tusk won a p…",
    "link": "https://www.dw.com/en/poland-pm-tusks-pro-eu-government-wins-confidence-vote/a-72865397",
    "timestamp": "2025-06-11T14:42:00Z"
  },
  {
    "title": "NIH Head Claims Cutting Research Leads To More Research",
    "description": "NIH Director Jay Bhattacharya made no sense when he tried to claim that by the HHS cutting massive research dollars from the NIH, it will still end up producing excellent research.\nDonald Trump, with his insane cabinet picks is destroying every federal agency…",
    "link": "https://crooksandliars.com/2025/06/nih-director-cutting-research-good",
    "timestamp": "2025-06-11T14:41:25Z"
  },
  {
    "title": "Grandpa Dictator: Protestors Will Face 'Very Heavy Force' At My Parade",
    "description": "Trump's Big Boy parade, which will feature Army tanks, planes, and marching soldiers into Washington this week, will cost taxpayers $45 million. The Army will bring in 9,000 soldiers. That jaw-dropping amount could cover a year's salary and benefit costs for …",
    "link": "https://crooksandliars.com/2025/06/trump-promises-very-heavy-force-against",
    "timestamp": "2025-06-11T14:41:24Z"
  },
  {
    "title": "Trump claims the US-China trade war is over",
    "description": "President Donald Trump says he has reached a deal with China that will ensure the US receives rare earth materials, keeps tariffs at a total of 55 percent, and allows American universities to keep accepting Chinese students. Trump announced the news of the ag…",
    "link": "https://www.theverge.com/news/685390/trump-us-china-trade-war-agreement",
    "timestamp": "2025-06-11T14:41:23Z"
  },
  {
    "title": "Trump's tactics are nothing new — they've fueled rage and violence for centuries",
    "description": "Peter C. Mancall, USC Dornsife College of Letters, Arts and SciencesRecently, President Donald Trump declared that he is “bringing Columbus Day back from the ashes.” He hopes to make up for the removal of commemorative statues important to “the Italians that …",
    "link": "https://www.rawstory.com/politics-based-on-grievance-has-a-long/",
    "timestamp": "2025-06-11T14:40:40Z"
  },
  {
    "title": "Jimmy Fallon Remixes ‘Somebody That I Used to Know’ in Honor of Trump-Musk ‘National Divorce’ | Video",
    "description": "\"The Tonight Show\" host breaks out some of the finest breakup songs around\nThe post Jimmy Fallon Remixes ‘Somebody That I Used to Know’ in Honor of Trump-Musk ‘National Divorce’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-tonight-show-jimmy-fallon-trump-elon-musk-somebody-that-i-used-to-know/",
    "timestamp": "2025-06-11T14:40:38Z"
  },
  {
    "title": "Elon Musk says he regrets some posts about Donald Trump",
    "description": "Billionaire Elon Musk has said he regrets some of the posts he made about US President Donald Trump during their war of words on social media. \"They went too far,\" he wrote on his social media platform X. The two were embroiled in a public fallout after the T…",
    "link": "https://freerepublic.com/focus/f-news/4322378/posts",
    "timestamp": "2025-06-11T14:38:19Z"
  },
  {
    "title": "The war is on for Congress’ AI law ban",
    "description": "\"This is absurd.\" That's all Amba Kak, co-executive director of the AI Now Institute, recalls thinking when she first heard about the proposed moratorium on state AI regulation tucked into President Donald Trump's \"big, beautiful bill\" - the same funding bill…",
    "link": "https://www.theverge.com/ai-artificial-intelligence/684924/congress-big-beautiful-bill-state-ai-law-ban-pushback",
    "timestamp": "2025-06-11T14:37:49Z"
  },
  {
    "title": "Big changes are being proposed for a US food aid program. Here’s a breakdown by the numbers",
    "description": "Big changes are being proposed to a food aid program as part of President Donald Trump's tax-cut legislation.",
    "link": "https://www.bostonherald.com/2025/06/11/food-aid-by-the-numbers/",
    "timestamp": "2025-06-11T14:37:18Z"
  },
  {
    "title": "Attorney General Bondi calls out Gavin Newsom for not protecting city, vows to prosecute looters and rioters",
    "description": "Attorney General Bondi criticizes Governor Newsom's handling of anti-ICE riots, promising federal charges for looters after Newsom claimed Trump's troop deployment inflamed tensions.",
    "link": "https://www.foxnews.com/media/attorney-general-bondi-gavin-newsom-protecting-city-vows-prosecute-looters-rioters",
    "timestamp": "2025-06-11T14:35:47Z"
  },
  {
    "title": "A Skeptic’s Guide to Immigration",
    "description": "The U.S. immigration system is the most expansive and complex in the world. What data is there about the economic, cultural, and political consequences of immigration, such as its impact on wages, social cohesion, and national identity?",
    "link": "https://www.skeptic.com/article/skeptics-guide-to-immigration/",
    "timestamp": "2025-06-11T14:35:42Z"
  },
  {
    "title": "Trump Claims ‘Great And Important’ Tariff Court Win: Here’s Why That’s Wrong",
    "description": "An appeals court kept Trump’s tariffs in place for now—but could still strike them down in the future.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/11/trump-claims-great-and-important-tariff-court-win-heres-why-thats-wrong/",
    "timestamp": "2025-06-11T14:35:29Z"
  },
  {
    "title": "Los Angeles police swiftly enforce curfew as protests against Trump’s immigration crackdown continue",
    "description": "Hours after the curfew went into effect Tuesday night, many of the protesters had dispersed, although small sporadic confrontations continued. Trump ordered the deployment of nearly 5,000 military members, including National Guard and Marines, to LA.",
    "link": "https://www.pbs.org/newshour/nation/los-angeles-police-swiftly-enforce-curfew-as-protests-against-trumps-immigration-crackdown-continue",
    "timestamp": "2025-06-11T14:35:20Z"
  },
  {
    "title": "GOP can't agree whether Trump's bill would shrink, or grow, deficit (Washington Post)",
    "description": "Washington Post:\nGOP can't agree whether Trump's bill would shrink, or grow, deficit  —  President Trump and Speaker Mike Johnson say their tax-and-spending bill will slash the deficit.  A growing number of their Republican colleagues disagree.  —  President …",
    "link": "https://www.memeorandum.com/250611/p49",
    "timestamp": "2025-06-11T14:35:00Z"
  },
  {
    "title": "Tesla gains for a fourth day as Musk sets robotaxi date, Trump tensions cool",
    "description": "Tesla shares rallied for a fourth straight session as the spat between CEO Elon Musk and President Donald Trump showed signs of a cooldown.",
    "link": "https://www.cnbc.com/2025/06/11/tesla-stock-musk-robotaxi-trump.html",
    "timestamp": "2025-06-11T14:33:28Z"
  },
  {
    "title": "How the Los Angeles protests unfolded: A visual guide",
    "description": "The protests erupted following ICE immigration raids, igniting a battle between state and federal officials.",
    "link": "https://www.aljazeera.com/news/2025/6/11/how-the-los-angeles-protests-unfolded-a-visual-guide",
    "timestamp": "2025-06-11T14:33:20Z"
  },
  {
    "title": "Musk backs off from Trump feud, saying he regrets some posts that ‘went too far’ - AP News",
    "description": "Musk backs off from Trump feud, saying he regrets some posts that ‘went too far’AP News Elon Musk says he regrets some social media posts he made about TrumpCNBC Elon Musk says some of his social media posts about Trump 'went too far'NPR Elon Musk's apology t…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178007263",
    "timestamp": "2025-06-11T14:33:07Z"
  },
  {
    "title": "Greg Abbott Orders National Guard to Deploy in Texas as Protests Spread Across U.S. Cities",
    "description": "“Texas Guard will use every tool and strategy to help law enforcement maintain order,\" said Gov. Abbott.",
    "link": "https://time.com/7293162/greg-abbott-to-deploy-national-guard-in-texas-as-protests-spread-across-cities/",
    "timestamp": "2025-06-11T14:32:50Z"
  },
  {
    "title": "Trump Declares US-China Trade Deal ‘Done’ After London Talks",
    "description": "President Donald Trump announced Wednesday morning that a new U.S.-China trade agreement, negotiated in London earlier this week, is “done.”",
    "link": "https://dailycaller.com/2025/06/11/trump-declares-us-china-trade-deal-done-london-talks/",
    "timestamp": "2025-06-11T14:32:02Z"
  },
  {
    "title": "Tensions remain high in Los Angeles; DC prepares for military parade | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_f43f5b9a-4d6c-5a98-9e7b-dee21f480e27.html",
    "timestamp": "2025-06-11T14:30:00Z"
  },
  {
    "title": "Trump May Abolish Some National Monuments",
    "description": "“Trump administration officials have concluded that President Donald Trump has the authority to entirely abolish protected areas set aside as national monuments by past presidents, according to a legal opinionreleased Tuesday by the Department of Justice,”",
    "link": "https://politicalwire.com/2025/06/11/trump-may-abolish-some-national-monuments/",
    "timestamp": "2025-06-11T14:30:00Z"
  },
  {
    "title": "Tensions remain high in Los Angeles; DC prepares for military parade | Hot off the Wire",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_384ae964-b724-51fd-9fc5-cc309e81725d.html",
    "timestamp": "2025-06-11T14:30:00Z"
  },
  {
    "title": "No, Leftists — Rioters Don’t Deserve Land Acknowledgements",
    "description": "'California was part of Mexico, all of the Southwest is Mexico, so the roots are really deep in that region,”' said former Univision anchor María Elena Salinas",
    "link": "https://dailycaller.com/2025/06/11/los-angeles-riots-california-mexico-maria-elena-salinas-spain-gerardo-fernandez-norona/",
    "timestamp": "2025-06-11T14:27:17Z"
  },
  {
    "title": "Jimmy Kimmel Says Trump Is Being “Tougher On L.A. Than Russia”: “By All Means, Send The Marines To The Grove”",
    "description": "\"This is an unstable person,\" Kimmel said.",
    "link": "https://decider.com/2025/06/11/jimmy-kimmel-trump-tougher-russia-marines-grove/",
    "timestamp": "2025-06-11T14:26:38Z"
  },
  {
    "title": "Trump hails favorable federal appeals court ruling on his sweeping tariff policy as a 'great' win",
    "description": "President Donald Trump on Wednesday hailed a favorable decision by a federal appeals court over his sweeping tariff policy as a “great” win for the United States. Trump said on his social media site that the court’s decision Tuesday night to let the governmen…",
    "link": "https://freerepublic.com/focus/f-news/4322375/posts",
    "timestamp": "2025-06-11T14:25:34Z"
  },
  {
    "title": "Trump urges Fed to cut rates after CPI figures",
    "description": "United States President Donald Trump on Tuesday called on the Federal Reserve to proceed with a major cut in interest rates after the latest inflation figures were released. \"CPI just out. Great numbe...",
    "link": "https://biztoc.com/x/fecb38eb1dc167ca",
    "timestamp": "2025-06-11T14:24:36Z"
  },
  {
    "title": "LA Under Curfew as Protests Spread to New York, Chicago",
    "description": "Protests over immigration raids stretched into a fifth night in Los Angeles and spread to other cities, including New York, Chicago and Milwaukee, prompting clashes between police and demonstrators.\nCalifornia’s Democratic Governor Gavin Newsom accused Presid…",
    "link": "https://biztoc.com/x/04c96c8a90a39178",
    "timestamp": "2025-06-11T14:24:18Z"
  },
  {
    "title": "For today's \"This Will Go Well\" story, Donald Trump plans to phase out FEMA after the 2025 hurricane season [Interesting]",
    "description": "For today's \"This Will Go Well\" story, Donald Trump plans to phase out FEMA after the 2025 hurricane season",
    "link": "https://www.fark.com/comments/13703078/For-todays-This-Will-Go-Well-story-Donald-Trump-plans-to-phase-out-FEMA-after-2025-hurricane-season",
    "timestamp": "2025-06-11T14:24:15Z"
  },
  {
    "title": "U.S. inflation rose slightly last month as grocery prices ticked higher",
    "description": "The figures suggest inflation remains stubbornly above the Federal Reserve's 2% target, which makes it less likely that the central bank will cut its key short-term interest rate.",
    "link": "https://www.pbs.org/newshour/economy/u-s-inflation-rose-slightly-last-month-as-grocery-prices-ticked-higher",
    "timestamp": "2025-06-11T14:23:15Z"
  },
  {
    "title": "Bessent Credits Trump Policies for ‘Substantial’ CPI Improvement",
    "description": "Treasury Secretary Scott Bessent credited President Donald Trump’s policies for a slowdown in US inflation, and said he had challenged a “decades-old status quo” on trade.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-credits-trump-policies-for-substantial-cpi-improvement",
    "timestamp": "2025-06-11T14:23:13Z"
  },
  {
    "title": "Trump's first term shows why markets are cautious on the China trade deal",
    "description": "Investors could be starting to realize that US-China trade talks will continue to drag out, and mirror the meandering progress of the 2018-2019 dispute.",
    "link": "https://www.businessinsider.com/china-tariffs-deal-stock-market-trump-trade-war-rare-earth-2025-6",
    "timestamp": "2025-06-11T14:23:09Z"
  },
  {
    "title": "FDT: Trump Calls LA Protesters ‘Paid Insurrectionist Animals’, Vows To ‘Liberate’ City",
    "description": "Donald Trump is a dangerous showman who is willing to sacrifice humanity, dignity, morality, and reasonable federal policy in order to make himself look like the men he idolizes most, dictators and oligarchs. His latest production isn’t filmed on a Hollywood …",
    "link": "https://bossip.com/3105656/trump-calls-la-protesters-paid-insurrectionist-animals/",
    "timestamp": "2025-06-11T14:23:05Z"
  },
  {
    "title": "No quick breakthroughs in US-Russia relations – Kremlin",
    "description": "Diplomats still have a lot of “logjams” and “irritants” to clear, spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/618957-no-quick-breakthroughs-us-russia/",
    "timestamp": "2025-06-11T14:21:26Z"
  },
  {
    "title": "India to speed up trade talks with US for early gains",
    "description": "India aims to accelerate trade talks with the US before July 9 to avoid reciprocal tariffs, focusing on early gains.",
    "link": "https://www.thehindubusinessline.com/economy/india-to-speed-up-trade-talks-with-us-for-early-gains/article69683434.ece",
    "timestamp": "2025-06-11T14:20:06Z"
  },
  {
    "title": "Impeachable: House Black Caucus' head warns Trump he's facing misconduct charge",
    "description": "U.S. Congressional Black Caucus Chair Yvette Clarke, a Democrat from New York, said on Tuesday that U.S. President Donald Trump's moves to send in National Guard troops and Marines in response to protests in Los Angeles rise to the level of impeachable offens…",
    "link": "https://www.rawstory.com/impeachable-house-black-caucus-head-warns-trump-he-s-facing-misconduct-charge/",
    "timestamp": "2025-06-11T14:19:46Z"
  },
  {
    "title": "Why Snoop Dogg Receiving an Icon Award From BET Months After Performing For Trump is Pure Hypocrisy",
    "description": "Snoop received the Ultimate Icon Award, but many online felt like it was undeserved considering his support for Trump.\nThe post Why Snoop Dogg Receiving an Icon Award From BET Months After Performing For Trump is Pure Hypocrisy appeared first on The Root.",
    "link": "https://www.theroot.com/why-snoop-dogg-receiving-an-icon-award-from-bet-months-2000044862",
    "timestamp": "2025-06-11T14:18:33Z"
  },
  {
    "title": "The Problem With Snoop Dogg Receiving an Icon Award From BET Months After Performing For Trump",
    "description": "Snoop received the Ultimate Icon Award, but many online felt like it was undeserved considering his support for Trump.\nThe post The Problem With Snoop Dogg Receiving an Icon Award From BET Months After Performing For Trump appeared first on The Root.",
    "link": "https://www.theroot.com/the-problem-with-snoop-dogg-receiving-an-icon-award-fro-2000044862",
    "timestamp": "2025-06-11T14:18:33Z"
  },
  {
    "title": "‘The View’ Co-Host Posits Baseless Theory About Why Trump Deployed Troops To LA",
    "description": "Ana Navarro claimed President Donald Trump’s orders to deploy the National Guard was “wagging the dog” to distract Americans from a failed presidency.",
    "link": "https://dailycaller.com/2025/06/11/the-view-co-host-trump-la-riots/",
    "timestamp": "2025-06-11T14:16:37Z"
  },
  {
    "title": "Donald Trump says US-China deal ‘done’ as two sides restore trade war truce - Financial Times",
    "description": "Donald Trump says US-China deal ‘done’ as two sides restore trade war truceFinancial Times Trump says China will supply rare earths in 'done' dealCNBC Trump Says Trade ‘Deal With China Is Done.’ Tariffs Are Still On.Barron's US, China reach deal to ease expor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178007149",
    "timestamp": "2025-06-11T14:15:55Z"
  },
  {
    "title": "Elon Musk Has ‘Regret’ Over Some of His Trump Insults: ‘They Went Too Far’",
    "description": "The president has not yet responded to Musk's update, but said in a podcast released on Wednesday that he has \"no hard feelings\" towards the ex-DOGE boss\nThe post Elon Musk Has ‘Regret’ Over Some of His Trump Insults: ‘They Went Too Far’ appeared first on The…",
    "link": "https://www.thewrap.com/elon-musk-regrets-donald-trump-insults/",
    "timestamp": "2025-06-11T14:15:55Z"
  },
  {
    "title": "America deports yet another lot of Nepalis staying illegally in the USA",
    "description": "By Our Reporter The USA deported another lot of Nepalis from the USA this week. A total of 37 Nepali […]\nThe post America deports yet another lot of Nepalis staying illegally in the USA appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/06/11/america-deports-yet-another-lot-of-nepalis-staying-illegally-in-the-usa/",
    "timestamp": "2025-06-11T14:14:43Z"
  },
  {
    "title": "Syria's Islamist Swimwear Ban Faces Backlash",
    "description": "The new Syrian government has imposed a beach dress code in line with conservative Islamic values",
    "link": "https://www.newsweek.com/syrias-islamist-swimwear-ban-faces-backlash-2083930",
    "timestamp": "2025-06-11T14:14:35Z"
  },
  {
    "title": "Trump Puts Iran Nuclear Deal in Doubt, Raising Risk of War",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has signaled diminishing confidence in reaching a nuclear agreement with Iran, raising new concerns about the possibility of military conflict in the region. In a podcast interview relea…",
    "link": "https://biztoc.com/x/a2f492334cadfdd3",
    "timestamp": "2025-06-11T14:13:34Z"
  },
  {
    "title": "Donald Trump Scores Major Polling Win Over Democrats",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has notched a significant victory over Democrats, with polling showing him outperforming his rivals on one of the most contentious issues: immigration.\nOn the broader question of trust, …",
    "link": "https://biztoc.com/x/aed5d3d547fa716d",
    "timestamp": "2025-06-11T14:13:23Z"
  },
  {
    "title": "President Donald Trump says US gets rare earth minerals from China in trade deal, tariffs on Chinese goods go to 55%",
    "description": "WASHINGTON — President Donald Trump announced Wednesday that the United States will get magnets and rare earth minerals from China under a new trade deal and that tariffs on Chinese goods will rise to 55%.\nIn return, Trump said, the U.S. will provide China “w…",
    "link": "https://biztoc.com/x/e7353e8283194b81",
    "timestamp": "2025-06-11T14:13:13Z"
  },
  {
    "title": "Plugging the gap: How Europe can keep Ukraine supplied with the means to defend itself",
    "description": "Plugging the gap: How Europe can keep Ukraine supplied with the means to defend itself\nfanny.pollet@i…\nWed, 06/11/2025 - 17:13\n\n\n 10 minutes\n \n Donald Trump’s election as US President has led to a flurry of diplomacy over Russia’s war on Ukraine. The outcome …",
    "link": "https://www.iss.europa.eu/publications/briefs/plugging-gap-how-europe-can-keep-ukraine-supplied-means-defend-itself",
    "timestamp": "2025-06-11T14:13:02Z"
  },
  {
    "title": "Trump’s Fort Bragg speech was a serious step toward ending democracy",
    "description": "President Donald Trump shakes hands with Lt. Gen. Jonathan Braga, commanding general of the US Army Special Operations Commany, as he arrives to watch a military demonstration at Fort Bragg near Fayetteville, N.C., on June 10, 2025.",
    "link": "https://biztoc.com/x/4abcbe32edc87473",
    "timestamp": "2025-06-11T14:12:45Z"
  },
  {
    "title": "Donald Trump Scores Major Polling Win Over Democrats",
    "description": "On the question of trust, Republicans lead Democrats on immigration by 6 points in CBS and CNN polling and 19 in an Ipsos survey.",
    "link": "https://www.newsweek.com/donad-trump-democrats-immigration-poll-2083918",
    "timestamp": "2025-06-11T14:12:09Z"
  },
  {
    "title": "Kennedy: A Gen X Rebel's Journey From MTV to Fox News",
    "description": "The Fox News personality reflects on her evolution from a contrarian Republican to a libertarian and her belief that personal freedom, humor, and not giving a shit are the keys to a better America.",
    "link": "https://reason.com/podcast/2025/06/11/kennedy-a-gen-x-rebels-journey-from-mtv-to-fox-news/",
    "timestamp": "2025-06-11T14:11:57Z"
  },
  {
    "title": "Bruce Springsteen’s ‘Born To Run’ Debuts On One Chart Just Before It Turns 50",
    "description": "Bruce Springsteen’s Born to Run debuts at No. 92 on the U.K.'s Official Album Downloads chart nearly 50 years after its original release.",
    "link": "https://www.forbes.com/sites/hughmcintyre/2025/06/11/bruce-springsteens-born-to-run-debuts-on-one-chart-just-before-it-turns-50/",
    "timestamp": "2025-06-11T14:11:30Z"
  },
  {
    "title": "Watch Live: Defense Secretary Pete Hegseth Testifies Before Senate",
    "description": "Secretary of Defense Pete Hegseth testifies before the Senate Appropriations Committee on Wednesday, June 11.\nThe post Watch Live: Defense Secretary Pete Hegseth Testifies Before Senate appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/11/watch-live-defense-secretary-pete-hegseth-testifies-before-senate/",
    "timestamp": "2025-06-11T14:10:57Z"
  },
  {
    "title": "MSNBC’s Mike Barnicle Tells Viewers Not To Believe All The Footage Showing Riots, Flames In LA",
    "description": "MSNBC's Mike Barnicle told his viewers not to believe the footage and photographs they are seeing coming from Los Angeles, California.",
    "link": "https://dailycaller.com/2025/06/11/msnbc-mike-barnicle-footage-la-riots/",
    "timestamp": "2025-06-11T14:10:38Z"
  }
]