[
  {
    "title": "Biden Gives Powerful Speech Reminding Nation Why He's No Longer President",
    "description": "CHICAGO, IL — Former President Joe Biden delivered a heartfelt address reminding the nation precisely why he is no longer President.",
    "link": "https://babylonbee.com/news/biden-gives-powerful-speech-reminding-nation-why-hes-no-longer-president",
    "timestamp": "2025-04-16T17:38:51Z"
  },
  {
    "title": "US senator lands in El Salvador seeking release of wrongly deported Salvadoran man",
    "description": "Democratic Senator Chris Van Hollen arrived in El Salvador on Wednesday morning saying he would seek to meet with senior officials from the Central American ...",
    "link": "https://www.yahoo.com/news/us-senator-lands-el-salvador-173844646.html",
    "timestamp": "2025-04-16T17:38:44Z"
  },
  {
    "title": "Dan Abrams Destroys Trump Argument That Other Presidents Have Defied Court Orders",
    "description": "Mediaite founder Dan Abrams tore into the growing narrative among members of the Trump administration that defying a Supreme Court order is no big deal or even has historical precedent — warning the move is nothing short of “dangerous.” On his show on Tuesday…",
    "link": "https://www.mediaite.com/tv/dan-abrams-destroys-trump-argument-that-other-presidents-have-defied-court-orders/",
    "timestamp": "2025-04-16T17:38:06Z"
  },
  {
    "title": "Seth Rogen’s Brutal Jab At Trump Supporters Mysteriously Cut From Star-Studded Awards Ceremony Stream",
    "description": "The Studio star called out certain attendees \"in this room\" for supporting President Trump's election.",
    "link": "https://decider.com/2025/04/16/seth-rogen-brutal-jab-tech-trump-cut-awards-ceremony-stream/",
    "timestamp": "2025-04-16T17:37:17Z"
  },
  {
    "title": "US economy slowing in Q1, can wait for greater clarity: U.S. Federal Reserve Chair Jerome Powell",
    "description": "U.S. economic growth is showing signs of deceleration, Federal Reserve Chair Jerome Powell stated, citing modest consumer spending and tariff-related import surges. Despite this slowdown, the economy and labor market remain robust. The Fed is closely monitori…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-economy-slowing-in-q1-can-wait-for-greater-clarity-u-s-federal-reserve-chair-jerome-powell/articleshow/120353921.cms",
    "timestamp": "2025-04-16T17:36:20Z"
  },
  {
    "title": "Home Alone 2's Director Calls Donald Trump's Cameo His 'Albatross.' Why He 'Can't Cut It'",
    "description": "The filmmaker didn't mince words.",
    "link": "https://www.cinemablend.com/movies/home-alone-2-director-donald-trump-cameo-his-albatross-why-he-cant-cut-it",
    "timestamp": "2025-04-16T17:35:32Z"
  },
  {
    "title": "Jerome Powell says Federal Reserve can wait on any interest rate moves",
    "description": "Federal Reserve Chair Jerome Powell indicated a patient approach to interest rate adjustments, awaiting clarity on the economic impact of the Trump administration's policies, including tariffs. While acknowledging the potential for higher inflation and slower…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/jerome-powell-says-federal-reserve-can-wait-on-any-interest-rate-moves/articleshow/120353898.cms",
    "timestamp": "2025-04-16T17:35:28Z"
  },
  {
    "title": "Powell says Federal Reserve can wait on any interest rate moves",
    "description": "For now, most recent reports suggest the economy is in solid shape.",
    "link": "https://www.bostonherald.com/2025/04/16/federal-reserve-waiting/",
    "timestamp": "2025-04-16T17:35:17Z"
  },
  {
    "title": "Laurence Tribe: We Have an ‘Impending Police State’ Under Trump",
    "description": "Left-wing commentator and Harvard Law professor emeritus Laurence Tribe claimed Tuesday on MSNBC’s “Deadline” that President Donald Trump’s administration was causing “an impending police state.” Tribe said, “I been in school for 50 years studying the constit…",
    "link": "https://freerepublic.com/focus/f-news/4311398/posts",
    "timestamp": "2025-04-16T17:35:07Z"
  },
  {
    "title": "Fort Benning takes back its old name, but to honor a different soldier",
    "description": "The switch comes less than two years after the post was redesignated Fort Moore.",
    "link": "https://www.bostonherald.com/2025/04/16/fort-benning-rededication-fort-moore/",
    "timestamp": "2025-04-16T17:35:05Z"
  },
  {
    "title": "Martha Stewart quote comparing her crimes to allegations of Trump's insider trading is not real",
    "description": "Lifestyle entrepreneur Martha Stewart is the genuine author of a quote comparing her past criminal convictions to allegations of U.S. President Donald Trump's second administration engaging in insider trading.",
    "link": "https://www.snopes.com//fact-check/trump-insider-trading-martha-stewart/",
    "timestamp": "2025-04-16T17:35:00Z"
  },
  {
    "title": "ACLU sues Defense Department school system over banning race- and gender-related books",
    "description": "The American Civil Liberties Union is suing the Department of Defense’s school system over banned race- and gender-related educational materials",
    "link": "https://abcnews.go.com/US/wireStory/aclu-sues-defense-department-school-system-banning-race-120875113",
    "timestamp": "2025-04-16T17:34:44Z"
  },
  {
    "title": "Trump Touts Trade Talks, China Calls Out Tariff 'Blackmail'",
    "description": "US President Donald Trump touted tariff negotiations with Japan on Wednesday while China angrily accused Washington of \"blackmail\" in a trade war that the WTO warns will have \"severe\" economic consequences for the global economy.",
    "link": "https://www.ibtimes.com/trump-touts-trade-talks-china-calls-out-tariff-blackmail-3770359",
    "timestamp": "2025-04-16T17:33:09Z"
  },
  {
    "title": "US Fed Chair warns of ‘tension’ between employment, inflation goals",
    "description": "Tariffs are likely to push up prices and could put the US Federal Reserve in the unenviable position of having to choose between tackling inflation and unemployment, the bank’s chair said Wednesday. Unlike some other central banks, the US Fed has a dual manda…",
    "link": "https://www.digitaljournal.com/world/us-fed-chair-warns-of-tension-between-employment-inflation-goals/article",
    "timestamp": "2025-04-16T17:32:32Z"
  },
  {
    "title": "Trump touts trade talks, China calls out tariff ‘blackmail’",
    "description": "US President Donald Trump touted tariff negotiations with Japan on Wednesday while China angrily accused Washington of “blackmail” in a trade war that the WTO warns will have “severe” economic consequences for the global economy. Trump remained upbeat about h…",
    "link": "https://www.digitaljournal.com/world/trump-touts-trade-talks-china-calls-out-tariff-blackmail/article",
    "timestamp": "2025-04-16T17:32:21Z"
  },
  {
    "title": "Why cost of living is still the top ballot box issue for gen Z voters",
    "description": "Young Canadians say politicians aren’t doing enough to address their youngest voters' economic and financial fears. Find out more",
    "link": "https://financialpost.com/federal_election/cost-of-living-top-ballot-box-issue-gen-z-voters",
    "timestamp": "2025-04-16T17:31:24Z"
  },
  {
    "title": "Zelensky Suggests U.S. Ruling Class Is Under The Control Of Moscow, Angering VP Vance",
    "description": "Ukraine's ruler, war monger Volodymyr Zelensky has lashed out at the United States' ruling class, claiming that it is under the control of the RUssian empire. This \"insult\" angered U.S. vice president J.D. Vance, who called the statement \"absurd.\"",
    "link": "https://www.shtfplan.com/headline-news/zelensky-suggests-u-s-ruling-class-is-under-the-control-of-moscow-angering-vp-vance",
    "timestamp": "2025-04-16T17:30:56Z"
  },
  {
    "title": "Trump administration wilfully defied court order on deportations, judge finds",
    "description": "Officials in Donald Trump's administration could face criminal prosecution, a US judge says, because they have shown \"wilful disregard\" for a bar on deporting alleged gang members to El Salvador.",
    "link": "https://www.abc.net.au/news/2025-04-17/judge-in-venezuelan-migrants-case-finds-trump-admin-probably-con/105186022",
    "timestamp": "2025-04-16T17:30:44Z"
  },
  {
    "title": "Fed Chair Powell gives starkest warning yet on potential economic consequences from tariffs | CNN Business",
    "description": "President Donald Trump’s significant policy changes, including on tariffs, are unlike anything seen in modern history, putting the Federal Reserve in uncharted waters, Chair Jerome Powell said Wednesday.",
    "link": "https://www.cnn.com/2025/04/16/economy/fed-chair-jerome-powell-tariffs/index.html",
    "timestamp": "2025-04-16T17:30:35Z"
  },
  {
    "title": "Has China Seen Donald Trump",
    "description": "I imagine China gets why this his hilarious, even if the people writing it up don't.\nChina wants to see a number of steps from President Donald Trump’s administration before it will agree to trade talks, including showing more respect by reining in disparagin…",
    "link": "https://www.eschatonblog.com/2025/04/has-china-seen-donald-trump.html",
    "timestamp": "2025-04-16T17:30:00Z"
  },
  {
    "title": "The Insidious Message Behind Kristi Noem's 'ICE Barbie' Cosplay",
    "description": "Why do pro-Trump women have to look sexy during immigration raids?",
    "link": "https://www.huffpost.com/entry/kristi-noem-ice-cosplay-raids_l_67fe9585e4b02eab6a33d0ef",
    "timestamp": "2025-04-16T17:28:27Z"
  },
  {
    "title": "WHO member countries agree on a draft ‘pandemic treaty’ to try to avoid COVID-19 mistakes",
    "description": "Trump withdrew the U.S. from the U.N. health organization.",
    "link": "https://www.bostonherald.com/2025/04/16/who-pandemic-treaty/",
    "timestamp": "2025-04-16T17:28:21Z"
  },
  {
    "title": "US Judge Says 'Probable Cause' To Hold Govt In Contempt Over Deportations",
    "description": "A US federal judge said Wednesday he had found \"probable cause\" to hold President Donald Trump's administration in contempt in a deportation case, raising the stakes in the White House's confrontation with the US justice system.",
    "link": "https://www.ibtimes.com/us-judge-says-probable-cause-hold-govt-contempt-over-deportations-3770358",
    "timestamp": "2025-04-16T17:27:18Z"
  },
  {
    "title": "'Jaw-dropping conflict of interest': Trump accused of new scheme to benefit from trade war",
    "description": "President Donald Trump's social media company is marketing \"America First\" accounts that would allow him to personally benefit from the tariffs that have been roiling the stock market and lopping value off the dollar.Trump Media and Technology Group (TMTG), t…",
    "link": "https://www.rawstory.com/trump-media-and-technology-group/",
    "timestamp": "2025-04-16T17:26:53Z"
  },
  {
    "title": "DOGE Staffers Pay Visit To NLRB Offices Following Whistleblower Report",
    "description": "The Musk-affiliated staffers visited NLRB’s Washington D.C. headquarters to meet with leadership on Tuesday.",
    "link": "https://www.forbes.com/sites/johnhyatt/2025/04/16/doge-staffers-pay-visit-to-nlrb-offices-following-whistleblower-report/",
    "timestamp": "2025-04-16T17:26:46Z"
  },
  {
    "title": "'You shouldn't need a private company to fill out paperwork for you'",
    "description": "Opinion, comment and editorials of the day",
    "link": "https://theweek.com/politics/instant-opinion-taxes-tariffs-fluoride-supreme-court",
    "timestamp": "2025-04-16T17:26:38Z"
  },
  {
    "title": "Trump’s executive order on drug pricing could be a booster for Indian pharma industry",
    "description": "Donald Trump's healthcare revamp, emphasizing generics and biosimilars, could boost Indian drug makers, who already supply 40% of US generic imports. While the move aims to lower drug costs for Americans, potential tariffs on pharma imports create uncertainty.",
    "link": "https://economictimes.indiatimes.com/industry/healthcare/biotech/pharmaceuticals/trumps-executive-order-on-drug-pricing-could-be-a-booster-for-indian-pharma-industry/articleshow/120353676.cms",
    "timestamp": "2025-04-16T17:26:17Z"
  },
  {
    "title": "Tense town hall: Grassley pressed on Medicaid, Trump, tariffs",
    "description": "Although the meeting was often acrimonious, several attendees thanked GOP Sen. Chuck Grassley for holding in-person meetings.",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/16/grassley-tense-town-hall-trump/83121036007/",
    "timestamp": "2025-04-16T17:25:12Z"
  },
  {
    "title": "Iran and Russia Deepen Alliance Amid US Tensions",
    "description": "Russia's upper house of parliament ratified a key strategic partnership deal signed between Moscow and Tehran on Wednesday.",
    "link": "https://www.newsweek.com/iran-russia-deepen-alliance-amid-us-tensions-2060511",
    "timestamp": "2025-04-16T17:23:54Z"
  },
  {
    "title": "Report: Canada's Immigration Lawyers 'Overwhelmed' with Transgender Asylum Requests from U.S.",
    "description": "Canadian media reported this week that immigration attorneys and LGBTQIA2+ activists have noticed a significant spike in the number of requests for information from Americans identifying as transgender seeking to move to Canada, claiming persecution under the…",
    "link": "https://www.breitbart.com/immigration/2025/04/16/report-canadas-immigration-lawyers-overwhelmed-with-transgender-asylum-requests-from-u-s/",
    "timestamp": "2025-04-16T17:23:25Z"
  },
  {
    "title": "US judge says ‘probable cause’ to hold govt in contempt over deportations",
    "description": "A US federal judge said Wednesday he had found “probable cause” to hold President Donald Trump’s administration in contempt in a deportation case, raising the stakes in the White House’s confrontation with the US justice system. The ruling refers to District …",
    "link": "https://www.digitaljournal.com/world/us-judge-says-probable-cause-to-hold-govt-in-contempt-over-deportations/article",
    "timestamp": "2025-04-16T17:23:17Z"
  },
  {
    "title": "This is what travelling to the U.S. is like as a Canadian right now",
    "description": "When I booked my flight from Canada to the United States last year, I didn't anticipate U.S. border rules to tighten so drastically.\r\nMy friends had set an April 2025 date for their wedding in Orlando, Florida, well before Donald Trump became America's 47th p…",
    "link": "https://dailyhive.com/canada/crossing-canada-us-border",
    "timestamp": "2025-04-16T17:23:08Z"
  },
  {
    "title": "George Clooney Addresses Controversial Call For Biden To Drop Out",
    "description": "The Oscar winner told Jake Tapper he just couldn't sit idle in the aftermath of Biden's dismal presidential debate performance last summer.",
    "link": "https://www.huffpost.com/entry/george-clooney-biden-election-op-ed-civic-duty_n_67ffc1b9e4b0b55f47db1b25",
    "timestamp": "2025-04-16T17:22:48Z"
  },
  {
    "title": "Vermont maple syrup makers face uncertainty amid Canada and China tariff chaos",
    "description": "Many aspects of syrup production are affected by the steep new taxes announced by Trump.",
    "link": "https://www.bostonherald.com/2025/04/16/trump-tariffs-maple-syrup/",
    "timestamp": "2025-04-16T17:21:47Z"
  },
  {
    "title": "US Eliminates Unit Countering Foreign Disinformation",
    "description": "The United States on Wednesday eliminated a key government agency that tracked foreign disinformation, framing the move as an effort to preserve \"free speech.\"",
    "link": "https://www.ibtimes.com/us-eliminates-unit-countering-foreign-disinformation-3770357",
    "timestamp": "2025-04-16T17:21:19Z"
  },
  {
    "title": "Enbridge’s Pipeline Tunnel in Michigan Gets Expedited by US",
    "description": "The Trump administration is fast-tracking a permit needed by Enbridge Inc. to build a disputed pipeline tunnel under the Straits of Mackinac in northern Michigan.",
    "link": "https://financialpost.com/pmn/business-pmn/enbridges-pipeline-tunnel-in-michigan-gets-expedited-by-us",
    "timestamp": "2025-04-16T17:21:01Z"
  },
  {
    "title": "Judge Finds ‘Probable Cause’ to Hold Trump Admin in Contempt Over Deportation Orders",
    "description": "SCOTUS vacated Judge James Boasberg's TRO. The judge said SCOTUS's decision \"does not excuse the Government's violation.\"\nThe post Judge Finds ‘Probable Cause’ to Hold Trump Admin in Contempt Over Deportation Orders first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/judge-finds-probable-cause-to-hold-trump-admin-in-contempt-over-deportation-orders/",
    "timestamp": "2025-04-16T17:18:01Z"
  },
  {
    "title": "US eliminates unit countering foreign disinformation",
    "description": "The United States on Wednesday eliminated a key government agency that tracked foreign disinformation, framing the move as an effort to preserve “free speech.” The closure of the Counter Foreign Information Manipulation and Interference hub, previously known …",
    "link": "https://www.digitaljournal.com/world/us-eliminates-unit-countering-foreign-disinformation/article",
    "timestamp": "2025-04-16T17:17:20Z"
  },
  {
    "title": "Iran Ties with MTN, Chaired by South Africa's New Envoy, Could Hurt Meta, Other Firms",
    "description": "The Iran ties of MTN, the telecommunications firm chaired by South Africa's new envoy to the U.S., Mcebisi Jonas, could have damaging reputational effects on Meta and other firms as MTN comes under scrutiny.\nThe post Iran Ties with MTN, Chaired by South Afric…",
    "link": "https://www.breitbart.com/africa/2025/04/16/iran-ties-with-mtn-chaired-by-south-africas-new-envoy-could-hurt-meta-other-firms/",
    "timestamp": "2025-04-16T17:17:14Z"
  },
  {
    "title": "Border Patrol morale is 'going through the roof' under Trump administration, top official says",
    "description": "U.S. Border Patrol Chief Mike Banks said morale at his agency is \"going through the roof\" under the Trump administration and that recruiting numbers are up.",
    "link": "https://www.foxnews.com/us/border-patrol-morale-going-through-roof-under-trump-administration-top-official-says",
    "timestamp": "2025-04-16T17:16:01Z"
  },
  {
    "title": "The U.S. Navy Has Two Carriers Operating in the Middle East",
    "description": "The United States Central Command (CENTCOM) announced late Thursday evening that the U.S. Navy’s Nimitz-class nuclear-powered supercarrier USS Carl Vinson has arrived in the Middle East. Along with sending B-2s to the island of Diego Garcia in the middle of t…",
    "link": "https://nationalinterest.org/blog/buzz/the-u-s-navy-has-two-carriers-operating-in-the-middle-east",
    "timestamp": "2025-04-16T17:15:43Z"
  },
  {
    "title": "Israel says it will keep troops in Gaza, Lebanon and Syria indefinitely. What does that mean?",
    "description": "The acquisition of territory by force is universally seen as a violation of international law.",
    "link": "https://www.bostonherald.com/2025/04/16/israeli-expansion-explained/",
    "timestamp": "2025-04-16T17:15:33Z"
  },
  {
    "title": "Trump grants military control to federal border lands in unprecedented immigration crackdown",
    "description": "President Donald Trump issued a memorandum on April 11 ordering the U.S. military to take control of a swath of federal land along the southern border. The move is part of a series of actions by the White House to crack down on U.S.-Mexico border crossings wh…",
    "link": "https://biztoc.com/x/277158c2a791a8ea",
    "timestamp": "2025-04-16T17:15:30Z"
  },
  {
    "title": "Trump admin may be held in contempt over migrant flights",
    "description": "United States District Court for the District of Columbia Chief Judge James Boasberg ruled on Wednesday that \"probable cause exists\" to hold some officials from President Donald Trump's administration...",
    "link": "https://biztoc.com/x/a8832e65ad7ac3f5",
    "timestamp": "2025-04-16T17:15:21Z"
  },
  {
    "title": "Maryland Sen. Chris Van Hollen goes to El Salvador to push for Kilmar Abrego Garcia’s release",
    "description": "Van Hollen said he hopes to meet with Abrego Garcia and high-level officials.",
    "link": "https://www.denverpost.com/2025/04/16/chris-van-hollen-el-salvador/",
    "timestamp": "2025-04-16T17:15:08Z"
  },
  {
    "title": "Maryland Sen. Chris Van Hollen goes to El Salvador to push for Kilmar Abrego Garcia’s release",
    "description": "Van Hollen said he hopes to meet with Abrego Garcia and high-level officials.",
    "link": "https://www.bostonherald.com/2025/04/16/chris-van-hollen-el-salvador/",
    "timestamp": "2025-04-16T17:15:08Z"
  },
  {
    "title": "Chip stocks fall as Nvidia, AMD warn of higher costs from China export controls",
    "description": "Technology stocks declined Wednesday, led by a 7% drop in Nvidia, as the chipmaking sector signaled that President Donald Trump’s sweeping tariff plans could hamper demand and growth. Nvidia revealed in a filing Tuesday that it will take a $5.5 billion charge…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311392/posts",
    "timestamp": "2025-04-16T17:14:42Z"
  },
  {
    "title": "Trump Orders Probe of Critical Mineral Imports, Dominated by China",
    "description": "President Donald Trump on Tuesday directed Commerce Secretary Howard Lutnick to begin a national security probe of tariffs on critical U.S. imports, including rare earths and other vital substances.\nThe post Trump Orders Probe of Critical Mineral Imports, Dom…",
    "link": "https://www.breitbart.com/national-security/2025/04/16/trump-orders-probe-of-critical-mineral-imports-dominated-by-china/",
    "timestamp": "2025-04-16T17:14:08Z"
  },
  {
    "title": "US judge says he could hold Trump administration in contempt of court",
    "description": "A US judge has said he could hold the Trump administration in contempt of court for \"willful disregard\" of an order to halt the departure of deportation...",
    "link": "https://www.bbc.com/news/articles/c045qg9xr30o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-16T17:13:01Z"
  },
  {
    "title": "Trump Admin Refers Letitia James for Potential Prosecution over Alleged Mortgage Fraud",
    "description": "The Donald Trump administration on Tuesday referred New York Attorney General Letitia James, who had targeted Trump, for potential prosecution over alleged mortgage fraud.\nThe post Trump Admin Refers Letitia James for Potential Prosecution over Alleged Mortga…",
    "link": "https://www.breitbart.com/politics/2025/04/16/trump-admin-refers-letitia-james-potential-prosecution-alleged-mortgage-fraud/",
    "timestamp": "2025-04-16T17:12:49Z"
  },
  {
    "title": "TikTok tests letting users add informative ‘Footnotes’",
    "description": "TikTok on Wednesday said it is testing a feature that would let people add “Footnotes” providing informative context to videos that might be misleading. The feature being tested in the United States, where the short-form video sharing app has some 170 million…",
    "link": "https://www.digitaljournal.com/world/tiktok-tests-letting-users-add-informative-footnotes/article",
    "timestamp": "2025-04-16T17:12:33Z"
  },
  {
    "title": "TikTok Tests Letting Users Add Informative 'Footnotes'",
    "description": "TikTok on Wednesday said it is testing a feature that would let people add \"Footnotes\" providing informative context to videos that might be misleading.",
    "link": "https://www.ibtimes.com/tiktok-tests-letting-users-add-informative-footnotes-3770356",
    "timestamp": "2025-04-16T17:12:16Z"
  },
  {
    "title": "New 21% Tariff Will Make Fresh Tomatoes More Expensive",
    "description": "The International Trade Administration (ITA), an agency within the Commerce Department responsible for facilitating trade agreements, announced on April",
    "link": "https://reason.com/2025/04/16/new-21-tariff-will-make-fresh-tomatoes-more-expensive/",
    "timestamp": "2025-04-16T17:11:08Z"
  },
  {
    "title": "Israel says it will keep troops in Gaza, Lebanon and Syria indefinitely. What does that mean?",
    "description": "Israeli Defense Minister announced that its troops will indefinitely occupy \"security zones\" in Gaza, Lebanon, and Syria following expanded frontiers after the October 7th attack. These actions, deemed by some as military occupation, have drawn condemnation f…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-says-it-will-keep-troops-in-gaza-lebanon-and-syria-indefinitely-what-does-that-mean/articleshow/120353476.cms",
    "timestamp": "2025-04-16T17:11:04Z"
  },
  {
    "title": "Gavin Newsom Announces California Lawsuit Challenging Donald Trump’s Authority To Impose Tariffs",
    "description": "California Governor Gavin Newsom said that he has initiated a lawsuit against Donald Trump’s administration challenging the president’s authority to impose tariffs. On his podcast posted today, Newsom said that the lawsuit will assert “that Trump does not hav…",
    "link": "http://deadline.com/2025/04/newsom-california-trump-tariffs-1236370036/",
    "timestamp": "2025-04-16T17:10:36Z"
  },
  {
    "title": "Older Arizona voters are closely watching Trump’s tariffs — and their retirement accounts",
    "description": "How tariffs and the stock market shake out could affect the 2026 midterms.",
    "link": "https://www.bostonherald.com/2025/04/16/tariffs-retirees/",
    "timestamp": "2025-04-16T17:10:31Z"
  },
  {
    "title": "Judge to Launch Criminal Contempt Proceedings Into Trump Officials",
    "description": "A judge said Wednesday there is probable cause to hold Donald Trump’s administration in criminal contempt for refusing to turn around the El Salvador-bound planes carrying more than 200 Venezuelan immigrants last month. \r\nIn a 46-page ruling, U.S. District Ju…",
    "link": "https://newrepublic.com/post/194067/judge-launch-contempt-proceedings-trump-deportation",
    "timestamp": "2025-04-16T17:10:07Z"
  },
  {
    "title": "'White Lotus' actor Aimee Lou Wood thanks 'SNL' star for flowers after 'mean' sketch",
    "description": "Aimee Lou Wood posted a thank you message to \"Saturday Night Live\" star Sarah Sherman for sending flowers after Wood took offense to the show's \"White Lotus\" sketch.",
    "link": "https://www.today.com/popculture/aimee-lou-wood-snl-sarah-sherman-flowers-white-lotus-sketch-rcna201533",
    "timestamp": "2025-04-16T17:08:05Z"
  },
  {
    "title": "Americans are rushing to buy cars before Trump's tariffs kick in",
    "description": "In March, auto sales spiked as Americans were rushing to get ahead of tariffs. Car prices could jump.",
    "link": "https://www.businessinsider.com/trump-tariffs-consumers-buying-cars-retail-sales-price-increases-inventory-2025-4",
    "timestamp": "2025-04-16T17:07:59Z"
  },
  {
    "title": "Chinese Airlines Told to Halt Boeing Orders: What It Means for Both Sides",
    "description": "Chinese enthusiasm for Boeing aircraft has cooled in recent years, but be under no doubt – Boeing needs China and Chinese airlines still need U.S. planes. -Gordon Smith and Meghna Maharishi",
    "link": "http://skift.com/2025/04/16/chinese-airlines-told-to-halt-boeing-orders-what-it-means-for-both-sides/",
    "timestamp": "2025-04-16T17:07:47Z"
  },
  {
    "title": "Putin praises Elon Musk, compares him to father of Soviet space program",
    "description": "Vladimir Putin lauded Elon Musk, likening him to Sergei Korolev, the key figure behind the Soviet Union's space achievements. Putin highlighted Musk's passion for Mars, noting that such driven individuals, though their ideas may seem far-fetched, often realiz…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/putin-praises-elon-musk-compares-him-to-father-of-soviet-space-program/articleshow/120353401.cms",
    "timestamp": "2025-04-16T17:06:42Z"
  },
  {
    "title": "Islamic Jihad publishes video of Israeli hostage Rom Braslavski",
    "description": "In the first visual documentation of him since his capture, Braslavski addressed U.S. President Donald Trump, asking him, 'Where are you? Where are your promises? Didn't you tell us you would release everyone in a deal?'",
    "link": "https://www.haaretz.com/israel-news/2025-04-16/ty-article/.premium/islamic-jihad-publishes-video-of-israeli-hostage-rom-braslavski/00000196-3ef7-dc5b-af96-7ff773a00000",
    "timestamp": "2025-04-16T17:06:27Z"
  },
  {
    "title": "Former Texas Rep. Mayra Flores is recovering after hospitalization, campaign says",
    "description": "Former Republican U.S. Rep. Mayra Flores is recovering after being hospitalized",
    "link": "https://abcnews.go.com/US/wireStory/former-texas-rep-mayra-flores-recovering-after-hospitalization-120873271",
    "timestamp": "2025-04-16T17:05:37Z"
  },
  {
    "title": "Video Shows ICE Agents Smashing Car Window To Detain Migrant",
    "description": "A video has gone viral of two federal agents smashing in the window of a migrant's car with a slegehammer, despite his lawyer saying ICE have the wrong man.",
    "link": "https://www.newsweek.com/video-shows-ice-agents-smashing-car-window-detain-migrant-2060558",
    "timestamp": "2025-04-16T17:05:26Z"
  },
  {
    "title": "UK’s top court says definition of a woman is based on biological sex and excludes transgender people",
    "description": "Several women’s groups that supported the appeal celebrated outside court, hailing it as a win.",
    "link": "https://www.bostonherald.com/2025/04/16/britain-court-gender/",
    "timestamp": "2025-04-16T17:05:09Z"
  },
  {
    "title": "Trump grants military control to federal border lands in unprecedented immigration crackdown",
    "description": "The move could allow US troops to detain people crossing the border",
    "link": "https://theweek.com/politics/trump-military-control-border",
    "timestamp": "2025-04-16T17:05:05Z"
  },
  {
    "title": "5 controversies embroiling Harvard University as Trump seeks to cut funding",
    "description": "Harvard University in Massachusetts has been embroiled in controversies in recent years, from antisemitism on campus to a plagiarism scandal.",
    "link": "https://www.foxnews.com/us/5-controversies-embroiling-harvard-university-trump-seeks-cut-funding",
    "timestamp": "2025-04-16T17:04:45Z"
  },
  {
    "title": "Saturday, April 12 Evening Cable News Ratings: CNN Gets Real Boost From Bill Maher",
    "description": "In the demo, Real-Time had 5,000 fewer viewers than time slot winner Fox News' Life, Liberty & Levin, at 8 p.m. ET.",
    "link": "https://www.adweek.com/tvnewser/saturday-april-12-evening-cable-news-ratings-cnn-gets-real-boost-from-bill-maher/",
    "timestamp": "2025-04-16T17:04:34Z"
  },
  {
    "title": "India considering local value-addition criteria for auto parts exports to EU, UK, and US",
    "description": "India is considering imposing local value-addition conditions, up to 50%, on auto part exports to the EU, UK, and US. This move aims to prevent China from rerouting exports through India to avoid tariffs. While pursuing FTAs to boost exports, India focuses on…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-considering-local-value-addition-criteria-for-auto-parts-exports-to-eu-uk-and-us/articleshow/120353259.cms",
    "timestamp": "2025-04-16T17:04:12Z"
  },
  {
    "title": "California sues Trump administration over its tariffs",
    "description": "California is suing the Trump administration over its tariffs, accusing President Donald Trump of overstepping his authority in upending the global trade order and causing “immediate and irreparable harm” to California’s economy.",
    "link": "https://biztoc.com/x/1d247456e4bc1557",
    "timestamp": "2025-04-16T17:04:05Z"
  },
  {
    "title": "Resignations multiply at BigLaw firms that made deals with Trump",
    "description": "Associate Rachel Cohen may have been the first lawyer to resign from a law firm because she disagreed with its response to President Donald Trump’s punitive executive orders, but she isn’t the last.",
    "link": "https://www.abajournal.com/news/article/resignations-multiply-at-biglaw-firms-that-made-deals-with-trump",
    "timestamp": "2025-04-16T17:04:00Z"
  },
  {
    "title": "Decatur school board updates equity policies, mother removed from meeting",
    "description": "The City Schools of Decatur School Board voted to rescind or rewrite a total of five policies that showcased the district’s commitment to equity.",
    "link": "https://www.wsbtv.com/news/local/dekalb-county/decatur-school-board-updates-equity-policies-mother-removed-meeting/RFORQYLJBZCVFJ3C4LFEEWAFUA/",
    "timestamp": "2025-04-16T17:03:02Z"
  },
  {
    "title": "Nigeria's oil revenue at risk amid U.S. tariff policies: official",
    "description": "ABUJA, April 16 (Xinhua) -- Nigeria's crude oil earnings may be under threat as the aggressive trade tariff policies of the United States disrupt global markets, undermine investor confidence, and drive down prices, a senior Nigerian oil and gas official has …",
    "link": "https://www.thestar.com.my/news/world/2025/04/17/nigeria039s-oil-revenue-at-risk-amid-us-tariff-policies-official",
    "timestamp": "2025-04-16T17:03:00Z"
  },
  {
    "title": "Can Trump reshape the Middle East?",
    "description": "The US president’s first international trip this term will be to Saudi Arabia, Qatar and the UAE – three pillars of his foreign policy Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615838-trump-gulf-monarchies-middle-east/",
    "timestamp": "2025-04-16T17:01:59Z"
  },
  {
    "title": "Trans politician vows to take legal action against Trump's 'hatred' after being misgendered",
    "description": "Erika Hilton, a Black transgender congresswoman in Brazil, announced that she's taking legal action against Donald Trump as a result of being issued a U.S. visa with \"male\" as her gender marker — and she's also committed to taking the case to the United Natio…",
    "link": "https://www.out.com/politics/erika-hilton-trans-congresswoman-legal-action-donald-trump",
    "timestamp": "2025-04-16T17:01:26Z"
  },
  {
    "title": "In Rambling Speech, Biden Claims Trump Is Out to Gut Social Security",
    "description": "In his first major public appearance since departing the White House, former President Joe Biden, without evidence, accused the Trump administration of trying to deprive... Read More\nThe post In Rambling Speech, Biden Claims Trump Is Out to Gut Social Securit…",
    "link": "https://www.dailysignal.com/2025/04/16/biden-slams-trump-rare-public-appearance/",
    "timestamp": "2025-04-16T17:00:46Z"
  },
  {
    "title": "A Plea From a Member of the ‘51st State’",
    "description": "‘Canadians are not upset because it’s an ‘us-versus-them’ thing. It’s more like if your brother turned on you: We were there in battle together. Before there’s anger, you’re kind of sad about it. Did you forget about what we’ve done to support you?’",
    "link": "http://www.vulture.com/article/tom-green-canada-us-relations.html",
    "timestamp": "2025-04-16T17:00:38Z"
  },
  {
    "title": "Trump administration likely acted in contempt of court by not turning around deportation flights, judge says (Reuters)",
    "description": "Reuters:\nTrump administration likely acted in contempt of court by not turning around deportation flights, judge says  —  Judge James Boasberg had ordered the flights to be returned.  —  President Donald Trump meets with El Salvador President Nayib Bukele in …",
    "link": "https://www.memeorandum.com/250416/p73",
    "timestamp": "2025-04-16T17:00:33Z"
  },
  {
    "title": "‘That sounds like B.S.’: Tucker Carlson spills the beans on his firing from Fox News",
    "description": "Popular talk-show host also reveals 'shock' at Trump tariffs",
    "link": "https://www.wnd.com/2025/04/that-sounds-like-b-s-tucker-carlson-spills-the-beans-on-his-firing-from-fox-news/",
    "timestamp": "2025-04-16T17:00:05Z"
  },
  {
    "title": "BEAST: USA NO LONGER NATION OF LAWS...",
    "description": "Listen to this full episode of The New Abnormal on Apple Podcasts, Spotify, Amazon and Stitcher. The Trump administration’s reluctance to fix Kilmar Abrego...",
    "link": "https://www.thedailybeast.com/this-is-the-exact-moment-america-stopped-being-a-nation-of-laws/",
    "timestamp": "2025-04-16T17:00:03Z"
  },
  {
    "title": "Letters: Govt must address cost of living with actions not words; Rory McIlroy’s win a wonderful change",
    "description": "OPINION: Christchurch's new stadium is ironic with its cathedral still a ruin.",
    "link": "https://www.nzherald.co.nz/nz/letters-govt-must-address-cost-of-living-with-actions-not-words-rory-mcilroys-win-a-wonderful-change/SH7POYZM3BHKZEXUMT5JOP4DNI/",
    "timestamp": "2025-04-16T17:00:00Z"
  },
  {
    "title": "Tehran: Uranium Enrichment Is Up for Negotiation",
    "description": "Tehran is ready to ease US concerns over its nuclear activities but scrapping uranium enrichment is off the table, Foreign Minister Abbas Araqchi said as the two sides prepare for a second round of talks this weekend over Iran's nuclear program. Araqchi told …",
    "link": "https://oilprice.com/Geopolitics/International/Tehran-Uranium-Enrichment-Is-Up-for-Negotiation.html",
    "timestamp": "2025-04-16T17:00:00Z"
  },
  {
    "title": "Society Insider: Pete Evans and Nicola Robinson’s next moves; Matthew Horncastle’s first baby; Dame Pieter Stewart’s granddaughter’s NYC fashion scholarship",
    "description": "Plus, Dame Pieter Stewart’s granddaughter’s NYC fashion scholarship.",
    "link": "https://www.nzherald.co.nz/lifestyle/society-insider-pete-evans-and-nicola-robinsons-next-moves-matthew-horncastles-first-baby-dame-pieter-stewarts-granddaughters-nyc-fashion-scholarship/QJRUN6XEN5GXDBANGRULZGPTVA/",
    "timestamp": "2025-04-16T17:00:00Z"
  },
  {
    "title": "Judge finds probable cause to hold Trump administration in contempt for violating deportation order",
    "description": "The move by U.S. District Judge James E. Boasberg marks an escalation in a battle between the judicial and executives branches of government over a president’s powers to carry out key White House priorities.",
    "link": "https://www.pbs.org/newshour/politics/judge-finds-probable-cause-to-hold-trump-administration-in-contempt-for-violating-deportation-order",
    "timestamp": "2025-04-16T16:59:39Z"
  },
  {
    "title": "Washington Post thrashes Biden, Trump for 'reckless deficits' putting country in financial peril",
    "description": "The Washington Post editorial board criticized recent U.S. leaders, including President Donald Trump and former President Biden, for \"reckless deficits\" and policy.",
    "link": "https://www.foxnews.com/media/washington-post-thrashes-biden-trump-reckless-deficits-country-financial-peril",
    "timestamp": "2025-04-16T16:57:50Z"
  },
  {
    "title": "Tariff Uncertainty Is Stalling the Economy",
    "description": "Businesses are reporting fewer orders, lower inventories, less employment, and weaker expectations. The only thing going up: prices.",
    "link": "https://reason.com/2025/04/16/tariff-uncertainty-is-stalling-the-economy/",
    "timestamp": "2025-04-16T16:57:43Z"
  },
  {
    "title": "Global uncertainty will ‘certainly’ hit growth: World Bank president",
    "description": "The uncertainty kicked up by Donald Trump’s stop-start tariff rollout will undoubtedly hit growth, the president of the World Bank said Wednesday, ahead of next week’s semi-annual meeting of global financial leaders in Washington. “Uncertainty and volatility …",
    "link": "https://www.digitaljournal.com/business/global-uncertainty-will-certainly-hit-growth-world-bank-president/article",
    "timestamp": "2025-04-16T16:57:32Z"
  },
  {
    "title": "Global Uncertainty Will 'Certainly' Hit Growth: World Bank President",
    "description": "The uncertainty kicked up by Donald Trump's stop-start tariff rollout will undoubtedly hit growth, the president of the World Bank said Wednesday, ahead of next week's semi-annual meeting of global financial leaders in Washington.",
    "link": "https://www.ibtimes.com/global-uncertainty-will-certainly-hit-growth-world-bank-president-3770353",
    "timestamp": "2025-04-16T16:57:06Z"
  },
  {
    "title": "How Italy's Meloni May Save Europe From Trump Tariffs As All Others Fail",
    "description": "Currently the European Union has three months to convince Trump not to slap 20 per cent duties on all its exports to the United States, apart from the baseline 10 per cent tariff with another 25 per cent on steel, aluminium and autos.",
    "link": "https://www.ndtv.com/world-news/will-italys-giorgia-meloni-magic-work-on-donald-trump-as-tariffs-loom-over-europe-8181666",
    "timestamp": "2025-04-16T16:55:48Z"
  },
  {
    "title": "VW Brand Freezes US Prices Through May to Ease Tariff Concerns",
    "description": "Volkswagen AG’s namesake brand plans to keep prices flat in the US through next month, the latest automaker to try to keep customers coming to dealer lots after the Trump administration increased tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/vw-brand-freezes-us-prices-through-may-to-ease-tariff-concerns",
    "timestamp": "2025-04-16T16:55:38Z"
  },
  {
    "title": "ET Market Watch: Strong domestic cues lift markets; financials shine as Sensex jumps 300 Pts",
    "description": "The benchmark BSE Sensex closed at 77,044, up by 309.40 points, while the Nifty 50 index finished at 23,437.20, gaining 108.65 points. So, a solid day overall.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/etmarkets-podcast/et-market-watch-strong-domestic-cues-lift-markets-financials-shine-as-sensex-jumps-300-pts/podcast/120353188.cms",
    "timestamp": "2025-04-16T16:54:01Z"
  },
  {
    "title": "Judge finds ‘probable cause’ to hold Trump administration in criminal contempt over deportation flights",
    "description": "A US federal judge found \"probable cause\" to hold President Donald Trump's administration in contempt of court for violating his order last month halting deportations of Venezuelan migrants.",
    "link": "https://nypost.com/2025/04/16/us-news/judge-finds-probable-cause-to-hold-trump-administration-in-criminal-contempt-over-deportation-flights/",
    "timestamp": "2025-04-16T16:53:37Z"
  },
  {
    "title": "Biden slams Trump's Social Security cuts",
    "description": "What happened\nFormer President Joe Biden Tuesday criticized the Trump administration's \"damage and destruction\" to Social Security, telling a conference of disability advocates in Chicago that President Donald Trump and Elon Musk's DOGE crew have \"taken a hat…",
    "link": "https://biztoc.com/x/4c5aed3553aefd63",
    "timestamp": "2025-04-16T16:53:19Z"
  },
  {
    "title": "Manufacturing jobs are never coming back",
    "description": "Workers during steel production at an Indiana steel mill in 2018.﻿ | Scott Olson/Getty Images\n“Jobs and factories will come roaring back into our country,” President Donald Trump promised on “Liberation Day,” as he announced tariffs that have shocked global m…",
    "link": "https://biztoc.com/x/ddaa54495a6e9831",
    "timestamp": "2025-04-16T16:53:16Z"
  }
]