[
  {
    "title": "Mr. President: Hamas is not listening to your threats",
    "description": "The terrorists' brazen post-ceasefire crackdown on rivals and dissidents mocks Trump’s promise to disarm them and shows they believe that they’re not going anywhere. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416382",
    "timestamp": "2025-10-17T04:43:18Z"
  },
  {
    "title": "US shouldn’t ‘deplete’ Tomahawk arsenal for Ukraine – Trump",
    "description": "US President Donald Trump has said that the Pentagon should not deplete its own Tomahawk missile arsenal for the sake of Ukraine Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626582-trump-missiles-arsenal-ukraine/",
    "timestamp": "2025-10-17T04:42:28Z"
  },
  {
    "title": "Indo-American Society president CS Parameshwar congratulates Ambassador Gor, pledges cooperation to strengthen India-US ties",
    "description": "Newly appointed Indo-American Society president CS Parameshwar congratulated Ambassador Sergio Gor, pledging collaboration to strengthen India-US ties. The society aims to explore new partnerships in education, skill development, and cultural exchange, echoin…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/indo-american-society-president-cs-parameshwar-congratulates-ambassador-gor-pledges-cooperation-to-strengthen-india-us-ties/articleshow/124620231.cms",
    "timestamp": "2025-10-17T04:42:07Z"
  },
  {
    "title": "Dhanteras 2025: Do's and Don'ts during Dhanteras",
    "description": "Dhanteras 2025, also known as Dhantrayodashi, falls on October 18 and 19, marking the beginning of Diwali festivities. Celebrated with great fervor, Hindus worship Lord Kuber and Goddess Laxmi, buying new items like brooms and avoiding sharp objects. The day …",
    "link": "https://timesofindia.indiatimes.com/religion/festivals/dhanteras-2025-dos-and-donts-during-dhanteras/articleshow/124610533.cms",
    "timestamp": "2025-10-17T04:41:47Z"
  },
  {
    "title": "IFS officer will be new Protocol, FDI and Diaspora Affairs Secretary of Maharashtra",
    "description": "Rajesh Gawande, an Indian Foreign Service officer, has taken charge as the new Secretary for Protocol, Foreign Direct Investment, and Diaspora Affairs in Maharashtra. This marks the first time an IFS officer holds this combined role. Gawande's deputation from…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/ifs-officer-will-be-new-protocol-fdi-and-diaspora-affairs-secretary-of-maharashtra/articleshow/124620161.cms",
    "timestamp": "2025-10-17T04:39:55Z"
  },
  {
    "title": "Putin-Trump Meeting Expected 'Within Two Weeks or So' - US President",
    "description": "MOSCOW (Sputnik) - US President Donald Trump stated on Thursday that he expects a summit with Russian President Vladimir Putin to take place approximately within two weeks.",
    "link": "https://sputnikglobe.com/20251017/putin-trump-meeting-expected-within-two-weeks-or-so---us-president-1122975548.html",
    "timestamp": "2025-10-17T04:39:25Z"
  },
  {
    "title": "China’s property slump hits economy as trade tensions with US heighten",
    "description": "Four years in, the unprecedented drop in the value of their homes is a psychological as well as an economic shock to many",
    "link": "https://www.irishtimes.com/business/2025/10/17/chinas-property-slump-hits-economy-as-trade-tensions-with-us-heighten/",
    "timestamp": "2025-10-17T04:39:00Z"
  },
  {
    "title": "Bharti Singh gets emotional while shopping for her second baby, says, ‘Second baby ke aane ke baad Gola kaisa feel karega, pata nahi’",
    "description": "Comedian Bharti Singh, expecting her second child, shared an emotional vlog detailing her preparations. She expressed concern for her first son, Gola, about his feelings with a new sibling. Gola's sweet response showcased his acceptance, touching fans with Bh…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/bharti-singh-gets-emotional-while-shopping-for-her-second-baby-says-second-baby-ke-aane-ke-baad-gola-kaisa-feel-karega-pata-nahi/articleshow/124620287.cms",
    "timestamp": "2025-10-17T04:37:33Z"
  },
  {
    "title": "7 members of Vanchit Bahujan Aghadi (VBA) join Congress",
    "description": "Seven prominent members of Prakash Ambedkar's Vanchit Bahujan Aghadi (VBA) have defected to the Congress, securing key office-bearer positions in the city unit. The former VBA leaders cited disappointment with their roles in the VBA and expressed hope for gre…",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/7-members-of-vanchit-bahujan-aghadi-vba-join-congress/articleshow/124620242.cms",
    "timestamp": "2025-10-17T04:36:00Z"
  },
  {
    "title": "Daily Briefing: India’s Russian oil dilemma",
    "description": "In today's edition: Not-so-slick Trump; decks cleared for Adani’s Godda plant; Gujarat reshuffle likely today; can 2030 CWG boost Indian sports? and more",
    "link": "https://indianexpress.com/article/live-news/top-news-today-briefing-10311839/",
    "timestamp": "2025-10-17T04:32:56Z"
  },
  {
    "title": "Democrats say Trump needs to be involved in shutdown talks. He's shown little interest in doing so",
    "description": "Democrats are calling on President Donald Trump to get more involved with negotiations to end the government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-trump-involved-shutdown-talks-shown-interest-126604486",
    "timestamp": "2025-10-17T04:30:07Z"
  },
  {
    "title": "Democrats say Trump needs to be involved in shutdown talks. He's shown little interest in doing so",
    "description": "Democrats are calling on President Donald Trump to get more involved with negotiations to end the government shutdown",
    "link": "https://abcnews.go.com/US/wireStory/democrats-trump-involved-shutdown-talks-shown-interest-126604484",
    "timestamp": "2025-10-17T04:30:05Z"
  },
  {
    "title": "Donald Trump to meet Vladimir Putin in Budapest in new bid to end conflict",
    "description": "US president Donald Trump has said he will meet again with Russia’s Vladimir Putin in an effort to end the war in Ukraine.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-to-meet-vladimir-putin-in-budapest-in-new-bid-to-end-conflict/a544467407.html",
    "timestamp": "2025-10-17T04:30:00Z"
  },
  {
    "title": "Mark Keenan: Why Ireland needs to take a chainsaw to rent controls",
    "description": "Argentine President Javier Milei visited the White House this week to seek financial support from Donald Trump in order to fend off a run on the country’s peso currency as mid term elections loom in Argentina.",
    "link": "https://www.independent.ie/opinion/analysis/mark-keenan-why-ireland-needs-to-take-a-chainsaw-to-rent-controls/a1511365167.html",
    "timestamp": "2025-10-17T04:30:00Z"
  },
  {
    "title": "Who is John Bolton and why has he fallen out with Trump?",
    "description": "Donald Trump's former national security adviser has been charged with storing top secret records at home and sharing classified information. Here's what we know.",
    "link": "https://www.abc.net.au/news/2025-10-17/john-bolton-indictment-donald-trump/105902918",
    "timestamp": "2025-10-17T04:29:42Z"
  },
  {
    "title": "Video of Uhuru Kenyatta Crying after Raila Odinga’s Death Surfaces",
    "description": "A viral video captured former president Uhuru Kenyatta breaking down in tears while comforting Mama Ida after Raila Odinga’s death, moving many Kenyans online.",
    "link": "https://www.tuko.co.ke/people/606511-video-uhuru-kenyatta-crying-raila-odingas-death-surfaces/",
    "timestamp": "2025-10-17T04:27:42Z"
  },
  {
    "title": "Ahead of Zelenskyy meeting, Trump shows signs he might not be ready to send Kyiv Tomahawk missiles",
    "description": "President Trump is set to host Ukrainian President Zelenskyy amid stalled negotiations for long-range missile systems. Following a call with Russian President Putin, Trump signaled reluctance to sell the missiles, citing U.S. needs. Putin had warned such a sa…",
    "link": "https://economictimes.indiatimes.com/news/defence/ahead-of-zelenskyy-meeting-trump-shows-signs-he-might-not-be-ready-to-send-kyiv-tomahawk-missiles/articleshow/124620090.cms",
    "timestamp": "2025-10-17T04:26:26Z"
  },
  {
    "title": "What’s behind Pakistan’s latest crackdown on religious party TLP?",
    "description": "The far-right group, long known for blasphemy protests, is at risk of being banned by the Punjab government.",
    "link": "https://www.aljazeera.com/news/2025/10/17/whats-behind-pakistans-latest-crackdown-on-religious-party-tlp",
    "timestamp": "2025-10-17T04:26:20Z"
  },
  {
    "title": "Five key takeaways from the New York City mayoral debate",
    "description": "With a large lead in voter polls, Zohran Mamdani fended off attacks from Andrew Como over Gaza, policing and his resume.",
    "link": "https://www.aljazeera.com/news/2025/10/17/five-key-takeaways-from-the-new-york-city-mayoral-debate",
    "timestamp": "2025-10-17T04:22:50Z"
  },
  {
    "title": "A war on drugs or a war on terror? Trump's military pressure on Venezuela blurs the lines",
    "description": "Legal experts say U.S. strikes against alleged members of Latin American drug cartels are pushing the bounds of international law",
    "link": "https://abcnews.go.com/US/wireStory/war-drugs-war-terror-trumps-military-pressure-venezuela-126604302",
    "timestamp": "2025-10-17T04:22:03Z"
  },
  {
    "title": "Silicon Valley AI boom: Donald Trump’s policies create volatile environment for tech companies",
    "description": "Tech execs thought billion-dollar investments had bought them influence. Instead, they learnt that loyalty means nothing when the president sees political advantage elsewhere.",
    "link": "https://www.smh.com.au/technology/silicon-valley-s-trump-courtship-is-backfiring-spectacularly-20251014-p5n2a3.html",
    "timestamp": "2025-10-17T04:20:30Z"
  },
  {
    "title": "JB Pritzker Claims Trump Has 'Mental Health Issues' — And Hints an Insider Is Taking Full Advantage",
    "description": "Illinois Gov. JB Pritzker claims President Trump’s aides exploit his declining mental health and highlight Stephen Miller’s authoritarian influence.",
    "link": "https://www.inquisitr.com/jb-pritzker-claims-trump-has-mental-health-issues-and-hints-an-insider-is-taking-full-advantage",
    "timestamp": "2025-10-17T04:19:57Z"
  },
  {
    "title": "Japan PM hopeful Takaichi avoids war shrine visit amid political wrangle",
    "description": "TOKYO: The new head of Japan's ruling party Sanae Takaichi avoided visiting a controversial Tokyo war shrine on Friday (Oct 17), as political wrangling intensifies over her bid to become prime minister.Takaichi became Liberal",
    "link": "https://www.channelnewsasia.com/east-asia/japan-pm-hopeful-takaichi-avoids-war-shrine-visit-amid-political-wrangle-5408376",
    "timestamp": "2025-10-17T04:19:00Z"
  },
  {
    "title": "Japan PM Hopeful Avoids War Shrine Visit Amid Political Wrangle",
    "description": "The new head of Japan's ruling party Sanae Takaichi avoided visiting a controversial Tokyo war shrine on Friday, as political wrangling intensifies over her bid to become prime minister.",
    "link": "https://www.ibtimes.com/japan-pm-hopeful-avoids-war-shrine-visit-amid-political-wrangle-3787368",
    "timestamp": "2025-10-17T04:18:19Z"
  },
  {
    "title": "Japan PM hopeful avoids war shrine visit amid political wrangle",
    "description": "The new head of Japan’s ruling party Sanae Takaichi avoided visiting a controversial Tokyo war shrine on Friday, as political wrangling intensifies over her bid to become prime minister. Takaichi became Liberal Democratic Party (LDP) leader on October 4 but h…",
    "link": "https://www.digitaljournal.com/world/japan-pm-hopeful-avoids-war-shrine-visit-amid-political-wrangle/article",
    "timestamp": "2025-10-17T04:17:21Z"
  },
  {
    "title": "[Ilya Somin] US Chamber of Commerce Files Lawsuit Challenging Trump's $100,000 H-1B Visa Fee",
    "description": "NA Yesterday, the US Chamber of Commerce filed a lawsuit challenging Donald Trump's  imposition of a $100,000 fee on applications…",
    "link": "https://reason.com/volokh/2025/10/17/us-chamber-of-commerce-files-lawsuit-challenging-trumps-100000-h-1b-visa-fee/",
    "timestamp": "2025-10-17T04:16:19Z"
  },
  {
    "title": "Zelensky to make missile case in US after Trump-Putin phone call",
    "description": "Ukraine's leader will meet Trump in Washington a day after the US president agreed to face-to-face talks with his Russian counterpart.",
    "link": "https://www.bbc.com/news/articles/crmxz37nv3zo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-17T04:10:00Z"
  },
  {
    "title": "Banks in talks with US Treasury to lend $20 billion to Argentina, Semafor reports",
    "description": "() -Banks including JPMorgan, Bank of America, Goldman Sachs and Citigroup are in talks with the U. Treasury to provide up to $20 billion in loans to...",
    "link": "https://finance.yahoo.com/news/banks-talks-us-treasury-lend-040508870.html",
    "timestamp": "2025-10-17T04:05:08Z"
  },
  {
    "title": "Venezuela at the UN condemns latest US strike in Caribbean as people in Trinidad mourn",
    "description": "Venezuela’s ambassador to the U_N_ is condemning a recent U_S_ strike on a small boat in Caribbean waters that killed six people, calling it “a new set of extrajudicial executions.”",
    "link": "https://abcnews.go.com/International/wireStory/venezuela-condemns-latest-us-strike-caribbean-people-trinidad-126599095",
    "timestamp": "2025-10-17T04:03:53Z"
  },
  {
    "title": "Venezuela at the UN condemns latest US strike in Caribbean",
    "description": "Venezuela’s ambassador to the U_N_ is condemning a recent U_S_ strike on a small boat in Caribbean waters that killed six people, calling it “a new set of extrajudicial executions.”",
    "link": "https://abcnews.go.com/US/wireStory/venezuela-condemns-latest-us-strike-caribbean-people-trinidad-126599094",
    "timestamp": "2025-10-17T04:03:44Z"
  },
  {
    "title": "After Zelenskyy meeting, Trump calls on Ukraine and Russia to ‘stop where they are’ and end the war",
    "description": "President Donald Trump on Friday called on Kyiv and Moscow to “stop where they are” and end their brutal war following a lengthy White House meeting with...",
    "link": "https://www.yahoo.com/news/articles/ahead-zelenskyy-meeting-trump-shows-040304112.html",
    "timestamp": "2025-10-17T04:03:04Z"
  },
  {
    "title": "The Masks Have Come Off",
    "description": "If you believe what is written on those hats worn in the Israeli Knesset – “Trump the Peace President” – you are deluded beyond hope. Halloween may be coming, but you don’t need a frightening mask to realize the horrors that confront us. Trump is the culminat…",
    "link": "https://www.lewrockwell.com/2025/10/edward-curtin/the-masks-have-come-off/",
    "timestamp": "2025-10-17T04:01:00Z"
  },
  {
    "title": "Trump Must Say No to Tomahawks for Ukraine",
    "description": "As Ukraine’s President Volodymyr Zelensky heads to the White House this Friday, the debate over long-range missiles has become less about battlefield calculus and more about a high-stakes game of nuclear poker that risks core American security interests for a…",
    "link": "https://www.theamericanconservative.com/trump-must-say-no-to-tomahawks-for-ukraine/",
    "timestamp": "2025-10-17T04:01:00Z"
  },
  {
    "title": "Police State Bounty Hunters: The Rise of ICE’s Unconstitutional War on America",
    "description": "“Brother, I am American. You are twisting my arm.”— Man shouts “I am American” while ICE agents detain him Masked gunmen. Tasers. Tear gas. Pepper spray. Unmarked vehicles. Intimidation tactics. Brutality. Racial profiling. Children traumatized. Families terr…",
    "link": "https://www.lewrockwell.com/2025/10/no_author/police-state-bounty-hunters-the-rise-of-ices-unconstitutional-war-on-america/",
    "timestamp": "2025-10-17T04:01:00Z"
  },
  {
    "title": "An indecent proposal in California",
    "description": "In the 1993 film Indecent Proposal, a couple accepts a million dollars for a single night that destroys their marriage.  In November, voters in California will consider a constitutional amendment proposed by the Democrat Legislature in Sacr...",
    "link": "https://www.americanthinker.com/blog/2025/10/an_indecent_proposal_in_california.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "So is Trump the 'Fascist' that Leftists Keep Saying He is?",
    "description": "It seems that no political conversation in America is complete these days without somebody calling somebody a fascist, and if you are unlucky to be caught up in one of those discussions, you will no doubt hear one name shouted out louder than all the...",
    "link": "https://www.americanthinker.com/articles/2025/10/so_is_trump_the_fascist_that_leftists_keep_saying_he_is.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "University presidents aren’t Donald Trump",
    "description": "Former Secretary of Education, Senator and university president, Lamar Alexander, declared in the Wall Street Journal that “Donald Trump Isn’t a University President.”\r\n\r\nThe old-school political insider and prior university adminis...",
    "link": "https://www.americanthinker.com/blog/2025/10/university_presidents_aren_t_donald_trump.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "Here comes BO",
    "description": "As you've heard, there is a governor's race in Virginia. It looked like an easy victory for the Democrats a few weeks ago and then some texts surfaced and things changed. It's a lot more competitive and the Democrats are sending former Pr...",
    "link": "https://www.americanthinker.com/blog/2025/10/here_comes_bo.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "Decolonizing America from Sea to Shining Sea",
    "description": "It will take more than the physical reconstruction of Gaza to establish a lasting peace. The rebuilt schools and universities will have to teach cooperation and development rather than hatred and suicidal violence. Former Israeli hostage Tal Shoham r...",
    "link": "https://www.americanthinker.com/articles/2025/10/decolonizing_america_from_sea_to_sea.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "Why Putin won’t stop the war with Ukraine",
    "description": "Once again, President Donald Trump is going to meet with Putin to persuade him or buy his agreement to end the war with Ukraine. As a U.S. citizen and the author of forty books and a dozen films about Russia, I feel compelled to warn the White House ...",
    "link": "https://www.americanthinker.com/blog/2025/10/why_putin_won_t_stop_the_war_with_ukraine.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "America is Back: ICE Raids, Crushing Cartels, and Confronting Venezuela",
    "description": "(See also, “US jets buzzing Venezuela and Trump issues CIA lethal cover action order” by Monica Showalter.)\r\n\r\nIn the shadowy corridors of power, where Democrats have long peddled their illusions of a kinder, gentler America, the truth ha...",
    "link": "https://www.americanthinker.com/articles/2025/10/america_is_back_ice_raids_crushing_cartels_and_confronting_venezuela.html",
    "timestamp": "2025-10-17T04:00:00Z"
  },
  {
    "title": "The rich world faces a painful bout of inflation: Governments are living far beyond their means. Sadly, inflation is the most likely escape",
    "description": "Just about everywhere you look in the rich world, government finances are in ruins. France, as its debt mounts, is getting through prime ministers faster than Versailles went through wigs; on October 14th Sébastien Lecornu, the latest, proposed delaying an in…",
    "link": "https://freerepublic.com/focus/f-news/4346870/posts",
    "timestamp": "2025-10-17T03:59:25Z"
  },
  {
    "title": "Mamdani Torches Cuomo As ‘Trump’s Puppet’ At NYC Mayoral Debate",
    "description": "The two traded barbs as the election looms in November.",
    "link": "https://www.huffpost.com/entry/zohran-mamdani-andrew-cuomo-trump-debate_n_68f1af04e4b061265b2c62b1",
    "timestamp": "2025-10-17T03:56:30Z"
  },
  {
    "title": "Trump Refiles Defamation Lawsuit Against New York Times, Which Again Calls It Meritless and an Attempt to ‘Generate PR Attention’",
    "description": "Lawyers for President Donald Trump refiled a defamation lawsuit against the New York Times, with a complaint that is less than half as long as the previous one — after a judge spiked the president’s initial lawsuit for being “tedious and burdensome.” As befor…",
    "link": "https://variety.com/2025/biz/news/trump-refiles-new-york-times-defamation-lawsuit-15-billion-1236555179/",
    "timestamp": "2025-10-17T03:47:59Z"
  },
  {
    "title": "South Korean shares hit record high with US trade talks in focus",
    "description": "On Friday, South Korean stocks soared to unprecedented heights, driven primarily by the strong performance of battery manufacturers. Investor optimism surged following encouraging trade discussions between Seoul and Washington, pushing the KOSPI index to a re…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-record-high-with-us-trade-talks-in-focus/articleshow/124619548.cms",
    "timestamp": "2025-10-17T03:43:36Z"
  },
  {
    "title": "Moderator Presses Mamdani On Hochul Snub As He Fumbles Praise For Her Job",
    "description": "A moderator pressed Mamdani Thursday evening on his lack of endorsement for Democrat Gov. Kathy Hochul after he attempted to praise her job performance.",
    "link": "https://dailycaller.com/2025/10/16/moderator-presses-mamdani-kathy-hochul-snub-reelection-mayoral-debate-new-york-city-andrew-cuomo/",
    "timestamp": "2025-10-17T03:37:42Z"
  },
  {
    "title": "‘Please, don’t’: IMF warns nations against Trump-style tariffs",
    "description": "The IMF has urged nations not to impose “unhealthy” tariffs following Donald Trump’s new round of trade measures Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626578-imf-against-trump-tariffs/",
    "timestamp": "2025-10-17T03:31:59Z"
  },
  {
    "title": "The New York Times Hits Back After Trump Refiles $15 Billion Defamation Lawsuit: ‘Nothing Has Changed’",
    "description": "The lawsuit was initially rejected by a federal judge in September due to its length\nThe post The New York Times Hits Back After Trump Refiles $15 Billion Defamation Lawsuit: ‘Nothing Has Changed’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-new-york-times-trump-15-billion-defamation-lawsuit-refiled/",
    "timestamp": "2025-10-17T03:31:09Z"
  },
  {
    "title": "RFK Jr. Warns Teenagers Now Have Less Sperm Than 65-Year-Old Men",
    "description": "Secretary of Health Robert F. Kennedy Jr. said on Thursday that teenagers now have less sperm and testosterone than 65-year-old men.\nThe post RFK Jr. Warns Teenagers Now Have Less Sperm Than 65-Year-Old Men first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/rfk-jr-warns-teenagers-now-have-less-sperm-than-65-year-old-men/",
    "timestamp": "2025-10-17T03:21:39Z"
  },
  {
    "title": "Virginia AG candidates Jay Jones and Jason Miyares clash over incendiary texts",
    "description": "Virginia Republican Attorney General Jason Miyares and Democratic challenger Jay Jones squared off over a set of violent and incendiary text messages​ sent by Jones.",
    "link": "https://www.cbsnews.com/news/virginia-attorney-general-debate-jay-jones-jason-miyares-texts/",
    "timestamp": "2025-10-17T03:17:42Z"
  },
  {
    "title": "Navy Admiral and SouthCom Commander Alvin Holsey to retire after one year after rift with Hegseth for not acting ‘aggressively enough’ in Trump’s drug war in the Caribbean",
    "description": "Admiral Alvin Holsey, head of US Southern Command, is retiring after just one year in command. The announcement follows recent US military strikes against alleged drug cartels in the Caribbean and President Trump's authorization of CIA operations in Venezuela…",
    "link": "https://economictimes.indiatimes.com/news/international/us/navy-admiral-and-southcom-commander-alvin-holsey-to-retire-after-one-year-after-rift-with-hegseth-for-not-acting-aggressively-enough-in-trumps-drug-war-in-the-caribbean/articleshow/124619270.cms",
    "timestamp": "2025-10-17T03:16:03Z"
  },
  {
    "title": "China's rare earth restrictions aim to beat US at its own game",
    "description": "China has responded to U.S. chip restrictions by imposing its own rules on critical mineral exports, a move that could grant Beijing significant leverage over global supply chains. Analysts suggest China may be playing the U.S. playbook more effectively, pote…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/chinas-rare-earth-restrictions-aim-to-beat-us-at-its-own-game/articleshow/124619299.cms",
    "timestamp": "2025-10-17T03:12:53Z"
  },
  {
    "title": "The great London fog",
    "description": "Environmental priorities have become an issue of the left but denial of climate change is becoming mainstream now.",
    "link": "https://www.ncspin.com/the-great-london-fog",
    "timestamp": "2025-10-17T03:08:07Z"
  },
  {
    "title": "US outlines growth, deregulation, energy as priorities for G20 presidency, sources say",
    "description": "America will lead the G20 next year focusing on economic growth, deregulation, and energy. Treasury Secretary Scott Bessent outlined these priorities. The US will also promote investment in global critical minerals supply chains. Innovation and artificial int…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-outlines-growth-deregulation-energy-as-priorities-for-g20-presidency-sources-say/articleshow/124619206.cms",
    "timestamp": "2025-10-17T03:08:04Z"
  },
  {
    "title": "Survivors after latest US military strike on 'drug boat' - report",
    "description": "The Pentagon has labelled those it has been targeting as narcoterrorists and unlawful combatants who must be met with military force.",
    "link": "https://news.sky.com/story/survivors-reported-after-us-military-strike-on-boat-carrying-suspected-drug-traffickers-in-caribbean-13451439",
    "timestamp": "2025-10-17T03:07:00Z"
  },
  {
    "title": "Pritzker Claims Stephen Miller Is ‘Clearly Ordering People to Break the Law’ — Accountability Likely In Three Years",
    "description": "Illinois Governor JB Pritzker (D) made the case to MSNBC’s Jen Psaki on Thursday night that should a Democrat come to power after President Donald Trump, many of Trump’s top officials will likely be “held accountable” for “breaking the law.” Psaki asked Pritz…",
    "link": "https://www.mediaite.com/politics/pritzker-claims-stephen-miller-is-clearly-ordering-people-to-break-the-law-accountability-likely-in-three-years/",
    "timestamp": "2025-10-17T03:06:37Z"
  },
  {
    "title": "Pritzker: 'Donald Trump Has Diminished Capacity'",
    "description": "Thursday on MSNBC's 'The Briefing,\" Gov. JB Pritzker (D-IL) claimed that President Donald Trump has \"diminished capacity.\"\nThe post Pritzker: ‘Donald Trump Has Diminished Capacity’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/10/16/pritzker-donald-trump-has-diminished-capacity/",
    "timestamp": "2025-10-17T03:06:09Z"
  },
  {
    "title": "Trump: Air Force Cadet Chapel 'should be investigated'",
    "description": "United States President Donald Trump stated that the Air Force Academy's Cadet Chapel should be investigated, calling it a \"CONSTRUCTION DISASTER.\"In a post on Truth Social, Trump wrote that the chape...",
    "link": "https://biztoc.com/x/241b8e8507d74378",
    "timestamp": "2025-10-17T03:05:03Z"
  },
  {
    "title": "Trump says price of Ozempic will be lowered",
    "description": "President Donald Trump announced that the price of Novo Nordisk's popular weight-loss drug will be significantly reduced. Negotiations for price changes are expected to be rapid. The company has engaged in discussions with the administration regarding drug pr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-price-of-ozempic-will-be-lowered/articleshow/124619177.cms",
    "timestamp": "2025-10-17T03:04:49Z"
  },
  {
    "title": "Asian Stocks Fall With Wall St As US Credit Fears Add To Worries",
    "description": "Asian stocks tracked losses on Wall Street on Friday amid fresh credit market fears that compounded worries about trade tensions, a possible tech bubble and the US government shutdown.",
    "link": "https://www.ibtimes.com/asian-stocks-fall-wall-st-us-credit-fears-add-worries-3787365",
    "timestamp": "2025-10-17T02:57:06Z"
  },
  {
    "title": "Lessons from the shutdown",
    "description": "Trump has clearly shown that he has no respect for Republican Congressional Leadership, or that Congress is supposed to be a co-equal branch of government.",
    "link": "https://www.ncspin.com/lessons-from-the-shutdown",
    "timestamp": "2025-10-17T02:55:09Z"
  },
  {
    "title": "Trump warns Hamas 'we will have no choice but to go in and kill them' if bloodshed persists in Gaza",
    "description": "President Trump issued a stark warning to Hamas, threatening forceful action if internal bloodshed in Gaza continues. He later clarified that U.S. troops would not be deployed, suggesting \"people very close, very nearby\" would handle the situation under U.S. …",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-warns-hamas-we-will-have-no-choice-but-to-go-in-and-kill-them-if-bloodshed-persists-in-gaza/articleshow/124619027.cms",
    "timestamp": "2025-10-17T02:54:58Z"
  },
  {
    "title": "Andrew Cuomo Roasted During NYC Debate: Doesn’t Understand ‘What the Term No Is’",
    "description": "Former New York governor Andrew Cuomo was roasted by his opponents Curtis Sliwa and Zohran Mamdani during a New York City mayoral debate on Thursday.\nThe post Andrew Cuomo Roasted During NYC Debate: Doesn’t Understand ‘What the Term No Is’ first appeared on M…",
    "link": "https://www.mediaite.com/media/tv/andrew-cuomo-roasted-during-nyc-debate-doesnt-understand-what-the-term-no-is/",
    "timestamp": "2025-10-17T02:46:54Z"
  },
  {
    "title": "Jay Jones Says Miyares Can’t ‘Prosecute A Case Against Trump’ Even Though GOP Nominee Points Out Otherwise",
    "description": "Jones continued to claim that Miyares can't \"prosecute a case against Trump,\" even as Miyares pointed out he has had cases against the Trump and Biden admins.",
    "link": "https://dailycaller.com/2025/10/16/jay-jones-says-miyares-cant-prosecute-a-case-against-trump-even-though-gop-nominee-points-out-otherwise/",
    "timestamp": "2025-10-17T02:46:00Z"
  },
  {
    "title": "North Carolina GOP's proposed map seeks to thwart Democratic incumbent's reelection",
    "description": "Republican leaders in North Carolina have proposed a new U.S. House district map that could thwart reelection prospects of a Democratic incumbent in the state's only swing seat",
    "link": "https://abcnews.go.com/Politics/wireStory/north-carolina-gops-proposed-map-seeks-thwart-democratic-126598037",
    "timestamp": "2025-10-17T02:44:39Z"
  },
  {
    "title": "Five takeaways from Mamdani-Cuomo New York mayoral debate",
    "description": "The three leading candidates for New York City mayor took the stage in Manhattan to make a case to lead America's biggest city.",
    "link": "https://www.bbc.com/news/articles/cn8xlx53jn6o",
    "timestamp": "2025-10-17T02:43:13Z"
  },
  {
    "title": "Benioff slammed by longtime VC ally over call for troops in San Francisco",
    "description": "By Biz Carson and Felipe Marques\n(Bloomberg) — Venture capitalist Ron Conway is leaving the board of Salesforce Inc.’s philanthropic foundation after blasting Chief Executive Officer Marc Benioff for calling on President Donald Trump to send the National Guar…",
    "link": "https://biztoc.com/x/0f650680dc9fa493",
    "timestamp": "2025-10-17T02:42:32Z"
  },
  {
    "title": "China's Economic Growth Slowed To 4.8% In Third Quarter: AFP Poll",
    "description": "China's economy likely grew at its slowest pace in a year last quarter, according to an AFP survey, dragged down by lacklustre demand and a crisis in the crucial property sector, compounded by a trade war with the United States.",
    "link": "https://www.ibtimes.com/chinas-economic-growth-slowed-48-third-quarter-afp-poll-3787363",
    "timestamp": "2025-10-17T02:42:10Z"
  },
  {
    "title": "White House issues childish retort to reporter's query about next Trump-Putin summit",
    "description": "White House officials issued a childish retort on Thursday to a reporter's question about the location of the next summit between the American and Russian presidents.HuffPost reporter S.V. Date, the outlet's senior White House correspondent, asked aides why P…",
    "link": "https://www.rawstory.com/white-house-2674207229/",
    "timestamp": "2025-10-17T02:41:09Z"
  },
  {
    "title": "Virginia AG candidates Jay Jones, Jason Miyares clash over violent rhetoric",
    "description": "Republican Attorney General Jason Miyares and former Democratic Del",
    "link": "https://abcnews.go.com/Politics/wireStory/virginia-ag-candidates-jay-jones-jason-miyares-clash-126600896",
    "timestamp": "2025-10-17T02:40:39Z"
  },
  {
    "title": "Japan’s Opposition Party Leader Says Coalition Chance Is ’50-50′",
    "description": "The likelihood of the ruling Liberal Democratic Party forming a new coalition with opposition party Ishin is 50-50, the leader of the smaller party said Friday, as key talks continue ahead of a parliamentary vote on who will lead the nation.",
    "link": "https://financialpost.com/pmn/business-pmn/japans-opposition-party-leader-says-coalition-chance-is-50-50",
    "timestamp": "2025-10-17T02:39:13Z"
  },
  {
    "title": "China's economic growth slowed to 4.8% in third quarter: AFP poll",
    "description": "China's economy likely grew at its slowest pace in a year last quarter, according to an AFP survey, dragged down by lacklustre demand and a crisis in the...",
    "link": "https://finance.yahoo.com/news/chinas-economic-growth-slowed-4-023518818.html",
    "timestamp": "2025-10-17T02:35:18Z"
  },
  {
    "title": "US carries out new drug boat strike in Caribbean, as admiral resigns",
    "description": "The latest strike came a day after US President Trump confirmed he had authorised CIA operations in Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/10/17/us-carries-out-new-drug-boat-strike-as-admiral-announces-shock-resignation",
    "timestamp": "2025-10-17T02:33:43Z"
  },
  {
    "title": "Scott Bessent Says US Investment Boom 'Sustainable' Under Trump: 'The Only Thing Slowing Us Down...'",
    "description": "U.S. Treasury Secretary Scott Bessent credited the country’s investment boom to President Donald Trump‘s policies on Wednesday, and expressed optimism about ...",
    "link": "https://finance.yahoo.com/news/scott-bessent-says-us-investment-023111948.html",
    "timestamp": "2025-10-17T02:31:11Z"
  },
  {
    "title": "Ace Frehley, KISS lead guitarist, dies at 74",
    "description": "Ace Frehley, the original lead guitarist for the rock band KISS, has died. He was 74.Frehley reportedly suffered a brain bleed when he fell in his studio a couple weeks ago, according to TMZ. The family said he died \"peacefully surrounded by family in Morrist…",
    "link": "https://freerepublic.com/focus/f-chat/4346864/posts",
    "timestamp": "2025-10-17T02:28:45Z"
  },
  {
    "title": "Boston prepares for 'No Kings' rally as thousands expected to attend",
    "description": "Boston prepares for 'No Kings' rally as thousands expected to attendwcvb.com",
    "link": "https://www.wcvb.com/article/boston-no-kings-rally-preparations/69065194",
    "timestamp": "2025-10-17T02:28:29Z"
  },
  {
    "title": "Turns out one military commander doesn't want to follow unlawful orders to kill boaters in the Caribbean [News]",
    "description": "Turns out one military commander doesn't want to follow unlawful orders to kill boaters in the Caribbean",
    "link": "https://www.fark.com/comments/13847510/Turns-out-one-military-commander-doesnt-want-to-follow-unlawful-orders-to-kill-boaters-in-Caribbean",
    "timestamp": "2025-10-17T02:27:01Z"
  },
  {
    "title": "BL Morning report: October 17, 2025",
    "description": "Consumer durable makers see strong Diwali sales post-GST cuts, Trump claims Modi will halt Russian oil imports, Wipro reports modest growth.",
    "link": "https://www.thehindubusinessline.com/multimedia/audio/bl-morning-report-october-17-2025/article70172411.ece",
    "timestamp": "2025-10-17T02:25:00Z"
  },
  {
    "title": "US lawmaker says licensing deal for TikTok algorithm would raise serious concerns",
    "description": "WASHINGTON: The chair of the House Select Committee on China said on Thursday (Oct 16) that a licensing agreement for use of the TikTok algorithm, as part of a deal by China-based ByteDance t",
    "link": "https://www.channelnewsasia.com/world/us-tiktok-algorithm-licensing-deal-bytedance-serious-concerns-5407161",
    "timestamp": "2025-10-17T02:24:00Z"
  },
  {
    "title": "Homeland Security says Marine's father who was deported had faced domestic violence, assault charges",
    "description": "The Department of Homeland Security says the father of a Marine arrested by immigration authorities when visiting his pregnant daughter at Camp Pendleton has a criminal record that includes charges of domestic violence and aggravated assault with a dea...",
    "link": "https://abcnews.go.com/US/wireStory/homeland-security-marines-father-deported-faced-domestic-violence-126602492",
    "timestamp": "2025-10-17T02:22:00Z"
  },
  {
    "title": "Accelerating Authoritarian Dynamics: Assessment of Democratic Decline",
    "description": "Article URL: https://steadystate1.substack.com/p/accelerating-authoritarian-dynamics\nComments URL: https://news.ycombinator.com/item?id=45612748\nPoints: 12\n# Comments: 0",
    "link": "https://steadystate1.substack.com/p/accelerating-authoritarian-dynamics",
    "timestamp": "2025-10-17T02:17:38Z"
  },
  {
    "title": "Putin-Trump call a curveball for Zelensky ahead of White House meeting",
    "description": "The phone conversation, held while Zelensky was flying to Washington, stole a march on his big moment.",
    "link": "https://www.bbc.com/news/articles/cze63r34213o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-17T02:17:27Z"
  },
  {
    "title": "Trump plans to leave his mark on Washington by building a Paris-like arch near the Lincoln Memorial (Darlene Superville/Associated Press)",
    "description": "Darlene Superville / Associated Press:\nTrump plans to leave his mark on Washington by building a Paris-like arch near the Lincoln Memorial  —  Add AP News to Google Add AP News as your preferred source to see more of our stories on Google.  Share  —  Presiden…",
    "link": "https://www.memeorandum.com/251016/p168",
    "timestamp": "2025-10-17T02:15:01Z"
  },
  {
    "title": "North Carolina GOP's proposed map seeks to thwart Democratic incumbent's reelection",
    "description": "Republican leaders in North Carolina have proposed a new U.S. House district map that could thwart reelection prospects of a Democratic incumbent in the state's only swing seat",
    "link": "https://abcnews.go.com/US/wireStory/north-carolina-gops-proposed-map-seeks-thwart-democratic-126598036",
    "timestamp": "2025-10-17T02:13:38Z"
  },
  {
    "title": "Carmakers push to secure chips as China trade spat escalates",
    "description": "While Chinese leader Xi Jinping and U.S. President Donald Trump are to meet this month to hammer out a trade accord, both sides announced restrictions that have raised tensions.",
    "link": "https://biztoc.com/x/4144ce5c4c2a56ee",
    "timestamp": "2025-10-17T02:09:29Z"
  },
  {
    "title": "Putin-Trump call a curveball for Zelensky ahead of White House meeting",
    "description": "The phone conversation, held while Zelensky was flying to Washington, stole a march on his big moment.",
    "link": "https://www.bbc.com/news/articles/cze63r34213o",
    "timestamp": "2025-10-17T02:08:18Z"
  },
  {
    "title": "Erika Kirk shows TPUSA staff Charlie's Medal of Freedom: 'You guys are all part of the legacy'",
    "description": "Erika Kirk, now CEO of Turning Point USA, shares her late husband Charlie Kirk's Presidential Medal of Freedom with staff in an emotional office moment.",
    "link": "https://www.foxnews.com/politics/erika-kirk-shows-tpusa-staff-charlies-medal-freedom-you-guys-all-part-legacy",
    "timestamp": "2025-10-17T02:07:23Z"
  },
  {
    "title": "Carmakers push to secure chips as China trade spat escalates",
    "description": "While Chinese leader Xi Jinping and U.S. President Donald Trump are to meet this month to hammer out a trade accord, both sides announced restrictions that have raised tensions.",
    "link": "https://www.japantimes.co.jp/business/2025/10/17/carmakers-chips-china-trade/",
    "timestamp": "2025-10-17T02:07:00Z"
  },
  {
    "title": "'This Is The Caribbean, Peace And Love': Trinidadians On US Boat Strikes",
    "description": "Trinidad and Tobago was in shock Thursday over the reported deaths of two local men in a US strike on a suspected drug boat, the latest of Venezuela's neighbors to become sucked into Washington's pressure campaign.",
    "link": "https://www.ibtimes.com/this-caribbean-peace-love-trinidadians-us-boat-strikes-3787361",
    "timestamp": "2025-10-17T02:06:12Z"
  },
  {
    "title": "Dollar set for weekly slide as trade, shutdown concerns weigh",
    "description": "The dollar is on a downward trend, fueled by escalating global trade disputes and indicators of a sluggish U.S. economy. This shift bolsters the argument for the Federal Reserve to consider lowering interest rates. As a result, investors are gravitating towar…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-set-for-weekly-slide-as-trade-shutdown-concerns-weigh/articleshow/124618393.cms",
    "timestamp": "2025-10-17T02:05:58Z"
  },
  {
    "title": "Oil set for weekly loss as Trump-Putin summit looms",
    "description": "Oil prices are witnessing a dip, thanks to the alleviation of global energy supply anxieties. In a pivotal moment for international relations, President Donald Trump is preparing to sit down with President Vladimir Putin to deliberate on solutions for the Ukr…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-set-for-weekly-loss-as-trump-putin-summit-looms/articleshow/124618369.cms",
    "timestamp": "2025-10-17T02:02:28Z"
  },
  {
    "title": "Selmayr’s possible comeback raises prospect of major von der Leyen-Kallas turf war",
    "description": "One of the EU's most powerful men could be in line for a big job at the heart of the bloc's decision-making. Some officials are alarmed.",
    "link": "https://www.politico.eu/article/martin-selmayr-comeback-raises-prospect-major-ursula-von-der-leyen-kaja-kallas-turf-war/",
    "timestamp": "2025-10-17T02:02:00Z"
  },
  {
    "title": "As France burned, Macron was looking for his legacy",
    "description": "The French president's dogged determination to defend his achievements risks backfiring.",
    "link": "https://www.politico.eu/article/emmanuel-macron-france-legacy-crisis-egypt/",
    "timestamp": "2025-10-17T02:02:00Z"
  },
  {
    "title": "Democrats Enlist Obama to Endorse Abigail Spanberger in Virginia, an Obvious Sign of Desperation (VIDEO)",
    "description": "Democrats are worried about the governor race in Virginia.\nThe post Democrats Enlist Obama to Endorse Abigail Spanberger in Virginia, an Obvious Sign of Desperation (VIDEO) appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/10/democrats-enlist-obama-endorse-abigail-spanberger-virginia-obvious/",
    "timestamp": "2025-10-17T02:00:58Z"
  },
  {
    "title": "Gold extends record rally above $4,300, eyes best weekly gain since 2008",
    "description": "Gold has reached unprecedented heights, with rising tensions between the U.S. and China driving investors towards this safe haven. Anticipation of upcoming U.S. interest rate cuts adds more fuel to the fire, prompting a spike in demand. Simultaneously, silver…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-extends-record-rally-above-4300-eyes-best-weekly-gain-since-2008/articleshow/124618334.cms",
    "timestamp": "2025-10-17T01:58:34Z"
  },
  {
    "title": "Russian barrage causes blackouts in Ukraine as Zelenskyy seeks Trump's help",
    "description": "Russia has launched a heavy bombardment on Ukraine's energy facilities, using hundreds of drones and dozens of missiles",
    "link": "https://abcnews.go.com/International/wireStory/russian-barrage-causes-blackouts-ukraine-zelenskyy-seeks-trumps-126572365",
    "timestamp": "2025-10-17T01:57:23Z"
  }
]