[
  {
    "title": "What the tomato teaches us about free trade",
    "description": "The US Department of Commerce imposed a 21% tariff on most Mexican tomatoes, effective July 14. This action highlights the benefits of trade, providing Americans with year-round access to tomatoes and allowing countries to focus on their comparative advantage…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/what-the-tomato-teaches-us-about-free-trade/articleshow/120615963.cms",
    "timestamp": "2025-04-25T10:08:48Z"
  },
  {
    "title": "Europe and China Must Unite Against Trump’s Trade Assault",
    "description": "Europeans’ refusal to push back hard against US President Donald Trump’s tariffs has played into the US administration’s hands. EU leaders urgently need to devise a new strategy to isolate Trump, deter American aggression, and defend the multilateral system.",
    "link": "https://www.project-syndicate.org/commentary/european-countries-must-push-back-against-trump-tariffs-by-marcel-fratzscher-2025-04",
    "timestamp": "2025-04-25T10:06:28Z"
  },
  {
    "title": "China Says Wind And Solar Energy Capacity Exceeds Thermal For First Time",
    "description": "China's wind and solar energy capacity has surpassed that of mostly coal-powered thermal for the first time, the national energy body said Friday.",
    "link": "https://www.ibtimes.com/china-says-wind-solar-energy-capacity-exceeds-thermal-first-time-3771370",
    "timestamp": "2025-04-25T10:06:21Z"
  },
  {
    "title": "Trump sparks row with deep-sea mining order",
    "description": "The US president speeds up permits for a practice opposed by many countries and environmentalists.",
    "link": "https://www.bbc.com/news/articles/cx2v37z333lo",
    "timestamp": "2025-04-25T10:06:10Z"
  },
  {
    "title": "US shale patch slows down as oil prices sink",
    "description": "HOUSTON(Reuters) -Some small U.S. shale producers are putting the brakes on oil drilling as crude prices sink to multi-year lows and steep tariffs drive...",
    "link": "https://finance.yahoo.com/news/us-shale-patch-slows-down-100529912.html",
    "timestamp": "2025-04-25T10:05:29Z"
  },
  {
    "title": "ICE to spend up to $45 billion on contractors for immigrant detention, deportation",
    "description": "Private prison company CEO calls $45 billion detention expansion plans 'exciting' as President Trump ramps up deportations",
    "link": "https://www.usatoday.com/story/news/politics/2025/04/25/trump-contractors-ice-detentions-deportations/83250623007/",
    "timestamp": "2025-04-25T10:04:13Z"
  },
  {
    "title": "China says wind and solar energy capacity exceeds thermal for first time",
    "description": "China’s wind and solar energy capacity has surpassed that of mostly coal-powered thermal for the first time, the national energy body said Friday. China, the world’s largest emitter of greenhouse gases that drive climate change, has pledged to peak carbon emi…",
    "link": "https://www.digitaljournal.com/world/china-says-wind-and-solar-energy-capacity-exceeds-thermal-for-first-time/article",
    "timestamp": "2025-04-25T10:03:16Z"
  },
  {
    "title": "The Story Behind TIME’s Donald Trump 100 Days Cover",
    "description": "This was the fourth interview the U.S. President has done with TIME since clinching the Republican nomination for President last spring.",
    "link": "https://time.com/7280111/donald-trump-2025-interview-cover/",
    "timestamp": "2025-04-25T10:03:00Z"
  },
  {
    "title": "Fact-Checking What Donald Trump Said in His ‘100 Days’ Interview With TIME",
    "description": "U.S. President Donald Trump sat down with TIME ahead of the 100th day of his second term and made inaccurate statements. Here’s what they are.",
    "link": "https://time.com/7280129/donald-trump-fact-check-2025-interview/",
    "timestamp": "2025-04-25T10:02:00Z"
  },
  {
    "title": "Read the Full Transcript of Donald Trump’s ‘100 Days’ Interview With TIME",
    "description": "President Trump discussed his trade war and the economy, immigration, presidential power, and the situations in Ukraine and the Middle East.",
    "link": "https://time.com/7280114/donald-trump-2025-interview-transcript/",
    "timestamp": "2025-04-25T10:01:00Z"
  },
  {
    "title": "Corporate America is sounding the alarm on tariffs | CNN Business",
    "description": "Some of America’s biggest companies say President Donald Trump’s erratic trade policy is leading consumers to spend less, raising costs for their businesses and making it impossible to plan for the future.",
    "link": "https://www.cnn.com/2025/04/25/business/chipotle-pepsi-tariffs-business/index.html",
    "timestamp": "2025-04-25T10:00:52Z"
  },
  {
    "title": "Immigration Lawyer in US for 24 Years Told to Self-Deport",
    "description": "\"I am not deportable. But I do want everybody to know that these kinds of things are happening,\" Carlos Trujillo told KTVX.",
    "link": "https://www.newsweek.com/immigration-lawyer-us-self-deport-2064016",
    "timestamp": "2025-04-25T10:00:34Z"
  },
  {
    "title": "Why Trudeau's exit was the worst thing that ever happened to Pierre Poilievre",
    "description": "Conservatives worked hard to establish what they thought the election would be about: affordability. Then Donald Trump changed the ballot question",
    "link": "https://nationalpost.com/news/politics/federal_election/the-problem-solver-poilievre-battles-to-win-an-election-that-took-an-unexpected-turn",
    "timestamp": "2025-04-25T10:00:33Z"
  },
  {
    "title": "Arms Maker Saab Posts Record Sales As Europe Rearms",
    "description": "The company noted however that the uncertainties, including those over US President Donald Trump's tariffs scheme, also \"present challenges and make it difficult to predict the future\".",
    "link": "https://www.ibtimes.com/arms-maker-saab-posts-record-sales-europe-rearms-3771361",
    "timestamp": "2025-04-25T10:00:31Z"
  },
  {
    "title": "Rising Michigan senator urges Democrats to stop being 'weak and woke' and 'f---ing retake the flag'",
    "description": "Sen. Elissa Slotkin, D-Mich., criticized her own party as part of a series of speeches she plans to give to take on President Donald Trump and the Republicans.",
    "link": "https://www.foxnews.com/media/rising-michigan-senator-urges-democrats-stop-being-weak-woke-f-ing-retake-flag",
    "timestamp": "2025-04-25T10:00:19Z"
  },
  {
    "title": "When a Democrat says it, it's not a lie",
    "description": "A belated happy Earth Day (April 22) to anyone who gives a shit. If CNN's chief climate correspondent Bill Weir is right (he definitely isn't, but for the sake of argument), it could be the last one we'll ever get to celebrate. Even by the low standards of ma…",
    "link": "https://freebeacon.com/newsletters/when-a-democrat-says-it-its-not-a-lie/",
    "timestamp": "2025-04-25T10:00:19Z"
  },
  {
    "title": "As Trump Administration Considers Retreat on Tariffs, Will It Resort to Usual US Fallback Option?",
    "description": "Washington's focus on global chokepoints could see extra attention in wake of tariffs debacle.",
    "link": "https://www.nakedcapitalism.com/2025/04/as-trump-administration-considers-retreat-on-tariffs-will-it-resort-to-usual-us-fallback-option.html",
    "timestamp": "2025-04-25T10:00:17Z"
  },
  {
    "title": "Joe Oliver: Trudeau redux or Poilievre for real change?",
    "description": "Canada cannot afford four more years of Trudeau-style profligate progressivism that pursues net zero and produces zero growth. Read here",
    "link": "https://financialpost.com/opinion/joe-oliver-trudeau-or-poilievre",
    "timestamp": "2025-04-25T10:00:06Z"
  },
  {
    "title": "5 government moves hitting equity markets",
    "description": "Peter Hodson: This year has been a roller coaster ride of uncertainty, anathema to the stock market. But governments are not helping",
    "link": "https://financialpost.com/investing/5-government-moves-hitting-equity-markets",
    "timestamp": "2025-04-25T10:00:04Z"
  },
  {
    "title": "Terence Corcoran: A vote for Liberals is a vote for a net-zero-growth economy",
    "description": "Canada’s economy has been flatlining for more than 10 years, dragged down in part by high immigration, profligate government spending and increasing intervention",
    "link": "https://financialpost.com/opinion/terence-corcoran-liberals-net-zero-growth-economy",
    "timestamp": "2025-04-25T10:00:04Z"
  },
  {
    "title": "The Pete Hegseth Red Herring and the GOP's Foreign Policy Civil War | Opinion",
    "description": "President Trump himself is clear-eyed on matters pertaining to Iran.",
    "link": "https://www.newsweek.com/pete-hegseth-red-herring-gops-foreign-policy-civil-war-opinion-2063928",
    "timestamp": "2025-04-25T10:00:03Z"
  },
  {
    "title": "The Weekend That Defined Obama, Provoked Trump—and Changed History",
    "description": "A 48-hour period in 2011 may go down as the era's defining political moment, setting in motion events that are still unraveling today.",
    "link": "https://www.newsweek.com/obama-trump-white-house-correspondents-dinner-2011-roast-bin-laden-raid-2063833",
    "timestamp": "2025-04-25T10:00:02Z"
  },
  {
    "title": "No evidence Barron Trump was rejected from Harvard, Stanford, Columbia",
    "description": "The youngest son of U.S. President Donald Trump broke from his family's tradition when he decided to attend New York University.",
    "link": "https://www.snopes.com//news/2025/04/25/barron-trump-columbia-harvard-stanford/",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Trump’s Very Stable Genius Coin",
    "description": "Reporters Matt Sledge and Jessica Washington discuss Trump’s growing crypto empire as he deregulates the industry.\nThe post Trump’s Very Stable Genius Coin appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/25/briefing-podcast-trump-crypto-meme-coin/",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Don’t Be Fooled. Elon Musk Isn’t Going Anywhere.",
    "description": "Elon Musk is finally leaving Washington, or so we’re told. Speaking to panicked Tesla investors on Tuesday, the electric-car company’s CEO said the magic words that they—and countless millions across the country—have been wanting to hear for months. “Starting…",
    "link": "https://newrepublic.com/article/194391/elon-musk-leave-doge-politics-washington",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "The Conservative Lawyer Defending a Firm from Donald Trump",
    "description": "Ruth Marcus writes about Paul Clement, a conservative lawyer who is now fighting the Trump Administration's retaliation against prominent law firms.",
    "link": "https://www.newyorker.com/news/persons-of-interest/the-conservative-lawyer-defending-a-firm-from-donald-trump",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Trump’s Feud With the Federal Reserve Will Hit Your Pocketbook",
    "description": "President Donald Trump may have temporarily walked back his recent disparagement of Federal Reserve Chair Jerome Powell, but the damage was done: The president spooked stock market investors, caused the value of the dollar to plunge, worried economists the wo…",
    "link": "https://newrepublic.com/article/194385/powell-trump-beef-federal-reserve",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Trump's student loan plans are an anti-stimulus for a struggling economy",
    "description": "As President Donald Trump’s reckless tariff policies upend the global economy, the administration has debuted another terrible idea: calling in student loans.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-student-loans-repayment-economy-rcna202805",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Trump’s War on Immigrants Has Become an Attack on Us All",
    "description": "Mass deportations are difficult, and the White House knows it. President Donald Trump largely failed to carry out his far-reaching immigration enforcement plans during his first term. Some of his efforts were blocked by federal courts; others were undone by p…",
    "link": "https://newrepublic.com/article/194389/trump-war-immigrants-hitting-americans",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "Trump's narrative that he forced China to the table is nonsense",
    "description": "Trump said he would lower tariffs on China, but China's denies that there's been any trade talks. Trump doesn't want to admit he's worried about the markets.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-china-tariffs-roll-back-rcna202800",
    "timestamp": "2025-04-25T10:00:00Z"
  },
  {
    "title": "India's maritime fundamentals remain strong despite US tariffs, says Synergy Marine CEO",
    "description": "Synergy Marine Group CEO Jesper Kristensen anticipates short-term friction in India's maritime sector due to US reciprocal tariffs. However, he emphasizes India's strong fundamentals, including expanding port capacity and a skilled workforce, ensuring long-te…",
    "link": "https://economictimes.indiatimes.com/industry/transportation/shipping-/-transport/indias-maritime-fundamentals-remain-strong-despite-us-tariffs-says-synergy-marine-ceo/articleshow/120615688.cms",
    "timestamp": "2025-04-25T09:58:11Z"
  },
  {
    "title": "Movement of 7+ Year Old Bitcoins Surges 121% as BTC Soars",
    "description": "A massive wave of long-dormant Bitcoin is stirring, with on-chain data showing a 121% increase in the movement of BTC aged over 7 years in the first quarter of 2025.",
    "link": "https://zycrypto.com/movement-of-7-year-old-bitcoins-surges-121-as-btc-soars/",
    "timestamp": "2025-04-25T09:57:34Z"
  },
  {
    "title": "AmCham China president says pharma companies have reported tariff exemptions on China imports",
    "description": "SHANGHAI (Reuters) -The Beijing-based American Chamber of Commerce said on Friday that companies in the pharmaceutical sector had reported that they had been...",
    "link": "https://finance.yahoo.com/news/amcham-china-president-says-pharma-095706981.html",
    "timestamp": "2025-04-25T09:57:06Z"
  },
  {
    "title": "China has halted rare earth exports, can Australia step up?",
    "description": "Australia has proposed to create a strategic reserve of critical minerals.",
    "link": "https://www.bbc.com/news/articles/c86je4vyg36o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-04-25T09:55:56Z"
  },
  {
    "title": "Japan introduces urgent economic measures to ease pain from US tariffs",
    "description": "Package includes support for corporate financing, and subsidies for petrol prices and electricity bills.",
    "link": "https://www.aljazeera.com/news/2025/4/25/japan-pm-announces-urgent-economic-measures-to-ease-pain-from-us",
    "timestamp": "2025-04-25T09:55:22Z"
  },
  {
    "title": "UN agencies for food, refugees plan deep cuts as funding plummets, documents show",
    "description": "The UN agencies for food and refugees are planning deep cuts due to unprecedented funding shortfalls, with the",
    "link": "https://www.jpost.com/breaking-news/article-851521",
    "timestamp": "2025-04-25T09:52:36Z"
  },
  {
    "title": "Which European should face off against Trump and Putin?",
    "description": "Macron, Tuck, Costa: the runners and the riders for the job from hell",
    "link": "https://www.livemint.com/opinion/which-european-should-face-off-against-trump-and-putin-11745573460156.html",
    "timestamp": "2025-04-25T09:51:34Z"
  },
  {
    "title": "Arms maker Saab posts record sales as Europe rearms",
    "description": "Swedish defence group Saab on Friday reported soaring quarterly earnings and record sales as European countries beef up their defence capacities amid...",
    "link": "https://finance.yahoo.com/news/arms-maker-saab-posts-record-095118965.html",
    "timestamp": "2025-04-25T09:51:18Z"
  },
  {
    "title": "Trump memecoin team highlights $420 price for Dinner with the President, then it tripled",
    "description": "The Donald Trump memecoin project has clarified the rules of its newly launched competition, which gives holders a chance to attend a private dinner with the US president. On April 23, the team behind the TRUMP token announced that the top 220 holders would r…",
    "link": "https://cryptoslate.com/trump-memecoin-team-highlights-420-price-for-dinner-with-the-president-then-it-tripled/",
    "timestamp": "2025-04-25T09:51:08Z"
  },
  {
    "title": "Ukraine may have to cede land, Kyiv mayor admits, with Witkoff set to meet Putin",
    "description": "Kyiv Mayor Vitali Klitschko admitted Ukraine may have to cede territory to Moscow as Donald Trump's envoy Steve Witkoff heads to Moscow to meet Vladimir Putin.",
    "link": "https://www.nbcnews.com/world/ukraine/ukraine-war-russia-kyiv-klitschko-putin-trump-zelenskyy-peace-crimea-rcna202944",
    "timestamp": "2025-04-25T09:50:20Z"
  },
  {
    "title": "German senator brands Tesla a ‘Nazi car’",
    "description": "Social democrat Cansel Kiziltepe has linked a slump in the car maker’s sales to CEO Elon Musk’s “far-right positions” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616267-german-senator-tesla-nazi/",
    "timestamp": "2025-04-25T09:45:47Z"
  },
  {
    "title": "Musk ridicules Zelensky’s aid transparency claims",
    "description": "Elon Musk has found Vladimir Zelensky’s assertions regarding total transparency in US aid to Ukraine to be laughably absurd Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616266-musk-zelensky-aid-transparency/",
    "timestamp": "2025-04-25T09:43:57Z"
  },
  {
    "title": "Trump Executive Order Will Bar Decertifying Colleges Over DEI",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | April 23, 2025\nPresident Donald Trump will sign an executive order Wednesday prohibiting higher education accreditors from participating in unlawful diversity, equity, and inclusion discrimination, five sourc…",
    "link": "https://biztoc.com/x/66b82c2b51d73ad3",
    "timestamp": "2025-04-25T09:40:18Z"
  },
  {
    "title": "Global Trump Backlash to Be Tested as Canada and Australia Vote",
    "description": "Donald Trump’s Nov. 5 victory capped a bad year for incumbents as authoritarian populists gained ground across the globe in an unprecedented year of elections. Less than six months later, the tide seems to be turning.",
    "link": "https://financialpost.com/pmn/business-pmn/global-trump-backlash-to-be-tested-as-canada-and-australia-vote",
    "timestamp": "2025-04-25T09:38:07Z"
  },
  {
    "title": "Exclusive-Documents show differences over U.S. peace drive for Ukraine",
    "description": "LONDON (Reuters) - Ukrainian and European officials pushed back this week against some U.S. proposals on how to end Russia's war in Ukraine, making counterproposals on issues from territory to sanctions, according to the full texts of the proposals seen by Re…",
    "link": "https://www.thestar.com.my/news/world/2025/04/25/exclusive-documents-show-differences-over-us-peace-drive-for-ukraine",
    "timestamp": "2025-04-25T09:38:00Z"
  },
  {
    "title": "State Sen. April Weaver- Alabama's rural hospital crisis is a threat to health and our economy",
    "description": "Alabama’s rural hospitals are vanishing. This devastating crisis is unfolding in the heart of our state, jeopardizing not only the health of our people but the very foundation of rural communities. Since 2011, at least seven rural hospitals in Alabama have cl…",
    "link": "https://yellowhammernews.com/state-sen-april-weaver-alabamas-rural-hospital-crisis-is-a-threat-to-health-and-our-economy/",
    "timestamp": "2025-04-25T09:37:21Z"
  },
  {
    "title": "Reclaiming the Democratic Party for Working Families",
    "description": "Bruce Raynor\n\n\n\nA call to action.\r\n\n\r\n\n\nThe post Reclaiming the Democratic Party for Working Families appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/democratic-party-working-class-unions-populism/",
    "timestamp": "2025-04-25T09:30:00Z"
  },
  {
    "title": "Trump’s Unconstitutional, Presidential War Against Yemen",
    "description": "By Ted Galen Carpenter, Ron Paul Institute for Peace and Prosperity | April 22, 2025\nFor Americans who still think that Donald Trump is an advocate of realism and restraint in foreign policy, the events in Yemen should come as a rude awakening. Unfortunately,…",
    "link": "https://biztoc.com/x/d7f0dfe7b825ebde",
    "timestamp": "2025-04-25T09:29:34Z"
  },
  {
    "title": "Letitia James Denies Trump Official's 'Improper Political Retribution' Mortgage Fraud Claim, Calls DOJ Referral Hypocritical After $500 Million Verdict",
    "description": "New York Attorney General Letitia James is fighting back after a President Donald Trump administration official referred her to the Justice Department for alleged mortgage fraud. Her lawyer, Abbe Lowell, labelled the referral \"improper political retribution\" …",
    "link": "https://biztoc.com/x/d20968df3cdab425",
    "timestamp": "2025-04-25T09:29:23Z"
  },
  {
    "title": "Not feeling the trade war pain yet? Get ready | CNN Business",
    "description": "By now, anyone with even half an eye on the news has seen headlines about how the economy is suddenly in trouble because of President Donald Trump’s tariffs: Markets are swinging wildly, investors are panic-buying gold, bond yields are surging, and the dollar…",
    "link": "https://www.cnn.com/2025/04/25/business/trump-tariff-pain-customers-nightcap/index.html",
    "timestamp": "2025-04-25T09:28:36Z"
  },
  {
    "title": "Scope of Gazans fleeing the territory: 36 thousand have left so far to Hamas's dismay",
    "description": "Despite Hamas's efforts to prevent it, since the war began, over 36 thousand people have left the Gaza Strip, some through Israel to Jordan and other countries, others to Egypt.",
    "link": "https://www.israelnationalnews.com/news/407390",
    "timestamp": "2025-04-25T09:25:00Z"
  },
  {
    "title": "Elon Musk Shares 'Trump 2032' Hat Picture",
    "description": "Musk shared the image after Trump started selling hats indicating he might run for president in 2028.",
    "link": "https://www.newsweek.com/elon-musk-shares-trump-2032-hat-trump-2028-2064017",
    "timestamp": "2025-04-25T09:21:40Z"
  },
  {
    "title": "Ukraine’s spy chief vows revenge for Russian strike on Kyiv",
    "description": "The capital mourns after a murderous attack by Kremlin forces killed at least 12 people.",
    "link": "https://www.politico.eu/article/ukraines-spy-chief-budanov-vows-revenge-for-russian-strike-kyiv/",
    "timestamp": "2025-04-25T09:21:04Z"
  },
  {
    "title": "Quiz of The Week: 19 - 25 April",
    "description": "Have you been paying attention to The Week's news?",
    "link": "https://theweek.com/puzzles/quiz-of-the-week-19-25-april",
    "timestamp": "2025-04-25T09:20:46Z"
  },
  {
    "title": "China's top leaders pledge economic support as trade war rages",
    "description": "China's top leaders pledged Friday to step up support for the economy and oppose \"unilateral bullying\" in global trade, offering a veiled rebuke of hefty tariffs recently imposed by U.S. President Donald Trump.",
    "link": "https://www.hurriyetdailynews.com/chinas-top-leaders-pledge-economic-support-as-trade-war-rages-208467",
    "timestamp": "2025-04-25T09:20:07Z"
  },
  {
    "title": "Trump Signals Step Back On China Tariffs, Says They’ll ‘Come Down Substantially’",
    "description": "By Hailey Gomez, Daily Caller News Foundation | April 22, 2025\nPresident Donald Trump signaled Tuesday evening from the Oval Office that the U.S. will ease tariffs on China, saying they’ll “come down substantially” but won’t be eliminated entirely.\nOn April 2…",
    "link": "https://biztoc.com/x/594e603f22c625cf",
    "timestamp": "2025-04-25T09:18:26Z"
  },
  {
    "title": "Billy Ray Cyrus opens up about surprise Elizabeth Hurley romance",
    "description": "‘It's been a long time since I've been this happy,’ said country musician",
    "link": "https://www.the-independent.com/life-style/elizabeth-hurley-billy-ray-cyrus-b2739386.html",
    "timestamp": "2025-04-25T09:18:14Z"
  },
  {
    "title": "China grants some tariff exemptions for US imports as trade war bites",
    "description": "Sign of relief for foreign businesses comes as Donald Trump insists talks are under way to reduce levies",
    "link": "https://biztoc.com/x/1e519784760aa42a",
    "timestamp": "2025-04-25T09:18:04Z"
  },
  {
    "title": "FBI Analyst Who Resigned Over Kash Patel Announces Congressional Run",
    "description": "By Eireann Van Natta, Daily Caller News Foundation | April 22, 2025\nA former FBI analyst who resigned over FBI Director Kash Patel and President Donald Trump announced he was running for Congress on Tuesday. John Sullivan is challenging New York Republican Re…",
    "link": "https://biztoc.com/x/0287f7115a2e716a",
    "timestamp": "2025-04-25T09:17:59Z"
  },
  {
    "title": "Beijing accuses Washington of 'misleading the public' about trade talks",
    "description": "China's foreign ministry urged Washington on Friday to stop \"misleading the public\" on bilateral tariff negotiations, and said it wasn't familiar with...",
    "link": "https://www.yahoo.com/news/beijing-accuses-washington-misleading-public-091737438.html",
    "timestamp": "2025-04-25T09:17:37Z"
  },
  {
    "title": "This Week’s Most Popular Articles",
    "description": "BREAKING: 85-Million-Person Study Finds Increased Risks of Stroke, Heart Attack, Coronary Artery Disease, and Arrhythmia Following COVID-19 Vaccination Nicolas Hulscher, April 8, 2025 How Dimethyl Sulfoxide (DMSO) Naturally Eliminates Cancers A Midwestern Doc…",
    "link": "https://www.globalresearch.ca/this-weeks-most-popular-articles-175/5885348",
    "timestamp": "2025-04-25T09:17:08Z"
  },
  {
    "title": "Trump tariffs on UK goods unjustified - here's why",
    "description": "As Chancellor Rachel Reeves meets her counterpart, US treasury secretary Scott Bessent to discuss an \"economic agreement\" between the two countries, the latest trade figures confirm three realities that ought to shape negotiations.",
    "link": "https://news.sky.com/story/trump-trade-war-how-uk-figures-show-his-tariff-argument-doesnt-add-up-13355276",
    "timestamp": "2025-04-25T09:16:00Z"
  },
  {
    "title": "India could grow at 6.5% in FY26; falling crude prices to support growth: EY",
    "description": "EY forecasts India's economy could grow by 6.5% in the current fiscal year, driven by lower crude oil prices, which are expected to ease inflation and support growth despite global trade tensions. The report highlights four key factors: reduced exports, globa…",
    "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-could-grow-at-6-5-in-fy26-falling-crude-prices-to-support-growth-ey/articleshow/120614193.cms",
    "timestamp": "2025-04-25T09:14:38Z"
  },
  {
    "title": "Sky-high US tariffs to hit Boeing, Chinese airliners and China's home-grown jets",
    "description": "In the midst of trade upheaval, Boeing's customers in China have \"indicated that they will not take delivery\" on up to 50 planes that were earmarked for the Chinese market this year, according to the US aerospace giant's CEO.",
    "link": "https://www.bangkokpost.com/business/general/3011320/sky-high-us-tariffs-to-hit-boeing-chinese-airliners-and-chinas-home-grown-jets",
    "timestamp": "2025-04-25T09:13:00Z"
  },
  {
    "title": "Battle for Victoria pits national trends against local dynamics",
    "description": "The battle for Victoria in this federal election could end with the NDP losing its seat for the first time in nearly 20 years, reflecting an expected outcome of the election in microcosm.",
    "link": "https://www.nationalobserver.com/2025/04/25/analysis/victoria-election-2025-liberals-ndp",
    "timestamp": "2025-04-25T09:09:06Z"
  },
  {
    "title": "Gambling our future over the climate crisis",
    "description": "We need to realize that the chance of winning anything in the climate denial game with far-right-wing governments is vanishingly small.",
    "link": "https://www.nationalobserver.com/2025/04/25/opinion/climate-crisis-gambling-election-2025",
    "timestamp": "2025-04-25T09:09:06Z"
  },
  {
    "title": "Selected Articles: Trump’s ‘Golden Dome’ – Another SDI or Irrevocable Militarization of Space?",
    "description": "Trump’s ‘Golden Dome’ – Another SDI or Irrevocable Militarization of Space?\nBy Drago Bosnic, April 24, 2025\nDuring the (First) Cold War, the Reagan administration launched the much-touted SDI (Strategic Defense Initiative) program, now better known under its …",
    "link": "https://www.globalresearch.ca/selected-articles-trump-golden-dome-sdi-irrevocable-militarization-space/5885345",
    "timestamp": "2025-04-25T09:08:53Z"
  },
  {
    "title": "Ukraine says Russia kills 3 in another drone attack after Trump rebukes Putin",
    "description": "Officials say a Russian drone has struck an apartment building in a southeastern Ukraine city, killing three people and injuring 10 others",
    "link": "https://abcnews.go.com/International/wireStory/ukraine-russia-kills-3-drone-attack-after-trump-121151741",
    "timestamp": "2025-04-25T09:06:21Z"
  },
  {
    "title": "China, Hong Kong stocks register second week of gains on tariff relief",
    "description": "China and Hong Kong stocks edged up on Friday, registering their second consecutive weekly gains, as the U.S. and China both softened their attitudes towards a full-on trade war to investors' relief.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-hong-kong-stocks-register-second-week-of-gains-on-tariff-relief/articleshow/120614022.cms",
    "timestamp": "2025-04-25T09:05:57Z"
  },
  {
    "title": "Everyone talking about Dendias’ defense equipment, PASOK remembers Pachta (Oh my god), support for Kostis, and the Cosmote wedding",
    "description": "Protests in PASOK over Ch. Pachtas Mitsotakis Meets with Entrepreneurs for Defense Support for Kostis The Gathering with Adonis Interest Rate Cuts Worry Banks The Cosmote Wedding and Telekom Arena Here is the translation of the text you provided: Ford’s “No” …",
    "link": "https://en.protothema.gr/2025/04/25/everyone-talking-about-dendias-defense-equipment-pasok-remembers-pachta-oh-my-god-support-for-kostis-and-the-cosmote-wedding/",
    "timestamp": "2025-04-25T09:01:41Z"
  },
  {
    "title": "King Dollar’s Shaky Crown",
    "description": "For decades, the US dollar’s status as the world’s only true international currency relied on the Fed’s independence and credibility. Two new books reveal how the dollar’s dominance underpinned America’s economic and geopolitical power and highlight the threa…",
    "link": "https://www.project-syndicate.org/onpoint/us-dollar-on-edge-by-maurice-obstfeld-2025-04",
    "timestamp": "2025-04-25T09:01:06Z"
  },
  {
    "title": "At G20 in Washington, top Chinese officials slam trade war as talks remain elusive",
    "description": "Central bank governor and finance minister address G20 ministers but conclude trip without official dialogue with US counterparts Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/04/25/at-g20-in-washington-top-chinese-officials-slam-trade-war-as-talks-remain-elusive",
    "timestamp": "2025-04-25T09:01:00Z"
  },
  {
    "title": "Trump Wants to Execute People Again — Starting With Luigi Mangione",
    "description": "Trump executed more people in a single term than any president since the 1890s. Now he wants to put Luigi Mangione on death row.",
    "link": "http://nymag.com/intelligencer/article/trump-death-penalty-luigi-mangione.html",
    "timestamp": "2025-04-25T09:00:30Z"
  },
  {
    "title": "The president and his enemies",
    "description": "President Donald Trump is attacking his enemies in ways that exceed Richard Nixon's infamous \"enemies list.\"",
    "link": "https://www.foxnews.com/opinion/president-his-enemies",
    "timestamp": "2025-04-25T09:00:08Z"
  },
  {
    "title": "Bernie Sanders-Endorsed Abdul El-Sayed Sees 'Opportunity' With Young Men",
    "description": "\"We have an epidemic right now of feeling like you don't belong,\" the Michigan U.S. Senate candidate told Newsweek.",
    "link": "https://www.newsweek.com/bernie-sanders-endorsed-abdul-el-sayed-sees-opportunity-young-men-2063878",
    "timestamp": "2025-04-25T09:00:03Z"
  },
  {
    "title": "Mark Carney's Chances of Winning a Landslide in Canada Election: Polls",
    "description": "Polls suggest that the Liberal Party is likely to fall short of a landslide victory.",
    "link": "https://www.newsweek.com/mark-carney-landslide-victory-chances-polls-canada-2063717",
    "timestamp": "2025-04-25T09:00:02Z"
  },
  {
    "title": "Trump Shreds the Constitution to Better Hound Immigrants and Eviscerate Universities",
    "description": "Sasha Abramsky\n\n\n\nIn his first three months in office, Trump’s ire has been particularly ferocious on two policy areas: immigration and higher education.\r\n\n\r\n\n\nThe post Trump Shreds the Constitution to Better Hound Immigrants and Eviscerate Universities appea…",
    "link": "https://www.thenation.com/?post_type=article&p=552763",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Why Trump Will Blink First on China",
    "description": "The U.S. President signalled a shift when he said that tariffs will have to \"come down substantially,\" writes Ryan Hass.",
    "link": "https://time.com/7279900/trump-xi-us-china-trade-war/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Appeasement Won’t Stop Putin",
    "description": "I’ve seen firsthand that acceding to Russia doesn’t end wars—it moves them.",
    "link": "https://www.theatlantic.com/international/archive/2025/04/putin-russia-ukraine-trump/682596/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Trump’s Surprise Admission about Putin Wrecks “Great Dealmaker” Scam",
    "description": "President Donald Trump just made some bizarre new public statements about the Russia-Ukraine war. At one point, he seemed to get angry at Vladimir Putin over a massive new Russian attack on Ukraine, calling on Putin to “STOP!” But then, asked by a reporter wh…",
    "link": "https://newrepublic.com/article/194392/trump-surprise-admission-putin-wrecks-great-dealmaker-scam",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Budget Reconciliation Could Be the Beginning of the End of the Republican Party",
    "description": "Prioritizing extreme deficit reduction is forcing Republicans to take positions that threaten the bonds of their coalition. \nThe post Budget Reconciliation Could Be the Beginning of the End of the Republican Party appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/04/25/budget-reconciliation-could-be-the-beginning-of-the-end-of-the-republican-party/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Trump Is Scaring Donors Away From Progressive Nonprofits",
    "description": "Fearing retribution from Trump, major donors to progressive organizations are holding back at a time when they need it most.\nThe post Trump Is Scaring Donors Away From Progressive Nonprofits appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/25/trump-nonprofits-philanthropy-donors/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "What ‘Fertilization President’ Trump Can Learn From State Efforts To Expand IVF Access",
    "description": "State-level efforts to regulate fertility coverage reveal the gauntlet of budgetary and political hurdles such initiatives face — obstacles that have led to millions of people being left out even when mandates become law.",
    "link": "https://kffhealthnews.org/news/article/fertility-infertility-insurance-coverage-mandates-state-bills-trump/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "How Reproductive Freedom Advocates Outsmarted the Anti-Abortion Movement",
    "description": "Since the reversal of Roe v. Wade, the number of abortions is up because of telehealth and the free sharing of mifepristone and misoprostol. \nThe post How Reproductive Freedom Advocates Outsmarted the Anti-Abortion Movement appeared first on Washington Monthl…",
    "link": "http://washingtonmonthly.com/2025/04/25/how-reproductive-freedom-advocates-outsmarted-the-anti-abortion-movement/",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "A “60 Minutes” Resignation Highlights the Corporate Media’s Surrender to Trump",
    "description": "Jeet Heer\n\n\n\nThe latest press scandal shows how plutocracy props up authoritarianism.\r\n\n\r\n\n\nThe post A “60 Minutes” Resignation Highlights the Corporate Media’s Surrender to Trump appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=552816",
    "timestamp": "2025-04-25T09:00:00Z"
  },
  {
    "title": "Product shortages and empty store shelves loom with falling shipments from China",
    "description": "Retailers are warning that U.S. consumers could once again be faced with empty store shelves and the kind of supply chain snarls that marked the Covid era if President Donald Trump's tariffs on China remain at their current levels.",
    "link": "https://www.nbcnews.com/politics/economics/product-shortages-empty-store-shelves-loom-falling-shipments-china-rcna202812",
    "timestamp": "2025-04-25T09:00:00Z"
  }
]