[
  {
    "title": "'Alligator Alcatraz': Judge orders closure of Trump's migrant detention centre",
    "description": "The order gave the Trump administration 60 days to wind down operations at the site, with no new detainees allowed.",
    "link": "https://www.bbc.com/news/articles/c5y3lwze2njo",
    "timestamp": "2025-08-22T04:43:09Z"
  },
  {
    "title": "China's Xi to host Putin, U.N. head Guterres at regional summit",
    "description": "Chinese President Xi Jinping will host Russia's Vladimir Putin, U.N. chief Antonio Guterres and more than 20 heads of government later this month, Beijing said on Friday, for a political and security meet aimed at cementing China's regional influence. Leaders…",
    "link": "https://japantoday.com/category/world/china%27s-xi-to-host-putin-un%27s-guterres-at-regional-summit",
    "timestamp": "2025-08-22T04:42:27Z"
  },
  {
    "title": "Florida must stop expanding 'Alligator Alcatraz' immigration center, judge says",
    "description": "A federal judge issued a preliminary injunction Thursday halting further expansion and ordering the winding down of an immigration detention center built in the middle of the Florida Everglades.",
    "link": "https://www.npr.org/2025/08/22/nx-s1-5510620/florida-alligator-alcatraz-immigration-ruling",
    "timestamp": "2025-08-22T04:39:18Z"
  },
  {
    "title": "Markets pause after six-day rally as Trump tariff concerns weigh",
    "description": "BEL, Bajaj Finance, and Jio Financial Services gained, while IT stocks like HCL Tech and consumer names such as Asian Paints and Grasim dragged indices lower.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/markets-pause-after-six-day-rally-as-trump-tariff-concerns-weigh/article69963335.ece",
    "timestamp": "2025-08-22T04:35:25Z"
  },
  {
    "title": "Trump Tariffs Are Shifting The 'Cost Of Taxes' From The Rich To The 'Rest Of America,' Says Ross Gerber",
    "description": "President Donald Trump’s trade and tariff policies in recent months are essentially a tax on American citizens, according to Ross Gerber, the CEO of Gerber Kawasaki Wealth and Investment Management.\nTariffs Have Raised Taxes\nOn Thursday, in a post on X, Gerbe…",
    "link": "https://biztoc.com/x/3adc5325c1dfb6d6",
    "timestamp": "2025-08-22T04:33:44Z"
  },
  {
    "title": "Fred Mednick: The tarnished peace prize that Donald Trump craves so badly",
    "description": "As the joke goes, Donald Trump is the kind of guy who’d kill for the Nobel Peace Prize.",
    "link": "https://www.independent.ie/opinion/comment/fred-mednick-the-tarnished-peace-prize-that-donald-trump-craves-so-badly/a1242546151.html",
    "timestamp": "2025-08-22T04:30:00Z"
  },
  {
    "title": "An Post maintains US parcel service despite red-tape uncertainty",
    "description": "An Post has said it is committed in continuing to send parcels to the US even as a number of EU postal services suspend deliveries amid uncertainty over tariffs and red tape.",
    "link": "https://www.independent.ie/business/an-post-maintains-us-parcel-service-despite-red-tape-uncertainty/a1356431836.html",
    "timestamp": "2025-08-22T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s view: Mass killing likely to intensify with Israel’s unconscionable plan",
    "description": "Where do you go when there’s no- where to run? That’s the question hundreds of thousands of desperate Palestinians must try to find an answer to as Israeli soldiers encircle Gaza City. Israeli prime minister Benjamin ­Netanyahu has ignored overtures for a cea…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-mass-killing-likely-to-intensify-with-israels-unconscionable-plan/a82578960.html",
    "timestamp": "2025-08-22T04:30:00Z"
  },
  {
    "title": "US court throws out multi-million dollar civil fraud penalty against Donald Trump",
    "description": "A US appeals court has thrown out the massive civil fraud penalty against US president Donald Trump, ruling yesterday in New York state’s lawsuit accusing him of exaggerating his wealth.",
    "link": "https://www.independent.ie/business/world/us-court-throws-out-multi-million-dollar-civil-fraud-penalty-against-donald-trump/a1277833992.html",
    "timestamp": "2025-08-22T04:30:00Z"
  },
  {
    "title": "Florida Federal Judge Orders “Alligator Alcatraz” to Close for Environmental Reasons",
    "description": "Trump, Kristi Noem, and Florida Governor Ron DeSantis have had a good time opening up and celebrating an immigrant detention facility that they call “Alligator Alcatraz.” They boast that immigrants who try to escape will be killed by alligators or snakes in t…",
    "link": "https://dianeravitch.net/2025/08/22/florida-federal-judge-orders-alligator-alcatraz-to-close-for-environmental-reasons/",
    "timestamp": "2025-08-22T04:30:00Z"
  },
  {
    "title": "'South Park' continues Trump JABS, takes aim at D.C. takeover",
    "description": "\"It's funny, except it's not, and it's satire, except it's increasingly close to the way Donald Trump insists on deploying federal troops ...",
    "link": "https://biztoc.com/x/649fd193a2f167f0",
    "timestamp": "2025-08-22T04:24:48Z"
  },
  {
    "title": "News Today Live Updates, 22 August | SC decision on pleas seeking stay on stray dog order likely today; Punjabi actor Jaswinder Bhalla’s death; and more",
    "description": "Latest News Live Updates |  Trump administration said it’s reviewing all the more than 55 million people with US visas for potential deportable violations.",
    "link": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-08-22-2025-news-headlines-10203970/",
    "timestamp": "2025-08-22T04:22:33Z"
  },
  {
    "title": "Trump embraces tough-on-crime mantra amid DC takeover as he and Democrats claim political wins",
    "description": "President Donald Trump is proudly promoting the work of roughly 2,000 National Guard troops in Washington to confront what the Republican president describes as an out-of-control crime wave in the Democratic-run city",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-embraces-tough-crime-mantra-amid-dc-takeover-124869786",
    "timestamp": "2025-08-22T04:21:51Z"
  },
  {
    "title": "Trump embraces tough-on-crime mantra amid DC takeover as he and Democrats claim political wins",
    "description": "President Trump dispatched National Guard troops to Washington, D.C., citing an out-of-control crime wave, despite statistics indicating a decline in violent crime. This move, praised by Republicans, is viewed by Democrats as a political stunt. Critics, like …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-embraces-tough-on-crime-mantra-amid-dc-takeover-as-he-and-democrats-claim-political-wins/articleshow/123445480.cms",
    "timestamp": "2025-08-22T04:18:29Z"
  },
  {
    "title": "Top CIA analyst behind Russiagate loses her job – Economist",
    "description": "A senior CIA analyst who played a major role in Russiagate has reportedly been fired Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623395-cia-russiagate-fired-intel/",
    "timestamp": "2025-08-22T04:15:37Z"
  },
  {
    "title": "In huge win for Trump, court throws out half-billion-dollar fraud penalty",
    "description": "The deeply divided decision by the Appellate Division in Manhattan is also a defeat for New York Attorney General Letitia James, one of Trump's biggest foes.",
    "link": "https://www.japantimes.co.jp/news/2025/08/22/world/crime-legal/trump-huge-court-win/",
    "timestamp": "2025-08-22T04:14:00Z"
  },
  {
    "title": "California Gov. Newsom signs legislation calling special election on redrawn congressional map",
    "description": "SACRAMENTO, Calif (AP) — California voters will decide in November whether to approve a redrawn congressional map designed to help Democrats win five more U.S. House seats next year, after Texas Republicans advanced their own redrawn map to pad their House ma…",
    "link": "https://freerepublic.com/focus/f-news/4336024/posts",
    "timestamp": "2025-08-22T04:11:44Z"
  },
  {
    "title": "People who already have US visas are still subject to 'continuous vetting'. What does that mean?",
    "description": "The US government appears to be expanding its visa crackdown, with a statement indicating authorities will review existing visas of more than 55 million people in search of violations.",
    "link": "https://www.abc.net.au/news/2025-08-22/us-visa-continuous-vetting-america-student-working-tourist-esta/105684470",
    "timestamp": "2025-08-22T04:10:46Z"
  },
  {
    "title": "Putin's Demand To Ukraine: Give Up Donbas, No NATO And No Western Troops, Sources Say",
    "description": "In the most detailed Russian-based reporting to date on Putin's offer at the summit, Reuters was able to outline the contours of what the Kremlin would like to see in a possible peace deal.",
    "link": "https://www.huffpost.com/entry/putin-demand-ukraine-donbas-western-troops_n_68a7eb8fe4b0c791dbab5bed",
    "timestamp": "2025-08-22T04:07:44Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "A federal website that informs the public about data collection has gone down, causing concern among advocates",
    "link": "https://abcnews.go.com/Technology/wireStory/federal-data-website-outage-raises-concerns-advocates-124869691",
    "timestamp": "2025-08-22T04:06:29Z"
  },
  {
    "title": "Nvidia CEO in Taipei to visit TSMC, says in talks with US over new China chip",
    "description": "Nvidia CEO Jensen Huang arrived in Taipei on Friday to visit chip foundry partner TSMC, as the world's most valuable company navigates rising friction between Washington and Beijing over access to its industry-leading AI chips.",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-ceo-in-taipei-to-visit-tsmc-says-in-talks-with-us-over-new-china-chip/articleshow/123445243.cms",
    "timestamp": "2025-08-22T04:06:26Z"
  },
  {
    "title": "‘All Eyes On Gaza City’ as Israel Ramps Up Campaign of Conquest and Ethnic Cleansing",
    "description": "'The explicit goal of turning Palestine's largest city into a wasteland has nothing to do with hostages or Hamas and everything to do with genocide,' said one critic. By Brett Wilkins | - ( Commondreams.org ) - Operation Gideon's Chariots 2—Israel's plan to c…",
    "link": "https://www.juancole.com/2025/08/campaign-conquest-cleansing.html",
    "timestamp": "2025-08-22T04:06:11Z"
  },
  {
    "title": "Cartoonish Trump is making America a Caricature, and I should Know",
    "description": "( Tomdispatch.com ) - Sometimes I dream — in the sense of a nightmare — about bringing my parents back to this all too strange world of ours to tell them about… yes, of course, Donald J. Trump. They died long before The Apprentice even made it onto TV early i…",
    "link": "https://www.juancole.com/2025/08/cartoonish-america-caricature.html",
    "timestamp": "2025-08-22T04:04:55Z"
  },
  {
    "title": "Nvidia chief says H20 chip shipments to China not a security concern",
    "description": "Shipping Nvidia's H20 chips to China was \"great\" for Beijing and Washington and not a security threat, the tech giant's chief said Friday.   The company produces some of the world's most advanced semiconductors but cannot ship its most cutting-edge chips to C…",
    "link": "https://economictimes.indiatimes.com/tech/technology/nvidia-chief-says-h20-chip-shipments-to-china-not-a-security-concern/articleshow/123445171.cms",
    "timestamp": "2025-08-22T04:02:19Z"
  },
  {
    "title": "China to stand firm with India, slams US tariffs as ‘bullying’",
    "description": "Speaking at a conference on India-China relations, Xu said Beijing will firmly back New Delhi in safeguarding multilateral trade under the WTO",
    "link": "https://www.thehindubusinessline.com/news/china-to-stand-firm-with-india-slams-us-tariffs-as-bullying/article69963283.ece",
    "timestamp": "2025-08-22T04:01:52Z"
  },
  {
    "title": "Walmart finds its cushion in advertising as tariffs bite",
    "description": "Walmart has a plan to stay profitable as President Donald Trump’s tariffs push up costs. It’s called advertising. In the second quarter, Walmart’s ad revenue jumped 46% year over year, a number padded by the addition of Vizio, the smart TV maker it picked up …",
    "link": "http://digiday.com/marketing/walmart-finds-it-cushion-in-advertising-as-tariffs-bite/",
    "timestamp": "2025-08-22T04:01:00Z"
  },
  {
    "title": "A couple’s hope for Ukraine’s future: ‘We live in the real world; we don’t avoid reality’",
    "description": "‘Sima’ Borovska and Ruslan Borovskiy have known loss, but their story is one of resilience, ingenuity and courage",
    "link": "https://www.irishtimes.com/world/europe/2025/08/22/a-couples-hope-for-ukraines-future-we-live-in-the-real-world-we-dont-avoid-reality/",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Letitia James, Adam Schiff, and Lisa Cook should be held to exactly the same fairness standard Trump was, as I was assured it was scrupulously fair",
    "description": "The Washington Post editorial board came out against lawfare this morning… against Letitia James. Curiously, they stealth-edited the title of the editorial.  Originally the title was “Letitia James Went After Trump. Now She&rsq...",
    "link": "https://www.americanthinker.com/blog/2025/08/letitia_james_adam_schiff_and_lisa_cook_should_be_held_to_exactly_the_same_fairness_standard_trump_was_as_i_was_assured_it_was_scrupulously_fair.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "The geometrics of power",
    "description": "In the annals of American political history, few terms evoke as much controversy as gerrymandering — a practice synonymous with electoral manipulation. Its origins trace back to 1812, when Massachusetts Gov. Elbridge Gerry approved a redis...",
    "link": "https://www.americanthinker.com/blog/2025/08/the_geometrics_of_power.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Gavin Newsom declares war on the Marines",
    "description": "Term limited California Governor Gavin Newsom is running for the Democrat Party nomination for President in 2028. He’s not certain against whom he’ll be running, so he’s running against America. He’s been governing against Cal...",
    "link": "https://www.americanthinker.com/blog/2025/08/gavin_newsom_declares_war_on_the_marines.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "To deploy or not to deploy",
    "description": "President Trump is correct. No U.S. troops on the ground but we will provide logistics and aerial support. It's up to the Europeans to put up the troops to protect Ukraine, a country in their neighborhood. This is not an isolationist position but...",
    "link": "https://www.americanthinker.com/blog/2025/08/to_deploy_or_not_deploy.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Cleaning Up D.C.’s Mean Streets",
    "description": "Washington, D.C. denizens are breathing a sigh of relief -- at least those not suffering Trump Derangement Syndrome. Just the other day, Veep Vance, Pete Hegseth, and White House powerhouse Stephen Miller went to Union Station. They thanked Nati...",
    "link": "https://www.americanthinker.com/articles/2025/08/cleaning_up_d_c_s_mean_streets.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Brady United chooses DC criminals, politicians",
    "description": "It is said Donald Trump has a near-magical ability to make Democrats do insanely self-destructive things. They’re doing it to themselves. Trump doesn’t have to apply clumsy reverse psychology, their self-imposed Trump Derangement Syn...",
    "link": "https://www.americanthinker.com/blog/2025/08/brady_united_chooses_dc_criminals_politicians.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Kathy Hochul issues a secret pardon",
    "description": "The pardon power is among the most important any governor can wield. Done honestly, it can correct injustice in the criminal justice system and extend mercy to the deserving. It can be a final check on a system that usually works but can spectac...",
    "link": "https://www.americanthinker.com/blog/2025/08/kathy_hochul_issues_a_secret_pardon.html",
    "timestamp": "2025-08-22T04:00:00Z"
  },
  {
    "title": "Critics Burn Trump For Bragging He Knows More Than 'Any Human Being' On 1 Weird Topic",
    "description": "The president's strangest boast yet lights up social media.",
    "link": "https://www.huffpost.com/entry/trump-grass-brag_n_68a7d543e4b0c791dbab434c",
    "timestamp": "2025-08-22T03:59:49Z"
  },
  {
    "title": "North Korea’s Kim Jong Un hails troops killed in ‘heroic’ war with Ukraine",
    "description": "North Korean leader hints at more military cooperation with Moscow 'in the future' as he awards medals to soldiers.",
    "link": "https://www.aljazeera.com/news/2025/8/22/north-koreas-kim-jong-un-hails-troops-killed-in-heroic-war-with-ukraine",
    "timestamp": "2025-08-22T03:57:53Z"
  },
  {
    "title": "Keith Olbermann Goes Scorched Earth On 'Aggressively Stupid' Karoline Leavitt",
    "description": "The former MSNBC host summed up the White House press secretary's time on the job to \"perfection.\"",
    "link": "https://www.huffpost.com/entry/keith-olbermann-trump-white-house-karoline-leavitt_n_68a7c22be4b0c791dbab2c2f",
    "timestamp": "2025-08-22T03:56:51Z"
  },
  {
    "title": "Trump administration to scrutinize millions of visa holders; halts truck driver visas as foreign drivers ‘endanger’ American lives",
    "description": "The US State Department will continuously vet over 55 million visa holders for law violations, including overstays and criminal activity. This announcement follows the Trump administration's plans to screen for \"anti-American\" views. Secretary Rubio also decl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-to-scrutinize-millions-of-visa-holders-halts-truck-driver-visas-as-foreign-drivers-endanger-american-lives/articleshow/123444928.cms",
    "timestamp": "2025-08-22T03:56:38Z"
  },
  {
    "title": "Under Trump Pressure, US Fed Chief To Walk Tightrope In Speech",
    "description": "US Federal Reserve chief Jerome Powell is expected to walk a fine line while delivering a closely watched speech at a central banking conference on Friday, as he faces down attacks from President Donald Trump alongside mixed economic data.",
    "link": "https://www.ibtimes.com/under-trump-pressure-us-fed-chief-walk-tightrope-speech-3781424",
    "timestamp": "2025-08-22T03:51:14Z"
  },
  {
    "title": "US wine sellers left in limbo despite EU tariff deal",
    "description": "At a wine shop in Washington’s Capitol Hill neighborhood, bottles sourced from Europe are becoming costlier to import — and soon, pricier for customers to buy, the owner says — thanks to a resident just down the road in the White House. President Donald Trump…",
    "link": "https://www.digitaljournal.com/world/us-wine-sellers-left-in-limbo-despite-eu-tariff-deal/article",
    "timestamp": "2025-08-22T03:47:34Z"
  },
  {
    "title": "Federal data website outage raises concerns among advocates",
    "description": "A federal website that informs the public about what information agencies are collecting and allows for public comment went down last weekend, and it has...",
    "link": "https://www.yahoo.com/news/articles/federal-data-website-outage-raises-034627637.html",
    "timestamp": "2025-08-22T03:46:27Z"
  },
  {
    "title": "US Wine Sellers Left In Limbo Despite EU Tariff Deal",
    "description": "At a wine shop in Washington's Capitol Hill neighborhood, bottles sourced from Europe are becoming costlier to import -- and soon, pricier for customers to buy, the owner says -- thanks to a resident just down the road in the White House.",
    "link": "https://www.ibtimes.com/us-wine-sellers-left-limbo-despite-eu-tariff-deal-3781421",
    "timestamp": "2025-08-22T03:45:19Z"
  },
  {
    "title": "Pam Bondi Makes Bizarre Pitch to D.C. Residents Amid Trump’s Crackdown: ‘All New Grass!’",
    "description": "Attorney General Pam Bondi said President Donald Trump will make good on his pledge to replace the grass and sprinkler systems in parks across Washington, D.C.\nThe post Pam Bondi Makes Bizarre Pitch to D.C. Residents Amid Trump’s Crackdown: ‘All New Grass!’ f…",
    "link": "https://www.mediaite.com/media/tv/pam-bondi-makes-bizarre-pitch-to-d-c-residents-amid-trumps-crackdown-all-new-grass/",
    "timestamp": "2025-08-22T03:44:37Z"
  },
  {
    "title": "Under Trump pressure, US Fed chief to walk tightrope in speech",
    "description": "US Federal Reserve chief Jerome Powell is expected to walk a fine line while delivering a closely watched speech at a central banking conference on Friday, as he faces down attacks from President Donald Trump alongside mixed economic data. The US central bank…",
    "link": "https://www.digitaljournal.com/world/under-trump-pressure-us-fed-chief-to-walk-tightrope-in-speech/article",
    "timestamp": "2025-08-22T03:42:20Z"
  },
  {
    "title": "Nvidia Chief Says H20 Chip Shipments To China Not A Security Concern",
    "description": "Shipping Nvidia's H20 chips to China was \"great\" for Beijing and Washington and not a security threat, the tech giant's chief said Friday.",
    "link": "https://www.ibtimes.com/nvidia-chief-says-h20-chip-shipments-china-not-security-concern-3781418",
    "timestamp": "2025-08-22T03:42:19Z"
  },
  {
    "title": "Alina Habba Names Democrat And Republican Senators ‘Holding Up’ U.S. Attorney Vote",
    "description": "Habba called out by name two Democrats and one Republican senator, claiming how they held up her confirmation to officially become U.S. attorney for New Jersey.",
    "link": "https://dailycaller.com/2025/08/21/alina-habba-names-democrat-republican-senators-confirmation-us-attorney-new-jersey/",
    "timestamp": "2025-08-22T03:39:38Z"
  },
  {
    "title": "Boeing eyes sale of up to 500 planes to China: report",
    "description": "Aerospace giant Boeing is in talks to sell as many as 500 planes to China in a deal that's said to be at the center of a trade agreement between President Donald Trump and China’s President Xi Jinping, people familiar with the matter told Bloomberg.\nBoeing, w…",
    "link": "https://biztoc.com/x/3df1f27c28eb1fcc",
    "timestamp": "2025-08-22T03:38:13Z"
  },
  {
    "title": "Nvidia chief says H20 chip shipments to China not a security concern",
    "description": "Shipping Nvidia’s H20 chips to China was “great” for Beijing and Washington and not a security threat, the tech giant’s chief said Friday.   The California-based company produces some of the world’s most advanced semiconductors but cannot ship its most cuttin…",
    "link": "https://www.digitaljournal.com/world/nvidia-chief-says-h20-chip-shipments-to-china-not-a-security-concern/article",
    "timestamp": "2025-08-22T03:37:32Z"
  },
  {
    "title": "Nvidia CEO in Taipei to visit TSMC, says in talks with US over new China chip",
    "description": "TAIPEI: Nvidia CEO Jensen Huang arrived in Taipei on Friday (Aug 22) to visit chip foundry partner TSMC, as the biggest US company navigates rising friction between Washington and Beijing over access to its industry-leading AI chips. \"My main purpose coming h…",
    "link": "https://www.channelnewsasia.com/east-asia/nvidia-ceo-taipei-visit-tsmc-says-talks-us-over-new-china-chip-5308321",
    "timestamp": "2025-08-22T03:36:55Z"
  },
  {
    "title": "Nvidia chief says H20 chip shipments to China not a security concern",
    "description": "Shipping Nvidia's H20 chips to China was \"great\" for Beijing and Washington and not a security threat, the tech giant's chief said Friday.  The California...",
    "link": "https://finance.yahoo.com/news/nvidia-chief-says-h20-chip-033538435.html",
    "timestamp": "2025-08-22T03:35:38Z"
  },
  {
    "title": "US and China are thwarting India’s shot at $7 trillion solar prize",
    "description": "India's solar industry is poised for significant growth, potentially rivaling China by the mid-2030s, driven by increasing domestic demand and a desire to compete in export markets. However, the industry faces challenges including rising US tariffs and heavy …",
    "link": "https://economictimes.indiatimes.com/industry/renewables/us-and-china-are-thwarting-indias-shot-at-7-trillion-solar-prize/articleshow/123444407.cms",
    "timestamp": "2025-08-22T03:35:29Z"
  },
  {
    "title": "Military Options For Ukraine Discussed By U.S., European National Security Advisers",
    "description": "A source familiar with the matter said U.S. Secretary of State Marco Rubio, who also serves as Trump's national security adviser, held a conference call on Thursday with his European counterparts to discuss the options.",
    "link": "https://www.huffpost.com/entry/military-options-ukraine-europe-united-states_n_68a7e33ee4b0ab862cb209c7",
    "timestamp": "2025-08-22T03:31:57Z"
  },
  {
    "title": "Ukraine now has a new weapon that can change the war: Here's all about Flamingo missile",
    "description": "Ukraine has unveiled the Flamingo cruise missile. This missile is developed by Fire Point. It can strike targets 3,000 kilometers away. The missile carries a 2,535-pound warhead. Production is currently one missile per day. Plans are to increase to seven dail…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraine-now-has-a-weapon-that-can-change-the-war-heres-all-about-flamingo-missile/articleshow/123444455.cms",
    "timestamp": "2025-08-22T03:30:27Z"
  },
  {
    "title": "'Incompetence': George Conway reveals AG Bondi made a 'major misstep' on DC takeover",
    "description": "A conservative lawyer noted on Thursday that the U.S. Attorney General may have made a major mistake in the federal takeover of Washington, D.C.'s police department. One of the first moves Attorney General Pam Bondi made after President Donald Trump federaliz…",
    "link": "https://www.rawstory.com/pam-bondi-2673909618/",
    "timestamp": "2025-08-22T03:29:16Z"
  },
  {
    "title": "North Korea's Kim decorates troops who fought for Russia against Ukraine",
    "description": "Seoul (AFP) Aug 22, 2025\n\n\n \nNew images released by North Korean state media on Friday showed leader Kim Jong Un kneeling before portraits of soldiers killed fighting for Russia against Ukraine, as well as hugging an emotional survivor of the conflict. \n\nThe …",
    "link": "https://www.spacewar.com/reports/North_Koreas_Kim_decorates_troops_who_fought_for_Russia_against_Ukraine_999.html",
    "timestamp": "2025-08-22T03:28:44Z"
  },
  {
    "title": "Top US, Europe officers develop military options for Ukraine peace push",
    "description": "Washington (AFP) Aug 21, 2025\n\n\n \nTop officers from the United States and Europe held talks this week to develop military options as part of efforts to broker an end to the devastating war in Ukraine, the US military said Thursday. \n\nUS General Dan Caine and …",
    "link": "https://www.spacewar.com/reports/Top_US_Europe_officers_develop_military_options_for_Ukraine_peace_push_999.html",
    "timestamp": "2025-08-22T03:28:44Z"
  },
  {
    "title": "North Korea’s Kim decorates troops who fought for Russia against Ukraine",
    "description": "New images released by North Korean state media on Friday showed leader Kim Jong Un kneeling before portraits of soldiers killed fighting for Russia against Ukraine, as well as hugging an emotional survivor of the conflict. The images of an elaborate ceremony…",
    "link": "https://www.digitaljournal.com/world/north-koreas-kim-decorates-troops-who-fought-for-russia-against-ukraine/article",
    "timestamp": "2025-08-22T03:22:21Z"
  },
  {
    "title": "North Korea's Kim Decorates Troops Who Fought For Russia Against Ukraine",
    "description": "New images released by North Korean state media on Friday showed leader Kim Jong Un kneeling before portraits of soldiers killed fighting for Russia against Ukraine, as well as hugging an emotional survivor of the conflict.",
    "link": "https://www.ibtimes.com/north-koreas-kim-decorates-troops-who-fought-russia-against-ukraine-3781417",
    "timestamp": "2025-08-22T03:21:22Z"
  },
  {
    "title": "Judge Hands Trump Admin Major Legal Loss on Alligator Alcatraz",
    "description": "The injunction orders that construction be paused and bans officials from bringing additional people to the Everglades immigrant detention facility.",
    "link": "https://www.newsweek.com/judge-hands-trump-admin-major-legal-loss-alligator-alcatraz-2117444",
    "timestamp": "2025-08-22T03:18:14Z"
  },
  {
    "title": "White House Targets Specific Artworks at Smithsonian, Including Painting of Refugees and Fauci Portrait",
    "description": "The White House listed artworks at Smithsonian museums that it denounced, including a painting of refugees, a Fauci portrait, and more.",
    "link": "https://www.artnews.com/art-news/news/white-house-smithsonian-artworks-list-refugees-fauci-1234749773/",
    "timestamp": "2025-08-22T03:17:06Z"
  },
  {
    "title": "Trump’s advisor calls India “tariff king,” as US-India tension rises",
    "description": "Kathmandu, Aug 22: US President Donald Trump’s trade advisor Peter Navarro sharply criticized India, calling it the “king of tariffs.” […]\nThe post Trump’s advisor calls India “tariff king,” as US-India tension rises appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/22/trumps-advisor-calls-india-tariff-king-as-us-india-tension-rises/",
    "timestamp": "2025-08-22T03:15:00Z"
  },
  {
    "title": "Asian markets tick up as investors eye Jackson Hole meeting",
    "description": "Asian markets were mostly up Friday morning ahead of a pivotal speech by the US central bank chief, expected to shed light on possible interest rate cuts in the world’s top economy. Recent days have seen cautious trading as investors parse a mixed outlook for…",
    "link": "https://www.digitaljournal.com/world/asian-markets-tick-up-as-investors-eye-jackson-hole-meeting/article",
    "timestamp": "2025-08-22T03:12:32Z"
  },
  {
    "title": "Rice prices up 91 pct year-on-year in Japan",
    "description": "Rice prices in Japan soared 90.7 percent in July year-on-year, official data showed Friday, but the rate of increase slowed from previous months offering some relief for Prime Minister Shigeru Ishiba. Ishiba’s future is uncertain after his coalition lost its …",
    "link": "https://www.digitaljournal.com/world/rice-prices-up-91-pct-year-on-year-in-japan/article",
    "timestamp": "2025-08-22T03:12:32Z"
  },
  {
    "title": "Asian Markets Tick Up As Investors Eye Jackson Hole Meeting",
    "description": "Asian markets were mostly up Friday morning ahead of a pivotal speech by the US central bank chief, expected to shed light on possible interest rate cuts in the world's top economy.",
    "link": "https://www.ibtimes.com/asian-markets-tick-investors-eye-jackson-hole-meeting-3781414",
    "timestamp": "2025-08-22T03:12:22Z"
  },
  {
    "title": "Rice Prices Up 91 Pct Year-on-year In Japan",
    "description": "Rice prices in Japan soared 90.7 percent in July year-on-year, official data showed Friday, but the rate of increase slowed from previous months offering some relief for Prime Minister Shigeru Ishiba.",
    "link": "https://www.ibtimes.com/rice-prices-91-pct-year-year-japan-3781411",
    "timestamp": "2025-08-22T03:12:20Z"
  },
  {
    "title": "Chris Hayes ‘Genuinely Shocked’ Dems Are ‘Actively Fighting’ GOP ‘Power Grab’ Instead of ‘Rolling Over’ | Video",
    "description": "The MSNBC host weighs in after California passes a bill to fight the Trump-backed gerrymandering scheme in Texas\nThe post Chris Hayes ‘Genuinely Shocked’ Dems Are ‘Actively Fighting’ GOP ‘Power Grab’ Instead of ‘Rolling Over’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/chris-hayes-genuinely-shocked-dems-are-fighting-gop-msnbc/",
    "timestamp": "2025-08-22T03:12:09Z"
  },
  {
    "title": "Troop costs, China in focus when South Korea's Lee meets Trump",
    "description": "SEOUL: When South Korean President Lee Jae Myung meets US President Donald Trump next week for their first summit, he'll face calls to pay more for the upkeep of American troops on the",
    "link": "https://www.channelnewsasia.com/east-asia/troop-costs-china-focus-when-south-koreas-lee-meets-trump-5308281",
    "timestamp": "2025-08-22T03:03:00Z"
  },
  {
    "title": "EU-US Trade Agreement Causes Damage to European Agriculture - Association of EU Farmers",
    "description": "MOSCOW (Sputnik) - The trade agreement between the European Union and the United States is causing serious damage to the EU agricultural sector, the largest union of European agricultural producers, Copa and Cogeca, said on Thursday.",
    "link": "https://sputnikglobe.com/20250822/eu-us-trade-agreement-causes-damage-to-european-agriculture---association-of-eu-farmers-1122659392.html",
    "timestamp": "2025-08-22T03:00:24Z"
  },
  {
    "title": "Russia launches biggest wave of strikes on Ukraine for weeks",
    "description": "Russia has launched 574 drones and 40 missiles on Ukraine in one of the heaviest bombardments in weeks, Ukrainian officials say. One person was killed in a drone and missile strike on the western city of Lviv, while 15 others were reported wounded in an attac…",
    "link": "https://thechronicle.com.gh/russia-launches-biggest-wave-of-strikes-on-ukraine-for-weeks/",
    "timestamp": "2025-08-22T02:59:45Z"
  },
  {
    "title": "Clay Travis Predicts Many More Things To Come After Appeals Court Rules Trump Fine Excessive",
    "description": "Clay Travis predicted on Fox News Thursday more courtroom wins ahead for President Donald Trump.",
    "link": "https://dailycaller.com/2025/08/21/clay-travis-letitia-james-donald-trump-courtroom-wins/",
    "timestamp": "2025-08-22T02:58:35Z"
  },
  {
    "title": "Thursday, August 21. Russia’s War On Ukraine: News And Information From Ukraine",
    "description": "Dispatches from Ukraine: Day 1,275",
    "link": "https://www.forbes.com/sites/katyasoldak/2025/08/21/thursday-august-21-russias-war-on-ukraine-news-and-information-from-ukraine/",
    "timestamp": "2025-08-22T02:55:43Z"
  },
  {
    "title": "China’s Major Banks, Country Garden Held Back as Stimulus Expectations Grow",
    "description": "Industrial & Commercial Bank of China Ltd., China Construction Bank Corp., Agricultural Bank of China Ltd. and Bank of China Ltd. probably saw earnings impacted by weaker loan demand amid limited government stimulus and a sluggish economy.",
    "link": "https://www.livemint.com/companies/company-results/chinas-major-banks-country-garden-held-back-as-stimulus-expectations-grow-11755831245423.html",
    "timestamp": "2025-08-22T02:54:04Z"
  },
  {
    "title": "Marlow: It's the 'Beginning of Investigation and Vindication Season, Justice Is Coming for President Trump'",
    "description": "Thursday on Newsmax TV's \"Greg Kelly Reports,\" Breitbart Editor-in-Chief Alex Marlow said a New York appeals court throwing out the more than $500 million fine on President Donald Trump in Attorney General Letitia James' business fraud case is the \"beginning …",
    "link": "https://www.breitbart.com/clips/2025/08/21/marlow-its-the-beginning-of-investigation-and-vindication-season-justice-is-coming-for-president-trump/",
    "timestamp": "2025-08-22T02:49:54Z"
  },
  {
    "title": "Zelensky says Russia trying to 'wriggle out' of peace talks",
    "description": "Ukrainian President Volodymyr Zelensky accused Moscow on Thursday of shirking a meeting between him and Russian counterpart Vladimir Putin, despite US-led...",
    "link": "https://www.yahoo.com/news/articles/first-security-guarantees-then-putin-093922550.html",
    "timestamp": "2025-08-22T02:46:24Z"
  },
  {
    "title": "Alina Habba Says Judges ‘Should Just Be Doing Their Job: Respecting the President’",
    "description": "Alina Habba has some thoughts about the role of judges.\nThe post Alina Habba Says Judges ‘Should Just Be Doing Their Job: Respecting the President’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/alina-habba-says-judges-should-just-be-doing-their-job-respecting-the-president/",
    "timestamp": "2025-08-22T02:41:59Z"
  },
  {
    "title": "Behind India’s massive Russian oil imports: Asia’s richest man",
    "description": "Reliance's Russian crude imports have soared from 3 percent before the war in Ukraine to 50 percent now.",
    "link": "https://www.aljazeera.com/economy/2025/8/22/behind-indias-massive-russian-oil-imports-asias-richest-man",
    "timestamp": "2025-08-22T02:40:19Z"
  },
  {
    "title": "Intel's $10 Billion Bailout Or Nationalisation? Trump's Stake Plan Raises Questions For Markets",
    "description": "The Trump administration is likely negotiating a deal to take up to a 10% equity stake in Intel Corp. This will be facilitated by converting grants made under the 2022 Chips and Science Act into equity. If the deal sails through, it is set to become one of th…",
    "link": "https://www.ndtvprofit.com/markets/intels-10-billion-bailout-or-nationalisation-trumps-stake-plan-raises-questions-for-markets",
    "timestamp": "2025-08-22T02:29:47Z"
  },
  {
    "title": "CFTC launches second ‘Crypto Sprint’ to advance White House push",
    "description": "The CFTC is seeking public input on how it can more effectively regulate spot crypto trading as part of its second “crypto sprint” initiative to advance the White House’s crypto agenda.",
    "link": "https://cointelegraph.com/news/cftc-launches-second-crypto-sprint-initiative-under-white-house-suggestions",
    "timestamp": "2025-08-22T02:28:23Z"
  },
  {
    "title": "‘Love Affair With Illegal Aliens That’s Killing People’: Florida AG Floats Holding CA Accountable For Deadly Driver",
    "description": "FL AG James Uthmeier said the state is considering action against CA and other parties in connection with illegal immigrant Harjinder Singh.",
    "link": "https://dailycaller.com/2025/08/21/florida-attorney-general-floats-california-accountable-illegal-migrant-commerical-truck-driver-killing/",
    "timestamp": "2025-08-22T02:25:56Z"
  },
  {
    "title": "Oil prices dip, set for positive week as Russia-Ukraine peace progress stalls",
    "description": "Investing.com-- Oil prices fell slightly in Asian trade on Friday, amid sustained risk-aversion before more cues on U.S. monetary policy from Federal Reserve...",
    "link": "https://finance.yahoo.com/news/oil-prices-dip-set-positive-022555820.html",
    "timestamp": "2025-08-22T02:25:55Z"
  },
  {
    "title": "Homeboy got played",
    "description": "The closest Trump will ever get to seeing a Nobel Peace Prize is to go to Barack Obama's house and get a glimpse at his.",
    "link": "https://www.ncspin.com/homeboy-got-played",
    "timestamp": "2025-08-22T02:15:22Z"
  },
  {
    "title": "Oil Prices Rally as the Geopolitical Risk Premium Rebuilds",
    "description": "Light crude oil futures rose for the week, closing Thursday at $63.52, up $1.54 or +2.48% from last Friday’s close, as geopolitical tensions, bullish inventory data, and renewed demand optimism drove a shift in market sentiment. The recovery followed two week…",
    "link": "https://oilprice.com/Energy/Energy-General/Oil-Prices-Rally-as-the-Geopolitical-Risk-Premium-Rebuilds.html",
    "timestamp": "2025-08-22T02:11:00Z"
  },
  {
    "title": "US aircraft manufacturer Boeing reportedly in talks to sell up to 500 planes to China",
    "description": "The deal depends on a US-China agreement in the two nations' ongoing trade war.",
    "link": "https://www.nzherald.co.nz/world/us-aircraft-manufacturer-boeing-reportedly-in-talks-to-sell-up-to-500-planes-to-china/KZ6M7YCXHZHJTMX3QK76Y5OFV4/",
    "timestamp": "2025-08-22T02:09:43Z"
  },
  {
    "title": "'South Park' mocks tech bros, Tim Cook, and ChatGPT",
    "description": "The third episode of the animated comedy's 27th season mocked the current state of the tech world in true \"South Park\" fashion.",
    "link": "https://www.businessinsider.com/south-park-tim-cook-silicon-valley-ketamine-chatgpt-2025-8",
    "timestamp": "2025-08-22T02:09:00Z"
  },
  {
    "title": "Oil prices set to snap two-week losing streak as peace in Ukraine remains elusive",
    "description": "Oil prices experienced minimal fluctuations on Friday, poised to end a two-week losing streak as hopes for a swift resolution between Russia and Ukraine diminished. The ongoing conflict, marked by recent attacks and stalled peace talks, has increased risk pre…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-set-to-snap-two-week-losing-streak-as-peace-in-ukraine-remains-elusive/articleshow/123443185.cms",
    "timestamp": "2025-08-22T02:06:34Z"
  },
  {
    "title": "\"Very hard to win war without attacking\": Trump hints at letting Ukraine \"fight back\" amid peace talks",
    "description": "Donald Trump hinted at allowing Ukraine to \"fight back\" against Russia, criticizing Biden's restrictions and claiming the war wouldn't have occurred under his presidency. This shift follows Russia's intensified attacks and a stalled meeting regarding ceasefir…",
    "link": "https://economictimes.indiatimes.com/news/defence/very-hard-to-win-war-without-attacking-trump-hints-at-letting-ukraine-fight-back-amid-peace-talks/articleshow/123443112.cms",
    "timestamp": "2025-08-22T02:00:59Z"
  },
  {
    "title": "Netanyahu proves he’s a thin-skinned, genocidal man-child — and that News Corp is a foreign propaganda outlet",
    "description": "The Israeli prime minister poses as a tough guy, but criticism reduces him to a quivering jelly of rage. It's no surprise he went to News Corp to vent.\nThe post Netanyahu proves he’s a thin-skinned, genocidal man-child — and that News Corp is a foreign propag…",
    "link": "http://www.crikey.com.au/2025/08/22/benjamin-netanyahu-sky-news-sharri-markson-news-corp-israel-palestine/",
    "timestamp": "2025-08-22T01:59:54Z"
  },
  {
    "title": "US Work Visa Update as Marco Rubio Announces New Pause",
    "description": "The announcement echoes earlier administration actions to tighten English-language enforcement for commercial drivers.",
    "link": "https://www.newsweek.com/us-work-visa-update-marco-rubio-announces-new-pause-2117427",
    "timestamp": "2025-08-22T01:59:50Z"
  },
  {
    "title": "Trump declares victory in Washington DC after takeover of metro police",
    "description": "In the seven days since Trump deployed 800 National Guard troops in DC, violent crime is down 22% comapred to previous seven days",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/21/trump-law-enforcment-officials-dc-safe/85768351007/",
    "timestamp": "2025-08-22T01:57:55Z"
  },
  {
    "title": "Israel to conquer Gaza even if Hamas accepts ceasefire deal – Netanyahu",
    "description": "Israel will continue its offensive in Gaza even if Hamas accepts the ceasefire and hostage deal Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623394-israel-gaza-city-offensive/",
    "timestamp": "2025-08-22T01:57:38Z"
  },
  {
    "title": "'I’m very good at grass': Trump baffles with bizarre landscaping rant",
    "description": "President Donald Trump drew attention Thursday evening after delivering an unusual set of remarks while speaking to Washington D.C. law enforcement officials, prompting a flurry of reactions on social media questioning his mental acuity.While discussing plans…",
    "link": "https://www.rawstory.com/donald-trump-2673909525/",
    "timestamp": "2025-08-22T01:54:02Z"
  },
  {
    "title": "Doubts grow on Ukraine security plan as Russia demands role",
    "description": "Russian Foreign Minister Sergei Lavrov says Moscow should have a say in security arrangements for Ukraine, which could also involve Beijing.",
    "link": "https://www.japantimes.co.jp/news/2025/08/22/world/politics/ukraine-security-plan-doubts/",
    "timestamp": "2025-08-22T01:48:00Z"
  }
]