[
  {
    "title": "Trump deals bring some clarity for world’s manufacturing base",
    "description": "President Trump's new tariff deals are reshaping global trade, setting rates at 15% for Japan and around 19% for Southeast Asia. While investors are relieved, uncertainty remains regarding sectoral tariffs on nations like Taiwan and India. Businesses are stra…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-deals-bring-some-clarity-for-worlds-manufacturing-base/articleshow/122855327.cms",
    "timestamp": "2025-07-23T08:44:39Z"
  },
  {
    "title": "Trump announces Japan trade deal that drops threatened tariffs from 25% to 15% and promises $550 billion investment in U.S",
    "description": "President Donald Trump announced a trade framework with Japan on Tuesday, placing a 15% tax on goods imported from that nation.\n“This Deal will create Hundreds of Thousands of Jobs — There has never been anything like it,” Trump posted on Truth Social, adding…",
    "link": "https://biztoc.com/x/181913e9ee91b0a0",
    "timestamp": "2025-07-23T08:35:58Z"
  },
  {
    "title": "Flurry of trade deals offers relief for some Asian countries, while others wait",
    "description": "U.S. President Donald Trump has announced a flurry of trade deals that will relieve some pressure on companies and consumers from sharply higher tariffs on imports from Japan and a handful of other Asian countries",
    "link": "https://biztoc.com/x/7697aeef2624aeec",
    "timestamp": "2025-07-23T08:35:40Z"
  },
  {
    "title": "Trump announces Philippine trade deal framework with 19% tariffs after meeting with President Marcos Jr",
    "description": "President Donald Trump said he has reached a trade agreement with Philippine leader Ferdinand Marcos Jr., following a meeting Tuesday at the White House, that will see the U.S. slightly drop its tariff rate for the Philippines without paying import taxes for …",
    "link": "https://biztoc.com/x/daf061359c917c9e",
    "timestamp": "2025-07-23T08:35:30Z"
  },
  {
    "title": "Trump announces Japan trade deal that drops threatened tariffs from 25% to 15% and promises $550 billion investment in U.S.",
    "description": "The president said Japan would invest “at my direction” $550 billion into the U.S. and would “open” its economy to American autos and rice.",
    "link": "https://fortune.com/asia/2025/07/23/trump-japan-trade-deal-drops-tariffs-25-to-15-promises-550-billion/",
    "timestamp": "2025-07-23T08:30:57Z"
  },
  {
    "title": "Flurry of trade deals offers relief for some Asian countries, while others wait",
    "description": "U.S. President Donald Trump has announced a flurry of trade deals that will relieve some pressure on companies and consumers from sharply higher tariffs on imports from Japan and a handful of other Asian countries",
    "link": "https://abcnews.go.com/Business/wireStory/flurry-trade-deals-offers-relief-asian-countries-wait-123987699",
    "timestamp": "2025-07-23T08:28:43Z"
  },
  {
    "title": "Europe’s most valuable firm SAP flags U.S. trade slowdown but says Japan deal gives 'hope'",
    "description": "Deal-signing at the German cloud computing and software giant SAP turned cautious in the second quarter, CFO Dominik Asam told CNBC.",
    "link": "https://www.cnbc.com/2025/07/23/germanys-sap-flags-us-trade-hit-but-says-japan-deal-gives-hope.html",
    "timestamp": "2025-07-23T08:25:28Z"
  },
  {
    "title": "Colbert tells Trump the 'gloves are off' as late-night hosts rally amid cancellation",
    "description": "Stephen Colbert's late-night rivals have appeared in the audience during the host's first show since The Late Show was cancelled.",
    "link": "https://www.abc.net.au/news/2025-07-23/stephen-colbert-tells-trump-gloves-are-off-as-hosts-rally/105564150",
    "timestamp": "2025-07-23T08:25:15Z"
  },
  {
    "title": "Trump announces Philippine trade deal framework with 19% tariffs after meeting with President Marcos Jr.",
    "description": "When asked whether the Philippines got the shorter end of the stick, Marcos said, “that’s how negotiations go.”",
    "link": "https://fortune.com/asia/2025/07/23/trump-announces-philippine-trade-deal-19-tariffs-president-marcos-jr/",
    "timestamp": "2025-07-23T08:21:01Z"
  },
  {
    "title": "Tariffs look like the ‘dog that didn’t bark’ to Wall Street, with inflation expected to take a one-time hit and Trump unlikely to enforce threats",
    "description": "As markets shrug off the August 1 deadline, analysts warn that investor calm could embolden the White House to follow through—especially if economic data remains strong.",
    "link": "https://fortune.com/2025/07/23/tariffs-dog-that-didnt-bark-wall-street-inflation-trump/",
    "timestamp": "2025-07-23T08:17:15Z"
  },
  {
    "title": "Bitcoin boom: Trump's policies create 15,000 new millionaires in 2025",
    "description": "The number of cryptocurrency owners who have become millionaires has risen significantly since US President Donald Trump took office, according to a new report by Finbold.",
    "link": "https://biztoc.com/x/645630c0cea8c465",
    "timestamp": "2025-07-23T08:13:44Z"
  },
  {
    "title": "Coca-Cola is releasing a Trump-approved new version of its soda",
    "description": "Coca-Cola confirmed that it will release a new Coke made with cane sugar. The announcement follows a social media post from President Donald Trump last week in which he claimed he persuaded the company to replace high-fructose corn syrup. The company revealed…",
    "link": "https://thechronicle.com.gh/coca-cola-is-releasing-a-trump-approved-new-version-of-its-soda/",
    "timestamp": "2025-07-23T08:13:43Z"
  },
  {
    "title": "Becoming Zero: The Spiritual and Scientific Power of Nothingness",
    "description": "The article explores the concept of zero in mathematics, spirituality, and science, highlighting its paradoxical nature as both nothing and the source of everything. It connects zero to the Indian concept of 'Shunya' and the deity Shiva, representing emptines…",
    "link": "https://timesofindia.indiatimes.com/speaking-tree/daily-ecstasy/becoming-zero-the-spiritual-and-scientific-power-of-nothingness/articleshow/122854755.cms",
    "timestamp": "2025-07-23T08:13:27Z"
  },
  {
    "title": "Cucurella recalls Trump causing awkward Club World Cup trophy moment",
    "description": "Spain's European Championship winner Marc Cucurella said he was extremely nervous during Chelsea's Club World Cup trophy ceremony because of the unexpected behaviour of US President Donald Trump. In a recorded conversation with Spanish journalist Gerard Romer…",
    "link": "https://dpa-international.com/sports/urn:newsml:dpa.com:20090101:250723-99-528653/",
    "timestamp": "2025-07-23T08:13:25Z"
  },
  {
    "title": "Trump shifts gears to EU after striking Japan deal",
    "description": "The U.S.-Japan trade deal sparked hopes that the European Union will also be able to strike an agreement.",
    "link": "https://www.cnbc.com/2025/07/23/trump-shifts-gears-to-eu-after-striking-japan-deal.html",
    "timestamp": "2025-07-23T08:10:19Z"
  },
  {
    "title": "The teenager who wanted to be a teacher but now leads a council",
    "description": "George Finch, the UK's youngest council leader at 19, had thought he would become a history teacher.",
    "link": "https://www.bbc.com/news/articles/cj61l526xlxo",
    "timestamp": "2025-07-23T08:08:42Z"
  },
  {
    "title": "Barack Obama’s office responds to Trump’s ‘bizarre’ treason accusations amid Russia election interference claims",
    "description": "Barack Obama's office has responded to Donald Trump's accusations. Trump accused Obama of treason related to the 2016 election. These accusations came after Tulsi Gabbard's report. The report alleges a conspiracy by Obama officials. Obama's spokesperson calle…",
    "link": "https://economictimes.indiatimes.com/news/international/us/barack-obamas-office-responds-to-trumps-bizarre-treason-accusations-amid-russia-election-interference-claims/articleshow/122854669.cms",
    "timestamp": "2025-07-23T08:07:55Z"
  },
  {
    "title": "Flurry of trade deals offers relief for some Asian countries, while others wait",
    "description": "BANGKOK (AP) — U.S. President Donald Trump has announced trade deals with Japan and a handful of other Asian countries that will relieve some pressure on companies and consumers from sharply higher tariffs on their exports to the United States. A deal with Ch…",
    "link": "https://financialpost.com/pmn/flurry-of-trade-deals-offers-relief-for-some-asian-countries-while-others-wait",
    "timestamp": "2025-07-23T08:06:15Z"
  },
  {
    "title": "European, Japan stocks surge after US-Japan trade deal",
    "description": "European shares saw a rise on Wednesday. This was due to optimism about a possible trade deal between the European Union and the United States. Japan and the U.S. have already agreed to lower tariffs on autos. UK shares reached a record high. U.S. and Chinese…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-japan-stocks-surge-after-us-japan-trade-deal/articleshow/122854604.cms",
    "timestamp": "2025-07-23T08:04:21Z"
  },
  {
    "title": "Trump pulls US out of UN cultural agency UNESCO for second time",
    "description": "Donald Trump plans to withdraw the United States from UNESCO. The withdrawal will be effective by the end of next year. The White House claims UNESCO supports divisive causes. The State Department accuses UNESCO of anti-Israel bias. Audrey Azoulay regrets Tru…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-pulls-us-out-of-un-cultural-agency-unesco-for-second-time/articleshow/122854587.cms",
    "timestamp": "2025-07-23T08:03:26Z"
  },
  {
    "title": "China's yuan undervaluation fuels euro zone trade deficit, German study shows",
    "description": "BERLIN (Reuters) -European companies are facing increasing pressure due to China's alleged currency manipulation to keep its yuan weak, a study by the German...",
    "link": "https://finance.yahoo.com/news/chinas-yuan-undervaluation-fuels-euro-080231895.html",
    "timestamp": "2025-07-23T08:02:31Z"
  },
  {
    "title": "Flurry of trade deals offers relief for some Asian countries, while others wait",
    "description": "U.S. President Donald Trump has announced trade deals with Japan and a handful of other Asian countries that will relieve some pressure on companies and...",
    "link": "https://finance.yahoo.com/news/flurry-trade-deals-offers-relief-075927565.html",
    "timestamp": "2025-07-23T07:59:27Z"
  },
  {
    "title": "ADB slashes Asia’s growth forecast amid global trade tensions",
    "description": "The Asian Development Bank (ADB) has revised down its growth projections for developing Asia and the Pacific. The 2025 GDP forecast has been cut to 4.7%, down from 4.9% projected in April, while the 2026 estimate has been lowered slightly to 4.6%. The report …",
    "link": "https://m.economictimes.com/markets/stocks/news/adb-slashes-asias-growth-forecast-amid-global-trade-tensions/weaker-outlook-for-developing-asia-pacific/slideshow/122854762.cms",
    "timestamp": "2025-07-23T07:59:14Z"
  },
  {
    "title": "US to Launch More Strikes on Iran's Nuclear Facilities 'If Necessary' - Trump",
    "description": "US President Donald Trump has said that the United States will carry out new strikes on Iranian nuclear facilities \"if necessary.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250722-sputnik02.htm",
    "timestamp": "2025-07-23T07:57:57Z"
  },
  {
    "title": "Planned Subic ammo plant 'very important' for US, PH -Trump",
    "description": "United States President Donald Trump underscored the strategic importance of the proposed ammunition manufacturing facility in Subic Bay in Zambales, saying it would boost both Philippine defense capabilities and US military readiness.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250723-pna01.htm",
    "timestamp": "2025-07-23T07:57:57Z"
  },
  {
    "title": "Trump's Deadline For A Deal Looms Over Expected Ukraine-Russia Peace Talks",
    "description": "Ukrainian and Russian delegations are expected to meet this week for peace talks, the third round in a series of negotiations that began on May 16 - and the first since US President Donald Trump threatened to impose new sanctions on Moscow if it doesn't reach…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250722-rferl02.htm",
    "timestamp": "2025-07-23T07:57:57Z"
  },
  {
    "title": "U.S. exits UNESCO again, agency calls move \"regrettable\" but \"expected\"",
    "description": "The United States announced Tuesday its decision to pull out of the United Nations Educational, Scientific and Cultural Organization two years after rejoining.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250723-pdo02.htm",
    "timestamp": "2025-07-23T07:57:41Z"
  },
  {
    "title": "U.S. withdrawal contradicts fundamental principles of multilateralism: UNESCO head",
    "description": "Audrey Azoulay, director-general of the United Nations Educational, Scientific and Cultural Organization (UNESCO) said on Tuesday that U.S. withdrawal from UNESCO contradicts the fundamental principles of multilateralism.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250723-pdo03.htm",
    "timestamp": "2025-07-23T07:57:41Z"
  },
  {
    "title": "UN laments US withdrawal from educational and cultural agency",
    "description": "The United States announced on Tuesday that it will leave the UN Educational, Scientific and Cultural Organization (UNESCO), which will take effect at the end of December 2026.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250722-unnews05.htm",
    "timestamp": "2025-07-23T07:57:41Z"
  },
  {
    "title": "Araghchi says Iran will not give up its right to enrichment",
    "description": "Iran's Foreign Minister Abbas Araghchi has emphasized that the country has no intention of abandoning its nuclear program, including uranium enrichment, despite recent military aggression by the United States and its regional ally, Israel.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250722-presstv05.htm",
    "timestamp": "2025-07-23T07:57:40Z"
  },
  {
    "title": "CNBC's The China Connection newsletter: Beijing has more to worry about than just deflation",
    "description": "The key issue, economists say, is boosting productivity, something that requires a change in government incentives.",
    "link": "https://www.cnbc.com/2025/07/23/cnbc-china-connection-newsletter-beijing-has-more-to-worry-about-than-deflation.html",
    "timestamp": "2025-07-23T07:54:31Z"
  },
  {
    "title": "Iran ready for war with Israel, will not halt nuclear programme: Pezeshkian",
    "description": "In his first TV interview since the war, Iran's president insists Tehran's uranium enrichment programme will continue.",
    "link": "https://www.aljazeera.com/news/2025/7/23/iran-ready-for-war-with-israel-will-not-halt-nuclear-programme-pezeshkian",
    "timestamp": "2025-07-23T07:48:47Z"
  },
  {
    "title": "China Reacts to Trump's UNESCO Decision",
    "description": "The Trump Administration conducted a review of U.S. participation in the UN agency.",
    "link": "https://www.newsweek.com/china-trump-unesco-us-2102743",
    "timestamp": "2025-07-23T07:46:56Z"
  },
  {
    "title": "Shares in Japanese, South Korean automakers surge on Tokyo trade deal",
    "description": "Shares of Japanese and South Korean automakers surged on Wednesday after U.S. President Donald Trump agreed to a trade deal with Tokyo that included reducing tariffs on Japanese auto imports to 15%, a move that stoked optimism about a similar agreement for Se…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/shares-in-japanese-south-korean-automakers-surge-on-tokyo-trade-deal/articleshow/122854221.cms",
    "timestamp": "2025-07-23T07:44:08Z"
  },
  {
    "title": "Japanese exporters hit with 15pc tariff as US trade deal struck",
    "description": "President Donald Trump reached a trade deal with Japan that will impose 15pc tariffs on imports including automobiles from the key American ally, while creating a $550bn fund to make investments in the US.",
    "link": "https://www.independent.ie/business/world/japanese-exporters-hit-with-15pc-tariff-as-us-trade-deal-struck/a1686043165.html",
    "timestamp": "2025-07-23T07:43:59Z"
  },
  {
    "title": "European shares rise on US-Japan trade deal, EU talks in focus",
    "description": "European stock markets saw gains, especially in the automobile sector. This followed positive signals from US President Donald Trump regarding potential trade agreements with the European Union. The optimism was fueled by a trade deal with Japan. Porsche and …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-on-us-japan-trade-deal-eu-talks-in-focus/articleshow/122854208.cms",
    "timestamp": "2025-07-23T07:43:22Z"
  },
  {
    "title": "European auto shares rally after US-Japan trade deal",
    "description": "Shares in major European carmakers rose on Wednesday, tracking a steep rally in some of their Asian rivals, after Tokyo struck a trade deal with the United States, fuelling optimism for a similar agreement with Europe.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-auto-shares-rally-after-us-japan-trade-deal/articleshow/122854144.cms",
    "timestamp": "2025-07-23T07:40:47Z"
  },
  {
    "title": "'Kimmel' Guest Host Fortune Feimster Has Practical Question About Trump's New Threat",
    "description": "The actor/comic has a vested interest in the answer to this one.",
    "link": "https://www.huffpost.com/entry/fortune-feimster-kimmel-trump_n_68807e14e4b0f277db450e72",
    "timestamp": "2025-07-23T07:40:00Z"
  },
  {
    "title": "Trump Border Czar Blasts Hunter Biden: 'Former First Drug Addict'",
    "description": "Tom Homan has dismissed Hunter Biden and vowed to \"flood the zone\" with immigration agents in \"sanctuary cities.\"",
    "link": "https://www.newsweek.com/hunter-biden-tom-homan-first-drug-addict-2102714",
    "timestamp": "2025-07-23T07:37:05Z"
  },
  {
    "title": "Japan's Nikkei soars to one-year peak on trade deal; bonds slide",
    "description": "Japanese auto stocks surged, leading the Nikkei to a one-year high after a U.S. trade deal reduced import levies to 15%. Toyota soared 14%. Trade clarity bolstered expectations for Bank of Japan rate hikes, pushing JGB yields to levels unseen since 2008.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-soars-to-one-year-peak-on-trade-deal-bonds-slide/articleshow/122853954.cms",
    "timestamp": "2025-07-23T07:31:41Z"
  },
  {
    "title": "Pedro Pascal vows never to go clean-shaven again after his ‘appalling’ Wonder Woman 1984 appearance",
    "description": "Actor played villain Maxwell Lord in the DC Comics movie",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/pedro-pascal-wonder-woman-1984-facial-hair-b2794257.html",
    "timestamp": "2025-07-23T07:25:32Z"
  },
  {
    "title": "Taiwan Aims to Strike Agreement with US in New Round of Talks",
    "description": "Taiwan’s trade negotiators have arrived in the US for tariff talks to clinch a deal with President Donald Trump’s team, according to a person familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/taiwan-aims-to-strike-agreement-with-us-in-new-round-of-talks",
    "timestamp": "2025-07-23T07:25:20Z"
  },
  {
    "title": "US-Japan trade deal signed: Here’s what you need to know",
    "description": "U.S. President Donald Trump and Japanese Prime Minister Shigeru Ishiba have struck a trade deal that imposes a 15% tariff on Japanese imports and includes a major Japanese investment pledge in the U.S. (Source: Reuters) Trump–Ishiba Trade Deal Announced",
    "link": "https://m.economictimes.com/markets/stocks/news/us-japan-trade-deal-signed-heres-what-you-need-to-know/trumpishiba-trade-deal-announced/slideshow/122854125.cms",
    "timestamp": "2025-07-23T07:23:12Z"
  },
  {
    "title": "Coca-Cola confirms a cane-sugar version of its trademark cola is coming to U.S.",
    "description": "Coca-Cola said Tuesday it will add a cane-sugar version of its trademark cola to its U.S. lineup this fall, confirming a recent announcement by President Donald Trump. Trump said in a social media post last week that Coca-Cola had agreed to use real cane suga…",
    "link": "https://japantoday.com/category/business/coca-cola-reports-weakening-global-sales-volumes-in-second-quarter1",
    "timestamp": "2025-07-23T07:19:43Z"
  },
  {
    "title": "Reaction to U.S. trade deal with Japan",
    "description": "President Donald Trump said the U.S. and Japan have struck a deal that will lower the hefty tariffs Trump had threatened to impose on goods from its Asian ally while extracting commitments for Japan to invest $550 billion in the U.S. and open its markets to A…",
    "link": "https://japantoday.com/category/business/reaction-to-u.s.-trade-deal-with-japan5",
    "timestamp": "2025-07-23T07:18:53Z"
  },
  {
    "title": "Tata Motors, Maruti shares advance up to 3% as US-Japan trade deal revives hopes for India–US pact",
    "description": "Tata Motors climbed 2.9% to ₹692.95 on the BSE, while Maruti Suzuki added 1.7% to reach ₹12,715.05. Mahindra & Mahindra rose 1.3%, hitting an intraday peak of ₹3,302.90.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-maruti-shares-advance-up-to-3-as-us-japan-trade-deal-revives-hopes-for-indiaus-pact/articleshow/122853401.cms",
    "timestamp": "2025-07-23T07:09:06Z"
  },
  {
    "title": "TRUMP IMPLODING as Republicans shut down Congress to flee Epstein mess",
    "description": "Donald Trump is desperate for any distraction he can find to try to take the public's mind off of his close relationship with Jeffrey ...",
    "link": "https://biztoc.com/x/c473e63d23fbc7d4",
    "timestamp": "2025-07-23T07:07:46Z"
  },
  {
    "title": "Europe opens higher with trade deals in focus",
    "description": "Major European stock markets opened higher on Wednesday after United States President Donald Trump announced his country's trade deal with Japan, which lowered the intended tariff on Japanese goods to...",
    "link": "https://biztoc.com/x/e854ce34b37216ae",
    "timestamp": "2025-07-23T07:06:56Z"
  },
  {
    "title": "BOJ deputy chief signals further rate hikes",
    "description": "One of the Bank of Japan's deputy chiefs on Wednesday reiterated the bank's readiness to pursue a path toward monetary normalization if the Japanese economy and inflation move in line with expectations, while noting uncertainties regarding U.S. tariffs. &quot…",
    "link": "https://japantoday.com/category/business/boj-deputy-chief-signals-further-rate-hikes",
    "timestamp": "2025-07-23T07:06:11Z"
  },
  {
    "title": "Tokyo's Nikkei leads Asian rally after Japan-US trade deal",
    "description": "Tokyo stocks rallied with the yen Wednesday after Japan and the United States finally hammered out a trade deal to slash Donald Trump's tariffs, including those on the crucial car sector. Investors were also cheered by news that Washington had reached agreeme…",
    "link": "https://japantoday.com/category/business/tokyo%27s-nikkei-leads-asian-rally-after-japan-us-trade-deal",
    "timestamp": "2025-07-23T07:05:02Z"
  },
  {
    "title": "Who could replace Japan's Ishiba as leader of the ruling party?",
    "description": "Japan's Prime Minister Shigeru Ishiba plans to announce his resignation by the end of next month, media said on Wednesday, following a bruising defeat in an upper house election. That step would trigger a leadership race in his Liberal Democratic Party (LDP),…",
    "link": "https://japantoday.com/category/politics/factbox-who-could-replace-japan%27s-ishiba-as-leader-of-the-ruling-party",
    "timestamp": "2025-07-23T07:03:19Z"
  },
  {
    "title": "Japan PM Ishiba to announce resignation next month, Mainichi says",
    "description": "Japanese Prime Minister Shigeru Ishiba plans to announce his resignation by the end of next month, the Mainichi newspaper reported on Wednesday. Ishiba is facing growing opposition from within his Liberal Democratic Party for his vow to stay in power despite …",
    "link": "https://japantoday.com/category/politics/japan-pm-ishiba-to-announce-resignation-next-month-mainichi-says",
    "timestamp": "2025-07-23T07:02:30Z"
  },
  {
    "title": "Trump Announces Japan Trade Deal With Lowered Tariffs Of 15%—Toyota And Honda Lead Surge In Japanese Stocks",
    "description": "Trump initially threatened a 25% tariff rate for Japan that would have gone into effect in August.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/07/23/trump-announces-japan-trade-deal-with-lowered-tariffs-of-15-toyota-and-honda-lead-surge-in-japanese-stocks/",
    "timestamp": "2025-07-23T07:01:36Z"
  },
  {
    "title": "Trump announces 'massive' Japan trade deal including 15% tariff",
    "description": "US President Donald Trump announced Tuesday a &quot;massive&quot; trade deal with Japan, cutting a threatened 25-percent tariff to 15 percent ahead of an August 1 deadline. Trump has vowed to hit dozens of countries with punitive tariffs if they don't strike …",
    "link": "https://japantoday.com/category/politics/trump-announces-%27massive%27-japan-trade-deal-including-15-tariff",
    "timestamp": "2025-07-23T07:01:11Z"
  },
  {
    "title": "Is Coca-Cola with cane sugar worth it? Bay Area health, business experts weigh in",
    "description": "Local health and business experts are weighing in on whether the new cane-sugar-sweetened version of Coca-Cola is worth it.",
    "link": "https://www.fox13news.com/news/is-coca-cola-cane-sugar-worth-it-bay-area-health-business-experts-weigh",
    "timestamp": "2025-07-23T07:00:43Z"
  },
  {
    "title": "The 8 at 8: Wednesday",
    "description": "Chinese surveillance equipment is use in Ireland, trade deal between the US and Japan, and warning of ‘mass starvation’ in Gaza.",
    "link": "https://www.thejournal.ie/8-at-8-23-07-25-6770872-Jul2025/",
    "timestamp": "2025-07-23T07:00:09Z"
  },
  {
    "title": "The Leadership Skills Scientists Need Right Now",
    "description": "The Leadership Skills Scientists Need Right Now\n\n \n\n\n \nkathryn.palmer…\n\nWed, 07/23/2025 - 03:00 AM\n\nJen Heemstra, chair of the chemistry department at Wash U. in St. Louis and author of a forthcoming book on leadership for scientists, has some advice for navi…",
    "link": "https://www.insidehighered.com/news/government/science-research-policy/2025/07/23/leadership-skills-scientists-need-right-now",
    "timestamp": "2025-07-23T07:00:00Z"
  },
  {
    "title": "Billionaire LA Times owner announces he’s taking the newspaper public",
    "description": "Billionaire Los Angeles Times owner Dr. Patrick Soon-Shiong announced on Monday that he would be taking the newspaper public sometime in the next year, calling it a move to democratize the paper.",
    "link": "https://nypost.com/2025/07/23/media/la-times-owner-patrick-soon-shiong-announces-newspaper-going-public/",
    "timestamp": "2025-07-23T06:59:51Z"
  },
  {
    "title": "Dubai-based NRI Siddharth Balachandran announces ₹500 cr Kerala Investment Fund",
    "description": "Siddharth Balachandran proposes a ₹500 crore Kerala Investment Fund to support sustainable growth, praising SEBI and India’s shift towards domestic investor strength.",
    "link": "https://www.thehindubusinessline.com/news/national/dubai-based-nri-siddharth-balachandran-announces-500-cr-kerala-investment-fund/article69845557.ece",
    "timestamp": "2025-07-23T06:59:40Z"
  },
  {
    "title": "Japan says forex not included in trade deal with US, Kyodo reports",
    "description": "TOKYO :Japanese Finance Minister Katsunobu Kato said the bilateral trade deal with the United States did not include reference to foreign exchange rates, Kyodo news agency reported on Wednesday.Kato made the remarks to reporters at Japan's Ministry of Finance…",
    "link": "https://www.channelnewsasia.com/business/japan-says-forex-not-included-in-trade-deal-us-kyodo-reports-5253626",
    "timestamp": "2025-07-23T06:57:06Z"
  },
  {
    "title": "Trump's favorability fell among AAPI adults, poll finds",
    "description": "A recent poll reveals growing disapproval of Donald Trump among Asian Americans, Native Hawaiians, and Pacific Islanders. Rising costs and tariff policies are major concerns. Independent voters within this group show a significant shift in opinion. Many fear …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-favorability-fell-among-aapi-adults-poll-finds/articleshow/122853035.cms",
    "timestamp": "2025-07-23T06:51:57Z"
  },
  {
    "title": "European stocks poised to surge as US-Japan trade deal struck",
    "description": "Trump says EU representatives will arrive for negotiations on Wednesday",
    "link": "https://www.irishtimes.com/business/markets/2025/07/23/european-stocks-poised-to-surge-as-us-japan-trade-deal-struck/",
    "timestamp": "2025-07-23T06:51:51Z"
  },
  {
    "title": "Trump says Japan, US to form LNG joint venture",
    "description": "Donald Trump announced a joint venture with Japan for an Alaska LNG project. The project involves a pipeline and liquefaction plant. However, a Japanese government official stated unawareness of these plans. Several Japanese companies, including JERA and Toky…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-japan-us-to-form-lng-joint-venture/articleshow/122852989.cms",
    "timestamp": "2025-07-23T06:50:38Z"
  },
  {
    "title": "Equinor’s Quarterly Profit Drops 19% on Weak Oil, LNG Outage",
    "description": "Equinor ASA’s quarterly profit declined 19% on softer oil prices and a prolonged outage at its LNG facility in northern Norway.",
    "link": "https://financialpost.com/pmn/business-pmn/equinors-quarterly-profit-drops-19-on-weak-oil-lng-outage",
    "timestamp": "2025-07-23T06:44:35Z"
  },
  {
    "title": "Over 100 aid groups call for Israel to stop starving Gazans; UN chief hits out at ‘horror show’ as 80 children die of hunger",
    "description": "More than 100 largely aid and rights groups on Wednesday called for governments to take action as hunger spreads in Gaza, including by demanding an immediate and permanent ceasefire and the lifting of all restrictions on the flow of humanitarian aid.",
    "link": "https://www.independent.ie/world-news/middle-east/over-100-aid-groups-call-for-israel-to-stop-starving-gazans-un-chief-hits-out-at-horror-show-as-80-children-die-of-hunger/a553431510.html",
    "timestamp": "2025-07-23T06:42:22Z"
  },
  {
    "title": "Babbles: Baluatar turns into Greater University",
    "description": "By Babbler Baluatar, the official residence of the Prime Minister, can be a venue for political activities; however, it has […]\nThe post Babbles: Baluatar turns into Greater University appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/07/23/babbles-baluatar-turns-into-greater-university/",
    "timestamp": "2025-07-23T06:35:00Z"
  },
  {
    "title": "CNBC Daily Open: Japan markets rally on the country's 15% tariff rate — it's a new era of trade",
    "description": "In comparison with the 25% tariff Trump slapped on Tokyo earlier this month, a 15% tariff seems like a big improvement.",
    "link": "https://www.cnbc.com/2025/07/23/cnbc-daily-open-japan-markets-rally-on-the-countrys-15percent-tariff-rate.html",
    "timestamp": "2025-07-23T06:30:01Z"
  },
  {
    "title": "European auto shares rally after US-Japan trade deal",
    "description": "Shares in major European carmakers rose on Wednesday, tracking a steep rally in some of their Asian rivals, after Tokyo struck a trade deal with the United States, fuelling optimism for a similar agreement with Europe.Shares in Japanese and South Korean autom…",
    "link": "https://www.channelnewsasia.com/business/european-auto-shares-rally-after-us-japan-trade-deal-5253616",
    "timestamp": "2025-07-23T06:29:44Z"
  },
  {
    "title": "US Tracks Russian Military Jet Near Alaska",
    "description": "NORAD said it had detected the military aircraft.",
    "link": "https://www.newsweek.com/russian-military-jet-us-alaska-norad-2102722",
    "timestamp": "2025-07-23T06:19:54Z"
  },
  {
    "title": "Joe Biden’s son hits out at George Clooney for ‘undermining’ his father",
    "description": "Former US president Joe Biden’s son Hunter has hit out at actor and Democratic Party donor George Clooney’s decision to call on the elder Biden to abandon his 2024 re-election bid.",
    "link": "https://www.independent.ie/world-news/north-america/joe-bidens-son-hits-out-at-george-clooney-for-undermining-his-father/a87175714.html",
    "timestamp": "2025-07-23T06:12:58Z"
  },
  {
    "title": "Trump announces 'massive' trade deal with Japan",
    "description": "Donald Trump announced on July 22 a \"massive\" trade deal with Japan, marking a key breakthrough for major U.S. trade partners as they scramble to strike agreements before the end of the month.",
    "link": "https://www.hurriyetdailynews.com/trump-announces-massive-trade-deal-with-japan-211757",
    "timestamp": "2025-07-23T06:11:39Z"
  },
  {
    "title": "Europe set to open higher amid trade optimism",
    "description": "Major stock exchanges in Europe traded higher in the premarket on Wednesday, following the announcement of a trade deal between the United States and Japan. US President Donald Trump also announced th...",
    "link": "https://biztoc.com/x/921bd1ecc8eea29f",
    "timestamp": "2025-07-23T06:11:24Z"
  },
  {
    "title": "Trump's Golden Dome looks for alternatives to Musk's SpaceX",
    "description": "The administration of U.S. President Donald Trump is expanding its search for partners to build the Golden Dome missile defense system, courting Amazon's Project Kuiper and big defense contractors as tensions with billionaire Elon Musk threaten SpaceX's domin…",
    "link": "https://biztoc.com/x/ffaa56dafcc4aff0",
    "timestamp": "2025-07-23T06:11:10Z"
  },
  {
    "title": "Trump says Japan, US to form LNG joint venture",
    "description": "TOKYO :U.S. President Donald Trump said on Tuesday that Japan will form a joint venture to develop a liquefied natural gas project in Alaska though a Japanese government official said he was not aware of such plans. It was not immediately clear whether Trump …",
    "link": "https://www.channelnewsasia.com/business/trump-says-japan-us-form-lng-joint-venture-5253591",
    "timestamp": "2025-07-23T06:10:13Z"
  },
  {
    "title": "Trump says Japan, US to form LNG joint venture",
    "description": "TOKYO (Reuters) -U.S. President Donald Trump said on Tuesday that Japan will form a joint venture to develop a liquefied natural gas project in Alaska though...",
    "link": "https://finance.yahoo.com/news/trump-says-japan-us-form-061013015.html",
    "timestamp": "2025-07-23T06:10:13Z"
  },
  {
    "title": "Democrats fan Epstein flames",
    "description": "It’s the fixation of Washington. Now Democrats from coast to coast are plotting how to capitalize on the Jeffrey Epstein saga. An ongoing furor around the government’s investigation of the disgraced financier has done more than fracture President Donald Trump…",
    "link": "https://freerepublic.com/focus/f-chat/4330219/posts",
    "timestamp": "2025-07-23T06:10:00Z"
  },
  {
    "title": "Trump's Golden Dome looks for alternatives to Musk's SpaceX",
    "description": "The shift comes amid a deteriorating relationship between the U.S. president and the billionaire entrepreneur.",
    "link": "https://www.japantimes.co.jp/business/2025/07/23/tech/trump-golden-dome-musk-spacex/",
    "timestamp": "2025-07-23T06:07:00Z"
  },
  {
    "title": "Australian energy giant ditches US plant as Trump attacks green power",
    "description": "Woodside has scrapped plans to build a low-carbon fuel plant as the energy sector assesses Donald Trump’s decision to dismantle support for renewables.",
    "link": "https://www.smh.com.au/business/companies/australian-energy-giant-ditches-us-plant-as-trump-attacks-green-power-20250723-p5mh73.html",
    "timestamp": "2025-07-23T06:05:55Z"
  },
  {
    "title": "​BOJ walks a tightrope between inflation and trade worries",
    "description": "Bank of Japan Deputy Governor Shinichi Uchida, in a speech to business leaders in Kochi, said that risks to economic activity and prices remain tilted to the downside. He cited  extremely high  uncertainty over global trade policy as a key reason for the BOJ’…",
    "link": "https://m.economictimes.com/markets/stocks/news/boj-walks-a-tightrope-between-inflation-and-trade-worries/bojs-outlook-under-uncertainty/slideshow/122852871.cms",
    "timestamp": "2025-07-23T06:05:24Z"
  },
  {
    "title": "Merz and Macron’s bromance loses momentum",
    "description": "In today’s edition of The Capitals, read about Zelenskyy's anti-corruption shake-up, the EU’s possible responses to Trump tariffs, Denmark’s immigration minister taking aim at Angela Merkel, and a new Competitiveness Alliance with Japan.",
    "link": "https://www.euractiv.com/section/politics/news/the-capitals-merz-and-macrons-bromance-loses-momentum/",
    "timestamp": "2025-07-23T06:03:17Z"
  },
  {
    "title": "China says raised 'solemn representations' with EU over Russia sanctions",
    "description": "China's commerce minister has expressed strong objections to the EU's decision to include two Chinese banks in its latest round of sanctions against Russia, following Moscow's actions in Ukraine. This development occurred ahead of crucial talks in Beijing bet…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-says-raised-solemn-representations-with-eu-over-russia-sanctions/articleshow/122851766.cms",
    "timestamp": "2025-07-23T06:01:59Z"
  },
  {
    "title": "Trump accuses Obama of ‘treason’ over 2016 election in stunning attack",
    "description": "Comments by Trump, mired in the Epstein files controversy, linking former president to Russian interference are ‘weak attempt at distraction’, says Obama",
    "link": "https://www.irishtimes.com/world/us/2025/07/23/trump-accuses-obama-of-treason-over-2016-election-in-stunning-attack/",
    "timestamp": "2025-07-23T06:01:01Z"
  },
  {
    "title": "SharpLink Acquires 79,949 Ethereum, Expands Treasury to 360,807 ETH",
    "description": "SharpLink Gaming, a Nasdaq-listed company chaired by Ethereum co-founder Joseph Lubin, has increased its Ethereum (ETH) reserves by nearly 30% in a strategic treasury move. The company acquired 79,949 ETH between July 14 and July 20 at an average price of $3,…",
    "link": "https://bitcoinist.com/sharplink-acquires-eth-expands-treasury-ethereum/",
    "timestamp": "2025-07-23T06:00:43Z"
  },
  {
    "title": "Trump announces trade deal with Japan that lowers threatened tariff to 15%",
    "description": "Trump announces trade deal with Japan that lowers threatened tariff to 15%\nPresident Donald Trump has announced a trade framework with Japan, placing a 15% tax on goods imported from that nation\nWASHINGTON -- President Donald Trump announced a trade framework…",
    "link": "https://biztoc.com/x/7a3cba2b5c707e81",
    "timestamp": "2025-07-23T06:00:22Z"
  },
  {
    "title": "Trump announces trade deal with Japan that lowers threatened tariff to 15%",
    "description": "Trump announces trade deal with Japan that lowers threatened tariff to 15%\nPresident Donald Trump has announced a trade framework with Japan, placing a 15% tax on goods imported from that nation\nWASHINGTON -- President Donald Trump announced a trade framework…",
    "link": "https://biztoc.com/x/7a3cba2b5c707e81",
    "timestamp": "2025-07-23T06:00:22Z"
  },
  {
    "title": "Brexit trade meetings remain a state secret",
    "description": "Secrecy maintained over the extent to which Britain is willing to abandon environmental and consumer protections to secure trade deals after Brexit.",
    "link": "https://theecologist.org/2025/jul/23/brexit-trade-meetings-remain-state-secret",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Iranian lawmaker warns: Tehran ready to exit nuclear treaty if Western powers reimpose sanctions",
    "description": "Iran is prepared to withdraw from the NPT if the U.K., France and Germany trigger a sanctions snapback. This move would remove international restrictions on Iran’s uranium enrichment activities. If Iran exits the NPT, it could enrich uranium to 90 percent pur…",
    "link": "https://www.naturalnews.com/2025-07-23-iranian-lawmaker-tehran-ready-to-exit-nuclear-treaty.html",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Will Bitcoin will soar past $200,000 within five years?",
    "description": "The financial world is holding its breath as Bitcoin teeters on the edge of another historic rally—or a sobering correction. Glassnode lead analyst James Check, a voice of tempered optimism, predicts Bitcoin will soar past $200,000 within five years, but warn…",
    "link": "https://www.naturalnews.com/2025-07-23-bitcoin-will-soar-past-200000-within-five-years.html",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Trump administration unveils secret MLK assassination files amid calls for transparency and respect",
    "description": "President Donald Trump declassifies over 230,000 pages of records related to Dr. Martin Luther King Jr.’s 1968 assassination. Director of National Intelligence Tulsi Gabbard spearheads the release, calling it a “long-overdue reckoning” with federal transparen…",
    "link": "https://www.naturalnews.com/2025-07-23-trump-admin-unveils-secret-mlk-assassination-files.html",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Trump warns BRICS over dollar challenge, threatens 10% TARIFF on member nations",
    "description": "President Donald Trump warned that BRICS nations would face a 10 percent tariff on all imports if they continue efforts to weaken the U.S. dollar’s global dominance. Trump called the U.S. dollar a critical strategic asset, likening its loss as the world’s res…",
    "link": "https://www.naturalnews.com/2025-07-23-trump-threatens-tariffs-on-brics-member-nations.html",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Trump concedes to lower 25% tariff on Japanese imports in flawed trade deal",
    "description": "President Trump reduces 25% tariff on Japanese imports to 15%, part of a deal to open Japan’s market to U.S. cars and rice, drawing skepticism from trade experts. The deal is hailed as a victory by the Trump administration but is criticized for potentially fa…",
    "link": "https://www.naturalnews.com/2025-07-23-trump-concedes-to-lower-25-tariff-on-japanese-imports.html",
    "timestamp": "2025-07-23T06:00:00Z"
  },
  {
    "title": "Stephen Colbert Hits Trump Over 'Insane' Video",
    "description": "The \"Late Show\" host spotted a bizarre message on the president's social media feed.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-obama-video_n_688065fde4b0a3d10a1f71b8",
    "timestamp": "2025-07-23T05:57:32Z"
  },
  {
    "title": "Japanese car stocks soar as Trump announces countries have come to 'massive' trade deal",
    "description": "The breakthrough makes Japan one of five countries to have signed an agreement.",
    "link": "https://www.thejournal.ie/trump-japan-trade-deal-6770842-Jul2025/",
    "timestamp": "2025-07-23T05:56:36Z"
  },
  {
    "title": "Winning Hearts and Minds",
    "description": "Most days, in the heart of Pennsylvania’s Bible Belt, the old sanctuary at Christ Lutheran Church sits empty. Decades ago, it was home to a congregation of 3,000 people. By the late 1990s, that number had dwindled to seven. At the turn of the millennium, Jody…",
    "link": "https://www.counterpunch.org/?p=372227",
    "timestamp": "2025-07-23T05:56:12Z"
  }
]