[
  {
    "title": "Federal funding cuts ripple through the heart of Trump country",
    "description": "Trey Yates' butter business faces ruin due to federal funding cuts affecting the Local Food Purchase Assistance Cooperative Agreement Program. The government's budget reduction impacts small agricultural businesses and food banks in West Virginia, a state hea…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/federal-funding-cuts-ripple-through-the-heart-of-trump-country/articleshow/119705635.cms",
    "timestamp": "2025-03-29T11:17:25Z"
  },
  {
    "title": "India, US officials wrap up talks on proposed trade pact: sources",
    "description": "India and US officials conclude talks on proposed bilateral trade agreement, aiming to double trade to USD 500 billion by 2030.",
    "link": "https://www.thehindubusinessline.com/economy/policy/india-us-officials-wrap-up-talks-on-proposed-trade-pact-sources/article69389764.ece",
    "timestamp": "2025-03-29T11:17:18Z"
  },
  {
    "title": "The U.S. is on an egg hunt in Europe to ease prices at home",
    "description": "The U.S. government is on a global egg hunt, seeking exports from countries in Europe and elsewhere to ease a severe shortage that has caused egg prices at grocery stores to hit record highs.",
    "link": "https://www.nbcnews.com/news/world/us-egg-hunt-europe-ease-prices-home-rcna198694",
    "timestamp": "2025-03-29T11:12:56Z"
  },
  {
    "title": "Elon Musk sells X to his own xAI for $33 billion in all-stock deal",
    "description": "Elon Musk has sold social media site X to his own xAI artificial intelligence company in a $33 billion all-stock deal, the billionaire announced on Friday.",
    "link": "https://techxplore.com/news/2025-03-elon-musk-xai-billion-stock.html",
    "timestamp": "2025-03-29T11:12:15Z"
  },
  {
    "title": "Tesla owner sues for $1 million after car keyed at DFW Airport",
    "description": "A Dallas County resident is suing for $1 million in damages after a man keyed his Tesla while it was parked at DFW International Airport.\nJeff Nguyen,...",
    "link": "https://www.dallasnews.com/business/autos/2025/03/29/tesla-owner-sues-for-1-million-after-car-keyed-at-dfw-airport/",
    "timestamp": "2025-03-29T11:07:59Z"
  },
  {
    "title": "The cockiest thing Trump has done so far",
    "description": "President Donald Trump speaks to the press in the Oval Office on March 26, 2025. | Win McNamee/Getty Images\nAll nine of the Supreme Court justices are lawyers. All of them have friends and law school classmates in private practice. All of them sit at the apex…",
    "link": "https://biztoc.com/x/24d05754520cdcd7",
    "timestamp": "2025-03-29T11:06:21Z"
  },
  {
    "title": "Pain of tariffs extends beyond autos, though those stocks are hurting",
    "description": "The announcements by President Donald Trump on Wednesday rattled investors.",
    "link": "https://www.freep.com/story/money/business/michigan/2025/03/29/pain-of-tariffs-extends-beyond-autos-though-those-stocks-are-hurting/82688687007/",
    "timestamp": "2025-03-29T11:01:38Z"
  },
  {
    "title": "Trump’s southern border military mission cost over $300 million in first 6 weeks | CNN Politics",
    "description": "The Trump administration’s major military mission at the southern border focused on reducing immigration and drug flows has already cost taxpayers more than $300 million, according to sources briefed on data from the Defense Department comptroller — even as t…",
    "link": "https://www.cnn.com/2025/03/29/politics/trump-southern-border-military-mission-cost/index.html",
    "timestamp": "2025-03-29T11:00:36Z"
  },
  {
    "title": "Elon Musk has sold X for $45 billion",
    "description": "Elon Musk has sold social media site X, formerly Twitter, for $45 billion to xAI, known for their Grok chatbot",
    "link": "https://www.ladbible.com/news/twitter/elon-musk-twitter-x-sells-45-billion-953989-20250329",
    "timestamp": "2025-03-29T11:00:12Z"
  },
  {
    "title": "NP View: Mark Carney is a mirage",
    "description": "Plagiarism accusations only the latest evidence he's been oversold",
    "link": "https://nationalpost.com/opinion/np-view-mark-carney-is-a-mirage",
    "timestamp": "2025-03-29T11:00:08Z"
  },
  {
    "title": "Male CNN Panelist Gets Expertly Shut Down For Touching A Woman — And For Good Reason",
    "description": "Angela Rye's remarks to Kevin O'Leary on air are striking a chord online. Here's why experts think the exchange actually said a lot.",
    "link": "https://www.huffpost.com/entry/male-cnn-panelist-gets-expertly-shut-down-for-touching-a-woman-and-for-good-reason-ano_l_67e59b4ee4b0a29e9d25e49f",
    "timestamp": "2025-03-29T11:00:04Z"
  },
  {
    "title": "Links 3/29/2025",
    "description": "Our strategic daily links: CDC hides measles warning, Gates food fail, Myanmar quake, Canada divorces US, European strategic minerals scramble, moar stealth bombers to Diego Garcia, draconian US \"minerals deal\" a ruse to end support? Trump stalled on CFPB + s…",
    "link": "https://www.nakedcapitalism.com/2025/03/links-3-29-2025.html",
    "timestamp": "2025-03-29T10:55:02Z"
  },
  {
    "title": "Veteran fund manager sees sharp impact from Trump car tariffs",
    "description": "It was Matthew McConaughey who told us that sometimes you gotta go back to actually move forward.\nThe actor made this astute observation in a 2014 commercial for Ford's (F) Lincoln, which is one of the many car companies likely to feel the impact of President…",
    "link": "https://biztoc.com/x/4f3fb0f2d3449978",
    "timestamp": "2025-03-29T10:44:10Z"
  },
  {
    "title": "Trump’s FCC commissioner opens investigation into Walt Disney Co. and ABC for diversity policies",
    "description": "President Donald Trump’s FCC commissioner said Friday he’s opening an investigation into the Walt Disney Co. and its ABC television network to see whether they are “promoting invidious forms of DEI discrimination.” FCC Commissioner Brendan Carr announced the …",
    "link": "https://freerepublic.com/focus/f-news/4307494/posts",
    "timestamp": "2025-03-29T10:43:22Z"
  },
  {
    "title": "Will the earthquake bring the fall of Myanmar's dictator?",
    "description": "As they count the cost of this massive earthquake, the people of Myanmar will be hoping for a silver lining, that the disaster may hasten the fall of their despised dictator.",
    "link": "https://news.sky.com/story/myanmar-earthquake-will-it-hasten-the-fall-of-general-min-aung-hlaing-13337736",
    "timestamp": "2025-03-29T10:42:00Z"
  },
  {
    "title": "This is the first major disaster to suffer the brunt of Trump's devastating cuts",
    "description": "This will be the first natural disaster to happen after President Donald Trump shut down America's international aid agency with potentially devastating consequences.",
    "link": "https://news.sky.com/story/the-myanmar-quake-is-the-first-major-disaster-to-suffer-the-brunt-of-donald-trumps-devastating-cuts-13337736",
    "timestamp": "2025-03-29T10:42:00Z"
  },
  {
    "title": "With new subsidies, US states vie for future of small nuclear reactors",
    "description": "Public and private investments from major tech companies like Amazon and Google are driving interest as states enact legislation to promote nuclear energy.",
    "link": "https://www.thehindubusinessline.com/news/world/with-new-subsidies-us-states-vie-for-future-of-small-nuclear-reactors/article69389702.ece",
    "timestamp": "2025-03-29T10:38:20Z"
  },
  {
    "title": "Elon Musk to step down from DOGE after $1 trillion deficit reduction. Here’s what he said",
    "description": "Elon Musk announced he will leave his role in the Trump administration at the end of May after leading a $1 trillion deficit reduction as head of the Department of Government Efficiency (DOGE). DOGE claims it has saved Americans $130 billion so far. Tech bill…",
    "link": "https://freerepublic.com/focus/f-news/4307493/posts",
    "timestamp": "2025-03-29T10:37:58Z"
  },
  {
    "title": "Trump's election order tees up DOGE for familiar voter file fight",
    "description": "When President Donald Trump signed a sprawling election executive order this week, he set up his administration for a lengthy fight over documentary proof of citizenship, the power of the executive branch and existing federal election law.",
    "link": "https://biztoc.com/x/a9bd186adaf602f9",
    "timestamp": "2025-03-29T10:33:20Z"
  },
  {
    "title": "Yemen pounded by fresh US strikes targeting Houthi rebels",
    "description": "Attacks followed intense air strikes on Friday compared to other days in campaign that began on March 15th",
    "link": "https://www.irishtimes.com/world/middle-east/2025/03/29/united-states-houthi-yemen-strikes/",
    "timestamp": "2025-03-29T10:29:40Z"
  },
  {
    "title": "Donald Trump ‘is going to prison’, president’s ex-advisor warns",
    "description": "Donald Trump ‘is going to prison’, president’s ex-advisor warnspennlive.com",
    "link": "https://www.pennlive.com/news/2025/03/donald-trump-is-going-to-prison-presidents-ex-advisor-warns.html",
    "timestamp": "2025-03-29T10:27:09Z"
  },
  {
    "title": "Trump pushes aides to go bigger on tariffs as key deadline nears",
    "description": "President Donald Trump privately tells advisers that tariffs represent a generational opportunity to transform the U.S. economy.",
    "link": "https://biztoc.com/x/394119dd10db08ba",
    "timestamp": "2025-03-29T10:11:23Z"
  },
  {
    "title": "The Trump tariff ‘chain reaction’: America’s car and auto insurance payments could soar by $24 billion",
    "description": "Even if you're not in the market for a new car, U.S. President Donald Trump's 25% tariffs on auto imports could make owning one more expensive.\nThe new taxes, which are set to begin April 3 and expand in the following weeks, are estimated to raise the average…",
    "link": "https://biztoc.com/x/d8d46148256dbf9a",
    "timestamp": "2025-03-29T10:11:08Z"
  },
  {
    "title": "Forget the 51st state, Mr. President, and consider a common market with Canada",
    "description": "As President Donald Trump continues to toy (troll?) with the idea of Canada becoming the 51st state, he should consider a better option: Build a common market with our neighbors to the north. That’s a lot more in line with the statehood idea than hitting the …",
    "link": "https://nypost.com/2025/03/29/opinion/trump-should-consider-a-common-market-with-canada/",
    "timestamp": "2025-03-29T10:04:54Z"
  },
  {
    "title": "China is allegedly trying to poach Taiwanese tech talent",
    "description": "Taiwan's Ministry of Justice Investigation Bureau has accused Chinese chipmaker SMIC of illegally recruiting Taiwanese tech talent. Read more...",
    "link": "https://www.neowin.net/news/china-is-allegedly-trying-to-poach-taiwanese-tech-talent/",
    "timestamp": "2025-03-29T10:04:01Z"
  },
  {
    "title": "Fear, anxiety spread among Muslim Americans as Trump travel ban looms",
    "description": "The Trump administration is considering prohibiting or limiting travelers from more than 40 countries from entering the U.S.",
    "link": "https://www.usatoday.com/story/news/nation/2025/03/29/muslims-trump-travel-ban-fear/82688759007/",
    "timestamp": "2025-03-29T10:03:09Z"
  },
  {
    "title": "Charting the Global Economy: US Inflation Picks Up Before Tariffs",
    "description": "Consumer spending was weaker than expected again in February while a key inflation metric picked up, in a double whammy for the US economy before the brunt of tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/charting-the-global-economy-us-inflation-picks-up-before-tariffs",
    "timestamp": "2025-03-29T10:02:56Z"
  },
  {
    "title": "Canada among Trump’s ‘friendly’ countries — for now — as next tariff deadline looms",
    "description": "MONTREAL — Uncertainty reigns ahead of a looming U.S. tariff deadline next week, with businesses stuck in a holding pattern that has halted capital investment, hiring and financial forecasts at some firms amid a trade war where the next steps — and even who c…",
    "link": "https://financialpost.com/pmn/canada-among-trumps-friendly-countries-for-now-as-next-tariff-deadline-looms",
    "timestamp": "2025-03-29T10:02:26Z"
  },
  {
    "title": "Why Trump's push for frigid Greenland is about icing out US adversaries",
    "description": "President Donald Trump’s push to acquire Greenland highlights the island’s growing strategic value, from rare earth mineral wealth to its role in Arctic defense.",
    "link": "https://www.foxnews.com/politics/why-trumps-push-frigid-greenland-about-icing-out-us-adversaries",
    "timestamp": "2025-03-29T10:00:54Z"
  },
  {
    "title": "As 'Snow White' struggles, here are five more Disney controversies that rocked the company",
    "description": "The poor box office debut and dismal critical reception of Disney's \"Snow White\" remake is just the latest in a long line of controversies that Disney has endured in recent years.",
    "link": "https://www.foxnews.com/media/snow-white-struggles-here-five-more-disney-controversies-rocked-company",
    "timestamp": "2025-03-29T10:00:47Z"
  },
  {
    "title": "How an app unfamiliar to Trump rocked his week | CNN Politics",
    "description": "As President Donald Trump’s advisers this week took on the unenviable task of informing him a journalist he loathes was inadvertently added to a group chat discussing secret attack plans, one key detail required some further explanation.",
    "link": "https://www.cnn.com/2025/03/29/politics/trump-signal-chat-frustration/index.html",
    "timestamp": "2025-03-29T10:00:36Z"
  },
  {
    "title": "Trump effect forces Germany to reprioritize defense as nation plays catch-up in military spending",
    "description": "In his second term as president, Donald Trump is pushing American allies, including Germany, to do more to fund their militaries and pay their fair share to fund defense.",
    "link": "https://www.foxnews.com/world/trump-effect-forces-germany-reprioritize-defense-nation-plays-catch-up-military-spending",
    "timestamp": "2025-03-29T10:00:24Z"
  },
  {
    "title": "Crypto: The Currency of the (Uninhabitable) Future",
    "description": "This story was originally published by Slate and is reproduced here as part of the Climate Desk collaboration. Once upon a time, not long ago, Elon Musk was worried sick about climate change. Stopping it became an overarching career mission, reflected in both…",
    "link": "https://www.motherjones.com/politics/2025/03/crypto-the-currency-of-the-uninhabitable-future/",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "The right’s outrage about Tesla protests rings especially hollow",
    "description": "On March 29, Hundreds of demonstrations organized under the name Tesla Takedown will target Tesla dealerships throughout the U.S. protesting Elon Musk.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/tesla-takedown-protests-musk-trump-rcna198594",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "Trump's election order tees up DOGE for familiar voter file fight",
    "description": "When President Donald Trump signed a sprawling election executive order this week, he set up his administration for a lengthy fight over documentary proof of citizenship, the power of the executive branch and existing federal election law.",
    "link": "https://www.nbcnews.com/politics/elections/trumps-election-order-tees-doge-familiar-voter-file-fight-rcna198178",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "Inside the Trump Family Love Lives: Tiger Woods, Tiffany Trump & More",
    "description": "Tiger Woods and Vanessa Trump aren’t puttering around when it comes to sharing how they feel about each other.\"Love is in the air and life is better with you by my side!” the pro golfer wrote on...",
    "link": "https://www.eonline.com/news/1415301/tiger-woods-and-vanessa-trump-tee-off-new-romance-inside-the-love-lives-of-donald-trumps-family",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "Trump’s attack on the Smithsonian is bad. His reason is even worse.",
    "description": "Like the “1776 Report,” Trump's executive order targeting the Smithsonian is preoccupied with the nation’s founding. And it wrongly promotes scientific racism.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/-trump-smithsonian-museum-executive-order-race-rcna198533",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "Why we may never know the full consequences of the Signal group chat",
    "description": "This week's “Signalgate” revelations prove the “Houthi Small Group P-C” was not the first group chat between top Trump national security officials.",
    "link": "https://www.msnbc.com/inside-with-jen-psaki/carelessness-signal-group-chat-scandal-rcna198638",
    "timestamp": "2025-03-29T10:00:00Z"
  },
  {
    "title": "This 'boy-who-cried-wolf' investment can beat long odds and outperform under Trump",
    "description": "Smaller stocks are off to a disappointing start once again, and while they're at risk right now, strategists say they're still worth it.",
    "link": "https://www.businessinsider.com/stock-market-outlook-small-caps-economy-recession-risk-investing-strategy-2025-3",
    "timestamp": "2025-03-29T09:55:01Z"
  },
  {
    "title": "Denmark Criticises 'Tone' Of Vance's Greenland Comments",
    "description": "Denmark on Saturday said it did not like the \"tone\" of US Vice President JD Vance comments that Copenhagen had not done enough for Greenland during a visit to the strategically placed, resource-rich Danish territory coveted by US President Donald Trump.",
    "link": "https://www.ibtimes.com/denmark-criticises-tone-vances-greenland-comments-3768117",
    "timestamp": "2025-03-29T09:51:10Z"
  },
  {
    "title": "Hegseth joins WWII memorial service on his first trip to Japan and vows to strengthen alliance",
    "description": "U.S. Secretary of Defense Pete Hegseth has praised the friendship and trust that his country and Japan have developed while attending a memorial service on Iwo Jima to honor those who died in battle during World War II",
    "link": "https://abcnews.go.com/US/wireStory/hegseth-joins-wwii-memorial-service-trip-japan-vows-120288057",
    "timestamp": "2025-03-29T09:50:24Z"
  },
  {
    "title": "So Is Trump Actually Firing Any of These Signal Jokers?",
    "description": "Isn’t it nice when the top news story of the week ranks itself?",
    "link": "https://slate.com/news-and-politics/2025/03/is-trump-firing-michael-waltz-pete-hegseth-signal.html",
    "timestamp": "2025-03-29T09:45:00Z"
  },
  {
    "title": "Britain Looks to Ink Post-Brexit Trade Deal with Trump to Avoid Tariffs",
    "description": "Britain's government is hoping to reach a last-minute post-Brexit trade agreement with Washington to avoid -- or at least mitigate -- more tariffs set to be announced on Wednesday by US President Donald Trump.\nThe post Britain Looks to Ink Post-Brexit Trade D…",
    "link": "https://www.breitbart.com/europe/2025/03/29/britain-looks-to-ink-post-brexit-trade-deal-with-trump-to-avoid-tariffs/",
    "timestamp": "2025-03-29T09:42:32Z"
  },
  {
    "title": "The Auto Union Boss Who Went From Trump Foe to Tariff Cheerleader",
    "description": "UAW President Shawn Fain has emerged as a prominent pro-tariff voice, after taking jabs at Donald Trump during the presidential campaign.",
    "link": "https://biztoc.com/x/ad24884e07d74b58",
    "timestamp": "2025-03-29T09:38:29Z"
  },
  {
    "title": "Elon Musk's group spent over $12 million in Wisconsin. Here's why he cares about a state Supreme Court race",
    "description": "AP and Getty Images\nElon Musk is heading to Wisconsin on Sunday.\nThe world's richest man and his group have spent over $12 million on a state Supreme Court race.\nThis is Musk's biggest US political bet since the 2024 election.\nPresident Donald Trump may have …",
    "link": "https://biztoc.com/x/c95337f0da0e7990",
    "timestamp": "2025-03-29T09:38:29Z"
  },
  {
    "title": "JD Vance accuses Denmark of failing to keep Greenland secure as he hits out at European allies",
    "description": "Vance's visit comes as President Donald Trump hardens his rhetoric about taking control of Greenland.",
    "link": "https://biztoc.com/x/cfe659882f633347",
    "timestamp": "2025-03-29T09:38:14Z"
  },
  {
    "title": "Myanmar’s earthquake death toll jumps above 1,000 as more bodies recovered from rubble of collapsed buildings",
    "description": "The earthquake struck midday Friday with an epicenter not far from Mandalay, followed by several aftershocks including one measuring a strong 6.4 magnitude.",
    "link": "https://nypost.com/2025/03/29/world-news/myanmar-earthquake-death-toll-over-1000-as-aid-sent-to-asia-country-thailand-and-china/",
    "timestamp": "2025-03-29T09:35:32Z"
  },
  {
    "title": "Lucas: Houthi intel leak fury a lot of hot air",
    "description": "While the ongoing airstrikes have wrecked the Houthis by taking out vital missile-launching facilities with no U.S. casualties, the Democrats attacked Trump and his defense and intelligence team for leaks over the attack plan.",
    "link": "https://www.bostonherald.com/2025/03/29/lucas-houthi-intel-leak-fury-a-lot-of-hot-air/",
    "timestamp": "2025-03-29T09:34:35Z"
  },
  {
    "title": "JD Vance accuses Denmark of failing to keep Greenland secure as he hits out at European allies",
    "description": "Vance's visit comes as President Donald Trump hardens his rhetoric about taking control of Greenland.",
    "link": "https://www.cnbc.com/2025/03/29/jd-vance-accuses-denmark-of-failing-to-keep-greenland-secure.html",
    "timestamp": "2025-03-29T09:33:23Z"
  },
  {
    "title": "My companies are suffering because I am in the government: Elon Musk",
    "description": "The world’s richest man, Elon Musk, claimed that his role in the government puts him at a disadvantage, not an advantage. Musk said it would be impossible for him to get away with any misconduct, even if he wanted to. This is amidst the growing concerns about…",
    "link": "https://economictimes.indiatimes.com/tech/technology/my-companies-are-suffering-because-i-am-in-the-government-elon-musk/articleshow/119701012.cms",
    "timestamp": "2025-03-29T09:31:38Z"
  },
  {
    "title": "Elon Musk's group spent over $12 million in Wisconsin. Here's why he cares about a state Supreme Court race.",
    "description": "Elon Musk and his America PAC have spent over $12 million on efforts to elect a judge who could shift the majority of Wisconsin's highest court.",
    "link": "https://www.businessinsider.com/elon-musk-wisconsin-state-supreme-court-election-analysis-2025-3",
    "timestamp": "2025-03-29T09:30:02Z"
  },
  {
    "title": "Trump family tree: Meet Donald Trump's parents, siblings, wives, and children",
    "description": "Donald Trump has a sprawling family including multiple siblings, wives, children, and grandchildren.\nChip Somodevilla/Getty Images\nDonald Trump's family is large and often in the spotlight.\nMany members have been involved in the family business, the Trump Org…",
    "link": "https://biztoc.com/x/66d8e413ec493919",
    "timestamp": "2025-03-29T09:27:07Z"
  },
  {
    "title": "Elon Musk To Visit CIA For Government Efficiency Talks, After Department Of Defense",
    "description": "Elon Musk, a key advisor to President Donald Trump, is set to meet with CIA Director John Ratcliffe on Monday. The meeting will focus on enhancing government efficiency.\nWhat Happened: The visit comes amid significant workforce reductions within the federal g…",
    "link": "https://biztoc.com/x/a12900d8a4300256",
    "timestamp": "2025-03-29T09:27:01Z"
  },
  {
    "title": "One China Diplomat’s Reply To U.S. Critics: Visit And See For Yourself",
    "description": "Visitors find China \"is not what the media describes,\"  Chinese Consul General in New York Chen Li said in an interview. \"It’s absolutely a different world.”",
    "link": "https://www.forbes.com/sites/forbeschina/2025/03/29/one-china-diplomats-reply-to-us-critics-visit-and-see-for-yourself/",
    "timestamp": "2025-03-29T09:26:53Z"
  },
  {
    "title": "Donald Trump shares real reason why US ‘need to have’ Greenland after JD Vance’s controversial visit",
    "description": "Donald Trump has given his reason why he thinks the US 'needs to have' Greenland, a country which rather demonstrably doesn't want him.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-us-have-greenland-reason-793374-20250329",
    "timestamp": "2025-03-29T09:25:45Z"
  },
  {
    "title": "Battenfeld: MassGOP heading into election year with little chance of breaking Democratic stranglehold",
    "description": "But the state party appears to be heading into another election year with few strong challengers on the state political stage and little chance of breaking the Democratic stranglehold on Massachusetts.",
    "link": "https://www.bostonherald.com/2025/03/29/battenfeld-massgop-heading-into-election-year-with-little-chance-of-breaking-democratic-stranglehold/",
    "timestamp": "2025-03-29T09:25:04Z"
  },
  {
    "title": "Musk sells X",
    "description": "Musk’s xAI artificial intelligence startup has acquired X Read Full Article at RT.com",
    "link": "https://www.rt.com/business/614940-musk-xai-startup-acquire-x/",
    "timestamp": "2025-03-29T09:23:03Z"
  },
  {
    "title": "Trump family tree: Meet Donald Trump's parents, siblings, wives, and children",
    "description": "Donald Trump's family has made headlines over the decades. From messy divorces to reality TV, here's what to know about the generations of Trumps.",
    "link": "https://www.businessinsider.com/trump-family",
    "timestamp": "2025-03-29T09:17:02Z"
  },
  {
    "title": "Trump Says He Had An 'Extremely Productive Call' With Canadian PM Mark Carney Amid Heightened US-Canada Tensions",
    "description": "President Donald Trump and Canadian Prime Minister Mark Carney engaged in a productive dialogue on Friday. The conversation marked the first interaction between the two leaders since Carney assumed leadership of Canada’s ruling Liberals on March 9.\nWhat Happe…",
    "link": "https://biztoc.com/x/4011cb7717a53562",
    "timestamp": "2025-03-29T09:16:13Z"
  },
  {
    "title": "Crypto Whale’s Losses on TRUMP Memecoin Balloon to $15,700,000 After Exiting Three Losing Trades in a Row",
    "description": "A crypto whale is booking millions of dollars in losses after making several Official Trump (TRUMP) trades. According to blockchain tracking platform Lookonchain, the whale’s losses have ballooned to nearly $16 million on his TRUMP memecoin trades this month.…",
    "link": "https://dailyhodl.com/2025/03/29/crypto-whales-losses-on-trump-memecoin-balloon-to-15700000-after-exiting-three-losing-trades-in-a-row/",
    "timestamp": "2025-03-29T09:15:17Z"
  },
  {
    "title": "Donald Trump grants clemency to some entrepreneurs in financial crime cases",
    "description": "President Donald Trump commuted the sentence of Ozy Media co-founder Carlos Watson on Friday, just hours before Mr Watson was due to report to prison for a nearly 10-year sentence in a financial conspiracy case.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-grants-clemency-to-some-entrepreneurs-in-financial-crime-cases/a1896857587.html",
    "timestamp": "2025-03-29T09:10:41Z"
  },
  {
    "title": "Draft US-Ukraine deal gives US control over key economic sectors",
    "description": "Ukrainian experts warn that the Trump administration’s proposed economic deal would undermine the country’s economic sovereignty.",
    "link": "https://www.jpost.com/international/article-848031",
    "timestamp": "2025-03-29T09:05:57Z"
  },
  {
    "title": "How Donald Trump's Approval Rating During Second Term Compares to His First",
    "description": "Donald Trump is more popular now than he was at the same point in his first term, according to new polling.\nWhy It Matters\nDonald Trump's increased popularity at this stage in his political career is significant because it demonstrates his resilience and appe…",
    "link": "https://biztoc.com/x/e06a605ea2e07ffd",
    "timestamp": "2025-03-29T09:05:32Z"
  },
  {
    "title": "Vance says Denmark has ‘under invested’ in Greenland",
    "description": "\"You have under-invested in the people of Greenland and you have under-invested in the security architecture of this incredible, beautiful landmass,\" the US vice president told Denmark.",
    "link": "https://www.euractiv.com/section/politics/news/vance-says-denmark-has-under-invested-in-greenland/",
    "timestamp": "2025-03-29T09:03:02Z"
  },
  {
    "title": "Elon Musk sells X to his own AI company for $33 billion",
    "description": "Musk’s $33B merger of xAI and X signals a deeper AI-social media integration.",
    "link": "https://www.jpost.com/business-and-innovation/article-848034",
    "timestamp": "2025-03-29T09:01:11Z"
  },
  {
    "title": "Israeli Official Says Neither Israel nor Hamas Will Rule Gaza After War",
    "description": "\"It will not be Hamas, it will not be Israel,\" Israeli Deputy Consul General Tsach Saar told Newsweek.",
    "link": "https://www.newsweek.com/israeli-official-says-neither-israel-nor-hamas-will-rule-gaza-after-war-2052402",
    "timestamp": "2025-03-29T09:00:03Z"
  },
  {
    "title": "How Donald Trump's Approval Rating During Second Term Compares to His First",
    "description": "Overall, 45 percent of Americans now approve of Trump's performance, up from 42 percent in March 2017, according to Gallup.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-first-second-term-2052198",
    "timestamp": "2025-03-29T09:00:02Z"
  },
  {
    "title": "Q&A | Planning a cross-border trip? This immigration lawyer has some advice amid political instability",
    "description": "Some New Brunswickers might be thinking twice about border hopping during this period of instability between Canada and the United States. An immigration lawyer talked to CBC Radio about how to be prepared the next time you cross the border.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/cross-border-trip-immigration-lawyer-1.7493914",
    "timestamp": "2025-03-29T09:00:00Z"
  },
  {
    "title": "A battle over religion and schools in Oklahoma could decide the future of the First Amendment",
    "description": "OKLAHOMA CITY — There is a war raging across the United States on the role of religion in public life, and Ryan Walters is at the center of it.",
    "link": "https://www.nbcnews.com/politics/supreme-court/battle-religion-schools-oklahoma-decide-future-first-amendment-rcna191114",
    "timestamp": "2025-03-29T09:00:00Z"
  },
  {
    "title": "From pains to gains: How Saint John wants to improve trade infrastructure amid tariff worries",
    "description": "Business group, Envision Saint John, is advocating for the city to leverage the current trade tensions and increased national attention to seek opportunities in upgrading trade enabling infrastructure and broadening export opportunities.",
    "link": "https://www.cbc.ca/news/canada/new-brunswick/envision-saint-john-trade-enabling-infrastructure-simms-corner-1.7496238",
    "timestamp": "2025-03-29T09:00:00Z"
  },
  {
    "title": "The Atlantic reporter wasn't the only non-government person in the group chat [Followup]",
    "description": "The Atlantic reporter wasn't the only non-government person in the group chat",
    "link": "https://www.fark.com/comments/13614898/The-Atlantic-reporter-wasnt-only-non-government-person-in-group-chat",
    "timestamp": "2025-03-29T08:50:00Z"
  },
  {
    "title": "'We Must Ensure the US Leads in the Arctic' — JD Vance in Greenland",
    "description": "The US vice president delivered a speech during his visit to the Pituffik military base in northern Greenland.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-sputnik01.htm",
    "timestamp": "2025-03-29T08:48:26Z"
  },
  {
    "title": "RFE/RL Continues Lawsuit As It Awaits Funds; Judge Blocks Dismantling Of VOA",
    "description": "Radio Free Europe/Radio Liberty (RFE/RL) is continuing legal action against the US Agency for Global Media (USAGM) to secure the release of congressionally appropriated funding, it said in a statement on March 28.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-rferl01.htm",
    "timestamp": "2025-03-29T08:47:35Z"
  },
  {
    "title": "Hegseth: US committed to defense of Pacific territories against China",
    "description": "Defense Secretary Pete Hegseth has reaffirmed the US is committed to defending the Pacific territories of Guam and Northern Mariana Islands and said any attack on them would be an attack on the mainland.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-rfa02.htm",
    "timestamp": "2025-03-29T08:47:18Z"
  },
  {
    "title": "US to send advanced military hardware to Philippines",
    "description": "The United States plans to deploy advanced military equipment to the Philippines to strengthen its deterrence against threats, officials from both countries said, as U.S. Defense Secretary Pete Hegseth made his first official visit to Manila.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-rfa01.htm",
    "timestamp": "2025-03-29T08:46:59Z"
  },
  {
    "title": "Schapiro: Corporate Virginia, long outspoken on diversity in education, goes silent",
    "description": "Corporate Virginia has long been an outspoken advocate for education — because it's good business. But it's been strangely quiet in the campus DEI debate.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_853ceca4-6c43-4206-b4a3-2db186d7a0b7.html",
    "timestamp": "2025-03-29T08:45:00Z"
  },
  {
    "title": "Israeli spy agency asks African countries to take Gazans: Report",
    "description": "The Israeli regime has instructed its Mossad spy agency to find countries that would agree to receive large numbers of Palestinians displaced from the Gaza Strip, according to a report.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-presstv01.htm",
    "timestamp": "2025-03-29T08:44:17Z"
  },
  {
    "title": "Meet 'Tesla Shield,' the counter-protesters planning to show support for Elon Musk this weekend",
    "description": "\"Tesla Shield\" organizers are planning to counterprotest \"Tesla Takedown\" efforts on March 29.\nMike Stocker/South Florida Sun Sentinel\nSupporters of Elon Musk and President Donald Trump are organizing \"Tesla Shield\" counterprotests.\nPro-Trump individuals have…",
    "link": "https://biztoc.com/x/657ba0e2a1875c60",
    "timestamp": "2025-03-29T08:43:19Z"
  },
  {
    "title": "US reaffirms 'ironclad' commitment to PH-US defense, economic alliance",
    "description": "The United States' (US) commitment to its economic and defense alliance with the Philippines is \"ironclad,\" its defense official said on Friday.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/03/mil-250328-pna05.htm",
    "timestamp": "2025-03-29T08:36:20Z"
  },
  {
    "title": "Meet 'Tesla Shield,' the counter-protesters planning to show support for Elon Musk this weekend",
    "description": "Supporters of Elon Musk and President Donald Trump are organizing an answer to widespread \"Tesla Takedown\" protests planned for this weekend.",
    "link": "https://www.businessinsider.com/trump-elon-musk-supporters-tesla-shield-counter-protests-2025-3",
    "timestamp": "2025-03-29T08:33:02Z"
  },
  {
    "title": "Foreign Minister Araqchi says Trump's letter contained both threat and calls for diplomacy",
    "description": "Foreign Minister Abbas Araqchi says Iran has reviewed the letter received from U.S. President Donald Trump, which he says contained both threatening language and calls for diplomacy.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-irna01.htm",
    "timestamp": "2025-03-29T08:29:29Z"
  },
  {
    "title": "U.S. allies and bases in the region will be made unsafe if Iran is attacked: Parliament speaker",
    "description": "Parliament Speaker Mohammad-Baqer Qalibaf says if the United States carries out military threats against Iran, U.S. allies and American military bases in the region will be made unsafe.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-irna02.htm",
    "timestamp": "2025-03-29T08:29:28Z"
  },
  {
    "title": "Britain says it is committed to diplomacy with Iran",
    "description": "British Foreign Secretary David Lammy says his country is committed to diplomacy to resolve a dispute over Iran's nuclear program.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-irna03.htm",
    "timestamp": "2025-03-29T08:29:23Z"
  },
  {
    "title": "Leader's advisor reaffirms Iran's resolve to stage Operation True Promise III against Israel",
    "description": "A senior military advisor to Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei reaffirms that Iran remains steadfast in its commitment to launch Operation True Promise III against the Israeli regime in response to acts of aggression against the c…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-presstv01.htm",
    "timestamp": "2025-03-29T08:29:11Z"
  },
  {
    "title": "Envoy: Iran's ballistic missile capabilities not negotiable",
    "description": "The Iranian ambassador to Baghdad says Tehran will not negotiate on its ballistic missile capabilities amid indications that a letter from US President Donald Trump has included such a demand.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-presstv02.htm",
    "timestamp": "2025-03-29T08:29:01Z"
  },
  {
    "title": "Insisting On Indirect Talks, Iran Responds To Trump Letter Via Oman",
    "description": "Iran said it has given a \"restrained\" response to a letter by US President Donald Trump proposing direct talks over a new nuclear deal, as Tehran continues to insist on indirect negotiations.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250328-rferl01.htm",
    "timestamp": "2025-03-29T08:28:36Z"
  },
  {
    "title": "Canadian PM says old Canada-U.S. ties over",
    "description": "Canadian Prime Minister Mark Carney said Thursday that Canada's old relationship with the United States \"based on deepening integration of our economies and tight security and military cooperation is over.\"",
    "link": "https://www.globalsecurity.org/wmd/library/news/canada/2025/canada-250328-pdo01.htm",
    "timestamp": "2025-03-29T08:16:10Z"
  },
  {
    "title": "Powerful earthquake hits Myanmar and Thailand, killing more than 150 people",
    "description": "Rescuers scrambled to save people buried beneath collapsed buildings after a powerful earthquake struck central Myanmar on Friday, killing 144 people in the war-torn country -- a count that would surely rise. a count that would surely rise.",
    "link": "https://www.globalsecurity.org/wmd/library/news/myanmar/2025/myanmar-250328-rfa01.htm",
    "timestamp": "2025-03-29T08:15:15Z"
  },
  {
    "title": "At least 6 noncitizen university students detained across U.S.",
    "description": "At least six noncitizen students studying in U.S. higher education have been detained by federal agents so far in March.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/03/sec-250328-pdo01.htm",
    "timestamp": "2025-03-29T08:12:27Z"
  },
  {
    "title": "Rubio: US has revoked 'more than 300' visas over pro-Palestine advocacy",
    "description": "The United States keeps cracking down on pro-Palestinian activists and demonstrations amid Washington's talk of a new wave of visa revocations for \"disruptive actions,\" so to speak.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/03/sec-250328-presstv01.htm",
    "timestamp": "2025-03-29T08:12:23Z"
  },
  {
    "title": "Why US Is Asking Hundreds Of International Students To Self-Deport",
    "description": "Hundreds of international students studying in the US have received emails from the US Department of State (DOS), telling them to self-deport as their F-1 visas (student visas) have been revoked owing to campus activism.",
    "link": "https://www.ndtv.com/world-news/us-cracks-down-on-international-students-hundreds-asked-self-deport-over-campus-activism-8038809",
    "timestamp": "2025-03-29T08:12:05Z"
  },
  {
    "title": "Greenland as 51st State: What US Taking Over Arctic Island Could Look Like",
    "description": "President Donald Trump has repeatedly spoken about his quest for the U.S. to take over Greenland—Newsweek has spoken to experts to break down what this could look like.\nThe president has said he wants the autonomous territory in the Kingdom of Denmark to be u…",
    "link": "https://biztoc.com/x/38c467e4e11e3e7c",
    "timestamp": "2025-03-29T08:10:31Z"
  },
  {
    "title": "The JFK files: the truth at last?",
    "description": "\"It's been 60 years, time for the American people to know the TRUTH.\" So declared Donald Trump on the campaign trail, vowing to order the release of all official records related to the 1963 assassination of John F. Kennedy. Last week that cache of documents, …",
    "link": "https://biztoc.com/x/cbff283277fc220c",
    "timestamp": "2025-03-29T08:10:10Z"
  },
  {
    "title": "Analysis: The Military And Monetary Impact Of Ukraine's Deep Strikes In Russia",
    "description": "Ukrainian strikes on Russia's energy sector have caused at least 60 billion rubles ($714 million) in damage, a joint investigation by RFE/RL, Frontelligence Insight, and a group of volunteers reveals.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250329-rferl01.htm",
    "timestamp": "2025-03-29T08:08:23Z"
  },
  {
    "title": "European Sanctions on Russia Likely Key Factor in Any Final Ukraine Peace Deal - Rubio",
    "description": "European sanctions against Russia will likely have to be taken into account as part of any final peace deal on Ukraine, US State Secretary Marco Rubio said in a readout of press remarks published by the Department of State on Friday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/03/ukraine-250328-sputnik01.htm",
    "timestamp": "2025-03-29T08:08:09Z"
  }
]