[
  {
    "title": "Joe Rogan Calls Trump Admin Detaining Pro-Palestine Students ‘Kind Of Shifty’",
    "description": "\"Isn’t a university supposed to be a place where someone’s allowed to express themselves?\" the podcaster asked.",
    "link": "https://www.huffpost.com/entry/joe-rogan-trump-palestine-student-protest_n_68893085e4b07dfa117e4b72",
    "timestamp": "2025-07-29T22:35:27Z"
  },
  {
    "title": "Trump says Epstein 'stole' young women, including Virginia Giuffre, from Mar-a-Lago",
    "description": "The US president has given some of his most expansive public comments yet about his falling out with the convicted sex offender.",
    "link": "https://www.abc.net.au/news/2025-07-30/trump-says-epstein-stole-young-women/105588758",
    "timestamp": "2025-07-29T22:32:11Z"
  },
  {
    "title": "Trump's Shifting Explanations Are Prolonging The Epstein Scandal He Wants To End",
    "description": "So when, exactly, did the president stop being friends with the convicted sex offender?",
    "link": "https://www.huffpost.com/entry/trumps-shifting-explanations-are-prolonging-the-epstein-scandal-he-wants-to-end_n_68894257e4b07dfa117e600d",
    "timestamp": "2025-07-29T22:29:12Z"
  },
  {
    "title": "Trump's swollen ankles take center stage in new photos as critics claim his health is declining - NewsBreak",
    "description": "What should have been the thrilling reveal of a fresh trade agreement between the US and EU instead rekindled speculation about President Trump's ankles, w",
    "link": "https://www.newsbreak.com/share/4139435665564-trump-s-swollen-ankles-take-center-stage-in-new-photos-as-critics-claim-his-health-is-declining?s=a2&amp;share_destination_id=MTI1MTM2ODk4LTE3NTM4MjgwMzgxMDM%3D&amp;pd=08T3p47f&amp;hl=en_US&amp;send_time=1753828038&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.30.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q3-control%2Cns_foryou_rank_exp_25q2-v8",
    "timestamp": "2025-07-29T22:28:46Z"
  },
  {
    "title": "Influencer Joey Swoll Caves To Leftist Mob After Praising Hulk Hogan",
    "description": "Fitness influencer Joey Swoll crumbled at the knees and retreated his praise of Hulk Hogan in a shocking display of spinelessness after facing leftist pressure.",
    "link": "https://dailycaller.com/2025/07/29/influencer-joey-swoll-caves-in-leftist-pressure-woke-culture-hulk-hogan-tribute-backlash-apology/",
    "timestamp": "2025-07-29T22:27:03Z"
  },
  {
    "title": "Trump: Giuffre was at center of dispute that ended Epstein friendship",
    "description": "Trump said Epstein poached young women who worked at his Mar-a-Lago spa — including Virginia Giuffre",
    "link": "https://www.salon.com/2025/07/29/trump-giuffre-was-at-center-of-dispute-that-ended-epstein-friendship/",
    "timestamp": "2025-07-29T22:26:46Z"
  },
  {
    "title": "Trump's CDC pick confirmed—but her pro-vaccine stance may clash with RFK Jr.'s agenda",
    "description": "Susan Monarez, a Washington public health official, became President Donald Trump's CDC director, but her vision may be at odds with HHS Secretary Robert F. Kennedy Jr's.",
    "link": "https://www.foxnews.com/politics/trumps-cdc-pick-confirmed-but-her-pro-vaccine-stance-may-clash-rfk-jr-s-agenda",
    "timestamp": "2025-07-29T22:26:00Z"
  },
  {
    "title": "The Bob Cesca Podcast: Good Strong Food",
    "description": "Today's program from our podcasting affiliate, The Bob Cesca Show: Good Strong Food -- Donald Trump's DOJ offered immunity to convicted sex trafficker Ghislaine Maxwell. He's still refusing to rule out a pardon for Maxwell! Trump: \"I never had the privilege o…",
    "link": "https://littlegreenfootballs.com/article/54796_The_Bob_Cesca_Podcast-_Good_St",
    "timestamp": "2025-07-29T22:24:42Z"
  },
  {
    "title": "Booker confronts fellow Democrats over bipartisan police bills",
    "description": "New Jersey Sen. Cory Booker scolded fellow Democrats Tuesday for not having enough “backbone” to resist President Donald Trump in a fiery floor exchange that took place as colleagues sought to pass bipartisan police-related bills. \n“What I am tired of is when…",
    "link": "https://biztoc.com/x/f8cc3021256ba174",
    "timestamp": "2025-07-29T22:23:22Z"
  },
  {
    "title": "Right-Wing Content Creator Exposed for Stealing John Mulaney’s Slur Routine",
    "description": "Conservatives can’t even make an original joke about the n-word",
    "link": "https://www.cracked.com/article_47620_right-wing-content-creator-exposed-for-stealing-john-mulaneys-slur-routine.html",
    "timestamp": "2025-07-29T22:20:00Z"
  },
  {
    "title": "'That's not true': Epstein expert smacks down Trump's latest falling out story",
    "description": "Longtime journalist Tara Palmeri has become an expert on the Jeffrey Epstein scandal, and responding to President Donald Trump's comments aboard Air Force One on Tuesday, she walked through his conflicting stories. Trump accused Epstein of poaching young wome…",
    "link": "https://www.rawstory.com/trump-and-epstein-friendship-timeline/",
    "timestamp": "2025-07-29T22:18:53Z"
  },
  {
    "title": "Democrats Catch a Break in the South",
    "description": "Democratic strategists say recent developments in Georgia and North Carolina mark a rare opening for the party in the South heading into the midterms.",
    "link": "https://www.newsweek.com/democrats-catch-break-south-2105994",
    "timestamp": "2025-07-29T22:17:03Z"
  },
  {
    "title": "Live: ASX to slip and RBA awaiting inflation data to determine whether to cut rates",
    "description": "The Australian share market is likely to fall slightly in morning trade, while the ABS will release its latest quarterly inflation data, which will determine whether the Reserve Bank cuts interest rates at its August meeting. Follow live.",
    "link": "https://www.abc.net.au/news/2025-07-30/asx-markets-business-live-news-july-30/105588948",
    "timestamp": "2025-07-29T22:16:23Z"
  },
  {
    "title": "‘F*cking Fight’: Two Dems Face-Off In Epic Verbal Spat On Senate Floor",
    "description": "Senate Democrats engaged in a fierce shouting match on the Senate floor Thursday afternoon with Democratic New Jersey Sen. Cory Booker accusing his fellow party members of betraying their party and condoning authoritarianism. The New Jersey Democrat delivered…",
    "link": "https://dailycaller.com/2025/07/29/cory-booker-amy-klobuchar-fight-senate/",
    "timestamp": "2025-07-29T22:15:39Z"
  },
  {
    "title": "Breitbart Business Digest: Putting a Price on Admission to America's Markets",
    "description": "Even with the new tariffs, access to the U.S. market is still the best deal on the planet; and the Europe Union knows it.\nThe post Breitbart Business Digest: Putting a Price on Admission to America’s Markets appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/29/breitbart-business-digest-putting-a-price-on-admission-to-americas-markets/",
    "timestamp": "2025-07-29T22:15:25Z"
  },
  {
    "title": "Vermont sues Trump administration for efforts to eliminate federal funding for health care provided by Planned Parenthood - VTDigger",
    "description": "Vermont sues Trump administration for efforts to eliminate federal funding for health care provided by Planned Parenthood - VTDiggervtdigger.org",
    "link": "http://vtdigger.org/2025/07/29/vermont-sues-trump-administration-for-efforts-to-eliminate-federal-funding-for-health-care-provided-by-planned-parenthood/",
    "timestamp": "2025-07-29T22:15:00Z"
  },
  {
    "title": "Tulsi Gabbard has cemented herself a place in history",
    "description": "The US national security advisor finally finds herself in a position where the truths she speaks cannot be ignored Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622159-tulsi-gabbard-russiagate-history/",
    "timestamp": "2025-07-29T22:14:29Z"
  },
  {
    "title": "ICE Releases Marine Veteran's Wife from Custody After Trump Ally Request",
    "description": "Carey Holliday, the family's attorney, credited Kennedy's office as being \"instrumental\" in securing Paola's release.",
    "link": "https://www.newsweek.com/marine-wife-green-card-ice-immigration-released-2106021",
    "timestamp": "2025-07-29T22:14:13Z"
  },
  {
    "title": "Trump Calls Fox’s Jessica Tarlov a ‘Real Loser’ As She Calls For Gun Control and Honors NYC Shooting Victims",
    "description": "Tarlov was on Fox News speaking at the time of Trump's insult; offering a somber reflection on the victims of the New York City shooting\nThe post Trump Calls Fox’s Jessica Tarlov a ‘Real Loser’ As She Calls For Gun Control and Honors NYC Shooting Victims firs…",
    "link": "https://www.mediaite.com/politics/trump-calls-foxs-jessica-tarlov-a-real-loser-as-she-calls-for-gun-control-and-honors-nyc-shooting-victims/",
    "timestamp": "2025-07-29T22:11:28Z"
  },
  {
    "title": "Federal Reserve likely to air divisions as it keeps rates unchanged",
    "description": "Two top Federal Reserve officials could dissent from the central bank’s likely decision Wednesday to hold its key interest rate steady, a sign of division reflecting the economy's muddy outlook as well as the jockeying to replace Chair Jerome Powell when his …",
    "link": "https://www.seattlepi.com/business/article/federal-reserve-likely-to-air-divisions-as-it-20792692.php",
    "timestamp": "2025-07-29T22:10:30Z"
  },
  {
    "title": "Federal Reserve likely to air divisions as it keeps rates unchanged",
    "description": "WASHINGTON (AP) — Two top Federal Reserve officials could dissent from the central bank’s likely decision Wednesday to hold its key interest rate steady, a sign of division at the Fed that reflects the economy’s muddy outlook and possibly the jockeying to rep…",
    "link": "https://financialpost.com/pmn/federal-reserve-likely-to-air-divisions-as-it-keeps-rates-unchanged",
    "timestamp": "2025-07-29T22:09:09Z"
  },
  {
    "title": "Trump claims Epstein 'stole' Prince Andrew accuser Virginia Giuffre from his Mar-a-Lago resort",
    "description": "Donald Trump has claimed billionaire paedophile Jeffrey Epstein \"stole\" prominent accuser Virginia Giuffre and other young women from his Mar-a-Lago resort in Florida.",
    "link": "https://news.sky.com/story/trump-claims-epstein-stole-prince-andrew-accuser-virginia-giuffre-from-his-mar-a-lago-resort-13403791",
    "timestamp": "2025-07-29T22:08:00Z"
  },
  {
    "title": "New poll contains 'rage-blackout-inducing twist' — for Democrats",
    "description": "According to Rolling Stone, despite extensive coverage of President Donald Trump's self-dealing and profiteering off the presidency — from issuing crypto tokens that grant access to the presidency to accepting a $400 million luxury jet from a foreign governme…",
    "link": "https://www.rawstory.com/democrats-poll/",
    "timestamp": "2025-07-29T22:06:47Z"
  },
  {
    "title": "Trump’s Misleading Justification for Higher Tariffs on Imports of EU Goods",
    "description": "The United States and the European Union have reached a preliminary trade deal to avoid a 30% U.S. tariff on imported goods from the EU that President Donald Trump threatened would go into effect on Aug. 1. Trump had argued that higher tariffs were needed bec…",
    "link": "https://www.factcheck.org/2025/07/trumps-misleading-justification-for-higher-tariffs-on-imports-of-eu-goods/",
    "timestamp": "2025-07-29T22:04:28Z"
  },
  {
    "title": "Pete Buttigieg acknowledges 'fairness issues' with trans athletes in women's sports",
    "description": "Democrat Pete Buttigieg joined a growing number of party members expressing concerns about transgender athletes competing in women's and girls sports.",
    "link": "https://www.foxnews.com/sports/pete-buttigieg-acknowledges-fairness-issues-trans-athletes-womens-sports",
    "timestamp": "2025-07-29T22:03:28Z"
  },
  {
    "title": "Republicans Pan Trump’s Idea Of Tariff Rebates",
    "description": "“Why do we need rebates if foreign nations are paying the tariffs?” asked one Republican of a proposal in Congress to send Americans tariff rebate checks.",
    "link": "https://www.huffpost.com/entry/donald-trump-tariff-rebate_n_688929e1e4b08681ba5e7437",
    "timestamp": "2025-07-29T22:03:13Z"
  },
  {
    "title": "Trump Insists He Was Not Behind Colbert Firing — Before Wondering ‘Who Will Go First’ Between Kimmel and Fallon",
    "description": "Trump denied being \"solely responsible\" for Stephen Colbert's ouster from CBS — but then suggested ABC's Jimmy Kimmel and NBC's Jimmy Fallon might be next.\nThe post Trump Insists He Was Not Behind Colbert Firing — Before Wondering ‘Who Will Go First’ Between …",
    "link": "https://www.mediaite.com/media/entertainment/trump-insists-he-was-not-behind-colbert-firing-before-wondering-who-will-go-first-between-kimmel-and-fallon/",
    "timestamp": "2025-07-29T22:02:36Z"
  },
  {
    "title": "Trump says Epstein ‘stole’ young women from Mar-a-Lago spa, including Virginia Giuffre",
    "description": "President Donald Trump said Tuesday that Jeffrey Epstein “stole” young women who worked for the spa at Mar-a-Lago, the latest evolution in his description of how their highly scrutinized relationship ended years ago.",
    "link": "https://biztoc.com/x/86cfbfeddb679132",
    "timestamp": "2025-07-29T22:01:07Z"
  },
  {
    "title": "A Conspiracy Comes to Light",
    "description": "This post A Conspiracy Comes to Light appeared first on Daily Reckoning.\nThe recent disclosures by Director of National Intelligence (DNI) Tulsi Gabbard of wrongdoing by the Intelligence Community (IC) and the White House at the end of the Obama administratio…",
    "link": "https://dailyreckoning.com/a-conspiracy-comes-to-light/",
    "timestamp": "2025-07-29T22:00:39Z"
  },
  {
    "title": "This Epstein timeline reveals so much about Trump",
    "description": "On August 10, 2019, Jeffrey Epstein — accused of sex trafficking in minor girls — killed himself in his jail cell while awaiting trial, and a new conspiracy theory was born: Powerful forces silenced him. Releasing the Justice Department’s files on Epstein wou…",
    "link": "https://www.rawstory.com/epstein-2673780428/",
    "timestamp": "2025-07-29T22:00:03Z"
  },
  {
    "title": "Hulk Hogan was financially underwater before death...",
    "description": "HULK Hogan took out a massive $2 million mortgage on his Florida mansion, and was threatened with having his wages garnished in a lawsuit in the few years before his death at 71. The U.S. Sun can e…",
    "link": "https://www.the-sun.com/sport/14858281/hulk-hogan-lawsuit-mortgage-home-before-death/",
    "timestamp": "2025-07-29T22:00:03Z"
  },
  {
    "title": "Trump Questions Whether Rupert Murdoch Really 'Controls' WSJ (Corbin Bolies/The Daily Beast)",
    "description": "Corbin Bolies / The Daily Beast:\nTrump Questions Whether Rupert Murdoch Really ‘Controls’ WSJ  —  WHO'S IN CHARGE?  —  The president also claimed the Murdoch paper wants to settle his $10 billion lawsuit over a story surrounding his friendship with Jeffrey Ep…",
    "link": "https://www.memeorandum.com/250729/p128",
    "timestamp": "2025-07-29T22:00:01Z"
  },
  {
    "title": "Democrats try again to revive the Voting Rights Act but face long odds",
    "description": "Senators reintroduced a bill to restore and expand protections enshrined in the Voting Rights Act of 1965.",
    "link": "https://www.bostonherald.com/2025/07/29/voting-rights-act/",
    "timestamp": "2025-07-29T21:58:31Z"
  },
  {
    "title": "Federal Reserve leaves interest rates unchanged even as Trump demands cuts",
    "description": "The Federal Reserve is leaving its key short-term interest rate unchanged for the fifth time this year, brushing off repeated calls from President Donald Trump for a cut.",
    "link": "https://www.clickondetroit.com/business/2025/07/29/dissent-rises-at-the-federal-reserve-among-trump-appointees-but-interest-rate-cut-is-unlikely/",
    "timestamp": "2025-07-29T21:58:24Z"
  },
  {
    "title": "'Real loser!' Trump melts down at Fox News host",
    "description": "President Donald Trump railed against a particular Fox News host he has a problem with on Tuesday, taking to his Truth Social platform to vent his frustration.\"I can’t stand Jessica Tarlov of THE FIVE. A real loser!!!\" wrote Trump.Tarlov is one of Fox News' f…",
    "link": "https://www.rawstory.com/trump-tarlov/",
    "timestamp": "2025-07-29T21:58:00Z"
  },
  {
    "title": "Trump Snubs the Taiwanese President",
    "description": "The move is also a slap in the face to China hawks in Washington.",
    "link": "http://foreignpolicy.com/2025/07/29/trump-taiwan-president-china-transit-diplomacy-trade/",
    "timestamp": "2025-07-29T21:57:53Z"
  },
  {
    "title": "The Internet Is Losing It Over A Video Of Trump Being Drowned Out By Bagpipes In Scotland",
    "description": "\"This may be the first time he's ever been shut up,\" one social media user joked.",
    "link": "https://www.huffpost.com/entry/trump-bagpipes-video_n_68891aece4b07dfa117e3944",
    "timestamp": "2025-07-29T21:55:49Z"
  },
  {
    "title": "The Next Episode of ‘South Park’ Will Bring Back Trump and Tackle ICE Raids",
    "description": "The president and Satan are still an item it seems",
    "link": "https://www.cracked.com/article_47622_this-weeks-south-park-will-bring-back-trump-and-tackle-ice-raids.html",
    "timestamp": "2025-07-29T21:55:00Z"
  },
  {
    "title": "Trump's tariffs could squeeze US factories and boost costs by up to 4.5%, a new analysis finds",
    "description": "As President Donald Trump prepares to announce new tariff increases, the costs of his policies are starting to come into focus for a domestic manufacturing sector that depends on global supply chains, with a new analysis suggesting factory costs could increas…",
    "link": "https://japantoday.com/category/business/trump%27s-tariffs-could-squeeze-us-factories-and-boost-costs-by-up-to-4.5-a-new-analysis-finds",
    "timestamp": "2025-07-29T21:54:50Z"
  },
  {
    "title": "U.S.-China AI Competition In The Spotlight",
    "description": "The U.S. and Chinese Governments recently announced AI development plans. U.S.-China AI competition features U.S. deregulation versus a big  Chinese government approach.",
    "link": "https://www.forbes.com/sites/aldenabbott/2025/07/29/us-china-ai-competition-in-the-spotlight/",
    "timestamp": "2025-07-29T21:54:29Z"
  },
  {
    "title": "Walmart Stabbing Suspect Stayed On Streets Despite Long Rap Sheet, Mental Illness",
    "description": "The suspect who allegedly stabbed 11 people in Michigan was a mentally unwell homeless man with charges going back decades, authorities and court records say.",
    "link": "https://dailycaller.com/2025/07/29/walmart-stabbing-suspect-stayed-on-streets-despite-long-rap-sheet-mental-illness/",
    "timestamp": "2025-07-29T21:52:27Z"
  },
  {
    "title": "Cory Booker Goes Off the Rails on His Party: ‘The Democratic Party Needs a Wake Up Call’",
    "description": "“There's a lot of us in this caucus that want to f*cking fight. And what's bothering me right now is we don't see enough fight in this caucus.“\nThe post Cory Booker Goes Off the Rails on His Party: ‘The Democratic Party Needs a Wake Up Call’ first appeared on…",
    "link": "https://legalinsurrection.com/2025/07/cory-booker-goes-off-the-rails-on-his-party-the-democratic-party-needs-a-wake-up-call/",
    "timestamp": "2025-07-29T21:51:34Z"
  },
  {
    "title": "Democrat policies paved way for brutal Cincinnati attack, say Ohio Republicans: 'Fear and chaos'",
    "description": "Republican Sen. Bernie Moreno called for Cincinnati Mayor Aftab Pureval's resignation following a viral downtown beatdown while Rep. Michael Rulli criticized left-wing policies.",
    "link": "https://www.foxnews.com/politics/democrat-policies-paved-way-brutal-cincinnati-attack-say-ohio-republicans-fear-chaos",
    "timestamp": "2025-07-29T21:51:16Z"
  },
  {
    "title": "Democratic policies paved way for Cincinnati brawl, say Ohio Republicans: 'Fear and chaos'",
    "description": "Republican Sen. Bernie Moreno called for Cincinnati Mayor Aftab Pureval's resignation following a viral downtown brawl, while Rep. Michael Rulli criticized left-wing policies.",
    "link": "https://www.foxnews.com/politics/democratic-policies-paved-way-cincinnati-brawl-say-ohio-republicans-fear-chaos",
    "timestamp": "2025-07-29T21:51:16Z"
  },
  {
    "title": "‘Fantastic Four’—Galactus, Franklin, And The Twist Ending, Explained",
    "description": "Marvel’s ‘Fantastic Four’ introduces powerful new characters to the MCU, and ends with tease for ‘Avengers: Doomsday’—here’s the ending and post-credits scene, explained.",
    "link": "https://www.forbes.com/sites/danidiplacido/2025/07/29/fantastic-four-galactus-franklin-and-the-twist-ending-explained/",
    "timestamp": "2025-07-29T21:50:51Z"
  },
  {
    "title": "Trump says Epstein ‘stole’ young women from Mar-a-Lago spa, including Virginia Giuffre",
    "description": "President Donald Trump said Tuesday that Jeffrey Epstein “stole” young women who worked for the spa at Mar-a-Lago, the latest evolution in his description of how their highly scrutinized relationship ended years ago.",
    "link": "https://www.pbs.org/newshour/politics/trump-says-epstein-stole-young-women-from-mar-a-lago-spa-including-virginia-giuffre",
    "timestamp": "2025-07-29T21:50:34Z"
  },
  {
    "title": "Cory Booker accuses Democrats of being \"complicit\" in Trump's agenda",
    "description": "Sen. Cory Booker's tense exchange with two fellow Democrats marked a rare moment of intraparty disagreement that played out on the Senate floor.",
    "link": "https://www.cbsnews.com/news/cory-booker-says-senate-democrats-complicit-trump-agenda/",
    "timestamp": "2025-07-29T21:50:19Z"
  },
  {
    "title": "Chase Bank quietly warns customers about a big banking fee change",
    "description": "Chase Bank, operated by JPMorgan Chase (JPM) , recently scored a major win shortly after President Donald Trump took office in January.\nIn 2023, the Biden administration announced plans to cap the amount banks can charge customers in overdraft fees, a move th…",
    "link": "https://biztoc.com/x/abffa80ada9417e7",
    "timestamp": "2025-07-29T21:50:09Z"
  },
  {
    "title": "Trump approval rating sinks to 40%, the lowest of his term, Reuters/Ipsos poll finds (Nicole Jeanine Johnson/Reuters)",
    "description": "Nicole Jeanine Johnson / Reuters:\nTrump approval rating sinks to 40%, the lowest of his term, Reuters/Ipsos poll finds  —  U.S. President Donald Trump's approval rating dropped one percentage point to 40%, the lowest level of his second term in office, as Ame…",
    "link": "https://www.memeorandum.com/250729/p125",
    "timestamp": "2025-07-29T21:50:00Z"
  },
  {
    "title": "Republicans split over the hunger crisis in Gaza as Trump says he'll push for aid",
    "description": "President Donald Trump's call for additional aid for Gaza has split Republicans on Capitol Hill, with Marjorie Taylor Greene calling it a \"genocide.\"",
    "link": "https://www.nbcnews.com/politics/congress/republicans-split-hunger-crisis-gaza-trump-says-push-aid-rcna221826",
    "timestamp": "2025-07-29T21:49:33Z"
  },
  {
    "title": "FAIR: Media Largely Ignored Gaza Famine When There Was Time to Avert Mass Starvation",
    "description": "Gaza's conditions of famine have been out in the open for well over a year, and yet it was considered barely newsworthy in US news media.",
    "link": "https://fair.org/home/media-largely-ignored-gaza-famine-when-there-was-time-to-avert-mass-starvation/",
    "timestamp": "2025-07-29T21:49:33Z"
  },
  {
    "title": "US House panel rejects Ghislaine Maxwell immunity request",
    "description": "A Republican-led congressional committee has rejected a request by Ghislaine Maxwell, a longtime associate of the late convicted sex offender Jeffrey Epstein, for immunity from future prosecution.",
    "link": "https://www.rte.ie/news/2025/0729/1526038-maxwell-immunity-epstein/",
    "timestamp": "2025-07-29T21:46:44Z"
  },
  {
    "title": "US House panel rejects Ghislaine Maxwell immunity request",
    "description": "A Republican-led congressional committee has rejected a request by Ghislaine Maxwell, a longtime associate of the late convicted sex offender Jeffrey Epstein, for immunity from future prosecution.",
    "link": "https://www.rte.ie/news/2025/0729/1526038-maxwell-epstein/",
    "timestamp": "2025-07-29T21:46:44Z"
  },
  {
    "title": "Four designated areas for offshore wind projects announced in Nova Scotia",
    "description": "French Bank, Middle Bank and Sable Island Bank, all located south of Nova Scotia’s Eastern Shore, and Sydney Bight, northeast of Cape Breton, have been chosen, comprising a total area of 12,549 square kilometres.",
    "link": "https://www.nationalobserver.com/2025/07/29/news/four-designated-areas-offshore-wind-projects-announced-nova-scotia",
    "timestamp": "2025-07-29T21:44:00Z"
  },
  {
    "title": "Calls for US to sanction Israeli settlers after Palestinian activist killed",
    "description": "Trump rolled back sanctions against Israeli settlers, including Yinon Levi, the alleged killer of Awdah Hathaleen.",
    "link": "https://www.aljazeera.com/news/2025/7/29/calls-for-us-to-sanction-israeli-settlers-after-palestinian-activist-killed",
    "timestamp": "2025-07-29T21:43:13Z"
  },
  {
    "title": "Civil rights agency sued over handling of transgender worker discrimination complaints under Trump",
    "description": "The lawsuit alleges the agency halted payments to state and local civil rights agencies for investigating gender identity discrimination claims.",
    "link": "https://www.bostonherald.com/2025/07/29/eeoc-lawsuit-transgender-workers/",
    "timestamp": "2025-07-29T21:40:46Z"
  },
  {
    "title": "U.S. allowed Nvidia chip shipments to China to go forward, White House adviser says",
    "description": "White House national economic adviser Kevin Hassett, in an apparent reference to Nvidia Corp.’s NVDA-Q H20 AI chip shipments to China, said U.S. President Donald Trump and his team decided to let the chips go in a bid to stop China from getting ahead in the r…",
    "link": "https://biztoc.com/x/6829602188fee80c",
    "timestamp": "2025-07-29T21:38:40Z"
  },
  {
    "title": "'Wake up!' Cory Booker loses it in fiery speech and declares it's 'time to draw lines'",
    "description": "Sen. Cory Booker (D-NJ) trashed his own party Tuesday in a fiery speech on the Senate floor for what he argued was its capitulation to President Donald Trump.“What I am tired of is when the president of the United States violates the Constitution, trashes our…",
    "link": "https://www.rawstory.com/cory-booker-2673781939/",
    "timestamp": "2025-07-29T21:38:31Z"
  },
  {
    "title": "‘Best thing ever!’ Watch Cory Booker have ‘total meltdown’ on Senate floor as he scorches fellow Dems",
    "description": "'Don't question my integrity! Don't question my motives!'",
    "link": "https://www.wnd.com/2025/07/best-thing-ever-watch-cory-booker-have-total/",
    "timestamp": "2025-07-29T21:38:17Z"
  },
  {
    "title": "'South Park' Promises More Trump and Satan, Liberal Bashing After One Week Hiatus",
    "description": "After last week's \"South Park\" season 27 opener featuring Donald Trump begging Satan for sex, the irreverent cartoon series is skipping a week. But, don't worry. The Comedy Central show will return next week with yet another episode featuring Trump and Satan.…",
    "link": "https://www.breitbart.com/entertainment/2025/07/29/south-park-promises-more-trump-and-satan-liberal-bashing-after-one-week-hiatus/",
    "timestamp": "2025-07-29T21:37:36Z"
  },
  {
    "title": "U.S. and China Extend Tariff Truce, Pending Trump’s Approval",
    "description": "Trade officials from the United States and China want to extend the current “tariff truce,\" provided President Donald Trump approves.\nThe post U.S. and China Extend Tariff Truce, Pending Trump’s Approval appeared first on Breitbart.",
    "link": "https://www.breitbart.com/asia/2025/07/29/u-s-china-extend-tariff-truce-pending-trumps-approval/",
    "timestamp": "2025-07-29T21:35:39Z"
  },
  {
    "title": "US House panel rejects immunity request by Epstein associate Maxwell",
    "description": "WASHINGTON (Reuters) -A Republican-led congressional committee rejected on Tuesday a request by a longtime associate of the late convicted sex offender Jeffrey Epstein for immunity from future prosecution as a condition for testifying to the panel in the mids…",
    "link": "https://www.thestar.com.my/news/world/2025/07/30/us-house-panel-rejects-immunity-request-by-epstein-associate-maxwell",
    "timestamp": "2025-07-29T21:34:00Z"
  },
  {
    "title": "Wife of Marine Corps veteran released from ICE custody after advocacy from GOP Senator's office",
    "description": "A Marine Corps veteran's wife has been released from U.S. Immigration and Customs Enforcement detention following advocacy from Sen. John Kennedy, a...",
    "link": "https://www.yahoo.com/news/articles/wife-marine-corps-veteran-released-213256477.html",
    "timestamp": "2025-07-29T21:32:56Z"
  },
  {
    "title": "Dean Cain lauds ‘wonderful’ Trump and reveals A-list actor he wants as next Superman",
    "description": "Former Superman actor-turned frequent Fox News guest revealed he’s been friends with Trump ‘forever’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/dean-cain-trump-band-of-brothers-b2798356.html",
    "timestamp": "2025-07-29T21:32:53Z"
  },
  {
    "title": "Charlamagne Tha God Asks Why 'Nobody's Talking About' Clinton and Epstein",
    "description": "The popular radio host repeatedly asked why \"nobody\" is discussing former President Bill Clinton's connections to Jeffrey Epstein.",
    "link": "https://www.newsweek.com/jeffrey-epstein-bill-clinton-trump-charlamagne-tha-god-2105976",
    "timestamp": "2025-07-29T21:32:09Z"
  },
  {
    "title": "Cory Booker BRAWLS With Democratic Colleagues in Wild Senate Floor Showdown: ‘Complicit to Donald Trump!’",
    "description": "Senator Cory Booker (D-NJ) openly brawled with Senators Catherine Cortez Masto (D-NV) and Amy Klobuchar (D-MN) on the Senate floor Tuesday.\nThe post Cory Booker BRAWLS With Democratic Colleagues in Wild Senate Floor Showdown: ‘Complicit to Donald Trump!’ firs…",
    "link": "https://www.mediaite.com/media/news/cory-booker-brawls-with-democratic-colleagues-in-wild-senate-floor-showdown-complicit-to-donald-trump/",
    "timestamp": "2025-07-29T21:30:38Z"
  },
  {
    "title": "Map Shows States Gaining Most Jobs Due to Reshoring Efforts",
    "description": "Millions of manufacturing jobs are set to return to American soil by the end of 2025, according to Visual Capitalist.",
    "link": "https://www.newsweek.com/map-shows-states-gaining-most-jobs-due-reshoring-efforts-2105963",
    "timestamp": "2025-07-29T21:29:56Z"
  },
  {
    "title": "Ex-ESPN star destroys Hulk Hogan after his passing",
    "description": "Former ESPN sports analyst Bomani Jones stomped all over Hulk Hogan’s legacy in totality, but not for the reasons you’d expect. The wrestling legend died from cardiac arrest at his home in Clearwater, Fla,. at age 71. Despite first responders rushing Hogan to…",
    "link": "https://rollingout.com/2025/07/29/ex-espn-star-destroys-hulk-hogan-after-his-passing/",
    "timestamp": "2025-07-29T21:29:56Z"
  },
  {
    "title": "Democratic Senate Candidate Breaks Fundraising Record, Gives First Interview to Podcaster",
    "description": "As a sign of the times, Cooper’s first media interview after announcing his candidacy was with progressive podcaster Brian Tyler Cohen\nThe post Democratic Senate Candidate Breaks Fundraising Record, Gives First Interview to Podcaster first appeared on Mediait…",
    "link": "https://www.mediaite.com/politics/democratic-senate-candidate-breaks-fundraising-record-gives-first-interview-to-podcaster/",
    "timestamp": "2025-07-29T21:29:17Z"
  },
  {
    "title": "South African Activist Comes To DC, Pleads: Let Afrikaners Govern Themselves",
    "description": "A South African activist is urging U.S. leaders to back a peaceful secession by the country's white Afrikaner minority.",
    "link": "https://dailycaller.com/2025/07/29/ernst-roets-interview-afrikaners-south-africa/",
    "timestamp": "2025-07-29T21:29:05Z"
  },
  {
    "title": "What we know about the photo of James Brown with Trump and Epstein",
    "description": "The photo circulated on social media amid ongoing investigations into Donald Trump's connections to Jeffrey Epstein.",
    "link": "https://www.snopes.com//news/2025/07/29/james-brown-trump-epstein-photo/",
    "timestamp": "2025-07-29T21:29:00Z"
  },
  {
    "title": "Trump's EPA targets basis of all US greenhouse gas rules",
    "description": "The Trump administration has said it will rescind the long-standing finding that greenhouse gas emissions endanger human health, removing the legal foundation for all US greenhouse gas regulations.",
    "link": "https://www.rte.ie/news/2025/0729/1526035-epa-us-greenhouse/",
    "timestamp": "2025-07-29T21:28:38Z"
  },
  {
    "title": "NSA general counsel removed as Laura Loomer cites involvement",
    "description": "The firing of April Falcon Doss is the latest NSA departure fueled by the far-right activist, who previously took credit for the firing of the spy agency’s director.",
    "link": "https://www.nextgov.com/people/2025/07/nsa-general-counsel-removed-laura-loomer-cites-involvement/407078/",
    "timestamp": "2025-07-29T21:28:00Z"
  },
  {
    "title": "Conservatives pan Hawley tariff rebate proposal",
    "description": "The News\nSen. Josh Hawley, R-Mo., based his new bill to send $600 tariff rebate checks to Americans off of an idea from President Donald Trump. It’s still running into friendly fire from his fellow Republicans.\nHawley told Semafor he faces long odds but argue…",
    "link": "https://biztoc.com/x/1f923e3795fdbc47",
    "timestamp": "2025-07-29T21:27:47Z"
  },
  {
    "title": "‘Green-reg machine faces oblivion’: EPA chief plans to remove foundation for environmental rules costing Americans billions",
    "description": "Lee Zeldin says move will end '16 years of uncertainty for automakers and consumers'",
    "link": "https://www.wnd.com/2025/07/green-reg-machine-faces-oblivion-epa-chief-plans/",
    "timestamp": "2025-07-29T21:27:46Z"
  },
  {
    "title": "Despite starvation fears, Trump shows no sign of wider break with Netanyahu",
    "description": "The News\nPresident Donald Trump raised eyebrows this week when he broke with Israel Prime Minister Benjamin Netanyahu to declare apparent “real starvation” among children in Gaza.\nThat may well be as far as the divide goes between the two men.\nWhile Trump’s f…",
    "link": "https://biztoc.com/x/38256933ca980bf9",
    "timestamp": "2025-07-29T21:27:31Z"
  },
  {
    "title": "U.K. to Recognize Palestinian State Unless Israel Agrees to Cease-Fire",
    "description": "The announcement comes as a global hunger authority warns of famine across Gaza.",
    "link": "http://foreignpolicy.com/2025/07/29/uk-starmer-palestine-statehood-israel-gaza-famine-ipc-hunger-crisis-ghf/",
    "timestamp": "2025-07-29T21:25:33Z"
  },
  {
    "title": "South Park Season 27: Episode 2 release date, time, episode schedule and how to watch",
    "description": "South Park Season 27 Episode 2 airs July 30 on Comedy Central and streams July 31 on Paramount Plus. The season has 10 episodes with a weekly release. Episode 1 featured political satire, and more bold commentary is expected.",
    "link": "https://economictimes.indiatimes.com/news/international/us/south-park-season-27-episode-2-release-date-time-zones-schedule-streaming-paramount-plus-how-to-watch-comedy-central-streaming-global-viewers/articleshow/122983557.cms",
    "timestamp": "2025-07-29T21:25:01Z"
  },
  {
    "title": "Joe Rogan slams Trump administration over Epstein investigation: 'Trying to gaslight'",
    "description": "Joe Rogan slams Trump administration over Epstein investigation: 'Trying to gaslight'go.com",
    "link": "https://abcnews.go.com/Politics/gaslight-joe-rogan-slams-trump-administrations-handling-epstein/story?id=124175021",
    "timestamp": "2025-07-29T21:25:00Z"
  },
  {
    "title": "Markwayne Mullin Tells Scott Jennings What Options Republicans Have To Overcome Dems’ Obstruction On Trump Nominees",
    "description": "Markwayne Mullin told Scott Jennings that Republicans had not ruled out cancelling the August recess to confirm Donald Trump’s nominees to various positions.",
    "link": "https://dailycaller.com/2025/07/29/markwayne-mullin-scott-jennings-options-republicans-overcome-dems-obstruction-trump-nominees/",
    "timestamp": "2025-07-29T21:23:43Z"
  },
  {
    "title": "Zohran Mamdani Beats Out All NYC Mayoral Candidates Combined—New Poll",
    "description": "Mamdani is leading his major opponents beyond the margin of error in what is the largest NYC mayoral polling sample size to date.",
    "link": "https://www.newsweek.com/zohran-mamdani-andrew-cuomo-eric-adams-nyc-mayor-2105971",
    "timestamp": "2025-07-29T21:23:32Z"
  },
  {
    "title": "Trump says Jeffrey Epstein ‘stole’ Virginia Giuffre from Mar-a-Lago, details fallout of their relationship",
    "description": "Donald Trump said that Jeffrey Epstein took Virginia Giuffre from his Mar-a-Lago resort. Trump stated he ended his friendship with Epstein because of this. Giuffre, an Epstein survivor, died earlier this year. Trump denied any involvement in Epstein's abuses.…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-says-jeffrey-epstein-stole-virginia-giuffre-from-mar-a-lago-details-fallout-of-their-relationship/articleshow/122983589.cms",
    "timestamp": "2025-07-29T21:22:26Z"
  },
  {
    "title": "Oil prices help S&P/TSX composite close higher on Tuesday, U.S. markets fall",
    "description": "TORONTO — Canada’s main stock index finished higher to cap off trading on Tuesday, benefiting from a rise in oil prices, while U.S. markets moved lower. The S&P/TSX composite index closed up 134.46 points at 27,539.88. “It’s been a mixed day, following a very…",
    "link": "https://financialpost.com/pmn/oil-prices-help-sp-tsx-composite-close-higher-on-tuesday-u-s-markets-fall",
    "timestamp": "2025-07-29T21:21:30Z"
  },
  {
    "title": "Trump jolts Epstein scandal with new comments about Virginia Giuffre and Mar-a-Lago spa (Steve Benen/MSNBC)",
    "description": "Steve Benen / MSNBC:\nTrump jolts Epstein scandal with new comments about Virginia Giuffre and Mar-a-Lago spa  —  The president took the Epstein controversy in a new direction, commenting specifically on one of the most prominent victims of Epstein's sexual ab…",
    "link": "https://www.memeorandum.com/250729/p120",
    "timestamp": "2025-07-29T21:20:01Z"
  },
  {
    "title": "A new executive order tackles causes of homelessness. Why are some advocates worried?",
    "description": "President Donald Trump is aiming to fundamentally shift how the country manages homelessness with a new executive order he signed last week. <br><br>It calls for changes that would make it easier for states and cities to move people living on the street into …",
    "link": "https://www.npr.org/2025/07/29/1256371481/new-executive-order-on-homelessness-worries-advocates",
    "timestamp": "2025-07-29T21:19:42Z"
  },
  {
    "title": "Treason, Epstein, And ‘Distractions’ — A Guide For The Perplexed",
    "description": "Shortly after President Donald Trump accused Barack Obama of treason – an epithet that has been thrown at Trump practically every day – Obama spokesman Patrick Rodenbush said: “These bizarre allegations are ridiculous and a weak attempt at distraction.”\nDistr…",
    "link": "https://biztoc.com/x/150db51f2b488192",
    "timestamp": "2025-07-29T21:16:21Z"
  },
  {
    "title": "Oklahoma Investigating Explicit Images Reportedly Seen On Education Chief's TV",
    "description": "Authorities in Oklahoma opened the investigation after two members of the State Board of Education said they saw images of naked women on a TV screen in the office of state School Superintendent Ryan Walters.",
    "link": "https://www.huffpost.com/entry/ryan-walters-oklahoma-investigating-explicit-images-on-education-chiefs-tv_n_68893869e4b08681ba5e83a3",
    "timestamp": "2025-07-29T21:16:09Z"
  },
  {
    "title": "Trump’s EPA Moves to Kill “Holy Grail” of Climate Regulations",
    "description": "On Tuesday, Environmental Protection Agency Administrator Lee Zeldin announced a proposal to rescind the agency’s 2009 “endangerment finding,” a critical Obama-era scientific decision about the human health costs of greenhouse gases that allows the EPA to reg…",
    "link": "https://www.motherjones.com/politics/2025/07/trump-epa-endangerment-greenhouse-gas-emissions/",
    "timestamp": "2025-07-29T21:14:56Z"
  },
  {
    "title": "DOGE and other day 1 Trump appointees head for the exits at multiple agencies",
    "description": "The Interior Department and General Services Administration are seeing significant turnover in the leadership ranks.",
    "link": "https://www.govexec.com/management/2025/07/doge-and-other-day-one-trump-appointees-head-exits-multiple-agencies/407075/",
    "timestamp": "2025-07-29T21:14:00Z"
  },
  {
    "title": "Ghislaine Maxwell Offers Terms in Exchange for Testifying Before Congress",
    "description": "Ghislaine Maxwell, the former assistant to convicted sex offender Jeffrey Epstein, wants immunity and questions provided to her in advance in exchange for her compliance with a congressional subpoena.\nThe post Ghislaine Maxwell Offers Terms in Exchange for Te…",
    "link": "https://www.breitbart.com/politics/2025/07/29/ghislaine-maxwell-offers-terms-in-exchange-for-testifying-before-congress/",
    "timestamp": "2025-07-29T21:13:41Z"
  },
  {
    "title": "New York Democrats unveil their own mid-decade redistricting scheme, targeting future elections",
    "description": "As Texas Republicans slowly move forward with plans to redraw congressional maps mid-decade, Democrats in New York on Tuesday plowed ahead with their own scheme intended to counter any GOP redistricting efforts",
    "link": "https://www.nbcnews.com/politics/2026-election/new-york-democrats-unveil-decade-redistricting-scheme-targeting-future-rcna221811",
    "timestamp": "2025-07-29T21:13:03Z"
  },
  {
    "title": "The Government Reportedly Has the Missing Footage Outside Epstein's Cell",
    "description": "Insiders say that the government is in possession of the \"missing minute\" from the footage of Jeffrey Epstein's jail cell when he died.",
    "link": "https://futurism.com/epstein-cell-missing-footage",
    "timestamp": "2025-07-29T21:10:45Z"
  },
  {
    "title": "Trump says Israel will ‘preside over’ US aid distribution in Gaza",
    "description": "US president says Israel would do a 'good job' of aid delivery in Gaza despite the mounting death toll at GHF sites.",
    "link": "https://www.aljazeera.com/news/2025/7/29/trump-says-israel-will-preside-over-us-aid-distribution-in-gaza",
    "timestamp": "2025-07-29T21:09:08Z"
  }
]