[
  {
    "title": "Canadian Prime Minister Carney names a new foreign minister in a Cabinet shake-up",
    "description": "Canadian Prime Minister Mark Carney has announced a major Cabinet shakeup, including a new foreign minister",
    "link": "https://abcnews.go.com/Business/wireStory/canadian-prime-minister-carney-names-new-foreign-minister-121778622",
    "timestamp": "2025-05-14T04:00:26Z"
  },
  {
    "title": "Dave Smith Tells Tucker Carlson That Kamala Turning Down Joe Rogan Was Actually ‘The Right Move’ For Her Campaign",
    "description": "Dave Smith told Tucker Carlson Harris not going on Rogan’s show had been the \"right move\" for her campaign due to being unable to risk being \"exposed.\"",
    "link": "https://dailycaller.com/2025/05/14/dave-smith-tucker-carlson-kamala-harris-campaign-2024-joe-rogan-new-media-donald-trump/",
    "timestamp": "2025-05-14T04:00:15Z"
  },
  {
    "title": "Want Diversity? Start With Professional Sports",
    "description": "Diversity, Equity, and Inclusion (DEI) are the new buzzwords of the day, expressing our modern woke culture and society.\r\n\r\nBut for the next four years, DEI will DIE, but perhaps resurrect under a future Democrat administration.\r\n\r\nDEI has",
    "link": "https://www.americanthinker.com/articles/2025/05/want_diversity_start_with_professional_sports.html",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "Winton Land’s $200m Ayrburn screen hub fast-tracking follows Donald Trump’s 100% foreign film tariff",
    "description": "'Potential short-term imposition on a very long-term asset.' - Chris Meehan on film tariff",
    "link": "https://www.nzherald.co.nz/property/winton-lands-200m-ayrburn-screen-hub-fast-tracking-follows-donald-trumps-100-foreign-film-tariff/DQKWXLMR3RBR5PUFPH7RIZJSGQ/",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "Why the GOP won’t get dirty—even when the Left plays filthy",
    "description": "The political battlefield is scorched—and Democrats are lighting the fires. From smear campaigns and street riots to weaponized investigations, the left has embraced chaos as a political tool. So why won’t Republicans fight back with equa...",
    "link": "https://www.americanthinker.com/blog/2025/05/why_the_gop_won_t_get_dirty_even_when_the_left_plays_filthy.html",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "With each passing day, the Democrats are proving they hate America",
    "description": "Despite the Democrats' continued, unconstitutional and preposterous lawfare, including their judge-shopping for leftist stooges who will do their bidding, President Trump is doing amazing things. \r\n\r\nSure, those crooked judges are delaying h...",
    "link": "https://www.americanthinker.com/blog/2025/05/with_each_passing_day_the_democrats_are_proving_they_hate_america.html",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "Pharma bosses fear cuts in Irish drug manufacturing on back of Trump policy",
    "description": "Air of uncertainty around future on tariffs and pricing seen as negative for investment sentiment in Ireland",
    "link": "https://www.irishtimes.com/business/2025/05/14/pharma-bosses-fear-cuts-in-irish-drug-manufacturing-on-back-of-trump-policy/",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "What the Latest Tariff Pause Means to the Photo Industry",
    "description": "Back on April 11, News Editor, Nilofer Khan, ran through the numbers of what Donald Trump’s “Liberation Day” tariffs would end up costing photographers. Since then, professionals and enthusiasts alike have begun to feel the impact of the self-inflicted econom…",
    "link": "https://www.thephoblographer.com/2025/05/14/tariff-pause-may-2025/",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "Decimation, Due Process, and Deportations",
    "description": "Since the Enlightenment, the Anglosphere has had a laudable commitment to due process, which means opposing the brutality of group punishment. But what happens when that commitment leads to societal suicide? Our Founders cannot have intended this, es...",
    "link": "https://www.americanthinker.com/articles/2025/05/decimation_due_process_and_deportations.html",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "Libya: ICC’s Role Critical for Justice",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Members meet for a United Nations Security Council meeting in New York City, July 17, 2023.\n © 2023 Spencer Platt/Getty Images\n \n \n\n\n \n(New York) – The International Criminal Court (ICC) prosecutor’s upcoming briefin…",
    "link": "https://www.hrw.org/news/2025/05/14/libya-iccs-role-critical-justice",
    "timestamp": "2025-05-14T04:00:00Z"
  },
  {
    "title": "China, US to lift sweeping tariffs in trade war climbdown",
    "description": "BEIJING: The United States and China will lift sweeping tariffs on each other's goods for 90 days on Wednesday (May 14), after a temporary ceasefire in a brutal trade war that roiled global markets and international s",
    "link": "https://www.channelnewsasia.com/world/china-us-lift-tariffs-trade-war-5128621",
    "timestamp": "2025-05-14T03:56:47Z"
  },
  {
    "title": "China, US slash sweeping tariffs in trade war climbdown",
    "description": "BEIJING: The United States and China slashed sweeping tariffs on each other's goods for 90 days on Wednesday (May 14), after a temporary ceasefire in a brutal trade war that roiled global markets and international sup",
    "link": "https://www.channelnewsasia.com/world/china-us-trump-tariffs-trade-war-90-days-5128621",
    "timestamp": "2025-05-14T03:56:00Z"
  },
  {
    "title": "Nvidia stock soars on US-Saudi AI deal backed by Trump, bin Salman",
    "description": "Nvidia’s shares soared amid billions of dollars in artificial intelligence investment deals made between US President Donald Trump and Saudi Arabia’s Crown Prince Mohammed bin Salman, as the Trump administration deepens ties with the wealthy Middle Eastern na…",
    "link": "https://biztoc.com/x/289aaf1df847f90c",
    "timestamp": "2025-05-14T03:55:58Z"
  },
  {
    "title": "Trump vows to lift sanctions on Syria",
    "description": "US President Donald Trump has promised to remove sanctions from Syria Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617489-trump-lifts-sanctions-syria/",
    "timestamp": "2025-05-14T03:53:54Z"
  },
  {
    "title": "Trump Puts Dealmaking Over Rights In Saudi Arabia Policy Speech",
    "description": "President Donald Trump sent a message to the world in Saudi Arabia: make business deals and the US won&#039;t meddle in your affairs.",
    "link": "https://www.ndtv.com/world-news/donald-trump-puts-dealmaking-over-rights-in-saudi-arabia-policy-speech-8408987",
    "timestamp": "2025-05-14T03:45:06Z"
  },
  {
    "title": "How federal spending cuts to SNAP could impact San Antonio Food Bank",
    "description": "The CEO of the San Antonio Food Bank is raising concerns about potential cuts to the Supplemental Nutrition and Assistance Program, known as SNAP.",
    "link": "https://www.ksat.com/news/politics/2025/05/14/how-federal-spending-cuts-to-snap-could-impact-san-antonio-food-bank/",
    "timestamp": "2025-05-14T03:45:02Z"
  },
  {
    "title": "China, US to lift sweeping tariffs in trade war climbdown",
    "description": "BEIJING &mdash; The United States and China will lift sweeping tariffs on each others' goods for 90 days on Wednesday, after a temporary ceasefire in a brutal trade war that roiled global markets and international supply chains.",
    "link": "https://www.bangkokpost.com/business/general/3025332/china-us-to-lift-sweeping-tariffs-in-trade-war-climbdown",
    "timestamp": "2025-05-14T03:45:00Z"
  },
  {
    "title": "‘SNL’s’ Sarah Sherman Confronts Aimee Lou Wood Impersonation Backlash: ‘I Feel Terrible That Anyone Would Feel Bad’",
    "description": "Sarah Sherman is giving her side of the Aimee Lou Wood “Saturday Night Live” beef. Back in April, “SNL” aired a parody of “The White Lotus” featuring Sherman as an extremely unflattering caricature of Wood’s character, Chelsea. In a recent sit-down with Vanit…",
    "link": "https://variety.com/2025/tv/news/sarah-sherman-aimee-lou-wood-snl-impersonation-white-lotus-1236397000/",
    "timestamp": "2025-05-14T03:41:02Z"
  },
  {
    "title": "Trump's Middle East visit comes as his family deepens its business, crypto ties in the region",
    "description": "It’s not just the “gesture” of a $400 million luxury plane that President Donald Trump says he’s smart to accept from Qatar.",
    "link": "https://www.wsls.com/news/politics/2025/05/14/trumps-middle-east-visit-comes-as-his-family-deepens-its-business-crypto-ties-in-the-region/",
    "timestamp": "2025-05-14T03:40:55Z"
  },
  {
    "title": "China, US to lift sweeping tariffs in trade war climbdown",
    "description": "The United States and China will lift sweeping tariffs on each others' goods for 90 days on Wednesday, after a temporary ceasefire in a brutal trade war that roiled global markets and international supply chains. Under the deal, the United States agreed to lo…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-us-to-lift-sweeping-tariffs-in-trade-war-climbdown/articleshow/121151984.cms",
    "timestamp": "2025-05-14T03:38:10Z"
  },
  {
    "title": "Asian markets swing as China-US trade euphoria fades",
    "description": "HONG KONG: Asian stocks fluctuated Wednesday (May 14), with investors struggling to track a strong day on Wall Street as euphoria over the China-US trade detente petered out. But while the days of breathtaking volatility seen through April appear to be over f…",
    "link": "https://www.channelnewsasia.com/business/asian-markets-swing-china-us-trade-euphoria-fades-5128591",
    "timestamp": "2025-05-14T03:38:02Z"
  },
  {
    "title": "3 Myths About Tariffs",
    "description": "Last month, President Donald Trump proudly announced, \"Liberation Day!…The day American industry was reborn!\" Reborn because of his tariffs, which",
    "link": "https://reason.com/2025/05/14/3-myths-about-tariffs/",
    "timestamp": "2025-05-14T03:36:10Z"
  },
  {
    "title": "Trump's Qatar Jet Gift Is The Stuff Of Nightmares In Spyworld: Experts",
    "description": "Qatar&#039;s offer of a luxury Boeing 747 to President Donald Trump has set off alarm bells within the US intelligence and diplomatic community, where gifts from foreign powers have long been viewed with suspicion.",
    "link": "https://www.ndtv.com/world-news/donald-trumps-qatar-jet-gift-is-the-stuff-of-nightmares-in-spyworld-experts-8408933",
    "timestamp": "2025-05-14T03:35:13Z"
  },
  {
    "title": "How Donald Trump Can Terminate Tariff Turmoil",
    "description": "<p>This past April has been one of the most volatile months in stock market history, thanks to the Trump administration's botched rollout of its so-called reciprocal tariff rates. However, this tariff threat has at least succeeded in bringing other nations to…",
    "link": "https://www.realclearpolitics.com/2025/05/13/how_donald_trump_can_terminate_tariff_turmoil_646614.html",
    "timestamp": "2025-05-14T03:34:05Z"
  },
  {
    "title": "China, US To Lift Sweeping Tariffs In Trade War Climbdown",
    "description": "The United States and China will lift sweeping tariffs on each others' goods for 90 days on Wednesday, after a temporary ceasefire in a brutal trade war that roiled global markets and international supply chains.",
    "link": "https://www.ibtimes.com/china-us-lift-sweeping-tariffs-trade-war-climbdown-3773461",
    "timestamp": "2025-05-14T03:33:20Z"
  },
  {
    "title": "Trump Asks Saudi Crown Prince, \"How Do You Sleep At Night?\" His Response",
    "description": "US President Donald Trump had an unusual question for Saudi Crown Prince Mohammed bin Salman as he praised him for making Riyadh a major world business center.",
    "link": "https://www.ndtv.com/world-news/trump-asks-saudi-crown-prince-how-do-you-sleep-at-night-his-response-8408923",
    "timestamp": "2025-05-14T03:32:28Z"
  },
  {
    "title": "Asian shares mostly gain amid cautious relief over U.S.-China agreement",
    "description": "TOKYO (AP) — Asian shares were mostly higher Wednesday as a cautious sense of relief spread through regional markets after the U.S. and China agreed to a 90-day pause in their trade war. Japan’s benchmark Nikkei 225 lost 0.8% to 37,874.59. Australia’s S&P/ASX…",
    "link": "https://financialpost.com/pmn/asian-shares-mostly-gain-amid-cautious-relief-over-u-s-china-agreement",
    "timestamp": "2025-05-14T03:31:17Z"
  },
  {
    "title": "In Trump's World, Aircraft Are Key To Unlocking Political Favors",
    "description": "President Donald Trump&#039;s long-held fascination with the world of aviation is proving a useful tool for governments and companies seeking to win his favor.",
    "link": "https://www.ndtv.com/world-news/in-trumps-world-aircraft-are-key-to-unlocking-political-favors-8408890",
    "timestamp": "2025-05-14T03:27:20Z"
  },
  {
    "title": "China, US to lift sweeping tariffs in trade war climbdown",
    "description": "The United States and China will lift sweeping tariffs on each others’ goods for 90 days on Wednesday, after a temporary ceasefire in a brutal trade war that roiled global markets and international supply chains. Washington and Beijing had agreed to drastical…",
    "link": "https://www.digitaljournal.com/world/china-us-to-lift-sweeping-tariffs-in-trade-war-climbdown/article",
    "timestamp": "2025-05-14T03:27:20Z"
  },
  {
    "title": "Crypto platform FalconX partners with Standard Chartered",
    "description": "FalconX partners with Standard Chartered to serve institutional crypto investors, leveraging banking services for efficient fiat currency settlements.",
    "link": "https://www.thehindubusinessline.com/money-and-banking/cryptocurrency/crypto-platform-falconx-partners-with-standard-chartered/article69573862.ece",
    "timestamp": "2025-05-14T03:25:38Z"
  },
  {
    "title": "A Guide To The Tax Cuts In (And Out) Of Trump’s ‘Big, Beautiful Bill’",
    "description": "A draft House version of the massive GOP  tax and budget bill would make some expiring tax cuts permanent. Other goodies, including a bigger child tax credit and tax breaks for tips and overtime, are temporary.",
    "link": "https://www.forbes.com/sites/kellyphillipserb/2025/05/13/a-guide-to-the-tax-cuts-in-and-out-of-trumps-big-beautiful-bill/",
    "timestamp": "2025-05-14T03:23:43Z"
  },
  {
    "title": "Asian Markets Swing As China-US Trade Euphoria Fades",
    "description": "Asian stocks fluctuated Wednesday, with investors struggling to track a strong day on Wall Street as euphoria over the China-US trade detente petered out.",
    "link": "https://www.ibtimes.com/asian-markets-swing-china-us-trade-euphoria-fades-3773459",
    "timestamp": "2025-05-14T03:21:17Z"
  },
  {
    "title": "Trump's Middle East visit comes as his family deepens its business, crypto ties in the region",
    "description": "It’s not just the “gesture” of a $400 million luxury plane that President Donald Trump says he’s smart to accept from Qatar",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-middle-east-visit-family-deepens-business-crypto-121778990",
    "timestamp": "2025-05-14T03:18:31Z"
  },
  {
    "title": "Asian markets swing as China-US trade euphoria fades",
    "description": "Asian stocks fluctuated Wednesday, with investors struggling to track a strong day on Wall Street as euphoria over the China-US trade detente petered out. But while the days of breathtaking volatility seen through April appear to be over for now, analysts war…",
    "link": "https://www.digitaljournal.com/world/asian-markets-swing-as-china-us-trade-euphoria-fades/article",
    "timestamp": "2025-05-14T03:17:32Z"
  },
  {
    "title": "US tech firms Nvidia, AMD secure AI deals as Trump tours Gulf states",
    "description": "US tech giants, including Nvidia, AMD, and Qualcomm, announced major AI deals in the Middle East during President Trump's Gulf tour, securing $600 billion in commitments. Saudi-backed startup Humain will deploy massive AI infrastructure. The US and Saudi Arab…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-tech-firms-nvidia-amd-secure-ai-deals-as-trump-tours-gulf-states/articleshow/121151739.cms",
    "timestamp": "2025-05-14T03:17:18Z"
  },
  {
    "title": "Crypto platform FalconX partners with Standard Chartered",
    "description": "FalconX will leverage Standard Chartered's banking and foreign exchange services - including its access to a wide range of currencies - to support its institutional clients, said Matt Long, FalconX's general manager of APAC & Middle East. The California-based…",
    "link": "https://economictimes.indiatimes.com/tech/technology/crypto-platform-falconx-partners-with-standard-chartered/articleshow/121151663.cms",
    "timestamp": "2025-05-14T03:14:02Z"
  },
  {
    "title": "Israel and Trump at odds over Iran nuclear strategy",
    "description": "Jerusalem (AFP) May 13, 2025 -\n Israel is threatening military action against Iran while US President Donald Trump pursues diplomacy, exposing a growing rift between the long-time allies over how to confront the Islamic republic's advancing nuclear programme.…",
    "link": "https://www.spacewar.com/reports/Israel_and_Trump_at_odds_over_Iran_nuclear_strategy_999.html",
    "timestamp": "2025-05-14T03:08:16Z"
  },
  {
    "title": "Crypto platform FalconX partners with Standard Chartered",
    "description": "HONG KONG (Reuters) -Crypto prime broker FalconX and global bank Standard Chartered said on Wednesday they had formed a strategic partnership to serve...",
    "link": "https://finance.yahoo.com/news/crypto-platform-falconx-partners-standard-030304312.html",
    "timestamp": "2025-05-14T03:03:04Z"
  },
  {
    "title": "Buttigieg, eyeing a presidential run, says 'maybe' Biden hurt Democrats (Hannah Knowles/Washington Post)",
    "description": "Hannah Knowles / Washington Post:\nButtigieg, eyeing a presidential run, says ‘maybe’ Biden hurt Democrats  —  The former Biden administration official was in Iowa, where he warned in his highest-profile public appearance since leaving government not to ‘hang …",
    "link": "https://www.memeorandum.com/250513/p153",
    "timestamp": "2025-05-14T03:00:28Z"
  },
  {
    "title": "US and China agree to 90-day pause on most recent tariffs – US tariffs reduced to 30%, China drops to 10%",
    "description": "The United States and China have announced a 90-day pause on most of their recent tariffs on each other following talks between both countries in Geneva, Switzerland last weekend. Under the agreement, the US’ combined […]\nThe post US and China agree to 90-day…",
    "link": "https://paultan.org/2025/05/14/us-and-china-agree-to-90-day-pause-on-most-recent-tariffs/",
    "timestamp": "2025-05-14T02:59:48Z"
  },
  {
    "title": "Trump Grumbles Air Force One Looks Puny Parked by Arab Leaders’ Planes: ‘Much Less Impressive’",
    "description": "While flying on Air Force One with Fox News host Sean Hannity, President Donald Trump complained about his plane looking \"much smaller\" and \"much less impressive\" when parked next to the ones for various Arab leaders.\nThe post Trump Grumbles Air Force One Loo…",
    "link": "https://www.mediaite.com/trump/trump-grumbles-air-force-one-looks-puny-parked-by-arab-leaders-planes-much-less-impressive/",
    "timestamp": "2025-05-14T02:58:09Z"
  },
  {
    "title": "CNN Host Confronts Chuck Schumer On Biden's Health: 'Did You Really Not Have Any Idea?'",
    "description": "CNN's Kasie Hunt questioned the senator on seeing the former president \"up close and personal\" several months before he abandoned his reelection bid.",
    "link": "https://www.huffpost.com/entry/cnn-kasie-hunt-chuck-schumer-joe-biden-book_n_6823e2f2e4b0993b52bf807b",
    "timestamp": "2025-05-14T02:52:34Z"
  },
  {
    "title": "Robert De Niro labels Trump a ‘philistine president’ at Cannes for targeting the arts",
    "description": "‘We can’t just sit back and watch. We have to act, and we have to act now – not with violence, but with great passion and determination,’ said the actor",
    "link": "https://www.the-independent.com/life-style/robert-de-niro-trump-cannes-film-festival-b2751230.html",
    "timestamp": "2025-05-14T02:50:00Z"
  },
  {
    "title": "Trump vows Iran won't get Nuclear weapon",
    "description": "US News: US President Donald Trump called Iran the \"most destructive force\" in West Asia, blaming Tehran for instability across the region and warning the US w.",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-vows-iran-wont-get-nuclear-weapon/articleshow/121151026.cms",
    "timestamp": "2025-05-14T02:45:28Z"
  },
  {
    "title": "House GOP Receives Backlash After Posting in Spanish: ‘Should Be Fired Immediately’",
    "description": "The House Republican Conference received backlash from conservatives on Tuesday after it published a social media post in Spanish.\nThe post House GOP Receives Backlash After Posting in Spanish: ‘Should Be Fired Immediately’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/house-gop-receives-backlash-after-posting-in-spanish-should-be-fired-immediately/",
    "timestamp": "2025-05-14T02:42:28Z"
  },
  {
    "title": "Red carpet welcome? Saudi Arabia rolls out a lavender one for US president",
    "description": "Middle East News: No, don't call it purple. When President Donald Trump disembarked from Air Force One in Saudi Arabia on Tuesday, he stepped onto the rich lavender-col.",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/red-carpet-welcome-saudi-arabia-rolls-out-a-lavender-one-for-us-president/articleshow/121150923.cms",
    "timestamp": "2025-05-14T02:42:09Z"
  },
  {
    "title": "Josh Hawley Says Trump Served ‘It Up Straight’ To Democrats As Well As Neocons",
    "description": "Republican Missouri Sen. Josh Hawley praised on Fox News Tuesday the blunt approach of President Donald Trump, saying he \"served it up straight.\"",
    "link": "https://dailycaller.com/2025/05/13/josh-hawley-dems-trump-neocons/",
    "timestamp": "2025-05-14T02:41:18Z"
  },
  {
    "title": "Iran hints at enrichment compromise, warns against 'retreat from principles'",
    "description": "Iran’s Deputy FM says his country may accept temporary limits on uranium enrichment, though no technical details have been discussed yet.",
    "link": "https://www.israelnationalnews.com/news/408322",
    "timestamp": "2025-05-14T02:40:27Z"
  },
  {
    "title": "India disputes Trump's claim that trade incentives led to the India-Pakistan ceasefire",
    "description": "The Indian government on Tuesday disputed U.S. President Donald Trump’s claim that the U.S.-mediated ceasefire between India and Pakistan came about in part because he had offered possible trade concessions",
    "link": "https://abcnews.go.com/International/wireStory/india-disputes-trumps-claim-trade-incentives-led-india-121757083",
    "timestamp": "2025-05-14T02:38:26Z"
  },
  {
    "title": "Harvard hit by 450 mln USD federal cut over antisemitism",
    "description": "NEW YORK, May 13 (Xinhua) -- U.S. President Donald Trump's administration has said it will terminate",
    "link": "http://en.people.cn/n3/2025/0514/c90000-20314588.html",
    "timestamp": "2025-05-14T02:37:55Z"
  },
  {
    "title": "Trump Favors $40-$50 Oil, Goldman Says After Scrutinizing Posts",
    "description": "US President Donald Trump appears to prefer oil prices between $40 and $50 a barrel, according to Goldman Sachs Group Inc., citing an in-house analysis of his social-media posts on the topic.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-favors-40-50-oil-goldman-says-after-scrutinizing-posts",
    "timestamp": "2025-05-14T02:37:45Z"
  },
  {
    "title": "Trump inks major defense deal with Saudi Arabia, announces plan to lift sanctions on Syria",
    "description": "RIYADH, May 13 (Xinhua) -- U.S. President Donald Trump on Tuesday secured a 600-billion-U.S. dollar",
    "link": "http://en.people.cn/n3/2025/0514/c90000-20314584.html",
    "timestamp": "2025-05-14T02:37:24Z"
  },
  {
    "title": "Biden aide hits back at new book alleging cover-up of his 'deterioration'",
    "description": "Biden's condition during his 2024 presidential campaign was said to be so poor that aides discussed putting him in a wheelchair.",
    "link": "https://www.bbc.com/news/articles/c4g23zzl1gwo",
    "timestamp": "2025-05-14T02:29:01Z"
  },
  {
    "title": "Carney unveils new Cabinet, aiming to redefine U.S.-Canada relationship",
    "description": "The new prime minister says Canada must shift the economy's focus away from the United States, end barriers to internal trade and cut public spending.",
    "link": "https://www.japantimes.co.jp/news/2025/05/14/world/politics/carney-cabinet-us-canada-ties/",
    "timestamp": "2025-05-14T02:29:00Z"
  },
  {
    "title": "Maggie Haberman Says Trump ‘Looks About as Happy as You Can Imagine’ Because Saudis Are Treating Him ‘Like a King’",
    "description": "President Donald Trump was feted on Tuesday after arriving in Saudi Arabia, which is pulling out all the stops to welcome him on his first foreign trip in his second term.\nThe post Maggie Haberman Says Trump ‘Looks About as Happy as You Can Imagine’ Because S…",
    "link": "https://www.mediaite.com/tv/maggie-haberman-says-trump-looks-about-as-happy-as-you-can-imagine-because-saudis-are-treating-him-like-a-king/",
    "timestamp": "2025-05-14T02:28:50Z"
  },
  {
    "title": "Trump administration cuts additional $450 million in federal grants to Harvard University",
    "description": "The move follows the freezing of $2.2 billion in prior funding and comes a day after Harvard publicly challenged the administration’s claims that it fosters liberal bias and antisemitism",
    "link": "https://www.thehindubusinessline.com/news/education/trump-administration-cuts-additional-450-million-in-federal-grants-to-harvard-university/article69573825.ece",
    "timestamp": "2025-05-14T02:28:30Z"
  },
  {
    "title": "Trump Set To Meet Syrian Leader Ahead Of Qatar Visit",
    "description": "Donald Trump was set to meet the leader of Syria and the heads of the Gulf states Wednesday in Riyadh before travelling to Qatar where controversy is swirling over the gifting of a luxury aircraft.",
    "link": "https://www.ibtimes.com/trump-set-meet-syrian-leader-ahead-qatar-visit-3773452",
    "timestamp": "2025-05-14T02:27:07Z"
  },
  {
    "title": "Buttigieg says 'right now I’m not running for anything' during Iowa stop",
    "description": "Pete Buttigieg defends his record as transportation secretary after coming under attack from Trump, and says he's not running for anything right now, during a trip to Iowa",
    "link": "https://www.foxnews.com/politics/buttigieg-says-right-now-im-not-running-anything-during-iowa-stop",
    "timestamp": "2025-05-14T02:25:53Z"
  },
  {
    "title": "Michael Goodwin: Trump recklessly accepting a plane from Qatar is the type of unnecessary risk that could ruin his presidency",
    "description": "Over the years, numerous studies, speeches and books have focused on a phenomenon known as self-sabotage.",
    "link": "https://nypost.com/2025/05/13/opinion/michael-goodwin-trump-accepting-financial-gifts-from-qatar-is-one-of-the-many-ways-he-can-ruin-his-legacy/",
    "timestamp": "2025-05-14T02:25:27Z"
  },
  {
    "title": "'House of Marcos potentially sinking': Fallout from Philippine midterms",
    "description": "As the final votes are tallied, here's how the results could shape the future of the Duterte and Marcos clans in the Philippines.",
    "link": "https://www.abc.net.au/news/2025-05-14/philippines-election-could-shape-duterte-marcos-political-future/105288938",
    "timestamp": "2025-05-14T02:25:17Z"
  },
  {
    "title": "Zelenskyy says he will be waiting for Putin in Ankara on Thursday for talks",
    "description": "Ukrainian President Volodymyr Zelenskyy announced he will travel to Turkey to meet with President Erdogan and await Vladimir Putin for peace talks, amid pressure from the U.S. and Europe to end the war. Zelenskyy insists on a ceasefire as a prerequisite, whil…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelenskyy-says-he-will-be-waiting-for-putin-in-ankara-on-thursday-for-talks/articleshow/121150573.cms",
    "timestamp": "2025-05-14T02:23:51Z"
  },
  {
    "title": "Trump set to meet Syrian leader ahead of Qatar visit",
    "description": "Donald Trump was set to meet the leader of Syria and the heads of the Gulf states Wednesday in Riyadh before travelling to Qatar where controversy is swirling over the gifting of a luxury aircraft. The US president was set to “say hello” to Syria’s new leader…",
    "link": "https://www.digitaljournal.com/world/trump-set-to-meet-syrian-leader-ahead-of-qatar-visit/article",
    "timestamp": "2025-05-14T02:22:20Z"
  },
  {
    "title": "US inflation is the calm before Trump’s tariff storm",
    "description": "The US inflation rate was edging towards the Federal Reserve’s target range. Then Donald Trump launched his trade war on the rest of the world.",
    "link": "https://www.smh.com.au/business/the-economy/us-inflation-is-the-calm-before-trump-s-tariff-storm-20250514-p5lz0f.html",
    "timestamp": "2025-05-14T02:11:01Z"
  },
  {
    "title": "'Don't think the drug worked': Trump shames rich pal over failed Ozempic endeavor",
    "description": "President Donald Trump shared a personal anecdote of a wealthy friend whom he ended up mocking for his failed weight-loss effort using what the president called “the fat drug.”The off-the-cuff remarks came Tuesday during an interview with Fox News’ Sean Hanni…",
    "link": "https://www.rawstory.com/trump-ozempic/",
    "timestamp": "2025-05-14T02:07:29Z"
  },
  {
    "title": "Donald Trump details 'most exciting part' of China trade agreement",
    "description": "President Donald Trump highlights his administration's trade agreement with China and more recent accomplishments during a 'Hannity' exclusive interview.",
    "link": "https://www.foxnews.com/media/donald-trump-details-most-exciting-part-china-trade-agreement",
    "timestamp": "2025-05-14T02:06:51Z"
  },
  {
    "title": "20 states sue Trump administration over funding threats",
    "description": "A coalition of 20 state Democratic attorneys general says that the Trump administration is threatening to withhold billions of dollars in transportation and disaster-relief funds unless states agree to certain immigration enforcement actions.",
    "link": "https://www.wcvb.com/article/states-sue-trump-immigration-funding-threats/64759304",
    "timestamp": "2025-05-14T02:06:08Z"
  },
  {
    "title": "House Republicans face down Dem attacks, protests to pull all-nighter on Trump's 'big, beautiful bill'",
    "description": "House Republicans on three key committees are working to advance their respective portions of President Donald Trump's reconciliation bill.",
    "link": "https://www.foxnews.com/politics/house-republicans-face-down-dem-attacks-protests-pull-all-nighter-trumps-big-beautiful-bill",
    "timestamp": "2025-05-14T02:05:40Z"
  },
  {
    "title": "House Republicans push Trump agenda through all-night markup session",
    "description": "House Republicans on three key committees are working to advance their respective portions of President Donald Trump's reconciliation bill.",
    "link": "https://www.foxnews.com/politics/house-gop-moves-trumps-agenda-forward-all-night-committee-debate",
    "timestamp": "2025-05-14T02:05:40Z"
  },
  {
    "title": "Trump: Qatar stepped in after Boeing delays",
    "description": "United States President Donald Trump said in a Fox News interview that he's not pleased with The Boeing Company over delays in delivering a new Air Force One plane, but does not want to harm the a...",
    "link": "https://biztoc.com/x/a3c43de9258a3d8c",
    "timestamp": "2025-05-14T02:04:13Z"
  },
  {
    "title": "Some Republicans Voice Concern Over Trump's Plan To Accept Qatari Plane",
    "description": "\"There will be plenty of scrutiny,\" Republican Senate Majority Leader John Thune of South Dakota told reporters.",
    "link": "https://www.huffpost.com/entry/gop-voice-concern-qatar-place_n_6823f8b3e4b023f4744eaf47",
    "timestamp": "2025-05-14T02:04:03Z"
  },
  {
    "title": "Dollar steadies with trade talks in frame after sliding on cooler US inflation",
    "description": "The U.S. dollar stabilized after a significant overnight decline, spurred by softer-than-expected U.S. inflation data, strengthening the argument for Federal Reserve easing. Improved U.S. trade prospects, including agreements with Britain and a truce with Chi…",
    "link": "https://economictimes.indiatimes.com/markets/forex/dollar-steadies-with-trade-talks-in-frame-after-sliding-on-cooler-us-inflation/articleshow/121150348.cms",
    "timestamp": "2025-05-14T01:59:11Z"
  },
  {
    "title": "'Ridiculous!' Trump's new 'lie' torn apart as he doubles down on accepting Qatari jet",
    "description": "President Donald Trump has a new excuse for why he is accepting a $400 million luxury jumbo jet from the government of Qatar right as he is engaging in diplomatic talks in the Middle East, a development so controversial that even some Republicans are recoilin…",
    "link": "https://www.rawstory.com/trump-plane-2672011303/",
    "timestamp": "2025-05-14T01:57:31Z"
  },
  {
    "title": "Pete Rose reinstated by MLB, eligible for the Hall of Fame: How we got here and what it means",
    "description": "Rose’s removal from the permanently ineligible list does not guarantee his future enshrinement in the Hall.",
    "link": "https://sports.yahoo.com/mlb/article/pete-rose-reinstated-by-mlb-eligible-for-the-hall-of-fame-how-we-got-here-and-what-it-means-015535778.html",
    "timestamp": "2025-05-14T01:55:35Z"
  },
  {
    "title": "Gold falls as easing Sino-US trade woes dulls safe-haven appeal",
    "description": "Gold prices declined on Wednesday. This happened because of easing trade tensions between the United States and China. Demand for gold as a safe investment decreased. Markets are closely watching inflation data. This data will help assess the Federal Reserve'…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-falls-as-easing-sino-us-trade-woes-dulls-safe-haven-appeal/articleshow/121150314.cms",
    "timestamp": "2025-05-14T01:54:58Z"
  },
  {
    "title": "Left-wing commentator Hasan Piker says he was questioned inappropriately at O'Hare",
    "description": "Hasan Piker said he was detained and questioned by federal authorities at Chicago's O'Hare International Airport following a trip to Paris.",
    "link": "https://www.cbsnews.com/chicago/news/streamer-left-wing-commentator-hasan-piker-detained-ohare/",
    "timestamp": "2025-05-14T01:53:00Z"
  },
  {
    "title": "Can Donald Trump help it if so many people feel like giving him gifts, expecting nothing in return?",
    "description": "As any informed person knows, Donald Trump’s already unprecedented corruption is reaching new levels of completely straightforward graft: Donald Trump launched a memecoin a few days before the inauguration of his second presidential term. Its sole purpose, to…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/can-donald-trump-help-it-if-so-many-people-feel-like-giving-him-gifts-expecting-nothing-in-return",
    "timestamp": "2025-05-14T01:51:49Z"
  },
  {
    "title": "Carney reshapes Canadian cabinet, taps Anand as foreign minister",
    "description": "Canadian Prime Minister Mark Carney reshapes Cabinet, appoints Anita Anand as foreign minister, prioritizing economic growth and US relations.",
    "link": "https://www.thehindubusinessline.com/news/world/carney-reshapes-canadian-cabinet-taps-anand-as-foreign-minister/article69573807.ece",
    "timestamp": "2025-05-14T01:51:31Z"
  },
  {
    "title": "Trump lifts sanctions on Syria, urges new leaders to 'show us something special'",
    "description": "US President Trump announces the lifting of US sanctions on Syria following the Assad regime’s fall, calling it “a chance at greatness” for the war-torn country.",
    "link": "https://www.israelnationalnews.com/news/408320",
    "timestamp": "2025-05-14T01:51:07Z"
  },
  {
    "title": "S&P 500, Nasdaq end higher on soft inflation data, trade optimism",
    "description": "The S&P 500 and Nasdaq saw gains following encouraging inflation figures and a trade agreement between the United States and China. The Dow experienced a decline due to UnitedHealth's performance. Investors are now anticipating potential adjustments to intere…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-end-higher-on-soft-inflation-data-trade-optimism/articleshow/121150285.cms",
    "timestamp": "2025-05-14T01:50:54Z"
  },
  {
    "title": "Trump pledges to lift Syria sanctions as he seals $142bn arms deal on Saudi visit",
    "description": "President Donald Trump has said the US has \"no stronger partner\" than Saudi Arabia during his first major foreign trip - a whirlwind visit of Gulf countries mainly focused on shoring up investment. Speaking in Riyadh, the US president also pledged to lift all…",
    "link": "https://freerepublic.com/focus/f-news/4316846/posts",
    "timestamp": "2025-05-14T01:49:29Z"
  },
  {
    "title": "From Hillary Clinton killing a child at Diddy party to Bieber's viral song, how misinformation clouds Sean Combs's trial",
    "description": "From doctored photos of sex-fueled parties to a racy AI-generated song, a flood of misinformation surrounding music mogul Sean \"Diddy\" Combs threatens to distort public perception of his closely watched New York trial. The whirlwind of misinformation could di…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-hillary-clinton-killing-a-child-at-diddy-party-to-biebers-viral-song-how-misinformation-clouds-sean-combss-trial/articleshow/121150259.cms",
    "timestamp": "2025-05-14T01:48:05Z"
  },
  {
    "title": "‘Panic and paralysis’: US firms fret despite China tariff reprieve",
    "description": "President Donald Trump’s rollercoaster tariff row with Beijing has wreaked havoc on US companies that rely on Chinese manufacturing, with a temporary de-escalation only expected to partially calm the storm, analysts and business owners say. “The only option i…",
    "link": "https://www.digitaljournal.com/world/panic-and-paralysis-us-firms-fret-despite-china-tariff-reprieve/article",
    "timestamp": "2025-05-14T01:47:32Z"
  },
  {
    "title": "Misinformation Clouds Sean Combs's Sex Trafficking Trial",
    "description": "From doctored photos of sex-fueled parties to a racy AI-generated song, a flood of misinformation surrounding music mogul Sean \"Diddy\" Combs threatens to distort public perception of his closely watched New York trial.",
    "link": "https://www.ibtimes.com/misinformation-clouds-sean-combss-sex-trafficking-trial-3773450",
    "timestamp": "2025-05-14T01:45:15Z"
  },
  {
    "title": "Gaza rescuers say Israeli strikes killed 28 near hospital",
    "description": "JERUSALEM - Gaza rescuers said Israeli strikes close to a hospital in the Palestinian territory killed at least 28 people Tuesday, after Prime Minister Benjamin Netanyahu announced the military would enter Gaza \"with full force\" in the coming days.",
    "link": "https://www.bangkokpost.com/world/3025306/gaza-rescuers-say-israeli-strikes-killed-28-near-hospital",
    "timestamp": "2025-05-14T01:45:00Z"
  },
  {
    "title": "US agrees to sell Saudi Arabia $142 billion arms package",
    "description": "The United States and Saudi Arabia have agreed to a massive $142 billion arms deal, marking the largest defense cooperation agreement in U.S. history. Signed during President Trump's visit to Riyadh, the package includes deals with numerous U.S. defense compa…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-agrees-to-sell-saudi-arabia-142-billion-arms-package/articleshow/121150221.cms",
    "timestamp": "2025-05-14T01:43:48Z"
  },
  {
    "title": "Trump clarifies ownership of aircraft in defense of Qatar's gift",
    "description": "President Donald Trump accepted Qatar's $400 million Boeing 747 for U.S. use, sparking an emoluments clause ethics probe. The plane will serve as a temporary Air Force One.",
    "link": "https://www.foxnews.com/politics/trump-clarifies-ownership-aircraft-defense-qatars-gift",
    "timestamp": "2025-05-14T01:43:36Z"
  },
  {
    "title": "Syrians welcome sanctions relief, outcome remains unclear",
    "description": "In a partial policy shift, the US has eased some sanctions on Syria, allowing humanitarian aid, remittances, and limited civil sector activity.",
    "link": "https://www.jpost.com/middle-east/article-853869",
    "timestamp": "2025-05-14T01:43:34Z"
  },
  {
    "title": "사우디서 무슨 일 있었길래",
    "description": "Here's what you need to know to start your day https://t.co/7fax2sbX3a— Bloomberg (@business) May 13, 2025 Here’s the latest news and analysis on the oil market https://t.co/KOPj0sAqA3— Bloomberg (@business) May 13, 2025 On @cnn this morning with @BeckyCNN to…",
    "link": "https://ryueyes11.tistory.com/511627",
    "timestamp": "2025-05-14T01:43:12Z"
  },
  {
    "title": "Misinformation clouds Sean Combs’s sex trafficking trial",
    "description": "From doctored photos of sex-fueled parties to a racy AI-generated song, a flood of misinformation surrounding music mogul Sean “Diddy” Combs threatens to distort public perception of his closely watched New York trial. The larger-than-life rapper faces a slew…",
    "link": "https://www.digitaljournal.com/news/misinformation-clouds-sean-combss-sex-trafficking-trial/article",
    "timestamp": "2025-05-14T01:42:49Z"
  },
  {
    "title": "Misinformation clouds Sean Combs’s sex trafficking trial",
    "description": "From doctored photos of sex-fueled parties to a racy AI-generated song, a flood of misinformation surrounding music mogul Sean “Diddy” Combs threatens to distort public perception of his closely watched New York trial. The larger-than-life rapper faces a slew…",
    "link": "https://www.digitaljournal.com/world/misinformation-clouds-sean-combss-sex-trafficking-trial/article",
    "timestamp": "2025-05-14T01:42:49Z"
  },
  {
    "title": "'Panic And Paralysis': US Firms Fret Despite China Tariff Reprieve",
    "description": "President Donald Trump's rollercoaster tariff row with Beijing has wreaked havoc on US companies that rely on Chinese manufacturing, with a temporary de-escalation only expected to partially calm the storm, analysts and business owners say.",
    "link": "https://www.ibtimes.com/panic-paralysis-us-firms-fret-despite-china-tariff-reprieve-3773444",
    "timestamp": "2025-05-14T01:42:09Z"
  },
  {
    "title": "Trump: It's The Democrats' Fault We've Been Ripped Off For Years On Drugs, \"They Are To Blame For This\"",
    "description": "President Donald Trump touted his drug price proposal in an interview with FOX News host Sean Hannity on Air Force One.\r\n\r\nSEAN HANNITY, FOX NEWS: When I first saw you, and thank you for letting us cover this and report on this from Air Force One. When I firs…",
    "link": "https://www.realclearpolitics.com/video/2025/05/13/trump_its_the_democrats_fault_weve_been_ripped_off_for_years_on_drugs_they_are_to_blame_for_this.html",
    "timestamp": "2025-05-14T01:36:32Z"
  },
  {
    "title": "Reversal of fortune: How the populist right flamed out in a matter of months",
    "description": "How did the MAGA Right go from triumph to defeat so rapidly? While they can make excuses, their basic problem is they have no interest in governing well, only governing for themselves.\nThe post Reversal of fortune: How the populist right flamed out in a matte…",
    "link": "http://www.crikey.com.au/2025/05/14/maga-donald-trump-populist-right/",
    "timestamp": "2025-05-14T01:35:53Z"
  },
  {
    "title": "The Biggest Biden Bombshells From Jake Tapper and Alex Thompson's New Book",
    "description": "Tapper and Thompson's book, \"Original Sin,\" paints a damning portrait of Biden's team covering up his diminished state before the election.",
    "link": "https://www.newsweek.com/biden-bombshells-tapper-thompson-original-sin-2071884",
    "timestamp": "2025-05-14T01:33:20Z"
  },
  {
    "title": "Trump: Time for China to open its market",
    "description": "United States President Donald Trump told Fox News it's time for China to open its market, stressing the importance of fair trade.\nTrump said he believes a deal is possible, adding, \"We'...",
    "link": "https://biztoc.com/x/dfe8ac553fe7c379",
    "timestamp": "2025-05-14T01:31:19Z"
  },
  {
    "title": "Saoirse Hanley: In light of the news that Donald Trump answers the phone to unknown numbers, here’s a Gen Z guide to the smartphone for his administration",
    "description": "There are a lot of things that US President Donald Trump does that shock me, but little surprises me any more. We have all grown very used to reading about his gaffes from across the Atlantic Ocean, so it takes a lot to elicit more than an eye roll from me. B…",
    "link": "https://www.independent.ie/opinion/comment/saoirse-hanley-in-light-of-the-news-that-donald-trump-answers-the-phone-to-unknown-numbers-heres-a-gen-z-guide-to-the-smartphone-for-his-administration/a426834846.html",
    "timestamp": "2025-05-14T01:30:00Z"
  }
]