[
  {
    "title": "Higher US tariffs part of the price Europe was willing to pay for its security and arms for Ukraine",
    "description": "The EU-U.S. tariff agreement has been described as a “dark day” for Europe.",
    "link": "https://www.bostonherald.com/2025/07/29/europe-us-trade-ukraine/",
    "timestamp": "2025-07-29T17:49:04Z"
  },
  {
    "title": "Confirmed: Dems’ arguments against Trump would allow impeachment … of Obama!",
    "description": "'And that could also strip off the immunity. … The language itself says you’re still subject to criminal prosecution or indictment'",
    "link": "https://www.wnd.com/2025/07/confirmed-dems-arguments-against-trump-would-allow-impeachment/",
    "timestamp": "2025-07-29T17:47:32Z"
  },
  {
    "title": "What We Know About ‘Golf Force One’—Latest Addition To Trump’s Presidential Fleet",
    "description": "President Donald Trump debuted a fortified golf cart in Scotland this weekend, months after an alleged assasination plot failed at his Florida golf property.",
    "link": "https://www.forbes.com/sites/conormurray/2025/07/29/what-we-know-about-golf-force-one-latest-addition-to-trumps-presidential-fleet/",
    "timestamp": "2025-07-29T17:46:18Z"
  },
  {
    "title": "Two days to go: No clarity over US tariffs, trade pact talks on",
    "description": "With the US tariff deadline looming, uncertainty surrounds India's potential tariff rate despite ongoing trade negotiations. President Trump indicated tariffs of 15-20% for nations lacking separate trade deals, prompting concerns about a global trade contract…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/two-days-to-go-no-clarity-over-us-tariffs-trade-pact-talks-on/articleshow/122981534.cms",
    "timestamp": "2025-07-29T17:44:25Z"
  },
  {
    "title": "Trump confirms new deadline for Russia ten days",
    "description": "United States President Donald Trump confirmed on Tuesday that his new deadline for Russia to reach an agreement with Ukraine is ten days.More to come......",
    "link": "https://biztoc.com/x/e1c8e8f77e443f53",
    "timestamp": "2025-07-29T17:42:57Z"
  },
  {
    "title": "Kevin O'Leary Says The 'Tariff Drama' Is Settling And The Market's Calming Because Trump 'Found The Loophole'",
    "description": "Investor Kevin O’Leary, better known as “Mr. Wonderful” from the “Shark Tank” TV show, believes the U.S. market is stabilizing despite recent trade tensions because President Donald Trump has figured out a workaround on tariffs.\nTrump’s Strategy: Tariffs As A…",
    "link": "https://biztoc.com/x/8dd1374ce451dc3d",
    "timestamp": "2025-07-29T17:42:26Z"
  },
  {
    "title": "NTSB hearings will focus on fatal Army helicopter-passenger jet crash. Here's what to know",
    "description": "The National Transportation Safety Board will hold three days of hearings on the fatal midair collision between a passenger jet and an Army helicopter",
    "link": "https://abcnews.go.com/US/wireStory/ntsb-hearings-focus-fatal-army-helicopter-passenger-jet-124180316",
    "timestamp": "2025-07-29T17:42:26Z"
  },
  {
    "title": "Trump administration moves to repeal EPA rule that allows climate regulation",
    "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "link": "https://biztoc.com/x/0141ee7e2696952c",
    "timestamp": "2025-07-29T17:42:20Z"
  },
  {
    "title": "Food Prices Will Rise Under Trump, Group Warns",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump's tariffs, scheduled to increase on August 1, could result in significantly higher prices for a range of food groups.\nThis is according to an analysis published Monday by the bipartisan …",
    "link": "https://biztoc.com/x/2931c0055170105d",
    "timestamp": "2025-07-29T17:42:16Z"
  },
  {
    "title": "Diddy Tries Again To Get A $50M Get Outta Jail Card As Appeal & Sentencing Looms; “Sean Combs Should Not Be In Jail For This Conduct”",
    "description": "The much-accused Sean “Diddy” Combs may or may not be a lot of things, but the Bad Boy Records is certainly persistent in the short term and the long game. Stewing in Brooklyn’s Metropolitan Detention Center since his arrest on sex-trafficking and other charg…",
    "link": "http://deadline.com/2025/07/sean-combs-no-jail-time-sentencing-request-1236473245/",
    "timestamp": "2025-07-29T17:39:00Z"
  },
  {
    "title": "European countries to borrow billions from EU to rearm Ukraine",
    "description": "Governments can decide to ask for cheap loans from the EU before Tuesday's deadline.",
    "link": "https://www.politico.eu/article/european-countries-borrow-billions-from-eu-fund-ukraines-war-effort/",
    "timestamp": "2025-07-29T17:38:30Z"
  },
  {
    "title": "India and Trump still don't have a tariff deal: Here's why that matters",
    "description": "India and the United States face a trade impasse as tariff deadlines loom, despite deep ties and ongoing negotiations. While India seeks a comprehensive deal, the U.S. is poised to impose tariffs, potentially disadvantaging India compared to other Asian natio…",
    "link": "https://economictimes.indiatimes.com/news/india/india-and-trump-still-dont-have-a-tariff-deal-heres-why-that-matters/articleshow/122981404.cms",
    "timestamp": "2025-07-29T17:37:18Z"
  },
  {
    "title": "WATCH: Trump Drowned Out By His Own Bagpiper In Most Scottish Thing Ever",
    "description": "President Donald Trump was drowned out by a bagpiper at his own golf resort for a full two minutes as he tried to answer questions from reporters in Scotland.\nThe post WATCH: Trump Drowned Out By His Own Bagpiper In Most Scottish Thing Ever first appeared on …",
    "link": "https://www.mediaite.com/media/weird/watch-trump-drowned-out-by-his-own-bagpiper-in-most-scottish-thing-ever/",
    "timestamp": "2025-07-29T17:37:05Z"
  },
  {
    "title": "NTSB hearings will focus on fatal Army helicopter-passenger jet crash. Here’s what to know",
    "description": "The goal of the hearings is to pinpoint what went wrong and how to avoid similar accidents.",
    "link": "https://www.bostonherald.com/2025/07/29/ntsb-hearings-washington-plane-crash/",
    "timestamp": "2025-07-29T17:36:49Z"
  },
  {
    "title": "Starmer says UK to recognize Palestinian state if Israel doesn't agree to ceasefire, Hamas must 'disarm'",
    "description": "The United Kingdom set a September deadline for Israel to agree to a Gaza ceasefire or face the U.K.'s recognition of a Palestinian state.",
    "link": "https://www.foxnews.com/world/starmer-uk-recognize-palestinian-state-israel-doesnt-agree-ceasefire-hamas-must-disarm",
    "timestamp": "2025-07-29T17:35:35Z"
  },
  {
    "title": "Donald Trump says he didn't discuss UK plan to recognise Palestinian state with PM Keir Starmer",
    "description": "Donald Trump clarified that discussions with Keir Starmer did not involve Britain's potential recognition of a Palestinian state. This plan was contingent on Israel improving conditions for Palestinians. Trump addressed reporters aboard Air Force One, confirm…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/donald-trump-says-he-didnt-discuss-uk-plan-to-recognise-palestinian-state-with-pm-keir-starmer/articleshow/122981342.cms",
    "timestamp": "2025-07-29T17:34:16Z"
  },
  {
    "title": "Democratic-led states sue Trump administration to stop Planned Parenthood defunding | CNN Politics",
    "description": "A coalition of 22 Democratic-led states and the District of Columbia is seeking to halt the Trump administration from defunding Planned Parenthood.",
    "link": "https://www.cnn.com/2025/07/29/politics/planned-parenthood-lawsuit-democratic-states",
    "timestamp": "2025-07-29T17:33:13Z"
  },
  {
    "title": "'Great cover': CEOs caught admitting they're using tariffs as excuse to jack up prices",
    "description": "The effects of U.S. President Donald Trump's tariffs are winding their way through the American economy, and a new piece of analysis claims that corporate America is using them as \"cover\" to further jack up prices.Progressive advocacy group Groundwork Collabo…",
    "link": "https://www.rawstory.com/great-cover-ceos-own-words-show-them-using-tariffs-as-excuse-to-jack-up-prices/",
    "timestamp": "2025-07-29T17:31:30Z"
  },
  {
    "title": "Maria Shriver Says Bill To Rename Kennedy Center After Trump Makes Her ‘Blood Boil’",
    "description": "The journalist and niece of former President John F. Kennedy called the proposal “petty” and “small minded” in a post on X.",
    "link": "https://www.huffpost.com/entry/maria-shriver-kennedy-center-trump-rename_n_6888ee1ce4b06c6f8d31d4e2",
    "timestamp": "2025-07-29T17:31:29Z"
  },
  {
    "title": "What I learned at Fortune Brainstorm AI Singapore",
    "description": "AI adoption in Asia is charging ahead, but challenges remain with AI agents and building \"sovereign AI.\"",
    "link": "https://fortune.com/2025/07/29/what-i-learned-at-fortune-brainstorm-ai-singapore-2025-adoption-agents-infrastructure-china/",
    "timestamp": "2025-07-29T17:31:19Z"
  },
  {
    "title": "Food Prices Will Rise Under Trump, Group Warns",
    "description": "\"Tariffs on food imports will likely lead to higher food prices, making consumers worse off,\" the Tax Foundation said.",
    "link": "https://www.newsweek.com/food-prices-rising-trump-tariffs-2105830",
    "timestamp": "2025-07-29T17:31:19Z"
  },
  {
    "title": "Trump administration moves to repeal EPA rule that allows climate regulation",
    "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-moves-to-repeal-epa-rule-that-allows-climate-regulation",
    "timestamp": "2025-07-29T17:30:20Z"
  },
  {
    "title": "War Mongering: Trump Issues Another Nuclear Threat To Iran",
    "description": "United States ruler Donald Trump has just issued a fresh nuclear threat to Iran. He warned that Iran’s nuclear sites could be bombed again if it resumes uranium enrichment.",
    "link": "https://www.shtfplan.com/headline-news/war-mongering-trump-issues-another-nuclear-threat-to-iran",
    "timestamp": "2025-07-29T17:30:05Z"
  },
  {
    "title": "Mikie Sherrill Chances of Defeating Jack Ciattarelli in New Jersey—New Poll",
    "description": "The poll showed Sherrill, a Democrat, with a single-digit lead over Ciattarelli, a Republican, in the governor's race.",
    "link": "https://www.newsweek.com/mikie-sherrill-chances-defeating-jack-ciattarelli-poll-2105847",
    "timestamp": "2025-07-29T17:25:24Z"
  },
  {
    "title": "China-US trade talks conclude without deal to prevent tariffs from surging again | CNN Business",
    "description": "Chinese and American trade negotiators concluded their two-day meeting in Stockholm without a clear path forward to avert tariffs from skyrocketing back to ultra-high levels that formed an effective blockade on trade between the world’s two largest economies.",
    "link": "https://www.cnn.com/2025/07/29/business/china-us-trade-deal",
    "timestamp": "2025-07-29T17:24:07Z"
  },
  {
    "title": "Trump Brazenly Using Government Resources To Put Money In His Own Pocket",
    "description": "The White House treated a marketing event at his for-profit golf club as an official act and helped him promote it.",
    "link": "https://www.huffpost.com/entry/trump-aberdeen-golf-grand-opening_n_6888f570e4b06a2e515c74bb",
    "timestamp": "2025-07-29T17:23:05Z"
  },
  {
    "title": "Trump's Health Cabal Will Worsen US Healthcare, Risk Millions of Patient Lives",
    "description": "Only six months into his second presidential term, Donald Trump has managed to disrupt, deplete and desecrate our nation’s already broken health care system, risking millions of lives.A new report authored by Public Citizen Health Care Policy Advocate Eagan K…",
    "link": "https://www.commondreams.org/newswire/trump-s-health-cabal-will-worsen-us-healthcare-risk-millions-of-patient-lives",
    "timestamp": "2025-07-29T17:22:06Z"
  },
  {
    "title": "Trump Busts Out Sean Connery Impression While Discussing His History with Scotland",
    "description": "President Donald Trump busted out an impression of late actor Sean Connery while discussing his history with Scotland on the Pod Force One podcast.\nThe post Trump Busts Out Sean Connery Impression While Discussing His History with Scotland first appeared on M…",
    "link": "https://www.mediaite.com/media/podcasts/trump-busts-out-sean-connery-impression-while-discussing-his-history-with-scotland/",
    "timestamp": "2025-07-29T17:21:04Z"
  },
  {
    "title": "Ghislaine Maxwell’s Lawyer Tells Congress She’ll Only Testify After Appeal Is Over—Or If Trump Pardons Her",
    "description": "Maxwell would refuse to answer questions about Epstein while her case remains pending, but “would be willing—and eager—to testify openly and honestly, in public” if Trump pardons her, her lawyer said.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/29/ghislaine-maxwells-lawyer-tells-congress-shell-only-testify-after-appeal-is-over-or-if-trump-pardons-her/",
    "timestamp": "2025-07-29T17:20:25Z"
  },
  {
    "title": "Exclusive: Inside the Preparations for Trump's Next Supreme Court Nominee (Brian Bennett/Time)",
    "description": "Brian Bennett / Time:\nExclusive: Inside the Preparations for Trump's Next Supreme Court Nominee  —  Updates on Manhattan shooting, Gaza, and more  —  White House officials and a close circle of conservative lawyers are preparing for President Donald Trump to …",
    "link": "https://www.memeorandum.com/250729/p66",
    "timestamp": "2025-07-29T17:20:01Z"
  },
  {
    "title": "Trump Environmental Protection Agency moves to repeal finding that allows climate regulation (Matthew Daly/Associated Press)",
    "description": "Matthew Daly / Associated Press:\nTrump Environmental Protection Agency moves to repeal finding that allows climate regulation  —  President Donald Trump's administration on Tuesday proposed revoking a scientific finding that has long been the central basis fo…",
    "link": "https://www.memeorandum.com/250729/p62",
    "timestamp": "2025-07-29T17:20:01Z"
  },
  {
    "title": "‘Worst-case scenario of famine’ is happening in Gaza, food crisis experts warn",
    "description": "“Widespread death” will occur without immediate action, experts said.",
    "link": "https://www.bostonherald.com/2025/07/29/gaza-famine/",
    "timestamp": "2025-07-29T17:18:28Z"
  },
  {
    "title": "‘Worst-case scenario of famine’ is happening in Gaza, food crisis experts warn",
    "description": "“Widespread death” will occur without immediate action, experts said.",
    "link": "https://www.denverpost.com/2025/07/29/gaza-famine/",
    "timestamp": "2025-07-29T17:18:28Z"
  },
  {
    "title": "Trump Opens Scottish Golf Course And Vows 'Peaceful World'",
    "description": "Donald Trump officially opened his new golf course in Scotland on Tuesday, ending a five-day trip during which the US president signed a major trade deal with the EU and gave Russia less than two weeks to end the Ukraine war.",
    "link": "https://www.ibtimes.com/trump-opens-scottish-golf-course-vows-peaceful-world-3779734",
    "timestamp": "2025-07-29T17:18:10Z"
  },
  {
    "title": "Union Pacific to buy Norfolk Southern for $85bn",
    "description": "The deal, which would build first coast-to-coast freight rail, could take up to two years to complete amid scrutiny.",
    "link": "https://www.aljazeera.com/economy/2025/7/29/union-pacific-to-buy-norfolk-southern-for-85bn",
    "timestamp": "2025-07-29T17:17:15Z"
  },
  {
    "title": "Trump ally Marjorie Taylor Greene decries ‘genocide’ in Gaza",
    "description": "Right-wing congresswoman condemns the 'starvation happening in Gaza' as she criticises pro-Israel colleague Randy Fine.",
    "link": "https://www.aljazeera.com/news/2025/7/29/trump-ally-marjorie-taylor-greene-decries-genocide-in-gaza",
    "timestamp": "2025-07-29T17:16:07Z"
  },
  {
    "title": "Why Trump's new deadline for Russia deserves skepticism (Aaron Blake/CNN)",
    "description": "Aaron Blake / CNN:\nWhy Trump's new deadline for Russia deserves skepticism  —  President Donald Trump made big news Monday, shortening his 50-day deadline for Russia to get serious about peace in Ukraine to “about 10 to 12 days from now.”  —  “There's no reas…",
    "link": "https://www.memeorandum.com/250729/p61",
    "timestamp": "2025-07-29T17:15:02Z"
  },
  {
    "title": "Off His Rocker? Trump's 'Mental Decline Is on Vivid Display' as President Rages About Epstein Scandal Fallout During Scotland Trip",
    "description": "Donald Trump's concerning mental state is the focus following his trip to Scotland, which had him rambling once again.",
    "link": "https://radaronline.com/p/trump-mental-decline-is-on-vivid-display-as-he-raged-about-epstein-scandal-fallout/",
    "timestamp": "2025-07-29T17:15:00Z"
  },
  {
    "title": "Procter and Gamble to raise prices to offset tariff costs",
    "description": "The world’s largest consumer goods maker said it will have to raise prices on a quarter of its products starting August.",
    "link": "https://www.aljazeera.com/economy/2025/7/29/procter-and-gamble-to-raise-prices-to-offset-tariff-costs",
    "timestamp": "2025-07-29T17:14:56Z"
  },
  {
    "title": "Rachel Maddow blasts Trump for ‘robbing’ nuclear safety funds to renovate Qatari jet",
    "description": "Rachel Maddow called out Trump over reports that the government diverted millions from a nuclear safety program to fund renovations on his gifted Qatari jet.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-nuclear-safety-funds-qatari-jet-air-force-one-rcna221725",
    "timestamp": "2025-07-29T17:14:35Z"
  },
  {
    "title": "Free trade carveouts key in potential deal between U.S. and Canada: CFIB",
    "description": "Business leaders are hoping to see Canada and the U.S. maintain free trade protections for most goods once a deal is reached. Find out more.",
    "link": "https://financialpost.com/news/economy/free-trade-carveouts-key-deal-us-canada-cfib",
    "timestamp": "2025-07-29T17:13:59Z"
  },
  {
    "title": "Awdah Hathaleen of No Other Land Killed by Israeli Settler",
    "description": "Awdah Hathaleen, a Palestinian activist and community leader who helped make Oscar-winning doc ‘No Other Land,’ was fatally shot by an Israeli settler in the West Bank. ‘This is how Israel erases us — one life at a time,’ director Basel Adra wrote.",
    "link": "http://www.vulture.com/article/no-other-land-awdah-hathaleen-killed.html",
    "timestamp": "2025-07-29T17:13:22Z"
  },
  {
    "title": "BJP ko baaton mein koi nahi hara sakta: Akhilesh Yadav criticises PM Modi's speech in LS",
    "description": "Akhilesh Yadav criticized Narendra Modi's speech on Operation Sindoor. He pointed to China as a bigger threat. Yadav questioned India's self-reliance claims. Congress leaders also attacked Modi's statements. They questioned his silence on Trump's claims about…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/bjp-ko-baaton-mein-koi-nahi-hara-sakta-akhilesh-yadav-criticises-pm-modis-speech-in-ls/articleshow/122980965.cms",
    "timestamp": "2025-07-29T17:12:05Z"
  },
  {
    "title": "Analysis Shows Big Corporations Are Using Trump Trade Chaos as 'Cover' to Jack Up Prices",
    "description": "The effects of U.S. President Donald Trump's tariffs are winding their way through the American economy, and a new piece of analysis claims that corporate America is using them as \"cover\" to further jack up prices.Progressive advocacy group Groundwork Collabo…",
    "link": "https://www.commondreams.org/news/trump-tariffs-corporate-greed",
    "timestamp": "2025-07-29T17:11:32Z"
  },
  {
    "title": "‘You Will Crawl Back’: Todd Chrisley Didn’t Mince Words About The Divorce Rumors Surrounding Him And Julie",
    "description": "The Chrisley patriarch had words for those sharing rumors.",
    "link": "https://www.cinemablend.com/television/todd-chrisley-didnt-mince-words-divorce-rumors-him-julie",
    "timestamp": "2025-07-29T17:11:19Z"
  },
  {
    "title": "IMF upgrades Australian growth forecasts, despite tariffs uncertainty",
    "description": "The agency says \"persistent uncertainties\" around trade continue to dog the global economy, with US firms rushing to import goods before Donald Trump's August 1 trade deal deadline.",
    "link": "https://www.abc.net.au/news/2025-07-30/imf-says-global-economy-showing-resilience-against-tariffs/105588444",
    "timestamp": "2025-07-29T17:11:08Z"
  },
  {
    "title": "China and US agree to extend tariff pauses after 'constructive' talks in Stockholm",
    "description": "China and the U.S. have agreed to continue their tariff pauses on each other, according to China's top trade official",
    "link": "https://abcnews.go.com/International/wireStory/china-us-agree-extend-tariff-pauses-after-constructive-124163619",
    "timestamp": "2025-07-29T17:10:24Z"
  },
  {
    "title": "Will the Kennedy Center become the Donald J. Trump Center for the Performing Arts?",
    "description": "The GOP bill is called the \"Make Entertainment Great Again Act,\" but it focuses on one particular venue: the John F. Kennedy Center for the Performing Arts. Significant obstacles stand in the way.",
    "link": "https://www.npr.org/2025/07/29/nx-s1-5483848/kennedy-center-trump",
    "timestamp": "2025-07-29T17:09:54Z"
  },
  {
    "title": "Russia kills 27 civilians in Ukraine as the Kremlin remains defiant over Trump threats",
    "description": "The attacks came despite Trump’s threat to punish Russia with sanctions and tariffs.",
    "link": "https://www.bostonherald.com/2025/07/29/russia-ukraine-war-civilians-killed/",
    "timestamp": "2025-07-29T17:09:35Z"
  },
  {
    "title": "Trump's EU Deal May Not Hurt Putin",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nEuropean Union chief Ursula von der Leyen said the deal she struck with Donald Trump will lessen the reliance on Russia's energy exports but there is doubt over whether the agreement can curb funding for Vladi…",
    "link": "https://biztoc.com/x/e18be1754bd84b1e",
    "timestamp": "2025-07-29T17:09:06Z"
  },
  {
    "title": "Palestinian involved in Oscar-winning West Bank film shot dead by Israeli settler, director says",
    "description": "Odeh Hathaleen, who was killed, helped film the Oscar-winning documentary No Other Land.",
    "link": "https://www.bbc.com/news/articles/c776x78517po",
    "timestamp": "2025-07-29T17:08:31Z"
  },
  {
    "title": "Some Democrats warn that Epstein is a 'distraction' from Trump's unpopular big bill",
    "description": "Democrats can’t stop talking about releasing the Jeffrey Epstein files. But some say it is a distraction from Donald Trump's unpopular big, beautiful bill.",
    "link": "https://www.nbcnews.com/politics/congress/democrats-warn-epstein-distraction-trumps-unpopular-big-bill-rcna221535",
    "timestamp": "2025-07-29T17:05:44Z"
  },
  {
    "title": "WATCH: Donald Trump Cuts Ribbon to Officially Open Second Golf Course at Aberdeen",
    "description": "President Donald Trump officially cut the ribbon for the new golf course at Trump International Golf Links Aberdeen on Monday, the final day of his historic trip to Scotland.\nThe post WATCH: Donald Trump Cuts Ribbon to Officially Open Second Golf Course at Ab…",
    "link": "https://www.breitbart.com/politics/2025/07/29/watch-donald-trump-cuts-ribbon-officially-open-second-golf-course-aberdeen/",
    "timestamp": "2025-07-29T17:05:41Z"
  },
  {
    "title": "The Hunted Have Become the Hunters",
    "description": "After enduring four brutal years of being relentlessly prosecuted, surveilled, slandered, and even shot at, President Trump has returned to finish what he started. His mission remains the same, to Make America Great Again, but to accomplish his goals he must …",
    "link": "https://freerepublic.com/focus/f-chat/4331462/posts",
    "timestamp": "2025-07-29T17:05:28Z"
  },
  {
    "title": "UK To Recognize Palestine State By Fall Unless Israel Stops War",
    "description": "Prime Minister Keir Starmer said the UK would formally recognize a Palestinian state by the United Nations General Assembly in September if Israel does not stop its war in Gaza.",
    "link": "https://www.ndtvprofit.com/world/uk-to-recognize-palestine-state-by-fall-unless-israel-stops-war",
    "timestamp": "2025-07-29T17:05:15Z"
  },
  {
    "title": "VCU Health to stop medicinal care for transgender youth",
    "description": "The VCU Health System will stop providing medicinal care related to gender transition for children under 19 years old, as the Trump administration seeks to ban gender-affirming health care for minors.",
    "link": "https://richmond.com/news/state-regional/government-politics/article_0d392925-838b-410a-b2c9-08c33b05c788.html",
    "timestamp": "2025-07-29T17:04:00Z"
  },
  {
    "title": "All the Canonical Donald Trumps on ‘South Park’",
    "description": "Not all ‘South Park’ Trumps were created equally",
    "link": "https://www.cracked.com/article_47614_all-the-canonical-donald-trumps-on-south-park.html",
    "timestamp": "2025-07-29T17:03:00Z"
  },
  {
    "title": "Trump's EU Deal May Not Hurt Putin",
    "description": "The EU's Ursula von der Leyen said too much Russian energy still enters Europe, despite sanctions.",
    "link": "https://www.newsweek.com/trump-gas-energy-eu-deal-2105616",
    "timestamp": "2025-07-29T17:02:25Z"
  },
  {
    "title": "Nationwide Walmart Boycott Planned For August 1: What to Know",
    "description": "The People's Union USA is launching another boycott of the retail giant.",
    "link": "https://www.newsweek.com/nationwide-walmart-boycott-planned-august-peoples-union-what-know-2105798",
    "timestamp": "2025-07-29T17:02:19Z"
  },
  {
    "title": "This Scottish Protester's Simple Words About Donald Trump Are Going Viral",
    "description": "\"If you think you're embarrassed, what do you think those of us who are sane over here feel.\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/mjs538/scottish-protesters-words-for-trump",
    "timestamp": "2025-07-29T17:00:58Z"
  },
  {
    "title": "What to Expect From Chevron’s Massive Guyana Investment",
    "description": "Guyana has been the hot new spot for oil exploration in recent years, following several big discoveries. Multiple oil majors are investing in operations in the South American country, as they aim to pump “low-carbon oil” in a bid to continue developing their …",
    "link": "https://oilprice.com/Energy/Energy-General/What-to-Expect-From-Chevrons-Massive-Guyana-Investment.html",
    "timestamp": "2025-07-29T17:00:00Z"
  },
  {
    "title": "Cambodia-Thailand Truce Broadly Holds Despite Shaky Start",
    "description": "An uneasy ceasefire between Thailand and Cambodia appeared to hold on Tuesday, as military commanders met despite Bangkok's allegations the truce had been breached with sporadic skirmishes.",
    "link": "https://www.ibtimes.com.au/cambodia-thailand-truce-broadly-holds-despite-shaky-start-1859883",
    "timestamp": "2025-07-29T16:57:16Z"
  },
  {
    "title": "Revenue hit seen from US-PH deal",
    "description": "THE Philippines could lose roughly P3 billion to P6 billion in forgone revenues from zero tariffs on selected products from the United States, a Cabinet official said on Tuesday.",
    "link": "https://www.manilatimes.net/2025/07/30/business/top-business/revenue-hit-seen-from-us-ph-deal/2158258",
    "timestamp": "2025-07-29T16:56:08Z"
  },
  {
    "title": "Trump Used Your Tax Dollars to Open His New Scottish Golf Course (Rolling Stone)",
    "description": "Rolling Stone:\nTrump Used Your Tax Dollars to Open His New Scottish Golf Course  —  The president continues to profit off of the office in increasingly blatant — and costly — ways  —  President Donald Trump continued his Profit-Off-The-Presidency World Tour t…",
    "link": "https://www.memeorandum.com/250729/p51",
    "timestamp": "2025-07-29T16:55:00Z"
  },
  {
    "title": "The Simpsons Season 37 & FOX Animation Domination Lineup Premiere Date Revealed",
    "description": "The Simpsons season 37 returns to screens later in 2025, and Fox finally announced its premiere date along with Bob's Burgers and Krapopolis returns.",
    "link": "https://screenrant.com/the-simpsons-universal-basic-guys-krapopolis-bobs-brugers-2025-release-date/",
    "timestamp": "2025-07-29T16:53:19Z"
  },
  {
    "title": "P&G Estimates $1 Bn Tariff Hit, Plans Some US Price Hikes",
    "description": "Procter & Gamble executives projected a $1 billion hit from US tariffs over the next year on Tuesday as the consumer products giant said it would institute limited price hikes in the United States.",
    "link": "https://www.ibtimes.com/pg-estimates-1-bn-tariff-hit-plans-some-us-price-hikes-3779730",
    "timestamp": "2025-07-29T16:51:13Z"
  },
  {
    "title": "FEMA to require states use terrorism prevention funds for migrant arrests",
    "description": "WASHINGTON (Reuters) -The Federal Emergency Management Agency will require states to spend part of their federal terrorism prevention funds on helping the Trump administration arrest migrants, as part of the U.S. president's transformation of the agency.  Rea…",
    "link": "https://www.thestar.com.my/news/world/2025/07/30/fema-to-require-states-use-terrorism-prevention-funds-for-migrant-arrests",
    "timestamp": "2025-07-29T16:51:00Z"
  },
  {
    "title": "'Almost sarcastic': Trump dig at Rupert Murdoch seen as clear attempt to 'poke the bear'",
    "description": "President Donald Trump's defamation lawsuit against Rupert Murdoch and the Wall Street Journal has gotten personal.The president claims he personally told the media mogul claims he'd penned a bawdy birthday message for Jeffrey Epstein two decades prior were f…",
    "link": "https://www.rawstory.com/trump-lawsuit-rupert-murdoch/",
    "timestamp": "2025-07-29T16:50:49Z"
  },
  {
    "title": "John Roberts has become the worst modern Supreme Court chief justice | Opinion",
    "description": "With each passing week, Chief Justice John Roberts and his Republican-friendly colleagues bestow never-before-enjoyed authorities upon the Trump Administration. The plan seems to be — if we grant the president everything he dreams of, maybe he’ll leave the hi…",
    "link": "https://freerepublic.com/focus/f-chat/4331460/posts",
    "timestamp": "2025-07-29T16:50:28Z"
  },
  {
    "title": "John Roberts has become the worst modern Supreme Court chief justice | Opinion",
    "description": "With each passing week, Chief Justice John Roberts and his Republican-friendly colleagues bestow never-before-enjoyed authorities upon the Trump Administration. The plan seems to be — if we grant the president everything he dreams of, maybe he’ll leave the hi…",
    "link": "https://freerepublic.com/focus/f-news/4331460/posts",
    "timestamp": "2025-07-29T16:50:28Z"
  },
  {
    "title": "The Supreme Court Needs to Draw a Line in the Sand on the Judicial Insurrection",
    "description": "District court judges have usurped President Donald Trump’s control over the Executive Branch, too often requiring the Supreme Court to intervene to stop the judicial... Read More\nThe post The Supreme Court Needs to Draw a Line in the Sand on the Judicial Ins…",
    "link": "https://www.dailysignal.com/2025/07/29/supreme-court-needs-draw-line-sand-judicial-insurrection/",
    "timestamp": "2025-07-29T16:50:21Z"
  },
  {
    "title": "DOJ Files Complaint Against Judge Boasberg, Alleging Misconduct",
    "description": "\"By expressing his view that a particular litigant would violate court orders, Judge Boasberg degraded public confidence in the integrity of the judiciary.\"\nThe post DOJ Files Complaint Against Judge Boasberg, Alleging Misconduct first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/07/doj-files-complaint-against-judge-boasberg-alleging-misconduct/",
    "timestamp": "2025-07-29T16:49:06Z"
  },
  {
    "title": "Trump Environmental Protection Agency moves to repeal finding that allows climate regulation",
    "description": "President Donald Trump’s administration has proposed revoking a scientific finding that's long been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "link": "https://www.clickondetroit.com/business/2025/07/29/trump-epa-moves-to-repeal-landmark-finding-that-allows-climate-regulation/",
    "timestamp": "2025-07-29T16:48:42Z"
  },
  {
    "title": "In the country that Trump claims 'nobody has ever heard of', his name evokes fear and panic",
    "description": "A blanket of thick fog covers Lesotho's capital, Maseru.",
    "link": "https://news.sky.com/story/lesotho-in-the-country-that-trump-claims-nobody-has-ever-heard-of-his-name-evokes-fear-and-panic-13403636",
    "timestamp": "2025-07-29T16:47:00Z"
  },
  {
    "title": "With AI plan, Trump keeps chipping away at a foundational environmental law",
    "description": "By MELINA WALLING and MATTHEW DALY\nWhen President Donald Trump rolled out a plan to boost artificial intelligence and data centers, a key goal was wiping away barriers to rapid growth.\nRelated Articles\n \n \n \n Trump’s EPA moves to repeal finding that allows cl…",
    "link": "https://biztoc.com/x/b68a325bf6b87e28",
    "timestamp": "2025-07-29T16:46:09Z"
  },
  {
    "title": "Starmer says UK will recognize Palestinian state unless Israel agrees to a ceasefire",
    "description": "The Prime Minister called for Israel to address the \"appalling situation in Gaza.\"",
    "link": "https://www.bostonherald.com/2025/07/29/britain-palestinians/",
    "timestamp": "2025-07-29T16:43:31Z"
  },
  {
    "title": "Pete Buttigieg says Democrats must end ‘preachy’ politics to combat Trump’s autocratic government takeover",
    "description": "Pete Buttigieg is no longer in the Cabinet or actively campaigning, but this week, the former Transportation secretary stepped back into the national political spotlight with a pair of interviews that touched on LGBTQ+ rights, authoritarianism, and the intern…",
    "link": "https://www.advocate.com/news/pete-buttigieg-democrats-preachy-politics",
    "timestamp": "2025-07-29T16:42:57Z"
  },
  {
    "title": "Lionesses Party With Thousands Of Fans After Euro 2025 Triumph",
    "description": "England's victorious Lionesses celebrated their dramatic Women's Euro 2025 triumph along with tens of thousands of ecstatic fans outside Buckingham Palace on Tuesday.",
    "link": "https://www.ibtimes.com.au/lionesses-party-thousands-fans-after-euro-2025-triumph-1859880",
    "timestamp": "2025-07-29T16:42:10Z"
  },
  {
    "title": "US, China finish talks in Stockholm as tariff truce holds for now",
    "description": "U.S. and Chinese officials concluded talks in Stockholm, aiming to de-escalate trade tensions and extend a tariff truce established in May. While no major breakthroughs were announced, both sides agreed to pursue an extension of the 90-day truce. The discussi…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-china-finish-talks-in-stockholm-as-tariff-truce-holds-for-now/articleshow/122980531.cms",
    "timestamp": "2025-07-29T16:41:19Z"
  },
  {
    "title": "Traveled cross-country from Vegas...",
    "description": "Traveled cross-country from Vegas...\r\n\n \n \n \n (Top headline, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Madman Took Wrong Elevator...\r\nUPDATE...\r\nFootball Players With CTE Have Turned to Violence...",
    "link": "https://www.the-sun.com/news/14846967/shooting-new-york-football-cte/",
    "timestamp": "2025-07-29T16:40:38Z"
  },
  {
    "title": "Netanyahu's Approval Among Americans Plunges to Record Low—Poll",
    "description": "A majority of Americans view Netanyahu negatively for the first time, according to a new poll.",
    "link": "https://www.newsweek.com/netanyahu-approval-american-plunges-low-poll-2105749",
    "timestamp": "2025-07-29T16:39:12Z"
  },
  {
    "title": "Slog AM: Debora Juarez Back On Council,  Ann Davison Stabs Denny Blaine In The Back(side), Manhattan Gunman Likely Targeted NFL",
    "description": "The Stranger's Morning News Roundup\n \n by Vivian McCall\n \n \n \n I’m back from vacation: It was nice (thanks for asking). I’ve returned to better weather. Today, it’ll be sunny with a balmy high of 81. Temperatures will drop to the high 50s tonight before heati…",
    "link": "https://www.thestranger.com/slog-am/2025/07/29/80170879/slog-am-debora-juarez-back-on-council-ann-davison-stabs-denny-blaine-in-the-backside-manhattan-gunman-likely-targeted-nfl",
    "timestamp": "2025-07-29T16:39:00Z"
  },
  {
    "title": "When I Worked at Donald Trump’s Casino, He Walked In With Jeffrey Epstein—and a Teenager Not Old Enough to Be There",
    "description": "Afterward he asked, “Am I in trouble?”",
    "link": "https://slate.com/news-and-politics/2025/07/donald-trump-jeffrey-epstein-files-list-fbi-news.html",
    "timestamp": "2025-07-29T16:38:49Z"
  },
  {
    "title": "The Epstein Conspiracy Flames That Trump Fanned Are Now Blowing Back on Him",
    "description": "On August 10, 2019, Jeffrey Epstein—accused of sex trafficking in minor girls—committed suicide in his jail cell while awaiting trial, and a new conspiracy theory was born: Powerful forces silenced him. Releasing the Justice Department’s files on Epstein woul…",
    "link": "https://www.commondreams.org/opinion/trump-epstein-conspiracy",
    "timestamp": "2025-07-29T16:37:43Z"
  },
  {
    "title": "Vance warns of 'penalty' for Dems who opposed the 'big, beautiful, bill' ahead of 2026 midterms",
    "description": "Vice President JD Vance is gearing up for the 2026 midterm elections and cautioned those who opposed President Donald Trump's \"big, beautiful bill\" should face consequences.",
    "link": "https://www.foxnews.com/politics/vance-warns-penalty-dems-who-opposed-big-beautiful-bill-ahead-2026-midterms",
    "timestamp": "2025-07-29T16:36:42Z"
  },
  {
    "title": "Trump’s endorsement boosts Senate candidate who almost flipped a key swing seat",
    "description": "Trump's endorsement clears the GOP field for Mike Rogers in Michigan's 2026 Senate race while Democrats face a crowded primary in the battleground state that Trump narrowly won in 2024.",
    "link": "https://www.foxnews.com/politics/trumps-endorsement-boosts-senate-candidate-who-almost-flipped-key-swing-seat",
    "timestamp": "2025-07-29T16:35:49Z"
  },
  {
    "title": "Scottish Bagpipes Drown Out Trump",
    "description": "Scotland always gives Donald Trump a warm reception.\nAnonymous posted a funny video.\nHow despicable for the President of the United States to use taxpayer money to fly to Scotland and use that trip to open up a new golf course that was promoted via the presid…",
    "link": "https://crooksandliars.com/2025/07/scottish-bagpipes-drown-out-trump",
    "timestamp": "2025-07-29T16:35:14Z"
  },
  {
    "title": "Make Entertainment Great Again Act: Republican wants to rename Kennedy Center for Trump",
    "description": "One historian recently described the Republican effort to name a bunch of stuff after Donald Trump as “pretty crazy.” The Kennedy Center is now on the list.",
    "link": "https://biztoc.com/x/9dadf09363b2862d",
    "timestamp": "2025-07-29T16:34:56Z"
  },
  {
    "title": "With AI plan, Trump keeps chipping away at a foundational environmental law",
    "description": "NEPA is a foundational environmental law in the United States.",
    "link": "https://www.bostonherald.com/2025/07/29/climate-trump-ai-environment/",
    "timestamp": "2025-07-29T16:34:46Z"
  },
  {
    "title": "'Worst-Case Scenario of Famine' Unfolding in Gaza: IPC Report",
    "description": "The latest alert on Gaza from the world's leading authority on starvation and malnutrition is not a warning of what could come in the besieged enclave, where Israel is still blocking nearly all humanitarian aid, but of the \"worst-case scenario\" that has alrea…",
    "link": "https://www.commondreams.org/news/ipc-and-famine",
    "timestamp": "2025-07-29T16:33:54Z"
  },
  {
    "title": "Trump’s Break With Netanyahu On Gaza: A Timeline Of Ally, MAGA Pressure",
    "description": "Steve Bannon said young MAGA voters are backing away from Israel, signaling a broader shift among conservatives as criticism of Netanyahu’s Gaza policies intensifies pressure on Trump.",
    "link": "https://www.forbes.com/sites/yezensaadah/2025/07/29/trumps-break-with-netanyahu-on-gaza-a-timeline-of-ally-maga-pressure/",
    "timestamp": "2025-07-29T16:32:32Z"
  },
  {
    "title": "Trump's EU Deal Could Cost Pharma Industry $19 Billion, Analyst Warns",
    "description": "The 15 percent tariff rate agreed under the new deal could significantly impact pharma firms reliant on European imports.",
    "link": "https://www.newsweek.com/trump-eu-tariff-deal-cost-pharmaceutical-industry-billions-2105746",
    "timestamp": "2025-07-29T16:31:29Z"
  },
  {
    "title": "This Week In Bitcoin: 4 Things To Keep An Eye On That Could Impact Price",
    "description": "As Bitcoin (BTC) continues to trade in a volatile yet increasingly bullish market, a crypto analyst points to key developments that could drive a breakout past $130,000. From macroeconomic shifts to major technical breakouts and unexpected geopolitical tailwi…",
    "link": "https://bitcoinist.com/this-week-in-bitcoin/",
    "timestamp": "2025-07-29T16:30:07Z"
  },
  {
    "title": "Comedians Says Colbert Cancelation Will Mean More Trump Jokes, Not Less",
    "description": "By\n Matt Solomon\n Published: July 29th, 2025",
    "link": "https://www.cracked.com/article_47612_comedians-says-colbert-cancelation-will-mean-more-trump-jokes-not-less.html",
    "timestamp": "2025-07-29T16:30:00Z"
  },
  {
    "title": "Renaming the Kennedy Center for Donald and Melania Trump would violate the law that created it (NBC News)",
    "description": "NBC News:\nRenaming the Kennedy Center for Donald and Melania Trump would violate the law that created it  —  The Kennedy Center can't include new memorials or plaques — for donors or presidents — under U.S. law.  Republicans would need to change that to renam…",
    "link": "https://www.memeorandum.com/250729/p46",
    "timestamp": "2025-07-29T16:30:00Z"
  }
]