[
  {
    "title": "‘I Love It’: Ex-General Praises Trump Making Putin Walk Past America’s Nuclear Bombers",
    "description": "\"You know, there is absolutely no doubt that President Trump has additional leverage because of the decisive decision he made to attack Iran\"\nThe post ‘I Love It’: Ex-General Praises Trump Making Putin Walk Past America’s Nuclear Bombers first appeared on Med…",
    "link": "https://www.mediaite.com/media/tv/i-love-it-ex-general-praises-trump-making-putin-walk-past-americas-nuclear-bombers/",
    "timestamp": "2025-08-15T19:41:17Z"
  },
  {
    "title": "Photos: Donald Trump Gives Vladimir Putin Warm Welcome to Alaska",
    "description": "After stepping off Air Force One, Trump applauded as Putin approached along a red carpet laid out for each leader.",
    "link": "https://www.newsweek.com/trump-putin-alaska-meeting-welcome-photos-update-2113767",
    "timestamp": "2025-08-15T19:40:52Z"
  },
  {
    "title": "Arizona, Nevada and Mexico get less Colorado River water for a third year",
    "description": "Federal officials say Arizona, Nevada and Mexico must again live with less Colorado River water as drought lingers in the West",
    "link": "https://abcnews.go.com/Technology/wireStory/arizona-nevada-mexico-colorado-river-water-year-124686184",
    "timestamp": "2025-08-15T19:40:15Z"
  },
  {
    "title": "Trump lands in Alaska for summit with Putin, says he wants ceasefire 'today' (Reuters)",
    "description": "Reuters:\nTrump lands in Alaska for summit with Putin, says he wants ceasefire ‘today’  —  U.S. President Donald Trump arrived in Alaska on Friday for his high-stakes summit with Russia's Vladimir Putin after saying he wants to see a ceasefire in the war in Uk…",
    "link": "https://www.memeorandum.com/250815/p75",
    "timestamp": "2025-08-15T19:40:00Z"
  },
  {
    "title": "Trump greets Putin in Alaska for Russia-Ukraine talks",
    "description": "US President Donald Trump and Russian President Vladimir Putin greeted each other today in Anchorage, Alaska.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/8/15/trump-greets-putin-in-alaska-for-russia-ukraine-talks",
    "timestamp": "2025-08-15T19:39:00Z"
  },
  {
    "title": "Alec Baldwin slams Trump's 'insane' DC takeover, warns he may target other cities and sports leagues next",
    "description": "Alec Baldwin warned his followers on TikTok on Thursday that President Trump's federalization of the Washington, D.C. police could expand to other cities and even sports leagues.",
    "link": "https://www.foxnews.com/media/alec-baldwin-goes-off-trumps-insane-dc-takeover-warns-he-may-target-nfl-nba-next",
    "timestamp": "2025-08-15T19:38:33Z"
  },
  {
    "title": "Zelensky Calls Javier Milei to Shore Up Support Before Trump-Putin Summit",
    "description": "Ukrainian President Volodymyr Zelensky said on Thursday that Argentina's Javier Milei is willing to \"personally collaborate\" so that Ukraine finds a \"just peace and reliable security guarantees.\"\nThe post Zelensky Calls Javier Milei to Shore Up Support Before…",
    "link": "https://www.breitbart.com/latin-america/2025/08/15/zelensky-calls-javier-milei-to-shore-up-support-before-trump-putin-summit/",
    "timestamp": "2025-08-15T19:37:32Z"
  },
  {
    "title": "A look inside the latest 'Make America Healthy Again' report",
    "description": "The report lays out four problem areas that are to blame for chronic diseases in the U.S.",
    "link": "https://www.ocregister.com/2025/08/15/make-america-healthy-again-report/",
    "timestamp": "2025-08-15T19:36:34Z"
  },
  {
    "title": "What a summit win looks like for Trump – and for Putin: From the Politics Desk",
    "description": "President Donald Trump’s summit today with Russian President Vladimir Putin comes with incredibly high stakes for the future of Russia’s war with Ukraine — and for Trump himself.",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-putin-alaska-summit-win-politics-desk-rcna225281",
    "timestamp": "2025-08-15T19:34:58Z"
  },
  {
    "title": "How Trump handed Putin a win in Alaska, even before they shook hands",
    "description": "If Donald Trump doesn't understand why the Alaska summit is itself a win for Russia's Vladimir Putin, he’s not paying close enough attention.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-handed-putin-win-alaska-even-shook-hands-rcna225278",
    "timestamp": "2025-08-15T19:34:37Z"
  },
  {
    "title": "Fox News Politics Newsletter: From Admiration to Alaska",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-august-15th-draft",
    "timestamp": "2025-08-15T19:34:37Z"
  },
  {
    "title": "Fears Over Fulbright's Future as Trump Admin Cuts Exchange Programs",
    "description": "Funding for over 20 programs was reported to have been cut, leaving participants in limbo.",
    "link": "https://www.newsweek.com/exchange-programs-cut-trump-administration-state-department-visas-2114227",
    "timestamp": "2025-08-15T19:34:32Z"
  },
  {
    "title": "Finger lickin’ bad! Russian journalists eat this politically charged meal on flight to Trump-Putin summit",
    "description": "The grub prompted some squawking from critics of Russia, who called it a burn that goes beyond the food world.",
    "link": "https://nypost.com/2025/08/15/us-news/russian-journalists-eat-this-politically-charged-meal-on-way-to-trump-putin-summit/",
    "timestamp": "2025-08-15T19:33:25Z"
  },
  {
    "title": "William McNeil Jr: Florida Cops Who Broke Window And Beat Unarmed Black Man Will Not Face Criminal Charges",
    "description": "William McNeil Jr. wasn’t committing any offense that could even remotely warrant the way he was treated by a band of bloodthirsty “blue lives” in the perpetually janky state of Florida. BOSSIP previously reported on the viral video that captured the internet…",
    "link": "https://bossip.com/3759698/florida-cop-who-punched-william-mcneil-jr-wont-face-charges/",
    "timestamp": "2025-08-15T19:33:16Z"
  },
  {
    "title": "A Hollywood Star Rejected Trump's Invitation To Receive Kennedy Center Honor",
    "description": "A major name declined the award due to “scheduling conflicts.”",
    "link": "https://www.huffpost.com/entry/tom-cruise-donald-trump-kennedy-center-honor-rejection_n_689f745fe4b0ef392c226ca0",
    "timestamp": "2025-08-15T19:32:57Z"
  },
  {
    "title": "Trump, Putin in Alaska for high-stakes summit",
    "description": "U.S. President Donald Trump and his Russian counterpart Vladimir Putin shook hands and exchanged greetings Friday as they arrived at a military base in Alaska for a historic summit on Moscow's war in Ukraine.",
    "link": "https://www.hurriyetdailynews.com/trump-putin-in-alaska-for-high-stakes-summit-212568",
    "timestamp": "2025-08-15T19:32:18Z"
  },
  {
    "title": "US retail sales in July rise 0.5% on auto power",
    "description": "Auto sales rose 1.6%. They appear to have returned roughly to normalized spending after a surge in March and April as Americans attempted to get ahead of Trump's 25% duty on imported cars and parts and then a slump after that, according to Samuel Tombs, chief…",
    "link": "https://economictimes.indiatimes.com/news/international/business/us-retail-sales-in-july-rise-0-5-on-auto-power/articleshow/123326406.cms",
    "timestamp": "2025-08-15T19:31:34Z"
  },
  {
    "title": "Carney to visit Mexico next month as both countries navigate tense U.S. relations",
    "description": "Both Mexico and Canada have been subject to tariffs and tariff threats from U.S. President Donald Trump since he was re-elected.",
    "link": "https://www.cbc.ca/news/politics/prime-minister-carney-vist-mexico-trade-u-s-1.7610367",
    "timestamp": "2025-08-15T19:31:12Z"
  },
  {
    "title": "CNN's Cornish Suggests ICE Made 'Armed Response' to Newsom Speech",
    "description": "To listen to Audie Cornish, you might have thought ICE agents stormed Gavin Newsom's latest gerrymander speech and dragged the governor, hair and all, off the stage. On today's CNN This Morning, host Cornish suggested that the presence of ICE outside an L.A. …",
    "link": "https://freerepublic.com/focus/f-chat/4334811/posts",
    "timestamp": "2025-08-15T19:31:07Z"
  },
  {
    "title": "‘Putin is Winning’: CNN Panel Gives Summit Verdict Just 5 minutes In",
    "description": "As viewers watched President Trump and his Russian counterpart, Vladimir Putin, warmly greet one another, a CNN panel quickly declared Putin to be the winner.\nThe post ‘Putin is Winning’: CNN Panel Gives Summit Verdict Just 5 minutes In first appeared on Medi…",
    "link": "https://www.mediaite.com/media/tv/putin-is-winning-this-cnn-panel-gives-summit-verdict-just-5-minutes-in/",
    "timestamp": "2025-08-15T19:31:02Z"
  },
  {
    "title": "What we expected from the Trump-Putin summit - and what actually happened",
    "description": "There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself. The US president had threatened \"severe\" consequences for Russia should it not go well - but there was no mention of this following the talks.",
    "link": "https://news.sky.com/story/what-we-expected-from-the-trump-putin-summit-and-what-actually-happened-13412404",
    "timestamp": "2025-08-15T19:31:00Z"
  },
  {
    "title": "Trump and Putin shake hands in Alaska before their summit on the war in Ukraine",
    "description": "The sit-down gives Trump a chance to prove to the world that he is both a master dealmaker and a global peacemaker.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_1f9f3df8-6431-52ec-be6e-7dff819cdfa7.html",
    "timestamp": "2025-08-15T19:29:00Z"
  },
  {
    "title": "Locarno Takeaways, From Emma Thompson’s Savoir Faire to Why More Companies Are Using the Swiss Festival for Premieres to a Raved-About Retrospective",
    "description": "LOCARNO, Switzerland — Unspooling in sweltering humidity, Switzerland’s Locarno Film Festival, Europe’s biggest mid-Summer movie event, sometimes dazzled, led by an ebullient Emma Thompson. More than anything else, in industry terms, it underscored how major …",
    "link": "https://variety.com/2025/film/global/locarno-film-festival-emma-thompson-agc-studios-1236490677/",
    "timestamp": "2025-08-15T19:28:40Z"
  },
  {
    "title": "Trump issues chilling new warning ahead of Putin meeting — stakes have never been higher",
    "description": "President Donald Trump warned he could walk out of the Alaska summit if talks with Russian President Vladimir Putin fail. He wants a ceasefire in the Russia-Ukraine war and is hoping the meeting could help him win the Nobel Peace Prize. European leaders and U…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-issues-chilling-new-warning-ahead-of-putin-meeting-stakes-have-never-been-higher/articleshow/123326229.cms",
    "timestamp": "2025-08-15T19:28:03Z"
  },
  {
    "title": "Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away",
    "description": "The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where Vladimir Putin arrived to a red carpet - the kind of welcome usually reserved for close US allies.",
    "link": "https://news.sky.com/story/trump-and-putin-agree-on-many-points-in-ukraine-talks-but-give-little-detail-away-13412403",
    "timestamp": "2025-08-15T19:28:00Z"
  },
  {
    "title": "‘Morning Joe’ Says Masked ICE Agents at Gavin Newsom’s Redistricting Rally ‘Just Look Stupid’ | Video",
    "description": "\"I don't know if they're aware of it, but this is America,\" host Joe Scarborough says\nThe post ‘Morning Joe’ Says Masked ICE Agents at Gavin Newsom’s Redistricting Rally ‘Just Look Stupid’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-gavin-newsom-rally-ice-agents-trump-texas-california-redistricting/",
    "timestamp": "2025-08-15T19:27:10Z"
  },
  {
    "title": "Liberty University faces second lawsuit accusing it of mishandling sexual assault cases",
    "description": "An ex-employee alleged she faced workplace discrimination in addition to retaliation for working with Education Department investigators.",
    "link": "https://www.usatoday.com/story/news/education/2025/08/15/liberty-university-title-ix-sexault-assault-investigations/85666552007/",
    "timestamp": "2025-08-15T19:25:41Z"
  },
  {
    "title": "Trump greets Putin with uncomfortably long 'yank' handshake in Alaska",
    "description": "The pair are holding crunch talks in Alaska and Trump offered his Russian counterpart a very firm handshake when greeting him.",
    "link": "https://www.ladbible.com/news/world-news/trump-putin-meeting-alaska-uncomfortable-handshake-viral-footage-915088-20250815",
    "timestamp": "2025-08-15T19:25:17Z"
  },
  {
    "title": "'Gamesmanship': Bizarre plane shenanigans between Trump and Putin leave observers in awe",
    "description": "President Donald Trump and Russian President Vladimir Putin held a stand-off on the tarmac in Alaska because there was a disagreement over which president would deplane first. Russia announced Friday morning that Trump would deplane and walk over to Putin's p…",
    "link": "https://www.rawstory.com/trump-putin-2673888295/",
    "timestamp": "2025-08-15T19:25:15Z"
  },
  {
    "title": "US may purchase stake in Intel after Trump attacked CEO",
    "description": "Donald Trump has been meddling with Intel, which now apparently includes mulling \"the possibility of the US government taking a financial stake in the troubled chip maker,\" The Wall Street Journal reported.\nTrump and Intel CEO Lip-Bu Tan weighed the option du…",
    "link": "https://biztoc.com/x/0e5e6e4c97a786f2",
    "timestamp": "2025-08-15T19:25:12Z"
  },
  {
    "title": "Trump and Putin arrive in Alaska for high-stakes summit",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin have arrived at a military base in Alaska on Friday for a much-anticipated summit on the war in Ukraine.\nTrump, instead of a previously planned one-on-one meeting, will be joined by Secretar…",
    "link": "https://biztoc.com/x/dfd0cfa71f3b9785",
    "timestamp": "2025-08-15T19:25:11Z"
  },
  {
    "title": "D.C. Sues Pam Bondi and the Trump Administration for Replacing Police Commissioner",
    "description": "On Friday, Washington, D.C., Attorney General Brian Schwalb initiated a lawsuit against President Donald Trump and members of his administration. The lawsuit challenges U.S. Attorney General Pam Bondi's Thursday order, which nullified the city's sanctuary cit…",
    "link": "https://biztoc.com/x/c47d03c0e4afa6f0",
    "timestamp": "2025-08-15T19:25:04Z"
  },
  {
    "title": "Disney Should Be Paying Very Close Attention to Las Vegas’ Current Struggles",
    "description": "Earlier this month, Disney’s Chief Financial Officer, Hugh Johnston, appeared on CNBC to boast about the company’s Parks and Experiences Division’s great quarter. After all, according to the numbers, it was an excellent quarter for Disney. The Disney Experien…",
    "link": "https://insidethemagic.net/2025/08/disney-could-be-facing-a-similar-fate-as-las-vegas-with-tourism-decline-rl1/",
    "timestamp": "2025-08-15T19:24:54Z"
  },
  {
    "title": "Will the CFPB still function after Federal court backs Trump's plan to lay off nearly 90% of its employees?",
    "description": "A federal appeals court has sided with the Trump administration's plan to drastically reduce the CFPB's workforce by over 1,500 employees. The decision, delivered in a split ruling, is temporarily stayed for possible review. This action raises concerns about …",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-the-cfpb-still-function-after-federal-court-backs-trumps-plan-to-lay-off-nearly-90-of-its-employees/articleshow/123326349.cms",
    "timestamp": "2025-08-15T19:24:35Z"
  },
  {
    "title": "WATCH: Trump and Putin Shake Hands at Historic Alaska Summit",
    "description": "President Donald Trump and Russian dictator Vladimir Putin landed at Joint Base Elmendorf-Richardson in Anchorage, Alaska on Friday afternoon.\nThe post WATCH: Trump and Putin Shake Hands at Historic Alaska Summit first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/watch-trump-and-putin-shake-hands-ahead-of-historic-summit/",
    "timestamp": "2025-08-15T19:22:22Z"
  },
  {
    "title": "Trump administration unveils stricter subsidy rules for wind and solar projects",
    "description": "Under the new rules, utility-scale projects will be required to show substantial and continuous physical work to be eligible for the 30% tax credits, but...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-unveils-stricter-subsidy-192154918.html",
    "timestamp": "2025-08-15T19:21:54Z"
  },
  {
    "title": "Tom Cruise Turns Down Kennedy Center Honor From Trump White House: Why?",
    "description": "Reading Time: 3 minutesTom Cruise has turned down an honor from the Trump White House.\nTom Cruise Turns Down Kennedy Center Honor From Trump White House: Why? was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/08/tom-cruise-turns-down-kennedy-center-honor-from-trump-white-house-why/",
    "timestamp": "2025-08-15T19:21:27Z"
  },
  {
    "title": "Trump welcomed Putin to Alaska as talks begin – Live updates minute by minute",
    "description": "Putin, in high spirits, laughs at something the U.S. President says to him inside the limousine.The warmest welcome Trump has ever given to a foreign counterpart.He applauded three times before reaching the spot where Putin was waiting for him. Live video:\nTh…",
    "link": "https://en.protothema.gr/2025/08/15/trump-welcomed-putin-to-alaska-as-talks-begin-live-updates-minute-by-minute/",
    "timestamp": "2025-08-15T19:21:02Z"
  },
  {
    "title": "Musk's SpaceX Likely Paid 'Little to No Taxes' Despite Lucrative Government Contracts",
    "description": "Although Elon Musk's space exploration company SpaceX has benefited over the years from several lucrative government contracts, it has largely avoided paying any taxes to the federal government.The New York Times reports that SpaceX has \"most likely paid litt…",
    "link": "https://www.commondreams.org/news/spacex-elon-musk-taxes",
    "timestamp": "2025-08-15T19:20:39Z"
  },
  {
    "title": "Why Slate Automotive says it has cracked the code to affordable EVs",
    "description": "Slate Automotive says its compact pickup truck has cracked the code to making affordable, U.S.-built EVs. Can it still succeed without a federal tax credit?",
    "link": "https://www.cnbc.com/2025/08/15/why-slate-automotive-says-it-has-cracked-the-code-to-affordable-evs.html",
    "timestamp": "2025-08-15T19:18:30Z"
  },
  {
    "title": "US Mulls Rosneft, Lukoil Sanctions if Putin Balks on Ceasefire",
    "description": "The US is weighing the threat of sanctions against Russian oil companies Rosneft PJSC and Lukoil PJSC as part of a menu of options to push President Vladimir Putin to accept a ceasefire with Ukraine, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/us-mulls-rosneft-lukoil-sanctions-if-putin-balks-on-ceasefire",
    "timestamp": "2025-08-15T19:18:25Z"
  },
  {
    "title": "Russia’s Lavrov Wears USSR Sweatshirt to Trump-Putin Summit",
    "description": "The foreign minister wasn’t subtle about his Soviet nostalgia.",
    "link": "http://foreignpolicy.com/2025/08/15/lavrov-ussr-russia-trump-putin-ukraine-summit-alaska/",
    "timestamp": "2025-08-15T19:18:09Z"
  },
  {
    "title": "Majority of US Troops Surveyed Say They’re Aware of Their Duty to Not Follow Illegal Orders",
    "description": "Majority of US Troops Surveyed Say They’re Aware of Their Duty to Not Follow Illegal Orderstalkingpointsmemo.com",
    "link": "http://talkingpointsmemo.com/news/majority-of-us-troops-surveyed-say-theyre-aware-of-their-duty-to-not-follow-illegal-orders",
    "timestamp": "2025-08-15T19:17:52Z"
  },
  {
    "title": "Trump, Putin arrive in Alaska for Ukraine talks",
    "description": "US President Donald Trump and Russian President Vladimir Putin shook hands after they arrived in Alaska. Ukrainian President Zelenskyy said a trilateral meeting with Kyiv's involvement must follow. Follow DW for more.",
    "link": "https://www.dw.com/en/trump-putin-begin-alaska-summit-on-ukraine-war/live-73647632",
    "timestamp": "2025-08-15T19:17:00Z"
  },
  {
    "title": "WATCH Trump greet Putin as he arrives in Alaska",
    "description": "The red carpet has been rolled out for the Russian president at Joint Base Elmendorf-Richardson in Anchorage Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622986-trump-greet-putin-arrive-alaska/",
    "timestamp": "2025-08-15T19:16:50Z"
  },
  {
    "title": "Fiery Dems declare war on Trump’s ‘disgraceful violation’ of DC",
    "description": "As part of the ongoing battle against President Donald Trump's \"hostile takeover\" of Washington, D.C., key congressional Democrats introduced a resolution on Friday to terminate his executive order, \"Declaring a Crime Emergency in the District of Columbia.\"Th…",
    "link": "https://www.rawstory.com/trump-dc-2673888245/",
    "timestamp": "2025-08-15T19:16:11Z"
  },
  {
    "title": "Trump and Putin arrive in Alaska for high-stakes summit",
    "description": "Putin stepped onto Western soil for the first time since he ordered the invasion of Ukraine in February 2022",
    "link": "https://www.euractiv.com/section/politics/news/trump-and-putin-arrive-in-alaska-for-high-stakes-summit/",
    "timestamp": "2025-08-15T19:16:03Z"
  },
  {
    "title": "D.C. Sues Pam Bondi and the Trump Administration for Replacing Police Commissioner",
    "description": "It remains unclear if the executive branch can remove D.C.'s legally elected representatives without congressional approval.",
    "link": "https://reason.com/2025/08/15/d-c-sues-pam-bondi-and-the-trump-administration-for-replacing-police-commissioner/",
    "timestamp": "2025-08-15T19:11:46Z"
  },
  {
    "title": "Redistricting Fight: Obama Cheers MIA Texas Dems, GOP Holds Firm",
    "description": "Former President Barack Obama took to Zoom to cheerlead a group of Texas Democrat legislators for bolting from the Lone Star State to try to sabotage a redistricting bill.\nThe post Redistricting Fight: Obama Cheers MIA Texas Dems, GOP Holds Firm appeared firs…",
    "link": "https://www.breitbart.com/politics/2025/08/15/30750414redistricting-fight-obama-cheers-mia-texas-dems-gop-holds-firm/",
    "timestamp": "2025-08-15T19:08:47Z"
  },
  {
    "title": "WATCH Putin land in Anchorage for historic US visit",
    "description": "The Russian president has landed in Alaska for a much-awaited meeting with Donald Trump Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622977-putin-land-anchorage-historic-visit/",
    "timestamp": "2025-08-15T19:08:24Z"
  },
  {
    "title": "Bad diets, too many meds, no exercise: A look inside the latest 'Make America Healthy Again' report",
    "description": "Bad diets, too many meds, no exercise: A look inside the latest 'Make America Healthy Again' reportclick2houston.com",
    "link": "https://www.click2houston.com/news/politics/2025/08/15/bad-diets-too-many-meds-no-exercise-a-look-inside-the-latest-make-america-healthy-again-report/",
    "timestamp": "2025-08-15T19:07:44Z"
  },
  {
    "title": "Verdict, sentencing in coup trial for Brazil’s Bolsonaro set for September",
    "description": "Supreme Court will rule on ex-president's fate in case dividing nation that could result in lengthy prison term.",
    "link": "https://www.aljazeera.com/news/2025/8/15/verdict-sentencing-in-coup-trial-for-brazils-bolsonaro-set-for-september",
    "timestamp": "2025-08-15T19:06:44Z"
  },
  {
    "title": "Putin and Trump set for critical talks on Ukraine in Alaska summit",
    "description": "Russian President Putin and US President Trump arrive in Alaska for a summit focusing on the Ukraine war. The meeting will include key advisers from both sides.",
    "link": "https://www.israelnationalnews.com/news/413352",
    "timestamp": "2025-08-15T19:06:00Z"
  },
  {
    "title": "Appeals Court Overturns Temporary Ban on Firing CFPB Employees",
    "description": "A federal appeals court ruled Friday (Aug. 15) that a lower court lacked the jurisdiction to temporarily block President Donald Trump’s firings of employees at the Consumer Financial Protection Bureau. [contact-form-7] The decision overturned a trial court’s …",
    "link": "http://www.pymnts.com/news/cfpb/2025/appeals-court-overturns-temporary-ban-firing-cfpb-employees/",
    "timestamp": "2025-08-15T19:04:14Z"
  },
  {
    "title": "Alaskans welcome Putin with Ukranian flags. Lots of Ukrainian flags [Amusing]",
    "description": "Alaskans welcome Putin with Ukranian flags. Lots of Ukrainian flags",
    "link": "https://www.fark.com/comments/13778612/Alaskans-welcome-Putin-with-Ukranian-flags-Lots-of-Ukrainian-flags",
    "timestamp": "2025-08-15T19:03:31Z"
  },
  {
    "title": "Wall Street banks race to win Trump admin's favor for massive Fannie Mae, Freddie Mac IPO deal",
    "description": "Several Wall Street banks are pitching President Donald Trump about handling the initial public offering (IPO) of Fannie Mae and Freddie Mac, sources told FOX Business Network's Maria Bartiromo.\nBartiromo reported Friday morning on \"Mornings with Maria\" that,…",
    "link": "https://biztoc.com/x/07b2e6d2a2cbdb6d",
    "timestamp": "2025-08-15T19:03:17Z"
  },
  {
    "title": "Putin lands in Alaska for summit with Trump",
    "description": "Russian President Vladimir Putin's plane landed at Joint Base Elmendorf–Richardson in Anchorage, Alaska, for his highly anticipated encounter with his United States colleague Donald Trump. More to com...",
    "link": "https://biztoc.com/x/5ebf5413892b3bcf",
    "timestamp": "2025-08-15T19:03:09Z"
  },
  {
    "title": "Draft ‘Make America Healthy Again’ report treads lightly on pesticides, processed foods",
    "description": "(CNN) — The Trump administration’s strategy to “Make America Healthy Again” will bypass aggressive action on farm-used pesticides or regulatory crackdowns on ultraprocessed foods, according to a draft document obtained",
    "link": "https://www.wkow.com/news/health/draft-make-america-healthy-again-report-treads-lightly-on-pesticides-processed-foods/article_f9a4a5e7-1634-5231-9a2a-292e3c6cba76.html",
    "timestamp": "2025-08-15T19:02:00Z"
  },
  {
    "title": "Unpacking rumor Trump plans to offer Alaska's natural resources to Putin",
    "description": "According to UK newspaper The Telegraph, offering Alaskan natural resources to Russia could be part of a peace deal in Ukraine.",
    "link": "https://www.snopes.com//news/2025/08/15/trump-putin-alaska-resources/",
    "timestamp": "2025-08-15T19:01:00Z"
  },
  {
    "title": "Seattle Has Its Own Zohran Mamdani Only It's A LADY!",
    "description": "(Add your own Jerry Lewis voice.)",
    "link": "https://www.wonkette.com/p/seattle-has-its-own-zohran-mamdani",
    "timestamp": "2025-08-15T19:00:50Z"
  },
  {
    "title": "Putin-Trump One-On-One Cancelled As US President Lands In Alaska (Live Updates)",
    "description": "The two are expected to hold a joint press conference following the meeting.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/15/putin-trump-one-on-one-cancelled-as-us-president-lands-in-alaska-live-updates/",
    "timestamp": "2025-08-15T19:00:15Z"
  },
  {
    "title": "WATCH: Putin and Trump Meet for Historic Summit in Alaska",
    "description": "The highly anticipated meeting between Russian President Vladimir Putin and US President Donald Trump is taking place at Joint Base Elmendorf-Richardson, on the northern outskirts of Anchorage, Alaska.",
    "link": "https://sputnikglobe.com/20250815/watch-putin-and-trump-meet-for-historic-summit-in-alaska-1122615440.html",
    "timestamp": "2025-08-15T19:00:00Z"
  },
  {
    "title": "World leaders rightly anxious about what Donald Trump and Vladimir Putin might do",
    "description": "World leaders are rightly anxious about just what Donald Trump might agree to, about the future of another sovereign country, when left in a room with Vladimir Putin.",
    "link": "https://www.abc.net.au/news/2025-08-16/donald-trump-vladimir-putin-alaska-ukraine/105637696",
    "timestamp": "2025-08-15T19:00:00Z"
  },
  {
    "title": "Marlins vs. Red Sox odds, predictions: MLB picks, best bets Friday",
    "description": "Lucas Giolito will help lead the Red Sox past the Marlins on Friday night at Fenway Park, Stitches predicts.",
    "link": "https://nypost.com/2025/08/15/betting/marlins-vs-red-sox-odds-predictions-mlb-picks-best-bets-friday/",
    "timestamp": "2025-08-15T19:00:00Z"
  },
  {
    "title": "SEC Chair Paul Atkins teases private equity access for retail",
    "description": "The chairman of the Securities and Exchange Commission, Paul Atkins, said the regulator will work to loosen the rules around access to alternative investments.",
    "link": "https://cointelegraph.com/news/sec-paul-atkins-teases-private-equity-access-retail",
    "timestamp": "2025-08-15T19:00:00Z"
  },
  {
    "title": "'Huge development': Last-minute Trump-Putin change stuns CNN's Kaitlan Collins",
    "description": "President Donald Trump is no longer having a meeting alone with Russian President Vladimir Putin, CNN's Kaitlan Collins reported ahead of the meeting. She noted that a White House official told reporters on Air Force One that other people would join in the me…",
    "link": "https://www.rawstory.com/trump-putin-2673888203/",
    "timestamp": "2025-08-15T18:57:50Z"
  },
  {
    "title": "Putin Arrives in Alaska, Where He Will Hold Talks With Trump",
    "description": "ANCHORAGE (Sputnik) - Russian President Vladimir Putin has arrived in Alaska, where he will hold talks with US President Donald Trump, a RIA Novosti correspondent reported on Friday.",
    "link": "https://sputnikglobe.com/20250815/putin-arrives-in-alaska-where-he-will-hold-talks-with-trump-1122622124.html",
    "timestamp": "2025-08-15T18:57:26Z"
  },
  {
    "title": "Trump and Putin Will NOT Meet One-on-One — Rubio and Witkoff Joining",
    "description": "President Donald Trump will no longer meet by himself with Vladimir Putin to discuss Russia's war with Ukraine, CNN's Kaitlan Collins reported.\nThe post Trump and Putin Will NOT Meet One-on-One — Rubio and Witkoff Joining first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-and-putin-will-not-meet-one-on-one-rubio-and-witkoff-joining/",
    "timestamp": "2025-08-15T18:56:08Z"
  },
  {
    "title": "Bad diets, too many meds, no exercise: A look inside the latest ‘Make America Healthy Again’ report",
    "description": "The report lays out four problem areas that are to blame for chronic diseases in the U.S.",
    "link": "https://www.bostonherald.com/2025/08/15/make-america-healthy-again-report/",
    "timestamp": "2025-08-15T18:54:37Z"
  },
  {
    "title": "Carney Eyes Mid-September Visit to Mexico Amid Strained US Ties",
    "description": "Canadian Prime Minister Mark Carney is planning to visit Mexico on Sept. 18, according to a person familiar with the matter, as he seeks to boost trade and strengthen relations with the country amid punishing US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/carney-eyes-mid-september-visit-to-mexico-amid-strained-us-ties",
    "timestamp": "2025-08-15T18:52:56Z"
  },
  {
    "title": "Here's Who Will Be in the Room with Trump and Putin After Late Change",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPress secretary Karoline Leavitt said Friday that President Donald Trump will not initially meet with Russian President Vladimir Putin alone, as previously planned, but will instead be joined by Secretary of S…",
    "link": "https://biztoc.com/x/5f005250ed1ef4aa",
    "timestamp": "2025-08-15T18:52:06Z"
  },
  {
    "title": "Rubio, Witkoff to join Trump-Putin meeting",
    "description": "United States Secretary of State Marco Rubio and Special Envoy Steve Witkoff will join the meeting between US President Donald Trump and his Russian counterpart Vladimir Putin, White House Press Secre...",
    "link": "https://biztoc.com/x/41a7c7e972efd2c7",
    "timestamp": "2025-08-15T18:52:03Z"
  },
  {
    "title": "Is Gavin Newsom US' next President? California Governor unofficially kicks off 2028 White House run",
    "description": "Gavin Newsom 2028 presidential run: California Governor Gavin Newsom is challenging Donald Trump and Texas Republicans over their redistricting plan, signaling a more aggressive stance for Democrats. He vowed to 'match fire with fire,' criticizing his rivals …",
    "link": "https://economictimes.indiatimes.com/news/international/us/gavin-newsom-2028-presidential-run-is-gavin-newsom-us-next-president-california-governor-unofficially-kicks-off-2028-white-house-run/articleshow/123325567.cms",
    "timestamp": "2025-08-15T18:51:34Z"
  },
  {
    "title": "Orsted ‘Surprise’ Credit Downgrade Caps Worst Week on Record",
    "description": "Orsted A/S’s debt was downgraded by S&P Global Ratings to the lowest tier of investment grade, surprising some analysts days after the Danish wind turbine maker announced a $9 billion rights offering to shore up its finances.",
    "link": "https://gcaptain.com/orsted-surprise-credit-downgrade-caps-worst-week-on-record/",
    "timestamp": "2025-08-15T18:49:28Z"
  },
  {
    "title": "Here's Who Will Be in the Room with Trump and Putin After Late Change",
    "description": "Leavitt told reporters aboard Air Force One the first Trump-Putin session will be a \"three-on-three\" meeting rather than a one-on-one.",
    "link": "https://www.newsweek.com/trump-putin-alaska-rubio-witkoff-lavrov-update-2113765",
    "timestamp": "2025-08-15T18:49:17Z"
  },
  {
    "title": "UK Mounjaro Weight-Loss Jab Price to Rocket 170% Amid Trump Drug Price Push – But NHS Patients Spared",
    "description": "Private patients who rely on the hit weight-loss jab Mounjaro are facing a brutal price surge of up to 170% from September, after US drug giant Eli Lilly confirmed it is hiking UK prices to match other European countries. The monthly cost for the highest dose…",
    "link": "https://freerepublic.com/focus/f-chat/4334802/posts",
    "timestamp": "2025-08-15T18:46:50Z"
  },
  {
    "title": "Social Security Warning Over Changes Issued by Bernie Sanders",
    "description": "SSA spokesperson said the administration is \"committed to working with Congress and other stakeholders to protect and strengthen\" the program.",
    "link": "https://www.newsweek.com/social-security-warning-over-changes-issued-bernie-sanders-2114283",
    "timestamp": "2025-08-15T18:44:29Z"
  },
  {
    "title": "Bad diets, too many meds, no exercise: A look inside the latest 'Make America Healthy Again' report",
    "description": "Bad diets, too many meds, no exercise: A look inside the latest 'Make America Healthy Again' reportlocal10.com",
    "link": "https://www.local10.com//health/2025/08/15/bad-diets-too-many-meds-no-exercise-a-look-inside-the-latest-make-america-healthy-again-report/",
    "timestamp": "2025-08-15T18:44:15Z"
  },
  {
    "title": "Hillary Clinton stuns, says she would back Trump for Nobel Prize if he pulls off this big move",
    "description": "Hillary Clinton said she might nominate Donald Trump for the Nobel Peace Prize if he can bring peace between Russia and Ukraine without letting Russia take Ukrainian land. She spoke on a podcast about the Alaska meeting with Putin. Trump has long hoped for th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/hillary-clinton-stuns-says-she-would-back-trump-for-nobel-prize-if-he-pulls-off-this-big-move/articleshow/123325826.cms",
    "timestamp": "2025-08-15T18:40:13Z"
  },
  {
    "title": "Man Killed Fleeing Immigration Raid At California Home Depot: Officials",
    "description": "The store was adjacent to a highway, where the man was fatally struck by a vehicle.",
    "link": "https://www.huffpost.com/entry/man-killed-fleeing-immigration-raid-at-california-home-depot-officials_n_689f644fe4b0ef392c224240",
    "timestamp": "2025-08-15T18:40:01Z"
  },
  {
    "title": "Trump arrives for pivotal summit with Putin in Alaska that could reshape war in Ukraine",
    "description": "The sit-down gives Trump a chance to prove to the world that he is both a master dealmaker and a global peacemaker.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_44ecaba2-69ec-5893-b9a2-a013134b6d75.html",
    "timestamp": "2025-08-15T18:40:00Z"
  },
  {
    "title": "CNN Fact-Checker Exposes Trump's 'Absurd' Claims On Russia-Ukraine War",
    "description": "Daniel Dale said Thursday on \"News Central\" that the president's recent statements are not only inaccurate but \"a reversal of reality.\"",
    "link": "https://www.huffpost.com/entry/cnn-fact-checker-trump-russia-ukraine-war_n_689f3c5de4b0fd906c860a3a",
    "timestamp": "2025-08-15T18:38:37Z"
  },
  {
    "title": "‘Excruciating’: JD Vance’s golf outing at Trump course takes an ‘embarrassing turn’",
    "description": "Vice President JD Vance’s ongoing vacation in England took an “embarrassing turn on the golf course\r\n” on Friday after he was captured on camera struggling to sink his shot several times in a row on the putting green.“Having travelled to Scotland to play Trum…",
    "link": "https://www.rawstory.com/jd-vance-2673888137/",
    "timestamp": "2025-08-15T18:38:03Z"
  },
  {
    "title": "Panama Canal to Launch Tender for Construction, Operation of Two Ports",
    "description": "The Panama Canal will soon begin consultations with companies about launching a competitive tender in the first quarter of next year offering two new ports for construction and operation within its zone, a source involved in the preparations said on Thursday.",
    "link": "https://gcaptain.com/panama-canal-to-launch-tender-for-construction-operation-of-two-ports/",
    "timestamp": "2025-08-15T18:37:49Z"
  },
  {
    "title": "Meet the Woman Behind Gavin Newsom’s Viral Social Media Trump Trolling",
    "description": "Twenty-nine-year-old \"zillennial\" Camille Zapata began working for the governor last June\nThe post Meet the Woman Behind Gavin Newsom’s Viral Social Media Trump Trolling appeared first on TheWrap.",
    "link": "https://www.thewrap.com/gavin-newsom-viral-trump-trolling-social-media-director-camille-zapata/",
    "timestamp": "2025-08-15T18:36:23Z"
  },
  {
    "title": "If Trump can break promises, so can the law firms that promised him millions of dollars worth of free legal advice. \"It's just not happening\" [Followup]",
    "description": "If Trump can break promises, so can the law firms that promised him millions of dollars worth of free legal advice. \"It's just not happening\"",
    "link": "https://www.fark.com/comments/13778556/If-Trump-can-break-promises-so-can-law-firms-that-promised-him-millions-of-dollars-worth-of-free-legal-advice-Its-just-not-happening",
    "timestamp": "2025-08-15T18:32:31Z"
  },
  {
    "title": "Networks Plan Special Reports And Dispatch Anchors To Donald Trump-Vladimir Putin Summit",
    "description": "Networks will provide special coverage on Friday to President Donald Trump’s summit in Alaska with Russian President Vladimir Putin to discuss the ongoing war in Ukraine. All the major news networks were at Joint Base Elmendorf-Richardson to capture Trump’s a…",
    "link": "http://deadline.com/2025/08/trump-putin-summit-ukraine-1236489689/",
    "timestamp": "2025-08-15T18:32:18Z"
  },
  {
    "title": "Factbox-Russian energy export disruptions since start of Ukraine war",
    "description": "Trump has also threatened tougher sanctions if there is no progress.  Here is how sanctions have impacted Russian energy exports since the start of the...",
    "link": "https://finance.yahoo.com/news/factbox-russian-energy-export-disruptions-183025018.html",
    "timestamp": "2025-08-15T18:30:25Z"
  },
  {
    "title": "Texas Democrats signal likely end of gerrymander battle",
    "description": "\"We are about to suffer the blunt force of Governor Abbott's weakness,” state lawmaker says.",
    "link": "https://www.salon.com/2025/08/15/texas-democrats-signal-likely-end-of-gerrymander-battle/",
    "timestamp": "2025-08-15T18:30:04Z"
  },
  {
    "title": "Socialist Mamdani promises to 'Trump-proof' New York City, expel ICE",
    "description": "As evidenced by President Donald Trump calling Rep. Jasmine Crockett \"the future of the Democrat Party\" on Friday morning, Democrats have been at a loss for direction since Trump's inauguration. However, New York's self-proclaimed socialist mayoral candidate,…",
    "link": "https://www.theblaze.com/news/socialist-mamdani-promises-to-trump-proof-new-york-city-expel-ice",
    "timestamp": "2025-08-15T18:30:00Z"
  },
  {
    "title": "Hillary Clinton Hops On the MAGA Train? Former First Lady Confesses She Would Happily Nominate Trump for Nobel Peace Prize if Prez Saves Ukraine",
    "description": "Hillary Clinton admitted she would have no problem nominating Donald Trump for the Nobel Peace Prize is he saves Ukraine from Putin.",
    "link": "https://radaronline.com/p/hillary-clinton-maga-trump-nobel-peace-prize-ukraine-putin/",
    "timestamp": "2025-08-15T18:30:00Z"
  },
  {
    "title": "Trump touches down in Alaska",
    "description": "United States President Donald Trump arrived in Anchorage on Friday ahead of a high-stakes meeting with Russian President Vladimir Putin. The summit, set to take place at Joint Base Elmendorf-Richards...",
    "link": "https://biztoc.com/x/f74756d0d623e2f4",
    "timestamp": "2025-08-15T18:29:51Z"
  },
  {
    "title": "Data center owners urge US Treasury to keep renewable energy subsidy rules",
    "description": "USA-TECH-TREASURY:Data center owners urge US Treasury to keep renewable energy subsidy rules",
    "link": "https://www.livemint.com/companies/news/data-center-owners-urge-us-treasury-to-keep-renewable-energy-subsidy-rules-11755282497562.html",
    "timestamp": "2025-08-15T18:28:17Z"
  },
  {
    "title": "White House Privately Pressuring Indiana Lawmakers to Support Redistricting",
    "description": "White House officials are privately pressuring Republican Indiana lawmakers to support redistricting ahead of the 2026 midterms.\nThe post White House Privately Pressuring Indiana Lawmakers to Support Redistricting first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/white-house-privately-pressuring-indiana-lawmakers-to-support-redistricting/",
    "timestamp": "2025-08-15T18:28:17Z"
  }
]