[
  {
    "title": "Untreated Perinatal Depression Costs $14 Billion Every Year, But This Founder Has A Solution. Plus: Prevent Career Identity Theft",
    "description": "Welcome to this week’s ForbesWomen newsletter, which every Thursday brings news about the world’s top female entrepreneurs, leaders and investors straight to your inbox.",
    "link": "https://www.forbes.com/sites/maggiemcgrath/2025/09/19/untreated-perinatal-depression-costs-14-billion-every-year-but-this-founder-has-a-solution-plus-prevent-career-identity-theft/",
    "timestamp": "2025-09-19T21:25:25Z"
  },
  {
    "title": "Former Disney CEO Slams Bob Iger’s Leadership After Jimmy Kimmel Suspension",
    "description": "When Walt Disney died in 1966, The Walt Disney Company was left without its beloved leader and visionary who changed the world. Thankfully, they still had Walt’s brother, Roy O. Disney, who knew what his brother and business partner would have wanted. Roy wor…",
    "link": "https://insidethemagic.net/2025/09/michael-eisner-slams-bob-igers-leadership-after-jimmy-kimmel-suspension-ks1/",
    "timestamp": "2025-09-19T21:25:07Z"
  },
  {
    "title": "US gov’t asks Supreme Court to end protections for Venezuelan migrants",
    "description": "A federal judge ruled that terminating Temporary Protected Status for Venezuelans violates laws on government conduct.",
    "link": "https://www.aljazeera.com/news/2025/9/19/us-govt-asks-supreme-court-to-end-protections-for-venezuelan-migrants",
    "timestamp": "2025-09-19T21:24:50Z"
  },
  {
    "title": "Trump administration plans $100,000 H-1B visa fee hike: current costs and lottery system explained",
    "description": "President Trump reportedly plans to introduce $100,000 H-1B visa fees to curb program overuse, according to Bloomberg News sources. Current H-1B visa costs include $215 lottery registration fee and $780 Form I-129 filing charge. The proposed H-1B fee increase…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-plans-100000-h-1b-visa-fee-hike-current-costs-and-lottery-system-explained/articleshow/124006169.cms",
    "timestamp": "2025-09-19T21:24:45Z"
  },
  {
    "title": "'Standoff': New details revealed in Jimmy Kimmel suspension aftermath",
    "description": "Jimmy Kimmel, who was suspended \"indefinitely\" this week, is reportedly in a \"standoff\" with Disney and met with a top executive Thursday but did not reach a \"resolution,\" according to reports. The meeting with attorneys and the executive in Century City was …",
    "link": "https://www.rawstory.com/jimmy-kimmel-2674011339/",
    "timestamp": "2025-09-19T21:24:25Z"
  },
  {
    "title": "Trump's Updated Citizenship Test Ditches Diversity, Promotes 'One Nation, One People'",
    "description": "President Donald Trump's Department of Homeland Security (DHS) posted a 2025 study guide for migrants facing the U.S. citizenship test, and it notably excludes any progressive language about \"Diversity\" or a \"Nation of Immigrants.\"\nThe post Trump’s Updated Ci…",
    "link": "https://www.breitbart.com/immigration/2025/09/19/trumps-updated-citizenship-test-ditches-diversity-promotes-one-nation-one-people/",
    "timestamp": "2025-09-19T21:23:37Z"
  },
  {
    "title": "Golden statue of Trump holding bitcoin appeared outside US Capitol",
    "description": "On Sept. 18, 2025, a 12-foot golden statue of U.S. President Donald Trump holding a bitcoin was unveiled outside the Capitol building in Washington, D.C.",
    "link": "https://www.snopes.com//fact-check/trump-statue-bitcoin/",
    "timestamp": "2025-09-19T21:23:00Z"
  },
  {
    "title": "Trump-Xi call thaws US-China relations, but no clear TikTok deal yet",
    "description": "While the leaders had 'broken ice' with the call, US President Donald Trump was in no place to impose more tariffs.",
    "link": "https://www.aljazeera.com/economy/2025/9/19/trump-xi-call-thaws-us-china-relations-but-no-clear-tiktok-deal-yet",
    "timestamp": "2025-09-19T21:22:45Z"
  },
  {
    "title": "Trump: Xi wants to see Ukraine war ended",
    "description": "United States President Donald Trump said that he spoke to Chinese President Xi Jinping about the war between Russia and Ukraine and stated he believed Xi \"would like to see it done also.\" More to com...",
    "link": "https://biztoc.com/x/0cde5360c5c381e4",
    "timestamp": "2025-09-19T21:22:06Z"
  },
  {
    "title": "Mike Waltz confirmed as US Ambassador to UN, ending nine-month vacancy",
    "description": "US Senate confirms former National Security Advisor Mike Waltz as US Ambassador to the UN, ending a long saga.",
    "link": "https://www.israelnationalnews.com/news/415222",
    "timestamp": "2025-09-19T21:22:04Z"
  },
  {
    "title": "Tear gas used on protesters at Chicago-area ICE site as immigration crackdown escalates",
    "description": "Federal officers in camouflage and riot gear clashed as demonstrators blocked vehicles in protest of Trump's expanding enforcement sweep.gas as they clashed with demonstrators.",
    "link": "https://www.nbcnews.com/news/us-news/tear-gas-immigration-protest-chicago-area-broadview-rcna232494",
    "timestamp": "2025-09-19T21:21:22Z"
  },
  {
    "title": "Judge throws out Trump's New York Times lawsuit",
    "description": "The US president's $US15 billion defamation lawsuit against The New York Times has been labelled \"improper\" by a federal judge.",
    "link": "https://www.abc.net.au/news/2025-09-20/judge-throws-out-trump-ny-times-lawsuit/105797222",
    "timestamp": "2025-09-19T21:21:05Z"
  },
  {
    "title": "Trump says Xi approved a deal to keep TikTok operating in US",
    "description": "US President Donald Trump said Chinese President Xi Jinping had approved an agreement on TikTok after a phone call with the Chinese leader. But specifics are still unclear.",
    "link": "https://www.dw.com/en/trump-says-xi-approved-a-deal-to-keep-tiktok-operating-in-us/a-74070998",
    "timestamp": "2025-09-19T21:21:00Z"
  },
  {
    "title": "Exclusive: Sen. Cassidy's Bill Would Cut Biden Admin's Red Tape in Employment Services Program",
    "description": "Sen. Bill Cassidy (R-LA) has introduced a bill to undo the Biden administration's red tape within a federal employment program.\nThe post Exclusive: Sen. Cassidy’s Bill Would Cut Biden Admin’s Red Tape in Employment Services Program appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/19/exclusive-sen-cassidy-s-bill-would-cut-biden-admins-red-tape-employment-services-program/",
    "timestamp": "2025-09-19T21:19:55Z"
  },
  {
    "title": "Trump DOJ argues Michigan effort to shut down underwater pipeline interferes with US foreign policy",
    "description": "The Trump administration is trying to persuade a federal judge that Michigan Gov. Gretchen Whitmer's attempt to shut down part of an aging pipeline interferes with U.S. foreign policy",
    "link": "https://abcnews.go.com/US/wireStory/trump-doj-argues-michigan-effort-shut-underwater-pipeline-125751048",
    "timestamp": "2025-09-19T21:18:24Z"
  },
  {
    "title": "A Lawless Nation – Friends don't let friends visit America",
    "description": "Article URL: https://paulkrugman.substack.com/p/a-lawless-nation\nComments URL: https://news.ycombinator.com/item?id=45306740\nPoints: 7\n# Comments: 0",
    "link": "https://paulkrugman.substack.com/p/a-lawless-nation",
    "timestamp": "2025-09-19T21:18:24Z"
  },
  {
    "title": "Jay Leno Supports Jimmy Kimmel Years After Feud: ‘I’m for Free Speech’",
    "description": "Jay Leno is standing with Jimmy Kimmel despite their rocky past. While speaking to reporters outside Chris Wallace‘s Hollywood Walk of Fame ceremony on Thursday, September 18, Leno, 75, reacted to ABC pulling Jimmy Kimmel Live! off the air earlier this week. …",
    "link": "https://www.usmagazine.com/celebrity-news/news/jay-leno-supports-jimmy-kimmel-after-talk-show-suspension/#article",
    "timestamp": "2025-09-19T21:18:20Z"
  },
  {
    "title": "‘Where has all the leadership gone?’: Former Disney CEO Michael Eisner blasts Kimmel suspension",
    "description": "\"If not for university presidents, law firm managing partners and corporate chief executives standing up to bullies, then who will step up for the First Amendment?”",
    "link": "https://fortune.com/2025/09/19/michael-eisner-blasts-disney-leadership-jimmy-kimmel-suspension-first-amendment/",
    "timestamp": "2025-09-19T21:17:59Z"
  },
  {
    "title": "Judge blocks USDA from collecting data about SNAP applicants in 21 states",
    "description": "SNAP serves over 42 million people nationwide.",
    "link": "https://www.bostonherald.com/2025/09/19/snap-privacy-lawsuit/",
    "timestamp": "2025-09-19T21:17:58Z"
  },
  {
    "title": "How the administration’s ‘trumped-up’ mortgage fraud claims have backfired",
    "description": "Chris Hayes explains how the Trump administration's allegations of mortgage fraud against his political enemies, like Lisa Cook and Adam Schiff, are backfiring.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-lisa-cook-mortgage-fraud-bill-pulte-rcna232499",
    "timestamp": "2025-09-19T21:15:16Z"
  },
  {
    "title": "Schools should prioritize nutrition, physical fitness for mental health, say RFK, McMahon  - The Lion",
    "description": "Mental health programs in K-12 education often create more harm than healing, Trump officials caution. Secretary of Health and Human Services Robert Kennedy Jr. and Secretary of Education Linda McMahon issued the stark warning in a Washington Post op-ed. “Whi…",
    "link": "https://readlion.com/schools-should-prioritize-nutrition-physical-fitness-for-mental-health-say-rfk-mcmahon/",
    "timestamp": "2025-09-19T21:15:10Z"
  },
  {
    "title": "‘The View’s’ Silence on ABC Pulling ‘Jimmy Kimmel Live’ Is Proof TV Hosts Are Censoring Themselves to Appease Trump — and That’s Scary",
    "description": "What would Barbara Walters think if she were around to watch “The View” this week? When she was leading the daily roundtable at the venerable panel show she created, Walters leaned into the news, even when it hurt. To wit: When her star hire, Rosie O’Donnell,…",
    "link": "https://variety.com/2025/tv/columns/the-view-whoopi-goldberg-jimmy-kimmel-1236524681/",
    "timestamp": "2025-09-19T21:12:41Z"
  },
  {
    "title": "Trump says Xi approved TikTok deal",
    "description": "United States President Donald Trump stated that he thought China's President Xi Jinping approved the TikTok deal after their two-hour call, though they still had to \"get it signed.\" More to come......",
    "link": "https://biztoc.com/x/c0e7b18c8c4c465f",
    "timestamp": "2025-09-19T21:10:35Z"
  },
  {
    "title": "California Dems Scramble To Boost Oil Production After Running Refiners Out Of Town",
    "description": "Newsom signed a set of energy bills Friday after years of allowing strict regulations to clamp down on the state's oil industry.",
    "link": "https://dailycaller.com/2025/09/19/california-dems-scramble-to-boost-oil-production-after-running-refiners-out-of-town/",
    "timestamp": "2025-09-19T21:10:30Z"
  },
  {
    "title": "Trump Says TV Licenses Should Be Pulled Over Bad Press for Him",
    "description": "President Donald Trump said US broadcast networks should face scrutiny over their licenses if they’re too critical of him, in what amounts to his furthest-reaching threat to media freedoms.\n“When you have a network and you have evening shows, and all they do …",
    "link": "https://biztoc.com/x/e8ae6f6b6884d4be",
    "timestamp": "2025-09-19T21:10:24Z"
  },
  {
    "title": "Hillary Clinton on Kimmel, Kirk: 'Very Clear Example of Using the Power of the State to Suppress Speech'",
    "description": "Former Secretary of State Hillary Clinton on Friday weighed in on the fallout surrounding Jimmy Kimmel’s suspension, addressing both the late-night host’s removal and the assassination of Turning Point USA founder Charlie Kirk during an interview with CNN’s F…",
    "link": "https://www.breitbart.com/politics/2025/09/19/hillary-clinton-on-kimmel-kirk-very-clear-example-of-using-the-power-of-the-state-to-suppress-speech/",
    "timestamp": "2025-09-19T21:10:11Z"
  },
  {
    "title": "DOJ asks Supreme Court to strip legal protections from 300,000 Venezuelan migrants",
    "description": "The Trump administration on Friday asked the Supreme Court for an emergency order allowing it to strip legal protections from more than 300,000 Venezuelan migrants.",
    "link": "https://www.pbs.org/newshour/politics/doj-asks-supreme-court-to-strip-legal-protections-from-300000-venezuelan-migrants",
    "timestamp": "2025-09-19T21:09:58Z"
  },
  {
    "title": "Trump DOJ argues Michigan effort to shut down underwater pipeline interferes with US foreign policy",
    "description": "The Trump administration is stepping into the legal fight over whether Enbridge can continue to operate an aging pipeline beneath a Great Lakes channel, arguing that Michigan Gov. Gretchen Whitmer interfered with U.S. foreign policy when she revoked the line’…",
    "link": "https://financialpost.com/pmn/trump-doj-argues-michigan-effort-to-shut-down-underwater-pipeline-interferes-with-us-foreign-policy",
    "timestamp": "2025-09-19T21:09:38Z"
  },
  {
    "title": "Trump to Enact $100,000 H-1B Visa Fee in Bid to Help American Workers: Report",
    "description": "Importing foreign workers is going to get much more expensive for U.S. employers thanks to Trump, according to a new report.",
    "link": "https://www.westernjournal.com/trump-enact-100000-h-1b-visa-fee-bid-help-american-workers-report/",
    "timestamp": "2025-09-19T21:09:35Z"
  },
  {
    "title": "Jimmy Kimmel is ‘incredibly pissed’ and still balking at apologizing for Charlie Kirk comments as Disney bosses scramble",
    "description": "The furious ABC late-show host went to his lawyer's office in Los Angeles that afternoon for a video meeting with Disney TV honcho Dana Walden and ABC late-night head Rob Mills to try to figure out a path forward for his show, \"Jimmy Kimmel Live!\" sources tol…",
    "link": "https://nypost.com/2025/09/19/media/jimmy-kimmel-is-incredibly-pissed-and-still-balking-at-apologizing-for-charlie-kirk-comments-as-disney-bosses-scramble/",
    "timestamp": "2025-09-19T21:08:41Z"
  },
  {
    "title": "Donald Trump Took a Dig at Prince Harry While Speaking at Dinner Hosted by King Charles",
    "description": "Donald Trump Took a Dig at Prince Harry While Speaking at Dinner Hosted by King Charlescafemom.com",
    "link": "https://cafemom.com/entertainment/donald-trump-took-dig-at-prince-harry-while-speaking-at-dinner-hosted-by-king-charles",
    "timestamp": "2025-09-19T21:08:11Z"
  },
  {
    "title": "Trump won’t impose terms on Russia and Ukraine – envoy",
    "description": "The US president will try to bring both sides together to negotiate a settlement to the conflict, US ambassador to NATO has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624934-us-nato-envoy-trump-wont-set-conditions-ukraine-talks/",
    "timestamp": "2025-09-19T21:07:33Z"
  },
  {
    "title": "What Congress should ask Alex Acosta about Jeffrey Epstein",
    "description": "Some pressing questions, based on a review of court documents and other public records, for Alex Acosta, the former U.S. attorney who oversaw the non-prosecution agreement with Jeffrey Epstein.",
    "link": "https://www.msnbc.com/news/news-analysis/alex-acosta-jeffrey-epstein-testimony-house-oversight-rcna232401",
    "timestamp": "2025-09-19T21:07:07Z"
  },
  {
    "title": "‘Andor’ Writer Dan Gilroy On Disney Suspending Jimmy Kimmel & Hollywood Facing “Venomous Evil”: “This Isn’t A Skirmish. It’s A Siege” – Guest Column",
    "description": "Editor’s note: Andor writer Dan Gilroy won his first Emmy for the Season 2 episode titled “Welcome to the Rebellion,” which featured Mon Mothma’s anti-fascism speech to the Senate. His Disney+ series was front of mind Thursday at Disney HQ in Burbank where th…",
    "link": "http://deadline.com/2025/09/andor-dan-gilroy-jimmy-kimmel-commentary-1236549627/",
    "timestamp": "2025-09-19T21:06:38Z"
  },
  {
    "title": "Trump admin asks Supreme Court to restore anti-trans passport policy",
    "description": "Donald Trump’s administration has filed an emergency appeal with the U.S. Supreme Court asking it to reinstate a passport policy that doesn’t recognize transgender, nonbinary, or intersex identities.",
    "link": "https://www.advocate.com/news/trump-appeals-passports-supreme-court",
    "timestamp": "2025-09-19T21:05:36Z"
  },
  {
    "title": "In Wake of Ukrainian Refugee’s Killing, Trump Demands Cities Enhance Transit System Security",
    "description": "President Donald Trump’s Transportation Department is demanding cities address crime on their transit systems after a 23-year-old woman was fatally stabbed on a train in... Read More\nThe post In Wake of Ukrainian Refugee’s Killing, Trump Demands Cities Enhanc…",
    "link": "https://www.dailysignal.com/2025/09/19/in-wake-of-ukrainian-refugees-killing-trump-demands-cities-enhance-transit-system-security/",
    "timestamp": "2025-09-19T21:05:35Z"
  },
  {
    "title": "Kremlin replies after Trump says ‘Putin let me down’",
    "description": "The US president has been quite “emotional” about the status of Ukraine talks, Kremlin spokesman Dmitry Peskov has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/624936-trump-ukraine-frustration-understandable/",
    "timestamp": "2025-09-19T21:04:19Z"
  },
  {
    "title": "Conan O’Brien Opens Up About Silencing Late Night Hosts Amidst Network Cancellation (And Hiatus)",
    "description": "Here's what he had to say about Jimmy Kimmel and more.",
    "link": "https://www.cinemablend.com/television/conan-obrien-silencing-late-night-hosts-network-cancellation-hiatus-jimmy-kimmel-stephen-colbert",
    "timestamp": "2025-09-19T21:03:49Z"
  },
  {
    "title": "FCC Chair Brendan Carr Raises Republican Eyebrows Over Handling Of Jimmy Kimmel Suspension",
    "description": "Federal Communications Commission (FCC) Chairman Brendan Carr is drawing heat from some GOP lawmakers over his response to Jimmy Kimmel's suspension.",
    "link": "https://dailycaller.com/2025/09/19/fcc-brendan-carr-gop-lawmakers-free-speech-jimmy-kimmel-suspension-disney-abc/",
    "timestamp": "2025-09-19T21:03:16Z"
  },
  {
    "title": "Los viajes de Donald",
    "description": "Un juez federal tumba la demanda de 15.000 millones de Trump contra 'The New York Times'",
    "link": "https://www.eldiario.es/opinion/viajes-donald_131_12618003.html",
    "timestamp": "2025-09-19T21:03:00Z"
  },
  {
    "title": "Judge blocks USDA from collecting data about SNAP applicants in 21 states",
    "description": "A judge has temporarily stopped the federal government from collecting personal information about residents in the Supplemental Nutrition Assistance Program, or SNAP, in 21 states and Washington, D",
    "link": "https://abcnews.go.com/US/wireStory/judge-blocks-usda-collecting-data-snap-applicants-21-125750071",
    "timestamp": "2025-09-19T21:02:14Z"
  },
  {
    "title": "Taiwan’s Message to Trump and the U.N.: ‘We’re Not a Freeloader’",
    "description": "The island’s de facto ambassador to Washington on Trump, China, defense spending, and more.",
    "link": "http://foreignpolicy.com/2025/09/19/taiwan-trump-xi-china-unga-military-aid-defense-spending/",
    "timestamp": "2025-09-19T21:02:09Z"
  },
  {
    "title": "Oil Pipeline Lifeline for Canada Comes Under Siege in Michigan",
    "description": "Michigan’s highest court has yanked Enbridge’s Line 5 pipeline back into the legal spotlight, agreeing Friday to hear Tribal Nations and environmental groups who say the state’s Public Service Commission broke the law when it signed off on a tunnel beneath th…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Oil-Pipeline-Lifeline-for-Canada-Comes-Under-Siege-in-Michigan.html",
    "timestamp": "2025-09-19T21:00:00Z"
  },
  {
    "title": "Ted Cruz Opposes FCC Threats Over Kimmel Remark: ‘That Will End up Bad for Conservatives’",
    "description": "Sen. Ted Cruz warned Friday that conservatives would come to regret using state power to silence Jimmy Kimmel, saying that such power will be turned against them in a future Democratic administration. Appearing on his podcast, “Verdict with Ted Cruz,” the Rep…",
    "link": "https://variety.com/2025/tv/news/ted-cruz-fcc-jimmy-kimmel-brendan-carr-1236524620/",
    "timestamp": "2025-09-19T20:59:38Z"
  },
  {
    "title": "Donald Trump's $6 Billion Israeli Weapons Sale: Here's What It Includes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration has notified Congress of plans to sell nearly $6 billion in weapons to Israel, the latest show of U.S. support as the country faces growing international isolation over its war in Gaza…",
    "link": "https://biztoc.com/x/0e74df76484e8e16",
    "timestamp": "2025-09-19T20:59:32Z"
  },
  {
    "title": "President Trump to impose $100,000 fee on H-1B visa applications to encourage hiring Americans",
    "description": "President Trump is anticipated to reformthe H-1B visa program, mandating a $100,000 application fee to encourage hiring American workers…\nThe post President Trump to impose $100,000 fee on H-1B visa applications to encourage hiring Americans appeared first on…",
    "link": "https://macdailynews.com/2025/09/19/president-trump-to-impose-100000-fee-on-h-1b-visa-applications-to-encourage-hiring-americans/",
    "timestamp": "2025-09-19T20:58:18Z"
  },
  {
    "title": "Congressional candidate shares images of ICE hurling her to ground",
    "description": "Protests at a US Immigration and Customs Enforcement facility in suburban Chicago continued on Friday, with ICE and Border Patrol agents tear-gassing\r\n, pepper-spraying, and detaining demonstrators—and even throwing congressional candidate\r\n Kat Abughazaleh t…",
    "link": "https://www.rawstory.com/congressional-candidate-shares-images-of-ice-hurling-her-to-ground/",
    "timestamp": "2025-09-19T20:56:48Z"
  },
  {
    "title": "Trump’s Margin Of Approval Jumps 10 Points In Four Days, Poll Says",
    "description": "President Donald Trump's job approval rating among Americans has risen by several points since Monday, according to polling from Rasmussen Reports.",
    "link": "https://dailycaller.com/2025/09/19/trump-approval-margin-poll/",
    "timestamp": "2025-09-19T20:55:37Z"
  },
  {
    "title": "Venezuela accuses U.S. of waging 'undeclared war'",
    "description": "Venezuela on Friday accused the United States of waging an &quot;undeclared war&quot; in the Caribbean, where Washington has deployed warships and blown up alleged drug boats in recent weeks. &quot;It is an undeclared war, and you can already see how people, …",
    "link": "https://japantoday.com/category/world/venezuela-accuses-us-of-waging-%27undeclared-war%27",
    "timestamp": "2025-09-19T20:55:10Z"
  },
  {
    "title": "Trump, Xi Inch Closer to a TikTok Deal",
    "description": "Further talks are expected, including an in-person meeting at next month’s APEC summit.",
    "link": "http://foreignpolicy.com/2025/09/19/trump-xi-tiktok-deal-phone-call-bytedance-china-us-apec-summit/",
    "timestamp": "2025-09-19T20:55:10Z"
  },
  {
    "title": "Trump, Xi Talk TikTok Deal",
    "description": "Further talks are expected, including an in-person meeting at next month’s APEC summit.",
    "link": "http://foreignpolicy.com/2025/09/19/trump-xi-tiktok-deal-phone-call-bytedance-china-us/",
    "timestamp": "2025-09-19T20:55:05Z"
  },
  {
    "title": "More than 400 arrests made so far in Chicago area enforcement operation, top ICE official says",
    "description": "Immigration enforcement officials have arrested more than 400 people as part of an operation in the Chicago area that launched a little less than two weeks ago, a top Immigration and Customs Enforcement official said Friday.",
    "link": "https://www.pbs.org/newshour/nation/more-than-400-arrests-made-so-far-in-chicago-area-enforcement-operation-top-ice-official-says",
    "timestamp": "2025-09-19T20:55:04Z"
  },
  {
    "title": "Judge throws out Trump's $15 billion lawsuit against New York Times",
    "description": "A federal judge on Friday threw out U.S. President Donald Trump's $15 billion defamation lawsuit against the New York Times over its content, calling it a &quot;decidedly improper and impermissible&quot; effort to attack his adversaries. U.S. District Judge S…",
    "link": "https://japantoday.com/category/world/judge-throws-out-trump%27s-15-billion-lawsuit-against-new-york-times-citing-improper-content",
    "timestamp": "2025-09-19T20:55:02Z"
  },
  {
    "title": "More than 400 arrests made in Chicago area operation so far, top immigration official says",
    "description": "Immigration enforcement officials have arrested more than 400 people as part of an operation in the Chicago area that launched a little less than two weeks ago, a top Immigration and Customs Enforcement official said Friday. Marcos Charles, the acting head of…",
    "link": "https://japantoday.com/category/world/more-than-400-arrests-made-in-chicago-area-operation-so-far-top-immigration-official-says",
    "timestamp": "2025-09-19T20:54:53Z"
  },
  {
    "title": "So, Can Jimmy Kimmel Sue the FCC?",
    "description": "Can Jimmy Kimmel sue the FCC? We talked to experts about the abrupt decision to pull ‘Jimmy Kimmel Live!’ — and no, none of this is normal.",
    "link": "http://www.vulture.com/article/can-jimmy-kimmel-sue-the-fcc-lawsuit.html",
    "timestamp": "2025-09-19T20:54:50Z"
  },
  {
    "title": "Charlie Kirk credited with helping Trump gain significant ground with young voters",
    "description": "Turning Point USA founder Charlie Kirk is credited with energizing young voters for Trump's 2024 victory, as Republicans gained ground with the 18-29 demographic nationwide.",
    "link": "https://www.foxnews.com/politics/charlie-kirks-influence-likely-helped-youth-swing-trump-2024",
    "timestamp": "2025-09-19T20:54:22Z"
  },
  {
    "title": "Ted Cruz, a powerful Republican, condemns government threats against U.S. broadcasters",
    "description": "U.S. Senator Ted Cruz, the Republican who leads oversight of the Federal Communications Commission, joined Democrats on Friday in criticizing FCC Chair Brendan Carr's recent threats against Disney and local broadcasters for airing &quot;Jimmy Kimmel Live.&quo…",
    "link": "https://japantoday.com/category/world/ted-cruz-a-powerful-republican-condemns-government-threats-against-us-broadcasters",
    "timestamp": "2025-09-19T20:54:19Z"
  },
  {
    "title": "Trump and Xi make progress on TikTok deal; plan to meet in South Korea",
    "description": "U.S. President Donald Trump said he and Chinese President Xi Jinping made progress on a TikTok agreement and would meet face-to-face in six weeks in South Korea to discuss trade, illicit drugs and Russia's war in Ukraine. The two sides appeared to lower tensi…",
    "link": "https://japantoday.com/category/world/trump-and-xi-make-progress-on-tiktok-deal-plan-to-meet-in-south-korea",
    "timestamp": "2025-09-19T20:54:09Z"
  },
  {
    "title": "Most dangerous cities in America",
    "description": "Stacker ranked the most dangerous U.S. cities using WalletHub's 2025 rankings.",
    "link": "https://stacker.com/stories/real-estate/most-dangerous-cities-america",
    "timestamp": "2025-09-19T20:53:18Z"
  },
  {
    "title": "The FCC Chair's Unprecedented, and Constitutionally Problematic, Response to Jimmy Kimmel",
    "description": "And Trump's much more extreme one. [EV writes: I bumped this post from yesterday, because it struck me as especially timely and substantively valuable.]",
    "link": "https://reason.com/volokh/2025/09/19/the-fcc-chairs-unprecedented-and-constitutionally-problematic-response-to-jimmy-kimmel/",
    "timestamp": "2025-09-19T20:53:02Z"
  },
  {
    "title": "Breaking down report Trump admin said birth control pills, IUDs cause abortions",
    "description": "The rumor originated from New York Times reporting about the Trump administration destroying $10 million in contraceptives meant to go abroad.",
    "link": "https://www.snopes.com//news/2025/09/19/trump-admin-birth-control/",
    "timestamp": "2025-09-19T20:53:00Z"
  },
  {
    "title": "Donald Trump's $6 Billion Israeli Weapons Sale: Here's What It Includes",
    "description": "The proposed sales come as U.S.-backed efforts to broker an end to Israel's nearly two-year conflict with Hamas have faltered.",
    "link": "https://www.newsweek.com/trump-israel-weapons-sale-six-billion-hamas-gaza-2132813",
    "timestamp": "2025-09-19T20:51:48Z"
  },
  {
    "title": "Jay Leno Reacts To Jimmy Kimmel’s Suspension After ‘Offensive’ Charlie Kirk Comments",
    "description": "“I think Jimmy will land on his feet, he’s a talented guy, he’s funny and let’s see what happens.”",
    "link": "https://www.boredpanda.com/jay-leno-reacts-to-jimmy-kimmel-suspension-years-after-host-humiliated-him/",
    "timestamp": "2025-09-19T20:50:56Z"
  },
  {
    "title": "Trump Pardoned Him. Now He Won’t Have to Pay Back $660 Million",
    "description": "Trevor Milton and his wife donated $1.8 million to Trump in 2024.",
    "link": "https://gizmodo.com/trump-pardoned-him-now-he-wont-have-to-pay-back-660-million-2000661542",
    "timestamp": "2025-09-19T20:50:29Z"
  },
  {
    "title": "Fired MSNBC Analyst Blasts Network’s Hosts for Caring More About Jimmy Kimmel’s Suspension Than His Exit | Video",
    "description": "\"Including Morning Joe and Mika, who went after me after the show, basically saying they were glad I was terminated,\" Matthew Dowd tells Katie Couric\nThe post Fired MSNBC Analyst Blasts Network’s Hosts for Caring More About Jimmy Kimmel’s Suspension Than His …",
    "link": "https://www.thewrap.com/matthew-dowd-fired-msnbc-jimmy-kimmel-suspended-morning-joe/",
    "timestamp": "2025-09-19T20:49:33Z"
  },
  {
    "title": "Watch Live: Donald Trump Signs Executive Orders",
    "description": "President Donald Trump signs executive orders in the Oval Office at the White House on Friday, September 19.\nThe post Watch Live: Donald Trump Signs Executive Orders appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/09/19/watch-live-donald-trump-signs-executive-orders-3/",
    "timestamp": "2025-09-19T20:48:58Z"
  },
  {
    "title": "Why FCC Chief Brendan Carr May Be the Most Dangerous Man in Media",
    "description": "Carr’s most pronounced quality is his total fealty to Donald Trump — and he’s been busy weaponizing the FCC for the cause.\nThe post Why FCC Chief Brendan Carr May Be the Most Dangerous Man in Media appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/09/19/fcc-brendan-carr-trump-kimmel/",
    "timestamp": "2025-09-19T20:48:06Z"
  },
  {
    "title": "Donald Trump's face loss: Judge rejects U.S. President's '$15 bn 'rage' lawsuit against New York Times",
    "description": "Donald Trump filed the lawsuit against the Times on Monday, adding to his growing list of legal attacks on news organizations he accuses of bias against him.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-face-loss-judge-rejects-u-s-presidents-15-bn-rage-lawsuit-against-new-york-times/articleshow/124006097.cms",
    "timestamp": "2025-09-19T20:46:11Z"
  },
  {
    "title": "George Soros Funneled $80 Million to Groups That Praise Terrorists and Encourage Violence: Report",
    "description": "The report said Soros has distributed millions to groups that engage in or endorse actions that meet the definition of domestic terrorism.",
    "link": "https://www.westernjournal.com/explosive-report-alleges-george-soros-doled-80-million-leftist-groups-glorifying-terrorism-violence/",
    "timestamp": "2025-09-19T20:46:02Z"
  },
  {
    "title": "'Bulldoze it': Critics aghast at new Trump plan impacting White House",
    "description": "A new report left critics aghast Friday as it claimed donors to President Donald Trump's luxurious new White House ballroom may get their names enshrined in the building \"forever.\"Trump is building the addition, a project described as the most significant ren…",
    "link": "https://www.rawstory.com/white-house-ballroom-2674011165/",
    "timestamp": "2025-09-19T20:45:42Z"
  },
  {
    "title": "‘Not looking for peace’: Ex-Dem strategist says party may have rioted if their own Charlie Kirk were assassinated",
    "description": "'I mean, just look at the history of the last 40 years when stuff like that has happened'",
    "link": "https://www.wnd.com/2025/09/not-looking-peace-ex-dem-strategist-says-party/",
    "timestamp": "2025-09-19T20:45:33Z"
  },
  {
    "title": "Charlie Kirk's Producer Has Surprising Take On Infamous 'South Park' Parody Episode",
    "description": "Andrew Kolvet, once a producer for Kirk, said his former boss would not have liked his episode being \"buried.\"",
    "link": "https://www.huffpost.com/entry/charlie-kirk-producer-weighs-in-on-infamous-south-park-parody_n_68cd9e54e4b01c2e8cb62127",
    "timestamp": "2025-09-19T20:45:06Z"
  },
  {
    "title": "Trump asks Supreme Court to allow him to enforce transgender passport policy",
    "description": "President Donald Trump’s administration is asking the Supreme Court to let it enforce a passport policy for transgender and nonbinary people requiring male or female sex designations based on birth certificates",
    "link": "https://abcnews.go.com/US/wireStory/trump-asks-supreme-court-enforce-transgender-nonbinary-passport-125738701",
    "timestamp": "2025-09-19T20:41:34Z"
  },
  {
    "title": "Kanye West Screams At Kris Jenner About Not Taking His Meds In New Documentary: ‘I’d Rather Be Dead!’",
    "description": "A new documentary shockingly reveals Kanye West screamed in ex-mother-in-law Kris Jenner’s face about his mental health, saying he’d rather die than take his meds. In His Name follows several tumultuous years of Ye’s life, marked by creative controversies, fa…",
    "link": "https://bossip.com/3887348/kanye-west-kris-jenner-new-documentary-in-his-name-mental-health/",
    "timestamp": "2025-09-19T20:40:42Z"
  },
  {
    "title": "US Treasury Department seeks public comment on applying GENIUS Act stablecoin rules",
    "description": "GENIUS passed both Republican-led chambers of the U.S. Congress in July with the backing of President Donald Trump.",
    "link": "https://biztoc.com/x/63856eed921418e0",
    "timestamp": "2025-09-19T20:37:25Z"
  },
  {
    "title": "Trump to sign proclamation imposing $100K fee for H-1B visa applications, White House official says",
    "description": "By BARBARA ORTUTAY and SEUNG MIN KIM, Associated Press\nWASHINGTON (AP) — President Donald Trump is preparing to sign a proclamation that will require a $100,000 application fee for H-1B visa applications among other changes to the program for highly skilled f…",
    "link": "https://biztoc.com/x/5fc9561be3492ff0",
    "timestamp": "2025-09-19T20:37:23Z"
  },
  {
    "title": "PA, Northeast States Team Up On Public Health - LevittownNow.com",
    "description": "Facing federal health and vaccine policy changes, Pennsylvania and neighboring states form a new voluntary group to share expertise and strengthen regional readiness.",
    "link": "https://levittownnow.com/2025/09/19/pa-northeast-states-team-up-on-public-health/",
    "timestamp": "2025-09-19T20:36:35Z"
  },
  {
    "title": "Trump to host Erdogan: We have always had a very good relationship",
    "description": "US President announces he will host Turkish President Erdogan on September 25. The agenda includes trade, military deals like F-16 and F-35 talks, and potential energy agreements.",
    "link": "https://www.israelnationalnews.com/news/415221",
    "timestamp": "2025-09-19T20:36:09Z"
  },
  {
    "title": "Kash Patel’s weird week",
    "description": "Kash Patel has had a long week. The FBI director and frequent social media poster faced scrutiny for how he handled the Charlie Kirk assassination investigation, including from members of his own party. Conservative activist Chris Rufo posted on X: “We would …",
    "link": "https://www.vox.com/podcasts/462188/kash-patel-fbi-charlie-kirk-trump-rufo",
    "timestamp": "2025-09-19T20:35:39Z"
  },
  {
    "title": "Trump's Approval Rating Slips Back To Second Term Low: Poll",
    "description": "Trump's approval rating has slid back to a second-term low, according to new Associated Press/NORC polling.",
    "link": "https://www.newsweek.com/trumps-approval-rating-slips-back-second-term-low-poll-2132803",
    "timestamp": "2025-09-19T20:35:21Z"
  },
  {
    "title": "Keith Olbermann says Stephen A. Smith is 'prostituting himself to right wing' after Jimmy Kimmel criticism",
    "description": "Former ESPN host Keith Olbermann attacked Stephen A. Smith over his comments about Jimmy Kimmel's indefinite suspension following Charlie Kirk assassination remarks.",
    "link": "https://www.foxnews.com/sports/keith-olbermann-says-stephen-a-smith-prostituting-himself-right-wing-after-jimmy-kimmel-criticism",
    "timestamp": "2025-09-19T20:35:18Z"
  },
  {
    "title": "Why ‘The View’ Stayed Silent About Jimmy Kimmel Controversy",
    "description": "The ladies of The View were surprisingly silent about ABC pulling Jimmy Kimmel Live! off the air due to the host’s comments about the killing of controversial pundit Charlie Kirk. There was no discussion about Jimmy Kimmel’s suspension or the subsequent Holly…",
    "link": "https://www.usmagazine.com/celebrity-news/news/why-the-view-did-not-address-jimmy-kimmels-suspension/#article",
    "timestamp": "2025-09-19T20:35:10Z"
  },
  {
    "title": "Ted Cruz: 'Unbelievably dangerous' to threaten FCC licenses, compares chair to mob boss",
    "description": "Senator Ted Cruz criticized FCC Chairman Brendan Carr's comments about pulling ABC's broadcasting license, calling his language \"unbelievably dangerous\" and \"straight out of Goodfellas.\"",
    "link": "https://www.fox26houston.com/news/ted-cruz-compares-fcc-chair-mob-boss-jimmy-kimmel",
    "timestamp": "2025-09-19T20:35:08Z"
  },
  {
    "title": "Trump to sign proclamation imposing $100K fee for H-1B visas: White House",
    "description": "H-1B visas are intended to bring skilled foreigners for jobs tech companies struggle to fill.",
    "link": "https://www.twincities.com/2025/09/19/trump-h1b-visa-changes/",
    "timestamp": "2025-09-19T20:33:19Z"
  },
  {
    "title": "Byron Donalds rebukes 'Squad' member over 'fascist' slur: ‘Do I look like a member of the Third Reich?’",
    "description": "A House hearing on D.C. crime spiraled into a shouting match as Rep. Byron Donalds, R-Fla., blasted Rep. Rashida Tlaib, D-Mich., for calling the GOP's crime proposals \"fascist.\"",
    "link": "https://www.foxnews.com/politics/byron-donalds-rebukes-squad-member-over-fascist-slur-do-i-look-like-member-third-reich",
    "timestamp": "2025-09-19T20:32:33Z"
  },
  {
    "title": "Can House Impeach Ilhan Omar? Trump Wants Her Ousted Over Kirk Remarks",
    "description": "Trump has called for Representative Ilhan Omar's impeachment over her commentary on Charlie Kirk, despite House members not be subject to impeachment.",
    "link": "https://www.newsweek.com/can-house-impeach-ilhan-omar-trump-wants-her-ousted-over-kirk-remarks-2132744",
    "timestamp": "2025-09-19T20:32:02Z"
  },
  {
    "title": "Former CEO Michael Eisner Blasts Company for Caving to ‘Out-of-Control Intimidation’ from Trump’s FCC",
    "description": "Michael Eisner, former CEO of the Walt Disney Company, blasted his successor for the decision to suspend Jimmy Kimmel's show, characterizing it as caving to \"out-of-control intimidation\" from President Donald Trump's administration.\nThe post Former CEO Michae…",
    "link": "https://www.mediaite.com/media/former-ceo-michael-eisner-blasts-company-for-caving-to-out-of-control-intimidation-from-trumps-fcc/",
    "timestamp": "2025-09-19T20:30:46Z"
  },
  {
    "title": "Trump to sign proclamation imposing $100K fee for H-1B visa applications, White House official says",
    "description": "H-1B visas are intended to bring skilled foreigners for jobs tech companies struggle to fill.",
    "link": "https://www.bostonherald.com/2025/09/19/trump-h1b-visa-changes/",
    "timestamp": "2025-09-19T20:29:06Z"
  },
  {
    "title": "Trump to sign proclamation imposing $100K fee for H-1B visa applications",
    "description": "President Donald Trump has signed a proclamation that will require a new, $100,000 annual fee for H-1B visa applications. This move is among the changes to the program for highly skilled foreign workers, which has come under scrutiny by the administration. H-…",
    "link": "https://apnews.com/article/h1b-visa-trump-immigration-8d39699d0b2de3d90936f8076357254e",
    "timestamp": "2025-09-19T20:27:00Z"
  }
]