[
  {
    "title": "Stunned Abby Phillip Rolls Eyes At New Scott Jennings Trump Defense",
    "description": "Abby Phillip was stunned by Scott Jennings's newest defense of President Donald Trump — his idea of shipping U.S. citizens to El Salvador.\nThe post Stunned Abby Phillip Rolls Eyes At New Scott Jennings Trump Defense first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/is-that-what-youre-saying-cnns-abby-phillip-stunned-by-new-scott-jennings-trump-defense/",
    "timestamp": "2025-04-08T12:19:51Z"
  },
  {
    "title": "China condemns JD Vance’s ‘peasants’ jibe",
    "description": "Beijing hammers US vice president as lacking \"knowledge and respect\" in escalating feud.",
    "link": "https://www.politico.eu/article/china-slams-ignorant-impolite-jd-vance-over-chinese-peasants-comment/",
    "timestamp": "2025-04-08T12:19:45Z"
  },
  {
    "title": "Trump admin fires Navy admiral at NATO targeted by conservative group",
    "description": "The Trump administration has sacked a senior NATO official who was recommended by a conservative research group to be fired as part of a broader effort to purge of wokeness from the Pentagon.",
    "link": "https://www.foxnews.com/politics/trump-admin-fires-navy-admiral-nato-targeted-conservative-group",
    "timestamp": "2025-04-08T12:19:43Z"
  },
  {
    "title": "Tuesday: Hili dialogue",
    "description": "Welcome to The Cruelest Day: Tuesday, April 8, 2025, and National Empanada Day. Here’s one I bought in Santiago, Chile in 2019: It’s also Dog Farting Awareness Day (do they need a day for that?), International Romani Day, and Free Cone Day, when you can get a…",
    "link": "https://whyevolutionistrue.com/2025/04/08/tuesday-hili-dialogue-524/",
    "timestamp": "2025-04-08T12:19:25Z"
  },
  {
    "title": "Iran Says Deal Can Be Reached If US Shows Goodwill",
    "description": "Iran's top diplomat said Tuesday he believed a new nuclear deal could be agreed with the United States provided Tehran's longtime foe shows sufficient goodwill in talks to begin in Oman on Saturday.",
    "link": "https://www.ibtimes.com.au/iran-says-deal-can-reached-if-us-shows-goodwill-1857663",
    "timestamp": "2025-04-08T12:18:27Z"
  },
  {
    "title": "Iran Says Deal Can Be Reached If US Shows Goodwill",
    "description": "Iran's top diplomat said Tuesday he believed a new nuclear deal could be agreed with the United States provided Tehran's longtime foe shows sufficient goodwill in talks to begin in Oman on Saturday.",
    "link": "https://www.ibtimes.com/iran-says-deal-can-reached-if-us-shows-goodwill-3769214",
    "timestamp": "2025-04-08T12:18:06Z"
  },
  {
    "title": "Egypt Rallies Support Against Trump's Gaza Plan",
    "description": "Egypt has intensified rejection of relocating Palestinians as Trump doubled down on proposal",
    "link": "https://www.newsweek.com/egypt-rallies-support-against-trumps-gaza-plan-2056756",
    "timestamp": "2025-04-08T12:18:00Z"
  },
  {
    "title": "American Accused of Insulting Monarchy Could Face Years in Jail",
    "description": "Prominent academic Paul Chambers faces charges in Thailand that could lead to up to 15 years in jail",
    "link": "https://www.newsweek.com/american-monarchy-royals-thailand-crime-2056795",
    "timestamp": "2025-04-08T12:17:43Z"
  },
  {
    "title": "Who’s in and Who’s out at MSNBC as SpinCo Spin-Off Looms",
    "description": "The SpinCo split means that journalists that have previously worked for both networks now have to choose one.",
    "link": "https://www.adweek.com/tvnewser/msnbc-nbc-news-spinco-talent/",
    "timestamp": "2025-04-08T12:17:31Z"
  },
  {
    "title": "What will the Fed do, cut key rates? All eyes on Jerome Powell as Wall Street expects him to rescue the economy from Trump's tariffs",
    "description": "Amidst growing recession fears fueled by Trump's tariffs, Wall Street anticipates Federal Reserve intervention. JPMorgan has significantly lowered its GDP forecast, while investors are pricing in multiple rate cuts this year. However, Fed Chairman Jerome Powe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-will-the-fed-do-cut-key-rates-all-eyes-on-jerome-powell-as-wall-street-expects-him-to-rescue-the-economy-from-trumps-tariffs/articleshow/120095492.cms",
    "timestamp": "2025-04-08T12:15:07Z"
  },
  {
    "title": "DOGE Spying on Federal Workers for Anti-Trump, Musk Messages: Report",
    "description": "The monitoring is reportedly happening at the Environmental Protection Agency (EPA).",
    "link": "https://www.newsweek.com/doge-spying-ai-trump-musk-epa-2056805",
    "timestamp": "2025-04-08T12:15:04Z"
  },
  {
    "title": "\"What About the Capitalists?\": Autoworkers in U.S., Mexico Call for Solidarity, Not Divisive Tariffs",
    "description": "As workers brace for uncertainty and fallout from Trump’s tariffs, we hear from two autoworkers, one in Mexico and one in the United States. Israel Cervantes, founder of the National Independent Union for Workers in the Automotive Industry in Mexico, calls fo…",
    "link": "https://www.democracynow.org/2025/4/8/uaw_tariffs_autoworkers_union",
    "timestamp": "2025-04-08T12:15:00Z"
  },
  {
    "title": "Dutton's father suffered medical episode hours before first leaders debate",
    "description": "Peter Dutton's father suffered a medical episode just hours before the Opposition Leader faced off against Anthony Albanese in the first leaders' debate of the election campaign.",
    "link": "https://www.abc.net.au/news/2025-04-08/duttons-father-suffered-medical-episode-election-2025/105153648",
    "timestamp": "2025-04-08T12:14:38Z"
  },
  {
    "title": "Web3 active developers drop nearly 40% in one year",
    "description": "Weekly active developers in the crypto space dropped by almost 40% in one year as “narrative-led” developments took over the industry. Crypto data and analytics platform Artemis Terminal shows that on March 17, 2024, the number of active developers tagged on …",
    "link": "https://cointelegraph.com/news/web3-developer-activity-drop-nearly-40-percent-one-year",
    "timestamp": "2025-04-08T12:13:54Z"
  },
  {
    "title": "Iran’s foreign minister says he will have indirect talks with US envoy over Tehran’s nuclear program",
    "description": "The U.S. is seeking to halt Tehran’s advancing nuclear program.",
    "link": "https://www.bostonherald.com/2025/04/08/iran-us-talks-nuclear-program/",
    "timestamp": "2025-04-08T12:12:48Z"
  },
  {
    "title": "Posthaste: Americans are scrambling to stock up at Costco, Best Buy before tariffs jack up prices",
    "description": "Americans are rushing to stock up on everything from soy sauce to Lululemon Athletica Inc yoga gear before the tariffs imposed by President Donald Trump start to jack up prices on the shelves, according to media reports.\nThe day after Trump’s so-called Libera…",
    "link": "https://biztoc.com/x/746fab00f0161297",
    "timestamp": "2025-04-08T12:12:45Z"
  },
  {
    "title": "Penguins, vaccines: Can negotiations save Trump’s oddest tariff targets?",
    "description": "Barely inhabited islands, countries the US enjoys a trade surplus with, and a tariff formula that isn't about tariffs.",
    "link": "https://www.aljazeera.com/news/2025/4/8/penguins-vaccines-can-negotiations-save-trumps-oddest-tariff-targets",
    "timestamp": "2025-04-08T12:10:43Z"
  },
  {
    "title": "How Progressives Can Transform the Dems to Save Our Democracy and Renew Prosperity",
    "description": "There are two central facts about the Democratic Party that everyone must understand if our democratic republic is going to survive President Donald Trump’s authoritarian counterrevolution:\n<ol>\n<li>The Democratic Party is the only institution in our society …",
    "link": "https://www.commondreams.org/opinion/progressives-save-dems",
    "timestamp": "2025-04-08T12:10:03Z"
  },
  {
    "title": "EU to issue Apple's Digital Markets Act antitrust ruling within weeks",
    "description": "The European Union may finally decide whether Apple's App Store has breached the continent's Digital Markets Act rules, with the antitrust chief confirming a ruling could arrive within a few weeks.EU Flags with the App Store logo in the middleApple's App Stor…",
    "link": "https://appleinsider.com/articles/25/04/08/eu-to-issue-apples-digital-markets-act-antitrust-ruling-within-weeks",
    "timestamp": "2025-04-08T12:09:34Z"
  },
  {
    "title": "Supreme Court allows Trump to apply the Enemy Alien Enemy Act for immediate deportations",
    "description": "Trump praised the decision in a post on Truth Social, writing in capital letters that it was \"a great day for justice in America\"\nThe post Supreme Court allows Trump to apply the Enemy Alien Enemy Act for immediate deportations appeared first on ProtoThema En…",
    "link": "https://en.protothema.gr/2025/04/08/supreme-court-allows-trump-to-apply-the-enemy-alien-enemy-act-for-immediate-deportations/",
    "timestamp": "2025-04-08T12:09:27Z"
  },
  {
    "title": "Crypto firm Ripple to buy primer broker Hidden Road for $1.25 billion",
    "description": "Crypto startup Ripple said Tuesday that it's agreed to buy prime brokerage firm Hidden Road for $1.25 billion in the company's biggest acquisition to date.",
    "link": "https://www.cnbc.com/2025/04/08/crypto-firm-ripple-to-buy-primer-broker-hidden-road-for-1point25-billion.html",
    "timestamp": "2025-04-08T12:08:56Z"
  },
  {
    "title": "Trump fires U.S. attorney prosecuting former Fatburger CEO Andrew Wiederhorn",
    "description": "The U.S. Attorney’s Office in Los Angeles said the case against the former Fatburger CEO will proceed.",
    "link": "https://www.oregonlive.com/business/2025/04/trump-fires-us-attorney-prosecuting-onetime-portland-financier-andrew-wiederhorn.html",
    "timestamp": "2025-04-08T12:08:44Z"
  },
  {
    "title": "Forbes Daily: Markets’ Reprieve Proves To Be A Mirage Amid Tariff Saga",
    "description": "Today’s Forbes Daily newsletter covers market whiplash, Bitcoin struggles, potential new China tariffs plus medical equipment impacts, SCOTUS rules on migrants and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/08/forbes-daily-markets-reprieve-proves-to-be-a-mirage-amid-tariff-saga/",
    "timestamp": "2025-04-08T12:08:00Z"
  },
  {
    "title": "Crypto firm Ripple to buy prime broker Hidden Road for $1.25 billion",
    "description": "Ripple said on Tuesday it will buy multi-asset prime broker Hidden Road in a $1.25 billion deal, making it one of the largest acquisitions by the crypto company.This is the second billion-dollar-plus deal involving a crypto company this year, as digital asset…",
    "link": "https://www.channelnewsasia.com/business/crypto-firm-ripple-buy-prime-broker-hidden-road-125-billion-5052031",
    "timestamp": "2025-04-08T12:07:39Z"
  },
  {
    "title": "‘Fight to the end’: Are the US and China rushing into a trade war?",
    "description": "China seems prepared for a showdown even as other countries scramble to re-negotiate new tariffs with Washington.",
    "link": "https://www.aljazeera.com/news/2025/4/8/fight-to-the-end-are-the-us-and-china-rushing-into-a-trade-war",
    "timestamp": "2025-04-08T12:07:28Z"
  },
  {
    "title": "India and Canada Eye Resetting Relations",
    "description": "A rapprochement will not be easy or swift. Canadian public support for an FTA with India is low.",
    "link": "https://thediplomat.com/2025/04/india-and-canada-eye-resetting-relations/",
    "timestamp": "2025-04-08T12:06:00Z"
  },
  {
    "title": "Bessent Says Japan, South Korea, Taiwan May Back Alaska Energy Deal",
    "description": "Treasury Secretary Scott Bessent on Tuesday flagged a potential energy investment deal in Alaska involving key Asian economic partners, in the broader context of trade talks in the wake of President Donald Trump’s steep reciprocal tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/bessent-says-japan-south-korea-taiwan-may-back-alaska-energy-deal",
    "timestamp": "2025-04-08T12:05:52Z"
  },
  {
    "title": "Buffett's Bet On Cash Pays Off As Tariffs Wipe £400 Billion From Other Billionaires' Wealth",
    "description": "Warren Buffett's £240B ($325B) cash hoard shines as Trump's tariffs tank markets, costing the world's richest £400B ($510B) in days. Is the Oracle ready to strike?",
    "link": "https://www.ibtimes.com/buffetts-bet-cash-pays-off-tariffs-wipe-400-billion-other-billionaires-wealth-3769211",
    "timestamp": "2025-04-08T12:03:49Z"
  },
  {
    "title": "Medicare And Medicaid Officials Finalize Rule To Clarify That Medical Marijuana Isn't Covered By Federal Health Programs",
    "description": "The federal Centers for Medicare & Medicaid Services (CMS) has finalized a rule to clarify that marijuana products are not eligible for coverage under certain health plans for chronically ill patients because “they are illegal substances under Federal law.” I…",
    "link": "https://www.marijuanamoment.net/medicare-and-medicaid-officials-finalize-rule-to-clarify-that-medical-marijuana-isnt-covered-by-federal-health-programs/",
    "timestamp": "2025-04-08T12:03:30Z"
  },
  {
    "title": "Nithin Kamath sees 'crazy' retail investor moves even during disastrous market crashes",
    "description": "Retail investors have consistently supported Indian equities post-pandemic, buying during major downturns including Covid, elections, and tariff-induced falls. Their steady participation, alongside domestic institutions, has helped cushion foreign outflows am…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-sees-crazy-retail-investor-moves-even-during-disastrous-market-crashes/articleshow/120096163.cms",
    "timestamp": "2025-04-08T12:02:38Z"
  },
  {
    "title": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid",
    "description": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid\nPresident Donald Trump is ordering a new review of Nippon Steel’s proposed bid to buy U.S. Steel for nearly $15 billion\nShares of U.S. Steel are rising ahead of the bell afte…",
    "link": "https://biztoc.com/x/ca551f0013900d67",
    "timestamp": "2025-04-08T12:01:27Z"
  },
  {
    "title": "What Does 'Panican' Mean? Donald Trump's New Invented Word",
    "description": "In a recent social media post, President Donald Trump appeared to coin a brand-new term — \"panican\" — leaving many scratching their heads and wondering what exactly he meant.\nTrump coined the term in a post on Truth Social on Monday, in which he pushed back o…",
    "link": "https://biztoc.com/x/0d2bdffe777791dd",
    "timestamp": "2025-04-08T12:01:18Z"
  },
  {
    "title": "New 6-figure ad touts Trump policies that have key industry 'booming': 'You voted for it'",
    "description": "A conservative energy group has launched a new ad touting President Donald Trump's energy policies as part of a seven-figure ad campaign highlighting his agenda.",
    "link": "https://www.foxnews.com/politics/new-6-figure-ad-touts-trump-policies-that-have-key-industry-booming-you-voted-for-it",
    "timestamp": "2025-04-08T12:00:57Z"
  },
  {
    "title": "Boasberg contempt showdown looms after Supreme Court hands Trump immigration win",
    "description": "President Donald Trump praised the Supreme Court’s ruling, but a contempt hearing Tuesday could upend the win as Judge James Boasberg presses officials on secretive deportations.",
    "link": "https://www.foxnews.com/politics/donald-trump-deportation-contempt-threat-judge-boasberg",
    "timestamp": "2025-04-08T12:00:45Z"
  },
  {
    "title": "John Rich Says He Had to Explain to Trump in 2022 Why His Supporters Were Booing Him Every Time He Mentioned the COVID Jabs",
    "description": "Country music star John Rich shared on Monday a stunning conversation he had with President Donald Trump in 2022 that convinced the then-former president to stop taking credit for the COVID shots. During an interview on the “Try That in a Small Town Podcast, …",
    "link": "https://freerepublic.com/focus/f-chat/4309633/posts",
    "timestamp": "2025-04-08T12:00:33Z"
  },
  {
    "title": "Bitcoin may spike with China yuan devaluation amid trade conflict with US",
    "description": "Bitcoin could emerge as a major winner from the intensifying trade conflict between the United States and China. Arthur Hayes, co-founder of BitMEX, believes aggressive monetary policy responses, particularly currency devaluations, could trigger increased Bit…",
    "link": "https://cryptoslate.com/bitcoin-may-spike-with-china-yuan-devaluation-amid-trade-conflict-with-us/",
    "timestamp": "2025-04-08T12:00:27Z"
  },
  {
    "title": "Posthaste: Americans are scrambling to stock up at Costco, Best Buy before tariffs jack up prices",
    "description": "Americans are stocking up on everything from soy sauce to Lululemon clothing before Trump's tariffs start to jack up prices. Read more",
    "link": "https://financialpost.com/news/americans-stock-up-before-tariffs-hike-prices",
    "timestamp": "2025-04-08T12:00:16Z"
  },
  {
    "title": "'Enough is enough': House Republican touts GOP effort to pass bill cracking down on 'rogue' judges",
    "description": "Fox News Digital spoke to GOP Rep. Abe Hamadeh about Republican efforts to push back against \"rogue\" judges getting in the way of President Donald Trump's agenda.",
    "link": "https://www.foxnews.com/politics/enough-is-enough-house-republican-touts-gop-effort-pass-bill-cracking-down-rogue-judges",
    "timestamp": "2025-04-08T12:00:15Z"
  },
  {
    "title": "Musk wants Trump to cancel tariffs – WaPo",
    "description": "The tech mogul and government efficiency czar has reportedly appealed directly to the US president urging him to reconsider the levies Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615386-musk-trump-tariffs-criticism/",
    "timestamp": "2025-04-08T12:00:11Z"
  },
  {
    "title": "We Have a Moral Imperative To Reclaim America From the Extremists in Power | Opinion",
    "description": "New research shows how President Donald Trump and his allies are dividing Americans to exploit and impoverish them. The recent \"Hands Off\" rallies show that Americans realize it.",
    "link": "https://www.newsweek.com/we-have-moral-imperative-reclaim-america-extremists-power-opinion-2056460",
    "timestamp": "2025-04-08T12:00:01Z"
  },
  {
    "title": "How Bureaucrats Operating Outside the System Can Target Trump-Appointed Investigators",
    "description": "A panel of inspectors general has been “wielding power” outside supervision of the president or Congress in targeting officials appointed during the first Trump administration... Read More\nThe post How Bureaucrats Operating Outside the System Can Target Trump…",
    "link": "https://www.dailysignal.com/2025/04/08/how-bureaucrats-operating-outside-the-system-can-target-trump-appointed-investigators/",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "William Wolfe Says 'Christians Want To See Mass Deportations'",
    "description": "During a recent meeting with the White House Faith Office, William Wolfe told faith adviser Paula White that \"Christians want to see mass deportations.\"",
    "link": "https://www.peoplefor.org/rightwingwatch/william-wolfe-says-christians-want-see-mass-deportations",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "The Gay Beam Machine",
    "description": "<ul>\n<li>SCOTUS Gives Trump A Green Light</li>\n<li>A Total PsyOp</li>\n<li>Building A Christian Nationalist Utopia</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/gay-beam-machine",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "Day 1140 of WW3: The Russia-Ukraine War can be called a Tech War. Case in point: \"Ukraine Is Sending Drones to Russia That, When Captured, Infect Military Systems With Malware.\" Surely this will end well. It's your Tuesday Ukraine war discussion [News]",
    "description": "Day 1140 of WW3: The Russia-Ukraine War can be called a Tech War. Case in point: \"Ukraine Is Sending Drones to Russia That, When Captured, Infect Military Systems With Malware.\" Surely this will end well. It's your Tuesday Ukraine war discussion",
    "link": "https://www.fark.com/comments/13626446/Day-1140-of-WW3-The-Russia-Ukraine-War-can-be-called-a-Tech-War-Case-in-point-Ukraine-Is-Sending-Drones-to-Russia-That-When-Captured-Infect-Military-Systems-With-Malware-Surely-this-will-end-well-Its-your-Tuesday-Ukraine-war-discussion",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "Trump Wants to Extend His 2017 Tax Plan: Here's Who Might and Might Not Benefit",
    "description": "Republicans in Congress have started to move forward on the president's tax demands, which have been met with fierce pushback from Democrats.",
    "link": "https://www.cnet.com/personal-finance/taxes/trump-wants-to-extend-his-2017-tax-plan-heres-who-might-and-might-not-benefit/",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "Reflections on the Counter-Revolution in America",
    "description": "Trump is racing to dismantle decades of leftist policies, but success hinges on speed, discipline, and the Supreme Court—while facing fierce resistance from entrenched institutions. When Donald Trump entered office, he faced a number of choices that had confr…",
    "link": "https://www.activistpost.com/reflections-on-the-counter-revolution-in-america/",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "How safe is B.C.'s safe federal Green Party seat?",
    "description": "The Green Party of Canada’s flagship federal seat, occupied by an award-winning B.C. parliamentarian, could be in danger of being trumped by the tariff and sovereignty issue in the current federal election.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/federal-green-party-saanich-gulf-islands-1.7504183",
    "timestamp": "2025-04-08T12:00:00Z"
  },
  {
    "title": "Kanye West Reveals Why He Believes He Has Never Been Offered the Super Bowl Halftime Show",
    "description": "Since Kendrick Lamar’s Super Bowl Halftime performance, Kanye West has been voicing his upset about being passed over. In a recent tweet, he shared why he believes he has not been offered the show. “I never was allowed to do the Super Bowl because of 3 moment…",
    "link": "https://mediatakeout.com/kanye-west-reveals-why-he-believes-he-has-never-been-offered-the-super-bowl-halftime-show/",
    "timestamp": "2025-04-08T11:58:55Z"
  },
  {
    "title": "Trump’s DHS revokes legal status for migrants who entered the US on Biden-era CBP One app",
    "description": "It was unclear how many beneficiaries would be affected.",
    "link": "https://www.bostonherald.com/2025/04/08/trump-legal-status-cbp-app/",
    "timestamp": "2025-04-08T11:57:48Z"
  },
  {
    "title": "Dutton, Albanese dub each other liars in first election debate",
    "description": "Polite in tone, there was no shortage of accusations of lying as Prime Minister Anthony Albanese and Opposition Leader Peter Dutton met for the first of the federal election leaders' debates.",
    "link": "https://www.abc.net.au/news/2025-04-08/federal-election-albanese-dutton-leaders-debate-sky-news/105137054",
    "timestamp": "2025-04-08T11:55:36Z"
  },
  {
    "title": "‘We’re in a sticky situation’: EU admits relations with US ‘getting worse’",
    "description": "Donald Trump rejected the EU’s \"zero-for-zero\" proposal to remove tariffs on industrial goods yesterday.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/were-in-a-sticky-situation-eu-admits-relations-with-us-getting-worse/",
    "timestamp": "2025-04-08T11:55:16Z"
  },
  {
    "title": "What Does 'Panican' Mean? Donald Trump's New Invented Word",
    "description": "Trump's new phrase came in response to criticism he has received over his new \"Liberation Day\" tariffs, announced last week.",
    "link": "https://www.newsweek.com/donald-trump-panican-meaning-tariffs-2056674",
    "timestamp": "2025-04-08T11:54:55Z"
  },
  {
    "title": "Supreme Court allows Trump to use wartime law for deportations",
    "description": "The Supreme Court has ruled 5-4 in President Donald Trump’s favor to allow him to enforce the Alien Enemies Act that will let immigration officials to use sweeping wartime law to deport alleged gang members as long as those individuals are given due process.",
    "link": "https://www.today.com/video/supreme-court-allows-trump-to-use-wartime-law-for-deportations-236798021862",
    "timestamp": "2025-04-08T11:54:29Z"
  },
  {
    "title": "Key Brazil Port Bustles as China Poised to Shift Away From US",
    "description": "Donald Trump’s trade war may have crushed global commodity prices, but it’s good news for one of Brazil’s largest ports, which is seeing an uptick in export volumes.",
    "link": "https://gcaptain.com/key-brazil-port-bustles-as-china-poised-to-shift-away-from-us/",
    "timestamp": "2025-04-08T11:54:22Z"
  },
  {
    "title": "Trump tariff negotiations are ‘all about’ China deal — Raoul Pal",
    "description": "Global trade tensions triggered by US President Donald Trump’s sweeping tariff measures may come to an end with a potential deal with China as investors remain concerned about escalation from both sides.Trump’s April 2 announcement of reciprocal import tariff…",
    "link": "https://cointelegraph.com/news/trump-tariff-negotiation-all-about-china-deal-analyst",
    "timestamp": "2025-04-08T11:54:21Z"
  },
  {
    "title": "NATO chief says China military expansion 'staggering'",
    "description": "TOKYO: China's expansion of its armed forces is \"staggering\", NATO's chief said on a visit to Japan beginning Tuesday (Apr 8) aimed at \"projecting\" the alliance's power in the Asia-Pacific region.",
    "link": "https://www.channelnewsasia.com/east-asia/nato-chief-china-military-expansion-staggering-5051966",
    "timestamp": "2025-04-08T11:53:38Z"
  },
  {
    "title": "Harvard Advises Foreign Students to Reconsider Travel, Warns of Consequences from Anti-Israel Protests",
    "description": "Harvard is reportedly advising foreign students to reconsider travel outside of the United States, as well as warning them of the consequences that may stem from pro-Palestinian and anti-Israel protests.\nThe post Harvard Advises Foreign Students to Reconsider…",
    "link": "https://www.breitbart.com/tech/2025/04/08/harvard-advises-foreign-students-to-reconsider-travel-warns-of-consequences-from-anti-israel-protests/",
    "timestamp": "2025-04-08T11:53:22Z"
  },
  {
    "title": "Trump says high tariffs may have prevented the Great Depression. History says different",
    "description": "In the early days of the Great Depression, Rep. Willis Hawley, a Republican from Oregon, and Utah Republican Sen. Reed Smoot thought they had landed on a way to protect American farmers and manufacturers from foreign competition: tariffs.",
    "link": "https://www.local10.com/news/politics/2025/04/08/trump-says-high-tariffs-may-have-prevented-the-great-depression-history-says-different/",
    "timestamp": "2025-04-08T11:52:42Z"
  },
  {
    "title": "Who are the tariff 'PANICANS' derided as 'weak and stupid' by Trump?",
    "description": "The US president has lashed out at those criticising his tariffs policy - who include some of his top backers.",
    "link": "https://www.bbc.com/news/articles/c2ewrvkp72lo",
    "timestamp": "2025-04-08T11:51:46Z"
  },
  {
    "title": "Limited Options Push China Into Trade ‘War of Attrition’ With Trump",
    "description": "Beijing, feeling boxed into a corner by the United States' intensifying tariff assault on China and any country that buys or assembles Chinese goods, is bracing for an economic war of attrition.",
    "link": "https://gcaptain.com/limited-options-push-china-into-trade-war-of-attrition-with-trump/",
    "timestamp": "2025-04-08T11:51:16Z"
  },
  {
    "title": "Is this the end of globalisation?",
    "description": "American-led post-war order is 'finally starting to crumble' but that could bring about 'a more inclusive world'",
    "link": "https://theweek.com/business/economy/is-this-the-end-of-globalisation",
    "timestamp": "2025-04-08T11:51:09Z"
  },
  {
    "title": "Trump Was Asked To Call Off Tariffs By Perhaps His Most-Trusted Adviser: Report",
    "description": "The private “attempted intervention” didn’t seem to work as the president’s trade war rages on.",
    "link": "https://www.huffpost.com/entry/elon-musk-intervention-donald-trump-tariffs_n_67f4e744e4b042c1f7709fb9",
    "timestamp": "2025-04-08T11:50:56Z"
  },
  {
    "title": "$2T fake tariff news pump shows ‘market is ready to ape’",
    "description": "Recent fake news that US President Donald Trump was considering a 90-day pause in tariffs shows the potential for a strong market rebound should a real one take place, according to observers.\nA fake news post on X on April 7 from the verified “Walter Bloomber…",
    "link": "https://biztoc.com/x/13c5a08dce205e1c",
    "timestamp": "2025-04-08T11:50:17Z"
  },
  {
    "title": "Why Israel can’t escape impact of tariffs",
    "description": "While stock indices in the US and Europe fell by about 10% in two days, the Tel Aviv 35 Index fell by just under 4% yesterday and by 0.62% on Thursday.",
    "link": "https://www.jpost.com/business-and-innovation/banking-and-finance/article-849343",
    "timestamp": "2025-04-08T11:50:16Z"
  },
  {
    "title": "California Judge Upholds Huntington Beach Voter ID Law",
    "description": "A judge in Orange County, California, has rejected an effort by the Democrat-run state to block the City of Huntington Beach from enforcing a voter ID law that local voters passed by referendum last year, at least for municipal elections.\nThe post California …",
    "link": "https://www.breitbart.com/politics/2025/04/08/california-judge-upholds-huntington-beach-voter-id-law/",
    "timestamp": "2025-04-08T11:50:06Z"
  },
  {
    "title": "Party leaders campaign in Western Canada as election hits midpoint",
    "description": "The top three federal party leaders are in Western Canada Tuesday.",
    "link": "https://www.nationalobserver.com/2025/04/08/news/party-leaders-campaign-western-canada-election-hits-midpoint",
    "timestamp": "2025-04-08T11:49:57Z"
  },
  {
    "title": "JP Morgan, Goldman Sachs warn of recession, interest rate changes",
    "description": "Donald Trump began suggesting tariffs on Canada, Mexico, and China shortly after the November election. However, the Trump administration surprised economists and industry analysts when it unveiled blanket 10% tariffs on virtually every U.S. trading partner t…",
    "link": "https://biztoc.com/x/6ffb23475fd7c329",
    "timestamp": "2025-04-08T11:49:51Z"
  },
  {
    "title": "Portugal Reacts to Donald Trump's DEI Ultimatum",
    "description": "Portuguese companies with contracts with the U.S. government responded after receiving letters demanding they drop DEI policies.",
    "link": "https://www.newsweek.com/portugal-reacts-trump-dei-letters-2056790",
    "timestamp": "2025-04-08T11:49:49Z"
  },
  {
    "title": "10-year bond auction will provide key test to Trump's tariff strategy",
    "description": "A key Treasury auction this week could test one of the central planks of President Donald Trump's tariff strategy as markets reel amid the largest swings in Treasury yields in more than two decades. President Trump has insisted that his tariff plans, which wi…",
    "link": "https://freerepublic.com/focus/f-news/4309629/posts",
    "timestamp": "2025-04-08T11:46:41Z"
  },
  {
    "title": "Iranian minister confirms talks with the US",
    "description": "Donald Trump had announced that the US is engaging in talks with Tehran during a meeting with Israeli Prime Minister Benjamin Netanyahu",
    "link": "https://www.jewishnews.co.uk/iranian-minister-confirms-talks-with-the-us/",
    "timestamp": "2025-04-08T11:46:16Z"
  },
  {
    "title": "China vows to 'fight to the end' as Trump tariff war rages",
    "description": "China refused to bow to what it called \"blackmail\" from the United States as a global trade war ignited by President Donald Trump's sweeping tariffs showed little sign of abating. Chinese foreign ministry spokesperson Lin Jian said on Tuesday (April 8) that C…",
    "link": "https://www.bangkokpost.com/video/world/2998584",
    "timestamp": "2025-04-08T11:46:00Z"
  },
  {
    "title": "South Korea says its military fired warning shots after North Korean soldiers crossed the border",
    "description": "South Korea’s military fired warning shots after North Korean soldiers crossed the rivals’ tense border on Tuesday, South Korean officials said.",
    "link": "https://www.nbcnews.com/news/world/south-korea-says-military-fired-warning-shots-north-korean-soldiers-rcna200159",
    "timestamp": "2025-04-08T11:45:44Z"
  },
  {
    "title": "Billionaire Stanley Druckenmiller Says He Does Not Support Excessive Tariffs As Trump Trade War Rocks Markets",
    "description": "Billionaire investor Stanley Druckenmiller is reiterating his opposition to excessive tariffs in the wake of President Donald Trump imposing reciprocal tariff rates as high as 54%. Druckenmiller says in a post on the social media platform X that he does “not …",
    "link": "https://dailyhodl.com/2025/04/08/billionaire-stanley-druckenmiller-says-he-does-not-support-excessive-tariffs-as-trump-trade-war-rocks-markets/",
    "timestamp": "2025-04-08T11:45:43Z"
  },
  {
    "title": "No major gaffes and no knockout punch: the first leaders’ debate was a pedestrian affair",
    "description": "With all the usual policy issues canvassed, neither leader made a major mistake, but neither did they land any significant blows on their opponent.",
    "link": "https://theconversation.com/no-major-gaffes-and-no-knockout-punch-the-first-leaders-debate-was-a-pedestrian-affair-253711",
    "timestamp": "2025-04-08T11:45:35Z"
  },
  {
    "title": "UK banking system ‘resilient’ amid Trump’s tariffs, assures Reeves",
    "description": "Reeves told MPs that a trade war “is in nobody’s interest” and the government will take the “right decisions that are in our national interest.\"",
    "link": "https://www.politico.eu/article/uk-banking-system-resilient-amid-trumps-tariffs-assures-reeves/",
    "timestamp": "2025-04-08T11:45:10Z"
  },
  {
    "title": "Trump Offers An Uneasy World No Reassurance In Word Salad Oval Office Remarks (S.V. Date/HuffPost)",
    "description": "S.V. Date / HuffPost:\nTrump Offers An Uneasy World No Reassurance In Word Salad Oval Office Remarks  —  WASHINGTON ― With a world economy on edge since he declared a trade war with the rest of the planet last week, President Donald Trump offered no reassuring…",
    "link": "https://www.memeorandum.com/250408/p17",
    "timestamp": "2025-04-08T11:45:04Z"
  },
  {
    "title": "Attack of the Quack-Industrial Complex (Paul Krugman)",
    "description": "Paul Krugman:\nAttack of the Quack-Industrial Complex  —  By now it's obvious to anyone willing to see — which many people still aren't — that Donald Trump is, in practice, waging war against American greatness.  And the attack is taking place on multiple fron…",
    "link": "https://www.memeorandum.com/250408/p19",
    "timestamp": "2025-04-08T11:45:04Z"
  },
  {
    "title": "EU president to meet pharma leaders as tariff threat looms",
    "description": "US President Donald Trump told reporters last week that pharma tariffs are coming “sometime in the near future”.",
    "link": "https://www.medicaldevice-network.com/news/eu-president-to-meet-pharma-leaders-as-tariff-threat-looms/",
    "timestamp": "2025-04-08T11:42:30Z"
  },
  {
    "title": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid",
    "description": "President Donald Trump is ordering a new review of Nippon Steel’s proposed bid to buy U.S. Steel for nearly $15 billion",
    "link": "https://abcnews.go.com/Business/wireStory/us-steel-rises-2nd-day-after-trump-orders-120588206",
    "timestamp": "2025-04-08T11:42:00Z"
  },
  {
    "title": "Pre-markets Dow futures up up up +800",
    "description": "Dow Futures 38,984.00 Fair Value 38,169.47 Change+ 819.00 2.15% Implied Open + 814.53",
    "link": "https://freerepublic.com/focus/f-news/4309628/posts",
    "timestamp": "2025-04-08T11:41:56Z"
  },
  {
    "title": "US Steel rises for a 2nd day after Trump orders new security review Nippon Steel bid",
    "description": "Shares of U.S. Steel are rising ahead of the bell after President Donald Trump ordered a new national security review of Nippon Steel’s proposed bid to buy U.S. Steel for nearly $15 billion. President Joe Biden blocked the deal just before leaving office and …",
    "link": "https://financialpost.com/pmn/us-steel-rises-for-a-2nd-day-after-trump-orders-new-security-review-nippon-steel-bid",
    "timestamp": "2025-04-08T11:41:08Z"
  },
  {
    "title": "Saylor’s Strategy Issues Shock Bitcoin ‘Sell’ Warning Amid Devastating $10,000 Price Crash Prediction",
    "description": "Michael Saylor’s software company-turned-bitcoin buyer Strategy has warned it could be forced to sell some of its bitcoin to meet its financial obligations...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/04/08/saylors-strategy-issues-shock-bitcoin-sell-warning-amid-10000-price-crash-prediction/",
    "timestamp": "2025-04-08T11:40:16Z"
  },
  {
    "title": "The Trump Administration Keeps Tariff Promises, While the Stock Market Rout Continues. Here's My Advice to Retirees During Volatile Markets",
    "description": "President Donald Trump had been touting the announcement of tariffs, which he said will restore America's manufacturing base and improve the country's economic security and standing over time. However, the stock market was still caught flat-footed by just how…",
    "link": "https://biztoc.com/x/5bdac23813567bb6",
    "timestamp": "2025-04-08T11:39:59Z"
  },
  {
    "title": "Trump 'not looking' to pause tariffs despite global economic fears",
    "description": "With President Donald Trump’s next round of escalatory tariffs set to go into effect, he insists that despite rattled markets and recession fears, he’s not considering hitting the pause button. After the markets on Monday suffered their worst day since the st…",
    "link": "https://biztoc.com/x/9becbfff6fa8d48b",
    "timestamp": "2025-04-08T11:39:22Z"
  },
  {
    "title": "'Major brain drain': Researchers eye exit from Trump's America",
    "description": "In the halls of US universities and research labs, one question has become increasingly common as President Donald Trump tightens his grip on the field: whether to move abroad.\"Everybody is talking about it,\" JP Flores, a doctoral student in genetics at the U…",
    "link": "https://www.rawstory.com/major-brain-drain-researchers-eye-exit-from-trump-s-america/",
    "timestamp": "2025-04-08T11:39:05Z"
  },
  {
    "title": "Trump tariffs live updates: China and EU reassess trading relationship",
    "description": "President Donald Trump's tariffs force Europe to seek closer ties with China, while at home, GOP donors and business groups make their opposition public.",
    "link": "https://www.cnbc.com/2025/04/08/trump-tariffs-live-updates-stock-market-china.html",
    "timestamp": "2025-04-08T11:38:51Z"
  },
  {
    "title": "Billionaire GOP donor Ken Langone rips ‘bulls–t’ Trump tariffs: ‘I don’t understand the goddamn formula’",
    "description": "Billionaire Republican megadonor and Home Depot founder Ken Langone has ripped the Trump administration's sweeping tariffs as \"bulls--t\" -- claiming the president has been poorly-advised amid the raging trade war.",
    "link": "https://nypost.com/2025/04/08/us-news/billionaire-gop-donor-ken-langone-rips-bulls-t-trump-tariffs/",
    "timestamp": "2025-04-08T11:38:29Z"
  },
  {
    "title": "Where We’ll Be When the Fire Strikes",
    "description": "On U.S. President Donald Trump’s first day back in office, he pulled\r\n the U.S. out of the Paris climate accords again, halted\r\n leasing and permitting for offshore wind energy projects, and signed executive orders\r\n promoting fossil fuel development. The pre…",
    "link": "https://www.commondreams.org/opinion/climate-fire-strikes",
    "timestamp": "2025-04-08T11:38:03Z"
  },
  {
    "title": "Former Clinton advisor calls out the 'rudderless' Democratic Party for being 'out of touch' with America",
    "description": "Former Clinton advisor Doug Schoen says Americans see the Democratic Party as \"leaderless,\" with no message or strategy other than opposing President Donald Trump.",
    "link": "https://www.foxnews.com/media/former-clinton-advisor-calls-out-rudderless-democratic-party-being-out-touch-america",
    "timestamp": "2025-04-08T11:37:53Z"
  },
  {
    "title": "Cattle Rancher Explains How Trump's Tariffs Address Major Problems: 'It Will Be a Great Time for Our Industry'",
    "description": "It's been a long time coming for the U.S. beef industry. For years, other countries have sold beef to the U.S., but not the other way around.",
    "link": "https://www.westernjournal.com/cattle-rancher-explains-trumps-tariffs-address-major-problems-will-great-time-industry/",
    "timestamp": "2025-04-08T11:37:02Z"
  },
  {
    "title": "EU's von der Leyen urges China to ensure responsible tariff response",
    "description": "European Commission President Ursula von der Leyen has urged China to seek a negotiated resolution to trade disputes arising from US tariffs. During a call with Premier Li Qiang, she emphasized the shared responsibility of Europe and China in maintaining a fa…",
    "link": "https://economictimes.indiatimes.com/news/international/business/eus-von-der-leyen-urges-china-to-ensure-responsible-tariff-response/articleshow/120095501.cms",
    "timestamp": "2025-04-08T11:36:52Z"
  },
  {
    "title": "Trump Orders Iran to Give Up Its “Perfectly Legal” Defensive Weapons",
    "description": "The Trump administration is demanding that Iran give up its strategic missile program as part of any nuclear deal. But Iran’s ballistic missiles do not violate international law nor is there any global treaty under which they are banned. Article …\nThe post Tr…",
    "link": "https://www.globalresearch.ca/trump-orders-iran-give-up-defensive-weapons/5883845",
    "timestamp": "2025-04-08T11:36:46Z"
  },
  {
    "title": "Beijing calls Vance 'ignorant' over 'Chinese peasants' remark",
    "description": "The sharp rhetoric comes as Donald Trump's tariffs fuel trade tensions between the US and China.",
    "link": "https://www.bbc.com/news/articles/c20zd4k6d36o",
    "timestamp": "2025-04-08T11:35:54Z"
  },
  {
    "title": "Trump’s Yemen Bombings: Dangerous Step Towards War with Iran",
    "description": "So much is being written now on Trump’s blow to world stock markets (via tariffs), but there is yet another specter haunting Washington, the Middle East, and the world at large. The recent wave of U.S. airstrikes on Yemen, ordered …\nThe post Trump’s Yemen Bom…",
    "link": "https://www.globalresearch.ca/trump-yemen-bombings-war-iran/5883852",
    "timestamp": "2025-04-08T11:33:32Z"
  },
  {
    "title": "We were right: New books expose truth about Biden's failing health. I'm furious. | Opinion - NewsBreak",
    "description": "Two new books, 'Fight' and 'Uncharted,' show President Joe Biden was in serious decline and was surrounded by people who knew it but stayed silent.",
    "link": "https://www.newsbreak.com/share/3951176329630-we-were-right-new-books-expose-truth-about-biden-s-failing-health-i-m-furious-opinion?_f=app_share&amp;pd=0H1pICYj&amp;lang=en_US&amp;send_time=1744111907&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.13.2.5%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v9%2Cns_local_strategy_25q1_exp-v16%2Cns_foryou_recall_exp_25q2-v3%2Cns_push_exp_rt_bucketv12-v8&amp;s=i2",
    "timestamp": "2025-04-08T11:32:17Z"
  }
]