[
  {
    "title": "To ride out volatility, ASPS urges diversification",
    "description": "Amid rising volatility in the global market, Asia Plus Securities (ASPS) is advising investors to diversify their portfolios internationally this quarter, focusing on fundamentally strong global equities in domestic-oriented, defensive, and high-dividend sect…",
    "link": "https://www.bangkokpost.com/business/general/3009896/to-ride-out-volatility-asps-urges-diversification",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "Seattle’s Big Pride Events Are Underfunded This Year, Just Like Everywhere Else",
    "description": "Seattle PrideFest, which throws the event on Capitol Hill and another at the end of the parade in Seattle Center, lost $75,000, a third of its sponsorship funding. Today, it launched a GoFundMe to cover the loss. The organization that throws the parade, Seatt…",
    "link": "https://www.thestranger.com/news/2025/04/23/80027257/seattles-big-pride-events-are-underfunded-this-year-just-like-everywhere-else",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "How might China manage Trump's tariff war?",
    "description": "China has taken a tough stance against US President Donald Trump, matching the last two rounds of US tariffs with tariffs of its own. The US tariff on goods from China is now 145%, while China's is 125%. Why does China take such a position, and are there any …",
    "link": "https://www.bangkokpost.com/opinion/opinion/3009821/how-might-china-manage-trumps-tariff-war-",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "Trump says Zelenskyy is prolonging war in Ukraine by resisting calls to cede Crimea",
    "description": "Ukraine and some allies accused Russian President Vladimir Putin of dragging his feet as his army tries to capture more Ukrainian land.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_1b5f3571-3e00-51d2-bca8-1aba5fdfe6f1.html",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "Trump says Zelenskyy is prolonging war in Ukraine by resisting calls to cede Crimea",
    "description": "Ukraine and some allies accused Russian President Vladimir Putin of dragging his feet as his army tries to capture more Ukrainian land.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_5a7089fd-02ba-530d-871f-e9d92e5e1862.html",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "US tariff shock upsides for Asean",
    "description": "'Let the dust from the White House settle first,\" said former Korean Foreign Minister Song Min-soon in an interview with Korean media. A Southeast Asian figure I met during an Asean Regional Forum (ARF) Experts and Eminent Persons (EEPs) meeting held recently…",
    "link": "https://www.bangkokpost.com/opinion/opinion/3010066/us-tariff-shock-upsides-for-asean",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "Sources: Olafimihan Oshin, The Hill reporter whose dismissal was reportedly linked to Truth Social dropping Nexstar from a lawsuit, had prior performance issues (Matthew Keys/The Desk)",
    "description": "Matthew Keys / The Desk:\nSources: Olafimihan Oshin, The Hill reporter whose dismissal was reportedly linked to Truth Social dropping Nexstar from a lawsuit, had prior performance issues  —  A story published by Semafor strongly linked Olafimihan Oshin's dismi…",
    "link": "https://mediagazer.com/250423/p15",
    "timestamp": "2025-04-23T20:30:00Z"
  },
  {
    "title": "Sharon Osbourne Wants This Band's Visa Revoked After They Got Political At Coachella",
    "description": "The wife of Ozzy Osbourne said music should not be \"a stage for political discourse.\"",
    "link": "https://www.huffpost.com/entry/sharon-osbourne-kneecap-coachella-visa_n_68092ce6e4b0886942d2504f",
    "timestamp": "2025-04-23T20:28:54Z"
  },
  {
    "title": "Previewing the Canadian Election's Crypto Angle",
    "description": "Canada's leading Prime Minister candidates aren't campaigning on crypto policies, but both have discussed the issue in the past.",
    "link": "https://www.coindesk.com/policy/2025/04/23/previewing-the-canadian-elections-crypto-angle",
    "timestamp": "2025-04-23T20:25:43Z"
  },
  {
    "title": "Carney wants to meet Trump 'face to face'",
    "description": "Canadian Prime Minister Mark Carney said on Wednesday that he would prefer to have a meeting with United States President Donald Trump \"face to face.\"While campaigning in British Columbia, Carney unde...",
    "link": "https://biztoc.com/x/ae35b884c618210a",
    "timestamp": "2025-04-23T20:25:04Z"
  },
  {
    "title": "What's Going On With Ford Stock Wednesday?",
    "description": "Ford Motor (NYSE:F) shares traded higher Wednesday after President Donald Trump indicated tariffs against China may be lowered and trade tensions could de-escalate.\nWhat To Know: According to the Wall Street Journal, the Trump administration is considering lo…",
    "link": "https://biztoc.com/x/344e28d22b3e9595",
    "timestamp": "2025-04-23T20:24:57Z"
  },
  {
    "title": "US and China Have Opportunity for 'Big Deal' on Trade: Bessent",
    "description": "Treasury Secretary Scott Bessent says there is “an incredible opportunity” for the US and China to work on what he terms a “beautiful rebalancing” of a more domestic economy for China and more manufacturing for the US. He spoke Wednesday at an IIF event. Bess…",
    "link": "https://biztoc.com/x/20d0d7caf08f59a8",
    "timestamp": "2025-04-23T20:24:49Z"
  },
  {
    "title": "'WWE In The Hall Of The West Wing': Musk And Bessent Clash Loudly As Trump Nearby",
    "description": "Elon Musk and Treasury Secretary Scott Bessent had an argument last Thursday at the White House that turned into a shouting match in front of President Donald Trump. \nThe Details: According to an Axios report, Musk and Bessent were chest-to-chest while shouti…",
    "link": "https://biztoc.com/x/cf9b32727bbb1731",
    "timestamp": "2025-04-23T20:24:47Z"
  },
  {
    "title": "With Gold Stalling, Is It Bitcoin’s Turn? Traders Eye $95K as Key Breakout Level",
    "description": "Wednesday's crypto rally stalled as Bessent reiterated the difficulties in making a deal with China.",
    "link": "https://www.coindesk.com/markets/2025/04/23/with-gold-stalling-is-it-bitcoins-turn-traders-eye-95k-as-key-breakout-level",
    "timestamp": "2025-04-23T20:24:24Z"
  },
  {
    "title": "Marvel Star Blasts “Narcissist” Trump, Bets He’s Watched His Movie “100 F***ing Times”",
    "description": "WARNING: Spoilers for Captain America: Brave New World Marvel star Sebastian Stan had some harsh words for President Trump. Related: Cruise, Laugh, Assemble: Marvel and Pixar Are Back at Sea in 2026! There’s no doubt the Marvel machine has produced numerous s…",
    "link": "https://insidethemagic.net/?p=769370&preview=true&preview_id=769370",
    "timestamp": "2025-04-23T20:23:33Z"
  },
  {
    "title": "Will the 49ers fall into the same NFL Draft trap a third time?",
    "description": "The 49ers seem to believe that their highly paid D-line coach can fix anyone — but he can't, and it's cost the team before, writes SFGATE columnist Eric Ting.",
    "link": "https://www.sfgate.com/49ers/article/49ers-nfl-draft-trap-third-time-20290645.php",
    "timestamp": "2025-04-23T20:22:27Z"
  },
  {
    "title": "Half of Americans Think Kilmar Abrego Garcia Should Return to US: Poll",
    "description": "In a new poll, half of the respondents say the Trump Administration should help Abrego Garcia return to the United States.",
    "link": "https://www.newsweek.com/half-americans-think-kilmar-abrego-garcia-should-return-us-poll-2063270",
    "timestamp": "2025-04-23T20:21:22Z"
  },
  {
    "title": "Trump Is Acting as a Proxy for Putin",
    "description": "His proposal to end the war between Russia and Ukraine isn’t a peace plan—it’s a reward for aggression.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/trump-ukraine-russia-deal/682564/",
    "timestamp": "2025-04-23T20:21:00Z"
  },
  {
    "title": "Firefighters fear Trump cuts will have 'catastrophic' effects during wildfire season",
    "description": "The Trump Administration, with the help of the Elon Musk-led Department of Government Efficiency (DOGE), continues to target a wide range of federal government agencies for mass layoffs — from the Social Security Administration (SSA) to the U.S. Department of…",
    "link": "https://www.rawstory.com/wildfires-2671833875/",
    "timestamp": "2025-04-23T20:20:44Z"
  },
  {
    "title": "Sorry, Elon. Tesla Is Over, And So Are You. Cope Harder.",
    "description": "About that Tesla earnings call!",
    "link": "https://www.wonkette.com/p/sorry-elon-tesla-is-over-and-so-are",
    "timestamp": "2025-04-23T20:20:22Z"
  },
  {
    "title": "Bondi launches dubious ‘Task Force to Eradicate Anti-Christian Bias’ in U.S. government",
    "description": "Trump administration officials could be focused on “anti-religion bias” within the government, but they’re instead focused only on “anti-Christian bias.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/bondi-launches-dubious-task-force-eradicate-anti-christian-bias-us-gov-rcna202663",
    "timestamp": "2025-04-23T20:19:46Z"
  },
  {
    "title": "Trump’s Tariff Stance Softens, But Global Trade Faces Long-Term Uncertainty",
    "description": "This development marks a pivotal shift in the Trump administration’s trade strategy, which has sparked global economic concerns and market volatility.",
    "link": "https://www.forbes.com/sites/danirvine/2025/04/23/trumps-tariff-stance-softens-but-global-trade-faces-long-term-uncertainty/",
    "timestamp": "2025-04-23T20:19:42Z"
  },
  {
    "title": "'Deserted Trump': Analyst warns new polls are 'quite bad' for MAGA",
    "description": "President Donald Trump's key advantage with voters has eroded in new surveys, as the whole nation begins to fret about the economic path he has put the nation on, Aaron Blake wrote for The Washington Post in an analysis published on Wednesday.Trump's numbers …",
    "link": "https://www.rawstory.com/trump-polls-2671833680/",
    "timestamp": "2025-04-23T20:16:31Z"
  },
  {
    "title": "Pushing to Eviscerate Head Start and SNAP, Trump Wants to Give Parents Medals for Having More Kids",
    "description": "Political observers have warned that U.S. President Donald Trump has spent his first months in office \"flooding the zone\"—unleashing a torrent of executive actions and Republican proposals meant to overwhelm his opponents while furthering his right-wing agend…",
    "link": "https://www.commondreams.org/news/trump-birth-rate",
    "timestamp": "2025-04-23T20:15:13Z"
  },
  {
    "title": "Trump to host dinner for top 220 holders of his memecoin",
    "description": "US President Donald Trump will host a dinner next month with the top 220 holders of his cryptocurrency token, TRUMP meme coin, according to an announcement on the token's official website Wednesday.Th...",
    "link": "https://biztoc.com/x/fdf16a54359c11bb",
    "timestamp": "2025-04-23T20:14:06Z"
  },
  {
    "title": "The US has bombed 'hundreds' of Houthi targets. These satellite images capture some of the destruction.",
    "description": "US forces launched deadly strikes last week on the Ras Isa fuel port, a key Houthi-controlled facility on Yemen's western coast.",
    "link": "https://www.businessinsider.com/us-bombed-hundreds-of-houthi-targets-satellite-images-show-destruction-2025-4",
    "timestamp": "2025-04-23T20:13:15Z"
  },
  {
    "title": "Iran can't enrich uranium, could only import it for civilian program, Rubio says",
    "description": "(Reuters) -Iran will have to stop enriching uranium under any deal with the United States and could only import what is needed for a civilian nuclear program, U.S. Secretary of State Marco Rubio said ahead of talks between Tehran and Washington on Saturday. R…",
    "link": "https://www.thestar.com.my/news/world/2025/04/24/iran-can039t-enrich-uranium-could-only-import-it-for-civilian-program--rubio-says",
    "timestamp": "2025-04-23T20:12:00Z"
  },
  {
    "title": "Chris Hayes: Hegseth’s chaotic tenure at the Pentagon is even worse than I imagined",
    "description": "Amid new allegations, Chris Hayes breaks down Pete Hegseth's chaotic tenure at the Defense Department, which he says is even worse than he could have imagined.",
    "link": "https://www.msnbc.com/top-stories/latest/pete-hegseth-chaotic-pentagon-mismanagement-rcna202602",
    "timestamp": "2025-04-23T20:11:27Z"
  },
  {
    "title": "L.A. Sends Brush Clearance Notices to Palisades Property Owner -- After Building Burned Down",
    "description": "State and local authorities failed to clear the local brush ahead of the devastating Palisades Fire-- L.A. is still sending notices to owners of destroyed properties to clear their own.\nThe post L.A. Sends Brush Clearance Notices to Palisades Property Owner —…",
    "link": "https://www.breitbart.com/politics/2025/04/23/l-a-sends-brush-clearance-notices-to-palisades-property-owner-after-building-burned/",
    "timestamp": "2025-04-23T20:10:44Z"
  },
  {
    "title": "‘Strong And Clear Message’: European Bureaucrats Slap American Tech Giants With Massive Fines",
    "description": "The European Commission fined Meta and Apple combined roughly $800 million in total Wednesday.",
    "link": "https://dailycaller.com/2025/04/23/strong-and-clear-message-european-bureaucrats-slap-american-tech-giants-with-massive-fines/",
    "timestamp": "2025-04-23T20:09:35Z"
  },
  {
    "title": "How Tesla and other companies are dealing with tariff turmoil",
    "description": "Tariff and trade shifts make it difficult for companies and investors to make a reliable assessment of any impact to costs and sales.",
    "link": "https://www.pbs.org/newshour/economy/how-tesla-and-other-companies-are-dealing-with-tariff-turmoil",
    "timestamp": "2025-04-23T20:08:48Z"
  },
  {
    "title": "Bitcoin Edges Higher as Treasury’s Bessent Tempers China Trade Expectations",
    "description": "Investors responded positively to the president saying that tariffs on China “will come down substantially.”",
    "link": "https://decrypt.co/316026/bitcoin-edges-higher-treasurys-bessent-tempers-china-trade-expectations",
    "timestamp": "2025-04-23T20:07:10Z"
  },
  {
    "title": "When ‘equal’ does not mean ‘the same’: Liberals still do not understand their women problem",
    "description": "The Liberal Party’s idea of equality means treating everyone the same, rather than addressing structures loaded against women. It’s doing the party enormous damage.",
    "link": "https://theconversation.com/when-equal-does-not-mean-the-same-liberals-still-do-not-understand-their-women-problem-254567",
    "timestamp": "2025-04-23T20:06:53Z"
  },
  {
    "title": "Israeli Minister Says GOP Leaders Agree That Gaza “Aid Depots Should Be Bombed”",
    "description": "Experts have said that Israel’s withholding and targeting of humanitarian aid amount to genocidal acts.",
    "link": "https://truthout.org/articles/israeli-minister-says-gop-leaders-agree-that-gaza-aid-depots-should-be-bombed/",
    "timestamp": "2025-04-23T20:06:19Z"
  },
  {
    "title": "Iran can't enrich uranium, could only import it for civilian program, Rubio says",
    "description": "However, Iran has already made clear that its right to enrich uranium is not negotiable.  When asked about Rubio's comments, a senior Iranian official, close...",
    "link": "https://www.yahoo.com/news/iran-cant-enrich-uranium-could-200600168.html",
    "timestamp": "2025-04-23T20:06:00Z"
  },
  {
    "title": "'Be gone': Republicans target sexually violent illegal immigrants in new bill",
    "description": "The BE GONE Act, targeting sexually violent illegal immigrants, is intended to commemorate Sexual Assault Awareness month, according to its proponents.",
    "link": "https://www.foxnews.com/politics/be-gone-republicans-target-sexually-violent-illegal-immigrants-new-bill",
    "timestamp": "2025-04-23T20:05:58Z"
  },
  {
    "title": "Gov. Hochul and AG James leads lawsuit against President Trump administration over tariffs",
    "description": "Governor Hochul and New York Attorney General Letitia James announced a lawsuit against the Trump administration, joined by 11 other states.",
    "link": "https://cbs6albany.com/news/local/gov-hochul-and-ag-james-leads-lawsuit-against-president-trump-administration-over-tariffs-new-york-wrgb",
    "timestamp": "2025-04-23T20:04:55Z"
  },
  {
    "title": "Businesses are already trying to pass tariff costs onto customers, Fed report says",
    "description": "Businesses dealing with the early stages of President Donald Trump’s tariffs are looking for ways to pass increasing costs onto consumers, according to a Federal Reserve report Wednesday.",
    "link": "https://www.nbcnews.com/business/business-news/businesses-are-already-trying-pass-tariff-costs-customers-fed-report-s-rcna202667",
    "timestamp": "2025-04-23T20:03:19Z"
  },
  {
    "title": "Consumer spending is up big in early April as people buy in anticipation of tariffs",
    "description": "Consumer spending is rising at a faster clip this month as everyday Americans rush to make purchases before President Donald Trump’s full tariff plan takes effect, data released Wednesday from JPMorgan shows.",
    "link": "https://www.nbcnews.com/business/consumer/consumer-spending-big-early-april-people-buy-anticipation-tariffs-rcna202668",
    "timestamp": "2025-04-23T20:03:10Z"
  },
  {
    "title": "‘We aren’t going to get a thing’: MAGA hits a breaking point after Trump’s latest Epstein non-answer",
    "description": "Conservatives are torn after President Donald Trump responded to questions on Tuesday regarding his long-held promise to release documents related to deceased pedophile Jeffrey Epstein.\n\n\nWhile speaking in the Oval Office, Trump told Reagan Reese, White House…",
    "link": "https://www.dailydot.com/debug/donald-trump-jeffrey-epstein-documents/",
    "timestamp": "2025-04-23T20:03:03Z"
  },
  {
    "title": "First 100 days: How would you grade President Donald Trump?",
    "description": "Donald Trump will complete his first 100 days in office on April 30. We want to know how you think he's doing.",
    "link": "https://www.boston.com/community/tell-us/2025/04/23/donald-trump-how-would-you-grade-first-100-days/",
    "timestamp": "2025-04-23T20:01:59Z"
  },
  {
    "title": "$10,000,000,000 James Webb Telescope could go dark due to Trump administration",
    "description": "The Trump Administration could make cuts to funding at NASA, affecting all operations",
    "link": "https://www.ladbible.com/news/science/james-webb-space-telescope-trump-administration-no-funding-090229-20250423",
    "timestamp": "2025-04-23T20:01:19Z"
  },
  {
    "title": "Nvidia, other chipmakers jump on eased tariff concerns",
    "description": "Chip stocks were among the market leaders on Wednesday thanks to President Donald Trump’s statement the day before that tariffs on China “will come down substantially,” as well as vote of confidence by famed investor Cathie Wood.Read more...",
    "link": "https://qz.com/nvidia-chip-makers-tarrifs-cathie-wood-1851777574",
    "timestamp": "2025-04-23T20:00:55Z"
  },
  {
    "title": "Why oil prices keep crashing even as Trump's trade war pivot eases demand fears",
    "description": "US crude oil has fallen more than 22% since peaking in January. Oil extended its losses on Wednesday even as tariff pressures eased.",
    "link": "https://www.businessinsider.com/oil-prices-today-trump-tariffs-trade-war-opec-supply-boost-2025-4",
    "timestamp": "2025-04-23T19:58:40Z"
  },
  {
    "title": "Trump Approval Rating Tracker: Worst Economic Reviews In Years, Latest Poll Finds",
    "description": "The latest survey, released April 23, shows 53% disapprove of his job performance.",
    "link": "https://www.forbes.com/sites/saradorn/2025/04/23/trump-approval-rating-tracker-worst-economic-reviews-in-years-latest-poll-finds/",
    "timestamp": "2025-04-23T19:58:31Z"
  },
  {
    "title": "Michelle Obama confesses the reason she didn't attend Trump's inauguration",
    "description": "Michelle Obama has publicly addressed her decision to skip President Donald Trump&apos;s second inauguration in January 2025, revealing that it was a deliberate act of self-care ra",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/04/23/68093287268e3e85758b4581.html",
    "timestamp": "2025-04-23T19:58:16Z"
  },
  {
    "title": "Candace Owens Finally Speaks Out Against Trump for This Reason, and Black TikTok is Shook!",
    "description": "Candace Owens has always been an avid supporter of Donald Trump. The far-right commentator religiously stands ten-toes down for his administration and often dominates headlines for her dangerous rhetoric, including blaming George Floyd for his own death, labe…",
    "link": "https://www.theroot.com/candace-owens-finally-speaks-out-against-trump-for-this-1851777547",
    "timestamp": "2025-04-23T19:58:00Z"
  },
  {
    "title": "‘Apoplectic’: Reporter at legacy news agency gets schooled on new media in epic takedown",
    "description": "'The group of people in there spent four years covering for someone who was essentially dead, and that's being charitable in my description of a former president by the name of Joe Biden'",
    "link": "https://www.wnd.com/2025/04/apoplectic-reporter-at-legacy-news-agency-gets-schooled-on-new-media-in-epic-takedown/",
    "timestamp": "2025-04-23T19:57:40Z"
  },
  {
    "title": "Richest US households — including Elon Musk, Jeff Bezos — hold record-breaking share of total wealth: data",
    "description": "The 19 richest US households – which include titans of industry like Elon Musk, Jeff Bezos and Mark Zuckerberg, Bill Gates and Warren Buffett – saw their wealth grow by $1 trillion last year, according to new data released Wednesday.",
    "link": "https://nypost.com/2025/04/23/business/richest-us-households-including-elon-musk-jeff-bezos-hold-record-breaking-share-of-total-wealth-data/",
    "timestamp": "2025-04-23T19:54:53Z"
  },
  {
    "title": "Amid backlash, Canadian regulators pause diversity and climate disclosure projects",
    "description": "The Canadian Securities Administrators cited changes on the economic and geopolitical landscape in pausing disclosure plans. Find out more",
    "link": "https://financialpost.com/news/amid-backlash-canadian-regulators-pause-diversity-and-climate-disclosure-projects",
    "timestamp": "2025-04-23T19:53:27Z"
  },
  {
    "title": "States sue Trump in bid to block new tariffs",
    "description": null,
    "link": "https://www.cnbc.com/2025/04/23/states-sue-trump-in-bid-to-block-new-tariffs.html",
    "timestamp": "2025-04-23T19:52:11Z"
  },
  {
    "title": "The story behind the resignation of iconic CBS News' '60 Minutes' chief Bill Owens' abrupt resignation; here are the details",
    "description": "Bill Owens' sudden resignation as executive producer of '60 Minutes' has sent shockwaves through CBS News, highlighting tensions between news integrity and corporate pressures. Owens stated he became \"the corporation's problem\" amid a Trump lawsuit and a high…",
    "link": "https://economictimes.indiatimes.com/news/international/us/the-story-behind-the-resignation-of-iconic-cbs-news-60-minutes-chief-bill-owens-abrupt-resignation-here-are-the-details/articleshow/120562312.cms",
    "timestamp": "2025-04-23T19:51:49Z"
  },
  {
    "title": "Trump wants automakers to move vehicle production to the U.S. It's not that simple",
    "description": "DETROIT — When President Donald Trump hinted last week at a reprieve from 25% auto tariffs, he suggested it would be to allow automakers more time to move or increase U.S. vehicle production and parts.",
    "link": "https://biztoc.com/x/aada108cae1f9cae",
    "timestamp": "2025-04-23T19:51:45Z"
  },
  {
    "title": "Ticker: Leadership churn, worker exodus roils IRS; Health officials seek to phase out artificial dyes",
    "description": "The height of tax season was the height of turmoil at the IRS.\nThe agency shuffled through three acting directors over the course of a week. It’s preparing to lose tens of thousands of workers to layoffs and voluntary retirements. And President Donald Trump i…",
    "link": "https://biztoc.com/x/13ebd372df780618",
    "timestamp": "2025-04-23T19:51:40Z"
  },
  {
    "title": "Ticker: Leadership churn, worker exodus roils IRS; Health officials seek to phase out artificial dyes",
    "description": "Ticker: Leadership churn, worker exodus roils IRS; Health officials seek to phase out artificial dyes",
    "link": "https://www.bostonherald.com/2025/04/23/ticker-leadership-churn-worker-exodus-roils-irs-health-officials-seek-to-phase-out-artificial-dyes/",
    "timestamp": "2025-04-23T19:50:41Z"
  },
  {
    "title": "Adidas profit jumps in first quarter without Yeezy shoes",
    "description": "The German sportswear giant said on Wednesday that its profit almost doubled.",
    "link": "https://www.nzherald.co.nz/world/adidas-profit-jumps-in-first-quarter-without-yeezy-shoes/P2JTJXNCDBEO5ELGTDHEMOHFFA/",
    "timestamp": "2025-04-23T19:49:31Z"
  },
  {
    "title": "California expands electric school bus fleet as federal freeze paused other efforts",
    "description": "California is spending $500 million to put an additional 1,000 electric school buses on the road",
    "link": "https://abcnews.go.com/US/wireStory/california-expands-electric-school-bus-fleet-federal-freeze-121099536",
    "timestamp": "2025-04-23T19:48:05Z"
  },
  {
    "title": "Treasury Secretary Suggests China Tariffs Could Be Lowered 'In A Mutual Way'",
    "description": "Sec. Scott Bessent also emphasized again that \"neither side believes that these are sustainable levels.\"",
    "link": "https://www.huffpost.com/entry/scott-bessent-china-tariffs_n_6809415ae4b047d19264dfb8",
    "timestamp": "2025-04-23T19:46:11Z"
  },
  {
    "title": "Top intelligence lawmaker fears China may exploit DOGE’s changes to government",
    "description": "Rep. Jim Himes, D-Conn., also called out the Trump administration on the recent firing of NSA Director Timothy Haugh, a move he viewed as “puzzling.”",
    "link": "https://www.nextgov.com/cybersecurity/2025/04/top-intelligence-lawmaker-fears-china-may-exploit-doges-changes-government/404777/",
    "timestamp": "2025-04-23T19:46:00Z"
  },
  {
    "title": "Boeing CEO says China has stopped taking its aircraft amid trade war",
    "description": "Boeing could hand over some of its aircraft that were destined for Chinese airlines to other carriers after China stopped taking deliveries of its planes amid a trade war with the United States.",
    "link": "https://www.nbcnews.com/business/business-news/boeing-ceo-says-china-stopped-taking-aircraft-trade-war-rcna202666",
    "timestamp": "2025-04-23T19:44:20Z"
  },
  {
    "title": "Trump wants automakers to move vehicle production to the U.S. It's not that simple",
    "description": "DETROIT — When President Donald Trump hinted last week at a reprieve from 25% auto tariffs, he suggested it would be to allow automakers more time to move or increase U.S. vehicle production and parts.",
    "link": "https://www.nbcnews.com/business/autos/trump-wants-automakers-move-vehicle-production-us-not-simple-rcna202665",
    "timestamp": "2025-04-23T19:44:14Z"
  },
  {
    "title": "Shein ‘Welcomes’ Review of De Minimis Rule in Britain",
    "description": "The online giant, which is hoping to list on the London Stock Exchange, said it “wants to work with policymakers and industry peers to ensure a level playing field for all retailers.”",
    "link": "http://wwd.com/business-news/government-trade/shein-welcomes-review-de-minimis-rule-britain-1237101200/",
    "timestamp": "2025-04-23T19:41:20Z"
  },
  {
    "title": "NIO Stock Trades Higher On Potential China Tariff Cuts, EV Sector Optimism",
    "description": "NIO, Inc. (NYSE:NIO) stock is moving higher after President Donald Trump indicated that the final tariff rate with China would be “substantially” below the current 145% but not 0%.\nThe Details: According to the Wall Street Journal, a senior White House offici…",
    "link": "https://biztoc.com/x/22c73075af161eb7",
    "timestamp": "2025-04-23T19:40:55Z"
  },
  {
    "title": "Super Micro Stock Gains As Trump Signals No Plans To Fire Powell",
    "description": "Super Micro Computer, Inc. (NASDAQ:SMCI) stock is trading higher amid overall market strength after President Donald Trump said he had no intention of firing Federal Reserve Chair Jerome Powell.\nThe Details: According to the Wall Street Journal, Trump told re…",
    "link": "https://biztoc.com/x/52e7fca037c99a59",
    "timestamp": "2025-04-23T19:40:23Z"
  },
  {
    "title": "Trump Absolutely Loses It on Zelensky: ‘He Can Have Peace’ or Lose ‘the Whole Country’",
    "description": "President Donald Trump lost it on his Ukrainian counterpart, Volodymyr Zelensky Wednesday, blaming him for stalled peace negotiations with Russia.\nThe post Trump Absolutely Loses It on Zelensky: ‘He Can Have Peace’ or Lose ‘the Whole Country’ first appeared o…",
    "link": "https://www.mediaite.com/news/trump-absolutely-loses-it-on-zelensky-he-can-have-peace-or-lose-the-whole-country/",
    "timestamp": "2025-04-23T19:40:11Z"
  },
  {
    "title": "The Irish Times view on the fines on Apple and Meta: Big tech must play by the rules",
    "description": "The major players are making big profits in Europe and should not escape proper regulation here",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/04/23/the-irish-times-view-on-the-fines-on-apple-and-meta-big-tech-must-play-by-the-rules/",
    "timestamp": "2025-04-23T19:40:00Z"
  },
  {
    "title": "Members-Only Event: Trump’s First 100 Days",
    "description": "April 30 marks President Donald Trump’s 100th day in office. Forbes has been tracking how his every move impacts the nation, international politics, markets and security, the rising influence of billionaires—and his business empire. Join us April 30th at 12 P…",
    "link": "https://www.forbes.com/sites/members-only-events/2025/04/23/members-only-event-trumps-first-100-days/",
    "timestamp": "2025-04-23T19:38:16Z"
  },
  {
    "title": "Trump’s Attack on the Education Department Will Disempower Parents",
    "description": "In a North Carolina coastal community, an elementary school may be forced to end its free monthly dinners where parents come together with teachers to talk about their children’s academic progress, as well as their mental and physical health. \nIn a rural corn…",
    "link": "https://msmagazine.com/2025/04/23/trump-education-department-parents-rights/",
    "timestamp": "2025-04-23T19:36:47Z"
  },
  {
    "title": "EXCLUSIVE: Trump Executive Order Will Bar Decertifying Colleges Over DEI",
    "description": "FIRST ON THE DAILY SIGNAL—President Donald Trump will sign an executive order Wednesday prohibiting higher education accreditors from acting against colleges over diversity, equity, and... Read More\nThe post EXCLUSIVE: Trump Executive Order Will Bar Decertify…",
    "link": "https://www.dailysignal.com/2025/04/23/exclusive-trump-executive-order-will-bar-decertifying-colleges-over-dei/",
    "timestamp": "2025-04-23T19:36:40Z"
  },
  {
    "title": "Behar: Trump’s Baby Bonus Plan Meant to Increase ‘White Children’",
    "description": "Joy Behar told her co-hosts Wednesday on ABC’s “The View” that President Donald Trump’s plan to offer financial assistance to new mothers is to increase the number of “white children.” Partial transcript as follows: SUNNY HOSTIN: I want to reframe the issue a…",
    "link": "https://freerepublic.com/focus/f-news/4312828/posts",
    "timestamp": "2025-04-23T19:36:15Z"
  },
  {
    "title": "Bitcoin ETFs Bounce Back Big, Adding Nearly $1 Billion in a Single Day",
    "description": "American investors on Tuesday put nearly $1 billion into Bitcoin ETFs, the highest amount since January, while the price of the coin soared.",
    "link": "https://decrypt.co/315966/bitcoin-etfs-bounce-back-billion-day",
    "timestamp": "2025-04-23T19:35:47Z"
  },
  {
    "title": "White House Says Trump’s ‘Patience Is Running Very Thin’ With Zelensky Amid Messy Peace Negotiations",
    "description": "Karoline Leavitt said President Donald Trump is \"frustrated\" with Ukraine President Volodymyr Zelensky as peace negotiations continue with Russia.\nThe post White House Says Trump’s ‘Patience Is Running Very Thin’ With Zelensky Amid Messy Peace Negotiations fi…",
    "link": "https://www.mediaite.com/news/white-house-says-trumps-patience-is-running-very-thin-with-zelensky-amid-messy-peace-negotiations/",
    "timestamp": "2025-04-23T19:35:22Z"
  },
  {
    "title": "Trump to Host Dinner With Top Holders of His Memecoin (Bloomberg)",
    "description": "Bloomberg:\nTrump to Host Dinner With Top Holders of His Memecoin  —  President Donald Trump will have dinner with the top 220 holders of the Trump memecoin, the issuers of the cryptocurrency announced on Wednesday.  —  At the “intimate private dinner” on May …",
    "link": "https://www.memeorandum.com/250423/p102",
    "timestamp": "2025-04-23T19:35:01Z"
  },
  {
    "title": "Law Firm Inks 28K-SF Sublease in D.C.",
    "description": "An Alabama-based law firm has inked a sublease deal with one of its peers in Washington, D.C. — just the latest example of law firms gobbling up trophy space in the nation’s capital as office availability otherwise remains high and the federal government retr…",
    "link": "http://commercialobserver.com/2025/04/bradley-dentons-dc-law-firm-lease/",
    "timestamp": "2025-04-23T19:34:47Z"
  },
  {
    "title": "Oregon leads 12-state lawsuit to challenge Trump tariffs",
    "description": "Oregon Attorney General Dan Rayfield’s office filed a federal lawsuit over the tariffs on Wednesday.",
    "link": "https://www.oregonlive.com/business/2025/04/oregon-leads-12-state-lawsuit-to-challenge-trump-tariffs.html",
    "timestamp": "2025-04-23T19:33:26Z"
  },
  {
    "title": "Don't believe rumor Trump urged Vatican to select new pope from 'Fox & Friends' cast",
    "description": "After Pope Francis' death in April 2025, U.S. President Donald Trump urged the Vatican to select the next pope from the cast of \"Fox & Friends.\"",
    "link": "https://www.snopes.com//fact-check/new-pope-trump-vatican/",
    "timestamp": "2025-04-23T19:33:00Z"
  },
  {
    "title": "Trump Throws Support Behind Plan to Incentivize Having Babies by Offering Sizable Cash Bonuses",
    "description": "President Donald Trump didn't hesitate when asked about a policy proposal that would financially incentivize new mothers.",
    "link": "https://www.westernjournal.com/trump-throws-support-behind-plan-incentivize-babies-offering-sizable-cash-bonuses/",
    "timestamp": "2025-04-23T19:32:58Z"
  },
  {
    "title": "Elon Musk’s retreat should relieve no one",
    "description": "After Tesla’s Q1 earnings showed major losses, Musk told investors that he’ll soon step back from his role overseeing the Department of Government Efficiency (DOGE).",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/elon-musk-doge-trump-administration-tesla-earnings-rcna202574",
    "timestamp": "2025-04-23T19:31:12Z"
  },
  {
    "title": "Trump Crypto Coin Buyers Offered VIP Tour of White House",
    "description": "The cryptocurrency Donald Trump launched days before returning to the Oval Office got a big boost on Wednesday afternoon, as the Trump-owned company behind the meme coin announced that its top holders would be invited to an exclusive dinner with the president…",
    "link": "https://www.motherjones.com/politics/2025/04/trump-crypto-coin-white-house-tour/",
    "timestamp": "2025-04-23T19:30:40Z"
  },
  {
    "title": "Washington Finally Catching Up With America’s Media Consumption Habits, Thanks to Trump’s White House",
    "description": "Americans changed their news consumption habits years ago, but the White House press briefing room did not reflect those changes—until now.  Despite floundering ratings at... Read More\nThe post Washington Finally Catching Up With America’s Media Consumption H…",
    "link": "https://www.dailysignal.com/2025/04/23/washington-finally-catching-up-americas-media-consumption-habits-thanks-trumps-white-house/",
    "timestamp": "2025-04-23T19:30:00Z"
  },
  {
    "title": "Daryl Hannah claims Trump administration tried to ‘mess Neil Young up’ over American citizenship",
    "description": "Veteran rocker recently expressed concern that he could be barred from the US upon his return from his European tour",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/neil-young-american-citizenship-trump-daryl-hannah-b2732778.html",
    "timestamp": "2025-04-23T19:29:44Z"
  },
  {
    "title": "Trump’s Approval Lags Past Presidents",
    "description": "Approaching the 100-day mark, Donald Trump has 40% approval rating, the lowest of any president at this stage in his term going back generations.",
    "link": "https://politicalwire.com/2025/04/23/trumps-approval-lags-past-presidents/",
    "timestamp": "2025-04-23T19:28:59Z"
  },
  {
    "title": "Trump denied tornado disaster request, blocking victims from receiving federal aid",
    "description": "Trump’s disaster denial follows his executive order seeking to shift the burden of response and recovery from the federal government onto states.",
    "link": "https://www.cnn.com/2025/04/23/weather/trump-denied-disaster-aid-arkansas-tornadoes/index.html",
    "timestamp": "2025-04-23T19:28:23Z"
  },
  {
    "title": "Tariffs, American Manufacturing, and You",
    "description": "We cut through the rhetoric, and the math, to find out what you really need to know.",
    "link": "https://www.esquire.com/style/mens-fashion/a64488881/trump-tariffs-fashion/",
    "timestamp": "2025-04-23T19:28:00Z"
  },
  {
    "title": "Harvard's president says the school will 'not compromise' with the Trump admin",
    "description": "The head of Harvard University doubled down on his defiance against the Trump administration Wednesday, saying the Ivy League school would not compromise on certain issues despite the federal government’s threat to freeze more than $2 billion in funding.",
    "link": "https://www.nbcnews.com/news/us-news/harvards-president-says-school-will-not-compromise-trump-admin-rcna202564",
    "timestamp": "2025-04-23T19:27:14Z"
  },
  {
    "title": "Economist Steve Moore Unloads On Fed Chair Jerome Powell Over ‘Outrageous Partisan Attack’ Against Trump",
    "description": "Steve Moore on Wednesday criticized Federal Reserve Chairman Jerome Powell for delivering what he called a blatantly biased speech against Donald Trump.",
    "link": "https://dailycaller.com/2025/04/23/economist-steve-moore-unloads-fed-chair-jerome-powell-trump/",
    "timestamp": "2025-04-23T19:26:44Z"
  },
  {
    "title": "'Too far': Conservatives alarmed over new Trump policy",
    "description": "President Donald Trump has repeatedly argued that his calls for tougher border security are about stemming the flow of dangerous drugs like fentanyl into the United States. But one new policy he's implementing could end up making the problem even worse.That's…",
    "link": "https://www.rawstory.com/trump-fentanyl-2671833666/",
    "timestamp": "2025-04-23T19:25:13Z"
  },
  {
    "title": "Who Is Set to Attend Pope Francis’ Funeral? From Trump to Prince William, Here Are the Key Figures So Far",
    "description": "Key figures from across the globe are set to attend the funeral of Pope Francis on April 26. Here's what we know so far.",
    "link": "https://time.com/7279745/pope-francis-funeral-who-will-attend/",
    "timestamp": "2025-04-23T19:24:46Z"
  },
  {
    "title": "Republican Senator Salutes Pete Hegseth On CNN: He’s ‘Willing to Investigate’ And ‘Even Fire’ Close Friends He Hired",
    "description": "\"I think it's a real strength that he is willing to investigate and even fire close friends when they're suspected of doing things\"\nThe post Republican Senator Salutes Pete Hegseth On CNN: He’s ‘Willing to Investigate’ And ‘Even Fire’ Close Friends He Hired f…",
    "link": "https://www.mediaite.com/tv/republican-senator-salutes-pete-hegseth-on-cnn-hes-willing-to-investigate-and-even-fire-close-friends-he-hired/",
    "timestamp": "2025-04-23T19:23:45Z"
  },
  {
    "title": "'DOGE' and 'DOGE-lite': Public service unions react to costed federal party platforms",
    "description": "Public service unions are paying close attention to the fully costed platforms recently released by Canada’s major political parties, with a focus on what parties are promising to spend on the federal workforce.",
    "link": "https://www.cbc.ca/news/canada/ottawa/federal-public-service-unions-costed-platforms-1.7516396",
    "timestamp": "2025-04-23T19:22:47Z"
  },
  {
    "title": "Here’s why Trump meme coin exploded 70% today",
    "description": "The Official Trump (TRUMP) meme token has skyrocketed after a major announcement. With volume spiking over 420%, TRUMP  is the top-gaining token among the 100 top coins. The TRUMP meme token jumped from $9.30 to highs of $15.47. The Official Trump (TRUMP) mem…",
    "link": "https://coinjournal.net/news/heres-why-trump-meme-coin-exploded-70-today/",
    "timestamp": "2025-04-23T19:21:55Z"
  },
  {
    "title": "How Atlas Network's 'free market, right wing interests' are changing NZ",
    "description": "In New Zealand, there is now a conversation about an organisation called Atlas Network and whether or not it has influenced the right-bloc government's agenda.",
    "link": "https://www.abc.net.au/news/2025-04-24/atlas-network-think-tanks-active-in-australia-and-new-zealand/104788732",
    "timestamp": "2025-04-23T19:21:50Z"
  },
  {
    "title": "Previously Unreleased Document Exposes Government’s False Insurrection Narrative: Only 56 Officers Reported Minor Injuries on January 6",
    "description": "A recently uncovered document reveals that only 56 officers reported minor injuries during the January 6 protests, challenging the government's portrayal of an insurrection. This filing raises critical questions about transparency and accountability.\nThe post…",
    "link": "https://www.thegatewaypundit.com/2025/04/previously-unreleased-document-exposes-governments-false-insurrection-narrative/",
    "timestamp": "2025-04-23T19:20:59Z"
  },
  {
    "title": "India Launches Manhunt After Islamic Terrorists Massacre 26 People in Kashmir Region",
    "description": "Deadly attack carried out by Pakistan-based terror group Lashkar-e-Taiba (LeT), New Delhi says. \nThe post India Launches Manhunt After Islamic Terrorists Massacre 26 People in Kashmir Region first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/india-launches-manhunt-after-islamic-terrorists-massacre-26-people-in-kashmir-region/",
    "timestamp": "2025-04-23T19:20:38Z"
  },
  {
    "title": "Pro-Palestinian demonstrators protest on Yale campus ahead of Itamar Ben Gvir visit",
    "description": "Hundreds of pro-Palestinian demonstrators gathered at Yale University Tuesday night to protest an upcoming visit from Israeli National Security Minister Itamar Ben Gvir. The far-right minister is expected to give a speech Wednesday to Shabtai, a Jewish societ…",
    "link": "https://www.cnn.com/2025/04/23/us/yale-university-protest-israel-gaza/index.html",
    "timestamp": "2025-04-23T19:20:33Z"
  },
  {
    "title": "Trump envoy says there were positive talks in London with Ukraine official",
    "description": "President Donald Trump's Ukraine envoy, Keith Kellogg, said on Wednesday that there were positive talks in Lon",
    "link": "https://www.jpost.com/breaking-news/article-851270",
    "timestamp": "2025-04-23T19:20:08Z"
  }
]