[
  {
    "title": "Social media erupts after House Dem Al Green interrupted Trump's address: 'Embarrassing themselves'",
    "description": "Reactions poured in as Rep. Al Green, D-Texas, was removed from the House chamber for protesting in the middle of President Donald Trump’s address to Congress on Tuesday night.",
    "link": "https://www.foxnews.com/politics/social-media-erupts-after-house-dem-al-green-interrupted-trumps-address-congress",
    "timestamp": "2025-03-05T03:06:45Z"
  },
  {
    "title": "Markets rallied after Trump's commerce secretary said a tariff deal may be around the corner",
    "description": "US stock futures recovered after Trump's commerce secretary said imminent tariff compromises with Canada and Mexico could come as soon as Wednesday.",
    "link": "https://www.businessinsider.com/markets-trump-tariff-compromise-lutnick-commerce-canadia-mexico-stocks-2025-3",
    "timestamp": "2025-03-05T03:05:58Z"
  },
  {
    "title": "The Democrats Who Walked Out in Middle of Trump’s Speech to Congress",
    "description": "Democratic resistance to Donald Trump’s agenda was remarkably quiet on Tuesday, barely managing to make it on camera during the president’s official State of the Union address.\r\nWhile Trump rattled on about all the myriad ways in which his administration is w…",
    "link": "https://newrepublic.com/post/192332/democrats-walk-out-trump-speech-congress-frost-crockett",
    "timestamp": "2025-03-05T03:05:45Z"
  },
  {
    "title": "WATCH: Trump says U.S. ‘will be woke no longer’",
    "description": "The first speech of Trump’s second term in office, while not officially a State of the Union address, is a chance for the president to lay out legislative priorities and tout early achievements.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-says-u-s-will-be-woke-no-longer",
    "timestamp": "2025-03-05T03:04:15Z"
  },
  {
    "title": "Judge extends nationwide block on Trump orders on transgender youth health care",
    "description": "A federal judge extended a nationwide block Tuesday on President Donald Trump's executive orders halting federal funding for providers of gender-affirming health care for transgender people under age 19. \n\n\nThe judge's ruling came in a lawsuit filed earlier t…",
    "link": "https://www.voanews.com/a/judge-extends-nationwide-block-on-trump-orders-on-transgender-youth-health-care-/7998238.html",
    "timestamp": "2025-03-05T03:03:10Z"
  },
  {
    "title": "Trump Contradicts Own Administration After Saying Elon Musk Runs DOGE",
    "description": "President Trump's remarks come after the White House said last week that Amy Gleason is the acting administrator of DOGE.",
    "link": "https://www.newsweek.com/trump-contradicts-own-administration-after-saying-elon-musk-runs-doge-2039703",
    "timestamp": "2025-03-05T03:02:40Z"
  },
  {
    "title": "One day into tariff war, U.S. says de-escalation now possible",
    "description": "Less than a day after firing the opening shot in a trade war, the Trump administration is now talking about de-escalation. \"We're probably gonna be announcing that tomorrow,\" said Commerce Secretary Howard Lutnick, after speaking by phone with a Canadian coun…",
    "link": "https://www.cbc.ca/news/world/trump-lutnick-ford-leblanc-tariffs-1.7474859",
    "timestamp": "2025-03-05T03:01:54Z"
  },
  {
    "title": "Representative Al Green is removed from chamber during Trump address",
    "description": "Green is a fierce critic of Donald Trump, and has previously called for his impeachment.",
    "link": "https://www.bbc.com/news/articles/c5y07glyge3o",
    "timestamp": "2025-03-05T03:01:08Z"
  },
  {
    "title": "Chaos in the Capitol: Sergeant at Arms Kicks Out Unruly Democrat from Trump Address",
    "description": "Democrats erupted into an unruly mob in the early minutes of President Donald Trump's joint address to Congress, resulting in the House Sergeant at Arms escorting out Rep. Al Green (D-TX) after he refused to obey decorum.\nThe post Chaos in the Capitol: Sergea…",
    "link": "https://www.breitbart.com/politics/2025/03/04/chaos-in-the-capitol-sergeant-at-arms-kicks-out-unruly-democrat-from-trump-address/",
    "timestamp": "2025-03-05T03:00:35Z"
  },
  {
    "title": "Gingrich Tries To Pin Coming Trump Recession On Biden",
    "description": "Disgraced former House Speaker Newt Gingrich is already priming the Fox Business Network viewers for the soon-to-be Trump recession and trying to pin it on Biden and Republicans in Congress not getting their massive tax cut passed quickly enough.\nHere's Gingr…",
    "link": "https://crooksandliars.com/2025/03/gingrich-tries-pinning-coming-trump",
    "timestamp": "2025-03-05T03:00:01Z"
  },
  {
    "title": "Democrats Point At Elon Musk As Donald Trump Declares “The Days Of Unelected Bureaucrats Are Over” — Update",
    "description": "UPDATE: Donald Trump told Congress that “we are achieving the great liberation of America” as he touted his border policy. “Since taking office, my administration has launched the most sweeping border and immigration crackdown in American history, and we quic…",
    "link": "http://deadline.com/2025/03/trump-joint-session-of-congress-live-updates-1236311264/",
    "timestamp": "2025-03-05T03:00:00Z"
  },
  {
    "title": "What to Know About the Democratic Lawmaker Ejected for Protesting Trump’s Speech",
    "description": "Here’s what to know about Texas Democrat Rep. Al Green.",
    "link": "https://time.com/7264572/al-green-trump-speech-congress-texas-democrat-mandate-protest-removed/",
    "timestamp": "2025-03-05T03:00:00Z"
  },
  {
    "title": "'Enough Is Enough': James Woods Cheers Democrat Al Green Being Booted from Trump's Congressional Address",
    "description": "\"Mike Johnson did what Republicans have needed to do since Lincoln. Start throwing the bums into the gutter and the criminals into prison. Bravo,\" veteran actor James Woods said in response to Speaker of the House Mike Johnson ordering the Sergeant-at-Arms to…",
    "link": "https://www.breitbart.com/entertainment/2025/03/04/enough-is-enough-james-woods-cheers-democrat-al-green-being-booted-from-trumps-congressional-address/",
    "timestamp": "2025-03-05T02:59:10Z"
  },
  {
    "title": "'Righteous civil disobedience': Dem's protest during Trump speech stirs up social media",
    "description": "Just as President Donald Trump was about to start speaking in his address to Congress, Rep. Al Green (D-TX) stood up, shouted, \"You don't have a mandate to cut Medicaid!\" and forcefully waved his cane. Republicans immediately directed the sergeant-at-arms to …",
    "link": "https://www.rawstory.com/al-green/",
    "timestamp": "2025-03-05T02:58:11Z"
  },
  {
    "title": "Trump vows action to increase rare earth mining in US",
    "description": "United States President Donald Trump announced plans to increase the production of critical minerals and rare earths in the US.\nSpeaking to Congress, he said he would take historic action this week t...",
    "link": "https://biztoc.com/x/cc50e4de8ab5d1e1",
    "timestamp": "2025-03-05T02:58:02Z"
  },
  {
    "title": "Trump to say Japan, South Korea will partner on Alaska gas pipeline",
    "description": "WASHINGTON -- U.S. President Donald Trump is set to announce that Japan and South Korea will spend \"trillions of dollars\" to help build a natural gas pipeline in the state of Alaska, in his first address to Congress of his second term on Tuesday.\n\"My administ…",
    "link": "https://biztoc.com/x/5f4d2bbf08703d38",
    "timestamp": "2025-03-05T02:57:57Z"
  },
  {
    "title": "Melania Trump wore a gray $5,500 blazer with a removable scarf to Donald Trump's address to Congress",
    "description": "Melania Trump at Donald Trump's address to a joint session of Congress.\nSAUL LOEB/AFP/Getty Images\nPresident Donald Trump addressed a joint session of Congress on Tuesday.\nMelania Trump attended the speech wearing a Dior blazer with a removable scarf and matc…",
    "link": "https://biztoc.com/x/b98e9db2b8ecf28a",
    "timestamp": "2025-03-05T02:57:48Z"
  },
  {
    "title": "US politicians protest during President Donald Trump’s address to Congress",
    "description": "US politicians protest during President Donald Trump’s address to Congress7news.com.au",
    "link": "https://7news.com.au/news/us-politicians-protest-during-president-donald-trumps-address-to-congress-c-17933360",
    "timestamp": "2025-03-05T02:57:37Z"
  },
  {
    "title": "Trump's Big Shout-Out To Elon Musk, DOGE: \"Working Very Hard\"",
    "description": "US President Donald Trump gave a big shout out to his billionaire advisor Elon Musk and his Department of Government Efficiency (DOGE) in his first joint address to Congress.",
    "link": "https://www.ndtv.com/world-news/us-president-congress-speech-donald-trumps-big-shout-out-to-elon-musk-doge-hes-working-very-hard-7850712",
    "timestamp": "2025-03-05T02:57:23Z"
  },
  {
    "title": "Immigrants chose not to come after hearing my threats, says Donald Trump in Congress address",
    "description": "President Trump claimed that his firm immigration policies have led to a significant decrease in illegal border crossings, describing the recent figures as the 'lowest recorded—ever.' He credited the decline to the deployment of military and border patrol age…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/immigrants-chose-not-to-come-after-hearing-my-threats-says-donald-trump-in-congress-address/articleshow/118722236.cms",
    "timestamp": "2025-03-05T02:55:48Z"
  },
  {
    "title": "Rep. Al Green Removed From Trump's Address As Dems Disrupt In Protest",
    "description": "President Donald Trump's joint address to Congress on Tuesday night erupted in bipartisan outbursts almost from the start, including the removal of Rep. Al Green (D-Texas) for being disruptive.",
    "link": "https://www.ibtimes.com/rep-al-green-removed-trumps-address-dems-disrupt-protest-3765127",
    "timestamp": "2025-03-05T02:55:24Z"
  },
  {
    "title": "Democratic Congressman Removed From Trump Speech in Unprecedented Move",
    "description": "At the beginning of Donald Trump’s address to Congress Tuesday night, Democratic Representative Al Green was removed from the chamber after interrupting the president. \r\nGreen reportedly kept yelling at Trump, “You have no mandate to cut Medicaid!” The Housto…",
    "link": "https://newrepublic.com/post/192329/democratic-congressman-al-green-removed-trump-speech-congress-protest",
    "timestamp": "2025-03-05T02:53:25Z"
  },
  {
    "title": "Hong Kong Firm Sells Panama Canal Stake to BlackRock, Making It Majority Owner Amid Trump’s Pressure to Curb Chinese Influence",
    "description": "BlackRock Inc. has secured control over key ports near the Panama Canal, stripping away Chinese-linked influence over one of the world’s most crucial shipping routes.\nThe $23 billion deal, which includes $5 billion in debt, will effectively place the strategi…",
    "link": "https://www.globalresearch.ca/hong-kong-firm-sells-panama-canal-stake-blackrock/5881400",
    "timestamp": "2025-03-05T02:52:43Z"
  },
  {
    "title": "Diplomat Charles: UK king’s role in Trump-Ukraine tightrope act",
    "description": "From showing solidarity with Volodymyr Zelensky to inviting US President Donald Trump for an historic state visit, Britain’s diplomatic drive over Ukraine has a surprising pivotal figure: King Charles III. The UK head of state may be politically neutral, but …",
    "link": "https://www.digitaljournal.com/world/diplomat-charles-uk-kings-role-in-trump-ukraine-tightrope-act/article",
    "timestamp": "2025-03-05T02:52:21Z"
  },
  {
    "title": "US tax agency weighs firing half of its 90,000 employees",
    "description": "The US Internal Revenue Service (IRS) is considering letting go up to half of its approximately 90,000 employees, a source with knowledge of the situation told AFP on Tuesday. The bloodbath would be the latest drastic cut to a federal agency under President D…",
    "link": "https://www.digitaljournal.com/world/us-tax-agency-weighs-firing-half-of-its-90000-employees/article",
    "timestamp": "2025-03-05T02:52:20Z"
  },
  {
    "title": "Democrat Booted From Trump Address to Congress After Repeatedly Heckling President, Derailing Speech",
    "description": "Rep. Al Green (D-TX) was escorted out of President Donald Trump's address to Congress after he repeatedly heckled the president and refused to take his seat.\nThe post Democrat Booted From Trump Address to Congress After Repeatedly Heckling President, Derailin…",
    "link": "https://www.mediaite.com/tv/democrat-booted-from-trump-address-to-congress-after-repeatedly-heckling-president-derailing-speech/",
    "timestamp": "2025-03-05T02:51:51Z"
  },
  {
    "title": "Trump Speech Descends Into Chaos As Democrats Boo POTUS & Congressman Removed From Chamber In Opening Minutes",
    "description": "Democrats may have been hushed in their response so far to Donald Trump’s second administration, but for a brief turn tonight at least one Democrat was not so silent as the 47th President addressed a joint session of Congress. Within minutes of Trump taking t…",
    "link": "http://deadline.com/2025/03/trump-speech-chaos-boos-exits-1236311284/",
    "timestamp": "2025-03-05T02:50:00Z"
  },
  {
    "title": "Democrat Lawmaker Gets Booted From Trump Speech Almost Instantly By Mike Johnson",
    "description": "Democratic Texas Rep. Al Green was kicked out of the chamber Tuesday evening after disrupting President Donald Trump's speech.",
    "link": "https://dailycaller.com/2025/03/04/al-green-democrats-donald-trump-joint-address-congress/",
    "timestamp": "2025-03-05T02:49:23Z"
  },
  {
    "title": "The List of Democrats Not Attending Trump's Address to Congress",
    "description": "As President Donald Trump addresses Congress and the nation on Tuesday night, several Democrats opted not to show up for the occasion either out of circumstance or protest.\nThe post The List of Democrats Not Attending Trump’s Address to Congress appeared firs…",
    "link": "https://www.breitbart.com/politics/2025/03/04/democrats-not-attending-trump-address-congress/",
    "timestamp": "2025-03-05T02:47:18Z"
  },
  {
    "title": "Democrat Leaders Refuse to Escort President Trump into the Chamber",
    "description": "Democrats refused to escort President Donald Trump into the chamber ahead of the joint session of Congress in a form of protest.\nThe post Democrat Leaders Refuse to Escort President Trump into the Chamber appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/04/democrat-leaders-refuse-to-escort-president-trump-into-the-chamber/",
    "timestamp": "2025-03-05T02:47:16Z"
  },
  {
    "title": "WATCH: Texas Democratic Rep. Green interrupts Trump",
    "description": "Republicans attempted to drown him out with “USA!” chants, but the Texas lawmaker continued to stand and shout at the president.",
    "link": "https://www.pbs.org/newshour/politics/watch-texas-democratic-rep-green-interrupts-trump",
    "timestamp": "2025-03-05T02:46:52Z"
  },
  {
    "title": "Democratic Rep. Al Green removed after disrupting Trump's speech",
    "description": "US Representative Al Green (D-TX) shouts out as US President Donald Trump speaks during an address to a joint session of Congress at the US Capitol in Washington, DC, on March 4, 2025.",
    "link": "https://biztoc.com/x/8a453b69b44d10eb",
    "timestamp": "2025-03-05T02:46:49Z"
  },
  {
    "title": "Tensions boil over in the House Chamber with Texas representative Al Green ejected in the first 15 minutes",
    "description": "Tensions boil over in the House Chamber with Texas representative Al Green ejected in the first 15 minutes\nUS Representative Al Green (D-TX) is removed after shouting while US President Donald Trump spoke during an address to a joint session of Congress in th…",
    "link": "https://biztoc.com/x/83be6dce79dcc633",
    "timestamp": "2025-03-05T02:46:48Z"
  },
  {
    "title": "Protectionism is stupid. But changing our investing is silly.",
    "description": "It’s time to put the politics aside. \nThe post Protectionism is stupid. But changing our investing is silly. appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/03/05/protectionism-is-stupid-but-changing-our-investing-is-silly/",
    "timestamp": "2025-03-05T02:45:06Z"
  },
  {
    "title": "Melania Trump wore a gray $5,500 blazer with a removable scarf to Donald Trump's address to Congress",
    "description": "\"First lady Melania's style tonight is quiet authority — polished, self-assured, and entirely in command of her presence,\" a style strategist told BI.",
    "link": "https://www.businessinsider.com/melania-trump-dior-fashion-donald-trump-speech-congress-2025-3",
    "timestamp": "2025-03-05T02:45:01Z"
  },
  {
    "title": "Democratic Rep. Al Green removed after disrupting Trump's speech",
    "description": "Rep. Al Green, D-Texas, was removed from the House chamber Tuesday night after disrupting President Donald Trump's joint address to Congress.",
    "link": "https://www.nbcnews.com/politics/congress/democratic-rep-al-green-removed-disrupting-trump-speech-rcna194817",
    "timestamp": "2025-03-05T02:44:55Z"
  },
  {
    "title": "Iraqis Fear That Trump’s America Will Depart Once and For All",
    "description": "Baghdad has good reason to be concerned about the trajectory of the U.S.-Iraqi relationship.\nThe post Iraqis Fear That Trump’s America Will Depart Once and For All appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/politics/iraqis-fear-that-trumps-america-will-depart-once-and-for-all/",
    "timestamp": "2025-03-05T02:44:53Z"
  },
  {
    "title": "Taiwan chipmakers brace for impact of Trump tariffs",
    "description": "The tariff sword wielded by US President Donald Trump has officially fallen. Although downstream assembly plants and brand manufacturers have generally prepared to diversify their production locations, the increase in related costs has prompted companies to c…",
    "link": "https://www.digitimes.com/news/a20250305PD211/ai-chips-mexico-tariff.html",
    "timestamp": "2025-03-05T02:44:49Z"
  },
  {
    "title": "China keeps its economic growth target at 'around 5%' for 2025",
    "description": "China is keeping its economic growth target at “around 5%” for 2025 despite a looming trade war with the United States and other headwinds.",
    "link": "https://www.nbcnews.com/news/world/china-economic-growth-target-5-percent-rcna194816",
    "timestamp": "2025-03-05T02:43:24Z"
  },
  {
    "title": "Trump Addresses Unruly Congress, Speaker Mike Johnson Ejects Texas Rep. Al Green in Opening Minutes",
    "description": "\"America is back!\" Trump declares to open his speech, and from there it got wild\nThe post Trump Addresses Unruly Congress, Speaker Mike Johnson Ejects Texas Rep. Al Green in Opening Minutes appeared first on TheWrap.",
    "link": "https://www.thewrap.com/donald-trump-congress-address-sotu-speaker-mike-johnson-removes-rep-al-green/",
    "timestamp": "2025-03-05T02:42:43Z"
  },
  {
    "title": "It took a century for the U.S. to build up international goodwill. TFG destroyed it in a shade over a month. Bonus: Germany and Japan are re-arming themselves [Dumbass]",
    "description": "It took a century for the U.S. to build up international goodwill. TFG destroyed it in a shade over a month. Bonus: Germany and Japan are re-arming themselves",
    "link": "https://www.fark.com/comments/13584460/It-took-a-century-for-US-to-build-up-international-goodwill-TFG-destroyed-it-in-a-shade-over-a-month-Bonus-Germany-Japan-are-re-arming-themselves",
    "timestamp": "2025-03-05T02:42:07Z"
  },
  {
    "title": "GOP Representative Steals Democrat’s Protest Sign During Trump Speech",
    "description": "The radical divide in American politics was on full display during Donald Trump’s address to a joint session of Congress from the very moment he stepped into the upper chamber.\r\nAs the president passed droves of fawning Republican lawmakers, a small protest b…",
    "link": "https://newrepublic.com/post/192326/republican-representative-steals-democrat-protest-sign-trump-speech",
    "timestamp": "2025-03-05T02:40:35Z"
  },
  {
    "title": "Trump Threatens More Tariffs, Vows To End Ukraine Conflict In Congress Address",
    "description": "US President Donald Trump On Tuesday (local time) addressed a joint session of Congress, his first message to both chambers of the legislature since taking office for the second time.",
    "link": "https://www.ndtv.com/world-news/donald-trump-congress-speech-us-president-threatens-more-tariffs-vow-to-end-ukraine-conflict-in-congress-address-7850665",
    "timestamp": "2025-03-05T02:40:29Z"
  },
  {
    "title": "Doug Collins named designated survivor for Trump joint address to Congress (Washington Examiner)",
    "description": "Washington Examiner:\nDoug Collins named designated survivor for Trump joint address to Congress  —  Veterans Affairs Secretary Doug Collins is the designated survivor for President Donald Trump's speech to a joint session of Congress.  —  Collins, a former co…",
    "link": "https://www.memeorandum.com/250304/p176",
    "timestamp": "2025-03-05T02:40:00Z"
  },
  {
    "title": "Trump Speech Interruption: Rep. Al Green Removed From Chamber—Amid Dem Protests",
    "description": "Republicans cheered the congressman’s removal from the House chamber.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/04/trump-speech-interruption-democratic-rep-al-green-removed-from-chamber/",
    "timestamp": "2025-03-05T02:38:50Z"
  },
  {
    "title": "Democratic Congressman Removed From Chamber After Protesting Trump's National Address",
    "description": "\"You have no mandate to cut Medicaid,\" Rep. Al Green yelled while pointing his cane toward Trump.",
    "link": "https://www.huffpost.com/entry/al-green-removed-trump-speech-congress_n_67c7b67de4b094168880f8c0",
    "timestamp": "2025-03-05T02:38:45Z"
  },
  {
    "title": "Kid Rock Trashes Ilhan Omar on Fox Ahead of Trump Address: ‘Put a Basket on Your Head and Walk Back to Where You Came From’",
    "description": "Kid Rock pulled no punches as he ripped into Nancy Pelosi and Ilhan Omar for stunts on Capitol Hill ahead of Trump's speech to Congress Tuesday night.\nThe post Kid Rock Trashes Ilhan Omar on Fox Ahead of Trump Address: ‘Put a Basket on Your Head and Walk Back…",
    "link": "https://www.mediaite.com/news/kid-rock-trashes-ilhan-omar-on-fox-ahead-of-trump-address-put-a-basket-on-your-head-and-walk-back-to-where-you-came-from/",
    "timestamp": "2025-03-05T02:38:24Z"
  },
  {
    "title": "Republican Blasts Mike Johnson Over Government Funding Bill",
    "description": "Johnson is urging Republicans to support a \"clean\" bill to fund the government through September 30.",
    "link": "https://www.newsweek.com/republican-blasts-mike-johnson-over-government-funding-bill-2039699",
    "timestamp": "2025-03-05T02:37:21Z"
  },
  {
    "title": "Gender, Free Speech, Eggs: What Donald Trump Said In First Congress Address",
    "description": "US President Donald Trump began his first address to the US Congress ever since he returned to power by stating that his government has &quot;accomplished more in 43 days, than most administrations accomplish in 4 years or 8 years&quot;.",
    "link": "https://www.ndtv.com/world-news/donald-trump-us-congress-address-live-donald-trumps-top-quotes-at-congress-address-american-dream-is-unstoppable-7850635",
    "timestamp": "2025-03-05T02:37:02Z"
  },
  {
    "title": "Trump Claims Credit for Border Peace",
    "description": "President Donald Trump will claim credit for the halt in southern migration and demand money to send millions of illegal migrants back to their homes.\nThe post Trump Claims Credit for Border Peace appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/03/04/trump-claims-credit-border-peace/",
    "timestamp": "2025-03-05T02:36:43Z"
  },
  {
    "title": "Trump arrives to address US Congress",
    "description": "United States President Donald Trump addressed Congress on Tuesday, stating that his administration is bringing a \"new golden age\" to the US. Speaking to lawmakers, Trump declared, \"America is back.\" ...",
    "link": "https://biztoc.com/x/29393b05b7e3f50b",
    "timestamp": "2025-03-05T02:35:49Z"
  },
  {
    "title": "House Republican Rips Anti-Trump Sign Out of Congresswoman’s Hands as Trump Enters Joint Session",
    "description": "Rep. Melanie Stansbury (D-NM) held up a small sign as a protest Tuesday evening as President Donald Trump entered the joint session of Congress until a Republican colleague snatched it from her hands.\nThe post House Republican Rips Anti-Trump Sign Out of Cong…",
    "link": "https://www.mediaite.com/trump/house-republican-rips-anti-trump-sign-out-of-congresswomans-hands-as-trump-enters-joint-session/",
    "timestamp": "2025-03-05T02:35:15Z"
  },
  {
    "title": "Donald Trump Congress Speech: Here is what he announced about rising egg prices and relief measures",
    "description": "President Trump's address to Congress will highlight a $1-billion plan to tackle the high cost of eggs due to a bird flu crisis. The plan includes direct farmer relief, biosecurity enhancements, and increased egg imports to stabilize prices. Egg prices have s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-congress-speech-rising-egg-prices-key-announcements-and-relief-measures/articleshow/118721535.cms",
    "timestamp": "2025-03-05T02:33:32Z"
  },
  {
    "title": "Judge orders longer-term nationwide block on Trump orders on transgender youth health care",
    "description": "A federal judge has extended a nationwide block on President Donald Trump’s executive orders halting federal funding for providers of gender-affirming health care for transgender people under age 19.",
    "link": "https://www.wsls.com/news/politics/2025/03/05/second-judge-orders-longer-term-block-on-trump-orders-on-transgender-youth-health-care/",
    "timestamp": "2025-03-05T02:32:07Z"
  },
  {
    "title": "Raucous start as President Donald Trump addresses joint session of Congress",
    "description": "President Donald Trump addresses a joint session of Congress, the first of his second term since assuming office six weeks ago, as he lays out his domestic...",
    "link": "https://www.upi.com/Top_News/US/2025/03/04/president-Donald-Trump-address-joint-session-congress/7741741134024/",
    "timestamp": "2025-03-05T02:31:48Z"
  },
  {
    "title": "GOP lawmaker rips protest sign out of Dem's hand moments before Trump speech: video",
    "description": "As President Donald Trump entered Congress to deliver his first speech to the body following his re-election to office, a chaotic moment occurred on the House floor in which a member forcibly ripped a sign out of another's hand.Rep. Melanie Stansbury (D-NM) w…",
    "link": "https://www.rawstory.com/melanie-stansbury/",
    "timestamp": "2025-03-05T02:31:09Z"
  },
  {
    "title": "America is back! Trump commences his major address to Congress amid chants of \"USA, USA!\"",
    "description": "In his first address to Congress, President Trump claimed his administration achieved more in 43 days than others in years, highlighting the success of the American Dream and the country's imminent comeback. The speech comes amid economic declines due to tari…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/america-is-back-trump-commences-his-major-address-to-congress-amid-chants-of-usa-usa/articleshow/118721462.cms",
    "timestamp": "2025-03-05T02:30:16Z"
  },
  {
    "title": "Trump's 'Crypto Reserve' Is Such Brazen Corruption",
    "description": "Trump plans to use your money to buy fake money – benefiting the crypto donors who helped put him back in the White House.",
    "link": "https://zeteo.com/p/trumps-crypto-reserve-is-such-brazen",
    "timestamp": "2025-03-05T02:30:15Z"
  },
  {
    "title": "Trump's tariffs will impact what businesses buy — and sell you — worldwide",
    "description": "U.S. President Donald Trump's long-threatened tariffs are here, plunging the country into an escalating trade war with China, Canada and Mexico. Trump’s 25% tariffs on imports from Canada and Mexico went into effect Tuesday, along with a heightened 20% levy o…",
    "link": "https://japantoday.com/category/business/trump%27s-tariffs-are-now-in-effect.-they%27ll-impact-what-businesses-buy-%E2%80%94-and-sell-you-%E2%80%94-worldwide",
    "timestamp": "2025-03-05T02:30:04Z"
  },
  {
    "title": "Micheál Martin to get advice from Keir Starmer on dealing with Donald Trump",
    "description": "Taoiseach Micheál Martin is to get ­advice from UK prime minister Keir Starmer on how to handle an increasingly volatile Donald Trump.",
    "link": "https://www.independent.ie/irish-news/politics/micheal-martin-to-get-advice-from-keir-starmer-on-dealing-with-donald-trump/a611355887.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Digging into claim that Obama created DOGE and Trump just renamed it",
    "description": "Elon Musk, the public face of the Department of Government Efficiency, shared a claim that said the initiative has roots in an Obama-era entity.",
    "link": "https://www.snopes.com//news/2025/03/05/trump-doge-obama/",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Arab leaders meet to unveil Gaza reconstruction plan in response to Donald Trump’s displacement threat",
    "description": "Leaders of Arab countries are meeting in Cairo to endorse a Gaza reconstruction plan to counter the controversial ideas of US president Donald Trump, though a number of crucial details need to be ironed out before the proposal is finalised.",
    "link": "https://www.independent.ie/world-news/middle-east/arab-leaders-meet-to-unveil-gaza-reconstruction-plan-in-response-to-donald-trumps-displacement-threat/a384552718.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Zelensky opens door for US minerals deal in bid to get Trump back onside",
    "description": "The US and Ukraine could be poised to sign a much-debated minerals deal after Ukrainian president Volodymyr Zelensky said last week’s disastrous Oval Office clash with US president Donald Trump was “regrettable”.",
    "link": "https://www.independent.ie/world-news/europe/zelensky-opens-door-for-us-minerals-deal-in-bid-to-get-trump-back-onside/a506060283.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "The Irish Independent’s view: Making Zelensky villain of the piece is a deception too far",
    "description": "According to Donald Trump, he has been “tested and challenged more than any president in our 250-year history”. In the wider world, his trials are shamefully trifling compared with those of Ukrainian president Volodymyr Zelensky.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-making-zelensky-villain-of-the-piece-is-a-deception-too-far/a1636499671.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Letters: Trump’s recent theatrics are doing particularly well with one happy audience",
    "description": "Whatever about the Nobel Peace Prize, which Donald Trump has said he wants to win, the US president must be a sure bet now for the Order of Lenin (‘Trump pauses all military aid to Ukraine after White House clash with Zelensky’, Independent.ie, March 4).",
    "link": "https://www.independent.ie/opinion/letters/letters-trumps-recent-theatrics-are-doing-particularly-well-with-one-happy-audience/a1351398881.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Stock markets across the west slide as Donald Trump’s tariff reality finally kicks in",
    "description": "Irish and European shares fell sharply yesterday, joining a global sell-off after US tariffs on Canada, Mexico and China took effect and as the White House has promised further anti-trade measures, including against the EU.",
    "link": "https://www.independent.ie/business/world/stock-markets-across-the-west-slide-as-donald-trumps-tariff-reality-finally-kicks-in/a1885079763.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Another ECB rate cut to benefit 130,000 homeowners with tracker mortgages",
    "description": "The European Central Bank (ECB) is set to deliver a sixth interest rate cut in a move that will benefit about 130,000 householders with tracker mortgages.",
    "link": "https://www.independent.ie/business/money/another-ecb-rate-cut-to-benefit-130000-homeowners-with-tracker-mortgages/a357886266.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Senan Molony: Why Micheál Martin won’t be waving any red flags to a bullish Donald Trump when he visits the White House",
    "description": "Taoiseach Micheál Martin and British prime minister Keir Starmer will meet face-to-face in Liverpool, the most Irish city in England, for a British-Irish summit tomorrow.",
    "link": "https://www.independent.ie/opinion/analysis/senan-molony-why-micheal-martin-wont-be-waving-any-red-flags-to-a-bullish-donald-trump-when-he-visits-the-white-house/a1827741701.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Micheál Martin to get advice from Keir Starmer on dealing with Donald Trump",
    "description": "Taoiseach Micheál Martin is to get ­advice from UK prime minister Keir Starmer on how to handle an increasingly volatile Donald Trump.",
    "link": "https://www.independent.ie/irish-news/micheal-martin-to-get-advice-from-keir-starmer-on-dealing-with-donald-trump/a611355887.html",
    "timestamp": "2025-03-05T02:30:00Z"
  },
  {
    "title": "Democrat Removed as House Chamber Erupts into Chaos During Trump Speech",
    "description": "Mike Johnson removed House Democrat Al Green from the chamber after disruptions during President Trump's speech on Tuesday.",
    "link": "https://www.newsweek.com/democrat-removed-house-chamber-erupts-chaos-during-trump-speech-2039702",
    "timestamp": "2025-03-05T02:29:52Z"
  },
  {
    "title": "China aims for 5% economic growth despite challenges",
    "description": "Xi Jinping's government hopes to see a 5% economic growth in 2025, the same goal as 2024, despite slowing consumer demand at home and what looks like a new trade war with Trump.",
    "link": "https://www.dw.com/en/china-aims-for-5-economic-growth-despite-challenges/a-71828988",
    "timestamp": "2025-03-05T02:26:00Z"
  },
  {
    "title": "Trump declares 'America is back' in speech before Congress",
    "description": "President Donald Trump traveled to Capitol Hill Tuesday evening to deliver his first address before a joint session of Congress since his return to the Oval Office in January.",
    "link": "https://www.foxnews.com/politics/trump-declares-america-back-speech-before-congress",
    "timestamp": "2025-03-05T02:25:34Z"
  },
  {
    "title": "Trump Leaves White House to Deliver Address to US Congress",
    "description": "President Donald Trump will speak before a joint session of Congress on Tuesday, over a month into his unprecedented second term that’s already ushered in turmoil across the federal workforce and sparked consternation among allies.\nTrump has levied new tariff…",
    "link": "https://biztoc.com/x/01a5646b109553e8",
    "timestamp": "2025-03-05T02:24:35Z"
  },
  {
    "title": "The Oval Office blowup: What went wrong and how to fix it",
    "description": "The world may have underestimated this incident's significance due to media spin and partisan bias by those more focused on political allegiances.",
    "link": "https://www.japantimes.co.jp/commentary/2025/03/05/world/the-oval-office-blowup/",
    "timestamp": "2025-03-05T02:24:00Z"
  },
  {
    "title": "US dollar pressured by Trump trade war as China NPC begins",
    "description": "The U.S. dollar approached a three-month low as new tariffs from the U.S., Canada, and China heightened trade war fears. Chinese yuan surged with a stable 5% growth target. The euro hit near four-month highs due to a proposed German infrastructure fund. Crude…",
    "link": "https://economictimes.indiatimes.com/markets/forex/us-dollar-pressured-by-trump-trade-war-as-china-npc-begins/articleshow/118721664.cms",
    "timestamp": "2025-03-05T02:23:13Z"
  },
  {
    "title": "Trump says administration 'just getting started'",
    "description": "US President Donald Trump has addressed a joint session of Congress six weeks after he returned to the White House. His record long speech celebrated his decisions, saying that \"America is back.\" DW has the latest.",
    "link": "https://www.dw.com/en/trump-says-administration-just-getting-started/live-71815384",
    "timestamp": "2025-03-05T02:22:00Z"
  },
  {
    "title": "US: Trump addresses joint Congress session",
    "description": "US President Donald Trump is speaking to a joint session of Congress six weeks after he returned to the White House. His flurry of executive orders and cuts to services have sparked widespread anger. DW has the latest.",
    "link": "https://www.dw.com/en/us-trump-addresses-joint-congress-session/live-71815384",
    "timestamp": "2025-03-05T02:22:00Z"
  },
  {
    "title": "Trump Admin To Review $5 Billion in Columbia Grant Funding, Citing Ivy League School's 'Apparent Failure' To Address Anti-Semitism",
    "description": "The Trump administration’s multi-agency task force to combat anti-Semitism is launching a review of Columbia University's contracts and grants, citing the Ivy League institution's \"apparent failure\" to protect Jewish students. It will probe more than $5 billi…",
    "link": "https://freerepublic.com/focus/f-news/4302140/posts",
    "timestamp": "2025-03-05T02:20:38Z"
  },
  {
    "title": "Tariff-exposed stocks feel the squeeze as trade war heats up",
    "description": "U.S. stocks faced significant pressure following the latest escalation in the trade war, with new tariffs on imports from Canada and Mexico impacting sectors like automobiles, aerospace, retail, and housing. Automakers, homebuilders, and airline stocks notabl…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-exposed-stocks-feel-the-squeeze-as-trade-war-heats-up/articleshow/118721599.cms",
    "timestamp": "2025-03-05T02:17:15Z"
  },
  {
    "title": "Trump tariff uncertainty overshadows growth promises: analysts",
    "description": "by Beiyi SEOWPresident Donald Trump's tariffs and the retaliation they attracted will likely weigh on US growth and boost inflation, according to analysts, but, beyond that, uncertainty surrounding the levies threatens to overshadow optimism about his future …",
    "link": "https://www.rawstory.com/trump-tariffs-2671267110/",
    "timestamp": "2025-03-05T02:16:58Z"
  },
  {
    "title": "Judge blocks Trump's anti-transgender health care order",
    "description": "A federal judge in Maryland has issued a preliminary injunction against Donald Trump’s executive order threatening loss of federal funding for medical professionals and institutions that provide gender-affirming care to trans people under 19. That means the p…",
    "link": "https://www.advocate.com/news/anti-transgender-health-order-blocked",
    "timestamp": "2025-03-05T02:16:36Z"
  },
  {
    "title": "Trump's tariff chaos, briefly explained (Vox)",
    "description": "Vox:\nTrump's tariff chaos, briefly explained  —  The president took the global economy for a ride on Tuesday. … Donald Trump paused military aid to Ukraine on Monday night, a freeze that would fully undercut Ukraine's position ahead of planned peace talks wit…",
    "link": "https://www.memeorandum.com/250304/p173",
    "timestamp": "2025-03-05T02:15:01Z"
  },
  {
    "title": "Watch Live: Donald Trump Addresses Joint Session of Congress",
    "description": "President Donald Trump addresses a joint session of Congress on Tuesday, March 4.\nThe post Watch Live: Donald Trump Addresses Joint Session of Congress appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/04/watch-live-donald-trump-addresses-joint-session-of-congress/",
    "timestamp": "2025-03-05T02:14:49Z"
  },
  {
    "title": "CNN’s John King Says It’s ‘Not Fair’ to Expect Trump to Lower Costs on Day One: ‘The President Exaggerates’",
    "description": "CNN anchor John King told viewers it's \"not fair\" to judge Trump on his promise to immediately lower prices because \"the president exaggerates a lot.\"\nThe post CNN’s John King Says It’s ‘Not Fair’ to Expect Trump to Lower Costs on Day One: ‘The President Exag…",
    "link": "https://www.mediaite.com/news/cnns-john-king-says-its-not-fair-to-expect-trump-to-lower-costs-on-day-one-the-president-exaggerates/",
    "timestamp": "2025-03-05T02:14:44Z"
  },
  {
    "title": "Trump addresses US Congress: LIVE UPDATES",
    "description": "US President Donald Trump is delivering a speech to Congress, which he previewed as being “big” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613637-trump-makes-big-announcement/",
    "timestamp": "2025-03-05T02:14:06Z"
  },
  {
    "title": "Trump’s tariffs on Canada and Mexico just went into effect. Here are the products that could suddenly get more expensive",
    "description": "Trump’s tariffs on Canada and Mexico just went into effect. Here are the products that could suddenly get more expensive\nPresident Donald Trump on Tuesday instituted tariffs on three of its biggest trading partners, Mexico, Canada and China.\nAndrew Harnik—Get…",
    "link": "https://biztoc.com/x/cb056e9107b03e8a",
    "timestamp": "2025-03-05T02:13:34Z"
  },
  {
    "title": "US officials investigate brothers charged with human trafficking",
    "description": "TALLAHASSEE, FLORIDA — Florida's attorney general announced Tuesday that his office has opened a criminal investigation into Andrew and Tristan Tate, brothers who are charged with human trafficking in Romania, days after they returned to the United States.\n\n\n…",
    "link": "https://www.voanews.com/a/us-officials-investigate-brothers-charged-with-human-trafficking/7998201.html",
    "timestamp": "2025-03-05T02:13:29Z"
  },
  {
    "title": "Ivanka Trump Wears 3D Floral Oscar de la Renta Suit for President Donald Trump’s Address to Congress",
    "description": "Ivanka Trump wore a floral Oscar de la Renta suit on March 4 aligning with the American Dream theme of Donald Trump's 2025 speech to address Congress.",
    "link": "http://wwd.com/pop-culture/celebrity-news/ivanka-trump-floral-suit-congress-address-1237021817/",
    "timestamp": "2025-03-05T02:13:28Z"
  },
  {
    "title": "Oil falls as OPEC+ plans to raise output, U.S. tariffs hammer sentiment",
    "description": "Oil prices dropped for a third consecutive session as major producers plan to raise output in April, amidst concerns that U.S. tariffs on Canada, Mexico, and China will hamper economic growth and fuel demand. Brent futures fell to $70.89 a barrel and U.S. Wes…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-falls-as-opec-plans-to-raise-output-u-s-tariffs-hammer-sentiment/articleshow/118721549.cms",
    "timestamp": "2025-03-05T02:11:33Z"
  },
  {
    "title": "Trump’s tariffs unleash ‘existential fight’ for Canada",
    "description": "Even if blanket tariffs are revoked, more tailored levies are likely to persist, stoking inflation, analysts say.",
    "link": "https://www.aljazeera.com/economy/2025/3/5/trumps-tariffs-unleash-existential-fight-for-canada",
    "timestamp": "2025-03-05T02:09:53Z"
  },
  {
    "title": "Trump cuts to NOAA already felt in San Diego",
    "description": "Cuts to the National Oceanic and Atmospheric Administration affect research and sea monitoring partnerships between NOAA and Scripps Institution of Oceanography.",
    "link": "https://www.kpbs.org/news/science-technology/2025/03/04/trump-cuts-to-noaa-already-felt-in-san-diego",
    "timestamp": "2025-03-05T02:07:38Z"
  },
  {
    "title": "US, Canadian officials in talks to possibly roll back Trump's tariffs, WSJ reports",
    "description": "The United States and Canadian officials are in talks about reducing or lifting tariffs that President Donald",
    "link": "https://www.jpost.com/breaking-news/article-844750",
    "timestamp": "2025-03-05T02:06:54Z"
  },
  {
    "title": "'America is back' Trump declares in first address",
    "description": "Trump touted his barrage of executive orders and actions as a massive success for America, second only to George Washington.",
    "link": "https://www.jpost.com/breaking-news/article-844748",
    "timestamp": "2025-03-05T02:05:16Z"
  },
  {
    "title": "‘Daredevil: Born Again’ TV Review: Disney+’s Long Awaited Man Without Fear Series Is Fearless & Trump 2.0 Timely",
    "description": "After several years of teasing cameos, Marvel’s the Man without Fear is finally back in Daredevil: Born Again and the Disney+ show’s timing is fearlessly fantastic. As Donald Trump prepares to address Congress tonight amidst tariffs, stock market slump and da…",
    "link": "http://deadline.com/2025/03/daredevil-born-again-review-1236309328/",
    "timestamp": "2025-03-05T02:01:00Z"
  },
  {
    "title": "Solana (SOL) Crashes 15% After Massive Profit-Taking Spike",
    "description": "On-chain data shows that investors on the Solana network participated in significant profit-taking ahead of the asset’s latest retrace. Solana Realized Profit Registered A Sharp Spike Yesterday According to data from the on-chain analytics firm Glassnode, the…",
    "link": "http://www.newsbtc.com/news/solana/solana-sol-crashes-15-massive-profit-taking-spike/",
    "timestamp": "2025-03-05T02:00:26Z"
  },
  {
    "title": "'She’s big doggin’ it': MAGA congressman takes a shot at Pam Bondi after 'stupid move'",
    "description": "Rep. Tim Burchett (R-TN) didn’t hide his views of Attorney General Pam Bondi, who he blasted on a right-wing podcast over her bombshell announcement that “blew up in her face\" last week when Bondi promised to release new Jeffrey Epstein files that never came.…",
    "link": "https://www.rawstory.com/pam-bondi-2671266530/",
    "timestamp": "2025-03-05T02:00:19Z"
  },
  {
    "title": "California’s Newsom Finally Bows to Trump’s Forest Wisdom – And It’s About Time!",
    "description": "The irony is thicker than the smoke over LA. For years, Newsom and his crew insisted they’d “surged” brush-clearing efforts since he took office in 2019. Yet here we are, with the governor admitting it’s not enough—implicitly conceding that Trump’s critique h…",
    "link": "https://wattsupwiththat.com/2025/03/04/californias-newsom-finally-bows-to-trumps-forest-wisdom-and-its-about-time/",
    "timestamp": "2025-03-05T02:00:00Z"
  },
  {
    "title": "‘Daredevil: Born Again’ Review: Disney+ Sequel Series Is Slightly Less Dark but Keeps the Crushing Violence",
    "description": "Showrunner Dario Scardapane keeps Charlie Cox and Vincent D’Onofrio at the center of a disturbingly topical political thriller\nThe post ‘Daredevil: Born Again’ Review: Disney+ Sequel Series Is Slightly Less Dark but Keeps the Crushing Violence appeared first …",
    "link": "https://www.thewrap.com/daredevil-born-again-review-disney-plus/",
    "timestamp": "2025-03-05T02:00:00Z"
  }
]