[
  {
    "title": "Putin Agrees To Incremental, Temporary Ceasefire While Trump Seeks More Ties With Russia In Phone Call",
    "description": "Putin agreed to an incremental and temporary ceasefire during a marathon phone call with Trump which discussed the possibility of a peace deal.",
    "link": "https://dailycaller.com/2025/03/18/vladimir-putin-donald-trump-ceasefire-russia-ukraine-war/",
    "timestamp": "2025-03-18T18:39:26Z"
  },
  {
    "title": "Trump Spox Karoline Leavitt Hit With Brutal X ‘Community Note’ After Stunning Swipe At US Ally",
    "description": "Karoline Leavitt got hit with a brutal X/Twitter \"Community Note\" after she took a stunning shot at longtime ally France in a spat over the Statue of Liberty.\nThe post Trump Spox Karoline Leavitt Hit With Brutal X ‘Community Note’ After Stunning Swipe At US A…",
    "link": "https://www.mediaite.com/news/trump-spox-karoline-leavitt-hit-with-brutal-x-community-note-after-stunning-swipe-at-us-ally/",
    "timestamp": "2025-03-18T18:39:20Z"
  },
  {
    "title": "'We will fight': Anti-woke beer company fires back at beer giant for 'intimidation' amid trademark dispute",
    "description": "A conservative beer company is pushing back after beer giant Anheuser-Busch filed a trademark claim against it after the company went viral for criticizing Bud Light’s association with a transgender influencer. \"Anheuser-Busch has filed a federal trademark op…",
    "link": "https://freerepublic.com/focus/f-news/4305134/posts",
    "timestamp": "2025-03-18T18:39:00Z"
  },
  {
    "title": "Supreme Court chief rebukes Trump over call for judge's impeachment",
    "description": "Supreme Court Justice John Roberts issued a rare public admonishment to President Donald Trump following Trump's call for the impeachment of District Judge James Boasberg. Boasberg had ordered the suspension of deportation flights of alleged illegal migrants,…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/supreme-court-chief-rebukes-trump-over-call-for-judges-impeachment/articleshow/119175126.cms",
    "timestamp": "2025-03-18T18:38:26Z"
  },
  {
    "title": "US Supreme Court chief justice issues rare public rebuke of Trump over judicial threats",
    "description": "The News\nIn a rare public statement Tuesday, US Supreme Court Chief Justice John Roberts criticized President Donald Trump’s calls to impeach a federal judge who ruled against the administration.\nRoberts said the president’s suggestion was “not an appropriate…",
    "link": "https://biztoc.com/x/7d7374662866cd16",
    "timestamp": "2025-03-18T18:37:22Z"
  },
  {
    "title": "Newsom asks for nearly another $3B for state health program overwhelmed by illegal immigrants - NewsBreak",
    "description": "The Newsom administration is asking more money from California lawmakers to patch the state's bloated healthcare budget amid costs from illegal immigrants.",
    "link": "https://www.newsbreak.com/share/3861340468398-newsom-asks-for-nearly-another-3b-for-state-health-program-overwhelmed-by-illegal-immigrants?s=a2&amp;share_destination_id=MjE3MjM4NjM3LTE3NDIzMjI0MjAyMzA%3D&amp;pd=0EhVgzXq&amp;hl=en_US&amp;send_time=1742322420&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2224.43.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-control%2Cns_push_exp_rt_bucketv12-v2%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_blend_exp_25q1-v5%2Cns_local_strategy_25q1_exp-control",
    "timestamp": "2025-03-18T18:37:15Z"
  },
  {
    "title": "Trump Is Explicitly Targeting Legal Residents Based on the Opinions They Express",
    "description": "Although Mahmoud Khalil is a legal permanent resident of the United States, the Trump administration says, he is \"subject to removal\" because Secretary of",
    "link": "https://reason.com/2025/03/19/trump-is-explicitly-targeting-legal-residents-based-on-the-opinions-they-express/",
    "timestamp": "2025-03-18T18:37:06Z"
  },
  {
    "title": "Israel Kills 400 in Gaza, Resuming Bombings After Months of Ceasefire Violations",
    "description": "Israeli forces have unleashed an intense assault across Gaza, killing at least 174 Palestinian children, reports say.",
    "link": "https://truthout.org/articles/israel-kills-400-in-gaza-resuming-bombings-after-months-of-ceasefire-violations/",
    "timestamp": "2025-03-18T18:36:15Z"
  },
  {
    "title": "Hungary passes anti-LGBTQ+ law banning Pride events",
    "description": "Hungarian lawmakers have passed a law banning Pride events and allowing authorities to use facial recognition software to identify attendees.",
    "link": "https://www.pbs.org/newshour/world/hungary-passes-anti-lgbtq-law-banning-pride-events",
    "timestamp": "2025-03-18T18:36:07Z"
  },
  {
    "title": "Italy rejects Franco-British plan to deploy troops to Ukraine",
    "description": "Prime Minister Giorgia Meloni has said she supports US-backed peace talks between Kiev and Moscow Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614429-italy-rejects-ukraine-troop-deployment/",
    "timestamp": "2025-03-18T18:35:43Z"
  },
  {
    "title": "Looks Like Another Trans Attack on a Tesla Dealership",
    "description": "The phenomenon of men who pretend to be women vandalizing Tesla dealerships to punish Elon Musk for exposing Big Government waste and fraud continues. To a list that includes Lucy Grace Nelson and Adam Lansky, it would appear safe to add Erin White: A Buffalo…",
    "link": "https://moonbattery.com/looks-like-another-trans-attack-on-a-tesla-dealership/",
    "timestamp": "2025-03-18T18:35:27Z"
  },
  {
    "title": "Chuck Schumer Mocks Notion That People Resent Spending Money They Earned On Taxes",
    "description": "Democrat Senate Minority Leader Chuck Schumer mocked so-called \"greedy\" Republicans who want to keep the money they earned during an appearance on \"The View.\"",
    "link": "https://dailycaller.com/2025/03/18/chuck-schumer-mocks-money-taxes-the-view/",
    "timestamp": "2025-03-18T18:34:04Z"
  },
  {
    "title": "Former NYPD Inspector: Judge Blocking Deportation Of Terrorists Is ‘Over His Skis’",
    "description": "Paul Mauro told Harris Faulkner the federal judge who demanded flights carrying members of Tren de Aragua (TdA) be turned around was exceeding his authority.",
    "link": "https://dailycaller.com/2025/03/18/former-nypd-inspector-judge-blocking-deportation-of-terrorists-is-over-his-skis/",
    "timestamp": "2025-03-18T18:33:29Z"
  },
  {
    "title": "Jon Stewart criticizes Dems for 'pedaling really hard and not going anywhere,' like stationary bike",
    "description": "Late-night host Jon Stewart compared Democrats to a stationary bike, \"pedaling really hard and not going anywhere,\" on \"The Daily Show\" Monday night.",
    "link": "https://www.foxnews.com/media/jon-stewart-criticizes-dems-pedaling-really-hard-not-going-anywhere-like-stationary-bike",
    "timestamp": "2025-03-18T18:33:00Z"
  },
  {
    "title": "Cuts to Federal Food Aid Are Severing a Lifeline for Natural Disaster Survivors",
    "description": "USDA’s decision to cut $1 billion worth of food aid is causing layoffs and shortfalls, all as hunger continues to climb.",
    "link": "https://grist.org/food-and-agriculture/our-people-are-hungry-usda-federal-food-aid-cuts/",
    "timestamp": "2025-03-18T18:32:57Z"
  },
  {
    "title": "Crypto firms aiming for banking licenses under Trump administration",
    "description": "Fintech and crypto firms are actively pursuing state and national banking licenses under President Donald Trump’s administration to gain regulatory approval that was previously slow to materialize.  According to a Reuters report, industry executives indicate …",
    "link": "https://cryptoslate.com/crypto-firms-aiming-for-banking-licenses-under-trump-administration/",
    "timestamp": "2025-03-18T18:32:48Z"
  },
  {
    "title": "Man Identifying as a Woman Drops Out of Miss Georgia USA Pageant",
    "description": "Miss Buckhead USA 2025, who is a man living as a woman, has decided not to compete in the upcoming Miss Georgia USA pageant.\nThe post Man Identifying as a Woman Drops Out of Miss Georgia USA Pageant appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/18/man-identifying-as-a-woman-drops-out-of-miss-georgia-usa-pageant/",
    "timestamp": "2025-03-18T18:31:36Z"
  },
  {
    "title": "Canada's new prime minister announces Australian radar purchase while visiting edge of Arctic Circle",
    "description": "Canada's new leader will announced a multibillion dollar radar purchase from Australia and an expansion of military operations in the Arctic while visiting Canada’s far north in an effort to assert sovereignty over the increasingly contested region",
    "link": "https://abcnews.go.com/Business/wireStory/canadas-new-prime-minister-announces-australian-radar-purchase-119918267",
    "timestamp": "2025-03-18T18:30:34Z"
  },
  {
    "title": "Massive 200-Foot Texas Sinkhole Grows Rapidly",
    "description": "The sinkhole, which is so wide and deep that it could comfortably contain a four-story building, is feared to still be growing.",
    "link": "https://www.newsweek.com/sinkhole-texas-oil-well-2046579",
    "timestamp": "2025-03-18T18:30:34Z"
  },
  {
    "title": "They worked to prevent violence and terrorism at the agency created after 9/11. Then they got fired",
    "description": "A federal program designed to prevent targeted violence and terrorism in the U.S. has lost 20% of its staff after layoffs hit its probationary staffers",
    "link": "https://abcnews.go.com/US/wireStory/worked-prevent-violence-terrorism-agency-created-after-911-119921754",
    "timestamp": "2025-03-18T18:30:30Z"
  },
  {
    "title": "Appeals court hears arguments over Trump's bid to fire 2 board members",
    "description": "A Justice Department attorney has urged an appeals court to suspend judicial orders favoring two board members who were fired by President Donald Trump from their respective posts in the federal government",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-hears-arguments-trumps-bid-fire-2-119921207",
    "timestamp": "2025-03-18T18:30:28Z"
  },
  {
    "title": "US immigration flights set off terrified international searches for missing loved ones",
    "description": "Weekend flights by U.S. immigration authorities set off a frantic scramble among terrified families after hundreds of immigrants disappeared from the government's online locator for detainees",
    "link": "https://abcnews.go.com/US/wireStory/us-immigration-flights-set-off-terrified-international-searches-119921206",
    "timestamp": "2025-03-18T18:30:26Z"
  },
  {
    "title": "Democratic FCC Commissioner Geoffrey Starks will resign this spring",
    "description": "Federal Communications Commission Chair Brendan Carr could get a Republican majority slightly sooner than expected after Democratic Commissioner Geoffrey Starks announced Tuesday he plans to resign this spring. Starks announced his plans in a statement, but d…",
    "link": "https://www.theverge.com/news/631833/democratic-fcc-commissioner-geoffrey-starks-resigns",
    "timestamp": "2025-03-18T18:30:11Z"
  },
  {
    "title": "Some student loan repayment plans have been suspended. Here's what borrowers should know",
    "description": "The Trump administration's recent changes to student loan programs are causing frustration and confusion for some borrowers.",
    "link": "https://richmond.com/news/nation-world/business/personal-finance/article_6cfaf6cc-0442-5541-a0a9-af167c247ecf.html",
    "timestamp": "2025-03-18T18:30:00Z"
  },
  {
    "title": "How to build resilient water systems in communities battling climate change",
    "description": "Malynndra Tome was helping to map livestock ponds in the Navajo Nation when she saw something that inspired her to act. An elderly woman was filling milk jugs with water at the back of a gas station in the Native American reservation, where about 30% of peopl…",
    "link": "https://www.fastcompany.com/91301026/how-to-build-resilient-water-systems-communities-battling-climate-change",
    "timestamp": "2025-03-18T18:30:00Z"
  },
  {
    "title": "See inside Ellen DeGeneres and Portia de Rossi’s $5 million property",
    "description": "Former talk show star Ellen DeGeneres recently placed one of her California homes on the market for $5 million – as she and wife Portia de Rossi continue to offload their American properties, in pursuit of a full-time life in the United Kingdom.Read more...",
    "link": "https://qz.com/see-inside-ellen-degeneres-5-million-property-1851770739",
    "timestamp": "2025-03-18T18:30:00Z"
  },
  {
    "title": "Did Trump and Putin just take the first step toward ending the Ukraine war? Here's what all has been discussed",
    "description": "Trump and Putin held a nearly three-hour call discussing a Ukraine ceasefire, aiming to end the three-year war. Trump proposed a 30-day ceasefire, while Putin set conditions like Ukraine staying out of NATO. Ukraine remains skeptical, fearing Russia’s true in…",
    "link": "https://economictimes.indiatimes.com/news/international/us/did-trump-and-putin-just-take-the-first-step-toward-ending-the-ukraine-war-heres-what-all-has-been-discussed/articleshow/119173562.cms",
    "timestamp": "2025-03-18T18:29:19Z"
  },
  {
    "title": "Binance CEO reiterates denial of Trump family deal talks",
    "description": "Binance CEO Richard Teng denied reports that Binance.US was in deal talks with entities affiliated with US President Donald Trump during a March 18 panel at Blockworks’ 2025 Digital Asset Summit in New York.Teng’s statement reiterated the position taken by Bi…",
    "link": "https://cointelegraph.com/news/binance-ceo-reiterates-denial-world-liberty-merger-praises-trump",
    "timestamp": "2025-03-18T18:29:18Z"
  },
  {
    "title": "Putin and Trump just concluded their big phone call\n\nHere’s what they talked about (according to the Kremlin)",
    "description": "Putin announced Russia’s willingness to work with the US on a comprehensive, sustainable long-term solution for the Ukrainian conflict (2/7) Russia voiced its concerns about the prospects of a ceasefire, pointing at the poor track record of the Ukrainian lead…",
    "link": "https://freerepublic.com/focus/f-news/4305132/posts",
    "timestamp": "2025-03-18T18:28:59Z"
  },
  {
    "title": "‘Teed Up And Ready to Go’: House Republican Boasts of Four Different Efforts to Impeach Judges Who Ruled Against Trump",
    "description": "U.S. Rep. Eli Crane (R-AZ) boasted about the efforts his fellow House Republicans have made to impeach judges who have blocked President Donald Trump's orders.\nThe post ‘Teed Up And Ready to Go’: House Republican Boasts of Four Different Efforts to Impeach Ju…",
    "link": "https://www.mediaite.com/news/teed-up-and-ready-to-go-house-republican-boasts-of-four-different-efforts-to-impeach-judges-who-ruled-against-trump/",
    "timestamp": "2025-03-18T18:28:57Z"
  },
  {
    "title": "The most likely Medicaid cuts would hit rural areas the hardest",
    "description": "The House Energy and Commerce Committee has been directed to find $880 billion in savings.",
    "link": "https://www.bostonherald.com/2025/03/18/medicaid-cuts-rural-impact/",
    "timestamp": "2025-03-18T18:28:18Z"
  },
  {
    "title": "Danish Petition to Buy California, Rename Disneyland Nears 300k Signatures",
    "description": "The tongue-in-cheek petition was created in response to President Donald Trump's repeated threats to purchase Greenland, a territory of Denmark.",
    "link": "https://www.newsweek.com/california-denamrk-greenland-petition-trump-signatures-2046560",
    "timestamp": "2025-03-18T18:26:14Z"
  },
  {
    "title": "PM Carney planning to hold virtual meeting with premiers on Friday: sources",
    "description": "Prime Minister Mark Carney is aiming to hold his first meeting with Canada's premiers on Friday, sources tell CBC News.",
    "link": "https://www.cbc.ca/news/politics/carney-first-ministers-meeting-1.7486783",
    "timestamp": "2025-03-18T18:26:13Z"
  },
  {
    "title": "Israel's new Gaza offensive: What's different this time",
    "description": "Is the change in the White House the primary difference?",
    "link": "https://www.jpost.com/israel-news/article-846609",
    "timestamp": "2025-03-18T18:26:08Z"
  },
  {
    "title": "Trump Grabs Kennedy Center By The Pussy, Takes It Marble Column Shopping",
    "description": "What do presidents do all day?",
    "link": "https://www.wonkette.com/p/trump-grabs-kennedy-center-by-the",
    "timestamp": "2025-03-18T18:25:45Z"
  },
  {
    "title": "Wall Street should have known better than to trust Donald Trump",
    "description": "Trump has been in office two months and stocks and consumer confidence in the economy are falling while fears of inflation and the risk of a recession are rising.",
    "link": "https://biztoc.com/x/6255c28c85e53721",
    "timestamp": "2025-03-18T18:25:41Z"
  },
  {
    "title": "Putin agrees to 30-day energy infrastructure ceasefire in call with Trump",
    "description": "Russian President Vladimir Putin agreed on Tuesday to a proposal by U.S. President Donald Trump that Russia and Ukraine cease attacking each other's energy infrastructure for 30 days, the Kremlin said following a lengthy phone discussion between the leaders.",
    "link": "https://www.cbc.ca/news/world/us-russia-trump-putin-ukraine-invasion-1.7486333",
    "timestamp": "2025-03-18T18:25:08Z"
  },
  {
    "title": "Bakkt Suffers Major Set Back as Bank Partners Drop Platform",
    "description": "A growth strategy that relies heavily on strategic partnerships can be derailed when those partnerships come to a close. That is happening in real-time to Bakkt Holdings, the digital asset and payments platform, which on Monday (March 17) suffered a significa…",
    "link": "https://www.pymnts.com/cryptocurrency/2025/bakkt-suffers-major-set-back-as-bank-partners-drop-platform/",
    "timestamp": "2025-03-18T18:24:14Z"
  },
  {
    "title": "It’s Time for Ukraine to Accept an Ugly Peace",
    "description": "Seven things for Zelensky to keep in mind as cease-fire negotiations start.",
    "link": "http://foreignpolicy.com/2025/03/18/russia-ukraine-war-ceasefire-peace-negotiations-trump-zelensky-putin/",
    "timestamp": "2025-03-18T18:23:47Z"
  },
  {
    "title": "How Will Federal Workforce Cuts Affect the Economy?",
    "description": "Under Trump, tens of thousands of federal workers have been fired or left voluntarily, but it remains to be seen whether the cuts will have significant economic impact.",
    "link": "https://www.nerdwallet.com/article/finance/federal-job-cuts#article",
    "timestamp": "2025-03-18T18:21:44Z"
  },
  {
    "title": "Live updates: Astronauts Wilmore and Williams return to Earth aboard SpaceX Crew-9",
    "description": "NASA’s Butch Wilmore and Suni Williams, whose weeklong Boeing Starliner mission turned into an extended stay in space, have returned to Earth, splashing down off the coast of Florida around 5:57 p.m. ET. Follow live updates.",
    "link": "https://www.cnn.com/science/live-news/astronauts-space-return-spacex-03-18-25/index.html",
    "timestamp": "2025-03-18T18:21:39Z"
  },
  {
    "title": "When Will the JFK Files Be Released? About All of the Declassified Docs",
    "description": "Shortly after taking office, Donald Trump declassified the records concerning the assassinations of John F. Kennedy, Robert F. Kennedy Sr., and Martin Luther King Jr.",
    "link": "https://hollywoodlife.com/2025/03/18/jfk-declassified-files/",
    "timestamp": "2025-03-18T18:21:05Z"
  },
  {
    "title": "Teslas set on fire with Molotov cocktails and shot with gun in Las Vegas attack",
    "description": "A suspect armed with a gun and Molotov cocktails launched a \"targeted attack\" against a Tesla location in Las Vegas early Tuesday, spray painting \"resist,\" firing three shots and torching multiple cars, authorities said.",
    "link": "https://www.nbcnews.com/news/us-news/teslas-set-fire-molotov-cocktails-shot-las-vegas-attack-rcna196942",
    "timestamp": "2025-03-18T18:21:01Z"
  },
  {
    "title": "Aspinwall police search for man targeting homes with Trump flags or banners",
    "description": "ASPINWALL, Pa. — The Aspinwall Police Department is looking for a man who was caught on camera on two separate occasions targeting homes with flags or banners supporting President Donald Trump. Police have described the acts as politically motivated. Police s…",
    "link": "https://freerepublic.com/focus/f-chat/4305129/posts",
    "timestamp": "2025-03-18T18:20:49Z"
  },
  {
    "title": "Where next for the U.S. economy?",
    "description": "Harvard Kennedy School analyst Jeffrey Frankel includes trade war fallout among five recession threats on the horizon.",
    "link": "https://news.harvard.edu/gazette/story/2025/03/where-next-for-the-u-s-economy/",
    "timestamp": "2025-03-18T18:20:40Z"
  },
  {
    "title": "Some Hospitals Canceled Care for Trans Youth Despite Judge Blocking Trump Order",
    "description": "LGBTQ advocates accuse medical institutions of “obeying in advance” after Trump issued the anti-trans executive order.",
    "link": "https://prismreports.org/2025/03/18/trans-gender-affirming-care-surgeries/",
    "timestamp": "2025-03-18T18:19:25Z"
  },
  {
    "title": "Trump can bring lasting, just peace: Ukrainian foreign minister",
    "description": "Ukraine's foreign minister stated that his country is not hindering a peace agreement with Russia and is hopeful for a \"just and lasting peace\" under US President Donald Trump's leadership. He emphasized Ukraine's expectation for Russia's unconditional accept…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-can-bring-lasting-just-peace-ukrainian-foreign-minister/articleshow/119174477.cms",
    "timestamp": "2025-03-18T18:16:38Z"
  },
  {
    "title": "Man Loses Social Security, Medicare After Being Declared Dead",
    "description": "Ned Johnson of Seattle was declared dead by the government and lost his Social Security and Medicare benefits last month.",
    "link": "https://www.newsweek.com/man-loses-social-security-medicare-after-being-declared-dead-seattle-2046573",
    "timestamp": "2025-03-18T18:16:18Z"
  },
  {
    "title": "Court rules Fani Willis guilty—ordered to pay $54K after obstructing evidence request",
    "description": "Fulton County District Attorney Fani Willis just hit a major roadblock. A judge has ruled that she must pay over $54,000 in legal fees after her office was found guilty of deliberately withholding documents critical to a defense attorney’s case. The ruling st…",
    "link": "https://freerepublic.com/focus/f-bloggers/4305128/posts",
    "timestamp": "2025-03-18T18:15:49Z"
  },
  {
    "title": "Pentagon restores some webpages honoring minority service members but defends DEI purge",
    "description": "The Pentagon says internet pages honoring a Black Medal of Honor winner and Japanese American service members were mistakenly taken down. But it is defending its campaign to strip out content singling out the contributions by women and minority groups.",
    "link": "https://www.pbs.org/newshour/politics/pentagon-restores-some-webpages-honoring-minority-service-members-but-defends-dei-purge",
    "timestamp": "2025-03-18T18:15:13Z"
  },
  {
    "title": "Opinion: Watching Conor McGregor in The White House was dystopian and disturbing",
    "description": "Head of the Dublin Rape Crisis Centre, Rachel Morrogh, says it’s important now that everyone stands with survivors of sexual violence.",
    "link": "https://www.thejournal.ie/readme/conor-mcgregor-donald-trump-6652954-Mar2025/",
    "timestamp": "2025-03-18T18:15:12Z"
  },
  {
    "title": "Donald Trump Promised to Bring Peace to Middle East. Here's How It's Going",
    "description": "Israeli strikes on Gaza and U.S. attacks on Houthis in Yemen have added to regional instability.",
    "link": "https://biztoc.com/x/e1278ec2d2ab6cb9",
    "timestamp": "2025-03-18T18:14:58Z"
  },
  {
    "title": "Jeanette Vizguerra, an undocumented mom once named to Time’s 100 Most Influential list, has been detained by ICE in Colorado",
    "description": "An undocumented mother and high-profile activist was detained by ICE while she was on a work break from her job at Target, her attorney and a family friend say.",
    "link": "https://www.cnn.com/2025/03/18/us/jeanette-vizguerra-detained-ice-colorado/index.html",
    "timestamp": "2025-03-18T18:14:22Z"
  },
  {
    "title": "Donald Trump Promised to Bring Peace to Middle East. Here's How It's Going",
    "description": "Israeli strikes on Gaza and U.S. attacks on Houthis in Yemen have added to regional instability.",
    "link": "https://www.newsweek.com/israel-trump-middle-east-peace-iran-2046510",
    "timestamp": "2025-03-18T18:13:10Z"
  },
  {
    "title": "A dreaded stagflation scenario is increasingly likely — but Trump's tariffs may be more bark than bite",
    "description": "Stocks are down due to fears about slower economic growth and higher prices. However, UBS is still upbeat due to coming clarity about Trump's tariffs.",
    "link": "https://www.businessinsider.com/stock-market-outlook-economy-stagflation-risk-trump-tariff-investing-ubs-2025-3",
    "timestamp": "2025-03-18T18:12:36Z"
  },
  {
    "title": "More Than 1,000 People Could be Fired as EPA Targets Scientific Research Team",
    "description": "More than 1,000 people could be fired as the EPA targets scientists whose work is vital to protecting human health and the environment.",
    "link": "https://time.com/7269209/epa-targets-scientific-research-office-layoffs/",
    "timestamp": "2025-03-18T18:12:01Z"
  },
  {
    "title": "Alex Marlow Exposes Anti-Trump Leftist Activist Judge Who Blocked Gang Member Deportations",
    "description": "The federal judge who moved to block President Trump's deportations of suspected Tren de Aragua (TdA) gang members is an Obama-appointed left-wing activist judge, Breitbart Editor-in-Chief Alex Marlow revealed on The Alex Marlow Show podcast.\nThe post Alex Ma…",
    "link": "https://www.breitbart.com/law-and-order/2025/03/18/alex-marlow-exposes-anti-trump-leftist-activist-judge-who-blocked-gang-member-deportations/",
    "timestamp": "2025-03-18T18:11:46Z"
  },
  {
    "title": "Top US Supreme Court justice rebukes Trump's call to impeach judge",
    "description": "Chief Justice John Roberts issued a rare statement after Trump called for a judge that halted his deportations to be impeached.",
    "link": "https://www.bbc.com/news/articles/c8j0vwpkwkxo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-03-18T18:11:31Z"
  },
  {
    "title": "Cadillac expects one of every three vehicle sales to be EVs in 2025",
    "description": "SAN FRANCISCO — Cadillac expects roughly one of every three vehicles it sells in the U.S. this year to be all-electric models, as the automaker continues to expand its EV lineup despite industrywide slower-than-expected adoption of the vehicles.",
    "link": "https://www.nbcnews.com/business/autos/cadillac-expects-one-every-three-vehicle-sales-evs-2025-rcna196930",
    "timestamp": "2025-03-18T18:11:30Z"
  },
  {
    "title": "Chief Justice John Roberts’ shot across Trump’s bow wasn’t his first",
    "description": "After Trump called for a judge's impeachment, John Roberts expressed his disagreement with the Republican. It was not, however, the first time.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/john-roberts-trump-impeachment-rulings-supreme-court-rcna196944",
    "timestamp": "2025-03-18T18:11:28Z"
  },
  {
    "title": "\"Leaders Spoke Broadly About...\": What White House Said On Trump-Putin Call",
    "description": "During an over two-hour call, US President Donald Trump and his Russian counterpart Vladimir Putin agreed that the war in Ukraine &quot;needs to end with a lasting peace&quot;, the White House said on Tuesday.",
    "link": "https://www.ndtv.com/world-news/leaders-spoke-broadly-about-what-white-house-said-on-trump-putin-call-7954775",
    "timestamp": "2025-03-18T18:10:36Z"
  },
  {
    "title": "How Congress could — but probably won't — impeach a federal judge",
    "description": "The attacks on the judiciary by Donald Trump and his allies have increased in recent days, with calls to impeach a judge who ruled against the president on deportations.",
    "link": "https://www.nbcnews.com/politics/congress/can-congress-impeach-federal-judge-why-it-wont-happen-rcna196937",
    "timestamp": "2025-03-18T18:10:35Z"
  },
  {
    "title": "UCI president David Lappartient vows to stand up to Donald Trump in pitch for top Olympic job",
    "description": "Making his move for International Olympic Committee presidency, Lappartient pledged to make Trump \"respect\" IOC autonomy on issues such as trans athletes and promised decisions would not be made \"from an ideological angle\"",
    "link": "https://road.cc/content/news/uci-president-david-lappartient-stand-trump-313097",
    "timestamp": "2025-03-18T18:10:31Z"
  },
  {
    "title": "Kremlin releases Putin-Trump phone call summary",
    "description": "Putin and Trump addressed key issues, including a proposed 30-day ceasefire, a prisoner exchange, and maritime security Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614436-kremlin-text-phone-trump/",
    "timestamp": "2025-03-18T18:09:46Z"
  },
  {
    "title": "Trump admin moves to fire hundreds of government scientists",
    "description": "The Trump administration is planning significant staff reductions at the EPA, targeting over 1,500 scientists in its research arm. This move aligns with President Trump's aim to reduce government spending and relax environmental regulations. The proposal has …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-admin-moves-to-fire-hundreds-of-government-scientists/articleshow/119174272.cms",
    "timestamp": "2025-03-18T18:09:40Z"
  },
  {
    "title": "Chuck Schumer and Hakeem Jeffries seek to defuse tensions after shutdown clash",
    "description": "The Democratic leaders in the Senate and House sought to strike a unified message on potential GOP cuts to Medicaid, even as they defended their government funding strategies.",
    "link": "https://www.nbcnews.com/politics/congress/schumer-jeffries-defuse-tensions-shutdown-clash-trump-agenda-rcna196918",
    "timestamp": "2025-03-18T18:09:33Z"
  },
  {
    "title": "Ascent for freedom: The man who climbed Big Ben",
    "description": "Day’s courage reflects the acute desperation that so many feel as we question how the leaders of the so-called free world can continue so shamelessly to gaslight us into silence.",
    "link": "https://electronicintifada.net/content/ascent-freedom-man-who-climbed-big-ben/50503",
    "timestamp": "2025-03-18T18:08:29Z"
  },
  {
    "title": "'Tesla Takedown' protest movement grows as Trump threatens criminal charges",
    "description": "Nationwide demonstrations at Elon Musk's car dealerships have earned the attention — and ire — of the White House.",
    "link": "https://theweek.com/politics/tesla-takedown-protests-musk-trump-dealership",
    "timestamp": "2025-03-18T18:08:09Z"
  },
  {
    "title": "Trump Calls for Impeachment of Judge Who Blocked Deportations, Drawing Rebuke from Justice Roberts",
    "description": "President Donald Trump's call for impeachment of the judge who moved to block the deportations of illegal aliens suspected of being in the Venezuelan gang Tren de Aragua has drawn criticism from U.S. Supreme Court Chief Justice John Roberts.  \nThe post Trump …",
    "link": "https://www.breitbart.com/politics/2025/03/18/trump-calls-for-impeachment-judge-who-blocked-deportations-drawing-rebuke-justice-roberts/",
    "timestamp": "2025-03-18T18:06:01Z"
  },
  {
    "title": "Kremlin: Putin ordered a “freeze” on strikes on Ukraine’s energy facilities",
    "description": "Putin and Trump agreed on the exchange of 175 prisoners of war between Moscow and Kyiv - Expert teams are being created for the resolution of conflicts in Ukraine - Initiative for maritime security in the Black Sea - Developments in the Middle East also on th…",
    "link": "https://en.protothema.gr/2025/03/18/kremlin-putin-ordered-a-freeze-on-strikes-on-ukraines-energy-facilities/",
    "timestamp": "2025-03-18T18:05:07Z"
  },
  {
    "title": "Some Americans Have Already Been Caught in Trump’s Immigration Dragnet. More Will Be.",
    "description": "by Nicole Foy \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nAbout a week after President Donald Trump took office, Jonathan Guerrero was sitt…",
    "link": "https://www.propublica.org/article/more-americans-will-be-caught-up-trump-immigration-raids",
    "timestamp": "2025-03-18T18:05:00Z"
  },
  {
    "title": "White House says Trump, Putin are to seek limited ceasefire on energy, infrastructure in Ukraine war",
    "description": "The White House said negotiations would “begin immediately.” It was not immediately clear whether Ukraine is on board with the phased ceasefire plan.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_0ada293e-e328-5f5a-bc1c-c1b59ff43cd4.html",
    "timestamp": "2025-03-18T18:05:00Z"
  },
  {
    "title": "Trump administration set to release JFK assassination files with no redactions",
    "description": "President Donald Trump says files related to the 1963 assassination of President John F. Kennedy will be released without any redactions, making good on a promise he made during his campaign.",
    "link": "https://biztoc.com/x/8167e6e01c443549",
    "timestamp": "2025-03-18T18:03:46Z"
  },
  {
    "title": "Wall Street should have known better than to trust Donald Trump",
    "description": "Trump has been in office two months and stocks and consumer confidence in the economy are falling while fears of inflation and the risk of a recession are rising.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-wall-street-economy-stock-market-rcna196759",
    "timestamp": "2025-03-18T18:03:43Z"
  },
  {
    "title": "China's State Media Celebrates VOA Collapse—'Dirty Rag'",
    "description": "Chinese state media has reacted with glee as President Donald Trump dismantles Voice of America (VOA).\nWhy It Matters\nPresident Donald Trump signed an executive order Sunday to close down U.S. Agency for Global Media (USAGM), which oversees VOA, Radio Free As…",
    "link": "https://biztoc.com/x/799ed655bf0c866c",
    "timestamp": "2025-03-18T18:03:37Z"
  },
  {
    "title": "Trump and Putin may have a deal, but it's a long way from ending the Ukraine war",
    "description": "Trump and Putin agreed to limit attacks on energy and infrastructure, a step on the hard road to ending the war that Russia began.",
    "link": "https://www.businessinsider.com/trump-and-putin-may-have-a-deal-but-its-a-long-way-ukraine-wars-end-2025-3",
    "timestamp": "2025-03-18T18:03:37Z"
  },
  {
    "title": "Trump, Putin agree to seek limited ceasefire in step to ending Ukraine war, White House says",
    "description": "The White House says President Donald Trump and Russian President Vladimir Putin have agreed to seek a limited ceasefire against energy and infrastructure targets in the Russia-Ukraine war.",
    "link": "https://biztoc.com/x/8110290d2ed19094",
    "timestamp": "2025-03-18T18:03:31Z"
  },
  {
    "title": "Trump and Putin Agree To Seek Limited Ceasefire in Ukraine",
    "description": "The White House said Tuesday the U.S. and Russia would seek a partial ceasefire against energy and infrastructure targets in Ukraine.",
    "link": "https://time.com/7269195/trump-putin-limited-ceasefire-ukraine/",
    "timestamp": "2025-03-18T18:03:13Z"
  },
  {
    "title": "Musk conflict complaints appear moot with Trump in charge - Roll Call",
    "description": "Complaints about Elon Musk’s potential conflicts of interest won't go before independent watchdog agencies.",
    "link": "https://rollcall.com/2025/03/18/musk-conflict-complaints-appear-moot-with-trump-in-charge/",
    "timestamp": "2025-03-18T18:02:45Z"
  },
  {
    "title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies",
    "description": "Business-guidance content published during the Biden administration has been removed from the Federal Trade Commission website.",
    "link": "https://www.wired.com/story/federal-trade-commission-removed-blogs-critical-of-ai-amazon-microsoft/",
    "timestamp": "2025-03-18T18:02:32Z"
  },
  {
    "title": "'Inappropriate' Response: Top Court Chief Amid Trump's Call For Impeachment",
    "description": "Donald Trump&#039;s rumbling conflict with the judiciary burst into open confrontation on Tuesday as Supreme Court Justice John Roberts issued a rare public rebuke of the US president over his call for the impeachment of a federal court judge.",
    "link": "https://www.ndtv.com/world-news/inappropriate-response-supreme-court-chief-amid-us-president-donald-trump-call-for-judge-impeachment-7954730",
    "timestamp": "2025-03-18T18:01:51Z"
  },
  {
    "title": "Argentina: despite the scandals, Milei’s politics are here to stay",
    "description": "Argentina’s libertarian president is going through a tough moment, but his politics is here to stay.",
    "link": "https://theconversation.com/argentina-despite-the-scandals-mileis-politics-are-here-to-stay-250183",
    "timestamp": "2025-03-18T18:01:44Z"
  },
  {
    "title": "\"Prisoner Exchange Will Be...\": Kremlin's Full Statement On Trump-Putin Call",
    "description": "US President Donald Trump and his Russian counterpart Vladimir Putin spoke for over two hours during a phone call, discussing ways to end the ongoing war in Ukraine and ways to establish &quot;lasting peace&quot;.",
    "link": "https://www.ndtv.com/world-news/prisoner-exchange-will-be-kremlins-full-statement-on-trump-putin-call-7954727",
    "timestamp": "2025-03-18T18:01:03Z"
  },
  {
    "title": "Trump administration set to release JFK assassination files with no redactions",
    "description": "President Donald Trump says files related to the 1963 assassination of President John F. Kennedy will be released without any redactions, making good on a promise he made during his campaign.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-set-to-release-jfk-assassination-files-with-no-redactions",
    "timestamp": "2025-03-18T17:59:52Z"
  },
  {
    "title": "China, Hong Kong threaten to thwart sale of Panama Canal ports to America's BlackRock",
    "description": "Chinese and Hong Kong authorities are scrutinizing a deal for BlackRock to acquire two ports on the Panama Canal, as the United States seeks to reclaim the Panama Canal.",
    "link": "https://www.foxnews.com/politics/china-hong-kong-threaten-thwart-sale-panama-canal-ports-americas-blackrock",
    "timestamp": "2025-03-18T17:59:51Z"
  },
  {
    "title": "The Constitutional Crisis Under Donald Trump Has Taken A Dangerous Turn",
    "description": "The judge said the administration couldn't send Venezuelan migrants to El Salvador, but the administration claims his oral orders weren't \"enforceable.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-alien-enemies-act-defy-court-orders_n_67d9a657e4b0e54dd7235bb3",
    "timestamp": "2025-03-18T17:59:19Z"
  },
  {
    "title": "Putin Agrees to Energy Infrastructure Ceasefire",
    "description": "\"President Vladimir Putin committed in a phone call with Donald Trump to limit Russian attacks on Ukrainian energy assets but declined to agree to a broader 30-day ceasefire as the US had sought,\" Bloomberg reports.",
    "link": "https://politicalwire.com/2025/03/18/putin-agrees-to-energy-infrastructure-ceasefire/",
    "timestamp": "2025-03-18T17:59:05Z"
  },
  {
    "title": "EPA plans to eliminate scientific research team, could fire more than 1,000 employees",
    "description": "The Environmental Protection Agency plans to eliminate its scientific research team and could fire more than 1,000 scientists and other employees who help provide the scientific foundation for rules safeguarding human health and the environment",
    "link": "https://abcnews.go.com/US/wireStory/epa-plans-eliminate-scientific-research-team-fire-1000-119920334",
    "timestamp": "2025-03-18T17:58:28Z"
  },
  {
    "title": "China's State Media Celebrates VOA Collapse—'Dirty Rag'",
    "description": "\"Whenever your adversary applauds you, stop and reassess,\" Hudson Institute analyst Michael Sobolik told Newsweek.",
    "link": "https://www.newsweek.com/china-state-media-celebrates-us-collapse-voa-2046386",
    "timestamp": "2025-03-18T17:58:28Z"
  },
  {
    "title": "Putin Agrees to Limit Ukraine Attacks But Won’t Commit to Truce",
    "description": "President Vladimir Putin committed in a phone call with Donald Trump to limit Russian attacks on Ukrainian energy assets but declined to agree to a broader 30-day ceasefire as the US had sought.",
    "link": "https://financialpost.com/pmn/business-pmn/putin-agrees-to-limit-ukraine-attacks-but-wont-commit-to-truce",
    "timestamp": "2025-03-18T17:56:55Z"
  },
  {
    "title": "Newsom asks for nearly another $3B for state health program overwhelmed by illegal immigrants - NewsBreak",
    "description": "The Newsom administration is asking more money from California lawmakers to patch the state's bloated healthcare budget amid costs from illegal immigrants.",
    "link": "https://www.newsbreak.com/news/3861340468398-newsom-asks-for-nearly-another-3b-for-state-health-program-overwhelmed-by-illegal-immigrants?noAds=1&amp;_f=app_share&amp;s=i2",
    "timestamp": "2025-03-18T17:56:26Z"
  },
  {
    "title": "White House releases key details of phone call between Donald Trump and Vladimir Putin",
    "description": "The White House has released key details of a phone call between Donald Trump and Vladimir Putin",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-vladimir-putin-phone-call-011201-20250318",
    "timestamp": "2025-03-18T17:55:57Z"
  }
]