[
  {
    "title": "Trump hires new White House ballroom architect (Washington Post)",
    "description": "Washington Post:\nTrump hires new White House ballroom architect  —  Although the two had clashed over the size of the project, the decisive factor was the small firm's limited capacity to handle such an enormous project. … President Donald Trump has replaced …",
    "link": "https://www.memeorandum.com/251204/p92",
    "timestamp": "2025-12-04T20:30:03Z"
  },
  {
    "title": "Trump invites ‘cute’ Japanese kei trucks to come to America",
    "description": "Tiny kei trucks from Japan have a new fan: President Donald Trump. Trump expressed admiration for the pint-sized autos during a briefing with reporters to announce his plan to gut fuel economy standards. “They’re very small. They’re really cute,” Trump said. …",
    "link": "https://www.theverge.com/news/838563/trump-kei-truck-authorize-cute-usdot",
    "timestamp": "2025-12-04T20:29:44Z"
  },
  {
    "title": "Man arrested in January 6 US Capitol pipe-bomb case",
    "description": "A man has been arrested for allegedly planting pipe bombs near the Democratic and Republican party headquarters on the eve of the 6 January 2021 US Capitol riot, officials said.",
    "link": "https://www.rte.ie/news/world/2025/1204/1547351-capital-riots-arrest/",
    "timestamp": "2025-12-04T20:29:17Z"
  },
  {
    "title": "Boat Attack Commander Says He Had To Kill 2 Survivors Because They Were Still Trying To Smuggle Cocaine",
    "description": "Adm. Frank M. Murphy reportedly told lawmakers a controversial second strike was necessary because drugs on the burning vessel remained a threat.",
    "link": "https://reason.com/2025/12/04/boat-attack-commander-says-he-had-to-kill-2-survivors-because-they-were-still-trying-to-smuggle-cocaine/",
    "timestamp": "2025-12-04T20:28:52Z"
  },
  {
    "title": "Trump said 'we appreciate' that Colombia sells cocaine to the US",
    "description": "U.S. President Donald Trump said: \"I hear Colombia, the country of Colombia, is making cocaine. They have cocaine manufacturing plants, OK? And then they sell us their cocaine. We appreciate that very much.\"",
    "link": "https://www.snopes.com//fact-check/trump-colombia-cocaine-us/",
    "timestamp": "2025-12-04T20:28:00Z"
  },
  {
    "title": "Eurovision in turmoil as countries stage boycott over Israel’s place in contest",
    "description": "Broadcasters from multiple European countries officially announce they won't take part in next year's music festival.",
    "link": "https://www.politico.eu/article/eurovision-boycott-crisis-israel-competition-war-gaza-human-rights/",
    "timestamp": "2025-12-04T20:27:45Z"
  },
  {
    "title": "France’s Macron Warned Other Leaders About Potential Trump Betrayal",
    "description": "French President Emmanuel Macron warned Ukrainian President Volodymyr Zelenskiy and other European leaders on a phone call that Donald Trump could betray Ukraine.A transcript of the Monday call to strategize how to protect Ukraine was leaked to the German new…",
    "link": "https://newrepublic.com/post/203995/france-macron-warned-european-leaders-trump-betrayal-ukraine-leaked-call",
    "timestamp": "2025-12-04T20:27:00Z"
  },
  {
    "title": "Putin questions US punishing India for buying Russian oil",
    "description": "\"If the US has the right to buy our fuel, why shouldn't India have the same privilege?\" says Putin.",
    "link": "https://www.channelnewsasia.com/world/putin-questions-us-punishing-india-buying-russian-oil-5558531",
    "timestamp": "2025-12-04T20:27:00Z"
  },
  {
    "title": "Tom Cotton Says U.S. Strikes On Alleged Drug Boat Were ‘Righteous’",
    "description": "The GOP senator claims it was “entirely lawful” that the U.S. military launched a follow-up strike to kill survivors of its first strike in the Sept. 2 attack.",
    "link": "https://www.huffpost.com/entry/tom-cotton-drug-boat-strikes-righteous_n_691e2a8ce4b0b763ab8d809c",
    "timestamp": "2025-12-04T20:26:20Z"
  },
  {
    "title": "Medicare for All Sees Key Polling Shift as Americans Fume Over Surging Private Insurance Premiums",
    "description": "With Affordable Care Act premiums surging and lawmakers on both sides of the political aisle scrambling to cobble together a last-minute fix, recent polling data shows that a strong majority of the American public supports a transformative proposal that few m…",
    "link": "https://www.commondreams.org/news/medicare-for-all-popular",
    "timestamp": "2025-12-04T20:25:49Z"
  },
  {
    "title": "Does scandal sell? Not for Nuzzi's book so far...",
    "description": "Olivia Nuzzi’s memoir, “American Canto,” hit bookstores this week. “We ordered a lot and so far, people have not been beating down the door,” said one bookseller.",
    "link": "https://www.cnn.com/2025/12/03/us/olivia-nuzzi-american-canto-release-cec",
    "timestamp": "2025-12-04T20:25:37Z"
  },
  {
    "title": "Was Harry referencing Trump in joke for Late Show sketch?",
    "description": "Prince Harry appeared in a sketch with Stephen Colbert, auditioning for a \"Christmas prince\" film role.",
    "link": "https://www.bbc.com/news/articles/cx2ejzy1ge1o",
    "timestamp": "2025-12-04T20:25:20Z"
  },
  {
    "title": "Poll: Most on ACA Exchange Can’t Afford Even Modest Increases in Health Costs",
    "description": "Senate Democrats will force a vote next week on whether to extend tax credits for people on the health exchange.",
    "link": "https://truthout.org/articles/poll-most-on-aca-exchange-cant-afford-even-modest-increases-in-health-costs/",
    "timestamp": "2025-12-04T20:24:15Z"
  },
  {
    "title": "Sick obsession",
    "description": "Trump's obsession of blaming Biden for everything is wearing thin....even with Republicans.",
    "link": "https://www.ncspin.com/sick-obsession",
    "timestamp": "2025-12-04T20:22:33Z"
  },
  {
    "title": "The White House’s 2-word nickname for Trump is raising eyebrows",
    "description": "The phrase garnered national attention back in June.",
    "link": "https://www.nj.com/politics/2025/12/the-white-houses-2-word-nickname-for-trump-is-raising-eyebrows.html",
    "timestamp": "2025-12-04T20:21:50Z"
  },
  {
    "title": "Has Trump Pardoned (Alleged) January 6 Pipe Bomber Yet?",
    "description": "Arrest based on 'evidence that had already been gathered' by FBI. Good job, guys.",
    "link": "https://www.wonkette.com/p/has-trump-pardoned-alleged-january",
    "timestamp": "2025-12-04T20:20:59Z"
  },
  {
    "title": "Stephen A. Smith Hangs Up On Caller Who Smears All Republicans As Racist",
    "description": "SiriusXM host Stephen A. Smith hung up on and rebuked a caller on “Straight Shooter with Stephen A.” on Wednesday for claiming every Republican is racist.",
    "link": "https://dailycaller.com/2025/12/04/stephen-a-smith-hangs-up-caller-who-smears-republicans-racist/",
    "timestamp": "2025-12-04T20:18:55Z"
  },
  {
    "title": "Tucker Carlson’s Deepest Desire, Revealed And … Relatable",
    "description": "Tucker Carlson revealed that his deepest desire in life is to go off the grid with his dog in Maine, alone and far from society, to hunt and fish.",
    "link": "https://dailycaller.com/2025/12/04/tucker-carlson-fly-fishing-nature-outdoors-social-media/",
    "timestamp": "2025-12-04T20:18:01Z"
  },
  {
    "title": "FBI Director Kash Patel Ludicrously Declares Trump DOJ ‘Will Always’ Defend Against Those Who ‘Attack Our Nation’s Capitol’",
    "description": "At a press conference Thursday, FBI Director Kash Patel -- who was appointed by a president who pardoned hundreds of Jan. 6 rioters -- made the ludicrous declaration that the Trump administration \"will always refute it and combat it\" when people \"attack our n…",
    "link": "https://www.mediaite.com/opinion/fbi-director-kash-patel-ludicrously-declares-trump-doj-will-always-defend-against-those-who-attack-our-nations-capitol/",
    "timestamp": "2025-12-04T20:16:58Z"
  },
  {
    "title": "Trump’s Prosecutor Picks Are Backfiring, Badly",
    "description": "Republican- and Democratic-appointed judges have repeatedly ruled that his nominees for U.S. attorney are being unlawfully appointed across the country.",
    "link": "https://slate.com/news-and-politics/2025/12/comey-news-trump-prosecutor-fail.html",
    "timestamp": "2025-12-04T20:15:39Z"
  },
  {
    "title": "Trump envoys press plan with Ukraine as sanctions eased on Russia (Agence France-Presse)",
    "description": "Agence France-Presse:\nTrump envoys press plan with Ukraine as sanctions eased on Russia  —  President Donald Trump's envoys were to meet Thursday with Ukrainian negotiators for the third time in two weeks to press his plan to end the war as his administration…",
    "link": "https://www.memeorandum.com/251204/p88",
    "timestamp": "2025-12-04T20:15:02Z"
  },
  {
    "title": "Jimmy Fallon Questions How Melania Could Be Annoyed by Trump’s Ballroom Construction if ‘She Lives 200 Miles Away’ | Video",
    "description": "The president says his wife hasn't been the most \"thrilled\" about the demolition racket\nThe post Jimmy Fallon Questions How Melania Could Be Annoyed by Trump’s Ballroom Construction if ‘She Lives 200 Miles Away’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/melania-trump-ballroom-construction-jimmy-fallon-nbc/",
    "timestamp": "2025-12-04T20:14:58Z"
  },
  {
    "title": "SAVING GEN Z … AND AMERICA",
    "description": "Overcoming the malevolent forces driving today's young people over the edge",
    "link": "https://www.wnd.com/2025/12/saving-gen-z-america/",
    "timestamp": "2025-12-04T20:14:38Z"
  },
  {
    "title": "Last foreign carriers halt flights to Venezuela after Trump’s airspace ban",
    "description": "Copa, Wingo, Satena, and Boliviana halt Venezuela flights, citing navigation signal issues and safety concerns.",
    "link": "https://www.aljazeera.com/news/2025/12/4/last-foreign-carriers-halt-flights-to-venezuela-after-trumps-airspace-ban",
    "timestamp": "2025-12-04T20:14:09Z"
  },
  {
    "title": "EXCLUSIVE: Author Andrew Lownie Defends Source Who Claimed 'Jeffrey Epstein Introduced Donald Trump to Wife Melania' — Even After Being Forced to Cut Allegation Out of Book",
    "description": "The first lady threatened a \"billion-dollar lawsuit\" against Andrew Lownie's book accusations, which the publisher HarperCollins quickly retracted and removed from all future editions.",
    "link": "https://radaronline.com/p/jeffrey-epstein-introduced-donald-trump-melania-book-andrew-lownie-claims/",
    "timestamp": "2025-12-04T20:13:54Z"
  },
  {
    "title": "A Whopping 98% of U.S. Diplomats Report Plummeting Morale Under Trump: Report",
    "description": "Nearly all of America's diplomats feel workplace morale as fallen since President Donald Trump took office, according to a new report.\nThe post A Whopping 98% of U.S. Diplomats Report Plummeting Morale Under Trump: Report first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/a-whopping-98-of-u-s-diplomats-report-plummeting-morale-under-trump-report/",
    "timestamp": "2025-12-04T20:13:28Z"
  },
  {
    "title": "Virginia man arrested in January 6 pipe-bomb case",
    "description": "A Virginia man was arrested on Thursday for allegedly planting pipe bombs near the Democratic and Republican party headquarters on the eve of the January 6, 2021 US Capitol riot, officials said. The arrest of Brian Cole Jr, 30, of Woodbridge, Virginia, is the…",
    "link": "https://www.digitaljournal.com/world/virginia-man-arrested-in-january-6-pipe-bomb-case/article",
    "timestamp": "2025-12-04T20:12:20Z"
  },
  {
    "title": "Half of Europeans see high risk of war with Russia: poll",
    "description": "A narrow majority of Europeans in nine countries perceive an elevated risk of war with Russia in the near future, a new poll has found. More felt Donald Trump was acting like an enemy of Europe than a friend.",
    "link": "https://www.dw.com/en/half-of-europeans-see-high-risk-of-war-with-russia-poll/a-75023986",
    "timestamp": "2025-12-04T20:12:00Z"
  },
  {
    "title": "With Hollywood strapped for cash, Saudi Arabia is re-emerging as a key financial backer",
    "description": "Hollywood is feeling the lure of Saudi Arabian money.",
    "link": "https://www.nbcnews.com/pop-culture/pop-culture-news/hollywood-saudi-arabia-key-financial-backer-red-sea-film-festival-rcna246854",
    "timestamp": "2025-12-04T20:11:14Z"
  },
  {
    "title": "Rep. Shri Thanedar Moves to Impeach Defense Secretary Hegseth over Alleged War Crimes in Caribbean Strike",
    "description": "Rep. Shri Thanedar (D-MI) announced Wednesday that he plans to introduce articles of impeachment against Defense Secretary Pete Hegseth, referencing a resurfaced 2016 remark on war crimes as questions mount over a U.S. military strike that killed survivors of…",
    "link": "https://www.breitbart.com/politics/2025/12/04/rep-shri-thanedar-moves-to-impeach-defense-secretary-hegseth-over-alleged-war-crimes-in-caribbean-strike/",
    "timestamp": "2025-12-04T20:10:43Z"
  },
  {
    "title": "Damning New Poll: Americans Say Cost Of Living Is 'Worst They Can Ever Remember'",
    "description": "A rising number of President Donald Trump's own voters think he's responsible for higher prices, according to new data.",
    "link": "https://www.huffpost.com/entry/trump-voters-economy-worst-they-can-remember_n_6931bc5be4b0824b6df854fb",
    "timestamp": "2025-12-04T20:08:53Z"
  },
  {
    "title": "Taiwan Thanks Trump for Signing Law Reviewing Relationship: 'A Firm Symbol of Our Shared Values'",
    "description": "Taiwan thanked President Donald Trump for the Taiwan Assurance Implementation Act, which mandates reviews of the U.S. relationship to Taipei.\nThe post Taiwan Thanks Trump for Signing Law Reviewing Relationship: ‘A Firm Symbol of Our Shared Values’ appeared fi…",
    "link": "https://www.breitbart.com/asia/2025/12/04/taiwan-thanks-trump-signing-law-reviewing-relationship-firm-symbol-our-shared-values/",
    "timestamp": "2025-12-04T20:06:28Z"
  },
  {
    "title": "Trump Is Doubling Down on Robotics. Does That Make Tesla Stock a Buy Here?",
    "description": "President Donald Trump’s administration’s aggressive push into robotics has thrust Tesla (TSLA) back into the investment spotlight. Tesla stock climbed modestly on news that Commerce Secretary Howard Lutnick is championing the robotics industry and considerin…",
    "link": "https://biztoc.com/x/18a3807786b6130e",
    "timestamp": "2025-12-04T20:06:10Z"
  },
  {
    "title": "Trump Signs Peace Deal With Congo, Rwanda Leaders",
    "description": "President Donald Trump gathered the leaders of Rwanda and the Democratic Republic of Congo to sign a peace accord and economic agreements with the US, though it’s unclear whether the efforts will resolve a 30-year conflict that continues to fester.\n“They’ve s…",
    "link": "https://biztoc.com/x/8dc109bc21bdf829",
    "timestamp": "2025-12-04T20:06:09Z"
  },
  {
    "title": "He has no relevant experience, sex scandal baggage and a Senate confirmation battle. He was also Mike Johnson’s landlord",
    "description": "The Senate confirmation process for seats on the Tennessee Valley Authority’s board — which oversees the nation’s largest public power utility — is typically uneventful. But the hearing on Wednesday for Lee Beaman, a Nashville-area auto magnate nominated for …",
    "link": "https://biztoc.com/x/0712b40eec5ee18a",
    "timestamp": "2025-12-04T20:06:07Z"
  },
  {
    "title": "Top Democrat Accuses DOJ of ‘Picking and Choosing Facts’ After Pipe Bomber Presser",
    "description": "Mark Warner scoffed at the DOJ's \"victory lap\" over the arrest of the alleged would-be pipe bomber months after Trump pardoned the J6 rioters.\nThe post Top Democrat Accuses DOJ of ‘Picking and Choosing Facts’ After Pipe Bomber Presser first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/top-democrat-accuses-doj-of-picking-and-choosing-facts-after-pipe-bomber-presser/",
    "timestamp": "2025-12-04T20:06:04Z"
  },
  {
    "title": "US prioritizes visas for fans traveling for the World Cup, Olympics and other events",
    "description": "The Trump administration has instructed U.S. embassies and consulates around the world to prioritize visa applications from foreigners wishing to visit the United States to either invest in America or attend the 2026 World Cup, 2028 Olympics and other ...",
    "link": "https://abcnews.go.com/US/wireStory/us-prioritizes-visas-fans-traveling-world-cup-olympics-128119974",
    "timestamp": "2025-12-04T20:06:00Z"
  },
  {
    "title": "Massive U.S. drug spending gives Trump trade leverage",
    "description": "Since coming into office again, U.S. President Donald Trump has targeted pharmaceuticals as an industry that he says treats the U.S. unfairly.\nAnd when you put U.S. drug spending in a global context, it is easy to see why.",
    "link": "https://biztoc.com/x/6c98a5b1e62a4654",
    "timestamp": "2025-12-04T20:05:42Z"
  },
  {
    "title": "Trump endorses close ally's twin brother in race for Texas congressional seat",
    "description": "President Donald Trump Trump endorses Trever Nehls for Texas' 22nd Congressional District, a seat currently held by his twin brother, Rep. Troy Nehls.",
    "link": "https://www.foxnews.com/politics/trump-endorses-close-allys-twin-brother-race-texas-congressional-seat",
    "timestamp": "2025-12-04T20:04:56Z"
  },
  {
    "title": "Was Elon in the room where it happened? This senator still wants to know",
    "description": "As he did eight months ago, Sen. Ed Markey asked Jared Isaacman if Elon Musk was in the room when President Trump first offered him the job of NASA chief. And, once again, Isaacman demurred.",
    "link": "https://www.space.com/space-exploration/was-elon-in-the-room-where-it-happened-this-senator-still-wants-to-know",
    "timestamp": "2025-12-04T20:00:00Z"
  },
  {
    "title": "What the Health? From KFF Health News: The GOP Still Can’t Agree on a Health Plan",
    "description": "Senate Democrats were promised a vote by mid-December on extending enhanced Affordable Care Act subsidies, but Republicans still can’t decide whether they want to put forward their own alternative or what that might include. Meanwhile, the CDC and FDA are roi…",
    "link": "https://kffhealthnews.org/news/podcast/what-the-health-425-republicans-obamacare-aca-subsidies-cdc-fda-vaccines-december-4-2025/",
    "timestamp": "2025-12-04T20:00:00Z"
  },
  {
    "title": "Mailbag: What do we make of Henry Cejudo’s career?",
    "description": "Answering reader questions about Henry Cejudo, the new Paramount deal, and more.",
    "link": "https://www.mmafighting.com/latest-news/459522/mailbag-what-do-we-make-of-henry-cejudos-career",
    "timestamp": "2025-12-04T20:00:00Z"
  },
  {
    "title": "Trump Accidentally Lets Slip Plan to Rename Kennedy Center",
    "description": "President Donald Trump “accidentally” let slip on Thursday the next target for Trumpification: the Kennedy Center. “You have a big event on Friday at the Trump-Kennedy Center—op, excuse me. The Kennedy Center,” Trump said with a laugh. “Pardon me, such a terr…",
    "link": "https://newrepublic.com/post/203989/trump-rename-kennedy-center-after-himself",
    "timestamp": "2025-12-04T19:59:05Z"
  },
  {
    "title": "Is This the Fastest Indictment-to-Pardon Turnaround in History?",
    "description": "Not even my cynical mind could conceive of Trump’s most recent recipient.",
    "link": "https://www.esquire.com/news-politics/politics/a69635943/tim-leiweke-trump-pardon/",
    "timestamp": "2025-12-04T19:57:00Z"
  },
  {
    "title": "Congo, Rwanda leaders affirm commitment to Trump-backed peace deal",
    "description": "Washington is keen to secure better access to natural resources in Congo and counter Chinese dominance in critical minerals",
    "link": "https://www.irishtimes.com/world/africa/2025/12/04/congo-rwanda-leaders-affirm-commitment-to-trump-backed-peace-deal/",
    "timestamp": "2025-12-04T19:56:25Z"
  },
  {
    "title": "Rand Paul joins Dems on 'war powers resolution' claiming Trump admin could soon strike Venezuelan territory",
    "description": "Republican Sen. Rand Paul joined Democrats Chuck Schumer, Adam Schiff and Tim Kaine on a war powers resolution to block potential U.S. strikes in Venezuela.",
    "link": "https://www.foxnews.com/politics/rand-paul-joins-dems-war-powers-resolution-claiming-trumo-admin-could-soon-strike-venezuelan-territory",
    "timestamp": "2025-12-04T19:55:21Z"
  },
  {
    "title": "AI chatbots can sway voters better than political advertisements",
    "description": "In 2024, a Democratic congressional candidate in Pennsylvania, Shamaine Daniels, used an AI chatbot named Ashley to call voters and carry on conversations with them. “Hello. My name is Ashley, and I’m an artificial intelligence volunteer for Shamaine Daniels’…",
    "link": "https://www.technologyreview.com/2025/12/04/1128824/ai-chatbots-can-sway-voters-better-than-political-advertisements/",
    "timestamp": "2025-12-04T19:54:57Z"
  },
  {
    "title": "Trump’s immigration message collides with his welcome to World Cup fans",
    "description": "Friday's World Cup draw at the Kennedy Center in Washington comes at a time when the Republican president has hardened his rhetoric against immigrants. His administration is looking at expanding restrictions on travel to the U.S. for people from 19 countries.",
    "link": "https://www.pbs.org/newshour/politics/trumps-immigration-message-collides-with-his-welcome-to-world-cup-fans",
    "timestamp": "2025-12-04T19:54:46Z"
  },
  {
    "title": "Trump pardons entertainment exec indicted by his own justice department",
    "description": "Donald Trump quietly pardoned on Tuesday a sports and entertainment executive, Tim Leiweke, who was indicted by the president’s own justice department this year.\nLeiweke, who co-founded Oak View Group, was indicted in July for what federal prosecutors alleged…",
    "link": "https://biztoc.com/x/f0f67a93ad2448fc",
    "timestamp": "2025-12-04T19:54:41Z"
  },
  {
    "title": "Trump endorses identical twin of retiring Rep. Troy Nehls to fill his seat",
    "description": "President Donald Trump on Thursday endorsed Trever Nehls, the identical twin of retiring GOP Rep. Troy Nehls, to fill the Texas seat being vacated by his brother. \nIn a post on Truth Social, Trump lauded Troy Nehls for his congressional career, which he spent…",
    "link": "https://biztoc.com/x/78d0743b871273ea",
    "timestamp": "2025-12-04T19:54:41Z"
  },
  {
    "title": "The World Cup draw is usually a spectacle. This time, FIFA hopes bigger is better",
    "description": "A record 64 nations will be in Friday’s World Cup draw, more than 30% of FIFA’s members, as soccer’s leaders insist a bigger tournament is better.",
    "link": "https://sports.yahoo.com/articles/world-cup-draw-usually-spectacle-195319461.html",
    "timestamp": "2025-12-04T19:53:19Z"
  },
  {
    "title": "John Roberts et al, accessories to murder",
    "description": "A point that shouldn’t be overlooked as we continue our learned discussions on whether the late murders ordered by and through Donald Trump are war crimes in addition to being ordinary murders (I tend toward the view that you can’t turn ordinary murder into a…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/12/john-roberts-et-al-accessories-to-murder",
    "timestamp": "2025-12-04T19:50:42Z"
  },
  {
    "title": "Will Netanyahu get a pardon?",
    "description": "Opponents say yes, if he steps down",
    "link": "https://theweek.com/politics/netanyahu-pardon-israel-herzog-corruption",
    "timestamp": "2025-12-04T19:50:36Z"
  },
  {
    "title": "'Shut up': Attorney buries Ghislaine Maxwell's 'appalling' new request",
    "description": "Convicted sex trafficker Ghislaine Maxwell has planned to ask a judge to release her from federal prison, citing concerns over her safety if the Jeffrey Epstein files and grand jury records are released. Arick Fudali, who represents several Epstein survivors,…",
    "link": "https://www.rawstory.com/ghislaine-maxwell-jeffrey-epstein/",
    "timestamp": "2025-12-04T19:49:36Z"
  },
  {
    "title": "Mission for our next president: institute the damnatio memoriae",
    "description": "In yet another pointless sop to his ego, the president has renamed the Institute of Peace after himself. The Trump administration has renamed the U.S. Institute of Peace after President Donald Trump and has planted the president’s name on the organization’s h…",
    "link": "https://freethoughtblogs.com/pharyngula/2025/12/04/mission-for-our-next-president-institute-the-damnatio-memoriae/",
    "timestamp": "2025-12-04T19:49:21Z"
  },
  {
    "title": "Trump Stooge Wants To Bring Back Wood Paneled Station Wagons — And, Oh, The Reactions",
    "description": "Transportation Secretary Sean Duffy waxed nostalgic on bringing back gas guzzlers, but social media didn't share his sentiment.",
    "link": "https://www.huffpost.com/entry/sean-duffys-station-wagon-comeback-wish-sparks-internet-snark_n_6931cabbe4b08d8fed00eba8",
    "timestamp": "2025-12-04T19:49:11Z"
  },
  {
    "title": "Former MLSE boss Leiweke pardoned by Trump months after being indicted",
    "description": "U.S. President Donald Trump pardoned Tim Leiweke on Wednesday, five months after his own justice department indicted the former president and chief executive officer of Maple Leaf Sports and Entertainment.",
    "link": "https://www.cbc.ca/sports/former-mlse-boss-tim-leiweke-pardoned-trump-9.7003413",
    "timestamp": "2025-12-04T19:46:54Z"
  },
  {
    "title": "Stephen A. Smith Rips Trump On Affordability — Praises Dems For ‘Forcing’ Cost Issue",
    "description": "Stephen A. Smith ripped Trump for calling the affordability crisis a \"con job,\" and praised Democrats for forcing Trump \"to play ball\" on the issue.\nThe post Stephen A. Smith Rips Trump On Affordability — Praises Dems For ‘Forcing’ Cost Issue first appeared o…",
    "link": "https://www.mediaite.com/media/tv/stephen-a-smith-rips-trump-on-affordability-praises-dems-for-forcing-cost-issue/",
    "timestamp": "2025-12-04T19:46:14Z"
  },
  {
    "title": "Trump boosts gas cars in fuel economy rollback",
    "description": "What happened\nPresident Donald Trump Wednesday announced that the Transportation Department will roll back automotive fuel efficiency standards finalized last year. “People want the gasoline car,” he said in the Oval Office, with the CEOs of Ford and Stellant…",
    "link": "https://biztoc.com/x/20f3eb565f156398",
    "timestamp": "2025-12-04T19:43:51Z"
  },
  {
    "title": "IMF lays out guidelines for addressing stablecoin risks, beyond regulations",
    "description": "The International Monetary Fund reported on the reserves of the largest stablecoins by market cap and the potential risks of fragmentation in issuers and regulatory approaches.",
    "link": "https://cointelegraph.com/news/imf-guidelines-stablecoin-risks-regulations",
    "timestamp": "2025-12-04T19:43:08Z"
  },
  {
    "title": "FBI Says DC Pipe Bomb Suspect Brian Cole Kept Buying Bomb Parts After Jan. 6",
    "description": "The 30-year-old Virginia resident evaded capture for years after authorities discovered pipe bombs planted near buildings in Washington, DC, the day before the January 6, 2021, Capitol attack.",
    "link": "https://www.wired.com/story/fbi-says-dc-pipe-bomb-suspect-brian-cole-kept-buying-bomb-parts-after-jan-6/",
    "timestamp": "2025-12-04T19:42:18Z"
  },
  {
    "title": "Chatbots Are Surprisingly Effective at Swaying Voters",
    "description": "Could ChatGPT secretly tell you how to cast your ballot?",
    "link": "https://www.theatlantic.com/technology/2025/12/chatbots-changing-votes/685137/",
    "timestamp": "2025-12-04T19:41:25Z"
  },
  {
    "title": "US prioritizes visas for fans traveling for the World Cup, Olympics and other events",
    "description": "The administration also has added new criteria for highly skilled foreign workers.",
    "link": "https://www.bostonherald.com/2025/12/04/trump-visas/",
    "timestamp": "2025-12-04T19:39:26Z"
  },
  {
    "title": "Trump Says It’s OK to Deny Visas to People Who Worked in Fact-Checking",
    "description": "The Trump administration may revoke H-1B visa eligibility from people who worked in content moderation, fact-checking, and online safety. Their family members would lose visa status as well. A cable, dated Tuesday, obtained by Reuters moves U.S. consular offi…",
    "link": "https://newrepublic.com/post/203984/donald-trump-deny-visas-fact-checking",
    "timestamp": "2025-12-04T19:38:52Z"
  },
  {
    "title": "Richard Gere Rages at Trump for 'What He Has Done to This Country'",
    "description": "Actor Richard Gere is once again attacking President Donald Trump, this time lamenting about what Trump \"has done to this country.\"\nThe post Richard Gere Rages at Trump for ‘What He Has Done to This Country’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/12/04/richard-gere-rages-at-trump-for-what-he-has-done-to-this-country/",
    "timestamp": "2025-12-04T19:38:28Z"
  },
  {
    "title": "With Musa, Nigeria’s security is in good hands — Kukah",
    "description": "Archbishop Matthew Kukah expresses confidence in new Defence Minister Gen. Christopher Musa to improve Nigeria’s security and restore normalcy nationwide.\n\nRead More: https://punchng.com/with-musa-nigerias-security-is-in-good-hands-kukah/",
    "link": "https://punchng.com/with-musa-nigerias-security-is-in-good-hands-kukah/",
    "timestamp": "2025-12-04T19:38:01Z"
  },
  {
    "title": "Speaker Johnson struggles to keep control of the House floor",
    "description": "Less than a year before the critical 2026 midterm elections, Speaker Mike Johnson is losing control of the House floor.",
    "link": "https://www.nbcnews.com/politics/congress/speaker-johnson-struggles-keep-control-house-floor-rcna247365",
    "timestamp": "2025-12-04T19:37:15Z"
  },
  {
    "title": "Trump Butchers Names of Two African Leaders Right in Front of Them",
    "description": "Donald Trump insulted the presidents of two countries right before signing a peace deal when he introduced the duo as “courageous leaders”—but couldn’t follow the flattery up with the correct pronunciation of their names.The U.S. president couldn’t wrap his m…",
    "link": "https://newrepublic.com/post/203985/donald-trump-names-african-leaders-congo-rwanda",
    "timestamp": "2025-12-04T19:37:11Z"
  },
  {
    "title": "Karoline Leavitt's top-streamed artist in 2025 is a Trump nemesis: Guess who?",
    "description": "White House Press Secretary Karoline Leavitt's Spotify Wrapped revealed Taylor Swift as a top artist, a surprising revelation given her public defense of Donald Trump's criticisms of the singer. Leavitt previously echoed Trump's sentiments, questioning Swift'…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/karoline-leavitts-top-streamed-artist-in-2025-is-a-trump-nemesis-guess-who/articleshow/125774414.cms",
    "timestamp": "2025-12-04T19:34:14Z"
  },
  {
    "title": "US prioritizes visas for fans traveling for the World Cup, Olympics and other events",
    "description": "The Trump administration has instructed U.S. embassies and consulates around the world to prioritize visa applications from foreigners wishing to visit the...",
    "link": "https://www.yahoo.com/news/articles/us-prioritizes-visas-fans-traveling-193331418.html",
    "timestamp": "2025-12-04T19:33:31Z"
  },
  {
    "title": "Trump Orders Flags at Half-Staff in Honor of National Guardswoman Sarah Beckstrom",
    "description": "President Donald Trump has ordered that American flags across the nation and on U.S. territory around the globe be flown at half-staff in honor of fallen National Guardswoman Sarah Beckstrom, who was callously shot blocks away from the White House on Thanksgi…",
    "link": "https://www.breitbart.com/politics/2025/12/04/trump-orders-flags-at-half-staff-in-honor-of-national-guardswoman-sarah-beckstrom/",
    "timestamp": "2025-12-04T19:33:11Z"
  },
  {
    "title": "Video shows Kristi Noem wearing sombrero for birthday celebration at Mexican restaurant",
    "description": "A video shared online in late 2025 authentically showed U.S. Secretary of Homeland Security Kristi Noem celebrating her birthday at a Mexican restaurant while wearing a pink sombrero.",
    "link": "https://www.snopes.com//fact-check/kristi-noem-birthday-sombrero/",
    "timestamp": "2025-12-04T19:33:00Z"
  },
  {
    "title": "Kill Baby Kill: Trump rolls back US fuel economy standards calling it 'green new scam'",
    "description": "TOI Correspondent from Washington: In a move that deepens the environmental divide between the United States and much of the world—particularly fast-growing green economies such as China and India—US President Donald Trump on Wednesday announced a sweeping ro…",
    "link": "https://biztoc.com/x/5c9a897ae49379f6",
    "timestamp": "2025-12-04T19:32:53Z"
  },
  {
    "title": "Trump’s commutation for a convicted fraudster goes from bad to worse",
    "description": "Donald Trump’s list of indefensible pardons continues to grow, but the president’s commutations matter, too. NBC News reported earlier this week:\nPresident Donald Trump has commuted the seven-year sentence of former private equity CEO David Gentile days after…",
    "link": "https://biztoc.com/x/3445201306223458",
    "timestamp": "2025-12-04T19:32:24Z"
  },
  {
    "title": "Paramount: Inside Plans for Ninja Turtles, South Park Duo's Movie",
    "description": "It’s a brand-new day at the legacy studio, where prestige films are out, testosterone-heavy tentpoles are in and Brett Ratner is back on the call sheet.",
    "link": "http://www.hollywoodreporter.com/business/business-news/paramount-plans-ninja-turtles-south-park-1236439954/",
    "timestamp": "2025-12-04T19:31:07Z"
  },
  {
    "title": "Trump admin may deny H1-B visas to people who worked in content moderation, report says",
    "description": "The Trump administration has ordered US consulates to consider rejecting H1-B visa applicants involved in content moderation or “censorship,” according to a report from Reuters. A State Department cable viewed by the outlet says officials should check an appl…",
    "link": "https://www.theverge.com/news/838489/trump-admin-h1b-visas-content-moderation",
    "timestamp": "2025-12-04T19:30:38Z"
  },
  {
    "title": "Washington, the world capital of soccer",
    "description": "The capital of the United States, Washington, breathes soccer. One of the city&apos;s most important cultural centers, the Kennedy Center, is finalizing preparations to host the dr",
    "link": "https://www.marca.com/en/world-cup/2025/12/04/6931e043ca4741cc368b45ad.html",
    "timestamp": "2025-12-04T19:30:02Z"
  },
  {
    "title": "Rwanda, DRC presidents sign ‘Washington Accord’ peace deal",
    "description": "The presidents of Rwanda and the Democratic Republic of the Congo have signed the “Washington Accord” peace deal.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/4/rwanda-drc-presidents-sign-washington-accord-peace-deal",
    "timestamp": "2025-12-04T19:29:33Z"
  },
  {
    "title": "California students with disabilities face ‘terrifying’ special ed cuts after Trump changes",
    "description": "Trump has cut funding to Medicaid, which pays for many services for students with disabilities. He also gutted the Office of Civil Rights, which helps enforce disability law.",
    "link": "https://www.kpbs.org/news/education/2025/12/04/california-students-with-disabilities-face-terrifying-special-ed-cuts-after-trump-changes",
    "timestamp": "2025-12-04T19:29:32Z"
  },
  {
    "title": "US diplomacy faces 'crisis' as morale plummets​ under Trump",
    "description": "The New York Times reports U.S. diplomacy is floundering, with fully 98 percent of diplomats reporting plummeting workplace morale since the Trump administration took over in January.“The Foreign Service is in crisis,” said John Dinkelman, president of the Am…",
    "link": "https://www.rawstory.com/alternet-posts/trump-russia-steve-witkoff/",
    "timestamp": "2025-12-04T19:28:16Z"
  },
  {
    "title": "Trump, Rwanda, DR Congo leaders sign peace deal despite ongoing violence",
    "description": "US President Trump hosts Rwandan and Congolese leaders to sign a historic Rwanda DR Congo peace deal, aiming to end conflict and open access to minerals.\n\nRead More: https://punchng.com/trump-rwanda-dr-congo-leaders-sign-peace-deal-despite-ongoing-violence/",
    "link": "https://punchng.com/trump-rwanda-dr-congo-leaders-sign-peace-deal-despite-ongoing-violence/",
    "timestamp": "2025-12-04T19:28:12Z"
  },
  {
    "title": "Trump, 79, Dozes Off Again During Peace Agreement Signing",
    "description": "Days after Donald Trump fell asleep during a televised Cabinet meeting, the president on Thursday again dozed off during a ceremony to mark the signing of a peace agreement between Rwanda and the Democratic Republic of the Congo. Trump was visibly closing his…",
    "link": "https://newrepublic.com/post/203983/trump-falls-asleep-peace-agreement-rwanda-drc",
    "timestamp": "2025-12-04T19:25:50Z"
  },
  {
    "title": "Mercuria Withdraws Huge Volume of Copper From LME as Prices Soar",
    "description": "Mercuria Energy Group Ltd. has ordered about $500 million of copper for withdrawal from warehouses overseen by the London Metal Exchange, as the trading house positions itself for a global supply crunch fueled by possible US tariffs.",
    "link": "https://financialpost.com/pmn/business-pmn/mercuria-withdraws-huge-volume-of-copper-from-lme-as-prices-soar",
    "timestamp": "2025-12-04T19:25:19Z"
  },
  {
    "title": "Keep energy infrastructure out of war, Turkey warns Moscow, Kyiv",
    "description": "Turkey has warned Russia and Ukraine against targeting energy infrastructure following several Black Sea drone attacks claimed by Kyiv on Russia-linked tankers, Energy Minister Alparslan Bayraktar said. In response to the attacks, Ankara has summoned Russian …",
    "link": "https://www.digitaljournal.com/world/keep-energy-infrastructure-out-of-war-turkey-warns-moscow-kyiv-2/article",
    "timestamp": "2025-12-04T19:22:20Z"
  },
  {
    "title": "Moonbats Resort to Trump Voodoo Dolls",
    "description": "As G.K. Chesterton observed, ““When men choose not to believe in God, they do not thereafter believe in nothing, they then become capable of believing in anything.” Having rejected all things holy, moonbats believe even in voodoo. This allows them … Continue …",
    "link": "https://moonbattery.com/moonbats-resort-to-trump-voodoo-dolls/",
    "timestamp": "2025-12-04T19:22:14Z"
  },
  {
    "title": "Trump Orders Approval For Mini 'Kei' Cars To Be Built In America",
    "description": "Trump Orders Approval For Mini 'Kei' Cars To Be Built In America\n \nPresident Donald Trump, intrigued by the tiny “kei” cars he saw in Japan, announced plans to allow their production and sale in the US, according to Bloomberg. These ultra-compact vehicles are…",
    "link": "https://biztoc.com/x/66b946b0a7ebe388",
    "timestamp": "2025-12-04T19:21:16Z"
  },
  {
    "title": "Trump nominations package hits stumbling block in Senate",
    "description": "Senate Republicans hit a temporary stumbling block in its latest effort to confirm dozens of President Donald Trump’s nominees. \nDemocrats blocked Republicans from successfully taking an initial step toward confirming a package of more than 80 nominations bec…",
    "link": "https://biztoc.com/x/cf96f875479c1cd7",
    "timestamp": "2025-12-04T19:21:13Z"
  },
  {
    "title": "‘I feel safe in Nigeria’, Boris Johnson dismisses security concerns",
    "description": "Former UK PM Boris Johnson dismisses security concerns during a visit to Nigeria, stating he feels ‘perfectly safe’ at the Imo State Economic Summit.\n\nRead More: https://punchng.com/i-feel-safe-in-nigeria-boris-johnson-dismisses-security-concerns/",
    "link": "https://punchng.com/i-feel-safe-in-nigeria-boris-johnson-dismisses-security-concerns/",
    "timestamp": "2025-12-04T19:20:15Z"
  },
  {
    "title": "“Insult to injury”: Trump’s USIP rebrand wields an olive branch as a weapon",
    "description": "Trump’s name was added to the independent institute months after his administration purged staff.",
    "link": "https://www.salon.com/2025/12/04/insult-to-injury-trumps-usip-rebrand-wields-an-olive-branch-as-a-weapon/",
    "timestamp": "2025-12-04T19:17:22Z"
  },
  {
    "title": "Bank of America expands crypto access for wealth management clients",
    "description": "Dec 4 : Bank of America will begin allowing its wealth advisers to recommend allocations to crypto in client portfolios from next month, the U.S. lending giant said on Thursday, in a landmark moment for the digital assets sector.Starting January 5, advisors a…",
    "link": "https://www.channelnewsasia.com/business/bank-america-expands-crypto-access-wealth-management-clients-5558461",
    "timestamp": "2025-12-04T19:15:06Z"
  },
  {
    "title": "The World Cup draw is usually a spectacle. This time, FIFA hopes bigger is better",
    "description": "The World Cup is expanding to 48 teams. A record 64 nations will participate in the draw. The tournament will feature 104 games across North America. Ticket prices are at record highs. Some venues may face high temperatures. Lionel Messi and Cristiano Ronaldo…",
    "link": "https://economictimes.indiatimes.com/news/sports/the-world-cup-draw-is-usually-a-spectacle-this-time-fifa-hopes-bigger-is-better/articleshow/125774199.cms",
    "timestamp": "2025-12-04T19:12:35Z"
  },
  {
    "title": "What is ‘anarchist ideology,’ the political belief the alleged Jan. 6 pipe bomber Brian Cole of Virginia is linked to, and is it connected to ANTIFA?",
    "description": "An arrest has been made in connection with pipe bombs planted near political headquarters. A Virginia man was taken into custody by the FBI. The incident occurred the night before the US Capitol riot. Investigators are exploring possible motives and the suspe…",
    "link": "https://economictimes.indiatimes.com/news/international/us/what-is-anarchist-ideology-the-political-belief-the-alleged-jan-6-pipe-bomber-brian-cole-of-virginia-is-linked-to-and-is-it-connected-to-antifa/articleshow/125774036.cms",
    "timestamp": "2025-12-04T19:11:20Z"
  },
  {
    "title": "Trump Admin Makes Major Change to Immigrant Work Permits—What to Know",
    "description": "President Donald Trump will shorten the validity of work permits issued to immigrants in the U.S. under certain conditions, marking another significant crackdown on immigration.\nThe move follows the attack on two West Virginia National Guard members, one of w…",
    "link": "https://biztoc.com/x/85177185c73041a5",
    "timestamp": "2025-12-04T19:10:05Z"
  },
  {
    "title": "Warring Rwanda and Congo Sign First Pact at Donald Trump Institute of Peace",
    "description": "Rwanda and the Democratic Republic of Congo signed a landmark agreement Thursday at the newly renamed Donald J. Trump Institute of Peace, where President Trump praised the pact — and the building’s new name — as the two nations sought to end fighting in easte…",
    "link": "https://biztoc.com/x/bd0d13373e7e7e04",
    "timestamp": "2025-12-04T19:10:01Z"
  },
  {
    "title": "Holiday spending plans plunge to lowest level ever as Trump economy triggers panic: data",
    "description": "A new batch of data is offering more evidence that the US economy is in rough shape\r\n heading into the holidays.The latest Economic Confidence Index released\r\n by Gallup on Thursday has found that Americans’ confidence in the economy has fallen by seven point…",
    "link": "https://www.rawstory.com/holiday-spending-plans-plunge-to-lowest-level-ever-as-trump-economy-triggers-panic-data/",
    "timestamp": "2025-12-04T19:04:14Z"
  },
  {
    "title": "FIFA considered Vegas for World Cup draw but logistical issues helped send it to Washington instead",
    "description": "Two major events made it difficult for the city to host the draw.",
    "link": "https://www.bostonherald.com/2025/12/04/world-cup-draw-las-vegas/",
    "timestamp": "2025-12-04T19:03:09Z"
  }
]