[
  {
    "title": "The Dark Satire of Pete Hegseth’s Quantico Speech",
    "description": "Lyle Jeremy Rubin\n\n\n\nThe secretary of war’s plea for discipline collapses into its opposite—a demand for wanton violence and mayhem \r\n\n\r\n\n\nThe post The Dark Satire of Pete Hegseth’s Quantico Speech appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=572887",
    "timestamp": "2025-10-08T09:32:00Z"
  },
  {
    "title": "What Game Is Trump Playing With His Military Deployments?",
    "description": "What’s so unsettling about these last few months is how the Trump administration is blatantly manufacturing a crisis, writes Ross Barkan.",
    "link": "http://nymag.com/intelligencer/article/what-game-is-trump-playing-with-the-national-guard.html",
    "timestamp": "2025-10-08T09:30:29Z"
  },
  {
    "title": "International firms flock to Hong Kong, signalling rebound for city's capital market",
    "description": "The listing of a Kazakhstan-based tungsten mining company in Hong Kong was evidence of the international scope and breadth of the city's capital market...",
    "link": "https://finance.yahoo.com/news/international-firms-flock-hong-kong-093000369.html",
    "timestamp": "2025-10-08T09:30:00Z"
  },
  {
    "title": "Hamas says it has handed over list of Israelis and Palestinians for swap deal",
    "description": "US team including Steve Witkoff and Jared Kushner to join talks",
    "link": "https://www.irishtimes.com/world/middle-east/2025/10/08/hamas-says-it-has-handed-over-list-of-israelis-and-palestinians-for-swap-deal/",
    "timestamp": "2025-10-08T09:27:31Z"
  },
  {
    "title": "‘Her day starts and ends with Russia’ – Kallas critics to Foreign Policy",
    "description": "The EU’s foreign policy chief is described as “more cop than diplomat,” the outlet has reported Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626063-kallas-undiplomatic-foreign-policy/",
    "timestamp": "2025-10-08T09:25:33Z"
  },
  {
    "title": "Republican Crumbles After Being Backed Into Corner Over Epstein",
    "description": "CNN’s Kaitlan Collins left Jim Jordan flustered after grilling him over delays in swearing in a new Democratic lawmaker whose signature could force a vote on...",
    "link": "https://www.thedailybeast.com/republican-crumbles-after-being-backed-into-corner-over-epstein/",
    "timestamp": "2025-10-08T09:22:35Z"
  },
  {
    "title": "Hamas Says 'Optimism Prevails' In Gaza Talks With Israel",
    "description": "Hamas said Wednesday that \"optimism\" was prevailing in indirect talks with Israel aimed at ending the Gaza war, with the militant group submitting a list of prisoners it wants released in exchange for freeing Israeli hostages as part of an agreement.",
    "link": "https://www.ibtimes.com/hamas-says-optimism-prevails-gaza-talks-israel-3786128",
    "timestamp": "2025-10-08T09:21:13Z"
  },
  {
    "title": "Hamas Says 'Optimism Prevails' In Gaza Talks With Israel",
    "description": "Hamas said Wednesday that \"optimism\" was prevailing in indirect talks with Israel aimed at ending the Gaza war, with the militant group submitting a list of prisoners it wants released in exchange for freeing Israeli hostages as part of an agreement.",
    "link": "https://www.ibtimes.com.au/hamas-says-optimism-prevails-gaza-talks-israel-1860754",
    "timestamp": "2025-10-08T09:21:09Z"
  },
  {
    "title": "Ukrainian official claims Tomahawks can ‘pressure’ Russia",
    "description": "The US could gradually lift restrictions on the use of the missiles to “pressure” Russia, a senior official in Kiev has told The Telegraph Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626069-ukraine-tomahawks-pressure-tool/",
    "timestamp": "2025-10-08T09:19:29Z"
  },
  {
    "title": "Trump threatened shutdown layoffs. So far, he hasn’t followed through",
    "description": "One week into a shutdown that shows no sign of ending, there’s also no sign of the dire consequences that President Donald Trump predicted.",
    "link": "https://biztoc.com/x/567f99daae12a3a6",
    "timestamp": "2025-10-08T09:12:59Z"
  },
  {
    "title": "Witkoff and Kushner join Gaza talks as Hamas says hostage and prisoner lists exchanged",
    "description": "President Donald Trump’s special envoy Steve Witkoff and son-in-law Jared Kushner will join Gaza ceasefire talks in Egypt on Wednesday, as Hamas said the two sides had taken an initial step toward a key point of the U.S. plan to end the devastating war.",
    "link": "https://www.nbcnews.com/world/middle-east/gaza-talks-witkoff-kushner-hamas-israel-hostage-prisoner-lists-egypt-rcna236306",
    "timestamp": "2025-10-08T09:08:36Z"
  },
  {
    "title": "Daimler Truck's North America sales shrink in Q3",
    "description": "Shares were down 2% on Wednesday after the sales results.  An already weak German automotive sector is currently facing U.S. import tariffs, which U.S...",
    "link": "https://finance.yahoo.com/news/daimler-trucks-north-america-sales-090725377.html",
    "timestamp": "2025-10-08T09:07:25Z"
  },
  {
    "title": "‘You’re a failed lawyer’: Key takeaways from Pam Bondi’s combative Senate hearing",
    "description": "Bondi cast her responses as a defence of the Trump administration",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/10/07/us/politics/bondi-hearing-takeaways.html",
    "timestamp": "2025-10-08T09:06:18Z"
  },
  {
    "title": "Trump-Backed Van Epps And Democrat Behn Win Tennessee Primaries For U.S. House Special Election",
    "description": "In a victory speech, the Republican nominee said the president's endorsement “made the difference, and I will never forget it.”",
    "link": "https://www.huffpost.com/entry/us-election-2025-tennessee-congress_n_68e62720e4b07aeeb1951fd9",
    "timestamp": "2025-10-08T09:06:12Z"
  },
  {
    "title": "Are we ready for a protectionist EU?",
    "description": "Taken in isolation, the EU's protectionist turn might be welcomed by its industry. But it will further splinter the global economy, with unenviable knock-on effects that will be difficult to guard against",
    "link": "https://www.euractiv.com/opinion/are-we-ready-for-a-protectionist-eu/",
    "timestamp": "2025-10-08T09:05:29Z"
  },
  {
    "title": "Bourbon, spirits industry suffers 'significant downturn' after record year for exports",
    "description": "The U.S. spirits industry, including American whiskey like bourbon, has seen steep export decline in light of President Donald Trump's tariff policy.",
    "link": "https://www.courier-journal.com/story/money/2025/10/08/u-s-spirits-including-kentucky-bourbon-exports-tank-amid-tariffs-trade-war/86568713007/",
    "timestamp": "2025-10-08T09:05:11Z"
  },
  {
    "title": "Pritzker: There Isn't an Emergency, It Looks Bad Due to Feds, It's Only in Two-Block Area",
    "description": "On Tuesday’s broadcast of NPR’s “All Things Considered,” Illinois Gov. JB Pritzker (D) stated that there isn’t a national emergency in Illinois, the federal officials are “the ones that are creating mayhem on the ground, specifically because they want to\nThe …",
    "link": "https://www.breitbart.com/clips/2025/10/08/pritzker-there-isnt-an-emergency-it-looks-bad-due-to-feds-its-only-in-two-block-area/",
    "timestamp": "2025-10-08T09:04:48Z"
  },
  {
    "title": "Trump Announces U.S.-Canada Merger To Mark Carney's Surprise, Then Says ‘Just Kidding’",
    "description": "Oh, what a joker!",
    "link": "https://www.huffpost.com/entry/donald-trump-mark-carney-canada_n_68e61aa1e4b0d98d3e52ccb5",
    "timestamp": "2025-10-08T09:02:23Z"
  },
  {
    "title": "Border Patrol chief Gregory Bovino leads Chicago immigration crackdown",
    "description": "The heavily armed agents carrying out President Donald Trump’s aggressive immigration enforcement push in Chicago are often masked. The man leading them is not.",
    "link": "https://www.cnn.com/2025/10/08/politics/gregory-bovino-border-patrol-chicago-immigration",
    "timestamp": "2025-10-08T09:00:51Z"
  },
  {
    "title": "Housing costs are crushing families – here’s the way out",
    "description": "The Trump administration may declare a housing emergency to tackle regulatory barriers that have created a multi-million home shortage across the United States.",
    "link": "https://www.foxnews.com/opinion/housing-costs-are-crushing-families-heres-the-way-out",
    "timestamp": "2025-10-08T09:00:39Z"
  },
  {
    "title": "What is the Nobel Peace Prize — and could Donald Trump get it?",
    "description": "The winner of the 2025 Nobel Peace Prize will be announced Friday. Here's what to know about the honor and President Trump's interest.",
    "link": "https://www.cbsnews.com/news/nobel-peace-prize-donald-trump-what-to-know/",
    "timestamp": "2025-10-08T09:00:05Z"
  },
  {
    "title": "Will Air-Traffic Controllers End the Government Shutdown?",
    "description": "Air-traffic controllers are calling in sick, and flights are being delayed. Jeff Wise reports they have a huge amount of power to force an end to the government shutdown.",
    "link": "http://nymag.com/intelligencer/article/burbank-air-traffic-controllers-government-shutdown.html",
    "timestamp": "2025-10-08T09:00:04Z"
  },
  {
    "title": "From Joe Rogan to Theo Von, pro-Trump creators who once helped his rise are now quietly backing away",
    "description": "The trend of Trump voters coming to regret their support has spread to Joe Rogan and other manosphere influencers with millions of fans. Some have cited broken promises by President Donald Trump, while others oppose his use of Immigration and Customs Enforcem…",
    "link": "https://www.dailydot.com/viral-politics/trump-influencers-backing-away/",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "What’s Behind Saudi Arabia’s Surge in Executions?",
    "description": "Ebtihal Mubarak\n\n\n\nActivists believe that authorities are abusing the justice system to silence dissent and chill speech. \r\n\n\r\n\n\nThe post What’s Behind Saudi Arabia’s Surge in Executions? appeared first on The Nation.",
    "link": "https://www.thenation.com/?post_type=article&p=572907",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "An American Hunger Crisis Is Coming",
    "description": "Trump’s cruel and disastrous policies—slashing food stamps and hiking inflationary tariffs—put millions of Americans at risk.\nThe post An American Hunger Crisis Is Coming  appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/10/08/an-american-hunger-crisis-is-coming/",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "These Activists Want to Dismantle Public Schools. Now They Run the Education Department.",
    "description": "by Megan O’Matz and Jennifer Smith Richards \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nEducation Secretary Linda McMahon has been clear ab…",
    "link": "https://www.propublica.org/article/education-department-public-schools-activists-linda-mcmahon-trump",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "Transcript: Newsom and Pritzker Show How To Attack An Authoritarian",
    "description": "The following is a lighted edited transcript of the Oct. 7 edition of Right Now With Perry Bacon. You can watch this video here. Perry Bacon: Welcome to the New Republic show Right Now, I’m the host, Perry Bacon. I’m joined by Arkadi Gerney today. Great great…",
    "link": "https://newrepublic.com/article/201449/transcript-newsom-pritzker-show-attack-authoritarian",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "Ex-FBI Director James Comey to be arraigned after Trump called for his prosecution",
    "description": "The charges against the former head of the Federal Bureau of Investigation came amid the president's repeated calls for investigations of his political opponents.",
    "link": "https://www.nbcnews.com/politics/justice-department/ex-fbi-director-james-comey-arraigned-trump-called-prosecution-rcna236138",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "Once a loyal foot soldier for Trump, Marjorie Taylor Greene is increasingly bucking her party",
    "description": "From the Gaza war to the Epstein files to the government shutdown, Rep. Marjorie Taylor Greene has grown critical of her fellow Republicans.",
    "link": "https://www.nbcnews.com/politics/congress/marjorie-taylor-greene-increasingly-bucking-party-trump-rcna236288",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "California’s Nursing Shortage Is Getting Worse. Front-Line Workers Blame Management.",
    "description": "California’s nursing shortage is projected to worsen, and hospitals say funding cuts will only add strain. But front-line nurses blame heavy workloads, not a shortage, for driving workers away.",
    "link": "https://kffhealthnews.org/news/article/california-nursing-shortage-medicaid-funding-management-profit-unions-burnout/",
    "timestamp": "2025-10-08T09:00:00Z"
  },
  {
    "title": "German industrial output posts biggest decline in 3 years",
    "description": "German industrial output fell much further than expected in August, pushed down by a sharp decrease in car production as frontloaded demand ahead of US tariffs dried up.",
    "link": "https://www.rte.ie/news/business/2025/1008/1537416-german-industrial-output/",
    "timestamp": "2025-10-08T08:59:59Z"
  },
  {
    "title": "Erdoğan says Trump asked Türkiye to 'persuade Hamas' on Gaza peace",
    "description": "U.S. President Donald Trump asked Türkiye to \"persuade\" Hamas to accept his plan for ending the Gaza war, President Recep Tayyip Erdoğan said in a transcript shared by his office Wednesday.",
    "link": "https://www.hurriyetdailynews.com/erdogan-says-trump-asked-turkiye-to-persuade-hamas-on-gaza-peace-214448",
    "timestamp": "2025-10-08T08:59:31Z"
  },
  {
    "title": "What is the Insurrection Act which Trump keeps threatening to use?",
    "description": "Donald Trump has threatened to invoke the Insurrection Act, giving him sweeping presidential powers over the deployment of the military in the US.",
    "link": "https://news.sky.com/story/what-is-the-insurrection-act-which-trump-keeps-threatening-to-use-13446869",
    "timestamp": "2025-10-08T08:58:00Z"
  },
  {
    "title": "National Guard Troops Are Outside Chicago And Could Be In Memphis Soon In Trump Crackdown",
    "description": "The president has called Chicago a “hell hole” of crime, although police statistics show significant drops in most crimes, including homicides.",
    "link": "https://www.huffpost.com/entry/national-guard-chicago-memphis_n_68e62382e4b038265cc8bbc9",
    "timestamp": "2025-10-08T08:53:42Z"
  },
  {
    "title": "Analysis:Investors set to reignite yield curve steepening if fiscal worries worsen",
    "description": "Bond markets remain focused on budget concerns in the U.S., euro zone and Japan, meaning the recent pullback in ultra-long sovereign yields may prove short-lived, potentially reigniting interest in this year's popular curve steepening trade.Investors have bee…",
    "link": "https://www.channelnewsasia.com/business/analysisinvestors-set-reignite-yield-curve-steepening-if-fiscal-worries-worsen-5389366",
    "timestamp": "2025-10-08T08:52:37Z"
  },
  {
    "title": "HarperCollins UK apologizes to Melania Trump over book's Epstein claim",
    "description": "Book publisher HarperCollins UK apologized to First Lady Melania Trump on Tuesday and recalled a book that repeated unverified claims that child sex trafficker Jeffrey Epstein was involved in introducing her to Donald Trump.\nWhy it matters: HarperCollins is t…",
    "link": "https://biztoc.com/x/bc8142ef8f84884c",
    "timestamp": "2025-10-08T08:50:42Z"
  },
  {
    "title": "UK's Starmer begins visit to India, praises trade deal",
    "description": "UK Prime Minister Keir Starmer urged business leaders to seize the opportunity of the trade deal with India. He's visiting the South Asian giant and is accompanied by the largest-ever UK trade mission to the country.",
    "link": "https://www.dw.com/en/uks-starmer-begins-visit-to-india-praises-trade-deal/a-74273072",
    "timestamp": "2025-10-08T08:38:00Z"
  },
  {
    "title": "Green stocks are quietly beating the world’s biggest trades",
    "description": "Investors have turned more positive on green stocks as the energy needed to power AI can’t be delivered without renewables",
    "link": "https://www.bloomberg.com/news/articles/2025-10-08/green-stocks-are-quietly-beating-the-world-s-biggest-trades",
    "timestamp": "2025-10-08T08:35:18Z"
  },
  {
    "title": "Green Stocks Are Quietly Beating the World’s Biggest Trades",
    "description": "A global benchmark of clean energy stocks is outperforming major equity indexes and even gold, as investors respond to soaring demand for renewables needed to power the boom in artificial intelligence.",
    "link": "https://financialpost.com/pmn/business-pmn/green-stocks-are-quietly-beating-the-worlds-biggest-trades",
    "timestamp": "2025-10-08T08:21:29Z"
  },
  {
    "title": "Green stocks are beating world's biggest trades, even gold",
    "description": "A global clean energy index is outperforming major equity indexes and gold, as the demand for renewables soars. Read more.",
    "link": "https://financialpost.com/investing/green-stocks-beating-worlds-biggest-trades",
    "timestamp": "2025-10-08T08:21:29Z"
  },
  {
    "title": "2 Key Democrats Come Out And Say It: Trump Has 'Some Kind Of Dementia'",
    "description": "The comments come as the president faces growing questions about his health.",
    "link": "https://www.huffpost.com/entry/jb-pritzker-trump-dementia_n_68e60661e4b0d98d3e52b9bb",
    "timestamp": "2025-10-08T08:16:26Z"
  },
  {
    "title": "The Truth Behind Darkseid in The Daily LITG, 8th of October 2025",
    "description": "The Truth Behind Darkseid was the most-read story on Bleeding Cool yesterday. Lying In The Gutters is the daily runaround for the most-read stories the day before, as well as over the past seven years. Founded over sixteen years ago and steeped in a history o…",
    "link": "https://bleedingcool.com/comics/the-truth-behind-darkseid-in-the-daily-litg-8th-of-october-2025/",
    "timestamp": "2025-10-08T08:13:05Z"
  },
  {
    "title": "Nvidia To Reportedly Cover Trump's $100,000 H1-B Visa Fee For New Hires, Says CEO: 'Not...Possible Without Immigration'",
    "description": "Nvidia Corp. (NASDAQ:NVDA) CEO Jensen Huang has reportedly assured employees that the company will continue sponsoring H-1B visas, despite President Donald Trump‘s recent executive order to impose a $100,000 fee on new applications. \nHuang Backs Trump On ‘Leg…",
    "link": "https://biztoc.com/x/25d778f17dc67d99",
    "timestamp": "2025-10-08T08:06:36Z"
  },
  {
    "title": "Map Shows US Cities With Most Vacant Lots After Trump Housing Update",
    "description": "In a social media post published earlier this week, President Donald Trump called on mortgage financing giants Fannie Mae and Freddie Mac to “get big homebuilders going,” adding that they were “sitting on 2 million empty lots.”\nAccording to the president, the…",
    "link": "https://biztoc.com/x/833b98071bde05d0",
    "timestamp": "2025-10-08T08:06:34Z"
  },
  {
    "title": "Hamas says it handed over list of Israelis and Palestinians for swap deal",
    "description": "SHARM EL-SHEIKH (Reuters) -Hamas said on Wednesday it had exchanged a list of the names of Israeli hostages and Palestinian prisoners to be released under a ...",
    "link": "https://ca.news.yahoo.com/hamas-says-handed-over-list-080158382.html",
    "timestamp": "2025-10-08T08:01:58Z"
  },
  {
    "title": "Carney raised Keystone XL pipeline revival in meeting with Trump",
    "description": "Relief for Canada from U.S. tariffs on steel and aluminum may come thanks to renewed interest in a pipeline project first proposed more than 15 years ago.",
    "link": "https://www.cbc.ca/news/politics/carney-trump-keystone-revival-1.7653949",
    "timestamp": "2025-10-08T08:00:33Z"
  },
  {
    "title": "Today in History: October 8, Pakistan-India border earthquake kills tens of thousands",
    "description": "A magnitude 7.6 earthquake on the Pakistan-India border killed an estimated 86,000 people.",
    "link": "https://www.denverpost.com/2025/10/08/today-in-history-october-8-pakistan-india-border-earthquake-kills-tens-of-thousands/",
    "timestamp": "2025-10-08T08:00:30Z"
  },
  {
    "title": "Today in History: October 8, Pakistan-India border earthquake kills tens of thousands",
    "description": "A magnitude 7.6 earthquake on the Pakistan-India border killed an estimated 86,000 people.",
    "link": "https://www.bostonherald.com/2025/10/08/today-in-history-october-8-pakistan-india-border-earthquake-kills-tens-of-thousands/",
    "timestamp": "2025-10-08T08:00:30Z"
  },
  {
    "title": "Bitcoin – 77% odds of BTC hitting $130K amid ‘debasement trade’",
    "description": "Will the $120K BTC support set the next springboard to $130K and above?",
    "link": "https://ambcrypto.com/bitcoin-77-odds-of-btc-hitting-130k-amid-debasement-trade/",
    "timestamp": "2025-10-08T08:00:07Z"
  },
  {
    "title": "Euro, yen slide for third straight day versus US dollar on political jitters",
    "description": "The euro and the yen were headed for a third straight daily loss against the U.S. dollar, pressured by political turmoil in France and expectations of increased fiscal spending in Japan.Expansive economic policies in Japan and France’s struggle to rein in its…",
    "link": "https://www.channelnewsasia.com/business/euro-yen-slide-third-straight-day-versus-us-dollar-political-jitters-5388761",
    "timestamp": "2025-10-08T07:47:39Z"
  },
  {
    "title": "China Dodges US Export Controls, Buys $38 Billion In Chipmaking Equipment, Congress Report Says",
    "description": "China bought about $38 billion worth of sophisticated chimaking equipment from the U.S. and its allies last year due to gaps in efforts to curb manufacturing, a bipartisan report by U.S. lawmakers has found. \nInconsistencies In Rules Allow Sales \nThe Donald T…",
    "link": "https://biztoc.com/x/1e8fdb83253b40c4",
    "timestamp": "2025-10-08T07:44:37Z"
  },
  {
    "title": "George Clooney: ‘My kids have a much better life in France. I was worried about raising our kids in the culture of Hollywood’",
    "description": "The actor wants his twins to grow up self-sufficient, free from paparazzi, and without being compared to anybody else’s famous kids",
    "link": "https://www.irishtimes.com/culture/film/2025/10/08/george-clooney-my-kids-have-a-much-better-life-in-france-i-was-worried-about-raising-our-kids-in-the-culture-of-hollywood/",
    "timestamp": "2025-10-08T07:41:20Z"
  },
  {
    "title": "Five takeaways from Pam Bondi's tense, partisan Senate hearing",
    "description": "Nerves were raw in a hearing that covered much ground, and saw Trump's attorney general go on the attack.",
    "link": "https://www.bbc.com/news/articles/c75qpl70xvzo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-08T07:25:32Z"
  },
  {
    "title": "Reddit Wouldn't Exist If ICE Had Grabbed My Mother, Says Co-Founder Alexis Ohanian: Undocumented Immigrants Can Have 'Pretty Productive' Kids",
    "description": "Reddit Inc. (NYSE:RDDT) co-founder Alexis Ohanian and Y Combinator co-founder Paul Graham are among a growing number of people condemning the Donald Trump administration's 2025 ICE deportation operations.\nPaul Graham Decries ‘Masked Thugs' Dragging People Off…",
    "link": "https://biztoc.com/x/a6a8735eb5a96592",
    "timestamp": "2025-10-08T07:21:49Z"
  },
  {
    "title": "Kaitlan Collins Reveals Why Flying With Trump Can Be No Fun For His Own Staffers",
    "description": "\"You never want to be on Air Force One on a trip” with Trump, the CNN anchor cited a source as telling her.",
    "link": "https://www.huffpost.com/entry/kaitlan-collins-donald-trump-trips_n_68e603abe4b038265cc8a37c",
    "timestamp": "2025-10-08T07:18:21Z"
  },
  {
    "title": "Why more metals facilities could put their hands up for a bail out",
    "description": "The bailout of another metals facility — this time in Queensland — is unlikely to be the last, with pressures on the sector driven by China to keep up for years.",
    "link": "https://www.abc.net.au/news/2025-10-08/metals-facility-bailout-china-price-pressure/105865170",
    "timestamp": "2025-10-08T07:14:26Z"
  },
  {
    "title": "ICE spent $825K this year on vehicles with IMSI catchers",
    "description": "US Immigration and Customs Enforcement paid $825,000 this year for surveillance tech that can spy on nearby mobile phones. TechCrunch identified the contract, which “provides Cell Site Simulator (CSS) Vehicles to support the Homeland Security Technical Operat…",
    "link": "https://www.madshrimps.be/news/ice-spent-825k-this-year-on-vehicles-with-imsi-catchers/",
    "timestamp": "2025-10-08T07:07:55Z"
  },
  {
    "title": "STEPHEN MOORE: Spectrum Sale Enhances Economic And National Security",
    "description": "One of the best features of the Big Beautiful Tax Cut was an authorization for the FCC to raise $88 to $100 billion through electronic spectrum auctions.",
    "link": "https://dailycaller.com/2025/10/08/opinion-spectrum-sale-enhances-economic-and-national-security-stephen-moore/",
    "timestamp": "2025-10-08T07:06:34Z"
  },
  {
    "title": "UK PM Starmer seeks quick implementation of trade deal with India to build business ties",
    "description": "British Prime Minister Keir Starmer said he wanted a trade deal with India to be implemented as soon as “humanly possible” as he began a two-day visit on Wednesday, joined by more than a hundred leaders from the business, culture and university sectors.",
    "link": "https://www.thehindubusinessline.com/news/uk-pm-starmer-seeks-quick-implementation-of-trade-deal-with-india-to-build-business-ties/article70138460.ece",
    "timestamp": "2025-10-08T07:06:14Z"
  },
  {
    "title": "Immigrant Jensen Huang assures workers Nvidia will continue to sponsor H-1B visas, ‘not possible without you’",
    "description": "Nvidia CEO Jensen Huang, who moved to America as an immigrant, in a message to staff assured them that the company will continue to sponsor H-1B visas. This comes after US President Donald Trump last month hiked fees to $1,00,000.&nbsp;",
    "link": "https://www.livemint.com/companies/news/immigrant-jensen-huang-assures-workers-nvidia-will-continue-to-sponsor-h-1b-visas-not-possible-without-you-donald-trump-11759906734858.html",
    "timestamp": "2025-10-08T07:05:37Z"
  },
  {
    "title": "Steel industry in UK warns of 'biggest crisis' ever as EU hikes tariffs",
    "description": "The tariffs hike provoked an immediate outcry in the U.K., and automakers in Europe are not too pleased, either.",
    "link": "https://www.cnbc.com/2025/10/08/steel-industry-in-uk-warns-of-biggest-crisis-ever-as-eu-hikes-tariffs.html",
    "timestamp": "2025-10-08T07:05:25Z"
  },
  {
    "title": "Is the federal government still shut down? What to know on Wednesday, Oct. 8.",
    "description": "The partial U.S. government shutdown entered day eight on Wednesday, Oct. 8. When could it end? Here's what we know.",
    "link": "https://www.usatoday.com/story/news/politics/2025/10/08/is-the-federal-government-still-shutdown-wednesday-october-8/86571952007/",
    "timestamp": "2025-10-08T07:01:14Z"
  },
  {
    "title": "Trump drives the shutdown coverage, but leaderless Democrats have broken through with healthcare message",
    "description": "President Trump stays above the shutdown fray as both parties oddly unite to defend federal programs, each blaming the other while eyeing a short-term spending fix.",
    "link": "https://www.foxnews.com/media/trump-drives-shutdown-coverage-leaderless-democrats-have-broken-through-healthcare-message",
    "timestamp": "2025-10-08T07:00:05Z"
  },
  {
    "title": "UK PM Starmer seeks quick implementation of India trade deal to build business ties",
    "description": "MUMBAI (Reuters) -British Prime Minister Keir Starmer said he wanted a trade deal with India to be implemented as soon as \"humanly possible\" as he began a...",
    "link": "https://www.yahoo.com/news/articles/uk-pm-starmer-seeks-quick-065828879.html",
    "timestamp": "2025-10-08T06:58:28Z"
  },
  {
    "title": "National Guard troops are outside Chicago and could be in Memphis soon in Trump's latest deployment",
    "description": "National Guard troops are positioned outside Chicago and they could be in Memphis by Friday as the Trump administration pushes ahead with an aggressive policy toward big-city crime whether local leaders support it or not.",
    "link": "https://www.cbc.ca/news/world/national-guard-chicago-memphis-latest-deployment-9.6931223",
    "timestamp": "2025-10-08T06:58:07Z"
  },
  {
    "title": "US Attorney General Pam Bondi clashes with critics at key Senate hearing",
    "description": "Democrats on the Senate panel grilled her over her leadership of the Justice Department. She hit back, with GOP support.",
    "link": "https://www.aljazeera.com/news/2025/10/8/us-attorney-general-pam-bondi-clashes-with-critics-at-key-senate-hearing",
    "timestamp": "2025-10-08T06:55:23Z"
  },
  {
    "title": "Pentagon nominee backs Trump call on 10% Taiwan defense spending",
    "description": "WASHINGTON (Reuters) -The nominee to be the Pentagon's senior official for the Indo-Pacific region said on Tuesday he strongly supported President Donald...",
    "link": "https://www.yahoo.com/news/articles/pentagon-nominee-backs-trump-call-065441740.html",
    "timestamp": "2025-10-08T06:54:41Z"
  },
  {
    "title": "Explainer: Trump keeps bringing up the Insurrection Act – what is it?",
    "description": "U.S. President Donald Trump on Monday said he might use the Insurrection Act, a law authorising the president to deploy military forces on U.S. soil, if courts and governors continue to block his deployment of National Guard troops in Democratic-led cities.",
    "link": "https://www.independent.ie/world-news/north-america/explainer-trump-keeps-bringing-up-the-insurrection-act-what-is-it/a1586654922.html",
    "timestamp": "2025-10-08T06:53:29Z"
  },
  {
    "title": "White House suggests some federal workers may not get back pay after shutdown",
    "description": "With the shutdown about to enter its second week, Trump says some furloughed workers \"don't deserve to be taken care of\".",
    "link": "https://www.bbc.com/news/articles/cwyld9qqgv8o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-10-08T06:51:09Z"
  },
  {
    "title": "EU 'must respond' to Russia's 'hybrid warfare': von der Leyen",
    "description": "Strasbourg, France Oct 8, 2025\n\n\n EU chief Ursula von der Leyen on Wednesday said Europe must ramp up its defences to deter Russia's \"hybrid warfare\", after a catalogue of air incursions, cyber attacks and damage to undersea cables. \n\n\"These incidents are cal…",
    "link": "https://www.spacewar.com/reports/EU_must_respond_to_Russias_hybrid_warfare_von_der_Leyen_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Gaza war second anniversary could reopen path to Palestinian statehood",
    "description": "Washington DC (UPI) Oct 7, 2025 \n\n\n Hamas's daring \"Operation Al Aqsa Flood\" two years ago and Israel's devastating war on the Gaza Strip have not only transformed the Middle East, but also reverberated across the world. \n They have again drawn attention to t…",
    "link": "https://www.spacewar.com/reports/Gaza_war_second_anniversary_could_reopen_path_to_Palestinian_statehood_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Trump unlikely to win Nobel Peace Prize, but who will?",
    "description": "Oslo (AFP) Oct 8, 2025\n\n When it comes to this year's Nobel Peace Prize, one thing is almost certain: US President Donald Trump will not win, no matter how much he wants it. But who will? \n\nThe Norwegian Nobel Committee in Oslo will bring the suspense to an e…",
    "link": "https://www.spacewar.com/reports/Trump_unlikely_to_win_Nobel_Peace_Prize_but_who_will_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "Iran dismissees Israel's missile concern as 'made-up threat'",
    "description": "Tehran (AFP) Oct 7, 2025\n\n\n Iran on Tuesday dismissed Israeli Prime Minister Benjamin Netanyahu's warnings over its missile programme as fabricated, after he alleged the Islamic republic was developing rockets capable of reaching US cities. \n\nIn an interview …",
    "link": "https://www.spacewar.com/reports/Iran_dismissees_Israels_missile_concern_as_made-up_threat_999.html",
    "timestamp": "2025-10-08T06:49:18Z"
  },
  {
    "title": "EU proposes 50% steel tariffs mirroring Trump",
    "description": "“Global overcapacity is damaging our industry,” Ursula von der Leyen has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626059-eu-proposes-steel-tariffs/",
    "timestamp": "2025-10-08T06:48:44Z"
  },
  {
    "title": "Jimmy Kimmel Torches Trump's Jeffrey Epstein Denial With Supercut",
    "description": "The late night host said it's clear that Trump doesn't want Americans to see what's in the Epstein files.",
    "link": "https://www.huffpost.com/entry/kimmel-trump-epstein-video_n_68e5ea7ee4b07aeeb194ffec",
    "timestamp": "2025-10-08T06:28:04Z"
  },
  {
    "title": "Former FBI chief Comey to make first US court appearance",
    "description": "Former FBI director James Comey, a prominent critic of US President Donald Trump, is to make his first court appearance to face charges of making false statements and obstructing a congressional proceeding.",
    "link": "https://www.rte.ie/news/us/2025/1008/1537384-james-comey-us/",
    "timestamp": "2025-10-08T06:25:53Z"
  },
  {
    "title": "Wednesday's papers: Finnair's Trump slump, central bank's crisis planning, and Finland's cheapest petrol",
    "description": "The Bank of Finland is looking to set up a way for people to continue buying essentials when regular banking systems are offline.",
    "link": "https://yle.fi/a/74-20187227",
    "timestamp": "2025-10-08T06:19:21Z"
  },
  {
    "title": "There is good reason to be worried as gold smashes past $4,000 per ounce",
    "description": "Sky's James Sillars writes that a toxic cocktail of pressures are driving investors to the safe haven asset - and it's a signal we should not ignore.",
    "link": "https://news.sky.com/story/gold-smashes-past-4-000-per-ounce-but-there-is-good-reason-to-be-worried-13446794",
    "timestamp": "2025-10-08T06:16:00Z"
  },
  {
    "title": "Trump memecoin issuer pursues $200 million funding to build digital asset treasury: Bloomberg",
    "description": "Fight Fight Fight LLC, the company behind Donald Trump’s memecoin, is seeking to raise at least $200 million to establish a digital asset treasury.",
    "link": "https://biztoc.com/x/5894f489d6b90a26",
    "timestamp": "2025-10-08T06:14:46Z"
  },
  {
    "title": "Former FBI chief James Comey to make first US court appearance",
    "description": "Former FBI director James Comey, a prominent critic of US President Donald Trump, is to make his first court appearance on Wednesday to face charges of making false statements and obstructing a congressional proceeding. Appointed to head the FBI by former pre…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/former-fbi-chief-james-comey-to-make-first-us-court-appearance/articleshow/124378726.cms",
    "timestamp": "2025-10-08T06:14:04Z"
  },
  {
    "title": "Analysis-Rising tungsten prices worsen oil drillers' inflation worries",
    "description": "(Reuters) -U.S. shale drillers are facing higher prices for tungsten, a rare, ultra-hard metal used for industrial tools like drillbits, as Chinese export...",
    "link": "https://finance.yahoo.com/news/analysis-rising-tungsten-prices-worsen-061403792.html",
    "timestamp": "2025-10-08T06:14:03Z"
  },
  {
    "title": "Bob Ross paintings to be auctioned to support public TV stations after federal funding cuts",
    "description": "Thirty paintings by Bob Ross are set to be auctioned to support public television stations",
    "link": "https://abcnews.go.com/Business/wireStory/bob-ross-paintings-auctioned-support-public-tv-stations-126291689",
    "timestamp": "2025-10-08T06:13:47Z"
  },
  {
    "title": "National Guard troops are outside Chicago and could be in Memphis soon in Trump's latest deployment",
    "description": "National Guard troops are positioned outside Chicago and they could soon be in Memphis as the Trump administration pushes ahead with an aggressive policy toward big-city crime whether local leaders support it or not",
    "link": "https://abcnews.go.com/US/wireStory/national-guard-troops-chicago-memphis-trumps-latest-deployment-126317995",
    "timestamp": "2025-10-08T06:13:43Z"
  },
  {
    "title": "Analysis-Turkey's gas shift threatens Russia and Iran's last big European market",
    "description": "ISTANBUL (Reuters) -Turkey could meet more than half of its gas needs by the end of 2028 by ramping up production and increasing U.S. imports, in a shift...",
    "link": "https://finance.yahoo.com/news/analysis-turkeys-gas-shift-threatens-061118977.html",
    "timestamp": "2025-10-08T06:11:18Z"
  },
  {
    "title": "Man dies in likely bear attack at Arkansas campsite days after sending photos of animal to family",
    "description": "A Missouri man was found dead from a likely bear attack this week, just two days after he sent photos to his family of a bear at his campsite in Arkansas, according to officials. Police found the 60-year-old man’s body several hundred yards from his campsite …",
    "link": "https://freerepublic.com/focus/f-chat/4344995/posts",
    "timestamp": "2025-10-08T06:07:55Z"
  },
  {
    "title": "The unraveling of a pardon: Dinesh D’Souza now shills for Israel years after Trump clemency",
    "description": "Dinesh D’Souza was prosecuted in 2014 for campaign finance violations (using “straw donors” to exceed contribution limits). Critics, including Harvard’s Alan Dershowitz, argued the harsh sentencing (probation, fines, mandatory therapy) was politically motivat…",
    "link": "https://www.naturalnews.com/2025-10-08-dinesh-dsouza-pardoned-by-trump-israel-shill.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Hamas softens hostage terms as Houthi sanctions deepen regional tensions",
    "description": "Hamas appeared to soften its stance by offering to release hostages in exchange for a fighting pause, but Israel insists any deal must include Hamas’s complete disarmament. Negotiations have grown more direct: Israel’s Mossad chief is now engaging with Hamas …",
    "link": "https://www.naturalnews.com/2025-10-08-hamas-softens-hostage-terms-houthi-sanctions-deepen-tensions.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Israeli airstrikes continue to pound Gaza despite Trump-ordered CEASEFIRE",
    "description": "Despite U.S. President Trump’s directive to “immediately stop the bombing,” Israel continues devastating strikes, killing over 100 Palestinians in two days. Targets include densely populated neighborhoods, refugee camps and aid centers, worsening Gaza’s human…",
    "link": "https://www.naturalnews.com/2025-10-08-israeli-attacks-gaza-despite-trump-ordered-ceasefire.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Trump signals readiness to invoke Insurrection Act amid legal battles over National Guard deployments",
    "description": "President Donald Trump has stated he is prepared to use the Insurrection Act of 1807 if courts or Democratic-led states obstruct federal efforts to restore order in cities like Portland and Chicago. He claims the Act is necessary to ensure public safety if lo…",
    "link": "https://www.naturalnews.com/2025-10-08-trump-invoke-insurrection-act-national-guard-deployments.html",
    "timestamp": "2025-10-08T06:00:00Z"
  },
  {
    "title": "Federal showdown: Texas National Guard deploys to Chicago amid escalating immigration clash",
    "description": "Texas National Guard troops arrive in Chicago following Trump’s order to combat violent unrest and enforce immigration laws. Illinois officials file lawsuit against federal intervention, accusing Trump of overreach and violating state sovereignty. Chicago May…",
    "link": "https://www.naturalnews.com/2025-10-08-texas-national-guard-deploys-to-chicago-immigration-clash.html",
    "timestamp": "2025-10-08T06:00:00Z"
  }
]