[
  {
    "title": "Supreme Court Upholds Tennessee Law Banning Care for Trans Kids",
    "description": "'U.S. v. Skrmetti' concerns a law restricting puberty blockers and hormone therapy for trans kids under 18 — but not for non-trans youth.",
    "link": "http://www.rollingstone.com/politics/politics-features/skrmetti-supreme-court-trans-youth-health-care-ruling-1235367581/",
    "timestamp": "2025-06-18T17:45:12Z"
  },
  {
    "title": "CFPB Wants to Scale Back Use of Civil Penalty Fund",
    "description": "America’s consumer protection watchdog has proposed scaling back use of its civil penalty fund. [contact-form-7] This latest change at the Consumer Financial Protection Bureau (CFPB), announced Wednesday (June 18), would restrict use of the fund to compensati…",
    "link": "http://www.pymnts.com/news/cfpb/2025/cfpb-wants-to-scale-back-use-of-civil-penalty-fund/",
    "timestamp": "2025-06-18T17:44:57Z"
  },
  {
    "title": "Why are lobbyists trying to kill Trump's 'revenge tax'?",
    "description": "Analysts say it would deter foreign investment",
    "link": "https://theweek.com/politics/trump-revenge-tax-lobbyist-foreign-investment",
    "timestamp": "2025-06-18T17:44:30Z"
  },
  {
    "title": "Former LAPD Chief: Sending Troops To Los Angeles Is A Major Mistake",
    "description": "At some point, there’s supposed to 4,000 National Guard troops and 700 Marines added to a volatile mix that already includes peaceful protesters, some not-so-peaceful protesters, definitely-not-peaceful peace officers, and a large migrant community already on…",
    "link": "https://www.techdirt.com/2025/06/18/former-lapd-chief-sending-troops-to-los-angeles-is-a-major-mistake/",
    "timestamp": "2025-06-18T17:44:00Z"
  },
  {
    "title": "How discussion becomes discord: Three avoidable steps on the path to polarization",
    "description": "New research examines how people become entrenched in polarizing positions and how we can prevent debates from devolving into heated arguments.",
    "link": "https://theconversation.com/how-discussion-becomes-discord-three-avoidable-steps-on-the-path-to-polarization-257709",
    "timestamp": "2025-06-18T17:43:14Z"
  },
  {
    "title": "Trump Says U.S. ‘May’ or ‘May Not’ Join Israel’s Strikes Against Iran: ‘Nobody Knows What I’m Going To Do’",
    "description": "President Donald Trump refused to say whether the US will be joining an escalating war between Israel and Iran, declaring, \"Nobody knows what I'm going to do.\"\nThe post Trump Says U.S. ‘May’ or ‘May Not’ Join Israel’s Strikes Against Iran: ‘Nobody Knows What …",
    "link": "https://www.mediaite.com/media/news/trump-says-u-s-may-or-may-not-join-israels-strikes-against-iran-nobody-knows-what-im-going-to-do/",
    "timestamp": "2025-06-18T17:43:02Z"
  },
  {
    "title": "The Trump Administration Is Shutting Down the National Suicide Hotline’s Program for LGBTQ Youth",
    "description": "The Trump administration is shutting down services for LGBTQ youth who call 988, the national suicide hotline. Since the hotline’s launch in 2022, hotline callers could press 3 to speak with counselors trained to work specifically with LGBTQ youth, who are fo…",
    "link": "https://www.motherjones.com/politics/2025/06/trump-ending-lgbtq-suicide-hotline/",
    "timestamp": "2025-06-18T17:42:26Z"
  },
  {
    "title": "Will the new Middle East crisis rock the world economy? The markets say no – but I fear they’re wrong | Larry Elliott",
    "description": "The oil shocks of the 1970s-90s had brutal economic impacts. As Israel attacks Iran, a moderate rise in oil prices rests on questionable assumptions\nFinancial markets picked up the clear message when Donald Trump cut short his stay at the G7 summit in the Can…",
    "link": "https://biztoc.com/x/e46bad9357f29b69",
    "timestamp": "2025-06-18T17:40:55Z"
  },
  {
    "title": "Gabbard: Trump and I Are Saying The Same Thing — Somehow",
    "description": "President Donald Trump publicly dismissed Director of National Intelligence Tulsi Gabbard’s testimony on Iran’s nuclear program this week, saying, “I don’t care what she said,” when asked about her remarks. \nGabbard had testified in March that U.S. intelligen…",
    "link": "https://biztoc.com/x/be17007c3ea5e2e7",
    "timestamp": "2025-06-18T17:40:34Z"
  },
  {
    "title": "Juneteenth festival organizers focus on 'resilience' amid attacks on DEI initiatives",
    "description": "Juneteenth festival organizers focus on 'resilience' amid attacks on DEI initiativesgo.com",
    "link": "https://abcnews.go.com/US/juneteenth-festival-organizers-focus-resilience-amid-attacks-dei/story?id=122967626",
    "timestamp": "2025-06-18T17:40:00Z"
  },
  {
    "title": "Medicare and Social Security go-broke dates pushed up due to rising health care costs, new SSA law",
    "description": "The go-broke dates for Medicare and Social Security’s trust funds have moved up as rising health care costs and new legislation affecting Social Security benefits have contributed to closer projected depletion dates",
    "link": "https://www.wftv.com/news/health/medicare-social/LU2ALN5VKVAM7MW4XRKI7AZIHQ/",
    "timestamp": "2025-06-18T17:39:34Z"
  },
  {
    "title": "Hackers Targeted Satellite Internet Service Viasat",
    "description": "Viasat isn't divulging details about the hack. But Bloomberg reports the intrusion has been linked to the notorious Chinese state-sponsored hacking group called 'Salt Typhoon.'\nA notorious Chinese state-sponsored hacking group may have also infiltrated satell…",
    "link": "https://uk.pcmag.com/networking/158648/hackers-targeted-satellite-internet-service-viasat",
    "timestamp": "2025-06-18T17:39:08Z"
  },
  {
    "title": "Hackers Targeted Satellite Internet Service Viasat",
    "description": "Viasat isn't divulging details about the hack. But Bloomberg reports the intrusion has been linked to the notorious Chinese state-sponsored hacking group called 'Salt Typhoon.'\nA notorious Chinese state-sponsored hacking group may have also infiltrated satell…",
    "link": "https://me.pcmag.com/en/networking/30490/hackers-targeted-satellite-internet-service-viasat",
    "timestamp": "2025-06-18T17:39:08Z"
  },
  {
    "title": "Asim Munir to meet Donald Trump at the White House: Lunch date sparks memes, mystery, and a whole lot of buzz",
    "description": "US President Donald Trump met Pakistan Army Chief Field Marshal Asim Munir in Washington amid the ongoing Iran-Israel war. The rare closed-door meeting sparked speculation over Pakistan’s mediation ambitions, counterterrorism ties, and its support for Iran. I…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/asim-munir-to-meet-donald-trump-at-the-white-house-lunch-date-sparks-memes-mystery-and-a-whole-lot-of-buzz/articleshow/121936906.cms",
    "timestamp": "2025-06-18T17:38:58Z"
  },
  {
    "title": "Supreme Court upholds Tennessee law barring gender-affirming care for youth",
    "description": "Critics have denounced the US ruling as endangering transgender youth by preventing medical access to puberty blockers.",
    "link": "https://www.aljazeera.com/news/2025/6/18/supreme-court-upholds-tennessee-law-barring-gender-affirming-care-for-youth",
    "timestamp": "2025-06-18T17:36:33Z"
  },
  {
    "title": "Trump: Iran wants to make a deal",
    "description": "President Donald Trump on Wednesday told reporters that Washington has \"made a lot of progress\" with Iran, and that Iran \"wants ...",
    "link": "https://biztoc.com/x/57e71c52a45cd508",
    "timestamp": "2025-06-18T17:35:45Z"
  },
  {
    "title": "If Trump makes Iran-Israel ‘America’s War’, how long can China-Russia stay away?",
    "description": "Amidst escalating tensions between Iran and Israel, echoes of past US interventions resurface as Trump seemingly aligns with Netanyahu's stance on Iran's nuclear capabilities, contradicting US intelligence assessments. China's influence in the region faces li…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/if-trump-makes-iran-israel-americas-war-how-long-can-china-russia-stay-away/articleshow/121937239.cms",
    "timestamp": "2025-06-18T17:33:19Z"
  },
  {
    "title": "U.S. Wants Nothing Less Than “Unconditional Surrender” From Iran",
    "description": "United States ruler Donald Trump is asking for an unconditional surrender from Iran, after Israel's preemptive strike that sparked attacks in a new conflict.  In a series of posts on his Truth Social, Trump also claimed that “we now have complete and total co…",
    "link": "https://www.shtfplan.com/headline-news/u-s-wants-nothing-less-than-unconditional-surrender-from-iran",
    "timestamp": "2025-06-18T17:30:45Z"
  },
  {
    "title": "VA Changes Discrimination Policy for Health Care Staff, Denies Doctors Could Withhold Treatment",
    "description": "The department said the change was made in order to comply with executive orders and the updates would \"have no impact whatsoever on who VA treats or works at VA.\"",
    "link": "https://www.military.com/daily-news/2025/06/18/va-changes-discrimination-policy-health-care-staff-denies-doctors-could-withhold-treatment.html",
    "timestamp": "2025-06-18T17:30:05Z"
  },
  {
    "title": "Healthcare company onboards Trump crypto adviser, buys $20M BTC",
    "description": "The initial purchase of more than 187 BTC was part of a larger strategy to “substantially increase its Bitcoin holdings,” according to Prenetics.",
    "link": "https://cointelegraph.com/news/prenetics-health-company-bitcoin-investment",
    "timestamp": "2025-06-18T17:30:00Z"
  },
  {
    "title": "Donald Trump calls for huge rate cuts as he calls Fed’s Powell ‘stupid’",
    "description": "Donald Trump calls for huge rate cuts and says Fed chief is ‘stupid’\nSign up for your free, indispensable guide to what Trump’s second term means for Washington, business and the world.\nAs the president threatens a trade war, follow the latest on tariffs and …",
    "link": "https://biztoc.com/x/b088a823997759a6",
    "timestamp": "2025-06-18T17:29:52Z"
  },
  {
    "title": "Unless the Trump family secretly built a U.S. factory, industry experts say the $500 Made in America smartphone is a fantasy",
    "description": "Donald Trump’s family business is putting the president’s name behind something that few have dared to produce in years: A Made in America smartphone.\nThe Trump Organization, led by the president’s eldest sons, said on Monday that it has licensed Donald Trump…",
    "link": "https://biztoc.com/x/31303b2313276e96",
    "timestamp": "2025-06-18T17:29:47Z"
  },
  {
    "title": "Trump Admin Considers Expanding Travel Restrictions To 36 Additional Countries",
    "description": "Trump Admin Considers Expanding Travel Restrictions To 36 Additional Countries\n \nAuthored by Joseph Lord via The Epoch Times,\nPresident Donald Trump’s administration is considering substantially expanding travel restrictions to include nationals from 36 count…",
    "link": "https://biztoc.com/x/2618216dc86a9780",
    "timestamp": "2025-06-18T17:29:27Z"
  },
  {
    "title": "Can’t Sit Here! NAACP Refuses To Invite Donald Trump To National Convention After 116-Year Tradition",
    "description": "NAACP president Derrick Johnson announced that they will not be inviting Donald Trump to national conference breaking a 116 year tradition of inviting the sitting president \nThe post Can’t Sit Here! NAACP Refuses To Invite Donald Trump To National Convention …",
    "link": "https://bossip.com/3147065/naacp-wont-invite-donald-trump-to-national-conference/",
    "timestamp": "2025-06-18T17:29:22Z"
  },
  {
    "title": "Report: China’s COSCO in Talks to Join $19B CK Hutchison Port Sale Amid U.S.-China Tensions",
    "description": "China’s largest shipping company is among the firms in talks to invest in a multinational consortium seeking to buy billionaire Li Ka-shing’s global ports, according to people familiar with the matter, in an effort to ease Beijing’s concerns over the controve…",
    "link": "https://gcaptain.com/report-chinas-cosco-in-talks-to-join-19b-ck-hutchison-port-sale-amid-u-s-china-tensions/",
    "timestamp": "2025-06-18T17:29:09Z"
  },
  {
    "title": "Justice Sotomayor Says Supreme Court Just Countered 'Decades' of Precedent",
    "description": "Justice Sonia Sotomayor dissented from a Supreme Court decision to uphold a law banning medical treatments for transgender youth.",
    "link": "https://www.newsweek.com/justice-sotomayor-says-supreme-court-just-countered-decades-precedent-2087495",
    "timestamp": "2025-06-18T17:28:45Z"
  },
  {
    "title": "Why Fordow is not Chernobyl: Experts give the green light for a strike on Iran’s nuclear facility – The risk of radiation",
    "description": "Scientists emphasize that any radiation leak would be limited, without serious environmental or health consequences for the broader region – What sets this apart from the bombing of a nuclear reactor\nThe post Why Fordow is not Chernobyl: Experts give the gree…",
    "link": "https://en.protothema.gr/2025/06/18/why-fordow-is-not-chernobyl-experts-give-the-green-light-for-a-strike-on-irans-nuclear-facility-the-risk-of-radiation/",
    "timestamp": "2025-06-18T17:27:40Z"
  },
  {
    "title": "BREAKING: Israel Finally ATTACKS Khamenei’s Bunker - President’s Plane Leaves Tehran",
    "description": "Run time 12m 34 s BREAKING: Israel Finally ATTACKS Khamenei’s Bunker - President’s Plane Leaves Tehran https://www.youtube.com/watch?v=1pBUbT3T3Bk&pp=ygUIdG91c2kgdHY%3D",
    "link": "https://freerepublic.com/focus/f-news/4323853/posts",
    "timestamp": "2025-06-18T17:27:05Z"
  },
  {
    "title": "Medicare and Social Security go-broke dates pushed up due to rising health care costs, new SSA law",
    "description": "The go-broke dates for Medicare and Social Security’s trust funds have moved up as rising health care costs and new legislation affecting Social Security benefits have contributed to closer projected depletion dates",
    "link": "https://abcnews.go.com/Politics/wireStory/medicare-social-security-broke-dates-pushed-due-rising-122975501",
    "timestamp": "2025-06-18T17:26:32Z"
  },
  {
    "title": "Trump says supporters are 'more in love' with him than ever, as involvement in Iran roils MAGA world",
    "description": "President Donald Trump is downplaying any notion that his supporters are cooling on him amid uncertainty over whether he will order a U.S. strike on Iran",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-supporters-love-involvement-iran-roils-maga-world-122978793",
    "timestamp": "2025-06-18T17:26:30Z"
  },
  {
    "title": "YouTube star Doctor Mike has warning for RFK Jr.’s ‘MAHA’ movement",
    "description": "Doctor Mike critiques RFK Jr.'s MAHA movement, urges real food reform and better nutrition education.",
    "link": "https://nypost.com/2025/06/18/health/youtube-star-doctor-mike-has-warning-for-rfk-jr-s-maha-movement/",
    "timestamp": "2025-06-18T17:25:46Z"
  },
  {
    "title": "Report Names 'Corporate Oligarchs' Who Are Cashing In as Trump-GOP Austerity Assails Workers",
    "description": "Climate action, pro-democracy, and other civil society groups have warned for months that the Trump administration and Republicans in Congress are intent on cutting essential programs that millions of Americans rely on while providing the richest households a…",
    "link": "https://www.commondreams.org/news/trump-oligarchy",
    "timestamp": "2025-06-18T17:25:42Z"
  },
  {
    "title": "Breaking Big: Iranian Government Plane Lands in Oman",
    "description": "An Iranian government plane reportedly landed in Oman on Wednesday. This is where the US and Oman officials were holding their nuclear talks. This is a very distinct sign that Iranian officials are worried and that they are backed into a corner. ........ Snip…",
    "link": "https://freerepublic.com/focus/f-bloggers/4323851/posts",
    "timestamp": "2025-06-18T17:23:57Z"
  },
  {
    "title": "Ex-CIA Insight: Larry Johnson Reveals What's Really at Stake as Trump Mulls Iran Attack",
    "description": "With Tehran refusing to fold in the face of US ultimatums and threats, Donald Trump is considering joining Israel's campaign of aggression. Sputnik asked veteran ex-CIA and State Department insider Larry Johnson to make sense of the administration's calculati…",
    "link": "https://sputnikglobe.com/20250618/ex-cia-insight-larry-johnson-reveals-whats-really-at-stake-as-trump-mulls-iran-attack-1122282438.html",
    "timestamp": "2025-06-18T17:23:29Z"
  },
  {
    "title": "After a night of terror in Kyiv, the search for dead goes on",
    "description": "A cruise missile slammed into an ordinary residential block early on Tuesday, likely travelling at about 500mph.",
    "link": "https://www.bbc.com/news/articles/c98j1y70e95o",
    "timestamp": "2025-06-18T17:22:39Z"
  },
  {
    "title": "China warns Israel-Iran conflict could spiral ‘out of control’",
    "description": "BEIJING: China’s Foreign Minister Wang Yi on Wednesday (Jun 18) warned that escalating hostilities between Israel and Iran could spiral out of control, urging all sides to prioritise a ceasefire to prevent the region from sliding into an “abyss”. Israel and I…",
    "link": "https://www.channelnewsasia.com/world/china-warns-israel-iran-conflict-could-spiral-out-control-5190391",
    "timestamp": "2025-06-18T17:22:15Z"
  },
  {
    "title": "Nippon Steel acquires US Steel for $14.9bn after months of struggle",
    "description": "The deal also allows US President Donald Trump to appoint a board member.",
    "link": "https://www.aljazeera.com/economy/2025/6/18/nippon-steel-acquires-us-steel-for-14-9bn-after-months-of-struggle",
    "timestamp": "2025-06-18T17:21:27Z"
  },
  {
    "title": "Unless the Trump family secretly built a U.S. factory, industry experts say the $500 made-in-America smartphone is a fantasy",
    "description": "The Trump Organization’s promise of a U.S.-built phone flies in the face of years of domestic manufacturing realities.",
    "link": "https://tech.yahoo.com/phones/articles/unless-trump-family-secretly-built-172044723.html",
    "timestamp": "2025-06-18T17:20:44Z"
  },
  {
    "title": "Unless the Trump family secretly built a U.S. factory, industry experts say the $500 Made in America smartphone is a fantasy",
    "description": "The Trump Organization's promise of a U.S.-built phone flies in the face of years of domestic manufacturing realities.",
    "link": "https://fortune.com/2025/06/18/trump-phone-made-in-america-smartphone-skeptics/",
    "timestamp": "2025-06-18T17:20:44Z"
  },
  {
    "title": "Trump to extend TikTok sale deadline for a third time",
    "description": "President Donald Trump will sign an executive order this week to extend a deadline for TikTok’s Chinese owner to divest the popular video sharing app, the White House announced Tuesday.\nTrump had signed an order in early April to keep TikTok running for an ad…",
    "link": "https://biztoc.com/x/57c9357844ee14ba",
    "timestamp": "2025-06-18T17:18:31Z"
  },
  {
    "title": "GOP’s Hawley says Trump was unaware of key element in Republican megabill",
    "description": "Changes to Medicaid’s provider tax are a controversial part of the Republicans' megabill. Donald Trump should probably know that, but he doesn't.",
    "link": "https://biztoc.com/x/1af2522af205c6dd",
    "timestamp": "2025-06-18T17:18:29Z"
  },
  {
    "title": "Bad Bunny bashes ICE “sons of b****” in video of Puerto Rico raid",
    "description": "The Puerto Rican artist has joined the chorus of public outrage against President Trump’s deportation agenda.",
    "link": "https://www.thefader.com/2025/06/18/bad-bunny-ice-puerto-rico",
    "timestamp": "2025-06-18T17:17:24Z"
  },
  {
    "title": "US Fed rate cut: Donald Trump to appoint himself to lead Federal Reserve soon? Here's what American President has to say",
    "description": "US Fed rate cut decision is set to be out on Wednesday even as US President Donald Trump has made shocking remarks.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-fed-rate-cut-donald-trump-to-appoint-himself-to-lead-federal-reserve-soon-heres-what-american-president-has-to-say/articleshow/121936890.cms",
    "timestamp": "2025-06-18T17:15:08Z"
  },
  {
    "title": "WATCH: Two Flagpoles -- Gifts from Donald Trump -- Go Up on White House Lawn",
    "description": "The two flagpoles that President Donald Trump gifted to the White House have officially gone up on the White House lawn.\nThe post WATCH: Two Flagpoles — Gifts from Donald Trump — Go Up on White House Lawn appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/18/watch-two-flagpoles-gifts-from-donald-trump-go-up-white-house-lawn/",
    "timestamp": "2025-06-18T17:15:06Z"
  },
  {
    "title": "Exclusive: Jamaica’s Ambassador Antony Anderson On Strengthening U.S. Ties, Economic Growth, And The Future Of The Island",
    "description": "Ambassador Antony Anderson outlines his vision for Jamaica’s growth, U.S. relations, and expanding global influence",
    "link": "https://www.forbes.com/sites/richardfowler/2025/06/18/exclusive-jamaicas-ambassador-antony-anderson-on-strengthening-us-ties-economic-growth-and-the-future-of-the-island/",
    "timestamp": "2025-06-18T17:15:04Z"
  },
  {
    "title": "Gabbard Dispute Shows Trump Willing to Ignore Intelligence for War With Iran",
    "description": "A growing public fallout between President Donald Trump and Director of National Intelligence Tulsi Gabbard has exposed what anti-war critics are denouncing as glaring efforts to push aside inconvenient intelligence as Israel attempts to force U.S. military i…",
    "link": "https://www.commondreams.org/news/tulsi-gabbard-iran-trump",
    "timestamp": "2025-06-18T17:14:59Z"
  },
  {
    "title": "What to know about the impacts of the Supreme Court's ruling on transgender care for youth",
    "description": "The U.S. Supreme Court said Tennessee did not violate the constitution by banning gender-affirming care for transgender minors.",
    "link": "https://www.click2houston.com/news/politics/2025/06/18/what-to-know-about-the-impacts-of-the-supreme-courts-ruling-on-transgender-care-for-youth/",
    "timestamp": "2025-06-18T17:14:48Z"
  },
  {
    "title": "Peter Welch Derails Biden Cover-Up Hearing With 7-Minute Rant",
    "description": "Peter Welch derailed a hearing on the cover-up of Joe Biden's decline by launching into a seven-minute rant.",
    "link": "https://dailycaller.com/2025/06/18/peter-welch-derails-biden-cover-up-hearing-with-7-minute-rant/",
    "timestamp": "2025-06-18T17:14:41Z"
  },
  {
    "title": "How The Israel-Iran Conflict Could Impact The Ukraine War",
    "description": "As yet another one of his key allies in the region faces an existential crisis, Vladimir Putin is presented with a major opportunity — and many challenges.",
    "link": "https://www.huffpost.com/entry/how-the-israel-iran-conflict-could-affect-ukraine_n_68528436e4b0672778c424bb",
    "timestamp": "2025-06-18T17:14:22Z"
  },
  {
    "title": "US Soldiers Being Served 'Deployment Meal' Sparks Speculation",
    "description": "The video viewed 9 million times shows U.S. troops being served lobster and steak.",
    "link": "https://www.newsweek.com/us-army-deployment-meal-video-viral-2087333",
    "timestamp": "2025-06-18T17:14:14Z"
  },
  {
    "title": "Archer Aviation Is Betting Big on Its Fledgling Defense Business. Does That Make ACHR Stock a Buy Here?",
    "description": "Archer Aviation is a company that is gaining traction in multiple expanding addressable markets. Is ACHR stock a good buy right now?",
    "link": "https://www.barchart.com/story/news/32944101/archer-aviation-is-betting-big-on-its-fledgling-defense-business-does-that-make-achr-stock-a-buy-here",
    "timestamp": "2025-06-18T17:13:03Z"
  },
  {
    "title": "Visual guide to Fordo: Iran’s secretive nuclear site that only a US bomb could hit - BBC News",
    "description": "Hidden away in a mountainside south of Tehran is an enrichment plant that is vital to Iran’s nuclear ambitions - and Israel’s attempts to dismantle them.",
    "link": "https://www.bbc.co.uk/news/resources/idt-868e3c3d-25ec-43cb-bcc0-8832464b91ca",
    "timestamp": "2025-06-18T17:12:41Z"
  },
  {
    "title": "No evidence of nuclear threat from Iran – ex-UK ambassador",
    "description": "Israel claims Iran was on the brink of obtaining nuclear weapons to justify the latest attacks Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619674-no-evidence-iran-nuclear-weapons/",
    "timestamp": "2025-06-18T17:11:13Z"
  },
  {
    "title": "Highly Profitable Corporations Amass Trillions In Cash And Pay Out Trillions In Dividends",
    "description": "Data on nonfinancial corporations show high profits, trillions in cash, large dividend payouts and modest capital expenditures.",
    "link": "https://www.forbes.com/sites/christianweller/2025/06/18/highly-profitable-corporations-amass-trillions-in-cash-and-pay-out-trillions-in-dividends/",
    "timestamp": "2025-06-18T17:10:31Z"
  },
  {
    "title": "Trump weighs joining Iran strikes after calling for 'unconditional surrender' (James FitzGerald/BBC)",
    "description": "James FitzGerald / BBC:\nTrump weighs joining Iran strikes after calling for ‘unconditional surrender’  —  US President Donald Trump is considering whether to join Israel's strikes on Iran's nuclear sites, as the conflict continues for a sixth day and angry rh…",
    "link": "https://www.memeorandum.com/250618/p81",
    "timestamp": "2025-06-18T17:10:00Z"
  },
  {
    "title": "Watch: Trump Shows White House Reporters How 'Real People Work'",
    "description": "With the eyes of the world on the White House, President Donald Trump wants the focus on \"real people\" at work.",
    "link": "https://www.westernjournal.com/watch-trump-shows-white-house-reporters-real-people-work/",
    "timestamp": "2025-06-18T17:09:22Z"
  },
  {
    "title": "Supreme Court upholds Tennessee’s ban on gender-affirming care for transgender youth",
    "description": "The Supreme Court on Wednesday upheld Tennessee’s ban on gender-affirming care for transgender minors, a stunning setback to transgender rights.\n\n\n\nThe justices’ 6-3 decision in a case from Tennessee effectively protects from legal challenges many efforts by …",
    "link": "https://www.fastcompany.com/91354543/supreme-court-upholds-tennessee-ban-transgender-care-minors",
    "timestamp": "2025-06-18T17:08:39Z"
  },
  {
    "title": "Sam Altman Heaps Praise on Donald Trump",
    "description": "OpenAI CEO Sam Altman is gushing over president Donald Trump's mammoth $500 billion AI infrastructure project, dubbed Stargate. The buzzy initiative made headlines in January, with the likes of OpenAI, Japanese investment group SoftBank, and the software gian…",
    "link": "https://futurism.com/sam-altman-heaps-praise-donald-trump",
    "timestamp": "2025-06-18T17:08:09Z"
  },
  {
    "title": "Rick Scott: Senate Cannot Squander Opportunity to Improve 'Big, Beautiful Bill' for American Families",
    "description": "Republicans in the Senate cannot squander\" their opportunity to better the \"big, beautiful bill,\" Sen. Rick Scott (R-FL) said on Monday.\nThe post Rick Scott: Senate Cannot Squander Opportunity to Improve ‘Big, Beautiful Bill’ for American Families appeared fi…",
    "link": "https://www.breitbart.com/politics/2025/06/18/rick-scott-senate-cannot-squander-opportunity-to-improve-big-beautiful-bill-for-american-families/",
    "timestamp": "2025-06-18T17:07:09Z"
  },
  {
    "title": "‘Just so delicious’: Watch E. Jean Carroll go on unhinged rant about taking ‘revenge’ on Trump",
    "description": "'Where my pleasure comes is making him so pissed off he can't think'",
    "link": "https://www.wnd.com/2025/06/just-so-delicious-watch-e-jean-carroll-go/",
    "timestamp": "2025-06-18T17:06:46Z"
  },
  {
    "title": "Gavin Newsom's Chances of Being 2028 Democratic Nominee Surge—Poll",
    "description": "Newsom's support ticked up in the latest poll after the Los Angeles protests over President Trump's immigration policy.",
    "link": "https://www.newsweek.com/gavin-newsom-chances-democratic-nominee-surge-poll-2087479",
    "timestamp": "2025-06-18T17:05:31Z"
  },
  {
    "title": "Elon Says He’s Working to ‘Fix’ Grok After AI Disagrees With Him on Right-Wing Violence",
    "description": "Musk thinks his AI is corrupted by the \"legacy media.\"",
    "link": "https://gizmodo.com/elon-says-hes-working-to-fix-grok-after-ai-disagrees-with-him-on-right-wing-violence-2000617420",
    "timestamp": "2025-06-18T17:05:03Z"
  },
  {
    "title": "Dick Durbin Plays Supercut of Trump’s ‘Cognitive Decline’ at Hearing on Biden’s Mental Acuity",
    "description": "Sen. Dick Durbin unveiled a supercut of President Donald Trump's \"cognitive decline\" as he took the floor during a Senate hearing investigating former President Joe Biden's mental acuity and its possible cover-up.\nThe post Dick Durbin Plays Supercut of Trump’…",
    "link": "https://www.mediaite.com/media/news/dick-durbin-plays-supercut-of-trumps-cognitive-decline-at-hearing-on-bidens-mental-acuity/",
    "timestamp": "2025-06-18T17:03:04Z"
  },
  {
    "title": "Transportation Sec. Duffy Tells Sanctuary Cities Feds Are Not Paying for Anti-ICE Riot Damage",
    "description": "L.A. riots costs reach nearly $20 million for police and city repairs.\nThe post Transportation Sec. Duffy Tells Sanctuary Cities Feds Are Not Paying for Anti-ICE Riot Damage first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/transportation-sec-duffy-tells-sanctuary-cities-feds-are-not-paying-for-anti-ice-riot-damage/",
    "timestamp": "2025-06-18T17:00:26Z"
  },
  {
    "title": "US Supreme Court delivers big blow to transgender rights as it okays Tennessee ban on gender-affirming care for kids",
    "description": "The Supreme Court on Wednesday upheld a Tennessee law restricting gender transition care for minors, delivering a major blow to transgender rights. Upon taking office in January, President Donald Trump has set about unwinding Biden policies that sought to bol…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-supreme-court-delivers-big-blow-to-transgender-rights-as-it-okays-tennessee-ban-on-gender-affirming-care-for-kids/articleshow/121936766.cms",
    "timestamp": "2025-06-18T17:00:05Z"
  },
  {
    "title": "Congress just passed a landmark stablecoin bill. 5 things to know about the booming corner of crypto.",
    "description": "Congress passed the GENIUS Act this week, boosting the market for stablecoins. Here's what investors need to know about the corner of the crypto market.",
    "link": "https://www.businessinsider.com/genius-act-stablecoin-congress-crypto-regulation-bitcoin-trump-us-treasurys-2025-6",
    "timestamp": "2025-06-18T16:59:51Z"
  },
  {
    "title": "Arrow Missile Claims Could Set Stage for Us To Enter War: Israeli Source",
    "description": "Israel's Arrow air defense systems were designed to combat Iranian missile strikes, but have been reported to be running low.",
    "link": "https://www.newsweek.com/arrow-3-interceptor-missile-us-involvement-iran-2087292",
    "timestamp": "2025-06-18T16:59:08Z"
  },
  {
    "title": "LA Police Chief Did Not Ask for Federal Help",
    "description": "In defending his decision to deploy the National Guard and Marines to Los Angeles, President Donald Trump has distorted comments made by Los Angeles Police Chief Jim McDonnell. \nThe post LA Police Chief Did Not Ask for Federal Help appeared first on FactCheck…",
    "link": "https://www.factcheck.org/2025/06/la-police-chief-did-not-ask-for-federal-help/",
    "timestamp": "2025-06-18T16:58:56Z"
  },
  {
    "title": "Hulk Hogan Hospitalized, Rumored to Be ‘On Deathbed’",
    "description": "Reading Time: 3 minutesHulk Hogan has reportedly been hospitalized with severe health issues.\nHulk Hogan Hospitalized, Rumored to Be ‘On Deathbed’ was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/06/hulk-hogan-hospitalized-rumored-to-be-on-deathbed/",
    "timestamp": "2025-06-18T16:57:43Z"
  },
  {
    "title": "Barack Obama warns the U.S. is ‘dangerously close’ to slipping into autocracy under Trump",
    "description": "In rare public remarks, Barack Obama issued a warning on the state of American democracy but said he’s still “optimistic” about the future of the U.S.",
    "link": "https://www.msnbc.com/top-stories/latest/barack-obama-trump-speech-trump-autocracy-rcna213729",
    "timestamp": "2025-06-18T16:56:52Z"
  },
  {
    "title": "Keyera buying Plains' Canadian natural gas liquids business for $5.15 billion",
    "description": "Keyera Corp. has signed a deal to buy Plains' Canadian natural gas liquids business, as well as select U.S. assets, for $5.15 billion in cash.",
    "link": "https://www.cbc.ca/news/canada/calgary/keyera-buying-plains-canadian-natural-gas-liquids-business-for-5-15-billion-1.7564516",
    "timestamp": "2025-06-18T16:56:04Z"
  },
  {
    "title": "'Any illegal immigrants?' Trump grills White House workers on live TV",
    "description": "President Donald Trump hijacked his own press conference Tuesday to publicly interrogate construction workers at the White House about their immigration status.The president was fielding questions about his mass deportation campaign outside the White House wh…",
    "link": "https://www.rawstory.com/trump-immigration-2672396104/",
    "timestamp": "2025-06-18T16:55:53Z"
  },
  {
    "title": "Rod Stewart Is No Longer Friends With His Old Neighbor Donald Trump",
    "description": "The musician said he liked that the president was always \"a bit of a man's man,\" but added that Trump \"didn’t, as far as I’m concerned, treat women very well\"",
    "link": "http://www.rollingstone.com/music/music-news/rod-stewart-donald-trump-another-guy-election-1235367454/",
    "timestamp": "2025-06-18T16:55:15Z"
  },
  {
    "title": "Former US ambassador to Ukraine who resigned in protest launches run for Congress in Michigan",
    "description": "Bridget Brink, who stepped down as U.S. ambassador to Ukraine this year in protest of what she said was President Donald Trump’s unfair treatment of the the war-torn country, says she’s running for Congress in one of Michigan’s most competitive distric...",
    "link": "https://abcnews.go.com/Politics/wireStory/former-us-ambassador-ukraine-resigned-protest-launches-run-122976939",
    "timestamp": "2025-06-18T16:54:25Z"
  },
  {
    "title": "Tucker Carlson Torches Ted Cruz Over Biblical Justification for Bombing Iran: ‘What Does That Even Mean?’",
    "description": "Tucker Carlson was left scratching his head over Sen. Ted Cruz's (R-TX) biblical explanation for supporting Israel's bombing of Iran.\nThe post Tucker Carlson Torches Ted Cruz Over Biblical Justification for Bombing Iran: ‘What Does That Even Mean?’ first appe…",
    "link": "https://www.mediaite.com/media/podcasts/tucker-carlson-torches-ted-cruz-over-biblical-justification-for-bombing-iran-what-does-that-even-mean/",
    "timestamp": "2025-06-18T16:54:19Z"
  },
  {
    "title": "Trump’s plan to kill dozens of NASA missions threatens US space supremacy",
    "description": "The White House is calling for a roughly 50% cut to NASA’s science spending.",
    "link": "https://www.denverpost.com/2025/06/18/trumps-plan-to-kill-dozens-of-nasa-missions-threatens-us-space-supremacy/",
    "timestamp": "2025-06-18T16:50:49Z"
  },
  {
    "title": "Trump’s plan to kill dozens of NASA missions threatens US space supremacy",
    "description": "The White House is calling for a roughly 50% cut to NASA’s science spending.",
    "link": "https://www.bostonherald.com/2025/06/18/trumps-plan-to-kill-dozens-of-nasa-missions-threatens-us-space-supremacy/",
    "timestamp": "2025-06-18T16:50:49Z"
  },
  {
    "title": "Gen Z on Vacation Captures Moment Hundreds of Missiles Fly Toward Israel",
    "description": "The 20-year-old told Newsweek she felt a mixture of \"fear and disbelief\" as missiles streaked through the night sky.",
    "link": "https://www.newsweek.com/gen-z-vacation-captures-moment-hundreds-missiles-fly-toward-israel-2087326",
    "timestamp": "2025-06-18T16:48:39Z"
  },
  {
    "title": "Trump Gives TikTok Yet Another Lifeline",
    "description": "As expected, President Donald Trump will extend TikTok's sale deadline for the third time, giving the popular social media app yet another lengthy reprieve to comply with the law.\n[Read More]",
    "link": "https://petapixel.com/2025/06/18/trump-gives-tiktok-yet-another-lifeline/",
    "timestamp": "2025-06-18T16:47:15Z"
  },
  {
    "title": "US Supreme Court backs Tennessee youth transgender care ban",
    "description": "In a setback for transgender rights in the United States, the conservative-dominated court voted to uphold a ban on hormone therapy, puberty blockers and gender transition surgery for minors. The United States Supreme Court on Wednesday upheld a Tennessee law…",
    "link": "https://www.dw.com/en/us-supreme-court-backs-tennessee-youth-transgender-care-ban/a-72966021",
    "timestamp": "2025-06-18T16:47:00Z"
  },
  {
    "title": "US Supreme Court backs Tennessee youth transgender care ban",
    "description": "In a setback for transgender rights in the United States, the conservative-dominated court voted to uphold a ban on hormone therapy, puberty blockers and gender transition surgery for minors.",
    "link": "https://www.dw.com/en/us-supreme-court-backs-tennessee-youth-transgender-care-ban/a-72966021",
    "timestamp": "2025-06-18T16:47:00Z"
  },
  {
    "title": "Top Stock Movers Now: Jabil, Oracle, Zoetis, and More",
    "description": "In This Article:\nKey Takeaways\n-\nU.S. equities rose at midday ahead of the latest announcement from the Federal Reserve, as President Donald Trump again called on Fed Chair Jerome Powell to cut interest rates.\n-\nJabil and Oracle shares gained as analysts boos…",
    "link": "https://biztoc.com/x/ecaa3a93d6cf16f9",
    "timestamp": "2025-06-18T16:45:22Z"
  },
  {
    "title": "Bannon's comments reflect growing division among Trump's MAGA base",
    "description": "Steve Bannon said it's a mistake for the U.S. to get involved in direct military action against Iran -- urging Trump to question Israeli intel and Netanyahu's warnings.",
    "link": "https://abcnews.go.com/Politics/bannons-comments-reflect-growing-division-trumps-maga-base/story?id=122972849",
    "timestamp": "2025-06-18T16:44:48Z"
  },
  {
    "title": "Trump deploys additional 2,000 National Guard troops to Los Angeles",
    "description": "California Gov. Gavin Newsom and other Democrats have condemned the National Guard deployments, calling them illegal and unnecessary provocations.",
    "link": "https://www.cnbc.com/2025/06/18/trump-national-guard-los-angeles-pete-hegseth.html",
    "timestamp": "2025-06-18T16:44:00Z"
  },
  {
    "title": "Trump’s small crowd for his parade overshadowed by protests",
    "description": "Given the hellscape that is unfolding in the Middle East and the police state that the US has become (with the only good news being that India and Pakistan have pulled back from the threatened brink of a war), to talk about relative crowd sizes at the Trump p…",
    "link": "https://freethoughtblogs.com/singham/2025/06/18/trumps-small-crowd-for-his-parade-overshadowed-by-protests/",
    "timestamp": "2025-06-18T16:43:56Z"
  },
  {
    "title": "Meet The Hawkish General Reportedly Leaving Fingerprints All Over DOD’s Iran Strategy",
    "description": "A hawkish general nicknamed \"the Gorilla\" is reportedly wielding outsized influence over America's Iran strategy according to Politico.",
    "link": "https://dailycaller.com/2025/06/18/dod-eric-kurilla-fingerprints-strategy-iran-report/",
    "timestamp": "2025-06-18T16:42:37Z"
  },
  {
    "title": "Bad Bunny slams ICE raids in Puerto Rico: 'Sons of bitches'",
    "description": "Bad Bunny calls out ICE agents in Puerto Rico, sharing footage of officers escorting people into unmarked cars: 'Sons of bitches, instead of letting the people alone and working.'",
    "link": "https://ew.com/bad-bunny-slams-ice-raids-in-puerto-rico-sons-of-bitches-11757139",
    "timestamp": "2025-06-18T16:40:51Z"
  },
  {
    "title": "Trump's 'Short Attention Span' Led to Changes to NATO Summit to Avoid Any 'Truth Social Bombshells,' Diplomats Say",
    "description": "Next week's NATO summit in The Hague will be brief compared to past events, with organizers reportedly tailoring the agenda to President Trump's limited focus.",
    "link": "https://www.ibtimes.com/trumps-short-attention-span-led-changes-nato-summit-avoid-any-truth-social-bombshells-3776115",
    "timestamp": "2025-06-18T16:40:14Z"
  },
  {
    "title": "Former US ambassador to Ukraine who resigned in protest launches run for Congress in Michigan",
    "description": "Bridget Brink, who stepped down as U.S. ambassador to Ukraine this year in protest of what she said was President Donald Trump's unfair treatment of the the ...",
    "link": "https://www.yahoo.com/news/former-us-ambassador-ukraine-resigned-163943590.html",
    "timestamp": "2025-06-18T16:39:43Z"
  },
  {
    "title": "Jim Acosta Goes On Triggered Tirade Over Popular ICE Raids",
    "description": "Former CNN White House correspondent Jim Acosta's podcast appearance Monday quickly devolved into a \"tirade\" against President Donald Trump and ICE raids.",
    "link": "https://dailycaller.com/2025/06/18/jim-acosta-triggered-tirade-ice-raids-alex-padilla-trump-ex-wife/",
    "timestamp": "2025-06-18T16:39:10Z"
  },
  {
    "title": "Trump breaks from western allies at G7 summit as US weighs joining Iran strikes",
    "description": "Donald Trump exited the G7 summit in Canada early, with a string of social media posts suggesting US involvement in striking Iran.",
    "link": "https://theconversation.com/trump-breaks-from-western-allies-at-g7-summit-as-us-weighs-joining-iran-strikes-259214",
    "timestamp": "2025-06-18T16:38:20Z"
  },
  {
    "title": "Where Trump's Approval Rating Stands as He Touts 'Great Poll Numbers'",
    "description": "\"Great Poll Numbers For Trump!\" the president wrote on Truth Social.",
    "link": "https://www.newsweek.com/donald-trump-approval-rating-update-polls-2087423",
    "timestamp": "2025-06-18T16:38:05Z"
  }
]