[
  {
    "title": "Legal expert explains why dad who shot Brit daughter over 'Donald Trump row' won't face charges",
    "description": "Kris Harrison did not face any legal consequences in the wake of the deadly shooting of his child Lucy on 10 January last year",
    "link": "https://www.ladbible.com/news/uk-news/lucy-harrison-texas-shooting-why-dad-didnt-face-charges-explained-439507-20260213",
    "timestamp": "2026-02-13T09:00:15Z"
  },
  {
    "title": "Today in History: February 13, Supreme Court Justice Antonin Scalia found dead",
    "description": "Justice Antonin Scalia, the influential conservative member of the U.S. Supreme Court, was found dead at a private residence in the Big Bend area of West Texas; he was 79.",
    "link": "https://www.bostonherald.com/2026/02/13/today-in-history-february-13-supreme-court-justice-antonin-scalia-found-dead/",
    "timestamp": "2026-02-13T09:00:06Z"
  },
  {
    "title": "Today in History: February 13, Supreme Court Justice Antonin Scalia found dead",
    "description": "Justice Antonin Scalia, the influential conservative member of the U.S. Supreme Court, was found dead at a private residence in the Big Bend area of West Texas; he was 79.",
    "link": "https://www.denverpost.com/2026/02/13/today-in-history-february-13-supreme-court-justice-antonin-scalia-found-dead/",
    "timestamp": "2026-02-13T09:00:06Z"
  },
  {
    "title": "Reliance wins US licence for Venezuelan oil, sources say",
    "description": "Reliance Industries can now buy Venezuelan oil directly. The US has issued a special license. This move aims to boost Venezuela's oil exports. It will also lower crude costs for Reliance. This helps replace Russian oil supplies. Reliance previously stopped bu…",
    "link": "https://economictimes.indiatimes.com/industry/energy/oil-gas/reliance-wins-us-licence-for-venezuelan-oil-sources-say/articleshow/128297459.cms",
    "timestamp": "2026-02-13T08:46:35Z"
  },
  {
    "title": "Exclusive-India's Reliance wins US licence for Venezuelan oil, sources say",
    "description": "By Nidhi Verma and Jarrett Renshaw NEW DELHI/WASHINGTON, Feb 13 (Reuters) - The United States has issued a general licence to India's Reliance Industries Ltd...",
    "link": "https://sg.finance.yahoo.com/news/exclusive-indias-reliance-wins-us-083951862.html",
    "timestamp": "2026-02-13T08:39:51Z"
  },
  {
    "title": "Trump’s demand for the Fed to ease its monetary policy looks harder to justify: What will Kevin Warsh do?",
    "description": "Strong payroll numbers in the US could mean Trump’s pick to head the Federal Reserve, once Powell exits in May, might have a hard time trying to ease credit—as the White House wants. What Warsh does will be closely watched.",
    "link": "https://www.livemint.com/opinion/online-views/trumps-demand-for-the-fed-to-ease-its-monetary-policy-looks-harder-to-justify-what-will-kevin-warsh-do-11770968616752.html",
    "timestamp": "2026-02-13T08:31:05Z"
  },
  {
    "title": "These Four charts show how reliant Europe is on U.S. digital infrastructure",
    "description": "U.S. companies hold 85% of the European cloud market, per data from Synergy Research Group, a market analytics company.",
    "link": "https://www.cnbc.com/2026/02/13/four-charts-europes-reliance-us-digital-infrastructure.html",
    "timestamp": "2026-02-13T08:30:43Z"
  },
  {
    "title": "Trump pardons five former professional football players",
    "description": "President Donald Trump has pardoned five former professional football players convicted on a range of crimes from perjury, drug trafficking and counterfeiting U.S. currency.",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_74c23a2f-ca08-4bdf-8880-f548f0617a42",
    "timestamp": "2026-02-13T08:24:30Z"
  },
  {
    "title": "The Parsha and Current Events: Impossibilities",
    "description": "The Iranians are suffering from obsessive, compulsive hatred of the Jews and of Israel and do not hide their intention of using any and every means to eradicate the lives of 8 million Jews in Israel. Is it wise to wait and see?!",
    "link": "https://www.israelnationalnews.com/news/422378",
    "timestamp": "2026-02-13T08:24:29Z"
  },
  {
    "title": "Int’l climate cooperation ‘antidote to chaos,’ say top UN official at Istanbul talks",
    "description": "Climate action can act as a stabilizing force in an increasingly volatile world, the U.N.’s top climate official said on Feb. 11, as Istanbul hosted the first strategic planning meeting ahead of the COP31 summit, which Türkiye will host in the Mediterranean c…",
    "link": "https://www.hurriyetdailynews.com/intl-climate-cooperation-antidote-to-chaos-say-top-un-official-at-istanbul-talks-218909",
    "timestamp": "2026-02-13T08:14:38Z"
  },
  {
    "title": "US aircraft carrier redeployed from Caribbean as Iran tensions rise",
    "description": "The United States will send the USS Gerald R. Ford aircraft carrier to the Middle East amid escalating tensions with Iran, according to US media outlets.",
    "link": "https://www.abc.net.au/news/2026-02-13/us-aircraft-carrier-carribbean-middle-east-iran/106342830",
    "timestamp": "2026-02-13T08:14:31Z"
  },
  {
    "title": "US says it caused dollar shortage to trigger Iran protests: What that means",
    "description": "US official admits engineering dollar shortage to strangle rial, which culminated in the deadliest crackdown in Iran.",
    "link": "https://www.aljazeera.com/economy/2026/2/13/us-says-it-caused-dollar-shortage-to-trigger-iran-protests-what-that-means",
    "timestamp": "2026-02-13T08:14:28Z"
  },
  {
    "title": "As energy costs rise, everyone wants data centers to pick up the tab",
    "description": "Politicians from President Donald Trump to local lawmakers agree that tech companies should cover the power costs of artificial intelligence data centers. But they still fight over what “fair share” means. The debate ties directly to cost-of-living pressure a…",
    "link": "https://apnews.com/article/data-center-artificial-intelligence-electricity-costs-rise-a6cdf9aa09d1cd3dbf82750430c15373",
    "timestamp": "2026-02-13T08:14:10Z"
  },
  {
    "title": "Moore: Dow’s 50,000 hit a supply-side miracle",
    "description": "Trump is predicting the Dow will reach 100,000 by the time he leaves office. That's a bit of a moonshot, for sure, but the last four decades prove supply-side miracles can come true.",
    "link": "https://www.bostonherald.com/2026/02/13/moore-dows-50000-hit-a-supply-side-miracle/",
    "timestamp": "2026-02-13T08:05:10Z"
  },
  {
    "title": "Immigration rule: US restricts truck licences to H-2A, H-2B, E-2 holders",
    "description": "After deadly highway crashes, the Trump administration limits non-domiciled commercial truck licences to select visa holders and tighter checks",
    "link": "https://www.business-standard.com/immigration/immigration-rule-us-restricts-truck-licences-to-h-2a-h-2b-e-2-holders-126021300828_1.html",
    "timestamp": "2026-02-13T08:04:01Z"
  },
  {
    "title": "How Pam Bondi and the Democrats turned a hearing into hysteria, right in front of Jeffrey Epstein’s victims",
    "description": "Congressional hearing on Jeffrey Epstein case devolved into partisan theater as both sides seemed to prioritize viral moments over substantive answers.",
    "link": "https://www.foxnews.com/media/how-pam-bondi-democrats-turned-hearing-hysteria-right-front-jeffrey-epsteins-victims",
    "timestamp": "2026-02-13T08:00:44Z"
  },
  {
    "title": "Trump plans to roll back some tariffs on steel and aluminium goods",
    "description": "President Trump is reportedly planning to reduce some tariffs on steel and aluminum. Officials believe these tariffs are increasing prices for everyday items. This move comes as consumer costs are a major concern for voters ahead of the midterm elections. The…",
    "link": "https://economictimes.indiatimes.com/news/international/business/trump-plans-to-roll-back-some-tariffs-on-steel-and-aluminium-goods/articleshow/128295578.cms",
    "timestamp": "2026-02-13T07:54:32Z"
  },
  {
    "title": "Trump Trade Team Working to Scale Back Scope of Metals Tariffs",
    "description": "The Trump administration is working to narrow its broad tariffs on steel and aluminum products that companies find difficult to calculate and the European Union wants reined in as part of its pending trade deal with the US, a person familiar with the matter s…",
    "link": "https://financialpost.com/pmn/business-pmn/trump-trade-team-working-to-scale-back-scope-of-metals-tariffs",
    "timestamp": "2026-02-13T07:42:56Z"
  },
  {
    "title": "Judge temporarily blocks Trump officials from rescinding health grants to some Democratic-led states",
    "description": "A federal judge has ruled that President Donald Trump’s administration cannot pull back $600 million in public health grants allocated to four Democratic-led states, for now",
    "link": "https://abcnews.com/Politics/wireStory/judge-temporarily-blocks-trump-officials-rescinding-health-grants-130125040",
    "timestamp": "2026-02-13T07:41:46Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "description": "Those pardoned include ex-NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon.",
    "link": "https://www.npr.org/2026/02/13/nx-s1-5713307/trump-nfl-pardons",
    "timestamp": "2026-02-13T07:41:41Z"
  },
  {
    "title": "Munich Security Conference opens amid transatlantic tension",
    "description": "The MSC brings together security experts, politicians and military leaders from around the world. This year's edition comes amid growing fears for transatlantic security under US President Trump. Follow DW for more. The 2026 Munich Security Conference kicks o…",
    "link": "https://www.dw.com/en/munich-security-conference-msc-opens-amid-transatlantic-tension/live-75938790",
    "timestamp": "2026-02-13T07:38:00Z"
  },
  {
    "title": "Trial date for Trump’s $10bn libel lawsuit against BBC set for February 2027",
    "description": "US president Donald Trump's libel case against the BBC over a Panorama documentary edit will go to trial in February 2027, a US judge has ruled. The decision from Florida judge Roy K Altman came after ...",
    "link": "https://www.c21media.net/news/trial-date-for-trumps-10bn-libel-lawsuit-against-bbc-set-for-february-2027/",
    "timestamp": "2026-02-13T07:37:26Z"
  },
  {
    "title": "'Spread It Around!': Jimmy Kimmel Unveils Plan To Shame Trump's Name Forever",
    "description": "The late night host has a way to give Trump exactly what he wants -- but in the worst possible way.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-epstein-files_n_698eae48e4b09bc097f9bc23",
    "timestamp": "2026-02-13T07:36:43Z"
  },
  {
    "title": "Israelis charged with using Iran war secrets to place bets",
    "description": "The Israeli authorities have arrested two suspects for allegedly using classified info to place bets on Polymarket related to the Iran war Read Full Article at RT.com",
    "link": "https://www.rt.com/news/632400-israel-charges-bets-iran-war/",
    "timestamp": "2026-02-13T07:34:42Z"
  },
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
    "description": "The ruling temporarily blocks the Trump Administration from cutting $600 million in public health grants that had already been allocated to four Democratic-led states.",
    "link": "https://www.npr.org/2026/02/13/nx-s1-5713305/federal-funding-democratic-states-lawsuit",
    "timestamp": "2026-02-13T07:31:12Z"
  },
  {
    "title": "North Korea issues warning over South Korea drones",
    "description": "In a dramatic escalation, North Korea has threatened of terrible response to any future drone activities from South Korea. As Seoul probes a recent drone episode, officials promise to enhance security measures. This intensifying tension may jeopardize vital d…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-warns-warning-terrible-response-looms-over-south-koreas-drones/articleshow/128293798.cms",
    "timestamp": "2026-02-13T07:29:37Z"
  },
  {
    "title": "European stocks head for mixed open after latest AI Wall Street sell-off",
    "description": "AI fears hit stocks on Wall Street on Thursday, with real estate, trucking and software shares among the hardest hit.",
    "link": "https://www.cnbc.com/2026/02/13/europe-markets-stoxx-600-ftse-100-metals-ai-sell-off.html",
    "timestamp": "2026-02-13T07:27:33Z"
  },
  {
    "title": "Trump heads to Fort Bragg to cheer special forces members who ousted Venezuela's Maduro",
    "description": "President Donald Trump is visiting Fort Bragg in North Carolina on Friday to praise special forces involved in the capture of Venezuela’s former leader, Nicolás Maduro",
    "link": "https://abcnews.com/Politics/wireStory/trump-heads-fort-bragg-cheer-special-forces-members-130128722",
    "timestamp": "2026-02-13T07:25:41Z"
  },
  {
    "title": "Japan, U.S. to quicken investment plans under $550 billion package",
    "description": "Japan and the United States agreed Thursday to speed up selection of the first round of investment projects under a $550 billion package that Tokyo committed to last year following months of tariff negotiations, with a summit of their leaders about a month aw…",
    "link": "https://japantoday.com/category/politics/update1-japan-u.s.-to-speed-up-selection-of-investment-projects-under-trade-deal",
    "timestamp": "2026-02-13T07:25:32Z"
  },
  {
    "title": "Trump boasts of over $1.5B in political funds. How he chooses to spend it could rock the midterms",
    "description": "President Donald Trump says he's amassed a collection of campaign funds exceeding $1.5 billion, an unprecedented sum for a lame-duck president",
    "link": "https://abcnews.com/Business/wireStory/trump-boasts-15b-political-funds-chooses-spend-rock-130128708",
    "timestamp": "2026-02-13T07:25:27Z"
  },
  {
    "title": "As electricity costs rise, everyone wants data centers to pick up their tab. But how?",
    "description": "Politicians from President Donald Trump to local lawmakers agree that tech companies should cover the power costs of artificial intelligence data centers",
    "link": "https://abcnews.com/Technology/wireStory/electricity-costs-rise-data-centers-pick-tab-130128091",
    "timestamp": "2026-02-13T07:25:26Z"
  },
  {
    "title": "Merz eyes European nuclear shield in call for US reset",
    "description": "German Chancellor Friedrich Merz has said that Berlin had begun confidential talks with France about a European nuclear deterrent, saying the region had to ⁠become stronger in order to reset its relationship with the United States.",
    "link": "https://www.rte.ie/news/world/2026/0213/1558271-merz-europe-security/",
    "timestamp": "2026-02-13T07:23:29Z"
  },
  {
    "title": "Trans-Atlantic tensions in focus as annual Munich security gathering opens",
    "description": "An annual gathering of top international security figures that last year set the tone for a growing rift between the United States and Europe is opening",
    "link": "https://abcnews.com/International/wireStory/trans-atlantic-tensions-focus-annual-munich-security-gathering-130129484",
    "timestamp": "2026-02-13T07:17:47Z"
  },
  {
    "title": "Flickers of Obama: Is Georgia senator Jon Ossoff a Democratic presidential runner?",
    "description": "Ossoff has skilfully walked the tightrope of thriving as a liberal in a conservative state as he seeks senate re-election",
    "link": "https://www.irishtimes.com/world/us/2026/02/13/flickers-of-obama-is-georgia-senator-jon-ossoff-a-democratic-presidential-runner/",
    "timestamp": "2026-02-13T07:15:30Z"
  },
  {
    "title": "TRIPP: Τι σηματοδοτεί η επίσκεψη Βανς στον νότιο Καύκασο",
    "description": "Του Κώστα ΡάπτηΤελευταία φορά που είχε επισκεφθεί Αμερικανός αντιπρόεδρος τον Νότιο Καύκασο ήταν με την περιοδεία του Ντικ Τσένι το 2008 σε Αζερμπαϊτζάν και Γεωργία.Η νέα εξόρμηση του Τζ. Ντ. Βανς στην ίδια περιοχή την εβδομάδα αυτή, παραλείπει την Γεωργία, ό…",
    "link": "https://i-epikaira.blogspot.com/2026/02/tripp.html",
    "timestamp": "2026-02-13T07:05:00Z"
  },
  {
    "title": "Second US aircraft carrier to head to Middle East amid Iran tensions, US media reports",
    "description": "Feb 13 (Reuters) - The U.S. is sending a second aircraft carrier to the Middle East amid tensions with Iran, U.S. media outlets reported late on Thursday.The aircraft car… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/second-us-aircraft-carrier-to-head-to-middle-east-amid-iran-tensions-us-media-reports",
    "timestamp": "2026-02-13T07:04:36Z"
  },
  {
    "title": "California vows legal fight after EPA rescinds GHG Endangerment Finding",
    "description": "California Gov. Gavin Newsom immediately challenged the Trump Administration's decision to rescind the 2009 Endangerment Finding that allowed greenhouse gas emissions regulations. Also: Estes makes Pacific Northwest acquisition; new Love's open with no truck …",
    "link": "https://www.overdriveonline.com/regulations/article/15817208/california-vows-legal-fight-after-epa-rescinds-ghg-endangerment-finding",
    "timestamp": "2026-02-13T07:01:16Z"
  },
  {
    "title": "Trump pardons 5 ex-NFL players — including Jets legend Joe Klecko — for crimes ranging from perjury to drug trafficking",
    "description": "Ex-NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon were granted the clemency.",
    "link": "https://nypost.com/2026/02/13/sports/trump-pardons-5-ex-nfl-players-including-jets-legend-joe-klecko/",
    "timestamp": "2026-02-13T06:58:42Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "description": "US President Donald Trump has granted pardons to five former NFL players, including the late Billy Cannon, for offenses ranging from drug trafficking to perjury. White House pardon czar Alice Marie Johnson announced the clemency, highlighting Trump's commitme…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-pardons-5-former-nfl-players-for-crimes-ranging-from-perjury-to-drug-trafficking/articleshow/128292528.cms",
    "timestamp": "2026-02-13T06:37:36Z"
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East: report",
    "description": "The USS Abraham Lincoln aircraft carrier and three guided-missile destroyers arrived in the Middle East more than two weeks ago.",
    "link": "https://nypost.com/2026/02/13/world-news/uss-gerald-r-ford-ordered-to-move-to-the-middle-east-during-heightened-tension-with-iran/",
    "timestamp": "2026-02-13T06:32:01Z"
  },
  {
    "title": "Trump’s EPA Rollbacks Will Reverberate for ‘Decades’",
    "description": "US President Donald Trump is shrinking the Environmental Protection Agency more quickly and aggressively than ever before, culminating in this week’s move to rescind the crucial “endangerment finding” underpinning key regulations of planet-warming pollution. …",
    "link": "https://www.insurancejournal.com/news/national/2026/02/13/857967.htm",
    "timestamp": "2026-02-13T06:25:22Z"
  },
  {
    "title": "RFK Jr admits he used to 'snort cocaine off toilet seats'",
    "description": "The US health secretary made the confession to podcaster Theo Von during an episode of his show, This Past Weekend, as he opened up about his past drug use.",
    "link": "https://news.sky.com/story/robert-f-kennedy-jr-admits-he-used-to-snort-cocaine-off-toilet-seats-13506969",
    "timestamp": "2026-02-13T06:25:00Z"
  },
  {
    "title": "World Bank chief Ajay Banga says multilateralism has a role to play in tumultuous times",
    "description": "The multilateral economic cooperation system that underpinned the creation of the World Bank and the International Monetary Fund at the end of World War II has come under pressure amid a backlash against globalization in the Trump era.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/world-bank-chief-ajay-banga-says-multilateralism-has-a-role-to-play-in-tumultuous-times/articleshow/128291626.cms",
    "timestamp": "2026-02-13T06:17:02Z"
  },
  {
    "title": "Europe’s wary leaders to meet Trump officials at Munich Security Conference",
    "description": "Despite global disquiet and disorder, there is quiet confidence among some European representatives",
    "link": "https://www.irishtimes.com/world/europe/2026/02/13/europes-wary-leaders-to-meet-trump-officials-at-munich-security-conference/",
    "timestamp": "2026-02-13T06:00:01Z"
  },
  {
    "title": "Another Trump administration Ice deportation flight refuelled in Shannon Airport this week",
    "description": "Private jet that landed in Co Clare while travelling to Egypt is latest of six aircraft to do so in last year",
    "link": "https://www.irishtimes.com/ireland/2026/02/13/trump-administration-ice-deportation-flights-refuelling-in-shannon-airport/",
    "timestamp": "2026-02-13T06:00:01Z"
  },
  {
    "title": "Pam Bondi faces conservative backlash after explosive Epstein hearing",
    "description": "Prominent MAGA figures, including Kyle Rittenhouse and Rep. Thomas Massie, criticized Attorney General Pam Bondi for deflecting questions about the Epstein files during a congressional hearing, with some calling for her resignation or impeachment. Bondi faced…",
    "link": "https://www.naturalnews.com/2026-02-13-bondi-faces-conservative-backlash-after-epstein-hearing.html",
    "timestamp": "2026-02-13T06:00:00Z"
  },
  {
    "title": "House passes resolution to end Trump’s tariffs on Canada",
    "description": "On Feb. 11, the U.S. House passed a 219 to 211 resolution to end President Trump’s tariffs on Canada, with six Republicans joining nearly all Democrats; Rep. Jared Golden (D-Maine) was the lone Democrat opposed. The measure now heads to the Senate. Trump impo…",
    "link": "https://www.naturalnews.com/2026-02-13-house-passes-resolution-to-end-trumps-tariffs.html",
    "timestamp": "2026-02-13T06:00:00Z"
  },
  {
    "title": "Citizenship under review: Trump officials expand effort to denaturalize foreign-born Americans",
    "description": "Trump DOJ sets aggressive monthly quotas to strip citizenship from naturalized immigrants. The initiative aims for 100-200 case referrals to prosecutors each month. Officials are scouring old files for discrepancies to fuel a litigation pipeline. The administ…",
    "link": "https://www.naturalnews.com/2026-02-13-citizenship-trump-denaturalize-foreign-americans.html",
    "timestamp": "2026-02-13T06:00:00Z"
  },
  {
    "title": "Bessent warns of “big loss” if Supreme Court strips Trump administration of tariff powers",
    "description": "President Donald Trump is fighting a Supreme Court battle over his use of the International Emergency Economic Powers Act (IEEPA) to impose tariffs. A lower court ruled his actions unconstitutional, claiming Congress must approve tariffs—not the president. Tr…",
    "link": "https://www.naturalnews.com/2026-02-13-bessent-big-loss-scotus-strips-tariff-powers.html",
    "timestamp": "2026-02-13T06:00:00Z"
  },
  {
    "title": "Trump warns Iran of 'very traumatic' outcome if no nuclear deal",
    "description": "U.S. President Donald Trump threatened Iran Thursday with \"very traumatic\" consequences if it fails to make a nuclear deal — but Israeli Prime Minister Benjamin Netanyahu said he was skeptical about the quality of any such agreement.",
    "link": "https://www.hurriyetdailynews.com/trump-warns-iran-of-very-traumatic-outcome-if-no-nuclear-deal-218900",
    "timestamp": "2026-02-13T05:59:02Z"
  },
  {
    "title": "Europe rethinks nuclear weapons after Trump delivers reality check",
    "description": "Europe has been fighting to keep hostile US in Nato while countries race to rearm and now for first time since Cold War, European capitals are discussing how to develop their own nuclear deterrent",
    "link": "https://www.business-standard.com/world-news/europe-rethinks-nuclear-weapons-after-trump-delivers-reality-check-126021300623_1.html",
    "timestamp": "2026-02-13T05:55:31Z"
  },
  {
    "title": "New DAA boss facing into a hard landing after Kenny Jacobs exit",
    "description": "Contentious issues include the Dublin Airport passenger cap, rules on airport noise and the need for new infrastructure",
    "link": "https://www.irishtimes.com/business/2026/02/13/new-daa-boss-facing-into-a-hard-landing-after-kenny-jacobs-exit/",
    "timestamp": "2026-02-13T05:55:00Z"
  },
  {
    "title": "New DAA boss facing into a hard landing after Kenny Jacobs exit",
    "description": "Contentious issues include the Dublin Airport passenger cap, rules on airport noise and the need for new infrastructure",
    "link": "https://www.irishtimes.com/business/2026/02/13/agenda/",
    "timestamp": "2026-02-13T05:55:00Z"
  },
  {
    "title": "World's largest aircraft carrier sent to Middle East amid Iran tensions",
    "description": "The world's largest aircraft carrier, is sailing to the Middle East. This move by the USS Gerald R. Ford, places two carriers in the region as US President Donald Trump considers military action against Iran. The USS Abraham Lincoln carrier group is already p…",
    "link": "https://economictimes.indiatimes.com/news/defence/worlds-largest-aircraft-carrier-deployed-to-middle-east-amid-rising-iran-tensions-military-escalation-or-strategic-strategy/articleshow/128290522.cms",
    "timestamp": "2026-02-13T05:52:57Z"
  },
  {
    "title": "AI’s bitter rivalry heads to Washington",
    "description": "Founded in 2021 by former AI researchers, Anthropic has grown into a world-leading AI company focused on businesses and software developers.\nThe post AI’s bitter rivalry heads to Washington appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/tech-science/ais-bitter-rivalry-heads-to-washington/article",
    "timestamp": "2026-02-13T05:52:49Z"
  },
  {
    "title": "Message to Iran: USS Gerald R. Ford redeployed to Middle East",
    "description": "The USS Gerald R. Ford and its escort ships are being sent from the Caribbean to the Middle East to join the USS Abraham Lincoln strike group, amid tensions with Iran.",
    "link": "https://www.israelnationalnews.com/news/422369",
    "timestamp": "2026-02-13T05:49:00Z"
  },
  {
    "title": "USS Ford ordered to the Middle East, the second aircraft carrier being sent to the region",
    "description": "The USS Gerald R. Ford aircraft carrier was ordered to the Middle East as President Donald Trump weighs military action against Iran amid rising regional tensions.",
    "link": "https://www.foxnews.com/world/uss-ford-ordered-middle-east-second-aircraft-carrier-being-sent-region",
    "timestamp": "2026-02-13T05:48:16Z"
  },
  {
    "title": "Britain’s Starmer set to call for multinational defence initiative, FT says",
    "description": "Feb 13 (Reuters) - British Prime Minister Kier Starmer is set to make the case for Britain and its Western allies to launch a multinational defence initiative that could … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/britain-s-starmer-set-to-call-for-multinational-defence-initiative-ft-says",
    "timestamp": "2026-02-13T05:47:36Z"
  },
  {
    "title": "Trump dismantles legal basis for US climate rules",
    "description": "President Donald Trump on Thursday revoked a landmark scientific finding underpinning U.S. regulations to curb planet-warming pollution, marking his biggest rollback of climate policy to date.",
    "link": "https://www.hurriyetdailynews.com/trump-dismantles-legal-basis-for-us-climate-rules-218899",
    "timestamp": "2026-02-13T05:40:04Z"
  },
  {
    "title": "Malaysia's economy grows at fastest pace in 3 years in 2025, exceeding expectations",
    "description": "KUALA LUMPUR, Feb 13 : Malaysia's economy expanded at its fastest pace in three years in 2025, surpassing expectations as strong domestic demand, exports and investment propelled growth, with momentum likely to continue this year, the central bank said on Fri…",
    "link": "https://www.channelnewsasia.com/business/malaysias-economy-grows-fastest-pace-in-3-years-in-2025-exceeding-expectations-5928816",
    "timestamp": "2026-02-13T05:37:33Z"
  },
  {
    "title": "Multilateralism has role to play in tumultuous times: World Bank president",
    "description": "\"The private sector and private capital mobilisation, combined with the money you can get from the public sector, combined with philanthropy, that's a good combination to work with,\" Banga said",
    "link": "https://www.business-standard.com/world-news/multilateralism-has-role-to-play-in-tumultuous-times-world-bank-president-126021300594_1.html",
    "timestamp": "2026-02-13T05:36:52Z"
  },
  {
    "title": "UN climate chief says 'new world disorder' threatens cooperation",
    "description": "The U.N.'s climate chief on Thursday urged countries to unite against an \"unprecedented threat\" to international cooperation from pro-fossil fuel forces — issuing the appeal as US President Donald Trump rattles the global order.",
    "link": "https://www.hurriyetdailynews.com/un-climate-chief-says-new-world-disorder-threatens-cooperation-218898",
    "timestamp": "2026-02-13T05:34:56Z"
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East, AP source says (Konstantin Toropin/Associated Press)",
    "description": "Konstantin Toropin / Associated Press:\nSecond US aircraft carrier is being sent to the Middle East, AP source says  —  The world's largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans sa…",
    "link": "https://www.memeorandum.com/260213/p2",
    "timestamp": "2026-02-13T05:30:01Z"
  },
  {
    "title": "Donald Trump agrees to end Minnesota ICE crackdown, says border tsar",
    "description": "US president Donald Trump has agreed to end his hotly protested deportation surge in Minnesota, White House border tsar Tom Homan said yesterday, with many ICE agents set to return to their home states over the next week.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-agrees-to-end-minnesota-ice-crackdown-says-border-tsar/a822510689.html",
    "timestamp": "2026-02-13T05:30:00Z"
  },
  {
    "title": "Catherine Prasifka: If we really want to punch above our weight this St Patrick’s Day, we should cancel White House visit",
    "description": "On St Patrick’s Day 1952, the first box of shamrock was delivered to the White House. Seventy-four years later, Taoiseach Micheál Martin has accepted this year’s invitation to meet with US president Donald Trump.",
    "link": "https://www.independent.ie/opinion/comment/catherine-prasifka-if-we-really-want-to-punch-above-our-weight-this-st-patricks-day-we-should-cancel-white-house-visit/a947834095.html",
    "timestamp": "2026-02-13T05:30:00Z"
  },
  {
    "title": "USS Gerald R. Ford aircraft carrier headed from Caribbean to Middle East: Officials",
    "description": "The USS Gerald R. Ford carrier strike group is expected to leave the Caribbean and head towards the Middle East in the coming days, according to three U.S. officials.",
    "link": "https://abcnews.com/International/uss-gerald-ford-aircraft-carrier-headed-caribbean-middle/story?id=130127299",
    "timestamp": "2026-02-13T05:22:14Z"
  },
  {
    "title": "Another US' aircraft carrier likely being sent to Middle East amid tensions",
    "description": "The world's largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans said Thursday, as US President Donald Trump considers whether to take possible military action against Iran.\nThe move by …",
    "link": "https://www.business-standard.com/world-news/another-us-aircraft-carrier-likely-being-sent-to-middle-east-amid-tensions-126021300495_1.html",
    "timestamp": "2026-02-13T05:19:39Z"
  },
  {
    "title": "Too Late, Mr. Trump. You Cannot Undo the Multi-Racial, Multi-National Real America",
    "description": "White people are not being \"replaced\" by invading non-whites, who  have been here all along--because the U.S. incorporated them as we expanded",
    "link": "https://www.juancole.com/2026/02/cannot-national-america.html",
    "timestamp": "2026-02-13T05:15:14Z"
  },
  {
    "title": "‘The Daily Show’ Audience Audibly Groans After Biting Titan Submersible Joke: ‘I Know, Facts Hurt’ | Video",
    "description": "The OceanGate vessel imploded in 2023 while taking guests down to the wreck of the Titanic\nThe post ‘The Daily Show’ Audience Audibly Groans After Biting Titan Submersible Joke: ‘I Know, Facts Hurt’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/tv-shows/the-daily-show-audience-reaction-titan-submersible-joke/",
    "timestamp": "2026-02-13T05:11:44Z"
  },
  {
    "title": "US Market Today | Too tight or just right? Fed policy path sparks fresh divide",
    "description": "Federal Reserve Governor Stephen Miran cautions that current monetary policy may be too restrictive. He believes inflation is not a major concern, citing subdued shelter inflation. Miran advocates for looser policy to support the labor market as supply condit…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/us-market-today-too-tight-or-just-right-fed-policy-path-sparks-fresh-divide/articleshow/128289542.cms",
    "timestamp": "2026-02-13T05:10:31Z"
  },
  {
    "title": "From Greenland to the Great Lakes, Secession is Our Best Hope for Escaping Tyranny",
    "description": "“We will have everything we want; we’re getting everything we want, at no cost!” the President of Babylon barked triumphantly over his latest diplomatic conquest in Greenland. After weeks of mounting tensions between our dear leader and his on-again-off-again…",
    "link": "https://www.counterpunch.org/2026/02/13/from-greenland-to-the-great-lakes-secession-is-our-best-hope-for-escaping-tyranny/",
    "timestamp": "2026-02-13T05:07:41Z"
  },
  {
    "title": "As electricity costs rise, everyone wants data centers to pick up their tab. But how?",
    "description": "As outrage spreads over energy-hungry data centers, politicians from President Donald Trump to local lawmakers have found rare bipartisan agreement over...",
    "link": "https://finance.yahoo.com/news/electricity-costs-rise-everyone-wants-050740829.html",
    "timestamp": "2026-02-13T05:07:40Z"
  },
  {
    "title": "Capito praises Trump’s support for coal industry",
    "description": "WHEELING — U.S. Sen. Shelley Moore Capito said a move this week by President Donald Trump will help keep some coal-fired power plants open longer in West Virginia. During a press call with reporters across the state on Thursday, Capito was asked to provide in…",
    "link": "https://www.newsandsentinel.com/news/business/2026/02/capito-praises-trumps-support-for-coal-industry/",
    "timestamp": "2026-02-13T05:05:48Z"
  },
  {
    "title": "The rupee after a 6-month-long storm: trade relief, fresh hope, old constraints",
    "description": "The rupee’s six-month slide, driven by U.S. tariffs and policy uncertainty, reversed sharply after signals of a friendlier trade deal. While improved sentiment, sectoral gains, and potential foreign inflows offer support, unresolved agreement details, oil dyn…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-rupee-after-a-6-month-long-storm-trade-relief-fresh-hope-old-constraints/articleshow/128289278.cms",
    "timestamp": "2026-02-13T05:05:10Z"
  },
  {
    "title": "MAGA Outgrows Isolationism: And Yet America First Means America Alone",
    "description": "Donald Trump considers international law nothing more than a trifling impediment by which the weak try to drag down the strong.",
    "link": "https://www.juancole.com/2026/02/outgrows-isolationism-america.html",
    "timestamp": "2026-02-13T05:04:03Z"
  },
  {
    "title": "Second US aircraft carrier is being sent to the Middle East: Source",
    "description": "The move by the USS Gerald R Ford will put two carriers and their accompanying warships in the region as US President Donald Trump increases pressure on Iran to make a deal over its nuclear programme.",
    "link": "https://www.channelnewsasia.com/world/us-aircraft-carrier-uss-gerald-r-ford-middle-east-military-action-iran-5928691",
    "timestamp": "2026-02-13T05:03:40Z"
  },
  {
    "title": "Jordan Klepper Nails The 'F**king Idiot' Trump Put In Charge Of A Crucial Agency",
    "description": "The \"Daily Show\" host tore into the president for stripping away key environmental protections.",
    "link": "https://www.huffpost.com/entry/jordan-klepper-trump-coal_n_698ea652e4b09bc097f9b979",
    "timestamp": "2026-02-13T05:01:50Z"
  },
  {
    "title": "Arms Control Was Once Trump’s Signature Issue",
    "description": "What is needed in this multipolar nuclear era is a president with the vision of his younger self.",
    "link": "http://foreignpolicy.com/2026/02/13/trump-nuclear-order-arms-control/",
    "timestamp": "2026-02-13T05:01:28Z"
  },
  {
    "title": "Trump administration reaches a trade deal to lower Taiwan's tariff barriers",
    "description": "Taiwan has reached a trade deal with the United States that cuts almost all of its tariff barriers",
    "link": "https://abcnews.com/Business/wireStory/trump-administration-reaches-trade-deal-lower-taiwans-tariff-130119661",
    "timestamp": "2026-02-13T05:01:27Z"
  },
  {
    "title": "Trump’s $10 billion lawsuit against BBC set for trial in 2027",
    "description": "US judge rules that President Trump’s $10 billion defamation lawsuit against the BBC over the editing of his January 6, 2021 speech will proceed to trial in 2027.",
    "link": "https://www.israelnationalnews.com/news/422367",
    "timestamp": "2026-02-13T04:52:16Z"
  },
  {
    "title": "Second U.S. Aircraft Carrier Is Being Sent To The Middle East, Source Says",
    "description": "The world’s largest aircraft carrier has been ordered to sail from the Caribbean Sea to the Middle East, a person familiar with the plans said Thursday.",
    "link": "https://www.huffpost.com/entry/united-states-iran-military-aircraft-carrier_n_698ead3be4b08d2eb24cfdd7",
    "timestamp": "2026-02-13T04:51:56Z"
  },
  {
    "title": "CNN Panel Battles Over ICE Pullback in Minnesota: ‘Look Alex Pretti’s Mother in the Face!’",
    "description": "A raucous CNN panel reached a boiling point on Thursday when longtime Trump supporter Joe Borelli claimed that the recent federal immigration surge operation in Minneapolis was a success.\nThe post CNN Panel Battles Over ICE Pullback in Minnesota: ‘Look Alex P…",
    "link": "https://www.mediaite.com/media/news/cnn-panel-battles-over-ice-pullback-in-minnesota-look-alex-prettis-mother-in-the-face/",
    "timestamp": "2026-02-13T04:50:47Z"
  },
  {
    "title": "Factbox-What to watch at North Korea’s Ninth Party Congress",
    "description": "SEOUL, Feb 13 (Reuters) - North Korea is expected to convene the Ninth Congress of the ruling Workers’ Party this month, the country’s biggest political gathering that re… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/factbox-what-to-watch-at-north-korea-s-ninth-party-congress",
    "timestamp": "2026-02-13T04:48:35Z"
  },
  {
    "title": "North Korea's Kim to tout power and military gains at party congress",
    "description": "SEOUL, Feb 13 (Reuters) - North Korea will convene ⁠the Ninth Party Congress this month, a major political undertaking aimed at showcasing leader Kim Jong Un's absolute grip on power and his image as a benevolent leader at ⁠home and as head of a world-class m…",
    "link": "https://www.thestar.com.my/news/world/2026/02/13/north-korea039s-kim-to-tout-power-and-military-gains-at-party-congress",
    "timestamp": "2026-02-13T04:48:00Z"
  },
  {
    "title": "Global Markets | The Great Rebalancing: How global powers are redrawing the investment map",
    "description": "Global markets are responding to a fragmentation of U.S.-led economic leadership, with investors seeing opportunities in a more multipolar framework. Allies are rethinking strategic positioning, leading to increased exposure to non-U.S. equity markets, energy…",
    "link": "https://economictimes.indiatimes.com/markets/us-stocks/news/global-markets-the-great-rebalancing-how-global-powers-are-redrawing-the-investment-map/articleshow/128288749.cms",
    "timestamp": "2026-02-13T04:45:22Z"
  },
  {
    "title": "North Korea’s Kim to tout power and military gains at party congress",
    "description": "By Heejin Kim and Kyu-seok ShimSEOUL, Feb 13 (Reuters) - North Korea will convene the Ninth Party Congress this month, a major political undertaking aimed at showcasing l… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/13/north-korea-s-kim-to-tout-power-and-military-gains-at-party-congress",
    "timestamp": "2026-02-13T04:44:24Z"
  },
  {
    "title": "Crude futures edge lower as IEA sees global oil surplus in 2026",
    "description": "Global oil supply likely to exceed demand by 3.73 million barrels a day in 2026, says IEA’s Oil Market Report",
    "link": "https://www.thehindubusinessline.com/markets/commodities/crude-futures-edge-lower-as-iea-sees-global-oil-surplus-in-2026/article70627091.ece",
    "timestamp": "2026-02-13T04:43:36Z"
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking (Associated Press)",
    "description": "Associated Press:\nTrump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking  —  President Donald Trump on Thursday pardoned five former professional football players — one posthumously — for various crimes ranging from perjury to …",
    "link": "https://www.memeorandum.com/260212/p140",
    "timestamp": "2026-02-13T04:40:00Z"
  },
  {
    "title": "Connecticut leaders chastise President Trump’s repeal of EPA endangerment finding",
    "description": "Gov. Ned Lamont, AG William Tong and DEEP Commissioner Katie Dykes each criticized the Trump Administration for rescinding the landmark Obama-era regulation.",
    "link": "https://www.fox61.com/article/news/health/connecticut-leaders-condemn-president-trumps-repeal-of-epa-endangerment-finding/520-88d3a1b3-3a71-4720-bb50-340a7ccb8705",
    "timestamp": "2026-02-13T04:37:33Z"
  },
  {
    "title": "The measles vaccine: A product of two centuries of science and public health reform",
    "description": "For much of the 20th century, measles was regarded as an unavoidable illness of childhood, even as it killed millions of people worldwide each year. The development of a safe and effective vaccine fundamentally changed that reality.",
    "link": "https://www.wsws.org/en/articles/2026/02/13/svqo-f13.html",
    "timestamp": "2026-02-13T04:36:31Z"
  },
  {
    "title": "JUST IN: Trump Says Pam Bondi’s Congressional Testimony on Epstein Files was “Fantastic”",
    "description": "President Trump on Thursday reacted to Pam Bondi’s House Judiciary Committee testimony on Wednesday, commending her for what he described as a “fantastic” performance during questioning over the Epstein Files. “Bondi, under intense fire from the Trump Derange…",
    "link": "https://freerepublic.com/focus/f-chat/4366666/posts",
    "timestamp": "2026-02-13T04:29:42Z"
  },
  {
    "title": "The Decline and Fall of Donald Trump",
    "description": "New York NY (SPX) Feb 13, 2026\n\n\nAs Donald Trump's decline begins, his fall is unlikely to look like a thunderclap so much as a tide going out. One by one, the people and institutions that once swore they would follow him anywhere are stepping back, hedging, …",
    "link": "https://www.spacewar.com/reports/The_Decline_and_Fall_of_Donald_Trump_999.html",
    "timestamp": "2026-02-13T04:25:58Z"
  },
  {
    "title": "Jyotiraditya Scindia slams Rahul Gandhi for ‘maligning’ India",
    "description": "Union Minister Jyotiraditya Scindia has accused Rahul Gandhi of damaging India's image. Scindia stated that Gandhi's constant criticism on every platform will not benefit Congress or himself. He highlighted India's progress under Prime Minister Narendra Modi.…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/jyotiraditya-scindia-slams-rahul-gandhi-for-maligning-india/articleshow/128287959.cms",
    "timestamp": "2026-02-13T04:21:22Z"
  },
  {
    "title": "Trump nominee stalls after GOP senator challenges him on remarks about Jews and Israel",
    "description": "Sen. John Curtis said he opposes Jeremy Carl for a State Department post in part because of his \"anti-Israel views and insensitive remarks about the Jewish people.\"",
    "link": "https://www.nbcnews.com/politics/trump-administration/state-department-nominee-jeremy-carl-senator-john-curtis-israel-jews-rcna258858",
    "timestamp": "2026-02-13T04:20:30Z"
  },
  {
    "title": "Cardi B Throws Down with DHS in Bonkers Tweet Brawl Over ICE, Epstein Files",
    "description": "Rapper Cardi B battled via tweet with the Department of Homeland Security after the agency criticized comments she made about ICE at her concert.\nThe post Cardi B Throws Down with DHS in Bonkers Tweet Brawl Over ICE, Epstein Files first appeared on Mediaite.",
    "link": "https://www.mediaite.com/online/cardi-b-throws-down-with-dhs-in-bonkers-tweet-brawl-over-ice-epstein-files/",
    "timestamp": "2026-02-13T04:17:19Z"
  }
]