[
  {
    "title": "Macron asks Trump to lift sanctions on former EU tech chief Thierry Breton",
    "description": "Sanctions on EU citizens including Frenchman Thierry Breton were \"unjustly imposed\" by Washington, the French president argued.",
    "link": "https://www.politico.eu/article/emmanuel-macron-donald-trump-lift-sanctions-thierry-breton/",
    "timestamp": "2026-02-22T14:34:06Z"
  },
  {
    "title": "Trump 'curious' about Iran's defiance amid U.S. military buildup, Witkoff says",
    "description": "U.S. President Donald Trump is curious about why Iran has not yet \"capitulated\" and agreed to curb its nuclear program, as Washington builds up its military capability in the Middle East, Trump's special envoy, Steve Witkoff, said.",
    "link": "https://www.cbc.ca/news/world/us-iran-sanctions-talks-9.7101441",
    "timestamp": "2026-02-22T14:32:55Z"
  },
  {
    "title": "Trump Calls on Netflix to Fire 'Racist' Susan Rice After Her Threat to Businesses: ‘Or Pay the Consequences’",
    "description": "President Donald Trump called for Netflix to fire former White House adviser Susan Rice, labeling her as \"racist\" and \"Trump Deranged,\" and questioning how much she was being paid.\nThe post Trump Calls on Netflix to Fire ‘Racist’ Susan Rice After Her Threat t…",
    "link": "https://www.breitbart.com/entertainment/2026/02/22/trump-calls-for-netflix-to-fire-trump-deranged-susan-rice/",
    "timestamp": "2026-02-22T14:32:39Z"
  },
  {
    "title": "U.S. Secret Service agents shot and killed armed man who entered the secure perimeter of Mar-a-Lago",
    "description": "WASHINGTON (AP) — The U.S. Secret Service announced Sunday that an armed man was shot and killed after entering the secure perimeter of Mar-a-Lago, President<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/u-s-secret-service-agents-shot-and-killed-arm…",
    "link": "https://whdh.com/news/u-s-secret-service-agents-shot-and-killed-armed-man-who-entered-the-secure-perimeter-of-mar-a-lago/",
    "timestamp": "2026-02-22T14:32:22Z"
  },
  {
    "title": "Breaking: Man reportedly carrying shotgun killed while unlawfully entering Trump's Mar-a-Lago",
    "description": "A spokesperson said agents \"confronted the individual and shots were fired by law enforcement during the encounter\".",
    "link": "https://www.abc.net.au/news/2026-02-23/man-shot-dead-unlawfully-entering-mar-a-lago/106374424",
    "timestamp": "2026-02-22T14:31:10Z"
  },
  {
    "title": "Hakeem Jeffries Suddenly Discovers Border Security as 2026 Panic Sets In (VIDEO)",
    "description": "The Democrat rebranding effort does not alter the legislative record. Congressional Democrats have repeatedly resisted funding for physical barriers, expanded detention capacity, and broader deportation authority.\nThe post Hakeem Jeffries Suddenly Discovers B…",
    "link": "https://www.thegatewaypundit.com/2026/02/hakeem-jeffries-suddenly-discovers-border-security-as-2026/",
    "timestamp": "2026-02-22T14:30:32Z"
  },
  {
    "title": "Shooting at Donald Trump's Mar-a-Lago resort: Youth shot dead by U.S. Secret Service at President's Florida, West Palm Beach residence",
    "description": "Donald Trump has faced threats to his life before. U.S. President was wounded during an assassination attempt during a campaign rally in Butler, Pennsylvania, on July 13, 2024.",
    "link": "https://economictimes.indiatimes.com/news/international/us/shooting-at-donald-trumps-mar-a-lago-resort-youth-shot-dead-by-u-s-secret-service-at-presidents-florida-west-palm-beach-residence/articleshow/128679465.cms",
    "timestamp": "2026-02-22T14:30:31Z"
  },
  {
    "title": "Chris Addison On His New Show ‘Tall Tales & Murder’ & Why ‘Veep’ And ‘The Thick Of It’ Wouldn’t Work Today: “Our Relationship To Politics Has Fundamentally Changed”",
    "description": "EXCLUSIVE: Chris Addison is a political TV veteran having starred in The Thick of It and won two Emmys for directing Veep, but he thinks it’s curtains for this brand of political satire. “Our relationship to politics has fundamentally changed,” Addison told D…",
    "link": "http://deadline.com/2026/02/chris-addison-veep-thick-of-it-not-today-tall-tales-and-murder-1236728134/",
    "timestamp": "2026-02-22T14:30:00Z"
  },
  {
    "title": "BREAKING: Man Shot and Killed By Law Enforcement After Breaching Mar-a-Lago Secure Perimeter",
    "description": "A man was shot dead by law enforcement early Sunday, a Secret Service spokesman said, after breaching the secure perimeter at Mar-a-Lago appearing to be armed.\nThe post BREAKING: Man Shot and Killed By Law Enforcement After Breaching Mar-a-Lago Secure Perimet…",
    "link": "https://www.mediaite.com/media/news/breaking-man-shot-and-killed-by-law-enforcement-after-breaching-mar-a-lago-secure-perimeter/",
    "timestamp": "2026-02-22T14:29:26Z"
  },
  {
    "title": "U.S. Secret Service shot and killed armed man who entered the secure perimeter of Mar-a-Lago",
    "description": "U.S. Secret Service said Sunday that an armed man was shot and killed after entering the secure perimeter of Mar-a-Lago, President Donald Trump’s resort in Palm Beach, Florida Although Trump often spends weekends at his resort, he was at the White House this …",
    "link": "https://www.boston.com/news/national-news/2026/02/22/u-s-secret-service-shot-and-killed-armed-man-who-entered-the-secure-perimeter-of-mar-a-lago/",
    "timestamp": "2026-02-22T14:28:49Z"
  },
  {
    "title": "Armed Man Shot and Killed After Entering Mar-a-Lago's Secure Perimeter",
    "description": "An armed man was shot and killed around 1:30 a.m. Sunday after entering Mar-a-Lago's secure perimeter, President Donald Trump’s resort in Palm Beach, Florida.\nThe post Armed Man Shot and Killed After Entering Mar-a-Lago’s Secure Perimeter appeared first on Br…",
    "link": "https://www.breitbart.com/2nd-amendment/2026/02/22/armed-man-shot-and-killed-after-entering-mar-a-lagos-secure-perimeter/",
    "timestamp": "2026-02-22T14:26:22Z"
  },
  {
    "title": "Armed man shot dead after breaking into Trump’s resort: report",
    "description": "An armed man was fatally shot Sunday by law enforcement after breaching the perimeter of President Donald Trump’s Mar-a-Lago resort in Palm Beach, Florida, Reuters reported\r\n.Trump was not at his Palm Beach resort at the time of the incident, and was instead …",
    "link": "https://www.rawstory.com/trump-2675292025/",
    "timestamp": "2026-02-22T14:26:11Z"
  },
  {
    "title": "Armed man shot, killed after entering Mar-a-Lago secure perimeter, Secret Service says",
    "description": "The U.S. Secret Service announced that its agents shot and killed a man after he tried to enter a secure perimeter at President Donald Trump's Mar-a-Lago resort. Trump was at the White House in Washington at the time of the shooting.",
    "link": "https://www.wgal.com/article/mar-a-lago-secret-service-man-killed/70451775",
    "timestamp": "2026-02-22T14:25:49Z"
  },
  {
    "title": "Armed man killed after breaching Mar-A-Lago",
    "description": "Armed man carrying apparent shotgun and fuel can shot dead after approaching north gate of Mar-a-Lago; President Trump was at White House.",
    "link": "https://www.israelnationalnews.com/news/422805",
    "timestamp": "2026-02-22T14:25:00Z"
  },
  {
    "title": "US Secret Service agents kill man trying to unlawfully enter Trump's Mar-a-Lago",
    "description": "The U.S. Secret Service said its agents shot and killed a man in his 20s after he tried to unlawfully enter a secure perimeter at President Donald Trump's Mar-a-Lago resort in West Palm Beach, Florida.",
    "link": "https://www.independent.ie/world-news/north-america/us-secret-service-agents-kill-man-trying-to-unlawfully-enter-trumps-mar-a-lago/a1069002039.html",
    "timestamp": "2026-02-22T14:24:19Z"
  },
  {
    "title": "Man killed by Secret Service after entering perimeter of Trump's residence",
    "description": "The US Secret Service say they've killed a man who was entering Trump's Florida residence",
    "link": "https://www.ladbible.com/news/us-news/man-killed-entering-trump-residence-975886-20260222",
    "timestamp": "2026-02-22T14:21:51Z"
  },
  {
    "title": "Armed man shot dead after breaching Trump's Mar-a-Lago security perimeter",
    "description": "An armed man was shot and killed on Sunday after entering the secure perimeter of Mar-a-Lago, the Florida estate of President Donald Trump, the US Secret Service said, according to a report by the Associated Press.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/armed-man-shot-dead-after-breaching-trumps-mar-a-lago-security-perimeter/articleshow/128679317.cms",
    "timestamp": "2026-02-22T14:21:09Z"
  },
  {
    "title": "Armed man shot and killed scaling gate at President Trump’s home at Mar-a-Lago",
    "description": "Was carrying what appeared to be a shotgun and fuel can",
    "link": "https://www.wnd.com/2026/02/armed-man-shot-killed-scaling-president-trumps-home/",
    "timestamp": "2026-02-22T14:20:17Z"
  },
  {
    "title": "US Secret Service agents killed man trying to unlawfully enter Trump's Mar-a-Lago",
    "description": "WASHINGTON, ⁠Feb 22 (Reuters) - ⁠The U.S. ‌Secret Service said on Sunday ​its agents ⁠shot and ⁠killed a man ⁠in ‌his ⁠20s after he tried ​to ‌unlawfully enter ⁠a ​secure perimeter at ⁠President Donald Trump's ​Mar-a-Lago resort in West Palm ⁠Beach, Florida. …",
    "link": "https://www.thestar.com.my/news/world/2026/02/22/us-secret-service-agents-killed-man-trying-to-unlawfully-enter-trump039s-mar-a-lago",
    "timestamp": "2026-02-22T14:16:00Z"
  },
  {
    "title": "Keith Boykin Takes Apart Trump Shill Scott Jennings",
    "description": "Former Clinton White House aide Keith Boykin shot down smug Scott Jenning's revisionist history after the Supreme Court ruled against Trump's illegal emergency tariffs. \nDuring an exchange on CNN's NewsNight with Abby Phillip this Friday, Jennings was asked a…",
    "link": "https://crooksandliars.com/2026/02/keith-boykin-takes-apart-trump-shill-scott",
    "timestamp": "2026-02-22T14:15:52Z"
  },
  {
    "title": "Bernie Sanders Hits Billionaires Hard At L.A. Pro-Tax Rally",
    "description": "Bernie Sanders rallied support in Los Angeles Wednesday night for a controversial proposed wealth tax in California. You are probably familiar with Bernie's greatest hits, but the crowd didn't seem to mind hearing the oldies.\n“Do you know what the most signif…",
    "link": "https://crooksandliars.com/2026/02/bernie-sanders-hits-billionaires-hard-la",
    "timestamp": "2026-02-22T14:15:51Z"
  },
  {
    "title": "Man shot dead 'after trying to unlawfully enter' Trump's Mar-a-lago estate, Secret Service says",
    "description": "The man was aged in his early 20s, law enforcement said.",
    "link": "https://www.thejournal.ie/man-shot-mar-a-lago-trump-6964461-Feb2026/",
    "timestamp": "2026-02-22T14:14:41Z"
  },
  {
    "title": "Man in 20s shot dead after trying to break into Trump’s Mar-a-Lago estate ‘armed with shotgun & fuel can’",
    "description": "A MAN has been shot dead after allegedly trying to enter Donald Trump’s Mar-a-Lago estate. The US Secret Service said it had shot and killed the suspect in his 20s after he tried to enter the perimeter around the US president’s Florida residence. Authorities …",
    "link": "https://freerepublic.com/focus/f-news/4367849/posts",
    "timestamp": "2026-02-22T14:14:35Z"
  },
  {
    "title": "Armed man shot dead while attempting to enter Mar-A-Lago",
    "description": "The US Secret Service says an armed man was shot and killed after entering the secure perimeter of Mar-a-Lago, President Donald Trump’s resort in Palm Beach, Florida.President Trump was at the White House during this incident.The name of the person who was sh…",
    "link": "https://www.israelnationalnews.com/flashes/676777",
    "timestamp": "2026-02-22T14:14:00Z"
  },
  {
    "title": "Man killed after entering perimeter of Trump’s Mar-a-Lago resort",
    "description": "The incident in Florida took place on Sunday when US President Donald Trump was in Washington, DC.",
    "link": "https://www.aljazeera.com/news/2026/2/22/man-killed-after-entering-perimeter-of-trumps-mar-a-lago-resort",
    "timestamp": "2026-02-22T14:13:54Z"
  },
  {
    "title": "Live updates: Secret Service shoot man after 'unauthorised entry' at Mar-a-Lago",
    "description": "Live updates: Secret Service shoot man after 'unauthorised entry' at Mar-a-Lagobbc.com",
    "link": "https://www.bbc.com/news/live/cr57l3rj3yqt",
    "timestamp": "2026-02-22T14:13:48Z"
  },
  {
    "title": "'New TARIFFS': Trump Bounces Back with Second Global Tariff Hike Since SCOTUS Ruling",
    "description": "President Donald Trump is sterring around the obstacle of the Supreme Court as he pushes tariffs even higher than orginally planned.",
    "link": "https://www.westernjournal.com/new-tariffs-trump-bounces-back-second-global-tariff-hike-since-scotus-ruling/",
    "timestamp": "2026-02-22T14:12:53Z"
  },
  {
    "title": "Law enforcement shoots and kills man at Mar-a-Lago, Secret Service says",
    "description": "U.S. Secret Service agents and a Palm Beach County Sheriff's office deputy shot and killed a man who entered the secure perimeter at Mar-a-Lago with \"what appeared to be a shotgun and a fuel can,\" Secret Service announced in a statement on Sunday.",
    "link": "https://www.nbcnews.com/politics/donald-trump/law-enforcement-shoots-kills-man-mar-lago-secret-service-rcna260141",
    "timestamp": "2026-02-22T14:12:47Z"
  },
  {
    "title": "Man who 'tried to enter' Trump's Mar-a-Lago shot dead",
    "description": "The ⁠US Secret Service has said its agents shot ‌and ⁠killed a man in his 20s after he tried to ‌unlawfully enter a ⁠secure ‌perimeter at President Donald Trump's ⁠Mar-a-Lago ‌resort in West Palm Beach, ⁠Florida.",
    "link": "https://www.rte.ie/news/us/2026/0222/1559813-mar-a-lago-florida/",
    "timestamp": "2026-02-22T14:11:29Z"
  },
  {
    "title": "U.S. Secret Service Shot And Killed Armed Man Who Entered The Secure Perimeter Of Mar-a-Lago",
    "description": "U.S. Secret Service announced Sunday that an armed man was shot and killed after entering the secure perimeter of Mar-a-Lago, Trump’s resort in Palm Beach, Fla.",
    "link": "https://www.huffpost.com/entry/ap-us-mar-a-lago-shooting-secret-service_n_699b0dabe4b05375e2832867",
    "timestamp": "2026-02-22T14:10:17Z"
  },
  {
    "title": "Live updates: Secret Service shoot man after 'unauthorised entry' at US President Donald Trump's Mar-a-Lago residence in Florida",
    "description": "Live updates: Secret Service shoot man after 'unauthorised entry' at US President Donald Trump's Mar-a-Lago residence in Floridabbc.co.uk",
    "link": "https://www.bbc.co.uk/news/live/cr57l3rj3yqt",
    "timestamp": "2026-02-22T14:08:58Z"
  },
  {
    "title": "U.S. Secret Service agents shot and killed armed man who entered the secure perimeter of Mar-a-Lago",
    "description": "The U.S. Secret Service announced Sunday that an armed man was shot and killed after entering the secure perimeter of Mar-a-Lago, President Donald Trump’s resort in Palm Beach, Florida.",
    "link": "https://www.bostonherald.com/2026/02/22/u-s-secret-service-agents-shot-and-killed-armed-man-who-entered-the-secure-perimeter-of-mar-a-lago/",
    "timestamp": "2026-02-22T14:06:59Z"
  },
  {
    "title": "US Secret Service shoots dead man who tried to enter Mar-a-Lago",
    "description": "Secret Service agents shot and killed a man trying to enter President Donald Trump's Mar-a-Lago resort.",
    "link": "https://www.dw.com/en/secret-service-shoots-man-at-mar-a-lago/a-76078987",
    "timestamp": "2026-02-22T14:06:00Z"
  },
  {
    "title": "New law puts Kansas at vanguard of denying trans identities on drivers licenses, birth certificates",
    "description": "Kansas is set to invalidate about 1,700 driver's licenses held by transgender residents and roughly as many of their birth certificates",
    "link": "https://abcnews.com/US/wireStory/new-law-puts-kansas-vanguard-denying-trans-identities-130382541",
    "timestamp": "2026-02-22T14:05:58Z"
  },
  {
    "title": "France to summon US ambassador over comments on far-right activist’s death",
    "description": "Top French diplomat says his government rejects any attempt to use Quentin Deranque's death 'for political purposes'.",
    "link": "https://www.aljazeera.com/news/2026/2/22/france-summons-us-ambassador-over-comments-on-far-right-activists-death",
    "timestamp": "2026-02-22T14:04:46Z"
  },
  {
    "title": "Conservatives cried voter fraud long before Trump",
    "description": "Claims of stolen elections and tainted ballots have often been aimed at curbing Black political power",
    "link": "https://www.salon.com/2026/02/22/conservatives-cried-voter-fraud-long-before-trump/",
    "timestamp": "2026-02-22T14:00:51Z"
  },
  {
    "title": "Three ways Canada can navigate an increasingly erratic and belligerent United States",
    "description": "Canada can draw lessons from its centuries-long coexistence with an often-erratic neighbour to successfully navigate the economic volatility of the present era.",
    "link": "https://theconversation.com/three-ways-canada-can-navigate-an-increasingly-erratic-and-belligerent-united-states-276035",
    "timestamp": "2026-02-22T13:59:03Z"
  },
  {
    "title": "Donald Trump questioning why Iran has not 'capitulated' as US builds up forces, says envoy",
    "description": "The US and Iran this week resumed Oman-mediated talks in Geneva aimed at averting the possibility of military action.",
    "link": "https://www.thejournal.ie/trump-united-states-iran-6964433-Feb2026/",
    "timestamp": "2026-02-22T13:55:04Z"
  },
  {
    "title": "Joe Rogan can't sleep due to admin's 'madness' after endorsing Trump: 'It's over whelming'",
    "description": "Joe Rogan, who endorsed Donald Trump in the 2024 election over Kamala Harris, recently said he has trouble sleeping as a result of the current administration's \"madness.\"On his show, one of the world's most popular podcasters appeared to hit the admin, includ…",
    "link": "https://www.rawstory.com/trump-joe-rogan-2675291925/",
    "timestamp": "2026-02-22T13:54:02Z"
  },
  {
    "title": "The US Appears Likely To Attack Iran, Again. We Must Stop This Illegal Act.",
    "description": "President Donald Trump seems to think he is King of the World, not just the United States. Even as he convenes his “Board of Peace” (“Board of Imperial Conquest” would be more apt) it looks like the US will soon illegally attack Iran, again, as it did last Ju…",
    "link": "https://www.antiwar.com/blog/2026/02/22/the-us-appears-likely-to-attack-iran-again-we-must-stop-this-illegal-act/",
    "timestamp": "2026-02-22T13:53:57Z"
  },
  {
    "title": "Exiled Iranian princess: Islamic regime 'has never been this close' to falling, people 'begging' Trump to help",
    "description": "Exiled Iranian princess Noor Phalavi said Iran's regime has never been weaker than it is now and urged action against Ayatollah Ali Khamenei.",
    "link": "https://www.foxnews.com/politics/exiled-iranian-princess-islamic-regime-has-never-been-close-falling-people-begging-trump-help",
    "timestamp": "2026-02-22T13:50:47Z"
  },
  {
    "title": "Danish military evacuates US submariner in need of urgent medical care off Greenland",
    "description": "Denmark’s military said its arctic command forces evacuated a crew member of a U.S. submarine off the coast of Greenland for urgent medical treatment.",
    "link": "https://nypost.com/2026/02/22/world-news/danish-military-evacuates-us-submariner-in-need-of-urgent-medical-care-off-greenland/",
    "timestamp": "2026-02-22T13:40:43Z"
  },
  {
    "title": "Report: US Planning Targeted Strikes on Iran Regime Leaders",
    "description": "President Donald Trump could make top Iranian leaders his targets according to an option set before the president.",
    "link": "https://www.westernjournal.com/report-us-planning-targeted-strikes-iran-regime-leaders/",
    "timestamp": "2026-02-22T13:40:36Z"
  },
  {
    "title": "Critics say Trump's 'frankly unreal' Greenland post shows he's 'suffering from dementia'",
    "description": "President Donald Trump made the bizarre announcement Saturday that he would be sending a hospital ship to Greenland on an apparent humanitarian mission, and with no explanation for what prompted the expedition – but critics have zeroed in on what they say is …",
    "link": "https://www.rawstory.com/trump-2675291961/",
    "timestamp": "2026-02-22T13:40:00Z"
  },
  {
    "title": "Russia targets Ukraine with 345 drones and missiles, Zelenskyy says",
    "description": "\"Russia will not stop,\" said Yulia Svyrydenko, the Ukrainian prime minister.",
    "link": "https://abcnews.com/International/russia-targets-ukraine-345-drones-missiles-striking-energy/story?id=130381254",
    "timestamp": "2026-02-22T13:36:54Z"
  },
  {
    "title": "Un crucciato presidente Trump a un evento alla Casa Bianca",
    "description": "epa12767444 US President Donald Trump lowers his head in prayer during the Governors Dinner in the East Room of the White House in Washington, DC, USA, 21 February 2026. EPA/Samuel Corum / POOL Samuel Corum / POOL (ANSA). (ANSA)",
    "link": "https://www.ansa.it/sito/photogallery/people/2026/02/22/un-crucciato-presidente-trump-a-un-evento-alla-casa-bianca_50acd0cd-ba3d-4e30-8f25-ed9fccc388a5.html",
    "timestamp": "2026-02-22T13:33:49Z"
  },
  {
    "title": "Malaysia weighs response after US court strikes down Trump tariffs",
    "description": "KUALA LUMPUR: Malaysia is monitoring the implications of a recent US Supreme Court ruling that struck down tariffs imposed by US President Donald Trump, with the Investment, Trade and Industry Ministry (MITI) now reviewing the matter. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/02/22/malaysia-weighs-response-after-us-court-strikes-down-trump-tariffs",
    "timestamp": "2026-02-22T13:30:00Z"
  },
  {
    "title": "Half measures",
    "description": "Ian Buruma, who is writing a book about Berlin during WWII, points out that people have a nearly unlimited capacity to normalize what would previously have been considered intolerable: In a letter to his sister during winter in 1944, when Berlin was being bom…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/half-measures-2",
    "timestamp": "2026-02-22T13:29:35Z"
  },
  {
    "title": "Trump tariff chaos: What does 15% levy mean for trade deals the US signed?",
    "description": "From the EU to Vietnam to the UK and India, multiple countries had signed or finalised trade deals with the US.",
    "link": "https://www.aljazeera.com/news/2026/2/22/trump-tariff-chaos-what-does-15-levy-mean-for-trade-deals-the-us-signed",
    "timestamp": "2026-02-22T13:28:15Z"
  },
  {
    "title": "Supreme Court Voids Trump Tariffs: Tech Prices Expected To Drop As Electronics Taxes Are Ruled Illegal",
    "description": "In a landmark 6–3 ruling issued on Friday, February 20, 2026, the United States Supreme Court invalidated several aggressive trade tariffs implemented by President Donald Trump. According to NBCNews, the decision is expected to trigger a significant reduction…",
    "link": "https://www.ubergizmo.com/2026/02/supreme-court-voids-tariffs/",
    "timestamp": "2026-02-22T13:25:09Z"
  },
  {
    "title": "Gu wins triumphant gold of Milan-Cortina Olympics before ice hockey finale",
    "description": "Eileen Gu pulled out all the stops to win the gold medal that had eluded her at the Winter Olympics on Sunday, while a blockbuster men's ice hockey final between the USA and Canada was set to close the action.- More than just ice hockey -\nThe men's ice hockey…",
    "link": "https://sports.yahoo.com/articles/gu-wins-triumphant-gold-milan-132115131.html",
    "timestamp": "2026-02-22T13:21:15Z"
  },
  {
    "title": "GOP lawmaker hits back after Trump revokes his endorsement: 'I'll keep doing it'",
    "description": "In a rare move on Saturday, Donald Trump admitted he was wrong. The president revoked his endorsement of a Republican congressman who opposed widespread tariffs that Trump has championed.Taking to Truth Social, the president wrote, \"Based on a lack of support…",
    "link": "https://www.rawstory.com/trump-gop-2675291907/",
    "timestamp": "2026-02-22T13:17:05Z"
  },
  {
    "title": "Nicki Minaj unveils $155,000 MAGA-inspired makeover — see the transformation",
    "description": "Nicki Minaj, one of the most iconic musicians who has recently gained the spotlight for both her beauty and political alignment. Nicki’s style has evolved, with blonde hair and more conservative attires reflecting a “MAGA makeover,” leaving Donald Trump impre…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nicki-minaj-unveils-155000-maga-inspired-makeover-see-the-transformation/articleshow/128676601.cms",
    "timestamp": "2026-02-22T13:13:22Z"
  },
  {
    "title": "Donald Trump threw a rattled, unhinged tantrum after SCOTUS struck down his tariffs",
    "description": "On Friday, the conservative-activist Supreme Court made a rare move to rein in Donald Trump. Too little, too fascist! SCOTUS ruled in a 6-to-3 decision that Trump has no authority to levy tariffs without oversight or congressional approval. The ruling effecti…",
    "link": "https://www.celebitchy.com/963265/donald_trump_threw_a_rattled_unhinged_tantrum_after_scotus_struck_down_his_tariffs/",
    "timestamp": "2026-02-22T13:02:53Z"
  },
  {
    "title": "Why Stephen Colbert is right about the ‘equal time’ rule, despite warnings from the FCC",
    "description": "The ‘equal time’ rule has been around for a century and aims to promote broadcasters’ editorial independence and free expression – an idea that is now under threat from the FCC.",
    "link": "https://theconversation.com/why-stephen-colbert-is-right-about-the-equal-time-rule-despite-warnings-from-the-fcc-276559",
    "timestamp": "2026-02-22T13:02:25Z"
  },
  {
    "title": "JPMorgan Admits Closing Over 50 Trump Bank Accounts After January 6th",
    "description": "JPMorgan Chase has formally admitted that it terminated more than 50 accounts connected to President Donald Trump and his business operations in the wake of the January 6th protest.\nThe post JPMorgan Admits Closing Over 50 Trump Bank Accounts After January 6t…",
    "link": "https://www.thegatewaypundit.com/2026/02/jpmorgan-admits-closing-50-trump-bank-accounts-after/",
    "timestamp": "2026-02-22T13:00:42Z"
  },
  {
    "title": "Colorado faith communities rally around state’s immigrants in face of ICE deportation push",
    "description": "Coloradans of varied faith backgrounds described turning the Biblical command of “love thy neighbor” into action.",
    "link": "https://www.denverpost.com/2026/02/22/colorado-churches-immigration-protests/",
    "timestamp": "2026-02-22T13:00:30Z"
  },
  {
    "title": "WITKOFF: Iran could be close to enriching uranium for bomb-making material...",
    "description": "The US envoy left out that Iran currently has no access to its material, no machines to enrich it, and no weapons program to use it for any operational purpose.",
    "link": "https://www.jpost.com/middle-east/article-887433",
    "timestamp": "2026-02-22T13:00:24Z"
  },
  {
    "title": "Jimmy Lai is risking everything for democracy. We can't ignore what China is doing",
    "description": "Chinese Communist Party destroyed publisher Jimmy Lai through asset freezes, staff arrests and harassment before imposing his prison sentence.",
    "link": "https://www.foxnews.com/opinion/jimmy-lai-risking-everything-democracy-we-cant-ignore-what-china-doing",
    "timestamp": "2026-02-22T13:00:18Z"
  },
  {
    "title": "Ticket prices, political concerns outweigh FIFA World Cup hype for some fans",
    "description": "World governing body of soccer says World Cup excitement is at record levels, but supporter groups say costly ticket prices, new travel rules and safety concerns are keeping some European fans home.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/fifa-world-cup-tickets-politics-travel-concerns-9.7097422",
    "timestamp": "2026-02-22T13:00:00Z"
  },
  {
    "title": "MAGA’s Animal Nationalism",
    "description": "The Trump administration has a special bond with dogs and cats. ​​​​​​",
    "link": "https://www.theatlantic.com/science/2026/02/maga-animals-nationalism/686084/",
    "timestamp": "2026-02-22T13:00:00Z"
  },
  {
    "title": "Trump curious why Iran has not 'capitulated' amid US military buildup, says Witkoff",
    "description": "US President Donald Trump has ordered a huge buildup of forces in the Middle East and preparations for a potential multi-week air attack on Iran.",
    "link": "https://www.channelnewsasia.com/world/trump-iran-us-military-build-up-why-not-capitulated-5945541",
    "timestamp": "2026-02-22T13:00:00Z"
  },
  {
    "title": "Trump Curious Why Iran Has Not ‘Capitulated’ Amid U.S. Military Buildup, Says Witkoff",
    "description": "Trump is curious as to why Iran has not yet \"capitulated\" and agreed to curb its nuclear programme, as Washington builds up its military capability in the Middle East, Trump's special envoy Steve Witkoff said.",
    "link": "https://www.huffpost.com/entry/trump-iran-military-buildup-middle-east_n_699afc56e4b05375e27f106e",
    "timestamp": "2026-02-22T12:58:46Z"
  },
  {
    "title": "EU may freeze US trade deal approval over Trump’s tariff ‘chaos’",
    "description": "European Parliament’s trade chief to propose halting deal approval until getting ‘a comprehensive legal assessment and clear commitments from the US’",
    "link": "https://www.bloomberg.com/news/articles/2026-02-22/eu-may-freeze-us-trade-deal-approval-over-trump-s-tariff-chaos",
    "timestamp": "2026-02-22T12:57:23Z"
  },
  {
    "title": "Trump curious why Iran has not 'capitulated' amid US military buildup, says Steve Witkoff",
    "description": "President Trump is curious why Iran hasn't agreed to curb its nuclear program despite U.S. military buildup and pressure. Special envoy Steve Witkoff stated Iran is enriching uranium to dangerous levels, potentially a week from bomb-making material. Talks con…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-curious-why-iran-has-not-capitulated-amid-us-military-buildup-says-steve-witkoff/articleshow/128677151.cms",
    "timestamp": "2026-02-22T12:52:23Z"
  },
  {
    "title": "Trump curious why Iran has not 'capitulated' amid US military buildup, says Witkoff",
    "description": "Feb 22 (Reuters) - U.S. President Donald Trump ⁠is curious as to why Iran has not yet \"capitulated\" and agreed to curb its nuclear ⁠programme, as Washington builds up its military capability in the Middle East, Trump's special envoy ‌Steve Witkoff said. Read …",
    "link": "https://www.thestar.com.my/news/world/2026/02/22/trump-curious-why-iran-has-not-039capitulated039-amid-us-military-buildup-says-witkoff",
    "timestamp": "2026-02-22T12:50:00Z"
  },
  {
    "title": "Carrots Beat Tariffs: How Smart Policy Attracts Manufacturing Investment",
    "description": "Policymakers can use two basic strategies to attract manufacturing investments. These involve attractive incentives — the carrot — which include subsidies, grants and tax credits, or negative incentives — the stick — which include tariffs and threats. Using c…",
    "link": "https://www.fairobserver.com/business/carrots-beat-tariffs-how-smart-policy-attracts-manufacturing-investment/",
    "timestamp": "2026-02-22T12:49:27Z"
  },
  {
    "title": "Sunday: Hili dialogue",
    "description": "Welcome to Sunday, February 22, 2026, Sabbath for non-Jewish cats and National Margarita Day, celebrating everyone’s favorite frozen drink.  In fact, I could drink one now although it’s 5:30 a.m. on Saturday as I begin this post. Note that, according to Wikip…",
    "link": "https://whyevolutionistrue.com/2026/02/22/sunday-hili-dialogue-574/",
    "timestamp": "2026-02-22T12:45:03Z"
  },
  {
    "title": "No Way",
    "description": "On Feb. 6, 2026, an article by Bible prophecy expert Jim Fletcher was posted on Koenig’s Eye View that said: Iranian researcher Hamid Reza Bigdelo claimed on the Iranian television program “Toward the Horizon of Palestine” that Israel’s fate is “destruction.”…",
    "link": "https://freerepublic.com/focus/f-religion/4367836/posts",
    "timestamp": "2026-02-22T12:43:11Z"
  },
  {
    "title": "EU lawmaker urges delay to US trade deal vote after tariff upheaval",
    "description": "BRUSSELS: A senior EU lawmaker proposed on Sunday (Feb 22) postponing a vote on the EU-US trade deal that had been planned for this week, arguing that the terms and legal basis on which the deal was struck had changed.The",
    "link": "https://www.channelnewsasia.com/world/eu-lawmaker-urges-delay-us-trade-deal-vote-after-tariff-upheaval-5945521",
    "timestamp": "2026-02-22T12:39:57Z"
  },
  {
    "title": "Netflix/Trump, John Waters/AHS 13, Scrubs & More: BCTV Daily Dispatch",
    "description": "Welcome back, folks! With My Chemical Romance setting the perfect tone with \"Sing\" (BCTV DD's unofficial \"official\" theme), we've got your latest edition of BCTV Daily Dispatch! Here's where we look back at what we've been doing for the past 24 hours that you…",
    "link": "https://bleedingcool.com/tv/netflix-trump-john-waters-ahs-13-scrubs-more-bctv-daily-dispatch/",
    "timestamp": "2026-02-22T12:37:07Z"
  },
  {
    "title": "EU lawmaker urges delay to US trade deal vote after tariff upheaval",
    "description": "A senior EU lawmaker wants to delay a vote on the EU-U.S. trade deal. This comes after the U.S. Supreme Court struck down President Trump's global tariffs. Trump then imposed new tariffs, creating confusion for EU partners. The lawmaker stated the deal's term…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-lawmaker-urges-delay-to-us-trade-deal-vote-after-tariff-upheaval/articleshow/128676684.cms",
    "timestamp": "2026-02-22T12:36:57Z"
  },
  {
    "title": "Trump sending US military hospital ship to Greenland to 'take care' of sick",
    "description": "President Donald Trump's says he will send a hospital ship to Greenland as Denmark demonstrates unity with Arctic territory amid tensions.",
    "link": "https://www.foxnews.com/politics/trump-sending-us-military-hospital-ship-greenland-take-care-sick",
    "timestamp": "2026-02-22T12:34:16Z"
  },
  {
    "title": "The world's largest energy lender has a new head: Here's how it could shape U.S. policy",
    "description": "Gregory Beard heads the Office of Energy Dominance Financing, which has nearly $300 billion in lending authority. These are his energy priorities.",
    "link": "https://www.cnbc.com/2026/02/22/the-worlds-largest-energy-lender-has-a-new-head-heres-how-it-could-shape-us-policy.html",
    "timestamp": "2026-02-22T12:32:18Z"
  },
  {
    "title": "The Nobel laureate who co-wrote ‘Why Nations Fail’ warns U.S. democracy won’t survive unless these two things change",
    "description": "Daron Acemoglu told Fortune Donald Trump’s AI policy could jeopardize U.S. democracy, but AI proponents say any regulation would hamper AI innovation.",
    "link": "https://fortune.com/2026/02/22/who-is-daron-acemoglu-nobel-laureate-ai-job-layoffs-economic-inequality-donald-trump/",
    "timestamp": "2026-02-22T12:32:00Z"
  },
  {
    "title": "White House Dinner Closes A Turbulent Week For Governors In Washington",
    "description": "Governors have gathered for the annual National Governors Association dinner after a tense week.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-governors-dinner-white-house_n_699af460e4b050c4ef26d137",
    "timestamp": "2026-02-22T12:28:14Z"
  },
  {
    "title": "U.S. Ambassador Causes Uproar By Claiming Israel Has A Right To Much Of The Middle East",
    "description": "Arab and Muslim countries are sharply condemning comments by the U.S. ambassador to Israel, who said in an interview that Israel had a right to much of the Middle East.",
    "link": "https://www.huffpost.com/entry/us-ambassador-israel-middle-east-uproar_n_699af428e4b050c4ef26d135",
    "timestamp": "2026-02-22T12:23:46Z"
  },
  {
    "title": "'This is what we call tilting': Gov pinpoints how Trump's 'gambling away your tax dollars'",
    "description": "Donald Trump is \"gambling away your tax dollars,\" according to a top Democratic contender for 2028.Illinois governor JB Pritzker, a billionaire, reportedly took home $1.4 million in winnings after playing blackjack in 2024. Now he's putting his expertise to t…",
    "link": "https://www.rawstory.com/jb-pritzker-2675291560/",
    "timestamp": "2026-02-22T12:22:12Z"
  },
  {
    "title": "Olympian Eileen Gu hits out after JD Vance criticised her for not representing US",
    "description": "American-born Eileen Gu has a theory about why JD Vance is concerned with her representing China",
    "link": "https://www.ladbible.com/news/sport/chinese-eileen-gu-jd-vance-response-olympics-team-america-192415-20260222",
    "timestamp": "2026-02-22T12:10:12Z"
  },
  {
    "title": "Arab, Muslim nations rebuke US envoy's Israel land claim",
    "description": "Mike Huckabee, the US ambassador to Israel, suggested that Israel holds a biblical entitlement to a large portion of the Middle East.",
    "link": "https://www.dw.com/en/arab-muslim-nations-rebuke-us-envoys-israel-land-claim/a-76077271",
    "timestamp": "2026-02-22T12:09:00Z"
  },
  {
    "title": "How did Paramount beat Netflix on the Warner Bros. antitrust hurdle? #entertainment",
    "description": "A surprise regulatory win and the larger takeover fight Paramount scored an important procedural victory by clearing an antitrust hurdle tied to the contested sale of Warner Bros., doing so before Netflix could secure the same regulatory green light. The deve…",
    "link": "https://alltoc.com/entertainment/how-did-paramount-beat-netflix-on-the-warner-bros-antitrust-hurdle",
    "timestamp": "2026-02-22T12:07:50Z"
  },
  {
    "title": "US military buildup near Iran proves defeat in previous regional wars: Ansarullah",
    "description": "A senior member of the Yemeni Ansarullah resistance movement says the US buildup of warships and fighter jets near Iran, as well as threats of a new round of aggression against the Islamic Republic and the Axis of Resistance, attest to the defeat of Washingto…",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv05.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Dozens of US Warplanes Spotted at Jordan Base Amid US-Iran Tensions - Reports",
    "description": "Dozens of US warplanes have been spotted at Muwaffaq Salti Air Base in Jordan amid tensions between the United States and Iran, the New York Times has reported, citing satellite photos and flight data.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-sputnik02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump raises new global tariff from 10 pct to 15 pct",
    "description": "U.S. President Donald Trump said Saturday he will raise the new global tariff to 15 percent, one day after he announced a 10 percent worldwide duty following a heavy blow from the Supreme Court.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260222-pdo02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "ICE quietly buys warehouses for major detention expansion, catching local officials off guard",
    "description": "US federal immigration authorities are acquiring large warehouse properties nationwide as part of a sweeping effort to expand detention capacity, often without notifying local officials before deals are finalized.",
    "link": "https://www.globalsecurity.org/security/library/news/2026/02/sec-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Iran's military alertness main 'deterrent' against enemy miscalculations: Top commander",
    "description": "A senior Iranian commander said the constant alertness and readiness of the country's Armed Forces constitute the \"most important deterrent\" against any adventurism or miscalculation by enemies.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv04.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "US Steps Up South Caucasus Push As Armenia-Azerbaijan Peace Hangs In Balance",
    "description": "Azerbaijani President Ilham Aliyev and Armenian Prime Minister Nikol Pashinian were back in Washington this week, just days after US Vice President JD Vance visited both countries. The White House has branded the effort a \"Board of Peace\" push aimed at consol…",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-rferl01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Iranian Students Chant Anti-Government Slogans, Clash With Security Forces In Tehran",
    "description": "Iranian students chanting anti-government slogans faced off with security forces outside a Tehran university, according to social media videos and other reports.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-rferl01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Araghchi to Trump: Prove your claim of 32,000 deaths in Iran riots",
    "description": "Iran's foreign minister has categorically dismissed US President Donald Trump's claim that 32,000 people were killed in just two days of riots across Iran last month, urging him to prove the claim.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv06.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump Vows to Raise Global Tariff Rate to 15%",
    "description": "US President Donald Trump announced on Saturday that he will raise the global tariff rate on goods imported from all countries in response to what he sees as trading with the United States in bad faith to 15% from 10%.",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260221-sputnik01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "Trump administration advances Saudi nuclear deal, leaves door open to enrichment: Report",
    "description": "The Trump administration has informed Congress of its pursuit of a civilian nuclear cooperation agreement with Saudi Arabia, which may not include the strict non-proliferation conditions typically required in similar US accords, a new report reveals.",
    "link": "https://www.globalsecurity.org/wmd/library/news/saudi/2026/saudi-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "As Russia's War On Ukraine Nears Fifth Year, Analysts See 'Frozen' Prospects For Peace",
    "description": "As Russia's full-scale invasion of Ukraine approaches its fourth anniversary, the conflict is increasingly defined by hardened positions and structural constraints that leave little room for a negotiated breakthrough, former US diplomats and analysts said.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2026/02/ukraine-260221-rferl02.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  },
  {
    "title": "'We will not bow to pressure or coercion': President Pezeshkian",
    "description": "President Masoud Pezeshkian has declared that Iran would not bow under external pressure or internal hardship, vowing steadfastness \"to the very last drop of our blood\" as tensions persist with the United States.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2026/02/iran-260221-presstv01.htm",
    "timestamp": "2026-02-22T12:07:47Z"
  }
]