[
  {
    "title": "Paramount to pay Trump $16m to settle 60 Minutes lawsuit",
    "description": "The media company noted the settlement does not include a statement of apology or regret.",
    "link": "https://www.bbc.com/news/articles/c3w4n8778q2o",
    "timestamp": "2025-07-02T09:35:39Z"
  },
  {
    "title": "Russia ramps up offensives on 2 fronts in Ukraine as both sides seek advantage before fall",
    "description": "An emboldened Russia has ramped up military offensives on two fronts in Ukraine, scattering Kyiv’s precious reserve troops and threatening to expand the fighting to a new Ukrainian region as each side seeks an advantage before the fighting season wanes in the…",
    "link": "https://nypost.com/2025/07/02/world-news/russia-ramps-up-offensives-on-2-fronts-in-ukraine-as-both-sides-seek-an-advantage-before-fall/",
    "timestamp": "2025-07-02T09:34:15Z"
  },
  {
    "title": "'The cognitive dissonance is frightening': How Trump controls his supporters",
    "description": "As I was editing the following interview with Charles Gaba, founder of ACAsignups.com\r\n, I was reminded of something Will Stancil told me during my chat with him\r\n. Will said: “I think people are used to living in a relatively stable era and have come to beli…",
    "link": "https://www.rawstory.com/raw-investigates/trump-supporters-2672502232/",
    "timestamp": "2025-07-02T09:30:02Z"
  },
  {
    "title": "As Federal Chaos Ensues, Trustbusters Rise in the States",
    "description": "July 2, 2025 As Federal Chaos Ensues, Trustbusters Rise in the States With Trump’s antitrust appointees more concerned with scoring points in MAGA culture wars than restraining corporate abuses, officials in the states are keeping up the fight. Ron Knox Share…",
    "link": "https://www.thenation.com/?post_type=article&p=562099",
    "timestamp": "2025-07-02T09:30:00Z"
  },
  {
    "title": "Elon Musk Praises Trump for Global Conflict Resolutions Despite Clashing Over Spending Bill",
    "description": "MOSCOW (Sputnik) - US entrepreneur Elon Musk on Wednesday praised US President Donald Trump for resolving \"several serious conflicts around the world,\" after receiving criticism from the US leader.",
    "link": "https://sputnikglobe.com/20250702/elon-musk-praises-trump-for-global-conflict-resolutions-despite-clashing-over-spending-bill-1122383308.html",
    "timestamp": "2025-07-02T09:28:42Z"
  },
  {
    "title": "Arizona governor vetoes bill for state-run digital assets reserve for third time",
    "description": "Arizona Governor Katie Hobbs has vetoed a proposed law establishing a state-run Bitcoin and digital assets reserve fund. On July 1, Governor Hobbs informed House Speaker Steve Montenegro in a letter that she opposed House Bill 2324, which sought to establish …",
    "link": "https://cryptoslate.com/arizona-governor-vetoes-bill-for-state-run-digital-assets-reserve-for-third-time/",
    "timestamp": "2025-07-02T09:28:20Z"
  },
  {
    "title": "Why your Fourth of July fireworks may be disrupted — Next year",
    "description": "America relies on China for its Fourth of July fireworks. Tariffs imposed by President Trump are causing concern. These tariffs could increase the cost of fireworks. This may impact celebrations like the 250th anniversary in 2026. The American Pyrotechnics As…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/why-your-fourth-of-july-fireworks-may-be-disrupted-next-year/articleshow/122202718.cms",
    "timestamp": "2025-07-02T09:28:14Z"
  },
  {
    "title": "Paramount is going to pay $16 million to settle Trump lawsuit over ‘60 Minutes’ Kamala Harris interview",
    "description": "In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October.\nParamount told media o…",
    "link": "https://biztoc.com/x/842b4d1319bf21e8",
    "timestamp": "2025-07-02T09:25:32Z"
  },
  {
    "title": "Here's what could happen if Trump decides to take his feud with Powell to the next level",
    "description": "There's a chance Donald Trump won't get lower interest rates even after he finds a replacement for Fed Chair Powell, market pros told BI.",
    "link": "https://www.businessinsider.com/trump-powell-fed-chair-interest-rates-inflation-stock-market-bonds-2025-7",
    "timestamp": "2025-07-02T09:25:01Z"
  },
  {
    "title": "U.S. imposes tougher policy on Cuba",
    "description": "U.S. President Donald Trump signed a memorandum on Monday to toughen U.S. policy on Cuba, including restrictions on certain financial transactions and travel.",
    "link": "https://www.globalsecurity.org/wmd/library/news/cuba/cuba-250701-pdo01.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "US Lifts Sanctions on Syrian National Defense Forces",
    "description": "The US Department of State terminated sanctions on the Syrian National Defense Forces, the 1st and the 4th divisions of the Syrian Arab Army as well as a number of individuals and entities.",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250701-sputnik01.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "Iran's uranium enrichment technology, science cannot be obliterated by bombs: Araghchi",
    "description": "Foreign Minister Abbas Araghchi has asserted that Iran's nuclear energy knowhow and determination to further advance its peaceful nuclear industry could not simply be destroyed through military aggression.",
    "link": "https://www.globalsecurity.org/wmd/library/news/iran/2025/iran-250701-presstv06.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "US eases Syria sanctions amid reports of HTS regime ceding occupied Golan to Israel",
    "description": "US President Donald Trump has signed an executive order to ease Washington's unilateral sanctions against Syria amid circulating reports regarding plans by the Hay'at Tahrir al-Sham (HTS)-led regime to hand over the occupied Golan Heights to Israel as part of…",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250701-presstv02.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "Trump administration escalates legal battles with Los Angeles",
    "description": "The U.S. Justice Department on Monday sued the City of Los Angeles, Mayor Karen Bass, and the City Council, asking a federal judge to strike down the city's \"sanctuary\" ordinance on the grounds it obstructs federal immigration enforcement.",
    "link": "https://www.globalsecurity.org/security/library/news/2025/07/sec-250701-pdo01.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "Trump signs executive order terminating Syria sanctions: White House",
    "description": "U.S. President Donald Trump on Monday signed an executive order terminating Syria sanctions, according to the White House website.",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250701-pdo01.htm",
    "timestamp": "2025-07-02T09:24:11Z"
  },
  {
    "title": "Israel agrees to necessary conditions to finalize 60-day ceasefire in Gaza: Trump",
    "description": "U.S. President Donald Trump said Tuesday that Israel has agreed to the necessary conditions to finalize a 60-day ceasefire to end the conflict in Gaza, and also urged Hamas to accept the deal.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250702-pdo01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "Some US Weapons Won't Be Sent To Ukraine Following Pentagon Review",
    "description": "The United States is halting some shipments of weapons previously promised to Ukraine for use in its war with Russia under the Biden administration after a Pentagon review determined that US stockpiles have declined too much.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250702-rferl01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "Trump Urges Hamas To Accept Proposal For 60-Day Cease-Fire",
    "description": "US President Donald Trump urged Iran-backed Hamas militants to agree to what he called a \"final proposal\" for a 60-day cease-fire with Israel in Gaza.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250702-rferl01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "U.S. halts military aid to Ukraine amid concerns about low U.S. stockpiles",
    "description": "The Trump administration has halted part of military aid to Ukraine following a review of U.S. own stockpiles, the White House and Pentagon confirmed on Tuesday.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/07/ukraine-250702-pdo01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "Trump proposes 60-day Gaza ceasefire plan",
    "description": "US President Donald Trump has announced a 60-day ceasefire proposal for Gaza aimed at halting Israel's genocidal war in the besieged territory.",
    "link": "https://www.globalsecurity.org/military/library/news/2025/07/mil-250702-presstv01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "U.S., India Talk 10-Year Cooperative Framework, Defense Cooperation, Shared Priorities",
    "description": "Defense Secretary Pete Hegseth met today at the Pentagon with India's External Affairs Minister S. Jaishankar to discuss the close cooperation between the two countries, weapons sales and the upcoming signing of the framework for the new defense partnership.",
    "link": "https://www.globalsecurity.org/wmd/library/news/india/2025/india-250701-dodnews01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "US begins 'preliminary discussions' with Israel, Syria on security deal: Report",
    "description": "The administration of US President Donald Trump has reportedly begun preliminary talks with Israel and Syria to help them reach a potential security agreement, with Tel Aviv pressing for assurances that the negotiations ultimately lead to a full peace deal an…",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250701-presstv01.htm",
    "timestamp": "2025-07-02T09:23:01Z"
  },
  {
    "title": "From Name-Calling To Love-Bombing: Donald Trump Mocked For DeSantis Flip-Flop",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c1096e1e-51f7-47cf-abb8-b44835605482",
    "timestamp": "2025-07-02T09:22:57Z"
  },
  {
    "title": "From Name-Calling To Love-Bombing: Trump Mocked For DeSantis Flip-Flop",
    "description": "The president scored his relationship with Florida's governor and people had... thoughts.",
    "link": "https://www.huffpost.com/entry/donald-trump-ron-desantis-perfect-10_n_6864eeb6e4b019cf5d537a17",
    "timestamp": "2025-07-02T09:22:57Z"
  },
  {
    "title": "U.S. M2 Money Supply Hits Record High of Nearly $22T",
    "description": "Rising M2 tends to have a lagged effect on inflation, according to St. Louis Federal Reserve.",
    "link": "https://www.coindesk.com/markets/2025/07/02/u-s-m2-money-supply-hits-record-high-of-nearly-usd22t",
    "timestamp": "2025-07-02T09:22:51Z"
  },
  {
    "title": "Iran’s president orders country to suspend cooperation with UN nuclear watchdog IAEA",
    "description": "The order by President Masoud Pezeshkian included no timetables or details about what that suspension would entail.",
    "link": "https://nypost.com/2025/07/02/world-news/irans-president-orders-country-to-suspend-cooperation-with-un-nuclear-watchdog-iaea/",
    "timestamp": "2025-07-02T09:22:21Z"
  },
  {
    "title": "Paramount is going to pay $16 million to settle Trump lawsuit over ‘60 Minutes’ Kamala Harris interview",
    "description": "The case has been closely watched by advocates for press freedom and by journalists within CBS, whose lawyers called Trump’s lawsuit “completely without merit”",
    "link": "https://fortune.com/2025/07/02/paramount-pay-16-million-trump-lawsuit-60-minutes-kamala-harris-interview/",
    "timestamp": "2025-07-02T09:19:34Z"
  },
  {
    "title": "Japan Reacts to Trump Tariff Threat",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA senior Japanese official sidestepped U.S. President Donald Trump's warning that higher tariffs were coming for Tokyo because he did not see a trade deal happening, despite ongoing talks between the two count…",
    "link": "https://biztoc.com/x/84ff88bf8409565f",
    "timestamp": "2025-07-02T09:14:58Z"
  },
  {
    "title": "Congress, Don’t Expand The Low-Income Housing Tax Credit",
    "description": "By Ethan Xu & Richard Stern via The Daily Signal | June 30, 2025\nAs President Donald Trump aims to make America affordable again and cut costs for American families, special interests are concurrently working against the MAGA agenda by trying to add provision…",
    "link": "https://biztoc.com/x/b22dd6eedff2b605",
    "timestamp": "2025-07-02T09:14:46Z"
  },
  {
    "title": "Universities in the Crosshairs",
    "description": "US President Donald Trump’s primary justification for targeting America’s top universities has been their alleged failure to curb anti-Semitism. But his war on higher education more closely resembles past efforts to use universities to legitimize reactionary …",
    "link": "https://www.project-syndicate.org/commentary/trump-joins-long-line-of-political-leaders-targeting-universities-by-ngaire-woods-2025-07",
    "timestamp": "2025-07-02T09:14:36Z"
  },
  {
    "title": "Here’s Why The Supreme Court Striking Down Nationwide Injunctions Won’t End The Judicial Insurrection",
    "description": "By Tyler O'Neil, The Daily Signal | June 30, 2025\nThe Supreme Court case Trump v. CASA cut right to the heart of the judicial insurrection, the trend of district court judges siding with leftist activists to block President Donald Trump’s policies through nat…",
    "link": "https://biztoc.com/x/7309a5d19a8c9667",
    "timestamp": "2025-07-02T09:14:14Z"
  },
  {
    "title": "Pace of IDA-sponsored investment accelerates despite threat of US tariffs",
    "description": "IDA’s latest half-year report shows agency supported 179 investments in six months to June",
    "link": "https://www.irishtimes.com/business/2025/07/02/pace-of-ida-sponsored-investment-accelerates-despite-threat-of-us-tariffs/",
    "timestamp": "2025-07-02T09:10:54Z"
  },
  {
    "title": "Daughter of assassinated civil rights leader sees painful echoes of political violence in America",
    "description": "More than 60 years after a white supremacist assassinated civil rights leader Medgar Evers, his daughter still sees the same strain of political violence at work in American society.",
    "link": "https://www.nbcnews.com/news/us-news/daughter-assassinated-civil-rights-leader-sees-painful-echoes-politica-rcna216426",
    "timestamp": "2025-07-02T09:09:40Z"
  },
  {
    "title": "Japan Reacts to Trump Tariff Threat",
    "description": "Trump warned that no trade deal appeared in sight with Japan.",
    "link": "https://www.newsweek.com/japan-reacts-trump-tariff-threat-2093460",
    "timestamp": "2025-07-02T09:08:24Z"
  },
  {
    "title": "Gov. Healey estimates FY25 shelter spending will be slightly lower than initial projections",
    "description": "Gov. Maura Healey’s administration estimates the final tally for how much the state spent on emergency shelters over the last 12 months will come in slightly less than originally anticipated, but costs for the fiscal year that ended Monday are still on track …",
    "link": "https://www.bostonherald.com/2025/07/02/gov-healey-estimates-fy25-shelter-spending-will-be-slightly-lower-than-initial-projections/",
    "timestamp": "2025-07-02T09:07:17Z"
  },
  {
    "title": "Donald Trump Vowed 90 Deals in 90 Days. He's Only Made One",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWith only days remaining before the 90-day pause on President Donald Trump's Liberation Day tariffs expires, the administration has yet to unveil even a fraction of the trade deals that were promised at the ou…",
    "link": "https://biztoc.com/x/aff1148c904ce018",
    "timestamp": "2025-07-02T09:03:33Z"
  },
  {
    "title": "Nationalism Revisited and Reasserted — A Conversation with Yoram Hazony",
    "description": "The post Nationalism Revisited and Reasserted — A Conversation with Yoram Hazony appeared first on AlbertMohler.com.",
    "link": "https://albertmohler.com/2025/07/02/yoram-hazony-2/",
    "timestamp": "2025-07-02T09:00:48Z"
  },
  {
    "title": "Trump takes aim at CNN and New York Times over Iran strike coverage, but journalists are shrugging",
    "description": "President Trump has threatened legal action against CNN and The New York Times over their Iran strike reporting, but journalists say they're undeterred.",
    "link": "https://www.foxnews.com/media/trump-takes-aim-cnn-new-york-times-over-iran-strike-coverage-journalists-shrugging",
    "timestamp": "2025-07-02T09:00:43Z"
  },
  {
    "title": "The Black Americans Gentrifying Ghana",
    "description": "Attracted by tourist incentives and the novelty of living in a majority-Black country, Black Americans are coming to Ghana — and driving up the cost of living for everyone.",
    "link": "http://nymag.com/intelligencer/article/ghana-gentrification-cost-of-living-black-americans.html",
    "timestamp": "2025-07-02T09:00:42Z"
  },
  {
    "title": "Crypto Lender Nexo Sponsors Europe's Premier Golf Tour for Eight-Figure Sum",
    "description": "Nexo will become the tour's official digital asset and wealth partner through 2027.",
    "link": "https://www.coindesk.com/business/2025/07/02/crypto-lender-nexo-sponsors-europes-premier-golf-tour-for-eight-figure-sum",
    "timestamp": "2025-07-02T09:00:41Z"
  },
  {
    "title": "Alaska’s oil reserves are America’s national security shield",
    "description": "Alaska's abundant energy reserves could strengthen American security amid Middle East tensions and Ukraine conflict, with a Supreme Court ruling expediting resource development.",
    "link": "https://www.foxnews.com/opinion/alaskas-oil-reserves-americas-national-security-shield",
    "timestamp": "2025-07-02T09:00:15Z"
  },
  {
    "title": "Donald Trump Vowed 90 Deals in 90 Days. He's Only Made One",
    "description": "Trump has days left to unveil dozens of trade deals, or risk breaking promises made when he paused reciprocal tariffs.",
    "link": "https://www.newsweek.com/donald-trump-struggling-make-deals-tariffs-2092547",
    "timestamp": "2025-07-02T09:00:02Z"
  },
  {
    "title": "Colombian Ambassador: When Alliances Matter Most, Look South: Colombia and the US—Partners Against Transnational Crime | Opinion",
    "description": "U.S. cooperation has been instrumental in strengthening Colombia's security forces, law enforcement, and justice institutions. Colombia, in turn, has made the United States stronger, safer, and more secure.",
    "link": "https://www.newsweek.com/colombian-ambassador-when-alliances-matter-most-look-south-colombia-uspartners-against-2093218",
    "timestamp": "2025-07-02T09:00:02Z"
  },
  {
    "title": "GOP Plan Would Allow Larger Tax-Free Wealth Transfers",
    "description": "If passed, the GOP measure would solidify the estate tax's long, ongoing retreat.",
    "link": "https://www.newsweek.com/gop-budget-plan-larger-tax-free-wealth-transfers-estate-tax-2091433",
    "timestamp": "2025-07-02T09:00:01Z"
  },
  {
    "title": "Chi Ossé Is Tired of the Same Old Nonsense",
    "description": "Andrew Sciallo\n\n\n\nFrom Kirsten Gillibrand (“she should resign”) to Eric Adams (“a power-hungry, egotistical man”) to the Democratic establishment, NYC’s Gen-Z political star doesn’t hold back.\r\n\n\r\n\n\nThe post Chi Ossé Is Tired of the Same Old Nonsense appeared…",
    "link": "https://www.thenation.com/?post_type=article&p=562146",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "Fox News, MAGA hats and cookies: Inside Trump's West Wing",
    "description": "Trump likes to see whom he wants and call whom he chooses, and in the new term, he presides over a White House that mirrors the man, current and former aides say.",
    "link": "https://www.nbcnews.com/politics/donald-trump/fox-news-maga-hats-cookies-trump-west-wing-rcna214754",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "5 ways Trump's tax bill will limit health care access",
    "description": "With spending cuts poised to hit medical providers, Medicaid recipients and Affordable Care Act enrollees, here's how the bill will affect health care access for millions in the U.S.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/07/02/nx-s1-5453870/senate-republicans-tax-bill-medicaid-health-care",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "‘MAHA Report’ Calls for Fighting Chronic Disease, but Trump and Kennedy Have Yanked Funding",
    "description": "Scientists and public health advocates see disconnects between what the Trump administration says about health — notably, in its “MAHA Report” — and what it’s actually doing.",
    "link": "https://kffhealthnews.org/news/article/maha-make-america-healthy-again-report-chronic-disease-rfk-trump-funding-cuts/",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "Republican Megabill Will Mean Higher Health Costs for Many Americans",
    "description": "Spending cuts hitting medical providers, Medicaid and Affordable Care Act enrollees, and lawfully present immigrants are just some of the biggest changes the GOP has in store for health care — with ramifications that could touch all Americans.",
    "link": "https://kffhealthnews.org/news/article/one-big-beautiful-bill-medicaid-work-requirements-affordable-care-act-immigrants/",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "The Republican Budget Reconciliation Bill Is Awful. Just Ask Republicans",
    "description": "Senate Republicans passed their version of the One Big Beautiful Bill after telling us how ugly it is.  \nThe post The Republican Budget Reconciliation Bill Is Awful. Just Ask Republicans appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/02/the-republican-budget-reconciliation-bill-is-awful-just-ask-republicans/",
    "timestamp": "2025-07-02T09:00:00Z"
  },
  {
    "title": "Trump-Musk Feud: Musk Says Trump’s Comments About Him Are ‘Just Plain Wrong’",
    "description": "The billionaire, whose ties with the president have frayed in the past month, attacked GOP lawmakers backing the Trump’s spending bill while boosting its critics.",
    "link": "https://www.forbes.com/sites/siladityaray/2025/07/02/trump-musk-feud-musk-says-trumps-comments-about-him-are-just-plain-wrong/",
    "timestamp": "2025-07-02T08:58:40Z"
  },
  {
    "title": "Public Companies Buy More Bitcoin Than ETFs for Third Consecutive Quarter",
    "description": "Corporate treasuries are turning to bitcoin for strategic growth that outpaces traditional investment vehicles.",
    "link": "https://www.coindesk.com/markets/2025/07/02/public-companies-buy-more-bitcoin-than-etfs-for-third-consecutive-quarter",
    "timestamp": "2025-07-02T08:48:29Z"
  },
  {
    "title": "Paramount to pay over €13m in settlement with Trump over Kamala Harris interview",
    "description": "US media group Paramount has agreed to pay 16 million dollars (€13.5 million) to settle a lawsuit filed by Donald Trump over the editing of an interview with then-vice president Kamala Harris.",
    "link": "https://www.independent.ie/world-news/north-america/paramount-to-pay-over-13m-in-settlement-with-trump-over-kamala-harris-interview/a2099888572.html",
    "timestamp": "2025-07-02T08:46:29Z"
  },
  {
    "title": "Dutch Queen Reveals What She Really Said During That Viral Trump Moment",
    "description": "The footage spread rapidly across social media last month.",
    "link": "https://www.huffpost.com/entry/queen-máxima-trump-video_n_6864d261e4b019cf5d536735",
    "timestamp": "2025-07-02T08:45:40Z"
  },
  {
    "title": "Visa, Mastercard race to battle $253 billion threat posed by stablecoin: Report",
    "description": "Tech firms and crypto start-ups are moving in on territory long dominated by Visa Inc. and Mastercard Inc., powered by a new type of currency — the stablecoin",
    "link": "https://www.livemint.com/money/personal-finance/visa-mastercard-race-to-battle-253-billion-threat-posed-by-stablecoin-report-11751443197078.html",
    "timestamp": "2025-07-02T08:42:42Z"
  },
  {
    "title": "Air Canada drops winter flights to US tourist destination",
    "description": "No flying south this winter.",
    "link": "https://nypost.com/2025/07/02/lifestyle/air-canada-drops-winter-route-between-toronto-and-jacksonville-florida/",
    "timestamp": "2025-07-02T08:42:23Z"
  },
  {
    "title": "Weeks after showing off his nukes, Macron speaks to Putin in 3 years to discuss Middle East, Russia-Ukraine ceasefire",
    "description": "Emmanuel Macron and Vladimir Putin spoke on the phone after a long gap of nearly three years. They discussed the Middle East tensions due to the Israel-Iran conflict. A Russia-Ukraine ceasefire was also on the agenda. Macron urged for peace in Ukraine, but Pu…",
    "link": "https://economictimes.indiatimes.com/news/international/us/weeks-after-showing-off-his-nukes-macron-speaks-to-putin-in-3-years-to-discuss-middle-east-russia-ukraine-ceasefire/articleshow/122201652.cms",
    "timestamp": "2025-07-02T08:40:48Z"
  },
  {
    "title": "University bans transgender swimmer Lia Thomas and strips her of titles",
    "description": "Lia Thomas, a champion swimmer, has been banned and had her titles revoked by her old university",
    "link": "https://www.ladbible.com/news/us-news/lia-thomas-transgender-swimmer-ban-sport-university-759254-20250702",
    "timestamp": "2025-07-02T08:36:37Z"
  },
  {
    "title": "Michael Steele Issues Ominous Alert For ALL Republicans: ‘Trust Me, Baby’",
    "description": "“I mean, come on, guys. I don’t know what people expect here,\" said the former RNC chair.",
    "link": "https://www.huffpost.com/entry/michael-steele-donald-trump-warning_n_6864e3f3e4b01e8bcb421637",
    "timestamp": "2025-07-02T08:29:32Z"
  },
  {
    "title": "Explained: Trump and Musk feud rekindles; what has happened so far?",
    "description": "U.S. President Trump reignites his feud with Elon Musk, accusing him of subsidy reliance and threatening to cut Tesla and SpaceX support. Musk fires back over Trump’s bill targeting EV tax credits. Here’s the full story.",
    "link": "https://www.thehindubusinessline.com/multimedia/video/explained-trump-and-musk-feud-rekindles-what-has-happened-so-far/article69763449.ece",
    "timestamp": "2025-07-02T08:23:42Z"
  },
  {
    "title": "Trump’s massive domestic policy bill put to stress test in the House | CNN Politics",
    "description": "The influence of President Donald Trump and Speaker Mike Johnson will once again be put to the test Wednesday, as GOP leaders look to deliver the president his first legislative win by the July Fourth holiday.",
    "link": "https://www.cnn.com/2025/07/02/politics/trumps-agenda-house-vote",
    "timestamp": "2025-07-02T08:19:20Z"
  },
  {
    "title": "One step forward, two steps back: The illusion of a Russian-American thaw",
    "description": "Trump’s decision to ease sanctions on Gazprombank is a short-term transaction, not a sign of broader normalization Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620862-gazprombank-sanctions-russia-us-thaw/",
    "timestamp": "2025-07-02T08:13:16Z"
  },
  {
    "title": "Iran’s president reportedly suspends cooperation with U.N. nuclear watchdog",
    "description": "The move follows a law passed by Iran’s parliament last week, after American airstrikes hit Iran's most-important nuclear facilities.",
    "link": "https://www.nbcnews.com/world/iran/irans-president-reportedly-suspends-cooperation-un-nuclear-watchdog-rcna216424",
    "timestamp": "2025-07-02T08:12:10Z"
  },
  {
    "title": "Hamas says it's ready for a ceasefire but it must put an an end to the war in Gaza",
    "description": "Hamas considers a ceasefire with Israel. This follows a proposal supported by the U.S. President Donald Trump. Hamas insists on ending the Gaza war. A Hamas official expresses readiness for an agreement. They are willing to accept initiatives ending the war. …",
    "link": "https://economictimes.indiatimes.com/news/defence/hamas-says-its-ready-for-a-ceasefire-but-it-must-put-an-an-end-to-the-war-in-gaza/articleshow/122201112.cms",
    "timestamp": "2025-07-02T08:11:41Z"
  },
  {
    "title": "Critics Snap At White House's Latest Wild Image Of Trump",
    "description": "The AI-generated picture was slammed as \"shameful.\"",
    "link": "https://www.huffpost.com/entry/white-house-alligator-alcatraz-trump_n_6864dd84e4b01e8bcb4211b2",
    "timestamp": "2025-07-02T08:04:51Z"
  },
  {
    "title": "US halts some weapons shipments to Ukraine",
    "description": "Missiles for Patriot air defence systems and Hellfire missiles are among items being held back, according to US media.",
    "link": "https://www.aljazeera.com/news/2025/7/2/us-halts-some-weapons-shipments-to-ukraine",
    "timestamp": "2025-07-02T08:03:20Z"
  },
  {
    "title": "European shares rise; investors await signs on trade progress",
    "description": "European shares nudged higher on Wednesday, led by industrial miners, while investors tracked signs of any progress on U.S. trade talks as the July tariff deadline nears.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-investors-await-signs-on-trade-progress/articleshow/122200977.cms",
    "timestamp": "2025-07-02T08:03:16Z"
  },
  {
    "title": "Gaza Rescuers Say Israeli Strikes Kill 14 As Trump Teases Ceasefire Push",
    "description": "Gaza's civil defence agency said that Israeli strikes killed at least 14 people on Wednesday, as US President Donald Trump urged Palestinian group Hamas to agree to a 60-day ceasefire.",
    "link": "https://www.ibtimes.com/gaza-rescuers-say-israeli-strikes-kill-14-trump-teases-ceasefire-push-3777444",
    "timestamp": "2025-07-02T08:03:07Z"
  },
  {
    "title": "With 'And Just Like That' and 'Gilded Age,' Cynthia Nixon Dominates HBO Max",
    "description": "\"It is wonderful to take a character that you think you know who she is, and then put her in these situations that she never dreamed of,\" Cynthia Nixon tells Newsweek.",
    "link": "https://www.newsweek.com/2025/07/18/cynthia-nixon-just-like-that-gilded-age-2093290.html",
    "timestamp": "2025-07-02T08:00:01Z"
  },
  {
    "title": "The 9 at 9: Wednesday",
    "description": "Here’s all the news you need to know as you start the day.",
    "link": "https://www.thejournal.ie/9-at-9-02-07-25-6749813-Jul2025/",
    "timestamp": "2025-07-02T08:00:00Z"
  },
  {
    "title": "Trump says Israel agrees terms for ceasefire, urges Hamas to accept",
    "description": "President Donald Trump says Israel has accepted a 60-day Gaza ceasefire deal, but he gave no details of the plan.",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/7/2/trump-says-israel-agrees-terms-for-ceasefire-urges-hamas-to-accept",
    "timestamp": "2025-07-02T07:58:36Z"
  },
  {
    "title": "‘Spoiled’ Japan may not get a US trade deal, Trump warns",
    "description": "US President Donald Trump cast doubt on reaching a trade deal with Japan, a day after threatening higher tariffs on Japanese exports to the United States, claiming the country won’t buy American rice.",
    "link": "https://www.cnn.com/2025/07/02/business/trump-japan-trade-deal-intl-hnk",
    "timestamp": "2025-07-02T07:57:15Z"
  },
  {
    "title": "Weaker US dollar creates additional hurdle for exporters",
    "description": "The US dollar has continued to weaken against the euro this week, presenting extra challenges for exporting firms.",
    "link": "https://www.rte.ie/news/business/2025/0702/1521412-us-dollar-exports/",
    "timestamp": "2025-07-02T07:57:12Z"
  },
  {
    "title": "Zohran Mamdani Responds to Donald Trump Deportation Threat",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nZohran Mamdani, the Democratic nominee for New York mayor, has hit back at President Donald Trump's threats to have him deported.\n\"The President of the United States just threatened to have me arrested, stripp…",
    "link": "https://biztoc.com/x/a246611395eccc8b",
    "timestamp": "2025-07-02T07:57:03Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over '60 Minutes' interview",
    "description": "The fallout from Paramount's decision to settle a lawsuit by President Donald Trump over the editing of a CBS’ “60 Minutes” interview seems certain to linger.",
    "link": "https://www.ksat.com/business/2025/07/02/paramount-to-pay-16-million-in-settlement-with-trump-over-60-minutes-interview/",
    "timestamp": "2025-07-02T07:56:16Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over '60 Minutes' interview",
    "description": "The fallout from Paramount's decision to settle a lawsuit by President Donald Trump over the editing of a CBS’ “60 Minutes” interview seems certain to linger.",
    "link": "https://www.local10.com/business/2025/07/02/paramount-to-pay-16-million-in-settlement-with-trump-over-60-minutes-interview/",
    "timestamp": "2025-07-02T07:55:41Z"
  },
  {
    "title": "Zohran Mamdani Responds to Donald Trump Deportation Threat",
    "description": "Zohran Mamdani has said that President Donald Trump's threats against him represent an \"attack on our democracy.\"",
    "link": "https://www.newsweek.com/zohran-mamdani-responds-donald-trump-deportation-threat-2093415",
    "timestamp": "2025-07-02T07:54:06Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over '60 Minutes' interview",
    "description": "Paramount says it has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October.",
    "link": "https://www.clickondetroit.com/business/2025/07/02/paramount-to-pay-16-million-in-settlement-with-trump-over-60-minutes-interview/",
    "timestamp": "2025-07-02T07:53:28Z"
  },
  {
    "title": "Zohran Mamdani responds to Trump deportation threat amid ICE policy dispute",
    "description": "New York mayoral nominee Zohran Mamdani responded to a threat from President Donald Trump, who said Mamdani could face deportation over noncooperation with ICE. Mamdani denounced the statement as intimidation. The controversy highlights a growing political cl…",
    "link": "https://economictimes.indiatimes.com/news/international/us/zohran-mamdani-responds-to-trump-deportation-threat-amid-ice-policy-dispute/articleshow/122200700.cms",
    "timestamp": "2025-07-02T07:53:25Z"
  },
  {
    "title": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states say",
    "description": "'Not only cruel, it is illegal': Trump admin unlawfully slashed over $1B in youth mental health funding, breached grant agreements and violated federal regulations, states saynewsbreak.com",
    "link": "https://www.newsbreak.com/share/4084526627780-not-only-cruel-it-is-illegal-trump-admin-unlawfully-slashed-over-1b-in-youth-mental-health-funding-breached-grant-agreements-and-violated-federal-regulations-states-say?_f=app_share&amp;pd=0L8YHCfs&amp;lang=en_US&amp;send_time=1751442644&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.26.0.30%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_recall_exp_25q3-v8%2Cns_foryou_blend_exp_25q2-v4&amp;s=i2",
    "timestamp": "2025-07-02T07:51:29Z"
  },
  {
    "title": "House begins work on Trump megabill, Johnson says vote could come Wednesday",
    "description": "After a nail-biter vote in the Senate, the House took up President Donald Trump's tax and immigration megabill with a vote possible as early as Wednesday.",
    "link": "https://abcnews.go.com/US/house-begins-work-trump-megabill-johnson-vote-wednesday/story?id=123400942",
    "timestamp": "2025-07-02T07:48:23Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over ’60 Minutes’ interview",
    "description": "In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “60 Minutes” interview with then-Vice President Kamala Harris in October. Paramount told media o…",
    "link": "https://financialpost.com/pmn/paramount-to-pay-16-million-in-settlement-with-trump-over-60-minutes-interview",
    "timestamp": "2025-07-02T07:44:49Z"
  },
  {
    "title": "Tánaiste to discuss Gaza truce efforts with Qatari PM",
    "description": "The Tánaiste and Minister for Foreign Affairs is due to hold a meeting with the Prime Minister of Qatar in Dublin in which they will discuss efforts to secure a ceasefire in the Gaza conflict.",
    "link": "https://www.rte.ie/news/ireland/2025/0702/1521403-ireland-middle-east/",
    "timestamp": "2025-07-02T07:42:36Z"
  },
  {
    "title": "Trump threatens New York mayoral frontrunner with arrest",
    "description": "The US president has warned that he will be watching “communist” Zohran Mamdani very carefully Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620868-trump-mamdani-us-communist/",
    "timestamp": "2025-07-02T07:42:03Z"
  },
  {
    "title": "23 greatest movie endings of all time, ranked",
    "description": "Final scenes are incredibly tough to pull off – and they can make or break the viewing experience. Jacob Stolworthy and Louis Chilton pick 23 of the greatest movie denouements in cinema history",
    "link": "https://www.the-independent.com/arts-entertainment/films/features/movie-endings-best-films-list-b2780943.html",
    "timestamp": "2025-07-02T07:41:40Z"
  },
  {
    "title": "Paramount to pay $16 million in settlement with Trump over ’60 Minutes’ interview",
    "description": "By The Associated Press In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “ 60 Minutes” interview with then-Vice President Kamala Harris in Octobe…",
    "link": "https://www.bostonherald.com/2025/07/02/paramount-to-pay-16-million-in-settlement-with-trump-over-60-minutes-interview/",
    "timestamp": "2025-07-02T07:38:52Z"
  },
  {
    "title": "Paramount will pay $16 million in settlement with Trump over ’60 Minutes’ interview",
    "description": "By The Associated Press In a case seen as a challenge to free speech, Paramount has agreed to pay $16 million to settle a lawsuit filed by President Donald Trump over the editing of CBS’ “ 60 Minutes” interview with then-Vice President Kamala Harris in Octobe…",
    "link": "https://www.bostonherald.com/2025/07/02/paramount-will-pay-16-million-in-settlement-with-trump-over-60-minutes-interview/",
    "timestamp": "2025-07-02T07:38:52Z"
  },
  {
    "title": "Paramount Agrees to $16 Million Settlement in Trump Lawsuit",
    "description": "Paramount will settle President Trump's lawsuit against CBS and has agreed to pay $16 million over an edited interview.",
    "link": "https://www.breitbart.com/entertainment/2025/07/02/paramount-agrees-to-16-million-settlement-in-trump-lawsuit-against-cbs/",
    "timestamp": "2025-07-02T07:36:53Z"
  },
  {
    "title": "Elon Musk Eases Feud With Trump: 'Credit Where Credit Is Due'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk has appeared to ease his feud with President Donald Trump after praising his foreign policy achievements.\nThe CEO of Tesla and SpaceX said Trump should get \"credit where credit is due,\" after the Whi…",
    "link": "https://biztoc.com/x/e6b3376f9ce36d89",
    "timestamp": "2025-07-02T07:35:07Z"
  },
  {
    "title": "Iran Ready to Enrich Uranium Up to Bomb-Grade Levels: \"We Can Do That\"",
    "description": "Iran says its nuclear program is for peaceful purposes but has hardened its stance on enrichment following attacks",
    "link": "https://www.newsweek.com/iran-ready-enrich-uranium-bomb-grade-levels-we-can-do-that-2093390",
    "timestamp": "2025-07-02T07:34:50Z"
  },
  {
    "title": "Japan's Nikkei edges lower as tariff stalemate weighs",
    "description": "Japanese shares fell slightly on Wednesday, reacting to a selloff in U.S. technology heavyweights and uncertainty about trade tariffs, with the prospect of Fed interest rate cuts providing markets a floor.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-edges-lower-as-tariff-stalemate-weighs/articleshow/122200413.cms",
    "timestamp": "2025-07-02T07:34:31Z"
  },
  {
    "title": "US halts some weapons shipments to Ukraine, White House says",
    "description": "US is concerned about low stockpiles for its own needs, as Russia intensifies the war in Ukraine.",
    "link": "https://www.bbc.com/news/articles/cgk33k204ddo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-07-02T07:34:09Z"
  }
]