[
  {
    "title": "Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "description": "KYIV/RIYADH: Ukrainian and US delegations discussed on Sunday (Mar 23) proposals to protect energy facilities and critical infrastructure, Ukraine's defence minister said, part of a diplomatic pus",
    "link": "https://www.channelnewsasia.com/world/ukraine-us-teams-hold-talks-saudi-arabia-us-envoy-hopeful-ending-war-5019366",
    "timestamp": "2025-03-23T20:46:30Z"
  },
  {
    "title": "Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "description": "KYIV: Ukrainian and US delegations discussed on Sunday (Mar 23) proposals to protect energy facilities and critical infrastructure, Ukraine's defence minister said, part of a diplomatic push",
    "link": "https://www.channelnewsasia.com/world/ukraine-us-talks-saudi-arabia-hopeful-ending-war-5019366",
    "timestamp": "2025-03-23T20:46:00Z"
  },
  {
    "title": "Former Federal Prosecutor Jessica Aber Dead At Age 43",
    "description": "The medical examiner has not determined the cause of death.",
    "link": "https://www.huffpost.com/entry/former-federal-prosecutor-jessica-aber-dead_n_67e068c9e4b0dbd2dbaf97d9",
    "timestamp": "2025-03-23T20:45:38Z"
  },
  {
    "title": "US miners eye copper comeback as demand rises",
    "description": "Herriman, UTAH – The demand for copper in the U.S. is set to double in the next 10 years – but the nation lacks the production to meet that demand unless steps are taken to ease restrictions on new mines. \nPresident Donald Trump hopes to change this after sig…",
    "link": "https://biztoc.com/x/c802e95a3417005d",
    "timestamp": "2025-03-23T20:44:19Z"
  },
  {
    "title": "Canadian PM Mark Carney calls for snap elections ‘to deal with’ Trump",
    "description": "Mark Carney, the recently appointed prime minister of Canada, called for snap federal elections Sunday to bolster his government's mandate in responding to...",
    "link": "https://www.upi.com/Top_News/World-News/2025/03/23/canada-mark-carney-calls-snap-elections-trump/2901742755530/",
    "timestamp": "2025-03-23T20:43:33Z"
  },
  {
    "title": "Snap election in Canada",
    "description": "It’s on: Prime Minister Mark Carney called a snap election on Sunday, saying he needs a mandate from Canadians to take on U.S. President Donald Trump. The federal campaign kicks off days ahead of a new slate of Trump tariffs, and at a time when Canadians are …",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/03/snap-election-in-canada",
    "timestamp": "2025-03-23T20:39:44Z"
  },
  {
    "title": "Second lady Usha Vance will visit Greenland and see its national dogsled race as Trump talks up US takeover",
    "description": "Second lady Usha Vance plans a trip to Greenland, the self-governing, mineral-rich territory of American ally Denmark that President Donald Trump has suggested the United States should take control over.\nVance will leave on Thursday and return Saturday, accor…",
    "link": "https://biztoc.com/x/7a1a1ce49e41d484",
    "timestamp": "2025-03-23T20:33:00Z"
  },
  {
    "title": "How did former U.S. Attorney Jessica Aber, who resigned from her high-profile role on the day Donald Trump was sworn in, die? Mystery surrounds as police investigate",
    "description": "Jessica Aber's cause of death, which will be declared by Virginia medical examiner, is yet to be ascertained.",
    "link": "https://economictimes.indiatimes.com/news/international/us/how-did-former-u-s-attorney-jessica-aber-who-resigned-from-her-high-profile-role-on-the-day-donald-trump-was-sworn-in-die-mystery-surrounds-as-police-investigate/articleshow/119391482.cms",
    "timestamp": "2025-03-23T20:31:56Z"
  },
  {
    "title": "Jeanne Shaheen says Trump is 'being manipulated' by Putin | CloseUp",
    "description": "On CloseUp, Sen. Jeanne Shaheen said, \" I think [President Donald Trump] is being manipulated by Vladimir Putin because he's already given away much of the leverage that we had over Russia before these negotiations got very far.\"",
    "link": "https://www.wmur.com/article/closeup-jeanne-shaheen-president-trump-putin-manipulated/64264770",
    "timestamp": "2025-03-23T20:28:50Z"
  },
  {
    "title": "This election is about Donald Trump — and a lot more",
    "description": "One way or another, these 36 days will be about beginning to answer the myriad questions currently and to be posed by a changed and changing world — not least the question of who should lead the country at this unnerving moment.",
    "link": "https://www.cbc.ca/news/politics/election-federal-carney-poilievre-trump-analysis-1.7491076",
    "timestamp": "2025-03-23T20:26:49Z"
  },
  {
    "title": "‘They’re all butt-hurt’: Tim Walz admits ‘unhealthy’ Musk obsession, regrets joke about Tesla stock, then rants anyway",
    "description": "'If I'm the richest man in the world, I'm, like, out on the street handing out the money and be fun as hell just to help people out'",
    "link": "https://www.wnd.com/2025/03/theyre-all-butt-hurt-tim-walz-admits-unhealthy-musk-obsession-regrets-joke-about-tesla-stock-then-rants-anyway/",
    "timestamp": "2025-03-23T20:26:05Z"
  },
  {
    "title": "The Irish Times view on the threat of Trump’s tariffs: Ireland prepares for the unknown",
    "description": "The US president has promised significant tariffs, but much remains unclear about what will happen",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/03/23/the-irish-times-view-on-the-threat-of-trumps-tariffs-ireland-prepares-for-the-unknown/",
    "timestamp": "2025-03-23T20:24:00Z"
  },
  {
    "title": "Rand Paul avoids supporting Trump use of the Alien Enemies Act",
    "description": "Kentucky Republican Sen. Rand Paul isn’t fully endorsing President Donald Trump’s recent use of the rarely used Alien Enemies Act to deport a group of Venezuelan nationals accused of gang ties, warning that the move raises “big legal questions.” “The Bill of …",
    "link": "https://freerepublic.com/focus/f-news/4306280/posts",
    "timestamp": "2025-03-23T20:18:06Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" March 23, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, National Security Adviser Mike Waltz and Rep. Rand Paul join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-03-23-2025/",
    "timestamp": "2025-03-23T20:16:49Z"
  },
  {
    "title": "Wisconsin Supreme Court hopeful receives big endorsement from NFL legend",
    "description": "Former Green Bay Packers star Brett Favre made an endorsement in the race for a seat on the Wisconsin Supreme Court. He put his support behind Brad Schimel.",
    "link": "https://www.foxnews.com/sports/wisconsin-supreme-court-hopeful-receives-big-endorsement-from-nfl-legend",
    "timestamp": "2025-03-23T20:11:22Z"
  },
  {
    "title": "WATCH: Network asks Schumer point blank: Are you making same mistake Biden did?",
    "description": "'I've had conversations with Democrats who says this moment feels similar'",
    "link": "https://www.wnd.com/2025/03/watch-network-asks-schumer-point-blank-are-you-making-same-mistake-biden-did/",
    "timestamp": "2025-03-23T20:07:44Z"
  },
  {
    "title": "Trump’s Presidency And Student Loans: What Move To Small Business Administration Means For Borrowers",
    "description": "Borrowers' loans will not be affected by the move to the Small Business Administration, but the transition may be rocky.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/03/23/trumps-presidency-and-student-loans-what-move-to-small-business-administration-means-for-borrowers/",
    "timestamp": "2025-03-23T20:06:55Z"
  },
  {
    "title": "Announcements aplenty as budget week begins",
    "description": "This week it's all about tomorrow's federal budget: Labor is still 'holding all the big levers', with the Coalition struggling to know where to direct its focus.\nThe post Announcements aplenty as budget week begins appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/03/24/2025-federal-budget-jim-chalmers-labor-coalition-cuts-spending/",
    "timestamp": "2025-03-23T20:03:26Z"
  },
  {
    "title": "Michelle Obama Says She Was Shocked That People Hated Her School Lunch Program — Claims it Was Because of Partisanship",
    "description": "In a candid podcast interview, Michelle Obama reflects on the backlash against her school lunch program, attributing its unpopularity to partisanship rather than its nutritional shortcomings. Her insights reveal the complexities of policy-making in a polarize…",
    "link": "https://www.thegatewaypundit.com/2025/03/michelle-obama-says-she-was-shocked-that-people/",
    "timestamp": "2025-03-23T20:00:49Z"
  },
  {
    "title": "Rosie O’Donnell Questions ‘Why’ Donald Trump Won Every Swing State Considering He Is ‘Best Friends’ With a ‘Man Who Owns and Runs the Internet’: ‘I Would Hope that Would be Investigated’",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_6c5348a6-0286-4d23-9670-3702cd193664",
    "timestamp": "2025-03-23T20:00:46Z"
  },
  {
    "title": "Rosie O’Donnell Questions ‘Why’ Donald Trump Won Every Swing State Considering He Is ‘Best Friends’ With a ‘Man Who Owns and Runs the Internet’: ‘I Would Hope that Would be Investigated’",
    "description": "Rosie O’Donnell is questioning how Donald Trump won every swing state in the 2024 presidential election considering his biggest supporter. During an interview with RTÉ One’s “The Late Late Show,” O’Donnell said she questions “why” Trump “won every single swin…",
    "link": "https://variety.com/2025/tv/news/rosie-odonnell-questions-donald-trump-elon-musk-1236345948/",
    "timestamp": "2025-03-23T20:00:46Z"
  },
  {
    "title": "Solana has become a breeding ground for pump and dump memecoin ‘cabals’: Bloomberg",
    "description": "The memecoin craze that started off two years ago on the Solana blockchain appeared to be organic. However, since then, the blockchain has drawn high-profile individuals, including U.S. President Donald Trump and his wife, Melania Trump, as well as Argentina …",
    "link": "https://cryptoslate.com/solana-has-become-a-breeding-ground-for-pump-and-dump-memecoin-cabals-bloomberg/",
    "timestamp": "2025-03-23T20:00:30Z"
  },
  {
    "title": "Trump keeps insisting markets and the economy are fine. He could be making the same mistake as Biden",
    "description": "Trump's economic policies have sparked recession fears and a drop in the stock market.\n- The S&P 500's recent correction reflects investor concerns over Trump's policies.\n- With the 2026 midterms not far off, Trump risks political damage by ignoring the worse…",
    "link": "https://biztoc.com/x/7c169238fc3111f8",
    "timestamp": "2025-03-23T19:59:32Z"
  },
  {
    "title": "President Trump Positions U.S. as Global Superpower in Manufacturing",
    "description": "Nvidia, the world’s undisputed leader in chipmaking, says it will invest hundreds of billions of dollars over the next four years on its U.S.-based manufacturing operations — part of the manufacturing renaissance under President Donald J. Trump as he solidifi…",
    "link": "https://freerepublic.com/focus/f-news/4306274/posts",
    "timestamp": "2025-03-23T19:59:06Z"
  },
  {
    "title": "Ukraine, US teams hold talks in Saudi Arabia, US envoy hopeful on ending war",
    "description": "Ukrainian and US delegations discuss energy security as Trump pushes for a ceasefire, with talks in Saudi Arabia aiming to end the Ukraine-Russia war.",
    "link": "https://www.jpost.com/international/article-847305",
    "timestamp": "2025-03-23T19:57:08Z"
  },
  {
    "title": "Elon Musk's Soap Operas for Conspiracy Buffs (Renée DiResta/The Atlantic)",
    "description": "Renée DiResta / The Atlantic:\nElon Musk's Soap Operas for Conspiracy Buffs  —  Online fantasies are now an excuse to take apart the government.  —  ever since he bought Twitter in 2022, Elon Musk has been titillating his fans with wild conspiracy theories fro…",
    "link": "https://www.memeorandum.com/250323/p40",
    "timestamp": "2025-03-23T19:55:00Z"
  },
  {
    "title": "Attorney General Pam Bondi says Supreme Court could get involved in Alien Enemies Act case",
    "description": "Attorney General Pam Bondi criticized judges who have struck down or paused portions of Trump’s agenda and said the Supreme Court will ultimately hear the Alien Enemies Act case.",
    "link": "https://www.nbcnews.com/politics/justice-department/attorney-general-supreme-court-involved-alien-enemies-act-case-rcna197682",
    "timestamp": "2025-03-23T19:52:29Z"
  },
  {
    "title": "‘Ignoring The Law Altogether’: Tom Homan Swats Down Worries About ‘Due Process’ For Deported Gang Members",
    "description": "Border czar Tom Homan clashed with Jonathan Karl over the Trump administration’s efforts to deport members of the Venezuelan gang Tren de Aragua (TdA).",
    "link": "https://dailycaller.com/2025/03/23/ignoring-the-law-altogether-tom-homan-swats-down-worries-about-due-process-for-deported-gang-members/",
    "timestamp": "2025-03-23T19:48:52Z"
  },
  {
    "title": "New Jersey Police Officer Wears Palestinian Flag — Not American Flag",
    "description": "Pamela Geller is reporting an American police officer in Paterson, NJ, was wearing a Palestinian flag on his uniform instead of an American flag while on the job",
    "link": "https://freerepublic.com/focus/f-news/4306270/posts",
    "timestamp": "2025-03-23T19:47:10Z"
  },
  {
    "title": "Perplexity Proposes Open-Source Version of TikTok Algorithm",
    "description": "TikTok’s owner ByteDance has less than two weeks to sell the social media platform. Now, artificial intelligence (AI) search engine firm Perplexity is making the case for why it should become the popular video-sharing service’s new owner, following weeks of r…",
    "link": "https://www.pymnts.com/news/social-commerce/2025/perplexity-proposes-open-source-version-of-tiktok-algorithm/",
    "timestamp": "2025-03-23T19:46:28Z"
  },
  {
    "title": "Why does this Chuck Schumer interview sound like a threat to Republicans? \"Either change their vote or face the consequences\"",
    "description": "Those freedom-loving Democrats are at it again. Senate Minority Leader Chuck Schumer is facing allegations that he has been coordinating with far-left activist groups to generate unrest and stage protests against Republicans. In an appearance on PBS, Schumer …",
    "link": "https://freerepublic.com/focus/f-bloggers/4306269/posts",
    "timestamp": "2025-03-23T19:46:25Z"
  },
  {
    "title": "US education secretary praises Columbia's reforms to unlock $400 million",
    "description": "Columbia University enacts reforms to regain $400M in federal funding after the Trump administration cited concerns over antisemitism on campus.",
    "link": "https://www.jpost.com/american-politics/article-847303",
    "timestamp": "2025-03-23T19:45:35Z"
  },
  {
    "title": "'Illiterate understanding': Trump gets brutal fact check about judge who ruled against him",
    "description": "Donald Trump on Sunday shared a report from a far-right influencer about a judge who recently ruled against the President, but they soon got fact-checked by a reporter.\n\nTrump has recently had Judge James Boasberg in his crosshairs after the jurist ordered Tr…",
    "link": "https://www.rawstory.com/trump-fact-check-illiterate-judge/",
    "timestamp": "2025-03-23T19:45:24Z"
  },
  {
    "title": "One of the last surviving Tuskegee Airmen remembers struggle for recognition amid Trump’s DEI purge",
    "description": "“I thought there was progress in that area, but evidently there isn’t,” said Col. James H. Harvey III, who blamed Trump for contributing to what he sees as worsening prejudice in the U.S.",
    "link": "https://www.denverpost.com/2025/03/23/james-harvey-tuskegee-airmen-recognition-struggle/",
    "timestamp": "2025-03-23T19:45:07Z"
  },
  {
    "title": "Trump now broadens campaign of retaliation against lawyers",
    "description": "US News: WASHINGTON: President Donald Trump broadened his campaign of retaliation against lawyers he dislikes with a new memorandum that threatens to use govt .",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-now-broadens-campaign-of-retaliation-against-lawyers/articleshow/119389910.cms",
    "timestamp": "2025-03-23T19:44:49Z"
  },
  {
    "title": "Second Lady Usha Vance Headed to Greenland to ‘Visit Historical Sites’ as Trump Continues Push to Own It",
    "description": "The Vice President's wife announced in a White House press release posted on X she is visiting Greenland next week, as Trump continues pushing to acquire it.\nThe post Second Lady Usha Vance Headed to Greenland to ‘Visit Historical Sites’ as Trump Continues Pu…",
    "link": "https://www.mediaite.com/trump/second-lady-usha-vance-headed-to-greenland-to-visit-historical-sites-as-trump-continues-push-to-own-it/",
    "timestamp": "2025-03-23T19:41:50Z"
  },
  {
    "title": "Canadian PM calls early election, pledges to fight Trump’s annexation drive",
    "description": "Canada’s new Prime Minister Mark Carney on Sunday called early elections for April 28, pledging to defeat Donald Trump’s drive to annex the United States’s huge northern neighbour. Carney, a former central banker, was chosen by Canada’s centrist Liberal Party…",
    "link": "https://punchng.com/canadian-pm-calls-early-election-pledges-to-fight-trumps-annexation-drive/",
    "timestamp": "2025-03-23T19:39:15Z"
  },
  {
    "title": "Donald Trump to host Patrick Mahomes and Travis Kelce in unexpected meeting at the White House",
    "description": "In a surprising turn of events, President Donald Trump has extended an invitation to the Kansas City Chiefs to visit the White House-an opportunity they were previously denied due",
    "link": "https://www.marca.com/en/nfl/kansas-city-chiefs/2025/03/23/67e04088268e3e0f5e8b4572.html",
    "timestamp": "2025-03-23T19:36:28Z"
  },
  {
    "title": "WATCH: Democrats’ 10-part strategy to stopping Trump (at any cost)",
    "description": "Victor Davis Hanson explores why leftists think everything Trump does is evil",
    "link": "https://www.wnd.com/2025/03/watch-democrats-10-part-strategy-to-stopping-trump-at-any-cost/",
    "timestamp": "2025-03-23T19:35:26Z"
  },
  {
    "title": "McMahon says Columbia U. on track to recover funding",
    "description": "U.S. Education Secretary Linda McMahon said Columbia University is \"on the right track\" toward recovering federal funding after the elite New York City university agreed to implement a host of policy changes demanded by the Trump administration.",
    "link": "https://www.bostonherald.com/2025/03/23/mcmahon-says-columbia-u-on-track-to-recover-funding/",
    "timestamp": "2025-03-23T19:33:35Z"
  },
  {
    "title": "Second lady Usha Vance will visit Greenland as Trump talks up US takeover - The Associated Press",
    "description": "Second lady Usha Vance will visit Greenland as Trump talks up US takeoverThe Associated Press Wife of US Vice President Vance to make high-profile visit to GreenlandReuters Usha Vance, other US officials to visit Greenland amid Donald Trump's talk of annexati…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176798961",
    "timestamp": "2025-03-23T19:33:13Z"
  },
  {
    "title": "'Give me liberty or give me death' turns 250. Here's what it meant in 1775",
    "description": "Patrick Henry reportedly lifted a dagger-like letter opener and plunged it under his arm as if into his chest before uttering the phrase.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_04e4451b-7d8d-5561-88e5-d66fe6aea11d.html",
    "timestamp": "2025-03-23T19:30:00Z"
  },
  {
    "title": "'Give me liberty or give me death' turns 250. Here's what it meant in 1775",
    "description": "Patrick Henry reportedly lifted a dagger-like letter opener and plunged it under his arm as if into his chest before uttering the phrase.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_46303a91-fb8c-5cf6-b6a5-6e9edeb44e16.html",
    "timestamp": "2025-03-23T19:30:00Z"
  },
  {
    "title": "Trump Border Czar Tom Homan Confronted on Deportees Without Gang Ties",
    "description": "Jonathan Karl pressed Homan for details about the alleged gang affiliations of some of last week's deportees to El Salvador.",
    "link": "https://www.newsweek.com/trump-border-czar-tom-homan-confronted-deportees-without-gang-ties-2049322",
    "timestamp": "2025-03-23T19:28:13Z"
  },
  {
    "title": "Jeff Bezos and Lauren Sánchez’s star-studded Italian wedding guest list and venue: “Not just a wedding… it’s Davos meets the Met Gala on a yacht”",
    "description": "Jeff Bezos and Lauren Sánchez are planning a high-profile wedding on Bezos' $500 million superyacht in Venice, Italy, this summer. The guest list includes big names like Donald Trump and Kim Kardashian, making it a significant event blending business, enterta…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/jeff-bezos-and-lauren-snchezs-star-studded-italian-wedding-guest-list-and-venue-not-just-a-wedding-its-davos-meets-the-met-gala-on-a-yacht/articleshow/119389568.cms",
    "timestamp": "2025-03-23T19:27:57Z"
  },
  {
    "title": "Starmer is warned against ‘appeasing’ Trump with tax cut for US tech firms",
    "description": "Labour MP and Lib Dem leader express concern social media companies could be let off hook just as benefits are cut\nKeir Starmer has been warned against “appeasing” Donald Trump as he considers reducing a major tax for US tech companies while cutting disabilit…",
    "link": "https://biztoc.com/x/62499a9f7e36d416",
    "timestamp": "2025-03-23T19:24:49Z"
  },
  {
    "title": "Vance’s wife and son to visit Greenland",
    "description": "WASHINGTON — Second lady Usha Vance plans a trip to Greenland, the self-governing, mineral-rich territory of American ally Denmark that President Donald Trump has suggested the United States should take control over.\nVance will leave on Thursday and return Sa…",
    "link": "https://biztoc.com/x/f18eff3961580552",
    "timestamp": "2025-03-23T19:24:43Z"
  },
  {
    "title": "Astronomy Picture of the Day - Ancient Ogunquit Beach on Mars",
    "description": "Explanation: This was once a beach -- on ancient Mars. The featured 360-degree panorama, horizontally compressed, was taken in 2017 by the robotic Curiosity rover that explored the red planet. Named Ogunquit Beach after its terrestrial counterpart, evidence s…",
    "link": "https://freerepublic.com/focus/f-chat/4306267/posts",
    "timestamp": "2025-03-23T19:24:09Z"
  },
  {
    "title": "Vance’s wife and son to visit Greenland",
    "description": "Second lady Usha Vance plans a trip to Greenland, the self-governing, mineral-rich territory of American ally Denmark that President Donald Trump has suggested the United States should take control over.",
    "link": "https://www.bostonherald.com/2025/03/23/vances-wife-and-son-to-visit-greenland/",
    "timestamp": "2025-03-23T19:22:14Z"
  },
  {
    "title": "Forget Being Mauled by a Pit Bull - This Man Was Shot by a Pit Bull",
    "description": "A man in Memphis, Tennessee, was accidentally shot by his own dog earlier this month. The incident, which occurred in the early hours of the morning on March 10, came as a nasty shock when the man was sleeping, according to WHBQ-TV in Memphis. The man was ide…",
    "link": "https://freerepublic.com/focus/f-news/4306266/posts",
    "timestamp": "2025-03-23T19:21:24Z"
  },
  {
    "title": "Forget Being Mauled by a Pit Bull - This Man Was Shot by a Pit Bull",
    "description": "A man in Memphis, Tennessee, was accidentally shot by his own dog earlier this month. The incident, which occurred in the early hours of the morning on March 10, came as a nasty shock when the man was sleeping, according to WHBQ-TV in Memphis. The man was ide…",
    "link": "https://freerepublic.com/focus/f-chat/4306266/posts",
    "timestamp": "2025-03-23T19:21:24Z"
  },
  {
    "title": "‘Don’t Fight Bessent’s Treasury’ Is New Mantra in US Bond Market",
    "description": "Treasury Secretary Scott Bessent can’t stop talking about 10-year bond yields. In speeches, in interviews, week after week, he states and restates the administration’s plan to push them down and keep them down.",
    "link": "https://financialpost.com/pmn/business-pmn/dont-fight-bessents-treasury-is-new-mantra-in-us-bond-market",
    "timestamp": "2025-03-23T19:20:25Z"
  },
  {
    "title": "Education Secretary Says Columbia University’s Changes Put It on Track to Recover Funding",
    "description": "Linda McMahon described “great conversations” with Columbia's interim president, Katrina Armstrong.",
    "link": "https://time.com/7270910/education-secretary-columbia-university-funding-update/",
    "timestamp": "2025-03-23T19:15:19Z"
  },
  {
    "title": "Trump Signals Long Court Fight to Expand Power",
    "description": "“President Donald Trump has ramped up his fight with the judiciary as he racks up losses in court over his administration’s efforts to reshape the US government and its approach on everything from immigration to",
    "link": "https://politicalwire.com/2025/03/23/trump-signals-long-court-fight-to-expand-power/",
    "timestamp": "2025-03-23T19:14:29Z"
  },
  {
    "title": "Anger, and Donald Trump, will define Canada's next election",
    "description": "The News\nNew Canadian Prime Minister Mark Carney on Sunday called a snap election for April 28, kickstarting a campaign that will be defined by US President Donald Trump.\nCarney said he has already begun to “fight the Americans,” describing the country’s trad…",
    "link": "https://biztoc.com/x/5e03f3786a382b71",
    "timestamp": "2025-03-23T19:13:42Z"
  },
  {
    "title": "Jeremy Clarkson taunts ‘idiot’ Elon Musk over Tesla vandalism",
    "description": "“What makes it so juicy is that he’s being pecked to death by the very people who put him on the pedestal in the first place. The eco hippies.” British broadcaster writes.",
    "link": "https://www.politico.eu/article/jeremy-clarkson-idiot-elon-musk-tesla-vandalism/",
    "timestamp": "2025-03-23T19:12:57Z"
  },
  {
    "title": "Should Australia increase its defence spending? We asked 5 experts",
    "description": "Australia currently spends 2% of GDP on defence. Donald Trump wants it to be 3%. What is the magic number? We asked five experts",
    "link": "https://theconversation.com/should-australia-increase-its-defence-spending-we-asked-5-experts-252374",
    "timestamp": "2025-03-23T19:11:06Z"
  },
  {
    "title": "Trouble at Tesla and protests against Trump’s tariffs suggest consumer boycotts are starting to bite",
    "description": "If Donald Trump appears deaf to the protests of other governments over his policies, he may still hear the voice of corporate America should consumer boycotts spread.",
    "link": "https://theconversation.com/trouble-at-tesla-and-protests-against-trumps-tariffs-suggest-consumer-boycotts-are-starting-to-bite-252489",
    "timestamp": "2025-03-23T19:10:39Z"
  },
  {
    "title": "FBI Issues Tesla 'Alert' for 'Arson, Gunfire, Vandalism'",
    "description": "The FBI issued a warning of \"arson, gunfire, and vandalism\" so Americans maintain \"vigilance and awareness\" of domestic terror attacks \"linked to political grievances\" on Tesla vehicles, dealerships, and charging stations in nine-plus states. \"PSA: FBI warn…",
    "link": "https://freerepublic.com/focus/f-news/4306264/posts",
    "timestamp": "2025-03-23T19:10:34Z"
  },
  {
    "title": "This week’s federal budget will focus on cost-of-living measures – and a more uncertain global economy",
    "description": "In the Albanese government’s last federal budget before the election, new spending promises are likely to be limited.",
    "link": "https://theconversation.com/this-weeks-federal-budget-will-focus-on-cost-of-living-measures-and-a-more-uncertain-global-economy-252515",
    "timestamp": "2025-03-23T19:10:30Z"
  },
  {
    "title": "Pro-Iran axis hosts Western activists, Hamas leaders at Houthi conference",
    "description": "The Houthi terror group host a pro-Iran conference with Hamas leaders and Western activists, sparking calls to investigate potential terror links.",
    "link": "https://www.jpost.com/middle-east/article-847301",
    "timestamp": "2025-03-23T19:09:53Z"
  },
  {
    "title": "Wife of US Vice President Vance to make high-profile visit to Greenland (Steve Holland/Reuters)",
    "description": "Steve Holland / Reuters:\nWife of US Vice President Vance to make high-profile visit to Greenland  —  Usha Vance, the wife of U.S. Vice President JD Vance, will travel to Greenland on Thursday as President Donald Trump clings to the idea of a U.S. annexation o…",
    "link": "https://www.memeorandum.com/250323/p37",
    "timestamp": "2025-03-23T19:05:00Z"
  },
  {
    "title": "‘Flying Fercos’ chronicles unique family, bygone era in Vegas entertainment | Shows | Entertainment",
    "description": "‘Flying Fercos’ chronicles unique family, bygone era in Vegas entertainment | Shows | Entertainmentreviewjournal.com",
    "link": "https://www.reviewjournal.com/post/3322274",
    "timestamp": "2025-03-23T19:03:31Z"
  },
  {
    "title": "'In case the slow people are listening': Jasmine Crockett fires back at Pam Bondi threat",
    "description": "Attorney General Pam Bondi got a swift response from Rep. Jasmine Crockett on Sunday after the Donald Trump appointee made an overheated threat that Texas Democrat needs to \"tread carefully\" when talking about billionaire Elon Musk.During an appearance with F…",
    "link": "https://www.rawstory.com/crockett-bondi/",
    "timestamp": "2025-03-23T19:02:32Z"
  },
  {
    "title": "West Virginians love Trump—and he's screwing them anyway",
    "description": "West Virginia is one of the Trumpiest states in the country, with President Donald Trump winning the state by a whopping 42 percentage points in the 2024 election. So you’d think—having delivered for Trump so big—that they’d be winning all sorts of victories.…",
    "link": "https://biztoc.com/x/a944c06c9ffdd98e",
    "timestamp": "2025-03-23T19:02:13Z"
  },
  {
    "title": "Trump Wants to Stage “Non-Woke” Musicals Like Cats at Kennedy Center",
    "description": "After installing himself as chairman, Trump has promised a new \"Vision for a Golden Age in Arts and Culture\"\nTrump Wants to Stage “Non-Woke” Musicals Like Cats at Kennedy Center\nJaeden Pinder",
    "link": "https://consequence.net/2025/03/donald-trump-kennedy-center-cats/",
    "timestamp": "2025-03-23T19:01:04Z"
  },
  {
    "title": "Hegseth Proposes a Challenge to Judge Blocking Military Transgender Ban",
    "description": "\"When the person suffers from a diagnosable mental illness and requires daily infusions of hormones and other drugs as well as surgery at government expense to live their best fantasy life, they shouldn't be allowed near weapons, ammunition, or explosives.\"\nT…",
    "link": "https://legalinsurrection.com/2025/03/hegseth-proposes-a-challenge-to-judge-blocking-military-transgender-ban/",
    "timestamp": "2025-03-23T19:00:34Z"
  },
  {
    "title": "Usha Vance Plans Visit to Learn About Greenland",
    "description": "Usha Vance will visit Greenland this week, White House aides announced Sunday, to see historical sites and \"learn about Greenlandic heritage\" in a Danish territory that President Trump has said he wants the US to absorb. The second lady will travel there Thur…",
    "link": "https://www.newser.com/story/366076/usha-vance-plans-visit-to-learn-about-greenland.html",
    "timestamp": "2025-03-23T19:00:00Z"
  },
  {
    "title": "SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 38",
    "description": "Security Affairs Malware newsletter includes a collection of the best articles and research on malware in the international landscape Decrypting Encrypted files from Akira Ransomware (Linux/ESXI variant 2024) using a bunch of GPUs  Jaguar Land Rover Breached …",
    "link": "https://securityaffairs.com/175746/malware/security-affairs-malware-newsletter-round-38.html",
    "timestamp": "2025-03-23T18:58:38Z"
  },
  {
    "title": "It's Official: The Left Is Pro-Terrorism Now",
    "description": "<p>In its bid to recoil at anything associated with Donald Trump or Elon Musk, the left has decided that acts of terrorism against Tesla are now acceptable.</p>",
    "link": "https://www.realclearpolitics.com/2025/03/23/its_official_the_left_is_pro-terrorism_now_643464.html",
    "timestamp": "2025-03-23T18:58:03Z"
  },
  {
    "title": "Rosie O'Donnell Apologized to Ireland Leader After Trump Exchange",
    "description": "The actress and comedian, who recently moved to Ireland, revealed more about how the U.S. president's re-election led to her relocation.",
    "link": "http://www.hollywoodreporter.com/news/politics-news/rosie-odonnell-apologized-ireland-prime-minister-trump-1236170805/",
    "timestamp": "2025-03-23T18:54:08Z"
  },
  {
    "title": "Sen Bernie Sanders names 2 things Trump has done right",
    "description": "Sen. Bernie Sanders, I-Vt., told ABC's Jonathan Karl that President Donald Trump is doing two things right during his first 100 days back in the Oval Office.",
    "link": "https://www.foxnews.com/politics/sen-bernie-sanders-names-2-things-trump-has-done-right",
    "timestamp": "2025-03-23T18:53:37Z"
  },
  {
    "title": "“Send Them to Jail”: GOP Officials Keep Saying Trump Can Arrest People for Protesting",
    "description": "When Donald Trump was sworn in as the 47th president of the United States, he made a solemn pledge. “After years and years of illegal and unconstitutional federal efforts to restrict free expression, I also will sign an executive order to immediately stop all…",
    "link": "https://www.motherjones.com/politics/2025/03/mahmoud-khalil-trump-leavitt-tuberville-free-speech/",
    "timestamp": "2025-03-23T18:51:47Z"
  },
  {
    "title": "Trump Admin Tries To Woo Greenland With Visit From Second Lady Usha Vance",
    "description": "President Trump has insisted annexing the island is crucial for U.S. security.",
    "link": "https://www.huffpost.com/entry/second-lady-usha-vance-greenland-visit_n_67e04131e4b005fbb149f7e7",
    "timestamp": "2025-03-23T18:51:44Z"
  },
  {
    "title": "Usha Vance, other US officials to visit Greenland amid Donald Trump's talk of annexation",
    "description": "Second lady Usha Vance will visit Greenland on Thursday as President Donald Trump continues to express his desire for the U.S. to annex the territory.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/23/usha-vance-greenland-trump-annexation/82625483007/",
    "timestamp": "2025-03-23T18:51:24Z"
  },
  {
    "title": "Canadian prime minister calls snap election, days after being sworn in",
    "description": "The contest is expected to be dominated by Canada's increasingly tense relationship with US President Donald Trump, who has labelled the country America's \"51st state\".",
    "link": "https://www.abc.net.au/news/2025-03-24/new-canadian-pm-calls-snap-election/105087074",
    "timestamp": "2025-03-23T18:49:13Z"
  },
  {
    "title": "Obama calls to expand ObamaCare 'with everything going on right now'",
    "description": "Former President Barack Obama called for the Affordable Care Act, his signature healthcare legislation often dubbed ObamaCare, be expanded on in the coming years.",
    "link": "https://www.foxnews.com/politics/obama-calls-expand-obamacare-with-everything-going-right-now",
    "timestamp": "2025-03-23T18:45:43Z"
  },
  {
    "title": "How a two-week old interview by Danielle Smith drove day one of the election campaign",
    "description": "Smith told Breitbart that she was pressing the Trump administration to put the tariffs \"on pause\" while Canadians went through an election.",
    "link": "https://nationalpost.com/news/canada/interview-danielle-smith-drove-day-one-election-campaign",
    "timestamp": "2025-03-23T18:45:16Z"
  },
  {
    "title": "USAID funds frozen, allies in dark over money they parked",
    "description": "Government officials from Sweden, Norway and the Netherlands told AP that a combined $15 million they contributed for joint development work overseas has been parked at the US Agency for International Development for months.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/usaid-funds-frozen-allies-in-dark-over-money-they-parked/articleshow/119388862.cms",
    "timestamp": "2025-03-23T18:44:50Z"
  },
  {
    "title": "To our self-proclaimed ‘King,’ Americans are all undocumented now",
    "description": "We are all undocumented now. We Americans no longer have undeniable legal status in this country. Our rights, our organizations, our jobs, our health, our schools, our laws, our Constitution — all are now provisional, subject to the whims of the self-proclaim…",
    "link": "https://freerepublic.com/focus/f-news/4306261/posts",
    "timestamp": "2025-03-23T18:43:04Z"
  },
  {
    "title": "‘Snow White’: How Controversial Disney Princess Fared In Blue & Red County Cinemas – Box Office",
    "description": "EXCLUSIVE: Heading into the weekend, Disney’s Snow White was being nicknamed Snow Woke in vitriol online circles, which begged the question how this princess movie would fare at the box office in a Trumpian era country that’s divided by blue and red states. T…",
    "link": "http://deadline.com/2025/03/snow-white-box-office-blue-red-states-1236347329/",
    "timestamp": "2025-03-23T18:42:18Z"
  },
  {
    "title": "Security Affairs newsletter Round 516 by Pierluigi Paganini – INTERNATIONAL EDITION",
    "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. U.S. Treasury …",
    "link": "https://securityaffairs.com/175740/breaking-news/security-affairs-newsletter-round-516-by-pierluigi-paganini-international-edition.html",
    "timestamp": "2025-03-23T18:41:50Z"
  },
  {
    "title": "New Canadian prime minister calls snap election to respond to Trump",
    "description": "New Canadian Prime Minister Mark Carney kicked off his election campaign on Sunday ahead of the country's 45th federal election scheduled on April 28.",
    "link": "https://www.foxnews.com/world/new-canadian-prime-minister-calls-snap-election-respond-trump",
    "timestamp": "2025-03-23T18:39:20Z"
  },
  {
    "title": "Diamond Tiffany earrings swallowed by suspected thief are recovered by Florida police",
    "description": "Detectives have recovered four diamond earrings from a suspected thief two weeks after he swallowed the jewellery worth nearly £600,000 during his arrest, US police have said. The man, who was detained in Florida, had told staff at a Tiffany & Co store he was…",
    "link": "https://freerepublic.com/focus/f-chat/4306260/posts",
    "timestamp": "2025-03-23T18:39:11Z"
  },
  {
    "title": "Canada’s new prime minister and his opponent kick off five-week election campaigns",
    "description": "New Canadian Prime Minister Mark Carney and his Conservative opponent said U.S. President Donald Trump must respect Canada’s sovereignty as they kicked off their election campaigns Sunday against the backdrop of a trade war and annexation threats from Trump.",
    "link": "https://biztoc.com/x/bd7ca92cca72f9c7",
    "timestamp": "2025-03-23T18:38:19Z"
  },
  {
    "title": "Dutton's budget reply is a career- and election-defining test",
    "description": "Your attention is what politicians are seeking, and they will be reaching for it everywhere they possibly can in budget week.",
    "link": "https://www.abc.net.au/news/2025-03-24/dutton-budget-reply-a-career-and-election-defining-test/105085850",
    "timestamp": "2025-03-23T18:37:58Z"
  },
  {
    "title": "IRS whistleblowers vindicated, fight crime to fight gangs and other commentary",
    "description": "Why is Donald Trump “fundamentally uprooting the federal bureaucracy?” asks The Wall Street Journal’s Kimberley A. Strassel. Look at the “years of retaliation” within the IRS against Gary Shapley and Joseph Ziegler.",
    "link": "https://nypost.com/2025/03/23/opinion/irs-whistleblowers-vindicated-fight-crime-to-fight-gangs-and-other-commentary/",
    "timestamp": "2025-03-23T18:37:34Z"
  },
  {
    "title": "Pelosi Privately Urged Hakeem Jeffries to 'Use Your Power' (Peter Wade/Rolling Stone)",
    "description": "Peter Wade / Rolling Stone:\nPelosi Privately Urged Hakeem Jeffries to ‘Use Your Power’  —  With many in the party viewing Chuck Schumer as having caved to Trump, it may create an opportunity for the House minority leader to step up  —  Senate Minority Leader …",
    "link": "https://www.memeorandum.com/250323/p36",
    "timestamp": "2025-03-23T18:35:01Z"
  },
  {
    "title": "ITL weighs tractor exports from India instead of US",
    "description": "International Tractors faces challenges exporting to Mexico and Canada due to US tariffs and plans to shift exports from India instead of Atlanta. ITL, the largest tractor exporter in India, expects a decline in overseas shipments in fiscal 2024-25 due to glo…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/itl-weighs-tractor-exports-from-india-instead-of-us/articleshow/119388375.cms",
    "timestamp": "2025-03-23T18:32:07Z"
  },
  {
    "title": "IRS Prepares To Provide Addresses of Some Undocumented Taxpayers To Immigration Enforcement",
    "description": "“It is a complete betrayal of 30 years of the government telling immigrants to file their taxes,” one former IRS official told The Washington Post.",
    "link": "https://www.vanityfair.com/news/story/irs-immigration-undocumented-taxpayers-ice",
    "timestamp": "2025-03-23T18:31:23Z"
  },
  {
    "title": "Ukraine truce talks in Riyadh on, starting with critical infra",
    "description": "The meeting in Saudi Arabia, which precedes talks on Monday between the US and Russian delegations, came as US special envoy Steve Witkoff expressed optimism about the chances for ending Europe's deadliest conflict since World War II \"I feel (Russian Presiden…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/ukraine-truce-talks-in-riyadh-on-starting-with-critical-infra/articleshow/119388320.cms",
    "timestamp": "2025-03-23T18:30:15Z"
  },
  {
    "title": "Snap election pits Canada against Trump (Mickey Djuric/Politico)",
    "description": "Mickey Djuric / Politico:\nSnap election pits Canada against Trump  —  Canada's new prime minister said he needs a mandate from Canadians to take on U.S. President Donald Trump.  —  OTTAWA — Prime Minister Mark Carney called a snap election on Sunday, saying h…",
    "link": "https://www.memeorandum.com/250323/p34",
    "timestamp": "2025-03-23T18:30:01Z"
  },
  {
    "title": "Houthi group reports 2 new US airstrikes in northern Yemen",
    "description": "U.S. warplanes staged two airstrikes on the outskirts of Saada province in northern Yemen on Sunday evening, the Houthi group said.",
    "link": "https://www.hurriyetdailynews.com/houthi-group-reports-2-new-us-airstrikes-in-northern-yemen-207243",
    "timestamp": "2025-03-23T18:26:01Z"
  },
  {
    "title": "Geared for US duties, China calls on nations to open up",
    "description": "Top executives including Apple's Tim Cook, Qualcomm's Cristiano Amon, Pfizer's Albert Bourla and Saudi Aramco's Amin Nasser are attending the two-day conference. Bloomberg News earlier reported that plans were being made for corporate titans to meet Chinese P…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/geared-for-us-duties-china-calls-on-nations-to-open-up/articleshow/119388120.cms",
    "timestamp": "2025-03-23T18:24:53Z"
  },
  {
    "title": "Canada’s new prime minister and his opponent kick off five-week election campaigns",
    "description": "New Canadian Prime Minister Mark Carney and his Conservative opponent said U.S. President Donald Trump must respect Canada’s sovereignty as they kicked off their election campaigns Sunday against the backdrop of a trade war and annexation threats from Trump.",
    "link": "https://www.pbs.org/newshour/world/canadas-new-prime-minister-and-his-opponent-kick-off-five-week-election-campaigns",
    "timestamp": "2025-03-23T18:24:30Z"
  },
  {
    "title": "Measles outbreaks are the result of public health distrust after COVID-19 - Washington Examiner",
    "description": "You can draw a line from the effects of public health bureaucrats mishandling COVID-19 to the increasing measles outbreaks the country is seeing.",
    "link": "https://www.washingtonexaminer.com/in_focus/3350480/measles-outbreaks-result-of-public-health-distrust-after-covid/",
    "timestamp": "2025-03-23T18:23:37Z"
  },
  {
    "title": "Conor McGregor and Andrew Tate should be ‘social pariahs’, says Tánaiste",
    "description": "Conor McGregor and Andrew Tate should not be social media influencers but instead \"social pariahs,\" Tánaiste Simon Harris has said.",
    "link": "https://www.independent.ie/irish-news/politics/conor-mcgregor-and-andrew-tate-should-be-social-pariahs-says-tanaiste/a881506837.html",
    "timestamp": "2025-03-23T18:23:03Z"
  }
]