[
  {
    "title": "Light rare earths, no magnets, and a resolve to break free of China's iron grip",
    "description": "Sona Comstar has developed new motors using light rare earth elements like cerium, samarium and neodymium, while Ather Energy too is keen to move towards light rare earth magnets. Ola Electric says it has developed magnet-free motors",
    "link": "https://www.livemint.com/industry/china-rare-earth-restrictions-automotive-firms-sona-comstar-ather-light-rare-earths-ola-electric-magnet-free-motors-11752487947846.html",
    "timestamp": "2025-07-14T23:45:09Z"
  },
  {
    "title": "US nuclear regulator asks job seekers political questions",
    "description": "WASHINGTON (Reuters) -A job notice posted by the U.S. nuclear power regulator asks applicants political questions as the administration of President Donald...",
    "link": "https://www.yahoo.com/news/us-nuclear-regulator-asks-job-234502743.html",
    "timestamp": "2025-07-14T23:45:02Z"
  },
  {
    "title": "B-52s Escorted by Japanese and South Korean Fighters in Trilateral Exercise",
    "description": "U.S. Air Force B-52s deployed to Andersen AFB, Guam, linked with Japanese Mitsubishi F-2 and South Korean KF-16 Fighting Falcon fighter aircraft while operating in the Pacific region on Jul. 11, 2025. According to the U.S. Air Force, the escort mission marked…",
    "link": "https://theaviationist.com/2025/07/15/b52s-escorted-trilateral-exercise/",
    "timestamp": "2025-07-14T23:44:50Z"
  },
  {
    "title": "Hacker uses Elmo's X account to post antisemitic rant and demand release of Epstein files",
    "description": "The account has more than 650,000 followers and is a reliable stream of wholesome content on a platform where inflammatory rhetoric and abusive messages thrive.",
    "link": "https://www.abc.net.au/news/2025-07-15/elmo-x-account-hacked-twitter-sesame-street-/105532232",
    "timestamp": "2025-07-14T23:44:46Z"
  },
  {
    "title": "Japan's envoy backs possible Trump-Putin talks",
    "description": "Japanese Ambassador to Russia, Akira Muto (pictured left), expressed Tokyo's support for a possible meeting between United States President Donald Trump and Russian President Vladimir Putin.\nSpea...",
    "link": "https://biztoc.com/x/bf3eb0e77fb5fe62",
    "timestamp": "2025-07-14T23:39:16Z"
  },
  {
    "title": "Millions Kicked Off Medicaid? 'Don't Eat Carrot Cake,' Says Administrator Oz",
    "description": "U.S. Centers for Medicare and Medicaid Services Administrator Dr. Mehmet Oz appeared on Fox Business on Monday, where he presented a carrot cake to celebrate Medicaid's 60th birthday and brushed aside concerns about the millions of Americans likely to lose th…",
    "link": "https://www.commondreams.org/news/mehmet-oz-carrot-cake",
    "timestamp": "2025-07-14T23:36:31Z"
  },
  {
    "title": "Tyler Adams broke his silence and spoke about the USMNT following the Gold Cup.",
    "description": "It&apos;s not the best of times for the U.S. Men&apos;s National Team, following a disappointing loss to Mexico in the Gold Cup final. The defeat has sparked tension within the tea",
    "link": "https://www.marca.com/en/football/2025/07/15/68759423268e3ed91c8b45a3.html",
    "timestamp": "2025-07-14T23:35:33Z"
  },
  {
    "title": "Why Trump Suddenly Sounds Tougher on Russia (Jonathan Lemire/The Atlantic)",
    "description": "Jonathan Lemire / The Atlantic:\nWhy Trump Suddenly Sounds Tougher on Russia  —  The real reason the president suddenly sounds tougher on Russia  —  President Donald Trump is finally taking the fight to Vladimir Putin.  Sort of.  For now.  —  Trump's deference…",
    "link": "https://www.memeorandum.com/250714/p134",
    "timestamp": "2025-07-14T23:35:01Z"
  },
  {
    "title": "DeGeneres backs O’Donnell in Trump feud",
    "description": "Ellen DeGeneres put aside her history with Rosie O'Donnell in the midst of an ongoing feud with the president.",
    "link": "https://www.salon.com/2025/07/14/degeneres-backs-odonnell-in-trump-feud/",
    "timestamp": "2025-07-14T23:34:39Z"
  },
  {
    "title": "Trump sours on Putin, but bromance may not be over",
    "description": "With his announcement Monday of new arms for Ukraine via Europe and tariff threats on Russia, Trump's bromance with Putin has hit a new low — but it may not have run its course.",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/world/politics/trump-putin-ukraine-bromance-focus/",
    "timestamp": "2025-07-14T23:34:00Z"
  },
  {
    "title": "Trump Held On To Flashy Gold FIFA Trophy... Leaving Soccer Champs With A Replica",
    "description": "The president recounted how the Club World Cup trophy ended up in the Oval Office during an interview at the tournament finals on Sunday.",
    "link": "https://www.huffpost.com/entry/trump-fifa-soccer-club-world-cup-trophy_n_68755c06e4b0b1c6f12569ae",
    "timestamp": "2025-07-14T23:33:51Z"
  },
  {
    "title": "Billionaire fund manager reveals two major red flags to avoid 90% of bad investments",
    "description": "Tim Draper says he has seen the SEC kill startups with regulations.",
    "link": "https://www.thestreet.com/crypto/markets/billionaire-fund-manager-reveals-2-red-flags-to-avoid-90-of-bad-investments",
    "timestamp": "2025-07-14T23:31:42Z"
  },
  {
    "title": "Trump once rejected crypto. But then he could make a dollar",
    "description": "The US president is making bank off multiple crypto ventures, all while having an unprecedented capacity to influence the markets.\nThe post Trump once rejected crypto. But then he could make a dollar appeared first on Crikey.",
    "link": "http://www.crikey.com.au/2025/07/15/donald-trump-cryptocurrency-bitcoin-world-liberty/",
    "timestamp": "2025-07-14T23:30:18Z"
  },
  {
    "title": "Jeffrey Epstein had no trades to his name say Wall Street insiders",
    "description": "@WallStreetApes Remember how we were told Jeffrey Epstein made his money in finance, wealth management and trading Charlie Kirk exposes Jeffrey Epstein HAD NO TRADES EVER made under his name “There are no trades to Jeffrey Epstein name at any of the trading d…",
    "link": "https://freerepublic.com/focus/f-chat/4328705/posts",
    "timestamp": "2025-07-14T23:26:57Z"
  },
  {
    "title": "Trump throws gauntlet down on Putin — who gambled he could stall his way to victory",
    "description": "The time for talk is over. President Donald Trump issued a major deadline to Russia on Monday.",
    "link": "https://nypost.com/2025/07/14/opinion/trump-throws-gauntlet-down-on-putin-who-gambled-he-could-stall-his-way-to-victory/",
    "timestamp": "2025-07-14T23:25:02Z"
  },
  {
    "title": "Iran: No new date for US nuclear negotiations",
    "description": "Iran delays nuclear talks with the US following Israeli and US strikes on its nuclear facilities. Foreign Ministry spokesman says \"no specific date, time or location has been determined\" for a meeting.",
    "link": "https://www.israelnationalnews.com/news/411669",
    "timestamp": "2025-07-14T23:23:31Z"
  },
  {
    "title": "US House Set To Vote On Landmark Crypto Bills This Week",
    "description": "US lawmakers are on the verge of passing landmark legislation that will give the much-maligned crypto world much-wanted legitimacy, riding on President Donald Trump's recent embrace of the industry.",
    "link": "https://www.ibtimes.com/us-house-set-vote-landmark-crypto-bills-this-week-3778460",
    "timestamp": "2025-07-14T23:21:17Z"
  },
  {
    "title": "Trump Leveled A Baffling Threat At Rosie O'Donnell — Experts Explain Why It's Truly Terrifying",
    "description": "Experts in constitutional law and political science say what's most concerning about the president's recent attack on the comedian, who moved to Ireland in January.",
    "link": "https://www.huffpost.com/entry/donald-trump-rosie-odonnell-citizenship-experts_n_68755662e4b025efd81d05a4",
    "timestamp": "2025-07-14T23:20:40Z"
  },
  {
    "title": "King Charles says he 'misses Canada' in meeting with Canadian mounted troop at Windsor Castle",
    "description": "The King made sure soldiers from the Edmonton-based Lord Strathcona’s Horse regiment were enjoying their accommodations and asked if they were liking their borrowed horses",
    "link": "https://nationalpost.com/news/canada/king-charles-canadian-mounted-troop-windsor-castle",
    "timestamp": "2025-07-14T23:19:14Z"
  },
  {
    "title": "Ellen DeGeneres backs comedian in heated Trump row",
    "description": "Ellen DeGeneres has weighed in on an online war of words.",
    "link": "https://bangpremier.com/story/8/3340681/ellen-degeneres-backs-rosie-o-donnell-in-row-with-donald-trump",
    "timestamp": "2025-07-14T23:18:54Z"
  },
  {
    "title": "$1.6 trillion of student loans are up in the air as Trump moves in on the Department of Education",
    "description": "Education Secretary Linda McMahon is expected to move quickly now that the Supreme Court has cleared the way for her to continue unwinding the department.",
    "link": "https://fortune.com/2025/07/14/student-loans-debt-1-6-trillion-education-department-supreme-court-trump/",
    "timestamp": "2025-07-14T23:17:41Z"
  },
  {
    "title": "Veteran trader has surprising message on stocks",
    "description": "The stock market's move higher since April 9 has been impressive. The rally has been relentless after President Donald Trump paused most of the reciprocal tariffs he had announced only days earlier on April 2, so-called Liberation Day.\nThe S&P 500 has risen o…",
    "link": "https://biztoc.com/x/524e65f926f5460b",
    "timestamp": "2025-07-14T23:16:53Z"
  },
  {
    "title": "The Final Before the Final: What the Club World Cup Told Us About 2026",
    "description": "Sunday's Club World Cup was a preview of what’s to come in just over a year when the 2026 World Cup champion is crowned.",
    "link": "https://www.foxsports.com/stories/soccer/final-before-final-what-club-world-cup-told-us-about-2026",
    "timestamp": "2025-07-14T23:14:04Z"
  },
  {
    "title": "US imposes a 17% duty on Mexican tomatoes in hopes of boosting domestic production",
    "description": "The U.S. government says it's placing a 17% duty on most fresh Mexican tomatoes after negotiations ended without an agreement to avert the tariff",
    "link": "https://abcnews.go.com/Business/wireStory/us-imposes-17-duty-fresh-mexican-tomatoes-hopes-123750583",
    "timestamp": "2025-07-14T23:13:29Z"
  },
  {
    "title": "China’s Quant Funds Boost US Recruiting After Trump’s Visa Curbs",
    "description": "Chinese quantitative hedge funds are stepping up efforts to hire science and engineering students in the US affected by President Donald Trump’s university funding cuts and tighter visa policies.",
    "link": "https://www.livemint.com/companies/news/chinas-quant-funds-boost-us-recruiting-after-trump-s-visa-curbs-11752534746602.html",
    "timestamp": "2025-07-14T23:12:26Z"
  },
  {
    "title": "Air traffic control ‘wish list’ tops $30B",
    "description": "Lawmakers are talking about an estimated $30.5 billion “wish list” circulating on Capitol Hill to overhaul the nation’s aging air traffic control system as the ink still dries on the reconciliation law’s $12.5 billion down payment, sources familiar with discu…",
    "link": "https://www.bostonherald.com/2025/07/14/air-traffic-control-wish-list-tops-30b/",
    "timestamp": "2025-07-14T23:12:24Z"
  },
  {
    "title": "Fresh Mexican tomatoes singled out for 17% tariff",
    "description": "Mexico currently supplies around 70% of the U.S. tomato market, up from 30% two decades ago, according to the Florida Tomato Exchange.",
    "link": "https://fortune.com/2025/07/14/fresh-mexican-tomatoes-17-percent-tariff/",
    "timestamp": "2025-07-14T23:11:05Z"
  },
  {
    "title": "Indian exports to US to be more competitive after tariff hike on China, other countries: Niti Aayog",
    "description": "NEW DELHI, July 14: Indian exports to the US will become more competitive following imposition of higher tariffs by the Trump administration on countries, including China, Canada, and Mexico, NITI Aayog said in a report on Monday. The Aayog in its third editi…",
    "link": "https://thehillstimes.in/national/indian-exports-to-us-to-be-more-competitive-after-tariff-hike-on-china-other-countries-niti-aayog",
    "timestamp": "2025-07-14T23:10:00Z"
  },
  {
    "title": "Whitney Hermandorfer, Trump's First Judicial Pick of Second Term, Approved",
    "description": "Hermandorfer previously served as director of strategic litigation for the Tennessee AG, where she defended several Trump policies.",
    "link": "https://www.newsweek.com/trump-judicial-pick-whitney-hermandorfer-sixth-circuit-senate-2098922",
    "timestamp": "2025-07-14T23:09:59Z"
  },
  {
    "title": "‘Strange Confluence Of Variables’: Mike Benz Wants Transparency Task Force To Investigate What Happened in Butler, PA",
    "description": "Mike Benz raised serious concerns on Fox News Monday about the events surrounding the shooting in Butler, Pennsylvania",
    "link": "https://dailycaller.com/2025/07/14/mike-benz-secret-service-butler-shooting/",
    "timestamp": "2025-07-14T23:09:35Z"
  },
  {
    "title": "Alberta's measles outbreaks surpass case counts reported for entire U.S. (In terms of measle cases... Canada is winning.)",
    "description": "30 new cases reported in Alberta over the weekendAlberta has now confirmed more measles cases than the entire United States has reported this year. The province has been battling outbreaks since March and as of noon Monday, total case counts in the province h…",
    "link": "https://freerepublic.com/focus/f-chat/4328702/posts",
    "timestamp": "2025-07-14T23:07:50Z"
  },
  {
    "title": "Trump Admin Announces $200 Million Contract for Musk's AI After Grok Hitler Incident",
    "description": "The U.S. government on Monday awarded a $200 million contract to Elon Musk's artificial intelligence company, despite the tech billionaire's ongoing spat with President Donald Trump and his AI chatbot's recent praise for Nazi leader Adolf Hitler.The Chief Dig…",
    "link": "https://www.commondreams.org/news/elon-musk-ai",
    "timestamp": "2025-07-14T23:05:50Z"
  },
  {
    "title": "Vendors Demand Arias Resign Over False ICE Raid Warning. He Says Trump Is the Culprit",
    "description": "Swap meet vendors say Fresno City Councilmember Miguel Arias’ comments about an immigration raid that never occurred cost them business. Now, they want the council to sanction their colleague while also calling for Arias to resign. During the June 12 council …",
    "link": "https://freerepublic.com/focus/f-bloggers/4328701/posts",
    "timestamp": "2025-07-14T23:03:32Z"
  },
  {
    "title": "Lefty Groups Biden Showered In Taxpayer Cash Coaching Illegals To Evade ICE",
    "description": "Organizations picked for receipt of a multi-million-dollar grant from the Biden administration are now advising illegal immigrants on how to avoid deportation.",
    "link": "https://dailycaller.com/2025/07/14/lefty-groups-biden-taxpayer-cash-coaching-illegals-ice/",
    "timestamp": "2025-07-14T23:03:03Z"
  },
  {
    "title": "Andrew Cuomo Will Run in NYC Mayor’s General Election as an Independent",
    "description": "Andrew Cuomo isn’t giving up yet on his political comeback. The former governor plans to mount a competitive campaign in the general election for mayor of New York City after his surprise loss in the Democratic primary to Zohran Mamdani. Cuomo’s name will app…",
    "link": "https://freerepublic.com/focus/f-news/4328700/posts",
    "timestamp": "2025-07-14T23:02:33Z"
  },
  {
    "title": "Washington Is Investing Money in Palantir",
    "description": "Jewish Voice for Peace Wants It to Stop\n \n by Vivian McCall\n \n \n \n At 7:30 a.m. this morning, the bespectacled, 73-year-old Peter Lippman was in a crowd of activists with Jewish Voice for Peace (JVP). \nAs he walked around the corner from Cascade Playground to…",
    "link": "https://www.thestranger.com/news/2025/07/14/80148080/washington-is-investing-money-in-palantir",
    "timestamp": "2025-07-14T23:02:00Z"
  },
  {
    "title": "Trump Admin Defends Epstein Conspirator’s Conviction At Supreme Court",
    "description": "Trump's Department of Justice (DOJ) urged the Supreme Court on Monday to deny Ghislaine Maxwell's appeal.",
    "link": "https://dailycaller.com/2025/07/14/trump-doj-supreme-court-ghislaine-maxwell-jeffrey-epstein/",
    "timestamp": "2025-07-14T23:01:11Z"
  },
  {
    "title": "Democratic insider admits to praying for an economic depression as party's popularity continues to plummet",
    "description": "Following Trump's election victory, Democratic Party faces criticism as strategists acknowledge poor polling numbers and figures like Mark Cuban slam the party's current strategy",
    "link": "https://www.foxnews.com/media/democratic-insider-admits-praying-economic-depression-partys-popularity-continues-plummet",
    "timestamp": "2025-07-14T23:00:44Z"
  },
  {
    "title": "New Poll Shows Majority of Dems Still Believe Trump Russia Collusion Hoax Was Real",
    "description": "Unwilling to admit that the lack of evidence meant it hadn’t happened, the media instead left the door open to the possibility that it was true — just not yet proven.\nThe post New Poll Shows Majority of Dems Still Believe Trump Russia Collusion Hoax Was Real …",
    "link": "https://legalinsurrection.com/2025/07/new-poll-shows-majority-of-dems-still-believe-trump-russia-collusion-hoax-was-real/",
    "timestamp": "2025-07-14T23:00:22Z"
  },
  {
    "title": "Cardano Flashes Major Buy Signal—$1.90 Target Unleashed",
    "description": "Crypto analyst Investing Broz has spotlighted Cardano (ADA) as one of the most promising altcoins currently breaking out amid a shifting macro landscape and rising Bitcoin valuations. In his latest video update, the analyst identified ADA’s recent technical b…",
    "link": "http://www.newsbtc.com/news/cardano/cardano-flashes-major-buy-signal-1-90-target-unleashed/",
    "timestamp": "2025-07-14T23:00:20Z"
  },
  {
    "title": "Incumbent Working to Retain Seat so Republicans Can Take Over Virginia House",
    "description": "All eyes are turning to Virginia as the state heads into its off-year elections for governor and control of the Virginia House of Delegates this... Read More\nThe post Incumbent Working to Retain Seat so Republicans Can Take Over Virginia House appeared first …",
    "link": "https://www.dailysignal.com/2025/07/14/incumbent-working-retain-seat-help-virginia-republicans-take-state-house/",
    "timestamp": "2025-07-14T23:00:00Z"
  },
  {
    "title": "Trump’s ‘Big Beautiful Bill’ is estimated to leave millions without health care. He insists ‘it’s not going to cause death’",
    "description": "President Donald Trump defended his “Big, Beautiful, Bill” during a Fox News interview broadcast on Saturday night, claiming \"it's not going to cause death",
    "link": "https://www.newsbreak.com/share/4104549240121-trump-s-big-beautiful-bill-is-estimated-to-leave-millions-without-health-care-he-insists-it-s-not-going-to-cause-death?_f=app_share&amp;pd=0FHVIyyc&amp;lang=en_US&amp;send_time=1752533839&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.28.0.29%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v1%2Cns_foryou_recall_exp_25q3-v4%2Cns_foryou_rank_exp_25q2-v7%2Cns_foryou_model_exp_25q2_v2-v8&amp;s=i2",
    "timestamp": "2025-07-14T22:57:50Z"
  },
  {
    "title": "Asian Stocks Set for Gains as Tariffs Downplayed: Markets Wrap",
    "description": "Asian equities are set for a positive open as traders brush off President Donald Trump’s latest tariff threats as bargaining tactics that are unlikely to derail global trade.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-set-for-gains-as-tariffs-downplayed-markets-wrap",
    "timestamp": "2025-07-14T22:50:47Z"
  },
  {
    "title": "Senate confirms Trump’s first judicial nominee of his second term",
    "description": "Whitney Hermandorfer worked for Tennessee’s attorney general.",
    "link": "https://www.bostonherald.com/2025/07/14/senate-judge-trump/",
    "timestamp": "2025-07-14T22:46:55Z"
  },
  {
    "title": "Obama vs. Trump: Who Deported More Illegal Aliens?",
    "description": "The mass deportation of illegal aliens is not new. The U.S. has been removing thousands of illegal immigrants every year since the 1800s, according to official... Read More\nThe post Obama vs. Trump: Who Deported More Illegal Aliens? appeared first on The Dail…",
    "link": "https://www.dailysignal.com/2025/07/14/obama-vs-trump-who-deported-more-illegal-aliens/",
    "timestamp": "2025-07-14T22:45:00Z"
  },
  {
    "title": "Anna Navarro Claims Trump is 'Distracting' America From Epstein Files By Threatening to Boot Rosie O'Donnell from Country — As 'The View' Host Rips President In Brutal Takedown",
    "description": "'The View' co-host said the Trump administration is doing anything they can to win back MAGA support amid the Epstein files backlash.",
    "link": "https://radaronline.com/p/rosie-odonnell-donald-trump-the-view-ana-navarro-distracting-maga-epstein-files/",
    "timestamp": "2025-07-14T22:45:00Z"
  },
  {
    "title": "At Faith Office luncheon, Trump talks gas prices, transgender athletes and has strong words for his foes",
    "description": "At Faith Office luncheon, Trump talks gas prices, transgender athletes and has strong words for his foesgo.com",
    "link": "https://abcnews.go.com/Politics/faith-office-luncheon-trump-talks-gas-prices-transgender/story?id=123746594",
    "timestamp": "2025-07-14T22:44:39Z"
  },
  {
    "title": "Canada flouting USMCA with dairy import quota rules, says U.S. industry",
    "description": "U.S. dairy exporters are demanding Canada rewrite its rules around who can import cheese, milk and other products as President Donald Trump threatens to impose a 35-per-cent tariff on Canadian goods beginning Aug. 1.\nLast week, Mr. Trump sent a letter to Prim…",
    "link": "https://biztoc.com/x/cd0cafb084812c92",
    "timestamp": "2025-07-14T22:43:32Z"
  },
  {
    "title": "Musk's Grok signs $200m deal with Pentagon days after antisemitism row",
    "description": "The deal is part of the Trump administration's push for more aggressive adoption of artificial intelligence in the government.",
    "link": "https://www.bbc.com/news/articles/c628d9mre3go",
    "timestamp": "2025-07-14T22:42:08Z"
  },
  {
    "title": "Chelsea star says he was 'confused' Trump shared stage as players celebrated Club World Cup win",
    "description": "Chelsea star Cole Palmer reacted after President Donald Trump shared the stage with players following their FIFA Club World Cup victory on Sunday.",
    "link": "https://www.foxnews.com/sports/chelsea-star-says-he-confused-trump-shared-stage-players-celebrated-club-world-cup-win",
    "timestamp": "2025-07-14T22:41:15Z"
  },
  {
    "title": "China steps in as U.S. pulls back from diplomacy, report says",
    "description": "The Democrats' 91-page report listed ways, from broadcasting to health programs and development efforts, that committee researchers said China is expanding its influence.",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/asia-pacific/china-us-diplomacy-report/",
    "timestamp": "2025-07-14T22:40:00Z"
  },
  {
    "title": "US Imposes Major Duty On Fresh Mexican Tomatoes To Boost Domestic Production",
    "description": "Proponents said the import tax will help rebuild the shrinking U.S. tomato industry and ensure that produce eaten in the U.S. is also grown there.",
    "link": "https://www.huffpost.com/entry/tomatoes-from-mexico-about-to-get-more-expensive_n_687585b3e4b084ccb1a9d4b5",
    "timestamp": "2025-07-14T22:39:38Z"
  },
  {
    "title": "Trump just accelerated a 50-year trend of wealth hoarding and democratic decline",
    "description": "America has never been richer. But the gains are so lopsided that the top 10% controls 69% of all wealth in the country, while the bottom half controls just 3%. Meanwhile, surging corporate profits have mostly benefited investors, not the broader public.This …",
    "link": "https://www.rawstory.com/trump-megabill-2673203580/",
    "timestamp": "2025-07-14T22:39:06Z"
  },
  {
    "title": "U.S. Supreme Court clears way for Trump to gut Education Department",
    "description": "The justices lifted an order that had reinstated nearly 1,400 workers and blocked the administration from transferring key functions to other federal agencies.",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/world/politics/supreme-court-trump-education-department/",
    "timestamp": "2025-07-14T22:39:00Z"
  },
  {
    "title": "Looks Like Don Jr. Had a Great Time at the World Cup",
    "description": "On Sunday, Donald Trump Jr. and Bettina Anderson went to the FIFA Club World Cup final at MetLife Stadium in New Jersey and couldn’t stop packing on the PDA.",
    "link": "http://www.thecut.com/article/don-jr-bettina-anderson-pda-world-cup.html",
    "timestamp": "2025-07-14T22:38:12Z"
  },
  {
    "title": "US Supreme Court backs Trump push for mass firings at Education Department",
    "description": "Court reverses lower court ruling that said large staff cuts would effectively hamstring the federal education agency.",
    "link": "https://www.aljazeera.com/news/2025/7/14/us-supreme-court-gives-nod-to-trumps-push-to-gut-federal-education-agency",
    "timestamp": "2025-07-14T22:37:29Z"
  },
  {
    "title": "Fox’s Brit Hume Flat Out Says Trump ‘Got Played by Putin’",
    "description": "Fox News Chief Political Analyst Brit Hume offered a blunt assessment of President Donald Trump's approach to Russia.\nThe post Fox’s Brit Hume Flat Out Says Trump ‘Got Played by Putin’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/foxs-brit-hume-flat-out-says-trump-got-played-by-putin/",
    "timestamp": "2025-07-14T22:36:16Z"
  },
  {
    "title": "Mountie facing criminal investigation for allegedly making threatening comments at G7",
    "description": "A Quebec RCMP officer is under criminal investigation for allegedly making threatening remarks online during their deployment at the G7 summit last month.",
    "link": "https://www.cbc.ca/news/politics/rcmp-g7-security-investigation-trump-1.7584800",
    "timestamp": "2025-07-14T22:34:40Z"
  },
  {
    "title": "CMU students plan protests ahead of summit with Trump, energy executives",
    "description": "A coalition of Carnegie Mellon University students and faculty is organizing a day of protests in response to the Pennsylvania Energy and Innovation Summit, an invitation-only event set to bring President Trump, top tech executives, and major oil industry lea…",
    "link": "https://www.wtae.com/article/cmu-students-protests-trump-energy-executives-summit/65403879",
    "timestamp": "2025-07-14T22:33:37Z"
  },
  {
    "title": "Justice Department ethics chief says he was fired | CNN Politics",
    "description": "The Justice Department has fired at least a dozen employees in recent weeks who at one time worked with former special counsel Jack Smith, ranging from a senior ethics official to low-level support staff, sources familiar with matter tell CNN.",
    "link": "https://www.cnn.com/2025/07/14/politics/justice-department-ethics-official-fired",
    "timestamp": "2025-07-14T22:32:52Z"
  },
  {
    "title": "Why Trump Suddenly Sounds Tougher on Russia",
    "description": "The real reason the president suddenly sounds tougher on Russia",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/trump-putin-russia-ukraine/683531/",
    "timestamp": "2025-07-14T22:32:00Z"
  },
  {
    "title": "It’s either that or Pam Bondi “royally screwed up,” the MAGA podcaster declared.",
    "description": "Donald Trump-loyalist Megyn Kelly said he may have “blessed” a cover-up of Jeffrey Epstein’s crimes, in a shocking admission that stands against her previous...",
    "link": "https://www.thedailybeast.com/megyn-kelly-admits-trump-may-have-blessed-epstein-cover-up/",
    "timestamp": "2025-07-14T22:31:10Z"
  },
  {
    "title": "Senate Republicans Pressed to Prioritize Trump Nominations",
    "description": "Senate Republican leadership is facing pressure to increase the pace of confirming President Donald Trump’s nominees now that the One Big, Beautiful Bill is in... Read More\nThe post Senate Republicans Pressed to Prioritize Trump Nominations appeared first on …",
    "link": "https://www.dailysignal.com/2025/07/14/senate-republicans-pressed-expedite-trump-nominations/",
    "timestamp": "2025-07-14T22:30:00Z"
  },
  {
    "title": "Ohio’s Bernie Moreno Joins Senate Leadership Team",
    "description": "Last week, Sen. Bernie Moreno, R-Ohio, joined the leadership team of Senate Majority Whip John Barrasso, R-Wyo., where he will serve as a deputy. This... Read More\nThe post Ohio’s Bernie Moreno Joins Senate Leadership Team appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/07/14/ohios-bernie-moreno-joins-senate-leadership-team/",
    "timestamp": "2025-07-14T22:30:00Z"
  },
  {
    "title": "President Trump’s daughter-in-law may have just thrown gasoline on the fire.",
    "description": "Lara Trump isn’t doing her father-in-law any favors as President Donald Trump scrambles to stave off a growing MAGA revolt over his handling of the Jeffrey...",
    "link": "https://www.thedailybeast.com/lara-trump-teases-this-is-not-the-end-on-jeffrey-epstein-files/",
    "timestamp": "2025-07-14T22:29:34Z"
  },
  {
    "title": "'Spiritual Warfare': MAGA Host Calls Texas Flood An 'Attack' On Trump",
    "description": "MAGA television host Shemane Nugent suggested that the recent deadly flood in Texas was an \"attack\" on President Donald Trump.\n\n\nDuring her Sunday Faith & Freedom program, Nugent spoke to Texas Agriculture Commissioner Sid Miller about the tragedy.\n\n\n\"This is…",
    "link": "https://crooksandliars.com/2025/07/spiritual-warfare-maga-host-calls-texas",
    "timestamp": "2025-07-14T22:28:51Z"
  },
  {
    "title": "Hundreds of Alligator Alcatraz detainees have no criminal history",
    "description": "A report from the Miami Herald found that hundreds of detainees at the Florida facility have no criminal record",
    "link": "https://www.salon.com/2025/07/14/hundreds-of-alligator-alcatraz-detainees-have-no-criminal-history/",
    "timestamp": "2025-07-14T22:27:36Z"
  },
  {
    "title": "Gavin Newsom Devotes 4 Hours of Busy Schedule to Another Podcast",
    "description": "California Gov. Gavin Newsom spent more than four hours on the Shawn Ryan Show, released Monday -- as his state continues to struggle with wildfires, homelessness, illegal immigration, and other urgent crises.\nThe post Gavin Newsom Devotes 4 Hours of Busy Sch…",
    "link": "https://www.breitbart.com/politics/2025/07/14/gavin-newsom-devotes-4-hours-of-busy-schedule-to-another-podcast/",
    "timestamp": "2025-07-14T22:26:17Z"
  },
  {
    "title": "States sue Trump over more than $6bn in education funds",
    "description": "Officials from California, New York, Kentucky and 20 other states allege US administration acted unconstitutionally.",
    "link": "https://www.aljazeera.com/news/2025/7/14/states-sue-trump-over-more-than-6bn-in-education-funds",
    "timestamp": "2025-07-14T22:24:58Z"
  },
  {
    "title": "EXCLUSIVE: Donald Trump in Fresh Jeffrey Epstein Mystery as We Reveal Truth About His Murky Ties to Ghislaine Maxwell and Her Crooked Father... And How They Were Linked by Shady Yacht Purchases",
    "description": "Epstein and Ghislaine ran a hidden sex trafficking ring that allegedly provided underage girls and teens to some of the world's most powerful politicians and business leaders.",
    "link": "https://radaronline.com/p/donald-trump-jeffrey-epstein-ghislaine-maxwell-father-yacht/",
    "timestamp": "2025-07-14T22:18:57Z"
  },
  {
    "title": "GOP senator called out by colleague over 'stunning breach' of duty",
    "description": "Sen. Sheldon Whitehouse (D-RI) went after his Republican colleague and Judiciary Committee chairman, Sen. Chuck Grassley (R-IA), for carrying water for President Donald Trump's nominee to the federal appeals court, which Democrats allege is corrupt. Whitehous…",
    "link": "https://www.rawstory.com/chuck-grassley-2673198729/",
    "timestamp": "2025-07-14T22:17:43Z"
  },
  {
    "title": "Senate Confirms Trump’s First Judicial Pick To Replace Obama Appointee",
    "description": "Following the passage of the One Big Beautiful Bill Act, Senate Republicans are turning their focus to confirming President Donald Trump's judicial picks.",
    "link": "https://dailycaller.com/2025/07/14/senate-confirms-whitney-hermandorfer-judge/",
    "timestamp": "2025-07-14T22:17:42Z"
  },
  {
    "title": "‘They’re Hiding Something’: Democrats Panic Over Masked ICE Agents",
    "description": "Democrats presented a bill in the Massachusetts House on Wednesday to ban U.S. Immigration and Customs Enforcement agents from covering their faces during immigration raids... Read More\nThe post ‘They’re Hiding Something’: Democrats Panic Over Masked ICE Agen…",
    "link": "https://www.dailysignal.com/2025/07/14/theyre-hiding-something-democrats-panic-masked-ice-agents/",
    "timestamp": "2025-07-14T22:15:00Z"
  },
  {
    "title": "Trump threatens 100% Russia tariffs, vows arms for Ukraine",
    "description": "The threats echo punishment spelled out in a bipartisan bill in Congress that would impose 500% tariffs on countries that buy Russian oil and gas.",
    "link": "https://www.japantimes.co.jp/news/2025/07/15/world/politics/trump-russia-tariffs-arms-ukraine/",
    "timestamp": "2025-07-14T22:15:00Z"
  },
  {
    "title": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees",
    "description": "The Supreme Court allowed President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off almost 1,400 employees.",
    "link": "https://roanoke.com/news/nation-world/education/article_0663029d-2bf9-51ef-9711-a49bcfbc2c6f.html",
    "timestamp": "2025-07-14T22:15:00Z"
  },
  {
    "title": "“Let’s Do This” — Andrew Cuomo Unveils NYC Mayoral Run As An Independent After Primary Drubbing",
    "description": "“Hello, and unless you’ve been living under a rock, you probably know that the Democratic primary did not go the way I had hoped,” said former New York Governor Andrew Cuomo, who was recently bested in the NYC Democratic mayoral primary by Zohran Mamdani, a p…",
    "link": "http://deadline.com/2025/07/andrew-cuomo-formally-unveils-nyc-mayoral-run-as-independent-1236457002/",
    "timestamp": "2025-07-14T22:14:35Z"
  },
  {
    "title": "Obama Urges Democrats to Quit ‘Whining’ and ‘Do Something’: ‘Less Navel-Gazing’ and ‘Being in Fetal Positions’",
    "description": "Former President Barack Obama offered some blunt advice for his fellow Democrats at a private fundraiser, urging them that the way to avoid despair was to quit \"whining\" and \"do something.\"\nThe post Obama Urges Democrats to Quit ‘Whining’ and ‘Do Something’: …",
    "link": "https://www.mediaite.com/politics/obama-urges-democrats-to-quit-whining-and-do-something-less-navel-gazing-and-being-in-fetal-positions/",
    "timestamp": "2025-07-14T22:13:54Z"
  },
  {
    "title": "Trump Butler rally Secret Service team failed multiple basic protocols before assassination attempt, docs reveal",
    "description": "Six Secret Service agents faced suspension for security failures during Trump's Butler rally assassination attempt, with documents revealing poor preparation.",
    "link": "https://www.foxnews.com/politics/trump-butler-rally-secret-service-team-failed-multiple-basic-protocols-before-assassination-attempt-docs-reveal",
    "timestamp": "2025-07-14T22:10:48Z"
  },
  {
    "title": "Trump’s new Ukraine plan, briefly explained",
    "description": "President Donald Trump delivers remarks alongside NATO Secretary-General Mark Rutte during a meeting in the Oval Office on July 14. | Kevin Dietsch/Getty Images \nThis story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trum…",
    "link": "https://biztoc.com/x/43bf35dc681e0928",
    "timestamp": "2025-07-14T22:10:29Z"
  },
  {
    "title": "The Supreme Court just handed Trump his biggest victory of his second term",
    "description": "President Donald Trump shakes hands with Chief Justice John Roberts. \nThe Supreme Court ruled on Monday that the Trump administration may fire more than half of the Department of Education’s workforce — mass terminations that, in Education Secretary Linda McM…",
    "link": "https://biztoc.com/x/46f4dff9e4c10693",
    "timestamp": "2025-07-14T22:10:18Z"
  },
  {
    "title": "‘The Boys’ Swings at Trump Over Epstein Files With Soldier Boy ‘Herogasm’ Spoof: ‘FAKE NEWS’",
    "description": "Vought International shared a parody of the president arguing that the Epstein Files never existed \nThe post ‘The Boys’ Swings at Trump Over Epstein Files With Soldier Boy ‘Herogasm’ Spoof: ‘FAKE NEWS’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/the-boys-spoofs-trump-epstein-files-herogasm-fake-news/",
    "timestamp": "2025-07-14T22:10:10Z"
  },
  {
    "title": "Trump says he has real Club World Cup trophy and Chelsea given replica",
    "description": "US President Donald Trump says the Club World Cup trophy remains in the Oval Office despite Chelsea winning the competition over the weekend.",
    "link": "https://www.abc.net.au/news/2025-07-15/trump-says-he-has-real-club-world-cup-trophy/105532186",
    "timestamp": "2025-07-14T22:09:25Z"
  },
  {
    "title": "Despite All The Bluster, The Trump Admin Has Not Prosecuted a Single Media Leaker",
    "description": "Despite numerous media reports outlining actions to smoke out his administration's leakers, President Donald Trump's DOJ has yet to prosecute media leakers.",
    "link": "https://dailycaller.com/2025/07/14/donald-trump-admin-prosecuted-leaker-doj-dhs-dni-tulsi-gabbard-kristi-noem/",
    "timestamp": "2025-07-14T22:09:23Z"
  },
  {
    "title": "US imposes a 17% duty on fresh Mexican tomatoes in hopes of boosting domestic production",
    "description": "The U.S. government says it's placing a 17% duty on most fresh Mexican tomatoes after negotiations ended without an agreement to avert the tariff.",
    "link": "https://www.clickondetroit.com/business/2025/07/14/us-imposes-a-17-duty-on-fresh-mexican-tomatoes-in-hopes-of-boosting-domestic-production/",
    "timestamp": "2025-07-14T22:08:44Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Stocks managed to eke out a gain in Monday's session even after the latest trade developments.",
    "link": "https://www.cnbc.com/2025/07/14/stock-market-today-live-updates.html",
    "timestamp": "2025-07-14T22:08:02Z"
  },
  {
    "title": "Rollins Slams Medicaid, Touts Healthy Food to Cut Health Care Costs—GOP Cut Both Programs",
    "description": "U.S. Secretary of Agriculture Brooke Rollins claimed Medicaid is “bankrupting” the states, while suggesting that “healthy” foods could serve to help reduce health care costs. Yet both Medicaid and nutrition programs like SNAP were slashed under President Dona…",
    "link": "https://www.thenewcivilrightsmovement.com/2025/07/rollins-slams-medicaid-touts-healthy-food-to-cut-health-care-costs-gop-cut-both-programs/",
    "timestamp": "2025-07-14T22:07:48Z"
  },
  {
    "title": "Elmo's X account gets hacked, posts antisemitic and racist messages",
    "description": "WASHINGTON :Hackers broke into the X account of Sesame Street character Elmo and posted antisemitic and racist messages, the makers of the children's TV show said on Monday.The Sunday posts, which have been deleted, called for violence against Jews, insulted …",
    "link": "https://www.channelnewsasia.com/business/elmos-x-account-gets-hacked-posts-antisemitic-and-racist-messages-5238271",
    "timestamp": "2025-07-14T22:07:43Z"
  },
  {
    "title": "Elmo's X account gets hacked, posts antisemitic and racist messages",
    "description": "WASHINGTON (Reuters) -Hackers broke into the X account of Sesame Street character Elmo and posted antisemitic and racist messages, the makers of the...",
    "link": "https://tech.yahoo.com/social-media/articles/elmos-x-account-gets-hacked-220743099.html",
    "timestamp": "2025-07-14T22:07:43Z"
  },
  {
    "title": "Why Russia Recognized the Taliban",
    "description": "Russia sees much to gain from engaging with the Islamic Emirate of Afghanistan. \nThe post Why Russia Recognized the Taliban appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/silk-road-rivalries/why-russia-recognized-the-taliban",
    "timestamp": "2025-07-14T22:07:17Z"
  },
  {
    "title": "Stock market today: S&P 500, Nasdaq futures climb after Nvidia boost, with CPI inflation, bank earnings in focus",
    "description": "Wall Street girded for a key consumer inflation print and for big banks to kick off earnings season, with tariff-driven concerns in focus for both events.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-futures-climb-after-nvidia-boost-with-cpi-inflation-bank-earnings-in-focus-220710466.html",
    "timestamp": "2025-07-14T22:07:10Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500 futures climb after Nvidia boost, with CPI inflation data, big bank earnings on deck",
    "description": "Wall Street girded for a key consumer inflation print and for big banks to kick off earnings season, with tariff-driven concerns in focus for both events.",
    "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-futures-climb-after-nvidia-boost-with-cpi-inflation-data-big-bank-earnings-on-deck-220710502.html",
    "timestamp": "2025-07-14T22:07:10Z"
  },
  {
    "title": "Elmo's X account gets hacked, posts antisemitic and racist messages",
    "description": "The account has since been secured, Sesame Workshop said in a statement.",
    "link": "https://cnalifestyle.channelnewsasia.com/entertainment/elmo-x-account-hacked-467966",
    "timestamp": "2025-07-14T22:07:00Z"
  },
  {
    "title": "Trump’s new Ukraine plan, briefly explained",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Donald Trump announced a new plan to get American weap…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/419763/trump-nato-ukraine-weapons-patriot-missiles-plan",
    "timestamp": "2025-07-14T22:06:14Z"
  },
  {
    "title": "Texas food banks are rationing meals for flood survivors because of Trump’s cuts",
    "description": "The July 4th flooding has become the first major disaster to expose the grave effects of Trump’s new food and hunger policies.",
    "link": "http://grist.org/food-and-agriculture/texas-food-banks-flood-survivors-trump-funding-cuts/",
    "timestamp": "2025-07-14T22:03:11Z"
  },
  {
    "title": "What’s the MAGA-Epstein Drama All About?",
    "description": "A guide to what’s happening.",
    "link": "https://www.vanityfair.com/news/story/whats-the-maga-epstein-drama-all-about",
    "timestamp": "2025-07-14T22:03:09Z"
  },
  {
    "title": "What to know about the MAGA faithful’s anger over Trump and the Epstein case",
    "description": "Right-wing influencers were once bolstered by Trump's own claims on this case, but are now feeling their demands are being squelched by his administration.",
    "link": "https://www.pbs.org/newshour/politics/what-to-know-about-the-maga-faithfuls-anger-over-trump-and-the-epstein-case",
    "timestamp": "2025-07-14T22:02:46Z"
  },
  {
    "title": "Trump Sours on Putin, but Bromance may not be over",
    "description": "WASHINGTON: US president Donald Trump, long known for his admiration of Vladimir Putin, has taken a sharper tone against the Russian leader, though observers say the once-cozy relationship may n",
    "link": "https://www.channelnewsasia.com/world/trump-sours-putin-bromance-may-not-be-over-5238256",
    "timestamp": "2025-07-14T22:01:00Z"
  }
]