[
  {
    "title": "Pence: Trump Uses a 'Velvet Glove' with Dictators When We Need a Hammer",
    "description": "Former Vice President Mike Pence claimed Sunday on CNN's \"State of the Union\" that President Donald Trump used a \"velvet glove\" with dictators when a \"hammer\" was needed.\nThe post Pence: Trump Uses a ‘Velvet Glove’ with Dictators When We Need a Hammer appeare…",
    "link": "https://www.breitbart.com/clips/2025/08/17/pence-trump-uses-a-velvet-glove-with-dictators-when-we-need-a-hammer/",
    "timestamp": "2025-08-17T14:22:57Z"
  },
  {
    "title": "White House Responds to Trump-Putin Documents Being Found in Hotel Printer",
    "description": "The documents reportedly included plans for a canceled luncheon, seating charts, a gift presentation and phone numbers for U.S. and Russian officials.",
    "link": "https://www.newsweek.com/white-house-trump-putin-documents-hotel-russia-ukraine-war-latest-2114639",
    "timestamp": "2025-08-17T14:22:42Z"
  },
  {
    "title": "European leaders to shore up Ukraine’s Zelenskyy for DC talks with Trump",
    "description": "Ukraine and its European allies have criticised Putin's stance on the war after the Alaska summit as a way to buy time.",
    "link": "https://www.aljazeera.com/news/2025/8/17/european-leaders-to-shore-up-ukraines-zelenskyy-for-dc-talks-with-trump",
    "timestamp": "2025-08-17T14:18:54Z"
  },
  {
    "title": "Midterm Fight Over Trump Bill, Tariffs Starts Early at Iowa Fair",
    "description": "Republican Representative Zach Nunn is making an Iowa State Fair video about President Donald Trump’s tax law, shot on a John Deere tractor under the blazing August sun.",
    "link": "https://financialpost.com/pmn/business-pmn/midterm-fight-over-trump-bill-tariffs-starts-early-at-iowa-fair",
    "timestamp": "2025-08-17T14:18:39Z"
  },
  {
    "title": "Trump-Zelensky Talks: Europe's Backdoor Play for Arms Industry's Interests?",
    "description": "The German government announced on Sunday that Chancellor Friedrich Merz will travel to Washington, joining Volodymyr Zelensky and other European leaders for talks with US President Donald Trump.",
    "link": "https://sputnikglobe.com/20250817/trump-zelensky-talks-europes-backdoor-play-for-arms-industrys-interests-1122636859.html",
    "timestamp": "2025-08-17T14:18:21Z"
  },
  {
    "title": "Zelenskiy says current front lines should be the start for negotiations",
    "description": "KYIV (Reuters) -Ukrainian President Volodymyr Zelenskiy, speaking in Brussels on Sunday, said the current front lines in his country's war against Russia should be the basis for peace talks. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/17/zelenskiy-says-current-front-lines-should-be-the-start-for-negotiations",
    "timestamp": "2025-08-17T14:17:00Z"
  },
  {
    "title": "Sen. Van Hollen says an armed National Guard in DC would be ‘troubling’",
    "description": "Sen. Van Hollen says an armed National Guard in DC would be ‘troubling’go.com",
    "link": "https://abcnews.go.com/Politics/sen-van-hollen-armed-national-guard-dc-troubling/story?id=124720904",
    "timestamp": "2025-08-17T14:14:38Z"
  },
  {
    "title": "US, Russia Agree on Security Guarantees for Ukraine - Witkoff",
    "description": "MOSCOW (Sputnik) - US Special Envoy Steve Witkoff said on Sunday that the United States and Russia have agreed on security guarantees for Ukraine, but now everything depends on Kiev.",
    "link": "https://sputnikglobe.com/20250817/us-russia-agree-on-security-guarantees-for-ukraine---witkoff-1122636966.html",
    "timestamp": "2025-08-17T14:12:24Z"
  },
  {
    "title": "Putin Briefs His CIS Counterparts on Russia-US Summit in Alaska",
    "description": "MOSCOW (Sputnik) - Russian President Vladimir Putin has informed his Belarusian counterpart, Alexander Lukashenko, about the results of his meeting with US President Donald Trump in Alaska, the Kremlin said on Sunday.",
    "link": "https://sputnikglobe.com/20250817/putin-briefs-his-cis-counterparts-on-russia-us-summit-in-alaska-1122637029.html",
    "timestamp": "2025-08-17T14:09:24Z"
  },
  {
    "title": "US envoy says Putin agreed to protections for Ukraine as part of Trump summit",
    "description": "Special US envoy Steve Witkoff said that Russian leader Vladimir Putin agreed at his summit with President Donald Trump to allow the US and European allies to offer Ukraine a security guarantee resembling Nato's collective defence mandate as part of an eventu…",
    "link": "https://www.independent.ie/world-news/europe/us-envoy-says-putin-agreed-to-protections-for-ukraine-as-part-of-trump-summit/a1551943950.html",
    "timestamp": "2025-08-17T14:08:43Z"
  },
  {
    "title": "Even MAGA diehards think 'Trump got played' by Putin: CNN's Jake Tapper",
    "description": "CNN host Jake Tapper noted that even supporters of President Donald Trump believed that he \"got played\" by Russian President Vladimir Putin in last week's meeting on the war in Ukraine.During a Sunday interview with former Vice President Mike Pence, Tapper no…",
    "link": "https://www.rawstory.com/putin-trump-got-played-maga/",
    "timestamp": "2025-08-17T14:06:53Z"
  },
  {
    "title": "Cops Charge Indian Migrant with Homicide for Highway U-Turn",
    "description": "The Indian man who allegedly killed three Americans in a Florida highway crash illegally entered the United States in 2018, marking another atrocity enabled by pro-migration legislators and lobby groups.\nThe post Cops Charge Indian Migrant with Homicide for H…",
    "link": "https://www.breitbart.com/immigration/2025/08/17/cops-charge-indian-migrant-driver-with-homicide-for-highway-u-turn/",
    "timestamp": "2025-08-17T14:06:45Z"
  },
  {
    "title": "US may not be able to create scenario to end war in Ukraine: Rubio",
    "description": "The United States will keep trying to create a scenario to help end Russia's war in Ukraine, but that might not be possible, US Secretary of State Marco Rubio told CBS on Sunday (Aug 17). \"If peace is not going to be possible here and this is just going to co…",
    "link": "https://www.channelnewsasia.com/world/rubio-ukraine-war-russia-us-concessions-peace-deal-5298986",
    "timestamp": "2025-08-17T14:05:35Z"
  },
  {
    "title": "'Valid fear': Immigration judges, lawyers targeted by Trump administration",
    "description": "As the Trump administration looks to increase the number of deportations of undocumented immigrants, a new battle has opened inside the nation's immigration courts. Immigration judges and lawyers are being targeted for following established procedures. ... Th…",
    "link": "https://freerepublic.com/focus/f-news/4335064/posts",
    "timestamp": "2025-08-17T14:04:56Z"
  },
  {
    "title": "Newsom, Democrats Feign Outrage Over U.S. Troops Adjusting Red Carpet",
    "description": "\"Trump had our BRAVE AMERICAN SOLDIERS ON THEIR KNEES to roll out the RED CARPET for his best friend VLAD! DISGUSTING.\"\nThe post Newsom, Democrats Feign Outrage Over U.S. Troops Adjusting Red Carpet first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/newsom-democrats-feign-outrage-over-u-s-troops-adjusting-red-carpet/",
    "timestamp": "2025-08-17T14:00:54Z"
  },
  {
    "title": "Trump's swollen ankles steal spotlight...",
    "description": "Trump was recently diagnosed with CVI, sparking major health concerns from Americans.",
    "link": "https://www.irishstar.com/news/politics/trump-79-puts-cankles-full-35744195",
    "timestamp": "2025-08-17T14:00:03Z"
  },
  {
    "title": "Can Democratic Socialists Seize the Moment?",
    "description": "Democratic Socialists met in Chicago to sort out their differences and figure out how to take advantage of Zohran Mamdani's rising star.",
    "link": "http://www.rollingstone.com/politics/politics-features/democratic-socialists-zohran-mamdani-win-1235408412/",
    "timestamp": "2025-08-17T14:00:00Z"
  },
  {
    "title": "No deal is better than a bad deal",
    "description": "Despite the hype and atmospherics, the Trump-Putin meeting didn’t achieve much",
    "link": "https://www.thehindubusinessline.com/opinion/no-deal-is-better-than-a-bad-deal/article69944290.ece",
    "timestamp": "2025-08-17T13:57:10Z"
  },
  {
    "title": "How Dare Anyone Question Wokeness at the Smithsonian Museums?",
    "description": "The central strategy of media bias is defining your terms. The most obnoxious strategy of liberal journalists is defining the Republicans as ideological extremists engaging in culture wars and weaponizing partisan narratives for political victory. They preten…",
    "link": "https://freerepublic.com/focus/f-chat/4335062/posts",
    "timestamp": "2025-08-17T13:56:10Z"
  },
  {
    "title": "US may not be able to create scenario to end war in Ukraine, Rubio says",
    "description": "(Reuters) -The United States will keep trying to create a scenario to help end Russia's war in Ukraine, but that might not be possible, U.S. Secretary of State Marco Rubio told CBS on Sunday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/08/17/us-may-not-be-able-to-create-scenario-to-end-war-in-ukraine-rubio-says",
    "timestamp": "2025-08-17T13:48:00Z"
  },
  {
    "title": "'Highly encrypted message': Trump post sparks confusion and speculation online",
    "description": "Donald Trump caused speculation to swirl on Sunday when he posted a single word, \"Bela,\" on social media.Trump took to Truth Social over the weekend to complain about negative reports on his recent meeting with Putin, the leader of Russia. Shortly thereafter,…",
    "link": "https://www.rawstory.com/trump-encrypted-bela-typo-covfefe/",
    "timestamp": "2025-08-17T13:45:27Z"
  },
  {
    "title": "Women's volleyball activists react to California high school team forfeiting to opponent with trans athlete",
    "description": "Former volleyball women's players-turned activists responded to Riverside Poly's forfeit against transgender competitor AB Hernandez.",
    "link": "https://www.foxnews.com/sports/womens-volleyball-activists-california-forfeiting-opponent-trans-athlete",
    "timestamp": "2025-08-17T13:44:22Z"
  },
  {
    "title": "Von der Leyen sees 19th sanctions package against Russia in early September",
    "description": "European Commission chief says next package of measures against Moscow should be unveiled early next month.",
    "link": "https://www.politico.eu/article/eu-ursula-von-der-leyen-new-19-sanction-package-russia-putin-early-september-zelenskyy-war-ukraine/",
    "timestamp": "2025-08-17T13:41:35Z"
  },
  {
    "title": "US may not be able to create scenario to end war in Ukraine, Rubio says",
    "description": "(Reuters) -Talks between U.S. President Donald Trump and Russian leader Vladimir Putin produced enough movement to justify a meeting with Ukrainian and...",
    "link": "https://uk.news.yahoo.com/us-may-not-able-create-134114850.html",
    "timestamp": "2025-08-17T13:41:14Z"
  },
  {
    "title": "Rubio says a ceasefire deal 'not off the table' between Ukraine and Russia",
    "description": "Secretary of State Marco Rubio said Sunday that a temporary ceasefire agreement between Ukraine and Russia is “not off the table,” even though U.S., Ukrainian and Russian leaders agree that the best outcome is a peace deal that permanently ends the war.“It wa…",
    "link": "https://www.nbcnews.com/politics/trump-administration/rubio-says-ceasefire-deal-not-off-table-ukraine-russia-trump-rcna225421",
    "timestamp": "2025-08-17T13:40:25Z"
  },
  {
    "title": "Putin agrees that US, Europe could offer NATO-style security guarantees to Ukraine, Trump envoy says",
    "description": "Special U.S. envoy Steve Witkoff said Sunday that Russian leader Vladimir Putin agreed at his summit with President Donald Trump to allow the U.S. and European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part o…",
    "link": "https://www.bostonherald.com/2025/08/17/putin-agrees-that-us-europe-could-offer-nato-style-security-guarantees-to-ukraine-trump-envoy-says/",
    "timestamp": "2025-08-17T13:40:23Z"
  },
  {
    "title": "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says",
    "description": "Special U.S. envoy Steve Witkoff said Sunday that Russian leader Vladimir Putin agreed at his summit with President Donald Trump to allow the U.S. and European allies to offer Ukraine a security guarantee resembling NATO’s collective defense mandate as part o…",
    "link": "https://www.bostonherald.com/2025/08/17/putin-agreed-to-let-us-europe-offer-nato-style-security-protections-for-ukraine-trump-envoy-says/",
    "timestamp": "2025-08-17T13:40:23Z"
  },
  {
    "title": "Putin agreed to let US, Europe offer NATO-style security protections for Ukraine, Trump envoy says",
    "description": "Russia's Vladimir Putin agreed at his summit with President Donald Trump to allow the United States and its European allies to offer Ukraine a security...",
    "link": "https://www.yahoo.com/news/articles/us-envoy-says-putin-agreed-134023096.html",
    "timestamp": "2025-08-17T13:40:23Z"
  },
  {
    "title": "Trump Wakes Up Angry, Attacks ‘FAKE NEWS’ and Promises ‘BIG PROGRESS on Russia’",
    "description": "President Donald Trump appeared to wake up on the wrong side of the bed Sunday morning, trashing the \"FAKE NEWS\" media for their reporting on Friday's Alaska summit with Russian strongman Vladimir Putin.\nThe post Trump Wakes Up Angry, Attacks ‘FAKE NEWS’ and …",
    "link": "https://www.mediaite.com/media/news/trump-wakes-up-angry-attacks-fake-news-and-promises-big-progress-on-russia/",
    "timestamp": "2025-08-17T13:40:19Z"
  },
  {
    "title": "President Trump: ‘Big progress on Russia. Stay tuned!’",
    "description": "'It's incredible how the Fake News violently distorts the TRUTH when it comes to me'",
    "link": "https://www.wnd.com/2025/08/president-trump-big-progress-russia-stay-tuned/",
    "timestamp": "2025-08-17T13:39:57Z"
  },
  {
    "title": "Ex-Biden Spox Andrew Bates Warns ‘A**hole’ Trump ‘Laughing in Your Face’ Over Tariffs",
    "description": "Bates skewered Trump’s tariffs regime as “the biggest tax increase on working families since the Great Depression” in a scathing broadside.\nThe post Ex-Biden Spox Andrew Bates Warns ‘A**hole’ Trump ‘Laughing in Your Face’ Over Tariffs first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/news/ex-biden-spox-andrew-bates-warns-ahole-trump-laughing-in-your-face-over-tariffs/",
    "timestamp": "2025-08-17T13:38:15Z"
  },
  {
    "title": "Israel Plans to Move Hundreds of Thousands of Palestinians from Gaza: Report",
    "description": "South Sudan could be the place Israel will pick if it goes forward with a mass relocation of Gaza's residents.",
    "link": "https://www.westernjournal.com/israel-plans-move-hundreds-thousands-palestinians-gaza-report/",
    "timestamp": "2025-08-17T13:37:29Z"
  },
  {
    "title": "Trump hints at 'big progress' regarding Russia",
    "description": "Donald Trump announced progress on Russia after meeting Vladimir Putin in Alaska to discuss a Ukraine deal. Despite no immediate agreement to halt the invasion, both sides noted areas of accord. Trump described the talks as productive, mentioning a few remain…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-to-says-hints-at-progress-regarding-russia/articleshow/123346619.cms",
    "timestamp": "2025-08-17T13:36:41Z"
  },
  {
    "title": "'Largest federal detention center in history' set to open",
    "description": "A new migrant detention facility on a military base near the U.S.-Mexico border is scheduled to begin operations on Sunday.",
    "link": "https://www.wcvb.com/article/migrant-detention-center-fort-bliss-el-paso-texas/65799646",
    "timestamp": "2025-08-17T13:35:27Z"
  },
  {
    "title": "Trump-Putin Alaska Meeting in 1 Minute",
    "description": "US President Donald Trump called his meeting with Russian counterpart Vladimir Putin “extremely productive” but indicated that a deal to end the war had still not been finalized, adding that he would speak to NATO allies and Ukrainian President Volodymyr Zele…",
    "link": "https://biztoc.com/x/0602bed8c038d81e",
    "timestamp": "2025-08-17T13:34:37Z"
  },
  {
    "title": "Trump Runs Into The Difficulty Of Putin Diplomacy And Ending A Long War",
    "description": "Trump walked into a summit with Putin pressing for a ceasefire deal and threatening “severe consequences” and tough new sanctions if the Kremlin leader failed to agree to halt the fighting in Ukraine.",
    "link": "https://www.huffpost.com/entry/ap-us-trump-putin-where-trump-stands_n_68a1c2a8e4b06267503b4292",
    "timestamp": "2025-08-17T13:34:34Z"
  },
  {
    "title": "Trump insists on 'big progress' on Russia",
    "description": "United States President Donald Trump stressed on Sunday that \"big progress on Russia\" was made during his meeting with his counterpart from the Eurasian country, Vladimir Putin, urging the public to \"...",
    "link": "https://biztoc.com/x/abe080704bebc343",
    "timestamp": "2025-08-17T13:34:32Z"
  },
  {
    "title": "Sydney Sweeney’s new movie, ‘Americana,’ flops after American Eagle controversy",
    "description": "The crime thriller, which stars the \"Euphoria\" actress, Paul Walter Hauser and singer Halsey, bombed after debuting in 1,100 theaters across the country.",
    "link": "https://pagesix.com/2025/08/17/celebrity-news/sydney-sweeneys-new-movie-americana-flops-after-american-eagle-controversy/",
    "timestamp": "2025-08-17T13:32:43Z"
  },
  {
    "title": "Corrupt St. Louis Democrat Politician Indicted for Election Fraud",
    "description": "The Democrat Party has long marketed itself as the defender of democracy and integrity.\nThe post Corrupt St. Louis Democrat Politician Indicted for Election Fraud appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/corrupt-st-louis-democrat-politician-indicted-election-fraud/",
    "timestamp": "2025-08-17T13:30:11Z"
  },
  {
    "title": "'There's nothing I can say!' Trump melts down over negative reports on Putin meeting",
    "description": "President Donald Trump expressed frustration over media coverage after he failed to strike a deal with Russian President Vladimir Putin to stop the war in Ukraine.In a Sunday post on Truth Social, Trump attacked the media over reports that he could not get Pu…",
    "link": "https://www.rawstory.com/trump-putin-meeting-2673890786/",
    "timestamp": "2025-08-17T13:28:03Z"
  },
  {
    "title": "What Zelenskyy has said about Putin-Trump meeting as Russian president 'names his condition' to end Ukraine war",
    "description": "What Zelenskyy has said about the meeting in Alaska between Trump and Putin as the Russian president 'names his condition' to end the Ukraine war",
    "link": "https://www.ladbible.com/news/world-news/volodymyr-zelenskyy-putin-trump-meeting-russia-ukraine-war-144012-20250817",
    "timestamp": "2025-08-17T13:25:20Z"
  },
  {
    "title": "Trump: Meeting on Biden's stupid war was great",
    "description": "United States President Donald Trump insisted on Sunday that the meeting he had with his Russian counterpart Vladimir Putin dedicated to solving the crisis in Ukraine, which he described as his predec...",
    "link": "https://biztoc.com/x/c5eb292a054b0701",
    "timestamp": "2025-08-17T13:23:22Z"
  },
  {
    "title": "Photos, Videos Show 'Fight the Trump Takeover' Protests Across the Country",
    "description": "Thousands in cities including Washington and Austin joined protests against President Donald Trump's \"takeover\" on Saturday.",
    "link": "https://biztoc.com/x/db918fe4115ae83a",
    "timestamp": "2025-08-17T13:23:12Z"
  },
  {
    "title": "Rubio says Trump's position on Ukraine hasn't changed since summit",
    "description": "There may be 'additional consequences' for Russia if there's no deal, he said.",
    "link": "https://abcnews.go.com/Politics/rubio-trumps-position-ukraine-changed-summit/story?id=124720721",
    "timestamp": "2025-08-17T13:21:49Z"
  },
  {
    "title": "Photos, Videos Show 'Fight the Trump Takeover' Protests Across the Country",
    "description": "Thousands in cities including Washington and Austin joined protests against President Donald Trump's \"takeover\" on Saturday.",
    "link": "https://www.newsweek.com/photos-videos-show-fight-trump-takeover-protests-across-country-2114596",
    "timestamp": "2025-08-17T13:19:22Z"
  },
  {
    "title": "Donald Trump Gives Ivanka New White House Gig",
    "description": "Ivanka previously swore off politics, but daddy called and wants her \"in the middle of this...\"",
    "link": "https://cafemom.com/entertainment/donald-trump-gives-ivanka-new-white-house-gig",
    "timestamp": "2025-08-17T13:15:16Z"
  },
  {
    "title": "How Long Can Trump Keep Federal Takeover of DC?",
    "description": "President Donald Trump’s federal takeover of the D.C. police has led to more checkpoints, more arrests and more confrontations with protesters unhappy about the increased federal law enforcement and National Guard troops deployed around the nation’s capital. …",
    "link": "https://www.today.com/video/how-long-can-trump-keep-federal-takeover-of-dc-245162053565",
    "timestamp": "2025-08-17T13:09:24Z"
  },
  {
    "title": "European leaders to join Zelensky at White House meeting with Trump",
    "description": "UK Prime Minister Sir Keir Starmer will be among the leaders joining the Ukrainian leader on the US trip.",
    "link": "https://www.bbc.com/news/articles/crm4ln2ekg1o",
    "timestamp": "2025-08-17T13:07:22Z"
  },
  {
    "title": "Transgender runner Evie Parts sues NCAA, Swarthmore College for removal from track team",
    "description": "Long-distance runner Evie Parts has sued the NCAA and Swarthmore College as well as members of its athletic department, saying they illegally removed her from the track team because she is a transgender athlete.",
    "link": "https://www.cbc.ca/sports/transgender-runner-evie-parts-sues-ncaa-1.7611096",
    "timestamp": "2025-08-17T13:05:41Z"
  },
  {
    "title": "Dana White backs McGregor for the White House and dismisses Jon Jones",
    "description": "UFC president Dana White has revealed details about the eagerly awaited card to be held at the White House on July 4, 2026\nIn an interview with Jim Rome, White expressed his full s",
    "link": "https://www.marca.com/en/ufc/2025/08/17/68a1d0a8ca47415c7d8b45ae.html",
    "timestamp": "2025-08-17T13:03:26Z"
  },
  {
    "title": "Black mayors of cities Trump decries as 'lawless' tout significant declines in violent crimes",
    "description": "As President Donald Trump declared Washington, D.C., a crime-ridden wasteland in need of federal intervention this week and threatened similar federal...",
    "link": "https://www.yahoo.com/news/articles/black-mayors-cities-trump-decries-130254537.html",
    "timestamp": "2025-08-17T13:02:54Z"
  },
  {
    "title": "Black mayors of cities Trump decries as ‘lawless’ tout significant declines in violent crimes",
    "description": "As President Donald Trump declared Washington, D.C., a crime-ridden wasteland in need of federal intervention this week and threatened similar federal interventions in other Black-led cities, several mayors compared notes.",
    "link": "https://www.denverpost.com/2025/08/17/black-mayors-of-cities-trump-decries-as-lawless-tout-significant-declines-in-violent-crimes/",
    "timestamp": "2025-08-17T13:02:54Z"
  },
  {
    "title": "Ukrainians React to Trump's Warm Welcome of Putin",
    "description": "In Kyiv, many Ukrainians are wondering why President Donald Trump gave such a warm reception to accused war criminal, Russia’s Vladimir Putin, who continues daily attacks against Ukraine. At the Kremlin on Sunday, Putin gave no indication he plans to stop his…",
    "link": "https://biztoc.com/x/da09c4fda87574f0",
    "timestamp": "2025-08-17T13:01:15Z"
  },
  {
    "title": "DC police accused of changing crime stats just weeks before Trump federalized city",
    "description": "Weeks before President Donald Trump federalized the Washington, D.C., police, the Metropolitan Police Department was hit with accusations of allegedly juking crime stats for more favorable results.",
    "link": "https://www.foxnews.com/politics/dc-police-accused-changing-crime-stats-just-weeks-before-trump-federalized-city",
    "timestamp": "2025-08-17T13:00:57Z"
  },
  {
    "title": "Trump baked in Alaska: He grovels — worse yet, it’s bad TV",
    "description": "Trump gave Putin everything and got nothing back — but that's not why the media felt so betrayed",
    "link": "https://www.salon.com/2025/08/17/trump-baked-in-alaska-he-grovels-worse-yet-its-bad-tv/",
    "timestamp": "2025-08-17T13:00:16Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for White House meeting with Trump (Associated Press)",
    "description": "Associated Press:\nEuropean leaders to join Ukraine's Zelenskyy for White House meeting with Trump  —  European and NATO leaders announced Sunday that they'll be joining President Volodymyr Zelenskyy in Washington for crucial talks with President Donald Trump,…",
    "link": "https://www.memeorandum.com/250817/p8",
    "timestamp": "2025-08-17T13:00:05Z"
  },
  {
    "title": "Trump Looking To Blame His Failed Putin Summit On Zelensky",
    "description": "Donald Trump boasted he would end the war on his first day in office, but he couldn’t broker even a cease fire with Russia on his 208th day. That’s despite rolling out the red carpet for and applauding Russian President Vladimir Putin in Alaska.\nSo what’s a l…",
    "link": "https://crooksandliars.com/2025/08/trump-looking-blame-his-failed-putin",
    "timestamp": "2025-08-17T13:00:01Z"
  },
  {
    "title": "How Bankers Effectively Saved (and Warped) New York City.",
    "description": "Jonathan Mahler’s new book, The Gods of New York describes a pivotal four years in New York City’s history.",
    "link": "https://slate.com/culture/2025/08/books-jonathan-mahlers-the-gods-of-new-york-describes-how-bankers-played-a-role-in-changing-new-york-city.html",
    "timestamp": "2025-08-17T13:00:00Z"
  },
  {
    "title": "Shooting the Messenger: How Trump Blamed the Bureau of Labor Statistics for Weak Job Creation",
    "description": "The Bureau of Labor Statistics’ (BLS) monthly employment reports are among the most closely watched economic data releases in the United States, offering crucial insight into the nation’s economic health. The July 2025 report, however, made headlines for reas…",
    "link": "https://www.fairobserver.com/politics/shooting-the-messenger-how-trump-blamed-the-bureau-of-labor-statistics-for-weak-job-creation/",
    "timestamp": "2025-08-17T12:59:19Z"
  },
  {
    "title": "Ukraine’s European backers ‘in panic’ after Alaska summit – Putin envoy",
    "description": "The leaders of France, Germany, and Britain plan to back Zelensky in talks with Trump, according to reports Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623110-eu-uk-ukraine-dmitriev/",
    "timestamp": "2025-08-17T12:59:11Z"
  },
  {
    "title": "From Minnesota to the US Capitol: Tracing the Threat of Christian Nationalism",
    "description": "It’s easy to look at Vance Boelter, who pleaded not guilty to federal charges for murdering a Minnesota state representative and her husband, and think of him as a deeply unwell individual who took out his personal anger and frustration on civil servants. But…",
    "link": "https://www.commondreams.org/opinion/christian-nationalism-threat",
    "timestamp": "2025-08-17T12:50:02Z"
  },
  {
    "title": "Keir Starmer to join European leaders for Zelenskyy-Trump meeting at White House on Monday - live (The Guardian)",
    "description": "The Guardian:\nKeir Starmer to join European leaders for Zelenskyy-Trump meeting at White House on Monday - live  —  UK prime minister, French president and German chancellor among leaders meeting Donald Trump on Monday after Ukrainian president's request  —  …",
    "link": "https://www.memeorandum.com/250817/p6",
    "timestamp": "2025-08-17T12:50:00Z"
  },
  {
    "title": "European leaders to join Ukraine’s Zelenskyy for White House meeting with Trump",
    "description": "European leaders from Germany, France and Britain say they will accompany Volodymyr Zelenskyy to meet Donald Trump in Washington.",
    "link": "https://www.abc.net.au/news/2025-08-17/european-leaders-to-join-zelenskyy-white-house-trump/105664924",
    "timestamp": "2025-08-17T12:49:53Z"
  },
  {
    "title": "'It's bigger': Ex-Trump official reveals president's 'ultimate goal' in Dem cities",
    "description": "Miles Taylor, a former Department of Homeland Security official who served in President Donald Trump's first term, asserted that the commander-in-chief was deploying the military in U.S. cities for \"power and leverage.\"During a Sunday appearance on MSNBC, Tay…",
    "link": "https://www.rawstory.com/miles-taylor-trump-goal/",
    "timestamp": "2025-08-17T12:48:57Z"
  },
  {
    "title": "Yikes / Donald Trump Frown",
    "description": "In a moment that could only be described as a perfect storm of awkwardness, former President Donald Trump’s expression during his meeting with Ukrainian Pr",
    "link": "https://knowyourmeme.com/memes/yikes-donald-trump-frown",
    "timestamp": "2025-08-17T12:46:54Z"
  },
  {
    "title": "FO° Exclusive: Trump’s Epstein Files Fiasco Worsens as Democrats Take Aim at the President",
    "description": "Fair Observer Founder, CEO & Editor-in-Chief Atul Singh and retired CIA Officer Glenn Carle discuss the political fallout surrounding the late sex trafficker Jeffrey Epstein and the scandal’s implications for US President Donald Trump. The scandal has re-ente…",
    "link": "https://www.fairobserver.com/world-news/fo-exclusive-trumps-epstein-files-fiasco-worsens-as-democrats-take-aim-at-the-president/",
    "timestamp": "2025-08-17T12:46:06Z"
  },
  {
    "title": "Vladimir Putin's Legs Filmed Twitching at Trump Summit Amid Rumors of Health Issues",
    "description": "Rumors about Vladimir Putin's declining health have been around for years ... and there might be some truth to the speculation if you caught the subtle clues during his high-stakes summit with President Donald Trump in Alaska. Video has surfaced…",
    "link": "https://www.tmz.com/2025/08/17/vladimir-putin-legs-donald-trump-summit-alaska-anchorage/",
    "timestamp": "2025-08-17T12:46:05Z"
  },
  {
    "title": "European leaders including Keir Starmer and Emmanuel Macron to join Zelensky in Washington for Trump summit after US President's Alaska showdown",
    "description": "European leaders have revealed they will join Ukraine President Volodymyr Zelensky when he meets Donald Trump for peace talks at the White House tomorrow. Sir Keir Starmer, European Commission president Ursula von der Leyen, German chancellor Friedrich Merz a…",
    "link": "https://freerepublic.com/focus/f-news/4335053/posts",
    "timestamp": "2025-08-17T12:45:06Z"
  },
  {
    "title": "Merz, von der Leyen to join Trump, Zelensky in DC",
    "description": "German Chancellor Friedrich Merz will attend the meeting of the presidents of the United States and Ukraine, Donald Trump and Volodymyr Zelensky, respectively, his government spokesperson announced on Sunday. Previously, European Commission President Ursula v…",
    "link": "https://freerepublic.com/focus/f-chat/4335052/posts",
    "timestamp": "2025-08-17T12:44:35Z"
  },
  {
    "title": "Cuban Has Resisted Presidential Run, but Says a Trump Third-Term Bid Could Draw Him Into the Race",
    "description": "Billionaire Mark Cuban has resisted calls to run for president, but recently said that any effort by President Donald Trump to seek a third term could drawn him into the race.\nWhat Happened: Cuban, who supported Kamala Harris in the 2024 election, has been sp…",
    "link": "https://biztoc.com/x/1190d861f4ddf5ce",
    "timestamp": "2025-08-17T12:39:02Z"
  },
  {
    "title": "Will Trump, Putin and Zelenskyy Agree to Trilateral Meeting?",
    "description": "Meet the Press moderator Kristen Welker joins NBC’s Joe Fryer on Sunday TODAY to discuss what it will take for a potential trilateral meeting between President Donald Trump, Russia’s Vladimir Putin and Ukraine’s Volodymyr Zelenskyy.",
    "link": "https://www.today.com/video/what-will-it-take-for-trump-putin-and-zelenskyy-to-meet-245158981979",
    "timestamp": "2025-08-17T12:35:09Z"
  },
  {
    "title": "Ukrainians React to Trump's Warm Welcome of Putin",
    "description": "In Kyiv, many Ukrainians are wondering why President Donald Trump gave such a warm reception to accused war criminal, Russia’s Vladimir Putin, who continues daily attacks against Ukraine. At the Kremlin on Sunday, Putin gave no indication he plans to stop his…",
    "link": "https://www.today.com/video/ukrainians-are-skeptical-of-putin-s-intentions-after-trump-meeting-245161541851",
    "timestamp": "2025-08-17T12:29:46Z"
  },
  {
    "title": "Nvidia and AMD’s ‘special treatment’ from Trump shakes up an already tangled global chip supply chain",
    "description": "Donald Trump’s decision to let Nvidia and AMD export AI processors to China in exchange for a cut of their sales will have repercussions far beyond the U.S.\nThe semiconductor supply chain is global, involving a wide array of non-U.S. companies, often based in…",
    "link": "https://biztoc.com/x/33e19e2d9f467359",
    "timestamp": "2025-08-17T12:27:54Z"
  },
  {
    "title": "European leaders to join Ukraine's Zelenskyy for White House meeting with Trump",
    "description": "European Commission President Ursula von der Leyen and NATO Secretary-General Mark Rutte are among those expected to attend.",
    "link": "https://www.npr.org/2025/08/17/nx-s1-5505319/european-leaders-zelenskyy-trump",
    "timestamp": "2025-08-17T12:26:28Z"
  },
  {
    "title": "Rutte, Macron, Meloni, Stubb also at DC summit",
    "description": "North Atlantic Treaty Organization (NATO) Secretary-General Mark Rutte, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, and Finnish head of state Alexander Stubb all confirmed on Sunday that they will attend the meetings of Donald Tru…",
    "link": "https://freerepublic.com/focus/f-chat/4335048/posts",
    "timestamp": "2025-08-17T12:26:08Z"
  },
  {
    "title": "Trump made direct financial demands during call with Swiss president",
    "description": "During the telephone call between Karin Keller-Sutter and Donald Trump on July 31, Trump demanded direct payments from Switzerland, according to the SonntagsBlick.",
    "link": "https://www.swissinfo.ch/eng/global-trade/trump-made-direct-financial-demands-during-call-with-swiss-president/89848570",
    "timestamp": "2025-08-17T12:26:01Z"
  },
  {
    "title": "US seeks shipbuilding expertise from South Korea and Japan to counter China",
    "description": "WASHINGTON (AP) — American lawmakers are using a trip to South Korea and Japan to explore how the United States can tap those allies’ shipbuilding expertise and capacity to help boost its own capabilities, which are dwarfed by those of China. Sens. Tammy Duck…",
    "link": "https://financialpost.com/pmn/us-seeks-shipbuilding-expertise-from-south-korea-and-japan-to-counter-china",
    "timestamp": "2025-08-17T12:20:06Z"
  },
  {
    "title": "Spike Lee Says Trump Would 'Think Twice' About Any Federal Move on New York City",
    "description": "Hollywood director Spike Lee has cautioned President Donald Trump against any federal move on Democrat-controlled New York City, speculating he would \"think twice\" about any such security intervention.\nThe post Spike Lee Says Trump Would ‘Think Twice’ About A…",
    "link": "https://www.breitbart.com/entertainment/2025/08/17/spike-lee-warns-trump-against-any-federal-move-on-new-york-city/",
    "timestamp": "2025-08-17T12:20:04Z"
  },
  {
    "title": "European leaders to join Zelensky for White House meeting with Trump",
    "description": "The remarkable move — with one European leader after another announcing that they’ll be at Zelensky’s side when he travels to the White House on Monday — was an apparent effort to ensure that the meeting goes better than the last one in February.",
    "link": "https://apnews.com/article/european-leaders-white-house-meeting-zelenskyy-trump-d7b082bae4136ef8932e16ac2d166303",
    "timestamp": "2025-08-17T12:18:22Z"
  },
  {
    "title": "Trump to Meet With Zelenskyy After Alaska Summit With Putin",
    "description": "Less than 72 hours after President Donald Trump welcomed Russian President Vladimir Putin to American soil, Ukraine’s President Volodymyr Zelenskyy will return to the United States for a one-on-one meeting with Trump at the White House where they meet earlier…",
    "link": "https://www.today.com/video/trump-to-meet-with-zelenskyy-after-alaska-summit-with-putin-245163077752",
    "timestamp": "2025-08-17T12:17:25Z"
  },
  {
    "title": "‘Cannot follow unlawful orders’: Rising punitive measures against U.S. military service members for objecting to flu shot",
    "description": "'President Trump and Defense Secretary Hegseth are giving the illusion that they are trying to make it right'",
    "link": "https://www.wnd.com/2025/08/cannot-follow-unlawful-orders-rising-punitive-measures-against/",
    "timestamp": "2025-08-17T12:15:27Z"
  },
  {
    "title": "Crowds in DC continue to protest Trump’s federal police takeover",
    "description": "These protests come after President Donald Trump announced a federal police takeover on Monday, giving him control of the Metropolitan Police Department.",
    "link": "https://www.washingtonexaminer.com/news/3501012/crowds-in-dc-continue-to-protest-trump-police-takeover/",
    "timestamp": "2025-08-17T12:12:19Z"
  },
  {
    "title": "Diplomatic frenzy over Ukraine: von der Leyen, Starmer, Macron, Merz, and Meloni to join Trump–Zelensky meeting at the White House",
    "description": "Today in Brussels, Zelensky will attend a videoconference of the “Coalition of the Willing” – Meloni cut short her vacation – Also present in Washington will be Finland’s Stubb and NATO Secretary General Mark Rutte\nThe post Diplomatic frenzy over Ukraine: von…",
    "link": "https://en.protothema.gr/2025/08/17/diplomatic-frenzy-over-ukraine-von-der-leyen-starmer-macron-merz-and-meloni-to-join-trump-zelensky-meeting-at-the-white-house/",
    "timestamp": "2025-08-17T12:08:05Z"
  },
  {
    "title": "Number of European leaders to join Zelenskyy in the White House tomorrow",
    "description": "The meeting follows US President Donald Trump’s summit with Russian leader Vladimir Putin in Alaska on Friday.",
    "link": "https://www.thejournal.ie/european-leaders-to-join-zelenskyy-white-house-6792543-Aug2025/",
    "timestamp": "2025-08-17T12:07:33Z"
  },
  {
    "title": "European Leaders To Join Ukraine's Zelenskyy For White House Meeting With Trump",
    "description": "European leaders will join Ukraine’s Zelenskyy for his crucial meeting with Trump, European Commission President Ursula von der Leyen said on Sunday.",
    "link": "https://www.huffpost.com/entry/ap-eu-ukraine-trump-european-leaders_n_68a1c4fae4b0afaa349bd447",
    "timestamp": "2025-08-17T12:06:07Z"
  },
  {
    "title": "Trump administration cares more about son’s death than DC Council, mother of slain GOP intern says",
    "description": "The mother of slain congressional intern Eric Tarpinian-Jachym says the Trump administration appears to be taking her son's death more seriously than the D.C. Council.",
    "link": "https://www.foxnews.com/us/trump-administration-cares-more-about-sons-death-than-dc-council-says-mother-slain-gop-intern",
    "timestamp": "2025-08-17T12:00:47Z"
  },
  {
    "title": "Spanish Vox Party Promoting Rightwing Policies and Helping Fight Socialism in Latin America",
    "description": "Spanish Vox party is helping clean Latin America of the plague of Socialism.\nThe post Spanish Vox Party Promoting Rightwing Policies and Helping Fight Socialism in Latin America appeared first on The Gateway Pundit.",
    "link": "https://www.thegatewaypundit.com/2025/08/spanish-vox-party-promoting-rightwing-policies-helping-fight/",
    "timestamp": "2025-08-17T12:00:24Z"
  },
  {
    "title": "Palantir is Colorado’s highest-valued company — and at center of controversy — five years after move to Denver",
    "description": "Denver-based Palantir has worked with ICE and U.S. and Israeli militaries. \"This is why they've also come under scrutiny and controversy -- because of what kind of data the government has in its possession.\"",
    "link": "https://www.denverpost.com/2025/08/17/palantir-denver-headquarters-immigration-trump-administration/",
    "timestamp": "2025-08-17T12:00:19Z"
  },
  {
    "title": "RFK Jr. Weighs In On Possibility Of 2028 Presidential Bid",
    "description": "An organizing call by Kennedy's super PAC helped fuel the talk.",
    "link": "https://www.huffpost.com/entry/robert-f-kenned-jr-i-am-not-running-for-president-2028_n_68a1a491e4b07702299b4488",
    "timestamp": "2025-08-17T12:00:16Z"
  },
  {
    "title": "A day with the FBI: My perp walk, handcuffs, strip search and leg irons for a politically motivated misdemeanor",
    "description": "It is an interesting thing to suddenly lose one’s freedom. It would be very interesting on this day, June 3, 2022.  The first thing FBI agents do when they grab you is pull your arms behind you and put you in handcuffs. No matter how gently they might try to …",
    "link": "https://nypost.com/2025/08/17/us-news/a-day-with-the-fbi-my-perp-walk-handcuffs-strip-search-and-leg-irons-for-a-politically-motivated-misdemeanor/",
    "timestamp": "2025-08-17T12:00:00Z"
  },
  {
    "title": "As Trump Teases Marijuana Reclassification, Experts Warn of Health Threats",
    "description": "During a press conference Monday, President Donald Trump confirmed that his administration is considering rescheduling marijuana as a less potent drug under federal law, which... Read More\nThe post As Trump Teases Marijuana Reclassification, Experts Warn of H…",
    "link": "https://www.dailysignal.com/2025/08/17/as-trump-teases-marijuana-reclassification-experts-warn-of-health-threats/",
    "timestamp": "2025-08-17T12:00:00Z"
  },
  {
    "title": "Wall Street Journal Correspondent Delivers Brutal Summary of Trump-Putin Summit",
    "description": "WSJ chief foreign affairs correspondent Yaroslav Trofimov unloaded a scathing summary of Trump’s Alaska summit with Putin, mocking the president's pivot.\nThe post Wall Street Journal Correspondent Delivers Brutal Summary of Trump-Putin Summit first appeared o…",
    "link": "https://www.mediaite.com/media/news/wall-street-journal-correspondent-delivers-brutal-summary-of-trump-putin-summit/",
    "timestamp": "2025-08-17T11:59:51Z"
  }
]