[
  {
    "title": "Inspector shoots in leg of man fleeing after attacking two cops",
    "description": "CUDDALORE: A police inspector shot in the leg of a rowdy when he tried to escape after attacking two police constables with a sickle, inflicting bleed.",
    "link": "https://timesofindia.indiatimes.com/city/chennai/inspector-shoots-in-leg-of-man-fleeing-after-attacking-two-cops/articleshow/126619933.cms",
    "timestamp": "2026-01-17T15:45:18Z"
  },
  {
    "title": "DK Shivakumar skips Davos event aftermeeting Rahul Gandhi, triggers fresh buzz",
    "description": "Bengaluru: A day after meeting senior Congress leader Rahul Gandhi, Karnataka deputy chief minister DK Shivakumar has cancelled his scheduled visit to.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/dk-shivakumar-skips-davos-event-aftermeeting-rahul-gandhi-triggers-fresh-buzz/articleshow/126619856.cms",
    "timestamp": "2026-01-17T15:42:50Z"
  },
  {
    "title": "‘Grow a spine’: Critics erupt as Newsom retreats on calling ICE ‘terrorism’",
    "description": "Amid unprecedented backlash against US Immigration and Customs Enforcement, California Gov. Gavin Newsom—considered a leading contender for the 2028 Democratic presidential nomination—is being accused of giving the increasingly violent agency a pass after an …",
    "link": "https://www.rawstory.com/newsom-2674905000/",
    "timestamp": "2026-01-17T15:41:30Z"
  },
  {
    "title": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirl",
    "description": "Donald Trump Comes Clean About His Health: Everything He's Said So Far About His Well-Being as Dementia Rumors Swirlnewsbreak.com",
    "link": "https://www.newsbreak.com/share/4446547469992-donald-trump-comes-clean-about-his-health-everything-he-s-said-so-far-about-his-well-being-as-dementia-rumors-swirl?_f=app_share&amp;pd=0MOkRIuu&amp;lang=en_US&amp;send_time=1768664345&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.2.0.49%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-17T15:40:47Z"
  },
  {
    "title": "Swiss tourist reports mobile theft at Mumbai airport",
    "description": "Mumbai: A Swiss student reported that her mobile phone worth Rs 50,000 was stolen from her baggage soon after she landed at Mumbai International Airpo.",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/swiss-tourist-reports-mobile-theft-at-mumbai-airport/articleshow/126619753.cms",
    "timestamp": "2026-01-17T15:39:51Z"
  },
  {
    "title": "Trump Loads Up On $51 Million In Bonds As Markets Brace For Jerome Powell Showdown",
    "description": "President Donald Trump has aggressively expanded his personal bond portfolio, purchasing at least $51 million in debt securities between mid-November and...",
    "link": "https://finance.yahoo.com/news/trump-loads-51-million-bonds-153945630.html",
    "timestamp": "2026-01-17T15:39:45Z"
  },
  {
    "title": "Justice Department investigates Minnesota’s Walz and Frey, who call it a bullying tactic meant to threaten political opposition",
    "description": "“Two days ago it was Elissa Slotkin. Last week it was Jerome Powell. Before that, Mark Kelly. Weaponizing the justice system and threatening political opponents is a dangerous, authoritarian tactic.”",
    "link": "https://fortune.com/2026/01/17/justice-department-investigates-minnesotas-walz-and-frey-who-call-it-a-bullying-tactic-meant-to-threaten-political-opposition/",
    "timestamp": "2026-01-17T15:35:29Z"
  },
  {
    "title": "Led by Texas, New Hampshire, U.S. states race to prove they can put bitcoin on public balance sheet",
    "description": "Many U.S. states are planning bitcoin strategic reserves, and other forms of crypto financing, showing budgets are buying into the digital assets trend.",
    "link": "https://www.cnbc.com/2026/01/17/texas-us-states-budgets-bitcoin-crypto-strategic-reserve.html",
    "timestamp": "2026-01-17T15:35:04Z"
  },
  {
    "title": "American Farmers No Longer Feed The World",
    "description": "Peter Simons, Hamilton College\nPresident Donald Trump appears to have upended an 85-year relationship between American farmers and the United States’ global exercise of power. But that link has been fraying since the end of the Cold War, and Trump’s moves are…",
    "link": "https://crooksandliars.com/2026/01/american-farmers-no-longer-feed-world",
    "timestamp": "2026-01-17T15:34:43Z"
  },
  {
    "title": "I cannot ‘promise’ the US will remain in NATO – Stoltenberg",
    "description": "Former NATO Secretary General Jens Stoltenberg has said he cannot promise Washington will remain in the bloc Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631084-stoltenberg-us-nato-membership-doubts/",
    "timestamp": "2026-01-17T15:33:18Z"
  },
  {
    "title": "Here’s Why There Are More ICE Raids in Blue States",
    "description": "The Left is desperate to make lawful deportation in America a giant, impossible mess to deal with. According to a new media narrative, President Donald Trump and the... Read More\nThe post Here’s Why There Are More ICE Raids in Blue States appeared first on Th…",
    "link": "https://www.dailysignal.com/2026/01/17/heres-why-there-are-more-ice-raids-in-blue-states/",
    "timestamp": "2026-01-17T15:30:00Z"
  },
  {
    "title": "Five graphics that show Greenland’s importance to Trump",
    "description": "Its entire population would fit in a large sports stadium but Greenland’s current presence on the geopolitical stage is huge. DW takes a look at the reasons it's so coveted — from natural resources to climate change.",
    "link": "https://www.dw.com/en/five-graphics-that-show-greenlands-importance-to-trump/a-75547831",
    "timestamp": "2026-01-17T15:30:00Z"
  },
  {
    "title": "Democrat insider rips Mamdani bidet hopes for Gracie Mansion, cites Trump White House bathroom reno hypocrisy",
    "description": "New York City Mayor Zohran Mamdani looks to install bidets at Gracie Mansion, drawing comparisons to President Donald Trump's White House renovations.",
    "link": "https://www.foxnews.com/politics/democrat-insider-rips-mamdani-bidet-hopes-gracie-mansion-cites-trump-white-house-bathroom-reno-hypocrisy",
    "timestamp": "2026-01-17T15:28:42Z"
  },
  {
    "title": "What would Trump's use of the Insurrection Act look like in Minnesota?",
    "description": "Deploying the military in Minnesota would mark the first presidential use of the Insurrection Act since President George H.W. Bush during 1992 Los Angeles riots.",
    "link": "https://www.foxnews.com/politics/what-would-trumps-use-insurrection-act-look-like-minnesota",
    "timestamp": "2026-01-17T15:27:31Z"
  },
  {
    "title": "DAVID MARCUS: Secure border brings plummeting overdose deaths, but don't expect Trump to get credit",
    "description": "Drug overdose deaths reportedly dropped by 37,000 from 2022 peak under Trump administration policies, with border security allegedly playing a key role.",
    "link": "https://www.foxnews.com/opinion/david-marcus-secure-border-brings-plummeting-overdose-deaths-dont-expect-trump-get-credit",
    "timestamp": "2026-01-17T15:22:55Z"
  },
  {
    "title": "Biden-Appointed Judge Limits ICE Tactics To Avoid ‘Retaliating’ Against Minnesota Protestors",
    "description": "A Biden-appointed federal judge in Minnesota blocked immigration agents from using crowd control tools or \"retaliating\" against protesters in a Friday decision.",
    "link": "https://dailycaller.com/2026/01/17/joe-biden-appointed-federal-judge-limits-immigration-customs-enforcement-tactics-avoid-retaliating-minnesota-protestors/",
    "timestamp": "2026-01-17T15:22:35Z"
  },
  {
    "title": "Trump invites more leaders to join Gaza ‘Board of Peace’",
    "description": "US President Donald Trump’s so-called “Board of Peace” for postwar Gaza began to take shape Saturday, with the leaders of Egypt, Turkey, Argentina and Canada asked to join. The announcements from those leaders came after the US president named his Secretary o…",
    "link": "https://www.digitaljournal.com/world/trump-invites-more-leaders-to-join-gaza-board-of-peace/article",
    "timestamp": "2026-01-17T15:22:20Z"
  },
  {
    "title": "‘We can hunt’: Greenlanders weigh drastic options as US threatens",
    "description": "Ulrikke Andersen has already made a plan. If the United States invades Greenland, she will flee her home with her daughter.  “Before, I was ready to die for my country but when I had a kid that changed everything,” she told AFP. The 40-year-old is one of many…",
    "link": "https://www.digitaljournal.com/world/we-can-hunt-greenlanders-weigh-drastic-options-as-us-threatens/article",
    "timestamp": "2026-01-17T15:22:20Z"
  },
  {
    "title": "Harry Dunn Says Every Trump Rioter ‘Should’ve Been Shot Dead’ on Jan. 6 By DHS Logic In Renee Good Shooting",
    "description": "Harry Dunn said by the Trump administration's logic in the shooting of Renee Good , \"every one\" of the violent January 6 rioters \"should have been shot dead.\"\nThe post Harry Dunn Says Every Trump Rioter ‘Should’ve Been Shot Dead’ on Jan. 6 By DHS Logic In Ren…",
    "link": "https://www.mediaite.com/media/news/harry-dunn-says-every-trump-rioter-shouldve-been-shot-dead-on-jan-6-by-dhs-logic-in-renee-good-shooting/",
    "timestamp": "2026-01-17T15:20:43Z"
  },
  {
    "title": "Well, President Donald J. Trump finally has his Nobel Peace Prize. ... (Heather Cox Richardson/Letters ...)",
    "description": "Heather Cox Richardson / Letters from an American:\nWell, President Donald J. Trump finally has his Nobel Peace Prize.  Yesterday, in a visit to the White House, Venezuela opposition leader María Corina Machado presented Trump with the Nobel Peace Prize medal …",
    "link": "https://www.memeorandum.com/260117/p18",
    "timestamp": "2026-01-17T15:20:00Z"
  },
  {
    "title": "As Trump's Deadline For A Cap On Credit Card Rates Looms, Banks Have Only Questions",
    "description": "The White House has not provided any detail about what will happen to credit card companies that don’t lower card rates.",
    "link": "https://www.huffpost.com/entry/trumps-deadline-cap-credit-card-rates-banks-questions-no-answers_n_696ba54fe4b061d96a0cae2b",
    "timestamp": "2026-01-17T15:18:02Z"
  },
  {
    "title": "Trump, 79, Appears to Forget Name of Woman Who Just Gave Him Her Nobel Peace Prize (Jack Revell/The Daily Beast)",
    "description": "Jack Revell / The Daily Beast:\nTrump, 79, Appears to Forget Name of Woman Who Just Gave Him Her Nobel Peace Prize  —  THANKS... YOU  —  The president seemed to have difficulty recalling exactly who handed him the award he's been hankering after.  —  President…",
    "link": "https://www.memeorandum.com/260117/p17",
    "timestamp": "2026-01-17T15:15:00Z"
  },
  {
    "title": "Zelenskiy Says Russian Strikes Undermine Prospects for Dialogue",
    "description": "Constant airstrikes by Kremlin forces are undermining “even the small opportunities for dialogue” between Kyiv and Moscow, said President Volodymyr Zelenskiy.",
    "link": "https://financialpost.com/pmn/business-pmn/zelenskiy-says-russian-strikes-undermine-prospects-for-dialogue",
    "timestamp": "2026-01-17T15:14:56Z"
  },
  {
    "title": "Ted Sarandos says critics just misunderstand Netflix",
    "description": "Ted Sarandos defended Netflix’s $83 billion deal for Warner Bros Discovery’s film and TV assets, arguing it will boost theatrical releases, preserve jobs, and strengthen Hollywood despite backlash.",
    "link": "https://economictimes.indiatimes.com/tech/technology/ted-sarandos-says-critics-just-misunderstand-netflix/articleshow/126618857.cms",
    "timestamp": "2026-01-17T15:10:59Z"
  },
  {
    "title": "Carney Drafts New Auto Plan to Favor Firms With Canadian Plants",
    "description": "The Canadian government is drafting a new automotive strategy that will give better market access to companies that build vehicles in the country, a move that fires back at the Trump administration’s attempts to get automakers to move factories to the US from…",
    "link": "https://financialpost.com/pmn/business-pmn/carney-drafts-new-auto-plan-to-favor-firms-with-canadian-plants",
    "timestamp": "2026-01-17T15:09:50Z"
  },
  {
    "title": "Trump asks Turkiye’s Erdogan, Egypt’s el-Sisi to join Gaza ‘Board of Peace’",
    "description": "The board will supervise the temporary governance of Gaza, which has been under a fragile ceasefire since October.",
    "link": "https://www.aljazeera.com/news/2026/1/17/trump-asks-turkiyes-erdogan-egypts-el-sisi-to-join-gaza-board-of",
    "timestamp": "2026-01-17T15:08:16Z"
  },
  {
    "title": "Piers Morgan Grills Pink Floyd Rocker Defending Dictators While Slamming ‘Demented’ Trump",
    "description": "Piers Morgan and Pink Floyd's Roger Waters clashed in a heated battle over the musician's defenses of foreign dictators and criticism of President Donald Trump.\nThe post Piers Morgan Grills Pink Floyd Rocker Defending Dictators While Slamming ‘Demented’ Trump…",
    "link": "https://www.mediaite.com/media/podcasts/piers-morgan-grills-pink-floyd-rocker-defending-dictators-while-slamming-demented-trump/",
    "timestamp": "2026-01-17T15:06:34Z"
  },
  {
    "title": "Trump's Gaza board of peace brings Tony Blair back into the spotlight",
    "description": "Since stepping down as British prime minister in 2007, Tony Blair has pushed back at accusations of war crimes over his country's invasion of Iraq.",
    "link": "https://www.nbcnews.com/world/gaza/trumps-gaza-board-peace-brings-tony-blair-back-spotlight-rcna254522",
    "timestamp": "2026-01-17T15:04:01Z"
  },
  {
    "title": "As Trump's deadline for a credit card rate cap looms, banks have only questions",
    "description": "Trump has demanded a 10% cap on credit card interest rates by Jan. 20.",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-deadline-cap-credit-card-rates-looms-banks-129306487",
    "timestamp": "2026-01-17T15:03:31Z"
  },
  {
    "title": "Slow learners",
    "description": "Last night I read the Politico piece about Bari Weiss’s UATX grift that Scott wrote about with a level of slack-jawed wonder that ended up resembling an anaconda about to swallow a full-grown capybara. I’ll have a lot more to say about that shortly, but for n…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/01/slow-learners",
    "timestamp": "2026-01-17T15:02:40Z"
  },
  {
    "title": "US names Rubio, Blair, Kushner to Gaza board",
    "description": "US President Donald Trump has tapped Secretary of State Marco Rubio and former British prime minister Tony Blair as founding members of the Gaza \"board of peace\".",
    "link": "https://www.rte.ie/news/2026/0117/1553642-israel-gaza/",
    "timestamp": "2026-01-17T15:01:26Z"
  },
  {
    "title": "Ethiopia dam: Egypt, Sudan welcome Trump mediation",
    "description": "The leaders of Egypt and Sudan both welcome US president's offer to mediate in the Nile dam dispute with Ethiopia.",
    "link": "https://www.dw.com/en/ethiopia-dam-egypt-sudan-welcome-trump-mediation/a-75547719",
    "timestamp": "2026-01-17T15:01:00Z"
  },
  {
    "title": "No, Trump can’t cancel the midterms. He’s doing this instead",
    "description": "Worried about losing unified Republican power in Washington and mystified at his lack of support among the public, President Donald Trump keeps talking about...",
    "link": "https://www.cnn.com/2026/01/17/politics/midterm-elections-trump-2026-analysis",
    "timestamp": "2026-01-17T15:00:58Z"
  },
  {
    "title": "Former U.S. ambassador to Holy See weighs in on Vatican diplomacy in Venezuela, U.S.",
    "description": "Former United States Ambassador to the Holy See Francis Rooney speaks to “EWTN News Nightly” anchor Catherine Hadro on Monday, May 12, 2025. | Credit: “EWTN News Nightly”/Screenshot\n\nJan 17, 2026 / 10:00 am (CNA).\nFrancis Rooney, former U.S. ambassador to the…",
    "link": "https://www.catholicnewsagency.com/news/269147/former-us-ambassador-to-holy-see-weighs-in-on-vatican-diplomacy-in-venezuela-us",
    "timestamp": "2026-01-17T15:00:00Z"
  },
  {
    "title": "‘Is he planning a lingerie show?’ Recent Trump purchase turns heads",
    "description": "A new financial disclosure report\r\n filed this week revealed that President Donald Trump purchased between $250,000 and $500,000 in bonds in the lingerie retailer Victoria’s Secret, a purchase that stunned onlookers and sparked online speculation.“Is he plann…",
    "link": "https://www.rawstory.com/trump-2674905024/",
    "timestamp": "2026-01-17T14:59:55Z"
  },
  {
    "title": "Meet The New Weapon-Making Kids On The Block Under Hegseth’s Watch",
    "description": "LONG BEACH, Calif. — President Donald Trump’s Department of War is betting big on a “new-guard” of weapons manufacturers in his push to expand domestic defense production.  After decades of legacy suppliers dominating Pentagon contracts, Secretary of War Pete…",
    "link": "https://dailycaller.com/2026/01/17/weapons-manufacturing-new-guard-pete-hegseth/",
    "timestamp": "2026-01-17T14:59:43Z"
  },
  {
    "title": "'We can hunt': Greenlanders weigh drastic options as US threatens",
    "description": "Greenland residents are contemplating drastic measures amid US President Trump's expressed desire to acquire the island. Ulrikke Andersen plans to flee with her daughter if an invasion occurs, while others are stocking supplies. Despite authorities offering n…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/we-can-hunt-greenlanders-weigh-drastic-options-as-us-threatens/articleshow/126618598.cms",
    "timestamp": "2026-01-17T14:58:10Z"
  },
  {
    "title": "WATCH: DHS Adopts Abbott's Strategy, Deploying 500+ Miles of Federal Buoy Barriers Along Texas-Mexico Border",
    "description": "The Department of Homeland Security began installing a massive 500‑mile network of floating buoy barriers along the U.S.–Mexico border, a move that mirrors the deterrence strategy first deployed by Texas under Governor Greg Abbott as part of Operation Lone St…",
    "link": "https://www.breitbart.com/border/2026/01/17/watch-dhs-adopts-abbotts-strategy-deploying-500-miles-federal-buoy-barriers-along-the-border/",
    "timestamp": "2026-01-17T14:56:36Z"
  },
  {
    "title": "China ‘more predictable’ than US – Canadian PM",
    "description": "US President Donald Trump has said that he is “OK” with the rapprochement between China and Canada Read Full Article at RT.com",
    "link": "https://www.rt.com/news/631082-canada-china-us-trump/",
    "timestamp": "2026-01-17T14:55:22Z"
  },
  {
    "title": "Meet The Judge Who Was Trump’s Biggest Legal Nemesis In His First Year",
    "description": "One judge clashed most frequently with the president on central policy issues this year.",
    "link": "https://dailycaller.com/2026/01/17/judge-beryl-howell-donald-trump-legal-nemesis/",
    "timestamp": "2026-01-17T14:54:31Z"
  },
  {
    "title": "Trump’s economic plans are starting to pay off — so now’s not the time to bail on them",
    "description": "President Trump seems to be changing tack on his economic approach, but that's a bad idea.",
    "link": "https://nypost.com/2026/01/17/opinion/trumps-economic-plans-are-starting-to-pay-off-nows-not-the-time-to-bail-on-them/",
    "timestamp": "2026-01-17T14:50:53Z"
  },
  {
    "title": "Trump Is Pushing Gas to Power AI Boom, But Building Plants Take Years",
    "description": "To speed the construction of new energy plants, the Trump administration called for an emergency power auction. They favor gas, coal and nuclear.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-is-pushing-gas-to-power-ai-boom-but-building-plants-take-years",
    "timestamp": "2026-01-17T14:49:35Z"
  },
  {
    "title": "The outrageous amount of money Indiana and Miami fans are willing to pay for National Championship",
    "description": "The College Football Playoff National Championship between Indiana and Miami isn&apos;t just making history on the field - it&apos;s also shattering financial records off it. With",
    "link": "https://www.marca.com/en/ncaa/2026/01/17/696b9d8b268e3ebc528b45ac.html",
    "timestamp": "2026-01-17T14:49:06Z"
  },
  {
    "title": "Trump says $50B rural health plan funded by cutting Medicaid 'waste, fraud and abuse' - NewsBreak",
    "description": "President Donald Trump announced a $50 billion increase in rural healthcare funding, claiming savings from cutting Medicaid waste will revitalize hospitals",
    "link": "https://www.newsbreak.com/share/4445934188608-trump-says-50b-rural-health-plan-funded-by-cutting-medicaid-waste-fraud-and-abuse?s=a2&amp;share_destination_id=MTE0OTU1MjAtMTc2ODY2MTEyODQ1Nw%3D%3D&amp;pd=00mEVcuH&amp;hl=en_US&amp;send_time=1768661128&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2226.2.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-17T14:48:46Z"
  },
  {
    "title": "Jeb Bush heaps praise on Trump’s ‘unprecedented support’ for Iranians 10 years after heated primary",
    "description": "Jeb Bush praises Trump's 'historic leadership' on Iran policy, marking a shift from their bitter 2016 rivalry when Trump dubbed him 'Low Energy Jeb.'",
    "link": "https://www.foxnews.com/politics/jeb-bush-heaps-praise-trumps-unprecedented-support-iranians-10-years-after-raucous-primary",
    "timestamp": "2026-01-17T14:44:38Z"
  },
  {
    "title": "Philadelphia’s threat to prosecute ICE could trigger landmark court fight over authority, experts warn",
    "description": "The Department of Homeland Security, the Justice Department and legal scholars laid out what could happen if Philadelphia District Attorney Larry Krasner follows through on his promise to prosecute ICE in the line of their duty, should operations in Pennsylva…",
    "link": "https://freerepublic.com/focus/f-chat/4362593/posts",
    "timestamp": "2026-01-17T14:42:40Z"
  },
  {
    "title": "Trump's Takeover Threat Sparks Protests In Denmark Supporting Greenland",
    "description": "Some 17,000 Greenlanders live in Denmark, according to Danish authorities.",
    "link": "https://www.huffpost.com/entry/denmark-greenland-protests-trump_n_696b9c99e4b0c97f839ea54f",
    "timestamp": "2026-01-17T14:39:14Z"
  },
  {
    "title": "Egypt welcomes Trump's offer to mediate Nile River water dispute with Ethiopia",
    "description": "President Donald Trump's offer to settle a dispute over Nile River waters between Egypt and Ethiopia has drawn thanks from Egyptian President Abdel Fattah El-Sisi, as the two African nations continue their decades-long quarrel over water security",
    "link": "https://www.nbcnews.com/world/africa/egypt-welcomes-trump-offer-mediate-nile-river-water-dispute-ethiopia-rcna254533",
    "timestamp": "2026-01-17T14:38:51Z"
  },
  {
    "title": "Climate activist predicts high electricity prices and Trump's attacks on green energy will hurt GOP",
    "description": "Longtime climate activist Bill McKibben finds hope in solar energy despite the Trump administration rolling back environmental regulations and freezing offshore wind projects",
    "link": "https://abcnews.go.com/Business/wireStory/climate-activist-predicts-high-electricity-prices-trumps-attacks-129306663",
    "timestamp": "2026-01-17T14:37:51Z"
  },
  {
    "title": "Iran's leader Khamenei blames Trump for inciting deadly protests",
    "description": "DUBAI: Iran's Supreme Leader Ayatollah Ali Khamenei on Saturday (Jan 17) blamed President Donald Trump for weeks of protests after rights groups said a violent crackdown by security forces ⁠had claimed thous",
    "link": "https://www.channelnewsasia.com/world/iran-khamenei-blame-trump-incite-protests-us-5865761",
    "timestamp": "2026-01-17T14:34:03Z"
  },
  {
    "title": "Iranian leader acknowledges ‘thousands’ killed in anti-government protests",
    "description": "Ayatollah Ali Khamenei said US president Donald Trump was culpable for ‘deaths’ and ‘damage’ in the Islamic Republic",
    "link": "https://www.irishtimes.com/world/middle-east/2026/01/17/iranian-leader-acknowledges-thousands-killed-in-anti-government-protests/",
    "timestamp": "2026-01-17T14:32:51Z"
  },
  {
    "title": "Iran at the breaking point: What’s next?",
    "description": "War correspondent Scott Anderson on the country's protests, the revolution's legacy and what a deal could mean",
    "link": "https://www.salon.com/2026/01/17/iran-at-the-breaking-point-whats-next/",
    "timestamp": "2026-01-17T14:31:25Z"
  },
  {
    "title": "Always Campaign Like We're Ten Points Behind",
    "description": "With public opinion sour on President Donald Trump, this year’s midterm environment is swinging further toward Democrats, with the Cook Political Report on Thursday saying that Democrats are now the favorite to win control of the House.\nThe political handicap…",
    "link": "https://crooksandliars.com/2026/01/always-campaign-were-ten-points-behind",
    "timestamp": "2026-01-17T14:30:01Z"
  },
  {
    "title": "Trump Drops Bold Boasts Declaring Himself ‘King’ — Of His Most Unpopular Policy",
    "description": "Trump dropped a pair of bold-faced boasts among his flurry of social media posts on Friday night dclaring himself the \"king\" of his most unpopular policy.\nThe post Trump Drops Bold Boasts Declaring Himself ‘King’ — Of His Most Unpopular Policy first appeared …",
    "link": "https://www.mediaite.com/media/news/trump-drops-bold-boasts-declaring-himself-king-of-his-most-unpopular-policy/",
    "timestamp": "2026-01-17T14:28:15Z"
  },
  {
    "title": "Supreme Court is set to rule on constitutionality of Trump tariffs – but not their wisdom",
    "description": "Justices are currently looking at whether Trump’s tariffs are constitutional. But that ruling won’t shed any light on whether they are wise.",
    "link": "https://theconversation.com/supreme-court-is-set-to-rule-on-constitutionality-of-trump-tariffs-but-not-their-wisdom-273092",
    "timestamp": "2026-01-17T14:26:28Z"
  },
  {
    "title": "US congressional delegation seeks to reassure Denmark and Greenland after Trump's threats",
    "description": "A US congressional delegation visited Denmark and Greenland to ease tensions. President Trump threatened tariffs if Denmark did not agree to a US takeover of Greenland. The delegation leader stated the US respects Denmark and NATO. Protests against the US int…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-congressional-delegation-seeks-to-reassure-denmark-and-greenland-after-trumps-threats/articleshow/126617756.cms",
    "timestamp": "2026-01-17T14:24:04Z"
  },
  {
    "title": "Here's where Trump's most jaw-dropping promises stand a year into his second term",
    "description": "Some of his ideas that once seemed implausible, if not outright fanciful, are now reality. But there are other things that Trump could not deliver on.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/heres-where-trumps-most-jaw-dropping-promises-stand-a-year-into-his-second-term/articleshow/126617534.cms",
    "timestamp": "2026-01-17T14:22:17Z"
  },
  {
    "title": "Backlash after Trump threatens tariffs over Greenland purchase",
    "description": "The threat of a 10% tariff by the US president has been called \"completely wrong\" by Sir Keir Starmer. Meanwhile, rallies in support of Greenland have been held across the Danish kingdom.",
    "link": "https://news.sky.com/story/backlash-after-trump-threatens-tariffs-over-greenland-purchase-13495339",
    "timestamp": "2026-01-17T14:22:00Z"
  },
  {
    "title": "U.S district judge Kate Menendez restricts ICE protest tactics in Minneapolis amid unrest",
    "description": "A federal judge has stepped in to control immigration agents' actions during protests in Minneapolis. This ruling follows weeks of unrest linked to aggressive immigration enforcement. Demonstrations intensified after a fatal shooting involving an ICE agent. T…",
    "link": "https://economictimes.indiatimes.com/news/international/us/u-s-district-judge-kate-menendez-restricts-ice-protest-tactics-in-minneapolis-amid-unrest/articleshow/126616835.cms",
    "timestamp": "2026-01-17T14:17:05Z"
  },
  {
    "title": "Trump Taps Former British PM Tony Blair for Key Role in Gaza",
    "description": "US President Donald Trump on Friday gave a key role in post-war Gaza to former British Prime Minister Tony Blair and appointed a US officer to lead a nascent security force.\nThe post Trump Taps Former British PM Tony Blair for Key Role in Gaza appeared first …",
    "link": "https://www.breitbart.com/europe/2026/01/17/trump-taps-former-british-pm-tony-blair-for-key-role-in-gaza/",
    "timestamp": "2026-01-17T14:15:15Z"
  },
  {
    "title": "New York Federal Reserve Gave Wall Street Over $420 Billion in the Past 7 Months",
    "description": "Massive, unprecedented payouts with few strings attached could signal that big banks are seriously short on cash.",
    "link": "https://www.levernews.com/the-federal-reserves-420-billion-wall-street-bailout/",
    "timestamp": "2026-01-17T14:11:35Z"
  },
  {
    "title": "Keep up the pressure on state voter roll purges",
    "description": "In a victory for the Trump administration, Oregon Secretary of State Tobias Read announced last week that the state will resume “routine cleanup” of outdated voter registration records, a process dormant since 2017. The effort could ultimately cancel up to 80…",
    "link": "https://freerepublic.com/focus/f-chat/4362588/posts",
    "timestamp": "2026-01-17T14:10:20Z"
  },
  {
    "title": "Iran’s leader calls Trump a ‘criminal’ for backing protests and blames demonstrators for deaths",
    "description": "DUBAI, United Arab Emirates (AP) — Iran’s Supreme Leader Ayatollah Ali Khamenei on Saturday branded U.S. President Donald Trump a “criminal” for supporting protesters in<a class=\"excerpt-read-more\" href=\"https://whdh.com/news/irans-leader-calls-trump-a-crimin…",
    "link": "https://whdh.com/news/irans-leader-calls-trump-a-criminal-for-backing-protests-and-blames-demonstrators-for-deaths/",
    "timestamp": "2026-01-17T14:02:32Z"
  },
  {
    "title": "U.S. congressional delegation seeks to reassure Denmark, Greenland after Trump’s threats",
    "description": "A bipartisan U.S. congressional delegation on Saturday sought to reassure Denmark and Greenland of their support following President Donald Trump’s threat to punish countries with tariffs if they don’t back the U.S. taking over the strategic Arctic island.",
    "link": "https://www.cbc.ca/news/world/denmark-greenland-trump-us-9.7049902",
    "timestamp": "2026-01-17T14:00:22Z"
  },
  {
    "title": "Trump on Why He Kept Peace Prize From Venezuela's Machado",
    "description": "President Donald Trump is explaining why he accepted the Nobel Peace Prize medal that he didn’t win after it was gifted to him from Venezuela’s opposition leader María Corina Machado at the White House. The Nobel Institute has said that while the medal can ch…",
    "link": "https://www.today.com/video/trump-shares-why-he-kept-machado-s-nobel-peace-prize-medal-256144453550",
    "timestamp": "2026-01-17T14:00:04Z"
  },
  {
    "title": "Yes, Ted Cruz said in 2016 that Trump 'would have nuked Denmark'",
    "description": "In 2016, U.S. Sen. Ted Cruz of Texas, then a Republican presidential candidate, said, \"We're liable to wake up one morning and Donald, if he were president, would have nuked Denmark.\"",
    "link": "https://www.snopes.com//fact-check/ted-cruz-trump-nuke-denmark/",
    "timestamp": "2026-01-17T14:00:00Z"
  },
  {
    "title": "The weak business case for Trump acquiring Greenland: a $1 trillion price tag and few returns for two decades",
    "description": "An annexation of Greenland would be the largest geographic acquisition in U.S. history—but financial rewards would be a long time coming.",
    "link": "https://fortune.com/2026/01/17/weak-business-case-trump-acquiring-greenland-spend-1-trillion-few-returns-decades/",
    "timestamp": "2026-01-17T14:00:00Z"
  },
  {
    "title": "Here's what ICE is really doing in Minneapolis — and it's not enforcing the law",
    "description": "This week, Mayor Jacob Frey basically took a Fox “News” host down, pointing out that Trump’s own federal prosecutors just quit their jobs rather than investigate and prosecute Renee Nicole Good’s wife for “domestic terrorism.”Which raises the question: what i…",
    "link": "https://www.rawstory.com/raw-investigates/2674898364/",
    "timestamp": "2026-01-17T13:58:41Z"
  },
  {
    "title": "Trump Says He May Impose Tariffs Amid Push for Greenland",
    "description": "In the streets of Denmark’s capital Copenhagen, anxiety is high among residents over President Donald Trump’s push to try and take over Greenland. It comes as the president said on Friday he may put a tariff on countries if they “don’t go along with Greenland…",
    "link": "https://www.today.com/video/anxiety-grows-in-greenland-and-denmark-amid-trump-s-threats-256144965670",
    "timestamp": "2026-01-17T13:57:04Z"
  },
  {
    "title": "Tiffany Cross Flips Out On Trump Fan In CNN Smackdown Over Pardons: ‘Idiotic Cult Regurgitation!’",
    "description": "Tiffany Cross flipped out on Trump defender Pete Seat in an epic brawl over President Donald Trump pardoning a convicted fraudster — for a second time.\nThe post Tiffany Cross Flips Out On Trump Fan In CNN Smackdown Over Pardons: ‘Idiotic Cult Regurgitation!’ …",
    "link": "https://www.mediaite.com/media/news/tiffany-cross-flips-out-on-trump-fan-in-cnn-smackdown-over-pardons-idiotic-cult-regurgitation/",
    "timestamp": "2026-01-17T13:50:56Z"
  },
  {
    "title": "Iran's Leader Calls Trump A 'Criminal' For Backing Protesters",
    "description": "In recent days, Trump had told protesting Iranians that “help is on the way” and that his administration would “act accordingly” if the killing of demonstrators continued.",
    "link": "https://www.huffpost.com/entry/irans-leader-calls-trump-criminal-backing-protesters_n_696b915ae4b0c97f839ea47f",
    "timestamp": "2026-01-17T13:50:01Z"
  },
  {
    "title": "How abortion coverage threatens to prevent a congressional deal on health care subsidies",
    "description": "There's broad bipartisan support in Congress for reviving federal health care subsidies that expired at the beginning of the year",
    "link": "https://abcnews.go.com/US/wireStory/abortion-coverage-threatens-prevent-congressional-deal-health-care-129306295",
    "timestamp": "2026-01-17T13:49:18Z"
  },
  {
    "title": "Iran's leader Khamenei blames Trump for inciting deadly protests",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei has labelled Donald Trump a criminal, blaming him for the deaths of thousands of demonstrators and security forces.",
    "link": "https://www.abc.net.au/news/2026-01-18/irans-leader-blames-trump-for-inciting-deadly-protests/106241068",
    "timestamp": "2026-01-17T13:46:27Z"
  },
  {
    "title": "America Is Slow-Walking Into a Polymarket Disaster",
    "description": "Why is the media obsessed with prediction markets?",
    "link": "https://www.theatlantic.com/technology/2026/01/america-polymarket-disaster/685662/",
    "timestamp": "2026-01-17T13:42:10Z"
  },
  {
    "title": "Here's where Trump's most jaw-dropping promises stand a year into his second term",
    "description": "President Donald Trump has made lots of promises during the first year of his second term in the White House",
    "link": "https://abcnews.go.com/US/wireStory/trumps-jaw-dropping-promises-stand-year-term-129306198",
    "timestamp": "2026-01-17T13:41:42Z"
  },
  {
    "title": "Greenland is not for sale: thousands take to the streets of Denmark",
    "description": "Chanting \"Greenland is not for sale\" and carrying banners saying \"Hands off Greenland\", thousands of people have marched in Denmark, responding to US President Donald Trump's ambitions to acquire the Artic island.",
    "link": "https://www.abc.net.au/news/2026-01-18/denmark-protests-greenland-not-for-sale-response-trump-threats/106241056",
    "timestamp": "2026-01-17T13:41:40Z"
  },
  {
    "title": "When Texas Republican John Cornyn became a senator, Bush was president. Will he survive Trump’s GOP?",
    "description": "Sen. John Cornyn stood in the shadow of the U.S.-Mexico border wall for a campaign event, but the Texas Republican didn’t offer the kind of diatribe about illegal immigration that stokes his party’s core and fueled Donald Trump’s rise to the White House. Inst…",
    "link": "https://freerepublic.com/focus/f-chat/4362585/posts",
    "timestamp": "2026-01-17T13:41:00Z"
  },
  {
    "title": "Trump’s health care plan excludes those with preexisting conditions - NewsBreak",
    "description": "Trump is rolling out what he's calling the \"Great Healthcare Plan,\" in efforts to make health care more affordable — but not everyone is included.",
    "link": "https://www.newsbreak.com/share/4445281642154-trump-s-health-care-plan-excludes-those-with-preexisting-conditions?_f=app_share&amp;pd=0LZapAtY&amp;lang=en_US&amp;send_time=1768656700&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2226.1.1.6%22%2C%22languages%22%3A%22en%22%7D&amp;s=i2",
    "timestamp": "2026-01-17T13:38:09Z"
  },
  {
    "title": "WATCH: Machado’s daring escape from Venezuela to accept Nobel Peace prize caught on video",
    "description": "In the video, Venezuela's opposition leader is heard saying, “I am alive, I’m safe, and I’m very grateful.”",
    "link": "https://indianexpress.com/article/world/watch-machado-escape-from-venezuela-accept-nobel-peace-prize-video-10479754/",
    "timestamp": "2026-01-17T13:34:00Z"
  },
  {
    "title": "Democrats’ Best Hope To Rein In ICE Is Right Now",
    "description": "Even if it’s not by very much.",
    "link": "https://www.huffpost.com/entry/democrats-ice-dhs-funding-bill_n_6967f245e4b0b0607cf1c39f",
    "timestamp": "2026-01-17T13:29:17Z"
  },
  {
    "title": "The Czech Republic Shows Europe How It’s Done",
    "description": "While Brussels lectures and dithers, Prague acts: Babiš’s transactional diplomacy shows how a mid-sized nation can thrive by aligning interests in a Trump-era world. The Czech Republic is showing the rest of Europe how to prosper in an America First world. Th…",
    "link": "https://freerepublic.com/focus/f-chat/4362584/posts",
    "timestamp": "2026-01-17T13:28:39Z"
  },
  {
    "title": "Trump’s Greenland Demands Spark Protest Rallies Across Denmark",
    "description": "Thousands of people took to the streets across Denmark to protest US President Donald Trump’s ambitions to take control of Greenland, underscoring the deep unease over the future of the Arctic island.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-greenland-demands-spark-protest-rallies-across-denmark",
    "timestamp": "2026-01-17T13:28:03Z"
  },
  {
    "title": "Judge restricts federal officers' use of tear gas during protests in Minneapolis",
    "description": "A judge is restricting federal officers from using tear gas and other crowd control tactics on peaceful protesters who are not obstructing authorities in Minneapolis, where demonstrations against immigration enforcement persist.",
    "link": "https://www.wmur.com/article/judge-restricts-ice-tear-gas-protests-minneapolis/70029805",
    "timestamp": "2026-01-17T13:26:12Z"
  },
  {
    "title": "Judge restricts federal officers' use of tear gas during protests in Minneapolis",
    "description": "A judge is restricting federal officers from using tear gas and other crowd control tactics on peaceful protesters who are not obstructing authorities in Minneapolis, where demonstrations against immigration enforcement persist.",
    "link": "https://www.wcvb.com/article/judge-restricts-ice-tear-gas-protests-minneapolis/70029805",
    "timestamp": "2026-01-17T13:26:10Z"
  },
  {
    "title": "Judge restricts federal officers' use of tear gas during protests in Minneapolis",
    "description": "A judge is restricting federal officers from using tear gas and other crowd control tactics on peaceful protesters who are not obstructing authorities in Minneapolis, where demonstrations against immigration enforcement persist.",
    "link": "https://www.ketv.com/article/judge-restricts-ice-tear-gas-protests-minneapolis/70029805",
    "timestamp": "2026-01-17T13:26:02Z"
  },
  {
    "title": "Ukraine team arrives in US for Miami talks",
    "description": "Ukrainian negotiators arrived in the US for talks with President Donald Trump's envoy Steve Witkoff, son-in-law Jared Kushner and Army Secretary Daniel Driscoll on ending almost four years of war with Russia.",
    "link": "https://www.rte.ie/news/world/2026/0117/1553624-ukraine-us/",
    "timestamp": "2026-01-17T13:25:40Z"
  },
  {
    "title": "Ukraine team arrives in US for Miami talks",
    "description": "Ukrainian negotiators arrived in the US for talks with President Donald Trump's envoy Steve Witkoff, son-in-law Jared Kushner and Army Secretary Daniel Driscoll on ending almost four years of war with Russia.",
    "link": "https://www.rte.ie/news/ukraine/2026/0117/1553624-ukraine-us/",
    "timestamp": "2026-01-17T13:25:40Z"
  },
  {
    "title": "Judge restricts federal officers' use of tear gas during protests in Minneapolis",
    "description": "A judge is restricting federal officers from using tear gas and other crowd control tactics on peaceful protesters who are not obstructing authorities in Minneapolis, where demonstrations against immigration enforcement persist.",
    "link": "https://www.wbaltv.com/article/judge-restricts-ice-tear-gas-protests-minneapolis/70029805",
    "timestamp": "2026-01-17T13:23:54Z"
  },
  {
    "title": "Judge restricts federal officers' use of tear gas during protests in Minneapolis",
    "description": "A judge is restricting federal officers from using tear gas and other crowd control tactics on peaceful protesters who are not obstructing authorities in Minneapolis, where demonstrations against immigration enforcement persist.",
    "link": "https://www.wlwt.com/article/judge-restricts-ice-tear-gas-protests-minneapolis/70029805",
    "timestamp": "2026-01-17T13:23:45Z"
  },
  {
    "title": "Iran’s leader calls Donald Trump a ‘criminal’ for backing protests",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_ed6824fa-0274-47c2-8893-ee435a2203d8",
    "timestamp": "2026-01-17T13:23:35Z"
  },
  {
    "title": "The Trump Effect? Why Stars Like George Clooney And Courtney Love Quit The US",
    "description": "A number of Hollywood's elite moved out of the U.S. in 2025, with many citing the reelection of Donald Trump as the main reason for their departure...",
    "link": "https://finance.yahoo.com/news/trump-effect-why-stars-george-132148229.html",
    "timestamp": "2026-01-17T13:21:48Z"
  },
  {
    "title": "Democrats grapple with 'rising clamor' for Trump impeachment ahead of midterms (Benjamin Siegel/Associated Press)",
    "description": "Benjamin Siegel / Associated Press:\nDemocrats grapple with ‘rising clamor’ for Trump impeachment ahead of midterms  —  Many Democrats said they are instead focusing on cost of living and the economy.  —  President Donald Trump takes questions from reporters b…",
    "link": "https://www.memeorandum.com/260117/p10",
    "timestamp": "2026-01-17T13:20:01Z"
  }
]