[
  {
    "title": "Trump calls being president a 'very dangerous profession'",
    "description": "U.S. President Donald Trump on Friday reflected on threats to his life as he celebrated a court ruling that handed his administration sweeping power to pursue his policy agenda. Asked by a reporter about such threats, the Republican suggested that he is occas…",
    "link": "https://japantoday.com/category/world/trump-calls-being-president-a-%27very-dangerous-profession%27",
    "timestamp": "2025-06-27T20:53:17Z"
  },
  {
    "title": "'Very close to a final product': Senate GOP's version of Trump's megabill nears finish line",
    "description": "'Very close to a final product': Senate GOP's version of Trump's megabill nears finish linego.com",
    "link": "https://abcnews.go.com/Politics/close-final-product-senate-gops-version-trumps-megabill/story?id=123280087",
    "timestamp": "2025-06-27T20:53:11Z"
  },
  {
    "title": "Supreme Court in birthright case limits judges' power to block presidential policies",
    "description": "The U.S. Supreme Court handed President Donald Trump a major victory on Friday in a case involving birthright citizenship by curbing the ability of judges to impede his policies nationwide, changing the power balance between the federal judiciary and presiden…",
    "link": "https://japantoday.com/category/world/supreme-court-in-birthright-case-limits-judges%27-power-to-block-presidential-policies",
    "timestamp": "2025-06-27T20:52:59Z"
  },
  {
    "title": "Trump says he would consider bombing Iran again, drops sanctions relief plan",
    "description": "President Donald Trump sharply criticized Iran's Supreme Leader, Ali Khamanei, on Friday, dropped plans to lift sanctions on Iran and said he would consider bombing Iran again if Tehran is enriching uranium to worrisome levels. Trump reacted sternly to Khaman…",
    "link": "https://japantoday.com/category/world/trump-says-he-would-consider-bombing-iran-again-drops-sanctions-relief-plan",
    "timestamp": "2025-06-27T20:52:52Z"
  },
  {
    "title": "Sonia Sotomayor Puts It Clearly: None of Our Rights Are Safe",
    "description": "The high court has opened Pandora’s box.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-birthright-citizenship-sonia-sotomayor-dissent.html",
    "timestamp": "2025-06-27T20:52:51Z"
  },
  {
    "title": "Trump administration ends legal protections for half-million Haitians who now face deportations",
    "description": "DHS said Haitians no longer meet the conditions for the temporary legal protections.",
    "link": "https://www.bostonherald.com/2025/06/27/immigration-haiti-tps-ends/",
    "timestamp": "2025-06-27T20:51:45Z"
  },
  {
    "title": "Donald Trump Says He’s Ending Tarde Talks With Canada Over Digital Services Tax",
    "description": "Donald Trump said that he was ending trade talks with Canada over its digital services tax, which will impact major tech firms like Google, Meta and Amazon. Trump also said that he would hit Canada with a new tariff in the coming week. Trump wrote on Truth So…",
    "link": "http://deadline.com/2025/06/trump-canada-digital-services-tax-1236444817/",
    "timestamp": "2025-06-27T20:51:43Z"
  },
  {
    "title": "Why Was Joe Giudice Deported? Bravo Star Asks Trump for Pardon",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nReality star Joe Giudice, who was deported from the United States back to his native Italy in 2019 after being convicted on federal fraud charges asked President Donald Trump for a pardon on Thursday.\n\"Preside…",
    "link": "https://biztoc.com/x/00c2801a2ed2a590",
    "timestamp": "2025-06-27T20:50:58Z"
  },
  {
    "title": "Muslim American Congressmembers Call Out 'Vile' And 'Racist' Attacks On Zohran Mamdani",
    "description": "\"These hateful, Islamophobic, and racist tropes have become so entrenched and normalized in our politics,\" the group said. \"We know these attacks all too well.\"",
    "link": "https://www.huffpost.com/entry/muslim-american-congressmembers-call-out-vile-and-racist-attacks-on-zohran-mamdani_n_685eeeb4e4b015addf95e51e",
    "timestamp": "2025-06-27T20:50:46Z"
  },
  {
    "title": "How major US stock indexes fared Friday, 6/27/2025",
    "description": "U.S. stocks closed at an all-time high, another milestone in a remarkable recovery from a springtime plunge caused by fears that the Trump administration’s trade policies could harm the economy. The S&P 500 rose 0.5% and finished above its previous record set…",
    "link": "https://www.seattlepi.com/business/article/how-major-us-stock-indexes-fared-friday-6-27-2025-20397842.php",
    "timestamp": "2025-06-27T20:50:44Z"
  },
  {
    "title": "The Supreme Court Sides with Trump Against the Judiciary (Ruth Marcus/New Yorker)",
    "description": "Ruth Marcus / New Yorker:\nThe Supreme Court Sides with Trump Against the Judiciary  —  Its ruling lets the President temporarily revoke birthright citizenship—and enforce other unconstitutional executive orders without fear of being blocked by “rogue judges.”…",
    "link": "https://www.memeorandum.com/250627/p129",
    "timestamp": "2025-06-27T20:50:00Z"
  },
  {
    "title": "Why Was Joe Giudice Deported? Bravo Star Asks Trump for Pardon",
    "description": "Joe Giudice, who was deported after being convicted on federal fraud charges, asked President Donald Trump for a pardon.",
    "link": "https://www.newsweek.com/why-was-joe-giudice-deported-bravo-star-asks-trump-pardon-2091862",
    "timestamp": "2025-06-27T20:49:45Z"
  },
  {
    "title": "Congo and Rwanda sign a US-mediated peace deal aimed at ending decades of bloody conflict",
    "description": "The Democratic Republic of Congo and Rwanda on Friday signed a peace deal facilitated by the U.S. to help end the decades-long deadly fighting in eastern Congo while helping the U.S. government and American companies gain access to critical minerals in the re…",
    "link": "https://freerepublic.com/focus/f-news/4325698/posts",
    "timestamp": "2025-06-27T20:49:04Z"
  },
  {
    "title": "'Had enough!' MAGA businessman seeks to liberate Kentucky from 2 'McConnellites'",
    "description": "A wealthy MAGA-aligned businessman has entered the Kentucky Senate race to succeed Mitch McConnell, The New York Times reported on Friday. Nate Morris, CEO of waste and recycling company Rubicon, announced his candidacy on the \"Triggered\" podcast hosted by Pr…",
    "link": "https://www.rawstory.com/trump-2672466847/",
    "timestamp": "2025-06-27T20:49:01Z"
  },
  {
    "title": "Canadian PM says negotiations with U.S. \"complex\"",
    "description": "OTTAWA, June 27 (Xinhua) -- Canadian Prime Minister Mark Carney on Friday called the negotiations with the United States \"complex\" when he responded to the announcement of U.S. President Donald Trump to terminate all trade talks with Canada with potential new…",
    "link": "https://www.thestar.com.my/news/world/2025/06/28/canadian-pm-says-negotiations-with-us-complex",
    "timestamp": "2025-06-27T20:47:00Z"
  },
  {
    "title": "Newsom files $787 million suit against Fox over reporting on phone call with Trump",
    "description": "Earlier this month President Trump sent Fox News reporter John Roberts a screenshot of his phone call with Newsom after the California Governor said Trump never called him",
    "link": "https://www.wnd.com/2025/06/newsom-files-787-million-suit-against-fox-reporting/",
    "timestamp": "2025-06-27T20:46:59Z"
  },
  {
    "title": "Trump: I think we can get a Gaza ceasefire within a week",
    "description": "Speaking to reporters, President Trump says he believes a ceasefire in Gaza could be achieved within the next week.",
    "link": "https://www.israelnationalnews.com/news/410782",
    "timestamp": "2025-06-27T20:45:00Z"
  },
  {
    "title": "Report: Transgender Suspect in Missouri Tesla Firebombing May Spend 30 Years in Prison",
    "description": "The 19-year-old accused of firebombing a Tesla dealership in Kansas City, Missouri, is reportedly in danger of spending the next 30 years in prison.\nThe post Report: Transgender Suspect in Missouri Tesla Firebombing May Spend 30 Years in Prison appeared first…",
    "link": "https://www.breitbart.com/crime/2025/06/27/report-transgender-suspect-in-missouri-tesla-firebombing-may-spend-30-years-in-prison/",
    "timestamp": "2025-06-27T20:44:24Z"
  },
  {
    "title": "Trump suspends possible Iran sanctions relief",
    "description": "US President Donald Trump accused the Islamic Republic’s Supreme Leader of ingratitude for claiming to have won the war with Israel Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620681-trump-iran-sanctions-relief/",
    "timestamp": "2025-06-27T20:42:46Z"
  },
  {
    "title": "Lauren Sanchez: Who Is Jeff Bezos’ New Wife? (And Which NFL Legend Is Her Baby …",
    "description": "Reading Time: 3 minutesJeff Bezos' fiancee is receiving a lot of attention today.\nLauren Sanchez: Who Is Jeff Bezos’ New Wife? (And Which NFL Legend Is Her Baby … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/06/lauren-sanchez-baby-daddy/",
    "timestamp": "2025-06-27T20:42:26Z"
  },
  {
    "title": "GOP Senator on Fox: Justice Jackson ‘Mad as a Bag of Cats’ at SCOTUS Ruling – And That’s a ‘Good Thing’",
    "description": "\"If they disagree, you know, I'm sorry. Fill out a hurt feelings report. Buy a comfort rock,\" Kennedy said, praising SCOTUS ruling on universal injunctions.\nThe post GOP Senator on Fox: Justice Jackson ‘Mad as a Bag of Cats’ at SCOTUS Ruling – And That’s a ‘G…",
    "link": "https://www.mediaite.com/media/tv/gop-senator-on-fox-justice-jackson-mad-as-a-bag-of-cats-at-scotus-ruling-and-thats-a-good-thing/",
    "timestamp": "2025-06-27T20:41:50Z"
  },
  {
    "title": "Venezuelan who had rare, major surgery was deported to El Salvador prison, and his family has no idea how he is",
    "description": "Even before her son was summarily locked up in a Salvadoran prison and cut off from contact with the outside world, Mariela Villamizar was worried about his health",
    "link": "https://www.nbcnews.com/news/latino/venezuelan-rare-major-surgery-was-deported-el-salvador-prison-family-n-rcna215416",
    "timestamp": "2025-06-27T20:41:38Z"
  },
  {
    "title": "Nearly Every House Democrat Votes AGAINST Condemning Violent Anti-ICE Riots in Los Angeles",
    "description": "Nearly every House Democrat has voted against a resolution condemning the violent anti-Immigration and Customs Enforcement (ICE) riots that caused chaos and mayhem throughout Los Angeles earlier this month.\nThe post Nearly Every House Democrat Votes AGAINST C…",
    "link": "https://www.thegatewaypundit.com/2025/06/nearly-every-house-democrat-votes-against-condemning-violent/",
    "timestamp": "2025-06-27T20:40:37Z"
  },
  {
    "title": "WATCH: Russian President Putin Praises ‘Courageous’ Trump, Says That Relations With the US Are Beginning To Improve",
    "description": "Russian President Vladimir Putin held a press briefing today (27) in Moscow, following his visit to Belarus for the Eurasian Economic Union summit in Minsk. There was plenty of recrimination for the collective West, but respect and even a certain amount of pr…",
    "link": "https://freerepublic.com/focus/f-news/4325697/posts",
    "timestamp": "2025-06-27T20:40:29Z"
  },
  {
    "title": "Canadian Stocks Fall as Trump Ends Trade Talks With Nation",
    "description": "Canada’s equities benchmark quickly dropped on Friday after US President Donald Trump said in a social media post that he was ending all trade discussions with the country, claiming that it is implementing a digital services tax.",
    "link": "https://financialpost.com/pmn/business-pmn/canadian-stocks-fall-as-trump-ends-trade-talks-with-nation",
    "timestamp": "2025-06-27T20:40:08Z"
  },
  {
    "title": "Tariffs sparking a 'reshoring' boom could be double-edged sword, experts say",
    "description": "Evidence of a U.S. manufacturing slowdown is mounting, according to the Bank of America Institute. Tariffs could help reduce that slowdown and bring more advanced production back stateside, but improving productivity might happen without increasing employment…",
    "link": "https://biztoc.com/x/1fd9c5453dfa1731",
    "timestamp": "2025-06-27T20:40:08Z"
  },
  {
    "title": "Trump welcomes deal between Rwanda and DR Congo",
    "description": "United States President Donald Trump hailed on Friday the peace agreement made between Rwanda and the Democratic Republic of Congo, which was brokered by Washington.\"Today, the violence and destructio...",
    "link": "https://biztoc.com/x/4a05958831735e81",
    "timestamp": "2025-06-27T20:39:40Z"
  },
  {
    "title": "UVA President James Ryan Caved to MAGA—and They Forced Him Out Anyway",
    "description": "Thomas Jefferson’s vision for a\nnoble and educated republic has been dealt a firm blow. The enemies of free and\nopen inquiry, of science, and of informed, democratic citizenship have chopped\noff the head of the very university Jefferson founded to make his vi…",
    "link": "https://newrepublic.com/article/197393/university-virginia-president-james-ryan-caved-trump-resign",
    "timestamp": "2025-06-27T20:39:03Z"
  },
  {
    "title": "Environmental groups file lawsuit to halt ‘Alligator Alcatraz' detention center",
    "description": "Environmental groups Friday filed a federal lawsuit seeking to halt construction and operation of a detention center for undocumented immigrants that has been dubbed “Alligator Alcatraz,” saying it threatens ecologically sensitive areas and species in the sur…",
    "link": "https://freerepublic.com/focus/f-chat/4325696/posts",
    "timestamp": "2025-06-27T20:38:11Z"
  },
  {
    "title": "Trump Terminates Trade Talks with Canada over Tax on American Tech; Will Announce Tariff in Coming Days",
    "description": "President Donald Trump terminated trade talks with Canada on Friday and will be announcing a tariff on Canadian goods in response to a Canadian tax on American tech goods.\nThe post Trump Terminates Trade Talks with Canada over Tax on American Tech; Will Annou…",
    "link": "https://www.breitbart.com/politics/2025/06/27/trump-terminates-trade-talks-with-canada-over-tax-on-american-tech-will-announce-tariff-in-coming-days/",
    "timestamp": "2025-06-27T20:37:25Z"
  },
  {
    "title": "Trump sets 7-day deadline to announce new tariff on Canada",
    "description": "Confirms trade negotiations cut off because of creation of digital services taxes for American tech companies",
    "link": "https://www.wnd.com/2025/06/trump-sets-7-day-deadline-announce-new-tariff/",
    "timestamp": "2025-06-27T20:36:11Z"
  },
  {
    "title": "Trump calls New York Democratic mayoral candidate Zohran Mamdani 'a communist' (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump calls New York Democratic mayoral candidate Zohran Mamdani ‘a communist’ … President Donald Trump on Friday called New York City Democratic mayoral candidate Zohran Mamdani “a communist,” and said the Big Apple will become “a communis…",
    "link": "https://www.memeorandum.com/250627/p127",
    "timestamp": "2025-06-27T20:35:00Z"
  },
  {
    "title": "ACLU of NH joins class-action lawsuit over birthright citizenship",
    "description": "ACLU of NH joins class-action lawsuit over birthright citizenshipwmur.com",
    "link": "https://www.wmur.com/article/alcu-new-hampshire-birthright-citizenship/65227316",
    "timestamp": "2025-06-27T20:34:36Z"
  },
  {
    "title": "Can Democrats Still Fight Trump In Court? What Supreme Court’s Birthright Citizenship Ruling Means For President’s Agenda",
    "description": "The case will affect dozens of ongoing cases in which judges have blocked Trump's policies nationwide.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/06/27/can-democrats-still-fight-trump-in-court-what-supreme-courts-birthright-citizenship-ruling-means-for-presidents-agenda/",
    "timestamp": "2025-06-27T20:33:55Z"
  },
  {
    "title": "Trump Officials Met with Walmart on Direct-to-Patient Drug Sales",
    "description": "US health officials met with with Walmart Inc. and other retailers this week as part of an effort to help Americans get their medicines more directly from companies that make them, according to people familiar with the talks.",
    "link": "https://www.livemint.com/companies/news/trump-officials-met-with-walmart-on-direct-to-patient-drug-sales-11751056330601.html",
    "timestamp": "2025-06-27T20:32:10Z"
  },
  {
    "title": "Mamdani's primary win exposes Democrat divide as top leaders withhold endorsements",
    "description": "Democratic socialist Zohran Mamdani faces mixed reactions from New York Democrats after his unexpected primary win, as former Gov. Cuomo keeps his spot on the ballot.",
    "link": "https://www.foxnews.com/politics/too-extreme-zohran-mamdani-exposes-ideological-divide-among-new-york-democrats",
    "timestamp": "2025-06-27T20:30:43Z"
  },
  {
    "title": "Trump says he is ending all trade talks with Canada",
    "description": "US President Donald Trump said Friday the US was ending all trade talks with Canada “effective immediately” over its digital services tax that would impact US tech firms, calling it a “direct and blatant attack on our country.”\nCanada’s 3% digital services ta…",
    "link": "https://biztoc.com/x/7960c3c1ffbf9cc6",
    "timestamp": "2025-06-27T20:28:45Z"
  },
  {
    "title": "What the ‘12-day war’ teaches us about Trump’s foreign policy",
    "description": "President Trump in the East Room of the White House on June 26 | Chip Somodevilla/Getty Images \nWhen President Donald Trump announced late Saturday that he ordered the bombing of Iranian nuclear facilities, critics on both the left and the right feared a spir…",
    "link": "https://biztoc.com/x/435dc30897e8faad",
    "timestamp": "2025-06-27T20:28:25Z"
  },
  {
    "title": "Satellite images appear to show excavators and bulldozers at work at Iran's bombed-out nuclear site",
    "description": "The images of Fordow show bulldozers moving dirt near craters and working on access roads, and other construction equipment near the site.",
    "link": "https://www.businessinsider.com/satellite-images-iran-bulldozers-excavators-nuclear-site-us-bombed-2025-6",
    "timestamp": "2025-06-27T20:27:23Z"
  },
  {
    "title": "US Treasuries Post Third Week of Gains on Fed Rate-Cut Bets",
    "description": "US Treasuries closed out a third-straight positive week in a rally fueled by bets the Federal Reserve is ramping up to cut rates at least twice this year.",
    "link": "https://financialpost.com/pmn/business-pmn/us-treasuries-post-third-week-of-gains-on-fed-rate-cut-bets",
    "timestamp": "2025-06-27T20:25:39Z"
  },
  {
    "title": "The Supreme Court Sides with Trump Against the Judiciary",
    "description": "The courts cannot protect us from President Donald Trump’s unconstitutional overreach. That is the terrifying lesson of Friday’s 6–3 Supreme Court ruling limiting the power of federal judges to issue broad orders blocking Trump’s policies from taking effect w…",
    "link": "https://www.newyorker.com/news/the-lede/the-supreme-court-sides-with-trump-against-the-judiciary",
    "timestamp": "2025-06-27T20:25:12Z"
  },
  {
    "title": "What the ‘12-day war’ teaches us about Trump’s foreign policy",
    "description": "When President Donald Trump announced late Saturday that he ordered the bombing of Iranian nuclear facilities, critics on both the left and the right feared a spiral into a wider war.  Yet just two days later, Trump announced a ceasefire deal between Israel a…",
    "link": "https://www.vox.com/politics/418057/trump-iran-israel-12-day-war-takeaways",
    "timestamp": "2025-06-27T20:25:00Z"
  },
  {
    "title": "'Didn’t vote for this': Trump-voting influencer aghast at MAGA's new plan",
    "description": "MAGA advocates known for their love of hunting and fishing are fuming over a proposal in President Donald Trump's megabill currently being considered by the Senate, The New York Times reported.Senators are looking to make cuts to offset the cost of Trump's ta…",
    "link": "https://www.rawstory.com/megabill-2672463520/",
    "timestamp": "2025-06-27T20:24:59Z"
  },
  {
    "title": "Takeaways from the Supreme Court’s ruling on power of judges and birthright citizenship | CNN Politics",
    "description": "The Supreme Court delivered a major win to President Donald Trump on Friday in his ongoing war with the federal judiciary, limiting the power of courts to step in and block policies on a nationwide basis in the short term while judges review their legality.",
    "link": "https://www.cnn.com/2025/06/27/politics/takeaways-birthright-citizenship-supreme-court-decision",
    "timestamp": "2025-06-27T20:24:52Z"
  },
  {
    "title": "Rwanda and Congo sign peace deal in Washington to end fighting and attract investment",
    "description": "Agreement marks a breakthrough in talks held by US president Donald Trump’s administration",
    "link": "https://www.irishtimes.com/world/africa/2025/06/27/rwanda-and-congo-sign-peace-deal-in-washington-to-end-fighting-and-attract-investment/",
    "timestamp": "2025-06-27T20:24:47Z"
  },
  {
    "title": "Trump Shrugs Off Trade Deal Deadline",
    "description": "\"President Donald Trump said Friday he may not stick to the deadline in early July when massive U.S. tariffs are set to snap back into effect on a slew of countries,\" CNBC reports. Said Trump:",
    "link": "https://politicalwire.com/2025/06/27/trump-shrugs-off-trade-deal-deadline/",
    "timestamp": "2025-06-27T20:23:54Z"
  },
  {
    "title": "Justice Barrett torches Justice Jackson in case’s majority ruling",
    "description": "'We will not dwell on Justice Jackson's argument, which is at odds with more than two centuries' worth of precedent not to mention the Constitution itself'",
    "link": "https://www.wnd.com/2025/06/justice-barrett-torches-justice-jackson-cases-majority-ruling/",
    "timestamp": "2025-06-27T20:23:48Z"
  },
  {
    "title": "Chaos Creeps in on Little Cat's Feet",
    "description": "\"Great cities fall to the sound of cheering crowds.\" Ami Kozak on \"X\" The Democratic Party put another bullet in its head this week with the election of the charming, affable jihadi communist Zohran Mamdani. Is “communist” too harsh a label? (He styles himsel…",
    "link": "https://freerepublic.com/focus/f-news/4325693/posts",
    "timestamp": "2025-06-27T20:23:18Z"
  },
  {
    "title": "Trump Goes Haywire on AI Regulation After China Agrees to Major Trade Deal",
    "description": "Donald Trump and Xi Jinping have finally resolved a months-long trade dispute revolving the rare earth metals vital to developing artificial intelligence. That makes it all the more bizarre that the US President is opening the floodgates for an AI arms race w…",
    "link": "https://futurism.com/trump-ai-regulation-china",
    "timestamp": "2025-06-27T20:23:08Z"
  },
  {
    "title": "Groups File Nationwide Class Action Lawsuit Over Trump’s Birthright Citizenship Order",
    "description": "Their legal challenge comes hours after the Supreme Court blocked judges from issuing nationwide injunctions to halt the administration's lawlessness.",
    "link": "https://www.huffpost.com/entry/groups-file-nationwide-class-action-lawsuit-birthright-citizenship_n_685eeac5e4b015addf95e404",
    "timestamp": "2025-06-27T20:21:12Z"
  },
  {
    "title": "Trump exploits Supreme Court ruling to attack transgender people in reality-challenged White House briefing",
    "description": "President Donald Trump on Friday seized on a U.S. Supreme Court ruling about nationwide injunctions by federal district court judges to renew his attacks on transgender rights and LGBTQ+ families, twisting an unrelated legal victory into a platform for his ad…",
    "link": "https://www.advocate.com/politics/scotus-ruling-transgender-trump-briefing",
    "timestamp": "2025-06-27T20:21:08Z"
  },
  {
    "title": "Trump sidesteps question on crypto divesting to pass key bills",
    "description": "A reporter asked US President Donald Trump at Friday's press briefing if he would divest from his crypto ventures to ensure crypto bills pass through Congress.",
    "link": "https://cointelegraph.com/news/trump-sidesteps-crypto-divesting-pass-key-bills",
    "timestamp": "2025-06-27T20:20:19Z"
  },
  {
    "title": "Matt Gaetz speaks out after plane passenger leaks new Trump-linked weed deal",
    "description": "A potentially lucrative agreement between the cannabis company Trulieve\r\n and disgraced former Rep. Matt Gaetz (R-FL) was leaked this week thanks to a curious onlooker who snapped a photograph of his laptop screen, a deal that appears to have been offered, at…",
    "link": "https://www.rawstory.com/matt-gaetz-2672466809/",
    "timestamp": "2025-06-27T20:20:19Z"
  },
  {
    "title": "Tuberville says 'inner city rats' live off the American taxpayers: Trump should send them 'back home' (William Thornton/al.com)",
    "description": "William Thornton / al.com:\nTuberville says ‘inner city rats’ live off the American taxpayers: Trump should send them ‘back home’  —  Alabama U.S. Sen. Tommy Tuberville says President Donald Trump should defund major American cities where leadership is “godawf…",
    "link": "https://www.memeorandum.com/250627/p125",
    "timestamp": "2025-06-27T20:20:01Z"
  },
  {
    "title": "Trump celebrates Supreme Court limits on 'colossal abuse of power' by federal judges",
    "description": "President Donald Trump celebrated after the Supreme Court moved to block lower courts from issuing universal injunctions, something that had impacted his executive orders. The president held a news conference just over an hour after the ruling was issued and …",
    "link": "https://freerepublic.com/focus/f-chat/4325691/posts",
    "timestamp": "2025-06-27T20:19:22Z"
  },
  {
    "title": "Bezos, Sanchez Say 'I Do' In A Divided Venice",
    "description": "Amazon tycoon Jeff Bezos and Lauren Sanchez tied the knot Friday at a sumptuous ceremony with the rich and famous on an island in Venice's lagoon, out of the sight and sound of protesters.",
    "link": "https://www.ibtimes.com.au/bezos-sanchez-say-i-do-divided-venice-1859432",
    "timestamp": "2025-06-27T20:18:17Z"
  },
  {
    "title": "‘These People Are A Monotheistic Cult’: Joy Reid Goes On Unhinged 2-Minute Tirade Attacking Trump, Rubio",
    "description": "Joy Reid went on a nearly two-minute tirade attacking Donald Trump as the leader of a \"monotheistic cult\" that Marco Rubio wrongly believes he \"will inherit.\"",
    "link": "https://dailycaller.com/2025/06/27/joy-reid-unhinged-2-minute-tirade-attacking-trump-rubio/",
    "timestamp": "2025-06-27T20:18:01Z"
  },
  {
    "title": "Trump’s Military Birthday Parade ‘Illegally’ Used Hit Song: Cease-and-Desist Letter",
    "description": "The organizers of Donald Trump’s military parade used the song “He Ain’t Heavy, He’s My Brother,” without permission, per cease-and-desist letter.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-military-birthday-parade-song-bobby-scott-illegal-1235374520/",
    "timestamp": "2025-06-27T20:15:00Z"
  },
  {
    "title": "U.S. government cuts key hurricane forecasting data from satellites",
    "description": "Weather experts are warning that hurricane forecasts will be severely hampered by the upcoming cutoff of key data from U.S. Department of Defence satellites, something a National Oceanic and Atmospheric Administration spokesperson called a routine data rotati…",
    "link": "https://www.cbc.ca/news/science/us-hurricane-forecasting-cuts-1.7573024",
    "timestamp": "2025-06-27T20:14:25Z"
  },
  {
    "title": "The Supreme Court’s Birthright Citizenship Ruling Gets History Achingly Wrong",
    "description": "Brown v. Board of Education remains a powerful and appropriate historical example this court cannot answer.",
    "link": "https://slate.com/news-and-politics/2025/06/supreme-court-birthright-citizenship-history-fail.html",
    "timestamp": "2025-06-27T20:13:29Z"
  },
  {
    "title": "Newsom sues Fox News, alleging defamation over how it covered a phone call with Trump | CNN Politics",
    "description": "California Gov. Gavin Newsom is suing Fox News for $787 million, accusing the media outlet of defamation in its coverage of a recent phone call between him and President Donald Trump.",
    "link": "https://www.cnn.com/2025/06/27/politics/newsom-sues-fox-news-trump-phone-call",
    "timestamp": "2025-06-27T20:12:12Z"
  },
  {
    "title": "Trump Says Would Bomb Iran Again If Nuclear Activities Start",
    "description": "US President Donald Trump said Friday he had saved Iran's Ayatollah Ali Khamenei from assassination and lashed out at the supreme leader for ingratitude, declaring he would order more bombing if the country tried to pursue nuclear weapons.",
    "link": "https://www.ibtimes.com.au/trump-says-would-bomb-iran-again-if-nuclear-activities-start-1859430",
    "timestamp": "2025-06-27T20:12:10Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with Congo and Rwandan Ministers After Historic Peace Deal",
    "description": "President Donald Trump meets with the foreign ministers of Congo and Rwanda after brokering a historic peace agreement between them on Friday, June 27.\nThe post Watch Live: Donald Trump Meets with Congo and Rwandan Ministers After Historic Peace Deal appeared…",
    "link": "https://www.breitbart.com/africa/2025/06/27/watch-live-donald-trump-meets-with-congo-and-rwandan-ministers-after-historic-peace-deal/",
    "timestamp": "2025-06-27T20:07:11Z"
  },
  {
    "title": "Trump shrugs off July tariff deadline: 'We can do whatever we want'",
    "description": "Trump's answer appeared to correspond to the date when his self-described reciprocal tariffs on many nations are set to return to their initial, higher levels.",
    "link": "https://www.cnbc.com/2025/06/27/trump-tariff-trade-deadline-july.html",
    "timestamp": "2025-06-27T20:06:49Z"
  },
  {
    "title": "WATCH: Trump says U.S. approved observers must inspect Iran’s nuclear program, would bomb again",
    "description": "President Donald Trump said on Friday that he expects Iran to open itself to international inspection to verify that it doesn’t restart its nuclear program.",
    "link": "https://biztoc.com/x/85915a9e2fa9cde1",
    "timestamp": "2025-06-27T20:06:20Z"
  },
  {
    "title": "Wall Street closes in green amid trade talks",
    "description": "Major stock indexes in the United States closed with gains on Friday after President Donald Trump signaled that new trade deals will be announced soon. However, the S&P 500 retreated from its prev...",
    "link": "https://biztoc.com/x/2a00bff818170462",
    "timestamp": "2025-06-27T20:06:07Z"
  },
  {
    "title": "Progressive Revenue Is Not Dead in Seattle",
    "description": "And the Business Associations Are Pissed\n \n by Nathalie Graham\n \n \n \n Seattle electeds have finally realized that they can’t simply rely on the Jumpstart Tax, a progressive (but fluctuating) payroll tax, to backfill budget shortfalls in perpetuity, and they a…",
    "link": "https://www.thestranger.com/news/2025/06/27/80120394/progressive-revenue-is-not-dead-in-seattle",
    "timestamp": "2025-06-27T20:06:00Z"
  },
  {
    "title": "Trump terminates trade talks with Canada (NBC News)",
    "description": "NBC News:\nTrump terminates trade talks with Canada  —  The president posted on Truth Social that Canada had planned to put a tax on U.S. technology companies, calling the move “a blatant attack.”  —  President Donald Trump said Friday that he had terminated t…",
    "link": "https://www.memeorandum.com/250627/p117",
    "timestamp": "2025-06-27T20:05:00Z"
  },
  {
    "title": "California Gov. Gavin Newsom sues Fox News over alleged defamation in story about call with Trump (Olga R. Rodriguez/Associated Press)",
    "description": "Olga R. Rodriguez / Associated Press:\nCalifornia Gov. Gavin Newsom sues Fox News over alleged defamation in story about call with Trump  —  California Gov. Gavin Newsom sued Fox News on Friday over alleged defamation, saying the network knowingly aired false …",
    "link": "https://www.memeorandum.com/250627/p116",
    "timestamp": "2025-06-27T20:05:00Z"
  },
  {
    "title": "What is Canada's digital services tax — and why does Trump dislike it so much?",
    "description": "Here's what you need to know about the tax, which has been a thorn in the side of the Canada-U.S. relationship for years.",
    "link": "https://www.cbc.ca/news/politics/canada-digital-services-tax-explained-1.7573099",
    "timestamp": "2025-06-27T20:04:47Z"
  },
  {
    "title": "President Donald J. Trump Calls on LindellTV Lady in Red Reporter, Cara Castronuova of Mike Lindell Media Corp. OTC: (MLMC) in the White House Briefing Room",
    "description": "Washington, D.C. , June 27, 2025 (GLOBE NEWSWIRE) -- Mike Lindell Media Corp. (OTC: MLMC) Reporter Cara Castronuova was called on by President Trump for a question today in the White House Briefing Room during a Press Conference as the President said, \"red dr…",
    "link": "https://www.globenewswire.com/news-release/2025/06/27/3106807/0/en/President-Donald-J-Trump-Calls-on-LindellTV-Lady-in-Red-Reporter-Cara-Castronuova-of-Mike-Lindell-Media-Corp-OTC-MLMC-in-the-White-House-Briefing-Room.html",
    "timestamp": "2025-06-27T20:03:00Z"
  },
  {
    "title": "Oil Steady as OPEC+ Weighs Output Hike",
    "description": "WTI held above $65 as OPEC+ considered further production increases for August.",
    "link": "https://www.rigzone.com/news/wire/oil_steady_as_opec_weighs_output_hike-27-jun-2025-180978-article/",
    "timestamp": "2025-06-27T20:01:48Z"
  },
  {
    "title": "WATCH: Trump says U.S. approved observers must inspect Iran’s nuclear program, would bomb again",
    "description": "President Donald Trump said on Friday that he expects Iran to open itself to international inspection to verify that it doesn’t restart its nuclear program.",
    "link": "https://www.pbs.org/newshour/world/watch-trump-says-u-s-approved-observers-must-inspect-irans-nuclear-program-would-bomb-again",
    "timestamp": "2025-06-27T20:01:21Z"
  },
  {
    "title": "US Bitcoin Reserve Build Has Quietly Begun, Confirms Bo Hines",
    "description": "At a Senate Banking Committee hearing yesterday, executive director of the President’s Council of Advisers on Digital Assets Bo Hines sat flanked by Chairman Tim Scott and Digital Assets Subcommittee Chair Cynthia Lummis and confirmed that the United States h…",
    "link": "https://bitcoinist.com/us-bitcoin-reserve-build-quietly-begun-bo-hines/",
    "timestamp": "2025-06-27T20:00:32Z"
  },
  {
    "title": "Supreme Court birthright citizenship ruling sparks new round of legal fights",
    "description": "WASHINGTON — Almost as soon as the Supreme Court released its ruling limiting the ability of judges to block President Donald Trump's plan to end birthright citizenship, challengers brought new legal claims seeking the same result by a different means",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-birthright-citizenship-ruling-sparks-new-legal-fights-rcna215626",
    "timestamp": "2025-06-27T20:00:07Z"
  },
  {
    "title": "Trump says he would 'absolutely' consider bombing Iran again",
    "description": "The US president also reiterates his claim that Iran's nuclear facilities have been \"obliterated\".",
    "link": "https://www.bbc.com/news/articles/cvgenq599kwo",
    "timestamp": "2025-06-27T19:59:34Z"
  },
  {
    "title": "Trump ends all U.S. trade talks with Canada over digital services tax",
    "description": "President Donald Trump on Friday said the United States is immediately “terminating ALL discussions on Trade with Canada” in ...",
    "link": "https://biztoc.com/x/ddc16c0c68713087",
    "timestamp": "2025-06-27T19:58:00Z"
  },
  {
    "title": "Trump Enters Meltdown Mode Over Iran for Pettiest Reason",
    "description": "Donald Trump erupted Friday after Iran’s Supreme Leader Ayatollah Ali Khamenei declared victory over Israel.\r\nIn a defiant video statement released Thursday, Khamenei said that the U.S. had been dealt a “severe slap,” and that Israel would have been “complete…",
    "link": "https://newrepublic.com/post/197386/donald-trump-meltdown-iran-leader-petty",
    "timestamp": "2025-06-27T19:54:32Z"
  },
  {
    "title": "EXCLUSIVE: Top EPA Official Breaks Down Why Agency Needs To Get Back To Basics After Biden Years",
    "description": "EPA Deputy Administrator David Fotouhi said his agency needs to return to its original mission to power the \"Great American Comeback.\"",
    "link": "https://dailycaller.com/2025/06/27/exclusive-top-epa-official-david-fotouhi-agency-back-to-basics-after-biden/",
    "timestamp": "2025-06-27T19:54:13Z"
  },
  {
    "title": "J.M. Smucker plans to remove artificial colors from its jams and other products by the end of 2027",
    "description": "J.M. Smucker Co. plans to remove artificial colors from its products by the end of 2027. Orrville, Ohio-based Smucker said the majority of its products – including its Uncrustables sandwiches – are already free of synthetic dyes. But some products still have …",
    "link": "https://www.seattlepi.com/business/article/j-m-smucker-plans-to-remove-artificial-colors-20397704.php",
    "timestamp": "2025-06-27T19:52:36Z"
  },
  {
    "title": "EXCLUSIVE: House Conservative Says He Can’t Be Pressured To Support Senate’s Version Of Trump Bill",
    "description": "Rep. Ralph Norman is urging the Senate to think twice before it rolls back conservative policy wins secured in the initial House proposal.",
    "link": "https://dailycaller.com/2025/06/27/ralph-norman-big-beautiful-bill-house-senate-trump/",
    "timestamp": "2025-06-27T19:49:34Z"
  },
  {
    "title": "Pentagon unveils $961B budget request: Fund for Golden Dome, missiles and drones, fewer F-35 jets",
    "description": "Trump administration unveils $961 billion Pentagon budget with $848.3 billion in discretionary funding, featuring cuts to F-35 purchases and increased investment in drones.",
    "link": "https://www.foxnews.com/politics/pentagon-unveils-961b-budget-request-fund-golden-dome-missiles-drones-fewer-f-35-jets",
    "timestamp": "2025-06-27T19:49:18Z"
  },
  {
    "title": "A 2022 Book Claimed That Anna Wintour Could Have Left ‘Vogue’ to Become An Ambassador if Hillary Clinton Won the Election",
    "description": "After four decades, Anna Wintour is stepping down from her position at Vogue. Learn more about her life and career in Anna: The Biography. Buy now",
    "link": "http://www.rollingstone.com/product-recommendations/books/anna-wintour-vogue-biography-buy-now-online-1235374330/",
    "timestamp": "2025-06-27T19:47:57Z"
  },
  {
    "title": "The Supreme Court’s Birthright Citizenship Ruling Is a 5-Alarm Catastrophe",
    "description": "Society / June 27, 2025 The Supreme Court’s Birthright Citizenship Ruling Is a 5-Alarm Catastrophe In Trump v. CASA, the court hands the president yet more unaccountable authority—and yanks us into a neo-Confederate legal nightmare. Elie Mystal Share Copy Lin…",
    "link": "https://www.thenation.com/article/society/supreme-court-birthright-citizenship-ruling-trump-v-casa/",
    "timestamp": "2025-06-27T19:47:02Z"
  },
  {
    "title": "Trump \"Terminating\" U.S.-Canada Trade Talks Over Streaming Tax",
    "description": "The president claimed Ottawa imposing a digital service tax on American tech giants was a “direct and blatant attack on our Country.”",
    "link": "http://www.hollywoodreporter.com/business/business-news/trump-tu-s-canada-trade-talks-hollywood-tax-1236301782/",
    "timestamp": "2025-06-27T19:47:01Z"
  },
  {
    "title": "Trump Claims He Built Crypto—Just as His Family Cashes In",
    "description": "The U.S. president now says he made crypto great again, just as his family stands to benefit from a booming digital empire.",
    "link": "https://gizmodo.com/trump-claims-he-built-crypto-just-as-his-family-cashes-in-2000621519",
    "timestamp": "2025-06-27T19:45:41Z"
  },
  {
    "title": "University of Virginia Chief Exits Under Pressure From Trump",
    "description": "University of Virginia President James Ryan is stepping down amid a Trump administration probe of the school’s diversity, equity and inclusion efforts, according to people familiar with the matter.",
    "link": "https://www.livemint.com/companies/news/university-of-virginia-chief-exits-under-pressure-from-trump-11751053535268.html",
    "timestamp": "2025-06-27T19:45:34Z"
  },
  {
    "title": "J.M. Smucker plans to remove artificial colors from its jams and other products by the end of 2027",
    "description": "J.M. Smucker Co. plans to remove artificial colors from its products by the end of 2027. Orrville, Ohio-based Smucker said Thursday it will also remove synthetic dyes from foods sold to K-12 schools by the 2026-2027 school year. Smucker said the majority of i…",
    "link": "https://financialpost.com/pmn/j-m-smucker-plans-to-remove-artificial-colors-from-its-jams-and-other-products-by-the-end-of-2027",
    "timestamp": "2025-06-27T19:44:34Z"
  },
  {
    "title": "Senate Republicans move to slash CFPB funding by half, risking hundreds of job cuts",
    "description": "Senate Republicans have proposed cutting the Consumer Financial Protection Bureau’s funding by nearly half.",
    "link": "https://www.wsls.com/news/politics/2025/06/27/senate-republicans-move-to-slash-cfpb-funding-by-half-risking-hundreds-of-job-cuts/",
    "timestamp": "2025-06-27T19:43:27Z"
  },
  {
    "title": "Trump says he’s ending trade talks with Canada over its 'egregious Tax' on technology firms",
    "description": "President Donald Trump says he’s suspending trade talks with Canada over its plans to continue with its tax on technology firms.",
    "link": "https://www.wsls.com/business/2025/06/27/trump-says-hes-terminating-trade-talks-with-canada-over-tax-on-technology-firms/",
    "timestamp": "2025-06-27T19:43:26Z"
  },
  {
    "title": "Trump Ends Trade Talks With Canada Over Tax On US Tech Firms",
    "description": "President Donald Trump said Friday he is calling off trade negotiations with Canada in retaliation for taxes impacting US tech firms, adding that Ottawa will learn of their new tariff rate within a week.",
    "link": "https://www.ibtimes.com.au/trump-ends-trade-talks-canada-over-tax-us-tech-firms-1859427",
    "timestamp": "2025-06-27T19:42:13Z"
  },
  {
    "title": "Republican Discord Threatens Trump Agenda",
    "description": "US President Donald Trump's signature domestic policy bill faced major roadblocks Friday, as his Republicans struggled to overcome differences and many of the spending cuts proposed to pay for his tax breaks were deemed against Senate rules.",
    "link": "https://www.ibtimes.com/republican-discord-threatens-trump-agenda-3777118",
    "timestamp": "2025-06-27T19:42:08Z"
  },
  {
    "title": "Trump Wildly Claims He Saved Iran’s Leader From a ‘VERY UGLY’ Death By Israel",
    "description": "\"I SAVED HIM FROM A VERY UGLY AND IGNOMINIOUS DEATH, and he does not have to say, 'THANK YOU, PRESIDENT TRUMP!'\"\nThe post Trump Wildly Claims He Saved Iran’s Leader From a ‘VERY UGLY’ Death By Israel first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-wildly-claims-he-saved-irans-leader-from-a-very-ugly-death-by-israel/",
    "timestamp": "2025-06-27T19:41:56Z"
  },
  {
    "title": "Canada's Digital Services Tax To Stay In Place Despite G7 Deal",
    "description": "An anonymous reader quotes a report from Bloomberg: Canada is proceeding with its digital services tax on technology companies such as Meta despite a Group of Seven agreement that resulted in removing the Section 899 \"revenge tax\" proposal from U.S. President…",
    "link": "https://news.slashdot.org/story/25/06/27/1935258/canadas-digital-services-tax-to-stay-in-place-despite-g7-deal",
    "timestamp": "2025-06-27T19:40:00Z"
  },
  {
    "title": "Did Mahsa Amini Die in Vain? | Opinion",
    "description": "If Israel truly supports the Iranian people, it must ensure they can participate in demonstrations that could shape the future of their country. The United States should do more to empower Iranians to determine their destiny.",
    "link": "https://www.newsweek.com/did-mahsa-amini-die-vain-opinion-2091807",
    "timestamp": "2025-06-27T19:38:03Z"
  },
  {
    "title": "Trump Says He’ll Bomb Iran Again If Needed In Unexpected Press Conference",
    "description": "President Donald Trump held an hour long, unexpected press conference on Friday where he shared that he is willing to bomb Iran again if needed.",
    "link": "https://dailycaller.com/2025/06/27/donald-trump-press-conference-bomb-iran-again-israel-supreme-court/",
    "timestamp": "2025-06-27T19:36:41Z"
  }
]