[
  {
    "title": "Kimmel Spots Sure Sign That Trump's 'Out Of It'",
    "description": "The late night host tore into the president for posting a racist AI video.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-jeffries-video_n_68de1357e4b0c450ba653827",
    "timestamp": "2025-10-02T07:11:42Z"
  },
  {
    "title": "Visa eyes stablecoin launch to power $15.7T network – Details",
    "description": "Visa’s new stablecoin could unlock more capital in the market.",
    "link": "https://ambcrypto.com/visa-eyes-stablecoin-launch-to-power-15-7t-network-details/",
    "timestamp": "2025-10-02T07:00:40Z"
  },
  {
    "title": "Karoline Leavitt’s Defense Of Trump’s AI Slop Gets Ratioed In Real Time",
    "description": "Critics mocked the \"complete clown show\" of the Trump White House.",
    "link": "https://www.huffpost.com/entry/karoline-leavitt-donald-trump-ai-slop_n_68de1817e4b0c450ba653900",
    "timestamp": "2025-10-02T06:59:14Z"
  },
  {
    "title": "Donald Trump Vows to Use Shutdown to ‘Clear Out Dead Wood’",
    "description": "Trump has threatened to use the shutdown to carry out layoffs if it continues.",
    "link": "https://biztoc.com/x/16f4a883ef2ce35b",
    "timestamp": "2025-10-02T06:57:56Z"
  },
  {
    "title": "Newsom trolls ‘Marie Antoinette’ Trump over decision to protect his ballroom while pushing cuts: ‘No health care for you’",
    "description": "Gavin Newsom has trolled Donald Trump over the news that work will continue on his presidential ballroom through the government shutdown , comparing him to",
    "link": "https://www.newsbreak.com/share/4267975981827-newsom-trolls-marie-antoinette-trump-over-decision-to-protect-his-ballroom-while-pushing-cuts-no-health-care-for-you?s=a2&amp;share_destination_id=MTU1MTgxMjAwLTE3NTkzODgxMzQ2ODU%3D&amp;pd=0AV7iawk&amp;hl=en_US&amp;send_time=1759388134&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.39.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=sc_play_button_v1-control",
    "timestamp": "2025-10-02T06:57:05Z"
  },
  {
    "title": "Samsung, SK Hynix market value jumps $37 billion after OpenAI chip deal",
    "description": "Samsung Electronics and SK Hynix surge on OpenAI partnership, driving record KOSPI index growth and boosting market capitalization.",
    "link": "https://www.thehindubusinessline.com/info-tech/samsung-sk-hynix-market-value-jumps-37-billion-after-openai-chip-deal/article70117069.ece",
    "timestamp": "2025-10-02T06:47:51Z"
  },
  {
    "title": "Trump Jr. dismisses crypto conflict of interest concerns: My dad’s not checking blockchain ledgers",
    "description": "Donald Trump Jr. and Zach Witkoff dismissed concerns regarding the project's political ties as \"complete nonsense,\" at a major crypto event in Singapore.",
    "link": "https://www.cnbc.com/2025/10/02/trump-jr-zach-wilkoff-steve-dismisses-world-liberty-financial-conflict-of-interest-concerns-usd1.html",
    "timestamp": "2025-10-02T06:47:13Z"
  },
  {
    "title": "Trump Jr. dismisses crypto conflict of interest concerns: My dad’s not checking blockchain ledgers",
    "description": "Donald Trump Jr. and Zach Witkoff dismissed concerns regarding the project's political ties as \"complete nonsense,\" at a major crypto event in Singapore.",
    "link": "https://biztoc.com/x/479b78603772edfe",
    "timestamp": "2025-10-02T06:46:48Z"
  },
  {
    "title": "Zelenskyy to join European summit as EU leaders back 'drone wall' to counter Russian threat",
    "description": "European leaders are keen to work with Ukraine’s war-tested expertise as they seek to build a ‘drone wall’ to counter the threat from Moscow.",
    "link": "https://www.thejournal.ie/zelenskyy-to-join-european-summit-eu-leaders-back-drone-wall-to-counter-russian-threat-6832717-Oct2025/",
    "timestamp": "2025-10-02T06:33:01Z"
  },
  {
    "title": "Get the Facts: Did Republicans end US medical research?",
    "description": "As the United States government remains shut down, WMUR's Get the Facts team is looking into a claim by House Democratic Leader Hakeem Jeffries.",
    "link": "https://www.wmur.com/article/get-the-facts-medical-research/68162751",
    "timestamp": "2025-10-02T06:28:53Z"
  },
  {
    "title": "'Where am I safe?': UK court ruling leaves trans people's lives in turmoil",
    "description": "A recent UK Supreme Court ruling affirming \"sex\" refers to biological sex under equality laws has left transgender individuals like Nate Rae feeling unsafe and excluded. Interim guidance from the EHRC suggests barring trans people from facilities matching the…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/where-am-i-safe-uk-court-ruling-leaves-trans-peoples-lives-in-turmoil/articleshow/124270479.cms",
    "timestamp": "2025-10-02T06:28:42Z"
  },
  {
    "title": "Hangman Page encourages AEW fans to complain to WBD about ICE ads on Dynamite",
    "description": "Tony Khan’s World champ made it clear he didn’t like the recruitment ads, which wrestling fans have been seeing more of.",
    "link": "https://www.cagesideseats.com/aew/386876/hangman-page-fuck-ice-aew-world-champ-recruitment-ads-dynamite-tbs-hbo-max",
    "timestamp": "2025-10-02T06:28:40Z"
  },
  {
    "title": "Trump wants Nobel but 'forgotten' peacemakers more likely, experts say",
    "description": "Nobel Prize announcements begin next week. Donald Trump seeks the Peace Prize. Experts predict his chances are low due to his policies and style. Other contenders include Yulia Navalnaya and media watchdogs. Christian Kracht is a literature favorite. Science …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-wants-nobel-but-forgotten-peacemakers-more-likely-experts-say/articleshow/124270438.cms",
    "timestamp": "2025-10-02T06:24:42Z"
  },
  {
    "title": "Brazil sees Asean Summit as ideal spot for Lula-Trump meeting",
    "description": "BRAZIL and the US are working to arrange an in-person meeting between Presidents Luiz Inacio Lula da Silva and Donald Trump, with a potential encounter likely to take place in a third country, according to multiple Brazilian officials familiar with the situat…",
    "link": "https://www.thestar.com.my/news/world/2025/10/02/brazil-sees-asean-summit-as-ideal-spot-for-lula-trump-meeting",
    "timestamp": "2025-10-02T06:24:00Z"
  },
  {
    "title": "EU leaders back plan for 'drone wall' to counter Russia",
    "description": "European Union leaders have backed plans for a new defence network against Russian drones following recent incursions into European airspace.",
    "link": "https://www.rte.ie/news/europe/2025/1002/1536400-russia-drones-ukraine/",
    "timestamp": "2025-10-02T06:20:01Z"
  },
  {
    "title": "New Trump executive order guarantees Qatar security after Israeli attack",
    "description": "President Donald Trump has issued an executive order in which the United States pledges to guarantee Qatar’s security – including retaliatory military action – if the country were to come under attack again, in the wake of Israel’s unprecedented air strikes o…",
    "link": "https://thechronicle.com.gh/new-trump-executive-order-guarantees-qatar-security-after-israeli-attack/",
    "timestamp": "2025-10-02T06:16:38Z"
  },
  {
    "title": "Asian shares track Wall Street's rise as tech shares advance",
    "description": "U.S. stocks edged up to more records. The S&P 500 rose 0.1% Thursday. The Dow Jones Industrial Average added 0.2%, while the Nasdaq composite climbed 0.4%. All three set all-time highs. Technology stocks helped lead the way after OpenAI announced partnerships…",
    "link": "https://apnews.com/article/markets-stocks-shutdown-korea-openai-trump-a08c07307c4483a3583fe2aaa1609637",
    "timestamp": "2025-10-02T06:13:13Z"
  },
  {
    "title": "US authorizes intelligence sharing to help Ukraine target Russian energy infrastructure",
    "description": "The Trump administration has authorized critical intelligence support for Ukraine to conduct long-range missile strikes on Russia's energy infrastructure, marking a significant escalation. The US is also considering transferring advanced cruise missiles like …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-authorizes-intelligence-sharing-to-help-ukraine-target-russian-energy-infrastructure/articleshow/124270263.cms",
    "timestamp": "2025-10-02T06:11:38Z"
  },
  {
    "title": "'Where am I safe?': UK court ruling leaves trans people's lives in turmoil",
    "description": "LONDON (Reuters) -Nate Rae had always felt secure living openly since coming out as a transgender man in his late 20s - until a recent UK Supreme Court ruling on the legal definition of biological sex changed everything. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/10/02/039where-am-i-safe039-uk-court-ruling-leaves-trans-people039s-lives-in-turmoil",
    "timestamp": "2025-10-02T06:10:00Z"
  },
  {
    "title": "Anti-foreigner sentiments and politicians are on the rise as Japan faces a population crisis",
    "description": "A Japanese nationalist party led by fiery anti-globalist Sohei Kamiya was among the biggest winners in this summer’s parliamentary election",
    "link": "https://abcnews.go.com/International/wireStory/anti-foreigner-sentiments-politicians-rise-japan-faces-population-126139879",
    "timestamp": "2025-10-02T06:06:32Z"
  },
  {
    "title": "US government shutdown continues, as Trump cuts funds for Democratic states",
    "description": "Republicans and Democrats fail to narrow differences on spending bill, as effects of shutdown start showing.",
    "link": "https://www.aljazeera.com/news/2025/10/2/us-government-shutdown-continues-as-trump-cuts-funds-for-democratic-states",
    "timestamp": "2025-10-02T06:06:20Z"
  },
  {
    "title": "Trump drives Republicans into a political black hole with unpopular shutdown",
    "description": "The pain inflicted on the American people as a result of Donald Trump's shutdown of the federal government is of little concern to ...",
    "link": "https://biztoc.com/x/dcbcaa1ae49991d1",
    "timestamp": "2025-10-02T06:03:16Z"
  },
  {
    "title": "Trump’s Plan: Instant Rewards for Israel, Vague Promises for Palestinians",
    "description": "Two years into Israel’s destruction, war crimes, and genocide in Gaza, Donald Trump rolled out a 20-point proposal, hyped as a path to peace. Arab and Muslim leaders rushed to give their unqualified blessing. Standing right next to Trump, however, Benjamin Ne…",
    "link": "https://www.counterpunch.org/2025/10/02/trumps-plan-instant-rewards-for-israel-vague-promises-for-palestinians/",
    "timestamp": "2025-10-02T06:02:33Z"
  },
  {
    "title": "Pfizer deal and AI takeover: Trumpâ\u0080\u0099s final solution for American workforce?",
    "description": "Trump-Pfizer Deal Sparks Backlash – Trump’s $70 billion partnership with Pfizer, the company behind COVID mRNA vaccines, has angered his base, who see it as a betrayal and surrender to Big Pharma’s depopulation agenda. AI Replacing Federal Workers – Trump pla…",
    "link": "https://www.naturalnews.com/2025-10-02-pfizer-deal-and-ai-takeover-trumps-final-solution-for-american-workforce.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s alliance with Israel, NDAA powers, and political turmoil raise authoritarianism concerns",
    "description": "Trump’s unwavering support for Netanyahu—despite ICC war crime charges—signals potential suppression of dissent in America, with fears of Zionist-driven policies overriding U.S. sovereignty and constitutional rights. Kirk’s sudden death, alongside a leaked le…",
    "link": "https://www.naturalnews.com/2025-10-02-is-america-heading-toward-authoritarian-crackdown.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "DEATHS from infectious diseases had ALREADY FALLEN before the advent of vaccines, as RFK Jr. blasts out the truth serum to Congress",
    "description": "Health Secretary Robert F. Kennedy Jr. has reignited a long-running debate about the role vaccines have played in reducing deaths from infectious diseases. In a video statement on Sept. 29, Kennedy challenged the widely circulated claim that vaccines alone ar…",
    "link": "https://www.naturalnews.com/2025-10-02-deaths-from-infectious-diseases-fell-before-vaccines.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Hegseth tells senior military commanders to “PREPARE FOR WAR”",
    "description": "During a meeting at Marine Corps Base Quantico, Hegseth declared the sole mission of the restored Department of War is warfighting, emphasizing “peace through strength.” Hegseth abolished progressive initiatives like climate change programs, DEI offices and C…",
    "link": "https://www.naturalnews.com/2025-10-02-hegseth-tells-senior-commanders-prepare-for-war.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Trump announces “TrumpRx” website and Pfizer deal to slash drug prices, boost U.S. manufacturing",
    "description": "President Donald Trump announced a landmark agreement with Pfizer to implement “most-favored-nation” pricing for Medicaid, ensuring the U.S. pays no more than the lowest prices offered to other developed nations. The new TrumpRx direct-to-consumer platform, l…",
    "link": "https://www.naturalnews.com/2025-10-02-trump-announces-trumprx-website-and-pfizer-deal.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Putin orders largest fall draft since 2016, calls up 135,000 for compulsory service amid mounting tensions",
    "description": "Russian President Vladimir Putin signed a decree to draft 135,000 men between the ages of 18 and 30 into mandatory military service. This is the largest autumn conscription since 2016, reflecting increased tensions with NATO. Putin’s move follows threats from…",
    "link": "https://www.naturalnews.com/2025-10-02-putin-orders-largest-fall-draft-since-2016.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Israelâ\u0080\u0099s cruel ultimatum: Leave Gaza or be branded a terrorist",
    "description": "Israel’s Defense Minister declares all remaining Gaza civilians are “terrorists” if they refuse to flee, trapping the sick, poor, and displaced in an impossible choice. Evacuation routes and so-called “safe zones” are bombed, with airstrikes killing fleeing f…",
    "link": "https://www.naturalnews.com/2025-10-02-israel-cruel-ultimatum-leave-gaza-terrorist.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "Trump repositions himself at the forefront of Middle East diplomacy as Gaza death toll rises above 66,000",
    "description": "Trump has repositioned himself at the forefront of Middle East diplomacy, claiming “something special” is on the horizon as the Gaza war’s death toll breaches 66,000, many of them women and children. In a message radiating confidence, he asserted that all sid…",
    "link": "https://www.naturalnews.com/2025-10-02-trump-repositions-himself-at-forefront-middle-east-diplomacy.html",
    "timestamp": "2025-10-02T06:00:00Z"
  },
  {
    "title": "'Asim Munir looked like a salesman': Pakistan senator mocks army chief’s display of rare earths to Donald Trump",
    "description": "Pakistani Senator Aimal Wali Khan sharply criticized Army Chief Asim Munir for presenting rare earth minerals to Donald Trump, questioning his official capacity. A White House photo showed Munir and PM Sharif showcasing potential resources, leading to a milit…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/asim-munir-looked-like-a-salesman-pakistan-senator-mocks-army-chiefs-display-of-rare-earths-to-donald-trump/articleshow/124269433.cms",
    "timestamp": "2025-10-02T05:55:42Z"
  },
  {
    "title": "White House says firings 'imminent' as plan to reopen gov't collapses",
    "description": "Efforts to swiftly end the U.S. government shutdown collapsed Wednesday as Democrats in Congress went home without resolving a funding stand-off with President Donald Trump — and the White House threatened public sector jobs.",
    "link": "https://www.hurriyetdailynews.com/white-house-says-firings-imminent-as-plan-to-reopen-govt-collapses-214216",
    "timestamp": "2025-10-02T05:55:00Z"
  },
  {
    "title": "Rep. Dean to House Speaker: \"our allies are looking elsewhere\" as Trump posts AI videos",
    "description": "Representative Madeleine Dean confronted House Speaker Mike Johnson on Capitol Hill, warning that US allies are looking elsewhere while enemies laugh at President Donald Trump's behavior. Dean called Trump \"unwell\" during the Tuesday, September 30, exchange c…",
    "link": "https://economictimes.indiatimes.com/news/international/us/rep-dean-to-house-speaker-our-allies-are-looking-elsewhere-as-trump-posts-ai-videos/articleshow/124269989.cms",
    "timestamp": "2025-10-02T05:45:17Z"
  },
  {
    "title": "Stephen Colbert Spots Sign World Leaders Are Trolling Trump",
    "description": "The \"Late Show\" host said a comment cited by the president doesn't exactly sound like a compliment.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-gold-oval-office_n_68ddf6b4e4b06c0a3a8c842c",
    "timestamp": "2025-10-02T05:43:47Z"
  },
  {
    "title": "Zelensky At European Summit As EU Seeks To Bolster Backing",
    "description": "Ukraine's President Volodymyr Zelensky is set to join talks with leaders from across Europe in Copenhagen Thursday, as the EU seeks to bolster Kyiv's fight against Russia in the face of dwindling US support.",
    "link": "https://www.ibtimes.com/zelensky-european-summit-eu-seeks-bolster-backing-3785190",
    "timestamp": "2025-10-02T05:42:18Z"
  },
  {
    "title": "The impact of US govt shutdown on the federal workforce",
    "description": "The US federal government has shut down after President Trump and Congress failed to agree on a spending bill, marking the first such event since 2019. This crisis leaves thousands of federal workers furloughed or working without pay, including essential pers…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/the-impact-of-us-govt-shutdown-on-the-federal-workforce/articleshow/124269961.cms",
    "timestamp": "2025-10-02T05:39:36Z"
  },
  {
    "title": "Zelensky at European summit as EU seeks to bolster backing",
    "description": "Ukraine’s President Volodymyr Zelensky is set to join talks with leaders from across Europe in Copenhagen Thursday, as the EU seeks to bolster Kyiv’s fight against Russia in the face of dwindling US support. Heads of state and governments from just under 50 c…",
    "link": "https://www.digitaljournal.com/world/zelensky-at-european-summit-as-eu-seeks-to-bolster-backing/article",
    "timestamp": "2025-10-02T05:37:20Z"
  },
  {
    "title": "Zelensky at European summit as EU seeks to bolster backing",
    "description": "Ukraine's President Volodymyr Zelensky is set to join talks with leaders from across Europe in Copenhagen Thursday, as the EU seeks to bolster Kyiv's fight...",
    "link": "https://www.yahoo.com/news/articles/zelensky-european-summit-eu-seeks-053634453.html",
    "timestamp": "2025-10-02T05:36:34Z"
  },
  {
    "title": "Türkiye following up on F-35 procurement process: Erdoğan",
    "description": "President Recep Tayyip Erdogan said Wednesday that Ankara is pursuing the delivery of F-35 jets from the U.S. after making payments.",
    "link": "https://www.hurriyetdailynews.com/turkiye-following-up-on-f-35-procurement-after-us-payment-erdogan-214214",
    "timestamp": "2025-10-02T05:31:00Z"
  },
  {
    "title": "'What The F**k': 'Daily Show' Hits Trump With 1 Stunning Request Over His AI Videos",
    "description": "Ronny Chieng revealed why he's confused by the president's attempt to find \"compromise\" with Democrats.",
    "link": "https://www.huffpost.com/entry/daily-show-ronny-chieng-donald-trump-ai-deepfake-videos_n_68ddf751e4b06c0a3a8c8438",
    "timestamp": "2025-10-02T05:30:37Z"
  },
  {
    "title": "Why Trump’s pledge to defend Qatar is so extraordinary",
    "description": "President Donald Trump has bestowed upon the nation of Qatar a remarkable security guarantee that could include coming to its defense militarily. In an executive order dated earlier this week, Trump declared that the United States will regard any attack on Qa…",
    "link": "https://freerepublic.com/focus/f-news/4343857/posts",
    "timestamp": "2025-10-02T05:23:35Z"
  },
  {
    "title": "New footage shows House Speaker Mike Johnson's response to Rep. Dean's comments on Trump",
    "description": "Additional footage emerged showing House Speaker Mike Johnson's interaction with Representative Madeleine Dean during a Capitol Hill confrontation where Dean called President Donald Trump \"unhinged\" and \"unwell.\" The exchange occurred Tuesday, September 30, f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-footage-shows-house-speaker-mike-johnsons-response-to-rep-deans-comments-on-trump/articleshow/124269626.cms",
    "timestamp": "2025-10-02T05:20:08Z"
  },
  {
    "title": "G7 ministers to target those increasing Russia oil purchases",
    "description": "G7 finance ministers pledged Wednesday to take aim at those who are continuing to step up purchases of Russian oil, since Moscow's invasion of Ukraine more than three years ago.",
    "link": "https://www.hurriyetdailynews.com/g7-ministers-to-target-those-increasing-russia-oil-purchases-214213",
    "timestamp": "2025-10-02T05:17:00Z"
  },
  {
    "title": "Trump uses government shutdown to dole out firings and political punishment",
    "description": "President Donald Trump has seized on the government shutdown as an opportunity to reshape the federal workforce and punish detractors",
    "link": "https://abcnews.go.com/US/wireStory/trump-government-shutdown-dole-firings-political-punishment-126141242",
    "timestamp": "2025-10-02T05:10:20Z"
  },
  {
    "title": "In Black columnist's firing, advocates fear decreasing diversity, vital perspectives in news media",
    "description": "Karen Attiah, a former opinion columnist at The Washington Post, says she was fired after social media posts expressing concerns about gun violence and rhetoric against Black women",
    "link": "https://abcnews.go.com/US/wireStory/black-columnists-firing-advocates-fear-decreasing-diversity-vital-126141425",
    "timestamp": "2025-10-02T05:10:19Z"
  },
  {
    "title": "U.S. targets Iran's nuclear program, weapons procurement",
    "description": "The United States is blacklisting 44 individuals and firms accused of being involved in Iran's nuclear program and weapons procurement network.",
    "link": "https://www.upi.com/Top_News/US/2025/10/02/Iran-sanctions/4581759379261/",
    "timestamp": "2025-10-02T05:10:09Z"
  },
  {
    "title": "The clean energy revolution – a reason to be hopeful – podcast",
    "description": "Why might authoritarians fear the rise of solar energy? With Bill McKibben\nLast week Donald Trump let the UN general assembly know exactly what he thought about renewable energy sources. “I’ve been right about everything and I’m telling you that if you don’t …",
    "link": "https://biztoc.com/x/008bc21d3d60e8aa",
    "timestamp": "2025-10-02T05:07:06Z"
  },
  {
    "title": "European markets set to open higher, building on positive momentum",
    "description": "European stocks are expected to open higher on Thursday, building on positive momentum in the previous session.",
    "link": "https://www.cnbc.com/2025/10/02/european-markets-on-oct-2-stoxx-600-ftse-dax-cac.html",
    "timestamp": "2025-10-02T05:03:10Z"
  },
  {
    "title": "Today I will discuss House of Beamish. I think I remember the plot from history class, but we were all quite drunk",
    "description": "Much like Downton Abbey, House of Guinness is best treated as a delightful hallucinatory cheese dream",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/10/02/today-i-will-be-discussing-house-of-beamish-i-think-i-remember-the-plot-from-history-class-but-we-were-all-quite-drunk-at-school/",
    "timestamp": "2025-10-02T05:00:01Z"
  },
  {
    "title": "Jimmy Kimmel Takes Aim at FCC Amid Government Shutdown: ‘We Can Now Say Whatever We Want’ | Video",
    "description": "\"There is some silver lining to the shutdown,\" the \"Jimmy Kimmel Live!\" host adds\nThe post Jimmy Kimmel Takes Aim at FCC Amid Government Shutdown: ‘We Can Now Say Whatever We Want’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/jimmy-kimmel-fcc-joke-government-shut-down-opening-monologue/",
    "timestamp": "2025-10-02T04:57:20Z"
  },
  {
    "title": "Supreme Court allows the Fed's Lisa Cook to stay in office for now as Trump pushes to fire her",
    "description": "WASHINGTON — The Supreme Court on Wednesday deferred action on whether President Donald Trump can immediately fire Federal Reserve board member Lisa Cook, instead agreeing to hear oral arguments in the case early next year.\nThe move means that Cook can remain…",
    "link": "https://biztoc.com/x/6e03406fbe18e433",
    "timestamp": "2025-10-02T04:56:03Z"
  },
  {
    "title": "Report: Musk becomes first person to be worth $500 billion",
    "description": "Elon Musk has become the first person estimated to reach a net worth of $500 billion, according to US magazine Forbes, largely held in shares of electric...",
    "link": "https://dpa-international.com/economics/urn:newsml:dpa.com:20090101:251002-99-211868/",
    "timestamp": "2025-10-02T04:54:26Z"
  },
  {
    "title": "Drones, frozen billions and a Hungarian villain: Copenhagen’s Scandi-noir summit",
    "description": "Reality rivals fiction as Denmark hosts EU leaders amid drone chaos and a €185bn Russian asset heist. Even Birgitte Nyborg would struggle to keep up",
    "link": "https://www.irishtimes.com/world/europe/2025/10/02/drones-frozen-billions-and-a-hungarian-villain-copenhagens-scandi-noir-summit/",
    "timestamp": "2025-10-02T04:45:00Z"
  },
  {
    "title": "Taiwan rejects U.S. proposal of '50-50' chip production, says trade talks focused on tariffs",
    "description": "Vice Premier Cheng Li-chiun said the arrangement was \"not discussed,\" as she returned from trade talks in the U.S., according to Taiwan's Central News Agency.",
    "link": "https://www.cnbc.com/2025/10/02/taiwan-us-chip-production-tsmc-trade-tariffs.html",
    "timestamp": "2025-10-02T04:38:39Z"
  },
  {
    "title": "Belarus opposition leader vanishes after refusing deportation in a US-brokered prisoner release",
    "description": "Veteran Belarus opposition leader Mikalai Statkevich has vanished after refusing to leave the country in a U.S.-negotiated prisoner release in September, and human rights activists are demanding the government reveal his whereabouts",
    "link": "https://abcnews.go.com/International/wireStory/belarus-opposition-leader-vanishes-after-refusing-deportation-us-126141694",
    "timestamp": "2025-10-02T04:38:27Z"
  },
  {
    "title": "Federal government shutdown sparks blame game in crucial race for governor",
    "description": "New Jersey gubernatorial candidates Jack Ciattarelli and Rep. Mikie Sherrill clash over government shutdown blame in the high profile showdown, one of only two 2025 elections for governor",
    "link": "https://www.foxnews.com/politics/federal-government-shutdown-impacts-crucial-race-governor",
    "timestamp": "2025-10-02T04:37:22Z"
  },
  {
    "title": "Todd Chrisley Was 'Not in Favor' of Savannah Airing Their Family Drama",
    "description": "Todd Chrisley has admitted he was not a fan of daughter Savannah airing their family’s dirty laundry on TV. Speaking on the Wednesday, October 1 episode of the “Chrisley Confessions 2.0.” podcast, Todd said he would have preferred the drama between Savannah h…",
    "link": "https://www.usmagazine.com/celebrity-news/news/todd-chrisley-reacts-to-savannah-exposing-family-drama-on-tv/#article",
    "timestamp": "2025-10-02T04:30:30Z"
  },
  {
    "title": "Hollywood horror sequence: What looks like protection could lead to dejection in America’s film industry",
    "description": "As globalized filmmaking lets US studios shave millions off budgets and helps keep blockbusters profitable, Trump’s new 100% film tariff is likely to hit American movies the hardest. Plus, anyone brave enough to accept the task of ensuring compliance will fac…",
    "link": "https://www.livemint.com/opinion/online-views/us-film-tariff-trump-indian-vfx-industry-impact-bollywood-box-office-digital-content-hollywood-production-costs-avengers-11759313958071.html",
    "timestamp": "2025-10-02T04:30:06Z"
  },
  {
    "title": "Ali Sawafta: Donald Trump’s Gaza peace plan sets very tough path for Palestinian Authority",
    "description": "Driven out of Gaza two decades ago by Hamas, strapped for cash and headquartered in the Israeli-occupied West Bank, the Palestinian Authority’s (PA) hopes of running a future Palestinian state have long seemed bleak.",
    "link": "https://www.independent.ie/opinion/analysis/ali-sawafta-donald-trumps-gaza-peace-plan-sets-very-tough-path-for-palestinian-authority/a2087510602.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "US vote to end government shutdown fails as Democrats stand by demands",
    "description": "A vote to end the US government shutdown hours after it began failed yesterday, as Democrats in the Senate held firm to the party’s demands to fund healthcare subsidies that American president Donald Trump and Republicans are refusing to provide.",
    "link": "https://www.independent.ie/world-news/north-america/us-vote-to-end-government-shutdown-fails-as-democrats-stand-by-demands/a1651051016.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: As brazen Putin pushes boundaries, EU must stand up",
    "description": "In the Cold War it was considered delusional not to be paranoid. Fears were so stoked that real ­dangers could not be differentiated from the imaginary. But there was nothing histrionic or hyperbolic in Denmark’s prime minister ­warning that Europe is facing …",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-as-brazen-putin-pushes-boundaries-eu-must-stand-up/a1235667778.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "EU leaders discuss plan for ‘drone wall’ to protect eastern flank from Russians",
    "description": "EU leaders, including Taoiseach Micheál Martin, yesterday discussed plans to bolster the bloc’s eastern defences against Russian drones, but some said the focus should be broader.",
    "link": "https://www.independent.ie/world-news/europe/eu-leaders-discuss-plan-for-drone-wall-to-protect-eastern-flank-from-russians/a1427063840.html",
    "timestamp": "2025-10-02T04:30:00Z"
  },
  {
    "title": "Both parties blame each other on first day of US government shutdown as tourist sites close",
    "description": "Republicans and Democrats are locked in a blame game over the federal government shutdown, which has closed iconic sites nationwide. The Trump administration falsely claims Democrats want to fund healthcare for undocumented immigrants, while Democrats accuse …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/both-parties-blame-each-other-on-first-day-of-us-government-shutdown-as-tourist-sites-close/articleshow/124269095.cms",
    "timestamp": "2025-10-02T04:13:42Z"
  },
  {
    "title": "The Government Shutdown Is a Distraction—From Our $37 Trillion Debt",
    "description": "The federal government just accumulated an additional $2 trillion in debt over the last 12 months. That's the kind of…",
    "link": "https://reason.com/2025/10/02/the-government-shutdown-is-a-distraction-from-our-37-trillion-debt/",
    "timestamp": "2025-10-02T04:09:02Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers spent $49 million on Meta ads using AI deepfakes of US politicians, including Trump, to push fake benefits targeting seniors, a watchdog found. Despite removals, many accounts kept running ads.",
    "link": "https://economictimes.indiatimes.com/tech/technology/deepfake-political-scam-ads-surge-on-meta-platforms-watchdog-says/articleshow/124269021.cms",
    "timestamp": "2025-10-02T04:05:08Z"
  },
  {
    "title": "Where does the Arab and Muslim world stand on Trump’s Gaza peace plan? Expert Q&A",
    "description": "By Scott Lucas, University College Dublin The US president, Donald Trump, unveiled a 20-point proposal to end the war in Gaza on September 29. The plan proposes an immediate end to the fighting and the release of all Israeli hostages held by Hamas in exchange…",
    "link": "https://www.juancole.com/2025/10/muslim-trumps-expert.html",
    "timestamp": "2025-10-02T04:04:43Z"
  },
  {
    "title": "Seth Meyers Roasts Trump For Being Totally 'Obsessed' With This Weird Strategy",
    "description": "Seth Meyers Roasts Trump For Being Totally 'Obsessed' With This Weird Strategyhuffpost.com",
    "link": "https://www.huffpost.com/entry/seth-meyers-donald-trump-shutdown-negotiations_n_68dde7bfe4b028d81f3059a8",
    "timestamp": "2025-10-02T04:03:23Z"
  },
  {
    "title": "Dogecoin Mining Gets $2.5M Boost From Trump-Linked Thumzup Media",
    "description": "According to multiple reports, Thumzup Media Corporation has provided a $2.5 million loan to DogeHash Technologies to help expand Dogecoin mining operations. Related Reading: Chinese National At Center Of Historic $6.7B Crypto Bust Pleads Guilty The cash is t…",
    "link": "https://bitcoinist.com/dogecoin-mining-gets-2-5m-boost-from-trump-linked-thumzup-media/",
    "timestamp": "2025-10-02T04:00:53Z"
  },
  {
    "title": "Where is Europe’s economic drone wall?",
    "description": "Europe needs the economic equivalent of a drone wall to preserve its security and sovereignty. But that would require member states to hand new powers and funding to Brussels",
    "link": "https://www.euractiv.com/opinion/where-is-europes-economic-drone-wall/",
    "timestamp": "2025-10-02T04:00:48Z"
  },
  {
    "title": "Imagine You’re Woke…",
    "description": "Having watched Secretary of War Pete Hegseth’s speech to the military brass this week, I allowed myself to wonder what it is like for the woke in this country. It isn’t out of concern for them as much as it is understanding your foes in t...",
    "link": "https://www.americanthinker.com/articles/2025/10/imagine_you_re_woke.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "The Antifa War Instigators",
    "description": "Some things never change. Last Saturday, Ron Wyden, Oregon’s senior Democrat U.S. senator, made a ballsy -- if unintended -- declaration in a X post. Wyden proclaimed: “My message to Donald Trump is this: we don’t need you here. Sta...",
    "link": "https://www.americanthinker.com/articles/2025/10/the_antifa_war_instigators.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Revenge, lawfare, and justice",
    "description": "President Trump has been accused by Democrats and many pens and voices in the liberal American media of mere revenge-seeking in his insistence that AG Pam Bondi and the FBI thoroughly investigate James Comey, former FBI director, and John Brennan, fo...",
    "link": "https://www.americanthinker.com/blog/2025/10/revenge_lawfare_and_justice.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Will Trump bunker-bust the Marxist administrative state?",
    "description": "Can anyone dismantle the administrative state?\r\n\r\nOnly one president has had both the desire and opportunity to crush and disable the administrative state, but more importantly, end the Marxist dialectic that has infected and subsumed this nation and...",
    "link": "https://www.americanthinker.com/blog/2025/10/will_trump_bunker_bust_the_marxist_administrative_state.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Why climate models fail",
    "description": "Mainstream climatology models are fundamentally flawed because they ignore a now established physical reality: gravity — not radiative forcing — governs the temperature gradient in the troposphere.  This gradient arises from gra...",
    "link": "https://www.americanthinker.com/blog/2025/10/why_climate_models_fail.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Attention Department of War: Lessons Israel Learned from the Yom Kippur War … The Hard Way",
    "description": "Although the United States is widely acknowledged as the most powerful military force on earth, we haven’t decisively won a war since the hawkish-sounding Department of War became the peaceful-sounding Department of Defense, way back in 1947.&n...",
    "link": "https://www.americanthinker.com/articles/2025/10/attention_department_of_war_lessons_israel_learned_in_the_yom_kippur_war_the_hard_way.html",
    "timestamp": "2025-10-02T04:00:00Z"
  },
  {
    "title": "Sarah Paulson, Glenn Close and Caitlyn Jenner appear in The Kardashians season seven teaser",
    "description": "The first trailer for The Kardashians season seven has teased appearances from Sarah Paulson, Niecy Nash, Glenn Close and Caitlyn Jenner. The Kardashian clan – all of them – are back for the seventh season of The Kardashians on Hulu, with a first look at the …",
    "link": "https://www.thepinknews.com/2025/10/02/the-kardashians-season-seven-sarah-paulson-caitlyn-jenner/",
    "timestamp": "2025-10-02T03:59:34Z"
  },
  {
    "title": "Here’s how an ancient Indian craft is suffering under Trump’s tariffs",
    "description": "Country‘s traditional craftmanship, from brassworks to textiles, jewelry and pashmina is under threat as US hikes import duties to 50% Read Full Article at RT.com",
    "link": "https://www.rt.com/india/625644-our-livelihood-is-at-stake/",
    "timestamp": "2025-10-02T03:58:55Z"
  },
  {
    "title": "Trump jeopardizing U.S. role as scientific leader: Nobel officials",
    "description": "Donald Trump's assault on science could threaten the United States' position as the world's leading research nation and have knock-on effects worldwide, Nobel Prize officials in Sweden told AFP. Since taking office in January, the U.S. president has cut billi…",
    "link": "https://japantoday.com/category/world/trump-jeopardising-us-role-as-scientific-leader-nobel-officials",
    "timestamp": "2025-10-02T03:58:09Z"
  },
  {
    "title": "Trump Set to Discuss Soybean Purchases With China's Xi",
    "description": "US President Donald Trump says he will press Chinese President Xi Jinping to restart purchases of soybeans when the two meet ...",
    "link": "https://biztoc.com/x/537322aa290d3bb6",
    "timestamp": "2025-10-02T03:56:55Z"
  },
  {
    "title": "Trump 2.0 tariff tracker - Trade Compliance Resource Hub",
    "description": "Trump 2.0 tariff trackerTrade Compliance Resource Hub Wall Street, Republicans and some courts have tried to stop Trump’s tariffs. Here’s why they’re still in placeCNN The industries hit hardest by Donald Trump's sweeping tariffsAustralian Broadcasting Corpor…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179623266",
    "timestamp": "2025-10-02T03:52:40Z"
  },
  {
    "title": "Isuzu to build first independent U.S. plant",
    "description": "The Japanese commercial vehicle maker aims to ease the impact of high U.S. tariffs by expanding local production.",
    "link": "https://www.japantimes.co.jp/business/2025/10/02/companies/isuzu-first-us-plant/",
    "timestamp": "2025-10-02T03:51:00Z"
  },
  {
    "title": "‘Comey’s Home Free’: George Conway Argues Former FBI Director Is Off the Hook Thanks To ‘Invalid’ Indictment",
    "description": "Conservative attorney George Conway said former FBI Director James Comey is \"home free\" after being indicted by the Department of Justice.\nThe post ‘Comey’s Home Free’: George Conway Argues Former FBI Director Is Off the Hook Thanks To ‘Invalid’ Indictment fi…",
    "link": "https://www.mediaite.com/media/tv/comeys-home-free-george-conway-argues-former-fbi-director-is-off-the-hook-thanks-to-invalid-indictment/",
    "timestamp": "2025-10-02T03:50:41Z"
  },
  {
    "title": "Newly elected Arizona lawmaker has yet to be sworn into office, as House Democrats welcome her",
    "description": "A week after her decisive win in an Arizona special election for the U.S. House, Democrat Adelita Grijalva has yet to take office",
    "link": "https://abcnews.go.com/Politics/wireStory/newly-elected-arizona-lawmaker-sworn-office-house-democrats-126137030",
    "timestamp": "2025-10-02T03:50:27Z"
  },
  {
    "title": "Chevrolet EV Sales Grew 86% in 3rd Quarter",
    "description": "As we expected, automakers had a strong quarter of EV sales in the 3rd quarter in the USA, and that includes Chevrolet. GM’s mass-market brand scored 37,114 EV sales last quarter, up 86.2% from 19,933 sales in the 3rd quarter of 2024. However, it’s not just a…",
    "link": "https://cleantechnica.com/2025/10/01/chevrolet-ev-sales-grew-86-in-3rd-quarter/",
    "timestamp": "2025-10-02T03:50:26Z"
  },
  {
    "title": "Gold Prices Hold Five-Day Rally On Fed Cut Bets, US Shutdown Concerns",
    "description": "Gold steadied — following a five-day rally that saw it reach successive records — as the US government shutdown began and traders added to bets on Federal Reserve interest-rate cuts following weak private payrolls data.",
    "link": "https://www.ndtvprofit.com/markets/gold-prices-hold-five-day-rally-on-fed-cut-bets-us-shutdown-concerns",
    "timestamp": "2025-10-02T03:49:03Z"
  },
  {
    "title": "Democrats voted for a shutdown. Now they have to find a way out",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn’t extend or restore health care benefits, choosing instead to force a government shutdown",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-voted-shutdown-now-find-126135933",
    "timestamp": "2025-10-02T03:42:29Z"
  },
  {
    "title": "Democrats voted for a shutdown. Now they have to find a way out",
    "description": "Senate Democrats kept their promise to reject any Republican spending bill that didn’t extend or restore health care benefits, choosing instead to force a government shutdown",
    "link": "https://abcnews.go.com/Health/wireStory/democrats-voted-shutdown-now-find-126135932",
    "timestamp": "2025-10-02T03:42:28Z"
  },
  {
    "title": "US to Provide Ukraine With Intelligence for Strikes Deep Into Russia - Reports",
    "description": "US President Donald Trump has allowed intelligence agencies and the Pentagon to provide Ukraine with intelligence for strikes deep into Russia against energy infrastructure facilities, The Wall Street Journal newspaper reported, citing US officials.",
    "link": "https://sputnikglobe.com/20251002/us-to-provide-ukraine-with-intelligence-for-strikes-deep-into-russia---reports-1122896149.html",
    "timestamp": "2025-10-02T03:42:00Z"
  },
  {
    "title": "50 years later, 'Thrilla in Manila' remains greatest boxing match of all time",
    "description": "Muhammad Ali and Joe Frazier fought the \"Thrilla in Manila\" 50 years ago. It's still viewed as the greatest and most brutal boxing match ever.",
    "link": "https://sports.yahoo.com/article/50-years-later-thrilla-manila-034134192.html",
    "timestamp": "2025-10-02T03:41:34Z"
  },
  {
    "title": "Race to Replace Gavin Newsom Continues Thin as Longtime Calif. Legislator Exits",
    "description": "Race to replace Gavin Newsom continues to thin as longtime Calif. legislator exitsThe California governor’s race is continuing to slim down. Toni Atkins, the first openly gay president pro tempore of the California State Senate, and a longtime legislator, bec…",
    "link": "https://freerepublic.com/focus/f-news/4343851/posts",
    "timestamp": "2025-10-02T03:38:39Z"
  },
  {
    "title": "Ted Cruz Edits Sombreros Onto 44 Senate Democrats: ‘Will Continue Until They Re-Open Our Government’",
    "description": "Sen. Ted Cruz (R-TX) edited sombreros and moustaches onto 44 Senate Democrats, threatening to \"continue until they re-open our government.\"\nThe post Ted Cruz Edits Sombreros Onto 44 Senate Democrats: ‘Will Continue Until They Re-Open Our Government’ first app…",
    "link": "https://www.mediaite.com/politics/ted-cruz-edits-sombreros-onto-44-senate-democrats-will-continue-until-they-re-open-our-government/",
    "timestamp": "2025-10-02T03:37:03Z"
  },
  {
    "title": "Poll: Winsome Earle-Sears Surges Within Margin of Error Against Abigail Spanberger in Virginia Governor’s Race",
    "description": "An A2 Insights poll shows Republican Lt. Gov. Winsome Earle-Sears narrowing the gap against Democrat Abigail Spanberger in Virginia’s gubernatorial contest, placing the race within the margin of error as voters head into the final stretch before November’s el…",
    "link": "https://www.breitbart.com/politics/2025/10/01/poll-winsome-earle-sears-surges-margin-error-abigail-spanberger-virginia/",
    "timestamp": "2025-10-02T03:35:07Z"
  },
  {
    "title": "FBI cuts ties with Anti-Defamation League amid conservative backlash",
    "description": "FBI Director Kash Patel announces break with anti-Semitism watchdog amid outrage over description of Charlie Kirk.",
    "link": "https://www.aljazeera.com/news/2025/10/2/fbi-cuts-ties-with-anti-defamation-league-amid-conservative-backlash",
    "timestamp": "2025-10-02T03:30:19Z"
  },
  {
    "title": "Deepfake political scam ads surge on Meta platforms, watchdog says",
    "description": "Scammers are among the top political ad spenders on Meta's platforms, using deepfake videos of American politicians including President Donald Trump to promote fake government benefits, a watchdog group said Wednesday. One advertiser identified by TTP called …",
    "link": "https://timesofindia.indiatimes.com/world/us/deepfake-political-scam-ads-surge-on-meta-platforms-watchdog-says/articleshow/124268531.cms",
    "timestamp": "2025-10-02T03:27:53Z"
  }
]