[
  {
    "title": "Did the US Really “Manufacture” the Bitcoin Crash? What to Know About the MSTR Buyout Rumor",
    "description": "Speculation is swirling that the US “manufactured” Bitcoin’s crash, but evidence points elsewhere, not government buyout plots.",
    "link": "https://beincrypto.com/us-government-bitcoin-crash-microstrategy-fact-check/",
    "timestamp": "2025-11-23T18:59:27Z"
  },
  {
    "title": "Yes, Zohran Mamdani Still Thinks Trump Is a Fascist",
    "description": "After his surprisingly warm meeting with President Donald Trump, NYC Mayor-elect Zohran Mamdani reiterated that yes, he still believes Trump is a fascist. During an interview with NBC’s Meet the Press on Sunday, Kristen Welker pressed Mamdani about the recent…",
    "link": "https://newrepublic.com/post/203567/nyc-zohran-mamdani-trump-fascist",
    "timestamp": "2025-11-23T18:56:48Z"
  },
  {
    "title": "'I thought he might have a coronary': Ex-White House reporter recounts showdown with Trump",
    "description": "A former White House reporter thought Donald Trump was going to have a coronary when the journalist didn't listen to his demand to \"shut up.\"Brian J. Karem, who famously asked Trump if he would commit to a peaceful transfer of power if he lost the 2020 electi…",
    "link": "https://www.rawstory.com/trump-coronary-white-house-reporter/",
    "timestamp": "2025-11-23T18:54:51Z"
  },
  {
    "title": "Cheryl Hines says 'stress' of RFK Jr's decision to endorse Trump led to urgent care visit",
    "description": "Cheryl Hines reveals how her marriage to RFK Jr. once caused severe stress, hives, and an urgent care visit during his challenging presidential campaign.",
    "link": "https://www.foxnews.com/entertainment/cheryl-hines-suffered-serious-health-emergency-after-rfk-jr-discussed-endorsing-trump",
    "timestamp": "2025-11-23T18:52:54Z"
  },
  {
    "title": "Trump Administration Ponders Allowing Nvidia To Trade H200 AI Chips With China",
    "description": "President Donald Trump’s administration is reportedly contemplating the possibility of permitting Nvidia Corp. (NASDAQ:NVDA) to trade its H200 artificial...",
    "link": "https://finance.yahoo.com/news/trump-administration-ponders-allowing-nvidia-185144514.html",
    "timestamp": "2025-11-23T18:51:44Z"
  },
  {
    "title": "Fifty children kidnapped from Nigerian Catholic school escape captivity",
    "description": "Gunmen on Friday raided St Mary’s co-education school in Niger state, taking 303 children and 12 teachers in one of the largest mass kidnappings in Nigeria.",
    "link": "https://www.thejournal.ie/nigeria-catholic-kidnapping-6883679-Nov2025/",
    "timestamp": "2025-11-23T18:50:22Z"
  },
  {
    "title": "Trump: MTG Resignation ‘Great News for the Country’",
    "description": "President Donald Trump on Friday welcomed the announcement by Rep. Marjorie Taylor Greene (R-GA) that she will resign from Congress in January, characterizing the decision as a positive development and signaling no intention to repair their strained relations…",
    "link": "https://freerepublic.com/focus/f-news/4354196/posts",
    "timestamp": "2025-11-23T18:47:56Z"
  },
  {
    "title": "WATCH: Rubio gives updates on talks in Geneva over Trump’s Ukraine peace plan",
    "description": "Top Ukrainian envoys met with U.S. Secretary of State Marco Rubio in Geneva Sunday to discuss President Donald Trump’s proposal to end Russia’s war on Ukraine.",
    "link": "https://www.pbs.org/newshour/world/watch-rubio-gives-updates-on-talks-in-geneva-over-trumps-ukraine-peace-plan",
    "timestamp": "2025-11-23T18:46:16Z"
  },
  {
    "title": "Senate Democrat Says She’s ‘Not Aware’ of Trump Making ‘Illegal Orders’ — Despite Her Warning",
    "description": "Sen. Elissa Slotkin (D-MI) said she is “not aware” of President Donald Trump making any “illegal orders” to the military or intelligence service members, despite warning members earlier this week they “must refuse” such orders, if they come up. Slotkin was as…",
    "link": "https://www.mediaite.com/politics/senate-democrat-says-shes-not-aware-of-trump-making-illegal-orders-despite-her-warning/",
    "timestamp": "2025-11-23T18:45:45Z"
  },
  {
    "title": "Anthony Scaramucci On GOP's View Of Donald Trump: 'Trump Is A Lame Duck, If You're Inside His Inner Orbit, You Hate The Guy's Guts'",
    "description": "Anthony Scaramucci has shed light on the Republican Party’s actual sentiments about President Donald Trump, suggesting they are more negative than what is portrayed publicly.\nWhat Happened: Scaramucci hinted that Trump’s grip on the GOP is loosening. He portr…",
    "link": "https://biztoc.com/x/4218e26ed257eeaa",
    "timestamp": "2025-11-23T18:43:41Z"
  },
  {
    "title": "Backlash emerges after Trump criticizes Marjorie Taylor Greene online",
    "description": "President Donald Trump ignited a backlash inside his own MAGA base after launching a blistering attack on Rep. Marjorie Taylor Greene following her surprise resignation announcement. In a post on Truth Social, Trump mocked Greene’s “plummeting poll numbers,” …",
    "link": "https://www.rawstory.com/backlash-emerges-after-trump-criticizes-marjorie-taylor-greene-online/",
    "timestamp": "2025-11-23T18:42:57Z"
  },
  {
    "title": "No need for complete counterproposal to US peace plan, Meloni says",
    "description": "\"It makes more sense to work on the existing proposal and focus on the truly crucial issues\", Italy's PM stressed",
    "link": "https://www.euractiv.com/news/italys-meloni-says-no-need-for-complete-counterproposal-to-us-peace-plan/",
    "timestamp": "2025-11-23T18:41:52Z"
  },
  {
    "title": "‘Sedition Is a Major Crime’: Trump Hammers Democrats Who Told Military to Defy ‘Illegal Orders’",
    "description": "The group of Democrat lawmakers who told military members to disobey orders should be locked up, President Donald Trump proposed Saturday.Trump made his statements after those lawmakers, including Sen. Elissa Slotkin (D-MI), were featured in a video on Tuesda…",
    "link": "https://freerepublic.com/focus/f-news/4354194/posts",
    "timestamp": "2025-11-23T18:40:09Z"
  },
  {
    "title": "Mamdani Asked If He Still Thinks Trump Is A 'Fascist' And A 'Despot'",
    "description": "While the president changed his tune as to how he views Zohran Mamdani, the New York City Mayor-elect, on “Meet the Press” with moderator Kristen Welker, said that he still believes Donald Trump is a “fascist” and a “despot.\" We agree!\n\"In that press conferen…",
    "link": "https://crooksandliars.com/2025/11/mamdani-asked-if-he-still-thinks-trump",
    "timestamp": "2025-11-23T18:35:11Z"
  },
  {
    "title": "‘Reckless, Inappropriate, Irresponsible’: Rand Paul Denounces Trump Calling Democratic Lawmakers ‘TRAITORS’",
    "description": "Senator Rand Paul (R-KY) bashed President Donald Trump for referring to Democratic lawmakers as \"TRAITORS\" — denouncing the president's rhetoric as \"reckless.\"\nThe post ‘Reckless, Inappropriate, Irresponsible’: Rand Paul Denounces Trump Calling Democratic Law…",
    "link": "https://www.mediaite.com/media/news/reckless-inappropriate-irresponsible-rand-paul-denounces-trump-calling-democratic-lawmakers-traitors/",
    "timestamp": "2025-11-23T18:34:19Z"
  },
  {
    "title": "Trump Calls Ukraine Ungrateful, Again, for U.S. Support in War With Russia - The New York Times",
    "description": "Trump Calls Ukraine Ungrateful, Again, for U.S. Support in War With RussiaThe New York Times Top US and Ukrainian officials discuss peace plan as deadline looms - live updates | CNN PoliticsCNN Donald Trump attacks Ukrainian and European leaders as peace talk…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180186881",
    "timestamp": "2025-11-23T18:32:57Z"
  },
  {
    "title": "Transcript: Rep. Jason Crow on \"Face the Nation with Margaret Brennan,\" Nov. 23, 2025",
    "description": "The following is the transcript of the interview with Rep. Jason Crow, Democrat of Colorado, that aired on \"Face the Nation with Margaret Brennan\" on Nov. 23, 2025.",
    "link": "https://www.cbsnews.com/news/jason-crow-colorado-democrat-face-the-nation-transcript-11-23-2025/",
    "timestamp": "2025-11-23T18:32:21Z"
  },
  {
    "title": "Zelensky thanks Trump as US leader blasts at Kyiv amid talks",
    "description": "Ukrainian President Volodymyr Zelensky sought to win back Donald Trump’s favour on Sunday, after the US leader blasted at Kyiv amidst crucial talks in Geneva to end the war with Russia.\nThe US President, who is known for blowing hot and cold on Ukraine, earli…",
    "link": "https://biztoc.com/x/bfd5432c16b65bc5",
    "timestamp": "2025-11-23T18:32:11Z"
  },
  {
    "title": "G20 summit in South Africa ends with glaring U.S. absence after Trump’s boycott",
    "description": "The Group of 20 summit in South Africa ended Sunday with the glaring absence of the United States — the next country to lead the bloc — after the Trump administration boycotted the two days of talks involving leaders of the world's richest and top developing …",
    "link": "https://www.pbs.org/newshour/world/g20-summit-in-south-africa-ends-with-glaring-u-s-absence-after-trumps-boycott",
    "timestamp": "2025-11-23T18:31:08Z"
  },
  {
    "title": "'Rare rift' as Florida Republicans rage against Trump reversal",
    "description": "Florida Republicans are experiencing a “rare rift” between themselves and President Donald Trump over his proposal to open up new offshore drilling sites in the Gulf of Mexico, the Hill reports.According to the Hill, the Trump administration on Thursday propo…",
    "link": "https://www.rawstory.com/alternet-posts/trump-offshore-drilling/",
    "timestamp": "2025-11-23T18:29:30Z"
  },
  {
    "title": "Kathy Griffin: 'Thank God for gay' support",
    "description": "The unapologetic comedian even says the gays lifted her up when she was canceled after holding President Trump's severed head.",
    "link": "https://www.out.com/out100/kathy-griffin-gay-support",
    "timestamp": "2025-11-23T18:28:27Z"
  },
  {
    "title": "Sen Mark Kelly links Trump’s ‘death’ post to Charlie Kirk assassination, warns of violence",
    "description": "Sen. Mark Kelly, D-Ariz., linked Charlie Kirk’s assassination to President Donald Trump’s “sedition\" remarks while urging troops to reject any “illegal\" orders.",
    "link": "https://www.foxnews.com/media/sen-mark-kelly-links-trumps-death-post-charlie-kirk-assassination-warns-violence",
    "timestamp": "2025-11-23T18:25:58Z"
  },
  {
    "title": "Zelensky thanks Trump as US leader blasts at Kyiv amid talks",
    "description": "Trump said that Zelenskyy ‘expressed zero gratitude for our efforts’",
    "link": "https://www.euractiv.com/news/zelensky-thanks-trump-as-us-leader-blasts-at-kyiv-amid-talks/",
    "timestamp": "2025-11-23T18:21:53Z"
  },
  {
    "title": "Zelenskyy says Ukraine is grateful to US and Trump after president says Kyiv showed ‘zero gratitude’",
    "description": "Zelenskyy also expressed thanks to Europe and the G7 and G20 groupings of countries for their help, saying efforts to maintain this support were important.",
    "link": "https://indianexpress.com/article/world/volodymyr-zelenskyy-says-ukraine-is-grateful-for-efforts-by-us-trump-10382249/",
    "timestamp": "2025-11-23T18:15:42Z"
  },
  {
    "title": "Trump’s wild Mamdani flip — the insults that came before the love fest",
    "description": "President Donald Trump and NYC mayor-elect Zohran Mamdani appeared to end their bitter feud Friday, despite past heated insults like \"nut job\" and \"communist lunatic.\"",
    "link": "https://www.foxnews.com/politics/trumps-wild-mamdani-flip-insults-came-before-love-fest",
    "timestamp": "2025-11-23T18:14:54Z"
  },
  {
    "title": "U.S. senators say Rubio told them Trump’s Ukraine peace plan is Russian ‘wish list’",
    "description": "Lawmakers critical of President Donald Trump’s approach to ending the Russia-Ukraine war said Saturday they spoke with Secretary of State Marco Rubio who told them that the peace plan Trump is pushing Kyiv to accept is a “wish list” of the Russians and not th…",
    "link": "https://biztoc.com/x/4f6f66e207d4a82e",
    "timestamp": "2025-11-23T18:09:45Z"
  },
  {
    "title": "Rupee Slide: Short-term gains for some exports to be limited by 50% US tariffs",
    "description": "Indian garment and handicraft exporters face limited gains from a weaker rupee due to steep US tariffs. The rupee has hit a lifetime low against the dollar. While a depreciating rupee usually benefits traditional sectors, US tariffs are impacting sales. Buyer…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/rupee-slide-short-term-gains-for-some-exports-to-be-limited-by-50-us-tariffs/articleshow/125523748.cms",
    "timestamp": "2025-11-23T18:09:39Z"
  },
  {
    "title": "Donald Glover says doctors found a hole in his heart after suffering a stroke",
    "description": "Rapper, who retired his moniker Childish Gambino, was forced to cancel remainder of his tour last October due to health issues",
    "link": "https://www.the-independent.com/life-style/donald-glover-stroke-health-tour-b2870840.html",
    "timestamp": "2025-11-23T18:08:28Z"
  },
  {
    "title": "U.S. senators say Rubio told them Trump’s Ukraine peace plan is Russian ‘wish list’",
    "description": "Lawmakers critical of President Donald Trump’s approach to ending the Russia-Ukraine war said Saturday they spoke with Secretary of State Marco Rubio who told them that the peace plan Trump is pushing Kyiv to accept is a “wish list” of the Russians and not th…",
    "link": "https://www.pbs.org/newshour/world/u-s-senators-say-rubio-told-them-trumps-ukraine-peace-plan-is-russian-wish-list",
    "timestamp": "2025-11-23T18:05:15Z"
  },
  {
    "title": "​'Negative impact on my party': Swing-state Republicans worry Trump's plan will 'backfire'",
    "description": "Republicans in one swing state are worried Donald Trump's efforts in their area will \"backfire,\" according to a new report.This weekend, Politico published a report called ‘Is the price of doing this worth it?’: North Carolina Republicans worry about Trump im…",
    "link": "https://www.rawstory.com/trump-swing-state-backfire-impact/",
    "timestamp": "2025-11-23T18:03:05Z"
  },
  {
    "title": "Trump Pushes to Reopen California Coast to Offshore Drilling",
    "description": "New oil and gas drilling could commence in California if President Donald Trump gets his way, as the U.S. federal government continues to support a “Drill, baby, drill” approach to fossil fuel production.  In November, the Trump administration plans to allow …",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Pushes-to-Reopen-California-Coast-to-Offshore-Drilling.html",
    "timestamp": "2025-11-23T18:00:00Z"
  },
  {
    "title": "Mamdani Claims It’s ‘Important’ He Still Views Trump As ‘Fascist,’ ‘Threat To Democracy’ After White House Meeting",
    "description": "Democratic NYC Mayor-elect Zohran Mamdani stood by his calling President Trump a \"fascist\" and \"threat to democracy\" during a \"Meet the Press\" interview.",
    "link": "https://dailycaller.com/2025/11/23/zohran-mamdani-claims-important-view-donald-trump-fascist-threat-democracy-white-house-meeting-kristen-welker-meet-press/",
    "timestamp": "2025-11-23T17:56:23Z"
  },
  {
    "title": "Trumps says Ukraine's leaders show 'zero gratitude' for US efforts to end war",
    "description": "Trump's comments come as talks continue in Geneva over a leaked US peace plan seen as favouring Moscow.",
    "link": "https://www.bbc.com/news/articles/ce3zwy808dpo",
    "timestamp": "2025-11-23T17:50:34Z"
  },
  {
    "title": "Zohran Mamdani Stands By Calling Trump A Fascist After Rosy White House Meeting",
    "description": "\"That's something that I've said in the past. I say it today,\" New York City's mayor-elect said after a shockingly chummy meeting with the president.",
    "link": "https://www.huffpost.com/entry/zohran-mamdani-calling-trump-fascist-meeting_n_69233ed1e4b0ea2d5e754e84",
    "timestamp": "2025-11-23T17:49:00Z"
  },
  {
    "title": "Elon Musk’s Autobiography Will Definitely Be a Reliable, Trustworthy Document",
    "description": "He certainly has a lot to talk about.\nThe post Elon Musk’s Autobiography Will Definitely Be a Reliable, Trustworthy Document appeared first on Futurism.",
    "link": "http://futurism.com/future-society/elon-musk-autobiography",
    "timestamp": "2025-11-23T17:45:00Z"
  },
  {
    "title": "IRS to roll out Salesforce AI agents following workforce reduction: report",
    "description": "IRS deploys Salesforce AI agents across divisions after massive staffing reductions, aiming to help overworked staff process requests faster and more...",
    "link": "https://www.foxbusiness.com/technology/irs-roll-out-salesforce-ai-agents-following-workforce-reduction-report",
    "timestamp": "2025-11-23T17:43:54Z"
  },
  {
    "title": "Trump blasts Ukraine for 'zero gratitude' amid talks to halt war",
    "description": "U.S. President Donald Trump on Sunday accused Ukraine again of lacking \"gratitude\" for Washington's support against Russia's invasion, as top U.S. and Ukrainian representatives met in Geneva for talks on a proposal to halt the war.",
    "link": "https://www.hurriyetdailynews.com/trump-blasts-ukraine-for-zero-gratitude-amid-talks-to-halt-war-216042",
    "timestamp": "2025-11-23T17:43:10Z"
  },
  {
    "title": "T. Rowe Price insists investors will find 2026 less stressful",
    "description": "Maybe you have a big 401(k) account or an Individual Retirement Account. You would be within your rights if you found this week's market volatility — coming ...",
    "link": "https://www.thestreet.com/investing/t-rowe-price-insists-investors-will-find-2026-less-stressful",
    "timestamp": "2025-11-23T17:40:53Z"
  },
  {
    "title": "Trump’s signals to Zelensky and Europe: Accept this plan or you’re on your own",
    "description": "The 28-point plan hammered out by US and Russian envoys and put to Ukraine this week came with a deadline and an implicit threat: Sign up or face the risk of being abandoned. US President Donald Trump said Friday that Ukrainian leader Volodymyr Zelensky would…",
    "link": "https://freerepublic.com/focus/f-news/4354189/posts",
    "timestamp": "2025-11-23T17:40:12Z"
  },
  {
    "title": "Nearly 200,000 Ukrainians may lose right to stay in US – media",
    "description": "Processing of Ukrainian cases reportedly remains slow following a temporary pause tied to Trump’s border security measures Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/628242-us-legal-status-hundreds-ukrainians/",
    "timestamp": "2025-11-23T17:37:21Z"
  },
  {
    "title": "Hours After Marjorie Taylor Greene's Public Rebuke, Trump Responds With Restraint: 'She's A Nice Person'",
    "description": "President Donald Trump has changed his perspective on Rep. Marjorie Taylor Greene (R-Ga.) after her unexpected resignation from Congress.\nWhat Happened: Last week, Greene declared her resignation from Congress, effective from January 5, 2026, through a video …",
    "link": "https://biztoc.com/x/27d8c07f02295aaa",
    "timestamp": "2025-11-23T17:36:01Z"
  },
  {
    "title": "Rubio Says Good Progress Made at Geneva Talks on Ukraine",
    "description": "WASHINGTON (Sputnik) - US Secretary of State Marco Rubio said on Sunday that good progress had been achieved at Geneva talks on resolving the Ukraine conflict.",
    "link": "https://sputnikglobe.com/20251123/rubio-says-good-progress-made-at-geneva-talks-on-ukraine-1123159479.html",
    "timestamp": "2025-11-23T17:25:29Z"
  },
  {
    "title": "Abbott: Deployed Texas National Guard Troops Returning Home from Illinois Ahead of Thanksgiving",
    "description": "Governor Greg Abbott confirmed Saturday that Texas National Guard troops deployed to Illinois in October to support the federal Operation Midway Blitz immigration enforcement have been ordered to return to the Lone Star State before Thanksgiving.\nThe post Abb…",
    "link": "https://www.breitbart.com/border/2025/11/23/abbott-orders-deployed-texas-national-guard-troops-home-from-illinois-ahead-of-thanksgiving/",
    "timestamp": "2025-11-23T17:22:30Z"
  },
  {
    "title": "In full: Europe's 28-point counter proposal to US-Russia peace plan for Ukraine",
    "description": "The document uses the US plan as its basis, with suggestions for deletions and alterations.",
    "link": "https://news.sky.com/story/in-full-europes-28-point-counter-proposal-to-us-russia-peace-plan-for-ukraine-13474575",
    "timestamp": "2025-11-23T17:20:00Z"
  },
  {
    "title": "Vice President JD Vance's Wife Usha Addresses Wedding Ring Speculation",
    "description": "A spokesperson for Usha Vance is clarifying the status of the second lady’s marriage after she was spotted without her wedding ring. “[She is] a mother of three young children, who does a lot of dishes, gives lots of baths, and forgets her ring sometimes,” a …",
    "link": "https://www.usmagazine.com/celebrity-news/news/vice-president-jd-vances-wife-usha-addresses-wedding-ring-speculation/#article",
    "timestamp": "2025-11-23T17:16:26Z"
  },
  {
    "title": "\"Groceries,\" and Other Secrets of Managing Donald Trump (emptywheel)",
    "description": "emptywheel:\n“Groceries,” and Other Secrets of Managing Donald Trump  —  Three things happened in the last week that have befuddled a lot of observers, but which might best be understood as the kinds of developments we'll see increasingly as the power structur…",
    "link": "https://www.memeorandum.com/251123/p40",
    "timestamp": "2025-11-23T17:15:01Z"
  },
  {
    "title": "Mamdani stands by Trump criticism despite friendly White House meeting",
    "description": "New York City Mayor-elect Zohran Mamdani is standing by his past criticisms that President Donald Trump acted like a despot and a fascist",
    "link": "https://abcnews.go.com/US/wireStory/mamdani-stands-trump-criticism-despite-friendly-white-house-127803292",
    "timestamp": "2025-11-23T17:10:29Z"
  },
  {
    "title": "Mamdani on working with Trump: “I’m not coming into the Oval Office to make a stand”",
    "description": "The mayor said he's committed to working with Trump while still believing the president is a fascist.",
    "link": "https://www.salon.com/2025/11/23/mamdani-on-working-with-trump-im-not-coming-into-the-oval-office-to-make-a-stand/",
    "timestamp": "2025-11-23T17:09:24Z"
  },
  {
    "title": "When 'Harry' Trump met 'Sally' Mamdani",
    "description": "A curious rendezvous between Zohran Mamdani and Donald Trump caught everyone off guard, with pundits from across the spectrum weighing in on the friendly interaction. This unforeseen pairing has ignited vibrant discussions about its implications for the futur…",
    "link": "https://economictimes.indiatimes.com/opinion/just-in-jest/when-harry-trump-met-sally-mamdani/articleshow/125522692.cms",
    "timestamp": "2025-11-23T17:08:24Z"
  },
  {
    "title": "Congresswoman Maggie Goodlander response after office bomb threat",
    "description": "Congresswoman Maggie Goodlander speaks out after a potential bomb threat targeted her office in Concord on Friday.",
    "link": "https://www.wmur.com/article/nh-goodlander-bomb-threat-response-11232025/69521665",
    "timestamp": "2025-11-23T17:08:09Z"
  },
  {
    "title": "So What’s Next for MTG? Her Latest Social Posts Don’t Clarify Much.",
    "description": "What will Rep. Marjorie Taylor Greene (R-Ga.) do after her shock resignation from Congress in January, announced on Friday? Good question. President Donald Trump, for one, already seems to be reversing course on their breakup. Not long after (again) calling h…",
    "link": "https://www.motherjones.com/politics/2025/11/marjorie-taylor-greene-mtg-trump-2028/",
    "timestamp": "2025-11-23T17:07:54Z"
  },
  {
    "title": "Maria Shriver Supports Fellow Kennedy Tatiana Schlossberg Amid Terminal Cancer",
    "description": "Maria Shriver, niece of the late U.S. president John F. Kennedy, is supporting her family member Tatiana Schlossberg amid her terminal cancer diagnosis. “If you can only read one thing today, please make take the time for this extraordinary piece of writing b…",
    "link": "https://www.usmagazine.com/celebrity-news/news/maria-shriver-supports-tatiana-schlossberg-amid-terminal-cancer/#article",
    "timestamp": "2025-11-23T17:07:19Z"
  },
  {
    "title": "G20 summit boycotted by US closes in South Africa",
    "description": "South African President Cyril Ramaphosa says there is a \"renewed commitment to multilateral co-operation\".",
    "link": "https://www.bbc.com/news/articles/cvg130704zro",
    "timestamp": "2025-11-23T17:07:11Z"
  },
  {
    "title": "Vindman’s call to release Trump–MBS transcript reopens old questions in US–Saudi relationship",
    "description": "Trump grants Saudi Arabia major non-NATO ally status as crown prince pledges nearly $1 trillion in U.S. investments, creating new defense partnerships.",
    "link": "https://www.foxnews.com/politics/vindmans-call-release-trump-mbs-transcript-reopens-old-questions-us-saudi-relationship",
    "timestamp": "2025-11-23T17:05:31Z"
  },
  {
    "title": "How a J6 lawyer admitted Trump's own 'selective and vindictive' abuse of the law",
    "description": "Last week, the American Society of Criminology (ASC) held its 80th Annual Meetings in Washington, D.C\r\n. The theme was Criminology, Law, and the Democratic Ideal\r\n.On day two, I found myself in an impromptu debate with Roger Roots. The name may not be familia…",
    "link": "https://www.rawstory.com/raw-investigates/how-to-make-a-j6-lawyer-admit-trumps-own-prosecutions-are-selective-and-vindictive/",
    "timestamp": "2025-11-23T17:04:33Z"
  },
  {
    "title": "Mamdani stands by Trump criticism despite friendly White House meeting",
    "description": "WASHINGTON (AP) — New York City Mayor-elect Zohran Mamdani didn’t back down in an interview that aired Sunday from past criticism that President Donald Trump acted like a despot and a fascist after a surprisingly friendly White House meeting between the two m…",
    "link": "https://www.bostonherald.com/2025/11/23/mamdani-stands-by-trump-criticism-despite-friendly-white-house-meeting/",
    "timestamp": "2025-11-23T17:03:03Z"
  },
  {
    "title": "Zohran Mamdani Recounts Visit With Donald Trump",
    "description": "New York City Mayor-elect Zohran Mamdani on Sunday divulged some details of his visit with President Donald Trump.\nMany expected a tense and fractious meeting between the two New York natives, but instead they met the press with smiles and laughs, and Trump b…",
    "link": "https://biztoc.com/x/529fc48d1349823f",
    "timestamp": "2025-11-23T17:02:41Z"
  },
  {
    "title": "Made in America Again: Treasury Sec. Bessent Unveils First U.S.-Made Rare Earth Magnet in 25 Years",
    "description": "Sec. Bessent: \"We’re ending China’s chokehold on our supply chain.\"\nThe post Made in America Again: Treasury Sec. Bessent Unveils First U.S.-Made Rare Earth Magnet in 25 Years first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/11/made-in-america-again-treasury-sec-bessent-unveils-first-u-s-made-rare-earth-magnet-in-25-years/",
    "timestamp": "2025-11-23T17:00:47Z"
  },
  {
    "title": "Washington DC is Changing—And These Stats Prove It",
    "description": "Washington, D.C. has changed rapidly in 2025. President Donald Trump’s administration has sought to crack down on crime in the nation’s capital, and to great... Read More\nThe post Washington DC is Changing—And These Stats Prove It appeared first on The Daily …",
    "link": "https://www.dailysignal.com/2025/11/23/washington-dc-is-changing-and-these-stats-prove-it/",
    "timestamp": "2025-11-23T17:00:00Z"
  },
  {
    "title": "Trump Goes On Unhinged Tirade Against Dem “Traitors”",
    "description": "President Donald Trump’s rage has not cooled for the six Democrats who posted a video reminding military and intelligence personnel that their duty is to the Constitution, not to him. The president fired off two Truth Social posts late Saturday night in an al…",
    "link": "https://newrepublic.com/post/203565/trump-seditious-democrat-lawmakers-video",
    "timestamp": "2025-11-23T16:59:43Z"
  },
  {
    "title": "Venezuela: A not-so-covert CIA disaster in the making",
    "description": "Venezuela doesn’t even produce fentanyl, but Washington is still going forward with regime change efforts in Caracas.",
    "link": "https://www.aljazeera.com/opinions/2025/11/23/venezuela-a-not-so-covert-cia-disaster-in-the-making",
    "timestamp": "2025-11-23T16:56:58Z"
  },
  {
    "title": "First G20 on African soil undermined by Trump administration",
    "description": "US boycott and Ukraine talks deflected attention from Cyril Ramaphosa’s agenda",
    "link": "https://www.irishtimes.com/world/2025/11/23/first-g20-on-african-soild-undermined-by-trump-administration/",
    "timestamp": "2025-11-23T16:54:26Z"
  },
  {
    "title": "STEVE MILLOY: We Are More Vulnerable Than Ever To China’s Ominous Threats",
    "description": "I recently warned about the need to assess our vulnerability to Communist China in order to expedite the decoupling of our economy this dangerous rival.",
    "link": "https://dailycaller.com/2025/11/23/opinion-we-are-more-vulnerable-than-ever-to-several-ominous-threats-from-china-steve-milloy/",
    "timestamp": "2025-11-23T16:51:15Z"
  },
  {
    "title": "Trump hits pause button on sending National Guard to New York after his meeting with Mamdani",
    "description": "President Donald Trump has decided to pause sending the National Guard to New York City after meeting with the city's Mayor-elect Zohran Mamdani. The Republican leader has been thinking about whether or not to deploy troops to the Big Apple, similar to what h…",
    "link": "https://freerepublic.com/focus/f-news/4354182/posts",
    "timestamp": "2025-11-23T16:48:39Z"
  },
  {
    "title": "No recession risk for US economy as a whole, Bessent tells NBC",
    "description": "U.S. Treasury Secretary Scott Bessent said the 43-day government shutdown resulted in a permanent economic loss of $11 billion, even as he expressed confidence about growth prospects in 2026. He said interest rate–sensitive sectors such as housing had slipped…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/no-recession-risk-for-us-economy-as-a-whole-bessent-tells-nbc/articleshow/125522394.cms",
    "timestamp": "2025-11-23T16:47:12Z"
  },
  {
    "title": "Russian envoy to US: Until Washington shifts policy, strategic dialogue can’t restart",
    "description": "Alexander Darchiev, the Russian Ambassador to Washington, discusses prospects for relations with the United States Read Full Article at RT.com",
    "link": "https://www.rt.com/news/628247-were-still-talking-russia-us/",
    "timestamp": "2025-11-23T16:45:26Z"
  },
  {
    "title": "PM call with President Trump of the United States: 23 November 2025",
    "description": "The Prime Minister spoke to the President of the United States Donald Trump today.",
    "link": "https://www.gov.uk/government/news/pm-call-with-president-trump-of-the-united-states-23-november-2025",
    "timestamp": "2025-11-23T16:41:48Z"
  },
  {
    "title": "Chicago Opens Christmas Season with Multiple Shootings of Teenagers, One Dead",
    "description": "First Chicago lit its official Christmas tree, then the teens began falling from gunshot wounds, with one teen dead.",
    "link": "https://www.westernjournal.com/chicago-opens-christmas-season-multiple-shootings-teenagers-one-dead/",
    "timestamp": "2025-11-23T16:39:15Z"
  },
  {
    "title": "Donald Trump accuses Ukraine of ingratitude as US and Ukrainian officials hail ‘best talks so far’",
    "description": "Ukrainian, US and European officials met in Geneva on Sunday to discuss a draft plan presented by Washington to end the war in Ukraine, after Kyiv and its allies voiced alarm over what they saw as major concessions to the aggressor Russia.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-accuses-ukraine-of-ingratitude-as-us-and-ukrainian-officials-hail-best-talks-so-far/a970506468.html",
    "timestamp": "2025-11-23T16:37:16Z"
  },
  {
    "title": "Donald Trump accuses Ukraine of ingratitude as officials meet in Geneva on ‘US’ peace plan",
    "description": "Ukrainian, US and European officials met in Geneva on Sunday to discuss a draft plan presented by Washington to end the war in Ukraine, after Kyiv and its allies voiced alarm over what they saw as major concessions to the aggressor Russia.",
    "link": "https://www.independent.ie/world-news/europe/donald-trump-accuses-ukraine-of-ingratitude-as-officials-meet-in-geneva-on-us-peace-plan/a970506468.html",
    "timestamp": "2025-11-23T16:37:16Z"
  },
  {
    "title": "South Africa judges G20 summit a triumph of multilateralism despite US no-show",
    "description": "JOHANNESBURG (Reuters) -South Africa's President Cyril Ramaphosa said on Sunday that the declaration from this weekend's Group of 20 summit reflected a \"renewed commitment to multilateral cooperation\", concluding a meeting that pitted him against his U.S. cou…",
    "link": "https://www.thestar.com.my/news/world/2025/11/24/south-africa-judges-g20-summit-a-triumph-of-multilateralism-despite-us-no-show",
    "timestamp": "2025-11-23T16:37:00Z"
  },
  {
    "title": "Warner: Trump's Ukraine Peace Plan Is 'Almost Entirely from the Russians'",
    "description": "Sunday on ABC's \"This Week,\" Sen. Mark Warner (D-VA) said President Donald Trump's proposed peace plan to end the Ukraine war was \"almost entirely from the Russians.\"\nThe post Warner: Trump’s Ukraine Peace Plan Is ‘Almost Entirely from the Russians’ appeared …",
    "link": "https://www.breitbart.com/clips/2025/11/23/warner-trumps-ukraine-peace-plan-is-almost-entirely-from-the-russians/",
    "timestamp": "2025-11-23T16:35:28Z"
  },
  {
    "title": "Melania Trump Reportedly Told Eric To Be Quiet",
    "description": "Melania Trump Reportedly Told Eric To Be Quietlittlethings.com",
    "link": "https://littlethings.com/entertainment/melania-trump-eric-barron-comments",
    "timestamp": "2025-11-23T16:34:23Z"
  },
  {
    "title": "India, Brazil and Indonesia laid foundation for G20 Summit in South Africa: Ramaphosa",
    "description": "South African President Cyril Ramaphosa said the G20 Leaders’ Summit drew heavily on the groundwork laid by Indonesia, India and Brazil, as he closed the two-day meeting on Sunday. He said the G20 South Africa Leaders’ Declaration reflected a shared commitmen…",
    "link": "https://economictimes.indiatimes.com/news/india/india-brazil-and-indonesia-laid-foundation-for-g20-summit-in-south-africa-ramaphosa/articleshow/125522151.cms",
    "timestamp": "2025-11-23T16:30:28Z"
  },
  {
    "title": "Mamdani says he still believes Trump a ‘fascist’ after cordial White House meeting",
    "description": "NYC Mayor-elect Zohran Mamdani maintains Trump is a 'fascist' after White House meeting, where the two discussed affordability and public safety for New Yorkers.",
    "link": "https://www.foxnews.com/media/mamdani-says-he-still-believes-trump-fascist-after-cordial-white-house-meeting",
    "timestamp": "2025-11-23T16:28:51Z"
  },
  {
    "title": "Trump-Pardoned Ponzi Schemer Faces 37-Year Sentence For $44 Million COVID Scam",
    "description": "A previously convicted Ponzi schemer who had received a pardon from President Donald Trump is heading back to prison due to involvement in a new fraudulent scheme.\nWhat Happened: Eliyahu Weinstein, a resident of New Jersey, is facing a 37-year sentence for a …",
    "link": "https://biztoc.com/x/3d058c05bd5d123c",
    "timestamp": "2025-11-23T16:28:44Z"
  },
  {
    "title": "'Sedition Is a Major Crime': Trump Hammers Democrats Who Told Military to Defy 'Illegal Orders'",
    "description": "The group of Democrat lawmakers who told military members to disobey orders should be locked up, President Donald Trump proposed Saturday.\nThe post ‘Sedition Is a Major Crime’: Trump Hammers Democrats Who Told Military to Defy ‘Illegal Orders’ appeared first …",
    "link": "https://www.breitbart.com/politics/2025/11/23/sedition-is-a-major-crime-president-trump-hammers-democrats-who-told-military-to-defy-illegal-orders/",
    "timestamp": "2025-11-23T16:26:42Z"
  },
  {
    "title": "Behind the scenes at COP30: the all-nighter that secured the final deal",
    "description": "A deal that kept the Europeans, island states and Latin Americans happy - phrased in Saudi Arabia-friendly language - stopped the whole process from falling apart.",
    "link": "https://news.sky.com/story/behind-the-scenes-at-cop30-how-they-reached-the-final-deal-13474547",
    "timestamp": "2025-11-23T16:24:00Z"
  },
  {
    "title": "Trump trade official says $2K tariff payments won't fuel inflation as revenues climb",
    "description": "Trump's trade representative says $2,000 tariff revenue payments won't fuel inflation, dismissing concerns about the one-time checks for American families.",
    "link": "https://www.foxnews.com/politics/trump-trade-official-says-2k-tariff-payments-wont-fuel-inflation-revenues-climb",
    "timestamp": "2025-11-23T16:22:18Z"
  },
  {
    "title": "Merz 'sceptical' Ukraine deal can be reached by Trump's deadline",
    "description": "German Chancellor Friedrich Merz on Sunday voiced doubts over whether a deal on ending the war in Ukraine could be reached in the next few days as demanded...",
    "link": "https://dpa-international.com/politics/urn:newsml:dpa.com:20090101:251123-99-723195/",
    "timestamp": "2025-11-23T16:20:32Z"
  },
  {
    "title": "Trump says Ukraine ungrateful as officials meet to convince Kyiv to accept peace proposals (Sean Dilley/BBC)",
    "description": "Sean Dilley / BBC:\nTrump says Ukraine ungrateful as officials meet to convince Kyiv to accept peace proposals  —  Summary  — US President Donald Trump says Ukraine's leaders have shown “zero gratitude” over US efforts to end the war  — Minutes before, Ukraine…",
    "link": "https://www.memeorandum.com/251123/p37",
    "timestamp": "2025-11-23T16:20:00Z"
  },
  {
    "title": "GOP Rep. McCaul Calls on Trump to 'Tone Down the Rhetoric'",
    "description": "Sunday on ABC's \"This Week,\" Rep. Michael McCaul (R-TX) said President Donald Trump should \"tone down the rhetoric\" against Democratic lawmakers over their video telling military members about refusing illegal orders.\nThe post GOP Rep. McCaul Calls on Trump t…",
    "link": "https://www.breitbart.com/clips/2025/11/23/gop-rep-mccaul-calls-on-trump-to-tone-down-the-rhetoric/",
    "timestamp": "2025-11-23T16:19:28Z"
  },
  {
    "title": "Carney: No 'burning issue' to bring up with Trump, talks to resume when 'appropriate'",
    "description": "\"When America wants to come back and have conversations on the trade side, we will have those discussions,\" said Prime Minister Mark Carney.",
    "link": "https://www.thestar.com/business/carney-no-burning-issue-to-bring-up-with-trump-talks-to-resume-when-appropriate/article_74ea86d2-c56c-5c4e-8274-1a1ac07578c9.html",
    "timestamp": "2025-11-23T16:12:26Z"
  },
  {
    "title": "The Irish Times view on Cop30: the summit fails to deliver",
    "description": "While the closing agreement does not contradict the scientific consensus and edges the world slightly forward, it is not nearly enough",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/11/23/the-irish-times-view-on-cop30-the-summit-fails-to-deliver/",
    "timestamp": "2025-11-23T16:10:48Z"
  },
  {
    "title": "Trump Blasts Ukraine ‘LEADERSHIP’ for Showing ‘ZERO GRATITUDE’ to US — As Critics Slam His Peace Plan as a Russian ‘Wish List’",
    "description": "Despite critics blasting his administration's Russia-Ukraine peace plan as overly favorable to the former, President Trump attacked Ukrainian leadership.\nThe post Trump Blasts Ukraine ‘LEADERSHIP’ for Showing ‘ZERO GRATITUDE’ to US — As Critics Slam His Peace…",
    "link": "https://www.mediaite.com/media/news/trump-blasts-ukraine-leadership-for-showing-zero-gratitude-to-us-as-critics-slam-his-peace-plan-as-a-russian-wish-list/",
    "timestamp": "2025-11-23T16:07:54Z"
  },
  {
    "title": "Crockett: MTG couldn’t ’take the heat’ from Trump",
    "description": "Crockett: MTG couldn’t ’take the heat’ from Trump\nRep. Jasmine Crockett mocked GOP Rep. Marjorie Taylor Greene’s decision to resign from Congress.\nRep. Jasmine Crockett (D-Texas) noted that she had long been the target of President Donald Trump's ire. | Win M…",
    "link": "https://biztoc.com/x/e07582e2ed4a08e6",
    "timestamp": "2025-11-23T16:06:29Z"
  },
  {
    "title": "'Cultural break.' U.S. senators say relations with Canadian neighbours are suffering",
    "description": "The tariffs imposed on Canada by U.S. President Donald Trump have clearly caused economic pain for Canada, but a U.S. senator from Maine says he's more worried about how Canadians are reacting on a personal level.",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/cultural-break-u-s-senators-say-relations-with-canadian-neighbours-are-suffering-9.6989582",
    "timestamp": "2025-11-23T16:01:27Z"
  },
  {
    "title": "Fifty children escape after mass school abduction in Nigeria",
    "description": "The raid on a Christian school came amid a surge of attacks by armed groups in the African nation.",
    "link": "https://www.bbc.com/news/articles/cpwk5qzzppzo",
    "timestamp": "2025-11-23T16:00:45Z"
  },
  {
    "title": "India Turns to U.S. Energy to Shield Itself From Massive Tariffs",
    "description": "India has agreed to deepen its energy trade with the United States in a bid to avoid the introduction of higher tariffs on exports by President Donald Trump. In recent months, Trump has threatened several countries with tariffs if they do not import larger qu…",
    "link": "https://oilprice.com/Energy/Energy-General/India-Turns-to-US-Energy-to-Shield-Itself-From-Massive-Tariffs.html",
    "timestamp": "2025-11-23T16:00:00Z"
  },
  {
    "title": "PM: Not interfering, just facilitating",
    "description": "JOHANNESBURG: Rejecting accu­sations of meddling in Thai­land's border dispute with Cam­bodia, Prime Minister Datuk Seri Anwar Ibrahim said Malaysia remains committed to helping the two countries achieve a peaceful resolution. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/11/24/pm-not-interfering-just-facilitating",
    "timestamp": "2025-11-23T16:00:00Z"
  },
  {
    "title": "TACO Trump Backs Off Threat To Deploy National Guard To New York City",
    "description": "I don't know what went on during the closed doors portion of that meeting between Trump and mayor-elect Zohran Mamdani, but now it looks like Trump is backing down from his threats to deploy the National Guard to New York City:\nPresident Donald Trump has hit …",
    "link": "https://crooksandliars.com/2025/11/taco-trump-backs-threat-deploy-national",
    "timestamp": "2025-11-23T15:56:13Z"
  },
  {
    "title": "Is Donald Trump borrowing Zohran Mamdani’s style? His unexpected outfit sparks hilarious debate",
    "description": "Donald Trump's recent choice of a plush burgundy scarf over a black overcoat has sparked online comparisons to New York City mayor-elect Zohran Mamdani's signature style. This fashion observation followed a surprisingly warm meeting between the two, where Tru…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/is-donald-trump-borrowing-zohran-mamdanis-style-his-unexpected-outfit-sparks-hilarious-debate/articleshow/125521839.cms",
    "timestamp": "2025-11-23T15:55:04Z"
  },
  {
    "title": "Newsom, DeSantis join forces to blast ‘idiotic’ push to allow oil drilling off coasts of California, Florida",
    "description": "The Trump administration announced on Thursday new oil drilling off the California and Florida coasts for the first time in decades, advancing a project that critics say could harm coastal communities and ecosystems, as President Donald Trump seeks to expand …",
    "link": "https://biztoc.com/x/f87e11964f659f73",
    "timestamp": "2025-11-23T15:54:53Z"
  }
]