[
  {
    "title": "US to review all 55 million visas to check if holders broke rules",
    "description": "A US state department official says US visa holders will face \"continuous vetting\".",
    "link": "https://www.bbc.com/news/articles/cvg04gm92d3o",
    "timestamp": "2025-08-22T11:56:02Z"
  },
  {
    "title": "FBI searches home of former Trump national security adviser John Bolton, AP source says",
    "description": "According to sources, the search is part of an investigation into the handling of classified documents.",
    "link": "https://www.denverpost.com/2025/08/22/fbi-search-john-bolton-home/",
    "timestamp": "2025-08-22T11:55:05Z"
  },
  {
    "title": "'We all should be scared as hell': Red flag raised over Trump ally who terrifies even MAGA",
    "description": "Right-wing provocateur Laura Loomer exerts a powerful influence over President Donald Trump, but a Democratic strategist warned that the MAGA enemies she has cultivated should signal just how extreme and dangerous she is to democracy.The social media influenc…",
    "link": "https://www.rawstory.com/laura-loomer-maga-feud-terrifying/",
    "timestamp": "2025-08-22T11:53:22Z"
  },
  {
    "title": "FBI raids home of former Trump national security advisor John Bolton",
    "description": "FBI Director Kash Patel tweeted “NO ONE is above the law… @FBI agents on mission\" as agents searched the home of Bolton in Bethesda, Maryland.",
    "link": "https://www.cnbc.com/2025/08/22/fbi-raid-john-bolton-trump-patel.html",
    "timestamp": "2025-08-22T11:51:40Z"
  },
  {
    "title": "Trump visits police, troops deployed in US capital",
    "description": "U.S. President Donald Trump on Aug. 21 visited police and troops he has deployed in the U.S. capital in what he calls a crackdown on crime, saying they were going to \"stay here for a while.\"",
    "link": "https://www.hurriyetdailynews.com/trump-visits-police-troops-deployed-in-us-capital-212800",
    "timestamp": "2025-08-22T11:51:40Z"
  },
  {
    "title": "China Sits Out Mediation of Russia-Ukraine War, Despite Entanglements",
    "description": "The two back-to-back summits that U.S. President Donald Trump hosted over the past week, first with Russian President Vladimir Putin in Alaska and then with Ukrainian President Volodymyr Zelenskyy and other European leaders in Washington, D.C., may not have d…",
    "link": "https://chinadigitaltimes.net/2025/08/china-sits-out-mediation-of-russia-ukraine-war-despite-entanglements/",
    "timestamp": "2025-08-22T11:50:58Z"
  },
  {
    "title": "John Bolton's Home Raided By FBI: Live Updates",
    "description": "Ambassador John Bolton reported to be the target of an FBI raid on his home. Follow Newsweek for live updates.",
    "link": "https://www.newsweek.com/john-bolton-fbi-raid-home-live-updates-2117655",
    "timestamp": "2025-08-22T11:50:17Z"
  },
  {
    "title": "German post office restricts packages to US over tariffs",
    "description": "Germany's postal service announced today a raft of temporary restrictions on package deliveries to the US due to tariffs imposed by President Donald Trump.",
    "link": "https://www.rte.ie/news/business/2025/0822/1529691-german-post-office-restricts-packages-to-us-over-tariffs/",
    "timestamp": "2025-08-22T11:49:16Z"
  },
  {
    "title": "DOGE targeted him on social media.Then the Taliban took his family",
    "description": "It was early morning on April 1 when Mohammad Halimi, a 53-year-old exiled Afghan scholar, got a panicked message from his son. Halimi’s name had just appeared in a viral post on X, shared by none other than the site’s owner and the world’s richest man, Elon …",
    "link": "https://www.rawstory.com/doge-targeted-him-on-social-media-then-the-taliban-took-his-family/",
    "timestamp": "2025-08-22T11:47:36Z"
  },
  {
    "title": "Friday: Hili dialogue",
    "description": "Welcome to the butt end of the week: Friday, August 22, 2025, and National Bao Day, celebrating steamed or baked dumplings.  In this video a friendly woman explains the difference between bao, other buns, and wontons. . . . and here’s much of the anime movie …",
    "link": "https://whyevolutionistrue.com/2025/08/22/friday-hili-dialogue-538/",
    "timestamp": "2025-08-22T11:45:47Z"
  },
  {
    "title": "Trump to Orban: I'm angry about Ukraine's oil attacks",
    "description": "United States President Donald Trump told Hungarian Prime Minister Viktor Orban that he is \"very angry\" about Ukraine's drone attacks on the Druzhba oil pipeline in Russia, which led to a halt to the ...",
    "link": "https://biztoc.com/x/85e5bc922c4debb5",
    "timestamp": "2025-08-22T11:39:13Z"
  },
  {
    "title": "Florida must stop expanding ‘Alligator Alcatraz’ immigration center, judge says",
    "description": "A federal judge has issued a preliminary injunction halting further expansion of an immigration detention center built in the middle of the Florida Everglades.",
    "link": "https://www.bostonherald.com/2025/08/22/judge-injuction-alligator-alcatraz-expansion/",
    "timestamp": "2025-08-22T11:39:00Z"
  },
  {
    "title": "FBI searches home of former Trump national security adviser John Bolton, AP source says",
    "description": "The FBI is searching the Maryland home of John Bolton, who served in President Donald Trump's first administration as national security adviser but later...",
    "link": "https://www.yahoo.com/news/articles/fbi-searches-home-former-trump-113837080.html",
    "timestamp": "2025-08-22T11:38:37Z"
  },
  {
    "title": "Judge orders dismantling of Trump's 'Alligator Alcatraz' detention facility",
    "description": "The order said that authorities must remove \"all generators, gas, sewage, and other waste and waste receptacles that were installed to support this project\", within 60 days.",
    "link": "https://www.abc.net.au/news/2025-08-22/jusdge-blocks-further-expansion-alligator-alcatraz-facility/105688116",
    "timestamp": "2025-08-22T11:38:14Z"
  },
  {
    "title": "BREAKING: FBI Raids Home of Trump Critic John Bolton",
    "description": "The FBI raided the home of John Bolton, a vocal critic of President Donald Trump who previously served as his national security adviser, on Friday.\nThe post BREAKING: FBI Raids Home of Trump Critic John Bolton first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/breaking-fbi-raids-home-of-trump-critic-john-bolton/",
    "timestamp": "2025-08-22T11:36:56Z"
  },
  {
    "title": "Transcript: Vance Scamming of MAGA Voters Takes Ugly Turn in Vile Rant",
    "description": "The following is a lightly edited transcript of the August 22 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.JD Vance jus…",
    "link": "https://newrepublic.com/article/199444/transcript-vance-scamming-maga-voters-takes-ugly-turn-vile-rant",
    "timestamp": "2025-08-22T11:35:11Z"
  },
  {
    "title": "American Trucking Industry Reacts to Trump Admin's Halt on Visas",
    "description": "The American Trucking Associations applauded the administration for pausing work visas for commercial drivers.",
    "link": "https://www.newsweek.com/trucking-industry-reacts-rubio-visa-pause-2117560",
    "timestamp": "2025-08-22T11:34:04Z"
  },
  {
    "title": "Why Japanese American memories of US internment during the second world war are stirring up protests in 2025",
    "description": "Americans of Japanese heritage have been protesting at recent Ice tactics.",
    "link": "https://theconversation.com/why-japanese-american-memories-of-us-internment-during-the-second-world-war-are-stirring-up-protests-in-2025-261989",
    "timestamp": "2025-08-22T11:33:54Z"
  },
  {
    "title": "‘South Park’ rips into Trump’s crypto ties in latest episode - Cointelegraph",
    "description": "‘South Park’ rips into Trump’s crypto ties in latest episodeCointelegraph ‘South Park’s’ latest episode takes aim at federal takeover of DC police and AICNN 'South Park' escalates war with Donald Trump in brutal new episodeUSA Today 'South Park' Mocks Tech Br…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178821862",
    "timestamp": "2025-08-22T11:32:07Z"
  },
  {
    "title": "California responds to Texas with its own redistricting plan, but voters to have final say",
    "description": "California voters will decide in November whether to approve a redrawn congressional map designed to help Democrats win five more U.S. House seats next year, after Texas Republicans advanced their own redrawn map to pad their House majority by the same number…",
    "link": "https://www.cbc.ca/news/world/california-redistricting-referendum-1.7615403",
    "timestamp": "2025-08-22T11:30:25Z"
  },
  {
    "title": "Gavin Newsom Reveals His Kids’ Reaction To His Trump Trolling: ‘Jesus, Dad…’",
    "description": "The California governor spelled out his serious reason for mimicking the president.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-children-reaction-trump-trolling_n_68a844a2e4b037ca0b42bbef",
    "timestamp": "2025-08-22T11:30:23Z"
  },
  {
    "title": "Gavin Newsom Reveals His Kids’ Reaction To His Trump Trolling: ‘Jesus, Dad…’",
    "description": "The California governor spelled out his serious reason for mimicking the president.",
    "link": "https://www.huffpost.com/entry/gavin-newsom-children-reaction-trump-trolling_n_68a844a2e4b037ca0b42bbef?utm_campaign=yahoo-recirc",
    "timestamp": "2025-08-22T11:30:23Z"
  },
  {
    "title": "'Obscene': MSNBC analyst snaps back at Trump official's museum plan to whitewash history",
    "description": "Reacting to an appearance on Newsmax by Donald Trump’s choice to oversee the overhaul of Smithsonian Museum exhibits, programming and artwork that the administration finds objectionable, MSNBC analyst Eugene Robinson pushed back on Friday morning.During her i…",
    "link": "https://www.rawstory.com/trump-smithsonian-2673910062/",
    "timestamp": "2025-08-22T11:27:13Z"
  },
  {
    "title": "Fed Chair Powell Set To Deliver Major Speech Amid Relentless Pressure From Trump",
    "description": "A widening battle for control of the U.S. central bank, considered an anchor institution of the global financial system, seems to already be underway.",
    "link": "https://www.huffpost.com/entry/fed-chair-jerome-powell-jackson-hole-speech_n_68a8514be4b037ca0b42c309",
    "timestamp": "2025-08-22T11:26:56Z"
  },
  {
    "title": "MAGAts are throwing a tantrum over Cracker Barrel’s redesigned logo",
    "description": "Real talk: I enjoy Cracker Barrel. Cracker Barrel has good Southern food at affordable prices. Does Cracker Barrel’s vibe and interior also give off a vibe of “the South shall rise again?” Yes. It absolutely does. But damn, they make good corn and chicken-fri…",
    "link": "https://www.celebitchy.com/937311/magats_are_throwing_a_tantrum_over_cracker_barrels_redesigned_logo/",
    "timestamp": "2025-08-22T11:25:09Z"
  },
  {
    "title": "'I Am Very Angry': Trump Writes to Orban Over Ukraine’s Strikes on Druzhba Pipeline",
    "description": "MOSCOW (Sputnik) - Hungarian Prime Minister Viktor Orban published on Friday US President Donald Trump's response to his letter, where he said he was \"very angry\" to hear the news about Ukraine's attack on the Druzhba oil pipeline.",
    "link": "https://sputnikglobe.com/20250822/i-am-very-angry-trump-writes-to-orban-over-ukraines-strikes-on-druzhba-pipeline-1122661012.html",
    "timestamp": "2025-08-22T11:23:06Z"
  },
  {
    "title": "Donald Trump golfing expenses reach $71 million with massive Secret Service spending on Bedminster club",
    "description": "Donald Trump has already spent more than $71 million on golf in 2025, according to DidTrumpGolfToday.com. Taxpayers are also covering Secret Service costs, including over $600,000 for golf carts and portable toilets at his Bedminster, New Jersey club. A 2019 …",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/donald-trump-golfing-expenses-reach-71-million-with-massive-secret-service-spending-on-bedminster-club/articleshow/123453653.cms",
    "timestamp": "2025-08-22T11:22:12Z"
  },
  {
    "title": "Europe’s ‘Peace Through Strength’ Hypocrisy",
    "description": "The bill has finally come due on Europe’s Ukraine strategy.",
    "link": "http://foreignpolicy.com/2025/08/22/europe-ukraine-peace-troops-security-guarantee/",
    "timestamp": "2025-08-22T11:20:17Z"
  },
  {
    "title": "Famine declared in Gaza City and judge bars new detainees at 'Alligator Alcatraz': Morning Rundown",
    "description": "Famine is officially declared in the governorate that includes Gaza City.",
    "link": "https://www.nbcnews.com/news/us-news/ukraine-security-guarantees-lyle-menendez-parole-morning-rundown-rcna226483",
    "timestamp": "2025-08-22T11:16:56Z"
  },
  {
    "title": "Royalist: Will King Charles be able to hide his disdain for Donald Trump next month?",
    "description": "Donald Trump has a great affection for the British monarchy, for some reason. I think he likes all of the opulence, the gold, the jewels and all of the medieval castles. He was a huge fan of Queen Elizabeth II, even if she reportedly hated his guts and justif…",
    "link": "https://www.celebitchy.com/936980/royalist_will_king_charles_be_able_to_hide_his_disdain_for_donald_trump_next_month/",
    "timestamp": "2025-08-22T11:14:58Z"
  },
  {
    "title": "Türkiye launches key railway project tied to Zangezur Corridor",
    "description": "Türkiye on Aug. 22 laid the foundation of a railway line in its eastern region that will form a vital part of the Zangezur Corridor, a strategic route set to reshape connectivity in the South Caucasus.",
    "link": "https://www.hurriyetdailynews.com/turkiye-launches-key-railway-project-tied-to-zangezur-corridor-212783",
    "timestamp": "2025-08-22T11:14:01Z"
  },
  {
    "title": "A federal judge ordered the Trump admin to close down ‘Alligator Alcatraz’",
    "description": "One of the most heinous things Donald Trump has done this year is open up “Alligator Alcatraz,” an immigrant detention center in Florida. The “Alligator Alcatraz” moniker was given by Trump’s people, and it’s intended as a threat for immigrants, that they wil…",
    "link": "https://www.celebitchy.com/937360/a_federal_judge_ordered_the_trump_admin_to_close_down_alligator_alcatraz/",
    "timestamp": "2025-08-22T11:13:37Z"
  },
  {
    "title": "Russia's foreign minister says no Putin-Zelenskyy summit planned despite Trump's peace push",
    "description": "Russia’s top diplomat said Friday that no meeting is planned between President Vladimir Putin and Ukraine’s Volodymyr Zelenskyy, casting new doubt on President Donald Trump’s push for a summit to end the war.“Putin is ready to meet with Zelenskyy when the age…",
    "link": "https://www.nbcnews.com/world/russia/putin-zelenskyy-summit-not-planned-trump-russia-lavrov-peace-ukraine-rcna226248",
    "timestamp": "2025-08-22T11:13:36Z"
  },
  {
    "title": "Putin demands Ukraine surrender Donbas, give up NATO ambitions and keep Western troops out of country: report",
    "description": "Three sources familiar with top-level Kremlin thinking told Reuters of Putin's demands.",
    "link": "https://nypost.com/2025/08/22/world-news/putins-ukraine-demands-give-up-donbas-no-nato-and-no-western-troops/",
    "timestamp": "2025-08-22T11:07:29Z"
  },
  {
    "title": "Is a system where politicians pick their voters still a democracy?",
    "description": "‘So look. All I want to do is this. I just want to find 11,780 votes.”\nThat’s what President Donald Trump told Georgia Secretary of State Brad Raffensperger in a phone call on Jan. 2, 2021. The Republican was in charge of overseeing the federal election in hi…",
    "link": "https://biztoc.com/x/db757515a6da058d",
    "timestamp": "2025-08-22T11:05:28Z"
  },
  {
    "title": "Is Trump a socialist?",
    "description": "President Donald Trump holds a chart on household income in the Oval Office of the White House in Washington, DC, on August 7, 2025.﻿ | Yuri Gripas/Abaca/Bloomberg via Getty Images \nFor decades, a core part of the Republican Party’s identity was the whole-hea…",
    "link": "https://biztoc.com/x/611f51c0c6a23350",
    "timestamp": "2025-08-22T11:05:12Z"
  },
  {
    "title": "Trump Declares D.C. Is ‘SAFE AGAIN!’ as He Threatens Mayor Over Crime Reports: ‘Bad Things Will Happen’",
    "description": "President Donald Trump praised the work of the National Guard and police, who he warned are \"NOT PLAYING GAMES!!!\" in Washington, D.C., during his crime crackdown.\nThe post Trump Declares D.C. Is ‘SAFE AGAIN!’ as He Threatens Mayor Over Crime Reports: ‘Bad Th…",
    "link": "https://www.mediaite.com/media/news/trump-declares-d-c-is-safe-again-as-he-threatens-mayor-over-crime-reports-bad-things-will-happen/",
    "timestamp": "2025-08-22T11:04:06Z"
  },
  {
    "title": "'Angry' Trump Sends Orban Handwritten Note Over Ukraine Oil Pipeline Attack",
    "description": "The Russian oil pipeline Druzhba supplies Hungary and Slovakia, two NATO allies.",
    "link": "https://www.newsweek.com/orban-trump-note-ukraine-russia-oil-pipeline-attack-2117627",
    "timestamp": "2025-08-22T11:00:54Z"
  },
  {
    "title": "The warrior ethos effect: Why female enlistment is surging under Trump",
    "description": "Army exceeds recruiting goals by 10% as women return to military service under Defense Secretary Pete Hegseth's merit-based advancement and equal treatment policies.",
    "link": "https://www.foxnews.com/opinion/warrior-ethos-effect-why-female-enlistment-surging-under-trump",
    "timestamp": "2025-08-22T11:00:50Z"
  },
  {
    "title": "MSNBC staffers divided over new name but 'cautiously optimistic' about liberal network's post-NBC future",
    "description": "Fox News Digital spoke with MSNBC staffers who are optimistic about their network's future but are divided over its new name MS NOW once the divorce with NBC is finalized.",
    "link": "https://www.foxnews.com/media/msnbc-divided-over-new-name-cautiously-optimistic-about-liberal-networks-post-nbc-future",
    "timestamp": "2025-08-22T11:00:35Z"
  },
  {
    "title": "'South Park' Is Calling Out Trump Like No One Else, And It's Perfect For The Current Times",
    "description": "The animated satire has been boldly calling out the president's administration in real time as other entities have cowered.",
    "link": "https://www.huffpost.com/entry/south-park-trump-roast-comedy-central_n_68a77666e4b00911ce4469f8",
    "timestamp": "2025-08-22T11:00:17Z"
  },
  {
    "title": "St. Louis again fails to report crime data to state, FBI",
    "description": "As of Wednesday, St. Louis had reported only about 60 offenses this year to authorities, instead of the thousands it would typically report for a similar period.",
    "link": "https://www.stltoday.com/news/local/crime-courts/article_2d6010d6-96f2-478e-bf0d-7daaaa7baafe.html",
    "timestamp": "2025-08-22T11:00:00Z"
  },
  {
    "title": "Bailey's road to Washington paved with red meat, headlines and praise for Trump",
    "description": "Republican Attorney General Andrew Bailey will become a co-deputy director of the FBI",
    "link": "https://www.stltoday.com/news/local/crime-courts/article_febee47e-da18-4222-92ac-7053af32e593.html",
    "timestamp": "2025-08-22T11:00:00Z"
  },
  {
    "title": "Crypto Is Braced For A Fed Price Bombshell As ‘Spiral Of Doom’ Warning Puts Bitcoin On The Brink",
    "description": "Bitcoin treasury pioneer Strategy’s new fundraising rules have added to a 25% stock sell off that some fear could cause a \"spiral of doom’…",
    "link": "https://www.forbes.com/sites/digital-assets/2025/08/22/serious-spiral-of-doom-strategy-warning-fuels-sudden-bitcoin-price-crash-fears/",
    "timestamp": "2025-08-22T10:56:35Z"
  },
  {
    "title": "Did Jeffrey Epstein Commit Suicide? Or Was He Murdered? Americans Want Answers: I&I/TIPP Poll",
    "description": "The controversial life and shocking death of financial fixer and child sex offender Jeffrey Epstein won a second of round of heavy media coverage after claims were made that Donald Trump knew Epstein. But Americans of all political stripes mostly agree on one…",
    "link": "https://biztoc.com/x/3e5f28f923ef9a44",
    "timestamp": "2025-08-22T10:54:03Z"
  },
  {
    "title": "'Present danger': Right-wing economists sound alarm over Trump move to 'blow up' economy",
    "description": "Economists expressed alarm at President Donald Trump's moves to undermine the independence of the Federal Reserve and the Bureau of Labor Statistics.The U.S. economy has long enjoyed a reputation as the safest place in the world to invest or build a business,…",
    "link": "https://www.rawstory.com/donald-trump-economy-2673910023/",
    "timestamp": "2025-08-22T10:54:00Z"
  },
  {
    "title": "With the White House watching, Fed's Powell to hint yes or no on rate cuts",
    "description": "Jerome Powell's Jackson Hole speech occurs amidst Trump's pressure for rate cuts and conflicting economic data. The Fed faces inflation concerns and a potentially weakening labor market. Powell may hint at a September rate cut, balancing economic realities wi…",
    "link": "https://economictimes.indiatimes.com/news/international/business/with-the-white-house-watching-feds-powell-to-hint-yes-or-no-on-rate-cuts/articleshow/123453181.cms",
    "timestamp": "2025-08-22T10:53:03Z"
  },
  {
    "title": "South Korea’s Lee to Urge US-North Korea Talks at Trump Summit",
    "description": "South Korean President Lee Jae Myung will press Donald Trump to reopen the stalled dialogue with North Korea when he holds his first summit with the US president next week, his top aide said.",
    "link": "https://financialpost.com/pmn/business-pmn/south-koreas-lee-to-urge-us-north-korea-talks-at-trump-summit",
    "timestamp": "2025-08-22T10:49:29Z"
  },
  {
    "title": "Friday Morning Open Thread",
    "description": "Warren: \"That's Trump's approach — bend down to Trump, Trump will then tell everyone what reality is. That's what authoritarians do, but in a democracy we don't have to put up with it. We have our voices, we have our votes … 2026 could be pretty exciting — a …",
    "link": "https://balloon-juice.com/2025/08/22/friday-morning-open-thread-35/",
    "timestamp": "2025-08-22T10:46:28Z"
  },
  {
    "title": "MAGA can’t decide if women should be allowed to dance",
    "description": "Republicans claim to love sorority dances. But mere months ago, carefree girls were objects of over-the-top hate",
    "link": "https://www.salon.com/2025/08/22/maga-cant-decide-if-women-should-be-allowed-to-dance/",
    "timestamp": "2025-08-22T10:45:36Z"
  },
  {
    "title": "Morning Bid: Treasuries tighten as Fed hawks re-emerge",
    "description": "As investors wait anxiously for Federal Reserve Chair Jerome Powell’s keynote speech at the Jackson Hole symposium today, the rates market is responding to a...",
    "link": "https://finance.yahoo.com/news/morning-bid-treasuries-tighten-fed-103548837.html",
    "timestamp": "2025-08-22T10:35:48Z"
  },
  {
    "title": "Trump has stern words for Ukraine after American business destroyed in Russian aerial assault",
    "description": "Vladimir Putin launched an 'outrageous' attack on Ukraine and Donald Trump had a message on how it should treat Russia after an American business was hit.",
    "link": "https://www.ladbible.com/news/world-news/trump-ukraine-russia-american-business-678098-20250822",
    "timestamp": "2025-08-22T10:35:05Z"
  },
  {
    "title": "Exclusive-US banks lobby regulators for national standards to curb state influence, sources say",
    "description": "NEW YORK (Reuters) -U.S. banks are petitioning the Office of the Comptroller of the Currency to seek national standards for providing banking services that...",
    "link": "https://finance.yahoo.com/news/exclusive-banks-lobby-regulators-national-103356778.html",
    "timestamp": "2025-08-22T10:33:56Z"
  },
  {
    "title": "The Trump civil fraud case is a mess. Another round of appeal could clean it up",
    "description": "President Donald Trump and New York Attorney General Letitia James both awkwardly claimed victory Thursday after New York’s intermediate appeals court handed down its ruling in Trump’s civil fraud case.",
    "link": "https://biztoc.com/x/bb9c46459b7cee0b",
    "timestamp": "2025-08-22T10:32:13Z"
  },
  {
    "title": "Rupee continues slide on looming US tariffs, posts marginal weekly loss",
    "description": "The Indian rupee weakened further on Friday against a stronger dollar ahead of a speech by Federal Reserve Chair Jerome Powell, capping a volatile week for the Asian currency that has been pressured by U.S. tariff-related uncertainties.",
    "link": "https://economictimes.indiatimes.com/markets/forex/forex-news/rupee-continues-slide-on-looming-us-tariffs-posts-marginal-weekly-loss/articleshow/123452683.cms",
    "timestamp": "2025-08-22T10:31:41Z"
  },
  {
    "title": "Trump’s war on the Smithsonian echoes the fight over its founding",
    "description": "Thanks to states' rights politicians, the institution nearly never existed in the first place",
    "link": "https://www.salon.com/2025/08/22/trumps-war-on-the-smithsonian-echoes-the-fight-over-its-founding/",
    "timestamp": "2025-08-22T10:30:41Z"
  },
  {
    "title": "Getting “DOGED”: DOGE Targeted Him on Social Media. Then the Taliban Took His Family.",
    "description": "by Avi Asher-Schapiro and Christopher Bing \n \n \n\n\n\n \nIt was early morning on April 1 when Mohammad Halimi, a 53-year-old exiled Afghan scholar, got a panicked message from his son. Halimi’s name had just appeared in a viral post on X, shared by none other tha…",
    "link": "https://www.propublica.org/article/doge-musk-mohammad-halimi-institute-peace-taliban",
    "timestamp": "2025-08-22T10:30:00Z"
  },
  {
    "title": "Gabbard bars intel sharing on Russia-Ukraine talks – CBS News",
    "description": "The US director of national intelligence earlier accused NATO of failing to recognize Moscow’s “legitimate security concerns” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623408-gabbard-bars-intel-sharing-ukraine-talks/",
    "timestamp": "2025-08-22T10:27:24Z"
  },
  {
    "title": "From 'a faucet to a drip': Fewer Canadians are visiting Las Vegas this summer amid Trump trade war",
    "description": "Flight data from Harry Reid International Airport in Las Vegas shows a significant decline in Canadian tourism.",
    "link": "https://nationalpost.com/news/canada/canadian-tourists-las-vegas",
    "timestamp": "2025-08-22T10:25:39Z"
  },
  {
    "title": "Protestors including senator re-colour Pulse Nightclub memorial crosswalk: ‘We will NOT be erased’",
    "description": "Protestors are fighting against the erasure of a rainbow crosswalk dedicated to the victims of the 2016 Pulse nightclub shooting victims by colouring the walkway back in. The rainbow crosswalk outside the abandoned LGBTQ+ nightclub in Orlando, Florida, was re…",
    "link": "https://www.thepinknews.com/2025/08/22/pulse-crosswalk-nightclub-memorial/",
    "timestamp": "2025-08-22T10:21:12Z"
  },
  {
    "title": "Opinion: The Political Disaster Hiding in Plain Sight for Democrats",
    "description": "I am generally bullish about Democrats’ chances of retaking the House majority in 2026. That’s because the history of midterm elections is pretty overwhelming when it comes to seat losses for the president’s party. When a president is unpopular in polls—as Do…",
    "link": "https://freerepublic.com/focus/f-news/4336040/posts",
    "timestamp": "2025-08-22T10:19:35Z"
  },
  {
    "title": "Finnish tourists shy away from Trump-era US",
    "description": "Leisure travel to the US this summer has decreased significantly from last year.",
    "link": "https://yle.fi/a/74-20178894",
    "timestamp": "2025-08-22T10:19:09Z"
  },
  {
    "title": "The Art of the Deal, Russia-Ukraine Style | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nTwo months after the breathtaking Operation Midnight Hammer strikes against Iran's nuclear facilities and the ceasefire with Israel that soon followed, President Donald Trump has once again upended conventiona…",
    "link": "https://biztoc.com/x/381bec90bbff07a3",
    "timestamp": "2025-08-22T10:09:43Z"
  },
  {
    "title": "Trump-Zelensky and the War in Ukraine: The Week in Your Words",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWelcome back as we once again look at some of our readers' highlighted comments from the past week. One story continues to dominate the news: Russia's ongoing war with Ukraine. President Donald Trump met with …",
    "link": "https://biztoc.com/x/49a20e11e3f7b6b1",
    "timestamp": "2025-08-22T10:09:38Z"
  },
  {
    "title": "Trump can’t stop America from building cheap EVs",
    "description": "Ford President and CEO Jim Farley speaks at Louisville Assembly Plant as the company shares its plans to design and assemble breakthrough electric vehicles in America on August 11, 2025. \nPresident Donald Trump has made no secret of his disdain for electric v…",
    "link": "https://biztoc.com/x/a88f8c0c2f00806b",
    "timestamp": "2025-08-22T10:09:06Z"
  },
  {
    "title": "Top European diplomat says Putin is setting 'a trap' by demanding Ukraine concessions",
    "description": "The European Union’s foreign policy chief says the possibility of Ukraine ceding land to Russia as part of a peace deal to end their three-year war is “a trap” set by Russian President Vladimir Putin",
    "link": "https://abcnews.go.com/International/wireStory/top-european-diplomat-putin-setting-trap-demanding-ukraine-124873014",
    "timestamp": "2025-08-22T10:06:59Z"
  },
  {
    "title": "Prabowo to address UNGA, first RI President in over a decade",
    "description": "President Prabowo Subianto will address the 80th Session of the United Nations General Assembly (UNGA) at the UN Headquarters next month, according to the ...",
    "link": "https://en.antaranews.com/news/374861/prabowo-to-address-unga-first-ri-president-in-over-a-decade",
    "timestamp": "2025-08-22T10:06:40Z"
  },
  {
    "title": "Police Scotland pay out 500k in overtime during Donald Trump visit",
    "description": "Police Scotland has had to pay officers £500,000 in compensation for not being able to get time off last month alone ...",
    "link": "https://www.thenational.scot/news/25408439.police-scotland-pay-500k-overtime-donald-trump-visit/",
    "timestamp": "2025-08-22T10:05:54Z"
  },
  {
    "title": "Trump-Zelensky and the War in Ukraine: The Week in Your Words",
    "description": "Newsweek once again looks at readers' highlighted comments, this week focusing on Trump and Zelensky and the aftermath of their meeting.",
    "link": "https://www.newsweek.com/trump-zelensky-war-ukraine-week-your-words-2117551",
    "timestamp": "2025-08-22T10:05:47Z"
  },
  {
    "title": "Trump threatens full 'Federal takeover' in DC, accuses mayor of peddling 'inaccurate crime figures'",
    "description": "President Donald Trump threatens \"Federal takeover of\" Washington D.C., claiming Mayor Muriel Bowser is disseminating false crime statistics",
    "link": "https://www.foxnews.com/politics/trump-threatens-full-federal-takeover-dc-accuses-mayor-peddling-inaccurate-crime-figures",
    "timestamp": "2025-08-22T10:02:35Z"
  },
  {
    "title": "Stick to politics? How Donald Trump is using sports to advance his agenda",
    "description": "President Donald Trump’s plan to bring back the Presidential Council on Sports, Fitness and Nutrition — and with it the Presidential Fitness Test — has a healthy, get-off-the-couch ring to it. For as long as anybody can remember, the youth of America just isn…",
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_54356f77-fbb7-4637-abe9-bd45ccaecfa7",
    "timestamp": "2025-08-22T10:01:05Z"
  },
  {
    "title": "Canada moves forward on open banking while U.S. backtracks - The Logic",
    "description": "Canada moves forward on open banking while U.S. backtracks - The Logicthelogic.co",
    "link": "https://thelogic.co/news/open-banking-united-states-backtrack/",
    "timestamp": "2025-08-22T10:00:54Z"
  },
  {
    "title": "Top Democrats peeved over $8B Paramount-Skydance merger, citing Trump influence and canceled Colbert show",
    "description": "Top Democrats challenge $8 billion Skydance-Paramount merger, alleging political interference and improper settlement with Trump administration.",
    "link": "https://www.foxnews.com/media/top-democrats-peeved-over-8b-paramount-skydance-merger-citing-trump-influence",
    "timestamp": "2025-08-22T10:00:50Z"
  },
  {
    "title": "Trump delivered strategic blow to Iran regime with bold Azerbaijan-Armenia pact",
    "description": "President Trump’s South Caucasus deal secures U.S. control of a critical trade corridor bypassing Iran — a move experts call a strategic and economic 'nightmare' for Tehran.",
    "link": "https://www.foxnews.com/world/trump-delivered-strategic-blow-iran-regime-bold-azerbaijan-armenia-pact",
    "timestamp": "2025-08-22T10:00:45Z"
  },
  {
    "title": "Fact check: Trump and the case of the nonexistent $600 billion EU ‘gift’ | CNN Politics",
    "description": "Seventeen days ago, President Donald Trump made a dramatic claim in an interview on the business news channel CNBC. As part of his July trade agreement with the European Union, he said, the EU gave the United States a $600 billion present he could spend howev…",
    "link": "https://www.cnn.com/2025/08/22/politics/fact-check-trump-eu-us-gift",
    "timestamp": "2025-08-22T10:00:42Z"
  },
  {
    "title": "GOP governors are sending troops to DC. Their states have 10 cities with higher crime rates | CNN Politics",
    "description": "At least ten cities in states whose Republican governors are deploying National Guard troops to Washington, DC, had higher rates of violent crime or homicide than DC last year, according to a CNN review of FBI data.",
    "link": "https://www.cnn.com/2025/08/22/politics/gop-governors-troops-dc-10-cities-crime-rates",
    "timestamp": "2025-08-22T10:00:42Z"
  },
  {
    "title": "Would This Supreme Court Ever Overturn Same-Sex Marriage?",
    "description": "A close read by legal columnist Elie Honig of the justices and the case that might trigger a reexamination of ‘Obergefell.’",
    "link": "http://nymag.com/intelligencer/article/would-this-supreme-court-ever-overturn-gay-marriage.html",
    "timestamp": "2025-08-22T10:00:38Z"
  },
  {
    "title": "Jack Mintz: Government and business make bad corporate bedfellows",
    "description": "Private investors are supposed to add discipline but government representatives on boards will shrink from tough business decisions. Read on",
    "link": "https://financialpost.com/opinion/government-business-make-bad-corporate-bedfellows",
    "timestamp": "2025-08-22T10:00:23Z"
  },
  {
    "title": "The Art of the Deal, Russia-Ukraine Style | Opinion",
    "description": "If Trump can bring the war to a close, then he will have achieved what no Western leader since 2022 has had the courage to even attempt in earnest.",
    "link": "https://www.newsweek.com/art-deal-russia-ukraine-style-opinion-2117459",
    "timestamp": "2025-08-22T10:00:02Z"
  },
  {
    "title": "Ugly Laws: The Blueprint For Trump’s Anti-Homeless Crusade",
    "description": "On July 24, President Donald Trump issued an executive order for a nationwide push to involuntarily commit unhoused people to institutions—claiming that roundups would “restore public order,” and demanding the reversal of legal precedents and consent decrees …",
    "link": "https://www.motherjones.com/politics/2025/08/trump-dc-homeless-ugly-laws-order/",
    "timestamp": "2025-08-22T10:00:00Z"
  },
  {
    "title": "Democrats Are Missing Political Layups And Dooming Us All",
    "description": "Veteran strategist Nina Smith warns the Democratic Party is failing at the basics.\nThe post Democrats Are Missing Political Layups And Dooming Us All appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/22/briefing-podcast-democratic-party-voters/",
    "timestamp": "2025-08-22T10:00:00Z"
  },
  {
    "title": "Resilience in the Face of Russian Aggression",
    "description": "A Lithuanian MP on what Europe must do as the U.S. steps back",
    "link": "https://www.theatlantic.com/podcasts/archive/2025/08/resilience-face-russian-aggression/683960/",
    "timestamp": "2025-08-22T10:00:00Z"
  },
  {
    "title": "The Trump civil fraud case is a mess. Another round of appeal could clean it up.",
    "description": "President Donald Trump and New York Attorney General Letitia James both awkwardly claimed victory Thursday after New York’s intermediate appeals court handed down its ruling in Trump’s civil fraud case.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-civil-fraud-case-letitia-james-appeal-new-york-rcna226377",
    "timestamp": "2025-08-22T10:00:00Z"
  },
  {
    "title": "Ceasefire in Ukraine hinges on Zelensky as Putin sets three key demands",
    "description": "Washington, Aug  22: During talks in Alaska last week with former US President Donald Trump, Russian President Vladimir Putin laid […]\nThe post Ceasefire in Ukraine hinges on Zelensky as Putin sets three key demands appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/08/22/ceasefire-in-ukraine-hinges-on-zelensky-as-putin-sets-three-key-demands/",
    "timestamp": "2025-08-22T10:00:00Z"
  },
  {
    "title": "What It Would Actually Take to End the War in Ukraine",
    "description": "With Ukraine drained by more than three years of fighting, time is on the side of Vladimir Putin.",
    "link": "https://www.newyorker.com/news/the-lede/what-it-would-actually-take-to-end-the-war-in-ukraine",
    "timestamp": "2025-08-22T10:00:00Z"
  }
]