[
  {
    "title": "Canada's Liberal hopefuls talk Trump and carbon tax",
    "description": "The Liberal Party of Canada will soon choose a leader that will replace Justin Trudeau and become Canada's next prime minister.",
    "link": "https://www.bbc.com/news/articles/c2lj0vrkv9yo",
    "timestamp": "2025-02-26T03:54:06Z"
  },
  {
    "title": "Trump pitches ‘gold card’ as replacement for EB5 investor visa - The Hill",
    "description": "Trump pitches ‘gold card’ as replacement for EB5 investor visaThe Hill Trump says US will sell $5 million ‘gold card’ to wealthy foreignersCNN Donald Trump announces ‘gold card’ US visas to replace EB-5 visa: What it means for India?Mint Trump introduces a gr…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176547031",
    "timestamp": "2025-02-26T03:53:37Z"
  },
  {
    "title": "US Threats Mean Canada Must Strengthen Military, Candidates Say",
    "description": "Canada must quickly ramp up its defense spending to reach the NATO target while also weaning itself off US-made equipment, argued contenders to replace Justin Trudeau as prime minister.",
    "link": "https://financialpost.com/pmn/business-pmn/us-threats-mean-canada-must-strengthen-military-candidates-say",
    "timestamp": "2025-02-26T03:53:17Z"
  },
  {
    "title": "White House to choose which reporters get close access to Donald Trump - Financial Times",
    "description": "White House to choose which reporters get close access to Donald TrumpFinancial Times The White House is now deciding who can cover the president, reversing decades of precedentCNN Trump administration says it will take control of White House press poolAl Jaz…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176547027",
    "timestamp": "2025-02-26T03:53:17Z"
  },
  {
    "title": "Xi Urges Officials to Stay Calm as US Raises Pressure on China",
    "description": "Chinese President Xi Jinping urged officials to stay composed amid domestic and global challenges, signaling Beijing will take a measured approach to the Trump administration’s new trade and investment restrictions.",
    "link": "https://financialpost.com/pmn/business-pmn/xi-urges-officials-to-stay-calm-as-us-raises-pressure-on-china",
    "timestamp": "2025-02-26T03:52:57Z"
  },
  {
    "title": "White House official pushes to axe Canada from Five Eyes intelligence group",
    "description": "A top White House official has proposed expelling Canada from the Five Eyes intelligence-sharing network as Donald Trump increases pressure on the country he talks about turning into the 51st US state. Peter Navarro, one of the US president’s closest advisers…",
    "link": "https://freerepublic.com/focus/f-news/4300510/posts",
    "timestamp": "2025-02-26T03:48:20Z"
  },
  {
    "title": "Pastor Jamal Bryant calls blacks who celebrated at White House ‘runaway slaves' and ‘coons’",
    "description": "Megachurch Pastor Jamal Bryant called a group of black supporters of President Donald Trump “runaway slaves” and “coons” on Sunday after they appeared to mock him at a recent Black History Month reception at the White House. In a clip from his sermon on Sunda…",
    "link": "https://freerepublic.com/focus/f-religion/4300509/posts",
    "timestamp": "2025-02-26T03:47:44Z"
  },
  {
    "title": "An iCloud Backdoor Would Make Our Phones Less Safe",
    "description": "Last month, the UK government demanded that Apple weaken the security of iCloud for users worldwide. On Friday, Apple took steps to comply for users in the United Kingdom. But the British law is written in a way that requires Apple to give its government acce…",
    "link": "https://www.schneier.com/blog/archives/2025/02/an-icloud-backdoor-would-make-our-phones-less-safe.html",
    "timestamp": "2025-02-26T03:47:24Z"
  },
  {
    "title": "US dockworkers approve 6-year contract, averting a strike",
    "description": "WASHINGTON (AP) — Dockworkers on the U.S. East and Gulf coasts overwhelmingly approved a six-year contract Tuesday, averting the threat of a strike that could have crippled the economy. The yes vote was expected after the leadership of the International Longs…",
    "link": "https://financialpost.com/pmn/us-dockworkers-approve-6-year-contract-averting-a-strike",
    "timestamp": "2025-02-26T03:46:51Z"
  },
  {
    "title": "Rep. Byron Donalds, backed by Trump, announces run for Florida governor",
    "description": "Rep. Byron Donalds has announced that he's entering the race to succeed Florida Gov. Ron DeSantis in 2026.",
    "link": "https://www.cbsnews.com/miami/news/rep-byron-donalds-backed-by-trump-says-hes-running-for-florida-governor/",
    "timestamp": "2025-02-26T03:46:39Z"
  },
  {
    "title": "‘It’s A Serious Thing’: Peter Navarro Explains National Security Implications Of Copper Dumping In US Markets",
    "description": "Peter Navarro appeared on Newsmax Tuesday to discuss the national security implications of copper dumping in U.S. markets.",
    "link": "https://dailycaller.com/2025/02/25/peter-navarro-national-security-copper/",
    "timestamp": "2025-02-26T03:45:16Z"
  },
  {
    "title": "White House takes control of the press pool covering Trump",
    "description": "The White House said on Tuesday it would decide which media organizations participate in the press pool that covers the president, wresting control away from the group of journalists that has done so for decades.Karoline Leavitt, President Donald Trump's spok…",
    "link": "https://www.jpost.com/breaking-news/article-843776",
    "timestamp": "2025-02-26T03:41:22Z"
  },
  {
    "title": "Big EU countries push expanded carbon border tax to help repay Covid debt",
    "description": "France, Italy and Poland support the move, but others fear it might prompt Donald Trump to retaliate in anger.",
    "link": "https://www.politico.eu/article/big-eu-countries-push-expanded-carbon-border-tax-to-help-repay-covid-debt/",
    "timestamp": "2025-02-26T03:33:00Z"
  },
  {
    "title": "Not Time To Buy Yet? Bitcoin Faces Pressure As Standard Chartered Predicts Further 10% Drop",
    "description": "Earlier this morning, Bitcoin (BTC) hit a yearly low of $86,888 amid a broader market downturn. According to data from CoinGlass, the crypto market sell-off led to over $1.5 billion in liquidations in the past 24 hours, impacting 394,944 traders. More Downsid…",
    "link": "http://www.newsbtc.com/bitcoin-news/not-time-to-buy-yet-bitcoin-faces-pressure-as-standard-chartered-predicts-further-10-drop/",
    "timestamp": "2025-02-26T03:30:55Z"
  },
  {
    "title": "Michael Goodwin: Andrew Cuomo’s biggest challenge in a mayoral run will be getting past himself – and facing his many lows head-on",
    "description": "Now that Andrew Cuomo is getting close to announcing he’s running for mayor, he needs a campaign slogan.",
    "link": "https://nypost.com/2025/02/25/opinion/andrew-cuomos-challenge-is-getting-past-himself/",
    "timestamp": "2025-02-26T03:27:42Z"
  },
  {
    "title": "FCC Launches Probe Into iHeartMedia’s Alleged Payola Practices",
    "description": "The FCC is examining if iHeartMedia's artist compensation practices at its annual country festival involve improper “payola.”\nFCC Launches Probe Into iHeartMedia’s Alleged Payola Practices\nJo Vito",
    "link": "https://consequence.net/2025/02/fcc-probe-iheartmedia-artist-payola/",
    "timestamp": "2025-02-26T03:26:46Z"
  },
  {
    "title": "House Republicans hit the brakes on town halls after blowback over Trump's cuts",
    "description": "House Republicans are becoming wary of in-person town hall meetings after some lawmakers have faced hometown crowds angry about the Trump administration’s cuts.",
    "link": "https://www.nbcnews.com/politics/congress/house-republicans-town-halls-blowback-trump-cuts-rcna193766",
    "timestamp": "2025-02-26T03:23:08Z"
  },
  {
    "title": "Byron Donalds Announces Bid for Florida Governor After Trump Endorsement",
    "description": "Donalds made the announcement Tuesday night while speaking with Fox News host Sean Hannity.",
    "link": "https://www.newsweek.com/byron-donalds-announces-bid-florida-governor-after-trump-endorsement-2036287",
    "timestamp": "2025-02-26T03:21:44Z"
  },
  {
    "title": "Global Assets Regain Composure, Hang Seng Rallies: Markets Wrap",
    "description": "(Bloomberg) -- Stocks, Treasuries and other financial markets steadied after weak US economic data and concern about the health of the world’s largest...",
    "link": "https://finance.yahoo.com/news/stocks-slide-bonds-rally-us-223039956.html",
    "timestamp": "2025-02-26T03:21:32Z"
  },
  {
    "title": "Yields slumps with dollar as US growth worries weigh, Asia shares edge up",
    "description": "Data on Tuesday showed U.S. consumer confidence deteriorated at its sharpest pace in 3-1/2 years in February - the latest in a string of surveys suggesting that businesses and consumers were becoming increasingly rattled by the Trump administration's policies.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-yields-slumps-with-dollar-as-us-growth-worries-weigh-asia-shares-edge-up/articleshow/118570409.cms",
    "timestamp": "2025-02-26T03:20:46Z"
  },
  {
    "title": "Trump administration says it will take control of White House press pool",
    "description": "The White House Correspondents’ Association says move 'tears at the independence of a free press' in the US.",
    "link": "https://www.aljazeera.com/news/2025/2/26/trump-administration-says-it-will-take-control-of-white-house-press-pool",
    "timestamp": "2025-02-26T03:20:42Z"
  },
  {
    "title": "Trump to invite Philadelphia Eagles to White House after Super Bowl win",
    "description": "\"They'll be extended an invitation,\" Trump said in the Oval Office. \"They deserve to be down here.\"",
    "link": "https://www.bbc.com/news/articles/cx2rmxr90eyo",
    "timestamp": "2025-02-26T03:20:25Z"
  },
  {
    "title": "Trump wants Russia rare earths deal",
    "description": "US President Donald Trump has signaled openness to the idea of jointly developing Russia’s mineral deposits Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613314-trump-russia-rare-earths-deal/",
    "timestamp": "2025-02-26T03:20:03Z"
  },
  {
    "title": "Exclusive — Rubio Details How Trump Going on Offense Against China’s Belt and Road Initiative: ‘Big Story of 21st Century U.S.-China Relations’",
    "description": "Secretary of State Marco Rubio told Breitbart News exclusively that President Donald Trump and his administration are aiming to peel Russia off of China in much the same way former President Richard Nixon, during the Cold War, peeled China off of the Soviet U…",
    "link": "https://www.breitbart.com/politics/2025/02/25/exclusive-rubio-details-trump-offense-china-belt-road-initiative/",
    "timestamp": "2025-02-26T03:19:07Z"
  },
  {
    "title": "Chris Murphy to CNN's Blitzer: You're Reporting 'Nonsense,' Trump Is 'Spinning Kremlin Propaganda'",
    "description": "Tuesday on CNN's \"The Situation Room\" Sen. Chris Murphy (D-CT) told host Wolf Blitzer his network's reporting was \"nonsense\" about President Donald Trump and Ukrainian President Volodymyr Zelensky's negotiations.\nThe post Chris Murphy to CNN’s Blitzer: You’re…",
    "link": "https://www.breitbart.com/politics/2025/02/25/chris-murphy-to-cnns-blitzer-youre-reporting-nonsense-trump-is-spinning-kremlin-propaganda/",
    "timestamp": "2025-02-26T03:18:28Z"
  },
  {
    "title": "Dem Rep Asks Witness If US Marshals Could Haul Trump To Jail For ‘Contempt’",
    "description": "Democratic Rep. Hank Johnson of Georgia asked a judge if U.S. Marshals could haul President Donald Trump to jail for “contempt” in cases targeting the DOGE.",
    "link": "https://dailycaller.com/2025/02/25/dem-rep-asks-witness-if-us-marshals-could-haul-trump-to-jail-for-contempt/",
    "timestamp": "2025-02-26T03:17:34Z"
  },
  {
    "title": "Trump – not Zelensky – is Ukraine’s only hope",
    "description": "I have known Volodymyr Zelensky very well for years. As a senior official personally appointed by Zelensky, I spoke to him many times a day and observed him closely both in public and privately. We parted on good terms and without rancour. I have no personal …",
    "link": "https://freerepublic.com/focus/f-news/4300506/posts",
    "timestamp": "2025-02-26T03:17:15Z"
  },
  {
    "title": "Tesla's market value tumbles below $1 trillion as its Europe sales slump",
    "description": "The sales decline underscores Tesla's challenges following a dip in global deliveries last year that has raised pressure on CEO Elon Musk to roll out lower-priced models as well as the autonomous cars that he says underpin Tesla's future.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/teslas-market-value-tumbles-below-1-trillion-as-its-europe-sales-slump/articleshow/118570376.cms",
    "timestamp": "2025-02-26T03:17:11Z"
  },
  {
    "title": "Chris Hayes Savages ‘Ultimate Terrible Boss’ Elon Musk: ‘A Supercharged Version of Lumbergh’",
    "description": "MSNBC’s Chris Hayes likened Elon Musk to Bill Lumbergh, the chief antagonist of Mike Judge’s 1999 dark comedy classic Office Space, on his show Tuesday evening. Lumbergh, the fictional manager with few if any redeeming qualities, exemplifies the man pulling t…",
    "link": "https://www.mediaite.com/tv/chris-hayes-savages-ultimate-terrible-boss-elon-musk-a-supercharged-version-of-lumbergh/",
    "timestamp": "2025-02-26T03:14:38Z"
  },
  {
    "title": "Iran rules out direct nuclear talks as US intensifies sanctions",
    "description": "Iranian Foreign Minister Abbas Araqchi rules out the possibility of direct negotiations with the United States regarding Iran’s nuclear program: We will not negotiate under pressure, threat or sanctions.",
    "link": "https://www.israelnationalnews.com/news/404519",
    "timestamp": "2025-02-26T03:13:07Z"
  },
  {
    "title": "Rep. Byron Donalds Responds to Shot from Gov. Ron DeSantis",
    "description": "Gov. Ron DeSantis (R-FL) took a swipe at his potential – and President Donald Trump's favored – successor Monday during a stop in Tampa, Florida.\nThe post Rep. Byron Donalds Responds to Shot from Gov. Ron DeSantis appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/25/rep-byron-donalds-responds-to-shot-from-gov-ron-desantis/",
    "timestamp": "2025-02-26T03:11:22Z"
  },
  {
    "title": "Trump signs executive action targeting law firm representing former special counsel Jack Smith",
    "description": "Trump signs executive action targeting law firm representing former special counsel Jack Smithgo.com",
    "link": "https://abcnews.go.com/Politics/trump-signs-executive-action-targeting-law-firm-representing/story?id=119190846",
    "timestamp": "2025-02-26T03:05:34Z"
  },
  {
    "title": "Trump touts $5 Million 'gold card' visas for the rich",
    "description": "The US President says the card would offer residency and a path to citizenship and attract 'wealthy people.'",
    "link": "https://www.dw.com/en/trump-touts-5-million-gold-card-visas-for-the-rich/a-71750538",
    "timestamp": "2025-02-26T03:04:00Z"
  },
  {
    "title": "Why Putin is finally negotiating",
    "description": "Moscow could soon struggle to finance the war, and fiscal breathing room may well be what the Russian leader's looking for.",
    "link": "https://www.politico.eu/article/vladimir-putin-russia-donald-trump-moscow-ukraine-gdp-finance-war-banks/",
    "timestamp": "2025-02-26T03:00:00Z"
  },
  {
    "title": "Most Asian markets rebound as Hong Kong tech rally resumes",
    "description": "Asian markets mostly rose on Wednesday after a poor start to the week, with Hong Kong boosted by a rebound in tech firms that had taken a hit from US moves to curb Chinese investments in the country. Traders brushed off another disappointing day on Wall Stree…",
    "link": "https://www.digitaljournal.com/world/most-asian-markets-rebound-as-hong-kong-tech-rally-resumes/article",
    "timestamp": "2025-02-26T02:57:32Z"
  },
  {
    "title": "Meet Amy Gleason, the DOGE office's new acting administrator",
    "description": "For weeks, it has been unclear who was leading the DOGE office.",
    "link": "https://www.businessinsider.com/who-is-doge-office-administrator",
    "timestamp": "2025-02-26T02:56:43Z"
  },
  {
    "title": "Trump orders new tariff probe into US copper imports",
    "description": "WASHINGTON: President Donald Trump opened yet another front on Tuesday (Feb 25) in his assault on global trade norms, ordering a probe into potential new tariffs on copper imports to rebuild US production of a metal critical to electric vehicles, military har…",
    "link": "https://www.channelnewsasia.com/world/trump-orders-new-tariff-probe-us-copper-imports-4959966",
    "timestamp": "2025-02-26T02:56:00Z"
  },
  {
    "title": "Maine legislature censures Rep. Laurel Libby for pointing out trans athlete who won girls' competition",
    "description": "The Maine House of Representatives voted to censure Rep. Laurel Libby for pointing out that a trans athlete won a girls' pole vault competition.",
    "link": "https://www.foxnews.com/sports/maine-legislature-censures-rep-who-spoke-out-against-trans-athletes-girls-sports-amid-trump-threats",
    "timestamp": "2025-02-26T02:55:36Z"
  },
  {
    "title": "Dramatic House Vote Delivers Narrow Victory For Trump's Controversial Budget Agenda",
    "description": "The House of Representatives voted to adopt the Republicans' sweeping budget proposal on Tuesday night, advancing President Donald Trump's agenda of massive spending cuts.",
    "link": "https://www.ibtimes.com/dramatic-house-vote-delivers-narrow-victory-trump-budget-agenda-3764912",
    "timestamp": "2025-02-26T02:54:39Z"
  },
  {
    "title": "Scientists find clues on why COVID vaccine causes chronic health problems in some - NewsBreak",
    "description": "Yale researchers have found clues as to why certain people experience adverse health effects after the COVID-19 vaccine, which they have dubbed “post-vacci",
    "link": "https://www.newsbreak.com/share/3827656864106-scientists-find-clues-on-why-covid-vaccine-causes-chronic-health-problems-in-some?_f=app_share&amp;pd=0HioQQVk&amp;lang=en_US&amp;send_time=1740538341&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v8%2Cns_foryou_rank_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v2&amp;s=i2",
    "timestamp": "2025-02-26T02:53:05Z"
  },
  {
    "title": "Musk’s India move shows the cracks in Trump’s coalition",
    "description": "Elon Musk's companies, including Tesla, may have finally cracked the Indian market, with recent reports of Tesla hiring in India and planning car shipments. However, this development may cause friction with US President Donald Trump, who prefers keeping Ameri…",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/musks-india-move-shows-the-cracks-in-trumps-coalition/articleshow/118570048.cms",
    "timestamp": "2025-02-26T02:50:46Z"
  },
  {
    "title": "Michael Moore says deported migrants could have cured cancer, stopped ‘asteroid that’s gonna hit us in 2032’",
    "description": "Moore declared that he often feels compelled to 'pause, get down on one knee, and thank' immigrants for coming to America.",
    "link": "https://nypost.com/2025/02/25/media/michael-moore-says-deported-migrants-could-have-cured-cancer/",
    "timestamp": "2025-02-26T02:49:48Z"
  },
  {
    "title": "‘Taking a Vacation in Mexico???’ Chris Hayes Can’t Believe Official DOGE Head Is Out of the Country Right After Starting New Job",
    "description": "The Trump administration finally named an official administrator of Elon Musk's \"Department of Government Efficiency\" – and it turns out she's in Mexico.\nThe post ‘Taking a Vacation in Mexico???’ Chris Hayes Can’t Believe Official DOGE Head Is Out of the Coun…",
    "link": "https://www.mediaite.com/tv/taking-a-vacation-in-mexico-chris-hayes-cant-believe-official-doge-head-is-abroad-right-after-starting-new-job/",
    "timestamp": "2025-02-26T02:48:45Z"
  },
  {
    "title": "House GOP pushes 'big' budget resolution to passage, a step toward delivering Trump agenda",
    "description": "It includes $4.5 trillion in tax breaks and $2 trillion in spending cuts despite a wall of opposition from Democrats and discomfort among Republicans.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_69a1ee2a-503b-531d-976c-301c8b2d49cc.html",
    "timestamp": "2025-02-26T02:47:00Z"
  },
  {
    "title": "House GOP pushes 'big' budget resolution to passage, a step toward delivering Trump agenda",
    "description": "It includes $4.5 trillion in tax breaks and $2 trillion in spending cuts despite a wall of opposition from Democrats and discomfort among Republicans.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_002028c3-2279-5612-beb3-981fbdfaec17.html",
    "timestamp": "2025-02-26T02:47:00Z"
  },
  {
    "title": "Trump Can Delay A Bitcoin Meltdown By Announcing Strategic Reserve, Says Peter Schiff: 'Turn Out The Lights, The BTC $100,000 Party Is Over'",
    "description": "Renowned market commentator Peter Schiff said Tuesday that only a strategic Bitcoin (CRYPTO: BTC) reserve announced by President Donald Trump could halt the ongoing market slump.\nWhat happened: In an X post, Schiff wrote, \"I think the only thing that can dela…",
    "link": "https://biztoc.com/x/baa0470332098a8d",
    "timestamp": "2025-02-26T02:46:54Z"
  },
  {
    "title": "‘Assault On American Sovereignty’: Red State Officials Urge Trump To Probe EU’s Corporate Climate Mandates",
    "description": "Twenty-six financial officials wrote to President Donald Trump on Tuesday urging him and his administration to review European Union climate rules applying ...",
    "link": "https://dailycaller.com/2025/02/25/red-states-trump-probe-european-union-corporate-climate-esg/",
    "timestamp": "2025-02-26T02:43:31Z"
  },
  {
    "title": "Trump to sell 'gold card' US visas for US$5 million",
    "description": "WASHINGTON: US President Donald Trump unveiled plans on Tuesday (Feb 25) to sell new \"gold card\" residency permits for a price of US$5 million each - and said Russian oligarchs may be eligible. Trump said sales of the new visa, a high-price version of the tra…",
    "link": "https://www.channelnewsasia.com/world/united-states-president-donald-trump-gold-card-visas-5-million-4960521",
    "timestamp": "2025-02-26T02:41:49Z"
  },
  {
    "title": "New House Budget Could Push Student Loan Payments By $200 Monthly",
    "description": "Many borrowers put repayments on hold while they were paused, hoping student loans would be wiped clean. That won’t happen, but no one knows what will take its place.",
    "link": "https://www.forbes.com/sites/eriksherman/2025/02/25/new-house-budget-could-push-student-loan-payments-by-200-monthly/",
    "timestamp": "2025-02-26T02:38:55Z"
  },
  {
    "title": "Video Shows Democrat Jasmine Crockett Cursing Out Elon Musk",
    "description": "Crockett was asked on Tuesday what she would say to Musk directly if provided the opportunity.",
    "link": "https://www.newsweek.com/video-shows-democrat-jasmine-crockett-cursing-out-elon-musk-2036272",
    "timestamp": "2025-02-26T02:38:42Z"
  },
  {
    "title": "US will sell ‘gold card’ to wealthy foreigners, Trump says, replacing EB-5 visa program",
    "description": "President Donald Trump said the US would be selling what he described as a “gold card” to wealthy foreigners, giving them the right to live and work in the US and offering a path to citizenship in exchange for a $5 million fee.",
    "link": "https://www.cnn.com/2025/02/25/politics/us-gold-card-foreigners-trump/index.html",
    "timestamp": "2025-02-26T02:38:19Z"
  },
  {
    "title": "DNI Tulsi Gabbard moves to terminate, revoke security clearances of NSA employees tied to explicit chatrooms",
    "description": "Director of National Intelligence Tulsi Gabbard addressed reports of NSA employees misusing an internal agency messaging board and discussing explicit content on 'Jesse Watters Primetime.'",
    "link": "https://www.foxnews.com/media/dni-tulsi-gabbard-moves-terminate-revoke-security-clearances-nsa-employees-tied-explicit-chatrooms",
    "timestamp": "2025-02-26T02:38:18Z"
  },
  {
    "title": "White House takes control of the press pool covering Trump",
    "description": "The White House, under President Trump, announced changes to the press pool selection process, taking control from the White House Correspondents' Association (WHCA). Traditional media will still participate, but the administration will choose which journalis…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/white-house-takes-control-of-the-press-pool-covering-trump/articleshow/118569973.cms",
    "timestamp": "2025-02-26T02:37:33Z"
  },
  {
    "title": "Donald Trump, Elon Musk Get Support From Former NFL Superstar Le’Veon Bell Amid Nonsensical DOGE Criticism",
    "description": "Le'Veon Bell, a former running back for the Pittsburgh Steelers, has publicly shown his support for both President Donald Trump and billionaire Elon Musk.",
    "link": "https://dailycaller.com/2025/02/25/donald-trump-leveon-bell-elon-musk-doge/",
    "timestamp": "2025-02-26T02:37:28Z"
  },
  {
    "title": "Under pressure, EU to take axe to green rules",
    "description": "The EU is expected to roll back a slew of environmental rules on Wednesday as it charges ahead with a deregulation drive in a bid to keep up with the United States and China. The European Union’s focus has pivoted to competitivity amid concerns over sluggish …",
    "link": "https://www.digitaljournal.com/world/under-pressure-eu-to-take-axe-to-green-rules/article",
    "timestamp": "2025-02-26T02:37:20Z"
  },
  {
    "title": "Private US company set for second Moon landing attempt",
    "description": "Intuitive Machines made history last year as the first private company to put a robot on the Moon, although the triumph was marred by the lander tipping onto its side. Now, the Houston-based firm is gearing up for a second attempt, determined to achieve a per…",
    "link": "https://www.digitaljournal.com/world/private-us-company-set-for-second-moon-landing-attempt/article",
    "timestamp": "2025-02-26T02:37:20Z"
  },
  {
    "title": "Fried! Trump cracks, egg prices soar & Musk scrambles after budget cuts prove to be 'over-easy'",
    "description": "A nationwide egg shortage continues amid new reporting on how Donald Trump's “mass firings” gutted expert staff doing “bird flu ...",
    "link": "https://biztoc.com/x/508278b7875f98da",
    "timestamp": "2025-02-26T02:37:13Z"
  },
  {
    "title": "Musk blasts judges over Trump executive orders: 'We do NOT have democracy, we have TYRANNY of the JUDICIARY'",
    "description": "Elon Musk on Tuesday criticized federal judges on social media, citing resistance against some of President Donald Trump executive orders.",
    "link": "https://www.foxnews.com/politics/musk-blast-judges-trump-executive-orders-we-do-not-have-democracy-we-have-tyranny-judiciary",
    "timestamp": "2025-02-26T02:35:34Z"
  },
  {
    "title": "Florida Rep. Byron Donalds announces plans to run for governor",
    "description": "Rep. Byron Donalds, R-Fla., announced his plans to run for Florida governor in 2026 during an interview on \"Hannity\" Tuesday night. Donalds has been endorsed by President Donald Trump.",
    "link": "https://www.foxnews.com/politics/florida-rep-byron-donalds-announces-plans-run-governor",
    "timestamp": "2025-02-26T02:34:46Z"
  },
  {
    "title": "Chris Mason: Keir Starmer to meet Donald Trump with world history in flux - BBC.com",
    "description": "Chris Mason: Keir Starmer to meet Donald Trump with world history in fluxBBC.com U.K. to Raise Defense Spending to 2.5% of G.D.P. by 2027, Starmer SaysThe New York Times Charities appalled by UK cut to aid budget to fund defence spendingReuters UK What the pa…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176546597",
    "timestamp": "2025-02-26T02:33:16Z"
  },
  {
    "title": "Shunned by US, Europe courts India over trade and security",
    "description": "The EU’s top team is to embark on an “unprecedented” visit to India this week, as the bloc seeks to broaden its commercial and diplomatic ties to hedge against souring relations with the United States. EU chief Ursula von der Leyen and her college of commissi…",
    "link": "https://www.digitaljournal.com/world/shunned-by-us-europe-courts-india-over-trade-and-security/article",
    "timestamp": "2025-02-26T02:32:33Z"
  },
  {
    "title": "US energy secretary touts nuclear power as tech sector’s thirst for electricity grows",
    "description": "ALBUQUERQUE, N.M. (AP) — U.S. Energy Secretary Chris Wright says it’s critical that the nation be out in front when it comes to artificial intelligence, and that means having reliable and affordable sources of electricity to meet the growing demands of the te…",
    "link": "https://financialpost.com/pmn/us-energy-secretary-touts-nuclear-power-as-tech-sectors-thirst-for-electricity-grows",
    "timestamp": "2025-02-26T02:31:58Z"
  },
  {
    "title": "What to know about national park layoffs and potential closures",
    "description": "The U.S. Department of the Interior said no parks are expected to close in the summer, but park rangers warned of reduced hours and services.",
    "link": "https://www.snopes.com//news/2025/02/26/national-parks-layoffs-closures/",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "U.S. to Replace Investor Visas With $5 Million ‘Trump Gold Card’ Path to Citizenship",
    "description": "The permanent residency card for wealthy foreigners is set to replace EB-5 visas for investors.",
    "link": "https://time.com/7261783/trump-gold-card-visa-permanent-residency-path-citizenship-eb5-million/",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "Who is Amy Gleason, the Low-Profile Official Named Acting Administrator of DOGE?",
    "description": "Long a mystery who was technically in charge of the Department of Government Efficiency, the White House identified low-profile executive Amy Gleason.",
    "link": "https://time.com/7261788/amy-gleason-doge-acting-administrator-government-efficiency-elon-musk-trump/",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "Trump Suspends Covington Lawyers’ Security Clearances for Working With Jack Smith",
    "description": "Covington, a prominent D.C. law firm, is the latest target of the President’s campaign of retribution over the criminal investigations that dogged him before he returned to office.",
    "link": "https://time.com/7261789/trump-suspends-security-clearances-covington-lawyers-jack-smith/",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "Outrage over plans to ‘gut’ EU regulations on how firms affect environment and people",
    "description": "Rules requiring companies to ­monitor, report and limit their impact on people and the environment are about to be “eviscerated”, campaign groups have said.",
    "link": "https://www.independent.ie/irish-news/outrage-over-plans-to-gut-eu-regulations-on-how-firms-affect-environment-and-people/a684358885.html",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "US companies still see Ireland as a good place to invest, new survey reveals",
    "description": "US companies operating in Ireland continue to hold a positive view of the country as a location for investment and growth, according to a new survey by the American Chamber of Commerce (AmCham) of its members.",
    "link": "https://www.independent.ie/business/us-companies-still-see-ireland-as-a-good-place-to-invest-new-survey-reveals/a1880361619.html",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "Letters: Those of us who value democracy have a duty to take stand against Trump",
    "description": "Following a UN Security Council resolution that failed to condemn Russia’s invasion of Ukraine, Donald Trump has again shown he has betrayed, for his own self-interest, the legacies of previous presidencies that stood against aggressors like Vladimir Putin an…",
    "link": "https://www.independent.ie/opinion/letters/letters-those-of-us-who-value-democracy-have-a-duty-to-take-stand-against-trump/a2058459056.html",
    "timestamp": "2025-02-26T02:30:00Z"
  },
  {
    "title": "Lia Thomas' ex-teammate shreds left for tolerating transgender athletes in women's sports: 'Lost their mind'",
    "description": "Paula Scanlan had a front row seat for teammate Lia Thomas' NCAA championship three years ago. She's continuing to fight against transgender athletes in women's sports.",
    "link": "https://www.foxnews.com/sports/lia-thomas-ex-teammate-shreds-left-tolerating-transgender-athletes-womens-sports-lost-mind",
    "timestamp": "2025-02-26T02:27:59Z"
  },
  {
    "title": "South Korea’s Trade Minister to Meet With Lutnick Over Tariffs",
    "description": "South Korea’s top trade official said he’ll seek an exemption from US tariffs when he meets with Commerce Secretary Howard Lutnick in Washington this week.",
    "link": "https://financialpost.com/pmn/business-pmn/south-koreas-trade-minister-to-meet-with-lutnick-over-tariffs",
    "timestamp": "2025-02-26T02:26:42Z"
  },
  {
    "title": "House GOP pushes 'big' budget resolution to passage, a crucial step toward delivering Trump's agenda",
    "description": "House GOP pushes 'big' budget resolution to passage, a crucial step toward delivering Trump's agendawsbtv.com",
    "link": "https://www.wsbtv.com/news/politics/house-gop-pushes-big/UWE663Y3HZGAHBPCQMXK2GQMWQ/",
    "timestamp": "2025-02-26T02:21:33Z"
  },
  {
    "title": "Trump Announces Plan To Sell Pathway To Citizenship For The Wealthy With ‘Trump Gold Card’",
    "description": "Trump referred to his gold card idea as a green card with a “higher level of sophistication.\"",
    "link": "https://www.huffpost.com/entry/trump-sell-pathway-to-citizenship-wealthy-gold-card_n_67be49d4e4b0aee10b22b9b0",
    "timestamp": "2025-02-26T02:14:52Z"
  },
  {
    "title": "Trump Says He Could Sell ‘Russian Oligarchs’ a ‘Route’ to U.S. Citizenship",
    "description": "Trump unveiled his plans to offer a shiny new \"gold card\" with a price tag of $5 million to \"very high-level people,\" among them \"Russian oligarchs.\"",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-gold-card-visa-russian-oligarchs-immigration-1235280121/",
    "timestamp": "2025-02-26T02:13:49Z"
  },
  {
    "title": "House approves ‘big, beautiful bill’ budget after wild whip effort",
    "description": "House Republicans approved a budget framework for President Donald Trump's sweeping domestic policy agenda Tuesday — a major victory for Speaker Mike Johnson who worked with Trump and fellow leaders in a chaotic last-ditch effort to win over naysayers within …",
    "link": "https://biztoc.com/x/3c32a0f88253b912",
    "timestamp": "2025-02-26T02:13:43Z"
  },
  {
    "title": "UK to raise defense spending to 2.5% of GDP by 2027, Keir Starmer says before Trump meeting",
    "description": "Prime Minister Keir Starmer pledged to increase U.K. defense spending to 2.5% of GDP by 2027, citing a 'new era of insecurity' in Europe. The increase will be financed by cutting overseas development aid. Starmer's announcement aims to strengthen ties with th…",
    "link": "https://economictimes.indiatimes.com/news/defence/uk-to-raise-defense-spending-to-2-5-of-gdp-by-2027-keir-starmer-says-before-trump-meeting/articleshow/118569753.cms",
    "timestamp": "2025-02-26T02:13:39Z"
  },
  {
    "title": "US House narrowly passes Trump-backed spending bill",
    "description": "It is still several steps from becoming law, but marks an early victory for Republican House Speaker Mike Johnson.",
    "link": "https://www.bbc.com/news/articles/cp9yx7e13ryo",
    "timestamp": "2025-02-26T02:12:43Z"
  },
  {
    "title": "Trump to sell ‘gold card’ US visas for $5 million",
    "description": "US President Donald Trump unveiled plans Tuesday to sell new “gold card” residency permits for a price of $5 million each — and said Russian oligarchs may be eligible. Trump said sales of the new visa, a high-price version of the traditional green card, would…",
    "link": "https://www.digitaljournal.com/world/trump-to-sell-gold-card-us-visas-for-5-million/article",
    "timestamp": "2025-02-26T02:02:20Z"
  },
  {
    "title": "ESPN broadcaster talks navigating politics while calling USA-Canada 4 Nations final: 'Had to say something'",
    "description": "ESPN broadcaster Sean McDonough discussed the difficulties of bringing up political tensions between USA and Canada during the 4 Nations final.",
    "link": "https://www.foxnews.com/sports/espn-broadcaster-talks-navigating-politics-while-calling-usa-canada-4-nations-final-had-say-something",
    "timestamp": "2025-02-26T02:01:05Z"
  },
  {
    "title": "The Rhode Island Foundation’s Discriminatory Grantmaking Warrants Civil Rights Investigation",
    "description": "Equal Protection Project urges federal agencies to put RIF, with over $1 billion in assets, on the shortlist for investigation of possible civil rights violations, pursuant to President Trump's January 21, 2025, Executive Order 14173.\nThe post The Rhode Islan…",
    "link": "https://legalinsurrection.com/2025/02/the-rhode-island-foundations-discriminatory-grantmaking-warrants-civil-rights-investigation/",
    "timestamp": "2025-02-26T02:00:59Z"
  },
  {
    "title": "California college students demand the university remove financial aid barriers for illegal immigrants",
    "description": "During a protest that broke out at the University of California San Diego, students demanded their school’s administrators remove the financial aid cap for illegal immigrants.",
    "link": "https://www.foxnews.com/media/california-college-students-demand-university-remove-financial-aid-barriers-illegal-immigrants",
    "timestamp": "2025-02-26T02:00:52Z"
  },
  {
    "title": "Pentagon to be ‘shaken up’ – White House",
    "description": "The Pentagon is set for a major overhaul, with President Donald Trump ordering a leadership shake-up, according to Karoline Leavitt Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613313-pentagon-trust-shaking-up/",
    "timestamp": "2025-02-26T02:00:46Z"
  },
  {
    "title": "Scientists have identified a new coronavirus in bats, but it’s not a public health threat",
    "description": "(CNN) — Scientists at the Wuhan Institute of Virology in China have discovered a new lineage of a coronavirus in bats that can enter human cells in a similar fashion",
    "link": "https://www.channel3000.com/news/scientists-have-identified-a-new-coronavirus-in-bats-but-it-s-not-a-public-health/article_04eba28a-4114-5488-96d6-62f53b507fa0.html",
    "timestamp": "2025-02-26T02:00:38Z"
  },
  {
    "title": "Trump floats 'gold card' to grant US residency to wealthy foreigners (Ali Bianco/Politico)",
    "description": "Ali Bianco / Politico:\nTrump floats ‘gold card’ to grant US residency to wealthy foreigners  —  The $5M visa would replace the investor visa program.  —  President Donald Trump says he's open to attracting one kind of immigrant — people with money.  —  Trump …",
    "link": "https://www.memeorandum.com/250225/p147",
    "timestamp": "2025-02-26T02:00:29Z"
  },
  {
    "title": "JUST IN: House Passes Trump-Backed Budget Proposal 217-215 – Massie Votes “No”",
    "description": "In a closely contested vote, House Republicans have passed a pivotal spending bill, signaling potential shifts in fiscal policy. The implications of this decision warrant careful examination.\nThe post JUST IN: House Passes Trump-Backed Budget Proposal 217-215…",
    "link": "https://www.thegatewaypundit.com/2025/02/just-house-passes-republican-spending-bill-217-215/",
    "timestamp": "2025-02-26T02:00:18Z"
  },
  {
    "title": "Why Robin Williams (& Others) Refused The Mark Twain Prize Explained",
    "description": "The Mark Twain Prize for American Humor is a big honor, but that doesn't mean every would-be recipient accepted. Robin Williams actually refused.",
    "link": "https://screenrant.com/why-did-robin-williams-refuse-the-mark-twain-prize-explained/",
    "timestamp": "2025-02-26T02:00:18Z"
  },
  {
    "title": "Think different: Consider a smartphone tariff cut to sustain an Apple-led export boom",
    "description": "If Apple’s Tim Cook fails to get a US import policy carve-out for iPhones and Trump’s reciprocal levy kicks in, India might need to lower its own duty to sustain a smartphone export boom—our big ‘Make in India’ success.",
    "link": "https://www.livemint.com/opinion/online-views/think-different-consider-a-smartphone-tariff-cut-to-sustain-an-apple-led-export-boom-india-tariff-donald-trump-tim-cook-11740491507061.html",
    "timestamp": "2025-02-26T02:00:13Z"
  },
  {
    "title": "Scientists find clues on why COVID vaccine causes chronic health problems in some - NewsBreak",
    "description": "Yale researchers have found clues as to why certain people experience adverse health effects after the COVID-19 vaccine, which they have dubbed “post-vacci",
    "link": "https://www.newsbreak.com/share/3827656864106-scientists-find-clues-on-why-covid-vaccine-causes-chronic-health-problems-in-some?_f=app_share&amp;pd=0GyHuM80&amp;lang=en_US&amp;send_time=1740535122&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.8.2.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-control%2Cns_foryou_rank_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-control%2Cns_foryou_model_exp_25q1-v2&amp;s=i2",
    "timestamp": "2025-02-26T01:59:57Z"
  },
  {
    "title": "US dollar wallows near 11-week low amid soft economic data, tariff worries",
    "description": "TOKYO : The U.S. dollar sagged near an 11-week low against its major peers on Wednesday, under pressure from sliding short-term Treasury yields after a run of weak economic data.The safe-haven yen strengthened towards its highest level since October with inve…",
    "link": "https://www.channelnewsasia.com/business/us-dollar-wallows-near-11-week-low-amid-soft-economic-data-tariff-worries-4960481",
    "timestamp": "2025-02-26T01:57:31Z"
  },
  {
    "title": "Musk's new ultimatum spurs fresh confusion among US government workers",
    "description": "Elon Musk's ultimatum to federal workers has led to confusion and resignations as conflicting guidance spreads across agencies. The situation underscores internal divisions within the Trump administration, with significant layoffs looming, affecting various d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/musks-new-ultimatum-spurs-fresh-confusion-among-us-government-workers/articleshow/118569619.cms",
    "timestamp": "2025-02-26T01:57:02Z"
  },
  {
    "title": "Noem announces DHS registry for illegal aliens in US that will require them to be fingerprinted",
    "description": "Department of Homeland Security Secretary Kristi Noem told illegal immigrants to either self-deport, register and be fingerprinted with the federal government or jeopardize their chance of freedom.",
    "link": "https://www.foxnews.com/politics/noem-announces-dhs-registry-illegal-aliens-us-require-fingerprinted",
    "timestamp": "2025-02-26T01:56:40Z"
  },
  {
    "title": "Trump Strips Power From Left-Leaning White House Correspondents' Association Led By 'Kamala Harris Expert'",
    "description": "The Trump administration on Tuesday stripped the White House Correspondents' Association (WHCA) of the power to determine which outlets can participate in the White House press pool. The association's leader, Eugene Daniels, Politico correspondent and soon-to…",
    "link": "https://freerepublic.com/focus/f-news/4300492/posts",
    "timestamp": "2025-02-26T01:55:45Z"
  },
  {
    "title": "House Passes Budget Bill—Major Win For Trump And Johnson In First Legislative Test",
    "description": "\"The House on Tuesday evening approved a budget resolution that lays the framework for President Donald Trump’s agenda, extends Trump’s 2017 tax cuts and boosts defense spending in exchange for trillions in spending curbs—with Republicans overcoming concerns …",
    "link": "https://freerepublic.com/focus/f-news/4300491/posts",
    "timestamp": "2025-02-26T01:54:42Z"
  },
  {
    "title": "The Republican Party’s Constituency Has Changed. They Aren’t Acting Like It.",
    "description": "The congressional majority has a priority. It would be really bad for their constituents.",
    "link": "https://slate.com/news-and-politics/2025/02/trump-medicaid-cuts-republicans-reconciliation-mike-johnson.html",
    "timestamp": "2025-02-26T01:53:01Z"
  },
  {
    "title": "Trump blocked from imposing sweeping federal funding freeze",
    "description": "A U.S. judge extended an order blocking the Trump administration from pausing federal funding for grants, loans, and financial support. The judge highlighted ongoing risks of potential funding freezes and agreed with nonprofits and small businesses that an in…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-blocked-from-imposing-sweeping-federal-funding-freeze/articleshow/118569588.cms",
    "timestamp": "2025-02-26T01:52:02Z"
  },
  {
    "title": "HOUSE GOP ADOPTS TRUMP BUDGET [217-215]",
    "description": "House Republicans adopted the budget resolution that will lay the foundation for enacting President Trump’s legislative agenda Tuesday night, just minutes after they initially pulled the measure from the floor. The legislation— which provides a framework for …",
    "link": "https://freerepublic.com/focus/f-news/4300488/posts",
    "timestamp": "2025-02-26T01:51:20Z"
  },
  {
    "title": "Tax Cut Chances Rise as House Passes Budget Targeting Safety Net",
    "description": "Chances for early action on Donald Trump’s tax cut plans improved as House Republicans passed a budget blueprint Tuesday calling for deep cuts in safety-net programs such as Medicaid.",
    "link": "https://financialpost.com/pmn/business-pmn/tax-cut-chances-rise-as-house-passes-budget-targeting-safety-net",
    "timestamp": "2025-02-26T01:51:12Z"
  },
  {
    "title": "Philadelphia will keep allowing trans athletes to play girls sports, defying Trump and new Pennsylvania law",
    "description": "Schools in Philadelphia will continue allowing transgender athletes to participate in girls sports after Pennsylvania changed its policy to prevent it from happening.",
    "link": "https://www.foxnews.com/sports/philadelphia-keep-letting-trans-athletes-play-girls-sports-defying-trump-new-pennsylvania-law",
    "timestamp": "2025-02-26T01:50:21Z"
  }
]