[
  {
    "title": "Harvard is hoping court rules Trump administration's $2.6B research cuts were illegal",
    "description": "Harvard University appears in federal court Monday, challenging $2.6 billion in funding cuts by the Trump administration",
    "link": "https://abcnews.go.com/Politics/wireStory/harvard-hoping-court-rules-trump-administrations-26b-research-123918340",
    "timestamp": "2025-07-21T11:55:07Z"
  },
  {
    "title": "5 things to know before the stock market opens on Monday",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/07/21/5-things-to-know-before-the-stock-market-opens-on-monday-july-21.html",
    "timestamp": "2025-07-21T11:53:32Z"
  },
  {
    "title": "Trump’s Brazil Blow-Up Raises Stakes for Leftist Summit in Chile",
    "description": "Fresh off Donald Trump’s threat to slap 50% tariffs on Brazil, a summit of leftist leaders risks triggering a broader backlash from the White House.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-brazil-blow-up-raises-stakes-for-leftist-summit-in-chile",
    "timestamp": "2025-07-21T11:52:52Z"
  },
  {
    "title": "Tables turn as House GOP blasts Dems for suddenly demanding Epstein transparency from Trump admin",
    "description": "Political battle erupts over Jeffrey Epstein documents as Democrats seize on Republican divisions after Trump administration's DOJ memo stated the convicted sex offender died by suicide and there is no \"client list.\"",
    "link": "https://www.foxnews.com/politics/tables-turn-house-gop-blasts-dems-suddenly-demanding-epstein-transparency-from-trump-admin",
    "timestamp": "2025-07-21T11:52:34Z"
  },
  {
    "title": "Lindsay Graham Compares Trump to Scottie Scheffler, Warns Putin He’s About to ‘Put a Whoopin’ on Your Ass’",
    "description": "Sen. Lindsay Graham (R-SC) tee'd off on Russian strongman Vladimir Putin Sunday night, declaring President Donald Trump is about to put a \"whoopin' on your ass\" while comparing the commander in chief to golf champion Scottie Scheffler.\nThe post Lindsay Graham…",
    "link": "https://www.mediaite.com/media/tv/lindsay-graham-compares-trump-to-scottie-scheffler-warns-putin-hes-about-to-put-a-whoopin-on-your-ass/",
    "timestamp": "2025-07-21T11:48:21Z"
  },
  {
    "title": "Ellen DeGeneres: America Sucks Now! I Love England!",
    "description": "Reading Time: 3 minutesEllen DeGeneres is now a resident of the United Kingdom. She says it's all because of what Donald Trump has done to America.\nEllen DeGeneres: America Sucks Now! I Love England! was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/07/ellen-degeneres-america-sucks-now-i-love-england/",
    "timestamp": "2025-07-21T11:48:01Z"
  },
  {
    "title": "Iran to hold nuclear talks with Euro nations, the first since ceasefire with Israel",
    "description": "Iran plans to hold nuclear talks with European nations this week in Turkey",
    "link": "https://abcnews.go.com/International/wireStory/iran-hold-nuclear-talks-european-nations-turkey-ceasefire-123919320",
    "timestamp": "2025-07-21T11:47:30Z"
  },
  {
    "title": "US automakers exempted from fines for fuel efficiency non-compliance",
    "description": "US regulators have waived fines for automakers failing to meet fuel efficiency standards dating back to the 2022 model year, following a new law signed by President Donald Trump.\nThis move, part of a tax and budget bill, puts an end to fines under the Corpora…",
    "link": "https://biztoc.com/x/f630554bc4785c52",
    "timestamp": "2025-07-21T11:46:27Z"
  },
  {
    "title": "Trump truly outdoes himself with unhinged AI clip of Barack Obama getting ‘arrested’",
    "description": "In a stunningly brazen display of online misinformation, president Donald Trump shared an AI-generated, entirely fake clip of himself laughing at Barack Obama getting arrested. The 79-year-old US president took to his Twitter-like social media platform, Truth…",
    "link": "https://www.thepinknews.com/2025/07/21/donald-trump-obama-ai-video-clip/",
    "timestamp": "2025-07-21T11:46:17Z"
  },
  {
    "title": "Will Indonesia Regret Its Trade Deal With Trump?",
    "description": "By guaranteeing that Indonesia will not face tariffs exceeding 19% on its exports to the US through 2029, its new trade agreement with the Trump administration seems to provide a degree of certainty at a time of volatility. But at what cost?",
    "link": "https://www.project-syndicate.org/commentary/indonesia-trade-deal-with-us-may-mean-minimal-short-term-gains-and-high-long-term-costs-by-lili-yan-ing-2025-07",
    "timestamp": "2025-07-21T11:45:44Z"
  },
  {
    "title": "A New ‘Infinite Money Glitch’ Is Coming For $4 Trillion Crypto As The Bitcoin Price Suddenly Soars",
    "description": "Companies are branching out from bitcoin to buy smaller cryptocurrencies, hoping to trigger what’s been called an “infinite money glitch\"...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/07/21/a-new-infinite-money-glitch-is-coming-for-4-trillion-crypto-as-the-bitcoin-price-suddenly-soars/",
    "timestamp": "2025-07-21T11:45:03Z"
  },
  {
    "title": "'Nutter' in White House is giving Laura Loomer Trump access despite dislike: biographer",
    "description": "Far-right conspiracy theorist Laura Loomer has managed to secure direct access to Donald Trump despite widespread efforts by his inner circle to freeze her out, according to a damning new account from Trump biographer Michael Wolff.And there's one person insi…",
    "link": "https://www.rawstory.com/loomer-trump-white-house/",
    "timestamp": "2025-07-21T11:44:12Z"
  },
  {
    "title": "US Turns To Social Media For News - But Fears Of Misinformation Rise",
    "description": "Traditional news media are losing influence in the U.S., with, for the first time, most people accessing news via social media and video networks.",
    "link": "https://www.forbes.com/sites/emmawoollacott/2025/07/21/us-turns-to-social-media-for-newsbut-fears-of-misinformation-rise/",
    "timestamp": "2025-07-21T11:43:49Z"
  },
  {
    "title": "LA Mayor Bass dodges question on whether all illegal immigrants in city should be allowed to stay",
    "description": "Los Angeles Mayor Karen Bass repeatedly dodged answering directly on whether all illegal immigrants in the sanctuary city should be allowed to stay.",
    "link": "https://nypost.com/2025/07/21/us-news/la-mayor-bass-dodges-key-question-on-illegal-immigrants/",
    "timestamp": "2025-07-21T11:39:53Z"
  },
  {
    "title": "Jones ‘Disappointed’ Over White House Snub",
    "description": "Jones is playing it cool after White said he’s not interested in ‘Bones’ fighting at the White House, but suggested he won’t compete again if it’s not at the historic event.",
    "link": "https://www.mmamania.com/2025/7/21/24471353/jon-jones-a-little-disappointed-after-dana-white-turns-down-white-house-fight-offer",
    "timestamp": "2025-07-21T11:39:17Z"
  },
  {
    "title": "The Epstein Files Hubbub",
    "description": "I have been away on vacation for the last week and a half, so I thought I would ease back into blogging with a light non-controversial topic – the Epstein Files. OK – let’s all take a collective deep breath. Everyone – and I mean everyone – I talk to about th…",
    "link": "https://theness.com/neurologicablog/the-epstein-files-hubbub/",
    "timestamp": "2025-07-21T11:37:40Z"
  },
  {
    "title": "Top U.N. Court to Reveal Penalties for Countries that Defy Climate Doomer Diktats",
    "description": "The International Court of Justice (ICJ) in The Hague on Wednesday will reveal a host of proposed penalties the U.N. can implement against countries that defy climate diktats.\nThe post Top U.N. Court to Reveal Penalties for Countries that Defy Climate Doomer …",
    "link": "https://www.breitbart.com/europe/2025/07/21/top-u-n-court-to-reveal-penalties-for-countries-that-defy-climate-doomer-diktats/",
    "timestamp": "2025-07-21T11:35:32Z"
  },
  {
    "title": "How Trump Killed Cancer Research (Wired)",
    "description": "Wired:\nHow Trump Killed Cancer Research  —  Attempting to eliminate funding for certain kinds of “woke” studies, the Trump administration erased hundreds of millions of dollars being used for cancer research.  —  When donald trump moved back into the White Ho…",
    "link": "https://www.memeorandum.com/250721/p15",
    "timestamp": "2025-07-21T11:35:00Z"
  },
  {
    "title": "Russia launches a major aerial attack on Kyiv hours before high-level talks on support for Ukraine",
    "description": "The escalation comes as the U.K. and Germany prepare to lead a NATO meeting on military support for Ukraine",
    "link": "https://www.bostonherald.com/2025/07/21/russia-major-aerial-attack-ukraine/",
    "timestamp": "2025-07-21T11:32:35Z"
  },
  {
    "title": "Transcript: Trump’s Vile New Colbert Smear Reveals Firing’s Darker Aim",
    "description": "The following is a lightly edited transcript of the July 21 episode of theDaily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.By now you’ve …",
    "link": "https://newrepublic.com/article/198151/transcript-trump-vile-new-colbert-smear-reveals-firing-darker-aim",
    "timestamp": "2025-07-21T11:32:17Z"
  },
  {
    "title": "Obama’s ODNI Scuttled Intelligence Briefing To Preserve Russia-Collusion Hoax",
    "description": "A top official in ODNI scuttled the release of an intelligence report that concluded Russian had not hacked the 2016 presidential election.",
    "link": "https://thefederalist.com/2025/07/21/obamas-odni-scuttled-intelligence-briefing-to-preserve-russia-collusion-hoax/",
    "timestamp": "2025-07-21T11:31:12Z"
  },
  {
    "title": "A $15 Billion Reason to Buy Nvidia Stock Here",
    "description": "The pending resumption of sales to China has emerged as a new driver for the chip major’s stock.",
    "link": "https://www.barchart.com/story/news/33527747/a-15-billion-reason-to-buy-nvidia-stock-here",
    "timestamp": "2025-07-21T11:30:02Z"
  },
  {
    "title": "A growing, forbidding visual rises in American life: law-enforcement officers in masks",
    "description": "Agents' faces are increasingly covered by caps, sunglasses and pulled-up neck gaiters or balaclavas, effectively rendering them unidentifiable.",
    "link": "https://roanoke.com/news/nation-world/crime-courts/article_7ead4bee-e13e-5f3a-af81-85fa9c88e020.html",
    "timestamp": "2025-07-21T11:30:00Z"
  },
  {
    "title": "Trump Officials to Visit Fed",
    "description": "“The Trump administration wants to visit the Federal Reserve this week to review its $2.5 billion renovation,“ Semafor reports. “President Donald Trump and his allies have identified the project as a potential opportunity to oust",
    "link": "https://politicalwire.com/2025/07/21/trump-officials-to-visit-fed/",
    "timestamp": "2025-07-21T11:29:36Z"
  },
  {
    "title": "SLB anticipates decrease in global upstream investment in 2025",
    "description": "The most significant reductions are expected in North and Latin America, resulting in a nearly 4% drop in the company's share price.",
    "link": "https://www.offshore-technology.com/news/slb-anticipates-decrease-global-upstream-investment-2025/",
    "timestamp": "2025-07-21T11:29:17Z"
  },
  {
    "title": "UK could be forced to step back on data surveillance demands",
    "description": "Never say never until the sing-song begins, but it looks very much like the UK government might have to step back on its plans to snoop on people’s data with all the enthusiasm of any other rogue government, as the Trump administration isn’t happy about those…",
    "link": "https://www.computerworld.com/article/4025653/uk-could-be-forced-to-step-back-on-data-surveillance-demands.html",
    "timestamp": "2025-07-21T11:27:29Z"
  },
  {
    "title": "From Long Flu to Long COVID: A Brief History of Postviral Illness | Think Global Health",
    "description": "Despite centuries of examples, long-term maladies after flu and other viruses remain absent from mainstream policy",
    "link": "https://www.thinkglobalhealth.org/article/long-flu-long-covid-brief-history-postviral-illness",
    "timestamp": "2025-07-21T11:27:00Z"
  },
  {
    "title": "US automakers exempted from fines for fuel efficiency non-compliance",
    "description": "The NHTSA has informed automakers that it is re-evaluating fuel economy regulations.",
    "link": "https://www.just-auto.com/news/us-fuel-efficiency-fines/",
    "timestamp": "2025-07-21T11:25:25Z"
  },
  {
    "title": "Trump's tariffs, agenda face skepticism as approval ratings dip",
    "description": "As President Donald Trump marked six months of his second term Sunday, his new tariffs, set to begin Aug. 1, are facing skepticism.",
    "link": "https://www.wmur.com/article/trumps-tariffs-agenda-face-skepticism-approval-ratings-dip/65461510",
    "timestamp": "2025-07-21T11:25:21Z"
  },
  {
    "title": "Leftists Can’t-Don’t-Won’t Ever Learn",
    "description": "Watching leftists endlessly promote the same catastrophic policies is tiresome. Some quotations come to mind: - \"“It isn't so much that liberals are ignorant. It's just that they know so many things that aren't so.” -- Ronald Reagan - “There are two ways to b…",
    "link": "https://freerepublic.com/focus/f-chat/4329856/posts",
    "timestamp": "2025-07-21T11:25:17Z"
  },
  {
    "title": "Iran will hold nuclear talks with European nations in Turkey, the first since ceasefire with Israel",
    "description": "The talks will be the first since a ceasefire was reached after a 12-day war waged by Israel against Iran in June.",
    "link": "https://www.bostonherald.com/2025/07/21/iran-eu-plan-nuclear-talks/",
    "timestamp": "2025-07-21T11:24:38Z"
  },
  {
    "title": "Trump Wins the Epstein Battle",
    "description": "<p>If you listened to the rest of the media &mdash; both mainstream and social media &mdash; you would think Donald Trump was on the skids, that MAGA was at last turning on the president over the so-called Epstei&hellip;</p>",
    "link": "https://www.realclearpolitics.com/2025/07/21/trump_wins_the_epstein_battle_650416.html",
    "timestamp": "2025-07-21T11:23:49Z"
  },
  {
    "title": "The pandemic drove up inflation. How come, years later, we're still paying more?",
    "description": "While inflation may have since been tamed, Statistics Canada’s monthly inflation figures show that the pandemic-era price hikes survived",
    "link": "https://nationalpost.com/news/politics/pandemic-drove-up-inflation-how-come-years-later-were-still-paying-more",
    "timestamp": "2025-07-21T11:23:38Z"
  },
  {
    "title": "Congo and critical minerals: What are the costs of America’s peace?",
    "description": "Is the U.S.-brokered peace agreement between Rwanda and the DRC a genuine path to sustainable peace, or a continuation of U.S. President Donald Trump’s coercive diplomacy?",
    "link": "https://theconversation.com/congo-and-critical-minerals-what-are-the-costs-of-americas-peace-260567",
    "timestamp": "2025-07-21T11:22:33Z"
  },
  {
    "title": "Republicans can't stop talking about Joe Biden. That may be a problem",
    "description": "It’s been six months since Joe Biden left the Oval Office.  The House has launched investigations asserting that Biden’s closest advisers covered up a...",
    "link": "https://www.yahoo.com/news/republicans-cant-stop-talking-joe-111053840.html",
    "timestamp": "2025-07-21T11:10:53Z"
  },
  {
    "title": "Rupert Murdoch, sued by Trump, owns some of world's biggest news outlets. You won't believe his net worth",
    "description": "Media giant Rupert Murdoch has been sued by US President Donald Trump over a Wall Street Journal report detailing a 2003 birthday letter allegedly written by Trump to Jeffrey Epstein. Rupert Murdoch owns Fox News, The Wall Street Journal, The New York Post, a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-rupert-murdoch-net-worth-rupert-murdoch-sued-by-trump-owns-some-of-worlds-biggest-news-outlets-you-wont-believe-his-net-worth/articleshow/122814427.cms",
    "timestamp": "2025-07-21T11:09:50Z"
  },
  {
    "title": "Trump’s Personal Lawyer Turned U.S. Attorney Has Prosecutors Running for the Exit",
    "description": "Federal prosecutors in New Jersey are reportedly desperate to be free of President Donald Trump’s former personal attorney and partisan sidekick, Alina Habba...",
    "link": "https://www.thedailybeast.com/trumps-personal-lawyer-turned-prosecutor-alina-habba-has-staff-running-for-the-exit/",
    "timestamp": "2025-07-21T11:06:20Z"
  },
  {
    "title": "This week's big questions: Can Trump finally quell the Epstein storm — and is it hurting his presidency? (Stephen Collinson/CNN)",
    "description": "Stephen Collinson / CNN:\nThis week's big questions: Can Trump finally quell the Epstein storm — and is it hurting his presidency?  —  Even President Donald Trump doesn't seem to think his angry and chaotic efforts to end the renewed storm over convicted sex o…",
    "link": "https://www.memeorandum.com/250721/p11",
    "timestamp": "2025-07-21T11:05:00Z"
  },
  {
    "title": "Kremlin Confirms No Changes to Russia’s Ukraine Negotiation Team",
    "description": "“There are no changes to the composition of the Russian delegation for the new round of talks with Ukraine,” Kremlin Spokesman Dmitry Peskov said.",
    "link": "https://sputnikglobe.com/20250721/kremlin-confirms-no-changes-to-russias-ukraine-negotiation-team-1122466755.html",
    "timestamp": "2025-07-21T11:04:48Z"
  },
  {
    "title": "Ex-Air Force chief reveals shocking retaliation as he defies Trump effort to silence him",
    "description": "The leader of President Joe Biden’s Air Force slammed the Donald Trump administration Monday after he found himself blackballed for speaking out.Frank Kendall wrote in the New York Times that he’d been told by organizations and law firms that they want nothin…",
    "link": "https://www.rawstory.com/trump-retribution-2673534432/",
    "timestamp": "2025-07-21T11:02:34Z"
  },
  {
    "title": "US hotels boost background checks as migrant scrutiny grows",
    "description": "NEW YORK -U.S. hotel hiring managers ordered more background checks in the first half of 2025 compared with the same period in 2024 amid growing scrutiny of foreign-born workers in the hospitality industry, according to a leading human resources and recruitme…",
    "link": "https://www.thestar.com.my/news/world/2025/07/21/us-hotels-boost-background-checks-as-migrant-scrutiny-grows",
    "timestamp": "2025-07-21T11:02:00Z"
  },
  {
    "title": "Will Trump's tariffs beat sanctions for 'America First?'",
    "description": "Donald Trump is betting that tariffs rather than sanctions will fix economic and geopolitical imbalances. But does the threat of rising US inflation and retaliation make sanctions a safer choice?",
    "link": "https://biztoc.com/x/228f097f0bbdf328",
    "timestamp": "2025-07-21T11:00:55Z"
  },
  {
    "title": "‘Imaginations go wild’: MAGA Epstein fury fuels antisemitic rants",
    "description": "The MAGA base may be tearing itself apart over the Trump administration’s attempt to close the book on the Jeffrey Epstein case, but some of the president’s conspiracy-minded supporters are still pouring gasoline on an ugly antisemitic trope long associated w…",
    "link": "https://www.rawstory.com/raw-investigates/israel-epstein/",
    "timestamp": "2025-07-21T11:00:01Z"
  },
  {
    "title": "How John Roberts Built the New American Presidency",
    "description": "The country is witnessing the creation of an all-powerful institution, and one man is responsible.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/07/supreme-court-roberts-trump-dictator/683576/",
    "timestamp": "2025-07-21T11:00:00Z"
  },
  {
    "title": "Ground Beef Prices Reach Record Highs as Warning Issued",
    "description": "As the country continues to grapple with shrinking herds, experts say prices could continue to rise through 2025 and beyond.",
    "link": "https://www.newsweek.com/ground-beef-prices-record-high-warnings-issued-2101604",
    "timestamp": "2025-07-21T10:59:01Z"
  },
  {
    "title": "Trump Envisions Jailing Obama",
    "description": "Tulsi Gabbard recently referred evidence supposedly showing Obama Administration officials conspiring to subvert Trump’s 2016 election victory and subsequent...",
    "link": "https://time.com/7303912/trump-obama-jail-tulsi-gabbard-russiagate-hoax-prosecutions-democrats-republicans/",
    "timestamp": "2025-07-21T10:58:26Z"
  },
  {
    "title": "Harvard Is Hoping Court Rules Trump Administration's Funding Cuts Were Illegal",
    "description": "The research funding is only one front in the Ivy League school's fight with the federal government.",
    "link": "https://www.huffpost.com/entry/trump-harvard-face-off-in-court_n_687e1963e4b06691ec24ff57",
    "timestamp": "2025-07-21T10:56:29Z"
  },
  {
    "title": "Links 7/21/2025",
    "description": "Our meditative daily links, including Epstein won't die, kid-friendly Grok, Japan elections, Boris Johnson is sad, and malls' second life.",
    "link": "https://www.nakedcapitalism.com/?p=295657",
    "timestamp": "2025-07-21T10:55:26Z"
  },
  {
    "title": "The Senate successors avoiding GOP primary drama and AI fueled job cuts: Morning Rundown",
    "description": "JD Vance and Marco Rubio's Senate successors are cruising to the primaries.",
    "link": "https://www.nbcnews.com/news/us-news/senate-successors-avoiding-gop-primary-drama-ai-fueled-job-cuts-mornin-rcna219922",
    "timestamp": "2025-07-21T10:54:33Z"
  },
  {
    "title": "Economists see slimmer chance of interest rate cuts in Canada this year",
    "description": "RBC and Scotiabank economists say the Bank of Canada will keep their benchmark rate at 2.75% through the end of 2025",
    "link": "https://financialpost.com/news/economists-rate-cuts-canada",
    "timestamp": "2025-07-21T10:51:59Z"
  },
  {
    "title": "EU explores plans as prospect of US tariff deal fades",
    "description": "The European Union is exploring a broader set of possible counter-measures against the United States as prospects for an acceptable trade agreement with Washington fade, according to EU diplomats.",
    "link": "https://www.rte.ie/news/world/2025/0721/1524523-eu-tariffs-us/",
    "timestamp": "2025-07-21T10:51:17Z"
  },
  {
    "title": "EU explores plans as prospect of US tariff deal fades",
    "description": "The European Union is exploring a broader set of possible counter-measures against the United States as prospects for an acceptable trade agreement with Washington fade, according to EU diplomats.",
    "link": "https://www.rte.ie/news/business/2025/0721/1524523-eu-tariffs-us/",
    "timestamp": "2025-07-21T10:51:17Z"
  },
  {
    "title": "EU readies for US trade fight as talks stall",
    "description": "The European Union is readying for a major trade confrontation with the US.\nA deal agreeing baseline tariffs of 10% had been expected, but US officials told the EU that President Donald Trump would demand more concessions.\nNow Germany, previously conciliatory…",
    "link": "https://biztoc.com/x/2afac58dc806a83d",
    "timestamp": "2025-07-21T10:49:59Z"
  },
  {
    "title": "SpaceX keeps NASA key contracts following Trump spat",
    "description": "The White House considered axing federal contracts for Elon Musk’s SpaceX after the billionaire’s dispute with US President Donald Trump, but found most were too important to cut.\nAdministration officials concluded the contracts were essential for the Departm…",
    "link": "https://biztoc.com/x/a618c4a69a794c88",
    "timestamp": "2025-07-21T10:49:50Z"
  },
  {
    "title": "Russia Touts Trump-Putin Meeting at Major Deadline",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Kremlin said Russian President Vladimir Putin could meet with U.S. President Donald Trump if the latter visits China in September.\nChina is due to hold a military parade in Beijing on September 3 to mark 8…",
    "link": "https://biztoc.com/x/87f86e98637731b2",
    "timestamp": "2025-07-21T10:49:30Z"
  },
  {
    "title": "U.S. stock futures rise as investors eye more earnings and tariff news",
    "description": "US stock futures rise, awaiting more earnings and tariff news. Magnificent 7 tech stocks start reporting this week. Stellantis reports tariff costs.",
    "link": "https://www.usatoday.com/story/money/markets/2025/07/21/us-stocks-monday-earnings-tariffs/85301871007/",
    "timestamp": "2025-07-21T10:49:18Z"
  },
  {
    "title": "Why writing off Apple’s Tim Cook could be a classic CEO succession mistake",
    "description": "Apple’s Tim Cook is facing similarly premature doubts that Goldman’s David Solomon battled years ago.",
    "link": "https://fortune.com/article/apple-tim-cook-ai-successor-ceo-goldman/",
    "timestamp": "2025-07-21T10:48:29Z"
  },
  {
    "title": "Nvidia's Huang says 'doing our best' to serve Chinese market",
    "description": "Beijing (AFP) July 16, 2025\n\n\n Nvidia CEO Jensen Huang said on Wednesday his firm was \"doing our best\" to serve China's vast market for semiconductors after it secured permission from the United States to sell chips to the world's second-largest economy. \n\nNv…",
    "link": "https://www.spacedaily.com/reports/Nvidias_Huang_says_doing_our_best_to_serve_Chinese_market_999.html",
    "timestamp": "2025-07-21T10:47:49Z"
  },
  {
    "title": "Morning Bid: Yen bounces as Japan PM hangs on",
    "description": "Japan's yen strengthened on Monday as embattled Prime Minister Shigeru Ishiba vowed to stay on as leader even after his ruling coalition lost its majority in...",
    "link": "https://finance.yahoo.com/news/morning-bid-yen-bounces-japan-104703006.html",
    "timestamp": "2025-07-21T10:47:03Z"
  },
  {
    "title": "MAGA’s tantrum over “woke” Superman is nastier than their usual whining",
    "description": "Lying about the character's legacy is part of the larger right-wing project to rewrite history",
    "link": "https://www.salon.com/2025/07/21/magas-tantrum-over-woke-superman-is-nastier-than-their-usual-whining/",
    "timestamp": "2025-07-21T10:45:45Z"
  },
  {
    "title": "Russia Touts Trump-Putin Meeting at Major Deadline",
    "description": "The meeting could take place in China—and would come at a key moment.",
    "link": "https://www.newsweek.com/russia-trump-putin-china-meeting-ukraine-war-2101633",
    "timestamp": "2025-07-21T10:44:58Z"
  },
  {
    "title": "US tariffs could cost Italy up to 0.8% of GDP, business lobby says",
    "description": "MILAN (Reuters) -U.S. tariffs of 30% on European Union goods could shave up to 0.8% off Italy's gross domestic product in 2027, the country's main business...",
    "link": "https://finance.yahoo.com/news/us-tariffs-could-cost-italy-104311551.html",
    "timestamp": "2025-07-21T10:43:11Z"
  },
  {
    "title": "US team to visit India in August for next round of talks for trade pact",
    "description": "The US team is set to visit India in August for further negotiations on the proposed bilateral trade agreement, following discussions in Washington. Both nations aim to finalize an interim trade deal before August 1, the deadline for suspended Trump tariffs. …",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/us-team-to-visit-india-in-august-for-next-round-of-talks-for-trade-pact/articleshow/122813875.cms",
    "timestamp": "2025-07-21T10:41:19Z"
  },
  {
    "title": "XRP leaves Bitcoin in the dust? Ripple hits all-time high against BTC in shocking surge",
    "description": "XRP price hits all-time high – Ripple just shocked the crypto world! XRP skyrocketed past its 2018 high, hitting $3.70, as daily volume on the XRP Ledger surged 50% to $1.4 billion. With a golden cross, bullish signals, and talk of hitting $10 soon, XRP could…",
    "link": "https://economictimes.indiatimes.com/news/international/us/xrp-leaves-bitcoin-in-the-dust-ripple-hits-all-time-high-against-btc-in-shocking-surge/articleshow/122813492.cms",
    "timestamp": "2025-07-21T10:40:29Z"
  },
  {
    "title": "Democrats Aim to Close the ‘Attention Gap’",
    "description": "Playbook: “Today, President Donald Trump faces the dawning reality that one of the very factors that helped fuel his rise to political power now threatens it like never before: the attention economy.” “And it’s not",
    "link": "https://politicalwire.com/2025/07/21/democrats-aim-to-close-the-attention-gap/",
    "timestamp": "2025-07-21T10:39:18Z"
  },
  {
    "title": "EU is racing to secure U.S. trade deal and preparing for the worst",
    "description": "European Union and US negotiators are heading into another week of intensive talks, as they seek to clinch a trade deal by Aug. 1, when US President Donald Trump has threatened to hit most EU exports with 30% tariffs.\nOfficials in Brussels are prepared to sto…",
    "link": "https://biztoc.com/x/62a970e3265eca7e",
    "timestamp": "2025-07-21T10:38:15Z"
  },
  {
    "title": "Are Trump’s tariffs the new sanctions?",
    "description": "Donald Trump is betting that tariffs rather than sanctions will fix economic and geopolitical imbalances. But does the threat of rising US inflation and retaliation make sanctions a safer choice?",
    "link": "https://www.dw.com/en/are-trumps-tariffs-the-new-sanctions/a-73280374",
    "timestamp": "2025-07-21T10:36:00Z"
  },
  {
    "title": "Will Trump's tariffs beat sanctions for 'America First?'",
    "description": "Donald Trump is betting that tariffs rather than sanctions will fix economic and geopolitical imbalances. But does the threat of rising US inflation and retaliation make sanctions a safer choice?",
    "link": "https://www.dw.com/en/will-trumps-tariffs-beat-sanctions-for-america-first/a-73280374",
    "timestamp": "2025-07-21T10:36:00Z"
  },
  {
    "title": "Trump administration takes all-of-government approach to target transgender community | CNN",
    "description": "Part of the nation’s suicide and crisis hotline that was specifically aimed at helping LGBTQ+ youth was shut down this week, the latest action by the Trump administration to limit the LGBTQ+ community’s access to government services – but experts say it won’t…",
    "link": "https://www.cnn.com/2025/07/21/health/trans-community-trump-all-of-government",
    "timestamp": "2025-07-21T10:34:50Z"
  },
  {
    "title": "EU is racing to secure U.S. trade deal and preparing for the worst",
    "description": "Brussels is ready to accept a U.S.-favored deal to break the deadlock, but a breakthrough remains elusive.",
    "link": "https://fortune.com/europe/2025/07/21/eu-racing-to-secure-us-trade-deal-preparing-for-the-worst-donald-trump-tariffs/",
    "timestamp": "2025-07-21T10:32:05Z"
  },
  {
    "title": "Trump blames Epstein files on Democrats and Comey but the timeline tells a different story",
    "description": "Facing backlash from his base over his administration’s handling of the Epstein files, President Donald Trump shifted blame to his Democratic predecessors. Trump’s Justice Department on July 7 announced it would not […]\nThe post Trump blames Epstein files on …",
    "link": "https://www.poynter.org/fact-checking/2025/who-created-the-epstein-files-trump-claim/",
    "timestamp": "2025-07-21T10:30:22Z"
  },
  {
    "title": "Wall St futures rise on trade hope; earnings kick into high gear",
    "description": "Futures tracking the S&P 500 rose 16.5 points, or 0.26% at 5:51 a.m. ET, and Nasdaq 100 e-minis climbed 65 points, or 0.28%, hovering near all-time highs hit...",
    "link": "https://finance.yahoo.com/news/wall-st-futures-rise-trade-102811299.html",
    "timestamp": "2025-07-21T10:28:11Z"
  },
  {
    "title": "How QAnon finally went mainstream",
    "description": "By Art Jipson, University of DaytonThe Justice Department asked a federal court on July 18, 2025, to unseal grand jury transcripts in Jeffrey Epstein’s case. The direction from President Donald Trump came after weeks of frustration among some far-right groups…",
    "link": "https://www.rawstory.com/how-the-qanon-movement-entered-mainstream-politics-and-why-the-silence-on-epstein-files/",
    "timestamp": "2025-07-21T10:27:29Z"
  },
  {
    "title": "Crypto-linked stocks rising following Trump’s stablecoin law signing",
    "description": "Shares of crypto-linked companies jumped on Monday, as ether prices advanced after President Donald Trump signed into law a bill regulating stablecoins in the U.S.\nTrump signed the GENIUS Act late on Friday, marking a huge win for crypto supporters, who have …",
    "link": "https://biztoc.com/x/b2974d641f393b68",
    "timestamp": "2025-07-21T10:27:20Z"
  },
  {
    "title": "Kremlin: Trump, Putin could meet in September",
    "description": "Kremlin Press Secretary Dmitry Peskov announced on Monday that there is a possibility that the presidents of Russia and the United States, Vladimir Putin and Donald Trump, respectively, will meet in B...",
    "link": "https://biztoc.com/x/ee8acb0e50d131fc",
    "timestamp": "2025-07-21T10:27:19Z"
  },
  {
    "title": "Musk's X accuses French prosecutors of 'politically motivated' probe",
    "description": "Elon Musk’s platform X claims a French criminal probe into algorithmic bias and data misuse is politically motivated and threatens free speech. X refuses to cooperate, citing legal rights. The investigation, backed by lawmaker Eric Bothorel, deepens tensions …",
    "link": "https://economictimes.indiatimes.com/tech/technology/musks-x-accuses-french-prosecutors-of-politically-motivated-probe/articleshow/122813538.cms",
    "timestamp": "2025-07-21T10:27:05Z"
  },
  {
    "title": "Block jumps after S&P 500 inclusion in new milestone for fintech",
    "description": "Tech billionaire Jack Dorsey-led Block's shares rose nearly 10 per cent before the bell on Monday after the payments firm was added to the benchmark S&P 500, marking a milestone for the fintech sector.The inclusion cements Block's status as one of the most va…",
    "link": "https://www.channelnewsasia.com/business/block-jumps-after-sp-500-inclusion-in-new-milestone-fintech-5249541",
    "timestamp": "2025-07-21T10:23:21Z"
  },
  {
    "title": "Block jumps after S&P 500 inclusion in new milestone for fintech",
    "description": "The inclusion cements Block's status as one of the most valuable and influential players in the fintech space, and shows how digital payments and financial...",
    "link": "https://finance.yahoo.com/news/block-jumps-p-500-inclusion-102321404.html",
    "timestamp": "2025-07-21T10:23:21Z"
  },
  {
    "title": "Bessent Made Case Against Firing Powell, Report Says",
    "description": "9 min ago\nBessent Made Case Against Firing Powell, Report Says\nPresident Donald Trump stepped up his attacks on Jerome Powell last week–but Treasury Secretary Scott Bessent came to the Federal Reserve chair's defense, The Wall Street Journal reported.\nBessent…",
    "link": "https://biztoc.com/x/d8029a227ca456b1",
    "timestamp": "2025-07-21T10:16:40Z"
  },
  {
    "title": "James Comey Breaks Silence After DOJ Fires Daughter: 'Grave Danger'",
    "description": "Federal prosecutor Maurene Comey was fired by the Justice Department on Wednesday.",
    "link": "https://www.newsweek.com/james-comey-maurene-doj-firing-epstein-2101580",
    "timestamp": "2025-07-21T10:15:20Z"
  },
  {
    "title": "Trump says Beijing is making ‘big steps’ in controlling fentanyl",
    "description": "The US president struck a different tone after previously using issue to justify tariffs on imports from China Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/07/21/trump-says-beijing-is-making-big-steps-in-controlling-fentanyl",
    "timestamp": "2025-07-21T10:15:00Z"
  },
  {
    "title": "Car maker Stellantis says US tariffs have cost it €300m",
    "description": "The company behind the brands Vauxhall, Jeep and Fiat says Trump's 25% tariff on cars has hit trade.",
    "link": "https://www.bbc.com/news/articles/c4gd1rdp45go",
    "timestamp": "2025-07-21T10:12:56Z"
  },
  {
    "title": "Russia strikes Ukraine after Kiev offers fresh talks",
    "description": "Russia fired a volley of drones and missiles at Ukraine early Monday, hitting apartment blocks and a nursery in Kiev, days after Ukrainian President Volodymyr Zelensky proposed holding a fresh round of peace talks.",
    "link": "https://www.hurriyetdailynews.com/russia-strikes-ukraine-after-kiev-offers-fresh-talks-211696",
    "timestamp": "2025-07-21T10:12:00Z"
  },
  {
    "title": "Trump Says Adam Schiff in ‘BIG TROUBLE’ — as He Ties Senator to Vendetta Against Son Don Jr.",
    "description": "Trump launched another blistering attack on Schiff, demanding the lawmaker be jailed over alleged mortgage fraud and revealed a Don Jr. vendetta.\nThe post Trump Says Adam Schiff in ‘BIG TROUBLE’ — as He Ties Senator to Vendetta Against Son Don Jr. first appea…",
    "link": "https://www.mediaite.com/media/news/trump-says-adam-schiff-in-big-trouble-as-he-ties-senator-to-vendetta-against-son-don-jr/",
    "timestamp": "2025-07-21T10:11:19Z"
  },
  {
    "title": "Health care experts: Medicaid cuts threaten Pennsylvania's nursing home industry",
    "description": "Zach Shamberg fears federal Medicaid adjustments approved in President Donald Trump&rsquo;s &ldquo;One Big Beautiful Bill&rdquo; will worsen a nursing home climate already strained by insufficient care reimbursements and staffing challenges. Shamberg, preside…",
    "link": "https://triblive.com/local/westmoreland/health-care-experts-medicaid-cuts-threaten-pennsylvanias-nursing-home-industry/",
    "timestamp": "2025-07-21T10:08:56Z"
  },
  {
    "title": "Israel Tries to Stop Actual Genocide in Syria While Being Falsely Accused of Genocide in Gaza",
    "description": "Israel continues to try to stop the potential genocide of Druze Arabs in Syria by Islamic forces, while being falsely accused of genocide against Palestinian Arabs in Gaza.\nThe post Israel Tries to Stop Actual Genocide in Syria While Being Falsely Accused of …",
    "link": "https://www.breitbart.com/middle-east/2025/07/21/israel-tries-to-stop-actual-genocide-in-syria-while-being-falsely-accused-of-genocide-in-gaza/",
    "timestamp": "2025-07-21T10:08:36Z"
  },
  {
    "title": "Trump tariffs help push Jeep owner Stellantis into massive $2.7 billion loss",
    "description": "The €2.3-billion ($2.7-billion) net loss in the first half of the year came as sales in North America continued to slump, down 25% by volume in the second quarter year-on-year.",
    "link": "https://fortune.com/europe/2025/07/21/trump-tariffs-help-push-jeep-owner-stellantis-2-7-billion-loss/",
    "timestamp": "2025-07-21T10:07:47Z"
  },
  {
    "title": "Stocks Set to Open Higher as Investors Await U.S. Economic Data and Tech Earnings, Trade Talks in Focus",
    "description": "September S&P 500 E-Mini futures (ESU25) are up +0.27%, and September Nasdaq 100 E-Mini futures (NQU25) are up +0.28% this morning, pointing to a higher open...",
    "link": "https://www.barchart.com/story/news/33526201/stocks-set-to-open-higher-as-investors-await-u-s-economic-data-and-tech-earnings-trade-talks-in-focus",
    "timestamp": "2025-07-21T10:05:46Z"
  },
  {
    "title": "Six Months In, Trump Has Too Many Failures To Count | Opinion",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSix months into the second Trump administration, not only is the president's agenda failing on its own terms—we have already witnessed a series of policy fiascos that would have completely upended any pre-Trum…",
    "link": "https://biztoc.com/x/164a7be62a94bf55",
    "timestamp": "2025-07-21T10:05:39Z"
  },
  {
    "title": "Trump admin may inspect Fed renovation this week",
    "description": "United States President Donald Trump's administration is planning to visit the Federal Reserve headquarters this week as part of its review into the building's $2.5 billion renovation, Semafor reporte...",
    "link": "https://biztoc.com/x/8f42dfac66086dc0",
    "timestamp": "2025-07-21T10:05:27Z"
  },
  {
    "title": "Trump officials to visit Fed amid renovation probe",
    "description": "The Trump administration wants to visit the Federal Reserve this week to review its $2.5 billion renovation, according to White House deputy chief of staff James Blair.\nSenate Banking Chair Tim Scott is in talks to attend as well, a person familiar with the p…",
    "link": "https://biztoc.com/x/ae55720b8e2888c6",
    "timestamp": "2025-07-21T10:05:21Z"
  },
  {
    "title": "Stellantis expects €2.3 billion H1 loss due to US tariffs",
    "description": "Stellantis said today it expected the hit from restructuring costs and the initial impact of US tariffs to have pushed the carmaker to a €2.3 billion loss in the first half of the year.",
    "link": "https://www.rte.ie/news/business/2025/0721/1524518-stellantis-profit-outlook/",
    "timestamp": "2025-07-21T10:04:33Z"
  }
]