[
  {
    "title": "Elon Musk’s costly gamble on Wisconsin’s Supreme Court backfires as voters hand him an embarrassing political defeat",
    "description": "Susan Crawford secured a seat in the Wisconsin Supreme Court, maintaining the liberal majority and defeating Elon Musk's heavily funded campaign against her. Musk's involvement, including significant financial contributions and public support for Brad Schimel…",
    "link": "https://economictimes.indiatimes.com/news/international/us/elon-musks-costly-gamble-on-wisconsins-supreme-court-backfires-as-voters-hand-him-an-embarrassing-political-defeat/articleshow/119907698.cms",
    "timestamp": "2025-04-02T12:30:19Z"
  },
  {
    "title": "So long, Strom: Cory Booker breaks Thurmond's Senate record with 25-hour speech (Jordain Carney/Politico)",
    "description": "Jordain Carney / Politico:\nSo long, Strom: Cory Booker breaks Thurmond's Senate record with 25-hour speech  —  The New Jersey Democrat has held the floor since Monday night in protest of President Donald Trump.  —  Cory Booker wrote himself into the Senate an…",
    "link": "https://www.memeorandum.com/250402/p25",
    "timestamp": "2025-04-02T12:30:06Z"
  },
  {
    "title": "Trump Attorney Studied Options for Third Presidential Term (Wall Street Journal)",
    "description": "Wall Street Journal:\nTrump Attorney Studied Options for Third Presidential Term  —  The president's recent comments have rattled some Republicans  —  WASHINGTON—Donald Trump's attorney Boris Epshteyn made a bold assertion during a meeting in late 2023: Trump …",
    "link": "https://www.memeorandum.com/250402/p27",
    "timestamp": "2025-04-02T12:30:06Z"
  },
  {
    "title": "Trump Tariff Plans Still in Limbo Ahead of Rose Garden Event (Bloomberg)",
    "description": "Bloomberg:\nTrump Tariff Plans Still in Limbo Ahead of Rose Garden Event  —  President Donald Trump's deliberations over his plans to impose reciprocal tariffs are coming down to the wire, with his team said to be still finalizing the level and scope of new im…",
    "link": "https://www.memeorandum.com/250402/p26",
    "timestamp": "2025-04-02T12:30:06Z"
  },
  {
    "title": "Naval Academy removes nearly 400 books from library as Hegseth orders new DEI purge",
    "description": "It's another step in the Trump administration’s effort to eliminate diversity, equity and inclusion content from federal agencies.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_282879d1-c1c3-59cd-a235-33c368ecd7ae.html",
    "timestamp": "2025-04-02T12:30:00Z"
  },
  {
    "title": "Rangers vs. Reds prediction: Bet on Jack Leiter to win second straight",
    "description": "Rescued! Stuck in space for nine months after their ride home failed, NASA astronauts Suni Williams and Butch Wilmore finally returned home last week. But after sitting in on New Jersey Sen. Cory Booker’s marathon speech, Butch and Suni requested a return to …",
    "link": "https://nypost.com/2025/04/02/betting/rangers-vs-reds-prediction-bet-on-jack-leiter-to-win-second-straight/",
    "timestamp": "2025-04-02T12:30:00Z"
  },
  {
    "title": "'Image Whisperers' Bring Vision To The Blind At Red Cross Museum",
    "description": "\"They are our eyes,\" said Karin happily after releasing the arm of one of the specialised \"image whisperers\" guiding her and other blind people around Geneva's Red Cross museum.",
    "link": "https://www.ibtimes.com.au/image-whisperers-bring-vision-blind-red-cross-museum-1857497",
    "timestamp": "2025-04-02T12:29:54Z"
  },
  {
    "title": "Tesla Sales Tumble In Europe In The First Quarter",
    "description": "Tesla sales kept falling in March in many European markets as it suffered from a double blow of boycotts against the policies of its founder Elon Musk and an ageing model line-up.",
    "link": "https://www.ibtimes.com.au/tesla-sales-tumble-europe-first-quarter-1857495",
    "timestamp": "2025-04-02T12:29:51Z"
  },
  {
    "title": "Stock Markets Mixed As Uncertainty Rules Ahead Of Trump Tariffs",
    "description": "Stock markets diverged Wednesday as investors fretted over what shape US President Donald Trump's fresh wave of tariffs would take later in the day.",
    "link": "https://www.ibtimes.com.au/stock-markets-mixed-uncertainty-rules-ahead-trump-tariffs-1857493",
    "timestamp": "2025-04-02T12:29:49Z"
  },
  {
    "title": "Trump warned: 'The MAGA majority may have a shorter run than advertised'",
    "description": "Following the release of Tuesday's election results that showed Republicans holding House seats by far narrower margins than usual and a high-profile Wisconsin Supreme Court seat won by a liberal in a resounding defeat for conservatives, the Wall Street Journ…",
    "link": "https://www.rawstory.com/trump-maga-backlash/",
    "timestamp": "2025-04-02T12:29:25Z"
  },
  {
    "title": "‘Europe’s Detroit’ is expected to suffer the most from Trump’s auto tariffs",
    "description": "U.S. President Donald Trump's tariffs on auto imports is expected to hit hard for car brands and countries around the world, with economists warning a small landlocked nation in Europe could feel the worst of the impact.\nTrump is poised to unveil the details …",
    "link": "https://biztoc.com/x/d77d3755fd9b6b6a",
    "timestamp": "2025-04-02T12:29:07Z"
  },
  {
    "title": "Fact Check: Is Donald Trump Ending Dual Citizenship?",
    "description": "Posts claiming that President Donald Trump had pledged to end dual citizenship are circulating on social media.",
    "link": "https://biztoc.com/x/1f16ca32d3a93568",
    "timestamp": "2025-04-02T12:28:56Z"
  },
  {
    "title": "State of economywide tariffs on Canada unclear as Trump’s global trade war escalates",
    "description": "WASHINGTON — As U.S. President Donald Trump prepares to unveil his so-called “liberation day” plan to hit multiple countries with tariffs, it’s still not clear whether a temporary pause on separate economywide duties on Canada will be lifted. In early March, …",
    "link": "https://financialpost.com/pmn/state-of-economywide-tariffs-on-canada-unclear-as-trumps-global-trade-war-escalates",
    "timestamp": "2025-04-02T12:28:52Z"
  },
  {
    "title": "California Snowpack at Healthiest 3-Year Stretch in 25 Years After Wet Winters",
    "description": "California's snowpack in the Sierra Nevada mountains is at 96% of the historical average for April 1st, the official date when the measurement is made, marking the highest 3-year average in the last 25 years, a good sign for water supply.\nThe post California …",
    "link": "https://www.breitbart.com/environment/2025/04/02/california-snowpack-at-healthiest-3-year-stretch-in-25-years-after-wet-winters/",
    "timestamp": "2025-04-02T12:28:06Z"
  },
  {
    "title": "US Approves $5.58 Bn Fighter Jet Sale To Philippines",
    "description": "The United States said Tuesday it has approved the possible sale of $5.58 billion in F-16 fighter jets to the Philippines, as Washington backs its ally in rising tensions over China.",
    "link": "https://www.ibtimes.com.au/us-approves-558-bn-fighter-jet-sale-philippines-1857491",
    "timestamp": "2025-04-02T12:27:06Z"
  },
  {
    "title": "Rubio Heads To Europe As Transatlantic Tensions Soar",
    "description": "US Secretary of State Marco Rubio heads Wednesday to a NATO meeting in Europe as transatlantic tensions soar, with President Donald Trump slapping tariffs on Europeans and challenging Denmark's sovereignty over Greenland.",
    "link": "https://www.ibtimes.com.au/rubio-heads-europe-transatlantic-tensions-soar-1857490",
    "timestamp": "2025-04-02T12:27:03Z"
  },
  {
    "title": "WHO Facing $2.5-bn Gap Even After Slashing Budget: Report",
    "description": "The World Health Organization is facing a gaping deficit this year and through 2027 following the US decision to withdraw, even after dramatically slashing its budget, a media report indicated Wednesday.",
    "link": "https://www.ibtimes.com.au/who-facing-25-bn-gap-even-after-slashing-budget-report-1857488",
    "timestamp": "2025-04-02T12:26:58Z"
  },
  {
    "title": "Khaled Sabsabi Says Australian Pavilion Cancelation Is ‘Dismantling’ His Career, Trump Portrait Smuggled into Louvre, and More: Morning Links for April 2, 2025",
    "description": "Khaled Sabsabi addressed his Venice Biennale pavilion's cancelation, a Trump portrait was smuggled into the Louvre, and more global art news.",
    "link": "https://www.artnews.com/art-news/news/khaled-sabsabi-venice-cancelation-trump-louvre-morning-links-1234737585/",
    "timestamp": "2025-04-02T12:26:45Z"
  },
  {
    "title": "Fact Check: Is Donald Trump Ending Dual Citizenship?",
    "description": "Posts claiming that President Donald Trump had pledged to end dual citizenship are circulating on social media.",
    "link": "https://www.newsweek.com/fact-check-donald-trump-ending-dual-citizenship-2054050",
    "timestamp": "2025-04-02T12:25:53Z"
  },
  {
    "title": "‘Basking in Glee!’ CNN’s Bakari Sellers Does Victory Dance on ‘Repudiation’ of Trump in Judicial Election",
    "description": "Bakari Sellers took a victory lap over a key judicial election that he said was a \"repudiation\" of President Donald Trump.\nThe post ‘Basking in Glee!’ CNN’s Bakari Sellers Does Victory Dance on ‘Repudiation’ of Trump in Judicial Election first appeared on Med…",
    "link": "https://www.mediaite.com/tv/basking-in-glee-cnns-bakari-sellers-does-victory-dance-on-repudiation-of-trump-in-judicial-election/",
    "timestamp": "2025-04-02T12:22:44Z"
  },
  {
    "title": "Trump Just Pardoned ... a Corporation?",
    "description": "In what may be an American first, President Donald Trump pardoned to a company sentenced to $100 million in fines for breaking money laundering laws.\nThe post Trump Just Pardoned … a Corporation? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/04/02/trump-pardons-corporation-bitmex-crypto/",
    "timestamp": "2025-04-02T12:21:52Z"
  },
  {
    "title": "Shipping Firm Maersk Expects Continued US Growth But Warns of Rising Uncertainty",
    "description": "By Stine Jacobsen COPENHAGEN, April 2 (Reuters) – Danish shipping company Maersk has benefited from robust U.S. demand so far this year and expects that to continue, though the outlook could be clouded by U.S....",
    "link": "https://gcaptain.com/shipping-firm-maersk-expects-continued-us-growth-but-warns-of-rising-uncertainty/",
    "timestamp": "2025-04-02T12:21:27Z"
  },
  {
    "title": "6 populist leaders facing lawfare around world",
    "description": "European governments have once again struck out at populist leaders on the continent by banning Marine Le Pen from running in the French presidential election in 2027.",
    "link": "https://www.foxnews.com/politics/6-populist-leaders-facing-lawfare-around-world",
    "timestamp": "2025-04-02T12:21:01Z"
  },
  {
    "title": "Trump Names 'MAGA Muslim' Bill Essayli as U.S. Attorney in Los Angeles",
    "description": "President Donald Trump has appointed California State Assemblyman Bill Essayli (R-Corona) as U.S. Attorney in Los Angeles, elevating the \"MAGA Muslim\" conservative to one of the most powerful prosecutorial posts in the nation.\nThe post Trump Names ‘MAGA Musli…",
    "link": "https://www.breitbart.com/politics/2025/04/02/trump-names-maga-muslim-bill-essayli-as-u-s-attorney-in-los-angeles/",
    "timestamp": "2025-04-02T12:19:31Z"
  },
  {
    "title": "Tariff-battered U.S. farmers are getting exactly what they deserve: ex-GOP insider",
    "description": "David Frum, a former speechwriter for President George W. Bush, believes that American farmers are getting exactly what they deserve if they find themselves getting hurt by President Donald Trump's trade wars.Writing in The Atlantic, Frum breaks down all the …",
    "link": "https://www.rawstory.com/trump-tariffs-farmers-2671659453/",
    "timestamp": "2025-04-02T12:19:18Z"
  },
  {
    "title": "Investors Can't Get Enough Of These 7 Trump-Proof Dividend Stocks",
    "description": "Investors nervous about President Donald Trump's tariffs have one thing on their minds: S&P 500 dividends.\nThe safety and security of dividends are winning investors over — as the rest of the S&P 500 suffers amid Trump's tariffs. Six of the top 10 performing …",
    "link": "https://biztoc.com/x/0ecf15fce40c9afd",
    "timestamp": "2025-04-02T12:18:34Z"
  },
  {
    "title": "Recession coming soon? As Donald Trump unleashes April 2 'Liberation Day' Tariffs, here's what experts are predicting",
    "description": "Donald Trump's already announced auto tariffs of 25 per cent are due to come into effect on April 3.",
    "link": "https://economictimes.indiatimes.com/news/international/us/recession-coming-soon-as-donald-trump-unleashes-april-2-liberation-day-tariffs-heres-what-experts-are-predicting/articleshow/119907303.cms",
    "timestamp": "2025-04-02T12:17:21Z"
  },
  {
    "title": "Brussels leaves timeline for EU’s tariff retaliation open, rejecting French comments",
    "description": "The European Commission again urged Trump to \"avoid the inevitable pain\" that his tariffs will cause in both the US and the EU.",
    "link": "https://www.euractiv.com/section/economy-jobs/news/brussels-leaves-timeline-for-eus-tariff-retaliation-open-rejecting-french-comments/",
    "timestamp": "2025-04-02T12:16:55Z"
  },
  {
    "title": "'Wisconsin beat the billionaire': Liberal judge wins Supreme Court race against Musk-backed contender",
    "description": "Elon Musk spent almost $25 million in the race supporting conservative candidate Brad Schimel.",
    "link": "https://www.thejournal.ie/wisconsin-supreme-court-race-elon-musk-candidate-6665840-Apr2025/",
    "timestamp": "2025-04-02T12:16:48Z"
  },
  {
    "title": "Why Lebanon is Valuable to an America-First Foreign Policy",
    "description": "At the end of the former’s administration, US President Joe Biden and then-President-Elect Donald Trump worked together to end the Israel–Hezbollah war in Lebanon, setting the country on a path toward recovery.  Trump’s allies need to understand what Trump’s …",
    "link": "https://www.fairobserver.com/world-news/us-news/why-lebanon-is-valuable-to-an-america-first-foreign-policy/",
    "timestamp": "2025-04-02T12:16:33Z"
  },
  {
    "title": "Private companies added 155,000 jobs in March, more than expected, ADP says",
    "description": "Payroll gains were stronger than expected in March, countering fears that the labor market and economy are slowing.",
    "link": "https://www.cnbc.com/2025/04/02/adp-jobs-report-march-2025-.html",
    "timestamp": "2025-04-02T12:15:13Z"
  },
  {
    "title": "Elon Musk Fails in Attempt to Buy Wisconsin Supreme Court as Judge Susan Crawford Beats Brad Schimel",
    "description": "We go to Madison, Wisconsin, to speak with The Nation's John Nichols about Tuesday's pivotal state Supreme Court election, in which liberal Judge Susan Crawford convincingly defeated conservative candidate Brad Schimel. Crawford’s election is a major victory …",
    "link": "https://www.democracynow.org/2025/4/2/wisconsin_supreme_court_susan_crawford",
    "timestamp": "2025-04-02T12:15:10Z"
  },
  {
    "title": "Obama ‘Worked Behind the Scenes’ to Derail Kamala Harris’ 2024 Candidacy: Report",
    "description": "Former President Barack Obama “did not have faith” that Democratic presidential candidate Kamala Harris could defeat Donald Trump in the 2024 election and actively “worked behind the scenes” to try and set up a “mini-primary” after then-President Joe Biden dr…",
    "link": "https://www.mediaite.com/tv/obama-worked-behind-the-scenes-to-derail-kamala-harris-2024-candidacy-report/",
    "timestamp": "2025-04-02T12:13:22Z"
  },
  {
    "title": "California legislators reject two ‘cruel’ bills aimed at banning trans women from female sports",
    "description": "Two separate California anti-trans bills, which aimed to keep transgender athletes out of sports teams consistent with their gender identity, have failed to move forward. Both bills, AB-844 and AB-89 would have required that participation in sex-segregated Ca…",
    "link": "https://www.thepinknews.com/2025/04/02/california-transgender-bill/",
    "timestamp": "2025-04-02T12:12:46Z"
  },
  {
    "title": "Which States Have Voter ID? Wisconsin Approves Referendum",
    "description": "Voter ID laws seem to be popular, as 77 percent of likely U.S. voters supported photo ID requirements, according a poll.",
    "link": "https://www.newsweek.com/which-states-have-voter-id-2054037",
    "timestamp": "2025-04-02T12:09:06Z"
  },
  {
    "title": "Stock market futures slip ahead of Trump's 'Liberation Day' tariffs",
    "description": "Trump is expected to announce the measures after markets close on Wednesday.",
    "link": "https://abcnews.go.com/Business/stock-market-futures-slip-ahead-trumps-liberation-day/story?id=120404390",
    "timestamp": "2025-04-02T12:08:31Z"
  },
  {
    "title": "Dirty 15: These countries may face the wrath of Donald Trump's tariffs; here's what could happen next",
    "description": "US President Donald Trump plans to introduce significant changes in trade policy with \"reciprocal tariffs\" targeting countries with high tariffs on US goods. Set to be announced on April 2, the policy could affect up to 15 nations including China, the EU, and…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dirty-15-these-countries-may-face-the-wrath-of-donald-trumps-tariffs-heres-what-could-happen-next/articleshow/119906308.cms",
    "timestamp": "2025-04-02T12:07:00Z"
  },
  {
    "title": "Posthaste: U.S. 'unreliable to point of hostility' with Canada especially at risk, report warns",
    "description": "The United States is “unreliable to the point of hostility” and Canada, in particular, can no longer depend on its neighbour to respect agreements and come to our defence, a new report from top business leaders warns.\n“The United States, under President Donal…",
    "link": "https://biztoc.com/x/18b6d2fa8cf5a297",
    "timestamp": "2025-04-02T12:06:59Z"
  },
  {
    "title": "Capitol agenda: Trump's tariff test",
    "description": "At least three Senate Republicans are poised to mark President Donald Trump’s “Liberation Day” escalation of his trade war by formally rebuking a key piece of his tariff strategy. Trump is fighting back. \nSen. Lisa Murkowski revealed Tuesday that she will vot…",
    "link": "https://biztoc.com/x/b1d18c62a6693cf8",
    "timestamp": "2025-04-02T12:06:57Z"
  },
  {
    "title": "Trump is set to announce ‘reciprocal’ tariffs in a risky move that could reshape the economy",
    "description": "By JOSH BOAK, Associated Press\nWASHINGTON (AP) — After weeks of White House hype and public anxiety, President Donald Trump is set Wednesday to announce a barrage of self-described reciprocal tariffs on friend and foe alike.\nThe new tariffs, coming on what Tr…",
    "link": "https://biztoc.com/x/ec98217ba44fe209",
    "timestamp": "2025-04-02T12:06:36Z"
  },
  {
    "title": "Trump Fan May Join Bid For TikTok After White House ‘Invite’",
    "description": "Top US officials are due to meet with US President Donald Trump later today (April 2) to make decisions on the future of TikTok’s operations in America.\nTrump will talk with aides about bids by groups of American investors that want to buy the US unit of the …",
    "link": "https://biztoc.com/x/04763a52002340a4",
    "timestamp": "2025-04-02T12:06:26Z"
  },
  {
    "title": "'Liberation Day' has arrived — and Americans are already feeling the pain",
    "description": "Trump previously warned that the US would feel \"some pain\" with tariffs. That pain is already here.",
    "link": "https://www.businessinsider.com/liberation-day-tariffs-us-trading-partners-economy-stocks-markets-options-2025-4",
    "timestamp": "2025-04-02T12:06:07Z"
  },
  {
    "title": "Forbes Daily: The New Billionaires Who Built Chicken Finger Fortunes",
    "description": "Today’s Forbes Daily newsletter covers Cory Booker's historic speech, Tesla's upcoming vehicle delivery report, Newsmax continues its wild ride and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/04/02/forbes-daily-the-new-billionaires-who-built-chicken-finger-fortunes/",
    "timestamp": "2025-04-02T12:05:54Z"
  },
  {
    "title": "Unemployment rises slightly to 4% in March",
    "description": "Labour market remains near full employment despite “significant nervousness” of tariffs.",
    "link": "https://www.irishtimes.com/business/2025/04/02/unemployment-rises-slightly-to-4-in-march/",
    "timestamp": "2025-04-02T12:03:27Z"
  },
  {
    "title": "3 Ways Taxing the Rich Would Help the Middle Class — And 2 Ways It Wouldn’t",
    "description": "Calls to \"tax the rich\" have become a rallying cry in recent years. The volume of the calls depends on consumer confidence and whether recent market...",
    "link": "https://finance.yahoo.com/news/3-ways-taxing-rich-help-120318904.html",
    "timestamp": "2025-04-02T12:03:18Z"
  },
  {
    "title": "USAID or US Agenda? Who Will Be Sorry for Its Demise?",
    "description": "Upon regaining his throne at the Oval Office in January, US President Donald Trump signed a much remarked executive order that “paused all U.S. foreign assistance funded by or through the State Department and U.S. Agency for International Development (USAID) …",
    "link": "https://www.fairobserver.com/world-news/us-news/usaid-or-us-agenda-who-will-be-sorry-for-its-demise/",
    "timestamp": "2025-04-02T12:03:13Z"
  },
  {
    "title": "Germany is permanently stationing troops in another country for the first time since World War II",
    "description": "Germany is putting thousands of troops in Lithuania, a NATO member that borders Russia. It's the first long-term deployment abroad since World War II.",
    "link": "https://www.businessinsider.com/germany-permanent-troops-another-country-first-time-world-war-two-2025-4",
    "timestamp": "2025-04-02T12:02:50Z"
  },
  {
    "title": "Will the future of fact-checking flourish or founder? 2025 marks a new turning point",
    "description": "Every year on April 2, fact-checkers celebrate International Fact-Checking Day. Usually it’s a time for celebration, fun, even for a little irreverence. This year, for example, the British actor Stephen […]\nThe post Will the future of fact-checking flourish o…",
    "link": "https://www.poynter.org/fact-checking/2025/angie-drobnic-holan-international-fact-checking-day/",
    "timestamp": "2025-04-02T12:00:35Z"
  },
  {
    "title": "Courtroom combat: Inside the federal judiciary system where Trump's agenda is under assault",
    "description": "More than 120 lawsuits are challenging Trump’s second-term agenda. Here’s how the federal court system works and how it’s become ground zero in the lawfare against his agenda.",
    "link": "https://www.foxnews.com/politics/courtroom-combat-inside-federal-judiciary-system-where-trumps-agenda-under-assault",
    "timestamp": "2025-04-02T12:00:22Z"
  },
  {
    "title": "Trump Set To Announce Biggest Tax Increase On Americans In Decades",
    "description": "Despite the president’s false claims, Americans actually pay U.S. tariffs — meaning his “liberation day” announcement is about liberating Americans from their money",
    "link": "https://www.huffpost.com/entry/trump-tariff-tax-increase_n_67ec690fe4b07de4a7b95428",
    "timestamp": "2025-04-02T12:00:13Z"
  },
  {
    "title": "A new bill would give prosecutors 10 years to bring fraud charges over a pandemic program that paid pop stars millions",
    "description": "The SBA Fraud Enforcement Extension Act would broaden the window of time for prosecutors to bring charges of defrauding two pandemic bailouts.",
    "link": "https://www.businessinsider.com/pandemic-relief-fraud-charges-bill-congress-ernst-williams-2025-4",
    "timestamp": "2025-04-02T12:00:02Z"
  },
  {
    "title": "Posthaste: U.S. ‘unreliable to point of hostility’ with Canada especially at risk, report warns",
    "description": "Analysis from top business leaders offers up measures to 'mitigate Canada's risk' of depending on the U.S.",
    "link": "https://financialpost.com/news/trump-unreliable-canada-at-risk-report",
    "timestamp": "2025-04-02T12:00:02Z"
  },
  {
    "title": "QVC is betting on TikTok to help revive its live shopping business",
    "description": "QVC Group, the owner of the QVC and HSN TV networks, is teaming up with TikTok Shop for 24/7 live shopping streams in an effort to revive its business.",
    "link": "https://www.cnbc.com/2025/04/02/qvc-is-betting-on-tiktok-to-help-revive-its-live-shopping-business.html",
    "timestamp": "2025-04-02T12:00:01Z"
  },
  {
    "title": "Why America Needs a Dedicated Cyber Force Now | Opinion",
    "description": "America's most permeable security frontier requires immediate and decisive action.",
    "link": "https://www.newsweek.com/why-america-needs-dedicated-cyber-force-now-opinion-2053910",
    "timestamp": "2025-04-02T12:00:01Z"
  },
  {
    "title": "UFC signs wide-ranging sponsorship deal with Meta, bringing Mark Zuckerberg closer to Dana White",
    "description": "Meta and mixed martial arts league UFC reached a multimillion-dollar, multiple-year sponsorship deal that will span the tech company's portfolio, UFC told CNBC.",
    "link": "https://www.cnbc.com/2025/04/02/ufc-signs-sponsorship-deal-with-mark-zuckerbergs-meta.html",
    "timestamp": "2025-04-02T12:00:01Z"
  },
  {
    "title": "SNAP Shouldn’t Subsidize Slurpees",
    "description": "Even Chicken Little would be exhausted trying to keep up with what Democrats claim President Donald Trump wants to do. Just look at the news.... Read More\nThe post SNAP Shouldn’t Subsidize Slurpees appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/02/snap-shouldnt-subsidize-slurpees/",
    "timestamp": "2025-04-02T12:00:00Z"
  },
  {
    "title": "Political Poison",
    "description": "<ul>\n<li>Elon Musk's Bad Day</li>\n<li>Mike Lindell Stays On Message</li>\n<li>Undoing Biden's Pardons</li>\n</ul>",
    "link": "https://www.peoplefor.org/rightwingwatch/political-poison",
    "timestamp": "2025-04-02T12:00:00Z"
  },
  {
    "title": "How to Combat Misinformation",
    "description": "Misinformation is nothing new. It has, however, become ubiquitous and, in some cases, more difficult and time-consuming than ever to debunk. Here's our advice on how to identify bogus posts and factual distortions.\nThe post How to Combat Misinformation appear…",
    "link": "https://www.factcheck.org/2025/04/how-to-combat-misinformation/",
    "timestamp": "2025-04-02T12:00:00Z"
  },
  {
    "title": "Nick Fuentes Urges Trump To 'Round Up A Few Innocent People' For Deportation Just To Send A Message",
    "description": "Nick Fuentes praises the Trump administration for deporting innocent people to foreign prisons",
    "link": "https://www.peoplefor.org/rightwingwatch/nick-fuentes-urges-trump-round-few-innocent-people-deportation-just-send-message",
    "timestamp": "2025-04-02T12:00:00Z"
  },
  {
    "title": "Sensex, Nifty jump as markets shrug off tariff fears",
    "description": "Benchmark indices rebounded, led by realty sector, amid expectations of an interest rate cut; market sentiment remains cautiously optimistic.",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/sensex-nifty-jump-as-markets-shrug-off-tariff-fears/article69403813.ece",
    "timestamp": "2025-04-02T11:57:52Z"
  },
  {
    "title": "Happy news from the state next door",
    "description": "I’ve been watching this race for the Wisconsin supreme court. It was a contest between a liberal (that is, sane) judge, Susan Crawford, and a conservative (that is, insane) judge backed by a Koch brother, Donald Trump, and Elon Musk, and it was pretty much a …",
    "link": "https://freethoughtblogs.com/pharyngula/2025/04/02/happy-news-from-the-state-next-door/",
    "timestamp": "2025-04-02T11:57:28Z"
  },
  {
    "title": "India backs EV tariff cuts for Trump trade deal, defying autos lobby, sources say",
    "description": "India plans to reduce import tariffs on electric cars, prioritizing a trade deal with the United States. This move, set to be part of the first tranche of tariff reductions, aims to address the concerns of U.S. stakeholders like Tesla, despite opposition from…",
    "link": "https://economictimes.indiatimes.com/industry/renewables/india-backs-ev-tariff-cuts-for-trump-trade-deal-defying-autos-lobby-sources-say/articleshow/119906871.cms",
    "timestamp": "2025-04-02T11:57:20Z"
  },
  {
    "title": "Tesla, Newsmax, Big Tech: Stocks to watch today",
    "description": "Stocks fell premarket on “Liberation Day,” when President Donald Trump is set to unveil new tariffs on virtually all countries with which the U.S. has a trading relationship. Futures linked to the S&P 500, Nasdaq 100 and the Dow Jones Industrial Average all p…",
    "link": "https://qz.com/stock-watch-tesla-newsmax-nvidia-palantir-meta-amazon-1851774140",
    "timestamp": "2025-04-02T11:56:00Z"
  },
  {
    "title": "Trump weighs TikTok bids as deadline looms",
    "description": "The News\nUS President Donald Trump will weigh bids by American firms to take over TikTok on Wednesday, ahead of a weekend deadline for its Chinese owners to divest the app. \nInvestment firms Blackstone and Andreessen Horowitz, as well as tech giant Oracle, ar…",
    "link": "https://biztoc.com/x/5d78f0fb157ad612",
    "timestamp": "2025-04-02T11:55:57Z"
  },
  {
    "title": "Stock market today: Asian shares are mixed ahead of Trump’s latest tariffs",
    "description": "Stock market today: Wall Street sags ahead of Trump’s latest tariff rollout\nStock market today: Wall Street sags ahead of Trump’s latest tariff rollout\nWall Street pointed toward losses before the opening bell Wednesday before President Donald Trump reveals d…",
    "link": "https://biztoc.com/x/dd9bbe003b6c8c01",
    "timestamp": "2025-04-02T11:55:40Z"
  },
  {
    "title": "Wisconsin and Florida elections provide early warning signs to Trump and Republicans (Jill Colvin/Associated Press)",
    "description": "Jill Colvin / Associated Press:\nWisconsin and Florida elections provide early warning signs to Trump and Republicans  —  A trio of elections Tuesday provided early warning signs to Republicans and President Donald Trump at the beginning of an ambitious term, …",
    "link": "https://www.memeorandum.com/250402/p19",
    "timestamp": "2025-04-02T11:55:08Z"
  },
  {
    "title": "UK preparing for 'all eventualities' ahead of Trump tariffs, Starmer says",
    "description": "Sir Keir Starmer has said the government has been preparing \"for all eventualities\" ahead of Donald Trump announcing global tariffs later on Wednesday.",
    "link": "https://news.sky.com/story/uk-preparing-for-all-eventualities-ahead-of-trump-tariffs-starmer-says-13340444",
    "timestamp": "2025-04-02T11:55:00Z"
  },
  {
    "title": "Trump faces first electoral setback after Wisconsin Supreme Court vote",
    "description": "WASHINGTON: Donald Trump's second presidency was dealt a spinning blow by voters in Wisconsin on Tuesday (Apr 1) as they elected a liberal judge to the state's Supreme Court, despite his billionaire advisor Elon Musk pouring millions into the race to sway the…",
    "link": "https://www.channelnewsasia.com/world/trump-faces-first-electoral-setback-after-wisconsin-supreme-court-vote-5039331",
    "timestamp": "2025-04-02T11:54:51Z"
  },
  {
    "title": "Trump Attorney Studied Options for Third Presidential Term",
    "description": "\"Donald Trump’s attorney Boris Epshteyn made a bold assertion during a meeting in late 2023: Trump wouldn’t necessarily be limited to two terms in office,\" the Wall Street Journal reports. \"Speaking to an associate in",
    "link": "https://politicalwire.com/2025/04/02/trump-attorney-studied-options-for-third-presidential-term/",
    "timestamp": "2025-04-02T11:52:52Z"
  },
  {
    "title": "Is all fair in love and trade wars?",
    "description": "President Donald Trump is slated to unveil a slew of tariffs today, though we don’t know exactly how high these import taxes will be. What we do know is that a lot of U.S. allies are promising to retaliate in what could be the start of a far-flung trade war. …",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/is-all-fair-in-love-and-trade-wars/",
    "timestamp": "2025-04-02T11:52:27Z"
  },
  {
    "title": "TikTok's future hangs in the balance: Will Trump's reprieve bring a buyer?",
    "description": "President Donald Trump paused a law that banned TikTok in the U.S. for national security reasons. The Chinese-owned app was supposed to be sold, but ByteDance failed to find a buyer. Trump's decision allows TikTok to continue operating, giving ByteDance more …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tiktoks-future-hangs-in-the-balance-will-trumps-reprieve-bring-a-buyer/articleshow/119906652.cms",
    "timestamp": "2025-04-02T11:51:20Z"
  },
  {
    "title": "Wisconsin Rebukes Elon Musk's Pathetic Pandering",
    "description": "Yesterday marked the first day of this Administration that wasn't completely, horribly, abysmally awful. Granted, it began with thousands more layoffs at health agencies, where Robert F. Kennedy continued his purge of senior leaders and scientists as part of …",
    "link": "https://www.pajiba.com/news/wisconsin-rebukes-elon-musks-pathetic-pandering.php",
    "timestamp": "2025-04-02T11:51:17Z"
  },
  {
    "title": "What time is Donald Trump’s ‘Liberation Day’ speech today and what is he expected to announce?",
    "description": "Since his inauguration on 20 January, Donald Trump’s speeches have been regularly causing confusion and alarm around the world so it’s no surprise that “what time is Trump’s speech today?” is currently trending on social media as people prepare – apprehensive…",
    "link": "https://www.thepinknews.com/2025/04/02/what-time-is-donald-trumps-liberation-day-speech-today/",
    "timestamp": "2025-04-02T11:49:58Z"
  },
  {
    "title": "Rep. Biggs Moves to Oust Judge Boasberg Without Impeachment",
    "description": "Rep. Andy Biggs submitted a resolution to remove Judge James Boasberg from office after he blocked Trump immigration enforcement.",
    "link": "https://www.westernjournal.com/rep-biggs-moves-oust-judge-boasberg-without-impeachment/",
    "timestamp": "2025-04-02T11:49:21Z"
  },
  {
    "title": "Trump is set to announce ‘reciprocal’ tariffs in a risky move that could reshape the economy",
    "description": "President Donald Trump is set to launch a barrage of so-called reciprocal tariffs on friend and foe alike later today.",
    "link": "https://www.bostonherald.com/2025/04/02/donald-trump-tariffs-liberation-day/",
    "timestamp": "2025-04-02T11:46:56Z"
  },
  {
    "title": "Trump launches tariffs, saying global trade has ‘looted, pillaged, raped, plundered’ US economy",
    "description": "Trump has promised that factory jobs will return to the United States as a result.",
    "link": "https://www.denverpost.com/2025/04/02/donald-trump-tariffs-liberation-day/",
    "timestamp": "2025-04-02T11:46:56Z"
  },
  {
    "title": "Does Iran hope Russia can save it from US strikes?",
    "description": "Moscow may think that it can link a Ukraine deal to a deal that will also help Iran.",
    "link": "https://www.jpost.com/middle-east/iran-news/article-848562",
    "timestamp": "2025-04-02T11:46:29Z"
  },
  {
    "title": "Stock Futures Fall as the World Awaits Trump's Tariffs Plan",
    "description": "Updated 52 min ago\nStock Futures Fall as the World Awaits Trump's Tariffs Plan\nStock futures fell early Wednesday as investors anxiously awaited President Donald Trump’s global tariffs plan.\nLiberation Day, as Trump has called it, is finally here and all will…",
    "link": "https://biztoc.com/x/6b5047ee332fedd2",
    "timestamp": "2025-04-02T11:45:16Z"
  },
  {
    "title": "Biden Aide Describes an ‘Out of It’ President",
    "description": "In a new book, Joe Biden’s former White House chief of staff Ron Klain paints a devastating picture of the then president’s mental and physical state before the debate with Donald Trump that sent his",
    "link": "https://politicalwire.com/2025/04/02/biden-aide-describes-an-out-of-it-president/",
    "timestamp": "2025-04-02T11:45:01Z"
  },
  {
    "title": "Why no one is challenging Trump's executive order that keeps TikTok running",
    "description": "President Donald Trump’s executive orders have spurred more than 130 lawsuits, but one related to TikTok barely generates a peep",
    "link": "https://abcnews.go.com/Technology/wireStory/challenging-trumps-executive-order-tiktok-running-120404594",
    "timestamp": "2025-04-02T11:44:35Z"
  },
  {
    "title": "Man Arrested For Allegedly Tossing Nails In Driveways Of Trump Supporters",
    "description": "A 63-year-old man in Bucks County, Pennsylvania was arrested for allegedly tossing screws and nails in driveways belonging to Trump supporters. Alaric Dalberg, a Yardley resident, is facing charges of harassment, disorderly conduct and related offenses, accor…",
    "link": "https://freerepublic.com/focus/f-bloggers/4308322/posts",
    "timestamp": "2025-04-02T11:43:51Z"
  },
  {
    "title": "New York governor attacks ICE over 'cruel' detention of three children and their mother",
    "description": "New York Governor Kathy Hochul, civil rights groups and local school leaders have expressed shock over the detention of three children and their mother in New York state.",
    "link": "https://www.nbcnews.com/news/us-news/new-york-governor-attacks-ice-cruel-detention-three-children-mother-rcna199234",
    "timestamp": "2025-04-02T11:43:46Z"
  },
  {
    "title": "5 things to know for April 2: Elections, Tariffs, Israel, Federal layoffs, Health funding | CNN",
    "description": "5 things to know for April 2: Elections, Tariffs, Israel, Federal layoffs, Health funding | CNNcnn.com",
    "link": "https://www.cnn.com/2025/04/02/us/5-things-to-know-for-april-2-elections-tariffs-israel-federal-layoffs-health-funding/index.html",
    "timestamp": "2025-04-02T11:38:32Z"
  },
  {
    "title": "Elon Musk-led DOGE to fire all local workers and US diplomats from terminated USAID by THIS date: 10-point explainer",
    "description": "Unofficial US President Donald Trump adviser’s cost-cutting team DOGE, led by one of his closest allies Elon Musk, will finalize shuttering the foreign aid agency USAID. After Trump returned to the White House, Trump had put thousands of USAID employees on le…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-led-doge-to-fire-all-local-workers-and-us-diplomats-from-terminated-usaid-by-september-25-10-point-explainer/articleshow/119905969.cms",
    "timestamp": "2025-04-02T11:38:06Z"
  },
  {
    "title": "Legendary rocker fears he won't be allowed to return home to the US if he tours abroad (Neil Young)",
    "description": "The rocker went on: 'By these latest actions of our US government, it seems that those who speak out freely with their own opinions are now vulnerable to a non-existent Trump law. Then it seems to me that if you voted for Kamala Harris over Trump, that makes …",
    "link": "https://freerepublic.com/focus/f-chat/4308321/posts",
    "timestamp": "2025-04-02T11:37:21Z"
  },
  {
    "title": "Cory Booker’s 25-hour marathon Senate speech broke the record",
    "description": "After the 2024 election, most Black Americans have been on strike when it comes to politics. This is especially true of Black American women, who were the largest voting bloc for Kamala Harris, and have been the most consistent voting bloc and organizing bloc…",
    "link": "https://www.celebitchy.com/916201/cory_bookers_25-hour_marathon_senate_speech_broke_the_record/",
    "timestamp": "2025-04-02T11:35:17Z"
  },
  {
    "title": "Markets won't get the certainty they want from Trump's tariff announcement",
    "description": "Questions will remain over how and which countries will respond, and what the impact on inflation and interest rates will be.",
    "link": "https://www.cnbc.com/2025/04/02/markets-wont-get-the-certainty-they-want-from-trumps-tariff-announcement.html",
    "timestamp": "2025-04-02T11:34:41Z"
  },
  {
    "title": "In Wisconsin, Justice Will Be Served!",
    "description": "On Tuesday, Wisconsin had the most closely watched and hotly contested election in the nation between Judge Susan Crawford and Knee Pad Brad Schimel for the Wisconsin Supreme Court.\nSchimel had the endorsement of the Felonious Kumquat. He had President Elmo d…",
    "link": "https://crooksandliars.com/2025/04/wisconsin-justice-will-be-served",
    "timestamp": "2025-04-02T11:33:57Z"
  },
  {
    "title": "Trump's new tariffs set to go into effect amid widespread job cuts",
    "description": "President Donald Trump is set to unveil his long-promised reciprocal tariffs on foreign adversaries and allies that are set to go into effect immediately once they are announced on Wednesday. It comes as he ramps up cuts to the federal workforce with about 10…",
    "link": "https://biztoc.com/x/e620f71b13fb286d",
    "timestamp": "2025-04-02T11:33:41Z"
  },
  {
    "title": "Why no one is challenging Trump’s executive order that keeps TikTok running",
    "description": "By SARAH PARVINI and MARK SHERMAN, Associated Press\nWASHINGTON (AP) — After TikTok was banned in the United States earlier this year, President Donald Trump gave the platform a reprieve, barreling past a law that was passed in Congress and upheld unanimously …",
    "link": "https://biztoc.com/x/580af8a2c052728b",
    "timestamp": "2025-04-02T11:33:32Z"
  },
  {
    "title": "Consumers brace for economic impact of Trump's reciprocal tariffs",
    "description": "President Donald Trump is set to unveil new reciprocal tariffs with taxes expected on imported goods from around the world that are set to go into effect immediately. NBC’s Christine Romans joins TODAY to break down how they will impact the economy and what t…",
    "link": "https://biztoc.com/x/d5655a9c110656f5",
    "timestamp": "2025-04-02T11:33:26Z"
  },
  {
    "title": "US tariffs may change global trade flows, make India more vulnerable to steel imports: SAIL chairman",
    "description": "SAIL Chairman Amarendu Prakash suggests that higher US tariffs on steel and aluminum could alter global trade flows, potentially increasing India's vulnerability to steel imports. He mentions that the tariffs may make Asian countries redirect their steel expo…",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/steel/us-tariffs-may-change-global-trade-flows-make-india-more-vulnerable-to-steel-imports-sail-chairman/articleshow/119906068.cms",
    "timestamp": "2025-04-02T11:32:53Z"
  },
  {
    "title": "Swedish insurer drops $160 mn Tesla stake over labour rights",
    "description": "Swedish insurance company Folksam said Wednesday it had given up its $160 million stake in Tesla due to the electric carmaker’s approach to labour rights. Folksam said that Tesla’s approach to its employees’ rights to unionise was “problematic” given its inve…",
    "link": "https://www.digitaljournal.com/world/swedish-insurer-drops-160-mn-tesla-stake-over-labour-rights/article",
    "timestamp": "2025-04-02T11:32:34Z"
  },
  {
    "title": "Israel's Netanyahu heads to Hungary, defying ICC arrest warrant",
    "description": "Netanyahu is due to meet Orban ahead of a press conference at around 1000 GMT.",
    "link": "https://www.jpost.com/israel-news/article-848560",
    "timestamp": "2025-04-02T11:31:59Z"
  }
]