[
  {
    "title": "Trump accused of Pope Francis funeral faux pas after 'breaking dress code' then leaving early (Jane Dalton/The Independent)",
    "description": "Jane Dalton / The Independent:\nTrump accused of Pope Francis funeral faux pas after ‘breaking dress code’ then leaving early  —  On The Ground newsletter: Get a weekly dispatch from our international correspondents  —  President Donald Trump has been accused …",
    "link": "https://www.memeorandum.com/250426/p33",
    "timestamp": "2025-04-26T19:55:01Z"
  },
  {
    "title": "In pictures: Who attended Pope Francis's funeral in Vatican City?",
    "description": "Attendees include Donald Trump, Keir Starmer, Emmanuel Macron, the UN chief and European Union leaders, as well as Prince William and the Spanish royal family.",
    "link": "https://www.abc.net.au/news/2025-04-27/pope-francis-funeral/105219978",
    "timestamp": "2025-04-26T19:50:59Z"
  },
  {
    "title": "How Libraries Are Faring Under the Trump Administration Amid Detrimental Funding Cuts",
    "description": "“The greatest impact to reduction in funding and services will be the small and rural communities across this country.\"",
    "link": "https://time.com/7280715/how-libraries-are-faring-under-trump/",
    "timestamp": "2025-04-26T19:49:05Z"
  },
  {
    "title": "Tesla Seems Doomed If Musk Stays, And Doomed If He Leaves",
    "description": "Elon Musk's political meandering have hurt Tesla, but are its staunch believers and investors ready to let go?",
    "link": "https://www.forbes.com/sites/peterlyon/2025/04/26/tesla-seems-doomed-if-musk-stays-and-doomed-if-he-leaves/",
    "timestamp": "2025-04-26T19:48:32Z"
  },
  {
    "title": "Trump Token's 85% Weekly Surge Defies Democrats' Call for Impeachment, Massive Unlocks",
    "description": "TRUMP, the memecoin tied to U.S. President Donald Trump, is up about 16% in the last 24 hours, even as Democratic lawmakers cite the president’s involvement with the token as potential grounds for impeachment and after a massive unlock earlier in the month.\nA…",
    "link": "https://biztoc.com/x/45405a11a8c1a321",
    "timestamp": "2025-04-26T19:45:42Z"
  },
  {
    "title": "Trump made physically impossible claim amid 'staring contest' with Chinese leader: report",
    "description": "Donald Trump made a physically impossible claim about his tariff negotiations with China, and one reporter is sounding the alarm.Politico's Washington-based China correspondent Phelim Kine appeared on MSNBC on Saturday, where he was asked about the President'…",
    "link": "https://www.rawstory.com/trump-200-false-claim-tariffs/",
    "timestamp": "2025-04-26T19:43:13Z"
  },
  {
    "title": "‘Who’s Confessing to Whom?’ Fox Hosts Joke Trump and Zelensky Sit-Down at Pope’s Funeral Looked Like Face-to-Face Catholic Confession",
    "description": "The hosts were amused in comparing the appearance of the meeting to that of a face-to-face confession, but also remarked on the sit-down's importance.\nThe post ‘Who’s Confessing to Whom?’ Fox Hosts Joke Trump and Zelensky Sit-Down at Pope’s Funeral Looked Lik…",
    "link": "https://www.mediaite.com/tv/whos-confessing-to-whom-fox-hosts-joke-trump-and-zelensky-sit-down-at-popes-funeral-looked-like-face-to-face-catholic-confession/",
    "timestamp": "2025-04-26T19:41:09Z"
  },
  {
    "title": "We checked in on American voters almost 100 days into Trump 2.0",
    "description": "The ABC revisited American voters from across the political spectrum about their thoughts and feelings almost 100 days into Trump's second term.",
    "link": "https://www.abc.net.au/news/2025-04-27/how-us-voters-feel-about-donald-trump-100-days/105215796",
    "timestamp": "2025-04-26T19:39:00Z"
  },
  {
    "title": "Donald Trump Catches Flak Online For Wearing Blue Suit to Pope's Funeral",
    "description": "President Donald Trump drew a a ton of eyes at Pope Francis' funeral Saturday ... and, not totally for the right reasons -- 'cause he wore a bright blue suit to the event, and it outraged a large section of social media. As you know ... POTUS and…\n Permalink",
    "link": "https://www.tmz.com/2025/04/26/donald-trump-blasted-wore-blue-suit-pope-funeral/",
    "timestamp": "2025-04-26T19:38:41Z"
  },
  {
    "title": "Bob Iger Faces Backlash From LGBTQ Community Over Controversial Comments",
    "description": "Disney CEO Bob Iger is usually very calculated. His messages are clear and concise, and he never does anything that would give someone outside of his inner circle an idea of what’s happening in his head. However, Iger’s latest comments are causing a stir in t…",
    "link": "https://insidethemagic.net/?p=769866&preview=true&preview_id=769866",
    "timestamp": "2025-04-26T19:37:59Z"
  },
  {
    "title": "Perfect storm: Tesla sales buckle under competition, model changeover, politics",
    "description": "The electric vehicle maker’s sales dropped by 13% in the first quarter, even as the overall electric vehicle segment grew by 11%. The sales swoon was the largest Tesla sales drop since the second quarter of 2022.",
    "link": "https://www.bostonherald.com/2025/04/26/perfect-storm-tesla-sales-buckle-under-competition-model-changeover-politics/",
    "timestamp": "2025-04-26T19:31:49Z"
  },
  {
    "title": "Why Crypto Leaders Are Feeling Optimistic About the Future: ‘The Crypto Revolution Is Happening’",
    "description": "TIME100 talks panelists agreed that a focused bill regulating stablecoins could help cement the U.S. dollar’s dominance.",
    "link": "https://time.com/7280490/time100-talk-leaders-crypto-revolution/",
    "timestamp": "2025-04-26T19:31:47Z"
  },
  {
    "title": "Trump expresses doubts Putin is willing to end the Ukraine war",
    "description": "Trump, in Rome for Pope Francis’ funeral, met briefly with Ukrainian President Volodymyr Zelenskyy at the Vatican.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_7fdd85ef-47f5-5e22-9c1b-e6c1664a1717.html",
    "timestamp": "2025-04-26T19:30:00Z"
  },
  {
    "title": "Trump Token's 85% Weekly Surge Defies Democrats' Call for Impeachment, Massive Unlocks",
    "description": "U.S. Peesident Donald Trump's memecoin has led to calls for impeachment and inflated its circulating supply in major unlocks. It's still defying gravity.",
    "link": "https://www.coindesk.com/markets/2025/04/26/trump-tokens-85-weekly-surge-defies-democrats-call-for-impeachment-massive-unlocks",
    "timestamp": "2025-04-26T19:29:23Z"
  },
  {
    "title": "Bill Maher says MAGA voters won't admit how disappointed they are in Trump's first 100 days",
    "description": "\"Real Time\" host Bill Maher insisted President Trump's voters are \"disappointed\" in his first 100 days in office, citing the economic turmoil as a result of his tariff war.",
    "link": "https://www.foxnews.com/media/bill-maher-says-maga-voters-wont-admit-how-disappointed-trumps-first-100-days",
    "timestamp": "2025-04-26T19:27:41Z"
  },
  {
    "title": "Shedeur Sanders and family react to Browns picking him after historic, controversial NFL Draft slide",
    "description": "Shedeur Sanders' family reacted to the quarterback's selection by the Cleveland Browns in a livestream on Saturday after a historic slide.",
    "link": "https://www.foxnews.com/sports/shedeur-sanders-family-react-browns-recruitment-after-historic-controversial-nfl-draft-slide",
    "timestamp": "2025-04-26T19:27:39Z"
  },
  {
    "title": "US-Iran nuclear talks signal progress, next round in Europe",
    "description": "A senior U.S. administration official said the third round of talks since President Donald Trump’s return to the White House was positive and productive, and the two sides agreed to meet again soon in Europe.",
    "link": "https://www.bostonherald.com/2025/04/26/us-iran-nuclear-talks-signal-progress-next-round-in-europe/",
    "timestamp": "2025-04-26T19:25:57Z"
  },
  {
    "title": "Poll: Canadians despise Trump and distrust US (Politico)",
    "description": "Politico:\nPoll: Canadians despise Trump and distrust US  —  A new POLITICO/Focaldata poll finds Trump looms over the race, boosting Mark Carney and the Liberals as Canadians turn against the United States.  —  Three quarters of Canadians dislike President Don…",
    "link": "https://www.memeorandum.com/250426/p30",
    "timestamp": "2025-04-26T19:25:01Z"
  },
  {
    "title": "‘Civil Disobedience Is Necessary’: NYT Writer Defends Judge’s ‘Illegal’ Stand Against ‘Predatory’ FBI",
    "description": "Brooks commented on the arrest of Milwaukee County Circuit Judge Hannah Dugan, who allegedly helped an illegal migrant evade federal agents.\nThe post ‘Civil Disobedience Is Necessary’: NYT Writer Defends Judge’s ‘Illegal’ Stand Against ‘Predatory’ FBI first a…",
    "link": "https://www.mediaite.com/tv/civil-disobedience-is-necessary-nyt-writer-defends-judges-illegal-stand-against-predatory-fbi/",
    "timestamp": "2025-04-26T19:23:09Z"
  },
  {
    "title": "Ukraine President Zelenskyy hails potential historic outcome after Trump talks",
    "description": "“We discussed a lot one on one. Hoping for results on everything we covered,” Zelenskyy said on X. “Very symbolic meeting that has potential to become historic, if we achieve joint results.”…",
    "link": "https://www.bostonherald.com/2025/04/26/ukraine-president-zelenskyy-hails-potential-historic-outcome-after-trump-talks/",
    "timestamp": "2025-04-26T19:22:53Z"
  },
  {
    "title": "Upside Down World: European Peace Movement Marches in Support of President Trump as “Anti”-Fascists Rally Against Peace",
    "description": "In a striking turn of events, a Munich peace rally unites supporters of President Trump against Antifa protesters. This unexpected alliance challenges traditional narratives and reshapes the landscape of political activism in Europe.\nThe post Upside Down Worl…",
    "link": "https://www.thegatewaypundit.com/2025/04/upside-down-world-european-peace-movement-marches-support/",
    "timestamp": "2025-04-26T19:20:52Z"
  },
  {
    "title": "'Trump won't save us': Australians' radical shift on US relations",
    "description": "Most Australians believe the United States can no longer be relied on for security in a \"fundamental change of worldview\", research for Q+A shows.",
    "link": "https://www.abc.net.au/news/2025-04-27/yougov-poll-united-states-alliance-donald-trump-relationship/105210660",
    "timestamp": "2025-04-26T19:18:36Z"
  },
  {
    "title": "Russia ‘Playing America,’ Says Senior GOP Senator, Urges Trump To Punish Putin",
    "description": "Russia is playing the U.S. for a fool, Republican Iowa Sen. Chuck Grassley warns U.S. President Donald Trump.",
    "link": "https://dailycaller.com/2025/04/26/putin-russia-america-chuck-grassley-ukraine-zelenskyy-trump/",
    "timestamp": "2025-04-26T19:15:12Z"
  },
  {
    "title": "As Trump destroys the economy, GOP and Wall Street execs stay mum (Catherine Rampell/Washington Post)",
    "description": "Catherine Rampell / Washington Post:\nAs Trump destroys the economy, GOP and Wall Street execs stay mum  —  They seem to think they can pressure Trump privately.  It's not working.  —  President Donald Trump is torching the U.S. economy.  He's attacking our tr…",
    "link": "https://www.memeorandum.com/250426/p29",
    "timestamp": "2025-04-26T19:15:01Z"
  },
  {
    "title": "African multinational telco giant MTN Group disclosed a data breach",
    "description": "African multinational telecommunications company MTN Group disclosed a data breach that exposed subscribers’ personal information. MTN Group Limited is a South African multinational telecommunications company headquartered in Johannesburg. Founded in 1994, it…",
    "link": "https://securityaffairs.com/177037/security/african-multinational-telco-giant-mtn-disclosed-a-data-breach.html",
    "timestamp": "2025-04-26T19:13:17Z"
  },
  {
    "title": "Indian military says Pakistani troops fired at border positions in disputed Kashmir region",
    "description": "There was no comment from Pakistan, and the incidents could not be independently verified. In the past, each side has accused the other of starting border skirmishes in the Himalayan region.",
    "link": "https://www.pbs.org/newshour/world/indian-military-says-pakistani-troops-fired-at-border-positions-in-disputed-kashmir-region",
    "timestamp": "2025-04-26T19:09:13Z"
  },
  {
    "title": "Donald Trump should be praised for signals he might cool tariff fight, Washington Post editorial praises",
    "description": "The Washington Post editorial board praised President Donald Trump for his recent attempts to cool down the tariff wars.",
    "link": "https://www.foxnews.com/media/donald-trump-should-praised-signals-he-might-cool-tariff-fight-washington-post-editorial-praises",
    "timestamp": "2025-04-26T19:08:43Z"
  },
  {
    "title": "China Hits Out at 'Extreme Selfishness' of Tariffs",
    "description": "China's foreign minister has hit out at the \"extreme selfishness\" of tariffs, hinting at the steep levies imposed on Beijing by US President Donald Trump. \"Certain countries\" resort to \"pressure and coercion, and trigger unjustified trade wars ... This extrem…",
    "link": "https://freerepublic.com/focus/f-news/4313439/posts",
    "timestamp": "2025-04-26T19:08:40Z"
  },
  {
    "title": "'Grazie, Francesco': Pope buried in Rome",
    "description": "Some 250,000 attended Pope Francis' funeral in Rome on Saturday, including world leaders and ordinary people. DW's religion correspondent Christoph Strack was there. \"He is like our father, he's everything to us. That's why we're here, because of our love for…",
    "link": "https://www.dw.com/en/grazie-francesco-pope-buried-in-rome/a-72364882",
    "timestamp": "2025-04-26T19:08:00Z"
  },
  {
    "title": "'Grazie, Francesco': Pope buried in Rome",
    "description": "Some 250,000 attended Pope Francis' funeral in Rome on Saturday, including world leaders and ordinary people. DW's religion correspondent Christoph Strack was there.",
    "link": "https://www.dw.com/en/grazie-francesco-pope-buried-in-rome/a-72364882",
    "timestamp": "2025-04-26T19:08:00Z"
  },
  {
    "title": "'He's really flailed': MSNBC Maddow grades out Trump's 'botched' first 100 days",
    "description": "Making a rare appearance on Saturday as a guest on MSNBC host Katie Phang's last show, Rachel Maddow graded out Donald Trump's first 100 days and the best she could say about the second-term president that he has \"flailed.\"Jumping right into it, Maddow, after…",
    "link": "https://www.rawstory.com/trump-100-days-maddow/",
    "timestamp": "2025-04-26T19:06:18Z"
  },
  {
    "title": "U.S. Department of Defense employees in Philly protest Trump effort to strip union rights from federal workers",
    "description": "The Trump administration on March 27 announced it was attempting to remove union rights for hundreds of thousands of federal workers.",
    "link": "https://www.inquirer.com/business/philadelphia-federal-workers-picket-trump-on-union-rights-20250426.html",
    "timestamp": "2025-04-26T19:05:33Z"
  },
  {
    "title": "Mother of 1-Year-Old Married to US Citizen Deported, Separated From Baby",
    "description": "A Tampa Bay mother was deported to Cuba on Thursday after abruptly being detained days prior.",
    "link": "https://www.newsweek.com/mother-1-year-old-married-us-citizen-deported-separated-baby-2064588",
    "timestamp": "2025-04-26T19:03:17Z"
  },
  {
    "title": "The Case For Tariffs – How Tariffs Can Help Bring Back The Golden Age Of American Economy",
    "description": "About once a decade, the question of Protective Tariffs finds its way into the national debate. Whether a political candidate dares to raise the issue or a clever collection of activists and analysts work together to inject it into the national discussion, th…",
    "link": "https://www.activistpost.com/the-case-for-tariffs-how-tariffs-can-help-bring-back-the-golden-age-of-american-economy/",
    "timestamp": "2025-04-26T19:01:00Z"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "description": "Pope Francis is laid to rest, protests in Dublin city centre, and Prince Andrew accuser Virginia Giuffre dies.",
    "link": "https://www.thejournal.ie/news-fix-26-04-25-6688859-Apr2025/",
    "timestamp": "2025-04-26T19:00:20Z"
  },
  {
    "title": "Albanese eyes history — unless Dutton pulls off a last-minute miracle",
    "description": "The crucible of a campaign tests who has what it takes to be a leader. With less than a week to go, we're starting to who has passed the test.",
    "link": "https://www.abc.net.au/news/2025-04-27/election-albanese-dutton-make-history/105216284",
    "timestamp": "2025-04-26T19:00:00Z"
  },
  {
    "title": "“Build Bridges, Not Walls”: Pope Francis' Funeral Sermon Offered Thinly Veiled Reminder to President Donald Trump",
    "description": "The US president and the pontiff frequently exchanged criticisms over compassion for migrants, a group Trump has repeatedly sought to deport.",
    "link": "https://www.vanityfair.com/news/story/trump-attends-pope-francis-funeral",
    "timestamp": "2025-04-26T18:56:22Z"
  },
  {
    "title": "Trump and Zelenskyy meet one-on-one in Vatican basilica to seek Ukraine peace",
    "description": "VATICAN CITY: US President Donald Trump and Ukrainian leader Volodymyr Zelenskyy, in Rome for the funeral of Pope Francis, met one-on-one in a marble-lined Vatican basilica on Saturday (Apr 26) to try to revive faltering efforts",
    "link": "https://www.channelnewsasia.com/world/trump-and-zelenskyy-meet-one-one-vatican-basilica-seek-ukraine-peace-5091991",
    "timestamp": "2025-04-26T18:53:51Z"
  },
  {
    "title": "'We have more in common with America than the rest of Canada'",
    "description": "The threat to Canada's sovereignty from US President Donald Trump has dominated the election, but the country also faces a challenge from within. Some western Canadians, fed up with a decade of Liberal rule, are openly calling for separation. Standing in fron…",
    "link": "https://freerepublic.com/focus/f-news/4313438/posts",
    "timestamp": "2025-04-26T18:51:37Z"
  },
  {
    "title": "Israeli airstrike kills 10 people in Gaza City home as mediators try to restart a ceasefire",
    "description": "An Israeli airstrike flattened a three-story home in Gaza City on Saturday, killing 10 people — half of them children — as Arab mediators scrambled to restart a ceasefire.",
    "link": "https://www.pbs.org/newshour/world/israeli-airstrike-kills-10-people-in-gaza-city-home-as-mediators-try-to-restart-a-ceasefire",
    "timestamp": "2025-04-26T18:48:08Z"
  },
  {
    "title": "World leaders, faithful bid farewell to Pope Francis",
    "description": "A solemn funeral ceremony was held for Pope Francis in Vatican City. Dignitaries and mourners gathered to bid farewell. Cardinal Re appealed for the continuation of Francis' legacy. The late Pope was buried inside Santa Maria Maggiore basilica. US President D…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/world-leaders-faithful-bid-farewell-to-pope-francis/articleshow/120652409.cms",
    "timestamp": "2025-04-26T18:46:15Z"
  },
  {
    "title": "French First Lady Brigitte Macron’s Louis Vuitton Elegance Honors Pope Francis at Vatican Funeral",
    "description": "French first lady Brigitte Macron honored Pope Francis at his Vatican funeral. A fashion showcase of somber elegance with Louis Vuitton and more.",
    "link": "http://wwd.com/fashion-news/fashion-scoops/brigitte-macron-louis-vuitton-pope-francis-funeral-outfit-1237105102/",
    "timestamp": "2025-04-26T18:43:45Z"
  },
  {
    "title": "Big Tech carries Wall Street to the close of its winning, roller-coaster week",
    "description": "Big Tech stocks carried Wall Street Friday to the close of a winning, roller-coaster week, one that saw markets swing from fear to relief and back to caution because of President Donald Trump’s trade war.",
    "link": "https://www.bostonherald.com/2025/04/26/big-tech-carries-wall-street-to-the-close-of-its-winning-roller-coaster-week/",
    "timestamp": "2025-04-26T18:42:04Z"
  },
  {
    "title": "What Sky News correspondents witnessed at the Pope's funeral",
    "description": "Hundreds of thousands of Catholics descended on Vatican City for Pope Francis's funeral on Saturday.",
    "link": "https://news.sky.com/story/what-sky-news-correspondents-witnessed-at-the-popes-funeral-13356565",
    "timestamp": "2025-04-26T18:42:00Z"
  },
  {
    "title": "Conflicting US-China talks statements add to global trade confusion - Economy - The Jakarta Post",
    "description": "US President Donald Trump asserted in an interview published on Friday that tariff negotiations were under way with China, but Beijing denied any talks were taking place, the latest in a series of conflicting signals over what progress was being made to de-es…",
    "link": "http://www.thejakartapost.com/business/2025/04/26/conflicting-us-china-talks-statements-add-to-global-trade-confusion.html",
    "timestamp": "2025-04-26T18:41:25Z"
  },
  {
    "title": "CNN’s Donie O’Sullivan Instantly Stumps MAGA Reporter Who Claims She’ll ‘Hold Trump To Account’",
    "description": "Donie O’Sullivan instantly stumped a pro-Trump White House reporter who claimed she would hold him accountable, with a single question.\nThe post CNN’s Donie O’Sullivan Instantly Stumps MAGA Reporter Who Claims She’ll ‘Hold Trump To Account’ first appeared on …",
    "link": "https://www.mediaite.com/news/cnns-donie-osullivan-instantly-stumps-maga-reporter-who-claims-shell-hold-trump-to-account/",
    "timestamp": "2025-04-26T18:40:15Z"
  },
  {
    "title": "US students 'race' sperm in reproductive health stunt",
    "description": "A commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse—but the athletes they are rooting for are actually tiny sperm cells.",
    "link": "https://phys.org/news/2025-04-students-sperm-reproductive-health-stunt.html",
    "timestamp": "2025-04-26T18:39:33Z"
  },
  {
    "title": "2 Growth Stocks to Buy on the Dip if the Market Crashes Again",
    "description": "In This Article:\nAnxious investors who picked April to go on a long internet-free vacation couldn't have planned it better. Earlier this month, the S&P 500 index quickly sank more than 10% after President Donald Trump unveiled tariff rules that threatened the…",
    "link": "https://biztoc.com/x/166f6a01af4cff0e",
    "timestamp": "2025-04-26T18:39:18Z"
  },
  {
    "title": "Putin Says Kursk Taken Back, General Admits Deploying North Korean Troops",
    "description": "Russia and Ukraine dispute the status of the Kursk region, which Kyiv invaded last year in a surprise and successful incursion into Russian territory.",
    "link": "https://www.newsweek.com/putin-kursk-taken-general-admits-deploying-north-korean-troops-2064606",
    "timestamp": "2025-04-26T18:38:26Z"
  },
  {
    "title": "Big Tech’s soaring energy demands are making coal-fired power plant sites attractive",
    "description": "Coal-fired power plants are becoming more valuable now that the suddenly strong demand for electricity to run Big Tech's cloud computing and artificial intelligence applications has set off a full-on sprint to find new energy sources.",
    "link": "https://www.bostonherald.com/2025/04/26/big-techs-soaring-energy-demands-are-making-coal-fired-power-plant-sites-attractive/",
    "timestamp": "2025-04-26T18:35:35Z"
  },
  {
    "title": "Trump becoming increasingly pathetic",
    "description": "We are witnessing the transition from Trump being bold and bombastic to becoming weak and pathetic as his aggressive actions are turning out to be ineffective, resulting in him having to lie and plead. We see that most clearly in his actions with China. He mu…",
    "link": "https://freethoughtblogs.com/singham/2025/04/26/trump-becoming-increasingly-pathetic/",
    "timestamp": "2025-04-26T18:32:49Z"
  },
  {
    "title": "NFL Draft: Cleveland Browns Select QB Shedeur Sanders",
    "description": "It is the story that has dominated the 2025 NFL Draft.  Colorado quarterback Shedeur Sanders did not get drafted in...\nThe post NFL Draft: Cleveland Browns Select QB Shedeur Sanders appeared first on The Sports Daily.",
    "link": "https://thesportsdaily.com/news/nfl-draft-cleveland-browns-select-qb-shedeur-sanders/",
    "timestamp": "2025-04-26T18:31:29Z"
  },
  {
    "title": "‘Wasting Judicial Resources’: Judge Shreds Trump Admin’s Alien Enemies Act Case",
    "description": "A federal judge in El Paso ruled that Trump’s attempt to deport a couple under the wartime law had no “basis” other than “multiple levels of hearsay”",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-judge-shreds-alien-enemies-act-deportation-case-1235325882/",
    "timestamp": "2025-04-26T18:31:28Z"
  },
  {
    "title": "Browns Draft Shedeur Sanders: What Does Cleveland QB Room Look Like Now?",
    "description": "The Cleveland Browns have finally drafted Sheduer Sanders. Here's what their quarterback room looks like now.",
    "link": "https://www.newsweek.com/sports/nfl/browns-draft-shedeur-sanders-what-does-cleveland-qb-room-look-like-now-2064614",
    "timestamp": "2025-04-26T18:25:20Z"
  },
  {
    "title": "6am sprints and rooftop communion: Behind the scenes of the papal funeral",
    "description": "A 6am, around 30 people suddenly sprinted out of the courtyard and towards St Peter’s Square. The rumour mill began – has Trump arrived?",
    "link": "https://www.thejournal.ie/pope-francis-funeral-rome-the-vatican-6688211-Apr2025/",
    "timestamp": "2025-04-26T18:20:34Z"
  },
  {
    "title": "Shedeur Sanders Finally Selected on Third Day of NFL Draft, Picked By Browns",
    "description": "The wait is over for Shedeur Sanders -- after going unselected in the first two days of the 2025 NFL Draft, Deion's son finally has an NFL home with the Cleveland Browns. The former Colorado quarterback was the 144th overall pick ... making him a…\n Permalink",
    "link": "https://www.tmz.com/2025/04/26/shedeur-sanders-drafted-browns/",
    "timestamp": "2025-04-26T18:19:56Z"
  },
  {
    "title": "Tesla Hikes Canadian Prices and Pushes Its Pre-Tariff Inventory",
    "description": "Tesla Inc. is raising prices in Canada and encouraging buyers to snap up cars imported before counter-tariffs were imposed on US-made vehicles.",
    "link": "https://financialpost.com/pmn/business-pmn/tesla-hikes-canadian-prices-and-pushes-its-pre-tariff-inventory",
    "timestamp": "2025-04-26T18:17:12Z"
  },
  {
    "title": "What student loan forgiveness opportunities still remain under Trump",
    "description": "Under the Biden administration, the U.S. Department of Education made regular announcements that it was forgiving student debt for thousands of people under various relief programs and repayment plans.\nThat’s changed under President Donald Trump.\nIn his first…",
    "link": "https://biztoc.com/x/13291b30bf368f76",
    "timestamp": "2025-04-26T18:16:57Z"
  },
  {
    "title": "Abbas names Hussein al-Sheikh as deputy, likely succesor to PLO",
    "description": "Al-Sheikh said that the Palestinian Authority was carrying out reforms and forming a new government as the US and Arab countries requested, but it was not receiving enough support.",
    "link": "https://www.jpost.com/middle-east/article-851615",
    "timestamp": "2025-04-26T18:16:31Z"
  },
  {
    "title": "Exclusive -- Rod Blagojevich on Running for Senate as MAGA Republican: 'Never Say Never'",
    "description": "Former Gov. Rod Blagojevich (D-IL) is open to the idea of running for an Illinois senate seat as a MAGA Republican, telling Breitbart News Saturday, \"never say never\" when asked.\nThe post Exclusive — Rod Blagojevich on Running for Senate as MAGA Republican: ‘…",
    "link": "https://www.breitbart.com/radio/2025/04/26/exclusive-rod-blagojevich-on-running-for-senate-as-maga-republican-never-say-never/",
    "timestamp": "2025-04-26T18:13:26Z"
  },
  {
    "title": "Melania Trump’s birthday: Here’s why Donald Trump is not buying a present for the First Lady today",
    "description": "Last year, the couple celebrated her birthday separately, with Melania remaining in Florida while Donald Trump was in New York for his hush-money trial.",
    "link": "https://economictimes.indiatimes.com/news/international/us/melania-trumps-birthday-heres-why-donald-trump-is-not-buying-a-present-for-the-first-lady-today/articleshow/120651710.cms",
    "timestamp": "2025-04-26T18:12:56Z"
  },
  {
    "title": "Harvard’s Resistance to Trump Is a Start. Universities Must Go Farther.",
    "description": "To survive fascist attacks, universities must commit to a future in which they serve the people, not the elite.",
    "link": "https://academeblog.org/2025/04/24/harvards-push-back-was-essential-but-not-nearly-enough/",
    "timestamp": "2025-04-26T18:10:25Z"
  },
  {
    "title": "Private Prison Companies Are Raking in Profits From Increased Deportations",
    "description": "“This is, to us, an unprecedented opportunity,” the executive chairman of GEO Group said shortly after the election.",
    "link": "https://www.opensecrets.org/news/2025/04/private-prison-companies-positioned-to-benefit-from-increased-deportations",
    "timestamp": "2025-04-26T18:10:18Z"
  },
  {
    "title": "World Leaders Accused Of ‘Disrespect’ At Pope Francis’s Funeral",
    "description": "\"Where is the respect?\"",
    "link": "https://www.boredpanda.com/world-leaders-accused-of-breaking-the-dress-code-at-popes-funeral/",
    "timestamp": "2025-04-26T18:05:48Z"
  },
  {
    "title": "Maddow Declares Trump Attempting ‘Authoritarian Overthrow’ of U.S. But So Far Too ‘Incompetent’ to Pull it Off",
    "description": "Rachel Maddow claimed Trump \"botched\" his first 100 days in office more than any president as he attempts what she described as an \"authoritarian overthrow.\"\nThe post Maddow Declares Trump Attempting ‘Authoritarian Overthrow’ of U.S. But So Far Too ‘Incompete…",
    "link": "https://www.mediaite.com/tv/maddow-declares-trump-attempting-authoritarian-overthrow-of-u-s-but-so-far-too-incompetent-to-pull-it-off/",
    "timestamp": "2025-04-26T18:04:19Z"
  },
  {
    "title": "The world doesn’t need more boring billionaires. It needs Robin Hoods",
    "description": "Sunday Times News: Even as US President Donald Trump favours tax cuts for billionaires, Dutch historian Rutger Bregman—who became the “folk hero of Davos” after famously.",
    "link": "https://timesofindia.indiatimes.com/home/sunday-times/all-that-matters/the-world-doesnt-need-more-boring-billionaires-it-needs-robin-hoods/articleshow/120651539.cms",
    "timestamp": "2025-04-26T18:02:13Z"
  },
  {
    "title": "Go, David Hogg, Go!",
    "description": "A Dem party! A big Dem party! We like that hat!",
    "link": "https://www.wonkette.com/p/go-david-hogg-go",
    "timestamp": "2025-04-26T18:00:38Z"
  },
  {
    "title": "Joyce Omondi Marvels as Hubby Waihiga Mwaura Covers Pope Francis' Funeral at Vatican",
    "description": "Waihiga Mwaura was on live BBC at the Vatican covering Pope Francis's funeral and his wife Joyce Omondi marvelled at his skills and celebrated him.",
    "link": "https://www.tuko.co.ke/entertainment/celebrities/587153-joyce-omondi-marvels-hubby-waihiga-mwaura-covers-pope-francis-funeral-vatican/",
    "timestamp": "2025-04-26T18:00:20Z"
  },
  {
    "title": "Donald Trump's blue suit at Pope Francis' funeral sparks controversy",
    "description": "Donald Trump's choice of a bright blue suit at Pope Francis' funeral sparked controversy, contrasting sharply with the traditional black attire of other world leaders like Macron and Milei. Critics deemed it disrespectful, citing Vatican protocol for dark sui…",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-blue-suit-at-pope-francis-funeral-sparks-controversy/articleshow/120651671.cms",
    "timestamp": "2025-04-26T18:00:03Z"
  },
  {
    "title": "‘The Daily Show’ Is In “Game Shape” To Deal With Political Carnage – Contenders TV: Documentary, Unscripted & Variety",
    "description": "The rhythm of late-night television changed back in 2017 when Donald Trump became President, forcing all of the talk shows to prepare for the dreaded 4 p.m. rewrite. So, when Trump was reelected for a second term, it’s a challenge that all of the late-night s…",
    "link": "http://deadline.com/2025/04/daily-show-team-game-shape-trump-1236375652/",
    "timestamp": "2025-04-26T18:00:00Z"
  },
  {
    "title": "11 Canadian political claims we've broken down",
    "description": "Many claims spread online ahead of federal elections on April 28, 2025, including rumors about Canadian PM Mark Carney.",
    "link": "https://www.snopes.com/collections/canada-elections-mark-carney-collection/",
    "timestamp": "2025-04-26T18:00:00Z"
  },
  {
    "title": "Iran and U.S. expert teams hold hours of talks in Oman over Tehran’s nuclear program",
    "description": "Iran and the United States held in-depth negotiations in Oman over Tehran's rapidly advancing nuclear program on Saturday, ending the discussions with a promise for more talks and perhaps another high-level meeting next weekend.",
    "link": "https://www.pbs.org/newshour/world/iran-and-u-s-expert-teams-hold-hours-of-talks-in-oman-over-tehrans-nuclear-program",
    "timestamp": "2025-04-26T17:57:17Z"
  },
  {
    "title": "Yale Classmates Urge Bessent To Reconsider Trump White House Role — Treasury Secretary Calls It an 'Honor'",
    "description": "A group of Yale University alumni publicly appealed to Treasury Secretary Scott Bessent, urging him to reevaluate his position within the Donald Trump administration.\nWhat Happened: An open letter dated Wednesday, signed by 140 Yale Class of 1984 alumni, alle…",
    "link": "https://biztoc.com/x/365329e3b02f4e33",
    "timestamp": "2025-04-26T17:54:53Z"
  },
  {
    "title": "Party leaders campaign in Ontario, B.C. battlegrounds as election day nears",
    "description": "Pierre Poilievre, Mark Carney and Jagmeet Singh all blitzed through key ridings in southern Ontario and British Columbia on Saturday with the final vote in the federal election now just two days away.",
    "link": "https://www.cbc.ca/news/politics/party-leaders-battlegrounds-election-1.7519605",
    "timestamp": "2025-04-26T17:47:49Z"
  },
  {
    "title": "Shedeur Sanders Says It’s ‘Another Day’ To Get Drafted After NFL Teams Pass Over Quarterback—Here’s What To Know",
    "description": "Shedeur Sanders, son of Super Bowl champion Deion Sanders, was considered a top pick for the NFL draft, but he remains available as the draft enters the fourth round.",
    "link": "https://www.forbes.com/sites/conormurray/2025/04/26/shedeur-sanders-says-its-another-day-to-get-drafted-after-nfl-teams-pass-over-quarterback-heres-what-to-know/",
    "timestamp": "2025-04-26T17:47:21Z"
  },
  {
    "title": "The U.S. Dollar slide is evocative of the Nixon era",
    "description": "The dollar is on pace for its worst performance during the first 100 days of a US presidency since Richard Nixon was in the White House as Donald Trump imposes tariffs and attempts to reshape global trade.\nTrump’s trade policy — aimed at rejuvenating domestic…",
    "link": "https://biztoc.com/x/600f58c5cebf3621",
    "timestamp": "2025-04-26T17:43:36Z"
  },
  {
    "title": "Whiff! Trump Comes Up Empty On Handshake With Macron At Zelensky Pope Funeral Meeting",
    "description": "Trump came up short when he offered French President Emmanuel Macron his hand as he prepared to meet with Ukrainian President Volodymyr Zelensky.\nThe post Whiff! Trump Comes Up Empty On Handshake With Macron At Zelensky Pope Funeral Meeting first appeared on …",
    "link": "https://www.mediaite.com/news/whiff-trump-comes-up-empty-on-handshake-with-macron-at-zelensky-pope-funeral-meeting/",
    "timestamp": "2025-04-26T17:37:44Z"
  },
  {
    "title": "Israeli Airstrike Kills 10 People, Half Of Them Children, As Mediators Try To Restart Ceasefire",
    "description": "Israeli strikes killed at least 49 people in the past 24 hours, according to health officials.",
    "link": "https://www.huffpost.com/entry/israeli-airstrike-kills-10-people-half-of-them-children-mediators-restart-ceasefire_n_680d16c1e4b06b5c9fc8d6f3",
    "timestamp": "2025-04-26T17:33:48Z"
  },
  {
    "title": "Trump's nominee for NASA administrator was once arrested, accused of passing bad checks to casinos",
    "description": "Jared Isaacman, President Trump's nominee for NASA administrator, faced past legal issues, including a 2010 arrest for alleged fraud and lawsuits over unpaid casino debts. These cases, involving casinos like Trump's Taj Mahal and Mohegan Sun, were later settl…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-nominee-for-nasa-administrator-was-once-arrested-accused-of-passing-bad-checks-to-casinos/articleshow/120651387.cms",
    "timestamp": "2025-04-26T17:30:35Z"
  },
  {
    "title": "Trump blasts Putin, questioning if Russian leader wants peace or is just 'tapping me along'",
    "description": "President Donald Trump has expressed doubts that Russian President Vladimir Putin wants to end its war with Ukraine which has raged for more than three years.",
    "link": "https://www.foxnews.com/politics/trump-blasts-putin-questioning-russian-leader-wants-peace-just-tapping-me-along",
    "timestamp": "2025-04-26T17:26:56Z"
  },
  {
    "title": "'Fearing Future Without Babies', Students 'Race' Sperm In Los Angeles",
    "description": "A commentator yells excitedly as hundreds of spectators stand glued to a video of a racecourse -- but the athletes they are rooting for are actually tiny sperm cells.",
    "link": "https://www.ndtv.com/world-news/students-race-sperm-in-los-angeles-fearing-future-without-babies-8264855",
    "timestamp": "2025-04-26T17:25:38Z"
  },
  {
    "title": "Trump takes on Putin after meeting with Zelensky – ‘Maybe he doesn’t want to stop the war’",
    "description": "The American president referenced the Russian attacks and questioned whether Moscow should be 'dealt with differently' - Earlier, the White House described the Trump-Zelensky discussion as 'constructive,' while Putin claimed to have regained control of Kursk\n…",
    "link": "https://en.protothema.gr/2025/04/26/trump-takes-on-putin-after-meeting-with-zelensky-maybe-he-doesnt-want-to-stop-the-war/",
    "timestamp": "2025-04-26T17:19:41Z"
  },
  {
    "title": "Could Lt. Gov. furor give Republicans a do-over on N.Va. candidate?",
    "description": "The state GOP's ticket has no one from vote-rich Northern Virginia, where thousands face federal cutbacks. The Republican slate is set if John Reid stays in the race, as he pledges to do.",
    "link": "https://richmond.com/news/state-regional/government-politics/elections/article_22e38b52-9a34-4b01-9d23-603afd1ce8ba.html",
    "timestamp": "2025-04-26T17:17:00Z"
  },
  {
    "title": "'Fighting antisemitism an old tradition in Albania,' PM Rama tells 'Post'",
    "description": "DIPLOMATIC AFFAIRS | A close ally of Israel, Rama was awarded the Presidential Medal of Honor, Israel’s highest civilian decoration, in Jerusalem earlier this year.",
    "link": "https://www.jpost.com/international/article-851426",
    "timestamp": "2025-04-26T17:14:07Z"
  },
  {
    "title": "Trump Berates ‘STUPID’ NFL Owners for Not Drafting Shedeur Sanders in First Round: ‘PHENOMENAL GENES!’",
    "description": "President Donald Trump used his Truth Social account to berate NFL owners for not drafting Shedeur Sanders in the first round. Sanders is a quarterback who entered the draft after playing with the University of Colorado Buffaloes, where his father Deion Sande…",
    "link": "https://freerepublic.com/focus/f-chat/4313425/posts",
    "timestamp": "2025-04-26T17:12:30Z"
  },
  {
    "title": "Trump is aiming for big concessions on trade, Carney warns Canada voters",
    "description": "Mark Carney said he expects US President Donald Trump will try to extract “major concessions” from Canada in negotiations, and that he takes seriously the president’s stated desire to turn the country into a US state. \n“Take what the president says literally.…",
    "link": "https://biztoc.com/x/a4295caac84a6798",
    "timestamp": "2025-04-26T17:11:05Z"
  },
  {
    "title": "Who was at Pope Francis' funeral and where did they sit?",
    "description": "Numerous world leaders and royals have gathered in Rome for Pope Francis' funeral. Among the most prominent figures at the Vatican's St Peter's Square on Saturday morning were Prince William, US President Donald Trump and his predecessor Joe Biden, Britain's …",
    "link": "https://freerepublic.com/focus/f-news/4313424/posts",
    "timestamp": "2025-04-26T17:10:29Z"
  },
  {
    "title": "Trump and Zelensky meet one-on-one in Vatican basilica to seek Ukraine peace",
    "description": "Zelensky said the meeting could prove historic if it delivers the kind of peace he is hoping for, and a White House spokesperson called it \"very productive.\"",
    "link": "https://www.jpost.com/international/internationalrussia-ukraine-war/article-851611",
    "timestamp": "2025-04-26T17:09:42Z"
  },
  {
    "title": "Carney, Poilievre’s fate to be decided in these battlegrounds shaping Canada's next government",
    "description": "With Canada's election looming, ten key ridings are under the microscope, each telling a unique story of political drama. From tight races in Newfoundland and New Brunswick to high-stakes contests in Quebec and the GTA, these ridings could determine the next …",
    "link": "https://economictimes.indiatimes.com/news/international/canada/carney-poilievres-fate-to-be-decided-in-these-battlegrounds-shaping-canadas-next-government/articleshow/120650978.cms",
    "timestamp": "2025-04-26T17:06:20Z"
  },
  {
    "title": "Pope Francis’ Legacy Is Celebrated by Mourners at His Funeral: ‘His Tolerance and Humility Changed the Catholic Church’",
    "description": "“Pope Francis shifted attitudes. He has changed the church,\" says one mourner who stood outside the funeral proceedings.",
    "link": "https://time.com/7280693/pope-francis-funeral-legacy-celebrated-catholic-church-transformation/",
    "timestamp": "2025-04-26T17:01:58Z"
  },
  {
    "title": "Why Alabama’s Securities Commissioner Dropped Its Case Against Coinbase",
    "description": "Efforts in Congress to create a legislative framework for crypto were chief among the Commission's reasons for pulling back against Coinbase.",
    "link": "https://decrypt.co/316564/why-alabama-dropped-coinbase-case",
    "timestamp": "2025-04-26T17:01:02Z"
  },
  {
    "title": "Trump and Zelensky get first-row seats to Pope Francis’ funeral in surprise shift in Vatican rules",
    "description": "President Trump and Ukrainian President Volodymyr Zelensky managed to get front-row seats to Pope Francis' funeral in an apparent departure from the Vatican's arcane traditions.",
    "link": "https://nypost.com/2025/04/26/world-news/shift-in-vatican-protocol-lands-trump-zelensky-front-row-at-pope-francis-funeral/",
    "timestamp": "2025-04-26T17:00:30Z"
  }
]