[
  {
    "title": "Global May Day protests held against Trump tariffs, administration",
    "description": "Hundreds of thousands of people across the globe have held May Day protests opposing US President Donald Trump's agenda.",
    "link": "https://www.abc.net.au/news/2025-05-02/us-global-may-day-protests-against-donald-trump/105244034",
    "timestamp": "2025-05-02T03:45:55Z"
  },
  {
    "title": "China says it’s assessing US talks, hinting at possible thaw",
    "description": "China said it is assessing the possibility of trade talks with the US, the first sign since Donald Trump hiked tariffs last month that negotiations could begin between the two sides.",
    "link": "https://www.bangkokpost.com/business/general/3016180/china-says-its-assessing-us-talks-hinting-at-possible-thaw",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Trump vs Toyota? Why US cars are a rare sight in Japan",
    "description": "FUKAYA (JAPAN) - With their sleek curves and chrome grilles, the classic American cars on sale at Yosuke Fukuda's yard ooze Californian cool but on Japanese roads new US vehicles are a rare sight -- much to President Donald Trump's annoyance.",
    "link": "https://www.bangkokpost.com/business/general/3016157/trump-vs-toyota-why-us-cars-are-a-rare-sight-in-japan",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Backyard barnyard: rising egg prices prompt hen hires in US",
    "description": "LA CRESCENTA (UNITED STATES) - Stung by the rocketing price of eggs -- and US supermarkets rationing a basic breakfast staple -- Yong-mi Kim decided to get some chickens to secure her own supply in southern California.",
    "link": "https://www.bangkokpost.com/world/3016162/backyard-barnyard-rising-egg-prices-prompt-hen-hires-in-us",
    "timestamp": "2025-05-02T03:45:00Z"
  },
  {
    "title": "Vice President JD Vance Explains Mike Waltz's Removal As National Security Advisor—It's Not What You Think It Is",
    "description": "Former Army Special Forces officer and Republican Florida representative Mike Waltz was removed from his post as national security advisor to President Trump Thursday. The spin from the leftist media was immediately that he was fired over his role in the “Sig…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314546/posts",
    "timestamp": "2025-05-02T03:44:41Z"
  },
  {
    "title": "Trump signs executive order cutting PBS and NPR funding",
    "description": "President Trump signed an executive order aiming to slash public subsidies to PBS and NPR as he alleged \"bias\" in the broadcasters' reporting.",
    "link": "https://www.wcvb.com/article/trump-order-cuts-pbs-npr-funding/64649731",
    "timestamp": "2025-05-02T03:44:31Z"
  },
  {
    "title": "Trump signs executive order cutting PBS and NPR funding",
    "description": "President Trump signed an executive order aiming to slash public subsidies to PBS and NPR as he alleged \"bias\" in the broadcasters' reporting.",
    "link": "https://www.wmur.com/article/trump-order-cuts-pbs-npr-funding/64649731",
    "timestamp": "2025-05-02T03:44:06Z"
  },
  {
    "title": "Navigating the tariff storm: AUO's strategic response and the viability of US-based manufacturing",
    "description": "As the global supply chain continues to reel from the tariff war ignited by US President Donald Trump, Paul SL Peng, chairman of AUO, offers a measured analysis of the situation. He observes that, as panels are classified as components, tariffs have a relativ…",
    "link": "https://www.digitimes.com/news/a20250502PD205/auo-manufacturing-supply-chain-market-production.html",
    "timestamp": "2025-05-02T03:44:00Z"
  },
  {
    "title": "Microsoft Ditches Law Firm That Cut Deal With Trump — And Hires White House Adversary",
    "description": "Court documents showed Microsoft has hired Jenner & Block to replace Simpson Thacher in a lawsuit over its $69 billion purchase of Activision Blizzard.",
    "link": "https://www.huffpost.com/entry/microsoft-swaps-law-firms-trump_n_68143c2fe4b0c3c651ebb6a5",
    "timestamp": "2025-05-02T03:38:57Z"
  },
  {
    "title": "Jill Sobule, singer behind I Kissed A Girl and Supermodel, dead at 66",
    "description": "While best known for 90s hits 'Supermodel' and 'I Kissed A Girl', Jill Sobule's career spanned three decades, 12 albums and more.",
    "link": "https://www.abc.net.au/news/2025-05-02/jill-sobule-dead-obituary-i-kissed-a-girl/105243812",
    "timestamp": "2025-05-02T03:34:48Z"
  },
  {
    "title": "Asia’s Factories Suffer Major Blow as Trump’s Tariffs Hit Demand",
    "description": "Manufacturing activity across most of Asia contracted in April, with companies struggling with weaker demand and pausing new orders in the face of US President Donald Trump’s baseline 10% tariff.",
    "link": "https://financialpost.com/pmn/business-pmn/asias-factories-suffer-major-blow-as-trumps-tariffs-hit-demand",
    "timestamp": "2025-05-02T03:34:22Z"
  },
  {
    "title": "Supreme Court Justice Calls Out Trump Admin Attacks on Judges: 'Not Random'",
    "description": "Ketanji Brown Jackson said the attacks do not seem random and appear \"designed to intimidate.\"",
    "link": "https://www.newsweek.com/supreme-court-justice-ketanji-brown-jackson-rips-trump-attacks-judges-2067060",
    "timestamp": "2025-05-02T03:32:32Z"
  },
  {
    "title": "News Summary-Intelligence Report 5/1/2025*Newsdump Thursday*Israeli Air Attack In Damascus*US-Iran Talks Postponed Amid US Threats*Netanyahu Puts Military Victory Over Hostage Release*Court Rules Against South Korean Presidential Candidate*",
    "description": "A missile fired from Yemen intercepted before it could reach Israel... Russian air defenses confronting a major drone attack... Israeli Air Strike Near The Presidential Palace In Damascus Prime Minister Benjamin Netanyahu and Defense Minister Israel Katz sayi…",
    "link": "https://freerepublic.com/focus/f-bloggers/4314544/posts",
    "timestamp": "2025-05-02T03:31:32Z"
  },
  {
    "title": "What can Asian countries offer Trump in tariff negotiations?",
    "description": "TOKYO -- Asian economies are set to use imports of U.S. energy resources as leverage in negotiations with U.S. President Donald Trump to back down from his hefty \"reciprocal\" tariffs, but concessions in other areas like automobiles and agriculture could prove…",
    "link": "https://biztoc.com/x/84641e9eb6c0d4ed",
    "timestamp": "2025-05-02T03:30:53Z"
  },
  {
    "title": "Amazon CEO Andy Jassy Says Many Shoppers Are “Stocking Up” To Get Ahead Of Tariffs – Update",
    "description": "Amazon CEO Andy Jassy says some customers are “stocking up” in advance of widespread tariffs planned by President Donald Trump.\n“Obviously, none of us knows exactly where tariffs will settle, or when,” Jassy told Wall Street analysts on the tech giant’s first…",
    "link": "https://biztoc.com/x/230a463380f51ae1",
    "timestamp": "2025-05-02T03:30:53Z"
  },
  {
    "title": "Asian stocks gain after China teases US tariff talks",
    "description": "Asian markets largely rose Friday, tracking Wall Street gains, as China said it was considering a US offer to negotiate steep tariffs. US markets forged higher Thursday following strong results from tech giants Microsoft and Meta that helped offset lingering …",
    "link": "https://www.digitaljournal.com/world/asian-stocks-gain-after-china-teases-us-tariff-talks/article",
    "timestamp": "2025-05-02T03:27:32Z"
  },
  {
    "title": "Asian Stocks Gain After China Teases US Tariff Talks",
    "description": "Asian markets largely rose Friday, tracking Wall Street gains, as China said it was considering a US offer to negotiate steep tariffs.",
    "link": "https://www.ibtimes.com/asian-stocks-gain-after-china-teases-us-tariff-talks-3772219",
    "timestamp": "2025-05-02T03:27:21Z"
  },
  {
    "title": "China says it's evaluating US overtures for trade talks, but tariffs remain an obstacle",
    "description": "China's Commerce Ministry says Beijing is evaluating multiple approaches by the Trump administration for trade talks",
    "link": "https://abcnews.go.com/US/wireStory/china-evaluating-us-overtures-trade-talks-tariffs-remain-121384718",
    "timestamp": "2025-05-02T03:26:38Z"
  },
  {
    "title": "Amazon Braces for Tougher Business Climate Amid Trump Trade War",
    "description": "Amazon.com Inc. said it’s bracing for a tougher business climate in the coming months, echoing concerns from a range of companies that tariffs and related economic turmoil could crimp consumer spending.",
    "link": "https://www.livemint.com/companies/news/amazon-braces-for-tougher-business-climate-amid-trump-trade-war-11746156392504.html",
    "timestamp": "2025-05-02T03:26:32Z"
  },
  {
    "title": "China says assessing US proposals for talks to reduce tariffs",
    "description": "China considers engaging in talks with the US over tariffs after recent outreach, demanding sincerity and concrete actions from the US.",
    "link": "https://www.thehindubusinessline.com/news/world/china-says-assessing-us-proposals-for-talks-to-reduce-tariffs/article69529255.ece",
    "timestamp": "2025-05-02T03:24:35Z"
  },
  {
    "title": "Nebraska hospitals express concern over tariff-related price hikes",
    "description": "Potential price increases on essential items like syringes and medications, many of which come from China, are leaving hospitals concerned for the future.",
    "link": "https://www.klkntv.com/nebraska-hospitals-express-concern-over-tariff-related-price-hikes/",
    "timestamp": "2025-05-02T03:23:27Z"
  },
  {
    "title": "Microsoft raises Xbox prices globally, following Sony",
    "description": "Microsoft announced Thursday that it will increase Xbox console prices worldwide, citing \"market conditions\" just days after Sony made a similar move with its PlayStation 5. In mid-April, Sony announced price increases for several PlayStation 5 models in sele…",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-raises-xbox-prices-globally-following-sony/articleshow/120809783.cms",
    "timestamp": "2025-05-02T03:20:09Z"
  },
  {
    "title": "They love a parade: President Trump and U.S. Army to celebrate their June 14 birthdays",
    "description": "Plans for the parade include 6,000 soldiers, helicopters and armored vehicles, such as Strykers, Bradley Fighting Vehicles and possibly Abrams tanks.",
    "link": "https://www.usatoday.com/story/news/politics/2025/05/01/birthday-bash-president-donald-trump-and-army-plan-june-14-parade/83401058007/",
    "timestamp": "2025-05-02T03:19:27Z"
  },
  {
    "title": "Texas Lawmaker Urges US Government to Put Crypto ATMs in Federal Buildings",
    "description": "A Texas Republican pushes to install crypto ATMs in federal buildings, aiming to align with what they describe as part of \"Trump’s vision.\"",
    "link": "https://decrypt.co/317519/texas-lawmaker-government-crypto-atms-federal-buildings",
    "timestamp": "2025-05-02T03:18:42Z"
  },
  {
    "title": "Elon Musk, DOGE Team Reveal Which Agency Fought Them Hardest",
    "description": "Elon Musk and members of DOGE team appeared on Fox News Thursday and named the federal agency that resisted their oversight efforts most aggressively.",
    "link": "https://dailycaller.com/2025/05/01/elon-musk-doge-team-institute-peace-taliban/",
    "timestamp": "2025-05-02T03:16:36Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court to Strip Temporary Protected Status From 350,000 Venezuelan Migrants",
    "description": "The White House has moved aggressively to withdraw various protections that have allowed immigrants to remain in the country.",
    "link": "https://time.com/7282143/tps-temporary-protected-status-venezuelans-trump-supreme-court-immigration/",
    "timestamp": "2025-05-02T03:15:00Z"
  },
  {
    "title": "Tokyo's tariff envoy says US talks 'constructive'",
    "description": "WASHINGTON: Tokyo's envoy for United States tariff talks in Washington said on Thursday (May 1) that the second round of negotiations between the two countries had been \"frank and constructive\".",
    "link": "https://www.channelnewsasia.com/east-asia/japan-tokyo-tariff-envoy-us-talks-constructive-5104046",
    "timestamp": "2025-05-02T03:14:52Z"
  },
  {
    "title": "Trump Budget Seeks 23% Domestic Spending Cut, 13% Defense Hike",
    "description": "President Donald Trump is asking Congress for deep cuts to domestic agencies and a boost to the military in a preliminary outline of his 2026 budget request to be released Friday.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-budget-seeks-23-domestic-spending-cut-13-defense-hike",
    "timestamp": "2025-05-02T03:13:44Z"
  },
  {
    "title": "Trump Squeaks During Bizarre Weightlifting Reenactment: ‘Mom, I’m Gonna Do It’",
    "description": "President Donald Trump gave a college commencement address that was virtually indistinguishable from a rally speech on Thursday night. \nThe post Trump Squeaks During Bizarre Weightlifting Reenactment: ‘Mom, I’m Gonna Do It’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/tv/trump-squeaks-during-bizarre-weightlifting-reenactment-mom-im-gonna-do-it/",
    "timestamp": "2025-05-02T03:12:21Z"
  },
  {
    "title": "Oil prices rise as China says it's open for trade talks with US",
    "description": "Oil prices saw a boost in Asian trading following China's indication of openness to U.S. trade talks, fueling hopes for de-escalation. Brent crude rose to $62.51 a barrel, while U.S. WTI crude reached $59.62. President Trump's threat of sanctions on Iranian o…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-prices-rise-as-china-says-its-open-for-trade-talks-with-us/articleshow/120809330.cms",
    "timestamp": "2025-05-02T03:07:47Z"
  },
  {
    "title": "US blacklist on China is riddled with errors, outdated details",
    "description": "Doris Au, a seller of door locks and hardware in Hong Kong for 25 years, received a letter from her bank, DBS Group, last June stating that her business...",
    "link": "https://www.yahoo.com/news/us-blacklist-china-riddled-errors-030500525.html",
    "timestamp": "2025-05-02T03:05:00Z"
  },
  {
    "title": "China wants 'sincerity' as it evaluates tariff offer from the US",
    "description": "China's Commerce Ministry said it was evaluating an offer on tariff negotiations from the United States. It said it wanted to the US to show \"sincerity\" and not take unilateral measures. China's Commerce Ministry on Friday said it was \"currently evaluating\" a…",
    "link": "https://www.dw.com/en/china-wants-sincerity-as-it-evaluates-tariff-offer-from-the-us/a-72411501",
    "timestamp": "2025-05-02T03:04:00Z"
  },
  {
    "title": "Zelensky says minerals deal with US 'truly equal'",
    "description": "Ukrainian President Volodymyr Zelensky said Thursday a landmark minerals deal with the United States offered \"equal\" benefits for both sides even though the accord offered no concrete security guarantees for Kyiv. Ukraine hopes the deal will pave the way for …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-says-minerals-deal-with-us-truly-equal/articleshow/120809179.cms",
    "timestamp": "2025-05-02T03:03:51Z"
  },
  {
    "title": "Trump Mocks Real Estate Developer for Having ‘Trophy Wife’",
    "description": "President Donald Trump mocked the late New York real estate developer William Levitt for having a \"trophy wife\" on Thursday during a speech to graduates.\nThe post Trump Mocks Real Estate Developer for Having ‘Trophy Wife’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-mocks-real-estate-developer-for-having-trophy-wife/",
    "timestamp": "2025-05-02T03:03:50Z"
  },
  {
    "title": "Trump’s health agency urges therapy for transgender youth, not broader gender-affirming healthcare",
    "description": "President Donald Trump’s administration released a lengthy review of transgender health care on Thursday that advocates for a greater reliance on behavioral therapy rather than broad gender-affirming medical care for youths with gender dysphoria.",
    "link": "https://www.kolotv.com/2025/05/01/trumps-health-agency-urges-therapy-transgender-youth-not-broader-gender-affirming-healthcare/",
    "timestamp": "2025-05-02T03:00:54Z"
  },
  {
    "title": "China 'evaluating' US offer to negotiate tariffs; Beijing's door is 'open'",
    "description": "China considers Washington's offer for trade talks regarding Donald Trump's tariffs. The Commerce Ministry states Beijing is assessing the proposal. China demands the U.S. rectify its practices and remove tariffs. The U.S. expresses optimism for easing trade …",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-evaluating-us-offer-to-negotiate-tariffs-beijings-door-is-open/articleshow/120808975.cms",
    "timestamp": "2025-05-02T02:59:12Z"
  },
  {
    "title": "Plans for huge military parade on Trump's birthday emerge",
    "description": "Detailed plans for a large military parade on Donald Trump's birthday have emerged - involving thousands of soldiers as well as hundreds of tanks and helicopters.",
    "link": "https://news.sky.com/story/plans-for-huge-military-parade-on-donald-trumps-birthday-emerge-13359615",
    "timestamp": "2025-05-02T02:59:00Z"
  },
  {
    "title": "Donald Trump Shares 11 Pieces of Advice at Rally-Style Commencement Speech",
    "description": "Trump sprinkled in 11 pieces of advice at a commencement speech where he rehashed his talking points and grievances.",
    "link": "https://biztoc.com/x/d43bd1147f94f649",
    "timestamp": "2025-05-02T02:58:05Z"
  },
  {
    "title": "Trump vs Toyota? Why US cars are a rare sight in Japan",
    "description": "With their sleek curves and chrome grilles, the classic American cars on sale at Yosuke Fukuda’s yard ooze Californian cool but on Japanese roads new US vehicles are a rare sight — much to President Donald Trump’s annoyance. Japan’s Toyota is the second-top-s…",
    "link": "https://www.digitaljournal.com/world/trump-vs-toyota-why-us-cars-are-a-rare-sight-in-japan/article",
    "timestamp": "2025-05-02T02:57:32Z"
  },
  {
    "title": "Trump Vs Toyota? Why US Cars Are A Rare Sight In Japan",
    "description": "With their sleek curves and chrome grilles, the classic American cars on sale at Yosuke Fukuda's yard ooze Californian cool but on Japanese roads new US vehicles are a rare sight -- much to President Donald Trump's annoyance.",
    "link": "https://www.ibtimes.com.au/trump-vs-toyota-why-us-cars-are-rare-sight-japan-1858446",
    "timestamp": "2025-05-02T02:57:16Z"
  },
  {
    "title": "Trump Vs Toyota? Why US Cars Are A Rare Sight In Japan",
    "description": "With their sleek curves and chrome grilles, the classic American cars on sale at Yosuke Fukuda's yard ooze Californian cool but on Japanese roads new US vehicles are a rare sight -- much to President Donald Trump's annoyance.",
    "link": "https://www.ibtimes.com/trump-vs-toyota-why-us-cars-are-rare-sight-japan-3772215",
    "timestamp": "2025-05-02T02:57:11Z"
  },
  {
    "title": "Donald Trump Shares 11 Pieces of Advice at Rally-Style Commencement Speech",
    "description": "Trump sprinkled in 11 pieces of advice at a commencement speech where he rehashed his talking points and grievances.",
    "link": "https://www.newsweek.com/trump-advice-university-alabama-commencement-speech-2067054",
    "timestamp": "2025-05-02T02:55:23Z"
  },
  {
    "title": "Trump Plans Record $1.01 Trillion National Security Budget",
    "description": "President Donald Trump will request a record $1.01 trillion in national security spending for the fiscal year beginning Oct. 1, more than 13% over the current year’s figure, according to administration officials familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-plans-record-1-01-trillion-national-security-budget",
    "timestamp": "2025-05-02T02:48:16Z"
  },
  {
    "title": "China says it’s evaluating U.S. talks, hinting at possible thaw",
    "description": "China said it is assessing the possibility of trade talks with the U.S., the first sign since Donald Trump hiked tariffs last month that negotiations could begin between the two sides.\nChina’s Commerce Ministry said in a Friday statement that it had noted sen…",
    "link": "https://biztoc.com/x/efb6a8c20dae9415",
    "timestamp": "2025-05-02T02:47:20Z"
  },
  {
    "title": "Apple, Amazon, Reddit, Strategy, Block: Why These 5 Stocks Are On Investors' Radars Today",
    "description": "Wall Street experienced a positive momentum as the S&P 500 marked its eighth consecutive day of gains on Thursday, climbing 0.6% to 5,604.14. This rally helped the index recover from losses incurred due to trade tariffs announced by President Donald Trump. Th…",
    "link": "https://biztoc.com/x/8921739c2528a75e",
    "timestamp": "2025-05-02T02:46:55Z"
  },
  {
    "title": "At the edge of the world, French and Swedish warplanes deter Putin",
    "description": "Paris and Stockholm are deepening defense ties in missiles, air defense and even nuclear deterrence amid uncertainty caused by Donald Trump.",
    "link": "https://www.politico.eu/article/lulea-air-base-sweden-france-defense-nato-vladimir-putin-russia/",
    "timestamp": "2025-05-02T02:45:09Z"
  },
  {
    "title": "Apple warns of $900 million tariff hit, shifts supply chain to India and Vietnam",
    "description": "CEO Tim Cook said most iPhones sold in the U.S. this quarter will come from India, while iPads, Macs, and Apple Watches will be sourced from Vietnam",
    "link": "https://www.thehindubusinessline.com/info-tech/apple-warns-of-900-million-tariff-hit-shifts-supply-chain-to-india-and-vietnam/article69529214.ece",
    "timestamp": "2025-05-02T02:44:27Z"
  },
  {
    "title": "Donny 2 Dolls",
    "description": "Donny 2 Dolls is a catchphrase and nickname coined by MSNBC anchor Lawrence O'Donnell after Donald Trump gave a statement regarding the price of toys under",
    "link": "https://knowyourmeme.com/memes/donny-2-dolls",
    "timestamp": "2025-05-02T02:41:45Z"
  },
  {
    "title": "In DC Speech, Charles Koch Speaks of ‘the Mess’ He Sees the Country In",
    "description": "Charles Koch never uttered Donald Trump's name, but it was clear who was on his mind as he addressed a Cato Institute gala Thursday night.",
    "link": "https://time.com/7282130/charles-koch-speech-trump-tariffs/",
    "timestamp": "2025-05-02T02:41:26Z"
  },
  {
    "title": "Quebec refuses to reinvest in Lion Electric (busses); US factory auction",
    "description": "MONTREAL - The Quebec government says it is rethinking the pace of its plan to electrify the transportation sector and will not pump any more public money into vehicle maker",
    "link": "https://www.thecanadianpressnews.ca/politics/quebec-raises-doubts-about-electrification-as-it-refuses-to-reinvest-in-lion-electric/article_db74eea8-2ec8-5d06-b965-7ea97dd99751.html",
    "timestamp": "2025-05-02T02:39:39Z"
  },
  {
    "title": "Capitol agenda: Inside Trump's hesitation on Medicaid (Politico)",
    "description": "Politico:\nCapitol agenda: Inside Trump's hesitation on Medicaid  —  Make no mistake: Medicaid is at the center of the GOP's challenges as they try to assemble their “big, beautiful” bill.  And the problems start at the very top.  President Donald Trump is dee…",
    "link": "https://www.memeorandum.com/250501/p152",
    "timestamp": "2025-05-02T02:35:00Z"
  },
  {
    "title": "Fired DOJ Attorney Says Trump Pardons Cost $1 Billion",
    "description": "“Liz Oyer, the Justice Department’s recently fired pardon attorney, made a staggering claim on social media this week: President Donald Trump’s pardons of people convicted of white-collar crimes have cost Americans $1 billion,” the Washington Post reports.",
    "link": "https://politicalwire.com/2025/05/01/fired-doj-attorney-says-trump-pardons-cost-1-billion/",
    "timestamp": "2025-05-02T02:34:45Z"
  },
  {
    "title": "NJ father beaten to death defending daughter remembered as ‘invincible man’ and fun-loving flat-Earther: ‘The man, the myth, the legend’",
    "description": "\"The instant you met Gus, your life changed forever; you knew from that moment on you had someone in your corner no matter what. Gus didn't have typical friends; every friend was a 'best friend.'\"",
    "link": "https://nypost.com/2025/05/01/us-news/nj-father-beaten-to-death-defending-daughter-remembered-as-invincible-man-and-fun-loving-flat-earther-the-man-the-myth-the-legend/",
    "timestamp": "2025-05-02T02:32:52Z"
  },
  {
    "title": "Donald Trump’s campaign co-manager claims he secretly visited Australia to help with Liberal strategy ahead of election",
    "description": "Donald Trump’s campaign co-manager claims he secretly visited Australia to help with Liberal strategy ahead of election7news.com.au",
    "link": "https://7news.com.au/news/donald-trumps-campaign-co-manager-claims-he-secretly-visited-australia-to-help-with-liberal-strategy-ahead-of-election-c-18548353",
    "timestamp": "2025-05-02T02:30:44Z"
  },
  {
    "title": "Ketanji Brown Jackson Condemns Trump’s Attacks",
    "description": "“Justice Ketanji Brown Jackson forcefully condemned attacks by President Donald Trump and his allies on judges who have blocked Trump administration policies, warning Thursday that the increasingly hostile rhetoric poses a dire threat to the",
    "link": "https://politicalwire.com/2025/05/01/ketanji-brown-jackson-condemns-trumps-attacks/",
    "timestamp": "2025-05-02T02:28:45Z"
  },
  {
    "title": "Japan’s Kato says U.S. Treasury holdings could be negotiation card",
    "description": "The comments come amid negotiations between Japan and the U.S. after President Donald Trump ramped up his global tariff campaign.",
    "link": "https://biztoc.com/x/5da4d63fe9116ffd",
    "timestamp": "2025-05-02T02:25:07Z"
  },
  {
    "title": "Judge blocks Trump administration's library agency cuts",
    "description": "A federal judge has agreed to temporarily block the Trump administration from taking any more steps to dismantle an agency that funds and promotes libraries across the nation",
    "link": "https://www.wmur.com/article/judge-blocks-trump-dismantling-library-services-agency/64648793",
    "timestamp": "2025-05-02T02:24:12Z"
  },
  {
    "title": "Trump Says ‘Internet People’ Like Musk ‘All Hated Me’ and ‘Now They’re Kissing My Ass’",
    "description": "President Donald Trump bragged on Thursday that \"internet people\" like billionaire Elon Musk were now all \"kissing\" his \"ass.\"\nThe post Trump Says ‘Internet People’ Like Musk ‘All Hated Me’ and ‘Now They’re Kissing My Ass’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/trump-says-internet-people-like-musk-all-hated-me-and-now-theyre-kissing-my-ass/",
    "timestamp": "2025-05-02T02:23:28Z"
  },
  {
    "title": "Trump wants voters to prove citizenship. Arizona tried that and bungled it.",
    "description": "The state requires voters to prove their citizenship. An error led to chaos, suspicion and confusion, signaling broader challenges for Republican-led efforts across the country.PHOENIX — For 30 years, no one questioned Danny Dobosz’s citizenship when the life…",
    "link": "https://freerepublic.com/focus/f-news/4314541/posts",
    "timestamp": "2025-05-02T02:22:49Z"
  },
  {
    "title": "Mike Waltz Ouster Shines Spotlight on Pete Hegseth",
    "description": "Waltz was removed from his position as national security adviser and then nominated by Trump to serve as UN ambassador.",
    "link": "https://www.newsweek.com/mike-waltz-ouster-shines-spotlight-pete-hegseth-2067051",
    "timestamp": "2025-05-02T02:20:30Z"
  },
  {
    "title": "Watch Democratic Rep Deflect When Asked If Party Answers Middle-Class Concerns",
    "description": "Democrat Massachusetts Rep. Jake Auchincloss attempted to list his party’s successes, before admitting there was more Dems could address.",
    "link": "https://dailycaller.com/2025/05/01/demcorat-jake-auchinloss-party-voters-laura-ingraham/",
    "timestamp": "2025-05-02T02:19:46Z"
  },
  {
    "title": "China says it’s evaluating possible trade talks with the US amid tariff war",
    "description": "China says it is “currently assessing” proposals by the United States to begin trade talks, in a tone shift that could open the door for negotiations.",
    "link": "https://www.cnn.com/2025/05/01/business/china-possible-trade-talks-us-tariffs-intl-hnk",
    "timestamp": "2025-05-02T02:12:25Z"
  },
  {
    "title": "China says it is ‘evaluating’ Trump administration’s outreach on tariffs",
    "description": "Ministry of Commerce says 'door is open' to talks, but it is willing to 'fight to the end' otherwise.",
    "link": "https://www.aljazeera.com/news/2025/5/2/china-says-it-is-considering-trump-administrations-outreach-on-tariffs",
    "timestamp": "2025-05-02T02:11:34Z"
  },
  {
    "title": "'Magazine' established only this year spent $400k attacking Liberals",
    "description": "Hothouse Magazine has spent more than $400,000 on political Meta ads since February. Analysis shows that over 30 days it mostly targeted postcodes in seats with Climate 200-supported independent candidates.",
    "link": "https://www.abc.net.au/news/2025-05-02/hothouse-magazine-meta-advertisements/105239870",
    "timestamp": "2025-05-02T02:08:49Z"
  },
  {
    "title": "'Lies!' GOP senator lashes out after stinging ad hits airwaves in Trump's backyard",
    "description": "Sen. John Cornyn (R-TX) is firing back after his 2026 primary opponent slammed his record in a new TV ad that aired not in the Lone Star State, but in President Donald Trump’s backyard. The ad, funded by Preserving Texas, a group supporting Texas Attorney Gen…",
    "link": "https://www.rawstory.com/trump-endorsement-2671879847/",
    "timestamp": "2025-05-02T02:07:22Z"
  },
  {
    "title": "Trump tells University of Alabama graduates not to be a 'victim,' says in America 'we reject that idea'",
    "description": "President Trump spoke at the University of Alabama Thursday evening where he touted his political agenda, but also focused on advice for students urging them not to be a \"victim\" after they graduate.",
    "link": "https://www.foxnews.com/politics/trump-tells-university-alabama-graduates-not-victim-urges-them-beat-odds",
    "timestamp": "2025-05-02T02:06:51Z"
  },
  {
    "title": "US ready to spend another 100 days on Russia-Ukraine peace – Vance",
    "description": "The US stays determined to end the Russia-Ukraine conflict, Vice President J.D. Vance has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/616648-us-100-days-ukraine-peace/",
    "timestamp": "2025-05-02T02:06:23Z"
  },
  {
    "title": "US to end shipping loophole for Chinese goods Friday",
    "description": "WASHINGTON - The United States is set to end tariff exemptions on Friday for goods shipped from China worth less than $800, a move which could have significant ramifications on consumers' purchasing habits.",
    "link": "https://www.bangkokpost.com/business/general/3016115/us-to-end-shipping-loophole-for-chinese-goods-friday",
    "timestamp": "2025-05-02T02:05:00Z"
  },
  {
    "title": "McDonald's sales drop as diners face 'uncertainty'",
    "description": "The burger chain says its US customers are \"grappling with uncertainty\".",
    "link": "https://www.bbc.com/news/articles/cy4vzpggkjno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-05-02T02:03:03Z"
  },
  {
    "title": "Apple Tops Wall Street's Profit Expectations but Tariff Fears Still Loom",
    "description": "Apple's profit increased by 4.8% to $24.78 billion. Sales also rose by 5% to $95.36 billion. Tim Cook navigated tariff challenges. He also shifted production to India and Vietnam. iPhone sales increased in Japan, India, and the Middle East. However, sales dec…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apple-tops-wall-streets-profit-expectations-but-tariff-fears-still-loom/articleshow/120807704.cms",
    "timestamp": "2025-05-02T02:01:49Z"
  },
  {
    "title": "AP Obtains Plans for Massive Military Parade on Trump’s Birthday",
    "description": "The Associated Press obtained plans for a celebration of the U.S. Army's 250th anniversary on President Donald Trump's birthday, complete with helicopters and thousands of soldiers.\nThe post AP Obtains Plans for Massive Military Parade on Trump’s Birthday fir…",
    "link": "https://www.mediaite.com/trump/ap-obtains-plans-for-massive-military-parade-on-trumps-birthday/",
    "timestamp": "2025-05-02T02:01:39Z"
  },
  {
    "title": "Welcome to the Palantir World Order",
    "description": "As Palantir’s stock rises and their profile in the 2nd Trump administration is cemented, it’s becoming clear we are living in the Palantir World Order. How does a company with CIA ties and two steering committee members of the secretive Bilderberg Group as fo…",
    "link": "https://www.activistpost.com/welcome-to-the-palantir-world-order/",
    "timestamp": "2025-05-02T02:01:00Z"
  },
  {
    "title": "How Trump transformed Europe in just 100 days",
    "description": "After 100 days of U.S. President Donald Trump’s shock and awe, is the EU still stuck in stunned paralysis — or does it finally have a plan?  POLITICO trade reporter Camille Gijs, tech reporter Eliza Gkritsi, defense editor Jan Cienski and senior climate corre…",
    "link": "https://www.politico.eu/podcast/eu-confidential/how-trump-transformed-europe-in-just-100-days/",
    "timestamp": "2025-05-02T02:00:00Z"
  },
  {
    "title": "Japan says its $1 trillion in US Treasuries is among tools for trade talks",
    "description": "Japanese Finance Minister Katsunobu Kato suggested Japan might use its massive U.S. Treasury holdings as leverage in trade negotiations with the United States, a shift from his previous stance. This comes as trade talks continue amidst market volatility and U…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-says-its-1-trillion-in-us-treasuries-is-among-tools-for-trade-talks/articleshow/120807684.cms",
    "timestamp": "2025-05-02T01:58:31Z"
  },
  {
    "title": "Amazon cloud revenue, income forecast disappoint, shares slide",
    "description": "Amazon reported weaker-than-expected cloud growth, with AWS revenue up 16.9% to $29.27 billion, missing forecasts. Operating income guidance also fell short, disappointing investors. Tariff concerns loom, though retail demand remains stable. Total revenue rea…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/amazon-cloud-revenue-income-forecast-disappoint-shares-slide/articleshow/120807683.cms",
    "timestamp": "2025-05-02T01:58:07Z"
  },
  {
    "title": "Trump administration discontinues $1 billion in school mental health grants - NewsBreak",
    "description": "The Trump administration will not renew Biden-era grants worth $1 billion that were aimed at boosting mental health services in schools, a Department of E",
    "link": "https://www.newsbreak.com/share/3987831392442-trump-administration-discontinues-1-billion-in-school-mental-health-grants?_f=app_share&amp;pd=05jRa00W&amp;lang=en_US&amp;send_time=1746151051&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.18.0.43%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q2-v5%2Cns_foryou_model_exp_25q2_v2-v4%2Cns_foryou_rank_exp_25q2-v6%2Cns_foryou_recall_exp_25q2-v8%2Cns_local_strategy_25q1_exp-v18&amp;s=i2",
    "timestamp": "2025-05-02T01:57:59Z"
  },
  {
    "title": "‘You’re Not Too Young’: Trump’s 10 Pieces of Advice for Alabama Graduates",
    "description": "TUSCALOOSA, Alabama—President Donald Trump has ten pieces of advice for 2025 college graduates, who he said “have a chance to be the greatest generation in... Read More\nThe post ‘You’re Not Too Young’: Trump’s 10 Pieces of Advice for Alabama Graduates appeare…",
    "link": "https://www.dailysignal.com/2025/05/01/youre-not-too-young-trumps-10-pieces-of-advice-for-alabama-graduates/",
    "timestamp": "2025-05-02T01:57:51Z"
  },
  {
    "title": "Japan, U.S. ministers to hold intense tariff talks around mid-May",
    "description": "Japan and the United States made &quot;progress&quot; in tariff talks Thursday and agreed to hold intense ministerial-level discussions in or after mid-May with the aim of reaching a mutually beneficial deal at an early date, Japan's chief negotiator Ryosei A…",
    "link": "https://japantoday.com/category/politics/Japan-U.S.-to-hold-intense-tariff-talks-around-mid-May",
    "timestamp": "2025-05-02T01:57:34Z"
  },
  {
    "title": "Backyard barnyard: rising egg prices prompt hen hires in US",
    "description": "Stung by the rocketing price of eggs — and US supermarkets rationing a basic breakfast staple — Yong-mi Kim decided to get some chickens to secure her own supply in southern California. While many people idly muse about backyard farming, for those not ready t…",
    "link": "https://www.digitaljournal.com/world/backyard-barnyard-rising-egg-prices-prompt-hen-hires-in-us/article",
    "timestamp": "2025-05-02T01:57:32Z"
  },
  {
    "title": "Backyard Barnyard: Rising Egg Prices Prompt Hen Hires In US",
    "description": "Stung by the rocketing price of eggs -- and US supermarkets rationing a basic breakfast staple -- Yong-mi Kim decided to get some chickens to secure her own supply in southern California.",
    "link": "https://www.ibtimes.com/backyard-barnyard-rising-egg-prices-prompt-hen-hires-us-3772214",
    "timestamp": "2025-05-02T01:57:14Z"
  },
  {
    "title": "\"Pak, To Extent They're Responsible...\": JD Vance On Tracking Pahalgam Terrorists",
    "description": "Last month, JD Vance called Prime Minister Narendra Modi and strongly condemned the Pahalgam terror attack and conveyed his deepest condolences on the loss of lives.",
    "link": "https://www.ndtv.com/world-news/jd-vance-to-india-on-reply-to-pakistan-over-jammu-and-kashmir-pahalgam-terror-attack-avoid-regional-war-8308934",
    "timestamp": "2025-05-02T01:57:12Z"
  },
  {
    "title": "Backyard Barnyard: Rising Egg Prices Prompt Hen Hires In US",
    "description": "Stung by the rocketing price of eggs -- and US supermarkets rationing a basic breakfast staple -- Yong-mi Kim decided to get some chickens to secure her own supply in southern California.",
    "link": "https://www.ibtimes.com.au/backyard-barnyard-rising-egg-prices-prompt-hen-hires-us-1858444",
    "timestamp": "2025-05-02T01:57:08Z"
  },
  {
    "title": "Masked protesters attack Socialists in France...",
    "description": "Masked protesters attack Socialists in France...\r\n\n \n \n \n (Top headline, 2nd story, link)\r\n\n \r\n\n \r\n\n \n Related stories:May Day demonstrations in US and around globe...\r\nCuba stages mass rally to denounce sanctions...\r\nPolice arrest more than 400 in Istanbul...",
    "link": "https://www.yahoo.com/news/300-000-rally-across-france-165949102.html",
    "timestamp": "2025-05-02T01:55:36Z"
  },
  {
    "title": "CNN Data Chief Has ‘Major Wake-Up Call’ For Democrats Over Shock Trump Poll Results",
    "description": "Harry Enten said Democrats shouldn't get too comfortable with Trump's low approval rating because of these results.",
    "link": "https://www.huffpost.com/entry/cnn-harry-enten-trump-harris-better-job_n_68140690e4b0f2e8a510c615",
    "timestamp": "2025-05-02T01:54:49Z"
  },
  {
    "title": "Donald Trump says he will impose secondary sanctions on buyers of Iran’s oil - Financial Times",
    "description": "Donald Trump says he will impose secondary sanctions on buyers of Iran’s oilFinancial Times Trump says any country that buys oil from Iran will not be allowed to do any business with U.S.CNBC Trump threatens sanctions on countries that buy oil from IranThe Hi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177249225",
    "timestamp": "2025-05-02T01:52:21Z"
  },
  {
    "title": "De minimis: US small parcels loophole set to close pushing up prices for Shein and Temu",
    "description": "US small parcels loophole set to close, pushing up prices at Shein and Temu\nA duty-free loophole for low-value packages is about to be closed by President Donald Trump, pushing up prices for US customers of firms like Shein and Temu.\nThe Chinese online retail…",
    "link": "https://biztoc.com/x/dcaeb8b50fd15e31",
    "timestamp": "2025-05-02T01:52:01Z"
  },
  {
    "title": "Trump hails Alabama graduating class as first of the ‘Golden Age’ in commencement speech: ‘Chance to be greatest generation’",
    "description": "The president touted his historic first three months back in the White House as a beacon of what the future has in store.",
    "link": "https://nypost.com/2025/05/01/us-news/trump-hails-alabama-class-in-commencement-speech/",
    "timestamp": "2025-05-02T01:52:00Z"
  },
  {
    "title": "PM Modi has our full support, in constant touch with India, Pakistan: US on Pahalgam terror attack",
    "description": "The US State Department affirmed Prime Minister Modi has the Trump administration's full support following the Pahalgam terror attack. The US is closely monitoring the situation and is in constant communication with India and Pakistan. The US Secretary encour…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-has-our-full-support-in-constant-touch-with-india-pakistan-us-on-pahalgam-terror-attack/articleshow/120807644.cms",
    "timestamp": "2025-05-02T01:49:33Z"
  },
  {
    "title": "Ex-Trump Aide Warns White House May Not Be 'Prepared' For Key Policy Fallout",
    "description": "Alyssa Farah Griffin explained how the Trump administration's messaging has been a \"disaster\" on this topic.",
    "link": "https://www.huffpost.com/entry/alyssa-farah-griffin-trump-white-house-tariffs-hardships_n_6813f8bae4b0f2e8a510c3a9",
    "timestamp": "2025-05-02T01:43:33Z"
  },
  {
    "title": "Gold set for worst week in more than 2 months; US jobs data eyed",
    "description": "Gold prices are set to decline this week. Trade tension ease is the primary reason. Market focus is now on the U.S. non-farm payrolls report. The United States wants to talk with China about tariffs. Donald Trump has appointed Marco Rubio as interim national …",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-set-for-worst-week-in-more-than-2-months-us-jobs-data-eyed/articleshow/120807598.cms",
    "timestamp": "2025-05-02T01:43:22Z"
  },
  {
    "title": "AP: Army Plans For A Potential Parade On Trump's Birthday Call For 6,600 Soldiers",
    "description": "Detailed Army plans for a potential military parade on President Donald Trump’s birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and potentially a couple thousand civilians.",
    "link": "https://www.huffpost.com/entry/trump-birthday-military-parade_n_68141e7ee4b0fe32871bb6ea",
    "timestamp": "2025-05-02T01:41:57Z"
  },
  {
    "title": "Trump to propose slashing over $163 billion in non-defense programs in budget, WSJ reports",
    "description": "US President Donald Trump is expected to propose over $160 billion worth of cuts in environmental, renewable e",
    "link": "https://www.jpost.com/breaking-news/article-852334",
    "timestamp": "2025-05-02T01:40:34Z"
  },
  {
    "title": "Apple, Amazon shares slip after hours; tech shares jump earlier",
    "description": "Apple and Amazon shares dipped in after-hours trading following disappointing forecasts related to tariffs and cloud revenue growth, respectively. Despite this, U.S. tech stocks, fueled by strong results from Microsoft and Meta Platforms, experienced gains du…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/apple-amazon-shares-slip-after-hours-tech-shares-jump-earlier/articleshow/120807578.cms",
    "timestamp": "2025-05-02T01:39:55Z"
  },
  {
    "title": "Trump mocks trans athletes in women's sports to roaring applause at Alabama commencement speech",
    "description": "President Donald Trump mocked Democrats for allowing trans athletes in women's sports and the trans athletes themselves at an Alabama commencement",
    "link": "https://www.foxnews.com/sports/alabama-graduates-explode-applause-when-trump-promises-keep-men-out-womens-sports",
    "timestamp": "2025-05-02T01:37:52Z"
  },
  {
    "title": "iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs",
    "description": "Apple says devices sold in the US will no longer come from China, as the tech giant tries to mitigate the impact of Donald Trump's tariffs.",
    "link": "https://news.sky.com/story/iphones-sold-in-us-will-no-longer-come-from-china-as-apple-reveals-impact-of-trumps-tariffs-13359607",
    "timestamp": "2025-05-02T01:37:00Z"
  },
  {
    "title": "Fired DOJ attorney says on TikTok that Trump pardons cost $1 billion (Washington Post)",
    "description": "Washington Post:\nFired DOJ attorney says on TikTok that Trump pardons cost $1 billion  —  Liz Oyer says Americans lost out on restitution because President Donald Trump sidestepped the usual clemency process to pardon allies.  —  Liz Oyer, the Justice Departm…",
    "link": "https://www.memeorandum.com/250501/p149",
    "timestamp": "2025-05-02T01:35:00Z"
  },
  {
    "title": "May Day protests in Alaska seek to send message to Trump Administration",
    "description": "In another wave of statewide protests, Alaskans demonstrated their political discontent on May Day.",
    "link": "https://www.alaskasnewssource.com/2025/05/02/may-day-protests-alaska-seek-send-message-trump-administration/",
    "timestamp": "2025-05-02T01:34:38Z"
  },
  {
    "title": "Trump claps back at courts for 'interfering' with job, asks 'how you can give due process' to illegal migrants",
    "description": "During a special commencement address to students at the University of Alabama President Donald Trump rebuked judges who he said were \"interfering\" with his efforts to do his job as president.",
    "link": "https://www.foxnews.com/politics/trump-claps-back-courts-interfering-job-asks-how-you-can-give-due-process-illegal-aliens",
    "timestamp": "2025-05-02T01:34:03Z"
  }
]