[
  {
    "title": "'Terror attack averted': RPG with launcher seized in Amritsar district, 2 with ISI link held",
    "description": "Amritsar Rural police arrested two individuals, Mehakdeep Singh and Aditya, recovering a rocket-propelled grenade (RPG) and launcher. The duo was allegedly in contact with a Pakistan-based ISI operative and a jailed associate, planning a targeted terror attac…",
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/2-held-rpg-recovered-from-amritsar/articleshow/124721859.cms",
    "timestamp": "2025-10-22T05:32:57Z"
  },
  {
    "title": "Why no Sarfaraz Khan in India A squad? FC average of over 100 in last five years but still ignored",
    "description": "Mumbai cricketers Sarfaraz Khan and Ayush Mhatre faced contrasting fortunes as India A squads were announced. Sarfaraz Khan was surprisingly ignored despite a strong domestic record, while 18-year-old Ayush Mhatre earned a fast-track call-up despite an ordina…",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/why-no-sarfaraz-khan-in-india-a-squad-fc-average-of-over-100-in-last-five-years-but-still-ignored/articleshow/124734066.cms",
    "timestamp": "2025-10-22T05:30:41Z"
  },
  {
    "title": "Asian shares slip on selling of tech stocks after a lackluster day on Wall Street",
    "description": "Asian shares were mostly lower Wednesday on selling of technology shares following a lackluster day on Wall Street.  U.S. futures edged higher, while crude...",
    "link": "https://finance.yahoo.com/news/asian-shares-slip-selling-tech-053014635.html",
    "timestamp": "2025-10-22T05:30:14Z"
  },
  {
    "title": "CNBC's UK Exchange newsletter: Curtain falls on the era of big UK conglomerates",
    "description": "Smiths Group, the FTSE-100 engineering conglomerate, announced that it would be demerging or selling some of its companies, marking the end of an era.",
    "link": "https://www.cnbc.com/2025/10/22/cnbcs-uk-exchange-newsletter-curtain-falls-on-the-era-of-big-uk-conglomerates.html",
    "timestamp": "2025-10-22T05:30:01Z"
  },
  {
    "title": "Japan's exports and imports grow in September despite Trump's tariffs",
    "description": "Japan’s exports grew 4.2% in September, according to government data, on robust shipments to Asia that offset the decline to those destined for the U.S., which were impacted by President Donald Trump’s tariffs. The Ministry of Finance reported Wednesday that …",
    "link": "https://apnews.com/article/japan-trade-economy-trump-tariffs-takaichi-021b347db0cd35bc74317642c9974e60",
    "timestamp": "2025-10-22T05:27:18Z"
  },
  {
    "title": "Huge drone, missile attack on Ukraine’s capital kills at least 2, officials say",
    "description": "Ukrainian officials say Russia launched a massive drone and missile attack on Ukraine’s capital, killing at least two people",
    "link": "https://abcnews.go.com/International/wireStory/massive-drone-missile-attack-ukraines-capital-kills-2-126746098",
    "timestamp": "2025-10-22T05:26:57Z"
  },
  {
    "title": "Trump Admin Set to Break Deportation Record in First Year: ‘Just the Beginning.’",
    "description": "PULSE POINTS❓WHAT HAPPENED: Over 515,000 illegal aliens have been deported since President Donald J. Trump returned to the White House in January, with the administration on track to break deportation records.WHO WAS INVOLVED: President Trump, Department of…",
    "link": "https://freerepublic.com/focus/f-news/4347894/posts",
    "timestamp": "2025-10-22T05:21:11Z"
  },
  {
    "title": "North Carolina GOP poised to redraw House map, aims to secure another seat for Trump",
    "description": "North Carolina Republican leaders are almost complete with redrawing the state's U.S. House map to help the GOP gain another seat",
    "link": "https://abcnews.go.com/Politics/wireStory/north-carolina-gop-poised-redraw-house-map-aiming-126745544",
    "timestamp": "2025-10-22T05:20:52Z"
  },
  {
    "title": "Late Night Open Thread: Defacing the White House",
    "description": "New 20 just dropped to commemorate the Trump presidency [image or embed] — Devin Nunes' Alt-Mom (@nunesalt.bsky.social) October 21, 2025 at 12:09 AM === The White House is asking people not to share pictures of the East Wing because it’s even worse today. [im…",
    "link": "https://balloon-juice.com/2025/10/22/late-night-open-thread-defacing-the-white-house/",
    "timestamp": "2025-10-22T05:20:18Z"
  },
  {
    "title": "Stephen Colbert Rips Into Trump Over Demolition for New Ballroom: ‘He’s Going Hulk Smash on the White House’ | Video",
    "description": "\"Should we even believe that this is going to end up being a ballroom? It could just as easily end up being a combination Pizza Hut, Taco Bell,\" the comedian quips\nThe post Stephen Colbert Rips Into Trump Over Demolition for New Ballroom: ‘He’s Going Hulk Sma…",
    "link": "https://www.thewrap.com/stephen-colbert-trump-ballroom-white-house-demolition-criticism/",
    "timestamp": "2025-10-22T05:18:56Z"
  },
  {
    "title": "'You Know You're Racist When': Michael Kosta Nails Trump Nominee Over 'Nazi' Texts",
    "description": "The \"Daily Show\" correspondent declared that Paul Ingrassia's leaked texts displayed less of a \"Nazi streak\" and more of a Nazi \"lifestyle.\"",
    "link": "https://www.huffpost.com/entry/daily-show-michael-kosta-trump-paul-ingrassia-racist-text_n_68f84d93e4b02abf9d452c09",
    "timestamp": "2025-10-22T05:13:28Z"
  },
  {
    "title": "Oil rises more than 1% on supply risk, US-China trade talks",
    "description": "Oil prices pushed higher for a second day on Wednesday, by more than 1%, buoyed by sanctions-related supply risk and hope of a US-China trade deal while investors also digested news of the U.S. seeking oil for delivery to its strategic reserves.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/oil-rises-more-than-1-on-supply-risk-us-china-trade-talks/article70188776.ece",
    "timestamp": "2025-10-22T05:11:43Z"
  },
  {
    "title": "North Carolina GOP poised to redraw House map, aiming to secure another seat for Trump",
    "description": "North Carolina Republican leaders are almost complete with redrawing the state's U.S. House map to help the GOP gain another seat",
    "link": "https://abcnews.go.com/US/wireStory/north-carolina-gop-poised-redraw-house-map-aiming-126745534",
    "timestamp": "2025-10-22T05:01:50Z"
  },
  {
    "title": "UK and Scottish governments dispute £26m cost of Trump and Vance visits",
    "description": "Finance Secretary Shona Robison is seeking to recoup the costs of policing the summer visits.",
    "link": "https://www.bbc.com/news/articles/c051mzgyq2vo",
    "timestamp": "2025-10-22T05:00:15Z"
  },
  {
    "title": "What exactly does Vladimir Putin hold over the cowardly Donald Trump?",
    "description": "And what has Russian leader said or threatened to prompt US president’s volte-face on Ukraine?",
    "link": "https://www.irishtimes.com/opinion/2025/10/22/what-exactly-does-vladimir-putin-hold-over-the-cowardly-donald-trump/",
    "timestamp": "2025-10-22T05:00:01Z"
  },
  {
    "title": "\"Fast, furious and brutal\": Trump warns Hamas could be 'put out in two minutes' if they violate ceasefire",
    "description": "President Donald Trump stated Hamas is violent and could be removed quickly. He emphasized ongoing peace efforts in the Middle East. Trump warned Hamas to uphold the ceasefire agreement. He mentioned allies are ready to act if Hamas violates the deal. Israel …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/fast-furious-and-brutal-trump-warns-hamas-could-be-put-out-in-two-minutes-if-they-violate-ceasefire/articleshow/124733711.cms",
    "timestamp": "2025-10-22T04:59:34Z"
  },
  {
    "title": "India to reduce Russian oil purchases, U.S. to slash tariffs as they reportedly near a trade deal",
    "description": "The India-U.S. trade talks collapsed earlier this year with New Delhi not agreeing to widen market access into its vast agricultural and dairy sectors.",
    "link": "https://www.cnbc.com/2025/10/22/india-us-trade-tariff-cuts-reduced-russian-oil-purchases.html",
    "timestamp": "2025-10-22T04:58:04Z"
  },
  {
    "title": "Gold prices extend fall after posting sharpest drop since 2020 on easing U.S.-China trade tensions. What’s next for investors?",
    "description": "Gold prices extended their decline after a record-setting rally, slipping as traders booked profits and optimism grew over U.S.-China trade relations. Despite the selloff, gold remains one of 2025’s top-performing assets. Analysts expect domestic prices to op…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-prices-extend-fall-after-posting-sharpest-drop-since-2020-on-easing-u-s-china-trade-tensions-whats-next-for-investors/articleshow/124733659.cms",
    "timestamp": "2025-10-22T04:56:07Z"
  },
  {
    "title": "Trump administration plans new probe into global drug pricing, FT reports",
    "description": "() -President Donald Trump's administration is preparing a new probe into drug pricing practices among U. trading partners, a move that would lay the ground ...",
    "link": "https://www.yahoo.com/news/articles/trump-administration-plans-probe-global-045302510.html",
    "timestamp": "2025-10-22T04:53:02Z"
  },
  {
    "title": "Abby Phillip Drops Brutal Response on Scott Jennings’ Claim That Trump’s Approval Rating Is Up: ‘Still Deeply Underwater…56 to 42’",
    "description": "CNN NewsNight host Abby Phillip added some humorous context to Scott Jennings' claim that President Donald Trump's approval rating has risen.\nThe post Abby Phillip Drops Brutal Response on Scott Jennings’ Claim That Trump’s Approval Rating Is Up: ‘Still Deepl…",
    "link": "https://www.mediaite.com/media/tv/abby-phillip-drops-brutal-response-on-scott-jennings-claim-that-trumps-approval-rating-is-up-still-deeply-underwater-56-to-42/",
    "timestamp": "2025-10-22T04:49:02Z"
  },
  {
    "title": "Prince Andrew latest: Andrew told to leave public life for ever after embarrassing royal family",
    "description": "Virginia Giuffre book makes 88 references to King’s brother as scandal develops, prompting royal family to believe ‘action needed’",
    "link": "https://www.the-independent.com/news/uk/home-news/prince-andrew-virginia-giuffre-latest-news-b2849760.html",
    "timestamp": "2025-10-22T04:45:14Z"
  },
  {
    "title": "Trump again says PM Modi agreed to ease Russian energy buys",
    "description": "In recent weeks, Trump has softened his rhetoric as the two nations carry out talks to clinch a trade deal and lower tariffs.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-21/trump-says-he-spoke-to-modi-india-will-ease-russian-oil-buys",
    "timestamp": "2025-10-22T04:43:36Z"
  },
  {
    "title": "‘Hot Girls For Cuomo’ Website Leads to Sexual Harassment Report After Pro-Andrew Cuomo Influencer Forgets to Buy Domain",
    "description": "The social media influencer behind \"Hot Girls For Cuomo\" found herself outmanoeuvred after someone swooped in to purchase the website.\nThe post ‘Hot Girls For Cuomo’ Website Leads to Sexual Harassment Report After Pro-Andrew Cuomo Influencer Forgets to Buy Do…",
    "link": "https://www.mediaite.com/politics/hot-girls-for-cuomo-website-leads-to-sexual-harassment-report-after-pro-andrew-cuomo-influencer-forgets-to-buy-domain/",
    "timestamp": "2025-10-22T04:41:25Z"
  },
  {
    "title": "Trump pick to lead federal watchdog agency withdraws after offensive text messages were revealed",
    "description": "Paul Ingrassia, who was nominated to lead the Office of Special Counsel, had been scheduled to have his confirmation hearing this week.",
    "link": "https://www.wpxi.com/news/local/trump-pick-lead-federal-watchdog-agency-withdraws-after-offensive-text-messages-were-revealed/UD5TWXZR2VFNDOQEC546QMGR2A/",
    "timestamp": "2025-10-22T04:41:03Z"
  },
  {
    "title": "Hamas must be destroyed, and only Israel has the guts to do it",
    "description": "Phase 2 of the Mideast peace plan was never intended to be so amorphous as to allow Hamas to do as it pleases. Opinion.",
    "link": "https://www.israelnationalnews.com/news/416615",
    "timestamp": "2025-10-22T04:40:00Z"
  },
  {
    "title": "India's Cup of hope or cup of despair? Harmanpreet Kaur & Co. need to get their act right",
    "description": "Cricket News: Finishing, power-hitting and death Bowling are areas in which Harmanpreet & Co. need to improve if they have to qualify for Women's World Cup semis.",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/indias-cup-of-hope-or-cup-of-despair-harmanpreet-kaur-co-need-to-get-their-act-right/articleshow/124733368.cms",
    "timestamp": "2025-10-22T04:39:14Z"
  },
  {
    "title": "Bitcoin OG, Who Profited from Trump’s China Tariffs, Now Holds $234M in BTC Short Position: Arkham",
    "description": "BTC has pulled back sharply from Tuesday's high of around $114,000.",
    "link": "https://www.coindesk.com/markets/2025/10/22/bitcoin-og-who-profited-from-trump-s-china-tariffs-now-holds-usd234m-in-btc-short-position-arkham",
    "timestamp": "2025-10-22T04:38:08Z"
  },
  {
    "title": "US right-wing media figures, tech pioneers call for superintelligent AI ban",
    "description": "A group including tech experts and right-wing figures like Steve Bannon and Glenn Beck has backed a call to pause superintelligent AI development. The statement, led by the Future of Life Institute, urges safety before progress. Critics say such pauses hurt i…",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/us-right-wing-media-figures-tech-pioneers-call-for-superintelligent-ai-ban/articleshow/124733429.cms",
    "timestamp": "2025-10-22T04:37:50Z"
  },
  {
    "title": "NBA legend Michael Jordan returns to NBA on NBC with a striking admission about his post-game life",
    "description": "Michael Jordan, returning to NBA on NBC after 25 years, revealed he hasn't picked up a basketball in years and still misses competitive play. The NBA legend expressed a desire to \"pay it forward\" by sharing messages of success and dedication to the game. Fans…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/nba-legend-michael-jordan-returns-to-nba-on-nbc-with-a-striking-admission-about-his-post-game-life/articleshow/124733349.cms",
    "timestamp": "2025-10-22T04:35:16Z"
  },
  {
    "title": "Oil rises more than 1% on supply risk, US-China trade talks",
    "description": "Oil prices surged for the second consecutive day, fueled by tightening sanctions and optimism around a new trade agreement between the U.S. and China. In a strategic move, the U.S. is set to replenish its emergency oil reserves, a stark contrast to the five-m…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-rises-more-than-1-on-supply-risk-us-china-trade-talks/articleshow/124733345.cms",
    "timestamp": "2025-10-22T04:31:12Z"
  },
  {
    "title": "Higher education institutions can have online classes during ASEAN Summit, avoid congestion – MoHE",
    "description": "The 47th ASEAN Summit that Kuala Lumpur will be hosting this week is set to be the largest meet of its kind organised by the regional block. Aside from leaders of ASEAN countries, world leaders […]\nThe post Higher education institutions can have online classe…",
    "link": "https://paultan.org/2025/10/22/higher-education-institutions-can-have-online-classes-during-asean-summit-avoid-congestion-mohe/",
    "timestamp": "2025-10-22T04:30:01Z"
  },
  {
    "title": "Gaza ceasefire going ‘better than I expected’, says JD Vance in Israel",
    "description": "US vice-president JD Vance and other envoys projected optimism yesterday about Gaza’s fragile ceasefire agreement, calling progress better than anticipated as they visited a new centre in Israel for civilian and military co-operation.",
    "link": "https://www.independent.ie/world-news/middle-east/gaza-ceasefire-going-better-than-i-expected-says-jd-vance-in-israel/a1959431139.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "Trump-Putin summit put on hold after Russia snubs ceasefire bid",
    "description": "A planned summit between US president Donald Trump and Russian president Vladimir Putin was put on hold yesterday, as Moscow’s rejection of an immediate ceasefire in Ukraine cast a cloud over attempts at negotiations.",
    "link": "https://www.independent.ie/world-news/europe/trump-putin-summit-put-on-hold-after-russia-snubs-ceasefire-bid/a1756303942.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "Letters: Future of the Catholic Church is a lot brighter given recent words of hope from young faithful",
    "description": "Sarah Mac Donald reported that at a meeting in Kilkenny “the young people who spoke repeatedly reminded all that they are the future of the church and what they want is for the church to hold firm, as one put it, to tradition rather than watering down doctrin…",
    "link": "https://www.independent.ie/opinion/letters/letters-future-of-the-catholic-church-is-a-lot-brighter-given-recent-words-of-hope-from-young-faithful/a2083403745.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Ursula von der Leyen faces tough task in getting Ukraine ‘solidarity loan’ across the line",
    "description": "Since tanks rolled into Ukraine in late Febru­ary 2022, the EU has been eyeing Russia’s frozen assets in Europe as a source of funding to defray the costs of continuing to support Kyiv.",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-ursula-von-der-leyen-faces-tough-task-in-getting-ukraine-solidarity-loan-across-the-line/a1485725954.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "Hardline conservative Sanae Takaichi elected Japan’s first female PM",
    "description": "Hardline conservative Sanae Takaichi was elected Japan’s first female prime minister yesterday, shattering a political glass ceiling for women and setting the country up for a decisive turn to the right.",
    "link": "https://www.independent.ie/world-news/asia-pacific/hardline-conservative-sanae-takaichi-elected-japans-first-female-pm/a44869156.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "Pardoned Capitol rioter ‘plotted to kill Democrat Hakeem Jeffries’",
    "description": "A January 6, 2021 rioter pardoned by Donald Trump is accused of threatening to kill top House Democrat Hakeem Jeffries.",
    "link": "https://www.independent.ie/world-news/north-america/pardoned-capitol-rioter-plotted-to-kill-democrat-hakeem-jeffries/a2124304449.html",
    "timestamp": "2025-10-22T04:30:00Z"
  },
  {
    "title": "Immigration agents conducting sweep on NYC's famed Canal Street confronted by protesters",
    "description": "An immigration enforcement sweep targeting vendors on New York City’s famed Canal Street turned chaotic Tuesday afternoon, as bystanders and protesters confronted federal agents and tried to block their path",
    "link": "https://abcnews.go.com/US/wireStory/immigration-agents-conducting-sweep-nycs-famed-canal-street-126738556",
    "timestamp": "2025-10-22T04:29:44Z"
  },
  {
    "title": "Modi says India, US 'stand united' against terrorism",
    "description": "Indian Prime Minister Narendra Modi said he spoke with United States President Donald Trump, thanking him for his Diwali greetings.\nModi wrote on social media that the holiday marked a moment for Ind...",
    "link": "https://biztoc.com/x/c01b854ea101c02c",
    "timestamp": "2025-10-22T04:28:11Z"
  },
  {
    "title": "Bessent inks ‘economic stabilization’ deal with Argentina",
    "description": "Bessent inks ‘economic stabilization’ deal with Argentina\nPresident Donald Trump and Treasury Secretary Scott Bessent have vowed extraordinary assistance to help stabilize the Argentina’s volatile currency and economy.\nTreasury Secretary Scott Bessent looks o…",
    "link": "https://biztoc.com/x/1066754dfb2c5261",
    "timestamp": "2025-10-22T04:28:08Z"
  },
  {
    "title": "US government shutdown: Trump tells Senate Republicans to stand firm",
    "description": "Trump urges Senate Republicans to resist Democrats in ongoing government shutdown, warning of political consequences for the impasse.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-21/trump-tells-gop-senate-to-stand-firm-we-will-not-be-extorted",
    "timestamp": "2025-10-22T04:28:01Z"
  },
  {
    "title": "Vehicle Crashes Into White House Barricades",
    "description": "A vehicle crashed into White House barriers late Tuesday evening, just south of the Eisenhower Executive Office Building.",
    "link": "https://dailycaller.com/2025/10/22/vehicle-crashes-white-house-barricades/",
    "timestamp": "2025-10-22T04:26:30Z"
  },
  {
    "title": "Arizona AG sues Johnson over delayed swearing in of Democratic rep.",
    "description": "Arizona Attorney General Kris Mayes sued the GOP House speaker, suggesting that Adelita Grijalva had been kept from her seat to stop the Epstein files...",
    "link": "https://www.upi.com/Top_News/US/2025/10/22/mayes-lawsuit-johnson/1031761105595/",
    "timestamp": "2025-10-22T04:26:15Z"
  },
  {
    "title": "White House Says It Will Submit Ballroom Plans ‘Soon’ as Outrage Grows Over Demolition of East Wing",
    "description": "As outrage grows over the construction of President Donald Trump's ballroom, the White House now says it will submit plans \"soon\" -- but a substantial portion of the East Wing has already been demolished.\nThe post White House Says It Will Submit Ballroom Plan…",
    "link": "https://www.mediaite.com/media/news/white-house-says-it-will-submit-ballroom-plans-soon-as-outrage-grows-over-demolition-of-east-wing/",
    "timestamp": "2025-10-22T04:23:06Z"
  },
  {
    "title": "Historic preservation group fears ballroom annex will overwhelm White House",
    "description": "The National Trust for Historic Preservation asks Trump administration to pause demolition of White House East Wing until ballroom plans can be reviewed.",
    "link": "https://www.cbsnews.com/news/historic-preservation-group-ballroom-white-house/",
    "timestamp": "2025-10-22T04:22:00Z"
  },
  {
    "title": "Goldman Sachs sees 30% upside for China stocks through 2027",
    "description": "Goldman Sachs predicts a significant 30% rise in China's main stock index by the end of 2027. This optimistic outlook is driven by supportive government policies, increasing company profits, and strong investor money flows. Chinese stocks are set for a steady…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-sees-30-upside-for-china-stocks-through-2027/articleshow/124733215.cms",
    "timestamp": "2025-10-22T04:21:52Z"
  },
  {
    "title": "Bitcoin OG ‘Insider’ Whale Raises Short Position To $227M — Major Correction Signal?",
    "description": "A crypto whale known as the “Trump insider” has deepened his bearish stance on Bitcoin, raising his short position to 2,100 BTC worth about $227m. The move...",
    "link": "https://cryptonews.com/news/bitcoin-og-insider-whale-raises-short-position-227m/",
    "timestamp": "2025-10-22T04:21:21Z"
  },
  {
    "title": "How damaging to the royal family is the scandal surrounding Prince Andrew?",
    "description": "The British royals are no strangers to scandals - and they are likely to be able to manage this one.",
    "link": "https://theconversation.com/how-damaging-to-the-royal-family-is-the-scandal-surrounding-prince-andrew-267983",
    "timestamp": "2025-10-22T04:20:07Z"
  },
  {
    "title": "Devoid of Nobel, Trump honored with peace award from Richard Nixon Foundation at White House",
    "description": "US President Donald Trump has been honored with the Architect of Peace Award by the Richard Nixon Foundation. The award recognizes individuals who strive for a more peaceful world. Trump joins a list of distinguished recipients, including past US Presidents. …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-devoid-of-nobel-trump-honored-with-architect-of-peace-award-from-richard-nixon-foundation-at-white-house/articleshow/124733110.cms",
    "timestamp": "2025-10-22T04:19:30Z"
  },
  {
    "title": "Immigration agents conducting sweep on NYC's famed Canal Street confronted by protesters",
    "description": "An immigration enforcement operation targeting Canal Street vendors in Manhattan devolved into chaos as New Yorkers surrounded federal agents, attempting to block their departure. Protesters shouted slogans and confronted officers, leading to arrests and a te…",
    "link": "https://timesofindia.indiatimes.com/world/us/immigration-agents-conducting-sweep-on-nycs-famed-canal-street-confronted-by-protesters/articleshow/124733065.cms",
    "timestamp": "2025-10-22T04:19:09Z"
  },
  {
    "title": "Trump Allegedly Misidentified a Colombian Fisherman as a Venezuelan 'Narcoterrorist'",
    "description": "Colombian President Gustavo Petro says one of the \"narcoterrorists\" recently killed by U.S. military strikes on boats in the Caribbean was a \"fisherman\" who had \"no ties to the drug trade.\" That man's death, one of at least 32 ordered by President Donald Trum…",
    "link": "https://biztoc.com/x/6f5ce105ecc0d63e",
    "timestamp": "2025-10-22T04:17:11Z"
  },
  {
    "title": "Juan Cole on Gaza, U.S. Policy, and the Future of the Middle East",
    "description": "I was welcomed onto David Lin's Podcast, 'The David Lin Report' to talk about Gaza, the Middle East and the US-China rivalry. Embedded video and transcript below. He describes it this way: The David Lin Report! I’ll be reporting on the most impactful market-m…",
    "link": "https://www.juancole.com/2025/10/policy-future-middle.html",
    "timestamp": "2025-10-22T04:15:56Z"
  },
  {
    "title": "SC chose right to burn crackers over that to live & breathe: Former NITI Aayog CEO Amitabh Kant",
    "description": "In a bold statement, former NITI Aayog head Amitabh Kant took aim at the Supreme Court's decision regarding firecracker burning, insisting that it favors festive cheer over the dire need for public health protection. Given the hazardous air pollution prevaili…",
    "link": "https://timesofindia.indiatimes.com/city/delhi/sc-chose-right-to-burn-crackers-over-that-to-live-breathe-former-niti-aayog-ceo-amitabh-kant/articleshow/124733060.cms",
    "timestamp": "2025-10-22T04:14:03Z"
  },
  {
    "title": "Japan's exports and imports grow in September despite Trump's tariffs",
    "description": "Japan’s exports grew 4.2% in September, according to government data, on robust shipments to Asia that offset the decline to those destined for the U.S., which were impacted by President Donald Trump’s tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/japans-exports-imports-grow-september-despite-trumps-tariffs-126745016",
    "timestamp": "2025-10-22T04:13:35Z"
  },
  {
    "title": "Japan's exports and imports grow in September despite Trump's tariffs",
    "description": "Japan’s exports grew 4.2% in September, according to government data, on robust shipments to Asia that offset the decline to those destined for the U.S., which were impacted by President Donald Trump’s tariffs",
    "link": "https://abcnews.go.com/International/wireStory/japans-exports-imports-grow-september-despite-trumps-tariffs-126745015",
    "timestamp": "2025-10-22T04:13:34Z"
  },
  {
    "title": "With ceasefire, some pro-Palestinian protesters look back, ruefully",
    "description": "In interviews with a dozen activists and academics across the country, they described a pro-Palestinian movement that is chastened, wary and worried about the future of political dissent.",
    "link": "https://indianexpress.com/article/world/with-ceasefire-some-pro-palestinian-protesters-look-back-ruefully-10320011/",
    "timestamp": "2025-10-22T04:12:44Z"
  },
  {
    "title": "While Modi conceals, Trump reveals: Congress after US President repeats Russian oil claims",
    "description": "The Congress criticized the government after US President Donald Trump repeatedly announced India's policy on Russian oil imports, stating Prime Minister Modi \"conceals, Trump reveals.\" Trump claimed Modi assured him India would significantly reduce oil purch…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/while-modi-conceals-trump-reveals-congress-after-us-president-repeats-russian-oil-claims/articleshow/124733057.cms",
    "timestamp": "2025-10-22T04:10:02Z"
  },
  {
    "title": "Seth Meyers Spots The Telling Sign Trump Won't Leave The White House In 2029",
    "description": "The \"Late Night\" host tore apart the president over his big plans for the executive mansion.",
    "link": "https://www.huffpost.com/entry/seth-meyers-trump-white-house-east-wing-ballroom_n_68f83eb0e4b02abf9d452469",
    "timestamp": "2025-10-22T04:07:34Z"
  },
  {
    "title": "Victims Without Victimizers: How Corporate Democrats Led to the Trump Era",
    "description": "( Tomdispatch.com ) - The human condition includes a vast array of unavoidable misfortunes. But what about the preventable ones? Shouldn’t the United States provide for the basic needs of its people? Such questions get distinctly short shrift in the dominant …",
    "link": "https://www.juancole.com/2025/10/victimizers-corporate-democrats.html",
    "timestamp": "2025-10-22T04:04:17Z"
  },
  {
    "title": "US right-wing media figures, tech pioneers call for superintelligent AI ban",
    "description": "A group including right-wing U.S. media personalities Steve Bannon and Glenn Beck has signed a statement calling for a ban on developing superintelligent artificial intelligence until the public demands it and science paves a safe way forward, according to th…",
    "link": "https://www.channelnewsasia.com/business/us-right-wing-media-figures-tech-pioneers-call-superintelligent-ai-ban-5417031",
    "timestamp": "2025-10-22T04:03:56Z"
  },
  {
    "title": "US right-wing media figures, tech pioneers call for superintelligent AI ban",
    "description": "The proposal, also signed by technology pioneers Geoffrey Hinton and Yoshua Bengio, is the latest organized by the Future of Life Institute, which for more...",
    "link": "https://www.yahoo.com/news/articles/us-wing-media-figures-tech-040356931.html",
    "timestamp": "2025-10-22T04:03:56Z"
  },
  {
    "title": "China accuses Australia of covering up South China Sea airspace incursion",
    "description": "China and Australia have traded accusations over an incident Australia said involved a Chinese jet releasing flares.",
    "link": "https://www.aljazeera.com/news/2025/10/22/china-accuses-australia-of-covering-up-south-china-sea-airspace-incursion",
    "timestamp": "2025-10-22T04:03:34Z"
  },
  {
    "title": "GM CEO Mary Barra gives crucial update as stock jumps 15%",
    "description": "According to its third-quarter earnings report released Oct. 21, General Motors GM successfully rode the tariff wave to its most substantial U.S. market...",
    "link": "https://www.thestreet.com/automotive/gm-ceo-mary-barra-gives-crucial-update-as-stock-jumps-15",
    "timestamp": "2025-10-22T04:03:00Z"
  },
  {
    "title": "Republicans are ridiculing ‘No Kings.’ A striking new poll shows Americans aren’t laughing",
    "description": "New polling reinforces how much the thrust of the “No Kings” message has resonated with much of the American public.",
    "link": "https://www.cnn.com/2025/10/22/politics/no-kings-rallies-trump-analysis",
    "timestamp": "2025-10-22T04:02:51Z"
  },
  {
    "title": "Prosecutors not ruling out state charges for commuted ex-Rep. George Santos",
    "description": "Former Rep. George Santos, R-N.Y., was freed from prison last week thanks to his federal fraud sentence being commuted by President Donald Trump -- but he may not be free from criminal prosecution on the local level. The district attorney’s office in Nassau C…",
    "link": "https://freerepublic.com/focus/f-news/4347889/posts",
    "timestamp": "2025-10-22T04:01:02Z"
  },
  {
    "title": "‘We were getting crushed’: Brands cut back on free online returns to offset tariff costs",
    "description": "Some brands are even eliminating the perk altogether as they try to mitigate the steep costs of the Trump tariffs.",
    "link": "http://digiday.com/marketing/we-were-getting-crushed-brands-cut-back-on-free-online-returns-to-offset-tariff-costs/",
    "timestamp": "2025-10-22T04:01:00Z"
  },
  {
    "title": "A Year After the Election Is Too Late for the Cheapskates To Complain",
    "description": "In America, every voice counts — to a degree. Those more active in the political process count more. Simply being a precinct captain in your local party gives you leverage that the average voter does not have. There are other ways to magnify one’s leverage. O…",
    "link": "https://www.lewrockwell.com/2025/10/allan-stevo/a-year-after-the-election-is-too-late-for-the-cheapskates-to-complain/",
    "timestamp": "2025-10-22T04:01:00Z"
  },
  {
    "title": "Forbes Global CEO Conference 2025: Key Insights And Highlights",
    "description": "The 23rd Forbes Global CEO Conference took place in Jakarta, Indonesia, on October 14 and 15, gathering some 380 leading CEOs, thought leaders, entrepreneurs and investors from around the world to discuss key issues of global concern and to build new partners…",
    "link": "https://www.forbes.com/sites/forbesasiateam/2025/10/22/forbes-global-ceo-conference-2025-key-insights-and-highlights/",
    "timestamp": "2025-10-22T04:00:55Z"
  },
  {
    "title": "The world is a Wild West for multinationals, and Europe is doing nothing about it",
    "description": "What has been adopted is a complete unravelling of the very idea of the due diligence directive. The law that was supposed to make corporate offenders pay has been turned into a licence for impunity",
    "link": "https://www.euractiv.com/opinion/the-world-is-a-wild-west-for-multinationals-and-europes-doing-nothing-about-it/",
    "timestamp": "2025-10-22T04:00:12Z"
  },
  {
    "title": "The Communist Party USA cosponsored ‘No Kings.’ You should care.",
    "description": "As Bill Maher once laid bare, “For Millennials, the word socialism doesn’t conjure up images of Stalin and Castro, it conjures up images of naked Danish people on a month-long paid vacation…it’s not such a jarring proposition...",
    "link": "https://www.americanthinker.com/blog/2025/10/the_communist_party_usa_cosponsored_no_kings_you_should_care.html",
    "timestamp": "2025-10-22T04:00:00Z"
  },
  {
    "title": "Democrats have a cow over Trump's construction of a new White House ballroom",
    "description": "In the annals of stupid things that excite Democrats, it doesn't get better than the torrent of outrage over President Trump's construction of a new ballroom where the east wing of the White House -- a nondescript office building bu...",
    "link": "https://www.americanthinker.com/blog/2025/10/democrats_have_a_cow_over_trump_s_construction_of_a_new_white_house_ballroom.html",
    "timestamp": "2025-10-22T04:00:00Z"
  },
  {
    "title": "‘It won’t stop with Ukraine’: Former POWs saw only lust for war, conquest in Russian jails",
    "description": "UN says brutal abuse of Ukrainian captives is rife as Kremlin withdraws from European anti-torture convention",
    "link": "https://www.irishtimes.com/world/europe/2025/10/22/it-wont-stop-with-ukraine-former-pows-saw-only-lust-for-war-conquest-in-russian-jails/",
    "timestamp": "2025-10-22T04:00:00Z"
  },
  {
    "title": "White House East Wing Overhaul: First Lady office reportedly set for demolition as part of Trump’s Ballroom project - Check full list",
    "description": "Significant parts of the White House East Wing are being demolished. This includes the First Lady's office and other workspaces. The demolition is part of President Donald Trump's planned ballroom project. The East Wing will undergo a full reconstruction. Thi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/white-house-east-wing-overhaul-first-lady-office-reportedly-set-for-demolition-as-part-of-trumps-ballroom-project-check-full-list/articleshow/124732853.cms",
    "timestamp": "2025-10-22T03:58:57Z"
  },
  {
    "title": "Belarusian opposition urges EU to keep up pressure on Lukashenko",
    "description": "Trump’s outreach to Minsk and a possible Putin meeting cast a shadow over Tsikhanouskaya’s appeal to the European Parliament",
    "link": "https://www.euractiv.com/news/belarusian-opposition-urges-eu-to-keep-up-pressure-on-lukashenko/",
    "timestamp": "2025-10-22T03:57:58Z"
  },
  {
    "title": "Trump's ASEAN Summit attendance raises stakes for trade, security talks",
    "description": "5 key data points that explain significance of Oct. 26-28 event in Kuala Lumpur\nU.S. President Donald Trump speaks during an event at the White House on Oct. 16. (Reuters)",
    "link": "https://biztoc.com/x/1417ff359df6025f",
    "timestamp": "2025-10-22T03:55:11Z"
  },
  {
    "title": "‘He lied’: Fury grows over Trump’s White House demolition for $250 million ballroom",
    "description": "Donald Trump wants to be a king. That is the best explanation for everything he has been doing in recent days. Just look at what ...",
    "link": "https://biztoc.com/x/eae826f847e2c1b0",
    "timestamp": "2025-10-22T03:53:12Z"
  },
  {
    "title": "Houston Rockets vs Oklahoma City Thunder (21-10-2025): Box score, player stats, game summary and more",
    "description": "Oklahoma City Thunder, the reigning champions, narrowly defeated the Houston Rockets in a thrilling double-overtime season opener. Shai-Gilgeous Alexander's clutch performance, including a game-winning dunk, secured the victory. Alperen Sengun put up a valian…",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/houston-rockets-vs-oklahoma-city-thunder-21-10-2025-box-score-player-stats-game-summary-and-more/articleshow/124732742.cms",
    "timestamp": "2025-10-22T03:51:09Z"
  },
  {
    "title": "FIFA president set to visit Malaysia during ASEAN Summit amid naturalised player scandal",
    "description": "Gianni Infantino’s trip comes amid a national football scandal in Malaysia. He is reportedly expected to witness the signing of an ASEAN football development agreement.",
    "link": "https://www.channelnewsasia.com/asia/malaysia-asean-summit-fifa-gianni-infantino-5416976",
    "timestamp": "2025-10-22T03:50:48Z"
  },
  {
    "title": "AP: Paul Ingrassia nomination",
    "description": "President Donald Trump 's pick to lead a federal watchdog agency withdrew from consideration Tuesday evening, after his offensive text messages were made public and GOP senators revolted.",
    "link": "https://www.npr.org/2025/10/21/nx-s1-5581714/paul-ingrassia-nomination-withdrawal",
    "timestamp": "2025-10-22T03:49:17Z"
  },
  {
    "title": "Japan’s exports and imports grow in September despite Trump’s tariffs",
    "description": "TOKYO (AP) — Japan’s exports grew 4.2% in September, according to government data Wednesday, on robust shipments to Asia that offset a decline in exports to the U.S., which were impacted by President Donald Trump’s tariffs. Japan’s exports to Asia jumped 9.2%…",
    "link": "https://financialpost.com/pmn/japans-exports-and-imports-grow-in-september-despite-trumps-tariffs",
    "timestamp": "2025-10-22T03:48:51Z"
  },
  {
    "title": "Tariffs on Indian exports to the US to drop 15-16% upon trade deal: Report",
    "description": "India and the US are nearing a trade agreement. Tariffs on Indian exports could drop from 50% to 15-16%. This deal may involve India gradually reducing Russian oil imports. In return, the US is expected to offer concessions on energy trade. Both nations are a…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/tariffs-on-indian-exports-to-the-us-to-drop-15-16-upon-trade-deal-report/articleshow/124732437.cms",
    "timestamp": "2025-10-22T03:43:20Z"
  },
  {
    "title": "Trump Says He'd Have Final Say On Money He Seeks Over Past Federal Investigations Into His Conduct",
    "description": "President Donald Trump says the federal government owes him “a lot of money” for prior Justice Department investigations into his actions and insists that any decision on a payout would “have to go across my desk.\"",
    "link": "https://www.huffpost.com/entry/us-trump-investigations-justice-department_n_68f85173e4b05b9180d38650",
    "timestamp": "2025-10-22T03:41:37Z"
  },
  {
    "title": "Western media lying about planned Putin-Trump summit – key Kremlin aide",
    "description": "Russian President Vladimir Putin’s aide has denied claims that plans for a meeting with US President Donald Trump were canceled Read Full Article at RT.com",
    "link": "https://www.rt.com/news/626788-kremlin-aide-putin-trump-meeting/",
    "timestamp": "2025-10-22T03:41:04Z"
  },
  {
    "title": "Liberal Influencer Reacts to Video of Trump Dropping Poop on Him: ‘I Don’t Think the President Behaving in This Way Is Funny’",
    "description": "Harry Sisson told Piers Morgan he was not amused after President Donald Trump posted an AI-generated video of himself dropping poop on Sisson's head.\nThe post Liberal Influencer Reacts to Video of Trump Dropping Poop on Him: ‘I Don’t Think the President Behav…",
    "link": "https://www.mediaite.com/politics/liberal-influencer-reacts-to-video-of-trump-dropping-poop-on-him-i-dont-think-the-president-behaving-in-this-way-is-funny/",
    "timestamp": "2025-10-22T03:39:07Z"
  },
  {
    "title": "US to buy 1 million barrels for strategic petroleum reserve",
    "description": "US plans to purchase 1 million barrels for the Strategic Petroleum Reserve, capitalizing on low oil prices this December and January.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-21/us-to-buy-1-million-barrels-for-strategic-petroleum-reserve",
    "timestamp": "2025-10-22T03:39:02Z"
  },
  {
    "title": "GOP senators bring beef concerns straight to Trump",
    "description": "Many GOP senators raised concerns directly with President Donald Trump on Tuesday about his idea to buy more beef from Argentina, according to four Republicans who attended a lunch hosted at the White House. The Rose Garden lunch was initially scheduled to ce…",
    "link": "https://freerepublic.com/focus/f-chat/4347884/posts",
    "timestamp": "2025-10-22T03:33:31Z"
  },
  {
    "title": "Elizabeth Warren Warns One Of Trump's 'Billionaire Buddies' Wants To Buy Warner Bros, Warns Giant Company Could Control 'Everything' You Watch On TV",
    "description": "On Tuesday, Sen. Elizabeth Warren (D-Mass.) raised concerns about media consolidation, pointing to David Ellison's ties to President Donald Trump as he seeks control of Warner Bros. Discovery, Inc. (NASDAQ:WBD).\nElizabeth Warren Flags Media Monopoly Risk\nIn a…",
    "link": "https://biztoc.com/x/5c820846aedffff4",
    "timestamp": "2025-10-22T03:33:03Z"
  },
  {
    "title": "North Korea fires ballistic missile - S Korea military",
    "description": "North Korea fired at least one ballistic missile, South Korea's military said, its first such launch in months.",
    "link": "https://www.rte.ie/news/world/2025/1022/1539880-north-korea-missile/",
    "timestamp": "2025-10-22T03:29:09Z"
  },
  {
    "title": "Jen Psaki also questioned if the VP’s wife needs help.",
    "description": "MSNBC host Jen Psaki has listed all the ways JD Vance is “scarier” than Donald Trump. Psaki, who was White House press secretary under President Joe Biden...",
    "link": "https://www.thedailybeast.com/msnbc-host-jen-psaki-explains-why-jd-vance-is-scarier-than-donald-trump/",
    "timestamp": "2025-10-22T03:28:40Z"
  },
  {
    "title": "US opens one more window towards H-1B; IT firms, large tech cos to get reprieve",
    "description": "This is also a reprieve for large technology companies and startups that hire students from US universities. OpenAI, Anthropic, Amazon, Tata Consultancy Services and Salesforce are among those that sponsored H-1B visas this year. The clarifications come a mon…",
    "link": "https://economictimes.indiatimes.com/tech/technology/us-opens-one-more-window-towards-h-1b-it-cos-startups-to-get-reprieve/articleshow/124732582.cms",
    "timestamp": "2025-10-22T03:26:35Z"
  },
  {
    "title": "PM Modi, Trump Exchange Diwali Greetings Amid Trade Talks And Oil Diplomacy",
    "description": "Prime Minister Narendra Modi and US President Donald Trump exchanged warm wishes on Diwali, posting on social media amid signalled progress in bilateral trade and energy discussions.",
    "link": "https://www.ndtvprofit.com/economy-finance/pm-modi-trump-exchange-diwali-greetings-amid-trade-talks-and-oil-diplomacy",
    "timestamp": "2025-10-22T03:20:36Z"
  },
  {
    "title": "North Korea fires ballistic missiles week before leaders meet in South Korea",
    "description": "North Korea launched several short-range ballistic missiles on Wednesday. This marks the first such launch since May. The missiles flew approximately 350 kilometers. South Korea's military detected the projectiles and shared information with the U.S. and Japa…",
    "link": "https://economictimes.indiatimes.com/news/defence/north-korea-fires-ballistic-missiles-week-before-leaders-meet-in-south-korea/articleshow/124732526.cms",
    "timestamp": "2025-10-22T03:19:48Z"
  }
]