[
  {
    "title": "Experts say Trump pullout from UN climate fighting will hurt U.S.",
    "description": "Experts say Trump pullout from UN climate fighting will hurt U.S.twincities.com",
    "link": "https://www.twincities.com/2026/01/09/climate-us-withdrawal/",
    "timestamp": "2026-01-09T18:12:56Z"
  },
  {
    "title": "'The View' hosts repeatedly clash over Trump removing Maduro",
    "description": "Sunny Hostin and Ana Navarro of \"The View\" clash over Venezuelan President Nicolás Maduro's capture by U.S. forces in heated Friday debate about international law.",
    "link": "https://www.foxnews.com/media/the-view-hosts-repeatedly-clash-over-trump-removing-maduro",
    "timestamp": "2026-01-09T18:11:17Z"
  },
  {
    "title": "Experts say Trump pullout from UN climate fighting will hurt world and leave US out of green surge",
    "description": "Experts say the move isolates America as the world transitions to green energy.",
    "link": "https://www.bostonherald.com/2026/01/09/climate-us-withdrawal/",
    "timestamp": "2026-01-09T18:09:04Z"
  },
  {
    "title": " BREAKING: POV footage from the ICE agent who was RAMMED by anti-ICE activist Renee Good in Minneapolis has been released",
    "description": " BREAKING: POV footage from the ICE agent who was RAMMED by anti-ICE activist Renee Good in Minneapolis has been releasedHe was clearly not just hit, but hit HARD.100% JUSTIFIED use of force. Walz and the Mayor are LIARS.Glad this agent is safe!  pic.tw…",
    "link": "https://freerepublic.com/focus/f-news/4361230/posts",
    "timestamp": "2026-01-09T18:08:16Z"
  },
  {
    "title": "Colbert warns Trump administration is imposing an 'obey or die' doctrine on Americans",
    "description": "On Thursday, \"Late Show\" host Stephen Colbert warned that the Trump administration is imposing an \"obey or die\" doctrine on Americans after Wednesday's fatal ICE-involved shooting.",
    "link": "https://www.foxnews.com/media/colbert-warns-trump-administration-imposing-obey-die-doctrine-americans",
    "timestamp": "2026-01-09T18:08:01Z"
  },
  {
    "title": "As Trump pitches oil companies on Venezuela plans, experts see challenges: Analysis",
    "description": "As Trump pitches oil companies on Venezuela plans, experts see challenges: Analysisgo.com",
    "link": "https://abcnews.go.com/Politics/trump-pitches-oil-companies-plan-venezuela-analysis/story?id=129055022",
    "timestamp": "2026-01-09T18:08:00Z"
  },
  {
    "title": "Venezuela releases imprisoned political figures and activists, which Trump says U.S. requested",
    "description": "President Donald Trump said in a TV interview the releases came at the request of the United States and praised the government of acting President Delcy Rodríguez.",
    "link": "https://www.pbs.org/newshour/politics/venezuela-releases-imprisoned-political-figures-and-activists-which-trump-says-u-s-requested",
    "timestamp": "2026-01-09T18:06:23Z"
  },
  {
    "title": "Military action in Venezuela emerges as an issue in a closely watched GOP primary in Kentucky (Massie vs. Gallrein)",
    "description": "President Donald Trump's military intervention in Venezuela has emerged as a flash point in the closely watched Republican primary campaign between Kentucky U.S. Rep. Thomas Massie, a long-running Trump antagonist, and retired Navy SEAL officer Ed Gallrein, w…",
    "link": "https://freerepublic.com/focus/f-gop/4361229/posts",
    "timestamp": "2026-01-09T18:05:44Z"
  },
  {
    "title": "A Turning Point for Trump's Marauding Secret Police (Josh Marshall/Talking Points Memo)",
    "description": "Josh Marshall / Talking Points Memo:\nA Turning Point for Trump's Marauding Secret Police  —  People who don't like Donald Trump are kinda gun-shy talking about turning points.  Turning points of course can mean very many things.  But as I watched first the vi…",
    "link": "https://www.memeorandum.com/260109/p67",
    "timestamp": "2026-01-09T18:05:00Z"
  },
  {
    "title": "2024 election win must be recognised, says Venezuela opposition figure",
    "description": "Exiled Venezuela opposition leader Edmundo Gonzalez Urrutia says any democratic transition must recognize his 2024 presidential election victory.\n\nRead More: https://punchng.com/2024-election-win-must-be-recognised-says-venezuela-opposition-figure/",
    "link": "https://punchng.com/2024-election-win-must-be-recognised-says-venezuela-opposition-figure/",
    "timestamp": "2026-01-09T18:04:57Z"
  },
  {
    "title": "Trump: No 'Second Wave of Attacks' Due to Venezuela 'Seeking Peace'",
    "description": "President Donald Trump announced early Friday morning that he has “cancelled” what he called an “expected second Wave of Attacks” against Venezuela because its leaders were cooperating with the U.S. “Venezuela is releasing large numbers of political prisoners…",
    "link": "https://www.breitbart.com/national-security/2026/01/09/trump-no-second-wave-of-attacks-on-venezuela-for-seeking-peace/",
    "timestamp": "2026-01-09T18:02:25Z"
  },
  {
    "title": "Regime Declares Open Season On White Women, Anyone Else Who Leaves The House",
    "description": "Also if you can read this, you’re on a list.",
    "link": "https://www.wonkette.com/p/regime-declares-open-season-on-white",
    "timestamp": "2026-01-09T18:01:46Z"
  },
  {
    "title": "MTG Refutes Allegations She Tipped Off Code Pink About Trump Visit to DC Restaurant",
    "description": "MTG: \"Only the WH set up President Trump’s reservation at Joe’s, NOT ME!! I had ZERO knowledge of when his reservation was! The only people who could have tipped off Code Pink was the restaurant or the WH!\"\nThe post MTG Refutes Allegations She Tipped Off Code…",
    "link": "https://legalinsurrection.com/2026/01/mtg-refutes-allegations-she-tipped-off-code-pink-about-trump-visit-to-dc-restaurant/",
    "timestamp": "2026-01-09T18:00:27Z"
  },
  {
    "title": "Nikita Casap Pleads Guilty for Killing Parents in Convoluted Trump Assassination Plot",
    "description": "Reading Time: 3 minutesLast year, then-17-year-old Nikita Casap shot both parents as part of a broader plot. He's pleaded guilty.\nNikita Casap Pleads Guilty for Killing Parents in Convoluted Trump Assassination Plot was originally published on The Hollywood G…",
    "link": "http://www.thehollywoodgossip.com/2026/01/nikita-casap-pleads-guilty-killing-parents-trump/",
    "timestamp": "2026-01-09T18:00:27Z"
  },
  {
    "title": "Why Are Federal Agents Using GoPros, Smart Glasses, and Phones to Record Us?",
    "description": "\"What happened to the police body cameras?\" one Uber driver in Minnesota asked a Border Patrol agent.",
    "link": "https://gizmodo.com/why-are-federal-agents-using-gopros-smart-glasses-and-phones-to-record-us-2000707835",
    "timestamp": "2026-01-09T18:00:02Z"
  },
  {
    "title": "Fans and former contestants praise “Jeopardy” host Ken Jennings after he got political on Bluesky",
    "description": "Jeopardy! host Ken Jennings stepped into political debate on Bluesky this week, and folks quickly took note. While Jennings often keeps his public persona focused on trivia, he hasn't been shy in the past from posting about politics.\n\n\nOn Wednesday, Jennings …",
    "link": "https://www.dailydot.com/viral-politics/jeopardy-host-ken-jennings-political/",
    "timestamp": "2026-01-09T18:00:00Z"
  },
  {
    "title": "Can We Save the Internet?",
    "description": "Grok’s “digital undressing” crisis and a manifesto to build a better internet",
    "link": "https://www.theatlantic.com/podcasts/2026/01/groks-digital-undressing-crisis-and-a-manifesto-to-build-a-better-internet/685561/",
    "timestamp": "2026-01-09T18:00:00Z"
  },
  {
    "title": "‘To Be Clear,’ Contrary to Vance’s Claims, ICE Agents Do Not Have ‘Absolute Immunity,’ Say Legal Experts",
    "description": "When Vice President JD Vance told reporters at a press briefing Thursday that Jonathan Ross, the federal immigration agent who was filmed fatally shooting Renee Good in Minneapolis, has \"absolute immunity,\" he was not referring to any recognized statute in Un…",
    "link": "https://www.commondreams.org/news/do-ice-agents-have-qualified-immunity",
    "timestamp": "2026-01-09T17:58:34Z"
  },
  {
    "title": "Trump's Ignorance About Nobel Peace Prize Is Stunning",
    "description": "In an interview with Fox News host Sean Hannity (yeah), Trump demonstrated his ignorance and belligerence towards Norway by not understanding why they are involved in giving the Nobel Peace Prize.\nDemented Donald has been crying, whining, wheezing,and demandi…",
    "link": "https://crooksandliars.com/2026/01/trumps-ignorance-about-norway-peace-prize",
    "timestamp": "2026-01-09T17:57:10Z"
  },
  {
    "title": "Healthy Returns: What to expect from pharma at the JPM conference",
    "description": "At the JPMorgan Healthcare Conference, drugmakers are expected to roll out key business and drug pipeline updates and splashy M&A deals.",
    "link": "https://www.cnbc.com/2026/01/09/healthy-returns-what-to-expect-from-pharma-at-the-jpm-conference.html",
    "timestamp": "2026-01-09T17:57:01Z"
  },
  {
    "title": "Minneapolis leaders urge transparency, independent probe after ICE killing",
    "description": "Mayor Jacob Frey calls on Trump administration to follow the facts amid growing outrage over killing of mother of three.",
    "link": "https://www.aljazeera.com/news/2026/1/9/minneapolis-leaders-urge-transparency-independent-probe-after-ice-killing",
    "timestamp": "2026-01-09T17:55:02Z"
  },
  {
    "title": "How White House unleashed torrent of false claims after woman shot dead by Ice",
    "description": "Victim-blaming began almost as soon as Renee Nicole Good was killed - but the claims differ wildly from the evidence",
    "link": "https://www.irishtimes.com/world/us/2026/01/09/how-white-house-unleashed-torrent-of-false-claims-after-woman-shot-dead-by-ice/",
    "timestamp": "2026-01-09T17:52:59Z"
  },
  {
    "title": "“A great honor”: Trump says he would accept Nobel Prize offered by Machado",
    "description": "Trump said the award going to Machado was \"a major embarrassment\"",
    "link": "https://www.salon.com/2026/01/09/a-great-honor-trump-says-he-would-accept-nobel-prize-offered-by-machado/",
    "timestamp": "2026-01-09T17:51:07Z"
  },
  {
    "title": "Here’s What We Know About ICE Agent Who Shot Woman in Minnesota",
    "description": "Jonathan Ross, the ICE agent who shot and killed Renee Good, reportedly had a history of escalating arrests with violent tactics. Ross, a 10-year law enforcement veteran, was injured in June during the chaotic attempted arrest of Roberto Carlos Muñoz, an undo…",
    "link": "https://newrepublic.com/post/205129/what-we-know-ice-agent-shot-woman-minnesota",
    "timestamp": "2026-01-09T17:50:09Z"
  },
  {
    "title": "This Trump disgrace was almost as chilling as Renee Good's murder",
    "description": "In Minneapolis on Wednesday, an ICE agent shot and killed Renee Good, a 37-year-old mother of three. The shooting occurred on a residential street in the south of the city, less than a mile from where George Floyd was killed by police in 2020.Donald Trump cla…",
    "link": "https://www.rawstory.com/ice-shooting-2674863864/",
    "timestamp": "2026-01-09T17:48:11Z"
  },
  {
    "title": "Greenland’s Rare Earths Aren’t All That",
    "description": "The island may not be the treasure trove that some U.S. officials think.",
    "link": "http://foreignpolicy.com/2026/01/09/trump-greenland-rare-earths-critical-minerals/",
    "timestamp": "2026-01-09T17:48:06Z"
  },
  {
    "title": "France Forced To Push Start Of International Summit Due To UFC Event At White House",
    "description": "Some of the world’s most powerful leaders have convened at the annual G7 Summit for over 50 years. This year, France will host a gathering that was initially slated to kick off on June 14th, but the date has been changed because of a UFC event that will take …",
    "link": "https://brobible.com/sports/article/france-postpones-g7-summit-ufc-white-house/",
    "timestamp": "2026-01-09T17:46:03Z"
  },
  {
    "title": "Trump Says US Will Begin Land Strikes on Cartels in Mexico",
    "description": "President Donald Trump announced in an interview aired Jan. 8 that the United States will begin launching strikes on the cartels in Mexico. “We knocked out 97 percent of the drugs coming in by water, and we are going to start now hitting land with regard with…",
    "link": "https://freerepublic.com/focus/f-news/4361226/posts",
    "timestamp": "2026-01-09T17:45:00Z"
  },
  {
    "title": "Supreme Court tariff ruling delay sparks crypto rally today – Bitcoin (BTC USD) price, Ethereum and XRP jump",
    "description": "Tariffs Supreme Court ruling impact on crypto prices: Cryptocurrency markets surged Friday as the US Supreme Court delayed a key decision on President Trump's tariff policy, easing near-term macro uncertainty. Bitcoin, Ethereum, and XRP led the gains, with Bi…",
    "link": "https://economictimes.indiatimes.com/news/international/us/supreme-court-tariff-ruling-delay-sparks-crypto-rally-today-bitcoin-btc-usd-price-ethereum-and-xrp-jump/articleshow/126440264.cms",
    "timestamp": "2026-01-09T17:43:29Z"
  },
  {
    "title": "Conan O’Brien criticizes comics who ‘just say F Trump all the time’: ‘You’re being co-opted’",
    "description": "Former late-night host urged comedians to ‘find a way to channel that anger’",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/conan-obrien-trump-comics-b2897671.html",
    "timestamp": "2026-01-09T17:42:21Z"
  },
  {
    "title": "Jesse Ventura Body Slams Donald Trump, Calls Him A “Draft Dodging Coward”",
    "description": "\"He’s the draft-dodging coward who, when it was his time to serve his country, he did what all rich white boys did. I wasn’t a rich white boy...We had to go...He’s gonna tell me what courage is?”",
    "link": "https://hiphopwired.com/2993078/jesse-ventura-calls-donald-trump-draft-dodging-coward-reactions/",
    "timestamp": "2026-01-09T17:41:59Z"
  },
  {
    "title": "House easily passes spending package as lawmakers work to avoid another shutdown",
    "description": "The House passed a bipartisan package of three spending bills on Thursday that would fund parts of the federal government through September, demonstrating the eagerness of lawmakers to avoid another government shutdown near the end of the month.",
    "link": "https://www.pbs.org/newshour/politics/house-easily-passes-spending-package-as-lawmakers-work-to-avoid-another-shutdown",
    "timestamp": "2026-01-09T17:41:59Z"
  },
  {
    "title": "Trump posted jobs data early on Truth Social (Brent D. Griffiths/Business Insider)",
    "description": "Brent D. Griffiths / Business Insider:\nTrump posted jobs data early on Truth Social  — President Donald Trump posted a chart containing job data hours early.  — Trump posted the chart on Truth Social Thursday night.  — The December jobs report was not publicl…",
    "link": "https://www.memeorandum.com/260109/p59",
    "timestamp": "2026-01-09T17:40:01Z"
  },
  {
    "title": "Why Greenland is indispensable to global climate science",
    "description": "With no Antarctica-style treaty to protect Greenland, a US takeover could mean scientists lose access.",
    "link": "https://theconversation.com/why-greenland-is-indispensable-to-global-climate-science-273064",
    "timestamp": "2026-01-09T17:39:45Z"
  },
  {
    "title": "As the Arctic warms up, the race to control the region is growing ever hotter",
    "description": "Competition between the US, Russia and China is shutting out regional statkeholders and ignoring the interests of Indigenous people.",
    "link": "https://theconversation.com/as-the-arctic-warms-up-the-race-to-control-the-region-is-growing-ever-hotter-273118",
    "timestamp": "2026-01-09T17:39:44Z"
  },
  {
    "title": "US calls Argentina peso bet a 'homerun deal'",
    "description": "The US Treasury Secretary said the US no longer held pesos in its exchange stabilisation fund.",
    "link": "https://www.bbc.com/news/articles/cwyngv1keq7o",
    "timestamp": "2026-01-09T17:39:08Z"
  },
  {
    "title": "Hard Revolution: Minneapolis, Marxism and 'Riot Ideology'",
    "description": "The riots that are likely to erupt in Minneapolis will have nothing to do with the death of a woman who was involved in an altercation with ICE officers. Her death will be the excuse that Marxists use to try and burn down the United States. We’ve been here be…",
    "link": "https://freerepublic.com/focus/f-chat/4361225/posts",
    "timestamp": "2026-01-09T17:38:37Z"
  },
  {
    "title": "Democrat-Led States Sue Trump Admin for 'Unlawful' Federal Childcare Funding Freeze",
    "description": "The Democratic attorneys general of California, Colorado, Illinois, Minnesota, and New York on Thursday sued President Donald Trump's administration over its \"extraordinary and cruel action to immediately freeze $10 billion in federal funds that plaintiff sta…",
    "link": "https://www.commondreams.org/news/childcare-funding",
    "timestamp": "2026-01-09T17:36:49Z"
  },
  {
    "title": "Begich votes against 3-year extension of federal health insurance subsidies as 17 Republicans defy House leadership to pass it",
    "description": "Alaska Rep. Nick Begich said extending subsidies would not fix the problems he sees with the Affordable Care Act, commonly known as Obamacare.",
    "link": "https://www.adn.com/politics/2026/01/09/begich-votes-against-3-year-extension-of-federal-health-insurance-subsidies-as-17-republicans-defy-house-leadership-to-pass-it/",
    "timestamp": "2026-01-09T17:34:28Z"
  },
  {
    "title": "Soros-Linked Philadelphia District Attorney Threatens ICE Agents: 'I Will Charge You with Those Crimes'",
    "description": "Larry Krasner is threatening ICE agents with arrest and conviction if they \"come to Philly to commit crimes.\" \nThe post Soros-Linked Philadelphia District Attorney Threatens ICE Agents: ‘I Will Charge You with Those Crimes’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2026/01/09/soros-linked-philadelphia-district-attorney-threatens-ice-agents-i-will-charge-you-those-crimes/",
    "timestamp": "2026-01-09T17:32:36Z"
  },
  {
    "title": "Joy Behar Shuts Down Tense Fight Between Ana Navarro And Sunny Hostin On ‘The View’: “Ana, We’re On Television!”",
    "description": "Neither woman would back down.",
    "link": "https://decider.com/2026/01/09/joy-behar-shuts-down-tense-fight-ana-navarro-sunny-hostin-view/",
    "timestamp": "2026-01-09T17:32:06Z"
  },
  {
    "title": "Surprise! Trump’s Not Done Messing Up the White House",
    "description": "The White House ballroom project is about to get even bigger.East Wing ballroom architect Shalom Baranes revealed new plans for the executive mansion Thursday, showcasing a previously unreported, one-story addition to the West Wing that he claimed would balan…",
    "link": "https://newrepublic.com/post/205127/donald-trump-white-house-renovation-west-wing",
    "timestamp": "2026-01-09T17:31:23Z"
  },
  {
    "title": "Live at 1PM ET – IT’S OVER! US Out of UN Climate Regime – The Climate Realism Show #187",
    "description": "We will also welcome a special guest, Lucy Biggers. Once a died-in-the-wool climate alarmist, Lucy came to see the light, and the truth, and is now one of America’s best communicators for climate realism.",
    "link": "https://wattsupwiththat.com/2026/01/09/live-at-1pm-et-its-over-us-out-of-un-climate-regime-the-climate-realism-show-187/",
    "timestamp": "2026-01-09T17:29:00Z"
  },
  {
    "title": "Matt Rogers told Las Culturistas listeners not to support Jasmine Crockett",
    "description": "Matt Rogers and Bowen Yang are not afraid to discuss their political beliefs on their podcast, Las Culturistas, and on their most recent episode, Rogers shared his feelings about Texas Democratic U.S. Rep. Jasmine Crockett's chances of winning a Senate seat: …",
    "link": "https://www.out.com/media/matt-rogers-jasmine-crockett",
    "timestamp": "2026-01-09T17:25:56Z"
  },
  {
    "title": "Trump meets with oil executives at White House, seeking investments",
    "description": "Trump meets with oil executives at White House, seeking investmentstwincities.com",
    "link": "https://www.twincities.com/2026/01/09/trump-venezuela-oil/",
    "timestamp": "2026-01-09T17:25:36Z"
  },
  {
    "title": "Minneapolis mayor demands transparent investigation into ICE shooting as protests spread",
    "description": "MINNEAPOLIS, Jan 9 (Reuters) - Minneapolis Mayor Jacob ‌Frey on Friday demanded the federal government permit state authorities to take part in the investigation into a U.S. immigration officer's fatal shooting of a 37-year-old woman ‌in her car, an incident …",
    "link": "https://www.thestar.com.my/news/world/2026/01/10/minneapolis-mayor-demands-transparent-investigation-into-ice-shooting-as-protests-spread",
    "timestamp": "2026-01-09T17:25:00Z"
  },
  {
    "title": "Ayatollah Khamenei Predicts Fall of Donald Trump as Iran Burns",
    "description": "Iranian Supreme Leader Ayatollah Ali Khamenei said in televised remarks on Friday that President Donald Trump would soon be “brought down” by his “arrogance,” even as massive protests against Khamenei and his brutal terrorist regime were raging across Iran.\nT…",
    "link": "https://www.breitbart.com/middle-east/2026/01/09/ayatollah-khamenei-predicts-fall-of-donald-trump-as-iran-burns/",
    "timestamp": "2026-01-09T17:24:40Z"
  },
  {
    "title": "‘Billions of dollars’ worth of oil’: Trump lays out ultimate goal for governing Venezuela",
    "description": "'Prisoners that nobody thought they would ever see again are being released'",
    "link": "https://www.wnd.com/2026/01/billions-dollars-worth-oil-trump-lays-ultimate-goal/",
    "timestamp": "2026-01-09T17:23:54Z"
  },
  {
    "title": "Mercosur moves forward as Ireland's concerns remain unresolved",
    "description": "As the EU’s largest trade deal moves towards ratification, Irish farmers warn Mercosur threatens beef prices, standards and livelihoods",
    "link": "https://www.irishexaminer.com/business/economy/arid-41772848.html",
    "timestamp": "2026-01-09T17:23:47Z"
  },
  {
    "title": "'Whiny babies' at ICE accused of playing the victim: 'Complete inverse of reality'",
    "description": "An analyst Friday called out MAGA and \"the narrative being spun by the lies\" after an ICE agent shot and killed 37-year-old mother Renee Nicole Good in Minneapolis this week. The MAGA world has pretended to play victim — both before the fatal shooting and aft…",
    "link": "https://www.rawstory.com/ice-victim-complex-whiny-babies/",
    "timestamp": "2026-01-09T17:23:20Z"
  },
  {
    "title": "Trump's move to ban big investors from buying houses isn't the solution to high home prices, industry watchers say",
    "description": "Big investors own a small fraction of America's single-family homes. But they're big players in certain Sun Belt markets. Trump wants to ban them.",
    "link": "https://www.businessinsider.com/trump-ban-wall-street-buying-houses-not-solution-home-prices-2026-1",
    "timestamp": "2026-01-09T17:22:56Z"
  },
  {
    "title": "The 2026 midterms: What to expect on this year’s electoral calendar",
    "description": "In November this year, 35 US Senate seats and all 435 US House seats will be up for election in the 2026 midterms. From primaries to the Congressional calendar, as the year begins, Peter Finn maps the political and electoral journey to November 3rd. This arti…",
    "link": "https://blogs.lse.ac.uk/usappblog/2026/01/09/the-2026-midterms-what-to-expect-on-this-years-electoral-calendar/",
    "timestamp": "2026-01-09T17:22:53Z"
  },
  {
    "title": "OPINION: No, They Are Not Allowed To Just Kill People, And It’s Weird As Hell You Think That",
    "description": "In the aftermath of the deadly ICE shooting in Minnesota, some people may need this reminder.",
    "link": "https://www.huffpost.com/entry/minnesota-shooting-extrajudicial-state-killings_n_695ff8f4e4b07c500938ee6f",
    "timestamp": "2026-01-09T17:22:14Z"
  },
  {
    "title": "Drifting Tanker Reveals Major Hurdle for Trump Plan to Revive Venezuela’s Oil",
    "description": "A tanker meandering in the Caribbean near Venezuela underscores the steep hurdles to ramping up the country’s oil production following the US capture of President Nicolás Maduro.",
    "link": "https://financialpost.com/pmn/business-pmn/drifting-tanker-reveals-major-hurdle-for-trump-plan-to-revive-venezuelas-oil",
    "timestamp": "2026-01-09T17:22:12Z"
  },
  {
    "title": "Outrage and Mistrust Mount at Federal Agents Who Shot Two People in Portland One Day After Renee Good’s Killing",
    "description": "US Border Patrol shot and injured two people in Portland on Thursday, just one day after an Immigration and Customs Enforcement agent named Jonathan Ross shot and killed US citizen Renee Nicole Good in Minneapolis.  People in Portland were already protesting …",
    "link": "https://www.motherjones.com/politics/2026/01/federal-agents-shot-and-injured-two-people-in-portland-one-day-after-renee-goods-killing/",
    "timestamp": "2026-01-09T17:21:50Z"
  },
  {
    "title": "Trump meets with oil executives at the White House on Friday, seeking investments in Venezuela",
    "description": "Chevon, ExxonMobil and ConocoPhillips are expected to attend.",
    "link": "https://www.bostonherald.com/2026/01/09/trump-venezuela-oil/",
    "timestamp": "2026-01-09T17:20:10Z"
  },
  {
    "title": "Trump meets with oil executives at the White House on Friday, seeking investments in Venezuela",
    "description": "Chevon, ExxonMobil and ConocoPhillips are expected to attend.",
    "link": "https://www.denverpost.com/2026/01/09/trump-venezuela-oil/",
    "timestamp": "2026-01-09T17:20:10Z"
  },
  {
    "title": "Machado to meet with Trump to give him her Nobel Peace Prize (Rachael Bade/The Inner Circle ...)",
    "description": "Rachael Bade / The Inner Circle, with Rachael Bade:\nMachado to meet with Trump to give him her Nobel Peace Prize  —  Venezuelan opposition leader MARÍA CORINA MACHADO has been pushing for an audience with President DONALD TRUMP to “give Trump her Nobel Peac…",
    "link": "https://www.memeorandum.com/260109/p57",
    "timestamp": "2026-01-09T17:20:00Z"
  },
  {
    "title": "Bari Weiss' New CBS Anchor Says People Mad About ICE Murders Need to Be 'Decent' to ICE Supporters",
    "description": "Barf Bag: Two days after verbally fellating Marco Rubio, Tony Dokoupil said the real problem is that Americans don't listen to each other.",
    "link": "https://www.jezebel.com/bari-weiss-new-cbs-anchor-says-people-mad-about-ice-murders-need-to-be-decent-to-ice-supporters",
    "timestamp": "2026-01-09T17:19:49Z"
  },
  {
    "title": "IRS sets a date for start of tax filing season. How to get ready.",
    "description": "Preapare now to be among the first to get a refund by filing your tax return on the first day of tax season. Here's when the IRS says that is.",
    "link": "https://www.usatoday.com/story/money/taxes/2026/01/09/tax-filing-season-opening-date-2026/88090840007/",
    "timestamp": "2026-01-09T17:16:48Z"
  },
  {
    "title": "Federal officers are leaving Louisiana immigration crackdown for Minneapolis, documents show",
    "description": "Trump has begun surging thousands of federal officers to Minnesota.",
    "link": "https://www.denverpost.com/2026/01/09/federal-enforcement-new-orleans-to-minneapolis/",
    "timestamp": "2026-01-09T17:16:31Z"
  },
  {
    "title": "Federal officers are leaving Louisiana immigration crackdown for Minneapolis, documents show",
    "description": "Trump has begun surging thousands of federal officers to Minnesota.",
    "link": "https://www.bostonherald.com/2026/01/09/federal-enforcement-new-orleans-to-minneapolis/",
    "timestamp": "2026-01-09T17:16:31Z"
  },
  {
    "title": "Minneapolis, Portland shootings spur protests over ICE crackdowns as outcry grows",
    "description": "Another round of protests were planned for Friday in Minneapolis over the killing of a local woman by an Immigration and Customs Enforcement officer during the Trump administration's latest immigration crackdown on a major city, a day after federal immigratio…",
    "link": "https://www.cbc.ca/news/world/protests-ice-shootings-minneapolis-portland-9.7039678",
    "timestamp": "2026-01-09T17:15:56Z"
  },
  {
    "title": "Venezuela Isn’t a Set of Talking Points — It’s a Country With a History",
    "description": "Longtime scholar of Venezuelan politics Geo Maher offers crucial context that is often missing from mainstream coverage.",
    "link": "https://organizingmythoughts.org/geo-maher-on-venezuela-popular-power-and-us-intervention/?ref=organizingmythoughts-newsletter",
    "timestamp": "2026-01-09T17:15:18Z"
  },
  {
    "title": "With Maduro gone and Venezuela’s oil cut off, Cuba is isolated and vulnerable",
    "description": "After decades of hostility, Venezuela’s support became crucial to Cuba’s survival.",
    "link": "https://theconversation.com/with-maduro-gone-and-venezuelas-oil-cut-off-cuba-is-isolated-and-vulnerable-273119",
    "timestamp": "2026-01-09T17:13:58Z"
  },
  {
    "title": "Trump Cancels ‘Previously Expected Second Wave of Attacks’ on Venezuela",
    "description": "\"The U.S.A. and Venezuela are working well together, especially as it pertains to rebuilding, in a much bigger, better, and more modern form, their oil and gas infrastructure.\"\nThe post Trump Cancels ‘Previously Expected Second Wave of Attacks’ on Venezuela f…",
    "link": "https://legalinsurrection.com/2026/01/trump-cancels-previously-expected-second-wave-of-attacks-on-venezuela/",
    "timestamp": "2026-01-09T17:13:25Z"
  },
  {
    "title": "Trump scored a win with his raid on Venezuela. But the US is now responsible for the country’s future - CNN",
    "description": "Trump scored a win with his raid on Venezuela. But the US is now responsible for the country’s futureCNN Letters to the Editor: There’s precedent for Trump’s assault on Venezuela. That’s the problemLos Angeles Times In Donald Trump’s world, the strong take wh…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180554522",
    "timestamp": "2026-01-09T17:13:10Z"
  },
  {
    "title": "Singer Sonia De Los Santos Cancels Kennedy Center Concert Over Trump",
    "description": "Singer-songwriter Sonia De Los Santos has cancelled her performances at the Trump-John F. Kennedy Center for the Performing Arts, over President Donald Trump's involvement with the organization.\nThe post Singer Sonia De Los Santos Cancels Kennedy Center Conce…",
    "link": "https://www.breitbart.com/entertainment/2026/01/09/singer-sonia-de-los-santos-cancels-kennedy-center-concert-over-trump/",
    "timestamp": "2026-01-09T17:12:49Z"
  },
  {
    "title": "Vance Announces New Deputy AG Role to Root Out Supposed “Fraud”",
    "description": "The Trump administration has frequently cited fraud as a basis for cutting benefits for US residents.",
    "link": "https://truthout.org/articles/vance-announces-new-deputy-ag-role-to-root-out-supposed-fraud/",
    "timestamp": "2026-01-09T17:12:39Z"
  },
  {
    "title": "A Few Defections Can’t Shake Trump’s Hold on GOP Congress",
    "description": "A few defections can’t shake Trump’s hold on Republicans in Congress. While some Republicans voted against Trump on Obamacare subsidies and a War Powers Resolution, his hold on the party remains strong.",
    "link": "http://nymag.com/intelligencer/article/a-few-defections-cant-shake-trumps-hold-on-gop-congress.html",
    "timestamp": "2026-01-09T17:11:04Z"
  },
  {
    "title": "NSA alum returns to agency to serve as deputy director",
    "description": "Tim Kosiba became the number two leader in the National Security Agency after a prior deputy pick was jettisoned following criticism from far-right activist Laura Loomer.",
    "link": "https://www.nextgov.com/people/2026/01/nsa-alum-returns-agency-serve-deputy-director/410589/",
    "timestamp": "2026-01-09T17:11:00Z"
  },
  {
    "title": "Closely following developments: India on US bill to impose tariffs on nations procuring Russian oil",
    "description": "NEW DELHI: India on Friday said it is closely following developments relating to a proposed legislation by the US that seeks to impose up to 500 per cent tariffs on countries procuring Russian crude oil. India and China are among a handful of countries which …",
    "link": "https://statetimes.in/closely-following-developments-india-on-us-bill-to-impose-tariffs-on-nations-procuring-russian-oil/",
    "timestamp": "2026-01-09T17:10:52Z"
  },
  {
    "title": "The Cowardice of Mark Zuckerberg (Adrian Carrasquillo/The Bulwark)",
    "description": "Adrian Carrasquillo / The Bulwark:\nThe Cowardice of Mark Zuckerberg  —  MARK ZUCKERBERG TOOK it personally.  —  Just hours after Donald Trump signed the executive order that would come to be known as the “Muslim ban” on January 27, 2017, Zuckerberg, the CEO o…",
    "link": "https://www.memeorandum.com/260109/p56",
    "timestamp": "2026-01-09T17:10:01Z"
  },
  {
    "title": "US intercepts third tanker in a week as it tightens control over Venezuelan oil",
    "description": "US forces boarded the tanker, with Donald Trump due to meet oil executives in the next stage of  his plan to take \"billions and billions dollars of oil from Venezuela\".",
    "link": "https://news.sky.com/story/us-intercepts-third-tanker-in-a-week-as-it-tightens-control-over-venezuelan-oil-13492557",
    "timestamp": "2026-01-09T17:08:00Z"
  },
  {
    "title": "Democrat On CNN Accuses Trump Deportation Forces Of ‘State-Sponsored Terrorism’ Amid Shootings",
    "description": "Rep. Janelle Bynum (D-OR) lashed out at President Donald Trump's \"goonish\" deportation force, accusing them of \"state-sponsored terrorism\" on CNN.\nThe post Democrat On CNN Accuses Trump Deportation Forces Of ‘State-Sponsored Terrorism’ Amid Shootings first ap…",
    "link": "https://www.mediaite.com/media/news/dem-on-cnn-accuses-trump-deportation-forces-of-state-sponsored-terrorism-amid-shootings/",
    "timestamp": "2026-01-09T17:07:51Z"
  },
  {
    "title": "US healthcare dealmakers hope for megamergers in 2026",
    "description": "Healthcare dealmakers are heading to San Francisco this weekend betting on a new wave of mega-mergers in 2026 that could eclipse the industry's standout years of 2019 and 2021 when such tie-ups approached half a trillion dollars, according to more than ⁠a doz…",
    "link": "https://www.rte.ie/news/business/2026/0109/1552362-us-healthcare-dealmakers-hope-for-megamergers-in-2026/",
    "timestamp": "2026-01-09T17:06:01Z"
  },
  {
    "title": "The Hit List: 5 UFC Fights We Want to See in 2026",
    "description": "No matches have been made official for the Ultimate Fighting Championship event at the White House on June 14, though there may be only one worthy of headlining such a historic card.",
    "link": "https://www.sherdog.com/news/articles/The-Hit-List-5-UFC-Fights-We-Want-to-See-in-2026-199683",
    "timestamp": "2026-01-09T17:05:52Z"
  },
  {
    "title": "Donald Trump Says Diddy 'Asked Me for a Pardon,' Reveals If He'll Grant It",
    "description": "Donald Trump is addressing the possibility of granting Sean “Diddy” Combs a presidential pardon. If you don’t know, the 56-year-old entertainer was sentenced to 50 months in prison after being convicted on two counts of transportation to engage in prostitutio…",
    "link": "https://www.justjared.com/2026/01/09/donald-trump-says-diddy-asked-me-for-a-pardon-reveals-if-hell-grant-it/",
    "timestamp": "2026-01-09T17:04:02Z"
  },
  {
    "title": "White House cage fight disrupts plans for international gathering: 'Utterly humiliating'",
    "description": "President Donald Trump's cage fighting match on the White House lawn is forcing the rescheduling of a planned international gathering.France announced it will delay this year's Group of 7 summit to avoid a scheduling conflict with the mixed martial arts event…",
    "link": "https://www.rawstory.com/white-house-south-lawn-ufc/",
    "timestamp": "2026-01-09T17:01:26Z"
  },
  {
    "title": "Abolish ICE or GTFO",
    "description": "Elie Mystal\n\n\n\nIn this week’s Elie v. US, The Nation’s justice correspondent makes the case to get rid of ICE, explores George Conway’s congressional campaign—and shares his New Year’s resolution. \r\n\n\r\n\n\nThe post Abolish ICE or GTFO appeared first on The Nati…",
    "link": "https://www.thenation.com/article/politics/newsletter-abolish-ice-conway/",
    "timestamp": "2026-01-09T17:01:18Z"
  },
  {
    "title": "Iran escalates threats against protesters as demonstrations continue",
    "description": "Iran escalated its threats against demonstrators on Saturday, with the country’s attorney general warning that anyone taking part in protests will be considered an “enemy of God,” a death-penalty charge.",
    "link": "https://www.cbc.ca/news/world/iran-threats-protestors-9.7040931",
    "timestamp": "2026-01-09T17:00:37Z"
  },
  {
    "title": "‘We don’t know what’s coming’: Unease in Greenland as Donald Trump revives Arctic ambition",
    "description": "A capital city on the edge of the world finds itself at centre of international power play",
    "link": "https://www.irishtimes.com/world/2026/01/09/we-dont-know-whats-coming-unease-in-greenland-as-donald-trump-revives-arctic-ambition/",
    "timestamp": "2026-01-09T17:00:28Z"
  },
  {
    "title": "Thanks to President Trump, the Fall of the Islamist Regime in Iran Is a Real Possibility",
    "description": "Thanks to President Trump, the fall of the Islamist Regime in Iran and the return of the Shah are real possibilities.\nThe post Thanks to President Trump, the Fall of the Islamist Regime in Iran Is a Real Possibility appeared first on The Gateway Pundit.",
    "link": "https://joehoft.com/thanks-to-president-trump-the-fall-of-the-islamist-regime-in-iran-and-the-return-of-the-shah-are-real-possibilities/",
    "timestamp": "2026-01-09T17:00:25Z"
  },
  {
    "title": "As Trump promises Venezuelan renaissance, locals struggle with crumbling economy",
    "description": "CARACAS, Venezuela (AP) — At the White House, President Donald Trump vows American intervention in Venezuela will pour billions of dollars into the country’s infrastructure, revive its once-thriving oil industry and eventually deliver a new age of prosperity …",
    "link": "https://financialpost.com/pmn/business-pmn/as-trump-promises-venezuelan-renaissance-locals-struggle-with-crumbling-economy-2",
    "timestamp": "2026-01-09T17:00:07Z"
  },
  {
    "title": "Is the US unlocking Venezuela’s oil wealth or exploiting it?",
    "description": "President Donald Trump aims to control and revive Venezuela's oil industry. Critics call it modern-day colonialism.",
    "link": "https://www.aljazeera.com/video/counting-the-cost/2026/1/9/is-the-us-unlocking-venezuelas-oil-wealth-or-exploiting-it",
    "timestamp": "2026-01-09T17:00:00Z"
  },
  {
    "title": "A long wait for a call: what Trump’s silence says about Britain’s place in the world",
    "description": "Keir Starmer’s political critics may try to blame him for being ‘on the outside looking in’ but the world has changed for Britain",
    "link": "https://www.irishtimes.com/world/uk/2026/01/09/a-long-wait-for-a-call-what-trumps-silence-says-about-britains-place-in-the-world/",
    "timestamp": "2026-01-09T17:00:00Z"
  },
  {
    "title": "5 states sue Trump administration for withholding billions in social safety net funds",
    "description": "Attorneys general in five states have filed a lawsuit against Trump's administration after it said it would freeze money for several public benefit programs.",
    "link": "https://www.pbs.org/newshour/nation/5-states-sue-trump-administration-for-withholding-billions-in-social-safety-net-funds",
    "timestamp": "2026-01-09T16:58:50Z"
  },
  {
    "title": "Democrats Say Things Would Be Much Safer If Law Enforcement Would Just Stop Trying To Enforce The Law",
    "description": "WASHINGTON, D.C. — Following recent ICE-related shootings, Democrat leaders stepped forward to remind the nation that everything would be much safer if law enforcement would just stop enforcing the law.",
    "link": "https://babylonbee.com/news/democrats-say-things-would-be-much-safer-if-law-enforcement-would-just-stop-trying-to-enforce-the-law",
    "timestamp": "2026-01-09T16:58:46Z"
  },
  {
    "title": "Archbishop Viganò - Letter #2 to President Donald Trump",
    "description": "Mister President,Allow me to address you at this hour in which the fate of the whole world is being threatened by a global conspiracy against God and humanity. I write to you as an Archbishop, as a Successor of the Apostles, as the former Apostolic Nuncio to …",
    "link": "https://freerepublic.com/focus/f-chat/4361222/posts",
    "timestamp": "2026-01-09T16:58:43Z"
  },
  {
    "title": "Trump To NY Times: I Am International Law",
    "description": "In an interview with the NY Times, Trump claimed when it comes to international law, the only constraint on his power is his own mortality.\nWith a Republican controlled Congress that has abdicated its duty under Mike Johnson, Trump, in senescence believes he …",
    "link": "https://crooksandliars.com/2026/01/trump-ny-times-i-am-international-law",
    "timestamp": "2026-01-09T16:57:58Z"
  },
  {
    "title": "Anti-American BRICS Group Announces War Games for 'Peace' in 2026",
    "description": "The Chinese Defense Ministry confirmed on Friday that its military, alongside those of Russia and South Africa, would engage in drills known as \"Will for Peace 2026\" off the coast of South Africa.\nThe post Anti-American BRICS Group Announces War Games for ‘Pe…",
    "link": "https://www.breitbart.com/asia/2026/01/09/anti-american-brics-group-announces-war-games-for-peace-in-2026/",
    "timestamp": "2026-01-09T16:54:37Z"
  },
  {
    "title": "Somali Democrat Who Came To US Two Decades Ago Still Can’t Speak Clear English",
    "description": "Democratic Oregon state Sen. Kayse Jama is audibly incapable of speaking fluent English despite having moved to the U.S. nearly three decades ago.",
    "link": "https://dailycaller.com/2026/01/09/somali-democrat-kayse-jama-cant-speak-clear-english/",
    "timestamp": "2026-01-09T16:54:37Z"
  },
  {
    "title": "Shame on the White House Press Corps for Failing to Challenge Vance Tirade",
    "description": "The White House Press Corps has hit a shocking new low after allowing Vice President JD Vance to spew lies unchallenged, and scold a woman for her own death like a wild-eyed carnival barker.\nThe post Shame on the White House Press Corps for Failing to Challen…",
    "link": "https://www.mediaite.com/opinion/shame-on-the-white-house-press-corps-for-failing-to-challenge-vance-tirade/",
    "timestamp": "2026-01-09T16:52:15Z"
  },
  {
    "title": "Trump revealed some of Friday's jobs data early in post the prior day",
    "description": "The president indicated that private sector payrolls had expanded by 654,000, a total that would have included Friday's jobs count for December.",
    "link": "https://www.cnbc.com/2026/01/09/trump-revealed-jobs-data-early.html",
    "timestamp": "2026-01-09T16:51:02Z"
  }
]