[
  {
    "title": "Amid Tariff Row, Trump Says Had \"Extremely Productive\" Call With Canada PM",
    "description": "US President Donald Trump said he had an &quot;extremely productive&quot; first call Friday with Canadian Prime Minister Mark Carney, despite tensions over tariffs and Trump&#039;s recent calls to annex his northern neighbor.",
    "link": "https://www.ndtv.com/world-news/donald-trump-says-had-extremely-productive-call-with-canada-pm-mark-carney-8034220",
    "timestamp": "2025-03-28T15:27:41Z"
  },
  {
    "title": "What We Know About the Students Targeted by ICE",
    "description": "Federal agents grabbed a Tufts University student off the street, apparently because she wrote an op-ed. The shocking arrest is the latest in Trump’s crackdown on foreign students.",
    "link": "http://www.thecut.com/article/what-we-know-rumeysa-ozturk-students-targeted-by-ice.html",
    "timestamp": "2025-03-28T15:27:33Z"
  },
  {
    "title": "Fleeing Trump: Four Americans Who Chose Mexico",
    "description": "Americans have long been lured to Mexico by its weather, culture and lower cost of living.",
    "link": "https://www.ibtimes.com/fleeing-trump-four-americans-who-chose-mexico-3768031",
    "timestamp": "2025-03-28T15:27:20Z"
  },
  {
    "title": "Greenland’s New Government Has One Main Goal: Defying Trump",
    "description": "Greenland’s political parties have united under a new political goal: opposing U.S. aggression.\r\nFour political parties in the self-governing territory formed a coalition government Friday to project unity against Donald Trump’s efforts to take control of the…",
    "link": "https://newrepublic.com/post/193311/greenland-government-goal-donald-trump",
    "timestamp": "2025-03-28T15:26:50Z"
  },
  {
    "title": "Trans activists set 'survival skills' focus amid Trump's executive orders for Trans Day of Visibility weekend",
    "description": "Several blue cities across the country are gearing up for Trans Day of Visibility on March 31 with events and protests planned against President Trump's executive orders.",
    "link": "https://www.foxnews.com/politics/trans-activists-set-survival-skills-focus-amid-trumps-executive-orders-trans-visibility-day-weekend",
    "timestamp": "2025-03-28T15:26:47Z"
  },
  {
    "title": "Donald Trump Reveals Next Steps After First Call with Mark Carney",
    "description": "Friday's call marked Trump's first with Carney since he was elected leader of Canada's ruling Liberal Party on March 9.",
    "link": "https://www.newsweek.com/donald-trump-reveals-next-steps-after-first-call-mark-carney-2052140",
    "timestamp": "2025-03-28T15:25:17Z"
  },
  {
    "title": "Trump, Carney had 'extremely productive call'",
    "description": "United States President Donald Trump said on Friday that he had an \"extremely productive call\" with Canadian Prime Minister Mark Carney as the trade dispute between the two countries heated up. Trump ...",
    "link": "https://biztoc.com/x/8e05d160df2f46d8",
    "timestamp": "2025-03-28T15:23:29Z"
  },
  {
    "title": "Trump has made America hated around the world. Here’s a sign of how bad it’s getting",
    "description": "Canadians don’t want to travel to the United States as President Donald Trump continues to ramp up his trade war around the world.\nFuture flight bookings from Canada to the U.S. have dropped 70% for every month through the end of September, according to data …",
    "link": "https://biztoc.com/x/6b3b2469496ba546",
    "timestamp": "2025-03-28T15:23:17Z"
  },
  {
    "title": "Fleeing Trump: four Americans who chose Mexico",
    "description": "Americans have long been lured to Mexico by its weather, culture and lower cost of living. Now some of the US citizens heading south of the border say they have another reason: Donald Trump. Discrimination, the erosion of civil rights, government cutbacks, po…",
    "link": "https://www.digitaljournal.com/world/fleeing-trump-four-americans-who-chose-mexico/article",
    "timestamp": "2025-03-28T15:23:15Z"
  },
  {
    "title": "WANTED: The FBI I Once Knew",
    "description": "The FBI finds itself in a time of great change. Over the course of its existence, the bureau has had its share of successes, but... Read More\nThe post WANTED: The FBI I Once Knew appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/28/wanted-fbi-once-knew/",
    "timestamp": "2025-03-28T15:23:12Z"
  },
  {
    "title": "Trump Asks Supreme Court To Lift Ban On Deportations Under Emergency Law",
    "description": "US President Donald Trump on Friday appealed to the Supreme Court to lift a ban on deportations under the 1798 Alien Enemies Act, which he has used to target alleged gang members.",
    "link": "https://www.ndtv.com/world-news/donald-trump-asks-supreme-court-to-lift-ban-on-deportations-under-emergency-law-8034188",
    "timestamp": "2025-03-28T15:22:52Z"
  },
  {
    "title": "RFK Jr. sparks controversy, says he is having fun on the same day he fired 10,000 employees from the Department of Health",
    "description": "Explore the controversy surrounding RFK Jr.’s HHS job cuts announcement, worker reactions, and the fallout from his \"having fun\" remark during a podcast meeting. Learn about the $1.8B savings plan.",
    "link": "https://economictimes.indiatimes.com/news/international/us/rfk-jr-sparks-controversy-says-he-is-having-fun-on-the-same-day-he-fired-10000-employees-from-the-department-of-health/articleshow/119662987.cms",
    "timestamp": "2025-03-28T15:22:12Z"
  },
  {
    "title": "EXCLUSIVE: Left-Wing Programming Alive And Well Inside Massive US Food Conglomerate, Report Says",
    "description": "Kellanova promoted a host of \"woke\" policies, including efforts to prevent against climate change, according to a report from Consumer's Research.",
    "link": "https://dailycaller.com/2025/03/28/exclusive-left-wing-programming-alive-and-well-inside-massive-us-food-conglomerate-report-says/",
    "timestamp": "2025-03-28T15:20:46Z"
  },
  {
    "title": "Trump Reportedly Shuts Off Flow of Taxpayer Dollars Into World Trade Organization",
    "description": "DAILY CALLER NEWS FOUNDATION—The Trump administration has reportedly suspended financial contributions to the World Trade Organization (WTO) as of Thursday. The decision comes as part... Read More\nThe post Trump Reportedly Shuts Off Flow of Taxpayer Dollars I…",
    "link": "https://www.dailysignal.com/2025/03/28/trump-reportedly-shuts-off-flow-taxpayer-dollars-into-world-trade-organization/",
    "timestamp": "2025-03-28T15:20:01Z"
  },
  {
    "title": "Republicans, Men Push Trump Approval Higher in Second Term (Gallup)",
    "description": "Gallup:\nRepublicans, Men Push Trump Approval Higher in Second Term  —  Black, Hispanic adults more approving of Trump in second term, but still disapprove of him overall  —  WASHINGTON, D.C. — Key members of President Donald Trump's political base — Republica…",
    "link": "https://www.memeorandum.com/250328/p49",
    "timestamp": "2025-03-28T15:20:01Z"
  },
  {
    "title": "Another law firm targeted by Trump, Jenner and Block, suing to block executive order (Alexander Mallin/ABC News)",
    "description": "Alexander Mallin / ABC News:\nAnother law firm targeted by Trump, Jenner and Block, suing to block executive order  —  The firm said the order threatens “its clients and the legal system itself.”  —  President Donald Trump displays an executive order he signed…",
    "link": "https://www.memeorandum.com/250328/p47",
    "timestamp": "2025-03-28T15:20:01Z"
  },
  {
    "title": "Trump asks Supreme Court for permission to resume deporting Venezuelan migrants under wartime law",
    "description": "The Trump administration is asking the Supreme Court for permission to resume deportations of Venezuelan migrants to El Salvador under an 18th century wartime law, while a court fight continues.",
    "link": "https://www.pbs.org/newshour/nation/trump-asks-supreme-court-for-permission-to-resume-deporting-venezuelan-migrants-under-wartime-law",
    "timestamp": "2025-03-28T15:19:37Z"
  },
  {
    "title": "'MAGA junkie' breaks into tears after DOGE eliminates her job: 'I expected better'",
    "description": "A self-described \"MAGA junkie\" from West Virginia tearfully recanted her vote for Donald Trump after her job was eliminated by the Department of Government Efficiency.Jennifer Piggott, of Parkersburg, told CNN that she once flew a Trump flag outside her house…",
    "link": "https://www.rawstory.com/doge-job-cuts-treasury/",
    "timestamp": "2025-03-28T15:19:26Z"
  },
  {
    "title": "FACT CHECK: Facebook Video Does Not Show Authentic Fox News Report About ‘Tesla Ionic Care’",
    "description": "A video shared on Facebook purports to show an authentic Fox News report about “Tesla Ionic Care.” Verdict: False Both Lead Stories and Logically Facts reported that the clip is not authentic. An artificial intelligence (AI) expert also denied the clip’s auth…",
    "link": "https://checkyourfact.com/2025/03/28/fact-check-video-fox-news-report-tesla-ionic-care/",
    "timestamp": "2025-03-28T15:19:10Z"
  },
  {
    "title": "Inflation to the left, Trump to the right — what's the Fed to do?",
    "description": "The Federal Reserve may get stuck between President Donald Trump’s public demands for interest rate cuts and the central bank’s mandate to curb inflation after its favorite price measure picked up by more than expected in February.Read more...",
    "link": "https://qz.com/fed-inflation-rates-trump-trade-war-tariffs-consumption-1851773044",
    "timestamp": "2025-03-28T15:19:00Z"
  },
  {
    "title": "Lululemon Stock Tanks 15% As Tariffs And Recession Concerns Threaten Canadian Retailer",
    "description": "The Vancouver-based athleisure titan warned of a “more cautious consumer” as the tariff-driver, ever shifting economic backdrop eats into shoppers’ confidence.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/28/lululemon-stock-tanks-15-as-tariffs-and-recession-concerns-threaten-canadian-retailer/",
    "timestamp": "2025-03-28T15:18:44Z"
  },
  {
    "title": "Rubio Says They've Revoked At Least 300 Student Visas Related To Campus Protests",
    "description": "“We’re looking every day for these lunatics that are tearing things up,\" said the secretary of state.",
    "link": "https://www.huffpost.com/entry/rubio-says-hundreds-student-visa-revoked_n_67e69fe1e4b0f69ef1d35b7d",
    "timestamp": "2025-03-28T15:18:38Z"
  },
  {
    "title": "Putin says Trump plans for Greenland ‘has nothing to do’ with Russia",
    "description": "Russian President Vladimir Putin says President Donald Trump's ambitions for Greenland has \"nothing to do\" with Russia as Vice President JD Vance lands to assess security base.",
    "link": "https://www.foxnews.com/world/putin-says-trump-plans-greenland-has-nothing-do-russia",
    "timestamp": "2025-03-28T15:18:26Z"
  },
  {
    "title": "Kiev can’t control its own military – Kremlin",
    "description": "Ukraine’s forces are disregarding the US-backed ceasefire and are striking Russian energy infrastructure, Moscow has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614918-kiev-cannot-control-military-kremlin/",
    "timestamp": "2025-03-28T15:16:07Z"
  },
  {
    "title": "Kristi Noem flaunts a $60,000 Rolex watch while filming a tough-on-crime promo inside one of the world’s most notorious prisons",
    "description": "Kristi Noem's controversial video inside El Salvador's CECOT prison warns undocumented immigrants, wearing a $60,000 Rolex. This move sparks outrage over her harsh stance and the extravagant watch. Critics slam her rhetoric and legality concerns, while Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/us/kristi-noem-flaunts-a-60000-rolex-watch-while-filming-a-tough-on-crime-promo-inside-one-of-the-worlds-most-notorious-prisons/articleshow/119662578.cms",
    "timestamp": "2025-03-28T15:15:21Z"
  },
  {
    "title": "The Next Generation of Golden Visas – Skift Travel Podcast",
    "description": "Golden visas are becoming more common around the world, but they've posed some problems for authorities. We discuss the issues around them in this week's episode of the Skift Travel Podcast. -Rashaad Jorden",
    "link": "http://skift.com/2025/03/28/the-next-generation-of-golden-visas-skift-travel-podcast/",
    "timestamp": "2025-03-28T15:13:50Z"
  },
  {
    "title": "US Fed's Preferred Inflation Gauge Shows Some Cause For Concern",
    "description": "The US Federal Reserve's preferred inflation measure was largely unchanged last month, according to government data published Friday, but a widely scrutinized gauge of underlying price pressures rose.",
    "link": "https://www.ibtimes.com/us-feds-preferred-inflation-gauge-shows-some-cause-concern-3768029",
    "timestamp": "2025-03-28T15:12:15Z"
  },
  {
    "title": "In Major Upset, Democrats Credit Trump for Flipping Republican Seat in Pennsylvania Election",
    "description": "Democrats flipped a state Senate seat in heavily Republican Lancaster County, Pennsylvania, during a special election Tuesday, and the Democrat senator-elect is crediting President Donald... Read More\nThe post In Major Upset, Democrats Credit Trump for Flippi…",
    "link": "https://www.dailysignal.com/2025/03/28/major-upset-democrats-credit-trump-flipping-republican-seat-pennsylvania-election/",
    "timestamp": "2025-03-28T15:12:12Z"
  },
  {
    "title": "Trump Makes Supreme Court Request on Deportations",
    "description": "President Donald Trump asked the Supreme Court for permission to continue using the Alien Enemies Act.",
    "link": "https://biztoc.com/x/e4acfd8ddbc66e6f",
    "timestamp": "2025-03-28T15:12:06Z"
  },
  {
    "title": "Does the U.S. Auto Industry Need Protection?",
    "description": "In the statement announcing the new tariffs on cars and auto parts, President Donald Trump invokes Section 232 of the Trade Expansion Act of 1962, which provides the president with the authority to adjust imports coming into the United States “in quantities o…",
    "link": "https://biztoc.com/x/de6db58f7c57c0a6",
    "timestamp": "2025-03-28T15:11:48Z"
  },
  {
    "title": "Trump asks US top court to allow deportations of Venezuelan gang members under Alien Enemies Act",
    "description": "The Trump administration on Friday asked the Supreme Court to lift lower court orders blocking deportations of alleged Venezuelan gang members under the wartime Alien Enemies Act. The Justice Department argues for presidential authority in national security d…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-asks-us-top-court-to-allow-deportations-of-venezuelan-gang-members-under-alien-enemies-act/articleshow/119662616.cms",
    "timestamp": "2025-03-28T15:11:41Z"
  },
  {
    "title": "Elon Musk Announces Plans for 24-Hour Tesla Diner in Hollywood, Leftists Have Meltdown",
    "description": "Elon Musk is reportedly planning to open a 24-hour Tesla diner in Hollywood, which will include a drive-in theater charging station. Leftists are having a meltdown in response, including turning their ire on a prominent restaurant owner who said Musk's plan i…",
    "link": "https://www.breitbart.com/tech/2025/03/28/elon-musk-announces-plans-for-24-hour-tesla-diner-in-hollywood-leftists-have-meltdown/",
    "timestamp": "2025-03-28T15:11:35Z"
  },
  {
    "title": "Trump Asks Supreme Court to Let Venezuelan Deportations Resume (Greg Stohr/Bloomberg)",
    "description": "Greg Stohr / Bloomberg:\nTrump Asks Supreme Court to Let Venezuelan Deportations Resume  —  Donald Trump asked the US Supreme Court to let his administration resume deporting alleged Venezuelan gang members without hearings, escalating a high-profile showdown …",
    "link": "https://www.memeorandum.com/250328/p46",
    "timestamp": "2025-03-28T15:10:01Z"
  },
  {
    "title": "Oh No! Elon Musk Threatens Rep. Maxine Waters Over Melania Trump Deportation Comments",
    "description": "While Teslas are burning and Americans continue to call for Elon Musk to get his hands out of the federal government, it seems the billionaire CEO has other things on his mind. More specifically, Musk is coming for California Rep. Maxine Waters for comments s…",
    "link": "https://www.theroot.com/oh-no-elon-musk-threatens-rep-maxine-waters-over-mela-1851773056",
    "timestamp": "2025-03-28T15:10:00Z"
  },
  {
    "title": "Trump administration asks Supreme Court to allow deportations of migrants to El Salvador under wartime law",
    "description": "The emergency appeal to the high court follows a rejection of the Republican administration’s plea to the federal appeals court in Washington.",
    "link": "https://nypost.com/2025/03/28/us-news/trump-administration-asks-the-supreme-court-to-lift-an-order-barring-deportations-under-wartime-law/",
    "timestamp": "2025-03-28T15:07:50Z"
  },
  {
    "title": "Trump Makes Supreme Court Request on Deportations",
    "description": "President Donald Trump asked the Supreme Court for permission to continue using the Alien Enemies Act.",
    "link": "https://www.newsweek.com/trump-makes-supreme-court-request-deportations-2052118",
    "timestamp": "2025-03-28T15:06:25Z"
  },
  {
    "title": "Trump Brings Back Confederate Statues in One of His Most Racist Orders",
    "description": "Donald Trump is bringing Confederate statues back.\r\nOn Thursday, Trump signed an executive order titled “Restoring Truth and Sanity in America” that instructs Vice President JD Vance to terminate any activity he sees as “anti-American ideology” from the natio…",
    "link": "https://newrepublic.com/post/193301/trump-confederate-statues-anti-american-ideology-order",
    "timestamp": "2025-03-28T15:06:02Z"
  },
  {
    "title": "Trump Demolishes Federal Workers’ Union Rights Ahead of Mass Firing",
    "description": "Donald Trump plans to ramp up his purge of the federal workforce and end union rights for many government employees at the same time. \r\nThe Washington Post on Thursday obtained an internal White House document outlining plans for 22 federal agencies to cut be…",
    "link": "https://newrepublic.com/post/193303/trump-federal-workers-union-rights-firing",
    "timestamp": "2025-03-28T15:05:32Z"
  },
  {
    "title": "A Public Company Boasting Trump's Sons on Advisory Board Is Buying BlackRock Bitcoin ETFs",
    "description": "Dominari Holdings, a wealth management firm, announced during an earnings report on Friday that it would use a portion of its excess cash to buy shares of the iShares Bitcoin Trust.",
    "link": "https://www.coindesk.com/business/2025/03/28/a-public-company-boasting-trump-s-sons-on-advisory-board-is-buying-blackrock-bitcoin-etfs",
    "timestamp": "2025-03-28T15:05:16Z"
  },
  {
    "title": "Elise Stefanik Cancels The Drapes",
    "description": "Farewell to a dream.",
    "link": "https://www.wonkette.com/p/elise-stefanik-cancels-the-drapes",
    "timestamp": "2025-03-28T15:04:06Z"
  },
  {
    "title": "Nikola founder Trevor Milton has been pardoned by Trump",
    "description": "Trevor Milton, who was sentenced to prison in 2023 for misleading investors about Nikola's trucks, first shared news of his pardon on Instagram.",
    "link": "https://www.businessinsider.com/nikola-founder-trevor-milton-ev-startup-pardoned-by-trump-2025-3",
    "timestamp": "2025-03-28T15:03:33Z"
  },
  {
    "title": "Elon Musk Doubles Down on Calling Mark Kelly a Traitor",
    "description": "Musk defended his decision to brand the Arizona senator and former astronaut as a traitor over his support for Ukraine.",
    "link": "https://www.newsweek.com/elon-musk-mark-kelly-traitor-2052019",
    "timestamp": "2025-03-28T15:02:41Z"
  },
  {
    "title": "Filipino Ambassador Issues Warning to US Green Card Holders Amid Crackdown",
    "description": "Jose Manuel Romualdez warned on Friday that holding a green card is \"not a right.\"",
    "link": "https://www.newsweek.com/filipino-ambassador-jose-manuel-romualdez-warning-green-cards-trump-2052055",
    "timestamp": "2025-03-28T15:02:23Z"
  },
  {
    "title": "Trump asks Supreme Court for permission to resume deporting Venezuelan migrants under wartime law",
    "description": "The emergency appeal to the high court Friday follows a rejection of the Republican administration’s plea to the federal appeals court in Washington.",
    "link": "https://www.bostonherald.com/2025/03/28/trump-deportations-supreme-court/",
    "timestamp": "2025-03-28T15:02:16Z"
  },
  {
    "title": "Trump asks Supreme Court for permission to resume deporting Venezuelan migrants under wartime law",
    "description": "The emergency appeal to the high court Friday follows a rejection of the Republican administration’s plea to the federal appeals court in Washington.",
    "link": "https://www.denverpost.com/2025/03/28/trump-deportations-supreme-court/",
    "timestamp": "2025-03-28T15:02:16Z"
  },
  {
    "title": "Dani Alves acquitted of rape charges by Spanish court; travel ban dismissed",
    "description": "Former Barcelona star Dani Alves has been acquitted of rape charges after the Catalan High Court overturned his conviction in the matter. Alves, who spent over a year in prison, was released on bail earlier this year. The Spanish Supreme Court may still revie…",
    "link": "https://economictimes.indiatimes.com/news/international/us/dani-alves-acquitted-of-rape-charges-by-spanish-court-travel-ban-dismissed/articleshow/119662052.cms",
    "timestamp": "2025-03-28T15:01:36Z"
  },
  {
    "title": "Vladimir Putin mocks Britain while claiming he will 'finish off' Ukraine in chilling comment",
    "description": "Russian President Vladimir Putin has mocked Britain and claimed he will 'finish off' Ukraine.",
    "link": "https://www.ladbible.com/news/politics/vladimir-putin-mocks-britain-russia-ukraine-chilling-comment-992039-20250328",
    "timestamp": "2025-03-28T15:01:32Z"
  },
  {
    "title": "Stock market today: Global shares skid as investors await more Trump tariffs",
    "description": "Stock market today: Wall Street drops following discouraging updates on US shoppers and inflation\nNEW YORK (AP) — U.S. stocks are falling Friday following discouraging updates on inflation and how much U.S. households may be willing to spend given all the unc…",
    "link": "https://biztoc.com/x/fdc573a9689788d0",
    "timestamp": "2025-03-28T15:01:11Z"
  },
  {
    "title": "Chipmaker Wolfspeed's shares plunge over 45% to 27-year low",
    "description": "Wolfspeed's shares slumped about 48 per cent on Friday, hitting their lowest since 1998, a day after the chipmaker appointed a new CEO amid its struggles to improve its financial position.The company on Thursday named chip industry veteran Robert Feurle as it…",
    "link": "https://www.channelnewsasia.com/business/chipmaker-wolfspeeds-shares-plunge-over-45-27-year-low-5031026",
    "timestamp": "2025-03-28T15:01:09Z"
  },
  {
    "title": "Chipmaker Wolfspeed's shares hit 27-year low over uncertain federal funding",
    "description": "Wolfspeed's shares lost half their value on Friday, hitting their lowest level since 1998, as funding through a Joe Biden-era legislation that promised subsidies for chip making in the United States remains uncertain.Wolfspeed is waiting on about $750 million…",
    "link": "https://www.channelnewsasia.com/business/chipmaker-wolfspeeds-shares-hit-27-year-low-over-uncertain-federal-funding-5031026",
    "timestamp": "2025-03-28T15:01:09Z"
  },
  {
    "title": "Jen Psaki Says With Straight Face Not To ‘Treat Everyone Like They Are Stupid’ After Years Of Saying Biden Was With It",
    "description": "Jen Psaki asserted that people shouldn't be treated like they're stupid after claiming for years that former President Joe Biden was mentally healthy.",
    "link": "https://dailycaller.com/2025/03/28/jen-psaki-biden-health-signal-morning-joe/",
    "timestamp": "2025-03-28T15:00:58Z"
  },
  {
    "title": "The 'Meritocracy' Lie",
    "description": "On Inauguration Day, President Donald Trump vowed to \"forge a society that is colorblind and merit-based.\" \nLess than two weeks later, Vice President J.D. Vance's office hired Buckley Carlson—the 24-year-old son of former Fox News host and popular conservativ…",
    "link": "https://biztoc.com/x/b1b94232726433a6",
    "timestamp": "2025-03-28T15:00:58Z"
  },
  {
    "title": "Nikola founder Trevor Milton has been pardoned by Trump",
    "description": "Nikola founder Trevor Milton has been pardoned by President Donald Trump.\nMassimo Pinca/Reuters\nElectric vehicle company Nikola's founder, Trevor Milton, has been pardoned by President Donald Trump.\nMilton said in an Instagram video that Trump called and gave…",
    "link": "https://biztoc.com/x/572470041b8ce3ce",
    "timestamp": "2025-03-28T15:00:50Z"
  },
  {
    "title": "Here’s why Musk, Bezos, Gates and Thiel really all want a piece of Greenland",
    "description": "Silicon Valley sources — who take credit for the idea of buying Greenland — view it as deeply tied to America’s ambitions in space and information technology, and a critical “play for the future.&#…",
    "link": "https://nypost.com/2025/03/28/business/why-musk-bezos-and-gates-all-want-a-piece-of-greenland/",
    "timestamp": "2025-03-28T15:00:48Z"
  },
  {
    "title": "Trump asks SCOTUS to unblock some deportations",
    "description": "The administration of United States President Donald Trump asked on Friday the US Supreme Court to quash the previous federal court ruling blocking deportations of Venezuelan gang members under the Al...",
    "link": "https://biztoc.com/x/5e60253d96a80090",
    "timestamp": "2025-03-28T15:00:48Z"
  },
  {
    "title": "India wants US to address non-tariff barriers while it readies to cut some tariffs",
    "description": "India seeks to reduce US non-tariff barriers for exporters, while preparing for reciprocal tariffs on April 2.",
    "link": "https://www.thehindubusinessline.com/economy/india-wants-us-to-address-non-tariff-barriers-while-it-readies-to-cut-some-tariffs/article69386631.ece",
    "timestamp": "2025-03-28T15:00:34Z"
  },
  {
    "title": "Trump Is Sending Mixed Signals to Oil Markets",
    "description": "Oil prices are set to post a third weekly gain on the back of Trump hindering supply from Iran and Venezuela, but his economic policies are threatening to damage demand in the long term.   Friday, March 28th, 2025 Trump has been the single biggest oil market …",
    "link": "https://oilprice.com/Energy/Energy-General/Trump-Is-Sending-Mixed-Signals-to-Oil-Markets.html",
    "timestamp": "2025-03-28T15:00:00Z"
  },
  {
    "title": "U.S. Pauses Funds to World Trade Organization",
    "description": "“The United States has paused contributions to the World Trade Organization, as U.S. President Donald Trump's administration ramps up efforts to cut government spending,” Reuters reports. “The Trump administration is retreating from global institutions it",
    "link": "https://politicalwire.com/2025/03/28/u-s-pauses-funds-to-world-trade-organization/",
    "timestamp": "2025-03-28T15:00:00Z"
  },
  {
    "title": "Ted Cruz: Democrats 'Don't Stand for Anything Other than Rage and Hatred'",
    "description": "Thursday, during an appearance on FNC's \"Hannity,\" Sen. Ted Cruz (R-TX) reacted to Rep. Jasmine Crockett (D-TX), a fellow Texan, saying Cruz needed \"to be knocked over the head.\"\nThe post Ted Cruz: Democrats ‘Don’t Stand for Anything Other than Rage and Hatre…",
    "link": "https://www.breitbart.com/clips/2025/03/28/ted-cruz-democrats-dont-stand-for-anything-other-than-rage-and-hatred/",
    "timestamp": "2025-03-28T14:59:13Z"
  },
  {
    "title": "History-making lawyer Chase Strangio opens up in new documentary: ‘My transness helped me conquer fear’",
    "description": "It’s been a whirlwind of a year for Chase Strangio. He’s gone from preparing to argue a case before the Supreme Court, making history in the process, to preparing for a second Donald Trump presidency, and now contending with the realities of the new era.  As …",
    "link": "https://www.thepinknews.com/2025/03/28/chase-strangio-us-supreme-court-documentary-heightened-security-trans/",
    "timestamp": "2025-03-28T14:59:09Z"
  },
  {
    "title": "DOGE Staff Onboarded at Federal Agency Suing Elon Musk",
    "description": "The SEC is forming a liaison team with the \"intent to partner\" with Elon Musk's DOGE, the message added.",
    "link": "https://www.newsweek.com/doge-staff-sec-suing-elon-musk-2052109",
    "timestamp": "2025-03-28T14:58:33Z"
  },
  {
    "title": "Utah becomes the first state to ban fluoride in public drinking water",
    "description": "Utah has become the first state to ban fluoride in public drinking water, despite widespread opposition from dentists and national health organizations.",
    "link": "https://www.clickondetroit.com/news/politics/2025/03/28/utah-becomes-the-first-state-to-ban-fluoride-in-public-drinking-water/",
    "timestamp": "2025-03-28T14:57:14Z"
  },
  {
    "title": "Bitcoin Price Wavers, Altcoins Plunge as Inflation Heats Up in February",
    "description": "The Fed’s preferred inflation gauge clocked in well above the U.S. central bank’s 2% target.",
    "link": "https://decrypt.co/312110/bitcoin-price-altcoins-inflation-february",
    "timestamp": "2025-03-28T14:56:53Z"
  },
  {
    "title": "Elon Musk and his team just defended DOGE's 'revolution.' Here are some takeaways",
    "description": "The group says it's slashing $4 billion in federal spending every day, but it's made a number of claims that have proven incorrect",
    "link": "https://qz.com/elon-musk-doge-fox-news-interview-takeaways-1851773019",
    "timestamp": "2025-03-28T14:56:00Z"
  },
  {
    "title": "US president Donald Trump pardons fraud-convict Nikola founder Trevor Milton",
    "description": "Trevor Milton, the ex-founder of Nikola Corp, who was convicted of fraud for deceiving investors about the electric truck firm’s capabilities, has received a full pardon from US President Donald Trump. The pardon comes during an ongoing legal effort over the …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-president-donald-trump-pardons-fraud-convict-nikola-founder-trevor-milton/articleshow/119661821.cms",
    "timestamp": "2025-03-28T14:55:37Z"
  },
  {
    "title": "Italy PM Meloni: Trump White House is Criticising Europe's Ruling Class, Not Its People",
    "description": "Conservative Meloni warns many Euro leaders too instinctive with President Trump, never stopping to think whether he may have a point.\nThe post Italy PM Meloni: Trump White House is Criticising Europe’s Ruling Class, Not Its People appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/03/28/italy-pm-meloni-trump-white-house-is-criticising-europes-ruling-class-not-its-people/",
    "timestamp": "2025-03-28T14:53:14Z"
  },
  {
    "title": "Irish Tesla owners on Musk’s EV company: ‘I’m either stuck with it, or I have to take a big financial hit’",
    "description": "What do Irish Tesla owners think about Elon Musk and his EV company? Here, they have their say",
    "link": "https://www.irishtimes.com/life-style/2025/03/29/irish-tesla-owners-on-musks-ev-company-im-either-stuck-with-it-or-i-have-to-take-a-big-financial-hit/",
    "timestamp": "2025-03-28T14:53:02Z"
  },
  {
    "title": "Jenner & Block sues US government over Trump’s executive order - Financial Times",
    "description": "Jenner & Block sues US government over Trump’s executive orderFinancial Times Jenner & Block Sues to Stop Trump’s Executive Order Against Law FirmThe New York Times Two more law firms targeted by Trump sue to block punishing executive ordersPOLITICO A Skadden…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176847979",
    "timestamp": "2025-03-28T14:53:01Z"
  },
  {
    "title": "Even meme-poisoned MAGA posters think White House Studio Ghibli troll went too far",
    "description": "Several supporters of President Donald Trump's border crackdown are furious that the White House joined the latest internet trend of using ChatGPT to convert viral or well-known images into the style of animation studio Studio Ghibli.\n\n\nThe offending image, p…",
    "link": "https://www.dailydot.com/debug/white-house-deportation-meme-studio-ghibli/",
    "timestamp": "2025-03-28T14:51:04Z"
  },
  {
    "title": "No, Daredevil: Born Again's Fisk Is Not An Allegory For Trump",
    "description": "Daredevil: Born Again is really quite something. It feels like the first genuinely adult-focused project within the MCU, and its shocking brutality is all the more surprising for being created by Disney. (While Deadpool & Wolverine had gore and naughty words,…",
    "link": "https://kotaku.com/daredevil-born-again-fisk-trump-allegory-summary-1851773048",
    "timestamp": "2025-03-28T14:50:00Z"
  },
  {
    "title": "Youngkin cuts proposed new school funding to boost state's reserve",
    "description": "After years of trying, public school divisions in Virginia thought this year that they would finally see the end of the \"support cap\" that then-Gov. Tim Kaine proposed in late 2009 as a temporary measure to prevent deep cuts in public services in the two-year…",
    "link": "https://richmond.com/news/state-regional/government-politics/article_75598f46-519b-45c4-ba08-bfe28b9421f0.html",
    "timestamp": "2025-03-28T14:49:00Z"
  },
  {
    "title": "Trump Asks Justices to Allow Use of Alien Enemies Act",
    "description": "“President Donald Trump’s administration on Friday asked the Supreme Court to wade into the fraught legal battle over enforcing the Alien Enemies Act, the wartime authority he used to rapidly deport alleged members of a",
    "link": "https://politicalwire.com/2025/03/28/trump-asks-justices-to-allow-use-of-alien-enemies-act/",
    "timestamp": "2025-03-28T14:48:30Z"
  },
  {
    "title": "Man charged over vandalism at Trump Turnberry",
    "description": "A green was dug up at the course on 8 March and red paint was daubed over a building and a green.",
    "link": "https://www.bbc.com/news/articles/cjd3dzgddg2o",
    "timestamp": "2025-03-28T14:47:51Z"
  },
  {
    "title": "Bill Maher Compares His Upcoming White House Dinner with Trump to Nixon Going To China: ‘You Gotta Try, Man’",
    "description": "Bill Maher compared his dinner with Trump to Nixon's historic visit to China, though the comedian admitted he has not illusions about \"healing\" the country.\nThe post Bill Maher Compares His Upcoming White House Dinner with Trump to Nixon Going To China: ‘You …",
    "link": "https://www.mediaite.com/podcasts/bill-maher-compares-his-upcoming-white-house-dinner-with-trump-to-nixon-going-to-china-you-gotta-try-man/",
    "timestamp": "2025-03-28T14:47:47Z"
  },
  {
    "title": "Vance and wife to tour U.S. military base in Greenland after diplomatic spat over uninvited visit",
    "description": "Vice President JD Vance and his wife will be visiting an American military base in Greenland. The visit on Friday was revised after an initial three-day trip to the semi-autonomous Danish territory created uproar among Greenlanders and Danes who were irked th…",
    "link": "https://www.pbs.org/newshour/world/vance-and-wife-to-tour-u-s-military-base-in-greenland-after-diplomatic-spat-over-uninvited-visit",
    "timestamp": "2025-03-28T14:47:34Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court To Lift Order Barring Deportations Under 18th Century Law",
    "description": "The emergency appeal to the high court follows a rejection of the Republican administration’s plea to the federal appeals court in Washington.",
    "link": "https://www.huffpost.com/entry/trump-administration-asks-supreme-court-to-lift-order-barring-deportations-under-18th-century-law_n_67e6b539e4b0f69ef1d36d11",
    "timestamp": "2025-03-28T14:46:48Z"
  },
  {
    "title": "Lawmakers Call for Defunding as Report Reveals Millions of Taxpayer Dollars Spent on Gender Ideology",
    "description": "The federal government spent more than $174 million promoting gender ideology in the past three years, according to a new report. In one example of... Read More\nThe post Lawmakers Call for Defunding as Report Reveals Millions of Taxpayer Dollars Spent on Gend…",
    "link": "https://www.dailysignal.com/2025/03/28/lawmakers-call-defunding-report-reveals-millions-taxpayer-dollars-spent-gender-ideology/",
    "timestamp": "2025-03-28T14:45:02Z"
  },
  {
    "title": "Trump pardons Nikola founder Trevor Milton in securities fraud case (Dan Mangan/CNBC)",
    "description": "Dan Mangan / CNBC:\nTrump pardons Nikola founder Trevor Milton in securities fraud case … President Donald Trump pardoned Nikola Corp. founder Trevor Milton for his October 2022 conviction of federal crimes related to defrauding investors with false claims abo…",
    "link": "https://www.memeorandum.com/250328/p42",
    "timestamp": "2025-03-28T14:45:02Z"
  },
  {
    "title": "Inflation report shows rising prices in February",
    "description": "Inflation accelerated again by 0.4% last month as consumer confidence fell for a fourth consecutive month, reaching its lowest level in 12 years.",
    "link": "https://www.koat.com/article/inflation-report-shows-rising-prices-in-february-fears-of-recession-grow/64319939",
    "timestamp": "2025-03-28T14:44:32Z"
  },
  {
    "title": "Inflation report shows rising prices in February",
    "description": "Inflation accelerated again by 0.4% last month as consumer confidence fell for a fourth consecutive month, reaching its lowest level in 12 years.",
    "link": "https://www.wcvb.com/article/inflation-report-shows-rising-prices-in-february-fears-of-recession-grow/64319939",
    "timestamp": "2025-03-28T14:44:22Z"
  },
  {
    "title": "Here Are The Students Trump Wants to Deport Over Their Speech",
    "description": "Donald Trump’s administration is revoking student activists’ visas. Mahmoud Khalil, Ranjani Srinivasan, and Rumeysa Ozturk are among those detained.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-deport-student-speech-palestine-mahmoud-khalil-ozturk-1235305498/",
    "timestamp": "2025-03-28T14:44:21Z"
  },
  {
    "title": "Elise Stefanik just learned the truth about Trump and loyalty",
    "description": "Trump repaid Stefanik’s loyalty by withdrawing her nomination as ambassador to the United Nations, over concerns about House Republicans' narrow majority.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/elise-stefanik-trump-nomination-withdrawal-un-ambassador-rcna198447",
    "timestamp": "2025-03-28T14:43:42Z"
  },
  {
    "title": "When Trump Talks About Greenland, He’s Talking About Climate Change",
    "description": "The U.S. had started to treat global warming in the Arctic as a military concern. Will the Trump administration?",
    "link": "https://www.theatlantic.com/science/archive/2025/03/climate-change-arctic-greenland-trump-military/682225/",
    "timestamp": "2025-03-28T14:43:22Z"
  },
  {
    "title": "The 'Meritocracy' Lie",
    "description": "Two months after he was inaugurated, Trump has smashed many of the government's silly DEI rules. But he hasn't created a new age of meritocracy.",
    "link": "https://reason.com/2025/03/28/the-meritocracy-lie/",
    "timestamp": "2025-03-28T14:43:13Z"
  },
  {
    "title": "Law Firm Targeted by Trump Fights Back",
    "description": "“The law firm Jenner and Block filed suit against the Trump Administration Friday seeking to block an executive order signed by President Donald Trump last week that targeted its attorneys' security clearances and essentially shuttered",
    "link": "https://politicalwire.com/2025/03/28/law-firm-targeted-by-trump-fights-back/",
    "timestamp": "2025-03-28T14:43:03Z"
  },
  {
    "title": "Inflation report shows rising prices in February",
    "description": "Inflation accelerated again by 0.4% last month as consumer confidence fell for a fourth consecutive month, reaching its lowest level in 12 years.",
    "link": "https://www.kcra.com/article/inflation-report-shows-rising-prices-in-february-fears-of-recession-grow/64319939",
    "timestamp": "2025-03-28T14:42:29Z"
  },
  {
    "title": "Could Republicans Lose House Majority? Special Elections Explained",
    "description": "There are four upcoming special elections, and there would have been five, had Elise Stefanik become U.S. ambassador to the U.N.",
    "link": "https://www.newsweek.com/republicans-lose-house-majority-special-elections-florida-2051961",
    "timestamp": "2025-03-28T14:42:04Z"
  },
  {
    "title": "ChatGPT is Russophobic – human rights chief",
    "description": "The American AI model provides “harsh, ideological” answers, Valery Fadeyev has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614905-chatgpt-ai-russophobia-us/",
    "timestamp": "2025-03-28T14:41:54Z"
  },
  {
    "title": "Efforts to ‘rearm’ Europe stumble as Trump ‘kicks over the chessboard’ of the Ukraine war",
    "description": "EU must take replace rhetoric with deeds and increase military power to ensure Putin takes heed, European commissioner for defence warns",
    "link": "https://www.irishtimes.com/world/europe/2025/03/28/efforts-to-rearm-europe-stumble-as-trump-kicks-over-the-chessboard-of-the-ukraine-war/",
    "timestamp": "2025-03-28T14:41:25Z"
  },
  {
    "title": "Trump’s ‘Maximum Pressure’ Iran Approach Is a Headache for India",
    "description": "From bombing Yemen to tightening Iran sanctions, U.S. policy is testing India’s trade and connectivity strategy.",
    "link": "https://thediplomat.com/2025/03/trumps-maximum-pressure-iran-approach-is-a-headache-for-india/",
    "timestamp": "2025-03-28T14:41:00Z"
  },
  {
    "title": "There is bad news for federal employees fired by DOGE; if you are one of them, here’s why you should be worried",
    "description": "The Department of Government Efficiency's layoffs of federal employees have led to a challenging job market, particularly in white-collar sectors. Increased policy uncertainty and cautious hiring are further complicating job searches. Though layoffs haven't r…",
    "link": "https://economictimes.indiatimes.com/news/international/us/there-is-bad-news-for-federal-employees-fired-by-doge-if-you-are-one-of-them-heres-why-you-should-be-worried/articleshow/119661133.cms",
    "timestamp": "2025-03-28T14:40:36Z"
  },
  {
    "title": "All Vance Is Saying Is Give Peace a Chance",
    "description": "Jeet Heer\n\n\n\nThe vice president has doubts about the Yemen war, but will Democrats find the courage to oppose it? The GOP’s fractures offer a chance to push for an anti-interventionist agenda. \r\n\n\r\n\n\nThe post All Vance Is Saying Is Give Peace a Chance appeare…",
    "link": "https://www.thenation.com/article/world/vance-democrats-opposition-yemen-war/",
    "timestamp": "2025-03-28T14:40:13Z"
  },
  {
    "title": "Stock market today: Wall Street drops following discouraging updates on US shoppers and inflation",
    "description": "U.S. stocks are falling following discouraging updates on inflation and how much U.S. households may be willing to spend.",
    "link": "https://www.bostonherald.com/2025/03/28/stock-market-inflation-report-impact/",
    "timestamp": "2025-03-28T14:40:09Z"
  },
  {
    "title": "Trump asks Supreme Court to overturn Boasberg’s ruling blocking him from using the Alien Enemies Act for deportations",
    "description": "President Donald Trump’s administration on Friday asked the Supreme Court to wade into the fraught legal battle over enforcing the Alien Enemies Act, the wartime authority he used to rapidly deport alleged members of a Venezuelan gang.",
    "link": "https://www.cnn.com/2025/03/28/politics/alien-enemies-act-supreme-court/index.html",
    "timestamp": "2025-03-28T14:39:52Z"
  }
]