[
  {
    "title": "Trump Has Dropped the Pretense of Ethics",
    "description": "Do Donald Trump and his family “actually give a fuck” about appearing to profit from his presidency? Evidence is mounting that they don’t. Mother Jones reported yesterday on various ways that corporations, foreign governments, and random rich people with agen…",
    "link": "https://www.motherjones.com/politics/2025/05/trump-jet-crypto-qatar-corruption-ethics/",
    "timestamp": "2025-05-23T20:58:13Z"
  },
  {
    "title": "Trump Official Insists 'There Is No Pain' From Tariffs. His Audience Immediately Calls Him Out",
    "description": "Billionaire-turned-Commerce Secretary Howard Lutnick repeatedly claimed Americans aren't feeling the impact of Trump's tariffs until audience members pushed back at an Axios event Wednesday.",
    "link": "https://www.ibtimes.com/trump-official-insists-there-no-pain-tariffs-his-audience-immediately-calls-him-out-3774388",
    "timestamp": "2025-05-23T20:57:09Z"
  },
  {
    "title": "Trump green-lights Nippon merger with US Steel (Spencer Kimball/CNBC)",
    "description": "Spencer Kimball / CNBC:\nTrump green-lights Nippon merger with US Steel … President Donald Trump said Friday that U.S. Steel and Nippon Steel will form a “partnership,” after the Japanese steelmaker's bid to acquire its U.S. rival had been blocked on national …",
    "link": "https://www.memeorandum.com/250523/p98",
    "timestamp": "2025-05-23T20:55:00Z"
  },
  {
    "title": "The penny costs nearly 4 cents to make. Here’s how much the US spends on minting its other coins",
    "description": "Coin production costs vary, and many of those expenses have been on the rise.",
    "link": "https://www.denverpost.com/2025/05/23/costs-per-us-coin/",
    "timestamp": "2025-05-23T20:53:32Z"
  },
  {
    "title": "The penny costs nearly 4 cents to make. Here’s how much the US spends on minting its other coins",
    "description": "Coin production costs vary, and many of those expenses have been on the rise.",
    "link": "https://www.bostonherald.com/2025/05/23/costs-per-us-coin/",
    "timestamp": "2025-05-23T20:53:32Z"
  },
  {
    "title": "Trump wants iPhones made in the U.S. Here are the facts",
    "description": "U.S. President Donald Trump is again threatening Apple with tariffs in order to pressure the company to move iPhone production to the U.S. But the obstacles involved with that are huge.",
    "link": "https://www.cbc.ca/news/world/apple-iphone-us-production-1.7542362",
    "timestamp": "2025-05-23T20:51:41Z"
  },
  {
    "title": "The Roberts Court just showed how it exercises raw power",
    "description": "A Supreme Court decision granting President Trump broad new powers to fire federal officials wax an exercise in raw political power.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/supreme-court-trump-firing-agency-leaders-deadline-newsletter-rcna208789",
    "timestamp": "2025-05-23T20:50:01Z"
  },
  {
    "title": "Trump Demands To See Bruce Springsteen's Birth Certificate To Prove He Was Born In The U.S.A.",
    "description": "WASHINGTON, D.C. — In response to years of sharp criticism from the legendary music icon, President Donald Trump demanded to see Bruce Springsteen's birth certificate to prove he was born in the U.S.A.",
    "link": "https://babylonbee.com/news/trump-demands-to-see-bruce-springsteens-birth-certificate-to-prove-he-was-born-in-the-usa",
    "timestamp": "2025-05-23T20:49:37Z"
  },
  {
    "title": "County officials ask DOJ for help fighting state’s massive gun law overreach",
    "description": "Will now demand at least a 90% score on a written state test to be granted 2nd Amendment rights",
    "link": "https://www.wnd.com/2025/05/county-officials-ask-doj-for-help-fighting-states-massive-gun-law-overreach/",
    "timestamp": "2025-05-23T20:49:18Z"
  },
  {
    "title": "Justice Roberts Lets DOGE Avoid Turning Over Records On Its Operations For Now",
    "description": "A lower court judge had ordered DOGE to publicly disclose information about its operations — an order the Supreme Court chief justice has now put on pause.",
    "link": "https://www.huffpost.com/entry/ap-us-supreme-court-doge-records_n_6830dbdfe4b0ca4a5f569408",
    "timestamp": "2025-05-23T20:48:01Z"
  },
  {
    "title": "US Steel shares skyrocket after Trump backs Nippon Steel 'partnership'",
    "description": "WASHINGTON: Shares of steelmaker US Steel skyrocketed as much as 24 per cent on Friday (May 23) after President Donald Trump announced his support for a \"partnership\" with Nippon Steel.  \"US Steel will REMAIN in America, and keep its Headquarters in the Great…",
    "link": "https://www.channelnewsasia.com/world/us-steel-shares-skyrocket-after-trump-backs-nippon-steel-partnership-5150426",
    "timestamp": "2025-05-23T20:48:00Z"
  },
  {
    "title": "‘Ouch’: Ex-Obama Aide Saddened By ‘Depressing’ New Data Showing Trump Took His Old Boss’ Coalition",
    "description": "Jon Favreau said that fresh data from on how former Vice President Kamala Harris lost to President Donald Trump in the 2024 election was upsetting.",
    "link": "https://dailycaller.com/2025/05/23/ouch-ex-obama-aide-saddened-by-depressing-new-data-showing-trump-took-his-old-boss-coalition/",
    "timestamp": "2025-05-23T20:47:53Z"
  },
  {
    "title": "Scott Galloway Declares Musk’s DOGE a Bust and ‘One of the Greatest Brand Destructions’ Ever",
    "description": "Scott Galloway criticized Elon Musk’s political entanglements with President Donald Trump, calling Musk’s involvement with DOGE \"one of the greatest brand destructions\" in history.\nThe post Scott Galloway Declares Musk’s DOGE a Bust and ‘One of the Greatest B…",
    "link": "https://www.mediaite.com/politics/scott-galloway-declares-musks-doge-a-bust-and-one-of-the-greatest-brand-destructions-ever/",
    "timestamp": "2025-05-23T20:47:39Z"
  },
  {
    "title": "DOJ-Boeing Deal Over Deadly Crashes Called 'Utterly Appalling'",
    "description": "The Trump administration on Friday faced swift backlash to the U.S. Department of Justice's deal to end a felony case against Boeing that stemmed from a pair of 737 MAX passenger jet crashes that collectively killed 346 people in Ethiopia and Indonesia.\n\nResp…",
    "link": "https://www.commondreams.org/news/boeing-deal",
    "timestamp": "2025-05-23T20:46:45Z"
  },
  {
    "title": "S&P/TSX composite rises, U.S. stocks fall after Trump’s latest tariff threats",
    "description": "TORONTO — Canada’s main stock index rose Friday, while U.S. markets dropped after U.S. President Donald Trump threatened a 50 per cent tax on all imports from the European Union as well as a 25 per cent tariff on Apple products unless iPhones are made in the …",
    "link": "https://financialpost.com/pmn/sp-tsx-composite-rises-u-s-stocks-fall-after-trumps-latest-tariff-threats",
    "timestamp": "2025-05-23T20:46:10Z"
  },
  {
    "title": "Advocates wait for the results of Trump's executive order on IVF policy",
    "description": "This week, Julie Eshelman has been holding her breath, waiting to see if President Donald Trump delivers on his campaign promise to make in vitro fertilization free.",
    "link": "https://www.nbcnews.com/politics/trump-administration/advocates-wait-results-trumps-executive-order-ivf-policy-rcna207772",
    "timestamp": "2025-05-23T20:45:45Z"
  },
  {
    "title": "California And 10 Other States Launch Clean Cars Coalition Following Senate Vote",
    "description": "California is joining an 11-state coalition to advance clean vehicles in response to a vote by the U.S. Senate to revoke California’s authority to set its own clean air standards. The Affordable Clean Cars Coalition was formed to push the …",
    "link": "https://www.insurancejournal.com/news/west/2025/05/23/825019.htm",
    "timestamp": "2025-05-23T20:44:07Z"
  },
  {
    "title": "Russia to present peace accord draft after prisoner exchange, Lavrov says",
    "description": "Russia will be ready to hand Ukraine a draft document outlining conditions for a long-term peace accord once a prisoner exchange now under way is completed, Foreign Minister Sergei Lavrov said on Friday. Lavrov, in statements on his ministry's website, said R…",
    "link": "https://japantoday.com/category/world/russia-to-present-peace-accord-draft-after-prisoner-exchange-lavrov-says",
    "timestamp": "2025-05-23T20:43:48Z"
  },
  {
    "title": "Iran, U.S. see hope for progress after nuclear talks",
    "description": "Iranian and U.S. delegations wrapped up a fifth round of talks in Rome on Friday and signs of some limited progress emerged in the negotiations aimed at resolving a decades-long dispute over Tehran's nuclear ambitions. Despite both Washington and Tehran takin…",
    "link": "https://japantoday.com/category/world/iran-us-see-hope-for-progress-after-us-nuclear-talks1",
    "timestamp": "2025-05-23T20:43:35Z"
  },
  {
    "title": "U.S. top diplomat in Havana promises more sanctions on Cuba",
    "description": "The United States' top diplomat in Havana said on Friday the U.S. had more sanctions in store for Cuba just days after punishing several Cuban judicial officials for their roles in jailing political dissidents on the island. Three Cuban judges and a prosecuto…",
    "link": "https://japantoday.com/category/world/us-top-diplomat-in-havana-promises-more-sanctions-on-cuba",
    "timestamp": "2025-05-23T20:43:05Z"
  },
  {
    "title": "EU trade chief vows to defend bloc's interests amid hiking U.S. tariff threats",
    "description": "BRUSSELS, May 23 (Xinhua) -- European trade chief said on Friday that the European Union (EU) stands ready to defend its interests after U.S. President Donald Trump threatened to impose 50-percent tariffs on all EU goods effective June 1. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/24/eu-trade-chief-vows-to-defend-bloc039s-interests-amid-hiking-us-tariff-threats",
    "timestamp": "2025-05-23T20:43:00Z"
  },
  {
    "title": "Judge temporarily blocks Trump admin from revoking Harvard enrollment of foreign students",
    "description": "A U.S. judge on Friday temporarily blocked the Trump administration from revoking Harvard University's ability to enroll foreign students, a policy the Ivy League school called part of President Donald Trump's broader effort to retaliate against it for refusi…",
    "link": "https://japantoday.com/category/world/judge-temporarily-blocks-trump-admin-from-revoking-harvard-enrollment-of-foreign-students1",
    "timestamp": "2025-05-23T20:42:42Z"
  },
  {
    "title": "Trump threatens 50% tariffs on EU and 25% penalties on smartphones as his trade war intensifies",
    "description": "President Donald Trump on Friday threatened a 50% tax on all imports from the European Union as well a 25% tariff on smartphones unless those products are made in America. The threats, delivered over social media, reflect Trump's ability to disrupt the global…",
    "link": "https://japantoday.com/category/world/trump-threatens-25-import-tax-on-apple-unless-iphones-are-made-in-the-us1",
    "timestamp": "2025-05-23T20:42:27Z"
  },
  {
    "title": "Trump shows approval for Nippon Steel's bid for US Steel, blesses 'planned partnership'",
    "description": "WASHINGTON :U.S. President Donald Trump appeared to give his approval to Nippon Steel's $14.9 billion bid for U.S. Steel on Friday, saying the \"planned partnership\" between the two would create jobs and help the American economy.Shares of U.S. Steel soared 21…",
    "link": "https://www.channelnewsasia.com/business/trump-shows-approval-nippon-steels-bid-us-steel-blesses-planned-partnership-5150421",
    "timestamp": "2025-05-23T20:42:14Z"
  },
  {
    "title": "Trump says US Steel will keep HQ in Pittsburgh as part of $14B 'partnership' with Japan-based Nippon",
    "description": "President Donald Trump says U.S. Steel will keep its headquarters in Pittsburgh as part of what he called a “planned partnership” between the iconic American steelmaker and Japan-based Nippon Steel, which has sought to buy it.",
    "link": "https://www.clickondetroit.com/business/2025/05/23/trump-says-us-steel-will-keep-hq-in-pittsburgh-as-part-of-14b-partnership-with-japan-based-nippon/",
    "timestamp": "2025-05-23T20:41:05Z"
  },
  {
    "title": "After being stopped and questioned at O’Hare, Twitch star Hasan Piker says he isn’t changing political commentary",
    "description": "Hasan Piker doesn’t plan to change a single thing about his tone or his rhetoric in his criticisms of President Donald Trump or the war in Gaza as he blasts out his opinions to 2.8 million followers on Twitch.\nEven after he was stopped and questioned by the U…",
    "link": "https://biztoc.com/x/db06fc2d7d6e43e7",
    "timestamp": "2025-05-23T20:40:09Z"
  },
  {
    "title": "Trump, Rubio reputedly overhauled NSC",
    "description": "US President Donald Trump and Secretary of State Marco Rubio restructured the National Security Council (NSC), significantly downsizing its workforce and shifting substantial authority to the State an...",
    "link": "https://biztoc.com/x/252594f0a4262472",
    "timestamp": "2025-05-23T20:40:06Z"
  },
  {
    "title": "Chief Justice agrees to pause court orders requiring DOGE to turn over records about its operation",
    "description": "Chief Justice John Roberts is agreeing to temporarily pause orders that would require Elon Musk’s Department of Government Efficiency to publicly disclose information about its operations",
    "link": "https://abcnews.go.com/US/wireStory/chief-justice-agrees-pause-court-orders-requiring-doge-122129714",
    "timestamp": "2025-05-23T20:38:29Z"
  },
  {
    "title": "Balsillie tapped to help lead Manitoba’s new technology task force",
    "description": "Former BlackBerry Ltd. co-chief executive Jim Balsillie will help spearhead Manitoba's new innovation and productivity task force. Read on",
    "link": "https://financialpost.com/technology/balsillie-tapped-manitoba-technology-task-force",
    "timestamp": "2025-05-23T20:36:52Z"
  },
  {
    "title": "Federal judge overturns Trump’s executive order targeting law firm Jenner & Block | CNN Politics",
    "description": "A federal judge on Friday struck down an executive order signed by President Donald Trump earlier this year targeting the law firm Jenner & Block, ruling the effort ran afoul of the Constitution’s First Amendment.",
    "link": "https://www.cnn.com/2025/05/23/politics/jenner-and-block-executive-order",
    "timestamp": "2025-05-23T20:35:44Z"
  },
  {
    "title": "Report: Father of Suspect in Jewish-Christian Couple’s Slaying Was Democrat’s Guest at Trump Address",
    "description": "A Democrat representative reportedly invited the father of the anti-Israel suspect accused of murdering two Israeli Embassy staffers in Washington, DC, on Wednesday to President Donald Trump’s joint address in March.",
    "link": "https://freerepublic.com/focus/f-news/4318768/posts",
    "timestamp": "2025-05-23T20:34:41Z"
  },
  {
    "title": "Trump: US Steel to stay in Pittsburgh under Nippon 'partnership'",
    "description": "U.S. Steel will remain headquartered in Pittsburgh under \"a planned partnership\" with Japan's Nippon Steel, President Trump announced in a statement Friday.",
    "link": "https://www.wtae.com/article/us-steel-pittsburgh-nippon-steel-president-trump/64867595",
    "timestamp": "2025-05-23T20:33:27Z"
  },
  {
    "title": "Kuo: Apple Better Off Paying Tariff Than Moving iPhone Production to U.S.",
    "description": "Apple should absorb a 25% tariff on U.S. iPhone sales rather than attempt to relocate assembly lines to the United States, according to analyst Ming-Chi Kuo. In a post on X, Kuo called the idea of shifting production “unrealistic” and financially unwise, espe…",
    "link": "https://www.macobserver.com/news/kuo-apple-better-off-paying-tariff-than-moving-iphone-production-to-u-s/",
    "timestamp": "2025-05-23T20:31:37Z"
  },
  {
    "title": "‘I’m Not Persuadable’: Rand Paul Torches Suggestion Trump Can Twist His Arm on Spending",
    "description": "MSNBC on Friday reported several Republicans are drawing a hard line against the \"Big Beautiful Bill\" in its current form, despite Trump's pressure.\nThe post ‘I’m Not Persuadable’: Rand Paul Torches Suggestion Trump Can Twist His Arm on Spending first appeare…",
    "link": "https://www.mediaite.com/media/news/im-not-persuadable-rand-paul-torches-suggestion-trump-can-twist-his-arm-on-spending/",
    "timestamp": "2025-05-23T20:31:03Z"
  },
  {
    "title": "Trump says US Steel will keep HQ in Pittsburgh as part of $14B 'partnership' with Japan-based Nippon",
    "description": "President Donald Trump says U.S. Steel will keep its headquarters in Pittsburgh as part of what he called a “planned partnership” between the iconic American steelmaker and Japan-based Nippon Steel, which has sought to buy it",
    "link": "https://abcnews.go.com/Business/wireStory/trump-us-steel-hq-pittsburgh-part-14b-partnership-122129078",
    "timestamp": "2025-05-23T20:30:17Z"
  },
  {
    "title": "How to invest in a changing world order",
    "description": "The global economy and investment landscape is undergoing major transformations, especially following US President Donald Trump's tariff announcements on April 2, which have reshaped the world trade order.",
    "link": "https://www.bangkokpost.com/business/general/3033062/how-to-invest-in-a-changing-world-order",
    "timestamp": "2025-05-23T20:30:00Z"
  },
  {
    "title": "Equities steady a day after big US bond sell-off",
    "description": "RECAP:  Asian equities stabilised yesterday, a day after a sell-off in Treasuries that reflected concerns about US fiscal stability and rattled markets around the globe.",
    "link": "https://www.bangkokpost.com/business/general/3033127/equities-steady-a-day-after-big-us-bond-sell-off",
    "timestamp": "2025-05-23T20:30:00Z"
  },
  {
    "title": "Supreme Court Pauses Order for DOGE Records and Testimony",
    "description": "The US Supreme Court temporarily blocked a lower-court order that would force Elon Musk’s Department of Government Efficiency to turn over documents to a watchdog group and make a top official available to testify.",
    "link": "https://www.livemint.com/companies/news/supreme-court-pauses-order-for-doge-records-and-testimony-11748032132216.html",
    "timestamp": "2025-05-23T20:28:51Z"
  },
  {
    "title": "Trump greenlights US Steel-Nippon partnership",
    "description": "The News\nUS President Donald Trump on Friday cleared the path for Nippon Steel’s acquisition of US Steel, announcing a “planned partnership” between the two steelmakers that would keep the US company headquartered in Pittsburgh and create 70,000 new jobs.\nJap…",
    "link": "https://biztoc.com/x/106eb00815646b2d",
    "timestamp": "2025-05-23T20:28:51Z"
  },
  {
    "title": "U.S. Steel To Remain In The U.S., Trump Announces Partnership With Nippon",
    "description": "President Donald Trump on Friday announced a major partnership between U.S. Steel and Japan’s Nippon Steel that will keep the American steel giant headquartered in Pittsburgh. \n“This will be a planned partnership… which will create at least 70,000 jobs and ad…",
    "link": "https://biztoc.com/x/44fa16e383b243e2",
    "timestamp": "2025-05-23T20:28:39Z"
  },
  {
    "title": "Trump Insists Apple Can Move Production to the US Because of 'Computerized' Factories After Threatening Tariffs",
    "description": "President Donald Trump stated that Apple could create computerized production plants in the US to produce iPhones at the same price they are being produced at now after threatening to levy tariffs against the company.",
    "link": "https://www.ibtimes.com/trump-insists-apple-can-move-production-us-because-computerized-factories-after-threatening-3774386",
    "timestamp": "2025-05-23T20:28:08Z"
  },
  {
    "title": "Perlmutter Says Trump’s Attempt to Remove Her as Register is ‘Blatantly Unlawful’ and Has No Effect",
    "description": "In a complaint filed Thursday, May 22, Shira Perlmutter, who is presently still listed as Register of Copyrights on the U.S. Copyright Office website, told the U.S. District Court for the District of Columbia that President Donald Trump’s controversial attemp…",
    "link": "https://ipwatchdog.com/2025/05/23/perlmutter-tells-trump-attempt-remove-blatantly-unlawful-no-effect/id=189177/",
    "timestamp": "2025-05-23T20:27:18Z"
  },
  {
    "title": "EU says it will ‘defend our interests’ as Donald Trump recommends 50pc tariff on Ireland and bloc",
    "description": "US president Donald Trump has said he will recommend a “straight 50pc tariff on the European Union” from June 1.",
    "link": "https://www.independent.ie/irish-news/eu-says-it-will-defend-our-interests-as-donald-trump-recommends-50pc-tariff-on-ireland-and-bloc/a1652527467.html",
    "timestamp": "2025-05-23T20:24:58Z"
  },
  {
    "title": "Supreme Court hands DOGE a temporary win",
    "description": "On Friday, the U.S. Supreme Court gave a temporary stay to a lower court's demand for a top Trump administration official to testify in court. In a lawsuit from the Citizens for Responsibility and Ethics in Washington, a district court ordered the \"alleged ac…",
    "link": "https://www.rawstory.com/doge-court-2672195165/",
    "timestamp": "2025-05-23T20:24:53Z"
  },
  {
    "title": "Trump 'not looking for a deal' with EU after 50% tariff announcement",
    "description": "US President Donald Trump on Friday said his decision to announce 50% tariffs on EU goods from June 1 is not a negotiating tactic. \"I'm not looking for a...",
    "link": "https://www.yahoo.com/news/trump-not-looking-deal-eu-202441097.html",
    "timestamp": "2025-05-23T20:24:41Z"
  },
  {
    "title": "Pro-Discrimination, Ivy League Judge Backs Harvard vs. Trump",
    "description": "The judge who is backing Harvard's new lawsuit against President Donald Trump's enforcement of civil rights laws was rebuked in 2023 by the U.S. Supreme Court for siding with Harvard's legal defense of racial discrimination.\nThe post Pro-Discrimination, Ivy L…",
    "link": "https://www.breitbart.com/immigration/2025/05/23/pro-discrimination-judge-backs-harvard-vs-trump/",
    "timestamp": "2025-05-23T20:24:19Z"
  },
  {
    "title": "Daddy's home: Andy Byford to make NYC return for Penn Station remake, White House says",
    "description": "A file photo of Andy Byford in London.\n \n\nThe former head of NYC Transit has been by the Trump administration. [ more › ]",
    "link": "https://gothamist.com/news/daddys-home-andy-byford-to-make-nyc-return-for-penn-station-remake-white-house-says",
    "timestamp": "2025-05-23T20:24:00Z"
  },
  {
    "title": "Trump's 50% Tariff on European Union Decried as 'Islamophobic'",
    "description": "WORLD — World leaders condemned today's declaration by President Donald Trump imposing a 50% tariff on imports from the European Union, asserting that it was a blatant display of Islamaphobia.",
    "link": "https://babylonbee.com/news/trumps-50-tariff-on-european-union-decried-as-islamophobic",
    "timestamp": "2025-05-23T20:23:37Z"
  },
  {
    "title": "Bruce Springsteen Cover Band Loses Gig in New Jersey After Rocker's Overseas Tirade Against America",
    "description": "Arena rocker Bruce Springteen’s caustic comments about President Donald Trump have cost nine cover-band musicians a modest paycheck from a bar gig they were planning to play next weekend on the Jersey Shore.\nThe post Bruce Springsteen Cover Band Loses Gig in …",
    "link": "https://www.breitbart.com/entertainment/2025/05/23/bruce-springsteen-cover-band-loses-gig-in-new-jersey-after-rockers-overseas-tirade-against-america/",
    "timestamp": "2025-05-23T20:22:33Z"
  },
  {
    "title": "Bitcoin and Ethereum ETFs Add More Than $1 Billion Combined in a Single Day",
    "description": "Both Bitcoin and Ethereum exchange-traded funds this week brought in huge amounts of cash as investors rapidly buy up crypto assets.",
    "link": "https://decrypt.co/321869/bitcoin-ethereum-etfs-1-billion-combined-single-day",
    "timestamp": "2025-05-23T20:22:19Z"
  },
  {
    "title": "President Trump announces deal with Nippon Steel, keeps U.S. Steel headquarters in Pittsburgh",
    "description": "President Donald Trump has announced a partnership with Nippon Steel that will keep U.S. Steel headquarters in Pittsburgh.",
    "link": "https://www.wpxi.com/news/local/president-trump-announces-deal-with-nippon-steel-keeps-us-steel-headquarters-pittsburgh/VOPLN7SFYFGPREYQDXJ5J37NKA/",
    "timestamp": "2025-05-23T20:21:08Z"
  },
  {
    "title": "Elon Musk Responds to News of How He Was Humiliated",
    "description": "Elon Musk is having a mini-meltdown on his website after The Atlantic published a damning profile of his time at the White House, which details how he was humiliated by one of his superiors. Responding Wednesday to a tweet dissing the magazine, Musk wrote, un…",
    "link": "https://futurism.com/elon-musk-responds-humiliated",
    "timestamp": "2025-05-23T20:20:45Z"
  },
  {
    "title": "Democratic credibility tanks to ‘catastrophic’ level with Biden health cover-up - NewsBreak",
    "description": "Revelations about former President Joe Biden’s mental and physical decline in office have set off a credibility crisis in the Democratic Party that may tak",
    "link": "https://www.newsbreak.com/share/4020383660406-democratic-credibility-tanks-to-catastrophic-level-with-biden-health-cover-up?s=a99&amp;share_destination_id=MTU4MjI4NTQxLTE3NDgwMzEyNDY5OTk%3D&amp;pd=0AhuTFuW&amp;hl=en_US&amp;send_time=1748031246&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-v4%2Cns_local_strategy_25q1_exp-v6%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_recall_exp_25q2-v1",
    "timestamp": "2025-05-23T20:17:49Z"
  },
  {
    "title": "Trump greenlights Nippon merger with US Steel",
    "description": "President Donald Trump said Friday that U.S. Steel and Nippon Steel will form a \"partnership,\" after the Japanese steelmaker's bid to acquire its U.S. rival had been blocked on national security grounds.\n\"This will be a planned partnership between United Stat…",
    "link": "https://biztoc.com/x/d8d15ab5b3cefa91",
    "timestamp": "2025-05-23T20:17:45Z"
  },
  {
    "title": "Markets dip after Trump threatens tariffs against Europe and Apple, sinking the iPhone maker’s stock by 3%",
    "description": "President Donald Trump just can’t stop mentioning tariffs. Stock markets dipped slightly Friday after Trump threatened a 50% tax on imports from the European Union as well as a 25% surcharge on products from the tech titan Apple. The S&P 500 notched a daily d…",
    "link": "https://biztoc.com/x/0108a0c636974b25",
    "timestamp": "2025-05-23T20:17:44Z"
  },
  {
    "title": "Trump threatens to expand smartphone tariffs beyond Apple",
    "description": "President Donald Trump announced that all companies that produce smartphones abroad need to move manufacturing to the United States or face a hefty tariff. The announcement widens the scope of the potential tariff on tech companies, which aims to move product…",
    "link": "https://biztoc.com/x/a0c162c472a7039f",
    "timestamp": "2025-05-23T20:17:44Z"
  },
  {
    "title": "Tim Cook to Donald Trump: You Were Serious About That?",
    "description": "",
    "link": "https://biztoc.com/x/fd7fe3996dac30d4",
    "timestamp": "2025-05-23T20:17:36Z"
  },
  {
    "title": "Trump Warns Iran Must Accept US Nuclear Proposal",
    "description": "President Donald Trump said Iran will face “something bad” if it doesn’t quickly accept a US proposal over its nuclear program, while officials in Tehran called the the US messaging “confusing and contradictory.”\n“They have a proposal, more importantly they k…",
    "link": "https://biztoc.com/x/71d773b69e51645b",
    "timestamp": "2025-05-23T20:17:36Z"
  },
  {
    "title": "Trump Hints at Taking Action Against Universities Besides Harvard",
    "description": "President Donald Trump hinted of revoking other universities’ certification to host international students in response to a question about his move against Harvard. Harvard University filed... Read More\nThe post Trump Hints at Taking Action Against Universiti…",
    "link": "https://www.dailysignal.com/2025/05/23/trump-hints-taking-action-against-universities-besides-harvard/",
    "timestamp": "2025-05-23T20:14:57Z"
  },
  {
    "title": "‘Limited progress’ reported following fifth round of US-Iran nuclear talks",
    "description": "US and Iranian negotiators wrap up a fifth round of nuclear talks in Rome, with mediator Oman reporting \"some but not conclusive progress.\"",
    "link": "https://www.israelnationalnews.com/news/408876",
    "timestamp": "2025-05-23T20:14:10Z"
  },
  {
    "title": "Why aren’t Democrats investigating Biden health officials for dishonesty on COVID-19 vaccine risks? - NewsBreak",
    "description": "Amid the COVID-19 pandemic, Democrats championed themselves as agents of truth. In a world of uncertainty, with information changing by the day, if not mor",
    "link": "https://www.newsbreak.com/share/4020933563389-why-aren-t-democrats-investigating-biden-health-officials-for-dishonesty-on-covid-19-vaccine-risks?s=a99&amp;share_destination_id=MTU4MjI4NTQxLTE3NDgwMzEwOTc2NzI%3D&amp;pd=0AhuTFuW&amp;hl=en_US&amp;send_time=1748031097&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.20.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q2-v2%2Cns_foryou_blend_exp_25q2-v4%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_local_strategy_25q1_exp-v6%2Cns_foryou_recall_exp_25q2-v1",
    "timestamp": "2025-05-23T20:13:10Z"
  },
  {
    "title": "Trump Struggles to Silence His Ringing iPhone During Press Conference",
    "description": "The president isn't the most tech-savvy fascist around.",
    "link": "https://gizmodo.com/trump-struggles-to-silence-his-ringing-iphone-during-press-conference-2000606714",
    "timestamp": "2025-05-23T20:12:57Z"
  },
  {
    "title": "'Anxious' farmers are already 'rethinking' support for Trump: journalist",
    "description": "Farmers are starting to turn on President Donald Trump, one reporter from rural Wisconsin warned Friday. Speaking to MSNBC, The Nation's national affairs correspondent, John Nichols, said that most of the folks he grew up with were farmers or in a business re…",
    "link": "https://www.rawstory.com/trump-tariffs-farmers-2672195044/",
    "timestamp": "2025-05-23T20:12:13Z"
  },
  {
    "title": "Belgian princess left in doubt about her Harvard future following Trump’s foreign student ban",
    "description": "Princess Elisabeth is first in line to Belgium's throne.",
    "link": "https://www.bostonherald.com/2025/05/23/trump-harvard-belgian-princess/",
    "timestamp": "2025-05-23T20:10:00Z"
  },
  {
    "title": "Washington state school district votes to keep biological males out of girls sports despite state pushback",
    "description": "The Quilcene School District in Washington, long a blue state, is defying state law, voting to ban transgender athletes from girls sports.",
    "link": "https://www.foxnews.com/sports/washington-district-votes-keep-biological-males-out-girls-sports-despite-state-pushback",
    "timestamp": "2025-05-23T20:09:59Z"
  },
  {
    "title": "Smartphone prices to jump soon? All you need to know",
    "description": "Apple designs its products in the United States, most iPhone assembly occurs in China, which remains embroiled in a trade war with the US.",
    "link": "https://economictimes.indiatimes.com/news/international/us/smartphone-prices-to-jump-soon-all-you-need-to-know/articleshow/121369466.cms",
    "timestamp": "2025-05-23T20:09:41Z"
  },
  {
    "title": "Trump threatens potential tariffs on smartphones not made in U.S.",
    "description": "WASHINGTON, May 23 (Xinhua) -- U.S. President Donald Trump on Friday threatened to impose tariffs on Samsung and other smartphone producers, following an earlier announcement targeting Apple. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/24/trump-threatens-potential-tariffs-on-smartphones-not-made-in-us",
    "timestamp": "2025-05-23T20:09:00Z"
  },
  {
    "title": "Give Negotiations With Venezuela a Chance",
    "description": "There are signs Trump might abandon “maximum pressure.” That’s good news for U.S. interests—and Venezuelan democracy.",
    "link": "http://foreignpolicy.com/2025/05/23/trump-maduro-us-venezuela-oil-chevron-sanctions-grenell-talks/",
    "timestamp": "2025-05-23T20:07:48Z"
  },
  {
    "title": "Ticker: Trump signs executive orders to boost nuclear power; Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
    "description": "President Donald Trump signed executive orders Friday intended to quadruple domestic production of nuclear power within the next 25 years, a goal experts say the United States is highly unlikely to reach.\nTo speed up the development of nuclear power, the orde…",
    "link": "https://biztoc.com/x/ae98c2018f16289c",
    "timestamp": "2025-05-23T20:06:57Z"
  },
  {
    "title": "Not Just Apple, All Phone Makers Will Face Tariffs If Not Made In U.S",
    "description": "President Donald Trump on Friday said that all major smartphone makers, not just Apple, will face a 25% tariff if they manufacture devices outside the United States. The tariffs are set to take effect by the end of June. \n“Otherwise it wouldn’t be fair,” Trum…",
    "link": "https://biztoc.com/x/d198fc8125a7a86d",
    "timestamp": "2025-05-23T20:06:55Z"
  },
  {
    "title": "WATCH: Trump signs executive orders to speed development of U.S. nuclear power",
    "description": "President Donald Trump signed executive orders Friday intended to quadruple domestic production of nuclear power within the next 25 years, a goal experts say the United States is highly unlikely to reach.",
    "link": "https://biztoc.com/x/8c7ee5282d4c3ce1",
    "timestamp": "2025-05-23T20:06:47Z"
  },
  {
    "title": "Trump’s tariffs threat extends to Samsung.",
    "description": "Trump’s tariffs threat extends to Samsung.theverge.com",
    "link": "https://www.theverge.com/news/673844/trumps-tariffs-threat-extends-to-samsung",
    "timestamp": "2025-05-23T20:06:14Z"
  },
  {
    "title": "President Trump says Nippon Steel and US Steel to enter into partnership | CNN Business",
    "description": "President Donald Trump announced a partnership between U.S. Steel and Japanese steelmaker Nippon that he says will keep the headquarters in Pittsburgh and draw $14 billion in investment toward the US economy.",
    "link": "https://www.cnn.com/2025/05/23/business/us-steel-nippon-trump",
    "timestamp": "2025-05-23T20:06:03Z"
  },
  {
    "title": "Fox News Politics Newsletter: Trump sets the 'gold standard' for science",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content. Here's what's happening…",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-trump-sets-gold-standard-science",
    "timestamp": "2025-05-23T20:05:49Z"
  },
  {
    "title": "SANDOVAL: Yes, Trump Humiliated This Foreign Leader — For Good Reason",
    "description": "A New York Times opinion column got it half right on the Oval Office meeting between South African President Cyril Ramaphosa and President Donald Trump.",
    "link": "https://dailycaller.com/2025/05/23/donald-trump-cyril-ramaphosa-south-africa-afrikaners-mainstream-media-diplomacy/",
    "timestamp": "2025-05-23T20:05:18Z"
  },
  {
    "title": "Trump seeks to boost US nuclear power, roll back regulations",
    "description": "A host of new executive orders seeks to fast-track approvals to grow the US's nuclear energy sector, a lengthy process.",
    "link": "https://www.aljazeera.com/news/2025/5/23/trump-seeks-to-boost-us-nuclear-power-roll-back-regulations",
    "timestamp": "2025-05-23T20:04:59Z"
  },
  {
    "title": "Ticker: Trump signs executive orders to boost nuclear power; Kim Kardashian’s robbers found guilty in Paris but won’t face prison time",
    "description": "Ticker: Trump signs executive orders to boost nuclear power; Kim Kardashian's robbers found guilty in Paris but won't face prison time",
    "link": "https://www.bostonherald.com/2025/05/23/ticker-trump-signs-executive-orders-to-boost-nuclear-power-kim-kardashians-robbers-found-guilty-in-paris-but-wont-face-prison-time/",
    "timestamp": "2025-05-23T20:04:31Z"
  },
  {
    "title": "Russia, Ukraine Swap Nearly 800 Prisoners in Massive Exchange Deal",
    "description": "But the two sides still appear at odds over what it will take to secure a cease-fire.",
    "link": "http://foreignpolicy.com/2025/05/23/russia-ukraine-prisoner-exchange-cease-fire-talks-zelensky/",
    "timestamp": "2025-05-23T20:02:45Z"
  },
  {
    "title": "WATCH: Trump signs executive orders to speed development of U.S. nuclear power",
    "description": "President Donald Trump signed executive orders Friday intended to quadruple domestic production of nuclear power within the next 25 years, a goal experts say the United States is highly unlikely to reach.",
    "link": "https://www.pbs.org/newshour/politics/watch-trump-signs-executive-orders-to-speed-development-of-u-s-nuclear-power",
    "timestamp": "2025-05-23T20:01:24Z"
  },
  {
    "title": "Bitcoin balance sheet adoption could hit 20% of BTC supply by 2026",
    "description": "Bitwise and UTXO Management project that 20% of all Bitcoin (BTC) could migrate to institutional balance sheets by end-2026, according to a new report published by Bitwise and UTXO Management on May 23. The study, called “Exploring the Game Theory of Hyperbit…",
    "link": "https://cryptoslate.com/bitcoin-balance-sheet-adoption-could-hit-20-of-btc-supply-by-2026/",
    "timestamp": "2025-05-23T20:00:39Z"
  },
  {
    "title": "The GOP Just Passed Yet Another Anti-Family Policy",
    "description": "And yet, they won’t shut up about the declining birth rate.",
    "link": "https://www.huffpost.com/entry/gop-medicaid-cuts-anti-family_n_6830bca2e4b0640566c33222",
    "timestamp": "2025-05-23T20:00:08Z"
  },
  {
    "title": "The Broken ‘Promise’ of Bruce Springsteen",
    "description": "The First Dance at my wedding reception was to Bruce Springsteen’s version of “Jersey Girl.” And as hard as I try to walk away from... Read More\nThe post The Broken ‘Promise’ of Bruce Springsteen appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/05/23/the-broken-promise-of-bruce-springsteen/",
    "timestamp": "2025-05-23T20:00:00Z"
  },
  {
    "title": "US House members call for investigation into Trump's memecoin dinner",
    "description": "Members of the US House of Representatives called for the Justice Department to investigate Donald Trump’s May 22 dinner for his top memecoin investors, citing concerns about “foreign influence over US policy decisions” and “potential corruption and emolument…",
    "link": "https://cointelegraph.com/news/house-investigation-donald-trump-memecoin-dinner",
    "timestamp": "2025-05-23T19:57:51Z"
  },
  {
    "title": "Why are Republicans refusing to budge on the Jan. 6 plaque honoring law enforcement?",
    "description": "A plaque honoring the officers who protected the Capitol on Jan. 6 was supposed to be installed by March 2023. Why is it gathering dust in a closet?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/are-republicans-refusing-budge-jan-6-plaque-honoring-law-enforcement-rcna208834",
    "timestamp": "2025-05-23T19:56:48Z"
  },
  {
    "title": "Trump greenlights Nippon merger with US Steel",
    "description": "President Donald Trump said Friday that U.S. Steel and Nippon Steel will form a “partnership,” after the Japanese steelmaker’s bid to acquire its U.S. rival had been blocked on national security grounds. U.S. Steel shares jumped more than 24%.",
    "link": "https://freerepublic.com/focus/f-news/4318765/posts",
    "timestamp": "2025-05-23T19:56:15Z"
  },
  {
    "title": "Byte the bullet: Trump threatens 50% tariffs. How might Europe strike back?",
    "description": "Trump threatens 50% tariffs. How might Europe strike back?\nAmerica’s tech giants are a point of vulnerability\nThe truce did not last long. On May 23rd President Donald Trump threatened to impose a tariff of 50% on imports from the European Union, more than do…",
    "link": "https://biztoc.com/x/f89e129703f95eff",
    "timestamp": "2025-05-23T19:56:06Z"
  },
  {
    "title": "Trump tariffs reigniting trade fear from European Union",
    "description": "BRUSSELS: US President Donald Trump threatened on Friday to ratchet up his trade war once again, pushing for a 50 per cent tariff on European Union goods starting June 1 and warning Apple he may slap a 25",
    "link": "https://www.channelnewsasia.com/world/trump-tariffs-reigniting-trade-fear-european-union-5150326",
    "timestamp": "2025-05-23T19:54:51Z"
  },
  {
    "title": "Experts are split on the findings in RFK Jr.'s 'MAHA' report",
    "description": "The HHS secretary's report targeted processed foods and vaccines, among other things",
    "link": "https://theweek.com/politics/experts-findings-rfk-jr-maha",
    "timestamp": "2025-05-23T19:53:44Z"
  },
  {
    "title": "The penny costs nearly 4 cents to make. Here’s how much the US spends on minting its other coins",
    "description": "NEW YORK (AP) — The impending “death” of the U.S. penny has spotlighted the coin’s own price tag — nearly 4 cents to make and distribute each, or quadruple its value. Months after President Donald Trump called on his administration to cease penny production, …",
    "link": "https://financialpost.com/pmn/the-penny-costs-nearly-4-cents-to-make-heres-how-much-the-us-spends-on-minting-its-other-coins",
    "timestamp": "2025-05-23T19:53:34Z"
  },
  {
    "title": "‘Mountainhead’ TV Review: It’s The End Of The World In Jesse Armstrong’s ‘Succession’ Successor & The Techlords Feel Fine, Sorta",
    "description": "SPOILER ALERT – This review does contain details of HBO/Max’s Mountainhead movie – but not theones they asked us not to reveal. If you are still mourning Jesse Armstrong’s now departed Succession, then the Emmy winning writer’s HBO movie Mountainhead will pro…",
    "link": "http://deadline.com/2025/05/mountainhead-review-jesse-armstrong-elon-musk-1236408702/",
    "timestamp": "2025-05-23T19:52:00Z"
  },
  {
    "title": "Trump greenlights Nippon merger with US Steel",
    "description": null,
    "link": "https://www.cnbc.com/2025/05/23/trump-greenlights-nippon-merger-with-us-steel.html",
    "timestamp": "2025-05-23T19:50:44Z"
  },
  {
    "title": "Trump Threatens Apple With 25% Tariff on iPhones. Here’s How U.S. Consumers Could Be Impacted",
    "description": "\"I expect iPhones that will be sold in the United States of America will be manufactured and built in the United States,\" said Trump.",
    "link": "https://time.com/7288457/trump-tim-cook-apple-iphone-tariffs-consumer-cost/",
    "timestamp": "2025-05-23T19:50:25Z"
  }
]