[
  {
    "title": "Trump says Iran warned of missile strike at Al Udeid base: ‘They asked if 1 o’clock was OK — I said fine’",
    "description": "Donald Trump made a surprising claim at a NATO summit. He said Iran warned the US before a missile strike on Al Udeid Air Base. Trump stated he gave Iran the go-ahead for the strike. This was in retaliation for US strikes on Iranian nuclear sites. The attack …",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-says-iran-warned-of-missile-strike-at-al-udeid-base-they-asked-if-1-oclock-was-ok-i-said-fine-donald-trump-latest-news-us-news-iran-news/articleshow/122130521.cms",
    "timestamp": "2025-06-28T12:55:11Z"
  },
  {
    "title": "Donald Trump Accuses CNN ‘Sleazebags’ of Perpetrating a Hoax - The Daily Beast",
    "description": "Donald Trump Accuses CNN ‘Sleazebags’ of Perpetrating a HoaxThe Daily Beast Trump denies reports US looking at $30B nuclear deal with Iran: ‘These people are SICK’The Hill Exclusive: Details emerge of secret diplomatic efforts to restart Iran talksCNN Trump d…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178213096",
    "timestamp": "2025-06-28T12:54:59Z"
  },
  {
    "title": "Donald Trump suffers major legal blow: \"Grave constitutional violations\"",
    "description": "On Friday, a federal judge blocked President Donald Trump's executive order targeting legal firm Susman Godfrey, ruling it was \"unconstitutional from beginning to end.\" This is the fourth defeat in court Trump has suffered since imposing punitive measures on …",
    "link": "https://freerepublic.com/focus/f-news/4325786/posts",
    "timestamp": "2025-06-28T12:52:26Z"
  },
  {
    "title": "Iran holds funeral for commanders and scientists killed in war with Israel",
    "description": "Large crowds of mourners dressed in black lined streets in Iran’s capital Tehran as the country held a funeral on Saturday for top military commanders, nuclear scientists and some of the civilians killed during this month’s aerial war with Israel",
    "link": "https://www.nbcnews.com/world/iran/iran-holds-funeral-commanders-scientists-killed-war-israel-rcna215701",
    "timestamp": "2025-06-28T12:52:04Z"
  },
  {
    "title": "Rwanda, Congo sign US-brokered peace deal to end fighting that killed thousands",
    "description": "Rwanda and the Democratic Republic of Congo signed a U.S.-brokered peace agreement on Friday, raising hopes for an end to fighting that has killed thousands this year.",
    "link": "https://nypost.com/2025/06/28/world-news/rwanda-congo-sign-us-brokered-peace-deal-in-washington/",
    "timestamp": "2025-06-28T12:50:13Z"
  },
  {
    "title": "George Santos: supporting ‘Eric Adams is the only viable path’",
    "description": "Lying ex-Long Island Rep. George Santos is calling on fellow Republicans to cross party lines and back NYC Mayor Eric Adams long-shot re-election bid.",
    "link": "https://nypost.com/2025/06/28/us-news/santos-supporting-eric-adams-is-the-only-viable-path-to-blocking-mamdani-nyc-mayoral-bid/",
    "timestamp": "2025-06-28T12:38:26Z"
  },
  {
    "title": "‘SICK!!!’ Trump Lashes Out At CNN News Team Over Bombshell Report He Calls ‘HOAX’",
    "description": "President Donald Trump lashed out at a CNN reporting team, calling them \"sleazebag\" and their bombshell reporting a \"HOAX\" in a late-night social media post.\nThe post ‘SICK!!!’ Trump Lashes Out At CNN News Team Over Bombshell Report He Calls ‘HOAX’ first appe…",
    "link": "https://www.mediaite.com/media/news/sick-trump-lashes-out-at-cnn-news-team-over-bombshell-report-he-calls-hoax/",
    "timestamp": "2025-06-28T12:36:56Z"
  },
  {
    "title": "Trump eyes staff cuts to top spy agency as he sweeps aside Iran intelligence (Stars & Stripes)",
    "description": "Stars & Stripes:\nTrump eyes staff cuts to top spy agency as he sweeps aside Iran intelligence  —  WASHINGTON (Tribune News Service) — President Donald Trump is pressing ahead with plans to slash staff at the top U.S. spy agency, determined to act at a time wh…",
    "link": "https://www.memeorandum.com/250628/p11",
    "timestamp": "2025-06-28T12:35:01Z"
  },
  {
    "title": "Senators launch a weekend of work to meet Trump’s deadline for passing his tax and spending cuts",
    "description": "By LISA MASCARO WASHINGTON (AP) — The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities i…",
    "link": "https://www.denverpost.com/2025/06/28/senators-launch-a-weekend-of-work-to-meet-trumps-deadline-for-passing-his-tax-and-spending-cuts/",
    "timestamp": "2025-06-28T12:32:37Z"
  },
  {
    "title": "Senators voting in weekend session to meet Trump’s deadline for passing his tax and spending cuts",
    "description": "By LISA MASCARO WASHINGTON (AP) — The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities i…",
    "link": "https://www.denverpost.com/2025/06/28/senators-voting-in-weekend-session-to-meet-trumps-deadline-for-passing-his-tax-and-spending-cuts/",
    "timestamp": "2025-06-28T12:32:37Z"
  },
  {
    "title": "Senate Republicans advance Trump’s tax and spending cuts bill after dramatic late-night vote",
    "description": "By LISA MASCARO WASHINGTON (AP) — The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities i…",
    "link": "https://www.denverpost.com/2025/06/28/senate-republicans-advance-trumps-tax-and-spending-cuts-bill-after-dramatic-late-night-vote/",
    "timestamp": "2025-06-28T12:32:37Z"
  },
  {
    "title": "Senators prep for a weekend of work to meet Trump’s deadline for passing his tax and spending cuts",
    "description": "By LISA MASCARO WASHINGTON (AP) — The Senate is expected to grind through a rare weekend session as Republicans race to pass President Donald Trump’s package of tax breaks and spending cuts by his July Fourth deadline. Republicans are using their majorities i…",
    "link": "https://www.denverpost.com/2025/06/28/senators-prep-for-a-weekend-of-work-to-meet-trumps-deadline-for-passing-his-tax-and-spending-cuts/",
    "timestamp": "2025-06-28T12:32:37Z"
  },
  {
    "title": "State budget remains safe amidst early 2025 challenges: Ministry",
    "description": "The Ministry of Finance has assured that the State Budget remained safe from extraneous shocks amid global turmoil in the first half of 2025.\r\n\r\n&ldquo;Our ...",
    "link": "https://en.antaranews.com/news/362577/state-budget-remains-safe-amidst-early-2025-challenges-ministry",
    "timestamp": "2025-06-28T12:31:36Z"
  },
  {
    "title": "Who's Poland's new president?",
    "description": "Poland’s president-elect, Karol Nawrocki, is a right-wing historian, an amateur boxer and a fan of Donald Trump. What will his presidency mean for the region? Kateryna Khinkulova, editor of the newly launched BBC News Polska, explains. Plus, India’s ‘tailor o…",
    "link": "https://www.bbc.co.uk/programmes/p0lld2lj",
    "timestamp": "2025-06-28T12:30:00Z"
  },
  {
    "title": "'Arrogant' Amy Coney Barrett buried over 'out of bounds' personal attack",
    "description": "Justice Amy Coney Barrett was called out on Saturday morning for her thin-skinned and personal response to a dissent written by Justice Ketanji Brown Jackson.Writing the 6-3 conservative majority opinion that handed the Donald Trump administration a win with …",
    "link": "https://www.rawstory.com/coney-barrett-jackson/",
    "timestamp": "2025-06-28T12:28:55Z"
  },
  {
    "title": "Warning to NY: Don’t make the mistake we did in San Francisco by electing Zohran Mamdani",
    "description": "Take heed, New Yorkers, and learn from San Francisco’s mistakes: The City by the Bay has discovered to its sorrow that charismatic leaders like Zohran Mamdani can dazzle — but their decisions can be disastrous. Just a few years ago San Franciscans, too, suppo…",
    "link": "https://freerepublic.com/focus/f-chat/4325780/posts",
    "timestamp": "2025-06-28T12:25:57Z"
  },
  {
    "title": "Rod Stewart says country should 'give Nigel Farage a chance'",
    "description": "The 80-year-old singer backed the Reform UK leader ahead of appearing at Glastonbury's afternoon legends slot on Sunday.",
    "link": "https://news.stv.tv/entertainment/rod-stewart-says-country-should-give-nigel-farage-a-chance",
    "timestamp": "2025-06-28T12:24:45Z"
  },
  {
    "title": "Initially wary of Trump, Roberts and Barrett offer the president his biggest win of the Supreme Court term",
    "description": "Chief Justice John Roberts chastised President Donald Trump early on in his second term, and Justice Amy Coney Barrett pointedly questioned whether his administration would adhere to court orders.",
    "link": "https://www.cnn.com/2025/06/28/politics/john-roberts-amy-coney-barrett-trump-ruling",
    "timestamp": "2025-06-28T12:23:08Z"
  },
  {
    "title": "Saturday: Hili dialogue",
    "description": "Welcome to CaturSaturday, June 28, 2025 and in a week I’ll be flying to Helsinki on the first stage of my Arctic trip. It is of course shabbos for Jewish cats, and National Foodie Day, celebrating all people who like food (see the Wikipedia entry here). I wou…",
    "link": "https://whyevolutionistrue.com/2025/06/28/saturday-hili-dialogue-538/",
    "timestamp": "2025-06-28T12:15:15Z"
  },
  {
    "title": "At least 49 people killed by Israeli strikes in Gaza as ceasefire prospects inch closer",
    "description": "Mediator Qatar has called on Israel and Hamas to seize a chance for peace in the region.",
    "link": "https://www.thejournal.ie/israeli-strikes-gaza-as-ceasefire-prospects-inch-closer-6746373-Jun2025/",
    "timestamp": "2025-06-28T12:08:10Z"
  },
  {
    "title": "Who is Hariana Veras, the woman Trump flirted with? President says she is beautiful and wishes more were like her",
    "description": "Hariana Veras, a White House correspondent, was praised by US President Donald Trump at a peace deal signing between Democratic Republic of Congo and Rwanda. The event occurred in the Oval Office. Veras spoke about hope in Congo. Trump complimented her remark…",
    "link": "https://economictimes.indiatimes.com/news/international/us/who-is-hariana-veras-the-woman-trump-flirted-with-president-says-she-is-beautiful-and-wishes-more-were-like-her-donald-trump-flirting-news-us-news/articleshow/122130067.cms",
    "timestamp": "2025-06-28T12:07:32Z"
  },
  {
    "title": "Why authorities in Qatar are warning people to stay away from unidentified objects",
    "description": "Qatar's Defence and Interior Ministries issued a safety advisory urging the public to report suspicious debris potentially linked to intercepted Iranian missiles, following an attack on the Al Udeid US base. As a precaution, citizens are asked not to approach…",
    "link": "https://economictimes.indiatimes.com/news/international/uae/why-authorities-in-qatar-are-warning-people-to-stay-away-from-unidentified-objects/articleshow/122130405.cms",
    "timestamp": "2025-06-28T12:07:20Z"
  },
  {
    "title": "At least 60 killed in Israeli strikes across Gaza, health staff say",
    "description": "At least 60 people have been killed in Israeli strikes across Gaza, health staff have said.",
    "link": "https://news.sky.com/story/at-least-60-killed-in-israeli-strikes-across-gaza-health-staff-say-13389711",
    "timestamp": "2025-06-28T12:06:00Z"
  },
  {
    "title": "The Supreme Court Put Nationwide Injunctions to the Torch",
    "description": "That isn’t the disaster for birthright citizenship that some fear.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/06/supreme-court-trump-injunctions/683354/",
    "timestamp": "2025-06-28T12:03:10Z"
  },
  {
    "title": "Democrats who locked down America during COVID now cry dictator over Trump's deportations | Blaze Media",
    "description": "Democrats who locked down America during COVID now cry dictator over Trump's deportations | Blaze Mediatheblaze.com",
    "link": "https://www.theblaze.com/news/democrats-who-locked-down-america-during-covid-now-cry-dictator-over-trump-s-deportations",
    "timestamp": "2025-06-28T12:02:05Z"
  },
  {
    "title": "Diver who freed sharks gets Trump pardon after felony conviction stuns him: 'My heart sank'",
    "description": "Trump pardons Florida diver who faced felony charges after cutting a longline and releasing 19 sharks, believing he was stopping illegal fishing activity.",
    "link": "https://www.foxnews.com/us/diver-who-freed-sharks-gets-trump-pardon-after-felony-conviction-stuns-him-my-heart-sank",
    "timestamp": "2025-06-28T12:00:31Z"
  },
  {
    "title": "Jeanine Pirro used to be a prosecutor. Trump will make her a weapon",
    "description": "President Donald Trump looks on as interim U.S. Attorney for Washington, D.C. Jeanine Pirro speaks during her swearing in ceremony in the Oval Office of the White House on May 28, 2025 .",
    "link": "https://biztoc.com/x/72a9c5f9fab019c8",
    "timestamp": "2025-06-28T12:00:27Z"
  },
  {
    "title": "Fact check: Trump makes big false claims about his big domestic policy bill | CNN Politics",
    "description": "Fact check: Trump makes big false claims about his big domestic policy bill | CNN Politicscnn.com",
    "link": "https://www.cnn.com/2025/06/28/politics/fact-check-trump-big-beautiful-bill",
    "timestamp": "2025-06-28T12:00:24Z"
  },
  {
    "title": "Why Donald Trump Is Trying To Make An Example Out Of This One House Republican",
    "description": "Rep. Thomas Massie (R-Ky.) isn’t an anti-Trumper, but he won’t set aside his dislike of deficits to vote for the so-called Big Beautiful Bill.",
    "link": "https://www.huffpost.com/entry/thomas-massie-donald-trump-grandstander_n_685f0b19e4b0a28ae2082497",
    "timestamp": "2025-06-28T12:00:20Z"
  },
  {
    "title": "The Trump administration's \"divide and conquer\" approach to LGBTQ rights",
    "description": "Now in its sixth month, President Trump's administration has become the antithesis of progress, many LGBTQ Americans say.",
    "link": "https://www.cbsnews.com/news/trump-administration-lgbtq-rights-divide-conquer-approach/",
    "timestamp": "2025-06-28T12:00:11Z"
  },
  {
    "title": "Trump Stood Up For Nigerian Christians Before. He Should Do It Again Now",
    "description": "By Sean Nelson via The Daily Signal | June 23, 2025\n“We’re deeply concerned by religious violence in Nigeria, including the burning of churches, and the killing and persecution of Christians. It’s a horrible story.” \nThese were President Donald Trump’s words …",
    "link": "https://biztoc.com/x/86052d7be909f494",
    "timestamp": "2025-06-28T12:00:06Z"
  },
  {
    "title": "Why Politics Is So Insanely Complicated in 2025",
    "description": "Why is politics so insanely complicated in 2025: Trump’s chaos has spilled beyond the White House, leading to an arcane budget process and shadowy Supreme Court rulings. Good luck following any of it.",
    "link": "http://nymag.com/intelligencer/article/why-politics-is-so-insanely-complicated-in-2025.html",
    "timestamp": "2025-06-28T12:00:06Z"
  },
  {
    "title": "Stablecoins go mainstream: Why banks and credit card firms are issuing their own crypto tokens",
    "description": "Stablecoins are seemingly everywhere, with Mastercard, Visa and JPMorgan all making recent moves in the crypto token space.",
    "link": "https://www.cnbc.com/2025/06/28/stablecoin-visa-mastercard-circle-jpmorgan.html",
    "timestamp": "2025-06-28T12:00:01Z"
  },
  {
    "title": "A Reboot for Capitalism’s Operating System",
    "description": "Capitalism’s operating system is due for a major upgrade. How that turns out depends on enormously consequential political choices.",
    "link": "https://www.theatlantic.com/economy/archive/2025/06/reboot-capitalism-operating-system/683308/",
    "timestamp": "2025-06-28T12:00:00Z"
  },
  {
    "title": "Democrats Can’t Make Up Their Mind When It Comes to Trump And The National Guard",
    "description": "By Deroy Murdock, The Daily Signal | June 23, 2025\n“I look at the Democrats in front of me, and I realize there is absolutely nothing I can say to make them happy or to make them stand or smile or applaud, nothing I can do,” President Donald Trump told a join…",
    "link": "https://biztoc.com/x/d648881601fcc8d8",
    "timestamp": "2025-06-28T11:49:12Z"
  },
  {
    "title": "‘Huge’ BlackRock Crypto Bombshell Suddenly Hurtling Toward Bitcoin At Key Price ‘Turning Point’",
    "description": "Bitcoin and crypto are braced for a \"huge\" BlackRock crypto market bombshell that has suddenly appeared on the \"horizon\"...",
    "link": "https://www.forbes.com/sites/digital-assets/2025/06/28/huge-blackrock-crypto-bombshell-suddenly-hurtling-toward-bitcoin-at-key-price-turning-point/",
    "timestamp": "2025-06-28T11:45:11Z"
  },
  {
    "title": "Record crowds expected at Budapest Pride march in defiance of Orban's ban...",
    "description": "Record-breaking numbers of revellers are expected to turn out on the streets of Budapest on Saturday in defiance of a new law by Prime Minister Viktor...",
    "link": "https://uk.news.yahoo.com/record-crowds-expected-budapest-pride-074310616.html",
    "timestamp": "2025-06-28T11:43:37Z"
  },
  {
    "title": "What is Canada’s digital tax and why is Trump killing trade talks over it?",
    "description": "Trump says Canada's new tax will cost US companies billions; he will announce new tariffs on Canada within days.",
    "link": "https://www.aljazeera.com/economy/2025/6/28/what-is-canadas-digital-tax-and-why-is-trump-killing-trade-talks-over-it",
    "timestamp": "2025-06-28T11:41:31Z"
  },
  {
    "title": "Trump Melts Down At CNN Anchor In Late-Night Rant Over Displeasing Commentary",
    "description": "Trump raged at Abby Phillip over commentary denigrating his trade policy and crediting a stock market rally to him \"backing down.\"\nThe post Trump Melts Down At CNN Anchor In Late-Night Rant Over Displeasing Commentary first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/trump-melts-down-at-cnn-anchor-in-late-night-rant-over-displeasing-commentary/",
    "timestamp": "2025-06-28T11:40:12Z"
  },
  {
    "title": "'Peak Trumpism': State Department staffers furious at demands under Rubio",
    "description": "At the same time he is proposing massive layoffs at the State Department, Secretary of State Marco Rubio is pushing staffers to work longer hours and push out more propaganda to polish the image of Donald Trump.According to a report from the Washington Post, …",
    "link": "https://www.rawstory.com/rubio-revolt-state-department/",
    "timestamp": "2025-06-28T11:38:44Z"
  },
  {
    "title": "Iran Has Only One Negotiating Chip Left: Its Survival",
    "description": "By Victor Davis Hanson, The Daily Signal | June 23, 2025\nHello, this is Victor Davis Hanson for The Daily Signal. On June 22, this past Saturday night, President Donald Trump ordered B-2 bombers—these are the multibillion-dollar bombers based in Missouri—and …",
    "link": "https://biztoc.com/x/c900830992b40503",
    "timestamp": "2025-06-28T11:38:05Z"
  },
  {
    "title": "Trump wins as Supreme Court curbs judges, but may yet lose on birthright citizenship",
    "description": "‘The ruling is set to go into effect 30 days from now and leaves families in states across the country in deep uncertainty about whether their children will be born as US citizens’",
    "link": "https://www.thehindubusinessline.com/news/world/trump-wins-as-supreme-court-curbs-judges-but-may-yet-lose-on-birthright-citizenship/article69748133.ece",
    "timestamp": "2025-06-28T11:34:21Z"
  },
  {
    "title": "Africa peace deal brokered by Trump tied to US resource push",
    "description": "Rwanda and the DR Congo have signed a peace deal which US President Donald Trump says gives the US rights to the region’s mineral wealth Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/620706-rwanda-congo-trump-minerals/",
    "timestamp": "2025-06-28T11:33:56Z"
  },
  {
    "title": "Can the World Health Organization survive Donald Trump’s presidency?",
    "description": "Donald Trump’s decision to withdraw the United States from the World Health Organization (WHO) will have major implications for global health. Hassan Damluji writes that while the organisation will survive, its ability to help the world respond to future heal…",
    "link": "https://blogs.lse.ac.uk/usappblog/2025/06/28/can-the-world-health-organization-survive-donald-trumps-presidency/",
    "timestamp": "2025-06-28T11:30:00Z"
  },
  {
    "title": "At least 49 people killed in latest Israeli strikes on Gaza",
    "description": "Donald Trump hints at progress on possible ceasefire with Israeli minister due in Washington next week",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/28/at-least-49-people-killed-in-latest-israeli-strikes-on-gaza/",
    "timestamp": "2025-06-28T11:28:47Z"
  },
  {
    "title": "Trump’s Head-Spinning Foreign Policy",
    "description": "“President Trump hasn’t sounded much like Donald Trump in recent days,” the Wall Street Journal reports. “He said the U.S. needed to attack Iran over a growing nuclear threat, the North Atlantic Treaty Organization wasn’t",
    "link": "https://politicalwire.com/2025/06/28/trumps-head-spinning-foreign-policy/",
    "timestamp": "2025-06-28T11:27:48Z"
  },
  {
    "title": "‘Ask Mike Pence’: Thomas Massie Expands His War Of Words To JD Vance",
    "description": "By Robert McGreevy, Daily Caller News Foundation | June 24, 2025\nRepublican Kentucky Rep. Thomas Massie took a swipe at Vice President JD Vance in a Tuesday afternoon X post, expanding what was already a verbal battle between him and President Donald Trump.\nM…",
    "link": "https://biztoc.com/x/055ba09c83d67221",
    "timestamp": "2025-06-28T11:27:31Z"
  },
  {
    "title": "Trump’s Words For Israel After It Struck Iran Post-Ceasefire",
    "description": "By Elizabeth Troutman Mitchell, The Daily Signal | June 24, 2025\nPresident Donald Trump is “not happy” that Israel fired rockets at Iran shortly after the nation’s ceasefire with Iran took effect.\n“Israel, as soon as we made the deal, they came out and they d…",
    "link": "https://biztoc.com/x/96fc6410b1400e46",
    "timestamp": "2025-06-28T11:27:08Z"
  },
  {
    "title": "Supreme Court Gives Trump Administration Green Light To Deport Illegal Aliens To Third-Party Countries",
    "description": "By Virginia Allen, The Daily Signal | June 24, 2025\nIn a win for President Donald Trump, the Supreme Court issued a brief order Monday allowing the Trump administration to restart deportation flights of illegal aliens to nations other than their own. The high…",
    "link": "https://biztoc.com/x/385b475a84c98a83",
    "timestamp": "2025-06-28T11:26:55Z"
  },
  {
    "title": "ICC President Tomoko Akane criticizes U.S. sanctions",
    "description": "\"The sanctions have had impacts on third countries, and they violate international law,\" Akane told Japanese media outlets online Friday.",
    "link": "https://www.japantimes.co.jp/news/2025/06/28/world/crime-legal/tomoko-akane-criticizes-us-sanctions/",
    "timestamp": "2025-06-28T11:21:00Z"
  },
  {
    "title": "What the Supreme Court’s latest ruling means for citizenship of babies born in US",
    "description": "Will babies born to immigrants living illegally in some states be entitled to citizenship, but not in others? Can children born to such parents in states where the order is in effect be deported?",
    "link": "https://timesofindia.indiatimes.com/toi-plus/international/what-the-supreme-courts-latest-ruling-means-for-citizenship-of-babies-born-in-us/articleshow/122129361.cms",
    "timestamp": "2025-06-28T11:19:58Z"
  },
  {
    "title": "Duo Still Pressing For House War Powers Resolution On Iran, But Speaker Says It’s Not ‘Necessary’",
    "description": "By Jacob Adams, The Daily Signal | June 24, 2025\nReps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., are spearheading a war powers resolution that would direct President Donald Trump to cease using the military against Iran without congressional approval.\nBu…",
    "link": "https://biztoc.com/x/bea1f6eb7e702748",
    "timestamp": "2025-06-28T11:16:19Z"
  },
  {
    "title": "Under Trump, GOP Support For 'Path To Legality' Has Spiked",
    "description": "According to a new Quinnipiac University poll, support for providing a pathway to legality for undocumented immigrants has jumped among Republicans and independents in the six months since Co-Presidents Donald Trump and Stephen Miller took office. Democratic …",
    "link": "https://crooksandliars.com/2025/06/gop-support-immigrant-path-legality-has",
    "timestamp": "2025-06-28T11:05:23Z"
  },
  {
    "title": "Iran's military warns Trump against 'reckless rhetoric'",
    "description": "Spokesperson for Iran's Islamic Revolutionary Guard Corps (IRGC), Ali Mohamad Naeini, warned United States President Donald Trump on Saturday against pursuing his \"reckless rhetoric\" against Tehran.\"O...",
    "link": "https://biztoc.com/x/48a9863d4a007a72",
    "timestamp": "2025-06-28T11:05:02Z"
  },
  {
    "title": "House Republicans proposed to diminish a federal grant for students. Campus leaders want the Senate to save it.",
    "description": "Under proposed changes in the House, most recipients of the Pell Grant could receive a smaller award.",
    "link": "https://www.politico.com/news/2025/06/28/house-republicans-proposed-to-diminish-a-federal-grant-for-students-campus-leaders-want-the-senate-to-save-it-00429768",
    "timestamp": "2025-06-28T11:02:45Z"
  },
  {
    "title": "Trump Cabinet Members' Only Job: Attack The Press",
    "description": "Pettiness, jealousy, and sycophancy are the only qualifications needed to be part of Trump's cabinet or his communications teams.\nOn Thursday, we were treated to two such vile instances. \nThe first one was Secretary of Defense Pete Hegseth, who, unprovoked, a…",
    "link": "https://crooksandliars.com/2025/06/trump-cabinet-members-only-job-attack",
    "timestamp": "2025-06-28T11:00:57Z"
  },
  {
    "title": "Trump Returns From NATO Summit with a Revamped Nixon Doctrine. Plus, an Ode to Joe Biden's Debate Collapse.",
    "description": "Pulling their weight: At the height of this week's NATO summit, China's ambassador to Nepal lashed out at the European \"ass kissers\" who made nice with Donald Trump. \"His anger is well founded,\" writes the Hudson Institute's Mike Watson. \"Between the bombing …",
    "link": "https://freebeacon.com/newsletters/trump-returns-from-nato-summit-with-a-revamped-nixon-doctrine-plus-an-ode-to-joe-bidens-debate-collapse/",
    "timestamp": "2025-06-28T11:00:51Z"
  },
  {
    "title": "Yale scholarship discriminating based on race, civil rights complaint alleges",
    "description": "The Equal Protection Project is challenging Yale and AAAP over REACH minority program that limits eligibility based on race, following President Trump's crackdown on DEI programs.",
    "link": "https://www.foxnews.com/media/yale-scholarship-discriminating-based-race-civil-rights-complaint-alleges",
    "timestamp": "2025-06-28T11:00:36Z"
  },
  {
    "title": "AOC's claimed Bronx identity called 'bold-face lie' by former schoolmate turned NY assemblyman",
    "description": "New York Assemblyman Matt Slater shared a yearbook photo of Rep. Alexandria Ocasio-Cortez, calling her 'Bronx girl' identity into question.",
    "link": "https://www.foxnews.com/media/aocs-claimed-bronx-identity-called-bold-face-lie-former-schoolmate-turned-ny-assemblyman",
    "timestamp": "2025-06-28T11:00:30Z"
  },
  {
    "title": "This Viral Video Has People Talking About Christianity Versus 'MAGA Christianity'",
    "description": "“As a Christian, I don't think you can be both MAGA and Christian,” one person wrote in the comments of the video.",
    "link": "https://www.huffpost.com/entry/this-viral-video-has-people-talking-about-christianity-versus-maga-christianity-goog_n_685d63d4e4b0bd0253106ddc",
    "timestamp": "2025-06-28T11:00:18Z"
  },
  {
    "title": "Seven PIEP staff return home after Iraq crisis",
    "description": "PT Pertamina International Exploration and Production (PIEP) announced on Friday that seven employees, evacuated from Basra, Iraq, due to heightened tensions ...",
    "link": "https://en.antaranews.com/news/362553/seven-piep-staff-return-home-after-iraq-crisis",
    "timestamp": "2025-06-28T10:54:26Z"
  },
  {
    "title": "Israeli strikes in Gaza kill at least 34 people",
    "description": "There is hope among families of hostages that Trump’s involvement in securing the recent ceasefire between Israel and Iran might exert more pressure for a deal in Gaza.",
    "link": "https://www.wapt.com/article/israeli-strikes-gaza-ceasefire-prospects/65231464",
    "timestamp": "2025-06-28T10:53:58Z"
  },
  {
    "title": "Donald Trump Blasts $30 Billion Iran Nuclear Deal Report: 'Hoax'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has rejected as a \"hoax\" media reports that his administration was considering a $30 billion deal to assist Iran in developing civilian nuclear facilities.\nThe reports by CNN and NBC New…",
    "link": "https://biztoc.com/x/450c42607ecf88af",
    "timestamp": "2025-06-28T10:53:58Z"
  },
  {
    "title": "National Security Expert Anticipates President Trump’s Next Move",
    "description": "By Lorenzo Prieto, The Daily Signal | June 24, 2025\nPresident Donald Trump shared early Tuesday his disappointment with Israel for launching missiles at Iran, hours after reaching a temporary ceasefire with Iran.\n“We basically have two countries that have bee…",
    "link": "https://biztoc.com/x/7bbd80b7243793b3",
    "timestamp": "2025-06-28T10:53:55Z"
  },
  {
    "title": "Despite moves by Indiana lawmakers, Illinois’ borders are unlikely to change. Here’s why",
    "description": "Regional animosities have existed in Illinois since before it was admitted to the Union in 1818 as the 21st state, and only grew stronger with Chicago’s rise as an economic powerhouse in the late 19th and early 20th centuries.",
    "link": "https://pantagraph.com/news/state-regional/government-politics/article_64be540d-c655-417c-a6ce-d6307737e5a7.html",
    "timestamp": "2025-06-28T10:50:00Z"
  },
  {
    "title": "“This evil man”: The guy accused of trying to kill Trump is about to face Aileen Cannon",
    "description": "The case against Ryan Wesley Routh is being handled by one of the president's favorite jurists: Judge Aileen Cannon",
    "link": "https://www.salon.com/2025/06/28/this-evil-man-the-guy-accused-of-trying-to-kill-trump-is-about-to-face-aileen-cannon/",
    "timestamp": "2025-06-28T10:45:58Z"
  },
  {
    "title": "Donald Trump Blasts $30 Billion Iran Nuclear Deal Report: 'Hoax'",
    "description": "The president has hit back at the report that his administration would help fund non-military nuclear facilities for Iran.",
    "link": "https://www.newsweek.com/donald-trump-iran-nuclear-deal-report-2091944",
    "timestamp": "2025-06-28T10:43:49Z"
  },
  {
    "title": "Mike Tyson gets involved in politics and makes a request to Donald Trump",
    "description": "When it comes to boxing, Mike Tyson&apos;s opinion is one of the most valuable and most listened to by fans. But what about his ideology when it comes to social situations involvin",
    "link": "https://www.marca.com/en/boxing/2025/06/28/685fc35a46163f23648b457d.html",
    "timestamp": "2025-06-28T10:34:34Z"
  },
  {
    "title": "Donald Trump Scores War Powers Win: 'National Security Moves Fast'",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nThe Republican-controlled U.S. Senate on Friday rejected a Democratic effort to limit President Donald Trump's authority to launch further military action against Iran—just hours after Trump said he was weighi…",
    "link": "https://biztoc.com/x/f96377d7e04b8fab",
    "timestamp": "2025-06-28T10:31:55Z"
  },
  {
    "title": "ICE Rolls Facial Recognition Tools Out to Officers' Phones",
    "description": "Plus: US feds charge alleged masterminds behind infamous forum, Scattered Spider targets airlines, and hackers open a valve at a Norwegian dam.",
    "link": "https://www.wired.com/story/ice-rolls-facial-recognition-tools-out-to-officers-phones/",
    "timestamp": "2025-06-28T10:30:00Z"
  },
  {
    "title": "Iran holds state funeral for military leaders killed in Israel conflict",
    "description": "Military leaders and nuclear scientists are being buried days after a ceasefire came into effect.",
    "link": "https://www.bbc.co.uk/news/articles/cvg978nkwxro",
    "timestamp": "2025-06-28T10:27:36Z"
  },
  {
    "title": "Donald Trump Scores War Powers Win: 'National Security Moves Fast'",
    "description": "The Senate voted against the war powers resolution, which would have required the president to seek congressional approval for any new hostilities against Iran.",
    "link": "https://www.newsweek.com/donald-trump-iran-war-powers-congress-2091950",
    "timestamp": "2025-06-28T10:24:33Z"
  },
  {
    "title": "Even as markets rally, Trump's policymaking causes market angst",
    "description": "(Reuters) -As Wall Street puts April's tariff shakeout in the rearview mirror and indexes set record highs, investors remain wary of U.S. President Donald...",
    "link": "https://finance.yahoo.com/news/even-markets-rally-trumps-policymaking-101453126.html",
    "timestamp": "2025-06-28T10:14:53Z"
  },
  {
    "title": "'Problem what problem' - Trump says he will get the conflict solved with North Korea",
    "description": "Read full story",
    "link": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/28/039problem-what-problem039---trump-says-he-will-get-the-conflict-solved-with-north-korea",
    "timestamp": "2025-06-28T10:11:00Z"
  },
  {
    "title": "Iran slams Trump over ‘disrespect’",
    "description": "Stopping the insults is a precondition for resuming nuclear talks, Foreign Minister Abbas Araghchi has said Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620709-iran-slams-trump-disrespect/",
    "timestamp": "2025-06-28T10:10:47Z"
  },
  {
    "title": "Aiea man, 48, allegedly in U.S. illegally for 17 years | Honolulu Star-Advertiser",
    "description": "A man deported 17 years ago after repeated attempts to enter the U.S. illegally was arrested by federal agents at an Aiea address linked to money remittances he was sending to Mexico.",
    "link": "https://www.staradvertiser.com/2025/06/28/hawaii-news/aiea-man-48-allegedly-in-u-s-illegally-for-17-years-2/",
    "timestamp": "2025-06-28T10:10:25Z"
  },
  {
    "title": "Immigrants scramble for clarity after Supreme Court birthright ruling",
    "description": "WASHINGTON (Reuters) -The U.S. Supreme Court's ruling tied to birthright citizenship prompted confusion and phone calls to lawyers as people who could be...",
    "link": "https://www.yahoo.com/news/immigrants-scramble-clarity-supreme-court-100946525.html",
    "timestamp": "2025-06-28T10:09:46Z"
  },
  {
    "title": "Record attendance expected at Budapest Pride march despite Orban warning",
    "description": "Thousands to march in Hungary's capital despite government ban, highlighting EU-wide resistance against anti-LGBTQ laws.",
    "link": "https://www.aljazeera.com/news/2025/6/28/record-attendance-expected-at-budapest-pride-march-despite-orban-warning",
    "timestamp": "2025-06-28T10:02:50Z"
  },
  {
    "title": "How a Trump rally turned this former cop into a conservative Youtube star",
    "description": "YouTuber and former police officer Brandon Tatum spoke with Fox News Digital about how he became one of the leading voices in the conservative movement today.",
    "link": "https://www.foxnews.com/media/how-trump-rally-turned-former-cop-conservative-youtube-star",
    "timestamp": "2025-06-28T10:00:50Z"
  },
  {
    "title": "Final day of SCOTUS decisions brings wave of history-making rulings",
    "description": "The Supreme Court's last decision day of its term involved the justices reining in judicial power and serving up a victory for parents in the ongoing culture wars.",
    "link": "https://www.foxnews.com/politics/final-day-scotus-decisions-brings-wave-history-making-rulings",
    "timestamp": "2025-06-28T10:00:43Z"
  },
  {
    "title": "Trump’s NATO Turnaround: From threatening to pull US out to 'daddy' of the alliance",
    "description": "Following years of criticizing NATO as a \"rip-off,\" President Trump now endorses the alliance as member countries agree to double their defense spending targets.",
    "link": "https://www.foxnews.com/politics/trumps-nato-turnaround-from-threatening-pull-us-out-daddy-alliance",
    "timestamp": "2025-06-28T10:00:42Z"
  },
  {
    "title": "You Can Actually Help Kneecap Trump’s ‘Mass Deportation’ Arrests. Here’s How.",
    "description": "The mass deportation agenda relies upon some key choke points.",
    "link": "https://www.huffpost.com/entry/donald-trump-mass-deportation-resistance-choke-points_n_685d882fe4b01b4b31df992f",
    "timestamp": "2025-06-28T10:00:21Z"
  },
  {
    "title": "Credibility Crisis: Media scrutinized Trump's health, fitness in first term before turning blind eye on Biden",
    "description": "The legacy media's tense scrutiny of Donald Trump's fitness during his first term in office is being revisited as Joe Biden's cognitive decline scandal continues making headlines.",
    "link": "https://www.foxnews.com/media/credibility-crisis-media-scrutinized-trumps-health-fitness-first-term-before-turning-blind-eye-biden",
    "timestamp": "2025-06-28T10:00:20Z"
  },
  {
    "title": "How Zohran Mamdani’s win in the New York City mayoral primary could ripple across the country",
    "description": "\"Mamdani’s win is clearly a rebuke of the more corporate wing of the Democratic Party.\"",
    "link": "https://www.salon.com/2025/06/28/how-zohran-mamdanis-win-in-the-new-york-city-mayoral-primary-could-ripple-across-the-country/",
    "timestamp": "2025-06-28T10:00:16Z"
  },
  {
    "title": "Harvey Milk is an icon. Pete Hegseth is an idiot",
    "description": "Pete Hegseth \r\nlikes to puff out his chest and wrap himself in the flag, replete with his eye-rolling star-spangled banner pocket square. His entire act is so phony, so immature, so beyond the realm of what gentlemen should be.",
    "link": "https://www.advocate.com/voices/harvey-milk-pete-hegseth",
    "timestamp": "2025-06-28T10:00:04Z"
  },
  {
    "title": "Crypto Momentum Continues: US House Passes Legislation To Promote Blockchain Adoption",
    "description": "The US House of Representatives has advanced a new bipartisan crypto legislation to promote Blockchain adoption in different areas and boost the nation’s competitiveness with federal support. Related Reading: ‘An Opening For India’: BJP’s National Spokesperso…",
    "link": "https://bitcoinist.com/crypto-momentum-continues-us-house-passes-legislation-to-promote-blockchain-adoption/",
    "timestamp": "2025-06-28T10:00:04Z"
  },
  {
    "title": "Markets are gearing up for rate cuts. Morgan Stanley thinks investors will be disappointed.",
    "description": "Morgan Stanley analysts predict that, despite recent dovish comments from officials, the Fed is unlikely to cut interest rates soon.",
    "link": "https://www.businessinsider.com/rate-cuts-fed-powell-interest-rates-inflation-economy-trump-tariffs-2025-6",
    "timestamp": "2025-06-28T10:00:01Z"
  },
  {
    "title": "Who’s the Real Bully of the Middle East?",
    "description": "Iranian American author Hooman Majd on the Israel–Iran ceasefire, Trump’s role in escalating the conflict, and whether diplomacy can survive.\nThe post Who’s the Real Bully of the Middle East? appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/06/28/podcast-iran-nuclear-trump-diplomacy/",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "The Red State Where Republicans Aren’t Afraid of Trump",
    "description": "Some of the last remaining GOP holdouts hail from the same state.",
    "link": "https://www.theatlantic.com/politics/archive/2025/06/kentucky-trump-republican-opposition/683353/",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "Jeanine Pirro used to be a prosecutor. Trump will make her a weapon.",
    "description": "Only in the Trump administration is the appointment of Fox News host Jeanine Pirro a better option for U.S. attorney of the District of Columbia — barely.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jeanine-pirro-fox-news-trump-prosecutor-dc-weapon-rcna215526",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "The fight for birthright citizenship started with these Black Americans",
    "description": "A 6-3 Supreme Court majority avoided ruling on the constitutionality of President Donald Trump’s executive order restricting birthright citizenship.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/supreme-court-birthright-citizenship-ruling-black-americans-rcna215665",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "Trump’s second term is giving a green light to blatant racism",
    "description": "Even when compared with his first stint in the White House, Trump’s second administration seems far more permissive of unabashed bigotry.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-racism-bigotry-ogles-zohran-mamdani-maga-rcna215644",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "How Brad Lander Lost an Election but Became a National Inspiration",
    "description": "Zohran Mamdani’s decisive victory in Tuesday night’s Democratic mayoral primary in New York City is the latest event heralding the potential end of what we frequently refer to as “politics as usual.” Disgraced former Governor Andrew Cuomo, the candidate of Bi…",
    "link": "https://newrepublic.com/post/197324/brad-lander-mamdani-national-inspiration",
    "timestamp": "2025-06-28T10:00:00Z"
  },
  {
    "title": "Michael Hudson: The U.S. Empire’s Plan for Global Domination",
    "description": "Michael Hudson: War on Iran is part of the US empire’s effort to re-impose its dominance on the global political and financial system",
    "link": "https://www.nakedcapitalism.com/2025/06/michael-hudson-the-u-s-empires-plan-for-global-domination.html",
    "timestamp": "2025-06-28T09:51:14Z"
  }
]