[
  {
    "title": "Trump’s choice for surgeon general becomes his latest personnel failure",
    "description": "Former Fox News contributor Janette Nesheiwat was an odd choice for surgeon general. As her nomination collapses, Trump's list of failures grows longer.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-surgeon-general-nesheiwat-casey-means-rcna205458",
    "timestamp": "2025-05-07T20:54:36Z"
  },
  {
    "title": "What Are Those Gold Medallions Trump Keeps Adding to the Oval Office?",
    "description": "A series of ornate golden appliqués that were affixed to the fireplace have started to appear elsewhere in the room, as if the decor were multiplying itself.",
    "link": "https://www.newsweek.com/what-are-those-gold-medallions-trump-keeps-adding-oval-office-2069262",
    "timestamp": "2025-05-07T20:51:28Z"
  },
  {
    "title": "Trump offers to 'help' relieve conflict between India and Pakistan",
    "description": "President Donald Trump on Wednesday offered to help dial back tension between India and Pakistan, which has escalated as a result of a recent Islamist terror attack in Kashmir.\nTrump commented on the situation hours after India said its armed forces conducted…",
    "link": "https://biztoc.com/x/fff231fddc5a4139",
    "timestamp": "2025-05-07T20:50:02Z"
  },
  {
    "title": "Trump on Iran: We can blow them up 'nicely or viciously'",
    "description": "United States President Donald Trump told Hugh Hewitt in an interview posted on Wednesday that there are only two options when it comes to the Iran issue. \"We can blow them up nicely or we can blow th...",
    "link": "https://biztoc.com/x/2db0bb10cbc4a245",
    "timestamp": "2025-05-07T20:50:02Z"
  },
  {
    "title": "Trump's 'big announcement' said to be drug price plan",
    "description": "US President Donald Trump is planning to announce a new effort to reduce drug costs by linking the prices that the government pays for certain medications to lower prices available abroad, Politico re...",
    "link": "https://biztoc.com/x/e0ae89c39e5412b2",
    "timestamp": "2025-05-07T20:49:47Z"
  },
  {
    "title": "Trump just declared Thursday, May 8 as ‘Victory Day’ - what this means",
    "description": "The Republican president has complained the U.S. doesn't spend enough time celebrating its military victories like the rest of the world.",
    "link": "https://www.mlive.com/news/2025/05/trump-just-declared-thursday-may-8-as-victory-day-what-this-means.html",
    "timestamp": "2025-05-07T20:49:29Z"
  },
  {
    "title": "A photograph of a football game and golf gear: What Canada's gifts to Trump say about a 'relationship reset'",
    "description": "As Prime Minister Mark Carney left his meeting with U.S. President Donald Trump, officials left behind gifts seen as fit for a president with whom Canada is trying to forge better relations.",
    "link": "https://nationalpost.com/news/politics/what-canadas-gifts-to-trump-say-about-a-relationship-reset",
    "timestamp": "2025-05-07T20:49:04Z"
  },
  {
    "title": "UK Royal Coronation Portraits of King Charles III and Queen Camilla Unveiled",
    "description": "The pair were painted by longtime royal collaborators Peter Kuhfeld and Paul Benney, respectively, to commemorate the 2023 coronation.",
    "link": "https://www.artnews.com/art-news/news/britain-royal-coronation-portraits-charles-iii-camilla-1234741047/",
    "timestamp": "2025-05-07T20:49:03Z"
  },
  {
    "title": "UK Royal Coronation Portraits of King Charles III and Queen Camila Unveiled",
    "description": "The pair were painted by longtime royal collaborators Peter Kuhfeld and Paul Benney, respectively, to commemorate the 2023 coronation.",
    "link": "https://www.artnews.com/art-news/news/britain-royal-coronation-portraits-charles-iii-camila-1234741047/",
    "timestamp": "2025-05-07T20:49:03Z"
  },
  {
    "title": "Protesters gather outside Pritzker mansion to disrupt Noem presser, only to find she was never actually there",
    "description": "DHS told Fox that protesters mistakenly thought that Noem's presser would be at JB Pritzker's governor mansion, and wound up 'screaming' in to the wind.",
    "link": "https://www.foxnews.com/politics/protesters-gather-outside-pritzker-mansion-disrupt-noem-presser-only-find-she-never-actually",
    "timestamp": "2025-05-07T20:47:05Z"
  },
  {
    "title": "Trump Crypto Advisor David Bailey In Talks to Launch Bitcoin Investment Company: The Information",
    "description": "Bailey, who advised President Donald Trump on crypto policy during his 2024 presidential campaign, is reportedly raising $300 million to buy bitcoin.",
    "link": "https://www.coindesk.com/markets/2025/05/07/trump-crypto-advisor-david-bailey-in-talks-to-launch-bitcoin-investment-company-the-information",
    "timestamp": "2025-05-07T20:46:54Z"
  },
  {
    "title": "Fed Warns Trump Tariffs May Increase Inflation, Unemployment",
    "description": "Federal Reserve Chair Jerome Powell warned that Trump’s tariff regime could lead to increased inflation and unemployment, and an economic slowdown.",
    "link": "http://www.rollingstone.com/politics/politics-news/jerome-powell-warns-trump-tariffs-inflation-1235333944/",
    "timestamp": "2025-05-07T20:46:18Z"
  },
  {
    "title": "J.B. Pritzker Is Showing Democrats How To Stand Up to Trump | Opinion",
    "description": "While it's far too early for Democrats to coalesce around a 2028 contender, one thing is clear: the party's base wants a rabble-rousing, populist fighter willing to tangle with Trump.",
    "link": "https://www.newsweek.com/jb-pritzker-showing-democrats-how-stand-trump-opinion-2068770",
    "timestamp": "2025-05-07T20:44:04Z"
  },
  {
    "title": "NORTH AMERICAN UNION??? Why Is It a Good Idea NOW?",
    "description": "President Trump hosted Canadian Prime Minister Mark Carney at the White House this week, and again floated his idea to make Canada “the 51st state,” to which Carney replied, “There are some places that are never for sale.” Trump’s reply to that was, “Time wil…",
    "link": "https://freerepublic.com/focus/f-bloggers/4315603/posts",
    "timestamp": "2025-05-07T20:41:35Z"
  },
  {
    "title": "Trump May Have Already Redrawn the Senate Map",
    "description": "The 2026 races in Texas, Georgia, North Carolina and New Hampshire all look dicier for Republicans now—and they have Trump to thank.",
    "link": "https://time.com/7283660/trump-redraws-senate-map/",
    "timestamp": "2025-05-07T20:40:43Z"
  },
  {
    "title": "A DACA recipient had permission to leave the country but was deported when he returned",
    "description": "Evenezer Cortez Martínez  managed to return home to Missouri after two weeks in Mexico but said the experience was traumatic: \"I thought I had lost everything.\"",
    "link": "https://www.nbcnews.com/news/latino/daca-recipient-deported-to-mexico-rcna203557",
    "timestamp": "2025-05-07T20:40:15Z"
  },
  {
    "title": "Exclusive—Thune on Trump’s ‘Staggering Success’ at Border: ‘Mind-Blowing’",
    "description": "WASHINGTON — Senate Majority Leader John Thune told Breitbart News exclusively last week that President Donald Trump’s successes at the U.S. border with Mexico have already been “staggering” and “mind-blowing.”\nThe post Exclusive—Thune on Trump’s ‘Staggering …",
    "link": "https://www.breitbart.com/politics/2025/05/07/exclusive-thune-on-trumps-staggering-success-at-border-mind-blowing/",
    "timestamp": "2025-05-07T20:39:21Z"
  },
  {
    "title": "Michael McDowell ‘a man with a fearsome devotion’ to Ireland, says ex-president Mary McAleese",
    "description": "Tribute paid to former minister for justice and attorney general on launch of The Definite Article – a collection of his Irish Times columns",
    "link": "https://www.irishtimes.com/politics/2025/05/07/michael-mcdowell-a-man-with-a-fearsome-devotion-to-ireland-says-ex-president-mary-mcaleese/",
    "timestamp": "2025-05-07T20:38:28Z"
  },
  {
    "title": "GOP Reps Reportedly Urged Speaker To Keep Taxpayer Funding For Nation’s Biggest Abortionists",
    "description": "Several House Republicans are reportedly opposing efforts to defund Planned Parenthood in President Donald Trump's \"one big, beautiful bill.\"",
    "link": "https://dailycaller.com/2025/05/07/gop-reps-keep-taxpayer-funding-planned-parenthood/",
    "timestamp": "2025-05-07T20:38:16Z"
  },
  {
    "title": "NASA Statement on Nomination of Matt Anderson for Deputy Administrator",
    "description": "Acting NASA Administrator Janet Petro issued the following statement regarding the nomination by President Donald Trump of Matt Anderson Wednesday to serve as the agency’s deputy administrator: “As a retired United States Air Force colonel and executive of th…",
    "link": "https://www.nasa.gov/news-release/nasa-statement-on-nomination-of-matt-anderson-for-deputy-administrator/",
    "timestamp": "2025-05-07T20:37:59Z"
  },
  {
    "title": "Congressman Torres proposes bill to ban federal officials from trading or owning crypto",
    "description": "Representative Ritchie Torres is reportedly preparing to introduce legislation prohibiting federal officials from owning or trading crypto while in office.  The measure seeks to close potential conflicts of interest and expand existing financial ethics rules …",
    "link": "https://cryptoslate.com/congressman-torres-proposes-bill-to-ban-federal-officials-from-trading-or-owning-crypto/",
    "timestamp": "2025-05-07T20:37:02Z"
  },
  {
    "title": "트럼프, 물가 상승률 전망치 높이고 경제성장률 전망치 낮췄다",
    "description": "Fed Meeting Today: Rate Cuts, Powell Speech, Live News & Analysis https://t.co/iiVplTWeR3— Bloomberg (@business) May 7, 2025 Federal Reserve officials held interest rates steady for a third-straight meeting and emphasized they see a growing risk of both highe…",
    "link": "https://ryueyes11.tistory.com/511614",
    "timestamp": "2025-05-07T20:36:49Z"
  },
  {
    "title": "Media Spins Report on How Venezuela Facilitated Violent Gang’s Invasion of US",
    "description": "The Venezuelan government was facilitating the illegal immigration of dangerous gang members into the United States according to multiple intelligence reports and the legacy media... Read More\nThe post Media Spins Report on How Venezuela Facilitated Violent G…",
    "link": "https://www.dailysignal.com/2025/05/07/media-spins-report-on-how-venezuela-facilitated-violent-gangs-invasion-of-us/",
    "timestamp": "2025-05-07T20:35:22Z"
  },
  {
    "title": "White House withdraws nomination of Fox News contributor for US surgeon general",
    "description": "President Donald Trump is tapping Dr. Casey Means, a wellness influencer with close ties to Health and Human Services Secretary Robert F.",
    "link": "https://www.local10.com/news/politics/2025/05/07/white-house-withdraws-nomination-of-fox-news-contributor-for-us-surgeon-general/",
    "timestamp": "2025-05-07T20:35:16Z"
  },
  {
    "title": "What to know about the newly opened immigration detention center in New Jersey’s biggest city",
    "description": "Delaney Hall, a 1,000-bed facility along an industrial stretch of Newark Bay, opened May 1.",
    "link": "https://www.bostonherald.com/2025/05/07/immigration-detention-center-new-jersey/",
    "timestamp": "2025-05-07T20:34:51Z"
  },
  {
    "title": "Trump officials hype the World Cup with anti-immigration warning",
    "description": "With the FIFA World Cup drawing closer, Trump officials on Tuesday touted the United States’ role as a host country — but not without issuing warnings to visitors in line with the administration’s anti-immigration agenda.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-world-cup-anti-immigration-warning-tourists-rcna205410",
    "timestamp": "2025-05-07T20:30:59Z"
  },
  {
    "title": "Disney parks thrive in 2nd quarter, adds 1.4 million new streaming subscribers",
    "description": "Disney posted solid profits and revenue in the second quarter as its domestic theme parks thrived and the company added well over a million subscribers to its streaming service.",
    "link": "https://www.denver7.com/money/business-news/disney-parks-thrive-in-second-quarter-and-it-adds-1-4-million-new-streaming-subscribers",
    "timestamp": "2025-05-07T20:30:32Z"
  },
  {
    "title": "Blue state governor in hot seat after parents harmed by sanctuary policies lash out: 'Gut punch'",
    "description": "Jim Walden's family is among those who have lost loved ones to crimes committed by people in the country illegally, and he took aim at sanctuary policies in Illinois.",
    "link": "https://www.foxnews.com/politics/blue-state-governor-hot-seat-after-parents-harmed-sanctuary-policies-lash-out-gut-punch",
    "timestamp": "2025-05-07T20:30:15Z"
  },
  {
    "title": "Trump offers to 'help' relieve conflict between India and Pakistan",
    "description": "President Trump called the tension between India and Pakistan on the heels of the massacre in Kashmir \"terrible.\"",
    "link": "https://www.cnbc.com/2025/05/07/trump-india-pakistan-kashmir.html",
    "timestamp": "2025-05-07T20:30:06Z"
  },
  {
    "title": "AMC Theatres Hit With Lower Q1 Revenues Amid Box Office Slowdown",
    "description": "Fewer Hollywood tentpole releases hampered the mega-exhibitor during the latest financial quarter.",
    "link": "http://www.hollywoodreporter.com/business/business-news/amc-theatres-q1-revenues-2025-1236210083/",
    "timestamp": "2025-05-07T20:30:05Z"
  },
  {
    "title": "L.A. County Sets Controversial June Deadlines for Debris Removal",
    "description": "Some residents and contractors feel that a well-intentioned ordinance may actually slow debris removal rather than accelerating it.\nThe post L.A. County Sets Controversial June Deadlines for Debris Removal appeared first on Breitbart.",
    "link": "https://www.breitbart.com/local/2025/05/07/l-a-county-sets-controversial-june-deadlines-for-debris-removal/",
    "timestamp": "2025-05-07T20:30:02Z"
  },
  {
    "title": "America needs to 'reform, not retreat' in global assistance programs, says foreign policy org",
    "description": "USGLC releases 10 recommendations for the Trump administration to reform, not cut, international assistance programs all with the goal of making America \"stronger, safer and more prosperous.\"",
    "link": "https://www.foxnews.com/us/america-needs-reform-not-retreat-global-assistance-programs-says-foreign-policy-org",
    "timestamp": "2025-05-07T20:29:52Z"
  },
  {
    "title": "Trump Boxes In Mike Lawler",
    "description": "Rep. Mike Lawler (R-NY) has openly floated a run for New York governor in 2026, but Donald Trump may have just shut that door. Despite Lawler’s insistence that he won’t be swayed by party politics,",
    "link": "https://politicalwire.com/2025/05/07/trump-boxes-in-lawler/",
    "timestamp": "2025-05-07T20:29:16Z"
  },
  {
    "title": "India Has a Long-Term Plan With Pakistan",
    "description": "New Delhi aims to root out cross-border terrorism, but it risks fueling discontent.",
    "link": "http://foreignpolicy.com/2025/05/07/india-pakistan-strike-counterterrorism-long-term/",
    "timestamp": "2025-05-07T20:27:22Z"
  },
  {
    "title": "Trump Got So Greedy He Might Mess Up Crypto’s Plan in Congress",
    "description": "Trump’s $2 billion deal in Dubai last week could ruin the investment that cryptocurrency giants poured into his administration to get friendly legislation.",
    "link": "http://nymag.com/intelligencer/article/trump-got-so-greedy-he-might-botch-cryptos-plan-in-congress.html",
    "timestamp": "2025-05-07T20:26:40Z"
  },
  {
    "title": "President Donald Trump planning to create college sports commission | Report",
    "description": "President Donald Trump is planning to create a college sports commission to examine issues in the industry, per a report from Yahoo Sports.",
    "link": "https://www.usatoday.com/story/sports/ncaaf/2025/05/07/donald-trump-college-sports-commission-nick-saban/83499185007/",
    "timestamp": "2025-05-07T20:26:36Z"
  },
  {
    "title": "US central bank: Trump tariffs causing ‘great deal of uncertainty’",
    "description": "US Federal Reserve Chair Jerome Powell said that Donald Trump’s tariffs are creating “a great deal of uncertainty.”",
    "link": "https://www.aljazeera.com/program/newsfeed/2025/5/7/us-central-bank-trump-tariffs-causing-great-deal-of",
    "timestamp": "2025-05-07T20:26:13Z"
  },
  {
    "title": "The establishment strikes back",
    "description": "Reports of the GOP establishment’s death have been somewhat exaggerated. In his second term, President Donald Trump has filled his administration with many hard-line ideologues, personal loyalists, and more recent converts to his cause — spurring many to conc…",
    "link": "https://www.vox.com/trump-administration/411936/trump-gop-establishment-rubio-bessent-tariffs-ukraine",
    "timestamp": "2025-05-07T20:26:12Z"
  },
  {
    "title": "Data from autistic people on Medicare, Medicaid will used for research: RFK Jr.",
    "description": "“We’re using this partnership to uncover the root causes of autism and other chronic diseases,” Kennedy said. Experts aren't as optimistic.",
    "link": "https://www.pennlive.com/health/2025/05/data-from-autistic-people-on-medicare-medicaid-will-used-for-research-rfk-jr.html",
    "timestamp": "2025-05-07T20:26:09Z"
  },
  {
    "title": "Exclusive--Rep. Hageman Introduces 'No Student Visas for Sanctuary Cities Act'",
    "description": "A new bill aimed at holding sanctuary cities \"accountable\" has been introduced by Rep. Harriet Hageman (R-WY), with Breitbart News obtaining exclusive access to the proposed legislation as well as the congresswoman's letter to President Donald Trump pledging …",
    "link": "https://www.breitbart.com/immigration/2025/05/07/exclusive-rep-hageman-introduces-no-student-visas-for-sanctuary-cities-act/",
    "timestamp": "2025-05-07T20:24:56Z"
  },
  {
    "title": "With Fentanyl Trade Targeted by Trump, Cartels Move to Oil Smuggling",
    "description": "American businesses are profiting from stolen Mexican oil, then funneling funds back to Mexico, the Treasury said.",
    "link": "https://www.newsweek.com/cartels-us-companies-mexico-border-fuel-smuggling-2069268",
    "timestamp": "2025-05-07T20:22:14Z"
  },
  {
    "title": "Industry leaders stress need for National Quantum Reauthorization Act passage",
    "description": "Major tech players hoping to scale their quantum technologies for the commercial market told Congress that the NQI Reauthorization Act is “critical” to these efforts, citing its promotion of partnerships and agency funding.",
    "link": "https://www.nextgov.com/emerging-tech/2025/05/industry-leaders-stress-need-national-quantum-reauthorization-act-passage/405141/",
    "timestamp": "2025-05-07T20:22:00Z"
  },
  {
    "title": "US Health department will analyze data from autistic Medicare, Medicaid enrollees, RFK Jr. says",
    "description": "His research directive comes as autism rates in the U.S. are rising.",
    "link": "https://www.bostonherald.com/2025/05/07/medicare-medicaid-autism/",
    "timestamp": "2025-05-07T20:20:41Z"
  },
  {
    "title": "US Health department will analyze data from autistic Medicare, Medicaid enrollees, RFK Jr. says",
    "description": "His research directive comes as autism rates in the U.S. are rising.",
    "link": "https://www.denverpost.com/2025/05/07/medicare-medicaid-autism/",
    "timestamp": "2025-05-07T20:20:41Z"
  },
  {
    "title": "Trump Stokes a Vance-Rubio Competition",
    "description": "\"President Donald Trump gave JD Vance and Marco Rubio huge portfolios and has openly named both as his potential successors — putting two unlikely friends on a collision course for the GOP nomination in 2028,\"",
    "link": "https://politicalwire.com/2025/05/07/trump-stokes-a-vance-rubio-competition/",
    "timestamp": "2025-05-07T20:20:33Z"
  },
  {
    "title": "America Needs More Judges Like Judge Myers",
    "description": "He did the right thing in North Carolina’s Supreme Court fight, and he deserves praise.",
    "link": "https://www.theatlantic.com/politics/archive/2025/05/north-carolina-supreme-court/682731/",
    "timestamp": "2025-05-07T20:20:32Z"
  },
  {
    "title": "Federal Reserve Rings Every Alarm Bell About Trump’s Economy",
    "description": "Jerome Powell has once again said what everyone except Trump seems to already know: Lowering inflation while enacting staggering tariffs is virtually impossible. \r\n“If the large increases in tariffs that have been announced are sustained, they’re likely to ge…",
    "link": "https://newrepublic.com/post/194985/federal-reserve-powell-trump-economy-tariffs-stagflation",
    "timestamp": "2025-05-07T20:20:02Z"
  },
  {
    "title": "Trump Gives Stunning Answer When Asked About Deportations to Libya",
    "description": "Donald Trump says he doesn’t know whether he plans to deport hundreds of immigrants to Libya, amidst reports that his administration will do so as soon as Wednesday. \r\n“Is the administration sending migrants to Libya?” Trump was asked during a press conferenc…",
    "link": "https://newrepublic.com/post/194980/trump-answer-deportations-libya",
    "timestamp": "2025-05-07T20:19:46Z"
  },
  {
    "title": "George W. Bush Snubs Melania Though She’s Honoring His Mom",
    "description": "Melania Trump is a world-class snubber. She skipped almost every event of Donald Trump’s 2024 campaign, only returning to regular political spouse duties late last year, as she had a memoir to plug and a lucrative documentary project to film. Despite suggesti…",
    "link": "https://freerepublic.com/focus/f-news/4315599/posts",
    "timestamp": "2025-05-07T20:19:17Z"
  },
  {
    "title": "Donald Trump Responded, \"Never Say Never,\" When Asked About America Buying Canada, So Canada's Prime Minister Said \"Never\" 5 Times",
    "description": "\"Do you wonder if Trump even believes himself?\"View Entire Post ›",
    "link": "https://www.buzzfeed.com/ashleyholt1/trump-meeting-with-canada-goes-viral",
    "timestamp": "2025-05-07T20:18:58Z"
  },
  {
    "title": "‘White With Fear’ Documentary Sets June On-Demand Release Date (EXCLUSIVE)",
    "description": "Director Andrew Goldberg’s political documentary “White With Fear,” featuring interviews with Hillary Clinton, Steve Bannon and more has set an on-demand release date of June 3, Variety can exclusively reveal. Providing rare first-person access to notable fig…",
    "link": "https://variety.com/2025/film/news/white-with-fear-documentary-hillary-clinton-june-release-1236390218/",
    "timestamp": "2025-05-07T20:18:38Z"
  },
  {
    "title": "The election director in North Carolina, a key swing state, is ousted after a Republican power play",
    "description": "The North Carolina elections board ousted its widely respected executive director Wednesday in a partisan move that will put Republicans in control of...",
    "link": "https://www.yahoo.com/news/election-director-north-carolina-key-201735382.html",
    "timestamp": "2025-05-07T20:17:35Z"
  },
  {
    "title": "How Trump is reshaping U.S.-Canada relations",
    "description": "President Donald Trump hosted Canadian Prime Minister Mark Carney at the White House Tuesday. The meeting comes at a time where relations between the two neighbors and allies are unusually icy.This episode: political correspondent Susan Davis, White House cor…",
    "link": "https://www.npr.org/2025/05/07/1249592920/trump-carney-us-canada-politics-podcast",
    "timestamp": "2025-05-07T20:16:50Z"
  },
  {
    "title": "Vance Warns World Cup Fans Must Not Overstay US Visit",
    "description": "US Vice President JD Vance appeared with President Donald Trump and other top administration officials on Tuesday at a White House event trumpeting the U.S. co-hosting the 2026 World Cup. More than two million visitors are expected in the United States for th…",
    "link": "https://biztoc.com/x/e1f08c5e96be9a2a",
    "timestamp": "2025-05-07T20:16:16Z"
  },
  {
    "title": "Binance founder “CZ” seeks pardon from President Trump after four month stint in prison",
    "description": "Changpeng Zhao, founder and former CEO of crypto exchange Binance, is hoping to get a pardon from President Donald Trump after being released from prison late last year. Zhao, better known by his initials “CZ,” formally applied for a pardon from the Trump adm…",
    "link": "https://biztoc.com/x/123d8d59246b6758",
    "timestamp": "2025-05-07T20:16:15Z"
  },
  {
    "title": "3 Doors Down singer Brad Arnold announces cancer diagnosis as band cancels tour",
    "description": "The singer has stage 4 kidney cancer that has spread to his lungs",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/3-doors-down-brad-arnold-cancer-tour-b2746729.html",
    "timestamp": "2025-05-07T20:16:14Z"
  },
  {
    "title": "Libya Throws Huge, Dangerous Wrench in Trump’s Mass Deportation Plan",
    "description": "President Donald Trump is planning to send a planeful of deportees to Libya—but both of Libya’s governments say they won’t take them, The Washington Post reported Wednesday. \r\nAbdul Hamid Dbeibeh, the prime minister for the Government of National Unity based …",
    "link": "https://newrepublic.com/post/194982/donald-trump-mass-deportation-plan-libya-throws-wrench-trump",
    "timestamp": "2025-05-07T20:15:05Z"
  },
  {
    "title": "House GOP backs off some Medicaid cuts as report shows millions would lose health care",
    "description": "House Republicans are scrounging to come up with as much as $1.5 trillion in cuts across federal government health, food stamp and other programs.",
    "link": "https://13wham.com/news/nation-world/house-gop-backs-off-some-medicaid-cuts-as-report-shows-millions-would-lose-health-care",
    "timestamp": "2025-05-07T20:14:47Z"
  },
  {
    "title": "States sue over Trump blocking billions of dollars for electric vehicle charging",
    "description": "More than a dozen states are suing the Trump administration for withholding funds from for the buildout of electric vehicle chargers across the U.S. The federal lawsuit says $5 billion allocated to states under the Bipartisan Infrastructure Law signed ...",
    "link": "https://abcnews.go.com/Technology/wireStory/states-sue-trump-blocking-billions-dollars-electric-vehicle-121574446",
    "timestamp": "2025-05-07T20:14:45Z"
  },
  {
    "title": "3G Capital Unfazed By Trade War With China In $9 Billion Skechers Deal",
    "description": "For 3G Capital, which has made more than $20 billion on Burger King, Trump’s tariffs presented a rare opportunity to spear a big fish at a discount price.",
    "link": "https://www.forbes.com/sites/hanktucker/2025/05/07/3g-capital-unfazed-by-trade-war-with-china-in-9-billion-skechers-deal/",
    "timestamp": "2025-05-07T20:14:19Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.kotatv.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T20:14:18Z"
  },
  {
    "title": "This man was killed four years ago. His AI clone just spoke in court.",
    "description": "AI continues to trickle into courtrooms, from 'hallucinated' court cases to deepfaked videos.\nThe post This man was killed four years ago. His AI clone just spoke in court. appeared first on Popular Science.",
    "link": "https://www.popsci.com/technology/ai-in-courtrooms/",
    "timestamp": "2025-05-07T20:14:12Z"
  },
  {
    "title": "Steve Madden Has Moved Nearly All Fall ’25 Shoe Production for Its Core Brands Out of China Amid Trump Tariff War",
    "description": "Steve Madden CEO Edward Rosenfeld talks tariffs, price increases, sourcing—\"we have taken components from China\" and moved elsewhere—and Kurt Geiger.",
    "link": "http://footwearnews.com/business/earnings/steve-madden-edward-rosenfeld-tariffs-china-prices-geiger-1234806820/",
    "timestamp": "2025-05-07T20:11:33Z"
  },
  {
    "title": "Man swept up by ICE agents in Framingham, his girlfriend says",
    "description": "Federal immigration officers detained a man at a Massachusetts gas station this week, even though his girlfriend believes they were looking for someone else.",
    "link": "https://www.wcvb.com/article/framingham-ice-gas-station-orellana-detained/64704236",
    "timestamp": "2025-05-07T20:11:27Z"
  },
  {
    "title": "States sue over Trump blocking billions of dollars for electric vehicle charging",
    "description": "SACRAMENTO, Calif. (AP) — Seventeen states are suing President Donald Trump ‘s administration for withholding billions of dollars in funding for the buildout of electric vehicle chargers, according to a federal lawsuit announced Wednesday. The move comes afte…",
    "link": "https://financialpost.com/pmn/states-sue-over-trump-blocking-billions-of-dollars-for-electric-vehicle-charging",
    "timestamp": "2025-05-07T20:10:49Z"
  },
  {
    "title": "Denmark summons US ambassador over Greenland spying report",
    "description": "US spy agencies have been told to step up espionage around Greenland, according to The Wall Street Journal.",
    "link": "https://www.bbc.com/news/articles/c0eley5gy8wo",
    "timestamp": "2025-05-07T20:10:41Z"
  },
  {
    "title": "Tariffs Cause Homeowners To See $100 Plus Increase to Premiums This Year",
    "description": "The tariffs have contributed to increased prices for both raw materials and finished goods.",
    "link": "https://www.newsweek.com/tariffs-cause-homeowners-see-100-plus-increase-premiums-this-year-2069270",
    "timestamp": "2025-05-07T20:10:26Z"
  },
  {
    "title": "Trump digs in on high China tariffs ahead of trade talks (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nTrump digs in on high China tariffs ahead of trade talks … President Donald Trump said Wednesday he would not consider lowering the United States' 145% tariffs on China in order to spur trade-war negotiations with Beijing.  —  Trump f…",
    "link": "https://www.memeorandum.com/250507/p105",
    "timestamp": "2025-05-07T20:10:01Z"
  },
  {
    "title": "Joe Biden's wife Jill Biden assumes another role with new job offer",
    "description": "Jill Biden served as the First Lady of the US till January 2025, until Joe Biden remained the President of the country. She has now taken up a new job to work on women’s issues. She has earlier led the White House Initiative on Women’s Health Research after h…",
    "link": "https://economictimes.indiatimes.com/news/international/us/joe-bidens-wife-jill-biden-assumes-another-role-with-new-job-offer/articleshow/120975354.cms",
    "timestamp": "2025-05-07T20:09:41Z"
  },
  {
    "title": "Trump likely to pull surgeon general pick following Laura Loomer complaints: Sources",
    "description": "The White House is expected to pull its nomination of Dr. Janette Nesheiwat as U.S. surgeon general, sources told ABC News.",
    "link": "https://abcnews.go.com/Politics/trump-expected-pull-surgeon-general-pick-laura-loomer/story?id=121572970",
    "timestamp": "2025-05-07T20:09:38Z"
  },
  {
    "title": "Fed keeps interest rates unchanged despite Donald Trump pressure",
    "description": "The Federal Reserve said Trump's barrage of tariffs were generating too much uncertainty to predict its next moves.",
    "link": "https://www.bbc.co.uk/news/articles/cglxldgx0l5o",
    "timestamp": "2025-05-07T20:09:22Z"
  },
  {
    "title": "“People Feel Like They Are Friends With Us”: How ‘The Bulwark’ Is Thriving in a New Trump Era",
    "description": "The Never Trumpers on Substack are nearing 1 million subscriptions while beefing up original reporting and churning out YouTube clips. Business is good, but Tim Miller says he’d “gladly not be hitting this milestone” if it meant covering a Kamala Harris presi…",
    "link": "https://www.vanityfair.com/news/story/the-bulwark-is-thriving-in-trump-era",
    "timestamp": "2025-05-07T20:08:59Z"
  },
  {
    "title": "Federal judge rules Georgetown scholar’s wrongful arrest case will stay in Virginia",
    "description": "Khan Suri came from India to the U.S. in 2022 on a J-1 visa.",
    "link": "https://www.bostonherald.com/2025/05/07/georgetown-scholar-detained-virginia/",
    "timestamp": "2025-05-07T20:08:07Z"
  },
  {
    "title": "Will Trump Cancel Tariffs On Baby Products? Bessent Suggests It’s ‘Under Consideration’—But President Isn’t So Sure",
    "description": "Trump said he would “take a look at” exemptions for products parents need for their children, which are primarily produced in China.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/05/07/will-trump-cancel-tariffs-on-baby-products-bessent-suggests-its-under-consideration-but-president-isnt-so-sure/",
    "timestamp": "2025-05-07T20:07:55Z"
  },
  {
    "title": "Pakistan Says 31 Killed After India Launches Airstrikes (Live Updates)",
    "description": "India claimed its military strikes in Pakistan and the contested regions of Jammu and Kashmir targeted “terrorist infrastructure.”",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/07/pakistan-says-31-killed-after-india-launches-airstrikes-live-updates/",
    "timestamp": "2025-05-07T20:07:24Z"
  },
  {
    "title": "‘Utu’ as foreign policy: how a Māori worldview can make sense of a shifting world order",
    "description": "Utu is commonly misunderstood to mean violent revenge, but it really describes reciprocity, harmony and balance – ideas central to New Zealand’s international relations.",
    "link": "https://theconversation.com/utu-as-foreign-policy-how-a-maori-worldview-can-make-sense-of-a-shifting-world-order-255602",
    "timestamp": "2025-05-07T20:06:21Z"
  },
  {
    "title": "Judge Boasberg to preside over new Alien Enemies Act lawsuit, teeing up high stakes court fight with Trump",
    "description": "Judge Boasberg is set to hear another high-profile challenge to the Alien Enemies Act deportations this evening – a case likely to reignite tensions with Trump officials.",
    "link": "https://www.foxnews.com/politics/judge-boasberg-preside-new-alien-enemies-act-case-teeing-up-high-stakes-court-fight-trump",
    "timestamp": "2025-05-07T20:06:18Z"
  },
  {
    "title": "Trump won't drop tariffs; they are his only weapon: Mark Warner",
    "description": "Mark Warner, principal council and trade expert at MAAW Law, talks with Financial Post’s Larysa Harapyn about what came out of the meeting between \n \n \n \n \n \n Donald Trump\n \n \n \n \n \n and \n \n \n \n \n \n Mark Carney\n \n \n \n \n \n . Warner discussed what to expect in …",
    "link": "https://biztoc.com/x/1381a764fb75f9c8",
    "timestamp": "2025-05-07T20:05:32Z"
  },
  {
    "title": "Fed holds interest rates despite Trump pressure",
    "description": "Fed holds interest rates despite Trump pressure\nThe US central bank has left interest rates unchanged again, despite pressure from President Donald Trump to lower borrowing costs.\nThe decision keeps the Federal Reserve's influential lending rate hovering arou…",
    "link": "https://biztoc.com/x/85c013a3b6a2d992",
    "timestamp": "2025-05-07T20:05:15Z"
  },
  {
    "title": "Republicans are in denial. Trump isn’t bluffing on his trade war.",
    "description": "Chris Hayes says there are no signs Trump plans to back down from his trade war, despite what Republicans and Wall Street may want to believe.",
    "link": "https://www.msnbc.com/top-stories/latest/republican-denial-trump-tariff-economy-rcna205391",
    "timestamp": "2025-05-07T20:03:46Z"
  },
  {
    "title": "Trump administration will rescind Biden-era AI chip export curbs, Commerce Department says",
    "description": "U.S. President Donald Trump's administration plans to rescind Biden-era curbs on the export of advanced AI chips, a spokesperson for the U.S. Department of Commerce said on Wednesday. The Biden AI rule is \"overly complex, overly bureacratic,\" and will be repl…",
    "link": "https://www.channelnewsasia.com/business/trump-administration-will-rescind-biden-era-ai-chip-export-curbs-commerce-department-says-5115691",
    "timestamp": "2025-05-07T20:02:51Z"
  },
  {
    "title": "20 attorneys general ask federal judge to reverse deep cuts to US Health and Human Services",
    "description": "Attorneys general in 19 states and Washington, D.C., are challenging cuts to the U.S. Health and Human Services agency.",
    "link": "https://www.hawaiinewsnow.com/2025/05/07/20-attorneys-general-ask-federal-judge-reverse-deep-cuts-us-health-human-services/",
    "timestamp": "2025-05-07T20:02:42Z"
  },
  {
    "title": "Trump's ambassador to China sworn in ahead of high-stakes talks in Switzerland",
    "description": "Former Sen. David Perdue assumes his posting ahead of a weekend of talks aimed at de-escalating tensions between Washington and Beijing.",
    "link": "https://www.cnbc.com/2025/05/07/trump-china-trade-david-perdue.html",
    "timestamp": "2025-05-07T20:02:24Z"
  },
  {
    "title": "Amtrak to Cut 20% of Top-Level Staff Amid Trump Uncertainty",
    "description": "Amtrak is cutting roughly 20% of its top-level management staff in an effort to reduce costs amid uncertainty about President Donald Trump’s plans to invest in infrastructure, according to people familiar with the matter.",
    "link": "https://www.livemint.com/companies/news/amtrak-to-cut-20-of-top-level-staff-amid-trump-uncertainty-11746648141565.html",
    "timestamp": "2025-05-07T20:02:21Z"
  },
  {
    "title": "White House stokes Vance-Rubio competition...",
    "description": "White House stokes Vance-Rubio competition...\r\n\n \n \n \n (First column, 1st story, link)\r\n\n \r\n\n \r\n\n \n Related stories:Rivals, buddies, or future running mates?",
    "link": "https://www.semafor.com/article/05/07/2025/rivals-buddies-or-future-running-mates-trump-stokes-a-vance-rubio-competition",
    "timestamp": "2025-05-07T20:01:37Z"
  },
  {
    "title": "Oil Drops on Powell Rate Comments",
    "description": "Oil prices fell after Fed Chair Powell signaled no rush to cut rates.",
    "link": "https://www.rigzone.com/news/wire/oil_drops_on_powell_rate_comments-07-may-2025-180463-article/",
    "timestamp": "2025-05-07T20:01:00Z"
  },
  {
    "title": "Bernie Sanders, Dem senators urge CBS parent not to settle Trump’s ‘bogus’ lawsuit over ’60 Minutes’ edit",
    "description": "Bernie Sanders and other lawmakers urged Paramount Global controlling shareholder Shari Redstone not to settle President Trump’s “bogus lawsuit.\"",
    "link": "https://www.foxnews.com/media/bernie-sanders-dem-senators-urge-cbs-parent-not-settle-trumps-bogus-lawsuit-over-60-minutes-edit",
    "timestamp": "2025-05-07T20:00:29Z"
  },
  {
    "title": "These Ford models to get expensive in US: Check car prices amid Trump tariffs tensions",
    "description": "In a notice sent to dealers, Ford has informed that the prices for some of its models are being increased by up to $2,000. A spokesperson said the latest increase in prices was due to \"usual\" mid-year pricing actions along with the tariffs that the company fa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/these-ford-models-to-get-expensive-in-us-check-car-prices-amid-trump-tariffs-tensions/articleshow/120975307.cms",
    "timestamp": "2025-05-07T20:00:23Z"
  },
  {
    "title": "Undercover investigation: Planned Parenthood prescribing hormones to minors with minimal oversight",
    "description": "Phone calls released today by pro-life activist group Live Action reveal that Planned Parenthood clinics in several states offer cross-sex hormonal treatments to minors as young as 16.",
    "link": "https://www.foxnews.com/politics/undercover-investigation-planned-parenthood-prescribing-hormones-minors-minimal-oversight",
    "timestamp": "2025-05-07T20:00:09Z"
  },
  {
    "title": "Three Ways China Is Fighting Trump's Tariff War",
    "description": "Chinese stocks were little changed after the central bank's policy moves, reflecting doubts about their ability to spur domestic demand.",
    "link": "https://www.newsweek.com/china-economy-policy-trump-us-tariffs-2069120",
    "timestamp": "2025-05-07T20:00:08Z"
  },
  {
    "title": "Israel all but admits it is pursuing ethnic cleansing in Gaza in its new plan",
    "description": "Israel has unveiled a new plan for escalating its domination of the Gaza Strip that all but openly declares an ethnic cleansing agenda in the enclave.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/israel-gaza-netanyahu-trump-ethnic-cleansing-rcna205069",
    "timestamp": "2025-05-07T19:55:32Z"
  },
  {
    "title": "Jewish Voices for Palestine and Free Speech Slam House GOP 'Kangaroo Hearing' on Antisemitism",
    "description": "Jewish students and academics for Palestinian rights and free speech on Wednesday condemned a congressional hearing in which House Republicans repeatedly conflated opposition to Zionism and Israeli crimes against Palestine with antisemitism, while Democratic …",
    "link": "https://www.commondreams.org/news/house-antisemitism-hearing",
    "timestamp": "2025-05-07T19:55:06Z"
  },
  {
    "title": "When Is Jerome Powell’s Term Up? Find Out When it Ends",
    "description": "Jerome Powell is currently the Chair of the Federal Reserve. Learn when his term ends and what limitations President Donald Trump would face in attempting to remove him.",
    "link": "https://hollywoodlife.com/2025/05/07/when-does-jerome-powell-term-end/",
    "timestamp": "2025-05-07T19:54:21Z"
  }
]