[
  {
    "title": "Vivek Ramaswamy Announces Ohio Gubernatorial Run",
    "description": "Vivek Ramaswamy, co-chair of the new Department of Government Efficiency (DOGE), announced his candidacy Friday for governor of Ohio.",
    "link": "https://dailycaller.com/2025/02/24/vivek-ramaswamy-ohio-governor-mike-dewine-jon-husted-senate-jd-vance-2026/",
    "timestamp": "2025-02-24T23:47:30Z"
  },
  {
    "title": "Firings Disrupt the Pentagon Status Quo",
    "description": "A series of Trump administration firings has shaken up the Pentagon status quo, drawing strong reactions from members of Congress. On Friday, President Donald Trump... Read More\nThe post Firings Disrupt the Pentagon Status Quo appeared first on The Daily Sign…",
    "link": "https://www.dailysignal.com/2025/02/24/firings-disrupt-pentagon-status-quo/",
    "timestamp": "2025-02-24T23:47:09Z"
  },
  {
    "title": "Trump Voter Tells CNN He Doesn’t Trust Elon Musk: ‘Can You Believe Any of That Crap?’",
    "description": "Voters across the country have expressed varying degrees of skepticism about the role GOP megadonor Elon Musk is playing in President Donald Trump’s administration. Musk, who leads the “Department of Government Efficiency,” has fired scores of federal employe…",
    "link": "https://www.mediaite.com/tv/trump-voter-tells-cnn-he-doesnt-trust-elon-musk-can-you-believe-any-of-that-crap/",
    "timestamp": "2025-02-24T23:46:51Z"
  },
  {
    "title": "Alec Baldwin's heated exchange with comedian over 'Rust' incident caught on video",
    "description": "Alec Baldwin found himself in a heated confrontation this week.  \n\nIn a video posted online, a comedian impersonating Donald Trump appears to be taunting him about the 2021 Rust sh",
    "link": "https://www.marca.com/en/lifestyle/celebrities/2025/02/25/67bd038f46163f335c8b45d6.html",
    "timestamp": "2025-02-24T23:46:19Z"
  },
  {
    "title": "MAGA Foreign Policy: The Iranian Regime",
    "description": "Editor’s note: This is a lightly edited transcript of today’s video from Daily Signal Senior Contributor Victor Davis Hanson. Subscribe to our YouTube channel to see... Read More\nThe post MAGA Foreign Policy: The Iranian Regime appeared first on The Daily Sig…",
    "link": "https://www.dailysignal.com/2025/02/24/maga-foreign-policy-the-iranian-regime/",
    "timestamp": "2025-02-24T23:46:05Z"
  },
  {
    "title": "US judge allows Trump's AP Oval Office ban to stand over Gulf of Mexico name",
    "description": "WASHINGTON: A US federal judge on Monday (Feb 24) denied a request by the Associated Press to restore full access for the news agency's journalists after President Donald Trump's White House barred them for continuing to refer to the",
    "link": "https://www.channelnewsasia.com/world/us-judge-allows-trumps-ap-oval-office-ban-stand-over-gulf-mexico-name-4957931",
    "timestamp": "2025-02-24T23:45:25Z"
  },
  {
    "title": "Elon Musk Gives 'Geeky, Patronizing' Reason Behind Email to Federal Staff As Uproar Grows Over his Productivity Demand: 'No Way This is Real World'",
    "description": "Elon Musk gave his reasoning behind sending out an e-mail to federal staff asking to provide five tasks they had completed last week – sparking outrage.",
    "link": "https://radaronline.com/p/elon-musk-email-federal-staff-pentagon-productivity-demand/",
    "timestamp": "2025-02-24T23:45:00Z"
  },
  {
    "title": "Deepfake of Donald Trump sucking Elon Musk’s toes broadcast on government building TV screens",
    "description": "Deepfake of Donald Trump sucking Elon Musk’s toes broadcast on government building TV screens7news.com.au",
    "link": "https://7news.com.au/news/deepfake-of-donald-trump-sucking-elon-musks-toes-broadcast-on-government-building-tv-screens-c-17840001",
    "timestamp": "2025-02-24T23:44:39Z"
  },
  {
    "title": "US Attorney's Office Post on Trump Sparks Backlash",
    "description": "Interim U.S. Attorney Ed Martin suggested that U.S. attorneys are \" President Trump's lawyers\" on Monday.",
    "link": "https://www.newsweek.com/us-attorney-ed-martin-post-trump-backlash-2035600",
    "timestamp": "2025-02-24T23:44:16Z"
  },
  {
    "title": "Deported Venezuelan says he's 'traumatized' by his time in Guantánamo",
    "description": "Kevin Rodríguez, now back in Venezuela, said the uncertainty of not knowing how long he would be in the U.S. military facility was what worried him the most.",
    "link": "https://www.nbcnews.com/news/latino/deported-venezuelan-guantanamo-conditions-traumatized-rcna193432",
    "timestamp": "2025-02-24T23:43:13Z"
  },
  {
    "title": "Exclusive: FDA Staffers Told That 'Woman,' 'Disabled' (+ 'Elderly') Among Banned Words; White House Says it’s an Error",
    "description": "Some U.S. Food and Drug Administration scientists have been told to stop using the words \"woman,\" \"disabled\" and \"elderly\" in external communications, two sources familiar with the matter said, part of a list of banned terms that a White House spokesman said …",
    "link": "https://freerepublic.com/focus/f-news/4300226/posts",
    "timestamp": "2025-02-24T23:43:07Z"
  },
  {
    "title": "Judge Blocks Trump Adminstartion’s ‘Unlawful and Harmful’ Immigration Raids at Houses of Worship",
    "description": "A federal judge issued an order Monday preventing President Donald Trump’s administration from carrying out immigration enforcement actions at places of worship. In a 59-page ruling, U.S. District Judge Theodore Chang agreed with a coalition of Sikhs, Quakers…",
    "link": "https://www.mediaite.com/news/judge-blocks-trump-adminstartions-unlawful-and-harmful-immigration-raids-at-houses-of-worship/",
    "timestamp": "2025-02-24T23:41:21Z"
  },
  {
    "title": "McConnell suggests Trump has ‘gross misunderstanding’ of Ukraine talks",
    "description": "Former Senate Republican Leader Mitch McConnell (R-Ky.) on Monday suggested President Trump’s refusal to blame Russia as the sole aggressor who provoked the war in Ukraine “reflects a gross misunderstanding of the nature of negotiations and leverage.” McConne…",
    "link": "https://freerepublic.com/focus/f-news/4300225/posts",
    "timestamp": "2025-02-24T23:40:44Z"
  },
  {
    "title": "Federal judge declines to temporarily restore AP’s full access to White House",
    "description": "A federal judge declined on Monday to temporarily restore the Associated Press’ access to some of President Donald Trump’s events, the Oval Office and Air Force One. US District Judge Trevor McFadden turned down a request from AP to temporarily lift a ban Tru…",
    "link": "https://freerepublic.com/focus/f-news/4300224/posts",
    "timestamp": "2025-02-24T23:39:12Z"
  },
  {
    "title": "Ukraine Truce Could Be Reached In \"Weeks\": Macron After Meeting With Trump",
    "description": "French President Emmanuel Macron on Monday said a truce in the war in Ukraine could be possible in the coming weeks.",
    "link": "https://www.ndtv.com/world-news/ukraine-truce-could-be-reached-in-weeks-emmanuel-macron-after-meeting-with-trump-7787729",
    "timestamp": "2025-02-24T23:37:39Z"
  },
  {
    "title": "US lawmakers rush to avoid March 14 government shutdown",
    "description": "U.S. lawmakers are one step closer to funding the government past a March 14 deadline, but Congress still has serious issues to resolve as they come back to work in the nation’s capital this week. \n\n\nAt question is how and when to enact a proposed extension o…",
    "link": "https://www.voanews.com/a/us-lawmakers-rush-to-avoid-march-14-government-shutdown-/7986622.html",
    "timestamp": "2025-02-24T23:35:25Z"
  },
  {
    "title": "US pressures Ukraine to nix its UN resolution demanding Russian forces withdraw",
    "description": "United Nations, Feb 24: The US has pressured Ukraine to withdraw its European-backed UN resolution demanding an immediate withdrawal of Russian forces from Ukraine in favour of an American proposal that does not mention Moscow’s invasion, a US official and a …",
    "link": "https://thehillstimes.in/international/us-pressures-ukraine-to-nix-its-un-resolution-demanding-russian-forces-withdraw",
    "timestamp": "2025-02-24T23:35:00Z"
  },
  {
    "title": "Jane Fonda just showed us how to respond to Donald Trump",
    "description": "Jane Fonda used her acceptance speech for the Life Achievement Award at the Screen Actors Guild awards show to rebuke President Donald Trump.",
    "link": "https://biztoc.com/x/a765658f20a4f8ba",
    "timestamp": "2025-02-24T23:34:36Z"
  },
  {
    "title": "Tariffs on Canada, Mexico start next month",
    "description": "WASHINGTON — President Donald Trump said Monday that his tariffs on Canada and Mexico are starting next month, ending a monthlong suspension on the planned import taxes that could potentially hurt economic growth and worsen inflation.\n“We’re on time with the …",
    "link": "https://biztoc.com/x/e187d1c3afaee444",
    "timestamp": "2025-02-24T23:34:28Z"
  },
  {
    "title": "Fashion Notes: Melania Trump is All Class in Dolce & Gabbana Tuxedo for Dinner in the East Room",
    "description": "First Lady Melania Trump chose her favorite designers to attend the National Governors Association Evening Dinner and Reception in the East Room of the White House this week.\nThe post Fashion Notes: Melania Trump is All Class in Dolce & Gabbana Tuxedo for Din…",
    "link": "https://www.breitbart.com/entertainment/2025/02/24/fashion-notes-melania-trump-is-all-class-in-dolce-gabbana-tuxedo-for-dinner-in-the-east-room/",
    "timestamp": "2025-02-24T23:34:28Z"
  },
  {
    "title": "Immigration enforcement at schools largely unchanged under Trump, feds argue in response to DPS lawsuit",
    "description": "The filing is the agency’s response to the lawsuit brought by Denver Public Schools on Feb. 12 that seeks to prevent U.S. Immigration and Customs Enforcement agents from making arrests at the district’s schools.",
    "link": "https://www.denverpost.com/2025/02/24/dps-sues-trump-homeland-secuirty-ice-raids-schools-policy/",
    "timestamp": "2025-02-24T23:31:59Z"
  },
  {
    "title": "Meltdown Over the FBI Dream Team",
    "description": "Barely recovered from the swearing-in last week of FBI Director Kash Patel, the media and Democrats were dealt another blow with the announcement of Dan Bongino as the bureau's number two. In an emotional appearance on his daily podcast today, Dan Bongino exp…",
    "link": "https://freerepublic.com/focus/f-news/4300221/posts",
    "timestamp": "2025-02-24T23:31:46Z"
  },
  {
    "title": "Bill Maher: Democrats Will ‘Lose Every Election’ if They Fight for Transing Children Against Parents' Wills",
    "description": "Bill Maher told Jon Lovett that Democrats will \"lose every election\" if they force the government between parents and their children on transgender issues.\nThe post Bill Maher: Democrats Will ‘Lose Every Election’ if They Fight for Transing Children Against P…",
    "link": "https://www.breitbart.com/entertainment/2025/02/24/bill-maher-democrats-will-lose-every-election-if-they-fight-for-transing-kids-against-parents-wills/",
    "timestamp": "2025-02-24T23:30:25Z"
  },
  {
    "title": "Tick Tock for TikTok",
    "description": "The platform TikTok has been an integral part of the social media world since its debut in 2016. After its parent company ByteDance’s merger with Musical.ly a year later, it became a sensation of 30-second dances to popular songs, internet challenges, “get re…",
    "link": "https://dailyutahchronicle.com/2025/02/24/tick-tock-for-tiktok/",
    "timestamp": "2025-02-24T23:30:02Z"
  },
  {
    "title": "White House says Eagles have not rejected Super Bowl celebration invite (Ben Johansen/Politico)",
    "description": "Ben Johansen / Politico:\nWhite House says Eagles have not rejected Super Bowl celebration invite  —  A White House official said reports that the Eagles have snubbed President Donald Trump are false.  —  A Philadelphia Eagles trip to the White House may still…",
    "link": "https://www.memeorandum.com/250224/p144",
    "timestamp": "2025-02-24T23:30:01Z"
  },
  {
    "title": "Trump administration putting USAID staffers on leave worldwide, firing at least 1,600",
    "description": "Washington, Feb 24: The Trump administration said Sunday that it was placing all but a fraction of staffers at the US Agency for International Development on leave worldwide and eliminating at least 1,600 US-based jobs. The move was the latest and one of the …",
    "link": "https://thehillstimes.in/international/trump-administration-putting-usaid-staffers-on-leave-worldwide-firing-at-least-1600",
    "timestamp": "2025-02-24T23:30:00Z"
  },
  {
    "title": "JPMorgan Chase CEO Jamie Dimon Backs DOGE’s Efforts",
    "description": "JPMorgan Chase CEO Jamie Dimon said that the federal government is inefficient and needs improvement, amid widespread layoffs across various departments under the Trump administration. In an interview on Monday (Feb. 24) with CNBC, Dimon “declined to give wha…",
    "link": "https://www.pymnts.com/politics/2025/jpmorgan-chase-ceo-jamie-dimon-backs-doges-efforts/",
    "timestamp": "2025-02-24T23:29:14Z"
  },
  {
    "title": "Tariffs on Canada, Mexico start next month",
    "description": "President Donald Trump said Monday that his tariffs on Canada and Mexico are starting next month, ending a monthlong suspension on the planned import taxes that could potentially hurt economic growth and worsen inflation.",
    "link": "https://www.bostonherald.com/2025/02/24/tariffs-on-canada-mexico-start-next-month/",
    "timestamp": "2025-02-24T23:28:36Z"
  },
  {
    "title": "Video: A Look at the New Deputy FBI Director, Dan Bongino",
    "description": "From dirtbag troll to the FBI. Kash Patel will now be assisted at the FBI by yet another vein-popping bullet-headed unqualified pro-Trump fanatic in an extremely important position. Ryan Reilly, NBC News Justice Reporter and Andrew Weissmann, former top prose…",
    "link": "https://littlegreenfootballs.com/article/54418_Video-_A_Look_at_the_New_Deput",
    "timestamp": "2025-02-24T23:26:57Z"
  },
  {
    "title": "Exclusive: Wisconsin GOP Chairman Brian Schimming on ‘War Footing’ for High-Stakes State Supreme Court Election",
    "description": "Democrats view the battle as a chance to push policy and redraw legislative maps that could ultimately lose Republicans two U.S. House seats and help them close in on the Republicans’ slim majority.\nThe post Exclusive: Wisconsin GOP Chairman Brian Schimming o…",
    "link": "https://www.breitbart.com/politics/2025/02/24/exclusive-wisconsin-gop-chairman-brian-schimming-on-war-footing-for-high-stakes-state-supreme-court-election/",
    "timestamp": "2025-02-24T23:26:49Z"
  },
  {
    "title": "Ukraine’s allies gather in Kyiv on war’s 3rd anniv, US absent",
    "description": "Ukrainian President Zelensky has called for real, lasting peace on the third anniversary of Russia's invasion. He emphasized the need for unity and strength, vowing that Russia will not win. Donald Trump suggested that Putin would accept European peacekeepers…",
    "link": "https://timesofindia.indiatimes.com/world/europe/ukraines-allies-gather-in-kyiv-on-wars-3rd-anniv-us-absent/articleshow/118542215.cms",
    "timestamp": "2025-02-24T23:26:27Z"
  },
  {
    "title": "Unpacking claims about new website allegedly run by anonymous federal workers",
    "description": "We the Builders claims to be founded by anonymous federal workers intent on sharing the truth about Elon Musk's Department of Government Efficiency.",
    "link": "https://www.snopes.com//news/2025/02/24/federal-workers-website/",
    "timestamp": "2025-02-24T23:24:00Z"
  },
  {
    "title": "What happens if Trump successfully pushes our closest allies away?",
    "description": "Germany had a major election last weekend, one that left its center-left ruling party, the Social Democratic Party ruling party in the dust, and the conservative Christian Democratic Union ascendant once again. The country’s likely next leader, Friedrich Merz…",
    "link": "https://www.vox.com/politics/401154/trump-europe-eu-germany-merz-france-macron-starmer-uk",
    "timestamp": "2025-02-24T23:23:28Z"
  },
  {
    "title": "AI data centers burn tons of energy. Can consumers and the grid adapt?",
    "description": "AI data centers burn tons of energy. Can consumers and the grid adapt?\nShare Now on:\nAI data centers burn tons of energy. Can consumers and the grid adapt?\nIn a move aimed at pleasing President Donald Trump and avoiding tariffs on imports from China, Apple pl…",
    "link": "https://biztoc.com/x/ebbb4482f9ba787b",
    "timestamp": "2025-02-24T23:23:15Z"
  },
  {
    "title": "GOP Moves to Impeach Judge Who Ruled Against Trump Health Data Purge",
    "description": "Congressional Republicans on Monday continued to attack federal judges who rule against the Trump administration, with Rep. Andy Ogles of Tennessee introducing articles of impeachment against U.S. District Judge John Bates in Washington, D.C.\n\nBates, an appoi…",
    "link": "https://www.commondreams.org/news/federal-judge-impeachment",
    "timestamp": "2025-02-24T23:22:07Z"
  },
  {
    "title": "Secret Service agent who tried to save JFK dies at 93",
    "description": "Clint Hill received Secret Service awards and was promoted for his actions that day, but for decades blamed himself for the US president's death.",
    "link": "https://www.abc.net.au/news/2025-02-25/jfk-assassination-secret-service-agent-clint-hill-dies/104978078",
    "timestamp": "2025-02-24T23:22:04Z"
  },
  {
    "title": "Joy Reid Won't Apologize for Trump Comments After MSNBC Firing",
    "description": "Reid spoke out after her MSNBC show was canceled.",
    "link": "https://www.newsweek.com/joy-reid-not-apologize-trump-comments-2035622",
    "timestamp": "2025-02-24T23:22:04Z"
  },
  {
    "title": "Where Will Friedrich Merz Take Germany?",
    "description": "With the Alternative for Germany waiting on the sidelines, any new German government coalition must hang together or hang separately.\nThe post Where Will Friedrich Merz Take Germany? appeared first on The National Interest.",
    "link": "https://nationalinterest.org/blog/politics/where-will-friedrich-merz-take-germany/",
    "timestamp": "2025-02-24T23:20:59Z"
  },
  {
    "title": "‘World War III’: In meeting with French president, Trump again sounds alarm on Ukraine-Russia conflict",
    "description": "'There'll be a point at which it's not going to stop at those two countries because there's such involvement from other countries'",
    "link": "https://www.wnd.com/2025/02/world-war-iii-in-meeting-with-french-president-trump-again-sounds-alarm-on-ukraine-russia-conflict/",
    "timestamp": "2025-02-24T23:20:52Z"
  },
  {
    "title": "The COVID 'Contrarians' Are in Power. We Haven't Hashed Out Whether They Were Right.",
    "description": "In October, Stanford University professor Jay Bhattacharya, MD, PhD, hosted a conferenceopens in a new tab or window on the lessons of COVID-19 in order \"to do better in the next pandemic.\" He invited scholars, journalists, and policy wonks who, like him, hav…",
    "link": "https://freerepublic.com/focus/f-news/4300217/posts",
    "timestamp": "2025-02-24T23:20:42Z"
  },
  {
    "title": "Trump budget bill in peril as warring House GOP factions threaten rebellion",
    "description": "House leaders' reconciliation bill is on thin ice on Monday evening as multiple Republican lawmakers threatened to defect.",
    "link": "https://www.foxnews.com/politics/trump-budget-bill-peril-warring-house-gop-factions-threaten-rebellion",
    "timestamp": "2025-02-24T23:19:57Z"
  },
  {
    "title": "Donald Trump hails German election results: ‘People got tired of no common sense agenda’",
    "description": "On his social media platform Truth Social, Trump said: \"Looks like the conservative party in Germany has won the very big and highly anticipated election. Much like the USA, the people of Germany got tired of the no common sense agenda, especially on energy a…",
    "link": "https://freerepublic.com/focus/f-news/4300216/posts",
    "timestamp": "2025-02-24T23:19:30Z"
  },
  {
    "title": "Jane Fonda just showed us how to respond to Donald Trump",
    "description": "Jane Fonda used her acceptance speech for the Life Achievement Award at the Screen Actors Guild awards show to rebuke President Donald Trump.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/jane-fonda-sag-speech-donald-trump-rcna193557",
    "timestamp": "2025-02-24T23:18:09Z"
  },
  {
    "title": "Trump and Macron Plan to Share ‘Burden of Securing the Peace’ In Ukraine",
    "description": "French President Emmanuel Macron agrees that Europe must join the United States in bearing the “cost and burden of securing the peace” between Russia and... Read More\nThe post Trump and Macron Plan to Share ‘Burden of Securing the Peace’ In Ukraine appeared f…",
    "link": "https://www.dailysignal.com/2025/02/24/trump-macron-discuss-sharing-burden-securing-peace-ukraine/",
    "timestamp": "2025-02-24T23:16:32Z"
  },
  {
    "title": "Trump officials list 5 weekly accomplishments ahead of Musk midnight deadline",
    "description": "Some Trump officials are listing their own accomplishments for last week ahead of a deadline on Monday evening for federal employees to report what they achieved.",
    "link": "https://www.foxnews.com/politics/trump-officials-list-accomplishments-last-week-ahead-midnight-musk-deadline",
    "timestamp": "2025-02-24T23:15:45Z"
  },
  {
    "title": "University of Missouri System looks to reduce spending amid federal uncertainty",
    "description": "In a Monday morning email message to University of Missouri faculty and staff, Chancellor Mun Choi said officials will begin reducing administrative expenses.",
    "link": "https://www.stltoday.com/news/local/education/university-of-missouri-system-looks-to-reduce-spending-amid-federal-uncertainty/article_40fa89d8-f300-11ef-a509-77560f6403e8.html",
    "timestamp": "2025-02-24T23:15:00Z"
  },
  {
    "title": "Germany’s Newly-Elected Conservative Party Would Rather Side With Socialists Than Other Right-Wingers",
    "description": "Friedrich Merz said he will pursue a governing coalition with the country's socialist party after his conservative party fell short of an absolute majority.",
    "link": "https://dailycaller.com/2025/02/24/germany-election-christian-democratic-union-socialist-coalition-alternative-for-germany-afd/",
    "timestamp": "2025-02-24T23:13:30Z"
  },
  {
    "title": "Trade sanctions on China?",
    "description": "Over the past three years, commenters have raked me over the coals for my opposition to the US cold war against China, particularly our economic sanctions, which go far beyond legitimate national security concerns. The single factor that is most often cited b…",
    "link": "https://www.econlib.org/trade-sanctions-on-china/",
    "timestamp": "2025-02-24T23:13:11Z"
  },
  {
    "title": "Germany’s election signals a rejection of passive decline",
    "description": "AfD is not merely a nationalist movement. Their appeal lies not in ideological extremism but in its ability to capitalize on widespread discontent, particularly regarding immigration.",
    "link": "https://www.jpost.com/opinion/article-843583",
    "timestamp": "2025-02-24T23:12:49Z"
  },
  {
    "title": "Trump and Macron Discuss Ukraine Peace Deal, Meeting Putin",
    "description": "President Donald Trump held a bilateral press conference with French President Emmanuel Macron Monday at the White House during Macron's visit to discuss Ukraine peace talks. Trump spoke on the third anniversary of Russia’s invasion of Ukraine, which he said …",
    "link": "https://biztoc.com/x/f33716a2e8afe47d",
    "timestamp": "2025-02-24T23:12:34Z"
  },
  {
    "title": "DOGE Layoffs Pose ‘Growing’ Risk To U.S. Economy And Markets, Says Apollo Economist",
    "description": "Topline\nThe layoffs from Elon Musk’s Department of Government Efficiency (DOGE) could be much bigger than many expect, according to a prominent economist, who warned about DOGE-led “growing” risks on the broader economy—and the markets, which President Donald…",
    "link": "https://biztoc.com/x/7d0af3cf9434806a",
    "timestamp": "2025-02-24T23:12:22Z"
  },
  {
    "title": "Struggling Tesla looks to Indian market under Trump's watchful eye",
    "description": "NEW YORK -- As Tesla readies for a possible entry into India's electric-vehicle market, CEO Elon Musk's company faces a squeeze between the need to revive growth and pressure from U.S. President Donald Trump to invest at home.\nTesla started hiring for 13 role…",
    "link": "https://biztoc.com/x/86ae606842798114",
    "timestamp": "2025-02-24T23:12:20Z"
  },
  {
    "title": "China eyes Trump's Ukraine strategy, strengthens ties with Russia",
    "description": "STATE DEPARTMENT — Three years into Russia’s aggression in Ukraine, China is closely monitoring U.S. President Donald Trump’s strategy to end the war, as Beijing calculates its moves to position itself as a strategic partner for Ukraine while maintaining a no…",
    "link": "https://www.voanews.com/a/china-eyes-trump-s-ukraine-strategy-strengthens-ties-with-russia/7986607.html",
    "timestamp": "2025-02-24T23:11:31Z"
  },
  {
    "title": "Trump officials' claim over timing of $400M 'armored Teslas' deal undercut by docs: report",
    "description": "When a recent review of federal contracts exposed that the State Department was preparing to award a $400 million contract for \"armored Teslas,\" it provoked an uproar of corruption accusations, with many suggesting the Trump administration was arranging a kic…",
    "link": "https://www.rawstory.com/state-department-teslas/",
    "timestamp": "2025-02-24T23:09:21Z"
  },
  {
    "title": "Teary MSNBC anchor Joy Reid remains defiant as she breaks silence after firing: ‘I’m not sorry’",
    "description": "“I’m not sorry. I am not sorry that I stood up for those those things,” Joy Reid said.",
    "link": "https://nypost.com/2025/02/24/media/teary-msnbc-anchor-joy-reid-remains-defiant-as-she-breaks-silence-after-firing-im-not-sorry/",
    "timestamp": "2025-02-24T23:06:20Z"
  },
  {
    "title": "Trump Administration Reverses Layoffs At These Federal Agencies—After Cutting Bird Flu, FDA Staff",
    "description": "Some employees at the National Nuclear Security Administration, which oversees the U.S.’ nuclear weapons, were reportedly summoned back to work after being laid off.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/02/24/trump-administration-reverses-layoffs-at-these-federal-agencies-after-cutting-bird-flu-fda-staff/",
    "timestamp": "2025-02-24T23:05:46Z"
  },
  {
    "title": "Are Trump's military picks based on merit or loyalty?",
    "description": "On Friday, Donald Trump fired Chairman of the Joint Chief's of Staff CQ Brown, along with several other top Pentagon officials. <br><br>Now, Senator Jack Reed, a Democrat from Rhode Island, has a question for the man tapped to succeed him, Retired Air Force L…",
    "link": "https://www.npr.org/2025/02/24/1233706278/are-trumps-military-picks-based-on-merit-or-loyalty",
    "timestamp": "2025-02-24T23:04:06Z"
  },
  {
    "title": "How Dan Bongino Went From Pro-Trump Podcaster to FBI Deputy Director",
    "description": "Bongino has never served in the FBI. But his rise as a ferociously loyal right-wing influencer is what Trump wanted, says a Trump adviser.",
    "link": "https://time.com/7261243/dan-bongino-fbi-podcaster/",
    "timestamp": "2025-02-24T23:01:40Z"
  },
  {
    "title": "Alec Baldwin Confronts Trump Impersonator Outside Home",
    "description": "The '30 Rock' actor was being heckled by a comedian, who was dressed as Donald Trump.",
    "link": "https://biztoc.com/x/3ef3b513cfe2b470",
    "timestamp": "2025-02-24T23:01:39Z"
  },
  {
    "title": "Judge won’t immediately restore Associated Press’ access to White House",
    "description": "U.S. District Judge Trevor N. McFadden urged the Trump administration to reconsider its two-week-old ban, saying that case law \"is uniformly unhelpful to the White House.”",
    "link": "https://www.pbs.org/newshour/politics/judge-wont-immediately-restore-associated-press-access-to-white-house",
    "timestamp": "2025-02-24T23:01:09Z"
  },
  {
    "title": "TradFi coalition urges Trump to overhaul ‘restrictive’ Biden-era crypto policies",
    "description": "Leading financial industry groups have urged President Donald Trump’s administration to roll back federal policies they say have restricted US banks from engaging in digital asset markets and warned that regulatory overreach is hampering American leadership i…",
    "link": "https://cryptoslate.com/tradfi-coalition-urges-trump-to-overhaul-restrictive-biden-era-crypto-policies/",
    "timestamp": "2025-02-24T23:00:32Z"
  },
  {
    "title": "Awkward touching... | | 'Tug-of-war' handshake...",
    "description": "PRESIDENT Donald Trump has given a chilling World War Three warning to Europe over the Russian-Ukraine peace plans following “productive” talks with Emmanuel Macron. The Republican and …",
    "link": "https://www.the-sun.com/news/13615943/donald-trump-macron-ukraine/",
    "timestamp": "2025-02-24T23:00:03Z"
  },
  {
    "title": "The Real Enemy of the American people Is Not Russia, but the EU Regime in Brussels",
    "description": "In his seminal speech at the recently concluded Munich Security Conference, US Vice President JD Vance said the following: “[T]he threat that I worry the most about vis-a-vis Europe is not Russia, it’s not China, it’s not any other external actor. What I worr…",
    "link": "https://www.activistpost.com/eu-globalist-regime-threatening-transatlantic-relations/",
    "timestamp": "2025-02-24T23:00:00Z"
  },
  {
    "title": "Impact of federal employee cuts on St. Louis is unclear. NGA construction continues.",
    "description": "Federal agencies in the St. Louis area have few answers on DOGE cuts. But construction is ongoing at the National Geospatial-Intelligence Agency.",
    "link": "https://www.stltoday.com/news/local/business/impact-of-federal-employee-cuts-on-st-louis-is-unclear-nga-construction-continues/article_05d7a306-f2e5-11ef-a580-8f0bfe9b3bf9.html",
    "timestamp": "2025-02-24T23:00:00Z"
  },
  {
    "title": "Asian Stocks Set for Losses as US Pressures China: Markets Wrap",
    "description": "Asian stocks are poised for hefty losses throughout the region, dragged by a poor session on Wall Street and the Trump administration’s latest moves to curb US trade with China.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-stocks-set-for-losses-as-us-pressures-china-markets-wrap",
    "timestamp": "2025-02-24T22:59:00Z"
  },
  {
    "title": "Peace must not mean surrendering Ukraine, Macron says alongside Trump",
    "description": "The two leaders exchange warm words as they hold talks on Ukraine, but differences on ending the war are clear.",
    "link": "https://www.bbc.com/news/articles/c4g02y8gz10o",
    "timestamp": "2025-02-24T22:58:36Z"
  },
  {
    "title": "25% tariffs! Where next for the BlueScope share price?",
    "description": "This business is primed to make bigger profits. \nThe post 25% tariffs! Where next for the BlueScope share price? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/02/25/25-tariffs-where-next-for-the-bluescope-share-price/",
    "timestamp": "2025-02-24T22:58:00Z"
  },
  {
    "title": "TSMC's calculated waiting game in the age of Trump 2.0",
    "description": "Just one month into his presidency, US President Donald Trump has commanded global attention with his rapid-fire initiatives. The impact of his second-term policies has upended traditional expectations, with industry sources revealing that five major Taiwanes…",
    "link": "https://www.digitimes.com/news/a20250224PD224/tsmc-taiwan-donald-trump-technology-electronics.html",
    "timestamp": "2025-02-24T22:57:25Z"
  },
  {
    "title": "Trump’s High-Level Military Firings Send Several Disturbing Messages",
    "description": "There’s no good reason for these firings.",
    "link": "https://slate.com/news-and-politics/2025/02/trump-military-firings-joint-chiefs-chairman.html",
    "timestamp": "2025-02-24T22:57:01Z"
  },
  {
    "title": "Vladimir Putin Dumps Cold Water on Trump’s Bragging About Ukraine",
    "description": "Donald Trump and Russian President Vladimir Putin need to get their story straight, because they’re both telling different tales about negotiations to end Russia’s violent incursion into Ukraine. \r\nTrump bragged Monday about working with Putin while recapping…",
    "link": "https://newrepublic.com/post/191914/vladimir-putin-donald-trump-bragging-ukraine",
    "timestamp": "2025-02-24T22:56:37Z"
  },
  {
    "title": "Trump: 'We're Going to Fort Knox' to See If the Gold Is Still There",
    "description": "The Trump administration is going to Fort Knox to see if the gold is still there, President Donald Trump told reporters on Monday.\nThe post Trump: ‘We’re Going to Fort Knox’ to See If the Gold Is Still There appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/24/trump-were-going-fort-knox-see-if-gold-still-there/",
    "timestamp": "2025-02-24T22:55:07Z"
  },
  {
    "title": "Noem ends Biden-era use of controversial app to allow migrants to board flights, except to self-deport",
    "description": "DHS Secretary Kristi Noem is ending the use of the CBP One app to allow migrants to board flights, the latest turn from the Biden-era use of the app.",
    "link": "https://www.foxnews.com/politics/noem-ends-biden-era-use-controversial-app-allow-migrants-board-flights-except-self-deport",
    "timestamp": "2025-02-24T22:54:55Z"
  },
  {
    "title": "Hegseth Welcomes Saudi Defense Minister to Pentagon, Underscores Partnership",
    "description": "Defense Secretary Pete Hegseth highlighted the importance of the partnership between the U.S. and Saudi Arabia while hosting that country's defense minister during a bilateral engagement at the Pentagon.",
    "link": "https://www.defense.gov/News/News-Stories/Article/Article/4076119/hegseth-welcomes-saudi-defense-minister-to-pentagon-underscores-partnership/",
    "timestamp": "2025-02-24T22:52:53Z"
  },
  {
    "title": "CEO Devin Nunes Made $47 Million While Truth Social Parent Company Reported $401 Million In Losses In 2024",
    "description": "Former Congressman Devin Nunes' pay soared after Trump Media went public, but he can’t cash in right away.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/02/24/truth-social-devin-nunes-donald-trump-media-salary/",
    "timestamp": "2025-02-24T22:52:13Z"
  },
  {
    "title": "Elon Musk’s protege ‘Big Balls’ is grandson of executed KGB agent, report says - NewsBreak",
    "description": "Edward Coristine, a protege of Elon Musk ’s at the Department of Government Efficiency ( DOGE ), who has already gained notoriety for his checkered early",
    "link": "https://www.newsbreak.com/share/3827316626621-elon-musk-s-protege-big-balls-is-grandson-of-executed-kgb-agent-report-says?s=a2&share_destination_id=MzA3ODg1MTc3LTE3NDA0Mzc0NzI5NDY%3D&pd=0KpqzxIY&hl=en_US&send_time=1740437472&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.7.2%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_model_exp_25q1-v9%2Cns_push_exp_rt_bucketv12-v1%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v9%2Cns_foryou_rank_exp_25q1-v9",
    "timestamp": "2025-02-24T22:51:39Z"
  },
  {
    "title": "The government is still threatening to ‘semi-fire’ workers who don’t answer an email from Elon Musk",
    "description": "We’re nearing the deadline that Elon Musk imposed for government workers to reply to a mass email about productivity, and the results have been predictably confusing — with even a direct statement from President Donald Trump failing to clear things up. Govern…",
    "link": "https://www.theverge.com/news/618603/elon-musk-email-firing-threat-agency-response-donald-trump",
    "timestamp": "2025-02-24T22:51:38Z"
  },
  {
    "title": "Alec Baldwin Confronts Trump Impersonator Outside Home",
    "description": "The '30 Rock' actor was being heckled by a comedian, who was dressed as Donald Trump.",
    "link": "https://www.newsweek.com/entertainment/celebrity-news/alec-baldwin-confronts-trump-impersonator-outside-home-2035609",
    "timestamp": "2025-02-24T22:51:09Z"
  },
  {
    "title": "What Would a Liberal Tea Party Look Like?",
    "description": "Democrats might have a chance to replicate the energy of the 2009 grassroots movement—if they actually want to.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/02/what-would-a-liberal-tea-party-look-like/681819/",
    "timestamp": "2025-02-24T22:51:00Z"
  },
  {
    "title": "Giuliani Satisfies Judgment Against Him",
    "description": "“Rudy Giuliani has ‘fully satisfied’ a $148 million judgment won by two Georgia election workers who said he defamed them by falsely claiming they helped steal the 2020 presidential election from Donald Trump, a Monday",
    "link": "https://politicalwire.com/2025/02/24/giuliani-satisfies-judgment-against-him/",
    "timestamp": "2025-02-24T22:50:59Z"
  },
  {
    "title": "Pundits tout Globalisation 3.0 strategies",
    "description": "<p>Thailand should have proactive policies, tech sovereignty and find new markets that face less of an impact from the US-China trade war to survive Globalisation 3.0 and the uncertainties in global trade during the second term of US President Donald Trump, a…",
    "link": "https://www.bangkokpost.com/business/general/2967366/pundits-tout-globalisation-3-0-strategies",
    "timestamp": "2025-02-24T22:50:00Z"
  },
  {
    "title": "Musk's email ultimatum leads to mixed messages: From the Politics Desk",
    "description": "Federal employees started another work week receiving mixed messages from the top after Elon Musk's weekend email ultimatum.",
    "link": "https://www.nbcnews.com/politics/musk-email-ultimatum-mixed-messages-politics-desk-rcna193552",
    "timestamp": "2025-02-24T22:48:56Z"
  },
  {
    "title": "Vivek Ramaswamy announces bid for governor of Ohio",
    "description": "Vivek Ramaswamy, the failed 2024 Republican presidential candidate and uber-wealthy biotech entrepreneur, officially declared his candidacy for governor of Ohio on Monday.",
    "link": "https://www.msnbc.com/the-reidout/reidout-blog/vivek-ramaswamy-ohio-governor-campaign-rcna193451",
    "timestamp": "2025-02-24T22:47:39Z"
  },
  {
    "title": "Trump Rages At MSNBC, Joy Reid, And Comcast CEO",
    "description": "Doesn't the president have anything better to do than rant about TV shows?",
    "link": "https://littlethings.com/entertainment/trump-rages-at-msnbc-joy-reid-and-lowlife-comcast-ceo-brian-roberts",
    "timestamp": "2025-02-24T22:45:04Z"
  },
  {
    "title": "Official report exposes govt’s ‘lies’, says Congress; BJP accuses it of defending ‘covert interference’",
    "description": "NEW DELHI, Feb 24: The Congress on Monday cited a Union Finance Ministry report on the USAID-funded projects in India to claim that it has thoroughly exposed the government’s “lies”, prompting the BJP to accuse the opposition party of defending “covert interf…",
    "link": "https://thehillstimes.in/national/official-report-exposes-govts-lies-says-congress-bjp-accuses-it-of-defending-covert-interference",
    "timestamp": "2025-02-24T22:45:00Z"
  },
  {
    "title": "A Moment of Dizzying Upheaval in the Ukraine War",
    "description": "From the February 24, 2025, edition of The New Yorker newsletter: Joshua Yaffa on three years of the war in Ukraine. Plus: the White House is gaslighting Americans about tariffs; the many guises of Robert Frost; and Judy Collins’s next moves.",
    "link": "https://www.newyorker.com/newsletter/the-daily/a-moment-of-dizzying-upheaval-in-the-ukraine-war",
    "timestamp": "2025-02-24T22:45:00Z"
  },
  {
    "title": "Inside Trump's War on Migrant Kids: President Slammed for Latest 'Fascist' Hunt as He Orders ICE to Track Down 'Unaccompanied Minors'",
    "description": "President Donald Trump has been slammed for his latest hunt as he orders ICE to track down 'unaccompanied minors' who entered the country without parents.",
    "link": "https://radaronline.com/p/donald-trump-war-migrant-kids-president-slammed-orders-ice-track-down-unaccompanied-minors/",
    "timestamp": "2025-02-24T22:44:36Z"
  },
  {
    "title": "CNN: Deep State Bureaucrats Threaten To Sell State Secrets If Trump Isn’t Nice To Them",
    "description": "CNN warns that intelligence employees who get the axe are valuable — and that those same employees will sell national secrets if fired. Which is it?",
    "link": "https://thefederalist.com/2025/02/24/cnn-deep-state-bureaucrats-threaten-to-sell-state-secrets-if-trump-isnt-nice-to-them/",
    "timestamp": "2025-02-24T22:43:24Z"
  },
  {
    "title": "European leaders in Kyiv to mark three years of war, but top U.S. officials stay away",
    "description": "Trump's rush to end the war has stoked fears of an undermined Kyiv and an altered geopolitical landscape.",
    "link": "https://www.japantimes.co.jp/news/2025/02/25/world/politics/eu-kyiv-war-us-officials/",
    "timestamp": "2025-02-24T22:42:00Z"
  },
  {
    "title": "Ramaswamy officially launches gubernatorial campaign in Ohio: 'Best days are still yet ahead'",
    "description": "Vivek Ramaswamy, the multimillionaire biotech entrepreneur and former Republican presidential candidate who went on to become a major Trump supporter, launches a 2026 campaign for Ohio governor",
    "link": "https://www.foxnews.com/politics/ramaswamy-officially-launches-gubernatorial-campaign-ohio",
    "timestamp": "2025-02-24T22:40:12Z"
  },
  {
    "title": "Dominari Holdings Stock Surges After Hours: What's Going On?",
    "description": "Dominari Holdings Inc (NASDAQ:DOMH) shares are trading higher in Monday’s after-hours session after Donald Trump Jr. and Eric Trump reported significant stakes in the company.\nWhat Happened: According to two separate regulatory filings released Monday, Trump …",
    "link": "https://biztoc.com/x/593324e377f52f1e",
    "timestamp": "2025-02-24T22:39:39Z"
  },
  {
    "title": "Ted Cruz slaps blue state authority with subpoena over sheltering migrants at airport: 'Reckless'",
    "description": "Sen. Ted Cruz, R-Texas, is subpoenaing the Massachusetts port authority for documents related to the sheltering of migrants at Bordon Logan International Airport.",
    "link": "https://www.foxnews.com/politics/ted-cruz-slaps-blue-state-authority-subpoena-over-sheltering-migrants-airport",
    "timestamp": "2025-02-24T22:38:23Z"
  },
  {
    "title": "Putin Says Europeans, Others Can \"Participate\" In Ukraine Talks",
    "description": "Russian President Vladimir Putin said Monday that European countries, as well as others, can participate in talks to resolve the conflict in Ukraine.",
    "link": "https://www.ndtv.com/world-news/putin-says-europeans-others-can-participate-in-ukraine-talks-7787557",
    "timestamp": "2025-02-24T22:38:11Z"
  },
  {
    "title": "OPP making fentanyl and other busts in beefed up border push",
    "description": "Operation Deterrence is getting results as OPP and local cops add extra eyes, ears and boots to the border effort.",
    "link": "https://torontosun.com/opinion/columnists/ontario-cops-seizing-fentanyl-at-the-canadian-border",
    "timestamp": "2025-02-24T22:36:05Z"
  },
  {
    "title": "Boris Johnson lobbies for Donald Trump’s minerals deal with Ukraine - POLITICO Europe",
    "description": "Boris Johnson lobbies for Donald Trump’s minerals deal with UkrainePOLITICO Europe Is Zelensky’s Approach to Trump Hurting Ukraine?The New York Times Zelenskyy says progress made on reaching an agreement with the US on rare minerals dealThe Associated Press I…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176412469",
    "timestamp": "2025-02-24T22:34:24Z"
  },
  {
    "title": "Pentagon brings right-wing podcaster on board to run digital media",
    "description": "Graham Allen’s hiring comes as DOD is looking to lay off tens of thousands of employees and freeze hiring in the name of cost savings",
    "link": "https://www.defenseone.com/policy/2025/02/pentagon-brings-right-wing-podcaster-board-run-digital-media/403234/",
    "timestamp": "2025-02-24T22:33:30Z"
  },
  {
    "title": "How to Take the Crazy Crypto Circus Seriously",
    "description": "The crypto sphere may seem chaotic, but that \"craziness\" often reflects rapid experimentation and boundless ambition.",
    "link": "https://www.newsweek.com/how-take-crazy-crypto-circus-seriously-2035605",
    "timestamp": "2025-02-24T22:32:31Z"
  }
]