[
  {
    "title": "US-Iran: Unclear what comes next after Donald Trump’s riskiest foreign policy action as president",
    "description": "Analysis: Midnight Hammer mission has raised a blizzard of new questions",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/22/us-iran-unclear-what-comes-next-after-donald-trumps-riskiest-foreign-policy-action-as-president/",
    "timestamp": "2025-06-22T19:27:37Z"
  },
  {
    "title": "National Security Expert on the Iran Strikes: Ending 50 Years of Iranian Hostility",
    "description": "“What happened last night, in my estimation, isn’t about starting another forever war in the Middle East, it’s about ending the longest one.” Victoria Coates,... Read More\nThe post National Security Expert on the Iran Strikes: Ending 50 Years of Iranian Hosti…",
    "link": "https://www.dailysignal.com/2025/06/22/national-security-expert-on-the-iran-strikes-ending-50-years-of-iranian-hostility/",
    "timestamp": "2025-06-22T19:27:36Z"
  },
  {
    "title": "A humiliated, desperate Iran has few options to retaliate against the US",
    "description": "Iran is promising a mighty punishment for US strikes on its nuclear sites. But it has few options for actual retaliation, and none of them are good.",
    "link": "https://www.abc.net.au/news/2025-06-23/iran-retaliation-us-nuclear-strikes-analysis/105447286",
    "timestamp": "2025-06-22T19:26:29Z"
  },
  {
    "title": "World braces for Iran’s response to U.S. strikes | Honolulu Star-Advertiser",
    "description": "ISTANBUL/WASHINGTON/JERUSALEM >> The world braced on Sunday for Iran’s response after the U.S. attacked key Iranian nuclear sites, joining Israel in the biggest Western military action against the Islamic Republic since its 1979 revolution.",
    "link": "https://www.staradvertiser.com/2025/06/22/breaking-news/world-braces-for-irans-response-to-u-s-strikes/",
    "timestamp": "2025-06-22T19:26:16Z"
  },
  {
    "title": "The Latest: US seeks to weaken longtime foe Iran striking 3 nuclear sites",
    "description": "The U.S. military has hit three sites in Iran and inserted itself into Israel’s effort to destroy Iran’s nuclear program in a risky gambit to weaken a longtime foe",
    "link": "https://www.wsbtv.com/news/latest-us-seeks/FBAIER6KJFGPXJ4UZNL472B7RM/",
    "timestamp": "2025-06-22T19:26:16Z"
  },
  {
    "title": "Israel targets IRGC officials, nuclear scientist, and missile bases in Iran (June 22–21 updates)",
    "description": "Over the past 72 hours, Israel has intensified its air campaign across Iran, striking missile and drone infrastructure in Esfahan, Bushehr, Ahvaz, Yazd, and Qom. Targets included the Imam Hossein missile base in Yazd, IRGC drone and air defense facilities, an…",
    "link": "https://www.longwarjournal.org/archives/2025/06/israel-targets-irgc-officials-nuclear-scientist-and-missile-bases-june-22-21-updates.php",
    "timestamp": "2025-06-22T19:22:39Z"
  },
  {
    "title": "NATO allies agree to 5 percent defense spending goal",
    "description": "Spain threw up a last-minute roadblock to the new spending target, but gave way after being granted flexibility.",
    "link": "https://www.politico.eu/article/nato-allies-defense-spending-goal-spain-gdp/",
    "timestamp": "2025-06-22T19:19:09Z"
  },
  {
    "title": "NATO strikes spending deal, but Spain exemption claim risks Trump ire",
    "description": "NATO on Sunday signed off on a pledge to ramp up defence spending before its upcoming summit, but Madrid insisted it would not need to hit the five percent of GDP demanded by US President Donald Trump. The claim by Spanish Prime Minister Pedro Sanchez sets up…",
    "link": "https://www.digitaljournal.com/world/nato-strikes-spending-deal-but-spain-exemption-claim-risks-trump-ire/article",
    "timestamp": "2025-06-22T19:17:20Z"
  },
  {
    "title": "Iran says US must 'receive a response' to strikes",
    "description": "Iran's president has said his country has to respond following US attacks on Iranian nuclear sites. The US called operation \"Midnight Hammer\" an \"overwhelming success.\" Follow DW for more. US President Donald Trump says 3 nuclear sites in Iran were \"obliterat…",
    "link": "https://www.dw.com/en/iran-says-us-must-receive-a-response-to-strikes/live-72996785",
    "timestamp": "2025-06-22T19:16:00Z"
  },
  {
    "title": "Iran says US must 'receive a response' to strikes",
    "description": "Iran's president has said his country has to respond following US attacks on Iranian nuclear sites. The US called operation \"Midnight Hammer\" an \"overwhelming success.\" Follow DW for more.",
    "link": "https://www.dw.com/en/iran-says-us-must-receive-a-response-to-strikes/live-72996785",
    "timestamp": "2025-06-22T19:16:00Z"
  },
  {
    "title": "US must 'receive a response' to strikes Iranian leader says",
    "description": "Iran's president has said his country has to respond following US attacks on Iranian nuclear sites. The US called operation \"Midnight Hammer\" an \"overwhelming success.\" Follow DW for more.",
    "link": "https://www.dw.com/en/us-must-receive-a-response-to-strikes-iranian-leader-says/live-72996785",
    "timestamp": "2025-06-22T19:16:00Z"
  },
  {
    "title": "Andrew Cuomo isn’t an asshole who gets things done, he’s just an asshole",
    "description": "Bill Clinton’s regrettable endorsement of Andrew Cuomo makes a familiar claim: Mr. Clinton will use the robocall to tell voters that he hired Mr. Cuomo “because he knows how to get things done” and that they had worked together on homelessness and on improvin…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/andrew-cuomo-isnt-an-asshole-who-gets-things-done-hes-just-an-asshole",
    "timestamp": "2025-06-22T19:14:11Z"
  },
  {
    "title": "Toyota makes a tariff move customers are going to hate",
    "description": "Toyota says this action is part of its regular economic review.",
    "link": "https://www.thestreet.com/automotive/toyota-makes-a-tariff-move-customers-are-going-to-hate",
    "timestamp": "2025-06-22T19:13:00Z"
  },
  {
    "title": "'Pathetic loser': President condemns GOP holdout on Iran operation",
    "description": "President denounces GOP lawmaker's opposition to Iran strike as disloyal and harmful.",
    "link": "https://www.israelnationalnews.com/news/410479",
    "timestamp": "2025-06-22T19:11:39Z"
  },
  {
    "title": "Flies 49% Higher W/W as Trump Intervenes on FCC Battle",
    "description": "In This Article:\nEchoStar Corporation (NASDAQ:SATS) is one of the Double-Digit Winners: 10 Stocks Crushing The Market.\nEchoStar Corp. rallied by 49 percent week-on-week to finish at $25.12 on Friday versus $16.84 on June 13 as investors cheered President Dona…",
    "link": "https://biztoc.com/x/2100d5821eaaa56c",
    "timestamp": "2025-06-22T19:11:12Z"
  },
  {
    "title": "Youth Who Fought the Climate Crisis in Court Are Now Targeting Trump",
    "description": "Many of the young plaintiffs have taken part in similar lawsuits before, and won key victories in Montana and Hawaii.",
    "link": "https://grist.org/justice/youth-climate-activists-new-suit-trump-executive-orders/",
    "timestamp": "2025-06-22T19:10:45Z"
  },
  {
    "title": "Spain reaches deal with NATO ahead of summit to be excluded from 5% defense spending goal",
    "description": "Prime Minister Pedro Sánchez says that Spain reached a deal with NATO to be excluded from a 5% of GDP defense spending target",
    "link": "https://abcnews.go.com/International/wireStory/spain-reaches-deal-nato-ahead-summit-excluded-5-123100720",
    "timestamp": "2025-06-22T19:10:27Z"
  },
  {
    "title": "Democrats in Congress Decry Trump’s Iran Strikes as Unconstitutional",
    "description": "On Saturday night, President Donald Trump announced to the world that the US carried out what he called “massive precision strikes” on three nuclear facilities in Iran. The announcement put an end to over a week of speculation about whether Trump would join I…",
    "link": "https://www.motherjones.com/politics/2025/06/democrats-in-congress-decry-trumps-iran-strikes-as-unconstitutional/",
    "timestamp": "2025-06-22T19:08:09Z"
  },
  {
    "title": "Iran's President Responds to U.S. at Rally in Tehran: 'Revenge, Revenge!'",
    "description": "Iranian President Masoud Pezeshkian offered a response to the U.S. attack on Iran's nuclear sites earlier Sunday by attending a rally in the capital city of Tehran attended by crowds chanting \"Revenge, revenge!\".\nThe post Iran’s President Responds to U.S. at …",
    "link": "https://www.breitbart.com/middle-east/2025/06/22/irans-president-responds-to-us-at-rally-in-tehran-revenge-revenge/",
    "timestamp": "2025-06-22T19:06:48Z"
  },
  {
    "title": "Trump’s move against Iran may draw more criticism from MAGA’s anti-interventionists",
    "description": "President Donald Trump’s decision to strike three nuclear sites in Iran could deepen a divide among some of the Republican’s supporters, including high-profile backers who had said any such move would run counter to the anti-interventionism he promised to del…",
    "link": "https://freerepublic.com/focus/f-news/4324658/posts",
    "timestamp": "2025-06-22T19:06:36Z"
  },
  {
    "title": "America is off to war again and China is probably celebrating",
    "description": "America is sidetracked and weakened by wars and unrest. Donald Trump understands the problem but has been unable to resist the pressure from America’s military establishment and Israel.",
    "link": "https://www.abc.net.au/news/2025-06-23/trump-us-iran-war-economy-china/105446938",
    "timestamp": "2025-06-22T19:05:12Z"
  },
  {
    "title": "Pentagon flexes US military's decoys and strategic deception that took Iran and world by surprise",
    "description": "The U.S. military used deception and decoys when it carried out its surprise strikes on Iranian nuclear facilities that caught the world off guard, Pentagon officials say.",
    "link": "https://www.foxnews.com/politics/pentagon-flexes-us-militarys-decoys-strategic-deception-took-iran-world-surprise",
    "timestamp": "2025-06-22T19:04:41Z"
  },
  {
    "title": "Tens of thousands rally across Europe for Gaza ceasefire",
    "description": "In Berlin, more than 10,000 people gathered in the centre of the city in support of Gaza, according to police figures. And in the Swiss capital Bern, march organisers estimated that 20,000 people rallied in front of the national parliament, urging the governm…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/tens-of-thousands-rally-across-europe-for-gaza-ceasefire/articleshow/122010138.cms",
    "timestamp": "2025-06-22T19:01:31Z"
  },
  {
    "title": "$96k Or $144k? Bitcoin Mayer Multiple Chart Price Target Options",
    "description": "Bitcoin (BTC) has registered a slight uptick in the last few hours after US President Donald Trump announced a successful airstrike on Iranian nuclear facilities, a move aimed at de-escalating rising tensions in the Middle East after several days of conflict …",
    "link": "http://www.newsbtc.com/news/bitcoin/96k-or-144k-bitcoin-mayer-multiple-chart-price-target-options/",
    "timestamp": "2025-06-22T19:00:25Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "Shockwaves after United States’ bombing of Iran, scrambles internationally, and demonstrations overwhelm Dublin city.",
    "link": "https://www.thejournal.ie/news-fix-22-06-25-6740470-Jun2025/",
    "timestamp": "2025-06-22T19:00:15Z"
  },
  {
    "title": "Analysis: Blue-Collar Wages Rise as Illegal Immigration Declines",
    "description": "As President Donald Trump and his administration work on expanding deportation operations, the White House is reporting that blue-collar workers have seen the most significant... Read More\nThe post Analysis: Blue-Collar Wages Rise as Illegal Immigration Decli…",
    "link": "https://www.dailysignal.com/2025/06/22/analysis-blue-collar-workers-wages-rise-illegal-immigration-declines/",
    "timestamp": "2025-06-22T19:00:00Z"
  },
  {
    "title": "War Powers Act Explained as Thomas Massie, Ro Khanna Push House Resolution",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA bipartisan group of House lawmakers, led by Republican Representative Thomas Massie of Kentucky and Democratic Representative Ro Khanna of California introduced a War Powers Resolution Tuesday, just days bef…",
    "link": "https://biztoc.com/x/97582c8cdae40749",
    "timestamp": "2025-06-22T18:59:59Z"
  },
  {
    "title": "Iran's nuclear sites have been 'obliterated'. Is this the next Chernobyl?",
    "description": "US President Donald Trump says Iran's nuclear enrichment facilities at Fordow, Natanz and Isfahan have been \"totally obliterated\". This is what that means in terms of danger from radiation.",
    "link": "https://www.abc.net.au/news/2025-06-23/iran-nuclear-sites-how-dangerous-is-us-attack-explainer/105445806",
    "timestamp": "2025-06-22T18:57:31Z"
  },
  {
    "title": "EchoStar Corp (SATS) Flies 49% Higher W/W as Trump Intervenes on FCC Battle",
    "description": "EchoStar Corporation (NASDAQ:SATS) is one of the Double-Digit Winners: 10 Stocks Crushing The Market. EchoStar Corp. rallied by 49 percent week-on-week to...",
    "link": "https://finance.yahoo.com/news/echostar-corp-sats-flies-49-185709227.html",
    "timestamp": "2025-06-22T18:57:09Z"
  },
  {
    "title": "Trump Goes OFF on Republican Critic of Iran Attack — Just Hours After Praising ‘Great Unity’ in the GOP",
    "description": "Trump blasted GOP Congressman Thomas Massie for criticizing the military strike on Iran and said he plans to campaign \"really hard\" to oust him from Congress.\nThe post Trump Goes OFF on Republican Critic of Iran Attack — Just Hours After Praising ‘Great Unity…",
    "link": "https://www.mediaite.com/media/news/trump-goes-off-on-republican-critic-of-iran-attack-just-hours-after-praising-great-unity-in-the-gop/",
    "timestamp": "2025-06-22T18:51:45Z"
  },
  {
    "title": "U.S. strikes on Iran: what we know",
    "description": "The United States has carried out strikes that caused \"extremely severe damage\" to three of Iran's nuclear facilities.\nThe post U.S. strikes on Iran: what we know appeared first on Digital Journal.",
    "link": "https://www.digitaljournal.com/world/us-strikes-on-iran-what-we-know/article",
    "timestamp": "2025-06-22T18:50:40Z"
  },
  {
    "title": "Iowa lawmakers react to U.S. strikes on Iran",
    "description": "Iowa congressional leaders voiced support on social media for President Donald Trump on Saturday evening after he confirmed a strike on Iranian nuclear sites.",
    "link": "https://www.kcci.com/article/iowa-lawmakers-weigh-in-on-us-strike-on-iran/65142851",
    "timestamp": "2025-06-22T18:50:25Z"
  },
  {
    "title": "War Powers Act Explained as Thomas Massie, Ro Khanna Push House Resolution",
    "description": "Representative Ro Khanna of California, a Democrat said \"dragging the U.S. into another Middle East war is not the solution\" to tensions in the Middle East.",
    "link": "https://www.newsweek.com/war-powers-act-explained-thomas-massie-ro-khanna-push-house-resolution-2089004",
    "timestamp": "2025-06-22T18:50:19Z"
  },
  {
    "title": "UK and NATO allies agree to boost spending on defence and related areas to 5% of GDP by 2035",
    "description": "The UK and its NATO allies have agreed to increase spending on defence and related areas to 5% of GDP by 2035, two diplomatic sources with knowledge of the deal have told Sky News.",
    "link": "https://news.sky.com/story/uk-and-nato-allies-agree-to-boost-spending-on-defence-and-related-areas-to-5-of-gdp-by-2035-13387196",
    "timestamp": "2025-06-22T18:50:00Z"
  },
  {
    "title": "Trump’s Iran strike draws sharp rebuke from J&K parties",
    "description": "Political leaders in Jammu and Kashmir have strongly condemned the US strikes on Iran, advocating for dialogue as the path to resolution. Mehbooba Mufti criticized the OIC's weak response and alluded to Pakistan's misjudgment of US foreign policy. Farooq Abdu…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/trumps-iran-strike-draws-sharp-rebuke-from-jk-parties/articleshow/122009941.cms",
    "timestamp": "2025-06-22T18:49:34Z"
  },
  {
    "title": "Trump slams Kentucky Congressman Massie",
    "description": "United States President Donald Trump criticized Kentucky Congressman Thomas Massie, calling him a \"simple-minded grandstander,\" and saying that the Make America Great Again (MAGA) movement \"doesn't kn...",
    "link": "https://biztoc.com/x/13f4df45f97fb373",
    "timestamp": "2025-06-22T18:49:13Z"
  },
  {
    "title": "DHS Issues Heightened Terror Threat for Americans",
    "description": "The department said the Iran conflict has created a \"heightened threat environment.\"",
    "link": "https://www.newsweek.com/dhs-issues-heightened-terror-threat-americans-2089053",
    "timestamp": "2025-06-22T18:46:43Z"
  },
  {
    "title": "As airstrikes intensify, Iranians are flocking to the borders",
    "description": "Some Iranians are fleeing the country to escape the attacks, while others are trying to enter Iran to reunite with their families, after days of internet blackouts made it impossible to contact them.",
    "link": "https://www.cbc.ca/news/world/as-airstrikes-intensify-iranians-are-flocking-to-the-borders-1.7568034",
    "timestamp": "2025-06-22T18:46:13Z"
  },
  {
    "title": "Scott Jennings Turns Tables On Former DNC Spox Who Suggests Iran Was Not Direct Threat To US",
    "description": "CNN's Scott Jennings fired back at former DNC spokesperson Xochiti Hinojosa's suggestion on Sunday that Iran was not a direct threat to the U.S.",
    "link": "https://dailycaller.com/2025/06/22/scott-jennings-former-dnc-spox-iran-threat-us/",
    "timestamp": "2025-06-22T18:44:40Z"
  },
  {
    "title": "Iran strikes push Vance, a foreign intervention skeptic, into the role of salesman",
    "description": "When he endorsed Donald Trump’s 2024 presidential bid, then-Sen.",
    "link": "https://www.nbcnews.com/politics/jd-vance/iran-vance-intervention-skeptic-role-salesman-rcna214345",
    "timestamp": "2025-06-22T18:43:24Z"
  },
  {
    "title": "NATO Strikes Spending Deal, But Spain Exemption Claim Risks Trump Ire",
    "description": "NATO on Sunday signed off on a pledge to ramp up defence spending before its upcoming summit, but Madrid insisted it would not need to hit the five percent of GDP demanded by US President Donald Trump.",
    "link": "https://www.ibtimes.com/nato-strikes-spending-deal-spain-exemption-claim-risks-trump-ire-3776458",
    "timestamp": "2025-06-22T18:42:14Z"
  },
  {
    "title": "Map Shows US Military Presence in Middle East as Iran Weighs Retaliation",
    "description": "The U.S. bombed Iran overnight, raising tensions across the region as attention shifts to how Tehran may retaliate and location of U.S. military in the region.",
    "link": "https://www.newsweek.com/map-shows-us-military-presence-middle-east-iran-weighs-retaliation-2089027",
    "timestamp": "2025-06-22T18:42:04Z"
  },
  {
    "title": "Trump says Iran's nuclear sites were 'obliterated.' Were they?",
    "description": "While that may be the case, an independent assessment of Iran's nuclear sites by the International Atomic Energy Agency has not occurred.",
    "link": "https://www.usatoday.com/story/news/world/2025/06/22/trump-hegseth-iran-nuclear-sites-obliterated/84306916007/",
    "timestamp": "2025-06-22T18:41:51Z"
  },
  {
    "title": "US strikes 3 Iranian nuclear sites",
    "description": "AGENCY DUBAI: The United States attacked three sites in Iran early Sunday, inserting itself into Israel’s war aimed at destroying the Iranian nuclear programme in a risky gambit to weaken a longtime foe that prompted fears of a wider regional conflict as Tehr…",
    "link": "https://statetimes.in/us-strikes-3-iranian-nuclear-sites/",
    "timestamp": "2025-06-22T18:41:16Z"
  },
  {
    "title": "Iranian threat to UK could increase after US strikes, says cabinet minister",
    "description": "The threat to the UK from Iran is already at a \"significant level\" and could increase following the US strikes on Iranian nuclear sites, a cabinet minister has told Sky News.",
    "link": "https://news.sky.com/story/iranian-threat-to-uk-could-increase-after-us-strikes-says-cabinet-minister-13387193",
    "timestamp": "2025-06-22T18:38:00Z"
  },
  {
    "title": "Targeting California: Supreme Court joins Trump, GOP in push to curb emissions regs",
    "description": "WASHINGTON — The Supreme Court has joined President Donald Trump and congressional Republicans in siding with the oil and gas industry in its challenge to California’s drive for electric vehicles.\nIn a 7-2 decision issued late last week, the justices revived …",
    "link": "https://biztoc.com/x/8d95f6259e6552c6",
    "timestamp": "2025-06-22T18:37:57Z"
  },
  {
    "title": "An uncertain world gets more perilous",
    "description": "In a dramatic escalation, the US has bombed Iranian nuclear facilities, prompting strong condemnation and vows of retaliation from Tehran. Donald Trump hailed the strikes as a success, though the extent of damage to Iran's nuclear program remains unclear. Wit…",
    "link": "https://economictimes.indiatimes.com/opinion/et-editorial/an-uncertain-world-gets-more-perilous/articleshow/122009656.cms",
    "timestamp": "2025-06-22T18:36:44Z"
  },
  {
    "title": "Targeting California: Supreme Court joins Trump, GOP in push to curb emissions regs",
    "description": "The Supreme Court has  joined President Donald Trump and congressional Republicans in siding with the oil and gas industry in its challenge to California's drive for electric vehicles.",
    "link": "https://www.bostonherald.com/2025/06/22/targeting-california-supreme-court-joins-trump-gop-in-push-to-curb-emissions-regs/",
    "timestamp": "2025-06-22T18:35:51Z"
  },
  {
    "title": "Democrats Can Say ‘Hitler’ All Day Long, Forget ‘Fact Checks’",
    "description": "The “No Kings” rally against President Donald Trump on June 14 featured several angry speeches from Democrats. Mediaite had this story: “Eric Swalwell ‘Trump Is... Read More\nThe post Democrats Can Say ‘Hitler’ All Day Long, Forget ‘Fact Checks’ appeared first…",
    "link": "https://www.dailysignal.com/2025/06/22/democrats-can-say-hitler-all-day-long-forget-fact-checks/",
    "timestamp": "2025-06-22T18:35:00Z"
  },
  {
    "title": "From Fordow to Faridabad: How one nuclear bombing could cause a Chernobyl-style fallout and contaminate India’s future",
    "description": "The US airstrikes on Iran’s nuclear facilities may not spark a Chernobyl-style disaster, but experts warn of real risks closer to home especially for India. With the jetstream blowing eastward, radioactive particles released in Iran could cross into South Asi…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/from-fordow-to-faridabad-how-one-nuclear-bombing-could-cause-a-chernobyl-style-fallout-and-contaminate-indias-future/articleshow/122009410.cms",
    "timestamp": "2025-06-22T18:34:44Z"
  },
  {
    "title": "Iranian-Aligned Hackers Claim Responsibility for Attack on Trump’s Truth Social Platform",
    "description": "A group of Iranian-aligned hackers has reportedly attacked something President Donald Trump holds dear — his Truth Social platform.\nThe post Iranian-Aligned Hackers Claim Responsibility for Attack on Trump’s Truth Social Platform first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/iranian-aligned-hackers-claim-responsibility-for-attack-on-trumps-truth-social-platform/",
    "timestamp": "2025-06-22T18:32:50Z"
  },
  {
    "title": "Mild US Inflation Is Backdrop for Fed’s Powell on the Hill",
    "description": "(Bloomberg) -- US inflation probably inched higher in May, offering scant evidence of extensive tariff-related repercussions that the Federal Reserve expects...",
    "link": "https://finance.yahoo.com/news/mild-us-inflation-backdrop-fed-200000469.html",
    "timestamp": "2025-06-22T18:32:49Z"
  },
  {
    "title": "'MAGA doesn’t want him': Trump declares war on GOP lawmaker over Iran criticism",
    "description": "On Sunday, Donald Trump had a massive meltdown on a far-right conservative member of the House who is refusing to fall in line and approve of the surprise bombing of Iran.Sunday morning Rep. Thomas Massie (R-KY) appeared on \"Face the Nation,\" and ripped into …",
    "link": "https://www.rawstory.com/trump-massie-maga/",
    "timestamp": "2025-06-22T18:32:42Z"
  },
  {
    "title": "NATO summit to ditch Ukraine meeting – Politico",
    "description": "The upcoming NATO meeting is expected to focus on increasing defense spending and largely leave the Ukraine conflict off the agenda Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620249-nato-summit-ukraine-agenda/",
    "timestamp": "2025-06-22T18:28:19Z"
  },
  {
    "title": "Report: Israel struck Iranian defenses ahead of US Fordow strike",
    "description": "Coordinated Israeli and US strikes targeted Iranian defenses ahead of assault on Fordow nuclear facility.",
    "link": "https://www.israelnationalnews.com/news/410477",
    "timestamp": "2025-06-22T18:27:03Z"
  },
  {
    "title": "Inside Orania — South Africa’s Whites-Only Town",
    "description": "In June CEO of the Orania Movement, gave The Daily Caller a tour of the Afrikaner-only city of Orania and responded to international criticism of the city.",
    "link": "https://dailycaller.com/2025/06/22/orania-south-africa-whites-only-afrikaners/",
    "timestamp": "2025-06-22T18:26:28Z"
  },
  {
    "title": "Furious Warning, Speaks of ‘Unprecedented Level of Danger and Chaos’ After ‘Heinous’ U.S. Strik",
    "description": "Iran’s Foreign Minister Abbas Araghchi delivered blistering remarks on Sunday as he responded to the overnight strikes conducted by the U.S. which, overseen by President Donald Trump, targeted three key Iranian nuclear sites. Araghchi warned of “everlasting,”…",
    "link": "https://freerepublic.com/focus/f-news/4324655/posts",
    "timestamp": "2025-06-22T18:23:35Z"
  },
  {
    "title": "Anti-racism and anti-immigration demonstrations held in Dublin city",
    "description": "O’Connell Bridge closed temporarily amid large Garda presence as groups marched through city",
    "link": "https://www.irishtimes.com/ireland/2025/06/22/anti-racism-and-anti-immigration-demonstrations-held-in-dublin-city/",
    "timestamp": "2025-06-22T18:20:34Z"
  },
  {
    "title": "Dem Rep. Himes: Trump Administration Claim Iran Strikes Were Successful 'Insane'",
    "description": "Representative Jim Himes (D-CT) said Sunday on CNN's \"State of the Union\" that President Donald Trump and Defense Secretary Pete Hegseth's claim that the military strikes had destroyed Iran’s nuclear facilities was \"insane.\"\nThe post Dem Rep. Himes: Trump Adm…",
    "link": "https://www.breitbart.com/clips/2025/06/22/dem-rep-himes-trump-administration-claim-iran-strikes-were-successful-insane/",
    "timestamp": "2025-06-22T18:20:05Z"
  },
  {
    "title": "'I'm sick of it': Marjorie Taylor Greene unloads on Trump for bombing Iran",
    "description": "Rep. Marjorie Taylor Greene (R-GA) lashed out at President Donald Trump's decision to bomb Iran.In a Sunday post on X, Greene gave her thoughts about the president's military operation.\"I don't know anyone in America who has been the victim of a crime or kill…",
    "link": "https://www.rawstory.com/marjorie-taylor-greene-iran-strike/",
    "timestamp": "2025-06-22T18:18:13Z"
  },
  {
    "title": "Auburn's Bruce Pearl maintains Trump 'wants peace,' US isn't at war with Iran",
    "description": "Auburn Tigers men's basketball head coach Bruce Pearl defended President Donald Trump on Saturday after the U.S. military launched strikes on Iran's nuclear sites.",
    "link": "https://www.foxnews.com/sports/auburns-bruce-pearl-maintains-trump-wants-peace-us-isnt-war-iran",
    "timestamp": "2025-06-22T18:16:45Z"
  },
  {
    "title": "Iran Israel war: Will Tehran be saved by 'Axis of Resistance' against USA?",
    "description": "Iran now needs support against Israel and the USA. Tehran now needs the support from Hezbollah, militia group in Iraq, Houthis, and the fall of Syrian President Bashar Assad.",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-israel-war-will-tehran-be-saved-by-axis-of-resistance-against-usa/articleshow/122009372.cms",
    "timestamp": "2025-06-22T18:15:04Z"
  },
  {
    "title": "Shocking new satellite images show damage to Iranian nuclear sites after US's precision attacks on facility",
    "description": "Shocking new satellite images have shown the extent of damage done to Iranian nuclear sites following the US's precise attacks. President Donald Trump last night ordered six B-2 stealth bombers to drop a dozen 30,000-pound 'bunker buster' bombs on the base hi…",
    "link": "https://freerepublic.com/focus/f-news/4324654/posts",
    "timestamp": "2025-06-22T18:14:06Z"
  },
  {
    "title": "Trump Bombed Iran, So We May Soon Know How Many Terrorist Sleeper Cells Came into America Under Biden",
    "description": "Six U.S. B-2 intercontinental manned strategic bombers took out Iran's deepest nuclear bomb development sites today, in what could well prove to be the most historic and important decision President Donald Trump will have made when he leaves office in 2029. T…",
    "link": "https://freerepublic.com/focus/f-chat/4324653/posts",
    "timestamp": "2025-06-22T18:09:24Z"
  },
  {
    "title": "US leaders warn Iran against retaliation after strikes on nuclear facilities",
    "description": "US leaders warn Iran against retaliation after strikes on nuclear facilitiesgo.com",
    "link": "https://abcnews.go.com/Politics/us-leaders-warn-iran-retaliation-after-strikes-nuclear/story?id=123093590",
    "timestamp": "2025-06-22T18:08:46Z"
  },
  {
    "title": "Russian leader claims multiple countries prepped to provide Iran nuclear weapons following US strikes",
    "description": "Former Russian president asserts Iran's nuclear program will continue despite U.S. strikes on key facilities.",
    "link": "https://www.foxnews.com/politics/russian-leader-claims-multiple-countries-prepped-provide-iran-nuclear-weapons-following-us-strikes",
    "timestamp": "2025-06-22T18:07:30Z"
  },
  {
    "title": "‘This is insane’: Mass. pols slam Trump’s decision to bomb Iran",
    "description": "Massachusetts lawmakers swiftly condemned President Donald Trump’s decision to launch air strikes against Iranian nuclear sites, saying the Republican should have sought congressional authorization before taking action.",
    "link": "https://www.thesunchronicle.com/news/local_news/this-is-insane-mass-pols-slam-trump-s-decision-to-bomb-iran/article_54f62a37-b2a1-43af-8bc1-1836953cf0e7.html",
    "timestamp": "2025-06-22T18:07:00Z"
  },
  {
    "title": "Iran Nuclear Facility Captured by Satellite Before and After Bombing",
    "description": "Donald Trump promised the world Iran's key nuclear enrichment facilities were \"completely and totally obliterated,\" ... and now, pictures have come out showing one facility before and after the strike. Satellite images of Fordow -- a uranium…",
    "link": "https://www.tmz.com/2025/06/22/iran-nuclear-facility-fordow-satellite-photo-before-and-after-bombing/",
    "timestamp": "2025-06-22T18:06:18Z"
  },
  {
    "title": "US attack on Iran was carried out ‘in full co-ordination’ with Israel",
    "description": "Netanyahu says he has delivered on promise to destroy Iran’s nuclear facilities",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/22/us-attack-on-iran-was-carried-out-in-full-co-ordination-with-israel/",
    "timestamp": "2025-06-22T18:04:55Z"
  },
  {
    "title": "U.S. officials signal willingness to renew talks with Iran and avoid prolonged war",
    "description": "The Trump administration on Sunday signaled a willingness to renew talks with Iran and avoid a prolonged war in the aftermath of a surprise attack on three of the country’s nuclear sites as U.S. officials assessed Tehran's nuclear ambitions and the threat of …",
    "link": "https://www.pbs.org/newshour/politics/u-s-officials-signal-willingness-to-renew-talks-with-iran-and-avoid-prolonged-war",
    "timestamp": "2025-06-22T17:58:48Z"
  },
  {
    "title": "'Shut Up You Pathetic Little Hypocrite,' Marjorie Taylor Greene Berates AOC After She Called Trump's Iran Attack 'Grounds for Impeachment'",
    "description": "The far-right lawmaker slammed AOC online after she called for President Trump's impeachment for bombing three nuclear sites in Iran Sunday morning.",
    "link": "https://www.ibtimes.com/marjorie-taylor-green-berates-aoc-called-trump-iran-attack-grounds-impeachment-3776456",
    "timestamp": "2025-06-22T17:54:59Z"
  },
  {
    "title": "Trump Warns 'Any Retaliation' by Iran Will Be Met With 'Force Far Greater Than What Was Witnessed Tonight'",
    "description": "President Trump warned Iran against retaliation after the U.S. bombed three nuclear facilities Sunday morning, despite Iran's prior warning to stay out of the conflict.",
    "link": "https://www.ibtimes.com/trump-warns-retaliation-iran-met-force-far-greater-witnessed-tonight-3776450",
    "timestamp": "2025-06-22T17:54:22Z"
  },
  {
    "title": "Pentagon Reveals Details of Secret Raid on Iran",
    "description": "On Sunday the Pentagon revealed new details of its secret \"Operation Midnight Hammer\" attack on Iran's nuclear sites: The Pentagon says at 2:10 a.m. local time, the lead B-2 bomber dropped 2 GBU-57 bunker buster bombs on the first aim point at Fordo. 14 total…",
    "link": "https://freerepublic.com/focus/f-news/4324652/posts",
    "timestamp": "2025-06-22T17:54:18Z"
  },
  {
    "title": "Taking Out Iran’s Nuclear Facilities Could Usher In a New Dawn for Peace and Prosperity In the Middle East",
    "description": "Trump’s strikes on Iran’s nuclear sites appear to mark a pivotal step toward Middle East peace.",
    "link": "https://time.com/7296553/us-iran-strike-israel-trump/",
    "timestamp": "2025-06-22T17:54:07Z"
  },
  {
    "title": "JD Vance says Iran is ‘clearly not very good at war’ and should seek peace while declaring the U.S. has ‘no interest’ in ground troops",
    "description": "Vice President JD Vance urged Tehran to seek peace and laid out the regime’s military failures after U.S. airstrikes on its nuclear sites. President Donald Trump also warned that more attacks would come if Iran didn’t pursue peace. But Iran’s top diplomat sai…",
    "link": "https://biztoc.com/x/b093aab995cd50c2",
    "timestamp": "2025-06-22T17:53:53Z"
  },
  {
    "title": "US Involvement in Israel-Iran War Would Be 'Very, Very Dangerous,' Iranian Foreign Minister Warns",
    "description": "Iranian Foreign Minister Abbas Araghchi stated he will not negotiate with the U.S. until Israel stops bombing, adding that he believes the U.S. has been involved since the beginning.",
    "link": "https://www.ibtimes.com/us-involvement-israel-iran-war-very-dangerous-iranian-foreign-minister-warns-3776411",
    "timestamp": "2025-06-22T17:53:44Z"
  },
  {
    "title": "Mark Cuban turned down offer to be considered for Kamala Harris' VP",
    "description": "'Shark Tank' star Mark Cuban says he turned down an offer to be considered for Kamala Harris' vice president during the 2024 campaign: 'She would have fired me within six days!'",
    "link": "https://ew.com/mark-cuban-turned-down-offer-kamala-harris-vice-president-2024-election-11758984",
    "timestamp": "2025-06-22T17:52:09Z"
  },
  {
    "title": "Full List of Congress Members Backing War Powers Resolution Against Trump",
    "description": "\"Trump's strikes are unconstitutional,\" Congressman Ro Khanna said in a statement emailed to Newsweek.",
    "link": "https://www.newsweek.com/full-list-congress-members-backing-war-powers-resolution-against-trump-2089003",
    "timestamp": "2025-06-22T17:50:54Z"
  },
  {
    "title": "US-Iran: Nobody, including Trump, knows what will happen next",
    "description": "Power is about the ability to shape events, but the US president is largely their prisoner",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/22/us-iran-nobody-including-trump-knows-what-will-happen-next/",
    "timestamp": "2025-06-22T17:49:40Z"
  },
  {
    "title": "Iran may attempt ‘face-saving’ retaliation against US for strikes, expert says",
    "description": "U.S. strikes on three Iranian nuclear facilities could set back Iran's nuclear program by up to a decade, according to a Middle East expert.",
    "link": "https://www.foxnews.com/world/iran-may-attempt-face-saving-retaliation-against-us-strikes-expert-says",
    "timestamp": "2025-06-22T17:49:13Z"
  },
  {
    "title": "'That's irrelevant': Marco Rubio snaps at CBS host over Iran attack details",
    "description": "Secretary of State Marco Rubio did not take kindly to a suggestion on \"Face the Nation\" that the Donald Trump administration jumped the gun by bombing reported nuclear facilities in Iran in a surprise attack on Saturday.Dispatched to explain the administratio…",
    "link": "https://www.rawstory.com/rubio-iran-face-the-nation/",
    "timestamp": "2025-06-22T17:45:55Z"
  },
  {
    "title": "Strait Of Hormuz: Why Iran Is Unlikely To Block Key Oil Shipping Route",
    "description": "Possibility of Iran shutting the Strait of Hormuz, a key lane for Middle Eastern oil and gas shipments, is remote despite U.S. attacks on its nuclear sites. Here's why.",
    "link": "https://www.forbes.com/sites/gauravsharma/2025/06/22/strait-of-hormuz-why-iran-is-unlikely-to-block-key-oil-shipping-route/",
    "timestamp": "2025-06-22T17:45:33Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" June 22, 2025",
    "description": "On this edition of \"Face the Nation,\" Secretary of State Marco Rubio and Sen. Tim Kaine join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-06-22-2025/",
    "timestamp": "2025-06-22T17:45:33Z"
  },
  {
    "title": "India is on the side of peace and humanity: PM Modi to Iran president Pezeshkian",
    "description": "NEW DELHI: Prime Minister Narendra Modi on Sunday conveyed to Iranian President Masoud Pezeshkian India’s “deep concern” over Iran’s conflict with Israel and called for immediate de-escalation of the situation through “dialogue and diplomacy”. The phone conve…",
    "link": "https://statetimes.in/india-is-on-the-side-of-peace-and-humanity-pm-modi-to-iran-president-pezeshkian/",
    "timestamp": "2025-06-22T17:43:27Z"
  },
  {
    "title": "Trump Admin. Pulls Social Security Wait Times to Hide Bad Customer Service",
    "description": "",
    "link": "https://biztoc.com/x/aa5629626f19844b",
    "timestamp": "2025-06-22T17:42:54Z"
  },
  {
    "title": "Will Iran retaliate or capitulate?",
    "description": "Donald Trump says US bombing attacks he ordered have 'totally obliterated' Iran's key nuclear sites.",
    "link": "https://www.aljazeera.com/video/inside-story/2025/6/22/will-iran-retaliate-or-capitulate",
    "timestamp": "2025-06-22T17:42:38Z"
  },
  {
    "title": "Muslim countries urge end to Israel’s ‘aggression’ against Iran",
    "description": "Foreign ministers from countries of the Organisation of Islamic Cooperation (OIC) on Sunday urged Israel to end its “aggression” towards Iran, without mentioning the US strikes on the Islamic republic’s nuclear sites. Arch-rivals Israel and Iran have been at …",
    "link": "https://www.digitaljournal.com/world/muslim-countries-urge-end-to-israels-aggression-against-iran/article",
    "timestamp": "2025-06-22T17:42:20Z"
  },
  {
    "title": "Hegseth: 'World Should Listen' When Trump Speaks",
    "description": "Defense Secretary Pete Hegseth, describing the United States' \"Operation Midnight Hammer\" strikes on Iran's nuclear facilities as an \"incredible and overwhelming success,\" said that the bombings show the world that when President Donald Trump speaks, \"the wor…",
    "link": "https://freerepublic.com/focus/f-news/4324649/posts",
    "timestamp": "2025-06-22T17:42:08Z"
  },
  {
    "title": "Former Kamala Harris Attorney Who Wrote That Trump Is ‘Unfit to Hold Office’ Now Works at Defense Department",
    "description": "A lawyer who worked for Kamala Harris’ Senate office and President Joe Biden’s National Security Council now works in President Donald Trump’s administration as an... Read More\nThe post Former Kamala Harris Attorney Who Wrote That Trump Is ‘Unfit to Hold Offi…",
    "link": "https://www.dailysignal.com/2025/06/22/former-kamala-harris-attorney-who-wrote-trump-is-unfit-hold-office-now-works-defense-department/",
    "timestamp": "2025-06-22T17:40:32Z"
  },
  {
    "title": "WATCH: Even Adam Schiff doesn’t seem to be a fan of AOC’s call to impeach Trump over Iran bombing",
    "description": "'We've seen what a high bar there is to impeachment when one party in Congress, the Republican Party, is willing to work completely in lockstep with the president'",
    "link": "https://www.wnd.com/2025/06/watch-even-adam-schiff-doesnt-seem-be-fan/",
    "timestamp": "2025-06-22T17:35:39Z"
  },
  {
    "title": "Pakistan condemns Trump's bombing of Iran - a day after nominating him for Peace Prize",
    "description": "ISLAMABAD: Pakistan condemned on Sunday (Jun 22) the strikes ordered on its neighbour Iran by Donald Trump, a day after Islamabad had said it would nominate the US President",
    "link": "https://www.channelnewsasia.com/asia/pakistan-condemns-trumps-bombing-iran-day-after-nominating-him-peace-prize-5196846",
    "timestamp": "2025-06-22T17:34:25Z"
  },
  {
    "title": "‘I’m Furious’: Bay Area Leaders Criticize Trump for Foregoing Congress on Iran Strikes",
    "description": "East Bay Rep. Lateefa Simon called the strikes “lawless, dangerous and immoral.” North Coast Rep. Jared Huffman said they’re a “direct violation of the constitution.”",
    "link": "https://www.kqed.org/news/12045408/im-furious-bay-area-leaders-criticize-trump-for-foregoing-congress-on-iran-strikes",
    "timestamp": "2025-06-22T17:33:42Z"
  },
  {
    "title": "‘A Direct Violation’: Bay Area Leaders Criticize Trump for Foregoing Congress on Iran Strikes",
    "description": "Rep. Jared Huffman, who represents the north coast said President Trump’s actions in Iran are not just dangerous, but \"a direct violation of the constitution and Congress’s authority to declare war.\"",
    "link": "https://www.kqed.org/news/12045408/a-direct-violation-bay-area-leaders-criticize-trump-for-foregoing-congress-on-iran-strikes",
    "timestamp": "2025-06-22T17:33:42Z"
  },
  {
    "title": "Netanyahu Says U.S. Strikes On Iran Will “Change History”",
    "description": "Israel's prime minister, Benjamin Netanyahu, has said that the United States' strikes on Iran will change the course of history. It looks like that course is one that will drag the world into another massive war.",
    "link": "https://www.shtfplan.com/headline-news/netanyahu-says-u-s-strikes-on-iran-will-change-history",
    "timestamp": "2025-06-22T17:30:43Z"
  },
  {
    "title": "Netanyahu Says U.S. Strikes On Iran With “Change History”",
    "description": "Israel's prime minister, Benjamin Netanyahu, has said that the United States' strikes on Iran will change the course of history. It looks like that course is one that will drag the world into another massive war.",
    "link": "https://www.shtfplan.com/headline-news/netanyahu-says-u-s-strikes-on-iran-with-change-history",
    "timestamp": "2025-06-22T17:30:43Z"
  },
  {
    "title": "Fact Focus: US and Israeli strikes on Iran nuclear sites pose limited radiation risks",
    "description": "Even if radiation did leak from one of the sites, experts said, the amount would be unlikely to pose a risk to people near the facilities or in the wider region.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_4b7f0fba-4d09-56ba-b1e1-09193e62afcf.html",
    "timestamp": "2025-06-22T17:30:00Z"
  },
  {
    "title": "Tánaiste says efforts are being made to evacuate 15 Irish citizens from Israel",
    "description": "There has been discussion in recent days regarding the potential evacuation of Irish passport holders who are residing in Israel and Iran.",
    "link": "https://www.thejournal.ie/irish-citizens-evacuate-israel-efforts-6740414-Jun2025/",
    "timestamp": "2025-06-22T17:28:32Z"
  },
  {
    "title": "US boosts emergency Mideast evacuations and travel warnings after Trump orders strikes in Iran",
    "description": "By MATTHEW LEE WASHINGTON (AP) — The State Department has doubled the number of emergency evacuation flights it is providing for American citizens wishing to leave Israel, ordered the departure of nonessential staff from the U.S. Embassy in Lebanon and is ste…",
    "link": "https://www.bostonherald.com/2025/06/22/us-boosts-emergency-mideast-evacuations-and-travel-warnings-after-trump-orders-strikes-in-iran/",
    "timestamp": "2025-06-22T17:27:58Z"
  }
]