[
  {
    "title": "Senate Follows House in Killing Biden Reg Imposing Curbs on Energy Use of Walk-In Coolers",
    "description": "Senate Republicans voted to repeal a Biden administration regulation pertaining to walk-in freezers and coolers Thursday, in a move they say will save small-business owners... Read More\nThe post Senate Follows House in Killing Biden Reg Imposing Curbs on Ener…",
    "link": "https://www.dailysignal.com/2025/04/03/senate-follows-house-in-killing-biden-reg-imposing-curbs-on-energy-use-of-walk-in-coolers/",
    "timestamp": "2025-04-03T20:45:19Z"
  },
  {
    "title": "Trump: Netanyahu may visit US next week",
    "description": "US President Donald Trump said he spoke with Israeli Prime Minister Benjamin Netanyahu on Thursday, adding tha",
    "link": "https://www.jpost.com/breaking-news/article-848817",
    "timestamp": "2025-04-03T20:44:04Z"
  },
  {
    "title": "Senate confirms Dr. Oz to oversee Medicare and Medicaid",
    "description": "The former TV host has secured the votes needed to lead CMS.",
    "link": "https://nypost.com/2025/04/03/us-news/us-senate-confirms-trumps-medicare-and-medicaid-nominee-mehmet-oz/",
    "timestamp": "2025-04-03T20:43:48Z"
  },
  {
    "title": "Musk is not the target. We are",
    "description": "'Inadvertently, the left is saying to hell with climate change. We want bigger government'",
    "link": "https://www.wnd.com/2025/04/musk-is-not-the-target-we-are/",
    "timestamp": "2025-04-03T20:43:37Z"
  },
  {
    "title": "Something's Gone Wrong With Microsoft's Huge AI Data Center Investments",
    "description": "Data centers are everywhere. As the world's tech companies demand more compute power to make their software run, the facilities have popped up in every corner of the planet. They makeup the backbone of global network servers, cloud computing, and of course, A…",
    "link": "https://futurism.com/microsoft-huge-data-center-investments-tariffs",
    "timestamp": "2025-04-03T20:43:18Z"
  },
  {
    "title": "A running list of companies that have talked about raising prices due to Trump's tariffs",
    "description": "Trump's tariffs announcement has companies scrambling as their costs increase. Here's which companies have hinted at raising prices.",
    "link": "https://www.businessinsider.com/companies-raising-prices-increases-trump-tariffs-2025",
    "timestamp": "2025-04-03T20:43:14Z"
  },
  {
    "title": "US Senate rejects effort to block arms sales to Israel",
    "description": "The Senate voted 82-15 and 83-15 to reject two resolutions of disapproval over sales of massive bombs and other offensive military equipment.",
    "link": "https://www.jpost.com/international/article-848818",
    "timestamp": "2025-04-03T20:42:55Z"
  },
  {
    "title": "The problem with Trump’s ‘Liberation Day’ tariffs",
    "description": "He should return to his history as a pro-business, pro-markets president as soon as possible",
    "link": "https://www.wnd.com/2025/04/the-problem-with-trumps-liberation-day-tariffs/",
    "timestamp": "2025-04-03T20:41:57Z"
  },
  {
    "title": "HUD Secretary Turner Waives FHA Mortgage Rule to Help L.A. Rebuild",
    "description": "Secretary of Housing and Urban Development (HUD) Scott Turner announced Thursday that his department had waived a key rule that could affect Federal Housing Authority (FHA)-backed loans, to help victims of recent wildfires in Los Angeles.\nThe post HUD Secreta…",
    "link": "https://www.breitbart.com/politics/2025/04/03/hud-secretary-turner-waives-fha-mortgage-rule-to-help-l-a-rebuild/",
    "timestamp": "2025-04-03T20:41:43Z"
  },
  {
    "title": "Federal Appeals Court Pauses Lower Court’s Order on CFPB",
    "description": "A federal appeals court reportedly paused a lower court’s order from last week that reversed President Donald Trump’s actions at the Consumer Financial Protection Bureau (CFPB). At the same time, the appeals court’s ruling left in place provisional agreements…",
    "link": "https://www.pymnts.com/news/cfpb/2025/federal-appeals-court-pauses-lower-courts-order-on-cfpb/",
    "timestamp": "2025-04-03T20:41:37Z"
  },
  {
    "title": "‘We Are Not Kidding!’ CNN’s Dana Bash Roasts Trump for Slapping Tariffs on an Arctic Island Inhabited Solely By Penguins",
    "description": "CNN's Dana Bash on Thursday poked fun at President Donald Trump imposing tariffs on Arctic islands inhabited by penguins and not people.\nThe post ‘We Are Not Kidding!’ CNN’s Dana Bash Roasts Trump for Slapping Tariffs on an Arctic Island Inhabited Solely By P…",
    "link": "https://www.mediaite.com/tv/we-are-not-kidding-cnns-dana-bash-roasts-trump-for-slapping-tariffs-on-an-arctic-island-inhabited-solely-by-penguins/",
    "timestamp": "2025-04-03T20:39:53Z"
  },
  {
    "title": "Trump Invites El Salvador President Nayib Bukele to White House: ‘A Model for Others’",
    "description": "President of El Salvador Nayib Bukele announced on Wednesday that he received an invitation from President Donald Trump to visit the White House on April 14, 2025.\nThe post Trump Invites El Salvador President Nayib Bukele to White House: ‘A Model for Others’ …",
    "link": "https://www.breitbart.com/latin-america/2025/04/03/trump-invites-el-salvador-president-nayib-bukele-to-white-house-a-model-for-others/",
    "timestamp": "2025-04-03T20:39:28Z"
  },
  {
    "title": "Here’s a closer look at Trump’s tariff plan: What to know about the new duties",
    "description": "Trump unveiled the new tariffs in a ceremony at the White House’s Rose Garden on Wednesday for a \"Make America Wealthy Again\" event.",
    "link": "https://www.foxnews.com/politics/heres-close-look-trumps-tariff-plan-what-know-about-new-duties",
    "timestamp": "2025-04-03T20:39:12Z"
  },
  {
    "title": "Is the Great Depression Getting a Sequel? People Cope With Jokes After Trump's Tariffs Announcement",
    "description": "Social media users react to increasing fears over a global trade war and U.S. recession.",
    "link": "https://www.complex.com/life/a/joshua-espinoza/social-media-reactions-great-depression-trump-tariffs",
    "timestamp": "2025-04-03T20:38:54Z"
  },
  {
    "title": "Judge Boasberg Thinks There’s ‘Fair Likelihood’ Trump Administration Violated Court Order With El Salvador Flights",
    "description": "The judge is now deliberating on whether there’s grounds to hold Trump officials in contempt.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/04/03/judge-boasberg-thinks-theres-fair-likelihood-trump-administration-violated-court-order-with-el-salvador-flights/",
    "timestamp": "2025-04-03T20:38:38Z"
  },
  {
    "title": "Senators Make Modest Moves To Reclaim Tariff Powers From Trump",
    "description": "On Wednesday, President Donald Trump made good on his promise to impose tariffs on nearly every nation, principality, and uninhabited island on the planet—an event he dubbed \"Liberation Day.\" The measure would place 10-percent tariffs across the board, with a…",
    "link": "https://biztoc.com/x/58506726e9f22910",
    "timestamp": "2025-04-03T20:38:16Z"
  },
  {
    "title": "Stock market plunges after Trump tariff announcement",
    "description": "The markets closed down around 4% after President Donald Trump’s announcement to slap reciprocal tariffs on global trading partners. The S&P 500 fell 4.8%, while the Nasdaq fell 6% — both their worst since 2020. The Dow Jones Industrial Average declined 4%, o…",
    "link": "https://biztoc.com/x/b77adb67bf779e4c",
    "timestamp": "2025-04-03T20:38:03Z"
  },
  {
    "title": "Trump Won’t Give Up (on) TikTok",
    "description": "The U.S. president has taken negotiations down to the wire to save the popular video-sharing app.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-tiktok-social-media-china-bytedance/",
    "timestamp": "2025-04-03T20:37:55Z"
  },
  {
    "title": "Meghan McCain loses it over indiscretions of fictional character on White Lotus",
    "description": "Meghan McCain continued her war of words Thursday with actor Carrie Coon, who plays \"Laurie\" in Season Three of HBO Max's hit series The White Lotus.\n\nCoon told \nThe Hollywood Reporter that McCain must have felt \"gratified\" at seeing a conservative character …",
    "link": "https://www.rawstory.com/white-lotus-actor-claims-meghan-mccain-is-gratified/",
    "timestamp": "2025-04-03T20:37:48Z"
  },
  {
    "title": "Down Is Up: Kellyanne Conway Hails ‘Positive Reaction’ from U.S. Automaker That Just Laid off 900 Workers Amid Trump Tariffs",
    "description": "Fox News contributor Kellyanne Conway offered an all-time spin job after a major U.S. automaker announced it will temporarily lay off 900 workers in the U.S. \nThe post Down Is Up: Kellyanne Conway Hails ‘Positive Reaction’ from U.S. Automaker That Just Laid o…",
    "link": "https://www.mediaite.com/tv/down-is-up-kellyanne-conway-hails-positive-reaction-from-u-s-automaker-that-just-laid-off-900-workers-amid-trump-tariffs/",
    "timestamp": "2025-04-03T20:37:43Z"
  },
  {
    "title": "Shameless: How a ‘EU aspirant’ silences opponents and threatens them with jail",
    "description": "The detention of regional leader Evgenia Gutsul exposes deepening tensions between Moldova and autonomous Gagauzia Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/615211-democracy-in-name-only/",
    "timestamp": "2025-04-03T20:36:40Z"
  },
  {
    "title": "Distress for Lancaster County museums and libraries as Trump dismantles federal agency",
    "description": "Museum admission discounts for low-income families. Digital reading materials during the COVID-19 pandemic. Funding to recruit new education staff.",
    "link": "https://lancasteronline.com/news/local/distress-for-lancaster-county-museums-and-libraries-as-trump-dismantles-federal-agency/article_5d607c76-3249-478e-884b-e27d46fae812.html",
    "timestamp": "2025-04-03T20:36:00Z"
  },
  {
    "title": "Meghan McCain Fires Back at a Confused Carrie Coon for Saying She’s ‘Gratified’ to See a Republican on ‘The White Lotus’",
    "description": "“Is 'gratified' a new trigger word?\" the actress questions of McCain’s anger\nThe post Meghan McCain Fires Back at a Confused Carrie Coon for Saying She’s ‘Gratified’ to See a Republican on ‘The White Lotus’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/meghan-mccain-carrie-coon-the-white-lotus-republican-character/",
    "timestamp": "2025-04-03T20:35:42Z"
  },
  {
    "title": "Trump slapped tariffs on remote islands with no humans — but a thriving penguin population",
    "description": "President Trump imposed tariffs on Heard Island and McDonald Islands, and several other small island economies, while leaving Russia off his list of targets.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tariffs-heard-mcdonald-islands-russia-australia-rcna199574",
    "timestamp": "2025-04-03T20:35:39Z"
  },
  {
    "title": "Whoopi Goldberg signs off ‘The View’ with call to anti-Trump ‘resistance’",
    "description": "\"The View\" co-host Whoopi Goldberg signed off Thursday's show by rallying the movement resisting President Donald Trump.",
    "link": "https://nypost.com/2025/04/03/us-news/whoopi-goldberg-signs-off-the-view-with-call-to-anti-trump-resistance/",
    "timestamp": "2025-04-03T20:35:25Z"
  },
  {
    "title": "GOP Rep. Mary Miller Plans to Strip Planned Parenthood of Taxpayer Funding Through Reconciliation: ‘Congress Must Fulfill Constitutional Duty’",
    "description": "Republican Rep. Mary Miller (R-IL) has plans to produce legislation that would strip abortion-giant Planned Parenthood of taxpayer funding through budget reconciliation.\nThe post GOP Rep. Mary Miller Plans to Strip Planned Parenthood of Taxpayer Funding Throu…",
    "link": "https://www.breitbart.com/politics/2025/04/03/gop-rep-mary-miller-plans-to-strip-planned-parenthood-of-taxpayer-funding-through-reconciliation-congress-must-fulfill-constitutional-duty/",
    "timestamp": "2025-04-03T20:34:59Z"
  },
  {
    "title": "Dow nosedives 1,600 points, S&P 500 and Nasdaq drop the most since 2020 after Trump’s tariff onslaught",
    "description": "Stocks plummeted Thursday, sending the S&P 500 back into correction territory for its biggest one-day loss since 2020, after President Donald Trump unveiled sweeping tariffs, raising the risk of a global trade war that plunges the economy into a recession.The…",
    "link": "https://freerepublic.com/focus/f-news/4308667/posts",
    "timestamp": "2025-04-03T20:34:31Z"
  },
  {
    "title": "At Least the Memes About the Stock Market Are Good",
    "description": "Donald Trump’s sweeping tariffs have sent the stock market into free fall, which seems … pretty bad? At least people are writing funny tweets and posting good memes about it.",
    "link": "http://www.thecut.com/article/best-tweets-memes-trump-tariffs-economy-market-crash.html",
    "timestamp": "2025-04-03T20:34:02Z"
  },
  {
    "title": "Trump Tariffs Target Both China and U.S. Allies in Asia",
    "description": "The move is a blow to China, but it could also harm U.S. interests in the region.",
    "link": "http://foreignpolicy.com/2025/04/03/trump-tariffs-asia-china-japan-taiwan-south-korea/",
    "timestamp": "2025-04-03T20:34:01Z"
  },
  {
    "title": "There Is Only One Way to Make Sense of the Tariffs",
    "description": "The policy is absurd. It’s also an extension of Trump’s chaotic personality.",
    "link": "https://www.theatlantic.com/politics/archive/2025/04/tariffs-trump-outcomes-incompatible/682286/",
    "timestamp": "2025-04-03T20:33:55Z"
  },
  {
    "title": "Toronto Wants to Woo Foreign Listings Despite Trump Market Chaos",
    "description": "The head of the Toronto Stock Exchange is counting on recent market volatility to sway some companies towards listing in Canada this year, even as tariff-fueled uncertainty dries up risk appetite across the globe.",
    "link": "https://financialpost.com/pmn/business-pmn/toronto-wants-to-woo-foreign-listings-despite-trump-market-chaos",
    "timestamp": "2025-04-03T20:32:38Z"
  },
  {
    "title": "OpenAI Raises $40 Billion, Runway AI Video $380 Million, Amazon, Oracle, TikTok Suitors Await Decision",
    "description": "OpenAI raises $40B, Trump weighs in on TikTok, Runway’s $380 M raise and its stunning Gen-4 AI model, Anthropic warns: AI may lie, plus vibe filmmaking with Deepmind.",
    "link": "https://www.forbes.com/sites/charliefink/2025/04/03/openai-raises-40-billion-runway-ai-video-380-million-amazon-oracle-tiktok-suitors-await-decision/",
    "timestamp": "2025-04-03T20:32:11Z"
  },
  {
    "title": "Child Care Funding Cuts Will Compound Crises for Generations to Come",
    "description": "Access to child care is already inadequate across the US. Trump's funding cuts to Head Start will make it far worse.",
    "link": "https://truthout.org/articles/child-care-funding-cuts-will-compound-crises-for-generations-to-come/",
    "timestamp": "2025-04-03T20:31:30Z"
  },
  {
    "title": "Trump tariffs breach NATO rules – Norway",
    "description": "Norwegian Foreign Minister Espen Barth Eide has said the new US trade policy may violate the military bloc’s economic commitments Read Full Article at RT.com",
    "link": "https://www.rt.com/news/615208-us-violates-nato-rules/",
    "timestamp": "2025-04-03T20:30:19Z"
  },
  {
    "title": "Trump: The Economy Crashing Is Good, Actually",
    "description": "Donald Trump thinks everything is going just fine with his insane tariffs.\r\nIn his lone statement about the tariffs Thursday, Trump didn’t seem bothered when a reporter asked him “The markets today are way down. The worst day in years. Because of the tariffs.…",
    "link": "https://newrepublic.com/post/193592/trump-economy-crashing-good-actually",
    "timestamp": "2025-04-03T20:30:17Z"
  },
  {
    "title": "Trump Must Pay Legal Fees Over Steele Dossier Lawsuit",
    "description": "A London judge ruled Donald Trump must pay $821,500 in legal fees to a private investigations firm the sued over a dossier which alleged ties between his 2016 election campaign and Russia, Reuters reports.",
    "link": "https://politicalwire.com/2025/04/03/trump-must-pay-legal-fees-over-steele-dossier-lawsuit/",
    "timestamp": "2025-04-03T20:30:17Z"
  },
  {
    "title": "Why Trump's Smithsonian executive order is especially painful (Shalise Manza Young/The Contrarian)",
    "description": "Shalise Manza Young / The Contrarian:\nWhy Trump's Smithsonian executive order is especially painful  —  President Donald Trump has been signing executive orders at the pace of a teenager posting to Snapchat, and, for the most part, they are press releases tha…",
    "link": "https://www.memeorandum.com/250403/p124",
    "timestamp": "2025-04-03T20:30:02Z"
  },
  {
    "title": "Venezuela Stages Rally to Demand Release of Tren de Aragua Members Jailed in El Salvador",
    "description": "Venezuelan Foreign Minister Yván Gil demanded on Wednesday that the international community \"put on their pants\" and act to \"free\" the Venezuelan illegal migrants detained in El Salvador.\nThe post Venezuela Stages Rally to Demand Release of Tren de Aragua Mem…",
    "link": "https://www.breitbart.com/latin-america/2025/04/03/venezuela-stages-rally-to-demand-release-of-tren-de-aragua-members-jailed-in-el-salvador/",
    "timestamp": "2025-04-03T20:27:24Z"
  },
  {
    "title": "Fintech stocks such as Affirm, PayPal plunge on concern Trump tariffs will hurt consumer spending",
    "description": "The global market rout on Thursday, sparked by President Donald Trump's announcement of widespread tariffs, had an outsized effect on fintech companies and credit card issuers that are closely tied to consumer spending and credit.\nAffirm, which offers buy now…",
    "link": "https://biztoc.com/x/5c990674be85abe2",
    "timestamp": "2025-04-03T20:27:19Z"
  },
  {
    "title": "Republican Senator Warns Tariffs Cost U.S. Businesses Access to Markets: ‘And They Don’t Come Back’",
    "description": "\"I think we ought to be focused on our economic adversaries and be... less damaging to our economic allies,” said Sen. Jerry Moran\nThe post Republican Senator Warns Tariffs Cost U.S. Businesses Access to Markets: ‘And They Don’t Come Back’ first appeared on M…",
    "link": "https://www.mediaite.com/news/republican-senator-warns-tariffs-cost-u-s-businesses-access-to-markets-and-they-dont-come-back/",
    "timestamp": "2025-04-03T20:27:17Z"
  },
  {
    "title": "Macron Calls For Suspension Of Investment In US Until Tariffs Clarified",
    "description": "French President Emmanuel Macron on Thursday called for a suspension of investment in the United States until Donald Trump's \"brutal and unfounded\" new tariffs against Europe and the rest of the world were clarified.",
    "link": "https://www.ibtimes.com/macron-calls-suspension-investment-us-until-tariffs-clarified-3768745",
    "timestamp": "2025-04-03T20:27:07Z"
  },
  {
    "title": "Did Kid Rock's Suit From White House Visit Violate US Flag Code?",
    "description": "Kid Rock turned heads with his American flag suit during an April 2025 White House visit — but did he also break the law and violate flag code?",
    "link": "https://loudwire.com/kid-rock-white-house-suit-flag-code/",
    "timestamp": "2025-04-03T20:26:43Z"
  },
  {
    "title": "D-FW Fortune 500s lose $49 billion as tariffs take toll on stock markets",
    "description": "Dallas-Fort Worth’s Fortune 500 companies lost $49 billion in market value Thursday by the close of trading. Investors retreated after President Donald Trump...",
    "link": "https://www.dallasnews.com/business/economy/2025/04/03/d-fw-fortune-500s-lose-49-billion-as-tariffs-take-toll-on-stock-markets/",
    "timestamp": "2025-04-03T20:26:16Z"
  },
  {
    "title": "Why is Trump rewriting US economic history? Anyone? | CNN Politics",
    "description": "President Donald Trump wants Americans to see history his way, historians be damned.",
    "link": "https://www.cnn.com/2025/04/03/politics/why-is-trump-rewriting-us-economic-history/index.html",
    "timestamp": "2025-04-03T20:25:50Z"
  },
  {
    "title": "EXCLUSIVE: Biden Department of Education Met With Far-Left Groups While Discussing Pro-Trans Title IX Rewrite",
    "description": "FIRST ON THE DAILY SIGNAL—The Department of Education’s Office for Civil Rights under President Joe Biden held multiple stakeholder meetings with leftist groups—including the Human... Read More\nThe post EXCLUSIVE: Biden Department of Education Met With Far-Le…",
    "link": "https://www.dailysignal.com/2025/04/03/exclusive-biden-department-education-met-far-left-groups-while-discussing-pro-trans-title-ix-rewrite-woketopus/",
    "timestamp": "2025-04-03T20:24:14Z"
  },
  {
    "title": "US Stocks Plunge After Tariff Move, S&P 500 Sees Biggest Decline Since 2020",
    "description": "US stocks plunged Thursday as traders reacted to Donald Trump&#039;s sweeping tariff announcement a day earlier, with the broad-based S&amp;P 500 recording its biggest one-day decline since 2020.",
    "link": "https://www.ndtv.com/world-news/donald-trump-trump-tariffs-reciprocal-tariffs-us-stocks-plunge-after-tariff-move-s-p-500-sees-biggest-decline-since-2020-8081676",
    "timestamp": "2025-04-03T20:23:59Z"
  },
  {
    "title": "Russia calls Trump threats to bomb Iran ‘illegal and unacceptable’",
    "description": "Trump has warned there could be direct conflict if Iran doesn’t halt its nuclear program.",
    "link": "https://nypost.com/2025/04/03/world-news/russia-calls-trump-threats-to-bomb-iran-illegal-and-unacceptable/",
    "timestamp": "2025-04-03T20:23:53Z"
  },
  {
    "title": "Dow drops 1,600 as US stocks lead worldwide sell-off after Trump’s tariffs cause a COVID-like shock",
    "description": "Financial markets around the world reeled following President Donald Trump’s latest and most severe set of tariffs, and the U.S. stock market took the worst of it. The S&P 500 fell 4.8% Thursday, more than other major stock markets. The Dow Jones Industrial A…",
    "link": "https://www.whec.com/business/dow-drops-1600-as-us-stocks-lead-worldwide-sell-off-after-trumps-tariffs-cause-a-covid-like-shock/",
    "timestamp": "2025-04-03T20:23:50Z"
  },
  {
    "title": "'No bottles being popped' as Manitoba grapples with impacts of tariffs, premier says",
    "description": "Canada was largely spared in U.S. President Donald Trump’s long-feared plan to impose tariffs on imports from dozens of countries, but Manitoba's premier said Thursday there are still \"no bottles being popped today.\"",
    "link": "https://www.cbc.ca/news/canada/manitoba/tariffs-premier-reaction-1.7501402",
    "timestamp": "2025-04-03T20:20:56Z"
  },
  {
    "title": "Oh, Laura Loomer Is Now Running The National Security Council. IS THAT FINE?",
    "description": "Why wouldn't it be fine? It's TrumpWorld! Anything goes!",
    "link": "https://www.wonkette.com/p/oh-laura-loomer-is-now-running-the",
    "timestamp": "2025-04-03T20:20:46Z"
  },
  {
    "title": "Manitoba premier says federal tariff retaliation is supported across the board",
    "description": "WINNIPEG — Manitoba Premier Wab Kinew says he and other provincial leaders are backing the federal government’s response to tariffs imposed by the United States. Kinew says there was broad consensus in a virtual meeting Thursday with Prime Minister Mark Carne…",
    "link": "https://financialpost.com/pmn/manitoba-premier-says-federal-tariff-retaliation-is-supported-across-the-board",
    "timestamp": "2025-04-03T20:19:02Z"
  },
  {
    "title": "Should I buy the NDQ ETF after the Wall Street's crash?",
    "description": "Fear is taking over the share market but is this the best time to buy?\nThe post Should I buy the NDQ ETF after the Wall Street's crash? appeared first on The Motley Fool Australia.",
    "link": "https://www.fool.com.au/2025/04/04/should-i-buy-the-ndq-etf-after-wall-streets-crash/",
    "timestamp": "2025-04-03T20:18:25Z"
  },
  {
    "title": "Dow drops nearly 1,680 in biggest wipeout since 2020 as fears of fallout from tariffs shake markets",
    "description": "Financial markets around the world reeled following President Donald Trump’s latest and most severe set of tariffs, and the U.S. stock market took the worst of it.",
    "link": "https://www.local10.com/business/2025/04/03/stock-market-today-asian-markets-slip-following-trumps-announcements-of-big-tariff-hikes/",
    "timestamp": "2025-04-03T20:17:18Z"
  },
  {
    "title": "B.C. premier wants to bring in more U.S. immigrants, denounces talk of western separatism",
    "description": "David Eby said immigrants from the United States could help bolster the local economy. He said he will be meeting with Mark Carney next week to discuss issues facing the province.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-us-immigrants-1.7501375",
    "timestamp": "2025-04-03T20:17:02Z"
  },
  {
    "title": "Meta Stock Drops 9% Thursday As Tariff Fears Shake Tech Sector: What You Need To Know",
    "description": "Meta Platforms Inc. (NASDAQ:META) shares traded lower on Thursday as broader markets reacted to President Donald Trump's sweeping tariff plan.\nWhat To Know: The Trump administration announced reciprocal tariffs on several countries on Wednesday. Trump invoked…",
    "link": "https://biztoc.com/x/c7adf77270095d0c",
    "timestamp": "2025-04-03T20:16:38Z"
  },
  {
    "title": "Exclusive — JD Vance on ‘Liberation Day’ Tariffs: ‘First Time’ in Decades ‘We Have an American President Saying No More’ to U.S. Being World’s ‘Piggy Bank’",
    "description": "WASHINGTON — Vice President JD Vance told Breitbart News exclusively on Wednesday evening that for the “first time in probably 40 years,” the United States has a president in President Donald Trump who is reversing the trend of the U.S. serving as a “piggy ba…",
    "link": "https://freerepublic.com/focus/f-news/4308663/posts",
    "timestamp": "2025-04-03T20:16:26Z"
  },
  {
    "title": "'Horrifying Consequence Of Trump's Tariffs': Schumer Blames Trump Tariffs For Stellantis Layoffs",
    "description": "Major corporations have already begun announcing layoffs on Thursday as President Donald Trump's sweeping new tariff structure is set to take effect. \nWhat To Know: One of the Big Three automakers, Stellantis N.V. (NYSE:STLA), said on Thursday that it will be…",
    "link": "https://biztoc.com/x/6ef963aa1d06e014",
    "timestamp": "2025-04-03T20:16:13Z"
  },
  {
    "title": "The real reason Trump is destroying the economy",
    "description": "President Donald Trump displays a signed executive order imposing tariffs on imported goods at the White House on April 2, 2025. | Chip Somodevilla/Getty Images\nThe Trump administration’s tariffs are, by every reasonable account, an economic catastrophe in th…",
    "link": "https://biztoc.com/x/19009784484e6db7",
    "timestamp": "2025-04-03T20:16:10Z"
  },
  {
    "title": "How the White House calculated Trump’s sweeping new tariffs",
    "description": "President Donald Trump promised tariffs that would raise U.S. import taxes high enough to mirror what other assess as trade penalties on American goods. What he’s actually imposing is based on far more complicated math.",
    "link": "https://biztoc.com/x/020a43f416afd897",
    "timestamp": "2025-04-03T20:16:05Z"
  },
  {
    "title": "Commerce Secretary Ridiculed For Urging Americans To 'Trust Trump' Because He 'Knows What He's Doing': 'He Can't Even Run A Casino'",
    "description": "Howard Lutnick defended Trump amid stock market turmoil, urging Americans to \"trust Trump\" to handle the economy despite his history of business bankruptcies.",
    "link": "https://www.ibtimes.com/commerce-secretary-ridiculed-urging-americans-trust-trump-because-he-knows-what-hes-doing-3768742",
    "timestamp": "2025-04-03T20:15:51Z"
  },
  {
    "title": "Panel: Only Certainty Under Tariffs Is Vehicle Prices Are Going Up",
    "description": "Vehicle prices are forecast to only go up after the Trump administration imposed tariffs on vehicles and parts.",
    "link": "https://www.forbes.com/sites/billkoenig/2025/04/03/panel-only-certainty-under-tariffs-is-vehicle-prices-are-going-up/",
    "timestamp": "2025-04-03T20:14:04Z"
  },
  {
    "title": "EXCLUSIVE: MA School District Rolls Out New DEI Positions Despite Trump’s Orders",
    "description": "A Massachusetts school district has announced new job openings for staff affinity group coordinators, a report released Thursday found.",
    "link": "https://dailycaller.com/2025/04/03/exclusive-ma-school-district-rolls-out-new-dei-positions-despite-trumps-orders/",
    "timestamp": "2025-04-03T20:13:43Z"
  },
  {
    "title": "The real reason Trump is destroying the economy",
    "description": "The Trump administration’s tariffs are, by every reasonable account, an economic catastrophe in the making. So why are they happening? One explanation is that this is simply democracy at work. President Donald Trump campaigned on doing more or less exactly wh…",
    "link": "https://www.vox.com/politics/407053/trump-tariff-expensive-democracy-authoritarianism-breakdown",
    "timestamp": "2025-04-03T20:13:42Z"
  },
  {
    "title": "Dutton, Albanese respond to Trump’s wild tariffs",
    "description": "At the end of the election campaign's first week, we take a look at the leaders' responses to Trump's extraordinary 'Liberation Day' tariffs, from Albo's five-point plan to Dutton's mixed-up message.\nThe post Dutton, Albanese respond to Trump’s wild tariffs a…",
    "link": "http://www.crikey.com.au/2025/04/04/2025-federal-election-albanese-dutton-trump-tariffs/",
    "timestamp": "2025-04-03T20:13:39Z"
  },
  {
    "title": "Stocks Suffer Worst Day Since 2020 Amid Trump's Sweeping Tariffs",
    "description": "Trump's sweeping tariffs sent Wall Street into its worst day since June 2020, even as Trump promised a market \"boom.\"",
    "link": "https://www.newsweek.com/stocks-worst-day-trump-tariffs-wall-street-2055080",
    "timestamp": "2025-04-03T20:13:24Z"
  },
  {
    "title": "'They're ripping us off': Trump's long-standing grievance driving his risky tariffs",
    "description": "For decades, President Donald Trump has alleged that other countries have been \"ripping us off.\" An international expert, however says that's an oversimplification.",
    "link": "https://abcnews.go.com/Politics/theyre-ripping-us-off-trumps-long-standing-grievance/story?id=120447216",
    "timestamp": "2025-04-03T20:12:04Z"
  },
  {
    "title": "California Democrats Kill Bills to Protect Girls Sports, Despite Pressure on Newsom",
    "description": "California Democrat lawmakers killed two bills meant to protect girls sports Tuesday despite pressure on Democrat Gov. Gavin Newsom to limit girls and women’s sports... Read More\nThe post California Democrats Kill Bills to Protect Girls Sports, Despite Pressu…",
    "link": "https://www.dailysignal.com/2025/04/03/california-democrats-kill-bills-protect-girls-sports-despite-pressure-newsom/",
    "timestamp": "2025-04-03T20:10:23Z"
  },
  {
    "title": "The Irish Times view on the Dublin airport cap: will politicians or the courts finally decide?",
    "description": "A legislative route to finding a solution would allow the Government to balance the varying interests involved",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/04/03/the-irish-times-view-on-the-dublin-airport-cap-will-politicians-or-the-courts-finally-decide/",
    "timestamp": "2025-04-03T20:10:00Z"
  },
  {
    "title": "The Supreme Court Blesses the FDA's Rejection of Flavored Nicotine Vapes",
    "description": "In a unanimous decision on Wednesday, the Supreme Court rejected an appeals court's conclusion that the Food and Drug Administration (FDA) violated the",
    "link": "https://reason.com/2025/04/03/the-supreme-court-blesses-the-fdas-rejection-of-flavored-nicotine-vapes/",
    "timestamp": "2025-04-03T20:10:00Z"
  },
  {
    "title": "Report: Cybertruck owners want to return their vehicles. Tesla says no",
    "description": "As Tesla faces headwinds in 2025, the company is reportedly refusing to accept its own product, the Cybertruck, as a trade-in for a new vehicle.",
    "link": "https://www.masslive.com/business/2025/04/report-cybertruck-owners-want-to-return-their-vehicles-tesla-says-no.html",
    "timestamp": "2025-04-03T20:09:02Z"
  },
  {
    "title": "Alabama Lawmakers Introduce Bitcoin Reserve Bill as Institutional Appetite Grows",
    "description": "Alabama lawmakers have introduced a bill to allow the state investment in Bitcoin. This follows a string of similar legislations since President Trump’s inauguration.",
    "link": "https://zycrypto.com/alabama-lawmakers-introduce-bitcoin-reserve-bill-as-institutional-appetite-grows/",
    "timestamp": "2025-04-03T20:08:49Z"
  },
  {
    "title": "It's tariff time. How will tariffs impact you?",
    "description": "President Trump announced a blanket tariff on all imports to the U.S., and additional, specific tariffs on dozens of countries. How will this change in trade policy impact consumers? \nThis episode: White House correspondents Deepa Shivaram and Danielle Kurtzl…",
    "link": "https://www.npr.org/2025/04/03/1242489335/its-tariff-time-how-will-tariffs-impact-you",
    "timestamp": "2025-04-03T20:08:37Z"
  },
  {
    "title": "How Much Will iPhone and Other Apple Prices Increase With 'Liberation Day' Tariffs?",
    "description": "Some tech prices have already risen but experts warn against panic-buying.",
    "link": "https://www.cnet.com/personal-finance/banking/how-much-will-iphone-and-other-apple-prices-increase-with-liberation-day-tariffs/",
    "timestamp": "2025-04-03T20:08:00Z"
  },
  {
    "title": "All Trade is Reciprocal. Trump's Tariffs Interfere With That Reciprocity.",
    "description": "President Donald Trump's \"Liberation Day\" massive tax hikes—err, tariffs—are here, and the effects are already apparent in stock market selloffs, layoffs,",
    "link": "https://reason.com/2025/04/04/all-trade-is-reciprocal-trumps-tariffs-interfere-with-that-reciprocity/",
    "timestamp": "2025-04-03T20:07:51Z"
  },
  {
    "title": "‘Attack on the Global Trade Order’ Cries German Chancellor, Warning Trump’s Tariffs ‘Fundamentally Wrong’",
    "description": "Germany’s outgoing Chancellor voices the frustrations felt across the European ruling class at President Donald Trump tearing up the status quo on trade, decrying an “attack”.The European Union, which has been hit with tariffs twice as high as post-Brexit Bri…",
    "link": "https://freerepublic.com/focus/f-news/4308660/posts",
    "timestamp": "2025-04-03T20:07:45Z"
  },
  {
    "title": "Revolving Door Round-Up: Antonia Hylton and Elise Jordan to Co-Host The Weekend",
    "description": "Steve Kornacki will stay with NBC News after MSNBC breaks off into SpinCo.",
    "link": "https://www.adweek.com/tvnewser/revolving-door-round-up-antonia-hylton-and-elise-jordan-to-co-host-the-weekend/",
    "timestamp": "2025-04-03T20:07:07Z"
  },
  {
    "title": "Fintech stocks like Affirm, PayPal plunge on concern Trump tariffs will hurt consumer spending",
    "description": "Fintech and credit card stocks were hit particularly hard in the market rout that followed President Donald Trump's tariff announcement.",
    "link": "https://www.cnbc.com/2025/04/03/affirm-paypal-fintechs-plunge-on-concerns-trump-tariffs-hit-consumer.html",
    "timestamp": "2025-04-03T20:06:59Z"
  },
  {
    "title": "Hungary to withdraw from International Criminal Court as Israeli PM Netanyahu visits",
    "description": "Hungary to withdraw from International Criminal Court as Israeli PM Netanyahu visitsgo.com",
    "link": "https://abcnews.go.com/International/hungary-withdraw-international-criminal-court-asisraeli-pm-netanyahu/story?id=120453408",
    "timestamp": "2025-04-03T20:06:44Z"
  },
  {
    "title": "'Vibe Governing': Trump's Tariff Formula Eerily Similar to ChatGPT Suggestions, Experts Say",
    "description": "Did the White House “vibe code” the trade-deficit ratio with AI to generate a formula to crash stock markets? The evidence is compelling.",
    "link": "https://decrypt.co/313213/trump-tariff-formula-similar-chatgpt-suggestions",
    "timestamp": "2025-04-03T20:06:35Z"
  },
  {
    "title": "Judge to decide jurisdiction in case of Tufts student grabbed by ICE",
    "description": "The case to free a Tufts PhD student and vocally pro-Palestine Turkish national after she was detained last week took a step forward in court Thursday, with the defense and government contesting the state jurisdiction of the case.",
    "link": "https://www.bostonherald.com/2025/04/03/judge-to-decide-jurisdiction-in-case-of-tufts-student-grabbed-by-ice/",
    "timestamp": "2025-04-03T20:05:37Z"
  },
  {
    "title": "What Trump's sweeping tariffs mean for the US economy and you?",
    "description": "The tariffs will be a 'huge, huge shock to the economy,' one expert said.",
    "link": "https://abcnews.go.com/Business/trumps-sweeping-tariffs-us-economy/story?id=120457570",
    "timestamp": "2025-04-03T20:05:30Z"
  },
  {
    "title": "Trump announced double-digit tariffs on dozens of countries. Here's what the US imports from some of the most affected ones",
    "description": "President Donald Trump announced a range of tariffs on dozens of countries.\nBrendan SMIALOWSKI / AFP via Getty Images\nTrump announced double-digit broad tariffs on imported goods from dozens of countries.\nThey included new levies on all goods from key trading…",
    "link": "https://biztoc.com/x/028d11a87c5ebb81",
    "timestamp": "2025-04-03T20:05:00Z"
  },
  {
    "title": "Macron calls Trump's tariffs 'brutal and unfounded' – video",
    "description": "The French president, Emmanuel Macron, called the tariffs introduced by the US president, Donald Trump, 'brutal and unfounded'. Trump unveiled a 10% minimum tariff on most goods imported to the US, with a higher 20% rate for the EU. Macron said European count…",
    "link": "https://biztoc.com/x/f3479f5769653746",
    "timestamp": "2025-04-03T20:04:56Z"
  },
  {
    "title": "Trump Says Market Reaction to Tariffs ‘Going Very Well’",
    "description": "President Donald Trump says \"the markets are going to boom, the stock is going to boom, the country is going to boom,\" as a result of his global tariffs which caused financial markets around the world to plummet Thursday.\n\"I think it's going very well,\" Trump…",
    "link": "https://biztoc.com/x/e0585ceb08916e1f",
    "timestamp": "2025-04-03T20:04:49Z"
  },
  {
    "title": "US closes deep in red, Dow tumbles 1,680 points",
    "description": "Major stock markets in the United States ended Thursday's trading session with sharp losses, with the Dow Jones plummeting almost 1,700 points. Global markets crashed after President Donald Trump intr...",
    "link": "https://biztoc.com/x/5678891cae34faed",
    "timestamp": "2025-04-03T20:04:46Z"
  },
  {
    "title": "Donald Trump's Tariffs Hit One of His Biggest Donors",
    "description": "U.S. tariffs may lead to \"potential changes to pricing, availability, and lead times for specific items,\" says a Wisconsin-based company owned by a Trump donor.",
    "link": "https://biztoc.com/x/22f065bef3d78f5e",
    "timestamp": "2025-04-03T20:04:44Z"
  },
  {
    "title": "Senators Make Modest Moves To Reclaim Tariff Powers From Trump",
    "description": "A small but growing bipartisan movement in the Senate is pushing back against the president's imposition of tariffs, but there's plenty of room to go further.",
    "link": "https://reason.com/2025/04/03/senators-make-modest-moves-to-reclaim-tariff-powers-from-trump/",
    "timestamp": "2025-04-03T20:04:24Z"
  },
  {
    "title": "Is Elon Musk Stepping Down From DOGE? What Trump Says",
    "description": "President Trump has reportedly informed his Cabinet that the billionaire will step down from his administration role in the coming months. Find out more.",
    "link": "https://hollywoodlife.com/2025/04/03/is-elon-musk-stepping-down-from-doge/",
    "timestamp": "2025-04-03T20:04:11Z"
  },
  {
    "title": "Senate Banking Committee Advances SEC Chair Nominee in Party-Line Vote",
    "description": "The Senate Banking Committee voted Thursday (April 3) to advance President Donald Trump’s nominee as chair of the Securities and Exchange Commission (SEC), Paul Atkins, to the full Senate, which will vote whether to confirm the appointment. The committee’s vo…",
    "link": "https://www.pymnts.com/news/regulation/2025/senate-banking-committee-advances-securities-exchange-commission-chair-nominee-party-line-vote/",
    "timestamp": "2025-04-03T20:04:09Z"
  },
  {
    "title": "How the White House calculated Trump’s sweeping new tariffs",
    "description": "President Donald Trump promised tariffs that would raise U.S. import taxes high enough to mirror what other assess as trade penalties on American goods. What he’s actually imposing is based on far more complicated math.",
    "link": "https://www.pbs.org/newshour/politics/how-the-white-house-calculated-trumps-sweeping-new-tariffs",
    "timestamp": "2025-04-03T20:04:09Z"
  },
  {
    "title": "‘He Wanted the Numbers to Be Huge’: Why Trump’s Tariffs Are So Insane",
    "description": "With his haphazard tariff plan based around “big numbers,” the president has created even more economic uncertainty and left experts dumbfounded",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-tariff-plan-big-numbers-no-economic-sense-1235310273/",
    "timestamp": "2025-04-03T20:02:12Z"
  },
  {
    "title": "Donald Trump's Tariffs Hit One of His Biggest Donors",
    "description": "U.S. tariffs may lead to \"potential changes to pricing, availability, and lead times for specific items,\" says a Wisconsin-based company owned by a Trump donor.",
    "link": "https://www.newsweek.com/donald-trump-tariffs-donors-canada-wholesale-2055066",
    "timestamp": "2025-04-03T20:01:31Z"
  },
  {
    "title": "Elie Mystal ‘Really Worried’ He Could ‘Get Snatched Up Off The Street’ By Trump Admin For His Articles",
    "description": "Elie Mystal said during a Thursday interview that he is truly concerned about President Donald Trump's administration snatching him up over his articles.",
    "link": "https://dailycaller.com/2025/04/03/elie-mystal-really-worried-snatched-street-trump-admin-articles/",
    "timestamp": "2025-04-03T20:01:30Z"
  },
  {
    "title": "Here's What Happened Today: Thursday",
    "description": "The shadow of Trump’s tariffs looms, the Tánaiste asked for give and take, and a new bird visits Ireland.",
    "link": "https://www.thejournal.ie/heres-what-happened-today-thursday-68-6667865-Apr2025/",
    "timestamp": "2025-04-03T20:01:29Z"
  },
  {
    "title": "Can Trump serve third term? Yale Law prof sees ‘possible loophole’ to 22nd Amendment ban",
    "description": "Can President Donald Trump serve a third term? The 22nd Amendment appears to prevent it. “No person shall be elected to the office of the president more than twice,” it reads. But could a president serve a third term if he isn’t “elected” to the office?",
    "link": "https://www.abajournal.com/news/article/can-trump-serve-a-third-term-yale-law-prof-acknowledges-possible-loophole-to-22nd-amendment-ban",
    "timestamp": "2025-04-03T20:01:00Z"
  },
  {
    "title": "Bitcoin Rejected At Descending Resistance Again – Is $78,600 Still In Play?",
    "description": "Bitcoin is facing a crucial test as it struggles to break above key resistance levels while holding just above critical support. The market remains stuck in a tight range, reflecting growing indecisiveness among traders and investors. Uncertainty has become t…",
    "link": "http://www.newsbtc.com/bitcoin-news/bitcoin-rejected-at-descending-resistance-again-is-78600-still-in-play/",
    "timestamp": "2025-04-03T20:00:45Z"
  }
]