[
  {
    "title": "President Donald Trump Goes On Angry Rant Against President Vladimir Putin, X Points Out The Issue",
    "description": "President Donald Trump goes on an angry rant against Russian President Vladimir Putin, users on X reacts to the missive.",
    "link": "https://hiphopwired.com/playlist/president-donald-trump-truth-social-rant-president-vladimir-putin-reactions/",
    "timestamp": "2025-05-27T19:05:32Z"
  },
  {
    "title": "Trump Proclaims Border Patrol Day, Boasts Historic Crackdown",
    "description": "President Donald Trump has proclaimed May 28, 2025, as a day to honor the United States Border Patrol (USBP) on its 101st anniversary, praising agents as “guardians of our sovereignty” and sharply criticizing Democrats for refusing to mark the occasion. \nIn a…",
    "link": "https://biztoc.com/x/1fb6614dec9b0a40",
    "timestamp": "2025-05-27T19:04:42Z"
  },
  {
    "title": "Trump's image of America is straight out of Shogun: columnist",
    "description": "President Donald Trump's economic policies are turning the U.S. into 'a nation of serfs,' according to Slate senior writer Ben Mathis-Lilley\r\n.\n\n“So far, the story of the Trump administration when it comes to the economy is a tale of two countries,” Mathis-Li…",
    "link": "https://www.rawstory.com/trump-economics-2672214880/",
    "timestamp": "2025-05-27T19:04:25Z"
  },
  {
    "title": "Venezuelan public school student in NY detained at immigration court",
    "description": "People pray outside of immigration court as people enter at Federal Plaza Immigration Court on May 8, 2025, in New York City.\n \n\nThe arrest is believed to be the first of a student in NYC under President Trump’s 2d term. [ more › ]",
    "link": "https://gothamist.com/news/venezuelan-public-school-student-in-ny-detained-at-immigration-court",
    "timestamp": "2025-05-27T19:04:00Z"
  },
  {
    "title": "Trump accuses Putin of ‘playing with fire’ on Ukraine as local governor says Russia has seized four villages",
    "description": "Advances follow some of the biggest Russian drone and missile attacks of the war, although their intensity fell off overnight",
    "link": "https://www.irishtimes.com/world/europe/2025/05/27/trump-accuses-putin-of-playing-with-fire-on-ukraine-as-local-governor-says-russia-has-seized-four-villages/",
    "timestamp": "2025-05-27T19:03:56Z"
  },
  {
    "title": "Will Trump's Regulatory Reforms Do Enough To Unleash Nuclear Energy?",
    "description": "On Friday, President Donald Trump issued four executive orders aimed at bolstering nuclear power production by addressing supply chain constraints,",
    "link": "https://reason.com/2025/05/27/will-trumps-regulatory-reforms-do-enough-to-unleash-nuclear-energy/",
    "timestamp": "2025-05-27T19:03:32Z"
  },
  {
    "title": "Rick Scott Tells Charlie Kirk He Won’t Support Trump’s ‘Beautiful Bill’ In Present Form",
    "description": "Rick Scott told Charlie Kirk on Tuesday that he would not vote for President Donald Trump's House-passed “one big, beautiful bill” in its present form.",
    "link": "https://dailycaller.com/2025/05/27/rick-scott-tells-charlie-kirk-he-wont-support-trumps-beautiful-bill/",
    "timestamp": "2025-05-27T19:03:30Z"
  },
  {
    "title": "History's crossroads: Gaza or the failure of the West",
    "description": "The post-1945 order promised institutions, justice and rights, and the UN enshrined the ‘responsibility to protect'. But the Gaza war has shown that all such claims are hollow.\n\n-\n2025/06\n\n/ \narticle",
    "link": "https://mondediplo.com/2025/06/02gaza",
    "timestamp": "2025-05-27T19:02:16Z"
  },
  {
    "title": "The dangerous illusion",
    "description": "The view that Europe must now rearm, swiftly and on a massive scale, has rapidly become the new orthodoxy. However, engaging in an arms race has never been a route to durable peace.\n\n-\n2025/06\n\n/ \narticle",
    "link": "https://mondediplo.com/2025/06/05rearmament",
    "timestamp": "2025-05-27T19:02:12Z"
  },
  {
    "title": "Trump Freezes New Student Visa Interviews in Ideological Crusade",
    "description": "The Trump administration is halting all student visa interviews while it decides on how heavily it wants to surveil the social media pages of applicants, according to an order to all U.S. embassies reviewed by Politico.\r\n“Effective immediately, in preparation…",
    "link": "https://newrepublic.com/post/195749/trump-freezes-international-student-visa-interviews",
    "timestamp": "2025-05-27T19:00:39Z"
  },
  {
    "title": "Inside Economics: Reserve Bank’s big rate call today, plus are flat whites cheaper now than in the 1990s?",
    "description": "ANALYSIS: Liam Dann takes a deeper dive into the week's economic news.",
    "link": "https://www.nzherald.co.nz/business/economy/inside-economics-reserve-banks-big-rate-call-today-plus-are-flat-whites-cheaper-now-than-the-1990s/2HIPCF4WMJHDBFSOMCI2DKJWDI/",
    "timestamp": "2025-05-27T19:00:00Z"
  },
  {
    "title": "Trump Threatens Devastating Permanent Punishment for California If Newsom Refuses to Comply with Trans Sports Order",
    "description": "Trump Threatens Devastating Permanent Punishment for California If Newsom Refuses to Comply with Trans Sports Orderwesternjournal.com",
    "link": "https://www.westernjournal.com/trump-threatens-devastating-permanent-punishment-california-newsom-refuses-comply-trans-sports-order/",
    "timestamp": "2025-05-27T18:58:35Z"
  },
  {
    "title": "Nuclear stocks extend rally as Trump aims to quadruple US nuclear capacity by 2050",
    "description": "Nuclear stocks extended gains on Tuesday as President Trump's executive orders signed on Friday boosted the sector.",
    "link": "https://finance.yahoo.com/news/nuclear-stocks-extend-rally-as-trump-aims-to-quadruple-us-nuclear-capacity-by-2050-185819848.html",
    "timestamp": "2025-05-27T18:58:19Z"
  },
  {
    "title": "Trump administration moves to illegally cancel all contracts with Harvard",
    "description": "This is where it was always headed: The White House General Services Administration is expected to send a letter to federal agencies on Tuesday asking them to “identify any contracts with Harvard, and whether they can be canceled or redirected elsewhere,” a s…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/trump-administration-moves-to-illegally-cancel-all-contracts-with-harvard",
    "timestamp": "2025-05-27T18:57:58Z"
  },
  {
    "title": "King Charles III defends Canada's sovereignty in speech to open parliament",
    "description": "King Charles III defends Canada's sovereignty in speech to open parliamentgo.com",
    "link": "https://abcnews.go.com/International/king-charles-iii-defends-canadas-sovereignty-speech-open/story?id=122223599",
    "timestamp": "2025-05-27T18:55:55Z"
  },
  {
    "title": "Key takeaways from King Charles’s ‘Speech from the Throne’ in Canada",
    "description": "King stresses sovereignty amid US President Trump's pressure on Canada, but also urges cooperation in historic speech.",
    "link": "https://www.aljazeera.com/news/2025/5/27/key-takeaways-from-king-charless-speech-from-the-throne-in-canada",
    "timestamp": "2025-05-27T18:55:08Z"
  },
  {
    "title": "Trump’s Niece Predicted ‘Pathetic’ Uncle’s Presidency Was ‘Going To Be Unspeakably Awful’",
    "description": "“I mean, my point of view is that I don't understand people who are afraid of Donald, because he's so pathetic,\" Mary Trump said.",
    "link": "https://www.huffpost.com/entry/mary-donald-trump-pathetic-president_n_6835efe6e4b0620c4725f61a",
    "timestamp": "2025-05-27T18:54:40Z"
  },
  {
    "title": "Trump Pardons Criminal Whose Mom Attended Mar-a-Lago Fundraiser",
    "description": "Donald Trump pardoned tax criminal Paul Walczak weeks after his mother attended a lavish fundraiser at Mar-a-Lago, The New York Times reports.",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-pardons-paul-walczak-mother-fundraiser-1235348794/",
    "timestamp": "2025-05-27T18:54:10Z"
  },
  {
    "title": "Trump said to warn Netanyahu against thwarting Iran talks",
    "description": "United States President Donald Trump warned Israel's Prime Minister Benjamin Netanyahu against taking any steps that could obstruct nuclear negotiations with Iran, Axios reported on Tuesday, citing a ...",
    "link": "https://biztoc.com/x/3a684674f40879d6",
    "timestamp": "2025-05-27T18:53:45Z"
  },
  {
    "title": "Taxpayer-Funded Evergreen Professor Posts \"86 47\" Threat On Facebook",
    "description": "Taxpayer-Funded Evergreen Professor Posts \"86 47\" Threat On Facebook\n \nJust days after former FBI Director James Comey drew criticism and an apparent investigation for a post widely seen as a violent threat against Donald Trump, Evergreen State College profes…",
    "link": "https://biztoc.com/x/3d0397c8699c06cf",
    "timestamp": "2025-05-27T18:53:32Z"
  },
  {
    "title": "Trump’s Medicaid Cuts Will Gut a ‘Medical Lifeline’ for Millions",
    "description": "A health care provider and her patient warned lawmakers about how Donald Trump and Republicans’ Medicaid cuts will harm patients who need home care.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-republicans-medicaid-cuts-home-health-care-1235348787/",
    "timestamp": "2025-05-27T18:50:17Z"
  },
  {
    "title": "US Congress Moves to Weaken Controls on ‘Super-Toxics’",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Smoke rises from a plant in Louisiana’s Cancer Alley, October 18, 2023.\n © 2023 Eli Reed for Human Rights Watch \n \n \n\n\n \nLast week, the United States Congress passed a sweeping rollback of crucial pollution control s…",
    "link": "https://www.hrw.org/news/2025/05/27/us-congress-moves-weaken-controls-super-toxics",
    "timestamp": "2025-05-27T18:49:22Z"
  },
  {
    "title": "Russia, China, North Korea condemn Trump's $175 billion Golden Dome missile shield",
    "description": "U.S. adversaries condemn Trump's Golden Dome plan, citing risks of space arms race and global instability, while the U.S. defends it as homeland protection.",
    "link": "https://www.foxnews.com/world/russia-china-north-korea-condemn-trumps-175-billion-golden-dome-missile-shield",
    "timestamp": "2025-05-27T18:49:15Z"
  },
  {
    "title": "Iran-US nuclear talks: Is a new deal imminent?",
    "description": "An interim agreement on Iran's controversial nuclear program is being negotiated between the US and Iran. The Gulf states have a key role to play as mediators.",
    "link": "https://www.dw.com/en/iran-us-nuclear-talks-is-a-new-deal-imminent/a-72687249",
    "timestamp": "2025-05-27T18:49:00Z"
  },
  {
    "title": "Venezuelan Anti-Socialists Thank Trump Admin for 'Miraculous' Rescue",
    "description": "Five Venezuelan dissidents rescued from the shutdown Argentine embassy in Caracas confirmed at a weekend press conference that they escaped Venezuela thanks to a \"precise operation\" carried out by the United States.\nThe post Venezuelan Anti-Socialists Thank T…",
    "link": "https://www.breitbart.com/latin-america/2025/05/27/venezuelan-anti-socialists-thank-trump-admin-for-miraculous-rescue/",
    "timestamp": "2025-05-27T18:48:50Z"
  },
  {
    "title": "Cost of Trump's meet-and-greets skyrockets in latest MAGA money-making scheme",
    "description": "Accusations of pay-to-play corruption aren't stopping President Donald Trump from making big money off of his presidency. In fact, far from backing down, Trump recently raised the price of his meet-and-greet opportunities to astronomical heights.Trump came un…",
    "link": "https://www.rawstory.com/trump-corruption-2672215132/",
    "timestamp": "2025-05-27T18:48:37Z"
  },
  {
    "title": "The Way Trump’s America Most Closely Resembles 1930s Germany",
    "description": "For the vast majority of Americans, the legal system hasn’t changed in any meaningful way unless they are watching the news.",
    "link": "https://slate.com/news-and-politics/2025/05/trump-america-1930s-germany-dual-state.html",
    "timestamp": "2025-05-27T18:46:22Z"
  },
  {
    "title": "King Charles declares Canada 'strong and free' amid Trump rhetoric",
    "description": "The monarch opens Canada's parliament with a speech widely seen as a rebuke of the US president's aggressive comments about its sovereignty.",
    "link": "https://www.abc.net.au/news/2025-05-28/king-charles-gives-speech-in-canada/105345532",
    "timestamp": "2025-05-27T18:46:19Z"
  },
  {
    "title": "Trump to Netanyahu: Avoid actions that could derail Iran talks, report",
    "description": "President reiterates preference for diplomacy as Israeli officials prepare for potential military action on Iran.",
    "link": "https://www.israelnationalnews.com/news/409072",
    "timestamp": "2025-05-27T18:46:18Z"
  },
  {
    "title": "What do you want on a cruise? How private resorts are changing travel",
    "description": "Growth in cruise ship travel is starting to slow compared to the post-pandemic boom.",
    "link": "https://www.bostonherald.com/2025/05/27/how-private-resorts-are-changing-travel/",
    "timestamp": "2025-05-27T18:46:07Z"
  },
  {
    "title": "Ariel and Rena Cohen: Postwar Gaza Needs a Multi-National Arab Force",
    "description": "The U.S. should create a Multi-National Transitional Authority (MNTA) overseen by an International Contact Group (ICG) to take over Gaza.\nThe post Ariel and Rena Cohen: Postwar Gaza Needs a Multi-National Arab Force appeared first on Breitbart.",
    "link": "https://www.breitbart.com/middle-east/2025/05/27/ariel-and-rena-cohen-postwar-gaza-needs-a-multi-national-arab-force/",
    "timestamp": "2025-05-27T18:45:32Z"
  },
  {
    "title": "Every portfolio stock is higher in Tuesday's market rally. Here's our top performer",
    "description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "link": "https://www.cnbc.com/2025/05/27/every-portfolio-stock-is-higher-in-tuesdays-market-rally-heres-our-top-performer.html",
    "timestamp": "2025-05-27T18:45:21Z"
  },
  {
    "title": "Trump Media Group reverses stance, confirms $2.5B Bitcoin capital raise",
    "description": "Trump Media and Technology Group (TMTG), the company that owns US President Donald Trump’s Truth Social platform and is partially owned by the president, confirmed a $2.5 billion capital raise to purchase Bitcoin (BTC) after denying earlier reports of the dea…",
    "link": "https://cointelegraph.com/news/trump-media-group-tmtg-2b-btc-deal",
    "timestamp": "2025-05-27T18:42:55Z"
  },
  {
    "title": "Russia Is Intensifying Its Attacks On Ukraine",
    "description": "With diplomatic efforts to reach a cease-fire appearing remote, Russia has been escalating its assaults on Ukraine.\nU.S. President Donald Trump said he is considering more sanctions on Moscow after Russia launched a barrage of drones and missiles at Ukrainian…",
    "link": "https://biztoc.com/x/71cd5ce68e256e2e",
    "timestamp": "2025-05-27T18:42:27Z"
  },
  {
    "title": "Overcrowding and Dysfunction Produced a Quiet Riot at a Miami Federal Prison Holding ICE Detainees",
    "description": "Half the elevators at Federal Detention Center Miami are broken. Immigrant detainees are kept on lockdown, and lawyers can barely reach their clients.",
    "link": "https://reason.com/2025/05/27/overcrowding-and-dysfunction-produced-a-quiet-riot-at-a-miami-federal-prison-holding-ice-detainees/",
    "timestamp": "2025-05-27T18:42:18Z"
  },
  {
    "title": "Keeping Score: Trump Administration Attacks Immigrant Students; Pregnant Women Left Behind in RFK Jr.’s COVID Policy Shift; Women-Owned Businesses on the Rise",
    "description": "In every issue of Ms., we track research on our progress in the fight for equality, catalogue can’t-miss quotes from feminist voices and keep tabs on the feminist movement’s many milestones. We’re Keeping Score online, too—in this biweekly roundup.\nThis week:…",
    "link": "https://msmagazine.com/2025/05/27/keeping-score-feminist-news-trump-immigrant-students-college-pregnant-women-kids-covid-vaccine-rfk/",
    "timestamp": "2025-05-27T18:41:57Z"
  },
  {
    "title": "Trump’s USDA resurrects one climate grant program, kills another",
    "description": "Many farmers who spent big on solar are finally getting reimbursed. But another climate program for agriculture is headed for the morgue.",
    "link": "https://floodlightnews.org/trumps-usda-resurrects-one-climate-grant-program-kills-another/",
    "timestamp": "2025-05-27T18:41:50Z"
  },
  {
    "title": "George Takei: How the Alien Enemies Act Was Weaponized to Incarcerate My Family",
    "description": "George Takei has joined the ACLU as a special guest contributor for Asian American Pacific Islander History Month.\n On March 14, Donald Trump signed a proclamation invoking the Alien Enemies Act to carry out his mass deportations. The last time this law was i…",
    "link": "https://www.aclu.org/news/immigrants-rights/george-takei-how-the-alien-enemies-act-was-weaponized-to-incarcerate-my-family",
    "timestamp": "2025-05-27T18:40:27Z"
  },
  {
    "title": "California makes rule change to girls' track and field championship after Trump's threats over trans athlete",
    "description": "California officials revised eligibility rules for its track championships amid transgender athlete debate as President Donald Trump threatened to pull federal funding.",
    "link": "https://www.foxnews.com/sports/california-makes-rule-change-girls-track-field-championship-after-trumps-threats-over-trans-athlete",
    "timestamp": "2025-05-27T18:40:06Z"
  },
  {
    "title": "Big housing trouble in U.S: Citi says economy could head towards recession despite Trump’s easing of tariffs",
    "description": "Wall Street is increasingly concerned about a potential economic downturn, with weakening housing activity as a key indicator. Rising mortgage rates and declining home prices are contributing to the slowdown. While the Federal Reserve may not react solely to …",
    "link": "https://economictimes.indiatimes.com/news/international/us/big-housing-trouble-in-u-s-citi-says-economy-could-head-towards-recession-despite-trumps-easing-of-tariffs-us-economy-news/articleshow/121442059.cms",
    "timestamp": "2025-05-27T18:40:00Z"
  },
  {
    "title": "5 key messages in King Charles's speech from the throne",
    "description": "The speech from the throne is normally a routine affair in Canada. But after the recent annexation threats by U.S. President Donald Trump, it was crafted to remind the White House that Canada is not an American state in waiting — but a country with its own id…",
    "link": "https://www.cbc.ca/news/politics/speech-from-throne-king-charles-five-things-1.7544963",
    "timestamp": "2025-05-27T18:33:12Z"
  },
  {
    "title": "U.S. universities map out new investment strategies to deal with tax hike on endowments: report",
    "description": "NEW YORK, May 27 (Xinhua) -- U.S. House Republicans' plan to raise taxes on university endowments could drive the biggest shift to endowments' investment strategies in a generation, reported The Wall Street Journal on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/us-universities-map-out-new-investment-strategies-to-deal-with-tax-hike-on-endowments-report",
    "timestamp": "2025-05-27T18:33:00Z"
  },
  {
    "title": "Donald Trump Shares Post Calling Joe Biden a 'Decrepit Corpse' Shortly After His Cancer Diagnosis",
    "description": "Donald Trump is hurling insults at former President Joe Biden shortly after his prostate cancer diagnosis. On Monday (May 26), Trump took to his Truth Social page on Memorial Day to reshare a post by right-wing political commentator DC Draino that called Bide…",
    "link": "https://www.justjared.com/2025/05/27/donald-trump-shares-post-calling-joe-biden-a-decrepit-corpse-shortly-after-his-cancer-diagnosis/",
    "timestamp": "2025-05-27T18:32:28Z"
  },
  {
    "title": "US blocks tougher G7 sanctions wording on Russia – FT",
    "description": "Treasury Secretary Scott Bessent reportedly asked finance ministers not to mention the oil price cap in a joint statement Read Full Article at RT.com",
    "link": "https://www.rt.com/news/618226-us-blocks-g7-oil-price-cap/",
    "timestamp": "2025-05-27T18:32:10Z"
  },
  {
    "title": "King Charles III calls for Canada to lead ’coalition of like-minded countries’",
    "description": "The News\nThe UK’s King Charles III gave a speech to Canada’s parliament Tuesday following an invitation from Canadian Prime Minister Mark Carney that was widely viewed as a message to US President Donald Trump, amid escalating trade and diplomatic tension bet…",
    "link": "https://biztoc.com/x/86839a624ff74f96",
    "timestamp": "2025-05-27T18:31:22Z"
  },
  {
    "title": "CNET's Daily Tariff Price Tracker: I'm Keeping Tabs on Changes as Trump's Trade Policies Shift",
    "description": "The enforcement of Trump's favored trade tactic, tariffs, can hardly be called consistent up this point but beneath all the noise, I'm looking to track the direct impacts for everyday consumers.",
    "link": "https://www.cnet.com/tech/cnets-daily-tariff-price-tracker-im-keeping-tabs-on-changes-as-trumps-trade-policies-shift/",
    "timestamp": "2025-05-27T18:30:00Z"
  },
  {
    "title": "Trump Notices For First Time Putin Like Really Into Killing",
    "description": "Add it to the list of new concepts, like 'groceries.'",
    "link": "https://www.wonkette.com/p/trump-notices-for-first-time-putin",
    "timestamp": "2025-05-27T18:29:42Z"
  },
  {
    "title": "Cybertruck police cruisers set to patrol World Cup matches in Mexico",
    "description": "A growing number of law enforcement departments have added the bulky EVs to their fleets. \nThe post Cybertruck police cruisers set to patrol World Cup matches in Mexico appeared first on Popular Science.",
    "link": "https://www.popsci.com/technology/mexican-police-cybertruck-world-cup/",
    "timestamp": "2025-05-27T18:29:31Z"
  },
  {
    "title": "From USAID to US Harms",
    "description": "With the Oval Office looking more like a middle school classroom every day, let’s recall the way, once upon a time, we responded to childhood taunts from a playground bully. You remember how it goes. Your nemesis says mockingly that you’re a this-or-that and …",
    "link": "https://tomdispatch.com/the-self-liquidation-of-u-s-global-leadership/",
    "timestamp": "2025-05-27T18:29:14Z"
  },
  {
    "title": "Moscow accuses Kyiv of derailing peace talks",
    "description": "Moscow, which has repeatedly rejected proposals from Kyiv and its Western allies for a 30-day unconditional ceasefire, fired hundreds of drones at Ukraine between late Friday and early Monday, killing more than a dozen people and saturating the country's air …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/moscow-accuses-kyiv-of-derailing-peace-talks/articleshow/121446959.cms",
    "timestamp": "2025-05-27T18:28:08Z"
  },
  {
    "title": "Secretary of Saying What Everyone's Thinking Jasmine Crockett answers questions about Kristi Noem and Donald Trump [Hero]",
    "description": "Secretary of Saying What Everyone's Thinking Jasmine Crockett answers questions about Kristi Noem and Donald Trump",
    "link": "https://www.fark.com/comments/13685678/Secretary-of-Saying-What-Everyones-Thinking-Jasmine-Crockett-answers-questions-about-Kristi-Noem-Donald-Trump",
    "timestamp": "2025-05-27T18:27:38Z"
  },
  {
    "title": "Trump Pardons Corrupt MAGA Sheriff, Donor’s Tax-Cheat Son",
    "description": "Trump pardons corrupt MAGA sheriff, donor’s tax-cheat son. Juries convicted Scott Jenkins of bribery and Paul Walczak of tax crimes. But according to a Trump Memorial Day post, he’s pardoning fellow victims of the “weaponized Biden DOJ.”",
    "link": "http://nymag.com/intelligencer/article/trump-pardons-scott-jenkins-paul-walczak.html",
    "timestamp": "2025-05-27T18:27:28Z"
  },
  {
    "title": "Trump threatens California funding freeze over trans athlete ban",
    "description": "NEW YORK, May 27 (Xinhua) -- U.S. President Donald Trump threatened on Tuesday to withhold federal funding, accusing Californian Governor Gavin Newsom of failing to comply with an executive order barring transgender people from competing in women's sports. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/05/28/trump-threatens-california-funding-freeze-over-trans-athlete-ban",
    "timestamp": "2025-05-27T18:26:00Z"
  },
  {
    "title": "Trump Responds To Putin's Charge Of Him Being Emotional With An All-Caps Tweet",
    "description": "WASHINGTON, D.C. — Tensions stemming from the ongoing negotiations between Russia and Ukraine to bring the years-long war to an end threatened to boil over once again, as President Donald Trump responded to Vladimir Putin's charge of him being emotional with …",
    "link": "https://babylonbee.com/news/trump-responds-to-putins-charge-of-him-being-emotional-with-an-all-caps-tweet",
    "timestamp": "2025-05-27T18:25:19Z"
  },
  {
    "title": "Ramaswami's Strive raises $750M for 'alpha-generating' Bitcoin buy strategy",
    "description": "Strive, an asset manager founded by American entrepreneur and politician Vivek Ramaswamy, has announced a $750 million raise to establish “alpha-generating” strategies through Bitcoin-related purchases. According to a May 27 announcement, the strategies will …",
    "link": "https://cointelegraph.com/news/strive-raises-750m-alpha-generating-bitcoin-buy-strategy",
    "timestamp": "2025-05-27T18:24:21Z"
  },
  {
    "title": "Trump Administration Orders Pause on All New Student Visa Interviews",
    "description": "Secretary of State Marco Rubio has ordered U.S. embassies and consulates around the world to temporarily suspend scheduling of new student visa interviews as the Trump administration weighs requiring all foreign students to undergo social media vetting.\n\nPoli…",
    "link": "https://www.commondreams.org/news/us-visa-crackdown-international-students",
    "timestamp": "2025-05-27T18:22:16Z"
  },
  {
    "title": "Ivanka Trump Reveals Special Gift She Extends To Closest Friends",
    "description": "Ivanka Trump revealed the intimate, meaningful gift she shares with her closest friends May 26 in an Instagram Story.",
    "link": "https://dailycaller.com/2025/05/27/ivanka-trump-gift-friends-produce-baskets-gardening-earth/",
    "timestamp": "2025-05-27T18:20:05Z"
  },
  {
    "title": "Elon Musk Responds to Trump Voter's Fury Over Lack of DOGE Votes",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nElon Musk has responded to a Donald Trump voter who has recently expressed dissatisfaction with the direction of the Republican Party and has gone viral several times for his critiques of the GOP.\nWriting on h…",
    "link": "https://biztoc.com/x/7b8cc2c40b8ad924",
    "timestamp": "2025-05-27T18:19:54Z"
  },
  {
    "title": "Dow jumps by 700 points with tariffs, data in focus",
    "description": "Major stock market indexes in the United States extended their gains during Tuesday's trading session after President Donald Trump decided to delay the introduction of a 50% tariff on imports from the...",
    "link": "https://biztoc.com/x/82a5a48c574d63a7",
    "timestamp": "2025-05-27T18:19:41Z"
  },
  {
    "title": "Elon Musk Responds to Trump Voter's Fury Over Lack of DOGE Votes",
    "description": "A Republican influencer recently went viral after saying the GOP \"blew it\" by failing to codify DOGE cuts.",
    "link": "https://www.newsweek.com/elon-musk-trump-voter-viral-tweet-gop-doge-2077424",
    "timestamp": "2025-05-27T18:19:24Z"
  },
  {
    "title": "Former Israeli government spokesperson warns country is in an 'impossible bind' in Gaza",
    "description": "Former Israeli government spokesperson Eylon Levy says Israel faces an \"impossible dilemma\" between bringing home hostages and defeating Hamas.",
    "link": "https://www.foxnews.com/world/former-israeli-government-spokesperson-warns-country-impossible-bind-gaza",
    "timestamp": "2025-05-27T18:17:39Z"
  },
  {
    "title": "Trump Media’s $2.5 Billion Bitcoin Bet Mirrors White House Crypto Strategy",
    "description": "As the pro-crypto White House moves to establish a strategic bitcoin stockpile, Trump’s media company is adopting a parallel approach.",
    "link": "https://www.forbes.com/sites/zacheverson/2025/05/27/trump-media-bitcoin-reserve-truth-social-crypto/",
    "timestamp": "2025-05-27T18:15:44Z"
  },
  {
    "title": "Grimes pulls out of Pride performance citing ‘family issues’",
    "description": "Grimes famously shares three children with Tesla founder Elon Musk",
    "link": "https://www.the-independent.com/arts-entertainment/music/news/grimes-world-pride-family-issues-elon-musk-b2758674.html",
    "timestamp": "2025-05-27T18:15:18Z"
  },
  {
    "title": "Trump threatens to yank California’s federal funding over one transgender student’s sports participation",
    "description": "President Donald Trump is threatening to withhold federal funding from California unless a transgender girl is barred from competing in the state girls’ finals—escalating his administration’s attacks on transgender youth and placing renewed pressure on Gov. G…",
    "link": "https://www.advocate.com/politics/trump-threatens-california-transgender-athlete",
    "timestamp": "2025-05-27T18:12:47Z"
  },
  {
    "title": "Donald Trump’s Media Conglomerate Is Becoming a Bitcoin Reserve",
    "description": "Trump Media and Technology Group, the parent company to Truth Social, has announced plans to buy up billions of dollars’ worth of bitcoin.",
    "link": "https://www.wired.com/story/donald-trumps-media-conglomerate-is-becoming-a-bitcoin-reserve/",
    "timestamp": "2025-05-27T18:12:43Z"
  },
  {
    "title": "NPR Declares War on Trump's Funding Executive Order with Major Court Move",
    "description": "\"Americans have the right to expect that if their tax dollars fund public broadcasting at all, they fund only fair, accurate, unbiased ...\"",
    "link": "https://www.westernjournal.com/npr-declares-war-trumps-funding-executive-order-major-court-move/",
    "timestamp": "2025-05-27T18:12:42Z"
  },
  {
    "title": "Apple almost became a satellite internet provider",
    "description": "Your iPhone and home internet service could come beamed from satellites in orbit in a service provided by Apple — but no.\n(via Cult of Mac - Apple news, rumors, reviews and how-tos)",
    "link": "https://www.cultofmac.com/news/apple-satellite-internet-provider",
    "timestamp": "2025-05-27T18:10:51Z"
  },
  {
    "title": "‘The true north is indeed strong and free’: King Charles III delivers unprecedented throne speech in Canada, defending sovereignty amid global unrest",
    "description": "King Charles addressed the Canadian Parliament. He delivered the Speech from the Throne. This marked a historic moment. The speech highlighted Canada's sovereignty. It addressed rising tensions with the United States. The government plans to reduce middle-cla…",
    "link": "https://economictimes.indiatimes.com/news/international/canada/the-true-north-is-indeed-strong-and-free-king-charles-iii-delivers-unprecedented-throne-speech-in-canada-defending-sovereignty-amid-global-unrest/articleshow/121446553.cms",
    "timestamp": "2025-05-27T18:10:06Z"
  },
  {
    "title": "Trump says Putin is 'playing with fire' as Kremlin continues assault on Ukraine (Giselle Ruhiyyih Ewing/Politico)",
    "description": "Giselle Ruhiyyih Ewing / Politico:\nTrump says Putin is ‘playing with fire’ as Kremlin continues assault on Ukraine  —  The comments come on the heels of Trump's weekend comments bashing Putin as “absolutely CRAZY.”  —  President Donald Trump on Tuesday accuse…",
    "link": "https://www.memeorandum.com/250527/p88",
    "timestamp": "2025-05-27T18:10:01Z"
  },
  {
    "title": "NPR sues Trump administration over executive order to cut federal funding to public media (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\nNPR sues Trump administration over executive order to cut federal funding to public media  —  National Public Radio and three of its local stations sued President Donald Trump on Tuesday, arguing that his executive order cutti…",
    "link": "https://www.memeorandum.com/250527/p87",
    "timestamp": "2025-05-27T18:10:01Z"
  },
  {
    "title": "Apple iPhone exports from China to the US fall 76% as India output surges",
    "description": "New figures from Canalys, now part of Omdia, show that iPhone imports from China into the US reached 900,000 units in April, marking a 76% year-on-year decrease.Read Entire Article",
    "link": "https://www.techspot.com/news/108074-apple-iphone-exports-china-us-falls-76-india.html",
    "timestamp": "2025-05-27T18:10:00Z"
  },
  {
    "title": "Mexico sees USMCA review starting in late September or early October",
    "description": "MEXICO CITY (Reuters) -Mexico expects a planned review of the trilateral trade pact with the U.S. and Canada to formally begin at the beginning of the fourth...",
    "link": "https://ca.finance.yahoo.com/news/mexico-sees-usmca-review-starting-180916420.html",
    "timestamp": "2025-05-27T18:09:16Z"
  },
  {
    "title": "Mexico sees USMCA review starting in late September or early October",
    "description": "MEXICO CITY (Reuters) -Mexico expects a planned review of the trilateral trade pact with the U.S. and Canada to formally begin at the beginning of the fourth...",
    "link": "https://finance.yahoo.com/news/mexico-sees-usmca-review-starting-180916776.html",
    "timestamp": "2025-05-27T18:09:16Z"
  },
  {
    "title": "MARA’s Fred Thiel Says U.S. Should Start Mining Bitcoin to Fill Strategic Reserve",
    "description": "“I think it’s critical, the U.S. making a statement that we’re going to have a strategic reserve is an empty statement unless you start putting stuff into it,\" he said.",
    "link": "https://www.coindesk.com/markets/2025/05/27/maras-fred-thiel-says-us-should-start-mining-bitcoin-to-fill-strategic-reserve",
    "timestamp": "2025-05-27T18:08:22Z"
  },
  {
    "title": "Trump warns Putin is 'playing with fire' after declaring the Russian president has 'gone absolutely CRAZY'",
    "description": "President Donald Trump, who recently said Russian President Vladimir Putin had gone \"CRAZY,\" warned in a Tuesday post on Truth Social that Putin is \"playing with fire\"",
    "link": "https://www.foxnews.com/world/trump-warns-putin-playing-fire-after-declaring-russian-president-has-gone-absolutely-crazy",
    "timestamp": "2025-05-27T18:06:14Z"
  },
  {
    "title": "Trump's Targeting Of Apple Isn't Random — Analyst Says It's A Calculated Move For Maximum Political Gain",
    "description": "Apple Inc. (NASDAQ:AAPL) isn't a company usually associated with national security, but it is in the crosshairs of President Donald Trump, now an expert has ...",
    "link": "https://www.aol.com/finance/trumps-targeting-apple-isnt-random-180542849.html",
    "timestamp": "2025-05-27T18:05:42Z"
  },
  {
    "title": "'Heartbreaking': 4-Year-Old Who Came to US Legally Could Die Within Days If Deported",
    "description": "Yet another Trump administration deportation case is sparking outrage: This time, a 4-year-old Mexican girl and her parents face expulsion, despite the family coming to the United States legally and the child's risk of death if she loses the medical care she …",
    "link": "https://www.commondreams.org/news/is-trump-deporting-children",
    "timestamp": "2025-05-27T18:05:04Z"
  },
  {
    "title": "The TRUTH About What’s Happening In South Africa",
    "description": "Donald Trump kicked off a firestorm with his dressing down of Cyril Ramaphosa, President of South Africa. Katia Beeden explains what's happening there.",
    "link": "https://dailycaller.com/2025/05/27/south-africa-genocide-afrikaners-katia-beeden-rebelcast/",
    "timestamp": "2025-05-27T18:04:14Z"
  },
  {
    "title": "Beyoncé Shifted Country Music, but She Cannot Save the Industry",
    "description": "Black women artists in country music will continue to be mistreated like Linda Martell.\nThe post Beyoncé Shifted Country Music, but She Cannot Save the Industry appeared first on Autostraddle.",
    "link": "http://www.autostraddle.com/beyonce-shifted-country-music-but-she-cannot-save-the-industry/",
    "timestamp": "2025-05-27T18:02:19Z"
  },
  {
    "title": "Trump wants to investigate Democrats’ fundraising, but his own campaign has issues",
    "description": "An Associated Press review of donations to Trump over the past five years found his campaign committees received received scores of potentially problematic contributions.",
    "link": "https://www.pbs.org/newshour/politics/trump-wants-to-investigate-democrats-fundraising-but-his-own-campaign-has-issues",
    "timestamp": "2025-05-27T18:00:37Z"
  },
  {
    "title": "Broadway Legend Patti LuPone Declares Multiple Times Trump’s Kennedy Center ‘Should Get Blown Up’",
    "description": "Broadway star Patti LuPone declared multiple times that the Kennedy Center under President Donald Trump \"should get blown up.\"\nThe post Broadway Legend Patti LuPone Declares Multiple Times Trump’s Kennedy Center ‘Should Get Blown Up’ first appeared on Mediait…",
    "link": "https://www.mediaite.com/media/entertainment/broadway-legend-patti-lupone-declares-multiple-times-trumps-kennedy-center-should-get-blown-up/",
    "timestamp": "2025-05-27T18:00:14Z"
  },
  {
    "title": "EU bureaucrats commit to ‘rapid’ negotiations after President Trump phone call",
    "description": "European Union bureaucrats have agreed to fast-track trade talks with the U.S. following a phone call between President Donald Trump and…\nThe post EU bureaucrats commit to ‘rapid’ negotiations after President Trump phone call appeared first on MacDailyNews.",
    "link": "https://macdailynews.com/2025/05/27/eu-bureaucrats-commit-to-rapid-negotiations-after-president-trump-phone-call/",
    "timestamp": "2025-05-27T18:00:10Z"
  },
  {
    "title": "Trump’s Deportation Efforts Are About to Kill a 4-Year-Old",
    "description": "Donald Trump’s administration may have condemned a 4-year-old girl with a rare bowel condition to death by terminating her legal status as part of the president’s crackdown on immigration, the Los Angeles Times reported Tuesday. \r\nThe young girl, who was iden…",
    "link": "https://newrepublic.com/post/195741/donald-trump-deportation-kill-four-year-old",
    "timestamp": "2025-05-27T18:00:09Z"
  },
  {
    "title": "BitMart Research—The Rise of USD1 and the GENIUS Act: Trump’s Push to Reshape the Stablecoin Market",
    "description": "Mahe, Seychelles, May 27, 2025 (GLOBE NEWSWIRE) -- BitMart Research, the research arm of BitMart Exchange, has released a comprehensive report examining a pivotal moment in the evolution of digital finance. As the U.S. accelerates efforts to regulate the stab…",
    "link": "https://www.globenewswire.com/news-release/2025/05/27/3088939/0/en/BitMart-Research-The-Rise-of-USD1-and-the-GENIUS-Act-Trump-s-Push-to-Reshape-the-Stablecoin-Market.html",
    "timestamp": "2025-05-27T18:00:00Z"
  },
  {
    "title": "Trump Admits He’s Got No Way to Make Putin Stop as Bombs Fall on Kyiv",
    "description": "Donald Trump has resorted to vague threats against Vladimir Putin in the hopes of getting him to agree to a ceasefire in Russia’s war against Ukraine.\r\nThe president posted to Truth Social Tuesday morning claiming that if it wasn’t for him, “lots of really ba…",
    "link": "https://newrepublic.com/post/195743/trump-putin-russia-attack-ukraine",
    "timestamp": "2025-05-27T17:59:52Z"
  },
  {
    "title": "Premier American Uranium Positioned for U.S. Nuclear Resurgence Amid Transformational Policy Shift",
    "description": "TORONTO, May 27, 2025 (GLOBE NEWSWIRE) — Premier American Uranium Inc. (“PUR”, the “Company” or “Premier”) (TSXV: PUR) (OTCQB: PAUIF) welcomes the landmark Executive Orders issued by President Donald J. Trump, aimed at accelerating the growth of U.S. nuclear …",
    "link": "https://financialpost.com/globe-newswire/premier-american-uranium-positioned-for-u-s-nuclear-resurgence-amid-transformational-policy-shift",
    "timestamp": "2025-05-27T17:58:44Z"
  },
  {
    "title": "Trump doesn't get Putin. But Putin has his number",
    "description": "President Donald Trump doesn't really understand his Russian counterpart, but Vladimir Putin has got Trump's number cold.",
    "link": "https://biztoc.com/x/39d14db3c9aeacaa",
    "timestamp": "2025-05-27T17:57:56Z"
  },
  {
    "title": "US senator: Trump supports Bitcoin Act",
    "description": "United States Senator from Wyoming Cynthia Lummis (pictured) remarked on Tuesday that President Donald Trump supports the Bitcoin Act that she proposed.Speaking at the Bitcoin Conference in Las Vegas,...",
    "link": "https://biztoc.com/x/157d3abc4e04d81e",
    "timestamp": "2025-05-27T17:57:47Z"
  },
  {
    "title": "TRUMP Meme Coin Dinner Turned Into High-Net-Worth Crypto Networking: 'Trump Was There For 20 Minutes'",
    "description": "Donald Trump's black-tie gala for top TRUMP (CRYPTO: TRUMP) meme coin holders, held last Thursday night at his private golf club near Washington, D.C., turned out to be less about meeting the former president and more about networking among crypto millionaire…",
    "link": "https://biztoc.com/x/0fdbc5dc4b818792",
    "timestamp": "2025-05-27T17:57:19Z"
  },
  {
    "title": "Premier American Uranium Positioned for U.S. Nuclear Resurgence Amid Transformational Policy Shift",
    "description": "TORONTO, May 27, 2025 (GLOBE NEWSWIRE) -- Premier American Uranium Inc. (“PUR”, the “Company” or “Premier”) (TSXV: PUR) (OTCQB: PAUIF) welcomes the landmark Executive Orders issued by President Donald J. Trump, aimed at accelerating the growth of U.S. nuclear…",
    "link": "https://www.globenewswire.com/news-release/2025/05/27/3088936/0/en/Premier-American-Uranium-Positioned-for-U-S-Nuclear-Resurgence-Amid-Transformational-Policy-Shift.html",
    "timestamp": "2025-05-27T17:57:00Z"
  },
  {
    "title": "Rick Derringer, Singer of ‘Hang on Sloopy,’ Writer of ‘Rock and Roll Hootchie Koo’ and ‘Real American’ Wrestling Theme, Dies at 77",
    "description": "Rick Derringer, whose six-decade career spanned teen stardom as lead singer of the ‘60s smash “Hang on Sloopy,” a ‘70s solo hit with “Rock and Roll Hootchie Koo,” session work with artists from Steely Dan to Barbra Streisand, and extensive work as a writer an…",
    "link": "https://variety.com/2025/music/news/rick-derringer-hang-on-sloopy-real-american-writer-dead-1236411000/",
    "timestamp": "2025-05-27T17:55:56Z"
  },
  {
    "title": "Bombshell Report Reveals Trump Pardoned Tax Fraudster Whose Mother Raised Millions For President’s Campaign",
    "description": "A Tuesday report revealed that President Donald Trump's pardon of a tax fraudster was largely fueled by his mother's contributions to Trump's campaign.\nThe post Bombshell Report Reveals Trump Pardoned Tax Fraudster Whose Mother Raised Millions For President’s…",
    "link": "https://www.mediaite.com/politics/bombshell-report-reveals-trump-pardoned-tax-fraudster-whose-mother-raised-millions-for-presidents-campaign/",
    "timestamp": "2025-05-27T17:55:56Z"
  },
  {
    "title": "Music Legend Rick Derringer Dead at 77",
    "description": "Guitar icon and legendary performer Rick Derringer died on Memorial Day -- and it's because his heart suddenly gave out, TMZ has learned. Rick's longtime wife Jenda Derringer tells TMZ he died \"peacefully\" after being taken off life support Monday…\n Permalink",
    "link": "https://www.tmz.com/2025/05/27/guitarist-rick-derringer-dead-music-icon/",
    "timestamp": "2025-05-27T17:55:38Z"
  },
  {
    "title": "Trump demands California stop trans girl competing in state high jump finals",
    "description": "President Trump threatened to withhold federal funding if California did not stop a transgender girl in high school from competing in state track and field finals, and said he would discuss it with Governor Gavin Newsom on Tuesday.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/trump-demands-california-stop-trans-girl-competing-state-high-jump-fin-rcna209270",
    "timestamp": "2025-05-27T17:54:49Z"
  },
  {
    "title": "Dems drop $20M on bizarre 'American men' strategy plan study in effort to dig out of 2024 political hole",
    "description": "Democrats investing $20 million in a study to understand American male voters after losing ground in the 2024 election sparks criticism from both parties.",
    "link": "https://www.foxnews.com/politics/dems-drop-20m-bizarre-american-men-strategy-plan-study-effort-dig-out-2024-political-hole",
    "timestamp": "2025-05-27T17:53:17Z"
  },
  {
    "title": "Skepticism Greets Democrat Strategists’ Plan to Win Back Young Men",
    "description": "Democratic Party strategists are hoping to win back young men through a new $20 million effort called “Speaking With American Men.” What’s being labeled a... Read More\nThe post Skepticism Greets Democrat Strategists’ Plan to Win Back Young Men appeared first …",
    "link": "https://www.dailysignal.com/2025/05/27/skepticism-greets-democrat-strategists-plan-win-back-young-men/",
    "timestamp": "2025-05-27T17:51:45Z"
  },
  {
    "title": "Trump targeted Democrats over questionable online fundraising. His campaign has similar issues (Associated Press)",
    "description": "Associated Press:\nTrump targeted Democrats over questionable online fundraising.  His campaign has similar issues  —  When President Donald Trump directed his attorney general last month to investigate online fundraising, he cited concerns that foreigners and…",
    "link": "https://www.memeorandum.com/250527/p82",
    "timestamp": "2025-05-27T17:50:01Z"
  },
  {
    "title": "Taiwan pledges to buy more American goods as a 32% tariff looms",
    "description": "Taiwan’s president has pledged to buy more American goods, including natural gas and oil, and help the U.S. with its plan to bring back manufacturing jobs",
    "link": "https://abcnews.go.com/International/wireStory/taiwan-pledges-buy-american-goods-32-tariff-looms-122239062",
    "timestamp": "2025-05-27T17:49:51Z"
  }
]