[
  {
    "title": "Trump Moves With Dizzying Speed On His To-Do List — And There Are Warning Signs",
    "description": "Court challenges to Trump’s policies started on Inauguration Day and have continued at a furious pace since Jan. 20.",
    "link": "https://www.huffpost.com/entry/trump-moves-dizzying-speed-to-do-list-warning-signs_n_67b0a81fe4b0c06e58fc775d",
    "timestamp": "2025-02-15T14:52:00Z"
  },
  {
    "title": "Hamas frees 3 more Israeli hostages in exchange for 369 prisoners - NewsBreak",
    "description": "Three hostages -- American-Israeli Sagui Dekel-Chen, Russian-Israeli Alexandre Troufanov and Argentinian-Israeli Iair Horn -- on Saturday were released by",
    "link": "https://www.newsbreak.com/share/3814486449365-hamas-frees-3-more-israeli-hostages-in-exchange-for-369-prisoners?s=a2&share_destination_id=MjA1Mzk3NTA4LTE3Mzk2NDA1NjkzMjA%3D&pd=0DtpH2C2&hl=en_US&send_time=1739640569&actBtn=bottomBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&sep=ns_foryou_recall_exp_25q1-v2%2Cns_push_exp_rt_bucketv12-v6%2Cns_foryou_blend_exp_25q1-v3%2Cns_foryou_model_exp_25q1-v2%2Cns_foryou_rank_exp_25q1-v2",
    "timestamp": "2025-02-15T14:50:57Z"
  },
  {
    "title": "JD Vance Rebuked by Germany's Scholz",
    "description": "The German chancellor rejected Vance's comments about governing with the far right.",
    "link": "https://www.newsweek.com/vance-scholz-ukraine-interefence-2031718",
    "timestamp": "2025-02-15T14:47:08Z"
  },
  {
    "title": "House Republicans prepare to impeach federal judges blocking Trump, DOGE policies",
    "description": "Several House Republicans are preparing articles of impeachment against the federal judges who are blocking some of President Donald Trump's and Elon Musk's key policies. judges have blocked Trump's executive order that limits transgender care for minors, and…",
    "link": "https://freerepublic.com/focus/f-news/4297815/posts",
    "timestamp": "2025-02-15T14:46:44Z"
  },
  {
    "title": "Unhinged Democrat Lawmaker Resorts to Scare Tactics to Smear DOGE’s Efforts to Ferrot Out Government Waste at the EPA  (Video)",
    "description": "Amid rising tensions over government waste, Rep. Melanie Stansbury's alarming claims about DOGE's influence raise critical questions about accountability and transparency in federal spending. This unfolding narrative merits closer examination.\nThe post Unhing…",
    "link": "https://www.thegatewaypundit.com/2025/02/democrat-rep-resorts-scare-tactics-smear-doges-efforts/",
    "timestamp": "2025-02-15T14:45:23Z"
  },
  {
    "title": "Frederick Douglass’s Words Ring True: “Power Concedes Nothing Without a Demand”",
    "description": "Let’s draw on the defiant wisdom of Frederick Douglass as Trump carries out a blitzkrieg against democracy in the US.",
    "link": "https://truthout.org/articles/frederick-douglasss-words-ring-true-power-concedes-nothing-without-a-demand/",
    "timestamp": "2025-02-15T14:43:32Z"
  },
  {
    "title": "FPI sell-off intensifies in February amid Trump trade effect",
    "description": "Net FPI outflows touch ₹22,272 crore till February 14 this month, reveal depositories data; Net FPI outflows near ₹1 lakh crore so far in calendar year 2025",
    "link": "https://www.thehindubusinessline.com/markets/fpi-sell-off-intensifies-in-february-amid-trump-trade-effect/article69223363.ece",
    "timestamp": "2025-02-15T14:42:29Z"
  },
  {
    "title": "Trump moves with dizzying speed on his to-do list. But there are warning signs in his first month",
    "description": "President Trump's first month of his second term has seen major shakeups in federal employment, social policy, and economic measures. Thousands of federal workers have been fired, legal challenges to his policies are mounting, and economic indicators such as …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-moves-with-dizzying-speed-on-his-to-do-list-but-there-are-warning-signs-in-his-first-month/articleshow/118279901.cms",
    "timestamp": "2025-02-15T14:41:41Z"
  },
  {
    "title": "The Chattering Classes  – Crisis at ‘The Politico’",
    "description": "The Chattering Classes is Euractiv's new weekly newsletter on politics, lobbying and the media.",
    "link": "https://www.euractiv.com/section/politics/opinion/the-chattering-classes-crisis-at-the-politico/",
    "timestamp": "2025-02-15T14:40:39Z"
  },
  {
    "title": "Musk's takeover of US health agencies raises pandemic threat, experts warn (Melody Schreiber/The Guardian)",
    "description": "Melody Schreiber / The Guardian:\nMusk's takeover of US health agencies raises pandemic threat, experts warn  —  Doge wreaks havoc on HHS and CDC as Trump seeks to grant committee sweeping governmental powers  —  The “department of government efficiency”, the …",
    "link": "https://www.memeorandum.com/250215/p21",
    "timestamp": "2025-02-15T14:40:01Z"
  },
  {
    "title": "Trump's Plan To Ditch Pennies — Pros & Cons For Businesses and Customers",
    "description": "President Donald Trump has directed the Treasury Department to halt new penny production, rekindling the debate over America’s costliest small change.\nEach penny cost $0.037 to produce in 2024, up from $0.021 in 2021, according to The Wall Street Journal on M…",
    "link": "https://biztoc.com/x/d974e1f1e0f6f0c5",
    "timestamp": "2025-02-15T14:34:45Z"
  },
  {
    "title": "Trump's name continues to be fundraising behemoth for both political parties: 'Center of the universe'",
    "description": "Fundraising messages centered around President Donald Trump have resurfaced on both sides of the political aisle since Trump’s return to the White House. Democratic messages focus on resisting Trump, while Republicans are fundraising on Democrat resistance.",
    "link": "https://www.foxnews.com/politics/trumps-name-continues-fundraising-behemoth-political-parties-center-universe",
    "timestamp": "2025-02-15T14:31:48Z"
  },
  {
    "title": "We Are About to Learn What a Post-Truth Approach to Public Health Feels Like",
    "description": "Trump and Musk are slashing global vaccination efforts, funding for medical research and access to health information.",
    "link": "https://truthout.org/articles/we-are-about-to-learn-what-a-post-truth-approach-to-public-health-feels-like/",
    "timestamp": "2025-02-15T14:31:41Z"
  },
  {
    "title": "Kansas Republicans condemn violent threats — though apparently not if they make them",
    "description": "So, wait a minute. Is threatening political violence acceptable now?\nYou see, I recall the ancient days of October 2024, when Kansas Republicans frothed in rage at the story of a University of Kansas lecturer who made an unfortunate comment to his students ab…",
    "link": "https://www.rawstory.com/kansas-republicans-condemn-violent-threats-apparently-not-if-they-make-them-though/",
    "timestamp": "2025-02-15T14:30:25Z"
  },
  {
    "title": "Arab states will have to stand up to Trump to avert ethnic cleansing of Gaza",
    "description": "Arab leaders face increasing pressure from the White House to support the ethnic cleansing of Palestinians. As they prepare an alternative proposal for Gaza it seems unlikely they can satisfy both Trump and their own citizens.",
    "link": "https://mondoweiss.net/2025/02/arab-states-will-have-to-stand-up-to-trump-to-avert-ethnic-cleansing-of-gaza/",
    "timestamp": "2025-02-15T14:30:00Z"
  },
  {
    "title": "Trump’s Cultural Power Grab: Why His Kennedy Center Takeover Matters",
    "description": "The battle for America's future won’t just be won or lost at the ballot box, but on screens, at concert venues, and at cultural institutions.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-kennedy-center-cultural-power-grab-1235268600/",
    "timestamp": "2025-02-15T14:30:00Z"
  },
  {
    "title": "Afghan allies helped US order airstrikes against Taliban. Trump moves leave them in limbo",
    "description": "President Donald Trump issued executive orders that put an end to programs used to help Afghans get to safety in America.",
    "link": "https://richmond.com/news/nation-world/government-politics/refugees-afghanistan-taliban-islamic-state/article_78004a8b-d5ba-5724-a1dd-df7eb75ca40a.html",
    "timestamp": "2025-02-15T14:30:00Z"
  },
  {
    "title": "Honeymoon over? More and more Republicans, including diehard MAGA farmers and teachers, regret voting for Donald Trump; here's what they have to say",
    "description": "Donald Trump’s policies are causing regret among Republican farmers and teachers as funding cuts and aid freezes impact their lives. Farmers are losing millions due to Trump's halt on USAID food aid purchases, which affected $340 million in shipments. Rancher…",
    "link": "https://economictimes.indiatimes.com/news/international/us/honeymoon-over-more-and-more-republicans-including-diehard-maga-farmers-and-teachers-regret-voting-for-donald-trump-heres-what-they-have-to-say/articleshow/118278771.cms",
    "timestamp": "2025-02-15T14:29:03Z"
  },
  {
    "title": "Russia's Putin could be NATO's 'Man of the Year' as he's strengthened the alliance, Trump ally says",
    "description": "Russian President Vladimir Putin has done more to strengthen and unite NATO that member states, U.S. Senator Lindsey Graham told the Munich Security Conference.",
    "link": "https://www.cnbc.com/2025/02/15/russias-putin-could-be-natos-man-of-the-year-senator-graham.html",
    "timestamp": "2025-02-15T14:28:56Z"
  },
  {
    "title": "Freedom of speech, NATO states’ role in their own defense, migration crisis: Key takeaways from Vance’s Munich address",
    "description": "US Vice President J.D. Vance has addressed a gathering of leaders and experts at the event in Germany Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612782-vance-speech-munich-security-conference/",
    "timestamp": "2025-02-15T14:28:18Z"
  },
  {
    "title": "What To Know About Trump's New Intelligence Advisory Board",
    "description": "What To Know About Trump's New Intelligence Advisory Board\n \nAuthored by Savannah Hulsey Pointer via The Epoch Times (emphasis ours),\nOn Feb. 12, President Donald Trump announced a list of individuals who will serve on his President’s Intelligence Advisory Bo…",
    "link": "https://biztoc.com/x/ea0571dfd8634f5d",
    "timestamp": "2025-02-15T14:24:56Z"
  },
  {
    "title": "Kunstler: Darkness Dying",
    "description": "“The nature of the NGO scams is to have a cause that sounds philanthropic, like ‘Save the Orphans of Sadville’ and then they pocket the money and zero actual orphans are helped.” — Elon Musk. The exorcism of the USA just keeps revving up. You can tell by the …",
    "link": "https://freerepublic.com/focus/f-chat/4297812/posts",
    "timestamp": "2025-02-15T14:24:55Z"
  },
  {
    "title": "Ilya Shapiro and Josh Blackman defend the rule of law",
    "description": "I’m deriving a certain grim amusement from the unnatural intellectual acts that right wing law professors with an eye to the main chance are currently performing, in the face of the most corrupt and most public quid pro quo in the history of the American pres…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/02/ilya-shapiro-and-josh-blackman-defend-the-rule-of-law",
    "timestamp": "2025-02-15T14:24:45Z"
  },
  {
    "title": "Judge sets a 5-day deadline for the Trump administration to start lifting its USAID funding freeze",
    "description": "WASHINGTON (AP) — A federal judge has ordered President Donald Trump's administration to temporarily lift a funding freeze that has shut down U.S. humanitarian aid and development work around the world, and he has set a five-day deadline for the administratio…",
    "link": "https://freerepublic.com/focus/f-news/4297811/posts",
    "timestamp": "2025-02-15T14:24:14Z"
  },
  {
    "title": "Schiff and Schumer's Bogus IG Scandal, Trump's Divergent Diplomacy, and the Pulitzer Board's Russiagate Retreat",
    "description": "Adam Schiff and Chuck Schumer have described Donald Trump's dismissal of 17 inspectors general as a \"chilling purge\" aimed at eliminating \"accountability for malfeasance.\" Scott Walter and Sarah Lee of the Capital Research Center say it’s not just the fulfill…",
    "link": "https://freebeacon.com/newsletters/schiff-and-schumers-bogus-ig-scandal-trumps-divergent-diplomacy-and-the-pulitzer-boards-russiagate-retreat/",
    "timestamp": "2025-02-15T14:19:31Z"
  },
  {
    "title": "Israeli hostages and Palestinian inmates freed in latest ceasefire swap",
    "description": "Hamas releases three more Israelis, as 369 Palestinians are handed over in the sixth exchange in recent weeks.",
    "link": "https://www.bbc.com/news/articles/c4g7n3l98z6o",
    "timestamp": "2025-02-15T14:18:24Z"
  },
  {
    "title": "Malcolm X Centenary and the Origins of the Legacy",
    "description": "Malcolm X, later known as El Hajj Malik Shabazz, was born on May 19, 1925 in Omaha, Nebraska during an era now described as the “Harlem Renaissance.”\nHis parents, Earl and Louise Little, were members of the Universal …\nThe post Malcolm X Centenary and the Ori…",
    "link": "https://www.globalresearch.ca/malcolm-x-centenary-origins-legacy/5879842",
    "timestamp": "2025-02-15T14:17:41Z"
  },
  {
    "title": "Column: 50 years of ‘Saturday Night Live,’ half fascinating, half underwhelming",
    "description": "The in-house documentaries produced for the \"SNL's\" 50th anniversary stay on-message — warm and laudatory — but have compelling moments as well",
    "link": "https://www.bostonherald.com/2025/02/15/column-50-years-of-saturday-night-live-half-fascinating-half-underwhelming/",
    "timestamp": "2025-02-15T14:15:22Z"
  },
  {
    "title": "Associated Press Reporter, Photographer Barred From Air Force One Over 'Gulf Of Mexico' Dispute",
    "description": "AP reporters and photographers travel with the president virtually everywhere as part of a press “pool” and have for decades.",
    "link": "https://www.huffpost.com/entry/associated-press-reporter-photographer-barred-from-air-force-one-gulf-mexico-dispute_n_67b09ecfe4b059dad8b38052",
    "timestamp": "2025-02-15T14:15:16Z"
  },
  {
    "title": "Elon Musk’s dream comes true: The federal board that protects workers does not exist, at least for now",
    "description": "The National Labor Relations Board, the independent agency that is supposed to enforce labor laws for most American workers, has been essentially shut down after President Donald Trump fired one of its board members, leaving it without the quorum it needs to …",
    "link": "https://biztoc.com/x/aacfae651f7160f6",
    "timestamp": "2025-02-15T14:14:57Z"
  },
  {
    "title": "A protest song by Venezuelan rappers asks Trump not to deport them",
    "description": "Three Venezuela rappers created the song \"Donaltron,\" a protest song in which they make their plea to President Donald Trump to not deport them. The song has become a viral hit on TikTok.",
    "link": "https://www.npr.org/2025/02/15/nx-s1-5293379/a-protest-song-by-venezuelan-rappers-asks-trump-not-to-deport-them",
    "timestamp": "2025-02-15T14:14:16Z"
  },
  {
    "title": "DAVID BLACKMON: Trump’s Energy Secretary Wasting No Time In Declaring End To Biden’s War On Coal",
    "description": "It's a new day in American power generation. Coal is in, wind is out and reindustrialization is the goal.",
    "link": "https://dailycaller.com/2025/02/15/opinion-trump-chris-wright-bidens-war-coal-david-blackmon/",
    "timestamp": "2025-02-15T14:14:05Z"
  },
  {
    "title": "Far From Benign: The US Aid Industrial Complex",
    "description": "The US aid program began in earnest in the early stages of the Cold War, with an intention to beat off the contenders from the Soviet bloc in the postcolonial world.  President Harry S. Truman proposed, in his 1949 inaugural address, “a bold new program for m…",
    "link": "https://www.globalresearch.ca/us-aid-industrial-complex/5879868",
    "timestamp": "2025-02-15T14:11:58Z"
  },
  {
    "title": "The roots of Donald Trump's fixation with South Africa (Vox)",
    "description": "Vox:\nThe roots of Donald Trump's fixation with South Africa  —  Last week, President Donald Trump signed an executive order stopping all aid to South Africa and offering refugee status to white South Africans.  —  The order decried “government-sponsored race-…",
    "link": "https://www.memeorandum.com/250215/p18",
    "timestamp": "2025-02-15T14:10:00Z"
  },
  {
    "title": "As Trump pledges to slash waste, critics say he’s weakening watchdogs",
    "description": "President Donald Trump says his new Department of Government Efficiency is rooting out waste, fraud and abuse, but critics say the White House is weakening watchdogs intended to guard against corruption.",
    "link": "https://www.wtae.com/article/trump-pledges-slash-waste-critics-say-weakening-watchdogs/63805121",
    "timestamp": "2025-02-15T14:09:24Z"
  },
  {
    "title": "Trump’s DOGE Plan Is Legally Untouchable—Elon Musk Holds the Scalpel",
    "description": "Trump isn’t just cleaning house—he’s rewriting the rulebook. The Deep State bloat that’s been clogging Washington for decades is in the crosshairs, and DOGE (Digital Operations and Government Efficiency) is the scalpel. The brilliance? It’s legally untouchabl…",
    "link": "https://freerepublic.com/focus/f-bloggers/4297806/posts",
    "timestamp": "2025-02-15T14:02:11Z"
  },
  {
    "title": "A 2nd U.S. judge pauses Trump's order against gender-affirming care for trans youth",
    "description": "A second federal judge paused President Trump's executive order halting federal support for gender-affirming care for transgender youth under 19.",
    "link": "https://www.npr.org/2025/02/15/nx-s1-5298655/gender-affirming-care-trans-youth-judge-ruling",
    "timestamp": "2025-02-15T14:00:58Z"
  },
  {
    "title": "Elon Musk’s dream comes true: The federal board that protects workers does not exist, at least for now",
    "description": "The National Labor Relations Board, the independent agency that is supposed to enforce labor laws for most American workers, has been essentially shut down after President Donald Trump fired one of its board members, leaving it without the quorum it needs to …",
    "link": "https://www.cnn.com/2025/02/15/business/nlrb-trump-musk-workers/index.html",
    "timestamp": "2025-02-15T14:00:47Z"
  },
  {
    "title": "Red state AG promises legal fight with ICE-resisting local governments",
    "description": "Indiana AG Todd Rokita threatened Indianapolis schools and the city police department for refusing to cooperate with federal ICE agents to deport illegal immigrants.",
    "link": "https://www.foxnews.com/politics/red-state-ag-vows-legal-fight-ice-resisting-local-governments",
    "timestamp": "2025-02-15T14:00:42Z"
  },
  {
    "title": "Dems torched over DOGE security claims after allowing 'wide-open' border, 'empowering Iran'",
    "description": "Republicans slammed Democrats' claims that the Department of Government Efficiency's actions potentially threatened U.S. national security.",
    "link": "https://www.foxnews.com/politics/dems-torched-over-doge-security-claims-after-allowing-wide-open-border-empowering-iran",
    "timestamp": "2025-02-15T14:00:42Z"
  },
  {
    "title": "‘I’m on Trump time:’ Kellogg says Russia-Ukraine peace plan could come in days or weeks",
    "description": "U.S. Special Presidential Envoy for Ukraine and Russia Keith Kellogg said Saturday that a peace plan for the two warring nations could come within days or weeks. “I’m on Trump time,” Kellogg told delegates at a fringe event at the Munich Security Conference, …",
    "link": "https://freerepublic.com/focus/f-chat/4297805/posts",
    "timestamp": "2025-02-15T14:00:26Z"
  },
  {
    "title": "Arkansas governor ridicules 'out-of-touch leftists' amid transgender sanctuary cities and DOGE battles",
    "description": "Arkansas Gov. Sarah Huckabee Sanders pushes back at leftists fighting for a \"transgender sanctuary city\" and advocating against DOGE on \"Jesse Watters Primetime.\"",
    "link": "https://www.foxnews.com/media/arkansas-governor-ridicules-out-touch-leftists-amid-transgender-sanctuary-cities-doge-battles",
    "timestamp": "2025-02-15T14:00:14Z"
  },
  {
    "title": "Trump's IRS Hiring Freeze Probably Won't Delay Your Taxes -- but This Definitely Will",
    "description": "There's an indefinite hiring freeze in place at the IRS, but fears about it's impact on the 2025 tax season might be misplaced.",
    "link": "https://www.cnet.com/personal-finance/taxes/trumps-irs-hiring-freeze-probably-wont-delay-your-taxes-but-this-definitely-will/",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Fernanda Torres on 'I'm Still Here' and Oscars Best Actress Nomination",
    "description": "All of Brazil will tune in on Oscar night — “It will be like the moon landing“ — to see if she takes best actress. But for the 'I’m Still Here' star, bringing the world's attention to a long-suppressed national trauma is the ultimate triumph.",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/fernanda-torres-im-still-here-oscars-best-actress-nomination-brazil-1236136822/",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "This Owl Will Live Forever",
    "description": "Visiting the New York Historical’s new exhibit on a tragically deceased celebrity owl",
    "link": "https://www.theatlantic.com/technology/archive/2025/02/flaco-owl-exhibit/681696/",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Harrison hulks out,​ Bridget looks for love, and a 'Monkey' causes mayhem",
    "description": "Welcome back to the Align Movie Guide, your easy-to-follow roundup of everything hitting the multiplex.\nAfter a chilly January, Hollywood is in the mood for romance, with plenty of Valentine's Day flicks to for you and your sweetheart to enjoy. Also some titl…",
    "link": "https://www.theblaze.com/align/harrison-hulks-out-bridget-looks-for-love-and-a-monkey-causes-mayhem",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Some Tesla owners in B.C. embarrassed by company's CEO amid charged political climate",
    "description": "The president of the Vancouver Electric Vehicle Association says he wants people to know that for most drivers, getting behind the wheel of a Tesla isn't a political statement.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/vancouver-tesla-owners-1.7460386",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "How some organizations are changing course on equity, diversity and inclusion initiatives",
    "description": "Some organizations are eliminating EDI positions, rebranding them, or rolling back their funding. It comes in the midst of a polarizing political climate and increasing backlash to EDI programs.",
    "link": "https://www.cbc.ca/news/canada/edmonton/how-some-organizations-are-changing-course-on-equity-diversity-and-inclusion-initiatives-1.7456341",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Tariffs Explained: What They Might and Might Not Mean for Everyday Prices",
    "description": "Tariffs have become President Donald Trump's favored economic move, prompting a lot of folks to ask what it is they even do.",
    "link": "https://www.cnet.com/personal-finance/tariffs-explained-what-they-might-and-might-not-mean-for-everyday-prices/",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Inside the Anti-Democratic Movement That Restored Trump to Power",
    "description": "An excerpt from “Money, Lies, and God: Inside the Movement to Destroy American Democracy” lifts the curtain on Donald Trump’s authoritarian movement.",
    "link": "http://www.rollingstone.com/politics/politics-features/money-lies-god-book-trump-anti-democratic-movement-1235269102/",
    "timestamp": "2025-02-15T14:00:00Z"
  },
  {
    "title": "Wall Street Journal mangles JD Vance’s actual statement on Ukraine peace talks",
    "description": "Suggested he made threats to use military and economic force to get Russia to agree to a deal that would end the ongoing war",
    "link": "https://www.wnd.com/2025/02/wall-street-journal-mangles-jd-vances-actual-statement-on-ukraine-peace-talks/",
    "timestamp": "2025-02-15T13:58:55Z"
  },
  {
    "title": "Donald Trump’s federal workforce shake-up: Thousands laid off via video calls, ordered to leave in 30 minutes",
    "description": "A sweeping federal layoff drive under Donald Trump’s administration has left thousands of employees jobless, often with just 30 minutes' notice. Conducted via group calls and pre-recorded messages, the dismissals have sparked outrage, with critics calling the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trumps-federal-workforce-shake-up-thousands-laid-off-via-video-calls-ordered-to-leave-in-30-minutes/articleshow/118278777.cms",
    "timestamp": "2025-02-15T13:56:51Z"
  },
  {
    "title": "Hungary’s transformation into an ‘electoral autocracy’ has parallels to Trump’s second term",
    "description": "BUDAPEST, Hungary (AP) — Hours before President Donald Trump was sworn in to begin his second term, promising a “golden age” for America, the leader of a Central European country was describing the years ahead in strikingly similar terms. Prime Minister Vikto…",
    "link": "https://freerepublic.com/focus/f-news/4297803/posts",
    "timestamp": "2025-02-15T13:55:05Z"
  },
  {
    "title": "The Future of America Under the Presidency of a Showbiz-Minded Personality",
    "description": "The future of the United States under the presidency of a figure like Donald Trump—often described as childish, emotionally immature, politically decadent, and more attuned to showbiz than to governance—raises significant concerns about the nation’s trajector…",
    "link": "https://www.globalresearch.ca/future-america-presidency-showbiz-minded-clown/5879959",
    "timestamp": "2025-02-15T13:47:13Z"
  },
  {
    "title": "Trump officials fired nuclear staff not realizing they oversee the country’s weapons stockpile, sources say - NewsBreak",
    "description": "Trump officials fired nuclear staff not realizing they oversee the country’s weapons stockpile, sources say - NewsBreaknewsbreak.com",
    "link": "https://www.newsbreak.com/share/3812750076041-trump-officials-fired-nuclear-staff-not-realizing-they-oversee-the-country-s-weapons-stockpile-sources-say?s=a7&amp;share_destination_id=NzI1ODg2OTUtMTczOTYyNzE2Nzk0Mw%3D%3D&amp;pd=04uZdPbD&amp;hl=en_US&amp;send_time=1739627167&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.4.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_rank_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_recall_exp_25q1-v7%2Cns_push_exp_rt_bucketv12-v7%2Cns_foryou_model_exp_25q1-v3",
    "timestamp": "2025-02-15T13:46:49Z"
  },
  {
    "title": "This is the issue that could ‘crush’ Trump’s presidency, polling shows",
    "description": "As President Donald Trump’s second term approaches the one-month mark, a CNN polling analyst is warning that one issue facing the American people could “crush his presidency.”\nHarry Enten, the senior data reporter for CNN, posted on X on Thursday that if Trum…",
    "link": "https://biztoc.com/x/56d7845ea0c6ddee",
    "timestamp": "2025-02-15T13:44:54Z"
  },
  {
    "title": "Unemployment spikes in Washington, D.C. as Trump and Musk begin efforts to shrink the government",
    "description": "President Donald Trump's moves to fire thousands of federal government workers have coincided with a surge in jobless claims in Washington D.C. that could get worse as the efforts intensify.\nSince Trump has taken office, nearly 4,000 workers in the city have …",
    "link": "https://biztoc.com/x/01cf7327079ff64a",
    "timestamp": "2025-02-15T13:44:33Z"
  },
  {
    "title": "'I'm on Trump time:' Kellogg says Russia-Ukraine peace plan could come in days or weeks",
    "description": "U.S. Special Presidential Envoy for Ukraine and Russia Keith Kellogg said Saturday that a peace plan for the two warring nations could come within days or weeks.\n\"I'm on Trump time,\" Kellogg told delegates at a fringe event at the Munich Security Conference, …",
    "link": "https://biztoc.com/x/afac8ed57fedd01a",
    "timestamp": "2025-02-15T13:44:14Z"
  },
  {
    "title": "News agency Reuters is in Donald Trump and Elon Musk's line of fire, but there's a catch; here's what happened",
    "description": "Donald Trump and Elon Musk are attacking Reuters over a $9 million U.S. government contract from 2018. However, this contract was awarded during Trump’s presidency and did not fund Reuters' newsroom but rather a separate entity, Thomson Reuters Special Servic…",
    "link": "https://economictimes.indiatimes.com/news/international/us/news-agency-reuters-is-in-donald-trump-and-elon-musks-line-of-fire-but-theres-a-catch-heres-what-happened/articleshow/118278664.cms",
    "timestamp": "2025-02-15T13:43:00Z"
  },
  {
    "title": "Trump Offers India the F-35A Lightning II as it Faces the Su-57 Felon at Aero India 2025",
    "description": "In a surprise announcement, U.S. President Donald Trump offered India to acquire the F-35 Lightning II, while at the same time the jet met for the first time at an airshow the Russian Su-57. Aero India 2025, the largest air show in Asia, will go down in histo…",
    "link": "https://theaviationist.com/2025/02/15/trump-offers-india-f-35a-aero-india-2025/",
    "timestamp": "2025-02-15T13:41:39Z"
  },
  {
    "title": "Israel, Hamas Complete Sixth Hostage-Prisoner Swap Under Gaza Truce",
    "description": "Palestinian militants released three Israeli hostages on Saturday in exchange for hundreds of Palestinian inmates freed by Israel, completing the latest swap despite fears the Gaza truce deal was near collapse.",
    "link": "https://www.ndtv.com/world-news/israel-hamas-complete-sixth-hostage-prisoner-swap-under-gaza-truce-7718069",
    "timestamp": "2025-02-15T13:40:53Z"
  },
  {
    "title": "Unemployment spikes in Washington, D.C. as Trump and Musk begin efforts to shrink the government",
    "description": "Since Trump has taken office, nearly 4,000 workers have filed for unemployment insurance as part of a surge that began at the start of the new year",
    "link": "https://www.cnbc.com/2025/02/15/washington-dc-unemployment-spikes-as-trump-and-musk-begin-efforts-to-shrink-the-government.html",
    "timestamp": "2025-02-15T13:39:02Z"
  },
  {
    "title": "Russia Claims Capture of Another Village in Ukraine's Donetsk Region",
    "description": "Russia said Saturday its forces had captured the village of Berezivka in their latest breakthrough in eastern Ukraine's Donetsk region, where Ukrainian defenses are creaking.\nThe post Russia Claims Capture of Another Village in Ukraine’s Donetsk Region appear…",
    "link": "https://www.breitbart.com/europe/2025/02/15/russia-claims-capture-of-another-village-in-ukraines-donetsk-region/",
    "timestamp": "2025-02-15T13:38:54Z"
  },
  {
    "title": "Trump’s Threats and Statehood Taunts Reset Race to Lead Canada",
    "description": "For over a year, Canada’s Conservative Party seemed on track to win a decisive victory in the next election as Justin Trudeau’s governing coalition crumbled. Now, nothing seems guaranteed — and the reason is Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-threats-and-statehood-taunts-reset-race-to-lead-canada",
    "timestamp": "2025-02-15T13:31:47Z"
  },
  {
    "title": "Fox News AI Newsletter: Trump's Stargate ambitions",
    "description": "Stay up to date on the latest AI technology advancements and learn about the challenges and opportunities AI presents",
    "link": "https://www.foxnews.com/tech/ai-newsletter-trumps-stargate-ambitions",
    "timestamp": "2025-02-15T13:30:12Z"
  },
  {
    "title": "Here are the risks — and rewards — of NYC Mayor Eric Adams’ Trump alliance",
    "description": "The president and mayor have become very close, critics say.",
    "link": "https://nypost.com/2025/02/15/opinion/the-risks-and-rewards-of-nyc-mayor-eric-adams-trump-alliance/",
    "timestamp": "2025-02-15T13:30:00Z"
  },
  {
    "title": "'I'm on Trump time:' Kellogg says Russia-Ukraine peace plan could come in days or weeks",
    "description": "U.S. Special Presidential Envoy for Ukraine and Russia Keith Kellogg said Saturday that peace plan for the two warring nations could come within days or weeks.",
    "link": "https://www.cnbc.com/2025/02/15/kellogg-says-russia-ukraine-peace-plan-could-come-in-days-or-weeks.html",
    "timestamp": "2025-02-15T13:28:52Z"
  },
  {
    "title": "Hamas, Israel complete sixth hostage-prisoner swap under Gaza truce",
    "description": "Palestinian militants exchanged three Israeli hostages for hundreds of Palestinian prisoners, with Hamas threatening to halt further releases over alleged Israeli violations. The agreement comes under intense strain, with future negotiations aiming at a more …",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/hamas-israel-complete-sixth-hostage-prisoner-swap-under-gaza-truce/articleshow/118278267.cms",
    "timestamp": "2025-02-15T13:21:40Z"
  },
  {
    "title": "US stock market predictions: S&P 500 eyes record high. Will Dow Jones, Nasdaq make big jump?",
    "description": "US stock market indexes S&P 500, Dow Jones, and Nasdaq closed on higher note on Friday. Here are several factors that may impact Wall Street, and New York Stock Exchange on Monday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-predictions-sp-500-eyes-record-high-will-dow-jones-nasdaq-make-big-jump/articleshow/118277907.cms",
    "timestamp": "2025-02-15T13:10:11Z"
  },
  {
    "title": "Zelensky calls for ‘European army’ to deter Russia",
    "description": "<p>MUNICH - Ukrainian President Volodymyr Zelensky called on Saturday for the creation of a European army, arguing the continent could no longer be sure of protection from the United States and would only get respect from Washington with a strong military.</p>",
    "link": "https://www.bangkokpost.com/world/2961718/zelensky-calls-for-european-army-to-deter-russia",
    "timestamp": "2025-02-15T13:07:00Z"
  },
  {
    "title": "The roots of Donald Trump’s fixation with South Africa",
    "description": "Tesla and SpaceX CEO Elon Musk and President Donald Trump appear in the Oval Office at the White House on February 11.﻿ | Andrew Harnik/Getty Images\nLast week, President Donald Trump signed an executive order stopping all aid to South Africa and offering refu…",
    "link": "https://biztoc.com/x/d87eaa4f527f017a",
    "timestamp": "2025-02-15T13:03:09Z"
  },
  {
    "title": "Kid Rock Stuns Bill Maher With DEI Commentary About Kendrick Lamar’s Halftime Show",
    "description": "\"I think Jay-Z and Kendrick Lamar should both send Colin Kaepernick a Bundt cake and a six-pack of beer,\" insisted the rapper.",
    "link": "https://decider.com/2025/02/15/kid-rock-stuns-bill-maher-with-dei-commentary-about-kendrick-lamars-halftime-show/",
    "timestamp": "2025-02-15T13:02:24Z"
  },
  {
    "title": "Hungary's transformation into an 'electoral autocracy' has parallels to Trump's second term",
    "description": "U.S. conservatives have looked to Hungary's Viktor Orbán as an inspiration for a right-wing America, and the prime minister has become a close ally of President Donald Trump",
    "link": "https://abcnews.go.com/US/wireStory/hungarys-transformation-electoral-autocracy-parallels-trumps-term-118854251",
    "timestamp": "2025-02-15T13:02:20Z"
  },
  {
    "title": "Tateona Williams: Death of 2 homeless children in frigid Detroit raises questions about a flawed system in peril",
    "description": "The tragedy has the city reevaluating how it connects homeless families with shelters amid fears federal support for people in or on the precipice of homelessness could wane as the Trump administration pushes to slash spending.",
    "link": "https://www.cnn.com/2025/02/15/us/tateona-williams-detroit-homelessness-crisis/index.html",
    "timestamp": "2025-02-15T13:00:47Z"
  },
  {
    "title": "Here's What 27 Trump Supporters Said He Would Have To Do To Lose Their Support",
    "description": "\"We didn't vote for my husband to lose his government career and benefits.\"",
    "link": "https://www.huffpost.com/entry/trump-supporters-lose-support_n_67af70f2e4b014c4688dabb0",
    "timestamp": "2025-02-15T13:00:24Z"
  },
  {
    "title": "Crypto and Trump gang up on FDIC over debanking: 'Our story is pretty ridiculous'",
    "description": "After years of struggles with the Biden administration, crypto executives have allies across Washington, and now have a platform to voice their complaints.",
    "link": "https://www.cnbc.com/2025/02/15/crypto-trump-gop-leadershipo-gang-up-on-fdic-over-debanking-.html",
    "timestamp": "2025-02-15T13:00:02Z"
  },
  {
    "title": "Appeals Court Again Blocks Order Requiring LSU To Reinstate Law Prof Who Used F-Bomb In Criticising Gov. Landry And President Trump",
    "description": "The Advocate, LSU Law Professor Again Barred From Classroom After Appeals Court Sides With University: A state appeals court has halted a lower court's ruling requiring LSU to return a tenured law professor to his teaching duties after the university suspende…",
    "link": "https://taxprof.typepad.com/taxprof_blog/2025/02/court-blocks-order-requiring-lsu-to-reinstate-law-prof-who-used-f-bomb-in-criticising-trump.html",
    "timestamp": "2025-02-15T13:00:00Z"
  },
  {
    "title": "Lorne Michaels reveals his POV for handling both Dem and Republican politics on ‘SNL’: ‘Whoever is in power is probably awful’",
    "description": "\"It can't be, 'I like everything you do' — that's dishonest,\" \"SNL\" creator Lorne Michaels said of skewering both Republicans and Democrats.",
    "link": "https://pagesix.com/2025/02/15/entertainment/lorne-michaels-reveals-his-pov-for-politics-on-saturday-night-live/",
    "timestamp": "2025-02-15T13:00:00Z"
  },
  {
    "title": "Sikh communities fear immigration raids at temples as Trump ends sanctuary for houses of worship",
    "description": "Sikh community members say anxiety over the immigration crackdown is hindering how some, including naturalized citizens, practice their faith.",
    "link": "https://www.nbcnews.com/news/asian-america/sikh-communities-fear-immigration-raids-trump-ends-sanctuary-rcna192095",
    "timestamp": "2025-02-15T13:00:00Z"
  },
  {
    "title": "‘Mini-Me’ Executive Branch Agencies Run Amok. Not for Much Longer, If Trump Has His Way.",
    "description": "In a letter that no doubt sent shock waves through Washington’s permanent, untouchable bureaucracy, President Donald Trump’s acting solicitor general, Sarah Harris, sent a letter... Read More\nThe post ‘Mini-Me’ Executive Branch Agencies Run Amok. Not for Much…",
    "link": "https://www.dailysignal.com/2025/02/15/mini-me-executive-branch-agencies-run-amok-not-for-much-longer-if-trump-has-his-way/",
    "timestamp": "2025-02-15T13:00:00Z"
  },
  {
    "title": "The Best Saturday Night Live Hosts of All Time",
    "description": "The award-winning actors, charismatic athletes, and former show cast members who make the best SNL hosts",
    "link": "https://time.com/7225548/best-saturday-night-live-hosts-ever/",
    "timestamp": "2025-02-15T13:00:00Z"
  },
  {
    "title": "Federal workers forced to return to offices with no desks –– and plenty of chaos: report",
    "description": "Federal workers forced to return to offices by Donald Trump's administration are showing up to facilities lacking desks and equipment allowing them to do their jobs.According to a report from the Washington Post, \"chaos\" is a nice way of putting what is going…",
    "link": "https://www.rawstory.com/federal-workers-2671162220/",
    "timestamp": "2025-02-15T12:56:51Z"
  },
  {
    "title": "Zelenskyy's Europe armed forces call is harsh truth that London, Paris and Berlin needed to hear",
    "description": "It is time for an armed forces of Europe.",
    "link": "https://news.sky.com/story/zelenskyys-europe-armed-forces-call-is-harsh-truth-that-london-paris-and-berlin-needed-to-hear-13309765",
    "timestamp": "2025-02-15T12:55:00Z"
  },
  {
    "title": "‘Get rid of it’: Kevin O’Leary backs Trump on eliminating the US penny — calls it ‘stupid’ unless you’re ‘putting them in your loafers.’ Here’s 1 shiny alternative if you really love mint",
    "description": "We adhere to strict standards of editorial integrity to help you make decisions with confidence. Some or all links contained within this article are paid links.\nThe U.S. penny has been in circulation for more than two centuries, but its time may soon be up af…",
    "link": "https://biztoc.com/x/2af0c8d13402952b",
    "timestamp": "2025-02-15T12:54:19Z"
  },
  {
    "title": "‘BRICS is dead’ if it messes with dollar – Trump",
    "description": "The US president has warned of severe tariffs if the geopolitical bloc pursues a common currency\n\n\r\n\n\nUS President Donald Trump announces reciprocal tariffs in the Oval Office @ Andrew Harnik/Getty Images\r\n\n\r\n\n\n\nUS President Donald Trump has declared the BRIC…",
    "link": "https://www.sinhalanet.net/brics-is-dead-if-it-messes-with-dollar-trump",
    "timestamp": "2025-02-15T12:53:59Z"
  },
  {
    "title": "Michel Franco Talks Mexico-U.S. Immigration Relationship Drama ‘Dreams’ & How It Is Not Related To Trump; Reveals He’s Yet To See ‘Emilia Pérez’",
    "description": "EXCLUSIVE: Mexican director Michel Franco touches down at the Berlin Film Festival this weekend with drama Dreams starring Jessica Chastain, who is also an associate producer under the banner of her company Freckle Films. A twist on the star-crossed lovers ro…",
    "link": "http://deadline.com/2025/02/michel-franco-dreams-trump-emilia-perez-1236290776/",
    "timestamp": "2025-02-15T12:53:12Z"
  },
  {
    "title": "Government Workers Cannot Be Fired for Their Political Views",
    "description": "The First Amendment forbids widespread loyalty purges.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/02/employee-firing-first-amendment/681702/",
    "timestamp": "2025-02-15T12:48:36Z"
  },
  {
    "title": "The Truth About Yemen’s Houthis and Their New Terrorist Designation",
    "description": "The Houthis, an Iranian-sponsored terrorist group operating in Yemen, say support for Palestinians led the United States to designate them as terrorists. On January 22, 2025, US President Donald Trump set the wheels in motion to renew the listing of these reb…",
    "link": "https://www.fairobserver.com/world-news/the-truth-about-yemens-houthis-and-their-new-terrorist-designation/",
    "timestamp": "2025-02-15T12:48:32Z"
  },
  {
    "title": "Sen. Sanders: Trump and the Republicans want to make massive cuts to Medicaid, Education and massive cuts in Housing...",
    "description": "@BernieSanders Donald Trump is accumulating more and more power into his own hands. He is usurping Congress and challenging the courts in a way that has never been done before. This country is the longest standing democracy on earth. We cannot let Trump to ta…",
    "link": "https://freerepublic.com/focus/f-chat/4297791/posts",
    "timestamp": "2025-02-15T12:46:12Z"
  },
  {
    "title": "Elon Musk Tricks CNN Host to Read His Dirty Joke Live On-Air (Dana Bash—video and transcript)",
    "description": "Video Transcript: What's happening on the other side is kind of what we showed you there with Elon and Trump. It's like there's laughing, there's fun, there's kids around. Think back to last week when Donald Trump signed the executive action banning boys in g…",
    "link": "https://freerepublic.com/focus/f-chat/4297790/posts",
    "timestamp": "2025-02-15T12:42:28Z"
  },
  {
    "title": "Is Meghan Markle planning a US political career? Royal couple's donations raise eyebrows",
    "description": "Prince Harry and Meghan Markle’s Archewell Foundation is facing scrutiny over donations to organizations and individuals linked to the U.S. Democratic Party. Public records show payments to media strategist Jiore Craig, Markup News Inc., and Women’s Wellness …",
    "link": "https://economictimes.indiatimes.com/magazines/panache/is-meghan-markle-planning-a-us-political-career-royal-couples-donations-raise-eyebrows/articleshow/118277023.cms",
    "timestamp": "2025-02-15T12:39:19Z"
  },
  {
    "title": "Germany rebuffs ‘dictated peace’ for Ukraine at Munich security summit",
    "description": "Chancellor Olaf Scholz also rejected the call by US Vice President JD Vance to open Germany's door to far-right parties.",
    "link": "https://www.aljazeera.com/news/2025/2/15/germanys-scholz-offers-firm-backing-for-ukraine-on-day-2-of-munich-summit",
    "timestamp": "2025-02-15T12:36:15Z"
  }
]