[
  {
    "title": "Trump to reclassify wide swaths of federal workers to allow for more firings",
    "description": "President announces more employees under ‘Schedule F’ can be hired or fired based on their allegiance to him\nDonald Trump on Friday said his administration is implementing a move that will allow far more firings of federal employees and will make significantl…",
    "link": "https://biztoc.com/x/73c6cbf3452e2715",
    "timestamp": "2025-04-18T23:31:08Z"
  },
  {
    "title": "'Pod Save America' Slams Gavin Newsom For Calling Man's Mistaken Deportation A 'Distraction'",
    "description": "“Democrats look cowardly, calculating, and f**king ridiculous” by backing down on Kilmar Abrego Garcia’s case, former Obama aide Dan Pfeiffer said.",
    "link": "https://www.huffpost.com/entry/newsom-pod-save-america-distraction_n_6802baabe4b0afffe5e786a4",
    "timestamp": "2025-04-18T23:30:05Z"
  },
  {
    "title": "10,000 pages of records about Robert F. Kennedy's assassination are released",
    "description": "Kennedy was shot and killed June 5, 1968, at the Ambassador Hotel in Los Angeles moments after giving a speech.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_ed5e2177-e718-511a-ba56-bf536617305b.html",
    "timestamp": "2025-04-18T23:30:00Z"
  },
  {
    "title": "10,000 pages of records about Robert F. Kennedy's assassination are released",
    "description": "Kennedy was shot and killed June 5, 1968, at the Ambassador Hotel in Los Angeles moments after giving a speech.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_f1775a41-a6db-5075-a001-92a2942d7c29.html",
    "timestamp": "2025-04-18T23:30:00Z"
  },
  {
    "title": "EEOC instructs staff to sideline all new transgender discrimination cases, employees say",
    "description": "The agency is classifying all new gender identity-related discrimination cases as its lowest priority.",
    "link": "https://www.bostonherald.com/2025/04/18/eeoc-gender-identity-discrimination/",
    "timestamp": "2025-04-18T23:28:44Z"
  },
  {
    "title": "Bessent replaces acting IRS commissioner in power struggle with Musk",
    "description": "The move came hours after a report that Bessent approached President Donald Trump to complain that Musk had gone around him to get his pick appointed.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/politics/bessent-irs-commissioner-musk/",
    "timestamp": "2025-04-18T23:27:00Z"
  },
  {
    "title": "Uncertainties Are Churning U.S. Stock Market Outlooks",
    "description": "Beneath the stock market volatility are multiple uncertainties.",
    "link": "https://www.forbes.com/sites/johntobey/2025/04/18/uncertainties-are-churning-us-stock-market-outlooks/",
    "timestamp": "2025-04-18T23:25:32Z"
  },
  {
    "title": "Tropical drinks by the pool? Not so fast, says senator who visited Abrego Garcia in El Salvador",
    "description": "The senator referred to the stagecraft with a term that ricocheted around social media: 'Margaritagate.'",
    "link": "https://www.bostonherald.com/2025/04/18/deportation-error-margaritagate/",
    "timestamp": "2025-04-18T23:24:48Z"
  },
  {
    "title": "Ford ‘adjusts’ some exports to China due to tariffs",
    "description": "Citing the US-China trade conflict, Ford said Friday it has “adjusted” its exports to the country, where the US auto giant operates manufacturing jointly with local partners. “We have adjusted exports from the US to China in light of the current tariffs,” For…",
    "link": "https://www.digitaljournal.com/world/ford-adjusts-some-exports-to-china-due-to-tariffs/article",
    "timestamp": "2025-04-18T23:22:33Z"
  },
  {
    "title": "'Bizarre': Scientists stunned as Trump turns Covid website 'into a conspiracy theory page'",
    "description": "Doctors, policy analysts and members of the media reacted badly to President Donald Trump's administration replacing the pivotal Covid.gov government website with what critics described as an ill-conceived movie poster.“The United States has, it seems, lost t…",
    "link": "https://www.rawstory.com/trump-2671803256/",
    "timestamp": "2025-04-18T23:19:01Z"
  },
  {
    "title": "Judge Deals Major Blow To Trump’s Passport Policy",
    "description": "The judge found that the policy, which bars a gender-neutral \"X\" marker on passports, discriminated against trans people on the basis of sex.",
    "link": "https://www.huffpost.com/entry/judge-deals-major-blow-to-trumps-passport-policy_n_67eee185e4b006990d0e27c5",
    "timestamp": "2025-04-18T23:18:04Z"
  },
  {
    "title": "Trump seeks to put more civil servants under his control",
    "description": "The move would give him power to directly hire and fire as many as 50,000 jobs reserved for career federal employees.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/politics/trump-civil-servants-control/",
    "timestamp": "2025-04-18T23:16:00Z"
  },
  {
    "title": "Josh Shapiro Says He Never Heard From Trump After Antisemitic Arson Attack on His Home",
    "description": "The Pennsylvania governor tells \"Good Morning America\" that he has heard from other prominent Republicans since Monday\nThe post Josh Shapiro Says He Never Heard From Trump After Antisemitic Arson Attack on His Home appeared first on TheWrap.",
    "link": "https://www.thewrap.com/josh-shapiro-arson-has-not-heard-from-donald-trump/",
    "timestamp": "2025-04-18T23:15:52Z"
  },
  {
    "title": "Trump calls Sen. Van Hollen ‘grandstander’ for Kilmar Abrego Garcia meeting",
    "description": "President Donald Trump trashed Sen. Chris Van Hollen as a “fool” and a “grandstander” on Friday for meeting with wrongly deported immigrant Kilmar Abrego...",
    "link": "https://www.nydailynews.com/2025/04/18/trump-van-hollen-kilmar-abrego-garcia/",
    "timestamp": "2025-04-18T23:15:00Z"
  },
  {
    "title": "Van Hollen on Alleged MS-13, Wife-Beating, Illegal Migrant: 'Let Him Go'",
    "description": "Maryland Democrat Senator Chris Van Hollen, who is championing the jailed illegal migrant Kilmar Abrego Garcia, has some loud American advice for El Salvador's government: “They should just let him go.”arcia, has some loud American advice for El Salvador's go…",
    "link": "https://www.breitbart.com/immigration/2025/04/18/van-hollen-on-alleged-ms-13-wife-beating-illegal-migrant-let-him-go/",
    "timestamp": "2025-04-18T23:10:23Z"
  },
  {
    "title": "Google loses online ad monopoly case. But it’s just one of many antitrust battles against big tech",
    "description": "The cases against Google, Meta, Apple and Amazon could profoundly shape the future of global technology.",
    "link": "https://theconversation.com/google-loses-online-ad-monopoly-case-but-its-just-one-of-many-antitrust-battles-against-big-tech-254602",
    "timestamp": "2025-04-18T23:09:18Z"
  },
  {
    "title": "Risks Digest 34.61",
    "description": "Posted by RISKS List Owner on Apr 18RISKS-LIST: Risks-Forum Digest Friday 18 April 2025 Volume 34 : Issue 61\n\nACM FORUM ON RISKS TO THE PUBLIC IN COMPUTERS AND RELATED SYSTEMS (comp.risks)\nPeter G. Neumann, founder and still moderator\n\n***** See last item for…",
    "link": "https://seclists.org/risks/2025/q2/1",
    "timestamp": "2025-04-18T23:08:24Z"
  },
  {
    "title": "Pandemic Truthers Take Over HHS Covid Site",
    "description": "As of Friday, Covid.gov, the Department of Health and Human Services COVID-19 resource launched in 2022, is no longer providing information and resources about Covid—and Covidtests.gov, the website used to order free Covid tests from the government, isn’t, ei…",
    "link": "https://www.motherjones.com/politics/2025/04/covid-gov-hhs-website-pandemic-misinfo/",
    "timestamp": "2025-04-18T23:07:57Z"
  },
  {
    "title": "Pandemic Truthers Take Over HHS Covid Site",
    "description": "As of Friday, Covid.gov, the Department of Health and Human Services COVID-19 resource launched in 2022, is no longer providing information and resources about Covid—and Covidtests.gov, the website used to order free Covid tests from the government, isn’t, ei…",
    "link": "https://www.motherjones.com/coronavirus-updates/2025/04/covid-gov-hhs-website-pandemic-misinfo/",
    "timestamp": "2025-04-18T23:07:57Z"
  },
  {
    "title": "Trump’s media company urges feds to probe firm that bet against it",
    "description": "The president’s media company is urging the Securities and Exchange Commission to investigate a firm that bet against it, Reuters is reporting.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-media-qube-securities-exchange-commission-rcna201916",
    "timestamp": "2025-04-18T23:02:40Z"
  },
  {
    "title": "EEOC instructs staff to sideline all new transgender discrimination cases, employees say",
    "description": "The federal agency tasked with protecting workers’ civil rights is classifying all new gender identity-related discrimination cases as its lowest priority while also placing them on indefinite hold, according to two agency employees",
    "link": "https://abcnews.go.com/Business/wireStory/eeoc-instructs-staff-sideline-new-transgender-discrimination-cases-120962621",
    "timestamp": "2025-04-18T23:02:10Z"
  },
  {
    "title": "U.S. open to recognizing Crimea as Russian in Ukraine deal",
    "description": "The signal comes as the Trump administration said it is prepared to move on from its peace-brokering efforts unless progress is made quickly.",
    "link": "https://www.japantimes.co.jp/news/2025/04/19/world/politics/us-recognizing-crimea-russian-ukraine/",
    "timestamp": "2025-04-18T23:02:00Z"
  },
  {
    "title": "Hayek’s Bastards: The Neoliberal Roots of the Populist Right – A history of the contemporary movement’s offensive against equality",
    "description": "Quinn Slobodian maps out the emergence of the far right on the back of crises caused by neoliberalism",
    "link": "https://www.irishtimes.com/culture/books/review/2025/04/19/hayeks-bastards-the-neoliberal-roots-of-the-populist-right-a-history-of-the-contemporary-movements-offensive-against-equality/",
    "timestamp": "2025-04-18T23:00:00Z"
  },
  {
    "title": "Virginia judge hailed for 'classic opinion' in Trump deportation showdown",
    "description": "J. Harvie Wilkinson III aced the test for his former University of Virginia law professor, A.E. Dick Howard, with a 4th U.S. Court of Appeals ruling this week on the constitutional showdown between President Donald Trump and the federal courts over the deport…",
    "link": "https://richmond.com/news/state-regional/government-politics/article_a374b1d8-ce2c-4200-b78a-843c935697b2.html",
    "timestamp": "2025-04-18T23:00:00Z"
  },
  {
    "title": "Designed in US, made in China: Why Apple is stuck",
    "description": "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?",
    "link": "https://www.bbc.com/news/articles/czx17361pw1o",
    "timestamp": "2025-04-18T22:56:24Z"
  },
  {
    "title": "Trump goes to war with the Fed",
    "description": "by Daniel AVISDonald Trump's simmering discontent with the US Federal Reserve boiled over this week, with the president threatening to take the unprecedented step of ousting the head of the fiercely independent central bank.Trump has repeatedly said he wants …",
    "link": "https://www.rawstory.com/trump-fed-2671803226/",
    "timestamp": "2025-04-18T22:54:08Z"
  },
  {
    "title": "Thousands of RFK assassination documents released, following Trump's order",
    "description": "US government releases nearly 10,000 pages of documents linked to the 1968 assassination of Sen. Robert F. Kennedy. Among them are chilling handwritten notes from gunman Sirhan Sirhan, who described an obsession with killing the senator.",
    "link": "https://www.israelnationalnews.com/news/407050",
    "timestamp": "2025-04-18T22:51:08Z"
  },
  {
    "title": "Trump Cabinet Officials ‘Rushed’ to Oval Office To Convince Trump To Scale Back Tariffs While Trade Adviser Was Away",
    "description": "Two of President Donald Trump’s cabinet officials conspired to confront him on scaling back tariffs while trade adviser Peter Navarro was away from the Oval Office, according to The Wall Street Journal. The paper reported Friday that on the morning of April 9…",
    "link": "https://www.mediaite.com/trump/trump-cabinet-officials-rushed-to-oval-office-to-convince-trump-to-scale-back-tariffs-while-trade-adviser-was-away/",
    "timestamp": "2025-04-18T22:50:28Z"
  },
  {
    "title": "Trump Touts Seemingly Doctored Photo of Abrego Garcia’s Hand in Attempt To Prove Maryland Man Is Gang Member",
    "description": "President Donald Trump posted a photo of himself holding a seemingly digitally altered image of the left hand of Kilmar Abrego Garcia, who was wrongly deported to El Salvador last month.\nThe post Trump Touts Seemingly Doctored Photo of Abrego Garcia’s Hand in…",
    "link": "https://www.mediaite.com/trump/trump-touts-seemingly-doctored-photo-of-abrego-garcias-hand-in-attempt-to-prove-maryland-man-is-gang-member/",
    "timestamp": "2025-04-18T22:47:09Z"
  },
  {
    "title": "Trump moves to invoke Schedule F to make it easier to fire some federal workers",
    "description": "President Donald Trump is moving to reclassify some federal workers to make it easier to fire them",
    "link": "https://abcnews.go.com/US/wireStory/trump-moves-invoke-schedule-make-easier-fire-federal-120959262",
    "timestamp": "2025-04-18T22:46:19Z"
  },
  {
    "title": "Trump criticizes senator for meeting with man wrongly deported to El Salvador",
    "description": "President Trump criticized Maryland Senator Chris Van Hollen for meeting with Kilmar Abrego Garcia, a man wrongly deported to El Salvador, as a federal appeals court challenges the administration's stance.",
    "link": "https://www.kcra.com/article/trump-criticizes-senator-meeting-with-kilmar-abrego-garcia/64526421",
    "timestamp": "2025-04-18T22:44:03Z"
  },
  {
    "title": "EXCLUSIVE: As Afghan Christians face deportation, faith leaders urge Trump administration to reconsider",
    "description": "Afghan Christians in the U.S. face imminent deportation after the termination of TPS, and faith leaders have made urgent appeals to the Trump administration.",
    "link": "https://www.foxnews.com/politics/exclusive-afghan-christians-face-deportation-faith-leaders-urge-trump-administration-reconsider",
    "timestamp": "2025-04-18T22:43:55Z"
  },
  {
    "title": "What Is Schedule F? Trump's Move to Fire 50k Federal Workers More Easily",
    "description": "Trump's forthcoming move to reinstate Schedule F could impact tens of thousands of federal employees.",
    "link": "https://www.newsweek.com/what-schedule-f-trumps-move-fire-50k-federal-workers-more-easily-2061651",
    "timestamp": "2025-04-18T22:42:26Z"
  },
  {
    "title": "David Brooks mans the barricades",
    "description": "Yesterday, in his New York Times column, David Brooks called for a mass uprising against Donald Trump. Now that’s a sentence I never thought I’d write, much less read. But this is 2025, and with Trump on a rampage, things are getting very weird indeed.  Brook…",
    "link": "https://www.wehuntedthemammoth.com/2025/04/18/david-brooks-mans-the-barricades/",
    "timestamp": "2025-04-18T22:35:58Z"
  },
  {
    "title": "More than 400 Day of Action demonstrations set Saturday against Trump, policies",
    "description": "More than 400 demonstrations are planned nationwide on Saturday against President Donald Trump and his policies.",
    "link": "https://www.upi.com/Top_News/US/2025/04/18/Day-of-Action-505051-demonstrations/7971745013195/",
    "timestamp": "2025-04-18T22:34:01Z"
  },
  {
    "title": "Trump and Rubio’s Oscar-Worthy Takedown of a Crime-Loving Democrat",
    "description": "The Sting (1973) is a classic crime-comedy film directed by George Roy Hill. Set in 1930s Chicago, it follows con artist Johnny Hooker (Robert Redford) and veteran grifter Henry Gondorff (Paul Newman) as they team up to pull off an elaborate con against a rut…",
    "link": "https://freerepublic.com/focus/f-bloggers/4311883/posts",
    "timestamp": "2025-04-18T22:33:36Z"
  },
  {
    "title": "6 Major Developments That The Mainstream Media Is Being Strangely Quiet About Right Now",
    "description": "Absolutely enormous things are happening all over the globe, but you aren’t hearing a lot about many of them.  That is because the mainstream media chooses to focus on stories that advance the specific narratives that they are currently pushing.",
    "link": "https://www.shtfplan.com/headline-news/6-major-developments-that-the-mainstream-media-is-being-strangely-quiet-about-right-now",
    "timestamp": "2025-04-18T22:30:51Z"
  },
  {
    "title": "Legal fight raging over possible imminent deportations to El Salvador",
    "description": "The Trump administration appeared on Friday to be preparing to send a new group of Venezuelan men from the U.S. to El Salvador's notorious CECOT prison.",
    "link": "https://www.nbcnews.com/politics/national-security/legal-fight-raging-possible-imminent-deportations-el-salvador-rcna201928",
    "timestamp": "2025-04-18T22:30:46Z"
  },
  {
    "title": "Sen. Van Hollen Says Trump Administration Made $15 Million Deal With El Salvador To Imprison Deportees Including Abrego Garcia",
    "description": "Van Hollen provided updates on Abrego Garcia’s detainment Friday after meeting with the mistakenly deported man Thursday.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/04/18/sen-van-hollen-says-trump-administration-made-15-million-deal-with-el-salvador-to-imprison-deportees-including-abrego-garcia/",
    "timestamp": "2025-04-18T22:30:35Z"
  },
  {
    "title": "Ukraine minerals deal may not buy peace after Trump threat",
    "description": "As Trump threatens to walk from peace talks, a mineral deal looks unlikely to offer Ukraine security.",
    "link": "https://www.bbc.com/news/articles/cy5rqvqg36qo",
    "timestamp": "2025-04-18T22:29:46Z"
  },
  {
    "title": "Dr. Oz’s Granddaughter, 11, Faints During Swearing-In at White House",
    "description": "Dr. Mehmet Oz’s granddaughter, Philomena, fainted while President Donald Trump spoke at the White House after Oz’s swearing-in ceremony. Oz, 64, was at the White House on Friday, April 18, to be sworn in as Trump’s administrator of the Centers for Medicare an…",
    "link": "https://www.usmagazine.com/celebrity-news/news/dr-ozs-11-year-old-granddaughter-faints-during-trump-speech/#article",
    "timestamp": "2025-04-18T22:29:14Z"
  },
  {
    "title": "Google is in more danger than ever of being broken up",
    "description": "After half a decade fighting to keep its empire together, Google’s defenses are wearing thin. The company is facing a two-front war that could fundamentally reshape its business, and, the US Department of Justice argues, open new opportunities for its competi…",
    "link": "https://www.theverge.com/policy/652170/google-search-ad-tech-remedies-antitrust-chrome-breakup",
    "timestamp": "2025-04-18T22:27:19Z"
  },
  {
    "title": "US: Trump says will 'pass' on Ukraine talks if too difficult",
    "description": "US President Donald Trump said the clock was ticking on closing a peace deal between Ukraine and Russia. Plus, a US senator said the man who was wrongly deported to El Salvador has been transferred out of a mega-prison.",
    "link": "https://www.dw.com/en/us-trump-says-will-pass-on-ukraine-talks-if-too-difficult/live-72285227",
    "timestamp": "2025-04-18T22:25:00Z"
  },
  {
    "title": "Donald Trump says US may ‘take a pass’ on Ukraine talks if progress is not achieved soon",
    "description": "Donald Trump has said the US could “take a pass” on Ukraine peace talks if they become too difficult but added he thought there was a “good chance” of succeeding.",
    "link": "https://www.independent.ie/world-news/donald-trump-says-us-may-take-a-pass-on-ukraine-talks-if-progress-is-not-achieved-soon/a79254746.html",
    "timestamp": "2025-04-18T22:24:56Z"
  },
  {
    "title": "Hegseth and Noem Decide on Insurrection Act Guidance for Trump: Report",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDefense Secretary Pete Hegseth and Homeland Security Secretary Kristi Noem are not planning to recommend that President Donald Trump invoke the Insurrection Act to address conditions at the southern border, mu…",
    "link": "https://biztoc.com/x/0f8cdd678ee1d3be",
    "timestamp": "2025-04-18T22:24:34Z"
  },
  {
    "title": "Complete Bridal owner in East Dundee warns wedding dress prices could go up hundreds because of Trump's China tariffs",
    "description": "Complete Bridal owner in East Dundee warns wedding dress prices could go up hundreds because of Trump's China tariffsabc7chicago.com",
    "link": "https://abc7chicago.com/post/complete-bridal-owner-east-dundee-warns-wedding-dress-prices-could-go-hundreds-because-trumps-china-tariffs/16199027/",
    "timestamp": "2025-04-18T22:24:15Z"
  },
  {
    "title": "IRS Chief Axed After Trump Official Complained About Musk Influence: Report",
    "description": "Gary Shapley is the fourth acting IRS commissioner to be replaced in the three months since Donald Trump took office.",
    "link": "https://biztoc.com/x/d961484ebd85b413",
    "timestamp": "2025-04-18T22:24:14Z"
  },
  {
    "title": "Stephen Miller: 'Democrat Party Using All of Its Power' to Fight for Accused Wife Beater, Gang Member",
    "description": "Stephen Miller, the White House's deputy chief of staff for policy and homeland security advisor, blasted the Democrat Party for fighting to bring a deported illegal alien with \"horrific crimes and allegations\" against him back to the United States to \"commit…",
    "link": "https://www.breitbart.com/crime/2025/04/18/stephen-miller-democrat-party-using-all-of-its-power-to-fight-for-accused-wife-beater-gang-member/",
    "timestamp": "2025-04-18T22:21:03Z"
  },
  {
    "title": "Hegseth and Noem Decide on Insurrection Act Guidance for Trump: Report",
    "description": "Trump issued an order in January declaring a border emergency and requesting a report from Hegseth and Noem within 90 days.",
    "link": "https://www.newsweek.com/hegseth-noem-decide-insurrection-act-guidance-trump-report-2061659",
    "timestamp": "2025-04-18T22:20:17Z"
  },
  {
    "title": "Firing Jerome Powell will crash financial markets — Sen. Elizabeth Warren",
    "description": "US Senator Elizabeth Warren warned that if President Donald Trump eventually moves to fire Federal Reserve Chair Jerome Powell, it could undermine investor confidence in the integrity of US capital markets and trigger a financial crash.During an appearance on…",
    "link": "https://cointelegraph.com/news/firing-jerome-powell-crash-financial-markets-elizabeth-warren",
    "timestamp": "2025-04-18T22:20:00Z"
  },
  {
    "title": "COREY LEWANDOWSKI: Trump’s Tariffs Are Payback For EU Scams And Snubs",
    "description": "President Trump’s new 25% tariff on imported automobiles is long overdue. Though the president is considering a temporary exemption.",
    "link": "https://dailycaller.com/2025/04/18/corey-lewandowski-trumps-tariffs-are-payback-for-eu-scams-and-snubs/",
    "timestamp": "2025-04-18T22:19:38Z"
  },
  {
    "title": "Sausage brandisher, rollercoaster rider…. vote winner?",
    "description": "Lib Dems don't tend to listen to right-wing podcasts.",
    "link": "https://news.sky.com/story/the-lib-dems-want-to-be-the-nice-guys-of-politics-but-is-that-what-voters-want-13351478",
    "timestamp": "2025-04-18T22:19:00Z"
  },
  {
    "title": "One Man’s Ordeal Triggers Test of US Constitution",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Jennifer Vasquez Sura (C), the wife of Kilmar Abrego Garcia of Maryland, who was mistakenly deported to El Salvador, speaks during a news conference at CASA's Multicultural Center in Hyattsville, Maryland, US, April …",
    "link": "https://www.hrw.org/news/2025/04/18/one-mans-ordeal-triggers-test-us-constitution",
    "timestamp": "2025-04-18T22:17:01Z"
  },
  {
    "title": "Homan argues US justified in deporting 'safety threat' Abrego Garcia to El Salvador",
    "description": "Border czar Tom Homan spoke with \"This Week\" co-anchor Jonathan Karl about the wrongful deportation of Kilmer Abrego Garcia.",
    "link": "https://abcnews.go.com/Politics/border-czar-tom-homan-argues-us-justified-removing/story?id=120948871",
    "timestamp": "2025-04-18T22:16:35Z"
  },
  {
    "title": "Trump to fast-track permitting for 10 mining projects across US",
    "description": "(Reuters) -The White House on Friday said it will fast-track permitting for 10 mining projects across the United States as part of President Donald Trump's...",
    "link": "https://www.yahoo.com/news/trump-fast-track-permitting-10-221508393.html",
    "timestamp": "2025-04-18T22:15:08Z"
  },
  {
    "title": "Abrego Garcia tells visiting US senator he's no longer held at notorious Salvadoran prison",
    "description": "Maryland Democratic Sen. Chris Van Hollen held an airport news conference after returning to the Washington area from El Salvador.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_8f0a79f8-32d2-578a-aa1b-8f313bf720a0.html",
    "timestamp": "2025-04-18T22:15:00Z"
  },
  {
    "title": "Abrego Garcia tells visiting US senator he's no longer held at notorious Salvadoran prison",
    "description": "Maryland Democratic Sen. Chris Van Hollen held an airport news conference after returning to the Washington area from El Salvador.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_04c3aa52-87c4-54cd-a6e8-fc47a83284ff.html",
    "timestamp": "2025-04-18T22:15:00Z"
  },
  {
    "title": "Denied, detained, deported: the most high-profile cases in Trump’s immigration crackdown - The Guardian",
    "description": "Denied, detained, deported: the most high-profile cases in Trump’s immigration crackdownThe Guardian They Never Thought Trump Would Have Them DeportedThe Atlantic This is not a drillThe Boston Globe Trump's second term aimed to stop border crossings, with swe…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177062761",
    "timestamp": "2025-04-18T22:13:09Z"
  },
  {
    "title": "IRS Chief Axed After Trump Official Complained About Musk Influence: Report",
    "description": "Gary Shapley is the fourth acting IRS commissioner to be replaced in the three months since Donald Trump took office.",
    "link": "https://www.newsweek.com/irs-chief-replaced-trump-elon-musk-doge-2061650",
    "timestamp": "2025-04-18T22:12:55Z"
  },
  {
    "title": "Tufts student challenging immigration arrest must be moved to Vermont, judge rules",
    "description": "The decision by US District Judge William Sessions in Burlington marked an early victory for Turkish national Rumeysa Ozturk.",
    "link": "https://www.jpost.com/american-politics/article-850645",
    "timestamp": "2025-04-18T22:07:45Z"
  },
  {
    "title": "Ticker: Fishers celebrate Trump’s seafood order while conservation groups fear overfishing; Capital One $35B purchase of Discover Financial gets regulatory approvals",
    "description": "President Donald Trump’s executive order to boost the U.S. commercial fishing industry drew praise from commercial fishing groups and condemnation from environmental organizations who said they fear cutting regulations will harm fish populations that have alr…",
    "link": "https://www.bostonherald.com/2025/04/18/ticker-fishers-celebrate-trumps-seafood-order-while-conservation-groups-fear-overfishing-capital-one-35b-purchase-of-discover-financial-gets-regulatory-approvals/",
    "timestamp": "2025-04-18T22:03:34Z"
  },
  {
    "title": "Trump: New personnel management regulations",
    "description": "United States President Donald Trump stated that following his \"day one executive order, the Office of Personnel Management will be issuing new civil service regulations for career government employee...",
    "link": "https://biztoc.com/x/8af8471e0034d635",
    "timestamp": "2025-04-18T22:02:23Z"
  },
  {
    "title": "Conservative judge slams lack of due process in Abrego Garcia case",
    "description": "This week’s Deadline: Legal Newsletter breaks down a Reagan appointee’s rebuke and the looming showdown between Donald Trump and John Roberts.",
    "link": "https://biztoc.com/x/7b4780344cbfc2d8",
    "timestamp": "2025-04-18T22:02:08Z"
  },
  {
    "title": "'Power struggle': Trump ousts IRS head days after appointment as ally clashes with Musk",
    "description": "President Donald Trump reportedly ousted his acting IRS commissioner after just a few days in the role as a \"power struggle\" unfolded between a Cabinet member and Elon Musk.Treasury Secretary Scott Bessent complained to Trump that, as the head of the departme…",
    "link": "https://www.rawstory.com/trump-irs-2671802843/",
    "timestamp": "2025-04-18T22:00:12Z"
  },
  {
    "title": "Commentary: Nvidia chips don’t belong on the bargaining table",
    "description": "Donald Trump’s tariff blitz risks upending multilateral efforts to contain China’s AI ambitions, says Catherine Thorbecke for Bloomberg Opinion.",
    "link": "https://www.channelnewsasia.com/commentary/nvidia-chips-trump-tariffs-china-trade-war-ai-5073861",
    "timestamp": "2025-04-18T22:00:00Z"
  },
  {
    "title": "In the world's largest wholesale market, American customers have dried up as tariffs hit",
    "description": "At the world’s largest wholesale market in the Chinese city of Yiwu, U.S. customers have dired President Donald's trumps tariffs takes effect.",
    "link": "https://www.nbcnews.com/news/world/donald-trump-tariffs-trade-war-china-largest-wholesale-market-rcna201290",
    "timestamp": "2025-04-18T22:00:00Z"
  },
  {
    "title": "White House replaces Covid resource page with lab leak website",
    "description": "Anyone who tried to access Covid.gov, a federal website once dedicated to Covid resources, found something drastically different in its place Friday.",
    "link": "https://www.nbcnews.com/health/health-news/white-house-replaces-covid-resource-page-lab-leak-website-rcna201925",
    "timestamp": "2025-04-18T21:58:13Z"
  },
  {
    "title": "Trump's immigration crackdown is coming for legal workers",
    "description": "Undocumented workers aren’t the only immigrants being targeted by the Donald Trump administration. Green card holders are facing deportation threats as well. We’ll discuss the far-reaching implications of Trump’s immigration crackdown, from the labor market t…",
    "link": "https://www.marketplace.org/episode/2025/04/18/trumps-immigration-crackdown-is-coming-for-legal-workers",
    "timestamp": "2025-04-18T21:56:57Z"
  },
  {
    "title": "'We exist everywhere': First transgender Miss Maine USA contestant shares her story",
    "description": "Isabelle St. Cyr is sharing her story and says she hopes to use this platform to spread positivity.",
    "link": "https://www.wmtw.com/article/we-exist-everywhere-first-transgender-miss-maine-usa-contestant-shares-her-story/64526504",
    "timestamp": "2025-04-18T21:54:09Z"
  },
  {
    "title": "Yes, step up the pace on Ukraine peace — with fresh consequences if Putin resists",
    "description": "The Trump administration is right to inject a sense of urgency into the Ukraine cease-fire negotiations. But threatening to wash our hands of the matter could perversely encourage Kremlin obduracy.",
    "link": "https://nypost.com/2025/04/18/opinion/yes-step-up-the-pace-on-ukraine-peace-and-the-pressure-on-putin/",
    "timestamp": "2025-04-18T21:54:04Z"
  },
  {
    "title": "Marco Rubio Brags About Defending Freedom of Speech While Eagerly Undermining It",
    "description": "The secretary of state, who aims to \"liberate American speech,\" nevertheless wants to deport U.S. residents for expressing opinions that offend him.",
    "link": "https://reason.com/2025/04/18/marco-rubio-brags-about-defending-freedom-of-speech-while-eagerly-undermining-it/",
    "timestamp": "2025-04-18T21:52:25Z"
  },
  {
    "title": "Vows to kill the Kennedy clan, crazed writings and eerie predictions — the weirdest details to emerge from the RFK files so far",
    "description": "Newly declassified FBI files reveal that a madman threatened to kill Robert F. Kennedy's entire family in the wake of his 1968 assassination",
    "link": "https://nypost.com/2025/04/18/us-news/declassified-rfk-files-reveal-to-kill-kennedy-family-ambassador/",
    "timestamp": "2025-04-18T21:51:38Z"
  },
  {
    "title": "Trump administration seeks to turn mass deportations into an efficient business ‘like Amazon’",
    "description": "If President Donald Trump’s administration has its way, the capacity to hold tens of thousands more migrants will soon be added around the country as the U.S. seeks an explosive expansion of what is already the world’s largest immigration detention system.",
    "link": "https://biztoc.com/x/64874dcaf83506a9",
    "timestamp": "2025-04-18T21:51:12Z"
  },
  {
    "title": "Conservative judge slams lack of due process in Abrego Garcia case",
    "description": "This week’s Deadline: Legal Newsletter breaks down a Reagan appointee’s rebuke and the looming showdown between Donald Trump and John Roberts.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/conservative-judge-due-process-abrego-garcia-deadline-newsletter-rcna200832",
    "timestamp": "2025-04-18T21:49:25Z"
  },
  {
    "title": "Donald Trump to reclassify tens of thousands of federal workers, making them easier to fire",
    "description": "US President Donald Trump said on Friday his administration is set to change the employment classifications of tens of thousands of federal workers, a move governance experts say will make it easier to carry out more mass layoffs.",
    "link": "https://www.independent.ie/world-news/donald-trump-to-reclassify-tens-of-thousands-of-federal-workers-making-them-easier-to-fire/a1048456064.html",
    "timestamp": "2025-04-18T21:48:59Z"
  },
  {
    "title": "DOGE Is Building a Master Database to Surveil and Track Immigrants",
    "description": "DOGE is knitting together data from the Department of Homeland Security, Social Security Administration, and IRS that could create a surveillance tool of unprecedented scope.",
    "link": "https://www.wired.com/story/doge-collecting-immigrant-data-surveil-track/",
    "timestamp": "2025-04-18T21:48:17Z"
  },
  {
    "title": "'Absolute nadir’: Experts fear US vulnerable to attack after latest Trump moves",
    "description": "Adversaries targeting the United States through covert cybersecurity campaigns aimed at amplifying political discourse have been given more freedom to conduct their missions thanks to President Donald Trump’s dismantling of the country's disinformation campai…",
    "link": "https://www.rawstory.com/cybersecurity-2671802541/",
    "timestamp": "2025-04-18T21:47:48Z"
  },
  {
    "title": "Tufts student challenging immigration arrest must be moved to Vermont, judge rules",
    "description": "A federal judge ordered President Donald Trump's administration on Friday to transfer a Tufts University student being held in Louisiana to Vermont while he ...",
    "link": "https://www.yahoo.com/news/tufts-student-challenging-immigration-arrest-214648239.html",
    "timestamp": "2025-04-18T21:46:48Z"
  },
  {
    "title": "US ranchers hope Trump's tariffs boost demand for beef",
    "description": "Ranchers hope President Donald Trump's tariffs will make imported beef expensive enough that Americans will turn to cattle raised at home for all their hamburger and steaks.",
    "link": "https://trib.com/news/nation-world/business/article_8ab2ec8e-a4df-59d5-b95f-5a7564d2a26f.html",
    "timestamp": "2025-04-18T21:42:15Z"
  },
  {
    "title": "Trump has two options after a wrongful deportation",
    "description": "This story appeared in The Logoff, a daily newsletter that helps you stay informed about the Trump administration without letting political news take over your life. Subscribe here. Welcome to The Logoff: Today I’m focusing on the Trump administration’s escal…",
    "link": "https://www.vox.com/the-logoff-newsletter-trump/409673/trump-supreme-court-abrego-garcia-deporatation",
    "timestamp": "2025-04-18T21:40:17Z"
  },
  {
    "title": "California Governor urges Canadians to travel to his state despite Trump",
    "description": "After President Donald Trump repeatedly called Canada \"the 51st state\" and imposed sweeping tariffs on the country, Canadians began canceling vacation plans to their southern neighbor en masse.\nA recent report from the U.S. Travel Association estimated that a…",
    "link": "https://biztoc.com/x/17f22686401dd572",
    "timestamp": "2025-04-18T21:40:02Z"
  },
  {
    "title": "‘Margarita-gate’: Senator insists photos of boozy beverages are a plot to 'deceive people'",
    "description": "Sen. Chris Van Hollen (D-MD) tried to dispel notions Friday that he and Kilmar Ábrego García — the Maryland man mistakenly deported to a notorious Salvadoran megaprison — were drinking margaritas during their meeting earlier in the week.Van Hollen landed at D…",
    "link": "https://www.rawstory.com/kilmar-abrego-garcia-2671802574/",
    "timestamp": "2025-04-18T21:39:13Z"
  },
  {
    "title": "NSF begins terminating select grant funding",
    "description": "Research projects that are deemed to focus on diversity, equity and inclusion or that aim to combat mis- and disinformation will no longer receive funding from the National Science Foundation.",
    "link": "https://www.nextgov.com/policy/2025/04/nsf-begins-terminating-select-grant-funding/404698/",
    "timestamp": "2025-04-18T21:39:00Z"
  },
  {
    "title": "Democratic Strategist Warns Party Against Aligning Itself With Abrego Garcia: ‘Let’s Not Make Him a Martyr’",
    "description": "Veteran Democratic strategist Mo Elleithee warned his party Friday against focusing too narrowly on Kilmar Abrego Garcia, a Salvadoran man whose deportation and detention have sparked international controversy. Appearing on CNN’s The Arena with Kasie Hunt, El…",
    "link": "https://www.mediaite.com/tv/democratic-strategist-warns-party-against-aligning-itself-with-abrego-garcia-lets-not-make-him-a-martyr/",
    "timestamp": "2025-04-18T21:37:24Z"
  },
  {
    "title": "Trump administration seeks to turn mass deportations into an efficient business ‘like Amazon’",
    "description": "If President Donald Trump’s administration has its way, the capacity to hold tens of thousands more migrants will soon be added around the country as the U.S. seeks an explosive expansion of what is already the world’s largest immigration detention system.",
    "link": "https://www.pbs.org/newshour/politics/trump-administration-seeks-to-turn-mass-deportations-into-an-efficient-business-like-amazon",
    "timestamp": "2025-04-18T21:36:30Z"
  },
  {
    "title": "Trump hits back at US Senator Van Hollen for visit with Abrego Garcia",
    "description": "US President Donald Trump has hit back at Democrat Senator Chris Van Hollen for meeting with Kilmar Abrego Garcia and insists he will not facilitate Garcia's return from El Salvador, despite the US Supreme Court directing him to.",
    "link": "https://www.abc.net.au/news/2025-04-19/trump-hits-back-at-us-senator-van-hollen-for-visit-with-abrego/105192822",
    "timestamp": "2025-04-18T21:35:11Z"
  },
  {
    "title": "Katy Perry gears up for sci-fi inspired world tour",
    "description": "In less than a year, Katy Perry has released an album, campaigned for Vice President Kamala Harris and, just this week, flown to space. As she heads to Mexico City to kick off a world tour on Wednesday, the pop superstar shows no intention of slowing down. “I…",
    "link": "https://japantoday.com/category/entertainment/katy-perry-gears-up-for-sci-fi-inspired-world-tour",
    "timestamp": "2025-04-18T21:33:27Z"
  },
  {
    "title": "Trump Signals China’s Xi Reached Out; U.S. Moves Ahead With Plan to Impose Tariffs on Chinese Ships - Barron's",
    "description": "Trump Signals China’s Xi Reached Out; U.S. Moves Ahead With Plan to Impose Tariffs on Chinese ShipsBarron's Trump’s Trade War With China Puts Bromance With Xi Beyond ReachThe New York Times Trump: China calling ‘a lot’ since last week's tariff increase, deal …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177062529",
    "timestamp": "2025-04-18T21:33:01Z"
  },
  {
    "title": "What we know about Kilmar Abrego Garcia, the Maryland man mistakenly deported to El Salvador",
    "description": "A judge has ordered that the Trump administration “facilitate” Abrego Garcia’s return to the US, an order supported by the Supreme Court.",
    "link": "https://www.nbcnews.com/news/us-news/kilmar-abrego-garcia-deported-el-salvador-trump-immigration-what-know-rcna201708",
    "timestamp": "2025-04-18T21:32:09Z"
  },
  {
    "title": "Canary Capital files for staked TRX ETF",
    "description": "United States asset manager Canary Capital has filed to list an exchange-traded fund (ETF) holding the Tron blockchain network’s native token, TRX (TRX), regulatory filings show. The fund intends to hold spot TRX and stake a portion of the tokens for added yi…",
    "link": "https://cointelegraph.com/news/canary-files-for-staked-trx-etf",
    "timestamp": "2025-04-18T21:31:56Z"
  },
  {
    "title": "Japan tweaks economic assessment as U.S. tariff fears grow",
    "description": "The government on Friday changed the expression for its overall view of Japan's economy for the first time in eight months, warning that higher U.S. tariffs imposed by President Donald Trump are blurring the outlook for growth. In its monthly economic report …",
    "link": "https://japantoday.com/category/business/japan-tweaks-economic-assessment-as-u.s.-tariff-fears-grow",
    "timestamp": "2025-04-18T21:31:38Z"
  },
  {
    "title": "Strange sell-off in the dollar raises specter of investors losing trust in U.S. under Trump",
    "description": "Among the threats tariffs pose to the U.S. economy, none may be as strange as the sell-off in the dollar. Currencies rise and fall all the time because of inflation fears, central bank moves and other factors. But economists worry that the recent drop in the …",
    "link": "https://japantoday.com/category/business/strange-sell-off-in-the-dollar-raises-the-specter-of-investors-losing-trust-in-the-us-under-trump",
    "timestamp": "2025-04-18T21:31:17Z"
  },
  {
    "title": "Deportation case reveals a key Democratic divide: From the Politics Desk",
    "description": "How Kilmar Abrego Garcia’s deportation has exposed a political rift among Democrats.",
    "link": "https://www.nbcnews.com/politics/politics-news/deportation-case-reveals-key-democratic-divide-politics-desk-rcna201932",
    "timestamp": "2025-04-18T21:30:41Z"
  }
]