[
  {
    "title": "Audience Jeers as Colbert Drops Cancellation News Amid Trump Rumors",
    "description": "Stephen Colbert drew jeers when he announced The Late Show's cancellation just weeks after his employer’s $16 million settlement with President Donald Trump.\nThe post Audience Jeers as Colbert Drops Cancellation News Amid Trump Rumors first appeared on Mediai…",
    "link": "https://www.mediaite.com/media/entertainment/audience-jeers-as-colbert-drops-cancellation-news-amid-trump-rumors/",
    "timestamp": "2025-07-18T11:57:37Z"
  },
  {
    "title": "'They can release the files': Expert busts DOJ on 'one rule' it won't break",
    "description": "President Donald Trump has asked Attorney General Pam Bondi to publicly release grand jury transcripts in the Jeffrey Epstein case, but a former Florida prosecutor said that won't be enough to satisfy his angry MAGA base.The president is facing backlash from …",
    "link": "https://www.rawstory.com/will-trump-release-epstein-files-aronberg/",
    "timestamp": "2025-07-18T11:55:17Z"
  },
  {
    "title": "Pam Bondi Is Trump’s Clueless Heat Shield in Epstein Scandal",
    "description": "Attorney General Pam Bondi keeps tripping over her own Epstein mess and making it even worse, writes Elie Honig.",
    "link": "http://nymag.com/intelligencer/article/pam-bondi-is-trumps-clueless-heat-shield-in-epstein-scandal.html",
    "timestamp": "2025-07-18T11:55:07Z"
  },
  {
    "title": "Trump Orders Release of Epstein Documents",
    "description": "He also threatened to sue the WSJ over a report alleging he sent a 'bawdy' birthday letter to the late sex offender in 2003.",
    "link": "https://time.com/7303381/trump-epstein-documents-wsj-letter/",
    "timestamp": "2025-07-18T11:51:12Z"
  },
  {
    "title": "Most US adults think the GOP tax bill will help the wealthy and harm the poor, AP-NORC poll finds",
    "description": "A new AP-NORC poll shows that while Republican elected officials are promoting their recently passed tax and spending bill as a win for working Americans, everyday Americans broadly see it as a win for the wealthy",
    "link": "https://abcnews.go.com/Business/wireStory/us-adults-gop-tax-bill-wealthy-harm-poor-123857645",
    "timestamp": "2025-07-18T11:50:29Z"
  },
  {
    "title": "Donald Trump has blistering response after being accused of sending Jeffrey Epstein disturbing letter",
    "description": "US President Donald Trump has responded angrily to a report by the Wall Street Journal alleging he sent a letter to Jeffrey Epstein.",
    "link": "https://www.ladbible.com/news/politics/donald-trump-response-jeffrey-epstein-letter-075342-20250718",
    "timestamp": "2025-07-18T11:49:12Z"
  },
  {
    "title": "China pledges to crack down on illicit exports of rare earths, urges US to lift more trade controls",
    "description": "BANGKOK (AP) — China’s state security agency says it is cracking down on alleged smuggling of rare earths minerals that it says threaten national security, just weeks after Beijing and Washington agreed to make it easier for American firms to obtain from Chin…",
    "link": "https://financialpost.com/pmn/china-pledges-to-crack-down-on-illicit-exports-of-rare-earths-urges-us-to-lift-more-trade-controls",
    "timestamp": "2025-07-18T11:48:10Z"
  },
  {
    "title": "\"False, Malicious, Defamatory\" - Trump Demands Unsealing Of Epstein Files, Threatens Lawsuit After WSJ Hit Piece",
    "description": "\"False, Malicious, Defamatory\" - Trump Demands Unsealing Of Epstein Files, Threatens Lawsuit After WSJ Hit Piece\n \nDonald Trump sent notorious sex-trafficker Jeffrey Epstein a bawdy birthday letter with a drawing of a naked woman, an acknowledgement that the …",
    "link": "https://biztoc.com/x/44d847b3bf4374d5",
    "timestamp": "2025-07-18T11:47:56Z"
  },
  {
    "title": "Excessive Litigation Causes Surge in US Liability Insurance Costs: Marsh McLennan CEO",
    "description": "Excessive litigation and the abuse of U.S. legal system are effectively imposing a tax on the U.S. economy and causing a surge in liability insurance costs, according to John Doyle, president and chief executive officer of Marsh McLennan. “The U.S. …",
    "link": "https://www.insurancejournal.com/news/national/2025/07/18/832245.htm",
    "timestamp": "2025-07-18T11:47:46Z"
  },
  {
    "title": "Trump Calls for Release of Epstein Testimony Amid Fierce Uproar",
    "description": "Amid mounting pressure from his closest allies, President Donald Trump posted that he asked Attorney General Pam Bondi to “produce any and all pertinent grand jury testimony, subject to court approval” relating to the Jeffrey Epstein case. It comes as a bombs…",
    "link": "https://biztoc.com/x/ac3414eb02b4a9d1",
    "timestamp": "2025-07-18T11:47:24Z"
  },
  {
    "title": "What Epstein Grand Jury Testimony Could Include",
    "description": "Attorney General Pam Bondi said she would seek the release of the Epstein grand jury transcripts today, at Donald Trump's request. What will they show?",
    "link": "https://www.newsweek.com/jeffrey-epstein-what-grand-jury-testimony-release-today-includes-2100677",
    "timestamp": "2025-07-18T11:47:02Z"
  },
  {
    "title": "African state arrests dozens of suspected IS militants",
    "description": "The more than 82 fighters caught were reportedly trained in Somalia’s Puntland region and deployed to coordinate attacks on Ethiopia Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/621647-african-state-arrests-dozens-islamic-state-militants/",
    "timestamp": "2025-07-18T11:45:54Z"
  },
  {
    "title": "Donald Trump has been diagnosed with chronic venous insufficiency",
    "description": "If you ask me, Donald Trump’s health has been in significant decline for years, but the decline accelerated throughout the 2024 campaign, and he’s looked bigly terrible all of this year. In recent months, there have been photos of Trump standing awkwardly, wi…",
    "link": "https://www.celebitchy.com/931655/donald_trump_has_been_diagnosed_with_chronic_venous_insufficiency/",
    "timestamp": "2025-07-18T11:45:34Z"
  },
  {
    "title": "Most US adults think the GOP tax bill will help the wealthy and harm the poor, AP-NORC poll finds",
    "description": "A new AP-NORC poll shows that while Republican elected officials are promoting their recently passed tax and spending bill as a win for working Americans, everyday Americans broadly see it as a win for the wealthy.",
    "link": "https://www.news4jax.com/news/politics/2025/07/18/most-us-adults-think-the-gop-tax-bill-will-help-the-wealthy-and-harm-the-poor-ap-norc-poll-finds/",
    "timestamp": "2025-07-18T11:45:10Z"
  },
  {
    "title": "Trump Celebrates Congress Pulling $1.1 Billion in Funding From ‘Atrocious’ NPR and PBS: ‘This Is Big!’",
    "description": "President Donald Trump took a victory lap after Congress formally passed his measure to claw back $9 billion in previously approved funding, including $1.1 billion for PBS and NPR — which public media execs have said could force dozens of local stations to sh…",
    "link": "https://variety.com/2025/tv/news/trump-celebrates-congress-npr-pbs-defunding-rescission-1236464552/",
    "timestamp": "2025-07-18T11:44:54Z"
  },
  {
    "title": "XRP and Dogecoin Skyrocket as U.S. Crypto Bills Pass — Here’s Why Everyone’s Hunting for the Best Crypto to Buy",
    "description": "Major cryptocurrencies led by $XRP and $DOGE have rallied in the past 24 hours as the market eagerly awaits US President Donald Trump to sign the US GENIUS Act into law today. While most altcoins have become a bit more expensive to acquire given the current c…",
    "link": "http://www.newsbtc.com/news/xrp-dogecoin-lead-best-crypto-market-rally/",
    "timestamp": "2025-07-18T11:43:55Z"
  },
  {
    "title": "Rubio Tells All U.S. Diplomats They Have to Talk Like Trump",
    "description": "Marco Rubio has instructed U.S. diplomats not to comment on the legitimacy or fairness of foreign elections, breaking with decades of American diplomatic...",
    "link": "https://www.thedailybeast.com/marco-rubio-bans-diplomats-from-criticizing-foreign-elections/",
    "timestamp": "2025-07-18T11:42:55Z"
  },
  {
    "title": "CBS is cancelling ‘The Late Show with Stephen Colbert’ for ‘financial’ reasons",
    "description": "This is not the news anyone expected. CBS has decided to cancel The Late Show with Stephen Colbert. This is not “CBS is canceling Colbert’s contract and hiring a new host.” This is a cancellation of their signature late-night show, an institutional “anchor pr…",
    "link": "https://www.celebitchy.com/931712/cbs_is_cancelling_the_late_show_with_stephen_colbert_for_financial_reasons/",
    "timestamp": "2025-07-18T11:42:35Z"
  },
  {
    "title": "Fired Epstein Prosecutor Maurene Comey Unloads in Blistering Farewell Note to Colleagues: ‘Fear Is the Tool of a Tyrant’",
    "description": "Comey delivered a scathing rebuke of the Trump administration just one day after her abrupt dismissal from the U.S. Attorney’s Office in Manhattan.\nThe post Fired Epstein Prosecutor Maurene Comey Unloads in Blistering Farewell Note to Colleagues: ‘Fear Is the…",
    "link": "https://www.mediaite.com/media/news/fired-epstein-prosecutor-maurene-comey-unloads-in-blistering-farewell-note-to-colleagues-fear-is-the-tool-of-a-tyrant/",
    "timestamp": "2025-07-18T11:42:29Z"
  },
  {
    "title": "NC builders concerned over immigration crackdowns, worker shortages",
    "description": "Builders in North Carolina are raising concerns over federal immigration crackdowns, warning that the lack of workers could slow down construction projects across the state.",
    "link": "https://www.wsoctv.com/news/local/nc-builders-concerned-over-immigration-crackdowns-worker-shortages/5KBQR5GPENGOBCNNPJGMBM3QQ4/",
    "timestamp": "2025-07-18T11:42:07Z"
  },
  {
    "title": "Trump letter to Epstein ties him to a 'significant criminal conspiracy': MSNBC",
    "description": "The public perception of Donald Trump's relationship with Jeffrey Epstein, who died while in custody, took another big hit on Thursday night after the Wall Street Journal reported on a \"bawdy\" letter\" the president wrote to the accused pedophile years ago as …",
    "link": "https://www.rawstory.com/trump-letter-to-epstein-ties-him-to-a-significant-criminal-conspiracy-msnbc/",
    "timestamp": "2025-07-18T11:40:53Z"
  },
  {
    "title": "Why Markets May Soon Call America’s Tariff Bluff",
    "description": "Financial markets have so far mitigated the impact of US President Donald Trump’s tariff threats by repeatedly forcing him to back down. But if investors become desensitized to Trump’s trade theatrics, they may embolden him to follow through.",
    "link": "https://www.project-syndicate.org/commentary/investors-are-no-longer-buying-trump-tariff-threats-by-pinelopi-koujianou-goldberg-2025-07",
    "timestamp": "2025-07-18T11:40:29Z"
  },
  {
    "title": "Most US adults think the GOP tax bill will help the wealthy and harm the poor, AP-NORC poll finds",
    "description": "A new AP-NORC poll shows that while Republican elected officials are promoting their recently passed tax and spending bill as a win for working Americans, everyday Americans broadly see it as a win for the wealthy.",
    "link": "https://www.clickondetroit.com/news/politics/2025/07/18/most-us-adults-think-the-gop-tax-bill-will-help-the-wealthy-and-harm-the-poor-ap-norc-poll-finds/",
    "timestamp": "2025-07-18T11:38:26Z"
  },
  {
    "title": "President Trump’s health: Here’s what to know about chronic venous insufficiency",
    "description": "President Trump underwent medical testing due to swelling in his legs, revealing a vein condition.",
    "link": "https://www.boston25news.com/news/local/president-trumps-health-heres-what-know-about-chronic-venous-insufficiency/F7U4JSDRE5CDLJ3QFMAFQ3AP2U/",
    "timestamp": "2025-07-18T11:36:50Z"
  },
  {
    "title": "Trump is making Americans like immigrants again",
    "description": "President Donald Trump tours a migrant detention center, dubbed “Alligator Alcatraz,” located at the site of the Dade-Collier Training and Transition Airport in Ochopee, Florida, on July 1, 2025. | Andrew Caballero-Reynolds/AFP via Getty Images \nFor the past …",
    "link": "https://biztoc.com/x/912ac3f25b014528",
    "timestamp": "2025-07-18T11:36:29Z"
  },
  {
    "title": "Thanks to Congress and SCOTUS, the walls are closing in on student loan borrowers",
    "description": "The already complicated process of paying back student loans just got even more complicated.\nEarlier this week, the Supreme Court ruled in a 6-3 decision to let President Donald Trump resume hollowing out the Department of Education, lifting the lower court i…",
    "link": "https://biztoc.com/x/f5f2066665948199",
    "timestamp": "2025-07-18T11:36:21Z"
  },
  {
    "title": "EU Targets Russian Oil In Tough New Ukraine War Sanctions",
    "description": "The EU on Friday adopted a sweeping new package of sanctions on Russia over the Ukraine war, looking to pile more pressure on the Kremlin by lowering a price cap for Moscow's oil exports.",
    "link": "https://www.ibtimes.com/eu-targets-russian-oil-tough-new-ukraine-war-sanctions-3778856",
    "timestamp": "2025-07-18T11:36:13Z"
  },
  {
    "title": "Civil rights work is slowing as Trump dismantles the Education Department, agency data shows",
    "description": "Data from the Education Department shows the pace at which it resolves civil rights complaints has slowed.",
    "link": "https://www.bostonherald.com/2025/07/18/education-department-civil-rights-trump/",
    "timestamp": "2025-07-18T11:35:54Z"
  },
  {
    "title": "The GOP’s Big Budget Bill Will Only Make the Healthcare Affordability Crisis Worse",
    "description": "Among the universal truths in our country today is this: Healthcare is too expensive. It’s difficult to find the right doctor for your needs. And even if you have health insurance and can get the care you need, you might come home one day to find a massive me…",
    "link": "https://www.commondreams.org/opinion/budget-bill-healthcare-worse",
    "timestamp": "2025-07-18T11:35:03Z"
  },
  {
    "title": "Tariff war must end quickly, German finance minister tells G7 partners",
    "description": "DURBAN, South Africa (Reuters) -German Finance Minister Lars Klingbeil made clear in a meeting with his counterparts from the Group of Seven major economies ...",
    "link": "https://ca.finance.yahoo.com/news/tariff-war-must-end-quickly-113230270.html",
    "timestamp": "2025-07-18T11:32:30Z"
  },
  {
    "title": "AG Pam Bondi says DOJ will seek to unseal Epstein grand jury records",
    "description": "Trump directed AG Pam Bondi last night to release \"pertinent\" grand jury testimony in the criminal case of the late financier and convicted sex offender Jeffrey Epstein.",
    "link": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-epstein-npr-pbs-doge-tariffs-immigration-live-updates-rcna218570",
    "timestamp": "2025-07-18T11:31:39Z"
  },
  {
    "title": "House Republicans Pushing New Amnesty Bill Have Stabbed Conservatives In The Back",
    "description": "The cadre of House Republicans has betrayed conservatives on immigration a mere two weeks after the passage of the Big Beautiful Bill.",
    "link": "https://thefederalist.com/2025/07/18/house-republicans-pushing-new-amnesty-bill-have-stabbed-conservatives-in-the-back/",
    "timestamp": "2025-07-18T11:30:38Z"
  },
  {
    "title": "Bitcoin And Crypto De Minimis Tax Exemption Backed By Trump, Says White House",
    "description": "The White House on Thursday confirmed that President Donald Trump remains committed to carving out a de minimis tax safe‑harbor for everyday Bitcoin and other cryptocurrency payments, a policy his economic team believes will let digital money function “as sim…",
    "link": "https://bitcoinist.com/bitcoin-crypto-de-minimis-tax-exemption-trump/",
    "timestamp": "2025-07-18T11:30:26Z"
  },
  {
    "title": "Trump threatens to sue over article about Epstein. And, what's next for public media",
    "description": "President Trump has threatened to sue the Wall Street Journal over an article alleging ties to Jeffrey Epstein. And, Congress has passed the rescission package affecting public media and foreign aid.",
    "link": "https://www.npr.org/2025/07/18/g-s1-78166/up-first-newsletter-rescission-package-npr-pbs-jeffrey-epstein-trump-health",
    "timestamp": "2025-07-18T11:30:19Z"
  },
  {
    "title": "Defunding NPR and PBS passed the Senate — and it’s a direct hit to rural America",
    "description": "As feared, President Donald Trump, with the help of Congress, is making good on his threat to cut federal funding for NPR, PBS and other public broadcasting. It’s a dark […]\nThe post Defunding NPR and PBS passed the Senate — and it’s a direct hit to rural Ame…",
    "link": "https://www.poynter.org/commentary/2025/defunding-npr-and-pbs-passed-the-senate/",
    "timestamp": "2025-07-18T11:30:14Z"
  },
  {
    "title": "What to Do With the Most Dangerous Book in America",
    "description": "At a perilous American moment, the Shakespeare scholar James Shapiro explains why he wanted to read The Turner Diaries.",
    "link": "https://www.theatlantic.com/books/archive/2025/07/what-do-dangerous-novel-turner-diaries/683580/",
    "timestamp": "2025-07-18T11:30:00Z"
  },
  {
    "title": "Donald Trump wrote a ‘bawdy letter’ for Jeffrey Epstein’s birthday book in 2003",
    "description": "Embed from Getty Images It’s sort of amazing that this Jeffrey Epstein issue is hurting Donald Trump so much with the cultists and wingnuts in his base. It’s become one of the few things everyone, of every political inclination, can agree on: Donald Trump is …",
    "link": "https://www.celebitchy.com/931728/donald_trump_wrote_a_bawdy_letter_for_jeffrey_epsteins_birthday_book_in_2003/",
    "timestamp": "2025-07-18T11:27:02Z"
  },
  {
    "title": "Wanted: Jeffrey Epstein explanations",
    "description": "President Donald Trump’s administration needs to provide additional explanations for statements that Attorney General Pam Bondi and United States Attorney for the District of New Jersey Alina Habba made about evidence associated with Jeffrey Epstein.",
    "link": "https://freerepublic.com/focus/f-news/4329327/posts",
    "timestamp": "2025-07-18T11:27:01Z"
  },
  {
    "title": "RBI may go for another 25 bps rate cut in August, repo rate to come down at 5.25%: ICICI Bank",
    "description": "Reserve Bank of India's Monetary Policy Committee may cut rates in August. ICICI Bank reports a possible 25 bps cut, bringing the rate to 5.25 percent. Rural demand is strong, but urban demand is weak. Inflation is lower than expected. Global economic outlook…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-go-for-another-25-bps-rate-cut-in-august-repo-rate-to-come-down-at-5-25-icici-bank/articleshow/122764891.cms",
    "timestamp": "2025-07-18T11:26:24Z"
  },
  {
    "title": "Stunning cost of rebuilding Alcatraz 'might just be too much' for Trump: insider",
    "description": "The possibility of rebuilding the Alcatraz prison as a new holding pen as Donald Trump makes plans to ramp up U.S. incarceration rates may be in doubt according to an estimate on the projected cost.That is according to a report from Marc Caputo at Axios, who …",
    "link": "https://www.rawstory.com/trump-alcatraz-2673356587/",
    "timestamp": "2025-07-18T11:26:19Z"
  },
  {
    "title": "Pam Bondi Preparing To Release Epstein Grand Jury Testimonies: Live Updates",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has directed Attorney General Pam Bondi to seek the public release of grand jury testimony related to Jeffrey Epstein's prosecution, a move aimed at quelling backlash from his base over …",
    "link": "https://biztoc.com/x/af4bcce83d1ad956",
    "timestamp": "2025-07-18T11:25:44Z"
  },
  {
    "title": "David Bailey Sold Trump on Crypto. Now His Hedge Fund Is Up 640%",
    "description": "A key architect of the lobbying campaign that turned Donald Trump into crypto’s most powerful advocate has made a wildly lucrative bet on one of the industry’s frothiest corners.",
    "link": "https://financialpost.com/pmn/business-pmn/david-bailey-sold-trump-on-crypto-now-his-hedge-fund-is-up-640",
    "timestamp": "2025-07-18T11:25:39Z"
  },
  {
    "title": "Trump and Epstein had a relationship, but there's no evidence of Trump wrongdoing (Glenn Kessler/Washington Post)",
    "description": "Glenn Kessler / Washington Post:\nTrump and Epstein had a relationship, but there's no evidence of Trump wrongdoing  —  A year ago, we scrubbed the public record.  Here are our updated findings.  —  Summary11 … — President Donald Trump, speaking to reporters, …",
    "link": "https://www.memeorandum.com/250718/p14",
    "timestamp": "2025-07-18T11:25:00Z"
  },
  {
    "title": "‘Bawdy’: Explosive Epstein-Trump Story Reveals Seedy Bro Relationship",
    "description": "The Wall Street Journal published an explosive article about a card and drawing that Donald Trump allegedly wrote (and drew) for Jeffrey Epstein for a binder made for his 50th birthday in 2003.\nThe letter signed with Trump’s name, was reviewed by the WSJ and …",
    "link": "https://crooksandliars.com/2025/07/wsj-publishes-explosive-epstein-trump",
    "timestamp": "2025-07-18T11:25:00Z"
  },
  {
    "title": "Opinion | It’s time to open the 401(k) to private markets",
    "description": "There's no single magic bullet for solving the U.S. retirement challenge, but this one could have an impact.",
    "link": "https://fortune.com/2025/07/18/401k-open-to-private-markets/",
    "timestamp": "2025-07-18T11:23:26Z"
  },
  {
    "title": "Trump denies letter to Epstein and Stephen Colbert's 'Late Show' to end: Morning Rundown",
    "description": "A $9 billion rescissions package could jeopardize the future of hundreds of local NPR and PBS stations.",
    "link": "https://www.nbcnews.com/news/us-news/trump-denies-letter-epstein-stephen-colberts-late-show-end-morning-run-rcna219522",
    "timestamp": "2025-07-18T11:22:35Z"
  },
  {
    "title": "Takeaways from the AP’s reporting on Trump’s business deals",
    "description": "WASHINGTON (AP) — From crypto coins to bibles, overseas development deals to an upcoming line of cellphones, President Donald Trump’s family businesses have raked in hundreds of millions of dollars since his election. That flood of money — from billionaires, …",
    "link": "https://financialpost.com/pmn/takeaways-from-the-aps-reporting-on-trumps-business-deals",
    "timestamp": "2025-07-18T11:22:09Z"
  },
  {
    "title": "Barack Obama joked about the divorce rumors: ‘She took me back!’",
    "description": "In January, Michelle Obama notably skipped two state events, events which she “should” have attended as the former first lady. She skipped Jimmy Carter’s state funeral and she skipped Donald Trump’s second inauguration. At both events, Barack Obama attended s…",
    "link": "https://www.celebitchy.com/931602/barack_obama_joked_about_the_divorce_rumors_she_took_me_back/",
    "timestamp": "2025-07-18T11:22:05Z"
  },
  {
    "title": "Donald Trump is fighting a conspiracy the only way he knows how (Ramesh Ponnuru/Washington Post)",
    "description": "Ramesh Ponnuru / Washington Post:\nDonald Trump is fighting a conspiracy the only way he knows how  —  He helped tear down institutions' credibility.  So he's feeding voters a competing theory instead.  —  Conspiracy theorists tend to be collectors: One conspi…",
    "link": "https://www.memeorandum.com/250718/p12",
    "timestamp": "2025-07-18T11:20:01Z"
  },
  {
    "title": "Transcript: Trump Press Sec Seethes at Media as Epstein Fiasco Worsens",
    "description": "The following is a lightly edited transcript of the July 18 episode of the Daily Blast podcast. Listen to it here.Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network. I’m your host, Greg Sargent.President Tru…",
    "link": "https://newrepublic.com/article/198099/transcript-trump-press-sec-seethes-media-epstein-fiasco-worsens",
    "timestamp": "2025-07-18T11:17:59Z"
  },
  {
    "title": "Pam Bondi Preparing To Release Epstein Grand Jury Testimonies: Live Updates",
    "description": "Trump directs Bondi to seek court approval to unseal Epstein grand jury files amid backlash and legal uncertainty. Follow Newsweek's live blog.",
    "link": "https://www.newsweek.com/donald-trump-pam-bondi-jeffrey-epstein-files-maxwell-live-updates-2100701",
    "timestamp": "2025-07-18T11:17:51Z"
  },
  {
    "title": "House Republicans grasp for response to demands for transparency in Epstein case",
    "description": "House Republicans ultimately put forward a resolution that carried no legal weight but nodded to the growing demand for greater transparency.",
    "link": "https://www.denverpost.com/2025/07/18/house-republicans-epstein-case-response/",
    "timestamp": "2025-07-18T11:15:43Z"
  },
  {
    "title": "House Republicans grasp for response to demands for transparency in Epstein case",
    "description": "House Republicans ultimately put forward a resolution that carried no legal weight but nodded to the growing demand for greater transparency.",
    "link": "https://www.bostonherald.com/2025/07/18/house-republicans-epstein-case-response/",
    "timestamp": "2025-07-18T11:15:43Z"
  },
  {
    "title": "'Our Country Is Obsessed With War,' Tlaib Says as House Approves $832 Billion Military Bill",
    "description": "The U.S. House passed legislation early Friday that would provide roughly $832 billion in funding for military programs for the coming fiscal year, a vote that came shortly after the chamber approved a $9 billion rescissions package that takes an axe to publi…",
    "link": "https://www.commondreams.org/news/military-spending-bill",
    "timestamp": "2025-07-18T11:14:20Z"
  },
  {
    "title": "Stephen Colbert’s ‘Late Show’ axed by CBS",
    "description": "The decision ‘is not related in any way to the show’s performance, content or other matters happening at Paramount’, the network said.",
    "link": "https://7news.com.au/news/stephen-colberts-late-show-axed-by-cbs-c-19401463",
    "timestamp": "2025-07-18T11:13:17Z"
  },
  {
    "title": "House gives final approval to Trump’s $9 billion cut to public broadcasting and foreign aid",
    "description": "The House gave final approval to President Donald Trump’s request to claw back about $9 billion for public broadcasting and foreign aid early Friday as Republicans intensified their efforts to target institutions and programs they view as bloated or out of st…",
    "link": "https://www.wpxi.com/news/local/house-gives-final-approval-trumps-9-billion-cut-public-broadcasting-foreign-aid/RB4NY6PWBJFELBWRAQFLYKWKQQ/",
    "timestamp": "2025-07-18T11:11:16Z"
  },
  {
    "title": "Trump Calls for Release of Epstein Testimony Amid Fierce Uproar",
    "description": "Amid mounting pressure from his closest allies, President Donald Trump posted that he asked Attorney General Pam Bondi to “produce any and all pertinent grand jury testimony, subject to court approval” relating to the Jeffrey Epstein case. It comes as a bombs…",
    "link": "https://www.today.com/video/trump-threatens-to-sue-wsj-over-esptein-birthday-letter-claims-243454021688",
    "timestamp": "2025-07-18T11:09:45Z"
  },
  {
    "title": "Former Missouri congressman Billy Long will be sworn in as IRS commissioner",
    "description": "Long, who once advocated for abolishing the IRS, takes over an agency struggling with staffing cuts and leadership turnover.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_cbb01ecb-a18c-4e6d-8e9a-93c34733cabd.html",
    "timestamp": "2025-07-18T11:07:00Z"
  },
  {
    "title": "Epstein Damage Control: Trump Vows to Sue Billionaire Rupert Murdoch and Asks DOJ to Release Pedo’s Grand Jury Evidence After Bombshell Wall Street Journal Exposé",
    "description": "Donald Trump has vowed to sue 'the ass off' billionaire Rupert Murdoch over publishing an alleged letter in the WSJ he wrote to pedophile Jeffrey Epstein.",
    "link": "https://radaronline.com/p/trump-sue-rupert-murdoch-doj-release-pedos-grand-jury-evidence-wall-street-journal-expose/",
    "timestamp": "2025-07-18T11:06:54Z"
  },
  {
    "title": "President Enigma Cankles. Tabs, Friday, July 18, 2025",
    "description": "'We have certain things in common, Jeffrey,' said Donald Trump to his beloved friend.",
    "link": "https://www.wonkette.com/p/president-enigma-cankles-tabs-friday",
    "timestamp": "2025-07-18T11:06:36Z"
  },
  {
    "title": "Carney inherited a fiscal mess from Trudeau, and he is set to make it worse",
    "description": "Rising debt usually leads to slower growth, higher debt interest costs and higher taxes for future generations",
    "link": "https://www.theglobeandmail.com/business/commentary/article-mark-carney-economy-fiscal-deficit-debt-interest-taxes/",
    "timestamp": "2025-07-18T11:04:06Z"
  },
  {
    "title": "Donald Trump Fires Housing Market Accusation at Powell's Fed",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump accused the Federal Reserve under Chair Jerome Powell of \"choking out the housing market\".\nTrump, citing higher interest rates, said they are \"making it difficult for people, especially …",
    "link": "https://biztoc.com/x/6432099abbfc3c5b",
    "timestamp": "2025-07-18T11:03:29Z"
  },
  {
    "title": "Democrats are right to flirt with Trump-Epstein conspiracies",
    "description": "A group of young protesters holds pictures of Jeffrey Epstein and Donald Trump outside federal court in New York City on July 8, 2019. | Luiz C. Ribeiro/New York Daily News/Tribune News Service via Getty Images \nDemocrats want you to know that President Donal…",
    "link": "https://biztoc.com/x/f8b6875d80d9c97a",
    "timestamp": "2025-07-18T11:03:09Z"
  },
  {
    "title": "Pam Bondi said to be 'aiding and abetting Trump' in new bid to 'dodge' scandal",
    "description": "Donald Trump's plan to publicize court documents in the Jeffrey Epstein case is actually a calculated \"strategy\" to avoid the scandal, and Pam Bondi is \"aiding and abetting\" him, according to a former federal prosecutor.Trump recently announced he would direc…",
    "link": "https://www.rawstory.com/pam-bondi-epstein-aiding-abetting/",
    "timestamp": "2025-07-18T11:01:40Z"
  },
  {
    "title": "Congress Just Injected Crypto Into the Most Stable Part of the U.S. Economy",
    "description": "The stablecoin bill Congress just passed injects crypto into the part of the economy that needs to stay steady via Treasurys. A lot could go wrong.",
    "link": "http://nymag.com/intelligencer/article/crypto-bill-stablecoins-treasuries-bitcoin-congress-tether-terra-circle.html",
    "timestamp": "2025-07-18T11:00:35Z"
  },
  {
    "title": "3 reasons California’s green energy campaign is dying on the vine",
    "description": "Gavin Newsom's green energy policies have led to California's highest gas prices, refinery closures and mandates for electric vehicles despite public resistance",
    "link": "https://www.foxnews.com/opinion/3-reasons-californias-green-energy-campaign-dying-vine",
    "timestamp": "2025-07-18T11:00:03Z"
  },
  {
    "title": "How the Right Is Waging War on Climate-Conscious Investing",
    "description": "A Leonard Leo-funded effort to destroy ESG has scared off much of corporate America.",
    "link": "https://www.theatlantic.com/politics/archive/2025/07/leonard-leo-consumers-research-esg-climate/683581/",
    "timestamp": "2025-07-18T11:00:00Z"
  },
  {
    "title": "The Trump camp’s tug of war over Fed Chair Jerome Powell’s future",
    "description": "Under the law, Trump can fire Powell for what's known as \"cause.\" What Trump’s inner circle is grappling with is what exactly constitutes “cause” in a way that can withstand legal scrutiny.",
    "link": "https://nypost.com/2025/07/18/business/the-trump-camps-tug-o-war-over-fed-chair-jerome-powells-future/",
    "timestamp": "2025-07-18T11:00:00Z"
  },
  {
    "title": "‘Historic win’ for crypto! – GENIUS Act heads to Trump for final approval",
    "description": "Crypto community welcomed the update, wants CLARITY Act to hit Trump's desk too.",
    "link": "https://ambcrypto.com/historic-win-for-crypto-genius-act-heads-to-trump-for-final-approval/",
    "timestamp": "2025-07-18T11:00:00Z"
  },
  {
    "title": "Iran's Military Leaders Threaten to Resume War",
    "description": "Iranian commanders threaten renewed war with Israel if necessary as a new report questions the impact of strikes on nuclear sites.",
    "link": "https://www.newsweek.com/iran-iigc-commager-restart-war-israel-us-2100649",
    "timestamp": "2025-07-18T10:59:56Z"
  },
  {
    "title": "Donald Trump Fires Housing Market Accusation at Powell's Fed",
    "description": "Trump is pushing for the Federal Reserve to cut interest rates.",
    "link": "https://www.newsweek.com/trump-fed-fire-powell-housing-market-interest-rates-2100695",
    "timestamp": "2025-07-18T10:59:51Z"
  },
  {
    "title": "Links 7/18/2025",
    "description": "Our levitational daily links, including Trump’s “bawdy” letter to Epstein, the NYT calls out “toxic empathy,” and disaster capitalists having a field day.",
    "link": "https://www.nakedcapitalism.com/2025/07/links-7-18-2025.html",
    "timestamp": "2025-07-18T10:55:09Z"
  },
  {
    "title": "Trump's cuts to NPR, PBS and foreign aid clear Congress",
    "description": "The Republican-controlled House voted 216-213 to give final passage to a bill cutting $9 billion in spending that had already been approved, sending it to President Donald Trump to become law.",
    "link": "https://biztoc.com/x/14ae3d6ccf69bd71",
    "timestamp": "2025-07-18T10:52:12Z"
  },
  {
    "title": "Donald Trump Changing 401(k) Plans: What To Know",
    "description": "In a major shift for the pensions market, the president intends to allow retirement savings plans to invest in private assets.",
    "link": "https://biztoc.com/x/6433b8ba6efa8393",
    "timestamp": "2025-07-18T10:52:02Z"
  },
  {
    "title": "Donald Trump Changing 401(k) Plans: What To Know",
    "description": "In a major shift for the pensions market, the president intends to allow retirement savings plans to invest in private assets.",
    "link": "https://www.newsweek.com/donald-trump-changing-401-k-what-know-2100628",
    "timestamp": "2025-07-18T10:50:02Z"
  },
  {
    "title": "Trump fires Epstein prosecutor Maurene Comey, which sure looks desperate",
    "description": "The move shows he has no idea how to bring MAGA to heel",
    "link": "https://www.salon.com/2025/07/18/trump-fires-epstein-prosecutor-maurene-comey-which-sure-looks-desperate/",
    "timestamp": "2025-07-18T10:45:56Z"
  },
  {
    "title": "'Oh come on': Conservative's defense of Trump-Epstein letter instantly shut down",
    "description": "A CNN panelist audibly rolled her eyes at a conservative guest's attempted defense of President Donald Trump against new reporting on his relationship with convicted sex trafficker Jeffrey Epstein.The Wall Street Journal published a bawdy letter written two d…",
    "link": "https://www.rawstory.com/trump-letter-to-epstein-bluey/",
    "timestamp": "2025-07-18T10:45:10Z"
  },
  {
    "title": "Brazil’s President Lula calls Trump’s 50% tariff threat over Bolsonaro’s trial ‘unacceptable blackmail’",
    "description": "Trump announced on July 9 his intention to slap steep tariffs on Brazil as punishment for what he termed a \"witch hunt\" against his far-right ally, former president Jair Bolsonaro.",
    "link": "https://fortune.com/2025/07/18/brazil-president-lula-trump-50-tariff-threat-bolsonaro-trial-unacceptable-blackmail/",
    "timestamp": "2025-07-18T10:44:57Z"
  },
  {
    "title": "US 'moving at haste' to get Ukraine weapons: envoy",
    "description": "Brussels, Belgium (AFP) July 17, 2025\n\n\n The United States was moving to get weapons to Ukraine quickly under President Donald Trump's plan for Europe to buy arms, and was weighing selling Patriot air defence systems from its own stocks, Washington's envoy to…",
    "link": "https://www.spacewar.com/reports/US_moving_at_haste_to_get_Ukraine_weapons_envoy_999.html",
    "timestamp": "2025-07-18T10:44:08Z"
  },
  {
    "title": "US delays Patriot arms deliveries to Switzerland in switch to Ukraine",
    "description": "Geneva (AFP) July 17, 2025\n\n\n Delivery of US Patriot weapons systems to Switzerland will be delayed as Washington reprioritises to provide more support to Ukraine, the Swiss government said Thursday. \n\nThe US defence department informed Bern this week \"that i…",
    "link": "https://www.spacewar.com/reports/US_delays_Patriot_arms_deliveries_to_Switzerland_in_switch_to_Ukraine_999.html",
    "timestamp": "2025-07-18T10:44:08Z"
  },
  {
    "title": "Israel strikes Damascus hard in support of the Druze",
    "description": "Washington DC (UPI) Jul 16, 2025 \n\n Israel carried out heavy airstrikes in the heart of Damascus on Wednesday, hitting the Syrian Defense Ministry headquarters and an area surrounding the presidential palace. The attack killed three people and wounded 34 othe…",
    "link": "https://www.spacewar.com/reports/Israel_strikes_Damascus_hard_in_support_of_the_Druze_999.html",
    "timestamp": "2025-07-18T10:44:08Z"
  },
  {
    "title": "N. Korea says Japan seeking to be a 'military giant'",
    "description": "Seoul (AFP) July 17, 2025\n\n\n A new Japanese defence policy white paper showed the country was seeking to be a major military power, North Korean state media reported a foreign ministry official as saying Friday, who justified Pyongyang's nuclear program on th…",
    "link": "https://www.spacewar.com/reports/N_Korea_says_Japan_seeking_to_be_a_military_giant_999.html",
    "timestamp": "2025-07-18T10:44:08Z"
  },
  {
    "title": "Facebook added 'value' to Instagram, Zuckerberg tells antitrust trial",
    "description": "Washington (AFP) April 16, 2025\n\n Social media titan Mark Zuckerberg testified for a second day Tuesday in a landmark US antitrust trial, defending his conglomerate Meta against accusations it took over Instagram and WhatsApp to devour budding competitors. \n\n…",
    "link": "https://www.spacedaily.com/reports/Facebook_added_value_to_Instagram_Zuckerberg_tells_antitrust_trial_999.html",
    "timestamp": "2025-07-18T10:44:08Z"
  },
  {
    "title": "“Get off Trump’s d*ck”: Antonio Brown slammed for controversial take on Donald Trump and California Governor Gavin Newsom’s $4 billion feud",
    "description": "Antonio Brown ignited controversy by posting a meme targeting California Governor Gavin Newsom on X, coinciding with President Donald Trump's decision to revoke $4 billion in federal funding for California's high-speed rail project. The post drew immediate ba…",
    "link": "https://timesofindia.indiatimes.com/sports/nfl/news/get-off-trumps-dck-antonio-brown-slammed-for-controversial-take-on-donald-trump-and-california-governor-gavin-newsoms-4-billion-feud/articleshow/122763899.cms",
    "timestamp": "2025-07-18T10:43:30Z"
  },
  {
    "title": "CBS axes Colbert's 'The Late Show' after Trump deal quip",
    "description": "US television presenter Stephen Colbert says his commercially successful and acclaimed \"The Late Show\" will end in May 2026. The timing follows his sharp criticism of CBS parent Paramount over a legal deal with Trump. US television host Stephen Colbert has an…",
    "link": "https://www.dw.com/en/cbs-axes-colberts-the-late-show-after-trump-deal-quip/a-73322132",
    "timestamp": "2025-07-18T10:42:00Z"
  },
  {
    "title": "Raghuram Rajan warns India to tread 'cleverly & carefully' in US trade talks",
    "description": "Raghuram Rajan advises India to be cautious in trade negotiations with the US, particularly in agriculture, due to the risk of subsidized foreign produce harming local farmers. He suggests exploring FDI to enhance value addition in sectors like dairy instead …",
    "link": "https://economictimes.indiatimes.com/news/economy/policy/raghuram-rajan-warns-india-to-tread-cleverly-carefully-in-us-trade-talks/articleshow/122763962.cms",
    "timestamp": "2025-07-18T10:41:51Z"
  },
  {
    "title": "O'Donnell saves choking woman at Dublin restaurant",
    "description": "American comedian and actress Rosie O'Donnell has shared how she sprang into action to assist \"a 90-year-old woman\" who started choking during dinner in Dublin.",
    "link": "https://www.rte.ie/entertainment/2025/0718/1524145-odonnell-saves-choking-woman-at-dublin-restaurant/",
    "timestamp": "2025-07-18T10:41:15Z"
  },
  {
    "title": "Morning Bid: Positive surprises and new stock records",
    "description": "It's Friday, so today I'll provide a quick overview of what's happening in global markets and then offer you some weekend reading suggestions away from the...",
    "link": "https://finance.yahoo.com/news/morning-bid-positive-surprises-stock-104112289.html",
    "timestamp": "2025-07-18T10:41:12Z"
  },
  {
    "title": "Your health insurance premiums could soon go up 15 percent — or more",
    "description": "The health care provisions in President Donald Trump’s big, beautiful bill will raise costs for many patients. | Eric Lee/Getty Images \nWe just got a preview of the likely consequences of the “big, beautiful bill” passed by Republicans in Congress and signed …",
    "link": "https://biztoc.com/x/ce0a3eeeace4b0fb",
    "timestamp": "2025-07-18T10:40:42Z"
  },
  {
    "title": "Rupee gives up gains, settles 4 paise lower at 86.16 against US dollar",
    "description": "At the interbank foreign exchange, the rupee opened higher against the US dollar at 85.99 and moved in the range of 85.97-86.23 before closing at 86.16",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-gives-up-gains-settles-4-paise-lower-at-8616-against-us-dollar/article69827220.ece",
    "timestamp": "2025-07-18T10:39:42Z"
  },
  {
    "title": "Can Donald Trump fire Jerome Powell, US Federal Reserve chair?",
    "description": "Trump questions Fed Chair Powell's tenure, hints fraud, yet experts view removal improbable due to legal constraints.",
    "link": "https://www.aljazeera.com/news/2025/7/18/can-donald-trump-fire-jerome-powell-us-federal-reserve-chair",
    "timestamp": "2025-07-18T10:38:28Z"
  },
  {
    "title": "Satellite Images Show New Trump Resort Emerge in Middle East",
    "description": "Gulf countries are close to President Donald Trump on both business and political levels as they pursue megaprojects to diversify economies",
    "link": "https://www.newsweek.com/satellite-images-show-new-trump-resort-emerge-middle-east-2100572",
    "timestamp": "2025-07-18T10:38:06Z"
  },
  {
    "title": "Stephen Colbert's late-night US TV to end next year",
    "description": "The cancellation is against a backdrop surrounding broadcaster CBS’s $16 million settlement with Donald Trump.",
    "link": "https://www.thejournal.ie/stephen-colbert-show-6766592-Jul2025/",
    "timestamp": "2025-07-18T10:38:05Z"
  }
]