[
  {
    "title": "Jimmy Kimmel Sounds Alarm On Trump's Real Plan For Epstein Files",
    "description": "Jimmy Kimmel Sounds Alarm On Trump's Real Plan For Epstein Fileshuffpost.com",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-trump-epstein-files_n_691d5329e4b0b763ab8c9a9b",
    "timestamp": "2025-11-19T06:53:09Z"
  },
  {
    "title": "Donald Trump the storyteller no longer has full control of the narrative",
    "description": "Another extraordinary scene in the Oval Office saw the US president take exception to a question directed at Saudi crown prince Mohammed bin Salman",
    "link": "https://www.irishtimes.com/world/us/2025/11/19/donald-trump-the-storyteller-no-longer-has-full-control-of-the-narrative/",
    "timestamp": "2025-11-19T06:48:52Z"
  },
  {
    "title": "'Daily Show' Stunned By Marjorie Taylor Greene's Big Trump Break: 'WTF Is Happening?!?'",
    "description": "Ronny Chieng made light of the longtime Trump loyalist's \"liberal\" turn away from the president.",
    "link": "https://www.huffpost.com/entry/daily-show-ronny-chieng-marjorie-taylor-greene-trump-epstein_n_691d51bfe4b0b763ab8c9a72",
    "timestamp": "2025-11-19T06:47:47Z"
  },
  {
    "title": "Trump’s shocking response to question part of a trend",
    "description": "Oval Office meeting with Mohammed bin Salman was a triumph for the Saudi crown prince",
    "link": "https://www.irishtimes.com/world/2025/11/19/trumps-shocking-response-to-reporters-question-part-of-a-trend/",
    "timestamp": "2025-11-19T06:37:04Z"
  },
  {
    "title": "Pope Leo XIV strongly supports US bishops' condemnation of Trump immigration raids: 'Extremely disrespectful'",
    "description": "Pope Leo XIV backed U.S. Catholic bishops in condemning the Trump administration's immigration sweeps, urging Americans to treat migrants with dignity.",
    "link": "https://www.foxnews.com/world/pope-leo-xiv-strongly-supports-us-bishops-condemnation-trump-immigration-raids-extremely-disrespectful",
    "timestamp": "2025-11-19T06:33:34Z"
  },
  {
    "title": "Operation Charlotte’s Web: Federal immigration raids sweep through Charlotte, targeting over 130 suspected undocumented residents",
    "description": "Federal agents detained over 130 individuals in Charlotte, North Carolina, during a two-day operation. This action is part of a nationwide immigration enforcement push. Officials stated the raids targeted those posing public safety risks or with criminal reco…",
    "link": "https://economictimes.indiatimes.com/news/international/us/operation-charlottes-web-federal-immigration-raids-sweep-through-charlotte-targeting-over-130-suspected-undocumented-residents/articleshow/125429037.cms",
    "timestamp": "2025-11-19T06:28:37Z"
  },
  {
    "title": "Real wages have grown – just – over the past year. But they’re still down near 2011 levels",
    "description": "A horror stretch starting in 2020 saw an entire decade of real wage growth reversed in just three years. It’s a long way back up yet.",
    "link": "https://theconversation.com/real-wages-have-grown-just-over-the-past-year-but-theyre-still-down-near-2011-levels-270141",
    "timestamp": "2025-11-19T06:28:23Z"
  },
  {
    "title": "₹1,064,800,000: 18-karat solid gold functional toilet 'America' sold at a whopping sum at Sotheby's auction. Who bought it?",
    "description": "A solid gold, flushable toilet sculpture titled \"America\" by Maurizio Cattelan sold for $12.1 million at a Sotheby's auction. The 18-karat gold artwork, weighing 223 pounds, was previously offered to President Donald Trump and satirizes excessive wealth. This…",
    "link": "https://economictimes.indiatimes.com/news/new-updates/1064800000-18-karat-solid-gold-functional-toilet-america-sold-at-a-whopping-sum-at-sothebys-auction-who-bought-it/articleshow/125428822.cms",
    "timestamp": "2025-11-19T06:26:08Z"
  },
  {
    "title": "Ukraine pushes for political decision from EU on frozen assets next month",
    "description": "LONDON (Reuters) -Ukraine is pushing European allies to take a political decision to release a proposed $163-billion loan based on frozen Russian state assets next month, as it frets over a gaping hole in the 2026 budget and fallout from an unfolding corrupti…",
    "link": "https://www.thestar.com.my/news/world/2025/11/19/ukraine-pushes-for-political-decision-from-eu-on-frozen-assets-next-month",
    "timestamp": "2025-11-19T06:14:00Z"
  },
  {
    "title": "Senator Opposes FCC Plan to Reverse Cyber Rules Adopted After Salt Typhoon Attack",
    "description": "The top Democrat on the Senate Commerce Committee on Tuesday called on the Federal Communications Commission to abandon plans to rescind cybersecurity requirements adopted after the massive Salt Typhoon Chinese hacking incident that infiltrated U.S. telecom c…",
    "link": "https://www.insurancejournal.com/news/national/2025/11/19/848182.htm",
    "timestamp": "2025-11-19T06:11:49Z"
  },
  {
    "title": "Tennessee state judge blocks National Guard deployment to Memphis",
    "description": "A Tennessee state court judge temporarily blocked on Monday Republican Governor Bill Lee's deployment of National Guard troops to the city of Memphis, ruling that the use of troops was likely not legal under the state's militia law. Chancellor Patricia Head M…",
    "link": "https://freerepublic.com/focus/f-news/4353330/posts",
    "timestamp": "2025-11-19T06:05:03Z"
  },
  {
    "title": "Gordon D’Arcy: Beating the Boks boils down to mindset",
    "description": "Ireland looked a vastly different team against Australia, in no short part due to a functioning set piece",
    "link": "https://www.irishtimes.com/sport/rugby/2025/11/19/gordon-darcy-beating-the-boks-boils-down-to-mindset/",
    "timestamp": "2025-11-19T06:00:01Z"
  },
  {
    "title": "Epstein files release sparks concerns about potential redactions and oversight",
    "description": "National Security Redactions Threaten Transparency – The newly passed Epstein bill allows redactions for “national security,” raising concerns that powerful figures—especially those linked to intelligence agencies—will be shielded from exposure. Trump’s Shift…",
    "link": "https://www.naturalnews.com/2025-11-19-epstein-files-release-sparks-concerns.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Trump announces F-35 sale to Saudi Arabia",
    "description": "President Donald Trump confirmed the U.S. will sell advanced F-35 stealth fighter jets to Saudi Arabia, reshaping Middle Eastern military dynamics while raising concerns over Israel’s security and potential Chinese espionage. Israeli officials oppose the sale…",
    "link": "https://www.naturalnews.com/2025-11-19-trump-announces-f35-sale-to-saudi-arabia.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Trump pushes “direct payment” health plan as alternative to Obamacare, claims bipartisan interest",
    "description": "Trump proposes redirecting federal ACA subsidies from insurance companies to individuals, allowing Americans to use funds for private insurance or deposit into Health Savings Accounts (HSAs). Funds would be “locked” for healthcare expenses only, preventing mi…",
    "link": "https://www.naturalnews.com/2025-11-19-trump-pushes-direct-payment-plan-alternative-obamacare.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Senate unanimously APPROVES Epstein Files Transparency Act, pressuring Trump to sign and release documents",
    "description": "The Senate passed the bill with no Republican objections, fast-tracking it through a procedural maneuver led by Senate Democratic Leader Chuck Schumer. The House approved the legislation with only one dissenting vote, signaling broad bipartisan support for tr…",
    "link": "https://www.naturalnews.com/2025-11-19-senate-unanimously-approves-epstein-files-transparency-act.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Patrick Byrne on the Deep State’s deception: Inside the Russian collusion hoax",
    "description": "In “Danger Close,” Byrne reveals he was manipulated by FBI/CIA operatives to fabricate a false narrative of Russian interference in the 2016 election. Agents directed him to facilitate meetings between Russian national Maria Butina and GOP figures, creating a…",
    "link": "https://www.naturalnews.com/2025-11-19-patrick-byrne-deep-state-deception-russiagate-hoax.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Unanimous Senate sends Epstein files bill to Trump’s desk",
    "description": "Congress passed a bill mandating the release of the Epstein files, sending the “Epstein Files Transparency Act” to President Trump’s desk with overwhelming, bipartisan support. The legislative process was unusually rapid, driven by a rare cross-party alliance…",
    "link": "https://www.naturalnews.com/2025-11-19-unanimous-senate-sends-epstein-files-bill-to-trump.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "Patrick Byrne on Maria Butina’s role in the Russian collusion hoax",
    "description": "In “Danger Close”, Patrick Byrne reveals that Maria Butina was used as part of a fabricated “Russian collusion” narrative against President Trump, orchestrated by the FBI and CIA to justify surveillance on Trump’s campaign and later the Mueller investigation.…",
    "link": "https://www.naturalnews.com/2025-11-19-patrick-byrne-butina-role-russian-collusion-hoax.html",
    "timestamp": "2025-11-19T06:00:00Z"
  },
  {
    "title": "After India's Russian oil rollback, GTRI says it’s Washington’s turn to cut the tariff",
    "description": "An Indian trade think tank urges Washington to remove a 25% tariff on Indian goods, arguing it's an unfair surcharge no longer justified after India significantly reduced Russian oil imports. The group highlights India's pivot to US energy suppliers and calls…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-25-percent-trump-tariff-russian-oil-import-rollback-gtri/articleshow/125428479.cms",
    "timestamp": "2025-11-19T05:58:57Z"
  },
  {
    "title": "US Congress orders Epstein files release after Trump U-turn",
    "description": "U.S. lawmakers voted overwhelmingly Tuesday for releasing government files on sex offender Jeffrey Epstein, after President Donald Trump dropped his opposition to opening the books on a scandal that has roiled politics, law enforcement and the country's elite.",
    "link": "https://www.hurriyetdailynews.com/us-congress-orders-epstein-files-release-after-trump-u-turn-215892",
    "timestamp": "2025-11-19T05:55:51Z"
  },
  {
    "title": "Trump says Saudi prince 'knew nothing' about journalist's murder",
    "description": "U.S. President Donald Trump fiercely defended Saudi Crown Prince Mohammed bin Salman Tuesday over the 2018 killing of journalist Jamal Khashoggi, insisting the kingdom's de facto ruler \"knew nothing\" about the murder as he wooed him at the White House.",
    "link": "https://www.hurriyetdailynews.com/trump-says-saudi-prince-knew-nothing-about-journalists-murder-215891",
    "timestamp": "2025-11-19T05:53:00Z"
  },
  {
    "title": "Zelensky trip to Türkiye aims to 're-engage' US in peace efforts",
    "description": "President Volodymyr Zelensky will head to Türkiye on Wednesday seeking to revive the United States' involvement in diplomatic efforts to end the Russian invasion.",
    "link": "https://www.hurriyetdailynews.com/zelensky-trip-to-turkiye-aims-to-re-engage-us-in-peace-efforts-215890",
    "timestamp": "2025-11-19T05:47:56Z"
  },
  {
    "title": "Stephen Colbert Says It’s ‘Epstein Rockin’ Eve’ After House Votes to Release Files: ‘A Ball Drop You’re Gonna Want to Miss’ | Video",
    "description": "\"I mean, tomorrow we might know everything he and his pervert buddies did,\" the comedian adds\nThe post Stephen Colbert Says It’s ‘Epstein Rockin’ Eve’ After House Votes to Release Files: ‘A Ball Drop You’re Gonna Want to Miss’ | Video appeared first on TheWra…",
    "link": "https://www.thewrap.com/stephen-colbert-reacts-house-vote-epstein-files-video/",
    "timestamp": "2025-11-19T05:46:40Z"
  },
  {
    "title": "Trump admin secretly drafting Ukraine peace plan with Russia: Reports",
    "description": "The Trump administration has been secretly working with Russia on a new draft plan to end the war in Ukraine, according to a report Tuesday.",
    "link": "https://www.hurriyetdailynews.com/trump-admin-secretly-drafting-ukraine-peace-plan-with-russia-reports-215889",
    "timestamp": "2025-11-19T05:42:08Z"
  },
  {
    "title": "Has Epstein 'ripped MAGA apart'? Maybe not, but there will be fallout",
    "description": "Before the Epstein files vote, Washington woke to a zero-degree morning, and Marjorie Taylor Greene could see the symbolism. \"My first thought was: hell has froze over,\" she said.",
    "link": "https://www.abc.net.au/news/2025-11-19/donald-trump-epstein-files-unlikely-series-of-events/106022276",
    "timestamp": "2025-11-19T05:37:06Z"
  },
  {
    "title": "Faith-based tech platform Gloo raises $72.8 million in US IPO",
    "description": "Gloo Holdings said on Wednesday that it has raised $72.8 million in its U.S. initial public offering, setting the stage for a rare debut by a software provider for the faith-based ecosystem in a market dominated by AI and crypto firms.The Boulder, Colorado-ba…",
    "link": "https://www.channelnewsasia.com/business/faith-based-tech-platform-gloo-raises-728-million-in-us-ipo-5476596",
    "timestamp": "2025-11-19T05:36:13Z"
  },
  {
    "title": "US Judge halts Trump’s $1b penalty bid against U of California over campus antisemitism",
    "description": "Trump can’t levy antisemitism fines against the University of California, judge rules.",
    "link": "https://www.israelnationalnews.com/news/418011",
    "timestamp": "2025-11-19T05:35:47Z"
  },
  {
    "title": "Trump's congressional gerrymandering push is getting complicated for the GOP",
    "description": "President Donald Trump is finding that redistricting his way to a GOP House majority in next year's midterms is a lot harder than it sounds",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-congressional-gerrymandering-push-complicated-gop-127657863",
    "timestamp": "2025-11-19T05:33:33Z"
  },
  {
    "title": "‘Quiet, piggy’ – Donald Trump snaps at female reporter when asked about Jeffrey Epstein files",
    "description": "Donald Trump told a female reporter to be “quiet, piggy” as he fielded questions about his relationship with Jeffrey Epstein on Air Force One.",
    "link": "https://www.independent.ie/world-news/north-america/quiet-piggy-donald-trump-snaps-at-female-reporter-when-asked-about-jeffrey-epstein-files/a1306431433.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Palestinian attackers kill one, injure three in West Bank attack",
    "description": "Palestinian attackers stabbed an Israeli to death and wounded three more in the occupied West Bank yesterday before being shot down by troops in the latest violence to rock the occupied territory, the Israeli military said.",
    "link": "https://www.independent.ie/world-news/middle-east/palestinian-attackers-kill-one-injure-three-in-west-bank-attack/a1570542014.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Trump says Saudi crown prince ‘didn’t know about murder of Khashoggi’ during White House visit",
    "description": "US president Donald Trump fiercely defended Mohammed bin Salman at the White House yesterday, insisting the Saudi crown prince did not know about the 2018 killing of Washington Post journalist Jamal Khashoggi by Saudi agents, effectively contradicting an asse…",
    "link": "https://www.independent.ie/world-news/north-america/trump-says-saudi-crown-prince-didnt-know-about-murder-of-khashoggi-during-white-house-visit/a1358110707.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Letters: Your columnist is correct, reading is the ultimate opener of imaginations",
    "description": "Ksenia Samotiy’s reflection on ­rediscovering fiction struck a nerve (‘How a page-turner “whodunnit” novel helped to rekindle my love of fiction’, Irish Independent, November 18).",
    "link": "https://www.independent.ie/opinion/letters/letters-your-columnist-is-correct-reading-is-the-ultimate-opener-of-imaginations/a372593210.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Two Ukrainians working for Russia behind rail explosion, Polish PM says",
    "description": "Two Ukrainian citizens working for Russia are suspected of blowing up a railway line in Poland over the weekend, prime minister Donald Tusk said yesterday.",
    "link": "https://www.independent.ie/world-news/europe/two-ukrainians-working-for-russia-behind-rail-explosion-polish-pm-says/a144209780.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Tears from Epstein’s alleged victims as House of Representatives votes to release the files",
    "description": "The Republican-controlled US House of Representatives voted almost unanimously yesterday to force the release of Justice Department files on the late convicted sex offender Jeffrey Epstein, an outcome president Donald Trump had fought for months before ending…",
    "link": "https://www.independent.ie/world-news/north-america/tears-from-epsteins-alleged-victims-as-house-of-representatives-votes-to-release-the-files/a225653377.html",
    "timestamp": "2025-11-19T05:30:00Z"
  },
  {
    "title": "Ukraine's ATACMS strikes against Russia are officially back after months of delays",
    "description": "Ukraine said it would continue to strike Russia with ATACMS, indicating that US policy may have shifted after reports it was vetoing such attacks.",
    "link": "https://www.businessinsider.com/ukraine-atacms-russia-strike-again-trump-administration-pentagon-2025-11",
    "timestamp": "2025-11-19T05:27:17Z"
  },
  {
    "title": "What to know about expanded work requirements about to kick in for SNAP",
    "description": "SNAP food benefits are flowing again after a pause during the federal government shutdown",
    "link": "https://abcnews.go.com/Health/wireStory/expanded-work-requirements-kick-snap-127657680",
    "timestamp": "2025-11-19T05:25:59Z"
  },
  {
    "title": "Comey's lawyers look to persuade judge that prosecution urged by Trump is vindictive, must be tossed",
    "description": "Former FBI Director James Comey is making another run at getting his criminal case dismissed, with his lawyers looking to convince a judge that the prosecution is vindictive and rooted in President Donald Trump’s hatred of him",
    "link": "https://abcnews.go.com/US/wireStory/comeys-lawyers-persuade-judge-prosecution-urged-trump-vindictive-127657469",
    "timestamp": "2025-11-19T05:25:48Z"
  },
  {
    "title": "Senator Tim Scott pushes for December vote on crypto market bill",
    "description": "Banking Committee Chairman Tim Scott has predicted there will be a vote on the market structure bill in December, and it could be introduced on the Senate floor early next year.",
    "link": "https://cointelegraph.com/news/tim-scott-eyes-december-crypto-market-structure-bill",
    "timestamp": "2025-11-19T05:24:26Z"
  },
  {
    "title": "U.S. confirms sale of $700 million air defense missile system to Taiwan",
    "description": "The United States has confirmed the sale to Taiwan of an advanced missile system worth almost $700 million which has been battle-tested in Ukraine, its second weapons package in a week bringing the total of $1 billion, and reaffirmed support for Taipei. In th…",
    "link": "https://japantoday.com/category/world/us-confirms-sale-of-700-million-air-defence-missile-system-to-taiwan2",
    "timestamp": "2025-11-19T05:24:20Z"
  },
  {
    "title": "Can Trump control inflation?",
    "description": "Notionally, Americans have never been better off. The ructions in tech stocks over the past few weeks cannot detract from the fact that the US economy has been outgunning other developed economies all century. The overall graph of real disposable income for A…",
    "link": "https://freerepublic.com/focus/f-news/4353324/posts",
    "timestamp": "2025-11-19T05:22:41Z"
  },
  {
    "title": "Christians in Nigeria 'driven from their homes and killed', Nicki Minaj says",
    "description": "The US-based Trinidadian rapper addressed the UN in New York alongside Trump administration officials, making claims that lack evidence.",
    "link": "https://www.bbc.com/news/articles/cd7r1y30ljqo",
    "timestamp": "2025-11-19T05:22:22Z"
  },
  {
    "title": "For conservative media, New York City Mayor-elect Zohran Mamdani quickly becomes attack target",
    "description": "New York City's mayor-elect, Zohran Mamdani, has quickly become a target of conservative media figures",
    "link": "https://abcnews.go.com/Business/wireStory/conservative-media-new-york-city-mayor-elect-zohran-127657678",
    "timestamp": "2025-11-19T05:17:56Z"
  },
  {
    "title": "US boosts defence capabilities of Taiwan with weapon sale",
    "description": "The United States confirmed the sale to Taiwan of an advanced missile system worth almost $700 (€604) million which has been battle-tested in Ukraine, its second weapons package in a week bringing the total of $1 billion, and reaffirmed support for Taipei.",
    "link": "https://www.rte.ie/news/world/2025/1119/1544701-us-taiwan-weapons/",
    "timestamp": "2025-11-19T05:16:35Z"
  },
  {
    "title": "Trump Pledges F-35s to Saudi Arabia in return for an unlikely $1 trillion in Investment, Angering Israel Lobbies",
    "description": "Ann Arbor (Informed Comment) - Al-Jazeera reports on the visit of Saudi Crown Prince Mohammed Bin Salman to the White House. One US goal for the meeting was to induct Saudi Arabia into the Abraham Accords, which Bahrain, the United Arab Emirates, Morocco and …",
    "link": "https://www.juancole.com/2025/11/unlikely-trillion-investment.html",
    "timestamp": "2025-11-19T05:15:21Z"
  },
  {
    "title": "ALAN DERSHOWITZ: Can Trump Legally Send Troops Into Our Cities? The Answer Is ‘Wishy-Washy’",
    "description": "I would use President Donald Trump’s decision to send troops into cities as a classic example of an issue whose resolution is unpredictable.",
    "link": "https://dailycaller.com/2025/11/19/opinion-can-trump-legally-send-troops-into-our-cities-the-answer-is-wishy-washy-alan-dershowitz/",
    "timestamp": "2025-11-19T05:10:53Z"
  },
  {
    "title": "Trump Luxuriates in Golden Ballroom Plans as",
    "description": "( Tomdispatch.com ) - When I began TomDispatch in the wake of the 9/11 attacks and the invasion of Afghanistan, believe me, the world did not look good. But I guarantee you one thing: if you had told me then that, almost a quarter of a century later, the pres…",
    "link": "https://www.juancole.com/2025/11/luxuriates-golden-ballroom.html",
    "timestamp": "2025-11-19T05:04:51Z"
  },
  {
    "title": "From France to Russia, where else can students from India go for their higher education, amid loss of charm for US",
    "description": "Overseas students’ enrolment in the US falls 7%, there are several other countries including Russia, Poland and France which Indian students can explore aside from the US.",
    "link": "https://www.livemint.com/money/personal-finance/study-abroad-from-france-to-russia-where-can-indian-students-pursue-higher-education-amid-loss-of-charm-for-the-us-11763477379869.html",
    "timestamp": "2025-11-19T05:03:53Z"
  },
  {
    "title": "What to know about expanded work requirements about to kick in for SNAP",
    "description": "After a disruptive U.S. government shutdown, federal SNAP food assistance is again flowing to low-income households.  The Supplemental Nutrition Assistance...",
    "link": "https://www.yahoo.com/news/articles/know-expanded-requirements-kick-snap-050236936.html",
    "timestamp": "2025-11-19T05:02:36Z"
  },
  {
    "title": "US-Saudi relations reset: Fighter Jets, investment, Abraham Accords",
    "description": "During a high-profile visit to the White House, Crown Prince Mohammed bin Salman of Saudi Arabia received a warm welcome as pivotal announcements reshaped the narrative around Middle Eastern politics and the bond between the US and Saudi Arabia.",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-saudi-relations-reset-fighter-jets-investment-abraham-accords/articleshow/125427553.cms",
    "timestamp": "2025-11-19T05:02:28Z"
  },
  {
    "title": "Saudi Arabia designated major non-NATO ally of US, gets F-35 warplanes deal",
    "description": "US President Donald Trump hails elevation of military cooperation with Saudi Arabia to 'even greater heights'.",
    "link": "https://www.aljazeera.com/news/2025/11/19/saudi-arabia-designated-major-non-nato-ally-of-us-gets-f-35-warplanes-deal",
    "timestamp": "2025-11-19T05:00:19Z"
  },
  {
    "title": "Mamdani: Before and After the Campaign",
    "description": "New Yorkers had become accustomed to the “campaign” Mamdani: youthful, energetic, always smiling. “Campaign” Mamdani was skillful at deflecting tough questions such as whether or not he condemned Hamas, using the occasion to t...",
    "link": "https://www.americanthinker.com/articles/2025/11/mamdani_before_and_after_the_campaign.html",
    "timestamp": "2025-11-19T05:00:00Z"
  },
  {
    "title": "It takes an impressive ignorance to believe that Democrat policies make things more affordable",
    "description": "It takes a complete lack of knowledge and history to believe that Democrat policies make things more affordable. Price increases, and a rising cost of living, are caused mostly by a few simple economic concepts.\r\n\r\nSupply and demand. A simple example...",
    "link": "https://www.americanthinker.com/blog/2025/11/it_takes_an_impressive_ignorance_to_believe_that_democrat_policies_make_things_more_affordable.html",
    "timestamp": "2025-11-19T05:00:00Z"
  },
  {
    "title": "You should care about Miami’s mayoral race. Bigly.",
    "description": "The Miami mayoral runoff, coming on December 9, is far more than a local contest. It is the first real test of whether Republicans can regain their footing after multiple off-year setbacks.\r\n\r\nThe first round, on November 4, made that clear when Demo...",
    "link": "https://www.americanthinker.com/blog/2025/11/you_should_care_about_miami_s_mayoral_race_bigly.html",
    "timestamp": "2025-11-19T05:00:00Z"
  },
  {
    "title": "Six Democrats openly call for military and intelligence services to disobey President Trump’s orders",
    "description": "Nov. 18 should henceforth be recognized as far more dangerous than Jan. 6 ever was. Far more shocking. And an actual attempt at fomenting an insurrection, a coup. The “Nov. 18ers” should be forever shamed and discredited.\r\n\r\nRather than h...",
    "link": "https://www.americanthinker.com/blog/2025/11/six_democrats_openly_call_for_military_and_intelligence_services_to_disobey_president_trump_s_orders.html",
    "timestamp": "2025-11-19T05:00:00Z"
  },
  {
    "title": "Is China infiltrating the American education system?",
    "description": "There is growing evidence that China’s infiltration of American systems is an alarming trend that no one can ignore.\r\n\r\nChina has found ways into secure systems in the U.S.  A recent case from this year saw a soldier being charged wit...",
    "link": "https://www.americanthinker.com/blog/2025/11/is_china_infiltrating_the_american_education_system.html",
    "timestamp": "2025-11-19T05:00:00Z"
  },
  {
    "title": "Epstein Survivor Reveals She Voted for Trump – But Now Says ‘He Owes Us an Apology’",
    "description": "Jena-Lisa Jones said she voted for President Donald Trump because she hoped he would release the government's files on deceased sex trafficker Jeffrey Epstein, who sexually abused her. But now she says Trump owes her and other survivors \"an apology.\"\nThe post…",
    "link": "https://www.mediaite.com/media/tv/epstein-survivor-reveals-she-voted-for-trump-but-now-says-he-owes-us-an-apology/",
    "timestamp": "2025-11-19T04:55:47Z"
  },
  {
    "title": "Vanity Fair faces backlash for all-men annual Hollywood Issue cover: ‘What happened to the women?’",
    "description": "The cover featured A-list actors from Jonathan Bailey to Michael B. Jordan",
    "link": "https://www.the-independent.com/life-style/vanity-fair-hollywood-issue-asap-rocky-glen-powell-b2867913.html",
    "timestamp": "2025-11-19T04:50:31Z"
  },
  {
    "title": "When will BSE Telangana SSC 2026 timetable be released? Check exam date trends of the last 3 years",
    "description": "Telangana’s Class 10 students await the release of the SSC 2025 timetable, as BSE Telangana has yet to publish the official datesheet on its website. With exams traditionally held between March and April, the delay has intensified anticipation in schools. Onc…",
    "link": "https://timesofindia.indiatimes.com/education/news/when-will-telangana-ssc-2026-timetable-be-released-here-are-previous-year-exam-trends/articleshow/125427197.cms",
    "timestamp": "2025-11-19T04:49:57Z"
  },
  {
    "title": "Gold toilet, Klimt portrait sell for millions at Sotheby’s",
    "description": "A portrait by Gustav Klimt fetched a record price at a New York auction, which also sold a fully functional gold toilet, a satirical artwork by Maurizio Cattelan, for millions.",
    "link": "https://www.abc.net.au/news/2025-11-19/klimt-portrait-gold-toilet-millions-at-new-york-auction/106027716",
    "timestamp": "2025-11-19T04:49:51Z"
  },
  {
    "title": "Asian shares retreat in cautious trading ahead of Nvidia profit report",
    "description": "Asian shares have fallen in cautious trading after worries about Nvidia and the overall market frenzy over artificial intelligence technology sent Wall Street stocks lower",
    "link": "https://abcnews.go.com/Business/wireStory/asian-shares-retreat-cautious-trading-ahead-nvidia-profit-127657251",
    "timestamp": "2025-11-19T04:46:10Z"
  },
  {
    "title": "Why is bitcoin plunging?",
    "description": "Bitcoin has tumbled from last month’s record as fears of a renewed US-China trade war, uncertainty over Federal Reserve rate cuts, and a stronger dollar push investors toward safer assets. Market volatility, large liquidations, and wider concerns about crypto…",
    "link": "https://economictimes.indiatimes.com/tech/technology/why-is-bitcoin-plunging/articleshow/125427220.cms",
    "timestamp": "2025-11-19T04:43:28Z"
  },
  {
    "title": "US officials visit Kyiv to revive peace talks - reports",
    "description": "Two top US Army officials have made a rare wartime visit to Kyiv by US President Donald Trump's administration, arriving on an unannounced trip for talks with Ukraine's leaders in an attempt to revive stalled peace talks with Russia, Politico reported.",
    "link": "https://www.rte.ie/news/world/2025/1119/1544699-ukraine-russia/",
    "timestamp": "2025-11-19T04:43:26Z"
  },
  {
    "title": "US: Meta wins major antitrust case, avoids forced break-up",
    "description": "Meta, formerly Facebook, secured a victory in a major antitrust case brought by the FTC. The judge ruled that the tech giant did not currently hold monopoly power, dismissing claims that its acquisitions of Instagram and WhatsApp were solely to eliminate comp…",
    "link": "https://timesofindia.indiatimes.com/world/us/us-meta-wins-major-antitrust-case-avoids-forced-break-up/articleshow/125427199.cms",
    "timestamp": "2025-11-19T04:43:18Z"
  },
  {
    "title": "'India saved my mother's life': Sheikh Hasina's son rejects legitimacy of her extradition",
    "description": "Sajeeb Wazed Joy, the son of former Prime Minister Sheikh Hasina of Bangladesh, has voiced a vehement objection to his country's extradition request. He expressed gratitude towards India for playing a crucial role in preserving his mother's life, while simult…",
    "link": "https://economictimes.indiatimes.com/news/india/india-saved-my-mothers-life-sheikh-hasinas-son-rejects-legitimacy-of-her-extradition/articleshow/125427194.cms",
    "timestamp": "2025-11-19T04:42:17Z"
  },
  {
    "title": "Hyundai boss says White House apologised to him over Georgia raid",
    "description": "The carmaker's boss said the raid was \"a bad surprise\" but that the firm will keep investing in the US.",
    "link": "https://www.bbc.com/news/articles/c8ey0nl62ypo",
    "timestamp": "2025-11-19T04:41:37Z"
  },
  {
    "title": "Trump Designates Saudi Arabia Major Non-NATO Ally",
    "description": "WASHINGTON (Sputnik) - The United States will become a primary strategic partner of Saudi Arabia under the bilateral Strategic Defense Agreement (SDA) reached during Saudi Crown Prince Mohammed bin Salman's visit to Washington, the White House said in a state…",
    "link": "https://sputnikglobe.com/20251119/trump-designates-saudi-arabia-major-non-nato-ally-1123137233.html",
    "timestamp": "2025-11-19T04:39:03Z"
  },
  {
    "title": "Thomas Crooks and Tyler Robinson were BOTH into the furry subculture, and yet NOBODY seems to care.",
    "description": "Don't you think if 2 violent assassins were into http://GlennBeck.com subculture, the media and the FBI would be all over that?!(Transcribed by TurboScribe.ai. Go Unlimited to remove this message.) Independent researchers now are using the same kind of digita…",
    "link": "https://freerepublic.com/focus/f-news/4353319/posts",
    "timestamp": "2025-11-19T04:37:44Z"
  },
  {
    "title": "Did FBI Remove Trump’s Name From Epstein Files? Report Claims Review Of 100,000 Documents, 300GB Of Evidence",
    "description": "An old report has brought back a question Donald Trump’s team hoped would disappear: did the FBI work through the night to remove his name from the Jeffrey Epstein files before saying there was nothing left to release? The timing is important as Trump has sud…",
    "link": "https://freerepublic.com/focus/f-chat/4353318/posts",
    "timestamp": "2025-11-19T04:34:09Z"
  },
  {
    "title": "Trump attacks ABC reporter after question about killing of Saudi journalist Khashoggi (David Bauder/Associated Press)",
    "description": "David Bauder / Associated Press:\nTrump attacks ABC reporter after question about killing of Saudi journalist Khashoggi  —  President Donald Trump denounced ABC News' Mary Bruce as a “terrible reporter” Tuesday and threatened the network's license to broadcast…",
    "link": "https://www.memeorandum.com/251118/p164",
    "timestamp": "2025-11-19T04:30:00Z"
  },
  {
    "title": "Trump praises Cristiano Ronaldo at White House dinner in rare US appearance for soccer great",
    "description": "President Donald Trump made sure to praise soccer great Cristiano Ronaldo during a White House dinner to welcome the Crown Prince of Saudi Arabia, Mohammed bin Salman.",
    "link": "https://nypost.com/2025/11/18/sports/trump-praises-cristiano-ronaldo-at-white-house-dinner-for-saudi-crown-prince/",
    "timestamp": "2025-11-19T04:28:52Z"
  },
  {
    "title": "Fatal clash on Thai-Cambodia border after Trump-brokered peace deal breaks down",
    "description": "The truce broke down this week after a Thai soldier lost a leg to a landmine blast, prompting Thailand’s PM to say the peace deal was ‘now over’One person has been killed by gunfire along the Thai-Cambodia border as conflict heats up between the two nations d…",
    "link": "https://freerepublic.com/focus/f-news/4353316/posts",
    "timestamp": "2025-11-19T04:28:04Z"
  },
  {
    "title": "Why is bitcoin plunging?",
    "description": "The value of bitcoin has fallen sharply since reaching record heights last month, briefly falling below $90,000 on Tuesday compared with above $126,000 at the start of October. Below AFP explains why investors are turning away from the volatile asset. – What …",
    "link": "https://www.digitaljournal.com/world/why-is-bitcoin-plunging/article",
    "timestamp": "2025-11-19T04:27:32Z"
  },
  {
    "title": "US confirms sale of US$700 million air defence missile system to Taiwan",
    "description": "TAIPEI: The United States confirmed the sale to Taiwan of an advanced air defence missile system worth almost US$700 million, which has been battle-tested in Ukraine, in the second such weapons package for Taipei in a week.In the Indo-Pacific region, only Aus…",
    "link": "https://www.channelnewsasia.com/east-asia/us-confirms-sale-700-million-air-defence-missile-system-taiwan-5476396",
    "timestamp": "2025-11-19T04:22:44Z"
  },
  {
    "title": "ABC managing director tells journalists not to 'second-guess' their work",
    "description": "In an address to the National Press Club, Hugh Marks says he inherited a \"fearfulness\" within the public broadcaster but that it is improving in its response to mistakes and external scrutiny.",
    "link": "https://www.abc.net.au/news/2025-11-19/abc-managing-director-addresses-national-press-club/106027282",
    "timestamp": "2025-11-19T04:19:19Z"
  },
  {
    "title": "Five things to know about Africa's first G20",
    "description": "Founded in 1999, the Group of 20 (G20) leading economies comprises 19 countries and two regional bodies, the European Union and the African Union (AU). Its rotating presidency will be held by South Africa this year and mark the first time the summit will be i…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/five-things-to-know-about-africas-first-g20/articleshow/125426718.cms",
    "timestamp": "2025-11-19T04:17:59Z"
  },
  {
    "title": "Trump Says Visiting Saudi Crown Prince Knew Nothing About Khashoggi Killing, Contradicting U.S. Intel",
    "description": "U.S. intelligence agencies concluded that bin Salman approved the capture or killing of Khashoggi at the Saudi consulate in Istanbul.",
    "link": "https://www.huffpost.com/entry/trump-saudi-crown-prince_n_691d4054e4b06f2a60ca7d8d",
    "timestamp": "2025-11-19T04:13:27Z"
  },
  {
    "title": "Rupee rises 9 paise to 88.51 against US dollar in early trade",
    "description": "At the interbank foreign exchange market, the rupee opened at 88.57 and gained further to trade at 88.51 against the greenback in initial deals, up 9 paise from its previous closing level.",
    "link": "https://www.thehindubusinessline.com/markets/forex/rupee-rises-9-paise-to-8851-against-us-dollar-in-early-trade/article70297494.ece",
    "timestamp": "2025-11-19T04:08:17Z"
  },
  {
    "title": "'Tally is now 60': Congress after Trump repeats 'India-Pak' peace broker claim",
    "description": "In a recent meeting with the Saudi Crown Prince, Donald Trump once again touted his supposed role in averting a war between India and Pakistan, sparking backlash from Congress who scrutinized the Modi administration for entertaining such claims.",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/tally-is-now-60-congress-after-trump-repeats-india-pak-peace-broker-claim/articleshow/125426586.cms",
    "timestamp": "2025-11-19T04:07:25Z"
  },
  {
    "title": "Elizabeth Warren Warns Trump Making A 'Tremendous Mistake' By Selling Federal Student Loans To Wall Street: 'I'm Fighting Back'",
    "description": "Sen. Elizabeth Warren (D-Mass.) criticized President Donald Trump’s plans to sell federal student loans to private companies, warning that the move could create windfall gains for Wall Street, at the expense of taxpayers and average working Americans.\nA ‘Give…",
    "link": "https://biztoc.com/x/1dd6529234bfbc05",
    "timestamp": "2025-11-19T04:03:37Z"
  },
  {
    "title": "AOC And Mamdani Seem Reluctant To Back Primary Challenge To Jeffries",
    "description": "The two have shied away from supporting a progressive who's expected to step into the race.",
    "link": "https://www.huffpost.com/entry/aoc-mamdani-chi-osse-jeffries_n_691d33a1e4b073def3eecace",
    "timestamp": "2025-11-19T04:02:35Z"
  },
  {
    "title": "Why Ronaldo Turned Up At The White House",
    "description": "'My son is a big fan of Ronaldo. And Barron got to meet him and I think he respects his father a little bit more now that I have introduced you. Thank you for being here, it's an honor.'",
    "link": "https://www.rediff.com/sports/report/why-ronaldo-turned-up-at-the-white-house/20251119.htm",
    "timestamp": "2025-11-19T04:02:21Z"
  },
  {
    "title": "Trump calls for ABC broadcast licences to be revoked after reporter's question",
    "description": "Trump made the comment after a reporter for ABC News asked Trump about the Jeffrey Epstein political scandal during an Oval Office event with the Saudi crown prince",
    "link": "https://www.thehindubusinessline.com/news/world/trump-calls-for-abc-broadcast-licences-to-be-revoked-after-reporters-question/article70297451.ece",
    "timestamp": "2025-11-19T04:02:11Z"
  },
  {
    "title": "Israel needs compensation for Saudi jets, but its air supremacy won't vanish so soon",
    "description": "Israel can ostensibly be pleased by the UN resolution to establish the International Stabilization Force in Gaza, but there are also risks to its interests and achievements in the war. The UN resolution deals precisely with things Prime Minister Benjamin Neta…",
    "link": "https://www.haaretz.com/israel-news/2025-11-19/ty-article/.premium/israel-needs-compensation-for-saudi-jets-but-its-air-supremacy-wont-vanish-so-soon/0000019a-98c1-d67f-adbe-dec3d44a0000",
    "timestamp": "2025-11-19T04:00:12Z"
  },
  {
    "title": "‘He Is!’ Democrats Erupt After Republican Tells Member She Can’t Call Trump a ‘Felon’ on House Floor",
    "description": "Del. Stacey Plaskett gave a fiery speech on the House floor on Tuesday that irked at least one Republican in the chamber.\nThe post ‘He Is!’ Democrats Erupt After Republican Tells Member She Can’t Call Trump a ‘Felon’ on House Floor first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/he-is-democrats-erupt-after-republican-tells-member-she-cant-call-trump-a-felon-on-house-floor/",
    "timestamp": "2025-11-19T03:53:44Z"
  },
  {
    "title": "Nicki Minaj Teams Up With Trump Administration To Talk About Christian Persecution In Nigeria",
    "description": "\"What an unlikely duo, but what an amazing duo,\" said Mike Waltz, Trump’s ambassador to the United Nations.",
    "link": "https://www.huffpost.com/entry/nicki-minaj-teams-up-with-trump-administration-to-talk-about-christian-persecution-in-nigeria_n_691d0922e4b073def3eeaafb",
    "timestamp": "2025-11-19T03:50:45Z"
  },
  {
    "title": "James Comer vows to give Clintons Bannon treatment if they defy subpoenas",
    "description": "Comer said the Clintons are two Democrats that his committee has not heard back from regarding subpoenas for their testimony on their ties to Epstein, and that continued silence will be met with criminal referrals. House Oversight Committee Chairman James Com…",
    "link": "https://freerepublic.com/focus/f-news/4353309/posts",
    "timestamp": "2025-11-19T03:48:35Z"
  },
  {
    "title": "House Dem slammed for 'sick' defense of colleague caught texting Epstein during 2019 hearing",
    "description": "Rep. Jamie Raskin, D-Md., was ridiculed for his defense of colleague Stacey Plaskett, who Republicans sought to censure Tuesday for texting Jeffrey Epstein during a 2019 hearing about Donald Trump.",
    "link": "https://www.foxnews.com/politics/house-dem-slammed-sick-defense-colleague-caught-texting-epstein-during-2019-hearing",
    "timestamp": "2025-11-19T03:47:40Z"
  },
  {
    "title": "Scott Jennings Predicts New Evidence Will Show Epstein Did A Lot With Democrats",
    "description": "Scott Jennings said Tuesday that Democrats may soon face blowback as newly released records continue to expose ties between high-profile figures and Jeffrey Epstein.",
    "link": "https://dailycaller.com/2025/11/18/scott-jennings-evidence-epstein-democrats/",
    "timestamp": "2025-11-19T03:46:41Z"
  },
  {
    "title": "US confirms sale of $700 million air defence missile system to Taiwan",
    "description": "On Monday, the Pentagon said the company was given a firm fixed-price contract for procurement of the NASAMS units, with work estimated to be completed in February 2031. \"Fiscal 2026 foreign military sales (Taiwan) funds in the amount of $698,948,760 were obl…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-confirms-sale-of-700-million-air-defence-missile-system-to-taiwan/articleshow/125426317.cms",
    "timestamp": "2025-11-19T03:46:21Z"
  }
]