[
  {
    "title": "Trump Lands in Saudi Arabia to Begin Whirlwind Gulf Tour",
    "description": "Donald Trump touched down in Saudi Arabia early Tuesday morning to a warm welcome by Crown Prince Mohammed bin Salman as he began the first leg of a whirlwind Gulf tour. Business deals are at the top of the U.S. president's busy agenda that also takes in Qata…",
    "link": "https://www.breitbart.com/politics/2025/05/13/trump-lands-in-saudi-arabia-to-begin-whirlwind-gulf-tour/",
    "timestamp": "2025-05-13T07:40:09Z"
  },
  {
    "title": "Honda forecasts 70% net profit drop citing ‘tariff impact’",
    "description": "Japan’s Honda Motor on Tuesday forecast a 70 percent drop in net profit for the 2025-26 financial year as US trade tariffs weigh on the global auto industry. The announcement comes after rival Toyota, the world’s top-selling carmaker, predicted a 35 percent y…",
    "link": "https://www.digitaljournal.com/world/honda-forecasts-70-net-profit-drop-citing-tariff-impact/article",
    "timestamp": "2025-05-13T07:37:32Z"
  },
  {
    "title": "Jolani proposes Trump Tower in Damascus, peace with Israel for sanctions relief: Report",
    "description": "The head of the HTS-led administration in Syria has offered to build Trump Tower in Damascus, reach peace with Israel and provide the US with access to Syria's oil and gas, as he is seeking US sanctions relief, a report says.",
    "link": "https://www.globalsecurity.org/wmd/library/news/syria/2025/syria-250512-presstv01.htm",
    "timestamp": "2025-05-13T07:37:14Z"
  },
  {
    "title": "Scholar urges Taiwan to enhance ties with democracies other than U.S.",
    "description": "A scholar from the United Kingdom on Monday urged Taiwan to strengthen its economic and trade ties with major global powers beyond the United States, given the uncertainties and challenges arising from Donald Trump's return to the White House.",
    "link": "https://www.globalsecurity.org/wmd/library/news/taiwan/2025/taiwan-250512-cna02.htm",
    "timestamp": "2025-05-13T07:36:06Z"
  },
  {
    "title": "Trump Starts Gulf Trip In Saudi Eyeing Deals",
    "description": "Donald Trump arrived in Saudi Arabia on Tuesday on the first leg of a Gulf tour that will also take him to Qatar and the United Arab Emirates, eyeing business deals even as accords on the Middle East's hotspots will likely be harder to reach.",
    "link": "https://www.ibtimes.com/trump-starts-gulf-trip-saudi-eyeing-deals-3773337",
    "timestamp": "2025-05-13T07:35:44Z"
  },
  {
    "title": "Gold investments booming in Japan as U.S. tariffs stir economic fears",
    "description": "Japan is seeing a boom in gold investment amid heightening concerns over a global economic slowdown caused by U.S. President Donald Trump's hefty tariffs, as investors seek a safe asset seen as unlikely to plummet in the event of turbulence. The benchmark pri…",
    "link": "https://japantoday.com/category/business/gold-investments-booming-in-japan-as-u.s.-tariffs-stir-economic-fears",
    "timestamp": "2025-05-13T07:33:45Z"
  },
  {
    "title": "Top $TRUMP Meme Coin Holders To Get 'VIP' Treatment, Solana NFTs, And Background Checks",
    "description": "The $TRUMP meme coin contest has ended, and 220 whales emerged, including 25 \"VIP\" holders who collectively spent millions to get the top spots in the leaderboard – winners will need to go through background checks before their attendance at the much-anticipa…",
    "link": "https://www.ibtimes.com/top-trump-meme-coin-holders-get-vip-treatment-solana-nfts-background-checks-3773322",
    "timestamp": "2025-05-13T07:33:38Z"
  },
  {
    "title": "WTO chief says global free trade is in crisis",
    "description": "Global free trade is in crisis, the head of the World Trade Organization chief said Tuesday while meeting Japanese Prime Minister Shigaru Ishiba on Tuesday. Ngozi Okonjo-Iweala, director-general of the World Trade Organization, told Ishiba that she has high e…",
    "link": "https://japantoday.com/category/politics/WTO-chief-says-global-free-trade-is-in-crisis",
    "timestamp": "2025-05-13T07:33:30Z"
  },
  {
    "title": "Kremlin Avoids Comment On Zelenskyy Peace Talks Proposal As Russian Drones Attack Ukraine",
    "description": "Ukrainian President Volodymyr Zelenskyy said he is ready to meet Russian counterpart Vladimir Putin in Istanbul on May 15, a call Moscow avoided agreeing to after it launched dozens of attack drones at Ukraine.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250512-rferl02.htm",
    "timestamp": "2025-05-13T07:28:41Z"
  },
  {
    "title": "Weimar+: press remarks by High Representative/Vice-President Kaja Kallas ahead of the meeting",
    "description": "Good morning everybody,It is great to be back in the UK.",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250512-eeas01.htm",
    "timestamp": "2025-05-13T07:27:55Z"
  },
  {
    "title": "Prime Minister Tusk in Kyiv: We Call on Russia to Accept Unconditional Ceasefire",
    "description": "From Kyiv, a city under destruction and bombardment, comes a call for a just and lasting peace. Poland, France, the United Kingdom, Germany, Ukraine, and other members of the Coalition of the Willing are calling on Russia to agree to a 30-day unconditional ce…",
    "link": "https://www.globalsecurity.org/wmd/library/news/ukraine/2025/05/ukraine-250510-govplpm01.htm",
    "timestamp": "2025-05-13T07:27:32Z"
  },
  {
    "title": "Edan Alexander declines Qatar visit, plans to meet Trump in US",
    "description": "Released Israeli-American soldier cites medical needs after captivity; family says meeting with US President Donald Trump will happen later in the US.",
    "link": "https://www.israelnationalnews.com/news/408264",
    "timestamp": "2025-05-13T07:26:18Z"
  },
  {
    "title": "Trump Heads to Saudi Arabia; Gaza Hostage Released | Horizons Middle East & Africa 5/13/2025",
    "description": "US President Donald Trump is set to arrive in Saudi Arabia, spinning signs of success from big gambles on Iran, Gaza, the ...",
    "link": "https://biztoc.com/x/e30f7c5c5d12b99d",
    "timestamp": "2025-05-13T07:24:52Z"
  },
  {
    "title": "Google Facing at Least EUR 12 Billion in Civil Claims Across Europe",
    "description": "Google is facing at least EUR 12 billion (roughly Rs. 1,13,259 crore) in damage claims from dozens of price comparison websites across the European Union. The complaints blame Google for stealing their customers. Google denies that any of the European civil s…",
    "link": "https://www.gadgets360.com/internet/news/google-facing-eur-12-billion-civil-claims-across-europe-8401479",
    "timestamp": "2025-05-13T07:24:43Z"
  },
  {
    "title": "White South African Refugees Welcomed by Trump Admin as They Arrive in US",
    "description": "Deputy Secretary of State Chris Landau told the refugees that the U.S. is the \"land of the free\" after they arrived at Dulles International Airport on Monday.",
    "link": "https://www.newsweek.com/white-south-african-refugees-arrive-us-donald-trump-2071346",
    "timestamp": "2025-05-13T07:24:41Z"
  },
  {
    "title": "Truth Social Denies Meme Coin Plans as Trump Token Slips",
    "description": "Trump Media denied plans for a Truth Social meme coin, but past token proposals and ongoing crypto ventures continue to fuel confusion.",
    "link": "https://decrypt.co/319402/truth-social-denies-meme-coin-plans-trump-token-falters",
    "timestamp": "2025-05-13T07:22:42Z"
  },
  {
    "title": "Tariffs set to level up game console prices",
    "description": "The US tariffs barrage and the bounding cost of producing games have prompted manufacturers like Sony and Microsoft to announce price hikes on consoles, in an industry shift experts say is set to last. Sony’s 2020-vintage Playstation 5 has seen its price hike…",
    "link": "https://www.digitaljournal.com/world/tariffs-set-to-level-up-game-console-prices/article",
    "timestamp": "2025-05-13T07:22:32Z"
  },
  {
    "title": "SALT, Tips and Auto Loans: A Guide to the House GOP Tax Bill",
    "description": "(Bloomberg) -- House Republicans’ release of the tax provisions in their massive fiscal bill provides a crucial initial reading of what party leaders think...",
    "link": "https://finance.yahoo.com/news/salt-tips-auto-loans-guide-211810280.html",
    "timestamp": "2025-05-13T07:22:20Z"
  },
  {
    "title": "Trump arrives in Saudi Arabia — after Air Force One receives fighter-jet escort",
    "description": "President Trump landed in Saudi Arabia Tuesday morning after receiving a dramatic fighter jet escort through the kingdom's airspace.",
    "link": "https://nypost.com/2025/05/13/us-news/trump-arrives-in-saudi-arabia-after-air-force-one-receives-fighter-jet-escort/",
    "timestamp": "2025-05-13T07:20:37Z"
  },
  {
    "title": "How the Pacific Northwest’s dream of green energy fell apart - Oregon Public Broadcasting",
    "description": "This article was produced in partnership with ProPublica’s Local Reporting Network. Sign up for First Look to get stories like this one delivered to your inbox six days a week.\nOn Feb. 17, Oregon Gov. Tina Kotek released a video assuring Oregonians that Presi…",
    "link": "https://biztoc.com/x/5f74058a5a9f21e0",
    "timestamp": "2025-05-13T07:18:21Z"
  },
  {
    "title": "Tariffs Set To Level Up Game Console Prices",
    "description": "The US tariffs barrage and the bounding cost of producing games have prompted manufacturers like Sony and Microsoft to announce price hikes on consoles, in an industry shift experts say is set to last.",
    "link": "https://www.ibtimes.com/tariffs-set-level-game-console-prices-3773334",
    "timestamp": "2025-05-13T07:18:18Z"
  },
  {
    "title": "Donald Trump Jr. Squashes Rumors of ‘Truth Social’ Memecoin",
    "description": "Any claims or attempts of a Truth Social token are by \"scammers,\" the younger Trump said in an X post.",
    "link": "https://www.coindesk.com/markets/2025/05/13/donald-trump-jr-squashes-rumors-of-truth-social-memecoin",
    "timestamp": "2025-05-13T07:18:09Z"
  },
  {
    "title": "Honda Signals Profit Drop as Carmakers Brace for Trump Tariffs",
    "description": "Honda Motor Co. issued a lukewarm profit forecast as it braced for the fallout of US President Donald Trump’s trade war.",
    "link": "https://financialpost.com/pmn/business-pmn/honda-signals-profit-drop-as-carmakers-brace-for-trump-tariffs",
    "timestamp": "2025-05-13T07:16:27Z"
  },
  {
    "title": "\"Stupid\" To Reject Free Air Force One As Gift By Qatar: Trump Amid Criticism",
    "description": "US President Donald Trump&#039;s plans to receive a free Air Force One replacement from Qatar has triggered a massive political row and raised various concerns, even as he said he would be &quot;stupid&quot; not to accept such a gift.",
    "link": "https://www.ndtv.com/world-news/stupid-to-reject-free-gift-qatar-air-force-one-jet-plane-us-president-donald-trump-amid-criticisms-saudi-arabia-tour-visit-8401410",
    "timestamp": "2025-05-13T07:16:18Z"
  },
  {
    "title": "New York Post Shreds Major Team Trump Claim About His Motives",
    "description": "Even the usually pro-Trump tabloid has warned why the optics of the president's latest controversy \"are beyond awful.\"",
    "link": "https://www.huffpost.com/entry/new-york-post-donald-trump-criticism_n_6822ea7de4b0993b52bebcc3",
    "timestamp": "2025-05-13T07:16:10Z"
  },
  {
    "title": "New York Post Shreds Major Donald Team Trump Claim About His Motives",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_caa748b5-b350-400c-80ac-69e1ee969272",
    "timestamp": "2025-05-13T07:16:10Z"
  },
  {
    "title": "Europe Awaits Turkey Summit to Push US on Russian Sanctions",
    "description": "European leaders are ready to wait until after a possible meeting between Ukraine’s President Volodymyr Zelenskiy and Russia’s Vladimir Putin in Turkey before pushing the US to announce fresh sanctions on Moscow, people familiar with the matter said.",
    "link": "https://financialpost.com/pmn/business-pmn/europe-awaits-turkey-summit-to-push-us-on-russian-sanctions",
    "timestamp": "2025-05-13T07:16:00Z"
  },
  {
    "title": "Trump in the Middle East: How much are US-Gulf investments worth?",
    "description": "US President Donald Trump embarks on a three-day tour of Saudi Arabia, Qatar, and the United Arab Emirates from Tuesday.",
    "link": "https://www.aljazeera.com/news/2025/5/13/trumo-in-the-middle-east-how-much-are-us-gulf-investments-worth",
    "timestamp": "2025-05-13T07:15:46Z"
  },
  {
    "title": "Trump starts Gulf trip in Saudi eyeing deals",
    "description": "Donald Trump arrived in Saudi Arabia on Tuesday on the first leg of a Gulf tour that will also take him to Qatar and the United Arab Emirates, eyeing business deals even as accords on the Middle East's hotspots will likely be harder to reach.",
    "link": "https://www.hurriyetdailynews.com/trump-starts-gulf-trip-in-saudi-eyeing-deals-209112",
    "timestamp": "2025-05-13T07:12:00Z"
  },
  {
    "title": "Trump arrives in Riyadh: Israel-Saudi ties expected to take a backseat",
    "description": "Accompanied by prominent American business leaders, Trump will visit Riyadh first, the site of the Saudi-US Investment Forum.",
    "link": "https://www.jpost.com/middle-east/article-853760",
    "timestamp": "2025-05-13T07:09:27Z"
  },
  {
    "title": "‘No guardrails’: How India-Pakistan combat obliterated old red lines",
    "description": "From missiles targeting broad swaths of territory to water as a weapon, the threshold for the next war has been lowered.",
    "link": "https://www.aljazeera.com/news/2025/5/13/no-guardrails-how-india-pakistan-combat-obliterated-old-red-lines",
    "timestamp": "2025-05-13T07:08:49Z"
  },
  {
    "title": "US tariff pause on Beijing puts pressure on 'China-plus-one' countries",
    "description": "A U.S.-China tariff pause is pressuring manufacturing hubs like Vietnam and Mexico to secure better trade deals with the U.S. to maintain their \"China-plus-one\" advantage. While the pause offers China a reprieve, uncertainty persists, potentially delaying mul…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-tariff-pause-on-beijing-puts-pressure-on-china-plus-one-countries/articleshow/121131806.cms",
    "timestamp": "2025-05-13T07:07:31Z"
  },
  {
    "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
    "description": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu\nPresident Donald Trump has slashed the tariff on small parcels sent from mainland China and Hong Kong to the US, just hours after the world's two biggest economies said they would cut lev…",
    "link": "https://biztoc.com/x/5a68796e3c3ff5fe",
    "timestamp": "2025-05-13T07:07:02Z"
  },
  {
    "title": "금리 인하 지연시킨 트럼프 쌍판대기 아이폰에 붙이자",
    "description": "The US and China have achieved what President Trump called a “total reset” on trade. On today’s Big Take podcast, what the tariff rollback means for global markets and the world’s two largest economies. https://t.co/F4Sqiw2Aq0— Bloomberg (@business) May 12, 2…",
    "link": "https://ryueyes11.tistory.com/511626",
    "timestamp": "2025-05-13T07:06:36Z"
  },
  {
    "title": "SoftBank Vision Funds swing to annual loss as investment gains slow by 40%",
    "description": "Softbank's Vision Fund business posted a loss in the fiscal year ended March as it posted slowing gains at its massive tech investment arm.",
    "link": "https://www.cnbc.com/2025/05/13/softbank-vision-fund-swings-to-annual-loss-as-investment-gains-slow.html",
    "timestamp": "2025-05-13T07:05:29Z"
  },
  {
    "title": "China deepens ties with Latin America during Beijing forum",
    "description": "China offered a line of credit to Latin American and Caribbean countries at a summit in Beijing, with the event attended by leaders such as Brazilian President Lula. China's Xi thinly criticized US tariffs at the event. China extended a credit line of $9.2 bi…",
    "link": "https://www.dw.com/en/china-deepens-ties-with-latin-america-during-beijing-forum/a-72524517",
    "timestamp": "2025-05-13T07:04:00Z"
  },
  {
    "title": "President Donald Trump at the 2025 Indy 500? What we know about possible IMS appearance",
    "description": "Donald Trump was invited by IMS owner Roger Penske to be at the 2025 Indianapolis 500. Will the president be there?",
    "link": "https://www.indystar.com/story/sports/motor/indy-500/2025/05/13/will-president-donald-trump-be-at-2025-indianapolis-500-what-we-know-ims-roger-penske-indy/83513604007/",
    "timestamp": "2025-05-13T07:01:17Z"
  },
  {
    "title": "Free ride: Allies, even Laura Loomer, turn on President Trump for accepting luxury jet from Qatar",
    "description": "President Trump says he'll accept a $400 million 747 from Qatar – and he's just about the only one who appears all too thrilled by the decision.",
    "link": "https://www.foxnews.com/politics/free-ride-allies-even-laura-loomer-turn-president-trump-accepting-luxury-jet-from-qatar",
    "timestamp": "2025-05-13T07:00:29Z"
  },
  {
    "title": "China Accuses US of 'Smearing and Shifting Blame' on Fentanyl",
    "description": "The Trump Administration had hailed the progress made with China on tackling the fentanyl crisis.",
    "link": "https://www.newsweek.com/china-accuses-us-smearing-shifting-blame-fentanyl-2071343",
    "timestamp": "2025-05-13T07:00:10Z"
  },
  {
    "title": "House Republicans Finalize Plan to Increase Endowment Tax Up to 21%",
    "description": "House Republicans Finalize Plan to Increase Endowment Tax Up to 21%\n\n \n\n\n \njessica.blake@…\n\nTue, 05/13/2025 - 03:00 AM\n\nThe plan has been in the works for weeks and now will face a committee markup Tuesday.\n \n Byline(s)\r\n\n \n Jessica Blake",
    "link": "https://www.insidehighered.com/news/government/politics-elections/2025/05/13/endowment-taxes-could-climb-21-percent-under-new-bill",
    "timestamp": "2025-05-13T07:00:00Z"
  },
  {
    "title": "Minority Health Grants Biggest Target of NIH Cuts",
    "description": "The Trump administration has terminated a disproportionately high number of research grants from the National Institute on Minority Health and Health Disparities during its ideological overhaul of the National Institutes of Health, according to a paper publis…",
    "link": "https://www.insidehighered.com/news/quick-takes/2025/05/13/minority-health-grants-biggest-target-nih-cuts",
    "timestamp": "2025-05-13T07:00:00Z"
  },
  {
    "title": "Stephen Colbert Flags The Trump Quote That Makes His Qatar Jet Gift Even Worse",
    "description": "The \"Late Show\" host exposed the president's hypocrisy in his plan to accept a $400 million jet from the Qatari government.",
    "link": "https://www.huffpost.com/entry/stephen-colbert-trump-qatar-jet-gift_n_6822d7fce4b0abb58358dc06",
    "timestamp": "2025-05-13T06:59:38Z"
  },
  {
    "title": "Trump lands in S. Arabia to kick off Middle East tour",
    "description": "United States President Donald Trump touched down in Saudi Arabia on Tuesday, launching a tour of the three richest nations in the Middle East with high-stakes meetings focused on Iran, Gaza, and glob...",
    "link": "https://biztoc.com/x/845c3e1414cedbe1",
    "timestamp": "2025-05-13T06:55:52Z"
  },
  {
    "title": "Live updates: Trump visits Saudi Arabia to kickstart Middle East trip | CNN Politics",
    "description": "President Donald Trump is embarking on the first major international trip of his second term. Follow here for the latest live news updates.",
    "link": "https://www.cnn.com/politics/live-news/trump-middle-east-news-05-13-25",
    "timestamp": "2025-05-13T06:53:21Z"
  },
  {
    "title": "Analysis-US tariff pause on Beijing puts pressure on 'China-plus-one' countries",
    "description": "BEIJING/MEXICO CITY/HANOI (Reuters) -A new U.S.-China agreement to pause sky-high tariffs on each other is pressuring manufacturing hubs such as Vietnam and ...",
    "link": "https://finance.yahoo.com/news/analysis-us-tariff-pause-beijing-065119100.html",
    "timestamp": "2025-05-13T06:51:19Z"
  },
  {
    "title": "Inside Politics: Good and bad news for Ireland from Trump’s UK deal",
    "description": "Row brewing over Leaving Cert reforms; Martin trades barbs with Orban",
    "link": "https://www.irishtimes.com/politics/2025/05/13/inside-politics-ireland-trump-uk-tariffs-leaving-cert-simon-harris/",
    "timestamp": "2025-05-13T06:50:56Z"
  },
  {
    "title": "Australia's biggest defence export is going global",
    "description": "Canada's decision to turn to Australia for help in beefing up its defence of the Arctic has raised eyebrows in the defence industry.",
    "link": "https://www.abc.net.au/news/2025-05-13/canada-urgently-wants-australias-jorn-defence-radar/105185284",
    "timestamp": "2025-05-13T06:48:56Z"
  },
  {
    "title": "Animoca eyes New York listing, cites Trump’s crypto-friendly stance",
    "description": "Hong Kong-based Animoca Brands is preparing for a listing in New York, citing US President Donald Trump’s relaxed regulatory stance on digital assets as a window of opportunity to enter the world’s biggest capital market.Animoca executive chair Yat Siu told t…",
    "link": "https://cointelegraph.com/news/animoca-brands-new-york-listing-trump-crypto-push",
    "timestamp": "2025-05-13T06:48:12Z"
  },
  {
    "title": "Pakistan army says 51 killed in military conflict with India",
    "description": "(Reuters) - Pakistan's army said on Tuesday 11 armed forces and 40 civilians were killed in a military clash with neighbour India, after a weekend ceasefire agreed between the nuclear-armed rivals and announced by U.S. President Donald Trump. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/05/13/pakistan-army-says-51-killed-in-military-conflict-with-india",
    "timestamp": "2025-05-13T06:48:00Z"
  },
  {
    "title": "Japan's Nikkei jumps to 3-month peak on Sino-US tariff truce",
    "description": "Nikkei in Japan saw a surge, hitting a three-month high. This happened because the United States and China decided to reduce tariffs temporarily. The move eased worries about a possible global recession. Shipping, pharma, and banking sectors performed well. A…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-jumps-to-3-month-peak-on-sino-us-tariff-truce/articleshow/121131264.cms",
    "timestamp": "2025-05-13T06:47:47Z"
  },
  {
    "title": "US to cut ‘de minimis’ tariff on China shipments to 54% from 120%",
    "description": "The United States would cut the low value \"de minimis\" tariff on China shipments to 54% from 120%, with a flat fee of $100 to remain, starting from May 14, modifying an earlier order imposed by Washington, a White House executive order said on Monday.",
    "link": "https://nypost.com/2025/05/13/us-news/us-to-cut-de-minimis-tariff-on-china-shipments-to-54-from-120/",
    "timestamp": "2025-05-13T06:45:54Z"
  },
  {
    "title": "‘I think it's a great gesture’ - Trump says it would be 'stupid' not to accept gift of $400 million luxury Qatari plane",
    "description": "U.S. President Donald Trump dismissed ethical concerns about his plan to accept an airplane as a gift from the Qatari royal family, saying on Monday it would be \"stupid\" to turn down the generous offer.",
    "link": "https://www.independent.ie/world-news/north-america/i-think-its-a-great-gesture-trump-says-it-would-be-stupid-not-to-accept-gift-of-400-million-luxury-qatari-plane/a2019880961.html",
    "timestamp": "2025-05-13T06:45:37Z"
  },
  {
    "title": "The 8 at 8: Tuesday",
    "description": "Government urged to act after Donegal drownings, a Defence Forces exodus and good news for first-time buyers.",
    "link": "https://www.thejournal.ie/the-8-at-8-tuesday-44-6703265-May2025/",
    "timestamp": "2025-05-13T06:45:26Z"
  },
  {
    "title": "'Dr. Doom' Nouriel Roubini Says Trump 'Chickened Out' In Trade War With China, Calls Xi Jinping 'The Clear Winner' After Tariff Rollback",
    "description": "Nouriel Roubini, the Iranian-American economist known as “Dr. Doom” for predicting the 2008 financial crisis, said that President Donald Trump “blinked and chickened out” in his trade confrontation with Chinese President Xi Jinping.\nWhat Happened: In his rece…",
    "link": "https://biztoc.com/x/d10e2deecafb7712",
    "timestamp": "2025-05-13T06:44:49Z"
  },
  {
    "title": "India warns the US at WTO of retaliation against $7.6 billion imports over its steel, aluminium tariffs",
    "description": "India escalates WTO clash with US over steel and aluminium tariffs, warns of $7.6 billion retaliatory action.",
    "link": "https://www.thehindubusinessline.com/economy/india-warns-the-us-at-wto-of-retaliation-against-76-billion-imports-over-its-steel-aluminium-tariffs/article69570351.ece",
    "timestamp": "2025-05-13T06:41:47Z"
  },
  {
    "title": "Edan Alexander will not fly to Qatar due to medical condition",
    "description": "Released hostage Edan Alexander will not fly to Qatar due to his medical condition, which requires him to rest",
    "link": "https://www.jpost.com/breaking-news/article-853751",
    "timestamp": "2025-05-13T06:40:53Z"
  },
  {
    "title": "Pakistan says it is committed to truce with India, vows to respond to aggression",
    "description": "Pakistan said on Tuesday that it remains committed to the truce with India, agreed after four days of intense fighting last week, but vowed to respond to any...",
    "link": "https://www.yahoo.com/news/pakistan-army-says-51-killed-063623844.html",
    "timestamp": "2025-05-13T06:36:23Z"
  },
  {
    "title": "US to cut 'de minimis' tariff on China shipments to 54% from 120%",
    "description": "HONG KONG: The United States will cut the low value \"de minimis\" tariff on China shipments to 54 per cent from 120 per cent, modifying an earlier order imposed by Washington, a White Hous",
    "link": "https://www.channelnewsasia.com/world/us-de-minimis-tariff-cut-packages-china-shipping-post-5125951",
    "timestamp": "2025-05-13T06:36:13Z"
  },
  {
    "title": "Jon Stewart Criticizes Trump for Taking Free Jet: ‘He’s Like the Reverse Oprah’",
    "description": "Jon Stewart took aim at Donald Trump for accepting a free jet from Qatar on the latest episode of 'The Daily Show.'",
    "link": "http://www.rollingstone.com/tv-movies/tv-movie-news/jon-stewart-donald-trump-qatar-free-jet-1235337823/",
    "timestamp": "2025-05-13T06:34:50Z"
  },
  {
    "title": "Uproar as Trump welcomes white South African ‘refugees’ to US, following unfounded claims of ‘racial persecution’",
    "description": "Uproar as Trump welcomes white South African ‘refugees’ to US, following unfounded claims of ‘racial persecution’7news.com.au",
    "link": "https://7news.com.au/news/uproar-as-trump-welcomes-white-south-african-refugees-to-us-following-unfounded-claims-of-racial-persecution-c-18677848",
    "timestamp": "2025-05-13T06:34:03Z"
  },
  {
    "title": "Trump Is Visiting 3 Countries Where His Family Business Made Recent Deals - Business Insider",
    "description": "Trump Is Visiting 3 Countries Where His Family Business Made Recent DealsBusiness Insider Trump's 17th week back in office to focus on Middle East trip, admin leaders ironing out China trade talksFox News Middle Eastern states compete to wow Donald TrumpThe E…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177479495",
    "timestamp": "2025-05-13T06:32:38Z"
  },
  {
    "title": "The first group of white South Africans arrives in the US under Trump’s refugee program (videos)",
    "description": "The US president said asylum applications for the country's white South African minority had been accelerated as the applicants are victims of racial discrimination\nThe post The first group of white South Africans arrives in the US under Trump’s refugee progr…",
    "link": "https://en.protothema.gr/2025/05/13/the-first-group-of-white-south-africans-arrives-in-the-us-under-trumps-refugee-program-videos/",
    "timestamp": "2025-05-13T06:30:21Z"
  },
  {
    "title": "CNBC Daily Open: Is the trade agreement between the U.S. and China a 'Trump put'?",
    "description": "Over the weekend, both the U.S. and China agreed to reciprocally slash tariffs on each other for 90 days from 125% to 10% — much more than expected.",
    "link": "https://www.cnbc.com/2025/05/13/cnbc-daily-open-is-the-us-china-trade-agreement-a-trump-put.html",
    "timestamp": "2025-05-13T06:30:01Z"
  },
  {
    "title": "RFK Jr. Mocked For Stealing 1 Of Trump’s Most Eye-Roll-Inducing Lines",
    "description": "Critics found the line hilariously familiar.",
    "link": "https://www.huffpost.com/entry/rfk-jr-trump-line-mocked_n_6822e21de4b0abb58358e5d7",
    "timestamp": "2025-05-13T06:29:10Z"
  },
  {
    "title": "Trump Slashes 'De Minimis' Tariff on China for Low Value Packages",
    "description": "The tariff affects China's major e-commerce services such as SHEIN and Temu.",
    "link": "https://www.newsweek.com/trump-china-trade-tariff-de-minimis-temu-shein-2071334",
    "timestamp": "2025-05-13T06:28:48Z"
  },
  {
    "title": "FII return with Rs 46K cr buying spree; likely prefer largecaps vs broader market stocks. Here’s why",
    "description": "FIIs have poured in over Rs 46,000 crore into Indian equities since mid-April, favouring largecaps amid easing geopolitical and trade tensions. Analysts point to quality-led buying in private banks, capital goods, and infrastructure stocks. While midcaps see …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-return-with-rs-46k-cr-buying-spree-likely-prefer-largecaps-vs-broader-market-stocks-heres-why/articleshow/121130558.cms",
    "timestamp": "2025-05-13T06:27:09Z"
  },
  {
    "title": "Trump’s 90-Day Tariff Truce: Temporary relief or deeper trouble?",
    "description": "President Donald Trump’s agreement with China to reduce tariffs for 90 days brought a much-needed break in the ongoing trade war. The U.S. agreed to lower its import tariffs from 145% to 30%, while China responded by reducing its retaliatory tariffs from 125%…",
    "link": "https://m.economictimes.com/markets/stocks/news/trumps-90-day-tariff-truce-temporary-relief-or-deeper-trouble/relief-in-the-trade-war/slideshow/121131064.cms",
    "timestamp": "2025-05-13T06:22:28Z"
  },
  {
    "title": "Nissan Job Cuts: Struggling Nissan to cut 10,000 more jobs, Marketing & Advertising News, ET BrandEquity",
    "description": "Nissan faces significant challenges, planning to cut 10,000 more jobs amid a projected $5 billion annual loss. This follows an earlier announcement of 9,000 job cuts, totaling a 15 per cent workforce reduction. The struggling automaker grapples with competiti…",
    "link": "https://brandequity.economictimes.indiatimes.com/news/business-of-brands/struggling-nissan-to-cut-10000-more-jobs/121129632",
    "timestamp": "2025-05-13T06:21:41Z"
  },
  {
    "title": "Stock market goes berserk on China trade deal as S&P 500 set to wipe out Liberation Day losses: Live updates",
    "description": "The stock market soared on Monday morning after Donald Trump dramatically sealed a trade dal with China.\nAmerica will cut tariffs it imposed on Chinese imports last month from 145 percent to 30 percent.\nChinese levies on U.S. imports will fall from 125 percen…",
    "link": "https://biztoc.com/x/0c9f1a9b18287e32",
    "timestamp": "2025-05-13T06:11:38Z"
  },
  {
    "title": "Trump faces $2 trillion hurdle to win money from Saudi Prince",
    "description": "Saudi Arabia's ambitious economic transformation plans, costing an estimated $2 trillion, may hinder its ability to fulfill a potential $1 trillion investment commitment to the US. Crown Prince Mohammed bin Salman's focus on domestic projects like Neom and ho…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-faces-2-trillion-hurdle-to-win-money-from-saudi-prince/articleshow/121129743.cms",
    "timestamp": "2025-05-13T06:08:16Z"
  },
  {
    "title": "Manga Sparks Earthquake Fears and Flight Cancellations from Hong Kong",
    "description": "Greater Bay Airlines, which resumed regular flights between Sendai and Hong Kong last December for the first time in 13 years, currently operates four round trips per week. However, starting this week and continuing through the end of October, the airline wil…",
    "link": "https://newsonjapan.com/article/145751.php",
    "timestamp": "2025-05-13T06:05:35Z"
  },
  {
    "title": "NZX rallies 0.87% as tariff uncertainty eases; Skellerup climbs 4% - Market close",
    "description": "Market enjoys lift as world’s two largest economies reduce tariffs for at least 90 days.",
    "link": "https://www.nzherald.co.nz/business/markets/shares/nzx-rallies-087-as-tariff-uncertainty-eases-skellerup-climbs-4-market-close/MK24PUF54ZBVPGVIIKQCFY3SUM/",
    "timestamp": "2025-05-13T06:04:44Z"
  },
  {
    "title": "Experts warn Congress cuts to addiction funding will mean more overdose deaths",
    "description": "A broad coalition of addiction experts wants Congress to maintain healthcare funding for the nation's response to fentanyl and other street drugs.",
    "link": "https://www.npr.org/2025/05/13/nx-s1-5393916/medicaid-overdose-trump-congress",
    "timestamp": "2025-05-13T06:04:14Z"
  },
  {
    "title": "A gilded gift sparks controversy in the skies: Trump’s Qatar jet deal upends tradition",
    "description": "The Trump administration plans to accept a $400M luxury Boeing 747-8 from Qatar as a temporary replacement for the aging Air Force One fleet, sparking constitutional and ethical debates. Critics argue the arrangement may violate the Foreign Emoluments Clause,…",
    "link": "https://www.naturalnews.com/2025-05-13-trumps-qatar-jet-deal-upends-tradition.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "DOGE cancels 500,000 federal credit cards in crackdown on wasteful spending",
    "description": "The Department of Government Efficiency (DOGE), led by Elon Musk, deactivated over 500,000 federal credit cards, uncovering $40 billion in annual wasteful spending across 32 agencies. An audit revealed 4.6 million active government credit cards—far exceeding …",
    "link": "https://www.naturalnews.com/2025-05-13-doge-federal-credit-cards-wasteful-spending.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "Trump declares EU ‘nastier than China’ as trade war escalates â\u0080\u0093 Is the bloc fighting for survival?",
    "description": "The European Union, once a steadfast ally of the United States, now finds itself in the crosshairs of President Donald Trump’s economic offensive. In a fiery press conference, Trump accused the EU of being “nastier than China” in trade practices, signaling a …",
    "link": "https://www.naturalnews.com/2025-05-13-eu-nastier-than-china-as-us-trade-war-heats-up.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "SUSPECTED PHARMA SHILLS: Dr. Martin Makary, new FDA commissioner, is affiliated with the insidious WEF and was former business partner of Calley Means",
    "description": "Dr. Martin Adel Makary was confirmed on March 25, 2025, by the U.S. Senate as the 27th Commissioner of Food and Drugs. This is the same Marty Makary who was the Chief Advisory Doctor for HEB, an American Grocery Company with pharmacies. HEB is a member of the…",
    "link": "https://www.naturalnews.com/2025-05-13-suspected-pharma-shills-dr-martin-makary.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "Trump’s EO ending gain-of-function research sparks global debate on lab risks",
    "description": "President Donald Trump signed an order suspending federal funding for gain-of-function research both domestically and in “countries of concern” like China and Iran, citing pandemic risks and national security concerns. Gain-of-function studies manipulate path…",
    "link": "https://www.naturalnews.com/2025-05-13-eo-ending-gain-function-research-sparks-debate.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "Mexico takes Google to court over Gulf of Mexico naming dispute",
    "description": "The Mexican government filed a lawsuit against Google for renaming the Gulf of Mexico to the Gulf of America on Google Maps, arguing the U.S. lacks unilateral authority to alter an internationally recognized name. The U.S. House approved a bill formalizing th…",
    "link": "https://www.naturalnews.com/2025-05-13-mexico-takes-google-to-court-gulf-of-mexico.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "Trump appoints Ed Martin to lead DOJ “weaponization” probe â\u0080\u0093 a reckoning for Biden-era overreach?”",
    "description": "President Donald Trump named conservative legal strategist Ed Martin as associate deputy attorney general and pardon attorney to investigate alleged abuses of federal power against conservatives, pro-life advocates and January 6 defendants. After Senate Repub…",
    "link": "https://www.naturalnews.com/2025-05-13-ed-martin-to-lead-doj-weaponization-probe.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "What Did I Miss? Contestant Can’t Believe the Trump Tariffs Are Real Either (Exclusive Clip)",
    "description": "The Greg Gutfeld-hosted show is currently streaming on Fox Nation",
    "link": "https://www.adweek.com/tvnewser/greg-gutfeld-what-did-i-miss-trump-tariffs-how-to-watch/",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "Trump eyes $1 trillion Saudi investments as Gaza war stalls Israel deal",
    "description": "President Trump is visiting Saudi Arabia to secure $1 trillion in investments, focusing on defense, AI, and infrastructure deals amid stalled Saudi-Israel normalization talks due to the Gaza war. The trip prioritizes economic gains over diplomacy, with Saudi …",
    "link": "https://www.naturalnews.com/2025-05-13-trump-saudi-investments-gaza-war-stalls-israel-deal.html",
    "timestamp": "2025-05-13T06:00:00Z"
  },
  {
    "title": "World trade chief says global free trade is in a 'crisis' while on visit to Japan",
    "description": "The head of the global trade watchdog says global free trade is facing a “crisis” as U.S. President Donald Trump disrupts world commerce with his fast-changing tariffs and other policies",
    "link": "https://abcnews.go.com/International/wireStory/world-trade-chief-global-free-trade-crisis-visit-121737854",
    "timestamp": "2025-05-13T05:58:15Z"
  },
  {
    "title": "First White South African Refugees Arrive in U.S., Welcomed by Trump Admin",
    "description": "DULLES, VIRGINIA — White South African refugees were welcomed into the United States by the Department of State and Department of Homeland Security (DHS) on Monday, as President Donald Trump condemned the “genocide that’s taking place” against them. Deputy Se…",
    "link": "https://freerepublic.com/focus/f-chat/4316646/posts",
    "timestamp": "2025-05-13T05:58:04Z"
  },
  {
    "title": "Donald Trump Decouples the United States from Israel, by Thierry Meyssan",
    "description": "After patiently proposing to Benjamin Netanyahu that he negotiate with the Palestinian resistance and meeting only a stubborn determination to massacre the Palestinians, annex Gaza, southern Lebanon and Syria, and launch a war against Iran, the Trump administ…",
    "link": "https://www.voltairenet.org/article222255.html",
    "timestamp": "2025-05-13T05:57:01Z"
  },
  {
    "title": "Tuesday's papers: Twin mortality, drug costs and Eurovision frenzy",
    "description": "A strange case of the near simultaneous deaths of identical twins has been occupying Finnish media, as has the Eurovision Song Contest.",
    "link": "https://yle.fi/a/74-20161398",
    "timestamp": "2025-05-13T05:51:08Z"
  },
  {
    "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
    "description": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu\nPresident Donald Trump has slashed the tariff on small parcels sent from mainland China and Hong Kong to the US, just hours after the world's two biggest economies said they would cut lev…",
    "link": "https://biztoc.com/x/b2c3373b5df1af6b",
    "timestamp": "2025-05-13T05:49:11Z"
  },
  {
    "title": "Documenting the Damage",
    "description": "By: Brett Heinz\u000bApril 30, 2025\u000bLast updated May 7, 2025\u000b\u000bRead the full report in PDF format.\u000bRead the full report on Medium: parts I, II, III, IV, and V.",
    "link": "https://www.brettheinz.com/brettheinz-com/documenting-the-damage",
    "timestamp": "2025-05-13T05:47:01Z"
  },
  {
    "title": "Trump’s power crumbling as he surrenders to China",
    "description": "Donald Trump has caved in to China on tariffs, dropping most of his punitive taxes to stave off empty shelves, a stockmarket crash and stagflation. Even he can't stay in denial forever.\nThe post Trump’s power crumbling as he surrenders to China appeared first…",
    "link": "http://www.crikey.com.au/2025/05/13/tariffs-donald-trump-surrenders-china/",
    "timestamp": "2025-05-13T05:46:46Z"
  },
  {
    "title": "US, China agree to slash tariffs as Trump says will speak to Xi",
    "description": "The United States and China announced Monday an agreement to drastically reduce tit-for-tat tariffs for 90 days, an outcome President Donald Trump dubbed a \"total reset\" as he said talks with counterpart Xi Jinping could soon follow.",
    "link": "https://www.hurriyetdailynews.com/us-china-agree-to-slash-tariffs-as-trump-says-will-speak-to-xi-209103",
    "timestamp": "2025-05-13T05:44:44Z"
  },
  {
    "title": "Trump heads to the Gulf eyeing deals amid diplomatic offensive",
    "description": "His decision to once again bypass traditional Western allies to travel to the oil-rich Gulf states underscores their increasingly crucial geopolitical role.",
    "link": "https://www.thejournal.ie/trump-heads-to-the-gulf-eyeing-deals-amid-diplomatic-offensive-6703247-May2025/",
    "timestamp": "2025-05-13T05:44:23Z"
  },
  {
    "title": "Israel strikes hospital in southern Gaza as Hamas frees US-Israeli hostage",
    "description": "The Israeli military said Tuesday it had struck a hospital in southern Gaza housing Hamas militants, ending a brief pause in fighting to facilitate the release of a U.S.-Israeli hostage.",
    "link": "https://www.hurriyetdailynews.com/israel-strikes-hospital-in-southern-gaza-as-hamas-frees-us-israeli-hostage-209102",
    "timestamp": "2025-05-13T05:41:38Z"
  },
  {
    "title": "Trump: His first really big victory – How he managed to bring China to the negotiating table",
    "description": "The declaration of the trade war with China seems, almost 40 days later, to lead to a path that the US President had planned from the beginning - because it seems that he will win no matter how things turn out\nThe post Trump: His first really big victory – Ho…",
    "link": "https://en.protothema.gr/2025/05/13/trump-his-first-really-big-victory-how-he-managed-to-bring-china-to-the-negotiating-table/",
    "timestamp": "2025-05-13T05:41:16Z"
  },
  {
    "title": "US cuts tariffs on small parcels from Chinese firms like Shein and Temu",
    "description": "Chinese online retailers had previously relied on the \"de minimis\" loophole to ship low-value items to the US.",
    "link": "https://www.bbc.com/news/articles/c308pg239n1o",
    "timestamp": "2025-05-13T05:35:09Z"
  },
  {
    "title": "Vietnam cranks up fight on imported counterfeits amid US tariff talks",
    "description": "HANOI - Vietnam is stepping up its fight against counterfeits and digital piracy after the United States accused the country of being a major hub for these illegal activities and threatened crippling tariffs, documents reviewed by Reuters show.",
    "link": "https://www.bangkokpost.com/business/general/3024530/vietnam-cranks-up-fight-on-imported-counterfeits-amid-us-tariff-talks",
    "timestamp": "2025-05-13T05:35:00Z"
  },
  {
    "title": "China removes ban on Boeing deliveries after US trade truce",
    "description": "Following a breakthrough in trade negotiations with the US, China has lifted its month-long ban on airlines accepting Boeing aircraft deliveries. This decision, communicated to domestic carriers and government agencies, allows airlines to schedule deliveries …",
    "link": "https://economictimes.indiatimes.com/news/international/business/china-removes-ban-on-boeing-deliveries-after-us-trade-truce/articleshow/121129101.cms",
    "timestamp": "2025-05-13T05:34:20Z"
  },
  {
    "title": "Apple released security updates to fix multiple flaws in iOS and macOS",
    "description": "Apple released security updates to address easily exploitable vulnerabilities impacting iOS and macOS devices. Apple released urgent iOS and macOS security updates to patch critical flaws that could allow attackers to execute malicious code just by opening a …",
    "link": "https://securityaffairs.com/177748/security/apple-released-security-updates-to-fix-multiple-flaws-in-ios-and-macos.html",
    "timestamp": "2025-05-13T05:32:41Z"
  }
]