[
  {
    "title": "FAA Warns Venezuelan Airspace Risky Amid Military Buildup; Some International Airlines Cancel Flights",
    "description": "Well, this could get interesting. On Friday, the Federal Aviation Administration (FAA) released an advisory stating pilots should exercise caution in and around Venezuelan airspace, citing an increase in military activity in the region as well as a \"worsening…",
    "link": "https://freerepublic.com/focus/f-news/4354135/posts",
    "timestamp": "2025-11-23T05:47:18Z"
  },
  {
    "title": "Nicolas Guillou, French ICC judge sanctioned by the US: 'you are effectively blacklisted by much of the world's banking system' • Le Monde",
    "description": "Stéphanie Maupas: Nicolas Guillou, a French judge at the International Criminal Court (ICC), was sanctioned by the United States under a decision made by Donald Trump on August 20. The US Treasury Department justified the action, stating that \"Guillou is bein…",
    "link": "https://www.lemonde.fr/en/international/article/2025/11/19/nicolas-guillou-french-icc-judge-sanctioned-by-the-us-you-are-effectively-blacklisted-by-much-of-the-world-s-banking-system_6747628_4.html",
    "timestamp": "2025-11-23T05:47:01Z"
  },
  {
    "title": "Mayhem in the Windy City: 8 Teens Shot Downtown in Sick Scene As Gov. Pritzker, Mayor Johnson Refuse Trump's Help",
    "description": "A man with a 30-year criminal record, reportedly at least 72 arrests, and around 15 convictions, lit a 26-year-old woman on fire on a train in Chicago Monday night. She is fighting for her life in critical condition.Mayor Brandon Johnson on Thursday called it…",
    "link": "https://freerepublic.com/focus/f-news/4354134/posts",
    "timestamp": "2025-11-23T05:44:12Z"
  },
  {
    "title": "Trump Says His Ukraine Peace Plan Is Not 'Final Offer': Report",
    "description": "President Donald Trump reportedly stated on Saturday that his administration’s peace proposal for the Ukraine-Russia conflict is not the final offer.\nEmphasis On Peace\nAccording to a report by NBC News, President Trump emphasized the need to end the conflict,…",
    "link": "https://biztoc.com/x/4c803f2518846c3d",
    "timestamp": "2025-11-23T05:43:31Z"
  },
  {
    "title": "If you like Donald Trump’s planned peace for Ukraine, you’ll love his peace for Israel.",
    "description": "By his recent agreements with Qatar and Turkey and his expanding financial relations with Saudi Arabia, Trump makes it clear that maintaining Israel’s “qualitative edge” will no longer be Washington’s top regional priority. Opinion.",
    "link": "https://www.israelnationalnews.com/news/418199",
    "timestamp": "2025-11-23T05:36:20Z"
  },
  {
    "title": "Tatiana Schlossberg Calls Out Cousin RFK Jr. While Announcing Her Cancer",
    "description": "Tatiana Schlossberg condemned her cousin Robert F. Kennedy Jr. for his vaccine skepticism while announcing her terminal cancer diagnosis. The environmental reporter, 35, shared the heartbreaking news in a New Yorker essay on Saturday, November 22, that she’d …",
    "link": "https://www.usmagazine.com/celebrity-news/news/tatiana-schlossberg-calls-out-cousin-rfk-jr-while-announcing-her-cancer/#article",
    "timestamp": "2025-11-23T05:33:35Z"
  },
  {
    "title": "Trump Played Mamdani Like a Fiddle",
    "description": "Oh, I know: The audience wanted to see President Donald Trump take a blowtorch to Mayor-Elect Zohran Mamdani, holding him accountable for his Marxist rhetoric, welcoming him to the D.C. Big Leagues with some Trumpian chin music. It’s not your fault. Earlier O…",
    "link": "https://freerepublic.com/focus/f-news/4354132/posts",
    "timestamp": "2025-11-23T05:31:57Z"
  },
  {
    "title": "Ireland scores Trump tariff win as US drug-maker moves rare medicine production from China to avoid trade levies",
    "description": "US drugmaker Amicus Therapeutics plans to move production of a rare medicine from China to Ireland to avoid any hit from tariffs threatened by US President Donald Trump.",
    "link": "https://www.independent.ie/business/irish/ireland-scores-trump-tariff-win-as-us-drug-maker-moves-rare-medicine-production-from-china-to-avoid-trade-levies/a979910898.html",
    "timestamp": "2025-11-23T05:30:00Z"
  },
  {
    "title": "Peter Vandermeersch: Donald Trump’s cynical shrug over Khashoggi killing must be challenged",
    "description": "I wasn’t planning to write about Donald Trump again. Honestly, haven’t we all had enough? The endless scandals, the contempt for truth, the hunger for attention. Why add another word to the noise?",
    "link": "https://www.independent.ie/opinion/peter-vandermeersch-donald-trumps-cynical-shrug-over-khashoggi-killing-must-be-challenged/a2057117258.html",
    "timestamp": "2025-11-23T05:30:00Z"
  },
  {
    "title": "US insists it authored Ukraine peace plan ahead of talks on ending war",
    "description": "A group of US lawmakers say the secretary of state told them the draft did not reflect Washington's position. Marco Rubio has distanced himself from those...",
    "link": "https://www.bbc.com/news/articles/c4g95x50kdyo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-11-23T05:24:20Z"
  },
  {
    "title": "Whistleblower: FBI top brass shielded from scrutiny of the bureau’s internal counterespionage unit",
    "description": "An FBI employee blew the whistle on the unit that investigates counterespionage inside the bureau, accusing it of “gross misconduct, fraud and potentially criminal activities.” Members of the FBI Senior Executive Service have conspired at various times to ens…",
    "link": "https://freerepublic.com/focus/f-news/4354131/posts",
    "timestamp": "2025-11-23T05:18:57Z"
  },
  {
    "title": "US signals broader efforts to protect Nigeria's Christians following Trump's military threat",
    "description": "President Donald Trump’s administration is promoting efforts to work with Nigeria’s government to counter violence against Christians",
    "link": "https://abcnews.go.com/US/wireStory/us-signals-broader-efforts-protect-nigerias-christians-trumps-127795166",
    "timestamp": "2025-11-23T05:18:00Z"
  },
  {
    "title": "Congress Clings to Cold War Framework for U.S. in Europe",
    "description": "The new National Defense Authorization Act handcuffs the president to an antiquated European defense posture.\nThe post Congress Clings to Cold War Framework for U.S. in Europe appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/congress-clings-to-cold-war-framework-for-u-s-in-europe/",
    "timestamp": "2025-11-23T05:05:00Z"
  },
  {
    "title": "China’s whisper war",
    "description": "While everyone is fixated on Beijing’s military posture, the true threat lies in the intangible: a campaign of cultural sarcasm aimed at destroying Taiwan’s identity.  The ruling Chinese government’s stance toward Taiwan h...",
    "link": "https://www.americanthinker.com/blog/2025/11/china_s_whisper_war.html",
    "timestamp": "2025-11-23T05:00:00Z"
  },
  {
    "title": "Mexico's Sheinbaum goes 'Hugo Chavez' on dissident TV station and its owner",
    "description": "Is Mexico's la presidenta Claudia Sheinbaum, going Hugo Chavez on us?\r\n\r\nWell, consider what she's doing to one of her country's leading television stations, TV Azteca, whose coverage has been critical and whose owner, Ricardo Salina...",
    "link": "https://www.americanthinker.com/blog/2025/11/mexico_s_sheinbaum_goes_hugo_chavez_on_dissident_tv_station_and_its_owner.html",
    "timestamp": "2025-11-23T05:00:00Z"
  },
  {
    "title": "'A Battle With My Blood' in more ways than one",
    "description": "Is there anything sadder than injecting politics into a personal story of a terminal battle with cancer?\r\n\r\nIt's a strange, discordant addition to an otherwise moving piece by Tatiana Schlossberg Moran, the daughter of Caroline Kennedy, writing i...",
    "link": "https://www.americanthinker.com/blog/2025/11/a_battle_with_my_blood_in_more_ways_than_one.html",
    "timestamp": "2025-11-23T05:00:00Z"
  },
  {
    "title": "Paramount Skydance is currently winning the war to acquire Warner Bros. Discovery",
    "description": "Paramount Skydance has the inside track to acquire Warner Bros. Discovery, according to well-placed media executives — and it’s all about a cable network that has a troubled relationship with Donald Trump.\nAs first reported by The Post, the battle for control…",
    "link": "https://biztoc.com/x/2013567f3923f8fe",
    "timestamp": "2025-11-23T04:59:18Z"
  },
  {
    "title": "COP30 sidesteps fossil fuels, boosts climate aid for poor nations",
    "description": "Denial and division have been highlighted in the COP30 deal that makes no mention of cutting fossil fuels but boosts climate aid for developing nations.",
    "link": "https://www.abc.net.au/news/2025-11-23/cop30-climate-deal-sidesteps-fossil-fuels/106042660",
    "timestamp": "2025-11-23T04:58:37Z"
  },
  {
    "title": "Trump Fumes in Late Night All-Caps Spree Sen. Elissa Slotkin and Other Dems ‘SHOULD BE IN JAIL RIGHT NOW’ — and ‘MANY GREAT LEGAL SCHOLARS AGREE’",
    "description": "President Trump once again skewered the six Democratic lawmakers who urged military members to “refuse illegal orders\" in multiple late night Truth Social posts\nThe post Trump Fumes in Late Night All-Caps Spree Sen. Elissa Slotkin and Other Dems ‘SHOULD BE IN…",
    "link": "https://www.mediaite.com/politics/trump-fumes-in-late-night-all-caps-spree-sen-elissa-slotkin-and-other-dems-should-be-in-jail-right-now-and-many-great-legal-scholars-agree/",
    "timestamp": "2025-11-23T04:54:54Z"
  },
  {
    "title": "GOP Might Need Trump-Centric Midterm Convention To Boost Turnout",
    "description": "While the Democrat wins were nothing special in this year's elections, they did manage to win them in convincing fashion. Republican candidates once again faltered, albeit in blue states, but struggled to gain any momentum toward pulling an upset. That is not…",
    "link": "https://freerepublic.com/focus/f-bloggers/4354129/posts",
    "timestamp": "2025-11-23T04:53:22Z"
  },
  {
    "title": "US insists it authored Ukraine peace plan ahead of talks on ending war",
    "description": "A group of US lawmakers say the secretary of state told them the draft did not reflect Washington's position. Marco Rubio has distanced himself from those claims.",
    "link": "https://www.bbc.com/news/articles/c4g95x50kdyo",
    "timestamp": "2025-11-23T04:50:56Z"
  },
  {
    "title": "Ukraine peace proposal was authored by US, based on inputs from Russia, says Secretary of State Rubio",
    "description": "Trump’s peace plan gives consent to many demands made by the Russian counterparts, including Ukraine giving up large pieces of territory to which Ukrainian President Volodymyr Zelenskyy has categorically rejected.",
    "link": "https://indianexpress.com/article/world/ukraine-peace-proposal-authored-by-us-inputs-from-russia-says-secretary-of-state-rubio-10381255/",
    "timestamp": "2025-11-23T04:50:05Z"
  },
  {
    "title": "Trump: I stopped 5 wars because of threat of tariffs",
    "description": "United States President Donald Trump declared he stopped \"5 of the 8 wars\" because of the \"threat of Tariffs if they don’t stop fighting or, better yet, if they start.\"In addition, the US president re...",
    "link": "https://biztoc.com/x/112df980bf0dc35d",
    "timestamp": "2025-11-23T04:48:20Z"
  },
  {
    "title": "TheLastRefuge on X: People don't get it. Republicans hate MAGA.",
    "description": "I see lots of energy spent that encapsulates to: ....\"republicans are going to lose the midterms\"....This is the problem.People don't get it.Republicans hate MAGA.Republicans want to get rid of MAGA.Republicans would like Democrats to destroy Trump and MAGA.A…",
    "link": "https://freerepublic.com/focus/f-news/4354127/posts",
    "timestamp": "2025-11-23T04:38:39Z"
  },
  {
    "title": "Delhi school admissions 2026-27: Schedule for Nursery, KG and Class 1 in private schools out; important dates here",
    "description": "Delhi’s Directorate of Education has released the full schedule for Nursery, KG and Class 1 admissions in private unaided schools for 2026–27. Applications open on 4 December, with the first list on 23 January and final closure on 19 March. The circular detai…",
    "link": "https://timesofindia.indiatimes.com/education/news/delhi-school-admissions-2026-27-schedule-for-nursery-kg-and-class-1-in-private-schools-out-important-dates-here/articleshow/125515400.cms",
    "timestamp": "2025-11-23T04:28:00Z"
  },
  {
    "title": "US denies pushing Russian ‘wish list’ as Ukraine plan",
    "description": "Washington insisted Saturday that its Ukraine proposal is indeed official US policy, denying claims by a group of senators that Secretary of State Marco Rubio told them the document under discussion is just a Russian “wish list.” The dispute over the 28-point…",
    "link": "https://www.digitaljournal.com/world/us-denies-pushing-russian-wish-list-as-ukraine-plan/article",
    "timestamp": "2025-11-23T04:27:20Z"
  },
  {
    "title": "Trump signals room for negotiation on Ukraine plan",
    "description": "US President Donald Trump signalled room for negotiation on a US plan to end the Ukraine war that has drawn pushback from Ukraine, its allies and US politicians ahead of talks on the proposal in Switzerland.",
    "link": "https://www.rte.ie/news/world/2025/1123/1545379-ukraine-russia-us/",
    "timestamp": "2025-11-23T04:24:45Z"
  },
  {
    "title": "Trump signals room for negotiation on Ukraine plan",
    "description": "The US has signalled room for negotiation on its plan to end the Ukraine war that has drawn pushback from Ukraine, its allies and US politicians ahead of talks on the proposal in Switzerland.",
    "link": "https://www.rte.ie/news/ukraine/2025/1123/1545379-ukraine-russia-us/",
    "timestamp": "2025-11-23T04:24:45Z"
  },
  {
    "title": "CLAT admit card 2026 released at consortiumofnlus.ac.in: Direct link to download here",
    "description": "The Consortium of National Law Universities (NLUs) has released the CLAT 2026 admit card for the Common Law Admission Test scheduled on December 7, 2025. Candidates must download the hall ticket from the official website and carry it along with a valid photo …",
    "link": "https://timesofindia.indiatimes.com/education/news/clat-admit-card-2026-released-at-consortiumofnlus-ac-in-direct-link-to-download-here/articleshow/125515441.cms",
    "timestamp": "2025-11-23T04:21:24Z"
  },
  {
    "title": "War for Ukraine Day 1,367: Holodomor Remembrance Day",
    "description": "(Image by NEIVANMADE) The cost On November 19 russian missile strike on a residential building in Ternopil killed Marichka Palahniuk, pharmacist, her 1.5‑year‑old son, Nazar, and her 5‑year‑old daughter, Kamila. [image or embed] — Kate from Kharkiv (@kateinkh…",
    "link": "https://balloon-juice.com/2025/11/22/war-for-ukraine-day-1367-holodomor-remembrance-day/",
    "timestamp": "2025-11-23T04:03:01Z"
  },
  {
    "title": "Trump officials' meeting with sanctioned Russian in Miami spurs questions about Ukraine proposal",
    "description": "U.S. officials and lawmakers are increasingly concerned about a meeting last month in which representatives of the Trump administration met with Kirill Dmitriev, a Russian envoy who is under U.S. sanctions, to draft a plan to end the war in Ukraine, according…",
    "link": "https://japantoday.com/category/world/trump-officials%27-meeting-with-russian-in-miami-spurs-questions-about-ukraine-proposal",
    "timestamp": "2025-11-23T03:50:45Z"
  },
  {
    "title": "Trump signals room for negotiation on Ukraine plan ahead of talks",
    "description": "UKraine peace plan: Trump has given Ukraine until November 27 to approve the plan to end the nearly four-year conflict, but Kyiv is seeking changes to a draft that accepts some of Russia's hardline demands.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-signals-room-for-negotiation-on-ukraine-plan-ahead-of-talks/articleshow/125515198.cms",
    "timestamp": "2025-11-23T03:45:06Z"
  },
  {
    "title": "Trump Was Told By Europeans That His Ukraine Plan Needs Work",
    "description": "European leaders and other allies told the US that its peace plan for Ukraine needed “additional work,” in a rushed bid to try and slow walk a Trump administration determined to give concessions to Russia and impose terms by Thanksgiving.",
    "link": "https://www.ndtvprofit.com/world/trump-was-told-by-europeans-that-his-ukraine-plan-needs-work",
    "timestamp": "2025-11-23T03:42:29Z"
  },
  {
    "title": "US Preparing to Launch New Phase of Operations Against Venezuela in Coming Days - Reports",
    "description": "The United States is preparing to launch a new phase of operations against Venezuela in the coming days, including the possible overthrow of President Nicolas Maduro, Reuters reported, citing US officials.",
    "link": "https://sputnikglobe.com/20251123/us-preparing-to-launch-new-phase-of-operations-against-venezuela-in-coming-days---reports-1123157350.html",
    "timestamp": "2025-11-23T03:41:00Z"
  },
  {
    "title": "'Brazil Just Succeeded Where America Failed' as Coup-Plotting Ex-Pres Bolsonaro Arrested",
    "description": "Former Brazilian President Jair Bolsonaro, a right-wing ally of US President Donald Trump, was arrested in Brazil early Saturday morning following concerns he might flee the country.Bolsonaro was under house arrest awaiting the result of his appeal after he w…",
    "link": "https://www.commondreams.org/news/jair-bolsonaro-arrest",
    "timestamp": "2025-11-23T03:36:18Z"
  },
  {
    "title": "COP30 Climate Summit Reaches Deal That Leaves Many Nations Unhappy",
    "description": "Almost 200 nations gathered in Brazil for the United Nations’ annual climate summit capped two weeks of fraught negotiations with an agreement Saturday on new efforts to help guide their transition away from the fossil fuels driving global warming.",
    "link": "https://www.ndtvprofit.com/world/cop30-climate-summit-reaches-deal-that-leaves-many-nations-unhappy",
    "timestamp": "2025-11-23T03:34:41Z"
  },
  {
    "title": "What is behind Nigeria's latest school kidnappings, church attack?",
    "description": "More than 300 students have been kidnapped in Nigeria's worst school abduction in 10 years, days after a deadly assault on a church service.",
    "link": "https://www.abc.net.au/news/2025-11-23/explainer-nigeria-latest-school-kidnappings-church/106042464",
    "timestamp": "2025-11-23T03:22:56Z"
  },
  {
    "title": "Tatiana Schlossberg Family Guide: Meet Her Husband, Their 2 Kids and More",
    "description": "Environmental journalist Tatiana Schlossberg revealed her terminal cancer diagnosis in November 2025. Tatiana — who is the granddaughter of late president John F. Kennedy and former first lady Jacqueline Kennedy Onassis — confirmed in an essay published by Th…",
    "link": "https://www.usmagazine.com/celebrity-news/news/tatiana-schlossberg-family-guide-meet-her-husband-their-2-kids-and-more/#article",
    "timestamp": "2025-11-23T03:22:24Z"
  },
  {
    "title": "Airlines cancel Venezuela flights amid US warnings and military buildup",
    "description": "Flight suspensions come after US regulator warned planes of security risk in the airspace in and around Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/11/23/airlines-cancel-flights-to-venezuela-amid-us-military-buildup",
    "timestamp": "2025-11-23T03:20:23Z"
  },
  {
    "title": "Trump says Nicklaus will lead golf course revamp at Joint Base Andrews (Andrea Shalal/Reuters)",
    "description": "Andrea Shalal / Reuters:\nTrump says Nicklaus will lead golf course revamp at Joint Base Andrews  — Trump says golf courses at base in bad shape  — Changes envisioned will cost ‘very little,’ Trump says  — Base has suffered lack of maintenance, Trump says  —  …",
    "link": "https://www.memeorandum.com/251122/p83",
    "timestamp": "2025-11-23T03:20:01Z"
  },
  {
    "title": "The president has adopted a chic new winter item—but not everyone is keen on it.",
    "description": "With winter coming in fast, President Donald Trump has got himself a plush new burgundy scarf to keep the cold at bay—which unfortunately has received a...",
    "link": "https://www.thedailybeast.com/trumps-new-accessory-gets-chilly-reception/",
    "timestamp": "2025-11-23T03:19:22Z"
  },
  {
    "title": "US, Ukraine and European officials hold talks in Geneva on Trump's plan to end war",
    "description": "GENEVA (Reuters) -Top officials from the United States, Ukraine, and national security advisers from France, Britain and Germany hold talks in Geneva on Sunday to discuss Washington's draft plan to end the war in Ukraine. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/23/us-ukraine-and-european-officials-hold-talks-in-geneva-on-trump039s-plan-to-end-war",
    "timestamp": "2025-11-23T03:07:00Z"
  },
  {
    "title": "Paramount Skydance is currently winning the war to acquire Warner Bros. Discovery",
    "description": "Paramount Skydance has the inside track to acquire Warner Bros. Discovery, according to well-placed media executives — and it’s all about a cable network that has a troubled relationship with Donald Trump.",
    "link": "https://nypost.com/2025/11/22/business/paramount-skydance-is-currently-winning-the-war-to-acquire-warner-bros-discovery/",
    "timestamp": "2025-11-23T03:02:45Z"
  },
  {
    "title": "Don't fall for this video of Trump and Epstein watching young girls at party",
    "description": "The AI-generated video recirculated after the November 2025 release of thousands of documents related to Jeffrey Epstein.",
    "link": "https://www.snopes.com//fact-check/trump-epstein-young-girls-video/",
    "timestamp": "2025-11-23T03:00:00Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,368",
    "description": "Here are the key events from day 1,368 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/11/23/russia-ukraine-war-list-of-key-events-day-1368",
    "timestamp": "2025-11-23T02:53:55Z"
  },
  {
    "title": "$2,000 stimulus check before Christmas? Latest update on Trump’s proposal: Who could get it and when",
    "description": "Stimulus checks IRS: Americans are searching for stimulus checks as Christmas nears. President Donald Trump proposed a $2,000 payment for middle-income earners. However, Congress has not approved new federal stimulus payments. The IRS confirms no scheduled pa…",
    "link": "https://economictimes.indiatimes.com/news/international/us/stimulus-checks-irs-what-to-know-ahead-of-the-2025-christmas-season/articleshow/125514787.cms",
    "timestamp": "2025-11-23T02:45:19Z"
  },
  {
    "title": "Trump Teams Up With Legendary Jack Nicklaus, Sets Eyes On Restoring Andrews Air Force Base’s Golf Course",
    "description": "President Trump announced Saturday he will be teaming up with World Golf Hall of Famer Jack Nicklaus to refurbish the golf courses at Andrews Air Force Base.",
    "link": "https://dailycaller.com/2025/11/22/donald-trump-jack-nicklaus-joint-base-andrews-maryland-golf-course-construction-project/",
    "timestamp": "2025-11-23T02:40:15Z"
  },
  {
    "title": "US denies pushing Russian 'wish list' as Ukraine plan",
    "description": "WASHINGTON: Washington insisted Saturday (Nov 22) that its Ukraine proposal is indeed official US policy, denying claims by a group of senators that Secretary of State Marco Rubio told them the document under discussion is just a Russian \"wish list\".Despite w…",
    "link": "https://www.channelnewsasia.com/world/russia-ukraine-peace-plan-wish-list-rubio-us-denies-5485116",
    "timestamp": "2025-11-23T02:39:00Z"
  },
  {
    "title": "Trump says Zelensky can agree to peace plan or 'fight his little heart out' (Tobi Raji/Washington Post)",
    "description": "Tobi Raji / Washington Post:\nTrump says Zelensky can agree to peace plan or ‘fight his little heart out’  —  President Trump on Saturday heaped pressure on Volodymyr Zelensky, as he pushed Ukraine's leaders to agree to a 28-point plan to help bring an end to …",
    "link": "https://www.memeorandum.com/251122/p82",
    "timestamp": "2025-11-23T02:35:00Z"
  },
  {
    "title": "MS NOW’s Catherine Rampell Vents Trump Admin Aims to ‘Bring Back’ Hate Speech After Uproar Over Coast Guard’s Designation for Swastikas",
    "description": "MS NOW's Catherine Rampell said there is a \"broader effort\" from President Donald Trump's administration to \"bring back or de-stigmatize, I guess, hate speech\"\nThe post MS NOW’s Catherine Rampell Vents Trump Admin Aims to ‘Bring Back’ Hate Speech After Uproar…",
    "link": "https://www.mediaite.com/media/news/ms-nows-catherine-rampell-vents-trump-admin-aims-to-bring-back-hate-speech-after-uproar-over-coast-guards-designation-for-swastikas/",
    "timestamp": "2025-11-23T02:28:39Z"
  },
  {
    "title": "Ukraine: Europeans push back on US plan during Geneva talks",
    "description": "Volodymyr Zelenskyy is seeking \"alternatives\" to Washington's peace plan as US and European officials meet in Geneva. Meanwhile, Donald Trump says Ukraine has shown \"zero gratitude\". DW has the latest.",
    "link": "https://www.dw.com/en/ukraine-europeans-push-back-on-us-plan-during-geneva-talks/live-74850575",
    "timestamp": "2025-11-23T02:24:00Z"
  },
  {
    "title": "Ukraine: Europeans push back on US plan during Geneva talks",
    "description": "Volodymyr Zelenskyy is seeking \"alternatives\" to Washington's peace plan as US and European officials meet in Geneva. Meanwhile, Donald Trump says Ukraine has shown \"zero gratitude\". DW has the latest.",
    "link": "https://www.dw.com/en/ukraine-europeans-push-back-on-us-plan-during-geneva-talks/live-74850575",
    "timestamp": "2025-11-23T02:24:00Z"
  },
  {
    "title": "Kellogg Fired Over Leaking 28-Point Plan – Proposal Designed To Trap Putin",
    "description": "Kellogg Fired Over Leaking 28-Point Plan – Proposal Designed To Trap Putin It seems that Keith Kellogg, Trump’s special envoy to Ukraine, got fired over leaking news of the 28-point ‘peace plan’. Let’s follow the traces. On Tuesday the 18th November someone ‘…",
    "link": "https://freerepublic.com/focus/f-news/4354109/posts",
    "timestamp": "2025-11-23T02:19:13Z"
  },
  {
    "title": "G20 leaders push back on US peace plan for Ukraine",
    "description": "Global leaders met in Johannesburg to discuss a new peace proposal for the Ukraine war. While acknowledging the plan's potential for negotiations, they rejected demands for Ukrainian territorial concessions and army limits. European nations reaffirmed their u…",
    "link": "https://economictimes.indiatimes.com/news/defence/g20-leaders-push-back-on-us-peace-plan-for-ukraine/articleshow/125514698.cms",
    "timestamp": "2025-11-23T02:14:34Z"
  },
  {
    "title": "Ukraine's allies push back on a US peace plan seen as favouring Moscow",
    "description": "The 28-point blueprint drawn up by the U.S. to end the nearly four-year war sparked alarm in Kyiv and European capitals, with Zelenskyy saying his country could face a stark choice between standing up for its sovereign rights and preserving the American suppo…",
    "link": "https://economictimes.indiatimes.com/news/defence/ukraines-allies-push-back-on-a-us-peace-plan-seen-as-favoring-moscow/articleshow/125514692.cms",
    "timestamp": "2025-11-23T02:13:06Z"
  },
  {
    "title": "U.S. to launch new phase of Venezuela operations, sources say",
    "description": "The United States is poised to launch a new phase of Venezuela-related operations in the coming days, four U.S. officials told Reuters, as the Trump administration escalates pressure on President Nicolas Maduro's government. Reuters was not able to establish …",
    "link": "https://japantoday.com/category/world/exclusive-us-to-launch-new-phase-of-venezuela-operations-sources-say3",
    "timestamp": "2025-11-23T02:12:22Z"
  },
  {
    "title": "Tres razones por las que Trump encendió la alarma en su reunión con el príncipe-dictador saudita",
    "description": "The New York Times critica la encendida defensa de Donald Trump en su reunión con Mohammed ben Salman",
    "link": "https://www.lanacion.com.ar/estados-unidos/tres-razones-por-las-que-trump-encendio-la-alarma-en-su-reunion-con-el-principe-dictador-saudita-nid22112025/",
    "timestamp": "2025-11-23T02:05:39Z"
  },
  {
    "title": "Epstein Files may not become public yet, despite Trump signing their release into law. Here’s how",
    "description": "Technically, Attorney General Pam Bondi may opt to delay the release of the files based on the last of the aforementioned conditions: anything that 'would jeopardize an active federal investigation or ongoing prosecution, provided that such withholding is nar…",
    "link": "https://indianexpress.com/article/explained/explained-global/epstein-files-potential-release-timeline-10380559/",
    "timestamp": "2025-11-23T01:59:38Z"
  },
  {
    "title": "Israel launches strikes in Gaza ceasefire's latest test as hospitals say 24 killed",
    "description": "Israel conducted airstrikes in Gaza after its troops were fired upon. This action tests a fragile ceasefire. Palestinian health officials reported numerous casualties, including children. Israel stated its strikes targeted Hamas militants in response to an ar…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-launches-strikes-in-gaza-ceasefires-latest-test-as-hospitals-say-24-killed/articleshow/125514576.cms",
    "timestamp": "2025-11-23T01:49:21Z"
  },
  {
    "title": "US senators say they spoke with Rubio about Trump's Ukraine peace plan who denied it is a US plan (Rob Gillies/Associated Press)",
    "description": "Rob Gillies / Associated Press:\nUS senators say they spoke with Rubio about Trump's Ukraine peace plan who denied it is a US plan  —  U.S. senators critical of President Donald Trump's approach to ending the Russia-Ukraine war said Saturday they spoke with U.…",
    "link": "https://www.memeorandum.com/251122/p77",
    "timestamp": "2025-11-23T01:45:01Z"
  },
  {
    "title": "US and Ukrainian officials to meet again on US peace plan",
    "description": "United States officials are heading to Switzerland for talks with Ukraine regarding President Trump's peace proposal. This plan, negotiated with Russia, requires Ukraine to make concessions. Ukrainian leaders and European allies have voiced concerns. Separate…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-and-ukrainian-officials-to-meet-again-on-us-peace-plan/articleshow/125514539.cms",
    "timestamp": "2025-11-23T01:42:25Z"
  },
  {
    "title": "Brazil's ex-president Jair Bolsonaro arrested over alleged plot to escape",
    "description": "Jair Bolsonaro has been taken into police custody after the country's Supreme Court found he was trying to escape house arrest.",
    "link": "https://www.abc.net.au/news/2025-11-23/brazils-ex-president-bolsonaro-arrested-over-alleged-escape-plot/106042220",
    "timestamp": "2025-11-23T01:42:18Z"
  },
  {
    "title": "G20 summit adopts declaration despite US boycott",
    "description": "Group of 20 leaders adopted a declaration addressing the climate crisis and other global challenges over US objections, prompting the White House to accuse South Africa of weaponising its leadership of the group this year.",
    "link": "https://www.rte.ie/news/world/2025/1123/1545376-g20-summit-south-africa/",
    "timestamp": "2025-11-23T01:38:31Z"
  },
  {
    "title": "DOJ seeks release of Epstein grand jury material in Florida",
    "description": "The move marks what appears to be the first public action since the measure to release the Epstein files was signed into law by President Donald Trump.",
    "link": "https://abcnews.go.com/Politics/doj-seeks-release-epstein-grand-jury-material-florida/story?id=127791342",
    "timestamp": "2025-11-23T01:36:31Z"
  },
  {
    "title": "Trump administration wants Ukraine to accept a deal Putin welcomes",
    "description": "Ukrainian President Volodymyr Zelenskyy is under pressure to agree to a peace deal, while US President Donald Trump faces domestic blowback over his foreign policy decisions.",
    "link": "https://www.abc.net.au/news/2025-11-23/ukraine-russia-zelenskyy-putin-trump-nato-eu/106042192",
    "timestamp": "2025-11-23T01:35:24Z"
  },
  {
    "title": "Trump, Mamdani Say Meeting Focused on Cost of Living",
    "description": "President Donald Trump said he wants to see Zohran Mamdani succeed and would \"feel very comfortable\" living in a New York run by the mayor-elect.\nTrump said he doesn't anticipate cutting off funding for New York City and expects to be \"helping\" Mamdani, not \"…",
    "link": "https://biztoc.com/x/51612ea7bb860b3f",
    "timestamp": "2025-11-23T01:28:08Z"
  },
  {
    "title": "Israel launches strikes in Gaza ceasefire's latest test",
    "description": "It is not the first time that Israel has carried out similar waves of strikes after reported attacks on its forces during the ceasefire.",
    "link": "https://www.abc.net.au/news/2025-11-23/israel-launches-strikes-in-gaza-ceasefire-s-latest-test/106042236",
    "timestamp": "2025-11-23T01:27:36Z"
  },
  {
    "title": "'Zohran is a WINNER!': Mamdani PRAISED in Trump Oval Office meeting",
    "description": "After weeks of back-and-forth insults, Donald Trump finally met with New York City Mayor-Elect Zohran Mamdani. But, despite ...",
    "link": "https://biztoc.com/x/5aad4a91a045e29b",
    "timestamp": "2025-11-23T01:25:59Z"
  },
  {
    "title": "Trump administration cannot expand rapid deportations, US appeals court rules",
    "description": "A federal appeals court has refused to permit the expansion of a fast-track deportation process across the United States. This process allows for the rapid removal of migrants apprehended anywhere in the country. The court cited concerns about due process rig…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-administration-cannot-expand-rapid-deportations-us-appeals-court-rules/articleshow/125514415.cms",
    "timestamp": "2025-11-23T01:21:51Z"
  },
  {
    "title": "US to launch new phase of Venezuela operations, sources say",
    "description": "Summary U.S. hopes to ramp up pressure on Maduro government Covert operations expected to be first step, sources say U.S. options include overthrowing Maduro Human rights groups condemn U.S. strikes as illegal extrajudicial killings WASHINGTON, Nov 22 (Reuter…",
    "link": "https://freerepublic.com/focus/f-news/4354098/posts",
    "timestamp": "2025-11-23T01:18:10Z"
  },
  {
    "title": "US senators say they spoke with Rubio about Trump's Ukraine peace plan who denied it is a US plan",
    "description": "American senators at a security forum in Canada expressed strong criticism of President Trump's proposed peace plan for Ukraine. They learned from Secretary of State Marco Rubio that the 28-point plan is actually a Russian \"wish list\" and not the official U.S…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-senators-say-they-spoke-with-rubio-about-trumps-ukraine-peace-plan-who-denied-it-is-a-us-plan/articleshow/125514369.cms",
    "timestamp": "2025-11-23T01:12:17Z"
  },
  {
    "title": "Tyreek Hill breaks silence on NFL kickoff rule debate with 5-word bombshell",
    "description": "Miami Dolphins star Tyreek Hill needed only five words to ignite the NFL&apos;s most heated rule debate of the season. \nAs the league&apos;s revamped kickoff format became the unli",
    "link": "https://www.marca.com/en/nfl/miami-dolphins/2025/11/23/69225210ca474127478b45e0.html",
    "timestamp": "2025-11-23T01:11:40Z"
  },
  {
    "title": "Trump now says he wants Marjorie Taylor Greene to RETURN to politics as their love-hate relationship takes new twist",
    "description": "President Donald Trump revealed he would 'love' to see Rep. Marjorie Taylor Greene make a political comeback just hours after labeling her a 'traitor.' During a brief NBC News interview on Saturday, the president was asked about the Republican lawmaker's futu…",
    "link": "https://freerepublic.com/focus/f-news/4354097/posts",
    "timestamp": "2025-11-23T01:11:33Z"
  },
  {
    "title": "'A great HYPOCRISY!': Rep. Jayapal SLAMS Trump accusing Dems of 'seditious behavior'",
    "description": "Donald Trump has sparked outrage for accusing Democrats of engaging in 'seditious behavior' over urging military members to ...",
    "link": "https://biztoc.com/x/83896680a1b98371",
    "timestamp": "2025-11-23T01:11:13Z"
  },
  {
    "title": "Brazil's Bolsonaro detained over flight risk, damaged ankle monitor",
    "description": "Former Brazilian President Jair Bolsonaro is now in custody. He tampered with his ankle monitor, raising concerns about his flight risk. This action led to his detention. Bolsonaro faces a lengthy prison sentence for plotting a coup. His lawyers are appealing…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/brazils-bolsonaro-detained-over-flight-risk-damaged-ankle-monitor/articleshow/125514286.cms",
    "timestamp": "2025-11-23T00:56:35Z"
  },
  {
    "title": "FBI Concludes Trump Would-Be Assassin Acted Alone",
    "description": "The FBI determined Thomas Matthew Crooks acted alone when he shot President Donald Trump at a Butler, Pennsylvania, campaign rally in July 2024.",
    "link": "https://dailycaller.com/2025/11/22/fbi-trump-shooter-thomas-matthew-crooks-patel/",
    "timestamp": "2025-11-23T00:56:16Z"
  },
  {
    "title": "Soul of Nashville: Family-owned restaurants fight to survive under new property tax hike",
    "description": "Nashville’s family-owned businesses are sounding the alarm over rising property taxes, warning Mayor Freddie O’Connell that the city risks losing the very businesses that give Nashville its character. What Makes Nashville...Nashville? Local business owners sa…",
    "link": "https://freerepublic.com/focus/f-chat/4354094/posts",
    "timestamp": "2025-11-23T00:51:53Z"
  },
  {
    "title": "‘America Has Your Back!’ Fox’s Jason Chaffetz Urges ICE to Ignore ‘Yahoos’ And Keep Doing ‘Right Thing’",
    "description": "Fox's Jason Chaffetz urged ICE agents to ignore the \"yahoos\" who protest them and to keep doing the \"right thing\" by cracking down on illegal immigrants.\nThe post ‘America Has Your Back!’ Fox’s Jason Chaffetz Urges ICE to Ignore ‘Yahoos’ And Keep Doing ‘Right…",
    "link": "https://www.mediaite.com/politics/america-has-your-back-foxs-jason-chaffetz-urges-ice-to-ignore-yahoos-and-keep-doing-right-thing/",
    "timestamp": "2025-11-23T00:47:29Z"
  },
  {
    "title": "US to launch new phase of Venezuela operations, sources say",
    "description": "America is preparing for new actions against Venezuela. These operations aim to increase pressure on President Nicolas Maduro's government. Covert actions are expected to be the initial phase. The US is also planning to designate the Cartel de los Soles as a …",
    "link": "https://economictimes.indiatimes.com/news/defence/us-to-launch-new-phase-of-venezuela-operations-sources-say/articleshow/125514227.cms",
    "timestamp": "2025-11-23T00:47:21Z"
  },
  {
    "title": "Jack Schlossberg Shows Support for Sister Tatiana, 35, Following Devastating Diagnosis",
    "description": "Jack Schlossberg Shows Support for Sister Tatiana, 35, Following Devastating Diagnosisthedailybeast.com",
    "link": "https://www.thedailybeast.com/jack-schlossberg-shows-support-for-sister-tatiana-35-following-devastating-diagnosis/",
    "timestamp": "2025-11-23T00:44:03Z"
  },
  {
    "title": "How Zohran Mamdani won over Donald Trump — for now - vox.com",
    "description": "How Zohran Mamdani won over Donald Trump — for nowvox.com What Trump’s Mamdani praise — and MTG’s ouster — says about MAGA’s futurePolitico Whaa? Five theories to explain the Donald-Zohran meet-cute | Dave SchillingThe Guardian The Surprise Ending to the Trum…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180181173",
    "timestamp": "2025-11-23T00:32:33Z"
  },
  {
    "title": "Exclusive-US to launch new phase of Venezuela operations, sources say",
    "description": "By Phil Stewart and Idrees Ali WASHINGTON (Reuters) -The United States is poised to launch a new phase of Venezuela-related operations in the coming days...",
    "link": "https://www.yahoo.com/news/articles/exclusive-us-launch-phase-venezuela-003111871.html",
    "timestamp": "2025-11-23T00:31:11Z"
  },
  {
    "title": "REP. RALPH NORMAN: Double Standards Don’t Serve The Republic",
    "description": "In recent weeks, the American people have witnessed the grotesque misconduct of the United States House of Representatives come to light. Documents released as part of the House Oversight Committee’s ongoing investigation show that Delegate Stacey Plaskett of…",
    "link": "https://dailycaller.com/2025/11/22/opinion-double-standards-dont-serve-the-republic-rep-ralph-norman/",
    "timestamp": "2025-11-23T00:24:42Z"
  },
  {
    "title": "Fox News Host Kayleigh McEnany Invites John Fetterman To Family Dinner",
    "description": "Fox News star Kayleigh McEnany invited a Democratic lawmaker to family dinner, saying her dad is a fan and probably watching Fox News right now.\nThe post Fox News Host Kayleigh McEnany Invites John Fetterman To Family Dinner first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/fox-news-host-kayleigh-mcenany-invites-john-fetterman-to-family-dinner/",
    "timestamp": "2025-11-23T00:22:11Z"
  },
  {
    "title": "Trump says he would 'love to see' Marjorie Taylor Greene return to politics",
    "description": "President Donald Trump says he would \"love to see\" one-time ally Marjorie Taylor Greene return to politics one day - as the fiery congresswoman reportedly considers a White House run in 2028.",
    "link": "https://news.sky.com/story/donald-trump-says-he-would-love-to-see-marjorie-taylor-greene-return-to-politics-13474321",
    "timestamp": "2025-11-23T00:21:00Z"
  },
  {
    "title": "Ukraine and Europe scramble to respond to US plan to end war",
    "description": "Ukraine and its European allies are scrambling to come up with counter-proposals after US President Donald Trump gave Kyiv a tight deadline to approve a deal to end the war that accepts some of Russia's hardline demands.",
    "link": "https://www.abc.net.au/news/2025-11-23/ukraine-europe-scramble-to-respond-to-us-plan-to-end-war/106042072",
    "timestamp": "2025-11-23T00:20:36Z"
  },
  {
    "title": "Likely Putin-Trump summit is on the agenda: Diplomat",
    "description": "Europe News: MOSCOW: The possibility of another meeting between Vladimir Putin and Donald Trump is on the agenda, a senior Russian diplomat has said. \\\"I wouldn't r.",
    "link": "https://timesofindia.indiatimes.com/world/europe/likely-putin-trump-summit-is-on-the-agenda-diplomat/articleshow/125514073.cms",
    "timestamp": "2025-11-23T00:17:00Z"
  },
  {
    "title": "'Albo's Greatest Hits' as PM's western vacation yields little for WA",
    "description": "When the prime minister and his entourage rolled into town on Monday, WA Premier Roger Cook couldn't be blamed for hoping for an early Christmas present, writes state political reporter Keane Bourke.",
    "link": "https://www.abc.net.au/news/2025-11-23/anthony-albanese-wa-visit-saw-no-christmas-presents/106033346",
    "timestamp": "2025-11-23T00:16:03Z"
  },
  {
    "title": "COP30 - Five key takeaways from a deeply divisive climate summit",
    "description": "What did we learn from a climate summit that ended in a deal with no new mention of fossil fuels?",
    "link": "https://www.bbc.com/news/articles/cp84m16mdm1o",
    "timestamp": "2025-11-23T00:10:18Z"
  },
  {
    "title": "‘Cultural break.’ U.S. senators say relations with Canadian neighbours are suffering",
    "description": "HALIFAX — The tariffs imposed on Canada by U.S. President Donald Trump have clearly caused economic pain for Canada, but a U.S. senator from Maine says he’s more worried about how Canadians are reacting on a personal level. “Like any neighbours, there’s alway…",
    "link": "https://financialpost.com/pmn/cultural-break-u-s-senators-say-relations-with-canadian-neighbours-are-suffering",
    "timestamp": "2025-11-23T00:09:57Z"
  },
  {
    "title": "'We worry more about food' say Venezuelans living under threat of US military action",
    "description": "While the US escalates a military threat in nearby waters, Venezuelans say the real enemy of the people is a sharp rise in food prices.",
    "link": "https://www.bbc.com/news/articles/c3e0jnww2e9o",
    "timestamp": "2025-11-23T00:02:59Z"
  },
  {
    "title": "President says Chicagoans are 'chanting, bring in Trump' after violent downtown riot leaves 8 shot, 1 dead",
    "description": "Trump claims Chicagoans want federal help after a violent riot in blue city's downtown left multiple officers injured and several children shot during weekend unrest.",
    "link": "https://www.foxnews.com/politics/president-chicagoans-chanting-bring-trump-after-violent-downtown-riot-8-shot-1-dead",
    "timestamp": "2025-11-23T00:00:11Z"
  },
  {
    "title": "Epstein's brother sent email asking 'if Putin has the photos of Trump blowing Bubba'",
    "description": "Mark Epstein, brother of convicted child sex offender Jeffrey Epstein, once sent his brother an email that suggested he ask former White House Chief Strategist Steve Bannon “if Putin has the photos of Trump blowing Bubba.”",
    "link": "https://www.snopes.com//fact-check/trump-bubba-epstein-email/",
    "timestamp": "2025-11-23T00:00:00Z"
  },
  {
    "title": "Top MAGA Influencers Accidentally Unmasked as Foreign Actors",
    "description": "Elon Musk’s social media site X has rolled out a new feature in an effort to increase transparency—and unwittingly revealed that many of the site’s top MAGA influencers are actually foreign actors. The new “About This Account” feature, which became available …",
    "link": "https://www.thedailybeast.com/top-maga-influencers-accidentally-unmasked-as-foreign-actors/",
    "timestamp": "2025-11-23T00:00:00Z"
  },
  {
    "title": "Trump: People in Chicago chanting 'Bring in Trump'",
    "description": "United States President Donald Trump again criticized Illinois Governor JB Pritzker and Chicago Mayor Brandon Johnson for refusing federal government aid in fighting crime, stating the \"people are cha...",
    "link": "https://biztoc.com/x/7536b3ec2dab349f",
    "timestamp": "2025-11-22T23:59:38Z"
  },
  {
    "title": "Ukraine, US head for talks on Trump's plan to end war",
    "description": "GENEVA: Ukrainian and US envoys will meet in Switzerland on Sunday along with European security chiefs to discuss Washington's plan for ending the war with Russia, officials said, after Kyiv pushed back on proposals seen as favourable to Moscow. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/11/23/ukraine-us-head-for-talks-on-trump039s-plan-to-end-war",
    "timestamp": "2025-11-22T23:58:00Z"
  },
  {
    "title": "UN climate talks fail to secure new fossil fuel promises",
    "description": "EPAFollowing bitter rows, the UN climate summit COP30 in Belém, Brazil has ended with a deal that contains no direct reference to the fossil fuels that are heating up the planet.It is a frustrating end for more than 80 countries including the UK and EU that w…",
    "link": "https://freerepublic.com/focus/f-news/4354085/posts",
    "timestamp": "2025-11-22T23:57:08Z"
  }
]