[
  {
    "title": "New IOC President Says Meeting Olympians On Climate ‘A Priority’",
    "description": "400 Olympians urged the incoming IOC President to lead on climate action. Newly elected Kirsty Coventry confirmed that meeting with them would be a \"priority.\"",
    "link": "https://www.forbes.com/sites/clairepoolesp/2025/03/21/new-ioc-president-says-meeting-olympians-on-climate-a-priority/",
    "timestamp": "2025-03-21T14:28:10Z"
  },
  {
    "title": "Trump Calls on John Roberts to Block Injunctions",
    "description": "\"President Donald Trump demanded that Chief Justice John Roberts and the U.S. Supreme Court rein in federal judges who have issued injunctions around the country that have impeded an array of his policies,\" USA Today",
    "link": "https://politicalwire.com/2025/03/21/trump-calls-on-john-roberts-to-block-injunctions-to-his-policies/",
    "timestamp": "2025-03-21T14:27:47Z"
  },
  {
    "title": "Crucial mRNA vaccine research at risk in the US",
    "description": "Scientists in the US who do research on mRNA technology worry their funding may be cut under President Trump. mRNA technology is the basis for COVID- and other vaccines and could play a role in cancer treatment.",
    "link": "https://www.dw.com/en/crucial-mrna-vaccine-research-at-risk-in-the-us/a-71989604",
    "timestamp": "2025-03-21T14:27:00Z"
  },
  {
    "title": "Trump White House begins review of federal agency plans for second round of mass layoffs",
    "description": "White House officials are reviewing agency downsizing plans, a move expected to lead to firing thousands of federal workers within the coming weeks.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/21/trump-white-house-mass-layoffs-agency-review/82589632007/",
    "timestamp": "2025-03-21T14:25:44Z"
  },
  {
    "title": "Improving Education Outcomes by Empowering Parents, States, and Communities (President Donald J. Trump/The White House)",
    "description": "President Donald J. Trump / The White House:\nImproving Education Outcomes by Empowering Parents, States, and Communities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to enable parents, te…",
    "link": "https://www.memeorandum.com/250321/p39",
    "timestamp": "2025-03-21T14:25:02Z"
  },
  {
    "title": "Canadians just don't like Elon Musk as Tesla vandalism spreads across the country amid backlash against Donald Trump administration",
    "description": "Tesla faces vandalism in Canada amid Elon Musk’s controversial remarks and trade tensions with the U.S., highlighting climate activism, government retaliation, and public backlash over political alliances.",
    "link": "https://economictimes.indiatimes.com/news/international/us/canadians-just-dont-like-elon-musk-as-tesla-vandalism-spreads-across-the-country-amid-backlash-against-donald-trump-administration/articleshow/119307758.cms",
    "timestamp": "2025-03-21T14:24:36Z"
  },
  {
    "title": "Russian drones strike Ukrainian city of Odesa, underlining challenges for even limited truce",
    "description": "The attack underlined Moscow’s intention to pursue aerial attacks even as it agreed to temporarily halt strikes on energy facilities.",
    "link": "https://www.bostonherald.com/2025/03/21/russia-drone-strikes-ukraine-odesa/",
    "timestamp": "2025-03-21T14:24:12Z"
  },
  {
    "title": "Tim Walz Claims Without Evidence That Segregation Will Return If Education Department Is Closed Down",
    "description": "Democratic Gov. Tim Walz of Minnesota claimed the Trump administration’s decision to shutter the Department of Education would allow segregation to resume.",
    "link": "https://dailycaller.com/2025/03/21/tim-walz-claims-without-evidence-that-segregation-will-return-if-education-department-is-closed-down/",
    "timestamp": "2025-03-21T14:24:06Z"
  },
  {
    "title": "Trump eyeing Crimea as ‘international resort’ – Hersh",
    "description": "The renowned American journalist has claimed that the US president wants to do business with Russian counterpart Vladimir Putin Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/614596-trump-crimea-resort-hersh/",
    "timestamp": "2025-03-21T14:23:17Z"
  },
  {
    "title": "What the $660 Million Greenpeace Verdict Means for US Activism",
    "description": "A North Dakota jury this week found Greenpeace liable for defamation, conspiracy and other claims over its participation in the Dakota Access pipeline protests that lasted from 2016 to 2017, awarding developer Energy Transfer LP $660 million in damages. Legal…",
    "link": "https://financialpost.com/pmn/business-pmn/what-the-660-million-greenpeace-verdict-means-for-us-activism",
    "timestamp": "2025-03-21T14:22:52Z"
  },
  {
    "title": "Maine Universities Agree to Keep Men Out of Women’s Sports After Trump Admin Funding Pause",
    "description": "The USDA announced that the University of Maine System (UMS) has agreed to keep transgender-identifying men out of women's sports.\nThe post Maine Universities Agree to Keep Men Out of Women’s Sports After Trump Admin Funding Pause appeared first on Breitbart.",
    "link": "https://www.breitbart.com/sports/2025/03/21/maine-universities-agree-to-keep-men-out-of-womens-sports-after-trump-admin-funding-pause/",
    "timestamp": "2025-03-21T14:22:27Z"
  },
  {
    "title": "Buy ‘em By The Case. With 200% Tariffs Looming Over Champagne, You Still Have Time To Purchase Those Bottles Already In U.S. Wine Stores",
    "description": "The U.S. has long been Champagne's major importer, now in doubt if 200% tariffs go into effect April 1.",
    "link": "https://www.forbes.com/sites/johnmariani/2025/03/21/buy-em-by-the-case-with-200-tariffs-looming-over-champagne-you-still-have-time-to-purchase-those-bottles-already-imported/",
    "timestamp": "2025-03-21T14:21:50Z"
  },
  {
    "title": "VF: A source close to Prince Harry said he was ‘properly admitted to the US’",
    "description": "Prince Harry’s immigration/residency status was once again in the news this week after a federal judge authorized a more thorough release of Harry’s visa records. Harry permanently moved to the United States in March 2020, during Donald Trump’s first term, bu…",
    "link": "https://www.celebitchy.com/914563/vf_a_source_close_to_prince_harry_said_he_was_properly_admitted_to_the_us/",
    "timestamp": "2025-03-21T14:20:44Z"
  },
  {
    "title": "Tether is in talks with 'Big Four' firm about reserve audit, CEO says",
    "description": "By Hannah Lang and Elizabeth Howcroft\n(Reuters) - Tether, the creator of the world's largest stablecoin, is \"engaging with a Big Four accounting firm\" as it pushes for a long-awaited audit of its reserves, an effort CEO Paolo Ardoino said will be easier under…",
    "link": "https://biztoc.com/x/bdbcb4f8785bf477",
    "timestamp": "2025-03-21T14:20:14Z"
  },
  {
    "title": "Why did Conor McGregor meet Donald Trump in the Oval office? McGregor says he will run to be Ireland’s President, fueling political ambitions and controversy",
    "description": "Conor McGregor’s Oval Office Meeting with Donald Trump has stirred global attention. On March 17, 2025, McGregor met Trump in the White House, discussing Ireland’s political landscape, focusing on immigration and transparency. While McGregor aims to influence…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-did-conor-mcgregor-meet-donald-trump-in-the-oval-office-mcgregor-says-he-will-run-to-be-irelands-president-fueling-political-ambitions-and-controversy/articleshow/119305536.cms",
    "timestamp": "2025-03-21T14:18:46Z"
  },
  {
    "title": "Crypto's Fairshake PAC Backs Republicans With Last-Minute Cash in Florida Races",
    "description": "The high-profile campaign operation is putting $1.5 million into Florida special elections that could have significant consequences for the House GOP majority.",
    "link": "https://www.coindesk.com/policy/2025/03/21/crypto-s-fairshake-pac-backs-republicans-with-last-minute-cash-in-florida-races",
    "timestamp": "2025-03-21T14:18:27Z"
  },
  {
    "title": "Soros Comes for Schumer - Dem Leader Faces End of His Career as Soros-Backed Org Marks Him for Elimination",
    "description": "Soros Comes for Schumer - Dem Leader Faces End of His Career as Soros-Backed Org Marks Him for Eliminationwesternjournal.com",
    "link": "https://www.westernjournal.com/soros-comes-schumer-dem-leader-faces-end-career-soros-backed-org-marks-elimination/",
    "timestamp": "2025-03-21T14:17:30Z"
  },
  {
    "title": "Trump proudly displays Declaration of Independence – but is it the original?",
    "description": "President Donald Trump gave Fox News host Laura Ingraham a special look at a framed display of the Declaration of Independence that he had moved into the Oval Office, which White House Press Secretary Karoline Leavitt said would be “carefully protected and pr…",
    "link": "https://nypost.com/video/trump-proudly-displays-declaration-of-independence-but-is-it-the-original/",
    "timestamp": "2025-03-21T14:16:43Z"
  },
  {
    "title": "Remember the Tea Party Movement? Why Democrats Need the Equivalent...and Right Now",
    "description": "Remember back when Barack Obama was first elected to the White House, and the Republicans lost so much of their collective damn mind at the idea of a brother in the Oval Office that they created the whole Tea Party movement? Black folks knew what time it was …",
    "link": "https://www.theroot.com/remember-the-tea-party-movement-why-democrats-need-the-1851771540",
    "timestamp": "2025-03-21T14:12:00Z"
  },
  {
    "title": "European nations reconsidering troop deployment in Ukraine – FT",
    "description": "Supporters of Kiev are shifting their strategy toward air and sea patrols, according to the newspaper Read Full Article at RT.com",
    "link": "https://www.rt.com/news/614586-ukraine-peacekeepers-no-boots/",
    "timestamp": "2025-03-21T14:11:40Z"
  },
  {
    "title": "Trump crackdown on transgender athletes in girls' sports gets GOP backup in House bill",
    "description": "A new House GOP bill seeks to codify President Donald Trump's executive order on transgender athletes.",
    "link": "https://www.foxnews.com/politics/trump-crackdown-transgender-athletes-girls-sports-gets-gop-backup-house-bill",
    "timestamp": "2025-03-21T14:10:28Z"
  },
  {
    "title": "Regulators recall nearly all of Tesla’s Cybertrucks",
    "description": "It's the eighth recall of the Tesla vehicles since deliveries to customers began just over a year ago.",
    "link": "https://www.pennlive.com/business/2025/03/regulators-recall-nearly-all-of-teslas-cybertrucks.html",
    "timestamp": "2025-03-21T14:09:32Z"
  },
  {
    "title": "Department of Education Shutdown: Which 'Useful Functions' are Being Saved",
    "description": "President Trump stated that certain functions will be \"fully preserved\" and transferred to other agencies.",
    "link": "https://www.newsweek.com/which-department-education-functions-being-saved-2048414",
    "timestamp": "2025-03-21T14:08:53Z"
  },
  {
    "title": "Trump Criticizes Poor Education in US",
    "description": "President Donald Trump signed an executive order to largely dismantle the Education Department — an organization created by Congress and tasked with sweeping responsibilities that involve billions in funds that impact millions of American students.\nThe move i…",
    "link": "https://biztoc.com/x/f08eeabb41223766",
    "timestamp": "2025-03-21T14:07:56Z"
  },
  {
    "title": "Jackie Robinson web page purge due to human error in race to meet DEI deadline",
    "description": "Human error was the cause of the purging of the feature about Jackie Robinson's military service on the Department of Defense's website.",
    "link": "https://www.foxnews.com/sports/jackie-robinson-web-page-purge-due-human-error-race-meet-dei-deadline",
    "timestamp": "2025-03-21T14:07:07Z"
  },
  {
    "title": "New day, new problem: Tesla owners ditch EVs in record numbers as Elon Musk’s political ties with Donald Trump spark controversy",
    "description": "Tesla trade-ins hit record highs as Elon Musk’s Trump advisory role sparks backlash. Explore the surge in used EV depreciation, protests over political ties, and how brand loyalty shifts amid Tesla’s market saturation and vandalism incidents.",
    "link": "https://economictimes.indiatimes.com/news/international/us/new-day-new-problem-tesla-owners-ditch-evs-in-record-numbers-as-elon-musks-political-ties-with-donald-trump-spark-controversy/articleshow/119307209.cms",
    "timestamp": "2025-03-21T14:06:33Z"
  },
  {
    "title": "Gold Prices decline: Key factors behind the drop and crucial levels to watch next week",
    "description": "Gold surged to multiple record highs in 2025, reaching an all-time peak of $3,057.21 per ounce on Thursday.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-prices-decline-key-factors-behind-the-drop-and-crucial-levels-to-watch-next-week/articleshow/119307046.cms",
    "timestamp": "2025-03-21T14:06:32Z"
  },
  {
    "title": "Trump's latest Elon Musk move shows 'just how weak' the President is: Dem lawmaker",
    "description": "Rep. Steve Horsford (D-NV) on Friday heaped scorn on President Donald Trump for reportedly allowing Elon Musk to receive a briefing on top-secret war plans.Appearing on CNN, Horsford addressed the rage being expressed by Democratic voters at town hall meeting…",
    "link": "https://www.rawstory.com/elon-musk-china-2671378083/",
    "timestamp": "2025-03-21T14:06:17Z"
  },
  {
    "title": "Anti-Tesla protestors to face unprecedented consequences? Trump's blunt warning sparks buzz",
    "description": "Amid a wave of attacks on Tesla's dealerships and vehicles, President Donald Trump has come out in support of his key ally and DOGE chief Elon Musk. Trump has issued a very strict warning for those who are found convicted in Tesla violence case. Several Tesla…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-elon-musk-tesla-attacks-trump-send-tesla-vandals-el-salvador-prison-anti-tesla-protestors-to-face-unprecedented-consequences-trumps-blunt-warning-sparks-buzz/articleshow/119307052.cms",
    "timestamp": "2025-03-21T14:04:49Z"
  },
  {
    "title": "Republican Behind 'Trump Derangement' Bill Quits After Sex Charge",
    "description": "The Minnesota state Senator is accused of soliciting prostitution from someone he believed to be a minor.",
    "link": "https://www.newsweek.com/republican-behind-trump-derangement-syndrome-bill-resigns-justin-eichorn-2048418",
    "timestamp": "2025-03-21T14:04:35Z"
  },
  {
    "title": "'Snow White' Called Out Over Vacant Seats Prior to Premiere",
    "description": "Disney's live-action remake of the 1937 film premieres Friday but some people are predicting it's going to bomb.",
    "link": "https://www.newsweek.com/snow-white-called-out-empty-theater-seats-2048365",
    "timestamp": "2025-03-21T14:04:11Z"
  },
  {
    "title": "Chinese anger at sale of Panama Canal ports to US investor highlights tensions between the two superpowers",
    "description": "Competition over the Panama Canal shows how US-Chinese rivalry is hotting up.",
    "link": "https://theconversation.com/chinese-anger-at-sale-of-panama-canal-ports-to-us-investor-highlights-tensions-between-the-two-superpowers-252418",
    "timestamp": "2025-03-21T14:03:39Z"
  },
  {
    "title": "Google, OpenAI target state laws in AI action plan",
    "description": "The federal government is developing plans for AI policy in the U.S. Stakeholders want a federal policy preempting state laws as a top strategic priority.",
    "link": "https://www.techtarget.com/searchenterpriseai/news/366621060/Google-OpenAI-target-state-laws-in-AI-action-plan",
    "timestamp": "2025-03-21T14:03:00Z"
  },
  {
    "title": "Dow falls 350 points, S&P 500 heads for fifth-straight losing week: Live updates",
    "description": "U.S. stocks fell Friday morning, putting the S&P 500 on pace to extend its monthlong rout caused by trade policy turmoil, recession fears and a rollover in megacap technology shares. The S&P 500 fell 0.8%, while the Nasdaq Composite pulled back 1%. The Dow Jo…",
    "link": "https://freerepublic.com/focus/f-news/4305825/posts",
    "timestamp": "2025-03-21T14:01:45Z"
  },
  {
    "title": "‘It’s not what he expected’: Rubio has competition for the role of America’s top diplomat | CNN Politics",
    "description": "When Marco Rubio signed on as Donald Trump’s Secretary of State, he went into the job “with eyes wide open,” according to a person familiar with his thinking. He knew it wouldn’t be easy working for Trump. He knew that Trump had a track record of firing top o…",
    "link": "https://www.cnn.com/2025/03/21/politics/rubio-competition-for-role-of-americas-top-diplomat/index.html",
    "timestamp": "2025-03-21T14:00:52Z"
  },
  {
    "title": "On Trump's Order, Education Dept Grabbed Off Street, Sold Into Salvadoran Supermax",
    "description": "Administration denies knowledge. You know, in general.",
    "link": "https://www.wonkette.com/p/on-trumps-order-education-dept-grabbed",
    "timestamp": "2025-03-21T14:00:40Z"
  },
  {
    "title": "Court order halting deportation flights ‘unconstitutionally impedes’ on executive branch, Trump allies argue",
    "description": "FIRST ON FOX: In a new amicus filing, America First Legal and GOP Rep. Brandon Gill argue in support of President Donald Trump’s authority to invoke a 1798 wartime law as part of his immigration agenda.",
    "link": "https://www.foxnews.com/politics/court-order-halting-deportation-flights-unconstitutionally-impedes-executive-branch-trump-allies-argue",
    "timestamp": "2025-03-21T14:00:27Z"
  },
  {
    "title": "Schools in Rochester, NY, Grapple With DEI Policies in the Age of Trump",
    "description": "\"support for the use of DEI statements in hiring recently has begun to wane as some of the nation’s top colleges and universities have dropped them\"\nThe post Schools in Rochester, NY, Grapple With DEI Policies in the Age of Trump first appeared on Le·gal In·s…",
    "link": "https://legalinsurrection.com/2025/03/schools-in-rochester-ny-grapple-with-dei-policies-in-the-age-of-trump/",
    "timestamp": "2025-03-21T14:00:27Z"
  },
  {
    "title": "FBI scales back staffing, tracking of domestic terrorism probes, sources say",
    "description": "The FBI’s restructuring of resources could weaken its ability to track domestic extremist plots.",
    "link": "https://www.jpost.com/international/article-847050",
    "timestamp": "2025-03-21T14:00:17Z"
  },
  {
    "title": "While Trump Delivers Real ‘Hope and Change,’ Obama, Clinton Watch Democratic Party Become Clown Car",
    "description": "The Democratic Party is in free fall. Once a party of pragmatic leadership, strong borders, fiscal responsibility, and law and order, it has devolved into... Read More\nThe post While Trump Delivers Real ‘Hope and Change,’ Obama, Clinton Watch Democratic Party…",
    "link": "https://www.dailysignal.com/2025/03/21/democrats-lurch-left/",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Trump won over many Arab Americans in November. How do they feel about him now?",
    "description": "In Detroit and its suburbs, where support shifted towards Trump during the election, anger is deep over Israeli airstrikes in Gaza",
    "link": "https://www.irishtimes.comhttps://www.nytimes.com/2025/03/20/us/trump-arab-americans-gaza-israel.html",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Trade with Canada: Montana farmers, home builders, drivers could be hit by Trump's tariffs",
    "description": "Montana's largest trading partner, by far, is Canada. Farmers, ranchers, home builders and gasoline prices could be impacted by tariffs.",
    "link": "https://missoulian.com/news/local/business/article_5a099e54-0422-11f0-98f8-4fd025b076e2.html",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Understanding Congress’s Billionaire Budget",
    "description": "Chuck Schumer joined forces with Donald Trump to pass one of the most reactionary federal budgets in recent memory. What does it mean?",
    "link": "https://www.yesmagazine.org/video/ruws-congressional-budget-explainer",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Jon Ossoff Is Kicking Off Georgia Race With a Blunt Message for Donald Trump",
    "description": "The 38-year-old Democrat emerged as an MSNBC darling during Trump’s first term, but has taken a more heads-down approach in the Senate. Now, given this “extraordinarily dangerous moment in our country’s history,” as Ossoff describes it to ‘VF,’ will he step u…",
    "link": "https://www.vanityfair.com/news/story/jon-ossoff-donald-trump-georgia-2026",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "After FTC commissioners fired, marketers speculate on future of industry regulation",
    "description": "In a statement sent to The Drum by former Federal Trade Commissioner Rebecca Slaughter, she voices concern that nobody will “protect consumers and protect competition.” Marketers weigh in on a future that could involve “inconsistent enforcement” and “uncertai…",
    "link": "https://www.thedrum.com/news/2025/03/21/after-ftc-commissioners-fired-marketers-speculate-future-industry-regulation",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "'Not for sale;' Postal service union members protest cuts, rumored takeover",
    "description": "About 20 American Postal Workers Union Local 1416 members rallied outside the downtown Fairbanks post office on Thursday in protest of the White House’s proposed cuts and desire to privatize the service.",
    "link": "https://www.newsminer.com/news/local_news/not-for-sale-postal-service-union-members-protest-cuts-rumored-takeover/article_0f352bef-d1a7-4e38-80f9-bb1c333402f4.html",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "Is there anything good about conspiracy beliefs? Belief in COVID-19 conspiracy theories is associated with benefits to well-being",
    "description": "Recent theorizing suggests that people gravitate toward conspiracy theories during difficult times because such beliefs promise to alleviate threats to psychological motives. Surprisingly, however, previous research has largely failed to find beneficial intra…",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0319896",
    "timestamp": "2025-03-21T14:00:00Z"
  },
  {
    "title": "US Secret Service meets with GM execs on next-generation armored SUVs",
    "description": "WASHINGTON (Reuters) -The head of the U.S. Secret Service met with General Motors executives this week in Michigan to discuss next-generation armored SUVs as...",
    "link": "https://ca.finance.yahoo.com/news/secret-meets-gm-execs-next-135849453.html",
    "timestamp": "2025-03-21T13:58:49Z"
  },
  {
    "title": "Russian Central Bank Holds Key Rate At Two-decade High",
    "description": "Russia's central bank kept its key rate at a two-decade high of 21 percent on Friday and warned it could raise borrowing costs further as it battles rampant inflation.",
    "link": "https://www.ibtimes.com/russian-central-bank-holds-key-rate-two-decade-high-3767214",
    "timestamp": "2025-03-21T13:57:15Z"
  },
  {
    "title": "Will protesters get death penalty for smashing and setting fire to Tesla cars in the U.S? Here's what White House press secretary Karoline Leavitt says",
    "description": "Fox News host Harris Faulkner asked White House press secretary Karoline Leavitt if people who vandalize or burn Tesla cars could face the death penalty. This question arose due to increasing protests against Tesla after Elon Musk supported Donald Trump. Leav…",
    "link": "https://economictimes.indiatimes.com/news/international/us/will-protesters-get-death-penalty-for-smashing-and-setting-fire-to-tesla-cars-in-the-u-s-heres-what-white-house-press-secretary-karoline-leavitt-says/articleshow/119305654.cms",
    "timestamp": "2025-03-21T13:56:40Z"
  },
  {
    "title": "India, US actively working on building framework for bilateral trade pact: MEA",
    "description": "India and US working on bilateral trade agreement to reduce tariffs, increase trade; negotiations ongoing for mutual benefits.",
    "link": "https://www.thehindubusinessline.com/economy/india-us-actively-working-on-building-framework-for-bilateral-trade-pact-mea/article69358508.ece",
    "timestamp": "2025-03-21T13:55:46Z"
  },
  {
    "title": "Will Donald Trump's executive order make student loans disappear? The truth behind his Education Department shutdown",
    "description": "In a major move, President Trump signed an executive order to dismantle the Department of Education, transferring educational control to states. The decision leaves uncertainty around the $1.64 trillion student loan debt, with potential changes in loan manage…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/will-donald-trumps-executive-order-make-student-loans-disappear-the-truth-behind-his-education-department-shutdown/articleshow/119306757.cms",
    "timestamp": "2025-03-21T13:55:38Z"
  },
  {
    "title": "Accenture: DOGE's Federal procurement review is hurting our sales",
    "description": "Share price list slides for top ten consultant to US government Accenture says Federal procurement projects are continuing to slow since Elon Musk's Department of Government Efficiency began reviewing ways to cut costs last month, and this is directly impacti…",
    "link": "https://www.theregister.com/2025/03/21/accenture_warns_doges_federal_procurement/",
    "timestamp": "2025-03-21T13:55:33Z"
  },
  {
    "title": "How the campaign to impeach judges took off among Trump allies (Washington Post)",
    "description": "Washington Post:\nHow the campaign to impeach judges took off among Trump allies  —  Social-media posts by high-profile conservatives about judicial impeachment have jumped sevenfold in the past two weeks.  —  Weeks before President Donald Trump called for the…",
    "link": "https://www.memeorandum.com/250321/p31",
    "timestamp": "2025-03-21T13:55:00Z"
  },
  {
    "title": "Elon Musk and Donald Trump Have Chosen Chaos (Brian Barrett/Wired)",
    "description": "Brian Barrett / Wired:\nElon Musk and Donald Trump Have Chosen Chaos  —  Elon Musk secured his choke hold on the mechanics of the federal government weeks ago.  Along with Donald Trump, he has already standardized chaos across the US.  —  Two months into the s…",
    "link": "https://www.memeorandum.com/250321/p32",
    "timestamp": "2025-03-21T13:55:00Z"
  },
  {
    "title": "Fact check: How to spot fabricated news reports",
    "description": "Media organizations are facing a growing problem: their websites and logos are being cloned to spread disinformation. Here's what's behind this trend — and how you can spot the fakes.",
    "link": "https://www.dw.com/en/fact-check-how-to-spot-fabricated-news-reports/a-71992819",
    "timestamp": "2025-03-21T13:55:00Z"
  },
  {
    "title": "Elon Musk tells Tesla staffers 'it feels like Armageddon' — but says don't sell your stock",
    "description": "Tesla (TSLA) CEO Elon Musk acknowledged the trouble his EV giant has had in recent months, but urged staff to “hang onto your stock” during an all-hands meeting on Thursday.Read more...",
    "link": "https://qz.com/elon-musk-tesla-town-hall-stock-trump-doge-1851771541",
    "timestamp": "2025-03-21T13:53:00Z"
  },
  {
    "title": "Tesla Protests And Vandalism Surge: Trump Says Vandals Should Serve 20-Year Sentences In El Salvador",
    "description": "Peaceful Tesla protests have taken place across the country—but some dealerships have also been hit with acts of vandalism, including gunfire and arson, in protests apparently directed at Elon Musk.",
    "link": "https://www.forbes.com/sites/conormurray/2025/03/21/tesla-protests-and-vandalism-surge-trump-says-vandals-should-serve-20-year-sentences-in-el-salvador/",
    "timestamp": "2025-03-21T13:53:00Z"
  },
  {
    "title": "After Trump meeting, UAE commits to 10-year, $1.4 trillion investment framework in US, White House official says",
    "description": "WASHINGTON : The United Arab Emirates has committed to a 10-year, $1.4 trillion investment framework in the United States after top UAE officials met President Donald Trump this week, a White House official said on Friday.The new framework will \"substantially…",
    "link": "https://www.channelnewsasia.com/business/after-trump-meeting-uae-commits-10-year-14-trillion-investment-framework-us-white-house-official-says-5016266",
    "timestamp": "2025-03-21T13:51:50Z"
  },
  {
    "title": "UAE commits to $1.4 trillion investment framework in US, White House says",
    "description": "WASHINGTON : The United Arab Emirates has committed to a 10-year, $1.4 trillion investment framework in the United States after top UAE officials met President Donald Trump this week, a White House official said on Friday. The new framework will \"substantiall…",
    "link": "https://www.channelnewsasia.com/business/uae-commits-14-trillion-investment-framework-us-white-house-says-5016266",
    "timestamp": "2025-03-21T13:51:50Z"
  },
  {
    "title": "UAE commits to $1.4 trillion US investment, White House says",
    "description": "WASHINGTON/DUBAI :The United Arab Emirates has committed to a 10-year, $1.4 trillion investment framework in the United States after top UAE officials met President Donald Trump this week, the White House said on Friday. The framework will \"substantially incr…",
    "link": "https://www.channelnewsasia.com/business/uae-commits-14-trillion-us-investment-white-house-says-5016266",
    "timestamp": "2025-03-21T13:51:50Z"
  },
  {
    "title": "Trump Melts Down Over How Much Power President Elon Musk Has",
    "description": "Elon Musk, the unelected face of the Department of Government Efficiency, is scheduled to receive a Pentagon briefing Friday on the U.S. military’s plan for a potential war with China, The New York Times reported.\r\nThe meeting would be a massive and unprecede…",
    "link": "https://newrepublic.com/post/193014/donald-trump-elon-musk-defense-briefing-china",
    "timestamp": "2025-03-21T13:50:04Z"
  },
  {
    "title": "Trump’s pick for SEC chairman faces noisy confirmation hearing over crypto",
    "description": "SEC crypto enforcement cases, even before Atkins confirmation, have been dropping left and right since Trump took office.",
    "link": "https://nypost.com/2025/03/21/business/trumps-sec-chairman-pick-paul-atkins-faces-confirmation-hearing-over-crypto/",
    "timestamp": "2025-03-21T13:49:39Z"
  },
  {
    "title": "Elon Musk's PAC is giving $100 to Wisconsin voters ahead of the state's Supreme Court race",
    "description": "Elon Musk's super PAC has spent millions of dollars on a Wisconsin Supreme Court race, the first major statewide campaign since Trump's election.",
    "link": "https://www.businessinsider.com/elon-musk-america-pac-wisconsin-supreme-court-petition-100-dollars-2025-3",
    "timestamp": "2025-03-21T13:47:34Z"
  },
  {
    "title": "Why Trump’s TikTok deal is worrying deep-pocketed investors",
    "description": "TikTok’s emergence, mostly with the youth of America, has been haunting Silicon Valley, Wall Street and Washington for more than five years.",
    "link": "https://nypost.com/2025/03/21/business/why-trumps-tiktok-deal-worries-deep-pocketed-investors/",
    "timestamp": "2025-03-21T13:47:01Z"
  },
  {
    "title": "Trump's hostage envoy Boehler met with Taliban in Kabul in first in-person meeting since takeover",
    "description": "President Donald Trump's hostage envoy traveled to Kabul to meet with Taliban officials in the first in-person meeting since the 2021 takeover to secure release of George Glezmann and discuss \"beneficial\" issues.",
    "link": "https://www.foxnews.com/world/trumps-hostage-envoy-boehler-met-taliban-kabul-first-person-meeting-since-takeover",
    "timestamp": "2025-03-21T13:46:23Z"
  },
  {
    "title": "Elon Musk calls for prosecutions of Pentagon staff who leaked to the New York Times",
    "description": "WASHINGTON (Reuters) -Elon Musk said Pentagon staff who spoke to reporters at the New York Times should be prosecuted, after the newspaper reported the...",
    "link": "https://ca.news.yahoo.com/elon-musk-calls-prosecutions-pentagon-134513200.html",
    "timestamp": "2025-03-21T13:45:13Z"
  },
  {
    "title": "Israeli minister threatens to annex parts of Gaza",
    "description": "<p>JERUSALEM - Israeli Defence Minister Israel Katz threatened on Friday to annex parts of the Gaza Strip unless Hamas militants release the remaining Israeli hostages held in the war-battered Palestinian territory.</p>",
    "link": "https://www.bangkokpost.com/world/2984995/israeli-minister-threatens-to-annex-parts-of-gaza",
    "timestamp": "2025-03-21T13:45:00Z"
  },
  {
    "title": "Massie Tests Trump’s Appetite for a Primary Fight",
    "description": "“President Donald Trump has threatened to take down Rep. Thomas Massie before. Now he’s trying again, at the peak of his power in the GOP — and might even succeed this time,” Semafor reports. “It",
    "link": "https://politicalwire.com/2025/03/21/massie-tests-trumps-appetite-for-a-primary-fight/",
    "timestamp": "2025-03-21T13:45:00Z"
  },
  {
    "title": "Jerome Powell says Trump can’t fire him. That might change",
    "description": "President Trump's dismissal of two Democratic FTC commissioners challenges a 1935 Supreme Court decision that protects independent agency members from removal. This action raises concerns about the potential impact on the Federal Reserve's independence, which…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/jerome-powell-says-trump-cant-fire-him-that-might-change/articleshow/119306551.cms",
    "timestamp": "2025-03-21T13:43:26Z"
  },
  {
    "title": "Elon Musk juggles Tesla, Trump ties & stock woes as he attempts to rally the troops—Is it time for a new CEO?",
    "description": "Tesla CEO Elon Musk addressed employees in an impromptu all-hands meeting amid mounting concerns over his leadership and the company’s performance. Facing a sharp stock decline and increasing scrutiny, Musk reassured employees about Tesla’s future, championin…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musk-juggles-tesla-trump-ties-stock-woes-as-he-attempts-to-rally-the-troopsis-it-time-for-a-new-ceo/articleshow/119301376.cms",
    "timestamp": "2025-03-21T13:43:05Z"
  },
  {
    "title": "Wall Street Journal Slams ‘Junior Achievement Sun Tzus’ in the Trump Admin for Proposing an ‘American Retreat’",
    "description": "The Wall Street Journal ripped the \"junior achievement Sun Tzus\" in the Trump administration for proposing \"an American retreat\" in a new editorial.\nThe post Wall Street Journal Slams ‘Junior Achievement Sun Tzus’ in the Trump Admin for Proposing an ‘American…",
    "link": "https://www.mediaite.com/news/wall-street-journal-slams-junior-achievement-sun-tzus-in-the-trump-admin-for-proposing-an-american-retreat/",
    "timestamp": "2025-03-21T13:42:11Z"
  },
  {
    "title": "Elon Musk Says To ‘Hang On’ To Sliding Tesla Stock In ‘Needed’ All-Hands Meeting",
    "description": "“I have like 17 jobs, at this point,” the DOGE, SpaceX and Tesla boss Musk said Thursday, adding he’s “stretched pretty thin.”",
    "link": "https://www.forbes.com/sites/dereksaul/2025/03/21/elon-musk-says-to-hang-on-to-sliding-tesla-stock-in-needed-all-hands-meeting/",
    "timestamp": "2025-03-21T13:41:36Z"
  },
  {
    "title": "Facing anti-DEI investigations, colleges cut ties with nonprofit targeted by conservatives",
    "description": "The Education Department has investigated dozens of universities for alleged racial discrimination.",
    "link": "https://www.bostonherald.com/2025/03/21/trump-higher-education-anti-dei/",
    "timestamp": "2025-03-21T13:40:01Z"
  },
  {
    "title": "Colleges cut ties with a little-known nonprofit targeted by the Trump administration over DEI",
    "description": "The rollout of the investigations highlights the climate of fear and uncertainty in higher education.",
    "link": "https://www.denverpost.com/2025/03/21/trump-higher-education-anti-dei/",
    "timestamp": "2025-03-21T13:40:01Z"
  },
  {
    "title": "Italian Village Wants Louvre to Return Church Carving, Trump Appoints New Head of IMLS After Ordering it Dismantled: Morning Links for March 21, 2025",
    "description": "An Italian village has asked the Louvre to return a Church carving, a new study calls for better, not bigger museums, and more.",
    "link": "https://www.artnews.com/art-news/news/italian-village-wants-louvre-to-return-church-carving-trump-appoints-new-head-of-imls-after-ordering-it-dismantled-morning-links-for-march-21-2025-1234736265/",
    "timestamp": "2025-03-21T13:39:59Z"
  },
  {
    "title": "Trump Suggests Those Attacking Teslas Should Go To Prison In El Salvador",
    "description": "Trump's administration recently sent more than 250 Venezuelan migrants there, even as a judge issued an order temporarily blocking the deportations.",
    "link": "https://www.huffpost.com/entry/trump-tesla-vandals-prison_n_67dd667ee4b09b090813d6e3",
    "timestamp": "2025-03-21T13:39:39Z"
  },
  {
    "title": "COURT D'ÉTAT",
    "description": "Steve Brodner\n\n\n\nCourage.\r\n\n\r\n\n\nThe post COURT D'ÉTAT appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/court-detat/",
    "timestamp": "2025-03-21T13:38:03Z"
  },
  {
    "title": "Trump Threatens to Deport the “Terrorists” Who Protest Tesla",
    "description": "Donald Trump is threatening to deport U.S. citizens who vandalize Tesla dealerships. \r\nIn a post on Truth Social Friday morning, the president took his threats to punish protesters for committing so-called “domestic terrorism” against his billionaire bureaucr…",
    "link": "https://newrepublic.com/post/193012/donald-trump-threatens-deport-tesla",
    "timestamp": "2025-03-21T13:37:55Z"
  },
  {
    "title": "Iran's Supreme Leader Threatens US with \"Severe Blow\"",
    "description": "Ayatollah Ali Khamenei warned against US strikes on Iran, after Trump's vowed to hold Tehran responsible for Houthi attacks.",
    "link": "https://www.newsweek.com/iran-supreme-leader-us-severe-blow-khamenei-nuclear-2048521",
    "timestamp": "2025-03-21T13:37:42Z"
  },
  {
    "title": "Trump & Sec. of Defense Hegseth deliver remarks in Oval Office",
    "description": "President Donald Trump and Secretary of Defense Pete Hegseth are scheduled to make remarks in the Oval Office today. The event is expected to start at 11 AM ET. https://www.youtube.com/watch?v=kS9NGDzyaN8",
    "link": "https://nypost.com/video/trump-sec-of-defense-hegseth-deliver-remarks-in-oval-office/",
    "timestamp": "2025-03-21T13:37:10Z"
  },
  {
    "title": "Trump’s steel & aluminium tariffs take shine off engineering goods exports",
    "description": "Engineering goods exports in FY25 may be lower than targetted $118 billion due to slowdown in last two months of the fiscal, says EEPC",
    "link": "https://www.thehindubusinessline.com/economy/trumps-steel-aluminium-tariffs-take-shine-off-engineering-goods-exports/article69358267.ece",
    "timestamp": "2025-03-21T13:36:25Z"
  },
  {
    "title": "Tesla Cited by U.S. Regulators Over Texas Worker’s Death",
    "description": "Federal regulators have cited Tesla for violating workplace safety rules in connection with the electrocution of a worker last summer at its Austin, Texas, auto-manufacturing plant. The U.S. Department of Labor confirmed the findings in a statement to Reuters…",
    "link": "https://www.insurancejournal.com/news/southcentral/2025/03/21/816584.htm",
    "timestamp": "2025-03-21T13:36:06Z"
  },
  {
    "title": "Jimmy Kimmel Brutally References Trump’s Affair With Stormy Daniels While Wishing Son Barron A Happy 19th Birthday",
    "description": "The late night host joked Barron's birthday happens to fall near another important event of President Trump's life.",
    "link": "https://decider.com/2025/03/21/jimmy-kimmel-trump-affair-stormy-daniels-barron-trump-birthday/",
    "timestamp": "2025-03-21T13:34:58Z"
  },
  {
    "title": "Trump’s tariffs approach risks dividing EU on response, Taoiseach warns",
    "description": "Sector-by-sector attack could lead to block being ‘sucked in’ to similar retaliation, Martin says",
    "link": "https://www.irishtimes.com/politics/2025/03/21/trumps-tariffs-approach-risks-dividing-eu-on-response-taoiseach-warns/",
    "timestamp": "2025-03-21T13:34:16Z"
  },
  {
    "title": "4 Non-Tariff Executive Orders And Actions That Could Impact Manufacturers",
    "description": "Since his inauguration, President Trump has signed 89 executive orders, 36 of them within the week he took office. Which ones will impact manufacturing?",
    "link": "https://www.forbes.com/sites/ethankarp/2025/03/21/4-non-tariff-executive-orders-and-actions-that-could-impact-manufacturers/",
    "timestamp": "2025-03-21T13:34:14Z"
  },
  {
    "title": "Greta Van Susteren Reveals the Only Network That Tried to Control Her: ‘That’s Why I Got Fired’",
    "description": "Greta Van Susteren claimed only one network in her decades in media has ever tried influencing what she says and that network was MSNBC.\nThe post Greta Van Susteren Reveals the Only Network That Tried to Control Her: ‘That’s Why I Got Fired’ first appeared on…",
    "link": "https://www.mediaite.com/media/greta-van-susteren-claims-only-network-that-tried-to-control-her-was-msnbc-thats-why-i-got-fired/",
    "timestamp": "2025-03-21T13:32:34Z"
  },
  {
    "title": "Trump’s ‘Big One’ on Tariffs Has Emerging Market on Edge",
    "description": "The looming barrage of fresh US tariffs is leaving traders in emerging markets ready to bolt at the slightest whiff of risk.",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-big-one-on-tariffs-has-emerging-market-on-edge",
    "timestamp": "2025-03-21T13:32:00Z"
  },
  {
    "title": "Tesla arsons probed as ‘domestic terrorism’ cheered by ‘anti-capitalist’ group linked to 2020 riots",
    "description": "As anti-Elon Musk radicals attempt to blow up Teslas at dealerships nationwide, a Philadelphia \"anti-capitalist\" group cheered would-be arsonists.",
    "link": "https://www.foxnews.com/us/tesla-arsons-probed-domestic-terrorism-cheered-anti-capitalist-group-linked-2020-riots",
    "timestamp": "2025-03-21T13:31:12Z"
  },
  {
    "title": "Pentagon Spokesman Sean Parnell Calls Out NYT for 'Fake' Report on Elon Musk Being Briefed on 'China War Plans'",
    "description": "Chief Pentagon Spokesman Sean Parnell on Friday morning blasted a New York Times report as \"fake\" after the newspaper claimed that Elon Musk was being briefed later that day at the Pentagon on \"potential war with China.\"\nThe post Pentagon Spokesman Sean Parne…",
    "link": "https://www.breitbart.com/politics/2025/03/21/pentagon-spokesman-sean-parnell-calls-out-nyt-for-fake-report-on-elon-musk-being-briefed-on-china-war-plans/",
    "timestamp": "2025-03-21T13:30:32Z"
  }
]