[
  {
    "title": "Caitlin Clark headlines Nike's first Super Bowl ad in almost 30 years redifining the spotlight with elite female athletes",
    "description": "The Philadelphia Eagles soared to their second Super Bowl title, dominating the Kansas City Chiefs 40-22 in a game that was never really in doubt after the first half. At one point",
    "link": "https://www.marca.com/en/basketball/wnba/indiana-fever/2025/02/10/67aa63c946163f6d068b45b5.html",
    "timestamp": "2025-02-10T21:47:59Z"
  },
  {
    "title": "Steve Bannon To Plead Guilty In Border Fraud Case To Avoid Prison Time: Report",
    "description": "The onetime adviser to Donald Trump is eager to avoid more prison time.",
    "link": "https://www.huffpost.com/entry/steve-bannon-to-plead-guilty-border-fraud-case_n_67aa6780e4b09fd55bc65a4d",
    "timestamp": "2025-02-10T21:47:41Z"
  },
  {
    "title": "Passports with 'X' sex markers valid until expired or renewed, State Department says",
    "description": "The State Department issued new guidance on passports with “X” sex markers and applications that request to change a passport sex marker, according to a memo reviewed by NBC News.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/passports-x-sex-marker-guidance-valid-expire-state-department-rcna191539",
    "timestamp": "2025-02-10T21:47:34Z"
  },
  {
    "title": "As NCMEC Removes Any Mention of Trans Youth, the Anti-Porn Movement Shows Its True Colors With Trump’s Executive Order Against ‘Gender Ideology’",
    "description": "I’ve long maintained the certitude that anti-pornography campaigners aligned with the far-right and conservative Christian movements are directly or indirectly transphobic and anti-LGBTQ.  A body of evidence in my own reporting and experiences covering the ri…",
    "link": "https://www.techdirt.com/2025/02/10/as-ncmec-removes-any-mention-of-trans-youth-the-anti-porn-movement-shows-its-true-colors-with-trumps-executive-order-against-gender-ideology/",
    "timestamp": "2025-02-10T21:46:09Z"
  },
  {
    "title": "Elon Musk Makes Huge Bid to Seize Control of OpenAI",
    "description": "Billionaire and White House advisor Elon Musk is leading a gigantic $97.4 billion bid to buy the nonprofit that controls OpenAI, the Wall Street Journal reports. Musk's lawyer, Marc Toberoff, delivered the unsolicited offer to the ChatGPT maker's board of dir…",
    "link": "https://futurism.com/elon-musk-huge-bid-control-openai",
    "timestamp": "2025-02-10T21:45:42Z"
  },
  {
    "title": "USAID’s support of radicals no longer ‘Russian propaganda’ – Moscow’s UN envoy",
    "description": "Recent revelations about the USAID have only proven that Moscow’s concerns were valid, the Russian UN envoy has said Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612484-usaid-support-radicals-russian-propaganda/",
    "timestamp": "2025-02-10T21:45:26Z"
  },
  {
    "title": "VHSL reverses transgender athlete participation policy to align with Trump's executive order",
    "description": "The Virginia High School League (VHSL) has changed its policy regarding transgender athlete participation, sources tell the Richmond Times-Dispatch.",
    "link": "https://richmond.com/news/state-regional/government-politics/vhsl-transgender-policy-trump-executive-order/article_2ccc0668-e7f6-11ef-acba-9797704e4417.html",
    "timestamp": "2025-02-10T21:45:00Z"
  },
  {
    "title": "Bernie Sanders Proposes Giving Donald Trump One of His Campaign Promises",
    "description": "Senators Bernie Sanders and Josh Hawley proposed a bipartisan bill to cap credit card interest rates at 10%, fulfilling a campaign promise by President Trump.",
    "link": "https://www.newsweek.com/bernie-sanders-proposes-giving-donald-trump-campaign-promise-2028977",
    "timestamp": "2025-02-10T21:44:24Z"
  },
  {
    "title": "Kendrick Lamar's Super Bowl halftime show made it cool to be a hater",
    "description": "Instead of a classic greatest hits medley, Kendrick Lamar opted to perform songs from his latest album and two Drake diss tracks at the Super Bowl.",
    "link": "https://www.businessinsider.com/kendrick-lamar-super-bowl-halftime-show-meaning-review-2025-2",
    "timestamp": "2025-02-10T21:44:09Z"
  },
  {
    "title": "Trump’s Supreme Court Immunity Ruling Just Came Back to Bite Him",
    "description": "The Supreme Court’s decision to expand the definition of presidential immunity may have just caused a hiccup for Donald Trump’s administration.\r\nA federal judge ruled Monday that Trump’s FBI must disclose records from its Mar-a-Lago case file, complying with …",
    "link": "https://newrepublic.com/post/191370/donald-trump-supreme-court-immunity-lawsuit",
    "timestamp": "2025-02-10T21:43:09Z"
  },
  {
    "title": "Fox News Host Says All ‘Legacy Media’ Has to Do is ‘Repost’ Press Releases From Trump White House",
    "description": "Fox News’s Emily Compagno said that “legacy media” should simply repost President Donald Trump’s press releases when covering his presidency. On Monday’s episode of Outnumbered, the panel discussed the way Trump has been criticized — by both the media and the…",
    "link": "https://www.mediaite.com/tv/fox-news-host-says-all-legacy-media-has-to-do-is-repost-press-releases-from-trump-white-house/",
    "timestamp": "2025-02-10T21:43:02Z"
  },
  {
    "title": "Why Elon Musk is a preposterous choice to lead a Pentagon audit",
    "description": "Donald Trump says he wants an audit of the Department of Defense’s finances — and he’s sending a billionaire defense contractor?",
    "link": "https://biztoc.com/x/a2df2facd8f3227f",
    "timestamp": "2025-02-10T21:43:02Z"
  },
  {
    "title": "Trump says Palestinians won’t be allowed to return to Gaza under his plan",
    "description": "U.S. President Donald Trump said Palestinians would not have the right of return to the Gaza Strip under his proposal to redevelop the enclave, according to excerpts from a Fox News interview.\nIn a transcript released on Monday, Trump added that he thought he…",
    "link": "https://biztoc.com/x/23950de7c6185341",
    "timestamp": "2025-02-10T21:42:53Z"
  },
  {
    "title": "'Ethereum Stole the Show': ETH Funds Trump Bitcoin ETF Gains",
    "description": "Ethereum-related funds outpaced Bitcoin for the first time this year after investors last week saw a buying opportunity for the coin.",
    "link": "https://decrypt.co/305300/ethereum-stole-show-etfs-outgain-bitcoin-funds",
    "timestamp": "2025-02-10T21:42:45Z"
  },
  {
    "title": "Dow, S&P, and Nasdaq rise as Trump plans new tariffs",
    "description": "Wall Street trades in the green on Monday, as investors looked forward to key economic data set to be released this week and assessed President Donald Trump's plans to impose fresh tariffs.",
    "link": "https://biztoc.com/x/0827fab15183675b",
    "timestamp": "2025-02-10T21:42:39Z"
  },
  {
    "title": "Jeremy Siegel: How Tariffs Could Impact the U.S. Economy",
    "description": "The economic fallout of import tariffs on Canada, Mexico, and China depends largely on how long they stay in effect, according to Wharton’s Jeremy Siegel.…Read More",
    "link": "https://knowledge.wharton.upenn.edu/article/jeremy-siegel-how-tariffs-could-impact-the-u-s-economy/",
    "timestamp": "2025-02-10T21:42:15Z"
  },
  {
    "title": "Paris AI summit pits innovation ambitions against job loss fears",
    "description": "France hopes that world leaders and tech executives at an artificial intelligence summit in Paris will agree the AI revolution should be inclusive and sustainable, although it was unclear on Monday whether the United States would be supportive. Eagerness to r…",
    "link": "https://japantoday.com/category/tech/paris-ai-summit-pits-innovation-ambitions-against-job-loss-fears",
    "timestamp": "2025-02-10T21:42:07Z"
  },
  {
    "title": "Unpacking the Shady Fashion Statements During Super Bowl LIX",
    "description": "You probably thought the Super Bowl was just a football game with a Kendrick Lamar concert in the middle, but oh, it was so much more. From Chiefs player DeAndre Hopkins paying tribute to his late father with a vintage fur coat to what Kendrick Lamar and othe…",
    "link": "https://www.theroot.com/unpacking-the-shady-fashion-statements-during-super-bow-1851759759",
    "timestamp": "2025-02-10T21:42:00Z"
  },
  {
    "title": "A New Kind of Crisis for American Universities",
    "description": "The ivory tower has been breached.",
    "link": "https://www.theatlantic.com/health/archive/2025/02/nih-trump-university-crisis/681634/",
    "timestamp": "2025-02-10T21:41:18Z"
  },
  {
    "title": "Elon Musk Baselessly Accuses Samantha Power of Corruption After She Hammered Him For Spreading ‘Falsehoods’ About USAID",
    "description": "\"So this is a disaster, not just from a humanitarian standpoint, from the standpoint of all the beneficiaries who may, in fact, die because they won't have access to U.S. resources\"\nThe post Elon Musk Baselessly Accuses Samantha Power of Corruption After She …",
    "link": "https://www.mediaite.com/tv/elon-musk-baselessly-accuses-samantha-power-of-corruption-after-she-hammered-him-for-spreading-falsehoods-about-usaid/",
    "timestamp": "2025-02-10T21:41:15Z"
  },
  {
    "title": "Trump is expected to pardon former Illinois Gov. Rod Blagojevich",
    "description": "Trump commuted Blagojevich’s 14-year sentence in 2020. The former governor had served about 8 years on charges stemming from efforts to sell Obama’s Senate seat.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-expected-pardon-former-illinois-governor-rod-blagojevich-rcna191566",
    "timestamp": "2025-02-10T21:40:30Z"
  },
  {
    "title": "Trump removes Government Ethics Office director (Myah Ward/Politico)",
    "description": "Myah Ward / Politico:\nTrump removes Government Ethics Office director  —  It's the latest in Trump's efforts to remove people charged with oversight of his administration.  —  President Donald Trump has removed the director of the Office of Government Ethics,…",
    "link": "https://www.memeorandum.com/250210/p105",
    "timestamp": "2025-02-10T21:40:01Z"
  },
  {
    "title": "The next big robotaxi push is nearly here",
    "description": "Most Americans aren’t sold on driverless cars or robotaxis, but they’re coming anyways; Tesla (TSLA), Uber (UBER), and Lyft (LYFT) are betting on it.Read more...",
    "link": "https://qz.com/robotaxi-tesla-uber-lyft-waymo-mobileye-texas-1851759608",
    "timestamp": "2025-02-10T21:40:00Z"
  },
  {
    "title": "Berlin film festival to try to keep politics at bay",
    "description": "The Berlin Film Festival, which begins this week, is set for a challenge faced by the entire Western arts industry: how to stop politics from taking over the conversation. The first major European film festival of the year saw its 2024 edition overshadowed by…",
    "link": "https://japantoday.com/category/entertainment/berlin-film-festival-to-try-to-keep-politics-at-bay",
    "timestamp": "2025-02-10T21:38:56Z"
  },
  {
    "title": "Dem Rep Offers No Proof After Claiming DOGE Will Yank Teachers From Classrooms During Six-Minute Gripe Session",
    "description": "Rosa DeLauro accused DOGE of seeking to yank teachers from classrooms while fuming for six minutes.",
    "link": "https://dailycaller.com/2025/02/10/delauro-doge-elon-musk-teachers-education-department/",
    "timestamp": "2025-02-10T21:38:54Z"
  },
  {
    "title": "AFSCME's Saunders: Workers and Communities Are Paying the Price of the Administration Dismantling Federal Agencies",
    "description": "AFSCME President Lee Saunders released the following statement after AFSCME members at the U.S. Department of Agriculture were placed on administrative leave to be furloughed: “Federal workers and America’s communities are starting to pay the price of Elon Mu…",
    "link": "https://www.commondreams.org/newswire/afscme-s-saunders-workers-and-communities-are-paying-the-price-of-the-administration-dismantling-federal-agencies",
    "timestamp": "2025-02-10T21:38:26Z"
  },
  {
    "title": "DeepSeek Is Just The Beginning Of The AI Race",
    "description": "DeepSeek is the beginning of a marathon race for AI dominance. While it immediately impacted companies like NVIDIA, we don't know the long-term consequences.",
    "link": "https://www.forbes.com/sites/joemoglia/2025/02/10/deepseek-is-just-the-beginning-of-the-ai-race/",
    "timestamp": "2025-02-10T21:36:44Z"
  },
  {
    "title": "Ishiba's approval rate rises 5 points to 44%, NHK poll shows",
    "description": "Japanese Prime Minister Shigeru Ishiba's cabinet approval rate rose 5 points from the previous month to 44% in a February 7-9 poll, recovering to the highest level since his October inauguration, public broadcaster NHK reported on Monday. Ishiba held his firs…",
    "link": "https://japantoday.com/category/politics/japan-pm-ishiba%27s-approval-rate-rises-5-points-to-44-nhk-poll-shows",
    "timestamp": "2025-02-10T21:36:17Z"
  },
  {
    "title": "VOA Persian: With no new nuclear deal, Iran to remain under maximum pressure, US says",
    "description": "The restored maximum pressure campaign on Iran will continue if it does not want a new nuclear deal, the ‌State Department said, while reiterating Washington’s commitment to preventing Iran from acquiring a nuclear weapon. \n\n\n“If the Iranian regime does not w…",
    "link": "https://www.voanews.com/a/voa-persian-with-no-new-nuclear-deal-iran-to-remain-under-maximum-pressure-us-says/7969927.html",
    "timestamp": "2025-02-10T21:36:06Z"
  },
  {
    "title": "China complains to Japan about 'negative' China references in Japan, US communique",
    "description": "China's foreign ministry said on Monday it had complained to Japan over &quot;negative&quot; references to China in a statement issued after a meeting between the leaders of Japan and the United States. The &quot;stern representations&quot; and &quot;strong d…",
    "link": "https://japantoday.com/category/politics/china-complains-to-japan-about-%27negative%27-china-references-in-japan-us-communique",
    "timestamp": "2025-02-10T21:35:56Z"
  },
  {
    "title": "Illegal alien charged in Massachusetts shop owner murder released under Biden",
    "description": "An illegal alien from the Dominican Republic has been charged with the home invasion murder of a Massachusetts sandwich shop owner named Ilias \"Louie\" Mavros.",
    "link": "https://www.foxnews.com/us/illegal-alien-charged-sandwich-shop-owners-murder-caught-released-us-under-biden-ice",
    "timestamp": "2025-02-10T21:35:50Z"
  },
  {
    "title": "Federal judge says Trump administration violated court order in funds freeze litigation",
    "description": "Judge John McConnell ordered the government to restore frozen funds while citing a Supreme Court case about contempt for noncompliance with court orders.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/judge-trump-violated-funding-freeze-order-appeal-rcna191533",
    "timestamp": "2025-02-10T21:35:32Z"
  },
  {
    "title": "Japan says it will watch U.S. moves over ICC, but stops short of criticism",
    "description": "Japan said Monday it will carefully monitor developments related to the International Criminal Court after U.S. President Donald Trump signed an executive order sanctioning the court's officials over what he described as illegitimate acts targeting the United…",
    "link": "https://japantoday.com/category/politics/japan-says-to-watch-u.s.-moves-over-icc-stops-short-of-criticism",
    "timestamp": "2025-02-10T21:35:26Z"
  },
  {
    "title": "Track's proposed eligibility, transgender rules would completely ban Semenya and others",
    "description": "Track and field moved toward adopting rules that would place athletes assigned female at birth but have higher testosterone levels, like Caster Semenya, under the same set of rules as transgender athletes who were born male and transitioned to female. World A…",
    "link": "https://japantoday.com/category/sports/track%27s-proposed-eligibility-transgender-rules-would-completely-ban-semenya-and-others",
    "timestamp": "2025-02-10T21:35:02Z"
  },
  {
    "title": "Elon Musk Keeps Boosting White Nationalists on X (Noah Lanard/Mother Jones)",
    "description": "Noah Lanard / Mother Jones:\nElon Musk Keeps Boosting White Nationalists on X  —  One user Musk amplified frequently attacks Black people and has said he is “impressed” by the Holocaust.  —  In the three weeks since Donald Trump took office, Elon Musk has post…",
    "link": "https://www.memeorandum.com/250210/p103",
    "timestamp": "2025-02-10T21:35:00Z"
  },
  {
    "title": "Tiger Woods withdraws from his signature event as he processes death of his mother",
    "description": "Tiger Woods abruptly withdrew from the Genesis Invitational at Torrey Pines on Monday, saying he was still processing the death of his mother. Kultida Woods died unexpectedly last Tuesday at the age of 80. “I planned to tee it up this week, but I’m just not r…",
    "link": "https://japantoday.com/category/sports/tiger-woods-withdraws-from-his-signature-event-as-he-processes-death-of-his-mother",
    "timestamp": "2025-02-10T21:34:53Z"
  },
  {
    "title": "Judge Extends Block Of Trump's Federal Worker Buyout Program",
    "description": "The Trump administration's plan to downsize the federal government workforce through a massive buyout hit another delay Monday when a judge issued a temporary restraining order against the program.",
    "link": "https://www.ibtimes.com/judge-extends-block-trumps-federal-worker-buyout-program-3763175",
    "timestamp": "2025-02-10T21:34:17Z"
  },
  {
    "title": "Iranians mark anniversary of the 1979 Islamic Revolution",
    "description": "Tens of thousands of Iranians marked the anniversary of the country's 1979 Islamic Revolution, the first such rally since President Donald Trump returned to the White House and restarted his “maximum pressure” campaign targeting Tehran.  The annual commemorat…",
    "link": "https://japantoday.com/category/world/with-trump-in-the-white-house-iranians-mark-the-anniversary-of-the-1979-islamic-revolution",
    "timestamp": "2025-02-10T21:33:41Z"
  },
  {
    "title": "Vance makes his debut as VP on international stage at high-stakes AI summit in Paris",
    "description": "JD Vance stepped onto the world stage this week for the first time as U.S. vice president, using a high-stakes AI summit in Paris and a security conference in Munich to amplify Donald Trump’s aggressive new approach to diplomacy. The 40-year-old vice presiden…",
    "link": "https://japantoday.com/category/world/high-stakes-ai-summit-in-paris-world-leaders-tech-titans-and-challenging-diplomatic-talks",
    "timestamp": "2025-02-10T21:33:26Z"
  },
  {
    "title": "Trump's latest tariff plans on steel, aluminum and other imports are spreading uncertainty",
    "description": "President Donald Trump plans to on Monday formally announce 25% tariffs on steel and aluminum imports as part of an aggressive effort to remake the existing terms of world trade that so far has compounded economic uncertainty. Trump also intends this week to …",
    "link": "https://japantoday.com/category/world/trump%27s-latest-tariff-plans-on-steel-aluminum-and-other-imports-are-spreading-uncertainty",
    "timestamp": "2025-02-10T21:33:00Z"
  },
  {
    "title": "Newell Brands Says Car Seats May Get Pricier Under China Tariffs",
    "description": "Newell Brands Inc., which owns the Graco brand of baby gear, says child car seats may get more expensive this spring and summer due to tariffs on goods imported from China.",
    "link": "https://financialpost.com/pmn/business-pmn/newell-brands-says-car-seats-may-get-pricier-under-china-tariffs",
    "timestamp": "2025-02-10T21:32:44Z"
  },
  {
    "title": "Judge keeps block on Trump’s offer of mass buyouts for US federal workers - NewsBreak",
    "description": "Federal employees claim in lawsuit ‘deferred resignation’ program is illegal because Congress has not approved it",
    "link": "https://www.newsbreak.com/share/3800331614133-judge-keeps-block-on-trump-s-offer-of-mass-buyouts-for-us-federal-workers?_f=app_share&amp;pd=0DFmeikD&amp;lang=en_US&amp;send_time=1739223078&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.6.0.7%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_blend_exp_25q1-v1%2Cns_foryou_recall_exp_25q1-v3%2Cns_foryou_rank_exp_25q1-v8%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_model_exp_25q1-v7&amp;s=i2",
    "timestamp": "2025-02-10T21:32:23Z"
  },
  {
    "title": "Hamas says it will delay the release of more hostages, putting Gaza ceasefire at risk",
    "description": "Hamas said Monday it will delay the further release of hostages in the Gaza Strip after accusing Israel of violating a fragile ceasefire that now faces its most serious crisis since it began three weeks ago. Prime Minister Benjamin Netanyahu is under heavy pr…",
    "link": "https://japantoday.com/category/world/hamas-accuses-israel-of-ceasefire-violations-and-says-it-will-delay-next-release-of-hostages",
    "timestamp": "2025-02-10T21:32:23Z"
  },
  {
    "title": "USAID is stripped of its lease and staffers turned away from DC headquarters",
    "description": "Officials and federal officers turned away scores of U.S. Agency for International Development staffers who showed up for work Monday at its Washington headquarters, after a court temporarily blocked a Trump administration order that would have pulled all but…",
    "link": "https://japantoday.com/category/world/usaid-is-stripped-of-its-lease-and-staffers-turned-away-from-dc-headquarters",
    "timestamp": "2025-02-10T21:32:05Z"
  },
  {
    "title": "Trump administration shuts CFPB HQ, halts agency’s activity",
    "description": "President Donald Trump’s administration has shuttered the headquarters of the Consumer Financial Protection Bureau (CFPB) and ordered the watchdog agency to stop nearly all of its work. On Saturday, CFPB chief Russell Vought sent the directive to the agency’s…",
    "link": "https://biztoc.com/x/981489eb7ba09dd3",
    "timestamp": "2025-02-10T21:31:58Z"
  },
  {
    "title": "Inside Trump and Musk’s War on the Consumer Financial Protection Bureau",
    "description": "Donald Trump and Elon Musk’s effort to dismantle the financial watchdog is riven with conflicts of interest.",
    "link": "http://www.rollingstone.com/politics/politics-features/trump-musk-cfpb-consumer-financial-protection-bureau-1235262743/",
    "timestamp": "2025-02-10T21:31:56Z"
  },
  {
    "title": "Donald Trump Declines to Endorse JD Vance as 2028 Republican 'Successor'",
    "description": "President Donald Trump told Fox News' Bret Baier that it's \"too early\" to endorse Vice President JD Vance as his Republican successor.\nWhen asked by Baier if he views Vance as his \"successor\" and the Republican nominee in 2028, Trump said, \"No, but he's very …",
    "link": "https://biztoc.com/x/b68341265cfb365e",
    "timestamp": "2025-02-10T21:31:55Z"
  },
  {
    "title": "Republican Change Tune on Elon Musk, But Not Tesla",
    "description": "\"No bigger obstacle exists to mass EV adoption than the 'Red Wall,'\" veteran Republican strategist Mike Murphy said in a new report.",
    "link": "https://www.newsweek.com/republican-change-tune-elon-musk-not-tesla-2029028",
    "timestamp": "2025-02-10T21:31:54Z"
  },
  {
    "title": "Trump says there will be no right of return for Palestinians in Gaza under his plan for U.S. 'ownership'",
    "description": "U.S. President Donald Trump said Palestinians in Gaza would not have a right to return under his plan for U.S. “ownership” of the war-torn territory, contradicting other officials in his administration who have sought to argue Trump was only calling for the t…",
    "link": "https://japantoday.com/category/world/trump-says-no-right-of-return-for-palestinians-in-gaza-under-his-plan-for-us-%27ownership%27",
    "timestamp": "2025-02-10T21:31:46Z"
  },
  {
    "title": "Trump administration ordered to restore all frozen federal spending",
    "description": "Feb 10 (Reuters) - A U.S. judge on Monday ordered the Trump administration to fully comply with a previous order lifting its broad freeze on federal spending, after a group of 23 Democratic state attorneys general last week said that some funds remained froze…",
    "link": "https://freerepublic.com/focus/f-news/4296527/posts",
    "timestamp": "2025-02-10T21:31:31Z"
  },
  {
    "title": "The best way to fight Trump’s tariffs is through our carbon tax",
    "description": "Hugo Cordeau is a doctoral candidate in economics at the University of Toronto.\nBarely a week after the United States paused tariffs against Canada, President Donald Trump is already talking about new duties on steel and aluminum. There is every likelihood th…",
    "link": "https://biztoc.com/x/9116a9c333e06c81",
    "timestamp": "2025-02-10T21:31:26Z"
  },
  {
    "title": "Ticker: McDonald’s improving global sales help to offset US weakness; Wall Street takes Trump’s latest tariff threats in stride",
    "description": "Ticker: McDonald's improving global sales help to offset US weakness; Wall Street takes Trump's latest tariff threats in stride",
    "link": "https://www.bostonherald.com/2025/02/10/ticker-mcdonalds-improving-global-sales-help-to-offset-us-weakness-wall-street-takes-trumps-latest-tariff-threats-in-stride/",
    "timestamp": "2025-02-10T21:30:45Z"
  },
  {
    "title": "Member of Kendrick Lamar's Super Bowl halftime show won't face charges for flag protest",
    "description": "New Orleans Police say they won't file charges against the cast member who displayed the Palestinian flag with the word “GAZA\" in protest during Kendrick Lamar's Super Bowl halftime show.",
    "link": "https://www.news4jax.com/entertainment/2025/02/10/member-of-kendrick-lamars-super-bowl-halftime-show-wont-face-charges-for-flag-protest/",
    "timestamp": "2025-02-10T21:30:41Z"
  },
  {
    "title": "Bitcoin increasingly treated as risk-on asset rather than pure store of value – Bitfinex",
    "description": "Bitcoin’s (BTC) market behavior continues to evolve, with recent trends suggesting it is being treated more as a risk-on asset than a traditional store of value, according to a new report from Bitfinex.  Bitcoin’s price has remained in a consolidation range b…",
    "link": "https://cryptoslate.com/bitcoin-increasingly-treated-as-risk-on-asset-rather-than-pure-store-of-value-bitfinex/",
    "timestamp": "2025-02-10T21:30:04Z"
  },
  {
    "title": "Sebastian Stan Recalls Early Reactions to ‘The Apprentice’: ‘You’re Never Going to Win Anything for This’",
    "description": "Best Actor nominee Sebastian Stan, at Santa Barbara for the Virtuosos Awards, recalled some of the frank feedback he received as he was trying to get \"The Apprentice\" into theaters.",
    "link": "https://www.indiewire.com/news/festivals/sebastian-stan-the-apprentice-reaction-never-going-to-win-1235093658/",
    "timestamp": "2025-02-10T21:30:00Z"
  },
  {
    "title": "Warren Says Trump and Musk Pushing to Gut CFPB as 'Payoff to the Rich Guys'",
    "description": "As the Consumer Financial Protection Bureau's website went dark and its offices were shuttered on Monday, with the agency's chief operating officer telling staff it would be shut down for the week, U.S. Sen. Elizabeth Warren was among the progressive leaders …",
    "link": "https://www.commondreams.org/news/elizabeth-warren-cfpb",
    "timestamp": "2025-02-10T21:29:56Z"
  },
  {
    "title": "Pentagon to ban trans people from joining military, pauses gender-transition procedures",
    "description": "The U.S. military will no longer allow transgender individuals to join the military and will stop performing or facilitating procedures associated with gender transition for service members, according to a memo from Defense Secretary Pete Hegseth.",
    "link": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/pentagon-ban-trans-people-joining-military-pauses-gender-transition-pr-rcna191569",
    "timestamp": "2025-02-10T21:29:26Z"
  },
  {
    "title": "Donald Trump Declines to Endorse JD Vance as 2028 Republican 'Successor'",
    "description": "In a preview segment of his Super Bowl interview that is set to air tonight, Trump declined to endorse Vance in 2028.",
    "link": "https://www.newsweek.com/donald-trump-declines-endorse-jd-vance-2028-successor-2029106",
    "timestamp": "2025-02-10T21:28:32Z"
  },
  {
    "title": "We Need USAID To Compete With China | Opinion",
    "description": "Upholding global stability—and preventing it from falling into the Chinese Communist Party's hands—is American.",
    "link": "https://www.newsweek.com/we-need-usaid-compete-china-opinion-2028966",
    "timestamp": "2025-02-10T21:28:15Z"
  },
  {
    "title": "Whoops! Democrats End Up Helping Trump’s Deportations After All",
    "description": "After a Democrat-controlled Congress voted to supersize the IRS by billions of more dollars, President Donald Trump may now be using that move to his advantage.",
    "link": "https://dailycaller.com/2025/02/10/irs-agents-to-deport-illegal-migrants/",
    "timestamp": "2025-02-10T21:27:46Z"
  },
  {
    "title": "Almost all nations miss U.N. deadline for new climate targets",
    "description": "Nearly all nations missed a U.N. deadline Monday to submit new targets for slashing carbon emissions, including major economies under pressure to show leadership following the U.S. retreat on climate change. Just 10 of nearly 200 countries required under the …",
    "link": "https://japantoday.com/category/features/environment/almost-all-nations-miss-un-deadline-for-new-climate-targets",
    "timestamp": "2025-02-10T21:27:31Z"
  },
  {
    "title": "How the Trump administration moved to shut down the consumer protection agency’s headquarters",
    "description": "Over the weekend, some staff members at the Consumer Financial Protection Bureau saw a sign of trouble to come.",
    "link": "https://www.pbs.org/newshour/politics/how-the-trump-administration-moved-to-shut-down-the-consumer-protection-agencys-headquarters",
    "timestamp": "2025-02-10T21:27:24Z"
  },
  {
    "title": "Ex-Ohio State coach Tressel joins list of sports figures who've moved into politics",
    "description": "Former Ohio State University coach Jim Tressel is being nominated to be the state’s next lieutenant governor",
    "link": "https://abcnews.go.com/US/wireStory/ohio-state-coach-jim-tressel-joins-long-list-118664367",
    "timestamp": "2025-02-10T21:26:07Z"
  },
  {
    "title": "Hot mic shocker: Justin Trudeau warns Donald Trump’s Canada takeover talk isn’t just rhetoric but real",
    "description": "In a latest development, renowned personality Justin Trudeau issued a severe warning regarding the Canada takeover of US President Donald Trump and then claimed that is not just a rhetoric but is actually something real.",
    "link": "https://economictimes.indiatimes.com/news/international/us/hot-mic-shocker-justin-trudeau-warns-donald-trumps-canada-takeover-talk-isnt-just-rhetoric-but-real/articleshow/118127516.cms",
    "timestamp": "2025-02-10T21:21:52Z"
  },
  {
    "title": "DOGE focuses on millions in migrant hotels billed to US taxpayers as DHS Sec. Noem targets key agency",
    "description": "Elon Musk suggested that FEMA, the government's federal disaster relief agency, spent millions on hotels for illegal immigrants just last week.",
    "link": "https://www.foxnews.com/politics/doge-focuses-millions-migrant-hotels-billed-us-taxpayers-dhs-sec-noem-targets-key-agency",
    "timestamp": "2025-02-10T21:21:49Z"
  },
  {
    "title": "11 Signs That A Recession In The U.S. May Have Already Started",
    "description": "The Biden administration has given us an economy in which homelessness is at an all-time high, demand at food banks is at an all-time high, and poverty is growing all around us.  The rising cost of living is absolutely crushing households throughout the natio…",
    "link": "http://theeconomiccollapseblog.com/11-signs-that-a-recession-in-the-u-s-may-have-already-started/",
    "timestamp": "2025-02-10T21:21:36Z"
  },
  {
    "title": "Elon Musk and investors offering $97.4 billion for control of OpenAI, WSJ reports",
    "description": "According to the Wall Street Journal, Elon Musk and a group of investors are offering $97.4 billion to take control of OpenAI.",
    "link": "https://www.cnbc.com/2025/02/10/musk-and-investors-offering-97point4-billion-for-control-of-openai-wsj.html",
    "timestamp": "2025-02-10T21:21:11Z"
  },
  {
    "title": "Israel, Hamas trade accusations",
    "description": "Israel and Hamas accused each other of violating the terms of a ceasefire deal agreed to last month, raising concerns over the durability of the truce about half way through the initial six-week period.",
    "link": "https://www.bostonherald.com/2025/02/10/israel-hamas-trade-accusations/",
    "timestamp": "2025-02-10T21:20:56Z"
  },
  {
    "title": "Two things about this picture: 1. Why are they all in the same bathroom at once? 2. I didn't expect Nancy Pelosi to have a reflection.",
    "description": null,
    "link": "https://freerepublic.com/focus/f-chat/4296526/posts",
    "timestamp": "2025-02-10T21:20:52Z"
  },
  {
    "title": "Will Trump Invite Philadelphia Eagles to the White House?",
    "description": "President Donald Trump became the first president in office to attend a Super Bowl on Sunday. #superbowl #philadelphia #philadelphiaeagles #politics \nAfter flying from Florida to New Orleans, the Republican president met with participants in the honorary coin…",
    "link": "https://biztoc.com/x/9e8ffa10286e5b78",
    "timestamp": "2025-02-10T21:20:51Z"
  },
  {
    "title": "Why Elon Musk is a preposterous choice to lead a Pentagon audit",
    "description": "Donald Trump says he wants an audit of the Department of Defense’s finances — and he’s sending a billionaire defense contractor?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/elon-musk-preposterous-choice-lead-pentagon-audit-rcna191559",
    "timestamp": "2025-02-10T21:20:39Z"
  },
  {
    "title": "Trump dismisses JD Vance as his potential successor",
    "description": "United States President Donald Trump stated that he does not see Vice President JD Vance as his successor in the 2028 presidential race.\"But he is very capable,\" Trump noted during his weekend sitdown...",
    "link": "https://biztoc.com/x/891e37642de555fa",
    "timestamp": "2025-02-10T21:20:29Z"
  },
  {
    "title": "FAA Makes It Official: Gulf of Mexico Is Now Gulf of America",
    "description": "The FAA announced on Monday it will change the Gulf of Mexico to the Gulf of America and Mount Denali to Mount McKinley.",
    "link": "https://www.newsweek.com/faa-gulf-america-mexico-denali-mckinley-donald-trump-2029093",
    "timestamp": "2025-02-10T21:20:08Z"
  },
  {
    "title": "US judge keeps his block on Trump federal buyout plan in place for now",
    "description": "BOSTON/WASHINGTON: A US judge kept his block on President Donald Trump's buyout plan for federal employees in place on Monday (Feb 10) and said he would consider imposing it for a longer period of time. The decision by US District Judge George O'Toole in Bost…",
    "link": "https://www.channelnewsasia.com/world/us-judge-keeps-his-block-trump-federal-buyout-plan-place-now-4929401",
    "timestamp": "2025-02-10T21:19:40Z"
  },
  {
    "title": "'Grim': Trump's revenge tour reportedly eyes another agency",
    "description": "President Donald Trump’s revenge campaign is now taking a swing through staff at the National Archives involved in the efforts to have government documents found at his Mar-a-Lago residence returned, according to Rolling Stone.That includes staffers who playe…",
    "link": "https://www.rawstory.com/trump-revenge-2671128500/",
    "timestamp": "2025-02-10T21:19:35Z"
  },
  {
    "title": "Here's what happened today: Monday",
    "description": "Man in custody for Stoneybatter attack, garda jailed for sexual assault and Hamas suspend hostage exchange with Israel",
    "link": "https://www.thejournal.ie/news-fix-monday-71-6619374-Feb2025/",
    "timestamp": "2025-02-10T21:19:34Z"
  },
  {
    "title": "Adams Told City Officials Not to Bash Trump or Interfere With ICE",
    "description": "Mayor Eric Adams reportedly told top New York City officials not to interfere in federal immigration actions and to avoid public conflict with Trump.",
    "link": "http://nymag.com/intelligencer/article/eric-adams-nyc-officials-criticism-trump-ice-enforcement.html",
    "timestamp": "2025-02-10T21:18:41Z"
  },
  {
    "title": "Elon Musk Offers to Buy OpenAI for $97.4 Billion in Unsolicited Bid: Report",
    "description": "The billionaire oligarch says he wants OpenAI to become a \"safety-focused force for good.\"",
    "link": "https://gizmodo.com/elon-musk-offers-to-buy-openai-for-97-4-billion-in-unsolicited-bid-report-2000561925",
    "timestamp": "2025-02-10T21:18:39Z"
  },
  {
    "title": "Trump's federal worker resignation deadline remains paused",
    "description": "Attorneys for the Trump administration and lawyers for a group of labor unions who filed a lawsuit faced off in a Boston courtroom on Monday.",
    "link": "https://www.businessinsider.com/donald-trump-elon-musk-doge-judge-paused-employee-buyout-offer-2025-2",
    "timestamp": "2025-02-10T21:18:27Z"
  },
  {
    "title": "It's Been Almost 3 Weeks Since Donald Trump Has Taken Office. Here's The Harsh Reality Of How Americans Are Feeling.",
    "description": "\"I understand now how Hitler rose to power. I feel like I'm screaming, and nobody is listening.\"",
    "link": "https://www.huffpost.com/entry/donald-trump-americans-opinion_n_67a62aa6e4b051fae0137d3a",
    "timestamp": "2025-02-10T21:14:18Z"
  },
  {
    "title": "Big Tech is still silent on Trump’s tariffs",
    "description": "President Donald Trump’s 10 percent tariff on goods imported from China has been in effect for nearly a week. Ahead of the tariff going into effect, I wrote that “Big Tech has been silent on Trump’s tariffs” — almost no one in the industry had a public reacti…",
    "link": "https://www.theverge.com/news/609494/trump-tariffs-big-tech-silent-automakers",
    "timestamp": "2025-02-10T21:13:45Z"
  },
  {
    "title": "Donald Trump Calls Kennedy Center Shows “Terrible,” But Admits He’s Never Seen One; Biden-Appointed Board Members Removed From Roster",
    "description": "Donald Trump’s move to fire about half of the board of the Kennedy Center was reflected in the arts organization’s roster, with a list of Joe Biden-appointees no longer named as trustees. Also missing was the center’s chairman, philanthropist David Rubenstein…",
    "link": "http://deadline.com/2025/02/trump-kennedy-center-board-2-1236284599/",
    "timestamp": "2025-02-10T21:13:03Z"
  },
  {
    "title": "At least $570 million in federal funding for Colorado still in limbo amid Trump freeze, officials say",
    "description": "Hundreds of millions of dollars in federal funding tapped for Colorado climate and health projects is still being withheld by the Trump administration, state and federal officials say.",
    "link": "https://www.denverpost.com/2025/02/10/donald-trump-spending-freeze-colorado-impact-energy/",
    "timestamp": "2025-02-10T21:12:47Z"
  },
  {
    "title": "CFPB Workers Protest Elon Musk Outside Bureau Headquarters: 'Arrest Elon'",
    "description": "Around 100 Consumer Finance Protection Bureau workers protested outside the agency's headquarters on Saturday.\nThe post CFPB Workers Protest Elon Musk Outside Bureau Headquarters: ‘Arrest Elon’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/02/10/cfpb-workers-protest-elon-musk-bureau-headquarters-arrest-elon/",
    "timestamp": "2025-02-10T21:12:45Z"
  },
  {
    "title": "Judge keeps block on Trump’s offer of mass buyouts for US federal workers - NewsBreak",
    "description": "Federal employees claim in lawsuit ‘deferred resignation’ program is illegal because Congress has not approved it",
    "link": "https://www.newsbreak.com/share/3800331614133-judge-keeps-block-on-trump-s-offer-of-mass-buyouts-for-us-federal-workers?s=a2&amp;share_destination_id=MTkwNzI4MDIzLTE3MzkyMjE4NzA5MTE%3D&amp;pd=0CuH4Rl4&amp;hl=en_US&amp;send_time=1739221870&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.6.1%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q1-v1%2Cns_push_exp_rt_bucketv12-v8%2Cns_foryou_blend_exp_25q1-v8%2Cns_foryou_model_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v6",
    "timestamp": "2025-02-10T21:12:25Z"
  },
  {
    "title": "Sam Altman-Elon Musk Feud Timeline: Musk Reportedly Bids $94.7 Billion For Altman’s OpenAI",
    "description": "Altman and Musk were OpenAI’s founding co-chairs in 2015, but their relationship has devolved into name-calling, lawsuits and now a near $100 billion bid from Musk for OpenAI.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/02/10/sam-altman-elon-musk-feud-timeline-musk-reportedly-bids-947-billion-for-altmans-openai/",
    "timestamp": "2025-02-10T21:11:01Z"
  },
  {
    "title": "Coty’s Sales Decline in Q2 Amid Weak Demand in Asia and Tight Inventory Management Despite Strong Fragrance Performance",
    "description": "Coty Q2 2025 earnings are in: Revenue falls 3 percent, impacted by weak demand in Asia and a slowing mass market.",
    "link": "http://wwd.com/beauty-industry-news/beauty-features/cotys-sales-decline-q2-1236921506/",
    "timestamp": "2025-02-10T21:10:00Z"
  },
  {
    "title": "Gold Hits New Record: Trump's Tariffs, Inflation Fears Drive Safe Haven Surge",
    "description": "Gold is up 44% over the last year, outpacing the S&P 500’s 25% return even in a bull market for stocks.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/02/10/gold-hits-new-record-trumps-tariffs-inflation-fears-drive-safe-haven-surge/",
    "timestamp": "2025-02-10T21:09:47Z"
  },
  {
    "title": "Ex-Ukrainian FM tells old colleagues to fear for their lives",
    "description": "Dmitry Kuleba has warned that Ukrainian officials who agree to give up territory to Russia will face either death or political ruin Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/612480-kuleba-fear-lives-ukraine/",
    "timestamp": "2025-02-10T21:09:42Z"
  },
  {
    "title": "Pentagon bans transgender people from joining the military",
    "description": "The U.S. military will no longer allow transgender individuals to join the military and will stop performing or facilitating procedures associated with gender transition for service members, according to a memo from Defense Secretary Pete Hegseth filed in cou…",
    "link": "https://biztoc.com/x/db1492b1045ff3fe",
    "timestamp": "2025-02-10T21:09:42Z"
  },
  {
    "title": "Trump Declines to Name JD Vance His Successor in Stunning Moment During Fox News Interview: ‘You Have a Lot of Very Capable People’",
    "description": "President Donald Trump pointedly declined to name Vice President JD Vance as his preferred successor during a sit down with Fox News' Bret Baier.\nThe post Trump Declines to Name JD Vance His Successor in Stunning Moment During Fox News Interview: ‘You Have a …",
    "link": "https://www.mediaite.com/news/trump-declines-to-name-jd-vance-his-successor-in-stunning-moment-during-fox-news-interview-you-have-a-lot-of-very-capable-people/",
    "timestamp": "2025-02-10T21:09:36Z"
  },
  {
    "title": "'We need to hit back hard': Tariffs would put steel and aluminum sector in familiar predicament",
    "description": "United States President Donald Trump is set to announce 25 per cent tariffs on aluminum and steel imports from all countries, replicating a policy move he used in his first term against Canada with mixed results.\nNow, insiders in those sectors are hoping to d…",
    "link": "https://biztoc.com/x/db3cf7e1d5778a53",
    "timestamp": "2025-02-10T21:09:32Z"
  },
  {
    "title": "'I'm Asking Trump Himself To Relocate Us': Gazan Citizens Say They Want Out",
    "description": "As President Donald Trump moves forward with his plan to \"own\" Gaza and relocate its inhabitants, some citizens of the war-torn strip are expressing an eagerness to leave, citing a desolate living situation and an eagerness to live in \"a country where you can…",
    "link": "https://freebeacon.com/israel/im-asking-trump-himself-to-relocate-us-gazan-citizens-say-they-want-out/",
    "timestamp": "2025-02-10T21:09:18Z"
  },
  {
    "title": "Vance triggers Dems by defending Trump's executive authority",
    "description": "Judges across the country took action to block President Donald Trump’s agenda. Vance created a social media frenzy on Sunday for supporting Trump’s executive authority.",
    "link": "https://www.foxnews.com/politics/vance-triggers-dems-defending-trumps-executive-authority",
    "timestamp": "2025-02-10T21:07:44Z"
  },
  {
    "title": "Trump says no right of return for Palestinians under his plan",
    "description": "President Donald Trump said Palestinians in Gaza would not have a right to return under his plan for U.S. \"ownership\" of the war-torn territory, contradicting other officials in his administration who have sought to argue Trump was only calling for the tempor…",
    "link": "https://www.bostonherald.com/2025/02/10/trump-says-no-right-of-return-for-palestinians-under-his-plan/",
    "timestamp": "2025-02-10T21:03:11Z"
  },
  {
    "title": "HPE is notifying individuals affected by a December 2023 attack",
    "description": "Hewlett Packard Enterprise (HPE) has begun notifying individuals affected by a December 2023 attack carried out by Russia-linked threat actors. Hewlett Packard Enterprise has started notifying individuals whose personal information was exposed in a December 2…",
    "link": "https://securityaffairs.com/174057/data-breach/hpe-notifying-individuals-impacted-by-december-2023-attack.html",
    "timestamp": "2025-02-10T21:03:09Z"
  }
]