[
  {
    "title": "Trump, 79, Crashes Wedding to Ramble About Heaven",
    "description": "President Donald Trump crashed a wedding taking place at his Mar-a-Lago resort on Friday to lecture the happy couple on how he might connive his way through ...",
    "link": "https://www.thedailybeast.com/donald-trump-79-crashes-wedding-to-ramble-about-heaven/",
    "timestamp": "2025-11-16T02:59:04Z"
  },
  {
    "title": "Trump Buys At Least $82 Million In Bonds Since Late August, Disclosures Show",
    "description": "According to the forms released by the U.S. Office of Government Ethics, Trump carried out more than 175 financial purchases from August 28 through October 2.",
    "link": "https://www.huffpost.com/entry/trump-buys-82-million-bonds-since-late-august-disclosures-show_n_69193565e4b0b43a45c0bb78",
    "timestamp": "2025-11-16T02:44:07Z"
  },
  {
    "title": "Donald Trump Discloses $82 Million In Bond Purchases Since August: Report",
    "description": "US President Donald Trump has acquired at least $82 million worth of corporate and municipal bonds between late August to early October, according to financial disclosures released Saturday by the U.S. Office of Government Ethics. Reuters reports that Trump b…",
    "link": "https://www.ndtvprofit.com/business/donald-trump-discloses-millions-in-bond-purchases-including-sectors-benefitting-from-his-policies",
    "timestamp": "2025-11-16T02:34:35Z"
  },
  {
    "title": "Trump vows to sue BBC for $5B over edited speech: They cheated",
    "description": "Trump vows to sue the BBC for up to $5B over a misleading edit of his Jan. 6 speech. The BBC apologized but denied defamation.",
    "link": "https://www.israelnationalnews.com/news/417826",
    "timestamp": "2025-11-16T02:31:13Z"
  },
  {
    "title": "Last US pennies could fetch up to $5 million after mint shuts down production: experts",
    "description": "Coin experts estimate the last pennies minted Wednesday could sell for as much as $5 million each when they hit the auction block.",
    "link": "https://nypost.com/2025/11/15/us-news/last-us-pennies-could-fetch-up-to-5m-after-mint-shuts-down-production/",
    "timestamp": "2025-11-16T02:11:13Z"
  },
  {
    "title": "Hunter Biden Analyzes the Difference Between Hitler and ‘White Nationalist’ Trump: Hitler Had an ‘Ideology’",
    "description": "The big difference between Donald Trump and Adolf Hitler, according to Hunter Biden? Hitler had an \"ideology,\" whereas Trump is just \"purely corrupt\"\nThe post Hunter Biden Analyzes the Difference Between Hitler and ‘White Nationalist’ Trump: Hitler Had an ‘Id…",
    "link": "https://www.mediaite.com/politics/hunter-biden-analyzes-the-difference-between-hitler-and-white-nationalist-trump-hitler-had-an-ideology/",
    "timestamp": "2025-11-16T02:11:07Z"
  },
  {
    "title": "Americans still struggling after weeks without federal food aid: \"It's either food or lights\"",
    "description": "Economic promises helped Donald Trump get re-elected. Now, he has an affordability problem, and his administration is facing backlash from consumers over the cost of living. Ali Bauman has more on efforts to bring relief.",
    "link": "https://biztoc.com/x/c84416f3e1af7223",
    "timestamp": "2025-11-16T02:02:54Z"
  },
  {
    "title": "Laura Loomer teases Georgia move after President Trump says he wants Marjorie Taylor Greene primaried",
    "description": "Laura Loomer hints at Georgia move after Trump withdraws support for Marjorie Taylor Greene, sparking speculation about potential 2026 primary challenge.",
    "link": "https://www.foxnews.com/politics/laura-loomer-teases-georgia-move-president-trump-says-wants-marjorie-taylor-greene-primaried",
    "timestamp": "2025-11-16T02:01:52Z"
  },
  {
    "title": "Immigration ‘surge’ begins in Charlotte; Guard pulls back in two cities",
    "description": "Federal law enforcement officials were sent to North Carolina’s largest city, while many National Guard members deployed to Chicago and Portland are being sent home.The Department of Homeland Security has begun law enforcement operations in Charlotte, federal…",
    "link": "https://freerepublic.com/focus/f-news/4352752/posts",
    "timestamp": "2025-11-16T01:56:46Z"
  },
  {
    "title": "Trump says stopping suspected drug boats doesn't work, but U.S. reports record cocaine seizures",
    "description": "In justifying American military strikes on boats suspected of smuggling drugs, President Donald Trump has asserted that the longtime U.S. strategy of interdicting such vessels at sea has been a major failure. “We’ve been doing that for 30 years,” he said last…",
    "link": "https://japantoday.com/category/world/trump-says-stopping-suspected-drug-boats-doesn%27t-work.-but-the-us-reports-record-cocaine-seizures",
    "timestamp": "2025-11-16T01:56:27Z"
  },
  {
    "title": "Americans still struggling after weeks without federal food aid: \"It's either food or lights\"",
    "description": "Economic promises helped Donald Trump get re-elected. Now, he has an affordability problem, and his administration is facing backlash from consumers over the cost of living. Ali Bauman has more on efforts to bring relief.",
    "link": "https://www.cbsnews.com/video/americans-still-struggling-after-weeks-without-federal-food-aid-either-food-lights/",
    "timestamp": "2025-11-16T01:51:00Z"
  },
  {
    "title": "Trump buys at least $82 million in bonds since late August, disclosures show",
    "description": "President Donald Trump invested over 82 million dollars in bonds. These purchases included corporate and municipal bonds. Investments spanned sectors that benefit from his administration's policies. Financial disclosures revealed these transactions. The perio…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-buys-at-least-82-million-in-bonds-since-late-august-disclosures-show/articleshow/125358441.cms",
    "timestamp": "2025-11-16T01:34:57Z"
  },
  {
    "title": "Marjorie Taylor Greene says she’s had ‘warnings for my safety’ after posts by Trump",
    "description": "One-time Maga loyalist diverges with Trump on issues including Epstein, so US president has withdrawn supportMarjorie Taylor Greene, a longtime Republican ally who previously fiercely defended Donald Trump and his Maga movement, said on Saturday she had been …",
    "link": "https://freerepublic.com/focus/f-news/4352749/posts",
    "timestamp": "2025-11-16T01:29:17Z"
  },
  {
    "title": "Trump issues two pardons related to Jan. 6 investigation",
    "description": "President Donald Trump has issued two pardons related to the investigation into the Jan. 6, 2021 riot, including for a woman convicted of threatening to shoot FBI agents.",
    "link": "https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation",
    "timestamp": "2025-11-16T01:26:43Z"
  },
  {
    "title": "Democratic Rep. Brad Sherman denies viewing pornography on flight after viral photos surface online",
    "description": "California congressman Brad Sherman faces viral backlash after photos appeared to show him viewing explicit images on tablet during flight, sparking social media controversy.",
    "link": "https://www.foxnews.com/politics/democratic-rep-brad-sherman-denies-viewing-pornography-flight-viral-photos-surface-online",
    "timestamp": "2025-11-16T01:26:09Z"
  },
  {
    "title": "Trump buys at least $82 million in bonds since late August, disclosures show (Nandita Bose/Reuters)",
    "description": "Nandita Bose / Reuters:\nTrump buys at least $82 million in bonds since late August, disclosures show  — Trump's new bond investments span several industries  — He acquired Intel bonds after government acquired a stake  —  U.S. President Donald Trump bought at…",
    "link": "https://www.memeorandum.com/251115/p62",
    "timestamp": "2025-11-16T01:25:01Z"
  },
  {
    "title": "MAGA rift grows as Trump feuds with Greene before key 2026 midterm elections",
    "description": "A significant rift has emerged between Donald Trump and Congresswoman Marjorie Taylor Greene.  Once allies, their relationship has soured with Greene criticizing Trump's focus on foreign policy. Trump has responded by threatening a primary challenge and using…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/maga-rift-grows-as-trump-feuds-with-greene-before-key-2026-midterm-elections/articleshow/125358342.cms",
    "timestamp": "2025-11-16T01:14:25Z"
  },
  {
    "title": "Admit It. Gavin Newsom Is the 2028 Front-runner.",
    "description": "For years, Democrats and pundits have rolled their eyes at Gavin Newsom. But he’s positioned better than anyone else for the future of politics.California Gov. Gavin Newsom speaks during a rally with Harris County Democrats at the IBEW local 716 union hall on…",
    "link": "https://freerepublic.com/focus/f-news/4352748/posts",
    "timestamp": "2025-11-16T01:11:10Z"
  },
  {
    "title": "Trump Diagnoses Seth Meyers With ‘Incurable Case’ of ‘Trump Derangement Syndrome’ After Epstein Barbs",
    "description": "President Donald Trump went off on NBC's Seth Meyers again on Saturday evening, diagnosing him with an \"incurable case\" of \"Trump Derangement Syndrome (TDS)\"\nThe post Trump Diagnoses Seth Meyers With ‘Incurable Case’ of ‘Trump Derangement Syndrome’ After Epst…",
    "link": "https://www.mediaite.com/media/news/trump-diagnoses-seth-meyers-with-incurable-case-of-trump-derangement-syndrome-after-epstein-barbs/",
    "timestamp": "2025-11-16T01:06:06Z"
  },
  {
    "title": "‘F*ck Donald Trump!’ Protestors Rage Against Trump’s Latest Immigration Crackdown in Charlotte",
    "description": "Protesters took to the streets of Charlotte, NC, Saturday as the Trump administration began its immigration crackdown in that democratically-led city.\nThe post ‘F*ck Donald Trump!’ Protestors Rage Against Trump’s Latest Immigration Crackdown in Charlotte firs…",
    "link": "https://www.mediaite.com/media/news/fck-donald-trump-protestors-rage-against-trumps-latest-immigration-crackdown-in-charlotte/",
    "timestamp": "2025-11-16T00:55:47Z"
  },
  {
    "title": "MSNBC Makes Name Change, Rebrands as MS NOW",
    "description": "The news outlet formerly known as MSNBC went through a rebranding and changed its name to MS NOW, as the company has reported it would be splitting off from its parent-company, Comcast NBCUniversal.\nThe post MSNBC Makes Name Change, Rebrands as MS NOW appeare…",
    "link": "https://www.breitbart.com/the-media/2025/11/15/msnbc-makes-name-change-rebrands-as-ms-now/",
    "timestamp": "2025-11-16T00:49:29Z"
  },
  {
    "title": "Breaking News Live Updates: Four killed, five injured in late-night road crash in J&K's Budgam",
    "description": "A late-night collision between a Tata Sumo and a dumper truck in Budgam district of Jammu and Kashmir left four people dead and five injured. The accident occurred around 10.30 pm at Palar.",
    "link": "https://m.economictimes.com/news/newsblogs/breaking-news-live-updates-srinagar-nowgam-police-station-budgam-accident-bihar-elections-delhi-blast-lal-quila-red-fort-terrorist-attack-ipl-retention-pm-modi-gujarat-visit-trump-us-india-trade-deal-russia-ukraine-war-november-16/liveblog/125358204.cms",
    "timestamp": "2025-11-16T00:47:50Z"
  },
  {
    "title": "White House fury at Trump 'monster' jibe in showpiece BBC lecture: US President 'dubbed a fascist' during flagship speech commissioned by broadcaster",
    "description": "The row between the BBC and Donald Trump has escalated further after it was revealed the broadcaster commissioned a fierce critic of the US President to deliver its flagship annual lectures.Dutch author Rutger Bregman used the high-profile events to draw para…",
    "link": "https://freerepublic.com/focus/f-news/4352746/posts",
    "timestamp": "2025-11-16T00:45:57Z"
  },
  {
    "title": "Trump buys at least $82 million in bonds since late August, disclosures show",
    "description": "WASHINGTON (Reuters) -U.S. President Donald Trump bought at least $82 million in corporate and municipal bonds from late August to early October including new investments in sectors benefiting from his policies, financial disclosures made public on Saturday s…",
    "link": "https://www.thestar.com.my/news/world/2025/11/16/trump-buys-at-least-82-million-in-bonds-since-late-august-disclosures-show",
    "timestamp": "2025-11-16T00:17:00Z"
  },
  {
    "title": "「いまの世論を物語っている」トランプ氏、アメフト観戦でブーイングの嵐。至近距離で\"中指\"を立てる若者も",
    "description": "Search, watch, and cook every single Tasty recipe and video ever - all in one place! News, Politics, Culture, Life, Entertainment, and more. Stories that matter to you.",
    "link": "https://www.buzzfeed.com/jp/natashajokic1/trump-booed-nfl-flub-1",
    "timestamp": "2025-11-16T00:12:47Z"
  },
  {
    "title": "'Uncontrollable rage': Trump calls for 'no talent' Seth Meyers to be fired after criticism",
    "description": "Donald Trump on Saturday declared war on yet another late-night TV host.The president over the weekend took to Truth Social, his own social media site, to rage against Seth Meyers.\"NBC’s Seth Meyers is suffering from an incurable case of Trump Derangement Syn…",
    "link": "https://www.rawstory.com/trump-biden-firing-federal-workers/",
    "timestamp": "2025-11-16T00:06:29Z"
  },
  {
    "title": "Australian foreign minister says US removal of beef tariffs a 'good thing'",
    "description": "SYDNEY (Reuters) -Foreign Minister Penny Wong said on Sunday that Australia welcomed U.S. President Donald Trump's rollback of tariffs on beef as a positive move for Australia's beef producers. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/11/16/australian-foreign-minister-says-us-removal-of-beef-tariffs-a-039good-thing039",
    "timestamp": "2025-11-16T00:06:00Z"
  },
  {
    "title": "Michelle Obama Shuts Down Presidential Run: ‘You’re Not Ready for a Woman’ | Video",
    "description": "The former First Lady shut down rumors she'll run for office while speaking to Tracee Ellis Ross earlier this month\nThe post Michelle Obama Shuts Down Presidential Run: ‘You’re Not Ready for a Woman’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/michelle-obama-shuts-down-presidential-run-video/",
    "timestamp": "2025-11-16T00:02:41Z"
  },
  {
    "title": "Comedian Jeff Dye joins Hollywood exodus, says LA fires were 'quite a wake-up call'",
    "description": "Comedian Jeff Dye joins celebrity exodus from Los Angeles, citing fears about Governor Gavin Newsom and poor wildfire management as reasons for Texas move.",
    "link": "https://www.foxnews.com/entertainment/comedian-jeff-dye-joins-hollywood-exodus-says-la-fires-quite-wake-up-call",
    "timestamp": "2025-11-16T00:00:02Z"
  },
  {
    "title": "Is this a real Jack White response to 'thin skinned' White House after it insulted him?",
    "description": "Rock musician Jack White responded to the White House's criticism of him with a statement calling the administration \"petty and pathetic and thin skinned.\"",
    "link": "https://www.snopes.com//fact-check/jack-white-responds-white-house/",
    "timestamp": "2025-11-16T00:00:00Z"
  },
  {
    "title": "Shrimp exports to EU, Russia, Australia set to swell; major relief for domestic fisheries",
    "description": "The Centre has ironed out legacy issues with a number of key markets and is fixing trade hurdles, Commerce minister Piyush Goyal said.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/shrimp-exports-to-eu-russia-australia-set-to-swell-major-relief-for-domestic-fisheries/articleshow/125352628.cms",
    "timestamp": "2025-11-16T00:00:00Z"
  },
  {
    "title": "Aficionados fret as Trump moves to make pasta great again",
    "description": "Steel: 50%. Copper: 50%. Cars: up to 25%. But an even bigger Trump-era levy looms: 107 % on Italian pasta. Mamma mia!",
    "link": "https://www.ocregister.com/2025/11/15/aficionados-fret-as-trump-moves-to-make-pasta-great-again/",
    "timestamp": "2025-11-15T23:58:30Z"
  },
  {
    "title": "Border czar Tom Homan slams Catholic Church, says ‘secure border saves lives’",
    "description": "Border czar Tom Homan accused the Catholic Church of being “wrong\" on immigration, arguing that enforcing U.S. border laws saves lives.",
    "link": "https://www.foxnews.com/politics/border-czar-tom-homan-slams-catholic-church-says-secure-border-saves-lives",
    "timestamp": "2025-11-15T23:35:59Z"
  },
  {
    "title": "Is Ja Morant out of NBA 2025- 26? Memphis Grizzlies star's turbulent night takes unexpected turn as sudden setback stuns team's momentum",
    "description": "Memphis Grizzlies star Ja Morant exited Saturday's game against the Cleveland Cavaliers with right calf pain, just hours after being cleared to play. This latest setback adds to a season already marred by injuries and suspensions, significantly impacting the …",
    "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/is-ja-morant-out-of-nba-2025-26-memphis-grizzlies-stars-turbulent-night-takes-unexpected-turn-as-sudden-setback-stuns-teams-momentum/articleshow/125358040.cms",
    "timestamp": "2025-11-15T23:32:57Z"
  },
  {
    "title": "Miles Taylor Shreds Scott Jennings For Defending Trump's Politicization Of The DOJ",
    "description": "Miles Taylor, who outed himself as \"Anonymous\" back in 2020, and left the Department of Homeland Security under the first Trump administration because he'd had enough of Trump's criminality with offering pardons, made an appearance on CNN's Newsnight with Abb…",
    "link": "https://crooksandliars.com/2025/11/miles-taylor-shreds-scott-jennings",
    "timestamp": "2025-11-15T23:30:01Z"
  },
  {
    "title": "MAGA rift grows as Trump feuds with Greene before key 2026 midterm elections",
    "description": "She said she's worried about her safety because \"threats against me are being fueled and egged on by the most powerful man in the world.\"",
    "link": "https://richmond.com/news/nation-world/government-politics/article_c96eddc3-7d19-5b44-bf65-2ffeb40a73ad.html",
    "timestamp": "2025-11-15T23:30:00Z"
  },
  {
    "title": "Republicans Chastise Trump For Attacking Thomas Massie's Remarriage",
    "description": "The president, who has been married three times, lashed out at the Kentucky representative for remarrying after the death of his first wife.",
    "link": "https://www.huffpost.com/entry/donald-trump-thomas-massie-remarrying_n_6918f82ee4b0a2c1a92a505f",
    "timestamp": "2025-11-15T23:23:54Z"
  },
  {
    "title": "Tim Dillon Claims ‘This Is The End Of The Trump Administration’: ‘It’s Obvious To Everyone’",
    "description": "Popular podcaster and comic Tim Dillon, who's credited with helping bring young male voters over to President Donald Trump, now has a dire prediction for MAGA.\nThe post Tim Dillon Claims ‘This Is The End Of The Trump Administration’: ‘It’s Obvious To Everyone…",
    "link": "https://www.mediaite.com/media/news/tim-dillon-claims-this-is-the-end-of-the-trump-administration-its-obvious-to-everyone/",
    "timestamp": "2025-11-15T23:23:12Z"
  },
  {
    "title": "Protesters attack police, breach barrier at Mexico's National Palace during rally against cartel violence",
    "description": "Gen Z-led protesters clash violently with police in Mexico City, attacking officers and storming National Palace barriers amid rising anti-government sentiment.",
    "link": "https://www.foxnews.com/world/protesters-attack-police-breach-barrier-mexicos-national-palace-rally-cartel-violence",
    "timestamp": "2025-11-15T23:20:05Z"
  },
  {
    "title": "Interesting Read: Inside the Sandwich Guy’s Jury Deliberations",
    "description": "Inside the Sandwich Guy’s Jury Deliberations www.yahoo.com/news/article… [image or embed] — tommyboy0690.bsky.social (@tommyboy0690.bsky.social) November 12, 2025 at 4:58 PM Mostly posting this because I’d seen rumors about Dunn’s motivation, but no actual re…",
    "link": "https://balloon-juice.com/2025/11/15/interesting-read-inside-the-sandwich-guys-jury-deliberations/",
    "timestamp": "2025-11-15T23:19:28Z"
  },
  {
    "title": "Bihar elections: Day after win, NDA leaders throng Nitish's home; govt formation talks begin in Patna & Delhi",
    "description": "India News: PATNA: Bihar CM Nitish Kumar will resign Monday to clear the way for a new NDA govt, a senior JD(U) functionary said Saturday. Nitish is expected to c.",
    "link": "https://timesofindia.indiatimes.com/india/bihar-elections-day-after-win-nda-leaders-throng-nitishs-home-govt-formation-talks-begin-in-patna-delhi/articleshow/125357989.cms",
    "timestamp": "2025-11-15T23:18:49Z"
  },
  {
    "title": "'We stand with her': GOP chair from Marjorie Taylor Greene district defends her from Trump",
    "description": "U.S. Representative Marjorie Taylor Greene (R-GA) is at war with Donald Trump, and the local Republican party in her district is coming to her defense.Jim Tully, chairman for the Georgia Republican Party for the 14th Congressional District, Greene's district,…",
    "link": "https://www.rawstory.com/mtg-2674299224/",
    "timestamp": "2025-11-15T23:17:35Z"
  },
  {
    "title": "Why Epstein Continues to Haunt Trump",
    "description": "Jeffrey Epstein, who took his own life in 2019 while imprisoned on charges of being a sex trafficker and a pedophile, continues to haunt the Republican Party and its leader, President Donald Trump. \nRepublicans released about 20,000 pages of Epstein documents…",
    "link": "https://biztoc.com/x/4609e9660841ff46",
    "timestamp": "2025-11-15T23:15:56Z"
  },
  {
    "title": "Thousands protest against government in Mexico over violent crime",
    "description": "The protest comes weeks after the murder of Carlos Manzo, the mayor of Uruapan.",
    "link": "https://www.bbc.com/news/articles/cn8vm30rr78o",
    "timestamp": "2025-11-15T23:12:20Z"
  },
  {
    "title": "‘Might I Look At It Longer Than A Sunset?’: Dem Rep Responds To Accusations Of Viewing X-Rated Content On Flight",
    "description": "California Democrat Brad Sherman defended himself Friday after social media users accused him of viewing pornographic content during a commercial flight.",
    "link": "https://dailycaller.com/2025/11/15/dem-rep-brad-sherman-denies-porn-flight-x-feed/",
    "timestamp": "2025-11-15T23:09:06Z"
  },
  {
    "title": "JVPD bungalows giving way to bldgs as families grow & FSI up four times",
    "description": "Mumbai: Sometime in the early 1970s, Bollywood biggies such as Amitabh Bachchan, Dharmendra, Shatrughan Sinha, Rakesh Roshan and Jeetendra discovered .",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/jvpd-bungalows-giving-way-to-bldgs-as-families-grow-fsi-up-four-times/articleshow/125353504.cms",
    "timestamp": "2025-11-15T23:08:51Z"
  },
  {
    "title": "‘Wonderful Sidestep, Congressman!’ Fox’s Tomi Lahren Jabs Democratic Rep for Dodging Question on Schumer’s Future",
    "description": "Tomi Lahren could only taunt Rep. Jack Auchincloss on his \"wonderful sidestep\" after he dodged a question on whether Sen. Chuck Schumer has been a strong leader\nThe post ‘Wonderful Sidestep, Congressman!’ Fox’s Tomi Lahren Jabs Democratic Rep for Dodging Ques…",
    "link": "https://www.mediaite.com/media/wonderful-sidestep-congressman-foxs-tomi-lahren-jabs-democratic-rep-for-dodging-question-on-schumers-future/",
    "timestamp": "2025-11-15T23:07:29Z"
  },
  {
    "title": "Rat fever cases up due to increased testing, no outbreak in Karnataka: Health department",
    "description": "Bengaluru: More rainy days and an increasing rodent population have spiked the cases of rat fever or leptospirosis cases across Karnataka to 2,042 by .",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/rat-fever-cases-up-due-to-increased-testing-no-outbreak-in-karnataka-health-department/articleshow/125354663.cms",
    "timestamp": "2025-11-15T23:07:26Z"
  },
  {
    "title": "Epstein Survivors Weigh in On Brutal MTG-Trump Feud: Report",
    "description": "As President Donald Trump and Republican Representative Marjorie Taylor Greene’s feud over Jeffrey Epstein boils over, survivors of the late sex criminal have reportedly issued a collective statement of support for the Georgia Republican.The bizarre developme…",
    "link": "https://newrepublic.com/post/203259/epstein-survivors-marjorie-taylor-greene-trump-feud",
    "timestamp": "2025-11-15T23:03:28Z"
  },
  {
    "title": "Bihar election results: In 35 seats, Prashant Kishor's party tally more than win margin",
    "description": "India News: NEW DELHI: Prashant Kishor's Jan Suraaj Party lost its deposit in 236 of the 238 seats that it contested but data suggests it may have played spoiler .",
    "link": "https://timesofindia.indiatimes.com/india/bihar-election-results-in-35-seats-prashant-kishors-party-tally-more-than-win-margin/articleshow/125357892.cms",
    "timestamp": "2025-11-15T23:01:03Z"
  },
  {
    "title": "Have You Lived and Worked In a Totalitarian or Authoritarian Regime-Run Country for At Least One Thousand Days?",
    "description": "PLEASE DO NOT RESPOND TO THIS ON SOCIAL MEDIA !! We are interested in hearing from any Christian individual who has the experience of living and working (or having lived and worked), for 1,000 days or longer, inside of a country governed by a totalitarian or …",
    "link": "https://freerepublic.com/focus/f-bloggers/4352739/posts",
    "timestamp": "2025-11-15T23:00:21Z"
  },
  {
    "title": "The US will help South Korea build nuclear 'attack' submarines - here's what that means",
    "description": "The agreement comes amid a period of growing geopolitical tensions on the Korean Peninsula.",
    "link": "https://www.bbc.com/news/articles/c620qppzlgwo",
    "timestamp": "2025-11-15T23:00:19Z"
  },
  {
    "title": "Michelle Obama says the U.S. is 'not ready' for a woman president",
    "description": "Former first lady Michelle Obama said in a conversation published to her YouTube page Friday that the country is not ready for a woman president, saying that the U.S. has “a lot of growing up to do.”“As we saw in this past election, sadly, we ain’t ready,\" Ob…",
    "link": "https://www.nbcnews.com/politics/politics-news/michelle-obama-says-us-not-ready-woman-president-rcna244136",
    "timestamp": "2025-11-15T22:55:11Z"
  },
  {
    "title": "Trump appeals trial loss over Portland troop deployment plan",
    "description": "The U.S. appealed a judge’s order that permanently blocked President Donald Trump’s plan to deploy National Guard troops to Portland, Oregon, to counter protests against his immigration crackdown.\nThe Justice Department seeks to overturn a Nov. 7 finding by a…",
    "link": "https://biztoc.com/x/c8ea8eef63de87b9",
    "timestamp": "2025-11-15T22:53:24Z"
  },
  {
    "title": "Fox News Guest Who Mocked Hannity On His Show Pops Champagne, Spills The Tea",
    "description": "“I’m having a little champagne because, you know, it’s Friday and, you know, it’s not every week that you kick Sean Hannity’s ass,” said the progressive radio host.",
    "link": "https://www.huffpost.com/entry/stephanie-miller-celebrates-kick-sean-hannity-ass-champagne_n_6918d38ce4b0191be9d55cb3",
    "timestamp": "2025-11-15T22:53:18Z"
  },
  {
    "title": "Las Vegas officials weigh banning criminal offenders from Strip to revive tourism",
    "description": "A disbanded court in Las Vegas may come back to life as lawmakers look to attract visitors to revive Sin City tourism. Vegas tourism has continued to decline, with just over 3 million visitors in September, an 8.8% decrease from the same time last year, accor…",
    "link": "https://freerepublic.com/focus/f-chat/4352738/posts",
    "timestamp": "2025-11-15T22:51:56Z"
  },
  {
    "title": "Trump appeals trial loss over Portland troop deployment plan",
    "description": "Oregon and the city of Portland sued to block Trump’s planned deployment of 200 National Guard troops over the objection of the governor. Similar suits are underway in Los Angeles, Chicago and Washington, D.C.",
    "link": "https://www.bostonherald.com/2025/11/15/trump-appeals-trial-loss-over-portland-troop-deployment-plan/",
    "timestamp": "2025-11-15T22:47:39Z"
  },
  {
    "title": "Ex-Fed official faced ethics probe on illegal stock trades",
    "description": "Now we know. Former Federal Reserve Governor Adriana Kugler abruptly resigned in August on a “personal matter” and returned to academia. Her quick departure ...",
    "link": "https://www.thestreet.com/fed/ex-fed-official-faced-ethics-probe-on-illegal-stock-trades",
    "timestamp": "2025-11-15T22:47:00Z"
  },
  {
    "title": "Open Primaries Would Keep Government Open",
    "description": "The root cause of the nation’s longest government shutdown – and the next one, and the one after that – isn’t ideological extremism or hyper-partisanship on their own. It’s the incentives created by the outsized influence of party primary elections.The good n…",
    "link": "https://freerepublic.com/focus/f-news/4352736/posts",
    "timestamp": "2025-11-15T22:40:27Z"
  },
  {
    "title": "Biden-Appointed Fed Official Investigated for Stock Trade Violations Before Resigning: Ethics Office",
    "description": "The disclosures show Kugler and her spouse engaged in multiple trades in individual stocks like Apple, Southwest Airlines, and Cava.",
    "link": "https://www.westernjournal.com/biden-appointed-fed-official-investigated-stock-trade-violations-resigning-ethics-office/",
    "timestamp": "2025-11-15T22:33:58Z"
  },
  {
    "title": "27 Epstein survivors thank GOP lawmaker for taking on Trump: 'You have our full support'",
    "description": "More than two dozen survivors of Jeffrey Epstein have reportedly sent a letter to a GOP lawmaker who has been speaking out against Donald Trump.Trump‘s decision to lash out and make personal attacks on Rep. Marjorie Taylor Greene (R-GA) set off a civil war am…",
    "link": "https://www.rawstory.com/epstein-marjorie-taylor-greene/",
    "timestamp": "2025-11-15T22:33:45Z"
  },
  {
    "title": "What Do Mainstream Democrats Stand For?",
    "description": "Kamala Harris’s memoir gives you little idea of what she believes. John Fetterman’s is better.Earlier this week everyone piled on congressional Democrats, or furiously defended them, over the government shutdown and its end. It was the longest in U.S. history…",
    "link": "https://freerepublic.com/focus/f-news/4352734/posts",
    "timestamp": "2025-11-15T22:25:37Z"
  },
  {
    "title": "Trump buys at least $82 million in bonds since late August, disclosures show",
    "description": "President Donald Trump bought at least $82 million in corporate and municipal bonds from late August to early October including new investments in sectors...",
    "link": "https://finance.yahoo.com/news/trump-buys-least-82-million-222505118.html",
    "timestamp": "2025-11-15T22:25:05Z"
  },
  {
    "title": "Trump’s latest Border Patrol deployment will fail for all the same reasons",
    "description": "When the show’s over, what federal agents will leave behind is predictable. All the president’s men are coming to Charlotte. After several days of rumors, federal officials confirmed to local leaders in North Carolina that, indeed, Border Patrol agents will b…",
    "link": "https://freerepublic.com/focus/f-news/4352731/posts",
    "timestamp": "2025-11-15T22:18:23Z"
  },
  {
    "title": "Mont-de-Marsan: India joins France for 'Garuda' air exercise today; move to bolster strategic partnership",
    "description": "India News: NEW DELHI: India and France will on Sunday kick off the 'Garuda' air combat exercise at Mont-de-Marsan to enhance military interoperability and coordi.",
    "link": "https://timesofindia.indiatimes.com/india/mont-de-marsan-india-joins-france-for-garuda-air-exercise-today-move-to-bolster-strategic-partnership/articleshow/125355965.cms",
    "timestamp": "2025-11-15T22:17:13Z"
  },
  {
    "title": "Epstein claimed Trump was regular visitor — but never participated in illicit activity",
    "description": "Convicted pedophile Jeffrey Epstein once claimed President Donald Trump knew underage girls were being sexually abused at the late investor’s Palm Beach mansion -- but never got a rubdown or was part illicit activity, according to a new report.",
    "link": "https://nypost.com/2025/11/15/us-news/epstein-claimed-trump-was-regular-visitor-but-never-participated-in-illicit-activity/",
    "timestamp": "2025-11-15T22:14:09Z"
  },
  {
    "title": "Ultra-rare genetic disorder diagnosed in 11-yr-old girl in Bengaluru",
    "description": "Bengaluru: Paediatricians in the city have documented what is said to be India's first known case of an ultra-rare genetic disorder — Pseudo-TORCH syn.",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/ultra-rare-genetic-disorder-diagnosed-in-11-yr-old-girl-in-bengaluru/articleshow/125353845.cms",
    "timestamp": "2025-11-15T22:12:25Z"
  },
  {
    "title": "Israel lobbying US to condition sale of F-35 jets to Saudi Arabia on diplomatic normalization",
    "description": "Anonymous Israeli officials told Axios that they are pressuring the Trump campaign to condition any sale of the advanced F-35s to Saudi Arabia on diplomatic normalization between the Jewish state and the Saudi Kingdom.",
    "link": "https://nypost.com/2025/11/15/world-news/israel-lobbying-us-to-condition-sale-of-f-35-jets-to-saudi-arabia-on-diplomatic-normalization/",
    "timestamp": "2025-11-15T22:10:52Z"
  },
  {
    "title": "Trump Ramps Up Attacks on Massie: 'His Wife Will Soon Find Out She’s Stuck with a LOSER'",
    "description": "President Donald Trump issued a new round of attacks against Rep. Thomas Massie (R-KY) on Truth Social on Friday, November 14, continuing the public feud that has widened over Massie’s voting behavior, recent positions on foreign policy, and Trump’s decision …",
    "link": "https://www.breitbart.com/politics/2025/11/15/trump-ramps-up-attacks-on-massie-his-wife-will-soon-find-out-shes-stuck-with-a-loser/",
    "timestamp": "2025-11-15T22:09:57Z"
  },
  {
    "title": "Bihar elections: Unable to explain reasons for defeat, Congress's taken easy way out by blaming EC, SIR, says PM Modi",
    "description": "India News: NEW DELHI: The BJP on Saturday accused the Congress of insulting the people's mandate and looking for excuses to hide its failure, even as the opposit.",
    "link": "https://timesofindia.indiatimes.com/india/bihar-elections-unable-to-explain-reasons-for-defeat-congresss-taken-easy-way-out-by-blaming-ec-sir-says-pm-modi/articleshow/125355842.cms",
    "timestamp": "2025-11-15T22:05:59Z"
  },
  {
    "title": "He was Putin's top ally on the world stage. And then, he was gone",
    "description": "For more than two decades, Sergey Lavrov has been Russia's top foreign diplomat, representing the Kremlin's regime around the world, but late last month, he disappeared.",
    "link": "https://www.abc.net.au/news/2025-11-16/mystery-surrounds-missing-russian-foreign-minister-sergey-lavrov/106008516",
    "timestamp": "2025-11-15T22:03:29Z"
  },
  {
    "title": "EXCLUSIVE INTERVIEW: Trump explains how Charlie Kirk's murder changed his life (Salena Zito/Washington Examiner)",
    "description": "Salena Zito / Washington Examiner:\nEXCLUSIVE INTERVIEW: Trump explains how Charlie Kirk's murder changed his life  —  WASHINGTON — In the final weeks of the 2024 presidential election, President Donald Trump was doing nonstop rallies, many of them outdoors de…",
    "link": "https://www.memeorandum.com/251115/p51",
    "timestamp": "2025-11-15T22:00:33Z"
  },
  {
    "title": "MAGA Rift Grows As Trump Feuds With Marjorie Taylor Greene Before Key 2026 Midterm Elections",
    "description": "On Saturday, Trump tested out a new nickname for her, calling her “Marjorie Taylor Brown” because “Green grass turns Brown when it begins to ROT!”",
    "link": "https://www.huffpost.com/entry/maga-rift-grows-as-trump-feuds-with-marjorie-taylor-greene-before-key-2026-midterm-elections_n_6918f410e4b0b43a45c0b5af",
    "timestamp": "2025-11-15T22:00:08Z"
  },
  {
    "title": "Why Did Kash Patel Exempt Dan Bongino From Clearing Polygraph Exams?",
    "description": "ProPublica has the scoop on the waiver that allowed Bongino to get his top job without clearing a lie detector test. Two other top employees got similar waivers: Nicole Rucker, Kash Patel’s personal assistant, and Marshal Yates, the FBI liaison with Congress.…",
    "link": "https://crooksandliars.com/2025/11/why-did-kash-patel-exempt-dan-bongino",
    "timestamp": "2025-11-15T22:00:01Z"
  },
  {
    "title": "Trump Bets Big on a Nuclear Comeback",
    "description": "United States President Donald Trump is putting his money where his mouth is as he doubles down on efforts to accelerate the expansion of the country’s nuclear energy sector. The government will spend billions in public funding to reinvigorate U.S. nuclear po…",
    "link": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Trump-Bets-Big-on-a-Nuclear-Comeback.html",
    "timestamp": "2025-11-15T22:00:00Z"
  },
  {
    "title": "Texas, California National Guard members to leave Portland and Chicago",
    "description": "The federalized California and Texas National Guard members sent to Portland and Chicago will return to their home states, according to two U.S. officials.",
    "link": "https://abcnews.go.com/US/texas-california-national-guard-members-leave-portland-chicago/story?id=127560214",
    "timestamp": "2025-11-15T21:56:01Z"
  },
  {
    "title": "Trump Shares Ludicrous Epstein Files Conspiracy Theory",
    "description": "President Donald Trump thinks it’s possible that, some time in the past year or so, his political enemies planted damaging information about him in Jeffrey Epstein case files.Following the latest release of Epstein-related records, Trump on Friday was asked a…",
    "link": "https://newrepublic.com/post/203258/trump-jeffrey-epstein-files-conspiracy-theory",
    "timestamp": "2025-11-15T21:47:37Z"
  },
  {
    "title": "Trump Fumes BBC’s Doctored Clip Worse Than ‘Stupid’ Kamala Harris Interview on ’60 Minutes’: ‘I Have an Obligation’ to Sue!",
    "description": "President Trump said he has an \"obligation\" to sue the BBC because its doctored clip was even worse than 60 Minutes editing a \"stupid\" answer Kamala Harris gave\nThe post Trump Fumes BBC’s Doctored Clip Worse Than ‘Stupid’ Kamala Harris Interview on ’60 Minute…",
    "link": "https://www.mediaite.com/politics/trump-fumes-bbcs-doctored-clip-worse-than-stupid-kamala-harris-interview-on-60-minutes-i-have-an-obligation-to-sue/",
    "timestamp": "2025-11-15T21:47:22Z"
  },
  {
    "title": "The U.S. Might Be About to Enter a New Conflict—but Trump Won’t Say",
    "description": "After days of deliberations with high-ranking officials, President Donald Trump thinks he may have come to a decision about a major foreign policy issue. He’s not quite sure, though, and he definitely isn’t sharing what his decision might be.“I sort of have m…",
    "link": "https://newrepublic.com/post/203255/trump-venezuela-maduro-conflict-comments",
    "timestamp": "2025-11-15T21:46:39Z"
  },
  {
    "title": "Indiana Senate Republicans reject Trump-backed redistricting push, decline to meet in December",
    "description": "Indiana Senate Republicans refuse Trump's redistricting push, marking first GOP state to reject president's congressional map redraw ahead of 2026 midterms.",
    "link": "https://www.foxnews.com/politics/indiana-senate-republicans-reject-trump-backed-redistricting-push-decline-meet-december",
    "timestamp": "2025-11-15T21:43:35Z"
  },
  {
    "title": "WEEKLY RECAP: US shutdown ends, BBC lawsuit, earnings",
    "description": "United States President Donald Trump signed a bill to reopen the federal government after the US Congress approved legislation to end the shutdown.\nThe White House also faced tension abroad, as the U...",
    "link": "https://biztoc.com/x/d6b8da3cfdf909f1",
    "timestamp": "2025-11-15T21:35:18Z"
  },
  {
    "title": "‘Quick I’m Up Next’: Dem Del. Plaskett Caught Texting Epstein To Help Steer Questioning During Congressional Hearing",
    "description": "Although the lawmaker's name is blacked out in the documents, timestamps, context, and alignment with live footage reviewed by The Washington Post indicate the recipient was Plaskett, a member of the panel questioning Cohen that day",
    "link": "https://dailycaller.com/2025/11/15/virgin-islands-stacey-plaskett-caught-texting-jeffrey-epstein-steer-congressional-hearing-questioning-michael-cohen/",
    "timestamp": "2025-11-15T21:34:58Z"
  },
  {
    "title": "MTG Claims Trump’s Criticisms Of Her Provoked ‘Hot Bed Of Threats’",
    "description": "Private security firms contacted Rep. Marjorie Taylor Greene with safety warnings after President Donald Trump launched an attack withdrawing his endorsement.",
    "link": "https://dailycaller.com/2025/11/15/mtg-trump-threats-security-warnings/",
    "timestamp": "2025-11-15T21:34:28Z"
  },
  {
    "title": "Iran confirms seizure of oil tanker in Strait of Hormuz",
    "description": "Iran on Saturday confirmed seizure of a Marshall Islands-flagged oil tanker as it traveled through the narrow Strait of Hormuz over violations including carrying an illegal consignment, state media reported. A report by the official Irna news agency carried a…",
    "link": "https://japantoday.com/category/world/iran-confirms-seizure-of-oil-tanker-in-the-strait-of-hormuz",
    "timestamp": "2025-11-15T21:30:44Z"
  },
  {
    "title": "Climate protesters demand to be heard as they march on COP30 with costumes and drums",
    "description": "Some wore black dresses to signify a funeral for fossil fuels. Hundreds wore red shirts, symbolizing the blood of colleagues fighting to protect the environment. And others chanted, waved huge flags or held up signs Saturday in what's traditionally the bigges…",
    "link": "https://japantoday.com/category/world/climate-protesters-demand-to-be-heard-as-they-march-on-cop30-with-costumes-and-drums",
    "timestamp": "2025-11-15T21:30:25Z"
  },
  {
    "title": "BBC caught in crossfire of polarised political and media landscape",
    "description": "Accused of being biased by some, defended as a champion of impartiality by others, the BBC is once again the subject of a thorny debate about the role of a publicly funded broadcaster in an increasingly polarized landscape. The BBC is regularly used as politi…",
    "link": "https://japantoday.com/category/world/bbc-caught-in-crossfire-of-polarised-political-and-media-landscape",
    "timestamp": "2025-11-15T21:30:09Z"
  },
  {
    "title": "Epstein Bombshell: Dem Congressman Texted Epstein During Michael Cohen Hearing",
    "description": "Jeffrey Epstein and a House Democrat were busy texting one another during a 2019 hearing featuring Michael Cohen.",
    "link": "https://www.westernjournal.com/epstein-bombshell-dem-congressman-texted-epstein-michael-cohen-hearing/",
    "timestamp": "2025-11-15T21:30:02Z"
  },
  {
    "title": "MAGA rift grows as Trump feuds with Greene before key 2026 midterm elections",
    "description": "When President Donald Trump addressed Congress earlier this year, Rep. Marjorie Taylor Greene was there holding an American flag and wearing a red baseball cap that said “Trump was right about everything.” After the speech, he gave her a kiss and she beamed. …",
    "link": "https://japantoday.com/category/world/maga-rift-grows-as-trump-feuds-with-greene-before-key-2026-midterm-elections",
    "timestamp": "2025-11-15T21:29:47Z"
  },
  {
    "title": "U.S. gov't will release September jobs report on Thursday, ending data drought from federal shutdown",
    "description": "The Labor Department will release its numbers on September hiring and unemployment next Thursday, a month and a half late, marking the beginning of the end of a data drought caused by the 43-day federal government shutdown. The statistical blackout meant that…",
    "link": "https://japantoday.com/category/business/government-will-release-september-jobs-report-next-week-ending-data-drought-from-federal-shutdown",
    "timestamp": "2025-11-15T21:29:05Z"
  },
  {
    "title": "Trump pardons his supporter who threatened to shoot FBI agents: report",
    "description": "President Donald Trump has reportedly pardoned a MAGA supporter who threatened to shoot FBI agents.Trump pardoned two individuals with connections to the Jan. 6 insurrection attempt, according to a report published Saturday.Fox News reported that Trump pardon…",
    "link": "https://www.rawstory.com/trump-threaten-fbi-agents/",
    "timestamp": "2025-11-15T21:28:17Z"
  },
  {
    "title": "As LDP marks 70 years, Takaichi's popularity may stall reforms",
    "description": "Japan's ruling Liberal Democratic Party marked the 70th anniversary of its founding on Saturday amid concerns that reforms after a political funds scandal could stall as Prime Minister Sanae Takaichi enjoys growing popularity. Takaichi, Japan's first female p…",
    "link": "https://japantoday.com/category/politics/focus-as-ldp-marks-70-years-japan-pm-takaichi%27s-popularity-may-stall-reforms",
    "timestamp": "2025-11-15T21:26:42Z"
  },
  {
    "title": "Federal agents deployed to Charlotte for immigration enforcement, despite rejections from local leaders",
    "description": "Federal agents deployed to Charlotte for immigration enforcement, despite rejections from local leadersgo.com",
    "link": "https://abcnews.go.com/US/federal-agents-deployed-charlotte-immigration-enforcement-despite-rejections/story?id=127558136",
    "timestamp": "2025-11-15T21:25:56Z"
  },
  {
    "title": "‘The system’s about to break’ — Thousands of court-appointed lawyers and staffers haven’t been paid since June",
    "description": "A spending bill pending for 2026 comes up $196 million short and money to pay these federal attorneys will likely run out in June.",
    "link": "https://fortune.com/2025/11/15/court-appointed-federal-attorneys-pay-savings-driving-uber-government-shutdown/",
    "timestamp": "2025-11-15T21:22:08Z"
  },
  {
    "title": "Rep. Marjorie Taylor Greene says she received threats amid deepening feud with Trump",
    "description": "Rep. Marjorie Taylor Greene, R-Ga., who was once one of President Donald Trump's most vocal supporters, said Saturday that she's facing threats following the president's criticism of her on social media.\"I am now being contacted by private security firms with…",
    "link": "https://www.nbcnews.com/politics/congress/marjorie-taylor-greene-threats-feud-donald-trump-rcna244119",
    "timestamp": "2025-11-15T21:19:56Z"
  }
]