[
  {
    "title": "Trump’s handling of the economy is at its lowest point in AP-NORC polling",
    "description": "The poll results are a warning about how Americans are evaluating Trump's performance as the year draws to a close.",
    "link": "https://www.bostonherald.com/2025/12/11/ap-poll-trump-economy-approval/",
    "timestamp": "2025-12-11T12:24:32Z"
  },
  {
    "title": "Trump Rages at Indiana ‘Republican SUCKERS’ Who Revolt on Redistricting Push in ‘MAGA Primary’ Threat",
    "description": "Trump savaged Indiana Senate leader Rodric Bray (R) for stalling a congressional redistricting plan he insists would deliver the GOP two extra House seats.\nThe post Trump Rages at Indiana ‘Republican SUCKERS’ Who Revolt on Redistricting Push in ‘MAGA Primary’…",
    "link": "https://www.mediaite.com/media/news/trump-rages-at-indiana-republican-suckers-who-revolt-on-redistricting-push-in-maga-primary-threat/",
    "timestamp": "2025-12-11T12:23:46Z"
  },
  {
    "title": "Donald Trump Economic Approval Nosedives with Republicans",
    "description": "Republican voters are growing noticeably less confident in Donald Trump’s economic stewardship, a troubling shift for a president who has long cast himself as the party’s chief dealmaker and financial fixer. A new AP-NORC poll shows GOP approval of Trump’s ha…",
    "link": "https://biztoc.com/x/ba9fb3044bacfd60",
    "timestamp": "2025-12-11T12:20:54Z"
  },
  {
    "title": "Trump's DHS chief and border czar not speaking to each other as angry rift grows: report",
    "description": "In yet another sign of breakdown within President Donald Trump's Homeland Security operations, Department of Homeland Security Secretary Kristi Noem and White House \"border czar\" Tom Homan have fallen out, and are barely even speaking to each other, Axios rep…",
    "link": "https://www.rawstory.com/kristi-noem-tom-homan-fight/",
    "timestamp": "2025-12-11T12:20:09Z"
  },
  {
    "title": "Less than a third of Americans approve of Trump’s handling of the economy, lowest in either term",
    "description": "The AP-NORC poll found that 36% of Americans approve of the way he's handling his job as president, which is down slightly from 42% in March.",
    "link": "https://fortune.com/2025/12/11/trump-handling-of-the-economy-approval-ratings-31-percent-lowest-ever-affordability/",
    "timestamp": "2025-12-11T12:19:25Z"
  },
  {
    "title": "Tariffs have cost US households USD 1,200 each since Trump returned to White House, Democrats say",
    "description": "New calculations by Democrats on Congress' Joint Economic Committee reveal that sweeping import taxes imposed by Donald Trump have cost the average American household nearly $1,200 since February. These tariffs, which have significantly increased the average …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/tariffs-have-cost-us-households-usd-1200-each-since-trump-returned-to-white-house-democrats-say/articleshow/125911475.cms",
    "timestamp": "2025-12-11T12:16:57Z"
  },
  {
    "title": "US Seizes Oil Tanker Off Venezuela Coast in Major Escalation",
    "description": "President Donald Trump says the United States seized a massive oil tanker off the Venezuelan coast on Wednesday. Now, the Venezuelan government is accusing the U.S. of “blatant theft” with video showing the moment an elite and armed Coast Guard unit was seen …",
    "link": "https://www.today.com/video/us-seizes-oil-tanker-off-venezuela-coast-in-major-escalation-254213701781",
    "timestamp": "2025-12-11T12:16:14Z"
  },
  {
    "title": "Zelenskyy will hold urgent talks with 30 countries as Trump pushes for swift peace deal with Russia",
    "description": "Ukrainian President Volodymyr Zelenskyy is set to hold urgent talks with leaders from about 30 countries",
    "link": "https://abcnews.go.com/International/wireStory/zelenskyy-hold-urgent-talks-30-countries-trump-pushes-128305121",
    "timestamp": "2025-12-11T12:13:50Z"
  },
  {
    "title": "Zelenskyy rallies key allies as Ukraine faces Russian and US pressure",
    "description": "Ukrainian leader holds urgent talks with 'coalition of the willing' as pressure mounts over territorial concessions.",
    "link": "https://www.aljazeera.com/news/2025/12/11/zelenskyy-rallies-key-allies-as-ukraine-faces-russian-and-us-pressure",
    "timestamp": "2025-12-11T12:13:17Z"
  },
  {
    "title": "House Dem to force Trump impeachment vote on 2 articles",
    "description": "Rep. Al Green forced the House vote on Trump impeachment this week, citing threats against House lawmakers and members of the judiciary.",
    "link": "https://www.foxnews.com/politics/house-dem-force-trump-impeachment-vote-2-articles",
    "timestamp": "2025-12-11T12:12:28Z"
  },
  {
    "title": "'Not helpful!' Republicans worried by Trump's off-script 'ostrich' affordability routine",
    "description": "President Donald Trump made the first stop this week in a planned nationwide tour to reassure Americans about the cost of living, but his off-script message concerned other Republicans.The president's high-profile economic speech Tuesday in Pennsylvania was m…",
    "link": "https://www.rawstory.com/donald-trump-2674390448/",
    "timestamp": "2025-12-11T12:11:45Z"
  },
  {
    "title": "Why Indiana Republicans Are Standing Up to Trump",
    "description": "Small-c conservatism is still a point of pride in the state.",
    "link": "https://www.theatlantic.com/politics/2025/12/indiana-republicans-trump-gop-redistricting/685220/",
    "timestamp": "2025-12-11T12:11:12Z"
  },
  {
    "title": "A Judicial Solution for Presidential Overreach and Congressional Abdication",
    "description": "The recent high-profile cases of Trump v. Slaughter and Learning Resources v. Trump might not initially appear to share very much in common. Yes, they both involve President Donald Trump, but the former is about the president's purported authority to fire the…",
    "link": "https://biztoc.com/x/584ca7f5a97fd2b9",
    "timestamp": "2025-12-11T12:09:36Z"
  },
  {
    "title": "Tariffs have cost U.S. households $1,200 each since Trump returned to the White House, Democrats say",
    "description": "Tariffs have cost U.S. households $1,200 each since Trump returned to the White House, Democrats saylocal10.com",
    "link": "https://www.local10.com//business/2025/12/11/tariffs-have-cost-us-households-1200-each-since-trump-returned-to-the-white-house-democrats-say/",
    "timestamp": "2025-12-11T12:07:51Z"
  },
  {
    "title": "U.S. seizes oil tanker amid tensions with Venezuela and health care disagreements plague the GOP: Morning Rundown",
    "description": "The U.S. seizes an oil tanker off Venezuela's coast as the Trump administration continues to escalate military activity in the region.",
    "link": "https://www.nbcnews.com/news/us-news/us-seizes-oil-tanker-tensions-venezuela-health-care-disagreements-plag-rcna248576",
    "timestamp": "2025-12-11T12:04:54Z"
  },
  {
    "title": "U.S. seizes oil tanker off the coast of Venezuela",
    "description": "The U.S. military has seized an oil tanker off Venezuela, President Donald Trump told reporters Wednesday as his administration ...",
    "link": "https://biztoc.com/x/55f9d814973f6e40",
    "timestamp": "2025-12-11T12:03:37Z"
  },
  {
    "title": "Is Trump’s $686m F-16 upgrade for Pakistan a message to India?",
    "description": "The US has authorised the sale of advanced technology and support for Pakistan's F-16 jets.",
    "link": "https://www.aljazeera.com/news/2025/12/11/is-trumps-686m-f-16-upgrade-for-pakistan-a-message-to-india",
    "timestamp": "2025-12-11T12:02:23Z"
  },
  {
    "title": "WATCH: Tense Footage Shows US Forces Seizing Oil Tanker Near Venezuela",
    "description": "Dramatic footage released by the Trump administration shows the moment U.S. forces boarded a sanctioned oil tanker in choppy waters off the coast of Venezuela.\nThe post WATCH: Tense Footage Shows US Forces Seizing Oil Tanker Near Venezuela first appeared on M…",
    "link": "https://www.mediaite.com/media/news/watch-tense-footage-shows-us-forces-seizing-oil-tanker-near-venezuela/",
    "timestamp": "2025-12-11T12:02:10Z"
  },
  {
    "title": "Disgraced Terraform Labs Founder Do Kwon Faces Sentencing Today",
    "description": "The upcoming sentencing comes after the South Korean entrepreneur pleaded guilty to defrauding investors in August.",
    "link": "https://decrypt.co/351947/disgraced-terraform-labs-founder-do-kwon-faces-sentencing-today",
    "timestamp": "2025-12-11T12:01:51Z"
  },
  {
    "title": "American Bitcoin Makes Big Buy, Adds 416 BTC To Its Stack",
    "description": "American Bitcoin Corp. reported a fresh addition to its Bitcoin reserve after buying 416 BTC, bringing its total holdings to around 4,783 coins. Related Reading: Institutions Scoop Up 9,000 Ether, Fueling Bullish Signals According to company disclosures and m…",
    "link": "http://www.newsbtc.com/news/bitcoin/american-bitcoin-makes-big-buy-adds-416-btc-to-its-stack/",
    "timestamp": "2025-12-11T12:00:49Z"
  },
  {
    "title": "Trump Signals He’s Ready to Step In as Thailand–Cambodia Conflict Intensifies",
    "description": "It does not appear either side plans on ending hostilities soon, mining and trade deals notwithstanding.\nThe post Trump Signals He’s Ready to Step In as Thailand–Cambodia Conflict Intensifies first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/12/trump-signals-hes-ready-to-step-in-as-thailand-cambodia-conflict-intensifies/",
    "timestamp": "2025-12-11T12:00:45Z"
  },
  {
    "title": "Trump’s AI-Regulation Ban Is a Threat to National Security",
    "description": "The United States should not be lobbied out of protecting its own future.",
    "link": "https://www.theatlantic.com/ideas/2025/12/ai-regulation-moratorium-threat/685216/",
    "timestamp": "2025-12-11T12:00:00Z"
  },
  {
    "title": "So This Is What ‘America First’ Looks Like",
    "description": "The practical application of Trump’s isolationism is hardly the big break he promised.",
    "link": "https://www.theatlantic.com/national-security/2025/12/somalia-trump-america-first-military/685207/",
    "timestamp": "2025-12-11T12:00:00Z"
  },
  {
    "title": "He’s Undocumented. She’s Not.",
    "description": "A young couple decides whether to stay in the U.S.—or leave.",
    "link": "https://www.theatlantic.com/podcasts/2025/12/immigration-undocumented-self-deportation/685205/",
    "timestamp": "2025-12-11T12:00:00Z"
  },
  {
    "title": "Teen AI Chatbot Usage Sparks Mental Health and Regulation Concerns",
    "description": "A new survey offers the clearest national snapshot yet of how U.S. teens are using artificial intelligence",
    "link": "https://www.scientificamerican.com/article/teen-ai-chatbot-usage-sparks-mental-health-and-regulation-concerns/",
    "timestamp": "2025-12-11T12:00:00Z"
  },
  {
    "title": "Bonnie Blue Endorses Right-Wing Donald Trump Ally",
    "description": "Bonnie Blue, the internationally renowned adult-content creator, has publicly endorsed U.S. President Donald Trump’s British ally, Nigel Farage, in a first-person piece for a U.K. publication.\nBlue, a U, K. national whose legal name is Tia Billinger, recently…",
    "link": "https://biztoc.com/x/4e65bb5c4a7bb2ec",
    "timestamp": "2025-12-11T11:58:23Z"
  },
  {
    "title": "Links 12/11/2025",
    "description": "Our surreal daily links, including 'incomprehensible' Washington flooding, Trump seeks shield from war crime prosecutions, and think tank Polymarket games.",
    "link": "https://www.nakedcapitalism.com/2025/12/links-12-11-2025.html",
    "timestamp": "2025-12-11T11:55:37Z"
  },
  {
    "title": "Trump's new security strategy: A chance for Africa?",
    "description": "US President Donald Trump's new foreign policy focuses less on aid and more on trade with African countries, specifically on raw materials. Could this be a wake-up call for Africa to become more economically independent?",
    "link": "https://www.dw.com/en/trumps-new-security-strategy-a-chance-for-africa/a-75102272",
    "timestamp": "2025-12-11T11:54:00Z"
  },
  {
    "title": "Big central banks edge back towards hiking mode, but Fed keeps cutting",
    "description": "By Alun John and Naomi Rovnick LONDON, Dec 11 (Reuters) - Central banks in big economies are signaling a change of stance, with many now on hold after a long...",
    "link": "https://finance.yahoo.com/news/big-central-banks-edge-back-115235149.html",
    "timestamp": "2025-12-11T11:52:35Z"
  },
  {
    "title": "Trump judicial appointee facing 'political activity' ethics charge over controversial stop",
    "description": "A former Donald Trump lawyer who leapfrogged from that position to an FBI job before being appointed to a lifetime position on the federal bench could be headed for a court-ordered investigation after an ethics complaint was filed late Wednesday.Controversial…",
    "link": "https://www.rawstory.com/emil-bove-2674390428/",
    "timestamp": "2025-12-11T11:52:03Z"
  },
  {
    "title": "Tlaib Rips Lawmakers Who 'Drool at the Opportunity to Fund War' While Opposing Healthcare for All",
    "description": "\"Imagine if our government funded our communities like they fund war.\"That was Rep. Rashida Tlaib's (D-Mich.) response to the House's bipartisan passage Wednesday of legislation that authorizes nearly $901 billion in military spending for the coming fiscal ye…",
    "link": "https://www.commondreams.org/news/house-passes-ndaa",
    "timestamp": "2025-12-11T11:47:07Z"
  },
  {
    "title": "Hegseth’s press purge is now complete",
    "description": "Despite his hand-picked press corps, the defense secretary still has major problems",
    "link": "https://www.salon.com/2025/12/11/hegseths-press-purge-is-now-complete/",
    "timestamp": "2025-12-11T11:45:50Z"
  },
  {
    "title": "Venezuelan Nobel Peace Prize winner makes surprise appearance in Oslo",
    "description": "“I would like to salute you … for your struggle. It has cost you, your family and your people a lot,” Norwegian PM Jonas Gahr Støre tells María Corina Machado.",
    "link": "https://www.politico.eu/article/maria-corina-machado-venezuela-nobel-peace-prize-winner-oslo/",
    "timestamp": "2025-12-11T11:41:26Z"
  },
  {
    "title": "Indian exports hit record high",
    "description": "India’s exports grew to a record $418 billion in April-September, even as 50% tariffs imposed by the US began to set in Read Full Article at RT.com",
    "link": "https://www.rt.com/india/629310-indian-exports-hit-record-high/",
    "timestamp": "2025-12-11T11:39:32Z"
  },
  {
    "title": "An elite Coast Guard squad and a 'dark fleet' ship - what we know about US seizure of oil tanker off Venezuela",
    "description": "The US seizure of a crude oil ship is the latest in a series of escalations in the Trump administration's pressure campaign on Venezuela.",
    "link": "https://www.bbc.com/news/articles/cwyp7rkkgvdo",
    "timestamp": "2025-12-11T11:34:28Z"
  },
  {
    "title": "'Chilled out of the labor force': watchdog sounds alarm as ICE spreads child care panic",
    "description": "Increased arrests by immigration enforcement agents under the second Trump administration have created a “chilling effect” on the child care industry, resulting in a decrease in workers and in turn less mothers in the workforce, according to a new report\r\n fr…",
    "link": "https://www.rawstory.com/raw-investigates/ice-2674388488/",
    "timestamp": "2025-12-11T11:32:36Z"
  },
  {
    "title": "A year after Luigi Mangione’s arrest, health care is even worse",
    "description": "Brian Thompson's killing hasn't helped our public health crisis. Here's what actually might.",
    "link": "https://www.salon.com/2025/12/11/a-year-after-luigi-mangiones-arrest-health-care-is-even-worse/",
    "timestamp": "2025-12-11T11:30:44Z"
  },
  {
    "title": "US–Venezuela showdown threatens to jolt gas prices — what could spark a surge",
    "description": "As President Donald Trump's drug campaign targets Venezuela, potential land strikes raise concerns about oil market disruption and higher energy prices for Americans.",
    "link": "https://www.foxnews.com/politics/us-venezuela-showdown-threatens-jolt-gas-prices-what-could-spark-surge",
    "timestamp": "2025-12-11T11:30:13Z"
  },
  {
    "title": "Victor Davis Hanson: Trump Calls Out Europe in New National Security Strategy",
    "description": "On this episode of “Victor Davis Hanson: In His Own Words,” Victor Davis Hanson and Jack Fowler dive into how President Donald Trump’s newly revealed national security... Read More\nThe post Victor Davis Hanson: Trump Calls Out Europe in New National Security …",
    "link": "https://www.dailysignal.com/2025/12/11/victor-davis-hanson-trump-calls-out-europe-in-new-national-security-strategy/",
    "timestamp": "2025-12-11T11:30:00Z"
  },
  {
    "title": "Health care deal gets further out of reach (Punchbowl News)",
    "description": "Punchbowl News:\nHealth care deal gets further out of reach  —  On Wednesday, we outlined the many reasons to be skeptical about a bipartisan Senate health care deal coming together in the new year.  Now, President Donald Trump says Hill Republicans “don't nee…",
    "link": "https://www.memeorandum.com/251211/p11",
    "timestamp": "2025-12-11T11:30:00Z"
  },
  {
    "title": "Proposals on territorial concessions by Ukraine sent to Trump: Friedrich Merz",
    "description": "German Chancellor Friedrich Merz revealed that a proposal on territorial concessions Ukraine is willing to make to end the war with Russia was sent to US President Donald Trump. This follows a call with European leaders, with Merz emphasizing that any peace d…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/proposals-on-territorial-concessions-by-ukraine-sent-to-trump-friedrich-merz/articleshow/125910363.cms",
    "timestamp": "2025-12-11T11:29:13Z"
  },
  {
    "title": "Israel says Hamas ‘will be disarmed’ after group proposes weapons freeze",
    "description": "Israel said on Thursday Hamas “will be disarmed” as part of the US-sponsored peace plan for Gaza, after a top leader from the Palestinian Islamist movement suggested a weapons freeze. The ceasefire, in effect since October 10, halted the war that began after …",
    "link": "https://www.digitaljournal.com/world/israel-says-hamas-will-be-disarmed-after-group-proposes-weapons-freeze/article",
    "timestamp": "2025-12-11T11:27:20Z"
  },
  {
    "title": "Federal Reserve Leadership Change Looms as Trump Seeks Chairman Aligned on Interest Rate Policy",
    "description": "US President Donald Trump is set to replace the outgoing Federal Reserve Chairman in the near future, with a potential list now narrowing down to just four candidates, Financial Times reported. Trump had a thorny relationship with the outgoing chairman, Jerom…",
    "link": "https://zycrypto.com/federal-reserve-leadership-change-looms-as-trump-seeks-chairman-aligned-on-interest-rate-policy/",
    "timestamp": "2025-12-11T11:25:53Z"
  },
  {
    "title": "Trump isn’t solely to blame for the affordability crisis. But neither is Biden | CNN Business",
    "description": "President Donald Trump is blaming his predecessor Joe Biden for the affordability crisis that is roiling the US economy – and politics.",
    "link": "https://www.cnn.com/2025/12/11/business/trump-affordability-crisis-blame",
    "timestamp": "2025-12-11T11:25:28Z"
  },
  {
    "title": "Germany asks US to join Ukraine peace talks in Berlin",
    "description": "European countries sent a territorial proposal on a peace deal to Washington as pressure grows for a deal to end the war.",
    "link": "https://www.politico.eu/article/germany-asks-us-join-ukraine-peace-talks-berlin-friedrich-merz/",
    "timestamp": "2025-12-11T11:25:14Z"
  },
  {
    "title": "Heading into midterms, Republicans hold edge with older voters, Reuters/Ipsos poll finds",
    "description": "WASHINGTON, Dec 11 (Reuters) - Recent electoral victories have given Democrats increasing hope of taking back one and perhaps both houses of the U.S. Congress in next year's midterm elections, but a new Reuters/Ipsos poll suggests that some of that enthusiasm…",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/heading-into-midterms-republicans-hold-edge-with-older-voters-reutersipsos-poll-finds",
    "timestamp": "2025-12-11T11:24:00Z"
  },
  {
    "title": "Pope pushes back against Trump",
    "description": "US President Donald Trump earlier called Europe a “decaying” group of nations led by “weak” leaders Read Full Article at RT.com",
    "link": "https://www.rt.com/news/629300-pope-pushes-back-against-trump/",
    "timestamp": "2025-12-11T11:23:41Z"
  },
  {
    "title": "Russia's charm offensive on Trump leaves Europe scrambling to win him back",
    "description": "Russia has tried to make the most of the White House's national security strategy and President Trump's criticism of Europe and Ukraine's leadership of late.",
    "link": "https://www.cnbc.com/2025/12/11/russias-charm-offensive-on-trump-leaves-europe-scrambling-to-win-him-back.html",
    "timestamp": "2025-12-11T11:21:36Z"
  },
  {
    "title": "South Park delivers dark Jeffrey Epstein twist in season finale skewering Trump and Vance",
    "description": "Donald Trump got his way in the Christmas-themed ‘South Park’ finale",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/south-park-season-28-finale-epstein-trump-b2882519.html",
    "timestamp": "2025-12-11T11:19:50Z"
  },
  {
    "title": "Thai Citizens Urged to Leave Cambodia as Border Clash Grinds On",
    "description": "Thailand has urged its citizens to leave Cambodia or reconsider travel as border clashes look set to stretch into a sixth day and casualties mount on both sides.",
    "link": "https://financialpost.com/pmn/business-pmn/thai-citizens-urged-to-leave-cambodia-as-border-clash-grinds-on",
    "timestamp": "2025-12-11T11:19:17Z"
  },
  {
    "title": "Rubio orders US diplomats to change font",
    "description": "US Secretary of State Marco Rubio has ordered diplomats to stop using Calibri font, calling it a \"wasteful\" example of diversity initiatives established under the Biden administration, media reports said.",
    "link": "https://www.rte.ie/news/newslens/2025/1211/1548412-us-font-changes/",
    "timestamp": "2025-12-11T11:17:29Z"
  },
  {
    "title": "Jimmy Kimmel Brands Trump With Perfect New Nickname After 'Indian' Claim",
    "description": "The talk show host wasn't having one of Trump's fantasies, so he gave him a fiercely funny new moniker.",
    "link": "https://www.huffpost.com/entry/jimmy-kimmel-donald-trump-sitting-bullshit-susie-wiles_n_693a9e03e4b0cfabad276d44",
    "timestamp": "2025-12-11T11:17:19Z"
  },
  {
    "title": "Jimmy Kimmel Warns Trump Is ‘Making the Same Mistake’ as Biden",
    "description": "Kimmel took direct aim at Trump's Pennsylvania speech, telling the president he sounded a lot like the predecessor he despises and blames so much.\nThe post Jimmy Kimmel Warns Trump Is ‘Making the Same Mistake’ as Biden first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/jimmy-kimmel-warns-trump-is-making-the-same-mistake-as-biden/",
    "timestamp": "2025-12-11T11:15:56Z"
  },
  {
    "title": "Tariffs have cost U.S. households $1,200 each since Trump returned to the White House, Democrats say",
    "description": "Sweeping taxes on imports have cost the average American household nearly $1,200 since Donald Trump returned to the White House this year, according to calculations by Democrats on Congress’ Joint Economic Committee. Using Treasury Department numbers on reven…",
    "link": "https://apnews.com/article/trump-tariffs-household-costs-inflation-398e0caf9536de6c63f0d1196c54f453",
    "timestamp": "2025-12-11T11:14:41Z"
  },
  {
    "title": "America’s bond market is quiet—almost too quiet",
    "description": "America’s bond market is quiet—almost too quiet\nScott Bessent has a cunning plan\nWhat is happening in the bond market? Not much, it seems. After explosive volatility earlier this year, which peaked around “Liberation Day”, when President Donald Trump announce…",
    "link": "https://biztoc.com/x/36028d3488abe46f",
    "timestamp": "2025-12-11T11:13:59Z"
  },
  {
    "title": "Ford, SK On To End $11.4 Billion Battery Venture Amid EV Rollback, CAFE Relaxations",
    "description": "Ford Motor Co. (NYSE:F) and South Korean battery manufacturer SK On have agreed to end the battery manufacturing venture amid EV headwinds due to regulatory changes announced by President Donald Trump and falling demand.\nFord, SK On End Partnership\nThe South …",
    "link": "https://biztoc.com/x/4318f7809a9dd2a9",
    "timestamp": "2025-12-11T11:13:31Z"
  },
  {
    "title": "ICE threatens family separation, indefinite detention to satisfy Trump deportation goal",
    "description": "By Ted Hesson and Kristina Cooke WASHINGTON, Dec 11 (Reuters) - The email from a U.S. immigration officer presented Kelly and Yerson Vargas with a stark...",
    "link": "https://www.yahoo.com/news/articles/ice-threatens-family-separation-indefinite-111231189.html",
    "timestamp": "2025-12-11T11:12:31Z"
  },
  {
    "title": "Venezuela: US seizes largest oil tanker ever taken",
    "description": "US forces have seized an oil tanker off the coast of Venezuela, President Donald Trump said, marking a sharp escalation in Washington’s pressure campaign against Nicolás Maduro’s government. Trump told reporters at the White House that they just seized a tank…",
    "link": "https://rollingout.com/2025/12/11/venezuela-us-seizes-largest-oil-tanker/",
    "timestamp": "2025-12-11T11:12:01Z"
  },
  {
    "title": "The Fed's rate cut made everyone happy. This under-the-radar sign will show when investors are getting restless again.",
    "description": "The 10-year Treasury yield gets nowhere near the attention stocks do, but it can be a very important indicator.",
    "link": "https://www.businessinsider.com/federal-reserve-rate-cut-10-year-treasury-yield-investment-signals-2025-12",
    "timestamp": "2025-12-11T11:12:01Z"
  },
  {
    "title": "Newsom trolls White House with AI video depicting Trump, Hegseth and Miller in handcuffs",
    "description": "Democratic Golden State Gov. Gavin Newsom trolled the Trump White House with an apparently AI-generated video depicting the president, Pete Hegseth, and Stephen Miller in cuffs",
    "link": "https://www.foxnews.com/politics/newsom-trolls-white-house-ai-video-depicting-trump-hegseth-miller-handcuffs",
    "timestamp": "2025-12-11T11:10:27Z"
  },
  {
    "title": "Are we getting $2000 tariff rebate checks in 2025? Trump's latest comments",
    "description": "The plan to gift Americans $2,000 is still on President Donald Trump's agenda, even as the year comes to a close.",
    "link": "https://www.oklahoman.com/story/business/economy/2025/12/11/trump-2000-tariff-rebate-checks-coming-in-2025-latest-update-comments/87701262007/",
    "timestamp": "2025-12-11T11:10:22Z"
  },
  {
    "title": "Joel Brennan, former top Evers aide, joins crowded 2026 Wisconsin governor race",
    "description": "A former top official in Wisconsin Gov. Tony Evers’ administration is running to succeed the two-term Democrat",
    "link": "https://abcnews.go.com/Politics/wireStory/joel-brennan-former-top-evers-aide-joins-crowded-128306159",
    "timestamp": "2025-12-11T11:09:52Z"
  },
  {
    "title": "Analysis-The 13-letter word tripping up Trump - and risking Republicans' hold on Congress",
    "description": "By Tim Reid, Nandita Bose and Nathan Layne WASHINGTON, Dec 11 (Reuters) - President Donald Trump’s repeated mockery of the word “affordability” is worrying...",
    "link": "https://www.yahoo.com/news/articles/analysis-13-letter-word-tripping-110625447.html",
    "timestamp": "2025-12-11T11:06:25Z"
  },
  {
    "title": "Give Us Your Ultra Wealthy. Give Us Your Corrupt Elites, Yearning to Own America",
    "description": "Trump unveiled his \"gold card\" system for letting wealthy foreigners buy their way into America, without saying where the money would go.",
    "link": "https://www.jezebel.com/trump-gold-card-immigration-corruption-million-dollar-gifts-eb-1-visa-form-i-140g-invitation",
    "timestamp": "2025-12-11T11:04:50Z"
  },
  {
    "title": "Uncommon Knowledge: The MAGA Magnet in Trump’s ‘Decaying’ Europe",
    "description": "President Donald Trump says Europe is \"decaying,\" run by \"weak\" leaders \"destroying their countries.\" That was the takeaway from his interview with Politico, an epitaph for the continent’s migration policy, strategic posture and governing class. It ricocheted…",
    "link": "https://biztoc.com/x/037f26f9517a9850",
    "timestamp": "2025-12-11T11:02:50Z"
  },
  {
    "title": "Out of hiding, Nobel winner Machado vows Venezuela return to fight 'tyranny'",
    "description": "Machado won the prize for opposing the Venezuelan regime of  President Nicolás Maduro.",
    "link": "https://www.nbcnews.com/world/venezuela/machado-venezuela-return-maduro-nobel-peace-prize-trump-rcna248582",
    "timestamp": "2025-12-11T11:02:09Z"
  },
  {
    "title": "Former UK PM defends Trump for highlighting 'Sharia law' in Britain during UN speech",
    "description": "Former British Prime Minister Liz Truss defends President Donald Trump's \"Sharia law\" comments about London, while warning of a free speech crisis and mass migration issues.",
    "link": "https://www.foxnews.com/politics/former-uk-pm-defends-trump-highlighting-sharia-law-britain-during-un-speech",
    "timestamp": "2025-12-11T11:00:46Z"
  },
  {
    "title": "McMahon recounts story of reassuring parent of special needs that funding will continue as department shrinks",
    "description": "At the American Principles Project Gala, Education Secretary Linda McMahon outlined her vision to return education control to states and local communities.",
    "link": "https://www.foxnews.com/media/mcmahon-recounts-story-reassuring-parent-special-needs-funding-continue-department-shrinks",
    "timestamp": "2025-12-11T11:00:46Z"
  },
  {
    "title": "A timeline of the ‘largest COVID-19 fraud scheme' in the United States",
    "description": "A look inside the massive Minnesota fraud scheme that involved hundreds of millions of dollars and has been called “the largest Covid-19 fraud scheme in the country.\"",
    "link": "https://www.foxnews.com/politics/timeline-largest-covid-19-fraud-scheme-united-states",
    "timestamp": "2025-12-11T11:00:42Z"
  },
  {
    "title": "They came to the US legally. Then Trump stripped their status away.",
    "description": "The Trump administration has targeted legal protections for Venezuelan immigrants.",
    "link": "https://www.salon.com/2025/12/11/they-came-to-the-us-legally-then-trump-stripped-their-status-away_partner/",
    "timestamp": "2025-12-11T11:00:38Z"
  },
  {
    "title": "The States Leading the Way on Regulating AI",
    "description": "Artificial intelligence is rushing into our lives at a breakneck pace. And the AI mavens know it: In the merging language of Silicon Valley and Capitol Hill, they like to describe our present state of affairs as a “race.” There are reports that the technology…",
    "link": "https://newrepublic.com/article/203858/california-ai-law-tech-regulation",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "Mad King Trump’s Latest Peeve: Sans Serif Fonts",
    "description": "In  The Emperor, Ryszard Kapuściński’s classic portrait of autocratic senility, Emperor Haile Selassie orders a great palace to be built in Ethiopia’s Ogaden Desert, keeps a liveried staff there for many years—but visits the site only a single day. In Addis A…",
    "link": "https://newrepublic.com/article/204274/trump-war-sans-serif-fonts",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "The Self-Delusions of Olivia Nuzzi’s American Canto",
    "description": "Midway through the journey of her life, Olivia Nuzzi found herself in Malibu, for she had wandered from the straightforward path. In exile from the East Coast, where she had held a plum gig with New York, she awoke on the West, with a plum gig at Vanity Fair,…",
    "link": "https://newrepublic.com/article/204160/self-delusions-olivia-nuzzi-american-canto",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "Breaking down claim Ghislaine Maxwell confirmed Epstein had 'secret tapes' of Trump, Clinton",
    "description": "The rumor touched on long-running speculation about Epstein's powerful connections and alleged use of hidden cameras in his properties.",
    "link": "https://www.snopes.com//news/2025/12/11/maxwell-tapes-trump-clinton/",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "United States Mint Semiquincentennial Circulating Coin Program Designs Unveiled",
    "description": "WASHINGTON, D.C., Dec. 11, 2025 (GLOBE NEWSWIRE) -- The United States Mint (Mint) unveiled the designs for the Semiquincentennial Circulating Coin Program at the National Constitution Center in Philadelphia Wednesday evening. For one year only, the new design…",
    "link": "https://www.globenewswire.com/news-release/2025/12/11/3203727/0/en/United-States-Mint-Semiquincentennial-Circulating-Coin-Program-Designs-Unveiled.html",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "Will Trump Torpedo North American Trade?",
    "description": "Stephania Taladrid on the scramble among envoys from the United States, Mexico, and Canada to preserve a trade agreement as a crucial negotiating deadline looms.",
    "link": "https://www.newyorker.com/news/the-lede/will-trump-torpedo-north-american-trade",
    "timestamp": "2025-12-11T11:00:00Z"
  },
  {
    "title": "Amanda Seyfried refuses to apologise for calling Charlie Kirk hateful: ‘Pretty damn factual’",
    "description": "Mean Girls actress Amanda Seyfried has doubled down on calling Charlie Kirk “hateful”, stating that her opinion on the Turning Point USA founder is “pretty damn factual”. Following the death of the right-wing activist and Donald Trump supporter in September, …",
    "link": "https://www.thepinknews.com/2025/12/11/amanda-seyfried-refuses-apologise-charlie-kirk-hateful/",
    "timestamp": "2025-12-11T10:59:09Z"
  },
  {
    "title": "Thailand reports first civilian deaths in renewed border conflict with Cambodia",
    "description": "Thai officials have announced four civilian deaths as heavy combat flares along the border with Cambodia",
    "link": "https://abcnews.go.com/International/wireStory/thailand-reports-civilian-deaths-renewed-border-conflict-cambodia-128303875",
    "timestamp": "2025-12-11T10:54:00Z"
  },
  {
    "title": "Politics: Trump Is Making the Same Mistake as Biden",
    "description": "Downplaying voters’ economic pain will backfire.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/trump-is-making-the-same-mistake-as-biden-e574898/",
    "timestamp": "2025-12-11T10:48:00Z"
  },
  {
    "title": "Republicans worry Trump is missing the mark on affordability after Pennsylvania speech",
    "description": "President Donald Trump’s high-profile economic speech on Tuesday night was meant to alleviate Americans’ concerns about the cost of living. Instead, it mainly appeared to deepen fears within the GOP that he’s not quite getting it.",
    "link": "https://www.cnn.com/2025/12/11/politics/republicans-worry-trump-affordability-message",
    "timestamp": "2025-12-11T10:46:45Z"
  },
  {
    "title": "What to know as trial nears for the Wisconsin judge accused of helping an immigrant dodge agents",
    "description": "Defense attorneys and prosecutors are set to choose the jurors who will decide whether a Wisconsin judge accused of helping a Mexican immigrant dodge federal officers broke the law",
    "link": "https://abcnews.go.com/US/wireStory/trial-nears-wisconsin-judge-accused-helping-immigrant-dodge-128302810",
    "timestamp": "2025-12-11T10:45:46Z"
  },
  {
    "title": "Fox News’ Streaming Service Has Its Answer to The Sopranos and Mad Men. Somehow, Martin Scorsese Made It.",
    "description": "I became a brave member of Fox Nation to watch—and I'm not altogether glad I did.",
    "link": "https://slate.com/culture/2025/12/fox-news-saints-donald-trump-martin-scorsese.html",
    "timestamp": "2025-12-11T10:45:00Z"
  },
  {
    "title": "Politics: What Explains Trump’s Aggression Toward Venezuela? Who Knows.",
    "description": "To better understand why the president is inexplicably going after Venezuela, one must study the behavior of small children.",
    "link": "https://www.sueddeutsche.de/projekte/artikel/politik/what-explains-trump-s-aggression-toward-venezuela-who-knows-e524224/",
    "timestamp": "2025-12-11T10:45:00Z"
  },
  {
    "title": "'Venezuela has already been invaded' says Nobel Peace Prize winner when asked about Trump intervention",
    "description": "Venezuelan opposition leader, Maria Corina Machado, claimed Russia, Iran, Hezbollah, Hamas, and drug cartels were all active in her country when the question of a US invasion was raised.",
    "link": "https://news.sky.com/story/venezuela-has-already-been-invaded-says-nobel-peace-prize-winner-machado-when-asked-about-trump-intervention-13482086",
    "timestamp": "2025-12-11T10:43:00Z"
  },
  {
    "title": "Trump said to plan naming US general as Gaza force head",
    "description": "United States President Donald Trump is planning to appoint an American two-star general, whose name remains unknown for now, to lead the International Stabilization Force (ISF) in Gaza, Axios reporte...",
    "link": "https://biztoc.com/x/897c8fdcce5b3e2f",
    "timestamp": "2025-12-11T10:40:20Z"
  },
  {
    "title": "Marjorie Taylor Greene Makes Terrifying Prediction for Trump",
    "description": "MAGA Rep. Marjorie Taylor Greene has issued a stark warning to President Donald Trump amid their high-profile divorce. The Georgia Republican told CBS News...",
    "link": "https://www.thedailybeast.com/marjorie-taylor-greene-makes-terrifying-prediction-for-trump/",
    "timestamp": "2025-12-11T10:37:36Z"
  },
  {
    "title": "Trump administration separates thousands of migrant families in the US",
    "description": "A new wave of immigration enforcement is dividing families inside the U.S. Federal officials and their local law enforcement partners are detaining tens of thousands of asylum-seekers and migrants",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-separates-thousands-migrant-families-us-128302871",
    "timestamp": "2025-12-11T10:37:29Z"
  },
  {
    "title": "BBC Orders First Full Season Of ‘The Celebrity Apprentice’",
    "description": "The show that built President Donald Trump’s TV persona is finally getting a full celebrity version in the UK. Lord Alan Sugar will front The Celebrity Apprentice for the BBC next year, marking a first full season for the broadcaster. Several specials have fe…",
    "link": "http://deadline.com/2025/12/bbc-celebrity-apprentice-first-full-season-1236645612/",
    "timestamp": "2025-12-11T10:32:12Z"
  },
  {
    "title": "Senator Endorses Discredited Doctor’s Book on a Chemical He Claims Treats Everything From Autism to Cancer",
    "description": "Wisconsin's Ron Johnson has a history of spreading vaccine misinformation. Now he's giving credence to assertions about the therapeutic powers of chlorine dioxide, a disinfectant and deodorizer. “It is all lunacy,\" one expert said.",
    "link": "http://www.propublica.org/article/ron-johnson-wisconsin-chlorine-dioxide-pierre-kory-endorsement",
    "timestamp": "2025-12-11T10:30:00Z"
  },
  {
    "title": "House Democratic Leaders Urged to Force a Vote on Stock Trading Ban",
    "description": "Enough Republicans are on a discharge petition to get a House vote to end congressional stock trading—if Democrats sign on.\nThe post House Democratic Leaders Urged to Force a Vote on Stock Trading Ban appeared first on The American Prospect.",
    "link": "http://prospect.org/2025/12/11/house-democratic-leaders-urged-to-force-vote-stock-trading-ban/",
    "timestamp": "2025-12-11T10:30:00Z"
  },
  {
    "title": "Merz: Trump admin fails to understand EU is a strong union",
    "description": "German Chancellor Friedrich Merz said on Thursday that he tried to explain the history of the European Union to United States President Donald Trump on his last trip to Washington, but that the Trump ...",
    "link": "https://biztoc.com/x/e1e36d648892de58",
    "timestamp": "2025-12-11T10:28:56Z"
  },
  {
    "title": "Kremlin says Russia is interested in foreign investment after report of major U.S. plans",
    "description": "MOSCOW, Dec 11 (Reuters) - The Kremlin said on Thursday that Russia was interested in attracting additional foreign investment after the Wall Street Journal reported that the U.S. plan for peace in Ukraine includes proposals to invest in Russian rare earths a…",
    "link": "https://www.thestar.com.my/news/world/2025/12/11/kremlin-says-russia-is-interested-in-foreign-investment-after-report-of-major-us-plans",
    "timestamp": "2025-12-11T10:25:00Z"
  }
]