[
  {
    "title": "Why Lara Trump Photo Is Causing a Stir in the Middle East",
    "description": "A photo of President Donald Trump's daughter-in-law with an Egyptian artist, taken at a music charity event, has gone viral.",
    "link": "https://www.newsweek.com/why-lara-trump-photo-causing-stir-middle-east-2111669",
    "timestamp": "2025-08-11T15:37:05Z"
  },
  {
    "title": "Donald Trump's Niece Highlights His 'Mental Health Collapse' after His Latest 'Confusing' Move",
    "description": "Donald Trump's mental health has returned to discussion after he pulled bold but bizarre antics on the roof of the White House. What was he trying to do?",
    "link": "https://www.inquisitr.com/donald-trumps-niece-highlights-his-mental-health-collapse-after-his-latest-confusing-move",
    "timestamp": "2025-08-11T15:36:13Z"
  },
  {
    "title": "Judge denies DOJ bid to unseal Ghislaine Maxwell grand jury records",
    "description": "A federal judge on Monday denied the Department of Justice’s request to unseal grand jury materials in Ghislaine Maxwell’s criminal case. In his 31-page ruling, U.S. District Judge Paul A. Engelmayer, a Barack Obama appointee, says that the grand jury materia…",
    "link": "https://freerepublic.com/focus/f-news/4333950/posts",
    "timestamp": "2025-08-11T15:36:07Z"
  },
  {
    "title": "Trump’s Tariff Tantrums Are Hobbling the U.S. Economy",
    "description": "Trump’s Tariff Tantrums Are Hobbling the U.S. Economybtm25@yale.edu\nMon, 08/11/2025 - 11:34\n Faculty Viewpoints\n <li>\n Jeffrey A. Sonnenfeld\n\n\n Senior Associate Dean for Leadership Studies & Lester Crown Professor in the Practice of Management\n\r\n\n \r\n\n</li>\n <…",
    "link": "https://insights.som.yale.edu/insights/trumps-tariff-tantrums-are-hobbling-the-us-economy",
    "timestamp": "2025-08-11T15:34:18Z"
  },
  {
    "title": "Trump says he will evict homeless from Washington DC - live updates - BBC",
    "description": "Trump says he will evict homeless from Washington DC - live updatesBBC Live updates: The latest on Trump’s federal crackdown on Washington, DC | CNN PoliticsCNN Trump demands homeless people 'immediately' move out of Washington DCBBC Trump readies federal mov…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178643290",
    "timestamp": "2025-08-11T15:32:48Z"
  },
  {
    "title": "Southwest flight takes off, leaving 2 blind Florida women behind in New Orleans",
    "description": "Two blind women from Florida are outraged at Southwest Airlines after, they said, they were left behind by their flight. Southwest Airlines forgot to board passengers Camille Tate and Sherri Brun, who are both blind, on to their July 14 flight out of New Orle…",
    "link": "https://freerepublic.com/focus/f-chat/4333949/posts",
    "timestamp": "2025-08-11T15:32:20Z"
  },
  {
    "title": "Trump Names 5 Cities as He Says National Guard Deployment Will 'Go Further'",
    "description": "The president's remarks came as he discussed his decision to formally declare a public safety emergency in Washington, D.C.",
    "link": "https://www.newsweek.com/trump-names-5-cities-he-says-national-guard-deployment-will-go-further-2111847",
    "timestamp": "2025-08-11T15:31:39Z"
  },
  {
    "title": "Trump takes control of Metro Police, deploys National Guard to take on Washington crime",
    "description": "President Donald Trump announced Monday that he is activating National Guard troops and is taking over the Metropolitan Police Department to tackle crime in Washington, after beefing up federal law enforcement presence in the nation's capital Saturday. \"I'm d…",
    "link": "https://freerepublic.com/focus/f-news/4333948/posts",
    "timestamp": "2025-08-11T15:31:31Z"
  },
  {
    "title": "The Self-Sustaining Outrage Cycle of Sydney Sweeney's Jeans Ad",
    "description": "Nearly three weeks in, it's getting difficult to remember what everybody was so mad about—or if more than a handful were ever mad at all.",
    "link": "https://www.yahoo.com/entertainment/articles/self-sustaining-outrage-cycle-sydney-153124614.html",
    "timestamp": "2025-08-11T15:31:24Z"
  },
  {
    "title": "The Self-Sustaining Outrage Cycle of Sydney Sweeney's Jeans Ad",
    "description": "Nearly three weeks in, it's getting difficult to remember what everybody was so mad about—or if more than a handful were ever mad at all.",
    "link": "https://reason.com/2025/08/11/the-self-sustaining-outrage-cycle-of-sydney-sweeneys-jeans-ad/",
    "timestamp": "2025-08-11T15:31:24Z"
  },
  {
    "title": "Trump deploys army reserves to Washington DC and takes control of local police",
    "description": "The US President said crime in the capital was out of control, but statistics show rates have reached a 30-year low.",
    "link": "https://www.thejournal.ie/trump-deploys-army-reserves-to-washington-dc-6787784-Aug2025/",
    "timestamp": "2025-08-11T15:30:23Z"
  },
  {
    "title": "Drone Strike Halts Rosneft Oil Refinery Operations",
    "description": "A Sunday drone attack on the Saratov refinery, owned by Russia’s oil giant Rosneft, prompted the facility to halt the intake of crude oil, a source with knowledge of the matter told Bloomberg on Monday.  The Saratov Refinery in the Volga region has the capaci…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Drone-Strike-Halts-Rosneft-Oil-Refinery-Operations.html",
    "timestamp": "2025-08-11T15:30:00Z"
  },
  {
    "title": "David Letterman Weighs in On Trump’s White House Ballroom",
    "description": "By\n Matt Solomon\n Published: August 11th, 2025",
    "link": "https://www.cracked.com/article_47806_david-letterman-weighs-in-on-trumps-white-house-ballroom.html",
    "timestamp": "2025-08-11T15:30:00Z"
  },
  {
    "title": "Watch: Trump puts Washington, DC, police under federal control, deploys National Guard (Kevin Breuninger/CNBC)",
    "description": "Kevin Breuninger / CNBC:\nWatch: Trump puts Washington, DC, police under federal control, deploys National Guard … President Donald Trump is considering deploying up to 1,000 National Guard troops in Washington, D.C., as he complains about violent crime and ho…",
    "link": "https://www.memeorandum.com/250811/p54",
    "timestamp": "2025-08-11T15:30:00Z"
  },
  {
    "title": "What the Left Must Learn from Mamdani",
    "description": "Our role on the Left is to set aside our cynicism and push through the specter of electoral losses to help set the table for our political future.",
    "link": "https://inthesetimes.com/article/the-left-zohran-mamdani-election-brandon-johnson-win-power",
    "timestamp": "2025-08-11T15:30:00Z"
  },
  {
    "title": "‘They Want Transgender for Everybody!’ Trump Goes Way Off Script in Attack on Democrats While Talking DC Crime",
    "description": "“That's what they — why they want transgender for everybody! Everybody transgender. And they — they've just got walloped in an election\"\nThe post ‘They Want Transgender for Everybody!’ Trump Goes Way Off Script in Attack on Democrats While Talking DC Crime fi…",
    "link": "https://www.mediaite.com/media/tv/they-want-transgender-for-everybody-trump-goes-way-off-script-in-attack-on-democrats-while-talking-dc-crime/",
    "timestamp": "2025-08-11T15:29:31Z"
  },
  {
    "title": "Breitbart News Daily Podcast Ep. 826: Breitbart EIC Alex Marlow on the Latest Lawfare Investigations",
    "description": "Breitbart Editor-in-Chief and bestselling \"Breaking the Law\" author Alex Marlow discusses the latest lawfare investigations and who needs to be investigated next.\nThe post Breitbart News Daily Podcast Ep. 826: Breitbart EIC Alex Marlow on the Latest Lawfare I…",
    "link": "https://www.breitbart.com/politics/2025/08/11/breitbart-news-daily-podcast-ep-826-breitbart-eic-alex-marlow-on-the-latest-lawfare-investigations/",
    "timestamp": "2025-08-11T15:29:16Z"
  },
  {
    "title": "US chipmakers to pay Washington for trade with China – media",
    "description": "Nvidia and AMD have reportedly agreed to hand the US government 15% of their Chinese revenues in exchange for export licenses Read Full Article at RT.com",
    "link": "https://www.rt.com/business/622759-chipmakers-pay-us-trade-china/",
    "timestamp": "2025-08-11T15:28:43Z"
  },
  {
    "title": "Nvidia, AMD to pay 15% of China chip sale revenue to U.S. government",
    "description": "Nvidia and AMD agreed to share 15 per cent of their revenues from chip sales to China with the U.S. government, a U.S. government official has confirmed.",
    "link": "https://www.cbc.ca/news/business/nvidia-amd-china-chip-sale-revenue-us-1.7605805",
    "timestamp": "2025-08-11T15:28:29Z"
  },
  {
    "title": "Why does JD Vance want Elon Musk to return to White House, work with Donald Trump? Here's what US vice president said in new interview",
    "description": "JD Vance has expressed his wish for Elon Musk to reconnect with Donald Trump and return to a role in the White House. In an interview, Vance called Musk’s relationship with Trump “complicated” but urged unity before the midterms, despite past disagreements an…",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-does-jd-vance-want-elon-musk-to-return-to-white-house-work-with-donald-trump-heres-what-us-vice-president-said-in-new-interview/articleshow/123239708.cms",
    "timestamp": "2025-08-11T15:28:01Z"
  },
  {
    "title": "Trump says he will take control of Washington DC police, deploy National Guard to US capital",
    "description": "Move comes despite statistics showing that violent crime hit a 30-year low in 2024",
    "link": "https://www.irishtimes.com/world/us/2025/08/11/trump-says-he-will-take-control-of-washington-dc-police-deploy-national-guard-to-capital/",
    "timestamp": "2025-08-11T15:27:32Z"
  },
  {
    "title": "Trump's big bill powering his mass deportations, Congress starting to ask questions",
    "description": "Donald Trump's administration secured funds for border security. This led to increased Immigration and Customs Enforcement operations. Detentions and deportations are rising. Congress is raising concerns about the allocation of funds. Money is being shifted f…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-big-bill-powering-his-mass-deportations-congress-starting-to-ask-questions/articleshow/123240003.cms",
    "timestamp": "2025-08-11T15:27:26Z"
  },
  {
    "title": "Trump Deploys National Guard To Tackle Washington Crime",
    "description": "US President Donald Trump said Monday he will deploy military and federal law enforcement in Washington as he seeks to curb violent crime in the nation's capital.",
    "link": "https://www.ibtimes.com/trump-deploys-national-guard-tackle-washington-crime-3780667",
    "timestamp": "2025-08-11T15:27:09Z"
  },
  {
    "title": "Iran Caves, Welcomes U.N. Nuclear Official into Country",
    "description": "A senior official with the International Atomic Energy Agency (IAEA), the United Nations' nuclear watchdog body, is expected to land in Tehran on Monday for talks with the rogue Islamist regime – less than two months after Iran outlawed cooperation with the a…",
    "link": "https://www.breitbart.com/middle-east/2025/08/11/iran-caves-welcomes-u-n-nuclear-official-into-country/",
    "timestamp": "2025-08-11T15:27:02Z"
  },
  {
    "title": "Fans Turn on Jimmy Fallon for Hosting Greg Gutfeld on 'The Tonight Show'",
    "description": "Viewers turned on late-night talk show host Jimmy Fallon for hosting Fox News' Greg Gutfeld on NBC's \"The Tonight Show\" last week.\nThe post Fans Turn on Jimmy Fallon for Hosting Greg Gutfeld on ‘The Tonight Show’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/entertainment/2025/08/11/fans-turn-on-jimmy-fallon-for-hosting-greg-gutfeld-on-the-tonight-show/",
    "timestamp": "2025-08-11T15:26:30Z"
  },
  {
    "title": "Russia Using Donald Trump Peace Talks to Divide US and Europe: ISW",
    "description": "Moscow wants to weaken cohesion between the U.S, Ukraine and Europe, the think tank said.",
    "link": "https://biztoc.com/x/d2248e58ed704eb3",
    "timestamp": "2025-08-11T15:26:12Z"
  },
  {
    "title": "What the new China chip taxes tell us about doing business in Trump's America",
    "description": "In Donald Trump's second term, the U.S. government is increasingly involving itself in private business — like a reported 15% tax it has placed on some chip exports to China.\nFatih Aktas /Anadolu via Getty Images\nDonald Trump is letting Nvidia and AMD sell so…",
    "link": "https://biztoc.com/x/53d5953ae0ef62ba",
    "timestamp": "2025-08-11T15:26:04Z"
  },
  {
    "title": "Our relationship with US important, trade just one aspect: Vikram Misri briefs Shashi Tharoor-led Parliamentary panel",
    "description": "Despite the U.S. imposing a 50% tariff on Indian exports due to continued Russian oil purchases, India hopes trade talks will proceed, emphasizing the importance of the broader relationship. Lawmakers were briefed that trade is just one aspect of the relation…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/our-relationship-with-us-important-trade-just-one-aspect-vikram-misri-briefs-shashi-tharoor-led-parliamentary-panel/articleshow/123239988.cms",
    "timestamp": "2025-08-11T15:25:42Z"
  },
  {
    "title": "Ousted FDA vaccine chief Vinay Prasad is returning to the agency",
    "description": "Robert F. Kennedy Jr. who supports his work scrutinizing COVID-19 vaccines.",
    "link": "https://www.bostonherald.com/2025/08/11/fda-vaccine-chief-returns/",
    "timestamp": "2025-08-11T15:25:13Z"
  },
  {
    "title": "More than 100 former MEPs urge EU to suspend association agreement with Israel",
    "description": "Starvation of civilian population in Gaza amounts to ‘nothing short of a war crime’, open letter states",
    "link": "https://www.irishtimes.com/world/2025/08/11/more-than-100-former-meps-urge-eu-to-suspend-association-agreement-with-israel/",
    "timestamp": "2025-08-11T15:25:02Z"
  },
  {
    "title": "WATCH: Trump puts DC police department under federal control, deploys National Guard",
    "description": "President Donald Trump announced that he is placing the D.C. Metropolitan Police Department under federal control and deploying the National Guard \"to help re-establish law, order and public safety.”",
    "link": "https://abcnews.go.com/GMA/News/video/trump-puts-dc-police-department-federal-control-deploys-124546965",
    "timestamp": "2025-08-11T15:24:40Z"
  },
  {
    "title": "Trump busted in real time as networks' graphics shoot down DC crime claims",
    "description": "No sooner did Donald Trump begin addressing the nation about federalizing the D.C. Police Department and putting National Guard on the streets despite crime being down, MSNBC posted a bright red graphic next to him that showed he was making up his numbers.Acr…",
    "link": "https://www.rawstory.com/trump-dc-crime-numbers/",
    "timestamp": "2025-08-11T15:22:45Z"
  },
  {
    "title": "BREAKING: Trump Taps Key Cabinet Official to Take Control of DC Police",
    "description": "President Donald Trump is placing Washington, D.C., law enforcement under federal control. The Home Rule Act of 1973 also allows the president to assume temporary... Read More\nThe post BREAKING: Trump Taps Key Cabinet Official to Take Control of DC Police app…",
    "link": "https://www.dailysignal.com/2025/08/11/breaking-trump-taps-key-cabinet-official-take-control-dc-police/",
    "timestamp": "2025-08-11T15:21:03Z"
  },
  {
    "title": "Trump Deploys National Guard To DC, Takes Control Of City Police",
    "description": "President Donald Trump announced he would take control of Washington DC’s Metropolitan Police Department and deploy the National Guard as part of a push to reduce crime and homelessness in the nation’s capital.",
    "link": "https://www.ndtvprofit.com/world/trump-deploys-national-guard-to-dc-takes-control-of-city-police",
    "timestamp": "2025-08-11T15:20:28Z"
  },
  {
    "title": "National Guard deployed in Washington DC amid capital crime crackdown: What is it and who can join them?",
    "description": "President Trump announced a significant escalation of law enforcement in Washington D.C., deploying the National Guard and placing the city's police under federal control. This action follows a surge in federal law enforcement prompted by high crime rates, in…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-trump-deploys-national-guard-deployed-in-washington-dc-amid-capital-crime-crackdown-what-is-it-and-who-can-join-them/articleshow/123239888.cms",
    "timestamp": "2025-08-11T15:20:19Z"
  },
  {
    "title": "Russia Using Donald Trump Peace Talks to Divide US and Europe: ISW",
    "description": "Moscow wants to weaken cohesion between the U.S, Ukraine and Europe, the think tank said.",
    "link": "https://www.newsweek.com/russia-ukraine-isw-war-trump-2111641",
    "timestamp": "2025-08-11T15:20:05Z"
  },
  {
    "title": "Ethereum options lack euphoria: What's the biggest risk to $5K ETH price?",
    "description": "Sustained ETF inflows and corporate reserves could position ETH to outperform and challenge $5,000 for the first time ever.",
    "link": "https://cointelegraph.com/news/ethereum-options-lack-euphoria-whats-the-biggest-risk-5k-eth-price",
    "timestamp": "2025-08-11T15:18:20Z"
  },
  {
    "title": "Republican: Rising Prices Are ‘For Good Of The Country’",
    "description": "South Carolina multimillionaire Republican Rep. Ralph Norman acknowledged that the public is seeing higher prices as a result of tariffs imposed by Trump, even though the president claims that prices are lower. However, he somehow argued that it's \"for the go…",
    "link": "https://crooksandliars.com/2025/08/republican-somehow-claims-rising-prices",
    "timestamp": "2025-08-11T15:18:20Z"
  },
  {
    "title": "Ousted FDA vaccine chief Vinay Prasad is returning to the agency",
    "description": "WASHINGTON (AP) — A Food and Drug Administration official is getting his job back as the agency’s top vaccine regulator, less than two weeks after he was pressured to step down at the urging of biotech executives, patient groups and conservative allies of Pre…",
    "link": "https://financialpost.com/pmn/ousted-fda-vaccine-chief-vinay-prasad-is-returning-to-the-agency",
    "timestamp": "2025-08-11T15:18:01Z"
  },
  {
    "title": "EU Commission stays out of US contraceptive destruction row",
    "description": "Aid groups warn the loss could leave 1.4 million African women without contraception",
    "link": "https://www.euractiv.com/section/health-consumers/news/eu-commission-stays-out-of-us-contraceptive-destruction-row/",
    "timestamp": "2025-08-11T15:16:59Z"
  },
  {
    "title": "What the new China chip taxes tells us about doing business in Trump's America",
    "description": "Donald Trump is letting Nvidia and AMD sell some chips to China — but only if they pay a 15% tax. That's the opposite of Trump's tariff push.",
    "link": "https://www.businessinsider.com/nvidia-amd-sell-chips-china-tax-trump-tariff-why-2025-8",
    "timestamp": "2025-08-11T15:16:57Z"
  },
  {
    "title": "Trump Places DC Police Under Federal Control: ‘We’re Going to Take Our Capital Back’ | Video",
    "description": "\"Crime, Savagery, Filth and Scum will DISAPPEAR. I will, MAKE OUR CAPITAL GREAT AGAIN,\" the president says\nThe post Trump Places DC Police Under Federal Control: ‘We’re Going to Take Our Capital Back’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-washington-dc-liberation-day-police-federal-control/",
    "timestamp": "2025-08-11T15:16:49Z"
  },
  {
    "title": "Trump Placing D.C. Metropolitan Police Department Under Direct Federal Control and Activating National Guard",
    "description": "President Donald Trump announced on Monday that he is taking major steps to address rampant crime in Washington, DC.\nThe post Trump Placing D.C. Metropolitan Police Department Under Direct Federal Control and Activating National Guard appeared first on Breitb…",
    "link": "https://www.breitbart.com/politics/2025/08/11/trump-placing-d-c-metropolitan-police-department-under-direct-federal-control-activating-national-guard/",
    "timestamp": "2025-08-11T15:16:43Z"
  },
  {
    "title": "‘TAKE THE TEST!’ Trump urges cognitive exam for Jasmine Crockett, whom he says is ‘slightly dumber’ than AOC",
    "description": "'These Radical Left Lunatics would all fail this test in a spectacular show of stupidity and incompetence'",
    "link": "https://www.wnd.com/2025/08/take-test-trump-urges-cognitive-exam-jasmine-crockett/",
    "timestamp": "2025-08-11T15:16:25Z"
  },
  {
    "title": "Ousted FDA vaccine chief Vinay Prasad is returning to the agency",
    "description": "A Food and Drug Administration official is getting his job back as the agency's top vaccine regulator, less than two weeks after he was pressured to step...",
    "link": "https://www.yahoo.com/news/articles/ousted-fda-vaccine-chief-vinay-151457553.html",
    "timestamp": "2025-08-11T15:14:57Z"
  },
  {
    "title": "Vance: Ukraine Peace Talks in England Made 'Significant Progress' Toward Ending War",
    "description": "A meeting in Britain between U.S. Vice President JD Vance, UK Foreign Secretary David Lammy and representatives from Kyiv made \"significant progress\" towards ending the war in Ukraine.\nThe post Vance: Ukraine Peace Talks in England Made ‘Significant Progress’…",
    "link": "https://www.breitbart.com/europe/2025/08/11/vance-ukraine-peace-talks-in-england-made-significant-progress-toward-ending-war/",
    "timestamp": "2025-08-11T15:14:34Z"
  },
  {
    "title": "Trump to deploy the National Guard to D.C., place local police under federal control",
    "description": "If crime rates in Washington, D.C. are already at their lowest levels in decades, why is Donald Trump launching yet another power-grab?",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-deploy-national-guard-dc-place-local-police-federal-control-rcna224303",
    "timestamp": "2025-08-11T15:14:24Z"
  },
  {
    "title": "Trump says he's placing Washington police under federal control and deploying the National Guard",
    "description": "President Donald Trump says he’s taking over Washington’s police department and activating 800 members of the National Guard in the hopes of reducing crime, even as city officials stressed crime is already falling in the nation’s capital",
    "link": "https://www.wftv.com/news/politics/trump-says-hes/FFIXGBXLDNDD3J5LIIYORIGZVA/",
    "timestamp": "2025-08-11T15:14:10Z"
  },
  {
    "title": "EU holds talks amid fear that Trump-Putin meeting will sideline Ukraine",
    "description": "The talks come head of a landmark meeting between the presidents of the US and Russia in Alaska on Friday.",
    "link": "https://www.aljazeera.com/news/2025/8/11/eu-holds-talks-amid-fear-that-trump-putin-meeting-will-sideline-ukraine",
    "timestamp": "2025-08-11T15:13:53Z"
  },
  {
    "title": "Donald Trump to chair Olympics task force and demand 'strong' tests to keep trans athletes out",
    "description": "The President has wrongly implied Algerian Imane Khalief, an Algerian boxing gold medalist, was trans and should not compete.",
    "link": "https://www.advocate.com/politics/donald-trump-olympics-transgender-task-force",
    "timestamp": "2025-08-11T15:12:39Z"
  },
  {
    "title": "Well, This Ought to Make Heads Explode All Across D.C.",
    "description": "There probably isn't a bright red line or some official metric a city must measure up to — down to? — before being rated as Officially Ungovernable. But, if there is, surely Washington, D.C., crossed soon after the Martyrdom of St. George Floyd of Minneapolis…",
    "link": "https://freerepublic.com/focus/f-news/4333943/posts",
    "timestamp": "2025-08-11T15:11:55Z"
  },
  {
    "title": "Nvidia is willing to pay the US government $3 billion to save its business in China",
    "description": "Nvidia is set to see $20 billion in revenue from China in its 2026 fiscal year.",
    "link": "https://finance.yahoo.com/news/nvidia-is-willing-to-pay-the-us-government-3-billion-to-save-its-business-in-china-151107429.html",
    "timestamp": "2025-08-11T15:11:07Z"
  },
  {
    "title": "Trump says he’s placing Washington police under federal control and deploying the National Guard",
    "description": "Trump has promised to address homelessness and crime. Trump posted online Monday the nation's capital would be \"LIBERATED\" and he'd end the \"days of ruthlessly killing, or hurting, innocent people.\"",
    "link": "https://www.pbs.org/newshour/politics/trump-says-hes-placing-washington-police-under-federal-control-and-deploying-the-national-guard",
    "timestamp": "2025-08-11T15:11:05Z"
  },
  {
    "title": "Trump is losing his foolish trade war. This will cost ordinary Americans greatly (Steven Greenhouse/The Guardian)",
    "description": "Steven Greenhouse / The Guardian:\nTrump is losing his foolish trade war.  This will cost ordinary Americans greatly  —  Trump's trade war has pushed up inflation, slashed US job gains, slowed economic growth and caused the manufacturing sector to sputter  —  …",
    "link": "https://www.memeorandum.com/250811/p52",
    "timestamp": "2025-08-11T15:10:00Z"
  },
  {
    "title": "Trump Warns Fascist D.C. Takeover Is Just the Beginning",
    "description": "Donald Trump’s usurpation of law enforcement in the nation’s capital carried a warning for America’s liberal bastions.Speaking at a White House press briefing Monday morning, Trump declared a “public safety emergency,” emphasizing Washington’s supposedly star…",
    "link": "https://newrepublic.com/post/198978/donald-trump-warns-fascist-dc-takeover-just-beginning",
    "timestamp": "2025-08-11T15:09:16Z"
  },
  {
    "title": "Zelensky says Russia is deceiving Washington ahead of US-Russia talks",
    "description": "Ukrainian President Volodymyr Zelensky accused Moscow of attempting to mislead Washington, a few days before a planned meeting between US President Donald Trump and Russian President Vladimir Putin in Alaska.\"We understand Russia's intention to try to deceive…",
    "link": "https://freerepublic.com/focus/f-news/4333940/posts",
    "timestamp": "2025-08-11T15:07:41Z"
  },
  {
    "title": "Is This the Decade of the Youth Vote?",
    "description": "Tisya Mavuram\n\n\n\nYoung voters showed up for Zohran Mamdani. They could reshape American politics elsewhere, too.\r\n\n\r\n\n\nThe post Is This the Decade of the Youth Vote? appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/is-this-the-decade-of-the-youth-vote/",
    "timestamp": "2025-08-11T15:07:17Z"
  },
  {
    "title": "'Where they live': Trump vows he's 'getting rid of the slums' in DC anti-crime takeover",
    "description": "President Donald Trump vowed to eradicate \"slums\" as part of his takeover of Washington, D.C.During a Monday press conference, Trump announced that he was placing the Metropolitan Police Department of the District of Columbia under federal control and threate…",
    "link": "https://www.rawstory.com/trump-slums-washington-dc/",
    "timestamp": "2025-08-11T15:06:48Z"
  },
  {
    "title": "‘Full speed ahead’ on Cape bridges after Trump claws back Pike cash, Mass. Sen. Warren says",
    "description": "\"We’re underway and we’re going full speed ahead, and that’s exactly as we should be,\" U.S. Sen. Elizabeth Warren, D-Mass., said during a televised interview...",
    "link": "https://www.masslive.com/politics/2025/08/full-speed-ahead-on-cape-bridges-after-trump-claws-back-pike-cash-mass-sen-warren-says.html",
    "timestamp": "2025-08-11T15:04:59Z"
  },
  {
    "title": "JD Vance and Marco Rubio's Odds of Being Trump MAGA Heir",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nWith President Donald Trump's presidential term ending in 2028, political watchers are speculating about who will inherit the MAGA movement's mantle.\nTwo key figures, Vice President JD Vance and Secretary of S…",
    "link": "https://biztoc.com/x/c85b25fd8009908b",
    "timestamp": "2025-08-11T15:04:36Z"
  },
  {
    "title": "Trump on DC: We'll bring in the military if needed",
    "description": "United States President Donald Trump stated that his administration will deploy the military to Washington DC \"if needed.\" The president made his comment shortly after placing the nation's capital dir...",
    "link": "https://biztoc.com/x/b5bf34d0da342367",
    "timestamp": "2025-08-11T15:04:27Z"
  },
  {
    "title": "Trump to push swift end to sanctuary cities, bail reform",
    "description": "US President Donald Trump urged Republicans to act swiftly on ending sanctuary cities and modifying no-cash bail policies on Monday, citing rising crime in Washington, DC.Speaking at a press conferenc...",
    "link": "https://biztoc.com/x/922b2562c6937589",
    "timestamp": "2025-08-11T15:04:05Z"
  },
  {
    "title": "Trump, Putin Set for High-Stakes Alaska Summit On Ukraine War",
    "description": "The United States officials are racing to finalize arrangements for Friday's high-stakes summit between President Donald Trump and Russian President Vladimir Putin in Alaska, aimed at advancing peace talks to end the war in Ukraine. \nThe venue remains undecid…",
    "link": "https://biztoc.com/x/dbdf1803f6ccf471",
    "timestamp": "2025-08-11T15:03:56Z"
  },
  {
    "title": "India casts wider net for seafood exports as US tariffs bite",
    "description": "Hit by steep US tariffs on seafood, especially shrimp, India is targeting new export markets including the UK, EU, Japan, and West Asia.",
    "link": "https://www.livemint.com/industry/india-seafood-exports-new-markets-uk-eu-japan-11754910305775.html",
    "timestamp": "2025-08-11T15:03:53Z"
  },
  {
    "title": "Zelenskiy calls Indian, Saudi leaders ahead of Trump-Putin talks",
    "description": "KYIV (Reuters) -Ukrainian President Volodymyr Zelenskiy spoke to the leaders of India and Saudi Arabia on Monday, in an effort to mobilise support for Kyiv...",
    "link": "https://ca.news.yahoo.com/zelenskiy-calls-indian-saudi-leaders-150336375.html",
    "timestamp": "2025-08-11T15:03:36Z"
  },
  {
    "title": "Trump says he will take control of Washington DC police, deploy National Guard to ‘re-establish law and order’",
    "description": "The White House increased the presence of federal law enforcement in the city, deploying 450 officers across all four quadrants in busy areas.",
    "link": "https://indianexpress.com/article/world/trump-says-he-will-take-control-of-washington-dc-police-deploy-national-guard-to-re-establish-law-and-order-10183200/",
    "timestamp": "2025-08-11T15:03:17Z"
  },
  {
    "title": "Trump orders National Guard to deploy to Washington, DC",
    "description": "Trump’s order comes after he federalized California National Guard troops and sent hundreds of active-duty Marines to Los Angeles in June.",
    "link": "https://taskandpurpose.com/news/national-guard-trump-dc/",
    "timestamp": "2025-08-11T15:02:18Z"
  },
  {
    "title": "Trump says he will take control of DC police, deploy National Guard to capital",
    "description": "WASHINGTON: President Donald Trump said on Monday (Aug 11) he was putting Washington's police department under federal control and ordering the National Guard to deploy to the nation's capita",
    "link": "https://www.channelnewsasia.com/world/trump-take-control-washington-dc-police-national-guard-5288946",
    "timestamp": "2025-08-11T15:02:00Z"
  },
  {
    "title": "NAACP launches town halls to mobilize Black voters ahead of midterm elections",
    "description": "The midterms \"will determine whether our democracy still holds on,\" NAACP President Derrick Johnson said in a statement to CBS News.",
    "link": "https://www.cbsnews.com/news/naacp-town-halls-black-voters-2026-midterm-elections/",
    "timestamp": "2025-08-11T15:01:35Z"
  },
  {
    "title": "Bitcoin ETFs Bounce Back—But Ethereum Funds Are on Top",
    "description": "Many large investors see Ethereum as more than just a higher-risk trade, viewing it as \"the backbone for DeFi, tokenized assets, and staking,\" Decrypt was told.",
    "link": "https://decrypt.co/334479/bitcoin-etfs-ethereum-funds-top",
    "timestamp": "2025-08-11T15:01:04Z"
  },
  {
    "title": "Judge denies Trump DOJ motion to unseal Maxwell grand jury transcripts and exhibits",
    "description": "The Trump Justice Department lost its motion to unseal grand jury transcripts and exhibits in Ghislaine Maxwell’s case, with a federal judge on Monday calling the whole premise behind the government’s effort “demonstrably false.”That premise, U.S.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/ghislaine-maxwell-grand-jury-transcript-judge-denied-unseal-rcna224275",
    "timestamp": "2025-08-11T15:00:51Z"
  },
  {
    "title": "Trump to join European leaders on emergency call before Putin talks (Hans von der Burchard/Politico)",
    "description": "Hans von der Burchard / Politico:\nTrump to join European leaders on emergency call before Putin talks  —  BERLIN — U.S. President Donald Trump will join European leaders including Ukrainian President Volodymyr Zelenskyy for an emergency virtual summit on Wedn…",
    "link": "https://www.memeorandum.com/250811/p50",
    "timestamp": "2025-08-11T15:00:24Z"
  },
  {
    "title": "Newsom Says He'll Halt State Redistricting If Trump Backs Down (Eliyahu Kamisher/Bloomberg)",
    "description": "Eliyahu Kamisher / Bloomberg:\nNewsom Says He'll Halt State Redistricting If Trump Backs Down  —  California Governor Gavin Newsom urged President Donald Trump to call on the Texas governor and leaders of other Republican-led states to halt efforts to redraw c…",
    "link": "https://www.memeorandum.com/250811/p48",
    "timestamp": "2025-08-11T15:00:24Z"
  },
  {
    "title": "The Political Economy of Incompetence (Paul Krugman)",
    "description": "Paul Krugman:\nThe Political Economy of Incompetence  —  How Hannah Arendt predicted Stephen Moore  —  On August 1 Donald Trump fired the head of the Bureau of Labor Statistics after a weak jobs report, claiming — without a shred of evidence — that the numbers…",
    "link": "https://www.memeorandum.com/250811/p49",
    "timestamp": "2025-08-11T15:00:24Z"
  },
  {
    "title": "Trump Says Federal Government Will Take Control Of Washington, D.C., Police Department",
    "description": "Trump announced over the weekend that homeless people would “have to move out, IMMEDIATELY.”",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/11/trump-says-federal-government-will-take-control-of-washington-dc-police-department/",
    "timestamp": "2025-08-11T15:00:11Z"
  },
  {
    "title": "THE MORNING RANT: Canada Has Recognized the Nation of Palestine, Trump Should Recognize the Independence of Alberta & Quebec",
    "description": "The Canadian government has announced that it will be recognizing “Palestine” as an independent nation next month. Donald Trump should respond by recognizing the independence of Alberta and Quebec, and offering whatever US security and aid is necessary for th…",
    "link": "https://acecomments.mu.nu/?post=416017",
    "timestamp": "2025-08-11T15:00:01Z"
  },
  {
    "title": "Trump Administration is Extorting Hundreds of Millions from Universities",
    "description": "Donald Trump hates higher education. He hates education. He loves “the poorly educated.” Of course. It is the poorly educated who believe his lies. They vote against their self-interest when they vote for him. The poorly educated vote for a tax break for bill…",
    "link": "https://dianeravitch.net/2025/08/11/trump-administration-is-extorting-hundreds-of-millions-from-universities/",
    "timestamp": "2025-08-11T15:00:00Z"
  },
  {
    "title": "‘Dracula’ Review: Radu Jude’s Gloriously Stupid Vampire Epic Is the First Movie to Make Any Meaningful Use of Generative AI",
    "description": "Locarno: Jude's three-hour joke conflates artificial intelligence with Vlad the Impaler — two undead bloodsuckers that feed on humanity in order to seem alive.",
    "link": "https://www.indiewire.com/criticism/movies/dracula-movie-review-radu-jude-1235144281/",
    "timestamp": "2025-08-11T15:00:00Z"
  },
  {
    "title": "Diabetic MAGA voter furious over “moron” Trump after drug costs skyrocket. Now, she regrets her vote",
    "description": "A Facebook rant from a self-described MAGA supporter is gaining traction after she claimed President Donald Trump’s tariffs made her diabetes medication unaffordable, and the reactions are mixed. In the post, she accused Trump of directly causing a sudden spi…",
    "link": "https://www.dailydot.com/viral-politics/maga-rant-healthcare-trump-tariffs/",
    "timestamp": "2025-08-11T15:00:00Z"
  },
  {
    "title": "Aug. 11 editorial cartoons",
    "description": "Monday’s political cartoons include solar power shunned by Donald Trump, Vladimir Putin's appetite for Ukraine, and another distraction from the Epstein files",
    "link": "https://theweek.com/cartoons/aug-11-2025-editorial-cartoons",
    "timestamp": "2025-08-11T15:00:00Z"
  },
  {
    "title": "Marjorie Taylor Greene Hits Out at Net Worth Claims: 'Go to Hell'",
    "description": "\"I'm fed up with the outright slander and lies about me,\" the congresswoman wrote on X.",
    "link": "https://www.newsweek.com/marjorie-taylor-greene-net-worth-claims-insider-trading-2111774",
    "timestamp": "2025-08-11T14:59:35Z"
  },
  {
    "title": "US chip companies to pay government 15% cut of China sales revenue",
    "description": "The deal is deemed a highly unusual arrangement in international tech trade",
    "link": "https://www.euractiv.com/section/tech/news/us-chip-companies-to-pay-government-15-cut-of-china-sales-revenue/",
    "timestamp": "2025-08-11T14:59:12Z"
  },
  {
    "title": "Trump to deploy National Guard in D.C. — even as data shows crime at 30-year low",
    "description": "U.S. President Donald Trump announced on Monday that he will deploy hundreds of D.C. National Guard troops on the streets of Washington as part of a push to rein in violent crime, even as local police data shows those incidents are down sharply this year.",
    "link": "https://www.cbc.ca/news/world/trump-national-guard-washington-1.7605793",
    "timestamp": "2025-08-11T14:58:56Z"
  },
  {
    "title": "Trump to deploy National Guard in Washington as part of crime crackdown",
    "description": "U.S. President Donald Trump announced on Monday that he will deploy hundreds of D.C. National Guard troops on the streets of Washington as part of a push to rein in violent crime, even as local police data shows those incidents are down sharply this year.",
    "link": "https://www.cbc.ca/news/politics/trump-national-guard-washington-1.7605793",
    "timestamp": "2025-08-11T14:58:56Z"
  },
  {
    "title": "Trump says placing Washington police under federal control",
    "description": "President Donald Trump said on Aug. 11 he’s placing the Washington, D.C., police department under federal control and deploying the National Guard to make the nation’s capital safer.",
    "link": "https://www.hurriyetdailynews.com/trump-says-placing-washington-police-under-federal-control-212424",
    "timestamp": "2025-08-11T14:58:33Z"
  },
  {
    "title": "JD Vance and Marco Rubio's Odds of Being Trump MAGA Heir",
    "description": "JD Vance and Marco Rubio are leading contenders to succeed Donald Trump and take up the MAGA mantle.",
    "link": "https://www.newsweek.com/jd-vance-marco-rubio-odds-trump-maga-heir-2111760",
    "timestamp": "2025-08-11T14:57:56Z"
  },
  {
    "title": "Convicted Felon Trump Lies About Crime Rate In D.C., Deploys Troops",
    "description": "Crime rates in the nation’s capital are the lowest they have been in decades, and have decreased dramatically over the last two years.",
    "link": "https://www.huffpost.com/entry/trump-dc-crime-troops_n_6899fc6ae4b07a70fa0911b3",
    "timestamp": "2025-08-11T14:57:46Z"
  },
  {
    "title": "Trump invents fake DC crime wave to shift focus from Epstein",
    "description": "I'm glad Trump is focusing on an imaginary Washington, DC, crime wave and adding more gold to the White House. Lower grocery prices can wait.",
    "link": "https://www.usatoday.com/story/opinion/columnist/2025/08/11/trump-washington-dc-crime-homeless-prices/85603175007/",
    "timestamp": "2025-08-11T14:55:59Z"
  },
  {
    "title": "Narendra Modi Learns That Not Even Trump Respects a Bootlicker",
    "description": "Jeet Heer\n\n\n\nThe Indian prime minister discovers that the world’s biggest bully sees fawning as weakness.\r\n\n\r\n\n\nThe post Narendra Modi Learns That Not Even Trump Respects a Bootlicker appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/narendra-modi-india-trump-tariffs-sycophancy/",
    "timestamp": "2025-08-11T14:55:41Z"
  },
  {
    "title": "The Week Ahead — This week gets off to a fast start. Back on July 9, Judge Charles Breyer ... (Joyce Vance/Civil Discourse ...)",
    "description": "Joyce Vance / Civil Discourse with Joyce Vance:\nThe Week Ahead  —  This week gets off to a fast start.  Back on July 9, Judge Charles Breyer in the Northern District of California set a bench trial for this Monday in Newsom v. Trump, to determine whether Dona…",
    "link": "https://www.memeorandum.com/250811/p44",
    "timestamp": "2025-08-11T14:55:00Z"
  },
  {
    "title": "US demands cut of Nvidia sales in order to ship AI chips to China",
    "description": "The Trump administration has ordered Nvidia and AMD to pay the federal government a 15 percent cut of their AI chip sales revenue to China, according to reports from The New York Times and The Financial Times. Nvidia CEO Jensen Huang reportedly reached an agr…",
    "link": "https://www.theverge.com/news/757428/donald-trump-nvidia-amd-ai-chip-sales-china",
    "timestamp": "2025-08-11T14:54:48Z"
  },
  {
    "title": "Pakistan \"Playing With Fire\" on Nuclear Threat, Says Former Indian Official",
    "description": "India's former deputy national security advisor reacted to comments made by Pakistan's army chief during a visit to the United States",
    "link": "https://www.newsweek.com/pakistan-playing-fire-nuclear-threat-says-former-indian-official-2111804",
    "timestamp": "2025-08-11T14:54:41Z"
  },
  {
    "title": "RFK Jr. faces pushback after slow response to deadly shooting at the CDC",
    "description": "After Friday's deadly shooting, it’s not just CDC officials and scientists who are outraged with Robert F. Kennedy Jr.: So is Trump's former surgeon general.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rfk-jr-kennedy-cdc-shooting-atlanta-response-vaccines-rcna224269",
    "timestamp": "2025-08-11T14:54:17Z"
  },
  {
    "title": "Trump bid for cut of chip revenue risks ‘dangerous world’",
    "description": "The revenue-for-exports deal between the U.S. government, Nvidia and AMD opens a new front in a trading regime turned upside down. Read on.",
    "link": "https://financialpost.com/investing/trump-bid-chip-revenue-risks-dangerous-world",
    "timestamp": "2025-08-11T14:54:10Z"
  },
  {
    "title": "Trump says he’s deploying National Guard in Washington DC to tackle crime and homelessness",
    "description": "US President Donald Trump said Monday he’s placing the Washington, D.C., police department under federal control and deploying the National Guard to make the nation’s capital safer.",
    "link": "https://www.independent.ie/world-news/north-america/trump-says-hes-deploying-national-guard-in-washington-dc-to-tackle-crime-and-homelessness/a1524640399.html",
    "timestamp": "2025-08-11T14:53:44Z"
  },
  {
    "title": "Inside the CDC, shooting adds to trauma as workers describe projects, careers in limbo | CNN",
    "description": "Centers for Disease Control and Prevention workers whose jobs have been reinstated after dizzying Trump administration disruptions say they remain stuck in a budgetary, political, and professional limbo.",
    "link": "https://www.cnn.com/2025/08/11/health/cdc-crisis-limbo-kff-health-news",
    "timestamp": "2025-08-11T14:53:36Z"
  },
  {
    "title": "Trump to Meet Putin in Alaska as Kyiv Rejects Land Giveaway",
    "description": "Donald Trump plans to meet Russian President Vladimir Putin in Alaska as the US president looks to broker an agreement that will bring an end to the war in Ukraine.\n“The highly anticipated meeting between myself, as President of the United States of America, …",
    "link": "https://biztoc.com/x/ad6b5bd4c57f6677",
    "timestamp": "2025-08-11T14:53:06Z"
  },
  {
    "title": "Trump places DC under direct Federal control",
    "description": "United States President Donald Trump announced at a press conference on Monday that the National Guard will be deployed to Washington DC in order to \"help reestablish law, order, and public safety.\" I...",
    "link": "https://biztoc.com/x/d772d1b05c93222a",
    "timestamp": "2025-08-11T14:52:59Z"
  },
  {
    "title": "Ukrainian Fighters Aren’t Expecting Much from the Trump-Putin Summit",
    "description": "As Trump and Putin prepare to discuss swapping Ukrainian territory, the soldiers who've been defending it for years say they'd rather finish the fight now than leave it for their children. \nThe post Ukrainian Fighters Aren’t Expecting Much from the Trump-Puti…",
    "link": "http://washingtonmonthly.com/2025/08/11/ukrainian-fighters-arent-expecting-much-from-the-trump-putin-summit/",
    "timestamp": "2025-08-11T14:51:35Z"
  }
]