[
  {
    "title": "Landmark trial kicks off over Trump's use of U.S. military in LA policing role",
    "description": "A landmark trial kicked off on Monday over the use by Donald Trump's administration of National Guard forces to support its deportation efforts and quell protests in Los Angeles, in a legal challenge to the U.S. president's break from long-standing norms agai…",
    "link": "https://japantoday.com/category/world/landmark-trial-kicks-off-over-trump%27s-use-of-us-military-in-la-policing-role",
    "timestamp": "2025-08-11T21:12:44Z"
  },
  {
    "title": "Trump takes over DC police in extraordinary move, deploying National Guard in capital",
    "description": "U.S. President Donald Trump said on Monday he was deploying 800 National Guard troops to Washington and temporarily taking over the city's police department, an extraordinary assertion of presidential power in the nation's capital. Trump's move, which bypasse…",
    "link": "https://japantoday.com/category/world/trump-takes-over-dc-police-in-extraordinary-move-deploys-national-guard-in-capital2",
    "timestamp": "2025-08-11T21:12:28Z"
  },
  {
    "title": "Trump says both sides in Ukraine war will need to cede territory",
    "description": "U.S. President Donald Trump said on Monday that Kyiv and Moscow will both have to cede land to end the war in Ukraine and talks with Russian President Vladimir Putin this week will instantly show whether the Kremlin leader is willing to make a deal. European …",
    "link": "https://japantoday.com/category/world/trump-says-both-sides-in-ukraine-war-will-need-to-cede-territory2",
    "timestamp": "2025-08-11T21:12:22Z"
  },
  {
    "title": "Trump meets with Intel CEO, along with Commerce, Treasury secretaries",
    "description": "Shares of Intel, considered to be at the heart of America's domestic chip manufacturing ambitions, rose 2.2% in extended trading.  \"The meeting was a very...",
    "link": "https://ca.finance.yahoo.com/news/trump-meets-intel-ceo-along-211135240.html",
    "timestamp": "2025-08-11T21:11:35Z"
  },
  {
    "title": "Trump meets with Intel CEO, along with Commerce, Treasury secretaries",
    "description": "U.S. President Donald Trump said on Monday he met with Intel Corp CEO Lip-Bu Tan, along with Commerce Secretary Howard Lutnick and Treasury Secretary Scott Bessent.\"The meeting was a very interesting one,\" Trump said on Truth Social, adding that his cabinet m…",
    "link": "https://www.channelnewsasia.com/business/trump-meets-intel-ceo-along-commerce-treasury-secretaries-5289376",
    "timestamp": "2025-08-11T21:11:35Z"
  },
  {
    "title": "Full List of America's Most Dangerous Cities as Trump Cracks Down on D.C",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has said several cities across the country could face federal action after he declared a public safety emergency in Washington, D.C. Here is a look at some of the nation's cities experie…",
    "link": "https://biztoc.com/x/6dd71c17d86edc4a",
    "timestamp": "2025-08-11T21:11:12Z"
  },
  {
    "title": "Whistleblower Ties Clinton Campaign To Fake Russia Hack",
    "description": "A whistleblower report declassified last week suggests that Hillary Clinton’s campaign efforts to manufacture evidence tying Donald Trump to alleged Russian hacking in 2016 were deeper than previously known – as were Obama administration efforts to conceal th…",
    "link": "https://biztoc.com/x/f514c01804c1c87e",
    "timestamp": "2025-08-11T21:11:01Z"
  },
  {
    "title": "Trump holds high-stakes meeting with Intel CEO Tan Lip-Bu after calling for his resignation",
    "description": "US President Donald Trump said he met with Intel CEO Lip-Bu Tan on Monday (Aug 11), days after seeking his resignation, praising Tan and calling the meeting \"a very interesting one\". Shares of the chipmaker rose 3 per cent in extended trading. Last week, Trum…",
    "link": "https://www.channelnewsasia.com/business/trump-tan-lip-bu-intel-ceo-meeting-5289376",
    "timestamp": "2025-08-11T21:11:00Z"
  },
  {
    "title": "This Isn’t About Crime",
    "description": "Donald Trump’s plans for Washington, D.C., are a warning to us all.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-dc-crime/683836/",
    "timestamp": "2025-08-11T21:11:00Z"
  },
  {
    "title": "Jessica Radcliffe Orca attack multiple videos surface on social media. Here’s which one is real",
    "description": "Jessica Radcliffe orca attack multiple videos surface on social media. See which one is real. Multiple videos claim marine trainer Jessica Radcliffe was killed by an orca during a live show. The viral clips, shared widely on TikTok, Facebook, and X, are misle…",
    "link": "https://economictimes.indiatimes.com/news/international/us/jessica-radcliffe-orca-attack-multiple-videos-surface-social-media-which-is-real-marine-trainer-no-credible-proof-performance-tiktok-facebook-x-menstrual-blood-pacific-blue-marine-park-ai-generated-video-cybersecurity-experts-suspicious-links/articleshow/123244817.cms",
    "timestamp": "2025-08-11T21:10:59Z"
  },
  {
    "title": "Trump and His Family Will Make a Shocking $3.4 Billion Off White House: Analysis",
    "description": "An in-depth analysis from The New Yorker examined how the Trump family has made billions as a result of President Donald Trump's time in office.\nThe post Trump and His Family Will Make a Shocking $3.4 Billion Off White House: Analysis first appeared on Mediai…",
    "link": "https://www.mediaite.com/politics/trump-and-his-family-will-make-a-shocking-3-4-billion-off-white-house-analysis/",
    "timestamp": "2025-08-11T21:10:48Z"
  },
  {
    "title": "Man Fired 180 Shots, Shattering 150 Windows, In CDC Attack",
    "description": "Bullets pierced \"blast-resistant\" windows, and it could take weeks or even months to repair the damage, agency officials said.",
    "link": "https://www.huffpost.com/entry/ap-us-med-cdc-campus-shooting_n_689a5b9ee4b0be3f5edc7d3b",
    "timestamp": "2025-08-11T21:10:42Z"
  },
  {
    "title": "Full List of America's Most Dangerous Cities as Trump Cracks Down on D.C.",
    "description": "Trump has indicated he could \"go further\" in his actions to address crime, though violent crime has dropped recently.",
    "link": "https://www.newsweek.com/most-dangerous-cities-trump-washington-dc-2112006",
    "timestamp": "2025-08-11T21:09:52Z"
  },
  {
    "title": "Bryson DeChambeau appointed chair of Donald Trump's Sports Council",
    "description": "LIV Golf standout Bryson DeChambeau has been named chair of the President&apos;s Council on Sports, Fitness and Nutrition, which comes as an unexpected twist that shifts the acclai",
    "link": "https://www.marca.com/en/golf/2025/08/11/689a3499ca4741c90b8b4594.html",
    "timestamp": "2025-08-11T21:08:54Z"
  },
  {
    "title": "Man fired 180 shots, shattering 150 windows, in CDC attack",
    "description": "The man who attacked the CDC headquarters in Atlanta on Friday fired more than 180 shots into the campus and broke about 150 windows",
    "link": "https://www.wsbradio.com/news/health/man-fired-180-shots/QIKZ4G6QZ5BUFL64H7NJY4PU4M/",
    "timestamp": "2025-08-11T21:05:08Z"
  },
  {
    "title": "‘The Weekend’ co-hosts and Ali Velshi blast Trump over his ‘nonsensical’ tariffs",
    "description": "Trump’s tariffs have raised import taxes to the highest level since the Great Depression. MSNBC hosts Jonathan Capehart, Eugene Daniels and Ali Velshi discuss.",
    "link": "https://www.msnbc.com/top-stories/latest/trump-tarrifs-higher-prices-inflation-rcna224371",
    "timestamp": "2025-08-11T21:04:13Z"
  },
  {
    "title": "ABC News Host Recalls On-Air Being ‘Jumped’ 2 Blocks From DC Studio After Trump Announces Crime Crackdown",
    "description": "ABC News anchor Kyra Phillips recalled on-air Monday being \"jumped\" only two blocks away from her Washington, D.C. studio \"within the last two years.\"",
    "link": "https://dailycaller.com/2025/08/11/abc-news-host-air-jumped-2-blocks-dc-studio-trump-announces-crime-crackdown/",
    "timestamp": "2025-08-11T21:03:31Z"
  },
  {
    "title": "Democrat D.C. Mayor Muriel Bowser in Sheer Denial: Trump's Plan to Combat Crime in Our City 'Unsettling and Unprecedented'",
    "description": "Democrat Washington, DC, Mayor Muriel Bowser is in utter denial when it comes to her crime-ridden city, asserting that President Donald Trump's view of the nation's capital is \"shaped by his COVID-era experience during his first term\" and claiming that crime …",
    "link": "https://www.breitbart.com/politics/2025/08/11/democrat-d-c-mayor-muriel-bowser-in-sheer-denial-trumps-plan-to-combat-crime-in-our-city-unsettling-and-unprecedented/",
    "timestamp": "2025-08-11T21:03:29Z"
  },
  {
    "title": "Trump signs order extending China tariff truce by 90 days, White House official says",
    "description": "US News: US President Donald Trump has signed an executive order extending a tariff truce with China by another 90 days, a White House official said on Monday .",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-signs-order-extending-china-tariff-truce-by-90-days-white-house-official-says/articleshow/123244865.cms",
    "timestamp": "2025-08-11T21:03:20Z"
  },
  {
    "title": "DC Mayor Responds To Trump Crackdown By Calling For Statehood",
    "description": "Democratic Mayor Muriel Bowser called for statehood for D.C. after President Donald Trump announced measures to address crime in the nation’s capital.",
    "link": "https://dailycaller.com/2025/08/11/dc-mayor-responds-to-trump-crackdown-by-calling-for-statehood/",
    "timestamp": "2025-08-11T21:02:33Z"
  },
  {
    "title": "Republican Rep. LaMalfa hammered in profanity-laced town hall",
    "description": "The congressman heard it from attendees about Trump, Epstein and tariffs.",
    "link": "https://abcnews.go.com/Politics/gop-rep-lamalfa-gets-earful-profane-language-town/story?id=124554738",
    "timestamp": "2025-08-11T21:02:00Z"
  },
  {
    "title": "Albanese pushed to go further after Palestine recognition",
    "description": "Reactions to Australia's decision to recognise a Palestinian state have been varied, with some now urging further action against Israel. Plus, rates day is here, and the PC wants more AI in schools.\nThe post Albanese pushed to go further after Palestine recog…",
    "link": "http://www.crikey.com.au/2025/08/12/palestine-state-recognition-israel-rba-rates-ai-schools/",
    "timestamp": "2025-08-11T21:01:24Z"
  },
  {
    "title": "Nvidia, AMD to Pay Government 15% of AI Chip Sales to China",
    "description": "Many of those involved in national security have concerns that \"chips and other technology will boost China's ecosystem and military.\"\nThe post Nvidia, AMD to Pay Government 15% of AI Chip Sales to China first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/nvidia-amd-to-pay-government-15-of-ai-chip-sales-to-china/",
    "timestamp": "2025-08-11T21:00:49Z"
  },
  {
    "title": "DHS Secretary Noem says Rachel Morin's killer 'should have never been in our country'",
    "description": "Victor Martinez-Hernandez was sentenced to life without parole for brutal murder and rape of Rachel Morin, 37-year-old Maryland mother of five children in 2023.",
    "link": "https://www.foxnews.com/politics/dhs-secretary-noem-says-rachel-morins-killer-should-have-never-been-our-country",
    "timestamp": "2025-08-11T21:00:14Z"
  },
  {
    "title": "NY Times reporter admits Trump is ‘way more effective’ in second term",
    "description": "A New York Times White House correspondent said President Trump's second term in office has shown him to be \"way more effective\" than during his first term.",
    "link": "https://www.foxnews.com/media/ny-times-reporter-admits-trump-way-more-effective-second-term",
    "timestamp": "2025-08-11T21:00:01Z"
  },
  {
    "title": "The political — and historical — context of Trump's D.C. crackdown: From the Politics Desk",
    "description": "Donald Trump isn’t the first president to deploy troops and federal agents in the name of safeguarding the nation’s capital, but he has been particularly selective about what represents a threat to the peace.",
    "link": "https://www.nbcnews.com/politics/politics-news/political-historical-context-trumps-dc-crackdown-politics-desk-rcna224368",
    "timestamp": "2025-08-11T21:00:00Z"
  },
  {
    "title": "A Show of Weakness, Not Power",
    "description": "So far, Donald Trump’s D.C. law-enforcement surge appears mostly farcical.",
    "link": "https://www.theatlantic.com/politics/archive/2025/08/trump-dc-national-guard/683835/",
    "timestamp": "2025-08-11T21:00:00Z"
  },
  {
    "title": "Sebastian Telfair Pleads For Donald Trump Pardon Hours Before Reporting To Prison",
    "description": "Sebastian Telfair tells TMZ Sports he wants Donald Trump to help him avoid a lengthy stay behind bars this year. The former NBA star is scheduled to report to prison on Tuesday ... after he violated the conditions of his supervised release in his…\n Permalink",
    "link": "https://www.tmz.com/2025/08/11/sebastian-telfair-pleads-for-donald-trump-pardon/",
    "timestamp": "2025-08-11T20:59:53Z"
  },
  {
    "title": "All the pains of Intel: from CPU design and process technologies to internal clashes and political pressure",
    "description": "As Intel battles technology delays, mixed-bag products, stalled foundry growth, and internal boardroom rifts, there are now political calls for CEO Lip-Bu Tan's resignation over alleged ties to Chinese investments.",
    "link": "https://www.tomshardware.com/pc-components/cpus/all-the-pains-of-intel-from-cpu-design-and-process-technologies-to-internal-clashes-and-political-pressure",
    "timestamp": "2025-08-11T20:57:12Z"
  },
  {
    "title": "Higher Tariffs On India May Be Driving Crucial US Ally Closer To Russia, China",
    "description": "Trump's tariffs on India may have the unintended effect of driving a long-time U.S. ally into the arms of America's biggest geopolitical adversaries.",
    "link": "https://dailycaller.com/2025/08/11/higher-tariffs-india-trump-driving-ally-russia-china/",
    "timestamp": "2025-08-11T20:56:59Z"
  },
  {
    "title": "JB Pritzker Goads Trump Over His Crime Crackdown: 'Where Are The Epstein Files?'",
    "description": "The Illinois governor, seen as a potential Democratic presidential candidate, has clashed with the president repeatedly in recent months.",
    "link": "https://www.huffpost.com/entry/jb-pritzker-trump-crime-epstein_n_689a3824e4b08fd59b640792",
    "timestamp": "2025-08-11T20:56:27Z"
  },
  {
    "title": "Monday Evening Open Thread: Not the Happiest Campers",
    "description": "I mean they look absolutely -thrilled- to be there [image or embed] — Schnorkles O'Bork (@schnorkles.bsky.social) August 11, 2025 at 10:23 AM Following up on Betty’s earlier post… the National Guard / FBI ‘jackboots’ seem no more pleased with their new Trumpi…",
    "link": "https://balloon-juice.com/2025/08/11/monday-evening-open-thread-not-the-happiest-campers/",
    "timestamp": "2025-08-11T20:51:23Z"
  },
  {
    "title": "Colombian President Gustavo Petro Orders Military to Defend Nicolas Maduro After U.S. Bounty of $50 Million",
    "description": "Far-left President of Colombia Gustavo Petro pledged his support for Venezuelan socialist dictator Nicolás Maduro on Sunday after the United States doubled its bounty on Maduro to $50 million.\nThe post Colombian President Gustavo Petro Orders Military to Defe…",
    "link": "https://www.breitbart.com/latin-america/2025/08/11/colombian-president-gustavo-petro-orders-military-to-defend-nicolas-maduro-after-u-s-bounty-of-50-million/",
    "timestamp": "2025-08-11T20:51:10Z"
  },
  {
    "title": "Zelensky could still attend Trump-Putin meeting, but rest of Europe is shut out",
    "description": "As things stand, there are no invites for the country being invaded, nor the continent it sits in, writes James Waterhouse.",
    "link": "https://www.bbc.com/news/articles/cn5eedq7ldro",
    "timestamp": "2025-08-11T20:51:01Z"
  },
  {
    "title": "Trump Once Again Gives China Tariff Deadline Extension",
    "description": "President Donald Trump signed an executive order Monday afternoon that again delayed the implementation of tariffs on Chinese goods for an extra 90 days. The president signed the order hours before the tariffs were to take effect, according to CNBC. The tarif…",
    "link": "https://dailycaller.com/2025/08/11/trump-extends-china-tariff-pause-by-another-90-days/",
    "timestamp": "2025-08-11T20:50:39Z"
  },
  {
    "title": "Starmer, Carney praise Trump's peace efforts",
    "description": "British Prime Minister Keir Starmer and Canadian Prime Minister Mark Carney praised on Monday the peace efforts by United States President Donald Trump regarding the war in Ukraine.Following the conve...",
    "link": "https://biztoc.com/x/2054440003ef8cd8",
    "timestamp": "2025-08-11T20:48:58Z"
  },
  {
    "title": "Vigilante Justice: Trump Dresses Up As Bat And Patrols Streets Of DC",
    "description": "WASHINGTON, D.C. — Left without other practical options in a city overwhelmed by violent crime, President Donald Trump reportedly decided to dispense vigilante justice by dressing up like a giant bat and patrolling the streets of D.C.",
    "link": "https://babylonbee.com/news/vigilante-justice-trump-dresses-up-as-bat-and-patrols-streets-of-dc",
    "timestamp": "2025-08-11T20:48:26Z"
  },
  {
    "title": "Why Is Tilray (TLRY) Stock Soaring Today",
    "description": "Shares of cannabis company Tilray Brands (NASDAQ:TLRY) jumped 38.5% in the afternoon session after reports that President Donald Trump is considering...",
    "link": "https://finance.yahoo.com/news/why-tilray-tlry-stock-soaring-204543868.html",
    "timestamp": "2025-08-11T20:45:43Z"
  },
  {
    "title": "Revealed: Epstein Wore Israel Defense Forces Sweatshirt in Photo With Long-Serving Butler After Revelations He Operated 'Blackmail Honeytrap' for Country's Intelligence Services",
    "description": "Conspiracy theories alleged Jeffrey Epstein was a secret undercover agent for the country's intelligence agency.",
    "link": "https://radaronline.com/p/jeffrey-epstein-israel-defense-forces-sweatshirt-photo-mossad-agent-conspiracy-theories/",
    "timestamp": "2025-08-11T20:45:00Z"
  },
  {
    "title": "Report: President Trump Relegates Obama, Bush Portraits to White House Grand Stairwell",
    "description": "The official portraits of three former presidents have reportedly been moved to a \"hidden stairwell\" at the direction of President Donald Trump.\nThe post Report: President Trump Relegates Obama, Bush Portraits to White House Grand Stairwell appeared first on …",
    "link": "https://www.breitbart.com/politics/2025/08/11/report-president-trump-relegates-obama-bush-portraits-white-house-stairwell/",
    "timestamp": "2025-08-11T20:44:57Z"
  },
  {
    "title": "Exclusive: Fintech giant Stripe building ‘Tempo’ blockchain with crypto VC Paradigm",
    "description": "Stripe’s newest push into crypto comes as the company has made an aggressive push into stablecoins.",
    "link": "https://fortune.com/crypto/2025/08/11/stripe-blockchain-tempo-paradigm/",
    "timestamp": "2025-08-11T20:43:20Z"
  },
  {
    "title": "Trump: Redesigning the White House",
    "description": "Donald Trump unveiled a $200 million plan to build a White House ballroom",
    "link": "https://theweek.com/politics/trump-redesigning-white-house",
    "timestamp": "2025-08-11T20:42:11Z"
  },
  {
    "title": "‘He’s Gone to a Lot of Meetings’: Trump Is Exasperated by Zelensky’s Relentless Undermining of Alaska Peace Talks (VIDEOS)",
    "description": "As it was fully expected, Kiev regime leader Volodymyr Zelensky is becoming a major obstacle in the peace process between Russia and Ukraine.\nThe post ‘He’s Gone to a Lot of Meetings’: Trump Is Exasperated by Zelensky’s Relentless Undermining of Alaska Peace …",
    "link": "https://www.thegatewaypundit.com/2025/08/hes-gone-lot-meetings-trump-is-exasperated-zelenskys/",
    "timestamp": "2025-08-11T20:40:39Z"
  },
  {
    "title": "DC mayor, police chief blindsided by Trump's announcement of federal police force takeover, sources say (Matt Pusatory/WUSA)",
    "description": "Matt Pusatory / WUSA:\nDC mayor, police chief blindsided by Trump's announcement of federal police force takeover, sources say  —  Here's a look at how some leaders in D.C. and elsewhere are reacting to the president's press conference. … WASHINGTON — Presiden…",
    "link": "https://www.memeorandum.com/250811/p87",
    "timestamp": "2025-08-11T20:40:00Z"
  },
  {
    "title": "Extreme Home Makeover: White House Edition",
    "description": "This old, fly-infested building needs some work.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/08/trump-dc-makeover-white-house/683834/",
    "timestamp": "2025-08-11T20:39:00Z"
  },
  {
    "title": "EU hits back at Trump, Zelenskyy comments, no concessions in Ukraine before Putin ceasefire agreement",
    "description": "The European Union made their position on President Donald Trump's \"land swapping\" push clear following a ministerial powwow on Monday, and told Fox News Digital, there should be no \"concessions\" until Russia agrees to stop its war. \"Russia has not agreed to …",
    "link": "https://freerepublic.com/focus/f-news/4334023/posts",
    "timestamp": "2025-08-11T20:38:35Z"
  },
  {
    "title": "At Alaska summit, Trump has one play for Ukraine peace: Call Putin’s bluff",
    "description": "It’s time to end Russia’s war on Ukraine — with a Trumpian update on Ronald Reagan’s doctrine of peace through strength.",
    "link": "https://nypost.com/2025/08/11/opinion/at-alaska-summit-trump-has-one-play-call-putins-bluff/",
    "timestamp": "2025-08-11T20:38:23Z"
  },
  {
    "title": "OpenAI GPT-5 Review: Built to Win Benchmarks, Not Hearts",
    "description": "OpenAI’s new flagship crushes coding tests and complex logic, but creative work is sterile, safety rails are heavy-handed, and its cramped context window leaves it lagging rivals like Claude.",
    "link": "https://decrypt.co/334544/openai-gpt-5-review-built-win-benchmarks-not-hearts",
    "timestamp": "2025-08-11T20:37:55Z"
  },
  {
    "title": "Shoe Firms, Consumers Get Big Break as Trump Extends China Tariff Deadline",
    "description": "Trump's extension of the tariff deadline for China for another 90 days gives shoe firms, consumers breathing room for the holiday season.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/trump-extension-tariff-china-90-days-shoe-firms-consumers-1238033805/",
    "timestamp": "2025-08-11T20:35:57Z"
  },
  {
    "title": "Trump moves to take over DC police",
    "description": "President Donald Trump said Monday he's taking over Washington's police department and activating 800 members of the National Guard in the hopes of reducing crime, even as city officials stressed crime is already falling in the nation's capital.",
    "link": "https://www.bostonherald.com/2025/08/11/trump-moves-to-take-over-dc-police/",
    "timestamp": "2025-08-11T20:35:39Z"
  },
  {
    "title": "Kash Patel's 26-Year-Old Girlfriend Defends Age Gap, Says There's Lots Of 'Age Differences' In Trump's Administration",
    "description": "Alexis Wilkins' relationship with the FBI director has been at the epicenter of wild conspiracy theories involving Israel and Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/kash-patel-girlfriend-19-year-age-gap_n_689a09cee4b0be3f5edc3b54",
    "timestamp": "2025-08-11T20:35:22Z"
  },
  {
    "title": "US to extend China tariff pause another 90 days",
    "description": "US President Donald Trump signed an extension just before midnight in Beijing, when the pause was to expire.",
    "link": "https://www.aljazeera.com/economy/2025/8/11/us-to-extend-china-tariff-pause-another-90-days",
    "timestamp": "2025-08-11T20:35:12Z"
  },
  {
    "title": "Armenia and Azerbaijan publish US-brokered peace agreement (FULL TEXT)",
    "description": "Armenia and Azerbaijan have published an agreement on establishing diplomatic relations and renouncing territorial claims Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622773-armenia-azerbaijani-peace-agreement-text/",
    "timestamp": "2025-08-11T20:34:50Z"
  },
  {
    "title": "FBI abuses and misuses generate angry reactions from bureau veterans, agents association",
    "description": "Between the politically motivated firings and the reassignments of agents to deal with local street crime, all is clearly not well at Kash Patel's FBI.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/fbi-abuses-misuses-generate-angry-reactions-bureau-veterans-agents-ass-rcna224329",
    "timestamp": "2025-08-11T20:30:28Z"
  },
  {
    "title": "Trump opens door to sales of version of Nvidia's next-gen AI chips in China",
    "description": "Despite deep-seated fears in Washington.",
    "link": "https://www.itnews.com.au/news/trump-opens-door-to-sales-of-version-of-nvidias-next-gen-ai-chips-in-china-619499?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+Technology+feed",
    "timestamp": "2025-08-11T20:30:00Z"
  },
  {
    "title": "Trump opens door to sales of version of Nvidia's next-gen AI chips in China",
    "description": "Despite deep-seated fears in Washington.",
    "link": "https://www.itnews.com.au/news/trump-opens-door-to-sales-of-version-of-nvidias-next-gen-ai-chips-in-china-619499?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+",
    "timestamp": "2025-08-11T20:30:00Z"
  },
  {
    "title": "Trump opens door to sales of version of Nvidia's next-gen AI chips in China",
    "description": "Despite deep-seated fears in Washington.",
    "link": "https://www.itnews.com.au/news/trump-opens-door-to-sales-of-version-of-nvidias-next-gen-ai-chips-in-china-619499?utm_source=feed&utm_medium=rss&utm_campaign=iTnews+News+feed",
    "timestamp": "2025-08-11T20:30:00Z"
  },
  {
    "title": "Trump hikes tariffs despite economic warning signs",
    "description": "President Donald Trump signed an executive order raising import taxes to the highest level in over a century, as U.S. job growth continues to lag",
    "link": "https://theweek.com/politics/trump-tariffs-economic-warning-signs",
    "timestamp": "2025-08-11T20:28:01Z"
  },
  {
    "title": "US protesters say Trump using ‘crime emergency’ to justify DC takeover",
    "description": "Trump takes control of police, deploys National Guard in a move DC-rights activist calls 'just authoritarianism'.",
    "link": "https://www.aljazeera.com/news/2025/8/11/us-protesters-say-trump-using-crime-emergency-to-justify-dc-takeover",
    "timestamp": "2025-08-11T20:28:00Z"
  },
  {
    "title": "CNN National Security Analyst Says Trump’s DC Troop Deployment Is ‘Intended to Create More’ Crime",
    "description": "\"Nobody is going to have any idea who is in charge, why, who reports to whom. It is intended to create more confusion, and crime.\"\nThe post CNN National Security Analyst Says Trump’s DC Troop Deployment Is ‘Intended to Create More’ Crime first appeared on Med…",
    "link": "https://www.mediaite.com/politics/cnn-national-security-analyst-says-trumps-dc-troop-deployment-is-intended-to-create-more-crime/",
    "timestamp": "2025-08-11T20:27:20Z"
  },
  {
    "title": "House Republicans back up Trump on DC crime push",
    "description": "House Republicans moved quickly Monday to follow President Donald Trump’s lead as he took unprecedented action to target Washington’s locally elected government — further heightening the GOP’s scrutiny of the capital city and its Democratic elected leaders. \n…",
    "link": "https://biztoc.com/x/40f1d4c979a2600f",
    "timestamp": "2025-08-11T20:26:55Z"
  },
  {
    "title": "Trump suggests he’ll know if Putin wants a peace deal with Ukraine soon into their meeting",
    "description": "President Donald Trump said Monday that he expected to determine mere moments into his meeting with Russian leader Vladimir Putin this week whether it would be possible to work out a deal to halt the war in Ukraine.",
    "link": "https://biztoc.com/x/aa0670a8805a86d9",
    "timestamp": "2025-08-11T20:26:41Z"
  },
  {
    "title": "Oil Steadies After Slide Last Week",
    "description": "Traders expect no immediate sanctions on Russian crude while peace talks progress.",
    "link": "https://www.rigzone.com/news/wire/oil_steadies_after_slide_last_week-11-aug-2025-181433-article/",
    "timestamp": "2025-08-11T20:26:17Z"
  },
  {
    "title": "Inventing Emergencies Is Trump’s Superpower",
    "description": "Inventing emergencies is Trump’s superpower. He keeps lying about conditions in the country, like the fake spike in D.C. crime rates. This lets him seize more authority, as he’s doing with his Washington law-enforcement takeover.",
    "link": "http://nymag.com/intelligencer/article/inventing-emergencies-trump-superpower.html",
    "timestamp": "2025-08-11T20:24:11Z"
  },
  {
    "title": "Smithsonian’s New Trump Impeachment Label Is Shorter and Safer",
    "description": "The institution installed an updated label to a display about presidential impeachments after backlash over the text’s removal.",
    "link": "http://hyperallergic.com/1033372/smithsonian-new-trump-impeachment-label-is-shorter-and-safer/",
    "timestamp": "2025-08-11T20:23:59Z"
  },
  {
    "title": "Trump seeing green as he weighs deal to allow Nvidia Blackwell GPU sales to China",
    "description": "And shave 15% of the top no doubt. Nerfed versions of Nvidia's Blackwell GPUs could soon join its H20 on the list of AI accelerators approved for sale in China.…",
    "link": "https://www.theregister.com/2025/08/11/trump_seeing_green_as_he/",
    "timestamp": "2025-08-11T20:22:42Z"
  },
  {
    "title": "Trump may allow Nvidia to ship hobbled current-gen Blackwell AI GPUs to China — U.S. gov't would get 15% of related revenue, China firms would get access to far faster GPUs",
    "description": "Trump signaled he may allow Nvidia to sell heavily downgraded Blackwell AI processors to China in exchange for 15% of related sales revenue to the U.S. government, a move that could give Chinese firms far faster hardware than current H20-based offerings.",
    "link": "https://www.tomshardware.com/pc-components/gpus/trump-may-allow-nvidia-to-ship-hobbled-current-gen-blackwell-ai-gpus-to-china-u-s-govt-would-get-15-percent-of-related-revenue-china-firms-would-get-access-to-far-faster-gpus",
    "timestamp": "2025-08-11T20:22:01Z"
  },
  {
    "title": "New Poll Reveals Most Disliked Person in America",
    "description": "A recent Gallup poll revealing Pope Leo XIV to be the most popular newsmaker in the U.S. also provided readers with a glimpse of the other side of the spectrum.\nThe post New Poll Reveals Most Disliked Person in America first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/new-poll-reveals-most-disliked-person-in-america/",
    "timestamp": "2025-08-11T20:21:58Z"
  },
  {
    "title": "Führer Trump Invading DC Now, New Dictatorship Level Unlocked!",
    "description": "Time to crack some heads!",
    "link": "https://www.wonkette.com/p/fuhrer-trump-invading-dc-now-new",
    "timestamp": "2025-08-11T20:20:51Z"
  },
  {
    "title": "Trump suggests he’ll know if Putin wants a peace deal with Ukraine soon into their meeting",
    "description": "President Donald Trump said Monday that he expected to determine mere moments into his meeting with Russian leader Vladimir Putin this week whether it would be possible to work out a deal to halt the war in Ukraine.",
    "link": "https://www.pbs.org/newshour/politics/trump-suggests-hell-know-if-putin-wants-a-peace-deal-with-ukraine-soon-into-their-meeting",
    "timestamp": "2025-08-11T20:20:48Z"
  },
  {
    "title": "Millions to lose health insurance and food stamps from GOP tax bill",
    "description": "Roughly 10 million Americans are estimated to lose health insurance coverage from Medicaid or Obamacare by 2034, and nearly 3 million more will lose SNAP.",
    "link": "https://www.washingtonexaminer.com/policy/healthcare/3496687/millions-lose-health-insurance-medicaid-food-stamps-gop-tax-bill-cbo/",
    "timestamp": "2025-08-11T20:20:29Z"
  },
  {
    "title": "‘South Park’ Doesn’t Say A Single Word In Its Hilariously Petty Response To Kristi Noem",
    "description": "The homeland security secretary called the long-running animated series “lazy” after it roasted her in a recent episode.",
    "link": "https://www.huffpost.com/entry/south-park-creators-respond-to-kristi-noems-complaint-about-them-in-hilariously-petty-way_n_689a13dee4b0be3f5edc42a2",
    "timestamp": "2025-08-11T20:19:58Z"
  },
  {
    "title": "House GOP Backs Up Trump on D.C. Crime Push",
    "description": "\"House Republicans moved quickly Monday to follow President Donald Trump’s lead as he took unprecedented action to target Washington’s locally elected government — further heightening the GOP’s scrutiny of the capital city and its Democratic",
    "link": "https://politicalwire.com/2025/08/11/house-gop-backs-up-trump-on-d-c-crime-push/",
    "timestamp": "2025-08-11T20:19:55Z"
  },
  {
    "title": "Zelensky dials Modi ahead of Putin-Trump talks",
    "description": "The Indian PM has reaffirmed New Delhi’s commitment to a swift resolution of the Ukraine conflict by diplomatic means Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622772-zelensky-dials-modi-ahead-of/",
    "timestamp": "2025-08-11T20:18:08Z"
  },
  {
    "title": "Texas Democrats embrace Newsom’s redistricting rebuttal as California draws new map",
    "description": "Gov. Gavin Newsom and Texas Democrats jointly promoted California’s plan to redraw congressional lines and offset a redistricting scheme in Texas. The proposed map is expected to be made public next week.",
    "link": "https://www.kpbs.org/news/politics/2025/08/11/texas-democrats-embrace-newsoms-redistricting-rebuttal-as-california-draws-new-map",
    "timestamp": "2025-08-11T20:17:38Z"
  },
  {
    "title": "Nvidia’s Six-Word Response to China",
    "description": "Just days after securing a controversial deal to re-enter the Chinese market, the AI giant is on the defensive, forcefully denying accusations from Beijing that its chips are a tool for espionage.",
    "link": "https://gizmodo.com/nvidias-six-word-response-to-china-2000641571",
    "timestamp": "2025-08-11T20:16:50Z"
  },
  {
    "title": "FACT FOCUS: Trump exaggerates, misstates facts on Washington crime",
    "description": "Statistics rebut Trump’s claims about violence crime in DC.",
    "link": "https://www.bostonherald.com/2025/08/11/trump-facts-dc-crime/",
    "timestamp": "2025-08-11T20:16:10Z"
  },
  {
    "title": "Trump opens door to sales of version of Nvidia’s next-gen AI chips in China",
    "description": "U.S. President Donald Trump on Monday suggested he might allow Nvidia to sell a scaled-down version of its next-generation advanced GPU chip in China, despite deep-seated fears in Washington that China could harness American artificial intelligence capabiliti…",
    "link": "https://biztoc.com/x/3733deb9e80c683b",
    "timestamp": "2025-08-11T20:15:14Z"
  },
  {
    "title": "Jimmy Kimmel Prepared to Move to Italy to Escape Trump",
    "description": "The comedian sat down with ex Sarah Silverman to discuss politics and possible means of escape. Jimmy Kimmel might be the next American comedian to flee to Europe to escape President Donald Trump. Kimmel, who has hosted the ABC late-night comedy show Jimmy Ki…",
    "link": "https://freerepublic.com/focus/f-chat/4334019/posts",
    "timestamp": "2025-08-11T20:15:01Z"
  },
  {
    "title": "Shocking decline of a Silicon Valley icon: Inside Intel’s 20-year slide, and the case that could change all",
    "description": "Intel, once a tech giant, faces turmoil marked by leadership challenges and intense competition. Political pressure, including calls for the CEO's resignation, exacerbates the situation. Strategic missteps, production delays, and missed opportunities in the s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/shocking-decline-of-a-silicon-valley-icon-inside-intels-20-year-slide-and-the-case-that-could-change-all/articleshow/123244416.cms",
    "timestamp": "2025-08-11T20:13:52Z"
  },
  {
    "title": "Leading Dem Promises To Thwart Trump’s Effort To Crack Down On DC Crime",
    "description": "Dem Rep. Jamie Raskin is pledging to introduce a resolution that would terminate President Trump's emergency powers to take control over DC's police force.",
    "link": "https://dailycaller.com/2025/08/11/jamie-raskin-trump-dc-crime/",
    "timestamp": "2025-08-11T20:10:55Z"
  },
  {
    "title": "5 things to know as Newsom and Trump go back to court over the National Guard in LA",
    "description": "Gov. Gavin Newsom alleges the Trump administration broke a 19th Century law called the Posse Comitatus Act when it deployed military units to Los Angeles in June.",
    "link": "https://www.kpbs.org/news/politics/2025/08/11/5-things-to-know-as-newsom-and-trump-go-back-to-court-over-the-national-guard-in-la",
    "timestamp": "2025-08-11T20:09:09Z"
  },
  {
    "title": "Marlow: Investigation Season—Why the DOJ Should Investigate Judge Juan Merchan Next",
    "description": "Judge Juan Merchan presided over the most blatantly partisan of all the lawfare cases against Trump that I documented in my book “Breaking the Law.”\nThe post Marlow: Investigation Season—Why the DOJ Should Investigate Judge Juan Merchan Next appeared first on…",
    "link": "https://www.breitbart.com/politics/2025/08/11/marlow-investigation-season-why-the-doj-should-investigate-judge-juan-merchan-next/",
    "timestamp": "2025-08-11T20:08:31Z"
  },
  {
    "title": "Illinois governor responds after Trump calls him ‘incompetent’",
    "description": "Illinois Gov. J.B. Pritzker responded after President Donald Trump called him \"incompetent\" and made comments on the governor's weight.",
    "link": "https://www.nbcchicago.com/news/local/pritzker-responds-after-trump-calls-him-incompetent-comments-on-his-weight/3807905/",
    "timestamp": "2025-08-11T20:07:33Z"
  },
  {
    "title": "'I'm really sorry': Emma Thompson admits Harry Potter is not an 'important' part of her career",
    "description": "Emma Thompson, who played Professor Sybil Trelawney in Harry Potter, shared her true feelings about the series.",
    "link": "https://winteriscoming.net/emma-thompson-admits-harry-potter-not-important",
    "timestamp": "2025-08-11T20:07:05Z"
  },
  {
    "title": "US closes lower amid reports on China deadline extension",
    "description": "Wall Street finished trading in negative territory on Monday, after CNBC reported that United States President Donald Trump supposedly signed an executive order extending the China tariff deadline by ...",
    "link": "https://biztoc.com/x/ab2af9fc81a75666",
    "timestamp": "2025-08-11T20:04:43Z"
  },
  {
    "title": "Trump Tells Homeless in DC 'You Spit, We Hit'",
    "description": "President Donald Trump announced he would take control of Washington DC’s Metropolitan Police Department and deploy the National Guard as part of a push to reduce crime and homelessness in the nation’s capital.\n“Our capital city has been overtaken by violent …",
    "link": "https://biztoc.com/x/bf1c51c2248fbcf6",
    "timestamp": "2025-08-11T20:04:36Z"
  },
  {
    "title": "Trump extends China tariff truce by another 90 days, pushing new deadline to November",
    "description": "US President Donald Trump reportedly signed an order delaying the reimposition of higher tariffs on Chinese goods on Monday, hours before a trade truce between Washington and Beijing was due to expire.\nThe halt on steeper tariffs will be in place for another …",
    "link": "https://biztoc.com/x/da816a1646dff3e0",
    "timestamp": "2025-08-11T20:04:30Z"
  },
  {
    "title": "Trump signs order to extend China tariff truce by 90 days, hours before it was set to expire",
    "description": "The halt on steeper tariffs will be in place for another 90 days, the Wall Street Journal and CNBC reported.",
    "link": "https://www.thejournal.ie/trump-signs-order-to-extend-china-tariff-truce-by-90-days-6788067-Aug2025/",
    "timestamp": "2025-08-11T20:03:16Z"
  },
  {
    "title": "Trump’s tax law will mostly benefit the rich, while leaving poorer Americans with less, CBO says",
    "description": "The CBO estimates that the 10% of poorest Americans will lose roughly $1,200 a year.",
    "link": "https://www.bostonherald.com/2025/08/11/trump-tax-law-cbo/",
    "timestamp": "2025-08-11T20:01:12Z"
  },
  {
    "title": "Trump’s tax law will mostly benefit the rich, while leaving poorer Americans with less, CBO says",
    "description": "The CBO estimates that the 10% of poorest Americans will lose roughly $1,200 a year.",
    "link": "https://www.denverpost.com/2025/08/11/trump-tax-law-cbo/",
    "timestamp": "2025-08-11T20:01:12Z"
  },
  {
    "title": "According to Musk's Grok, \"the most notorious criminal in DC, based on convictions and notoriety, it's President Donald Trump - convicted on 34 felonies in NY, with the verdict upheld in January 2025\" [Obvious]",
    "description": "According to Musk's Grok, \"the most notorious criminal in DC, based on convictions and notoriety, it's President Donald Trump - convicted on 34 felonies in NY, with the verdict upheld in January 2025\"",
    "link": "https://www.fark.com/comments/13773640/According-to-Musks-Grok-most-notorious-criminal-in-DC-based-on-convictions-notoriety-its-President-Donald-Trump-convicted-on-34-felonies-in-NY-with-verdict-upheld-in-January-2025",
    "timestamp": "2025-08-11T20:00:45Z"
  },
  {
    "title": "Donald Trump’s Progeny Warns Investors Not To Bet Against Bitcoin Or Ethereum, Here’s Why",
    "description": "Bitcoin and Ethereum’s latest surge has not only shaken up investors but also drawn a reaction from Eric Trump, who used the moment to warn traders against taking bearish positions. Over the past 24 hours, Bitcoin climbed back above the $120,000 level, while …",
    "link": "https://bitcoinist.com/dont-bet-against-bitcoin-ethereum/",
    "timestamp": "2025-08-11T20:00:23Z"
  },
  {
    "title": "Vance Says U.S. Is “Done” Funding Ukraine; Unless…",
    "description": "The current vice president, JD Vance, has said that the United States has decided that it's \"done\" funding Ukraine's war with Russia. However, he did offer a workaround for it, if Europe wants to continue to fund the conflict.",
    "link": "https://www.shtfplan.com/headline-news/vance-says-u-s-is-done-funding-ukraine-unless",
    "timestamp": "2025-08-11T20:00:11Z"
  },
  {
    "title": "Trump Threatens to Boot Homeless People From Washington DC and Wants to Clean Up City After Prez Sees Them Living in Tents While Driving To Golf Course",
    "description": "Donald Trump wants to make one thing clear: he is not a fan of seeing homeless people while on his way to go golfing, and now he's doing something about it.",
    "link": "https://radaronline.com/p/trump-homeless-people-washington-driving-to-golf-course-national-guard/",
    "timestamp": "2025-08-11T20:00:00Z"
  }
]