[
  {
    "title": "US sanctions Mexican banks, alleging connections to cartel money laundering",
    "description": "Mexican Finance Ministry says it has not received evidence to support claims against CIBanco, Intercam and Vector banks.",
    "link": "https://www.aljazeera.com/news/2025/6/25/us-sanctions-mexican-banks-alleging-connections-to-cartel-money-laundering",
    "timestamp": "2025-06-25T23:26:57Z"
  },
  {
    "title": "First on WMUR: Scott Brown jumping into 2026 race for U.S. Senate in New Hampshire",
    "description": "Concord N.H. — Scott Brown is in. The Rye Republican is launching another campaign to return to the U.S. Senate, WMUR Political Director Adam Sexton was first to report on Wednesday. \"The reason I am running is a kind of fed up with the federal delegation. We…",
    "link": "https://freerepublic.com/focus/f-news/4325311/posts",
    "timestamp": "2025-06-25T23:26:38Z"
  },
  {
    "title": "Rapping, acting cameo among fringe activities lining Mamdani's thin work resume",
    "description": "Zohran Mamdani's victory has led critics to question whether his patchwork of odd jobs after college and limited public service will be enough experience to run New York City.",
    "link": "https://www.foxnews.com/politics/rapping-acting-cameo-among-fringe-activities-lining-mamdanis-thin-work-resume",
    "timestamp": "2025-06-25T23:24:40Z"
  },
  {
    "title": "Known unknowns: Mapping Iran’s nuclear programme",
    "description": "American and Israeli strikes have done clear damage, but uncertainties remain about what has survived\nAfter America’s strikes on Iran on June 22nd, Donald Trump claimed that the country’s key nuclear facilities were “totally obliterated”. Other American offic…",
    "link": "https://biztoc.com/x/978455253a0dde53",
    "timestamp": "2025-06-25T23:24:15Z"
  },
  {
    "title": "Surveys Gone Sideways: Avoid These Common Sampling Pitfalls",
    "description": "Survey size isn’t everything. Without clean sampling, your data-driven decisions could be headed in the wrong direction.\nContinue reading...",
    "link": "https://www.cmswire.com/digital-marketing/surveys-gone-sideways-avoid-these-common-sampling-pitfalls/",
    "timestamp": "2025-06-25T23:23:56Z"
  },
  {
    "title": "Capitol Police arrest dozens of people protesting Medicaid cuts in Trump budget bill",
    "description": "President Donald Trump's budget bill, which is currently with the Senate, includes deep cuts to Medicaid.",
    "link": "https://biztoc.com/x/d59e865e7901b5b0",
    "timestamp": "2025-06-25T23:23:40Z"
  },
  {
    "title": "Legendary fund manager makes bold S&P 500 prediction as stocks near all-time highs",
    "description": "It's been a remarkable ride since President Donald Trump announced widespread tariffs on April 2. Trump's so-called “Liberation Day” announcement included harsher tariff rates than hoped, forcing investors to rethink their expectations for the U.S. economy.\nT…",
    "link": "https://biztoc.com/x/6f8f60653c6532ec",
    "timestamp": "2025-06-25T23:23:36Z"
  },
  {
    "title": "Trump gets ‘golden share’ power in US Steel buyout. US agencies will get it under future presidents",
    "description": "By MARC LEVY\nHARRISBURG, Pa. (AP) — President Donald Trump will control the so-called “golden share” that’s part of the national security agreement under which he allowed Japan-based Nippon Steel to buy out iconic American steelmaker U.S. Steel, according to …",
    "link": "https://biztoc.com/x/3ee5be7c52d090ae",
    "timestamp": "2025-06-25T23:23:35Z"
  },
  {
    "title": "Trump gets 'golden share' power in US Steel buyout. US agencies will get it under future presidents",
    "description": "New disclosures with the U.S. Securities and Exchange Commission show that President Donald Trump will control the so-called “golden share” that’s part of the national security agreement under which he allowed Japan-based Nippon Steel to buy out iconic...",
    "link": "https://biztoc.com/x/3e9bcf971ff77408",
    "timestamp": "2025-06-25T23:23:28Z"
  },
  {
    "title": "NATO's United Front Tested As Trump Hammers Spain",
    "description": "Trump deemed the summit in The Hague this week a resounding success, while taking aim at Spain's refusal to commit to dramatic spending increases for defense.",
    "link": "https://www.newsweek.com/nato-donald-trump-defense-spending-2089941",
    "timestamp": "2025-06-25T23:22:26Z"
  },
  {
    "title": "How perverse that the media can’t accept Trump’s stunning victory in the Middle East",
    "description": "President Donald Trump’s strikes on Iranian nuclear sites and the cease-fire he brokered soon after between Israel and Iran were awesome accomplishments.",
    "link": "https://nypost.com/2025/06/25/opinion/how-perverse-that-the-media-cant-accept-trumps-stunning-victory-in-the-middle-east/",
    "timestamp": "2025-06-25T23:21:43Z"
  },
  {
    "title": "Why Oil Market Held Firm In Face Of Another Middle East War",
    "description": "The volatility of the Iran-Israel war did not result in a major spike in American gas prices, and future impacts appear unlikely to be catastrophic.",
    "link": "https://dailycaller.com/2025/06/25/why-oil-market-held-firm-in-face-of-another-middle-east-war/",
    "timestamp": "2025-06-25T23:20:08Z"
  },
  {
    "title": "CIA says Iran’s nuclear program ‘severely damaged’ by U.S. strikes",
    "description": "CIA Director John Ratcliffe said Iran’s nuclear program was “severely damaged” by recent U.S. air strikes, a finding that mirrors President Trump's statements.",
    "link": "https://www.nbcnews.com/politics/national-security/cia-says-irans-nuclear-program-severely-damaged-us-strikes-rcna215121",
    "timestamp": "2025-06-25T23:18:41Z"
  },
  {
    "title": "‘Bibi Netanyahu was a WARRIOR!’ Trump Posts Wild Rant Defending Israeli PM Against Corruption Trial ‘WITCH HUNT’",
    "description": "President Donald Trump is going to the mat to defend Israeli Prime Minister Benjamin Netanyahu against corruption charges he's currently facing.\nThe post ‘Bibi Netanyahu was a WARRIOR!’ Trump Posts Wild Rant Defending Israeli PM Against Corruption Trial ‘WITC…",
    "link": "https://www.mediaite.com/media/news/bibi-netanyahu-was-a-warrior-trump-posts-wild-rant-defending-israeli-pm-against-corruption-trial-witch-hunt/",
    "timestamp": "2025-06-25T23:18:38Z"
  },
  {
    "title": "Top Dems Support Radical Mamdani for NYC Mayor; Opponents: This Is What Mass Immigration Has Wrought",
    "description": "Far-left Democrats are tickled pink that radical Islamic socialist Zohran Mamdani beat former New York Governor Andrew Cuomo in yesterday’s Big Apple mayoral primary. Indeed, top Democrats, including Senate Minority Leader Chuck Schumer (N.Y.), are apparently…",
    "link": "https://freerepublic.com/focus/f-news/4325307/posts",
    "timestamp": "2025-06-25T23:18:08Z"
  },
  {
    "title": "Terrorism Means Something Different Now",
    "description": "The firewall between violent nonstate actors and conventional warfare has become highly permeable.",
    "link": "http://foreignpolicy.com/2025/06/25/counter-terrorism-iran-united-states/",
    "timestamp": "2025-06-25T23:17:30Z"
  },
  {
    "title": "Of Course Trump Lashes Out At 'Scum' Media While Overseas",
    "description": "Donald J. Trump used some time while in The Hague, Netherlands, to lash out at the media. Interestingly, and on an aside, The Hague is home to the International Criminal Court, but Donald isn't there to be prosecuted for his crimes. \n[Readers may recall that …",
    "link": "https://crooksandliars.com/2025/06/course-trump-lashes-out-scum-media-while",
    "timestamp": "2025-06-25T23:16:46Z"
  },
  {
    "title": "Trump slams news coverage of US intel report on Iran attack, says B-2 pilots upset",
    "description": "President Donald Trump attempted to dismiss U.S. intelligence reports on the attack on Iranian nuclear facilities claiming such rhetoric allegedly devalued the military.",
    "link": "https://abcnews.go.com/Politics/trump-hegseth-slam-news-coverage-us-intel-report/story?id=123198161",
    "timestamp": "2025-06-25T23:15:43Z"
  },
  {
    "title": "Hegseth to Hold Press Conference on Operation Midnight Hammer Thursday",
    "description": "Defense Secretary Pete Hegseth will hold a press conference at the Pentagon on Thursday about Operation Midnight Hammer in response to reports questioning the success of the strikes. President Donald Trump announced in a Truth Social post that Hegseth and\nThe…",
    "link": "https://www.breitbart.com/politics/2025/06/25/hegseth-to-hold-press-conference-on-operation-midnight-hammer-thursday/",
    "timestamp": "2025-06-25T23:14:57Z"
  },
  {
    "title": "Argentina's GDP Growth Larger than China's in First Three Months of 2025",
    "description": "Argentina's annual Gross Domestic Product (GDP) growth stood at 5.8 percent during the first quarter of 2025, outpacing China, the National Institute of Statistics and Census of Argentina (INDEC) shockingly revealed this week.\nThe post Argentina’s GDP Growth …",
    "link": "https://www.breitbart.com/economy/2025/06/25/argentinas-gdp-growth-larger-than-chinas-in-first-three-months-of-2025/",
    "timestamp": "2025-06-25T23:14:26Z"
  },
  {
    "title": "Trump tells Republicans to ‘kill’ top US state media outlet",
    "description": "US President Donald Trump has urged shutting down Voice of America Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620548-trump-asks-kill-voice-of-america/",
    "timestamp": "2025-06-25T23:13:39Z"
  },
  {
    "title": "The Iran strikes that proved the influencers wrong: Why Trump’s base never blinked",
    "description": "When President Donald Trump ordered precision strikes on Iran’s nuclear facilities, a familiar chorus of so-called “conservative” and “populist” influencers rushed to declare doom. The strikes, they insisted, would shatter Trump’s coalition.Tucker Carlson rag…",
    "link": "https://freerepublic.com/focus/f-news/4325306/posts",
    "timestamp": "2025-06-25T23:13:37Z"
  },
  {
    "title": "Trump gets ‘golden share’ power in US Steel buyout. US agencies will get it under future presidents",
    "description": "The national security agreement became effective June 13.",
    "link": "https://www.bostonherald.com/2025/06/25/trump-us-steel-nippon/",
    "timestamp": "2025-06-25T23:13:15Z"
  },
  {
    "title": "'Travesty!' Raging Trump tries to  'save' Netanyahu in 'Bugs Bunny' bribery case",
    "description": "President Donald Trump fumed Wednesday afternoon in a lengthy social media screed blasting the ongoing criminal trial of Israeli Prime Minister Benjamin \"Bibi\" Netanyahu.A shocked Trump denounced Netanyahu's ongoing legal proceedings, which he characterized a…",
    "link": "https://www.rawstory.com/trump-netanyahu-2672436626/",
    "timestamp": "2025-06-25T23:12:28Z"
  },
  {
    "title": "Mistakenly deported man Kilmar Abrego Garcia to remain in jail for now",
    "description": "Lawyers for the Maryland father, a Salvadoran immigrant, fear he could face a second deportation if released.",
    "link": "https://www.aljazeera.com/news/2025/6/25/mistakenly-deported-man-kilmar-abrego-garcia-to-remain-in-jail-for-now",
    "timestamp": "2025-06-25T23:11:09Z"
  },
  {
    "title": "Trump administration sues all 15 Maryland federal judges over order blocking removal of immigrants",
    "description": "The Trump administration has filed a lawsuit against all 15 federal judges in Maryland over an order blocking the immediate deportation of migrants challenging their removals, ratcheting up a fight with the federal judiciary over President Donald Trump...",
    "link": "https://abcnews.go.com/US/wireStory/trump-administration-sues-15-maryland-federal-judges-order-123202283",
    "timestamp": "2025-06-25T23:10:18Z"
  },
  {
    "title": "When Iran's Supreme Leader emerges from hiding he will find a very different nation",
    "description": "The war has left the country significantly weakened - and left Ayatollah Ali Khamenei a diminished leader",
    "link": "https://www.bbc.com/news/articles/c0j4g1ll8yqo",
    "timestamp": "2025-06-25T23:05:14Z"
  },
  {
    "title": "CNBC Anchor Compares Mamdani NYC Mayor Primary Victory to ‘The Dark Knight Rises’ Plot | Video",
    "description": "Joe Kernen sees Bane's takeover of Gotham in the democratic socialist's victory\nThe post CNBC Anchor Compares Mamdani NYC Mayor Primary Victory to ‘The Dark Knight Rises’ Plot | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/cnbc-anchor-recites-plot-of-dark-knight-rises-following-mamdani-victory-video/",
    "timestamp": "2025-06-25T23:04:16Z"
  },
  {
    "title": "Jill Biden's top aide bails on House investigation in Biden fitness - NewsBreak",
    "description": "Anthony Bernal, the top aide to Jill Biden , abruptly withdrew from his scheduled interview with the House Oversight Committee after President Trump's Whit",
    "link": "https://www.newsbreak.com/share/4073368475779-jill-biden-s-top-aide-bails-on-house-investigation-in-biden-fitness?_f=app_share&amp;pd=00aa4ozn&amp;lang=en_US&amp;send_time=1750891296&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.25.0.37%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-v7%2Cns_foryou_rank_exp_25q2-v3%2Cns_foryou_model_exp_25q2_v2-v8%2Cns_foryou_blend_exp_25q2-v5&amp;s=i2",
    "timestamp": "2025-06-25T23:03:56Z"
  },
  {
    "title": "Trump gets ‘golden share’ power in US Steel buyout. US agencies will get it under future presidents",
    "description": "The provision gives the president the power to appoint a board member and have a say in company decisions that affect domestic steel production and competition with overseas producers.",
    "link": "https://www.wpxi.com/news/local/trump-gets-golden-share-power-us-steel-buyout-us-agencies-will-get-it-under-future-presidents/XGZ377VPZ5AJNNV3NDYHZLNZWY/",
    "timestamp": "2025-06-25T23:02:54Z"
  },
  {
    "title": "Anti-ICE California Senator Is Buddy-Buddy With Activists That Helped Spark LA Riots",
    "description": "The Democratic senator detained at a DHS press conference has asked his colleagues to allocate $2 million to a friendly group tied to anti-deportation riots.",
    "link": "https://dailycaller.com/2025/06/25/anti-ice-california-senator-padilla-close-activists-helped-spark-los-angeles-riots/",
    "timestamp": "2025-06-25T23:02:26Z"
  },
  {
    "title": "The virtually abandoned Florida airport being turned into 'Alligator Alcatraz'",
    "description": "Surrounded by alligator infested swamps, BBC Mundo visited the site forming part of the Trump administration's mass deportation agenda.",
    "link": "https://www.bbc.com/news/articles/cwyrnrnxy7yo",
    "timestamp": "2025-06-25T23:02:19Z"
  },
  {
    "title": "Trump gets 'golden share' power in US Steel buyout. US agencies will get it under future presidents",
    "description": "New disclosures with the U.S. Securities and Exchange Commission show that President Donald Trump will control the so-called “golden share” that’s part of the national security agreement under which he allowed Japan-based Nippon Steel to buy out iconic...",
    "link": "https://abcnews.go.com/Business/wireStory/trump-gets-golden-share-power-us-steel-buyout-123208466",
    "timestamp": "2025-06-25T23:02:11Z"
  },
  {
    "title": "Asian Shares Face Cautious Start as Rally Pauses: Markets Wrap",
    "description": "Asian equities may struggle for direction when trading opens on Thursday, tracking a flat session on Wall Street with traders assessing simmering economic and geopolitical risks.",
    "link": "https://financialpost.com/pmn/business-pmn/asian-shares-face-cautious-start-as-rally-pauses-markets-wrap",
    "timestamp": "2025-06-25T23:01:28Z"
  },
  {
    "title": "Inside the US trans military ban",
    "description": "One of the first executive orders that President Donald Trump signed in his second term of office stated that being transgender is incompatible with the ‘rigorous standards necessary for military service’. It set the stage for a ban on trans people serving in…",
    "link": "https://www.bbc.co.uk/programmes/p0lkz1fw",
    "timestamp": "2025-06-25T23:01:00Z"
  },
  {
    "title": "Rumor spread a pregnant woman had stillbirth in ICE custody. Here's what we know",
    "description": "The woman had begged for help and was denied, reports say.",
    "link": "https://www.snopes.com//news/2025/06/25/ice-pregnant-woman-stillbirth/",
    "timestamp": "2025-06-25T23:01:00Z"
  },
  {
    "title": "'Save Bibi from the witch hunt': Trump urges Israel to cancel graft trial against Netanyahu",
    "description": "The U.S. President's rambling post came 24 hours after he twice Trump excoriated Netanyahu for jeopardizing the U.S.-brokered cease-fire between Israel and Iran",
    "link": "https://www.haaretz.com/israel-news/2025-06-26/ty-article/.premium/save-bibi-from-the-witch-hint-trump-urges-israel-to-cancel-netanyahus-graft-trial/00000197-a949-d32c-a5df-fb6bea3e0000",
    "timestamp": "2025-06-25T23:00:50Z"
  },
  {
    "title": "Climate Activists Block the Road as Man Rushes Home to Pregnant Wife",
    "description": "As he tries to drive off, others try to block him. But he refuses to back down. He ultimately breaks through the blockade and speeds away.\nThe post Climate Activists Block the Road as Man Rushes Home to Pregnant Wife first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/climate-activists-block-the-road-as-man-rushes-home-to-pregnant-wife/",
    "timestamp": "2025-06-25T23:00:39Z"
  },
  {
    "title": "Mediator in Trump's lawsuit against Paramount, CBS News proposes $20 million settlement",
    "description": "A mediator involved in President Donald Trump's $20 billion lawsuit against Paramount proposed a $20 million settlement, according to The Wall Street Journal.",
    "link": "https://www.foxnews.com/media/mediator-trumps-lawsuit-against-paramount-cbs-news-proposes-20-million-settlement",
    "timestamp": "2025-06-25T23:00:15Z"
  },
  {
    "title": "Abby Phillip: 'When Donald Trump Does It, Zero Fox Given'",
    "description": "Fox News' hypocrisy in vivid display when Trump dropped his live F-bomb the other day about Iran and Israel. Not a peep of condemnation from any of those legends at Fox News (probably because Trump is the president, he can do or say whatever the F he wants, r…",
    "link": "https://crooksandliars.com/2025/06/abby-phillip-when-donald-trump-does-it",
    "timestamp": "2025-06-25T23:00:01Z"
  },
  {
    "title": "Trump’s f-bomb on live TV instantly launches a thousand memes",
    "description": "President Donald Trump launched a new meme after becoming the first U.S. Commander in Chief to say \"f*ck\" on live TV. His outburst soon came to represent the sentiments of many on subjects like DIY, sports, and video games.\n\n\nTruly, there are millions, if not…",
    "link": "https://www.dailydot.com/memes/donald-trump-f-word-meme/",
    "timestamp": "2025-06-25T23:00:00Z"
  },
  {
    "title": "Missouri health providers and advocates raise alarms ahead of vote on ‘big, beautiful’ bill",
    "description": "Missouri stands to lose $23 billion in federal Medicaid funds over the next 10 years if proposed changes become law, the Missouri Foundation for Health says.",
    "link": "https://www.stltoday.com/news/local/government-politics/article_5eeee0cb-ed56-4697-840d-f559c749013c.html",
    "timestamp": "2025-06-25T23:00:00Z"
  },
  {
    "title": "Enbridge Looks to Raise Canada’s Oil Flows to U.S. via New Pipeline",
    "description": "Rising Canadian oil production and continued demand for more shipping capacity at the key U.S. refining hubs have prompted Canada’s pipeline giant Enbridge to test interest from potential shippers for a new pipeline in Illinois linked to the Mainline system. …",
    "link": "https://oilprice.com/Energy/Crude-Oil/Enbridge-Looks-to-Raise-Canadas-Oil-Flows-to-US-via-New-Pipeline.html",
    "timestamp": "2025-06-25T23:00:00Z"
  },
  {
    "title": "Bangladesh: Foreign Aid Cuts Affect Rohingya Children’s Education",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n A Rohingya girl walks past shelters in a refugee camp in Cox's Bazar, Bangladesh, March 9, 2025.\n © 2025 Abdullah Bawshore\n \n \n\n\n \nUS and other foreign donor cutbacks in humanitarian aid have worsened the existing ed…",
    "link": "https://www.hrw.org/news/2025/06/25/bangladesh-foreign-aid-cuts-affect-rohingya-childrens-education",
    "timestamp": "2025-06-25T23:00:00Z"
  },
  {
    "title": "Trump Claims Pete Hegseth Will Show ‘Irrefutable’ Proof the NYT and CNN ‘Lied’ About Impact of Iran Strikes at 8AM Presser",
    "description": "President Donald Trump announced that Hegseth would hold a press conference to show \"irrefutable\" proof that CNN and the New York Times \"lied.\"\nThe post Trump Claims Pete Hegseth Will Show ‘Irrefutable’ Proof the NYT and CNN ‘Lied’ About Impact of Iran Strike…",
    "link": "https://www.mediaite.com/politics/trump-claims-pete-hegseth-will-show-irrefutable-proof-the-nyt-and-cnn-lied-about-impact-of-iran-strikes-at-8am-presser/",
    "timestamp": "2025-06-25T22:59:27Z"
  },
  {
    "title": "4 ways Trump’s big bill could change the U.S. immigration system",
    "description": "President Donald Trump’s spending cuts and border security package would inject roughly $150 billion into his mass deportation agenda over the next four years, funding everything from an extension of the United States' southern border wall to detention center…",
    "link": "https://www.pbs.org/newshour/politics/4-ways-trumps-big-bill-could-change-the-u-s-immigration-system",
    "timestamp": "2025-06-25T22:57:53Z"
  },
  {
    "title": "Get ‘Serious About Getting Our Fiscal House in Order,’ OMB Chief Tells Senate Panel",
    "description": "Trump administration Office of Management and Budget Director Russell Vought testified before a Senate panel on Wednesday about defunding the Corporation for Public Broadcasting (CPB)... Read More\nThe post Get ‘Serious About Getting Our Fiscal House in Order,…",
    "link": "https://www.dailysignal.com/2025/06/25/omb-chief-defends-proposed-cuts-blatant-waste-fraud-before-senate-panel/",
    "timestamp": "2025-06-25T22:54:47Z"
  },
  {
    "title": "Notice a red sticker on a Dollar Tree item? It means the price is going up",
    "description": "Dollar Tree is raising prices to $1.50 on some items that used to cost $1.25. Employees are putting red stickers over items to note the change.",
    "link": "https://www.businessinsider.com/dollar-tree-raises-some-prices-1-50-stickers-2025-6",
    "timestamp": "2025-06-25T22:53:47Z"
  },
  {
    "title": "Republican Ticket in Virginia Seeks Unity Going Into Campaign Season",
    "description": "Virginians don’t elect their statewide executive officers as a party “ticket” like the U.S. president and vice president do, so, the races can be “every... Read More\nThe post Republican Ticket in Virginia Seeks Unity Going Into Campaign Season appeared first …",
    "link": "https://www.dailysignal.com/2025/06/25/republican-ticket-virginia-seeks-unity-going-campaign-season/",
    "timestamp": "2025-06-25T22:53:36Z"
  },
  {
    "title": "‘They got caught in a lie’: Sen. Murphy on Trump and Hegseth’s meltdown over intel report on Iran",
    "description": "Senator Chris Murphy (D-CT) joins Nicolle Wallace on Deadline White House to discuss Donald Trump doubling down on claims ...",
    "link": "https://biztoc.com/x/6693f5604511e4a7",
    "timestamp": "2025-06-25T22:53:17Z"
  },
  {
    "title": "Trump calls for cancellation of Netanyahu's trial: Ridiculous witch hunt",
    "description": "Trump condemns the ongoing trial of Netanyahu as a \"Witch Hunt,\" demanding its immediate cancellation or a pardon. He vows the US will \"save Bibi Netanyahu,\" stressing their harmonious working relationship.",
    "link": "https://www.israelnationalnews.com/news/410670",
    "timestamp": "2025-06-25T22:52:00Z"
  },
  {
    "title": "128 House Democrats Vote Against Rep. Al Green’s Trump Impeachment Inquiry, Social Media Claims Congressional Cowardice",
    "description": "On Tuesday, Rep. Al Green (D-Texas) voted along with dozens of House Democrats, including Rep. Alexandria Ocasio-Cortez, in favor of beginning an impeachment inquiry into President Donald Trump over the president’s strikes on three Iranian nuclear facilities …",
    "link": "https://bossip.com/3253843/128-house-democrats-vote-against-impeachment/",
    "timestamp": "2025-06-25T22:51:40Z"
  },
  {
    "title": "Trump gets ‘golden share’ power in US Steel buyout. US agencies will get it under future presidents",
    "description": "HARRISBURG, Pa. — President Donald Trump will control the so-called “golden share” that’s part of the national security agreement under which he allowed Japan-based Nippon Steel to buy out iconic American steelmaker U.S. Steel, according to disclosures with t…",
    "link": "https://biztoc.com/x/f9438361594a0cc5",
    "timestamp": "2025-06-25T22:50:40Z"
  },
  {
    "title": "'Slippery slope': Experts sound alarm on Trump's new National Guard tactic",
    "description": "A new report suggests that President Donald Trump's administration sent National Guard troops in Los Angeles to assist the Drug Enforcement Administration in a law enforcement operation about 130 miles outside the city, in a move that experts say seems unlawf…",
    "link": "https://www.rawstory.com/national-guard-2672436557/",
    "timestamp": "2025-06-25T22:50:21Z"
  },
  {
    "title": "Chess, golf, video gaming: The sports helping executives stay at the top of their game",
    "description": "<![CDATA[ Is that afternoon golfing really a form of corporate education? ]]>",
    "link": "https://cnaluxury.channelnewsasia.com/people/golf-chess-tennis-sports-business-executives-259171",
    "timestamp": "2025-06-25T22:48:44Z"
  },
  {
    "title": "David Ellison Secretly Met With Bari Weiss For Possible Role at CBS News: Report",
    "description": "Skydance CEO and founder David Ellison -- poised to head CBS News after his company's merger with Paramount Global wraps up --  \"has quietly courted\" Bari Weiss to bring her on board for a potential high-profile gig with the network, according to a report by …",
    "link": "https://www.mediaite.com/media/david-ellison-secretly-met-with-bari-weiss-for-possible-role-at-cbs-news-report/",
    "timestamp": "2025-06-25T22:48:29Z"
  },
  {
    "title": "Capitol Police arrest dozens of people protesting Medicaid cuts in Trump budget bill",
    "description": "President Donald Trump's budget bill, which is currently with the Senate, includes deep cuts to Medicaid.",
    "link": "https://www.cnbc.com/2025/06/25/capitol-police-medicaid-protests-.html",
    "timestamp": "2025-06-25T22:46:41Z"
  },
  {
    "title": "Maine Rep. Laurel Libby officially has speaking rights restored after controversial trans athlete censure",
    "description": "Maine lawmakers restored Laurel Libby's speaking rights following censure for identifying a trans athlete, as public opinion shifts.",
    "link": "https://www.foxnews.com/sports/maine-rep-laurel-libby-officially-has-speaking-rights-restored-after-controversial-trans-athlete-censure",
    "timestamp": "2025-06-25T22:45:32Z"
  },
  {
    "title": "Trump attacks the media for reporting on intelligence assessment of Iran strikes",
    "description": "President Donald Trump is harshly criticizing CNN and The New York Times for reporting on an initial defense assessment of the U.S. bombing of Iran nuclear sites.",
    "link": "https://www.clickorlando.com/entertainment/2025/06/25/trump-attacks-the-media-for-reporting-on-intelligence-assessment-of-iran-strikes/",
    "timestamp": "2025-06-25T22:45:04Z"
  },
  {
    "title": "Trump Says Zelensky Wants War with Russia to End After NATO Summit Meeting",
    "description": "President Donald Trump said Wednesday that Ukrainian President Volodymyr Zelensky wants to see the war between Ukraine and Russia come to a close following their meeting at the NATO Summit. Trump was asked about the meeting during his press conference at the …",
    "link": "https://freerepublic.com/focus/f-news/4325301/posts",
    "timestamp": "2025-06-25T22:44:25Z"
  },
  {
    "title": "President Trump Boasts About Being Called 'Daddy' By 'Very Affectionate' NATO Secretary General Mark Rutte — As 'Embarrassing' Comments Leave Critics Feeling Sick",
    "description": "An angry President Donald Trump flexed his parental prowess while dropping an \"F-Bomb\" on Iran and Israel.",
    "link": "https://radaronline.com/p/president-trump-daddy-nato-secretary-general-mark-rutte-video/",
    "timestamp": "2025-06-25T22:43:22Z"
  },
  {
    "title": "Murphy: Trump Administration 'Lying' About Iran's Nuclear Program",
    "description": "Senator Chris Murphy (D-CT) said Wednesday on MSNBC's \"Deadline\" that President Donald Trump's administration lied about the amount of damage done to Iran's nuclear program because of the U.S. military strikes.\nThe post Murphy: Trump Administration ‘Lying’ Ab…",
    "link": "https://www.breitbart.com/clips/2025/06/25/murphy-trump-administration-lying-about-irans-nuclear-program/",
    "timestamp": "2025-06-25T22:42:48Z"
  },
  {
    "title": "What America Can Learn From Iran’s Failure",
    "description": "The regime’s predicament shows what happens when conspiracies, rather than reality, shape decision making.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/06/what-america-can-learn-from-irans-failure/683329/",
    "timestamp": "2025-06-25T22:39:00Z"
  },
  {
    "title": "“Throw her out like a dog”: Trump wants CNN’s Natasha Bertrand fired after report on Iranian strikes",
    "description": "In an exclusive report, CNN reported the U.S. strikes on Iran didn’t actually destroy nuclear sites",
    "link": "https://www.salon.com/2025/06/25/throw-her-out-like-a-dog-trump-wants-cnns-natasha-bertrand-fired-after-report-on-iranian-strikes/",
    "timestamp": "2025-06-25T22:38:38Z"
  },
  {
    "title": "Trump's Border Czar Issues Stark Warning to Zohran Mamdani: 'Game On'",
    "description": "Homan said immigration enforcement is going to \"double down and triple down\" on New York City.",
    "link": "https://www.newsweek.com/trumps-border-czar-issues-stark-warning-zohran-mamdani-game-2090822",
    "timestamp": "2025-06-25T22:38:33Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.06.25 720p WEB H264-onX",
    "description": "Season , Episode – \"Start of a LONG War!” ‘Daddy’ Trump at NATO After Israel-Iran Ceasefire\"After 12 days of frenzy over World War 3, the bombs and rockets over Tehran and Tel Aviv have stopped, for now. And, under relentless pressure from Donald Trump, NATO’…",
    "link": "https://post.rlsbb.cc/piers-morgan-uncensored-2025-06-25-720p-web-h264-onx/",
    "timestamp": "2025-06-25T22:37:07Z"
  },
  {
    "title": "Poll: Majority of Republicans back Trump's strikes on Iran; most Americans fear getting dragged into war",
    "description": "Americans are divided on U.S. strikes against Iranian nuclear sites, with Republicans supporting the military action and Democrats fearing increased safety risks.",
    "link": "https://www.foxnews.com/politics/poll-majority-republicans-back-trumps-strikes-iran-most-americans-fear-getting-dragged-war",
    "timestamp": "2025-06-25T22:33:06Z"
  },
  {
    "title": "US blocks money transfers by 3 Mexico-based financial institutions accused of aiding cartels",
    "description": "The orders targeted banks CIBanco and Intercam Banco, and brokerage Vector Casa de Bolsa.",
    "link": "https://www.bostonherald.com/2025/06/25/mexico-us-treasury-cartels-transfers/",
    "timestamp": "2025-06-25T22:31:03Z"
  },
  {
    "title": "Energy Secretary Credits Trump for Stable Oil Prices Amid Iran Crisis",
    "description": "Energy Secretary Chris Wright said American consumers are reaping the benefits from the Trump administration’s pro-energy agenda, a fundamental departure from Biden-era policies. Citing the... Read More\nThe post Energy Secretary Credits Trump for Stable Oil P…",
    "link": "https://www.dailysignal.com/2025/06/25/energy-secretary-credits-trump-keeping-oil-prices-low-middle-east-crisis/",
    "timestamp": "2025-06-25T22:30:40Z"
  },
  {
    "title": "Chip Roy Goes Nuclear on Libertarian Witness Advocating For Due Process: ‘Killing Americans!’",
    "description": "Libertarians have been vocal critics in recent months of President Donald Trump’s use of emergency powers to deport and indefinitely imprison migrants\nThe post Chip Roy Goes Nuclear on Libertarian Witness Advocating For Due Process: ‘Killing Americans!’ first…",
    "link": "https://www.mediaite.com/politics/chip-roy-goes-nuclear-on-libertarian-witness-advocating-for-due-process-killing-americans/",
    "timestamp": "2025-06-25T22:29:53Z"
  },
  {
    "title": "U.S. stocks little changed amid Powell's testimony",
    "description": "NEW YORK, June 25 (Xinhua) -- U.S. stocks wavered on Wednesday as investors weighed fresh remarks from Federal Reserve Chair Jerome Powell. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/26/us-stocks-little-changed-amid-powell039s-testimony",
    "timestamp": "2025-06-25T22:28:00Z"
  },
  {
    "title": "Donald Trump Criticizes Zohran Mamdani after NYC Mayoral Primary: ‘Communist Lunatic’",
    "description": "President Donald Trump criticized Democrat Socialist Zohran Mamdani after he took the lead in New York City’s Democrat Mayoral primary, calling him a “communist lunatic.” In a post on Truth Social, Trump criticized Democrats such as Rep. Alexandria Ocasio-Cor…",
    "link": "https://freerepublic.com/focus/f-news/4325298/posts",
    "timestamp": "2025-06-25T22:27:31Z"
  },
  {
    "title": "Trump considers more Patriots for Ukraine, says Putin 'has to end' the war",
    "description": "The U.S. president added that Russian President Vladimir Putin \"really has to end that war.\"",
    "link": "https://www.japantimes.co.jp/news/2025/06/26/world/politics/trump-patriots-ukraine-putin/",
    "timestamp": "2025-06-25T22:27:00Z"
  },
  {
    "title": "US military to create two new border zones, officials say",
    "description": "WASHINGTON (Reuters) -The Pentagon will create two new military zones along the border with Mexico, U.S. officials said on Wednesday, a move that allows troops to temporarily detain migrants or trespassers. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/06/26/us-military-to-create-two-new-border-zones-officials-say",
    "timestamp": "2025-06-25T22:27:00Z"
  },
  {
    "title": "'Not going to tell you': Bondi refuses to answer question on Trump corruption (Krystina Alarcon Carroll/Raw Story)",
    "description": "Krystina Alarcon Carroll / Raw Story:\n‘Not going to tell you’: Bondi refuses to answer question on Trump corruption  —  Attorney General Pam Bondi became angry and refused to answer questions from Senator Jeff Merkley (D-OR) when it came to whether foreign in…",
    "link": "https://www.memeorandum.com/250625/p127",
    "timestamp": "2025-06-25T22:25:01Z"
  },
  {
    "title": "Key parts of Iran's nuclear program still intact, says Pentagon report disputed by Trump",
    "description": "President Donald Trump has fervently disputed the findings of a Pentagon intelligence assessment of his strikes on Iran's nuclear facilities.",
    "link": "https://www.usatoday.com/story/news/world/2025/06/25/irans-nuclear-program-intact-pentagon-assessment/84357546007/",
    "timestamp": "2025-06-25T22:22:02Z"
  },
  {
    "title": "GOP assemblyman calls out AOC's suburban roots with yearbook proof after Trump spat",
    "description": "Ocasio-Cortez's claim of being a tough \"Bronx girl\" in Twitter feud with Trump draws criticism from NY assemblyman who shared her suburban high school yearbook.",
    "link": "https://www.foxnews.com/politics/gop-assemblyman-calls-aocs-suburban-roots-yearbook-proof-trump-spat",
    "timestamp": "2025-06-25T22:21:15Z"
  },
  {
    "title": "Trump representative Kari Lake on Voice of America’s fate: ‘Scrap the whole thing and start over’",
    "description": "Layoff notices were sent to employees at the agencies, cutting staff by 85%.",
    "link": "https://www.bostonherald.com/2025/06/25/kari-lake-voice-of-america/",
    "timestamp": "2025-06-25T22:18:34Z"
  },
  {
    "title": "Comparing U.S. Iran strike to Hiroshima, Trump plays down intelligence report",
    "description": "The U.S. president argued that the damage was severe even though available intelligence reports were inconclusive.",
    "link": "https://www.japantimes.co.jp/news/2025/06/26/world/politics/us-iran-hiroshima-trump-intelligence/",
    "timestamp": "2025-06-25T22:18:00Z"
  },
  {
    "title": "Why China Is Standing by Iran",
    "description": "On Tuesday morning, in a series of posts celebrating the fragile ceasefire between Iran and Israel, Donald Trump touched on one of Iran’s most significant economic relationships, writing, “China can now continue to purchase oil from Iran.” Today on Big Take A…",
    "link": "https://biztoc.com/x/6632eb80a7410c82",
    "timestamp": "2025-06-25T22:17:37Z"
  },
  {
    "title": "Fox News host confronted over Trump's war powers: 'This isn't what I want'",
    "description": "Rep. Jason Crow (D-CO) and Fox News host Will Cain sparred Wednesday afternoon over whether President Donald Trump fulfilled his legal obligations before bombing three nuclear facilities in Iran.Over the weekend, Trump sent congressional leaders a brief lette…",
    "link": "https://www.rawstory.com/will-cain-2672436309/",
    "timestamp": "2025-06-25T22:17:34Z"
  },
  {
    "title": "CIA chief says Iran nuclear site 'severely damaged' by US strikes - despite leaked report claiming the impact was minimal",
    "description": "The head of the CIA has said a \"body of credible intelligence\" indicates that Iran's nuclear programme was \"severely damaged\" by a US operation last weekend.",
    "link": "https://news.sky.com/story/cia-chief-says-iran-nuclear-site-severely-damaged-by-us-strikes-despite-leaked-report-claiming-the-impact-was-minimal-13388729",
    "timestamp": "2025-06-25T22:17:00Z"
  },
  {
    "title": "Examining Whether Trump Had the Constitutional Authority to Attack Iran",
    "description": "In the aftermath of President Donald Trump's decision to bomb three of Iran's nuclear facilities, numerous Democrats claimed the president's actions were unconstitutional and a violation of the War Powers Resolution. It is a contentious and hotly debated issu…",
    "link": "https://www.factcheck.org/2025/06/examining-whether-trump-had-the-constitutional-authority-to-attack-iran/",
    "timestamp": "2025-06-25T22:15:49Z"
  },
  {
    "title": "Israel, US Monitoring Iran and Ready To Renew Strikes If Necessary, Defense Minister Says in Confidential Briefing",
    "description": "TEL AVIV—Defense Minister Israel Katz told lawmakers on Tuesday evening that Israel and the United States are prepared to resume strikes on Iran if the regime attempts to rebuild its nuclear or ballistic missile programs, according to two officials familiar w…",
    "link": "https://freebeacon.com/israel/israel-us-monitoring-iran-and-ready-to-renew-strikes-if-necessary-defense-minister-says-in-confidential-briefing/",
    "timestamp": "2025-06-25T22:15:43Z"
  },
  {
    "title": "New York City's mayoral primary casts bright light on ranked choice voting — and its future nationally",
    "description": "New York City's high-profile mayoral primary this week shined a bright light on the nation’s ongoing experiment with ranked choice voting.",
    "link": "https://www.nbcnews.com/politics/elections/new-york-city-mayoral-primary-casts-bright-light-ranked-choice-voting-rcna213812",
    "timestamp": "2025-06-25T22:14:03Z"
  },
  {
    "title": "The MAGA dream family would cost all of us",
    "description": "The MAGA movement has a particular vision of the ideal American family. For starters, there are lots of kids. There’s a dad who works a manufacturing job to provide for them financially. And, according to many influential figures on the right, there’s a stay-…",
    "link": "https://www.vox.com/policy/417756/family-moms-mothers-jobs-maga-trump-vance-kids",
    "timestamp": "2025-06-25T22:11:09Z"
  },
  {
    "title": "Senate Republicans look to sweeten Medicaid pot to silence dissent on Trump's 'big, beautiful bill'",
    "description": "A new proposal to help stabilize rural hospital access is floating around Capitol Hill as Senate Republicans consider their reconciliation bill.",
    "link": "https://www.foxnews.com/politics/senate-republicans-look-sweeten-medicaid-pot-silence-dissent-trumps-big-beautiful-bill",
    "timestamp": "2025-06-25T22:10:32Z"
  },
  {
    "title": "Piers Morgan Uncensored 2025.06.25 720p WEB H264-onX",
    "description": "Season , Episode – \"Start of a LONG War!” ‘Daddy’ Trump at NATO After Israel-Iran Ceasefire\"After 12 days of frenzy over World War 3, the bombs and rockets over Tehran and Tel Aviv have stopped, for now. And, under relentless pressure from Donald Trump, NATO’…",
    "link": "https://post.rlsbb.ru/piers-morgan-uncensored-2025-06-25-720p-web-h264-onx/",
    "timestamp": "2025-06-25T22:09:20Z"
  },
  {
    "title": "Joe Rogan Slams Journalists — While Mindlessly Regurgitating Trump’s Lies",
    "description": "Joe Rogan trashed mainstream media but then parroted Trump’s lies, forcing Bernie Sanders to explain how press freedom actually works — and why it matters.\nThe post Joe Rogan Slams Journalists — While Mindlessly Regurgitating Trump’s Lies first appeared on Me…",
    "link": "https://www.mediaite.com/opinion/joe-rogan-slams-journalists-while-mindlessly-regurgitating-trumps-lies/",
    "timestamp": "2025-06-25T22:08:36Z"
  },
  {
    "title": "Trump Administration Unveils Sweeping Student Loan Forgiveness Restrictions",
    "description": "The Trump administration proposed sweeping new restrictions on student loan forgiveness for public service borrowers this week.",
    "link": "https://www.forbes.com/sites/adamminsky/2025/06/25/trump-administration-unveils-sweeping-student-loan-forgiveness-restrictions/",
    "timestamp": "2025-06-25T22:08:30Z"
  },
  {
    "title": "Strange bedfellows: Antisemitism unites the radical left and the isolationist right",
    "description": "Trump's strike on Iran's nuclear sites revealed a point of agreement that anti-war activists on both the left and the right share: a willingness to blame the Jews.",
    "link": "https://nypost.com/2025/06/25/opinion/antisemitism-unites-the-radical-left-and-the-isolationist-right/",
    "timestamp": "2025-06-25T22:08:16Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "The moves come after the S&P 500 finished Wednesday's session flat.",
    "link": "https://www.cnbc.com/2025/06/25/stock-market-today-live-updates.html",
    "timestamp": "2025-06-25T22:07:58Z"
  },
  {
    "title": "I Saw Up Close Exactly Why Zohran Mamdani Won—and Why the Attacks Don’t Work on Him",
    "description": "This should have strategists on both sides of the aisle taking note.",
    "link": "https://slate.com/news-and-politics/2025/06/zohran-mamdani-nyc-mayor-election-trump-muslim.html",
    "timestamp": "2025-06-25T22:07:49Z"
  },
  {
    "title": "Dems at a loss to stop Trump, ending states’ Medicaid scams and other commentary",
    "description": "Democrats today are “engaged in bitter infighting and struggling to come up with a unified strategy to oppose Trump,” observes The Washington Times’ Byron York.",
    "link": "https://nypost.com/2025/06/25/opinion/dems-at-a-loss-to-stop-trump-ending-states-medicaid-scams-and-other-commentary/",
    "timestamp": "2025-06-25T22:06:24Z"
  },
  {
    "title": "CIA says intelligence indicates Iran’s nuclear programme severely damaged",
    "description": "US airstrikes mean key sites ‘will take years to be rebuilt’",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/25/cia-says-intelligence-indicates-irans-nuclear-programme-severely-damaged/",
    "timestamp": "2025-06-25T22:03:08Z"
  }
]