[
  {
    "title": "Business leaders hail Erdoğan-Trump meeting as boost for $100 bln trade goal",
    "description": "Turkish business representatives said Friday that strategic energy and trade agreements signed during President Recep Tayyip Erdoğan's White House visit this week could propel bilateral trade with the U.S. toward the $100 billion target.",
    "link": "https://www.hurriyetdailynews.com/business-leaders-hail-erdogan-trump-meeting-as-boost-for-100-bln-trade-goal-214042",
    "timestamp": "2025-09-27T05:41:07Z"
  },
  {
    "title": "Epstein’s secret schedules reveal meetings with Musk and Prince Andrew",
    "description": "The documents also show the disgraced financier kept ties with powerful men years after his conviction.",
    "link": "https://7news.com.au/news/epsteins-secret-schedules-reveal-meetings-with-musk-and-prince-andrew-c-20159359",
    "timestamp": "2025-09-27T05:34:42Z"
  },
  {
    "title": "Netanyahu says Palestinian state would be 'national suicide' for Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu vowed Friday in an angry UN address to block a Palestinian state, accusing European leaders of pushing his country into \"national suicide\" and rewarding Hamas. Former British prime minister Tony Blair was floated in s…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/netanyahu-says-palestinian-state-would-be-national-suicide-for-israel/articleshow/124177282.cms",
    "timestamp": "2025-09-27T05:34:36Z"
  },
  {
    "title": "Trump takes tariff scalpel to pharma",
    "description": "In a sweeping new trade policy move, US President Donald Trump has announced a 100 per cent tariff on all branded and patented pharmaceutical products imported into the United States starting October 1. India, a major exporter of generic drugs and Active Phar…",
    "link": "https://www.dailypioneer.com/2025/business/trump-takes-tariff-scalpel-to-pharma.html",
    "timestamp": "2025-09-27T05:30:24Z"
  },
  {
    "title": "Trump's vast federal cuts create distrust on Capitol Hill as shutdown risk grows",
    "description": "The Trump administration faces scrutiny for stalling federal funds. Billions for programs like Head Start and NIH were withheld. A watchdog group states these actions violate budget laws. This creates a crisis on Capitol Hill, raising separation of powers que…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-vast-federal-cuts-create-distrust-on-capitol-hill-as-shutdown-risk-grows/articleshow/124177136.cms",
    "timestamp": "2025-09-27T05:21:24Z"
  },
  {
    "title": "Federal shutdown threat raises fears of Acadia closure",
    "description": "A park shutdown next week would come at the start of a month when hundreds of thousands of visitors come to Bar Harbor and Acadia.",
    "link": "http://www.bangordailynews.com/2025/09/27/hancock/hancock-business/federal-shutdown-acadia-closure-joam40zk0w/",
    "timestamp": "2025-09-27T05:14:30Z"
  },
  {
    "title": "A hungrier, poorer and more anxious Iran awaits 'snapback' of UN sanctions over its nuclear program",
    "description": "As Iran's ailing economy braced Saturday for the reimposition of United Nations sanctions over its nuclear program, it is ordinary people who increasingly...",
    "link": "https://www.yahoo.com/news/articles/hungrier-poorer-more-anxious-iran-050204756.html",
    "timestamp": "2025-09-27T05:02:04Z"
  },
  {
    "title": "US Attorney General Bondi Says Deploying DOJ Agents to ICE Facilities",
    "description": "US Attorney General Pam Bondi said that she was sending agents of the US Department of Justice (DOJ) to ensure security at facilities of the US Immigration and Customs Enforcement (ICE).",
    "link": "https://sputnikglobe.com/20250927/us-attorney-general-bondi-says-deploying-doj-agents-to-ice-facilities-1122873076.html",
    "timestamp": "2025-09-27T05:01:05Z"
  },
  {
    "title": "West Bank: Tales of the dispossessed",
    "description": "Continuous expansion by Israel of settlements in the West Bank is pushing Palestinians out of their homes and move elsewhere. The pattern consists of settler attacks on Palestinian farms and villages, often aided and abetted, say locals, by the Israeli milita…",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0927/1535557-west-bank-palestine/",
    "timestamp": "2025-09-27T05:00:59Z"
  },
  {
    "title": "This week we revealed the shortlist for Scotland's building of the year",
    "description": "This week on Dezeen, RIAS announced four buildings in contention for this year's Andrew Doolan Best Building in Scotland award, including a bridge clad with local granite. Also on the shortlist were the restoration of a remote 16th-century tower, a teaching h…",
    "link": "https://www.dezeen.com/2025/09/27/rias-scotland-best-building-this-week/",
    "timestamp": "2025-09-27T05:00:37Z"
  },
  {
    "title": "Trump promised retribution - how far will he go?",
    "description": "As the US president pushes a crackdown on left-wing groups and openly targets political foes, critics ask where he's taking America.",
    "link": "https://www.bbc.com/news/articles/c0q74pxx871o",
    "timestamp": "2025-09-27T05:00:08Z"
  },
  {
    "title": "Trump promised retribution - how far will he go?",
    "description": "As the US president pushes a crackdown on left-wing groups and openly targets political foes, critics ask where he's taking America",
    "link": "https://www.bbc.co.uk/news/articles/c0q74pxx871o",
    "timestamp": "2025-09-27T05:00:08Z"
  },
  {
    "title": "Malachy Clerkin: It’s getting very hard to separate American sport from American ugliness",
    "description": "Enjoyment of NFL at Croke Park and the Ryder Cup is disturbed by Trump-dominated backdrop",
    "link": "https://www.irishtimes.com/sport/golf/2025/09/27/malachy-clerkin-its-getting-very-hard-to-separate-american-sport-from-american-ugliness/",
    "timestamp": "2025-09-27T05:00:01Z"
  },
  {
    "title": "A tall order: Can Starbucks, once the king of the high street, return to its glory days?",
    "description": "As the multi-billion-dollar coffee chain announces the closure of some UK stores and the loss of 900 jobs in the US, Ellie Muir looks at the company’s fall from grace, from changing consumer tastes to political boycotts",
    "link": "https://www.the-independent.com/life-style/starbucks-stores-closing-menu-boycott-b2834490.html",
    "timestamp": "2025-09-27T05:00:00Z"
  },
  {
    "title": "Coming to Croke Park: Aaron Rodgers, US sporting great and castigated ‘critical thinker’",
    "description": "The Pittsburgh Steelers player is among the best quarterbacks of all time but has attracted attention in recent years for leftfield pronouncements on a variety of subjects",
    "link": "https://www.irishtimes.com/sport/2025/09/27/coming-to-croke-park-aaron-rodgers-us-sporting-great-and-castigated-critical-thinker/",
    "timestamp": "2025-09-27T05:00:00Z"
  },
  {
    "title": "Pressure on Venezuela Unacceptable - Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov, during a meeting at the UN with his Venezuelan counterpart Yvan Gil, said pressure on sovereign states is unacceptable, the Russian Foreign Ministry said.",
    "link": "https://sputnikglobe.com/20250927/pressure-on-venezuela-unacceptable---lavrov-1122872470.html",
    "timestamp": "2025-09-27T04:49:36Z"
  },
  {
    "title": "Pakistan Defence Minister Khawaja Asif admits ‘Hybrid Model’ of governance, says army and government rule by consensus",
    "description": "Pakistan's Defence Minister Khawaja Asif defended the nation's 'hybrid model' of governance, asserting civilian and military leaders share power equally. Despite accusations of military dominance, Asif denied the army's ultimate control, deflecting by labelin…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pakistan-defence-minister-khawaja-asif-admits-hybrid-model-of-governance-says-army-and-government-rule-by-consensus/articleshow/124176714.cms",
    "timestamp": "2025-09-27T04:46:45Z"
  },
  {
    "title": "Trump’s dual shocks thwart bets on Indian stock market rebound",
    "description": "Prior to Trump’s pharma tariff and H-1B visa fee shocks, the MSCI India gauge had risen for three straight weeks, adding more than 4% in what was its longest run since May",
    "link": "https://www.bloomberg.com/news/articles/2025-09-27/trump-s-dual-shocks-thwart-bets-on-indian-stock-market-rebound",
    "timestamp": "2025-09-27T04:45:44Z"
  },
  {
    "title": "Donald Trump's UNGA address reveals a new global reality: A tougher world for countries like India.",
    "description": "And he keeps reminding the world that from every podium—this time it was United Nations General Assembly.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-unga-speech-global-impact-world-order-international-relations-trump-presidency-foreign-policy-shifts-india-11758891863430.html",
    "timestamp": "2025-09-27T04:44:54Z"
  },
  {
    "title": "Pak Military Pleaded For Cessation Of Fighting During Operation Sindoor: India",
    "description": "India has said Pakistan's military 'pleaded' with it for a cessation of fighting during Operation Sindoor and that there is no room for any third party to intervene in any issue between New Delhi and Islamabad.",
    "link": "https://www.ndtvprofit.com/nation/pak-military-pleaded-for-cessation-of-fighting-during-operation-sindoor-india",
    "timestamp": "2025-09-27T04:40:58Z"
  },
  {
    "title": "FBI fires agents pictured kneeling during racial justice protest in 2020",
    "description": "Sources said the agents in question were trying to ease tensions between protesters and law enforcement.",
    "link": "https://www.japantimes.co.jp/news/2025/09/27/world/politics/fbi-firings-racial-justice-protests/",
    "timestamp": "2025-09-27T04:40:00Z"
  },
  {
    "title": "Palestine recognition: PM Christopher Luxon denies concern over US backlash at heart of statehood decision",
    "description": "Donald Trump says he sees recognition of a Palestine state as a \"reward\" for Hamas.",
    "link": "https://www.nzherald.co.nz/nz/politics/palestine-recognition-pm-christopher-luxon-denies-concern-over-us-backlash-at-heart-of-statehood-decision/7RCNWLWJ5ZDGJBNV5ACA4F52VA/",
    "timestamp": "2025-09-27T04:40:00Z"
  },
  {
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "President Donald Trump is planning big tariffs on pharmaceuticals, kitchen counters, bathroom vanities, upholstered furniture and heavy trucks",
    "link": "https://biztoc.com/x/dcc3bd7f837b49c2",
    "timestamp": "2025-09-27T04:33:48Z"
  },
  {
    "title": "‘I Am so Grateful That Somebody Is Listening’—Parents React to Autism Announcement",
    "description": "‘I Am so Grateful That Somebody Is Listening’—Parents React to Autism Announcementtheepochtimes.com",
    "link": "https://www.theepochtimes.com/health/i-am-so-grateful-that-somebody-is-listening-parents-react-to-autism-announcement-5920565",
    "timestamp": "2025-09-27T04:33:31Z"
  },
  {
    "title": "Turkiye, group of athletes call on FIFA, UEFA to ban Israel’s football team",
    "description": "Pressure is growing on football’s governing bodies to take action against Israel’s national team over the war on Gaza.",
    "link": "https://www.aljazeera.com/news/2025/9/27/turkiye-group-of-athletes-call-on-fifa-uefa-to-ban-israels-football-team",
    "timestamp": "2025-09-27T04:32:38Z"
  },
  {
    "title": "Turkiye, group of athletes call on FIFA, UEFA to ban Israel’s football team",
    "description": "Pressure is growing on football's governing bodies to take action against Israel's national team over the war on Gaza.",
    "link": "https://www.aljazeera.com/sports/2025/9/27/turkiye-group-of-athletes-call-on-fifa-uefa-to-ban-israels-football-team",
    "timestamp": "2025-09-27T04:32:38Z"
  },
  {
    "title": "DANIEL MCCARTHY: The Left’s Triple Threat To Free Speech",
    "description": "Jimmy Kimmel's return to the nation's airwaves is proof of just how unseriously left-wing violence is taken by the liberal media.",
    "link": "https://dailycaller.com/2025/09/27/opinion-the-lefts-triple-threat-to-free-speech-daniel-mccarthy/",
    "timestamp": "2025-09-27T04:30:11Z"
  },
  {
    "title": "Patrick Marley: With Comey prosecution, Trump fulfils?his promise of revenge",
    "description": "On the campaign trail, Donald Trump equivocated when television host ‘Dr Phil’ McGraw asked him to swear off retribution against his political foes.",
    "link": "https://www.independent.ie/opinion/analysis/patrick-marley-with-comey-prosecution-trump-fulfilshis-promise-of-revenge/a47603684.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Putin has ‘good proposal’ to end the war in Ukraine, says Lukashenko",
    "description": "Belarusian president Alexander Lukashenko said yesterday, after meeting Vladimir Putin, that the Russian leader would announce a “very good proposal” for ending the war in Ukraine that he said was broadly backed by the US.",
    "link": "https://www.independent.ie/world-news/europe/putin-has-good-proposal-to-end-the-war-in-ukraine-says-lukashenko/a1454982704.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Benjamin Netanyahu appears determined to be on the wrong side of history",
    "description": "The most dangerous of all delusions is the belief that one’s own view of reality is the only reality, said psychologist Paul Watzlawick. Even as the aisles at the UN General Assembly were emptying in protest at the massacre in Gaza, Israeli prime minister Ben…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-benjamin-netanyahu-appears-determined-to-be-on-the-wrong-side-of-history/a678842052.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Donald Trump says ‘there will be others’ after ex-FBI chief James Comey is indicted",
    "description": "US president Donald Trump said yesterday he expects more indictments to be issued against perceived enemies after former FBI chief James Comey was charged.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-says-there-will-be-others-after-ex-fbi-chief-james-comey-is-indicted/a1898696412.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Letters: Democracy in Ireland is now at all-time low after blocking of Maria Steen’s presidential election run",
    "description": "It seems we can now accept that dem­ocracy has reached an all-time low with the playing out of the presidential nominations.",
    "link": "https://www.independent.ie/opinion/letters/letters-democracy-in-ireland-is-now-at-all-time-low-after-blocking-of-maria-steens-presidential-election-run/a112974899.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Recognising Palestinian state sends the message that ‘murdering Jews pays off’, Benjamin Netanyahu tells UN",
    "description": "Israeli prime minister Benjamin Netanyahu sharply denounced Western countries yesterday for embracing Palestinian statehood, accusing them of sending the message that “murdering Jews pays off”.",
    "link": "https://www.independent.ie/world-news/north-america/recognising-palestinian-state-sends-the-message-that-murdering-jews-pays-off-benjamin-netanyahu-tells-un/a1223363307.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Donald Trump’s decision on West Bank boosts hopes for deal to end war",
    "description": "US president Donald Trump has said that he told Israeli prime minister Benjamin Netanyahu he will not allow Israel to annex the West Bank, imposing the clearest limit yet on his support as Israel nears two years of war in the Gaza Strip.",
    "link": "https://www.independent.ie/opinion/comment/donald-trumps-decision-on-west-bank-boosts-hopes-for-deal-to-end-war/a1665466431.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "European shares recover from three-week lows, but weekly momentum fizzles",
    "description": "European stocks rebounded Friday, with the STOXX 600 gaining 0.8%, largely driven by financials and industrials. Steel producers surged on reports of potential EU tariffs against Chinese imports. Healthcare stocks ended flat despite new US drug tariffs, as th…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-recover-from-three-week-lows-but-weekly-momentum-fizzles/articleshow/124176499.cms",
    "timestamp": "2025-09-27T04:27:40Z"
  },
  {
    "title": "Trump finds new trade targets — pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "WASHINGTON (AP) — Naturepedic, a mattress and furniture company based outside Cleveland, has been planning to introduce an upscale upholstered headboard late this year or early in 2026. But President Donald Trump has thrown those plans into disarray. On Thurs…",
    "link": "https://financialpost.com/pmn/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-and-heavy-trucks",
    "timestamp": "2025-09-27T04:18:21Z"
  },
  {
    "title": "Online Censorship Bill Just One Signature Away From Becoming Law In California",
    "description": "A controversial bill awaiting California Democratic Gov. Gavin Newsom’s signature would slap steep new penalties on social media platforms that fail to censor content deemed in violation of the state’s civil rights laws. SB 771, which passed both chambers of …",
    "link": "https://freerepublic.com/focus/f-news/4342924/posts",
    "timestamp": "2025-09-27T04:16:31Z"
  },
  {
    "title": "Elon Musk, Prince Andrew And Peter Thiel Named In Latest Epstein Files; Tesla CEO Says 'False'",
    "description": "The world's richest man, Elon Musk, has been mentioned in the newly released documents related to late convicted sex offender, Jeffrey Epstein, alongside Britain’s Prince Andrew and Peter Thiel, BBC reported. Records from the Jeffrey Epstein Estate, submitted…",
    "link": "https://www.ndtvprofit.com/world/elon-musk-prince-andrew-and-peter-thiel-named-in-latest-epstein-files-tesla-ceo-says-false",
    "timestamp": "2025-09-27T04:15:22Z"
  },
  {
    "title": "ByteDance could still keep 50% profit after selling majority share in TikTok US deal | 5 points",
    "description": "TikTok's parent company, ByteDance, is expected to retain about 50 per cent of the US operation's profits after selling majority ownership. Here's all you need to know about the licensing fee, revenue and profit sharing, and other key points.&nbsp;",
    "link": "https://www.livemint.com/companies/news/bytedance-still-get-around-50-percent-profit-selling-majority-share-donald-trump-tiktok-us-deal-license-revenue-5-points-11758937846876.html",
    "timestamp": "2025-09-27T04:15:15Z"
  },
  {
    "title": "A quick look back at this week’s biggest stories",
    "description": "Former FBI director James Comey has been charged with lying to Congress, Jimmy Kimmel is back on air after his suspension over his Charlie Kirk remarks, and world leaders speak at the U.N. These are the week's top stories",
    "link": "https://abcnews.go.com/Politics/wireStory/quick-back-weeks-biggest-stories-125989662",
    "timestamp": "2025-09-27T04:14:52Z"
  },
  {
    "title": "Trump's trade battle with China puts US soybean farmers in peril",
    "description": "American soybean farmers are worried about where they're going to sell their crops and whether they'll lose money this year because China hasn't bought any for months",
    "link": "https://abcnews.go.com/US/wireStory/trumps-trade-battle-china-puts-us-soybean-farmers-125989241",
    "timestamp": "2025-09-27T04:14:29Z"
  },
  {
    "title": "Trump's vast federal cuts create distrust on Capitol Hill as shutdown risk grows",
    "description": "As Congress confronts a possible government shutdown, it's also weighing the Trump administration's willingness to simply halt federal spending — even when it's against the law",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-vast-federal-cuts-create-distrust-capitol-hill-125989244",
    "timestamp": "2025-09-27T04:14:20Z"
  },
  {
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "President Donald Trump is planning big tariffs on pharmaceuticals, kitchen counters, bathroom vanities, upholstered furniture and heavy trucks",
    "link": "https://abcnews.go.com/Business/wireStory/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-125989246",
    "timestamp": "2025-09-27T04:14:20Z"
  },
  {
    "title": "Trump to declassify files over aviation pioneer Amelia Earhart",
    "description": "The story of Earhart, who vanished in 1937 while flying over the Pacific Ocean, \"has captivated millions\", the US president says.",
    "link": "https://www.bbc.com/news/articles/cgkn84e1nvxo",
    "timestamp": "2025-09-27T04:07:13Z"
  },
  {
    "title": "South Korea's top diplomat says his nation has asked Trump to be a 'peacemaker' with North Korea",
    "description": "South Korea’s top diplomat says his boss has asked President Donald Trump to become “a peacemaker” and use his leadership to get North Korea to talks to reduce military tensions on the Korean Peninsula",
    "link": "https://abcnews.go.com/US/wireStory/south-koreas-top-diplomat-nation-asked-trump-peacemaker-125987702",
    "timestamp": "2025-09-27T04:06:19Z"
  },
  {
    "title": "Pharma Index Down 2%, but Selloff could be an 'Exaggeration'",
    "description": "Nifty's Pharma index saw a decline after US President Trump announced a 100 percent tariff on branded drugs from October 1. Analysts noted India's limited exposure to patented drugs in the US market. Most Indian firms focus on generic medicines, which are not…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-index-down-2-but-selloff-could-be-an-exaggeration/articleshow/124176271.cms",
    "timestamp": "2025-09-27T04:04:30Z"
  },
  {
    "title": "Trump's vast federal cuts create distrust on Capitol Hill as shutdown risk grows",
    "description": "The money started drying up quickly, almost as soon as President Donald Trump began issuing his executive orders.  Money from a landmark bipartisan...",
    "link": "https://www.yahoo.com/news/articles/trumps-vast-federal-cuts-create-040227770.html",
    "timestamp": "2025-09-27T04:02:27Z"
  },
  {
    "title": "Trump's trade battle with China puts US soybean farmers in peril",
    "description": "The leafy soybean plants reach Caleb Ragland's thighs and are ripe for harvest, but the Kentucky farmer is deeply worried.  Beijing, which traditionally has ...",
    "link": "https://finance.yahoo.com/news/trumps-trade-battle-china-puts-040124453.html",
    "timestamp": "2025-09-27T04:01:24Z"
  },
  {
    "title": "As Israel Becomes a Global Pariah Trump Ramps Up Support",
    "description": "It is interesting how President Donald Trump keeps whining about the 20 alleged Israeli hostages that are reportedly still held by Hamas in Gaza, demanding that they be released immediately, while ignoring the hundreds of unarmed Palestinians that are being m…",
    "link": "https://www.lewrockwell.com/2025/09/phil-giraldi/as-israel-becomes-a-global-pariah-trump-ramps-up-support/",
    "timestamp": "2025-09-27T04:01:00Z"
  },
  {
    "title": "Donald Trump Publicly Confessed That He Is Filled With Hate",
    "description": "At the memorial service for Charlie Kirk (billed as a spiritual “revival” by pastors and evangelicals in attendance), the keynote speaker, President Donald Trump, said the following: In that private moment on his dying day, we find everything we need to know …",
    "link": "https://www.lewrockwell.com/2025/09/chuck-baldwin/donald-trump-publicly-confessed-that-he-is-filled-with-hate/",
    "timestamp": "2025-09-27T04:01:00Z"
  },
  {
    "title": "After Public Fallout With Trump, Elon Musk Shows Support Again, Shares Cryptic AI Image Mocking Comey And Blasts Democrats Over Government Shutdown",
    "description": "Tesla Inc. (NASDAQ: TSLA) CEO Elon Musk publicly backed the Trump administration following former FBI Director James Comey‘s indictment.\nMusk Responds to Comey Charges\nMusk posted the AI-generated image on X, showing President Donald Trump arranging pebbles o…",
    "link": "https://biztoc.com/x/401a4b8fa27739be",
    "timestamp": "2025-09-27T04:00:27Z"
  },
  {
    "title": "For Canadians, relaxation comes naturally, even when the Taoiseach brings the rain",
    "description": "It doesn’t take long to get a sense of the sheer immensity of the land mass and the cosmic gall behind Trump’s `51st state’ insult",
    "link": "https://www.irishtimes.com/world/us/2025/09/27/for-canadians-relaxation-comes-naturally-even-when-the-taoiseach-brings-the-rain/",
    "timestamp": "2025-09-27T04:00:00Z"
  },
  {
    "title": "Garden State Blues: Mikie Sherrill’s ‘Rising Star’ Collides with Naval Academy’s Biggest Scandal",
    "description": "Just weeks ago, national Democrats were betting big on their next rising star—a near-certain winner in New Jersey’s governor’s race, already being groomed for national prominence. Now reality intrudes: that star is dimming, and may ...",
    "link": "https://www.americanthinker.com/articles/2025/09/garden_state_blues_mikie_sherrill_s_rising_star_collides_with_naval_academy_s_biggest_scandal.html",
    "timestamp": "2025-09-27T04:00:00Z"
  },
  {
    "title": "Obama’s final booby trap",
    "description": "In the final days of the Obama presidency — while Americans were focused on inaugurating a new president and turning the page on a divisive era — President Barack Obama signed a quiet but sweeping executive order that many now see as a ti...",
    "link": "https://www.americanthinker.com/blog/2025/09/obama_s_final_booby_trap.html",
    "timestamp": "2025-09-27T04:00:00Z"
  },
  {
    "title": "South Korea asks Trump to be a 'peacemaker' with North Korea",
    "description": "South Korea's President Lee Jae Myung asked Donald Trump to mediate talks with North Korea. Trump welcomed this request and expressed willingness to engage again. Trump is expected to visit South Korea next month. This visit raises speculation about a potenti…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/south-korea-asks-trump-to-be-a-peacemaker-with-north-korea/articleshow/124176209.cms",
    "timestamp": "2025-09-27T03:57:25Z"
  },
  {
    "title": "Donald Trump On Gaza: 'Having Productive Discussions With The Middle East'",
    "description": "US President Donald Trump on Saturday took to his social media platform Truth Social to announce that he has been having \"very inspired\" and \"productive\" discussions concerning Gaza, with the Middle East. He added that \"intense\" negotiations have been underwa…",
    "link": "https://www.ndtvprofit.com/world/donald-trump-on-gaza-having-productive-discussions-with-the-middle-east",
    "timestamp": "2025-09-27T03:55:46Z"
  },
  {
    "title": "Charlie Kirk Saw It Coming: Former FBI Director Comey Now Faces Federal Trial",
    "description": "Charlie Kirk’s repeated warnings about former FBI Director James Comey are taking on new significance following Comey’s federal indictment on charges of making false statements and obstruction of justice, underscoring years of Kirk’s denunciations before his …",
    "link": "https://www.breitbart.com/politics/2025/09/26/charlie-kirk-saw-coming-former-fbi-director-comey-faces-federal-trial/",
    "timestamp": "2025-09-27T03:53:43Z"
  },
  {
    "title": "Gustavo Petro: US to revoke visa of leftist Colombian leader",
    "description": "The left-wing Colombian president is a critic of Trump and vocally opposes Israel's operation in Gaza. Petro is in New York for the UN General Assembly and had called on US soldiers to disobey Trump.",
    "link": "https://www.dw.com/en/gustavo-petro-us-to-revoke-visa-of-leftist-colombian-leader/a-74155100",
    "timestamp": "2025-09-27T03:53:00Z"
  },
  {
    "title": "Pakistan military pleaded for cessation of fighting during Operation Sindoor: India at UNGA",
    "description": "India strongly rebuked Pakistan at the UN General Assembly, accusing its Prime Minister of glorifying terrorism. India asserted that Pakistan's military pleaded for a ceasefire during Operation Sindoor after Indian strikes on airbases, refuting claims of vict…",
    "link": "https://economictimes.indiatimes.com/news/defence/pakistan-military-pleaded-for-cessation-of-fighting-during-operation-sindoor-india/articleshow/124176172.cms",
    "timestamp": "2025-09-27T03:52:52Z"
  },
  {
    "title": "Gold firms as inflation data keeps Fed rate cut bets alive",
    "description": "Gold surged to new highs on Friday, extending weekly gains, as U.S. inflation data aligned with forecasts, bolstering expectations for Federal Reserve interest rate cuts later this year. Investors now anticipate an 88% chance of an October rate cut.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-firms-as-inflation-data-keeps-fed-rate-cut-bets-alive/articleshow/124176156.cms",
    "timestamp": "2025-09-27T03:51:01Z"
  },
  {
    "title": "Moldova holds key election as Russia's shadow looms large",
    "description": "The country has accused Moscow of election interference on an unprecedented scale.",
    "link": "https://www.bbc.com/news/articles/c179z9d4vl1o",
    "timestamp": "2025-09-27T03:49:42Z"
  },
  {
    "title": "Supreme Court Hands Trump A Major Win, Allows $4 Billion In Foreign Aid Freeze To Stay In Place As Congressional Deadline Looms",
    "description": "On Friday, the Supreme Court gave the Donald Trump-led administration permission to keep $4 billion in foreign aid frozen, which was set to expire on Sept. 30.\nCourt Backs Executive in Budget Battle\nThe court’s unsigned ruling overturned a decision by U.S. Di…",
    "link": "https://biztoc.com/x/7a1fc9fe68a92988",
    "timestamp": "2025-09-27T03:49:32Z"
  },
  {
    "title": "US stocks end higher after as-expected inflation data; S&P 500, Nasdaq post weekly declines",
    "description": "US stocks closed higher Friday on expected inflation data, yet posted weekly losses, ending winning streaks for S&P 500 and Nasdaq. Investors are weighing the Federal Reserve's future rate cuts against a stronger economy and upcoming earnings season. New tari…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-ends-higher-after-as-expected-inflation-data-sp-500-nasdaq-post-weekly-declines/articleshow/124176133.cms",
    "timestamp": "2025-09-27T03:48:24Z"
  },
  {
    "title": "JUST IN: DOJ Probing DA Fani Willis — Who Had Trump Hauled In For Mugshot — Amid Comey Bombshell",
    "description": "The Department of Justice has subpoenaed records for DA Fani Willis — who brought the election crimes case that resulted in Trump's infamous mugshot.\nThe post JUST IN: DOJ Probing DA Fani Willis — Who Had Trump Hauled In For Mugshot — Amid Comey Bombshell fir…",
    "link": "https://www.mediaite.com/media/print/just-in-doj-probing-da-fani-willis-who-had-trump-hauled-in-for-mugshot-amid-comey-bombshell/",
    "timestamp": "2025-09-27T03:48:03Z"
  },
  {
    "title": "Iran faces reintroduction of nuclear sanctions",
    "description": "Deep sanctions on Iran over its nuclear programme look set to go into force once again, even as a UN watchdog confirmed inspections of its atomic sites had resumed.",
    "link": "https://www.rte.ie/news/world/2025/0927/1535588-iran-sanctions/",
    "timestamp": "2025-09-27T03:44:09Z"
  },
  {
    "title": "China not worried about Pakistan 'flirting' with US: Pak Defence Minister Khwaja Asif",
    "description": "Pakistan's Defence Minister Khwaja Asif asserted China is not concerned by Pakistan's US engagement, reaffirming their strong, reliable partnership. He underscored China as Pakistan's primary arms supplier due to US unreliability. This comes as PM Sharif prai…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-not-worried-about-pakistan-flirting-with-us-pak-defence-minister-khwaja-asif/articleshow/124176090.cms",
    "timestamp": "2025-09-27T03:43:05Z"
  },
  {
    "title": "Trump targets more opponents after 'dirty cop' Comey",
    "description": "President Donald Trump openly called for more political opponents to face criminal charges, cheering the indictment of former FBI director James Comey. This \"undisguised campaign of retribution\" defies US political norms, with Trump directly influencing the J…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-targets-more-opponents-after-dirty-cop-comey/articleshow/124176076.cms",
    "timestamp": "2025-09-27T03:41:06Z"
  },
  {
    "title": "US revokes Colombian president’s visa for urging American soldiers to ‘disobey Trump’",
    "description": "The State Department has accused Gustavo Petro of “incendiary actions” at a New York City protest following his fiery UN address Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625354-us-revokes-colombia-petro-visa/",
    "timestamp": "2025-09-27T03:40:34Z"
  },
  {
    "title": "US House Democrats release Epstein schedules showing plans to meet Elon Musk, Peter Thiel",
    "description": "US Democrats released Jeffrey Epstein's daily schedules, revealing planned meetings with prominent figures like Elon Musk, Peter Thiel, and Steve Bannon. The documents also showed Prince Andrew flew on Epstein's private jet. While no wrongdoing is alleged aga…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-house-democrats-release-epstein-schedules-showing-plans-to-meet-elon-musk-peter-thiel/articleshow/124176045.cms",
    "timestamp": "2025-09-27T03:35:50Z"
  },
  {
    "title": "Bill Maher Is Tracking the ‘Rise of Autocracy’ With James Comey Indictment: ‘Didn’t Even Know He Had a Talk Show’",
    "description": "\"Trump is in his we caught you with your tail light out phase of justice,\" the \"Real Time\" host jokes\nThe post Bill Maher Is Tracking the ‘Rise of Autocracy’ With James Comey Indictment: ‘Didn’t Even Know He Had a Talk Show’ appeared first on TheWrap.",
    "link": "https://www.thewrap.com/bill-maher-james-comey-indictment-trump/",
    "timestamp": "2025-09-27T03:29:45Z"
  },
  {
    "title": "Seoul says it can’t rule out Kim-Trump meeting during APEC summit",
    "description": "A report quoting a South Korean official appeared to reverse Seoul’s earlier position that North Korea’s participation in the summit was unlikely.",
    "link": "https://www.japantimes.co.jp/news/2025/09/27/asia-pacific/politics/trump-kim-south-korea/",
    "timestamp": "2025-09-27T03:27:00Z"
  },
  {
    "title": "Trump expands tariffs beyond US Supreme Court's reach",
    "description": "President Trump is rapidly expanding Section 232 tariffs on diverse imports, including pharmaceuticals and machinery, as a backup against potential Supreme Court rulings on his earlier tariffs. These national security-based levies, covering over a third of U.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-expands-tariffs-beyond-us-supreme-courts-reach/articleshow/124175953.cms",
    "timestamp": "2025-09-27T03:22:03Z"
  },
  {
    "title": "From Wall Street to academia, who is in Trump's line of fire?",
    "description": "Donald Trump has intensified his criticism and actions against numerous corporations, executives, and institutions, upending the status quo. He called for Microsoft's Lisa Monaco to be fired, targeted Goldman Sachs, Intel, and Apple, and cut federal funding t…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/from-wall-street-to-academia-who-is-in-trumps-line-of-fire/articleshow/124175936.cms",
    "timestamp": "2025-09-27T03:19:38Z"
  },
  {
    "title": "Australia to cop deeper impact from new US meds tariffs",
    "description": "New US tariffs on medicines tipped to hit Australia’s pharma exports hard, experts warn.",
    "link": "https://7news.com.au/news/australia-to-cop-deeper-impact-from-new-us-meds-tariffs-c-20157023",
    "timestamp": "2025-09-27T03:15:29Z"
  },
  {
    "title": "Trump administration presses Supreme Court on executive order restricting birthright citizenship",
    "description": "The Trump administration asked the Supreme Court to review the president's executive order limiting birthright citizenship amid ACLU class action suit.",
    "link": "https://www.foxnews.com/politics/trump-administration-presses-supreme-court-executive-order-restricting-birthright-citizenship",
    "timestamp": "2025-09-27T03:15:21Z"
  },
  {
    "title": "US preparing options for military strikes on targets inside Venezuela, NBC News reports",
    "description": "The US is weighing military strikes on drug traffickers inside Venezuela, NBC News reported. Sources said plans could start within weeks, though President Donald Trump has not approved any action so far.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-preparing-options-for-military-strikes-on-targets-inside-venezuela-nbc-news-reports/articleshow/124175882.cms",
    "timestamp": "2025-09-27T03:12:07Z"
  },
  {
    "title": "Lisa Monaco education and career path: Harvard grad and ex-Deputy Attorney General faces Trump’s call to be fired from Microsoft",
    "description": "Lisa Monaco, Harvard graduate and former U.S. Deputy Attorney General, faces fresh scrutiny as Donald Trump urges Microsoft to fire her. With a career spanning the Justice Department, Homeland Security, and corporate law, Monaco recently joined Microsoft as P…",
    "link": "https://timesofindia.indiatimes.com/education/news/lisa-monaco-education-and-career-path-harvard-grad-and-ex-deputy-attorney-general-faces-trumps-call-to-be-fired-from-microsoft/articleshow/124175789.cms",
    "timestamp": "2025-09-27T03:10:54Z"
  },
  {
    "title": "Raskin: Trump Running a 'Regime of Vengeance and Retribution'",
    "description": "Friday on CNN's \"Anderson Cooper 360,\" Rep. Jamie Raskin (D-MD) said President Donald Trump was running a \"regime of vengeance and retribution.\"\nThe post Raskin: Trump Running a ‘Regime of Vengeance and Retribution’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/clips/2025/09/26/raskin-trump-running-a-regime-of-vengeance-and-retribution/",
    "timestamp": "2025-09-27T03:10:14Z"
  },
  {
    "title": "US State Department says it's revoking Colombian president's visa after remarks at New York City protest",
    "description": "US State Department says it's revoking Colombian president's visa after remarks at New York City protestgo.com",
    "link": "https://abcnews.go.com/International/us-state-department-revoking-colombian-presidents-visa-after/story?id=125988185",
    "timestamp": "2025-09-27T03:09:26Z"
  },
  {
    "title": "‘Everything Is On The Table’: Pam Bondi Says Legal ‘Weaponization Has Ended’",
    "description": "Bondi said the \"weaponization\" of the legal system has \"ended,\" following the DOJ's indictment of former FBI Director James Comey.",
    "link": "https://dailycaller.com/2025/09/26/pam-bondi-legal-weaponization-over-james-comey/",
    "timestamp": "2025-09-27T03:09:22Z"
  },
  {
    "title": "Trump to put import taxes on pharmaceutical drugs, kitchen cabinets, furniture and heavy trucks",
    "description": "President Donald Trump said that he will put import taxes of 100% on pharmaceutical drugs, 50% on kitchen cabinets and bathroom vanities, 30% on upholstered furniture and 25% on heavy trucks starting on Oct. 1.",
    "link": "https://www.wpxi.com/news/local/trump-put-import-taxes-pharmaceutical-drugs-kitchen-cabinets-furniture-heavy-trucks/XR63VZ6WYRHTBOREY5ZYSZTEPE/",
    "timestamp": "2025-09-27T03:05:19Z"
  },
  {
    "title": "Trump praises FBI on Comey indictment",
    "description": "United States President Donald Trump praised the US Federal Bureau of Investigation (FBI) as well as its director, Kash Patel, for their work on the indictment of former FBI director James Comey.In a ...",
    "link": "https://biztoc.com/x/1505f8890fea7e9d",
    "timestamp": "2025-09-27T03:04:56Z"
  },
  {
    "title": "Democratic leader Hakeem Jeffries says Trump is marching U.S. into government shutdown",
    "description": "House Democratic Leader Hakeem Jeffries said President Donald Trump and the Republican Party are “marching the country” into a government shutdown over their refusal to meet with Democrats and strike a deal to save health care funding from cuts. Jeffries told…",
    "link": "https://japantoday.com/category/world/democratic-leader-hakeem-jeffries-says-trump-is-marching-the-country-into-a-government-shutdown",
    "timestamp": "2025-09-27T03:03:25Z"
  },
  {
    "title": "Trump says Gaza talks with Middle East countries are intense, will continue",
    "description": "U.S. President Donald Trump announced intense, ongoing talks with Middle Eastern nations regarding Gaza, involving both Israel and Hamas. He presented a 21-point peace plan, aiming for a \"Successfully Completed Agreement.\" These discussions occur amidst globa…",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-gaza-talks-with-middle-east-countries-are-intense-will-continue/articleshow/124175796.cms",
    "timestamp": "2025-09-27T03:02:15Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Calls BS On Trump Over ‘Revenge’ On Comey, Enemies List",
    "description": "Kaitlan Collins called BS on President Donald Trump’s claim he's not seeking \"revenge\" on former FBI Director James Comey and there's no enemies list.\nThe post CNN’s Kaitlan Collins Calls BS On Trump Over ‘Revenge’ On Comey, Enemies List first appeared on Med…",
    "link": "https://www.mediaite.com/media/news/cnns-kaitlan-collins-calls-bs-on-trump-over-revenge-on-comey-enemies-list/",
    "timestamp": "2025-09-27T02:55:28Z"
  },
  {
    "title": "UK to offer to pay more for some drugs to appease Trump: Report",
    "description": "The British government will offer to pay more for medicines bought by the NHS, aiming to defuse U.S. President Donald Trump's complaints about high drug prices and avert steep tariffs. This comes as Trump demands drug companies lower U.S. prices and raise the…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/uk-to-offer-to-pay-more-for-some-drugs-to-appease-trump-report/articleshow/124175739.cms",
    "timestamp": "2025-09-27T02:55:19Z"
  },
  {
    "title": "Anthony Albanese shuts down meeting with Nigel Farage, does not want to see the 'rise’ of populist parties",
    "description": "Anthony Albanese will not meet with Reform UK leader Nigel Farage, asserting he does not want to see the rise of populist organisations that ‘divide people’.",
    "link": "https://7news.com.au/news/anthony-albanese-shuts-down-meeting-with-nigel-farage-does-not-want-to-see-the-rise-of-populist-parties-c-20157763",
    "timestamp": "2025-09-27T02:53:26Z"
  },
  {
    "title": "Venezuela Foreign Ministry warns of ‘immoral military threat’ from US",
    "description": "Minister says US wants his country's oil and gas amid reports Washington readying to strike 'drug targets' in Venezuela.",
    "link": "https://www.aljazeera.com/news/2025/9/27/venezuela-foreign-ministry-warns-of-immoral-military-threat-from-us",
    "timestamp": "2025-09-27T02:48:23Z"
  },
  {
    "title": "Airbnb, Booking.com, Expedia among 158 companies with ties to Israeli settlements: UN database",
    "description": "A UN report identified 158 businesses, including Airbnb and Expedia, operating in Israeli West Bank settlements, which the UN deems illegal. The list grew by 68 new names, prompting Israel to criticize it as an unfair \"blacklist\" against legal business activi…",
    "link": "https://economictimes.indiatimes.com/news/international/business/airbnb-booking-com-expedia-among-158-companies-with-ties-to-israeli-settlements-un-database/articleshow/124175678.cms",
    "timestamp": "2025-09-27T02:47:29Z"
  },
  {
    "title": "Fearing U.S. invasion, Venezuela to hold emergency drills",
    "description": "Venezuela, on high alert over a U.S. military deployment off its coast that has stirred invasion fears, will hold disaster preparedness drills on Saturday as President Nicolas Maduro mulls invoking emergency powers. Maduro called for the drills on Thursday, h…",
    "link": "https://japantoday.com/category/world/fearing-us-invasion-venezuela-to-hold-emergency-drills",
    "timestamp": "2025-09-27T02:46:50Z"
  },
  {
    "title": "Ex-Federal Prosecutor Names 1 Way Comey Indictment Could 'Blow Up' In Trump's Face",
    "description": "Andrew Weissmann spotted an \"unusual\" move that should give \"everyone pause\" following the president's pressure campaign.",
    "link": "https://www.huffpost.com/entry/andrew-weissmann-trump-doj-james-comey-indictment_n_68d728f2e4b085d511c6c324",
    "timestamp": "2025-09-27T02:46:26Z"
  },
  {
    "title": "With government shutdown imminent, Cantwell highlights Democrats' key demand: Stopping sharp increase in health insurance costs",
    "description": "WASHINGTON – Congress headed into the weekend with a government shutdown all but certain to begin on Wednesday, as Democrats demand Republican majorities in the House and Senate act to keep health insurance costs from rising while the White House dismissed th…",
    "link": "https://www.spokesman.com/stories/2025/sep/26/with-government-shutdown-imminent-cantwell-highlig/",
    "timestamp": "2025-09-27T02:45:13Z"
  },
  {
    "title": "States sue over Trump directive to remove 'gender ideology' content from sex ed materials",
    "description": "Sixteen states and D.C. sued the Trump administration to block a policy demanding they remove \"gender ideology\" from sexual health curricula for federal grants. They argue the HHS policy is unlawful, usurps Congress' authority, and targets transgender youth b…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/states-sue-over-trump-directive-to-remove-gender-ideology-content-from-sex-ed-materials/articleshow/124175529.cms",
    "timestamp": "2025-09-27T02:38:44Z"
  }
]