[
  {
    "title": "Cybersecurity on Mute: Trump’s Second Term Declares War on America’s Digital Defenses",
    "description": "The Trump administration’s second-term crusade against America’s cybersecurity agencies has left experts and insiders reeling. With firings at NSA and CYBERCOM, deep cuts to CISA and open retribution against former officials, national cyber defense is being k…",
    "link": "https://observer.com/2025/04/trump-cybersecurity-firings-cisa-nsa-china-threats/",
    "timestamp": "2025-04-10T23:15:11Z"
  },
  {
    "title": "Trump’s Liberation Day: The end of globalist injustice",
    "description": "'The West is significantly and way too much dependent on China'",
    "link": "https://www.wnd.com/2025/04/trumps-liberation-day-the-end-of-globalist-injustice/",
    "timestamp": "2025-04-10T23:14:32Z"
  },
  {
    "title": "Why Nintendo can get away with a $450 Switch 2 price",
    "description": "When Nintendo announced the Switch 2 would cost $450, my initial reaction was disappointment. â\u0080\u009cWhy does it cost so much more?â\u0080\u009d I thought to myself. â\u0080\u009cWhy does Japan get it cheaper?â\u0080\u009d my brain jealously added, once I learned that Nintendo would sell a Ja…",
    "link": "https://www.theverge.com/games/646776/switch-2-price-editorial-dollar-yen-exchange-rate-inflation",
    "timestamp": "2025-04-10T23:14:20Z"
  },
  {
    "title": "1 in 3 Portlanders say they’ve been ‘directly’ impacted by Trump executive orders, poll finds",
    "description": "Sean Horan and three of his partners are going on a trip to Mexico this month. They want to see Mayan and Aztec sites and will spend almost two weeks exploring the country’s cultural heritage, from Mexico City to Cancún. Horan has been excited to see the coun…",
    "link": "https://freerepublic.com/focus/f-news/4310277/posts",
    "timestamp": "2025-04-10T23:13:24Z"
  },
  {
    "title": "'Cost of doing business': Trump's new law firm deals include $125M in pro-MAGA legal work",
    "description": "President Donald Trump is close to announcing a sweeping new deal with law firms that he has accused of weaponizing the legal process in favor of his political opponents that would shower the president’s MAGA causes with hundreds of millions of dollars worth …",
    "link": "https://www.rawstory.com/trump-law-firms-2671743383/",
    "timestamp": "2025-04-10T23:12:54Z"
  },
  {
    "title": "Manitoba government makes fixes to giant Canadian flag after adopting it from Blue Bombers",
    "description": "The large Canadian flag that was recently draped on the front of the Manitoba Legislature is being repaired for a second time and is being adopted by the provincial government.",
    "link": "https://www.cbc.ca/news/canada/manitoba/canada-flag-manitoba-legislature-1.7507512",
    "timestamp": "2025-04-10T23:12:49Z"
  },
  {
    "title": "Trump Becomes First President to Sign Crypto Bill Into Law, Ending Anti-DeFi IRS Rule",
    "description": "The Biden-era rule would have obligated DeFi platforms to comply with tax reporting requirements designed for brokers.",
    "link": "https://decrypt.co/314409/trump-first-president-sign-crypto-bill",
    "timestamp": "2025-04-10T23:12:25Z"
  },
  {
    "title": "Trump’s reality-driven tariff U-turn",
    "description": "When economic pain is imminent, the president, a pragmatist will change course",
    "link": "https://www.wnd.com/2025/04/trumps-reality-driven-tariff-u-turn/",
    "timestamp": "2025-04-10T23:12:04Z"
  },
  {
    "title": "Trump recognises tariff 'transition problems' as US markets fall again",
    "description": "Trump recognises tariff 'transition problems' as US markets fall again\nDonald Trump has said there will \"always be transition problems\" and \"difficulty\" as markets fell again amid continued uncertainty over the US president's global tariff war.\nHis statement …",
    "link": "https://biztoc.com/x/d2cb33940a3672bd",
    "timestamp": "2025-04-10T23:11:26Z"
  },
  {
    "title": "U.S. stocks dove as Wall Street euphoria reverted to concern over U.S.-China trade war",
    "description": "The losses for U.S. stocks accelerated Thursday after the White House clarified that the United States will tax Chinese imports at 145 percent, not the 125 percent rate that President Donald Trump had written about in his posting on Truth Social Wednesday.",
    "link": "https://biztoc.com/x/755948f17587cb89",
    "timestamp": "2025-04-10T23:11:22Z"
  },
  {
    "title": "'Trump's Tariffs Will Drain Retirement Savings, Push Us To The Brink Of Recession,' Says Nancy Pelosi While Quoting Ronald Reagan",
    "description": "Former House Speaker Nancy Pelosi (D-CA) blasted President Donald Trump over his tariff policy last week, warning that it could result in serious economic damage for American families. She also invoked Republican icon Ronald Reagan to drive home her point.\nTh…",
    "link": "https://biztoc.com/x/fecd64d5055e5d95",
    "timestamp": "2025-04-10T23:10:58Z"
  },
  {
    "title": "Trump signs resolution overturning IRS DeFi broker rule",
    "description": "The repeal fosters a more innovation-friendly environment for DeFi, reducing compliance burdens and protecting user privacy in the crypto sector.\nThe post Trump signs resolution overturning IRS DeFi broker rule appeared first on Crypto Briefing.",
    "link": "https://cryptobriefing.com/trump-overturns-irs-defi-rule/",
    "timestamp": "2025-04-10T23:10:50Z"
  },
  {
    "title": "Trump signs resolution to repeal controversial IRS crypto rule finalized under Biden, lawmaker says",
    "description": "President Donald Trump signed a resolution to repeal a controversial crypto tax rule finalized toward the end of the Biden administration.",
    "link": "https://biztoc.com/x/903127837df41f45",
    "timestamp": "2025-04-10T23:10:49Z"
  },
  {
    "title": "For Some Reason, Trump's Education Secretary Can't Pronounce 'AI' Correctly",
    "description": "During a speech earlier this week, Linda McMahon kept referring to \"artificial intelligence\" as \"A1\" — like the steak sauce.",
    "link": "https://www.huffpost.com/entry/linda-mcmahon-a1-not-ai-like-the-steak-sauce_n_67f840b5e4b09493c8d8a355",
    "timestamp": "2025-04-10T23:10:18Z"
  },
  {
    "title": "26/11 Mumbai attacks mastermind Tahawwur Rana successfully extradited: NIA",
    "description": "NEW DELHI, April 10: Tahawwur Hussain Rana, a key accused in the 26/11 Mumbai terror attacks, was brought to India on Thursday after being “successfully extradited” from the US, the National Investigation Agency (NIA) said. The 64-year-old Canadian citizen of…",
    "link": "https://thehillstimes.in/national/26-11-mumbai-attacks-mastermind-tahawwur-rana-successfully-extradited-nia",
    "timestamp": "2025-04-10T23:10:00Z"
  },
  {
    "title": "Fox Guest Calls Trump Adviser ‘An Economic Terrorist’: ‘No Different Than the Islamic Regime in Iran’",
    "description": "A Fox Business guest described Trump trade adviser Peter Navarro as \"an economic terrorist\" and claimed he was \"no different than the Islamic regime in Iran.\"\nThe post Fox Guest Calls Trump Adviser ‘An Economic Terrorist’: ‘No Different Than the Islamic Regim…",
    "link": "https://www.mediaite.com/tv/fox-guest-calls-trump-adviser-an-economic-terrorist-no-different-than-the-islamic-regime-in-iran/",
    "timestamp": "2025-04-10T23:09:08Z"
  },
  {
    "title": "KeyCorp CEO talks tariff impact: 'The notion of reshoring is real'",
    "description": "KeyCorp CEO Chris Gorman told CNBC's Jim Cramer that the U.S.'s new tariffs will likely lead to reshoring.",
    "link": "https://www.cnbc.com/2025/04/10/keycorp-ceo-talks-tariff-impact-the-notion-of-reshoring-is-real.html",
    "timestamp": "2025-04-10T23:08:52Z"
  },
  {
    "title": "Rep. Ed Case backs GOP-led SAVE Act requiring proof to vote | Honolulu Star-Advertiser",
    "description": "WASHINGTON >> Despite a self-inflicted delay last week, House Republicans today passed legislation aimed at stopping noncitizens from voting in federal elections, a priority pursued by President Donald Trump.",
    "link": "https://www.staradvertiser.com/2025/04/10/breaking-news/rep-ed-case-backs-gop-led-save-act-requiring-proof-to-vote/",
    "timestamp": "2025-04-10T23:08:25Z"
  },
  {
    "title": "Mass. Congress members call for independent tariffs investigation",
    "description": "Sen. Elizabeth Warren and Rep. Katherine Clark are among the Congress members calling for the investigation, saying President Trump's tariffs may have been an attempt to manipulate markets.",
    "link": "https://www.wcvb.com/article/massachusetts-congress-members-seek-independent-tariffs-investigation/64447406",
    "timestamp": "2025-04-10T23:06:16Z"
  },
  {
    "title": "Trump recognises tariff 'transition difficulty'",
    "description": "There's continuing turmoil on Wall Street as uncertainty continues over US trade policy. The Dow Jones is down by more than five percent. The fall contrasts with the huge gains made on Wednesday in response to Donald Trump's suspension of many tariffs on coun…",
    "link": "https://www.bbc.co.uk/programmes/w172zss05prhlkf",
    "timestamp": "2025-04-10T23:04:00Z"
  },
  {
    "title": "RFK Jr. says HHS will determine the cause of autism by September",
    "description": "Health secretary Robert F",
    "link": "https://abcnews.go.com/Politics/wireStory/rfk-jr-hhs-determine-cause-autism-september-120693208",
    "timestamp": "2025-04-10T23:02:19Z"
  },
  {
    "title": "Starmer needs to publicly say Trump is wrong and give more reassurance over tariffs, Harman urges",
    "description": "Sir Keir Starmer needs to reassure the public more over tariffs - and tell them Donald Trump is wrong, Harriet Harman has said.",
    "link": "https://news.sky.com/story/starmer-needs-to-publicly-say-trump-is-wrong-and-give-more-reassurance-over-tariffs-harriet-harman-urges-13345932",
    "timestamp": "2025-04-10T23:01:00Z"
  },
  {
    "title": "U.S. stocks dove as Wall Street euphoria reverted to concern over U.S.-China trade war",
    "description": "The losses for U.S. stocks accelerated Thursday after the White House clarified that the United States will tax Chinese imports at 145 percent, not the 125 percent rate that President Donald Trump had written about in his posting on Truth Social Wednesday.",
    "link": "https://www.pbs.org/newshour/economy/u-s-stocks-dove-as-wall-street-euphoria-reverted-to-concern-over-u-s-china-trade-war",
    "timestamp": "2025-04-10T23:00:15Z"
  },
  {
    "title": "Former NBC host Chuck Todd admits media feared that covering Biden's decline would help Trump",
    "description": "Chuck Todd admitted the media was afraid to cover former President Biden's decline during his presidency because they believed it could benefit Trump.",
    "link": "https://www.foxnews.com/media/former-nbc-host-chuck-todd-admits-media-feared-covering-bidens-decline-would-help-trump",
    "timestamp": "2025-04-10T23:00:08Z"
  },
  {
    "title": "Watch: What's behind Trump's 90-day tariffs pause?",
    "description": "Watch: What's behind Trump's 90-day tariffs pause?\nUS President Donald Trump on Wednesday announced a 90-day pause on higher-band tariffs with the exception of China, imposing a 125% tariff on Chinese goods.\nThe White House has said the change of course was a…",
    "link": "https://biztoc.com/x/946baab6276c5f5a",
    "timestamp": "2025-04-10T23:00:02Z"
  },
  {
    "title": "‘Strong Asean fosters strong friendships’",
    "description": "KUALA LUMPUR: Asean will ensure its relationships with its neighbours, particularly China, Japan and South Korea, remain strong and formidable, says Prime Minister Datuk Seri Anwar Ibrahim. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/11/strong-asean-fosters-strong-friendships",
    "timestamp": "2025-04-10T23:00:00Z"
  },
  {
    "title": "INTERACTIVE: How countries are responding to US tariffs",
    "description": "From retaliation to concessions, here's how affected countries are reacting. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/11/interactive-how-countries-are-responding-to-us-tariffs",
    "timestamp": "2025-04-10T23:00:00Z"
  },
  {
    "title": "Anwar hopes for amicable solution to US tariffs",
    "description": "KUALA LUMPUR: Datuk Seri Anwar Ibrahim is hoping for an amicable solution with the United States on the issue of tariffs following the 90-day temporary reprieve announced by President Donald Trump. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2025/04/11/anwar-hopes-for-amicable-solution-to-us-tariffs",
    "timestamp": "2025-04-10T23:00:00Z"
  },
  {
    "title": "Elon Musk’s Power Wanes as the National Institutes of Health Bucks DOGE",
    "description": "An email sent to National Institutes of Health employees on Thursday instructed them to ignore DOGE’s demands.",
    "link": "https://www.thedailybeast.com/rfk-jrs-national-institutes-of-health-tells-elon-musks-doge-to-back-off/",
    "timestamp": "2025-04-10T22:59:25Z"
  },
  {
    "title": "Supreme Court says Trump admin must 'facilitate' release of man wrongly deported to El Salvador prison",
    "description": "The Trump administration conceded that Kilmar Abrego Garcia, who officials allege is a member of the MS-13 gang, was wrongly deported to El Salvador.",
    "link": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-admin-must-facilitate-release-kilmar-abrego-garcia-rcna200284",
    "timestamp": "2025-04-10T22:57:35Z"
  },
  {
    "title": "Eby tells government to cancel U.S. contracts- including magazine and software subscriptions - 'where viable'",
    "description": "Eby says Starlink has already been ruled out as possible internet provider.",
    "link": "https://www.cbc.ca/news/canada/british-columbia/eby-cancel-government-contracts-united-states-1.7507348",
    "timestamp": "2025-04-10T22:56:22Z"
  },
  {
    "title": "Tariff timeout provides hope",
    "description": "<p>President Donald Trump's order for a 90-day suspension of US reciprocal tariffs for countries that do not retaliate, including Thailand, has prompted a positive response from investors as global stocks surged in a relief rally.</p>",
    "link": "https://www.bangkokpost.com/business/general/3000842/tariff-timeout-provides-hope",
    "timestamp": "2025-04-10T22:54:00Z"
  },
  {
    "title": "Supreme Court says Trump must ‘facilitate’ return of man mistakenly deported to El Salvador | CNN Politics",
    "description": "The Supreme Court on Thursday required President Donald Trump’s administration to “facilitate” the return of a Maryland man mistakenly deported to El Salvador but stopped short of requiring the government to return him to the United States.",
    "link": "https://www.cnn.com/2025/04/10/politics/supreme-court-abrego-garcia/index.html",
    "timestamp": "2025-04-10T22:53:38Z"
  },
  {
    "title": "Trump is about to talk to Iran, Israel’s sworn enemy; here’s what you need to know",
    "description": "Israel has fought a shadow war against  Iran — assassinating nuclear scientists, infecting Iranian systems with an advanced virus and other forms of subterfuge.",
    "link": "https://www.jpost.com/middle-east/article-849808",
    "timestamp": "2025-04-10T22:51:43Z"
  },
  {
    "title": "Thai economy put at risk by surge in zero-dollar exports",
    "description": "<p>The government is being urged to address zero-dollar exports and investments from China, as they are expected to intensify due to the US tariff measures.</p>",
    "link": "https://www.bangkokpost.com/business/general/3000747/thai-economy-put-at-risk-by-surge-in-zero-dollar-exports",
    "timestamp": "2025-04-10T22:50:00Z"
  },
  {
    "title": "CBS Anchor Chokes Up While Reporting Live That NYC Helicopter Crash Killed 6: ‘Not Just Another Day’ | Video",
    "description": "\"This never, ever escapes me when you have to cover these types of stories,\" Kristine Johnson says\nThe post CBS Anchor Chokes Up While Reporting Live That NYC Helicopter Crash Killed 6: ‘Not Just Another Day’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/nyc-helicopter-crash-kills-6-emotional-cbs-anchor/",
    "timestamp": "2025-04-10T22:49:36Z"
  },
  {
    "title": "Watch: What's behind Trump's 90-day tariffs pause?",
    "description": "News of the US president's plan to halt higher-band taxes came as a surprise on Wednesday, but was it part of a plan?",
    "link": "https://www.bbc.com/news/videos/c045el20yw1o",
    "timestamp": "2025-04-10T22:49:21Z"
  },
  {
    "title": "US 30-year yields rise to the highs of the day",
    "description": "The driver of yesterday's policy reversal from Donald Trump -- at least in the popular retelling -- was due to rising long-dated yields. You can see the drop in 30s yesterday just before 13:50 when the announcement has been made.\nBut in the last hour, they ha…",
    "link": "https://biztoc.com/x/fd8ab02cec40ca50",
    "timestamp": "2025-04-10T22:48:49Z"
  },
  {
    "title": "The week in whoppers: CNN’s Jake Tapper denies his blatant bias, lefty editor praises Sen. Cory Booker’s showboating and more",
    "description": "CNN host Jake Tapper claimed that he is not part of \"the left\" — despite his consistent bias favoring the Democrats.",
    "link": "https://nypost.com/2025/04/10/opinion/the-week-in-whoppers-cnns-jake-tapper-denies-his-blatant-bias-lefty-editor-praises-sen-cory-bookers-showboating-and-more/",
    "timestamp": "2025-04-10T22:48:10Z"
  },
  {
    "title": "Musician says she was left shocked by ‘bizarre’ emails from acting Kennedy Center director Richard Grenell | CNN Politics",
    "description": "A heated email exchange between Richard Grenell, the interim head of the John F. Kennedy Center for the Performing Arts, and one of its artists left the musician “shocked” by what she called a “bizarre” interaction.",
    "link": "https://www.cnn.com/2025/04/10/politics/richard-grenell-kennedy-center-yasmin-williams-emails/index.html",
    "timestamp": "2025-04-10T22:47:10Z"
  },
  {
    "title": "China to limit number of American films imported from US amid tariff battle",
    "description": "China announced its decision to reduce the number of U.S. films shown in China amid the escalating trade war between the nations.",
    "link": "https://abc30.com/post/china-limit-number-american-films-imported-us-amid-tariff-battle/16153136/",
    "timestamp": "2025-04-10T22:45:03Z"
  },
  {
    "title": "House minority leader Jeffries says GOP wouldn’t have passed Trump budget agenda without ‘tragic’ Dem deaths",
    "description": "House Minority Leader Hakeem Jeffries chided that Republicans were only able to advance the blueprint for President Trump's \"big, beautiful\" agenda because of \"tragic\" Democratic deaths.",
    "link": "https://nypost.com/2025/04/10/us-news/house-minority-leader-jeffries-says-gop-wouldnt-have-passed-trump-budget-agenda-without-tragic-dem-deaths/",
    "timestamp": "2025-04-10T22:43:37Z"
  },
  {
    "title": "RFK Jr. says by September we will know what caused autism epidemic",
    "description": "Will announce results of unprecedented research initiative ordered by President Trump",
    "link": "https://www.wnd.com/2025/04/rfk-jr-says-by-september-we-will-know-what-caused-autism-epidemic/",
    "timestamp": "2025-04-10T22:42:29Z"
  },
  {
    "title": "Trump's new tariff on China is 'more of an embargo,' Jim Cramer says",
    "description": "CNBC's Jim Cramer on Thursday gave investors his read on what steep tariffs on China mean for the U.S. economy.",
    "link": "https://www.cnbc.com/2025/04/10/trumps-new-tariff-on-china-is-more-of-an-embargo-jim-cramer-says.html",
    "timestamp": "2025-04-10T22:41:33Z"
  },
  {
    "title": "Sycophantic Pam Bondi Falsely Tells Trump, ‘You Were Overwhelmingly Elected by the Biggest Majority’",
    "description": "President Donald Trump and his cabinet met at the White House on Thursday where, as is customary at Trump cabinet meetings, the attendees took turns praising the president.\nThe post Sycophantic Pam Bondi Falsely Tells Trump, ‘You Were Overwhelmingly Elected b…",
    "link": "https://www.mediaite.com/tv/sycophantic-pam-bondi-falsely-tells-trump-you-were-overwhelmingly-elected-by-the-biggest-majority/",
    "timestamp": "2025-04-10T22:41:01Z"
  },
  {
    "title": "Chicago tourism industry worried over possible impact of President Donald Trump's tariffs as foreigners avoid traveling to US",
    "description": "President Trump's escalating tariff war is affecting tourism in Chicago. International travel is big for the city, and Canadians and other visitors are now cancelling trips.",
    "link": "https://abc7chicago.com/post/chicago-tourism-industry-worried-possible-impact-president-donald-trumps-tariffs-foreigners-avoid-traveling-us/16154110/",
    "timestamp": "2025-04-10T22:40:36Z"
  },
  {
    "title": "Donald Trump is Wall Street’s Frankenstein, and the billionaires have lost control of their creation",
    "description": "Wall Street titans breathed life into the second presidency of Donald Trump by funding his re-election campaign.\nNow that Mr. Trump is back in the White House, however, America’s most-venerated gods of finance have lost control of their political creation.",
    "link": "https://biztoc.com/x/9953aa79ae3626b3",
    "timestamp": "2025-04-10T22:37:42Z"
  },
  {
    "title": "As Trump alienates allies with US tariffs, China is poised to exploit the gaps",
    "description": "Donald Trump is trying to to turn his global trade war into a one-on-one showdown with China. In doing so, he’s alienated some of the key U.S. partners who could boost America’s position in a fight between the world’s largest economies. Nearly three months in…",
    "link": "https://www.seattlepi.com/news/politics/article/as-trump-alienates-allies-with-us-tariffs-china-20269881.php",
    "timestamp": "2025-04-10T22:36:32Z"
  },
  {
    "title": "AP Week in Pictures",
    "description": "April 4 -10, 2025\n This photo gallery, curated by photo editor Anita Baca, highlights some of the most compelling images worldwide made or published by The Associated Press in the past week.\n ____\n Follow AP visual journalism:\n AP Images blog: http://apimages…",
    "link": "https://www.seattlepi.com/sports/article/ap-week-in-pictures-20269877.php",
    "timestamp": "2025-04-10T22:36:32Z"
  },
  {
    "title": "Maryland Delays Implementing Senseless, California-Style EV Mandate",
    "description": "Governor Wes Moore blames President Trump; however, American interest in EVs is running out of gas.\nThe post Maryland Delays Implementing Senseless, California-Style EV Mandate first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/04/maryland-delays-implementing-senseless-california-style-ev-mandate/",
    "timestamp": "2025-04-10T22:35:46Z"
  },
  {
    "title": "Trump says immigrants can return legally but they must self-deport now, floats potential 60-day deadline",
    "description": "President Donald Trump said Thursday there will soon be a deadline, likely \"60 days,\" by which illegal immigrants must be gone from the U.S., or they will not be allowed to try to reenter legally.",
    "link": "https://www.foxnews.com/politics/trump-says-immigrants-can-return-legally-must-self-deport-now-floats-potential-60-day-deadline",
    "timestamp": "2025-04-10T22:35:21Z"
  },
  {
    "title": "DOT chief warns against ‘fear mongering’ as second aircraft crash turns fatal",
    "description": "As U.S. Secretary of Transportation Sean Duffy took to X to criticize a Democratic congressman for raising concerns about cuts to the Federal Aviation Administration (FAA), following a minor collision between two planes on Thursday, news broke of a second, fa…",
    "link": "https://www.rawstory.com/sean-duffy-2671743416/",
    "timestamp": "2025-04-10T22:34:07Z"
  },
  {
    "title": "TikTok is laying off staff as it restructures part of its e-commerce business",
    "description": "TikTok is letting go of some governance and experience employees on its e-commerce team, which handles Shop marketplace safety.",
    "link": "https://www.businessinsider.com/tiktok-lays-off-staff-ecommerce-restructuring-2025-4",
    "timestamp": "2025-04-10T22:33:47Z"
  },
  {
    "title": "Scoop: Iran wants to explore interim nuclear deal in talks with U.S., sources say - Axios",
    "description": "Scoop: Iran wants to explore interim nuclear deal in talks with U.S., sources sayAxios Donald Trump’s oddly sensible move: seeking a deal with IranThe Economist As Trump Squares Off With Iran, the Middle East Is on EdgeWSJ Rubio says direct US-Iran nuclear ta…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176997197",
    "timestamp": "2025-04-10T22:33:19Z"
  },
  {
    "title": "RFK Jr. claims new research effort will find cause of ‘autism epidemic’ by September | CNN",
    "description": "The US Department of Health and Human Services has launched a “massive testing and research effort” involving hundreds of scientists worldwide that will determine “what has caused the autism epidemic” by September, Secretary Robert F. Kennedy Jr. said Thursda…",
    "link": "https://www.cnn.com/2025/04/10/health/kennedy-autism-causes/index.html",
    "timestamp": "2025-04-10T22:32:14Z"
  },
  {
    "title": "Dow Surges 2,900 Points, S&P 500 Posts BIGGEST GAIN Since 2008 Following Trump’s TARIFF REVERSAL",
    "description": "President Trump's tariff reversal announcement sparked a historic stock market comeback on Wednesday April 9th. As many countries move toward fairer trade agreements with the USA, China still remains in the crosshairs, targeted with a staggering 125% tariff r…",
    "link": "https://www.shtfplan.com/headline-news/dow-surges-2900-points-sp-500-posts-biggest-gain-since-2008-following-trumps-tariff-reversal",
    "timestamp": "2025-04-10T22:30:32Z"
  },
  {
    "title": "Trump: No more federal funding for ‘sanctuary’ cities and states",
    "description": "States and municipalities maintaining so-called sanctuary policies will lose all federal funding going forward, according to U.S. President Donald Trump.",
    "link": "https://www.bostonherald.com/2025/04/10/trump-no-more-federal-funding-for-sanctuary-cities-and-states/",
    "timestamp": "2025-04-10T22:30:31Z"
  },
  {
    "title": "Trump tariff pause leaves CEOs asking: What happens in 90 days?",
    "description": "Trump's tariff flip spurs a stock rally but sows deeper confusion for companies bracing for long-term trade fallout.",
    "link": "https://www.japantimes.co.jp/business/2025/04/11/companies/ceo-tariff-pause/",
    "timestamp": "2025-04-10T22:29:00Z"
  },
  {
    "title": "Iran warns it could expel UN nuclear inspectors ahead of US talks",
    "description": "The United States and Iran are set for talks on Iran's nuclear programme in Oman on Saturday.",
    "link": "https://www.aljazeera.com/news/2025/4/10/iran-warns-it-could-expel-un-nuclear-inspectors-ahead-of-us-talks",
    "timestamp": "2025-04-10T22:27:00Z"
  },
  {
    "title": "Judge will halt Trump administration from ending humanitarian parole for people from four countries",
    "description": "During the hearing, Talwani repeatedly questioned the government’s assertion for ending the program.",
    "link": "https://www.bostonherald.com/2025/04/10/immigration-parole/",
    "timestamp": "2025-04-10T22:23:53Z"
  },
  {
    "title": "US egg prices increase to record high, dashing hopes of cheap eggs by Easter",
    "description": "U.S. egg prices increased again last month to reach a new record-high of $6.23 per dozen despite President Donald Trump’s predictions, a drop in wholesale prices and no egg farms having bird flu outbreaks.... ....The farms that had fall outbreaks have been wo…",
    "link": "https://freerepublic.com/focus/f-chat/4310266/posts",
    "timestamp": "2025-04-10T22:23:37Z"
  },
  {
    "title": "Fox News Politics Newsletter: DOGE Dividends",
    "description": "Welcome to the Fox News Politics newsletter, with the latest updates on the Trump administration, Capitol Hill and more Fox News politics content.",
    "link": "https://www.foxnews.com/politics/fox-news-politics-newsletter-doge-dividens",
    "timestamp": "2025-04-10T22:21:02Z"
  },
  {
    "title": "WATCH: Nominee tells Senate committee feds were likely involved in J6 riots",
    "description": "'We’ve already identified that there were multiple confidential human informants'",
    "link": "https://www.wnd.com/2025/04/watch-nominee-tells-senate-committee-feds-were-likely-involved-in-j6-riots/",
    "timestamp": "2025-04-10T22:17:09Z"
  },
  {
    "title": "To end illegal immigration, don’t fix the asylum system — abolish it",
    "description": "Current asylum law was invented in 1951 to deal with the fallout of World War II. Today, it's a Cold War relic out of place in today’s very different world.",
    "link": "https://nypost.com/2025/04/10/opinion/dont-fix-the-us-asylum-system-shut-it-down-for-good/",
    "timestamp": "2025-04-10T22:16:21Z"
  },
  {
    "title": "When faces go virally wrong",
    "description": "These days, if it isn’t viral, it won’t make the cut for an artificial growth in user acquisition. That seems to be the playbook manual for OpenAI CEO Sam Altman, who decided to showcase his latest…",
    "link": "https://uxdesign.cc/when-faces-go-virally-wrong-5e4749487d48",
    "timestamp": "2025-04-10T22:16:15Z"
  },
  {
    "title": "Judge halts Trump plan to end humanitarian parole for people from 4 countries",
    "description": "The program for more than half-a-million Cubans, Haitians, Nicaraguans and Venezuelans was set to end this month.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_e08ecb38-171b-50ec-8003-cd9821eefaeb.html",
    "timestamp": "2025-04-10T22:15:00Z"
  },
  {
    "title": "Stock market today: Live updates",
    "description": "Investors remain concerned about the cumulative U.S. tariff rate on China, even after Trump's pause on tariffs for several other countries.",
    "link": "https://www.cnbc.com/2025/04/10/stock-market-today-live-updates.html",
    "timestamp": "2025-04-10T22:13:02Z"
  },
  {
    "title": "Trump’s obsession with bringing back manufacturing jobs is a mistake",
    "description": "President Trump's plan to make America a global manufacturing hub would create vast economic dislocation.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-manufacturing-jobs-economic-growth-rcna200701",
    "timestamp": "2025-04-10T22:12:46Z"
  },
  {
    "title": "ICE office on Rikers will only deal with criminal matters, Adams admin insists — as progressives threaten to sue",
    "description": "It’s a meltdown over ICE. Eric Adams’ top deputy mayor insisted Thursday that ICE won’t start deporting inmates en masse from a resurrected outpost on Rikers Island — as progressive City Council members threatened to sue Hizzoner for allegedly betraying sanct…",
    "link": "https://nypost.com/2025/04/10/us-news/city-hall-insists-reopened-rikers-ice-office-wont-do-civil-enforcement-as-progressives-threaten-to-sue-adams/",
    "timestamp": "2025-04-10T22:09:52Z"
  },
  {
    "title": "Iran, US raise stakes ahead of key talks in Oman",
    "description": "Washington and Tehran waged a war of words on April 10 ahead of key talks in Oman after U.S. President Donald Trump said military action was \"absolutely\" possible if the talks fail.",
    "link": "https://www.hurriyetdailynews.com/iran-us-raise-stakes-ahead-of-key-talks-in-oman-207928",
    "timestamp": "2025-04-10T22:09:43Z"
  },
  {
    "title": "Requirement that all non-citizens register with federal government allowed to go into effect",
    "description": "The requirement goes into effect Friday.",
    "link": "https://www.bostonherald.com/2025/04/10/immigration-registry-allowed/",
    "timestamp": "2025-04-10T22:09:40Z"
  },
  {
    "title": "House passes bill to require proof of citizenship to register to vote, drawing ire of voting rights groups",
    "description": "House passes bill to require proof of citizenship to register to vote, drawing ire of voting rights groupsgo.com",
    "link": "https://abcnews.go.com/Politics/house-passes-bill-require-proof-citizenship-register-vote/story?id=120691270",
    "timestamp": "2025-04-10T22:09:00Z"
  },
  {
    "title": "‘Slouching Towards Tyranny’: Conservative Outlet Issues Rare Editorial to Rebuke Trump Over ‘Pursuit of American Decline’",
    "description": "The Dispatch, issued a rare editorial rebuking President Donald Trump over his \"pursuit of American decline\" on Thursday afternoon.\nThe post ‘Slouching Towards Tyranny’: Conservative Outlet Issues Rare Editorial to Rebuke Trump Over ‘Pursuit of American Decli…",
    "link": "https://www.mediaite.com/news/slouching-towards-tyranny-conservative-outlet-issues-rare-editorial-to-rebuke-trump-over-pursuit-of-american-decline/",
    "timestamp": "2025-04-10T22:06:58Z"
  },
  {
    "title": "Penguin Causes Helicopter Crash In South Africa, And People Joke It's Tariff Revenge",
    "description": "The report did not explain why the penguin was on the chopper, but many people on social media jokingly assumed it was on a revenge mission against Trump's tariffs.",
    "link": "https://www.huffpost.com/entry/penguin-helicopter-crash-tariff-jokes_n_67f82b02e4b0c6da00113aab",
    "timestamp": "2025-04-10T22:06:30Z"
  },
  {
    "title": "RFK Jr. Promises To Identify Cause Of Autism By September — What To Know About His Claim",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. said in a televised presidential cabinet meeting Thursday that his agency will investigate and identify the cause of rising autism rates in the U.S. by September, though scientists have said a large pa…",
    "link": "https://freerepublic.com/focus/f-news/4310264/posts",
    "timestamp": "2025-04-10T22:04:41Z"
  },
  {
    "title": "Investors facing tariff turmoil: 'It's fastest finger first'",
    "description": "Investors facing tariff turmoil: 'It's fastest finger first'\nAs a former champion runner, Richard McDonald can move quickly.\nBut the speed of the market falls, triggered by the sweeping global tariffs Donald Trump announced last week, still kept him on his to…",
    "link": "https://biztoc.com/x/6b764a3abc9642ec",
    "timestamp": "2025-04-10T22:04:18Z"
  },
  {
    "title": "Patients Need Trump To Keep Medicines Exempt From Tariffs",
    "description": "The good news for patients is that pharmaceutical products are not subject to these so-called \"reciprocal tariffs\" -- for now.",
    "link": "https://www.ibtimes.com/patients-need-trump-keep-medicines-exempt-tariffs-3769634",
    "timestamp": "2025-04-10T22:03:16Z"
  },
  {
    "title": "Adin Ross Defends Trump’s Tariffs Following Stock Market Rebound: ‘Believe in Our President, Bro’",
    "description": "After reporting an \"eight figure\" loss following the announcement of Trump's tariffs, the 24-year-old streamer now praises the move.",
    "link": "https://www.complex.com/pop-culture/a/alex-ocho/adin-ross-defends-trumps-tariffs-stock-market-rebound-believe-our-president",
    "timestamp": "2025-04-10T22:02:27Z"
  },
  {
    "title": "Web Exclusive: Aliens release abducted ICE agents (Fiction)",
    "description": "By Reporter X An alien crew released four abducted Immigration and Customs Enforcement agents at Bolingbrook’s Clow UFO Base. In a holograph taken of their release, one agent yelled back at the crew, “You don’t abduct us. We abduct you!” An alien crew member …",
    "link": "https://freethoughtblogs.com/babbler/2025/04/10/web-exclusive-aliens-release-abducted-ice-agents-fiction/",
    "timestamp": "2025-04-10T22:01:38Z"
  },
  {
    "title": "The U.S. and Iran Prepare for Nuclear Talks",
    "description": "U.S. President Donald Trump has hinted at possible military actions if diplomacy fails.",
    "link": "http://foreignpolicy.com/2025/04/10/us-iran-nuclear-talks-trump/",
    "timestamp": "2025-04-10T22:00:22Z"
  },
  {
    "title": "Iraq’s 7 Million bpd Oil Production Goal Draws Swift Response from Chinese Firms",
    "description": "The recent reiteration by Iraq Oil Ministry of a 7 million barrels per day (bpd) oil production target within the next five years has spurred activity among Chinese firms that continue to dominate the country’s oil and gas sector. As it stands, more than a th…",
    "link": "https://oilprice.com/Energy/Crude-Oil/Iraqs-7-Million-bpd-Oil-Production-Goal-Draws-Swift-Response-from-Chinese-Firms.html",
    "timestamp": "2025-04-10T22:00:00Z"
  },
  {
    "title": "National intelligence head says MLK and RFK assassination records will soon be public",
    "description": "The documents had been in boxes in storage for decades, Gabbard said.",
    "link": "https://www.bostonherald.com/2025/04/10/assassination-files/",
    "timestamp": "2025-04-10T21:59:45Z"
  },
  {
    "title": "Japan, US stocks drop on lingering tariff worries, a day after relief rally",
    "description": "Major stock indexes and the US dollar dropped on Thursday (Apr 10), with the S&P 500 ending down more than 3 percent as investors remained skittish, a day after US President D",
    "link": "https://www.channelnewsasia.com/world/japan-us-stocks-drop-lingering-tariff-worries-day-after-relief-rally-5058506",
    "timestamp": "2025-04-10T21:56:00Z"
  },
  {
    "title": "Donald Trump Sketches Plan to Deport Many and Recall Some Migrants for Farm, Hotel Jobs",
    "description": "Donald Trump used a cabinet meeting to outline plans to recall some of the illegals being deported from jobs in the farm and hospitality sectors.\nThe post Donald Trump Sketches Plan to Deport Many and Recall Some Migrants for Farm, Hotel Jobs appeared first o…",
    "link": "https://www.breitbart.com/economy/2025/04/10/donald-trump-sketches-plan-deport-many-recall-some-migrants-farm-hotel-jobs/",
    "timestamp": "2025-04-10T21:54:02Z"
  },
  {
    "title": "Progressive Case for Tariffs Amid Fallout From Trump's Policies",
    "description": "Democrats mostly oppose President Donald Trump's tariffs, but some progressives see value in strategic tariffs.",
    "link": "https://www.newsweek.com/progressive-case-tariffs-democrats-donald-trump-2058299",
    "timestamp": "2025-04-10T21:53:55Z"
  },
  {
    "title": "Trump’s Orwellian rewrite of 2020",
    "description": "President Donald Trump answers a reporters question during a meeting with Israeli Prime Minister Benjamin at the White House on April 7, 2025. | Kevin Dietsch/Getty Images\nThis story appeared in The Logoff, a daily newsletter that helps you stay informed abou…",
    "link": "https://biztoc.com/x/d111d52c34c1b5f6",
    "timestamp": "2025-04-10T21:52:57Z"
  },
  {
    "title": "Tim Walz BOOED OFF STAGE as Elon Musk Protests BACKFIRE in HILARIOUS Payback",
    "description": "Minnesota Governor Tim Walz gets booed and heckled off stage by a group of veterans as his Elon Musk Protests backfire in a hilarious moment of payback. While Walz has been trying to launch his 2028 campaign by staging townhalls and protests against Donald Tr…",
    "link": "https://freerepublic.com/focus/f-chat/4310261/posts",
    "timestamp": "2025-04-10T21:52:54Z"
  },
  {
    "title": "Southern Baptist ethnic leaders warn religious liberty at risk from Trump immigration enforcement",
    "description": "Donald Trump’s anti-immigrant crackdown is causing consternation among some members of the conservative Southern Baptist Convention, as diverse faith leaders are pleading with his administration for mercy.",
    "link": "https://biztoc.com/x/8ca8bb0747d637dc",
    "timestamp": "2025-04-10T21:52:52Z"
  },
  {
    "title": "Trump Boosts Tariffs on Low-Value Packages Again After China Retaliates",
    "description": "President Donald Trump increased the previously announced tariffs on low-value packages from China after that country retaliated against the U.S. by boosting its tariffs on U.S. goods.\nIn an executive order issued Wednesday (April 9), Trump increased the tari…",
    "link": "https://biztoc.com/x/8d7ca8bd819f0435",
    "timestamp": "2025-04-10T21:52:46Z"
  },
  {
    "title": "JD Vance and Gen Z: Why the VP Is so Relatable to Us",
    "description": "For a new vice president, JD Vance is sure making a lot of news.  But he’s getting media coverage that some leaders wouldn’t be thrilled... Read More\nThe post JD Vance and Gen Z: Why the VP Is so Relatable to Us appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/04/10/vance-gen-why-vp-is-relatable/",
    "timestamp": "2025-04-10T21:50:34Z"
  },
  {
    "title": "Dave Portnoy Says He Would Vote Democrat If Stock Market Keeps Declining",
    "description": "\"I vote on the people running, how I think they speak to me, the issues that are important to me. I will vote how I feel is the best interest of what I believe in.\"",
    "link": "https://www.huffpost.com/entry/dave-portnoy-would-vote-democrat-if-stock-market-keeps-declining_n_67f810e1e4b0591065870811",
    "timestamp": "2025-04-10T21:50:02Z"
  },
  {
    "title": "Egg prices increase to record high despite Trump's predictions and bird flu outbreak slowing",
    "description": "U.S. egg prices increased again last month to reach a new record-high of $6.23 per dozen despite President Donald Trump’s predictions, a drop in wholesale prices and no egg farms having bird flu outbreaks. The increase reported Thursday in the Consumer Price …",
    "link": "https://japantoday.com/category/business/egg-prices-increase-to-record-high-despite-trump%27s-predictions-and-bird-flu-outbreak-slowing",
    "timestamp": "2025-04-10T21:49:56Z"
  },
  {
    "title": "TikTok fuels ByteDance revenue as US ban looms: report",
    "description": "TikTok's international revenue boomed last year as China-based parent ByteDance faced a deadline to sell the app or have it banned in the United States, The Information reported on Thursday. The tech news outlet cited an unnamed person with knowledge of ByteD…",
    "link": "https://japantoday.com/category/tech/tiktok-fuels-bytedance-revenue-as-us-ban-looms-report",
    "timestamp": "2025-04-10T21:48:47Z"
  },
  {
    "title": "Trump floats plan for undocumented farm and hotel workers to work legally in the U.S.",
    "description": "Trump said in a Cabinet meeting that workers vouched for by employers would \"go out\"  and \"they’re going to come back as legal workers.”",
    "link": "https://www.nbcnews.com/news/latino/trump-farmworkers-hotel-workers-undocumented-legal-rcna200722",
    "timestamp": "2025-04-10T21:47:25Z"
  }
]