[
  {
    "title": "Why I Can’t Celebrate Pride This Year",
    "description": "If you’ve read more than a few of my rants, then you are probably already painfully aware that I am a Queer person and that I take this identity pretty seriously, some of you may even be forgiven for saying annoyingly so. However, you have to understand that …",
    "link": "https://www.counterpunch.org/2025/06/20/why-i-cant-celebrate-pride-this-year/",
    "timestamp": "2025-06-20T04:50:25Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wect.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T04:50:24Z"
  },
  {
    "title": "A U.S. attack on Iran would show the limits of China's power",
    "description": "Despite China's brokered peace deal between Iran and Saudi Arabia, its influence is limited as potential US-Iran conflict looms. China's economic interests, particularly oil imports, are threatened, but military intervention is unlikely. China prioritizes cit…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/a-u-s-attack-on-iran-would-show-the-limits-of-chinas-power/articleshow/121966688.cms",
    "timestamp": "2025-06-20T04:47:40Z"
  },
  {
    "title": "'Laziest Man In The World': Trump Ripped Over 'Pathetic' Complaint About Holidays",
    "description": "The president's critics were standing by with a reality check.",
    "link": "https://www.huffpost.com/entry/trump-holidays-complaint-reaction_n_6854d116e4b0af4d580ea4cb",
    "timestamp": "2025-06-20T04:46:14Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to LA",
    "description": "US News: LOS ANGELES: An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following.",
    "link": "https://timesofindia.indiatimes.com/world/us/appeals-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-la/articleshow/121966311.cms",
    "timestamp": "2025-06-20T04:45:26Z"
  },
  {
    "title": "Ninth Circuit Rules Unanimously Against Newsom: Trump Still Controls National Guard",
    "description": "A three-judge panel of the U.S. Court of Appeals for the Ninth Circuit ruled unanimously Thursday that President Donald Trump can federalize the California National Guard, rejecting Gov. Gavin Newsom's claims.\nThe post Ninth Circuit Rules Unanimously Against …",
    "link": "https://www.breitbart.com/politics/2025/06/19/ninth-circuit-rules-unanimously-against-newsom-trump-controls-national-guard/",
    "timestamp": "2025-06-20T04:44:02Z"
  },
  {
    "title": "Asian shares are mixed and oil gains as world waits to see if US will join Israel's war against Iran",
    "description": "Crude oil prices have climbed and Asian shares are trading mixed as markets await more clarity on whether or not the U.S. will join Israel’s war against Iran",
    "link": "https://abcnews.go.com/US/wireStory/asian-shares-mixed-oil-gains-world-waits-us-123029165",
    "timestamp": "2025-06-20T04:38:29Z"
  },
  {
    "title": "Commerce Ministry to meet stakeholders to assess impact of Iran-Israel conflict on India's trade",
    "description": "The Commerce Ministry will meet with stakeholders to discuss the Iran-Israel conflict's impact on India's foreign trade. The meeting aims to address concerns about rising freight rates and potential disruptions to shipping routes like the Strait of Hormuz and…",
    "link": "https://economictimes.indiatimes.com/news/india/commerce-ministry-to-meet-stakeholders-to-assess-impact-of-iran-israel-conflict-on-indias-trade/articleshow/121966523.cms",
    "timestamp": "2025-06-20T04:35:41Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.fox5vegas.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T04:33:12Z"
  },
  {
    "title": "Trump vs Newsom: federal court rules US President has control over California National Guard in LA protest response",
    "description": "A federal appeals court upheld President Trump's authority over the California National Guard, reversing a lower court ruling. This allows thousands of troops to remain under federal command in Los Angeles due to immigration enforcement protests. Governor New…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-vs-newsom-federal-court-rules-us-president-has-control-over-california-national-guard-in-la-protest-response/articleshow/121966446.cms",
    "timestamp": "2025-06-20T04:32:11Z"
  },
  {
    "title": "Eighth day of the Israel-Iran conflict: Anxiety over Trump’s decisions, mobility in the EU to find a diplomatic solution",
    "description": "Israeli Prime Minister pledges that Iran will \"pay a heavy price\" for the attack on a hospital in Beersheva - Iran also threatens to close the Strait of Hormuz - Trump to decide on US involvement in the coming weeks\nThe post Eighth day of the Israel-Iran conf…",
    "link": "https://en.protothema.gr/2025/06/20/eighth-day-of-the-israel-iran-conflict-anxiety-over-trumps-decisions-mobility-in-the-eu-to-find-a-diplomatic-solution/",
    "timestamp": "2025-06-20T04:29:30Z"
  },
  {
    "title": "Rupee rises 13 paise to 86.60 against US dollar in early trade",
    "description": "The Indian Rupee saw gains against the US dollar in early trading on Friday. This rise is attributed to lower global crude oil prices and a weaker US dollar. On Thursday, the Rupee had fallen to a two-month low. Market experts suggest exporters should sell do…",
    "link": "https://economictimes.indiatimes.com/markets/forex/rupee-rises-13-paise-to-86-60-against-us-dollar-in-early-trade/articleshow/121966361.cms",
    "timestamp": "2025-06-20T04:27:59Z"
  },
  {
    "title": "I grew up on American food. Trust me, it’s the last thing Europe needs | Alexander Hurst",
    "description": "The EU is under pressure to strike a trade deal with Trump, but an influx of mass-produced, low-quality food must be off the table\nAll over European media, the take seems to be similar – that the EU is “under pressure” to conclude some sort of deal with the U…",
    "link": "https://biztoc.com/x/620cfdfc5ebc7405",
    "timestamp": "2025-06-20T04:24:31Z"
  },
  {
    "title": "Arizona Senate Passes Bitcoin Reserve Bill for Seized Crypto, Heads to House for Debate",
    "description": "The bill seeks to establish a state-managed digital asset fund using crypto seized through criminal forfeiture.",
    "link": "https://decrypt.co/326175/arizona-senate-passes-bitcoin-reserve-bill-for-seized-crypto-heads-to-house-for-debate",
    "timestamp": "2025-06-20T04:17:28Z"
  },
  {
    "title": "Cormac Ó hEadhra is a smart guy but he asks some pretty dumb questions",
    "description": "Radio: The RTÉ Drivetime host shouldn’t be startled by the number of people who prefer to avoid the news",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/06/20/cormac-o-headhra-can-ask-some-pretty-dumb-sounding-questions-for-a-smart-guy/",
    "timestamp": "2025-06-20T04:16:00Z"
  },
  {
    "title": "Euro-visions: A Larger Global Role for the Euro?",
    "description": "Peter Bofinger is professor of economics at Würzburg University and a former member of the German Council of Economic Experts",
    "link": "https://www.ipsnews.net/2025/06/euro-visions-larger-global-role-euro/",
    "timestamp": "2025-06-20T04:15:52Z"
  },
  {
    "title": "Uncertainty clouds MCC in Nepal despite US Embassy’s reassuring statement",
    "description": "KATHMANDU: A recent statement by the U.S. Embassy in Nepal regarding the Millennium Challenge Corporation (MCC) Compact has triggered a wave of speculation and optimism, but key officials remain unsure about the future of the grant program amid funding cuts a…",
    "link": "https://english.khabarhub.com/2025/20/478893/",
    "timestamp": "2025-06-20T04:15:45Z"
  },
  {
    "title": "Democrats in Virginia have a hefty fundraising advantage heading into November general election",
    "description": "Democrats in Virginia have built up a hefty fundraising advantage for their effort to reclaim the governor's mansion in November's general election",
    "link": "https://abcnews.go.com/US/wireStory/democrats-virginia-hefty-fundraising-advantage-heading-november-general-123028891",
    "timestamp": "2025-06-20T04:14:47Z"
  },
  {
    "title": "US debate over whether to bomb Iran stirs memories of Iraq war",
    "description": "Shadow of intelligence debacle two decades ago hangs over Donald Trump as he considers joining Israeli attacks",
    "link": "https://biztoc.com/x/6c39a22a6eb351d9",
    "timestamp": "2025-06-20T04:13:44Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids. The decision halts a ruling from a lower court judge who found Trump acted illegally whe…",
    "link": "https://freerepublic.com/focus/f-news/4324177/posts",
    "timestamp": "2025-06-20T04:09:27Z"
  },
  {
    "title": "Israel’s Attacks have Exposed Iran’s Weaknesses, but it is in Little Danger of Collapsing",
    "description": "By Farhang Morady, University of Westminster The Israeli prime minister, Benjamin Netanyahu, has said that his country’s campaign in Iran “could certainly” lead to regime change. In an interview with Fox News on June 15, he called the government in Tehran “ve…",
    "link": "https://www.juancole.com/2025/06/israels-weaknesses-collapsing.html",
    "timestamp": "2025-06-20T04:06:23Z"
  },
  {
    "title": "Donald Trump delays decision on Iran strikes as Keir Starmer calls for restraint",
    "description": "Donald Trump has delayed a decision on whether to join Israeli attacks on Iran as Sir Keir Starmer continues to urge restraint in the Middle East. The US president said he was still hopeful of reaching a negotiated solution with Tehran and would decide on mil…",
    "link": "https://freerepublic.com/focus/f-news/4324176/posts",
    "timestamp": "2025-06-20T04:05:32Z"
  },
  {
    "title": "Donald Trump needs to make a huge decision. Why delay it two weeks?",
    "description": "With Donald Trump delaying his decision on possible US military action in the Middle East, what is he playing at?",
    "link": "https://www.abc.net.au/news/2025-06-20/donald-trump-iran-israel-decision-explainer/105440968",
    "timestamp": "2025-06-20T04:05:12Z"
  },
  {
    "title": "Trump can’t Stop the Green Energy Revolution any More than Horses could Stop the Automobile",
    "description": "( Tomdispatch.com ) - He lived over 1,000 years ago, but King Canute’s life still has some important lessons for our own time. After conquering England, Denmark, Norway, and part of Sweden, he forged a vast North Sea empire that made him, by the year 1030, th…",
    "link": "https://www.juancole.com/2025/06/energy-revolution-automobile.html",
    "timestamp": "2025-06-20T04:04:01Z"
  },
  {
    "title": "Trump-Connected Company Pulls Back From Family Crypto Business",
    "description": "President Donald Trump-linked company DT Marks DeFi LLC has reduced its stake in World Liberty Financial, a cryptocurrency project backed by the U.S. first family.\nWhat Happened: According to World Liberty’s website, DT Marks DeFi holds a 40% equity interest …",
    "link": "https://biztoc.com/x/63e9e5cf54672087",
    "timestamp": "2025-06-20T04:01:58Z"
  },
  {
    "title": "The First Great Mistake",
    "description": "For any of you out there hoping against hope that Israel might stop the bombing of Iran, forget about it. Israel, along with Uncle Sam, who now wears a blondish haircut, will not stop until there is regime change in Iran. As oil prices go through the roof, Is…",
    "link": "https://www.lewrockwell.com/2025/06/taki-theodoracopulos/the-first-great-mistake/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "How America Goes to War: Iraq, Ukraine and Now Iran",
    "description": "After promising during the 2024 election to stop the USA’s ‘forever wars’ in the 21st century, in less than six months in office Donald Trump is about to start another ‘forever’ war with Iran. There’ll be no prior vote in Congress, as required by the US Const…",
    "link": "https://www.lewrockwell.com/2025/06/no_author/how-america-goes-to-war-iraq-ukraine-and-now-iran/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "America’s Choice: National Divorce or Civil War",
    "description": "The current political structure of the United States is not viable long-term. Put simply, there are far too many differences existing among the numerous varieties of peoples who make up America to have them all ruled from one central authority. The same scena…",
    "link": "https://www.lewrockwell.com/2025/06/no_author/americas-choice-national-divorce-or-civil-war/",
    "timestamp": "2025-06-20T04:01:00Z"
  },
  {
    "title": "Israel’s Attack on Iran: The Violent New World Being Born Is Going To Horrify You",
    "description": "Western politicians and media are tying themselves up in knots trying to spin the impossible: presenting Israel’s unmistakable war of aggression against Iran as some kind of “defensive” move. This time there was no rationalising pretext, as there was for Isra…",
    "link": "https://original.antiwar.com/cook/2025/06/19/israels-attack-on-iran-the-violent-new-world-being-born-is-going-to-horrify-you/",
    "timestamp": "2025-06-20T04:00:59Z"
  },
  {
    "title": "Sensex gains over 250 pts, Nifty above 24,850 as bank, auto stocks lead rally",
    "description": "Indian stock markets saw a positive start on Friday. The BSE Sensex and Nifty50 both showed gains in early trading. Banking and auto sector stocks are performing well. Bajaj Finserv and Mahindra & Mahindra are among the top gainers. However, some stocks like …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-gains-over-250-pts-nifty-above-24850-as-bank-auto-stocks-lead-rally/articleshow/121965918.cms",
    "timestamp": "2025-06-20T04:00:05Z"
  },
  {
    "title": "Destroying Iran’s Nuclear Capability: Once Again, Israel, Thank You",
    "description": "In attacking numerous military targets in Iran on June 13, 2025 as part of its Operation Rising Lion, Israel made good on a 1981 policy announced by then Prime Minister Menachem Begin:\r\n\r\n\r\n‘We shall defend our people with all the means at our ...",
    "link": "https://www.americanthinker.com/articles/2025/06/destroying_iran_s_nuclear_capability_once_again_israel_thank_you.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "The Elites Lose Narrative Control",
    "description": "The state is losing control over the dominant narratives in the competition of prevailing stories. Its apparatus of power responds predictably invasively and reveals its hostility toward dissenting opinions.\r\n\r\nThe German Bundestag’s Vice Presi...",
    "link": "https://www.americanthinker.com/articles/2025/06/the_elites_lose_narrative_control.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Ayatollah Biden’s regime is already changing",
    "description": "They say generals always want to fight the last war. So too, a lot of pundits always want to protest the last war. Tucker Carlson was one of many journalists who supported the Iraq War but is now an isolationist, unlike his buddies Pat Buch...",
    "link": "https://www.americanthinker.com/blog/2025/06/ayatollah_biden_s_regime_is_already_changing.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Saving Persia from Iran",
    "description": "“I have never advocated war except as a means of peace.” — Ulysses S. Grant\r\n\r\nI’ve been following U.S. naval ship movements in the Mediterranean, Red Sea, and Persian Gulf, the bomber build-up at Diego Garcia, and USAF logist...",
    "link": "https://www.americanthinker.com/blog/2025/06/saving_persia_from_iran.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Powell and the Fed are wrong",
    "description": "The Fed chairman, Jerome Powell, announced again that the Fed is going to hold rates where they are, marking the third (or fourth) time that the chairman has stood pat on interest rates since Donald Trump’s inauguration.\r\n\r\nTrump responded,&nbs...",
    "link": "https://www.americanthinker.com/blog/2025/06/powell_and_the_fed_are_wrong.html",
    "timestamp": "2025-06-20T04:00:00Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wtvm.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T03:56:53Z"
  },
  {
    "title": "Trump Keeps Control of California National Guard After New Appeals Court Ruling",
    "description": "But the legal battle with California Governor Gavin Newsom continues Friday in a San Francisco district court room\nThe post Trump Keeps Control of California National Guard After New Appeals Court Ruling appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-keeps-control-of-california-national-guard-appeals-court-rules/",
    "timestamp": "2025-06-20T03:54:01Z"
  },
  {
    "title": "Trump allowed to keep using national guard in LA for now",
    "description": "Thursday’s decision isn’t the final ruling on the matter and is likely to be immediately challenged.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/crime-legal/national-guard-la-ruling/",
    "timestamp": "2025-06-20T03:52:00Z"
  },
  {
    "title": "Trump Tax Bill Bails Out Private Equity's Layoff Scheme (Luke Goldstein/The Lever)",
    "description": "Luke Goldstein / The Lever:\nTrump Tax Bill Bails Out Private Equity's Layoff Scheme  —  Lawmakers quietly added a line that effectively subsidizes Wall Street buying up companies, slashing wages, closing factories, and firing workers.  —  Congressional lawmak…",
    "link": "https://www.memeorandum.com/250619/p132",
    "timestamp": "2025-06-20T03:50:00Z"
  },
  {
    "title": "Japan Won’t Fixate on July 9 in US Trade Talks, Akazawa Says",
    "description": "Japan won’t fixate on the looming date for so-called reciprocal tariffs to go back to higher levels, Tokyo’s top trade negotiator said, signaling that the Asian nation stands ready for the possibility that talks will drag on.",
    "link": "https://financialpost.com/pmn/business-pmn/japan-wont-fixate-on-july-9-in-us-trade-talks-akazawa-says",
    "timestamp": "2025-06-20T03:47:38Z"
  },
  {
    "title": "US court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "A US court allowed Donald Trump to keep control of California's National Guard. This happened while Governor Gavin Newsom is challenging Trump's use of troops in Los Angeles. The court paused a ruling that said Trump's action was illegal. Newsom argued Trump …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-los-angeles/articleshow/121965729.cms",
    "timestamp": "2025-06-20T03:44:47Z"
  },
  {
    "title": "White House scores temporary win in clash with Gavin Newsom over Guard use",
    "description": "In a win for the White House, a federal appeals court on Thursday ruled President Donald Trump can continue using California National Guard troops to respond to protests in Los Angeles while a legal challenge plays out, Bloomberg reported.The unanimous three-…",
    "link": "https://www.rawstory.com/trump-los-angeles-guard/",
    "timestamp": "2025-06-20T03:42:06Z"
  },
  {
    "title": "US court allows Trump to keep control of National Guard in LA",
    "description": "The 9th United States Circuit Court of Appeals allowed United States President Donald Trump to retain control of National Guard troops he deployed to Los Angeles in response to anti-Immigration and Cu...",
    "link": "https://biztoc.com/x/e606d0ecd1e34244",
    "timestamp": "2025-06-20T03:39:33Z"
  },
  {
    "title": "Appeals court says Trump can keep control of California National Guard troops",
    "description": "President Donald Trump is within his rights to deploy the California National Guard amid protests against federal law enforcement over immigration raids, an appeals court ruled Thursday night.",
    "link": "https://biztoc.com/x/003adee6e4a00cf2",
    "timestamp": "2025-06-20T03:39:17Z"
  },
  {
    "title": "Temu’s US sales on a losing streak on Tariffs, ad spending cut",
    "description": "Temu and Chinese e—commerce shopping platforms such as Shein had for years relied on a tariff exemption on small parcels to ship cheap clothing and household goods to American consumers duty-free",
    "link": "https://www.bloomberg.com/news/articles/2025-06-20/temu-s-us-sales-on-a-losing-streak-on-tariffs-ad-spending-cut",
    "timestamp": "2025-06-20T03:38:30Z"
  },
  {
    "title": "Trump can keep control of National Guard troops deployed to Los Angeles, appeals court rules",
    "description": "The decision halts a ruling from a lower court judge who found Trump acted illegally when he activated the soldiers over opposition from California Gov. Gavin Newsom.",
    "link": "https://nypost.com/2025/06/19/us-news/trump-can-keep-control-of-national-guard-troops-deployed-to-los-angeles-appeals-court-rules/",
    "timestamp": "2025-06-20T03:35:11Z"
  },
  {
    "title": "Chris Hayes Explains Why Trump’s Immigration Policies Are ‘an Assault on the Idea of America Itself’ | Video",
    "description": "The MSNBC host looks at what he describes as the administration's \"papers please\" undermining of freedom of movement in the U.S.\nThe post Chris Hayes Explains Why Trump’s Immigration Policies Are ‘an Assault on the Idea of America Itself’ | Video appeared fir…",
    "link": "https://www.thewrap.com/chris-hayes-trump-making-assault-on-the-idea-of-america-msnbc/",
    "timestamp": "2025-06-20T03:32:25Z"
  },
  {
    "title": "British Foreign Secretary: There’s a two-week window for Iran diplomacy",
    "description": "British Foreign Secretary David Lammy meets Secretary of State Rubio to discuss Iran, stresses there is a \"window\" of two weeks to prevent wider conflict and ensure Iran never acquires nuclear weapons.",
    "link": "https://www.israelnationalnews.com/news/410346",
    "timestamp": "2025-06-20T03:32:16Z"
  },
  {
    "title": "Iran talks with Europeans set for Friday; White House sees ‘substantial chance’ for renewed negotiations",
    "description": "Leavitt says US and Iranian officials have engaged in six rounds of direct and indirect negotiations so far After a week of intense speculation about whether President Donald Trump will launch a strike on Iran in support of Israel’s efforts to eliminate the c…",
    "link": "https://freerepublic.com/focus/f-news/4324171/posts",
    "timestamp": "2025-06-20T03:31:32Z"
  },
  {
    "title": "US court lets Trump retain control of California National Guard for now",
    "description": "WASHINGTON: A US appeals court let Donald Trump on Thursday (Jun 19) retain control over California's National Guard while the state's Democratic governor proceeds with a lawsuit challenging",
    "link": "https://www.channelnewsasia.com/world/us-court-lets-trump-retain-control-california-national-guard-now-5193276",
    "timestamp": "2025-06-20T03:30:50Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "The case could have wider implications on the the deployment of soldiers within the U.S.",
    "link": "https://www.bostonherald.com/2025/06/19/immigration-california-lawsuit-appeals-court/",
    "timestamp": "2025-06-20T03:30:44Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycottwesternmassnews.com",
    "link": "https://www.westernmassnews.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T03:30:34Z"
  },
  {
    "title": "Exclusive-Global trading giants step up India presence, fuelling talent rush, exchange upgrades",
    "description": "MUMBAI (Reuters) -Half a dozen global trading giants, from Citadel Securities and IMC Trading to Millennium and Optiver, are ratcheting up their presence in ...",
    "link": "https://finance.yahoo.com/news/exclusive-global-trading-giants-step-032840779.html",
    "timestamp": "2025-06-20T03:28:40Z"
  },
  {
    "title": "Appeals Court Hands Trump A Win On National Guard's LA Deployment",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nA United States appeals court on Thursday unanimously blocked a lower court ruling that put California Governor Gavin Newsom back in control of National Guard troops that President Donald Trump has deployed to…",
    "link": "https://biztoc.com/x/dea89b8220ba37cf",
    "timestamp": "2025-06-20T03:28:11Z"
  },
  {
    "title": "Who are Iran's allies? And will any help if the US joins Israel's attacks?",
    "description": "Iran has spent decades building its \"Axis of Resistance\" across the Middle East, but its allies have been largely silent since Israel launched a series of attacks last week.",
    "link": "https://www.abc.net.au/news/2025-06-20/key-alliances-in-the-iran-israel-conflict-explained/105434908",
    "timestamp": "2025-06-20T03:27:44Z"
  },
  {
    "title": "South Korea’s Record Surplus With US Adds Strain to Tariff Talks",
    "description": "South Korea’s current account surplus with the US surged to a record high last year, highlighting the challenge President Lee Jae Myung faces as he seeks to secure a trade deal with Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/south-koreas-record-surplus-with-us-adds-strain-to-tariff-talks",
    "timestamp": "2025-06-20T03:27:18Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "An appeals court is allowing President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids",
    "link": "https://abcnews.go.com/US/wireStory/appeals-court-lets-trump-control-national-guard-troops-123027652",
    "timestamp": "2025-06-20T03:26:27Z"
  },
  {
    "title": "Apple’s push in India continues: Foxconn to start making iPhone casings in the country",
    "description": "Foxconn is taking another step in cementing its rolerole in Apple’s Indian manufacturing strategy. After years of focusing mainly on iPhone assembly, the Taiwanese contract manufacturing giant is now preparing to build iPhone casings locally for the first tim…",
    "link": "https://9to5mac.com/2025/06/19/foxconn-to-start-making-iphone-casings-in-india/",
    "timestamp": "2025-06-20T03:26:13Z"
  },
  {
    "title": "Appeals Court Hands Trump A Win On National Guard's LA Deployment",
    "description": "The three-judge appeals court panel overturned a lower court order that gave control of the National Guard back to Gavin Newsom.",
    "link": "https://www.newsweek.com/appeals-court-trump-win-national-guard-los-angeles-2088196",
    "timestamp": "2025-06-20T03:25:46Z"
  },
  {
    "title": "In Recent Polling, Latino Trump Voters Reveal the Border Security vs. Deportation Divide",
    "description": "Latino voters who supported Donald Trump in 2024 largely back his border security efforts but show clear divisions over deportation policies—providing real-world evidence of a phenomenon that's been hiding in plain sight across recent polling data.The focus g…",
    "link": "https://freerepublic.com/focus/f-news/4324169/posts",
    "timestamp": "2025-06-20T03:24:55Z"
  },
  {
    "title": "Biden shares message of unity and action during Juneteenth celebration at historic Black church | CNN Politics",
    "description": "Former President Joe Biden celebrated Juneteenth on Thursday at a historic Black church in Texas, calling for Americans to come together to push the country forward.",
    "link": "https://www.cnn.com/2025/06/19/politics/joe-biden-juneteenth",
    "timestamp": "2025-06-20T03:24:29Z"
  },
  {
    "title": "Trump Wins Continued Control Of California National Guard Over Newsom, For Now",
    "description": "Three federal appeals court judges have ruled that Donald Trump can continue to be in charge of the California National Guard over Gavin Newsom. However, with a preliminary injunction hearing set for Friday morning in San Francisco before the lower court judg…",
    "link": "http://deadline.com/2025/06/trump-appeals-court-national-guard-newsom-1236438161/",
    "timestamp": "2025-06-20T03:18:38Z"
  },
  {
    "title": "Iran hits Israeli hospital as air war escalates; Trump to decide on US involvement within two weeks",
    "description": "TEL AVIV: Tensions intensified as Israel struck Iranian nuclear sites on Thursday, following an Iranian missile and drone assault that hit an Israeli hospital overnight. The escalating conflict, now entering its second week, shows no signs of de-escalation or…",
    "link": "https://english.khabarhub.com/2025/20/478872/",
    "timestamp": "2025-06-20T03:15:51Z"
  },
  {
    "title": "Appeals court lets Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids. The decision halts a ruling from a lower court judge who found Trump acted illegally whe…",
    "link": "https://japantoday.com/category/world/appeals-court-lets-trump-keep-control-of-national-guard-troops-deployed-to-los-angeles",
    "timestamp": "2025-06-20T03:15:30Z"
  },
  {
    "title": "Trump says U.S. has 'too many non-working holidays' on Juneteenth (Lawrence Hurley/NBC News)",
    "description": "Lawrence Hurley / NBC News:\nTrump says U.S. has ‘too many non-working holidays’ on Juneteenth  —  Meanwhile, former President Joe Biden celebrated the federal holiday he signed into law at a celebration at a historic Black church in Galveston, Texas.  —  Pres…",
    "link": "https://www.memeorandum.com/250619/p129",
    "timestamp": "2025-06-20T03:15:01Z"
  },
  {
    "title": "Appeals court lets Trump keep control National Guard troops deployed to Los Angeles during protests (Associated Press)",
    "description": "Associated Press:\nAppeals court lets Trump keep control National Guard troops deployed to Los Angeles during protests  —  An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following…",
    "link": "https://www.memeorandum.com/250619/p128",
    "timestamp": "2025-06-20T03:15:01Z"
  },
  {
    "title": "Israel-Iran: Germany, France, UK seek diplomatic solution",
    "description": "The foreign ministers of Britain, France, and Germany are set to meet with their Iranian counterpart in Geneva as the conflict with Israel enters its second week. DW has more. German, French, British foreign ministers to meet Iranian counterpart in Geneva\nCon…",
    "link": "https://www.dw.com/en/israel-iran-germany-france-uk-seek-diplomatic-solution/live-72979030",
    "timestamp": "2025-06-20T03:15:00Z"
  },
  {
    "title": "New Victorian laws will help combat hate speech, but there is still some way to go",
    "description": "The reforms include up to five years jail for vilifying people for their gender, sexual orientation or disability. But there’s a high bar for enforcing the laws.",
    "link": "https://theconversation.com/new-victorian-laws-will-help-combat-hate-speech-but-there-is-still-some-way-to-go-258698",
    "timestamp": "2025-06-20T03:13:38Z"
  },
  {
    "title": "Appeals court lets President Trump keep control of National Guard troops deployed to Los Angeles",
    "description": "An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids.",
    "link": "https://www.wpxi.com/news/local/appeals-court-lets-president-trump-keep-control-national-guard-troops-deployed-los-angeles/EKYAVT6RWNA4XMV65JUF43DLZE/",
    "timestamp": "2025-06-20T03:11:32Z"
  },
  {
    "title": "Appeals court says Trump can keep control of California National Guard troops",
    "description": "President Donald Trump is within his rights to deploy the California National Guard amid protests against federal law enforcement over immigration raids, an appeals court ruled Thursday night.",
    "link": "https://www.nbcnews.com/news/us-news/trump-california-national-guard-rcna214031",
    "timestamp": "2025-06-20T03:08:55Z"
  },
  {
    "title": "Bitcoiners split on $94K or $114K for BTC’s next move as it trades sideways",
    "description": "Crypto users are divided on whether Bitcoin will drop below $100,000 or surge to a new all-time high as the cryptocurrency trades sideways, a recent X poll shows.",
    "link": "https://cointelegraph.com/news/bitcoin-predictions-new-highs-100k-retrace-crypto-analyst-poll",
    "timestamp": "2025-06-20T03:07:32Z"
  },
  {
    "title": "Pakistan fears militants will thrive on restive border if Iran destabilised",
    "description": "Pakistan fears that the escalating conflict between Israel and Iran could destabilize its border region, potentially creating ungoverned spaces for separatist and jihadist militants. Concerns are mounting over the possibility of a \"greater Baluchistan\" moveme…",
    "link": "https://economictimes.indiatimes.com/news/defence/pakistan-fears-militants-will-thrive-on-restive-border-if-iran-destabilised/articleshow/121965275.cms",
    "timestamp": "2025-06-20T03:06:57Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycottcleveland19.com",
    "link": "https://www.cleveland19.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T03:01:37Z"
  },
  {
    "title": "Will Trump Attack Iran?",
    "description": "White House says Trump sees 'substantial chance' for talks as decision looms on U.S. interventionA Diplomatic Opening or the Road to War?President Donald Trump is expected to decide within two weeks whether the U.S. will directly intervene in the escalating I…",
    "link": "https://english.gossiplankanews.com/2025/06/will-trump-attack-iran.html",
    "timestamp": "2025-06-20T03:01:00Z"
  },
  {
    "title": "Spanish Socialist Prime Minister Sánchez Rejects Trump’s Demands That NATO Countries Spend 5% of GDP on Defense, Throws Summit Plans Into Disarray",
    "description": "It’s been a rough ride for failing Spanish Prime Minister Pedro Sánchez.\nThe post Spanish Socialist Prime Minister Sánchez Rejects Trump’s Demands That NATO Countries Spend 5% of GDP on Defense, Throws Summit Plans Into Disarray appeared first on The Gateway …",
    "link": "https://www.thegatewaypundit.com/2025/06/spanish-socialist-prime-minister-sanchez-rejects-trumps-demands/",
    "timestamp": "2025-06-20T03:00:48Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.mysuncoast.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T03:00:38Z"
  },
  {
    "title": "Israel-Iran air war enters second week as Europe pushes diplomacy",
    "description": "TEL AVIV: Israel and Iran's air war entered a second week on Friday (Jun 20) and European officials sought to draw Tehran back to the negotiating table after President Donald Trump said any decision on potential US involvement would be made within two weeks.",
    "link": "https://www.channelnewsasia.com/world/israel-iran-air-war-enters-second-week-europe-push-diplomacy-5193301",
    "timestamp": "2025-06-20T03:00:00Z"
  },
  {
    "title": "Stocks struggle, oil up for 3rd week as Trump weighs US action on Iran",
    "description": "Asian share markets faced uncertainty amid worries of a possible US-Iran conflict. Oil prices are likely to increase due to the escalating Israel-Iran tensions. Israel bombed nuclear targets in Iran. Donald Trump will decide on US involvement in the next two …",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-struggle-oil-up-for-3rd-week-as-trump-weighs-us-action-on-iran/articleshow/121965125.cms",
    "timestamp": "2025-06-20T02:56:12Z"
  },
  {
    "title": "Appeals Court Lets Trump Keep Control National Guard Troops Deployed To LA During Protests",
    "description": "The deployment was the first by a president of a state National Guard without the governor’s permission since 1965.",
    "link": "https://www.huffpost.com/entry/appeals-court-lets-trump-keep-control-national-guard-troops-deployed-to-la-during-protests_n_6854cb70e4b07e1309c5fdb2",
    "timestamp": "2025-06-20T02:49:10Z"
  },
  {
    "title": "Judge blocks Trump plan to tie states' transportation funds to immigration enforcement",
    "description": "A federal judge on Thursday blocked President Donald Trump‘s administration from forcing 20 Democratic-led states to cooperate with immigration enforcement in order to receive billions of dollars in transportation grant funding",
    "link": "https://www.nbcnews.com/politics/politics-news/judge-blocks-trump-plan-tie-states-transportation-funds-immigration-en-rcna214030",
    "timestamp": "2025-06-20T02:47:27Z"
  },
  {
    "title": "Spain risks derailing NATO summit by resisting 5% defense spending goal",
    "description": "At an estimated 1.28% of GDP, Spain had the lowest proportion of expenditure on defense in the alliance last year, according to NATO estimates.",
    "link": "https://www.japantimes.co.jp/news/2025/06/20/world/politics/spain-nato-derail-risk/",
    "timestamp": "2025-06-20T02:41:00Z"
  },
  {
    "title": "Senate Republicans hold hearing on Biden’s mental fitness as Democrats boycott",
    "description": "The Senate Judiciary Hearing on Wednesday took place over six months after Biden left office.",
    "link": "https://www.wsaz.com/2025/06/19/senate-republicans-hold-hearing-bidens-mental-fitness-democrats-boycott/",
    "timestamp": "2025-06-20T02:38:18Z"
  },
  {
    "title": "Trump can maintain control of thousands of California national guardsmen, appeals court rules | CNN Politics",
    "description": "A federal appeals court is allowing President Donald Trump to maintain control over thousands of members of California’s National Guard.",
    "link": "https://www.cnn.com/2025/06/19/politics/trump-continue-control-california-national-guard",
    "timestamp": "2025-06-20T02:37:51Z"
  },
  {
    "title": "‘Who Was Running the Country?’ – Witnesses Testify on Biden Health Cover-Up, Autopen Scandal (VIDEO)",
    "description": "The Senate Judiciary Committee brought in three witnesses to testify on Joe Biden’s mental and health decline on Wednesday. Former White House Press Secretary under Trump 1.0, Sean Spicer, former DOJ official under Trump, Theodore Wold, and University of Virg…",
    "link": "https://freerepublic.com/focus/f-news/4324162/posts",
    "timestamp": "2025-06-20T02:36:15Z"
  },
  {
    "title": "How Black conservative leaders aim to build the next generation in Washington",
    "description": "The Black Conservative Federation is launching a two-day summit in Washington, D.C., next month aimed at uniting and elevating Black conservatives.",
    "link": "https://abcnews.go.com/Politics/black-conservative-leaders-aim-build-generation-washington/story?id=123024284",
    "timestamp": "2025-06-20T02:32:37Z"
  },
  {
    "title": "Awkward moment for USMNT stars at their visit to the White House",
    "description": "Juventus had a fine debut at the FIFA World Cup, where they destroyed Al Ain by a result of 5- 0. However, after that match, the team with two USMNT stars had a brief visit to the",
    "link": "https://www.marca.com/en/football/fifa-club-world-cup/2025/06/20/6854c5ddca474184698b456f.html",
    "timestamp": "2025-06-20T02:32:03Z"
  },
  {
    "title": "Trump Once Said He Made Juneteenth 'Very Famous' But Now He's Unhappy About 'Too Many' Non-Working Holidays, Says Its Costing America Billions",
    "description": "President Donald Trump criticized the growing number of federal holidays and their economic cost in a post on Truth Social. Notably, his comments came on the Juneteenth holiday.What Happened: Trump took to his platform to air his frustrations about federal ho…",
    "link": "https://biztoc.com/x/67c8d59907ddbdcd",
    "timestamp": "2025-06-20T02:32:02Z"
  },
  {
    "title": "Douglas Murray: President Trump can end the nuclear threat from Iran with one phone call",
    "description": "Last August, under President Joe Biden, federal prosecutors in New York charged Afghan-born Farhad Shakeri in a plot to assassinate Donald Trump.",
    "link": "https://nypost.com/2025/06/19/opinion/president-trump-can-end-the-nuclear-threat-from-iran-with-one-phone-call/",
    "timestamp": "2025-06-20T02:31:30Z"
  },
  {
    "title": "Budapest Liberal Mayor Defies Orbán’s Hungarian Child Protection Law That Bans Public LGBT Events, Sets up Confrontation by Confirming ‘Pride March’ Is To Take Place",
    "description": "Conservative champion, Hungarian Prime Minister Viktor Orbán implements his nationalistic, pro-family agenda despite the uproar in the Liberal-Globalist European establishment.\nThe post Budapest Liberal Mayor Defies Orbán’s Hungarian Child Protection Law That…",
    "link": "https://www.thegatewaypundit.com/2025/06/budapest-liberal-mayor-defies-orbans-hungarian-child-protection/",
    "timestamp": "2025-06-20T02:30:10Z"
  },
  {
    "title": "Zelenskyy Calls For More Pressure On Russia After Deadly Missile Strike In Kyiv",
    "description": "“This attack is a reminder to the world that Russia rejects a ceasefire and chooses killing,” Zelenskyy wrote on Telegram.",
    "link": "https://www.huffpost.com/entry/zelenskyy-calls-more-pressure-russia-deadly-missile-strike-kyiv_n_6854c558e4b0e5115b421c7e",
    "timestamp": "2025-06-20T02:30:07Z"
  },
  {
    "title": "US top diplomat Rubio discussed Israel-Iran war with key partners",
    "description": "WASHINGTON (Reuters) -U.S. Secretary of State Marco Rubio met British foreign minister David Lammy on Thursday and held separate calls with Australian...",
    "link": "https://www.yahoo.com/news/us-top-diplomat-rubio-discussed-022725474.html",
    "timestamp": "2025-06-20T02:27:25Z"
  },
  {
    "title": "Trump says U.S. has 'too many non-working holidays' on Juneteenth",
    "description": "President Donald Trump did not formally mark Juneteenth on Thursday, complaining instead that there are \"too many non-working holidays,\" while his predecessor, Joe Biden, celebrated the occasion at a Black church in Texas",
    "link": "https://www.nbcnews.com/politics/politics-news/trump-says-us-many-non-working-holidays-juneteenth-rcna214019",
    "timestamp": "2025-06-20T02:26:28Z"
  },
  {
    "title": "‘Biggest Decision Of His Life’: Mark Halperin Says Trump’s Leverage Over Iran Is Unprecedented",
    "description": "Political analyst Mark Halperin pointed out on Fox News Thursday the gravity of President Donald Trump's decision regarding Iran.",
    "link": "https://dailycaller.com/2025/06/19/mark-halperin-trump-leverage-iran/",
    "timestamp": "2025-06-20T02:26:27Z"
  },
  {
    "title": "Trump Family Reduces Stake in Crypto Project World Liberty",
    "description": "In brief\n- DT Marks DEFI LLC, tied to the Trump family, reduced its stake in World Liberty Financial from 60% to approximately 40%.\n- The change comes amid growing political scrutiny and a Senate investigation into Trump’s crypto ties.\n- U.S. President Donald…",
    "link": "https://biztoc.com/x/4eb87647786fbad9",
    "timestamp": "2025-06-20T02:21:07Z"
  }
]