[
  {
    "title": "Biden's illegal migration funding machine, Trump’s order was the last straw, and more from Fox News Opinion",
    "description": "Read the latest from Fox News Opinion & watch videos from Sean Hannity, Raymond Arroyo & more.",
    "link": "https://www.foxnews.com/opinion/bidens-illegal-migration-funding-machine-trumps-order-last-straw-more-from-fox-news-opinion",
    "timestamp": "2025-02-14T15:59:47Z"
  },
  {
    "title": "Dems likely to 'waste millions' on deluge of lawsuits but could cost Trump precious time: expert",
    "description": "Democrats will likely 'waste millions' trying to litigate Trump's executive orders and lose, University of California, Berkeley, law professor John Yoo told Fox News Digital.",
    "link": "https://www.foxnews.com/politics/dems-likely-waste-millions-deluge-lawsuits-could-cost-trump-precious-time-expert",
    "timestamp": "2025-02-14T15:59:43Z"
  },
  {
    "title": "Illegal immigrant arrests skyrocket under Trump ICE compared to Biden levels last year: 'Worst of the worst'",
    "description": "Immigration and Customs Enforcement arrests of illegal immigrants have soared under the new administration compared to a similar period under former President Joe Biden last year.",
    "link": "https://www.foxnews.com/politics/illegal-immigrant-arrests-skyrocket-under-trump-ice-compared-biden-levels-last-year",
    "timestamp": "2025-02-14T15:58:03Z"
  },
  {
    "title": "Saudi Arabia Emerges as Key Global Player Under Trump",
    "description": "The Kingdom's recent maneuvers reflect its ambitions to assert itself as a global mediator while securing its own interests.",
    "link": "https://www.newsweek.com/saudi-arabia-diplomacy-russia-ukraine-donald-trump-2031282",
    "timestamp": "2025-02-14T15:57:52Z"
  },
  {
    "title": "Indian industries see opportunity in Trump's trade goals",
    "description": "Indian industry sees potential for stronger US business ties after Modi's meeting with Trump. Talks to finalize a trade deal by year's end could more than double bilateral trade to $500 billion. Indian companies, now more competitive due to government incenti…",
    "link": "https://economictimes.indiatimes.com/news/company/corporate-trends/indian-industries-see-opportunity-in-trumps-trade-goals/articleshow/118254067.cms",
    "timestamp": "2025-02-14T15:57:26Z"
  },
  {
    "title": "Congress, not the president, decides on government spending − a constitutional law professor explains how the ‘power of the purse’ works",
    "description": "Congress has the authority to control government expenditures. Donald Trump is the latest president to try to get around that power, as he slashes government programs and staff.",
    "link": "https://theconversation.com/congress-not-the-president-decides-on-government-spending-a-constitutional-law-professor-explains-how-the-power-of-the-purse-works-248644",
    "timestamp": "2025-02-14T15:53:34Z"
  },
  {
    "title": "WATCH: Vance tells Europe immigration most ‘urgent’ issue, says voters don’t want ‘floodgates’ open",
    "description": "Vice President JD Vance urged European officials to stem illegal migration on the continent during his speech before the Munich Security Conference.",
    "link": "https://www.pbs.org/newshour/politics/watch-vance-tells-europe-immigration-most-urgent-issue-says-voters-dont-want-floodgates-open",
    "timestamp": "2025-02-14T15:53:28Z"
  },
  {
    "title": "How Trump is pouring gas on the fire of de-globalization",
    "description": "Donald Trump is back in the White House as United States president, and so are his trade wars.\nHe started off by threatening to put 25 per cent tariffs on Canadian and Mexican exports to the U.S., which most economists said would be terrible news. At the 11th…",
    "link": "https://biztoc.com/x/69f200a69432103f",
    "timestamp": "2025-02-14T15:53:15Z"
  },
  {
    "title": "Trump and India PM’s plans to deepen defense partnership include sale of stealth fighter jets",
    "description": "There was guarded optimism among military experts in India as Prime Minister Narendra Modi and U.S. President Donald Trump outlined plans to ramp up sales of defense systems to New Delhi.",
    "link": "https://nypost.com/2025/02/14/us-news/trump-and-narendra-modi-outline-plans-to-deepen-defense-partnership/",
    "timestamp": "2025-02-14T15:53:10Z"
  },
  {
    "title": "The slashing of the federal workforce begins",
    "description": "President Donald Trump and advisor Elon Musk are intensifying their program to end the jobs of federal employees. A new strategy is to let go people on the job for less than a year, people with what is called “probationary status.” We’ll discuss. Plus, a new …",
    "link": "https://www.marketplace.org/shows/marketplace-morning-report/the-slashing-of-the-federal-workforce-begins/",
    "timestamp": "2025-02-14T15:52:38Z"
  },
  {
    "title": "How will Elon Musk’s business empire benefit from his relationship with Trump?",
    "description": "The world’s richest man now holds huge sway over its most powerful leader — and the US government",
    "link": "https://www.irishtimes.com/business/2025/02/14/how-will-elon-musks-business-empire-benefit-from-his-relationship-with-trump/",
    "timestamp": "2025-02-14T15:52:01Z"
  },
  {
    "title": "Robert F. Kennedy Jr.’s Daughters Kick Kennedy Suits Up in Cigarette Pants and Kyra Favors Gucci for Confirmation Ceremony at White House",
    "description": "Robert F. Kennedy Jr.'s daughters Kick and Kyra Kennedy wore contrasting looks for his confirmation ceremony at the White House with Donald Trump.",
    "link": "http://wwd.com/pop-culture/celebrity-news/kick-kennedy-outfit-rfk-jr-daughter-confirmation-hhs-1236931546/",
    "timestamp": "2025-02-14T15:51:57Z"
  },
  {
    "title": "‘NEW SHERIFF IN TOWN’ Trump’s No2 Vance blasts Britain over free speech crackdowns & attacks Europe on immigration after Munich attack",
    "description": "US Vice President JD Vance has ripped into Britain over its crackdown on free speech and attacked Europe on immigration policies. Donald Trump's number two blasted the continent at the Munich Security Conference just a day after a horror car attack left 36 pe…",
    "link": "https://freerepublic.com/focus/f-news/4297590/posts",
    "timestamp": "2025-02-14T15:51:36Z"
  },
  {
    "title": "Trump’s A.G. Just Did Something So Corrupt She Should Be Fired Already",
    "description": "Pam Bondi was approved by the Senate to be attorney general on February 4. On February 5, she was sworn in. And on February 10, five days into her already ghastly tenure, she committed an act so electrically sleazy that in a normally ordered world, she’d be f…",
    "link": "https://newrepublic.com/post/191552/trump-ag-pam-bondi-corrupt-eric-adams",
    "timestamp": "2025-02-14T15:51:17Z"
  },
  {
    "title": "Saudi Arabia spearheads Arab scramble for alternative to Trump's Gaza plan",
    "description": "Saudi Arabia and its Arab allies were aghast at Trump's plan to \"clean out\" Palestinians from Gaza and resettle most of them in Jordan and Egypt",
    "link": "https://www.jpost.com/middle-east/article-842168",
    "timestamp": "2025-02-14T15:49:55Z"
  },
  {
    "title": "Philippines increases defense efforts amid ongoing tension with China",
    "description": "TAIPEI, TAIWAN — The Philippines is increasing efforts to strengthen defense cooperation with several like-minded democracies amid ongoing tensions with China in the disputed South China Sea. \n\n\nManila is trying to conclude major defense pacts with Canada and…",
    "link": "https://www.voanews.com/a/philippines-increases-defense-efforts-amid-ongoing-tension-with-china-/7975137.html",
    "timestamp": "2025-02-14T15:49:26Z"
  },
  {
    "title": "Editorial. Mega partnership",
    "description": "Modi-Trump bonhomie amidst tariffs threat",
    "link": "https://www.thehindubusinessline.com/opinion/editorial/mega-partnership/article69220071.ece",
    "timestamp": "2025-02-14T15:49:22Z"
  },
  {
    "title": "DOGE’s ‘Nerd Army’ Is Breaking the Government by Threatening to Snitch to Elon",
    "description": "Donald Trump and Elon Musk’s power grab — and burgeoning constitutional crisis — has been built on threats by the DOGE team to call the Tesla CEO.",
    "link": "http://www.rollingstone.com/politics/politics-features/musk-trump-doge-threats-nerd-army-1235267839/",
    "timestamp": "2025-02-14T15:48:11Z"
  },
  {
    "title": "FACT CHECK: No, Trump Didn’t Threaten To Deport All Ghanaians",
    "description": "A post shared on Facebook claims President Donald Trump threatened to deport all Ghanaians. Verdict: False There is no evidence that Trump said he would deport all Ghanaians. The video has been doctored. Fact Check: Social media users are sharing a video of T…",
    "link": "https://checkyourfact.com/2025/02/14/fact-check-trump-threaten-deport-ghanaians/",
    "timestamp": "2025-02-14T15:47:38Z"
  },
  {
    "title": "Trump’s Dismantling of USAID is Anarchy Masquerading as Efficiency",
    "description": "Senator Brian Schatz, lead Democrat on the Senate Appropriations subcommittee overseeing foreign aid argues that Trump's attacks on USAID are not about achieving efficiency.",
    "link": "https://time.com/7225290/trumps-dismantling-of-usaid/",
    "timestamp": "2025-02-14T15:45:00Z"
  },
  {
    "title": "Wall Street talk of revaluing U.S. gold isn’t persuading White House",
    "description": "As the precious metal soars to record highs, if the U.S. sold off some of its stockpiles, it could hurt gold prices, analysts say. Read more",
    "link": "https://financialpost.com/investing/wall-street-revaluing-gold",
    "timestamp": "2025-02-14T15:44:53Z"
  },
  {
    "title": "How Trump is pouring gas on the fire of de-globalization",
    "description": "Donald Trump's tariff war is hastening the transition to a new world order. Listen to Down to Business podcast",
    "link": "https://financialpost.com/news/economy/trump-pouring-gas-on-fire-de-globalization",
    "timestamp": "2025-02-14T15:44:22Z"
  },
  {
    "title": "India, US agree to negotiate bilateral trade pact by 2025-end",
    "description": "India and US negotiating bilateral trade agreement, addressing tariffs, non-tariff barriers, and supply chain integration by fall 2025.",
    "link": "https://www.thehindubusinessline.com/economy/india-us-agree-to-negotiate-bilateral-trade-pact-by-2025-end/article69220532.ece",
    "timestamp": "2025-02-14T15:44:12Z"
  },
  {
    "title": "American-Israeli Dad Next To Be Freed By Hamas Was Taken From Kibbutz That Israel 'Forgot' To Defend",
    "description": "Sagui Dekel Chen is one of the three hostages to be released in the next truce-brokered exchange.",
    "link": "https://www.ibtimes.com/american-israeli-dad-next-freed-hamas-was-taken-kibbutz-that-israel-forgot-defend-3763769",
    "timestamp": "2025-02-14T15:43:38Z"
  },
  {
    "title": "Why are diversity, equity and inclusion policies in the news?",
    "description": "Many large US corporates including Google, Amazon and Walmart have scaled back DEI after Trump push within government\nCo-op: ditching diversity policies ‘risks undoing decades of progress’\nLast month Donald Trump signed a slew of executive orders overturning …",
    "link": "https://biztoc.com/x/9a610cda6d985ea2",
    "timestamp": "2025-02-14T15:42:41Z"
  },
  {
    "title": "Europe aims for digital independence with EuroStack",
    "description": "The EuroStack initiative aims to develop an independent digital ecosystem for the regionIt is backed by an unusual and powerful coalition of academics, policym…",
    "link": "https://www.telecomtv.com/content/digital-platforms-services/europe-aims-for-digital-independence-with-eurostack-52343/",
    "timestamp": "2025-02-14T15:42:36Z"
  },
  {
    "title": "Social Security Cuts Being Discussed by Republicans",
    "description": "A Republican has confirmed that lawmakers have been \"discussing\" cutting mandatory spending.",
    "link": "https://www.newsweek.com/social-security-cuts-discussed-republicans-2029360",
    "timestamp": "2025-02-14T15:42:29Z"
  },
  {
    "title": "Issa Rae, Shonda Rhimes And More Artists Cut Ties With Kennedy Center After Trump Installs Himself As Chairman",
    "description": "Trump took over as the organization’s chairman Wednesday, vowing to fight what he called “woke” productions.",
    "link": "https://www.forbes.com/sites/conormurray/2025/02/14/issa-rae-shonda-rhimes-and-more-artists-cut-ties-with-kennedy-center-after-trump-installs-himself-as-chairman/",
    "timestamp": "2025-02-14T15:42:24Z"
  },
  {
    "title": "After confirmation votes, Trump’s offensive against McConnell gets uglier",
    "description": "It seemed hard to imagine Donald Trump's relationship with Mitch McConnell getting much worse. Then the president questioned whether the senator had polio.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/confirmation-votes-trumps-offensive-mcconnell-gets-uglier-rcna192220",
    "timestamp": "2025-02-14T15:41:37Z"
  },
  {
    "title": "Will Trump 'Fix the Glitch' to Win His War on the Government? | Opinion",
    "description": "For the past three weeks, representatives of Elon Musk's Department of Government Efficiency have been playing the role of the consultants in the movie \"Office Space.\"",
    "link": "https://www.newsweek.com/will-trump-fix-glitch-win-his-war-government-opinion-2031305",
    "timestamp": "2025-02-14T15:39:27Z"
  },
  {
    "title": "It's easy to be a Ukrainian war hawk when you're playing poker with house money",
    "description": "Donald Trump's peace plan for the Ukraine/Russia conflict is coming under fire from some entertaining quarters. There is, of course, the domestic whining from the likes of John Bolton, who said “I think we know exactly what's gonna happen. President Trump has…",
    "link": "https://freerepublic.com/focus/f-bloggers/4297583/posts",
    "timestamp": "2025-02-14T15:37:56Z"
  },
  {
    "title": "Donald Trump Is Stealing the Kennedy Brand",
    "description": "Jeet Heer\n\n\n\nDoes the Kennedy name stand for liberalism—or oligarchy?\r\n\n\r\n\n\nThe post Donald Trump Is Stealing the Kennedy Brand appeared first on The Nation.",
    "link": "https://www.thenation.com/article/politics/trump-rfk-kennedy-legacy/",
    "timestamp": "2025-02-14T15:37:47Z"
  },
  {
    "title": "Owen Hart Foundation Wishes Janel Grant Luck in Vince McMahon Lawsuit",
    "description": "In a notable display of solidarity, the Owen Hart Foundation (OHF) has expressed public support for Janel Grant's ongoing civil lawsuit against former World Wrestling Entertainment (WWE) Chairman Vince McMahon. The foundation recently shared photographs on so…",
    "link": "https://bleedingcool.com/tv/owen-hart-foundation-wishes-janel-grant-luck-in-vince-mcmahon-lawsuit/",
    "timestamp": "2025-02-14T15:37:07Z"
  },
  {
    "title": "Sanctuary No More: NYC Mayor Ushers in Homan to Root Out Seriously Criminal Illegals",
    "description": "New York City is allowing Immigration and Customs Enforcement agents onto Rikers Island in a major policy change for the sanctuary city.",
    "link": "https://www.westernjournal.com/sanctuary-no-nyc-mayor-ushers-homan-root-seriously-criminal-illegals/",
    "timestamp": "2025-02-14T15:36:59Z"
  },
  {
    "title": "Trump ejects from the Ukraine joyride, leaving the EU screaming in the backseat",
    "description": "Western European leaders are having a meltdown because shutting them out from talks is the only way to peace Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612724-trump-ukraine-european-leaders/",
    "timestamp": "2025-02-14T15:36:21Z"
  },
  {
    "title": "Donald Trump Under Pressure Over Rising Egg Prices",
    "description": "A group of over 30 House Democrats has urged President Donald Trump to take action on skyrocketing egg prices, which have left American households struggling to take hold of this traditionally beloved, protein-rich staple.\n\"Over the last several weeks, you ha…",
    "link": "https://biztoc.com/x/f1d282f90294abbd",
    "timestamp": "2025-02-14T15:36:15Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system.",
    "link": "https://www.clickondetroit.com/business/2025/02/14/treasury-watchdog-begins-audit-of-musk-doge-teams-access-to-federal-governments-payment-system/",
    "timestamp": "2025-02-14T15:36:03Z"
  },
  {
    "title": "Treasury audit probes Musk's payment system access",
    "description": "The Treasury's Inspector General launches an audit on federal payment system security after concerns over Elon Musk's DOGE access",
    "link": "https://www.wbaltv.com/article/treasury-audit-musk-federal-payment-systems/63798271",
    "timestamp": "2025-02-14T15:36:00Z"
  },
  {
    "title": "Has Elon Musk's DOGE Website Been Hacked? What We Know",
    "description": "On Friday morning, the DOGE website homepage featured text stating: \"This is a joke of a .gov site.\"",
    "link": "https://www.newsweek.com/elon-musk-doge-website-hacked-2031139",
    "timestamp": "2025-02-14T15:35:14Z"
  },
  {
    "title": "Map Shows Countries Getting Biggest Boost From US Trade",
    "description": "Donald Trump's White House has cited trade deficits as a reason for more tariffs.",
    "link": "https://www.newsweek.com/map-shows-countries-biggest-boost-us-trade-deficit-2031199",
    "timestamp": "2025-02-14T15:34:52Z"
  },
  {
    "title": "Park Service Literally Erases Stonewall History In 'Cruel' Act Amid Trump Crackdown",
    "description": "Welcome to the \"LGB\" era in a \"cis-wash\" of the past on the monument's website page.",
    "link": "https://www.huffpost.com/entry/stonewall-national-monument-transgender-references_n_67af5a8ce4b0513a8d76e491",
    "timestamp": "2025-02-14T15:34:36Z"
  },
  {
    "title": "US retail sales see biggest drop in nearly two years on harsh weather",
    "description": "US retail sales experienced a significant drop of 0.9% between December and January, reaching $723.9 billion. This decline, the largest in almost two years, was attributed to cold weather and California wildfires. Key areas like auto sales and parts dealers s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-retail-sales-see-biggest-drop-in-nearly-two-years-on-harsh-weather/articleshow/118253587.cms",
    "timestamp": "2025-02-14T15:33:42Z"
  },
  {
    "title": "Donald Trump Under Pressure Over Rising Egg Prices",
    "description": "In a letter, over 30 House Democrats urged the president to keep his campaign promise to lower the cost-of-living for Americans and bring down egg prices.",
    "link": "https://www.newsweek.com/donald-trump-under-pressure-over-rising-egg-prices-2031081",
    "timestamp": "2025-02-14T15:33:11Z"
  },
  {
    "title": "Zelensky: Trump can pressure Putin to end war",
    "description": "Ukrainian President Volodymyr Putin stated on Friday that United States President Donald Trump has the power to pressure Russian President Vladimir Putin to end the war, in case he chooses to stand wi...",
    "link": "https://biztoc.com/x/e4dc5e9bb9109ecf",
    "timestamp": "2025-02-14T15:32:30Z"
  },
  {
    "title": "Jimmy Kimmel Roasts Robert F. Kennedy Jr. For “Ass Kissing” Donald Trump After His Confirmation: “Happy Valentine’s Day To Don And Bob”",
    "description": "\"That’s the way to get him going,\" Kimmel said. \"Melania couldn't turn him on like that the first day they met.\"",
    "link": "https://decider.com/2025/02/14/jimmy-kimmel-roasts-robert-f-kennedy-jr-ass-kissing-donald-trump/",
    "timestamp": "2025-02-14T15:32:00Z"
  },
  {
    "title": "Meta and Mark Zuckerberg’s Biggest Competitor Is Trump With a Sovereign Wealth Fund",
    "description": "24/7 Wall St. Key Points:\nDonald Trump has floated the idea of a U.S. sovereign wealth fund purchasing TikTok, potentially making it a government-backed competitor to Meta Platforms Inc. (NASDAQ: META).\nElon Musk has also been mentioned as a possible TikTok b…",
    "link": "https://biztoc.com/x/a0d30dffadf6c89d",
    "timestamp": "2025-02-14T15:31:58Z"
  },
  {
    "title": "Opinion: Trump's 'lawfare' attack on the courts could backfire on the Constitution",
    "description": "President Donald Trump loves to take a phrase and drain it of all meaning. In his first term, he transformed the term \"fake news\" from describing a specific problem with a type of misinformation into an attack on any journalist he didn't like or a piece of jo…",
    "link": "https://freerepublic.com/focus/f-chat/4297582/posts",
    "timestamp": "2025-02-14T15:31:54Z"
  },
  {
    "title": "FBI's latest declassified archive to unveil America’s darkest secrets: UFOs, Epstein connections and JFK's alleged second shooter",
    "description": "A newly revealed 2,400-page FBI archive may expose America's dark secrets from JFK's assassination to UFOs and Jeffrey Epstein's network. President Trump ordered declassification of records related to JFK, RFK, and MLK assassinations, emphasizing transparency…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/fbis-latest-declassified-archive-to-unveil-americas-darkest-secrets-ufos-epstein-connections-and-jfks-alleged-second-shooter/articleshow/118253185.cms",
    "timestamp": "2025-02-14T15:31:09Z"
  },
  {
    "title": "Donald Trump Hangs His Mug Shot Outside Oval Office",
    "description": "President Trump's breaking new ground during his second term in the Oval Office ... 'cause he's the first president to hang his mug shot just outside of it! The 47th prez met with India's Prime Minister Narendra Modi at the White House Thursday and…\n Permalink",
    "link": "https://www.tmz.com/2025/02/14/donald-trump-oval-office-mug-shot/",
    "timestamp": "2025-02-14T15:30:46Z"
  },
  {
    "title": "MTY Food Group ‘aggressively’ looking for acquisitions, watching for tariffs",
    "description": "The CEO of MTY Food Group Inc. says his company is on the hunt for another restaurant chain to add to its vast collection. Eric Lefebvre said Friday that the Montreal-based business behind dozens of brands including Manchu Wok, Thai Express, Mr. Sub and Timot…",
    "link": "https://financialpost.com/pmn/mty-food-group-aggressively-looking-for-acquisitions-watching-for-tariffs",
    "timestamp": "2025-02-14T15:30:36Z"
  },
  {
    "title": "MTY Food Group 'aggressively' looking for acquisitions",
    "description": "The chief executive of MTY Food Group Inc. says the company is on the hunt for another restaurant chain to add to its collection. Read on",
    "link": "https://financialpost.com/news/retail-marketing/mty-food-group-looking-for-acquisitions",
    "timestamp": "2025-02-14T15:30:36Z"
  },
  {
    "title": "Trump May Swap Crypto Council For Summits – Insider Blames Ripple",
    "description": "US President Donald Trump’s administration may be shelving plans for a formal “Crypto Council” in favor of a series of informal summits featuring a rotating cast of industry leaders. The change, first reported by Unchained Crypto on February 13, is thought to…",
    "link": "https://bitcoinist.com/trump-scrap-crypto-council-insider-blames-ripple/",
    "timestamp": "2025-02-14T15:30:19Z"
  },
  {
    "title": "'New Sheriff In Town', Vance Tells Europe",
    "description": "US Vice President JD Vance launched a withering attack Friday against European policies on immigration, populist parties and free speech, echoing the views of President Donald Trump, whom he called Washington's \"new sheriff in town\".",
    "link": "https://www.ibtimes.com/new-sheriff-town-vance-tells-europe-3763764",
    "timestamp": "2025-02-14T15:30:12Z"
  },
  {
    "title": "Drone damages Chernobyl nuclear plant; egg prices hit record high | Hot off the Wire",
    "description": " Get a recap of recent financial, health and general interest stories through this special edition of our Hot off the Wire daily news podcast.",
    "link": "https://richmond.com/news/nation-world/drone-damages-chernobyl-nuclear-plant-egg-prices-hit-record-high-hot-off-the-wire/article_24dceaeb-addb-5d58-b615-2d844db22efc.html",
    "timestamp": "2025-02-14T15:30:00Z"
  },
  {
    "title": "Drone damages Chernobyl nuclear plant; egg prices hit record high | Hot off the Wire",
    "description": " Get a recap of recent financial, health and general interest stories through this special edition of our Hot off the Wire daily news podcast.",
    "link": "https://roanoke.com/news/nation-world/drone-damages-chernobyl-nuclear-plant-egg-prices-hit-record-high-hot-off-the-wire/article_57f6054d-8d3b-523e-89e9-32b6016a9987.html",
    "timestamp": "2025-02-14T15:30:00Z"
  },
  {
    "title": "India to Hike Oil and LNG Imports From the U.S. to Avoid Trump’s Tariffs",
    "description": "India, which has a massive trade surplus with the United States, will aim to buy more American oil and LNG to reduce the surplus and avoid potential tariffs from President Donald Trump. India is likely to significantly increase its energy purchases from the U…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/India-to-Hike-Oil-and-LNG-Imports-From-the-US-to-Avoid-Trumps-Tariffs.html",
    "timestamp": "2025-02-14T15:30:00Z"
  },
  {
    "title": "‘New Sheriff In Town’: JD Vance Tells Globalists Point-Blank To Stop Censoring People",
    "description": "Vice President J.D. Vance told Europeans at the Munich Security Conference Friday to stop intentionally censoring their citizens' rights to free speech.",
    "link": "https://dailycaller.com/2025/02/14/jd-vance-europe-munich-security-conference/",
    "timestamp": "2025-02-14T15:28:19Z"
  },
  {
    "title": "Woman Reveals How ICE Raid Took Her Husband—'Political War'",
    "description": "\"I don't have my husband, and my kids don't have a father,\" Loreal Duran told Newsweek.",
    "link": "https://www.newsweek.com/ice-raid-immigrants-woman-reveals-husband-taken-agents-2031100",
    "timestamp": "2025-02-14T15:27:08Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system.",
    "link": "https://www.clickorlando.com/business/2025/02/14/treasury-watchdog-begins-audit-of-musk-doge-teams-access-to-federal-governments-payment-system/",
    "timestamp": "2025-02-14T15:26:51Z"
  },
  {
    "title": "Modi, Trump aim to double Indo-US trade to $500 billion by 2030",
    "description": "Defence and energy cooperation, trade pact, nuclear energy discussed by two leaders but Trump’s reciprocal tariff plans act as dampener",
    "link": "https://www.thehindubusinessline.com/economy/modi-trump-aim-to-double-indo-us-trade-to-500-bn-by-2030/article69220268.ece",
    "timestamp": "2025-02-14T15:26:44Z"
  },
  {
    "title": "Judge orders Trump administration to temporarily allow foreign aid",
    "description": "A federal judge has ordered a temporary suspension of the funding freeze on the US Agency for International Development (USAID).",
    "link": "https://www.abc.net.au/news/2025-02-15/us-judge-orders-trump-lifts-a-funding-freeze-for-foreign-aid-/104940150",
    "timestamp": "2025-02-14T15:26:32Z"
  },
  {
    "title": "Top Coins to 100x as SEC Acknowledges First-Ever Dogecoin ETF Filing",
    "description": "The SEC has acknowledged the filing of a new crypto ETF proposal by Grayscale. That’s the same asset management firm that filed a bid to create a Solana ETF just four days ago. However, this time around, the request is to create a Dogecoin ETF, which makes th…",
    "link": "http://www.newsbtc.com/news/top-coins-to-100x-as-sec-acknowledges-first-ever-dogecoin-etf-filing/",
    "timestamp": "2025-02-14T15:23:51Z"
  },
  {
    "title": "Trump Is Revealing His Most Relatable Quality Ever",
    "description": "President Donald Trump has been revealing his most relatable quality in recent days.",
    "link": "https://dailycaller.com/2025/02/14/donald-trump-india-modi-reporter-indian-accent-press-conference/",
    "timestamp": "2025-02-14T15:23:17Z"
  },
  {
    "title": "Trump pledges action against Islamic terrorists, Khalistani subversives",
    "description": "US President Donald Trump pledged to address India's security concerns, including extraditing Tahawwur Rana and acting against US-based Khalistani separatists. Trump and Modi agreed on joint action against radical Islamic terrorism. He offered to mediate Indi…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-pledges-action-against-islamic-terrorists-khalistani-subversives/articleshow/118253332.cms",
    "timestamp": "2025-02-14T15:23:01Z"
  },
  {
    "title": "TikTok returns to Apple App Store and Google Play in US",
    "description": "TikTok returned to the US app stores of Apple and Google on Thursday as President Donald Trump delayed a ban on the Chinese-owned social media app and assured the tech giants they would not be fined for distributing or maintaining it.\nThe popular short video …",
    "link": "https://biztoc.com/x/f9bbb45ab5365286",
    "timestamp": "2025-02-14T15:23:01Z"
  },
  {
    "title": "Reciprocity and power play in a Trumpian world",
    "description": "Trade tangle. The US memorandum breaks all WTO rules. Larger developing countries must take the lead and push back",
    "link": "https://www.thehindubusinessline.com/opinion/reciprocity-and-power-play-in-a-trumpian-world/article69220473.ece",
    "timestamp": "2025-02-14T15:22:43Z"
  },
  {
    "title": "Goodnight, Goon. Elon Musk Is Whispering 'Cuts,' Sleeping on the Floor Near the White House",
    "description": "He really is in the DOGEhouse, huh?",
    "link": "https://www.vanityfair.com/style/story/elon-musk-sleeping-in-his-office-white-house",
    "timestamp": "2025-02-14T15:22:14Z"
  },
  {
    "title": "References to transgender and queer removed from Stonewall National Monument’s web page",
    "description": "References to transgender and queer people were erased from the Stonewall National Monument's web page, marking one of the latest moves of the current administration after President Donald Trump said the government would recognize male and female as the only …",
    "link": "https://www.nbcnews.com/nbc-out/out-news/references-transgender-queer-removed-stonewall-monuments-webpage-rcna192204",
    "timestamp": "2025-02-14T15:22:12Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team’s access to federal government’s payment system",
    "description": "The audit marks part of the broader effort to provide transparency about DOGE’s activities.",
    "link": "https://www.bostonherald.com/2025/02/14/treasury-watchdog-begins-audit-of-musk-doge-teams-access-to-federal-governments-payment-system/",
    "timestamp": "2025-02-14T15:22:10Z"
  },
  {
    "title": "India's prime minister has adopted a familiar slogan: 'Make India Great Again'",
    "description": "India's Prime Minister Narendra Modi and President Donald Trump.\nAndrew Harnik/Getty Images\nIndia's prime minister met with President Donald Trump this week.\nNarendra Modi said India and the US had agreed to aim to double bilateral trade to $500 billion by 20…",
    "link": "https://biztoc.com/x/41b24604a8c43b75",
    "timestamp": "2025-02-14T15:22:10Z"
  },
  {
    "title": "JD Vance criticizes European allies for not listening to their citizens | CNN",
    "description": "US Vice President JD Vance vented at European leaders Friday, telling them that the biggest threat to their security was “from within,” rather than China and Russia.",
    "link": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl/index.html",
    "timestamp": "2025-02-14T15:22:05Z"
  },
  {
    "title": "READ: Donald Trump’s official reciprocal tariff announcement",
    "description": "United States President Donald Trump announced Thursday reciprocal tariffs against some of its biggest trading partners, including Canada.\nWhile details of the tariffs remain scarce, the move allows the U.S. Trade Representative and Commerce secretary to prop…",
    "link": "https://biztoc.com/x/dbfd93727ab1710d",
    "timestamp": "2025-02-14T15:22:00Z"
  },
  {
    "title": "Retail Spending Slips As Inflation Climbs In January, Adding To Economic Concerns",
    "description": "After a solid holiday season, US retail sales took a surprising step back to start 2025, snapping a streak of growth and fueling worries about the economy. \nRetail and food services sales fell 0.9 pe…",
    "link": "https://dailyvoice.com/virginia/arlington/retail-spending-slips-as-inflation-climbs-in-january-adding-to-economic-concerns/",
    "timestamp": "2025-02-14T15:21:42Z"
  },
  {
    "title": "The Math of the “Trump Bump” — Could Stocks Rally 30% in 2025?",
    "description": "In the wake of Donald Trump’s victory in the 47th U.S. Presidential Election, the stock market has experienced a significant surge, often referred to as the “Trump Bump.”\nSince Election Day, the S&P 500 has climbed over 6%, while the Nasdaq has seen an impres…",
    "link": "https://biztoc.com/x/f2ed3f4604ac7ec7",
    "timestamp": "2025-02-14T15:21:29Z"
  },
  {
    "title": "The Revolving Door Project Publishes List Tracking Reports Elon Musk and His Companies Flout the Law and Regulations",
    "description": "In response to quasi-President Musk’s manifest disregard of federal law and the constitutional order, The Revolving Door Project published a document\r\n tracking Musk’s career of routinely disregarding laws, regulations and rules. Along with this tracker, the …",
    "link": "https://www.commondreams.org/newswire/the-revolving-door-project-publishes-list-tracking-reports-elon-musk-and-his-companies-flout-the-law-and-regulations",
    "timestamp": "2025-02-14T15:21:17Z"
  },
  {
    "title": "Saudi Arabia Says It Would Be Delighted to Host Trump-Putin Summit",
    "description": "The Foreign Ministry of Saudi Arabia confirmed on Friday it is interested in hosting a summit between President Donald Trump and his Russian counterpart Vladimir Putin in the near future after Trump floated the possibility. President Trump held a phone conver…",
    "link": "https://freerepublic.com/focus/f-news/4297577/posts",
    "timestamp": "2025-02-14T15:20:13Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system",
    "link": "https://abcnews.go.com/US/wireStory/treasury-watchdog-begins-audit-musk-doge-teams-access-118825447",
    "timestamp": "2025-02-14T15:18:29Z"
  },
  {
    "title": "JD Vance: Everything We Do Should be to Defend Democracy, But Europe is Abandoning Shared Values",
    "description": "America finds Europe's retreat from shared values as the continent turns away from democracy and towards censorship \"shocking\", Vance said.\nThe post JD Vance: Everything We Do Should be to Defend Democracy, But Europe is Abandoning Shared Values appeared firs…",
    "link": "https://www.breitbart.com/europe/2025/02/14/jd-vance-tells-europe-threat-from-within-greatest-risk-to-continent/",
    "timestamp": "2025-02-14T15:18:18Z"
  },
  {
    "title": "Penny Hunters Eye Profit From Trump Coin Attack With Melting Bet",
    "description": "Adam Youngs is looking to make a lot from truckloads of the little red cent.",
    "link": "https://financialpost.com/pmn/business-pmn/penny-hunters-eye-profit-from-trump-coin-attack-with-melting-bet",
    "timestamp": "2025-02-14T15:16:22Z"
  },
  {
    "title": "Joe Rogan Says He Would Have ‘Held’ Kamala Harris’s ‘Hand’ and Been ‘Nice’ In Scrapped Interview, But ‘They Got Scared’",
    "description": "Joe Rogan accused Kamala Harris's campaign of lying to cover up the fact that they \"got scared\" of an interview between the podcaster and former vice president.\nThe post Joe Rogan Says He Would Have ‘Held’ Kamala Harris’s ‘Hand’ and Been ‘Nice’ In Scrapped In…",
    "link": "https://www.mediaite.com/politics/joe-rogan-says-he-would-have-held-kamala-harriss-hand-and-been-nice-in-scrapped-interview-but-they-got-scared/",
    "timestamp": "2025-02-14T15:16:14Z"
  },
  {
    "title": "Europe Can't Assume US Troop \"Will Last Forever\": Defence Secretary",
    "description": "US Defense Secretary Pete Hegseth on Friday warned NATO allies in Europe against assuming that the American troop presence on the continent would &quot;last forever&quot;, as he urged them to spend more on defence.",
    "link": "https://www.ndtv.com/world-news/europe-cant-assume-us-troop-will-last-forever-defence-secretary-pete-hegseth-7711824",
    "timestamp": "2025-02-14T15:16:12Z"
  },
  {
    "title": "Exclusive: Rep. Claudia Tenney Unveils Bill to Designate Trump’s Birthday, Flag Day as Public Holiday",
    "description": "Tenney proposed the Trump’s Birthday and Flag Day Holiday Establishment Act, a bill that would recognize both Trump’s birthday and Flag Day as a legal public holiday on June 14. The New York congresswoman said in a statement to Breitbart News that Trump, as t…",
    "link": "https://freerepublic.com/focus/f-news/4297576/posts",
    "timestamp": "2025-02-14T15:15:41Z"
  },
  {
    "title": "READ: Donald Trump’s official reciprocal tariff announcement",
    "description": "U.S. President Donald Trump announced reciprocal tariffs against some of its biggest trading partners. Read the announcement here.",
    "link": "https://financialpost.com/news/donald-trump-official-reciprocal-tariff-announcement",
    "timestamp": "2025-02-14T15:14:50Z"
  },
  {
    "title": "Treasury Watchdog Begins Audit Of DOGE’s Access To Government's Payment System",
    "description": "The audit will also review the past two years of the system's transactions as it relates to Elon Musk's assertion of “alleged fraudulent payments.\"",
    "link": "https://www.huffpost.com/entry/treasury-watchdog-begins-audit-of-doges-access-to-governments-payment-system_n_67af5bade4b0b48674491ead",
    "timestamp": "2025-02-14T15:14:01Z"
  },
  {
    "title": "'The damage is already done': Why Ken Griffin thinks Trump's tariffs are chipping away at American exceptionalism",
    "description": "The Citadel founder says that the US will lose out on international trade and the AI arms race as a result.",
    "link": "https://www.businessinsider.com/ken-griffin-trump-tariffs-american-exceptionalism-energy-china-deepseek-tech-2025-2",
    "timestamp": "2025-02-14T15:13:32Z"
  },
  {
    "title": "Trump’s Border Czar Is Already Threatening Eric Adams to Comply",
    "description": "Donald Trump’s administration is already holding the threat of prosecution over its newest puppet: New York City Mayor Eric Adams. \r\nAs Donald Trump’s so-called border czar Tom Homan sat on the couch next to Adams on Fox & Friends Friday morning, he joked tha…",
    "link": "https://newrepublic.com/post/191548/donald-trump-border-czar-eric-adams-immigration",
    "timestamp": "2025-02-14T15:12:59Z"
  },
  {
    "title": "This Valentine’s Day, Let’s Ditch Romance Myths and Seek Collective Liberation",
    "description": "In this frightening time, let’s dedicate ourselves to true love and liberation, caring for each other and the world.",
    "link": "https://truthout.org/articles/this-valentines-day-lets-ditch-romance-myths-and-seek-collective-liberation/",
    "timestamp": "2025-02-14T15:12:58Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, and Nasdaq slip as Tesla, Apple, and major stocks struggle amid tariff fears and weak retail sales",
    "description": "Stock Market Today saw Dow Jones, S&P 500, and Nasdaq futures decline as investors reacted to new tariff concerns and weak retail sales data. Tesla, Apple, and other major stocks faced pressure, while Airbnb and Roku saw gains. Global markets showed mixed tre…",
    "link": "https://economictimes.indiatimes.com/news/international/us/stock-market-today-dow-sp-500-and-nasdaq-slip-as-tesla-apple-and-major-stocks-struggle-amid-tariff-fears-and-weak-retail-sales/articleshow/118253024.cms",
    "timestamp": "2025-02-14T15:12:28Z"
  },
  {
    "title": "Historian Warns If AP Doesn’t Keep Wrongly Calling Body Of Water Gulf Of Mexico, US May Slide Into Authoritarianism",
    "description": "'Terribly slippery slope'",
    "link": "https://dailycaller.com/2025/02/14/historian-katie-couric-ap-writing-gulf-of-america-authoritarianism/",
    "timestamp": "2025-02-14T15:12:04Z"
  },
  {
    "title": "Saudi Arabia and the UAE vie to become Ukraine peace summit destinations",
    "description": "The News\nSaudi Arabia and the UAE are positioning themselves to host talks aimed at ending the Ukraine war as US President Donald Trump pushes for a resolution. \nTrump has signaled Saudi Arabia as a likely venue to meet Russian President Vladimir Putin, citin…",
    "link": "https://biztoc.com/x/4302c3af0217d54a",
    "timestamp": "2025-02-14T15:12:01Z"
  },
  {
    "title": "Left in the lurch: Asylum seekers respond to Trump’s CBP One cancellation",
    "description": "US president dissolves the app migrants use for asylum appointments. Some say that has left them in a dangerous limbo.",
    "link": "https://www.aljazeera.com/features/longform/2025/2/14/left-in-the-lurch-asylum-seekers-respond-to-trumps-cbp-one-cancellation",
    "timestamp": "2025-02-14T15:11:34Z"
  },
  {
    "title": "Trump Calls for Denuclearization Talks With Russia and China",
    "description": "Speaking to reporters in the Oval Office Thursday, President Donald Trump called for denuclearization talks with Russia and China, and said he trusts Russian President Vladimir Putin wants peace with Ukraine.\nSpeaking during an executive order signing on reci…",
    "link": "https://biztoc.com/x/a3236b5269006726",
    "timestamp": "2025-02-14T15:11:22Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system. That's after Democratic senators raised red flags about the access provided to Trump aide Elon Musk’s Depa…",
    "link": "https://www.seattlepi.com/business/article/treasury-watchdog-begins-audit-of-musk-doge-20167582.php",
    "timestamp": "2025-02-14T15:11:02Z"
  },
  {
    "title": "Pentagon’s Liberal Agenda Is Already Taking A Massive Beating",
    "description": "Left-wing initiatives in the military are quickly being eradicated as Donald Trump and Pete Hegseth cleaned house in the first months of the administration.",
    "link": "https://dailycaller.com/2025/02/14/pentagons-liberal-agenda-donald-trump-pete-hegseth-massive-beating/",
    "timestamp": "2025-02-14T15:10:57Z"
  },
  {
    "title": "Feel The Love: Trump 2.0 Is Making America The World’s Valentine",
    "description": "DEI is dying. Elon Musk is DOGEing. And America is reclaiming its borders and its rightful position as respected world leader.",
    "link": "https://thefederalist.com/2025/02/14/feel-the-love-trump-2-0-is-making-america-the-worlds-valentine/",
    "timestamp": "2025-02-14T15:10:48Z"
  }
]