[
  {
    "title": "DAVID MARCUS: These 3 are auditioning to be Democrats' next George Floyd",
    "description": "Columnist David Marcus writes that the Democrats are desperate for a new martyr/hero, and have settled on an alleged teenage killer, a man accused of gunning down a healthcare executive and a reputed MS-13 gang member.",
    "link": "https://www.foxnews.com/opinion/david-marcus-3-auditioning-democrats-next-george-floyd",
    "timestamp": "2025-04-21T14:33:37Z"
  },
  {
    "title": "The 'sell America' trade is roaring in markets as Trump butts heads with the Fed",
    "description": "Stocks, bonds, and the dollar tumbled sharply on Monday as investors digested fresh criticisms from Trump of Fed chair Jerome Powell.",
    "link": "https://www.businessinsider.com/stock-market-today-selloff-sell-america-trump-fed-independence-bonds-2025-4",
    "timestamp": "2025-04-21T14:33:31Z"
  },
  {
    "title": "Pope Francis — Who Was Known For Speaking Out Against Social Injustice — Has Died",
    "description": "The first Latin American pope, known for speaking out against social injustice, leaves behind a complicated legacy.View Entire Post ›",
    "link": "https://www.huffpost.com/entry/pope-francis-dead_n_578d67afe4b0fa896c3fbc73",
    "timestamp": "2025-04-21T14:33:16Z"
  },
  {
    "title": "WH says Trump supports Hegseth, claims ‘entire Pentagon’ working against defense secretary after second Signal chat revealed",
    "description": "\"What a big surprise that a few leakers get fired and suddenly a bunch of hit pieces come out,\" the defense secretary told reporters Monday.",
    "link": "https://nypost.com/2025/04/21/us-news/wh-says-trump-supports-hegseth-claims-entire-pentagon-working-against-defense-secretary-after-second-signal-chat-revealed/",
    "timestamp": "2025-04-21T14:31:37Z"
  },
  {
    "title": "Trump’s Tariffs Won’t Bring Back Manufacturing Jobs",
    "description": "Despite his commerce secretary's rose-tinted talk about millions of Americans “screwing in little screws to make iPhones,” US President Donald Trump’s import tariffs will not revive US manufacturing employment. They will do the opposite, while also raising co…",
    "link": "https://www.project-syndicate.org/commentary/trump-tariffs-will-not-bring-back-manufacturing-jobs-us-by-michael-r-strain-2025-04",
    "timestamp": "2025-04-21T14:30:48Z"
  },
  {
    "title": "Questions About How a Deputy’s Stepson Became the Accused Gunman at FSU Shooting",
    "description": "TALLAHASSEE, Fla. (AP) — Amid the abandoned chemistry notes and other debris left behind after a deadly shooting at Florida State University are lingering questions about how the stepson of a beloved sheriff’s deputy tasked with school safety at a …",
    "link": "https://www.insurancejournal.com/news/southeast/2025/04/21/820562.htm",
    "timestamp": "2025-04-21T14:30:04Z"
  },
  {
    "title": "Here’s how South Florida condo developers are prepping for tariffs",
    "description": "The sudden panic resulting from President Donald Trump’s tariffs has subsided, and despite his 90-day pause on country-specific duties, fees on steel, aluminum, lumber and other materials remain in effect.  That includes a universal 10 percent tariff on all g…",
    "link": "https://therealdeal.com/miami/2025/04/21/south-florida-condo-developers-on-tariff-uncertainty/",
    "timestamp": "2025-04-21T14:30:00Z"
  },
  {
    "title": "Did Trump share a fake photo of deported Kilmar Abrego Garcia's MS-13 tattoo? Here's the shocking truth",
    "description": "Social media users are accusing President Donald Trump of photoshopping an image he posted of a tattoo on deported dad Kilmar Abrego Garcia’s hand that the president argued represented the MS-13 gang. Trump has defied orders from a federal court and the Supre…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/did-trump-share-a-fake-photo-of-deported-kilmar-abrego-garcias-ms-13-tattoo-heres-the-shocking-truth/articleshow/120490488.cms",
    "timestamp": "2025-04-21T14:28:22Z"
  },
  {
    "title": "Gold surges to a record above $3,400 as Trump threatens Fed independence",
    "description": "Gold prices broke $3,400 on Monday, hitting a new record as President Donald Trump's threats against the Federal Reserve's independence and his tariffs shake investor confidence in the U.S. economy.\nGold futures jumped 3.15% to $3,433.10 per ounce by 9:56 a.m…",
    "link": "https://biztoc.com/x/207d34e3460aaf1a",
    "timestamp": "2025-04-21T14:27:14Z"
  },
  {
    "title": "Trump Warns US Economy Could Slow If Powell Doesn’t Cut Rates",
    "description": "President Donald Trump warned the US economy may slow if the Federal Reserve does not move to immediately reduce interest rates, in his latest broadside against Federal Reserve Chairman Jerome Powell.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-warns-us-economy-could-slow-if-powell-doesnt-cut-rates",
    "timestamp": "2025-04-21T14:26:49Z"
  },
  {
    "title": "The World’s Most Prolific Retro Handheld Maker Just Stopped U.S. Shipments",
    "description": "Customers based in the U.S. may have to spend boatloads on handhelds that once cost just $50.",
    "link": "https://gizmodo.com/the-worlds-most-prolific-retro-handheld-maker-just-stopped-u-s-shipments-2000592110",
    "timestamp": "2025-04-21T14:26:09Z"
  },
  {
    "title": "Israel’s special relationship with the US on display as Huckabee presents credentials",
    "description": "Herzog lauded Huckabee’s commitment to the return of the hostages and the safety and security of Israel’s citizens.",
    "link": "https://www.jpost.com/israel-news/article-850934",
    "timestamp": "2025-04-21T14:23:45Z"
  },
  {
    "title": "Trump Somehow Manages to Make Easter All About Himself",
    "description": "In the spirit of Easter, Donald Trump spent Sunday ranting on Truth Social, attacking judges, the left, and former President Joe Biden.\r\nHis first Easter address began normally enough, wishing Americans a “very happy Easter” and a day “full of Peace and Joy f…",
    "link": "https://newrepublic.com/post/194186/donald-trump-easter-rant-joe-biden",
    "timestamp": "2025-04-21T14:23:03Z"
  },
  {
    "title": "Motorola Solutions Launches AI Tool, New Device to Cut Emergency Response Time",
    "description": "Motorola Solutions on Monday launched a new device called the SVX to help first responders seeking ways to save time and react to emergencies. With this, the company is aiming to build on its dominant position in the public safety market with more than 60 per…",
    "link": "https://www.gadgets360.com/ai/news/motorola-solutions-launch-ai-tool-new-devices-cut-emergency-response-team-8219871",
    "timestamp": "2025-04-21T14:22:43Z"
  },
  {
    "title": "Hair is everywhere in 2025 fashion trends",
    "description": "Fashion is getting a whole lot hairier — with hair, yes the stuff that grows from your head, suddenly being used as a material in fashion trends from earrings to bags and even dresses, writes Kaleigh Werner",
    "link": "https://www.the-independent.com/life-style/fashion/2025-trends-fashion-hair-b2736782.html",
    "timestamp": "2025-04-21T14:21:45Z"
  },
  {
    "title": "White House Easter Egg Roll Presented With Corporate Sponsorship",
    "description": "Big tech firms were among the numerous companies sponsoring activities on the White House grounds.",
    "link": "https://www.adweek.com/brand-marketing/white-house-easter-egg-roll-presented-with-corporate-sponsorship/",
    "timestamp": "2025-04-21T14:21:43Z"
  },
  {
    "title": "Bitcoin longs cut $106M — Are Bitfinex BTC whales turning bearish above $86K?",
    "description": "Despite Bitcoin (BTC) price reaching its highest level in over three weeks, traders on Bitfinex reduced their leveraged long (bullish) positions on margin contracts by more than $100 million between April 17 and April 19. This reduction has led to speculation…",
    "link": "https://cointelegraph.com/news/bitcoin-longs-106m-bitfinex-btc-whales-bearish-86k",
    "timestamp": "2025-04-21T14:21:28Z"
  },
  {
    "title": "Trump: 'Loser' Jerome Powell waiting too long to cut rates",
    "description": "President Donald Trump again reiterated his criticism of Fed Chair Jerome Powell as he called for lower interest rates.",
    "link": "https://www.nbcnews.com/business/economy/trump-taunts-jerome-powell-waiting-long-cut-rates-rcna202123",
    "timestamp": "2025-04-21T14:20:59Z"
  },
  {
    "title": "Trump risks leaving behind a legacy of failure in Ukraine",
    "description": "If the US president does not change his strategy, he will fail as a peacemaker and an ally.",
    "link": "https://www.aljazeera.com/opinions/2025/4/21/trump-risks-leaving-behind-a-legacy-of-failure-in-ukraine",
    "timestamp": "2025-04-21T14:19:53Z"
  },
  {
    "title": "American Restrictions On Investing In China Could Increase Soon",
    "description": "New outbound investment restrictions could be unveiled by the Trump administration soon, as part of its growing economic conflict with China.",
    "link": "https://www.forbes.com/sites/owentedford/2025/04/21/american-restrictions-on-investing-in-china-could-increase-soon/",
    "timestamp": "2025-04-21T14:18:32Z"
  },
  {
    "title": "WATCH LIVE: Trumps host the 2025 White House Easter Egg Roll",
    "description": "Children will try to guide colorfully dyed hard-boiled eggs across a patch of lawn to a finish line.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trumps-host-the-2025-white-house-easter-egg-roll",
    "timestamp": "2025-04-21T14:18:27Z"
  },
  {
    "title": "Stocks tumble and dollar hits three-year low as Trump bashes Powell again | CNN Business",
    "description": "US stocks ended the day sharply lower Monday and the dollar tumbled as investors assessed continued tariff uncertainty and the implications of President Donald Trump’s ongoing mission to try and oust Federal Reserve Chair Jerome Powell.",
    "link": "https://www.cnn.com/2025/04/21/investing/us-stock-market/index.html",
    "timestamp": "2025-04-21T14:18:15Z"
  },
  {
    "title": "The Great Consternation",
    "description": "“Due process is when only one side has to follow the law and if you point out that this is a suicidal standard you’re a fascist” — Auron MacIntyre. A great consternation boils and bubbles across the land as the sinister forces of Jacobin lawfare keep up their…",
    "link": "https://freerepublic.com/focus/f-chat/4312314/posts",
    "timestamp": "2025-04-21T14:17:44Z"
  },
  {
    "title": "Turns Out It Wasn’t Such a Great Idea to Put Pete Hegseth in Charge of the Military",
    "description": "Defense Secretary Pete Hegseth's tenure atop the Pentagon has been riddled with scandal and internal chaos. He blamed the media on Monday.",
    "link": "http://www.rollingstone.com/politics/politics-news/pete-hegseth-melts-down-pentagon-dysfunction-1235321711/",
    "timestamp": "2025-04-21T14:17:12Z"
  },
  {
    "title": "Vance Sends Condolences to Christians After Pope's Passing",
    "description": "Vice President JD Vance sent his condolences to Christians around the world after the passing of Pope Francis on Easter Monday.\nThe post Vance Sends Condolences to Christians After Pope’s Passing appeared first on Breitbart.",
    "link": "https://www.breitbart.com/faith/2025/04/21/vance-sends-condolences-to-christians-after-popes-passing/",
    "timestamp": "2025-04-21T14:16:43Z"
  },
  {
    "title": "Govt continues intensive coordination on Trump tariffs",
    "description": "State Secretary Minister Prasetyo Hadi said that the Indonesian government is continuing to pursue intensive coordination on the tariffs policy of United ...",
    "link": "https://en.antaranews.com/news/352445/govt-continues-intensive-coordination-on-trump-tariffs",
    "timestamp": "2025-04-21T14:16:31Z"
  },
  {
    "title": "‘Major loser’: Trump unleashes on his own Federal Reserve chairman",
    "description": "'With these costs trending so nicely downward, just what I predicted they would do, there can almost be no inflation, but there can be a SLOWING of the economy'",
    "link": "https://www.wnd.com/2025/04/major-loser-trump-unleashes-on-his-own-federal-reserve-chairman/",
    "timestamp": "2025-04-21T14:16:12Z"
  },
  {
    "title": "Trump Pressures Fed To Cut Rates, Says Inflation Is Over",
    "description": "President Donald Trump renewed pressure on the Federal Reserve on Monday, calling for “preemptive cuts” to interest rates amid what he claims is a clear drop in inflation. In a post on Truth Social, Trump cited falling energy and food costs—mocking “Biden’s e…",
    "link": "https://biztoc.com/x/78049e5b1a1a74e0",
    "timestamp": "2025-04-21T14:15:49Z"
  },
  {
    "title": "Nearly 3 million extra deaths by 2030 could result from HIV funding cuts, study suggests",
    "description": "A modeling study looked at how anticipated cuts to international HIV funding would affect the rate of new cases and HIV-related deaths in low- and middle-income countries.",
    "link": "https://www.livescience.com/health/hiv/nearly-3-million-extra-deaths-by-2030-could-result-from-hiv-funding-cuts-study-suggests",
    "timestamp": "2025-04-21T14:15:00Z"
  },
  {
    "title": "PM Modi meets US Vice President Vance, holds talks",
    "description": "US Vice President JD Vance met with Prime Minister Narendra Modi in Delhi on April 21 to discuss strengthening the India-US strategic partnership and addressing trade policy concerns. This visit, the first by a sitting US vice president in 12 years, occurs as…",
    "link": "https://economictimes.indiatimes.com/news/india/pm-modi-meets-us-vice-president-vance/articleshow/120490123.cms",
    "timestamp": "2025-04-21T14:14:57Z"
  },
  {
    "title": "Stocks Slide Further As Wall Street Shudders At Ongoing Trade War And Trump’s Attacks On Powell",
    "description": "Trump’s headbutting with Fed Chairman Jerome Powell should be “taken very seriously and very negatively,” said one strategist, as Trump slammed the central banker as a “major loser.”",
    "link": "https://www.forbes.com/sites/dereksaul/2025/04/21/stocks-slide-further-as-wall-street-shudders-at-ongoing-trade-war-and-trumps-attacks-on-powell/",
    "timestamp": "2025-04-21T14:13:01Z"
  },
  {
    "title": "Who Is Cardinal Raymond Burke, Donald Trump's Preferred Candidate To Succeed Pope Francis",
    "description": "Cardinal Raymond Burke is one of the figures considered as a potential successor of Pope Francis as the process to elect a new pontiff gets underway",
    "link": "https://www.ibtimes.com/who-cardinal-raymond-burke-donald-trumps-preferred-candidate-succeed-pope-francis-3770790",
    "timestamp": "2025-04-21T14:13:00Z"
  },
  {
    "title": "Trump honors Pope Francis: \"May God bless him and all who loved him\"",
    "description": "President Trump released a statement after the Vatican announced Pope Francis' death on Monday.",
    "link": "https://www.cbsnews.com/news/pope-francis-death-trump-statement/",
    "timestamp": "2025-04-21T14:11:43Z"
  },
  {
    "title": "Kremlin says US position ruling out NATO membership for Ukraine gives satisfaction",
    "description": "The Kremlin said on Monday that the position of US President Donald Trump's administration on ruling out NATO membership for Ukraine gave Moscow satisfaction, but declined to comment on Trump's hopes for deal this week. US envoy General Keith Kellogg said on …",
    "link": "https://freerepublic.com/focus/f-chat/4312313/posts",
    "timestamp": "2025-04-21T14:10:39Z"
  },
  {
    "title": "US stocks sink with the US dollar's value as investors retreat further from the United States",
    "description": "U.S. stocks are sinking Monday as investors pull away from the United States because of the uncertainty caused by President Donald Trump's trade war and his criticism of the Federal Reserve.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-sink-with-the-us-dollars-value-as-investors-retreat-further-from-the-united-states/articleshow/120489955.cms",
    "timestamp": "2025-04-21T14:10:35Z"
  },
  {
    "title": "The Radical Left’s Plan to Stop Trump and His Agenda",
    "description": "After losing the election in November, the Democrats devised a game plan to stop the implementation of President Donald Trump’s agenda. Since Democrats no longer controlled Congress or the White House, they decided to focus on the judiciary. Consequently, 23 …",
    "link": "https://freerepublic.com/focus/f-chat/4312312/posts",
    "timestamp": "2025-04-21T14:10:33Z"
  },
  {
    "title": "Trump Officials Trolling Journalists Is Just the Tip of the Iceberg",
    "description": "When The Atlantic’s editor-in-chief Jeffrey Goldberg revealed last month that he had inadvertently been invited into a Signal group chat of senior U.S. national security officials, the news dominated headlines, cable broadcasts and social media for several da…",
    "link": "https://msmagazine.com/2025/04/21/trump-musk-vance-journalists-online-abuse/",
    "timestamp": "2025-04-21T14:10:13Z"
  },
  {
    "title": "The House Freedom Caucus and the 10-Year Battle Between 'Yes' and 'No' (NOTUS)",
    "description": "NOTUS:\nThe House Freedom Caucus and the 10-Year Battle Between ‘Yes’ and ‘No’  —  What started a decade ago as a conservative organization focused on principles and fixing the legislative process has morphed into a group primarily focused on supporting Donald…",
    "link": "https://www.memeorandum.com/250421/p33",
    "timestamp": "2025-04-21T14:10:00Z"
  },
  {
    "title": "In Kansas City, DOGE cuts are hitting hard",
    "description": "KANSAS CITY, Mo. — In her 28 years working for the federal government, Shea Giagnorio provided day care for the children of U.S. soldiers, training for employees and oversight for safety net programs.",
    "link": "https://www.nbcnews.com/business/economy/kansas-city-doge-cuts-are-hitting-hard-rcna202112",
    "timestamp": "2025-04-21T14:09:37Z"
  },
  {
    "title": "Why GDP per capita doesn’t measure Canada’s true economic health",
    "description": "GDP per capita distorts Canada’s economic story. Population growth and inequality skew the numbers – and the policy conversation.",
    "link": "https://policyoptions.irpp.org/magazines/april-2025/numerator-denominator/",
    "timestamp": "2025-04-21T14:09:07Z"
  },
  {
    "title": "White House Says Donald Trump “Stands Strongly” Behind Pete Hegseth Amid New Signal Chat Report, Pentagon Tumult",
    "description": "White House Press Secretary Karoline Leavitt said that President Donald Trump “stands strongly” behind Defense Secretary Pete Hegseth, even amid a new bombshell report and a scathing op ed from a former top Pentagon spokesperson. “This is what happens when th…",
    "link": "http://deadline.com/2025/04/pete-hegseth-trump-signal-chat-1236372777/",
    "timestamp": "2025-04-21T14:06:10Z"
  },
  {
    "title": "Trump ramps up attacks on Powell, demands 'loser' Fed chair lower rates 'NOW'",
    "description": "President Donald Trump ratcheted up his pressure campaign on Federal Reserve Chairman Jerome Powell.",
    "link": "https://biztoc.com/x/257077ac4e3a063a",
    "timestamp": "2025-04-21T14:05:16Z"
  },
  {
    "title": "Trump Broke His Own Inauguration Fundraising Record—by a Long Shot",
    "description": "Donald Trump made nearly $240 million off of inauguration donations from billionaires and corporations eager to kiss the ring. \r\nThe New York Times reported that this round of donations is more than double the already record-setting amount of money that Trump…",
    "link": "https://newrepublic.com/post/194184/trump-inauguration-fundraising-record",
    "timestamp": "2025-04-21T14:04:30Z"
  },
  {
    "title": "Synchronized move: Dollar nosedives on Jerome Powell ouster buzz, triggering gold’s historic surge and a sudden Bitcoin boom investors didn’t see coming",
    "description": "The US dollar plummeted to a three-year low amid speculation that President Trump might remove Federal Reserve Chairman Jerome Powell. Hedge funds are reportedly dumping the dollar, triggering rallies in the euro and yen. Gold surged to a record high, while B…",
    "link": "https://economictimes.indiatimes.com/news/international/us/synchronized-move-dollar-nosedives-on-jerome-powell-ouster-buzz-triggering-golds-historic-surge-and-a-sudden-bitcoin-boom-investors-didnt-see-coming/articleshow/120488144.cms",
    "timestamp": "2025-04-21T14:04:12Z"
  },
  {
    "title": "Who Will Pay for The Damage That DOGE Has Done to Our Veterans?",
    "description": "Trump and Musk have fired veterans throughout the government and plan to cut 80,000 jobs at the Department of Veterans Affairs. It’s not saving money.",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-musk-veterans-doge-damage-health-jobs-1235321600/",
    "timestamp": "2025-04-21T14:01:26Z"
  },
  {
    "title": "Earth Day Is Tuesday, April 22—Why Does the U.S. Celebrate the Holiday?",
    "description": "Here's why the U.S. celebrates Earth Day on April 22, and how.",
    "link": "https://www.newsweek.com/earth-day-april-2025-why-celebrate-us-trump-2061532",
    "timestamp": "2025-04-21T14:00:02Z"
  },
  {
    "title": "China’s Oil Supertankers Face $5.2-Million Fee per U.S. Port Call",
    "description": "The U.S. move to penalize China-built and China-owned vessels calling at U.S. ports could lead to an oil supertanker made in China and operated by a Chinese company facing a fee of up to $5.2 million per call at a U.S. port, shipbrokers have estimated. The U.…",
    "link": "https://oilprice.com/Energy/Energy-General/Chinas-Oil-Supertankers-Face-52-Million-Fee-per-US-Port-Call.html",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "The Rise of Medical Fascism",
    "description": "Eric Reinhart\n\n\n\nThe US medical profession’s long history of complicity with state violence has prepared it for compliance with Trump’s authoritarian orders.\r\n\n\r\n\n\nThe post The Rise of Medical Fascism appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/medical-fascism/",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "US Congress members visit El Salvador to facilitate release of deported man",
    "description": "(Reuters) - Four Democratic U.S. representatives arrived in El Salvador on Monday hoping to compel the Trump administration to release Kilmar Abrego Garcia, a Salvadoran man mistakenly deported and now held in a notorious prison in that country. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/04/21/us-congress-members-visit-el-salvador-to-facilitate-release-of-deported-man",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "Lafayette 148’s Deirdre Quinn Speaks Out About the U.S.-China Tariff Situation Threatening Her Business",
    "description": "Tariffs on her collection that she imports from China have gone from $2 million to $33 million.",
    "link": "http://wwd.com/business-news/retail/deirdre-quinn-speaks-out-the-u-s-china-tariff-situation-threatening-29-year-old-business-1237093845/",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "Trump’s Trade War Has Denim Manufacturers at a Standstill",
    "description": "Tariffs created confusion and uncertainty last week at Kingpins Amsterdam.",
    "link": "https://sourcingjournal.com/denim/denim-mills/kingpins-amsterdam-trump-tariffs-denim-manufacturers-1234744945/",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "Oil Traders Lurch From Praying for Volatility to Drowning in It",
    "description": "Until recently, oil traders complained that it was almost impossible to wring profits out of a listless and rangebound crude market.",
    "link": "https://www.rigzone.com/news/wire/oil_traders_lurch_from_praying_for_volatility_to_drowning_in_it-21-apr-2025-180288-article/",
    "timestamp": "2025-04-21T14:00:00Z"
  },
  {
    "title": "Taxes On Super Rich And Tech Giants Stall Under Trump",
    "description": "Global tax plans targeting billionaires and multinational companies are running aground, with the United States torpedoing reforms under President Donald Trump.",
    "link": "https://www.ibtimes.com.au/taxes-super-rich-tech-giants-stall-under-trump-1858084",
    "timestamp": "2025-04-21T13:59:16Z"
  },
  {
    "title": "Trump In His Own Words: 100 Days Of Quotes",
    "description": "Donald Trump's first 100 days back in the US presidency have showcased his unique ability to shock -- and sometimes entertain -- with outrageous remarks that pull no punches.",
    "link": "https://www.ibtimes.com.au/trump-his-own-words-100-days-quotes-1858079",
    "timestamp": "2025-04-21T13:59:12Z"
  },
  {
    "title": "US Defense Chief Shared Sensitive Information In Second Signal Chat: US Media",
    "description": "US Defense Secretary Pete Hegseth shared information on forthcoming US air strikes on Yemen in a private Signal chat group that included his wife, brother and personal lawyer, the New York Times and CNN reported on Sunday.",
    "link": "https://www.ibtimes.com.au/us-defense-chief-shared-sensitive-information-second-signal-chat-us-media-1858076",
    "timestamp": "2025-04-21T13:59:10Z"
  },
  {
    "title": "Vance Lands In India For Tough Talks On Trade",
    "description": "US Vice President JD Vance began a four-day visit to India on Monday as New Delhi looks to seal an early trade deal and stave off punishing US tariffs.",
    "link": "https://www.ibtimes.com.au/vance-lands-india-tough-talks-trade-1858074",
    "timestamp": "2025-04-21T13:59:06Z"
  },
  {
    "title": "‘It’s So Ridiculous’: Bill Maher And Charlie Kirk Torch Dems Over Wildly Unpopular Stance On Trans Athletes",
    "description": "Bill Maher and Charlie Kirk agreed that Democrats will continue to lose if they refuse to oppose biological men competing in women's sports.",
    "link": "https://dailycaller.com/2025/04/21/its-so-ridiculous-bill-maher-and-charlie-kirk-torch-dems-over-wildly-unpopular-stance-on-trans-athletes/",
    "timestamp": "2025-04-21T13:56:33Z"
  },
  {
    "title": "JD Vance Breaks Silence On Meeting With Pope Francis Hours Before His Death",
    "description": "Pope Francis made it known he disagreed with Vance and the Trump administration's policies on immigration.",
    "link": "https://www.huffpost.com/entry/pope-francis-dead-jd-vance_n_68063e61e4b02ca6f7ee3ee4",
    "timestamp": "2025-04-21T13:56:12Z"
  },
  {
    "title": "Pope Francis Remembered By Whoopi Goldberg, Russell Crowe, JD Vance, Donald Trump And Others",
    "description": "Refresh for updates…Whoopi Goldberg, Russell Crowe and Patti Smith were among the first from the entertainment community to pay tribute to Pope Francis after the leader of the Catholic Church died today, Easter Monday, at 7:35 a.m. Unwell for some time, he re…",
    "link": "http://deadline.com/2025/04/pope-francis-celebrity-tributes-1236372774/",
    "timestamp": "2025-04-21T13:54:59Z"
  },
  {
    "title": "Trump: Powell cut rates to help Biden, Harris win",
    "description": "United States President Donald Trump claimed on Monday that Federal Reserve Jerome Powell always acted \"too late\" on lowering the bank's benchmark interest rate except when then-head of state Joe Bide...",
    "link": "https://biztoc.com/x/a262ee198a4eb159",
    "timestamp": "2025-04-21T13:54:03Z"
  },
  {
    "title": "Stocks open lower on Wall Street as worries linger over trade war and Trump-Powell rift",
    "description": "U.S. stocks are falling as investors worldwide pull away from the United States because of the uncertainty caused by President Donald Trump’s trade war. The S&P 500 was 1% lower in early trading Monday and 14.9% below its record set two months ago.\nThe Dow Jo…",
    "link": "https://biztoc.com/x/8310992be4e490f5",
    "timestamp": "2025-04-21T13:54:03Z"
  },
  {
    "title": "Volvo Fires People as Tariffs Bite",
    "description": "American car companies have told Donald Trump that tariffs on cars and car parts will wreck their bottom lines. Ford just told its dealers it will almost certainly raise prices in June to offset the increase in their expenses because of tariffs. Jaguar and La…",
    "link": "https://biztoc.com/x/863e37c68375c249",
    "timestamp": "2025-04-21T13:54:00Z"
  },
  {
    "title": "Dow slides 500 pts at open with Trump policies in spotlight",
    "description": "Major stock exchanges on Wall Street traded deep in the red territory on Monday after an extended Easter weekend, as United States President Donald Trump's remarks remained at the center of attention....",
    "link": "https://biztoc.com/x/a44d27d5c5207868",
    "timestamp": "2025-04-21T13:53:57Z"
  },
  {
    "title": "'A Beacon of Compassion': World Leaders Honor Pope Francis",
    "description": "Heads of state and religious leaders around the world offered condolences and messages honoring Pope Francis following the announcement of his passing on Monday, honoring him as compassionate, warm, and a \"moral beacon\" in a divided world.\nThe post ‘A Beacon …",
    "link": "https://www.breitbart.com/faith/2025/04/21/a-beacon-of-compassion-world-leaders-honor-pope-francis/",
    "timestamp": "2025-04-21T13:53:57Z"
  },
  {
    "title": "‘Dangerous Spin’: Dem Senator Torches Trump for Shredding the Constitution to Justify Deportations",
    "description": "Senator Chris Van Hollen (D-MD) torched President Donald Trump’s “dangerous” deportation “spin” and for “doing nothing to comply” with the Supreme Court ruling that the administration “facilitate” the return of deportee Kilmar Abrego Garcia, warning “fighting…",
    "link": "https://www.mediaite.com/tv/dangerous-spin-dem-senator-torches-trump-for-shredding-the-constitution-to-justify-deportations/",
    "timestamp": "2025-04-21T13:53:57Z"
  },
  {
    "title": "Following latest school shootings, Trump rejects calls for changes to gun policies",
    "description": "One of the biggest differences between Donald Trump's first term and his second: He no longer wants to even try to address deadly gun violence.",
    "link": "https://biztoc.com/x/e9ecbca5d4888df5",
    "timestamp": "2025-04-21T13:53:47Z"
  },
  {
    "title": "Trump ramps up attacks on Powell, demands 'loser' Fed chair lower rates 'NOW'",
    "description": "President Donald Trump ratcheted up his pressure campaign on Federal Reserve Chairman Jerome Powell.",
    "link": "https://www.cnbc.com/2025/04/21/trump-powell-attacks-interest-rates-fed.html",
    "timestamp": "2025-04-21T13:53:24Z"
  },
  {
    "title": "The Worst Job in America",
    "description": "Who would want to be president of an Ivy League school?",
    "link": "https://www.theatlantic.com/ideas/archive/2025/04/columbia-harvard-university-president/682526/",
    "timestamp": "2025-04-21T13:53:00Z"
  },
  {
    "title": "Is Pete Hegseth compromising national security? What Trump White House said amid Signal chat leak row",
    "description": "White House spokeswoman Karoline Leavitt affirmed President Trump's support for Defense Secretary Pete Hegseth amidst reports he shared details of a March attack on Yemen's Houthis via Signal. This marks the second instance of Hegseth using the app to share s…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/is-pete-hegseth-compromising-national-security-what-trump-white-house-said-amid-signal-chat-leak-row/articleshow/120489318.cms",
    "timestamp": "2025-04-21T13:52:12Z"
  },
  {
    "title": "Trump stands behind Hegseth after attack plans shared in second Signal chat, White House says",
    "description": "WASHINGTON (Reuters) - President Donald Trump stands behind U.S. Defense Secretary Pete Hegseth, White House spokeswoman Karoline Leavitt said on Monday, after reports that he shared details of a March attack on Yemen's Iran-aligned Houthis in a message group…",
    "link": "https://www.thestar.com.my/news/world/2025/04/21/trump-stands-behind-hegseth-after-attack-plans-shared-in-second-signal-chat-white-house-says",
    "timestamp": "2025-04-21T13:51:00Z"
  },
  {
    "title": "Nvidia stock slips as U.S. curbs backfire, boosting China’s chip ambitions",
    "description": "Nvidia (NVDA) stock fell almost 4% Monday morning as investors digested growing fallout from the Biden and Trump administrations’ efforts to curb the company’s chip sales to China. Read more...",
    "link": "https://qz.com/nvidia-nvda-stock-nasdaq-sp500-huawei-china-chips-1851777025",
    "timestamp": "2025-04-21T13:48:00Z"
  },
  {
    "title": "Stocks open lower on Wall Street as worries linger over trade war and Trump-Powell rift",
    "description": "U.S. stocks are falling as investors worldwide pull away from the U.S. because of uncertainty caused by President Donald Trump’s trade war.",
    "link": "https://www.bostonherald.com/2025/04/21/financial-markets-trump-powell-rift/",
    "timestamp": "2025-04-21T13:46:17Z"
  },
  {
    "title": "US stocks sink with the US dollar’s value as investors retreat further from the United States",
    "description": "U.S. stocks are falling as investors worldwide pull away from the U.S. because of uncertainty caused by President Donald Trump’s trade war.",
    "link": "https://www.denverpost.com/2025/04/21/financial-markets-trump-powell-rift/",
    "timestamp": "2025-04-21T13:46:17Z"
  },
  {
    "title": "‘The Republican Brand Could Collapse’: CNN’s Harry Enten Warns Trump Will Pay Steep Political Price on Economy",
    "description": "CNN’s senior data reporter Harry Enten joins Mediaite's Press Club to break down the polling for President Donald Trump, the Democratic Party, and Elon Musk.\nThe post ‘The Republican Brand Could Collapse’: CNN’s Harry Enten Warns Trump Will Pay Steep Politica…",
    "link": "https://www.mediaite.com/podcasts/the-republican-brand-could-collapse-cnns-harry-enten-warns-trump-will-pay-steep-political-price-on-economy/",
    "timestamp": "2025-04-21T13:45:04Z"
  },
  {
    "title": "'Too little too late': Supreme Court slammed for trying to corral 'unchecked' Trump",
    "description": "The U.S. Supreme Court issued a 7-2 ruling\r\n Saturday that orders the Trump\r\n Administration to temporarily cease the deportations\r\n of Venezuelan nationals using the Alien Enemies Act of 1798. The two dissenters\r\n were far-right GOP-appointed Justices Claren…",
    "link": "https://www.rawstory.com/too-little-too-late-supreme-court-slammed-for-trying-to-corral-trump-s-unchecked-cond/",
    "timestamp": "2025-04-21T13:43:34Z"
  },
  {
    "title": "How the House Freedom Caucus Changed",
    "description": "NOTUS: “What started a decade ago as a conservative organization focused on principles and fixing the legislative process has morphed into a group primarily focused on supporting Donald Trump.”",
    "link": "https://politicalwire.com/2025/04/21/how-the-house-freedom-caucus-changed-2/",
    "timestamp": "2025-04-21T13:40:59Z"
  },
  {
    "title": "White House rips alleged Pentagon leakers' 'shattered egos,' brushes off Hegseth second Signal chat report",
    "description": "The White House hit back at recent news reports detailing Secretary of Defense Pete Hegseth's reported involvement in a second Signal group chat, calling it a \"nonstory\" while also slamming recently fired Department of Defense staffers.",
    "link": "https://www.foxnews.com/politics/white-house-rips-alleged-pentagon-leakers-shattered-egos-brushes-off-hegseth-second-signal-chat-report",
    "timestamp": "2025-04-21T13:39:32Z"
  },
  {
    "title": "Trump's Lawlessness Comes From Seeds Planted by Bush-Cheney",
    "description": "In 2003, the Macedonian police arrested Khaled el-Masri, a German citizen vacationing in their country. They handed the unfortunate man over to the CIA, who shipped him off to one of their “black sites.” For those too young to remember (or who have quite unde…",
    "link": "https://tomdispatch.com/trump-harvests-autocratic-powers/",
    "timestamp": "2025-04-21T13:38:02Z"
  },
  {
    "title": "Following latest school shootings, Trump rejects calls for changes to gun policies",
    "description": "One of the biggest differences between Donald Trump's first term and his second: He no longer wants to even try to address deadly gun violence.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/latest-school-shootings-trump-rejects-calls-changes-gun-policies-rcna202105",
    "timestamp": "2025-04-21T13:36:14Z"
  },
  {
    "title": "Bitcoin Price Touches $87K for First Time Since Trump's Liberation Day",
    "description": "After Liberation Day, \"key market sentiment indicators such as the Fear & Greed Index and S&P 500 RSI(14) formed a bottom,\" an analyst told Decrypt.",
    "link": "https://decrypt.co/315608/bitcoin-price-87k-trump-liberation-day",
    "timestamp": "2025-04-21T13:36:09Z"
  },
  {
    "title": "Vance arrives in India for a 4-day visit that includes talks with Modi",
    "description": "Vance will meet Prime Minister Narendra Modi on the first day of his largely personal visit.",
    "link": "https://www.bostonherald.com/2025/04/21/jd-vance-visits-india-modi/",
    "timestamp": "2025-04-21T13:36:03Z"
  },
  {
    "title": "Donald Trump tariffs marginally favourable for Indian smartphone exports: Crisil",
    "description": "Going forward, there could be adverse effects, though. As tariffs push up inflation in the US, consumer spending on smartphone purchases could fall. As per data from the US International Trade Commission, the US imported the most number of smartphones from Ch…",
    "link": "https://economictimes.indiatimes.com/tech/technology/donald-trump-tariffs-marginally-favourable-for-indian-smartphone-exports-crisil/articleshow/120488651.cms",
    "timestamp": "2025-04-21T13:36:02Z"
  },
  {
    "title": "Dow falls 400 points at open, Nasdaq, S&P drop 1% as Trump takes aim at Fed's Powell",
    "description": "Wall Street's main indexes opened down on Monday after U.S. President Donald Trump's renewed attacks against Federal Reserve Chair Jerome Powell sparked concerns about the central bank's independence and rattled investors grappling with an escalating trade wa…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-falls-400-points-at-open-nasdaq-sp-drop-1-as-trump-takes-aim-at-powell/articleshow/120488745.cms",
    "timestamp": "2025-04-21T13:35:36Z"
  },
  {
    "title": "Trump advances plan to fill federal government with 'political cronies'",
    "description": "The largest federal labor union in the U.S. said Friday that tens of thousands of federal workers could soon \"have their jobs politicized\" and be swiftly fired under a new rule proposed by the Office of Personnel Management.Under the rule, an estimated 50,000…",
    "link": "https://www.rawstory.com/trump-advances-plan-to-fill-federal-government-with-political-cronies/",
    "timestamp": "2025-04-21T13:35:31Z"
  },
  {
    "title": "One of the things Trump hates the most is statistics and actual measurement data. Why? Because they make his lies more obvious than anything else ever could. When he says, \"I'm the greatest,\" with no data who can argue? [Obvious]",
    "description": "One of the things Trump hates the most is statistics and actual measurement data. Why? Because they make his lies more obvious than anything else ever could. When he says, \"I'm the greatest,\" with no data who can argue?",
    "link": "https://www.fark.com/comments/13642340/One-of-things-Trump-hates-most-is-statistics-actual-measurement-data-Why-Because-they-make-his-lies-more-obvious-than-anything-else-ever-could-When-he-says-Im-greatest-with-no-data-who-can-argue",
    "timestamp": "2025-04-21T13:34:07Z"
  },
  {
    "title": "10-year Treasury yield rises as investors weigh Trump’s criticism of Powell",
    "description": "The yield on the 10-year U.S. Treasury note rose Monday as investors weighed concerns over tariffs and comments by President Donald Trump criticizing Federal Reserve Chair Jerome Powell. The benchmark 10-year Treasury yield was 8 basis points higher at 4.401%…",
    "link": "https://freerepublic.com/focus/f-chat/4312303/posts",
    "timestamp": "2025-04-21T13:32:33Z"
  },
  {
    "title": "Hegseth had a second Signal chat where he shared details of Yemen strike, New York Times reports",
    "description": "The White House late Sunday dismissed the report as a \"non-story,\" insisting that no classified information was shared.",
    "link": "https://www.pbs.org/newshour/politics/hegseth-had-a-second-signal-chat-where-he-shared-details-of-yemen-strike-new-york-times-reports",
    "timestamp": "2025-04-21T13:32:00Z"
  },
  {
    "title": "Chicago Fed's Goolsbee says Fed independence is 'critically important' for its inflation fight",
    "description": "Federal Reserve Bank of Chicago President Austan Goolsbee on Monday urged against reducing the central bank's independence as President Donald Trump amped up criticism of Chair Jerome Powell.\n\"The long run expectations that the Fed would get inflation back do…",
    "link": "https://biztoc.com/x/58f8c9c3c8d0a51e",
    "timestamp": "2025-04-21T13:31:59Z"
  },
  {
    "title": "Trump Offers Condolences After Death of Pope Francis",
    "description": "President Donald Trump reacted Monday morning to the announcement from the Vatican that Pope Francis died.\nThe post Trump Offers Condolences After Death of Pope Francis appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/04/21/trump-offers-condolences-after-death-of-pope-francis/",
    "timestamp": "2025-04-21T13:31:47Z"
  },
  {
    "title": "US slides at open with Trump policies in spotlight",
    "description": "Major stock exchanges on Wall Street traded deep in the red territory on Monday after an extended Easter weekend, as United States President Donald Trump's remarks remained at the center of attention....",
    "link": "https://biztoc.com/x/6f49517e6982e524",
    "timestamp": "2025-04-21T13:31:40Z"
  },
  {
    "title": "Big Tech’s “Magnificent Seven” heads into earnings season reeling from Trump turbulence",
    "description": "By MICHAEL LIEDTKE, Associated Press Technology Writer\nSAN FRANCISCO (AP) — As Big Tech kicks off its quarterly earnings season this week, the industry’s bellwether companies have been thrust into a cauldron of uncertainty and turmoil that they didn’t anticip…",
    "link": "https://biztoc.com/x/a7863df90bac821f",
    "timestamp": "2025-04-21T13:31:35Z"
  },
  {
    "title": "Bill Maher Tells Charlie Kirk What’s Really Destroying His Own Party",
    "description": "In a surprising dialogue, Bill Maher and Charlie Kirk find common ground, addressing the divisive impact of \"woke\" ideology on American politics. Their candid exchange reveals urgent truths about the future of the Democratic Party.\nThe post Bill Maher Tells C…",
    "link": "https://www.thegatewaypundit.com/2025/04/bill-maher-tells-charlie-kirk-whats-really-destroying/",
    "timestamp": "2025-04-21T13:30:22Z"
  },
  {
    "title": "Chicago Fed's Goolsbee says Fed independence is 'critically important' for its inflation fight",
    "description": "\"When there is interference over the long run, it's going to mean higher inflation, it's going to mean worse growth and higher unemployment,\" Goolsbee said.",
    "link": "https://www.cnbc.com/2025/04/21/chicago-feds-goolsbee-says-fed-independence-is-critically-important-for-its-inflation-fight.html",
    "timestamp": "2025-04-21T13:29:23Z"
  }
]