[
  {
    "title": "Ismael 'El Mayo' Zambada, alleged Mexican drug lord, set to plead guilty",
    "description": "NEW YORK (Reuters) -Ismael \"El Mayo\" Zambada, the accused co-founder of Mexico's Sinaloa cartel, is expected to plead guilty to U.S. drug trafficking charges...",
    "link": "https://www.yahoo.com/news/articles/ismael-el-mayo-zambada-alleged-175339817.html",
    "timestamp": "2025-08-18T17:53:39Z"
  },
  {
    "title": "Trump: Trilateral Meeting With Zelensky and Putin Coming 'If Everything Works Out Well Today'",
    "description": "There is a \"reasonable chance of ending the war\" if talks with European leaders go well today, Trump said. \nThe post Trump: Trilateral Meeting With Zelensky and Putin Coming ‘If Everything Works Out Well Today’ appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/08/18/trump-trilateral-meeting-with-zelensky-and-putin-coming-if-everything-works-out-well-today/",
    "timestamp": "2025-08-18T17:52:33Z"
  },
  {
    "title": "US-Sanctioned Russian LNG Heads to Asia in Search for Buyers",
    "description": "Several liquefied natural gas tankers are heading to Asia from a Russian export facility sanctioned by the US, potentially testing Washington’s resolve to crack down on the trade amid high-level talks over the war in Ukraine.",
    "link": "https://gcaptain.com/us-sanctioned-russian-lng-heads-to-asia-in-search-for-buyers/",
    "timestamp": "2025-08-18T17:51:47Z"
  },
  {
    "title": "Trump: Honor to have Zelensky with us",
    "description": "US President Donald Trump welcomed Ukrainian President Volodymyr Zelensky to the White House on Monday, calling it \"an honor to have Zelensky with us\" ahead of joint talks aimed at ending the war in Ukraine. Trump also noted there was a \"reasonable chance\" fo…",
    "link": "https://freerepublic.com/focus/f-chat/4335261/posts",
    "timestamp": "2025-08-18T17:51:37Z"
  },
  {
    "title": "WATCH LIVE: Zelenskyy brings Europe’s top leaders with him to meet Trump on ending Russia’s war",
    "description": "President Donald Trump a united front against Russia. Trump and Zelenskyy will meet before European leaders join them for talks.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-zelenskyy-brings-europes-top-leaders-with-him-to-meet-trump-on-ending-russias-war",
    "timestamp": "2025-08-18T17:51:00Z"
  },
  {
    "title": "Fox’s Peter Doocy Confronts Trump, Zelensky Over Contrasting Statements on Ending War",
    "description": "Fox's White House correspondent Peter Doocy got right to the heart of an apparent dispute between President Trump and Ukrainian President Volodymyr Zelensky after they pushed conflicting statements about who's responsible for ending the bloody conflict.\nThe p…",
    "link": "https://www.mediaite.com/media/news/foxs-peter-doocy-confronts-trump-zelensky-over-contrasting-statements-on-ending-war/",
    "timestamp": "2025-08-18T17:50:57Z"
  },
  {
    "title": "JFK’s Grandson Jack Schlossberg Posts Unhinged Video Mocking Melania Trump",
    "description": "Former President John F. Kennedy's grandson, Jack Schlossberg, donned a blonde wig and mocked Melania Trump Sunday in an unhinged Instagram video.",
    "link": "https://dailycaller.com/2025/08/18/jfks-grandson-jack-schlossberg-mocks-melania-trump-donald-trump-vladimir-putin-letter-ukraine-war/",
    "timestamp": "2025-08-18T17:49:40Z"
  },
  {
    "title": "Amid DSCC Pressure, Democratic Populist J.D. Scholten Exits Iowa Senate Race",
    "description": "Scholten, who is among a small coterie of progressive to outperform Kamala Harris in deep red states, will endorse Josh Turek on Monday.\nThe post Amid DSCC Pressure, Democratic Populist J.D. Scholten Exits Iowa Senate Race appeared first on The Intercept.",
    "link": "https://theintercept.com/2025/08/18/jd-scholten-iowa-senate-dscc/",
    "timestamp": "2025-08-18T17:48:25Z"
  },
  {
    "title": "Kamala Harris Weighs In On Texas Redistricting — It Doesn’t Go Well",
    "description": "Kamala Harris discussed Texas redistricting on Aug. 6 during a meeting with Young Latino Leaders, but she appeared unfocused in her remarks.",
    "link": "https://dailycaller.com/2025/08/18/kamala-harris-texas-redistricting-did-not-go-well/",
    "timestamp": "2025-08-18T17:47:22Z"
  },
  {
    "title": "Trump administration taking 10 per cent in Intel worth about $10 billion? Intel share price drops big",
    "description": "Media reports said last week that the U.S. government may buy a stake in Intel, after a meeting between CEO Lip-Bu Tan and President Donald Trump.",
    "link": "https://economictimes.indiatimes.com/news/international/us/trump-administration-taking-10-per-cent-in-intel-worth-about-10-billion-intel-share-price-drops-big/articleshow/123370329.cms",
    "timestamp": "2025-08-18T17:47:09Z"
  },
  {
    "title": "China, Sidelined by Russia, Tries to Find a Role in Ukraine Peace Talks",
    "description": "The Chinese Foreign Ministry declared Beijing supportive of \"all efforts towards a peaceful settlement in Ukraine\" on Monday and emphasized support for dialogue following Russian strongman Vladimir Putin's visit to Alaska on Friday to meet with President Dona…",
    "link": "https://www.breitbart.com/asia/2025/08/18/china-sidelined-by-russia-tries-to-find-a-role-in-ukraine-peace-talks/",
    "timestamp": "2025-08-18T17:47:01Z"
  },
  {
    "title": "Marjorie Taylor Greene’s Financial Disclosure Doesn’t Mention Book Agreement—Which Could Be Illegal, Expert Says",
    "description": "Greene’s agreement for her 2023 book should have been included after she reported receiving more than $178,000 in royalties, attorney Brett Kappel confirmed to Forbes.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/08/18/marjorie-taylor-greenes-financial-disclosure-doesnt-mention-book-agreement-which-could-be-illegal-expert-says/",
    "timestamp": "2025-08-18T17:46:21Z"
  },
  {
    "title": "Oval Office meeting again puts rocky, tense Trump-Zelenskyy relationship to the test",
    "description": "Trump’s appraisal of the Ukrainian president has been an exercise in zigzag diplomacy as their relationship has unfolded since Trump's first term.",
    "link": "https://www.usatoday.com/story/news/politics/2025/08/18/trump-zelenskyy-relationship-ukraine-russia-war/85709854007/",
    "timestamp": "2025-08-18T17:45:48Z"
  },
  {
    "title": "Trump Vows 'Movement' To Eliminate Mail-In Ballots Before 2026 Midterms",
    "description": "Trump Vows 'Movement' To Eliminate Mail-In Ballots Before 2026 Midterms\n \nPresident Donald Trump on Monday vowed to eliminate mail-in voting, and has vowed to \"lead a movement\" to do so before the 2026 midterms.\n\"ELECTIONS CAN NEVER BE HONEST WITH MAIL IN BAL…",
    "link": "https://biztoc.com/x/aece6dd13bfe489f",
    "timestamp": "2025-08-18T17:44:22Z"
  },
  {
    "title": "Trump Bill Student Loan Changes Spur New College-Goers to Reconsider Plans",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nSince President Donald Trump signed the One Big Beautiful Bill Act into law on July 4, new federal loan limits are set to go into effect.\nThe law also issued the elimination of certain repayment options and re…",
    "link": "https://biztoc.com/x/cb5133f5b17e025b",
    "timestamp": "2025-08-18T17:44:17Z"
  },
  {
    "title": "Trump Promised 'Reciprocal' Tariffs. The Numbers Tell a Different Story",
    "description": "For months on the campaign trail and after taking office, President Donald Trump promised that his tariff policies would be based on a simple principle: reciprocity.\n\"Whatever they tax us, we will tax them,\" Trump told a joint session of Congress in March, ou…",
    "link": "https://biztoc.com/x/7e89766b53355db8",
    "timestamp": "2025-08-18T17:44:16Z"
  },
  {
    "title": "\"Progress Is Being Made\": Trump Meets Zelenskyy At White House",
    "description": "Ukrainian President Volodymyr Zelenskyy returned to the White House for high-stakes talks with President Donald Trump and European allies.\nThe two leaders posed briefly for photographers before moving inside for discussions on Ukraine’s war effort and Western…",
    "link": "https://biztoc.com/x/987f9902b807b749",
    "timestamp": "2025-08-18T17:44:06Z"
  },
  {
    "title": "Zelenskyy, Trump express hope for trilateral talks with Putin to bring end to Russia-Ukraine war",
    "description": "Volodymyr Zelenskyy and Donald Trump hoped for discussions with Vladimir Putin to stop the Russia-Ukraine war. This happened after Trump met Putin. Zelenskyy was open to these talks. Trump met Zelenskyy, Ursula von der Leyen, Emmanuel Macron, Keir Starmer, Fr…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-trump-express-hope-for-trilateral-talks-with-putin-to-bring-end-to-russia-ukraine-war/articleshow/123370286.cms",
    "timestamp": "2025-08-18T17:43:27Z"
  },
  {
    "title": "Trump Bill Student Loan Changes Spur New College-Goers to Reconsider Plans",
    "description": "The law issued the elimination of certain repayment options and removal of Grad PLUS loans.",
    "link": "https://www.newsweek.com/trump-bill-student-loan-changes-spur-new-college-goers-reconsider-plans-2115154",
    "timestamp": "2025-08-18T17:43:09Z"
  },
  {
    "title": "Volodymyr Zelensky Wears Suit This Time for White House Meeting With Trump",
    "description": "Volodymyr Zelensky is back in D.C. at the White House ... and this time, he decided to wear a business-like suit instead of his usual military garb. The president of Ukraine -- along with several other European leaders -- is meeting with Donald…\n Permalink",
    "link": "https://www.tmz.com/2025/08/18/volodymyr-zelensky-wears-suit-white-house-meeting/",
    "timestamp": "2025-08-18T17:39:37Z"
  },
  {
    "title": "Zelenskyy arrives at White House for critical talks with Trump, European leaders on war with Russia",
    "description": "President Zelenskyy arrives at the White House for crucial talks with President Trump and European leaders amidst the ongoing Russia-Ukraine war. Trump, after meeting with Putin, seeks concessions from Zelenskyy to end the conflict. European leaders aim to pr…",
    "link": "https://economictimes.indiatimes.com/news/defence/zelenskyy-arrives-at-white-house-for-critical-talks-with-trump-european-leaders-on-war-with-russia/articleshow/123370204.cms",
    "timestamp": "2025-08-18T17:39:29Z"
  },
  {
    "title": "Ukrainian official predicts disastrous Trump-Zelensky meeting: report",
    "description": "With President Donald Trump’s meeting with Ukrainian President Volodymyr Zelenskyy set to kick off Monday afternoon at the White House, one Ukrainian official is predicting summit will go much like the two’s previous meetup\r\n back in February, which many crit…",
    "link": "https://www.rawstory.com/ukraine-2673897969/",
    "timestamp": "2025-08-18T17:38:22Z"
  },
  {
    "title": "It's Official: NASA Is Giving Up on Climate Change Science",
    "description": "In a major blow to climate science, NASA is not continuing its work studying global warming and will instead just stick to space exploration.",
    "link": "https://futurism.com/the-byte/nasa-giving-up-climate-change-science",
    "timestamp": "2025-08-18T17:37:30Z"
  },
  {
    "title": "Trump says he believes Putin wants Ukraine war to end",
    "description": "Donald Trump said that he believes Russian President Vladimir Putin wants the Ukraine war to end. Trump made the comments ahead of a closely watched bilateral meeting between Trump and Ukrainian President Volodymyr Zelenskiy at the White House.",
    "link": "https://economictimes.indiatimes.com/news/defence/trump-says-he-believes-putin-wants-ukraine-war-to-end/articleshow/123370190.cms",
    "timestamp": "2025-08-18T17:37:11Z"
  },
  {
    "title": "Newsmax to pay $67M in defamation case over false 2020 election claims",
    "description": "The conservative network Newsmax has agreed to pay $67 million to settle a lawsuit accusing it of defaming a voting equipment company by spreading lies about President Donald Trump’s 2020 election loss.",
    "link": "https://www.pbs.org/newshour/politics/newsmax-to-pay-67m-in-defamation-case-over-false-2020-election-claims",
    "timestamp": "2025-08-18T17:34:51Z"
  },
  {
    "title": "Trump: The Ukraine War is going to end",
    "description": "US President Donald Trump said during his meeting with Ukrainian President Volodymyr Zelenskyy that the war between Russia and Ukraine \"is going to end.\"",
    "link": "https://www.israelnationalnews.com/flashes/664575",
    "timestamp": "2025-08-18T17:34:04Z"
  },
  {
    "title": "U.S.-Russia summit ignored key moral questions in Ukraine war, archbishop says",
    "description": "Archbishop Borys Gudziak. / Credit: Screenshot from United States Conference of Catholic Bishops\n\nWashington, D.C. Newsroom, Aug 18, 2025 / 13:34 pm (CNA).\nAt the United States-Russia summit, leaders failed to face “the fundamental moral and geopolitical ques…",
    "link": "https://www.catholicnewsagency.com/news/266005/us-russia-summit-ignored-key-moral-questions-in-ukraine-war-archbishop-says",
    "timestamp": "2025-08-18T17:34:00Z"
  },
  {
    "title": "Fox News Reporter Wounded by Russian Missile Warns That ‘Putin’s Gonna Try and Take Everything’",
    "description": "The Fox News reporter who nearly died when he was critically wounded by a Russian missile in Ukraine warned that Putin is completely invested in conquest.\nThe post Fox News Reporter Wounded by Russian Missile Warns That ‘Putin’s Gonna Try and Take Everything’…",
    "link": "https://www.mediaite.com/media/news/fox-news-reporter-wounded-by-russian-missile-warns-that-putins-gonna-try-and-take-everything/",
    "timestamp": "2025-08-18T17:33:58Z"
  },
  {
    "title": "Know Your Enemy: The Minority Voters Moving Right",
    "description": "Matt and Sam talk with Daniel Martinez HoSang about the gains the GOP and Trump are making with racial minorities.",
    "link": "https://www.dissentmagazine.org/blog/know-your-enemy-the-minority-voters-moving-right/",
    "timestamp": "2025-08-18T17:33:39Z"
  },
  {
    "title": "The Ukrainian leader made his first concession to President Donald Trump after White House officials reportedly put pressure on him to wear a suit.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e50f2b31-f373-4a16-be94-4b1a3f992027",
    "timestamp": "2025-08-18T17:33:34Z"
  },
  {
    "title": "Trump: Honor to have Zelensky with us",
    "description": "US President Donald Trump welcomed Ukrainian President Volodymyr Zelensky to the White House on Monday, calling it \"an honor to have Zelensky with us\" ahead of joint talks aimed at ending the war in U...",
    "link": "https://biztoc.com/x/39349baa1c217f53",
    "timestamp": "2025-08-18T17:33:11Z"
  },
  {
    "title": "Trump Greets Zelenskiy at White House Ahead of Peace Talks",
    "description": "Volodymyr Zelenskiy is in an impossible bind, having to risk Donald Trump's wrath or accept a deal to end Russia's war in Ukraine by ceding territory for vague security guarantees.\nZelenskiy's objectives in talks with Trump include learning more about Putin's…",
    "link": "https://biztoc.com/x/8eb0c64da114de40",
    "timestamp": "2025-08-18T17:33:08Z"
  },
  {
    "title": "Trump: US to be involved in Ukraine security guarantees",
    "description": "United States President Donald Trump said on Monday that his country will \"be involved\" in providing security guarantees for Ukraine, although he did not reveal if the US will send troops on the groun...",
    "link": "https://biztoc.com/x/5856f2d0fea33496",
    "timestamp": "2025-08-18T17:33:04Z"
  },
  {
    "title": "If Trump’s right, and Putin wants to ‘solve the problem’ in Ukraine, why won’t he withdraw?",
    "description": "Russian President Vladimir Putin delivers a statement during a news conference with President Donald Trump at Joint Base Elmendorf-Richardson on August 15, 2025 in Anchorage, Alaska.",
    "link": "https://biztoc.com/x/1ade64fca88dd3bd",
    "timestamp": "2025-08-18T17:32:49Z"
  },
  {
    "title": "WATCH LIVE: Texas legislature begins special session for re-districting as Democrats end stand-off",
    "description": "Their return will allow the Republican-run Legislature to proceed as California Democrats' advance a counter-effort to redraw their congressional boundaries in retaliation — a tit-for-tat that puts the nation's two most populous states at the center of an exp…",
    "link": "https://www.pbs.org/newshour/politics/watch-live-texas-legislature-begins-special-session-for-re-districting-as-democrats-end-stand-off",
    "timestamp": "2025-08-18T17:32:47Z"
  },
  {
    "title": "ayo?",
    "description": "ayo? refers to a reaction image and exploitable meme format featuring Ukrainian president Volodymyr Zelensky giving an awkward, uncertain facial expression",
    "link": "https://knowyourmeme.com/memes/ayo",
    "timestamp": "2025-08-18T17:32:46Z"
  },
  {
    "title": "Trump: Ukraine will receive security guarantees",
    "description": "US President Donald Trump said during his meeting with Ukrainian President Volodymyr Zelenskyy that Ukraine would receive \"security guarantees\" under a peace agreement, but declined to say if American troops would be included in those guarantees.",
    "link": "https://www.israelnationalnews.com/flashes/664573",
    "timestamp": "2025-08-18T17:32:16Z"
  },
  {
    "title": "Trump Administration In Talks To Take A 10% Stake In Intel",
    "description": "The Trump administration is in discussions to take a stake of about 10% in Intel Corp., according to a White House official and other people familiar with the matter, in a move that could see the US become the beleaguered chipmaker’s largest shareholder.",
    "link": "https://www.ndtvprofit.com/business/trump-administration-in-talks-to-take-a-10-stake-in-intel",
    "timestamp": "2025-08-18T17:32:11Z"
  },
  {
    "title": "Trump Is 'Setting Zelensky Up to Fail' After President Was 'Manipulated' By Putin During Alaska Meeting — As Russian Dictator's Land Grab is Mapped",
    "description": "Donald Trump is set to talk it out with Volodymyr Zelensky in a meeting in Washington, but some believe the U.S. president is already moving around his chess pieces.",
    "link": "https://radaronline.com/p/trump-setting-zelensky-up-to-fail-putin-russia-meeting-land-grab/",
    "timestamp": "2025-08-18T17:30:00Z"
  },
  {
    "title": "Trump Promises New, Blatantly Unconstitutional Order to End Mail-In Voting (Jim Saksa/Democracy Docket)",
    "description": "Jim Saksa / Democracy Docket:\nTrump Promises New, Blatantly Unconstitutional Order to End Mail-In Voting  —  President Donald Trump announced he will issue a new executive order as part of a “movement to get rid of” mail-in voting.  —  Trump railed against “M…",
    "link": "https://www.memeorandum.com/250818/p76",
    "timestamp": "2025-08-18T17:30:00Z"
  },
  {
    "title": "Trump plans major shake-up of how Americans vote ahead of 2026 midterm elections",
    "description": "President Donald Trump announced on Monday that he will \"lead a movement to get rid of MAIL-IN BALLOTS, and also, while we're at it, Highly 'Inaccurate,' Very Expensive, and Seriously Controversial VOTING MACHINES.\"The president — whose announcement comes jus…",
    "link": "https://www.theblaze.com/news/trump-plans-major-shake-up-of-how-americans-vote-ahead-of-2026-midterm-elections",
    "timestamp": "2025-08-18T17:30:00Z"
  },
  {
    "title": "Republicans look to make a U-turn on electric vehicles for the Postal Service",
    "description": "The independent federal agency is in the middle of a $40 billion, 10-year modernization and financial stabilization plan.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_981f0229-6f8a-5e37-8f1c-fc00aba37cc0.html",
    "timestamp": "2025-08-18T17:30:00Z"
  },
  {
    "title": "Zelensky arrives for White House meeting on Russia-Ukraine war",
    "description": "Ukrainian President Volodymyr Zelensky has arrived at the White House for talks with President Donald Trump and key European leaders as the U.S. leader presses for a quick end to the brutal Russia-Ukraine war.",
    "link": "https://www.hurriyetdailynews.com/zelensky-arrives-for-white-house-meeting-on-russia-ukraine-war-212649",
    "timestamp": "2025-08-18T17:29:38Z"
  },
  {
    "title": "Why the Alaska summit matters for Africa, too",
    "description": "The meeting between Vladimir Putin and Donald Trump resonates strongly across Africa confirming that a multipolar world is possible Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/623207-trump-putin-alaska-meeting-africa/",
    "timestamp": "2025-08-18T17:27:48Z"
  },
  {
    "title": "Drudge Report Headline Asks: Is ‘The Don Being Blackmailed’ by Putin?",
    "description": "rudge has become a fierce critic of Trump in recent years and upped his barbs against the president during the 2024 presidential campaign\nThe post Drudge Report Headline Asks: Is ‘The Don Being Blackmailed’ by Putin? first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/drudge-report-headline-asks-is-the-don-being-blackmailed-by-putin/",
    "timestamp": "2025-08-18T17:27:06Z"
  },
  {
    "title": "Trump Promised 'Reciprocal' Tariffs. The Numbers Tell a Different Story.",
    "description": "In most cases, Trump's tariffs are significantly higher than the tariffs charged by other countries on American goods.",
    "link": "https://reason.com/2025/08/18/trump-promised-reciprocal-tariffs-the-numbers-tell-a-different-story/",
    "timestamp": "2025-08-18T17:26:48Z"
  },
  {
    "title": "Faulty DC Crime Stats Say: Don’t Believe Your Lying Eyes About Crime in Our Nation’s Capital",
    "description": "Those complaining about President Donald Trump’s Washington, D.C. crime crackdown claim that crime isn’t as bad as it seems. Even more unbelievably, they claim that... Read More\nThe post Faulty DC Crime Stats Say: Don’t Believe Your Lying Eyes About Crime in …",
    "link": "https://www.dailysignal.com/2025/08/18/faulty-dc-crime-stats-say-dont-believe-lying-eyes-about-crime-nations-capital/",
    "timestamp": "2025-08-18T17:26:30Z"
  },
  {
    "title": "Trump says he wants to get rid of mail-in ballots | Honolulu Star-Advertiser",
    "description": "President Donald Trump said today that he would lead a movement to eliminate mail-in ballots and would sign an executive order to “help bring HONESTY to the 2026 Midterm Elections.”",
    "link": "https://www.staradvertiser.com/2025/08/18/breaking-news/trump-says-he-wants-to-get-rid-of-mail-in-ballots/",
    "timestamp": "2025-08-18T17:26:25Z"
  },
  {
    "title": "Zelenskyy arrives at White House for talks with Trump and EU leaders",
    "description": "The Ukrainian president and his American counterpart were seen shaking hands before heading to the Oval Office for their bilateral talk on the war in Ukraine.",
    "link": "https://news.sky.com/story/zelenskyy-arrives-at-white-house-for-talks-with-trump-and-eu-leaders-13414188",
    "timestamp": "2025-08-18T17:26:00Z"
  },
  {
    "title": "Zelenskyy Arrives At White House For Meeting With Trump (Live Updates)",
    "description": "The meeting comes after Trump met with Russian President Vladimir Putin on Friday.",
    "link": "https://www.forbes.com/sites/saradorn/2025/08/18/zelenskyy-arrives-at-white-house-for-meeting-with-trump-live-updates/",
    "timestamp": "2025-08-18T17:25:50Z"
  },
  {
    "title": "Obama: Texas redistricting effort ‘systematic assault on democracy’",
    "description": "Former President Obama joined a Zoom call with Texas state House Democrats on Thursday, calling the Republican redistricting effort in the state a “systematic assault on democracy.” “What we all recognize is we can’t let a systematic assault on democracy just…",
    "link": "https://freerepublic.com/focus/f-chat/4335258/posts",
    "timestamp": "2025-08-18T17:25:31Z"
  },
  {
    "title": "Russia put out an unusual propaganda video of a 'captured' US-made armored vehicle flying American and Russian flags in Ukraine",
    "description": "Russian state media footage shows the M113 armored personnel carrier driving into combat in the Zaporizhzhia region.",
    "link": "https://www.businessinsider.com/us-armor-captured-ukraine-seen-with-russian-american-flags-video-2025-8",
    "timestamp": "2025-08-18T17:25:18Z"
  },
  {
    "title": "Trump Snubs Greatest Allies With Greeting From Fox News Host (Sarah Ewall-Wice/The Daily Beast)",
    "description": "Sarah Ewall-Wice / The Daily Beast:\nTrump Snubs Greatest Allies With Greeting From Fox News Host  —  LATER!  —  European leaders arriving at the White House were met by the Chief of Protocol, Monica Crowley.  —  After rolling out the red carpet for Vladimir P…",
    "link": "https://www.memeorandum.com/250818/p75",
    "timestamp": "2025-08-18T17:25:01Z"
  },
  {
    "title": "Volodymyr Zelensky arrives at White House for ‘historic’ summit in bid to end Russia’s invasion of Ukraine",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"68a2ba7b56e759f87e005706\"\n}",
    "link": "https://www.independent.ie/world-news/europe/volodymyr-zelensky-arrives-at-white-house-for-historic-summit-in-bid-to-end-russias-invasion-of-ukraine/a1301371714.html",
    "timestamp": "2025-08-18T17:24:48Z"
  },
  {
    "title": "Ukrainian President Volodymyr Zelenskyy's wardrobe choice for his high-stakes meeting with Trump",
    "description": "Ukrainian President Volodymyr Zelenskyy arrived to the White House for his high-stakes meeting with President Donald Trump wearing more formal attire than his typical relaxed wardrobe.",
    "link": "https://www.foxnews.com/politics/ukrainian-president-volodymyr-zelenskyys-wardrobe-choice-his-high-stakes-meeting-trump",
    "timestamp": "2025-08-18T17:23:36Z"
  },
  {
    "title": "Trump greets Zelensky at White House",
    "description": "United States President Donald Trump welcomed his Ukrainian counterpart, Volodymyr Zelensky, to the White House on Monday, where the two leaders are expected to discuss the outcomes of Trump's meeting...",
    "link": "https://biztoc.com/x/af11371b66e276cc",
    "timestamp": "2025-08-18T17:21:58Z"
  },
  {
    "title": "WATCH: JFK’s Grandson Wears Wig in Bizarre Video Mocking Melania Trump’s Accent, Letter to Putin",
    "description": "Jack Schlossberg took to social media Monday to mock a letter written by First Lady Melania Trump and addressed to Vladimir Putin.\nThe post WATCH: JFK’s Grandson Wears Wig in Bizarre Video Mocking Melania Trump’s Accent, Letter to Putin first appeared on Medi…",
    "link": "https://www.mediaite.com/media/news/watch-jfks-grandson-wears-wig-in-bizarre-video-mocking-melania-trumps-accent-letter-to-putin/",
    "timestamp": "2025-08-18T17:21:54Z"
  },
  {
    "title": "Jade Thirlwall Blasts 'White and Privileged' Celebrity Over Politics Remark",
    "description": "The singer rose to fame on \"The X Factor\" in 2011 as a member of Little Mix.",
    "link": "https://www.newsweek.com/jade-thirlwall-white-privileged-matty-healy-politics-2115102",
    "timestamp": "2025-08-18T17:21:14Z"
  },
  {
    "title": "Jimmy Kimmel Mourns Colbert's Cancellation, Says Watching Trump Get Booed 'Cheered Me up'",
    "description": "ABC's Live host Jimmy Kimmel sat with Variety and railed against CBS canceling \"The Late Show with Stephen Colbert,\" President Donald Trump, and media reporting that widely concluded Colbert's show was losing tens of millions for CBS and its former parent Par…",
    "link": "https://www.breitbart.com/entertainment/2025/08/18/jimmy-kimmel-mourns-colberts-cancellation-says-watching-trump-get-booed-cheered-me-up/",
    "timestamp": "2025-08-18T17:20:58Z"
  },
  {
    "title": "Sherrod Brown's Chances of Flipping GOP Seat in Ohio as He Enters Race",
    "description": "Sherrod Brown made official his comeback campaign for U.S. Senate on Monday.",
    "link": "https://www.newsweek.com/sherrod-brown-enters-race-polls-2115170",
    "timestamp": "2025-08-18T17:20:48Z"
  },
  {
    "title": "Is the IRS giving stimulus checks in 2025? How to track my stimulus check status update",
    "description": "Are we getting a stimulus check 2025? Here's status update on Trump's $600 rebate stimulus checks, how to track IRS refund by social security number",
    "link": "https://www.delawareonline.com/story/news/2025/08/18/are-we-getting-a-stimulus-check-2025-in-august-eligibility-trump-rebate-irs-wheres-my-refund-status/85711056007/",
    "timestamp": "2025-08-18T17:20:24Z"
  },
  {
    "title": "Watch Live: Donald Trump Meets with Volodymyr Zelensky at White House",
    "description": "President Donald Trump meets with Ukrainian President Volodymyr Zelensky at the White House on Monday, August 18.\nThe post Watch Live: Donald Trump Meets with Volodymyr Zelensky at White House appeared first on Breitbart.",
    "link": "https://www.breitbart.com/europe/2025/08/18/watch-live-donald-trump-meets-with-volodymyr-zelensky-at-white-house/",
    "timestamp": "2025-08-18T17:20:15Z"
  },
  {
    "title": "Newsmax to pay $67 million to settle Dominion Voting Systems’ defamation lawsuit",
    "description": "Newsmax, a far-right media outlet, has agreed to a $67 million settlement with Dominion Voting Systems, but a similar case involving Fox News still remains.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/newsmax-pay-67-million-settle-dominion-voting-systems-defamation-lawsu-rcna225647",
    "timestamp": "2025-08-18T17:18:33Z"
  },
  {
    "title": "Air raid sirens sound across Ukraine as Zelensky arrives at the White House",
    "description": "Ukrainian President Volodymyr Zelensky left his embassy for the White House on Monday as air raid sirens started to sound in several parts of Ukraine, signaling incoming Russian attacks, according to CNN reporter Kristen Holmes..Zelensky is meeting with a gro…",
    "link": "https://www.rawstory.com/ukraine-2673897847/",
    "timestamp": "2025-08-18T17:17:28Z"
  },
  {
    "title": "RFK Jr., Hegseth face-off in impressive pullup, pushup Pentagon showdown",
    "description": "Health Secretary Robert F. Kennedy Jr. and Defense Secretary Pete Hegseth competed in a fitness challenge of 50 pullups and 100 pushups under five minutes.",
    "link": "https://www.foxnews.com/politics/rfk-jr-hegseth-face-off-impressive-pullup-pushup-pentagon-showdown",
    "timestamp": "2025-08-18T17:16:43Z"
  },
  {
    "title": "Volodymyr Zelensky Wears Special 'Suit' for Trump Meeting at White House",
    "description": "Zelensky's decision to wear a long-sleeve t-shirt emblazoned with a military insignia, rather than a suit, became a flashpoint.",
    "link": "https://www.newsweek.com/zelensky-trump-meeting-suit-shirt-ukraine-white-house-2115191",
    "timestamp": "2025-08-18T17:15:33Z"
  },
  {
    "title": "Trump administration in talks to take 10% stake in Intel",
    "description": "The federal government is considering a potential investment in Intel that would involve converting some or all of the company’s grants from the US Chips and Science Act into equity",
    "link": "https://www.livemint.com/companies/news/trump-administration-in-talks-to-take-10-stake-in-intel-11755536828599.html",
    "timestamp": "2025-08-18T17:14:20Z"
  },
  {
    "title": "Lula Says Brazil ‘Open for Business’ at Chinese Factory Opening",
    "description": "Brazil’s socialist president, Luiz Inacio Lula da Silva, declared at the opening of a Chinese automobile plant that Brazil is “open for business.”\nThe post Lula Says Brazil ‘Open for Business’ at Chinese Factory Opening appeared first on Breitbart.",
    "link": "https://www.breitbart.com/latin-america/2025/08/18/lula-says-brazil-open-business-chinese-factory-opening/",
    "timestamp": "2025-08-18T17:14:06Z"
  },
  {
    "title": "Italy opposes Western troop deployment to Ukraine – report",
    "description": "Prime Minister Meloni has reportedly sparred with French President Macron over the issue ahead of talks in Washington Read Full Article at RT.com",
    "link": "https://www.rt.com/news/623202-italy-no-troops-ukraine/",
    "timestamp": "2025-08-18T17:13:13Z"
  },
  {
    "title": "Thousands of ‘students’ get visas jerked for criminal activities, terror support",
    "description": "DUIs, burglaries, assaults all trigger action against permissions to remain in the U.S.",
    "link": "https://www.wnd.com/2025/08/thousands-students-get-visas-jerked-criminal-activities-terror/",
    "timestamp": "2025-08-18T17:10:09Z"
  },
  {
    "title": "Markets subdued ahead of Trump meeting",
    "description": "Dublin market ends Monday lower",
    "link": "https://www.irishtimes.com/business/2025/08/18/markets-subdued-ahead-of-trump-meeting/",
    "timestamp": "2025-08-18T17:09:50Z"
  },
  {
    "title": "Texas and California redistricting battles resume ahead of midterm elections",
    "description": "High-stakes redistricting battles unfold in Texas and California as Republicans and Democrats push new congressional maps ahead of 2026 midterm elections.",
    "link": "https://www.foxnews.com/politics/texas-dems-end-weekslong-quorum-standoff-redistricting-fight",
    "timestamp": "2025-08-18T17:09:29Z"
  },
  {
    "title": "South Korean and US militaries begin annual summertime drills to cope with North Korean threats",
    "description": "Ulchi Freedom Shield will involve 21,000 soldiers in computer-simulated command post operations and field training.",
    "link": "https://www.bostonherald.com/2025/08/18/koreas-tensions-military-drills/",
    "timestamp": "2025-08-18T17:09:10Z"
  },
  {
    "title": "What Is the 'Orbital Aircraft Carrier?' What We Know About US Space Project",
    "description": "The carrier would provide \"unprecedented flexibility and speed for in-space operations\" in space.",
    "link": "https://www.newsweek.com/space-force-aircraft-carrier-2115127",
    "timestamp": "2025-08-18T17:09:02Z"
  },
  {
    "title": "PA State Treasurer Launches Gubernatorial Bid to Oust Shapiro",
    "description": "Pennsylvania state Treasurer Stacy Garrity on Monday announced her bid for the Republican nomination for governor in the 2026 Pennsylvania gubernatorial election. If Garrity wins... Read More\nThe post PA State Treasurer Launches Gubernatorial Bid to Oust Shap…",
    "link": "https://www.dailysignal.com/2025/08/18/pa-state-treasurer-stacy-garrity-announces-run-governor/",
    "timestamp": "2025-08-18T17:07:17Z"
  },
  {
    "title": "Texas Democrats return home after redistricting row",
    "description": "Republican lawmakers are expected to quickly pass new voting maps, but Democrats still say they were victorious in the standoff.",
    "link": "https://www.bbc.com/news/articles/cdd3gj5ve1go",
    "timestamp": "2025-08-18T17:07:13Z"
  },
  {
    "title": "Conservative network Newsmax agrees to pay $67M in defamation case over bogus 2020 election claims",
    "description": "The conservative network Newsmax will pay $67 million to settle a lawsuit accusing it of defaming a voting equipment company by spreading lies about President Donald Trump’s 2020 election loss, according to documents filed Monday.",
    "link": "https://toronto.citynews.ca/2025/08/18/conservative-network-newsmax-agrees-to-pay-67m-in-defamation-case-over-bogus-2020-election-claims/",
    "timestamp": "2025-08-18T17:06:40Z"
  },
  {
    "title": "Trump Makes Weird Claim About Major Ukraine Meeting as Fans Seethe",
    "description": "MAGA loyalists are\nseething as President Donald Trump prepares to welcome Ukrainian President\nVolodymyr Zelenskiy—and the European leaders he’s brought along for support—to\nthe White House on Monday. Trump has had an\nextremely contentious relationship with Ze…",
    "link": "https://newrepublic.com/post/199213/donald-trump-weird-claim-ukraine-meeting-zelenskiy-maga-fans-seethe",
    "timestamp": "2025-08-18T17:05:15Z"
  },
  {
    "title": "Ukrainian President Volodymyr Zelenskyy gets dressing down before White House meeting, virtually told to surrender",
    "description": "Donald Trump has urged Ukraine to cede territory to Russia and abandon NATO aspirations ahead of President Zelensky's White House visit. Trump's stance, seen as pro-Russia, contrasts with European leaders seeking security guarantees for Ukraine. While a poten…",
    "link": "https://timesofindia.indiatimes.com/world/us/zelenskyy-gets-dressing-down-before-wh-meeting-virtually-told-to-surrender/articleshow/123369384.cms",
    "timestamp": "2025-08-18T17:02:16Z"
  },
  {
    "title": "Trump, Zelenskyy Meet in D.C. With Numerous European Leaders",
    "description": "Let's hope this better has a better outcome than Zelensky's February visit!\nThe post Trump, Zelenskyy Meet in D.C. With Numerous European Leaders first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/08/trump-zelenskyy-meet-in-d-c-with-numerous-european-leaders/",
    "timestamp": "2025-08-18T17:00:55Z"
  },
  {
    "title": "Bitmine And Donald Trump Spent The Weekend Stacking Ethereum, Here’s How Much They Got",
    "description": "On-chain data shows that Tom Lee’s BitMine and Donald Trump’s World Liberty Financial (WLFI) have been buying the dip amid the recent Ethereum price crash. Both companies spent almost $140 million buying ETH as they doubled down on their bet on the largest al…",
    "link": "https://bitcoinist.com/donald-trump-stacking-ethereum/",
    "timestamp": "2025-08-18T17:00:13Z"
  },
  {
    "title": "Zelenskyy and Europe’s top leaders to meet with Trump on ending Russia’s war",
    "description": "By arriving as a group Monday, they hope to avoid debacles like Zelenskyy's February meeting in the Oval Office, where Trump chastised him for not showing enough gratitude for military aid.",
    "link": "https://www.pbs.org/newshour/world/zelenskyy-and-europes-top-leaders-to-meet-with-trump-on-ending-russias-war",
    "timestamp": "2025-08-18T16:59:31Z"
  },
  {
    "title": "'We were not aware Gazan woman had leukemia,' says BBC after claiming she died of malnutrition",
    "description": "In a statement on Monday, a BBC spokesperson acknowledged that the broadcaster was \"not initially aware that Marah Abu Zuhri was being treated for leukemia.\" Following criticism, the BBC admitted on Monday that a Gazan woman it claimed had died from starvatio…",
    "link": "https://freerepublic.com/focus/f-news/4335254/posts",
    "timestamp": "2025-08-18T16:58:13Z"
  },
  {
    "title": "Texas Democrats return home, Trump rails about mail-in voting in latest U.S. midterm manoeuvres",
    "description": "Democratic lawmakers who fled their state to stymie Republican plans to redraw political maps at the behest of President Donald Trump announced on Monday they were \"returning to Texas on our terms,\" as the battle lines harden 15 months before the U.S. holds m…",
    "link": "https://www.cbc.ca/news/world/texas-democrats-return-trump-order-1.7611503",
    "timestamp": "2025-08-18T16:55:53Z"
  },
  {
    "title": "Carney, Ford shift focus to what ‘we can control’ amid U.S. trade uncertainty",
    "description": "OTTAWA — Prime Minister Mark Carney and Ontario Premier Doug Ford put the focus on making Canada globally competitive rather than securing a trade deal with the United States as they met in Ottawa on Monday. Carney and Ford were meeting on Parliament Hill as …",
    "link": "https://financialpost.com/pmn/carney-ford-shift-focus-to-what-we-can-control-amid-u-s-trade-uncertainty",
    "timestamp": "2025-08-18T16:55:04Z"
  },
  {
    "title": "If Trump’s right, and Putin wants to ‘solve the problem’ in Ukraine, why won’t he withdraw?",
    "description": "There's a way to end the war in Ukraine quickly, cheaply and without bloodshed: Russia could withdraw. It's the remedy Donald Trump and his team aren't pushing.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-right-putin-wants-solve-problem-ukraine-wont-withdraw-rcna225629",
    "timestamp": "2025-08-18T16:54:15Z"
  },
  {
    "title": "Agency for Healthcare Research and Quality Must Immediately Release Months-Delayed 2024 National Healthcare Quality and Disparities Report",
    "description": "In a letter sent today to the director of the federal Agency for Healthcare Research and Quality (AHRQ), Public Citizen called for the immediate release of the AHRQ’S 2024 National Healthcare Quality and Disparities report.The National Healthcare Quality and …",
    "link": "https://www.commondreams.org/newswire/agency-for-healthcare-research-and-quality-must-immediately-release-months-delayed-2024-national-healthcare-quality-and-disparities-report",
    "timestamp": "2025-08-18T16:53:57Z"
  },
  {
    "title": "Washington, D.C. Doesn’t Need More National Guard Troops, but States Are Sending Them Anyway",
    "description": "Parts of their states grapple with higher crime rates, but some governors care more about pleasing the president.",
    "link": "https://www.esquire.com/news-politics/politics/a65808521/washington-dc-national-guard-south-carolina-west-virginia-ohio/",
    "timestamp": "2025-08-18T16:53:00Z"
  },
  {
    "title": "Newsmax agrees to pay $67M settlement in defamation case over 2020 election claims",
    "description": "Newsmax agrees to pay $67M settlement in defamation case over 2020 election claimslocal10.com",
    "link": "https://www.local10.com//business/2025/08/18/newsmax-agrees-to-pay-67m-settlement-in-defamation-case-over-2020-election-claims/",
    "timestamp": "2025-08-18T16:52:39Z"
  },
  {
    "title": "An Agency That Protects Federal Workers Is Kneecapping Itself To Please Trump",
    "description": "Unions are alarmed by the plan for the Federal Labor Relations Authority, saying it will give the president more power over the federal workforce.",
    "link": "https://www.huffpost.com/entry/federal-labor-relations-authority-judges-trump_n_68a3461ae4b03709c085be9c",
    "timestamp": "2025-08-18T16:51:53Z"
  },
  {
    "title": "Ed Martin: The Russia Hoax Is About to Blow Up, Schiff and Biden’s DOJ Are Next",
    "description": "Ed Martin, the director of the Department of Justice Weaponization Working Group, joined Maria Bartiromo on Fox News’ \"Sunday Morning Futures\" for an explosive interview about ongoing investigations into government abuse of power. Martin confirmed that his of…",
    "link": "https://freerepublic.com/focus/f-news/4335253/posts",
    "timestamp": "2025-08-18T16:51:18Z"
  },
  {
    "title": "National Guardsman Stops Assault of Police Officer at National Mall: 'I Care a Lot About This City'",
    "description": "A national guardsman stopped an assault in Washington, DC, that occurred at the National Mall, the National Guard confirmed in a press release.\nThe post National Guardsman Stops Assault of Police Officer at National Mall: ‘I Care a Lot About This City’ appear…",
    "link": "https://www.breitbart.com/politics/2025/08/18/national-guardsman-stops-assault-of-police-officer-at-national-mall-i-care-a-lot-about-this-city/",
    "timestamp": "2025-08-18T16:50:17Z"
  },
  {
    "title": "European leaders arrive at White House for ‘historic’ summit in bid to end Russia’s invasion of Ukraine",
    "description": "{\n \"themeId\": \"lct_653b7fa7fed115003648bab8\",\n \"clientId\": \"64772ae4d1d7dec0c5b716af\",\n \"liveblogId\": \"68a2ba7b56e759f87e005706\"\n}",
    "link": "https://www.independent.ie/world-news/europe/european-leaders-arrive-at-white-house-for-historic-summit-in-bid-to-end-russias-invasion-of-ukraine/a1301371714.html",
    "timestamp": "2025-08-18T16:50:06Z"
  },
  {
    "title": "The Surprising Way Trump’s D.C. Takeover Is Wrecking City’s Economy",
    "description": "Donald Trump’s authoritarianism is scaring away diners in Washington, D.C.WUSA9 reported Sunday that restaurants in the nation’s capital saw a more than 25 percent dip in reservations in the days after Trump federalized the city’s police forces. Trump also de…",
    "link": "https://newrepublic.com/post/199214/donald-trump-dc-takeover-restaurant-reservations",
    "timestamp": "2025-08-18T16:49:00Z"
  },
  {
    "title": "Map Shows Countries With Mail-In Ballots As Trump Vows to Ban Voting Format",
    "description": "President Donald Trump claimed on Truth Social that the U.S. is \"the only Country in the World that uses Mail-In Voting.\"",
    "link": "https://biztoc.com/x/c96fc0eef23153b6",
    "timestamp": "2025-08-18T16:48:07Z"
  },
  {
    "title": "Israel receives Hamas response to ceasefire proposal",
    "description": "A senior Arab official said that the proposal includes a kilometer withdrawal in northern and eastern Gaza, the release of 200 terrorists serving significant sentences in exchange for ten living hostages.",
    "link": "https://www.israelnationalnews.com/news/413482",
    "timestamp": "2025-08-18T16:47:34Z"
  }
]