[
  {
    "title": "Chuck Schumer Says Scott Bessent 'Slipped' And 'Told The Truth' About Trump's Social Security Privatization Plan",
    "description": "Treasury Secretary Scott Bessent said Wednesday that President Donald Trump's new children's savings program \"is a back door for privatizing Social Security,...",
    "link": "https://finance.yahoo.com/news/chuck-schumer-says-scott-bessent-213130649.html",
    "timestamp": "2025-07-31T21:31:30Z"
  },
  {
    "title": "Donald Trump Is Turning the White House Into Mar-a-Lago",
    "description": "Donald Trump is finally getting his wish to turn the White House into the gaudy resort he calls home by adding a $200 million ballroom. The White House announced that it would begin construction in September on a 90,000 square foot ballroom that can seat 650 …",
    "link": "https://newrepublic.com/post/198679/donald-trump-turning-white-house-mar-a-lago",
    "timestamp": "2025-07-31T21:31:21Z"
  },
  {
    "title": "Trump Says Witkoff to Visit Russia, Expects to Impose Sanctions",
    "description": "US President Donald Trump said special envoy Steve Witkoff would be headed to Russia after wrapping up a visit to Israel ahead of a new deadline for Moscow to halt its fight with Ukraine.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-says-witkoff-to-visit-russia-expects-to-impose-sanctions",
    "timestamp": "2025-07-31T21:31:05Z"
  },
  {
    "title": "Trump 'Was The Rat:' Epstein Believed Prez 'Snitched' On Him To FBI Before 2006 Arrest — Biographer Claims The Don 'Was Aware of What Was Going On'",
    "description": "Donald Trump 'snitched' on Jeffrey Epstein before his 2006 arrest, at least that is what the sex offender is said to have been convinced of.",
    "link": "https://radaronline.com/p/trump-rat-epstein-president-snitched-to-fbi-before-arrest/",
    "timestamp": "2025-07-31T21:30:00Z"
  },
  {
    "title": "Board recommends that Trump White House official Jeffrey Clark be disbarred for efforts to overturn 2020 election | CNN Politics",
    "description": "A Washington, DC, disciplinary board recommended Thursday that Jeffrey Clark, an attorney and longtime ally of President Donald Trump, should lose his law license for trying to include the Justice Department in Trump’s failed attempt to subvert the 2020 elect…",
    "link": "https://www.cnn.com/2025/07/31/politics/jeffrey-clark-dc-bar",
    "timestamp": "2025-07-31T21:29:38Z"
  },
  {
    "title": "There’s A Whole Separate Batch Of Epstein Files Pam Bondi Doesn’t Control",
    "description": "The Treasury Department has thousands of records reflecting potentially suspicious payments to Jeffrey Epstein.",
    "link": "https://www.huffpost.com/entry/epstein-files-treasury-department-ron-wyden_n_688bd0eee4b0f5c3b7c9ce7c",
    "timestamp": "2025-07-31T21:29:04Z"
  },
  {
    "title": "Donald Trump Asked Why Jeffrey Epstein 'Stole' Girls from Mar-a-Lago",
    "description": "The family of Virginia Giuffre said they were shocked to hear Trump say he was aware Giuffre had been \"stolen\" from his Florida resort.",
    "link": "https://www.newsweek.com/donald-trump-asked-why-jeffrey-epstein-stole-girls-mar-lago-2107297",
    "timestamp": "2025-07-31T21:27:36Z"
  },
  {
    "title": "Epstein reportedly used Trump meeting to groom 13-year-old: 'This is a good one, right?'",
    "description": "Deceased wealth manager and accused child sex trafficker Jeffrey Epstein used a meeting with President Donald Trump to groom one of his 13-year-old victims, The Daily Beast reported on Thursday.The victim, known only as \"Jane,\" testified extensively to how sh…",
    "link": "https://www.rawstory.com/trump-epstein-2673796824/",
    "timestamp": "2025-07-31T21:26:39Z"
  },
  {
    "title": "Path to the Fed rate cuts Trump wants may involve higher unemployment",
    "description": "WASHINGTON: President Donald Trump may see lower Federal Reserve interest rates as a fix for two politically potent problems, the cost of servicing US$36 trillion in government debt and the high cost of home ownership, but the path there may touch a third rai…",
    "link": "https://www.channelnewsasia.com/world/path-fed-rate-cuts-trump-wants-may-involve-higher-unemployment-5270866",
    "timestamp": "2025-07-31T21:26:00Z"
  },
  {
    "title": "A 'beautiful' ballroom and a new Lincoln bathroom: Trump relishes remaking the White House",
    "description": "President Donald Trump discussed his plans to renovate the White House, including a new ballroom, gold in the Oval Office and an updated Lincoln Bedroom bathroom.",
    "link": "https://biztoc.com/x/7197949888d717a8",
    "timestamp": "2025-07-31T21:24:47Z"
  },
  {
    "title": "My New Dispatch Article on Judicial Review of Emergency Powers",
    "description": "NA \nToday, The Dispatch published my article \"Not Everything is an Emergency\" (gift link). Here is an excerpt: \n \nThe Trump administration has attempted to make sweeping use of emergency powers in the areas of immigration, trade, and domestic use of the milit…",
    "link": "https://biztoc.com/x/8db2393c3dcec46d",
    "timestamp": "2025-07-31T21:24:40Z"
  },
  {
    "title": "NFL Legend Candidly Tells Trump ‘I Don’t Know What We’re Supposed to Be Doing’ On New Sports Commission",
    "description": "NFL legend Lawrence Taylor admitted on the podium Thursday that he had no idea what he was doing next to President Donald Trump in the White House.\nThe post NFL Legend Candidly Tells Trump ‘I Don’t Know What We’re Supposed to Be Doing’ On New Sports Commissio…",
    "link": "https://www.mediaite.com/media/sports/nfl-legend-candidly-tells-trump-i-dont-know-what-were-supposed-to-be-doing-on-new-sports-commission/",
    "timestamp": "2025-07-31T21:24:21Z"
  },
  {
    "title": "Declassified Russiagate document exposes deep state coverup – top US senator",
    "description": "The key figure behind the release of the Durham Annex, Senator Chuck Grassley, has spoken to Fox News about the explosive document Read Full Article at RT.com",
    "link": "https://www.rt.com/news/622349-russiagate-deep-state-coverup/",
    "timestamp": "2025-07-31T21:24:14Z"
  },
  {
    "title": "Brown University Reaches $50M Settlement with Trump Admin to Restore Federal Funding",
    "description": "Brown University reached an agreement with the Trump administration on Wednesday to restore federal funding for research after the Department of Education paused more than $500 million in funds in April and opened civil rights investigations into the school. …",
    "link": "https://www.breitbart.com/politics/2025/07/31/brown-university-reaches-50m-settlement-with-trump-admin-to-restore-federal-funding/",
    "timestamp": "2025-07-31T21:23:50Z"
  },
  {
    "title": "Apple's Q3 Sales Boosted by Consumers Scrambling to Beat Tariff Price Hikes",
    "description": "Apple customers afraid of massive price hikes because of tariffs helped Apple's device sales during the fiscal third quarter of 2025, Apple CEO Tim Cook said today.\n\n\n\n\n\nSpeaking to Reuters, Cook said that approximately one percentage point of Apple's 10 perc…",
    "link": "https://www.macrumors.com/2025/07/31/apple-q3-sales-tariff-boost/",
    "timestamp": "2025-07-31T21:23:34Z"
  },
  {
    "title": "Todd and Julie Chrisley’s new reality show teases unseen footage from their prison release",
    "description": "The Chrisleys were released from prison in May after being pardoned by President Donald Trump",
    "link": "https://www.the-independent.com/arts-entertainment/tv/news/todd-julie-chrisley-back-to-reality-show-b2799956.html",
    "timestamp": "2025-07-31T21:21:49Z"
  },
  {
    "title": "Sydney Sweeney’s ‘Good Jeans’ Ad—The American Eagle Controversy, Explained",
    "description": "Sydney Sweeney’s “Good Jeans” ad for American Eagle sparked backlash online, leading to a range of commentary and debate—here’s the controversy, explained.",
    "link": "https://www.forbes.com/sites/danidiplacido/2025/07/31/sydney-sweeneys-good-jeans-ad-the-american-eagle-controversy-explained/",
    "timestamp": "2025-07-31T21:19:31Z"
  },
  {
    "title": "Dems’ confirmation obstruction is an anti-democratic, dangerous stunt",
    "description": "Senate Dems, powerless and frustrated over President Trump’s historic series of wins, are throwing a hissy fit for the ages by slow walking his appointees through the confirmation process.",
    "link": "https://nypost.com/2025/07/31/opinion/chuck-schumer-senate-dems-waste-time/",
    "timestamp": "2025-07-31T21:19:01Z"
  },
  {
    "title": "RFK Jr. is asking Americans to give the government something he warned against for years",
    "description": "As HHS secretary, Robert F. Kennedy Jr. sat next to Trump in the White House and touted the kind of data gathering Laura Loomer and anti-vaccine advocates fear.",
    "link": "https://www.msnbc.com/opinion/analysis/rfk-jr-conspiracy-theories-wearable-health-devices-data-rcna222339",
    "timestamp": "2025-07-31T21:18:18Z"
  },
  {
    "title": "Is cane sugar Coca-Cola a healthier option? Here’s what experts say",
    "description": "While studies have linked high-fructose corn syrup to conditions such as insulin resistance, nutrition experts told PBS News that cane sugar is not a healthier alternative.",
    "link": "https://www.pbs.org/newshour/health/is-cane-sugar-coca-cola-a-healthier-option-heres-what-experts-say",
    "timestamp": "2025-07-31T21:18:04Z"
  },
  {
    "title": "No deal for Canada yet to halt tariff increase, as Trump's deadline looms",
    "description": "U.S. President Donald Trump said Thursday he had not spoken with Prime Minister Mark Carney, the day before his deadline to increase tariffs on Canadian products.",
    "link": "https://www.cbc.ca/news/world/trump-tariffs-canada-deadline-1.7598480",
    "timestamp": "2025-07-31T21:16:18Z"
  },
  {
    "title": "Deadline Day Is Here And The BRICS Countries Are Not Cooperating – So How Will The “Wall Of Tariffs” Impact The U.S. Economy?",
    "description": "It was nice while it lasted.  Nations all over the globe had until August 1st to agree to a trade deal with the Trump administration.  Some of them made deals, but most of them did not.  Those that did not will now be hit by a “wall of tariffs”, with individu…",
    "link": "http://theeconomiccollapseblog.com/deadline-day-is-here-and-the-brics-countries-are-not-cooperating-so-how-will-the-wall-of-tariffs-impact-the-u-s-economy/",
    "timestamp": "2025-07-31T21:16:05Z"
  },
  {
    "title": "Tim Cook says Apple is ‘open to’ AI acquisitions",
    "description": "Apple CEO Tim Cook says the company is “open” to mergers and acquisitions as it “significantly” increases its investment in AI, as reported by CNBC. Cook’s statements were made alongside the release of Apple’s third-quarter earnings results, which revealed th…",
    "link": "https://www.theverge.com/news/716790/apple-earnings-q3-2025-ai-tim-cook",
    "timestamp": "2025-07-31T21:16:02Z"
  },
  {
    "title": "UCSF: This Is How to Cut Hospital Visits for Kids With Eating Disorders",
    "description": "Hospitalization can be especially challenging for families on Medicaid, which will suffer even greater cuts due to President Trump’s new spending bill.",
    "link": "https://www.kqed.org/news/12050453/ucsf-this-is-how-to-cut-hospital-visits-for-kids-with-eating-disorders",
    "timestamp": "2025-07-31T21:15:43Z"
  },
  {
    "title": "Fox News Had Only 3 Minutes of Epstein Coverage in the Last 4 Days – and 85 Minutes of Sydney Sweeney’s Jeans Ad",
    "description": "The news channel mentioned the controversial American Eagle campaign 62 times since Monday, Media Matters reports\nThe post Fox News Had Only 3 Minutes of Epstein Coverage in the Last 4 Days – and 85 Minutes of Sydney Sweeney’s Jeans Ad appeared first on TheWr…",
    "link": "https://www.thewrap.com/fox-news-sydney-sweeney-jeans-ad-coverage-jeffrey-epstein/",
    "timestamp": "2025-07-31T21:14:05Z"
  },
  {
    "title": "What the Labubu Obsession Says About Us",
    "description": "From the daily newsletter: why the tiny, grinning monsters became the latest cultural craze.",
    "link": "https://www.newyorker.com/newsletter/the-daily/what-the-labubu-obsession-says-about-us",
    "timestamp": "2025-07-31T21:13:25Z"
  },
  {
    "title": "Trump Gives Mexico 90-Day Reprieve From Higher Tariffs",
    "description": "President Donald Trump extended Mexico’s current tariff rates for 90 days to allow more time for trade negotiations, again relenting after threatening to raise levies on a major trading partner.\nEarlier this month, the US president had signaled plans to hike …",
    "link": "https://biztoc.com/x/41f3c91817e86860",
    "timestamp": "2025-07-31T21:13:21Z"
  },
  {
    "title": "Saylor's Strategy swings to quarterly profit amid crypto goldrush",
    "description": "Strategy reported its first profit in six quarters on Thursday, as the biggest corporate holder of bitcoin benefited from a remarkable quarter for cryptocurrencies.In a watershed moment of legitimacy for the crypto industry, U.S. President Donald Trump signed…",
    "link": "https://www.channelnewsasia.com/business/saylors-strategy-swings-quarterly-profit-amid-crypto-goldrush-5271006",
    "timestamp": "2025-07-31T21:13:19Z"
  },
  {
    "title": "'Inappropriate!' Agitated Trump bashes 'lunatic' reporter after grilling on tariff law",
    "description": "An agitated President Donald Trump called a reporter a \"lunatic\" — minutes after bashing another reporter — during a question-and-answer session Thursday afternoon, reacting to a question about his tariff policy.\"As you know, a federal appellate court today h…",
    "link": "https://www.rawstory.com/trump-tariffs-2673797024/",
    "timestamp": "2025-07-31T21:11:58Z"
  },
  {
    "title": "Sean 'Diddy' Combs argues 'freak offs' protected by First Amendment",
    "description": "The hip-hop mogul is trying to get the counts for which he was convicted thrown out ahead of his October sentencing.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/sean-diddy-combs-acquittal-motion-new-trial-freak-offs-rcna222330",
    "timestamp": "2025-07-31T21:11:42Z"
  },
  {
    "title": "Trump says it is 'disgusting' what Russia doing to Ukraine",
    "description": "U.S. President Donald Trump on Thursday sharply criticized Russia's \"disgusting\" behavior against Ukraine and said he plans to impose sanctions on Moscow if ...",
    "link": "https://www.yahoo.com/news/articles/trump-says-disgusting-russia-doing-210955641.html",
    "timestamp": "2025-07-31T21:09:55Z"
  },
  {
    "title": "White House says no decision yet for location of 2026 G20 summit",
    "description": "WASHINGTON (Reuters) -The White House said on Thursday it is not yet ready to announce the location of next year's Group of 20 leaders' summit, following reports that President Donald Trump is considering hosting the event at his Doral golf club in Miami, Flo…",
    "link": "https://www.thestar.com.my/news/world/2025/08/01/white-house-says-no-decision-yet-for-location-of-2026-g20-summit",
    "timestamp": "2025-07-31T21:09:00Z"
  },
  {
    "title": "Trump: Gaza hunger crisis is ‘terrible,’ Hamas is stealing US food aid",
    "description": "President Trump says Iran’s nuclear program was “decimated” and lauds US pilots’ B-2 missions. On Gaza, he calls the situation “terrible,” noting $60 million in US aid hasn’t reached the people, blaming Hamas for diverting food and funds.",
    "link": "https://www.israelnationalnews.com/news/412585",
    "timestamp": "2025-07-31T21:09:00Z"
  },
  {
    "title": "Exclusive — Gemini's Tyler Winklevoss: Fees on Fintech, Crypto Would Only 'Enrich the Bankers'",
    "description": "Tyler Winklevoss, one of the founders of the digital currency exchange Gemini, on Thursday told Breitbart News that the JPMorganChase's proposed fees on data aggregators run contrary to President Donald Trump's goal to make America the crypto \"capital of the …",
    "link": "https://www.breitbart.com/politics/2025/07/31/exclusive-geminis-tyler-winklevoss-fees-on-fintech-crypto-would-only-enrich-the-bankers/",
    "timestamp": "2025-07-31T21:08:42Z"
  },
  {
    "title": "[Ilya Somin] My New Dispatch Article on Judicial Review of Emergency Powers",
    "description": "NA Today, The Dispatch published my article \"Not Everything is an Emergency\" (gift link). Here is an excerpt: The Trump administration…",
    "link": "https://reason.com/volokh/2025/07/31/my-new-dispatch-article-on-judicial-review-of-emergency-powers/",
    "timestamp": "2025-07-31T21:08:38Z"
  },
  {
    "title": "Apple sets quarterly revenue record as earnings broadly beat expectations, shares climb",
    "description": "“Apple is proud to report a June quarter revenue record with double-digit growth in iPhone, Mac and Services and growth around the world, in every geographic...",
    "link": "https://finance.yahoo.com/news/apple-sets-quarterly-revenue-record-210811250.html",
    "timestamp": "2025-07-31T21:08:11Z"
  },
  {
    "title": "Apple sets quarterly revenue record as earnings broadly beat expectations, shares climb",
    "description": "“Apple is proud to report a June quarter revenue record with double-digit growth in iPhone, Mac and Services and growth around the world, in every geographic segment,\" CEO Tim Cook said.",
    "link": "https://fortune.com/2025/07/31/apple-earnings-third-quarter-record-revenue-tariffs-china/",
    "timestamp": "2025-07-31T21:08:11Z"
  },
  {
    "title": "Trump revives Presidential Fitness Test, football coach wonders why it was ever stopped | Fox News Video",
    "description": "FOX Sports college football analyst Urban Meyer applauds President Donald Trump for reviving the Presidential Fitness Test on ‘The Will Cain Show.’",
    "link": "https://www.foxnews.com/video/6376405125112",
    "timestamp": "2025-07-31T21:07:33Z"
  },
  {
    "title": "White House unveils plans for new $200m ballroom",
    "description": "Donald Trump has been calling for the White House to build a new ballroom for nearly a decade.",
    "link": "https://www.bbc.com/news/articles/c2l7dey54zjo",
    "timestamp": "2025-07-31T21:05:36Z"
  },
  {
    "title": "Trump delays tariff hike on Mexican imports",
    "description": "Trump's threatened 30% tariff on Mexican goods would have started Friday.",
    "link": "https://www.salon.com/2025/07/31/trump-delays-tariff-hike-on-mexican-imports/",
    "timestamp": "2025-07-31T21:05:24Z"
  },
  {
    "title": "The week in whoppers: Kathy Hochul bombs out defending Zohran Mamdani, UK’s Keir Starmer gaslights on censorship and more",
    "description": "Gov. Kathy excused Democratic mayoral candidate Zohran Mamdani's record of calling police officers “racist” and a “threat to public safety\" back in 2020 because he wasn't an elected official yet.",
    "link": "https://nypost.com/2025/07/31/opinion/the-week-in-whoppers-kathy-hochul-bombs-out-defending-zohran-mamdani-uks-keir-starmer-gaslights-on-censorship-and-more/",
    "timestamp": "2025-07-31T21:04:31Z"
  },
  {
    "title": "What stops the tech juggernaut?",
    "description": "In my column today I analyze Fed Chair Jerome Powell's press conference, and the message that came across loud and clear - as long as the unemployment rate...",
    "link": "https://finance.yahoo.com/news/stops-tech-juggernaut-210344198.html",
    "timestamp": "2025-07-31T21:03:44Z"
  },
  {
    "title": "Trump ally Jeffrey Clark should be disbarred over 2020 election effort, DC panel says",
    "description": "Clark is now overseeing a federal regulatory office.",
    "link": "https://www.bostonherald.com/2025/07/31/jeffrey-clark/",
    "timestamp": "2025-07-31T21:02:41Z"
  },
  {
    "title": "Washington trade talks with India have stalled, sources say",
    "description": "US-India trade talks appear to have stalled, according to two sources familiar with the matter, as both sides remain unwilling to compromise on opening India’s agriculture and dairy markets to US products.\nBefore US President Donald Trump announced on Wednesd…",
    "link": "https://biztoc.com/x/6ba16414179ad957",
    "timestamp": "2025-07-31T21:02:38Z"
  },
  {
    "title": "Trump: Not sure sanctions bother Putin, will impose them",
    "description": "United States President Donald Trump announced on Thursday that he will impose sanctions on Russia, but that he was unsure whether it would affect his Russian counterpart, Vladimir Putin. More to come...",
    "link": "https://biztoc.com/x/8773b546e71829f3",
    "timestamp": "2025-07-31T21:02:29Z"
  },
  {
    "title": "Krugman: Trump’s Europe Deal A 'Scam On His Voters'",
    "description": "The New Republic's Greg Sargent and award winning economist Paul Krugman break down the hype over Trump's latest trade deal with the European Union and why it's actually a big loss for our country, and for Trump's voters.\nYou’ve probably heard that President …",
    "link": "https://crooksandliars.com/2025/07/krugman-trump-s-europe-deal-scam-his",
    "timestamp": "2025-07-31T21:01:37Z"
  },
  {
    "title": "Victim's 's family wants to know what president knew...",
    "description": "\"We and the public are asking for answers; survivors deserve this.\"",
    "link": "https://abcnews.go.com/US/virginia-giuffres-family-donald-trump-knew-jeffrey-epstein/story?id=124238103",
    "timestamp": "2025-07-31T21:00:03Z"
  },
  {
    "title": "Beijing officials warm to the idea of a yuan stablecoin, driven by the ‘fear of missing out’",
    "description": "Some Chinese officials worry that the U.S.'s decision to embrace stablecoins through the Genius Act might reverse the trend of de-dollarization.",
    "link": "https://fortune.com/asia/2025/07/31/china-us-hong-kong-stablecoins-dollar-yuan-genius-act/",
    "timestamp": "2025-07-31T21:00:00Z"
  },
  {
    "title": "The White House Announces Restoration of the Presidential Fitness Test and Revitalization of the President’s Council on Sports, Fitness & Nutrition",
    "description": "The White House Announces Restoration of the Presidential Fitness Test and Revitalization of the President’s Council on Sports, Fitness & Nutritionwhitehouse.gov",
    "link": "https://www.whitehouse.gov/briefings-statements/2025/07/the-white-house-announces-restoration-of-the-presidential-fitness-test-and-revitalization-of-the-presidents-council-on-sports-fitness-nutrition/",
    "timestamp": "2025-07-31T21:00:00Z"
  },
  {
    "title": "Trump Tariff Threat Triggers Political Firestorm in India",
    "description": "India’s political opposition is furious with Prime Minister Narendra Modi for failing to secure a trade deal with the United States.\nThe post Trump Tariff Threat Triggers Political Firestorm in India appeared first on Breitbart.",
    "link": "https://www.breitbart.com/economy/2025/07/31/trump-tariff-threat-triggers-political-firestorm-india/",
    "timestamp": "2025-07-31T20:59:30Z"
  },
  {
    "title": "Shari Redstone Says Content Is Still King As Her Family’s Long Paramount Run Is A Wrap",
    "description": "Paramount Global chair and controlling shareholder Shari Redstone has just thanked investors and her company’s co-CEOs. She recalled her father, the late Sumner Redstone, who grew Par into a media powerhouse, as the company prepared to merge with Skydance nex…",
    "link": "http://deadline.com/2025/07/shari-sumner-redstone-paramount-skydance-merger-1236475848/",
    "timestamp": "2025-07-31T20:59:14Z"
  },
  {
    "title": "White House announces new $200m ballroom - a longtime Trump wish",
    "description": "Donald Trump has been calling for the White House to build a new ballroom for nearly a decade.",
    "link": "https://www.bbc.co.uk/news/articles/c2l7dey54zjo",
    "timestamp": "2025-07-31T20:58:59Z"
  },
  {
    "title": "2024 Might-have-beens",
    "description": "A new book reaffirms that Trump's path to victory lay in running up the score with men.",
    "link": "https://www.ncspin.com/2024-might-have-beens",
    "timestamp": "2025-07-31T20:58:51Z"
  },
  {
    "title": "Patrick Eddington: How to 'Tyranny-Proof' America",
    "description": "The former CIA analyst and Cato scholar discusses Palantir, Trump's new national database, and the sordid history of federal law enforcement on 'Just Asking Questions'.",
    "link": "https://reason.com/podcast/2025/07/31/patrick-eddington-how-to-tyranny-proof-america/",
    "timestamp": "2025-07-31T20:58:36Z"
  },
  {
    "title": "The Senate Inches Closer To Taking Away Israel's Blank Check",
    "description": "Amid reports of Palestinian starvation, a majority of the Democratic Caucus—but no Republicans—voted to block U.S. weapons shipments to Israel.",
    "link": "https://reason.com/2025/07/31/the-senate-inches-closer-to-taking-away-israels-blank-check/",
    "timestamp": "2025-07-31T20:58:00Z"
  },
  {
    "title": "Notorious Pro-Trump Lawyer Should Be Disbarred for 2020 Election Plot: Panel",
    "description": "Attorney Jeffrey Clark, a former Department of Justice official who engaged in a plot to keep U.S. President Donald Trump illegally in power more than five years ago, may not be an attorney much longer.Politico reported on Thursday that the District of Columb…",
    "link": "https://www.commondreams.org/news/jeffrey-clark-disbarment",
    "timestamp": "2025-07-31T20:57:29Z"
  },
  {
    "title": "Apple overcomes Trump’s trade war, slow start in AI to deliver surprisingly strong quarter",
    "description": "The company earned $23.4 billion during its fiscal third quarter, a 9% increase from the same time last year.",
    "link": "https://www.bostonherald.com/2025/07/31/apple-quarter-results/",
    "timestamp": "2025-07-31T20:57:05Z"
  },
  {
    "title": "Pro-Palestine demonstrators vow Harbour Bridge protest will go ahead",
    "description": "NSW Police are desperately trying to block a planned crossing of the Sydney Harbour Bridge by pro-Palestine protesters, and ASIO's boss has criticised the 'head-spinning' complacency of public officials regarding AUKUS.\nThe post Pro-Palestine demonstrators vo…",
    "link": "http://www.crikey.com.au/2025/08/01/palestine-protest-sydney-harbour-bridge-asio-aukus/",
    "timestamp": "2025-07-31T20:56:40Z"
  },
  {
    "title": "Fears over tariff price rises prompted panic buying of iPhones",
    "description": "Prior to the earnings conference call, Tim Cook said that Apple saw users buying devices such as the iPhone outside of normal expectations because of concerns that tariffs would force prices to rise.Tim Cook and Donald Trump in a meeting at the White House in…",
    "link": "https://appleinsider.com/articles/25/07/31/fears-over-tariff-price-rises-prompted-panic-buying-of-iphones",
    "timestamp": "2025-07-31T20:55:35Z"
  },
  {
    "title": "Was Gen Z’s Trump era just a phase?",
    "description": "As Donald Trump’s presidency shoulders on, a curious thing is happening with the youngest cohort of American voters: Gen Z’s support for the president is crumbling, but they’re not swinging in favor of the Democrats — yet. It’s an amplification of a more gene…",
    "link": "https://www.vox.com/politics/421896/young-gen-z-trump-republican-voter-democrat-shift-right-disapprove",
    "timestamp": "2025-07-31T20:55:14Z"
  },
  {
    "title": "Rand Paul Sparks Fury for Floating Potential Third Trump Term: 'Chilling'",
    "description": "The notion of a Trump third term has periodically surfaced among Trump allies and the president himself.",
    "link": "https://www.newsweek.com/rand-paul-trump-third-term-fury-2107264",
    "timestamp": "2025-07-31T20:54:47Z"
  },
  {
    "title": "New Trump Policy Could Ban Thousands of Adult Students From Classes",
    "description": "Many students, including U.S. citizens, lack the proper verification documents. \nThe post New Trump Policy Could Ban Thousands of Adult Students From Classes appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/07/31/undocumented-adult-students-ban/",
    "timestamp": "2025-07-31T20:54:11Z"
  },
  {
    "title": "EXCLUSIVE VIDEO: Alan Dershowitz Says Martha’s Vineyard Vendor Refused To Sell Him Pierogies Over ‘Politics’",
    "description": "Alan Dershowitz said he would be filing suit against a farmer’s market vendor for refusing to sell him pierogis because Dershowitz defended Donald Trump.",
    "link": "https://dailycaller.com/2025/07/31/exclusive-video-alan-dershowitz-marthas-vineyard-vendor-refused-pierogies-over-politics/",
    "timestamp": "2025-07-31T20:54:03Z"
  },
  {
    "title": "Did Trump Know What Epstein “Stole” Virginia Giuffre For?",
    "description": "Joan Walsh\n\n\n\nDonald Trump said this week that a known Epstein victim was one of the people “stolen” from Mar-a-Lago by the convicted sex offender. Could Trump have known what would happen to her?\r\n\n\r\n\n\nThe post Did Trump Know What Epstein “Stole” Virginia Gi…",
    "link": "https://www.thenation.com/article/politics/trump-epstein-stolen-giuffre/",
    "timestamp": "2025-07-31T20:53:29Z"
  },
  {
    "title": "Boy (6) among 14 dead after Russia’s blitz on Kyiv",
    "description": "Russia launched waves of missiles and drones on Kyiv before dawn on Thursday, killing at least 14 people including a six-year-old boy, and wounding well over 100 others, officials in the Ukrainian capital said.",
    "link": "https://www.independent.ie/world-news/europe/boy-6-among-14-dead-after-russias-blitz-on-kyiv/a440333259.html",
    "timestamp": "2025-07-31T20:53:23Z"
  },
  {
    "title": "Trump signs executive order to reestablish Presidential Fitness Test",
    "description": "President Donald Trump signed an executive order to reestablish the Presidential Physical Fitness test and the President’s Council on Sports, Fitness and Nutrition.",
    "link": "https://www.foxnews.com/sports/trump-signs-executive-order-reestablish-presidential-fitness-test",
    "timestamp": "2025-07-31T20:53:04Z"
  },
  {
    "title": "Should Canada have warned the U.S. about recognizing Palestinian statehood?",
    "description": "Carney mentioned speaking to the leaders of France, U.K. and the EU, but U.S. President Donald Trump was apparently not given the same heads up",
    "link": "https://nationalpost.com/news/should-canada-have-warned-us-about-recognizing-palestinian-statehood",
    "timestamp": "2025-07-31T20:52:51Z"
  },
  {
    "title": "Apple overcomes Trump's trade war, slow start in AI to deliver surprisingly strong quarter",
    "description": "Apple shook off a thicket of tariffs and a botched entry into artificial intelligence to accelerate its revenue growth during its springtime quarter, but the...",
    "link": "https://finance.yahoo.com/news/apple-overcomes-trumps-trade-war-205143235.html",
    "timestamp": "2025-07-31T20:51:43Z"
  },
  {
    "title": "Trump to finance $200 million WH ballroom",
    "description": "United States President Donald Trump revealed on Thursday plans to construct a new state-of-the-art ballroom on the east side of the White House, a project he estimates will cost around $200 million. ...",
    "link": "https://biztoc.com/x/f67f86d7d58e914e",
    "timestamp": "2025-07-31T20:51:37Z"
  },
  {
    "title": "Trump: Canada's Palestine move not a dealbreaker",
    "description": "United States President Donald Trump reiterated on Thursday that he \"didn't like\" that Canada announced it plans to recognize the State of Palestine, but stressed it was not a \"dealbreaker\" for a pote...",
    "link": "https://biztoc.com/x/359d4723beb23b3b",
    "timestamp": "2025-07-31T20:51:20Z"
  },
  {
    "title": "Trump: Iran has not been saying the right thing",
    "description": "\"Iran has not been saying the right thing. They have not been speaking nicely and they should be,\" United States President Donald Trump told reporters on Thursday.More to come......",
    "link": "https://biztoc.com/x/0f12fb8ac3f887f4",
    "timestamp": "2025-07-31T20:51:19Z"
  },
  {
    "title": "Law Firms Take Fewer Pro Bono Clients After Trump's Unconstitutional Orders",
    "description": "President Donald Trump reentered office in January promising retribution against those he felt had wronged him, either during his first term or in his interregnum. Making good on that pledge, Trump issued numerous executive orders targeting law firms that hav…",
    "link": "https://biztoc.com/x/26283533286b4e0b",
    "timestamp": "2025-07-31T20:51:15Z"
  },
  {
    "title": "Trump brings back presidential fitness test",
    "description": "President Donald Trump signed an executive order on Thursday afternoon, reinstating the national fitness assessment. The Presidential Fitness Test was implemented in public schools from 1956 until 201...",
    "link": "https://biztoc.com/x/79fa6380824e1633",
    "timestamp": "2025-07-31T20:51:14Z"
  },
  {
    "title": "Donald Trump announces plans for new $200mn White House ballroom",
    "description": "Addition to historic mansion to be paid for by US president and ‘patriotic donors’, says administration",
    "link": "https://biztoc.com/x/ea9b209e59c0705e",
    "timestamp": "2025-07-31T20:51:01Z"
  },
  {
    "title": "Donald Trump Restores Public School Program Axed by Obama Administration",
    "description": "The test once required students to run and complete exercises such as sit-ups, pullups or pushups, along with a flexibility assessment.",
    "link": "https://biztoc.com/x/933f6659af0a8938",
    "timestamp": "2025-07-31T20:50:58Z"
  },
  {
    "title": "US President Donald Trump gives Mexico 90-day tariff reprieve as talks continue, hours before Aug 1 deadline",
    "description": "With hours to go before the planned tariff deadline, US President Donald Trump has given Mexico a 90-day reprieve from higher tariffs to negotiate.",
    "link": "https://thenightly.com.au/business/us-president-donald-trump-gives-mexico-90-day-tariff-reprieve-as-talks-continue-hours-before-aug-1-deadline-c-19541226",
    "timestamp": "2025-07-31T20:50:54Z"
  },
  {
    "title": "A 'beautiful' ballroom and a new Lincoln bathroom: Trump relishes remaking the White House",
    "description": "President Donald Trump discussed his plans to renovate the White House, including a new ballroom, gold in the Oval Office and an updated Lincoln Bedroom bathroom.",
    "link": "https://www.nbcnews.com/politics/donald-trump/ballroom-trump-renovating-white-house-gold-oval-office-rose-garden-rcna221937",
    "timestamp": "2025-07-31T20:50:49Z"
  },
  {
    "title": "Fact Sheet: President’s Council on Sports, Fitness, and Nutrition, and the Reestablishment of the Presidential Fitness Test",
    "description": "RESTORING HEALTH AND FITNESS FOR AMERICA’S YOUTH: Today, President Donald J. Trump signed an Executive Order revitalizing the President’s Council on",
    "link": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-presidents-council-on-sports-fitness-and-nutrition-and-the-reestablishment-of-the-presidential-fitness-test/",
    "timestamp": "2025-07-31T20:50:06Z"
  },
  {
    "title": "Donald Trump Restores Public School Program Axed by Obama Administration",
    "description": "The test once required students to run and complete exercises such as sit-ups, pullups or pushups, along with a flexibility assessment.",
    "link": "https://www.newsweek.com/donald-trump-restores-public-school-program-axed-obama-administration-2107281",
    "timestamp": "2025-07-31T20:47:55Z"
  },
  {
    "title": "RNC Chair Officially Announces North Carolina Senate Run With Trump’s Backing",
    "description": "Republican National Committee (RNC) chair Michael Whatley officially announced on Thursday that he is running in North Carolina's 2026 Senate race.",
    "link": "https://dailycaller.com/2025/07/31/michael-whatley-north-carolina-senate-republican-trump/",
    "timestamp": "2025-07-31T20:47:07Z"
  },
  {
    "title": "Sanders Heading to West Virginia and North Carolina for Latest Swing of 'Fighting Oligarchy' Tour",
    "description": "For the first time since U.S. President Donald Trump signed his domestic policy into law, handing out tax breaks to the rich that will far outweigh those for working-class families and slashing healthcare and food assistance programs that millions depend on, …",
    "link": "https://www.commondreams.org/news/bernie-sanders-north-carolina",
    "timestamp": "2025-07-31T20:46:31Z"
  },
  {
    "title": "Trump to revive Presidential Fitness Test",
    "description": "The Presidential Fitness Test is coming back. President Donald Trump will sign an executive order Thursday afternoon reinstating the national fitness assessment implemented in public schools from 1956 until 2013, a White House official told NBC News. The role…",
    "link": "https://freerepublic.com/focus/f-news/4331937/posts",
    "timestamp": "2025-07-31T20:44:24Z"
  },
  {
    "title": "Air Marshals, reassigned from commercial flights, 'serve sandwiches and check lice' on deportation flights...",
    "description": "Air Marshals, reassigned from commercial flights, 'serve sandwiches and check lice' on deportation flights...\r\n\n \n \n \n (First column, 9th story, link)\r\n\n \r\n\n \r\n\n \n Related stories:COLD AS ICE: Woman Who Died in Custody Told Son She Wasn't Allowed to See Docto…",
    "link": "https://www.cnn.com/2025/07/31/politics/ice-deportation-air-marshals",
    "timestamp": "2025-07-31T20:43:37Z"
  },
  {
    "title": "Trump restores Presidential Fitness Test",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr., at the event, recalled the previous tradition of awarding the top 15% of performers in the presidential fitness test with a badge of honor.",
    "link": "https://justthenews.com/politics-policy/health/trump-restores-presidential-fitness-test",
    "timestamp": "2025-07-31T20:42:59Z"
  },
  {
    "title": "Trump Admin Teams Up With Big Tech On Private Health Tracking Program",
    "description": "President Donald Trump's CMS are partnering with tech giants and healthcare conglomerates to form a broad new online medical database.",
    "link": "https://dailycaller.com/2025/07/31/trump-admin-with-big-tech-private-health-tracking-program-rfk-jr-maha-dr-oz-david-sacks/",
    "timestamp": "2025-07-31T20:41:13Z"
  },
  {
    "title": "A Texas researcher was held at an airport for over a week. Now he faces deportation",
    "description": "A researcher at Texas A&M University flying home from abroad was detained for more than a week by immigration authorities at the San Francisco International ...",
    "link": "https://www.yahoo.com/news/articles/texas-researcher-held-airport-over-204054031.html",
    "timestamp": "2025-07-31T20:40:54Z"
  },
  {
    "title": "In Rare Spasm of Sanity, Pentagon Backtracks on Plan to Scuttle Storm Tracking",
    "description": "The Department of Defense has walked back its decision to stop sharing satellite storm data with federal forecasters.",
    "link": "https://gizmodo.com/in-rare-spasm-of-sanity-pentagon-backtracks-on-plan-to-scuttle-storm-tracking-2000637473",
    "timestamp": "2025-07-31T20:40:49Z"
  },
  {
    "title": "BREAKING: Trump signs executive order reinstating Presidential Fitness Test",
    "description": "“The order that I’ll sign today in a few moments directs the council to develop strategies to improve America’s physical fitness and renew the American spirit, excellence, competitiveness, and sportsmanship.”",
    "link": "https://thepostmillennial.com/breaking-trump-signs-executive-order-reinstating-presidential-fitness-test",
    "timestamp": "2025-07-31T20:40:31Z"
  },
  {
    "title": "Trump Suspends Trade Loophole For Cheap Online Retailers Globally",
    "description": "An anonymous reader quotes a report from Ars Technica: E-commerce giants everywhere felt the sting Wednesday when President Donald Trump announced that the US will be \"suspending duty-free de minimis treatment for low-value shipments\" worth $800 or less from …",
    "link": "https://news.slashdot.org/story/25/07/31/2028246/trump-suspends-trade-loophole-for-cheap-online-retailers-globally",
    "timestamp": "2025-07-31T20:40:00Z"
  },
  {
    "title": "Trump Is Tearing Up Part Of The White House To Build A $200 Million Ballroom",
    "description": "The president has been wanting a bigger event space. It looks like he's going to get it.",
    "link": "https://www.huffpost.com/entry/donald-trump-new-white-house-ballroom_n_688bb167e4b0f5c3b7c9b3fb",
    "timestamp": "2025-07-31T20:39:34Z"
  },
  {
    "title": "White House Pushes for Trump to Be Awarded Nobel Peace Prize—and One for Economics",
    "description": "President Donald Trump has long craved a Nobel Peace Prize, and has bemoaned that President Barack Obama was awarded the honor but he never has. Now, it appears, the White House is campaigning for the President to receive, not one but two Nobels—one for peace…",
    "link": "https://www.thenewcivilrightsmovement.com/2025/07/white-house-pushes-for-trump-to-be-awarded-nobel-peace-prize-and-one-for-economics/",
    "timestamp": "2025-07-31T20:39:18Z"
  }
]