[
  {
    "title": "Top Coins to 100x as SEC Acknowledges First-Ever Dogecoin ETF Filing",
    "description": "The SEC has acknowledged the filing of a new crypto ETF proposal by Grayscale. That’s the same asset management firm that filed a bid to create a Solana ETF just four days ago. However, this time around, the request is to create a Dogecoin ETF, which makes th…",
    "link": "http://www.newsbtc.com/news/top-coins-to-100x-as-sec-acknowledges-first-ever-dogecoin-etf-filing/",
    "timestamp": "2025-02-14T15:23:51Z"
  },
  {
    "title": "Trump Is Revealing His Most Relatable Quality Ever",
    "description": "President Donald Trump has been revealing his most relatable quality in recent days.",
    "link": "https://dailycaller.com/2025/02/14/donald-trump-india-modi-reporter-indian-accent-press-conference/",
    "timestamp": "2025-02-14T15:23:17Z"
  },
  {
    "title": "Trump pledges action against Islamic terrorists, Khalistani subversives",
    "description": "US President Donald Trump pledged to address India's security concerns, including extraditing Tahawwur Rana and acting against US-based Khalistani separatists. Trump and Modi agreed on joint action against radical Islamic terrorism. He offered to mediate Indi…",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-pledges-action-against-islamic-terrorists-khalistani-subversives/articleshow/118253332.cms",
    "timestamp": "2025-02-14T15:23:01Z"
  },
  {
    "title": "TikTok returns to Apple App Store and Google Play in US",
    "description": "TikTok returned to the US app stores of Apple and Google on Thursday as President Donald Trump delayed a ban on the Chinese-owned social media app and assured the tech giants they would not be fined for distributing or maintaining it.\nThe popular short video …",
    "link": "https://biztoc.com/x/f9bbb45ab5365286",
    "timestamp": "2025-02-14T15:23:01Z"
  },
  {
    "title": "Reciprocity and power play in a Trumpian world",
    "description": "Trade tangle. The US memorandum breaks all WTO rules. Larger developing countries must take the lead and push back",
    "link": "https://www.thehindubusinessline.com/opinion/reciprocity-and-power-play-in-a-trumpian-world/article69220473.ece",
    "timestamp": "2025-02-14T15:22:43Z"
  },
  {
    "title": "Goodnight, Goon. Elon Musk Is Whispering 'Cuts,' Sleeping on the Floor Near the White House",
    "description": "He really is in the DOGEhouse, huh?",
    "link": "https://www.vanityfair.com/style/story/elon-musk-sleeping-in-his-office-white-house",
    "timestamp": "2025-02-14T15:22:14Z"
  },
  {
    "title": "References to transgender and queer removed from Stonewall National Monument’s web page",
    "description": "References to transgender and queer people were erased from the Stonewall National Monument's web page, marking one of the latest moves of the current administration after President Donald Trump said the government would recognize male and female as the only …",
    "link": "https://www.nbcnews.com/nbc-out/out-news/references-transgender-queer-removed-stonewall-monuments-webpage-rcna192204",
    "timestamp": "2025-02-14T15:22:12Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team’s access to federal government’s payment system",
    "description": "The audit marks part of the broader effort to provide transparency about DOGE’s activities.",
    "link": "https://www.bostonherald.com/2025/02/14/treasury-watchdog-begins-audit-of-musk-doge-teams-access-to-federal-governments-payment-system/",
    "timestamp": "2025-02-14T15:22:10Z"
  },
  {
    "title": "India's prime minister has adopted a familiar slogan: 'Make India Great Again'",
    "description": "India's Prime Minister Narendra Modi and President Donald Trump.\nAndrew Harnik/Getty Images\nIndia's prime minister met with President Donald Trump this week.\nNarendra Modi said India and the US had agreed to aim to double bilateral trade to $500 billion by 20…",
    "link": "https://biztoc.com/x/41b24604a8c43b75",
    "timestamp": "2025-02-14T15:22:10Z"
  },
  {
    "title": "JD Vance criticizes European allies for not listening to their citizens | CNN",
    "description": "US Vice President JD Vance vented at European leaders Friday, telling them that the biggest threat to their security was “from within,” rather than China and Russia.",
    "link": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl/index.html",
    "timestamp": "2025-02-14T15:22:05Z"
  },
  {
    "title": "READ: Donald Trump’s official reciprocal tariff announcement",
    "description": "United States President Donald Trump announced Thursday reciprocal tariffs against some of its biggest trading partners, including Canada.\nWhile details of the tariffs remain scarce, the move allows the U.S. Trade Representative and Commerce secretary to prop…",
    "link": "https://biztoc.com/x/dbfd93727ab1710d",
    "timestamp": "2025-02-14T15:22:00Z"
  },
  {
    "title": "Retail Spending Slips As Inflation Climbs In January, Adding To Economic Concerns",
    "description": "After a solid holiday season, US retail sales took a surprising step back to start 2025, snapping a streak of growth and fueling worries about the economy. \nRetail and food services sales fell 0.9 pe…",
    "link": "https://dailyvoice.com/virginia/arlington/retail-spending-slips-as-inflation-climbs-in-january-adding-to-economic-concerns/",
    "timestamp": "2025-02-14T15:21:42Z"
  },
  {
    "title": "The Math of the “Trump Bump” — Could Stocks Rally 30% in 2025?",
    "description": "In the wake of Donald Trump’s victory in the 47th U.S. Presidential Election, the stock market has experienced a significant surge, often referred to as the “Trump Bump.”\nSince Election Day, the S&P 500 has climbed over 6%, while the Nasdaq has seen an impres…",
    "link": "https://biztoc.com/x/f2ed3f4604ac7ec7",
    "timestamp": "2025-02-14T15:21:29Z"
  },
  {
    "title": "The Revolving Door Project Publishes List Tracking Reports Elon Musk and His Companies Flout the Law and Regulations",
    "description": "In response to quasi-President Musk’s manifest disregard of federal law and the constitutional order, The Revolving Door Project published a document\r\n tracking Musk’s career of routinely disregarding laws, regulations and rules. Along with this tracker, the …",
    "link": "https://www.commondreams.org/newswire/the-revolving-door-project-publishes-list-tracking-reports-elon-musk-and-his-companies-flout-the-law-and-regulations",
    "timestamp": "2025-02-14T15:21:17Z"
  },
  {
    "title": "Saudi Arabia Says It Would Be Delighted to Host Trump-Putin Summit",
    "description": "The Foreign Ministry of Saudi Arabia confirmed on Friday it is interested in hosting a summit between President Donald Trump and his Russian counterpart Vladimir Putin in the near future after Trump floated the possibility. President Trump held a phone conver…",
    "link": "https://freerepublic.com/focus/f-news/4297577/posts",
    "timestamp": "2025-02-14T15:20:13Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system",
    "link": "https://abcnews.go.com/US/wireStory/treasury-watchdog-begins-audit-musk-doge-teams-access-118825447",
    "timestamp": "2025-02-14T15:18:29Z"
  },
  {
    "title": "JD Vance: Everything We Do Should be to Defend Democracy, But Europe is Abandoning Shared Values",
    "description": "America finds Europe's retreat from shared values as the continent turns away from democracy and towards censorship \"shocking\", Vance said.\nThe post JD Vance: Everything We Do Should be to Defend Democracy, But Europe is Abandoning Shared Values appeared firs…",
    "link": "https://www.breitbart.com/europe/2025/02/14/jd-vance-tells-europe-threat-from-within-greatest-risk-to-continent/",
    "timestamp": "2025-02-14T15:18:18Z"
  },
  {
    "title": "Penny Hunters Eye Profit From Trump Coin Attack With Melting Bet",
    "description": "Adam Youngs is looking to make a lot from truckloads of the little red cent.",
    "link": "https://financialpost.com/pmn/business-pmn/penny-hunters-eye-profit-from-trump-coin-attack-with-melting-bet",
    "timestamp": "2025-02-14T15:16:22Z"
  },
  {
    "title": "Joe Rogan Says He Would Have ‘Held’ Kamala Harris’s ‘Hand’ and Been ‘Nice’ In Scrapped Interview, But ‘They Got Scared’",
    "description": "Joe Rogan accused Kamala Harris's campaign of lying to cover up the fact that they \"got scared\" of an interview between the podcaster and former vice president.\nThe post Joe Rogan Says He Would Have ‘Held’ Kamala Harris’s ‘Hand’ and Been ‘Nice’ In Scrapped In…",
    "link": "https://www.mediaite.com/politics/joe-rogan-says-he-would-have-held-kamala-harriss-hand-and-been-nice-in-scrapped-interview-but-they-got-scared/",
    "timestamp": "2025-02-14T15:16:14Z"
  },
  {
    "title": "Europe Can't Assume US Troop \"Will Last Forever\": Defence Secretary",
    "description": "US Defense Secretary Pete Hegseth on Friday warned NATO allies in Europe against assuming that the American troop presence on the continent would &quot;last forever&quot;, as he urged them to spend more on defence.",
    "link": "https://www.ndtv.com/world-news/europe-cant-assume-us-troop-will-last-forever-defence-secretary-pete-hegseth-7711824",
    "timestamp": "2025-02-14T15:16:12Z"
  },
  {
    "title": "Exclusive: Rep. Claudia Tenney Unveils Bill to Designate Trump’s Birthday, Flag Day as Public Holiday",
    "description": "Tenney proposed the Trump’s Birthday and Flag Day Holiday Establishment Act, a bill that would recognize both Trump’s birthday and Flag Day as a legal public holiday on June 14. The New York congresswoman said in a statement to Breitbart News that Trump, as t…",
    "link": "https://freerepublic.com/focus/f-news/4297576/posts",
    "timestamp": "2025-02-14T15:15:41Z"
  },
  {
    "title": "READ: Donald Trump’s official reciprocal tariff announcement",
    "description": "U.S. President Donald Trump announced reciprocal tariffs against some of its biggest trading partners. Read the announcement here.",
    "link": "https://financialpost.com/news/donald-trump-official-reciprocal-tariff-announcement",
    "timestamp": "2025-02-14T15:14:50Z"
  },
  {
    "title": "Treasury Watchdog Begins Audit Of DOGE’s Access To Government's Payment System",
    "description": "The audit will also review the past two years of the system's transactions as it relates to Elon Musk's assertion of “alleged fraudulent payments.\"",
    "link": "https://www.huffpost.com/entry/treasury-watchdog-begins-audit-of-doges-access-to-governments-payment-system_n_67af5bade4b0b48674491ead",
    "timestamp": "2025-02-14T15:14:01Z"
  },
  {
    "title": "'The damage is already done': Why Ken Griffin thinks Trump's tariffs are chipping away at American exceptionalism",
    "description": "The Citadel founder says that the US will lose out on international trade and the AI arms race as a result.",
    "link": "https://www.businessinsider.com/ken-griffin-trump-tariffs-american-exceptionalism-energy-china-deepseek-tech-2025-2",
    "timestamp": "2025-02-14T15:13:32Z"
  },
  {
    "title": "Trump’s Border Czar Is Already Threatening Eric Adams to Comply",
    "description": "Donald Trump’s administration is already holding the threat of prosecution over its newest puppet: New York City Mayor Eric Adams. \r\nAs Donald Trump’s so-called border czar Tom Homan sat on the couch next to Adams on Fox & Friends Friday morning, he joked tha…",
    "link": "https://newrepublic.com/post/191548/donald-trump-border-czar-eric-adams-immigration",
    "timestamp": "2025-02-14T15:12:59Z"
  },
  {
    "title": "This Valentine’s Day, Let’s Ditch Romance Myths and Seek Collective Liberation",
    "description": "In this frightening time, let’s dedicate ourselves to true love and liberation, caring for each other and the world.",
    "link": "https://truthout.org/articles/this-valentines-day-lets-ditch-romance-myths-and-seek-collective-liberation/",
    "timestamp": "2025-02-14T15:12:58Z"
  },
  {
    "title": "Stock market today: Dow, S&P 500, and Nasdaq slip as Tesla, Apple, and major stocks struggle amid tariff fears and weak retail sales",
    "description": "Stock Market Today saw Dow Jones, S&P 500, and Nasdaq futures decline as investors reacted to new tariff concerns and weak retail sales data. Tesla, Apple, and other major stocks faced pressure, while Airbnb and Roku saw gains. Global markets showed mixed tre…",
    "link": "https://economictimes.indiatimes.com/news/international/us/stock-market-today-dow-sp-500-and-nasdaq-slip-as-tesla-apple-and-major-stocks-struggle-amid-tariff-fears-and-weak-retail-sales/articleshow/118253024.cms",
    "timestamp": "2025-02-14T15:12:28Z"
  },
  {
    "title": "Historian Warns If AP Doesn’t Keep Wrongly Calling Body Of Water Gulf Of Mexico, US May Slide Into Authoritarianism",
    "description": "'Terribly slippery slope'",
    "link": "https://dailycaller.com/2025/02/14/historian-katie-couric-ap-writing-gulf-of-america-authoritarianism/",
    "timestamp": "2025-02-14T15:12:04Z"
  },
  {
    "title": "Saudi Arabia and the UAE vie to become Ukraine peace summit destinations",
    "description": "The News\nSaudi Arabia and the UAE are positioning themselves to host talks aimed at ending the Ukraine war as US President Donald Trump pushes for a resolution. \nTrump has signaled Saudi Arabia as a likely venue to meet Russian President Vladimir Putin, citin…",
    "link": "https://biztoc.com/x/4302c3af0217d54a",
    "timestamp": "2025-02-14T15:12:01Z"
  },
  {
    "title": "Left in the lurch: Asylum seekers respond to Trump’s CBP One cancellation",
    "description": "US president dissolves the app migrants use for asylum appointments. Some say that has left them in a dangerous limbo.",
    "link": "https://www.aljazeera.com/features/longform/2025/2/14/left-in-the-lurch-asylum-seekers-respond-to-trumps-cbp-one-cancellation",
    "timestamp": "2025-02-14T15:11:34Z"
  },
  {
    "title": "Trump Calls for Denuclearization Talks With Russia and China",
    "description": "Speaking to reporters in the Oval Office Thursday, President Donald Trump called for denuclearization talks with Russia and China, and said he trusts Russian President Vladimir Putin wants peace with Ukraine.\nSpeaking during an executive order signing on reci…",
    "link": "https://biztoc.com/x/a3236b5269006726",
    "timestamp": "2025-02-14T15:11:22Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team's access to federal government's payment system",
    "description": "The Treasury Department’s Office of Inspector General says it's launching an audit of the security controls for the federal government’s payment system. That's after Democratic senators raised red flags about the access provided to Trump aide Elon Musk’s Depa…",
    "link": "https://www.seattlepi.com/business/article/treasury-watchdog-begins-audit-of-musk-doge-20167582.php",
    "timestamp": "2025-02-14T15:11:02Z"
  },
  {
    "title": "Pentagon’s Liberal Agenda Is Already Taking A Massive Beating",
    "description": "Left-wing initiatives in the military are quickly being eradicated as Donald Trump and Pete Hegseth cleaned house in the first months of the administration.",
    "link": "https://dailycaller.com/2025/02/14/pentagons-liberal-agenda-donald-trump-pete-hegseth-massive-beating/",
    "timestamp": "2025-02-14T15:10:57Z"
  },
  {
    "title": "Feel The Love: Trump 2.0 Is Making America The World’s Valentine",
    "description": "DEI is dying. Elon Musk is DOGEing. And America is reclaiming its borders and its rightful position as respected world leader.",
    "link": "https://thefederalist.com/2025/02/14/feel-the-love-trump-2-0-is-making-america-the-worlds-valentine/",
    "timestamp": "2025-02-14T15:10:48Z"
  },
  {
    "title": "India's prime minister has adopted a familiar slogan: 'Make India Great Again'",
    "description": "Indian PM Narendra Modi's comments come amid President Donald Trump's threat of \"reciprocal\" tariffs on US trading partners.",
    "link": "https://www.businessinsider.com/modi-pm-adopted-familiar-slogan-make-india-great-again-2025-2",
    "timestamp": "2025-02-14T15:10:35Z"
  },
  {
    "title": "Vance slams EU leaders for ‘running in fear’ of its own voters",
    "description": "The US VP has accused the EU of failing to uphold democratic principles, citing cancelled elections in Romania Read Full Article at RT.com",
    "link": "https://www.rt.com/news/612732-us-vance-romania-elections-eu/",
    "timestamp": "2025-02-14T15:10:18Z"
  },
  {
    "title": "Modi US visit: Sifting substance from spectacle",
    "description": "The defence and trade proposals are the big takeaways. But the devil lies in the detail",
    "link": "https://www.thehindubusinessline.com/opinion/modi-us-visit-sifting-substance-from-spectacle/article69220405.ece",
    "timestamp": "2025-02-14T15:10:09Z"
  },
  {
    "title": "Saudi Arabia Says It Would Be Delighted to Host Trump-Putin Summit",
    "description": "The Foreign Ministry of Saudi Arabia confirmed on Friday it is interested in hosting a summit between President Donald Trump and his Russian counterpart Vladimir Putin in the near future after Trump floated the possibility.\nThe post Saudi Arabia Says It Would…",
    "link": "https://www.breitbart.com/middle-east/2025/02/14/saudi-arabia-says-it-would-be-delighted-to-host-trump-putin-summit/",
    "timestamp": "2025-02-14T15:08:28Z"
  },
  {
    "title": "Judge blocks Trump executive order banning trans healthcare for under-19s",
    "description": "A federal judge has blocked Trump’s executive order attempting to ban trans healthcare for under-19s. US Maryland judge Brendan Hurson issued a Thursday (13 February) ruling halting the enforcement of a nationwide ban implemented by Trump as part of his campa…",
    "link": "https://www.thepinknews.com/2025/02/14/judge-executive-order-trans-ban-blocked/",
    "timestamp": "2025-02-14T15:08:25Z"
  },
  {
    "title": "South African central bank chief warns against populism",
    "description": "Governor Lesetja Kganyago says populist movements, which have grown in Western countries, threaten institutions Read Full Article at RT.com",
    "link": "https://www.rt.com/africa/612720-south-african-central-bank-chief-populism-warning/",
    "timestamp": "2025-02-14T15:08:06Z"
  },
  {
    "title": "Hegseth Warns Europe They Can't Assume US Military Presence 'Will Last Forever'",
    "description": "The defense secretary urged NATO allies to bear more of the cost for providing for their own security.",
    "link": "https://www.ibtimes.com/pete-hegseth-nato-warning-us-troops-3763756",
    "timestamp": "2025-02-14T15:07:37Z"
  },
  {
    "title": "Including people without legal status in census has had little impact on House seats, study finds",
    "description": "A new study says inclusion of people in U.S. illegally has had little impact on presidential elections or control of Congress.",
    "link": "https://www.bostonherald.com/2025/02/14/census-without-legal-status-impact/",
    "timestamp": "2025-02-14T15:06:40Z"
  },
  {
    "title": "Hegseth says he and Vance are 'on the same page' despite VP's remark on US troops in Ukraine",
    "description": "Defense Secretary Hegseth was asked on Friday about the possibility of the U.S. sending troops to Ukraine just after Vice President Vance said the option had not been ruled out.",
    "link": "https://www.foxnews.com/world/hegseth-says-he-vance-on-same-page-despite-vps-remark-us-troops-ukraine",
    "timestamp": "2025-02-14T15:06:37Z"
  },
  {
    "title": "US manufacturing output falls in January on weak motor vehicle production",
    "description": "U.S. manufacturing production unexpectedly fell in January, weighed down by a sharp decline in motor vehicle output.  Factory output dipped 0.1% last month...",
    "link": "https://finance.yahoo.com/news/us-manufacturing-output-falls-january-150617426.html",
    "timestamp": "2025-02-14T15:06:17Z"
  },
  {
    "title": "US Retail Sales See Biggest Drop In Nearly Two Years On Harsh Weather",
    "description": "US retail sales plunged by the most in almost two years last month as cold weather hit the country alongside wildfires in California, data showed Friday, reflecting broad declines while President Donald Trump returned to office.",
    "link": "https://www.ibtimes.com/us-retail-sales-see-biggest-drop-nearly-two-years-harsh-weather-3763760",
    "timestamp": "2025-02-14T15:06:16Z"
  },
  {
    "title": "Treasury watchdog begins audit of Musk DOGE team’s access to federal government’s payment system",
    "description": "WASHINGTON (AP) — The Treasury Department’s Office of Inspector General on Friday said it was launching an audit of the security controls for the federal government’s payment system, after Democratic senators raised red flags about the access provided to Trum…",
    "link": "https://financialpost.com/pmn/treasury-watchdog-begins-audit-of-musk-doge-teams-access-to-federal-governments-payment-system",
    "timestamp": "2025-02-14T15:05:49Z"
  },
  {
    "title": "MSNBC’s Chris Hayes Lashes Out At Trump — Praises ‘Most Significant Act Of Principled Defiance’ By Adams Prosecutors",
    "description": "MSNBC host Chris Hayes lashed out at Trump over the Eric Adams case and praised the resignations it sparked as a \"significant act of principled defiance.\"\nThe post MSNBC’s Chris Hayes Lashes Out At Trump — Praises ‘Most Significant Act Of Principled Defiance’…",
    "link": "https://www.mediaite.com/news/msnbcs-chris-hayes-lashes-out-at-trump-praises-most-significant-act-of-principled-defiance-by-adams-prosecutors/",
    "timestamp": "2025-02-14T15:03:47Z"
  },
  {
    "title": "CNN hires Rahm Emanuel — ex-Chicago mayor, White House official — as left-leaning pundit",
    "description": "Rahm Emanuel, who most recently served as ambassador to Japan during the Biden administration, is CNN's new senior political and global affairs commentator.",
    "link": "https://nypost.com/2025/02/14/media/cnn-hires-rahm-emanuel-former-obama-biden-official/",
    "timestamp": "2025-02-14T15:02:50Z"
  },
  {
    "title": "US retail sales see biggest drop in nearly two years on harsh weather",
    "description": "US retail sales plunged by the most in almost two years last month as cold weather hit the country alongside wildfires in California, data showed Friday, reflecting broad declines while President Donald Trump returned to office. The decreases come as househol…",
    "link": "https://www.digitaljournal.com/world/us-retail-sales-see-biggest-drop-in-nearly-two-years-on-harsh-weather/article",
    "timestamp": "2025-02-14T15:02:33Z"
  },
  {
    "title": "Mexico Challenges Google's Map Update Over Controversial Name Change",
    "description": "Mexico has expressed strong opposition to Google's recent decision to rename the \"Gulf of Mexico\" to the \"Gulf of America\" on its mapping services within the United States. The move has prompted […]\nThank you for being a Ghacks reader. The post Mexico Challen…",
    "link": "https://www.ghacks.net/2025/02/14/mexico-challenges-googles-map-update-over-controversial-name-change/",
    "timestamp": "2025-02-14T15:02:21Z"
  },
  {
    "title": "Don’t look at Trump, do what the EU needs. Let’s “Buy Transatlantic”. [Promoted content]",
    "description": "Donald Trump’s vocal and chaotic declarations dominate headlines and daily discussions. However, behind the noise lies a deeper and more pressing issue for the European Union: the peace dividend era is over. The EU must urgently define its hierarchy of...",
    "link": "https://biztoc.com/x/aea842cae07edcd3",
    "timestamp": "2025-02-14T15:01:45Z"
  },
  {
    "title": "Is Elon Musk Taking Over the US Government? Here’s How ‘State Capture’ Works – And Why We Should be Concerned",
    "description": "Many Americans have watched in horror as Elon Musk, the world’s richest person, has been permitted to tear through various offices of the United States government in recent weeks. Backed by President Donald Trump, and supported by a …\nThe post Is Elon Musk Ta…",
    "link": "https://www.globalresearch.ca/elon-musk-taking-us-government-state-capture/5879865",
    "timestamp": "2025-02-14T15:01:40Z"
  },
  {
    "title": "Federal funding freeze disrupts rural organizations supporting foster youth, job growth",
    "description": "Nonprofit organizations across the country were plunged into uncertainty after the White House froze spending on federal loans and grants two weeks ago.",
    "link": "https://www.news4jax.com/business/2025/02/14/federal-funding-freeze-disrupts-rural-organizations-supporting-foster-youth-job-growth/",
    "timestamp": "2025-02-14T15:01:25Z"
  },
  {
    "title": "AOC Calls For Eric Adams To 'Be Removed' As Mayor",
    "description": "The New York Democrat suggested Adams is too indebted to Donald Trump to lead after the Department of Justice ordered his charges dropped.",
    "link": "https://www.huffpost.com/entry/aoc-eric-adams-should-be-removed_n_67af3595e4b0513a8d76d3f0",
    "timestamp": "2025-02-14T15:01:19Z"
  },
  {
    "title": "Munich Conference: Cold shower from Vance’s speech – “Europeans, you fear your voters, and the US can’t do anything about it”",
    "description": "Live updates \nThe post Munich Conference: Cold shower from Vance’s speech – “Europeans, you fear your voters, and the US can’t do anything about it” appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/02/14/munich-conference-cold-shower-from-vances-speech-europeans-you-fear-your-voters-and-the-us-cant-do-anything-about-it/",
    "timestamp": "2025-02-14T15:00:55Z"
  },
  {
    "title": "Saudi Prince Steps In as Power Broker",
    "description": "\"As President Donald Trump pushes to end the war in Ukraine and upend the order of the Middle East, one fellow world leader is at the heart of both initiatives: Saudi Arabia Crown Prince Mohammed",
    "link": "https://politicalwire.com/2025/02/14/saudi-prince-steps-in-as-power-broker/",
    "timestamp": "2025-02-14T15:00:55Z"
  },
  {
    "title": "Don’t look at Trump, do what the EU needs. Let’s “Buy Transatlantic”. [Promoted content]",
    "description": "Donald Trump’s vocal and chaotic declarations dominate headlines and daily discussions. However, behind the noise lies a deeper and more pressing issue for the European Union: the peace dividend era is over. The EU must urgently define its hierarchy of...",
    "link": "https://www.euractiv.com/section/economy-jobs/opinion/dont-look-at-trump-do-what-the-eu-needs-lets-buy-transatlantic/",
    "timestamp": "2025-02-14T15:00:41Z"
  },
  {
    "title": "EXCLUSIVE: How the FBI's 'Suddenly Discovered' 2,400-Page Stash of JFK Files are Set to Also Lift Lid on Secrets Including Robert Kennedy and Martin Luther King Assassinations… And Existence of ALIENS",
    "description": "Donald Trump is set to blow the lid off a raft of federal secrets – including a 'second JFK shooter' and the existence of UFOs.",
    "link": "https://radaronline.com/p/fbi-2400-page-stash-jfk-files-secrets-of-robert-kennedy-martin-luther-king-assassinations-existence-of-aliens/",
    "timestamp": "2025-02-14T15:00:00Z"
  },
  {
    "title": "Professor Patrick V. Verkooijen Delivers Landmark Inaugural Lecture “The Resilience Endgame” at University of Groningen",
    "description": "Groningen, Feb. 14, 2025 (GLOBE NEWSWIRE) -- The University of Groningen today hosted the highly anticipated inaugural lecture of Professor Patrick V. Verkooijen, newly appointed Ban Ki-moon Chair on Climate Adaptation and Governance. In a thought-provoking a…",
    "link": "https://www.globenewswire.com/news-release/2025/02/14/3026726/0/en/Professor-Patrick-V-Verkooijen-Delivers-Landmark-Inaugural-Lecture-The-Resilience-Endgame-at-University-of-Groningen.html",
    "timestamp": "2025-02-14T15:00:00Z"
  },
  {
    "title": "TikTok Returns to U.S. App Stores Amid Ongoing Uncertainty",
    "description": "TikTok has been reinstated on Apple's App Store and Google's Play Store in the United States after a month-long absence. The app was initially removed on January 19, 2025, following concerns over […]\nThank you for being a Ghacks reader. The post TikTok Return…",
    "link": "https://www.ghacks.net/2025/02/14/tiktok-returns-to-u-s-app-stores-amid-ongoing-uncertainty/",
    "timestamp": "2025-02-14T14:59:28Z"
  },
  {
    "title": "\"Free Speech In Retreat Across Europe\": JD Vance At Munich Security Meet",
    "description": "US Vice President JD Vance on Friday used his speech at the Munich Security Conference to criticize Europe for what he said was censorship of free speech and said the continent faces a &quot;threat from within&quot;.",
    "link": "https://www.ndtv.com/world-news/free-speech-in-retreat-across-europe-jd-vance-at-munich-security-meet-7711697",
    "timestamp": "2025-02-14T14:59:28Z"
  },
  {
    "title": "The Recalibration of Global Power: …Toward a Tripolar World Order?",
    "description": "\"2. Yalta 2.0\" agreement among major powers, particularly distancing European nations from these essential negotiations. This potential realignment signifies a wider shift in global power dynamics, where emerging geopolitical realities are contesting conventi…",
    "link": "https://energycentral.com/c/og/recalibration-global-power-%E2%80%A6toward-tripolar-world-order",
    "timestamp": "2025-02-14T14:58:43Z"
  },
  {
    "title": "‘Going Against Trump Policies Is Not Fraud’: White House Panned Over Absurd Defense of DOGE",
    "description": "Administration efforts to defend DOGE confirm that spending cuts are ideological, and not value-neutral 'efficiency' or cost reduction",
    "link": "https://www.nakedcapitalism.com/2025/02/going-against-trump-policies-is-not-fraud-white-house-panned-over-absurd-defense-of-doge.html",
    "timestamp": "2025-02-14T14:55:57Z"
  },
  {
    "title": "Pete Hegseth Torched for Completely Cracking Under Pressure at NATO",
    "description": "Donald Trump may have given his defense secretary a pass on spelling out America’s negotiating position on Ukraine, but that doesn’t mean the rest of the Republican conference has been equally forgiving.\r\nSenate Armed Services Chair Senator Roger Wicker torch…",
    "link": "https://newrepublic.com/post/191546/pete-hegseth-torched-performance-nato",
    "timestamp": "2025-02-14T14:55:46Z"
  },
  {
    "title": "AOC Picks Fight With Worst Possible Trump Official After Livestream Stunt",
    "description": "Democratic New York Rep. Alexandria Ocasio-Cortez is picking a fight with the worst possible Trump official she could beef with: border czar Tom Homan.",
    "link": "https://dailycaller.com/2025/02/14/alexandria-ocasio-cortez-tom-homan-livestream-even-illegal-immigration-ice/",
    "timestamp": "2025-02-14T14:55:24Z"
  },
  {
    "title": "Apple starts advertising on X (Twitter) again",
    "description": "Apple is once again spending money to advertise on Elon Musk’s X (formerly Twitter) after pausing ads in 2023 and 2024. Many companies stopped advertising on X after Musk bought it and stripped away a lot of the safety guidelines that Twitter used to operate …",
    "link": "https://mobilesyrup.com/2025/02/14/apple-starts-advertising-on-x-twitter-again/",
    "timestamp": "2025-02-14T14:55:16Z"
  },
  {
    "title": "Americans’ views of the war in Ukraine continue to differ by party",
    "description": "Americans remain largely divided along partisan lines over U.S. aid to Ukraine, nearly three years after Russia’s military invasion.\nThe post Americans’ views of the war in Ukraine continue to differ by party appeared first on Pew Research Center.",
    "link": "http://www.pewresearch.org/short-reads/2025/02/14/americans-views-of-the-war-in-ukraine-continue-to-differ-by-party/",
    "timestamp": "2025-02-14T14:55:16Z"
  },
  {
    "title": "Seth Meyers Predicts the Next Round of Kennedy Center Honorees Now That Trump Is Chairman | Video",
    "description": "Yes, Kid Rock is in there\nThe post Seth Meyers Predicts the Next Round of Kennedy Center Honorees Now That Trump Is Chairman | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/seth-meyers-predicts-trump-kennedy-center-honorees/",
    "timestamp": "2025-02-14T14:54:41Z"
  },
  {
    "title": "Surprises, surprises! European leaders stunned by US-Russia peace talk developments, here's what could be in store for Ukraine",
    "description": "The conflict between Ukraine and Russia has been made one of the top affairs that Donald Trump is looking into, but European leaders are not very happy with the recent developments. Here's why",
    "link": "https://economictimes.indiatimes.com/news/international/us/surprises-surprises-european-leaders-stunned-by-us-russia-peace-talk-developments-heres-what-could-be-in-store-for-ukraine/articleshow/118252770.cms",
    "timestamp": "2025-02-14T14:54:14Z"
  },
  {
    "title": "What AI, Age, And Trump Have In Common — And What You Can Do About It",
    "description": "At first glance, artificial intelligence, the process of human aging, and the phenomenon of Donald Trump may seem unrelated. Hybrid intelligence connects the dots.",
    "link": "https://www.forbes.com/sites/corneliawalther/2025/02/14/what-ai-age-and-trump-have-in-common---and-what-you-can-do-about-it/",
    "timestamp": "2025-02-14T14:53:31Z"
  },
  {
    "title": "Wait, Was Elon's Son Just Caught on Camera Telling Trump What Musk Really Thinks of Him?",
    "description": "During an Oval Office press conference, Grimes' and Elon Musk's young son X Æ A-Xii appeared to tell President Donald Trump what his billionaire dad really thinks of him. While his famous father blathered on about \"restoring democracy,\" the 4-year-old was hea…",
    "link": "https://futurism.com/elon-musk-son-trump-president",
    "timestamp": "2025-02-14T14:53:18Z"
  },
  {
    "title": "FACT CHECK: Was A Man Denied Healthcare For Wearing A ‘MAGA’ Hat?",
    "description": "A viral video shared on TikTok claims to show a man purportedly being denied healthcare for wearing a “Make America Great Again” hat. @animalpara0Patient gets denied healthcare part1♬ original sound – animalpara0 Verdict: False A comment shared on the video i…",
    "link": "https://checkyourfact.com/2025/02/14/fact-check-man-healthcare-wearing-maga-hat/",
    "timestamp": "2025-02-14T14:52:47Z"
  },
  {
    "title": "Brooke Rollins Goes to Work at USDA",
    "description": "After being confirmed by the Senate yesterday, Brooke Rollins was immediately sworn in as the 33rd U.S. Secretary of Agriculture by Associate Justice of the U.S. Supreme Court Clarence Thomas in a private ceremony today at the Supreme Court building. “It is t…",
    "link": "https://agwired.com/2025/02/14/brooke-rollins-goes-to-work-at-usda/",
    "timestamp": "2025-02-14T14:52:11Z"
  },
  {
    "title": "Trump administration reportedly eyes renegotiating CHIPS Act awards",
    "description": "The recipients of the US government's CHIPS and Science Act awards may not get the amount that they were initially promised. According to Reuters , the Trump administration is looking to assess and change the CHIPS Act's current requirements. After that, it's…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176246385",
    "timestamp": "2025-02-14T14:52:07Z"
  },
  {
    "title": "Black expats share why they're happier living outside the U.S.: I get to 'exist in peace'",
    "description": "The U.S. has made some strides toward reaching racial equality since the days of the civil rights movement.\nBut President Donald Trump has made ending diversity, equity and inclusion initiatives a priority under his administration. As the president has instru…",
    "link": "https://biztoc.com/x/c7a323bf29fba6b8",
    "timestamp": "2025-02-14T14:52:01Z"
  },
  {
    "title": "Australia needs to get a handle on its campus antisemitism problem",
    "description": "A surge in antisemitic attacks and university-based hostility has sparked calls for stronger government intervention.",
    "link": "https://www.jpost.com/opinion/article-842165",
    "timestamp": "2025-02-14T14:51:01Z"
  },
  {
    "title": "Isn’t 46 Years Of Failure Enough? Time To Kill The Education Dept.",
    "description": "Americans who care deeply about education were treated to a rare sight on Thursday. In her testimony before Congress to be the head of the Department of Education, Linda McMahon openly and proudly outlined a plan to not just get rid of her job, but take the f…",
    "link": "https://freerepublic.com/focus/f-chat/4297570/posts",
    "timestamp": "2025-02-14T14:50:58Z"
  },
  {
    "title": "Another Left-Wing Conspiracy Theory Crashes Into The Earth In Minutes",
    "description": "MSNBC’s Rachel Maddow was pulling a Rachel Maddow on Wednesday night when she attempted to set off a conspiracy theory about Elon Musk and the Trump administration. The left-wing cable host devoted a segment of her show to accusing President Donald Trump and …",
    "link": "https://freerepublic.com/focus/f-bloggers/4297568/posts",
    "timestamp": "2025-02-14T14:49:18Z"
  },
  {
    "title": "Hamas Report to Mediators Accuses Israel of Pervasive Gaza Ceasefire Violations",
    "description": "Hamas officials submitted a two-page report to mediators on Tuesday listing a wide range of Israeli violations of the Gaza ceasefire since the agreement went into effect on January 19—including the killing of civilians, repeated ground and air incursions, the…",
    "link": "https://www.globalresearch.ca/hamas-report-mediators-accuses-israel-pervasive-gaza-ceasefire-violations/5879855",
    "timestamp": "2025-02-14T14:49:03Z"
  },
  {
    "title": "Israel Receives Names Of 3 Hostages To Be Freed By Hamas On Saturday",
    "description": "Israel said Friday it had received the names of three hostages to be freed by militants this weekend, after a crisis in the ceasefire threatened to plunge Gaza back into war.",
    "link": "https://www.ndtv.com/world-news/israel-receives-names-of-3-hostages-to-be-freed-by-hamas-on-saturday-7711640",
    "timestamp": "2025-02-14T14:48:54Z"
  },
  {
    "title": "Breaking: RFK Jr. Sworn in as HHS Secretary",
    "description": "Robert F. Kennedy Jr. was sworn in as the 26th secretary of the U.S. Department of Health and Human Services (HHS) after the U.S. Senate earlier today voted 52-48 to confirm his nomination. The vote ran largely along party lines, with almost every Republican …",
    "link": "https://www.globalresearch.ca/breaking-rfk-jr-sworn-in-hhs-secretary/5879785",
    "timestamp": "2025-02-14T14:47:23Z"
  },
  {
    "title": "TIFF CEO worried about ‘nationalistic’ shift in TV, film amid Canada-US trade tension",
    "description": "TORONTO — The CEO of the Toronto International Film Festival is warning against an overly nationalistic approach to screen content in Canada, as U.S. President Donald Trump’s looming tariffs have led some to shun American exports. The Canada-first approach to…",
    "link": "https://financialpost.com/pmn/tiff-ceo-worried-about-nationalistic-shift-in-tv-film-amid-canada-us-trade-tension",
    "timestamp": "2025-02-14T14:47:22Z"
  },
  {
    "title": "Highlights And Lowlights From Top Education Nominee’s Confirmation Hearing",
    "description": "Here are the highlights from Linda McMahon's Senate hearing to become Donald Trump's secretary of education.",
    "link": "https://thefederalist.com/2025/02/14/highlights-and-lowlights-from-top-education-nominees-confirmation-hearing/",
    "timestamp": "2025-02-14T14:46:48Z"
  },
  {
    "title": "Head of UN watchdog says UNRWA hired people 'who were supporting terrorism'",
    "description": "U.N. Watch Executive Director Hillel Neuer discusses allegations against the United Nations Relief and Works Agency for Palestinian Refugees in the Near East in the wake of Hamas' attacks on Israel.",
    "link": "https://www.foxnews.com/world/head-un-watchdog-says-unrwa-hired-people-who-were-supporting-terrorism",
    "timestamp": "2025-02-14T14:46:00Z"
  },
  {
    "title": "India-US energy cooperation to boost natural gas trade",
    "description": "The meeting between US president Donald Trump and Prime Minister Narendra Modi, which is expected to boost cargoes of US oil and gas by up to 67 per cent, broadens avenues for importing liquefied natural gas (LNG).",
    "link": "https://www.thehindubusinessline.com/economy/india-us-energy-cooperation-to-boost-natural-gas-trade/article69220118.ece",
    "timestamp": "2025-02-14T14:45:13Z"
  },
  {
    "title": "India-US energy cooperation to boost natural gas trade",
    "description": "The meeting between US president Donald Trump and Prime Minister Narendra Modi, which is expected to boost cargoes of US oil and gas by up to 67 per cent, broadens avenues for importing liquefied natural gas (LNG).",
    "link": "https://www.thehindubusinessline.com/markets/commodities/india-us-energy-cooperation-to-boost-natural-gas-trade/article69220118.ece",
    "timestamp": "2025-02-14T14:45:13Z"
  },
  {
    "title": "Russian drone hits Chernobyl but no radiation detected",
    "description": "<p>KYIV - Ukrainian President Volodymyr Zelensky said Friday that a Russian drone had struck a cover built to contain radiation at the Chernobyl nuclear power plant, adding that radiation levels were normal.</p>",
    "link": "https://www.bangkokpost.com/world/2961253/russian-drone-hits-chernobyl-but-no-radiation-detected",
    "timestamp": "2025-02-14T14:45:00Z"
  },
  {
    "title": "Trump warns consumers: Prices ‘could go up’ because of White House plans",
    "description": "Donald Trump is moving forward with an agenda that, by the Republican president's own assessment, is likely to make the cost of living worse.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-warns-consumers-prices-go-white-house-plans-rcna192205",
    "timestamp": "2025-02-14T14:43:19Z"
  },
  {
    "title": "State Department halts plan to buy $400M worth of Musk’s Tesla armored vehicles",
    "description": "The State Department halted plan with Elon Musk’s Tesla company to buy armored electric vehicles by the Trump administration after reports emerged about a potential $400 million purchase.",
    "link": "https://nypost.com/2025/02/14/tech/state-department-halts-plan-to-buy-400m-worth-of-musks-tesla-armored-vehicles/",
    "timestamp": "2025-02-14T14:42:22Z"
  },
  {
    "title": "Trump Will Enact Reciprocal Tariffs ‘If He Needs To’, Says Treasury Chief Bessent",
    "description": "“This is not theater,” said Treasury Secretary Scott Bessent about Trump’s reciprocal tariffs, though Bessent indicated there’s plenty of room for trade diplomacy.",
    "link": "https://www.forbes.com/sites/dereksaul/2025/02/14/trump-will-enact-reciprocal-tariffs-if-he-needs-to-says-treasury-chief-bessent/",
    "timestamp": "2025-02-14T14:42:12Z"
  },
  {
    "title": "Fed unions take lead in resistance to Trump's presidential power grab (Joe Davidson/Washington Post)",
    "description": "Joe Davidson / Washington Post:\nFed unions take lead in resistance to Trump's presidential power grab  —  Trump actions against federal employees pushed them to the forefront of resistance against his aggressive moves to shrink government and expand his power…",
    "link": "https://www.memeorandum.com/250214/p35",
    "timestamp": "2025-02-14T14:40:20Z"
  },
  {
    "title": "Hungary's Orbán predicts Trump will bring Russia back into Western fold after war",
    "description": "Hungarian Prime Minister Viktor Orbán believes U.S. President Donald Trump will reintegrate Russia into the Western economy and energy sector if the Ukraine war ends",
    "link": "https://abcnews.go.com/International/wireStory/hungarys-orbn-predicts-trump-bring-russia-back-western-118816081",
    "timestamp": "2025-02-14T14:40:03Z"
  },
  {
    "title": "Bird Flu Signs Found in Three Veterinarians Suggest Wider US Spread",
    "description": "Signs of recent bird flu infection were found in three US veterinarians, two of whom had no known prior exposure, researchers said, suggesting potentially wider spread of the dangerous virus than has been suspected. One of the veterinarians worked with …",
    "link": "https://www.insurancejournal.com/news/national/2025/02/14/812094.htm",
    "timestamp": "2025-02-14T14:39:05Z"
  },
  {
    "title": "Nord Stream and the Failures of the Biden Administration",
    "description": "We are now three weeks into the second presidency of Donald Trump, and he has virtually handed the Department of the Treasury and more than a dozen other Cabinet departments and agencies to Elon Musk and his team of young digital vultures. They are in the pro…",
    "link": "https://www.globalresearch.ca/nord-stream-failures-biden-administration/5879883",
    "timestamp": "2025-02-14T14:39:05Z"
  },
  {
    "title": "Kennedy Center Cancels Acclaimed Kids Musical Over 'Sparkly Boys,' Creators Hint",
    "description": "“We didn’t ask for this joy bomb of a show to be a part of the resistance, but here we are,” the creators of \"Finn\" wrote after the tour was axed.",
    "link": "https://www.huffpost.com/entry/kennedy-center-cancels-finn-childrens-musical_n_67af3777e4b0513a8d76d523",
    "timestamp": "2025-02-14T14:38:21Z"
  }
]