[
  {
    "title": "VIDEO: Liberals Mourning that J6 Ultimately BOOMERANGED on Them",
    "description": "VIDEOHere it is. FIVE YEARS after January 6, 2021. For Liberals a very sad day because it did NOT turn out as they planned. They had hoped that their media aided crafting of the events of J6 would forever discredit President Donald Trump and MAGA. At first th…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360742/posts",
    "timestamp": "2026-01-06T21:11:19Z"
  },
  {
    "title": "Analysts Warn Venezuela Invasion Could Empower Trump to Take Actions Elsewhere",
    "description": "The US’s first unilateral invasion in South America is Trump's testing ground for military supremacy in the region.",
    "link": "https://truthout.org/articles/analysts-warn-venezuela-invasion-could-empower-trump-to-take-actions-elsewhere/",
    "timestamp": "2026-01-06T21:10:12Z"
  },
  {
    "title": "‘Unacceptable’: Conservatives Revolt Over Trump Urging GOP to Be ‘Flexible’ on Taxpayer-Funded Abortions",
    "description": "Conservatives objected after President Donald Trump urged House Republicans to be \"flexible\" on the issue of taxpayer-funded abortions on Tuesday.\nThe post ‘Unacceptable’: Conservatives Revolt Over Trump Urging GOP to Be ‘Flexible’ on Taxpayer-Funded Abortion…",
    "link": "https://www.mediaite.com/media/news/unacceptable-conservatives-revolt-over-trump-urging-gop-to-be-flexible-on-taxpayer-funded-abortions/",
    "timestamp": "2026-01-06T21:08:40Z"
  },
  {
    "title": "LA Mayor Bass compares anti-ICE protests to Lakers championship disturbance: 'A few knuckleheads'",
    "description": "Mayor Karen Bass downplayed last year’s anti-ICE protests in Los Angeles, saying the unrest resembled post–Lakers championship vandalism rather than riots.",
    "link": "https://www.foxnews.com/politics/la-mayor-bass-compares-anti-ice-protests-lakers-championship-disturbance-a-few-knuckleheads",
    "timestamp": "2026-01-06T21:05:27Z"
  },
  {
    "title": "Mediaite’s Colby Hall Shocks Don Lemon With Prediction Broadcast News Will Die In Next Decade",
    "description": "Mediaite founding editor Colby Hall has a bold prediction: ABC, NBC, and CBS will exit the news business entirely within the next decade.\nThe post Mediaite’s Colby Hall Shocks Don Lemon With Prediction Broadcast News Will Die In Next Decade first appeared on …",
    "link": "https://www.mediaite.com/media/mediaites-colby-hall-shocks-don-lemon-with-prediction-broadcast-news-will-die-in-next-decade/",
    "timestamp": "2026-01-06T21:03:48Z"
  },
  {
    "title": "US military an option as Trump weighs acquiring Greenland: White House",
    "description": "Greenland is a self-governing territory within the Kingdom of Denmark and part of the NATO alliance, and European leaders have strongly rejected any suggestion of a US takeover",
    "link": "https://www.thehindubusinessline.com/news/world/us-military-an-option-as-trump-weighs-acquiring-greenland-white-house/article70479798.ece",
    "timestamp": "2026-01-06T21:03:34Z"
  },
  {
    "title": "Senate Democrats Move to Block Taxpayer-Funded Reimbursements to Jan. 6 Rioters",
    "description": "The Trump administration already agreed to a $5 million settlement with the family of Ashli Babbitt, who was shot and killed by a Capitol Police officer.",
    "link": "https://www.ibtimes.com/senate-democrats-move-block-taxpayer-funded-reimbursements-jan-6-rioters-3794532",
    "timestamp": "2026-01-06T21:03:15Z"
  },
  {
    "title": "Trump, advisers discussing options for acquiring Greenland and US military is always an option, White House says",
    "description": "WASHINGTON, Jan ‌6 (Reuters) - U.S. President Donald Trump ‌and his team are ‌discussing options for acquiring Greenland and utilizing the U.S. military in furtherance of ‍the goal is \"always an ‍option,\" the ‌White House said on Tuesday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/07/trump-advisers-discussing-options-for-acquiring-greenland-and-us-military-is-always-an-option-white-house-says",
    "timestamp": "2026-01-06T21:03:00Z"
  },
  {
    "title": "Huang says Nvidia seeing ‘very high’ Chinese customer demand for H200 AI chips",
    "description": "\"It appears that we're going to be going back to China,\" Nvidia CEO Jensen Huang said on Tuesday at the CES conference in Las Vegas.",
    "link": "https://www.cnbc.com/2026/01/06/huang-nvidia-seeing-very-high-demand-for-h200-ai-chips-from-china.html",
    "timestamp": "2026-01-06T21:01:38Z"
  },
  {
    "title": "Colombia Vows To Fight Back If The U.S. Attacks",
    "description": "If the United States follows through on its threats to attack Colombia over \"narco terrorism\" allegations, it will \"take up arms\" and fight back. Colombian President Gustavo Petro has vowed that the U.S. won't have an easy time in a takeover of Colombia.",
    "link": "https://www.shtfplan.com/headline-news/colombia-vows-to-fight-back-if-the-u-s-attacks",
    "timestamp": "2026-01-06T21:00:31Z"
  },
  {
    "title": "January 6th Rioter Apologizes to Capitol Police: ‘I Had Fallen For the President’s Lies’",
    "description": "\"Once I got away from the MAGA cult and started educating myself about January the 6th, I knew what I did was wrong. I pleaded guilty to my crimes because I did the crime\"\nThe post January 6th Rioter Apologizes to Capitol Police: ‘I Had Fallen For the Preside…",
    "link": "https://www.mediaite.com/media/news/january-6th-rioter-apologizes-to-capitol-police-i-had-fallen-for-the-presidents-lies/",
    "timestamp": "2026-01-06T21:00:12Z"
  },
  {
    "title": "Conor McGregor calls out Floyd Mayweather for MMA fight at UFC White House",
    "description": "Conor McGregor wants Floyd Mayweather at UFC White House.",
    "link": "https://www.mmafighting.com/latest-news/464821/conor-mcgregor-calls-out-floyd-mayweather-for-mma-fight-at-ufc-white-house",
    "timestamp": "2026-01-06T21:00:00Z"
  },
  {
    "title": "Forecasts predict lacklustre oil, higher Alberta gas prices in 2026",
    "description": "CALGARY — A pair of energy forecasts released Tuesday see lacklustre crude oil prices continuing this year amid a global supply glut and natural gas prices picking up steam as more Canadian shipments make their way to Asia. Consulting firm Deloitte expects We…",
    "link": "https://financialpost.com/pmn/forecasts-predict-lacklustre-oil-higher-alberta-gas-prices-in-2026-3",
    "timestamp": "2026-01-06T20:59:11Z"
  },
  {
    "title": "Crude Falls as Market Refocuses on Glut",
    "description": "Oil prices fell as traders looked past geopolitics and focused on a growing global surplus.",
    "link": "https://www.rigzone.com/news/wire/crude_falls_as_market_refocuses_on_glut-06-jan-2026-182699-article/",
    "timestamp": "2026-01-06T20:58:57Z"
  },
  {
    "title": "The latest opinion on Venezuela, Trump approval shifts, Epstein cover-up concerns, and inequality: January 2-5, 2026 Economist/YouGov Poll",
    "description": "This week’s Economist/YouGov poll covers U.S. military action in Venezuela, Donald Trump job approval, Jeffrey Epstein's crimes, and wealth inequality",
    "link": "https://biztoc.com/x/a27916a48f22a912",
    "timestamp": "2026-01-06T20:57:43Z"
  },
  {
    "title": "Half of Americans think Donald Trump is trying to cover up Jeffrey Epstein's crimes",
    "description": "Around half of U.S. adult citizens — including most Democrats, about half of Independents, and 14% of Republicans — say Donald Trump is trying to cover up Jeffrey Epstein's crimes",
    "link": "https://biztoc.com/x/1d10d222ddf3aa8f",
    "timestamp": "2026-01-06T20:57:35Z"
  },
  {
    "title": "Navy chief visits NAS Pensacola, discusses AI and fitness changes with sailors - NewsBreak",
    "description": "PENSACOLA, Fla. -- The chief of naval operations made a stop at NAS Pensacola on Tuesday morning, taking questions directly from sailors. \"So many sailors",
    "link": "https://www.newsbreak.com/share/4428312333520-navy-chief-visits-nas-pensacola-discusses-ai-and-fitness-changes-with-sailors?s=a2&amp;share_destination_id=MTA2NTY3MDIwLTE3Njc3MzMwMDAwMzE%3D&amp;pd=07D8wuDV&amp;hl=en_US&amp;send_time=1767733000&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.53.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2026-01-06T20:57:31Z"
  },
  {
    "title": "What did Jack Ryan know about Venezuela? Spy show hero goes viral after Maduro capture",
    "description": "On the heels of the U.S. military attacks on Venezuela's capital over the weekend and the capture of president Nicolás Maduro, millions of people on social media are sharing a fictitious CIA analyst's insights on the South American petrostate.",
    "link": "https://www.cbc.ca/news/entertainment/jack-ryan-venezuela-invasion-9.7033958",
    "timestamp": "2026-01-06T20:57:18Z"
  },
  {
    "title": "Cuba discloses names of 32 military officers killed in U.S. action in Venezuela",
    "description": "The names, ranks and ages of the 32 Cuban military personnel killed during the capture of Venezuelan President Nicolás Maduro by U.S. forces were published Tuesday by the Cuban government, which announced two days of mourning.",
    "link": "https://www.cbc.ca/news/world/cuba-names-personnel-killed-venezuela-9.7035417",
    "timestamp": "2026-01-06T20:57:14Z"
  },
  {
    "title": "Analysts watch for heightened cyber, disinformation campaigns following Venezuela raid",
    "description": "Disinformation operations have been spotted, but there are no signs the efforts are being coordinated through a foreign government, one observer told Nextgov/FCW.",
    "link": "https://www.nextgov.com/cybersecurity/2026/01/analysts-watch-heightened-cyber-disinformation-campaigns-following-venezuela-raid/410491/",
    "timestamp": "2026-01-06T20:56:00Z"
  },
  {
    "title": "EXCLUSIVE: Leo V The Don! Why DiCaprio was Left 'Raging' Over Trump's Venezuela 'War for Oil'",
    "description": "Leonardo DiCaprio has been left 'furious' after Donald Trump's invasion of Venezuela caused the closure of Caribbean airspace, forcing the actor to miss a major awards ceremony.",
    "link": "https://radaronline.com/p/leo-dicaprio-donald-trump-raged-over-venezuela-war-for-oil/",
    "timestamp": "2026-01-06T20:55:33Z"
  },
  {
    "title": "'Jimmy Kimmel Live!' Undergoing 2026 Change to Musical Guests: What Will Be Different Moving Forward",
    "description": "Jimmy Kimmel Live is going to be undergoing a change. The show just returned from winter break on Monday (January 5), and by that evening, a report had emerged about musical acts booked on the show. THR is stating that the show will be “cutting down its music…",
    "link": "https://www.justjared.com/2026/01/06/jimmy-kimmel-live-undergoing-2026-change-to-musical-guests-what-will-be-different-moving-forward/",
    "timestamp": "2026-01-06T20:52:55Z"
  },
  {
    "title": "US took entire continent hostage – Grayzone editor (VIDEO)",
    "description": "The US attack on Venezuela marks a “restoration of a bygone era in the Western hemisphere,” Grayzone editor Wyatt Reed has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/630678-grayzone-editor-reed-us-venezuela-attack-monroe-doctrine/",
    "timestamp": "2026-01-06T20:51:30Z"
  },
  {
    "title": "Trump administration thanks the media for keeping quiet before the strike that captured Maduro",
    "description": "That came from Secretary of State Marco Rubio. It contrasts with the consistent posture of Pete Hegseth's Defense Department, which has been at odds with the media.",
    "link": "https://www.pbs.org/newshour/nation/trump-administration-thanks-the-media-for-keeping-quiet-before-the-strike-that-captured-maduro",
    "timestamp": "2026-01-06T20:51:09Z"
  },
  {
    "title": "Minnesota hotel removed from approved federal lodging list after refusing to accommodate ICE agents",
    "description": "The GSA removed a Minnesota Hampton Inn from federal lodging programs after the hotel refused to accommodate ICE agents, preventing 4+ million federal employees from staying there.",
    "link": "https://www.foxnews.com/politics/minnesota-hotel-removed-from-approved-federal-lodging-list-after-refusing-accommodate-ice-agents",
    "timestamp": "2026-01-06T20:50:39Z"
  },
  {
    "title": "US forces killed 55 Venezuelan and Cuban troops in Maduro capture, official tolls say",
    "description": "Donald Trump acknowledged today that “many, many” people were killed, describing the military operation as “tactically brilliant”.",
    "link": "https://www.thejournal.ie/us-forces-killed-55-venezuela-operation-maduro-6919747-Jan2026/",
    "timestamp": "2026-01-06T20:50:02Z"
  },
  {
    "title": "Republican congressman injured in 'pretty bad' car accident",
    "description": "Republican Rep. Jim Baird of Indiana and his wife, Danise Baird, have been hospitalized following a car crash.The couple's vehicle \"was struck in an accident,\" according to a statement from Baird's office, and Speaker Mike Johnson reportedly indicated that Ba…",
    "link": "https://www.theblaze.com/news/republican-congressman-injured-in-pretty-bad-car-accident",
    "timestamp": "2026-01-06T20:49:04Z"
  },
  {
    "title": "Trump Wants To Seize Greenland Because He Doesn't Understand Trade",
    "description": "Trump doesn't understand the value of free trade. Everything happening with Greenland is downstream of that grievous problem.",
    "link": "https://reason.com/2026/01/06/trump-wants-to-seize-greenland-because-he-doesnt-understand-trade/",
    "timestamp": "2026-01-06T20:48:26Z"
  },
  {
    "title": "EV sales rebound in Germany as Chinese brands make inroads",
    "description": "Electric vehicle sales rebounded strongly in Germany in 2025, official data showed Tuesday, with Chinese manufacturers making inroads from a low base in the EU’s largest economy despite tariffs. EV sales rose 43.2 percent last year to 545,142 in total, the KB…",
    "link": "https://www.digitaljournal.com/world/ev-sales-rebound-in-germany-as-chinese-brands-make-inroads/article",
    "timestamp": "2026-01-06T20:47:32Z"
  },
  {
    "title": "From Latin America’s richest country 100 years ago to a founding member of OPEC, the long history of Venezuela’s oil and U.S. ties, explained",
    "description": "After US special forces swooped into Caracas to seize Venezuelan President Nicolás Maduro and topple his government, US President Donald Trump said the United States will now “run” Venezuela, including its abundant oil resources.\nUS companies were poised to i…",
    "link": "https://biztoc.com/x/bc3ff5be36b978c3",
    "timestamp": "2026-01-06T20:46:34Z"
  },
  {
    "title": "Tilray Q2: High Hopes or Harsh Reality?",
    "description": "As Canadian cannabis king Tilray Brands, Inc. (NASDAQ:TLRY) prepares to report its fiscal Q2 2026 results on Thursday, the company stands at a crossroads. \nTLRY stock is moving. See the chart and price action here. \nAfter years of regulatory stagnation, Presi…",
    "link": "https://biztoc.com/x/79a4b89a86671f71",
    "timestamp": "2026-01-06T20:46:03Z"
  },
  {
    "title": "Superstar Singer Björk Blasts 'Cruel Colonizer' Donald Trump for Wild Greenland Takeover Threat",
    "description": "Donald Trump has been branded a 'cruel colonizer' by Icelandic superstar singer Björk in a scathing social media attack over his threat to take over Greenland",
    "link": "https://radaronline.com/p/bjork-blasts-cruel-colonizer-trump-for-greenland-takeover-threat/",
    "timestamp": "2026-01-06T20:45:00Z"
  },
  {
    "title": "John Thune Praises Capitol Police When Asked About Trump’s J6 Website Claiming They Committed Murder",
    "description": "Senate Majority Leader John Thune praised Capitol Police in response to a question about the Trump administration trashing them on a new January 6 webpage.\nThe post John Thune Praises Capitol Police When Asked About Trump’s J6 Website Claiming They Committed …",
    "link": "https://www.mediaite.com/politics/john-thune-praises-capitol-police-when-asked-about-trumps-j6-website-claiming-they-committed-murder/",
    "timestamp": "2026-01-06T20:44:53Z"
  },
  {
    "title": "Venezuela could be sitting on a big Bitcoin stash, experts say. Here's what could happen next",
    "description": "Although it's hard to say how much bitcoin could be held by Venezuela, it's likely the regime has amassed considerable holdings of the token, experts said.",
    "link": "https://www.cnbc.com/2026/01/06/venezuela-could-be-sitting-on-a-big-bitcoin-stash-experts-say-heres-what-could-happen-next-.html",
    "timestamp": "2026-01-06T20:44:21Z"
  },
  {
    "title": "Crockett calls Trump the 'Maduro of the United States' during 'The View' appearance",
    "description": "Rep. Jasmine Crockett compared President Donald Trump to Nicolás Maduro on \"The View,\" calling Trump the \"Maduro of the United States.\"",
    "link": "https://www.foxnews.com/media/crockett-calls-trump-maduro-united-states-during-the-view-appearance",
    "timestamp": "2026-01-06T20:44:13Z"
  },
  {
    "title": "Trump says his voters loved the Venezuela attack — here’s what they really think",
    "description": "President Donald Trump promised that 'America First' would stand against more foreign entanglements.",
    "link": "https://www.bostonherald.com/2026/01/06/trump-voters-venezuela/",
    "timestamp": "2026-01-06T20:43:49Z"
  },
  {
    "title": "Five years after January 6, dozens of pardoned insurrectionists have been arrested again",
    "description": "This story was originally reported by Mariel Padilla of The 19th. Meet Mariel and read more of their reporting on gender, politics and policy.",
    "link": "https://www.advocate.com/news/crime/five-years-january-6-arrested-again",
    "timestamp": "2026-01-06T20:41:07Z"
  },
  {
    "title": "Trump’s Greenland Threats Call for Firm Response From Allies, Canada’s Rae Says",
    "description": "As European leaders seek to persuade President Donald Trump that Greenland’s security is best defended by NATO, broader concerns persist about US expansionism. Bloomberg News spoke with Bob Rae, Canada’s ambassador to the United Nations from 2020 to 2025. A l…",
    "link": "https://financialpost.com/pmn/business-pmn/trumps-greenland-threats-call-for-firm-response-from-allies-canadas-rae-says",
    "timestamp": "2026-01-06T20:40:45Z"
  },
  {
    "title": "Financial advisor believes N.L. oil will fare well even with U.S. plans for Venezuela",
    "description": "Some experts aren't worried about the U.S.'s plan to obtain Venezuelan oil and its possible impact on Newfoundland and Labrador, following the tumbling of Canadian energy stocks after the U.S. hit Venezuela with a “large-scale strike” on Saturday.",
    "link": "https://www.cbc.ca/news/canada/newfoundland-labrador/venezuela-impact-nl-9.7035401",
    "timestamp": "2026-01-06T20:40:26Z"
  },
  {
    "title": "Maduro abduction shows influence, limits of US Secretary of State Rubio",
    "description": "Top diplomat has long pushed toppling of Maduro, with eye towards Cuba, but remains constrained by competing ambitions.",
    "link": "https://www.aljazeera.com/news/2026/1/6/maduro-abduction-shows-influence-limits-of-us-secretary-of-state-rubio",
    "timestamp": "2026-01-06T20:40:06Z"
  },
  {
    "title": "Megyn Kelly Savagely Takes Down Fox News For Sucking Up To Trump: It’s Like ‘Watching Russian Propaganda’",
    "description": "“There are serious reasons to just exercise a note of caution before we just get on the rah-rah train,\" the conservative pundit said of her old network.",
    "link": "https://www.huffpost.com/entry/megyn-kelly-criticizes-fox-news-trump-coverage-venezuela_n_695d392ce4b0b1914ed1ab42",
    "timestamp": "2026-01-06T20:39:07Z"
  },
  {
    "title": "Björk Has a Plan to Save Greenland From Donald Trump",
    "description": "After Venezuela, the Trump administration apparently has set its sights on Greenland. But Icelandic singer Björk has a solution.",
    "link": "https://www.vanityfair.com/news/story/bjork-save-greenland-from-donald-trump",
    "timestamp": "2026-01-06T20:38:58Z"
  },
  {
    "title": "Trump says his voters loved the Venezuela attack — here’s what they really think",
    "description": "It's only been days since an audacious U.S. raid snatched Nicolás Maduro from a Venezuelan military base and sped him to a Brooklyn prison, yet Detroit-area ...",
    "link": "https://www.yahoo.com/news/articles/trump-says-voters-loved-venezuela-203719872.html",
    "timestamp": "2026-01-06T20:37:19Z"
  },
  {
    "title": "Melania Trump Isn't a Fan! The Don, 79, Admits His Wife Called Him 'Unpresidential' and Hates His Dance Moves — as Rumors Their Marriage Is 'Crumbling' Ramp Up",
    "description": "Donald Trump revealed his wife Melania labeled him 'unpresidential' and hates his dancing in a new speech.",
    "link": "https://radaronline.com/p/donald-trump-melania-labeled-him-unpresidential-hates-dance-moves/",
    "timestamp": "2026-01-06T20:37:06Z"
  },
  {
    "title": "White House courts Big Oil on risky overseas energy play",
    "description": "President Donald Trump is courting Big Oil on a risky overseas energy play as Energy Secretary Chris Wright quietly tests industry appetite for a massive Venezuela revival.\nU.S. Energy Secretary Chris Wright “plans to talk this week with oil-industry executiv…",
    "link": "https://biztoc.com/x/267335b9e95d563b",
    "timestamp": "2026-01-06T20:35:17Z"
  },
  {
    "title": "What the U.S. takeover of Venezuela could mean for Canada's oil industry",
    "description": "After the daring arrest and extradition of Venezuelan President Nicolás Maduro on Saturday, United States President Donald Trump said he wants American oil companies to “go in” and “spend billions of dollars” to rehabilitate the South American country’s dilap…",
    "link": "https://biztoc.com/x/649bde1df4365e1c",
    "timestamp": "2026-01-06T20:35:16Z"
  },
  {
    "title": "‘Breathtaking Cruelty’: Trump Cuts Billions in Federal Childcare Funds for Democrat-Led States",
    "description": "The Trump administration is portraying its decision to slash $10 billion in funding to five Democrat-led states as a response to a scandal in Minnesota, where dozens of people have been convicted of stealing public money through the state's social services sy…",
    "link": "https://www.commondreams.org/news/trump-cuts-federal-funding",
    "timestamp": "2026-01-06T20:35:12Z"
  },
  {
    "title": "January 6 attack an attempted coup against US democracy — Pelosi",
    "description": "Nancy Pelosi calls the January 6 attack an attempted coup incited by Donald Trump, describing it as a direct assault on American democracy.\n\nRead More: https://punchng.com/january-6-attack-an-attempted-coup-against-us-democracy-pelosi/",
    "link": "https://punchng.com/january-6-attack-an-attempted-coup-against-us-democracy-pelosi/",
    "timestamp": "2026-01-06T20:35:05Z"
  },
  {
    "title": "Turkey’s Erdogan, a Longtime Maduro Pal, Seeks Role in Venezuela Situation",
    "description": "Turkish President Recep Tayyip Erdogan, a longtime ally of deposed and incarcerated narco-terrorist dictator Nicolás Maduro, is looking for a role in the crisis currently unfolding in Venezuela – and hoping to protect the investments Turkey made with the corr…",
    "link": "https://www.breitbart.com/latin-america/2026/01/06/turkeys-erdogan-a-longtime-maduro-pal-seeks-role-in-venezuela-situation/",
    "timestamp": "2026-01-06T20:33:41Z"
  },
  {
    "title": "JD Vance Breaks Down The Latest On The Trump Administration’s Crackdown On Left-Wing Violence",
    "description": "Vice President JD Vance told Scott Jennings the Trump administration was looking into the “entire network” of organizations that support left-wing violence.",
    "link": "https://dailycaller.com/2026/01/06/jd-vance-breaks-down-the-latest-on-the-trump-administrations-crackdown-on-left-wing-violence/",
    "timestamp": "2026-01-06T20:33:20Z"
  },
  {
    "title": "Meta hires Microsoft exec, former Trump deputy as chief legal officer",
    "description": "Meta said Tuesday that it hired former Microsoft legal executive Curtis Joseph Mahoney to become its chief legal officer.",
    "link": "https://www.cnbc.com/2026/01/06/meta-hires-microsoft-exec-former-trump-deputy-as-chief-legal-officer.html",
    "timestamp": "2026-01-06T20:33:03Z"
  },
  {
    "title": "The Irish Times view on the record tax take: don’t spend it all at once",
    "description": "The strong figures will increase pressure on the Government to spend more and more",
    "link": "https://www.irishtimes.com/opinion/editorials/2026/01/06/the-irish-times-view-on-the-record-tax-take-dont-spend-it-all-at-once/",
    "timestamp": "2026-01-06T20:33:00Z"
  },
  {
    "title": "The Mint’s 250th anniversary coins face a whitewashing controversy",
    "description": "The designs omitted several notable moments for civil rights and women’s rights",
    "link": "https://theweek.com/politics/mint-250-anniversary-whitewashing-controversy",
    "timestamp": "2026-01-06T20:31:10Z"
  },
  {
    "title": "Trump Upset That Maduro and Melania Don’t Respect His Dancing",
    "description": "Reports that Trump was angered by Maduro mocking his rally dance seemed too dumb to be true. But he basically confirmed the Maduro news today while mocking his wife’s ignorance on FDR.",
    "link": "http://nymag.com/intelligencer/article/trump-upset-maduro-and-melania-dont-respect-his-dancing.html",
    "timestamp": "2026-01-06T20:30:56Z"
  },
  {
    "title": "Chevron Keeps Venezuelan Oil Flowing as Asia Shipments Stall",
    "description": "Venezuela’s beleaguered oil export system is narrowing rapidly around Chevron as shipments to its largest traditional customer in China remain stalled amid an intensified U.S. oil embargo and mounting geopolitical upheaval. Shipping data as of January 6 shows…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Chevron-Keeps-Venezuelan-Oil-Flowing-as-Asia-Shipments-Stall.html",
    "timestamp": "2026-01-06T20:30:00Z"
  },
  {
    "title": "Average nationwide gas prices will dip below $3 per gallon this year, GasBuddy projects",
    "description": "For the first time since 2020, the annual average price of gas is projected to fall below $3 a gallon for 2026 GasBuddy says.",
    "link": "https://www.nbcnews.com/business/energy/gas-prices-2026-gasbuddy-report-rcna252580",
    "timestamp": "2026-01-06T20:28:14Z"
  },
  {
    "title": "What the U.S. takeover of Venezuela could mean for Canada's oil industry",
    "description": "The Financial Post looks at the state of Venezuela’s oil industry and what the upheaval could mean for Canada. Find out more here",
    "link": "https://financialpost.com/commodities/energy/what-u-s-takeover-venezuela-could-mean-for-canada-oil-industry",
    "timestamp": "2026-01-06T20:26:15Z"
  },
  {
    "title": "They Can’t Stop The Unstoppable Rise Of Silver Because They Are Losing Their Grip On The Entire Global Financial System",
    "description": "The rules of the game have changed. At one time, western bankers could easily pull a few strings and keep the global price of silver within an acceptable range. But now financial centers in Asia are becoming more dominant, and supplies of physical silver are …",
    "link": "http://theeconomiccollapseblog.com/they-cant-stop-the-unstoppable-rise-of-silver-because-they-are-losing-their-grip-on-the-entire-global-financial-system/",
    "timestamp": "2026-01-06T20:25:51Z"
  },
  {
    "title": "Nordic FMs stress collective dedication to Arctic security, urge respect for int'l law",
    "description": "OSLO, Jan. 6 (Xinhua) -- Foreign ministers of Denmark, Finland, Iceland, Norway and Sweden issued a joint statement on Tuesday emphasizing their collective dedication to preserving security, stability and cooperation in the Arctic. Read full story",
    "link": "https://www.thestar.com.my/news/world/2026/01/07/nordic-fms-stress-collective-dedication-to-arctic-security-urge-respect-for-int039l-law",
    "timestamp": "2026-01-06T20:24:00Z"
  },
  {
    "title": "‘Over my dead body!’ Watch Tim Walz refuse to step down as he rips Trump",
    "description": "'The question I think they need to decide is when does the guy in the White House resign?'",
    "link": "https://www.wnd.com/2026/01/my-dead-body-watch-tim-walz-refuse-step/",
    "timestamp": "2026-01-06T20:23:00Z"
  },
  {
    "title": "US, Venezuela discuss exporting stranded crude to American refiners",
    "description": "US and Venezuelan officials are discussing exporting stranded Venezuelan crude to US refiners as sanctions and storage limits force PDVSA output cuts.",
    "link": "https://www.thehindubusinessline.com/news/world/us-venezuela-discuss-exporting-stranded-crude-to-american-refiners/article70479772.ece",
    "timestamp": "2026-01-06T20:21:36Z"
  },
  {
    "title": "Ivanka, Kai Trump Share Rare Family Photos In Celebration Of Eric’s Birthday",
    "description": "Ivanka Trump delighted followers January 6 by dipping into the family archives to celebrate her brother Eric Trump’s birthday.",
    "link": "https://dailycaller.com/2026/01/06/ivanka-kai-trump-photos-nostalgic-celebrating-eric-birthday-nasa-airplane/",
    "timestamp": "2026-01-06T20:21:34Z"
  },
  {
    "title": "Democrats warn of 'whitewash' five years after January 6 Capitol attack, while Trump rallies with Republicans",
    "description": "WASHINGTON, ‌Jan 6 (Reuters) - Five years after the January 6, 2021, attack on the U.S. Capitol, Democrats in Congress accused Republicans of a \"whitewash\" of ‌history while President Donald Trump delivered an upbeat speech to Republican lawmakers that made l…",
    "link": "https://www.thestar.com.my/news/world/2026/01/07/democrats-warn-of-039whitewash039-five-years-after-january-6-capitol-attack-while-trump-rallies-with-republicans",
    "timestamp": "2026-01-06T20:21:00Z"
  },
  {
    "title": "Transcript: Trump Will Invade Another Country Unless We Stop Him",
    "description": "This is a lightly edited transcript of the January 5 edition of Right Now With Perry Bacon. You can watch the video here or by following this show on YouTube or Substack.Perry Bacon: Welcome everybody.This is Perry Bacon. And this is The New Republic show Rig…",
    "link": "https://newrepublic.com/article/204982/transcript-trump-will-invade-another-country-unless-stop",
    "timestamp": "2026-01-06T20:20:58Z"
  },
  {
    "title": "Trump Mobile's phone nowhere to be found",
    "description": "A golden phone that President Donald Trump’s family business promised to release last year remains mysteriously under wraps as the technology industry serves up a gluttony of new gadgets in Las Vegas this week",
    "link": "https://www.wsoctv.com/news/business/trump-mobiles-golden/DC5ZPRRL442FBEZZX3EE3MOBNE/",
    "timestamp": "2026-01-06T20:20:24Z"
  },
  {
    "title": "'He looks terrible': Wild photo of Trump ignites social media frenzy",
    "description": "Internet critics sounded off Tuesday after President Donald Trump was caught in an unflattering press photograph while delivering a speech to House Republicans at the Kennedy Center. The picture, taken in the middle of a rant about transgender women athletes,…",
    "link": "https://www.rawstory.com/trump-image/",
    "timestamp": "2026-01-06T20:20:20Z"
  },
  {
    "title": "Trump White House Launches Jan. 6 Website Accusing Democrats of Fabricating an ‘Insurrection Narrative’",
    "description": "The page accuses Nancy Pelosi and other Dems of \"branding peaceful patriotic protesters as 'insurrectionists' and framing the event as a violent coup attempt orchestrated by Trump\"\nThe post Trump White House Launches Jan. 6 Website Accusing Democrats of Fabri…",
    "link": "https://www.thewrap.com/media-platforms/politics/trump-white-house-january-6-website-democrats-fabricated-insurrection/",
    "timestamp": "2026-01-06T20:19:09Z"
  },
  {
    "title": "The 5 Most Unhinged Claims Made on Trump’s Jaw-Dropping New January 6 Website",
    "description": "President Donald Trump's White House unveiled a new website on Tuesday dedicated to revising the historical record on the riot at the Capitol Building.\nThe post The 5 Most Unhinged Claims Made on Trump’s Jaw-Dropping New January 6 Website first appeared on Me…",
    "link": "https://www.mediaite.com/media/news/the-5-most-unhinged-claims-made-on-trumps-jaw-dropping-new-january-6-website/",
    "timestamp": "2026-01-06T20:17:26Z"
  },
  {
    "title": "Trump In High-Speed Chase From International Cops After Breaking International Law",
    "description": "SOMEWHERE IN THE NEVADA DESERT — U.S. President Donald Trump was spotted fleeing from international cops in a high-speed chase after allegedly breaking international law again. The International Police Squad is an elite law enforcement team that has been imbu…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360731/posts",
    "timestamp": "2026-01-06T20:13:45Z"
  },
  {
    "title": "Kristi Noem's Cutthroat Plans For FEMA Disaster Responders Revealed",
    "description": "A report from The Washington Post indicates that the White House is planning to reduce the number of FEMA workers by half.",
    "link": "https://www.ibtimes.com/kristi-noems-cutthroat-plans-fema-disaster-responders-revealed-3794530",
    "timestamp": "2026-01-06T20:13:27Z"
  },
  {
    "title": "Trump: 'Torture Chamber' Being Closed in Caracas",
    "description": "President Donald Trump told House Republicans on Tuesday, during remarks at their annual retreat, that ousted Venezuelan leader Nicolas Maduro had tortured people, describing him as responsible for widespread violence and abuse. \"He's a violent guy and he's k…",
    "link": "https://freerepublic.com/focus/f-bloggers/4360730/posts",
    "timestamp": "2026-01-06T20:12:24Z"
  },
  {
    "title": "Trump: 'Torture Chamber' Being Closed in Caracas",
    "description": "President Donald Trump told House Republicans on Tuesday, during remarks at their annual retreat, that ousted Venezuelan leader Nicolas Maduro had tortured people, describing him as responsible for widespread violence and abuse. \"He's a violent guy and he's k…",
    "link": "https://freerepublic.com/focus/f-news/4360730/posts",
    "timestamp": "2026-01-06T20:12:24Z"
  },
  {
    "title": "Rand Paul breaks with Trump on Venezuela, calls action ‘war’ as Senate prepares constitutional showdown",
    "description": "Sen. Rand Paul calls U.S. military action in Venezuela \"war,\" challenging the Trump administration's authority as Senate debates war powers resolution.",
    "link": "https://www.foxnews.com/politics/rand-paul-breaks-with-trump-on-venezuela-calls-action-war-as-senate-prepares-constitutional-showdown",
    "timestamp": "2026-01-06T20:11:00Z"
  },
  {
    "title": "Republicans accidentally protected abortion while trying to kill Obamacare",
    "description": "The Wyoming Supreme Court ruled on Tuesday that abortion must remain legal in that state, despite a 2023 law seeking to ban it. The case is known as State v. Johnson. Wyoming is America’s reddest state — President Donald Trump won Wyoming by 46 points in 2024…",
    "link": "https://www.vox.com/policy/474208/wyoming-supreme-court-abortion-obamacare-state-johnson",
    "timestamp": "2026-01-06T20:09:47Z"
  },
  {
    "title": "Why Trump Reportedly Threw A Major Curveball Into Venezuela Regime Change",
    "description": "Trump has several reasons for not supporting opposition leader Machado, the NYT reported, including that her relationship began to sour with officials.",
    "link": "https://dailycaller.com/2026/01/06/donald-trump-maria-corina-machado-nicolas-maduro-venezuela/",
    "timestamp": "2026-01-06T20:09:43Z"
  },
  {
    "title": "European leaders reject Trump’s push for US takeover of Greenland",
    "description": "European leaders led by Denmark pushed back against Donald Trump’s remarks on a US takeover of Greenland, saying the Arctic island belongs to its people.",
    "link": "https://www.thehindubusinessline.com/news/world/european-leaders-reject-trumps-push-for-us-takeover-of-greenland/article70479765.ece",
    "timestamp": "2026-01-06T20:09:18Z"
  },
  {
    "title": "LA Mayor Compares Trump’s ICE ‘Kidnappings’ to Japanese Internment Camps and Fugitive Slave Patrols",
    "description": "LA Mayor Karen Bass compared President Trump sending ICE agents to arrest illegal immigrants to \"fugitive slave patrols\" and to the Japanese internment camps\nThe post LA Mayor Compares Trump’s ICE ‘Kidnappings’ to Japanese Internment Camps and Fugitive Slave …",
    "link": "https://www.mediaite.com/politics/la-mayor-compares-trumps-ice-kidnappings-to-japanese-internment-camps-and-fugitive-slave-patrols/",
    "timestamp": "2026-01-06T20:09:02Z"
  },
  {
    "title": "3553 - Trump and RFK Jr's Assault on Your Health w/ Dr. Kristin Lyerly",
    "description": "It's News Day Tuesday on the Majority Report On today's program: Sean Hannity attempts to coax Venezuelan opposition figure María Corina Machado into gifting her Nobel Peace Prize to Donald Trump as a way to flatter him into installing her as Venezuela's pres…",
    "link": "https://majorityfm.libsyn.com/3553-trump-and-rfk-jrs-assault-on-your-health-w-dr-kristin-lyerly",
    "timestamp": "2026-01-06T20:09:00Z"
  },
  {
    "title": "Grok is undressing children — can the law stop it?",
    "description": "Grok began 2026 as it began 2025: under fire for its AI-generated images. Elon Musk's chatbot has spent the last week flooding X with nonconsensual, sexualized deepfakes of adults and minors. Circulating screenshots show Grok complying with requests to put re…",
    "link": "https://www.theverge.com/ai-artificial-intelligence/855832/grok-undressing-children-csam-law-x-elon-musk",
    "timestamp": "2026-01-06T20:08:18Z"
  },
  {
    "title": "Somali Democrat Runs In Utah’s Brand New Deep Blue House Seat",
    "description": "Liban Mohamed, a Utah Democrat of Somali descent, jumped into a packed race for the state's 1st Congressional District on Monday.",
    "link": "https://dailycaller.com/2026/01/06/somali-democrat-runs-utahs-deep-blue-house-seat/",
    "timestamp": "2026-01-06T20:07:37Z"
  },
  {
    "title": "Brian Quintenz joins SUI Group board after CFTC nomination pulled",
    "description": "The former CFTC commissioner and Donald Trump’s first pick to chair the agency will join investment company SUI Group's board and support the company’s treasury strategy.",
    "link": "https://cointelegraph.com/news/brian-quintenz-cftc-sui-group-board",
    "timestamp": "2026-01-06T20:06:06Z"
  },
  {
    "title": "'A moving moment' as Rosenior breaks barriers",
    "description": "Liam Rosenior's appointment as Chelsea manager is a \"massive moment\" for representation in the Premier League.",
    "link": "https://www.bbc.com/sport/football/articles/c78e5nn9g8jo",
    "timestamp": "2026-01-06T20:05:51Z"
  },
  {
    "title": "Ultimately, NPR Will Be Okay, Says Ari Shapiro",
    "description": "“While NPR may be staring down a tough couple of years ahead, I think public radio is better positioned in the long run than most American news organizations right now.” – Substack",
    "link": "https://arishapiro.substack.com/p/will-npr-be-ok",
    "timestamp": "2026-01-06T20:03:00Z"
  },
  {
    "title": "Russia declares solidarity with Venezuela",
    "description": "Moscow has welcomed the appointment of Delcy Rodriguez as Venezuelan interim president after Nicolas Maduro was abducted by US forces Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/630677-russia-reaffirms-solidarity-venezuela-us-aggression/",
    "timestamp": "2026-01-06T20:02:10Z"
  },
  {
    "title": "Awkward: Biden Forced To Pay Trump The $25 Million Bounty For Capturing Maduro",
    "description": "WILMINGTON, DE — With the successful military operation to topple the authoritarian Venezuelan government, former President Joe Biden was notified that he was being forced to pay Donald Trump the $25 million bounty his administration had put in place for capt…",
    "link": "https://babylonbee.com/news/awkward-biden-forced-to-pay-trump-the-25-million-bounty-for-capturing-maduro",
    "timestamp": "2026-01-06T20:01:17Z"
  },
  {
    "title": "‘We’re going to keep the oil’: Trump tells Joe Scarborough why Venezuela is not Iraq 2.0",
    "description": "In an exclusive phone conversation with MS NOW’s Joe Scarborough, President Donald Trump shed light on what could come next for Venezuela after the country was thrown into tumult by the U.S. military operation that ended with President Nicolás Maduro’s captur…",
    "link": "https://biztoc.com/x/47bf80ec54488971",
    "timestamp": "2026-01-06T20:01:13Z"
  },
  {
    "title": "Top Canadian officials to visit Greenland amid international fears as Trump eyes NATO-linked territory",
    "description": "Canadian leaders reportedly plan Greenland visit in February amid growing international tensions over President Donald Trump's annexation comments.",
    "link": "https://www.foxnews.com/world/top-canadian-officials-visit-greenland-amid-international-fears-trump-eyes-nato-linked-territory",
    "timestamp": "2026-01-06T19:58:49Z"
  },
  {
    "title": "Fact check: Trump makes false claims about crime, January 6 and the economy in GOP speech | CNN Politics",
    "description": "President Donald Trump abandoned his teleprompter in favor of impromptu musings in a speech at a retreat for House Republicans on Tuesday. And those ad-libbed Trump comments were filled with false claims.",
    "link": "https://www.cnn.com/2026/01/06/politics/fact-check-trump-gop-speech",
    "timestamp": "2026-01-06T19:57:58Z"
  },
  {
    "title": "Scotiabank CEO Sees ‘Trump Doctrine’ as Positive for Growth",
    "description": "Bank of Nova Scotia’s international business could benefit from a rightward political shift in Latin America alongside rising US influence in the region, Chief Executive Officer Scott Thomson said.",
    "link": "https://www.livemint.com/companies/news/scotiabank-ceo-sees-trump-doctrine-as-positive-for-growth-11767729300151.html",
    "timestamp": "2026-01-06T19:54:59Z"
  },
  {
    "title": "Trump Announces California's Time Has Come - 'Fraud Investigation' Underway",
    "description": "As President Donald Trump cracks down on fraud in federally funded programs, he announces which state is next.",
    "link": "https://www.westernjournal.com/trump-announces-californias-time-come-fraud-investigation-underway/",
    "timestamp": "2026-01-06T19:53:56Z"
  },
  {
    "title": "Israel and Syria resume diplomatic dialogue after months of silence under US mediation",
    "description": "Israel and Syria reportedly resume diplomatic talks with U.S. backing under Trump's Middle East peace vision, focusing on border security and regional stability.",
    "link": "https://www.foxnews.com/world/israel-syria-resume-diplomatic-dialogue-after-months-silence-under-us-mediation",
    "timestamp": "2026-01-06T19:51:40Z"
  },
  {
    "title": "Scotiabank CEO Sees ‘Trump Doctrine’ as Positive for Growth",
    "description": "Bank of Nova Scotia’s international business could benefit from a rightward political shift in Latin America alongside rising US influence in the region, Chief Executive Officer Scott Thomson said.",
    "link": "https://financialpost.com/pmn/business-pmn/scotiabank-ceo-sees-trump-doctrine-as-positive-for-growth",
    "timestamp": "2026-01-06T19:50:49Z"
  },
  {
    "title": "Trump White House Publishes Government-Sanctioned Lies About January 6",
    "description": "The Trump White House published a false Jan 6 narrative on WhiteHouse.gov, replacing court records and video evidence with a state-approved rewrite of history.\nThe post Trump White House Publishes Government-Sanctioned Lies About January 6 first appeared on M…",
    "link": "https://www.mediaite.com/opinion/trump-white-house-publishes-government-sanctioned-lies-about-january-6/",
    "timestamp": "2026-01-06T19:49:51Z"
  },
  {
    "title": "Resolution to block Trump from invading Greenland introduced by Sen. Gallego",
    "description": "Concerns about U.S. action against Greenland have grown after the U.S. attack on Venezuela, which led to the capture of leader Nicolas Maduro.",
    "link": "https://www.cnbc.com/2026/01/06/trump-greenland-resolution-gallego-invading.html",
    "timestamp": "2026-01-06T19:49:46Z"
  }
]