[
  {
    "title": "Sales, Prices Defy Tariff-Effect Predictions As Rates Are Clarified",
    "description": "There's evidence import tariffs are not driving up vehicle prices or chilling sales. The news comes as there's new clarity on import tariff levels.",
    "link": "https://www.forbes.com/sites/edgarsten/2025/08/13/sales-prices-defy-tariff-effect-predictions-as-rates-are-clarified/",
    "timestamp": "2025-08-13T10:19:08Z"
  },
  {
    "title": "DC Mayor Slams Trump’s ‘Authoritarian Push’ as National Guard Deploys in Crime Crackdown",
    "description": "Bowser delivered her sharpest rebuke yet to Trump, condemning his deployment of the Nat'l Guard as an “authoritarian push\" in an online town hall.\nThe post DC Mayor Slams Trump’s ‘Authoritarian Push’ as National Guard Deploys in Crime Crackdown first appeared…",
    "link": "https://www.mediaite.com/media/news/dc-mayor-brands-trumps-national-guard-takeover-an-authoritarian-push-in-online-town-hall/",
    "timestamp": "2025-08-13T10:18:27Z"
  },
  {
    "title": "Walmart To Pay Out Millions in California Lawsuit: What To Know",
    "description": "\"When someone brings an item to the register to be scanned, the price must be right,\" Santa Clara District Attorney Jeff Rosen said.",
    "link": "https://www.newsweek.com/walmart-overcharging-settlement-california-lawsuit-2112696",
    "timestamp": "2025-08-13T10:18:12Z"
  },
  {
    "title": "National Guard arrives on streets of Washington DC despite 'historic' lows in crime",
    "description": "National Guard troops have begun arriving on the streets of Washington DC in a controversial move by Donald Trump to \"rescue our nation's capital from crime\".",
    "link": "https://news.sky.com/story/national-guard-arrives-on-streets-of-washington-dc-despite-historic-lows-in-crime-13411013",
    "timestamp": "2025-08-13T10:18:00Z"
  },
  {
    "title": "Kiev downplays Putin-Trump summit",
    "description": "The two leaders can’t make any deals on Ukraine without it, Vladimir Zelensky has claimed Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/622832-kiev-downplays-putin-trump-summit/",
    "timestamp": "2025-08-13T10:17:13Z"
  },
  {
    "title": "Trump set to announce Kennedy Center Honorees as he tries to put his stamp on DC | CNN Politics",
    "description": "President Donald Trump will appear at the Kennedy Center on Wednesday, where he’s expected to announce the first recipients of its hallmark honors since he seized control of the institution’s board earlier this year.",
    "link": "https://www.cnn.com/2025/08/13/politics/kennedy-center-honorees-donald-trump",
    "timestamp": "2025-08-13T10:14:52Z"
  },
  {
    "title": "Former Navy SEAL Rep. Eli Crane fires off message for ex-President Obama: 'Probably best to sit this one out'",
    "description": "In response to a post on X by former President Barack Obama, Republican Rep. Eli Crane told the Democrat, \"Probably best to sit this one out\"",
    "link": "https://www.foxnews.com/politics/former-navy-seal-rep-eli-crane-fires-off-message-ex-president-obama-probably-best-sit-one-out",
    "timestamp": "2025-08-13T10:11:41Z"
  },
  {
    "title": "Trump’s Homelessness Crackdown Has Been Tried Before. It Didn’t Work.",
    "description": "This week, President Donald Trump announced that his administration will remove homeless encampments from Washington, DC. It came at a press conference in which he declared a public safety emergency in the nation’s capital, despite violent crime numbers hitti…",
    "link": "https://www.motherjones.com/politics/2025/08/homelessness-trump-washington-dc-housing-first-sam-tsemberis/",
    "timestamp": "2025-08-13T10:10:00Z"
  },
  {
    "title": "Two Key Trump Factors Divert European Travelers Away From US: TUI",
    "description": "TUI is Europe's largest tour operator.",
    "link": "https://www.newsweek.com/trump-travel-europe-tui-border-visa-2112726",
    "timestamp": "2025-08-13T10:07:22Z"
  },
  {
    "title": "Trump’s takeover of DC police: Can he, why now, and is it necessary?",
    "description": "“I’m announcing a historic action to rescue our nation’s capital from crime, bloodshed, bedlam and squalor and worse,” Trump said, joined by US Attorney General Pam Bondi, who will oversee the force.",
    "link": "https://indianexpress.com/article/world/donald-trump-takeover-washington-dc-police-can-he-why-now-and-is-it-necessary-10185387/",
    "timestamp": "2025-08-13T10:07:18Z"
  },
  {
    "title": "Iran: EU leaders threaten snapback sanctions over nukes",
    "description": "France, Germany and the UK have threatened UN \"snapback\" sanctions on Iran if Tehran does not allow IAEA inspectors into remaining nuclear facilities. The European nations gave Iran two weeks to resolve the issue.",
    "link": "https://www.dw.com/en/iran-eu-leaders-threaten-snapback-sanctions-over-nukes/a-73620576",
    "timestamp": "2025-08-13T10:06:00Z"
  },
  {
    "title": "How the unraveling of two Pentagon projects may result in a costly do-over",
    "description": "WASHINGTON (Reuters) -Donald Trump's Navy and Air Force are poised to cancel two nearly complete software projects that took 12 years and well over $800...",
    "link": "https://www.yahoo.com/news/articles/unraveling-two-pentagon-projects-may-100451935.html",
    "timestamp": "2025-08-13T10:04:51Z"
  },
  {
    "title": "Chris Murphy Goes All In on Funding Bill Boycott",
    "description": "Sen. Chris Murphy (D-CT) wants to pick a fight with Donald Trump over government funding — even if his fellow Democrats don’t, Politico reports. Said Murphy: “Every single day, there’s new evidence that our democracy",
    "link": "https://politicalwire.com/2025/08/13/chris-murphy-goes-all-in-on-funding-bill-boycott/",
    "timestamp": "2025-08-13T10:02:42Z"
  },
  {
    "title": "India plans to diversify non-US trade – media",
    "description": "New Delhi is looking to increase its economic engagement in the Middle East and Africa Read Full Article at RT.com",
    "link": "https://www.rt.com/india/622833-india-plan-diversify-non-us-trade/",
    "timestamp": "2025-08-13T10:01:42Z"
  },
  {
    "title": "Netanyahu Is Getting What He Wants",
    "description": "International condemnation is not a problem as long as the Israeli government’s long-term objectives are advanced.",
    "link": "http://foreignpolicy.com/2025/08/13/netanyahu-israel-gaza-what-he-wants/",
    "timestamp": "2025-08-13T10:00:55Z"
  },
  {
    "title": "What’s Going to Happen to TikTok?",
    "description": "TikTok is legally banned, but Donald Trump has kept it online. Would a sale to MAGA allies change the nature of the app?",
    "link": "http://nymag.com/intelligencer/article/whats-going-to-happen-to-tiktok.html",
    "timestamp": "2025-08-13T10:00:16Z"
  },
  {
    "title": "What we know about Trump’s meeting with Vladimir Putin in Alaska",
    "description": "Trump-Putin summit set for Alaska Friday as president seeks to determine if Ukraine ceasefire possible, marking Putin's first U.S. visit in decade.",
    "link": "https://www.foxnews.com/world/what-we-know-about-trumps-meeting-vladimir-putin-alaska",
    "timestamp": "2025-08-13T10:00:14Z"
  },
  {
    "title": "In redistricting clash, Texas GOP flexes power to shut down Democrats’ last tool of resistance",
    "description": "The Texas Supreme Court could permanently kill Texas Democrats' ability to stall legislation.",
    "link": "https://www.salon.com/2025/08/13/in-redistricting-clash-texas-gop-flexes-power-to-shut-down-democrats-last-tool-of-resistance_partner/",
    "timestamp": "2025-08-13T10:00:02Z"
  },
  {
    "title": "Signing Bonuses, Loan Forgiveness and More: Americans Flock to Join ICE",
    "description": "The Trump administration is looking to hire 10,000 new ICE agents as part of its immigration crackdown. Ten times that number have already applied.",
    "link": "https://www.newsweek.com/ice-recruitment-campaign-applications-mass-deportations-2112375",
    "timestamp": "2025-08-13T10:00:02Z"
  },
  {
    "title": "Why has Trump taken over D.C.?",
    "description": "U.S President Trump has deployed over 800 National Guard troops to Washington D.C., and taken over the capital’s police department. What could this mean for cities across the U.S.?",
    "link": "https://www.cbc.ca/radio/frontburner/why-has-trump-taken-over-d-c-1.7607414",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "Trump Authorized Military Operations on Foreign Soil to Target Latin American Cartels",
    "description": "Secretary of State Marco Rubio announced a $50 million bounty on the Venezuelan President Maduro and said the US was prepared to crack down on cartels President Donald Trump has ordered the US military to take direct actions against Latin American cartels, in…",
    "link": "https://www.activistpost.com/trump-authorized-military-operations-on-foreign-soil-to-target-latin-american-cartels/",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "Former White House attorney Ty Cobb said Trump is 'worse than anyone in our history'",
    "description": "Cobb, a White House lawyer during Trump's first presidency, made the remark on an acquaintance's private Facebook post.",
    "link": "https://www.snopes.com//fact-check/trump-white-house-ty-cobb/",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "How to Gauge the Strength of Trump’s Fact-Free Economy",
    "description": "The Bureau of Labor Statistics didn’t include this in its press release, but the headline news from Tuesday’s Consumer Price Index announcement is that William J. Wiatrowski probably won’t get fired.Wiatrowski is deputy commissioner at BLS, a civil-service po…",
    "link": "https://newrepublic.com/article/199039/gauge-strength-trump-fact-free-economy",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "The Virtue of Integrity",
    "description": "The only way out of our wreckage is to rewrite the cultural script, to make excellence in character admired again.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/08/integrity-politics-trump-corruption/683837/",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "Adam Friedland’s Comedy of Discomforts",
    "description": "His rendition of the talk show is innately subversive, at direct odds with the squeaky-clean, white-bread humor that is typical of its cable counterpart.",
    "link": "https://www.newyorker.com/culture/the-lede/adam-friedlands-comedy-of-discomforts",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "Taking from the poor to give to the rich is as wrong as it’s always been",
    "description": "The CBO says Trump's megabill will decrease resources \"for households toward the bottom\" of the income scale and increase for households \"toward the top.\"",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-beautiful-bill-cbo-report-rcna224544",
    "timestamp": "2025-08-13T10:00:00Z"
  },
  {
    "title": "White House orders review of Smithsonian museums and exhibits to make sure they align with Trump’s vision",
    "description": "Trump’s administration aims to ‘celebrate American exceptionalism, remove divisive or partisan narratives, and restore confidence in our shared cultural institutions’.",
    "link": "https://7news.com.au/news/white-house-orders-review-of-smithsonian-museums-and-exhibits-to-make-sure-they-align-with-trumps-vision-c-19673005",
    "timestamp": "2025-08-13T09:56:14Z"
  },
  {
    "title": "Russian FM: Lavrov to take part in Alaska summit",
    "description": "Russian Foreign Minister Sergey Lavrov will take part in the United States-Russia summit in Alaska on August 15, where US President Donald Trump and his Russian counterpart Vladimir Putin are set to m...",
    "link": "https://biztoc.com/x/ace0ca9799b7696d",
    "timestamp": "2025-08-13T09:54:52Z"
  },
  {
    "title": "What are Zelenskyy, Europe demanding of Trump ahead of Putin summit?",
    "description": "Ukraine and EU see no sign that Russia is preparing for a ceasefire ahead of Trump-Putin talks on Friday.",
    "link": "https://www.aljazeera.com/news/2025/8/13/what-are-zelenskyy-europe-demanding-of-trump-ahead-of-putin-summit",
    "timestamp": "2025-08-13T09:49:44Z"
  },
  {
    "title": "Report: Toronto Film Festival Cancels October 7 Doc, Supposedly over Hamas Copyright to Murder Footage",
    "description": "The Toronto International Film Festival (TIFF) has canceled a documentary about the October 7, 2023, terror attack, ostensibly because of concerns that Hamas might have copyright claims to footage it of its murders.\nThe post Report: Toronto Film Festival Canc…",
    "link": "https://www.breitbart.com/entertainment/2025/08/13/report-toronto-film-festival-cancels-october-7-doc-over-hamas-copyright-to-murder-footage/",
    "timestamp": "2025-08-13T09:49:19Z"
  },
  {
    "title": "Republican China hawk dings Trump on chips",
    "description": "Some Republicans are knocking President Donald Trump for an unusual deal that will see the US government take a cut of Nvidia and AMD’s China chip sales, the latest indication of a split between the administration and the GOP’s China hawks.\nRep. John Moolenaa…",
    "link": "https://biztoc.com/x/9b6ae40d59cdb6f2",
    "timestamp": "2025-08-13T09:43:55Z"
  },
  {
    "title": "Zelensky, European Leaders Hope To Sway Trump Before Putin Summit",
    "description": "Ukraine's President Volodymyr Zelensky and European leaders were to hold urgent talks with US President Donald Trump on Wednesday, hoping to convince him to respect Kyiv's interests in his looming summit with Russia's Vladimir Putin.",
    "link": "https://www.ibtimes.com/zelensky-european-leaders-hope-sway-trump-before-putin-summit-3780802",
    "timestamp": "2025-08-13T09:42:09Z"
  },
  {
    "title": "Trump-Putin meet will be 'listening exercise,' US says, as Kyiv 'mobilizes' allies",
    "description": "President Donald Trump's summit with Russian President Vladimir Putin in Alaska will be \"a listening exercise,\" White House Press Secretary Karoline Leavitt said.",
    "link": "https://abcnews.go.com/International/trump-putin-meet-listening-exercise-white-house-kyiv/story?id=124602682",
    "timestamp": "2025-08-13T09:41:50Z"
  },
  {
    "title": "White House Launches Smithsonian Review To 'Ensure Alignment'",
    "description": "The review, which is set to begin in various museums across multiple phases, has sparked backlash online.",
    "link": "https://www.newsweek.com/white-house-smithsonian-institute-review-letter-alignment-trump-2112688",
    "timestamp": "2025-08-13T09:41:11Z"
  },
  {
    "title": "Cheryl Hines Is Asked About Marriage To RFK Jr. And His Alleged Sexting Scandal",
    "description": "The \"Curb Your Enthusiasm\" star, who also noted she has a \"nice friendship\" with Trump, welcomed The Wall Street Journal into her home for a sitdown.",
    "link": "https://www.huffpost.com/entry/cheryl-hines-rfk-jr-sexting-scandal-wall-street-journal_n_689c43e4e4b09184403f76cf",
    "timestamp": "2025-08-13T09:40:45Z"
  },
  {
    "title": "US Urges Ukraine to Adopt Realistic Combat Strategy Ahead of Putin-Trump Summit",
    "description": "MOSCOW (Sputnik) – US officials have urged Ukraine to be more realistic about its combat capabilities ahead of the upcoming talks between Russian President Vladimir Putin and US President Donald Trump in Alaska, media reported, citing a government source.",
    "link": "https://sputnikglobe.com/20250813/us-urges-ukraine-to-adopt-realistic-combat-strategy-ahead-of-putin-trump-summit-1122604452.html",
    "timestamp": "2025-08-13T09:38:42Z"
  },
  {
    "title": "Stephen King reveals his perfect ending to the ‘Trump horror story’",
    "description": "‘Carrie’ author discussed Trump’s America in a new interview",
    "link": "https://www.the-independent.com/arts-entertainment/books/news/stephen-king-trump-horror-b2806749.html",
    "timestamp": "2025-08-13T09:37:28Z"
  },
  {
    "title": "Samaria governor urges US sanctions against PA leaders",
    "description": "The head of the Samaria Regional Council called on President Trump and Secretary of State Marco Rubio to impose personal sanctions on a  PA official after he made comments supporting the October 7th massacre.",
    "link": "https://www.israelnationalnews.com/news/413204",
    "timestamp": "2025-08-13T09:37:11Z"
  },
  {
    "title": "Exclusive -- Huckabee: Hamas Blocks Food to Gazans, then Blames Israel",
    "description": "U.S. Ambassador to Israel Mike Huckabee told Breitbart News on Tuesday that Hamas, not Israel, is to blame for whatever food deprivation is being suffered by Palestinian people in Gaza, because it hoards food aid.\nThe post Exclusive — Huckabee: Hamas Blocks F…",
    "link": "https://www.breitbart.com/middle-east/2025/08/13/exclusive-huckabee-hamas-blocks-food-to-gazans-then-blames-israel/",
    "timestamp": "2025-08-13T09:36:57Z"
  },
  {
    "title": "Israel pounds Gaza City, 123 dead in last 24 hours",
    "description": "CAIRO/JERUSALEM (Reuters) -Israel's military pounded Gaza City on Wednesday prior to a planned takeover, with another 123 people killed in the last day...",
    "link": "https://uk.news.yahoo.com/israel-says-gazans-free-exit-093632755.html",
    "timestamp": "2025-08-13T09:36:32Z"
  },
  {
    "title": "Ukraine Deploys Azov Battalion Reserves to Krasnoarmeysk Ahead of US-Russia Summit",
    "description": "MOSCOW (Sputnik) - The Ukrainian armed forces are transferring reserves to the Krasnoarmeysk direction, including a unit of the ultranationalist Azov* battalion ahead of the Russia-US summit in Alaska, head of the Donetsk People's Republic (DPR) Denis Pushili…",
    "link": "https://sputnikglobe.com/20250813/ukraine-deploys-azov-battalion-reserves-to-krasnoarmeysk-ahead-of-us-russia-summit-1122604318.html",
    "timestamp": "2025-08-13T09:35:02Z"
  },
  {
    "title": "Zelenskyy, European leaders to hold Trump call ahead of Putin summit",
    "description": "German chancellor has arranged a series of meetings, beginning with European leaders and followed by a call with Trump.",
    "link": "https://www.aljazeera.com/news/2025/8/13/zelenskyy-european-leaders-to-hold-trump-call-ahead-of-putin-summit",
    "timestamp": "2025-08-13T09:32:26Z"
  },
  {
    "title": "Doomed Zelensky Desperate to Sabotage Putin-Trump Summit – Expert",
    "description": "“Expired” Zelensky and his team will stop at nothing to derail the upcoming summit between Russian President Vladimir Putin and US President Donald Trump, or at the very least, cast a shadow over the talks, Dr. Hoang Giang told Sputnik.",
    "link": "https://sputnikglobe.com/20250813/doomed-zelensky-desperate-to-sabotage-putin-trump-summit--expert-1122603781.html",
    "timestamp": "2025-08-13T09:30:31Z"
  },
  {
    "title": "US Appeals Court Grants DOGE Access to Confidential Federal Data – Reports",
    "description": "MOSCOW (Sputnik) - A US court of appeals in Virginia has cleared the Department of Government Efficiency (DOGE) to access confidential data held by two federal departments and one federal agency, The Washington Post reported on Wednesday, citing the court's r…",
    "link": "https://sputnikglobe.com/20250813/us-appeals-court-grants-doge-access-to-confidential-federal-data--reports-1122604171.html",
    "timestamp": "2025-08-13T09:30:23Z"
  },
  {
    "title": "Trump can’t turn US statistics into banana republic numbers",
    "description": "The quality of US statistics is well regarded around the world. The White House’s rejection of inconvenient data—like on the labour market—doesn’t change what it says of the economy. Why shoot the messenger?",
    "link": "https://www.livemint.com/opinion/online-views/jimmy-carter-recession-us-inflation-1970s-banana-republic-fed-jerome-powell-donald-trump-economic-policy-labor-statistic-11755003700388.html",
    "timestamp": "2025-08-13T09:30:13Z"
  },
  {
    "title": "Trump's glittering monstrosity could be his doom",
    "description": "The Washington Post recently published an article in which it noted that any chance President Donald Trump has to complete his $200 million \"golden ballroom\" at the White House in the near term would necessarily require wholly dodging years-long federal rules…",
    "link": "https://www.rawstory.com/raw-investigates/trump-ballroom/",
    "timestamp": "2025-08-13T09:30:02Z"
  },
  {
    "title": "Anne Lamott and the Power of Hope",
    "description": "Pamela Alma Weymouth\n\n\n\nA conversation with the author of Somehow: Thoughts on Love.\r\n\n\r\n\n\nThe post Anne Lamott and the Power of Hope appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/anne-lamott-hope-optimism-activism/",
    "timestamp": "2025-08-13T09:30:00Z"
  },
  {
    "title": "In Trump’s America, Vaccination Rates are Declining and Measles Is Spreading",
    "description": "Katrina vanden Heuvel\n\n\n\nTrump and RFK Jr. have made every effort to undermine one of the major civilizing advances of the 20th century—our public health infrastructure\r\n\n\r\n\n\nThe post In Trump’s America, Vaccination Rates are Declining and Measles Is Spreadin…",
    "link": "https://www.thenation.com/article/politics/trump-rfkjr-vaccine-policy-measles-outbreak/",
    "timestamp": "2025-08-13T09:30:00Z"
  },
  {
    "title": "How CEOs deal with Trump: Praise, face time, remorse, and gifts made of gold all go a long way, experience shows",
    "description": "Also: All the news and watercooler chat from Fortune.",
    "link": "https://fortune.com/2025/08/13/how-ceos-deal-with-trump-praise-face-time-remorse-and-gifts-made-of-gold-all-go-a-long-way-experience-shows/",
    "timestamp": "2025-08-13T09:28:25Z"
  },
  {
    "title": "Rupee-rouble rule: RBI clears path for faster India-Russia payments",
    "description": "Amid growing interest in rupee-rouble transactions, the Reserve Bank of India has simplified rupee trade settlements with Russia. This move allows authorized banks to open special rupee accounts, streamlining payments and reducing reliance on the dollar. Chal…",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/rupee-rouble-rule-rbi-clears-path-for-faster-india-russia-payments/articleshow/123277090.cms",
    "timestamp": "2025-08-13T09:25:14Z"
  },
  {
    "title": "Commodity Radar: Fundamentals point to bearish oil price outlook, technicals suggest otherwise. What should investors do?",
    "description": "Crude oil prices fell on MCX and global markets amid OPEC’s production hike, strong US output, and supply concerns. Analysts foresee short-term recovery potential, with key support near ₹5,580 and resistance at ₹5,700.",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/commodity-radar-fundamentals-point-to-bearish-oil-price-outlook-technicals-suggest-otherwise-what-should-investors-do/articleshow/123277184.cms",
    "timestamp": "2025-08-13T09:24:09Z"
  },
  {
    "title": "Orbán declares Russia the winner ahead of Trump-Putin meeting",
    "description": "While Orbán casts the outcome as settled, other European leaders want the US president to harden his stance towards Moscow ahead of the Alaska talks",
    "link": "https://www.euractiv.com/section/politics/news/orban-declares-russia-the-winner-ahead-of-trump-putin-meeting/",
    "timestamp": "2025-08-13T09:22:47Z"
  },
  {
    "title": "Human rights in Europe worsen due to internet regulations, US report claims",
    "description": "The report sent a \"chilling message\" that the United States will overlook abuses if doing so suits its political agenda, Amnesty International USA said",
    "link": "https://www.euractiv.com/section/politics/news/human-rights-in-europe-worsen-due-to-internet-regulations-us-report-claims/",
    "timestamp": "2025-08-13T09:22:24Z"
  },
  {
    "title": "Zelensky, European leaders to speak to Trump ahead of Putin summit",
    "description": "President Trump and Russian President Vladimir Putin are scheduled to meet Friday.",
    "link": "https://nypost.com/2025/08/13/world-news/zelensky-european-leaders-to-speak-to-trump-ahead-of-putin-summit/",
    "timestamp": "2025-08-13T09:22:05Z"
  },
  {
    "title": "Young men are struggling in a slowing job market, even if they have college degrees",
    "description": "Amid a wider slowdown, the unemployment rate for men ages 23 to 30 with a bachelor’s degree has jumped to 6% — compared to 3.5% for young women, NBC News found.",
    "link": "https://www.nbcnews.com/business/economy/young-men-struggling-slowing-job-market-college-degree-rcna224482",
    "timestamp": "2025-08-13T09:21:00Z"
  },
  {
    "title": "Zelensky says Ukraine, allies must resist Russian 'deception'",
    "description": "President Volodymyr Zelensky said Wednesday that Ukraine and its allies must work together to pressure Russia into ending its invasion, ahead of talks in Berlin with European leaders and US leader Donald Trump. Zelensky is due in Berlin on Wednesday for talks…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelensky-says-ukraine-allies-must-resist-russian-deception/articleshow/123277074.cms",
    "timestamp": "2025-08-13T09:17:59Z"
  },
  {
    "title": "Macquarie Strategists Forecast USA Crude Inventory Rise",
    "description": "Macquarie strategists, including Walt Chancellor, are forecasting that U.S. crude inventories will be up for the week ending August 8.",
    "link": "https://www.rigzone.com/news/macquarie_strategists_forecast_usa_crude_inventory_rise-13-aug-2025-181455-article/",
    "timestamp": "2025-08-13T09:13:35Z"
  },
  {
    "title": "The White House asks Washington’s major museums to “align” with Trump’s vision",
    "description": "The U.S. president has accused several museums of “historical revisionism,” claiming they have engaged in racial “ideological indoctrination” over the past decade\nThe post The White House asks Washington’s major museums to “align” with Trump’s vision appeared…",
    "link": "https://en.protothema.gr/2025/08/13/the-white-house-asks-washingtons-major-museums-to-align-with-trumps-vision/",
    "timestamp": "2025-08-13T09:12:46Z"
  },
  {
    "title": "New Oil Forecast Offers Trump Cautious Hope",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nOil demand will be slower than expected as supply grows over the coming year, the International Energy Agency (IEA) said in its latest market report Wednesday, offering U.S. President Donald Trump room for opt…",
    "link": "https://biztoc.com/x/0a1af77f57c12087",
    "timestamp": "2025-08-13T09:10:34Z"
  },
  {
    "title": "Is Donald Trump's New Census Constitutional? Experts Weigh in",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump is looking to change the way the U.S. Census Bureau collects data, wanting to exclude immigrants who are in the United States illegally.\nBut several experts told Newsweek that excluding …",
    "link": "https://biztoc.com/x/39f46b2b92ad4015",
    "timestamp": "2025-08-13T09:10:29Z"
  },
  {
    "title": "E.J. Antoni Appointment by Trump Sparks Alarm Among Economists",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nDonald Trump's nomination of E.J. Antoni to lead the Bureau of Labor Statistics (BLS), after firing the previous commissioner following a weak jobs report, has concerned a number of economists who believe the …",
    "link": "https://biztoc.com/x/d4b78080ccb96798",
    "timestamp": "2025-08-13T09:10:26Z"
  },
  {
    "title": "Trump Is Deploying the National Guard to D.C.—Power Grab or Public Safety? Newsweek Writers Debate",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump announced he would deploy the National Guard to Washington, D.C., and assume control of the city's police force.\nWas this announcement a sign of creeping authoritarianism? A legitimate m…",
    "link": "https://biztoc.com/x/9ae5b19bb9f6da38",
    "timestamp": "2025-08-13T09:10:20Z"
  },
  {
    "title": "National guard deployed on streets of Washington after Trump takes control of city’s police",
    "description": "DC mayor strikes conciliatory note but other Democratic leaders warn president against expanding law-and-order power grab",
    "link": "https://www.irishtimes.com/world/us/2025/08/13/national-guard-deployed-on-streets-of-washington-after-trump-takes-control-of-citys-police/",
    "timestamp": "2025-08-13T09:09:43Z"
  },
  {
    "title": "Canada isn’t losing the trade war — yet",
    "description": "Mark Carney won the April election in large part because Canadians trusted him more to deal with Donald Trump. Now, almost four months on, is their confidence being rewarded?",
    "link": "https://www.nationalobserver.com/2025/08/13/opinion/canada-trade-war-mark-carney",
    "timestamp": "2025-08-13T09:09:04Z"
  },
  {
    "title": "Local climate activism leads to ‘remarkable’ gains, report shows",
    "description": "Efforts to pass laws and advance clean energy projects can significantly reduce emissions, and at a low cost.",
    "link": "https://www.nationalobserver.com/2025/08/13/news/local-activism-climate-change-gains-report",
    "timestamp": "2025-08-13T09:09:03Z"
  },
  {
    "title": "New Oil Forecast Offers Trump Cautious Hope",
    "description": "The IEA released its latest oil market report.",
    "link": "https://www.newsweek.com/new-oil-forecast-offers-trump-cautious-hope-2112697",
    "timestamp": "2025-08-13T09:05:09Z"
  },
  {
    "title": "Samvardhana Motherson sees no material impact from US tariffs",
    "description": "Samvardhana Motherson International anticipates minimal impact from US tariffs. Exports from India to the US were low in Q1 FY26. Most contracts are ex-works, shifting costs to customers. The company is exploring alternative supply chains. A large portion of …",
    "link": "https://economictimes.indiatimes.com/industry/auto/auto-components/samvardhana-motherson-sees-no-material-impact-from-us-tariffs/articleshow/123276754.cms",
    "timestamp": "2025-08-13T09:04:25Z"
  },
  {
    "title": "Mexico transfers 26 cartel figures wanted by US authorities in deal with Trump administration",
    "description": "Mexico is sending 26 high-ranking cartel figures to the United States in the latest major deal with the Trump administration",
    "link": "https://abcnews.go.com/US/wireStory/mexico-transfers-26-cartel-figures-wanted-us-authorities-124591565",
    "timestamp": "2025-08-13T09:02:13Z"
  },
  {
    "title": "Ministry assures Apple's US move will not impact Indonesia",
    "description": "Deputy for Investment Promotion of the Ministry of Investment and Downstream Nurul Ichwan stated that US technology giant Apple&#39;s investment in its home ...",
    "link": "https://en.antaranews.com/news/373145/ministry-assures-apples-us-move-will-not-impact-indonesia",
    "timestamp": "2025-08-13T09:01:16Z"
  },
  {
    "title": "Trump-Putin Alaska summit: Ceasefire only, no territorial trade-off",
    "description": "High-stakes Alaska summit between Trump and Putin aims for Ukraine ceasefire with strict enforcement measures while rejecting any land-for-peace deals with Russia.",
    "link": "https://www.foxnews.com/opinion/trump-putin-alaska-summit-ceasefire-only-no-territorial-trade-off",
    "timestamp": "2025-08-13T09:00:53Z"
  },
  {
    "title": "The ‘big, beautiful bill’ gives parents a choice and kids a chance",
    "description": "New federal law provides dollar-for-dollar tax credits up to $1,700 annually for donations funding K-12 scholarships across all educational settings.",
    "link": "https://www.foxnews.com/opinion/big-beautiful-bill-gives-parents-choice-kids-chance",
    "timestamp": "2025-08-13T09:00:24Z"
  },
  {
    "title": "Zohran Mamdani Is Pivoting. So Is Andrew Cuomo.",
    "description": "The Democratic nominee, like his competitors, has realized he needs to change some positions in order to win.",
    "link": "http://nymag.com/intelligencer/article/nyc-mayor-zohran-mamdani-pivot-cuomo.html",
    "timestamp": "2025-08-13T09:00:02Z"
  },
  {
    "title": "E.J. Antoni Appointment by Trump Sparks Alarm Among Economists",
    "description": "Former BLS Commissioner Erica Groshen told Newsweek she is \"trying to avoid rushing to judgment\" on the new pick.",
    "link": "https://www.newsweek.com/trump-bls-appointment-ej-antoni-alarms-economists-2112440",
    "timestamp": "2025-08-13T09:00:02Z"
  },
  {
    "title": "Trump Is Deploying the National Guard to D.C.—Power Grab or Public Safety? Newsweek Writers Debate",
    "description": "President Donald Trump announced he would deploy the National Guard to Washington, D.C., and assume control of the city's police force.",
    "link": "https://www.newsweek.com/trump-deploying-national-guard-dcpower-grab-public-safety-newsweek-writers-debate-2112406",
    "timestamp": "2025-08-13T09:00:02Z"
  },
  {
    "title": "Ukrainians Have Changed Their Minds on Ending War",
    "description": "A Gallup poll shows a big drop among Ukrainians over the last three years in their desire to fight on.",
    "link": "https://www.newsweek.com/russia-ukraine-polling-gallup-2112252",
    "timestamp": "2025-08-13T09:00:02Z"
  },
  {
    "title": "Why We Must Release the Epstein Files",
    "description": "Rep. Ro Khanna\n\n\n\nWe need justice for the survivors of his predations, and we need to restore public trust in our institutions.\r\n\n\r\n\n\nThe post Why We Must Release the Epstein Files appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/epstein-files-trump-transparency-corruption/",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "We Left Gaza. But Our Pain Came With Us.",
    "description": "Mohammed R. Mhawish\n\n\n\nPalestinians who escaped the horrors of Gaza face a new trauma: the dislocation of exile from our homeland.\r\n\n\r\n\n\nThe post We Left Gaza. But Our Pain Came With Us. appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/gaza-exiles-egypt/",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "Washington’s Dangerous China Consensus",
    "description": "Jeet Heer\n\n\n\nFantasies of national unity drive the bipartisan push for a new cold war.\r\n\n\r\n\n\nThe post Washington’s Dangerous China Consensus appeared first on The Nation.",
    "link": "https://www.thenation.com/article/world/washingtons-dangerous-china-consensus/",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "Catherine Lacey’s Missed Connections",
    "description": "Alana Pockros\n\n\n\nIn her most personal work, The Möbius Book, Lacey uses a devastating moment of heartbreak to ruminate on the messy intersections between life and writing.\r\n\n\r\n\n\nThe post Catherine Lacey’s Missed Connections appeared first on The Nation.",
    "link": "https://www.thenation.com/article/culture/catherine-lacey-mobius-book/",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "Is Donald Trump's New Census Constitutional? Experts Weigh in",
    "description": "Trump has instructed the Commerce Department to change the way the Census Bureau collects data, seeking to exclude immigrants in the country illegally.",
    "link": "https://www.newsweek.com/trump-census-constitutional-2112102",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "Is Zohran Mamdani the Key to Democrats Winning Back Young Men?",
    "description": "Polls show overwhelming support for Mamdani among young men after Republicans made inroads with the demographic in 2024.",
    "link": "https://www.newsweek.com/mamdani-young-men-polls-2106900",
    "timestamp": "2025-08-13T09:00:01Z"
  },
  {
    "title": "Is Kari Lake a CEO? Her agency said so. The law suggests not",
    "description": "Kari Lake has sought to dismantle Voice of America and its federal parent, the U.S. Agency for Global Media. The agency has recently called her its acting CEO. But the law suggests she's not eligible for the job.",
    "link": "https://www.npr.org/2025/08/13/nx-s1-5500554/kari-lake-ceo-agency-usagm-voice-of-america",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "How redistricting became the burning hot center of Democratic politics",
    "description": "It was once an issue that made voters’ eyes glaze over.",
    "link": "https://www.nbcnews.com/politics/elections/redistricting-burning-hot-center-democratic-politics-rcna223833",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Medicaid Cuts Could Have Vast Ripple Effects in This Rural Colorado Community",
    "description": "In rural Colorado and across rural America, Medicaid is a lifeline, especially for people who wouldn’t otherwise have easy access to health care. That includes low-income seniors who need supplemental coverage in addition to Medicare, and people of all ages w…",
    "link": "https://kffhealthnews.org/news/article/medicaid-cuts-rural-colorado-trump-economic-ripple-effects/",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Advocates fear Trump's crackdown in D.C. will put many homeless people behind bars",
    "description": "The White House says people living on the street in Washington, D.C., can avoid jail by going to a shelter. Homeless advocates say there aren't enough shelter beds.",
    "link": "https://www.npr.org/2025/08/13/nx-s1-5500538/trump-crackdown-dc-homeless-advocates-jail",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Jill On Money: Should you buy risky assets in your 401(k)?",
    "description": "Potential changes could be coming to your workplace retirement plan.",
    "link": "https://rss.tribunecontentagency.com/websvc-bin/rss_story_read.cgi?resid=202508130500TMS_____RETIRESM_58732_ctnrs_20250813",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Heritage comes at a steep price for this Oklahoma denim-maker",
    "description": "In the quiet town of Shawnee, Oklahoma, the rapid whir of sewing machines fills one of the last surviving American garment factories.",
    "link": "https://www.nbcnews.com/business/consumer/made-in-usa-blue-jeans-expensive-rcna224495",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "How Texas Became a Right-Wing California",
    "description": "With the ascent of MAGA, Texas has embraced the nanny-state tactics it once eschewed in California.\nThe post How Texas Became a Right-Wing California appeared first on Washington Monthly.",
    "link": "http://washingtonmonthly.com/2025/08/13/how-texas-became-a-right-wing-california/",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Facts About Crime Don’t Care About Trump’s Feelings",
    "description": "The \"facts don't care about your feelings\" crowd suddenly prefers vibes over D.C. crime statistics that demolish Trump's justification for federal police control.\nThe post Facts About Crime Don’t Care About Trump’s Feelings appeared first on Washington Monthl…",
    "link": "http://washingtonmonthly.com/2025/08/13/facts-about-crime-dont-care-about-trumps-feelings/",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "As Democrats slam Trump's D.C. crackdown, Mayor Bowser walks a fine line",
    "description": "In the end, President Donald Trump's offer was one that Washington, D.C., Mayor Muriel Bowser could not refuse",
    "link": "https://www.nbcnews.com/politics/donald-trump/democrats-slam-trumps-dc-crackdown-mayor-bowser-walks-fine-line-rcna224401",
    "timestamp": "2025-08-13T09:00:00Z"
  },
  {
    "title": "Iran Issues New Threat to US",
    "description": "During a meeting in Tehran with a visiting South African general, Iran's military leadership warned it would respond forcefully if provoked.",
    "link": "https://www.newsweek.com/iran-issues-new-threat-us-2112673",
    "timestamp": "2025-08-13T08:59:55Z"
  },
  {
    "title": "Inventing the American Revolution: On Thomas Paine’s Guide to Fighting Dictatorship",
    "description": "Back in 2018, two years into the first Trump presidency, when the ground was shifting beneath our feet in ways that, today, might barely register on our wearied internal seismographs, political analyst David Smith volunteered an explanation for the rise of MA…",
    "link": "https://lithub.com/inventing-the-american-revolution-on-thomas-paines-guide-to-fighting-dictatorship/",
    "timestamp": "2025-08-13T08:59:47Z"
  },
  {
    "title": "Israel, hit hard by Iran, to resume war against the Islamic nation soon as tensions simmer; Trump’s role crucial",
    "description": "Analysts predict another Israel-Iran conflict soon. Iran prepares a strong response. A US involvement could escalate the situation. Israel aims to weaken Iran and draw the US into combat. Previous Israeli operations had limited success. Iran replaced leaders …",
    "link": "https://economictimes.indiatimes.com/news/international/us/israel-hit-hard-by-iran-to-resume-war-against-the-islamic-nation-soon-as-tensions-simmer-trumps-role-crucial/articleshow/123276674.cms",
    "timestamp": "2025-08-13T08:58:05Z"
  },
  {
    "title": "Zelenskyy in Berlin for critical talks with European leaders and Trump",
    "description": "President Trump will join European leaders and Ukrainian President Volodymyr Zelenskyy for an emergency virtual summit on Wednesday, ahead of the U.S. president's meeting with Putin on Friday.",
    "link": "https://www.npr.org/2025/08/13/nx-s1-5500465/european-leaders-to-hold-emergency-virtual-summit-with-trump-on-wednesday",
    "timestamp": "2025-08-13T08:57:53Z"
  },
  {
    "title": "South Korean president will meet Japanese leader ahead of summit with Trump",
    "description": "South Korean President Lee Jae Myung will meet Japanese Prime Minister Shigeru Ishiba in Tokyo next week before flying to Washington for a summit with U.S. President Donald Trump",
    "link": "https://abcnews.go.com/International/wireStory/south-korean-president-meet-japanese-leader-ahead-summit-124601711",
    "timestamp": "2025-08-13T08:52:05Z"
  },
  {
    "title": "Zelenskyy To Speak To Trump Ahead Of Putin Summit",
    "description": "The unpredictability of how the Alaska meeting will play out has fueled fears that the U.S. and Russia could coerce Ukraine into an unfavorable deal.",
    "link": "https://www.huffpost.com/entry/zelenskyy-trump-talks-ahead-of-putin-summit_n_689c4f36e4b0196f49c59989",
    "timestamp": "2025-08-13T08:50:20Z"
  },
  {
    "title": "Australia to recognize Palestinian state",
    "description": "Washington DC (UPI) Aug 11, 2025 \n\n\n Australia will recognize the state of Palestine, Prime Minister Anthony Albanese announced Monday, making Canberra the latest Western government to take the mostly symbolic and political move that is expected to anger not …",
    "link": "https://www.spacewar.com/reports/Australia_to_recognize_Palestinian_state_999.html",
    "timestamp": "2025-08-13T08:49:57Z"
  },
  {
    "title": "Zelensky says Ukraine, allies must resist Russian 'deception'",
    "description": "Kyiv, Ukraine (AFP) Aug 13, 2025\n\n />\nPresident Volodymyr Zelensky said Wednesday that Ukraine and its allies must work together to pressure Russia into ending its invasion, ahead of talks in Berlin with European leaders and US leader Donald Trump. \n\n\"Pressur…",
    "link": "https://www.spacewar.com/reports/Zelensky_says_Ukraine_allies_must_resist_Russian_deception_999.html",
    "timestamp": "2025-08-13T08:49:57Z"
  }
]