[
  {
    "title": "Trump Calls On Waffling Congress To Crush Biden’s Green ‘SCAM’",
    "description": "President Donald Trump is demanding the Senate terminate green energy tax credits enacted under President Joe Biden.",
    "link": "https://dailycaller.com/2025/06/21/trump-congress-green-energy-subsidies-big-beautiful-bill/",
    "timestamp": "2025-06-21T22:56:30Z"
  },
  {
    "title": "Trump’s envoy urges Musk to provide free Starlink to ‘friends’ in Iran",
    "description": "US Presidential Envoy for Special Assignments Richard Grenell has urged SpaceX CEO Elon Musk to provide free Starlink access across Iran Read Full Article at RT.com",
    "link": "https://www.rt.com/news/620159-iran-free-starlink-grenell/",
    "timestamp": "2025-06-21T22:56:12Z"
  },
  {
    "title": "Elon Musk Has a New Plan to Win Back MAGA",
    "description": "After apologizing to Trump, the Tesla CEO returns to his favorite battleground: attacking liberals and “wokeism,\" as he tries to repair his image among conservative hardliners.",
    "link": "https://gizmodo.com/elon-musk-has-a-new-plan-to-win-back-maga-2000618685",
    "timestamp": "2025-06-21T22:54:49Z"
  },
  {
    "title": "Donald Trump Calls Green Tax Credits in 'Big Beautiful Bill' 'Scam'",
    "description": "The President said he hates the initiatives in a social media post.",
    "link": "https://www.newsweek.com/donald-trump-calls-green-tax-credits-big-beautiful-bill-scam-2088859",
    "timestamp": "2025-06-21T22:53:37Z"
  },
  {
    "title": "Pakistan to nominate Trump for Peace Nobel over 'intervention' with India",
    "description": "Pakistan's government, led by Shehbaz Sharif, intends to formally nominate former US President Donald Trump for the 2026 Nobel Peace Prize. This decision stems from Trump's perceived diplomatic intervention during a recent military crisis with India, where hi…",
    "link": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-to-nominate-trump-for-peace-nobel-over-intervention-with-india/articleshow/121998570.cms",
    "timestamp": "2025-06-21T22:52:53Z"
  },
  {
    "title": "Israel tells U.S. it could attack Iran key nuke sites before Trump deadline",
    "description": "Israel communicated their concerns to Trump administration officials on Thursday in what sources described as a tense phone call.",
    "link": "https://www.japantimes.co.jp/news/2025/06/22/world/politics/israel-attack-iran-before-deadline/",
    "timestamp": "2025-06-21T22:52:00Z"
  },
  {
    "title": "Mark Cuban Turned Down the Offer When Asked to Submit to be Kamala Harris’ Vice President in 2024 Presidential Election: ‘I’m Not Very Good as the Number Two Person’",
    "description": "During a recent appearance on “The Bulwark” podcast, Mark Cuban revealed he was invited to submit himself for consideration to become former Vice President Kamala Harris’ running mate in the 2024 presidential election. However, the “Shark Tank” star, an outwa…",
    "link": "https://variety.com/2025/tv/news/mark-cuban-kamala-harris-vice-president-donald-trump-1236437408/",
    "timestamp": "2025-06-21T22:51:54Z"
  },
  {
    "title": "Bill Maher says Dems need to ‘do something’ about ‘The View’ after Whoopi Goldberg’s Iran comments",
    "description": "Whoopi Goldberg compared Black Americans' lives to life under Iran's brutal theocratic regime on Wednesday.",
    "link": "https://nypost.com/2025/06/21/media/bill-maher-says-dems-need-to-do-something-about-the-view-after-whoopi-goldbergs-iran-comments/",
    "timestamp": "2025-06-21T22:50:02Z"
  },
  {
    "title": "Donald Trump's Troubling Hand Appearance Raises Health Questions at G7 Summit - NewsBreak",
    "description": "Donald Trump’s discolored and swollen hand at the G7 Summit reignited public speculation about his health.",
    "link": "https://www.newsbreak.com/share/4062708668827-donald-trump-s-troubling-hand-appearance-raises-health-questions-at-g7-summit?s=a2&amp;share_destination_id=MzMzMjc1NTUxLTE3NTA1NDU2OTM1MjU%3D&amp;pd=0MYOC7gN&amp;hl=en_US&amp;send_time=1750545693&amp;actBtn=topBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.25.0%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_model_exp_25q2_v2-v1%2Cns_foryou_blend_exp_25q2-control%2Cns_foryou_rank_exp_25q2-control%2Cns_foryou_recall_exp_25q3-v6",
    "timestamp": "2025-06-21T22:42:01Z"
  },
  {
    "title": "Podcast Bro Theo Von Questions How 'America First' Trump Really Is Amid Potential Iran War",
    "description": "The podcaster who helped lift Trump's voice to younger male voters during the 2024 presidential election told Rep. Ro Khanna (D-Calif.), “It feels like we are just working for Israel.”",
    "link": "https://www.huffpost.com/entry/theo-von-iran-war-ro-khanna_n_6856facfe4b095f25277587a",
    "timestamp": "2025-06-21T22:41:25Z"
  },
  {
    "title": "Trump On Juneteenth: There Are Too Many Holidays!",
    "description": "Too many non-working holidays are costing the United States “BILLIONS OF DOLLARS” and hindering the country from success, President Donald Trump exclaimed on Thursday. Trump posted to his Truth Social account against non-working holidays, suggesting that neit…",
    "link": "https://freerepublic.com/focus/f-news/4324518/posts",
    "timestamp": "2025-06-21T22:24:00Z"
  },
  {
    "title": "Judge asks if troops in Los Angeles are violating the Posse Comitatus Act",
    "description": "California’s challenge of the Trump administration’s military deployment in Los Angeles returned to a federal courtroom in San Francisco on Friday for a brief hearing after an appeals court handed President Donald Trump a key procedural win.\nU.S. District Jud…",
    "link": "https://biztoc.com/x/2ec1331d00bc9b0c",
    "timestamp": "2025-06-21T22:16:04Z"
  },
  {
    "title": "Judge asks if troops in Los Angeles are violating the Posse Comitatus Act",
    "description": "U.S. District Judge Charles Breyer asked for briefings from both sides by noon Monday on whether the Posse Comitatus Act is being violated in Los Angeles.",
    "link": "https://fortune.com/2025/06/21/troops-los-angeles-national-guard-marines-posse-comitatus-act-ice-raids/",
    "timestamp": "2025-06-21T22:07:36Z"
  },
  {
    "title": "Mahmoud Khalil Says He’ll ‘Continue to Protest’ Following ICE Detention Release",
    "description": "Mahmoud Khalil and AOC spoke about Palestinian rights on Saturday after the Trump administration was ordered to release him from an ICE facility.",
    "link": "http://www.rollingstone.com/politics/politics-news/mahmoud-khalil-aoc-ice-release-trump-1235369571/",
    "timestamp": "2025-06-21T22:04:15Z"
  },
  {
    "title": "Exclusive – Rep. Ashley Hinson: Trump's Big, Beautiful Bill 'Going to Save America'",
    "description": "Rep. Ashley Hinson (R-IA) praised President Donald Trump’s big, beautiful bill and predicted Congress will send it to his desk soon in an appearance on Breitbart News Saturday on SiriusXM.\nThe post Exclusive – Rep. Ashley Hinson: Trump’s Big, Beautiful Bill ‘…",
    "link": "https://www.breitbart.com/politics/2025/06/21/exclusive-rep-ashley-hinson-trumps-big-beautiful-bill-going-to-save-america/",
    "timestamp": "2025-06-21T22:00:43Z"
  },
  {
    "title": "Shooter Claimed in Confession Letter He Killed to Help Walz, Per Reports",
    "description": "Boelter wrote that he had been trained \"off the books\" by the military.\nThe post Shooter Claimed in Confession Letter He Killed to Help Walz, Per Reports first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/06/report-alleged-mn-shooter-blames-killings-on-tim-walz-in-confession-letter-to-fbi/",
    "timestamp": "2025-06-21T22:00:03Z"
  },
  {
    "title": "Trump disavows spy chief Gabbard's take on Iran's nuclear program",
    "description": "June 20 (Reuters) - U.S. President Donald Trump said on Friday that Director of National Intelligence Tulsi Gabbard was wrong in suggesting there was no evidence Iran is building a nuclear weapon. Trump contested intelligence assessments relayed earlier this …",
    "link": "https://freerepublic.com/focus/f-news/4324516/posts",
    "timestamp": "2025-06-21T21:57:22Z"
  },
  {
    "title": "Yes, the 2020 election was stolen – and we have the proof",
    "description": "'China and the Democrat Party were in this evil, wicked conspiracy together. Thick as thieves'",
    "link": "https://www.wnd.com/2025/06/yes-2020-election-was-stolen-we-have-proof/",
    "timestamp": "2025-06-21T21:51:53Z"
  },
  {
    "title": "Mahmoud Khalil vows to resume pro-Palestinian activism after release",
    "description": "Palestinian rights activist Mahmoud Khalil says he will continue to protest against what he calls US government-funded genocide in Gaza.",
    "link": "https://www.abc.net.au/news/2025-06-22/mahmoud-khalil-vows-to-resume-pro-palestinian-activism/105446350",
    "timestamp": "2025-06-21T21:51:40Z"
  },
  {
    "title": "Pat Buchanan: A hero who deserves Trump’s Medal of Freedom",
    "description": "Octogenarian former commentator is one of the truest patriots of the past half century",
    "link": "https://www.wnd.com/2025/06/pat-buchanan-hero-who-deserves-trumps-medal-freedom/",
    "timestamp": "2025-06-21T21:48:42Z"
  },
  {
    "title": "Juventus vs. Wydad AC live stream, how to watch Club World Cup, prediction: Odds, pick, where to watch",
    "description": "The Bianconeri will play their second match of the tournament after winning 5-0 in the opening game",
    "link": "https://www.cbssports.com/soccer/news/juventus-vs-wydad-ac-live-stream-how-to-watch-club-world-cup-prediction-odds-pick-where-to-watch/",
    "timestamp": "2025-06-21T21:48:34Z"
  },
  {
    "title": "State Dept Starts Exit Flights From Israel as Trump Mulls War Entry",
    "description": "The U.S. State Department has commenced assisted flights for Americans to leave Israel amid the escalating conflict with Iran.",
    "link": "https://www.newsweek.com/state-dept-starts-exit-flights-israel-trump-mulls-war-entry-2088832",
    "timestamp": "2025-06-21T21:46:31Z"
  },
  {
    "title": "Belarus frees key opposition figure Sergey Tikhanovsky following rare visit from top US envoy",
    "description": "Belarus has freed Sergey Tikhanovsky, a key dissident figure and the husband of exiled opposition leader Svetlana Tikhanovskaya, following a rare visit by a senior US official, Tikhanovskaya’s team announced on Saturday. Tikhanovsky, a popular blogger and act…",
    "link": "https://freerepublic.com/focus/f-news/4324514/posts",
    "timestamp": "2025-06-21T21:46:19Z"
  },
  {
    "title": "Trump Lists Reasons He Deserves Nobel Prize in Epic Meltdown - The Daily Beast",
    "description": "Trump Lists Reasons He Deserves Nobel Prize in Epic MeltdownThe Daily Beast Pakistan to nominate Trump for Nobel Peace PrizeBBC Pakistan to nominate Donald Trump for Nobel peace prizeThe Guardian \"Won't Get Nobel Prize For Stopping India-Pak War\": Trump Claim…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178132583",
    "timestamp": "2025-06-21T21:32:26Z"
  },
  {
    "title": "Trump Says US Intel Assessment Of Iran's Nuclear Program \"Was Wrong\", Tulsi Responds",
    "description": "Trump Says US Intel Assessment Of Iran's Nuclear Program \"Was Wrong\", Tulsi Responds\n \nAuthored by Jacob Burg via The Epoch Times,\nPresident Donald Trump said on June 20 that his director of national intelligence’s assessment in March that Iran had yet to dec…",
    "link": "https://biztoc.com/x/80b45e4f7f002edd",
    "timestamp": "2025-06-21T21:32:04Z"
  },
  {
    "title": "Israel says it's preparing for the possibility of a lengthy war against Iran",
    "description": "Iranian-backed Houthi rebels in Yemen threatened to resume attacks on U.S. ships in the Red Sea if the U.S. joins Israel's campaign against Iran.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_385321c3-1680-503b-8601-3127fb67e700.html",
    "timestamp": "2025-06-21T21:30:00Z"
  },
  {
    "title": "Exclusive -- Kristina Wong: 'Undeniable There's Been a Huge Surge in Military Enlistment' Under Trump Admin",
    "description": "Former Breitbart News Pentagon correspondent and Director of Communications and Chief spokesperson for the Department of the U.S. Navy Kristina Wong pointed out that it is \"undeniable that there's been a huge surge in military enlistment\" under the Trump admi…",
    "link": "https://www.breitbart.com/politics/2025/06/21/exclusive-kristina-wong-undeniable-theres-been-a-huge-surge-in-military-enlistment-under-trump-admin/",
    "timestamp": "2025-06-21T21:29:12Z"
  },
  {
    "title": "Bad ‘vibes’ may be having a bigger impact on the economy now",
    "description": "While consumer sentiment recovered a bit after Trump postponed his highest tariff rates, it's still 20% below December 2024 levels.",
    "link": "https://fortune.com/2025/06/21/economic-vibes-consumer-sentiment-spending-soft-data-vs-hard-data-trump-tariffs-vibecession/",
    "timestamp": "2025-06-21T21:27:45Z"
  },
  {
    "title": "Exclusive: Israel Seeks Swift Action On Iran, Sources Say, With A Split U.S. Administration",
    "description": "Israeli officials have told the Trump administration they do not want to wait two weeks for Iran to reach a deal to dismantle key parts of its nuclear program, sources say.",
    "link": "https://www.huffpost.com/entry/israel-iran-fordow-nuclear-program_n_68572237e4b095f252775da5",
    "timestamp": "2025-06-21T21:27:12Z"
  },
  {
    "title": "Donald Trump, Marco Rubio Secure Congo-Rwanda Peace Treaty: 'Great Day for the World'",
    "description": "President Donald Trump revealed that a peace treaty between the Democratic Republic of the Congo and the Republic of Rwanda has been secured.\nThe post Donald Trump, Marco Rubio Secure Congo-Rwanda Peace Treaty: ‘Great Day for the World’ appeared first on Brei…",
    "link": "https://www.breitbart.com/politics/2025/06/21/donald-trump-marco-rubio-secure-congo-rwanda-peace-treaty-great-day-world/",
    "timestamp": "2025-06-21T21:23:49Z"
  },
  {
    "title": "Russia ready to strike back with nukes if Ukraine uses dirty bomb, threatens former President",
    "description": "Dmitry Medvedev threatens nuclear retaliation if Ukraine uses a dirty bomb. He says Russia is ready with tactical nuclear weapons. Medvedev also mocks the West's attention on the Israel-Iran war. He suggests the US is distracted from supporting Ukraine. Medve…",
    "link": "https://economictimes.indiatimes.com/news/international/us/russia-ready-to-strike-back-with-nukes-if-ukraine-uses-dirty-bomb-threatens-former-president/articleshow/121998431.cms",
    "timestamp": "2025-06-21T21:22:17Z"
  },
  {
    "title": "U.S. Steel deal: Nikki Budzinski, steelworkers demand investment in Granite City",
    "description": "“Our message moving forward is real simple,” a union official said. “Invest in this mill. Invest in Granite City, Illinois.”",
    "link": "https://www.stltoday.com/news/local/government-politics/article_c2feff05-a677-4d6f-b797-b38886e979d6.html",
    "timestamp": "2025-06-21T21:20:00Z"
  },
  {
    "title": "Trump Slams Windmills In Rant On Green Tax Credits—His Latest Attack Against Turbines",
    "description": "Alongside solar power, wind energy has become one of the most cost-efficient forms of energy production.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/06/21/trump-slams-windmills-in-rant-on-green-tax-credits-his-latest-attack-against-turbines/",
    "timestamp": "2025-06-21T21:17:20Z"
  },
  {
    "title": "Republican Party has nearly five times more cash on hand than the Democrats",
    "description": "The filings come as Democrats face internal tension since President Donald Trump's return to the White House.",
    "link": "https://www.cnbc.com/2025/06/21/rnc-dnc-ken-martin-trump.html",
    "timestamp": "2025-06-21T21:12:14Z"
  },
  {
    "title": "No, Yellowstone is not up for sale in Senate proposal",
    "description": "'If all I knew about this bill were the falsehoods being circulated by the left, I would hate it too'",
    "link": "https://www.wnd.com/2025/06/no-yellowstone-is-not-up-sale-senate-proposal/",
    "timestamp": "2025-06-21T21:03:59Z"
  },
  {
    "title": "Hank Johnson Doesn’t Even Bother Tuning His Guitar Before Belting Out Cringe Anti-Trump Anthem",
    "description": "Democratic Georgia Rep. Hank Johnson seemed to not bother tuning his new guitar before playing a cringe anti-President Donald Trump anthem.",
    "link": "https://dailycaller.com/2025/06/21/democrat-congressman-guitar-anti-trimp-anthem-hank-johnson/",
    "timestamp": "2025-06-21T21:03:59Z"
  },
  {
    "title": "Elon Musk’s DOGE Wouldn’t Have Worked Even If It Had Worked",
    "description": "No act of parsimony shrinks the size of government, it just shifts the waste.",
    "link": "https://www.forbes.com/sites/johntamny/2025/06/21/elon-musks-doge-wouldnt-have-worked-even-if-it-had-worked/",
    "timestamp": "2025-06-21T21:00:00Z"
  },
  {
    "title": "B-2 or not B-2?",
    "description": "No, it’s a flight of B-2s: At least two separate groups of B-2 Spirit stealth bombers are currently heading westward across the Pacific Ocean, but their exact final destination is currently unclear. The bomber movements come as U.S. officials have been delibe…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/b-2-or-not-b-2",
    "timestamp": "2025-06-21T20:58:38Z"
  },
  {
    "title": "Rosenberg: Russian government clearly nervous as country faces economic challenges",
    "description": "Russian minister Maxim Reshetnikov has warned that the country's economy was teetering \"on the brink of recession\".",
    "link": "https://www.bbc.com/news/articles/cdr30jx6x0vo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-21T20:52:49Z"
  },
  {
    "title": "Louisiana Classroom Ten Commandments Requirement Blocked by Court",
    "description": "A federal appeals court ruled that Louisiana's Ten Commandments classroom mandate unconstitutional, sparking appeal plans.",
    "link": "https://www.newsweek.com/louisiana-classroom-ten-commandments-requirement-blocked-court-2088829",
    "timestamp": "2025-06-21T20:50:15Z"
  },
  {
    "title": "Exclusive: Alex Swoyer Discusses Her Book 'Lawless Lawfare' That Dissects Weaponization Against Trump",
    "description": "Washington Times Legal Affairs reporter Alex Swoyer joined Sirius XM's Breitbart News Saturday to discuss her new book, Lawless Lawfare: Tipping the Scales of Justice to Get Trump and Destroy MAGA which explores the various civil and criminal cases brought ag…",
    "link": "https://www.breitbart.com/politics/2025/06/21/exclusive-alex-swoyer-discusses-book-lawless-lawfare-that-dissects-weaponization-against-trump/",
    "timestamp": "2025-06-21T20:46:36Z"
  },
  {
    "title": "‘Giant SCAM!’ Trump Rages at ‘JUNK’ in His Own Big Beautiful Bill: ‘Break Away From This Craziness!!!’",
    "description": "Trump raged against his \"Big Beautiful Bill\" on Saturday, calling some of what's in it a \"giant SCAM\" and \"JUNK\" that's costly and harmful.\nThe post ‘Giant SCAM!’ Trump Rages at ‘JUNK’ in His Own Big Beautiful Bill: ‘Break Away From This Craziness!!!’ first a…",
    "link": "https://www.mediaite.com/media/news/giant-scam-trump-rages-at-junk-in-his-own-big-beautiful-bill-break-away-from-this-craziness/",
    "timestamp": "2025-06-21T20:45:50Z"
  },
  {
    "title": "Rosenberg: Russian government clearly nervous as country faces economic challenges",
    "description": "Russian minister Maxim Reshetnikov has warned that the country's economy was teetering \"on the brink of recession\".",
    "link": "https://www.bbc.com/news/articles/cdr30jx6x0vo",
    "timestamp": "2025-06-21T20:45:21Z"
  },
  {
    "title": "Tánaiste confirms US threat to Lebanon peacekeepers and will liaise with EU states to save mission",
    "description": "As revealed on Thursday by The Journal there are just ten weeks ahead of a crucial vote in the United Nations Security Council as the US is considering withdrawing support for UNIFIL.",
    "link": "https://www.thejournal.ie/lebanon-tanaiste-simon-harris-us-vote-against-unifil-renewal-irish-defence-forces-6739998-Jun2025/",
    "timestamp": "2025-06-21T20:38:33Z"
  },
  {
    "title": "Pakistan plans to nominate Trump for Nobel Peace Prize - BBC",
    "description": "Pakistan plans to nominate Trump for Nobel Peace PrizeBBC Trump to Win a Nobel Peace Prize? Pakistan States NominationTime Magazine Pakistan to nominate Donald Trump for Nobel peace prizeThe Guardian \"Won't Get Nobel Prize For Stopping India-Pak War\": Trump C…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178132119",
    "timestamp": "2025-06-21T20:35:04Z"
  },
  {
    "title": "Ignoring Europe and winning wars",
    "description": "Any European demand for de-escalation is really a call for Iran’s Islamic fascism to survive to kill Jews another day. Perhaps no one knows better than Benjamin Netanyahu how meaningless are the words and few deeds of the dying Europeans.  Opinion.",
    "link": "https://www.israelnationalnews.com/news/410413",
    "timestamp": "2025-06-21T20:34:14Z"
  },
  {
    "title": "Exclusive: Israel seeks swift action on Iran, sources say, with a split U.S. administration",
    "description": "Israeli officials have told the Trump administration they do not want to wait two weeks for Iran to reach a deal to dismantle key parts of its nuclear program and Israel could act alone before the deadline is up, two sources said, amid a continuing debate on …",
    "link": "https://freerepublic.com/focus/f-news/4324509/posts",
    "timestamp": "2025-06-21T20:33:42Z"
  },
  {
    "title": "Damage seen at Iranian nuclear site after US strikes",
    "description": "Satellite images are showing damage to the entryways to Iran's underground nuclear site at Fordo after US airstrikes targeted the facility.",
    "link": "https://www.perthnow.com.au/news/conflict/israel-says-it-has-hit-southwestern-iran-military-sites-c-19113815",
    "timestamp": "2025-06-21T20:32:46Z"
  },
  {
    "title": "New Photos Show Gravel Laid Over White House Rose Garden As Trump Reno Takes Root",
    "description": "President Donald Trump has vowed to pave over the grass, which he griped gets too wet.",
    "link": "https://www.huffpost.com/entry/new-photos-gravel-white-house-rose-garden_n_6856e6a9e4b095f252775799",
    "timestamp": "2025-06-21T20:28:42Z"
  },
  {
    "title": "Iran’s Supreme Leader Reportedly Names Potential Successors In The Event He’s Killed",
    "description": "Iran's supreme leader named three senior Islamic clerics as his potential successors in case he is killed in ongoing hostilities with Israel",
    "link": "https://dailycaller.com/2025/06/21/iran-supreme-leader-ali-khamenei-successors-israel/",
    "timestamp": "2025-06-21T20:28:12Z"
  },
  {
    "title": "GOP's food stamp plan is found to violate Senate rules. It's the latest setback for Trump's big bill",
    "description": "The Senate parliamentarian has advised that a Republican proposal that would shift some food stamp costs from the federal government to the states would violate the chamber’s strict rules",
    "link": "https://abcnews.go.com/US/wireStory/gops-food-stamp-plan-found-violate-senate-rules-123075708",
    "timestamp": "2025-06-21T20:22:28Z"
  },
  {
    "title": "European leaders worry they’re too reliant on U.S. tech | TechCrunch",
    "description": "European governments may be reconsidering their use of American technology and services, according to a new report in The New York Times.",
    "link": "https://techcrunch.com/2025/06/21/european-leaders-worry-theyre-too-reliant-on-u-s-tech/",
    "timestamp": "2025-06-21T20:18:31Z"
  },
  {
    "title": "'They're not telling you': Ex-Trump insider 'exposes' president's goals for Iran",
    "description": "Donald Trump and the media are feeding you false information about the president's goals surrounding Iran, according to a former Trump associate.Author and former Trump insider Lev Parnas, who has reported on Trump's purported \"humiliation\" by Russia's Putin,…",
    "link": "https://www.rawstory.com/trump-not-telling-you-iran/",
    "timestamp": "2025-06-21T20:15:11Z"
  },
  {
    "title": "Ana Navarro calls on Barack Obama to step out of Netflix mode and help save democracy from Trump",
    "description": "Ana Navarro urges Barack Obama to actively defend democracy against Donald Trump, believing his silence is detrimental. She emphasizes that Obama, along with other former presidents, should speak out against Trump's threats to American democratic values. Desp…",
    "link": "https://economictimes.indiatimes.com/news/international/us/ana-navarro-calls-on-barack-obama-to-step-out-of-netflix-mode-and-help-save-democracy-from-trump/articleshow/121998204.cms",
    "timestamp": "2025-06-21T20:13:10Z"
  },
  {
    "title": "Pakistan to nominate ‘genuine peacemaker’ Trump for Nobel Peace Prize - Al Jazeera",
    "description": "Pakistan to nominate ‘genuine peacemaker’ Trump for Nobel Peace PrizeAl Jazeera Pakistan to nominate Trump for Nobel Peace PrizeBBC Trump to Win a Nobel Peace Prize? Pakistan States NominationTime Magazine Pakistan to nominate Donald Trump for Nobel peace pri…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178131969",
    "timestamp": "2025-06-21T20:13:08Z"
  },
  {
    "title": "Belarus Frees Jailed Opposition Leader After Appeal From US",
    "description": "Belarus freed top opposition figure Sergei Tikhanovsky and more than a dozen other political prisoners Saturday following an appeal from the White House, Minsk said, a sign of warming ties between Washington and Belarus-ally Moscow.",
    "link": "https://www.ibtimes.com.au/belarus-frees-jailed-opposition-leader-after-appeal-us-1859326",
    "timestamp": "2025-06-21T20:12:21Z"
  },
  {
    "title": "Who is Sophie Cunningham? Caitlin Clark's new 'bodyguard' teammate emerging as a WNBA icon",
    "description": "Farm-raised, black belt Sophie Cunningham's popularity soared after defending teammate Caitlin Clark, gaining over 800,000 followers and potentially $1 million.",
    "link": "https://www.foxnews.com/sports/who-sophie-cunningham-caitlin-clarks-new-bodyguard-teammate-emerging-wnba-icon",
    "timestamp": "2025-06-21T20:11:00Z"
  },
  {
    "title": "Rep. Wesley Hunt defends Trump's move to restore Robert E. Lee's name to military base",
    "description": "Rep. Wesley Hunt argued against removing confederate names from military bases during an appearance on\"Real Time\" Friday, claiming if we don't remember our history, \"we are doomed to repeat it.\"",
    "link": "https://www.foxnews.com/media/wesley-hunt-defends-trumps-move-restore-robert-e-lees-name-military-base",
    "timestamp": "2025-06-21T20:10:33Z"
  },
  {
    "title": "B-2s moving to Guam amid two-week pause on potential Iran intervention",
    "description": "The U.S. military has moved several B-2 Spirit stealth bombers and refueling aircraft to Guam, which may be a precursor to aerial strikes against Iran's most...",
    "link": "https://www.upi.com/Top_News/US/2025/06/21/b2s-deployment-guam-iran/2611750533423/",
    "timestamp": "2025-06-21T20:10:13Z"
  },
  {
    "title": "Live: US moves B-2 bombers across Pacific as Israeli jets launch fresh attack on Iran",
    "description": "The shift of six US B-2 bombers to an air base in Guam comes as US President Donald Trump is scheduled to meet with his national security team to discuss the possibility of a strike on Iran. Follow live.",
    "link": "https://www.abc.net.au/news/2025-06-22/iran-israel-conflict-live-updates/105445676",
    "timestamp": "2025-06-21T20:10:07Z"
  },
  {
    "title": "'Public Good': Wyoming Plots August Debut for WYST Stablecoin",
    "description": "The Wyoming Stable Token Commission is targeting an August launch for its state stablecoin following years of preparation.",
    "link": "https://decrypt.co/326331/wyoming-plots-august-debut-wyst-state-stablecoin",
    "timestamp": "2025-06-21T20:07:23Z"
  },
  {
    "title": "Donald Trump's approval rating crashes in 15 key states that US President won in 2024",
    "description": "Donald Trump still enjoys positive approval ratings in South Karolina, Alabama, Alaska, Arkansas, and Kentucky.",
    "link": "https://economictimes.indiatimes.com/news/international/us/donald-trumps-approval-rating-crashes-in-15-key-states-that-us-president-won-in-2024/articleshow/121998260.cms",
    "timestamp": "2025-06-21T20:01:10Z"
  },
  {
    "title": "Former Democratic Adviser Says Party Has No Agenda Beyond Hating Trump",
    "description": "\"We don't have an agenda right now, and winning campaigns focus on the real lives of real people with effective leaders and something positive to say, and we have none of the above\"\nThe post Former Democratic Adviser Says Party Has No Agenda Beyond Hating Tru…",
    "link": "https://legalinsurrection.com/2025/06/former-democratic-adviser-says-party-has-no-agenda-beyond-hating-trump/",
    "timestamp": "2025-06-21T20:00:02Z"
  },
  {
    "title": "Fast-Changing Events Making, or Remaking, History",
    "description": "Events are moving fast. Seven days ago, as I write, Israel had not yet launched its first attacks on targets in Iran. Seven days from... Read More\nThe post Fast-Changing Events Making, or Remaking, History appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/21/fast-changing-events-making-remaking-history/",
    "timestamp": "2025-06-21T20:00:00Z"
  },
  {
    "title": "B-2 stealth bombers depart US as Trump weighs Iran strike",
    "description": "Moves indicate Trump administration is getting air force bombers in position if needed for strike on Iran",
    "link": "https://www.irishtimes.com/world/middle-east/2025/06/21/b-2-stealth-bombers-depart-us-as-trump-weighs-iran-strike/",
    "timestamp": "2025-06-21T19:59:42Z"
  },
  {
    "title": "Colorado Activists Enable Child Rapist To Avoid ICE Deportation",
    "description": "An illegal immigrant convicted and wanted in Italy for child rape remains on the loose after activists in Denver thwarted ICE agents from arresting him, authorities say.\nThe post Colorado Activists Enable Child Rapist To Avoid ICE Deportation appeared first o…",
    "link": "https://www.breitbart.com/immigration/2025/06/21/colorado-activists-enable-child-rapist-avoid-ice-deportation/",
    "timestamp": "2025-06-21T19:56:36Z"
  },
  {
    "title": "Trump: Hard to ask Israel to stop Iran war when it’s winning.",
    "description": "The president pushed back against claims the U.S. intelligence community did not have evidence Tehran is close to developing nuclear weapons. JNS Staff. U.S. President Donald Trump on Friday apparently turned down Tehran’s request to pressure Israel into endi…",
    "link": "https://freerepublic.com/focus/f-news/4324504/posts",
    "timestamp": "2025-06-21T19:56:05Z"
  },
  {
    "title": "Lithuania Choses Embraer C-390 Millenium as ‘Next Generation’ Military Cargo Aircraft",
    "description": "The C-390 will supplement the C-27J, strengthening the Lithuanian Air Force and supporting interoperability with NATO partners. Lithuania announced on Jun. 19, 2025 the selection of the Embraer C-390 Millenium military cargo aircraft as its next airlifter, an…",
    "link": "https://theaviationist.com/2025/06/21/lithuania-choses-embraer-c-390/",
    "timestamp": "2025-06-21T19:51:32Z"
  },
  {
    "title": "Theo Von Blasts Schumer as ‘Little Money Monkey’ on Podcast With Ro Khanna",
    "description": "Theo Von called Chuck Schumer a \"little money monkey\" after worrying he was \"slandering\" the Democrat during a conversation with Ro Khanna.\nThe post Theo Von Blasts Schumer as ‘Little Money Monkey’ on Podcast With Ro Khanna first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/podcasts/theo-von-blasts-schumer-as-little-money-monkey-on-podcast-with-ro-khanna/",
    "timestamp": "2025-06-21T19:50:37Z"
  },
  {
    "title": "Jasmine Crockett Claims Trump Supporters Are ‘Sick’ and Part of Country’s ‘Mental Health Crisis’ - NewsBreak",
    "description": "Rep. Jasmine Crockett (R-TX) linked supporters of President Donald Trump to a “mental health crisis” in the country and declared she’d “give anything” to h",
    "link": "https://www.newsbreak.com/share/4059789775602-jasmine-crockett-claims-trump-supporters-are-sick-and-part-of-country-s-mental-health-crisis?_f=app_share&amp;pd=0FPy1u9h&amp;lang=en_US&amp;send_time=1750534914&amp;trans_data=%7B%22platform%22%3A0%2C%22cv%22%3A%2225.25.0.37%22%2C%22languages%22%3A%22en%22%7D&amp;sep=ns_foryou_recall_exp_25q3-control%2Cns_foryou_rank_exp_25q2-v4%2Cns_foryou_blend_exp_25q2-v3%2Cns_foryou_model_exp_25q2_v2-v1&amp;s=i2",
    "timestamp": "2025-06-21T19:47:16Z"
  },
  {
    "title": "Exclusive-Israel seeks swift action on Iran, sources say, with a split U.S. administration",
    "description": "WASHINGTON/DUBAI/JERUSALEM (Reuters) -Israeli officials have told the Trump administration they do not want to wait two weeks for Iran to reach a deal to...",
    "link": "https://www.yahoo.com/news/exclusive-israel-seeks-swift-action-194640669.html",
    "timestamp": "2025-06-21T19:46:40Z"
  },
  {
    "title": "Trump 'laughing all the way to the bank' as he takes grift 'to a new level'",
    "description": "Trump 'laughing all the way to the bank' as he takes grift 'to a new level'\nPresident Donald Trump's net worth, according to Forbes, has fluctuated over the years. And estimates of his net worth in 2025 —the year he returned to the White House after a four-ye…",
    "link": "https://biztoc.com/x/770175788855bbe2",
    "timestamp": "2025-06-21T19:41:51Z"
  },
  {
    "title": "The return of the neocon canard",
    "description": "Israel’s war with Iran has given an ancient blood libel a new lease of life. Opinion.",
    "link": "https://www.israelnationalnews.com/news/410415",
    "timestamp": "2025-06-21T19:40:00Z"
  },
  {
    "title": "Gold prices should hit $4,000 as U.S. deficits may overshadow the Israel-Iran conflict, BofA says",
    "description": "\"While the war between Israel and Iran can always escalate, conflicts are not usually a sustained bullish price driver.\"",
    "link": "https://fortune.com/2025/06/21/gold-price-outlook-4000-us-debt-deficits-israel-iran-war/",
    "timestamp": "2025-06-21T19:35:31Z"
  },
  {
    "title": "Gold prices should hit $4,000 as U.S. deficits may overshadow the Israel-Iran conflict, BofA says",
    "description": "\"While the war between Israel and Iran can always escalate, conflicts are not usually a sustained bullish price driver.\"",
    "link": "https://finance.yahoo.com/news/gold-prices-hit-4-000-193531068.html",
    "timestamp": "2025-06-21T19:35:31Z"
  },
  {
    "title": "WATCH: Mahmoud Khalil speaks at Newark airport after release from immigration detention",
    "description": "Khalil greeted friends and spoke briefly to reporters Saturday at New Jersey’s Newark International Airport a day after leaving a federal immigration facility in Louisiana. A former Columbia University graduate student and symbol of Trump’s clampdown on campu…",
    "link": "https://www.pbs.org/newshour/politics/watch-mahmoud-khalil-speaks-at-newark-airport-after-release-from-immigration-detention",
    "timestamp": "2025-06-21T19:22:05Z"
  },
  {
    "title": "Rod Stewart Reveals The 1 Reason His Trump Friendship Is Done: 'I Can't Anymore'",
    "description": "The rock icon says President Donald Trump \"became another guy\" when he entered politics, and explained why their friendship has ended for good.",
    "link": "https://www.huffpost.com/entry/rod-stewart-ends-trump-friendship-over-israel-gaza-war_n_6856e30ae4b05236097f96a6",
    "timestamp": "2025-06-21T19:21:58Z"
  },
  {
    "title": "UPDATE: U.S. Officials Confirm Bunker Buster-Capable B-2 Stealth Bombers En Route to Guam as President Trump Weighs Iran Strike Decision",
    "description": "The United States is moving several B-2 stealth bombers to the Western Pacific U.S.\nThe post UPDATE: U.S. Officials Confirm Bunker Buster-Capable B-2 Stealth Bombers En Route to Guam as President Trump Weighs Iran Strike Decision appeared first on The Gateway…",
    "link": "https://www.thegatewaypundit.com/2025/06/update-u-s-officials-confirm-b-2-stealth/",
    "timestamp": "2025-06-21T19:20:06Z"
  },
  {
    "title": "Have War Hawks Taken Control of the Trump Administration?",
    "description": "Many Americans are shocked at how quickly the Trump administration seems to have regressed from one that prioritized diplomacy to one that’s itching to drop bombs on a foreign country half a world away. In many ways, Donald Trump is unlike any president in re…",
    "link": "https://freerepublic.com/focus/f-news/4324495/posts",
    "timestamp": "2025-06-21T19:19:24Z"
  },
  {
    "title": "Donald Trump: “I Deserve the Nobel Peace Prize”",
    "description": "Political cartoonist Ann Telnaes recently won the Pulitzer Prize, specifically for a cartoon that depicted plutocrats prostrating themselves at the feet of Trump. One of them was Jeff Bezos, owner of The Washington Post, who was her boss. Her editor refused t…",
    "link": "https://dianeravitch.net/2025/06/21/donald-trump-i-deserve-the-nobel-peace-prize/",
    "timestamp": "2025-06-21T19:16:29Z"
  },
  {
    "title": "US B-2 Stealth Bombers on the Move Across Pacific",
    "description": "B-2 bombers head to Guam as Trump weighs decision on joining Israeli strikes against Iran's nuclear sites within two weeks.",
    "link": "https://www.newsweek.com/us-b2-stealth-bombers-move-acorss-pacific-2088821",
    "timestamp": "2025-06-21T19:13:39Z"
  },
  {
    "title": "Is Iran set to leave the Nuclear Non-Proliferation Treaty?",
    "description": "As the bombs keep landing and Israel continues its devastating attacks on Iran's nuclear program, it's easy to forget Iran remains a signatory of the Nuclear Non-Proliferation Treaty.",
    "link": "https://www.abc.net.au/news/2025-06-22/is-iran-set-to-leave-the-nuclear-non-proliferation-treaty-/105438606",
    "timestamp": "2025-06-21T19:13:15Z"
  },
  {
    "title": "Tesla to build its first grid-scale power plant in mainland China",
    "description": "NEW YORK: Tesla announced Friday that it signed an agreement to build its first grid-scale energy storage power station project in mainland China. The project ...",
    "link": "https://kuwaittimes.com/article/29801/business/tesla-to-build-its-first-grid-scale-power-plant-in-mainland-china/",
    "timestamp": "2025-06-21T19:12:50Z"
  },
  {
    "title": "President of Iran says country won't halt nuclear activity 'under any circumstances'",
    "description": "Israel continued its bombing campaign in Iran overnight.",
    "link": "https://www.thejournal.ie/iran-and-israel-6739926-Jun2025/",
    "timestamp": "2025-06-21T19:11:24Z"
  },
  {
    "title": "Report: Khamenei has already selected his potential successor",
    "description": "Iran's Supreme Leader has provided Iran's Assembly of Experts with three names to succeed him if he is eliminated in a conflict with Israel.",
    "link": "https://www.israelnationalnews.com/news/410402",
    "timestamp": "2025-06-21T19:10:31Z"
  },
  {
    "title": "Rep. Wesley Hunt Bristles When Paul Begala Accuses Trump Of ‘Pissing On Our Veterans’: ‘No He Doesn’t!’",
    "description": "Rep. Wesley Hunt objected when Democratic strategist Paul Begala accused President Donald Trump of \"pissing on our veterans and our military.\"\nThe post Rep. Wesley Hunt Bristles When Paul Begala Accuses Trump Of ‘Pissing On Our Veterans’: ‘No He Doesn’t!’ fir…",
    "link": "https://www.mediaite.com/media/news/rep-wesley-hunt-bristles-when-begala-accuses-trump-of-pissing-on-our-veterans-no-he-doesnt/",
    "timestamp": "2025-06-21T19:09:40Z"
  },
  {
    "title": "'We see the Russian danger': The country trying to Putin-proof its border",
    "description": "As Vladimir Putin's war in Ukraine rages into its fourth year, Poland is preparing to be the Russian president's next target, beefing up defences on its borders and making every man a \"fully fledged\" soldier.",
    "link": "https://www.abc.net.au/news/2025-06-22/poland-prepares-to-be-next-russian-target/105388594",
    "timestamp": "2025-06-21T19:08:45Z"
  },
  {
    "title": "Dissident Siarhei Tsikhanouski freed in Belarus after rare visit from top U.S. envoy",
    "description": "Belarus has freed Siarhei Tsikhanouski, a key dissident figure and the husband of exiled opposition leader Sviatlana Tsikhanouskaya, and 13 others following a rare visit by a senior U.S. official, Tsikhanouskaya’s team announced on Saturday.",
    "link": "https://www.pbs.org/newshour/world/dissident-siarhei-tsikhanouski-freed-in-belarus-after-rare-visit-from-top-u-s-envoy",
    "timestamp": "2025-06-21T19:07:30Z"
  },
  {
    "title": "After Coming Back Home, Mahmoud Khalil Vows To Continue Protesting Israel's War In Gaza",
    "description": "Joining Khalil at the airport, U.S. Rep. Alexandria Ocasio-Cortez of New York said his detention violated the First Amendment and was “an affront to every American.”",
    "link": "https://www.huffpost.com/entry/mahmoud-khalil-vows-continue-protesting-israels-war-in-gaza_n_6856fe56e4b05236097f97f8",
    "timestamp": "2025-06-21T19:04:47Z"
  },
  {
    "title": "Exclusive—Rep. Pat Harrigan: Why the Left Is So Afraid of the Big Beautiful Bill",
    "description": "The Democrats who still refuse to condemn the anti-ICE riots likely also oppose the Big Beautiful Bill for the same reason.\nThe post Exclusive—Rep. Pat Harrigan: Why the Left Is So Afraid of the Big Beautiful Bill appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/21/exclusive-rep-pat-harrigan-why-the-left-is-so-afraid-of-the-big-beautiful-bill/",
    "timestamp": "2025-06-21T19:00:57Z"
  },
  {
    "title": "The $50 Billion Company That Does Almost Nothing",
    "description": "Wall Street is valuing crypto firm Circle like the next big thing in tech. Its entire business? Holding your dollars and keeping the interest.",
    "link": "https://gizmodo.com/the-50-billion-company-that-does-almost-nothing-2000618670",
    "timestamp": "2025-06-21T19:00:09Z"
  },
  {
    "title": "US moves B-2 bombers as Trump weighs Iran options | CNN Politics",
    "description": "Multiple US B-2 bombers appear to have taken off from Whiteman Air Force Base in Missouri on Friday night and are heading west, according to flight tracking data CNN has reviewed, as President Donald Trump weighs his military options over a potential airstrik…",
    "link": "https://www.cnn.com/2025/06/21/politics/iran-b-2-bombers-trump",
    "timestamp": "2025-06-21T18:59:31Z"
  },
  {
    "title": "JD Vance intentionally misnames former colleague his administration had tackled and handcuffed for asking a question",
    "description": "Speaking of white supremacists with law degrees: Sen. Alex Padilla snapped back at Vice President JD Vance Saturday, calling the vice president “petty and unserious” after Vance referred to the senator as “Jose” during a press conference in Los Angeles the pr…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/06/jd-vance-intentionally-misnames-former-colleague-his-administration-had-tackled-and-handcuffed-for-asking-a-question",
    "timestamp": "2025-06-21T18:58:42Z"
  }
]