[
  {
    "title": "Iranian State Television Confirms Death of Country's Supreme Leader Ali Khamenei",
    "description": "Iran's Supreme Leader Ali Khamenei has been killed in attacks by Israel and the United States, Iranian state television confirmed.",
    "link": "https://sputnikglobe.com/20260301/iranian-state-television-confirms-death-of-countrys-supreme-leader-ali-khamenei-1123721366.html",
    "timestamp": "2026-03-01T03:34:00Z"
  },
  {
    "title": "Report: Saudi, Israeli leaders urged Trump to strike Iran",
    "description": "President Trump launched Saturday’s strike on Iran after weeks of lobbying by Israeli and Saudi leaders, according to The Washington Post.",
    "link": "https://www.israelnationalnews.com/news/423142",
    "timestamp": "2026-03-01T03:30:05Z"
  },
  {
    "title": "FOX’s Brit Hume Knocks Dem Reactions on Iran, Says They’re ‘Trapped’ by Trump Derangement Syndrome (VIDEO)",
    "description": "With the news of Trump’s actions in Iran, FOX News has brought on all of their primetime hosts and analysts to react on a Saturday night.\nThe post FOX’s Brit Hume Knocks Dem Reactions on Iran, Says They’re ‘Trapped’ by Trump Derangement Syndrome (VIDEO) appea…",
    "link": "https://www.thegatewaypundit.com/2026/02/foxs-brit-hume-knocks-dem-reactions-iran-says/",
    "timestamp": "2026-03-01T03:20:08Z"
  },
  {
    "title": "Diplomacy shifts to war: How Trump’s team decided to attack Iran",
    "description": "President Donald Trump ended weeks of negotiations with Iran and launched a major military campaign after talks failed to secure limits on Tehran’s nuclear and missile programs. The U.S. had built up its largest military presence in the Middle East since the …",
    "link": "https://economictimes.indiatimes.com/news/defence/diplomacy-shifts-to-war-how-trumps-team-decided-to-attack-iran/articleshow/128904221.cms",
    "timestamp": "2026-03-01T03:19:54Z"
  },
  {
    "title": "Who in the Iranian leadership has been killed?",
    "description": "A growing list of Iran's top leadership has been reportedly killed in ongoing strikes by Israel and the United States.",
    "link": "https://www.abc.net.au/news/2026-03-01/us-and-israel-have-struck-iran-who-has-been-killed/106401908",
    "timestamp": "2026-03-01T03:18:32Z"
  },
  {
    "title": "US-Israel attack on Iran — Khamenei dead, protests outside White House: Key events in the past 24 hours",
    "description": "Over 200 Iranians dead, flights disrupted at multiple airports; UNSC emergency meeting; here are the key events from the past 24 hours.",
    "link": "https://indianexpress.com/article/world/us-israel-attacks-iran-khamenei-dead-timeline-key-events-10558509/",
    "timestamp": "2026-03-01T03:15:43Z"
  },
  {
    "title": "Trump’s ambitions for Iran are now clear: He wants everything",
    "description": "Operation Epic Fury, launched by President Trump, aims for regime change in Iran with ambitious goals including eliminating its nuclear program and military capabilities. While the death of Supreme Leader Khamenei offers a potential opening, the operation car…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trumps-ambitions-for-iran-are-now-clear-he-wants-everything/articleshow/128903894.cms",
    "timestamp": "2026-03-01T03:10:58Z"
  },
  {
    "title": "Middle East in flames: Celebrations in Tehran over the death of Ali Khamenei; President Masoud Pezeshkian is currently leading the country",
    "description": "Key events\nThe post Middle East in flames: Celebrations in Tehran over the death of Ali Khamenei; President Masoud Pezeshkian is currently leading the country appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2026/03/01/israel-attacked-iran-us-media-speak-of-a-joint-operation-with-the-united-states-watch-video/",
    "timestamp": "2026-03-01T03:10:36Z"
  },
  {
    "title": "Neither preemptive nor legal, US-Israeli strikes on Iran have blown up international law",
    "description": "With the latest strikes on Iran, The international legal order is now in free-fall.",
    "link": "https://theconversation.com/neither-preemptive-nor-legal-us-israeli-strikes-on-iran-have-blown-up-international-law-277173",
    "timestamp": "2026-03-01T03:09:51Z"
  },
  {
    "title": "Iran’s government confirms: Ali Khamenei killed, 40 days of public mourning and 7 days of national holiday",
    "description": "Iran’s government has confirmed that Supreme Leader Ali Khamenei has been killed, declaring 40 days of public mourning and seven days of nationwide holiday\nThe post Iran’s government confirms: Ali Khamenei killed, 40 days of public mourning and 7 days of nati…",
    "link": "https://en.protothema.gr/2026/03/01/irans-government-confirms-ali-khamenei-killed-40-days-of-public-mourning-and-7-days-of-national-holiday/",
    "timestamp": "2026-03-01T03:07:29Z"
  },
  {
    "title": "War for Ukraine Day 1,465: A Brief Saturday Night Update",
    "description": "(Current mood and yes, I know, it’s now 28 FEB) Given all the whacked out activity of today, I’m just going to run through the basics tonight so I can go off line. Sign of the Times: While Russia’s war on Ukraine and the Iran war aren’t directly connected, bo…",
    "link": "https://balloon-juice.com/2026/02/28/war-for-ukraine-day-1465-a-brief-saturday-night-update/",
    "timestamp": "2026-03-01T03:07:17Z"
  },
  {
    "title": "US, Israel clash with Iran at emergency Security Council meeting, UN chief condemns attacks",
    "description": "UNITED NATIONS: The United States and Israel clashed with Iran at an emergency meeting of the U.N. Security Council on Saturday (Feb 28), where the U.N. chief and many countries urged a halt to their attacks and a return to negotiations to prevent the conflic…",
    "link": "https://www.thestar.com.my/news/world/2026/03/01/us-israel-clash-with-iran-at-emergency-security-council-meeting-un-chief-condemns-attacks",
    "timestamp": "2026-03-01T03:06:00Z"
  },
  {
    "title": "Trump cheers death of Iran’s Supreme leader Khamenei, says strikes will continue",
    "description": "Trump, who is monitoring the operation from his Mar-a-Lago oceanfront resort in Florida, posted on Saturday afternoon that Iranian Supreme Leader Ayatollah Ali Khamenei had died in the strikes.",
    "link": "https://indianexpress.com/article/world/trump-death-iranian-leader-strikes-continue-10558538/",
    "timestamp": "2026-03-01T03:04:12Z"
  },
  {
    "title": "Kamala Harris doesn’t want regime change in Iran: ‘Dangerous and unnecessary’",
    "description": "The former Democratic Party presidential nominee accused President Trump of lying and putting American troops in harm's way.",
    "link": "https://nypost.com/2026/02/28/us-news/kamala-harris-rips-trump-over-iran-attack-a-war-american-people-do-not-want/",
    "timestamp": "2026-03-01T03:03:30Z"
  },
  {
    "title": "China condemns attacks on Iran, urges ceasefire and talks",
    "description": "On Sunday (Mar 1), China's embassy in Israel issued a notice advising Chinese citizens in Israel to evacuate to safer areas within the country as soon as possible or to leave for Egypt via the Taba border crossing.",
    "link": "https://www.channelnewsasia.com/east-asia/china-condemns-attacks-iran-urges-ceasefire-and-talks-5961376",
    "timestamp": "2026-03-01T03:03:00Z"
  },
  {
    "title": "Iran’s Supreme Leader Khamenei dead, says Trump",
    "description": "US President Donald Trump claims Iranian Supreme Leader Ali Khamenei is dead following air strikes, though Tehran has not confirmed the report.\n\nRead More: https://punchng.com/irans-supreme-leader-khamenei-dead-says-trump/",
    "link": "https://punchng.com/irans-supreme-leader-khamenei-dead-says-trump/",
    "timestamp": "2026-03-01T03:00:53Z"
  },
  {
    "title": "COMPLIATION: ***Operation: Roaring Lion / Epic Fury*** (2.28.26)",
    "description": "***Operation: Roaring Lion / Epic Fury*** In the joint military operations launched on 28 February 2026 (codenamed \"Operation Epic Fury\" by the US and \"Roaring Lion\" by Israel), the two nations focused on distinct but overlapping target sets to dismantle Iran…",
    "link": "https://freerepublic.com/focus/f-bloggers/4368778/posts",
    "timestamp": "2026-03-01T02:57:03Z"
  },
  {
    "title": "Iran's IGRC: 'Most intense' offensive operation on Israel, U.S. bases to begin in moments",
    "description": "Trump Pushed to Launch Iran Strikes by Israel and Saudi Arabia, Sources Tell Washington Post . Iran's State Media Confirms Supreme Leader Ayatollah Ali Khamenei Has Been Killed in Saturday Strikes. Australia's Foreign Minister Warns Citizens Not to Travel to …",
    "link": "https://www.haaretz.com/israel-news/2026-03-01/ty-article-live/iran-most-intense-offensive-against-israel-u-s-bases-to-begin-in-moments/0000019c-a72d-db44-a1dd-a76d6a5b0000",
    "timestamp": "2026-03-01T02:47:38Z"
  },
  {
    "title": "Israel, U.S. stiff-arm U.N. during emergency Security Council meeting",
    "description": "Iran's ambassador said the airstrikes have killed and injured hundreds of Iranian civilians, which he called a war crime and a crime against humanity.",
    "link": "https://fortune.com/2026/02/28/iran-strikes-us-israel-united-nations-security-council-emergency-meeting/",
    "timestamp": "2026-03-01T02:45:06Z"
  },
  {
    "title": "Thomas Massie among few Republicans to criticize Trump over war powers: ‘This is not ‘America First”",
    "description": "Key members of Congress are demanding a swift vote on a war powers resolution that would restrain President Donald Trump's military attack on Iran.",
    "link": "https://fortune.com/2026/02/28/thomas-massie-among-few-republicans-to-criticize-trump-over-war-powers-this-is-not-america-first/",
    "timestamp": "2026-03-01T02:41:05Z"
  },
  {
    "title": "イラン最高指導者、ハメネイ師が死亡と発表　アメリカとイスラエルが学校など攻撃「201人死亡」と国営メディア",
    "description": "ドナルド・トランプ米大統領は2月28日、イランの最高指導者アリ・ハメネイ師が、アメリカとイスラエルによる攻撃で死亡したと発表した。\r\nイランの国営メディアも、アメリカとイスラエルによる攻撃でハメネイ師が死亡したと伝えている。\r\n【画像】「ハメネイ師の死亡」を伝える国営メディアやトランプ氏\r\nトランプ氏はトュルース・ソーシャルに投稿した声明で「歴史上もっとも悪名高いハメネイ師が死亡した」と説明。「（ハメネイ師が）我々の諜報部隊と綿密な追跡システムから免れることができなかった」とつづった上で、「ハメネイ師や、共に死亡…",
    "link": "https://www.huffingtonpost.jp/entry/story_jp_69a115b6e4b0302539931126",
    "timestamp": "2026-03-01T02:39:54Z"
  },
  {
    "title": "Voice of America pushes Trump’s message inside Iran as regime clamps down on communications: reports",
    "description": "VOA Persian service reportedly continues broadcasting inside Iran despite regime communication restrictions, covering \"Operation Epic Fury\" and Supreme Leader Ali Khamenei's death.",
    "link": "https://www.foxnews.com/media/voice-of-america-pushes-trumps-message-inside-iran-regime-clamps-down-communications-reports",
    "timestamp": "2026-03-01T02:37:09Z"
  },
  {
    "title": "A month before Iran strikes, Trump told Iranian protesters help was on the way amid a government crackdown",
    "description": "Human rights groups reported that thousands were killed in the Iranian crackdown.",
    "link": "https://fortune.com/2026/02/28/why-trump-decided-to-strike-iran-protests-crackdown-thousands-dead/",
    "timestamp": "2026-03-01T02:36:55Z"
  },
  {
    "title": "Iran goes dark amid 'regime paranoia', blackout follows Israeli, US strikes on compound",
    "description": "Iran's internet connectivity flatlined at 1% after strikes on a Tehran regime compound, marking one of the world's rare wartime national blackouts according to global internet monitors.",
    "link": "https://www.foxnews.com/world/iran-goes-dark-after-tehran-compound-strike-metadata-expose-regime-leaders",
    "timestamp": "2026-03-01T02:31:55Z"
  },
  {
    "title": "Two Devils Dancing",
    "description": "Two devils dancing – Putin and T – and I’ll bet that one of them doesn’t understand that he’s only a puppet, with the strings being pulled by the other devil. I am not a foreign policy expert by any stretch of the imagination, and I have way more questions th…",
    "link": "https://balloon-juice.com/2026/02/28/two-devils-dancing/",
    "timestamp": "2026-03-01T02:30:09Z"
  },
  {
    "title": "US, Israel unleash ‘Epic Fury’ on Iran",
    "description": "Middle East News: The United States and Israel launched a major attack on Iran on Saturday, and US President Donald Trump called on the Iranian public to \\\"seize control.",
    "link": "https://timesofindia.indiatimes.com/world/middle-east/us-israel-unleash-epic-fury-on-iran/articleshow/128903453.cms",
    "timestamp": "2026-03-01T02:29:59Z"
  },
  {
    "title": "Marjorie Taylor Greene rips Iran strikes as Trump betraying America First: ‘It’s always a lie and it’s always America Last’",
    "description": "In 10 years, Trump went from criticizing regime change in the Middle East to urging Iranians to \"seize control of your destiny.\"",
    "link": "https://fortune.com/2026/02/28/trump-america-first-bomb-iran-middle-east-regime-change/",
    "timestamp": "2026-03-01T02:29:48Z"
  },
  {
    "title": "Russia accuses America of ‘pre-planned and unprovoked act of armed aggression’ against Iran",
    "description": "The Arab League called the Iranian attacks “a blatant violation of the sovereignty of countries that advocate for peace and strive for stability.”",
    "link": "https://fortune.com/2026/02/28/russia-reaction-iran-attack-trump-israel-world-leaders-reactions/",
    "timestamp": "2026-03-01T02:22:01Z"
  },
  {
    "title": "Iran’s supreme leader Khamenei killed in US-Israeli strikes",
    "description": "TEHRAN: Iran’s supreme leader, Ayatollah Ali Khamenei, has been killed, Iranian state media confirmed, following a large-scale US-Israeli attack. US President Donald Trump warned that the bombing campaign would continue heavily throughout the week, signaling …",
    "link": "https://english.khabarhub.com/2026/01/537108/",
    "timestamp": "2026-03-01T02:21:03Z"
  },
  {
    "title": "Trump Rolls the Iron Dice",
    "description": "The uncertainties of Trump’s attack on Iran are enough to justify some queasy doubts.",
    "link": "https://www.theatlantic.com/ideas/2026/02/trump-rolls-iron-dice-iran/686199/",
    "timestamp": "2026-03-01T02:15:11Z"
  },
  {
    "title": "Netanyahu’s war? Analysts say Trump’s Iran strikes benefit Israel, not US",
    "description": "War with Iran contradicts the US president's own criticism of regime change policies in the Middle East, analysts say.",
    "link": "https://www.aljazeera.com/news/2026/3/1/netanyahus-war-analysts-say-trumps-iran-strikes-benefit-israel-not-us",
    "timestamp": "2026-03-01T02:14:32Z"
  },
  {
    "title": "Iran confirms the death of Supreme Leader Khamenei",
    "description": "Tehran (dpa): Iranian Supreme Leader Ayatollah Ali Khamenei is dead, according to Iranian state media. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/03/01/iran-confirms-the-death-of-supreme-leader-khamenei",
    "timestamp": "2026-03-01T02:12:00Z"
  },
  {
    "title": "Iranian Supreme Leader Khamenei dies after major attack by Israel and the U.S., Iranian state media confirms",
    "description": "Neither Iranian state television nor the state-run IRNA news agency reported a cause of death for the 86-year-old.",
    "link": "https://fortune.com/2026/02/28/iranian-supreme-leader-khamenei-dead-state-media-confirms-attack-israel-us/",
    "timestamp": "2026-03-01T02:11:20Z"
  },
  {
    "title": "Donald Trump Wasn't Bluffing on Iran (Philip Klein/National Review)",
    "description": "Philip Klein / National Review:\nDonald Trump Wasn't Bluffing on Iran  —  As we await more details about the success of the joint U.S.-Israeli operation against Iran, I have gathered some initial thoughts.  — President Trump was not bluffing.  He has been quit…",
    "link": "https://www.memeorandum.com/260228/p94",
    "timestamp": "2026-03-01T02:10:00Z"
  },
  {
    "title": "‘Stunning Achievement’: David Petraeus Praises US-Israeli Strike That Eliminated Khamenei — But Asks ‘Who Will Follow?’",
    "description": "David Petraeus praised the joint Israeli-American strike that killed Iranian Supreme Leader Ali Khamenei during an interview with Jake Tapper on Saturday night\nThe post ‘Stunning Achievement’: David Petraeus Praises US-Israeli Strike That Eliminated Khamenei …",
    "link": "https://www.mediaite.com/media/news/stunning-achievement-david-petraeus-praises-us-israeli-strike-that-eliminated-khamenei-but-asks-who-will-follow/",
    "timestamp": "2026-03-01T02:09:50Z"
  },
  {
    "title": "Trump suggests ‘demented’ Hollywood icon [DeNiro] leave the country: ‘Sicker than Crazy Rosie O’Donnell’",
    "description": "President Donald Trump on Wednesday encouraged actor Robert De Niro to leave the country a day after the two-time Oscar winner widely criticized his administration during a “State of the Swamp” event. Trump made the suggestion in a Truth Social post where he …",
    "link": "https://freerepublic.com/focus/f-chat/4368773/posts",
    "timestamp": "2026-03-01T02:09:16Z"
  },
  {
    "title": "Why US-Israel strikes eliminated Khamenei and what Washington aims to achieve in Iran",
    "description": "The United States and Israel launched significant attacks on Iran, resulting in the death of Supreme Leader Ayatollah Ali Khamenei. President Trump outlined key objectives including preventing Iran from acquiring nuclear weapons, containing its missile progra…",
    "link": "https://economictimes.indiatimes.com/news/defence/why-us-israel-strikes-eliminated-khamenei-and-what-washington-aims-to-achieve-in-iran/articleshow/128903205.cms",
    "timestamp": "2026-03-01T02:08:12Z"
  },
  {
    "title": "Kyiv says Russia accepted US security guarantee plan for Ukraine",
    "description": "Russia said it could accept US-backed security guarantees for Ukraine at Geneva talks, but no breakthrough or Putin-Zelenskiy summit has been agreed.",
    "link": "https://www.thehindubusinessline.com/news/world/kyiv-says-russia-accepted-us-security-guarantee-plan-for-ukraine/article70690512.ece",
    "timestamp": "2026-03-01T02:04:41Z"
  },
  {
    "title": "Viral Video: Iranian Woman Who Fled Iran Does YMCA Dance to Celebrate President Trump Toppling Evil Islamist Regime",
    "description": "A video went viral Saturday that was posted by an Iranian woman doing the YMCA dance to celebrate President Donald Trump toppling the evil Islamist Iranian regime led by Ayatollah Ali Khamenei.\nThe post Viral Video: Iranian Woman Who Fled Iran Does YMCA Dance…",
    "link": "https://www.thegatewaypundit.com/2026/02/viral-video-iranian-woman-who-fled-iran-does/",
    "timestamp": "2026-03-01T02:00:30Z"
  },
  {
    "title": "Satellite images show extent of destruction where Iran's supreme leader was killed",
    "description": "Iranian state media has confirmed the death of Ayatollah Khamenei, and a high-definition satellite image shows the home of the supreme leader in ruins.",
    "link": "https://www.abc.net.au/news/2026-03-01/abc-verify-satellite-over-ayatollah-compound/106402030",
    "timestamp": "2026-03-01T01:58:51Z"
  },
  {
    "title": "World leaders react cautiously to US and Israeli strikes, death of Iran's Ali Khamenei",
    "description": "World leaders reacted warily to U.S. and Israeli strikes on Iran, following reports of Supreme Leader Ayatollah Ali Khamenei's death. While some nations expressed support, others, including Russia and China, criticized the action. European and Middle Eastern …",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/world-leaders-react-cautiously-to-us-and-israeli-strikes-death-of-iran-ali-khamenei/articleshow/128903068.cms",
    "timestamp": "2026-03-01T01:58:45Z"
  },
  {
    "title": "Iran officially announces: Khamenei eliminated",
    "description": "Official media outlets in Iran confirm Supreme Leader was eliminated in joint strikes by the US and Israel. 40 days of mourning declared.",
    "link": "https://www.israelnationalnews.com/news/423141",
    "timestamp": "2026-03-01T01:55:18Z"
  },
  {
    "title": "Trump Says Reports of Khamenei's Death Appear to Be 'Correct' (María Paula Mijares Torres/Bloomberg)",
    "description": "María Paula Mijares Torres / Bloomberg:\nTrump Says Reports of Khamenei's Death Appear to Be ‘Correct’  —  President Donald Trump told NBC News that reports of Iran's supreme leader Ayatollah Ali Khamenei's death appear to be a “correct story.”  —  Several out…",
    "link": "https://www.memeorandum.com/260228/p92",
    "timestamp": "2026-03-01T01:55:01Z"
  },
  {
    "title": "Expert flags 'most troubling' part of Trump's latest 'campaign' in Iran",
    "description": "A military expert flagged the \"most troubling\" part of President Donald Trump's decision to coordinate an attack on Iran with Israel on Saturday. Mark Hertling, retired commander of the U.S. Army Europe, argued in a new article for The Bulwark that Trump's de…",
    "link": "https://www.rawstory.com/trump-iran-2675465593/",
    "timestamp": "2026-03-01T01:50:30Z"
  },
  {
    "title": "'No One Is Happy': CNN Staffers 'Devastated' as Warner Bros. Discovery-Paramount Deal Sparks Panic at Troubled Network",
    "description": "Employees at the left-leaning cable network are afraid of what could happen if the more conservative company takes over.",
    "link": "https://radaronline.com/p/cnn-staffers-devastated-warner-bros-discovery-paramount-deal/",
    "timestamp": "2026-03-01T01:49:59Z"
  },
  {
    "title": "US strikes on Iran lead to renewed demands for war powers legislation",
    "description": "Democratic lawmakers have largely condemned the strikes on Iran, emphasising the lack of congressional approval.",
    "link": "https://www.aljazeera.com/news/2026/3/1/us-strikes-on-iran-lead-to-renewed-demands-for-war-powers-legislation",
    "timestamp": "2026-03-01T01:48:20Z"
  },
  {
    "title": "Watch Journalist Marked For Death By Khamenei Celebrate His Demise",
    "description": "Journalist Masih Alinejad took to the streets of New York City Saturday to celebrate the death of Iranian Supreme Leader Ali Khamenei.",
    "link": "https://dailycaller.com/2026/02/28/masih-alinejad-journalist-khamenei-death/",
    "timestamp": "2026-03-01T01:46:43Z"
  },
  {
    "title": "Iranians in Quebec take to the streets to celebrate in wake of military intervention",
    "description": "Iranian Quebecers are reacting to the military intervention on Iran launched by the U.S. and Israel on Saturday. Some who took to the streets in celebration are hoping it leads to regime change, while others are worried about the possible impacts of foreign i…",
    "link": "https://www.cbc.ca/news/canada/montreal/quebec-iranians-reaction-american-israeli-military-intervention-9.7109950",
    "timestamp": "2026-03-01T01:44:10Z"
  },
  {
    "title": "Ayatollah Ali Khamenei, religious cleric who ruled Iran for decades, killed in strikes",
    "description": "Ayatollah Ali Khamenei, who reigned as Iran’s supreme leader for the past 36 years, was killed in a sweeping U.S. and Israeli attack on the country Saturday.",
    "link": "https://www.nbcnews.com/world/iran/ayatollah-ali-khamenei-religious-cleric-ruled-iran-decades-killed-stri-rcna241863",
    "timestamp": "2026-03-01T01:44:09Z"
  },
  {
    "title": "Iran vows 'decisive' self defense at UN after Trump kills supreme leader in Operation Epic Fury",
    "description": "Iran's U.N. ambassador condemned U.S. strikes that killed Supreme Leader Khamenei, calling attack a sovereignty violation at Security Council meeting.",
    "link": "https://www.foxnews.com/politics/iran-vows-decisive-self-defense-u-n-trump-kills-supreme-leader-operation-epic-fury",
    "timestamp": "2026-03-01T01:43:43Z"
  },
  {
    "title": "Deposed Shah’s Son Praises ‘Beginning Of Our Great National Celebration,’ Urges Vigilance In Wake Of Ayatollah’s Death",
    "description": "The last shah of Iran's son said Saturday the death of the ayatollah marks the end of the Islamic theocracy, which ousted his father from power 47 years ago.",
    "link": "https://dailycaller.com/2026/02/28/iran-shah-son-reza-pahlavi-praises-national-celebration-ayatollah-ali-khamenei-dead/",
    "timestamp": "2026-03-01T01:42:18Z"
  },
  {
    "title": "I fled Iran’s terror — Trump’s courage is an answer to my prayers",
    "description": "Every US president since Jimmy Carter has sat across the table from Iran and bought what they were selling. Trump had the historic vision to reject the regime's lies.",
    "link": "https://nypost.com/2026/02/28/opinion/i-fled-irans-terror-trumps-courage-is-an-answer-to-my-prayers/",
    "timestamp": "2026-03-01T01:34:34Z"
  },
  {
    "title": "UN Secretary-General unable to confirm reports of Khamenei's death",
    "description": "NEW YORK: United Nations Secretary-General Antonio Guterres said he could not verify reports of the death of Iran's Supreme Leader, Ayatollah Ali Khamenei, according to Sputnik/RIA Novosti. Read full story",
    "link": "https://www.thestar.com.my/news/nation/2026/03/01/un-secretary-general-unable-to-confirm-reports-of-khamenei039s-death",
    "timestamp": "2026-03-01T01:33:00Z"
  },
  {
    "title": "Why Trump has suddenly developed a taste for attacking other countries",
    "description": "Trump once proclaimed: \"I am especially proud to be the first president in decades who has started no new wars.\" Now things have changed.",
    "link": "https://www.abc.net.au/news/2026-03-01/trump-iran-taste-for-attacking-other-countries/106402042",
    "timestamp": "2026-03-01T01:32:43Z"
  },
  {
    "title": "Anthropic CEO says he's sticking to AI \"red lines\" despite clash with Pentagon - CBS News",
    "description": "Anthropic CEO says he's sticking to AI \"red lines\" despite clash with PentagonCBS News OpenAI strikes deal with Pentagon hours after Trump admin bans AnthropicCNN Trump has ordered government agencies to stop using Anthropic AI toolsBBC Donald Trump lashes ou…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180875816",
    "timestamp": "2026-03-01T01:32:20Z"
  },
  {
    "title": "Trump’s Iran Strike: What It Says About Russia—and Us",
    "description": "Russia is toothless. If anyone needed evidence of how far and fast Russia has fallen, it is the American assault on Iran. This “war,” as President Donald Trump called it in his video message on Saturday, would have been impossible if Moscow were not bogged do…",
    "link": "http://washingtonmonthly.com/2026/02/28/trumps-iran-strike-what-it-says-about-russia-and-us/",
    "timestamp": "2026-03-01T01:31:54Z"
  },
  {
    "title": "Report: Israel, US strikes timed for Khamenei’s meeting with inner circle",
    "description": "Sources tell Reuters that Iran’s Supreme Leader was meeting with top aides when Israel and the US launched the strikes that eliminated him.",
    "link": "https://www.israelnationalnews.com/news/423140",
    "timestamp": "2026-03-01T01:29:48Z"
  },
  {
    "title": "Newsom’s water plan —as empty as the Palisades reservoir",
    "description": "Gavin Newsom launched a new water policy this week that does almost nothing for water.",
    "link": "https://nypost.com/2026/02/28/opinion/newsoms-water-plan-is-about-his-2028-campaign/",
    "timestamp": "2026-03-01T01:27:35Z"
  },
  {
    "title": "Killing of Khamenei an attempt to 'kill an era' in Iran: Analyst",
    "description": "Khamenei has followers in Lebanon, Iraq, Bahrain, UAE and many other countries so there is a risk of major escalation in those areas, says an analyst.",
    "link": "https://www.channelnewsasia.com/world/iran-khamenei-killed-us-israel-attack-analysts-5961246",
    "timestamp": "2026-03-01T01:25:00Z"
  },
  {
    "title": "US and Israel clash with Iran at emergency Security Council meeting. UN chief condemns attacks",
    "description": "The United Nations Security Council convened an emergency session as the United States and Iran clashed over recent airstrikes. UN chief Antonio Guterres urged an end to attacks and a return to talks to prevent wider regional conflict. Ambassadors from both n…",
    "link": "https://economictimes.indiatimes.com/news/defence/us-and-israel-clash-with-iran-at-emergency-security-council-meeting-un-chief-condemns-attacks/articleshow/128902609.cms",
    "timestamp": "2026-03-01T01:24:23Z"
  },
  {
    "title": "Anti-US protesters funded by pro-China tycoon mobilize as first bombs fall on Iran (Fox News)",
    "description": "Fox News:\nAnti-US protesters funded by pro-China tycoon mobilize as first bombs fall on Iran  —  In the dark of the night, 10 minutes before President Donald Trump even announced that the U.S. and Israel had attacked Iran, a network of U.S. nonprofits aligned…",
    "link": "https://www.memeorandum.com/260228/p87",
    "timestamp": "2026-03-01T01:20:00Z"
  },
  {
    "title": "Push from Saudis, Israel helped move Trump to attack Iran (Washington Post)",
    "description": "Washington Post:\nPush from Saudis, Israel helped move Trump to attack Iran  —  U.S. intelligence assessments saw no imminent threat, but regional allies argued now was the time to strike.  —  President Donald Trump launched Saturday's wide-ranging attack on I…",
    "link": "https://www.memeorandum.com/260228/p85",
    "timestamp": "2026-03-01T01:20:00Z"
  },
  {
    "title": "US Olympic hockey hero Jack Hughes opens up about support for women's team amid backlash over Trump's joke",
    "description": "Jack Hughes defended the U.S. men's hockey team's support for women's players after backlash over their response to President Donald Trump's joke during a gold medal call.",
    "link": "https://www.foxnews.com/sports/us-olympic-hockey-hero-jack-hughes-opens-up-support-womens-team-amid-backlash-trump-joke",
    "timestamp": "2026-03-01T01:18:42Z"
  },
  {
    "title": "Trump’s new Iran posture explained: the events that reshaped his thinking",
    "description": "The cumulative effect of stalled talks, Iran’s perceived intransigence and prior limited military actions — such as the 2020 killing of General Qassem Soleimani — appears to have emboldened Trump to adopt a more aggressive posture.",
    "link": "https://www.thehindubusinessline.com/news/world/trumps-new-iran-posture-explained-the-events-that-reshaped-his-thinking/article70690481.ece",
    "timestamp": "2026-03-01T01:18:31Z"
  },
  {
    "title": "Trump Says He Brought 'Justice' To Iran. His War Boosts Fears The U.S. Has Gone Rogue.",
    "description": "The administration’s latest escalation is boosting the global view of the U.S. as a rogue actor, fueling instability, acting illogically and illegally and risking innocent lives.",
    "link": "https://www.huffpost.com/entry/trump-justice-iran-war-boosts-fears-rogue_n_69a38e00e4b0213c06763495",
    "timestamp": "2026-03-01T01:15:25Z"
  },
  {
    "title": "2026 NAACP Image Awards Winners List",
    "description": "Star Michael B. Jordan won the top prize of Entertainer of the Year.",
    "link": "http://www.hollywoodreporter.com/movies/movie-news/2026-naacp-image-awards-winners-list-1236518330/",
    "timestamp": "2026-03-01T01:14:50Z"
  },
  {
    "title": "US, Israel defend strikes at UN, Iran alleges 'war crime'",
    "description": "The United States and Israel defended their attacks on Iran, which called resulting civilian deaths a \"war crime\" during an emergency meeting of the UN Security Council.",
    "link": "https://www.rte.ie/news/middle-east/2026/0301/1561005-us-israel-defend-strikes-at-un-iran-alleges-war-crime/",
    "timestamp": "2026-03-01T01:12:18Z"
  },
  {
    "title": "Israel, US launched strikes as Iran's Ayatollah Ali Khamenei met with inner circle, sources say",
    "description": "Israel and the U.S. timed strikes on Iran to coincide with a meeting of Supreme Leader Ali Khamenei and top aides, killing him and other leaders. Intelligence pinpointed Khamenei's movements, enabling the attack. The strikes have escalated regional conflict, …",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-us-launched-strikes-as-irans-ayatollah-ali-khamenei-met-with-inner-circle-sources-say/articleshow/128902459.cms",
    "timestamp": "2026-03-01T01:11:41Z"
  },
  {
    "title": "Dennis Quaid’s Costar Glad She ‘Got to Slap Him’ Amid His Trump Support",
    "description": "Dennis Quaid’s Any Given Sunday costar Lauren Holly took the actor to task for his support of President Donald Trump. “At least I got to slap him real hard in Any Given Sunday,” Holly, 62, joked via Threads in response to Quaid, 71, traveling with Senator Ted…",
    "link": "https://www.usmagazine.com/celebrity-news/news/dennis-quaids-costar-glad-she-got-to-slap-him-amid-his-trump-support/",
    "timestamp": "2026-03-01T01:08:57Z"
  },
  {
    "title": "Trump was once wary of ordering regime change in Iran, here's what made him change his mind",
    "description": "President Donald Trump has dramatically escalated his approach towards Iran.  Following months of stalled negotiations, Trump ordered military strikes targeting Iranian leadership.  This included the reported death of Supreme Leader Ayatollah Ali Khamenei.  T…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ayatollah-ali-khamenei-dead-trump-was-once-wary-of-ordering-regime-change-in-iran-netanyahu-middle-east-war/articleshow/128902394.cms",
    "timestamp": "2026-03-01T01:05:38Z"
  },
  {
    "title": "US, Israel defend strikes at UN as Iran alleges 'war crime'",
    "description": "The United States and Israel on Saturday defended their attacks on Iran, which called resulting civilian deaths a \"war crime\" during an emergency meeting of the U.N. Security Council.",
    "link": "https://www.hurriyetdailynews.com/us-israel-defend-strikes-at-un-as-iran-alleges-war-crime-219429",
    "timestamp": "2026-03-01T01:00:00Z"
  },
  {
    "title": "War Is Peace: Trump’s Regime-Change Reversal",
    "description": "If the United States is now kidnapping and killing dictators without direct provocation, it will come back to bite us after demolishing our moral authority in the world",
    "link": "http://www.rollingstone.com/politics/political-commentary/trump-regime-change-attack-on-iran-1235523388/",
    "timestamp": "2026-03-01T00:59:18Z"
  },
  {
    "title": "Prior to Iran attacks, CIA assessed Khamenei could be replaced by hardline IRGC elements",
    "description": "<![CDATA[ Iran's Supreme Leader Ayatollah Ali Khamenei was reportedly killed in strikes on Saturday by the US and Israel. ]]>",
    "link": "https://www.channelnewsasia.com/world/iran-khamenei-killed-replaced-irgc-cia-assess-5960841",
    "timestamp": "2026-03-01T00:52:45Z"
  },
  {
    "title": "Trump's Iran strikes came at the behest of an 'unusual pair' of allies: report",
    "description": "President Donald Trump may have been led to strike Iran alongside Israel by an \"unusual pair\" of allies, a new report revealed. The Washington Post reported on Saturday, citing four sources familiar with the matter, that Trump's decision to conduct a series o…",
    "link": "https://www.rawstory.com/trump-iran-2675462421/",
    "timestamp": "2026-03-01T00:52:20Z"
  },
  {
    "title": "Pete Hegseth Finally Comments on Iranian Strikes After Being MIA on Social Media",
    "description": "Defense Secretary Pete Hegseth finally commented on the U.S.-Israeli strikes against Iran on social media Saturday after remaining silent for most of the day.\nThe post Pete Hegseth Finally Comments on Iranian Strikes After Being MIA on Social Media first appe…",
    "link": "https://www.mediaite.com/media/news/pete-hegseth-finally-comments-on-iranian-strikes-after-being-mia-on-social-media/",
    "timestamp": "2026-03-01T00:48:53Z"
  },
  {
    "title": "Celebrations break out across the United States over strikes against Islamic Republic",
    "description": "Ding dong the Supreme Leader is dead.",
    "link": "https://nypost.com/2026/02/28/world-news/iranians-celebrate-across-the-country-over-strikes-against-islamic-republic/",
    "timestamp": "2026-03-01T00:47:44Z"
  },
  {
    "title": "World Cup Headaches Include U.S.'s Bombing Of Iran, Mexican Violence",
    "description": "Headaches and problems have piled up in the U.S. and Mexico prior to this summer's World Cup. Can they be solved prior to the June 11 kickoff?",
    "link": "https://www.forbes.com/sites/michaellewis/2026/02/28/world-cup-headaches-include-uss-bombing-of-iran-mexican-violence/",
    "timestamp": "2026-03-01T00:38:04Z"
  },
  {
    "title": "A look at Middle East figures killed by Israel in recent years",
    "description": "Since the October 7th attack, Israel has eliminated numerous senior officials from Iran's proxies, including Hamas and Hezbollah. Recent reports indicate the death of Iran's Supreme Leader Ayatollah Ali Khamenei following coordinated U.S. and Israeli strikes.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/donald-trump-ayatollah-ali-khameneia-look-at-middle-east-figures-killed-by-israel-in-recent-years-hamas-in-gaza-hezbollah-in-lebanon/articleshow/128902041.cms",
    "timestamp": "2026-03-01T00:36:53Z"
  },
  {
    "title": "What to know about Iran's Supreme Leader Ayatollah Ali Khamenei",
    "description": "Ayatollah Ali Khamenei, Iran’s Supreme Leader for nearly four decades, may have been killed in a joint U.S.-Israeli strike, according to President Donald Trump, though there was no immediate confirmation from Tehran. The development follows months of rising t…",
    "link": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-what-to-know-about-irans-supreme-leader-ayatollah-ali-khamenei/articleshow/128902028.cms",
    "timestamp": "2026-03-01T00:35:55Z"
  },
  {
    "title": "OpenAI sets limits on military AI use in new US defence deal",
    "description": "Stepping into the Pentagon vacuum, OpenAI unveiled a classified defence deal with strict safeguards — banning mass surveillance, autonomous weapons and any critical decisions made without humans in control",
    "link": "https://www.thehindubusinessline.com/info-tech/openai-sets-limits-on-military-ai-use-in-new-us-defence-deal/article70690459.ece",
    "timestamp": "2026-03-01T00:35:42Z"
  },
  {
    "title": "New Yorkers protest US strikes on Iran",
    "description": "New Yorkers protested Saturday hours after US President Donald Trump ordered a wave of deadly strikes on Iran.",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/3/1/new-yorkers-protest-us-strikes-on-iran",
    "timestamp": "2026-03-01T00:33:46Z"
  },
  {
    "title": "Lionel Messi set for first White House visit as Inter Miami accepts Donald Trump invitation",
    "description": "President Donald Trump&apos;s love for soccer continues to grow, and in a new effort to connect with the sport, he has extended an invitation to Inter Miami and Lionel Messi to vis",
    "link": "https://www.marca.com/en/football/mls/2026/03/01/69a388cd46163fc27f8b4591.html",
    "timestamp": "2026-03-01T00:33:16Z"
  },
  {
    "title": "Israel, U.S. Launched Strikes As Iranian Leader Met With Inner Circle: Reuters Report",
    "description": "The location of the meeting was not immediately clear.",
    "link": "https://www.huffpost.com/entry/israel-us-launched-strikes-as-iranian-leader-met-with-inner-circle-reuters-report_n_69a387bae4b008ee6ce252f7",
    "timestamp": "2026-03-01T00:31:22Z"
  },
  {
    "title": "SemicON: Modi launches Micron facility in Gujarat",
    "description": "The semiconductor assembly, testing, marking and packaging facility in the industrial hub of Sanand is the first of 10 projects under the India Semiconductor Mission (ISM) that has begun commercial production and shipment. It converts advanced DRAM (dynamic r…",
    "link": "https://economictimes.indiatimes.com/tech/technology/semicon-modi-launches-micron-facility-in-gujarat/articleshow/128893995.cms",
    "timestamp": "2026-03-01T00:30:00Z"
  },
  {
    "title": "Trump claims Iran’s Supreme Leader Ayatollah Ali Khamenei killed in US-Israeli strikes",
    "description": "WASHINGTON DC: US President Donald Trump has claimed that Iran’s Supreme Leader, Ayatollah Ali Khamenei, was killed in joint US-Israeli airstrikes targeting Tehran. Trump described the reported killing as “justice” for the people of Iran, Americans and others…",
    "link": "https://english.khabarhub.com/2026/01/537087/",
    "timestamp": "2026-03-01T00:29:06Z"
  },
  {
    "title": "LISA DAFTARI: Trump didn’t start a war, he ended one. And Iranians are celebrating",
    "description": "After 47 years of suffocation, Iranian people seize their own destiny as celebrations stretch from Tehran to Los Angeles in unprecedented moment of hope.",
    "link": "https://www.foxnews.com/opinion/lisa-daftari-trump-didnt-start-war-he-ended-one-iranians-celebrating",
    "timestamp": "2026-03-01T00:28:30Z"
  },
  {
    "title": "The Kennedy Center Honors Will Continue — With a New Location and Name",
    "description": "The Kennedy Center Honors will continue in a new location and with a new name while the Performing Arts Center is closed for renovations.\nThe post The Kennedy Center Honors Will Continue — With a New Location and Name first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/the-kennedy-center-honors-will-continue-with-a-new-location-and-name/",
    "timestamp": "2026-03-01T00:25:45Z"
  },
  {
    "title": "Why the Pentagon blacklisted Anthropic and what it means for military AI",
    "description": "The Pentagon designates Anthropic a supply chain risk, ending its AI contract. Here’s what the clash means for military AI, OpenAI and US tech policy.",
    "link": "https://www.thehindubusinessline.com/info-tech/why-the-pentagon-blacklisted-anthropic-and-what-it-means-for-military-ai/article70689558.ece",
    "timestamp": "2026-03-01T00:23:58Z"
  },
  {
    "title": "Iran's supreme leader Ayatollah Ali Khamenei has been killed during major attack by US and Israel, Trump says",
    "description": "A joint attack by Israel and the United States killed Iranian Supreme Leader Ayatollah Ali Khamenei, President Donald Trump announced Saturday. “Khamenei, one of the most evil people in History, is dead,” Trump wrote, warning that “heavy and pinpoint bombing”…",
    "link": "https://economictimes.indiatimes.com/news/defence/ayatollah-ali-khamenei-irans-supreme-leader-has-been-killed-during-major-attack-by-us-and-israel-trump-says/articleshow/128901878.cms",
    "timestamp": "2026-03-01T00:23:20Z"
  },
  {
    "title": "Trump says Iran's supreme leader Ali Khamenei is dead",
    "description": "US President Donald Trump celebrated the US-Israeli airstrikes that he said killed Iranian Supreme Leader Ayatollah Ali Khamenei, but warned attacks would continue.",
    "link": "https://www.rte.ie/news/world/2026/0301/1561003-trump-says-irans-supreme-leader-ali-khamenei-is-dead/",
    "timestamp": "2026-03-01T00:20:00Z"
  },
  {
    "title": "Iran announces 40 days of mourning after Khamenei death",
    "description": "Iran's Supreme Leader Ayatollah Ali Khamenei was killed, state media confirmed, after the United States and Israel launched a large-scale attack on Iran.",
    "link": "https://www.rte.ie/news/world/2026/0301/1561003-iran-khamenei/",
    "timestamp": "2026-03-01T00:20:00Z"
  },
  {
    "title": "Calgary's Iranian community wonders what's next as military action unfolds in Iran",
    "description": "Members of Calgary's Iranian community are looking to the future as a military campaign unfolds against the Islamic Republic. Rallies will be held in Calgary and Edmonton on Sunday.",
    "link": "https://www.cbc.ca/news/canada/calgary/calgary-iran-community-9.7110087",
    "timestamp": "2026-03-01T00:19:52Z"
  },
  {
    "title": "Fact-checking statements made by Trump to justify U.S. strikes on Iran",
    "description": "President Donald Trump's accusation that Iran is building nuclear weapons that could \"soon\" reach the U.S. is contradicted by a 2025 federal government assessment that said Iran is years away from the ability to produce long-range missiles.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-statements-made-by-trump-to-justify-u-s-strikes-on-iran",
    "timestamp": "2026-03-01T00:19:08Z"
  },
  {
    "title": "Key military sites targeted inside Iran as part of coordinated US-Israeli strikes",
    "description": "The U.S. and Israel targeted military and nuclear sites in airstrikes. Israeli strikes also killed more than 40 Iranian leaders, including Supreme Leader Ayatollah Ali Khamenei.",
    "link": "https://www.foxnews.com/world/key-military-sites-targeted-inside-iran-part-coordinated-us-israeli-strikes",
    "timestamp": "2026-03-01T00:18:51Z"
  },
  {
    "title": "Iran ‘top target’ hit in $10M precision strike, US Kamikaze drones used to 'overwhelm'",
    "description": "Defense expert Cameron Chell analyzes Saturday's sweeping military campaign against Iran that combined precision strikes with kamikaze drones in a coordinated U.S.-Israel operation.",
    "link": "https://www.foxnews.com/world/us-israel-launch-coordinated-military-strike-operation-killing-irans-top-leaders",
    "timestamp": "2026-03-01T00:16:54Z"
  },
  {
    "title": "Analysis: What means if Iran’s supreme leader is dead | CNN Politics",
    "description": "President Donald Trump placed a huge wager by launching a massive air assault on Iran despite having done little to prepare Americans for a new Middle East war with immense risks and years of future consequences. But the reported death of Iranian Supreme Lead…",
    "link": "https://www.cnn.com/2026/02/28/politics/supreme-leader-iran-attack-trump",
    "timestamp": "2026-03-01T00:16:01Z"
  },
  {
    "title": "Jeb Bush commends former rival Trump’s Iran op: ‘This is their time to take their country back’",
    "description": "Former Florida Gov. Jeb Bush and former Ambassador Mark Wallace praised President Donald Trump's strikes on Iranian targets that apparently left dictator Ali Hosseini Khamenei dead.",
    "link": "https://www.foxnews.com/politics/jeb-bush-commends-former-rival-trumps-iran-op-this-time-take-country-back",
    "timestamp": "2026-03-01T00:11:53Z"
  },
  {
    "title": "CNN Captures Ecstatic Pro-Iran Rally in LA After Ayatollah Is Killed: ‘People Were Jumping… Hugging Each Other, Crying’",
    "description": "CNN's Julia Vargas Jones reported live from a pro-Iran rally in LA where attendees were seen jumping around, hugging one another and crying tears of joy\nThe post CNN Captures Ecstatic Pro-Iran Rally in LA After Ayatollah Is Killed: ‘People Were Jumping… Huggi…",
    "link": "https://www.mediaite.com/media/news/cnn-captures-ecstatic-pro-iran-rally-in-la-after-ayatollah-is-killed-people-were-jumping-hugging-each-other-crying/",
    "timestamp": "2026-03-01T00:11:00Z"
  },
  {
    "title": "The U.S. Olympic men’s hockey team did it the right way",
    "description": "'Sports, at its finest, can act as a cultural common denominator for our ever-fractious and divided polity'",
    "link": "https://www.wnd.com/2026/02/u-s-olympic-mens-hockey-team-did-it/",
    "timestamp": "2026-03-01T00:10:15Z"
  }
]