[
  {
    "title": "Ex Trump adviser Bolton surrenders following charges of mishandling classified information",
    "description": "GREENBELT, Maryland (Reuters) -John Bolton, the national security hawk and former adviser to Donald Trump who has become one of the U.S. president's biggest critics, surrendered on Friday morning on charges of mishandling classified information. Read full sto…",
    "link": "https://www.thestar.com.my/news/world/2025/10/17/ex-trump-adviser-bolton-surrenders-following-charges-of-mishandling-classified-information",
    "timestamp": "2025-10-17T13:27:00Z"
  },
  {
    "title": "Illinois Released The Illegal Alien Accused Of Abusing My Daughter’s Body, So I Had To Report Him To ICE Myself",
    "description": "My daughter’s death exposes how Illinois’s criminal justice and sanctuary policies failed her. President Donald Trump is in an ongoing struggle with Illinois Gov. J.B. Pritzker, with Pritzker seeking to slander or stymie every effort Trump makes to restore la…",
    "link": "https://freerepublic.com/focus/f-news/4346913/posts",
    "timestamp": "2025-10-17T13:26:41Z"
  },
  {
    "title": "NEW: Trump Admits to Maria Bartiromo that 157% Tariffs on China Are ‘Not Sustainable’",
    "description": "President Donald Trump admitted that a 157% tariff on all Chinese goods was \"not sustainable\" before curiously adding, \"but that's where the number is.\"\nThe post NEW: Trump Admits to Maria Bartiromo that 157% Tariffs on China Are ‘Not Sustainable’ first appea…",
    "link": "https://www.mediaite.com/politics/trump/new-trump-admits-to-maria-bartiromo-that-157-tariffs-on-china-are-not-sustainable/",
    "timestamp": "2025-10-17T13:26:36Z"
  },
  {
    "title": "UK should shoot Russian jets in Nato airspace, says Farage",
    "description": "The Reform UK leader says he would send British troops as part of a UN peacekeeping force if he became prime minister.",
    "link": "https://www.bbc.com/news/articles/c051z2dm357o",
    "timestamp": "2025-10-17T13:24:17Z"
  },
  {
    "title": "Erdoğan pledges continued aid for Gaza's recovery",
    "description": "President Recep Tayyip Erdoğan has said Türkiye will maintain its support for Gaza’s reconstruction, stressing that Ankara would not lower its guard despite a newly reached ceasefire.",
    "link": "https://www.hurriyetdailynews.com/erdogan-pledges-continued-aid-for-gazas-recovery-214783",
    "timestamp": "2025-10-17T13:22:59Z"
  },
  {
    "title": "Anti-establishment anger is set to rock Senate Democratic primaries in 2026",
    "description": "It’s been nearly a decade since the last establishment-backed Democratic Senate candidate faced a close race in a primary.",
    "link": "https://themainemonitor.org/anti-establishment-anger-democratic-primaries-2026/",
    "timestamp": "2025-10-17T13:20:59Z"
  },
  {
    "title": "Trump says 100% tariffs on China not sustainable",
    "description": "US President Donald Trump said his proposed 100% tariff on goods from China would not be sustainable but blamed China for the latest impasse in trade talks that began with Beijing tightening control over its rare earth exports.",
    "link": "https://www.rte.ie/news/business/2025/1017/1539149-100-tariffs-on-china-not-sustainable-trump/",
    "timestamp": "2025-10-17T13:20:51Z"
  },
  {
    "title": "‘Enjoy Your Clickbait’: Fetterman Fires Back as Pennsylvania Democrats Plot 2028 Primary Challenge",
    "description": "Several high-profile Pennsylvania Democrats are positioning themselves for a possible 2028 Senate bid as divisions widen within the party over Sen. John Fetterman’s independent-minded record and frequent breaks from Democratic orthodoxy on issues from immigra…",
    "link": "https://www.breitbart.com/politics/2025/10/17/enjoy-your-clickbait-fetterman-fires-back-as-pennsylvania-democrats-plot-2028-primary-challenge/",
    "timestamp": "2025-10-17T13:20:13Z"
  },
  {
    "title": "Border Patrol Responds Like a Petulant Child to Controversy Over Its Antisemitic Video",
    "description": "The Trump regime exercises real power. Why are they so whiny about it?",
    "link": "https://gizmodo.com/border-patrol-responds-like-a-petulant-child-to-controversy-over-its-antisemitic-video-2000673314",
    "timestamp": "2025-10-17T13:20:00Z"
  },
  {
    "title": "Gold price falls on Friday after hitting record high-level. Check latest gold rate prediction",
    "description": "Gold rate fell on Friday after U.S. President Donald Trump said his proposed 100 per cent tariff on goods from China would not be sustainable.",
    "link": "https://economictimes.indiatimes.com/news/international/us/gold-price-falls-on-friday-after-hitting-record-high-level-check-latest-gold-rate-prediction/articleshow/124631817.cms",
    "timestamp": "2025-10-17T13:19:43Z"
  },
  {
    "title": "How A Second Immigration Lawsuit Threatens Trump’s $100,000 H-1B Fee",
    "description": "America’s largest business organization filed a lawsuit against the Trump administration’s $100,000 fee on H-1B visa holders.",
    "link": "https://www.forbes.com/sites/stuartanderson/2025/10/17/how-a-second-immigration-lawsuit-threatens-trumps-100000-h-1b-fee/",
    "timestamp": "2025-10-17T13:17:10Z"
  },
  {
    "title": "BlackRock, Binance, and Coinbase dump $1.1 billion in Bitcoin in 6 hours – here’s what we know",
    "description": "Big companies like BlackRock, Binance, and Coinbase sold $1.1 billion in Bitcoin in just 6 hours, causing the crypto market to drop. Bitcoin fell below $110,000, while ETFs saw large outflows. Traders are cautious as technical signals show weakness. Experts s…",
    "link": "https://economictimes.indiatimes.com/news/international/us/blackrock-binance-and-coinbase-dump-1-1-billion-in-bitcoin-in-6-hours-heres-what-we-know/articleshow/124631609.cms",
    "timestamp": "2025-10-17T13:16:21Z"
  },
  {
    "title": "Trump Says China Tariffs 'Won't Stand' — But Bitcoin Crashes 5% Anyway",
    "description": "Bitcoin (CRYPTO: BTC) fell below $104,000 on Friday before president Donald Trump said high tariffs on China \"will not stand,\" easing trade tensions but doing little to stop the market's decline.\nTrump's Tariff Comments Fail To Rescue Bitcoin Price\nBitcoin st…",
    "link": "https://biztoc.com/x/ccba8a787320cfee",
    "timestamp": "2025-10-17T13:15:34Z"
  },
  {
    "title": "John Bolton, fierce Trump critic, surrenders after being criminally indicted. What are the charges against him?",
    "description": "John Bolton, former aide of US President Donald Trump and now a vocal critic, has surrendered to authorities after he was indicted on charges of mishandling classified documentation. It’s the third time in recent weeks that the Department of Justice has charg…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-john-bolton-fierce-trump-critic-surrenders-after-being-criminally-indicted-what-are-the-charges-against-him/articleshow/124631696.cms",
    "timestamp": "2025-10-17T13:15:28Z"
  },
  {
    "title": "Trump Says Threatened High Tariffs On China 'Not Sustainable'",
    "description": "President Donald Trump said high threatened tariffs with China were not viable as tensions between the world’s two largest economies intensify ahead of an expected face-to-face meeting with Chinese counterpart Xi Jinping.",
    "link": "https://www.ndtvprofit.com/world/trump-says-threatened-high-tariffs-on-china-not-sustainable",
    "timestamp": "2025-10-17T13:14:21Z"
  },
  {
    "title": "Ex-Trump adviser Bolton in court to face charges of mishandling classified documents",
    "description": "Prosecutors accuse Bolton of using personal messaging apps and email to illegally transmit sensitive information.",
    "link": "https://www.bbc.com/news/articles/cg43lwwdwlno",
    "timestamp": "2025-10-17T13:14:10Z"
  },
  {
    "title": "Unmasking the Dangerous Extremism in Young Republicans",
    "description": "Just this week, Politico exposed private Telegram chats among Young Republican leaders where they didn’t just flirt with Nazi-style extremism, they reveled in it.In thousands of leaked messages from across the nation, rising GOP stars praised Adolf Hitler, jo…",
    "link": "https://www.commondreams.org/opinion/young-republicans-fascist",
    "timestamp": "2025-10-17T13:13:04Z"
  },
  {
    "title": "Dramatic hours at the IMO for the green shipping transition",
    "description": "The decision on whether or not to approve the IMO's measures for the decarbonisation of shipping is on the knife edge\nThe post Dramatic hours at the IMO for the green shipping transition appeared first on ProtoThema English.",
    "link": "https://en.protothema.gr/2025/10/17/dramatic-hours-at-the-imo-for-the-green-shipping-transition/",
    "timestamp": "2025-10-17T13:11:51Z"
  },
  {
    "title": "South Park Can’t Quit Trump Micropenis Gags and Throws In a Conspiring Vance, Antichrist-Obsessed Peter Thiel",
    "description": "South Park continued its brutal satire of President Donald Trump in their latest episode, depicting him masturbating with tweezers and chopsticks.\nThe post South Park Can’t Quit Trump Micropenis Gags and Throws In a Conspiring Vance, Antichrist-Obsessed Peter…",
    "link": "https://www.mediaite.com/media/entertainment/south-park-cant-quit-trump-micropenis-gags-and-throws-in-a-conspiring-vance-antichrist-obsessed-peter-thiel/",
    "timestamp": "2025-10-17T13:09:32Z"
  },
  {
    "title": "EU supports Trump-Putin meet in Budapest if serves peace",
    "description": "Hungary's withdrawal from the International Criminal Court is to take effect in June 2026, and it technically remains a party to the court until then",
    "link": "https://www.euractiv.com/news/eu-supports-trump-putin-meet-in-budapest-if-serves-peace/",
    "timestamp": "2025-10-17T13:08:15Z"
  },
  {
    "title": "Japan Should Defend the International Criminal Court",
    "description": "Click to expand Image\n \n\n\n\n \n \n \n\n \n \n \n \n Japanese Diet member Yasue Funayama speaks at a nongovernmental organization event to advocate for Japan to step up its efforts to defend the International Criminal Court, Tokyo, October 9, 2025. \n © 2025 Haruka Miya…",
    "link": "https://www.hrw.org/news/2025/10/17/japan-should-defend-the-international-criminal-court",
    "timestamp": "2025-10-17T13:01:55Z"
  },
  {
    "title": "More than eight in 10 Canadians Support a “Buy Canadian” Mandate Requiring Government Advertising Spending to Support Canadian-Owned Media Companies and Platforms",
    "description": "Most (85%) Agree It’s More Important than Ever for Canada to Have a Strong and Independent News Media that Tells Canada’s Story to Canadians TORONTO, Oct. 17, 2025 (GLOBE NEWSWIRE) — More than eight in 10 (83%) Canadians support (42% strongly /41% somewhat) t…",
    "link": "https://financialpost.com/globe-newswire/more-than-eight-in-10-canadians-support-a-buy-canadian-mandate-requiring-government-advertising-spending-to-support-canadian-owned-media-companies-and-platforms",
    "timestamp": "2025-10-17T13:01:02Z"
  },
  {
    "title": "Trump aims for one-party rule — and puts despotism at our doorstep",
    "description": "The president's ruthless consolidation of power is continuing unabated",
    "link": "https://www.salon.com/2025/10/17/trump-aims-for-one-party-rule-and-puts-despotism-at-our-doorstep/",
    "timestamp": "2025-10-17T13:00:56Z"
  },
  {
    "title": "4 things to know about Saturday’s 'No Kings' protest in Richmond",
    "description": "On Saturday, Richmond will be among American cities to serve as the site of a \"No Kings II\" protest: a nationwide demonstration against the administration of President Donald Trump.",
    "link": "https://richmond.com/news/local/government-politics/article_a8ea05b6-1aa9-4a17-b05e-3151b27c5904.html",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "Anti-Fascists in Cutesy Animal Costumes Are Warm and Cuddly, According to NYT, WaPo",
    "description": "The “fact-checkers” who pick apart President Donald Trump on a daily basis took exception to this recent presidential overstatement: “Portland [Oregon] is burning to the... Read More\nThe post Anti-Fascists in Cutesy Animal Costumes Are Warm and Cuddly, Accord…",
    "link": "https://www.dailysignal.com/2025/10/17/nobody-should-demonize-anti-fascists-cutesy-animal-costumes/",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "How Putin’s history lecture in Alaska nudged Trump closer to Ukraine",
    "description": "A chilly meeting in Anchorage appears to have changed the temperature of the US-Russia relationship",
    "link": "https://www.irishtimes.com/world/europe/2025/10/17/how-putins-history-lecture-in-alaska-nudged-trump-closer-to-ukraine/",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "More than eight in 10 Canadians Support a “Buy Canadian” Mandate Requiring Government Advertising Spending to Support Canadian-Owned Media Companies and Platforms",
    "description": "Majority of Canadians support a Buy Canadian rule for the federal government to spend most of its advertising budget with Canadian-owned media companies",
    "link": "https://www.globenewswire.com/news-release/2025/10/17/3168637/0/en/More-than-eight-in-10-Canadians-Support-a-Buy-Canadian-Mandate-Requiring-Government-Advertising-Spending-to-Support-Canadian-Owned-Media-Companies-and-Platforms.html",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "On Substack, TV News Personalities Find a 2nd — and Successful — Life",
    "description": "Journalists who built their careers in television are finding comparable levels of success, letting them scale themselves up outside of their former corporate confines\nThe post On Substack, TV News Personalities Find a 2nd — and Successful — Life appeared fir…",
    "link": "https://www.thewrap.com/substack-success-for-journalists-mehdi-hasan-joy-reid/",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "My Robot Brain Is Frying",
    "description": "John Bolton indicted... but of course it was a politically motivated action that wouldn't have happened otherwise... but also maybe he deserves it... also he's John Bolton?\nJohn Bolton, President Donald Trump’s former national security adviser-turned-adversar…",
    "link": "https://www.eschatonblog.com/2025/10/my-robot-brain-is-frying.html",
    "timestamp": "2025-10-17T13:00:00Z"
  },
  {
    "title": "Global equity funds draw fourth weekly inflow on hopes of Fed rate cut",
    "description": "(Reuters) -Global equity funds attracted inflows for a fourth straight week through October 15, as dovish comments from U.S.",
    "link": "https://finance.yahoo.com/news/global-equity-funds-draw-fourth-125903101.html",
    "timestamp": "2025-10-17T12:59:03Z"
  },
  {
    "title": "Putin aide proposes direct Russia-US tunnel",
    "description": "Kirill Dmitriev has invited Elon Musk to build a Russia-Alaska tunnel, saying his infrastructure firm could complete it in under eight years Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626605-putin-aide-russia-us-tunnel/",
    "timestamp": "2025-10-17T12:56:09Z"
  },
  {
    "title": "US Attorney Boxwine Can’t Convict Her Way Out Of A Paper [SLOSH!] Ham Sandwich",
    "description": "Best people.",
    "link": "https://www.wonkette.com/p/us-attorney-boxwine-cant-convict",
    "timestamp": "2025-10-17T12:56:07Z"
  },
  {
    "title": "Hochul's office silent when pressed if she sticks by 'no one is above the law' belief amid AG's indictment",
    "description": "Governor Kathy Hochul defends Attorney General Letitia James against federal indictment, claiming weaponization despite previously supporting Trump legal challenges.",
    "link": "https://www.foxnews.com/politics/hochuls-office-silent-when-pressed-she-sticks-no-one-above-law-belief-amid-ags-indictment",
    "timestamp": "2025-10-17T12:55:53Z"
  },
  {
    "title": "Democratic Leader Warns Stephen Miller Is “Taking Advantage” of Trump",
    "description": "Illinois Governor JB Pritzker slammed White House deputy Chief of Staff Stephen Miller, claiming that the ghoulish policy adviser was committing elder abuse against President Donald Trump.During an interview on MSNBC Thursday about Trump’s federal takeover of…",
    "link": "https://newrepublic.com/post/201916/democratic-jb-pritzker-stephen-miller-taking-advantage-donald-trump",
    "timestamp": "2025-10-17T12:55:34Z"
  },
  {
    "title": "Trump Announces IVF Drug Pricing Deal That Will Lower Costs",
    "description": "President Donald Trump announced on Thursday two new efforts aimed at making in vitro fertilization more affordable. The White House says it struck a deal with two specialty pharmacies and a drug manufacturer to lower the cost of a commonly prescribed fertili…",
    "link": "https://www.today.com/video/trump-announces-efforts-to-expand-access-to-ivf-drugs-250085445786",
    "timestamp": "2025-10-17T12:54:38Z"
  },
  {
    "title": "Key U.S. admiral parts ways with Hegseth’s Pentagon amid controversial boat strikes",
    "description": "As the head of U.S. Southern Command steps down at a critical moment, a key senator is raising alarm about “instability within the chain of command.”",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/key-us-admiral-parts-ways-hegseths-pentagon-controversial-boat-strikes-rcna238150",
    "timestamp": "2025-10-17T12:53:23Z"
  },
  {
    "title": "‘Godfather of Silicon Valley’ Torches Billionaire CEO’s Trump Support in Scathing Resignation",
    "description": "A venture capitalist has quit the board of his company’s philanthropic arm, blasting the CEO for backing Donald Trump and urging National Guard troops to be ...",
    "link": "https://www.thedailybeast.com/ron-conwaytorches-marc-benioffs-donald-trump-support-in-scathing-resignation-from-salesforce-foundation/",
    "timestamp": "2025-10-17T12:51:23Z"
  },
  {
    "title": "CNN’s Kaitlan Collins Confronts Eric Trump Over Bombshell Hot Mic Moment",
    "description": "CNN anchor Kaitlan Collins confronted First Son Eric Trump over President Donald Trump’s hot mic moment arranging a business call.\nThe post CNN’s Kaitlan Collins Confronts Eric Trump Over Bombshell Hot Mic Moment first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/cnns-kaitlan-collins-confronts-eric-trump-over-bombshell-hot-mic-moment/",
    "timestamp": "2025-10-17T12:50:54Z"
  },
  {
    "title": "‘We need a big bang’: The defence industry’s push to shape Europe’s military rearmament",
    "description": "Internal documents show defence firms sought €100bn EU fund to shore up Europe’s security",
    "link": "https://www.irishtimes.com/world/europe/2025/10/18/we-need-a-big-bang-the-defence-industrys-push-to-shape-europes-military-rearmament/",
    "timestamp": "2025-10-17T12:50:00Z"
  },
  {
    "title": "Hungary vows safe passage for Putin for US-Russia summit",
    "description": "Orbán is Trump's and Putin's closest ally in the EU, and a staunch critic of Western support for Kyiv",
    "link": "https://www.euractiv.com/news/hungary-vows-safe-passage-for-putin-for-us-russia-summit/",
    "timestamp": "2025-10-17T12:49:24Z"
  },
  {
    "title": "Live updates: John Bolton arrives at federal court in Maryland a day after being indicted | CNN Politics",
    "description": "Former Trump national security adviser John Bolton faces eight counts of transmission of national defense information and 10 counts of retention of national defense information. Follow for live updates.",
    "link": "https://www.cnn.com/politics/live-news/john-bolton-indictment-10-17-25",
    "timestamp": "2025-10-17T12:49:09Z"
  },
  {
    "title": "Trump says 100% tariffs on China not sustainable",
    "description": "President Trump stated his proposed 100% tariff on Chinese goods is unsustainable but necessary due to China's actions on rare earth exports. He announced new tariffs and export controls as a reaction to Beijing tightening its grip on these critical elements.…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-says-100-tariffs-on-china-not-sustainable/articleshow/124630944.cms",
    "timestamp": "2025-10-17T12:48:20Z"
  },
  {
    "title": "Ahead of Zelenskyy meeting, Trump shows signs he might not be ready to send Kyiv Tomahawk missiles",
    "description": "WASHINGTON, DC: President Donald Trump is set to host Ukrainian President Volodymyr Zelenskyy at the White House on Friday, as the U.S. leader signals he is not yet ready to approve Kyiv’s request for long-range missile systems. The meeting comes a day after …",
    "link": "https://english.khabarhub.com/2025/17/501794/",
    "timestamp": "2025-10-17T12:45:37Z"
  },
  {
    "title": "Shocker: ‘No Kings Protest’ in New York City on Saturday Is Sponsored by Several Communist Groups",
    "description": "Democrats and Communists, or Communist Democrats, are holding a “No Kings” rally Saturday in cities around the country.\nThe post Shocker: ‘No Kings Protest’ in New York City on Saturday Is Sponsored by Several Communist Groups appeared first on The Gateway Pu…",
    "link": "https://www.thegatewaypundit.com/2025/10/shocker-no-kings-protest-new-york-city-saturday/",
    "timestamp": "2025-10-17T12:45:05Z"
  },
  {
    "title": "MTG Slams Mike Johnson’s Failure to Negotiate on Shutdown: ‘Republicans Have No Plan’",
    "description": "Greene slammed Johnson for failing to hold a “single meeting” to discuss budget strategy as the shutdown continues and said her party has “no plan.”\nThe post MTG Slams Mike Johnson’s Failure to Negotiate on Shutdown: ‘Republicans Have No Plan’ first appeared …",
    "link": "https://www.mediaite.com/media/news/mtg-slams-mike-johnsons-failure-to-negotiate-on-shutdown-republicans-have-no-plan/",
    "timestamp": "2025-10-17T12:44:29Z"
  },
  {
    "title": "John Bolton to surrender to authorities after federal indictment",
    "description": "WASHINGTON — John Bolton, who served as President Donald Trump's national security adviser during his first term, is expected to surrender to authorities today, two senior federal law enforcement officials told NBC News yesterday after he was indicted by a fe…",
    "link": "https://www.nbcnews.com/politics/justice-department/john-bolton-surrender-authorities-federal-indictment-rcna238146",
    "timestamp": "2025-10-17T12:43:45Z"
  },
  {
    "title": "Trump Treasury Sec. Bessent to speak with Chinese trade counterpart on Friday",
    "description": "Treasury Secretary Scott Bessent will speak by phone on Friday with Chinese Vice Premier He Lifeng, a senior Trump administration official told CNBC.",
    "link": "https://www.cnbc.com/2025/10/17/bessent-china-trade-lifeng.html",
    "timestamp": "2025-10-17T12:40:11Z"
  },
  {
    "title": "Democrats To Keep Government Shut Down Through Anti-Trump ‘No Kings’ Rally",
    "description": "Senate Minority Leader Chuck Schumer, under pressure from the party’s ascendent left flank to hold the line on the government shutdown, may win a moment of approval before a crowd of the party’s base voters during the weekend. Congressional Democrats, includi…",
    "link": "https://dailycaller.com/2025/10/17/democrats-government-shutdown-no-kings-rally-washington-dc/",
    "timestamp": "2025-10-17T12:39:43Z"
  },
  {
    "title": "Linguistics expert contrasts Trump's praise toward women versus men: 'Much more creepy'",
    "description": "President Donald Trump has long remarked on people’s physical appearance, but according to linguistics professor Deborah Tannen, the president has demonstrated a stark difference in the way he comments on the appearance of women when compared to men.“There ha…",
    "link": "https://www.rawstory.com/trump-2674208342/",
    "timestamp": "2025-10-17T12:37:49Z"
  },
  {
    "title": "Excitement in the Kremlin at prospect of Trump-Putin meet",
    "description": "There is excitement in the Kremlin about a new round of US-Russia talks, which Russian commentators see as suggesting that all of Ukraine's European allies are side-lined in the negotiations.",
    "link": "https://www.rte.ie/news/world/2025/1017/1539133-putin-summit-analysis/",
    "timestamp": "2025-10-17T12:37:41Z"
  },
  {
    "title": "‘Deport Harry Sisson’ trend explodes on X, raising eyebrows about Democratic influencer's citizenship. What's the truth?",
    "description": "Calls to 'Deport Harry Sisson' trended on X after the DNC-aligned influencer criticized Trump's Middle East peace deal. Despite being a US citizen born in Singapore to Irish parents, MAGA loyalists demanded his deportation, questioning his American identity a…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-deport-harry-sisson-trend-explodes-online-on-x-raising-eyebrows-about-democratic-influencers-citizenship-whats-the-truth/articleshow/124630294.cms",
    "timestamp": "2025-10-17T12:37:33Z"
  },
  {
    "title": "Bolton arrives at court to surrender to authorities on charges in classified information case",
    "description": "John Bolton is expected to surrender to authorities and make his first court appearance.",
    "link": "https://www.denverpost.com/2025/10/17/john-bolton-indictment-surrender/",
    "timestamp": "2025-10-17T12:36:17Z"
  },
  {
    "title": "Bolton is expected to surrender after indictment over his handling of classified information",
    "description": "John Bolton is expected to surrender to authorities and make his first court appearance.",
    "link": "https://www.bostonherald.com/2025/10/17/john-bolton-indictment-surrender/",
    "timestamp": "2025-10-17T12:36:17Z"
  },
  {
    "title": "How many times has the US struck Venezuelan vessels?",
    "description": "There have been at least six incidents of US strikes on boats in Venezuelan waters since the beginning of September.",
    "link": "https://www.aljazeera.com/news/2025/10/17/how-many-times-has-the-us-struck-venezuelan-vessels",
    "timestamp": "2025-10-17T12:32:10Z"
  },
  {
    "title": "Spain tops FIFA men's rankings, Germany set to be among top seeds in World Cup draw",
    "description": "Spain still topped the FIFA men’s world rankings published Friday that show Germany back on track to be a top-seeded team in the World Cup finals tournament draw on Dec. 5 involving U.S. President Donald Trump. Germany rose two places to No. 10 after back-to-…",
    "link": "https://sports.yahoo.com/article/spain-tops-fifa-mens-rankings-123128591.html",
    "timestamp": "2025-10-17T12:31:28Z"
  },
  {
    "title": "What is the Political Significance of the John Bolton Indictment?",
    "description": "Moderator of Meet the Press Kristin Welker joins TODAY to break down the political significance of the indictment of former Trump National Security Adviser John Bolton. She also breaks down what to expect from President Donald Trump’s meeting with Ukrainian p…",
    "link": "https://biztoc.com/x/22768e6d1614ea6d",
    "timestamp": "2025-10-17T12:31:18Z"
  },
  {
    "title": "“Prepare For War”: B-52s Circle Near Venezuela, Ukraine Is Very Close To Getting Tomahawk Cruise Missiles",
    "description": "When hundreds of America’s admirals and generals gathered at a military base in Virginia on September 30th, Secretary of Defense Pete Hegseth instructed them to “prepare for war”.  Unfortunately, he was not exaggerating.  We are on the brink of war with Venez…",
    "link": "https://www.shtfplan.com/headline-news/prepare-for-war-b-52s-circle-near-venezuela-ukraine-is-very-close-to-getting-tomahawk-cruise-missiles",
    "timestamp": "2025-10-17T12:30:37Z"
  },
  {
    "title": "Don Lemon tells Black, Brown citizens to carry guns in case ICE shows up",
    "description": "Former CNN anchor Don Lemon advised “Brown people of all stripes\" on Tuesday to buy a gun to protect themselves from an immigration raid at their homes.",
    "link": "https://www.foxnews.com/media/don-lemon-tells-black-brown-citizens-carry-guns-case-ice-shows-up",
    "timestamp": "2025-10-17T12:30:14Z"
  },
  {
    "title": "Sharad Kelkar calls wife Keerti ‘light of his life’; gifts her every Dhanteras that ‘she selects herself’ - Exclusive",
    "description": "Actor Sharad Kelkar is gearing up for Diwali, highlighting his wife Keerti as the 'light of his life' who simplifies his world. He revealed that Keerti selects her own Dhanteras gift, a tradition he meticulously plans for. Kelkar also emphasizes extending Diw…",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/sharad-kelkar-calls-wife-keerti-light-of-his-life-gifts-her-every-dhanteras-that-she-selects-herself-exclusive/articleshow/124629737.cms",
    "timestamp": "2025-10-17T12:30:09Z"
  },
  {
    "title": "Trump signals easing stance on China tariffs ahead of Xi meeting",
    "description": "Investing.com -- President Donald Trump indicated Friday that the high tariffs imposed on Chinese goods will not remain in place long-term, signaling a...",
    "link": "https://finance.yahoo.com/news/trump-signals-easing-stance-china-122820078.html",
    "timestamp": "2025-10-17T12:28:20Z"
  },
  {
    "title": "China’s rare earth controls",
    "description": "Beijing has shocked Washington with export restrictions on minerals used in most electronics",
    "link": "https://theweek.com/business/chinas-rare-earth-controls-trump",
    "timestamp": "2025-10-17T12:28:18Z"
  },
  {
    "title": "Sex is a big market for the AI industry. ChatGPT won’t be the first to try to profit from it",
    "description": "OpenAI has announced that ChatGPT will soon engage in \"erotica for verified adults.\"",
    "link": "https://www.denverpost.com/2025/10/17/chatgpt-erotica-verified-adults/",
    "timestamp": "2025-10-17T12:27:51Z"
  },
  {
    "title": "Sex is a big market for the AI industry. ChatGPT won’t be the first to try to profit from it",
    "description": "OpenAI has announced that ChatGPT will soon engage in \"erotica for verified adults.\"",
    "link": "https://www.bostonherald.com/2025/10/17/chatgpt-erotica-verified-adults/",
    "timestamp": "2025-10-17T12:27:51Z"
  },
  {
    "title": "Shark Tank India 5: Mohit Yadav joins as the newest shark, says “I’m excited to be a part of the show”",
    "description": "Skincare entrepreneur Mohit Yadav, co-founder of Minimalist, is the newest shark joining Shark Tank India Season 5. A Chartered Accountant with 15 years of experience, Yadav brings a science-backed, transparent approach to business. His addition promises shar…",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/shark-tank-india-5-mohit-yadav-joins-as-the-newest-shark-says-im-excited-to-be-a-part-of-the-show/articleshow/124628828.cms",
    "timestamp": "2025-10-17T12:27:44Z"
  },
  {
    "title": "Apple CEO Tim Cook Promises Chinese Officials the Company Will Continue to Invest There",
    "description": "Apple CEO Tim Cook recently visited China, where he assured government officials that the technology company will continue to make investments in the communist country.Read More...",
    "link": "https://www.mactrast.com/2025/10/apple-ceo-tim-cook-promises-chinese-officials-the-company-will-continue-to-invest-there/",
    "timestamp": "2025-10-17T12:27:44Z"
  },
  {
    "title": "Trump shows little urgency to intervene in shutdown talks",
    "description": "President Trump stays on the sidelines as government shutdown drags on",
    "link": "https://www.wmur.com/article/trump-government-shutdown-stalemate/69071379",
    "timestamp": "2025-10-17T12:27:18Z"
  },
  {
    "title": "Trump shows little urgency to intervene in shutdown talks",
    "description": "President Trump stays on the sidelines as government shutdown drags on",
    "link": "https://www.wcvb.com/article/trump-government-shutdown-stalemate/69071379",
    "timestamp": "2025-10-17T12:27:11Z"
  },
  {
    "title": "U.S. Chamber of Commerce sues Trump administration over $100,000 H-1B visa fee",
    "description": "In a federal lawsuit, the Chamber asks the court to declare that President Donald Trump exceeded the executive branch’s authority by imposing the fee and bloc federal government agencies from enfor…",
    "link": "https://www.mercurynews.com/2025/10/17/u-s-chamber-of-commerce-sues-trump-administration-over-100000-h-1b-visa-fee/",
    "timestamp": "2025-10-17T12:26:25Z"
  },
  {
    "title": "ADM busca atrair vendas de soja de agricultores dos EUA conforme preços caem",
    "description": "ADM busca atrair vendas de soja de agricultores dos EUA conforme preços caem, dizem fontes\nThe post ADM busca atrair vendas de soja de agricultores dos EUA conforme preços caem appeared first on InfoMoney.",
    "link": "https://www.infomoney.com.br/mundo/adm-busca-atrair-vendas-de-soja-de-agricultores-dos-eua-conforme-precos-caem/",
    "timestamp": "2025-10-17T12:26:16Z"
  },
  {
    "title": "Actress Sheetal Maulik on finding light amid chaos; says ‘Kindness and gratitude keep the spirit of Diwali alive’",
    "description": "Actress Sheetal Maulik is embracing Diwali with a focus on peace, gratitude, and compassion this year. She finds hope in acts of humanity and believes that kindness and self-confidence are the true lights to ignite within. Maulik plans a quiet family getaway …",
    "link": "https://timesofindia.indiatimes.com/tv/news/hindi/actress-sheetal-maulik-on-finding-light-amid-chaos-says-kindness-and-gratitude-keep-the-spirit-of-diwali-alive/articleshow/124629920.cms",
    "timestamp": "2025-10-17T12:24:24Z"
  },
  {
    "title": "Ahead of meeting with China's Xi, Trump says Beijing 'forced' him to impose steep tariffs",
    "description": "President Trump stated that China \"forced\" him to impose steep tariffs on its goods, calling the current situation unsustainable. Amid renewed trade tensions, the US and China are preparing for a crucial meeting between Trump and President Xi Jinping. Trump e…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/ahead-of-meeting-with-chinas-xi-trump-says-beijing-forced-him-to-impose-steep-tariffs/articleshow/124629827.cms",
    "timestamp": "2025-10-17T12:20:42Z"
  },
  {
    "title": "Posthaste: Don't let Trump supporters fool you. The U.S. economy might not be all right",
    "description": "Donald Trump\n \n \n \n \n \n \n \n \n \n supporters, such as Robert Lighthizer, the United States trade representative during the president’s first term, trumpeted that economists got it all wrong on \n \n \n \n \n \n \n \n \n \n tariffs\n \n \n \n \n \n \n \n \n \n and the American econ…",
    "link": "https://biztoc.com/x/2da5ba71f2ba92f3",
    "timestamp": "2025-10-17T12:20:11Z"
  },
  {
    "title": "'Cockroach' hunting, Bolton indicted, Apple eyes F1 and more in Morning Squawk",
    "description": "Here are five key things investors need to know to start the trading day.",
    "link": "https://www.cnbc.com/2025/10/17/5-things-to-know-before-the-stock-market-opens.html",
    "timestamp": "2025-10-17T12:18:58Z"
  },
  {
    "title": "John Bolton indicted for sharing classified information",
    "description": "John Bolton, Donald Trump's former national security advisor, was indicted today - the third foe of the US president to be hit with criminal charges in recent weeks.",
    "link": "https://www.rte.ie/news/world/2025/1017/1539123-john-bolton-indicted/",
    "timestamp": "2025-10-17T12:18:02Z"
  },
  {
    "title": "Stocks tumble as credit jitters deepen bank losses",
    "description": "Stocks fell as losses in U.S. lenders deepened, with doubts over regional banks’ credit health prompting traders to cut risk. Read more.",
    "link": "https://financialpost.com/investing/stocks-tumble-credit-jitters-deepen-bank-losses",
    "timestamp": "2025-10-17T12:17:52Z"
  },
  {
    "title": "Lia Thomas speaks for first time since UPenn agreed to Trump admin resolution to protect women's sports",
    "description": "Transgender swimmer Lia Thomas spoke publicly for the first time since the University of Pennsylvania stripped her records in compliance with the Trump administration.",
    "link": "https://www.foxnews.com/sports/lia-thomas-speaks-first-time-since-upenn-agreed-trump-admin-resolution-protect-womens-sports",
    "timestamp": "2025-10-17T12:17:14Z"
  },
  {
    "title": "Top 5 moments from fiery NYC mayoral debate: 'He literally has never had a job'",
    "description": "The pressure was on former Gov. Andrew Cuomo and Republican Curtis Sliwa to break through to voters and deliver a blow to socialist Zohran Mamdani at the New York City mayoral debate.",
    "link": "https://www.foxnews.com/politics/top-5-moments-from-fiery-nyc-mayoral-debate-never-had-job",
    "timestamp": "2025-10-17T12:15:58Z"
  },
  {
    "title": "Donald Trump: America First globalist (Marc Caputo/Axios)",
    "description": "Marc Caputo / Axios:\nDonald Trump: America First globalist  —  There's a shutdown in D.C., clashes in Chicago, and economic worries bubbling up all over the country — but at the moment, President Trump seems more focused on Gaza, Ukraine and Venezuela. … But …",
    "link": "https://www.memeorandum.com/251017/p15",
    "timestamp": "2025-10-17T12:10:01Z"
  },
  {
    "title": "Trump Says $20 Billion Project Schumer Wants Is 'Pretty Much Dead' (Bloomberg)",
    "description": "Bloomberg:\nTrump Says $20 Billion Project Schumer Wants Is ‘Pretty Much Dead’  —  President Donald Trump said the government shutdown had given him license to eliminate “a $20 billion project” in Senate Democratic Leader Chuck Schumer's home state of New York…",
    "link": "https://www.memeorandum.com/251017/p17",
    "timestamp": "2025-10-17T12:10:01Z"
  },
  {
    "title": "Sex is a big market for the AI industry. ChatGPT won’t be the first to try to profit from it",
    "description": "ChatGPT will be able to have kinkier conversations after OpenAI CEO Sam Altman announced the artificial intelligence company will soon allow its chatbot to engage in “erotica for verified adults.” OpenAI won’t be the first to try to profit from sexualized AI.…",
    "link": "https://financialpost.com/pmn/sex-is-a-big-market-for-the-ai-industry-chatgpt-wont-be-the-first-to-tap-it",
    "timestamp": "2025-10-17T12:09:22Z"
  },
  {
    "title": "Hassett denies US is in trade war with China",
    "description": "United States National Economic Council (NEC) Director Kevin Hassett said on Friday that the US is not in a trade war with China, contradicting claims by US President Donald Trump. He acknowledged tha...",
    "link": "https://biztoc.com/x/085fa62b02225d8b",
    "timestamp": "2025-10-17T12:09:18Z"
  },
  {
    "title": "Donald Trump Suffers Double Legal Setback Within Hours",
    "description": "Trump’s double loss saw judges in Illinois and New York curb his authority over the National Guard and anti-terror grants.",
    "link": "https://biztoc.com/x/ed58876c1bcbab29",
    "timestamp": "2025-10-17T12:09:06Z"
  },
  {
    "title": "India's Russian oil imports rebound in October after dip in previous quarter",
    "description": "Russian oil imports to India rebound in October, but diversification from US and Middle East remains challenging.",
    "link": "https://www.thehindubusinessline.com/markets/commodities/indias-russian-oil-imports-rebound-in-october-after-dip-in-previous-quarter/article70175028.ece",
    "timestamp": "2025-10-17T12:07:59Z"
  },
  {
    "title": "Orban’s Re-Election Hopes Get a Shot in Arm From Trump and Putin",
    "description": "Viktor Orban has been handed a moment in the global spotlight, and with it an opportunity to lift his campaign for re-election in Hungary next year.",
    "link": "https://financialpost.com/pmn/business-pmn/orbans-re-election-hopes-get-a-shot-in-arm-from-trump-and-putin",
    "timestamp": "2025-10-17T12:06:48Z"
  },
  {
    "title": "Sex is a big market for the AI industry; ChatGPT won't be the first to tap it",
    "description": "OpenAI won't be the first to try to profit from sexualised AI. Sexual content was a top draw for AI tools almost as soon as the boom in AI-generated imagery and words erupted in 2022. After three years of largely banning mature content, Altman said Wednesday …",
    "link": "https://economictimes.indiatimes.com/tech/artificial-intelligence/sex-is-a-big-market-for-the-ai-industry-chatgpt-wont-be-the-first-to-tap-it/articleshow/124629438.cms",
    "timestamp": "2025-10-17T12:06:23Z"
  },
  {
    "title": "Posthaste: Don’t let Trump supporters fool you. The U.S. economy might not be all right",
    "description": "Economist David Rosenberg said U.S. consumers' finances are fraying, jobs are being cut and growth forecasts are likely overstated. Read on.",
    "link": "https://financialpost.com/news/u-s-economy-showing-signs-strain-even-without-data",
    "timestamp": "2025-10-17T12:06:17Z"
  },
  {
    "title": "Ahead of Zelenskyy meeting, Trump shows signs he might not be ready to send Kyiv Tomahawk missiles",
    "description": "Following Thursday’s call with Putin, Trump appeared to downplay the prospects of Ukraine getting the missiles.",
    "link": "https://www.bostonherald.com/2025/10/17/trump-zelenskyy-meeting-tomahawk-missiles/",
    "timestamp": "2025-10-17T12:04:32Z"
  },
  {
    "title": "Businesses Warn of Labor Shortages as Trump Faces Lawsuit Over H-1B Visa Costs",
    "description": "US businesses sue Trump administration over $100,000 H-1B visa fee, warning of labor shortages.",
    "link": "https://www.ibtimes.com/businesses-warn-labor-shortages-trump-faces-lawsuit-over-h-1b-visa-costs-3787406",
    "timestamp": "2025-10-17T12:02:54Z"
  },
  {
    "title": "Trump refiles $15 bn defamation lawsuit against New York Times",
    "description": "Donald Trump has refiled a massive $15 billion defamation lawsuit against The New York Times. This action follows an earlier dismissal of his suit by a federal judge. The lawsuit targets the newspaper, its reporters, and a publisher for alleged defamatory pub…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-refiles-15-bn-defamation-lawsuit-against-new-york-times/articleshow/124629294.cms",
    "timestamp": "2025-10-17T12:02:14Z"
  },
  {
    "title": "Forbes Daily: U.S. Chamber Sues Over $100,000 H-1B Visa Fee",
    "description": "Today’s Forbes Daily newsletter covers Chobani's latest fundraise, homebuilder confidence jumps, a new data storage billionaire, the highest-paid soccer players and more.",
    "link": "https://www.forbes.com/sites/daniellechemtob/2025/10/17/forbes-daily-us-chamber-sues-over-100000-h-1b-visa-fee/",
    "timestamp": "2025-10-17T12:01:39Z"
  },
  {
    "title": "Carney says now is not the time to strike back at US over tariffs",
    "description": "Prime Minister Mark Carney is rejecting calls for Ottawa to push back at the US with new retaliatory trade measures as talks with Washington continue on sector-specific trade deals.",
    "link": "https://www.nationalobserver.com/2025/10/17/news/carney-says-now-not-time-strike-back-us-over-tariffs",
    "timestamp": "2025-10-17T12:00:58Z"
  },
  {
    "title": "EU supports Trump-Putin meet in Budapest if serves peace",
    "description": "The European Commission said Friday it welcomes a meeting in Budapest between US President Donald Trump and Russia's Vladimir Putin if it can help end the Ukraine war. In a phone call on Thursday, Putin and Trump floated the idea of meeting in Budapest at a n…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/eu-supports-trump-putin-meet-in-budapest-if-serves-peace/articleshow/124629238.cms",
    "timestamp": "2025-10-17T12:00:37Z"
  },
  {
    "title": "Peru’s Political Churn Isn’t Over Yet",
    "description": "Even after the president’s impeachment, protests show little sign of slowing down.",
    "link": "http://foreignpolicy.com/2025/10/17/peru-protest-boluarte-impeachment-jeri-economy/",
    "timestamp": "2025-10-17T12:00:29Z"
  },
  {
    "title": "Ethereum Investor SharpLink Raises $76.5M At Market Premium – More ETH Purchases Ahead?",
    "description": "One of the largest publicly-traded Ethereum (ETH) treasury firms, SharpLink Gaming, today announced that it had raised $76.5 million in a direct stock offering at a price above market rate. A portion of the proceeds is likely to be used to buy more ETH. Sharp…",
    "link": "https://bitcoinist.com/ethereum-sharplink-76-5m-market-eth-purchases/",
    "timestamp": "2025-10-17T12:00:25Z"
  }
]