[
  {
    "title": "Trump extends tariff relief for U.S. auto industry",
    "description": "The Trump administration will extend current tariff relief programs for U.S. automakers and impose new levies on heavy trucks and buses.",
    "link": "https://www.nbcnews.com/business/autos/trump-extends-tariff-relief-us-auto-industry-rcna238260",
    "timestamp": "2025-10-17T22:15:45Z"
  },
  {
    "title": "Trump commutes 7-year prison sentence of former Rep. George Santos in federal fraud case",
    "description": "President Donald Trump said Friday he had commuted the sentence of former U.S. Rep. George Santos, who is serving more than seven years in federal prison after pleading guilty to fraud and identity theft charges.",
    "link": "https://www.pbs.org/newshour/politics/trump-commutes-7-year-prison-sentence-of-former-rep-george-santos-in-federal-fraud-case",
    "timestamp": "2025-10-17T22:15:35Z"
  },
  {
    "title": "John Bolton: National Security Hawk Turned Trump Foe",
    "description": "John Bolton has spent decades navigating the halls of power in Washington, earning a reputation as a leading foreign policy hawk.",
    "link": "https://www.ibtimes.com/john-bolton-national-security-hawk-turned-trump-foe-3787473",
    "timestamp": "2025-10-17T22:15:20Z"
  },
  {
    "title": "Donald Trump Jr., Meghan McCain Blast ‘The View’ Hosts For Swearing at …",
    "description": "Reading Time: 3 minutesProminent conservative figures like Donald Trump Jr. are lashing out at the hosts of The View.\nDonald Trump Jr., Meghan McCain Blast ‘The View’ Hosts For Swearing at … was originally published on The Hollywood Gossip.",
    "link": "http://www.thehollywoodgossip.com/2025/10/donald-trump-jr-meghan-mccain-blast-the-view-hosts-for-swearing-at-audience-amid-jerry-springer-sh-tshow/",
    "timestamp": "2025-10-17T22:15:05Z"
  },
  {
    "title": "Trump commutes former Rep. George Santos' prison sentence",
    "description": "President Donald Trump said Friday that he had signed a commutation that would immediately release former Rep. George Santos from prison.",
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-commutes-sentence-george-santos-rcna238293",
    "timestamp": "2025-10-17T22:14:52Z"
  },
  {
    "title": "Trump says he has commuted sentence of former US Rep. George Santos in federal fraud case",
    "description": "The New York Republican is serving more than seven years in federal prison.",
    "link": "https://www.bostonherald.com/2025/10/17/trump-george-santos/",
    "timestamp": "2025-10-17T22:14:37Z"
  },
  {
    "title": "Trump says he has commuted sentence of former US Rep. George Santos in federal fraud case",
    "description": "The New York Republican is serving more than seven years in federal prison.",
    "link": "https://www.denverpost.com/2025/10/17/trump-george-santos/",
    "timestamp": "2025-10-17T22:14:37Z"
  },
  {
    "title": "'That's still the law': Senate Republican schools Trump as public feud escalates",
    "description": "Sen. Chuck Grassley (R-IA) took to X on Friday to scold President Donald Trump for overstepping his authority to fire agency watchdogs without taking the proper disclosure steps.\"Pres Trump takes an oath to uphold the constitution & the laws but he hasnt told…",
    "link": "https://www.rawstory.com/chuck-grassley-2674210300/",
    "timestamp": "2025-10-17T22:13:03Z"
  },
  {
    "title": "Trump says he has commuted sentence of former US Rep. George Santos in federal fraud case",
    "description": "President Donald Trump said Friday he had commuted the sentence of former U.S. Rep. George Santos, who is serving more than seven years in federal prison...",
    "link": "https://www.yahoo.com/news/articles/trump-says-commuted-sentence-former-221303406.html",
    "timestamp": "2025-10-17T22:13:03Z"
  },
  {
    "title": "Unmasked: Inflatable Frog Tormenting ICE Is Non-Binary ‘Antifa Terrorist’",
    "description": "A protester in an inflatable frog suit who has risen to notoriety over clashes with immigration officers is a self-identifying non-binary Antifa terrorist, The Telegraph can reveal. The “Portland frog” has become a symbol of resistance for Left-wing agitators…",
    "link": "https://freerepublic.com/focus/f-news/4347030/posts",
    "timestamp": "2025-10-17T22:12:18Z"
  },
  {
    "title": "Salesforce CEO Marc Benioff Walks Back Call for National Guard to San Francisco",
    "description": "The apology comes one day after a major venture capitalist resigned from the Salesforce Foundation board and days after President Donald Trump echoed calls to send troops to San Francisco.",
    "link": "https://www.kqed.org/news/12060384/salesforce-ceo-marc-benioff-walks-back-call-for-national-guard-to-san-francisco",
    "timestamp": "2025-10-17T22:11:36Z"
  },
  {
    "title": "Trump: Russia, Ukraine should stop where they are",
    "description": "United States President Donald Trump shared via Truth Social on Friday that he \"strongly suggested\" to Ukrainian President Volodymyr Zelensky during their meeting earlier today \"that it is time to stop the killing, and make a DEAL,\" adding that Russia and Ukr…",
    "link": "https://freerepublic.com/focus/f-chat/4347029/posts",
    "timestamp": "2025-10-17T22:11:25Z"
  },
  {
    "title": "Top Senate Republican Jabs Trump For Breaking the Law On Key Firings",
    "description": "Grassley has long been a strong advocate for inspectors general in the government and has fought the Trump administration on plans to gut them.\nThe post Top Senate Republican Jabs Trump For Breaking the Law On Key Firings first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/top-senate-republican-jabs-trump-for-breaking-the-law-on-key-firings/",
    "timestamp": "2025-10-17T22:09:57Z"
  },
  {
    "title": "We Found That More Than 170 U.S. Citizens Have Been Held By Immigration Agents. They’ve Been Kicked, Dragged And Detained For Days.",
    "description": "Videos of U.S. citizens being mistreated by immigration agents have filled social media feeds, but there is little clarity on the overall picture. So ProPublica created its own count.",
    "link": "https://www.huffpost.com/entry/immigration-dhs-american-citizens-arrested-detained-against-will-propublica_n_68f2add5e4b0ee732e251f8e",
    "timestamp": "2025-10-17T22:09:52Z"
  },
  {
    "title": "US holding survivors from 'drug boat' off Venezuela",
    "description": "Reports suggest the US has detained two individuals who survived an attack on their vessel in the Caribbean. US President Donald Trump claimed it was a narco submarine.",
    "link": "https://www.dw.com/en/us-holding-survivors-from-drug-boat-off-venezuela/a-74407450",
    "timestamp": "2025-10-17T22:08:00Z"
  },
  {
    "title": "Portland’s Inflatable Costumes Deflate Trump’s Narrative",
    "description": "It’s much more difficult, in fact, well nigh impossible, to call Portland, Oregon, a war zone when ICE agents are forced to stare down an inflatable bunny rabbit. Portlanders have deployed a new tactic to address the Trump administration’s attempted takeover …",
    "link": "https://www.motherjones.com/politics/2025/10/portland-inflatable-costumes-frog-protest-ice-agents/",
    "timestamp": "2025-10-17T22:05:08Z"
  },
  {
    "title": "Networks Plan Coverage Of Next Round Of No Kings Protests On Saturday",
    "description": "Networks are planning coverage of the nationwide No Kings protests on Saturday, the second round of demonstrations against President Donald Trump’s actions in the White House. Thousands of events are being planned across the country, but there will be a few d…",
    "link": "http://deadline.com/2025/10/no-kings-protests-how-to-watch-1236590761/",
    "timestamp": "2025-10-17T22:04:31Z"
  },
  {
    "title": "How to Break the Government",
    "description": "From the daily newsletter: how Russell Vought is firing workers, decimating agencies, and testing the rule of law.",
    "link": "https://www.newyorker.com/newsletter/the-daily/how-to-break-the-government",
    "timestamp": "2025-10-17T22:00:00Z"
  },
  {
    "title": "Eric Trump says Indonesian president on hot mic was asking his father about family business",
    "description": "Eric Trump didn’t seem afraid to put out in the open the subtext of an exchange between Donald Trump and Indonesian President Prabowo Subianto that was caught on a hot mic last week.",
    "link": "https://biztoc.com/x/7cddbd08afd65d45",
    "timestamp": "2025-10-17T21:57:41Z"
  },
  {
    "title": "'Bone-chilling': More corporate giants cave to Trump — even in 'cradle of civil rights'",
    "description": "The Trump administration's assault on diversity, equity and inclusion programs is rattling Atlanta.Some of the city's largest companies have been \"roiled\" by Trump's \"DEI war\" — in contrast to Mayor Andre Dickens' resistance — and major civil rights leaders h…",
    "link": "https://www.rawstory.com/trump-dei-2674210317/",
    "timestamp": "2025-10-17T21:57:26Z"
  },
  {
    "title": "Quiz your knowledge about the Presidential Fitness Test",
    "description": "President Trump is reviving an old fitness test. How much do you remember about the Presidential Fitness Test?",
    "link": "https://www.wgal.com/article/quiz-presidential-fitness-test-2025/65669163",
    "timestamp": "2025-10-17T21:57:10Z"
  },
  {
    "title": "Senate Republicans deepfaked Chuck Schumer, and X hasn’t taken it down  | TechCrunch",
    "description": "The video was posted Friday on the Senate Republicans X account. According to X’s policies, the platform prohibits “deceptively shar synthetic or manipulated media that are likely to cause harm.” Harmful content includes media that could “mislead people” or “…",
    "link": "https://techcrunch.com/2025/10/17/senate-republicans-deepfaked-chuck-schumer-and-x-hasnt-taken-it-down/",
    "timestamp": "2025-10-17T21:57:03Z"
  },
  {
    "title": "Quiz your knowledge about the Presidential Fitness Test",
    "description": "President Trump is reviving an old fitness test. How much do you remember about the Presidential Fitness Test?",
    "link": "https://www.wlky.com/article/quiz-presidential-fitness-test-2025/65669163",
    "timestamp": "2025-10-17T21:56:30Z"
  },
  {
    "title": "Jay Jones Hints at Just What Kind of Attorney General He Might Be",
    "description": "It is considered impolite to say, “We told you so.” However, after the debate Thursday between Virginia Attorney General Jason Miyares and his Democrat challenger,... Read More\nThe post Jay Jones Hints at Just What Kind of Attorney General He Might Be appeare…",
    "link": "https://www.dailysignal.com/2025/10/17/jay-jones-hints-just-what-kind-attorney-general-might-be/",
    "timestamp": "2025-10-17T21:53:01Z"
  },
  {
    "title": "The Forces Changing Music and Film Criticism",
    "description": "The industry is being transformed in the era of YouTube video essays and TikTok screeds.",
    "link": "https://www.theatlantic.com/newsletters/archive/2025/10/forces-changing-music-film-criticism/684608/",
    "timestamp": "2025-10-17T21:52:00Z"
  },
  {
    "title": "Javier Milei's Libertarian Experiment is in Jeopardy. Argentina's Midterm Elections Will Determine Its Fate.",
    "description": "The Argentine president needed a U.S. bailout, and his political adversaries are gaining ground.",
    "link": "https://reason.com/2025/10/18/javier-mileis-libertarian-experiment-is-in-jeopardy-argentinas-midterm-elections-will-determine-its-fate/",
    "timestamp": "2025-10-17T21:51:48Z"
  },
  {
    "title": "Why John Bolton probably WON’T pay big if found guilty in his documents case",
    "description": "John Bolton has pleaded “not guilty” on 18 counts of illegally hoarding or sending sensitive national-security information.",
    "link": "https://nypost.com/2025/10/17/opinion/why-john-bolton-probably-wont-pay-big-if-guilty-in-his-documents-case/",
    "timestamp": "2025-10-17T21:51:11Z"
  },
  {
    "title": "OutKick attends Dodgers-sponsored awards show honoring trans swimmer Lia Thomas: Here's what happened",
    "description": "Ex-UPenn swimmer Lia Thomas took the stage in Los Angeles Thursday night to accept the “Voice of Inspiration Award\" amid an ongoing debate surrounding fairness in women's sports.",
    "link": "https://www.foxnews.com/sports/outkick-attends-dodgers-sponsored-awards-show-honoring-trans-swimmer-lia-thomas-heres-what-happened",
    "timestamp": "2025-10-17T21:48:04Z"
  },
  {
    "title": "News stories show that reporters may have left the Pentagon, but they haven't stopped working",
    "description": "Two days after dozens of journalists left their desks at the Pentagon behind rather than agree to government-imposed rules on how they report about the U.S. ...",
    "link": "https://www.yahoo.com/news/articles/news-stories-show-reporters-may-214636880.html",
    "timestamp": "2025-10-17T21:46:36Z"
  },
  {
    "title": "Novo Nordisk hires US pharma veteran as Trump pricing pressure mounts",
    "description": "LONDON/COPENHAGEN (Reuters) -Novo Nordisk has appointed U. pharmaceutical executive Greg Miley as its new head of corporate affairs, as the obesity drugmaker...",
    "link": "https://finance.yahoo.com/news/novo-nordisk-hires-us-pharma-214444461.html",
    "timestamp": "2025-10-17T21:44:44Z"
  },
  {
    "title": "‘Let Both Claim Victory!’ Trump Urges Ukraine and Russia to ‘Make a DEAL!’ with Current Border Lines",
    "description": "Friday afternoon President Donald Trump wrote on his Truth Social account after meeting with Ukrainian President Volodymyr Zelensky that he wanted Ukraine and Russia to \"both claim Victory\" and \"make a DEAL!\" to end the war with the current border lines.\nThe …",
    "link": "https://www.mediaite.com/politics/trump/let-both-claim-victory-trump-urges-ukraine-and-russia-to-make-a-deal-with-current-border-lines/",
    "timestamp": "2025-10-17T21:44:07Z"
  },
  {
    "title": "Hamas hands over remains of one more Israeli captive, vows to return rest",
    "description": "Palestinian group requests help, heavy machinery to search for bodies still trapped under rubble after Israeli strikes.",
    "link": "https://www.aljazeera.com/news/2025/10/17/hamas-hands-over-remains-of-one-more-israeli-captive-vows-to-return-rest",
    "timestamp": "2025-10-17T21:43:26Z"
  },
  {
    "title": "What to expect from another massive 'No Kings' protest Saturday in Seattle and the region",
    "description": "Another round of \"No Kings\" protests is expected to take place this weekend, with gatherings scheduled nationwide and across Washington.",
    "link": "https://komonews.com/news/local/no-kings-rally-and-protest-against-trump-administration-movement-returns-to-seattle-protests-against-the-trump-administration-intensify-nationwide",
    "timestamp": "2025-10-17T21:41:06Z"
  },
  {
    "title": "Trump slammed by conservative over 'humiliating' handling of secrets: 'Laughing at us'",
    "description": "The Bulwark's publisher, Sarah Longwell, criticized President Donald Trump for \"humiliating\" himself and the United States with his handling of classified documents and information. Trump was found to possess a number of top-secret documents at his Mar-a-Lago…",
    "link": "https://www.rawstory.com/trump-classified-documents-2674210178/",
    "timestamp": "2025-10-17T21:40:46Z"
  },
  {
    "title": "Supreme Court gets first chance to weigh Trump's bid to deploy National Guard (Politico)",
    "description": "Politico:\nSupreme Court gets first chance to weigh Trump's bid to deploy National Guard … In response to the appeal, Illinois Gov. JB Pritzker, a Democrat, said on X: “Donald Trump will keep trying to invade Illinois with troops — and we will keep defending t…",
    "link": "https://www.memeorandum.com/251017/p127",
    "timestamp": "2025-10-17T21:40:01Z"
  },
  {
    "title": "Quiz your knowledge about the Presidential Fitness Test",
    "description": "President Trump is reviving an old fitness test. How much do you remember about the Presidential Fitness Test?",
    "link": "https://www.wlwt.com/article/quiz-presidential-fitness-test-2025/65669163",
    "timestamp": "2025-10-17T21:39:41Z"
  },
  {
    "title": "Marc Benioff apologizes for suggesting National Guard be sent to San Francisco | CNN Business",
    "description": "Salesforce billionaire Marc Benioff backtracked on Friday from comments suggesting President Donald Trump should send the National Guard to San Francisco. The tech CEO’s remarks initially drew a wave of criticism.",
    "link": "https://www.cnn.com/2025/10/17/business/salesforce-marc-benioff-apology",
    "timestamp": "2025-10-17T21:39:12Z"
  },
  {
    "title": "Eli Lilly and Novo Nordisk stocks fall as Trump says he wants $150 price for GLP-1s",
    "description": "Eli Lilly and Novo Nordisk shares dropped after President Donald Trump said he wants a $150 price tag for GLP-1s.",
    "link": "https://biztoc.com/x/6150cc447cc0afb6",
    "timestamp": "2025-10-17T21:35:06Z"
  },
  {
    "title": "Russia’s latest big Ukraine offensive gains next to nothing, again",
    "description": "WAS IT THE Tomahawks? The deadly cruise missiles are probably one reason Vladimir Putin spoke to Donald Trump on October 16th and agreed to meet him in Budapest in the coming weeks to talk about a ceasefire in Ukraine. Mr Trump claims to have told the Russian…",
    "link": "https://biztoc.com/x/4a57116ab25ca640",
    "timestamp": "2025-10-17T21:34:59Z"
  },
  {
    "title": "Andrew Cuomo is still behind — and he’s blaming Curtis Sliwa",
    "description": "“There is no Curtis as a candidate. There’s Curtis as a spoiler,” Cuomo said to radio host Sid Rosenberg. “If Curtis is not in the race, I win. And that’s a choice for Republicans. Do you vote for Curtis so you can say ‘I voted Republican’ and wind up electin…",
    "link": "https://freerepublic.com/focus/f-news/4347024/posts",
    "timestamp": "2025-10-17T21:33:55Z"
  },
  {
    "title": "Suicide bomb attack kills soldiers in Pakistan as truce with Afghanistan is extended",
    "description": "The attack on a military base near the Afghanistan border comes as Taliban and Pakistani officials say a peace deal has been extended.",
    "link": "https://www.abc.net.au/news/2025-10-18/suicide-bomb-attack-kills-soldiers-in-pakistan/105906932",
    "timestamp": "2025-10-17T21:33:16Z"
  },
  {
    "title": "Trump says Ukraine war could end ‘quickly’ as he meets Zelenskyy",
    "description": "The Ukrainian president also expressed optimism about reaching a ceasefire and urged pressure against Russia's Putin.",
    "link": "https://www.aljazeera.com/news/2025/10/17/trump-says-ukraine-war-could-end-quickly-as-he-meets-zelenskyy",
    "timestamp": "2025-10-17T21:33:10Z"
  },
  {
    "title": "Trump boasts of 'best poll numbers I've ever had' — as figures show otherwise",
    "description": "President Donald Trump made a bizarre claim Friday, saying \"Now I have the best polling numbers I've ever had\" — as polls actually show otherwise. Trump made the statement on his Truth Social platform just hours after a meeting with Ukrainian President Volody…",
    "link": "https://www.rawstory.com/smartnews/donald-trump/",
    "timestamp": "2025-10-17T21:31:00Z"
  },
  {
    "title": "No Kings: What to Expect at Protests Planned Across the Bay Area Saturday",
    "description": "Organizers expect big numbers, with protesters citing concerns about immigration enforcement, limits on free speech and an increase in authoritarian rhetoric from the Trump administration.",
    "link": "https://www.kqed.org/news/12060116/no-kings-what-to-expect-at-protests-planned-across-the-bay-area-saturday",
    "timestamp": "2025-10-17T21:29:56Z"
  },
  {
    "title": "Wall Street ends higher as investors digest Trump’s trade comments",
    "description": "NEW YORK: Wall Street closed higher on Friday (Oct 17) as investors weighed US President Donald Trump’s latest remarks on China and upbeat quarterly results from regional banks helped ease concerns about c",
    "link": "https://www.channelnewsasia.com/world/wall-street-ends-higher-investors-digest-trumps-trade-comments-5410316",
    "timestamp": "2025-10-17T21:29:00Z"
  },
  {
    "title": "Poilievre demands federal government release its contracts with Stellantis",
    "description": "The Conservative Party of Canada is calling on the federal government to publicly release its contracts with Stellantis following the company’s announcement Tuesday that it will move production of its Jeep Compass model from Brampton, Ont., to Illinois.",
    "link": "https://www.cbc.ca/news/canada/windsor/poilievre-conservatives-federal-government-stellantis-letter-9.6943185",
    "timestamp": "2025-10-17T21:27:30Z"
  },
  {
    "title": "The Pallyweid \"genocide\" lie (Updated Oct/2025)",
    "description": "* __ The \"genocide\" LIE [October 16, 2025] The Genocide Lie: Why the Accusation Against Israel Collapses Under Scrutiny.In the months since \"Palestine\" regime Hamas’s October 7 attacks, there has been a full-force campaign to frame Israel’s counteroffensive i…",
    "link": "https://freerepublic.com/focus/f-bloggers/4347022/posts",
    "timestamp": "2025-10-17T21:27:16Z"
  },
  {
    "title": "Trump predicts expansion of Abraham Accords",
    "description": "President Trump says Saudi Arabia and other Arab states may soon join the Abraham Accords, citing recent talks and linking Gaza peace efforts to broader regional normalization.",
    "link": "https://www.israelnationalnews.com/news/416414",
    "timestamp": "2025-10-17T21:27:15Z"
  },
  {
    "title": "Salesforce CEO Walks Back SF National Guard Suggestion: ‘I Sincerely Apologize’",
    "description": "On Friday, Salesforce CEO Marc Benioff walked back his previous suggestion that President Donald Trump should send the National Guard to San Francisco, writing, “I sincerely apologize” on X. “I do not believe the National Guard is needed to address safety in …",
    "link": "https://www.mediaite.com/media/news/salesforce-ceo-walks-back-sf-national-guard-suggestion-i-sincerely-apologize/",
    "timestamp": "2025-10-17T21:26:48Z"
  },
  {
    "title": "Is the US about to attack Venezuela?",
    "description": "The US is up to something in Venezuela. But what exactly?  Since early September, the US military has carried out at least five lethal strikes on civilian boats in the Caribbean, alleged by the Trump administration to be piloted by members of Venezuelan drug …",
    "link": "https://www.vox.com/politics/465074/venezuela-trump-maduro-regime-change-drug-boats",
    "timestamp": "2025-10-17T21:26:16Z"
  },
  {
    "title": "Eli Lilly and Novo Nordisk stocks fall as Trump says he wants $150 price for GLP-1s",
    "description": "Eli Lilly and Novo Nordisk shares dropped after President Donald Trump said he wants a $150 price tag for GLP-1s.",
    "link": "https://www.cnbc.com/2025/10/17/eli-lilly-novo-nordisk-stock-trump-glp-1-prices.html",
    "timestamp": "2025-10-17T21:25:22Z"
  },
  {
    "title": "U.S. Tomahawks Become New Flash Point in Trump-Zelensky Talks",
    "description": "Where once the White House appeared inclined to sell the weapons to Kyiv, Trump seems to be reconsidering.",
    "link": "http://foreignpolicy.com/2025/10/17/trump-zelensky-tomahawks-missiles-ukraine-russia-putin-hungary/",
    "timestamp": "2025-10-17T21:24:46Z"
  },
  {
    "title": "How Andrew's Epstein friendship left his reputation in tatters",
    "description": "The seeds of Andrew's downfall were sown many years ago, when he began a friendship with financier Jeffrey Epstein in the 1990s. Andrew once counted both Epstein and his former girlfriend Ghislaine Maxwell as friends, and the trio were seen on holiday togethe…",
    "link": "https://freerepublic.com/focus/f-chat/4347021/posts",
    "timestamp": "2025-10-17T21:24:45Z"
  },
  {
    "title": "Argentine Peso Drops Against Dollar Despite US Backing",
    "description": "Argentines scrambled Friday to buy dollars and household items as the peso depreciated against the greenback, despite multi-billion dollars of US support for the under-pressure currency.",
    "link": "https://www.ibtimes.com/argentine-peso-drops-against-dollar-despite-us-backing-3787450",
    "timestamp": "2025-10-17T21:21:05Z"
  },
  {
    "title": "Zelensky calls for ceasefire along current front lines",
    "description": "Ukrainian leader Vladimir Zelensky has backed Donald Trump’s call for a ceasefire along the current front lines Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626637-zelesnky-ceasefire-front-lines/",
    "timestamp": "2025-10-17T21:20:59Z"
  },
  {
    "title": "The business-as-usual shutdown: From the Politics Desk",
    "description": "President Donald Trump and members of Congress are largely carrying on as usual while the government shutdown drags on with no end in sight.",
    "link": "https://www.nbcnews.com/politics/politics-news/business-usual-shutdown-politics-desk-rcna238268",
    "timestamp": "2025-10-17T21:19:06Z"
  },
  {
    "title": "CNN Fact-Checker Torpedoes Bonkers Trump Attack From Falsehood-Riddled Oval Office Event — And 6 Other Doozies",
    "description": "Daniel Dale torpedoed a bonkers Trump claim about a bridge between Hawaii and the mainland and 6 other doozies from a falsehood-riddled Oval Office event.\nThe post CNN Fact-Checker Torpedoes Bonkers Trump Attack From Falsehood-Riddled Oval Office Event — And …",
    "link": "https://www.mediaite.com/media/tv/cnn-fact-checker-torpedoes-bonkers-trump-attack-from-falsehood-riddled-oval-office-event-and-6-other-doozies/",
    "timestamp": "2025-10-17T21:18:11Z"
  },
  {
    "title": "The Road Ahead for Palestine",
    "description": "Former negotiator Diana Buttu on the need for accountability—from Israelis and Palestinians alike.",
    "link": "http://foreignpolicy.com/2025/10/17/buttu-road-ahead-for-palestine/",
    "timestamp": "2025-10-17T21:17:06Z"
  },
  {
    "title": "Shutdown Shows GOP Is Still Obsessed With Obamacare Repeal",
    "description": "Extending Obamacare subsidies is central to resolving the government shutdown. The shutdown has revealed that Republicans still want to scrap the program altogether. Democrats are betting Trump doesn’t agree or care.",
    "link": "http://nymag.com/intelligencer/article/shutdown-shows-gop-is-still-obsessed-with-obamacare-repeal.html",
    "timestamp": "2025-10-17T21:14:33Z"
  },
  {
    "title": "Eric Trump says Indonesian president on hot mic was asking his father about family business",
    "description": "Eric Trump didn’t seem afraid to put out in the open the subtext of an exchange between Donald Trump and Indonesian President Prabowo Subianto that was caught on a hot mic last week.",
    "link": "https://www.msnbc.com/top-stories/latest/eric-trump-indonesian-president-hot-mic-rcna238254",
    "timestamp": "2025-10-17T21:14:21Z"
  },
  {
    "title": "A right-wing run-off: What to know about Bolivia’s presidential election",
    "description": "After an historic defeat for the long-dominant political left, two candidates have promised a new pro-market direction.",
    "link": "https://www.aljazeera.com/news/2025/10/17/a-right-wing-run-off-what-to-know-about-bolivias-presidential-election",
    "timestamp": "2025-10-17T21:13:17Z"
  },
  {
    "title": "US Treasury chief to meet China counterpart as tensions flare",
    "description": "WASHINGTON: US Treasury Secretary Scott Bessent said on Friday (Oct 17) that he expects to meet Chinese Vice Premier He Lifeng next week to prepare for an upcoming summit between US Pres",
    "link": "https://www.channelnewsasia.com/world/us-treasury-chief-meet-china-counterpart-tensions-flare-5410291",
    "timestamp": "2025-10-17T21:12:00Z"
  },
  {
    "title": "In talks with Zelenskiy, Trump appears to press pause on fresh support",
    "description": "By Nandita Bose, Gram Slattery and Jeff Mason WASHINGTON (Reuters) -Ukrainian President Volodymyr Zelenskiy came to the White House on Friday looking for...",
    "link": "https://uk.news.yahoo.com/talks-zelenskiy-trump-appears-press-211057125.html",
    "timestamp": "2025-10-17T21:10:57Z"
  },
  {
    "title": "The man who handled Martin Luther King Jr.’s dirty work",
    "description": "“Andrew Young: The Dirty Work,” a new documentary by MSNBC host Rachel Maddow, showcases the leader's contribution to Martin Luther King's team of freedom fighters.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/rachel-maddow-documentary-andrew-young-mlk-rcna237980",
    "timestamp": "2025-10-17T21:10:55Z"
  },
  {
    "title": "Marc Elias: When Trump's Enemies Are Indicted, We Must Start With The Presumption That It's Not On The Up And Up",
    "description": "Democratic party attorney Marc Elias on Thursday told MSNBC's \"The Weeknight\" that President Donald Trump is trying to intimidate his political \"enemies\" from being a meaningful and robust opposition to him. MICHAEL STEELE, CO-HOST: Marc, Marc, here we go aga…",
    "link": "https://freerepublic.com/focus/f-news/4347016/posts",
    "timestamp": "2025-10-17T21:10:18Z"
  },
  {
    "title": "Bitcoin Falls To Lowest Since June As Various Factors Drive Losses",
    "description": "Bitcoin prices extended their recent losses on October 17, dropping to their lowest value in more than three months as several factors fueled continued declines.",
    "link": "https://www.forbes.com/sites/digital-assets/2025/10/17/bitcoin-falls-to-lowest-since-june-as-various-factors-drive-losses/",
    "timestamp": "2025-10-17T21:10:05Z"
  },
  {
    "title": "Pro-Democracy Americans Gear Up for 'No Kings' Day Nationwide",
    "description": "Organizers are expecting Saturday's nationwide \"No Kings\" rallies to be among the largest single-day demonstrations in US history, and many activists and politicians on Friday sent messages of encouragement to demonstrators.Leah Greenberg, the co-founder and …",
    "link": "https://www.commondreams.org/news/no-kings-october-18-2674210118",
    "timestamp": "2025-10-17T21:08:55Z"
  },
  {
    "title": "Why the Bolton Case Might Be Different From Other Politically Charged DOJ Prosecutions",
    "description": "Legal experts say the John Bolton classified documents case will be more difficult for President Donald Trump’s critics to dismiss as a Trump vengeance play... Read More\nThe post Why the Bolton Case Might Be Different From Other Politically Charged DOJ Prosec…",
    "link": "https://www.dailysignal.com/2025/10/17/why-bolton-case-might-be-different-other-politically-charged-doj-prosecutions/",
    "timestamp": "2025-10-17T21:08:52Z"
  },
  {
    "title": "Jack Smith Referred to DOJ for Misconduct Investigation and Possible Disbarment",
    "description": "The former special counsel was referred to the Justice Department by several current GOP lawmakers. Former special counsel Jack Smith was criminally referred to the Department of Justice (DOJ) on Oct. 16 by multiple Republican lawmakers for alleged misconduct…",
    "link": "https://freerepublic.com/focus/f-news/4347015/posts",
    "timestamp": "2025-10-17T21:08:38Z"
  },
  {
    "title": "Trump announces ‘submarine’ attack in Caribbean, amid reports of survivors",
    "description": "The US president also indicated Venezuelan President Nicolas Maduro offered concessions in a bid to lower tensions.",
    "link": "https://www.aljazeera.com/news/2025/10/17/trump-announces-submarine-attack-in-caribbean-amid-reports-of-survivors",
    "timestamp": "2025-10-17T21:06:44Z"
  },
  {
    "title": "Rattled Wall Street on alert after trillion-dollar risk runup",
    "description": "Stocks still ended the week with a tidy gain, but six days of volatility across assets shows a deeper anxiety taking hold: credit fragility.",
    "link": "https://fortune.com/2025/10/17/rattled-wall-street-bull-market-first-brands-tricolor-midsized-banks/",
    "timestamp": "2025-10-17T21:05:04Z"
  },
  {
    "title": "US captures two survivors after attack on Venezuela 'drug sub'",
    "description": "Two people were rescued by helicopter and are being held on a US Navy ship, according to US media.",
    "link": "https://www.bbc.com/news/articles/ce8zd5nylpmo",
    "timestamp": "2025-10-17T21:03:06Z"
  },
  {
    "title": "Former Trump adviser pleads not guilty to sharing classified information",
    "description": "John Bolton has become one of Donald Trump's most vocal critics after he was ousted from the US president's administration during his first term.",
    "link": "https://www.abc.net.au/news/2025-10-18/john-bolton-pleads-not-guilty-to-sharing-classified-information/105906928",
    "timestamp": "2025-10-17T21:03:01Z"
  },
  {
    "title": "Zelensky tight-lipped on Tomahawks",
    "description": "Ukraine’s Vladimir Zelensky has declined to reveal if he made any deals on Tomahawk missiles, only saying the US does not want escalation Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/626635-zelensky-tight-lipped-tomahawks/",
    "timestamp": "2025-10-17T21:02:26Z"
  },
  {
    "title": "Trump: Russia, Ukraine should stop where they are",
    "description": "United States President Donald Trump shared via Truth Social on Friday that he \"strongly suggested\" to Ukrainian President Volodymyr Zelensky during their meeting earlier today \"that it is time to sto...",
    "link": "https://biztoc.com/x/dad3c27759b911e0",
    "timestamp": "2025-10-17T21:02:18Z"
  },
  {
    "title": "Nancy Pelosi May Be Getting Her Most Serious Challenger Yet",
    "description": "California state Sen. Scott Wiener is reportedly running for Pelosi's long-held House seat.",
    "link": "https://www.huffpost.com/entry/scott-wiener-nancy-pelosi-seat_n_68f26fa4e4b0f8088dd5eec3",
    "timestamp": "2025-10-17T21:02:00Z"
  },
  {
    "title": "Putin Is Out Of Options",
    "description": "By Carl Bildt, Project Syndicate | Oct 16, 2025\nIt is now clear that Russia’s army cannot get the job done in Ukraine, and that Donald Trump cannot force Ukrainian President Volodymyr Zelensky into submission as long as European financial support for his gove…",
    "link": "https://biztoc.com/x/24a846f2aac2ea5b",
    "timestamp": "2025-10-17T21:01:37Z"
  },
  {
    "title": "Wild proposal for Alaska-Russia tunnel catches Trump’s eye — but leaves Zelensky seething",
    "description": "Kirill Dmitriev, CEO of the Russian Direct Investment Fund, tweeted Thursday that a “Putin-Trump Tunnel” would be a “70-mile link symbolizing unity.”",
    "link": "https://nypost.com/2025/10/17/business/undersea-alaska-russia-tunnel-pitched-by-elon-musks-boring-company-catches-trumps-eye/",
    "timestamp": "2025-10-17T21:01:19Z"
  },
  {
    "title": "Trump administration asks Supreme Court to OK National Guard deployment in Illinois",
    "description": "The Trump administration filed an emergency stay request Friday with the Supreme Court to undo a lower court order over the deployment of the National Guard in Chicago.",
    "link": "https://abcnews.go.com/Politics/trump-administration-asks-supreme-court-national-guard-deployment/story?id=126630415",
    "timestamp": "2025-10-17T21:00:53Z"
  },
  {
    "title": "EXCLUSIVE: Not Another Four Years! How 'Dictator-Style' Donald Trump 'Could Run for Third Term After Deifying Himself Over Flawed Middle East 'Peace' Deal",
    "description": "Vocal Trump critic Michael Wolff believes Trump may be setting things up to run for a third presidential term.",
    "link": "https://radaronline.com/p/dictator-trump-could-run-for-third-term-middle-east-peace-deal/",
    "timestamp": "2025-10-17T21:00:00Z"
  },
  {
    "title": "Trump administration halts funds for projects in blue cities as Democrats refuse to reopen the government",
    "description": "President Donald Trump's administration is ramping up the pressure on Democrats who refuse to reopen the government over two weeks into the shutdown. Office of Management and Budget Director Russ Vought announced Friday that he will be pausing over $11 billio…",
    "link": "https://www.theblaze.com/news/trump-administration-halts-funds-for-projects-in-blue-cities-as-democrats-refuse-to-reopen-the-government",
    "timestamp": "2025-10-17T21:00:00Z"
  },
  {
    "title": "Daybreak Weekend: Tesla Earnings, European Banks, Trump-Albanese Meeting",
    "description": "Bloomberg Daybreak Weekend with Host Nathan Hager take a look at some of the stories we'll be tracking in the coming week. <ul> <li>In the US – a look ahead to earnings from Tesla and Netflix.</li> <li>In the UK – a look ahead to European bank earnings.</li> …",
    "link": "https://omny.fm/shows/bloomberg-daybreak/daybreak-weekend-tesla-earnings-european-banks-trump-albanese-meeting",
    "timestamp": "2025-10-17T21:00:00Z"
  },
  {
    "title": "Coral Recoveries and Growth Show The Hill Is Misleading About Global Warming Killing Reefs",
    "description": "The Hill did a disservice to its readers by publishing this article which served no other purpose than was to frighten readers into ignoring Trump’s important point, that bad actors (particularly at the United Nations, where he made the comments) are using cl…",
    "link": "https://wattsupwiththat.com/2025/10/17/coral-recoveries-and-growth-show-the-hill-is-misleading-about-global-warming-killing-reefs/",
    "timestamp": "2025-10-17T21:00:00Z"
  },
  {
    "title": "Donald Trump is a threat to democracy, warns former prime minister Jean Chrétien",
    "description": "Former prime minister Jean Chrétien is warning that Donald Trump is a threat to democracy because the U.S. president \"does not care much about the rule of law,\" and that \"could cause a lot of problems south of the border.\"",
    "link": "https://www.cbc.ca/news/politics/jean-chretien-trump-threat-to-democracy-9.6933230",
    "timestamp": "2025-10-17T21:00:00Z"
  },
  {
    "title": "Hamas refuses to disarm, seeks continued control in Gaza",
    "description": "Senior Hamas official Mohammed Nazzal says the terror group won’t commit to disarmament and will retain control in Gaza, challenging Trump’s ceasefire plan.",
    "link": "https://www.israelnationalnews.com/news/416413",
    "timestamp": "2025-10-17T20:59:51Z"
  },
  {
    "title": "Jimmy Kimmel likens anti-Trump ‘No Kings’ protests to American Revolution",
    "description": "Comedian Jimmy Kimmel likened upcoming \"No Kings\" rallies to American Revolution, accusing Republican critics of double standards regarding political protests.",
    "link": "https://www.foxnews.com/media/jimmy-kimmel-likens-anti-trump-no-kings-protests-american-revolution",
    "timestamp": "2025-10-17T20:59:28Z"
  },
  {
    "title": "Oil Ends Third Straight Weekly Loss",
    "description": "Optimism over Trump's talks with China and Putin briefly steadied sentiment amid bearish fundamentals.",
    "link": "https://www.rigzone.com/news/wire/oil_ends_third_straight_weekly_loss-17-oct-2025-182112-article/",
    "timestamp": "2025-10-17T20:59:10Z"
  },
  {
    "title": "Joe Rogan Is Blasting Trump For 1 Of His Grossest Tactics: It’s A ‘Dangerous Precedent’",
    "description": "The popular podcaster said he doesn’t “support everything” that the Trump administration is “doing now.”",
    "link": "https://www.huffpost.com/entry/even-joe-rogan-is-blasting-trump-for-1-of-his-grossest-tactic-its-a-dangerous-precedent_n_68f26da8e4b0787557684123",
    "timestamp": "2025-10-17T20:59:00Z"
  },
  {
    "title": "Trump Administration Asks Supreme Court To Allow National Guard In Chicago Area",
    "description": "A federal judge has found there is no danger of a \"rebellion\" in the city that would justify deployment.",
    "link": "https://www.huffpost.com/entry/trump-administration-asks-supreme-court-to-allow-national-guard-in-chicago-area_n_68f2ad33e4b0f8088dd61405",
    "timestamp": "2025-10-17T20:58:52Z"
  },
  {
    "title": "Mamdani sparks online frenzy over response to whether he endorses NY Gov Hochul: 'Humiliating'",
    "description": "NYC socialist mayoral candidate Zohran Mamdani sparked a frenzy on social media after he declined to endorse New York Gov. Kathy Hochul during a debate Thursday nigt.",
    "link": "https://www.foxnews.com/politics/mamdani-sparks-online-frenzy-over-response-to-whether-he-endorses-ny-gov-hochul-humiliating",
    "timestamp": "2025-10-17T20:57:01Z"
  },
  {
    "title": "Senators see momentum on Russia sanctions even as White House sends mixed signals",
    "description": "Senate leaders push for vote on Russian sanctions as Ukrainian President Volodymyr Zelenskyy visits Washington to press for stronger action against Moscow.",
    "link": "https://www.foxnews.com/politics/senators-see-momentum-russia-sanctions-even-white-house-sends-mixed-signals",
    "timestamp": "2025-10-17T20:56:52Z"
  },
  {
    "title": "Trump Asks Supreme Court to Greenlight Chicago Military Takeover (Jacob Knutson/Democracy Docket)",
    "description": "Jacob Knutson / Democracy Docket:\nTrump Asks Supreme Court to Greenlight Chicago Military Takeover  —  President Donald Trump asked the Supreme Court Friday to stay a lower court order barring his attempted military deployment in Chicago.  —  The stay applica…",
    "link": "https://www.memeorandum.com/251017/p117",
    "timestamp": "2025-10-17T20:55:00Z"
  },
  {
    "title": "Federal Reserve Bank: Trump's Deportations Boost Wages and Technology",
    "description": "Trump's immigration policy is pressuring Texas employers to raise wages, recruit sidelined Americans, and invest in productivity-boosting technology, according to the Federal Reserve Bank of Dallas.\nThe post Federal Reserve Bank: Trump’s Deportations Boost Wa…",
    "link": "https://www.breitbart.com/economy/2025/10/17/federal-reserve-bank-trumps-deportations-boost-wages-and-technology/",
    "timestamp": "2025-10-17T20:54:26Z"
  },
  {
    "title": "Tommy Tuberville slams Democrats for ‘demonizing’ young male voters after AOC ‘masculinity’ remarks backfire",
    "description": "Sen. Tommy Tuberville criticized Rep. Alexandria Ocasio-Cortez's comments about young men, saying Democrats have spent years demonizing men as \"racist\" and \"toxic.\"",
    "link": "https://www.foxnews.com/sports/tommy-tuberville-slams-democrats-demonizing-young-male-voters-after-aoc-masculinity-remarks-backfire",
    "timestamp": "2025-10-17T20:52:55Z"
  },
  {
    "title": "Ohio lawmaker pushes bill to defund sanctuary cities, boost ICE cooperation",
    "description": "Ohio state Rep. Josh Williams is looking to use funding penalties to push sanctuary cities to cooperate with federal agencies on immigration enforcement.",
    "link": "https://www.foxnews.com/politics/ohio-lawmaker-pushes-bill-defund-sanctuary-cities-boost-ice-cooperation",
    "timestamp": "2025-10-17T20:52:27Z"
  },
  {
    "title": "'Gimme' shelter: ASPCA, Humane Society live large on your donations, warns watchdog",
    "description": "Animal lovers beware: Some of the biggest charities in the biz are more than happy to bite the hand that feeds them. At least, that's the contention of one Washington, D.C.-based watchdog. If you’ve ever worried about where your charitable dollars go, you’re …",
    "link": "https://freerepublic.com/focus/f-news/4347012/posts",
    "timestamp": "2025-10-17T20:51:42Z"
  },
  {
    "title": "Marc Benioff apologizes after saying Trump should send troops to San Francisco",
    "description": "Marc Benioff has apologized for his National Guard comments\nHalil Sagirkaya/Anadolu via Getty Images\nMarc Benioff apologized for saying Donald Trump should call the National Guard into San Francisco.\nHe said his earlier remarks were made \"from an abundance of…",
    "link": "https://biztoc.com/x/1b43e2bcd08e56d6",
    "timestamp": "2025-10-17T20:50:49Z"
  },
  {
    "title": "Supreme Court sets date to hear FTC Slaughter case in test of Trump's firing powers",
    "description": "The Supreme Court takes up Trump’s effort to remove an FTC member, a case that could expand presidential control over independent agencies.",
    "link": "https://www.foxnews.com/politics/supreme-court-sets-date-hear-ftc-slaughter-case-test-trumps-firing-powers",
    "timestamp": "2025-10-17T20:50:25Z"
  }
]