[
  {
    "title": "Stephen Colbert Roasts Paramount Over Rumored $50 Million Trump Settlement, Offers to Defend Company for Same Amount | Video",
    "description": "\"The Late Show\" host calls out the \"terrible precedent\" set by media companies that \"capitulate to an autocrat\"\nThe post Stephen Colbert Roasts Paramount Over Rumored $50 Million Trump Settlement, Offers to Defend Company for Same Amount | Video  appeared fir…",
    "link": "https://www.thewrap.com/stephen-colbert-roasts-paramount-over-rumored-trump-settlement-monologue/",
    "timestamp": "2025-05-21T05:34:28Z"
  },
  {
    "title": "Meta warned minister that €200m EU fine last month would harm Irish businesses and consumers",
    "description": "The tech giant made the claim in an email to Enterprise Minister Peter Burke.",
    "link": "https://www.thejournal.ie/meta-ireland-lobbying-european-union-presidency-6709790-May2025/",
    "timestamp": "2025-05-21T05:30:53Z"
  },
  {
    "title": "Elon Musk went on a media blitz. Here are 5 takeaways from his interviews.",
    "description": "In media interviews on Tuesday, Musk reaffirmed his commitment to Tesla and said he'd be spending less on politics in the future.",
    "link": "https://www.businessinsider.com/5-takeaways-from-elon-musk-media-blitz-2025-5",
    "timestamp": "2025-05-21T05:30:06Z"
  },
  {
    "title": "Rubio says Syria could be weeks away from 'full-scale civil war'",
    "description": "U.S. Secretary of State Marco Rubio warned Tuesday that Syria could be weeks away from a fresh civil war of \"epic proportions,\" as he called for support to the transitional leadership.",
    "link": "https://www.hurriyetdailynews.com/rubio-says-syria-could-be-weeks-away-from-full-scale-civil-war-209417",
    "timestamp": "2025-05-21T05:29:25Z"
  },
  {
    "title": "China slams US 'bullying' over new warnings on Huawei chips",
    "description": "Beijing has strongly condemned the recent US warnings regarding the use of AI chips manufactured by Huawei, labeling them as acts of bullying and protectionism. China vows to take firm steps to protect its interests against restrictions on high-tech semicondu…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/china-slams-us-bullying-over-new-warnings-on-huawei-chips/articleshow/121307513.cms",
    "timestamp": "2025-05-21T05:27:53Z"
  },
  {
    "title": "Japan's exports slow in April as Trump's tariffs dent shipments to the U.S.",
    "description": "Japan's exports to the United States, its largest single trading partner, fell nearly 2% in April as tariff hikes imposed by President Donald Trump hit home",
    "link": "https://abcnews.go.com/Business/wireStory/japans-exports-slow-april-trumps-tariffs-dent-shipments-122018148",
    "timestamp": "2025-05-21T05:26:26Z"
  },
  {
    "title": "Syria welcomes EU’s decision to lift sanctions, calls it ‘historic victory'",
    "description": "Syrian Foreign Minister Asaad al-Shaibani welcomed a decision by the European Union on Tuesday to lift economic sanctions against his country, calling it “a new historic achievement” for the Syrian people.",
    "link": "https://www.hurriyetdailynews.com/syria-welcomes-eus-decision-to-lift-sanctions-calls-it-historic-victory-209416",
    "timestamp": "2025-05-21T05:25:26Z"
  },
  {
    "title": "Romanians choose Europe",
    "description": "There was an unexpected turnaround in Romania: the pro-European candidate Nicușor Dan (independent) was victorious in the 18 May presidential election with 53.60% of the vote. George Simion (Alliance for the Unity of Romanians, far right), who was widely tipp…",
    "link": "https://voxeurop.eu/en/romania-election-europe-nicusor-dan/",
    "timestamp": "2025-05-21T05:25:00Z"
  },
  {
    "title": "Importers race to turn US warehouses into tariff-free zones",
    "description": "American companies importing from China are quickly converting warehouses. They aim to avoid President Trump's tariffs. Bonded warehouses allow delayed tariff payments. High demand has increased prices for bonded storage. Some firms are expanding bonded space…",
    "link": "https://economictimes.indiatimes.com/news/international/business/importers-race-to-turn-us-warehouses-into-tariff-free-zones/articleshow/121307409.cms",
    "timestamp": "2025-05-21T05:22:51Z"
  },
  {
    "title": "SK Telecom revealed that malware breach began in 2022",
    "description": "South Korean mobile network operator SK Telecom revealed that the security breach disclosed in April began in 2022. SK Telecom is South Korea’s largest wireless telecom company, a major player in the country’s mobile and tech landscape. It holds about 48% of …",
    "link": "https://securityaffairs.com/178120/data-breach/sk-telecom-revealed-that-malware-breach-began-in-2022.html",
    "timestamp": "2025-05-21T05:18:12Z"
  },
  {
    "title": "Did Qatar Really \"Gift\" Plane To Trump? Reports Say Otherwise",
    "description": "Contrary to the narrative from US President Donald Trump that Qatar reached out and offered the mega-expensive Boeing 747 as a &quot;gift&quot; to him, it was the Trump administration that specifically sought out the luxury jumbo jet from the Gulf nation.",
    "link": "https://www.ndtv.com/world-news/did-qatar-really-gift-plane-to-us-president-donald-trump-reports-say-otherwise-8467955",
    "timestamp": "2025-05-21T05:14:05Z"
  },
  {
    "title": "Target boycotts also affect U.S. Black-owned businesses: report",
    "description": "NEW YORK, May 20 (Xinhua) -- Boycotts against U.S. seventh-largest retailer Target's rollback of div",
    "link": "http://en.people.cn/n3/2025/0521/c90000-20317579.html",
    "timestamp": "2025-05-21T05:13:49Z"
  },
  {
    "title": "US stresses 'new era of partnership' with Türkiye following Syria discussions",
    "description": "The U.S. State Department highlighted a “new era of partnership” in Türkiye-U.S. relations following a meeting Tuesday of the Türkiye-U.S. Syria Working Group in Washington, DC.",
    "link": "https://www.hurriyetdailynews.com/us-stresses-new-era-of-partnership-with-turkiye-following-syria-discussions-209414",
    "timestamp": "2025-05-21T05:13:25Z"
  },
  {
    "title": "House GOP grinding ahead with Trump's big tax cuts bill, but new report says it will add to deficit",
    "description": "House Republicans are preparing to vote on their multi-trillion-dollar package of tax breaks and program cuts as soon as Wednesday",
    "link": "https://abcnews.go.com/Politics/wireStory/house-gop-grinding-ahead-trumps-big-tax-cuts-122017326",
    "timestamp": "2025-05-21T05:10:16Z"
  },
  {
    "title": "G-7 Finance Ministers aim to avoid public spats with US despite trade turmoil",
    "description": "One topic where the group is likely to find at least some consensus is China. The Canadian hosts have made sure to put Chinese trade practices on the agenda — though some are wary of doing too much China-bashing",
    "link": "https://www.bloomberg.com/news/articles/2025-05-20/g-7-finance-ministers-aim-to-avoid-public-spats-with-us-despite-trade-turmoil",
    "timestamp": "2025-05-21T05:02:33Z"
  },
  {
    "title": "Cyril Ramaphosa Goes to Washington",
    "description": "Inside the South African president’s gambit to mend ties with Trump.",
    "link": "http://foreignpolicy.com/2025/05/21/ramaphosa-trump-meeting-washington-south-africa-us-ties-tensions-trade/",
    "timestamp": "2025-05-21T05:00:14Z"
  },
  {
    "title": "Michael McDowell: Migration is the Achilles heel of centrist Europe and Trump is ready to exploit it",
    "description": "Across the member states, there is growing recognition that the much-vaunted EU migration pact is too little and too late",
    "link": "https://www.irishtimes.com/opinion/2025/05/21/michael-mcdowell-migration-policy-is-the-eus-biggest-weakness-and-donald-trump-is-aiming-to-exploit-it/",
    "timestamp": "2025-05-21T05:00:01Z"
  },
  {
    "title": "Suad Aldarra: ‘KatKot’ chocolate and ‘Ugarit Cola’: What life was like under US sanctions",
    "description": "It felt like the more ways we learned to survive the sanctions regime, the more creative ways it found to punish us",
    "link": "https://www.irishtimes.com/opinion/2025/05/21/katkot-chocolate-and-ugarit-cola-what-life-in-syria-was-like-under-us-sanctions/",
    "timestamp": "2025-05-21T05:00:01Z"
  },
  {
    "title": "Bitcoin Buys a View: Trump Tower Dubai Embraces Cryptocurrency Payments via Deus X Pay",
    "description": "VILNIUS, Lithuania, May 21, 2025 (GLOBE NEWSWIRE) -- Deus X Pay, a licensed institutional stablecoin payment solution setting new standards across the luxury sectors, is now enabling crypto payments for property purchases at the new Trump Tower Dubai, the fir…",
    "link": "https://www.globenewswire.com/news-release/2025/05/21/3085405/0/en/Bitcoin-Buys-a-View-Trump-Tower-Dubai-Embraces-Cryptocurrency-Payments-via-Deus-X-Pay.html",
    "timestamp": "2025-05-21T05:00:00Z"
  },
  {
    "title": "Trump says the Golden Dome, meant to put US weapons in space, will be ready in 3 years and cost $175 billion",
    "description": "The Golden Dome would involve space-based interceptors, which Congress estimated would cost between $162 billion to $542 billion over 20 years.",
    "link": "https://www.businessinsider.com/trump-golden-dome-space-weapons-ready-3-years-cost-2025-5",
    "timestamp": "2025-05-21T04:57:25Z"
  },
  {
    "title": "Deportations to South Sudan appear to violate court order, U.S. judge says",
    "description": "The development marked a new clash between the federal judiciary and U.S. President Donald Trump's administration in its efforts to implement mass deportations.",
    "link": "https://www.japantimes.co.jp/news/2025/05/21/world/politics/deportation-south-sudan-court-us/",
    "timestamp": "2025-05-21T04:57:00Z"
  },
  {
    "title": "How nations are increasing pressure on Israel over Gaza aid restrictions",
    "description": "Pressure is piling on Benjamin Netanyahu over Israel's \"minimal\" allowance of aid trucks in Gaza, with several nations issuing criticisms and fresh sanctions.",
    "link": "https://www.abc.net.au/news/2025-05-21/international-responses-to-israel-aid-decision/105318298",
    "timestamp": "2025-05-21T04:53:35Z"
  },
  {
    "title": "Taiwan pushes economic restructuring amid US trade tensions, AI supply chain shifts",
    "description": "Amid renewed trade tensions under US President Donald Trump, Asian leaders are adjusting their economic strategies to align with the evolving geopolitical climate. Taiwan, in particular, faces mounting pressure as major industrial players like TSMC and artifi…",
    "link": "https://www.digitimes.com/news/a20250521PD214/taiwan-economy-development-donald-trump-industrial.html",
    "timestamp": "2025-05-21T04:48:46Z"
  },
  {
    "title": "Senate unanimously approves $25,000 tax break for tipped workers",
    "description": "Senate's unanimous approval of a tax deduction bill on tips, championed by Sen. Ted Cruz, could affect 4 million workers in tipped occupations.",
    "link": "https://www.foxnews.com/politics/senate-unanimously-approves-25000-tax-break-tipped-workers",
    "timestamp": "2025-05-21T04:46:46Z"
  },
  {
    "title": "The US v the ICC: Why is Trump going after the court?",
    "description": "Since the US sanctioned the ICC prosecutor in February, the court is struggling to function.",
    "link": "https://www.aljazeera.com/podcasts/2025/5/21/the-us-v-the-icc-why-is-trump-going-after-the-court",
    "timestamp": "2025-05-21T04:42:21Z"
  },
  {
    "title": "Greek-backed LNG bunkering unit debuts in the US",
    "description": "The first liquefied natural gas (LNG) liquefaction and storage unit in the US Gulf (formerly the Gulf of Mexico), exclusively for the refueling of ships, is being built by Seapath,…\nGreek-backed LNG bunkering unit debuts in the US - Η ΝΑΥΤΕΜΠΟΡΙΚΗ",
    "link": "https://www.naftemporiki.gr/english/1958845/greek-backed-lng-bunkering-unit-debuts-in-the-us/",
    "timestamp": "2025-05-21T04:41:56Z"
  },
  {
    "title": "Exclusive: Marsha Blackburn Issues Bill to Ban Birth Tourism Loophole Used by Thousands of Foreigners Annually",
    "description": "Sen. Marsha Blackburn (R-TN) is issuing a bill that would effectively eliminate the multimillion-dollar birth tourism industry, where foreign nationals secure temporary visas to the United States for the sole purpose of delivering their unborn children who th…",
    "link": "https://freerepublic.com/focus/f-news/4318217/posts",
    "timestamp": "2025-05-21T04:38:17Z"
  },
  {
    "title": "CNBC's The China Connection newsletter: A fragile truce as tempers flare",
    "description": "Just a week after a breakthrough in U.S.-China trade tensions, neither side can yet be confident that the other is holding up their end of the bargain.",
    "link": "https://www.cnbc.com/2025/05/21/cnbcs-the-china-connection-newsletter-a-fragile-truce-as-tempers-flare.html",
    "timestamp": "2025-05-21T04:38:11Z"
  },
  {
    "title": "Japan’s exports slow in April as Trump’s tariffs dent shipments to the U.S.",
    "description": "TOKYO (AP) — Japan’s exports to the United States, its largest single trading partner, fell nearly 2% in April as tariff hikes imposed by President Donald Trump hit home. Globally, exports rose just 2% year-on-year, down from 4% in March, leaving a trade defi…",
    "link": "https://financialpost.com/pmn/japans-exports-slow-in-april-as-trumps-tariffs-dent-shipments-to-the-u-s",
    "timestamp": "2025-05-21T04:36:34Z"
  },
  {
    "title": "Japan's exports slow in April as Trump's tariffs dent shipments to the U.S.",
    "description": "Japan’s exports to the United States, its largest single trading partner, fell nearly 2% in April as tariff hikes imposed by President Donald Trump hit home....",
    "link": "https://finance.yahoo.com/news/japans-exports-slow-april-trumps-043302754.html",
    "timestamp": "2025-05-21T04:33:02Z"
  },
  {
    "title": "Elon Musk's pullback from politics comes after his last big investment was a flop",
    "description": "Elon Musk, facing backlash after his candidate's defeat in Wisconsin's Supreme Court race, announced he would reduce political spending. Democrats successfully framed the election as \"People vs. Musk,\" making his involvement toxic.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/elon-musks-pullback-from-politics-comes-after-his-last-big-investment-was-a-flop/articleshow/121306291.cms",
    "timestamp": "2025-05-21T04:31:16Z"
  },
  {
    "title": "Larry Krasner wins Philadelphia’s Democratic primary for a third term as district attorney",
    "description": "Larry Krasner has won Philadelphia’s Democratic primary election to continue serving as district attorney",
    "link": "https://abcnews.go.com/Politics/wireStory/larry-krasner-wins-philadelphias-democratic-primary-term-district-122014277",
    "timestamp": "2025-05-21T04:30:17Z"
  },
  {
    "title": "Elon Musk's pullback from politics comes after his last big investment was a flop",
    "description": "Wisconsin could go down as billionaire Elon Musk's last big spend on a political campaign.  Musk, the richest person in the world, said Tuesday that he would...",
    "link": "https://www.yahoo.com/news/elon-musks-pullback-politics-comes-042748238.html",
    "timestamp": "2025-05-21T04:27:48Z"
  },
  {
    "title": "Buyers recoil from Japanese bonds in warning to BOJ on balance-sheet cuts",
    "description": "The rout in the nation’s $7.8 trillion government bond market is most acute for longer-maturity debt.",
    "link": "https://www.japantimes.co.jp/business/2025/05/21/markets/buyers-strike-in-japanese-bonds/",
    "timestamp": "2025-05-21T04:26:00Z"
  },
  {
    "title": "Spike Lee says ‘people are hurting’ in jab at Trump’s foreign-made film tariffs",
    "description": "‘I don’t know how much we can talk about American values considering who is the president,’ the director said",
    "link": "https://www.the-independent.com/arts-entertainment/films/news/spike-lee-trump-film-tariffs-cannes-highest-2-lowest-b2754950.html",
    "timestamp": "2025-05-21T04:25:16Z"
  },
  {
    "title": "Trump drafts America's business titans to burnish his image at home and abroad",
    "description": "President Donald Trump isn’t the only one who wrapped up a Middle East tour in recent days",
    "link": "https://abcnews.go.com/Business/wireStory/trump-drafts-americas-business-titans-burnish-image-home-122017782",
    "timestamp": "2025-05-21T04:22:28Z"
  },
  {
    "title": "Barry Diller Feels Sorry for Shari Redstone Facing Trump Lawsuit (Christopher Palmeri/Bloomberg)",
    "description": "Christopher Palmeri / Bloomberg:\nBarry Diller Feels Sorry for Shari Redstone Facing Trump Lawsuit  —  Media mogul Barry Diller feels sorry for Paramount Global Chair Shari Redstone, who is trying to sell her company while fighting a lawsuit by President Donal…",
    "link": "https://www.memeorandum.com/250521/p1",
    "timestamp": "2025-05-21T04:15:00Z"
  },
  {
    "title": "Vietnam minister meets Lockheed Martin, SpaceX on U.S. visit for tariff talks",
    "description": "HANOI (Reuters) -Vietnam's Trade Minister Nguyen Hong Dien met officials of U.S. firms such as Excelerate Energy, Lockheed Martin, SpaceX and Google during a...",
    "link": "https://finance.yahoo.com/news/vietnam-minister-meets-lockheed-martin-041129649.html",
    "timestamp": "2025-05-21T04:11:29Z"
  },
  {
    "title": "US importers race to create bonded warehouses amid Trump tariffs",
    "description": "SummaryBonded warehouses offer tariff flexibility amid trade policy volatility Applications for bonded status face delays, costs vary by location and security needs Demand for bonded space surges, but future tariff changes pose risks LONDON/NEW YORK, May 21 (…",
    "link": "https://freerepublic.com/focus/f-news/4318214/posts",
    "timestamp": "2025-05-21T04:10:56Z"
  },
  {
    "title": "Begala: Democrats' Credibility Isn't Hurt at All by Biden Decline, They Were 'Hoping That He Was Doing Fine'",
    "description": "On Tuesday’s broadcast of NPR’s “All Things Considered,” CNN Contributor and Democratic strategist Paul Begala said that the revelations about then-President Joe Biden’s mental fitness don’t impact the credibility of the Democratic Party at all and “I don’t t…",
    "link": "https://www.breitbart.com/clips/2025/05/20/begala-democrats-credibility-isnt-hurt-at-all-by-biden-decline-they-were-hoping-that-he-was-doing-fine/",
    "timestamp": "2025-05-21T04:08:17Z"
  },
  {
    "title": "Trump drafts America's business titans to burnish his image at home and abroad",
    "description": "President Donald Trump isn't the only one who wrapped up a Middle East tour in recent days.  Oil executives and bankers followed, too, as American executives...",
    "link": "https://finance.yahoo.com/news/trump-drafts-americas-business-titans-040710000.html",
    "timestamp": "2025-05-21T04:07:10Z"
  },
  {
    "title": "What to know about the US Senate's effort to block vehicle-emission rules in California",
    "description": "The U.S. Senate is moving forward with an effort to block California's nation-leading standards for vehicle emissions",
    "link": "https://abcnews.go.com/US/wireStory/us-senates-effort-block-vehicle-emission-rules-california-122017332",
    "timestamp": "2025-05-21T04:07:04Z"
  },
  {
    "title": "Trump's tariffs will test unity among allies at G7 finance ministers' summit",
    "description": "Leading financial officials from the world’s richest countries are gathering in a Canadian mountain resort this week for what may prove a contentious meeting in the wake of President Donald Trump’s sweeping tariffs",
    "link": "https://abcnews.go.com/Business/wireStory/trumps-tariffs-test-unity-allies-g7-finance-ministers-122017295",
    "timestamp": "2025-05-21T04:06:33Z"
  },
  {
    "title": "Trump's tariffs will test unity among allies at G7 finance ministers' summit",
    "description": "Leading financial officials from the world’s richest countries are gathering in a Canadian mountain resort this week for what may prove a contentious meeting in the wake of President Donald Trump’s sweeping tariffs",
    "link": "https://abcnews.go.com/US/wireStory/trumps-tariffs-test-unity-allies-g7-finance-ministers-122017289",
    "timestamp": "2025-05-21T04:06:32Z"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,182",
    "description": "These are the key events on day 1,182 of Russia’s war on Ukraine.",
    "link": "https://www.aljazeera.com/news/2025/5/21/russia-ukraine-war-list-of-key-events-day-1182",
    "timestamp": "2025-05-21T04:05:29Z"
  },
  {
    "title": "Could Pope Leo Be the Key Trump Needs for Russia–Ukraine?",
    "description": "Bringing peace to Eastern Europe and beyond seems to need a diplomatic assist from outside Washington.\nThe post Could Pope Leo Be the Key Trump Needs for Russia–Ukraine? appeared first on The American Conservative.",
    "link": "https://www.theamericanconservative.com/could-pope-leo-be-the-key-trump-needs-for-russia-ukraine/",
    "timestamp": "2025-05-21T04:05:00Z"
  },
  {
    "title": "Trump isn’t even Trying to Hide the Racism Anymore",
    "description": "( Tomdispatch.com ) - On May 5th, the New York Metropolitan Museum of Art’s Costume Institute held its annual fundraising gala. The event showcases the extraordinary imaginations of people who design exorbitant clothes and the gutsiness of those who dare (and…",
    "link": "https://www.juancole.com/2025/05/trying-racism-anymore.html",
    "timestamp": "2025-05-21T04:04:02Z"
  },
  {
    "title": "SEC Chair Testifies Before House Appropriations Subcommittee on Financial Services",
    "description": "Chairman Joyce, Ranking Member Hoyer, and members of the Subcommittee. Thank you for inviting me to testify today.[1]\nI am grateful for the opportunity to discuss the SEC, including our important mission on behalf of our fellow citizens, investors, …",
    "link": "https://clsbluesky.law.columbia.edu/2025/05/21/sec-chair-testifies-before-house-appropriations-subcommittee-on-financial-services/",
    "timestamp": "2025-05-21T04:01:06Z"
  },
  {
    "title": "US Imperialists Slow Down the Trumpist Revolution",
    "description": "Many journalists pretend not to understand what’s going on in Washington. For them, Elon Musk and Donald Trump are appropriating what they can from the federal government without changing anything. The reality is quite different: the President of the United S…",
    "link": "https://www.lewrockwell.com/2025/05/thierry-meyssan/us-imperialists-slow-down-the-trumpist-revolution/",
    "timestamp": "2025-05-21T04:01:00Z"
  },
  {
    "title": "Dereliction of duty at the highest level",
    "description": "Former President Joe Biden has cancer. He also suffers from dementia.\r\n\r\nAnyone with no agenda and half a brain knew the latter and has known since Biden first ran for president. And all indications are that his cancer developed over time. So, where ...",
    "link": "https://www.americanthinker.com/blog/2025/05/dereliction_of_duty_at_the_highest_level.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Trump's second-term economy defies the doubters",
    "description": "A quiet revolution is underway—not in the streets or the halls of Congress, but in the minds of voters. Real change can be seen in the numbers behind their optimism. As Donald Trump settles into the early stretch of his second presidential term...",
    "link": "https://www.americanthinker.com/blog/2025/05/trump_s_second_term_economy_defies_the_doubters.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Sarah Brenner, the No. 2 at the FDA, refused the COVID vax",
    "description": "Sara Brenner, worked as a career employee at the FDA until she was recently promoted to the No. 2 position under the new FDA Commissioner. Marty Makary. Brenner has recently stated that she never took the COVID vaccine despite it being a requirement ...",
    "link": "https://www.americanthinker.com/blog/2025/05/sarah_brenner_the_no_2_at_the_fda_refused_the_covid_vax.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Target Russian Oligarchs And Assets To Help Unblock A Ukraine Peace Deal",
    "description": "President Vladimir Putin’s failure to turn up in Istanbul for peace talks with Ukraine’s President Volodymyr Zelenskyy has ratcheted up frustration in the Donald J. Trump administration over any agreement between Russia and Ukraine. Clear...",
    "link": "https://www.americanthinker.com/articles/2025/05/target_russian_oligarchs_and_assets_to_help_unblock_a_ukraine_peace_deal.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Toys should be exempted from tariffs",
    "description": "So far, President Donald Trump’s use of tariffs as a negotiating tactic has proven remarkably successful. In February, the president won concessions from both Canada and Mexico, with both countries committing to heightened enforcement prac...",
    "link": "https://www.americanthinker.com/blog/2025/05/toys_should_be_exempted_from_tariffs.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Democrats’ Confederacy of Dunces",
    "description": "Three hundred years ago, the remarkable satirist Jonathan Swift wrote, “When a true Genius appears in the World, you may know him by this infallible Sign; that the Dunces are all in Confederacy against him.”\r\n\r\nNow, you might not be ...",
    "link": "https://www.americanthinker.com/articles/2025/05/democrats_confederacy_of_dunces.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Democrats and Their Young White Guy Dilemma",
    "description": "They’ll be no coming of age among Democrats. As of 2025, the adolescents are openly in charge and that’s that. No more skulking behind that husk of a man, Joe Biden. Quite an accomplishment. Nearly 60 years after the fabled counterculture...",
    "link": "https://www.americanthinker.com/articles/2025/05/democrats_and_their_young_white_guy_dilemma.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Free speech on campus or not?",
    "description": "Our socialist friends are writhing in dismay at the abrogation of their so-called free speech rights. Exhibits A, B, C, and D are graduate students studying at Columbia (Yunseo Chung from South Korea, Mahmoud Khalil from Syria, and Ranjani Srinivasan...",
    "link": "https://www.americanthinker.com/blog/2025/05/free_speech_on_campus_or_not.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "Trump brings the receipts to South Africa's president on white-farmer killings going on in South Africa",
    "description": "If you're a president of a country that's creating refugees of your people as they flee the country, you probably wouldn't want to be meeting President Trump to gaslight him that all's well.\r\n\r\nThat's what happened when South Afri...",
    "link": "https://www.americanthinker.com/blog/2025/05/trump_brings_the_receipts_to_south_africa_s_president_on_white_farmer_killings_going_on_in_south_africa.html",
    "timestamp": "2025-05-21T04:00:00Z"
  },
  {
    "title": "A rare olive-colored fish in Nevada nears a key step toward endangered species listing",
    "description": "U.S. wildlife officials want to add a rare Nevada fish to the list of endangered species",
    "link": "https://abcnews.go.com/US/wireStory/rare-olive-colored-fish-nevada-nears-key-step-122016682",
    "timestamp": "2025-05-21T03:58:26Z"
  },
  {
    "title": "Former House Republican Slams Trump's 'Dumbest People' For 'Spineless Sycophancy'",
    "description": "Justin Amash tore into the president in a post on social media.",
    "link": "https://www.huffpost.com/entry/justin-amash-trump-dumbest-people_n_682d3fbfe4b0c95f7335ca63",
    "timestamp": "2025-05-21T03:56:46Z"
  },
  {
    "title": "Trump’s Iran nuclear talks faces test as Israel plans solo strike on Tehran’s facilities",
    "description": "New US intelligence reveals Israel is preparing for a potential strike on Iran’s nuclear sites, challenging US President Trump’s push for a new Iran nuclear deal. As diplomacy stalls and tensions escalate, US officials weigh Israel’s intentions and whether th…",
    "link": "https://economictimes.indiatimes.com/news/international/us/trumps-iran-nuclear-talks-faces-test-as-israel-plans-solo-strike-on-tehrans-facilities/articleshow/121305740.cms",
    "timestamp": "2025-05-21T03:54:41Z"
  },
  {
    "title": "Jasmine Crockett Names The Telling Reason Trump 'Hired Everybody From Fox News'",
    "description": "The congresswoman bounced off remarks from a former ICE chief of staff who claimed the Trump administration is engaging in \"political theater.\"",
    "link": "https://www.huffpost.com/entry/jasmine-crockett-trump-hired-fox-news-hosts_n_682d1ec1e4b09b7e50131d41",
    "timestamp": "2025-05-21T03:46:19Z"
  },
  {
    "title": "Cuts did not affect Kentucky NWS warnings during deadly storms, officials say",
    "description": "Officials are hoping to set the record straight that, despite recent cuts, the National Weather Service was not hindered from forecasting this weekend’s deadly storms.",
    "link": "https://freerepublic.com/focus/f-news/4318210/posts",
    "timestamp": "2025-05-21T03:44:44Z"
  },
  {
    "title": "Trump issues ‘Golden Dome’ promise",
    "description": "US President Donald Trump has announced the formal launch of a new nationwide missile defense initiative dubbed the “Golden Dome” Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617940-golden-dome-missile-shield-trump/",
    "timestamp": "2025-05-21T03:44:05Z"
  },
  {
    "title": "PragerU -- Heritage Foundation Senior Legal Fellow: Birthright Citizenship ‘Inconsistent’ with Constitution",
    "description": "Universal birthright citizenship \"isn't required by the 14th Amendment's text or historical context,\" Senior Legal Fellow at the Heritage Foundation Amy Swearer assesses in a video released by PragerU on Monday.\nThe post PragerU — Heritage Foundation Senior L…",
    "link": "https://www.breitbart.com/politics/2025/05/20/prageru-heritage-foundation-legal-fellow-birthright-citizenship-inconsistent-constitution/",
    "timestamp": "2025-05-21T03:43:40Z"
  },
  {
    "title": "The Middle East, \"Center of the World,\" According to the Meta-Analysis of \"Trump of Arabia\" and His Holy Alliance with the GCC, by Alfredo Jalife-Rahme",
    "description": "Alfredo Jalife, one of the greatest geopoliticians of our time, asserts in La Jornada that President Donald Trump has just shaken up politics and the balance of power in the Middle East. While decoupling the United States from Israel, he declared that the Mid…",
    "link": "https://www.voltairenet.org/article222308.html",
    "timestamp": "2025-05-21T03:40:00Z"
  },
  {
    "title": "Pentagon Orders 'Comprehensive Review' Into US Afghanistan Withdrawal",
    "description": "US Defense Secretary Pete Hegseth ordered a &quot;comprehensive review&quot; of the United States&#039; chaotic military withdrawal from Afghanistan in August 2021.",
    "link": "https://www.ndtv.com/world-news/pentagon-orders-comprehensive-review-into-us-afghanistan-withdrawal-8467374",
    "timestamp": "2025-05-21T03:34:25Z"
  },
  {
    "title": "Economic Analysis Shows ‘Big, Beautiful Bill’ Taking From Poor, Giving To Rich",
    "description": "The Congressional Budget Office estimates the Republican bill would shrink resources for low-income households.",
    "link": "https://www.huffpost.com/entry/cbo-big-beautiful-bill-medicaid-snap_n_682d415ae4b09b7e5013308f",
    "timestamp": "2025-05-21T03:33:52Z"
  },
  {
    "title": "How could Jill Biden let it all happen?",
    "description": "Rather than subjecting her husband to endless humiliation, she should have protected him from it. Jill Biden should win the ‘worst wife’ award, Opinion.",
    "link": "https://www.israelnationalnews.com/news/408700",
    "timestamp": "2025-05-21T03:32:30Z"
  },
  {
    "title": "Newt Gingrich Makes His Case For Replacing ‘Profoundly Wrong’ Congressional Budget Office",
    "description": "Former House Speaker Newt Gingrich is urging Republicans on Fox Business Tuesday to dismantle the Congressional Budget Office (CBO).",
    "link": "https://dailycaller.com/2025/05/20/newt-gingrich-republicans-congressional-budget-office/",
    "timestamp": "2025-05-21T03:32:12Z"
  },
  {
    "title": "This is treason at highest level: Trump accuses Biden's staffers of 'stealing the Presidency' on border issue",
    "description": "Donald Trump has launched a fierce attack on Joe Biden's administration, accusing them of treason for implementing open border policies that he claims nearly destroyed the United States. Trump alleges that Biden's team knowingly exploited his cognitive impair…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/this-is-treason-at-highest-level-trump-accuses-bidens-staffers-of-stealing-the-presidency-on-border-issue/articleshow/121305416.cms",
    "timestamp": "2025-05-21T03:28:33Z"
  },
  {
    "title": "EU releases funding to keep Radio Free Europe afloat",
    "description": "The emergency funding would not cover Radio Free Europe across the globe, but only in select European and Asian countries. The pro-democracy outlet's funds were cut off by the Trump administration.",
    "link": "https://www.dw.com/en/eu-releases-funding-to-keep-radio-free-europe-afloat/a-72617621",
    "timestamp": "2025-05-21T03:28:00Z"
  },
  {
    "title": "Rubio Clashes with Sen. Kaine Over Afrikaner Refugees: 'You Don't Like that They're White'",
    "description": "Secretary of State Marco Rubio clashed with Democrats over the Trump administration's recent acceptance of South African refugees, telling Sen. Tim Kaine (D-VA) that he does not \"like the fact that they’re white\" in a Tuesday exchange.\nThe post Rubio Clashes …",
    "link": "https://www.breitbart.com/politics/2025/05/20/rubio-clashes-with-sen-kaine-over-afrikaner-refugees-you-dont-like-that-theyre-white/",
    "timestamp": "2025-05-21T03:26:58Z"
  },
  {
    "title": "Trump selects concept for $175 billion 'Golden Dome' missile defense system",
    "description": "President Donald Trump has announced the concept he wants for his future Golden Dome missile defense program — a multilayered system that for the first time will put U.S. weapons in space",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-selects-concept-175-billion-golden-dome-missile-121993225",
    "timestamp": "2025-05-21T03:26:21Z"
  },
  {
    "title": "Will Continue Stripping Student Visas, Marco Rubio During Heated Hearing",
    "description": "US Secretary of State Marco Rubio vowed to keep stripping visas from students in a fiery Senate hearing where rival Democrats accused him of trampling on free speech of Israel critics.",
    "link": "https://www.ndtv.com/world-news/will-continue-stripping-student-visas-marco-rubio-during-heated-senate-hearing-8467329",
    "timestamp": "2025-05-21T03:24:00Z"
  },
  {
    "title": "US Ambassador slams Houthi terror: Israel has the right to defend itself",
    "description": "US Ambassador to the UN Dorothy Shea condemns Houthi terrorists, affirms US support for Israel's right to respond to Houthi missile attacks.",
    "link": "https://www.israelnationalnews.com/news/408699",
    "timestamp": "2025-05-21T03:23:49Z"
  },
  {
    "title": "Trump unveils plans for 'Golden Dome' missile defence system",
    "description": "WASHINGTON &mdash; United States President Donald Trump unveiled plans for his \"Golden Dome\" missile defence shield Tuesday, predicting that the ambitious plan to expand the country&rsquo;s air defence system would be completed by the end of his term.",
    "link": "https://www.bangkokpost.com/world/3030851/trump-unveils-plans-for-golden-dome-missile-defence-system",
    "timestamp": "2025-05-21T03:20:00Z"
  },
  {
    "title": "REPORT: Joe Biden’s Cabinet Meetings Were Scripted, Used Cameras Creatively to Cover Mistakes",
    "description": "The hits just keep coming for Joe Biden’s presidency and the Democrat party. One of the details in Jake Tapper’s book, which came out today, is that Biden’s cabinet meetings were scripted, meaning that they were little more than theater. People in these meeti…",
    "link": "https://freerepublic.com/focus/f-news/4318208/posts",
    "timestamp": "2025-05-21T03:17:48Z"
  },
  {
    "title": "Beau Biden Fighting Elder Abuse",
    "description": "Beau Biden’s PSA on fighting elder abuse. https://www.youtube.com/watch?v=tL6QJNM6z0U",
    "link": "https://freerepublic.com/focus/f-chat/4318206/posts",
    "timestamp": "2025-05-21T03:11:36Z"
  },
  {
    "title": "Trump has to decide: End Israel's war on Gaza or let Smotrich have his way",
    "description": "Though Trump can force a cease-fire – and wants a deal  –  he's sitting on the fence, in the hope that Israel and Hamas will reach an understanding on their own. In his place, other countries are joining forces and considering sanctions",
    "link": "https://www.haaretz.com/israel-news/2025-05-21/ty-article/.premium/trump-has-to-decide-end-israels-war-on-gaza-or-let-smotrich-have-his-way/00000196-ef0b-d945-a5b6-ff3be1030000",
    "timestamp": "2025-05-21T03:06:42Z"
  },
  {
    "title": "RFK Jr. Tries to Steamroll Democratic Senator Until Republican Tells Him to ‘Let the Senator Ask the Questions’",
    "description": "Health and Human Services Secretary Robert F. Kennedy Jr. verbally sparred with Sen. Patty Murray (D-WA) at a Senate committee hearing Tuesday, repeatedly interrupting her until the senator appealed to a Republican colleague to intervene.\nThe post RFK Jr. Tri…",
    "link": "https://www.mediaite.com/politics/rfk-jr-tries-to-steamroll-democratic-senator-until-republican-tells-him-to-let-the-senator-ask-the-questions/",
    "timestamp": "2025-05-21T03:05:46Z"
  },
  {
    "title": "Summit County Health Department unsure about funding amid potential federal cuts - Park Record",
    "description": "Summit County Health Department officials expect federal budget cuts will impact public health funding at the local level in the near future.",
    "link": "http://www.parkrecord.com/2025/05/20/summit-county-health-department-unsure-about-funding-amid-potential-federal-cuts/",
    "timestamp": "2025-05-21T03:04:42Z"
  },
  {
    "title": "Trump’s wake-up call for India’s foreign policy",
    "description": "Trump may have done India a favor. His actions have exposed an uncomfortable truth: Under his leadership, the U.S. is not a dependable partner in matters of security.",
    "link": "https://www.japantimes.co.jp/commentary/2025/05/21/japan/trump-indias-foreign-policy/",
    "timestamp": "2025-05-21T03:04:00Z"
  },
  {
    "title": "Pittsburgh mayoral primary sees major upset as ‘old guard’ candidate defeats progressive incumbent Ed Gainey",
    "description": "Pittsburgh Mayor Ed Gainey was ousted Tuesday in a stiff Democratic primary challenge from Corey O'Connor, who also outraised and outspent the incumbent on the campaign trail.",
    "link": "https://www.foxnews.com/politics/pittsburgh-mayoral-primary-major-upset-old-guard-candidate-defeats-progressive-incumbent-ed-gainey",
    "timestamp": "2025-05-21T02:49:45Z"
  },
  {
    "title": "‘How Is It They Get Away With This?’ Fmr State Dept Official Describes How Taxpayer Funds Fueled Global Heroin Trade",
    "description": "Mike Benz revealed Tuesday what he describes as a decades-long, taxpayer-funded drug economy that funneled U.S. resources into heroin production.",
    "link": "https://dailycaller.com/2025/05/20/mike-benz-usaid-heroin-poppy/",
    "timestamp": "2025-05-21T02:48:48Z"
  },
  {
    "title": "US Justice Department investigating former New York governor Cuomo, sources say",
    "description": "WASHINGTON (Reuters) -The U.S. Justice Department is investigating Democrat Andrew Cuomo, a leading candidate for mayor of New York City, over Republican allegations that he lied to Congress about what he did as New York governor during the coronavirus pandem…",
    "link": "https://www.thestar.com.my/news/world/2025/05/21/us-justice-department-investigating-former-new-york-governor-cuomo-sources-say",
    "timestamp": "2025-05-21T02:43:00Z"
  },
  {
    "title": "Elon Musk says he's committed to still be Tesla's CEO in five years' time",
    "description": "Tesla has faced intense pressure as Musk worked with Trump as part of its self-described Department of Government Efficiency effort, particularly amid its campaign of cuts across the U.S. federal government. Asked about his political donations, which include …",
    "link": "https://economictimes.indiatimes.com/tech/technology/elon-musk-says-hes-committed-to-still-be-teslas-ceo-in-five-years-time/articleshow/121304633.cms",
    "timestamp": "2025-05-21T02:42:34Z"
  },
  {
    "title": "Ukraine distracting West from ‘more serious’ issues – Rubio",
    "description": "The US Secretary of State has defended President Donald Trump’s reluctance to impose further sanctions on Moscow and send more arms to Kiev Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617939-ukraine-distracting-serious-issues/",
    "timestamp": "2025-05-21T02:39:47Z"
  },
  {
    "title": "All About Trump's Golden Dome Defence System, 1st US Weapon In Space",
    "description": "United States President Donald Trump on Tuesday unveiled new details on his plan for a missile defence system known as &quot;Golden Dome&quot;, which is estimated to cost a total of some $175 billion.",
    "link": "https://www.ndtv.com/world-news/all-about-trumps-golden-dome-defense-system-1st-us-weapon-in-space-8467125",
    "timestamp": "2025-05-21T02:39:40Z"
  },
  {
    "title": "China slams US ‘bullying’ over new chip warnings",
    "description": "Beijing condemned on Wednesday new US warnings on the use of AI chips made in China, vowing it would take steps against “bullying” efforts to restrict access to high-tech semiconductors and supply chains. Washington has sought in recent years to curb exports …",
    "link": "https://www.digitaljournal.com/world/china-slams-us-bullying-over-new-chip-warnings/article",
    "timestamp": "2025-05-21T02:32:34Z"
  }
]