[
  {
    "title": "Which economy did best in 2025?",
    "description": "It could have been a lot worse. In April, as President Donald Trump started his trade war, investors and many economists braced for a steep global recession. In the end, global gdp will probably grow by around 3% this year, the same as last. Unemployment rema…",
    "link": "https://biztoc.com/x/bbe120fd447b100d",
    "timestamp": "2025-12-07T21:47:48Z"
  },
  {
    "title": "Marjorie Taylor Greene Tells ’60 Minutes’ That ‘It Would Shock People’ to Hear How Congressional Republicans Talk About Trump in Private",
    "description": "Marjorie Taylor Greene told \"60 Minutes\" \"it would shock people\" to hear how Congressional Republicans talk about the president behind his back.\nThe post Marjorie Taylor Greene Tells ’60 Minutes’ That ‘It Would Shock People’ to Hear How Congressional Republic…",
    "link": "https://www.mediaite.com/media/news/marjorie-taylor-greene-tells-60-minutes-that-it-would-shock-people-to-hear-how-congressional-republicans-talk-about-trump-in-private/",
    "timestamp": "2025-12-07T21:41:49Z"
  },
  {
    "title": "100 kidnapped Nigerian schoolchildren released: UN source, presidency",
    "description": "Nigerian authorities have secured the release of 100 kidnapped schoolchildren taken by gunmen from a Catholic school last month, a UN source and local media ...",
    "link": "https://www.yahoo.com/news/articles/100-kidnapped-nigerian-schoolchildren-released-214024536.html",
    "timestamp": "2025-12-07T21:40:24Z"
  },
  {
    "title": "Ilhan Omar says she's frustrated since Somalis are also victims in 'Feeding Our Future' scam",
    "description": "Rep. Ilhan Omar, D-Minn., suggested that people were forgetting Somalis had also been victimized in the \"Feeding Our Future\" fraud scam, saying she was upset about the scheme.",
    "link": "https://www.foxnews.com/media/ilhan-omar-says-shes-frustrated-since-somalis-also-victims-feeding-our-future-scam",
    "timestamp": "2025-12-07T21:40:18Z"
  },
  {
    "title": "Netflix Chief Ted Sarandos Scored White House Meeting With Trump Ahead of Warner Bros. Deal",
    "description": "Ted Sarandos scored a critical sit-down with President Donald Trump in the weeks leading up to Netflix’s successful $82.7 billion agreement to buy Warner Bros. and HBO Max, according to sources familiar with the confab. The meeting, which took place in the Ov…",
    "link": "https://variety.com/2025/biz/news/netflix-ted-sarandos-white-house-meeting-trump-warner-bros-deal-1236602831/",
    "timestamp": "2025-12-07T21:37:11Z"
  },
  {
    "title": "Look Who's Suddenly Worried About Insurance Company Profits!",
    "description": "As The Hill reported earlier this week, Republicans are barreling toward a vote on health care with the ACA subsidies expiring without a clear plan:\nSome Senate Republicans are expressing frustration that their conference hasn’t been able to unify behind a he…",
    "link": "https://crooksandliars.com/2025/12/look-whos-suddenly-worried-about-insurance",
    "timestamp": "2025-12-07T21:30:45Z"
  },
  {
    "title": "Nova Scotia To Sell Off Remaining American Booze",
    "description": "Since March, Nova Scotia has pulled all U.S. alcohol products from store shelves in response to Trump's tariffs. That created a storage problem, though. Since selling American alcohol isn't politically possible at the moment in most Canadian provinces, that j…",
    "link": "https://crooksandliars.com/2025/12/nova-scotia-sell-remaining-american-booze",
    "timestamp": "2025-12-07T21:30:44Z"
  },
  {
    "title": "Rosie O'Donnell's Trump obsession continues unabated from Ireland as friends beg her to 'disconnect'",
    "description": "Comedian moved to Ireland after Trump's re-election but continues breaking vows to stay off social mediaRosie O’Donnell is sounding the alarm about her ongoing fixation with President Donald Trump. The 63-year-old, along with some of her friends and family, s…",
    "link": "https://freerepublic.com/focus/f-news/4356367/posts",
    "timestamp": "2025-12-07T21:29:25Z"
  },
  {
    "title": "Trump: Other countries do not challenge tariff system",
    "description": "United States President Donald Trump claimed on Sunday that other countries did not question the tariffs he imposed on their products, unlike certain national institutions.\"While the United States has...",
    "link": "https://biztoc.com/x/63476a5654aee75a",
    "timestamp": "2025-12-07T21:25:48Z"
  },
  {
    "title": "Key GOP senator says he has no objection to releasing video of strike that killed two survivors",
    "description": "The Republican who leads the Senate Intelligence Committee says a video of a U_S_ military strike on an alleged drug boat in the Caribbean that killed two survivors of the initial attack shows “nothing remarkable.\"",
    "link": "https://abcnews.go.com/US/wireStory/key-gop-senator-objection-releasing-video-strike-killed-128192005",
    "timestamp": "2025-12-07T21:25:39Z"
  },
  {
    "title": "Trump Might Abandon Ukraine, Don Jr. Warns",
    "description": "Donald Trump Jr. weighed in on the Russia-Ukraine war this weekend with this ominous message: No one should bet on his father, the president of the United States, to stand by Ukraine.As Politico reported Sunday, the president’s eldest son made several comment…",
    "link": "https://newrepublic.com/post/204084/donald-trump-jr-ukraine-russia-doha",
    "timestamp": "2025-12-07T21:25:35Z"
  },
  {
    "title": "Divided U.S. Fed set for contentious interest rate meeting",
    "description": "While the U.S. Federal Reserve's final interest rate meeting this year could see an unusual amount of division, financial markets view a third straight interest rate cut as nearly certain. When the Fed last met in October, Chair Jerome Powell asserted that an…",
    "link": "https://japantoday.com/category/business/divided-us-fed-set-for-contentious-interest-rate-meeting",
    "timestamp": "2025-12-07T21:22:19Z"
  },
  {
    "title": "Judge deals setback to Justice Department effort to seek new indictment against Comey",
    "description": "A federal judge has dealt a setback to Justice Department efforts to seek a new indictment against former FBI Director James Comey, temporarily barring prosecutors from using evidence they had relied on when they initially secured criminal charges. The ruling…",
    "link": "https://japantoday.com/category/world/judges-deal-setback-to-justice-department-effort-to-seek-new-indictment-against-comey",
    "timestamp": "2025-12-07T21:19:09Z"
  },
  {
    "title": "Key GOP senator says he has no objection to releasing video of strike that killed two survivors",
    "description": "A video of a U.S. military strike on an alleged drug boat in the Caribbean that killed two survivors of the initial attack shows “nothing remarkable,” the Republican who leads the Senate Intelligence Committee said Sunday, and he would not oppose its public r…",
    "link": "https://japantoday.com/category/world/key-gop-senator-says-he-has-no-objection-to-releasing-video-of-strike-that-killed-two-survivors",
    "timestamp": "2025-12-07T21:18:57Z"
  },
  {
    "title": "Nigerian government secures release of 100 kidnapped schoolchildren",
    "description": "Nigeria's government has secured the release of 100 schoolchildren who were abducted last month in Niger state in one of the country's worst mass kidnappings to date, local broadcaster Channels Television reported on Sunday. The Christian Association of Niger…",
    "link": "https://japantoday.com/category/world/nigerian-government-secures-release-of-100-kidnapped-schoolchildren-channels-tv-says",
    "timestamp": "2025-12-07T21:18:52Z"
  },
  {
    "title": "U.S. border czar Homan defends immigration crackdown on Somalis in Minnesota",
    "description": "White House border czar Tom Homan on Sunday defended President Donald Trump's immigration crackdown in Minnesota, saying the state is home to a large illegal Somali community despite local officials' comments that the vast majority of Somalis in the U.S. are …",
    "link": "https://japantoday.com/category/world/us-border-czar-homan-defends-immigration-crackdown-on-somalis-in-minnesota",
    "timestamp": "2025-12-07T21:18:39Z"
  },
  {
    "title": "Kremlin praises new U.S. security strategy as Russian strikes kill 4 in Ukraine",
    "description": "Russia on Sunday welcomed the Trump administration’s new national security strategy in comments by the Kremlin spokesman published by Russia’s Tass news agency. Dmitry Peskov said the updated strategic document was largely in line with Moscow’s vision. “There…",
    "link": "https://japantoday.com/category/world/russian-strikes-kill-1-as-us-and-ukraine-officials-wrap-up-third-day-of-diplomatic-talks",
    "timestamp": "2025-12-07T21:18:23Z"
  },
  {
    "title": "Netanyahu says Israel and Hamas will enter ceasefire's second phase soon",
    "description": "Israeli Prime Minister Benjamin Netanyahu said Sunday that Israel and Hamas are “very shortly expected to move into the second phase of the ceasefire,” after Hamas returns the remains of the last hostage held in Gaza. Netanyahu spoke during a news conference …",
    "link": "https://japantoday.com/category/world/netanyahu-says-israel-and-hamas-will-soon-begin-second-phase-of-gaza-ceasefire",
    "timestamp": "2025-12-07T21:18:17Z"
  },
  {
    "title": "‘Sort of blackmail’: Billions in rural health funding hinge on states passing Trump-backed policies - NewsBreak",
    "description": "Democrats and health advocates described the strategy as highly unusual, and some fear it could be wielded to favor political allies.",
    "link": "https://www.newsbreak.com/share/4385673783630-sort-of-blackmail-billions-in-rural-health-funding-hinge-on-states-passing-trump-backed-policies?s=a2&amp;share_destination_id=MjI0MTEwNzc1LTE3NjUxNDIxMzg2MzI%3D&amp;pd=0FALRvVD&amp;hl=en_US&amp;send_time=1765142138&amp;actBtn=bottomBar&amp;_f=app_share&amp;trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.49.0%22%2C%22languages%22%3A%22en%22%7D",
    "timestamp": "2025-12-07T21:16:42Z"
  },
  {
    "title": "Analyst worries boat strikes unlikely to deter Trump's 'long-lost son': 'He's bulletproof'",
    "description": "President Donald Trump's Defense Secretary, Pete Hegseth, seems unlikely to face any accountability for the strikes against alleged drug boats in international waters, according to one analyst. Since taking office, the Trump administration has conducted over …",
    "link": "https://www.rawstory.com/pete-hegseth-2674377018/",
    "timestamp": "2025-12-07T21:14:47Z"
  },
  {
    "title": "GOP Senator Makes Pathetic Excuse for Trump’s Anti-Somali Hate",
    "description": "Republican Senator John Curtis of Utah on Sunday offered a mealymouthed excuse for President Donald Trump’s xenophobic attacks on the Somali community.“We don’t want ’em in our country,” Trump said of Somali immigrants at a Tuesday Cabinet meeting. “Let ’em g…",
    "link": "https://newrepublic.com/post/204086/gop-john-curtis-trump-anti-somali-hate",
    "timestamp": "2025-12-07T21:03:33Z"
  },
  {
    "title": "Hamas willing to discuss 'storing or freezing' weapons",
    "description": "Hamas official Bassem Naim expresses openness to freezing or storing weapons as part of long-term ceasefire, but rejects external forces disarming Hamas.",
    "link": "https://www.israelnationalnews.com/news/418962",
    "timestamp": "2025-12-07T21:02:06Z"
  },
  {
    "title": "Would a UK-style 'mansion tax' work here?",
    "description": "Economists say Ireland needs a more reliable revenue stream – and taxing property is one way to get it.",
    "link": "https://www.thejournal.ie/would-the-uks-new-mansion-tax-work-in-ireland-6892585-Dec2025/",
    "timestamp": "2025-12-07T21:00:12Z"
  },
  {
    "title": "Donald Trump and humanity’s official happiness provider team up to turn World Cup weird",
    "description": "Gianni Infantino can be Johnny, but Rio Ferdinand is no Pele",
    "link": "https://www.irishtimes.com/sport/2025/12/07/donald-trump-and-humanitys-official-happiness-provider-team-up-to-turn-world-cup-weird/",
    "timestamp": "2025-12-07T21:00:00Z"
  },
  {
    "title": "Netanyahu says Israel and Hamas will soon enter second phase of ceasefire",
    "description": "Israeli Prime Minister Benjamin Netanyahu said Sunday that Israel and Hamas are “very shortly expected to move into the second phase of the ceasefire,” after Hamas returns the remains of the last hostage held in Gaza.",
    "link": "https://www.pbs.org/newshour/world/netanyahu-says-israel-and-hamas-will-soon-enter-second-phase-of-ceasefire",
    "timestamp": "2025-12-07T20:54:20Z"
  },
  {
    "title": "Sources: Ted Sarandos Met With Donald Trump Ahead of Netflix's Winning Warner Bros. Deal (Borys Kit/The Hollywood Reporter)",
    "description": "Borys Kit / The Hollywood Reporter:\nSources: Ted Sarandos Met With Donald Trump Ahead of Netflix's Winning Warner Bros. Deal  —  As the streaming giant aims to acquire the legacy studio, multiple insiders say that a recent conversation between its CEO and the…",
    "link": "https://www.memeorandum.com/251207/p49",
    "timestamp": "2025-12-07T20:50:01Z"
  },
  {
    "title": "US border czar Homan defends immigration crackdown on Somalis in Minnesota",
    "description": "<![CDATA[ Trump described the Somali community as \"garbage\" last week. ]]>",
    "link": "https://www.channelnewsasia.com/world/us-border-czar-homan-defends-immigration-crackdown-somalis-in-minnesota-5566811",
    "timestamp": "2025-12-07T20:48:25Z"
  },
  {
    "title": "Netflix co-CEO reportedly discussed Warner Bros. deal with Trump | TechCrunch",
    "description": "Will Netflix’s $82.7 billion deal to acquire Warner Bros. get approval from federal regulators? While Paramount was assumed to be the frontrunner to",
    "link": "https://techcrunch.com/2025/12/07/netflix-co-ceo-reportedly-discussed-warner-bros-deal-with-trump/",
    "timestamp": "2025-12-07T20:47:59Z"
  },
  {
    "title": "Democratic Senator Strongly Suggests She Watched Video of Hegseth’s Alleged ‘Double Tap’ Strike — Then Walks it Back Just 60 Seconds Later",
    "description": "Sen. Tammy Duckworth walked back her claim she watched the classified video of Pete Hegseth's alleged \"double tap\" strike after making it 60 second earlier\nThe post Democratic Senator Strongly Suggests She Watched Video of Hegseth’s Alleged ‘Double Tap’ Strik…",
    "link": "https://www.mediaite.com/opinion/democratic-senator-strongly-suggests-she-watched-video-of-hegseths-alleged-double-tap-strike-then-walks-it-back-just-60-seconds-later/",
    "timestamp": "2025-12-07T20:45:25Z"
  },
  {
    "title": "Trump slams Democratic congressman as disloyal for not switching parties after pardon and vows ‘no more Mr. Nice guy’ next time",
    "description": "Donald Trump is angry that Rep. Henry Cuellar is running again as a Democrat rather than switch parties after the president pardoned the Texas congressman and his wife in a federal bribery and conspiracy case.\nTrump blasted Cuellar for “Such a lack of LOYALTY…",
    "link": "https://biztoc.com/x/6e9bcbaa7eecda7b",
    "timestamp": "2025-12-07T20:41:07Z"
  },
  {
    "title": "Nigeria secures release of 100 kidnapped children",
    "description": "Nigeria's government has secured the release of 100 schoolchildren who were abducted last month in Niger state in one of the country's worst mass kidnappings to date, local media reported.",
    "link": "https://www.rte.ie/news/2025/1207/1547782-nigerian-school-kidnapping/",
    "timestamp": "2025-12-07T20:39:01Z"
  },
  {
    "title": "A Korean-style freeze in eastern Europe",
    "description": "But 'ending the daily carnage would matter enormously'",
    "link": "https://www.wnd.com/2025/12/korean-style-freeze-eastern-europe/",
    "timestamp": "2025-12-07T20:37:12Z"
  },
  {
    "title": "US may end support for Ukraine war effort, says Donald Trump Jr",
    "description": "Donald Trump may walk away from the Ukrainian war, the US president’s oldest son has said in comments to a Middle East conference. In a lengthy tirade against the purpose of continued fighting in Ukraine, Donald Trump Jr also said Ukraine’s “corrupt” rich had…",
    "link": "https://freerepublic.com/focus/f-news/4356361/posts",
    "timestamp": "2025-12-07T20:35:45Z"
  },
  {
    "title": "Steve Scalise: Republicans 'Bringing a Number' of Healthcare Bills to House Floor in 'the Next Few Weeks'",
    "description": "House Majority Leader Steve Scalise explained on Friday that House Republicans are introducing a series of healthcare bills that would alleviate the high costs due to Obamacare.\nThe post Steve Scalise: Republicans ‘Bringing a Number’ of Healthcare Bills to Ho…",
    "link": "https://www.breitbart.com/politics/2025/12/07/steve-scalise-republicans-bringing-a-number-of-healthcare-bills-to-house-floor-in-the-next-few-weeks/",
    "timestamp": "2025-12-07T20:34:29Z"
  },
  {
    "title": "Rep. Ilhan Omar Says Stephen Miller's Rhetoric Echoes Language Used By Nazis",
    "description": "The Somali American lawmaker's comment comes after the noted racist and Homeland Security adviser essentially said migrants are ruining the U.S.",
    "link": "https://www.huffpost.com/entry/ilhan-omar-stephen-miller-rhetoric-immigrants-nazis_n_6935c8eae4b0a1c98be25e1f",
    "timestamp": "2025-12-07T20:34:03Z"
  },
  {
    "title": "Insiders Reveal Trump May Axe ICE Barbie Over Secret Romance",
    "description": "For Kristi Noem, the price of love may be her job. Donald Trump is reportedly considering firing his Homeland Security Secretary over the problematic...",
    "link": "https://www.thedailybeast.com/insiders-reveal-trump-may-axe-ice-barbie-over-secret-romance/",
    "timestamp": "2025-12-07T20:32:36Z"
  },
  {
    "title": "Ticket sales plummet at Kennedy Center amid Trump’s takeover: ‘Costs are huge!’",
    "description": "Ticket sales for the Kennedy Center’s annual performance of “The Nutcracker” have plummeted under the new leadership of President Donald Trump, who took over as the organization’s chairman earlier this year, CNN reported\r\n Saturday.According to internal sales…",
    "link": "https://www.rawstory.com/kennedy-center-2674376979/",
    "timestamp": "2025-12-07T20:29:36Z"
  },
  {
    "title": "The Irish Times view on US foreign policy: Trump’s gunboat diplomacy",
    "description": "Pete Hegseth has overseen a huge military build-up against Venezuela in the Caribbean",
    "link": "https://www.irishtimes.com/opinion/editorials/2025/12/07/the-irish-times-view-on-us-foreign-policy-trumps-gunboat-diplomacy/",
    "timestamp": "2025-12-07T20:29:00Z"
  },
  {
    "title": "Jordon Hudson continues to surprise Bill Belichick and now asks Trump and the U.S. government for help",
    "description": "Jordon Hudson, the 24-year-old girlfriend of North Carolina Tar Heels head coach Bill Belichick, is speaking out for Maine&apos;s struggling fishing communities. \nA former college",
    "link": "https://www.marca.com/en/ncaa/2025/12/07/6935cc10ca4741ba298b457c.html",
    "timestamp": "2025-12-07T20:24:57Z"
  },
  {
    "title": "Nigeria secures release of 100 abducted schoolchildren from Catholic school after weeks in captivity",
    "description": "Nigeria secured the release of 100 abducted schoolchildren from Niger state after month-long ordeal, amid ongoing persecution concerns against Christians.",
    "link": "https://www.foxnews.com/world/nigeria-secures-release-100-abducted-schoolchildren-from-catholic-school-after-weeks-captivity",
    "timestamp": "2025-12-07T20:24:36Z"
  },
  {
    "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
    "description": "Treasury Secretary Scott Bessent said the economy will end the year on strong footing and said the president was disappointed in economic coverage in the media.",
    "link": "https://www.cnbc.com/2025/12/07/bessent-gdp-growth.html",
    "timestamp": "2025-12-07T20:22:42Z"
  },
  {
    "title": "‘Compete for eyeballs’: FCC considers jettisoning longstanding rule limiting broadcasters",
    "description": "Trump opposing idea to let networks get larger: 'A VIRTUAL ARM OF THE DEMOCRAT PARTY'",
    "link": "https://www.wnd.com/2025/12/compete-eyeballs-fcc-considers-jettisoning-longstanding-rule-limiting/",
    "timestamp": "2025-12-07T20:20:19Z"
  },
  {
    "title": "Trump slams pardoned Democratic congressman as 'disloyal' for not switching parties (Bill Barrow/Associated Press)",
    "description": "Bill Barrow / Associated Press:\nTrump slams pardoned Democratic congressman as ‘disloyal’ for not switching parties  —  Donald Trump is angry that Rep. Henry Cuellar is running again as a Democrat rather than switch parties after the president pardoned the Te…",
    "link": "https://www.memeorandum.com/251207/p47",
    "timestamp": "2025-12-07T20:20:00Z"
  },
  {
    "title": "US border czar Homan defends immigration crackdown on Somalis in Minnesota",
    "description": "WASHINGTON, Dec 7 (Reuters) - White House border czar Tom Homan on Sunday defended President Donald Trump's immigration crackdown in Minnesota, saying the state is home to a large illegal Somali community despite local officials' comments that the vast majori…",
    "link": "https://www.thestar.com.my/news/world/2025/12/08/us-border-czar-homan-defends-immigration-crackdown-on-somalis-in-minnesota",
    "timestamp": "2025-12-07T20:19:00Z"
  },
  {
    "title": "Kremlin says new US security strategy accords largely with Russia's view",
    "description": "<![CDATA[ European countries concerned that US no longer recognizing Russia as a direct threat puts the continent under greater military pressure. ]]>",
    "link": "https://www.channelnewsasia.com/world/kremlin-says-new-us-security-strategy-accords-largely-russias-view-5566556",
    "timestamp": "2025-12-07T20:17:41Z"
  },
  {
    "title": "Trump claims he has 'other methods' of getting around Supreme Court's big tariff decision",
    "description": "President Donald Trump suggested on Sunday that he has \"other ways\" of charging tariffs against foreign countries regardless of what the Supreme Court says in an upcoming opinion. The Supreme Court is expected to issue a decision this upcoming week regarding …",
    "link": "https://www.rawstory.com/trump-tariffs-2674376992/",
    "timestamp": "2025-12-07T20:15:07Z"
  },
  {
    "title": "Nigerian government secures release of 100 abducted schoolchildren - reports",
    "description": "More than 300 children and 12 teachers were taken from a  Catholic boarding school in Niger state last month, in one of Nigeria's worst mass kidnappings to date.",
    "link": "https://news.sky.com/story/nigerian-government-secures-release-of-100-abducted-schoolchildren-reports-13480745",
    "timestamp": "2025-12-07T20:15:00Z"
  },
  {
    "title": "Sources: Ted Sarandos Met With Donald Trump Ahead of Netflix’s Winning Warner Bros. Deal - The Hollywood Reporter",
    "description": "Sources: Ted Sarandos Met With Donald Trump Ahead of Netflix’s Winning Warner Bros. DealThe Hollywood Reporter Netflix’s Sarandos Wooed Trump Personally Ahead of Warner BidBloomberg.com Trump Reportedly Backing Netflix Deal as Paramount’s David Ellison Blunde…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180324373",
    "timestamp": "2025-12-07T20:12:47Z"
  },
  {
    "title": "Inside President Trump's new 'America First' national security strategy",
    "description": "With the first year of the second Trump administration coming to a close, Present Donald Trump has articulated a new national security strategy that will \"build upon\" his substantial achievements thus far. On Friday, the Trump administration published a docum…",
    "link": "https://www.theblaze.com/news/inside-president-trump-s-new-america-first-national-security-strategy",
    "timestamp": "2025-12-07T20:10:00Z"
  },
  {
    "title": "Trump criticises Democrat he pardoned over not switching political parties",
    "description": "Texas Representative Henry Cuellar is running for re-election as a Democrat after Trump pardoned him.",
    "link": "https://www.bbc.com/news/articles/cwyw5vwrp9jo",
    "timestamp": "2025-12-07T20:08:13Z"
  },
  {
    "title": "Netflix CEO Ted Sarandos Met With Donald Trump Ahead of Warner Bros. Takeover Bid",
    "description": "Netflix CEO Ted Sarandos met with Donald Trump at the White House in mid-November to discuss the streamer's planned bid to purchase Warner Bros., Bloomberg and others reported Sunday, with the president insisting that Warner Bros. should sell to the company o…",
    "link": "https://www.thewrap.com/netflix-ceo-ted-sarandos-met-donald-trump-warner-bros-bid/",
    "timestamp": "2025-12-07T20:01:09Z"
  },
  {
    "title": "“Stupid and Nasty”: Trump goes after Kaitlan Collins",
    "description": "The CNN anchor responded after Trump posted churlish criticism about her reporting on the White House expansion",
    "link": "https://www.salon.com/2025/12/07/stupid-and-nasty-trump-goes-after-kaitlan-collins/",
    "timestamp": "2025-12-07T20:00:46Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "The most important Irish and international stories you need to know today.",
    "link": "https://www.thejournal.ie/news-fix-27-12-25-6896460-Dec2025/",
    "timestamp": "2025-12-07T20:00:25Z"
  },
  {
    "title": "Bond Traders Defy the Fed and Spark Heated Debate on Wall Street",
    "description": "With Trump soon able to replace Chair Jerome Powell with his own nominee, on top of everything else is the risk of the Fed squandering its credibility by...",
    "link": "https://finance.yahoo.com/news/bond-traders-defy-fed-spark-200000838.html",
    "timestamp": "2025-12-07T20:00:00Z"
  },
  {
    "title": "‘Sort of blackmail’: Billions in rural health funding hinge on states passing Trump-backed policies",
    "description": "Democrats and health advocates described the strategy as highly unusual, and some fear it could be wielded to favor political allies.",
    "link": "https://www.politico.com/news/2025/12/07/sort-of-blackmail-billions-in-rural-health-funding-hinge-on-states-passing-trumps-policies-00679082",
    "timestamp": "2025-12-07T20:00:00Z"
  },
  {
    "title": "The Next Frontier for Critical Minerals",
    "description": "There is a rising global interest in extracting much-needed critical minerals from the Arctic to meet the growing needs for various metals and minerals. However, environmentalists are concerned about what impact the exploitation of vast untapped reserves in t…",
    "link": "https://oilprice.com/Energy/Energy-General/The-Next-Frontier-for-Critical-Minerals.html",
    "timestamp": "2025-12-07T20:00:00Z"
  },
  {
    "title": "The US fired on survivors clinging to a 'drug boat' — who gave the order?",
    "description": "What happened in the lead-up to a second strike on a speedboat in the Caribbean — who knew what and when, and who gave what order — is now under scrutiny.",
    "link": "https://www.abc.net.au/news/2025-12-08/pete-hegseth-venezuela-boat-strike/106101966",
    "timestamp": "2025-12-07T19:51:47Z"
  },
  {
    "title": "Democrats see an opening to win the Miami mayor’s race in the latest test of the US political mood",
    "description": "Democrats are hoping to win a race for Miami mayor after decades out of power",
    "link": "https://abcnews.go.com/Politics/wireStory/democrats-opening-win-miami-mayors-race-latest-test-128186824",
    "timestamp": "2025-12-07T19:49:50Z"
  },
  {
    "title": "‘You Gotta Learn Not to Defraud the American People’ Trump Treasury Secretary Says Somali Fraud Scheme Being Investigated for Terrorism Link",
    "description": "Scott Bessent said Somalis who move to the U.S. have to learn a few things, including \"not to defraud the American people,\" while on Face the Nation\nThe post ‘You Gotta Learn Not to Defraud the American People’ Trump Treasury Secretary Says Somali Fraud Schem…",
    "link": "https://www.mediaite.com/media/you-gotta-learn-not-to-defraud-the-american-people-trump-treasury-secretary-says-somali-fraud-scheme-being-investigated-for-terrorism-link/",
    "timestamp": "2025-12-07T19:48:16Z"
  },
  {
    "title": "Trump slams Texas Democrat’s ‘lack of loyalty’ after granting him pardon",
    "description": "President Donald Trump lashed out at Rep. Henry Cuellar on Sunday, just days after pardoning the Texas Democrat, accusing him of disloyalty for filing to run for re-election as a Democrat.\n“The Democrats, under the Crooked Joe Biden Administration, who always…",
    "link": "https://biztoc.com/x/60af3e4be2f19b97",
    "timestamp": "2025-12-07T19:45:34Z"
  },
  {
    "title": "Trump goes to bat for Roger Clemens' Hall of Fame candidacy ahead of committee vote",
    "description": "President Donald Trump expressed his support for Roger Clemens' Hall of Fame candidacy on Sunday, hours before the Era Committee would vote on it.",
    "link": "https://www.foxnews.com/sports/trump-goes-bat-roger-clemens-hall-fame-candidacy-ahead-committee-vote",
    "timestamp": "2025-12-07T19:45:20Z"
  },
  {
    "title": "MS NOW host calls massive Minnesota fraud scheme 'isolated' in interview with MN attorney general",
    "description": "MS NOW host Jackie Alemany called the massive Minnesota fraud scheme \"isolated\" during an interview with the state's attorney general, Keith Ellison.",
    "link": "https://www.foxnews.com/media/ms-now-host-calls-massive-minnesota-fraud-scheme-isolated-interview-mn-attorney-general",
    "timestamp": "2025-12-07T19:44:33Z"
  },
  {
    "title": "Washington State lawmakers, AG introduce bill aimed at protecting immigrants at work",
    "description": "Over the course of nearly one year now, President Donald Trump has achieved his campaign promises to crackdown on illegal immigration.",
    "link": "https://komonews.com/news/local/washington-state-lawmakers-ag-introduce-bill-aimed-at-protecting-immigrants-at-work-ice-immigration-enforcement-detention-center-arrest-surveillance-privacy-trump-washington-seattle-protest-border-community",
    "timestamp": "2025-12-07T19:44:15Z"
  },
  {
    "title": "Trump's new security strategy aligns with Russia's interests, Kremlin says",
    "description": "The Kremlin on Sunday welcomed U.S. President Donald Trump's new national security strategy and said it largely accorded with Russia's own perceptions, the first time that Moscow has so fulsomely praised such a document from its former Cold War foe.",
    "link": "https://www.cbc.ca/news/world/russia-trump-national-security-strategy-9.7006460",
    "timestamp": "2025-12-07T19:42:14Z"
  },
  {
    "title": "Letters: Encouraging to see the Government has acted on education",
    "description": "OPINION: Top marks for Govt’s approach, NZME talent, Donald Trump.",
    "link": "https://www.nzherald.co.nz/nz/letters-encouraging-to-see-the-government-has-acted-on-education/premium/MKJGQJ3KUNGWRGUCH7U74NTJ7A/",
    "timestamp": "2025-12-07T19:35:41Z"
  },
  {
    "title": "'Doth protest too much': Critics flag White House's aggressive denial of shocking story",
    "description": "The White House came out hard Sunday against a new report\r\n from The Bulwark that suggested Homeland Security Secretary Kristi Noem might be on the outs in the Trump administration, and in such a fierce manner that one prominent critic couldn’t help but point…",
    "link": "https://www.rawstory.com/kristi-noem-2674376930/",
    "timestamp": "2025-12-07T19:27:00Z"
  },
  {
    "title": "Kaitlan Collins fires back at Trump with perfect reply",
    "description": "Kaitlan Collins refused to let President Donald Trump’s latest attack go unanswered, delivering a concise six-word response that set the record straight about their recent exchange. The CNN chief White House correspondent became the target of a lengthy Truth …",
    "link": "https://rollingout.com/2025/12/07/kaitlan-collins-fires-back-at-trump-with/",
    "timestamp": "2025-12-07T19:26:33Z"
  },
  {
    "title": "Russia Welcomes Donald Trump's New US National Security Strategy",
    "description": "Russian Security Council Deputy Chairman Dmitry Medvedev hailed the new National Security Strategy document, published by the Trump administration last week, as having “echoes” of Moscow’s own views.\n“The strategy unexpectedly echoes what we have been saying …",
    "link": "https://biztoc.com/x/7f52126d4133161e",
    "timestamp": "2025-12-07T19:23:10Z"
  },
  {
    "title": "CPC: Fani-Kayode urges visiting US lawmaker to adopt balanced view",
    "description": "Femi Fani-Kayode urges US lawmaker Riley Moore to adopt a balanced view of Nigeria’s security challenges, noting that both Christians and Muslims are victi\n\nRead More: https://punchng.com/cpc-fani-kayode-urges-visiting-us-lawmaker-to-adopt-balanced-view/",
    "link": "https://punchng.com/cpc-fani-kayode-urges-visiting-us-lawmaker-to-adopt-balanced-view/",
    "timestamp": "2025-12-07T19:22:36Z"
  },
  {
    "title": "Netanyahu expects to move to second phase of Gaza truce soon as he prepares to meet Trump",
    "description": "Benjamin Netanyahu also said he would meet Trump later in December to discuss’”opportunities for peace’ in the region.",
    "link": "https://www.thejournal.ie/gaza-truce-talks-netanyahu-6896454-Dec2025/",
    "timestamp": "2025-12-07T19:21:46Z"
  },
  {
    "title": "Donald Trump Says He Shouldn't Be President If He's Not More Talented Than Jimmy Kimmel",
    "description": "Donald Trump implied he's resigning the presidency ... well, if he's not a better host than Jimmy Kimmel, that is ... cracking the joke during a Kennedy Center Honors event at the White House. The President of the United States took another shot at…\n Permalink",
    "link": "https://www.tmz.com/2025/12/07/donald-trump-says-not-president-if-less-talented-than-jimmy-kimmel/",
    "timestamp": "2025-12-07T19:21:38Z"
  },
  {
    "title": "Ilhan Omar Blasts Trump’s ‘Unhealthy and Creepy Obsession’ With Somalis: ‘Can Lead to Dangerous Actions’",
    "description": "Rep. Ilhan Omar (D-MN) ripped President Trump on Sunday, saying he has an \"unhealthy and creepy obsession\" with both her and other Somalis living in the U.S. \nThe post Ilhan Omar Blasts Trump’s ‘Unhealthy and Creepy Obsession’ With Somalis: ‘Can Lead to Dange…",
    "link": "https://www.mediaite.com/politics/ilhan-omar-blasts-trumps-unhealthy-and-creepy-obsession-with-somalis-can-lead-to-dangerous-actions/",
    "timestamp": "2025-12-07T19:18:26Z"
  },
  {
    "title": "Brianna Aguilera's family doubts Texas A&M student died by suicide: \"The Police screwed things up royally\"",
    "description": "The family of Texas A&M student Brianna Aguilera has publicly questioned the Austin Police Department&apos;s determination that she died by suicide.\nTony Buzbee, representing Aguil",
    "link": "https://www.marca.com/en/lifestyle/us-news/2025/12/07/6935b90dca474192328b4583.html",
    "timestamp": "2025-12-07T19:16:33Z"
  },
  {
    "title": "Ted Sarandos Spoke With Donald Trump Ahead of Warner Bros. Deal",
    "description": "As the streaming giant aims to acquire the legacy studio, multiple insiders say that a recent conversation between its CEO and the President may have helped pave the way.",
    "link": "http://www.hollywoodreporter.com/business/business-news/ted-sarandos-donald-trump-netflix-warner-bros-deal-1236443019/",
    "timestamp": "2025-12-07T19:13:04Z"
  },
  {
    "title": "'Taking his lunch': Ex-Obama advisor says Trump just revealed a major weakness",
    "description": "Donald Trump's recent attempt at political \"bribery\" has backfired, and is now causing the public to see the president's major weakness, according to a former senior advisor to Obama Sunday.Dan Pfeiffer, former senior advisor to Obama and current host to Pod …",
    "link": "https://www.rawstory.com/trump-obama-2674376915/",
    "timestamp": "2025-12-07T19:12:26Z"
  },
  {
    "title": "Marjorie Taylor Greene Says She's Received Over 700 Death Threats",
    "description": "Representative Marjorie Taylor Greene, a Georgia Republican, says her office has reported more than 700 death threats in five years—initially from the “left,” and now, from the “right” after her recent break with President Donald Trump over the Jeffrey Epstei…",
    "link": "https://biztoc.com/x/4ab7db9a52f86cae",
    "timestamp": "2025-12-07T19:11:57Z"
  },
  {
    "title": "Putin Greets Modi, Murmu at Indian Presidential Palace",
    "description": "Indian Prime Minister Narendra Modi and Russian President Vladimir Putin pledged to widen economic ties in the face of pressure from US President Donald Trump to slam the brakes on an oil trade that surged after the Kremlin’s war on Ukraine.\nThe two leaders d…",
    "link": "https://biztoc.com/x/38b327aa2192a226",
    "timestamp": "2025-12-07T19:11:52Z"
  },
  {
    "title": "Can you be the change you’d like to see? Three US philosophers aim to offer hope",
    "description": "Can one person change the world? At a time of pessimism and populism, a new book suggests how we can achieve social change.",
    "link": "https://theconversation.com/can-you-be-the-change-youd-like-to-see-three-us-philosophers-aim-to-offer-hope-265976",
    "timestamp": "2025-12-07T19:11:06Z"
  },
  {
    "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Dec. 7, 2025",
    "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Treasury Secretary Scott Bessent and Rep. Ilhan Omar join Margaret Brennan.",
    "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-12-07-2025/",
    "timestamp": "2025-12-07T19:08:26Z"
  },
  {
    "title": "European industry faces ‘life or death,’ Macron says — and China needs to help",
    "description": "China's trade surplus is \"untenable\" and Beijing needs to start importing from Europe instead of \"killing their customers,\" French president says.",
    "link": "https://www.politico.eu/article/europe-china-emmanuel-macron-foreign-investment-trade/",
    "timestamp": "2025-12-07T19:08:04Z"
  },
  {
    "title": "Senior Trump administration official begins 5-day visit to India",
    "description": "STATE TIMES NEWS NEW DELHI: Allison Hooker, the US Under Secretary of State for Political Affairs, is on a five-day visit to India from Sunday to advance bilateral strategic and economic ties.Hooker’s trip to New Delhi and Bengaluru comes amid increasing stra…",
    "link": "https://statetimes.in/senior-trump-administration-official-begins-5-day-visit-to-india/",
    "timestamp": "2025-12-07T19:07:02Z"
  },
  {
    "title": "Why Troops Are Blowing Whistle on Trump: Senator",
    "description": "One of the Democratic senators whom Donald Trump said should be executed for sedition isn’t backing down. Sen. Elissa Slotkin, one of six prominent...",
    "link": "https://www.thedailybeast.com/why-troops-are-blowing-whistle-on-trump-senator/",
    "timestamp": "2025-12-07T19:05:07Z"
  },
  {
    "title": "Hamline University student brags on video that he celebrated Charlie Kirk's assassination",
    "description": "Hamline University student caught on video defending Charlie Kirk's assassination, saying 'I'm just glad Charlie Kirk got shot' on campus.",
    "link": "https://www.foxnews.com/us/hamline-university-student-brags-video-that-he-celebrated-charlie-kirk-assassination",
    "timestamp": "2025-12-07T19:00:46Z"
  },
  {
    "title": "China holds the key to the modern world and the West risks being left behind",
    "description": "China used to be trying to catch the West, specifically the US; then it caught up; now the West is trying to catch up to China but likely can't.",
    "link": "https://www.abc.net.au/news/2025-12-08/china-us-technology-engineering-ai-plan-australia/106111696",
    "timestamp": "2025-12-07T19:00:32Z"
  },
  {
    "title": "Thanks to one man, Trump has ripped up two centuries of history",
    "description": "By SoRelle Wyckoff Gaynor, Assistant Professor of Public Policy and Politics, University of Virginia.When the framers of what became the U.S. Constitution set out to draft the rules of our government on a hot, humid day in the summer of 1787, debates over det…",
    "link": "https://www.rawstory.com/mike-johnson-2674358544/",
    "timestamp": "2025-12-07T19:00:26Z"
  },
  {
    "title": "Begrudging a canny fan and his near-perfect World Cup plan",
    "description": "Thoughts on Pep Guardiola’s character, Alexander Isak’s attitude and another strange night in Istanbul",
    "link": "https://www.irishtimes.com/sport/soccer/2025/12/07/begrudging-a-canny-fan-and-his-near-perfect-world-cup-plan/",
    "timestamp": "2025-12-07T19:00:01Z"
  },
  {
    "title": "How a one-time aide to Gary Hart is battling child hunger",
    "description": "Given President Trump’s attacks on food aid, much of Billy Shore’s work is done at local level",
    "link": "https://www.irishtimes.com/world/us/2025/12/07/how-a-one-time-aide-to-gary-hart-is-battling-child-hunger/",
    "timestamp": "2025-12-07T19:00:01Z"
  },
  {
    "title": "‘He Called Them Garbage!’ CNN’s Dana Bash Tussles With Trump Border Czar Over Trump’s Rhetoric on Somalis",
    "description": "CNN's Dana Bash tussled with Border Czar Tom Homan Sunday over President Donald Trump's xenophobic rhetoric on Somali immigrants.\nThe post ‘He Called Them Garbage!’ CNN’s Dana Bash Tussles With Trump Border Czar Over Trump’s Rhetoric on Somalis first appeared…",
    "link": "https://www.mediaite.com/media/news/he-called-them-garbage-cnns-dana-bash-tussles-with-trump-border-czar-over-trumps-rhetoric-on-somalis/",
    "timestamp": "2025-12-07T18:54:47Z"
  },
  {
    "title": "Trump slams pardoned Democratic congressman as 'disloyal' for not switching parties",
    "description": "President Donald Trump is angry that Rep. Henry Cuellar plans to run for reelection as a Democrat rather than switch parties after the president pardoned the Texas congressman and his wife in a federal bribery and conspiracy case",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-slams-pardoned-democratic-congressman-disloyal-switching-parties-128190597",
    "timestamp": "2025-12-07T18:53:58Z"
  },
  {
    "title": "Russia welcomes Trump’s revised US security strategy",
    "description": "A Kremlin spokesperson said that the changes 'correspond in many ways to our vision'.",
    "link": "https://www.aljazeera.com/news/2025/12/7/russia-welcomes-trumps-revised-us-security-strategy",
    "timestamp": "2025-12-07T18:52:14Z"
  },
  {
    "title": "X is now 'number 1 in every EU country!'—Elon Musk's new announcement after calling for abolition of 27-nation bloc",
    "description": "Following EU's decision to penalise X and impose a $140 million fine, Elon Musk earlier went on the offensive, calling for the bloc's dissolution. Trump administration officials also criticised the EU for what it described as an ‘attack’ on US tech companies.",
    "link": "https://www.livemint.com/companies/people/x-is-now-number-1-in-every-eu-country-elon-musks-new-announcement-after-calling-for-abolition-of-27-nation-bloc-11765132370962.html",
    "timestamp": "2025-12-07T18:49:17Z"
  },
  {
    "title": "Violent threats pile up as Indiana Republicans confront pressure from Trump on redistricting",
    "description": "Republicans in the Indiana Senate are facing threats as Trump pushes to redraw the state's congressional map. It's a bewildering experience for lawmakers who consider themselves loyal party members and never imagined they would be doing their jobs under the s…",
    "link": "https://www.pbs.org/newshour/politics/violent-threats-pile-up-as-indiana-republicans-confront-pressure-from-trump-on-redistricting",
    "timestamp": "2025-12-07T18:48:20Z"
  },
  {
    "title": "Netanyahu expects to move to Gaza truce second phase soon",
    "description": "Israeli Prime Minister Benjamin Netanyahu announced on Dec. 7 he expected the second phase of the U.S.-sponsored ceasefire plan for Gaza to begin soon, and said he would meet President Donald Trump this month.",
    "link": "https://www.hurriyetdailynews.com/netanyahu-expects-to-move-to-gaza-truce-second-phase-soon-216552",
    "timestamp": "2025-12-07T18:45:07Z"
  },
  {
    "title": "Report: US, Israel, Qatar set high-level talks to repair strained ties",
    "description": "High-level talks seek to rebuild coordination among Washington, Jerusalem and Doha following the fallout from the Israeli strike in Qatar.",
    "link": "https://www.israelnationalnews.com/news/418956",
    "timestamp": "2025-12-07T18:41:00Z"
  },
  {
    "title": "Trump slams pardoned Democratic congressman as 'disloyal' for not switching parties",
    "description": "Donald Trump is angry that Rep. Henry Cuellar is running again as a Democrat rather than switch parties after the president pardoned the Texas congressman...",
    "link": "https://www.yahoo.com/news/articles/trump-slams-pardoned-democratic-congressman-183530515.html",
    "timestamp": "2025-12-07T18:35:30Z"
  }
]