[
  {
    "title": "Trump Returns to G-7 He Once Loathed as Iran Crisis Intensifies",
    "description": "President Donald Trump arrives in Canada as the center of attention for a Group of Seven summit of world leaders whose main purpose will be to mollify him — and one where spiraling conflict in the Middle East offers another test of its unity.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-returns-to-g-7-he-once-loathed-as-iran-crisis-intensifies",
    "timestamp": "2025-06-15T20:56:28Z"
  },
  {
    "title": "Trump says 'it's possible' US gets involved in Israel-Iran conflict (Rachel Scott/ABC News)",
    "description": "Rachel Scott / ABC News:\nTrump says 'it's possible' US gets involved in Israel-Iran conflict  —  No U.S. involvement at this point, says Trump, who's open to Putin as mediator.  —  President Donald Trump looks on from the stage during a parade to honor the Ar…",
    "link": "https://www.memeorandum.com/250615/p64",
    "timestamp": "2025-06-15T20:50:01Z"
  },
  {
    "title": "Iran preparing to ‘shut down Israel’s war machine’ – RT source",
    "description": "Tehran has been preparing for a long war, a senior Iranian security official has told RT Read Full Article at RT.com",
    "link": "https://www.rt.com/news/619398-iran-prepares-shut-down-israel/",
    "timestamp": "2025-06-15T20:49:25Z"
  },
  {
    "title": "Trump Suggests a Trade Deal With the US Will Bring 'Reason, Cohesion, and Sanity' to Israel-Iran Peace Talks",
    "description": "Trump proposed a U.S.-brokered trade deal as a path to peace between Israel and Iran, despite rising violence, a canceled round of nuclear talks, and no sign either side is willing to negotiate.",
    "link": "https://www.ibtimes.com/trump-suggests-trade-deal-us-bring-reason-cohesion-sanity-israel-iran-peace-talks-3775750",
    "timestamp": "2025-06-15T20:47:46Z"
  },
  {
    "title": "Over 30 More Countries Could Be Put on Travel Ban by US—Reports",
    "description": "More than 30 additional countries could face a full or partial travel ban, according to an internal State Department memo.",
    "link": "https://www.newsweek.com/over-30-more-countries-travel-ban-united-states-reports-2085762",
    "timestamp": "2025-06-15T20:47:23Z"
  },
  {
    "title": "Gas Prices Are Below $3 In Half Of States—Here’s Why Analysts Say That Won’t Last",
    "description": "Israel launched attacks on Iran last week, raising concerns among investors about disruptions to the global oil trade.",
    "link": "https://www.forbes.com/sites/tylerroush/2025/06/15/gas-prices-are-below-3-in-half-of-states-heres-why-analysts-say-that-wont-last/",
    "timestamp": "2025-06-15T20:45:55Z"
  },
  {
    "title": "Netanyahu: Iran plotted to assassinate both me and Trump",
    "description": "In interview with Fox News, Netanyahu reveals Iran's plot to assassinate President Donald Trump due to his stance against their nuclear program. He details \"Operation Rising Lion\" as a necessary response to an \"imminent threat\" of Iranian nuclear weaponizatio…",
    "link": "https://www.israelnationalnews.com/news/410063",
    "timestamp": "2025-06-15T20:43:37Z"
  },
  {
    "title": "Brooke Rollins Defends Deportation Exemption for Favored Industries",
    "description": "Agriculture Secretary Brooke Rollins is defending her push to exempt farmers, meatpackers, and restaurant employers from the nation's immigration laws.\nThe post Brooke Rollins Defends Deportation Exemption for Favored Industries appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/06/15/brooke-rollins-defends-deportation-exemption-for-favored-industries/",
    "timestamp": "2025-06-15T20:37:38Z"
  },
  {
    "title": "Israel-Iran Conflict: Latest Developments",
    "description": "Israel and Iran traded heavy fire for a third straight day on Sunday, with mounting casualties and expanding targets marking a sharp escalation in hostilities between the longtime foes.",
    "link": "https://www.ibtimes.com.au/israel-iran-conflict-latest-developments-1859203",
    "timestamp": "2025-06-15T20:36:13Z"
  },
  {
    "title": "I Was Just Arrested At The Capitol. 1 Thing About The Cop Who Detained Me Was Absolutely Shocking.",
    "description": "\"They lined us up, zip-tied our hands behind our backs, and stood us in a single file arc. One officer was assigned to each protester to keep a grip on one of our biceps at all times.\"",
    "link": "https://www.huffpost.com/entry/veterans-trump-protest-capitol_n_684ee6c8e4b07f75743a2e9f",
    "timestamp": "2025-06-15T20:35:18Z"
  },
  {
    "title": "Sparse Attendance, Confusion and Disorganization: Dismal Scenes From Trump’s Military Parade",
    "description": "Photos and video offer a grim picture of what happened Saturday at the 250th anniversary military parade in D.C.\nThe post Sparse Attendance, Confusion and Disorganization: Dismal Scenes From Trump’s Military Parade appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-military-parade-attendance/",
    "timestamp": "2025-06-15T20:34:58Z"
  },
  {
    "title": "Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest Rates - Bloomberg.com",
    "description": "Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest RatesBloomberg.com The Case for Rate Cuts Is GrowingWSJ Will Jay Powell resist pressure from Donald Trump to cut US interest rates?Financial Times Fed to keep rates steady as tariffs, pos…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178057953",
    "timestamp": "2025-06-15T20:34:57Z"
  },
  {
    "title": "Hundreds of protesters gather in downtown Calgary on first day of G7 in Alberta",
    "description": "Roughly 500 protesters gathered outside city hall to protest a range of issues, including the concerns of Kashmiri, Ethiopian and Palestinian people, as well as Canadian water security and Indigenous rights.",
    "link": "https://www.cbc.ca/news/canada/calgary/hundreds-protesters-g7-downtown-1.7561914",
    "timestamp": "2025-06-15T20:32:50Z"
  },
  {
    "title": "UK hoping for US tariff relief in days after deadline slips",
    "description": "Officials hope Trade Secretary Jonathan Reynolds will update parliament on Tuesday.",
    "link": "https://www.politico.eu/article/uk-tariff-relief-days-deadline-beef-us-trade/",
    "timestamp": "2025-06-15T20:30:00Z"
  },
  {
    "title": "Macron rejects Trump's idea for Putin to mediate Israel-Iran crisis",
    "description": "PARIS/COPENHAGEN: French President Emmanuel Macron, during a visit to Greenland to offer his support to the Arctic island, said on Sunday (Jun 15) that Russia lacked the credibility to mediate the crisis between Israel and Iran",
    "link": "https://www.channelnewsasia.com/world/macron-rejects-trumps-idea-putin-mediate-israel-iran-crisis-5183646",
    "timestamp": "2025-06-15T20:28:54Z"
  },
  {
    "title": "Alberta premier says she likes Ottawa's speedy plan for infrastructure project approvals",
    "description": "Alberta Premier Danielle Smith says she likes the federal government’s plan to reduce the approval times of major infrastructure projects to two years, and she hopes Canada can revise other legislation to \"improve investor confidence.\"",
    "link": "https://www.cbc.ca/news/politics/alberta-premier-ottawa-infrastructure-1.7561943",
    "timestamp": "2025-06-15T20:28:31Z"
  },
  {
    "title": "Trump Says He ‘May’ Call Tim Walz",
    "description": "President Donald Trump told ABC News on Sunday that he \"may\" call Minnesota Gov. Tim Walz after a political assassination sent shockwaves through the state. Said Trump: “Well, it's a terrible thing. I think he's",
    "link": "https://politicalwire.com/2025/06/15/trump-says-he-may-call-tim-walz/",
    "timestamp": "2025-06-15T20:25:34Z"
  },
  {
    "title": "Trump vetoed Israeli plan to kill Iran’s supreme leader, US official says",
    "description": "President Donald Trump rejected a plan presented by Israel to the U.S. to kill Iran’s Supreme Leader Ayatollah Ali Khamenei, according to a U.S. official familiar with the matter.\nThe Israelis informed the Trump administration in recent days that they had dev…",
    "link": "https://biztoc.com/x/bc07036cc2d19f4c",
    "timestamp": "2025-06-15T20:25:06Z"
  },
  {
    "title": "Trump Says He Won't Fire Powell But Demands Rate Cut",
    "description": "President Donald Trump reiterated Thursday he did not plan to fire Federal Reserve Chair Jerome Powell, days after saying he would “soon” pick his nominee to lead the central bank next.\n“The fake news is saying, ‘Oh, if you fired him, it would be so bad, it w…",
    "link": "https://biztoc.com/x/31e136c392de26ca",
    "timestamp": "2025-06-15T20:24:50Z"
  },
  {
    "title": "Macron Offers to Aid Greenland Amid Trump Threats",
    "description": "“President Emmanuel Macron said France would be available to conduct joint exercises to improve security in Greenland, the Danish territory coveted by US President Donald Trump,” Bloomberg reports.",
    "link": "https://politicalwire.com/2025/06/15/macron-offers-to-aid-greenland-amid-trump-threats/",
    "timestamp": "2025-06-15T20:23:12Z"
  },
  {
    "title": "Were Rebekah Koffler's Words Just Too Intoxicating for FOX \"News\"?",
    "description": "Okay, let's get the obvious jokes out of the way first. Willy Wonka invited more people to win his chocolate factory than attended the military parade that Donald Trump threw for himself on Saturday (the one that was supposed to celebrate the U.S. Army's 250t…",
    "link": "https://bleedingcool.com/tv/were-rebekah-kofflers-words-just-too-intoxicating-for-fox-news/",
    "timestamp": "2025-06-15T20:22:04Z"
  },
  {
    "title": "Netanyahu reveals Iran marked Trump as 'enemy number one' with assassination plot",
    "description": "Israeli Prime Minister Benjamin Netanyahu confirmed in his first interview since Israel launched its blistering attacks on Iran that the country's Islamic regime had pinpointed President Donald Trump as a threat to its nuclear program and actively worked to a…",
    "link": "https://freerepublic.com/focus/f-news/4323234/posts",
    "timestamp": "2025-06-15T20:21:43Z"
  },
  {
    "title": "Trump stands back as Israel tries bombing its way to a new neighbourhood",
    "description": "There are many things happening in the Middle East at the moment but beneath them lies one single through-line: Israel is attempting to reshape the political map of the region.",
    "link": "https://www.abc.net.au/news/2025-06-16/how-israel-is-trying-to-remake-the-middle-east/105418732",
    "timestamp": "2025-06-15T20:21:34Z"
  },
  {
    "title": "Trump biographer flags 'raw conflict of interest' in president's financials",
    "description": "Donald Trump's biographer on Sunday highlighted what stood out to him about the president's financial data release.Tim O'Brien, who spent massive amounts of time with Trump before writing TrumpNation: The Art of Being the Donald, appeared on MSNBC on Sunday t…",
    "link": "https://www.rawstory.com/trump-tim-biographer-garbage-list/",
    "timestamp": "2025-06-15T20:18:51Z"
  },
  {
    "title": "Israel-Iran conflict: List of key events, June 15, 2025",
    "description": "Here are the key events on day three of the Israel-Iran conflict.",
    "link": "https://www.aljazeera.com/news/2025/6/15/israel-iran-conflict-list-of-key-events-june-15-2025",
    "timestamp": "2025-06-15T20:16:47Z"
  },
  {
    "title": "Australians Equally Distrust Both Trump and Xi, Survey Finds",
    "description": "Australians are equally distrustful of both US President Donald Trump and Chinese leader Xi Jinping, according to a new survey, complicating Canberra’s task of managing ties with its key security ally and biggest trading partner.",
    "link": "https://financialpost.com/pmn/business-pmn/australians-equally-distrust-both-trump-and-xi-survey-finds",
    "timestamp": "2025-06-15T20:15:32Z"
  },
  {
    "title": "How Trump's Imposition of Massive Tariffs is Repeating the \"Ship Money\" Abuses of King Charles I (Ilya Somin/Reason)",
    "description": "Ilya Somin / Reason:\nHow Trump's Imposition of Massive Tariffs is Repeating the “Ship Money” Abuses of King Charles I  —  Yesterday, there were massive nationwide “No Kings” protests against Donald Trump and his authoritarian tendencies.  Like most political …",
    "link": "https://www.memeorandum.com/250615/p62",
    "timestamp": "2025-06-15T20:10:00Z"
  },
  {
    "title": "Trump And Tucker Carlson Are Falling Out Over Trump’s Support For Israel",
    "description": "The former Fox News host accused Trump of being “complicit” in Israel’s “act of war” following Israel’s recent military strikes on Iran.",
    "link": "https://www.huffpost.com/entry/tucker-carlson-criticizes-trump-supporting-israel_n_684edd1ce4b0dde371e5f9a7",
    "timestamp": "2025-06-15T20:08:56Z"
  },
  {
    "title": "Trump Officially Begins Phasing Out FEMA: 'We're Going to Give Out Less'",
    "description": "\"You’ve been very clear that you want to see FEMA eliminated as it exists today, so I’m preparing all of these ...\"",
    "link": "https://www.westernjournal.com/trump-officially-begins-phasing-fema-going-give-less/",
    "timestamp": "2025-06-15T20:07:36Z"
  },
  {
    "title": "Trump administration weighs adding 36 countries to travel ban, memo says",
    "description": "WASHINGTON: US President Donald Trump's administration is considering significantly expanding its travel ban by potentially banning citizens of 36 additional countries from entering the United States, according to an internal State Department cable seen by Re…",
    "link": "https://www.channelnewsasia.com/world/trump-administration-weighs-adding-36-countries-travel-ban-memo-says-5183411",
    "timestamp": "2025-06-15T20:06:33Z"
  },
  {
    "title": "EXCLUSIVE: Trump VA Sec Urges Vets To Give Maligned Agency Second Chance",
    "description": "VA Secretary Doug Collins urged veterans to give the VA a second chance as he hopes to bring the organization back on track after years of decline",
    "link": "https://dailycaller.com/2025/06/15/exclusive-trump-va-sec-urges-vets-second-chance/",
    "timestamp": "2025-06-15T20:04:53Z"
  },
  {
    "title": "Report: Trump Rejected Israeli Plan to Assassinate Iran Leader Khamenei: 'Have Iranians Killed an American? No'",
    "description": "President Donald Trump shut down an Israeli plan to assassinate Iran's Supreme Leader Ayatollah Ali Khamenei in recent days, two members of the Trump administration reportedly said.\nThe post Report: Trump Rejected Israeli Plan to Assassinate Iran Leader Khame…",
    "link": "https://www.breitbart.com/politics/2025/06/15/report-trump-rejected-israeli-plan-to-assassinate-iran-leader-khamenei-have-iranians-killed-an-american-no/",
    "timestamp": "2025-06-15T20:03:33Z"
  },
  {
    "title": "Macron Offers to Aid in Greenland’s Security Amid Trump Threats",
    "description": "President Emmanuel Macron said France would be available to conduct joint exercises to improve security in Greenland, the Danish territory coveted by US President Donald Trump.",
    "link": "https://financialpost.com/pmn/business-pmn/macron-offers-to-aid-in-greenlands-security-amid-trump-threats",
    "timestamp": "2025-06-15T20:00:14Z"
  },
  {
    "title": "Teachers’ Union Played Big Role in ‘No Kings’ Protests",
    "description": "“Imagine if Randi Weingarten fought half as hard to improve public education. Maybe then more than a quarter of American kids would be proficient in math.\"\nThe post Teachers’ Union Played Big Role in ‘No Kings’ Protests first appeared on Le·gal In·sur·rec·tio…",
    "link": "https://legalinsurrection.com/2025/06/teachers-union-played-big-role-in-no-kings-protests/",
    "timestamp": "2025-06-15T20:00:08Z"
  },
  {
    "title": "Was Someone Trolling Trump by Playing Creedence’s Draft-Dodger-Slamming ‘Fortunate Son’ at His Military Parade? Or Is It Just the Further Death of Irony?",
    "description": "Was the music for Saturday’s military parade in Washington, D.C. covertly programmed by the “No Kings” movement? That’s the question some were asking on social media after the event, spearheaded by President Donald J. Trump, which featured the repeated playin…",
    "link": "https://variety.com/2025/music/columns/trump-fortunate-son-creedence-military-parade-draft-dodging-1236432479/",
    "timestamp": "2025-06-15T20:00:00Z"
  },
  {
    "title": "The Smithsonian Institution Audit Is Only the Start",
    "description": "The Smithsonian Institution’s Board of Regents may have to get used to meetings where accountability is expected. At this week’s much-anticipated one, members yielded to... Read More\nThe post The Smithsonian Institution Audit Is Only the Start appeared first …",
    "link": "https://www.dailysignal.com/2025/06/15/the-smithsonian-institution-audit-is-only-the-start/",
    "timestamp": "2025-06-15T20:00:00Z"
  },
  {
    "title": "Crowds line El Camino in Palo Alto as part of national ‘No Kings’ rally (Palo Alto, CA)",
    "description": "Blocks away from Palo Alto’s Rinconada park, tree-shaded streets echoed with the shouts of protestors, car-honks and live music as part of a day full of demonstrations against the Trump administration on Saturday. Crowds of people walked from the corner of El…",
    "link": "https://freerepublic.com/focus/f-news/4323230/posts",
    "timestamp": "2025-06-15T19:59:04Z"
  },
  {
    "title": "Shakira Says Immigrants Are 'Living In Constant Fear'",
    "description": "The international pop star spoke about the \"painful\" reality of Trump's immigration crackdown in an interview with BBC News.",
    "link": "https://www.huffpost.com/entry/shakira-immigrants-living-in-constant-fear_n_684efe3ce4b07f75743a3341",
    "timestamp": "2025-06-15T19:56:23Z"
  },
  {
    "title": "Israeli official rejects Trump's call for Iran deal: 'Outrageous' to negotiate with 'evil, jihadist regime'",
    "description": "Knesset member Ohad Tal tells Fox News that Israel's strikes against Iran are \"saving the entire world\" from threat, rejecting President Trump's call for a deal.",
    "link": "https://www.foxnews.com/world/israeli-official-rejects-trumps-call-iran-deal-outrageous-negotiate-evil-jihadist-regime",
    "timestamp": "2025-06-15T19:52:21Z"
  },
  {
    "title": "Medicaid enrollees fear losing health coverage if Congress enacts work requirements",
    "description": "Medicaid enrollees fear losing health coverage if Congress enacts work requirementscbsnews.com",
    "link": "https://www.cbsnews.com/pittsburgh/news/medicaid-enrollees-health-coverage-congress-work-requirements/",
    "timestamp": "2025-06-15T19:52:00Z"
  },
  {
    "title": "Live: Trump reportedly blocked Israeli plan to kill Iran's supreme leader",
    "description": "US officials reportedly say President Donald Trump blocked an Israeli plan to kill Iran's Supreme Leader Ayatollah Ali Khamenei as Israel and Iran launch fresh attacks on each other for a fourth day. Follow live.",
    "link": "https://www.abc.net.au/news/2025-06-16/iran-israel-conflict-live-updates/105419514",
    "timestamp": "2025-06-15T19:48:59Z"
  },
  {
    "title": "Trump vetoed Israeli plan to kill Iranian supreme leader: US official",
    "description": "US President Donald Trump vetoed an Israeli plan to assassinate Iranian supreme leader Ayatollah Ali Khamenei, a senior US official told AFP Sunday. “We found out that the Israelis had plans to hit Iran’s supreme leader. President Trump was against it and we …",
    "link": "https://www.digitaljournal.com/world/trump-vetoed-israeli-plan-to-kill-iranian-supreme-leader-us-official/article",
    "timestamp": "2025-06-15T19:47:20Z"
  },
  {
    "title": "Trump Vetoed Israeli Plan To Kill Iranian Supreme Leader: US Official",
    "description": "US President Donald Trump vetoed an Israeli plan to assassinate Iranian supreme leader Ayatollah Ali Khamenei, a senior US official told AFP Sunday.",
    "link": "https://www.ibtimes.com/trump-vetoed-israeli-plan-kill-iranian-supreme-leader-us-official-3775747",
    "timestamp": "2025-06-15T19:45:24Z"
  },
  {
    "title": "Israel and Iran exchange attacks; Trump vetoes plan to target Khamenei, US officials say",
    "description": "WASHINGTON/JERUSALEM/DUBAI: Israel and Iran launched fresh attacks on each other on Sunday (Jun 15), killing scores of civilians and raising fears of a wider conflict, and US President Donald Trump said it could be end",
    "link": "https://www.channelnewsasia.com/world/israel-and-iran-exchange-attacks-trump-vetoes-plan-target-khamenei-us-officials-say-5183581",
    "timestamp": "2025-06-15T19:41:57Z"
  },
  {
    "title": "Canadian club: G7 leaders gather for summit amid trade wars",
    "description": "Leaders of some of the world's biggest economic powers are gathering in the Canadian Rockies for a Group of Seven summit this week, overshadowed by an escalating conflict between Israel and Iran and U.S. President Donald Trump's unresolved trade war with alli…",
    "link": "https://www.bostonherald.com/2025/06/15/canadian-club-g7-leaders-gather-for-summit-amid-trade-wars/",
    "timestamp": "2025-06-15T19:41:57Z"
  },
  {
    "title": "Veteran analyst sends surprising message on stocks, bonds, and gold",
    "description": "In This Article:\nVeteran analyst sends surprising message on stocks, bonds, and gold originally appeared on TheStreet.\nThe stock market rally has been impressive.\nSince President Donald Trump paused most reciprocal tariffs on April 9, only days after announci…",
    "link": "https://biztoc.com/x/43d63113c620cecf",
    "timestamp": "2025-06-15T19:40:51Z"
  },
  {
    "title": "Netanyahu's family home in Caesarea hit in Iran’s fresh missile attack on Israel",
    "description": "",
    "link": "https://economictimes.indiatimes.com/news/international/us/netanyahus-family-home-in-caesarea-hit-in-irans-fresh-missile-attack-on-israel/articleshow/121868544.cms",
    "timestamp": "2025-06-15T19:37:24Z"
  },
  {
    "title": "Report -- 'Bad Vibes': Infighting Roils Democrat Party as Troubles Multiply",
    "description": "The Democrat party is reportedly experiencing infighting as it faces a mountain of problems and lacks clear leadership.\nThe post Report — ‘Bad Vibes’: Infighting Roils Democrat Party as Troubles Multiply appeared first on Breitbart.",
    "link": "https://www.breitbart.com/2024-election/2025/06/15/report-bad-vibes-infighting-roils-democrat-party-as-troubles-multiply/",
    "timestamp": "2025-06-15T19:36:08Z"
  },
  {
    "title": "What To Expect From Next Week's Federal Reserve Meeting on Interest Rates - Investopedia",
    "description": "What To Expect From Next Week's Federal Reserve Meeting on Interest RatesInvestopedia The Case for Rate Cuts Is GrowingWSJ Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest RatesBloomberg.com Will Jay Powell resist pressure from Donald T…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178057517",
    "timestamp": "2025-06-15T19:34:29Z"
  },
  {
    "title": "Analysis: What options does Iran have in its conflict against Israel?",
    "description": "Even as it conducts its own attacks on Israel, Iran is weighing up its military and diplomatic choices.",
    "link": "https://www.aljazeera.com/news/2025/6/15/analysis-what-options-does-iran-have-in-its-conflict-against-israel",
    "timestamp": "2025-06-15T19:33:02Z"
  },
  {
    "title": "Albanese could give Trump some lessons on our 'democracy bounce'",
    "description": "As the Australian prime minister prepares to meet with the US president for their first face-to-face meeting, only one is leading a country where democracy is thriving and the public isn't bitterly divided.",
    "link": "https://www.abc.net.au/news/2025-06-16/australia-democracy-bounce-albanese-trump/105418446",
    "timestamp": "2025-06-15T19:32:10Z"
  },
  {
    "title": "Rand Paul Says What Could Make Him A ‘Yes’ On Trump’s ‘Big, Beautiful Bill’",
    "description": "Republican Kentucky Sen. Rand Paul said if President Donald Trump’s “big, beautiful bill” were to “separate out the debt ceiling,” then he would vote \"yes.\"",
    "link": "https://dailycaller.com/2025/06/15/rand-paul-donald-trump-big-beautiful-bill-senate-debt-ceiling/",
    "timestamp": "2025-06-15T19:31:13Z"
  },
  {
    "title": "Manhunt intensifies in US after lawmaker killed, another wounded",
    "description": "Police and FBI agents waged a huge manhunt Sunday for a gunman who killed a Democratic state lawmaker and her husband in Minnesota in what officials called a politically motivated attack. As the search stretched into its second day, police appeared to close i…",
    "link": "https://www.digitaljournal.com/world/manhunt-intensifies-in-us-after-lawmaker-killed-another-wounded/article",
    "timestamp": "2025-06-15T19:27:20Z"
  },
  {
    "title": "Trump due in Canada as G7 confronts Israel-Iran crisis",
    "description": "Group of Seven leaders including US President Donald Trump headed Sunday to the Canadian Rockies for a summit that takes on new urgency after Israel attacked Iran. The three-day gathering in the mountain town of Kananaskis marks the return to the internationa…",
    "link": "https://www.digitaljournal.com/world/trump-due-in-canada-as-g7-confronts-israel-iran-crisis/article",
    "timestamp": "2025-06-15T19:27:20Z"
  },
  {
    "title": "Trump blocked Israeli plan to assassinate Iran's supreme leader; Netanyahu denies",
    "description": "Netanyahu's top national security aide denied the Reuters report citing two U.S. officials, stating that Israel 'does not seek approval from the U.S.'",
    "link": "https://www.haaretz.com/israel-news/2025-06-15/ty-article/.premium/trump-blocked-israeli-plan-to-assassinate-irans-supreme-leader-netanyahu-denies/00000197-74cf-d717-a1df-f6df91d80000",
    "timestamp": "2025-06-15T19:26:12Z"
  },
  {
    "title": "Donald Trump vetoed Israeli plan to kill Iran’s supreme leader",
    "description": "The US president warned Tehran against retaliating to the United States.",
    "link": "https://www.thejournal.ie/trump-vetoed-israel-plan-kill-iran-leader-6734016-Jun2025/",
    "timestamp": "2025-06-15T19:22:31Z"
  },
  {
    "title": "‘It’s Possible’ US Jumps In Iran-Israel War, Trump Says",
    "description": "President Donald Trump said Sunday that U.S. involvement in the Israel-Iran conflict could be a possibility in an interview with ABC.",
    "link": "https://dailycaller.com/2025/06/15/us-iran-israel-war-donald-trump-interview-nuclear/",
    "timestamp": "2025-06-15T19:21:52Z"
  },
  {
    "title": "Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest Rates",
    "description": "With Federal Reserve officials signaling an extended hold on interest rates, investors and economists will look to Chair Jerome Powell this week for clues on what might eventually prompt the central bank to make a move, and when.",
    "link": "https://financialpost.com/pmn/business-pmn/fed-on-hold-leaves-wall-street-asking-what-it-will-take-to-cut-interest-rates",
    "timestamp": "2025-06-15T19:19:33Z"
  },
  {
    "title": "Israel Says Goal Is Not Iran Regime Change as Trump Vetoes Ayatollah Strike",
    "description": "Israel has tried to convince the U.S. to get involved as both Israel and Iran escalate their strikes on each other.",
    "link": "https://www.newsweek.com/israel-says-goal-not-iran-regime-change-trump-vetoes-ayatollah-strike-2085756",
    "timestamp": "2025-06-15T19:19:26Z"
  },
  {
    "title": "'Gold standard': Plane spotters in Calgary hope for glimpse of Air Force One at G7",
    "description": "Airplane enthusiasts are setting up at the Calgary International Airport in hopes of seeing some exciting aircraft land for the start of the G7 leaders' summit.",
    "link": "https://www.cbc.ca/news/canada/calgary/plane-spotters-calgary-airport-g7-1.7561924",
    "timestamp": "2025-06-15T19:12:29Z"
  },
  {
    "title": "Iran and Israel launch further strikes as Trump urges sides to 'make a deal'",
    "description": "Residents in the Iranian capital Tehran are reportedly leaving the city after a barrage of strikes on Sunday, as both sides trade heavy blows for a third straight day.",
    "link": "https://www.abc.net.au/news/2025-06-16/israel-iran-trump-says-us-involvement-possible/105419626",
    "timestamp": "2025-06-15T19:09:04Z"
  },
  {
    "title": "Mounting Israel-Iran Conflict Amps Up Geopolitical Market Risks",
    "description": "(Bloomberg) -- Financial markets are set to reopen Monday with investors squarely focused on escalating geopolitical tensions as Israel and Iran continue to ...",
    "link": "https://finance.yahoo.com/news/mounting-israel-iran-conflict-amps-190809758.html",
    "timestamp": "2025-06-15T19:08:09Z"
  },
  {
    "title": "Canada, U.K. commit to trade talks after Carney and Starmer meet",
    "description": "Canada, U.K. commit to trade talks after Carney and Starmer meettheglobeandmail.com",
    "link": "https://www.theglobeandmail.com/business/article-canada-uk-commit-to-trade-talks-after-carney-and-starmer-meet/",
    "timestamp": "2025-06-15T19:07:49Z"
  },
  {
    "title": "How Trump's Imposition of Massive Tariffs is Repeating the \"Ship Money\" Abuses of King Charles I",
    "description": "Yesterday, there were massive nationwide \"No Kings\" protests against Donald Trump and his authoritarian tendencies. Like most political slogans, \"No Kings\" is an oversimplification. But it is in fact true that Trump is repeating many of the abuses of the Brit…",
    "link": "https://biztoc.com/x/8396d02837e311f4",
    "timestamp": "2025-06-15T19:07:23Z"
  },
  {
    "title": "Here's What Happened Today: Sunday",
    "description": "",
    "link": "https://www.thejournal.ie/news-fix-15-06-25-6734000-Jun2025/",
    "timestamp": "2025-06-15T19:06:17Z"
  },
  {
    "title": "Trump vetoed Israeli plan to kill Iran’s supreme leader, US official tells AP",
    "description": "President Trump vetoed a plan presented by Israel to the U.S. to kill Iran’s Supreme Leader Ayatollah Ali Khamenei.",
    "link": "https://www.bostonherald.com/2025/06/15/trump-vetoes-israel-assassination-plan/",
    "timestamp": "2025-06-15T19:02:51Z"
  },
  {
    "title": "Fox News Segment Goes Viral After Bizarre Rebekah Koffler Interview Is Abruptly Cut Off: ‘Finally, the United States Is Back!’",
    "description": "In a bizarre turn of events, Fox News abruptly cut off its Saturday night interview with Rebekah Koffler after the wobbly former defense intelligence agency officer launched off on an incoherent tangent about Donald Trump’s controversial military parade meant…",
    "link": "https://variety.com/2025/tv/news/fox-news-rebekah-koffler-interview-donald-trump-parade-1236432459/",
    "timestamp": "2025-06-15T19:01:36Z"
  },
  {
    "title": "UK confident Trump will back AUKUS",
    "description": "The U.S. is reconsidering its involvement in the submarine development deal.",
    "link": "https://www.politico.eu/article/united-kingdom-keir-starmer-donald-trump-aukus-nuclear-submarine/",
    "timestamp": "2025-06-15T19:01:00Z"
  },
  {
    "title": "Medicaid enrollees fear losing health coverage if Congress enacts work requirements",
    "description": "Medicaid enrollees fear losing health coverage if Congress enacts work requirementsksat.com",
    "link": "https://www.ksat.com/health/2025/06/15/medicaid-enrollees-fear-losing-health-coverage-if-congress-enacts-work-requirements/",
    "timestamp": "2025-06-15T19:00:32Z"
  },
  {
    "title": "Meta users don’t know their intimate AI chats are out there for all to see",
    "description": "Some people are discussing personal questions with chatbots rather than friends or family.",
    "link": "https://syndication.washingtonpost.com/nss/stories/H5PMFO7LH5EZPMCFQZCFZ3SAJ4",
    "timestamp": "2025-06-15T19:00:00Z"
  },
  {
    "title": "Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest Rates",
    "description": "(Bloomberg) -- With Federal Reserve officials signaling an extended hold on interest rates, investors and economists will look to Chair Jerome Powell this...",
    "link": "https://finance.yahoo.com/news/fed-hold-leaves-wall-street-190000028.html",
    "timestamp": "2025-06-15T19:00:00Z"
  },
  {
    "title": "Trump ‘open’ to Putin as Iran-Israel mediator",
    "description": "The US and Russian presidents previously discussed Middle East tensions in an hour-long phone conversation Read Full Article at RT.com",
    "link": "https://www.rt.com/russia/619390-trump-putin-israel-iran/",
    "timestamp": "2025-06-15T18:57:43Z"
  },
  {
    "title": "Trump says he 'may' call Walz after Minnesota shootings, calls him 'grossly incompetent'",
    "description": "President Donald Trump told ABC News on Sunday that he \"may\" call Minnesota Gov. Tim Walz after a political assassination sent shockwaves through the state. The president, who condemned the violence, called the Democratic governor a \"terrible governor\" and \"g…",
    "link": "https://freerepublic.com/focus/f-news/4323221/posts",
    "timestamp": "2025-06-15T18:57:43Z"
  },
  {
    "title": "Liberals Force Young Children To Participate In Violent, Vulgar Anti-Trump Protests",
    "description": "Left-wing protesters forced children to take part in shouting obscenities and to beat a puppet of Donald Trump during Saturday’s “No Kings” protests.",
    "link": "https://dailycaller.com/2025/06/15/liberals-force-young-children-participate-violent-anti-trump-protests/",
    "timestamp": "2025-06-15T18:56:46Z"
  },
  {
    "title": "[Ilya Somin] How Trump's Imposition of Massive Tariffs is Repeating the \"Ship Money\" Abuses of King Charles I",
    "description": "Yesterday, there were massive nationwide \"No Kings\" protests against Donald Trump and his authoritarian tendencies. Like most political slogans,",
    "link": "https://reason.com/volokh/2025/06/15/how-trumps-imposition-of-massive-tariffs-is-repeating-the-ship-money-abuses-of-king-charles-i/",
    "timestamp": "2025-06-15T18:54:59Z"
  },
  {
    "title": "Close Trump Allies Sponsored the Military Parade, Raising Ethical Concerns - The New York Times",
    "description": "Close Trump Allies Sponsored the Military Parade, Raising Ethical ConcernsThe New York Times More than 30 people hospitalized following DC military paradeFOX 5 DC D.C. onlookers line streets for Trump military parade; 'No Kings' protests unfold nationwideNBC …",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178057307",
    "timestamp": "2025-06-15T18:52:56Z"
  },
  {
    "title": "Three questions about Iran tell us how precarious the global economy is",
    "description": "The oil price surged more than 7 per cent on Friday after news of the attack hit commodity traders' screens, and any thought of the price staying below $US60 a barrel this year now seems dead.",
    "link": "https://www.abc.net.au/news/2025-06-16/israel-iran-global-economy-oil-inflation/105418448",
    "timestamp": "2025-06-15T18:51:48Z"
  },
  {
    "title": "Trump’s Parade Vs the People's Protest: Two Very Different Versions of America",
    "description": "From robot military dogs and tanks rumbling through the streets of the nation's capital to millions joining “No Kings” demonstrations across the U.S., June 14th was a cultural split-screen moment.",
    "link": "https://www.vanityfair.com/news/story/trump-parade-vs-no-kings-protest-june14",
    "timestamp": "2025-06-15T18:47:06Z"
  },
  {
    "title": "Investors unnerved as Israel-Iran conflict fuels turmoil in oil markets",
    "description": "Investors were on edge ahead of markets reopening late on Sunday, gripped by anxiety over nationwide protests against President Donald Trump and the escalating threat of a sweeping conflict in the Middle East.\nIsrael and Iran launched fresh attacks on each ot…",
    "link": "https://biztoc.com/x/30c8157316bd87b9",
    "timestamp": "2025-06-15T18:45:31Z"
  },
  {
    "title": "The risks to AUKUS that could leave us billions out of pocket with no subs",
    "description": "Key defence figures on both sides of the Atlantic warn the risks to AUKUS run deeper than whether a review finds it is \"America first\" enough for Donald Trump.",
    "link": "https://www.abc.net.au/news/2025-06-16/aukus-risks-trump-review-defence-four-corners/105412740",
    "timestamp": "2025-06-15T18:43:58Z"
  },
  {
    "title": "Veteran analyst sends surprising message on stocks, bonds, and gold",
    "description": "A big opportunity may be near, but it's not what you think.",
    "link": "https://www.thestreet.com/markets/veteran-analyst-sends-surprising-message-on-stocks-bonds-and-gold",
    "timestamp": "2025-06-15T18:40:13Z"
  },
  {
    "title": "Trump: ‘It’s possible we could get involved’ in Israel-Iran war, suggests surprising name to settle conflict",
    "description": "'This is something I believe is going to get resolved'",
    "link": "https://www.wnd.com/2025/06/trump-its-possible-we-could-get-involved-in-israel-iran-war-suggests-surprising-name-to-settle-conflict/",
    "timestamp": "2025-06-15T18:38:49Z"
  },
  {
    "title": "Israel’s high-risk strategy has made an already unstable region more dangerous over the weekend",
    "description": "Tensions escalate in West Asia after Israeli strikes on Iranian nuclear and military sites. Iran retaliates with missile and drone attacks. The strikes follow concerns about Iran's nuclear program and failed negotiations. Benjamin Netanyahu believes military …",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/israels-high-risk-strategy-has-made-an-already-unstable-region-more-dangerous-over-the-weekend/articleshow/121867928.cms",
    "timestamp": "2025-06-15T18:37:47Z"
  },
  {
    "title": "Take a good look at LA’s riots, New York — the wrong mayor will make them ours",
    "description": "Weak mayors have floundered under the pressure of civil unrest — and Zohran Mamdani promises a return to the bad old days of Bill de Blasio.",
    "link": "https://nypost.com/2025/06/15/opinion/how-the-wrong-mayor-will-let-las-riots-explode-in-nyc/",
    "timestamp": "2025-06-15T18:36:22Z"
  },
  {
    "title": "I was worried about Trump’s Army parade — until I saw it",
    "description": "I arrived for the U.S. Army’s 250th anniversary parade in Washington D.C. on a drizzly Saturday afternoon with considerable consternation and concern. I knew that President Donald Trump had been agitating for such a spectacle since 2017, but that his first se…",
    "link": "https://freerepublic.com/focus/f-news/4323218/posts",
    "timestamp": "2025-06-15T18:35:32Z"
  },
  {
    "title": "The Donland deal: How Pakistan got Trump’s attention again",
    "description": "Pakistan is leveraging its relationship with the US, particularly with a potential Trump return. It is using lobbying and military ties to stay relevant. Army Chief Asim Munir's connections are key. The US acknowledges Pakistan's counterterrorism role. Genera…",
    "link": "https://economictimes.indiatimes.com/opinion/et-commentary/the-donland-deal-how-pakistan-got-trumps-attention-again/articleshow/121867809.cms",
    "timestamp": "2025-06-15T18:34:08Z"
  },
  {
    "title": "Iran Israel Rising Tensions: Did US President Donald Trump stop Israel from assassinating Iran's Supreme Leader Ayatollah Ali Khamenei? This is what the reports reveal",
    "description": "Reports say Israel planned to assassinate Iran's Supreme Leader Ayatollah Ali Khamenei. US President Donald Trump reportedly rejected the plan. Israeli and US officials discussed it during heightened tensions over Iran’s nuclear program. Prime Minister Netany…",
    "link": "https://economictimes.indiatimes.com/news/international/us/iran-israel-rising-tensions-did-us-president-donald-trump-stop-israel-from-assassinating-irans-supreme-leader-ayatollah-ali-khamenei-this-is-what-the-reports-reveal/articleshow/121867760.cms",
    "timestamp": "2025-06-15T18:30:52Z"
  },
  {
    "title": "Trump says he 'may' call Walz after Minnesota shootings, calls him 'grossly incompetent'",
    "description": "Trump says he 'may' call Walz after Minnesota shootings, calls him 'grossly incompetent'go.com",
    "link": "https://abcnews.go.com/Politics/trump-call-walz-after-minnesota-shootings-calls-grossly/story?id=122870353",
    "timestamp": "2025-06-15T18:29:00Z"
  },
  {
    "title": "Hakeem Jeffries: Trump Trying to Push ‘Far-Right Extremism’ Down the Throats of the American People",
    "description": "House Minority Leader Hakeem Jeffries (D-NY) said Sunday on MSNBC’s “The Weekend” that President Donald Trump is trying to push “far-right extremism” down the throats of the American people. Co-host Jonathan Capehart said, “As you noted a couple of times in t…",
    "link": "https://freerepublic.com/focus/f-news/4323216/posts",
    "timestamp": "2025-06-15T18:28:04Z"
  },
  {
    "title": "Fact-checking unsubstantiated claims linking Gov. Walz to Minnesota lawmakers’ shootings",
    "description": "In 2019, Minnesota Gov. Tim Walz reappointed the suspect wanted in connection with the shooting of Minnesota state legislators to a workforce development board. Conservatives baselessly said that implicated Walz in the killing.",
    "link": "https://www.pbs.org/newshour/politics/fact-checking-unsubstantiated-claims-linking-gov-walz-to-minnesota-lawmakers-shootings",
    "timestamp": "2025-06-15T18:27:55Z"
  },
  {
    "title": "Manhunt Intensifies In US After Lawmaker Killed, Another Wounded",
    "description": "Police and FBI agents waged a huge manhunt Sunday for a gunman who killed a Democratic state lawmaker and her husband in Minnesota in what officials called a politically motivated attack.",
    "link": "https://www.ibtimes.com/manhunt-intensifies-us-after-lawmaker-killed-another-wounded-3775744",
    "timestamp": "2025-06-15T18:27:23Z"
  },
  {
    "title": "Trump Nixed Israeli Plan to Assassinate Iran’s Supreme Leader: Report",
    "description": "\"Have the Iranians killed an American yet? No. Until they do, we're not even talking about going after the political leadership,\" a U.S. official told Reuters",
    "link": "http://www.rollingstone.com/politics/politics-news/trump-israel-plan-assassinate-iran-supreme-leader-1235365135/",
    "timestamp": "2025-06-15T18:24:21Z"
  },
  {
    "title": "Can Musk and Trump Move Forward?",
    "description": "Elon Musk's public feud with President Donald Trump has proven to be quite costly for the world's richest man, resulting in a $34 billion loss to his personal net worth within days. On this episode of the Elon, Inc. podcast, we discuss what could be the path …",
    "link": "https://biztoc.com/x/8dcba5ae1a746ab4",
    "timestamp": "2025-06-15T18:23:24Z"
  }
]