[
  {
    "title": "Trump's Trans Kid Story Doesn't Add Up",
    "description": "The Trump administration is \"working to protect our children from toxic ideologies in our schools,\" President Donald Trump told the nation during a",
    "link": "https://reason.com/2025/03/05/trumps-trans-kid-story-doesnt-add-up/",
    "timestamp": "2025-03-05T16:35:04Z"
  },
  {
    "title": "All negative economic data is 'Biden data' and Trump will fix the economy, Commerce chief Lutnick says",
    "description": "The stock market dropped sharply in recent days as investors worried about the effects of new tariffs on Canada and Mexico by President Trump.",
    "link": "https://www.cnbc.com/2025/03/05/trump-commerce-chief-lutnick-blames-biden-for-economy.html",
    "timestamp": "2025-03-05T16:34:41Z"
  },
  {
    "title": "Major retailers temper expectations for 2025 as Americans slow their spending",
    "description": "A pullback by American shoppers has led to more caution from national retailers about their sales potential in 2025, Abercrombie & Fitch on Wednesday becoming the latest.",
    "link": "https://www.wral.com/story/some-retailers-more-cautious-with-financial-outlooks-as-they-keep-an-eye-on-consumer-spending/21894091/",
    "timestamp": "2025-03-05T16:34:26Z"
  },
  {
    "title": "What Trump tariffs mean for Amazon, Boeing and WA’s very global economy",
    "description": "Washington businesses and consumers are again bracing for a trade war after President Donald Trump on Tuesday imposed tariffs on goods from Canada, Mexico and China, prompting retaliation or threats of retaliation from all three nations.\nThough a full-scale r…",
    "link": "https://biztoc.com/x/28d7172f0d7853ea",
    "timestamp": "2025-03-05T16:34:13Z"
  },
  {
    "title": "US Stops Military Aid to Ukraine—Here's Where It Is Still Funding",
    "description": "U.S. President Donald Trump halted military aid to Ukraine on Monday, following a heated exchange with Ukrainian President Volodymyr Zelensky in a televised Oval Office meeting.\nNewsweek has contacted the White House for comment.\nWhy It Matters\nTrump's decisi…",
    "link": "https://biztoc.com/x/79ac3caf3d0fd2ea",
    "timestamp": "2025-03-05T16:34:11Z"
  },
  {
    "title": "Trump threatens to kill CHIPS Act, bringing funding into question",
    "description": "President Donald Trump is calling for Congress to get rid of the CHIPS Act. The Biden administration's signature legislation meant to boost semiconductor production and research in the US and ween the country off of its dependence on chips made overseas.\nDuri…",
    "link": "https://biztoc.com/x/39c42c43d1cc03cd",
    "timestamp": "2025-03-05T16:33:53Z"
  },
  {
    "title": "Is Hamas winning the waiting game against Israel?",
    "description": "With no clear Israeli strategy on phase two, Hamas feels emboldened enough to delay hostage negotiations for days.",
    "link": "https://www.jpost.com/middle-east/article-844846",
    "timestamp": "2025-03-05T16:33:33Z"
  },
  {
    "title": "Jasmine Crockett calls Trump a \"thug,\" causing MAGA world to demand Congress members be \"held accountable for their words.\" And in unrelated news, Marjorie Taylor Greene still exists [Asinine]",
    "description": "Jasmine Crockett calls Trump a \"thug,\" causing MAGA world to demand Congress members be \"held accountable for their words.\" And in unrelated news, Marjorie Taylor Greene still exists",
    "link": "https://www.fark.com/comments/13585168/Jasmine-Crockett-calls-Trump-a-thug-causing-MAGA-world-to-demand-Congress-members-be-held-accountable-for-their-words-And-in-unrelated-news-Marjorie-Taylor-Greene-still-exists",
    "timestamp": "2025-03-05T16:33:28Z"
  },
  {
    "title": "Fired Federal Workers Tell MSNBC They Are Still Confused Why They Don’t Have Jobs After Watching Trump Speech",
    "description": "Federal workers fired under Donald Trump told NBC that they remain confused about why they are unemployed after watching the president's Congress address.\nThe post Fired Federal Workers Tell MSNBC They Are Still Confused Why They Don’t Have Jobs After Watchin…",
    "link": "https://www.mediaite.com/tv/fired-federal-workers-tell-msnbc-they-are-still-confused-why-they-dont-have-jobs-after-watching-trump-speech/",
    "timestamp": "2025-03-05T16:33:23Z"
  },
  {
    "title": "Apple co-founder Steve Wozniak slams Elon Musk’s DOGE role: ‘I don’t like that at all’",
    "description": "Steve Wozniak criticized Elon Musk’s involvement in politics, particularly his leadership of the Department of Government Spending under Trump. Wozniak expressed concerns that corporate skills don't translate to public governance and disagreed with Musk's app…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/apple-co-founder-steve-wozniak-slams-elon-musks-doge-role-i-dont-like-that-at-all/articleshow/118740493.cms",
    "timestamp": "2025-03-05T16:32:58Z"
  },
  {
    "title": "USA Energy Sec Says We're at the Start of a New Manhattan Project",
    "description": "On its site, the U.S. Department of Energy states that it traces its origins to World War II and the Manhattan Project effort to build the first atomic bomb.",
    "link": "https://www.rigzone.com/news/usa_energy_sec_says_were_at_the_start_of_a_new_manhattan_project-05-mar-2025-179828-article/",
    "timestamp": "2025-03-05T16:32:36Z"
  },
  {
    "title": "CFPB drops lawsuit against Bank of America, JPMorgan Chase and Wells Fargo over Zelle fraud",
    "description": "A federal regulator claimed the banks failed to protect hundreds of thousands of consumers.",
    "link": "https://www.denverpost.com/2025/03/05/cfpb-zelle-lawsuit/",
    "timestamp": "2025-03-05T16:32:12Z"
  },
  {
    "title": "‘Once-off’ €500m tax payment boosts exchequer data in February",
    "description": "Latest exchequer returns, published by the Department of Finance, show Government has collected €15.2bn in tax so far this year",
    "link": "https://www.irishtimes.com/business/economy/2025/03/05/once-off-500m-tax-payment-boosts-exchequer-data-in-february/",
    "timestamp": "2025-03-05T16:32:00Z"
  },
  {
    "title": "Michael Burry and Jeremy Grantham have long sounded the economic alarm. A 'Trumpcession' may finally prove them right.",
    "description": "Bill Gross, David Rosenberg, Paul Krugman, and Jeremy Siegel are also bracing for trouble as Trump's policies threaten growth and inflation.",
    "link": "https://www.businessinsider.com/burry-grantham-stock-market-crash-recession-trumpcession-tariffs-inflation-krugman-2025-3",
    "timestamp": "2025-03-05T16:31:37Z"
  },
  {
    "title": "India may offer duty concession to the US on soya oil, apple, lentils",
    "description": "India considers reducing tariffs on soyabean oil, lentils, and apples in negotiations with the US, but poultry may be excluded.",
    "link": "https://www.thehindubusinessline.com/economy/agri-business/india-may-offer-duty-concession-to-the-us-on-soya-oil-apple-lentils/article69295314.ece",
    "timestamp": "2025-03-05T16:30:45Z"
  },
  {
    "title": "Germany to ease government debt limits in major step aimed at boosting economy, defense spending",
    "description": "The two political parties expected to form the next German government have agreed to significantly loosen the country’s constitutional restriction on deficits, enabling 1 trillion euros ($1.08 trillion) or more in new borrowing and spending on defense ...",
    "link": "https://abcnews.go.com/Business/wireStory/germany-ease-government-debt-limits-major-step-aimed-119478344",
    "timestamp": "2025-03-05T16:30:24Z"
  },
  {
    "title": "Panama, Greenland lash out at Trump's latest push to 'reclaim' them, 'one way or another'",
    "description": "U.S. President Donald Trump reiterated his plans for Panama and Greenland in his comments to Congress on Tuesday, prompting swift pushback from the leaders of those countries.",
    "link": "https://www.cbc.ca/news/world/trump-panama-greenland-1.7475032",
    "timestamp": "2025-03-05T16:30:20Z"
  },
  {
    "title": "Bitcoin, Ethereum, and XRP exchange inflows surge after Donald Trump’s crypto reserve announcement",
    "description": "Crypto markets reacted sharply after US President Donald Trump unveiled plans for a Crypto Strategic Reserve on March 2. The proposal, which includes Bitcoin, Ethereum, XRP, Solana, and Cardano, triggered a wave of sell-offs as traders sought to capitalize on…",
    "link": "https://cryptoslate.com/insights/bitcoin-ethereum-and-xrp-exchange-inflows-surge-after-donald-trumps-crypto-reserve-announcement/",
    "timestamp": "2025-03-05T16:30:07Z"
  },
  {
    "title": "Osgood Perkins Has No Desire to Direct a James Bond Film: ‘F**k Jeff Bezos’",
    "description": "Osgood Perkins explained why he will never direct a James Bond film because of IP owner and Amazon CEO Jeff Bezos.",
    "link": "https://www.indiewire.com/news/general-news/osgood-perkins-never-direct-james-bond-jeff-bezos-1235101121/",
    "timestamp": "2025-03-05T16:30:00Z"
  },
  {
    "title": "Musk's embrace of right-wing politics risks turning off car buyers and sinking Tesla's stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world, analysts say, and the hit couldn't come at a worse time.",
    "link": "https://roanoke.com/news/nation-world/business/article_13cb8f44-f592-5f07-ad2e-3c34f55c1c4c.html",
    "timestamp": "2025-03-05T16:30:00Z"
  },
  {
    "title": "Trump’s April 2 reciprocal tariff threat sets deadline for India to work out deal",
    "description": "India faces potential reciprocal tariffs from the US due to high tariffs, prompting negotiations for a bilateral trade agreement.",
    "link": "https://www.thehindubusinessline.com/economy/trumps-april-2-reciprocal-tariff-threat-sets-deadline-for-india-to-work-out-deal/article69295323.ece",
    "timestamp": "2025-03-05T16:30:00Z"
  },
  {
    "title": "Musk's embrace of right-wing politics risks turning off car buyers and sinking Tesla's stock",
    "description": "Elon Musk appears be to turning off potential Tesla buyers with his embrace of far-right politicians around the world, analysts say, and the hit couldn't come at a worse time.",
    "link": "https://richmond.com/news/nation-world/business/article_4ecdee9f-0b21-5e7f-b4ac-561d85a1cd5c.html",
    "timestamp": "2025-03-05T16:30:00Z"
  },
  {
    "title": "Bitcoin trader eyes $78K BTC price retest as US seen delaying reserve",
    "description": "US Congressional support for a Bitcoin reserve is lacking, Senator Cynthia Lummis warns as BTC price momentum stalls.",
    "link": "https://cointelegraph.com/news/bitcoin-trader-sees-btc-price-falling-to-78-k-again",
    "timestamp": "2025-03-05T16:29:51Z"
  },
  {
    "title": "MAGA Republicans Move to Punish Democrat Who Protested Trump Speech",
    "description": "Democratic Representative Al Green’s protest during Donald Trump’s address to Congress Tuesday night went too far for his Republican colleagues, who are now calling for his censure. \r\nThe far-right House Freedom Caucus posted on X Wednesday that it plans to i…",
    "link": "https://newrepublic.com/post/192357/house-republicans-punish-democrat-al-green-protest-trump-speech",
    "timestamp": "2025-03-05T16:29:50Z"
  },
  {
    "title": "Ex-Biden Spox Takes to Fox News With Blistering Slam on Trump and Elon Musk for Not ‘Putting America First’",
    "description": "Ex-Biden spox Andrew Bates took to Fox News with a blistering op-ed slamming President Donald Trump and Elon Musk for not \"putting America first.\"\nThe post Ex-Biden Spox Takes to Fox News With Blistering Slam on Trump and Elon Musk for Not ‘Putting America Fi…",
    "link": "https://www.mediaite.com/news/ex-biden-spox-takes-to-fox-news-with-blistering-slam-on-trump-and-elon-musk-for-not-putting-america-first/",
    "timestamp": "2025-03-05T16:29:10Z"
  },
  {
    "title": "With Ukraine, the US Is Repeating Mistakes Made in Afghanistan",
    "description": "In ending the war in Afghanistan, the U.S. belittled and sidelined its partner in favor of engaging with the enemy. The result can hardly be called a success.",
    "link": "https://thediplomat.com/2025/03/with-ukraine-the-us-is-repeating-mistakes-made-in-afghanistan/",
    "timestamp": "2025-03-05T16:28:07Z"
  },
  {
    "title": "Over 300 Nobel Peace nominees counted, possibly including Donald Trump",
    "description": "Over 300 people are nominated for this year's Nobel Peace Prize, organisers said Wednesday, with politicians claiming they had put US President Donald Trump and Pope Francis forward for the award. In January, thousands of people signed a UK petition calling f…",
    "link": "https://timesofindia.indiatimes.com/world/us/over-300-nobel-peace-nominees-counted-possibly-including-donald-trump/articleshow/118740528.cms",
    "timestamp": "2025-03-05T16:27:39Z"
  },
  {
    "title": "Video: Senator Slotkin Delivers Blistering Rebuttal",
    "description": "Michigan Senator Elissa Slotkin delivered a blistering rebuttal to Donald Trump's speech on March 4. Reuters reported The midwestern moderate Democrat hit back at Trump on Ukraine, foreign policy, and Elon Musk's illegal actions.\nSlotkin is a former CIA analy…",
    "link": "https://crooksandliars.com/2025/03/video-senator-slotkin-delivers-brilliant",
    "timestamp": "2025-03-05T16:27:23Z"
  },
  {
    "title": "Volvo Cars may move some production to US over Trump tariffs",
    "description": "Volvo may relocate some production to the U.S. depending on tariff changes but will continue plans to export the EX30 SUV made in Europe. CEO Jim Rowan indicated strategies are adaptable, with potential capacity shifts to the Charleston plant based on future …",
    "link": "https://economictimes.indiatimes.com/news/international/business/volvo-cars-may-move-some-production-to-us-over-trump-tariffs/articleshow/118740510.cms",
    "timestamp": "2025-03-05T16:26:40Z"
  },
  {
    "title": "Trump Already Capitulating And Backtracking On Tariffs",
    "description": "Donald Trump's Commerce Secretary went on Larry Kudlow's program Wednesday and immediately started backtracking on the tariffs Trump has levied against Canada Mexico and China.\nWith the stock market crashing you can bet Trump's big donors were on the phone sc…",
    "link": "https://crooksandliars.com/2025/03/trump-already-capitulating-and",
    "timestamp": "2025-03-05T16:26:17Z"
  },
  {
    "title": "Jimmy Kimmel Absolutely Nails It Over Donald's Speech To Congress",
    "description": "If you subjected yourself to watching President Whiny Titty Baby's State of the Union address to Congress last night, you likely through objects at your television, too. Republicans applauded Donald even though stocks have plummeted and food prices are up as …",
    "link": "https://crooksandliars.com/2025/03/jimmy-kimmel-nails-it-over-donalds-speech",
    "timestamp": "2025-03-05T16:25:51Z"
  },
  {
    "title": "French nuclear deterrence for Europe: how effective could it be against Russia?",
    "description": "Under what conditions could France – the only nuclear power in the EU since Brexit – provide deterrence on a European scale now that US protection against Russia is not guaranteed?",
    "link": "https://theconversation.com/french-nuclear-deterrence-for-europe-how-effective-could-it-be-against-russia-251512",
    "timestamp": "2025-03-05T16:24:58Z"
  },
  {
    "title": "‘Morning Joe’ Rips Trump Speech: ‘So Much Nonsense’ | Video",
    "description": "Joe Scarborough takes issue with President Trump favorably comparing his first month back in office to George Washington\nThe post ‘Morning Joe’ Rips Trump Speech: ‘So Much Nonsense’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/morning-joe-rips-trump-speech-address/",
    "timestamp": "2025-03-05T16:24:41Z"
  },
  {
    "title": "Trump’s lawyers just made a $2 billion mistake",
    "description": "On Wednesday morning, the Supreme Court handed down a very brief order that effectively requires the government to pay foreign aid contractors as much as $2 billion for work they’ve already completed. The Court’s order is quite narrow and is unlikely to have …",
    "link": "https://www.vox.com/scotus/402648/supreme-court-usaid-trump-aids-vaccine",
    "timestamp": "2025-03-05T16:24:36Z"
  },
  {
    "title": "Greenland Prime Minister Expertly Shuts Down Trump’s Wild Threat",
    "description": "Greenland’s Prime Minister Múte Bourup Egede hit back at Donald Trump’s outlandish threat to acquire the Danish territory “one way or the other.”\r\nIn his address to Congress Tuesday night, Trump gave conflicting messages to the citizens of Greenland. While he…",
    "link": "https://newrepublic.com/post/192352/donald-trump-greenland-threat-prime-minister",
    "timestamp": "2025-03-05T16:23:27Z"
  },
  {
    "title": "Payton McNabb 'heartbroken' over Dems' coldness at Trump speech to her story of injuries from trans athlete",
    "description": "Former volleyball player Payton McNabb spoke out against Democrats for refusing to applaud during President Trump's joint address on Tuesday night.",
    "link": "https://www.foxnews.com/sports/payton-mcnabb-heartbroken-over-dems-coldness-trump-speech-her-story-injuries-from-trans-athlete",
    "timestamp": "2025-03-05T16:23:00Z"
  },
  {
    "title": "Mysterious Woman Sitting Next to Elon Musk During Trump's Speech Identified",
    "description": "The mysterious woman sitting next to Elon Musk during President Donald Trump's address to Congress has been identified by Newsweek as Heather Valentino.\nNewsweek has reached out to Valentino via social media, and to Musk via X's press email for comment.\nWhy I…",
    "link": "https://biztoc.com/x/7169e92e0831e8c8",
    "timestamp": "2025-03-05T16:22:44Z"
  },
  {
    "title": "Trump administration deletes list of hundreds of federal buildings targeted for potential sale",
    "description": "The Trump administration published a list of more than 440 federal properties it identified to close or sell, including the FBI headquarters and the main Department of Justice building, after deeming them “not core to government operations.”",
    "link": "https://abcnews.go.com/Business/wireStory/trump-administration-deletes-list-hundreds-federal-buildings-targeted-119479808",
    "timestamp": "2025-03-05T16:22:18Z"
  },
  {
    "title": "As Donald Trump suspended aid to Ukraine, this satellite company that competes with Elon Musk's Starlink saw its shares triple in value; here's the reason",
    "description": "Eutelsat's shares surged after concerns arose over Ukraine's access to Starlink's internet service due to the US cutting aid. Eutelsat, which merged with OneWeb, is negotiating with EU officials to provide satellite services to Ukraine. The future of Starlink…",
    "link": "https://economictimes.indiatimes.com/news/international/us/as-donald-trump-suspended-aid-to-ukraine-this-satellite-company-that-competes-with-elon-musks-starlink-saw-its-shares-triple-in-value-heres-the-reason/articleshow/118739750.cms",
    "timestamp": "2025-03-05T16:22:03Z"
  },
  {
    "title": "Rep. Al Green Explains What He Shouted at Trump And Why He Thinks Worth Any Punishment",
    "description": "Green told reporters afterward that it was worth disrupting Trump’s address to a joint session of Congress at the Capitol on Tuesday.\r\nPhoto: Win McNamee/Pool Photo (Getty Images)\r\nWelp, it’s time to add to the long list of politicians taking a stand against …",
    "link": "https://www.theroot.com/what-exactly-did-rep-al-green-shout-at-trump-and-why-d-1851767806",
    "timestamp": "2025-03-05T16:22:00Z"
  },
  {
    "title": "New FTC rules unlikely with limited funds, policy shifts",
    "description": "Amid resource limitations and changes at the federal level, the FTC will be cautious in its approach to bringing cases and making other significant changes.",
    "link": "https://www.techtarget.com/searchcio/news/366620314/New-FTC-rules-unlikely-with-limited-funds-policy-shifts",
    "timestamp": "2025-03-05T16:22:00Z"
  },
  {
    "title": "Panama president says Trump is lying about reclaiming Panama Canal",
    "description": "Panama's leader accused President Trump of lying in his Tuesday congressional address, where he said his administration was \"reclaiming\" the Panama Canal.",
    "link": "https://www.cbsnews.com/news/panama-president-says-trump-lying-about-reclaiming-panama-canal/",
    "timestamp": "2025-03-05T16:21:38Z"
  },
  {
    "title": "Congressman and former Houston Mayor Sylvester Turner dies",
    "description": "U.S. Rep. Sylvester Turner, a former Houston mayor, state legislator and institution in Houston Democratic politics, died Tuesday evening. He was 70. Turner's death comes two months into his first term representing Texas’ 18th Congressional District, the seat…",
    "link": "https://freerepublic.com/focus/f-news/4302250/posts",
    "timestamp": "2025-03-05T16:21:01Z"
  },
  {
    "title": "Why are record number of Americans applying for UK citizenship? Explained in 10 points",
    "description": "Are Americans flocking abroad in the face of political turbulence at home?  The number of Americans applying for UK citizenship has hit an all-time high since Donald Trump was re-elected as President. Number of Americans applying to call Britain home has doub…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-news-record-number-of-americans-applying-for-uk-citizenship-since-donald-trump-win-election-november-tax-reforms/articleshow/118740356.cms",
    "timestamp": "2025-03-05T16:21:00Z"
  },
  {
    "title": "Private employers added just 77,000 jobs in February, far below expectations, ADP says",
    "description": "Private sector job creation slowed to a crawl in February, fueling concerns of an economic slowdown, payrolls processing firm ADP reported Wednesday.",
    "link": "https://www.nbcnews.com/business/economy/private-employers-added-just-77000-jobs-february-far-expectations-adp-rcna194888",
    "timestamp": "2025-03-05T16:20:56Z"
  },
  {
    "title": "13 fact checks of President Donald Trump’s address to Congress",
    "description": "President Donald Trump recapped six weeks of aggressive efforts to cut the federal workforce, reorganize the economy and reorient foreign policy in his first address to a joint session of […]\nThe post 13 fact checks of President Donald Trump’s address to Cong…",
    "link": "https://www.poynter.org/fact-checking/2025/president-donald-trump-state-union-address-fact-checks/",
    "timestamp": "2025-03-05T16:20:42Z"
  },
  {
    "title": "Trump trade war could have ‘substantial’ impact on UK, says Bank of England boss",
    "description": "Andrew Bailey tells MPs it would be a “very damaging thing for the world” if U.S. president pulls out of World Bank and International Monetary Fund too.",
    "link": "https://www.politico.eu/article/us-trade-war-would-have-substantial-impact-on-uk-says-boes-bailey/",
    "timestamp": "2025-03-05T16:20:23Z"
  },
  {
    "title": "Crony Crypto Capitalism",
    "description": "Trump isn’t working for the American taxpayer.",
    "link": "https://www.theatlantic.com/ideas/archive/2025/03/trump-crypto-capitalism/681919/",
    "timestamp": "2025-03-05T16:20:00Z"
  },
  {
    "title": "Cybertrucks attacked during Mardi Gras parade",
    "description": "Anti-Musk protest breaks out as Teslas are booed and pelted with beads in New Orleans.",
    "link": "https://www.newsweek.com/cybertrucks-attacked-during-mardi-gras-parade-2039814",
    "timestamp": "2025-03-05T16:19:43Z"
  },
  {
    "title": "Exclusive: Mysterious Woman Sitting Next to Elon Musk During Trump's Speech Identified",
    "description": "The unknown woman was sat next to Musk during Trump's address to Congress.",
    "link": "https://www.newsweek.com/woman-sitting-next-elon-musk-trump-speech-identified-heather-valentino-2039922",
    "timestamp": "2025-03-05T16:19:43Z"
  },
  {
    "title": "Trump Admin To Collect Immigrants’ Social Media Handles",
    "description": "USCIS is aiming to collect the social media information of immigrants entering the U.S., a move that could help law enforcement detect extremist activity.",
    "link": "https://dailycaller.com/2025/03/05/trump-collect-migrant-social-media/",
    "timestamp": "2025-03-05T16:19:11Z"
  },
  {
    "title": "Supreme Court Rules 5-4 Against Trump Administration in Foreign Aid Case",
    "description": "A sharply divided Supreme Court on Wednesday rejected a Trump administration push to rebuke a federal judge.",
    "link": "https://time.com/7264765/supreme-court-trump-foreign-aid-case/",
    "timestamp": "2025-03-05T16:17:52Z"
  },
  {
    "title": "Mexico warns US it is ready to seek other trade partners",
    "description": "Mexican President Claudia Sheinbaum has warned that Mexico may seek other trading partners in response to US tariffs imposed by President Trump. Sheinbaum pledged retaliatory duties but also expressed a preference for negotiation and dialogue, citing the symb…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/mexico-warns-us-it-is-ready-to-seek-other-trade-partners/articleshow/118740389.cms",
    "timestamp": "2025-03-05T16:17:39Z"
  },
  {
    "title": "Supreme Court Says Trump Admin. Must Pay $2 Billion in USAID Funds",
    "description": "The Supreme Court sided with a district court judge Wednesday who had ruled the Trump administration could not stop $2 billion in U.S. Agency for International Development (USAID) payments to intended recipients.\nThe post Supreme Court Says Trump Admin. Must …",
    "link": "https://www.breitbart.com/politics/2025/03/05/supreme-court-divided-rejects-trump-admin-push-to-rebuke-judge-over-foreign-aid-freeze/",
    "timestamp": "2025-03-05T16:17:21Z"
  },
  {
    "title": "$800 Exemption To Canadian Tariffs Restored… For Now",
    "description": "As part of the new tariffs being imposed on US importers from Canada and Mexico, and China, it was believed that the \"de minimis exemption\" would be removed, which allows imports under $800 in value to avoid added duties as part of the tariff orders. However …",
    "link": "https://bleedingcool.com/comics/800-exemption-to-canadian-tariffs-restored-for-now/",
    "timestamp": "2025-03-05T16:17:07Z"
  },
  {
    "title": "Ex-prosecutor says Trump risks 'someone getting held in contempt' after speech admission",
    "description": "MSNBC legal analyst Joyce Vance distilled President Donald Trump's marathon address to Congress down to two moments she felt were \"worth noting, as markers of where we are\" as a country.In a Substack article, Vance dubbed the first moment to remember as \"The …",
    "link": "https://www.rawstory.com/stupid-corrupt-contempt-vance/",
    "timestamp": "2025-03-05T16:16:46Z"
  },
  {
    "title": "The Trump Depression - Donald Trump is on track to be the first president to deliberately engineer a severe depression. (Robert Kuttner/American Prospect)",
    "description": "Robert Kuttner / American Prospect:\nThe Trump Depression  —  Donald Trump is on track to be the first president to deliberately engineer a severe depression.  —  Financial news is displayed as people work on the floor at the New York Stock Exchange in New Yor…",
    "link": "https://www.memeorandum.com/250305/p57",
    "timestamp": "2025-03-05T16:15:01Z"
  },
  {
    "title": "Stream It Or Skip It: ‘Andrew Schulz: LIFE’ on Netflix, Where We Learn If Becoming a Girldad Will Make This Comedian Less Toxic (No Spoilers!)",
    "description": "“What would the streets say?”",
    "link": "https://decider.com/2025/03/05/andrew-schulz-life-netflix-review/",
    "timestamp": "2025-03-05T16:15:00Z"
  },
  {
    "title": "Fact check: Where was Trump wrong in his Congress speech?",
    "description": "In his speech to Congress, US President Donald Trump delivered a blistering attack. One claim: The US has spent more money helping Ukraine than Europe has. Is that actually true? Heckling, chants and an expulsion - US President Donald Trump's first speech to …",
    "link": "https://www.dw.com/en/fact-check-where-was-trump-wrong-in-his-congress-speech/a-71834997",
    "timestamp": "2025-03-05T16:15:00Z"
  },
  {
    "title": "Elon Musk’s Shadow Government Is on Shaky Legal Ground",
    "description": "The Framers would be appalled at the idea of an unelected billionaire acting as a de facto prime minister carrying out the president’s every wish. Will the courts put a stop to it?",
    "link": "https://www.vanityfair.com/news/story/elon-musk-supreme-court-donald-trump",
    "timestamp": "2025-03-05T16:14:51Z"
  },
  {
    "title": "Offset Blasts 'Racist' Elon Musk For Supporting George Floyd's Killer Derek Chauvin",
    "description": "Offset has blasted Elon Musk as 'racist' after he expressed support for George Floyd's killer, Derek Chauvin, to be released from prison.",
    "link": "https://hiphopdx.com/news/offset-blasts-elon-musk-derek-chauvin-pardon-george-floyd",
    "timestamp": "2025-03-05T16:14:07Z"
  },
  {
    "title": "Trudeau not willing to lift Canada’s retaliatory tariffs if Trump leaves some tariffs on Canada",
    "description": "The Commerce Secretary said there might be carveouts coming.",
    "link": "https://www.bostonherald.com/2025/03/05/canada-us-trump-tariffs/",
    "timestamp": "2025-03-05T16:14:04Z"
  },
  {
    "title": "State Of Disunion: Donald Trump’s Culture War Congressional Speech Protested By Demonstrative Democrats",
    "description": "Donald Trump’s speech to congress sparked protest and outrage from Democrat politicians and the American public\nThe post State Of Disunion: Donald Trump’s Culture War Congressional Speech Protested By Demonstrative Democrats appeared first on Bossip.",
    "link": "http://bossip.com/2797536/donald-trumps-speech-to-congress-sparked-protest/",
    "timestamp": "2025-03-05T16:13:38Z"
  },
  {
    "title": "Now's The Time To Prepare For Daylight Saving Time Health Issues",
    "description": "Losing an hour of sleep as daylight saving time kicks in can do more than leave you tired and cranky the next day — it also could harm your health.",
    "link": "https://www.huffpost.com/entry/bc-med-be-well-daylight-saving-time-health_n_67c8763ee4b006fc455c1df9",
    "timestamp": "2025-03-05T16:13:37Z"
  },
  {
    "title": "CNN’s Elie Honig Calls Supreme Court Opinion Ordering Release of USAID Funds a ‘Substantial Setback’ for DOGE and Trump Admin",
    "description": "President Donald Trump and Elon Musk's efforts to drastically reshape the federal government took a hit at the Supreme Court Wednesday, when the nation's highest court rejected the Trump administration's request to continue to freeze about $2 billion in forei…",
    "link": "https://www.mediaite.com/news/cnns-elie-honig-calls-supreme-court-ruling-ordering-release-of-usaid-funds-a-substantial-setback-for-doge-and-trump-admin/",
    "timestamp": "2025-03-05T16:13:00Z"
  },
  {
    "title": "MSNBC's Nicolle Wallace Slammed for 'Politicizing' Child Cancer Survivor",
    "description": "Wallace's remarks have sparked widespread backlash around comments she made about DJ Daniel, the cancer survivor made an honorary Secret Service agent during Trump's speech.",
    "link": "https://www.newsweek.com/msnbcs-nicolle-wallace-slammed-politicizing-child-cancer-survivor-2039965",
    "timestamp": "2025-03-05T16:12:52Z"
  },
  {
    "title": "President Trump urges Congress to 'get rid of the CHIPS Act' which would impact Intel",
    "description": "SYRACUSE, N.Y. (WSYR-TV) — President Donald Trump called on lawmakers to repeal the CHIPS and Science Act during his March 4 address to Congress, possibly putting a target on the money already allocated for Micron’s $100 billion project in Central New York. “…",
    "link": "https://freerepublic.com/focus/f-chat/4302248/posts",
    "timestamp": "2025-03-05T16:11:55Z"
  },
  {
    "title": "Donald Trump's Deafening Silence on Medicaid",
    "description": "President Donald Trump made no mention of Medicaid during his lengthy address to Congress on Tuesday night, raising questions—despite prior assurances—about the administration's commitment to the government health care program amid proposed spending cuts.\nThe…",
    "link": "https://biztoc.com/x/c5345d8381ce843c",
    "timestamp": "2025-03-05T16:11:14Z"
  },
  {
    "title": "Trump’s Goal in Trade War Is to Annex Canada, Trudeau Says",
    "description": "US President Donald Trump’s objective is to destroy Canada’s economy so he can annex the country, Prime Minister Justin Trudeau said during a fiery news conference about the start of a trade war between the countries.\nTrump put the tariffs in place on Tuesday…",
    "link": "https://biztoc.com/x/127ac0a59b1ad6cc",
    "timestamp": "2025-03-05T16:10:34Z"
  },
  {
    "title": "DJ Daniel,13-year-old brain cancer survivor, thanks Trump for surprise honor during speech to Congress",
    "description": "DJ Daniel, a cancer survivor and aspiring police officer, reacted to President Trump bestowing him with the title of a Secret Service agent during Tuesday's joint address to Congress.",
    "link": "https://www.foxnews.com/media/dj-daniel-13-year-old-brain-cancer-survivor-thanks-trump-surprise-honor-during-speech-congress",
    "timestamp": "2025-03-05T16:08:42Z"
  },
  {
    "title": "EU ‘rearmament’ plan has no funding – Euractiv",
    "description": "EU chief Ursula von der Leyen’s proposal for EU nations to spend about $840 billion on defense is unrealistic, according to media Read Full Article at RT.com",
    "link": "https://www.rt.com/news/613758-eu-rearmament-plan-problems/",
    "timestamp": "2025-03-05T16:08:38Z"
  },
  {
    "title": "Donald Trump's Deafening Silence on Medicaid",
    "description": "The president did not mention the health care program during his speech to Congress, amid fears it will be victim to GOP spending cuts.",
    "link": "https://www.newsweek.com/donald-trump-medicaid-cuts-gop-republicans-congress-speech-2039883",
    "timestamp": "2025-03-05T16:08:05Z"
  },
  {
    "title": "‘Sticking needles in my eyeballs’: Some Democrats couldn’t sit through Trump’s speech",
    "description": "House Minority Leader Hakeem Jeffries wanted a “solemn” response to President Donald Trump’s congressional address Tuesday. His members had other ideas. Moments after Trump began speaking, Texas Rep. Al Green rose and interrupted the president until he was ej…",
    "link": "https://freerepublic.com/focus/f-news/4302243/posts",
    "timestamp": "2025-03-05T16:08:03Z"
  },
  {
    "title": "U.S. stock market today: Market rebounds; S&P 500, Dow, Nasdaq recover as tariff relief hopes lift stocks – Will market stability continue?",
    "description": "U.S. stock market rebounded on March 5, 2025, as hopes for tariff relief under President Donald Trump lifted investor confidence. The S&P 500, Dow, and Nasdaq gained after a sharp sell-off, but weak jobs data raised concerns about an economic slowdown. The AD…",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-stock-market-rebound-sp500-dow-nasdaq-tariff-relief-market-stability/articleshow/118737860.cms",
    "timestamp": "2025-03-05T16:07:48Z"
  },
  {
    "title": "Trudeau not willing to lift Canada's retaliatory tariffs if Trump leaves some tariffs on Canada",
    "description": "Canadian Prime Minister Justin Trudeau is unwilling to lift Canada’s retaliatory tariffs on the United States if President Donald Trump leaves any U.S...",
    "link": "https://www.yahoo.com/news/trudeau-not-willing-lift-canadas-160719236.html",
    "timestamp": "2025-03-05T16:07:19Z"
  },
  {
    "title": "Vance heads to southern border as Trump touts sharp drop in crossings: 'They heard my words'",
    "description": "Vice President JD Vance is on his way to the U.S. southern border as the Trump administration oversees a sharp drop in encounters of illegal immigrants.",
    "link": "https://www.foxnews.com/politics/vance-heads-southern-border-trump-touts-sharp-drop-crossings-they-heard-my-words",
    "timestamp": "2025-03-05T16:05:54Z"
  },
  {
    "title": "Elon Musk Suggests Removing Zelensky to Another Country",
    "description": "X users have pushed back against Elon Musk's comment that Ukrainian President Volodymyr Zelensky should be offered amnesty abroad.",
    "link": "https://www.newsweek.com/elon-musk-zelensky-amnesty-remove-ukraine-2039875",
    "timestamp": "2025-03-05T16:05:52Z"
  },
  {
    "title": "XRP price surges amid crypto market pressure, but trade war fears loom",
    "description": "XRP rose 1.8 percent to $2.52 on Wednesday but its value is 35 percent below the cryptocurrency’s all-time high. The coin spiked briefly when Donald Trump tweeted that it would be included in a strategic reserve of crypto assets but then slumped as US tariffs…",
    "link": "https://economictimes.indiatimes.com/news/international/us/xrp-price-surges-amid-crypto-market-pressure-but-trade-war-fears-loom/articleshow/118740163.cms",
    "timestamp": "2025-03-05T16:05:51Z"
  },
  {
    "title": "Trump’s cut to Ukrainian military aid could leave millions of civilians exposed to Russian ballistic missiles | CNN",
    "description": "Ukraine has only one way to protect itself against Russia’s most powerful ballistic missiles – US-made Patriot defense systems. With the United States now pausing military shipments to Kyiv, they could soon run out of ammo.",
    "link": "https://www.cnn.com/2025/03/05/world/trump-cut-ukrainian-aid-patriot-missiles-intl/index.html",
    "timestamp": "2025-03-05T16:05:00Z"
  },
  {
    "title": "Trump’s Return Prompts Companies to Stifle Climate Talk With ‘Greenhushing’",
    "description": "As the chief executive officer of Caelux, Scott Graybeal runs a technology startup in Baldwin Park, California, that makes high-efficiency glass for solar panels. For years, climate change had been a crucial part of Graybeal’s business conversations — until D…",
    "link": "https://www.insurancejournal.com/news/national/2025/03/05/814185.htm",
    "timestamp": "2025-03-05T16:04:12Z"
  },
  {
    "title": "How the West uses Russia's frozen reserves to help Ukraine",
    "description": "European nations, looking into appropriating $300 billion of frozen Russian state assets accumulated following the 2022 invasion of Ukraine, are considering full confiscation and using funds for Ukraine's reconstruction. The ECB and other reluctant countries …",
    "link": "https://economictimes.indiatimes.com/news/defence/how-the-west-uses-russias-frozen-reserves-to-help-ukraine/articleshow/118740156.cms",
    "timestamp": "2025-03-05T16:04:11Z"
  },
  {
    "title": "The D Brief: Trump’s speech; DOD firings begin; Intel-sharing, paused; Court scuttles foreign-aid freeze; And a bit more.",
    "description": "",
    "link": "https://www.defenseone.com/threats/2025/03/the-d-brief-march-05-2025/403487/",
    "timestamp": "2025-03-05T16:03:30Z"
  },
  {
    "title": "Is It Fine To Pay Millions Of Dollars To Have Dinner With President Donald Trump? Is That Good?",
    "description": "Don't worry, the money's going to his 'library.'",
    "link": "https://www.wonkette.com/p/is-it-fine-to-pay-millions-of-dollars",
    "timestamp": "2025-03-05T16:03:20Z"
  },
  {
    "title": "'What is your plan?' Chuck Schumer cornered on MSNBC over failure to confront Trump",
    "description": "During an appearance on MSNBC's \"Morning Joe\" on Wednesday morning, Senate Minority Leader Chuck Schumer (D-NY) was called out by co-host Joe Scarborough over criticism from his fellow Democrats that he and House Minority Leader Hakeem Jeffries (D-NY) are fai…",
    "link": "https://www.rawstory.com/schumer-trump-plan-msnbc/",
    "timestamp": "2025-03-05T16:03:15Z"
  },
  {
    "title": "Mayors from 'sanctuary cities' testify before Congress",
    "description": "The Mayors of Boston, Chicago, Denver and New York City are testifying in front of the House Oversight Committee during a blockbuster hearing on sanctuary cities",
    "link": "https://abcnews.go.com/Politics/mayors-sanctuary-cities-testify-congress/story?id=119472549",
    "timestamp": "2025-03-05T16:03:05Z"
  },
  {
    "title": "Ethereum Classic [ETC] rejects key demand zone – Is a short squeeze next?",
    "description": "ETC is sparking reversal signals with its prices accumulating a bullish momentum after retesting a key demand zone.",
    "link": "https://ambcrypto.com/ethereum-classic-etc-rejects-key-demand-zone-is-a-short-squeeze-next/",
    "timestamp": "2025-03-05T16:00:34Z"
  },
  {
    "title": "Europe’s Decline Was a Choice",
    "description": "Donald Tusk, the prime minister of Poland, might not shock Europe’s leaders the way President Donald Trump does, but he too has a tough message... Read More\nThe post Europe’s Decline Was a Choice appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/03/05/europe-decline-was-a-choice/",
    "timestamp": "2025-03-05T16:00:00Z"
  },
  {
    "title": "CFPB drops Zelle lawsuit in latest reversal under Trump administration",
    "description": "The Consumer Financial Protection Bureau has dropped its lawsuit over peer-to-peer payment system Zelle, the latest in a series of dismissals from this department under President Donald Trump's administration. The agency had only just announced the suit — fil…",
    "link": "https://biztoc.com/x/647e971ab3191c6b",
    "timestamp": "2025-03-05T15:59:24Z"
  },
  {
    "title": "When it comes to Social Security ‘fraud,’ Trump will have to put up or shut up",
    "description": "Brett Arends's ROI\nOpinion: When it comes to Social Security ‘fraud,’ Trump will have to put up or shut up\n20 million fake numbers? Show us the money.\nOK, MAGA Nation. Let’s say for the sake of argument that President Donald Trump was telling the truth about …",
    "link": "https://biztoc.com/x/d9e6ec6cb61f18aa",
    "timestamp": "2025-03-05T15:59:22Z"
  },
  {
    "title": "US Supreme Court rejects Trump’s effort to keep US aid frozen",
    "description": "Donald Trump was dealt the first major legal blow of his second term on Wednesday as the US Supreme Court denied his efforts to keep US foreign aid frozen.\nIn a 5-4 ruling, two of the court's conservative judges joined their three liberal colleagues, upholdin…",
    "link": "https://biztoc.com/x/28b2220b02d10b0d",
    "timestamp": "2025-03-05T15:59:13Z"
  },
  {
    "title": "Israeli defense companies are gaining as Europe rushes to arms race",
    "description": "Outgoing German Chancellor Olaf Scholz was relegated to the third row. Military power is the name of the game now.",
    "link": "https://www.jpost.com/business-and-innovation/all-news/article-844841",
    "timestamp": "2025-03-05T15:58:59Z"
  },
  {
    "title": "Trump’s Tour of Revenge Against the American People",
    "description": "Building on his walk-and-talk video from a couple of days ago, Jamelle Bouie writes about two of the easiest things to understand",
    "link": "https://kottke.org/25/03/trumps-tour-of-revenge-against-the-american-people",
    "timestamp": "2025-03-05T15:58:40Z"
  },
  {
    "title": "EU leaders to hold emergency Ukraine talks, seeking to adapt to new security demands without the US",
    "description": "European Union leaders plan to hold emergency talks to agree ways to quickly increase their military budgets after the Trump administration signaled Europe must take care of its own security and also suspended assistance to Ukraine",
    "link": "https://abcnews.go.com/International/wireStory/eu-leaders-hold-emergency-ukraine-talks-seeking-adapt-119477946",
    "timestamp": "2025-03-05T15:58:14Z"
  },
  {
    "title": "Can the Arab world’s $53 billion plan for Gaza succeed?",
    "description": "Arab states unveiled a $53 billion Gaza plan - but the US, Israel, and Hamas remain unconvinced.",
    "link": "https://www.jpost.com/middle-east/article-844840",
    "timestamp": "2025-03-05T15:57:58Z"
  },
  {
    "title": "Trump Touts 'Important Letter' From Zelenskyy After Oval Office Clash",
    "description": "Trump has adopted a tough stance toward Kyiv, announcing a freeze on U.S. aid for Ukraine just days after accusing Zelenskyy of “gambling with World War III.”",
    "link": "https://www.huffpost.com/entry/trump-zelenskyy-letter-speech_n_67c856a7e4b04c15d93069bf",
    "timestamp": "2025-03-05T15:57:20Z"
  },
  {
    "title": "Why Trump means good times for Europe’s arms-makers",
    "description": "Much of Europe is anxious about Donald Trump’s return to the White House, but there’s little to suggest the continent’s arms manufacturers expect a crisis. Europe is seeing a dramatic boost in defense budgets, driven by both long-standing pressure from Washin…",
    "link": "https://freerepublic.com/focus/f-news/4302240/posts",
    "timestamp": "2025-03-05T15:57:15Z"
  },
  {
    "title": "CIA Director Reveals U.S. Has Cut Off Intelligence Support to Ukraine After Trump-Zelensky Clash",
    "description": "CIA Director John Ratcliffe revealed that the Trump administration has halted intelligence support as part of its decision to withhold military aid to Ukraine following last week’s Oval Office confrontation between President Donald Trump and Ukrainian Preside…",
    "link": "https://www.mediaite.com/tv/cia-director-reveals-u-s-has-cut-off-intelligence-support-to-ukraine-after-trump-zelensky-clash/",
    "timestamp": "2025-03-05T15:57:02Z"
  }
]