[
  {
    "title": "Donald Trump’s Attack On Pete Buttigieg Cracks Up Critics",
    "description": "The president also complimented Sean Duffy, Buttigieg’s successor as transportation secretary, by boasting about his ability to climb trees.",
    "link": "https://www.huffpost.com/entry/donald-trump-bicycle-pete-buttigieg_n_6825dde3e4b0da44a3e0d69d",
    "timestamp": "2025-05-15T14:38:11Z"
  },
  {
    "title": "US retail sales little changed, signs of pullback after pre-tariff rush",
    "description": "US retail sales saw minimal growth in April, according to government data. Consumer spending appears to be slowing down. This follows a surge in purchases in March, ahead of President Donald Trump's tariffs. Experts suggest consumers are pulling back after an…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/us-retail-sales-little-changed-signs-of-pullback-after-pre-tariff-rush/articleshow/121192089.cms",
    "timestamp": "2025-05-15T14:37:55Z"
  },
  {
    "title": "Supreme Court takes on birthright citizenship: Liberals balk at Trump argument to end nationwide injunctions",
    "description": "Supreme Court Justices are weighing three challenges to Trump’s birthright citizenship order – a case that could quickly reshape how lower courts handle similar disputes.",
    "link": "https://www.foxnews.com/politics/supreme-court-trump-birthright-citizenship-order-injunctions",
    "timestamp": "2025-05-15T14:37:53Z"
  },
  {
    "title": "US Supreme Court weighs judicial checks on Trump with birthright case",
    "description": "The US Supreme Court was hearing a case Thursday that could sharply curb the judiciary’s ability to rein in Donald Trump and future American presidents. The case before the top court involves the Republican leader’s bid to end automatic citizenship for childr…",
    "link": "https://www.digitaljournal.com/world/us-supreme-court-weighs-judicial-checks-on-trump-with-birthright-case/article",
    "timestamp": "2025-05-15T14:37:20Z"
  },
  {
    "title": "Binyamin Netanyahu reduced to spectator as Donald Trump tours Middle East",
    "description": "US president bypasses Israel as he eyes Gulf billions, meets Syrian leader and pursues detente with Iran",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/15/binyamin-netanyahu-reduced-to-spectator-as-donald-trump-tours-middle-east/",
    "timestamp": "2025-05-15T14:34:54Z"
  },
  {
    "title": "‘So Performative’: Yale Professors Brutally Mocked for Self-Deporting From U.S. Over ‘Fascism’ Fears",
    "description": "Three Yale professors were roasted on social media after they collectively declared they are leaving the United States over their fascism fears.\nThe post ‘So Performative’: Yale Professors Brutally Mocked for Self-Deporting From U.S. Over ‘Fascism’ Fears firs…",
    "link": "https://www.mediaite.com/politics/so-performative-yale-professors-brutally-mocked-for-self-deporting-from-u-s-over-fascism-fears/",
    "timestamp": "2025-05-15T14:33:39Z"
  },
  {
    "title": "Trump throws Apple tantrum: Should India worry?",
    "description": "Amid trade tensions, Trump has reportedly told Apple CEO Tim Cook he prefers the company manufacture in the US, not India, despite Apple's plans to diversify iPhone production there. This comes as the US and China strike a trade deal, potentially reducing the…",
    "link": "https://economictimes.indiatimes.com/industry/cons-products/electronics/trump-throws-apple-tantrum-should-india-worry/articleshow/121191968.cms",
    "timestamp": "2025-05-15T14:33:16Z"
  },
  {
    "title": "Trump tells Apple’s CEO to stop expanding iPhone production in India - TechCrunch",
    "description": "Trump tells Apple’s CEO to stop expanding iPhone production in IndiaTechCrunch Trump says he doesn't want Apple building products in India: 'I had a little problem with Tim Cook'CNBC India has offered US 'no tariffs' on American goods in trade deal offer, Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=177525959",
    "timestamp": "2025-05-15T14:32:38Z"
  },
  {
    "title": "US retail sales little changed, signs of pullback after pre-tariff rush",
    "description": "Retail sales in the United States were near-flat in April, government data showed Thursday, with indications that spending is slowing after consumers rushed to beat higher prices from President Donald Trump’s sweeping tariffs. Overall sales nudged up 0.1 perc…",
    "link": "https://www.digitaljournal.com/world/us-retail-sales-little-changed-signs-of-pullback-after-pre-tariff-rush/article",
    "timestamp": "2025-05-15T14:32:32Z"
  },
  {
    "title": "Trump and Putin Sit Out Istanbul Talks, Dimming Hopes For Ukraine Breakthrough",
    "description": "Donald Trump on Wednesday said meaningful progress in ending the war in Ukraine is unlikely until he meets face-to-face with Russian President Vladimir Putin, as both leaders confirmed they will skip the first direct Russia-Ukraine peace talks in three years …",
    "link": "https://biztoc.com/x/b5c77abcb9dc7ccd",
    "timestamp": "2025-05-15T14:31:40Z"
  },
  {
    "title": "LABASH: The Ben Shapiro 'Honesty' Hustle...",
    "description": "LABASH: The Ben Shapiro 'Honesty' Hustle...\r\n\n \n \n \n (Second column, 1st story, link)\r\n\n \r\n\n \r\n\n \n \n Drudge Report Feed needs your support!   Become a Patron",
    "link": "https://mattlabash.substack.com/p/the-ben-shapiro-honesty-hustle",
    "timestamp": "2025-05-15T14:31:37Z"
  },
  {
    "title": "South Africa says Trump's aid cuts stripped more than 8,000 health workers from its HIV program",
    "description": "The Trump administration’s dismantling of USAID has put more than 8,000 health workers in South Africa’s national HIV program out of work",
    "link": "https://abcnews.go.com/International/wireStory/south-africa-trumps-aid-cuts-stripped-8000-health-121836936",
    "timestamp": "2025-05-15T14:30:56Z"
  },
  {
    "title": "Older people in crosshairs as government restarts Social Security garnishment on student loans",
    "description": "As the Trump administration resumes collections on defaulted student loans, hundreds of thousands of older Americans with decades-old debts are now at risk of having their Social Security checks garnished",
    "link": "https://abcnews.go.com/US/wireStory/older-people-crosshairs-government-restarts-social-security-garnishment-121826943",
    "timestamp": "2025-05-15T14:30:29Z"
  },
  {
    "title": "US Retail Sales Little Changed, Signs Of Pullback After Pre-tariff Rush",
    "description": "Retail sales in the United States were near-flat in April, government data showed Thursday, with indications that spending is slowing after consumers rushed to beat higher prices from President Donald Trump's sweeping tariffs.",
    "link": "https://www.ibtimes.com/us-retail-sales-little-changed-signs-pullback-after-pre-tariff-rush-3773664",
    "timestamp": "2025-05-15T14:30:23Z"
  },
  {
    "title": "Ukraine's Zelenskyy says he is sending a delegation to Istanbul for peace talks with Russia",
    "description": "Ukrainian President Volodymyr Zelenskyy says he will send a team headed by his defense minister to Istanbul for peace talks with a Russian delegation",
    "link": "https://abcnews.go.com/International/wireStory/ukraines-zelenskyy-sending-delegation-istanbul-peace-talks-russia-121826085",
    "timestamp": "2025-05-15T14:30:18Z"
  },
  {
    "title": "Israeli airstrikes target southern Gaza; Pope meets with Sinner | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://richmond.com/news/nation-world/article_ffa2727c-8c80-52c3-9910-6a73f80ef8ea.html",
    "timestamp": "2025-05-15T14:30:00Z"
  },
  {
    "title": "Israeli airstrikes target southern Gaza; Pope meets with Sinner | Hot off the Wire podcast",
    "description": " Get the latest national, international, sports and entertainment news on our daily podcast.",
    "link": "https://roanoke.com/news/nation-world/article_4268ee4e-b008-5684-bda4-c72962ff945d.html",
    "timestamp": "2025-05-15T14:30:00Z"
  },
  {
    "title": "Democratic voters slam their own party as 'inept' and 'useless' in NY Times opinion interview",
    "description": "Democratic voters voiced frustrations about their own party in an interview with NY Times opinion, criticizing the party's leadership and tactics in opposing President Donald Trump.",
    "link": "https://www.foxnews.com/media/democratic-voters-slam-own-party-inept-useless-ny-times-opinion-interview",
    "timestamp": "2025-05-15T14:29:00Z"
  },
  {
    "title": "Telsa chair, Robyn Denholm, sold stock worth $230 million as company profits plunged",
    "description": "The chair of Tesla sold more than $230 million of company stock since Elon Musk’s endorsement of Donald Trump triggered boycotts and protests against his cars.",
    "link": "https://nypost.com/2025/05/15/business/telsa-chair-sold-stock-worth-230-million-as-profits-plunged/",
    "timestamp": "2025-05-15T14:28:33Z"
  },
  {
    "title": "Trump is pitching a new supercharged twin-engine F-35 with a new name: F-55",
    "description": "The CEO of Lockheed Martin, which makes the F-35, said recently that he wants to upgrade the jet to become a \"fifth-generation plus\" aircraft.",
    "link": "https://www.businessinsider.com/trump-pitches-supercharged-twin-engine-f-35-f-55-2025-5",
    "timestamp": "2025-05-15T14:27:45Z"
  },
  {
    "title": "Zelensky after Erdoğan talks: ‘No real negotiators’ on Russian side",
    "description": "Ukrainian President Volodymyr Zelensky said Thursday that Kiev is committed to pursuing peace, but expressed frustration over the lack of high-level Russian representatives willing to engage in serious negotiations.",
    "link": "https://www.hurriyetdailynews.com/zelensky-after-erdogan-talks-no-real-negotiators-on-russian-side-209231",
    "timestamp": "2025-05-15T14:26:01Z"
  },
  {
    "title": "US manufacturing output falls in April on weak auto production",
    "description": "U.S. manufacturing production experienced an unexpected decline of 0.4% in April, primarily driven by a sharp decrease in motor vehicle output, according to the Federal Reserve. This downturn raises concerns about the sector's ability to maintain its growth m…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-manufacturing-output-falls-in-april-on-weak-auto-production/articleshow/121191930.cms",
    "timestamp": "2025-05-15T14:25:51Z"
  },
  {
    "title": "'Apple Will Realise...: Sources On Trump's 'Not In India' Call To Tim Cook",
    "description": "Donald Trump&#039;s &#039;don&#039;t want you building in India&#039; exhortation to Apple boss Tim Cook was played down Thursday night, with government sources telling NDTV Profit there is significant value for the global tech giant in India.",
    "link": "https://www.ndtv.com/india-news/apple-india-iphone-production-news-donald-trump-tim-cook-dont-want-you-building-in-india-apple-response-india-sources-8422994",
    "timestamp": "2025-05-15T14:24:45Z"
  },
  {
    "title": "Movement Labs Secretly Promised Advisers Millions in Tokens, Leaked Documents Show",
    "description": "Signed memos reveal that Movement Labs, a Trump-backed crypto startup, offered up to 10% of its token supply to shadow advisers through undisclosed agreements.",
    "link": "https://www.coindesk.com/tech/2025/05/15/movement-labs-secretly-promised-advisers-millions-in-tokens-leaked-documents-show",
    "timestamp": "2025-05-15T14:24:42Z"
  },
  {
    "title": "What have US President Donald Trump’s tariff policies achieved?",
    "description": "Trump's policies have roiled global markets and left businesses stumped on how to plan for the foreseeable future.",
    "link": "https://www.aljazeera.com/economy/2025/5/15/what-have-us-president-donald-trumps-tariff-policies-achieved",
    "timestamp": "2025-05-15T14:22:52Z"
  },
  {
    "title": "Walmart says it will raise prices thanks to Trump’s tariffs",
    "description": "\"We will do our best to keep our prices as low as possible,\" said Walmart CEO Doug McMillon.",
    "link": "https://www.mlive.com/news/2025/05/walmart-says-it-will-raise-prices-thanks-to-trumps-tariffs.html",
    "timestamp": "2025-05-15T14:22:34Z"
  },
  {
    "title": "The Latest: Supreme Court hears arguments in case over Trump’s birthright citizenship order",
    "description": "The Supreme Court is hearing its first set of Trump-related arguments in the second Trump presidency",
    "link": "https://abcnews.go.com/US/wireStory/latest-supreme-court-hears-arguments-case-trumps-birthright-121836514",
    "timestamp": "2025-05-15T14:22:31Z"
  },
  {
    "title": "Cognitive Decline? Trump Goes on Rant About Ugly Military Planes",
    "description": "Early Thursday morning, Donald Trump took aim at how ugly he thinks some military planes look. \r\nSpeaking in Doha, Qatar, the president went off on one of his signature tangents at a press conference, ranting about how much he doesn’t like the way stealth air…",
    "link": "https://newrepublic.com/post/195288/trump-rant-ugly-stealth-military-planes",
    "timestamp": "2025-05-15T14:21:52Z"
  },
  {
    "title": "Birthright Citizenship Back Before Supreme Court As Trump Calls It Outdated",
    "description": "President Donald Trump weighed in Tuesday on the upcoming Supreme Court case on birthright citizenship, arguing that the 14th Amendment was never intended to apply to the children of undocumented immigrants or foreign nationals visiting the U.S. \nIn a lengthy…",
    "link": "https://biztoc.com/x/894196103a7364ca",
    "timestamp": "2025-05-15T14:20:24Z"
  },
  {
    "title": "India and Pakistan trade accusations of nuclear weapons mismanagement",
    "description": "Islamabad hits back after Indian defence minister says Pakistan's nuclear arsenal should be under UN surveillance.",
    "link": "https://www.aljazeera.com/news/2025/5/15/india-and-pakistan-trade-accusations-of-nuclear-weapons-mismanagement",
    "timestamp": "2025-05-15T14:20:19Z"
  },
  {
    "title": "‘Morning Joe’ Panelist Says Trump Could Be ‘Proved Right’ On Birthright Citizenship Issue",
    "description": "Former U.S. attorney Chuck Rosenberg said that President Donald Trump could be \"proved right\" on birthright citizenship by the Supreme Court.",
    "link": "https://dailycaller.com/2025/05/15/morning-joe-chuck-rosenberg-trump-birthright-citizenship/",
    "timestamp": "2025-05-15T14:19:35Z"
  },
  {
    "title": "US President Donald Trump Asks Apple to Stop Moving iPhone Production to India",
    "description": "US President Donald Trump has asked Apple CEO Tim Cook to stop building plants in India to make iPhones for the US. Trump’s comments threaten to throw a wrench into Apple’s plan to import most of the iPhones it sells in the US from India by the end of next ye…",
    "link": "https://www.gadgets360.com/mobiles/news/donald-trump-apple-tim-cook-stop-iphone-production-india-8422935",
    "timestamp": "2025-05-15T14:19:32Z"
  },
  {
    "title": "The Ben Shapiro ‘Honesty’ Hustle",
    "description": "How could a God-fearing winger with a healthy respect for our founders and the Constitution still support a guy who has now said he’s not sure if it’s his duty to uphold the Constitution?\nThe post The Ben Shapiro ‘Honesty’ Hustle first appeared on Mediaite.",
    "link": "https://www.mediaite.com/opinion/the-ben-shapiro-honesty-hustle/",
    "timestamp": "2025-05-15T14:19:30Z"
  },
  {
    "title": "Potential US semiconductor manufacturing boom complicated by Trump's economic policies",
    "description": "Before ‘America First’ became the Trump administration’s mandate for foreign policy and trade, one sector was already working to bring business back to the United States: the semiconductor industry",
    "link": "https://abcnews.go.com/US/wireStory/potential-us-semiconductor-manufacturing-boom-complicated-trumps-economic-121836208",
    "timestamp": "2025-05-15T14:19:14Z"
  },
  {
    "title": "Russia uncertain whether Ukraine's delegation plans to attend Istanbul talks",
    "description": "A Russian delegation arrived in Istanbul and is waiting for their Ukrainian counterparts to come, Kremlin spokesman Dmitry Peskov said Thursday.",
    "link": "https://www.hurriyetdailynews.com/russia-uncertain-whether-ukraines-delegation-plans-to-attend-istanbul-talks-209230",
    "timestamp": "2025-05-15T14:18:55Z"
  },
  {
    "title": "Trump wants Apple to stop making more iPhones in India",
    "description": "President Donald Trump told Apple CEO Tim Cook that he doesn’t want the company to move iPhone production to India. “I had a little problem with Tim Cook yesterday,” Trump said during his visit to Qatar. “You’re coming in with $500 billion, but now I hear you…",
    "link": "https://www.theverge.com/news/667649/donald-trump-apple-stop-producing-iphones-india",
    "timestamp": "2025-05-15T14:18:30Z"
  },
  {
    "title": "Fox News ‘Antisemitism Exposed’ Newsletter: American hostage held by Hamas freed after 584 days",
    "description": "Fox News' \"Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.",
    "link": "https://www.foxnews.com/us/fox-news-antisemitism-exposed-newsletter-american-hostage-held-hamas-freed-after-584-days",
    "timestamp": "2025-05-15T14:18:25Z"
  },
  {
    "title": "NATO on track to strike spending deal to please Trump",
    "description": "NATO appears headed for a compromise deal at a summit next month to satisfy US President Donald Trump’s demand to spend five percent of GDP on defence, as heavyweights Germany and France got on board Thursday. To make the volatile US leader happy, NATO chief …",
    "link": "https://www.digitaljournal.com/world/nato-on-track-to-strike-spending-deal-to-please-trump/article",
    "timestamp": "2025-05-15T14:17:20Z"
  },
  {
    "title": "Slovenia probes disappearance of latest Melania Trump statue",
    "description": "The first Melania Trump statue in her native Slovenia was destroyed by fire and now its bronze replacement has gone missing, prompting a police investigation. The life-sized bronze of the US first lady was unveiled near her hometown of Sevnica in 2020, toweri…",
    "link": "https://www.digitaljournal.com/world/slovenia-probes-disappearance-of-latest-melania-trump-statue/article",
    "timestamp": "2025-05-15T14:17:20Z"
  },
  {
    "title": "Trump Calls U.S. “STUPID” in Wild Anti-Birthright Citizenship Rant",
    "description": "Donald Trump went off the rails in a hateful rant Thursday as the Supreme Court prepared to hear arguments over his blatantly unconstitutional executive order ending birthright citizenship. \r\n“Birthright Citizenship was not meant for people taking vacations t…",
    "link": "https://newrepublic.com/post/195292/donald-trump-rant-birthright-citizenship-supreme-court",
    "timestamp": "2025-05-15T14:16:14Z"
  },
  {
    "title": "Bridgewater’s billionaire founder Ray Dalio to open office in Saudi Arabia: sources",
    "description": "The top firm will open up a base later this year in the Gulf kingdom, senior sources close to the Saudi government said.",
    "link": "https://nypost.com/2025/05/15/business/bridgewater-founder-ray-dalio-to-open-office-in-saudi-arabia-sources/",
    "timestamp": "2025-05-15T14:16:00Z"
  },
  {
    "title": "Another one of Elon Musk's companies is coming to the Gulf",
    "description": "Elon Musk's brain-chip company Neuralink is starting its first international clinical trial in the UAE.",
    "link": "https://www.businessinsider.com/elon-musk-companies-neuralink-uae-starlink-saudi-arabia-2025-5",
    "timestamp": "2025-05-15T14:15:44Z"
  },
  {
    "title": "Judicial Coup Exposed: New Bill Proposed to Answer Courts’ War on Trump and America",
    "description": "A bold legislative proposal, the “Restoring Constitutional Mandate for Congress to Set Rules for the Federal Courts Act,” seeks to rein in what its author warns is an existential crisis – a  “judicial coup” targeting President Donald Trump and the American pe…",
    "link": "https://www.thegatewaypundit.com/2025/05/judicial-coup-exposed-new-bill-proposed-answer-courts/",
    "timestamp": "2025-05-15T14:15:33Z"
  },
  {
    "title": "NATO On Track To Strike Spending Deal To Please Trump",
    "description": "NATO appears headed for a compromise deal at a summit next month to satisfy US President Donald Trump's demand to spend five percent of GDP on defence, as heavyweights Germany and France got on board Thursday.",
    "link": "https://www.ibtimes.com/nato-track-strike-spending-deal-please-trump-3773661",
    "timestamp": "2025-05-15T14:15:23Z"
  },
  {
    "title": "Wintermute opens New York office, citing improved US crypto rules",
    "description": "Wintermute, a London-based algorithmic crypto trading and market-making firm, has opened an office in New York as part of its expansion into the US.Wintermute announced the opening of its New York office on May 15, citing improved regulatory conditions in the…",
    "link": "https://cointelegraph.com/news/wintermute-new-york-office-improved-us-crypto-regulations",
    "timestamp": "2025-05-15T14:15:16Z"
  },
  {
    "title": "Trump admin pressured African nations to win contracts for Elon Musk",
    "description": "In early February, Sharon Cromer, U.S. ambassador to Gambia, went to visit one of the country’s Cabinet ministers at his agency’s headquarters, above a partially abandoned strip mall off a dirt road. It had been two weeks since President Donald Trump took off…",
    "link": "https://www.rawstory.com/trump-musk-starlink/",
    "timestamp": "2025-05-15T14:12:57Z"
  },
  {
    "title": "Walmart Warns It May Have to Raise Prices Starting This Month as Tariffs Are ‘Still Too High’",
    "description": "The news comes as U.S. consumers are already dealing with concerns over the cost of groceries.",
    "link": "https://time.com/7285637/walmart-raising-prices-us-tariffs-consumer-impact/",
    "timestamp": "2025-05-15T14:12:54Z"
  },
  {
    "title": "Bruce Springsteen says Trump is ‘unfit’ and ‘incompetent’ in remarks during UK show | CNN",
    "description": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader “unfit” for office.",
    "link": "https://www.cnn.com/2025/05/15/entertainment/bruce-springsteen-trump-criticism-scli-intl",
    "timestamp": "2025-05-15T14:12:32Z"
  },
  {
    "title": "US issues sanctions targeting Iran-backed Hezbollah, Treasury website shows",
    "description": "Treasury said overseas donations make up a significant portion of the group's budget.",
    "link": "https://www.jpost.com/breaking-news/article-854142",
    "timestamp": "2025-05-15T14:12:23Z"
  },
  {
    "title": "Not every US president gets a free private jet, but the Gulf states have boosted US economic dominance for decades",
    "description": "Oil money from the Middle East often goes straight to the US.",
    "link": "https://theconversation.com/not-every-us-president-gets-a-free-private-jet-but-the-gulf-states-have-boosted-us-economic-dominance-for-decades-256655",
    "timestamp": "2025-05-15T14:11:48Z"
  },
  {
    "title": "Israeli military strikes kill dozens in Gaza as Trump visits region",
    "description": "Most of the victims, including women and children,  killed in Khan Younis in air strikes that hit homes and tents, say medics",
    "link": "https://www.irishtimes.com/world/middle-east/2025/05/15/israeli-military-strikes-kill-dozens-in-gaza-as-trump-visits-region/",
    "timestamp": "2025-05-15T14:10:48Z"
  },
  {
    "title": "Potential US semiconductor manufacturing boom complicated by Trump's economic policies",
    "description": "Before ‘America First’ became the Trump administration’s mandate for foreign policy and trade, one sector was already working to bring business back to the United States: the semiconductor industry. Aided by government incentives, American and foreign tech co…",
    "link": "https://www.seattlepi.com/news/politics/article/potential-us-semiconductor-manufacturing-boom-20328917.php",
    "timestamp": "2025-05-15T14:10:04Z"
  },
  {
    "title": "Don Jr.'s Axel to Grind (Oliver Darcy/Status)",
    "description": "Oliver Darcy / Status:\nDon Jr.'s Axel to Grind  —  An unflattering story about Donald Trump Jr. triggered a White House assault on Business Insider and parent company Axel Springer—and signaled just how far Trumpworld is willing to go to silence critical cove…",
    "link": "https://www.memeorandum.com/250515/p41",
    "timestamp": "2025-05-15T14:10:01Z"
  },
  {
    "title": "Trump’s Critics and Supporters Unite Against Plane Deal",
    "description": "\"In his eagerness to accept a plane from Qatar, Donald Trump has achieved a remarkable feat, uniting many partisans across America's bitter political divide. The problem for the White House is that unity is happening",
    "link": "https://politicalwire.com/2025/05/15/trumps-critics-and-supporters-unite-against-plane-deal/",
    "timestamp": "2025-05-15T14:09:54Z"
  },
  {
    "title": "Russian State TV Launches Patriotic Kids Show Featuring Toddler Trump",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nKremlin propagandist Vladimir Solovyov is launching a children's show featuring animated toddler versions of world leaders—including President Donald Trump and North Korean leader Kim Jong Un—which he claims w…",
    "link": "https://biztoc.com/x/11986ee2e9c6b5f0",
    "timestamp": "2025-05-15T14:09:45Z"
  },
  {
    "title": "Walmart says it will raise prices due to tariff costs after posting solid first quarter sales",
    "description": "Walmart, which became the nation’s largest retailer by making low prices a priority, has found itself in a place it’s rarely been: Warning customers that prices will rise for goods ranging from bananas to car seats.",
    "link": "https://www.news4jax.com/business/2025/05/15/walmart-says-it-will-raise-prices-due-to-tariff-costs-after-posting-solid-first-quarter-sales/",
    "timestamp": "2025-05-15T14:08:19Z"
  },
  {
    "title": "US Stocks Slump as Big Tech, Walmart Slide After Torrid Rally",
    "description": "US stocks were on pace to snap a three-day winning streak Thursday, driven by declines in technology, energy and retailers as traders assessed a slew of mixed economic figures.",
    "link": "https://financialpost.com/pmn/business-pmn/us-stocks-slump-as-big-tech-walmart-slide-after-torrid-rally",
    "timestamp": "2025-05-15T14:07:46Z"
  },
  {
    "title": "Rutte says NATO allies ready for big jump in defence spending commitments",
    "description": "At a gathering in Turkey, NATO Secretary General Mark Rutte said there's support to dramatically increase military spending across the alliance.",
    "link": "https://www.euractiv.com/section/defence/news/rutte-says-nato-allies-ready-for-big-jump-in-defence-spending-commitments/",
    "timestamp": "2025-05-15T14:06:44Z"
  },
  {
    "title": "Trump says the 'beautiful' F-22 Raptor is getting a big upgrade, saying 'we're going to be doing an F-22 Super'",
    "description": "President Trump also accused China of copying the F-22 stealth fighter jet but said it can't copy the engines.",
    "link": "https://www.businessinsider.com/trump-says-f-22-raptor-is-getting-a-super-upgrade-2025-5",
    "timestamp": "2025-05-15T14:06:03Z"
  },
  {
    "title": "Trump Gushes Praise at Hannity on Fox News Over Election: ‘You Were Wonderful to Me!’",
    "description": "Trump gushed praise at Fox News host Sean Hannity for being \"wonderful to me\" and \"an amazing professional\" during the 2024 presidential campaign.\nThe post Trump Gushes Praise at Hannity on Fox News Over Election: ‘You Were Wonderful to Me!’ first appeared on…",
    "link": "https://www.mediaite.com/news/trump-gushes-praise-at-hannity-on-fox-news-over-election-you-were-wonderful-to-me/",
    "timestamp": "2025-05-15T14:05:46Z"
  },
  {
    "title": "Trump says US close to a nuclear deal with Iran",
    "description": "President Donald Trump said on Thursday that the United States was getting very close to securing a nuclear deal with Iran, and Tehran had “sort of” agreed to the terms. “We’re in very serious negotiations with Iran for long-term peace,” Trump said on a tour …",
    "link": "https://freerepublic.com/focus/f-news/4317137/posts",
    "timestamp": "2025-05-15T14:03:29Z"
  },
  {
    "title": "Russian State TV Launches Patriotic Kids Show Featuring Toddler Trump",
    "description": "It features toddler versions of world leaders, including Putin, Trump, Kim, French President Emmanuel Macron and Turkish leader Recep Tayyip Erdogan.",
    "link": "https://www.newsweek.com/russian-state-tv-kids-show-solvyov-trump-2072685",
    "timestamp": "2025-05-15T14:03:03Z"
  },
  {
    "title": "Green-Card Holder Detained for Two Months Details 'Horrendous' Conditions",
    "description": "\"It was degrading, it's dehumanizing. It is horrendous,\" Fabian Schmidt told GBH News.",
    "link": "https://www.newsweek.com/green-card-fabian-schmidt-holder-detained-ice-immigratioon-2072698",
    "timestamp": "2025-05-15T14:02:15Z"
  },
  {
    "title": "Espionage, constitutional concerns abound from Trump detractors, allies over Qatari jet offer",
    "description": "Trump's plan to accept a $400M jet from Qatar sparks debate over constitutional legality and espionage risks, with mixed reactions from both political parties.",
    "link": "https://www.foxnews.com/politics/espionage-constitutional-concerns-abound-from-trump-detractors-allies-over-qatari-jet-offer",
    "timestamp": "2025-05-15T14:01:35Z"
  },
  {
    "title": "Satellite Images Show Desert Ski Resort Emerge at World's Biggest Construction Site",
    "description": "An outdoor ski resort in Saudi Arabia signals the scale of the ambition on the flagship Neom project",
    "link": "https://www.newsweek.com/satellite-images-show-desert-ski-resort-emerge-worlds-biggest-construction-site-2072561",
    "timestamp": "2025-05-15T14:01:14Z"
  },
  {
    "title": "Putin's no-show in Turkey throws Ukraine talks into disarray...",
    "description": null,
    "link": "https://apnews.com/article/trump-qatar-syria-aludeid-air-base-9c868799582685b3a115c6f0c243d606",
    "timestamp": "2025-05-15T14:00:06Z"
  },
  {
    "title": "Going Around. . . Coming Back Around",
    "description": "“I hope Ed Martin’s 1st assignment at DOJ is to investigate Thom Tillis’ corruption.” — Rogan O’Handley (aka’ DC Draino’ on X) The funny part is that this swarm of Jacobin botflies from Norm Eisen to Sen. Thom Tillis thought (and acted) as if Ed Martin was th…",
    "link": "https://www.activistpost.com/going-around-coming-back-around/",
    "timestamp": "2025-05-15T14:00:00Z"
  },
  {
    "title": "Michael Hiltzik: Trump’s Tariff War is Nonsensical",
    "description": "Michael Hiltzik is a Pulitzer-Prize winning columnist for the Los Angeles Times, who write about business and whatever else he wants. In this column, he tries to make sense of Trump’s tariff war. It’s hard to do because it doesn’t make sense. Trump claims to …",
    "link": "https://dianeravitch.net/2025/05/15/michael-hiltzik-trumps-tariff-war-is-nonsensical/",
    "timestamp": "2025-05-15T14:00:00Z"
  },
  {
    "title": "US manufacturing output falls in April on weak auto production",
    "description": "U.S. manufacturing production fell more than expected in April amid a sharp decline in motor vehicle output, and the sector could struggle to regain its...",
    "link": "https://finance.yahoo.com/news/us-manufacturing-output-falls-april-135825544.html",
    "timestamp": "2025-05-15T13:58:25Z"
  },
  {
    "title": "New US ambassador, former senator and business executive David Perdue, arrives in China",
    "description": "The new U.S. ambassador to China, former senator and business executive David Perdue, has arrived in Beijing just days after China and the U.S. agreed to a temporary break in their damaging tariff war",
    "link": "https://abcnews.go.com/US/wireStory/new-us-ambassador-former-senator-business-executive-david-121826180",
    "timestamp": "2025-05-15T13:58:18Z"
  },
  {
    "title": "Walmart prepares price rises due to tariffs",
    "description": "Walmart prepares price rises due to tariffs\nWalmart is preparing to raise prices in the US as soon as this month, as its own costs increase as a result of the new tariffs on imports imposed by President Donald Trump.\nThe plans by the world's largest retailer …",
    "link": "https://biztoc.com/x/4b3c73ee5ea95d9b",
    "timestamp": "2025-05-15T13:58:05Z"
  },
  {
    "title": "Speed is a Choice",
    "description": "The authors of Abundance talk with Michael Pollan about the pace of governance, the environmental questions of our age, and the federal policies that drive scientific progress.",
    "link": "https://longnow.org/ideas/speed-is-a-choice-ezra-klein-derek-thompson-abundance/",
    "timestamp": "2025-05-15T13:57:35Z"
  },
  {
    "title": "What you need to know about 'forever chemicals' in drinking water",
    "description": "Environmental Protection Agency announced plans to weaken limits on some harmful chemicals roughly a year after the Biden administration set national standards.",
    "link": "https://www.nbcnews.com/science/environment/need-know-forever-chemicals-drinking-water-rcna207004",
    "timestamp": "2025-05-15T13:56:37Z"
  },
  {
    "title": "Seth Meyers Predicts Ted Cruz Will Walk Back Criticism of Trump Taking Qatari Jet if He Gets Invited On | Video",
    "description": "For now, the Texas senator thinks \"the plane poses significant espionage and surveillance problems\"\nThe post Seth Meyers Predicts Ted Cruz Will Walk Back Criticism of Trump Taking Qatari Jet if He Gets Invited On | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/trump-qatar-jet-ted-cruz-criticism-seth-meyers/",
    "timestamp": "2025-05-15T13:55:29Z"
  },
  {
    "title": "Big Law Deals With Trump Are Backfiring on Top Firms",
    "description": "Major law firms in a storng position to fight Trump diktats about backing conservative interests are paying a price for selling out.",
    "link": "https://www.nakedcapitalism.com/2025/05/big-law-deals-with-trump-are-backfiring-on-top-firms.html",
    "timestamp": "2025-05-15T13:55:26Z"
  },
  {
    "title": "Birkenstock Raises 2025 Guidance Due To Strong Demand; Price Increases Expected",
    "description": "Birkenstock posted second quarter double-digit revenue growth across operating regions; pricing integrity suggests price increases due to tariffs.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/birkenstock-birk-q2-2025-earnings-1237715570/",
    "timestamp": "2025-05-15T13:54:11Z"
  },
  {
    "title": "Trump says he has a ‘little problem’ with Tim Cook | CNN Business",
    "description": "President Donald Trump isn’t pleased with Apple CEO Tim Cook’s plan to manufacture iPhones bound for the United States at newly built plants in India.",
    "link": "https://www.cnn.com/2025/05/15/tech/tim-cook-donald-trump-india-problem",
    "timestamp": "2025-05-15T13:54:06Z"
  },
  {
    "title": "Can President Trump legally accept a $400m plane for free?",
    "description": "Trump's plane acceptance potentially breaches emoluments clause as lawsuits face procedural hurdles, say experts.",
    "link": "https://www.aljazeera.com/news/2025/5/15/can-president-trump-legally-accept-a-400m-plane-for-free",
    "timestamp": "2025-05-15T13:53:19Z"
  },
  {
    "title": "Jamie Dimon continues to warn of recession, despite pullback in China tariffs | CNN Business",
    "description": "While many economists are saying the risk of an imminent recession has diminished since China and the United States agreed to lower tariffs earlier this week, JPMorgan Chase’s CEO, Jamie Dimon, is still penciling one in.",
    "link": "https://www.cnn.com/2025/05/15/economy/dimon-recession-tariffs",
    "timestamp": "2025-05-15T13:53:09Z"
  },
  {
    "title": "WATCH LIVE: VA Secretary Collins testifies on 2026 White House budget request",
    "description": "President Donald Trump’s 2026 budget request so far includes a 4 percent increase for Department of Veterans Affairs programs.",
    "link": "https://www.pbs.org/newshour/politics/watch-live-va-secretary-collins-testifies-on-2026-white-house-budget-request",
    "timestamp": "2025-05-15T13:51:20Z"
  },
  {
    "title": "This Trump trick should have damned the GOP long ago",
    "description": "Trump is an illegitimate president, but he’s not the first. The last Republican who was elected president without fraud or naked treason was Dwight D. Eisenhower. And it’s damn well past time that Democrats started telling the story.But let’s start with Trump…",
    "link": "https://www.rawstory.com/raw-investigates/donald-trump-lies-gop/",
    "timestamp": "2025-05-15T13:50:37Z"
  },
  {
    "title": "Bruce Springsteen says Trump is ‘unfit’ and ‘incompetent’ in remarks during UK show",
    "description": "Rock megastar Bruce Springsteen has made a series of critical remarks about US President Donald Trump and the policies of his administration, calling the American leader “unfit” for office. “The mighty E Street Band is here tonight to call upon the righteous …",
    "link": "https://freerepublic.com/focus/f-chat/4317135/posts",
    "timestamp": "2025-05-15T13:50:14Z"
  },
  {
    "title": "Apple's iPhone sales in China took a major hit in early 2025",
    "description": "Apple's iPhone sales in China have dropped considerably, with shipments of non-Chinese smartphone brands down almost 50% year-on-year in March.Chinese iPhone sales are an important revenue source for Apple - Image Credit: AppleChina is an important market for…",
    "link": "https://appleinsider.com/articles/25/05/15/apples-iphone-sales-in-china-took-a-major-hit-in-early-2025",
    "timestamp": "2025-05-15T13:49:15Z"
  },
  {
    "title": "Walmart prepares price rises due to tariffs",
    "description": "The retailer said it isn't able to absorb all the pressure from tariffs, even at the reduced levels announced.",
    "link": "https://www.bbc.com/news/articles/cd62427ypw6o",
    "timestamp": "2025-05-15T13:48:01Z"
  },
  {
    "title": "Millions face student loan debt collection in US: Know how to avoid garnished wages",
    "description": "Experts suggest the US Department of Education can garnish up to 15% of the student loan borrower's disposable pay to repay the defaulted loans. As debt collection on defaulted federal student loans is set to begin this summer, here's how to avoid garnished w…",
    "link": "https://economictimes.indiatimes.com/news/international/us/millions-face-student-loan-debt-collection-in-us-know-how-to-avoid-garnished-wages/articleshow/121191343.cms",
    "timestamp": "2025-05-15T13:47:46Z"
  },
  {
    "title": "What Is The 'Worst Person You Know Made a Great Point' Meme? The Viral Reaction Image Explained",
    "description": "It took a few years for García to realize a U.S. satirical website had used his photo to illustrate an article titled \"The Worst Person You Know.\" Here's why!",
    "link": "https://knowyourmeme.com/editorials/guides/what-is-the-worst-person-you-know-made-a-great-point-meme-the-viral-reaction-image-explained",
    "timestamp": "2025-05-15T13:47:31Z"
  },
  {
    "title": "Trump says he has a ‘little problem’ with Tim Cook over Apple’s India production",
    "description": "President rebukes tech firm after reports it will switch assembly of iPhones for US market from China to India\nDonald Trump has admonished Apple and its chief executive over the tech firm’s reported plans to source production of US-bound iPhones from India.\nT…",
    "link": "https://biztoc.com/x/42a6974dc2e59ca6",
    "timestamp": "2025-05-15T13:47:15Z"
  },
  {
    "title": "Trump's $142 billion arms deal may not get the Saudis the F-35 stealth fighter",
    "description": "The Saudis have sought the F-35, a top fighter jet that would put their armed forces on par with Israel. It could be a dealbreaker.",
    "link": "https://www.businessinsider.com/trump-saudi-arms-deal-f35-fighter-jet-2025-5",
    "timestamp": "2025-05-15T13:47:14Z"
  },
  {
    "title": "What does the Constitution say about the $400 million airplane that Qatar wants to gift Trump?",
    "description": "U.S. President Donald Trump’s plan to accept a $400 million airplane from Qatar raises a raft of questions about the scope of laws that relate to gifts from foreign governments and are intended to thwart corruption and improper influence, legal experts said.\n…",
    "link": "https://biztoc.com/x/6b7f22656a6d7ebb",
    "timestamp": "2025-05-15T13:46:58Z"
  },
  {
    "title": "Apple's India iPhone Shift Irks Donald Trump",
    "description": "In addition to China, Apple is making its iPhones in India, but apparently Trump isn’t too thrilled by that either.",
    "link": "https://www.androidheadlines.com/2025/05/trump-not-thrilled-apple-making-iphones-in-india.html",
    "timestamp": "2025-05-15T13:45:23Z"
  },
  {
    "title": "Developing: Iran Caves, Trump Gets Nuclear Deal Hours After Threatening to Crush Them Into Oblivion",
    "description": "After President Donald Trump offered Iran the choice between peace and oblivion, an Iranian official says a deal is possible.",
    "link": "https://www.westernjournal.com/developing-iran-caves-trump-gets-nuclear-deal-hours-threatening-crush-oblivion/",
    "timestamp": "2025-05-15T13:44:44Z"
  },
  {
    "title": "Trump says India has offered 'no tariffs' on US goods in trade negotiations",
    "description": "The US President made the claim while also criticising tech giant Apple's decision to invest in India, following the implementation of his tariff regime.",
    "link": "https://www.abc.net.au/news/2025-05-15/india-offered-zero-tariffs-on-us-imports-donald-trump-says/105298726",
    "timestamp": "2025-05-15T13:44:31Z"
  }
]