[
  {
    "title": "Donald Trump Backs His Co-President; Says Attacks On Tesla Dealerships Will Be Treated As ‘Terrorism’",
    "description": "The people have spoken. And by people, I mean Elon Musk. Trump is now buying into the batshit crazy that is the current Musk/Cybertruck discourse. This, of course, leaves the nominal VP plenty of time to get into long personal arguments with critics on Twitte…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=176695995",
    "timestamp": "2025-03-12T17:32:14Z"
  },
  {
    "title": "Most AAPI adults don’t support cutting federal agencies, new poll shows",
    "description": "A new AP-NORC/AAPI Data poll shows that most Asian Americans, Native Hawaiians and Pacific Islanders do not agree with the strategy of putting entire federal agencies on the chopping block, nor are they broadly on board with mass layoffs of federal workers.",
    "link": "https://www.pbs.org/newshour/politics/most-aapi-adults-dont-support-cutting-federal-agencies-new-poll-shows",
    "timestamp": "2025-03-12T17:31:52Z"
  },
  {
    "title": "Trump rags Irish prime minister on trade as 25% tariffs on EU steel, aluminum take effect: ‘Take back the wealth’",
    "description": "The craic wasn't all good at the White House Wednesday",
    "link": "https://nypost.com/2025/03/12/us-news/trump-rags-irish-prime-minister-on-trade-as-25-tariffs-on-eu-steel-aluminum-take-effect-take-back-the-wealth/",
    "timestamp": "2025-03-12T17:31:45Z"
  },
  {
    "title": "Canada Targets US Imports to Counter ‘Nonsense’ Tariffs",
    "description": "Canada is responding to U.S. tariffs with its own 25% levy on American goods. These counter tariffs, as Bloomberg News reported, are due to go into effect at 12:01 a.m. eastern time Thursday (March 13) and cover $20.8 billion in imports such as steel and alum…",
    "link": "https://www.pymnts.com/economy/2025/canada-targets-us-imports-to-counter-nonsense-tariffs/",
    "timestamp": "2025-03-12T17:31:21Z"
  },
  {
    "title": "Reporter Tees Up Trump for Rosie O’Donnell Insult By Asking Ireland’s PM Why He Would ‘Let’ Her Move To His Country",
    "description": "Donald Trump roasted Rosie O'Donnell after a reporter asked Ireland's prime minister why he would \"let\" the actress and vocal Trump critic move to his country.\nThe post Reporter Tees Up Trump for Rosie O’Donnell Insult By Asking Ireland’s PM Why He Would ‘Let…",
    "link": "https://www.mediaite.com/news/reporter-tees-up-trump-for-rosie-odonnell-insult-by-asking-irelands-pm-why-he-would-let-her-move-to-his-country/",
    "timestamp": "2025-03-12T17:30:50Z"
  },
  {
    "title": "'Have You No Decency?': House Hearing Ends After GOP Chair Misgenders Trans Lawmaker",
    "description": "The Republican chair of a House Foreign Affairs subcommittee abruptly ended a hearing Tuesday after a Texas lawmaker repeatedly misgendered a transgender U.S. congresswoman, sparking a heated response from one of their Democratic colleagues.\n\nRep. Keith Self …",
    "link": "https://www.commondreams.org/news/sarah-mcbride-misgendered",
    "timestamp": "2025-03-12T17:30:15Z"
  },
  {
    "title": "Trump Reverses Course On Doubling Tariffs On Canada",
    "description": "United States ruler Donald Trump has backed off his plan to double tariffs on Canada. Trump made the threat as retaliation for Ontario Premier Doug Ford’s decision to impose a 25% tariff on electricity exports to Michigan, New York, and Minnesota.",
    "link": "https://www.shtfplan.com/headline-news/trump-reverses-course-on-doubling-tariffs-on-canada",
    "timestamp": "2025-03-12T17:30:01Z"
  },
  {
    "title": "Kentucky bourbon makers fear becoming 'collateral damage' in Trump's trade war",
    "description": "The owners of Brough Brothers bourbon in Kentucky were hopiing to cultivate new markets in Canada and Europe, but then the trade war started.",
    "link": "https://richmond.com/news/nation-world/business/article_ca8d05cf-5f54-5ee3-8c70-99784ff0c8dd.html",
    "timestamp": "2025-03-12T17:30:00Z"
  },
  {
    "title": "Senate Finance Republicans to huddle with Trump on taxes (Politico)",
    "description": "Politico:\nSenate Finance Republicans to huddle with Trump on taxes  —  Senate Finance Committee Republicans will meet with President Donald Trump at the White House on Thursday to discuss the path forward for crafting legislation to enact broad swaths of the …",
    "link": "https://www.memeorandum.com/250312/p83",
    "timestamp": "2025-03-12T17:30:00Z"
  },
  {
    "title": "Kentucky bourbon makers fear becoming 'collateral damage' in Trump's trade war",
    "description": "The owners of Brough Brothers bourbon in Kentucky were hopiing to cultivate new markets in Canada and Europe, but then the trade war started.",
    "link": "https://roanoke.com/news/nation-world/business/article_a34ce9e4-a414-5cc2-8a7b-46c4a7c20804.html",
    "timestamp": "2025-03-12T17:30:00Z"
  },
  {
    "title": "Trump playing Holi in the dark with trade",
    "description": "Donald Trump's tariff strategy aims to improve the US trade balance and boost domestic manufacturing. He uses tariffs selectively and negotiates based on economic pushback. By starting from an extreme position and recalibrating, Trump intends to bring surplus…",
    "link": "https://m.economictimes.com/opinion/et-editorial/trump-playing-holi-in-the-dark-with-trade/articleshow/118944890.cms",
    "timestamp": "2025-03-12T17:29:26Z"
  },
  {
    "title": "Chart Shows US Stock Market Lagging European Indexes Since Trump's Return",
    "description": "The U.S. stock market has lagged behind European indexes since Donald Trump returned to office in January, weighed down by confusion over the president's economic policies while European equities have been more stable due to a combination of factors, from fis…",
    "link": "https://biztoc.com/x/ee8249152d6d0ec9",
    "timestamp": "2025-03-12T17:29:19Z"
  },
  {
    "title": "Voters No Longer Think Country in Right Direction Under Trump: Polls",
    "description": "Recent polling suggests a growing number of voters believe the country is heading in the wrong direction under President Donald Trump's leadership.\nWhy It Matters\nGrowing angst among voters over the direction the country is heading in could have major politic…",
    "link": "https://biztoc.com/x/86cae94a87b27b29",
    "timestamp": "2025-03-12T17:29:16Z"
  },
  {
    "title": "NY Times columnists warn second Trump term causing 'despair,' may kill 'more than 1 million people'",
    "description": "New York Times opinion writers warned in a new podcast that the Trump administration is making decisions that may result in the deaths of more than a million people.",
    "link": "https://www.foxnews.com/media/ny-times-columnists-warn-second-trump-term-causing-despair-may-kill-more-than-1-million-people",
    "timestamp": "2025-03-12T17:28:44Z"
  },
  {
    "title": "China questions Walmart over response to Trump tariff costs",
    "description": "HONG KONG -- Chinese government agencies, including the Ministry of Commerce, summoned Walmart representatives this week after the U.S. retailer urged suppliers in China to offset President Donald Trump's tariffs with substantial price cuts, according to Beij…",
    "link": "https://biztoc.com/x/ecb13f40d56041ca",
    "timestamp": "2025-03-12T17:28:33Z"
  },
  {
    "title": "From soup cans to airplanes, steel and aluminum are a fundamental part of American life",
    "description": "Steel and aluminum are ubiquitous in Americans’ lives. A stainless steel refrigerator holds aluminum soda cans. A stainless steel drum tumbles inside an aluminum washing machine. They’re the metals used in cars and airplanes, phones and frying pans, skyscrape…",
    "link": "https://financialpost.com/pmn/from-soup-cans-to-airplanes-steel-and-aluminum-are-a-fundamental-part-of-american-life",
    "timestamp": "2025-03-12T17:27:53Z"
  },
  {
    "title": "Taoiseach claims Trump 'very clued in' to Gaza as Occupied Territories Bill question deflected",
    "description": "During Martin’s meeting with the US President this afternoon, Trump said the US ‘is working hard with Israel’.",
    "link": "https://www.thejournal.ie/taoiseach-trump-gaza-occupied-territories-bill-6647318-Mar2025/",
    "timestamp": "2025-03-12T17:27:17Z"
  },
  {
    "title": "Chart Shows US Stock Market Lagging European Indexes Since Trump's Return",
    "description": "Tariffs are fueling uncertainty among U.S. investors.",
    "link": "https://www.newsweek.com/chart-shows-us-stock-market-lagging-europe-2043672",
    "timestamp": "2025-03-12T17:27:15Z"
  },
  {
    "title": "ESPN's Ryan Clark Claims Criticism of Shedeur Sanders is Because of 'The Color of His Skin'",
    "description": "ESPN's Ryan Clark is claiming that criticism of Colorado Buffaloes quarterback Shedeur Sanders is based on the \"color of his skin.\"\nThe post ESPN’s Ryan Clark Claims Criticism of Shedeur Sanders is Because of ‘The Color of His Skin’ appeared first on Breitbar…",
    "link": "https://www.breitbart.com/sports/2025/03/12/espns-ryan-clark-claims-criticism-of-shedeur-sanders-is-because-of-the-color-of-his-skin/",
    "timestamp": "2025-03-12T17:27:04Z"
  },
  {
    "title": "In his own words: Trump takes credit for stock market rises but casts aside blame for sell-off",
    "description": "By MICHELLE L. PRICE\nWASHINGTON (AP) — President Donald Trump in recent days has dismissed fears of a recession and brushed aside the stock market sell-off, going so far as to say, “You can’t really watch the stock market.” That’s a new message from a leader …",
    "link": "https://biztoc.com/x/e7a795bc71782963",
    "timestamp": "2025-03-12T17:27:02Z"
  },
  {
    "title": "Joe Rogan, Candace Owens, and the Mainstreaming of Anti-Semitism Exposes a Rot in American Media",
    "description": "\"Rogan, like so many before him, is falling to audience capture and the platforming of the world’s oldest hate in the name of eyeball-grabbing content\"\nThe post Joe Rogan, Candace Owens, and the Mainstreaming of Anti-Semitism Exposes a Rot in American Media f…",
    "link": "https://www.mediaite.com/opinion/joe-rogan-candace-owens-and-the-mainstreaming-of-anti-semitism-exposes-a-rot-in-american-media/",
    "timestamp": "2025-03-12T17:26:36Z"
  },
  {
    "title": "Trump praises Conor McGregor but says Taoiseach ‘better off not knowing’ Rosie O’Donnell",
    "description": "American comedian and Trump nemesis Rosie O’Donnell yesterday said she had moved to Ireland to escape the ‘cruelty’ of the US government.",
    "link": "https://www.thejournal.ie/trump-praises-conor-mcgregor-says-taoiseach-better-off-not-knowing-rosie-odonnell-6647435-Mar2025/",
    "timestamp": "2025-03-12T17:25:58Z"
  },
  {
    "title": "Why a law firm says Trump’s order against it ‘presents a clear and present danger’",
    "description": "President Donald Trump signs executive orders in the Oval Office of the White House on March 06, 2025 in Washington, DC. President Trump signed a series of executive orders, including, lifting 25% tariffs for all goods compliant under USMCA trade agreement, t…",
    "link": "https://biztoc.com/x/a6c5cf22177330f4",
    "timestamp": "2025-03-12T17:24:51Z"
  },
  {
    "title": "The Shutdown Fight That Could Play Right Into Trump’s Hands",
    "description": "With President Donald Trump and Elon Musk taking a sledgehammer to the federal bureaucracy with their “Department of Government Efficiency,” Democrats are desperate to push back — and some are eyeing what they see as an irresistible piece of leverage. Asked o…",
    "link": "https://freerepublic.com/focus/f-news/4303800/posts",
    "timestamp": "2025-03-12T17:24:39Z"
  },
  {
    "title": "'A catastrophe': Democrats sound off on Trump's cuts to Education Department",
    "description": "Three state governors, all former educators, derided the decision to terminate nearly half the federal agency's workforce.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/12/democratic-governors-trump-department-education-layoffs/82308895007/",
    "timestamp": "2025-03-12T17:23:35Z"
  },
  {
    "title": "A Trump official has been moonlighting as a fashion influencer",
    "description": "On February 11th, as thousands of civil servants wondered whether they’d have a job — or whether their federal agencies would exist at all, as President Donald Trump and Elon Musk took a wrecking ball to the federal government — McLaurine Pinover had other th…",
    "link": "https://www.theverge.com/news/628067/opm-fashion-influencer-affiliate-links-mclaurine-pinover",
    "timestamp": "2025-03-12T17:21:25Z"
  },
  {
    "title": "Is the US heading for a government shutdown? 5 essential reads to occupy the mind while we wait to find out",
    "description": "Congress has until March 14 to pass a spending bill that will keep the lights on in Washington.",
    "link": "https://theconversation.com/is-the-us-heading-for-a-government-shutdown-5-essential-reads-to-occupy-the-mind-while-we-wait-to-find-out-252081",
    "timestamp": "2025-03-12T17:20:52Z"
  },
  {
    "title": "Musk pushing Social Security to end phone service — forcing seniors to go online for help",
    "description": "The Social Security Administration may drastically cut back the phone service relied on by 73 million retired and disabled Americans under pressure from Elon Musk's team in the U.S. DOGE Service.The agency's leadership is considering a proposal to end telepho…",
    "link": "https://www.rawstory.com/doge-social-security-2671317262/",
    "timestamp": "2025-03-12T17:20:45Z"
  },
  {
    "title": "Musk pushing Social Security to end phone service — forcing seniors to go online for help - NewsBreak",
    "description": "The Social Security Administration may drastically cut back the phone service relied on by 73 million retired and disabled Americans under pressure from El",
    "link": "https://www.newsbreak.com/share/3852814627244-musk-pushing-social-security-to-end-phone-service-forcing-seniors-to-go-online-for-help?s=a2&share_destination_id=MzE1MDIxNjc1LTE3NDE4MDk3MzY3MDg%3D&pd=0LJnWlB1&hl=en_US&send_time=1741809736&actBtn=topBar&_f=app_share&trans_data=%7B%22platform%22%3A1%2C%22cv%22%3A%2225.10.0%22%2C%22languages%22%3A%22en%22%7D&sep=ns_local_strategy_25q1_exp-v13%2Cns_foryou_recall_exp_25q1-v4%2Cns_foryou_blend_exp_25q1-v1%2Cns_foryou_rank_exp_25q1-v5%2Cns_foryou_model_exp_25q1-v5",
    "timestamp": "2025-03-12T17:20:45Z"
  },
  {
    "title": "Voters No Longer Think Country in Right Direction Under Trump: Polls",
    "description": "A growing number of voters believe the country is heading in the wrong direction under Donald Trump's leadership, polls show.",
    "link": "https://www.newsweek.com/donald-trump-poll-direction-country-2043644",
    "timestamp": "2025-03-12T17:20:40Z"
  },
  {
    "title": "Trump Criticizes Ireland Over 'Massive' Trade Imbalances (Bloomberg)",
    "description": "Bloomberg:\nTrump Criticizes Ireland Over ‘Massive’ Trade Imbalances … US President Donald Trump assailed what he cast as imbalances in global trade during a meeting with Irish Prime Minister Micheál Martin, reiterating his threat to impose reciprocal tariffs …",
    "link": "https://www.memeorandum.com/250312/p81",
    "timestamp": "2025-03-12T17:20:01Z"
  },
  {
    "title": "Canada slaps US with ‘dollar-for-dollar’ tariffs on $21B worth of steel and aluminum imports",
    "description": "The latest Canadian countermeasures add to the 25% tariffs Ottawa imposed on $30 billion worth of US goods on March 4.",
    "link": "https://nypost.com/2025/03/12/business/canada-hits-us-with-25-tariffs-on-20-6b-worth-of-steel-aluminum/",
    "timestamp": "2025-03-12T17:19:34Z"
  },
  {
    "title": "Ronald Reagan's Daughter Tears into Donald Trump: 'Would Be Grieving'",
    "description": "Author Patti Davis, the daughter of the late President Ronald Reagan, said her father would be \"grieving\" over how President Donald Trump is damaging America's standing on the world stage.\nIn a Tuesday interview with CNN's Anderson Cooper, Davis, a liberal, s…",
    "link": "https://biztoc.com/x/2bab8610ce29a283",
    "timestamp": "2025-03-12T17:18:50Z"
  },
  {
    "title": "In his own words: Trump takes credit for stock market rises but casts aside blame for sell-off",
    "description": "A look at some of Trump’s observations on the stock market over the last year.",
    "link": "https://www.bostonherald.com/2025/03/12/trump-stock-market-quotes/",
    "timestamp": "2025-03-12T17:18:47Z"
  },
  {
    "title": "Blumenthal: Trump 'Destroying' Rule of Law, World Order",
    "description": "Senator Richard Blumenthal (D-CT) said on Wednesday on MSNBC's \"Ana Cabrera Reports\" that President Donald Trump was \"destroying\" both the rule of law and the world order.\nThe post Blumenthal: Trump ‘Destroying’ Rule of Law, World Order appeared first on Brei…",
    "link": "https://www.breitbart.com/clips/2025/03/12/blumenthal-trump-destroying-rule-of-law-world-order/",
    "timestamp": "2025-03-12T17:18:41Z"
  },
  {
    "title": "Both Sides Spin Who Would Benefit from Extending Trump Tax Cuts",
    "description": "With the Republican-controlled Congress moving forward with President Donald Trump's call to extend the 2017 individual tax cuts, Democrats and Republicans are spinning the facts about who would benefit. Several Democrats have framed the tax cuts as exclusive…",
    "link": "https://www.factcheck.org/2025/03/both-sides-spin-who-would-benefit-from-extending-trump-tax-cuts/",
    "timestamp": "2025-03-12T17:18:38Z"
  },
  {
    "title": "'In DOGE we trust:' House GOP governs by embracing Trump's effort to cut government",
    "description": "House Speaker Mike Johnson has accomplished the seemingly unexpected, keeping his Republican majority in line to fund the government",
    "link": "https://abcnews.go.com/Politics/wireStory/doge-trust-house-gop-governs-embracing-trumps-effort-119721965",
    "timestamp": "2025-03-12T17:17:54Z"
  },
  {
    "title": "As Elon Musk and Donald Trump Race to Provide Support, Is the Worst Over for Tesla Stock?",
    "description": "",
    "link": "https://biztoc.com/x/3823ffbabc23934b",
    "timestamp": "2025-03-12T17:17:53Z"
  },
  {
    "title": "Ronald Reagan's Daughter Tears into Donald Trump: 'Would Be Grieving'",
    "description": "Patti Davis tells CNN's Anderson Cooper that the U.S. is becoming \"hated\" internationally because of Trump's actions.",
    "link": "https://www.newsweek.com/ronald-reagan-daughter-trump-russia-ukraine-patti-davis-2043536",
    "timestamp": "2025-03-12T17:17:47Z"
  },
  {
    "title": "IT Minister Ashwini Vaishnaw 'welcomes' Musk's Starlink to India, says it will be useful for...",
    "description": "Union IT Minister Ashwini Vaishnaw welcomed Elon Musk's Starlink, emphasizing its potential for remote railway projects. Mukesh Ambani’s Jio Platforms struck a deal with SpaceX to bring Starlink broadband to India, competing with Airtel’s similar partnership.",
    "link": "https://economictimes.indiatimes.com/industry/telecom/telecom-news/it-minister-ashwini-vaishnaw-welcomes-musks-starlink-to-india-says-will-be-useful-for-/articleshow/118944474.cms",
    "timestamp": "2025-03-12T17:17:29Z"
  },
  {
    "title": "In reverse: Elon Musk’s antics are not the only problem for Tesla",
    "description": "Elon Musk’s antics are not the only problem for Tesla\nThe carmaker’s sales are sinking for other reasons too\nFriends help each other out. Tesla’s boss, Elon Musk, may well have been grateful when Donald Trump said he would buy one of its electric vehicles (EV…",
    "link": "https://biztoc.com/x/83ad64831c8e5801",
    "timestamp": "2025-03-12T17:17:16Z"
  },
  {
    "title": "Will Starmer reap the rewards of not retaliating against Trump's tariffs?",
    "description": "Donald Trump's approach: making America great again - by pushing up the price of goods and materials from overseas - and getting punters and businesses to buy American instead.",
    "link": "https://news.sky.com/story/will-starmer-reap-the-rewards-of-not-retaliating-against-donald-trumps-tariffs-13327240",
    "timestamp": "2025-03-12T17:17:00Z"
  },
  {
    "title": "‘Closest target’: Why is Donald Trump so focused on Canada?",
    "description": "Tariffs and threats to annex Canada fall into Donald Trump's wider vision for US dominance in the world, experts say.",
    "link": "https://www.aljazeera.com/news/2025/3/12/closest-target-why-is-donald-trump-so-focused-on-canada",
    "timestamp": "2025-03-12T17:16:27Z"
  },
  {
    "title": "As a ban still looms, TikTok talks up its economic impact: 7.5 million businesses, 28 million jobs",
    "description": "As the will-it-won’t-it vibe around the potential TikTok ban continues, with Donald Trump saying he’ll “probably” extend owner ByteDance‘s deadline to divest, the platform is highlighting its contribution to the U.S. economy. Oxford Economics is an advisory/a…",
    "link": "https://www.tubefilter.com/2025/03/12/tiktok-contribution-to-us-economy-jobs-oxford-economics/",
    "timestamp": "2025-03-12T17:16:04Z"
  },
  {
    "title": "Trump Ditches Musk's Dream Of Mission To Mars Faster Than An Exploding Starship",
    "description": "Trump might not be on board to fund a crewed mission to Mars, a long-time goal of his campaign's biggest backer",
    "link": "https://www.jalopnik.com/1809733/trump-ditches-elon-musk-dream-mission-to-mars/",
    "timestamp": "2025-03-12T17:15:35Z"
  },
  {
    "title": "Germany's likely new government makes a risky gambit",
    "description": "The CDU/CSU and SPD want to raise hundreds of billions of euros in debt. They are set to push the proposal through the outgoing Bundestag in special sessions. That is legal, but is it legitimate?",
    "link": "https://www.dw.com/en/germanys-likely-new-government-makes-a-risky-gambit/a-71902135",
    "timestamp": "2025-03-12T17:15:00Z"
  },
  {
    "title": "Ohio college 'illegally forcing students' to share bathrooms with opposite sex: watchdog",
    "description": "A conservative legal watchdog group wants the Trump administration and Ohio's attorney general to investigate Kenyon College over its bathroom policy.",
    "link": "https://www.foxnews.com/politics/ohio-college-illegally-forcing-students-share-bathrooms-opposite-sex-watchdog",
    "timestamp": "2025-03-12T17:14:59Z"
  },
  {
    "title": "Billionaires at Trump’s Inauguration Have Since Lost $209 Billion",
    "description": "As Donald Trump took the oath of office on Jan. 20, he was flanked by some of the world’s wealthiest people. The billionaires present that day — including Elon Musk, Jeff Bezos and Mark Zuckerberg — had never been richer, flush with big gains from frothy stoc…",
    "link": "https://biztoc.com/x/464e98d145f485ed",
    "timestamp": "2025-03-12T17:14:27Z"
  },
  {
    "title": "FTC asks to delay Amazon Prime case due to ‘severe resource shortfalls’ after Trump cost-cutting measures",
    "description": "\"We have lost employees in the agency, in our division and on our case team,\" said Jonathan Cohen, an attorney for the FTC.",
    "link": "https://nypost.com/2025/03/12/business/ftc-asks-to-delay-amazon-prime-case-due-after-trump-cost-cuts/",
    "timestamp": "2025-03-12T17:14:20Z"
  },
  {
    "title": "Laughter in the White House as Trump says the Irish housing crisis is a 'good problem to have'",
    "description": "In response, Taoiseach Micheál Martin said: “That’s a pretty good answer, Mr President.”",
    "link": "https://www.thejournal.ie/housing-crisis-in-ireland-trump-oval-office-6647213-Mar2025/",
    "timestamp": "2025-03-12T17:13:48Z"
  },
  {
    "title": "'Very bad for Russia': Trump issues warning as U.S. awaits response to ceasefire proposal",
    "description": "\"We could do things very bad for Russia, would be devastating for Russia,\" Trump said Wednesday during a White House meeting with Ireland's leader.",
    "link": "https://www.usatoday.com/story/news/politics/2025/03/12/trump-russia-ukraine-war-ceasefire/82313160007/",
    "timestamp": "2025-03-12T17:13:32Z"
  },
  {
    "title": "Prosecutors want case against Columbia University protester moved out of NYC",
    "description": "Protesters outside federal court in lower Manhattan Wednesday.\n \n\nMahmoud Khalil was detained for his role in pro-Palestinian protests, officials say. [ more › ]",
    "link": "https://gothamist.com/news/lawyers-for-detained-columbia-university-protester-expected-to-demand-his-release-at-nyc-hearing",
    "timestamp": "2025-03-12T17:13:00Z"
  },
  {
    "title": "Boebert Won’t Back Down From Al Green ‘Pimp Cane’ Remark — Even as She Faces Censure",
    "description": "Republican Rep. Lauren Boebert (R-CO) stood firm on her remarks regarding Rep. Al Green’s (D-TX) “pimp cane,” even as she faces punishment from a foe across the aisle. Rep. Chrissy Houlahan (D-PA) moved to censure Boebert on Monday, “for her racist and deroga…",
    "link": "https://www.mediaite.com/news/boebert-wont-back-down-from-al-green-pimp-cane-remark-even-as-she-faces-censure/",
    "timestamp": "2025-03-12T17:12:59Z"
  },
  {
    "title": "Inside the government study trying to understand the health effects of ultraprocessed foods",
    "description": "Ultraprocessed foods are linked to ailments including obesity and diabetes, but it's not clear exactly how.",
    "link": "https://www.bostonherald.com/2025/03/12/ultraprocessed-foods-study/",
    "timestamp": "2025-03-12T17:12:54Z"
  },
  {
    "title": "ICE Arrests 33,000 Illegal Aliens Across U.S. Since Trump Took Office",
    "description": "President Donald Trump's ICE agency has arrested about 33,000 illegal aliens across the United States since Jan. 20, when he took office.\nThe post ICE Arrests 33,000 Illegal Aliens Across U.S. Since Trump Took Office appeared first on Breitbart.",
    "link": "https://www.breitbart.com/politics/2025/03/12/ice-arrests-33000-illegal-aliens-u-s-since-trump-took-office/",
    "timestamp": "2025-03-12T17:12:26Z"
  },
  {
    "title": "Justice Department is expected to slash public corruption unit, AP sources say",
    "description": "The unit was created after Watergate to oversee criminal prosecutions of federal public corruption cases.",
    "link": "https://www.denverpost.com/2025/03/12/justice-department-corruption-section/",
    "timestamp": "2025-03-12T17:12:20Z"
  },
  {
    "title": "Justice Department is expected to slash public corruption unit, AP sources say",
    "description": "The unit was created after Watergate to oversee criminal prosecutions of federal public corruption cases.",
    "link": "https://www.bostonherald.com/2025/03/12/justice-department-corruption-section/",
    "timestamp": "2025-03-12T17:12:20Z"
  },
  {
    "title": "Make No Mistake, Trump Is Turning the US Into a Police State",
    "description": "“America, this republic, this democracy in which we are, is a living thing which cannot be contemplated or categorized, like the image of a thing I can make . . . . It is not and never will be perfect because the standard of perfection does not apply here. Di…",
    "link": "https://www.commondreams.org/opinion/trump-s-police-state",
    "timestamp": "2025-03-12T17:10:44Z"
  },
  {
    "title": "Leftie Hardliner Rosie O'Donnell Has Secretly QUIT America for Good and is Now Living in Ireland As Donald Trump Sparks Market Meltdown Chaos and Recession Panic",
    "description": "Leftie comedian Rosie O’Donnell has secretly quit the U.S. after Donald Trump was sworn in as President and is now living in Ireland with her 12-year-old daughter.",
    "link": "https://radaronline.com/p/leftie-rosie-o-donnell-quits-america-living-ireland-donald-trump-recession-fears-stock-market-meltdown/",
    "timestamp": "2025-03-12T17:10:36Z"
  },
  {
    "title": "Multistrategy Hedge Funds’ Haven Appeal Tested Amid Trump Trade War",
    "description": "Multistrategy hedge funds are facing their biggest challenge since the early days of the pandemic amid a market selloff that’s forcing them to unwind crowded trades at a ferocious clip.",
    "link": "https://financialpost.com/pmn/business-pmn/multistrategy-hedge-funds-haven-appeal-tested-amid-trump-trade-war",
    "timestamp": "2025-03-12T17:09:41Z"
  },
  {
    "title": "Doug Ford and Mark Carney have first meeting over breakfast at Toronto diner",
    "description": "Ontario Premier Doug Ford and Prime Minister-designate Mark Carney came together for their first face-to-face meeting on Wednesday morning, ahead of Ford's upcoming trip to Washington D.C. to address the ongoing trade issues with the U.S. \r\nThe breakfast meet…",
    "link": "https://www.blogto.com/city/2025/03/doug-ford-mark-carney-meeting-toronto-diner/",
    "timestamp": "2025-03-12T17:09:25Z"
  },
  {
    "title": "From Mexico cartel safe house to US streets: BBC tracks deadly fentanyl targeted by Trump tariffs",
    "description": "One cartel member tells the BBC's Quentin Sommerville the impact of the illegal drug is \"not my problem\".",
    "link": "https://www.bbc.com/news/articles/cy5ng663d1wo",
    "timestamp": "2025-03-12T17:09:20Z"
  },
  {
    "title": "Pencils and Politics: The History of Political Cartoons",
    "description": "This article originally appeared in the Election print issue, in stands November 2024. It has not been updated and some information may be out of date.   Satirical cartoons continue to serve as powerful tools for political commentary. Since their start in the…",
    "link": "https://dailyutahchronicle.com/2025/03/12/pencils-politics-history-political-cartoons/",
    "timestamp": "2025-03-12T17:08:33Z"
  },
  {
    "title": "Judge Pauses Military Trans Ban Trial Over DOJ Lawyers’ Incompetence",
    "description": "A federal judge stopped a hearing about Donald Trump’s ban on transgender military service members in its tracks Wednesday, calling for a recess from proceedings to invite the Department of Justice’s lawyer to actually read up on the policy they were defendin…",
    "link": "https://newrepublic.com/post/192657/judge-military-trans-ban-trial-lawyers-incompetence",
    "timestamp": "2025-03-12T17:07:54Z"
  },
  {
    "title": "Tesla Protests: Here’s Where Police Are Investigating As Trump Floats Domestic Terrorism Charges",
    "description": "Peaceful Tesla protests have taken place across the country—but some dealerships have also been hit with acts of vandalism, including gunfire and arson, in protests apparently directed at Elon Musk.",
    "link": "https://www.forbes.com/sites/conormurray/2025/03/12/tesla-protests-heres-where-police-are-investigating-as-trump-floats-domestic-terrorism-charges/",
    "timestamp": "2025-03-12T17:07:50Z"
  },
  {
    "title": "Crypto ETFs Likely Won't Be Approved Until New SEC Chair Is Sworn In",
    "description": "President Donald Trump named Paul Atkins as his pick to lead the agency but no hearing has been scheduled yet to confirm him.",
    "link": "https://biztoc.com/x/966f5b0318925a3d",
    "timestamp": "2025-03-12T17:07:34Z"
  },
  {
    "title": "Trump Admin Cracks Down on Maine After Governor Publicly Defies Transgender Order",
    "description": "President Donald Trump made a vow to Maine's governor, and now he is keeping it as aid to Maine's university system is paused.",
    "link": "https://www.westernjournal.com/trump-admin-cracks-maine-governor-publicly-defies-transgender-order/",
    "timestamp": "2025-03-12T17:04:36Z"
  },
  {
    "title": "Wall Street keeps shaking, and stocks lose a big morning gain as Trump's trade war escalates",
    "description": "Wall Street experiences volatility as tariffs from President Trump's trade war prompt retaliations from other countries. Stocks for U.S. companies like Brown-Forman and Harley-Davidson plummet due to new European Union tariffs. Additionally, AI-related compan…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-keeps-shaking-and-stocks-lose-a-big-morning-gain-as-trumps-trade-war-escalates/articleshow/118944212.cms",
    "timestamp": "2025-03-12T17:04:34Z"
  },
  {
    "title": "Trump raises 'massive' trade imbalance during Irish PM meeting",
    "description": "Trump raises 'massive' trade imbalance during Irish PM meeting\nUS President Donald Trump has raised a \"massive\" trade imbalance with Ireland and accused the European Union of treating the US \"very badly\".\nHe made the comments during a bilateral meeting with T…",
    "link": "https://biztoc.com/x/3388cdc8bb9a2324",
    "timestamp": "2025-03-12T17:04:03Z"
  },
  {
    "title": "GOP’s Thomas Massie Shrugs Off Trump Threat, Blames Him for Causing ‘Massive Inflation’ in 2020",
    "description": "“It feels just like 2020. March 27th, 2020. When I was the only one to oppose the CARES Act, the president threatened me”\nThe post GOP’s Thomas Massie Shrugs Off Trump Threat, Blames Him for Causing ‘Massive Inflation’ in 2020 first appeared on Mediaite.",
    "link": "https://www.mediaite.com/news/gops-thomas-massie-shrugs-off-trump-threat-blames-him-for-causing-massive-inflation-in-2020/",
    "timestamp": "2025-03-12T17:03:04Z"
  },
  {
    "title": "EPA terminates Biden-era climate grants worth $20 billion",
    "description": "The Environmental Protection Agency said it has terminated grant agreements worth $20 billion issued by the Biden administration under a so-called green bank to finance climate-friendly projects",
    "link": "https://abcnews.go.com/Politics/wireStory/epa-terminates-biden-era-climate-grants-worth-20-119721354",
    "timestamp": "2025-03-12T17:02:44Z"
  },
  {
    "title": "‘The View’ Co-Hosts Are Very Upset That GOP Congressman Called Biological Male Congressman ‘Mister’",
    "description": "\"The View\" co-hosts seethed over Republican Texas Rep. Keith Self introducing Democrat Delaware Rep. Sarah McBride, a trans-identifying male, as \"mister.\"",
    "link": "https://dailycaller.com/2025/03/12/the-view-keith-self-sarah-mcbride/",
    "timestamp": "2025-03-12T17:02:35Z"
  },
  {
    "title": "Canada's incoming prime minister says he'll meet Trump if Canadian sovereignty is respected",
    "description": "Incoming Canadian Prime Minister Mark Carney says he’s ready to meet with U.S. Donald Trump if he respects Canadian sovereignty and is open to talk about a common approach to trade",
    "link": "https://abcnews.go.com/International/wireStory/canadas-incoming-prime-minister-hell-meet-trump-canadian-119721598",
    "timestamp": "2025-03-12T17:02:35Z"
  },
  {
    "title": "'US Is Not Providing Armaments to Russia': Rubio",
    "description": "Secretary of State Marco Rubio said threatening Russia about what the U.S. will do will not encourage them to pursue the ceasefire.",
    "link": "https://www.newsweek.com/us-not-providing-armaments-russia-rubio-2043622",
    "timestamp": "2025-03-12T17:01:25Z"
  },
  {
    "title": "Wait, Trump/Musk Were LYING When They Said Cutting USAID Meant We'd Feed People At Home???",
    "description": "$1 billion to buy food from farmers for schools and food banks 'no longer effectuates agency priorities.'",
    "link": "https://www.wonkette.com/p/wait-trumpmusk-were-lying-when-they",
    "timestamp": "2025-03-12T17:01:23Z"
  },
  {
    "title": "Ukraine Truce Dominates G7 Talks Clouded By Trump's Canada Threats",
    "description": "G7 foreign ministers meet in Canada Wednesday to discuss moves to halt the Russia-Ukraine war, but US Secretary of State Marco Rubio shrugged off questions about a prospective American takeover of the host country.",
    "link": "https://www.ibtimes.com/ukraine-truce-dominates-g7-talks-clouded-trumps-canada-threats-3766068",
    "timestamp": "2025-03-12T17:00:21Z"
  },
  {
    "title": "The 5 at 5: Wednesday",
    "description": "Five of the biggest news stories of the day – at five o’clock",
    "link": "https://www.thejournal.ie/5-at-5-march-12-6647444-Mar2025/",
    "timestamp": "2025-03-12T17:00:15Z"
  },
  {
    "title": "Retaliation, eh. Canada to impose 25% tariffs on about $30b of U.S.-made goods",
    "description": "Ottawa retaliated for Donald Trump’s 25% tariffs on steel and aluminum imported from Canada with a levy of the same amount on $29.8 billion of goods brought in from the United States, Finance Minister Dominic LeBlanc said.Read more...",
    "link": "https://qz.com/trump-tariffs-canada-us-aluminum-steel-eu-trade-war-1851769403",
    "timestamp": "2025-03-12T17:00:00Z"
  },
  {
    "title": "Government Shutdown Still Looming: How Your Taxes Might Suffer",
    "description": "The House passed a measure to keep the government funded, but the shutdown threat is still present as the bill moves to the Senate.",
    "link": "https://www.cnet.com/personal-finance/taxes/government-shutdown-still-looming-how-your-taxes-might-suffer/",
    "timestamp": "2025-03-12T17:00:00Z"
  },
  {
    "title": "MSNBC’s Nicolle Wallace rips Press Secretary Karoline Leavitt over tariffs: ‘Either tragically uninformed or lying’",
    "description": "Wallace's comments came in response to a heated exchange at a White House press briefing in which Leavitt clashed with AP journalist Josh Boak.",
    "link": "https://nypost.com/2025/03/12/media/msnbcs-nicolle-wallace-slams-karoline-leavitt-over-tariffs/",
    "timestamp": "2025-03-12T16:59:47Z"
  },
  {
    "title": "Senate Republicans to Huddle with Trump on Taxes",
    "description": "\"Senate Finance Committee Republicans will meet with President Donald Trump at the White House on Thursday to discuss the path forward for crafting legislation to enact broad swaths of the administration's domestic agenda,\" Politico reports.",
    "link": "https://politicalwire.com/2025/03/12/trump-to-discuss-tax-cuts-with-senate-republicans/",
    "timestamp": "2025-03-12T16:59:24Z"
  },
  {
    "title": "After 50% layoffs in Department of Education, here’s who Donald Trump’s government is targeting for layoffs",
    "description": "The aggressive cuts under Trump’s Government Layoffs reflect a dramatic shift in federal workforce strategy.",
    "link": "https://economictimes.indiatimes.com/news/international/us/after-50-layoffs-in-department-of-education-heres-who-donald-trumps-government-is-targeting-for-layoffs/articleshow/118943935.cms",
    "timestamp": "2025-03-12T16:58:56Z"
  },
  {
    "title": "Donald Trump's Chances of Winning a Third Term—Hypothetical Poll",
    "description": "More than two in five voters would vote for Donald Trump for a third term, a new poll shows.\nWhy It Matters\nWhile a third term for Donald Trump is constitutionally impossible under the 22nd Amendment, the fact that a significant portion of voters would suppor…",
    "link": "https://biztoc.com/x/f5b552818b272805",
    "timestamp": "2025-03-12T16:58:27Z"
  },
  {
    "title": "Crypto ETFs Likely Won't Be Approved Until New SEC Chair Is Sworn In",
    "description": "President Donald Trump named Paul Atkins as his pick to lead the agency but no hearing has been scheduled yet to confirm him.",
    "link": "https://www.coindesk.com/policy/2025/03/12/xrp-sol-doge-etfs-likely-won-t-be-approved-until-new-sec-chair-is-sworn-in",
    "timestamp": "2025-03-12T16:58:16Z"
  },
  {
    "title": "TSMC Approaches Nvidia, AMD & Broadcom For Intel Chip Venture: Report",
    "description": "TSMC, the world's leading chipmaker, was asked by the Trump administration to bolster Intel's production capabilities.",
    "link": "https://hiphopwired.com/2645155/tsmc-nvidia-amd-broadcom-intel-chip-venture/",
    "timestamp": "2025-03-12T16:57:36Z"
  },
  {
    "title": "Trump Is Still Trying to Undermine Elections",
    "description": "Now that Trump has installed election deniers throughout his Administration, he has been busy dismantling the guardrails protecting voting and voters.",
    "link": "https://www.newyorker.com/news/the-lede/trump-is-still-trying-to-undermine-elections",
    "timestamp": "2025-03-12T16:57:14Z"
  },
  {
    "title": "Asset Management Giant VanEck Files for Avalanche (AVAX) ETF in Delaware",
    "description": "The global investment management giant VanEck has filed for a new Avalanche (AVAX) exchange-traded fund (ETF) in the US. Documents submitted to the state of Delaware this week hint at the new possible ETF, which presumably would be tied to the price of the Et…",
    "link": "https://dailyhodl.com/2025/03/12/asset-management-giant-vaneck-files-for-avalanche-avax-etf-in-delaware/",
    "timestamp": "2025-03-12T16:55:18Z"
  },
  {
    "title": "Why a law firm says Trump’s order against it ‘presents a clear and present danger’",
    "description": "Law firm Perkins Coie says in a lawsuit that Donald Trump's executive order against the firm represents an “unconstitutional assault” not only on the firm but on the legal profession and the rule of law.",
    "link": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/donald-trump-executive-order-perkins-coie-rcna196030",
    "timestamp": "2025-03-12T16:55:07Z"
  },
  {
    "title": "Pressed to accept a ceasefire in Ukraine, Putin seems likely to seek his own conditions",
    "description": "Ukraine’s consent to a 30-day ceasefire proposal has handed the Kremlin a difficult challenge at a time when its military has an upper hand in the war",
    "link": "https://abcnews.go.com/International/wireStory/pressed-accept-ceasefire-ukraine-putin-seek-conditions-119720705",
    "timestamp": "2025-03-12T16:54:15Z"
  },
  {
    "title": "Egg Prices: 10% Jump Last Month Amid Bird Flu Outbreak—Here’s What To Know",
    "description": "The Department of Agriculture warned egg prices may increase more than 40% this year.",
    "link": "https://www.forbes.com/sites/mollybohannon/2025/03/12/egg-prices-10-jump-last-month-amid-bird-flu-outbreak/",
    "timestamp": "2025-03-12T16:53:58Z"
  },
  {
    "title": "Trump to nominate Michelle Bowman for Fed's top bank cop, White House official says",
    "description": "US President Donald Trump is set to nominate Federal Reserve Governor Michelle Bowman as vice chair for supervision, replacing Michael Barr. A former community banker, Bowman is expected to oppose excessive bank regulations, aligning with her previous critici…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/trump-to-nominate-michelle-bowman-for-feds-top-bank-cop-white-house-official-says/articleshow/118943964.cms",
    "timestamp": "2025-03-12T16:53:54Z"
  },
  {
    "title": "Immigration Accounts for Entire US Population Growth for First Time: Survey",
    "description": "Amid declining birth rates among American-born families, immigrants are driving the United States' growth.",
    "link": "https://www.newsweek.com/us-immigrant-population-growth-birth-rate-2043627",
    "timestamp": "2025-03-12T16:53:45Z"
  },
  {
    "title": "ICE arrests over 32,000 migrants in US illegally in 1st 50 days",
    "description": "ICE has arrested over 32,000 migrants who are living in the United States without legal status since Jan. 21, according to Department of Homeland Security officials.",
    "link": "https://abcnews.go.com/Politics/ice-arrests-32000-migrants-us-illegally-1st-50/story?id=119719975",
    "timestamp": "2025-03-12T16:53:35Z"
  },
  {
    "title": "Trump’s 25 percent tariffs on all steel and aluminum imports go into effect, raising fears of economic slowdown",
    "description": "Trump has promised the taxes will help create U.S. factory jobs when his seesawing tariff threats are jolting the stock market and raising fears of an economic slowdown.",
    "link": "https://www.pbs.org/newshour/politics/trumps-25-percent-tariffs-on-all-steel-and-aluminum-imports-go-into-effect-raising-fears-of-economic-slowdown",
    "timestamp": "2025-03-12T16:53:31Z"
  },
  {
    "title": "New poll flashes warning sign on a top issue for Trump during campaign",
    "description": "New polling indicates Americans are not thrilled with the job President Donald Trump is doing on the economy amid fears of recession and his tariffs on key trading partners.",
    "link": "https://www.foxnews.com/politics/new-poll-flashes-warning-sign-top-issue-trump-during-campaign",
    "timestamp": "2025-03-12T16:51:10Z"
  }
]