[
  {
    "title": "IDF issues warnings to Houthis with no attack after Yemen fires twice in one day",
    "description": "The warning was sent at 9:45 a.m. on Wednesday, following a similar warning against the Houthis on Sunday, in which the IDF also did not actually attack.",
    "link": "https://www.jpost.com/israel-news/defense-news/article-853994",
    "timestamp": "2025-05-14T17:48:35Z"
  },
  {
    "title": "Explainer: How War And Sanctions Decimated Syria's Economy",
    "description": "U.S. President Donald Trump has said he will lift longstanding sanctions on Syria that severed the country from the global financial",
    "link": "https://www.ndtv.com/world-news/explainer-syrias-economy-the-devastating-impact-of-war-and-sanctions-8415049",
    "timestamp": "2025-05-14T17:48:24Z"
  },
  {
    "title": "Exclusive-Microsoft's Office-Teams offer will likely stave off EU antitrust fine, sources say",
    "description": "BRUSSELS : Microsoft is set to stave off a possible hefty antitrust fine as EU regulators are likely to accept an offer on its Office and Teams products, three people familiar with the matter said on Wednesday, amid tensions with the United States over the EU…",
    "link": "https://www.channelnewsasia.com/business/exclusive-microsofts-office-teams-offer-will-likely-stave-eu-antitrust-fine-sources-say-5130381",
    "timestamp": "2025-05-14T17:47:41Z"
  },
  {
    "title": "‘Another win for America’: Trump announces economic pact with Qatar worth $1.2 TRILLION",
    "description": "Deals to involve jetliners, LNG production, drones, hotels and more",
    "link": "https://www.wnd.com/2025/05/another-win-for-america-trump-announces-economic-pact-with-qatar-worth-1-2-trillion/",
    "timestamp": "2025-05-14T17:47:03Z"
  },
  {
    "title": "Buttigieg returns to Iowa with anti-Trump message and demands Democrats make their agenda clear",
    "description": "Pete Buttigieg returned to Iowa with some messages about what’s changed since he ran in the state’s 2020 Democratic presidential caucuses.",
    "link": "https://www.pbs.org/newshour/politics/buttigieg-returns-to-iowa-with-anti-trump-message-and-demands-democrats-make-their-agenda-clear",
    "timestamp": "2025-05-14T17:45:38Z"
  },
  {
    "title": "Merz vows to build the strongest army in Europe and revitalise Germany’s fortunes",
    "description": "Armed forces will get ‘all the financial resources required’, new chancellor tells German parliament",
    "link": "https://www.irishtimes.com/world/europe/2025/05/14/merz-vows-to-build-the-strongest-army-in-europe-and-revitalise-germanys-fortunes/",
    "timestamp": "2025-05-14T17:45:27Z"
  },
  {
    "title": "Gaza rescuers say 80 killed in Israeli strikes amid hostage release talks",
    "description": "GAZA CITY (PALESTINIAN TERRITORIES) - Gaza rescuers said at least 80 people were killed in Israeli bombardment across the Palestinian territory on Wednesday, as Israeli Prime Minister Benjamin Netanyahu spoke to US envoy Steve Witkoff about the release of hos…",
    "link": "https://www.bangkokpost.com/world/3025720/gaza-rescuers-say-80-killed-in-israeli-strikes-amid-hostage-release-talks",
    "timestamp": "2025-05-14T17:45:00Z"
  },
  {
    "title": "Trump Lashes Out When Asked About Chuck Schumer Demanding Probe Into $400M Plane",
    "description": "Trump lashed out over Senate Minority Leader Chuck Schumer's (D-NY) demand for an investigation into the controversial multimillion-dollar gift from Qatar.\nThe post Trump Lashes Out When Asked About Chuck Schumer Demanding Probe Into $400M Plane first appeare…",
    "link": "https://www.mediaite.com/news/trump-lashes-out-when-asked-about-chuck-schumer-demanding-probe-into-400m-plane/",
    "timestamp": "2025-05-14T17:43:34Z"
  },
  {
    "title": "Air Force One: Trump's Billion Dollar 'Boondoggle' Explained",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nQatar's proposed \"gift\" of a jumbo jet to Air Force One has added a new twist to a multi-billion-dollar saga that began in 2018, when Boeing agreed with President Donald Trump to deliver two new presidential a…",
    "link": "https://biztoc.com/x/c2931afa423e72a3",
    "timestamp": "2025-05-14T17:41:15Z"
  },
  {
    "title": "Trump touts 'record' Boeing-Qatar Airways deal",
    "description": "Trump touts 'record' Boeing-Qatar Airways deal\nQatar Airways has agreed to buy up to 210 jets from American manufacturing giant Boeing, according to US President Donald Trump, who announced the $96bn order as part of his tour of the Middle East.\nThe White Hou…",
    "link": "https://biztoc.com/x/893d9d5c522db6c3",
    "timestamp": "2025-05-14T17:41:09Z"
  },
  {
    "title": "Boeing Stock Hits 52-Week High After Qatar Airways Agrees To Buy 160 Jets",
    "description": "The agreement comes as Qatar offered to donate a $400 million 747-8 jumbo jet for President Donald Trump to use as a temporary Air Force One.",
    "link": "https://www.forbes.com/sites/antoniopequenoiv/2025/05/14/boeing-stock-hits-52-week-high-after-qatar-airways-agrees-to-buy-160-jets/",
    "timestamp": "2025-05-14T17:40:36Z"
  },
  {
    "title": "Trump's $1.2T economic deal with Qatar",
    "description": "Record-setting aerospace and defense agreements mark deepening economic ties with Gulf state linked to Hamas.",
    "link": "https://www.israelnationalnews.com/news/408374",
    "timestamp": "2025-05-14T17:40:30Z"
  },
  {
    "title": "Newsom proposes curbing immigrant health coverage over costs",
    "description": "The decision being announced Wednesday is driven by state budget challenges. Newsom's office says the proposal could save the state $5.4 billion by 2029.",
    "link": "https://www.kpbs.org/news/politics/2025/05/14/newsom-proposes-curbing-immigrant-health-coverage-over-costs",
    "timestamp": "2025-05-14T17:39:50Z"
  },
  {
    "title": "Newsom proposes freeze on allowing adult illegal immigrants to join California's Medicaid program",
    "description": "California Gov. Gavin Newsom, a Democrat, is proposing freezing undocumented adult enrollment in full-scope Medi-Cal, the state's Medicaid program.",
    "link": "https://www.foxnews.com/politics/newsom-proposes-freeze-allowing-adult-illegal-immigrants-join-californias-medicaid-program",
    "timestamp": "2025-05-14T17:39:50Z"
  },
  {
    "title": "Trump marvels at wealth of Arab hosts while he eyes White House, Air Force One upgrades",
    "description": "Donald Trump's trip to the Middle East revealed his admiration for the lavish lifestyles of Arab leaders. He praised the palaces and planes of his hosts. Trump expressed envy over his older Air Force One. He even considered accepting a donated plane from Qata…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-marvels-at-wealth-of-arab-hosts-while-he-eyes-white-house-air-force-one-upgrades/articleshow/121169378.cms",
    "timestamp": "2025-05-14T17:39:33Z"
  },
  {
    "title": "Cybertrucks escorted Trump through the streets of Doha after his arrival in Qatar",
    "description": "Following a red carpet landing in Qatar, Trump's motorcade was escorted by  Cybertrucks through Doha.",
    "link": "https://www.businessinsider.com/trump-escorted-cybertruck-motorcade-qatar-2025-5",
    "timestamp": "2025-05-14T17:38:59Z"
  },
  {
    "title": "2-Year-Old Girl Separated From Parents In US Deportation Returns To Venezuela",
    "description": "A two-year-old girl separated in the United States from her Venezuelan parents, who were deported without her, arrived in Caracas on Wednesday after her separation from her family caused an outcry.",
    "link": "https://www.ndtv.com/world-news/maikelys-antonella-espinoza-bernal-donald-trump-2-year-old-girl-separated-from-parents-in-us-deportation-case-returns-to-venezuela-8415193",
    "timestamp": "2025-05-14T17:38:50Z"
  },
  {
    "title": "Pete Buttigieg rips Trump’s Veterans Affairs cuts & defends trans troops in Iowa town hall",
    "description": "For a man who passed on running for U.S. Senate or governor of Michigan, the Democratic Party’s often-described best communicator is garnering a lot of attention.",
    "link": "https://www.advocate.com/politics/pete-buttigieg-iowa-town-hall",
    "timestamp": "2025-05-14T17:38:07Z"
  },
  {
    "title": "Cannes Day 1: Quentin Tarantino Drops the Mic",
    "description": "Plus: The fashion police claim their first victim and Robert De Niro speaks out against Trump\nThe post Cannes Day 1: Quentin Tarantino Drops the Mic appeared first on TheWrap.",
    "link": "https://www.thewrap.com/cannes-2025-day-1-recap-quentin-tarantino-robert-de-niro/",
    "timestamp": "2025-05-14T17:37:45Z"
  },
  {
    "title": "ROOKE: Republican Lawmakers Must Think Their Voters Are Really, Really Dumb",
    "description": "Republicans have allowed Democrats to take a victory lap on President Donald Trump's first days in office.",
    "link": "https://dailycaller.com/2025/05/14/rooke-republican-lawmakers-trump-voter-agenda/",
    "timestamp": "2025-05-14T17:36:43Z"
  },
  {
    "title": "White Plight: Trump’s Embrace of White South African ‘Refugees’ Is a Racist Bullhorn",
    "description": "This week, Afrikaner “refugees” began arriving in the U.S.—some of the only refugees welcomed by the Trump administration. These white South Africans claim they are being persecuted at home: That white farmers are being attacked; that South Africa is not a sa…",
    "link": "https://msmagazine.com/2025/05/14/trump-musk-south-african-refugees-white-violence-farm-afrikaner/",
    "timestamp": "2025-05-14T17:36:25Z"
  },
  {
    "title": "Top House Dems say they'll join GOP to quash Trump impeachment effort",
    "description": "House Democratic leaders are signaling they are against a push to rush an impeachment effort against President Donald Trump.",
    "link": "https://www.foxnews.com/politics/top-house-dems-say-theyll-join-gop-quash-trump-impeachment-effort",
    "timestamp": "2025-05-14T17:36:03Z"
  },
  {
    "title": "The Republican squirm is in full swing (Aaron Blake/Washington Post)",
    "description": "Aaron Blake / Washington Post:\nThe Republican squirm is in full swing  —  Amid a series of extraordinary Trump gambits in recent days, Republicans are straining — hard — to avoid passing judgment.  —  In some ways, it seems President Donald Trump's goal in li…",
    "link": "https://www.memeorandum.com/250514/p101",
    "timestamp": "2025-05-14T17:35:01Z"
  },
  {
    "title": "Gold Declines as Growing Trade Optimism Hurts Haven Demand",
    "description": "(Bloomberg) -- Gold slipped to the lowest in more than a month as tension eased in the global trade war, pushing investors away from haven demand. Most Read ...",
    "link": "https://finance.yahoo.com/news/gold-drops-traders-reassess-havens-055145859.html",
    "timestamp": "2025-05-14T17:34:29Z"
  },
  {
    "title": "Trump touts 'record' Boeing-Qatar Airways deal",
    "description": "The commitment from the state-owned airline comes as Boeing pushes to rebuild its business.",
    "link": "https://www.bbc.com/news/articles/cpqe93rz5qvo",
    "timestamp": "2025-05-14T17:34:17Z"
  },
  {
    "title": "Centrist prompts laughter when she compares Trump's Qatari plane to getting a free puppy",
    "description": "A centrist commentator from Andrew Yang's Forward Party prompted laughter when she compared a $400 million plane Qatar is gifting to President Donald Trump with a puppy that former President George W. Bush received. It was reported recently that Trump would r…",
    "link": "https://www.rawstory.com/trump-qatar-plane-2672018501/",
    "timestamp": "2025-05-14T17:34:16Z"
  },
  {
    "title": "Tariffs Drive Smartphone Manufacturers to Boost US Inventory, Shift Sourcing to India",
    "description": "United States smartphone shipments leaped 30% year over year in March as manufacturers raced to bring new inventory into the country ahead of the tariffs that were anticipated and then announced by the President Donald Trump administration April 2. The increa…",
    "link": "https://www.pymnts.com/supply-chain/2025/tariffs-drive-smartphone-manufacturers-boost-united-states-inventory-shift-sourcing-india/",
    "timestamp": "2025-05-14T17:33:50Z"
  },
  {
    "title": "What lifting sanctions on Syria could mean for the war-torn country",
    "description": "President Trump’s announcement that the U.S. will ease sanctions on Syria could eventually facilitate the country’s recovery from years of civil war and transform the lives of everyday Syrians.",
    "link": "https://www.pbs.org/newshour/world/what-lifting-sanctions-on-syria-could-mean-for-the-war-torn-country",
    "timestamp": "2025-05-14T17:32:55Z"
  },
  {
    "title": "Air Force One: Trump's Billion Dollar 'Boondoggle' Explained",
    "description": "Qatar's offer of a jumbo jet to Air Force One has renewed anger around the Boeing deal signed by Trump in 2018.",
    "link": "https://www.newsweek.com/air-force-one-trump-billion-dollar-boondoggle-explained-2072144",
    "timestamp": "2025-05-14T17:32:26Z"
  },
  {
    "title": "Does Pete Rose deserve to be in the Hall of Fame? It’s complicated",
    "description": "Major League Baseball Commissioner Rob Manfred announced that he reinstated former player and manager Pete Rose's eligibility for baseball's Hall of Fame.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/pete-rose-hall-of-fame-mlb-baseball-banned-list-rcna206703",
    "timestamp": "2025-05-14T17:31:22Z"
  },
  {
    "title": "Trump Sets Tone For Middle East Tour: Morality Is God's Job, Mine Is America First",
    "description": "At a U.S.-Saudi investment forum in Riyadh, in the presence of Saudi Crown Prince Mohammed bin Salman, U.S. President Donald Trump delivered a striking defense of his foreign policy vision, rejecting moral crusades in favor of hard-nosed realism. Senator J.D.…",
    "link": "https://biztoc.com/x/a3609b2b1926c424",
    "timestamp": "2025-05-14T17:30:14Z"
  },
  {
    "title": "They stormed the Capitol. Now they're selling merch. (Washington Post)",
    "description": "Washington Post:\nThey stormed the Capitol.  Now they're selling merch.  —  Pardoned by President Donald Trump, many Jan. 6 rioters are working to capitalize on the attention through podcasts, speaking tours and self-branded merchandise.  —  A man convicted of…",
    "link": "https://www.memeorandum.com/250514/p100",
    "timestamp": "2025-05-14T17:30:00Z"
  },
  {
    "title": "Chinese businesses view tariff pause with caution and uncertainty",
    "description": "By HUIZHONG WU\nBANGKOK (AP) — While U.S. President Donald Trump has talked of victory after reaching a weekend deal with China to reduce the sky-high tariffs levied on each others’ goods, businesses in China are reacting to the temporary deal with caution.\nRe…",
    "link": "https://biztoc.com/x/731bed530926db81",
    "timestamp": "2025-05-14T17:30:00Z"
  },
  {
    "title": "Trump tours the Middle East looking for investment deals",
    "description": "Why Trump's Middle East trip is different this time\nPresident Donald Trump is back in the Middle East, meeting with leaders from multiple countries — including Saudi Arabia's crown prince, Mohammed bin Salman, who reaffirmed his support for a massive investme…",
    "link": "https://biztoc.com/x/1b97c009424a3813",
    "timestamp": "2025-05-14T17:29:57Z"
  },
  {
    "title": "Three Fascism Experts on Why They’re Leaving the US",
    "description": "At the end of March, I posted some news about three prominent scholars of fascism and authoritarianism who were leaving the Unit",
    "link": "https://kottke.org/25/05/three-fascism-experts-on-why-theyre-leaving-the-us",
    "timestamp": "2025-05-14T17:28:28Z"
  },
  {
    "title": "Ryan Routh, charged with trying to assassinate Trump, asks to have charges dropped",
    "description": "Ryan Routh is accused of the 2024 assassination attempt of Donald Trump as the then-presidential candidate was golfing at his course in West Palm Beach, Fla. Routh has pleaded not guilty.",
    "link": "https://www.npr.org/2025/05/14/nx-s1-5398066/ryan-routh-assassination-court-hearing-donald-trump",
    "timestamp": "2025-05-14T17:28:26Z"
  },
  {
    "title": "Siemens Healthineers relocates Varian’s Mexico manufacturing to the US",
    "description": "The German multinational joins the long list of companies boosting US manufacturing to counter Trump’s tariffs.",
    "link": "https://www.medicaldevice-network.com/news/siemens-healthineers-relocates-varians-mexico-manufacturing-to-the-us/",
    "timestamp": "2025-05-14T17:28:11Z"
  },
  {
    "title": "CRTC kicks off CanCon hearing as big streamers cancel appearances",
    "description": "OTTAWA — The CRTC launched a hearing on drafting a new definition for Canadian content Wednesday, but three big American streaming companies dropped off the schedule at the last minute. The Motion Picture Association-Canada, which represents a number of big s…",
    "link": "https://financialpost.com/pmn/crtc-kicks-off-cancon-hearing-as-big-streamers-cancel-appearances",
    "timestamp": "2025-05-14T17:26:12Z"
  },
  {
    "title": "What to know about this week’s possible talks in Istanbul to end Russia’s war in Ukraine",
    "description": "All eyes are turning back to Istanbul to seek an end to Russia’s 3-year-old, full-scale invasion of Ukraine.",
    "link": "https://www.pbs.org/newshour/world/what-to-know-about-this-weeks-possible-talks-in-istanbul-to-end-russias-war-in-ukraine",
    "timestamp": "2025-05-14T17:25:29Z"
  },
  {
    "title": "Team Kamala’s Latest Excuse Is Their Most Delusional Yet",
    "description": "Since the loss to Trump, Team Kamala has searched and searched for the perfect excuse to explain away their candidate and party's failure in the 2024 election.",
    "link": "https://dailycaller.com/2025/05/14/kamala-harris-joe-biden-election-drop-out-original-sin-book/",
    "timestamp": "2025-05-14T17:24:33Z"
  },
  {
    "title": "Boeing gets its biggest 787 jet order ever from Qatar Airways, the White House says",
    "description": "Boeing (BA) secured a massive deal to manufacture planes for Qatar Airways, according to the White House.Read more...",
    "link": "https://qz.com/boeing-qatar-airways-210-planes-trump-1851780678",
    "timestamp": "2025-05-14T17:24:00Z"
  },
  {
    "title": "Trump’s embrace of Syria and its jihadist-turned-president could shake up the Middle East",
    "description": "US President Donald Trump on Wednesday had tea with a former jihadist who until recently had a $10 million US bounty on his head. Interim Syrian President Ahmed al-Sharaa, once known by his militant nom de guerre Abu Mohammed al-Jolani, met Trump in Riyadh si…",
    "link": "https://freerepublic.com/focus/f-news/4316964/posts",
    "timestamp": "2025-05-14T17:23:18Z"
  },
  {
    "title": "Pakistan was forced to call for ceasefire – Indian ambassador",
    "description": "Vinay Kumar has told RT that India responded to every attempt at escalation by Pakistan Read Full Article at RT.com",
    "link": "https://www.rt.com/news/617516-india-forced-pakistan-ceasefire/",
    "timestamp": "2025-05-14T17:21:42Z"
  },
  {
    "title": "Seeking something new, Airbnb CEO promises 'perfect concierge'",
    "description": "\"Novelty is cool. It's exciting. I want to be new (and) fresh,\" Airbnb CEO Brian Chesky told AFP in Los Angeles, where he is presenting a new offering that could bring haircuts and other services into your holiday home.",
    "link": "https://techxplore.com/news/2025-05-airbnb-ceo-concierge.html",
    "timestamp": "2025-05-14T17:20:47Z"
  },
  {
    "title": "The Episcopal Church Takes a Shocking Stand On Trump's Resettling of White South Africans",
    "description": "Photo: Chip Somodevilla (Getty Images)\r\nBlack folks aren’t the only ones offended by President Donald Trump’s move to welcome dozens of white South Africans into the country. The Episcopal Church is now refusing to comply with his orders, and as a consequence…",
    "link": "https://www.theroot.com/the-episcopal-church-takes-a-shocking-stand-on-trumps-r-1851780651",
    "timestamp": "2025-05-14T17:20:00Z"
  },
  {
    "title": "Some Michigan tourism spots worry about Trump tariff toll on summer travel",
    "description": "As Michigan prepares for another summer travel season, one thing is increasingly clear: President Donald Trump’s tariffs and border detention issues are sparking backlash that could reduce international visits to the United States — and deepening concerns tha…",
    "link": "https://biztoc.com/x/205bdfd89146029c",
    "timestamp": "2025-05-14T17:19:17Z"
  },
  {
    "title": "Don't fall for claims Al Gore accepted $90M luxury jet from the Sultan of Kuwait",
    "description": "The rumor originated from a website known for baiting conservative readers with false headlines.",
    "link": "https://www.snopes.com//fact-check/al-gore-jet/",
    "timestamp": "2025-05-14T17:19:00Z"
  },
  {
    "title": "The Selfish Reason Trump Caved on China Tariffs",
    "description": "The U.S. president’s sudden aboutface on Chinese tariffs didn’t happen because he thought it was a strong economic idea, but rather because it would hurt “Trump’s people.”\r\nOver the course of April, White House Chief of Staff Susie Wiles, Treasury Secretary S…",
    "link": "https://newrepublic.com/post/195250/donald-trump-caved-china-tariffs",
    "timestamp": "2025-05-14T17:18:56Z"
  },
  {
    "title": "Epstein victim accuses Trump admin of 'ongoing cover-up and extreme lack of transparency'",
    "description": "A survivor of Jeffrey Epstein’s sex assault and sex trafficking is renewing calls for the Trump administration to “release the case files about the disgraced financier,” according to an exclusive Newsweek report\r\n. \n\"Releasing the Epstein files must be an imm…",
    "link": "https://www.rawstory.com/jeffrey-epstein-2672018720/",
    "timestamp": "2025-05-14T17:18:50Z"
  },
  {
    "title": "Top Democrats Demand Treasury Info on Trump’s Crypto Deals, Citing ‘Bribery’ Risks",
    "description": "The request marks an escalation in Congressional scrutiny on whether the President and his entourage are abusing their positions to benefit their crypto businesses.",
    "link": "https://www.coindesk.com/policy/2025/05/14/top-democrats-demand-treasury-info-on-trumps-crypto-deals-citing-bribery-risks",
    "timestamp": "2025-05-14T17:18:21Z"
  },
  {
    "title": "Trump tours the Middle East looking for investment deals",
    "description": "Donald Trump is back in the Middle East,  but this trip looks different from 2017, with low oil prices and Gulf states prioritizing domestic projects.",
    "link": "https://www.businessinsider.com/why-trump-middle-east-trip-is-different-this-time-2025-5",
    "timestamp": "2025-05-14T17:18:05Z"
  },
  {
    "title": "Rock Band Cancels Tour After U.S. Border Patrol Detains Drummer",
    "description": "Psych-rock band Lord Buffalo were forced to cancel their European tour after U.S. Border Patrol agents removed drummer Yamal Said from their flight in May 2025.",
    "link": "https://loudwire.com/lord-buffalo-cancel-tour-border-patrol-drummer/",
    "timestamp": "2025-05-14T17:14:42Z"
  },
  {
    "title": "China invites UK to its AI summit",
    "description": "Offer to come along to July gathering comes amid on-off relationship between Beijing and London.",
    "link": "https://www.politico.eu/article/uk-invited-china-ai-summit-shangai-trade-war/",
    "timestamp": "2025-05-14T17:14:32Z"
  },
  {
    "title": "Rights groups say migrant workers are dying on Saudi job sites as kingdom prepares for World Cup",
    "description": "Rights groups warn of thousands more avoidable deaths in the coming years.",
    "link": "https://www.bostonherald.com/2025/05/14/saudi-arabia-migrant-workers/",
    "timestamp": "2025-05-14T17:14:29Z"
  },
  {
    "title": "Chinese businesses view tariff pause with caution and uncertainty",
    "description": "Businesses are eager to get back to work with American clients.",
    "link": "https://www.bostonherald.com/2025/05/14/china-us-trade/",
    "timestamp": "2025-05-14T17:14:24Z"
  },
  {
    "title": "Toddler separated from parents in US deportation case returns to Venezuela",
    "description": "A two-year-old girl separated in the United States from her Venezuelan parents, who were deported without her, arrived in Caracas on Wednesday after her separation from her family caused an outcry. “Welcome, Maikelys,” First Lady Cilia Flores said as she took…",
    "link": "https://www.digitaljournal.com/world/toddler-separated-from-parents-in-us-deportation-case-returns-to-venezuela/article",
    "timestamp": "2025-05-14T17:12:20Z"
  },
  {
    "title": "De Niro says Hollywood worried about ‘wrath of Trump’",
    "description": "Robert De Niro told AFP Wednesday that many in Hollywood share his views on US President Donald Trump — whom he denounced at the Cannes film festival opening — but the industry is worried about speaking out against him. The 81-year-old, one of the most outspo…",
    "link": "https://www.digitaljournal.com/world/de-niro-says-hollywood-worried-about-wrath-of-trump/article",
    "timestamp": "2025-05-14T17:12:20Z"
  },
  {
    "title": "Toddler Separated From Parents In US Deportation Case Returns To Venezuela",
    "description": "A two-year-old girl separated in the United States from her Venezuelan parents, who were deported without her, arrived in Caracas on Wednesday after her separation from her family caused an outcry.",
    "link": "https://www.ibtimes.com/toddler-separated-parents-us-deportation-case-returns-venezuela-3773552",
    "timestamp": "2025-05-14T17:12:11Z"
  },
  {
    "title": "'Taxing poor to give to the rich': Leading MAGA Republican hammers own party",
    "description": "Sen. Josh Hawley (R-MO) came down hard on his party for meddling with Medicaid and possibly requiring co-pays for Medicaid recipients seeking medical care.\n\"It's reverse class warfare, is what it is,\" Hawley told CNN's Manu Raju Wednesday. \"It's taxing the po…",
    "link": "https://www.rawstory.com/josh-hawley-medicaid-cuts-2672018626/",
    "timestamp": "2025-05-14T17:12:01Z"
  },
  {
    "title": "State and Local Officials Preparing for Pardon of Derek Chauvin: Report",
    "description": "Minnesota Democrats are talking up the possibility of a pardon for Derek Chauvin and say they are ready to respond if it takes place.",
    "link": "https://www.westernjournal.com/state-local-officials-preparing-pardon-derek-chauvin-report/",
    "timestamp": "2025-05-14T17:11:32Z"
  },
  {
    "title": "Elon Musk Raves About Personal Robots... But Warns They Could Take 'Terminator'-Style Turn",
    "description": "The billionaire acknowledged the upsides and risks of having machine helpers during a trip to Saudi Arabia alongside President Donald Trump.",
    "link": "https://www.huffpost.com/entry/elon-musk-robots-terminator_n_6824adaae4b023f4744f2edf",
    "timestamp": "2025-05-14T17:10:53Z"
  },
  {
    "title": "Dems In Disarray",
    "description": "Democrats are having a hard time separating two things: what they believe and what will get votes. But they shouldn’t be, because the two are closely related. In fact, a Democrat won last night in Omaha by running on what we say we believe. Making a separatio…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/05/dems-in-disarray-6",
    "timestamp": "2025-05-14T17:10:00Z"
  },
  {
    "title": "House Democrat Summer Lee to introduce reparations push for Black Americans",
    "description": "A House Democrat plans to introduce a resolution calling for the U.S. to spend trillions of dollars on reparations for Black Americans this week.",
    "link": "https://nypost.com/2025/05/14/us-news/house-democrat-to-introduce-reparations-push-for-black-americans/",
    "timestamp": "2025-05-14T17:08:39Z"
  },
  {
    "title": "Donald Trump Won't Sign His Own Bill, Josh Hawley Says",
    "description": "Voice is AI-generated. Inconsistencies may occur.\nRepublican Senator Josh Hawley of Missouri said President Donald Trump wouldn't even sign his own \"big, beautiful bill\" as it stands due to GOP House-proposed reductions to Medicaid.\nHawley told CNN's Manu Raj…",
    "link": "https://biztoc.com/x/d2a8263a3def02f6",
    "timestamp": "2025-05-14T17:08:32Z"
  },
  {
    "title": "‘Dumbest F*cking Thing’: Democrats Are Absolutely Furious At Lawmaker Trying To Impeach Trump",
    "description": "Democratic Michigan Rep. Shri Thanedar brought seven articles of impeachment against President Donald Trump to the House floor Tuesday night, forcing the House to vote on them by Thursday and placing him in a precarious position among other Democrats. Thaneda…",
    "link": "https://dailycaller.com/2025/05/14/democrats-furious-shri-thanedar-trump-impeachment/",
    "timestamp": "2025-05-14T17:08:26Z"
  },
  {
    "title": "Two attorneys at a Big Law firm targeted by Trump have lost security clearances",
    "description": "President Donald Trump has signed executive orders targeting legal powerhouses such as Susman Godfrey and WilmerHale.\nAlex Wong/Getty Images\nWilmerHale is one of four firms fighting Donald Trump's executive orders targeting Big Law.\nThe firm's attorney said t…",
    "link": "https://biztoc.com/x/869e8987abe708fa",
    "timestamp": "2025-05-14T17:08:10Z"
  },
  {
    "title": "Sony Could See $680 Million Tariff Impact, Considers Moving PlayStation 5 Production To US",
    "description": "Technology giant and video game company Sony Group Corp (NYSE:SONY) is among the companies that could be hit hard by tariffs on countries such as China and Japan.\nThe company has several ideas on how to offset tariffs from President Donald Trump.\nWhat Happene…",
    "link": "https://biztoc.com/x/54b5ff042020685e",
    "timestamp": "2025-05-14T17:08:01Z"
  },
  {
    "title": "RFK Jr. clashes with Democrat who accused him of ‘destroying’ health agencies",
    "description": "The sharp exchanges came during Kennedy’s testimony before the appropriations panel, his first appearance on Capitol Hill since becoming health secretary.",
    "link": "https://www.bostonglobe.com/2025/05/14/nation/rfk-jr-hhs-senate-hearing/",
    "timestamp": "2025-05-14T17:07:53Z"
  },
  {
    "title": "Democratic congressman pushes articles of impeachment against Trump",
    "description": "Rep. Shri Thanedar, who represents the City of Detroit, says he will move for a vote on articles of impeachment against President Donald Trump.",
    "link": "https://www.fox17online.com/news/national-news/detroit-congressman-pushes-articles-of-impeachment-against-trump-but-colleagues-criticize-it",
    "timestamp": "2025-05-14T17:07:53Z"
  },
  {
    "title": "Mike Johnson Says Approving of Trump Accepting Qatari Gift Is ‘Not My Lane’ – Despite It Being a Congressional Power",
    "description": "House Speaker Mike Johnson (R-LA) straight up told reporters on Wednesday during a Capitol Hill press conference that the “it’s not my lane” to decide whether or not President Donald Trump can or should keep a luxury jet gifted to him by Qatar – despite the C…",
    "link": "https://www.mediaite.com/politics/mike-johnson-says-approving-of-trump-accepting-qatari-gift-is-not-my-lane-despite-it-being-a-congressional-power/",
    "timestamp": "2025-05-14T17:06:25Z"
  },
  {
    "title": "Donald Trump Impeachment Proceedings Launched",
    "description": "Democratic Representative Shri Thanedar on Tuesday moved to force a House vote on his articles of impeachment against President Donald Trump. Thanedar took to the House floor on Tuesday afternoon to notice his seven articles of impeachment as privileged. That…",
    "link": "https://freerepublic.com/focus/f-news/4316962/posts",
    "timestamp": "2025-05-14T17:05:53Z"
  },
  {
    "title": "Banks are sitting on $500 billion in unrealized losses, and stagflation could cause another Silicon Valley Bank-like crisis",
    "description": "As long as interest rates remain elevated, lenders could be at risk if depositors get spooked.",
    "link": "https://finance.yahoo.com/news/banks-sitting-500-billion-unrealized-170516440.html",
    "timestamp": "2025-05-14T17:05:16Z"
  },
  {
    "title": "Texan psych-Americana band Lord Buffalo forced to cancel European tour after Mexican drummer Yamal Said is \"forcibly removed\" from flight by US Customs and Border Protection officers",
    "description": "Lord Buffalo: \"We are devastated to cancel this tour, but we are focusing all of our energy and resources on Yamal’s safety and freedom\"",
    "link": "https://www.loudersound.com/news/lord-buffalo-cancel-european-tour-after-drummer-forcibly-removed-from-flight",
    "timestamp": "2025-05-14T17:05:02Z"
  },
  {
    "title": "White House bans U.S. agencies from all work on G-20 in South Africa (Washington Post)",
    "description": "Washington Post:\nWhite House bans U.S. agencies from all work on G-20 in South Africa  —  President Donald Trump previously suggested a boycott of the G-20 convention over South Africa's “land confiscation” law.  —  The White House National Security Council h…",
    "link": "https://www.memeorandum.com/250514/p93",
    "timestamp": "2025-05-14T17:05:01Z"
  },
  {
    "title": "Violent Threats Against US Judges Are Skyrocketing Online",
    "description": "Threatening social media posts targeting US judges have increased by more than 300 percent since last year, a new report shows.",
    "link": "https://www.wired.com/story/violent-threats-us-judges-increase-online/",
    "timestamp": "2025-05-14T17:04:55Z"
  },
  {
    "title": "GOP Advances 'Nonprofit Killer' Provision in Budget Bill to 'Crush Dissent'",
    "description": "Free press, civil liberties, and community groups on Wednesday sounded the alarm after House Republicans added a provision in their budget reconciliation package that would empower U.S. President Donald Trump's administration to revoke the tax-exempt status o…",
    "link": "https://www.commondreams.org/news/nonprofit-killer-advances",
    "timestamp": "2025-05-14T17:04:16Z"
  },
  {
    "title": "Germany’s Pistorius warns draft may return if troop numbers fall short",
    "description": "Restoring conscription would mark a major policy shift.",
    "link": "https://www.politico.eu/article/germanys-pistorius-warns-military-draft-may-return-if-troops-fall-short/",
    "timestamp": "2025-05-14T17:04:02Z"
  },
  {
    "title": "Trump’s Aid Freeze Is Undermining His Immigration Policy",
    "description": "Colombia relied on U.S. funding to support Venezuelan migrants. Now, many are on the brink of survival.",
    "link": "http://foreignpolicy.com/2025/05/14/us-aid-cuts-colombia-venezuela-migrants-trump-immigration/",
    "timestamp": "2025-05-14T17:03:37Z"
  },
  {
    "title": "RFK Jr.: ‘I Don’t Think People Should Be Taking Medical Advice From Me’",
    "description": "Robert F. Kennedy Jr., the head of the Department of Health and Human Services, said during a hearing that he is not qualified to give medical advice.",
    "link": "http://www.rollingstone.com/politics/politics-news/rfk-jr-medical-advice-1235339307/",
    "timestamp": "2025-05-14T17:03:36Z"
  },
  {
    "title": "Why are Turkey and the PKK turning to peace – and can it last?",
    "description": "There are clear reasons for both the Turkish state and the PKK to come to the negotiating table now.",
    "link": "https://theconversation.com/why-are-turkey-and-the-pkk-turning-to-peace-and-can-it-last-256527",
    "timestamp": "2025-05-14T17:03:09Z"
  },
  {
    "title": "Who is Project 2025 co-author Russ Vought and what is his influence on Trump?",
    "description": "Less well known than Elon Musk, Russ Vought is one of Donald Trump’s right-hand men, and may be stepping up to replace Musk at Doge.",
    "link": "https://theconversation.com/who-is-project-2025-co-author-russ-vought-and-what-is-his-influence-on-trump-255134",
    "timestamp": "2025-05-14T17:03:02Z"
  },
  {
    "title": "China-US trade war: the next 90 days are a big deal for Beijing as it seeks long-term solutions",
    "description": "China is focused on what will happen at the end of the 90-day tariff pause, and what it can get from the US negotiators.",
    "link": "https://theconversation.com/china-us-trade-war-the-next-90-days-are-a-big-deal-for-beijing-as-it-seeks-long-term-solutions-256535",
    "timestamp": "2025-05-14T17:02:58Z"
  },
  {
    "title": "Trump Meets with Syria’s Jihadi President, Offers Dropped Sanctions and Normal Relations",
    "description": "President Donald Trump met with Syria’s interim President Ahmed al-Sharaa in Saudi Arabia on Wednesday, one day after announcing the U.S. would drop sanctions against Syria.\nThe post Trump Meets with Syria’s Jihadi President, Offers Dropped Sanctions and Norm…",
    "link": "https://www.breitbart.com/national-security/2025/05/14/trump-meets-with-syrias-jihadi-president-offers-dropped-sanctions-and-normal-relations/",
    "timestamp": "2025-05-14T17:02:51Z"
  },
  {
    "title": "Trump's Middle East schmooze fest interrupted as ally hurls 'terrorists' accusation",
    "description": "Sen. Josh Hawley (R-MO) leveled serious accusations against a foreign government that offered to give president Donald Trump a luxury airliner for official use.The president has drawn bipartisan criticism for accepting a $400 million Boeing 747-8 \"flying pala…",
    "link": "https://www.rawstory.com/trump-qatar-luxury-jet-hawley/",
    "timestamp": "2025-05-14T17:02:20Z"
  },
  {
    "title": "VIDEOS: Trump Receives Grand Reception as First U.S. President to Officially Visit Qatar",
    "description": "President Donald Trump became the first U.S. president to officially visit Qatar on Wednesday, and he received a grand reception suited to the historic occasion.\nThe post VIDEOS: Trump Receives Grand Reception as First U.S. President to Officially Visit Qatar…",
    "link": "https://www.breitbart.com/politics/2025/05/14/videos-trump-receives-grand-reception-as-first-u-s-president-to-officially-visit-qatar/",
    "timestamp": "2025-05-14T17:02:11Z"
  },
  {
    "title": "US Is Not Negotiating for Weaker Dollar as Part of Tariff Talks",
    "description": "US officials seeking to negotiate trade deals around the world are not working to include currency policy pledges in the agreements, according to a person familiar with the matter.",
    "link": "https://financialpost.com/pmn/business-pmn/us-is-not-negotiating-for-weaker-dollar-as-part-of-tariff-talks",
    "timestamp": "2025-05-14T17:01:23Z"
  },
  {
    "title": "Donald Trump Won't Sign His Own Bill, Josh Hawley Says",
    "description": "The House GOP is working to push Trump's package through committees and opposition from Democrats and even some wary Republicans.",
    "link": "https://www.newsweek.com/donald-trump-wont-sign-his-own-bill-josh-hawley-says-2072267",
    "timestamp": "2025-05-14T17:00:28Z"
  },
  {
    "title": "Sony May Pass PS5 Tariffs Cost on to Customers",
    "description": "Nikkei Asia and The Verge reported that during Sony’s May 14, 2025 Q4 2025 Earnings Conference Report President Donald Trump’s tariffs came up, regarding the potential cost being passed on to customers like new PS5 owners and possibly making the console or ot…",
    "link": "https://www.siliconera.com/sony-may-pass-ps5-tariffs-cost-on-to-customers/",
    "timestamp": "2025-05-14T17:00:00Z"
  },
  {
    "title": "Syria's finance minister says foreign investors welcome after US sanctions move",
    "description": "DAMASCUS (Reuters) - Syrian Finance Minister Yisr Barnieh made a call to global investors on Wednesday to come do business with Syria after U.S. President Donald Trump's surprise announcement that he would lift all of Washington's sanctions on the country. Re…",
    "link": "https://www.thestar.com.my/news/world/2025/05/15/syria039s-finance-minister-says-foreign-investors-welcome-after-us-sanctions-move",
    "timestamp": "2025-05-14T17:00:00Z"
  },
  {
    "title": "‘A Big Deal’: Trump’s Latest EO Targets Regulations That Trap the Unwary",
    "description": "The U.S. is \"drastically overregulated.\" The current Code of Federal Regulations contains \"over 48,000 sections\" and spans \"over 175,000 pages.\"\nThe post ‘A Big Deal’: Trump’s Latest EO Targets Regulations That Trap the Unwary first appeared on Le·gal In·sur·…",
    "link": "https://legalinsurrection.com/2025/05/a-big-deal-trumps-latest-eo-targets-regulations-that-trap-the-unwary/",
    "timestamp": "2025-05-14T17:00:00Z"
  },
  {
    "title": "House Democrat Earns Round of Applause for Torching His Colleague’s ‘Idiotic’ Trump Impeachment Push",
    "description": "Rep. Jerry Nadler earned a round of applause from his colleagues during a meeting of his caucus after he called a Trump impeachment effort \"idiotic.\"\nThe post House Democrat Earns Round of Applause for Torching His Colleague’s ‘Idiotic’ Trump Impeachment Push…",
    "link": "https://www.mediaite.com/news/house-democrat-earns-round-of-applause-for-torching-his-colleagues-idiotic-trump-impeachment-push/",
    "timestamp": "2025-05-14T16:59:41Z"
  },
  {
    "title": "Trump marvels at wealth of his Arab hosts while he eyes White House and Air Force One upgrades",
    "description": "Trump is sounding more than a little envious of his Arab hosts.",
    "link": "https://www.bostonherald.com/2025/05/14/trump-mideast-envy/",
    "timestamp": "2025-05-14T16:59:14Z"
  },
  {
    "title": "The Trumpian Nightmare Must End Before It Gets Worse",
    "description": "We are nearly four months into the Trump administration, but sometimes it feels like the orange man has been president forever. This is because Donald Trump’s second term is a nightmare that keeps getting worse and worse. First, you have the chaos that Trump …",
    "link": "https://www.commondreams.org/opinion/end-the-trump-nightmare",
    "timestamp": "2025-05-14T16:59:03Z"
  },
  {
    "title": "Dem lawmaker seethes RFK Jr's 'legitimacy' as HHS secretary has 'expired' in heated exchange",
    "description": "Rep. Bonnie Watson Coleman, D-N.J., got into a heated exchange with Health and Human Services Secretary Robert F. Kennedy Jr., which ended with the lawmaker saying Kennedy's \"legitimacy\" has expired.",
    "link": "https://www.foxnews.com/politics/dem-lawmaker-seethes-rfk-jrs-legitimacy-hhs-secretary-has-expired-heated-exchange",
    "timestamp": "2025-05-14T16:58:58Z"
  }
]