[
  {
    "title": "Russia Hits Ukraine’s Government Complex Amid Air Barrage",
    "description": "Russian forces struck Ukraine’s main government complex in Kyiv for the first time early Sunday as part of a record drone and missile barrage that killed at least two people.",
    "link": "https://financialpost.com/pmn/business-pmn/russia-hits-ukraines-government-complex-amid-air-barrage",
    "timestamp": "2025-09-07T08:19:25Z"
  },
  {
    "title": "Russia attacks Ukraine with 805 drones in largest attack since war began",
    "description": "Russia has attacked Kyiv with more than 800 drones in the largest aerial bombardment on Ukraine since the war between the two nations began, killing at least two people.",
    "link": "https://www.abc.net.au/news/2025-09-07/russia-attacks-kyiv-ukraine-with-805-drones/105745664",
    "timestamp": "2025-09-07T08:17:08Z"
  },
  {
    "title": "Russia attacks Ukraine with 810 drones in war's largest attack",
    "description": "Russia has attacked Kyiv with more than 800 drones in the largest aerial bombardment on Ukraine since the war between the two nations began, killing at least two people.",
    "link": "https://www.abc.net.au/news/2025-09-07/russia-attacks-kyiv-ukraine-with-810-drones/105745664",
    "timestamp": "2025-09-07T08:17:08Z"
  },
  {
    "title": "Supporters of ex-Brazil president Jair Bolsonaro called to streets ahead of coup trial verdict",
    "description": "The far-right leader risks up to 43 years in prison if convicted of attempting to cling to power after losing 2022 elections to his leftist rival Luiz Inacio Lula da Silva.",
    "link": "https://www.thejournal.ie/supporters-jair-bolsonaro-called-to-streets-ahead-of-coup-trial-verdict-6809828-Sep2025/",
    "timestamp": "2025-09-07T08:09:42Z"
  },
  {
    "title": "Trump Explores Federal Takeover of 9/11 Memorial And Museum, NY Governor Kathy Hochul Calls For Resoring 'Health Care Funding' Instead",
    "description": "The White House confirmed on Friday that preliminary discussions are underway regarding the federal takeover of the 9/11 Memorial and Museum, with the administration exploring whether the federal government can assume control of the Lower Manhattan site.\nPres…",
    "link": "https://biztoc.com/x/4df7d45b428a24d3",
    "timestamp": "2025-09-07T08:06:59Z"
  },
  {
    "title": "US, China to fight crucial battle for global supremacy in Latin America",
    "description": "CommentUS, China to fight crucial battle for global supremacy in Latin America\nBeijing steadily expands presence in what Washington considers its backyard\nChinese President Xi Jinping and U.S. President Donald Trump. Latin America is turning into a crucial th…",
    "link": "https://biztoc.com/x/c6c3ea5429c8d916",
    "timestamp": "2025-09-07T08:06:49Z"
  },
  {
    "title": "No. 1 Jannik Sinner faces No. 2 Carlos Alcaraz in the US Open final. President Trump is expected",
    "description": "There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final",
    "link": "https://abcnews.go.com/US/wireStory/1-jannik-sinner-faces-2-carlos-alcaraz-us-125335203",
    "timestamp": "2025-09-07T08:06:26Z"
  },
  {
    "title": "Japan's prime minister has resigned",
    "description": "Japan's Prime Minister Shigeru Ishiba quits to avoid a split within the ruling Liberal Democratic Party.",
    "link": "https://www.abc.net.au/news/2025-09-07/japanese-prime-minister-shigeru-ishibare-resigns/105745610",
    "timestamp": "2025-09-07T08:01:59Z"
  },
  {
    "title": "With move to 'forever home,' Prince and Princess of Wales could offer hint of 'more egalitarian' monarchy",
    "description": "The Prince and Princess of Wales returned to official duties on Thursday after their summer break, but while Prince William and Catherine were out of the public spotlight over the past few weeks, a broader hint also emerged of what the monarchy may look like …",
    "link": "https://www.cbc.ca/news/world/prince-william-new-residence-prince-andrew-royal-engagements-1.7624039",
    "timestamp": "2025-09-07T08:00:00Z"
  },
  {
    "title": "Venezuelan jets again fly past U.S. Navy cruiser",
    "description": "Washington DC (UPI) Sep 6, 2025 \n\n\n Two Venezuelan military aircraft flew in close proximity to a U.S. Navy ship in international waters for the second time in two days, federal officials confirmed this week. \n The Department of War called the move by the two…",
    "link": "https://www.spacewar.com/reports/Venezuelan_jets_again_fly_past_US_Navy_cruiser_999.html",
    "timestamp": "2025-09-07T07:47:48Z"
  },
  {
    "title": "Zelenskyy rejects Putin's proposal for Moscow meet, invites him to Kyiv",
    "description": "Ukraine's Zelenskyy rejects Putin's Moscow meeting, calls for negotiations in Kyiv amid ongoing Russian attacks, US involvement.",
    "link": "https://www.thehindubusinessline.com/news/world/zelenskyy-rejects-putins-proposal-for-moscow-meet-invites-him-to-kyiv/article70021735.ece",
    "timestamp": "2025-09-07T07:31:04Z"
  },
  {
    "title": "South Korea has finished talks with US to release Korean workers",
    "description": "SEOUL (Reuters) -South Korea has just wrapped up talks with the U.S. for the release of detained Korean workers in Georgia, a presidential official said on...",
    "link": "https://www.yahoo.com/news/articles/south-korea-finished-talks-us-073101101.html",
    "timestamp": "2025-09-07T07:31:01Z"
  },
  {
    "title": "트럼프, 前정부 사업 도려낼 것",
    "description": "Japanese Prime Minister Shigeru Ishiba has reiterated his intention to stay on as leader after securing the lowering of US auto tariffs, dismissing the view that implementation of the trade deal with Washington might change his mind https://t.co/EK9ZrD45lA— B…",
    "link": "https://ryueyes11.tistory.com/511840",
    "timestamp": "2025-09-07T07:26:19Z"
  },
  {
    "title": "Russia hits Kyiv in largest aerial attack since war began, sparking fire at government building",
    "description": "A strike on a residential building in the west of Kyiv killed at least two people, a mother and her two-month-old son, authorities said.",
    "link": "https://www.thejournal.ie/russia-hits-kyiv-in-largest-aerial-attack-since-war-began-6809809-Sep2025/",
    "timestamp": "2025-09-07T07:17:09Z"
  },
  {
    "title": "Bigg Boss 19: Salman Khan's 'peace prize' remark during Weekend Ka Vaar goes viral. Netizens think it's a dig at Donald Trump",
    "description": "Salman Khan's recent Weekend Ka Vaar episode on Bigg Boss 19 went viral after he criticised contestant Farhana Bhatt, a self-proclaimed peace activist, for instigating fights. His remarks, questioning those who create trouble while seeking peace prizes, led m…",
    "link": "https://economictimes.indiatimes.com/magazines/panache/bigg-boss-19-salman-khans-peace-prize-remark-during-weekend-ka-vaar-goes-viral-netizens-think-its-a-dig-at-donald-trump/articleshow/123743781.cms",
    "timestamp": "2025-09-07T07:14:18Z"
  },
  {
    "title": "Peter Navarro Slams Elon Musk, X Community Notes For Calling Anti-India Post 'Hypocritical'",
    "description": "White House trade adviser Peter Navarro and aide to President Donald Trump, has continued his rant against India on social media. In his latest remark, Navarro claimed that 'India buys Russia oil solely to profiteer' and also critised Elon Musk, calling his o…",
    "link": "https://www.ndtvprofit.com/world/peter-navarro-slams-elon-musk-x-community-notes-for-calling-anti-india-post-hypocritical",
    "timestamp": "2025-09-07T07:11:00Z"
  },
  {
    "title": "Undersea cables cut in the Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea have disrupted internet access in parts of Asia and the Middle East",
    "link": "https://abcnews.go.com/International/wireStory/undersea-cables-cut-red-sea-disrupting-internet-access-125334372",
    "timestamp": "2025-09-07T07:10:13Z"
  },
  {
    "title": "Russia assaults Ukraine with over 800 drones and decoys, the largest such attack in the war",
    "description": "Russia hit Ukraine's capital with drone and missiles Sunday in the largest aerial attack on the country since the war began.",
    "link": "https://www.npr.org/2025/09/07/nx-s1-5533036/russia-assaults-ukraine-800-drones-largest-attack-war",
    "timestamp": "2025-09-07T07:07:28Z"
  },
  {
    "title": "Bolsonaro supporters called to streets ahead of coup trial verdict",
    "description": "Former Brazilian president Jair Bolsonaro will test his political strength Sunday with demonstrations in the country’s main cities, days before the Supreme Court decides whether he is guilty of attempting a coup. The far-right leader, also a former army capta…",
    "link": "https://www.digitaljournal.com/world/bolsonaro-supporters-called-to-streets-ahead-of-coup-trial-verdict/article",
    "timestamp": "2025-09-07T07:07:20Z"
  },
  {
    "title": "Bolsonaro Supporters Called To Streets Ahead Of Coup Trial Verdict",
    "description": "Former Brazilian president Jair Bolsonaro will test his political strength Sunday with demonstrations in the country's main cities, days before the Supreme Court decides whether he is guilty of attempting a coup.",
    "link": "https://www.ibtimes.com/bolsonaro-supporters-called-streets-ahead-coup-trial-verdict-3782742",
    "timestamp": "2025-09-07T07:06:19Z"
  },
  {
    "title": "Russia Hits Seat Of Ukraine Government In War's Biggest Air Attack",
    "description": "Russia fired its biggest-ever aerial barrage at Ukraine early Sunday, killing at least two people and setting the seat of the Ukrainian government in Kyiv ablaze, authorities said.",
    "link": "https://www.ibtimes.com/russia-hits-seat-ukraine-government-wars-biggest-air-attack-3782741",
    "timestamp": "2025-09-07T07:00:17Z"
  },
  {
    "title": "‘Pessimist patriots’: Nigel Farage’s Reform UK party widens appeal",
    "description": "New polling by More in Common found the party's base was becoming increasingly mainstream, with the number of female Reform supporters fast catching up with men",
    "link": "https://www.euractiv.com/section/politics/news/pessimist-patriots-nigel-farages-reform-uk-party-widens-appeal/",
    "timestamp": "2025-09-07T06:50:45Z"
  },
  {
    "title": "Japan PM Ishiba resigns after series of bruising election losses | CNN",
    "description": "Japanese Prime Minister Shigeru Ishiba said on Sunday he had decided to resign, ushering in a potentially lengthy period of policy paralysis at a shaky moment for the world’s fourth-largest economy.",
    "link": "https://www.cnn.com/2025/09/07/asia/japan-prime-minister-ishiba-resign-intl-hnk",
    "timestamp": "2025-09-07T06:50:09Z"
  },
  {
    "title": "The Sinner vs. Alcaraz US Open final is delayed because of security. Trump gets cheers, boos",
    "description": "There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final on Sunday — with President Donald Trump expected to be at Arthur Ashe Stadium.",
    "link": "https://www.bostonherald.com/2025/09/07/the-sinner-vs-alcaraz-us-open-final-is-delayed-because-of-security-trump-gets-cheers-boos/",
    "timestamp": "2025-09-07T06:45:02Z"
  },
  {
    "title": "The Sinner vs. Alcaraz US Open final starts after a delay due to security. Trump gets cheers, boos",
    "description": "There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final on Sunday — with President Donald Trump expected to be at Arthur Ashe Stadium.",
    "link": "https://www.bostonherald.com/2025/09/07/the-sinner-vs-alcaraz-us-open-final-starts-after-a-delay-due-to-security-trump-gets-cheers-boos/",
    "timestamp": "2025-09-07T06:45:02Z"
  },
  {
    "title": "Start of Sinner vs. Alcaraz in the US Open final delayed because of Trump-related security",
    "description": "There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final on Sunday — with President Donald Trump expected to be at Arthur Ashe Stadium.",
    "link": "https://www.bostonherald.com/2025/09/07/start-of-sinner-vs-alcaraz-in-the-us-open-final-delayed-because-of-trump-related-security/",
    "timestamp": "2025-09-07T06:45:02Z"
  },
  {
    "title": "Alcaraz wins the first set of the delayed US Open final against Sinner. Trump gets cheers and boos",
    "description": "There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final on Sunday — with President Donald Trump expected to be at Arthur Ashe Stadium.",
    "link": "https://www.bostonherald.com/2025/09/07/alcaraz-wins-the-first-set-of-the-delayed-us-open-final-against-sinner-trump-gets-cheers-and-boos/",
    "timestamp": "2025-09-07T06:45:02Z"
  },
  {
    "title": "No. 1 Jannik Sinner faces No. 2 Carlos Alcaraz in the US Open final. President Trump is expected",
    "description": "By HOWARD FENDRICH NEW YORK (AP) — There is a lot at stake when No. 1 Jannik Sinner meets No. 2 Carlos Alcaraz in the U.S. Open men’s final on Sunday — with President Donald Trump expected to be at Arthur Ashe Stadium. Sinner, a 24-year-old from Italy, is try…",
    "link": "https://www.bostonherald.com/2025/09/07/no-1-jannik-sinner-faces-no-2-carlos-alcaraz-in-the-us-open-final-president-trump-is-expected/",
    "timestamp": "2025-09-07T06:45:02Z"
  },
  {
    "title": "US and Indian Venture Capitalists Come Together to Invest $1B in Indian Deep Tech Startups",
    "description": "Key takeaways: India’s deep tech startups are set to receive a major boost with the launch of the India Deep Tech Investment Alliance (IDTIA), which has pledged a $1B fund...\nThe post US and Indian Venture Capitalists Come Together to Invest $1B in Indian Dee…",
    "link": "https://techreport.com/news/us-india-invest-1b-indian-deep-tech-startups/",
    "timestamp": "2025-09-07T06:42:10Z"
  },
  {
    "title": "Sanders, Mamdani rally progressive voters as NYC mayor’s race intensifies",
    "description": "Mamdani discusses how he plans to address income inequality and affordability issues in the largest US city.",
    "link": "https://www.aljazeera.com/news/2025/9/7/sanders-mamdani-rally-progressive-voters-as-nyc-mayors-race-intensifies",
    "timestamp": "2025-09-07T06:39:07Z"
  },
  {
    "title": "Russian strikes across Ukraine kill at least 4: Authorities",
    "description": "Russian strikes across Ukraine overnight killed at least four people and wounded dozens more, authorities announced, as officials said a government building in the capital Kiev was on fire after the attack.",
    "link": "https://www.hurriyetdailynews.com/russian-strikes-across-ukraine-kill-at-least-4-authorities-213311",
    "timestamp": "2025-09-07T06:36:17Z"
  },
  {
    "title": "Japan Prime Minister Shigeru Ishiba to resign, report says",
    "description": "Shigeru Ishiba's LDP-led coalition lost its upper house majority in an election in July.",
    "link": "https://indianexpress.com/article/world/japan-prime-minister-shigeru-ishiba-to-resign-report-10235107/",
    "timestamp": "2025-09-07T06:35:28Z"
  },
  {
    "title": "Japan PM Shigeru Ishiba says he will resign",
    "description": "Ishiba's Liberal Democratic Party (LDP)-led coalition lost its upper house majority in an election in July.",
    "link": "https://www.channelnewsasia.com/east-asia/japan-pm-shigeru-ishiba-resigns-5336616",
    "timestamp": "2025-09-07T06:33:00Z"
  },
  {
    "title": "Marion McKeone: All the experts say Trump's tariffs are unlawful. Will the Supreme Court agree?",
    "description": "The US correspondent says a ruling that the tariffs are illegal could see billions being refunded and deal a body blow to Trump’s handling of the economy.",
    "link": "https://www.thejournal.ie/readme/trump-tariffs-us-supreme-court-ruling-checks-balances-6808210-Sep2025/",
    "timestamp": "2025-09-07T06:30:00Z"
  },
  {
    "title": "Alcaraz and Sinner set for US Open 2025 showdown; when and where to watch, prize money, star guests, and who has the edge to win",
    "description": "Jannik Sinner and Carlos Alcaraz will compete in the US Open final. The match is scheduled for Sunday at Arthur Ashe Stadium. The winner will also claim the world number one ranking. The US Open offers a record prize pool. The singles champions will receive f…",
    "link": "https://economictimes.indiatimes.com/news/international/us/alcaraz-and-sinner-set-for-us-open-2025-showdown-when-and-where-to-watch-prize-money-star-guests-and-who-has-the-edge-to-win/articleshow/123743845.cms",
    "timestamp": "2025-09-07T06:22:18Z"
  },
  {
    "title": "Russian strikes across Ukraine kill at least 4: authorities",
    "description": "Russian strikes across Ukraine overnight killed at least four people and wounded dozens more, authorities announced, as officials said a government building in the capital Kyiv was on fire after the attack. The State Emergency Service said the strikes damaged…",
    "link": "https://www.digitaljournal.com/world/russian-strikes-across-ukraine-kill-at-least-4-authorities/article",
    "timestamp": "2025-09-07T06:07:20Z"
  },
  {
    "title": "Cliff Taylor: Micheál Martin insists Ireland is totally pro-trade, except when it comes to Mercosur",
    "description": "Official Ireland, it seems, is in a bind: in favour of free trade, but only if it doesn’t upset anybody",
    "link": "https://www.irishtimes.com/opinion/2025/09/07/cliff-taylor-micheal-martin-insists-ireland-is-totally-pro-trade-except-when-it-comes-to-mercosur/",
    "timestamp": "2025-09-07T06:05:00Z"
  },
  {
    "title": "Reform UK has momentum and it continues to build",
    "description": "Reform UK knows how to put on a show and its party conference in Birmingham this weekend was its biggest one yet.",
    "link": "https://www.rte.ie/news/2025/0907/1532201-reform-momentum-analysis/",
    "timestamp": "2025-09-07T06:00:01Z"
  },
  {
    "title": "Are farmers justified in their opposition to Mercosur?",
    "description": "On Wednesday the European Commission adopted a text to start the process of ratification of the EU-Mercosur trade agreement.",
    "link": "https://www.rte.ie/news/2025/0907/1532197-mercosur-farmers-analysis/",
    "timestamp": "2025-09-07T06:00:01Z"
  },
  {
    "title": "DOJ weighs FIREARM BAN for transgender Americans",
    "description": "The DOJ is considering proposals that could restrict transgender Americans from buying or owning firearms, potentially by labeling transgender identity as a mental illness. Current federal law requires a court ruling to declare someone mentally unfit to own a…",
    "link": "https://www.naturalnews.com/2025-09-07-doj-weighs-firearm-ban-for-transgender-americans.html",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "TRUMP DEMANDS PHARMA justify the claimed â\u0080\u009csuccessâ\u0080\u009d of the COVID CLOT SHOTS they said saved â\u0080\u009cmillions of livesâ\u0080\u009d â\u0080\u0093 Whereâ\u0080\u0099s that so-called science?",
    "description": "With Paul Offit and his insidious cohorts ousted from the FDA and CDC, President Trump is well on his way to cleaning up the vaccine industry that riddled with pharma shills, toxic jabs, and propaganda piled mountains high claiming every vaccine ever made is …",
    "link": "https://www.naturalnews.com/2025-09-07-trump-demands-pharma-justify-success-covid-shots.html",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "Trumpâ\u0080\u0099s tariff battle heads to the Supreme Court: A fight for presidential authority and economic strategy",
    "description": "President Donald Trump has petitioned the U.S. Supreme Court to review a lower court ruling that declared his use of the International Emergency Economic Powers Act (IEEPA) to impose tariffs unconstitutional, arguing that the decision undermines his ability t…",
    "link": "https://www.naturalnews.com/2025-09-07-trump-tariff-battle-heads-to-supreme-court.html",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "Texas congresswoman introduces bill to strip federal funds from sanctuary cities",
    "description": "Rep. Beth Van Duyne (R-TX) reintroduced the No Congressional Funds for Sanctuary Cities Act (H.R. 205) to strip federal funding from jurisdictions that limit cooperation with ICE and other immigration authorities. The bill would block sanctuary cities from re…",
    "link": "https://www.naturalnews.com/2025-09-07-texas-congresswoman-introduces-bill-strip-funds-sanctuary-cities.html",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "'Coalition of the Possible'? A look at Ukraine guarantees",
    "description": "The dynamics between the Trump administration and Europe on Ukraine have shifted, with the meeting of the so-called 'Coalition of the Willing' in Paris this week representing an important inflection point",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0907/1532161-ukraine-security-guarantees/",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "The West cannot treat India and China like colonies, Putin warns",
    "description": "Putin urged the West to abandon a “colonial mindset” and engage with India and China through respectful dialogue, not threats. He emphasized that both are major nations with large populations that have endured colonialism and value their sovereignty. Putin fr…",
    "link": "https://www.naturalnews.com/2025-09-07-putin-west-cant-treat-india-china-colonies.html",
    "timestamp": "2025-09-07T06:00:00Z"
  },
  {
    "title": "Brazil Facing Tariff Wars, Economic Pressure From United States - Kremlin Spokesman",
    "description": "VLADIVOSTOK, (Sputnik) - Brazil is facing tariff wars from the United States, which is taking very tough measures of economic pressure, Kremlin spokesman Dmitry Peskov said in an interview with Sputnik at the Eastern Economic Forum (EEF).",
    "link": "https://sputnikglobe.com/20250907/brazil-facing-tariff-wars-economic-pressure-from-united-states---kremlin-spokesman-1122741956.html",
    "timestamp": "2025-09-07T05:59:01Z"
  },
  {
    "title": "Undersea cables cut in Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea disrupted internet access in parts of Asia and the Middle East, experts said Sunday, though it wasn't immediately clear what caused the incident.  There has been concern about the cables being targeted in a Red Sea campaign …",
    "link": "https://japantoday.com/category/world/undersea-cables-cut-in-the-red-sea-disrupting-internet-access-in-asia-and-the-mideast",
    "timestamp": "2025-09-07T05:58:47Z"
  },
  {
    "title": "Brazil Uses BRICS to Exchange Opinions on Situation With Tariff Wars - Peskov",
    "description": "VLADIVOSTOK, (Sputnik) - Brazil uses all possible mechanisms, including BRICS, to exchange opinions on the US tariff wars and develop common approaches, Kremlin spokesman Dmitry Peskov said in an interview with Sputnik at the Eastern Economic Forum.",
    "link": "https://sputnikglobe.com/20250907/brazil-uses-brics-to-exchange-opinions-on-situation-with-tariff-wars---peskov-1122741836.html",
    "timestamp": "2025-09-07T05:52:15Z"
  },
  {
    "title": "Liberalism Without Illusions : Democracy Journal",
    "description": "We must free ourselves from the delusion that history is progressive and accept that the dark side of our nature is here to stay.",
    "link": "https://democracyjournal.org/magazine/77/liberalism-without-illusions/",
    "timestamp": "2025-09-07T05:47:01Z"
  },
  {
    "title": "'Chipocalypse Now': Trump threatens 'war' on Chicago in immigration crackdown",
    "description": "Donald Trump has signalled his intention to send troops to Chicago to ramp up the deportation of illegal immigrants - by posting an AI-generated parody image from Apocalypse Now on social media.",
    "link": "https://news.sky.com/story/chipocalypse-now-trump-threatens-war-on-chicago-in-immigration-crackdown-13426413",
    "timestamp": "2025-09-07T05:45:00Z"
  },
  {
    "title": "Undersea cables cut in the Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea disrupted internet access across parts of Asia and the Middle East on Sunday. Experts suspect the damage occurred near Jeddah, Saudi Arabia, affecting major cable systems. While the cause remains unclear, the incident raises…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/undersea-cables-cut-in-the-red-sea-disrupting-internet-access-in-asia-and-the-mideast/articleshow/123743315.cms",
    "timestamp": "2025-09-07T05:24:01Z"
  },
  {
    "title": "Russian attacks on Ukraine’s Kyiv kill at least 3, strike gov’t building",
    "description": "Kyiv Mayor Vitali Klitschko says attack early on Sunday sparked fires at several high-rise buildings in the capital.",
    "link": "https://www.aljazeera.com/news/2025/9/7/russian-attacks-on-ukraines-kyiv-kill-at-least-3-strike-govt-building",
    "timestamp": "2025-09-07T05:14:39Z"
  },
  {
    "title": "Undersea cables cut in the Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea have disrupted internet access in parts of Asia and the Middle East. Experts say the disruption began early Sunday, but the cause remains unclear. There are concerns about possible targeting by Yemen's Houthi rebels, though …",
    "link": "https://www.seattlepi.com/news/world/article/undersea-cables-cut-in-the-red-sea-disrupting-21035125.php",
    "timestamp": "2025-09-07T05:10:56Z"
  },
  {
    "title": "Donald Trump has ordered the removal of a peace memorial that has stood outside the White House for 44 years.",
    "description": null,
    "link": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_a117ee75-9728-4606-b825-5966d48eb970",
    "timestamp": "2025-09-07T05:09:24Z"
  },
  {
    "title": "India engaging with US, global firms to protect IT jobs, says Ashwini Vaishnaw",
    "description": "India is engaging global firms and foreign governments to shield its $300 billion tech industry from potential US outsourcing curbs under President Donald Trump, Union Minister Ashwini Vaishnaw told Moneycontrol",
    "link": "https://www.moneycontrol.com/news/business/india-engaging-with-us-global-firms-to-protect-it-jobs-says-ashwini-vaishnaw-13526681.html",
    "timestamp": "2025-09-07T05:08:03Z"
  },
  {
    "title": "Europe must reach for the bazooka‚ or be humiliated",
    "description": "Trump's swipe at EU digital laws is a threat to the very foundations of democratic governance: the rule of law, freedom from foreign interference, and the protection of our children in the digital age",
    "link": "https://www.euractiv.com/section/tech/opinion/europe-must-reach-for-the-bazooka-or-be-humiliated/",
    "timestamp": "2025-09-07T05:00:20Z"
  },
  {
    "title": "The Sartre and de Beauvoir of Ukraine: how two literary academics became wartime resistance leaders",
    "description": "Husband-and-wife team combine teaching literature with battling cultural extinction and military invasion",
    "link": "https://www.irishtimes.com/world/europe/2025/09/07/the-sartre-and-de-beauvoir-of-ukraine-how-two-literary-academics-became-wartime-resistance-leaders/",
    "timestamp": "2025-09-07T05:00:00Z"
  },
  {
    "title": "Undersea cables cut in the Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea disrupted internet access Sunday in parts of Asia and the Middle East, experts said, though it wasn't immediately clear...",
    "link": "https://www.yahoo.com/news/articles/undersea-cables-cut-red-sea-045755430.html",
    "timestamp": "2025-09-07T04:57:55Z"
  },
  {
    "title": "Undersea cables cut in the Red Sea, disrupting internet access in Asia and the Mideast",
    "description": "Undersea cable cuts in the Red Sea disrupted internet access in parts of Asia and the Middle East, experts said Sunday, though it wasn't immediately clear...",
    "link": "https://www.yahoo.com/news/articles/undersea-cables-cut-red-sea-045755796.html",
    "timestamp": "2025-09-07T04:57:55Z"
  },
  {
    "title": "Tough negotiations and uncertainty ahead of OPEC+ meeting",
    "description": "LONDON: Uncertainty loomed over what Saudi Arabia, Russia and six other key members of the OPEC+ alliance would decide on crude output in their meeting on Sunday (Sep 7), with analysts saying a production boost was also being considered.The meeting by the gro…",
    "link": "https://www.channelnewsasia.com/world/tough-negotiations-uncertainty-opec-meeting-5336541",
    "timestamp": "2025-09-07T04:51:30Z"
  },
  {
    "title": "Trump preparing to visit South Korea in Oct, may sit down with Xi Jinping: Report",
    "description": "The summit, which would take place in Gyeongju between late October and early November, is being viewed as a key opportunity for Trump to meet with Chinese leader Xi Jinping",
    "link": "https://www.thehindubusinessline.com/news/world/trump-preparing-to-visit-south-korea-in-oct-may-sit-down-with-xi-jinping-report/article70021695.ece",
    "timestamp": "2025-09-07T04:51:25Z"
  },
  {
    "title": "US sets tough conditions for lifting tariffs on India",
    "description": "Kathmandu, Sept 7:US Commerce Secretary Howard Lutnick has laid out three conditions for lifting the 25 percent additional tariff imposed […]\nThe post US sets tough conditions for lifting tariffs on India appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/09/07/us-sets-tough-conditions-for-lifting-tariffs-on-india/",
    "timestamp": "2025-09-07T04:45:00Z"
  },
  {
    "title": "US moves to advance deal for release of all hostages",
    "description": "The United States has conveyed, via an Israeli intermediary, key principles for a comprehensive agreement to secure the release of hostages and end the war in Gaza.",
    "link": "https://www.israelnationalnews.com/news/414501",
    "timestamp": "2025-09-07T04:39:44Z"
  },
  {
    "title": "Trump’s Attendance At U.S. Open Men’s Final On Sunday Takes Center Court As Organizers Demand Broadcasters Not Air Boos & Protests",
    "description": "Reaction to Donald Trump’s attendance at the U.S. Open Men’s Final on Sunday just stepped into Center Court. A memo sent to the likes of ESPN and Sky Sports this afternoon from the United States Tennis Association asks “all broadcasters to refrain from showca…",
    "link": "http://deadline.com/2025/09/us-open-trump-tv-censorship-usta-1236510743/",
    "timestamp": "2025-09-07T04:30:44Z"
  },
  {
    "title": "Israeli forces target more high-rise buildings in Gaza city, warning residents to flee to ‘humanitarian zone’",
    "description": "The Israeli military yesterday warned Palestinians in Gaza city to leave for the south of the region before bombing a high-rise tower as its forces advance deeper into the small country’s largest urban area.",
    "link": "https://www.independent.ie/world-news/middle-east/israeli-forces-target-more-high-rise-buildings-in-gaza-city-warning-residents-to-flee-to-humanitarian-zone/a386546175.html",
    "timestamp": "2025-09-07T04:30:00Z"
  },
  {
    "title": "US Open: Political showdown at the final; Trump set to attend as Hollywood critics fill the stands, look at the list of stars present",
    "description": "Donald Trump will attend the US Open men's final. Carlos Alcaraz welcomes the president's presence. The event attracts many celebrities with varied political views. Simone Biles and Alec Baldwin are among the attendees. They have previously criticised Trump. …",
    "link": "https://economictimes.indiatimes.com/news/international/us/us-open-political-showdown-at-the-final-trump-set-to-attend-as-hollywood-critics-fill-the-stands-look-at-the-list-of-stars-present/articleshow/123742840.cms",
    "timestamp": "2025-09-07T04:29:35Z"
  },
  {
    "title": "South Korean President vows support to over 300 Koreans arrested in immigration raid at Georgia Hyundai factory",
    "description": "South Korean President Lee Jae Myung ordered all-out efforts on Saturday to swiftly respond to the arrests of hundreds of the nation's citizens in a US immigration raid on a Hyundai Motor car battery factory.",
    "link": "https://nypost.com/2025/09/07/world-news/south-korean-president-lee-jae-myung-calls-for-swift-response-after-citiens-arrested-at-georgia-hyundai-car-battery-factory/",
    "timestamp": "2025-09-07T04:24:23Z"
  },
  {
    "title": "Zelenskyy rejects Putin's proposal for Moscow meet, invites him to Kyiv",
    "description": "Volodymyr Zelenskyy dismissed Vladimir Putin's proposal for talks in Moscow, deeming it unrealistic given ongoing Russian attacks. Zelenskyy suggested Kyiv as an alternative, highlighting the daily missile strikes. Despite Donald Trump's push for a meeting, M…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/zelenskyy-rejects-putins-proposal-for-moscow-meet-invites-him-to-kyiv/articleshow/123742757.cms",
    "timestamp": "2025-09-07T04:13:12Z"
  },
  {
    "title": "Epstein Made Me Dress Like a Sexy Nurse for Trump: Model (Jack Silvers/The Daily Beast)",
    "description": "Jack Silvers / The Daily Beast:\nEpstein Made Me Dress Like a Sexy Nurse for Trump: Model  —  PREDATOR AND PRESIDENT  —  A model who was Jeffrey Epstein's friend in the '90s exclusively tells The Daily Beast Podcast how close Trump and Epstein were.  —  A one-…",
    "link": "https://www.memeorandum.com/250907/p1",
    "timestamp": "2025-09-07T04:10:00Z"
  },
  {
    "title": "Donald Clarke: I dare you to walk through Dublin city centre of an evening. You won’t believe what you see",
    "description": "Irish social media is engulfed with paranoia. But at the capital’s heart is an extraordinary energy from which new ideas and fresh cultures emerge",
    "link": "https://www.irishtimes.com/culture/2025/09/07/i-dare-you-to-walk-through-dublin-city-centre-of-an-evening-you-wont-believe-what-you-see/",
    "timestamp": "2025-09-07T04:09:00Z"
  },
  {
    "title": "‘I don’t give a s**t’: Vance defends ‘cartel boat’ strike",
    "description": "US Vice President J.D. Vance says he “doesn’t give a s**t” if the strike on a Venezuela-linked boat is labeled a war crime Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624228-i-dont-give-st-vance/",
    "timestamp": "2025-09-07T04:08:03Z"
  },
  {
    "title": "Trump escalates crackdown threats with Chicago 'war' warning",
    "description": "WASHINGTON: President Donald Trump threatened on Saturday (Sep 6) to unleash his newly rebranded \"Department of War\" on Chicago, further heightening tensions over his push to deploy troops into Democratic-le",
    "link": "https://www.channelnewsasia.com/world/trump-escalates-crackdown-threats-chicago-war-warning-5336516",
    "timestamp": "2025-09-07T04:06:56Z"
  },
  {
    "title": "New Data Shows Massive Emissions From Texas Wells, Despite Trump Denials",
    "description": "by Martha Pskowski, Inside Climate News, and Mark Olalde, ProPublica Co-published with Inside Climate News and The Texas Tribune ( ProPublica ) - Hakim Dermish moved to the small South Texas town of Catarina in 2002 in search of a rural lifestyle on a budget.…",
    "link": "https://www.juancole.com/2025/09/americas-countries-emissions.html",
    "timestamp": "2025-09-07T04:06:39Z"
  },
  {
    "title": "‘Scam of all scams’: Crypto dev claims Trump-linked WLFI ‘stole’ his money",
    "description": "A crypto developer has accused World Liberty Financial (WLFI), a crypto project with ties to US President Donald Trump, of stealing his funds by refusing to unlock his tokens.\nIn a Saturday post on X, Polygon DevRel Bruno Skvorc shared an email from WLFI’s co…",
    "link": "https://biztoc.com/x/a33e8bcbb28b6761",
    "timestamp": "2025-09-07T04:02:24Z"
  },
  {
    "title": "TV guide: Taskmaster, The Late Late Show and Only Murders are back, plus new shows to watch, from tonight",
    "description": "September 7th-12th highlights: including Glúin Z; Task; The Donald Trump Show; and Only Murders in the Building",
    "link": "https://www.irishtimes.com/culture/tv-radio/2025/09/07/tv-guide-taskmaster-the-late-late-and-only-murders-are-back-plus-new-shows-to-watch-from-tonight/",
    "timestamp": "2025-09-07T04:00:00Z"
  },
  {
    "title": "Fall Starts Off with a Bang",
    "description": "If you by chance believed that congressional committees were helmed by elected officials who did their homework and were trying to do more than get face time on the evening news, you certainly learned this week what a farce these hearings can be. Her...",
    "link": "https://www.americanthinker.com/articles/2025/09/fall_starts_off_with_a_bang.html",
    "timestamp": "2025-09-07T04:00:00Z"
  },
  {
    "title": "What drives Democrats and leftists to Trump insanity?",
    "description": "The question I keep asking myself and everyone else is very straightforward: Why is nothing Trump does satisfactory to leftists? I searched for reasonable answers and rational theories. Nothing worked. However, while I did not find any reasonable ans...",
    "link": "https://www.americanthinker.com/blog/2025/09/what_drives_democrats_and_leftists_to_trump_insanity.html",
    "timestamp": "2025-09-07T04:00:00Z"
  },
  {
    "title": "Donald Trump famously avoided the Vietnam War due to bone spurs. But Vance wouldn’t be “shocked” to learn POTUS had been a Marine.",
    "description": "JD Vance demonstrated that his sycophancy knows no limits in a Saturday interview on Fox News with President Donald Trump’s daughter-in-law, Lara Trump...",
    "link": "https://www.thedailybeast.com/jd-vance-praises-5-time-draft-dodger-donald-trumps-marine-corps-style-of-leadership/",
    "timestamp": "2025-09-07T03:54:42Z"
  },
  {
    "title": "OPEC+ Agrees In Principle To Increase Crude Oil Production In October",
    "description": "OPEC+ has agreed in principle to increase production again next month, according to delegates, as the group doubles down on its policy shift to pursue market share instead of defending prices.",
    "link": "https://www.ndtvprofit.com/global-economics/opec-agrees-in-principle-to-increase-crude-oil-production-in-october",
    "timestamp": "2025-09-07T03:39:35Z"
  },
  {
    "title": "Trump says Venezuelan jets will be shot down if they endanger US ships",
    "description": "Donald Trump has warned that, if Venezuelan jets fly over US naval ships and \"put us in a dangerous position, they'll be shot down\". The president's warning comes after Venezuela flew military aircraft near a US vessel off South America for the second time in…",
    "link": "https://freerepublic.com/focus/f-news/4339099/posts",
    "timestamp": "2025-09-07T03:38:41Z"
  },
  {
    "title": "Trump’s Rare Earth Push Hits a Chinese Wall in Myanmar",
    "description": "US signals rare earth quid pro quo with Myanmar junta but China has a lock on the largely rebel-controlled minesPresident Donald Trump is miffed that the US is aced-out by China in processing rare earths that are especially prized for making strategic-use mag…",
    "link": "https://freerepublic.com/focus/f-news/4339098/posts",
    "timestamp": "2025-09-07T03:37:59Z"
  },
  {
    "title": "With ‘Franz,’ Agnieszka Holland Shares Her Unique View of Kafka, Informed by a Career of Outsider Insights",
    "description": "Guillermo del Toro isn’t the only celebrated international filmmaker who managed to realize a decades-long passion project this year. Where Del Toro had “Frankenstein,” Agnieszka Holland has “Franz,” in which the Polish director pays homage to the literary he…",
    "link": "https://variety.com/2025/film/news/franz-agnieszka-holland-1236506811/",
    "timestamp": "2025-09-07T03:35:00Z"
  },
  {
    "title": "More Than 1,900 Arrests Made In Washington DC Since Federal Takeover Of Policing",
    "description": "The Washington D.C. Metropolitan Police Department and federal partners have conducted more than 1,900 arrests since President Donald Trump federalized policing in the nation’s capital. FBI Director Kash Patel announced on Sept. 5 that, in addition to the tot…",
    "link": "https://freerepublic.com/focus/f-news/4339097/posts",
    "timestamp": "2025-09-07T03:34:56Z"
  },
  {
    "title": "What to know about the Hyundai immigration raid in US",
    "description": "Shackled workers were bussed from Hyundai’s EV battery site in Georgia after a sweeping federal immigration raid. Here's what happened.",
    "link": "https://www.abc.net.au/news/2025-09-07/what-to-know-about-a-large-scale-immigration-raid-at-a/105744870",
    "timestamp": "2025-09-07T03:31:04Z"
  },
  {
    "title": "The Recent Dismal New Job Numbers Might Be a Sign of Trump’s Successes, Not Failures",
    "description": "As I write this, the Democratic press releases are still being edited, but the collective scream soon to come is perfectly predictable. Already, Democratic Rep. Ted Lieu said on BlueSky that “Republicans are messing up the economy,” based on private jobs data…",
    "link": "https://freerepublic.com/focus/f-news/4339096/posts",
    "timestamp": "2025-09-07T03:28:02Z"
  },
  {
    "title": "Trump's Share-the-Wealth Retirement Plan Will Help All Americans",
    "description": "The Elizabeth Warrens of the world have long complained about how the rules in Washington and on Wall Street are rigged in favor of the rich. Well, there is one federal policy that absolutely does benefit those with higher incomes over working-class Americans…",
    "link": "https://freerepublic.com/focus/f-news/4339095/posts",
    "timestamp": "2025-09-07T03:23:22Z"
  },
  {
    "title": "Israel gears up for Gaza assault as hostage families brace; Trump hints at secret talks",
    "description": "Defense officials oppose the operation, favoring a hostage deal, while Defense Minister Katz faces criticism for prioritizing political aspirations over hostages while the army grapples with battle fatigue, equipment shortages, and morale issues",
    "link": "https://www.haaretz.com/israel-news/2025-09-07/ty-article/.premium/israel-gears-up-for-gaza-assault-as-hostage-families-brace-trump-hints-at-secret-talks/00000199-209c-d336-addd-6fffe36f0000",
    "timestamp": "2025-09-07T03:21:11Z"
  },
  {
    "title": "Joe Biden Has Decided to Build His Presidential Library in Delaware – He is Certainly Going to Need Luck Funding it",
    "description": "Former President Joe Biden has reportedly decided to build his presidential library in the state of Delaware.\nThe post Joe Biden Has Decided to Build His Presidential Library in Delaware – He is Certainly Going to Need Luck Funding it appeared first on The Ga…",
    "link": "https://www.thegatewaypundit.com/2025/09/joe-biden-has-decided-build-his-presidential-library/",
    "timestamp": "2025-09-07T03:20:33Z"
  },
  {
    "title": "Thousands Protest Trump's Washington National Guard Deployment As Federal Military Operations Expand: Report",
    "description": "Thousands of protesters marched through Washington, D.C. on Saturday, demanding President Donald Trump end National Guard deployments in the capital. The “We Are All D.C.” demonstration drew undocumented immigrants and Palestinian supporters who chanted “Trum…",
    "link": "https://biztoc.com/x/ad4279fbfb6c44e8",
    "timestamp": "2025-09-07T03:17:41Z"
  },
  {
    "title": "Trump preparing to visit South Korea in October, may meet China’s Xi Jinping: Report",
    "description": "A White House House official, meanwhile, confirmed that a visit of the US President Donald Trump to South Korea is possible.",
    "link": "https://indianexpress.com/article/world/trump-visit-south-korea-apec-october-meet-china-xi-jinping-10234841/",
    "timestamp": "2025-09-07T03:13:34Z"
  },
  {
    "title": "US woman charged with registering dog to vote in elections",
    "description": "An American woman has been charged with registering her dog to vote in elections Read Full Article at RT.com",
    "link": "https://www.rt.com/news/624227-us-dog-voted-twice/",
    "timestamp": "2025-09-07T03:10:54Z"
  },
  {
    "title": "Trump threatens ‘war’ on Chicago as thousands protest federal crackdown",
    "description": "Illinois Governor JB Pritzker denounces Trump as a wanna-be dictator as protesters rally in Chicago and Washington, DC.",
    "link": "https://www.aljazeera.com/news/2025/9/7/trump-threatens-war-on-chicago-as-thousands-protest-federal-crackdown",
    "timestamp": "2025-09-07T03:10:45Z"
  },
  {
    "title": "Will always be friends with Modi: Trump tones down after 'lost to China' jab",
    "description": "Hours after claiming that the United States has \"lost\" India to China, US President Donald Trump toned down his rhetoric, saying that ties with New Delhi remained \"special\" and he continued to share a strong personal bond with Prime Minister Narendra Modi. Sh…",
    "link": "https://freerepublic.com/focus/f-news/4339093/posts",
    "timestamp": "2025-09-07T03:09:20Z"
  },
  {
    "title": "Inside Trump’s crypto empire and its impact on international relations",
    "description": "Donald Trump's shift to cryptocurrency advocacy after accepting crypto donations has sparked ethical and security concerns. His administration's deals through World Liberty Financial (WLF) with countries like Pakistan and UAE raise red flags about conflicts o…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/inside-trumps-crypto-empire-and-its-impact-on-international-relations/articleshow/123742425.cms",
    "timestamp": "2025-09-07T03:07:56Z"
  },
  {
    "title": "Exclusive—Rep. Joe Wilson: Assad’s Fall a ‘Berlin Wall Moment,’ Calls on Congress to Repeal Caesar Act",
    "description": "Rep. Joe Wilson (R-SC) urged Congress to back President Donald Trump’s Middle East strategy and repeal the Caesar Act during an exclusive interview on Breitbart News Saturday one day after publishing an op-ed on Breitbart about recent developments in Syria an…",
    "link": "https://www.breitbart.com/politics/2025/09/06/exclusive-rep-joe-wilson-assads-fall-a-berlin-wall-moment-calls-on-congress-to-repeal-caesar-act/",
    "timestamp": "2025-09-07T03:04:46Z"
  },
  {
    "title": "Trump's influence lingers as Zohran Mamdani and Bernie Sanders rally New Yorkers",
    "description": "There was a single interruption at New York Democratic Mayoral nominee Zohran Mamdani's campaign event with Sen.",
    "link": "https://www.nbcnews.com/politics/politics-news/trumps-influence-lingers-zohran-mamdani-bernie-sanders-rally-new-yorke-rcna229584",
    "timestamp": "2025-09-07T03:03:58Z"
  }
]