[
  {
    "title": "Tariff Inflation Is Looking Real, So I'm Tracking 11 Key Products for Price Moves",
    "description": "A new report found inflation on the rise in June, another indicator of the affect Donald Trump's tariffs are having on the US economy.",
    "link": "https://www.cnet.com/tech/tariff-inflation-is-looking-real-so-im-tracking-11-key-products-for-price-moves/",
    "timestamp": "2025-07-18T19:15:00Z"
  },
  {
    "title": "Gavin Newsom Brought The Receipts After Trump Claimed He \"Never Wrote A Picture\" In Response To The Epstein Files, And It's Sooo Good",
    "description": "The California governor flipped the president's own words right back at him.",
    "link": "https://www.buzzfeed.com/leemoran/gavin-newsom-donald-trump-epstein-denial-drawing",
    "timestamp": "2025-07-18T19:14:26Z"
  },
  {
    "title": "CLANCY: The Judicial Coup Against Donald Trump Is Real",
    "description": "The Trump administration is right: rogue district court judges are orchestrating a judicial coup that is intent on undermining President Donald Trump.",
    "link": "https://dailycaller.com/2025/07/18/michael-clancy-judicial-coup-donald-trump-ketanji-brown-jackson-sonia-sotomayor-supreme-court/",
    "timestamp": "2025-07-18T19:14:09Z"
  },
  {
    "title": "Trump plans double blow to industries and countries as August 1 tariff deadline approaches",
    "description": "President Trump is preparing to implement industry-specific tariffs alongside country-by-country duties, starting August 1st. A 50% duty on copper is expected, followed by potential tariffs on lumber, chips, critical minerals, and pharmaceuticals. These secto…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-plans-double-blow-to-industries-and-countries-as-august-1-tariff-deadline-approaches/articleshow/122771983.cms",
    "timestamp": "2025-07-18T19:14:06Z"
  },
  {
    "title": "How trolling Trump became a strategy for Newsom",
    "description": "California Gov. Gavin Newsom recently shook up his communications team, and now the outspoken Democrat is turning many of Donald Trump's brash political tactics against the president himself. Newsom and his team have used online trolling, meme wars, mocking T…",
    "link": "https://freerepublic.com/focus/f-chat/4329437/posts",
    "timestamp": "2025-07-18T19:13:53Z"
  },
  {
    "title": "CBS To End ‘The Late Show With Stephen Colbert’ & Some X Call “Bullsh*t”",
    "description": "Many on X are reacting to CBS's decision to end the decade-long The Late Show with Stephen Colbert show after the host made a Trump joke.",
    "link": "https://hiphopwired.com/playlist/cbs-cancels-the-late-show-with-stephen-colbert-reactions/",
    "timestamp": "2025-07-18T19:13:12Z"
  },
  {
    "title": "Texas Republicans might redraw congressional maps. Democrats plan to strike back",
    "description": "Texas Republicans might redraw congressional maps. Democrats plan to strike backgo.com",
    "link": "https://abcnews.go.com/Politics/texas-republicans-redraw-congressional-maps-democrats-plan-strike/story?id=123861837",
    "timestamp": "2025-07-18T19:13:00Z"
  },
  {
    "title": "‘Doesn’t Deserve to Be in Office’: Noem Slams Nashville Mayor Over Anti-ICE Actions",
    "description": "The mayor of Nashville, Tenn., has “jeopardized” the safety of Immigration and Customs Enforcement agents and their families, Department of Homeland Security Secretary Kristi Noem says.... Read More\nThe post ‘Doesn’t Deserve to Be in Office’: Noem Slams Nashv…",
    "link": "https://www.dailysignal.com/2025/07/18/doesnt-deserve-be-office-dhs-secretary-slams-nashville-mayor-alleged-anti-ice-actions/",
    "timestamp": "2025-07-18T19:12:58Z"
  },
  {
    "title": "'Unchecked sadism': Psychiatrist warns ICE inundated by recruits with shocking traits",
    "description": "An explosive new piece in Salon claims that recruits signing up to become ICE agents under President Donald Trump are motivated more by power and aggression rather than \"a sense of noble duty.\"Dr. Geoffrey Grammer, a retired U.S. Army colonel and psychiatrist…",
    "link": "https://www.rawstory.com/trump-immigration-2673370608/",
    "timestamp": "2025-07-18T19:12:50Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow Over Fired Government Official",
    "description": "A federal judge restores the fired FTC commissioner, dealing a legal blow to Trump's efforts to control independent agencies.",
    "link": "https://biztoc.com/x/8cef77748e1694a5",
    "timestamp": "2025-07-18T19:11:56Z"
  },
  {
    "title": "Trump: Biden tried to crush crypto industry",
    "description": "United States President Donald Trump said on Friday that former US President Joe Biden and his administration tried to \"crush\" the cryptocurrency industry.More to come......",
    "link": "https://biztoc.com/x/1ebb938f27106f7b",
    "timestamp": "2025-07-18T19:11:48Z"
  },
  {
    "title": "The News Roundup For July 18, 2025",
    "description": "The Senate voted early Thursday to approve President Trump's rescission package. Now, the bill is being sent back to the House for review. Lawmakers have until midnight on Friday to vote.\nNew data this week from the consumer price index, one of the main indic…",
    "link": "https://www.npr.org/2025/07/18/1255880080/1a-07-18-2025",
    "timestamp": "2025-07-18T19:11:35Z"
  },
  {
    "title": "$4 trillion crypto market hits milestone on stablecoin bill push",
    "description": "The crypto market has crossed $4 trillion. This surge is due to altcoins and new US regulations. A stablecoin bill, supported by President Trump, aims to regulate dollar-linked stablecoins. Ether and Bitcoin have seen significant gains. Bitcoin reached a reco…",
    "link": "https://economictimes.indiatimes.com/news/international/business/4-trillion-crypto-market-hits-milestone-on-stablecoin-bill-push/articleshow/122771945.cms",
    "timestamp": "2025-07-18T19:11:30Z"
  },
  {
    "title": "Joe Scarborough Admits ‘Late Show’ Economics Were Making ‘Less and Less Sense,’ but Colbert Firing ‘Timing Is Terrible’ | Video",
    "description": "The \"Morning Joe\" host notes that Colbert criticized Paramount for its \"60 Minutes\" lawsuit settlement with Trump just days ago\nThe post Joe Scarborough Admits ‘Late Show’ Economics Were Making ‘Less and Less Sense,’ but Colbert Firing ‘Timing Is Terrible’ | …",
    "link": "https://www.thewrap.com/morning-joe-stephen-colbert-cbs-firing-terrible-timing-msnbc-video/",
    "timestamp": "2025-07-18T19:09:54Z"
  },
  {
    "title": "Comedians Pull Off Brazen Epstein Prank Inside Trump Tower Gift Shop (Lee Moran/HuffPost)",
    "description": "Lee Moran / HuffPost:\nComedians Pull Off Brazen Epstein Prank Inside Trump Tower Gift Shop  —  The Good Liars' stunt comes as MAGA backlash to President Donald Trump over the Epstein files grows.  —  Pranksters this week trolled President Donald Trump by plac…",
    "link": "https://www.memeorandum.com/250718/p87",
    "timestamp": "2025-07-18T19:05:02Z"
  },
  {
    "title": "Senate to consider Trump's CFTC pick as crypto oversight hangs in the balance",
    "description": "The Senate Agriculture Committee will hear from prospective CFTC chair Brian Quintenz, who could be the sole commissioner at the US regulator by the end of 2025.",
    "link": "https://cointelegraph.com/news/brian-quintenz-donald-trump-cftc-pick-market-structure",
    "timestamp": "2025-07-18T19:04:04Z"
  },
  {
    "title": "It's Never Been Harder to Get Away With Cheating — or Anything",
    "description": "Blame our self-made digital panopticon, not Coldplay.",
    "link": "https://www.newsweek.com/coldplay-cheating-jumbotron-andy-byron-mass-surveillance-2100918",
    "timestamp": "2025-07-18T19:03:35Z"
  },
  {
    "title": "Sheryl Crow Slams Donald Trump in Protest Song 'The New Normal'",
    "description": "Sheryl Crow slams President Donald Trump in a new protest song titled \"The New Normal,\" calling him \"immoral.\"",
    "link": "http://www.billboard.com/music/music-news/sheryl-crow-slams-president-trump-protest-song-new-normal-1236024917/",
    "timestamp": "2025-07-18T19:03:13Z"
  },
  {
    "title": "Mike Johnson hammered for spewing 'obvious lies' to 'soothe' Trump's bruised ego",
    "description": "After weeks of mounting scrutiny and days of growing scandal surrounding President Donald Trump—culminating Thursday night with a bombshell Wall Street Journal exposé revealing a “bawdy,” innuendo-laced letter he reportedly sent to Jeffrey Epstein for his 50t…",
    "link": "https://www.rawstory.com/mike-johnson-2673370693/",
    "timestamp": "2025-07-18T19:03:01Z"
  },
  {
    "title": "Donald Trump Suffers Legal Blow Over Fired Government Official",
    "description": "A federal judge restores the fired FTC commissioner, dealing a legal blow to Trump's efforts to control independent agencies.",
    "link": "https://www.newsweek.com/donald-trump-suffers-legal-blow-over-fired-government-official-2100965",
    "timestamp": "2025-07-18T19:02:48Z"
  },
  {
    "title": "Trump appointees backed more marble in Fed building renovation he now attacks",
    "description": "U.S. President Donald Trump has looked to the marble finishes and hefty price tag of the Federal Reserve headquarters to claim grounds to fire Chair Jerome Powell, with whom he has tussled for years over interest rates. But the extensive use of marble in the …",
    "link": "https://biztoc.com/x/1b8ee78acb038f9a",
    "timestamp": "2025-07-18T19:00:39Z"
  },
  {
    "title": "Bond markets in Japan and the US are flashing red, exposing Australia's superannuation sector",
    "description": "The amount of leverage or borrowing tied to bonds at present is inching closer to what we saw prior to the global financial crisis.",
    "link": "https://www.abc.net.au/news/2025-07-19/australia-superannuation-japan-bond-market/105546320",
    "timestamp": "2025-07-18T19:00:00Z"
  },
  {
    "title": "Fox News Host Laura Ingraham Teases Bombshell Trump-Epstein Report... Only To Ignore It",
    "description": "Ingraham on Thursday alluded to covering The Wall Street Journal's latest report ahead of a commercial break, only to... not do that when she returned.",
    "link": "https://www.huffpost.com/entry/laura-ingraham-teases-ignores-trump-epstein-report_n_687a538ae4b02a75a1faa1a1",
    "timestamp": "2025-07-18T18:59:41Z"
  },
  {
    "title": "Trump Says ‘I Absolutely Love’ That Stephen Colbert Got ‘Fired’ and ‘I Hear Jimmy Kimmel Is Next’",
    "description": "President Donald Trump weighed in on CBS’s announcement that it is canceling Stephen Colbert‘s late-night talk show — and the president is hopeful Jimmy Kimmel will be next to get axed. CBS said Thursday that it plans to end “The Late Show With Stephen Colber…",
    "link": "https://freerepublic.com/focus/f-chat/4329432/posts",
    "timestamp": "2025-07-18T18:59:29Z"
  },
  {
    "title": "MAGA World Rallies To Defend Trump: Don Jr. Calls Epstein Birthday Card Allegations ‘Insanity’",
    "description": "Trump denied writing the letter and threatened to sue The Wall Street Journal.",
    "link": "https://www.forbes.com/sites/saradorn/2025/07/18/maga-world-rallies-to-defend-trump-don-jr-calls-epstein-birthday-card-allegations-insanity/",
    "timestamp": "2025-07-18T18:58:52Z"
  },
  {
    "title": "Talks continue to convince US officials to renew support for Lebanese peacekeeping mission",
    "description": "The Tánaiste Simon Harris held talks today with UN and European counterparts in a bid to secure the renewal of the UNIFIL mandate in Southern Lebanon.",
    "link": "https://www.thejournal.ie/south-lebanon-unifil-simon-harris-peacekeeping-mission-renewal-talks-italy-6767358-Jul2025/",
    "timestamp": "2025-07-18T18:58:19Z"
  },
  {
    "title": "Trump Pushes MAGA Theory on Epstein Files But It Backfires: 'Then What's Stopping You From Releasing Everything?'",
    "description": "President Donald Trump tried pushing a popular MAGA theory as to why the files on Jeffrey Epstein have not been released yet, only for it to backfire online.",
    "link": "https://www.ibtimes.com/trump-pushes-maga-theory-epstein-files-it-backfires-then-whats-stopping-you-releasing-3778890",
    "timestamp": "2025-07-18T18:56:14Z"
  },
  {
    "title": "The Epstein Week That Was",
    "description": "Punchbowl News: \"It’s hard to see how this week could’ve gone worse for President Donald Trump and House Republicans.\" \"Paralyzed by infighting over the scandal surrounding the disgraced financier Jeffrey Epstein, GOP lawmakers spent the",
    "link": "https://politicalwire.com/2025/07/18/the-epstein-week-that-was/",
    "timestamp": "2025-07-18T18:55:58Z"
  },
  {
    "title": "Bondi Reportedly Ordered FBI to Flag Mentions of Trump in Epstein Docs",
    "description": "Dick Durbin is leading the Senate Judiciary Committee in an effort to receive more transparency regarding the Trump administration’s handling of the Epstein files, particularly an order from Attorney General Pam Bondi for FBI agents to “flag” any mention they…",
    "link": "https://newrepublic.com/post/198134/bondi-fbi-flag-mentions-trump-epstein-files-durbin",
    "timestamp": "2025-07-18T18:55:53Z"
  },
  {
    "title": "Donald Trump Jr.'s Denial Of Daddy's Doodles Fails Miserably",
    "description": "Another attempt to defend dear old dad goes down in flames.",
    "link": "https://www.huffpost.com/entry/donald-trump-jr-defense-of-doodles-fails_n_687a8415e4b02a75a1fac2a1",
    "timestamp": "2025-07-18T18:53:42Z"
  },
  {
    "title": "There’s a bigger story behind Colbert’s cancellation",
    "description": "On Thursday, CBS announced that it was going to cancel The Late Show With Stephen Colbert after Colbert’s contract ends in May 2026. The news comes at a politically fraught moment for CBS and its parent company, Paramount Global. It’s also the capper on the l…",
    "link": "https://www.vox.com/culture/420351/late-show-with-stephen-colbert-cancellation-political-comedy-trump",
    "timestamp": "2025-07-18T18:53:09Z"
  },
  {
    "title": "Brazil court orders raids, restraints on Bolsonaro for Trump collusion",
    "description": "SummaryFederal police serve warrants ordered by Supreme Court Bolsonaro to wear ankle monitor, cut foreign contacts Judge is 'dictator' reacting to Trump, Bolsonaro tells Reuters Trump levied tariff over trial he called a 'witch hunt' BRASILIA, July 18 (Reute…",
    "link": "https://freerepublic.com/focus/f-news/4329431/posts",
    "timestamp": "2025-07-18T18:51:36Z"
  },
  {
    "title": "For No Reason at All, Let's Revisit Trump's Creepy Comments About His Daughter",
    "description": "Barf Bag: Because a certain news cycle is now definitely going to carry over into next week, it's time to take a trip down memory lane.",
    "link": "https://www.jezebel.com/for-no-reason-at-all-lets-revisit-trumps-creepy-comments-about-his-daughter",
    "timestamp": "2025-07-18T18:50:11Z"
  },
  {
    "title": "Watch Live: Donald Trump Signs Cryptocurrency Bill into Law",
    "description": "President Donald Trump signs the GENIUS Act into law on Friday, July 18.\nThe post Watch Live: Donald Trump Signs Cryptocurrency Bill into Law appeared first on Breitbart.",
    "link": "https://www.breitbart.com/tech/2025/07/18/watch-live-donald-trump-signs-cryptocurrency-bill-into-law/",
    "timestamp": "2025-07-18T18:49:39Z"
  },
  {
    "title": "The weird reason Speaker Mike Johnson claimed Trump has a ‘90% approval rating’",
    "description": "Why does Mike Johnson think Donald Trump's approval rating is \"skyrocketing\"? Because from the House Speaker's perspective, Democrats literally don't count.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/weird-reason-speaker-mike-johnson-claimed-trump-90-approval-rating-rcna219651",
    "timestamp": "2025-07-18T18:49:37Z"
  },
  {
    "title": "WATCH: Trump directs Pam Bondi to unseal grand jury transcripts related to Epstein case",
    "description": "President Donald Trump has directed Attorney General Pam Bondi to unseal grand jury transcripts related to the Jeffrey Epstein case.",
    "link": "https://abcnews.go.com/Politics/video/trump-directs-pam-bondi-unseal-grand-jury-transcripts-123870927",
    "timestamp": "2025-07-18T18:46:06Z"
  },
  {
    "title": "High-fructose corn syrup versus cane sugar | CNN",
    "description": "President Trump says Coca-Cola will swap out high-fructose corn syrup with cane sugar. Here’s what research says about its health risks compared with sugar.",
    "link": "https://www.cnn.com/2025/07/18/health/coca-cola-cane-sugar-high-fructose-corn-syrup-wellness",
    "timestamp": "2025-07-18T18:43:57Z"
  },
  {
    "title": "Foreign Correspondent S34E12 1080p HDTV H264-CBFM",
    "description": "Season 34, Episode 12 – “Trumps Wellness Warriors USA”A wellness revolution has captured the White House. Donald Trump’s ex-wife Marla Maples reveals the inside story behind the Make America Healthy Again movement and the role she played in uniting Robert F K…",
    "link": "https://post.rlsbb.cc/foreign-correspondent-s34e12-1080p-hdtv-h264-cbfm/",
    "timestamp": "2025-07-18T18:43:34Z"
  },
  {
    "title": "JPMorgan reveals global regulators favor tokenized bank deposits over stablecoins",
    "description": "JPMorgan’s latest research indicates that international regulators are more inclined to support tokenized deposits, particularly those that preserve the existing structure and stability of fiat-based banking systems, The Block reported on July 18. According t…",
    "link": "https://cryptoslate.com/jpmorgan-reveals-global-regulators-favor-tokenized-bank-deposits-over-stablecoins/",
    "timestamp": "2025-07-18T18:43:28Z"
  },
  {
    "title": "Bipartisan Bill Aims to Codify Trump’s Health Care Pricing Transparency Directive",
    "description": "With the new Patients Deserve Price Tags Act, a bipartisan group of senators is pushing to effectively codify President Donald Trump’s executive order requiring price... Read More\nThe post Bipartisan Bill Aims to Codify Trump’s Health Care Pricing Transparenc…",
    "link": "https://www.dailysignal.com/2025/07/18/bipartisan-bill-aims-codify-trumps-health-care-pricing-directive/",
    "timestamp": "2025-07-18T18:43:16Z"
  },
  {
    "title": "Writers Guild Demands Investigation Into Stephen Colbert ‘Late Show’ Cancellation, Has ‘Significant Concerns’ About Bribery at Paramount",
    "description": "The Writers Guild of America called for Paramount to be investigated for bribery by the New York state attorney general following Thursday’s announcement that “The Late Show With Stephen Colbert” has been canceled. In the statement, the labor union says it ha…",
    "link": "https://variety.com/2025/tv/news/writers-guild-bribery-investigation-colbert-cancellation-1236464878/",
    "timestamp": "2025-07-18T18:41:30Z"
  },
  {
    "title": "What a Trump, Powell faceoff means for your money",
    "description": "Ahead of the next Federal Reserve meeting later this month, tensions between the White House and the central bank have reached a fever pitch.\nOn Wednesday, a senior White House official told CNBC and other news outlets that President Donald Trump was likely t…",
    "link": "https://biztoc.com/x/893188ab6525726d",
    "timestamp": "2025-07-18T18:39:18Z"
  },
  {
    "title": "The new revelation about Trump and Jeffrey Epstein, explained",
    "description": "and real estate developer Donald Trump as they pose together at the Mar-a-Lago estate, Palm Beach, Florida, in 1997. | ﻿Davidoff Studios/Getty \nJust how close was Donald Trump to Jeffrey Epstein?\nThe president’s onetime friendship with Jeffrey Epstein — the w…",
    "link": "https://biztoc.com/x/8262af71e724b7f8",
    "timestamp": "2025-07-18T18:38:45Z"
  },
  {
    "title": "Schwab Wants to Offer Stablecoin Amid Expanding Crypto Services Push: CEO",
    "description": "Charles Schwab's CEO said that the U.S.-based brokerage is considering offering a dollar-pegged token as the stablecoin market is poised to grow.",
    "link": "https://decrypt.co/330848/schwab-offer-stablecoin-expanding-crypto-services-push-ceo",
    "timestamp": "2025-07-18T18:38:42Z"
  },
  {
    "title": "Trump Threatens to Sue Wall Street Journal for Publishing Letter to Epstein",
    "description": "For decades, Trump had a strong friendship with Epstein, a disgraced financier and child sex trafficker.",
    "link": "https://truthout.org/articles/trump-threatens-to-sue-wall-street-journal-for-publishing-letter-to-epstein/",
    "timestamp": "2025-07-18T18:37:40Z"
  },
  {
    "title": "Obama admin 'manufactured' intelligence to create 2016 Russian election interference narrative, documents show",
    "description": "EXCLUSIVE: The Obama administration \"manufactured and politicized intelligence\" to create the narrative that Russia was attempting to influence the 2016 presidential election, despite information from the intelligence community stating otherwise, Fox News Dig…",
    "link": "https://freerepublic.com/focus/f-news/4329427/posts",
    "timestamp": "2025-07-18T18:31:47Z"
  },
  {
    "title": "Gabbard Releases Info Showing 2016 Russia Collusion Narrative Lacked Credible Intelligence",
    "description": "“Their goal was to subvert the will of the American people and enact what was essentially a years-long coup with the objective of trying to usurp the President from fulfilling the mandate bestowed upon him by the American people.\"\nThe post Gabbard Releases In…",
    "link": "https://legalinsurrection.com/2025/07/gabbard-releases-info-showing-2016-russia-collusion-narrative-lacked-credible-intelligence/",
    "timestamp": "2025-07-18T18:31:33Z"
  },
  {
    "title": "Donald Trump’s chronic condition explained after swelling was discovered on his legs",
    "description": "Chronic venous insufficiency explained after people noticed bruises on Donald Trump's hands as well as swollen ankles",
    "link": "https://www.ladbible.com/news/politics/donald-trump-venous-insufficiency-explained-514642-20250718",
    "timestamp": "2025-07-18T18:31:22Z"
  },
  {
    "title": "Judge restores Democrat to Federal Trade Commission, ruling her firing by Trump was illegal",
    "description": "A federal judge has restored a Democrat to the Federal Trade Commission, ruling that President Donald Trump illegally fired her earlier this year in his efforts to exert control over independent agencies across the government",
    "link": "https://abcnews.go.com/Business/wireStory/judge-restores-democrat-federal-trade-commission-ruling-firing-123870519",
    "timestamp": "2025-07-18T18:30:28Z"
  },
  {
    "title": "Man accused of stockpiling bombs, using Biden photo for target practice, pleads guilty",
    "description": "A Virginia man has pleaded guilty in a federal case that accused him of stockpiling the largest number of finished explosives in FBI history",
    "link": "https://abcnews.go.com/US/wireStory/man-accused-stockpiling-bombs-biden-photo-target-practice-123871973",
    "timestamp": "2025-07-18T18:30:14Z"
  },
  {
    "title": "The TV President’s War on Democracy Comes for TV’s Institutions",
    "description": "By canceling \"The Late Show,\" CBS and Paramount simultaneously bend the knee to an aspiring despot, open the door for more TV titans to fall, and further compromise the public's faith in free speech.",
    "link": "https://www.indiewire.com/criticism/culture/donald-trump-war-democracy-tv-late-show-canceled-1235139403/",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://richmond.com/news/nation-world/government-politics/article_505ab2ba-ce43-5b0a-80f2-2c265771148c.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Michael Wolff on MAGA’s Revolt Over Jeffrey Epstein",
    "description": "The journalist talks about his interviews with the infamous abuser, and the political fallout from the White House’s attempt to close his case.",
    "link": "https://www.newyorker.com/podcast/the-new-yorker-radio-hour/michael-wolff-on-magas-revolt-over-jeffrey-epstein",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_9b35e801-3815-5cd5-8261-3e2e6a20f5eb.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Trump's approval rating on immigration and government spending slipped, AP-NORC poll finds",
    "description": "Only about one-quarter of U.S. adults say President Donald Trump's policies helped them since he took office, it found.",
    "link": "https://richmond.com/news/nation-world/crime-courts/article_505ab2ba-ce43-5b0a-80f2-2c265771148c.html",
    "timestamp": "2025-07-18T18:30:00Z"
  },
  {
    "title": "Charlamagne Struggles To Process News About CBS Cancelling Stephen Colbert’s Show",
    "description": "Charlamagne Tha God hysterically reacted to CBS' announcement that it will terminate Stephen Colbert’s “The Late Show” after the upcoming TV season.",
    "link": "https://dailycaller.com/2025/07/18/charlamagne-struggles-to-process-news-about-cbs-cancelling-stephen-colberts-show/",
    "timestamp": "2025-07-18T18:29:31Z"
  },
  {
    "title": "The new revelation about Trump and Jeffrey Epstein, explained",
    "description": "Just how close was Donald Trump to Jeffrey Epstein? The president’s onetime friendship with Jeffrey Epstein — the well-connected financier who was indicted for sex trafficking underage girls and died in prison in 2019 — has long been a matter of public record…",
    "link": "https://www.vox.com/politics/420340/jeffrey-epstein-trump-friends-birthday-book-secret",
    "timestamp": "2025-07-18T18:28:45Z"
  },
  {
    "title": "Skydance’s David Ellison Meets With FCC Chaiman Brendan Carr To Discuss Paramount Merger And Company’s “Commitment to Unbiased Journalism”",
    "description": "Skydance Media CEO David Ellison met with FCC Chairman Brendan Carr and other agency staffers this week to discuss the pending regulatory decision on the company’s merger with Paramount Global, where topics included news coverage. According to a filing with t…",
    "link": "http://deadline.com/2025/07/david-ellison-fcc-skydance-paramount-merger-1236462443/",
    "timestamp": "2025-07-18T18:28:17Z"
  },
  {
    "title": "The Tomato Tariff Racket",
    "description": "",
    "link": "https://biztoc.com/x/a0f07202ea27b3bb",
    "timestamp": "2025-07-18T18:27:53Z"
  },
  {
    "title": "Gavin Newsom mulls California redistricting to counter Texas gerrymandering",
    "description": "As President Donald Trump pushes Texas Republicans to adopt a controversial new redistricting plan to pad their congressional majority by up to five seats, California Gov. Gavin Newsom (D) has begun to float a similar scheme of his own: redrawing his state's …",
    "link": "https://biztoc.com/x/f0d9bcf835758b09",
    "timestamp": "2025-07-18T18:27:26Z"
  },
  {
    "title": "Stephen Colbert gets solidarity from fellow late-night hosts after cancellation news",
    "description": "Stephen Colbert was receiving messages of support and affection from his fellow late-night hosts after announcing that CBS was canceling his show, “The Late Show With Stephen Colbert,” next May.",
    "link": "https://www.clickorlando.com/entertainment/2025/07/18/stephen-colbert-gets-solidarity-from-fellow-late-night-hosts-after-cancellation-news/",
    "timestamp": "2025-07-18T18:26:19Z"
  },
  {
    "title": "FBI Agents Told To ‘Flag’ Epstein Files Mentioning Trump, Senator Claims",
    "description": "Senate Democrats pressed Pam Bondi and FBI leaders Friday for information about references to Trump in the Epstein files.",
    "link": "https://www.forbes.com/sites/alisondurkee/2025/07/18/fbi-agents-told-to-flag-epstein-files-mentioning-trump-senator-claims/",
    "timestamp": "2025-07-18T18:25:34Z"
  },
  {
    "title": "This Week in AI: AI Startups Hit Fundraising Gold",
    "description": "Fortunes are being spent in artificial intelligence (AI), with Perplexity, Thinking Machines and Anthropic attracting billions from investors. Meanwhile, Google, Meta and Blackstone have pledged to spend billions building AI data centers. Here is this week’s …",
    "link": "http://www.pymnts.com/news/artificial-intelligence/2025/this-week-in-ai-ai-startups-hit-fundraising-gold/",
    "timestamp": "2025-07-18T18:25:24Z"
  },
  {
    "title": "Donald Trump calls for release of Jeffrey Epstein testimony (Financial Times)",
    "description": "Financial Times:\nDonald Trump calls for release of Jeffrey Epstein testimony  —  US president directs attorney-general Pam Bondi to seek the unsealing of grand jury transcripts  —  Donald Trump has asked the US attorney-general to seek the release of grand ju…",
    "link": "https://www.memeorandum.com/250718/p84",
    "timestamp": "2025-07-18T18:25:05Z"
  },
  {
    "title": "For a ‘low payment,’ consultant offered to get Colorado counties off Trump’s list of sanctuary jurisdictions",
    "description": "\"When I received this email, I was floored. ... I saw it as the single most corrupt shakedown attempt that I've ever experienced, personally, in Colorado politics,\" a Jeffco commissioner said.",
    "link": "https://www.denverpost.com/2025/07/18/colorado-consultant-counties-immigration-sanctuary-jurisdictions-donald-trump/",
    "timestamp": "2025-07-18T18:25:03Z"
  },
  {
    "title": "Inside CBS’s Breakup With Stephen Colbert: Audience Shifts, Political Humor Made Unsustainable Mix",
    "description": "The state of late-night TV is keeping media executives from sleeping well. CBS’ decision to cut ties with Stephen Colbert and its decades-old “Late Show” franchise come next May will leave a major hole in the format — but one that has been widening. TV networ…",
    "link": "https://variety.com/2025/tv/news/inside-cbs-breakup-stephen-colbert-late-night-audience-1236464740/",
    "timestamp": "2025-07-18T18:22:43Z"
  },
  {
    "title": "What a Trump, Powell faceoff means for your money",
    "description": "Tensions are escalating between the White House and the Federal Reserve, with consumers caught in the middle.",
    "link": "https://www.cnbc.com/2025/07/18/what-trump-powell-faceoff-means-for-your-money.html",
    "timestamp": "2025-07-18T18:22:36Z"
  },
  {
    "title": "NPR’s chief STILL claiming there’s no bias in agenda-driven reporting",
    "description": "'We of course are a non-partisan organization and we want to serve and are required to serve the entirety of the American public'",
    "link": "https://www.wnd.com/2025/07/nprs-chief-still-claiming-theres-no-bias-agenda/",
    "timestamp": "2025-07-18T18:19:31Z"
  },
  {
    "title": "US rejects WHO global pandemic response accord",
    "description": "WASHINGTON (Reuters) -The United States has rejected an agreement adopted by members of the World Health Organization to improve preparedness for future pandemics following the disjointed global response to COVID-19, the government said on Friday. Read full s…",
    "link": "https://www.thestar.com.my/news/world/2025/07/19/us-rejects-who-global-pandemic-response-accord",
    "timestamp": "2025-07-18T18:19:00Z"
  },
  {
    "title": "Gavin Newsom mulls California redistricting to counter Texas gerrymandering",
    "description": "A controversial plan has become a major flashpoint among Democrats struggling for traction in the Trump era",
    "link": "https://theweek.com/politics/newsom-texas-california-gerrymander-house",
    "timestamp": "2025-07-18T18:18:28Z"
  },
  {
    "title": "Organizers Call for Shutdown of Immigrant Jails as Trump Expands Incarceration",
    "description": "Despite public outrage, Trump is doubling down on deportation policies designed to incarcerate 100,000 immigrants.",
    "link": "https://truthout.org/articles/organizers-call-for-shutdown-of-immigrant-jails-as-trump-expands-incarceration/",
    "timestamp": "2025-07-18T18:17:05Z"
  },
  {
    "title": "CNN's Wolf Blitzer: Trump's Letter To Epstein Is \"So, So Graphic\"",
    "description": "CNN's Wolf Blitzer acts like he doesn't enjoy reading the \"so, so graphic\" letter",
    "link": "https://www.realclearpolitics.com/video/2025/07/18/cns_wolf_blitzer_trumps_letter_to_epstein_is_so_so_graphic_im_going_to_read_it_now.html",
    "timestamp": "2025-07-18T18:15:32Z"
  },
  {
    "title": "Trump pulls US from World Health pandemic reforms",
    "description": "President Donald Trump's administration said Friday the United States was rejecting changes agreed last year for the World Health Organization on its",
    "link": "https://insiderpaper.com/trump-pulls-us-from-world-health-pandemic-reforms/",
    "timestamp": "2025-07-18T18:15:24Z"
  },
  {
    "title": "Nancy Pelosi Tells Unassuming Reporter He’d Be ‘Good Candidate’ For Alcatraz Prison",
    "description": "Democrat California Rep. Nancy Pelosi told a Scripps News reporter that he could be a contender and he could be a strong contender as a prisoner at Alcatraz.",
    "link": "https://dailycaller.com/2025/07/18/alcatraz-nancy-pelosi-scripps-news-nathaniel-reed-donald-trump/",
    "timestamp": "2025-07-18T18:14:29Z"
  },
  {
    "title": "Steve Moore: Trump’s economic policies leading to positive results for Americans",
    "description": "'I think it's the remarkable part of this story is we got 2.7% inflation, and the media and the Democrats have gone crazy. We had 6%, 7, 8, 9% inflation under Biden'",
    "link": "https://www.wnd.com/2025/07/steve-moore-trumps-economic-policies-leading-positive-results/",
    "timestamp": "2025-07-18T18:13:35Z"
  },
  {
    "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday - AP News",
    "description": "President Donald Trump will sign a new cryptocurrency bill into law on FridayAP News ‘Put up or shut up’: Landmark win in Congress to test crypto's viabilityPolitico Trump to sign landmark crypto bill, the GENIUS Act, at White House ceremonyCBS News WATCH LIV…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178411806",
    "timestamp": "2025-07-18T18:13:28Z"
  },
  {
    "title": "'Terrible Development': Trump Admin Restricts State Efforts to Help Kids Stay on Medicaid",
    "description": "The Trump administration on Thursday said it will restrict waivers that have allowed states to keep kids enrolled in Medicaid or the Children's Health Insurance Program beyond the 12-month period of continuous coverage required under federal law.The Centers f…",
    "link": "https://www.commondreams.org/news/trump-administration-medicaid-changes",
    "timestamp": "2025-07-18T18:10:29Z"
  },
  {
    "title": "Foreign Correspondent S34E12 1080p HDTV H264-CBFM",
    "description": "Season 34, Episode 12 – \"Trumps Wellness Warriors USA\"A wellness revolution has captured the White House. Donald Trump's ex-wife Marla Maples reveals the inside story behind the Make America Healthy Again movement and the role she played in uniting Robert F K…",
    "link": "https://post.rlsbb.ru/foreign-correspondent-s34e12-1080p-hdtv-h264-cbfm/",
    "timestamp": "2025-07-18T18:10:02Z"
  },
  {
    "title": "Tulsi Gabbard Releases Evidence Of ‘Years-Long Coup’ On Trump",
    "description": "Tulsi Gabbard released what she called \"overwhelming evidence\" showing Obama and others \"manufactured and politicized intelligence\" after Trump's 2016 victory.",
    "link": "https://dailycaller.com/2025/07/18/breaking-tulsi-gabbard-releases-evidence-of-years-long-coup-on-trump/",
    "timestamp": "2025-07-18T18:09:19Z"
  },
  {
    "title": "‘The Murdochs Hate Trump’: Bannon Accuses The Wall Street Journal And Fox News of Trying to Destroy MAGA",
    "description": "“Last night, we saw it in all its ugliness. The Murdochs hate Trump. The Murdochs want to take down Trump,\" Bannon declared\nThe post ‘The Murdochs Hate Trump’: Bannon Accuses The Wall Street Journal And Fox News of Trying to Destroy MAGA first appeared on Med…",
    "link": "https://www.mediaite.com/politics/the-murdochs-hate-trump-bannon-accuses-the-wall-street-journal-and-fox-news-of-trying-to-destroy-maga/",
    "timestamp": "2025-07-18T18:09:14Z"
  },
  {
    "title": "Democratic Lawmaker Demands 'the Evidence About Trump' Following Pam Bondi's Plans to Release of Epstein Case Transcripts",
    "description": "A Democratic lawmaker is demanding more evidence from Jeffrey Epstein's case be released, which he believes could include President Donald Trump.",
    "link": "https://www.ibtimes.com/democratic-lawmaker-demands-evidence-about-trump-following-pam-bondis-plans-release-epstein-3778885",
    "timestamp": "2025-07-18T18:08:17Z"
  },
  {
    "title": "President Donald Trump will sign a new cryptocurrency bill into law on Friday",
    "description": "President Donald Trump will sign a new cryptocurrency bill into law on Friday\nWASHINGTON (AP) — President Donald Trump on Friday will sign into law a new set of regulations for a type of cryptocurrency that are seen as a way to legitimize the burgeoning indus…",
    "link": "https://biztoc.com/x/41775187f82fd8ee",
    "timestamp": "2025-07-18T18:05:37Z"
  },
  {
    "title": "Podcast – Rachel Blevins – Trump’s Betrayal, Epstein’s Secrets & The Israeli Connection",
    "description": "Rachel Blevins brings some refreshing insight on Epstein, foreign policy, and Trump’s flip-flops. Rachel Blevins returns to The Free Thought Project Podcast this week for a hard-hitting, unfiltered conversation about the state of U.S. foreign policy, media ma…",
    "link": "https://www.activistpost.com/podcast-rachel-blevins-trumps-betrayal-epsteins-secrets-the-israeli-connection/",
    "timestamp": "2025-07-18T18:05:00Z"
  },
  {
    "title": "Donald Trump Jr., Omeed Malik are all about investing in companies that enhance US prosperity, even as GrabAGun has rocky debut",
    "description": "“A lot of the things that we've done over the last few years [have come] out of necessity,” Donald Trump Jr. said of 1789 Capital. “We saw the affront on not just ourselves and our family businesses, but on so many Americans — and we have that ability to push…",
    "link": "https://nypost.com/2025/07/18/business/1789-capital-investing-in-brands-that-enhance-us-prosperity/",
    "timestamp": "2025-07-18T18:04:47Z"
  },
  {
    "title": "The California Lawmaker Sounding the Alarm on Trump’s “Crypto Week”",
    "description": "As the Genius Act lands on the president’s desk, the California lawmaker says she’s concerned that “the rug will be pulled out from under the unsuspecting investors.”",
    "link": "https://www.vanityfair.com/news/story/the-california-lawmaker-sounding-the-alarm-on-trumps-crypto-week",
    "timestamp": "2025-07-18T18:02:53Z"
  },
  {
    "title": "If AUKUS Is Toast, What Should Australia Do Next?",
    "description": "Amid Elbridge Colby’s review of the submarine deal, three books consider the future of the alliance itself.",
    "link": "http://foreignpolicy.com/2025/07/18/australia-aukus-pentagon-review-indo-pacific/",
    "timestamp": "2025-07-18T18:00:04Z"
  },
  {
    "title": "10 signs of President's painful diagnosis... | | Swollen ankles, leg cramps, flaky skin...",
    "description": "DONALD Trump has been diagnosed with a painful vein condition after photos showed the US president with swollen ankles and bruised hands. The 79-year-old was given a thorough examination by White H…",
    "link": "https://www.the-sun.com/health/14750677/swollen-ankles-leg-cramps-donald-trumps-chronic-venous-insufficiency/",
    "timestamp": "2025-07-18T18:00:03Z"
  },
  {
    "title": "Trump, Vance and Musk are avatars of a dark and dangerous force",
    "description": "James Carville recently suggested that Democrats need to do more to reach out to young men, as though pandering to testosterone-fueled grievance and entitlement is the key to winning elections. Let’s be blunt: that’s a bullshit, dead-end strategy that risks r…",
    "link": "https://www.rawstory.com/raw-investigates/toxic-masculinity/",
    "timestamp": "2025-07-18T18:00:02Z"
  },
  {
    "title": "Bitcoin becomes 5th global asset ahead of “Crypto Week,” flips Amazon: Finance Redefined",
    "description": "Bitcoin flipped Amazon to become the fifth-largest global asset, fueled by investor excitement for more regulatory clarity after “Crypto Week” in Washington.",
    "link": "https://cointelegraph.com/news/bitcoin-5th-global-asset-crypto-week-amazon-finance-redefined",
    "timestamp": "2025-07-18T18:00:00Z"
  },
  {
    "title": "Congress Enshrines New Name for Wildlife Refuge to Honor Slain Texas Girl",
    "description": "The House of Representatives approved a bill this week enshrining the name of a wildlife preserve to memorialize a young Texas girl killed more than... Read More\nThe post Congress Enshrines New Name for Wildlife Refuge to Honor Slain Texas Girl appeared first…",
    "link": "https://www.dailysignal.com/2025/07/18/congress-enshrines-new-name-for-wildlife-refuge-to-honor-slain-texas-girl/",
    "timestamp": "2025-07-18T17:59:55Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "It's an effort to put to rest a political crisis largely of Trump's own making.",
    "link": "https://www.denverpost.com/2025/07/18/trump-epstein-explained/",
    "timestamp": "2025-07-18T17:58:27Z"
  },
  {
    "title": "Trump administration seeks release of Epstein grand jury records but not Justice Department files",
    "description": "It's an effort to put to rest a political crisis largely of Trump's own making.",
    "link": "https://www.bostonherald.com/2025/07/18/trump-epstein-explained/",
    "timestamp": "2025-07-18T17:58:27Z"
  },
  {
    "title": "With Colbert exit, Canada will lose the talk show host most attuned to our whims and politics",
    "description": "Whatever the reasons, next year's cancellation of The Late Show with Stephen Colbert will see the departure of the host in the current era of late night television who kept Canada in his sights, as the relationship with the U.S. turned from friendly with occa…",
    "link": "https://www.cbc.ca/news/entertainment/colbert-show-cancellation-canada-1.7588303",
    "timestamp": "2025-07-18T17:58:21Z"
  }
]