[
  {
    "title": "Colombian President Gustavo Petro Condemns U.S. Strike on Caribbean Drug Boat as 'Murder'",
    "description": "Far-left President of Colombia Gustavo Petro — a notoriously ardent cocaine advocate — denounced the U.S. precision strike against a drug-laden vessel in international waters as \"murder\" on Wednesday.\nThe post Colombian President Gustavo Petro Condemns U.S. S…",
    "link": "https://www.breitbart.com/national-security/2025/09/04/colombian-president-gustavo-petro-condemns-u-s-strike-on-caribbean-drug-boat-as-murder/",
    "timestamp": "2025-09-04T19:44:27Z"
  },
  {
    "title": "Bloomberg: “Economists Rally Behind Cook, Fed Independence in Open Letter”",
    "description": "In J. Marte, in Bloomberg: Prominent economists are rallying behind Federal Reserve Governor Lisa Cook after President Donald Trump moved to fire her based on allegations that she committed mortgage fraud. Nearly 600 economists have signed an open letter back…",
    "link": "https://econbrowser.com/archives/2025/09/bloomberg-economists-rally-behind-cook-fed-independence-in-open-letter",
    "timestamp": "2025-09-04T19:41:59Z"
  },
  {
    "title": "Social Media Reacts To Robert F. Kennedy Jr.'s Bonkers Hearing",
    "description": "Anyone expecting RFK Jr.'s appearance before the Senate Finance Committee to ease fears about his handling of the country’s health care was sadly mistaken.",
    "link": "https://www.huffpost.com/entry/social-media-reaction-rfk-jr-hearing_n_68b9d2fae4b09c6f4cf6762b",
    "timestamp": "2025-09-04T19:41:46Z"
  },
  {
    "title": "US justice department reportedly opens criminal inquiry into Fed governor Lisa Cook",
    "description": "Officials to investigate claims of mortgage fraud against Cook, who has refused to accept firing by Donald Trump",
    "link": "https://www.yahoo.com/news/articles/us-justice-department-reportedly-opens-194139044.html",
    "timestamp": "2025-09-04T19:41:39Z"
  },
  {
    "title": "AG Letitia James asks NY court to reinstate Trump’s civil fraud penalty",
    "description": "Attorney General Letitia James’ office filed a notice of appeal with the state’s Court of Appeals",
    "link": "https://nypost.com/2025/09/04/us-news/letitia-james-asks-ny-court-to-reinstate-trumps-civil-fraud-penalty/",
    "timestamp": "2025-09-04T19:41:20Z"
  },
  {
    "title": "‘Get the deal done’: GOP hardliner hails new Jan. 6 committee as Dems cry foul",
    "description": "WASHINGTON — This week House Republicans formally launched\r\n their long awaited new January 6 subcommittee. Unlike the first select committee, which investigated the attack on the Capitol Jan. 6, 2021, the new panel is tasked with investigating the investigat…",
    "link": "https://www.rawstory.com/raw-investigates/house-january-6/",
    "timestamp": "2025-09-04T19:41:18Z"
  },
  {
    "title": "Local TV Anchor Blasts Trump With 1 Word About His Recent Actions: 'Call It By Name'",
    "description": "“If all of this was happening in another nation, we would not hesitate to describe it clearly,” said 9News anchor Kyle Clark.",
    "link": "https://www.huffpost.com/entry/kyle-clark-donald-trump-space-command-authoritarianism_n_68b9c914e4b041ed82bdd240",
    "timestamp": "2025-09-04T19:39:34Z"
  },
  {
    "title": "Senators grill RFK, Jr. on vaccines, CDC changes",
    "description": "In a blistering hearing, Senators from both parties challenged the health secretary to defend his actions, including on vaccines access and CDC leadership.",
    "link": "https://www.npr.org/sections/shots-health-news/2025/09/04/nx-s1-5528966/rfk-kennedy-hearing-covid-vaccines-cdc",
    "timestamp": "2025-09-04T19:38:13Z"
  },
  {
    "title": "US to cut some security funds for countries bordering Russia, sources say",
    "description": "WASHINGTON (Reuters) -The United States will phase out some security assistance for European countries near the border with Russia, two sources familiar with the matter said on Thursday. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/us-to-cut-some-security-funds-for-countries-bordering-russia-sources-say",
    "timestamp": "2025-09-04T19:35:00Z"
  },
  {
    "title": "Donald Trump redesigned the White House's Rose Garden. See how the space has changed over the years",
    "description": "The White House Rose Garden then and now.\nLibrary of Congress, Erin Scott/Reuters\nEllen Wilson, the wife of Woodrow Wilson, established the Rose Garden in 1913.\nIt was redesigned under the Kennedy administration and has hosted many historic events.\nDonald Tru…",
    "link": "https://biztoc.com/x/323e4155ac8c36ee",
    "timestamp": "2025-09-04T19:34:51Z"
  },
  {
    "title": "Trump’s lawyers just inadvertently admitted that his tariffs are illegal",
    "description": "President Donald Trump holds up a chart while speaking during trade announcement event at the White House on April 2, 2025. | Chip Somodevilla/Getty Images \nThe Trump administration formally asked the Supreme Court on Wednesday evening to decide whether Presi…",
    "link": "https://biztoc.com/x/4496f0a8094b5e20",
    "timestamp": "2025-09-04T19:34:42Z"
  },
  {
    "title": "Despite Turmoil, America’s Most Reliable Job Count Still Comes From the BLS",
    "description": "If you want to know how the U.S. job market is faring, economists still trust the Bureau of Labor Statistics' \"gold standard\" more than alternative sources...",
    "link": "https://www.investopedia.com/why-the-bls-is-still-the-king-of-economic-data-11803565",
    "timestamp": "2025-09-04T19:32:16Z"
  },
  {
    "title": "New York AG appeals ruling that erased penalty in Trump civil fraud case",
    "description": "New York's attorney general is appealing the ruling that slashed President Trump's half-billion-dollar penalty in his civil fraud case.",
    "link": "https://www.cbsnews.com/news/new-york-trump-civil-fraud-attorney-general-appeal/",
    "timestamp": "2025-09-04T19:31:50Z"
  },
  {
    "title": "Donald Trump redesigned the White House's Rose Garden. See how the space has changed over the years.",
    "description": "President Donald Trump's Rose Garden redesign is one of many decor changes he's made to White House. Take a look at the new \"Rose Garden Club.\"",
    "link": "https://www.businessinsider.com/melania-trump-white-house-rose-garden-design-history-2020-8",
    "timestamp": "2025-09-04T19:30:54Z"
  },
  {
    "title": "Republican Senator Traps RFK Jr. With Trump Nobel Prize Question",
    "description": "Senator Bill Cassidy deftly grilled Health and Human Services Secretary Robert F. Kennedy Jr. in a Senate hearing Thursday, forcing Kennedy to contradict himself on the topic of vaccines.Cassidy, who chairs the Health Committee, is a Republican and a medical …",
    "link": "https://newrepublic.com/post/200018/republican-senator-traps-rfk-jr-trump-nobel-prize-question",
    "timestamp": "2025-09-04T19:30:51Z"
  },
  {
    "title": "Judge orders Trump administration to release billions in foreign aid approved by Congress",
    "description": "The judge ordered the release of $11.5 billion that is set to expire at the end of the month.",
    "link": "https://www.bostonherald.com/2025/09/04/trump-foreign-aid-congress/",
    "timestamp": "2025-09-04T19:30:41Z"
  },
  {
    "title": "Friday's jobs report could confirm a slowing labor market. But will stocks care?",
    "description": "Just how much it does will matter to investors.",
    "link": "https://www.cnbc.com/2025/09/04/the-august-jobs-report-could-confirm-a-slowing-labor-market-but-will-stocks-care.html",
    "timestamp": "2025-09-04T19:28:09Z"
  },
  {
    "title": "Report: Hundreds of Migrants Self-Deporting from Chicago",
    "description": "Many Mexican nationals illegally living in Chicago are self-deporting even before President Donald Trump steps up enforcement in the Democrat-run city.\nThe post Report: Hundreds of Migrants Self-Deporting from Chicago appeared first on Breitbart.",
    "link": "https://www.breitbart.com/immigration/2025/09/04/report-hundreds-of-migrants-self-deporting-from-chicago/",
    "timestamp": "2025-09-04T19:27:49Z"
  },
  {
    "title": "Judge upbraids prosecutors for handling of DC surge cases, saying they have 'no credibility left'",
    "description": "A federal magistrate judge has angrily accused Justice Department prosecutors of trampling on the civil rights of people arrested during President Donald Trump’s law-enforcement surge in the nation’s capital",
    "link": "https://abcnews.go.com/Politics/wireStory/judge-upbraids-prosecutors-handling-dc-surge-cases-credibility-125268177",
    "timestamp": "2025-09-04T19:27:42Z"
  },
  {
    "title": "In Face Of US 'Threat,' How Does Venezuela's Military Stack Up?",
    "description": "With an ill-disciplined military and an outdated arsenal, Venezuela would be at a serious disadvantage in the event of an American invasion, experts say.",
    "link": "https://www.ibtimes.com/face-us-threat-how-does-venezuelas-military-stack-3782522",
    "timestamp": "2025-09-04T19:27:18Z"
  },
  {
    "title": "Elizabeth Warren Torches RFK Jr. in Fiery Spat Over CDC: ‘You Should Resign’ | Video",
    "description": "Susan Monarez says she was fired for refusing to approve vaccine recommendations that aren't backed by science\nThe post Elizabeth Warren Torches RFK Jr. in Fiery Spat Over CDC: ‘You Should Resign’ | Video appeared first on TheWrap.",
    "link": "https://www.thewrap.com/elizabeth-warren-rfk-jr-vaccines-cdc-susan-monarez-firing/",
    "timestamp": "2025-09-04T19:26:38Z"
  },
  {
    "title": "Trump will host top tech CEOs except Musk at a White House dinner",
    "description": "President Donald Trump will host a high-powered list of tech CEOs for a dinner at the White House",
    "link": "https://abcnews.go.com/Technology/wireStory/trump-host-top-tech-ceos-except-musk-white-125242358",
    "timestamp": "2025-09-04T19:26:34Z"
  },
  {
    "title": "Macron hopeful of US support to Kyiv’s security as 26 nations pledge troops",
    "description": "Twenty-six allies promise troops for Ukraine after fighting stops, as Russia shows no signs of being ready to end war.",
    "link": "https://www.aljazeera.com/news/2025/9/4/macron-says-no-doubt-over-us-support-for-ukraine-reassurance-force",
    "timestamp": "2025-09-04T19:26:05Z"
  },
  {
    "title": "‘It’s a war’: Marco Rubio labels Ecuadorian cartels ‘foreign terrorists’",
    "description": "The US diplomat suggested continued action against Latin American gangs while in Ecuador, days after a strike on a boat.",
    "link": "https://www.aljazeera.com/news/2025/9/4/its-a-war-marco-rubio-labels-ecuadorian-cartels-foreign-terrorists",
    "timestamp": "2025-09-04T19:24:46Z"
  },
  {
    "title": "Nigel Farage Argues With Dem Congressman Over Trump, Reform Party",
    "description": "British Member of Parliament Nigel Farage, leader of the political party Reform UK, was testifying Wednesday before the House Judiciary Committee on free speech when Democratic Georgia Rep. Hank Johnson pressed him on his connections to President Donald Trump…",
    "link": "https://dailycaller.com/2025/09/04/nigel-farage-hank-johnson-house-democrat-trump-reform-uk/",
    "timestamp": "2025-09-04T19:23:36Z"
  },
  {
    "title": "World Liberty Financial Blacklists Justin Sun's Address With $107M WLFI",
    "description": "World Liberty Financial (WLFI), the crypto protocol linked to Donald Trump and his family, on Thursday blacklisted Tron founder and key investor Justin Sun's blockchain address, impeding him from transfering WLFI tokens.\nThe move affects 595 million unlocked …",
    "link": "https://biztoc.com/x/69bd376bbb89d038",
    "timestamp": "2025-09-04T19:23:36Z"
  },
  {
    "title": "In face of US ‘threat,’ how does Venezuela’s military stack up?",
    "description": "With an ill-disciplined military and an outdated arsenal, Venezuela would be at a serious disadvantage in the event of an American invasion, experts say. President Nicolas Maduro has declared his country prepared for “a period of armed struggle in defense of …",
    "link": "https://www.digitaljournal.com/world/in-face-of-us-threat-how-does-venezuelas-military-stack-up/article",
    "timestamp": "2025-09-04T19:23:33Z"
  },
  {
    "title": "Trump Asks Supreme Court to Expedite and Overturn Tariffs Ruling",
    "description": "President Donald Trump has filed a petition asking for a review of a new federal appeals court ruling in Washington DC that found most of his trade tariffs to be illegal.\nThe Trump administration asked for the Supreme Court to make a new judgement by Septembe…",
    "link": "https://biztoc.com/x/19a728b103d3097b",
    "timestamp": "2025-09-04T19:23:18Z"
  },
  {
    "title": "On This One Thing, I Agree With J.D. Vance",
    "description": "I don’t like cynicism when it comes to prayer. And on this issue, it comes from both sides.",
    "link": "https://slate.com/life/2025/09/minneapolis-school-shooting-jd-vance-minnesota-prayer.html",
    "timestamp": "2025-09-04T19:21:51Z"
  },
  {
    "title": "Trump’s lawyers just inadvertently admitted that his tariffs are illegal",
    "description": "The Trump administration formally asked the Supreme Court on Wednesday evening to decide whether President Donald Trump’s ever-shifting tariff policy is lawful. Two federal courts, and a total of 10 federal judges, have all concluded that it is not. The remar…",
    "link": "https://www.vox.com/scotus/460312/supreme-court-trump-tariffs-vos-selections",
    "timestamp": "2025-09-04T19:21:43Z"
  },
  {
    "title": "New York attorney general asks court to reinstate President Trump’s massive civil fraud penalty",
    "description": "A lower-court decision slashed the potential half-billion-dollar fine to $0.",
    "link": "https://www.bostonherald.com/2025/09/04/trump-fraud-lawsuit-appeal-penalty/",
    "timestamp": "2025-09-04T19:20:29Z"
  },
  {
    "title": "OpenAI announces AI-powered hiring platform to take on LinkedIn | TechCrunch",
    "description": "The OpenAI Jobs Platform is set to launch in mid-2026, and will use AI to match candidates with businesses.",
    "link": "https://techcrunch.com/2025/09/04/openai-announces-ai-powered-hiring-platform-to-take-on-linkedin/",
    "timestamp": "2025-09-04T19:19:46Z"
  },
  {
    "title": "Donald Trump asks supporters to donate $15 to 'get him to heaven'",
    "description": "US President Donald Trump has asked supporters to donate $15 to help 'get him to heaven' in baffling new move.",
    "link": "https://www.ladbible.com/news/us-news/donald-trump-15-dollar-heaven-donations-878268-20250904",
    "timestamp": "2025-09-04T19:19:33Z"
  },
  {
    "title": "Trump calls out Europe for 'funding' Putin's war and failing to 'pressure' China",
    "description": "Trump demands Europe end Russian oil funding worth $1.3 billion annually and apply economic pressure on China supporting Putin's war efforts in Ukraine.",
    "link": "https://www.foxnews.com/world/trump-calls-out-europe-funding-putins-war-failing-pressure-china",
    "timestamp": "2025-09-04T19:17:02Z"
  },
  {
    "title": "'Not what they signed up for': National Guard troops baffled by Trump's deployment",
    "description": "With President Donald Trump having deployed the National Guard to patrol Washington, D.C. for weeks as part of his takeover of the district, and lawsuits advancing against it, there is another issue Trump has to contend with, CNN's Jeff Zeleny told anchor Bor…",
    "link": "https://www.rawstory.com/national-guard-2673961138/",
    "timestamp": "2025-09-04T19:16:11Z"
  },
  {
    "title": "Trump Is Accusing Foes With Multiple Mortgages of Fraud. Records Show 3 of His Cabinet Members Have Them.",
    "description": "by Robert Faturechi, Justin Elliott and Alex Mierjeski \n \n\n \n \n ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive our biggest stories as soon as they’re published.\n\n \n\n \n\n \n \n\n\n\n \nThe Trump administration has vowed to go…",
    "link": "https://www.propublica.org/article/trump-cabinet-mortgage-fraud",
    "timestamp": "2025-09-04T19:15:00Z"
  },
  {
    "title": "If You Don't Like Socialism or the Establishment, Curtis Sliwa Wants Your Vote",
    "description": "The Guardian Angels founder and New York mayoral candidate talks about crime, drugs, zoning, and what the government could learn from squatters.",
    "link": "https://reason.com/podcast/2025/09/05/if-you-dont-like-socialism-or-the-establishment-curtis-sliwa-wants-your-vote/",
    "timestamp": "2025-09-04T19:14:35Z"
  },
  {
    "title": "Zohran Mamdani: Trump’s meddling in NYC mayoral race is ‘an affront to our city’s democracy’",
    "description": "New York City mayoral candidate Zohran Mamdani blasted Trump's \"outrageous\" plan to boost Andrew Cuomo's candidacy by giving Eric Adams an administration post.",
    "link": "https://www.msnbc.com/top-stories/latest/zohran-mamdani-andrew-cuomo-eric-adams-trump-new-york-city-election-rcna229115",
    "timestamp": "2025-09-04T19:12:40Z"
  },
  {
    "title": "Trump didn't order military flyover to 'silence' Epstein survivors",
    "description": "Fighter jets briefly interrupted a news conference on the Capitol lawn featuring survivors of Jeffrey Epstein’s sexual abuse.",
    "link": "https://www.snopes.com//fact-check/trump-military-flyover-epstein-victims/",
    "timestamp": "2025-09-04T19:12:00Z"
  },
  {
    "title": "Can US tourism survive Trump's policies?",
    "description": "The tourist economy is 'heading in the wrong direction'",
    "link": "https://theweek.com/politics/tourism-us-survive-trump-policies",
    "timestamp": "2025-09-04T19:10:06Z"
  },
  {
    "title": "New ICE Data Shows Steady Rise in Immigrants Self-Deporting",
    "description": "The number of people leaving the country voluntarily is still relatively meager.",
    "link": "https://www.newsweek.com/ice-data-immigrants-self-deportation-trump-administration-2124106",
    "timestamp": "2025-09-04T19:08:44Z"
  },
  {
    "title": "Princeton's Udi Ofer is choreographing a rare consensus across partisan lines",
    "description": "A bipartisan effort to reform criminal justice policy, led by Ofer and Princeton SPIA, has buy-in from both CPAC and the ACLU, among others.",
    "link": "https://www.princeton.edu/news/2025/09/04/princetons-udi-ofer-choreographing-rare-consensus-across-partisan-lines",
    "timestamp": "2025-09-04T19:07:38Z"
  },
  {
    "title": "Senator introduces new bill to eliminate taxes on Social Security benefits",
    "description": "Trump's \"big beautiful bill\" helps seniors who pay tax on Social Security benefits, but doesn't eliminate those levies. Lawmakers are pushing for permanent change.",
    "link": "https://www.cnbc.com/2025/09/04/no-tax-on-social-security-benefits-bill.html",
    "timestamp": "2025-09-04T19:06:32Z"
  },
  {
    "title": "Federal Judge Said Trump Can’t Be National Police Chief. Will His Word Be Final?",
    "description": "A court held that Trump “willfully” violated the Posse Comitatus Act by sending troops to enforce immigration law in LA.",
    "link": "https://truthout.org/articles/federal-judge-said-trump-cant-be-national-police-chief-will-his-word-be-final/",
    "timestamp": "2025-09-04T19:04:07Z"
  },
  {
    "title": "Donald Trump Snubs Elon Musk Yet Again, Invites All of His Biggest Competitors to the White House",
    "description": "President Donald Trump is throwing a major party in the White House's recently paved-over Rose Garden for some of the biggest names in tech — but billionaire Elon Musk's name isn't on the list. As The Hill first reported, the upcoming event will see high-prof…",
    "link": "https://futurism.com/the-byte/donald-trump-snubs-elon-musk-white-house",
    "timestamp": "2025-09-04T19:04:03Z"
  },
  {
    "title": "DC sues Trump over 'military occupation' by National Guardsmen",
    "description": "The suit was filed one day after a federal judge declared illegal Trump’s use of military personnel for law enforcement in LA.",
    "link": "https://www.newsfromthestates.com/article/trump-sued-over-district-columbia-military-occupation-state-national-guard-units",
    "timestamp": "2025-09-04T19:03:36Z"
  },
  {
    "title": "Las Vegas travel is slumping. What does it mean for the rest of the U.S.?",
    "description": "Las Vegas has seen visitation decline for seven consecutive months, with the most recent report from July showing a 12% decline year over year.",
    "link": "https://www.cnbc.com/2025/09/04/mgm-resorts-ceo-las-vegas-slump-us-travel.html",
    "timestamp": "2025-09-04T19:03:33Z"
  },
  {
    "title": "Pro-MAGA Activist Publishes Clip of Trump DOJ Official Saying Ghislaine Maxwell Was Moved to ‘Keep Her Quiet’",
    "description": "James O’Keefe, the Project Veritas founder and longtime pro-MAGA activist, published a clip on Thursday of a Trump Justice Department official claiming that Ghislaine Maxwell was moved to prison “to keep her quiet.” In the clip, an off-camera woman asks Josep…",
    "link": "https://freerepublic.com/focus/f-chat/4338623/posts",
    "timestamp": "2025-09-04T19:03:06Z"
  },
  {
    "title": "The rich are 'squeezing out' ordinary people and this millionaire aims to stop it",
    "description": "Gary Stevenson achieved his childhood dream of becoming rich by his mid-20s. The 39-year-old now spends most of his time campaigning against the wealthy.",
    "link": "https://www.abc.net.au/news/2025-09-05/gary-stevenson-economist-and-former-trader/105734926",
    "timestamp": "2025-09-04T19:02:36Z"
  },
  {
    "title": "World Liberty Financial Blacklists Justin Sun's Address With $107M WLFI",
    "description": "Sun is a key investor in the project and holds around $700 million worth of WLFI tokens, mostly vested.",
    "link": "https://www.coindesk.com/tech/2025/09/04/world-liberty-financial-blacklists-justin-sun-s-address-with-usd107m-wlfi",
    "timestamp": "2025-09-04T19:02:28Z"
  },
  {
    "title": "Search warrant reveals what feds seized at John Bolton’s home",
    "description": "FBI agents raided former national security adviser John Bolton's home and seized multiple computers, phones, and documents related to his handling of...",
    "link": "https://thehill.com/homenews/administration/5486592-bolton-fbi-raid-seized-documents/",
    "timestamp": "2025-09-04T19:02:11Z"
  },
  {
    "title": "Trump's cult is horrific – but it contains the seeds of its own destruction",
    "description": "America is at risk of abandoning its founding principle of government, “by and for the people,” in favor of a system older than democracy itself: rule by one man.Pretty much everybody understands that the United States and the old Soviet Union both had govern…",
    "link": "https://www.rawstory.com/2673949168/",
    "timestamp": "2025-09-04T19:01:49Z"
  },
  {
    "title": "About half of Americans think Donald Trump would accept a bribe if offered one",
    "description": "Democrats are much more likely than Republicans to say corruption is a very serious problem among Republican U.S. presidents.",
    "link": "https://biztoc.com/x/bc2bf033cf396336",
    "timestamp": "2025-09-04T19:01:08Z"
  },
  {
    "title": "White House Tells Agencies to Tackle Offshore Wind Projects",
    "description": "Let's not forget the numerous problems these projects have caused, especially near Nantucket.\nThe post White House Tells Agencies to Tackle Offshore Wind Projects first appeared on Le·gal In·sur·rec·tion.",
    "link": "https://legalinsurrection.com/2025/09/white-house-tells-agencies-to-tackle-offshore-wind-projects/",
    "timestamp": "2025-09-04T19:00:57Z"
  },
  {
    "title": "Live updates: RFK Jr. grilled on anti-vaccine policy in combative Senate hearing (Associated Press)",
    "description": "Associated Press:\nLive updates: RFK Jr. grilled on anti-vaccine policy in combative Senate hearing  —  Cassidy opened his remarks by saying he felt President Donald Trump deserved a Nobel prize for Operation Warp Speed, then said Kennedy's cancelation of $500…",
    "link": "https://www.memeorandum.com/250904/p84",
    "timestamp": "2025-09-04T19:00:30Z"
  },
  {
    "title": "Who is Joseph Ladapo, the Florida health official who opposes vaccine mandates?",
    "description": "Ladapo announced this week that Florida would seek to end all mandates, including those for schoolchildren",
    "link": "https://www.bbc.com/news/articles/c62q41qm9pvo",
    "timestamp": "2025-09-04T18:59:55Z"
  },
  {
    "title": "Abrego Garcia case prompts key DOJ oustings, clears way for Trump deportation agenda",
    "description": "The deportation case of Kilmar Abrego Garcia has led to multiple Justice Department firings and prompted federal judges to question the government's actions.",
    "link": "https://www.foxnews.com/politics/abrego-garcia-case-prompts-key-doj-oustings-clears-way-trump-deportation-agenda",
    "timestamp": "2025-09-04T18:58:11Z"
  },
  {
    "title": "Finally, a European Leader Said Out Loud What All of Them Are Likely Thinking About Trump",
    "description": "Is the charge worth taking seriously? Yes, if it’s also taken literally.",
    "link": "https://slate.com/news-and-politics/2025/09/trump-putin-russian-asset-portugal-president.html",
    "timestamp": "2025-09-04T18:57:39Z"
  },
  {
    "title": "Dan Andrews's red carpet walk in Beijing put Albanese on the spot",
    "description": "Despite being in an overwhelmingly dominant position politically, Anthony Albanese sounded quite tetchy this week.",
    "link": "https://www.abc.net.au/news/2025-09-05/anthony-albanese-dan-andrews-sam-rae-aged-care/105720260",
    "timestamp": "2025-09-04T18:57:34Z"
  },
  {
    "title": "RFK Jr. defends firing spree at CDC, vows ‘new blood’ at agency",
    "description": "Health secretary Robert F. Kennedy Jr. defends CDC firings during Senate hearing, citing poor COVID-19 response and promising new leadership at the agency.",
    "link": "https://www.foxnews.com/politics/rfk-jr-defends-firing-spree-cdc-vows-new-blood-agency",
    "timestamp": "2025-09-04T18:56:10Z"
  },
  {
    "title": "Sydney Sweeney Says She Won't Talk About American Eagle Controversy As New Movie Premieres This Weekend",
    "description": "Sweeney’s new movie “Christy” premieres at the Toronto International Film Festival this weekend, but she’s refusing to talk about her controversial American Eagle jeans ad.",
    "link": "https://www.forbes.com/sites/conormurray/2025/09/04/sydney-sweeney-says-she-wont-talk-about-american-eagle-controversy-as-new-movie-premieres-this-weekend/",
    "timestamp": "2025-09-04T18:56:04Z"
  },
  {
    "title": "Justin Sun’s WLFI wallet blacklisted after $9M token transfer",
    "description": "Justin Sun’s WLFI token address was reportedly blacklisted from transferring $9 million, fueling speculation amid a sharp price drop in early trading.",
    "link": "https://cointelegraph.com/news/justin-sun-wlfi-address-blacklisted",
    "timestamp": "2025-09-04T18:55:00Z"
  },
  {
    "title": "Missouri Republicans begin redistricting to erase one Democratic seat in US House | CNN Politics",
    "description": "The Republican-controlled Missouri legislature began redrawing its congressional map Thursday to target one Democratic-held seat in the US House, responding to demands by President Donald Trump and his allies to help the GOP eke out more seats in next year’s …",
    "link": "https://www.cnn.com/2025/09/04/politics/missouri-redistricting-republicans",
    "timestamp": "2025-09-04T18:53:50Z"
  },
  {
    "title": "Wall Street’s Bet Against the Trump Tariffs - The New York Times",
    "description": "Wall Street’s Bet Against the Trump TariffsThe New York Times With court's tariff ruling, businesses could soon be owed refunds. Here's what to know.CBS News What is American Workers Rebate Act of 2025 status? Who qualifies for Trump stimulus checkErie Times-…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=179008746",
    "timestamp": "2025-09-04T18:53:08Z"
  },
  {
    "title": "Brett Favre Says ‘Common Sense’ Drove His Support For Trump",
    "description": "Brett Favre explained why he chose to publicly back President Donald Trump ahead of the November election.",
    "link": "https://dailycaller.com/2025/09/04/brett-favre-says-common-sense-helped-him-support-trump/",
    "timestamp": "2025-09-04T18:50:14Z"
  },
  {
    "title": "If Trump’s tariffs are thrown out, companies could be refunded billions",
    "description": "President Donald Trump likes to boast about how much money the U.S. Treasury is raking in from the massive taxes—tariffs—he’s slapped this year on imports from almost every country in the world.\n“We have trillions of dollars coming into our country,” Trump sa…",
    "link": "https://biztoc.com/x/aedf5398dc8c6704",
    "timestamp": "2025-09-04T18:50:13Z"
  },
  {
    "title": "The Media Don’t Want To Revisit Their Russiagate Frenzy",
    "description": "By Tim Graham via The Daily Signal | September 04, 2025\nThere’s something darkly funny about liberal journalists insisting any new focus on the Russiagate frenzy of 2017-19 is a “distraction” from their current obsession over President Donald Trump and Jeffre…",
    "link": "https://biztoc.com/x/8a69d9d7ec57c4f5",
    "timestamp": "2025-09-04T18:49:54Z"
  },
  {
    "title": "Robert F Kennedy hearing turns rancorous as Democrats press him on Covid vaccine changes",
    "description": "US health secretary Robert F Kennedy Jr came under pointed bipartisan questioning at a rancorous three-hour senate committee hearing on Thursday, about - among other things - turmoil at federal health agencies and efforts to pull back recommendations for Covi…",
    "link": "https://www.independent.ie/world-news/north-america/robert-f-kennedy-hearing-turns-rancorous-as-democrats-press-him-on-covid-vaccine-changes/a765894819.html",
    "timestamp": "2025-09-04T18:49:51Z"
  },
  {
    "title": "Vile Grifters Are Taking Over Establishment Media",
    "description": "Jack Mirkinson\n\n\n\nParamount is reportedly set to pay between $100 million and $200 million for The Free Press and will install Bari Weiss at the top of CBS News.\r\n\n\r\n\n\nThe post Vile Grifters Are Taking Over Establishment Media appeared first on The Nation.",
    "link": "https://www.thenation.com/article/society/bari-weiss-free-press-cbs-news-paramount/",
    "timestamp": "2025-09-04T18:48:08Z"
  },
  {
    "title": "If you bought a gold bar at Costco last year, here is what it's worth now",
    "description": "Gold hit a record $3,578 per ounce before declining Thursday, driven by weak jobs data and investor concerns about tariffs and Federal Reserve policy changes...",
    "link": "https://www.foxbusiness.com/economy/you-bought-gold-bar-costco-last-year-here-what-its-worth-now",
    "timestamp": "2025-09-04T18:46:56Z"
  },
  {
    "title": "Northwestern University president announces resignation following federal funding cuts by Trump administration",
    "description": "During the wave of pro-Palestinian protests Northwestern drew ire from conservatives over an agreement it struck with demonstrators to take down their encampment.",
    "link": "https://indianexpress.com/article/world/northwestern-university-president-michael-schill-announces-resignation-10230877/",
    "timestamp": "2025-09-04T18:46:49Z"
  },
  {
    "title": "Rubio says Trump 'wants to wage war' on Venezuelan drug traffickers: 'Blow them up if that's what it takes'",
    "description": "Secretary of State Marco Rubio emphasized the importance of designating Ecuadorian gangs as terror groups while declaring war on drug traffickers.",
    "link": "https://www.foxnews.com/world/rubio-says-trump-wants-wage-war-venezuelan-drug-traffickers-blow-them-up-thats-what-takes",
    "timestamp": "2025-09-04T18:46:31Z"
  },
  {
    "title": "WATCH: Sen. Cassidy asks RFK Jr. how he can support Nobel for Trump COVID program but not back the vaccines",
    "description": "Cassidy said it surprised him that Kennedy would think so highly of Operation Warp Speed when the health secretary has attempted to restrict access to the vaccines and cancelled funding for mRNA vaccine research that was critical to the initiative's mission.",
    "link": "https://www.pbs.org/newshour/politics/watch-sen-cassidy-asks-rfk-jr-how-he-can-support-nobel-for-trump-covid-program-but-not-back-the-vaccines",
    "timestamp": "2025-09-04T18:45:53Z"
  },
  {
    "title": "Trump pushes Europe to stop purchasing Russian oil and up pressure on China in latest effort to end Ukraine war",
    "description": "Now almost three weeks after his high-stakes Alaskan summit with Russian President Vladimir Putin, Trump is growing increasingly frustrated with the lack of progress on peace.",
    "link": "https://www.cnn.com/2025/09/04/politics/ukraine-war-trump-security-guarantees",
    "timestamp": "2025-09-04T18:45:35Z"
  },
  {
    "title": "Hunger grows in Nigeria as aid cuts reduce food supplies",
    "description": "DIKWA, Nigeria (Reuters) -Destitute families displaced by conflict in northeastern Nigeria are finding nutrition centres closed or running low on food as a result of a collapse in aid funding from the United States and other Western countries. Read full story",
    "link": "https://www.thestar.com.my/news/world/2025/09/05/hunger-grows-in-nigeria-as-aid-cuts-reduce-food-supplies",
    "timestamp": "2025-09-04T18:44:00Z"
  },
  {
    "title": "DOJ does damage control as staffer admits Republicans will be redacted from Epstein files",
    "description": "The Department of Justice attempted to do damage control after conservative political activist James O'Keefe released a video of a staffer claiming the government would \"redact every Republican\" from files about sex offender Jeffrey Epstein.In a Thursday post…",
    "link": "https://www.rawstory.com/doj-epstein-redact-republicans/",
    "timestamp": "2025-09-04T18:42:50Z"
  },
  {
    "title": "Trump Touts Strengthening of Social Security Administration",
    "description": "President Donald Trump is touting a range of the Social Security Administration's (SSA) accomplishments that have strengthened the SSA as a whole since his return to office.\nThe post Trump Touts Strengthening of Social Security Administration appeared first o…",
    "link": "https://www.breitbart.com/politics/2025/09/04/trump-touts-strengthening-of-social-security-administration/",
    "timestamp": "2025-09-04T18:41:05Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington, DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions betwee",
    "link": "https://www.channelnewsasia.com/asia/washington-dc-sues-trump-administration-over-national-guard-deployment-5333231",
    "timestamp": "2025-09-04T18:38:25Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington, DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions betwee",
    "link": "https://www.channelnewsasia.com/world/washington-dc-sues-trump-administration-over-national-guard-deployment-5333231",
    "timestamp": "2025-09-04T18:38:00Z"
  },
  {
    "title": "Washington DC sues Trump administration over National Guard deployment",
    "description": "WASHINGTON: Washington DC sued US President Donald Trump's administration on Thursday (Sep 4) over his deployment of National Guard troops in the capital city, a move likely to heighten tensions between",
    "link": "https://www.channelnewsasia.com/world/washington-sues-trump-administration-national-guard-5333231",
    "timestamp": "2025-09-04T18:38:00Z"
  },
  {
    "title": "Senate clashes with RFK Jr over vaccine policies and CDC firings",
    "description": "RFK Jr faces bipartisan criticism for allegedly undermining vaccine trust and reshaping public health leadership.",
    "link": "https://www.aljazeera.com/news/2025/9/4/senate-clashes-with-rfk-jr-over-vaccine-policies-and-cdc-firings",
    "timestamp": "2025-09-04T18:37:11Z"
  },
  {
    "title": "‘You’re Full of Sh*t’: JD Vance Rages At Democrats’ Rough Questioning of RFK Jr.",
    "description": "J.D. Vance came to the defense of RFK Jr. as the HHS secretary underwent a beating before the Senate Finance Committee over his recent changes at the CDC.\nThe post ‘You’re Full of Sh*t’: JD Vance Rages At Democrats’ Rough Questioning of RFK Jr. first appeared…",
    "link": "https://www.mediaite.com/media/news/youre-full-of-sht-jd-vance-rages-at-democrats-rough-questioning-of-rfk-jr/",
    "timestamp": "2025-09-04T18:36:27Z"
  },
  {
    "title": "RFK Jr. Calls Out CDC’s ‘Disastrous’ Failures, Defends Cleaning House In Heated Hearing",
    "description": "Robert F. Kennedy Jr. challenged the record of the CDC on the COVID-19 pandemic and the precipitous rise in chronic disease in the U.S. as he defended his reforms Thursday.",
    "link": "https://dailycaller.com/2025/09/04/rfk-jr-cdc-failures-senate-hearing/",
    "timestamp": "2025-09-04T18:36:17Z"
  },
  {
    "title": "Northwestern University president to resign following tenure marked by tension",
    "description": "Northwestern University President Michael Schill announced Thursday that he will resign, ending a three-year tenure marked by the freeze of hundreds of millions of dollars in federal funding by the Trump administration and heated criticism from House R...",
    "link": "https://abcnews.go.com/Politics/wireStory/northwestern-university-president-resign-tenure-marked-white-house-125266540",
    "timestamp": "2025-09-04T18:33:53Z"
  },
  {
    "title": "Raskin: Trump Trying to Take 'Stalinist Style Control' of Colleges and Universities",
    "description": "Thursday on MSNBC's \"Morning Joe,\" Rep. Jamie Raskin (D-MD) accused President Donald Trump of trying to exercise \"Stalinist-style control\" over colleges and universities across the country.\nThe post Raskin: Trump Trying to Take ‘Stalinist Style Control’ of Co…",
    "link": "https://www.breitbart.com/clips/2025/09/04/raskin-trump-trying-to-take-stalinist-style-control-of-colleges-and-universities/",
    "timestamp": "2025-09-04T18:33:45Z"
  },
  {
    "title": "BLM co-founder debuts homeless youth documentary as Trump sweeps encampments in DC",
    "description": "The film is screening through Sept. 7 on the Seattle Film Festival's online platform.",
    "link": "https://www.bostonherald.com/2025/09/04/patrisse-cullors-homeless-youth-film/",
    "timestamp": "2025-09-04T18:32:25Z"
  },
  {
    "title": "Pro-MAGA Activist Publishes Clip of Trump DOJ Official Saying Ghislaine Maxwell Was Moved to ‘Keep Her Quiet’",
    "description": "James O’Keefe published a clip on Thursday of a Trump Justice Department official claiming that Ghislaine Maxwell was moved to prison “to keep her quiet.”\nThe post Pro-MAGA Activist Publishes Clip of Trump DOJ Official Saying Ghislaine Maxwell Was Moved to ‘K…",
    "link": "https://www.mediaite.com/politics/pro-maga-activist-publishes-clip-of-trump-doj-official-saying-ghislaine-maxwell-was-moved-to-keep-her-quiet/",
    "timestamp": "2025-09-04T18:31:26Z"
  },
  {
    "title": "Senators tear into RFK Jr. over vaccine restrictions in explosive hearing",
    "description": "Robert F. Kennedy Jr. struggled Thursday to defend himself before Congress against calls for his resignation.",
    "link": "https://www.msnbc.com/msnbc/news/rfk-jr-senate-hearing-testimony-covid-vaccine-restrictions-rcna229123",
    "timestamp": "2025-09-04T18:30:41Z"
  },
  {
    "title": "What’s in a Hand?",
    "description": "The White House press corps gets credit for not falling for misinformation about Trump’s health. But is it missing the story again?",
    "link": "https://www.cjr.org/analysis/trump-health-misinformation-hand-social-media.php",
    "timestamp": "2025-09-04T18:29:18Z"
  },
  {
    "title": "‘Something That’s Worth Fighting For’: Jim Banks Stresses Need To Preserve American Dream Despite ‘Sad Reality’",
    "description": "WASHINGTON — Indiana Sen. Jim Banks said Thursday that Republicans need to fight to ensure that the American dream becomes more easily attainable for Americans.",
    "link": "https://dailycaller.com/2025/09/04/jim-banks-american-dream-worth-fighting-for/",
    "timestamp": "2025-09-04T18:29:16Z"
  },
  {
    "title": "Top Trump aide chosen for Federal Reserve Board on track to win approval as questions swirl about bank independence",
    "description": "President Donald Trump’s effort to remake the board of the Federal Reserve and push the central bank to cut interest rates gained momentum after a top White House adviser appeared to win the endorsement of Republican senators.",
    "link": "https://biztoc.com/x/1d2736ead8f95778",
    "timestamp": "2025-09-04T18:28:21Z"
  },
  {
    "title": "Navy reverses demotion of Rep. Ronny Jackson, Trump’s former White House doctor",
    "description": "In light of the details and context, it's tough to see the Navy's decision to reverse Rep. Ronny Jackson's demotion as anything but overtly political.",
    "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/navy-reverses-demotion-rep-ronny-jackson-trumps-former-white-house-doc-rcna229137",
    "timestamp": "2025-09-04T18:28:17Z"
  },
  {
    "title": "Why are there so few affordable EVs in Canada?",
    "description": "In this issue of our environmental newsletter, we look at the more affordable EV models available in Canada — and why there are fewer here compared to other countries; see how plug-in solar panels for balconies work; and find out how beavers can fight wildfir…",
    "link": "https://www.cbc.ca/news/science/what-on-earth-cheap-evs-1.7624821",
    "timestamp": "2025-09-04T18:27:41Z"
  },
  {
    "title": "‘Strapped’ former BigLaw associate is arrested for alleged confrontation with National Guard members",
    "description": "A fired Covington & Burling associate was arrested last week for allegedly thrusting his shoulder into a member of the National Guard and making threatening statements to other National Guard members patrolling Washington, D.C.",
    "link": "https://www.abajournal.com/news/article/strapped-former-biglaw-associate-is-arrested-and-accused-of-throwing-his-shoulder-into-national-guardsman-in-dc",
    "timestamp": "2025-09-04T18:27:00Z"
  },
  {
    "title": "Microsoft set to dodge EU fine with offer to unbundle teams",
    "description": "Microsoft will avoid a major EU antitrust fine after regulators accepted its offer to unbundle Teams from Office packages. The move, prompted by Slack’s 2019 complaint, follows no objections in a market test.",
    "link": "https://economictimes.indiatimes.com/tech/technology/microsoft-set-to-dodge-eu-fine-with-offer-to-unbundle-teams/articleshow/123705096.cms",
    "timestamp": "2025-09-04T18:26:18Z"
  },
  {
    "title": "U.S. stocks drop as new economic data and court ruling on Trump tariffs unsettle markets",
    "description": "U.S. stocks tumbled Tuesday as investors digested new economic data and a recent court ruling that most of President Donald Trump’s tariffs could be potentially blocked. Why it matters: The sell-off raised concerns about the potential that more than $120 bill…",
    "link": "https://techpinions.com/u-s-stocks-drop-as-new-economic-data-and-court-ruling-on-trump-tariffs-unsettle-markets/",
    "timestamp": "2025-09-04T18:26:00Z"
  },
  {
    "title": "Pentagon Halts Military Support Programs for European Countries Bordering Russia",
    "description": "MOSCOW (Sputnik) - The United States will curtail hundreds of millions of dollars in security support programs for European countries bordering Russia, the Financial Times reported on Thursday, citing sources familiar with the matter.",
    "link": "https://sputnikglobe.com/20250904/pentagon-halts-military-support-programs-for-european-countries-bordering-russia-1122728204.html",
    "timestamp": "2025-09-04T18:25:58Z"
  }
]