[
  {
    "title": "ETtech Explainer: Trump administration unveils 1:1 chip production rule, what it means?",
    "description": "Per the 1:1 rule, chipmakers or semiconductor companies will have to balance import volumes with domestic production. Failing to do this over time will attract penalties, including tariffs on imported chip components. It is hoped that this will give a leg up …",
    "link": "https://economictimes.indiatimes.com/tech/technology/ettech-explainer-trump-administration-unveils-11-chip-production-rule-what-it-means/articleshow/124179577.cms",
    "timestamp": "2025-09-27T08:42:45Z"
  },
  {
    "title": "Elon Musk named in latest Epstein files as shock new revelations uncovered",
    "description": "Several new pages of the Epstein files have been released and Elon Musk has been named in them",
    "link": "https://www.ladbible.com/news/us-news/elon-musk-named-epstein-files-765677-20250927",
    "timestamp": "2025-09-27T08:39:55Z"
  },
  {
    "title": "U.S. envoy Steve Witkoff's son attempts to raise billions from Israel-Hamas cease-fire mediator Qatar, report says",
    "description": "The New York Times reports that Steve Witkoff's relationship with the oil-rich Gulf State is more extensive than previously thought, with one document suggesting the Qataris have been investing in the Witkoffs' real estate projects as early as 2017",
    "link": "https://www.haaretz.com/israel-news/2025-09-27/ty-article/report-witkoffs-son-attempts-to-raise-billions-from-israel-hamas-mediator-qatar/00000199-8a12-daea-adff-bff3c9e70000",
    "timestamp": "2025-09-27T08:20:28Z"
  },
  {
    "title": "The US government is increasingly likely to shut down next week. Here's why.",
    "description": "Lawmakers must pass a funding bill by the end of September, or the government will shut down. Republicans and Democrats are at an impasse.",
    "link": "https://www.businessinsider.com/why-is-government-shutting-down-explainer-2025-9",
    "timestamp": "2025-09-27T08:09:01Z"
  },
  {
    "title": "Trump Will 'Forgive' But Not Forget Elon Musk's 'Negativity,' Says Howard Lutnick: 'I Don't Think The President...'",
    "description": "Commerce Secretary Howard Lutnick said President Donald Trump might \"forgive\" Elon Musk but won't forget the \"negativity\" surrounding his exit from government ties.\nLutnick shared with NewsNation’s “Batya” that the tech billionaire had been one of Trump’s clo…",
    "link": "https://biztoc.com/x/196cdc40082c4ff7",
    "timestamp": "2025-09-27T08:05:30Z"
  },
  {
    "title": "Amid threats of annexation, could Canada and Greenland grow closer?",
    "description": "Canada and Greenland already had plenty in common before facing threats of annexation from the White House — but all that attention could make for a timely reason to strengthen a key relationship. CBC's Emma Godmere traveled to Greenland’s capital of Nuuk to …",
    "link": "https://www.cbc.ca/news/politics/annexation-canada-greenland-trump-1.7645001",
    "timestamp": "2025-09-27T08:00:27Z"
  },
  {
    "title": "트럼프는 경제로 이념 연대를 만들어 선거 운동 중",
    "description": "H-1B visa restrictions and a weak rupee are putting dreams of studying abroad on hold for many Indians. In this week’s India Edition, @menakadoshi looks at how the rise of private universities offers hope for the country's best and brightest (Free to read) ht…",
    "link": "https://ryueyes11.tistory.com/511890",
    "timestamp": "2025-09-27T08:00:19Z"
  },
  {
    "title": "SNL returns next week. When the show debuted, it didn't shy away from assassination talk",
    "description": "Donald Trump, who hosted Saturday Night Live twice before becoming president, has consistently complained about his treatment on the sketch comedy show. The show returns next week, and Trump's aggressive communications regulator will likely take notice.",
    "link": "https://www.cbc.ca/news/entertainment/snl-politics-ford-trump-1.7644339",
    "timestamp": "2025-09-27T08:00:00Z"
  },
  {
    "title": "Judge questions prosecutor handling of James Comey indictment, court transcript reveals",
    "description": "Magistrate Judge Lindsey Vaala expressed confusion about two inconsistent James Comey indictment versions during court proceedings. Grand jury voted to charge former FBI Director on two counts while dropping third charge. Interim US Attorney Lindsey Halligan …",
    "link": "https://economictimes.indiatimes.com/news/international/us/judge-questions-prosecutor-handling-of-james-comey-indictment-court-transcript-reveals/articleshow/124179096.cms",
    "timestamp": "2025-09-27T07:57:40Z"
  },
  {
    "title": "Trump Calls for Microsoft to Fire Former Biden Aide Lisa Monaco",
    "description": "President Donald Trump called for Microsoft Corp. to fire Lisa Monaco, the company’s president of global affairs, the latest in a series of moves targeting former government officials he perceives as political opponents.",
    "link": "https://www.ndtvprofit.com/world/trump-calls-for-microsoft-to-fire-former-biden-aide-lisa-monaco",
    "timestamp": "2025-09-27T07:57:31Z"
  },
  {
    "title": "Trump’s dual shocks thwart bets on Indian stock market rebound",
    "description": "Donald Trump's recent actions, including H-1B visa changes and pharmaceutical tariffs, have dealt a significant blow to Indian stock markets, thwarting a nascent rebound. This has led to foreign investor sell-offs and increased US-India tensions, resetting ex…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-dual-shocks-thwart-bets-on-indian-stock-market-rebound/articleshow/124178789.cms",
    "timestamp": "2025-09-27T07:51:33Z"
  },
  {
    "title": "US ‘preparing options’ for strikes inside Venezuela – NBC",
    "description": "The attacks could happen “in a matter of weeks,” the sources told NBC Read Full Article at RT.com",
    "link": "https://www.rt.com/news/625355-us-venezuela-trump-maduro/",
    "timestamp": "2025-09-27T07:32:13Z"
  },
  {
    "title": "Lucas: Missed opportunities to heal our nation",
    "description": "“Do not ever, ever, ever compare anyone to Hitler.\"",
    "link": "https://www.bostonherald.com/2025/09/27/lucas-missed-opportunities-to-heal-our-nation/",
    "timestamp": "2025-09-27T07:29:42Z"
  },
  {
    "title": "US revokes visa of Colombia’s Petro after he called on soldiers to disobey Trump | CNN",
    "description": "The United States announced it would cancel the visa of Colombia’s President Gustavo Petro on Friday, after he publicly called on its soldiers to disobey President Donald Trump, further straining relations between Washington and Bogota.",
    "link": "https://www.cnn.com/2025/09/27/americas/us-revokes-colombia-president-visa-petro-intl-hnk",
    "timestamp": "2025-09-27T07:27:49Z"
  },
  {
    "title": "A hungrier, poorer and more anxious Iran awaits 'snapback' of UN sanctions over its nuclear program",
    "description": "People in Iran increasingly find themselves priced out of the food they need to survive and worried about the future ahead of the reimposition of United Nations sanctions over its nuclear program",
    "link": "https://abcnews.go.com/International/wireStory/hungrier-poorer-anxious-iran-awaits-snapback-sanctions-nuclear-125990434",
    "timestamp": "2025-09-27T07:26:32Z"
  },
  {
    "title": "US revokes Colombian President Gustavo Petro’s visa over pro-Palestinian protest",
    "description": "Speaking to a crowd of pro-Palestinian protesters, Petro urged the creation of a global armed force with the aim of liberating Palestinians.",
    "link": "https://indianexpress.com/article/world/us-revokes-colombia-president-gustavo-petro-visa-pro-palestine-protest-10274432/",
    "timestamp": "2025-09-27T07:24:46Z"
  },
  {
    "title": "'Next Gen NYC' Star Gia Giudice Nervous For Father's Boxing Match, But Expects KO",
    "description": "Gia Giudice might be shaking in her boots before her dad Joe's celebrity boxing match on Saturday ... but the \"Next Gen NYC\" star tells TMZ Sports that doesn't mean she isn't confident he'll kick some ass and win by knockout!! Joe -- former cast…\n Permalink",
    "link": "https://www.tmz.com/2025/09/27/gia-giudice-joe-boxing-antonio-sabato-next-gen-special-forces/",
    "timestamp": "2025-09-27T07:20:30Z"
  },
  {
    "title": "Sources: Hamas agrees to Trump-backed Gaza deal, including releasing all Israeli hostages",
    "description": "The proposal includes a gradual IDF withdrawal from the Gaza Strip, alongside the release of hundreds of Palestinian prisoners, in exchange for both the living and the deceased Israeli hostages",
    "link": "https://www.haaretz.com/israel-news/2025-09-27/ty-article/.premium/sources-hamas-agrees-to-trump-backed-gaza-deal-including-releasing-all-israeli-hostages/00000199-89ec-dbe0-af9d-9fed68270000",
    "timestamp": "2025-09-27T07:19:27Z"
  },
  {
    "title": "Elon Musk and Prince Andrew among names listed in latest Epstein documents release",
    "description": "Trump ally Steve Bannon and billionaire Peter Thiel had meetings scheduled with Epstein, calendar shows",
    "link": "https://www.irishtimes.com/world/us/2025/09/27/elon-musk-and-prince-andrew-among-names-listed-in-latest-epstein-documents-release/",
    "timestamp": "2025-09-27T07:11:45Z"
  },
  {
    "title": "Trump Says 'There'll Be Others' After Comey Indictment, Slams 'Corrupt Radical Left Democrats'",
    "description": "On Friday, President Donald Trump stated that he anticipates more individuals will be charged, following the Justice Department’s indictment of former FBI Director James Comey the day before.\nThe indictment came amid criticism that it was an act of retributio…",
    "link": "https://biztoc.com/x/2cb80ebaadc22314",
    "timestamp": "2025-09-27T07:09:43Z"
  },
  {
    "title": "Venezuela Uses Diplomacy to Avoid Military Conflict With US",
    "description": "Venezuela intends to use all diplomatic means to avoid a military conflict in the Caribbean Gulf, Venezuela's Permanent Representative to the UN Office in Geneva, Alexander Gabriel Yanez Deleuze, said.",
    "link": "https://sputnikglobe.com/20250927/venezuela-uses-diplomacy-to-avoid-military-conflict-with-us-1122873772.html",
    "timestamp": "2025-09-27T07:07:31Z"
  },
  {
    "title": "S’pore may seek cap on US pharma tariffs like Japan and EU, says DPM Gan",
    "description": "This comes after new tariff rates were announced on branded drugs imported into the US.  Read more at straitstimes.com. Read more at straitstimes.com.",
    "link": "https://www.straitstimes.com/business/economy/spore-may-seek-cap-on-us-pharma-tariffs-like-japan-and-eu-says-dpm-gan",
    "timestamp": "2025-09-27T06:54:06Z"
  },
  {
    "title": "US revokes Colombian president's visa after he urges troops to disobey Trump's orders",
    "description": "Mr Petro called for a global armed force \"bigger than that of the United States\" to be formed to liberate Palestinians and urged US soldiers to \"disobey the orders of Trump\" and \"obey the orders of humanity\".",
    "link": "https://news.sky.com/story/gustavo-petro-us-revokes-colombian-presidents-visa-after-he-urges-troops-to-disobey-donald-trumps-orders-13439033",
    "timestamp": "2025-09-27T06:44:00Z"
  },
  {
    "title": "Pharmaceutical firms in Singapore clarifying tariff exemption eligibility, many have plans to invest in US: DPM Gan",
    "description": "Singapore’s pharmaceutical exports are worth about S$4 billion (US$3.1 billion), making up 13 per cent of its domestic exports to the US.",
    "link": "https://www.channelnewsasia.com/singapore/pharmaceutical-tariffs-singapore-gan-kim-yong-exemptions-trump-5373086",
    "timestamp": "2025-09-27T06:38:00Z"
  },
  {
    "title": "Market bloodbath: 440 of BSE 500 stocks end week in red, 17 sink in double-digits amid IT, pharma rout",
    "description": "Indian markets slumped as BSE 500 fell 3.3% amid Trump’s steep H-1B visa fee hike and 100% drug tariff announcement. Over 440 stocks dropped, with IT, realty, consumer and healthcare sectors hit hardest.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-bloodbath-440-of-bse-500-stocks-end-week-in-red-17-sink-in-double-digits-amid-it-pharma-rout/articleshow/124178016.cms",
    "timestamp": "2025-09-27T06:34:45Z"
  },
  {
    "title": "Trump admin revokes Colombian president’s visa over alleged ‘reckless and incendiary actions’",
    "description": "Colombian President Gustavo Petro's visa was revoked by the Trump administration over what officials allege were \"reckless and incendiary actions\" in New York City.",
    "link": "https://www.foxnews.com/politics/trump-admin-revokes-colombian-presidents-visa-over-alleged-reckless-incendiary-actions",
    "timestamp": "2025-09-27T06:32:05Z"
  },
  {
    "title": "'Not Doing So Well': Trump Makes A Big Bogey With Ryder Cup Hopes",
    "description": "The president's aim to be a good luck charm seemingly backfired during his visit to the golf competition.",
    "link": "https://www.huffpost.com/entry/donald-trump-2025-ryder-cup-golf_n_68d75dc1e4b085d511c6d17d",
    "timestamp": "2025-09-27T06:19:04Z"
  },
  {
    "title": "Meeting between Mitsotakis & Trump at the US President’s Reception, joined by Mareva Grabowski & Melania",
    "description": "It is reminded that Mr. Mitsotakis and Mr. Trump are already acquainted from the former US President’s previous term - They had met at the White House in early 2020\nThe post Meeting between Mitsotakis & Trump at the US President’s Reception, joined by Mareva …",
    "link": "https://en.protothema.gr/2025/09/27/meeting-between-mitsotakis-trump-at-the-us-presidents-reception-joined-by-mareva-grabowski-melania/",
    "timestamp": "2025-09-27T06:13:28Z"
  },
  {
    "title": "Sarkozy jailing reignites debate over French political justice ahead of Le Pen appeal",
    "description": "PARIS (Reuters) -Former President Nicolas Sarkozy's prison sentence has deepened divisions in France over judges' handling of political wrongdoing, months before far-right chief Marine Le Pen attempts to overturn an embezzlement conviction and run for top off…",
    "link": "https://www.thestar.com.my/news/world/2025/09/27/sarkozy-jailing-reignites-debate-over-french-political-justice-ahead-of-le-pen-appeal",
    "timestamp": "2025-09-27T06:10:00Z"
  },
  {
    "title": "Anwar rebukes critics of Trump invite, stresses Gaza voice at Asean summit",
    "description": "KUALA LUMPUR: Prime Minister Datuk Seri Anwar Ibrahim has rebuked critics questioning the invitation extended to United States President Donald Trump to attend the 47th Asean Summit in Kuala Lumpur next month, stressing that Malaysia will use the diplomatic p…",
    "link": "https://www.thestar.com.my/news/nation/2025/09/27/anwar-rebukes-critics-of-trump-invite-stresses-gaza-voice-at-asean-summit",
    "timestamp": "2025-09-27T06:09:00Z"
  },
  {
    "title": "Sarkozy jailing reignites debate over French political justice ahead of Le Pen appeal",
    "description": "PARIS (Reuters) -Former President Nicolas Sarkozy's prison sentence has deepened divisions in France over judges' handling of political wrongdoing, months...",
    "link": "https://www.yahoo.com/news/articles/sarkozy-jailing-reignites-debate-over-060644763.html",
    "timestamp": "2025-09-27T06:06:44Z"
  },
  {
    "title": "Iran worries ahead of 'snapback' of UN nuclear sanctions",
    "description": "People in Iran increasingly find themselves priced out of the food they need to survive and worried about the future ahead of the reimposition of United Nations sanctions over its nuclear program. Iran’s rial currency already sits at a record low, increasing …",
    "link": "https://apnews.com/article/iran-snapback-sanctions-nuclear-us-israel-war-5b13ed1781659c1a9871427881ef239b",
    "timestamp": "2025-09-27T06:03:36Z"
  },
  {
    "title": "'Snapback': What sanctions will be reimposed on Iran?",
    "description": "A raft of UN sanctions on Iran over its nuclear program, lifted under a landmark 2015 deal, will go back into force at the end of Saturday -- barring a diplomatic breakthrough, thought to be unlikely. Western nations fear that Iran will acquire nuclear weapon…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/snapback-what-sanctions-will-be-reimposed-on-iran/articleshow/124177640.cms",
    "timestamp": "2025-09-27T06:01:55Z"
  },
  {
    "title": "Cornyn: Comey Was 'Bound and Determined to Destroy' Trump After 2017 Firing",
    "description": "During Friday's broadcast of Fox News Channel's \"The Story,\" Sen. John Cornyn (R-TX) dismissed critics of the Trump Department of Justice's pursuit of former FBI Director James Comey for allegations of making a false statement and obstruction.\nThe post Cornyn…",
    "link": "https://www.breitbart.com/clips/2025/09/26/cornyn-comey-was-bound-and-determined-to-destroy-trump-after-2017-firing/",
    "timestamp": "2025-09-27T06:01:28Z"
  },
  {
    "title": "Autism campaigner: Autism is not new and does not need to be cured",
    "description": "Campaigner, actor and mother Evie Nevin says recent rhetoric in both Ireland and the US about Autism is incorrect and damaging.",
    "link": "https://www.thejournal.ie/readme/voices-autism-is-not-new-and-does-not-need-to-be-cured-6825765-Sep2025/",
    "timestamp": "2025-09-27T06:00:47Z"
  },
  {
    "title": "99 Problems: Why Ben & Jerry's is at war with Unilever",
    "description": "The man who put 'Jerry' into 'Ben & Jerry's' has walked away from the company he co-founded in a dispute that many industry-watchers predicted 25 years ago, writes Adam Maguire.",
    "link": "https://www.rte.ie/news/business/2025/0927/1535581-ben-jerry-unilever/",
    "timestamp": "2025-09-27T06:00:01Z"
  },
  {
    "title": "Trump pressures Turkey’s Erdogan to STOP Russian oil imports",
    "description": "U.S. President Donald Trump urged his Turkish counterpart Recep Tayyip Erdogan to halt Russian oil purchases, framing them as indirect funding for the war in Ukraine. Trump offered potential sanctions relief and F-35 fighter jet sales in exchange for Ankara d…",
    "link": "https://www.naturalnews.com/2025-09-27-trump-pressures-erdogan-stop-russian-oil-imports.html",
    "timestamp": "2025-09-27T06:00:00Z"
  },
  {
    "title": "Elon Musk’s Grok AI secures federal deal amid free speech and transparency debate",
    "description": "Elon Musk’s xAI secured a landmark deal with the U.S. General Services Administration to integrate its Grok chatbot across federal agencies, positioning it as a competitor to OpenAI’s ChatGPT. The agreement allows agencies to license Grok for just $0.42 per o…",
    "link": "https://www.naturalnews.com/2025-09-27-elon-musks-grok-ai-secures-federal-deal.html",
    "timestamp": "2025-09-27T06:00:00Z"
  },
  {
    "title": "Budget 2026: What we know so far about October’s package?",
    "description": "Growth in current expenditure set to slow while Coalition turns attention to delivery of big infrastructure projects",
    "link": "https://www.irishtimes.com/your-money/2025/09/27/budget-2026-what-we-know-so-far-about-octobers-package/",
    "timestamp": "2025-09-27T06:00:00Z"
  },
  {
    "title": "Scenario of Mitsotakis–Erdogan meeting in Copenhagen fades — Message from the UN on the Turkish casus belli",
    "description": "The Turkish president is not expected to travel to the Danish capital for the European Political Community Summit — What government sources say about Greek-Turkish relations, ties with Trump, and strengthening the Armed Forces\nThe post Scenario of Mitsotakis–…",
    "link": "https://en.protothema.gr/2025/09/27/scenario-of-mitsotakis-erdogan-meeting-in-copenhagen-fades-message-from-the-un-on-the-turkish-casus-belli/",
    "timestamp": "2025-09-27T05:59:25Z"
  },
  {
    "title": "Erdoğan, Starmer discuss ties, Palestine recognition in phone call",
    "description": "President Recep Tayyip Erdoğan and UK Prime Minister Keir Starmer held a phone conversation on Friday to review bilateral relations alongside regional and global matters.",
    "link": "https://www.hurriyetdailynews.com/erdogan-starmer-discuss-ties-palestine-recognition-in-phone-call-214043",
    "timestamp": "2025-09-27T05:53:35Z"
  },
  {
    "title": "'Snapback': What Sanctions Will Be Reimposed On Iran?",
    "description": "A raft of UN sanctions on Iran over its nuclear program, lifted under a landmark 2015 deal, will go back into force at the end of Saturday -- barring a diplomatic breakthrough, thought to be unlikely.",
    "link": "https://www.ibtimes.com/snapback-what-sanctions-will-reimposed-iran-3784651",
    "timestamp": "2025-09-27T05:48:18Z"
  },
  {
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "President Trump announced new tariffs on imported goods, including 30% on upholstered furniture, 100% on pharmaceuticals, and 50% on kitchen cabinets, effective Wednesday. This has left businesses like Naturepedic scrambling, facing decisions on pricing or pr…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-and-heavy-trucks/articleshow/124177421.cms",
    "timestamp": "2025-09-27T05:44:06Z"
  },
  {
    "title": "US soybean farmers caught in Trump's trade battle with China",
    "description": "American soybean farmers are worried about where they're going to sell their crops and whether they'll lose money this year because China hasn't bought any for months. Beijing traditionally has snapped up at least a quarter of all soybeans grown in the U.S. b…",
    "link": "https://apnews.com/article/soybeans-trade-tariff-china-united-states-export-025792707c4e4e91d975f8558edae1d8",
    "timestamp": "2025-09-27T05:43:33Z"
  },
  {
    "title": "‘Snapback’: What sanctions will be reimposed on Iran?",
    "description": "A raft of UN sanctions on Iran over its nuclear program, lifted under a landmark 2015 deal, will go back into force at the end of Saturday — barring a diplomatic breakthrough, thought to be unlikely. The sanctions will be reimposed because the “E3” European g…",
    "link": "https://www.digitaljournal.com/world/snapback-what-sanctions-will-be-reimposed-on-iran/article",
    "timestamp": "2025-09-27T05:43:24Z"
  },
  {
    "title": "Business leaders hail Erdoğan-Trump meeting as boost for $100 bln trade goal",
    "description": "Turkish business representatives said Friday that strategic energy and trade agreements signed during President Recep Tayyip Erdoğan's White House visit this week could propel bilateral trade with the U.S. toward the $100 billion target.",
    "link": "https://www.hurriyetdailynews.com/business-leaders-hail-erdogan-trump-meeting-as-boost-for-100-bln-trade-goal-214042",
    "timestamp": "2025-09-27T05:41:07Z"
  },
  {
    "title": "Epstein’s secret schedules reveal meetings with Musk and Prince Andrew",
    "description": "The documents also show the disgraced financier kept ties with powerful men years after his conviction.",
    "link": "https://7news.com.au/news/epsteins-secret-schedules-reveal-meetings-with-musk-and-prince-andrew-c-20159359",
    "timestamp": "2025-09-27T05:34:42Z"
  },
  {
    "title": "Netanyahu says Palestinian state would be 'national suicide' for Israel",
    "description": "Israeli Prime Minister Benjamin Netanyahu vowed Friday in an angry UN address to block a Palestinian state, accusing European leaders of pushing his country into \"national suicide\" and rewarding Hamas. Former British prime minister Tony Blair was floated in s…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/netanyahu-says-palestinian-state-would-be-national-suicide-for-israel/articleshow/124177282.cms",
    "timestamp": "2025-09-27T05:34:36Z"
  },
  {
    "title": "Trump takes tariff scalpel to pharma",
    "description": "In a sweeping new trade policy move, US President Donald Trump has announced a 100 per cent tariff on all branded and patented pharmaceutical products imported into the United States starting October 1. India, a major exporter of generic drugs and Active Phar…",
    "link": "https://www.dailypioneer.com/2025/business/trump-takes-tariff-scalpel-to-pharma.html",
    "timestamp": "2025-09-27T05:30:24Z"
  },
  {
    "title": "Trump's vast federal cuts create distrust on Capitol Hill as shutdown risk grows",
    "description": "The Trump administration faces scrutiny for stalling federal funds. Billions for programs like Head Start and NIH were withheld. A watchdog group states these actions violate budget laws. This creates a crisis on Capitol Hill, raising separation of powers que…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trumps-vast-federal-cuts-create-distrust-on-capitol-hill-as-shutdown-risk-grows/articleshow/124177136.cms",
    "timestamp": "2025-09-27T05:21:24Z"
  },
  {
    "title": "Federal shutdown threat raises fears of Acadia closure",
    "description": "A park shutdown next week would come at the start of a month when hundreds of thousands of visitors come to Bar Harbor and Acadia.",
    "link": "http://www.bangordailynews.com/2025/09/27/hancock/hancock-business/federal-shutdown-acadia-closure-joam40zk0w/",
    "timestamp": "2025-09-27T05:14:30Z"
  },
  {
    "title": "A hungrier, poorer and more anxious Iran awaits 'snapback' of UN sanctions over its nuclear program",
    "description": "As Iran's ailing economy braced Saturday for the reimposition of United Nations sanctions over its nuclear program, it is ordinary people who increasingly...",
    "link": "https://www.yahoo.com/news/articles/hungrier-poorer-more-anxious-iran-050204756.html",
    "timestamp": "2025-09-27T05:02:04Z"
  },
  {
    "title": "US Attorney General Bondi Says Deploying DOJ Agents to ICE Facilities",
    "description": "US Attorney General Pam Bondi said that she was sending agents of the US Department of Justice (DOJ) to ensure security at facilities of the US Immigration and Customs Enforcement (ICE).",
    "link": "https://sputnikglobe.com/20250927/us-attorney-general-bondi-says-deploying-doj-agents-to-ice-facilities-1122873076.html",
    "timestamp": "2025-09-27T05:01:05Z"
  },
  {
    "title": "West Bank: Tales of the dispossessed",
    "description": "Continuous expansion by Israel of settlements in the West Bank is pushing Palestinians out of their homes and move elsewhere. The pattern consists of settler attacks on Palestinian farms and villages, often aided and abetted, say locals, by the Israeli milita…",
    "link": "https://www.rte.ie/news/analysis-and-comment/2025/0927/1535557-west-bank-palestine/",
    "timestamp": "2025-09-27T05:00:59Z"
  },
  {
    "title": "This week we revealed the shortlist for Scotland's building of the year",
    "description": "This week on Dezeen, RIAS announced four buildings in contention for this year's Andrew Doolan Best Building in Scotland award, including a bridge clad with local granite. Also on the shortlist were the restoration of a remote 16th-century tower, a teaching h…",
    "link": "https://www.dezeen.com/2025/09/27/rias-scotland-best-building-this-week/",
    "timestamp": "2025-09-27T05:00:37Z"
  },
  {
    "title": "Trump promised retribution - how far will he go?",
    "description": "As the US president pushes a crackdown on left-wing groups and openly targets political foes, critics ask where he's taking America.",
    "link": "https://www.bbc.com/news/articles/c0q74pxx871o",
    "timestamp": "2025-09-27T05:00:08Z"
  },
  {
    "title": "Trump promised retribution - how far will he go?",
    "description": "As the US president pushes a crackdown on left-wing groups and openly targets political foes, critics ask where he's taking America",
    "link": "https://www.bbc.co.uk/news/articles/c0q74pxx871o",
    "timestamp": "2025-09-27T05:00:08Z"
  },
  {
    "title": "Malachy Clerkin: It’s getting very hard to separate American sport from American ugliness",
    "description": "Enjoyment of NFL at Croke Park and the Ryder Cup is disturbed by Trump-dominated backdrop",
    "link": "https://www.irishtimes.com/sport/golf/2025/09/27/malachy-clerkin-its-getting-very-hard-to-separate-american-sport-from-american-ugliness/",
    "timestamp": "2025-09-27T05:00:01Z"
  },
  {
    "title": "A tall order: Can Starbucks, once the king of the high street, return to its glory days?",
    "description": "As the multi-billion-dollar coffee chain announces the closure of some UK stores and the loss of 900 jobs in the US, Ellie Muir looks at the company’s fall from grace, from changing consumer tastes to political boycotts",
    "link": "https://www.the-independent.com/life-style/starbucks-stores-closing-menu-boycott-b2834490.html",
    "timestamp": "2025-09-27T05:00:00Z"
  },
  {
    "title": "Coming to Croke Park: Aaron Rodgers, US sporting great and castigated ‘critical thinker’",
    "description": "The Pittsburgh Steelers player is among the best quarterbacks of all time but has attracted attention in recent years for leftfield pronouncements on a variety of subjects",
    "link": "https://www.irishtimes.com/sport/2025/09/27/coming-to-croke-park-aaron-rodgers-us-sporting-great-and-castigated-critical-thinker/",
    "timestamp": "2025-09-27T05:00:00Z"
  },
  {
    "title": "Pressure on Venezuela Unacceptable - Lavrov",
    "description": "Russian Foreign Minister Sergey Lavrov, during a meeting at the UN with his Venezuelan counterpart Yvan Gil, said pressure on sovereign states is unacceptable, the Russian Foreign Ministry said.",
    "link": "https://sputnikglobe.com/20250927/pressure-on-venezuela-unacceptable---lavrov-1122872470.html",
    "timestamp": "2025-09-27T04:49:36Z"
  },
  {
    "title": "Pakistan Defence Minister Khawaja Asif admits ‘Hybrid Model’ of governance, says army and government rule by consensus",
    "description": "Pakistan's Defence Minister Khawaja Asif defended the nation's 'hybrid model' of governance, asserting civilian and military leaders share power equally. Despite accusations of military dominance, Asif denied the army's ultimate control, deflecting by labelin…",
    "link": "https://economictimes.indiatimes.com/news/international/world-news/pakistan-defence-minister-khawaja-asif-admits-hybrid-model-of-governance-says-army-and-government-rule-by-consensus/articleshow/124176714.cms",
    "timestamp": "2025-09-27T04:46:45Z"
  },
  {
    "title": "Trump’s dual shocks thwart bets on Indian stock market rebound",
    "description": "Prior to Trump’s pharma tariff and H-1B visa fee shocks, the MSCI India gauge had risen for three straight weeks, adding more than 4% in what was its longest run since May",
    "link": "https://www.bloomberg.com/news/articles/2025-09-27/trump-s-dual-shocks-thwart-bets-on-indian-stock-market-rebound",
    "timestamp": "2025-09-27T04:45:44Z"
  },
  {
    "title": "Donald Trump's UNGA address reveals a new global reality: A tougher world for countries like India.",
    "description": "And he keeps reminding the world that from every podium—this time it was United Nations General Assembly.",
    "link": "https://www.livemint.com/opinion/online-views/donald-trump-unga-speech-global-impact-world-order-international-relations-trump-presidency-foreign-policy-shifts-india-11758891863430.html",
    "timestamp": "2025-09-27T04:44:54Z"
  },
  {
    "title": "Pak Military Pleaded For Cessation Of Fighting During Operation Sindoor: India",
    "description": "India has said Pakistan's military 'pleaded' with it for a cessation of fighting during Operation Sindoor and that there is no room for any third party to intervene in any issue between New Delhi and Islamabad.",
    "link": "https://www.ndtvprofit.com/nation/pak-military-pleaded-for-cessation-of-fighting-during-operation-sindoor-india",
    "timestamp": "2025-09-27T04:40:58Z"
  },
  {
    "title": "FBI fires agents pictured kneeling during racial justice protest in 2020",
    "description": "Sources said the agents in question were trying to ease tensions between protesters and law enforcement.",
    "link": "https://www.japantimes.co.jp/news/2025/09/27/world/politics/fbi-firings-racial-justice-protests/",
    "timestamp": "2025-09-27T04:40:00Z"
  },
  {
    "title": "Palestine recognition: PM Christopher Luxon denies concern over US backlash at heart of statehood decision",
    "description": "Donald Trump says he sees recognition of a Palestine state as a \"reward\" for Hamas.",
    "link": "https://www.nzherald.co.nz/nz/politics/palestine-recognition-pm-christopher-luxon-denies-concern-over-us-backlash-at-heart-of-statehood-decision/7RCNWLWJ5ZDGJBNV5ACA4F52VA/",
    "timestamp": "2025-09-27T04:40:00Z"
  },
  {
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "President Donald Trump is planning big tariffs on pharmaceuticals, kitchen counters, bathroom vanities, upholstered furniture and heavy trucks",
    "link": "https://biztoc.com/x/dcc3bd7f837b49c2",
    "timestamp": "2025-09-27T04:33:48Z"
  },
  {
    "title": "‘I Am so Grateful That Somebody Is Listening’—Parents React to Autism Announcement",
    "description": "‘I Am so Grateful That Somebody Is Listening’—Parents React to Autism Announcementtheepochtimes.com",
    "link": "https://www.theepochtimes.com/health/i-am-so-grateful-that-somebody-is-listening-parents-react-to-autism-announcement-5920565",
    "timestamp": "2025-09-27T04:33:31Z"
  },
  {
    "title": "Turkiye, group of athletes call on FIFA, UEFA to ban Israel’s football team",
    "description": "Pressure is growing on football’s governing bodies to take action against Israel’s national team over the war on Gaza.",
    "link": "https://www.aljazeera.com/news/2025/9/27/turkiye-group-of-athletes-call-on-fifa-uefa-to-ban-israels-football-team",
    "timestamp": "2025-09-27T04:32:38Z"
  },
  {
    "title": "Turkiye, group of athletes call on FIFA, UEFA to ban Israel’s football team",
    "description": "Pressure is growing on football's governing bodies to take action against Israel's national team over the war on Gaza.",
    "link": "https://www.aljazeera.com/sports/2025/9/27/turkiye-group-of-athletes-call-on-fifa-uefa-to-ban-israels-football-team",
    "timestamp": "2025-09-27T04:32:38Z"
  },
  {
    "title": "DANIEL MCCARTHY: The Left’s Triple Threat To Free Speech",
    "description": "Jimmy Kimmel's return to the nation's airwaves is proof of just how unseriously left-wing violence is taken by the liberal media.",
    "link": "https://dailycaller.com/2025/09/27/opinion-the-lefts-triple-threat-to-free-speech-daniel-mccarthy/",
    "timestamp": "2025-09-27T04:30:11Z"
  },
  {
    "title": "Patrick Marley: With Comey prosecution, Trump fulfils?his promise of revenge",
    "description": "On the campaign trail, Donald Trump equivocated when television host ‘Dr Phil’ McGraw asked him to swear off retribution against his political foes.",
    "link": "https://www.independent.ie/opinion/analysis/patrick-marley-with-comey-prosecution-trump-fulfilshis-promise-of-revenge/a47603684.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Putin has ‘good proposal’ to end the war in Ukraine, says Lukashenko",
    "description": "Belarusian president Alexander Lukashenko said yesterday, after meeting Vladimir Putin, that the Russian leader would announce a “very good proposal” for ending the war in Ukraine that he said was broadly backed by the US.",
    "link": "https://www.independent.ie/world-news/europe/putin-has-good-proposal-to-end-the-war-in-ukraine-says-lukashenko/a1454982704.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "The Irish Independent’s View: Benjamin Netanyahu appears determined to be on the wrong side of history",
    "description": "The most dangerous of all delusions is the belief that one’s own view of reality is the only reality, said psychologist Paul Watzlawick. Even as the aisles at the UN General Assembly were emptying in protest at the massacre in Gaza, Israeli prime minister Ben…",
    "link": "https://www.independent.ie/opinion/editorial/the-irish-independents-view-benjamin-netanyahu-appears-determined-to-be-on-the-wrong-side-of-history/a678842052.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Donald Trump says ‘there will be others’ after ex-FBI chief James Comey is indicted",
    "description": "US president Donald Trump said yesterday he expects more indictments to be issued against perceived enemies after former FBI chief James Comey was charged.",
    "link": "https://www.independent.ie/world-news/north-america/donald-trump-says-there-will-be-others-after-ex-fbi-chief-james-comey-is-indicted/a1898696412.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Letters: Democracy in Ireland is now at all-time low after blocking of Maria Steen’s presidential election run",
    "description": "It seems we can now accept that dem­ocracy has reached an all-time low with the playing out of the presidential nominations.",
    "link": "https://www.independent.ie/opinion/letters/letters-democracy-in-ireland-is-now-at-all-time-low-after-blocking-of-maria-steens-presidential-election-run/a112974899.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Recognising Palestinian state sends the message that ‘murdering Jews pays off’, Benjamin Netanyahu tells UN",
    "description": "Israeli prime minister Benjamin Netanyahu sharply denounced Western countries yesterday for embracing Palestinian statehood, accusing them of sending the message that “murdering Jews pays off”.",
    "link": "https://www.independent.ie/world-news/north-america/recognising-palestinian-state-sends-the-message-that-murdering-jews-pays-off-benjamin-netanyahu-tells-un/a1223363307.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "Donald Trump’s decision on West Bank boosts hopes for deal to end war",
    "description": "US president Donald Trump has said that he told Israeli prime minister Benjamin Netanyahu he will not allow Israel to annex the West Bank, imposing the clearest limit yet on his support as Israel nears two years of war in the Gaza Strip.",
    "link": "https://www.independent.ie/opinion/comment/donald-trumps-decision-on-west-bank-boosts-hopes-for-deal-to-end-war/a1665466431.html",
    "timestamp": "2025-09-27T04:30:00Z"
  },
  {
    "title": "European shares recover from three-week lows, but weekly momentum fizzles",
    "description": "European stocks rebounded Friday, with the STOXX 600 gaining 0.8%, largely driven by financials and industrials. Steel producers surged on reports of potential EU tariffs against Chinese imports. Healthcare stocks ended flat despite new US drug tariffs, as th…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-recover-from-three-week-lows-but-weekly-momentum-fizzles/articleshow/124176499.cms",
    "timestamp": "2025-09-27T04:27:40Z"
  },
  {
    "title": "Trump finds new trade targets — pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "WASHINGTON (AP) — Naturepedic, a mattress and furniture company based outside Cleveland, has been planning to introduce an upscale upholstered headboard late this year or early in 2026. But President Donald Trump has thrown those plans into disarray. On Thurs…",
    "link": "https://financialpost.com/pmn/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-and-heavy-trucks",
    "timestamp": "2025-09-27T04:18:21Z"
  },
  {
    "title": "Online Censorship Bill Just One Signature Away From Becoming Law In California",
    "description": "A controversial bill awaiting California Democratic Gov. Gavin Newsom’s signature would slap steep new penalties on social media platforms that fail to censor content deemed in violation of the state’s civil rights laws. SB 771, which passed both chambers of …",
    "link": "https://freerepublic.com/focus/f-news/4342924/posts",
    "timestamp": "2025-09-27T04:16:31Z"
  },
  {
    "title": "Elon Musk, Prince Andrew And Peter Thiel Named In Latest Epstein Files; Tesla CEO Says 'False'",
    "description": "The world's richest man, Elon Musk, has been mentioned in the newly released documents related to late convicted sex offender, Jeffrey Epstein, alongside Britain’s Prince Andrew and Peter Thiel, BBC reported. Records from the Jeffrey Epstein Estate, submitted…",
    "link": "https://www.ndtvprofit.com/world/elon-musk-prince-andrew-and-peter-thiel-named-in-latest-epstein-files-tesla-ceo-says-false",
    "timestamp": "2025-09-27T04:15:22Z"
  },
  {
    "title": "ByteDance could still keep 50% profit after selling majority share in TikTok US deal | 5 points",
    "description": "TikTok's parent company, ByteDance, is expected to retain about 50 per cent of the US operation's profits after selling majority ownership. Here's all you need to know about the licensing fee, revenue and profit sharing, and other key points.&nbsp;",
    "link": "https://www.livemint.com/companies/news/bytedance-still-get-around-50-percent-profit-selling-majority-share-donald-trump-tiktok-us-deal-license-revenue-5-points-11758937846876.html",
    "timestamp": "2025-09-27T04:15:15Z"
  },
  {
    "title": "A quick look back at this week’s biggest stories",
    "description": "Former FBI director James Comey has been charged with lying to Congress, Jimmy Kimmel is back on air after his suspension over his Charlie Kirk remarks, and world leaders speak at the U.N. These are the week's top stories",
    "link": "https://abcnews.go.com/Politics/wireStory/quick-back-weeks-biggest-stories-125989662",
    "timestamp": "2025-09-27T04:14:52Z"
  },
  {
    "title": "Trump's trade battle with China puts US soybean farmers in peril",
    "description": "American soybean farmers are worried about where they're going to sell their crops and whether they'll lose money this year because China hasn't bought any for months",
    "link": "https://abcnews.go.com/US/wireStory/trumps-trade-battle-china-puts-us-soybean-farmers-125989241",
    "timestamp": "2025-09-27T04:14:29Z"
  },
  {
    "title": "Trump's vast federal cuts create distrust on Capitol Hill as shutdown risk grows",
    "description": "As Congress confronts a possible government shutdown, it's also weighing the Trump administration's willingness to simply halt federal spending — even when it's against the law",
    "link": "https://abcnews.go.com/Politics/wireStory/trumps-vast-federal-cuts-create-distrust-capitol-hill-125989244",
    "timestamp": "2025-09-27T04:14:20Z"
  },
  {
    "title": "Trump finds new trade targets -- pharmaceuticals, kitchen cabinets and heavy trucks",
    "description": "President Donald Trump is planning big tariffs on pharmaceuticals, kitchen counters, bathroom vanities, upholstered furniture and heavy trucks",
    "link": "https://abcnews.go.com/Business/wireStory/trump-finds-new-trade-targets-pharmaceuticals-kitchen-cabinets-125989246",
    "timestamp": "2025-09-27T04:14:20Z"
  },
  {
    "title": "Trump to declassify files over aviation pioneer Amelia Earhart",
    "description": "The story of Earhart, who vanished in 1937 while flying over the Pacific Ocean, \"has captivated millions\", the US president says.",
    "link": "https://www.bbc.com/news/articles/cgkn84e1nvxo",
    "timestamp": "2025-09-27T04:07:13Z"
  },
  {
    "title": "South Korea's top diplomat says his nation has asked Trump to be a 'peacemaker' with North Korea",
    "description": "South Korea’s top diplomat says his boss has asked President Donald Trump to become “a peacemaker” and use his leadership to get North Korea to talks to reduce military tensions on the Korean Peninsula",
    "link": "https://abcnews.go.com/US/wireStory/south-koreas-top-diplomat-nation-asked-trump-peacemaker-125987702",
    "timestamp": "2025-09-27T04:06:19Z"
  }
]