[
  {
    "title": "George Conway: We Should Condemn Political Violence 'Even If' Trump Is The Target",
    "description": "Gee, thanks. Tough call, George, but you made it. On Sunday's edition of MSNBC's The Weekend, co-founder of the disgraced Lincoln Project co-founder (still wrongly labeled a \"Conservative Attorney\") George Conway said that we should condemn political violence…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326021/posts",
    "timestamp": "2025-06-29T23:28:19Z"
  },
  {
    "title": "NYC mayoral frontrunner Mamdani: 'I don't think we should have billionaires'",
    "description": "The 33-year-old also defends his democratic socialism, rejecting an accusation from Donald Trump that he is a communist.",
    "link": "https://www.bbc.com/news/articles/cvge57k5p4yo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "timestamp": "2025-06-29T23:27:06Z"
  },
  {
    "title": "NYC mayoral frontrunner Mamdani: 'I don't think we should have billionaires'",
    "description": "The 33-year-old also defends his democratic socialism, rejecting an accusation from Donald Trump that he is a communist.",
    "link": "https://www.bbc.com/news/articles/cvge57k5p4yo",
    "timestamp": "2025-06-29T23:27:02Z"
  },
  {
    "title": "'Not A Doer!' Donald Trump Explodes At Thom Tillis For Opposing His Megabill",
    "description": "President Donald Trump lashed out at Sen. Thom Tillis (R-NC) over the so-called One Big Beautiful Bill that could strip health care from millions of Medicaid recipients.\n\n\n\"Thom Tillis has hurt the great people of North Carolina,\" Trump wrote Sunday on Truth …",
    "link": "https://crooksandliars.com/2025/06/not-doer-donald-trump-explodes-thom-tillis",
    "timestamp": "2025-06-29T23:21:05Z"
  },
  {
    "title": "Fox Host Threatens Dutch Royal With Bunker Buster From 'Daddy Trump'",
    "description": "I guess this is what's supposed to pass for humor over at Fox not \"news.\" \nPart-time host and frequent contributor Raymond Arroyo took issue with Queen Maxima of the Netherlands possibly mocking Trump during his trip to The Hague on Wednesday during an appear…",
    "link": "https://crooksandliars.com/2025/06/fox-threatens-dutch-royal-bunker-buster",
    "timestamp": "2025-06-29T23:21:04Z"
  },
  {
    "title": "‘Don’t Go Too Crazy!’ Trump Warns ‘Cost-Cutting’ Republicans ‘You Still Have To Get Reelected’ as He Cheers Tillis Drop-Out",
    "description": "After Sen. Thom Tillis announced he's exiting the Senate after this term, Trump not too subtly warned other Republicans to remember their reelections.\nThe post ‘Don’t Go Too Crazy!’ Trump Warns ‘Cost-Cutting’ Republicans ‘You Still Have To Get Reelected’ as H…",
    "link": "https://www.mediaite.com/politics/trump/dont-go-too-crazy-trump-warns-cost-cutting-republicans-you-still-have-to-get-reelected-as-he-cheers-tillis-drop-out/",
    "timestamp": "2025-06-29T23:21:03Z"
  },
  {
    "title": "'Murder fatwa against Trump' after president's 'unhinged' comment: ex-operative",
    "description": "There is reportedly a fatwa, or religious edict, against Donald Trump.Trump recently ratchetted up the language against Iranian officials on his social media, leading to a \"murder fatwa\" against him, according to an ex-insider. In 1989, Iran's Supreme Leader …",
    "link": "https://www.rawstory.com/trump-fatwa-lev-parnas/",
    "timestamp": "2025-06-29T23:11:20Z"
  },
  {
    "title": "Beaten Up Philippine Peso Set for Reprieve as Crude Retreats",
    "description": "The worst may be over for the Philippine peso as falling oil prices boost the outlook for an economy that’s heavily reliant on oil imports.",
    "link": "https://financialpost.com/pmn/business-pmn/beaten-up-philippine-peso-set-for-reprieve-as-crude-retreats",
    "timestamp": "2025-06-29T23:09:12Z"
  },
  {
    "title": "A deep dive into the Rockland County, NY, election results lawsuit",
    "description": "A lawsuit challenging the results of the 2024 general election in Rockland County, New York, fueled speculation about election integrity.",
    "link": "https://www.snopes.com//news/2025/06/29/ny-rockland-county-election-lawsuit/",
    "timestamp": "2025-06-29T23:00:00Z"
  },
  {
    "title": "Senate GOP restores Medicaid cuts to Trump tax package",
    "description": "Senate Republicans restored major Medicaid cuts to Donald Trump’s signature economic legislation, re-fashioning a key provision to overcome a procedural obstacle.\nSpending cuts to the health insurance program for the poor and disabled partially offset revenue…",
    "link": "https://biztoc.com/x/4745466b729fac59",
    "timestamp": "2025-06-29T22:59:11Z"
  },
  {
    "title": "Senate GOP Slashes Spending In ‘Big, Beautiful’ Bill As Fiscal Hawks Push For More Cuts",
    "description": "Senate Republicans are nearing a vote to slash more than $160 billion in government spending annually within President Donald Trump's \"big, beautiful\" bill.",
    "link": "https://dailycaller.com/2025/06/29/senate-gop-spending-cuts-big-beautiful-bill/",
    "timestamp": "2025-06-29T22:59:00Z"
  },
  {
    "title": "Republicans face a ferocious ad campaign surrounding Trump’s ‘big, beautiful bill’ | CNN Politics",
    "description": "A ferocious advertising campaign is underway with passage of President Donald Trump’s landmark policy bill hanging in the balance, as political groups and business interests spent at least $35 million just this month to try to sway key members of Congress and…",
    "link": "https://www.cnn.com/2025/06/29/politics/republicans-ad-campaign-trump-bill",
    "timestamp": "2025-06-29T22:55:10Z"
  },
  {
    "title": "Senate Moves One Big Beautiful Bill to the Floor",
    "description": "The Senate is in the midst of up to 20 hours of floor debate on the One Big Beautiful Bill Act after Senate Democrats had... Read More\nThe post Senate Moves One Big Beautiful Bill to the Floor appeared first on The Daily Signal.",
    "link": "https://www.dailysignal.com/2025/06/29/senate-moves-one-big-beautiful-bill-to-the-floor/",
    "timestamp": "2025-06-29T22:53:01Z"
  },
  {
    "title": "Elon Musk calls Trump's spending bill 'utterly insane' as Senate gears up for a vote",
    "description": "Elon Musk criticized Trump's revised spending bill, especially its impact on clean energy production, in multiple X posts over the weekend.",
    "link": "https://www.businessinsider.com/musk-opinion-trump-big-beautiful-bill-utterly-insane-senate-vote-2025-6",
    "timestamp": "2025-06-29T22:52:31Z"
  },
  {
    "title": "Senate GOP restores Medicaid cuts to Trump tax package",
    "description": "The Congressional Budget Office has estimated that the legislation could lead to millions of people losing health coverage.",
    "link": "https://fortune.com/2025/06/29/senate-gop-medicaid-cuts-trump-tax-package/",
    "timestamp": "2025-06-29T22:52:26Z"
  },
  {
    "title": "Bitcoin Jumps After Trump Says Growth Will Offset Deficits, Boosting Bull Case for BTC and Gold",
    "description": "Bitcoin rose 0.54% to $107,937 after analyst Will Clemente said Trump’s deficit comments reinforce the bull case for BTC and gold.",
    "link": "https://www.coindesk.com/markets/2025/06/29/bitcoin-jumps-after-trump-says-growth-will-offset-deficits-boosting-bull-case-for-btc-and-gold",
    "timestamp": "2025-06-29T22:51:40Z"
  },
  {
    "title": "Trump expected to visit the 'Alligator Alcatraz' detention facility this week (Matt Dixon/NBC News)",
    "description": "Matt Dixon / NBC News:\nTrump expected to visit the ‘Alligator Alcatraz’ detention facility this week  —  The immigration detention facility in the Florida Everglades has drawn protests and is facing a lawsuit.  —  TALLAHASSEE, Fla. — President Donald Trump is…",
    "link": "https://www.memeorandum.com/250629/p75",
    "timestamp": "2025-06-29T22:50:00Z"
  },
  {
    "title": "US Proud Boys no longer terrorists in NZ as designation lapses",
    "description": "Members were pardoned by Donald Trump for their part in the Capitol riot in 2021.",
    "link": "https://www.nzherald.co.nz/nz/politics/us-proud-boys-no-longer-terrorists-in-nz-as-designation-lapses/UFTKTFOKOVBNTDGIRMRMPNF65I/",
    "timestamp": "2025-06-29T22:49:33Z"
  },
  {
    "title": "Sen. Thom Tillis says he won't seek re-election after opposing Trump megabill",
    "description": "Republican Sen. Thom Tillis, N.C., will not run for re-election when his term is up, he announced Sunday, hours after he voted against advancing President Donald Trump's tax bill and drew the president's ire.\n\"As many of my colleagues have noticed over the la…",
    "link": "https://biztoc.com/x/9d9e502b1485fa93",
    "timestamp": "2025-06-29T22:48:27Z"
  },
  {
    "title": "WATCH: Dems’ NYC socialist nominee ducks and weaves when asked to condemn term calling for killing Jews",
    "description": "'That's not language that I use. The language that I use and the language that I will continue to use to lead the city is that which speaks clearly to my intent, which is an intent grounded in a belief in universal human rights'",
    "link": "https://www.wnd.com/2025/06/watch-dems-nyc-socialist-nominee-ducks-weaves-when/",
    "timestamp": "2025-06-29T22:48:02Z"
  },
  {
    "title": "Betting Market in Disarray Over Zelensky Suit That's Also Maybe Not a Suit",
    "description": "There's a \"political message\" in Ukrainian President Volodymyr Zelensky's wardrobe, said Oleksandr Merezhko, a member of Zelensky's Servant of the People party.",
    "link": "https://www.newsweek.com/volodymyr-zelensky-suit-jacket-donald-trump-betting-odds-2092182",
    "timestamp": "2025-06-29T22:44:23Z"
  },
  {
    "title": "Stocks eye fresh highs as tax cuts advance in Senate while Trump balks at extending tariff deadline",
    "description": "Stock futures pointed slightly higher on Sunday after the Senate advanced President Donald Trump’s tax cut and spending bill over the weekend. Trump also said he would rather impose tariff rates on countries than extend a temporary pause on so-called reciproc…",
    "link": "https://biztoc.com/x/f73019ca98537d03",
    "timestamp": "2025-06-29T22:37:26Z"
  },
  {
    "title": "Trump says he has 'a group of very wealthy people' to buy TikTok",
    "description": "Trump says he has 'a group of very wealthy people' to buy TikTok\nPresident Donald Trump has said he has a buyer for TikTok, the video-sharing app that was banned in the US amid claims it posed a national security risk.\nIn a Fox News interview, Trump said he h…",
    "link": "https://biztoc.com/x/d15864347d40f7bd",
    "timestamp": "2025-06-29T22:37:16Z"
  },
  {
    "title": "Details emerge amid former Neighbours star Holly Valance’s split from billionaire husband",
    "description": "The former Neighbours actress and property developer are prominent figures in the right-wing Reform UK party.",
    "link": "https://7news.com.au/entertainment/details-emerge-amid-former-neighbours-star-holly-valances-split-from-billionaire-husband-c-19192412",
    "timestamp": "2025-06-29T22:33:58Z"
  },
  {
    "title": "Stocks eye fresh highs as tax cuts advance in Senate while Trump balks at extending tariff deadline",
    "description": "Wall Street will begin a holiday-shortened trading week after the S&P 500 and Nasdaq notched new record highs on Friday.",
    "link": "https://fortune.com/2025/06/29/stock-market-today-dow-futures-sp500-nasdaq-highs-trump-trade-war-tariff-deadline-tax-cuts-senate/",
    "timestamp": "2025-06-29T22:32:00Z"
  },
  {
    "title": "Trump reacts to Tillis not seeking re-election, sends warning to 'cost cutting Republicans'",
    "description": "North Carolina Senator Thom Tillis will not seek re-election in 2026, drawing celebration from Trump who threatened primary challengers after Tillis opposed his \"big, beautiful bill.\"",
    "link": "https://www.foxnews.com/politics/trump-reacts-tillis-not-seeking-re-election-sends-warning-cost-cutting-republicans",
    "timestamp": "2025-06-29T22:28:41Z"
  },
  {
    "title": "What's in the latest version of Trump's big bill now before the Senate",
    "description": "At some 940-pages, the legislation is a sprawling collection of tax breaks, spending cuts and other Republican priorities, including new money for national defense and deportations",
    "link": "https://www.wsbtv.com/news/whats-latest-version/EP7PAX3OH5FINKZEATJ635S4BE/",
    "timestamp": "2025-06-29T22:28:27Z"
  },
  {
    "title": "Nearly 12 million Americans to lose health coverage under Trump’s budget bill, CBO warns",
    "description": "A Republican-backed budget bill, supported by President Trump, is projected to strip health insurance from nearly 12 million Americans by 2034, according to the CBO. The bill, which passed the Senate narrowly, enacts significant cuts to Medicaid and scales ba…",
    "link": "https://economictimes.indiatimes.com/news/international/us/nearly-12-million-americans-to-lose-health-coverage-under-trumps-budget-bill-cbo-warns/articleshow/122147888.cms",
    "timestamp": "2025-06-29T22:28:07Z"
  },
  {
    "title": "Report: Immigration arrests have tripled across Ohio this year since Trump inauguration",
    "description": "A report from The New York Times analyzing immigration data from across the country says that immigration-related arrests have tripled across Ohio since President Donald Trump took office.",
    "link": "https://www.wlwt.com/article/immigration-arrests-have-tripled-across-ohio-this-year/65244447",
    "timestamp": "2025-06-29T22:23:29Z"
  },
  {
    "title": "Stock futures rise after S&P 500 notches a fresh record high: Live updates",
    "description": "The market's swift recovery this month comes as investors continue to monitor the whipsaw of global trade negotiations.",
    "link": "https://www.cnbc.com/2025/06/29/stock-market-today-live-updateshtml.html",
    "timestamp": "2025-06-29T22:21:46Z"
  },
  {
    "title": "Trump Claims Buyers Found for TikTok, Awaits China's Approval",
    "description": "SummaryPresident Donald Trump has claimed that a \"very wealthy group of people\" has agreed to buy TikTok's U.S. operations, with their identities to be revealed in approximately two weeksThis announcement comes amid ongoing deadlines for ByteDance to divestDe…",
    "link": "https://hypebeast.com/2025/6/trump-claims-tiktok-buyers-found-awaits-chinas-approval-news",
    "timestamp": "2025-06-29T22:19:33Z"
  },
  {
    "title": "Trump expected to visit the 'Alligator Alcatraz' detention facility this week",
    "description": "Trump is expected to be in attendance Tuesday at the opening of a controversial immigration detention center dubbed “Alligator Alcatraz.”",
    "link": "https://www.nbcnews.com/politics/immigration/trump-likely-visit-alligator-alcatraz-rcna215851",
    "timestamp": "2025-06-29T22:19:20Z"
  },
  {
    "title": "U.S. strikes on Iran's nuclear sites set up 'cat-and-mouse' hunt for missing uranium",
    "description": "Iran's more than 400 kg of uranium is enough, if further enriched for up to nine nuclear weapons.",
    "link": "https://www.japantimes.co.jp/news/2025/06/30/world/us-iran-nuclear-sites-missing-uranium/",
    "timestamp": "2025-06-29T22:19:00Z"
  },
  {
    "title": "US must rule out more strikes before new talks, Iranian minister tells BBC",
    "description": "Majid Takht-Ravanchi said the Trump administration has \"not made their position clear\" on further attacks.",
    "link": "https://www.bbc.com/news/articles/c20r18x8x05o",
    "timestamp": "2025-06-29T22:15:33Z"
  },
  {
    "title": "Trump deals poised to fall short of sweeping global trade reform",
    "description": "Trump and his advisers have left investors on edge ahead of July 9, offering cryptic signals about which countries were close to agreements and which were off track.",
    "link": "https://www.japantimes.co.jp/business/2025/06/30/markets/trump-deals-global-trade-reform/",
    "timestamp": "2025-06-29T22:13:00Z"
  },
  {
    "title": "Lara Trump ‘Seriously Considering’ Senate Run to Replace Retiring GOP Sen",
    "description": "There might soon be another elected Trump in Washington. President Donald Trump’s daughter-in-law, Lara Trump, is “seriously considering” a Senate run in her native North Carolina, a source told NOTUS. Another source close to the Trump family told NBC News th…",
    "link": "https://freerepublic.com/focus/f-news/4326014/posts",
    "timestamp": "2025-06-29T22:11:55Z"
  },
  {
    "title": "Tillis' retirement announcement draws reactions from Trump critic Jeff Flake, Bernie Sanders: 'A cult'",
    "description": "Former Senator Jeff Flake responded to Tillis' retirement announcement on Sunday, suggesting he could win re-election only by taking positions against his beliefs.",
    "link": "https://www.foxnews.com/politics/tillis-retirement-announcement-draws-reactions-from-trump-critic-jeff-flake-bernie-sanders-a-cult",
    "timestamp": "2025-06-29T22:11:20Z"
  },
  {
    "title": "A Grand Ayatollah In Iran Just Issued A Fatwa That Designates Donald Trump As An “Enemy Of God”, And That Normally Results In Execution",
    "description": "One of the most important Shiite clerics in the entire world, Grand Ayatollah Makarem Shirazi of the Iranian holy city of Qom, has just issued a fatwa which officially declares Donald Trump to be an “enemy of God”.  In Iran, those that are designated to be “e…",
    "link": "http://theeconomiccollapseblog.com/a-grand-ayatollah-in-iran-just-issued-a-fatwa-that-designates-donald-trump-as-an-enemy-of-god-and-that-normally-results-in-execution/",
    "timestamp": "2025-06-29T22:07:42Z"
  },
  {
    "title": "Trump says his administration could pressure CNN, NYT to give up sources on Iran strike coverage",
    "description": "President Donald Trump reiterated on Fox News that the people who leaked information on the U.S. strike against Iranian nuclear facilities need to be prosecuted.",
    "link": "https://www.foxnews.com/media/trump-says-his-administration-could-pressure-cnn-nyt-give-up-sources-iran-strike-coverage",
    "timestamp": "2025-06-29T22:00:47Z"
  },
  {
    "title": "Here's the biggest news you missed this weekend",
    "description": "The Republican-led Senate late Saturday advanced a sweeping domestic policy package for President Donald Trump’s agenda after a dramatic hourslong vote, moving it one step closer to passage",
    "link": "https://www.nbcnews.com/news/us-news/weekend-rundown-june-29-rcna215664",
    "timestamp": "2025-06-29T22:00:00Z"
  },
  {
    "title": "Trump won’t let other countries score big ‘wins’ in trade talks. Both sides could lose. - Politico",
    "description": "Trump won’t let other countries score big ‘wins’ in trade talks. Both sides could lose.Politico India, U.S. trade talks face roadblocks ahead of tariff deadline, Indian sources sayReuters Indian negotiators extend US stay as trade talks gather paceThe Economi…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178227702",
    "timestamp": "2025-06-29T21:55:10Z"
  },
  {
    "title": "Ripple vs SEC: Why the XRP Legal Battle Still Isn't Officially Over",
    "description": "In brief\n- Ripple and the SEC have been mired in a long-running legal battle over XRP sales.\n- Since President Donald Trump returned to office, the pair have been working on a resolution.\n- Court rulings have prevented the planned conclusion, though the end n…",
    "link": "https://biztoc.com/x/722837d783a6d228",
    "timestamp": "2025-06-29T21:53:38Z"
  },
  {
    "title": "‘He's going to do everything to damage the president’: Former Musk friend on the Trump fallout",
    "description": "",
    "link": "https://biztoc.com/x/ed771ad9503171b3",
    "timestamp": "2025-06-29T21:53:38Z"
  },
  {
    "title": "‘Why Not Just Condemn It?’ Mamdani Refuses to Condemn ‘Intifada’ Slogan Three More Times to Kristen Welker",
    "description": "Mamdani denied Welker three times as she pressed him on why he won't simply condemn the slogan \"globalize the intifada\" after so much backlash.\nThe post ‘Why Not Just Condemn It?’ Mamdani Refuses to Condemn ‘Intifada’ Slogan Three More Times to Kristen Welker…",
    "link": "https://www.mediaite.com/politics/why-not-just-condemn-it-mamdani-refuses-to-condemn-intifada-slogan-three-more-times-to-kristen-welker/",
    "timestamp": "2025-06-29T21:50:06Z"
  },
  {
    "title": "Trump hits 'cost-cutting Republicans' with a warning: 'Don't go too crazy'",
    "description": "Donald Trump on Sunday said that \"cost-cutting Republicans,\" a moniker with which the president self-identifies, must be careful.The comment comes amid active discussions surrounding the senate's version of what Trump has called the \"big, beautiful\" spending …",
    "link": "https://www.rawstory.com/trump-hits-cost-cutting-republicans/",
    "timestamp": "2025-06-29T21:49:37Z"
  },
  {
    "title": "Trump says he doesn't expect to extend July 9 tariff deadline",
    "description": "US News: Washington: US President Donald Trump said he is not planning to extend a 90-day pause on tariffs on most nations beyond July 9, when the negotiating .",
    "link": "https://timesofindia.indiatimes.com/world/us/trump-says-he-doesnt-expect-to-extend-july-9-tariff-deadline/articleshow/122147578.cms",
    "timestamp": "2025-06-29T21:49:07Z"
  },
  {
    "title": "US Prez says 'very wealthy' group ready to buy TikTok",
    "description": "US News: President Donald Trump said Sunday a group of buyers had been found for TikTok, which faces a looming ban in the United States due to its China ties, .",
    "link": "https://timesofindia.indiatimes.com/world/us/us-prez-says-very-wealthy-group-ready-to-buy-tiktok/articleshow/122147421.cms",
    "timestamp": "2025-06-29T21:47:08Z"
  },
  {
    "title": "Trump pleased Tillis will not seek re-election",
    "description": "United States President Donald Trump expressed his satisfaction that North Carolina Senator Thom Tillis will not seek re-election in 2026.\"Great News! 'Senator' Thom Tillis will not be seeking reelect...",
    "link": "https://biztoc.com/x/cdbfcb43e5e9e9a5",
    "timestamp": "2025-06-29T21:42:24Z"
  },
  {
    "title": "Iran could enrich uranium within months, UN nuclear watchdog boss says",
    "description": "The International Atomic Energy Agency's chief raises more doubt about the efficacy of the US bombing of key Iranian nuclear facilities, which Donald Trump maintains were \"oblierated\".",
    "link": "https://www.abc.net.au/news/2025-06-30/iran-could-enrich-uranium-within-months-iaea-says/105475434",
    "timestamp": "2025-06-29T21:37:43Z"
  },
  {
    "title": "Feds release star witness and three-time felon to keep Kilmar Abrego Garcia in jail",
    "description": "Records show Trump administration agreed to spare key witness from deportation in exchange for his cooperation",
    "link": "https://www.the-independent.com/news/world/americas/crime/kilmar-abrego-garcia-witness-jail-deported-b2779214.html",
    "timestamp": "2025-06-29T21:35:43Z"
  },
  {
    "title": "Trump says he's not planning to extend a pause on global tariffs beyond July 9",
    "description": "President Donald Trump says he's not planning to extend a 90-day pause on tariffs on most nations beyond July 9.",
    "link": "https://www.wsls.com/business/2025/06/29/trump-says-hes-not-planning-to-extend-a-pause-on-global-tariffs-beyond-july-9/",
    "timestamp": "2025-06-29T21:33:50Z"
  },
  {
    "title": "Ishiba to consider best coalition gov't framework after July election",
    "description": "Prime Minister Shigeru Ishiba said Sunday he will consider what will be &quot;the most appropriate&quot; framework for his coalition government after a crucial election next month for the House of Councillors where his ruling coalition is seeking to retain it…",
    "link": "https://japantoday.com/category/politics/Ishiba-to-consider-best-coalition-gov%27t-framework-after-July-election",
    "timestamp": "2025-06-29T21:32:21Z"
  },
  {
    "title": "Five Key Charts to Watch in Global Commodity Markets This Week",
    "description": "The situation in the Middle East remains delicate, even as oil — and gas — continue to flow. But for US refiners, reliance on supply from the region is not as great as it once was. Grid-scale battery installations in the US are projected to reverse their rapi…",
    "link": "https://financialpost.com/pmn/business-pmn/five-key-charts-to-watch-in-global-commodity-markets-this-week-92",
    "timestamp": "2025-06-29T21:32:02Z"
  },
  {
    "title": "Ukraine F-16 pilot killed in large-scale Russian attack; Zelenskyy calls for U.S. help",
    "description": "A Ukrainian F-16 fighter pilot died in a crash while repelling a Russian air attack that involved hundreds of drones, cruise and ballistic missiles, authorities said on Sunday, as Moscow intensifies night-time air barrages in the fourth year of war. President…",
    "link": "https://japantoday.com/category/world/ukraine-f-16-pilot-killed-in-large-scale-russian-attack-zelenskiy-calls-for-us-help3",
    "timestamp": "2025-06-29T21:22:39Z"
  },
  {
    "title": "Netanyahu sees Iran outcome opening door to Gaza hostage return",
    "description": "Israeli Prime Minister Benjamin Netanyahu said on Sunday the 12-day war with Iran had created opportunities for Israel, and the first was the return of hostages held in Gaza by Palestinian militants who attacked Israel on October 7, 2023. His remarks, coupled…",
    "link": "https://japantoday.com/category/world/netanyahu-sees-iran-outcome-opening-door-to-gaza-hostage-return",
    "timestamp": "2025-06-29T21:22:28Z"
  },
  {
    "title": "Trump says he's not planning to extend a pause on global tariffs beyond July 9",
    "description": "U.S. President Donald Trump says he is not planning to extend a 90-day pause on tariffs on most nations beyond July 9, when the negotiating period he set would expire, and his administration will notify countries that the trade penalties will take effect unle…",
    "link": "https://japantoday.com/category/world/trump-says-he%27s-not-planning-to-extend-a-pause-on-global-tariffs-beyond-july-9",
    "timestamp": "2025-06-29T21:22:16Z"
  },
  {
    "title": "GOP Senator Thom Tillis announces he will not seek re-election",
    "description": "Sen. Thom Tillis, R-N.C, said Sunday that he would not seek re-election, opening up a seat in a state that was already considered a battleground in the 2026 ...",
    "link": "https://www.upi.com/Top_News/US/2025/06/29/tillis-wont-see-reelection/6221751228957/",
    "timestamp": "2025-06-29T21:21:42Z"
  },
  {
    "title": "Israel poised to ramp up Gaza military operations as Trump calls for ceasefire",
    "description": "Israel’s military signaled it would intensify its campaign in Gaza as US President Donald Trump on Sunday called again for a ceasefire and hostage deal with Hamas.\nA top adviser to Israeli Prime Minister Benjamin Netanyahu is set to travel to Washington this …",
    "link": "https://biztoc.com/x/4b39e519f2b6d08d",
    "timestamp": "2025-06-29T21:20:07Z"
  },
  {
    "title": "Bolsonaro rallies supporters in Brazil amid Supreme Court coup plot trial",
    "description": "Legal woes hang over the ex-president, who has called for several demonstrations in support of himself in recent months.",
    "link": "https://www.aljazeera.com/news/2025/6/29/bolsonaro-rallies-supporters-in-brazil-amid-supreme-court-coup-plot-trial",
    "timestamp": "2025-06-29T21:14:30Z"
  },
  {
    "title": "Netanyahu sees Iran outcome opening door to Gaza hostage return",
    "description": "Prime Minister Benjamin Netanyahu said on Sunday (Jun 29) the 12-day war with Iran had created opportunities for Israel, and the first was the return of hostages held in Gaza by Palestinian militants who",
    "link": "https://www.channelnewsasia.com/asia/netanyahu-sees-iran-outcome-opening-door-gaza-hostage-return-5210476",
    "timestamp": "2025-06-29T21:14:00Z"
  },
  {
    "title": "Chick-fil-A Forced to Respond to Rumors About Massive Restaurant Change",
    "description": "Popular fast food chain Chick-fil-A is playing defense when it comes to rumors surrounding an unpopular change that could take place.",
    "link": "https://www.westernjournal.com/chick-fil-forced-respond-rumors-massive-restaurant-change/",
    "timestamp": "2025-06-29T21:10:35Z"
  },
  {
    "title": "Trump-Musk Feud Reignited After Senate Passes 'Big Beautiful Bill'",
    "description": "The feud between President Donald Trump and his once close ally, billionaire Elon Musk, has resumed after the Senate officially passed the GOP's \"one big, beautiful\" tax and spending bill.",
    "link": "https://www.ibtimes.com/trump-musk-feud-reignited-senate-passes-big-beautiful-bill-3777185",
    "timestamp": "2025-06-29T21:09:27Z"
  },
  {
    "title": "President Trump Fueling Ripple’s XRP $150 Billion Prospect",
    "description": "As of Sunday, Ripple's XRP, the fourth-largest cryptocurrency by market capitalization, is riding a wave of excitement.",
    "link": "https://zycrypto.com/president-trump-fueling-ripples-xrp-150-billion-prospect/",
    "timestamp": "2025-06-29T21:08:04Z"
  },
  {
    "title": "Another Trump to be elected? President’s well-known relative ‘seriously considering’ U.S. Senate run",
    "description": "Retirement announcement by key Republican has big names brought up for Congress",
    "link": "https://www.wnd.com/2025/06/another-trump-be-elected-presidents-well-known-relative/",
    "timestamp": "2025-06-29T21:01:50Z"
  },
  {
    "title": "New Research: AI Large Language Models Show Hiring Bias Against White Men",
    "description": "When deciding which candidates to interview, Large Language Models yield as much as a 12 percent difference in interview rates against white men. AI transparency is needed.\nThe post New Research: AI Large Language Models Show Hiring Bias Against White Men fir…",
    "link": "https://legalinsurrection.com/2025/06/new-research-ai-large-language-models-show-hiring-bias-against-white-men/",
    "timestamp": "2025-06-29T21:00:56Z"
  },
  {
    "title": "'No!': Trump lashes out at 'unelected senate staffer' causing him headaches",
    "description": "Donald Trump on Sunday lashed out against the Senate Parliamentarian, an office that has bumped heads with ruling parties at various times.Recently, MAGA lawmakers such as Marjorie Taylor Greene have blasted the Senate official striking some parts of the bill…",
    "link": "https://www.rawstory.com/trump-senate-staffer-causing-headaches/",
    "timestamp": "2025-06-29T20:57:28Z"
  },
  {
    "title": "Penny Wong to go head-to-head with US on defence spending at the Quad",
    "description": "The foreign affairs minister will meet with Marco Rubio amid relentless calls for Australia to increase its defence spending, and Angus Taylor might just be planning another tilt at the Liberal leadership.\nThe post Penny Wong to go head-to-head with US on def…",
    "link": "http://www.crikey.com.au/2025/06/30/penny-wong-marco-rubio-quad-defence-angus-taylor-leadership/",
    "timestamp": "2025-06-29T20:55:38Z"
  },
  {
    "title": "Politics\nTrump says Mamdani must ‘do the right thing’ if elected mayor of New York City — or risk losing funding",
    "description": "Key PointsPresident Donald Trump said that Democratic mayoral candidate Zohran Mamdani has to “do the right thing” if he’s elected, “or they’re not getting any money.” “Whoever’s mayor of New York is going to have to behave themselves, or the federal governme…",
    "link": "https://freerepublic.com/focus/f-news/4326005/posts",
    "timestamp": "2025-06-29T20:54:12Z"
  },
  {
    "title": "Republican Senator Thom Tillis to leave Congress after clash with Trump",
    "description": "Senator Thom Tillis of North Carolina has refused to back the \"Big Beautiful Bill\", saying it will be \"devastating\" to people in his state.",
    "link": "https://www.bbc.com/news/articles/c628vd100pro",
    "timestamp": "2025-06-29T20:51:16Z"
  },
  {
    "title": "Donald Trump Says Group Of “Very Wealthy People” Looking To Acquire TikTok",
    "description": "President Donald Trump told Fox News that a group of “very wealthy people” are in place to buy hugely popular video app TikTok, telling Sunday Morning Futures with Maria Bartiromo that he will unveil the identities of the investors in about two weeks. He also…",
    "link": "http://deadline.com/2025/06/donald-trump-says-group-of-wealthy-buyers-may-acquire-tiktok-1236445479/",
    "timestamp": "2025-06-29T20:49:28Z"
  },
  {
    "title": "VIDEO: Smerconish SHOCKED that 72% of His Viewers Admit to Having CLOSED MINDS",
    "description": "VIDEOMike Smerconish's poll question on CNN on Sunday was \"Do You Have an Open Mind on President Donald Trump?\" The result shocked Smerconish since 72% of his viewers admitted to having a CLOSED MIND when it comes to Trump. Since maybe 20% of Smerconish's vie…",
    "link": "https://freerepublic.com/focus/f-bloggers/4326004/posts",
    "timestamp": "2025-06-29T20:48:31Z"
  },
  {
    "title": "Israel orders mass evacuation from parts of northern Gaza as Trump calls for ceasefire deal",
    "description": "President Donald Trump on Sunday urged progress in ceasefire talks in the 20-month war in Gaza between Israel and Hamas, though some weary Palestinians were skeptical about the chances.",
    "link": "https://biztoc.com/x/68731db06bb6dce4",
    "timestamp": "2025-06-29T20:47:06Z"
  },
  {
    "title": "Zohran Mamdani as New York mayoral candidate for Democratic Party only helps Donald Trump in midterm elections, feel worried Democrats",
    "description": "Will Zohran Mamdani as New York mayoral candidate rejuvenate the Democrats or the candidature prove costly for the Democratic Party and boost President Donald Trump and Republican party in midterm elections?",
    "link": "https://economictimes.indiatimes.com/news/international/us/zohran-mamdani-as-new-york-mayoral-candidate-for-democratic-party-only-helps-donald-trump-in-midterm-elections-feel-worried-democrats/articleshow/122147321.cms",
    "timestamp": "2025-06-29T20:40:22Z"
  },
  {
    "title": "Israel orders mass evacuation from parts of northern Gaza as Trump calls for ceasefire deal",
    "description": "President Donald Trump on Sunday urged progress in ceasefire talks in the 20-month war in Gaza between Israel and Hamas, though some weary Palestinians were skeptical about the chances.",
    "link": "https://www.pbs.org/newshour/world/israel-orders-mass-evacuation-from-parts-of-northern-gaza-as-trump-calls-for-ceasefire-deal",
    "timestamp": "2025-06-29T20:39:35Z"
  },
  {
    "title": "Leaked Iran Call Further Shreds Trump’s Narrative: Report",
    "description": "Iranian officials in a conversation intercepted by U.S. intelligence said the strikes on nuclear facilities were less destructive than expected.",
    "link": "http://www.rollingstone.com/politics/politics-news/leaked-iran-call-nuclear-trump-1235375174/",
    "timestamp": "2025-06-29T20:37:56Z"
  },
  {
    "title": "CBO: $1 trillion cut from Medicaid in Senate's budget bill",
    "description": "A version of the budget reconciliation bill being considered by the Senate would make deeper cuts to social service programs and lead to fewer people having ...",
    "link": "https://www.upi.com/Top_News/US/2025/06/29/1trillion-cut-from-Medicaid/8801751222465/",
    "timestamp": "2025-06-29T20:34:51Z"
  },
  {
    "title": "What is a vote-a-rama? Senate vote marathon ahead of Trump legislative package",
    "description": "The Senate is set to go through a vote-a-rama on amendments to the Trump tax, spending and policy package. Here's what to know about the tradition.",
    "link": "https://www.usatoday.com/story/news/politics/2025/06/29/vote-a-rama-senate-tax-bill/84378084007/",
    "timestamp": "2025-06-29T20:31:33Z"
  },
  {
    "title": "Fox News Host Lara Trump ‘Strongly Considering’ Senate Bid in North Carolina: Report",
    "description": "Just hours after Sen. Tillis announced he won't be running for reelection, a notable Fox News host seems poised to throw her hat in the ring to replace him.\nThe post Fox News Host Lara Trump ‘Strongly Considering’ Senate Bid in North Carolina: Report first ap…",
    "link": "https://www.mediaite.com/media/news/fox-news-host-lara-trump-strongly-considering-senate-bid-in-north-carolina-report/",
    "timestamp": "2025-06-29T20:29:25Z"
  },
  {
    "title": "Thom Tillis Not Running for Reelection After Opposing Big, Beautiful Bill",
    "description": "Sen. Thom Tillis (R-NC) announced that he is not running for reelection, after opposing President Donald Trump's Big, Beautiful Bill due to Medicaid cuts.\nThe post Thom Tillis Not Running for Reelection After Opposing Big, Beautiful Bill appeared first on Bre…",
    "link": "https://www.breitbart.com/politics/2025/06/29/thom-tillis-not-running-for-reelection-after-opposing-big-beautiful-bill/",
    "timestamp": "2025-06-29T20:28:12Z"
  },
  {
    "title": "Zohran Mamdani repeatedly pressed on whether he condemns 'globalize the intifada' term in NBC interview",
    "description": "New York City mayoral candidate Zohran Mamdani was repeatedly pressed by NBC News host Kristen Welker on Sunday about why he doesn't want to condemn the phrase, \"globalize the intifada,\" insisting that he didn't want to \"police language.\" \"I want to ask you a…",
    "link": "https://freerepublic.com/focus/f-chat/4326000/posts",
    "timestamp": "2025-06-29T20:23:23Z"
  },
  {
    "title": "NYC, San Francisco and other US cities capping LGBTQ+ Pride month with a mix of party and protest",
    "description": "The monthlong celebration of LGBTQ+ Pride reached its rainbow-laden crescendo Sunday as huge crowds took part in jubilant, daylong street parties from New York to San Francisco.",
    "link": "https://www.denverpost.com/2025/06/29/lgbtq-pride-month-celebrations-protests/",
    "timestamp": "2025-06-29T20:21:04Z"
  },
  {
    "title": "Trump Deals Poised to Fall Short of Sweeping Global Trade Reform",
    "description": "With just 10 days to go until President Donald Trump’s country-specific tariffs are set to resume, the White House appears poised to fall short of the sweeping global trade reforms it promised to achieve during the three months they were on hold.",
    "link": "https://financialpost.com/pmn/business-pmn/trump-deals-poised-to-fall-short-of-sweeping-global-trade-reform",
    "timestamp": "2025-06-29T20:20:46Z"
  },
  {
    "title": "Report: Saudi King Gives Palestinian Terrorists' Families Free Trip to Mecca",
    "description": "Saudi King Salman bin Abdulaziz Al Saud has reportedly given 1,000 Palestinian relatives of terrorists a free trip to participate in the Mecca pilgrimage, raising eyebrows as the kingdom considers peace with Israel.\nThe post Report: Saudi King Gives Palestini…",
    "link": "https://www.breitbart.com/middle-east/2025/06/29/report-saudi-king-gives-palestinian-terrorists-families-free-trip-to-mecca/",
    "timestamp": "2025-06-29T20:19:52Z"
  },
  {
    "title": "Thousands gather for Pride parade in downtown Toronto",
    "description": "The streets of Toronto were filled with music, colour and rainbows as thousands people took part in the annual Pride parade Sunday.",
    "link": "https://www.cbc.ca/news/canada/toronto/pride-parade-toronto-sunday-1.7573856",
    "timestamp": "2025-06-29T20:13:28Z"
  },
  {
    "title": "Roberts: Iran Leak Aimed at Undermining Trump’s Historic Week",
    "description": "Whoever is behind the leak of the preliminary Iran damage assessment wants to undermine “one of the most successful weeks in American presidential history,” said... Read More\nThe post Roberts: Iran Leak Aimed at Undermining Trump’s Historic Week appeared firs…",
    "link": "https://www.dailysignal.com/2025/06/29/roberts-iran-leak-aimed-at-undermining-trumps-historic-week/",
    "timestamp": "2025-06-29T20:12:19Z"
  },
  {
    "title": "CFPB Funding Cuts Get OK From Senate Parliamentarian",
    "description": "The future of the Consumer Financial Protection Bureau’s (CFPB) funding is once again uncertain. [contact-form-7] That’s because Senate Republicans have gotten permission from the chamber’s parliamentarian to include a measure in President Donald Trump’s tax …",
    "link": "http://www.pymnts.com/news/cfpb/2025/cfpb-funding-cuts-get-ok-from-senate-parliamentarian/",
    "timestamp": "2025-06-29T20:11:30Z"
  },
  {
    "title": "Trump says the administration is working on a 'temporary pass' for immigrants in certain industries (Megan Lebowitz/NBC News)",
    "description": "Megan Lebowitz / NBC News:\nTrump says the administration is working on a ‘temporary pass’ for immigrants in certain industries  —  The president's comments mark the latest shift in his administration's approach to immigrant workers in certain industries.  —  …",
    "link": "https://www.memeorandum.com/250629/p60",
    "timestamp": "2025-06-29T20:05:01Z"
  },
  {
    "title": "Trump says he has “very wealthy people” ready to buy TikTok",
    "description": "The TikTok saga may finally be coming to a close.",
    "link": "https://www.phonearena.com/news/trump-says-very-wealthy-people-ready-to-buy-tiktok_id171810",
    "timestamp": "2025-06-29T20:01:15Z"
  },
  {
    "title": "Democratic socialist candidate for NYC mayor a 'gift to Republican Party,' GOP lawmaker says",
    "description": "Rep. Riley Moore said on CNN's \"State of the Union\" that Zohran Mamdani, the democratic socialist who won the party's NYC mayoral primary, was a \"gift\" for the GOP.",
    "link": "https://www.foxnews.com/media/democratic-socialist-candidate-nyc-mayor-gift-republican-party-gop-senator-says",
    "timestamp": "2025-06-29T20:00:08Z"
  },
  {
    "title": "Poll: Majority Favor Chaplains in Public Schools",
    "description": "A recent poll found a majority of adults across the United States think public schools should allow chaplains to support students.\nThe post Poll: Majority Favor Chaplains in Public Schools appeared first on Breitbart.",
    "link": "https://www.breitbart.com/education/2025/06/29/poll-majority-favor-chaplains-in-public-schools/",
    "timestamp": "2025-06-29T19:56:44Z"
  }
]