[
  {
    "title": "The U.S. and Iran Agree on Holding Talks but Not Much Else",
    "description": "The two sides remain at odds over what will be discussed in Oman.",
    "link": "http://foreignpolicy.com/2026/02/05/us-iran-talks-oman-russia-new-start-syria/",
    "timestamp": "2026-02-05T22:56:45Z"
  },
  {
    "title": "Epstein waged 'full court press' to get clemency from ex-Florida gov: report",
    "description": "Emails newly uncovered by the Miami Herald reveal how deceased billionaire financier and accused child sex trafficker Jeffrey Epstein attempted a \"full court press\" to get clemency from then-Florida Gov. Charlie Crist after serving out his sweetheart deal sen…",
    "link": "https://www.rawstory.com/epstein-2675103371/",
    "timestamp": "2026-02-05T22:54:32Z"
  },
  {
    "title": "26 reasons to watch the Winter Olympics",
    "description": "This story appeared in Today, Explained, a daily newsletter that helps you understand the most compelling news and stories of the day. Subscribe here. Vox loves the Olympics. Absolutely loves them. We briefly debated popping up a limited-run Winter Olympics n…",
    "link": "https://www.vox.com/today-explained-newsletter/478122/2026-winter-olympics-milan-preview",
    "timestamp": "2026-02-05T22:52:44Z"
  },
  {
    "title": "Exclusive-Mexico seeking way to send fuel to Cuba without being hit by US tariffs, sources say",
    "description": "MEXICO CITY, Feb 5 (Reuters) - Mexican ‌officials are evaluating how to send fuel to Cuba to help meet basic needs such as electricity and ‌transportation without triggering reprisals from Washington, which has threatened tariffs against countries supplying f…",
    "link": "https://www.thestar.com.my/news/world/2026/02/06/exclusive-mexico-seeking-way-to-send-fuel-to-cuba-without-being-hit-by-us-tariffs-sources-say",
    "timestamp": "2026-02-05T22:50:00Z"
  },
  {
    "title": "WATCH LIVE: Trump expected to announce launch of TrumpRx prescription drug site",
    "description": "The site's unveiling, set for Thursday evening, was announced by White House press secretary Karoline Leavitt, who in a post on X called it \"a state of the art website for Americans consumers to purchase low cost prescription drugs.\"",
    "link": "https://www.pbs.org/newshour/politics/watch-live-trump-expected-to-announce-launch-of-trumprx-prescription-drug-site",
    "timestamp": "2026-02-05T22:49:02Z"
  },
  {
    "title": "US steps up aid to Cuba even while choking off fuel supply",
    "description": "WASHINGTON, Feb ‌5 (Reuters) - The U.S. will provide an extra $6 million in ‌humanitarian aid to Cuba, the top State Department ‌aid official said on Thursday, even as Washington has stepped up efforts to block oil supplies to the Caribbean island nation, cau…",
    "link": "https://www.thestar.com.my/news/world/2026/02/06/us-steps-up-aid-to-cuba-even-while-choking-off-fuel-supply",
    "timestamp": "2026-02-05T22:49:00Z"
  },
  {
    "title": "Novo Nordisk vows legal action to protect its new Wegovy pill against cheaper US version",
    "description": "Hims & Hers plans to sell a version of the newly launched pill for $49, far less than the $149 Novo sells the branded pill for in the US.",
    "link": "https://www.thejournal.ie/wegovy-rival-6948865-Feb2026/",
    "timestamp": "2026-02-05T22:48:13Z"
  },
  {
    "title": "Amber Rose Says Billie Eilish's Grammys Speech Only Made Things Worse",
    "description": "Billie Eilish’s acceptance speech at the 2026 Grammy Awards ruffled lots of feathers across Hollywood and beyond ... and now Amber Rose is sharing her 2 cents about the whole situation.",
    "link": "https://www.tmz.com/2026/02/05/amber-rose-billie-eilish-grammys-comment/",
    "timestamp": "2026-02-05T22:45:31Z"
  },
  {
    "title": "Trump's Pearly Gates Ambition: 'Ailing' Prez, 79, Begs to Go To Heaven After He Dies — Despite Admitting He's 'Not The Perfect Candidate'",
    "description": "Donald Trump admitted he's 'not the perfect candidate' to get into heaven during his Prayer Breakfast speech.",
    "link": "https://radaronline.com/p/donald-trump-heaven-wants-to-go-despite-not-being-perfect/",
    "timestamp": "2026-02-05T22:45:00Z"
  },
  {
    "title": "Why is gold price down by 3.9% and will it fall below $4,768 or rise again? Gold drop, analysts insights and market outlook explained. Here's what investors should do now",
    "description": "Why is gold price down by 3.9% and will it fall below $4,768 or rise again? Gold prices dropped as the US dollar rose and stock markets fell. Investors reduced metal positions amid volatility, margin pressure, and risk-off trading across global markets.",
    "link": "https://economictimes.indiatimes.com/news/international/us/why-is-gold-price-down-by-3-9-and-will-it-fall-below-4768-or-rise-again-gold-drop-analysts-insights-and-market-outlook-explained-heres-what-investors-should-do-now-stronger-us-dollar/articleshow/127958747.cms",
    "timestamp": "2026-02-05T22:44:58Z"
  },
  {
    "title": "The Death of New START",
    "description": "The world’s two largest nuclear superpowers no longer have limits on their arsenals.",
    "link": "http://foreignpolicy.com/2026/02/05/new-start-treaty-nuclear-weapons-control-russia-us-trump-putin/",
    "timestamp": "2026-02-05T22:42:08Z"
  },
  {
    "title": "U.S.-Russia New START Nuclear Arms Control Treaty Expires",
    "description": "The world’s two largest nuclear superpowers no longer have limits on their arsenals.",
    "link": "http://foreignpolicy.com/2026/02/05/new-start-treaty-nuclear-weapons-control-russia-us/",
    "timestamp": "2026-02-05T22:42:04Z"
  },
  {
    "title": "White House says murder rate plummeted to lowest level since 1900 under Trump administration",
    "description": "Murder rates in major U.S. cities reportedly hit their lowest level since 1900, with homicides falling 21% in 2025, according to new White House data.",
    "link": "https://www.foxnews.com/politics/white-house-says-murder-rate-plummeted-lowest-level-since-1900-under-trump-administration",
    "timestamp": "2026-02-05T22:40:45Z"
  },
  {
    "title": "Kid Rock Hypes Up His TPUSA Super Bowl Halftime Gig: A Show for People Who ‘Love America’ and ‘Love Jesus’",
    "description": "Kid Rock said viewers of the Turning Point USA Super Bowl halftime show should \"expect the unexpected\" when he takes the stage.\nThe post Kid Rock Hypes Up His TPUSA Super Bowl Halftime Gig: A Show for People Who ‘Love America’ and ‘Love Jesus’ first appeared …",
    "link": "https://www.mediaite.com/media/entertainment/kid-rock-hypes-up-his-tpusa-super-bowl-halftime-gig-a-show-for-people-who-love-america-and-love-jesus/",
    "timestamp": "2026-02-05T22:39:45Z"
  },
  {
    "title": "US steps up aid to Cuba even while choking off fuel supply",
    "description": "By Simon LewisWASHINGTON, Feb 5 (Reuters) - The U.S. will provide an extra $6 million in humanitarian aid to Cuba, the top State Department aid official said on Thursday,… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/us-steps-up-aid-to-cuba-even-while-choking-off-fuel-supply",
    "timestamp": "2026-02-05T22:38:17Z"
  },
  {
    "title": "Sen. Slotkin refuses DOJ interview request over troops video: 'The intimidation is the point'",
    "description": "Slotkin's lawyer urged U.S. Attorney Jeanine Pirro to retain her records in case the senator files a lawsuit over the probe.",
    "link": "https://www.cnbc.com/2026/02/05/slotkin-military-video-bondi-pirro-trump-kelly.html",
    "timestamp": "2026-02-05T22:37:50Z"
  },
  {
    "title": "End of US-Russia nuclear weapons pact 'could not come at a worse time'",
    "description": "The last remaining nuclear arms pact between Russia and the United States has expired after Donald Trump rejected an offer from his Russian counterpart.",
    "link": "https://www.abc.net.au/news/2026-02-06/us-russia-nuclear-weapons-treaty-expires/106312346",
    "timestamp": "2026-02-05T22:35:33Z"
  },
  {
    "title": "Billie Eilish’s Brother Slams 'Powerful Old White Men' Outraged By Her Anti-ICE Speech",
    "description": "Finneas O’Connell came to his sibling’s defense after she got right-wing backlash for saying at the Grammys, “No one is illegal on stolen land.”",
    "link": "https://www.huffpost.com/entry/billie-eilishs-brother-slams-powerful-old-white-men-who-are-mad-about-her-grammys-speech_n_6984fa0be4b04d5037ef6100",
    "timestamp": "2026-02-05T22:35:16Z"
  },
  {
    "title": "Breaking: FBI Arrests Man for Allegedly Targeting Nancy Guthrie's Family with Demands",
    "description": "The FBI arrested a Los Angeles man on Thursday who allegedly sent texts to Nancy Guthrie's family seeking a bitcoin ransom payment.",
    "link": "https://www.westernjournal.com/breaking-fbi-arrests-man-allegedly-targeting-nancy-guthries-family-demands/",
    "timestamp": "2026-02-05T22:34:41Z"
  },
  {
    "title": "Families, lawyers work to locate Maine immigrants moved out of state",
    "description": "Lawyers say it has become harder to locate detainees arrested and flown out of New England since ICE's recent enforcement surge.",
    "link": "https://www.pressherald.com/2026/02/05/families-lawyers-work-to-locate-maine-immigrants-moved-out-of-state/",
    "timestamp": "2026-02-05T22:34:18Z"
  },
  {
    "title": "From ‘The Hills’ Villain To Karen Bass’ Nightmare: Inferno Fuels Spencer Pratt’s LA Mayor Bid",
    "description": "Spencer Pratt was surrounded by a packed room of supporters, telling voters and the Daily Caller News Foundation why he should be the first choice for office.",
    "link": "https://dailycaller.com/2026/02/05/los-angeles-mayor-karen-bass-spencer-pratt/",
    "timestamp": "2026-02-05T22:33:22Z"
  },
  {
    "title": "Kaitlan Collins' Body Language In THAT Trump Exchange Was A Master Class In Dealing With Bullies",
    "description": "Even while being berated, her voice stayed steady.",
    "link": "https://www.huffpost.com/entry/trump-kaitlan-collins-smile-strength-body-language_n_6984b035e4b03d97392718d8",
    "timestamp": "2026-02-05T22:31:55Z"
  },
  {
    "title": "Mark Warner Warns Trump Planning a ‘Coordinated Effort to try to Interfere’ in the Midterms",
    "description": "\"I think we all have got to really raise our game to protect basic democracy in this country,\" Mark Warner warned\nThe post Mark Warner Warns Trump Planning a ‘Coordinated Effort to try to Interfere’ in the Midterms first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/mark-warner-warns-trump-planning-a-coordinated-effort-to-try-to-interfere-in-the-midterms/",
    "timestamp": "2026-02-05T22:30:39Z"
  },
  {
    "title": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raid",
    "description": "Trump shifts explanation of why DNI Gabbard was at FBI Georgia election office raidgo.com",
    "link": "https://abcnews.go.com/Politics/trump-shifts-explanation-dni-gabbard-fbi-georgia-election/story?id=129890577",
    "timestamp": "2026-02-05T22:30:19Z"
  },
  {
    "title": "Experts Warn That MAHA Bait-and-Switch by RFK Jr. and Trump 'Means Big Money for Big Wellness'",
    "description": "Government watchdog Public Citizen on Thursday issued a report outlining the major conflicts of interest held by Health and Human Services Secretary Robert F. Kennedy Jr. and his allies in the Make America Healthy Again, or MAHA, movement.In particular, the r…",
    "link": "https://www.commondreams.org/news/public-citizen-maha-report",
    "timestamp": "2026-02-05T22:26:26Z"
  },
  {
    "title": "Nike’s EEOC Probe Reflects How Trump’s Administration is Challenging Diversity Initiatives",
    "description": "Attorney Bryan M. Sullivan said \"Nike may be less of an outlier and more of a bellwether\" for how the Trump administration is handling DEI matters.",
    "link": "http://wwd.com/footwear-news/shoe-industry-news/nike-eeoc-trump-administration-dei-reverse-discrimination-1238544670/",
    "timestamp": "2026-02-05T22:26:22Z"
  },
  {
    "title": "Private Jet of Billionaire Trump Donor Used to Deport Palestinians From US to Occupied West Bank",
    "description": "A private jet owned by a top donor for President Donald Trump was used to secretly deport Palestinians out of the United States to the occupied West Bank, where they have been separated from their families, according to an investigation published Thursday by …",
    "link": "https://www.commondreams.org/news/trump-donor-jet-palestinian-deportation",
    "timestamp": "2026-02-05T22:24:37Z"
  },
  {
    "title": "Bad Bunny is taking over the US. Does he want Puerto Rico to leave it?",
    "description": "Rapper Bad Bunny will perform Sunday at the Super Bowl halftime show, becoming the first solo male Latin American artist to headline. He’s arriving at the peak of his popularity: The performance comes just a week after receiving the Grammy’s highest honor for…",
    "link": "https://www.vox.com/politics/478063/bad-bunny-super-bowl-puerto-rico-independence",
    "timestamp": "2026-02-05T22:23:59Z"
  },
  {
    "title": "TrumpRx set to launch, but it’s unclear if it will lower drug prices for most patients",
    "description": "By Tami Luhby, Adam Cancryn, CNN (CNN) — TrumpRx, the Trump administration’s much-anticipated direct-to-consumer drug platform, went live on Thursday. A key pillar of President Donald Trump’s effort to lower prescription drug costs, the website will serve as …",
    "link": "https://ktvz.com/health/cnn-health/2026/02/05/trumprx-set-to-launch-but-its-unclear-if-it-will-lower-drug-prices-for-most-patients/",
    "timestamp": "2026-02-05T22:23:19Z"
  },
  {
    "title": "America Is Losing the Facts That Hold It Together",
    "description": "The Trump administration is erasing the country's shared understanding.",
    "link": "https://www.theatlantic.com/newsletters/2026/02/trump-administration-information-war/685901/",
    "timestamp": "2026-02-05T22:23:00Z"
  },
  {
    "title": "Ellen DeGeneres 'Plans to Live Full-Time’ in U.K. After Purchasing CA Home",
    "description": "Ellen DeGeneres and wife Portia de Rossi are still enjoying their time across the pond. A source confirms to Us Weekly that DeGeneres, 68, and de Rossi, 53, purchased a $27.4 million home in Montecito, California, in November 2025. “They are still planning to…",
    "link": "https://www.usmagazine.com/celebrity-news/news/ellen-degeneres-still-plans-to-live-in-u-k-after-purchasing-ca-home/",
    "timestamp": "2026-02-05T22:20:58Z"
  },
  {
    "title": "Daily Press Briefing by the Office of the Spokesperson for the Secretary-General",
    "description": "In Chad today, a humanitarian response plan was launched, calling for $986 million to assist 3.4 million people, including $540 million dedicated to refugees. The plan comes as Chad continues to face one of the most severe humanitarian crises in the Sahel.",
    "link": "https://press.un.org/en/2026/db260205.doc.htm",
    "timestamp": "2026-02-05T22:20:23Z"
  },
  {
    "title": "Trump announces May 17 event to rededicate U.S. as ‘one nation, under God’",
    "description": "On May 17, an event on the National Mall in Washington, D.C., will rededicate the United States as “one nation under God,” Trump announced at the National Prayer Breakfast.",
    "link": "https://www.ewtnnews.com/world/us/trump-prayer-breakfast-2026",
    "timestamp": "2026-02-05T22:19:00Z"
  },
  {
    "title": "Winter Olympics To Protest Trump's Immigration Policies By Removing Ice From Skating Rinks",
    "description": "MILAN — The most prestigious athletic event on the world stage issued a clear political statement this week, as the Winter Olympics announced it would be protesting U.S. President Donald Trump's immigration policies by removing all ice from the skating rinks.",
    "link": "https://babylonbee.com/news/winter-olympics-to-protest-trumps-immigration-policies-by-removing-ice-from-skating-rinks",
    "timestamp": "2026-02-05T22:16:58Z"
  },
  {
    "title": "Is Trump Going to Get Into Heaven? Live Updates",
    "description": "Is Trump going to get into Heaven? From remarks to Diane Sawyer and Fox News to the National Prayer Breakfast, the president can’t stop publicly musing the afterlife. Here are the latest odds on Trump going to Heaven, according to Trump.",
    "link": "http://nymag.com/intelligencer/article/trump-heaven-news-timeline-updates.html",
    "timestamp": "2026-02-05T22:13:33Z"
  },
  {
    "title": "Stephen Colbert’s Brutal Response After Appearing In Epstein Files Goes Viral",
    "description": "Stephen Colbert delivered a viral, Tolkien-inspired roast after discovering his name in the Epstein files.",
    "link": "https://www.boredpanda.com/stephen-colberts-brutal-response-after-appearing-in-epstein-files-goes-viral/",
    "timestamp": "2026-02-05T22:11:08Z"
  },
  {
    "title": "Bessent Confirms Taxpayers Would Be Paying Trump If He Wins $10B Lawsuit",
    "description": "The Treasury Secretary said it would come from the agency’s general fund for tax payments.",
    "link": "https://truthout.org/articles/bessent-confirms-taxpayers-would-be-paying-trump-if-he-wins-10b-lawsuit/",
    "timestamp": "2026-02-05T22:10:56Z"
  },
  {
    "title": "Why Trump Is ‘Frustrated’ With Harvard University Negotiations",
    "description": "President Donald Trump is now seeking a $1 billion settlement with Harvard University because the school has “dragged its feet” during months of negotiations, press... Read More\nThe post Why Trump Is ‘Frustrated’ With Harvard University Negotiations appeared …",
    "link": "https://www.dailysignal.com/2026/02/05/why-trump-is-frustrated-with-harvard-university-negotiations/",
    "timestamp": "2026-02-05T22:10:00Z"
  },
  {
    "title": "The King of Comedy",
    "description": "Donald Trump You know, they rigged the second election. I had to win it, had to win it. I needed it for my own ego. I would have had a bad ego for the rest of my life. No, I really have a big ego, though. Beating these — beating these lunatics was incredible,…",
    "link": "https://www.lawyersgunsmoneyblog.com/2026/02/the-king-of-comedy-2",
    "timestamp": "2026-02-05T22:09:42Z"
  },
  {
    "title": "‘Melania’ Doc Earns Largest Critics-Audience Review Gap in Rotten Tomatoes History",
    "description": "Versant insists that no bot manipulation for the 99% Popcornmeter rating has taken place\nThe post ‘Melania’ Doc Earns Largest Critics-Audience Review Gap in Rotten Tomatoes History appeared first on TheWrap.",
    "link": "https://www.thewrap.com/creative-content/movies/melania-rotten-tomatoes-critics-audience-review-gap/",
    "timestamp": "2026-02-05T22:08:56Z"
  },
  {
    "title": "US announces $6M in aid for Cuba as island's leader accuses it of imposing an 'energy blockade'",
    "description": "The U_S_ has announced an additional $6 million in aid for Cuba as the island’s crisis deepens and tensions escalate between the two countries, with Cuba’s president accusing the U_S_ of an “energy blockade.”",
    "link": "https://abcnews.go.com/International/wireStory/us-announces-6m-aid-cuba-islands-leader-accuses-129897788",
    "timestamp": "2026-02-05T22:06:01Z"
  },
  {
    "title": "Japan election: What to look for in Sunday vote",
    "description": "TOKYO, Feb 6 (Reuters) - Japan’s first female prime minister, Sanae Takaichi, is seeking to secure her grip on power in a national election on Sunday, with polls suggesti… Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/japan-election-what-to-look-for-in-sunday-vote",
    "timestamp": "2026-02-05T22:05:34Z"
  },
  {
    "title": "JEFF DUNCAN: Foreign Countries And Deep State Liberals Wage War On President Trump’s National Security Tariffs",
    "description": "President Donald Trump just declared that the Trump Administration will forge ahead with a strong tariff policy regardless of the Supreme Court: “One way or the",
    "link": "https://dailycaller.com/2026/02/05/opinion-foreign-countries-and-deep-state-liberals-wage-war-on-president-trumps-national-security-tariffs-jeff-duncan/",
    "timestamp": "2026-02-05T22:04:48Z"
  },
  {
    "title": "Bitcoin falls to lowest value since Trump took office",
    "description": "The price of the digital currency has dropped significantly despite President Donald Trump’s public support.",
    "link": "https://www.bbc.com/news/articles/cy09x24q0pro",
    "timestamp": "2026-02-05T22:03:48Z"
  },
  {
    "title": "Trump mocked after claiming he’s the last one who wants to complain about elections",
    "description": "President Donald Trump sparked widespread ridicule after telling NBC News he would accept a Republican midterm loss only “if the elections are honest,” then insisting he was “the last one that wants to complain.” The remark, delivered during a sit-down with N…",
    "link": "https://www.rawstory.com/trump-interview-2675102127/",
    "timestamp": "2026-02-05T22:03:02Z"
  },
  {
    "title": "CNN’s Daniel Dale Calls Out NBC’s Tom Llamas Over Presidential Interview: ‘Kept Ignoring’ Trump’s ‘Long-Debunked’ Lies",
    "description": "Daniel Dale called out Tony Llamas for \"ignoring\" Donald Trump's \"long-debunked lies\" in his extensive interview on Wednesday evening.\nThe post CNN’s Daniel Dale Calls Out NBC’s Tom Llamas Over Presidential Interview: ‘Kept Ignoring’ Trump’s ‘Long-Debunked’ L…",
    "link": "https://www.mediaite.com/media/news/cnns-daniel-dale-calls-out-nbcs-tom-llamas-over-presidential-interview-kept-ignoring-trumps-long-debunked-lies/",
    "timestamp": "2026-02-05T22:02:06Z"
  },
  {
    "title": "Cuban president says he's willing to talk to U.S. but preparing a 'defense plan' as fuel crisis worsens",
    "description": "President Donald Trump recently threatened to impose tariffs on any country that sells or provides oil to Cuba and has said the country is on the verge of collapse.",
    "link": "https://www.nbcnews.com/world/cuba/cuba-president-prepares-state-of-war-rcna257028",
    "timestamp": "2026-02-05T22:00:24Z"
  },
  {
    "title": "Pride-Flag Toting Educator Rants That ‘MAGA Teachers’ Shouldn’t Exist",
    "description": "A teacher who wore a “pride” shirt and had a “pride” flag on her bulletin board called for an “oath” that would exclude teachers who supported Donald Trump.",
    "link": "https://dailycaller.com/2026/02/05/pride-flag-toting-educator-rants-that-maga-teachers-shouldnt-exist/",
    "timestamp": "2026-02-05T22:00:07Z"
  },
  {
    "title": "Elon Musk Will Be Deposed Over What He Did With DOGE",
    "description": "Elon Musk will have to testify over his role in shuttering the U.S. Agency for International Development, a federal judge ruled Wednesday.U.S. District Judge Theodore Chuang ruled that “extraordinary circumstances justify” compelling Musk and two former USAID…",
    "link": "https://newrepublic.com/post/206223/elon-musk-will-deposed-doge",
    "timestamp": "2026-02-05T22:00:07Z"
  },
  {
    "title": "The tension at the center of Trump's retooled immigration message: From the Politics Desk",
    "description": "In today’s edition, Jonathan Allen examines how President Donald Trump is attempting to fine-tune his immigration approach.",
    "link": "https://www.nbcnews.com/politics/politics-news/tension-center-trumps-retooled-immigration-message-politics-desk-rcna257612",
    "timestamp": "2026-02-05T22:00:00Z"
  },
  {
    "title": "Homeland Security shutdown grows more likely as Republicans rebuff Democrats’ ICE demands",
    "description": "WASHINGTON (AP) — Senate Majority Leader John Thune said Thursday that demands made by Democrats for new restrictions on federal immigration officers are “unrealistic” and warned that the Department of Homeland Security will shut down next week if they do not…",
    "link": "https://freerepublic.com/focus/f-news/4365606/posts",
    "timestamp": "2026-02-05T21:59:37Z"
  },
  {
    "title": "Trump’s deportation push is scrambling New York’s suburban politics",
    "description": "Fury over immigration enforcement is dividing swing districts and putting pressure on moderate Democrats and pro-Trump Republicans.ALBANY, New York — Simmering anger over President Donald Trump’s expansive deportation strategy has roiled the Empire State’s be…",
    "link": "https://freerepublic.com/focus/f-news/4365604/posts",
    "timestamp": "2026-02-05T21:56:48Z"
  },
  {
    "title": "Gabbard's office examined voting machines in Puerto Rico",
    "description": "Tulsi Gabbard’s office says it obtained and examined electronic voting machines in Puerto Rico last year to look for possible security vulnerabilities.",
    "link": "https://www.nbcnews.com/politics/elections/tulsi-gabbards-office-says-examined-electronic-voting-systems-puerto-r-rcna257602",
    "timestamp": "2026-02-05T21:56:32Z"
  },
  {
    "title": "Bitcoin plunges: Original cryptocurrency now below pre-Trump second term levels",
    "description": "The price of bitcoin continued its monthslong slide Thursday, falling another 14% below $64,000, and is now worth less than it was when President Donald Trump was elected into his second term of office. The original cryptocurrency, pitched as “digital gold,” …",
    "link": "https://www.bostonherald.com/2026/02/05/bitcoin-plunges-original-cryptocurrency-now-below-pre-trump-second-term-levels/",
    "timestamp": "2026-02-05T21:53:14Z"
  },
  {
    "title": "How “Bitcoin Jesus” Avoided Prison, Thanks To One Of The “Friends Of Trump”",
    "description": "This story wasoriginally publishedby ProPublica.Republished under aCC BY-NC-ND 3.0license. Days into President Donald Trump’s second term in the White House, a cryptocurrency billionaire posted avideo on Xto his hundreds of thousands of followers. “Please Don…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=180739240",
    "timestamp": "2026-02-05T21:52:05Z"
  },
  {
    "title": "US announces $6M in aid for Cuba as island’s leader accuses it of imposing an ‘energy blockade’",
    "description": "The aid is largely meant for those affected by Hurricane Melissa last year.",
    "link": "https://www.bostonherald.com/2026/02/05/us-cuba-aid/",
    "timestamp": "2026-02-05T21:51:19Z"
  },
  {
    "title": "Trump Admin Plans to Place Statue of Christopher Columbus on White House Lawn",
    "description": "A White House spokesperson said Trump views the colonizer and genocidaire as a “hero.”…",
    "link": "https://truthout.org/articles/trump-admin-plans-to-place-statue-of-christopher-columbus-on-white-house-lawn/",
    "timestamp": "2026-02-05T21:51:06Z"
  },
  {
    "title": "Trump’s warning to Iran: Letters to the Editor — Feb. 6, 2026",
    "description": "NY Post readers discuss The Post’s editorial calling on President Trump to take military action against Iran.",
    "link": "https://nypost.com/2026/02/05/opinion/trumps-warning-to-iran-letters/",
    "timestamp": "2026-02-05T21:50:17Z"
  },
  {
    "title": "Cuban government announces readiness to dialogue with U.S.",
    "description": "Cuban President Miguel Díaz-Canel stated that his government is willing to engage in dialogue with the United States, but without pressure and without regime change.",
    "link": "https://www.ewtnnews.com/world/americas/cuban-government-says-its-willing-to-dialogue-with-usa",
    "timestamp": "2026-02-05T21:49:00Z"
  },
  {
    "title": "Trump has no ‘formal plans’ to deploy ICE at polling sites, White House says",
    "description": "By Nandita BoseWASHINGTON, Feb 5 (Reuters) - President Donald Trump has not discussed “formal plans” to deploy U.S. Immigration and Customs Enforcement agents to polling … Leggi",
    "link": "https://www.internazionale.it/ultime-notizie-reuters/2026/02/05/trump-has-no-formal-plans-to-deploy-ice-at-polling-sites-white-house-says",
    "timestamp": "2026-02-05T21:47:07Z"
  },
  {
    "title": "US says Trump prefers diplomacy with Iran but warns he has military options",
    "description": "The White House says diplomacy will come first at Iran-US talks in Oman but warns that military options remain on the table.",
    "link": "https://www.channelnewsasia.com/world/us-trump-iran-diplomacy-military-oman-5911131",
    "timestamp": "2026-02-05T21:45:35Z"
  },
  {
    "title": "Bitcoin price falls below pre-Trump second term levels, now hovering below $67,000",
    "description": "The price of bitcoin continued its monthslong slide Thursday, falling another 11% to $67,000, and is now worth less than it was when President Donald Trump was elected into his second term of office.  The original cryptocurrency, pitched as “digital gold,” ha…",
    "link": "https://japantoday.com/category/business/bitcoin%27s-monthslong-slide-continues-hitting-fresh-15-month-low-of-67-000",
    "timestamp": "2026-02-05T21:44:59Z"
  },
  {
    "title": "Minneapolis man is charged with threatening and cyberstalking ICE officers",
    "description": "A Minneapolis man was arrested Thursday on charges of cyberstalking and threatening to kill or assault Immigration and Customs Enforcement officers involved in the crackdown in Minnesota.",
    "link": "https://www.wpxi.com/news/national/minneapolis-man-is-charged-with-threatening-cyberstalking-ice-officers/3GEHI4FHCVCMHIDGE7LKHHYUIU/",
    "timestamp": "2026-02-05T21:44:24Z"
  },
  {
    "title": "ICE’s Approval Collapses in New Polls — 58% of Americans Want Kristi Noem Removed",
    "description": "Two new polls show a harsh assessment for the immigration policies of President Donald Trump's administration.\nThe post ICE’s Approval Collapses in New Polls — 58% of Americans Want Kristi Noem Removed first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/news/ices-approval-collapses-in-new-polls-58-of-americans-want-kristi-noem-removed/",
    "timestamp": "2026-02-05T21:43:00Z"
  },
  {
    "title": "Why a Republican Supreme Court just handed a victory to Democrats",
    "description": "On Wednesday, the Supreme Court handed down a one-sentence order announcing that California’s newly gerrymandered maps, which are expected to give Democrats as many as five more seats in the US House, may go into effect during the 2026 midterms. These maps we…",
    "link": "https://www.vox.com/politics/478137/supreme-court-california-gerrymander",
    "timestamp": "2026-02-05T21:42:34Z"
  },
  {
    "title": "Gavin Newsom’s 2028 problem, California gov’s shady ‘housing’ pals and other commentary",
    "description": "Gov. Gavin Newsom is the “undeniable front-runner” for the 2028 Democratic nomination, observes Ruy Teixeira at The Free Press.",
    "link": "https://nypost.com/2026/02/05/opinion/gavin-newsoms-2028-problem-california-govs-shady-housing-pals-and-other-commentary/",
    "timestamp": "2026-02-05T21:42:11Z"
  },
  {
    "title": "Trump Is Using a Donor’s Private Jet to Deport Palestinians",
    "description": "When private industry refused, Donald Trump tapped his extraordinarily wealthy allies to deport Palestinians back to the West Bank for him.On January 21, eight Palestinian men were flown from an Arizona airport to Tel Aviv thanks to Florida real estate magnat…",
    "link": "https://newrepublic.com/post/206220/donald-trump-donor-private-jet-deport-palestinians",
    "timestamp": "2026-02-05T21:41:44Z"
  },
  {
    "title": "Megyn Kelly Defended Trump’s Sexist Remark — And It Included A Shocking Name-Drop",
    "description": "The former Fox News host had a bizarre way of justifying the president's attack on CNN’s Kaitlan Collins.",
    "link": "https://www.huffpost.com/entry/megyn-kelly-roger-alies-career-advice_n_6984cb22e4b04d5037ef083e",
    "timestamp": "2026-02-05T21:41:06Z"
  },
  {
    "title": "Trump tempers criticism of UK’s Chagos Islands deal after talk with Starmer",
    "description": "Despite calling it earlier an ‘act of great stupidity’, Trump signals support of Starmer’s Chagos deal.",
    "link": "https://www.aljazeera.com/news/2026/2/5/trump-tempers-criticism-of-uks-chagos-islands-deal-after-talk-with-starmer",
    "timestamp": "2026-02-05T21:40:54Z"
  },
  {
    "title": "Trump endorses Takaichi before election; announces her March 19 visit",
    "description": "U.S. President Donald Trump on Thursday endorsed Japan's Prime Minister Sanae Takaichi ahead of the country's general election and said he will welcome her to the White House on March 19. While Trump is often an outlier, it is very rare for the leader of any …",
    "link": "https://japantoday.com/category/politics/update1-trump-endorses-japan%27s-takaichi-before-election-unveils-her-march-visit",
    "timestamp": "2026-02-05T21:40:30Z"
  },
  {
    "title": "Karoline Leavitt says Trump prefers not to watch Bad Bunny at Super Bowl halftime show",
    "description": "White House Press Secretary Karoline Leavitt revealed President Donald Trump would choose Kid Rock's \"All-American\" halftime show over Bad Bunny's official Super Bowl performance.",
    "link": "https://www.foxnews.com/sports/karoline-leavitt-says-trump-prefers-not-watch-bad-bunny-super-bowl-halftime-show",
    "timestamp": "2026-02-05T21:39:54Z"
  },
  {
    "title": "Plastic surgeons group calls for delaying gender-affirming surgery until age 19",
    "description": "nder-affirming care for kidsGender-affirming care for transgender youth, under standards widely used in the U.S., entails developing a plan with medical experts and family members that includes supportive talk therapy and can — but does not always — involve p…",
    "link": "https://www.nbcnews.com/health/health-news/plastic-surgeons-group-delay-gender-affirming-surgery-age-19-rcna257607",
    "timestamp": "2026-02-05T21:38:29Z"
  },
  {
    "title": "89 kidnapped Nigerian Christians released: authorities",
    "description": "The last 89 Christians held captive since criminal gangs attacked three churches in northern Nigeria in mid-January were released on Thursday, according to local officials and an AFP journalist. The worshippers, dressed in yellow, arrived on a bus escorted by…",
    "link": "https://japantoday.com/category/world/89-kidnapped-nigerian-christians-released-authorities",
    "timestamp": "2026-02-05T21:37:41Z"
  },
  {
    "title": "Starmer didn't know Jeffrey Epstein, but UK prime minister's job is under threat",
    "description": "Keir Starmer never met Jeffrey Epstein. But the British prime minister’s job is under threat because of the fallout from the late sex offender’s global web of relationships. Friendship with Epstein has already brought down a British royal – Andrew Mountbatten…",
    "link": "https://japantoday.com/category/world/uk-leader-apologizes-to-victims-of-epstein-for-giving-peter-mandelson-an-ambassador-job",
    "timestamp": "2026-02-05T21:37:17Z"
  },
  {
    "title": "Iran, U.S. prepare for Oman talks after deadly protest crackdown",
    "description": "Iran and the United States were preparing for talks on Friday in Oman, with Washington looking to see if there is any prospect of diplomatic progress on the Iranian nuclear program and other issues while refusing to rule out military action. The talks, which …",
    "link": "https://japantoday.com/category/world/iran-us-prepare-for-oman-talks-after-deadly-protest-crackdown",
    "timestamp": "2026-02-05T21:37:00Z"
  },
  {
    "title": "U.S. and Russia agree to reestablish military dialogue after Ukraine talks",
    "description": "The U.S. and Russia agreed Thursday to reestablish high-level military dialogue for the first time in more than four years in another sign of warming relations between the two countries since President Donald Trump returned to office and sought to end the war…",
    "link": "https://japantoday.com/category/world/russia-and-ukraine-hold-a-second-day-of-us-brokered-peace-talks-in-abu-dhabi",
    "timestamp": "2026-02-05T21:36:54Z"
  },
  {
    "title": "Homeland Security shutdown grows more likely as Republicans rebuff Democrats' ICE demands",
    "description": "Senate Majority Leader John Thune said Thursday that demands made by Democrats for new restrictions on federal immigration officers are “unrealistic” and warned that the Department of Homeland Security will shut down next week if they do not work with Republi…",
    "link": "https://japantoday.com/category/world/a-homeland-security-shutdown-grows-more-likely-as-republicans-rebuff-democratic-demands-for-ice",
    "timestamp": "2026-02-05T21:36:37Z"
  },
  {
    "title": "Russia says it regrets expiration of last nuclear arms treaty, but Trump says he wants a new pact",
    "description": "The Kremlin said Thursday it regretted the expiration of the last remaining nuclear arms pact between Russia and the United States, while U.S. President Donald Trump declared he was against keeping its limits and wants a better deal. The pact's termination le…",
    "link": "https://japantoday.com/category/world/the-last-us-russia-nuclear-pact-expires-prompting-fears-of-a-new-arms-race",
    "timestamp": "2026-02-05T21:36:28Z"
  },
  {
    "title": "This Republican Wants To Resurrect Biden-Style Green Government Handouts",
    "description": "Republican Pennsylvania Rep. Brian Fitzpatrick told E&E News that he is looking to introduce legislation that would resurrect green energy tax credits.",
    "link": "https://dailycaller.com/2026/02/05/republican-resurrect-biden-style-green-government-handouts/",
    "timestamp": "2026-02-05T21:36:08Z"
  },
  {
    "title": "Trump Just Finalized A Dystopian New Rule No President Has Used Before",
    "description": "A new rule will face legal battles, but would make “resistance” to Trump policies — like saying climate change is real — a fireable offense.",
    "link": "https://www.huffpost.com/entry/schedule-f-policy-career-final-rule-civil-service-job-protections_n_6984efa0e4b04d5037ef524d",
    "timestamp": "2026-02-05T21:36:02Z"
  },
  {
    "title": "Leavitt flips script on media for balking at Fulton election probe after years of promoting Russia claims",
    "description": "White House press secretary Karoline Leavitt defends FBI seizing ballots in Fulton County, Georgia, criticizing media outlets questioning the operation.",
    "link": "https://www.foxnews.com/politics/leavitt-flips-script-media-balking-fulton-election-probe-after-years-promoting-russia-claims",
    "timestamp": "2026-02-05T21:35:04Z"
  },
  {
    "title": "Ex-judge warns Trump faces a court tsunami as judges stop backing down",
    "description": "President Donald Trump’s long-running war with the federal judiciary may be nearing a breaking point, as former conservative judge Michael Luttig warned the administration is headed for a sweeping legal reckoning. Speaking on the Legal AF podcast, Luttig said…",
    "link": "https://www.rawstory.com/courts/",
    "timestamp": "2026-02-05T21:35:01Z"
  },
  {
    "title": "Last 89 Christians held captive after kidnapping in northern Nigeria last month released",
    "description": "They were snatched from three churches during Sunday services on 18 January, in the predominantly Christian district of Kajuru, Kaduna state.",
    "link": "https://www.thejournal.ie/last-89-christians-held-captive-after-kidnapping-in-nigeria-released-6948799-Feb2026/",
    "timestamp": "2026-02-05T21:34:53Z"
  },
  {
    "title": "Bitcoin plunges to lowest level since October 2024",
    "description": "Bitcoin plunges to lowest level since October 2024go.com",
    "link": "https://abcnews.go.com/Business/bitcoin-plunges-lowest-level-october-2024/story?id=129891298",
    "timestamp": "2026-02-05T21:30:13Z"
  },
  {
    "title": "What to expect from Bad Bunny’s Super Bowl halftime show? Dancing, culture and a side of politics",
    "description": "Culture war commentary has swirled around the upcoming Super Bowl halftime performance since Puerto Rican superstar Bad Bunny was named as the headliner. That’s only increased after music stars, including Bad Bunny, used the Grammy Awards stage on Sunday to c…",
    "link": "https://www.cbc.ca/news/entertainment/super-bowl-halftime-show-bad-bunny-politics-9.7075612",
    "timestamp": "2026-02-05T21:29:55Z"
  },
  {
    "title": "How “Bitcoin Jesus” Avoided Prison, Thanks To One Of The “Friends Of Trump”",
    "description": "This story was originally published by ProPublica. Republished under a CC BY-NC-ND 3.0 license. Days into President Donald Trump’s second term in the White House, a cryptocurrency billionaire posted a video on X to his hundreds of thousands of followers. “Ple…",
    "link": "https://www.techdirt.com/2026/02/05/how-bitcoin-jesus-avoided-prison-thanks-to-one-of-the-friends-of-trump/",
    "timestamp": "2026-02-05T21:29:38Z"
  },
  {
    "title": "'Can you shut up?' Maxine Waters SNAPS at Scott Bessent at wild hearing... but the Treasury Secretary hits back with a delicious response",
    "description": "Scott Bessent left Democrats fuming on Capitol Hill on Wednesday as he refused to bend to their furious yelling, including requests for him to 'shut up' and repeated direct attacks on his work. Donald Trump's Treasury Secretary went toe to toe with California…",
    "link": "https://freerepublic.com/focus/f-chat/4365601/posts",
    "timestamp": "2026-02-05T21:28:08Z"
  },
  {
    "title": "Karoline Leavitt Throws Russiagate Back In Media’s Face to Justify Gabbard’s Election Probe",
    "description": "Karoline Leavitt cited the \"Russiagate\" controversy in response to questions about a top Trump official being involved in the Georgia election probe.\nThe post Karoline Leavitt Throws Russiagate Back In Media’s Face to Justify Gabbard’s Election Probe first ap…",
    "link": "https://www.mediaite.com/media/news/karoline-leavitt-throws-russiagate-back-in-medias-face-to-justify-gabbards-election-probe/",
    "timestamp": "2026-02-05T21:27:11Z"
  },
  {
    "title": "Karoline Leavitt's Age Gap With Husband Is Still a Joke to Some",
    "description": "When it comes to Leavitt and her elderly husband, the jokes write themselves.",
    "link": "https://cafemom.com/entertainment/karoline-leavitt-and-husband-age-gap-jokes",
    "timestamp": "2026-02-05T21:26:29Z"
  },
  {
    "title": "It's Super Bowl weekend and here's what you need to know",
    "description": "Here's everything you need to know about the Super Bowl, including when it will start, how to watch, and who you'll see on the stage at half-time.",
    "link": "https://www.abc.net.au/news/2026-02-06/super-bowl-how-to-watch-australia-2026/106272636",
    "timestamp": "2026-02-05T21:26:10Z"
  },
  {
    "title": "Republicans talk 's**t' about Trump behind his back — but fear of MAGA 'Twitter army' keeps them quiet, Eric Swalwell claims",
    "description": "Democratic Rep. Eric Swalwell of California claims that Republicans criticize the president behind closed doors but are too afraid of threats from his supporters to speak publicly.Swalwell made the comments to TMZ Tuesday when asked about what happens between…",
    "link": "https://www.theblaze.com/news/swalwell-republicans-gym-trump-fear",
    "timestamp": "2026-02-05T21:25:00Z"
  },
  {
    "title": "Tulsi Gabbard’s Office Reveals Voting Machine Probe In US Territory",
    "description": "A team working under Director of National Intelligence (DNI) Tulsi Gabbard probed Puerto Rico's voting machines in May 2025, Reuters reported on Wednesday.",
    "link": "https://dailycaller.com/2026/02/05/tulsi-gabbards-office-voting-machine-probe/",
    "timestamp": "2026-02-05T21:24:29Z"
  },
  {
    "title": "Donald Trump Is Skipping The Super Bowl To Avoid Being Booed",
    "description": "Donald Trump Is Skipping The Super Bowl To Avoid Being Booedlittlethings.com",
    "link": "https://littlethings.com/entertainment/donald-trump-skipping-super-bowl-real-reason",
    "timestamp": "2026-02-05T21:24:13Z"
  },
  {
    "title": "Trump-Supporting TV Personality Savannah Chrisley to Guest Host 'The View'",
    "description": "Trump-supporting television personality Savannah Chrisley will join The View's lineup to replace Alyssa Farah Griffin while she is on maternity leave. \nThe post Trump-Supporting TV Personality Savannah Chrisley to Guest Host ‘The View’ appeared first on Breit…",
    "link": "https://www.breitbart.com/entertainment/2026/02/05/trump-supporting-tv-personality-to-guest-host-the-view/",
    "timestamp": "2026-02-05T21:23:48Z"
  },
  {
    "title": "Something Bad Is Afoot",
    "description": "Tulsi Gabbard burying whistleblower complaints, Sen. Ron Wyden sending a cryptic and very public letter to the CIA director about 'CIA activities' ... not good!",
    "link": "https://www.wonkette.com/p/something-bad-is-afoot",
    "timestamp": "2026-02-05T21:23:20Z"
  }
]