[
  {
    "title": "‘The Real Russian Conspiracy’: Turley Explains How Media And Clinton Campaign ‘Derailed’ Trump’s First Term",
    "description": "GWU law professor Jonathan Turley explained on Fox News Tuesday the timeline that led to the derailment of President Donald Trump's first term.",
    "link": "https://dailycaller.com/2025/07/29/jonathan-turley-media-clinton-trump-first-term/",
    "timestamp": "2025-07-30T02:58:20Z"
  },
  {
    "title": "Fed won't 'escape Trump unscathed' — and is about to cave: analyst",
    "description": "President Donald Trump's public pressure on the Federal Reserve appears to be working, according to a new report. The Wall Street Journal reported on Tuesday that governors Christopher Waller and Michelle Bowman, both of whom are Trump appointees, are conside…",
    "link": "https://www.rawstory.com/trump-2673782843/",
    "timestamp": "2025-07-30T02:54:12Z"
  },
  {
    "title": "Oil Prices Remain Elevated as Traders Brace for Volatile Week",
    "description": "Oil prices held onto recent gains in early Asian trading on Wednesday, buoyed by a complex mix of geopolitical risks, tightening trade policies, and anticipation surrounding the U.S. Federal Reserve’s upcoming interest rate decision. After surging more than 3…",
    "link": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Prices-Remain-Elevated-as-Traders-Brace-for-Volatile-Week.html",
    "timestamp": "2025-07-30T02:48:17Z"
  },
  {
    "title": "Kellogg: We Aren't Really Enforcing Russian Oil Sanctions, If We Did, 'They Start to Bite'",
    "description": "On Tuesday’s broadcast of Newsmax TV’s “The Record,” Special Presidential Envoy for Russia and Ukraine Keith Kellogg said that the United States has not really gone after Russia’s money flows from oil that hard and that the level of sanctions\nThe post Kellogg…",
    "link": "https://www.breitbart.com/clips/2025/07/29/kellogg-we-arent-really-enforcing-russian-oil-sanctions-if-we-did-they-start-to-bite/",
    "timestamp": "2025-07-30T02:48:00Z"
  },
  {
    "title": "Kellogg: Russia Could End War Tomorrow, 'The Ukrainians Will Move that Fast'",
    "description": "On Tuesday’s broadcast of Newsmax TV’s “The Record,” Special Presidential Envoy for Russia and Ukraine Keith Kellogg stated that the Russia-Ukraine war would be over with right away if Russia said it wanted a ceasefire and if Russia did so,\nThe post Kellogg: …",
    "link": "https://www.breitbart.com/clips/2025/07/29/kellogg-russia-could-end-war-tomorrow-ukrainians-will-move-that-fast/",
    "timestamp": "2025-07-30T02:47:57Z"
  },
  {
    "title": "Markets Mixed As China-US Talks End, Eyes On Tech Earnings",
    "description": "Asian markets were mixed Wednesday as investors kept tabs on China-US developments after they agreed to further talks to extend their trade truce, while eyes were also on tech earnings and a key Federal Reserve meeting.",
    "link": "https://www.ibtimes.com/markets-mixed-china-us-talks-end-eyes-tech-earnings-3779781",
    "timestamp": "2025-07-30T02:45:13Z"
  },
  {
    "title": "Review of World Affairs",
    "description": "* Israel, Gaza, and the Starvation Weapon * Thai-Cambodian Border Conflict By Shashi P.B.B. Malla Gaza: The Most Egregious Starvation […]\nThe post Review of World Affairs appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/07/30/review-of-world-affairs-59/",
    "timestamp": "2025-07-30T02:45:00Z"
  },
  {
    "title": "Who was Virginia Giuffre, the 'young female staff' Trump claims Jeffrey Epstein 'stole' from Mar-a-Lago?",
    "description": "Donald Trump claims Jeffrey Epstein 'stole' Virginia Giuffre from Mar-a-Lago, alleging Epstein poached spa staff, including Giuffre. This claim resurfaces scrutiny of Trump's past ties with Epstein, amidst Giuffre's allegations of recruitment at Mar-a-Lago. G…",
    "link": "https://timesofindia.indiatimes.com/etimes/trending/who-was-virginia-giuffre-the-young-female-staff-trump-claims-jeffrey-epstein-stole-from-mar-a-lago/articleshow/122987123.cms",
    "timestamp": "2025-07-30T02:44:21Z"
  },
  {
    "title": "But I was assured there was no missing minute or three and the we should STOP TALKING ABOUT JEFF EPSTEIN AND DONALD TRUMP [Unlikely]",
    "description": "But I was assured there was no missing minute or three and the we should STOP TALKING ABOUT JEFF EPSTEIN AND DONALD TRUMP",
    "link": "https://www.fark.com/comments/13758138/But-I-was-assured-there-was-no-missing-minute-three-the-we-should-STOP-TALKING-ABOUT-JEFF-EPSTEIN-AND-DONALD-TRUMP",
    "timestamp": "2025-07-30T02:44:12Z"
  },
  {
    "title": "Lionesses party with thousands of fans after Euro 2025 triumph",
    "description": "England's victorious Lionesses celebrated their dramatic Women's Euro 2025 triumph along with tens of thousands of ecstatic fans outside Buckingham Palace on Tuesday. Sarina Wiegman's team successfully defended their European crown by beating world champions …",
    "link": "https://japantoday.com/category/sports/england%27s-lionesses-party-in-london-after-euro-2025-triumph",
    "timestamp": "2025-07-30T02:43:11Z"
  },
  {
    "title": "Trump's ex-lawyer Emil Bove confirmed as appeals court judge",
    "description": "Allegations by three whistleblowers were not enough to halt the appointment of from clearing the Senate.",
    "link": "https://www.bbc.com/news/articles/c741l1lpnnqo",
    "timestamp": "2025-07-30T02:41:51Z"
  },
  {
    "title": "Markets mixed as China-US talks end, eyes on tech earnings",
    "description": "Asian markets were mixed Wednesday as investors kept tabs on China-US developments after they agreed to further talks to extend their trade truce, while eyes...",
    "link": "https://finance.yahoo.com/news/markets-mixed-china-us-talks-023957539.html",
    "timestamp": "2025-07-30T02:39:57Z"
  },
  {
    "title": "Is Conor McGregor returning to UFC? The Notorious teased training and testing pool video ahead of White House card",
    "description": "Conor McGregor hints at a UFC comeback. He shares training videos and confirms re-entry into the UFC's testing pool. David Feldman, BKFC president, supports this news. McGregor aims for a fight on a potential White House card on July 4, 2026. Former President…",
    "link": "https://timesofindia.indiatimes.com/sports/international-sports/is-conor-mcgregor-returning-to-ufc-the-notorious-teased-training-and-testing-pool-video-ahead-of-white-house-card/articleshow/122986978.cms",
    "timestamp": "2025-07-30T02:39:38Z"
  },
  {
    "title": "Asian stocks steady as investors brace for tariff deadline and Fed",
    "description": "SINGAPORE (Reuters) -Asian stocks rose modestly on Wednesday, with investors cautious after trade talks between the U.S. and China ended without any...",
    "link": "https://finance.yahoo.com/news/asian-stocks-steady-investors-brace-023933042.html",
    "timestamp": "2025-07-30T02:39:33Z"
  },
  {
    "title": "Ted Cruz Claims Democrats ‘Want More Child Molesters’ in the U.S. – ‘And That Is Not Hyperbole’",
    "description": "Sen. Ted Cruz claimed that Democrats \"want more child molesters\" in the U.S. and insisted that his comment \"is not hyperbole.\"\nThe post Ted Cruz Claims Democrats ‘Want More Child Molesters’ in the U.S. – ‘And That Is Not Hyperbole’ first appeared on Mediaite.",
    "link": "https://www.mediaite.com/media/tv/ted-cruz-claims-democrats-want-more-child-molesters-in-the-u-s-and-that-is-not-hyperbole/",
    "timestamp": "2025-07-30T02:37:26Z"
  },
  {
    "title": "Should The ‘Indians’ And ‘Redskins’ Names Return To Sports? As Stadium Vote Looms, Trump Believes So",
    "description": "Has the time come to bring back the Redskins and Indians? With the RFK Stadium vote in DC, the Redskins and Indians name debate has returned, thanks to President Trump.",
    "link": "https://www.forbes.com/sites/dougmelville/2025/07/29/should-the-indians-and-redskins-names-return-to-sports-as-stadium-vote-looms-trump-believes-so/",
    "timestamp": "2025-07-30T02:36:32Z"
  },
  {
    "title": "How Brussels got tough on China to secure trade deal with Donald Trump",
    "description": "Washington and Brussels have vowed to join forces against China’s excess production of subsidized steel.",
    "link": "https://www.politico.eu/article/brussels-trade-deal-donald-trump-china-steel-production/",
    "timestamp": "2025-07-30T02:30:00Z"
  },
  {
    "title": "Charlie Kirk embraces 'South Park' parody of him in upcoming episode as a 'badge of honor'",
    "description": "In an interview with Fox News Digital, Turning Point USA founder Charlie Kirk reacts to the \"South Park\" teaser showing him being satirized by the long-running animated series.",
    "link": "https://www.foxnews.com/media/charlie-kirk-embraces-south-park-parodying-him-upcoming-episode-badge-honor",
    "timestamp": "2025-07-30T02:27:40Z"
  },
  {
    "title": "Ukraine Says Russian Strike On Training Camp Kills 3 Soldiers",
    "description": "A Russian strike on a military training camp killed at least three Ukrainian soldiers on Tuesday, following an overnight offensive in the south that killed a pregnant woman and a dozen prisoners.",
    "link": "https://www.ibtimes.com/ukraine-says-russian-strike-training-camp-kills-3-soldiers-3779777",
    "timestamp": "2025-07-30T02:27:21Z"
  },
  {
    "title": "Ukraine says Russian strike on training camp kills 3 soldiers",
    "description": "A Russian strike on a military training camp killed at least three Ukrainian soldiers on Tuesday, following an overnight offensive in the south that killed a...",
    "link": "https://www.yahoo.com/news/articles/ukraine-says-russian-strike-training-022445842.html",
    "timestamp": "2025-07-30T02:24:45Z"
  },
  {
    "title": "Oil steady after big gains on Trump's Russia ultimatum",
    "description": "Oil prices saw a slight increase on Wednesday. This followed a rise of over 3% previously. Donald Trump gave Russia a deadline to end the war in Ukraine. He threatened tariffs. These tariffs could disrupt Russian oil exports. The US and EU averted a trade war…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/oil-steady-after-big-gains-on-trumps-russia-ultimatum/articleshow/122986922.cms",
    "timestamp": "2025-07-30T02:23:14Z"
  },
  {
    "title": "Euro hovers near one-month lows after trade deal, focus switches to Fed",
    "description": "The euro stabilized after recent losses, influenced by U.S.-EU trade dynamics and anticipation of Federal Reserve and Bank of Japan policy meetings. While U.S. and China aim to extend tariff truce, the U.S.-EU accord sparks mixed reactions in Europe due to pe…",
    "link": "https://economictimes.indiatimes.com/markets/forex/euro-hovers-near-one-month-lows-after-trade-deal-focus-switches-to-fed/articleshow/122986880.cms",
    "timestamp": "2025-07-30T02:18:45Z"
  },
  {
    "title": "xAI teases Grok video generator that will have 'spicy' mode, according to an employee",
    "description": "Elon Musk and xAI announced on Monday that Grok users will soon be able to generate AI videos complete with sound on its app.",
    "link": "https://www.nbcnews.com/tech/elon-musk/grok-video-generator-will-spicy-mode-says-xai-employee-rcna221807",
    "timestamp": "2025-07-30T02:16:30Z"
  },
  {
    "title": "Gold holds steady ahead of Fed policy statement",
    "description": "Gold prices remained stable as investors awaited the Federal Reserve's policy statement for insights into future rate cuts. Focus also remained on U.S.-China trade talks before the August 1 deadline, with officials seeking an extension to the tariff truce. In…",
    "link": "https://economictimes.indiatimes.com/markets/commodities/news/gold-holds-steady-ahead-of-fed-policy-statement/articleshow/122986849.cms",
    "timestamp": "2025-07-30T02:14:56Z"
  },
  {
    "title": "Louisiana GOP senator's office asked ICE to release Marine Corps veteran's wife",
    "description": "The wife of a Marine Corps veteran detained by U.S. Immigration and Customs Enforcement for months has been released following advocacy from the office of Republican Sen. John Kennedy of Louisiana",
    "link": "https://abcnews.go.com/US/wireStory/louisiana-gop-senators-office-asked-ice-release-marine-124187754",
    "timestamp": "2025-07-30T02:14:21Z"
  },
  {
    "title": "US Fed Set To Hold Firm Against Trump Pressure",
    "description": "The US central bank is expected to defy political pressure and keep interest rates unchanged Wednesday at the end of a two-day policy meeting, as the effects of President Donald Trump's tariffs emerge.",
    "link": "https://www.ibtimes.com/us-fed-set-hold-firm-against-trump-pressure-3779776",
    "timestamp": "2025-07-30T02:12:22Z"
  },
  {
    "title": "Trump's MAGA Base Defies Conservative Pro-Israel Doctrine",
    "description": "Unconditional support for Israel has long been an entry requirement in US Republican politics, but that orthodoxy is being challenged by Donald Trump's populist base -- where invocations of the \"special relationship\" are falling on deaf ears.",
    "link": "https://www.ibtimes.com/trumps-maga-base-defies-conservative-pro-israel-doctrine-3779773",
    "timestamp": "2025-07-30T02:12:21Z"
  },
  {
    "title": "Trump tells Sen. Chuck Grassley to ‘step up,’ get rid of ‘ridiculous custom’ holding up judicial appointments",
    "description": "President Trump urged Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa) on Tuesday to “step up” and end a “ridiculous custom” that allows senators to block judicial nominees for courts in their states.",
    "link": "https://nypost.com/2025/07/29/us-news/trump-tells-sen-chuck-grassley-to-step-up-get-rid-of-ridiculous-custom-holding-up-judicial-appointments/",
    "timestamp": "2025-07-30T02:12:08Z"
  },
  {
    "title": "US Equities close lower as earnings weigh; Fed statement on tap",
    "description": "U.S. stocks closed lower on Tuesday, with the S&P 500 and Nasdaq pulling back from record highs due to disappointing corporate earnings. UnitedHealth and Boeing dragged down the Dow after their quarterly results. Investors are awaiting the Federal Reserve's p…",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-equities-close-lower-as-earnings-weigh-fed-statement-on-tap/articleshow/122986811.cms",
    "timestamp": "2025-07-30T02:11:43Z"
  },
  {
    "title": "CNBC Daily Open: Boomerang tariffs ahead?",
    "description": "The much-anticipated U.S.-China trade talks in Sweden turned out to be a letdown after it concluded Tuesday with no trade truce extension.",
    "link": "https://www.cnbc.com/2025/07/30/the-art-of-no-deal-boomerang-tariffs-ahead-for-china.html",
    "timestamp": "2025-07-30T02:11:17Z"
  },
  {
    "title": "Trump Fumes Over 'Loser' Fox News Host Moments After Her NYC Shooting Take",
    "description": "Trump took to social media to weigh in on Jessica Tarlov after she named what wouldn't be \"a bad thing to do\" following the Manhattan massacre.",
    "link": "https://www.huffpost.com/entry/donald-trump-fox-news-jessica-tarlov-nyc-mass-shootin_n_68894b06e4b08681ba5e957c",
    "timestamp": "2025-07-30T02:11:07Z"
  },
  {
    "title": "Trump dismisses UK push for Palestinian state, focuses on Gaza aid",
    "description": "President Trump says the US has “no view” on recognizing a Palestinian state, denies discussing the issue with UK PM Starmer.",
    "link": "https://www.israelnationalnews.com/news/412462",
    "timestamp": "2025-07-30T02:10:10Z"
  },
  {
    "title": "Starvation, hunger vs bombs and bullets",
    "description": "By Rabi Raj Thapa During 10 years of armed conflict, Nepal became a pilgrimage and laboratory for global peace advocates, […]\nThe post Starvation, hunger vs bombs and bullets appeared first on Peoples' Review.",
    "link": "https://mypeoplesreview.com/2025/07/30/starvation-hunger-vs-bombs-and-bullets/",
    "timestamp": "2025-07-30T02:07:00Z"
  },
  {
    "title": "US Senate confirms Susan Monarez as CDC director",
    "description": "Susan Monarez was confirmed as director of the United Nations Centers for Disease Control and Prevention (CDC) in a 52-47 Senate vote.\nPresident Donald Trump nominated Monarez after withdrawing his i...",
    "link": "https://biztoc.com/x/e0152474ecc26636",
    "timestamp": "2025-07-30T02:06:59Z"
  },
  {
    "title": "As US grapples with China relations, Taiwan's president scraps stop on American soil",
    "description": "The Associated Press has learned that the Taiwanese government has called off a plan for its president to transit through the United States on his way to Latin America",
    "link": "https://abcnews.go.com/US/wireStory/us-grapples-china-relations-taiwans-president-scraps-stop-124190010",
    "timestamp": "2025-07-30T02:06:18Z"
  },
  {
    "title": "US Fed set to hold firm against Trump pressure",
    "description": "The US central bank is expected to defy political pressure and keep interest rates unchanged Wednesday at the end of a two-day policy meeting, as the effects...",
    "link": "https://finance.yahoo.com/news/us-fed-set-hold-firm-020558927.html",
    "timestamp": "2025-07-30T02:05:58Z"
  },
  {
    "title": "U.S. Senate confirms former Trump lawyer Emil Bove as federal judge, despite whistleblower concerns",
    "description": "The U.S. Senate on Tuesday confirmed President Donald Trump's former personal lawyer Emil Bove as a federal judge, installing a Trump loyalist who presided over a tumultuous period at the Justice Department on a crucial appeals court.",
    "link": "https://www.cbc.ca/news/world/trump-lawyer-emil-bove-judge-approved-1.7597010",
    "timestamp": "2025-07-30T02:05:07Z"
  },
  {
    "title": "Trump tells Chuck Grassley to have 'courage' in moving judicial noms without Dems (Politico)",
    "description": "Politico:\nTrump tells Chuck Grassley to have ‘courage’ in moving judicial noms without Dems  —  President Donald Trump is seeking to pressure Senate Judiciary Chair Chuck Grassley to ram through more judicial nominees without buy-in from home-state Democratic…",
    "link": "https://www.memeorandum.com/250729/p159",
    "timestamp": "2025-07-30T02:05:00Z"
  },
  {
    "title": "Senate Democrats Go to Battle Against Each Other",
    "description": "The Democratic Party has searched for a central message to get behind and potential leaders to emerge on the heels of the 2024 election loss.",
    "link": "https://www.newsweek.com/senate-democrats-go-battle-against-each-other-2106065",
    "timestamp": "2025-07-30T02:02:37Z"
  },
  {
    "title": "Trump gets tariffs; Americans get price hikes",
    "description": "U.S. President Trump's tariffs are prompting companies like Procter & Gamble to raise prices on consumer goods, impacting everyday shoppers. P&G plans to increase prices on about a quarter of its U.S. products to offset tariff costs.",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/trump-gets-tariffs-americans-get-price-hikes/articleshow/122986723.cms",
    "timestamp": "2025-07-30T02:00:41Z"
  },
  {
    "title": "Five Products To Be Hit By Trump's Incoming Tariffs",
    "description": "The United States is set to raise tariffs on dozens of trading partners Friday if they fail to reach accords with President Donald Trump to avert the higher rates, and this risks raising prices for consumers.",
    "link": "https://www.ibtimes.com/five-products-hit-trumps-incoming-tariffs-3779771",
    "timestamp": "2025-07-30T02:00:28Z"
  },
  {
    "title": "US, India To Launch Powerful Earth-monitoring Satellite",
    "description": "A formidable new radar satellite jointly developed by the United States and India is set to launch Wednesday, designed to track subtle changes in Earth's land and ice surfaces and help predict both natural and human-caused hazards.",
    "link": "https://www.ibtimes.com/us-india-launch-powerful-earth-monitoring-satellite-3779768",
    "timestamp": "2025-07-30T02:00:26Z"
  },
  {
    "title": "Lawyer who urged administration to ignore court orders given lifetime appointment to federal judiciary",
    "description": "Welcome the cross of Roy Cohn and Eddie Munster to the Article III courts: Emil Bove, President Donald Trump’s former criminal defense attorney, has been confirmed to a lifetime seat on the Third Circuit Court of Appeals — the culmination of a tumultuous camp…",
    "link": "https://www.lawyersgunsmoneyblog.com/2025/07/lawyer-who-urged-administration-to-ignore-court-orders-given-lifetime-appointment-to-federal-judiciary",
    "timestamp": "2025-07-30T02:00:01Z"
  },
  {
    "title": "Conservatives Freak Out Over 'Fantastic 4' Star",
    "description": "Pedro Pascal might be making his box office debut as a Marvel superhero in “The Fantastic Four: First Steps,” but he didn’t need to slip into spandex to become the leftist hero the right hates to see coming.\nAs a matter of fact, the 50-year-old “babygirl”—an …",
    "link": "https://crooksandliars.com/2025/07/conservatives-freak-out-over-fantastic-4",
    "timestamp": "2025-07-30T02:00:01Z"
  },
  {
    "title": "US second quarter GDP growth to reflect tariff turbulence",
    "description": "US economic growth is poised for a temporary upswing in the second quarter, driven by trade adjustments to circumvent President Trump's tariffs. While a 2.5 percent annualized expansion is expected, this rebound is unsustainable due to tariff-induced cost pre…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/us-second-quarter-gdp-growth-to-reflect-tariff-turbulence/articleshow/122986712.cms",
    "timestamp": "2025-07-30T01:58:55Z"
  },
  {
    "title": "Five products to be hit by Trump's incoming tariffs",
    "description": "The United States is set to raise tariffs on dozens of trading partners Friday if they fail to reach accords with President Donald Trump to avert the higher ...",
    "link": "https://finance.yahoo.com/news/five-products-hit-trumps-incoming-015825825.html",
    "timestamp": "2025-07-30T01:58:25Z"
  },
  {
    "title": "'Chilling': Whistleblowers afraid to come forward over GOP senator's shocking reversal",
    "description": "Sen. Chuck Grassley (R-IA) built a reputation over his career in the Senate for urging government whistleblowers to come forward and reveal corruption and misconduct to Congress. But now he has done precisely the opposite with President Donald Trump's nominat…",
    "link": "https://www.rawstory.com/chuck-grassley-2673782641/",
    "timestamp": "2025-07-30T01:58:02Z"
  },
  {
    "title": "Senate confirms Trump lawyer Emil Bove for appeals court, pushing past whistleblower claims",
    "description": "The Senate confirmed former Trump lawyer Emil Bove for a lifetime appointment as a federal appeals court judge. The 50-49 vote comes despite Democratic attempts to stop the nomination.",
    "link": "https://roanoke.com/news/nation-world/government-politics/article_15dfe032-52f7-562f-8bfb-e68c46b9fba3.html",
    "timestamp": "2025-07-30T01:58:00Z"
  },
  {
    "title": "US Second Quarter GDP Growth To Reflect Tariff Turbulence",
    "description": "US economic growth is expected to rebound in the second quarter, analysts said, in a momentary comeback reflecting trade shifts as companies tried to avoid the harshest of President Donald Trump's wide-ranging tariffs.",
    "link": "https://www.ibtimes.com/us-second-quarter-gdp-growth-reflect-tariff-turbulence-3779765",
    "timestamp": "2025-07-30T01:51:19Z"
  },
  {
    "title": "As China advances and the U.S. retreats, Japan-India ties grow stronger",
    "description": "Located on two ends of the Indo-Pacific region, India and Japan anchor a stable counterweight to China and a mercurial Trump.",
    "link": "https://www.japantimes.co.jp/commentary/2025/07/30/japan/japan-and-india-forge-stronger-ties/",
    "timestamp": "2025-07-30T01:50:00Z"
  },
  {
    "title": "Joe Rogan Calls Out 'Crazy' Trump Administration Move",
    "description": "The popular podcaster went after the Trump administration for what he called a \"f***ing crazy\" move.",
    "link": "https://www.newsweek.com/joe-rogan-trump-immigration-foreign-students-deportation-2106038",
    "timestamp": "2025-07-30T01:45:59Z"
  },
  {
    "title": "Food Prices Will Rise Under Trump, Group Warns",
    "description": "President Donald Trump's tariffs, scheduled to increase on August 1, could result in significantly higher prices for a range of food groups. This is according to an analysis published Monday by the bipartisan Tax Foundation, which found that these will impact…",
    "link": "https://freerepublic.com/focus/f-news/4331539/posts",
    "timestamp": "2025-07-30T01:44:43Z"
  },
  {
    "title": "IMF upgrades economic outlook and US consumer sentiment improves",
    "description": "New economic data shows signs of resiliency with tariff uncertainty still causing concerns.A batch of new economic indicators was released Tuesday in addition to a new report from the International Monetary Fund about the global economic outlook.The report an…",
    "link": "https://freerepublic.com/focus/f-news/4331538/posts",
    "timestamp": "2025-07-30T01:43:46Z"
  },
  {
    "title": "Senate Confirms Emil Bove as Federal Judge",
    "description": "“The Senate voted Tuesday night to confirm Emil Bove as a federal appeals court judge, ending a contentious confirmation in which the top Justice Department official and former attorney for Donald Trump was the target",
    "link": "https://politicalwire.com/2025/07/29/senate-confirms-emil-bove-as-federal-judge/",
    "timestamp": "2025-07-30T01:42:20Z"
  },
  {
    "title": "Save the Dates: South Park Sets Return, Kelly Clarkson’s NBC Series and More",
    "description": "South Park is taking the week off — but it’s not taking it easy on Donald Trump. Following last week’s season premiere (featuring an, ahem, unflattering portrayal of President Trump), the animated comedy will return with an all-new episode next Wednesday, Aug…",
    "link": "https://tvline.com/news/south-park-donald-trump-episode-2-release-date-season-27-1235480518/",
    "timestamp": "2025-07-30T01:40:40Z"
  },
  {
    "title": "'Unconscionable': GOP under fire as Trump’s 'most alarming court pick' pushed through",
    "description": "Critics tore into Republican senators Tuesday night who ignored alarmed whistleblowers and former judges and voted to confirm a former lawyer for President Donald Trump to a lifetime judgeship on a federal appeals court.Emil Bove was nominated to the U.S. Cou…",
    "link": "https://www.rawstory.com/emil-bove-2673782748/",
    "timestamp": "2025-07-30T01:40:28Z"
  },
  {
    "title": "Hegseth Reportedly Discussed Leaving Pentagon and Running for Office",
    "description": "Secretary of Defense Pete Hegseth has discussed running for office next year in Tennessee, NBC News reported on Tuesday night.\nThe post Hegseth Reportedly Discussed Leaving Pentagon and Running for Office first appeared on Mediaite.",
    "link": "https://www.mediaite.com/politics/hegseth-reportedly-discussed-leaving-pentagon-and-running-for-office/",
    "timestamp": "2025-07-30T01:39:36Z"
  },
  {
    "title": "Senate confirms Trump lawyer Emil Bove for federal appeals court judge spot — pushing past whistleblower claims",
    "description": "A former federal prosecutor in the Southern District of New York, Bove was on Trump’s legal team during his New York hush money trial and defended Trump in the two federal criminal cases.",
    "link": "https://nypost.com/2025/07/29/us-news/senate-confirms-trump-lawyer-emil-bove-for-federal-appeals-court-judge-spot-pushing-past-whistleblower-claims/",
    "timestamp": "2025-07-30T01:39:32Z"
  },
  {
    "title": "Cory Booker Accuses Democrats Of Being Complicit With Trump In Heated Clash",
    "description": "“If we don’t stand up as Democrats, we deserve to lose,” the New Jersey senator thundered on the Senate floor on Tuesday amid debate on police legislation.",
    "link": "https://www.huffpost.com/entry/cory-booker-trump-police_n_688958dbe4b07dfa117e7714",
    "timestamp": "2025-07-30T01:37:15Z"
  },
  {
    "title": "Israel’s greatest existential threat is its own government",
    "description": "There’s no rational justification for starvation in Gaza or continuing the war. Israel’s supporters should be demanding that it end.",
    "link": "https://www.msnbc.com/opinion/msnbc-opinion/israel-gaza-starvation-netanyahu-hamas-idf-palestine-rcna221851",
    "timestamp": "2025-07-30T01:35:33Z"
  },
  {
    "title": "Trump Now “Seriously Considering” Pardon For Sean Combs Ahead Of Sentencing; White House Officially Says Nothing",
    "description": "EXCLUSIVE: Donald Trump is heavily weighing giving Sean “Diddy” Combs a full presidential pardon ahead of the convicted Bad Boy Records founder’s sentencing later this year. Nearly two months after Trump publicly entertained the notion of a Diddy pardon in an…",
    "link": "http://deadline.com/2025/07/combs-pardon-trump-seriously-considering-1236468313/",
    "timestamp": "2025-07-30T01:34:44Z"
  },
  {
    "title": "Trump Now “Seriously Considering” Pardon For Sean Combs Ahead Of Sentencing; White House Officially Says Nothing",
    "description": "EXCLUSIVE: Donald Trump is heavily weighing giving Sean “Diddy” Combs a full presidential pardon ahead of the convicted Bad Boy Records founder’s sentencing ...",
    "link": "https://deadline.com/2025/07/combs-pardon-trump-seriously-considering-1236468313/",
    "timestamp": "2025-07-30T01:34:44Z"
  },
  {
    "title": "Colorado family flees US for NEW ZEALAND over fears for their nine-year-old transgender daughter Chase",
    "description": "A Colorado family has fled the US for New Zealand over concerns their nine-year-old transgender daughter could be persecuted if they stay in America. Parents Brandon and Candace, who would not reveal their last name over safety fears, left Denver earlier this…",
    "link": "https://freerepublic.com/focus/f-news/4331534/posts",
    "timestamp": "2025-07-30T01:32:34Z"
  },
  {
    "title": "Report: 4 Victims of Deadly Manhattan Shooting Identified",
    "description": "The four victims slain by the alleged Manhattan shooter before he turned his gun on himself Monday, including a New York City police officer, have been identified.\nThe post Report: 4 Victims of Deadly Manhattan Shooting Identified appeared first on Breitbart.",
    "link": "https://www.breitbart.com/crime/2025/07/29/4-victims-deadly-manhattan-shooter-identified/",
    "timestamp": "2025-07-30T01:32:14Z"
  },
  {
    "title": "Mint Quick Edit | Buzzy in the USA: India’s smartphone exports",
    "description": "India has gained a much larger bite of America’s imports of these devices, roundly trumping China. Thank Apple. But can the iPhone company convince Trump of friend-shoring?",
    "link": "https://www.livemint.com/opinion/online-views/india-smartphone-exports-apple-manufacturing-trump-trade-war-china-friend-shoring-us-tariffs-samsung-shipments-motorola-11753799570392.html",
    "timestamp": "2025-07-30T01:30:13Z"
  },
  {
    "title": "Trump said US was only country that gave aid to Gaza for food. Here are the facts",
    "description": "A video of the statements during a July meeting with EU officials sparked discussions about U.S. aid amounts and other countries' contributions.",
    "link": "https://www.snopes.com//fact-check/trumps-us-gaza-aid/",
    "timestamp": "2025-07-30T01:30:00Z"
  },
  {
    "title": "Senate Confirms Trump Lawyer Emil Bove Amid Whistleblower Claims",
    "description": "The Senate approved Emil Bove as a federal judge in the United States Court of Appeals for the Third Circuit.",
    "link": "http://www.rollingstone.com/politics/politics-news/senate-confirms-trump-lawyer-emil-bove-whistleblower-claims-1235396618/",
    "timestamp": "2025-07-30T01:27:18Z"
  },
  {
    "title": "Trump says he fell out with Epstein because he was taking Mar-a-Lago spa staff",
    "description": "U.S. President Donald Trump gave some of his most expansive public comments yet about his falling out with Jeffrey Epstein.",
    "link": "https://www.japantimes.co.jp/news/2025/07/30/world/politics/trump-epstein-mar-a-lago-spa-staff/",
    "timestamp": "2025-07-30T01:27:00Z"
  },
  {
    "title": "In Winnipeg, U.S. ambassador to Canada issues warning not to overlook cross-border ties",
    "description": "The U.S. ambassador to Canada warned businesspeople and political leaders inside a Winnipeg auditorium Tuesday not to \"bet against America\" as group of demonstrators outside the venue protested his presence in the Manitoba capital.",
    "link": "https://www.cbc.ca/news/canada/manitoba/us-ambassador-winnipeg-visit-1.7596547",
    "timestamp": "2025-07-30T01:26:42Z"
  },
  {
    "title": "Sen. Cory Booker in angry outburst says 'complicit' Democrats need a 'wake-up call'",
    "description": "In a rare public outburst on the Senate floor Tuesday, New Jersey Sen_ Cory Booker took his Democratic colleagues to task, saying the party “needs a wake up call!”",
    "link": "https://abcnews.go.com/Politics/wireStory/sen-cory-booker-angry-outburst-complicit-democrats-wake-124191274",
    "timestamp": "2025-07-30T01:26:29Z"
  },
  {
    "title": "The Middle Class Is Thriving Under Trump; Many Just Don’t Know It",
    "description": "The economy is roaring, so why is Trump’s approval not soaring?When asked to identify their station in life, 31% of Americans said they consider themselves working class, 12% lower class, and 2% upper class, according to the Pew Research Center. That leaves a…",
    "link": "https://freerepublic.com/focus/f-news/4331532/posts",
    "timestamp": "2025-07-30T01:25:20Z"
  },
  {
    "title": "Senate confirms Emil Bove to Third Circuit, as Dems fail to thwart Trump pick",
    "description": "Emil Bove, President Donald Trump’s former criminal defense attorney, has been confirmed to a lifetime seat on the Third Circuit Court of Appeals — the culmination of a tumultuous campaign from his detractors that ultimately fractured his support among the Se…",
    "link": "https://biztoc.com/x/9e7a98e7d32d6290",
    "timestamp": "2025-07-30T01:22:37Z"
  },
  {
    "title": "‘Reliable’ Canada will win race to bring LNG to Asian markets: B.C. Premier David Eby",
    "description": "KITAMAAT VILLAGE — British Columbia Premier David Eby says Canadian values will help the country “win this race” to deliver liquefied natural gas to Asian markets, even as U.S. President Donald Trump sets his sights on developing the industry in Alaska. \n Eby…",
    "link": "https://biztoc.com/x/df238ccac15c96ac",
    "timestamp": "2025-07-30T01:22:34Z"
  },
  {
    "title": "Gunman who killed 4 in NYC building blamed NFL for mental health issues and was targeting its office",
    "description": "In New York, Shane Tamura fatally shot four individuals in a Manhattan building. Tamura, a casino security worker, blamed the NFL for his mental health issues. He carried a note citing CTE and NFL's alleged concealment of brain injury risks. Among the decease…",
    "link": "https://economictimes.indiatimes.com/news/international/global-trends/gunman-who-killed-4-in-nyc-building-blamed-nfl-for-mental-health-issues-and-was-targeting-its-office/articleshow/122986298.cms",
    "timestamp": "2025-07-30T01:19:27Z"
  },
  {
    "title": "Trump pick Emil Bove confirmed as federal judge after furious Democrat walkout, whistleblower complaints",
    "description": "The Senate voted to confirm Emil Bove as a federal judge despite Democratic opposition and whistleblower complaints about his conduct at the Department of Justice.",
    "link": "https://www.foxnews.com/politics/trump-pick-emil-bove-confirmed-federal-judge-after-furious-democrat-walkout-whistleblower-complaints",
    "timestamp": "2025-07-30T01:11:48Z"
  },
  {
    "title": "Sen. Cory Booker Lashes Out at Democrats, Calls for Them to 'Have a Backbone'",
    "description": "Sen. Cory Booker (D-NJ) lashed out at the Democrat Party while speaking from the Senate floor, stating that his fellow Democrats were \"complicit\" in helping President Donald Trump's agenda, and noting that it was \"time for Democrats to have a backbone.\"\nThe p…",
    "link": "https://www.breitbart.com/politics/2025/07/29/sen-cory-booker-lashes-out-at-democrats-calls-for-them-to-have-a-backbone/",
    "timestamp": "2025-07-30T01:11:13Z"
  },
  {
    "title": "Trump tells Chuck Grassley to have 'courage' in moving judicial noms without Dems",
    "description": "President Donald Trump is seeking to pressure Senate Judiciary Chair Chuck Grassley to ram through more judicial nominees without buy-in from home-state Democratic senators. \n“Chuck Grassley, who I got re-elected to the U.S. Senate when he was down, by a lot,…",
    "link": "https://biztoc.com/x/b2e36eb32f851754",
    "timestamp": "2025-07-30T01:11:08Z"
  },
  {
    "title": "Trump Is Mad People Are Linking Him To 'Late Show' Cancellation",
    "description": "Stephen Colbert was fired because of a \"pure lack of TALENT,\" the president insisted.",
    "link": "https://www.huffpost.com/entry/trump-colbert-late-show-cancellation_n_688946cee4b08681ba5e919d",
    "timestamp": "2025-07-30T01:10:52Z"
  },
  {
    "title": "New CDC Director confirmed in first ever Senate vote",
    "description": "Susan Monarez was confirmed to lead the U.S. Centers for Disease Control and Prevention.",
    "link": "https://www.fox5atlanta.com/news/new-cdc-director-confirmed-senate-vote",
    "timestamp": "2025-07-30T01:10:36Z"
  },
  {
    "title": "Florida has executed more people than any other state this year, with 3 set to die over next month",
    "description": "Florida has three executions set to take place over the next month, including man convicted of fatally shooting three people and wounding another person was added to the queue",
    "link": "https://abcnews.go.com/US/wireStory/florida-executed-people-state-year-3-set-die-124190667",
    "timestamp": "2025-07-30T01:09:59Z"
  },
  {
    "title": "PRAYER REQUESTS - 7/29/2025 [PRAYER]",
    "description": "Welcome to the PRAYER REQUESTS thread. This daily thread is a listing of prayer requests that have been posted by Freepers to the main forum who wish to have continued prayer. Hopefully this thread will remind us to continually pray for our fellow Freepers’ c…",
    "link": "https://freerepublic.com/focus/f-religion/4331526/posts",
    "timestamp": "2025-07-30T01:09:35Z"
  },
  {
    "title": "FireAid Hires Law Firm to Review How It Distributed $100 Million as Trump Calls for Investigation",
    "description": "The comprehensive review follows heightened criticism from right-wing politicians over how the wildfire relief org distributed its funds\nThe post FireAid Hires Law Firm to Review How It Distributed $100 Million as Trump Calls for Investigation appeared first …",
    "link": "https://www.thewrap.com/fireaid-lawfirm-wildfire-recovery-fund-distribution-review/",
    "timestamp": "2025-07-30T01:07:04Z"
  },
  {
    "title": "Former Russian President Issues Threat of War With U.S.",
    "description": "Russia is not Iran. Former Russian President Dmitry Medvedev directed this reminder to President Donald Trump on Monday in a social media post. Medvedev, who now serves as deputy chairman of the Russian Security Council, issued what appears to be a not-so-vei…",
    "link": "https://freerepublic.com/focus/f-news/4331524/posts",
    "timestamp": "2025-07-30T01:06:08Z"
  },
  {
    "title": "'Deals working out very well': Trump on India-US trade deal, hints at 20-25 per cent tariff",
    "description": "Amidst trade negotiations, President Trump hinted at potential tariffs on India, despite acknowledging their friendly relations and ongoing trade discussions. He claimed India imposed higher tariffs than other nations, asserting his intention to address this.",
    "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/deals-working-out-very-well-trump-on-india-us-trade-deal-hints-at-20-25-per-cent-tariff/articleshow/122986087.cms",
    "timestamp": "2025-07-30T01:05:03Z"
  },
  {
    "title": "Senate Confirms Emil Bove, Trump's ‘Enforcer,’ To A Lifetime Federal Judgeship",
    "description": "Bove faced credible allegations of telling DOJ attorneys to defy court orders. Republicans confirmed him to a seat on a U.S. appeals court anyway.",
    "link": "https://www.huffpost.com/entry/senate-confirms-emil-bove-trump-judge_n_6883c652e4b09c928ae1cea0",
    "timestamp": "2025-07-30T01:04:50Z"
  },
  {
    "title": "\"If PM Modi has courage of Indira Gandhi, let him say Donald Trump is a liar\": Rahul Gandhi in Lok Sabha",
    "description": "Rahul Gandhi, a Congress MP, criticized Prime Minister Narendra Modi in Parliament. He questioned Modi's silence on Donald Trump's ceasefire claims. Gandhi also attacked India's foreign policy after the Pahalgam terror attack. He referred to General Asim Muni…",
    "link": "https://economictimes.indiatimes.com/news/politics-and-nation/if-pm-modi-has-courage-of-indira-gandhi-let-him-say-donald-trump-is-a-liar-rahul-gandhi-in-lok-sabha/articleshow/122986076.cms",
    "timestamp": "2025-07-30T01:04:11Z"
  },
  {
    "title": "Republicans confirm former Trump lawyer Emil Bove to lifetime appeals court perch",
    "description": "Senate Republicans backed Bove despite allegations from three whistleblowers about his conduct as an official at the Justice Department.",
    "link": "https://www.nbcnews.com/politics/congress/senate-confirms-trump-nominee-emil-bove-appeals-court-whistleblowers-rcna221781",
    "timestamp": "2025-07-30T01:04:07Z"
  },
  {
    "title": "Oil Holds Large Gain As Trump Amps Up Truce Pressure On Russia",
    "description": "Oil held the biggest gain in six weeks after US President Donald Trump reiterated he may impose additional economic penalties on Russia unless a truce is reached with Ukraine.",
    "link": "https://www.ndtvprofit.com/markets/crude-oil-market-july-30-check-brent-wti-prices",
    "timestamp": "2025-07-30T01:03:48Z"
  },
  {
    "title": "Trump says Epstein 'stole' young women from Mar-a-Lago spa, including Virginia Giuffre",
    "description": "President Donald Trump says Jeffrey Epstein “stole” young women who worked at Mar-a-Lago, including Virginia Giuffre, one of the disgraced financier's most well-known accusers",
    "link": "https://abcnews.go.com/Politics/wireStory/trump-epstein-stole-young-women-mar-lago-spa-124182167",
    "timestamp": "2025-07-30T01:02:24Z"
  },
  {
    "title": "Asian shares mixed at open before Fed’s meeting",
    "description": "Asian equities displayed mixed performance ahead of the Federal Reserve's policy decision, with limited impact from US-China trade talks. The US and China are continuing negotiations regarding a tariff truce, while Trump hinted at potential tariffs on India.",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-mixed-at-open-before-feds-meeting/articleshow/122986042.cms",
    "timestamp": "2025-07-30T01:01:34Z"
  },
  {
    "title": "Political analyst says Democrats are already worried about the 'big problem' of winning back voters for 2028",
    "description": "Political analyst Mark Halperin said the Democratic Party largely \"remains clueless\" about how to address its record-low approval ratings ahead of future elections.",
    "link": "https://www.foxnews.com/media/political-analyst-says-democrats-already-worried-about-big-problem-winning-back-voters-2028",
    "timestamp": "2025-07-30T01:00:59Z"
  },
  {
    "title": "Scriptnotes, Episode 694: Reviving the Spoof Movie, Transcript",
    "description": "The original post for this episode can be found here. John August: Hey, this is John, a standard warning for people who are in the car with their kids. There’s some swearing in this episode. Hello, and welcome. My name is John August, and you’re listening to …",
    "link": "https://johnaugust.com/2025/scriptnotes-episode-694-reviving-the-spoof-movie-transcript",
    "timestamp": "2025-07-30T00:58:16Z"
  },
  {
    "title": "NYC mayor shares Midtown shooting surveillance footage details, calls for gun reform",
    "description": "NYC Mayor Eric Adams shared new details about the deadly Midtown Manhattan office shooting, including a possible NFL connection and the gunman's cross-country journey.",
    "link": "https://abcnews.go.com/US/nyc-mayor-eric-adams-shares-midtown-shooting-surveillance/story?id=124183728",
    "timestamp": "2025-07-30T00:49:01Z"
  },
  {
    "title": "Fragile Thailand-Cambodia truce faces challenges on day one",
    "description": "The military officials agreed at a meeting not to target civilians or deploy more troops along the border,",
    "link": "https://www.japantimes.co.jp/news/2025/07/30/asia-pacific/politics/thailand-cambodia-truce-challenges/",
    "timestamp": "2025-07-30T00:45:00Z"
  },
  {
    "title": "Josh Hawley proposes $600 rebate checks — but not for ‘Biden voters’",
    "description": "U.S. Sen. Josh Hawley (R-MO) says the legislation he is filing to send $600 tariff rebate checks to Americans are not for “Biden voters,” but for “Trump blue-collar voters.”“Well, you wouldn’t give it to everybody, you’d give it to the working people,” Senato…",
    "link": "https://www.rawstory.com/josh-hawley-2673782305/",
    "timestamp": "2025-07-30T00:44:56Z"
  },
  {
    "title": "Trump says Epstein ‘stole’ Giuffre and other young women from Mar-a-Lago spa",
    "description": "Virginia Giuffre was among the disgraced financier’s most well-known sex trafficking accusers.",
    "link": "https://7news.com.au/news/trump-says-epstein-stole-giuffre-and-other-young-women-from-mar-a-lago-spa-c-19519065",
    "timestamp": "2025-07-30T00:44:27Z"
  },
  {
    "title": "NYT Admits Famine Photo Hoax: Gaza Child Had 'Pre-Existing Health Problems'",
    "description": "The New York Times admitted Tuesday that an emaciated Palestinian child it featured on the the front page suffered from \"pre-existing health problems\" that it had presented, inaccurately, as the result of starvation.\nThe post NYT Admits Famine Photo Hoax: Gaz…",
    "link": "https://www.breitbart.com/the-media/2025/07/29/nyt-admits-famine-photo-hoax-gaza-child-had-pre-existing-health-problems/",
    "timestamp": "2025-07-30T00:43:27Z"
  },
  {
    "title": "Wounded vet confirmed to Veterans Affairs role as GOP slams Dems for slow-walking Trump picks",
    "description": "Nevada GOP Senate candidate Sam Brown received a bipartisan green light from the Senate to oversee the National Cemetery Administration.",
    "link": "https://www.foxnews.com/politics/wounded-vet-confirmed-veterans-affairs-role-gop-slams-dems-slow-walking-trump-picks",
    "timestamp": "2025-07-30T00:41:49Z"
  },
  {
    "title": "Cargo surge amid tariff turmoil drives the Port of Savannah to its 2nd busiest year",
    "description": "The Savannah port moved 5.7 million container units of imports and exports across its docks in the 2025 fiscal year that ended June 30.",
    "link": "https://www.wsbtv.com/news/local/atlanta/cargo-surge-amid-tariff-turmoil-drives-port-savannah-its-2nd-busiest-year/45OPPAD7TJBZFFON5BOBJI4Q4A/",
    "timestamp": "2025-07-30T00:35:43Z"
  },
  {
    "title": "Trump flies back to the US after whirlwind trip to Scotland - BBC",
    "description": "Trump flies back to the US after whirlwind trip to ScotlandBBC 'Scotland is already great.' Protesters troll Trump on his golfing tripNPR Trump caps his Scottish visit by opening a new golf course and promoting his family brandAP News Live updates: Donald Tru…",
    "link": "https://slashdot.org/firehose.pl?op=view&amp;id=178508466",
    "timestamp": "2025-07-30T00:34:53Z"
  }
]